{
  "url": "https://finance.yahoo.com/news/wabash-max-shares-falling-know-185612618.html",
  "authorsByline": "Adam Hejl",
  "articleId": "d5b82af27f254bc58041f4dd1ff05f7d",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://s.yimg.com/ny/api/res/1.2/m.H1UrKyHq9krhGOI_VzKg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02MDA-/https://media.zenfs.com/en/stockstory_922/35ea11be1c856afe932939d0a3a65cec",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-20T18:56:12+00:00",
  "addDate": "2025-08-20T19:19:07.195563+00:00",
  "refreshDate": "2025-08-20T19:19:07.195565+00:00",
  "score": 1.0,
  "title": "Wabash and RE/MAX Shares Are Falling, What You Need To Know",
  "description": "A number of stocks fell in the afternoon session after the major indices continued to pull back, with technology stocks accounting for most of the market's largest decliners. A key reason for this trend is that much of the recent market gains were concentrated in the \"AI trade,\" which includes these large technology and semiconductor companies. So this could also mean that some investors are locking in some gains ahead of more definitive feedback from the Fed.",
  "content": "A number of stocks fell in the afternoon session after the major indices continued to pull back, with technology stocks accounting for most of the market's largest decliners. A key reason for this trend is that much of the recent market gains were concentrated in the \"AI trade,\" which includes these large technology and semiconductor companies. So this could also mean that some investors are locking in some gains ahead of more definitive feedback from the Fed.\n\nDespite the downturn, some analysts viewed this as an opportunity to own some of the \"Core AI winners.\" Dan Ives of Wedbush Securities commented, \"In our view, the tech bull cycle will be well intact for at least another 2-3 years, given the trillions being spent on AI infrastructure/software/chips/power/apps looking ahead. This remains our tech playbook and investor roadmap.\" Additionally, mixed earnings reports from retailers, such as Target, have added to the market's weakness. Investors are closely monitoring these reports for insights into the broader economic health and the potential impact of new tariffs on inflation.\n\nThe stock market overreacts to news, and big price drops can present good opportunities to buy high-quality stocks.\n\nAmong others, the following stocks were impacted:\n• Heavy Transportation Equipment company Wabash (NYSE:WNC) fell 5.1%. Is now the time to buy Wabash? Access our full analysis report here, it’s free.\n• Real Estate Services company RE/MAX (NYSE:RMAX) fell 4.6%. Is now the time to buy RE/MAX? Access our full analysis report here, it’s free.\n\nWabash’s shares are extremely volatile and have had 32 moves greater than 5% over the last year. In that context, today’s move indicates the market considers this news meaningful but not something that would fundamentally change its perception of the business.\n\nThe previous big move we wrote about was 6 days ago when the stock dropped 3.1% on the news that an unexpectedly sharp rise in wholesale inflation fueled concerns about rising costs and their impact on corporate profits. The primary catalyst was the July 2025 Producer Price Index (PPI), a measure of inflation at the wholesale level, which jumped 0.9% against forecasts of a 0.2% rise. This represents the most significant monthly increase in over three years, pointing to mounting cost pressures for manufacturers, with tariffs cited as a key factor. This data complicates the Federal Reserve's upcoming interest rate decisions, as persistent inflation may prevent rate cuts, creating a headwind for cyclical sectors like Industrials.",
  "medium": "Article",
  "links": [
    "https://stockstory.org/us/stocks/nyse/wnc?utm_source=whyItMovesArticle&utm_medium=yahoo&utm_campaign=GROUP_0&utm_article=CF5waWkHZkI%3D&utm_ticker=WNC",
    "https://stockstory.org/us/stocks/nyse/rmax?utm_source=whyItMovesArticle&utm_medium=yahoo&utm_campaign=GROUP_1&utm_article=CF5waWkHZkI%3D&utm_ticker=WNC"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "technology stocks",
      "weight": 0.07659172
    },
    {
      "name": "wholesale inflation",
      "weight": 0.070305735
    },
    {
      "name": "stocks",
      "weight": 0.06732718
    },
    {
      "name": "Heavy Transportation Equipment company Wabash",
      "weight": 0.066068344
    },
    {
      "name": "persistent inflation",
      "weight": 0.064542174
    },
    {
      "name": "mixed earnings reports",
      "weight": 0.06344808
    },
    {
      "name": "mounting cost pressures",
      "weight": 0.061210636
    },
    {
      "name": "inflation",
      "weight": 0.05962432
    },
    {
      "name": "good opportunities",
      "weight": 0.05735993
    },
    {
      "name": "big price drops",
      "weight": 0.05686027
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Finance"
    },
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.98828125
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.97607421875
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.93359375
    }
  ],
  "sentiment": {
    "positive": 0.03505173,
    "negative": 0.8796124,
    "neutral": 0.085335925
  },
  "summary": "A number of stocks fell in the afternoon session, with technology stocks accounting for most of the market's largest decliners. This could be due to the recent focus on the \"AI trade,\" which includes large technology and semiconductor companies. Despite the downturn, some analysts believe this could be an opportunity to own some of the \"Core AI winners\". The decline was largely due to mixed earnings reports from retailers such as Target and the potential impact of new tariffs on inflation. The Producer Price Index (PPI), a measure of inflation at the wholesale level, jumped 0.9% against forecasts of 0.2% and indicated mounting cost pressures for manufacturers.",
  "shortSummary": "A number of stocks fell as the major indices continued to pull back, with technology stocks leading the charge, amid concerns over inflation and mixed earnings reports.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "75f3469c1a78492cb0b1e46e9c3a694c",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://stockstory.org/us/stocks/nyse/wnc?utm_source=whyItMovesArticle&utm_medium=yahoo&utm_campaign=GROUP_0&utm_article=CF5waWkHZkI%3D&utm_ticker=WNC",
      "text": "Wabash (WNC)\nWabash is up against the odds. Not only are its sales cratering but also its low returns on capital suggest it struggles to generate profits.― StockStory Analyst Team\n1. News\n2. Summary\nWhy We Think Wabash Will Underperform\nWith its first trailer reportedly built on two sawhorses, Wabash (NYSE:WNC) offers semi trailers, liquid transportation containers, truck bodies, and equipment for moving goods.\n- Products and services are facing significant end-market challenges during this cycle as sales have declined by 1.8% annually over the last five years\n- Earnings per share decreased by more than its revenue over the last five years, showing each sale was less profitable\n- 8× net-debt-to-EBITDA ratio shows it’s overleveraged and increases the probability of shareholder dilution if things turn unexpectedly\nWhy There Are Better Opportunities Than Wabash\nHigh Quality\nInvestable\nUnderperform\nWhy There Are Better Opportunities Than Wabash\nWabash’s stock price of $10.88 implies a valuation ratio of 14.5x forward P/E. Wabash’s valuation may seem like a bargain, especially when stacked up against other industrials companies. We remind you that you often get what you pay for, though.\nOur advice is to pay up for elite businesses whose advantages are tailwinds to earnings growth. Don’t get sucked into lower-quality businesses just because they seem like bargains. These mediocre businesses often never achieve a higher multiple as hoped, a phenomenon known as a “value trap”.\n3. Wabash (WNC) Research Report: Q2 CY2025 Update\nSemi trailers and liquid transportation container manufacturer Wabash (NYSE:WNC) reported revenue ahead of Wall Street’s expectations in Q2 CY2025, but sales fell by 16.7% year on year to $458.8 million. On the other hand, the company’s full-year revenue guidance of $1.6 billion at the midpoint came in 6.5% below analysts’ estimates. Its non-GAAP loss of $0.15 per share was 55.4% above analysts’ consensus estimates.\nWabash (WNC) Q2 CY2025 Highlights:\n- Revenue: $458.8 million vs analyst estimates of $433.8 million (16.7% year-on-year decline, 5.8% beat)\n- Adjusted EPS: -$0.15 vs analyst estimates of -$0.34 (55.4% beat)\n- Adjusted EBITDA: $16.32 million vs analyst estimates of $8.3 million (3.6% margin, 96.6% beat)\n- The company dropped its revenue guidance for the full year to $1.6 billion at the midpoint from $1.8 billion, a 11.1% decrease\n- Management lowered its full-year Adjusted EPS guidance to -$1.15 at the midpoint, a 91.7% decrease\n- Operating Margin: -1%, down from 7.9% in the same quarter last year\n- Free Cash Flow was -$8.25 million compared to -$6.08 million in the same quarter last year\n- Backlog: $1 billion at quarter end, down 23.1% year on year\n- Market Capitalization: $446.3 million\nCompany Overview\nWith its first trailer reportedly built on two sawhorses, Wabash (NYSE:WNC) offers semi trailers, liquid transportation containers, truck bodies, and equipment for moving goods.\nWabash was founded in 1985 by the former president of a trailer manufacturer. The company initially only offered trailers but expanded by making acquisitions, specifically, targeting small companies to enhance specific capabilities and larger companies to broaden its market reach with new offerings.\nSpecifically, the acquisitions of Walker in 2012 and Supreme Industries in 2017 were pivotal. The acquisition of Supreme Industries, known for truck bodies and specialty vehicles, enabled it to offer more new transportation containers particularly for delivery and service vehicles. On the other hand, acquiring Walker strengthened its expertise in manufacturing lightweight trailers, particularly in refrigerated transport.\nThe company started with making detachable trailers to hold cargo for trucks but now also offers truck bodies (enclosed spaces on the back of trucks), refrigerated trailers (which keeps food cold), fluid containers, and equipment for moving goods between trucks and trains which are used to transport items. Its equipment for moving goods are specifically designed to reduce the need to unload and reload goods, save time, and reduce costs. For example, it offers chassis to transport containers to and from rail yards and ports. The company also offers specialized configurations for different industries and operational requirements.\nWabash engages in direct sales and contracts with dealers and fleet operators to sell its products. These contracts often involve long-term agreements (typically three to five years) that ensure supply and service support.\n4. Heavy Transportation Equipment\nHeavy transportation equipment companies are investing in automated vehicles that increase efficiencies and connected machinery that collects actionable data. Some are also developing electric vehicles and mobility solutions to address customers’ concerns about carbon emissions, creating new sales opportunities. Additionally, they are increasingly offering automated equipment that increases efficiencies and connected machinery that collects actionable data. On the other hand, heavy transportation equipment companies are at the whim of economic cycles. Interest rates, for example, can greatly impact the construction and transport volumes that drive demand for these companies’ offerings.\nCompetitors offering similar products include Trinity (NYSE:TRN), Great Dane (private), and Utility Trailer Manufacturing (private).\n5. Revenue Growth\nA company’s long-term performance is an indicator of its overall quality. Any business can put up a good quarter or two, but the best consistently grow over the long haul. Wabash’s demand was weak over the last five years as its sales fell at a 1.8% annual rate. This was below our standards and suggests it’s a low quality business.\nWe at StockStory place the most emphasis on long-term growth, but within industrials, a half-decade historical view may miss cycles, industry trends, or a company capitalizing on catalysts such as a new contract win or a successful product line. Wabash’s recent performance shows its demand remained suppressed as its revenue has declined by 19% annually over the last two years. Wabash isn’t alone in its struggles as the Heavy Transportation Equipment industry experienced a cyclical downturn, with many similar businesses observing lower sales at this time.\nWabash also reports its backlog, or the value of its outstanding orders that have not yet been executed or delivered. Wabash’s backlog reached $1 billion in the latest quarter and averaged 36.2% year-on-year declines over the last two years. Because this number is lower than its revenue growth, we can see the company hasn’t secured enough new orders to maintain its growth rate in the future.\nThis quarter, Wabash’s revenue fell by 16.7% year on year to $458.8 million but beat Wall Street’s estimates by 5.8%.\nLooking ahead, sell-side analysts expect revenue to grow 13.1% over the next 12 months, an improvement versus the last two years. This projection is healthy and indicates its newer products and services will catalyze better top-line performance.\n6. Gross Margin & Pricing Power\nWabash has bad unit economics for an industrials business, signaling it operates in a competitive market. As you can see below, it averaged a 13.8% gross margin over the last five years. That means Wabash paid its suppliers a lot of money ($86.21 for every $100 in revenue) to run its business.\nThis quarter, Wabash’s gross profit margin was 9%, marking a 7.3 percentage point decrease from 16.3% in the same quarter last year. Wabash’s full-year margin has also been trending down over the past 12 months, decreasing by 8 percentage points. If this move continues, it could suggest deteriorating pricing power and higher input costs (such as raw materials and manufacturing expenses).\n7. Operating Margin\nWabash was profitable over the last five years but held back by its large cost base. Its average operating margin of 4.7% was weak for an industrials business. This result isn’t too surprising given its low gross margin as a starting point.\nLooking at the trend in its profitability, Wabash’s operating margin decreased by 10.2 percentage points over the last five years. Wabash’s performance was poor no matter how you look at it - it shows that costs were rising and it couldn’t pass them onto its customers.\nThis quarter, Wabash generated an operating margin profit margin of negative 1%, down 9 percentage points year on year. Since Wabash’s operating margin decreased more than its gross margin, we can assume it was less efficient because expenses such as marketing, R&D, and administrative overhead increased.\n8. Earnings Per Share\nRevenue trends explain a company’s historical growth, but the long-term change in earnings per share (EPS) points to the profitability of that growth – for example, a company could inflate its sales through excessive spending on advertising and promotions.\nSadly for Wabash, its EPS declined by 22.3% annually over the last five years, more than its revenue. This tells us the company struggled because its fixed cost base made it difficult to adjust to shrinking demand.\nDiving into the nuances of Wabash’s earnings can give us a better understanding of its performance. As we mentioned earlier, Wabash’s operating margin declined by 10.2 percentage points over the last five years. This was the most relevant factor (aside from the revenue impact) behind its lower earnings; interest expenses and taxes can also affect EPS but don’t tell us as much about a company’s fundamentals.\nLike with revenue, we analyze EPS over a more recent period because it can provide insight into an emerging theme or development for the business.\nFor Wabash, its two-year annual EPS declines of 46.1% show it’s continued to underperform. These results were bad no matter how you slice the data.\nIn Q2, Wabash reported EPS at negative $0.15, down from $0.64 in the same quarter last year. Despite falling year on year, this print easily cleared analysts’ estimates. Over the next 12 months, Wall Street is optimistic. Analysts forecast Wabash’s full-year EPS of negative $0.56 will flip to positive $0.71.\n9. Cash Is King\nAlthough earnings are undoubtedly valuable for assessing company performance, we believe cash is king because you can’t use accounting profits to pay the bills.\nWabash has shown weak cash profitability over the last five years, giving the company limited opportunities to return capital to shareholders. Its free cash flow margin averaged 3.1%, subpar for an industrials business.\nTaking a step back, we can see that Wabash’s margin dropped by 1.4 percentage points during that time. This along with its unexciting margin put the company in a tough spot, and shareholders are likely hoping it can reverse course. If the trend continues, it could signal it’s in the middle of an investment cycle.\nWabash burned through $8.25 million of cash in Q2, equivalent to a negative 1.8% margin. The company’s cash burn was similar to its $6.08 million of lost cash in the same quarter last year. These numbers deviate from its longer-term margin, indicating it is a seasonal business that must build up inventory during certain quarters.\n10. Return on Invested Capital (ROIC)\nEPS and free cash flow tell us whether a company was profitable while growing its revenue. But was it capital-efficient? A company’s ROIC explains this by showing how much operating profit it makes compared to the money it has raised (debt and equity).\nWabash historically did a mediocre job investing in profitable growth initiatives. Its five-year average ROIC was 9.3%, somewhat low compared to the best industrials companies that consistently pump out 20%+.\nWe like to invest in businesses with high returns, but the trend in a company’s ROIC is what often surprises the market and moves the stock price. Over the last few years, Wabash’s ROIC averaged 4.8 percentage point decreases each year. Paired with its already low returns, these declines suggest its profitable growth opportunities are few and far between.\n11. Balance Sheet Risk\nAs long-term investors, the risk we care about most is the permanent loss of capital, which can happen when a company goes bankrupt or raises money from a disadvantaged position. This is separate from short-term stock price volatility, something we are much less bothered by.\nWabash’s $437.5 million of debt exceeds the $57.42 million of cash on its balance sheet. Furthermore, its 7× net-debt-to-EBITDA ratio (based on its EBITDA of $52.69 million over the last 12 months) shows the company is overleveraged.\nAt this level of debt, incremental borrowing becomes increasingly expensive and credit agencies could downgrade the company’s rating if profitability falls. Wabash could also be backed into a corner if the market turns unexpectedly – a situation we seek to avoid as investors in high-quality companies.\nWe hope Wabash can improve its balance sheet and remain cautious until it increases its profitability or pays down its debt.\n12. Key Takeaways from Wabash’s Q2 Results\nThe quarter itself was fine, with EPS beating. On the other hand, the company lowered its full-year guidance, which is always a big negative. Shares traded down 6.9% to $9.95 immediately after reporting.\n13. Is Now The Time To Buy Wabash?\nUpdated: August 19, 2025 at 11:03 PM EDT\nWhen considering an investment in Wabash, investors should account for its valuation and business qualities as well as what’s happened in the latest quarter.\nWabash doesn’t pass our quality test. First off, its revenue has declined over the last five years, and analysts expect its demand to deteriorate over the next 12 months. And while its projected EPS for the next year implies the company’s fundamentals will improve, the downside is its declining EPS over the last five years makes it a less attractive asset to the public markets. On top of that, its declining operating margin shows the business has become less efficient.\nWabash’s P/E ratio based on the next 12 months is 14.5x. While this valuation is reasonable, we don’t see a big opportunity at the moment. There are superior stocks to buy right now.\nWall Street analysts have a consensus one-year price target of $12.75 on the company (compared to the current share price of $10.88).\nAlthough the price target is bullish, readers should exercise caution because analysts tend to be overly optimistic. The firms they work for, often big banks, have relationships with companies that extend into fundraising, M&A advisory, and other rewarding business lines. As a result, they typically hesitate to say bad things for fear they will lose out. We at StockStory do not suffer from such conflicts of interest, so we’ll always tell it like it is."
    },
    {
      "url": "https://stockstory.org/us/stocks/nyse/rmax?utm_source=whyItMovesArticle&utm_medium=yahoo&utm_campaign=GROUP_1&utm_article=CF5waWkHZkI%3D&utm_ticker=WNC",
      "text": "RE/MAX (RMAX)\nRE/MAX is up against the odds. Its sales have underperformed and its low returns on capital show it has few growth opportunities.― StockStory Analyst Team\n1. News\n2. Summary\nWhy We Think RE/MAX Will Underperform\nShort for Real Estate Maximums, RE/MAX (NYSE:RMAX) operates a real estate franchise network spanning over 100 countries and territories.\n- Sales tumbled by 6.1% annually over the last two years, showing consumer trends are working against its favor\n- Incremental sales over the last five years were much less profitable as its earnings per share fell by 6.7% annually while its revenue grew\n- Projected sales decline of 1.7% over the next 12 months indicates demand will continue deteriorating\nWhy There Are Better Opportunities Than RE/MAX\nHigh Quality\nInvestable\nUnderperform\nWhy There Are Better Opportunities Than RE/MAX\nRE/MAX’s stock price of $8.96 implies a valuation ratio of 6.8x forward P/E. RE/MAX’s valuation may seem like a bargain, but we think there are valid reasons why it’s so cheap.\nCheap stocks can look like a great deal at first glance, but they can be value traps. They often have less earnings power, meaning there is more reliance on a re-rating to generate good returns - an unlikely scenario for low-quality companies.\n3. RE/MAX (RMAX) Research Report: Q2 CY2025 Update\nReal estate franchise company RE/MAX (NYSE:RMAX) fell short of the market’s revenue expectations in Q2 CY2025, with sales falling 7.3% year on year to $72.75 million. Next quarter’s revenue guidance of $73.5 million underwhelmed, coming in 2.5% below analysts’ estimates. Its non-GAAP profit of $0.39 per share was 11% above analysts’ consensus estimates.\nRE/MAX (RMAX) Q2 CY2025 Highlights:\n- Revenue: $72.75 million vs analyst estimates of $73.63 million (7.3% year-on-year decline, 1.2% miss)\n- Adjusted EPS: $0.39 vs analyst estimates of $0.35 (11% beat)\n- Adjusted EBITDA: $26.27 million vs analyst estimates of $24.9 million (36.1% margin, 5.5% beat)\n- The company dropped its revenue guidance for the full year to $293 million at the midpoint from $300 million, a 2.3% decrease\n- EBITDA guidance for the full year is $92.5 million at the midpoint, below analyst estimates of $94.62 million\n- Operating Margin: 19.3%, down from 20.6% in the same quarter last year\n- Free Cash Flow Margin: 11.1%, down from 17.8% in the same quarter last year\n- Agents: 147,073, up 3,531 year on year\n- Market Capitalization: $163.3 million\nCompany Overview\nShort for Real Estate Maximums, RE/MAX (NYSE:RMAX) operates a real estate franchise network spanning over 100 countries and territories.\nRE/MAX’s business model centers around its franchise system with independent agents who work under the RE/MAX brand. This model has allowed for rapid global expansion of RE/MAX and its offerings, which include residential and commercial real estate services (buying, selling, and leasing properties).\nA strength of RE/MAX is its brand recognition and reputation for having experienced, productive agents. RE/MAX agents have access to continuous training, analytical resources, and a vast network of global listings, which enhances their ability to serve buyers and sellers effectively.\nTo maintain its relevance, RE/MAX invests in digital tools and platforms to streamline the real estate transaction process and improve the customer experience. These include proprietary software for lead management, transaction management, and marketing, as well as a global listing website.\n4. Real Estate Services\nTechnology has been a double-edged sword in real estate services. On the one hand, internet listings are effective at disseminating information far and wide, casting a wide net for buyers and sellers to increase the chances of transactions. On the other hand, digitization in the real estate market could potentially disintermediate key players like agents who use information asymmetries to their advantage.\nRE/MAX’s primary competitors are Realogy Holdings (NYSE:RLGY), Zillow (NASDAQ:ZG), Redfin (NASDAQ:RDFN), eXp World (NASDAQ:EXPI), and private companies Keller Williams Realty and Century 21 Real Estate.\n5. Revenue Growth\nA company’s long-term performance is an indicator of its overall quality. Any business can put up a good quarter or two, but many enduring ones grow for years. Regrettably, RE/MAX’s sales grew at a weak 2.6% compounded annual growth rate over the last five years. This fell short of our benchmarks and is a tough starting point for our analysis.\nLong-term growth is the most important, but within consumer discretionary, product cycles are short and revenue can be hit-driven due to rapidly changing trends and consumer preferences. RE/MAX’s performance shows it grew in the past but relinquished its gains over the last two years, as its revenue fell by 6.1% annually.\nRE/MAX also discloses its number of agents, which reached 147,073 in the latest quarter. Over the last two years, RE/MAX’s agents were flat. Because this number is higher than its revenue growth during the same period, we can see the company’s monetization has fallen.\nThis quarter, RE/MAX missed Wall Street’s estimates and reported a rather uninspiring 7.3% year-on-year revenue decline, generating $72.75 million of revenue. Company management is currently guiding for a 6.3% year-on-year decline in sales next quarter.\nLooking further ahead, sell-side analysts expect revenue to decline by 1.1% over the next 12 months. Although this projection is better than its two-year trend, it’s hard to get excited about a company that is struggling with demand.\n6. Operating Margin\nRE/MAX’s operating margin has risen over the last 12 months and averaged 4.7% over the last two years. The company’s higher efficiency is a breath of fresh air, but its suboptimal cost structure means it still sports lousy profitability for a consumer discretionary business.\nIn Q2, RE/MAX generated an operating margin profit margin of 19.3%, down 1.3 percentage points year on year. This reduction is quite minuscule and indicates the company’s overall cost structure has been relatively stable.\n7. Earnings Per Share\nRevenue trends explain a company’s historical growth, but the long-term change in earnings per share (EPS) points to the profitability of that growth – for example, a company could inflate its sales through excessive spending on advertising and promotions.\nSadly for RE/MAX, its EPS declined by 6.7% annually over the last five years while its revenue grew by 2.6%. However, its operating margin actually improved during this time, telling us that non-fundamental factors such as interest expenses and taxes affected its ultimate earnings.\nIn Q2, RE/MAX reported EPS at $0.39, down from $0.41 in the same quarter last year. Despite falling year on year, this print easily cleared analysts’ estimates. Over the next 12 months, Wall Street expects RE/MAX’s full-year EPS of $1.31 to grow 1.3%.\n8. Cash Is King\nFree cash flow isn't a prominently featured metric in company financials and earnings releases, but we think it's telling because it accounts for all operating and capital expenses, making it tough to manipulate. Cash is king.\nRE/MAX has shown impressive cash profitability, giving it the option to reinvest or return capital to investors. The company’s free cash flow margin averaged 13.1% over the last two years, better than the broader consumer discretionary sector. The divergence from its underwhelming operating margin stems from the add-back of non-cash charges like depreciation and stock-based compensation. GAAP operating profit expenses these line items, but free cash flow does not.\nRE/MAX’s free cash flow clocked in at $8.07 million in Q2, equivalent to a 11.1% margin. The company’s cash profitability regressed as it was 6.7 percentage points lower than in the same quarter last year, prompting us to pay closer attention. Short-term fluctuations typically aren’t a big deal because investment needs can be seasonal, but we’ll be watching to see if the trend extrapolates into future quarters.\n9. Return on Invested Capital (ROIC)\nEPS and free cash flow tell us whether a company was profitable while growing its revenue. But was it capital-efficient? Enter ROIC, a metric showing how much operating profit a company generates relative to the money it has raised (debt and equity).\nRE/MAX historically did a mediocre job investing in profitable growth initiatives. Its five-year average ROIC was 0.3%, lower than the typical cost of capital (how much it costs to raise money) for consumer discretionary companies.\nWe like to invest in businesses with high returns, but the trend in a company’s ROIC is what often surprises the market and moves the stock price. On average, RE/MAX’s ROIC increased by 1.1 percentage points annually over the last few years. This is a good sign, and we hope the company can continue improving.\n10. Balance Sheet Assessment\nRE/MAX reported $94.31 million of cash and $466.1 million of debt on its balance sheet in the most recent quarter. As investors in high-quality companies, we primarily focus on two things: 1) that a company’s debt level isn’t too high and 2) that its interest payments are not excessively burdening the business.\nWith $96.18 million of EBITDA over the last 12 months, we view RE/MAX’s 3.9× net-debt-to-EBITDA ratio as safe. We also see its $15.9 million of annual interest expenses as appropriate. The company’s profits give it plenty of breathing room, allowing it to continue investing in growth initiatives.\n11. Key Takeaways from RE/MAX’s Q2 Results\nIt was encouraging to see RE/MAX beat analysts’ EPS expectations this quarter. We were also happy its EBITDA outperformed Wall Street’s estimates. On the other hand, its EBITDA guidance for next quarter missed and its revenue fell slightly short of Wall Street’s estimates. Overall, this was a softer quarter. The stock remained flat at $8.52 immediately following the results.\n12. Is Now The Time To Buy RE/MAX?\nUpdated: August 19, 2025 at 11:10 PM EDT\nWe think that the latest earnings result is only one piece of the bigger puzzle. If you’re deciding whether to own RE/MAX, you should also grasp the company’s longer-term business quality and valuation.\nWe cheer for all companies serving everyday consumers, but in the case of RE/MAX, we’ll be cheering from the sidelines. First off, its revenue growth was weak over the last five years, and analysts expect its demand to deteriorate over the next 12 months. And while its solid free cash flow generation gives it reinvestment options, the downside is its declining EPS over the last five years makes it a less attractive asset to the public markets. On top of that, its relatively low ROIC suggests management has struggled to find compelling investment opportunities.\nRE/MAX’s P/E ratio based on the next 12 months is 6.8x. While this valuation is optically cheap, the potential downside is huge given its shaky fundamentals. There are more exciting stocks to buy at the moment.\nWall Street analysts have a consensus one-year price target of $9 on the company (compared to the current share price of $8.96)."
    }
  ],
  "argos_summary": "U.S. stocks fell as tech names led declines after earlier AI‑driven gains, prompting some investors to view the dip as a buying opportunity for core AI winners. Mixed earnings from retailers such as Target added to weakness, while analysts noted that higher wholesale inflation and potential Fed rate decisions could weigh on cyclical sectors. The article highlights two stocks that dropped—Wabash, a heavy‑transportation equipment maker, and RE/MAX, a real‑estate franchise—providing detailed financial assessments that suggest both companies face declining revenue, margin pressure, and debt concerns, making them less attractive for investors seeking quality growth.",
  "argos_id": "3GFRSTRFD"
}