{
  "url": "https://finance.yahoo.com/news/mccoy-global-tse-mcb-due-184309399.html?.tsrc=rss",
  "authorsByline": "Simply Wall St",
  "articleId": "e32b288589b04c18865a0b2dde01171b",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/simply_wall_st__316/32886eaffeaf95112d326b3e8720be76",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-20T18:43:09+00:00",
  "addDate": "2025-08-20T19:41:28.743607+00:00",
  "refreshDate": "2025-08-20T19:41:28.743609+00:00",
  "score": 1.0,
  "title": "McCoy Global (TSE:MCB) Is Due To Pay A Dividend Of CA$0.025",
  "description": "The board of McCoy Global Inc. ( TSE:MCB ) has announced that it will pay a dividend of CA$0.025 per share on the 15th...",
  "content": "The board of McCoy Global Inc. (TSE:MCB) has announced that it will pay a dividend of CA$0.025 per share on the 15th of October. This payment means that the dividend yield will be 3.2%, which is around the industry average.\n\nWe've found 21 US stocks that are forecast to pay a dividend yield of over 6% next year. See the full list for free.\n\nMcCoy Global's Projected Earnings Seem Likely To Cover Future Distributions\n\nWe aren't too impressed by dividend yields unless they can be sustained over time. Based on the last payment, McCoy Global was paying only paying out a fraction of earnings, but the payment was a massive 130% of cash flows. A cash payout ratio this high could put the dividend under pressure and force the company to reduce it in the future if it were to run into tough times.\n\nLooking forward, earnings per share could rise by 27.9% over the next year if the trend from the last few years continues. Assuming the dividend continues along recent trends, we think the payout ratio could be 25% by next year, which is in a pretty sustainable range.\n\nAlthough the company has a long dividend history, it has been cut at least once in the last 10 years. The annual payment during the last 10 years was CA$0.20 in 2015, and the most recent fiscal year payment was CA$0.10. This works out to be a decline of approximately 6.7% per year over that time. Generally, we don't like to see a dividend that has been declining over time as this can degrade shareholders' returns and indicate that the company may be running into problems.\n\nThe Dividend Looks Likely To Grow\n\nDividends have been going in the wrong direction, so we definitely want to see a different trend in the earnings per share. McCoy Global has seen EPS rising for the last five years, at 28% per annum. Rapid earnings growth and a low payout ratio suggest this company has been effectively reinvesting in its business. Should that continue, this company could have a bright future.\n\nOverall, we don't think this company makes a great dividend stock, even though the dividend wasn't cut this year. While the low payout ratio is a redeeming feature, this is offset by the minimal cash to cover the payments. We don't think McCoy Global is a great stock to add to your portfolio if income is your focus.\n\nMarket movements attest to how highly valued a consistent dividend policy is compared to one which is more unpredictable. At the same time, there are other factors our readers should be conscious of before pouring capital into a stock. Taking the debate a bit further, we've identified 2 warning signs for McCoy Global that investors need to be conscious of moving forward. If you are a dividend investor, you might also want to look at our curated list of high yield dividend stocks.\n\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\n\n\n\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.",
  "medium": "Article",
  "links": [
    "https://simplywall.st/company/id/F0E6DBD0-EF91-4B29-8C82-5242B518E8C0?blueprint=4003743&utm_medium=finance_user&utm_campaign=cta&utm_source=yahoo",
    "https://simplywall.st/discover/investing-ideas/146/dividend-powerhouses-3-yield/global?blueprint=4003743&utm_medium=finance_user&utm_campaign=conclusion-grid&utm_source=yahoo",
    "https://simplywall.st/company/id/F0E6DBD0-EF91-4B29-8C82-5242B518E8C0?blueprint=4003743&utm_medium=finance_user&utm_campaign=conclusion&utm_source=yahoo",
    "https://au.finance.yahoo.com/quote/MCB.TO",
    "https://simplywall.st/company/id/F0E6DBD0-EF91-4B29-8C82-5242B518E8C0/dividend?blueprint=4003743&amp;utm_medium=finance_user&amp;utm_campaign=infographic&amp;utm_source=yahoo",
    "https://simplywall.st/discover/investing-ideas/434616/us-dividend-powerhouses-with-a-forecast-yield-of-6percent/global?blueprint=4003743&utm_medium=finance_user&utm_campaign=investing-ideas&utm_source=yahoo&utm_content=dividend-forecast-yield-6pcnt"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "high yield dividend stocks",
      "weight": 0.11115016
    },
    {
      "name": "dividend yields",
      "weight": 0.10577633
    },
    {
      "name": "Dividends",
      "weight": 0.09914619
    },
    {
      "name": "McCoy Global",
      "weight": 0.08687084
    },
    {
      "name": "McCoy Global Inc.",
      "weight": 0.084188126
    },
    {
      "name": "next year",
      "weight": 0.07621536
    },
    {
      "name": "fiscal year",
      "weight": 0.06699296
    },
    {
      "name": "year",
      "weight": 0.06609845
    },
    {
      "name": "a great dividend stock",
      "weight": 0.06583522
    },
    {
      "name": "Simply Wall St",
      "weight": 0.060795996
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.9912109375
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.97900390625
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.97607421875
    }
  ],
  "sentiment": {
    "positive": 0.12823948,
    "negative": 0.6109009,
    "neutral": 0.26085964
  },
  "summary": "McCoy Global Inc. (TSE:MCB) is set to pay a dividend of CA$0.025 per share on 15th October, a dividend yield of 3.2%, which is around the industry average. The company's projected earnings per share could rise by 27.9% over the next year if the trend from the last few years continues. However, the payout ratio could be around 25% by next year, which is considered a sustainable range. Despite this, the company's long dividend history has been cut at least once in the last decade. The low payout ratio is a redeeming feature, but this is offset by the minimal cash to cover the payments.",
  "shortSummary": "McCoy Global will pay a CA$0.025 per share dividend of 3.2%, with a low payout ratio and promising future growth prospects, but investors should be vigilant about long-term dividend sustainability.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "871df7a2389548f09cc5cf7f099798ed",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://simplywall.st/discover/investing-ideas/146/dividend-powerhouses-3-yield/global?blueprint=4003743&utm_medium=finance_user&utm_campaign=conclusion-grid&utm_source=yahoo",
      "text": "Results\n1961\nThis screener pinpoints dividend all-stars that boast strong fundamentals with yields typically exceeding 3%.\n1961 companies\nGuaranty Trust Holding\nMarket Cap: ₦2.4t\nOperates as a financial holding company for Guaranty Trust Bank Limited that provides commercial banking services in Nigeria, Ghana, Gambia, Sierra Leone, Liberia, Cote D'Ivoire, Kenya, Uganda, Rwanda, Tanzania, and the United Kingdom.\nGTCO\n₦90.15\n7D\n-7.7%\n1Y\n98.1%\nHUAYU Automotive Systems\nMarket Cap: CN¥59.6b\nResearches and develops, manufactures, and sells automotive parts worldwide.\n600741\nCN¥18.90\n7D\n3.6%\n1Y\n41.0%\nDoshishaLtd\nMarket Cap: JP¥92.9b\nPlans, develops, produces, and sells lifestyle-related products in Japan and Internationally.\n7483\nJP¥2,631.00\n7D\n-1.7%\n1Y\n20.5%\nJapan Excellent\nMarket Cap: JP¥196.9b\nJapan Excellent, Inc. (hereinafter, “JEI”), established on February 20, 2006 under the Law Concerning Investment Trusts and Investment Corporations of Japan (the “Investment Trust Law”), is a real estate investment corporation which primarily invests in office buildings.\n8987\nJP¥147,200.00\n7D\n2.7%\n1Y\n20.1%\nNCD\nMarket Cap: JP¥21.1b\nEngages in the system development, support and service, and parking system businesses in Japan.\n4783\nJP¥2,576.00\n7D\n1.1%\n1Y\n39.5%\nWuliangye YibinLtd\nMarket Cap: CN¥488.2b\nManufactures and sells liquor and wine products under the Wuliangye brand in China.\n000858\nCN¥125.78\n7D\n2.1%\n1Y\n2.9%\nPadma Oil\nMarket Cap: ৳19.6b\nEngages in the procurement, storage, and marketing of petroleum products, lubricants, greases, bitumen, and LPG in Bangladesh.\nPADMAOIL\n৳199.20\n7D\n-0.4%\n1Y\n-5.2%\nGakkyushaLtd\nMarket Cap: JP¥25.3b\nManages cram schools that offers entrance exams guidance to junior high schools, high schools, and universities in Japan and internationally.\n9769\nJP¥2,328.00\n7D\n-2.4%\n1Y\n17.3%\nGuangxi LiuYao Group\nMarket Cap: CN¥7.4b\nEngages in the wholesale and retail of pharmaceutical products in China.\n603368\nCN¥18.64\n7D\n1.1%\n1Y\n15.3%\nTsubakimoto Chain\nMarket Cap: JP¥210.7b\nManufactures and sells chains, motion control, mobility, materials handling systems components in Japan.\n6371\nJP¥2,125.00\n7D\n-2.3%\n1Y\n5.7%\nDaicel\nMarket Cap: JP¥357.9b\nEngages in the materials, medical/healthcare, smart, safety, engineering plastics, and other businesses in Japan, China, and internationally.\n4202\nJP¥1,350.00\n7D\n1.5%\n1Y\n2.4%\nTorigoe\nMarket Cap: JP¥22.2b\nManufactures and sells flours and related products in Japan.\n2009\nJP¥953.00\n7D\n2.4%\n1Y\n35.2%\nCAC Holdings\nMarket Cap: JP¥36.6b\nThrough its subsidiaries, provides information technology (IT) services in Japan and internationally.\n4725\nJP¥2,143.00\n7D\n2.1%\n1Y\n20.5%\nFirst Interstate BancSystem\nMarket Cap: US$3.2b\nOperates as the bank holding company for First Interstate Bank that provides a range of banking products and services in the United States.\nFIBK\nUS$30.16\n7D\n0.4%\n1Y\n4.5%\nColumbia Banking System\nMarket Cap: US$5.4b\nOperates as the Bank holding company of Umpqua Bank that provides banking, private banking, mortgage, and other financial services in the United States.\nCOLB\nUS$25.81\n7D\n2.3%\n1Y\n9.1%\nGlobal One Real Estate Investment\nMarket Cap: JP¥144.9b\nGlobal One Real Estate Investment Corporation (“GOR”) is a Japanese Real Estate Investment Trust (J-REIT) listed on the Tokyo Stock Exchange (TSE: 8958) with the ultimate goal of pursuing maximum returns for unitholders.\n8958\nJP¥146,000.00\n7D\n1.8%\n1Y\n42.0%\nChanghong Meiling\nMarket Cap: CN¥7.4b\nEngages in the research, development, and manufacturing of refrigeration appliances and washing machines in China and internationally.\n000521\nCN¥7.67\n7D\n5.1%\n1Y\n6.1%\nDN HoldingsLtd\nMarket Cap: JP¥17.4b\nEngages in the construction consulting and geological survey businesses in Japan.\n7377\nJP¥2,129.00\n7D\n-0.5%\n1Y\n33.3%\nAiphoneLtd\nMarket Cap: JP¥46.3b\nManufactures and sells telecommunications equipment for facilities, offices and public facilities under the AIPHONE brand name for housing, healthcare, business, accessories, and smartphone applications internationally.\n6718\nJP¥2,830.00\n7D\n-0.5%\n1Y\n0.4%\nJW Holdings\nMarket Cap: ₩230.2b\nOperates as a healthcare company in South Korea, the United States, Japan, China, and internationally.\nA096760\n₩3,295.00\n7D\n-4.1%\n1Y\n-3.9%\nEM Systems\nMarket Cap: JP¥53.5b\nDevelops and sells various IT systems for pharmacies, clinics, and care/welfare other business in Japan.\n4820\nJP¥773.00\n7D\n2.0%\n1Y\n35.9%\nKyosan Electric Manufacturing\nMarket Cap: JP¥32.6b\nDevelops, manufactures, and sells electromechanical interlocking, road traffic signal equipment, and cuprous oxide rectifiers in Japan and internationally.\n6742\nJP¥525.00\n7D\n-0.4%\n1Y\n-3.3%\nInabataLtd\nMarket Cap: JP¥182.0b\nProvides solutions and services for information and electronics, chemicals, life industry, and plastics businesses in Japan and internationally.\n8098\nJP¥3,410.00\n7D\n-0.1%\n1Y\n2.9%\nMEISEI INDUSTRIALLtd\nMarket Cap: JP¥76.6b\nOperates as a construction works company in Japan and internationally.\n1976\nJP¥1,610.00\n7D\n-2.8%\n1Y\n29.2%\nZenrin\nMarket Cap: JP¥58.1b\nEngages in the collection and management of a range of geospatial information worldwide.\n9474\nJP¥1,088.00\n7D\n-0.09%\n1Y\n21.4%\nKSKLtd\nMarket Cap: JP¥26.1b\nEngages in the LSI, software, hardware, customer service, and data entry businesses.\n9687\nJP¥4,320.00\n7D\n-1.6%\n1Y\n47.3%\nMidea Group\nMarket Cap: CN¥553.8b\nManufactures and sells home appliances, and robotic and automation systems in China and internationally.\n000333\nCN¥72.22\n7D\n0.6%\n1Y\n14.3%\nAudix\nMarket Cap: NT$6.6b\nManufactures, markets, trades in, and distributes electronic components in Taiwan.\n2459\nNT$62.70\n7D\n-0.2%\n1Y\n-13.2%\nLuzhou LaojiaoLtd\nMarket Cap: CN¥191.8b\nProduces and sells alcoholic products in China and internationally.\n000568\nCN¥130.31\n7D\n3.6%\n1Y\n5.8%\nJapan Pulp and Paper\nMarket Cap: JP¥84.3b\nEngages in the manufacture, import, export, distribution, wholesale, and sale of paper, paperboards, pulp, and paper-related products in Japan, Europe, Asia, Oceania, North America, and internationally.\n8032\nJP¥684.00\n7D\n1.2%\n1Y\n8.7%\nZain Bahrain B.S.C\nMarket Cap: ب.د42.9m\nZain Bahrain B.S.C. principally engages in the provision of public telecommunications and related products and services in the Kingdom of Bahrain.\nZAINBH\nب.د0.12\n7D\n-0.8%\n1Y\n2.6%\nDillard's\nMarket Cap: US$8.2b\nOperates retail department stores in the southeastern, southwestern, and midwestern areas of the United States.\nDDS\nUS$519.24\n7D\n8.5%\n1Y\n47.7%\nEastern Bank\nMarket Cap: ৳40.1b\nProvides various banking products and services to retail, corporate, and small and medium enterprise (SME) customers in Bangladesh and internationally.\nEBL\n৳25.10\n7D\n-0.4%\n1Y\n9.2%\nSporton International\nMarket Cap: NT$17.3b\nProvides product testing and certification services in Taiwan and internationally.\n6146\nNT$170.00\n7D\n-1.2%\n1Y\n-24.1%\nSelamat Sempurna\nMarket Cap: Rp11.6t\nManufactures and sells tools or equipment for vehicles, heavy equipment, and other machinery in Indonesia and internationally.\nSMSM\nRp2,010.00\n7D\n5.5%\n1Y\n5.5%\nBank Negara Indonesia (Persero)\nMarket Cap: Rp165.0t\nProvides various banking products and services in Indonesia, rest of Asia, New York, and Europe.\nBBNI\nRp4,430.00\n7D\n1.4%\n1Y\n-18.7%"
    },
    {
      "url": "https://simplywall.st/company/id/F0E6DBD0-EF91-4B29-8C82-5242B518E8C0/dividend?blueprint=4003743&amp;utm_medium=finance_user&amp;utm_campaign=infographic&amp;utm_source=yahoo",
      "text": "McCoy Global is a dividend paying company with a current yield of 3.18% that is well covered by earnings. Next payment date is on 15th October, 2025 with an ex-dividend date of 29th September, 2025.\nStable Dividend: MCB's dividend payments have been volatile in the past 10 years.\nGrowing Dividend: MCB's dividend payments have fallen over the past 10 years.\nDividend Yield vs Market\nMcCoy Global Dividend Yield vs Market\nHow does MCB dividend yield compare to the market?\nSegment\nDividend Yield\nCompany (MCB)\n3.2%\nMarket Bottom 25% (CA)\n1.8%\nMarket Top 25% (CA)\n6.0%\nIndustry Average (Energy Services)\n2.6%\nAnalyst forecast (MCB) (up to 3 years)\nn/a\nNotable Dividend: MCB's dividend (3.18%) is higher than the bottom 25% of dividend payers in the Canadian market (1.89%).\nHigh Dividend: MCB's dividend (3.18%) is low compared to the top 25% of dividend payers in the Canadian market (6.02%).\nEarnings Payout to Shareholders\nEarnings Coverage: With its reasonably low payout ratio (33.4%), MCB's dividend payments are well covered by earnings.\nCash Payout to Shareholders\nCash Flow Coverage: With its high cash payout ratio (130.1%), MCB's dividend payments are not well covered by cash flows.\nDiscover strong dividend paying companies\n7D\n1Y\n7D\n1Y\n7D\n1Y\nCompany Analysis and Financial Data Status\nData\nLast Updated (UTC time)\nCompany Analysis\n2025/08/19 12:57\nEnd of Day Share Price\n2025/08/19 00:00\nEarnings\n2025/06/30\nAnnual Earnings\n2024/12/31\nData Sources\nThe data used in our company analysis is from S&P Global Market Intelligence LLC. The following data is used in our analysis model to generate this report. Data is normalised which can introduce a delay from the source being available.\n* Example for US securities, for non-US equivalent regulatory forms and sources are used.\nUnless specified all financial data is based on a yearly period but updated quarterly. This is known as Trailing Twelve Month (TTM) or Last Twelve Month (LTM) Data. Learn more.\nAnalysis Model and Snowflake\nDetails of the analysis model used to generate this report is available on our Github page, we also have guides on how to use our reports and tutorials on Youtube.\nLearn about the world class team who designed and built the Simply Wall St analysis model.\nIndustry and Sector Metrics\nOur industry and section metrics are calculated every 6 hours by Simply Wall St, details of our process are available on Github.\nAnalyst Sources\nMcCoy Global Inc. is covered by 8 analysts. 2 of those analysts submitted the estimates of revenue or earnings used as inputs to our report. Analysts submissions are updated throughout the day."
    },
    {
      "url": "https://simplywall.st/company/id/F0E6DBD0-EF91-4B29-8C82-5242B518E8C0?blueprint=4003743&utm_medium=finance_user&utm_campaign=cta&utm_source=yahoo",
      "text": "McCoy Global (MCB) Stock Overview\nProvides equipment and technologies designed to support tubular running operations that enhance wellbore integrity and assist with collecting data for the energy industry in the United States, Latin America, the Middle East, Africa, Europe, the Asia Pacific, and Canada. More details\n| Snowflake Score | |\n|---|---|\n| Valuation | 4/6 |\n| Future Growth | 1/6 |\n| Past Performance | 2/6 |\n| Financial Health | 6/6 |\n| Dividends | 2/6 |\nMCB Community Fair Values\nSee what 10 others think this stock is worth. Follow their fair value or set your own to get alerts.\nMcCoy Global Inc. Competitors\nPrice History & Performance\n| Historical stock prices | |\n|---|---|\n| Current Share Price | CA$3.14 |\n| 52 Week High | CA$4.48 |\n| 52 Week Low | CA$1.92 |\n| Beta | 0.62 |\n| 1 Month Change | -23.41% |\n| 3 Month Change | -11.05% |\n| 1 Year Change | 54.68% |\n| 3 Year Change | 166.10% |\n| 5 Year Change | 647.62% |\n| Change since IPO | -3.38% |\nRecent News & Updates\nMcCoy Global (TSE:MCB) Has Announced A Dividend Of CA$0.025\nAug 14We Like These Underlying Return On Capital Trends At McCoy Global (TSE:MCB)\nMay 30Recent updates\nMcCoy Global (TSE:MCB) Has Announced A Dividend Of CA$0.025\nAug 14We Like These Underlying Return On Capital Trends At McCoy Global (TSE:MCB)\nMay 30Here's Why We Think McCoy Global (TSE:MCB) Is Well Worth Watching\nMar 31McCoy Global (TSE:MCB) Is Paying Out A Larger Dividend Than Last Year\nMar 10The Market Doesn't Like What It Sees From McCoy Global Inc.'s (TSE:MCB) Earnings Yet\nFeb 26McCoy Global Inc.'s (TSE:MCB) Earnings Are Not Doing Enough For Some Investors\nSep 25We Think That There Are More Issues For McCoy Global (TSE:MCB) Than Just Sluggish Earnings\nAug 20Why We Think Shareholders May Be Considering Bumping Up McCoy Global Inc.'s (TSE:MCB) CEO Compensation\nMay 03McCoy Global Inc.'s (TSE:MCB) Subdued P/E Might Signal An Opportunity\nFeb 03Take Care Before Diving Into The Deep End On McCoy Global Inc. (TSE:MCB)\nMar 11McCoy Global (TSE:MCB) Is Experiencing Growth In Returns On Capital\nFeb 02Is McCoy Global (TSE:MCB) A Risky Investment?\nSep 19Returns At McCoy Global (TSE:MCB) Are On The Way Up\nJul 28We Think McCoy Global (TSE:MCB) Is Taking Some Risk With Its Debt\nJun 07Returns Are Gaining Momentum At McCoy Global (TSE:MCB)\nApr 08Health Check: How Prudently Does McCoy Global (TSE:MCB) Use Debt?\nFeb 12Is McCoy Global (TSE:MCB) Using Too Much Debt?\nSep 25Shareholders Will Probably Not Have Any Issues With McCoy Global Inc.'s (TSE:MCB) CEO Compensation\nMay 27How Well Is McCoy Global (TSE:MCB) Allocating Its Capital?\nFeb 15Here's Why McCoy Global (TSE:MCB) Can Manage Its Debt Responsibly\nDec 21Shareholder Returns\n| MCB | CA Energy Services | CA Market | |\n|---|---|---|---|\n| 7D | -1.3% | -7.2% | -0.03% |\n| 1Y | 54.7% | 6.4% | 18.0% |\nReturn vs Industry: MCB exceeded the Canadian Energy Services industry which returned 6.1% over the past year.\nReturn vs Market: MCB exceeded the Canadian Market which returned 11.5% over the past year.\nPrice Volatility\n| MCB volatility | |\n|---|---|\n| MCB Average Weekly Movement | 7.7% |\n| Energy Services Industry Average Movement | 5.3% |\n| Market Average Movement | 8.5% |\n| 10% most volatile stocks in CA Market | 18.4% |\n| 10% least volatile stocks in CA Market | 3.0% |\nStable Share Price: MCB has not had significant price volatility in the past 3 months compared to the Canadian market.\nVolatility Over Time: MCB's weekly volatility (8%) has been stable over the past year.\nAbout the Company\n| Founded | Employees | CEO | Website |\n|---|---|---|---|\n| 1914 | 138 | Jim Rakievich | www.mccoyglobal.com |\nMcCoy Global Inc. provides equipment and technologies designed to support tubular running operations that enhance wellbore integrity and assist with collecting data for the energy industry in the United States, Latin America, the Middle East, Africa, Europe, the Asia Pacific, and Canada. The company designs, produces, and distributes capital equipment; aftermarket products and services, such as technical support, consumables, and replacement parts; and data collection technologies used in rugged applications in the energy, construction, marine, and aerospace industries. The company also offers wellbore construction equipment comprising DWCRT casing running tools, wireless torque subs, MTT torque turn monitoring systems, hydraulic power tongs, bucking units, hydraulic power units, and weTORQ roughnecks; drawworks products consisting of mudsaver valves, AutoFill, side entry swivels, and drift bars; control and monitoring systems, such as winch control, anchor monitoring, crane monitoring, and instrumented sheave systems; and sensors for harsh environments, including land oil rigs, offshore oil/gas rigs, mobile crawler cranes, and marine vessels, as well as tower, boom, and bridge cranes.\nMcCoy Global Inc. Fundamentals Summary\n| MCB fundamental statistics | |\n|---|---|\n| Market cap | CA$89.40m |\n| Earnings (TTM) | CA$7.08m |\n| Revenue (TTM) | CA$84.46m |\nIs MCB overvalued?\nSee Fair Value and valuation analysisEarnings & Revenue\n| MCB income statement (TTM) | |\n|---|---|\n| Revenue | CA$84.46m |\n| Cost of Revenue | CA$53.52m |\n| Gross Profit | CA$30.95m |\n| Other Expenses | CA$23.86m |\n| Earnings | CA$7.08m |\nLast Reported Earnings\nJun 30, 2025\nNext Earnings Date\nn/a\n| Earnings per share (EPS) | 0.26 |\n| Gross Margin | 36.64% |\n| Net Profit Margin | 8.39% |\n| Debt/Equity Ratio | 0% |\nHow did MCB perform over the long term?\nSee historical performance and comparisonDividends\nDoes MCB pay a reliable dividends?\nSee MCB dividend history and benchmarks| McCoy Global dividend dates | |\n|---|---|\n| Ex Dividend Date | Sep 29 2025 |\n| Dividend Pay Date | Oct 15 2025 |\n| Days until Ex dividend | 39 days |\n| Days until Dividend pay date | 55 days |\nDoes MCB pay a reliable dividends?\nSee MCB dividend history and benchmarksCompany Analysis and Financial Data Status\n| Data | Last Updated (UTC time) |\n|---|---|\n| Company Analysis | 2025/08/19 12:57 |\n| End of Day Share Price | 2025/08/19 00:00 |\n| Earnings | 2025/06/30 |\n| Annual Earnings | 2024/12/31 |\nData Sources\nThe data used in our company analysis is from S&P Global Market Intelligence LLC. The following data is used in our analysis model to generate this report. Data is normalised which can introduce a delay from the source being available.\n| Package | Data | Timeframe | Example US Source * |\n|---|---|---|---|\n| Company Financials | 10 years |\n| |\n| Analyst Consensus Estimates | +3 years |\n|\n|\n| Market Prices | 30 years |\n| |\n| Ownership | 10 years |\n| |\n| Management | 10 years |\n| |\n| Key Developments | 10 years |\n|\n* Example for US securities, for non-US equivalent regulatory forms and sources are used.\nUnless specified all financial data is based on a yearly period but updated quarterly. This is known as Trailing Twelve Month (TTM) or Last Twelve Month (LTM) Data. Learn more.\nAnalysis Model and Snowflake\nDetails of the analysis model used to generate this report is available on our Github page, we also have guides on how to use our reports and tutorials on Youtube.\nLearn about the world class team who designed and built the Simply Wall St analysis model.\nIndustry and Sector Metrics\nOur industry and section metrics are calculated every 6 hours by Simply Wall St, details of our process are available on Github.\nAnalyst Sources\nMcCoy Global Inc. is covered by 8 analysts. 2 of those analysts submitted the estimates of revenue or earnings used as inputs to our report. Analysts submissions are updated throughout the day.\n| Analyst | Institution |\n|---|---|\n| Nick Corcoran | Acumen Capital Finance Partners Limited |\n| Russell Stanley | Beacon Securities Limited |\n| Anthony Petrucci | Canaccord Genuity |"
    },
    {
      "url": "https://simplywall.st/company/id/F0E6DBD0-EF91-4B29-8C82-5242B518E8C0?blueprint=4003743&utm_medium=finance_user&utm_campaign=conclusion&utm_source=yahoo",
      "text": "McCoy Global (MCB) Stock Overview\nProvides equipment and technologies designed to support tubular running operations that enhance wellbore integrity and assist with collecting data for the energy industry in the United States, Latin America, the Middle East, Africa, Europe, the Asia Pacific, and Canada. More details\n| Snowflake Score | |\n|---|---|\n| Valuation | 4/6 |\n| Future Growth | 1/6 |\n| Past Performance | 2/6 |\n| Financial Health | 6/6 |\n| Dividends | 2/6 |\nMCB Community Fair Values\nSee what 10 others think this stock is worth. Follow their fair value or set your own to get alerts.\nMcCoy Global Inc. Competitors\nPrice History & Performance\n| Historical stock prices | |\n|---|---|\n| Current Share Price | CA$3.14 |\n| 52 Week High | CA$4.48 |\n| 52 Week Low | CA$1.92 |\n| Beta | 0.62 |\n| 1 Month Change | -23.41% |\n| 3 Month Change | -11.05% |\n| 1 Year Change | 54.68% |\n| 3 Year Change | 166.10% |\n| 5 Year Change | 647.62% |\n| Change since IPO | -3.38% |\nRecent News & Updates\nMcCoy Global (TSE:MCB) Has Announced A Dividend Of CA$0.025\nAug 14We Like These Underlying Return On Capital Trends At McCoy Global (TSE:MCB)\nMay 30Recent updates\nMcCoy Global (TSE:MCB) Has Announced A Dividend Of CA$0.025\nAug 14We Like These Underlying Return On Capital Trends At McCoy Global (TSE:MCB)\nMay 30Here's Why We Think McCoy Global (TSE:MCB) Is Well Worth Watching\nMar 31McCoy Global (TSE:MCB) Is Paying Out A Larger Dividend Than Last Year\nMar 10The Market Doesn't Like What It Sees From McCoy Global Inc.'s (TSE:MCB) Earnings Yet\nFeb 26McCoy Global Inc.'s (TSE:MCB) Earnings Are Not Doing Enough For Some Investors\nSep 25We Think That There Are More Issues For McCoy Global (TSE:MCB) Than Just Sluggish Earnings\nAug 20Why We Think Shareholders May Be Considering Bumping Up McCoy Global Inc.'s (TSE:MCB) CEO Compensation\nMay 03McCoy Global Inc.'s (TSE:MCB) Subdued P/E Might Signal An Opportunity\nFeb 03Take Care Before Diving Into The Deep End On McCoy Global Inc. (TSE:MCB)\nMar 11McCoy Global (TSE:MCB) Is Experiencing Growth In Returns On Capital\nFeb 02Is McCoy Global (TSE:MCB) A Risky Investment?\nSep 19Returns At McCoy Global (TSE:MCB) Are On The Way Up\nJul 28We Think McCoy Global (TSE:MCB) Is Taking Some Risk With Its Debt\nJun 07Returns Are Gaining Momentum At McCoy Global (TSE:MCB)\nApr 08Health Check: How Prudently Does McCoy Global (TSE:MCB) Use Debt?\nFeb 12Is McCoy Global (TSE:MCB) Using Too Much Debt?\nSep 25Shareholders Will Probably Not Have Any Issues With McCoy Global Inc.'s (TSE:MCB) CEO Compensation\nMay 27How Well Is McCoy Global (TSE:MCB) Allocating Its Capital?\nFeb 15Here's Why McCoy Global (TSE:MCB) Can Manage Its Debt Responsibly\nDec 21Shareholder Returns\n| MCB | CA Energy Services | CA Market | |\n|---|---|---|---|\n| 7D | -1.3% | -7.2% | -0.03% |\n| 1Y | 54.7% | 6.4% | 18.0% |\nReturn vs Industry: MCB exceeded the Canadian Energy Services industry which returned 6.1% over the past year.\nReturn vs Market: MCB exceeded the Canadian Market which returned 11.5% over the past year.\nPrice Volatility\n| MCB volatility | |\n|---|---|\n| MCB Average Weekly Movement | 7.7% |\n| Energy Services Industry Average Movement | 5.3% |\n| Market Average Movement | 8.5% |\n| 10% most volatile stocks in CA Market | 18.4% |\n| 10% least volatile stocks in CA Market | 3.0% |\nStable Share Price: MCB has not had significant price volatility in the past 3 months compared to the Canadian market.\nVolatility Over Time: MCB's weekly volatility (8%) has been stable over the past year.\nAbout the Company\n| Founded | Employees | CEO | Website |\n|---|---|---|---|\n| 1914 | 138 | Jim Rakievich | www.mccoyglobal.com |\nMcCoy Global Inc. provides equipment and technologies designed to support tubular running operations that enhance wellbore integrity and assist with collecting data for the energy industry in the United States, Latin America, the Middle East, Africa, Europe, the Asia Pacific, and Canada. The company designs, produces, and distributes capital equipment; aftermarket products and services, such as technical support, consumables, and replacement parts; and data collection technologies used in rugged applications in the energy, construction, marine, and aerospace industries. The company also offers wellbore construction equipment comprising DWCRT casing running tools, wireless torque subs, MTT torque turn monitoring systems, hydraulic power tongs, bucking units, hydraulic power units, and weTORQ roughnecks; drawworks products consisting of mudsaver valves, AutoFill, side entry swivels, and drift bars; control and monitoring systems, such as winch control, anchor monitoring, crane monitoring, and instrumented sheave systems; and sensors for harsh environments, including land oil rigs, offshore oil/gas rigs, mobile crawler cranes, and marine vessels, as well as tower, boom, and bridge cranes.\nMcCoy Global Inc. Fundamentals Summary\n| MCB fundamental statistics | |\n|---|---|\n| Market cap | CA$89.40m |\n| Earnings (TTM) | CA$7.08m |\n| Revenue (TTM) | CA$84.46m |\nIs MCB overvalued?\nSee Fair Value and valuation analysisEarnings & Revenue\n| MCB income statement (TTM) | |\n|---|---|\n| Revenue | CA$84.46m |\n| Cost of Revenue | CA$53.52m |\n| Gross Profit | CA$30.95m |\n| Other Expenses | CA$23.86m |\n| Earnings | CA$7.08m |\nLast Reported Earnings\nJun 30, 2025\nNext Earnings Date\nn/a\n| Earnings per share (EPS) | 0.26 |\n| Gross Margin | 36.64% |\n| Net Profit Margin | 8.39% |\n| Debt/Equity Ratio | 0% |\nHow did MCB perform over the long term?\nSee historical performance and comparisonDividends\nDoes MCB pay a reliable dividends?\nSee MCB dividend history and benchmarks| McCoy Global dividend dates | |\n|---|---|\n| Ex Dividend Date | Sep 29 2025 |\n| Dividend Pay Date | Oct 15 2025 |\n| Days until Ex dividend | 39 days |\n| Days until Dividend pay date | 55 days |\nDoes MCB pay a reliable dividends?\nSee MCB dividend history and benchmarksCompany Analysis and Financial Data Status\n| Data | Last Updated (UTC time) |\n|---|---|\n| Company Analysis | 2025/08/19 12:57 |\n| End of Day Share Price | 2025/08/19 00:00 |\n| Earnings | 2025/06/30 |\n| Annual Earnings | 2024/12/31 |\nData Sources\nThe data used in our company analysis is from S&P Global Market Intelligence LLC. The following data is used in our analysis model to generate this report. Data is normalised which can introduce a delay from the source being available.\n| Package | Data | Timeframe | Example US Source * |\n|---|---|---|---|\n| Company Financials | 10 years |\n| |\n| Analyst Consensus Estimates | +3 years |\n|\n|\n| Market Prices | 30 years |\n| |\n| Ownership | 10 years |\n| |\n| Management | 10 years |\n| |\n| Key Developments | 10 years |\n|\n* Example for US securities, for non-US equivalent regulatory forms and sources are used.\nUnless specified all financial data is based on a yearly period but updated quarterly. This is known as Trailing Twelve Month (TTM) or Last Twelve Month (LTM) Data. Learn more.\nAnalysis Model and Snowflake\nDetails of the analysis model used to generate this report is available on our Github page, we also have guides on how to use our reports and tutorials on Youtube.\nLearn about the world class team who designed and built the Simply Wall St analysis model.\nIndustry and Sector Metrics\nOur industry and section metrics are calculated every 6 hours by Simply Wall St, details of our process are available on Github.\nAnalyst Sources\nMcCoy Global Inc. is covered by 8 analysts. 2 of those analysts submitted the estimates of revenue or earnings used as inputs to our report. Analysts submissions are updated throughout the day.\n| Analyst | Institution |\n|---|---|\n| Nick Corcoran | Acumen Capital Finance Partners Limited |\n| Russell Stanley | Beacon Securities Limited |\n| Anthony Petrucci | Canaccord Genuity |"
    },
    {
      "url": "https://simplywall.st/discover/investing-ideas/434616/us-dividend-powerhouses-with-a-forecast-yield-of-6percent/global?blueprint=4003743&utm_medium=finance_user&utm_campaign=investing-ideas&utm_source=yahoo&utm_content=dividend-forecast-yield-6pcnt",
      "text": "Results\n18\nThese stocks are forecast to deliver over a 6% dividend yield next year. Their dividend payments are well covered by cash flows and they have been growing steadily. Perfect for income-focused investors seeking robust returns.\n18 companies\nOmega Healthcare Investors\nMarket Cap: US$12.5b\nA Real Estate Investment Trust (“REIT”) providing financing and capital to the long-term healthcare industry with a focus on skilled nursing and assisted living facilities located in the United States and the United Kingdom.\nOHI\nUS$41.27\n7D\n2.1%\n1Y\n8.6%\nVerizon Communications\nMarket Cap: US$187.2b\nThrough its subsidiaries, engages in the provision of communications, technology, information, and entertainment products and services to consumers, businesses, and governmental entities worldwide.\nVZ\nUS$44.94\n7D\n3.9%\n1Y\n10.0%\nBanco Latinoamericano de Comercio Exterior S. A\nMarket Cap: US$1.7b\nBanco Latinoamericano de Comercio Exterior, S.\nBLX\nUS$44.58\n7D\n-5.5%\n1Y\n48.8%\nConagra Brands\nMarket Cap: US$9.1b\nOperates as a consumer packaged goods food company primarily in the United States.\nCAG\nUS$19.27\n7D\n-1.2%\n1Y\n-37.4%\nBrookline Bancorp\nMarket Cap: US$938.3m\nOperates as a bank holding company for the Brookline Bank that provides commercial, business, and retail banking products and services to corporate, municipal, and retail customers in the United States.\nBRKL\nUS$10.58\n7D\n-0.6%\n1Y\n8.8%\nFlowers Foods\nMarket Cap: US$3.3b\nProduces and markets packaged bakery food products in the United States.\nFLO\nUS$15.72\n7D\n-4.5%\n1Y\n-32.1%\nArtisan Partners Asset Management\nMarket Cap: US$3.7b\nArtisan Partners Asset Management Inc. is publicly owned investment manager.\nAPAM\nUS$45.55\n7D\n-4.2%\n1Y\n12.7%\nTFS Financial\nMarket Cap: US$3.7b\nThrough its subsidiaries, provides retail consumer banking services in the United States.\nTFSL\nUS$13.17\n7D\n1.2%\n1Y\n1.0%\nXP\nMarket Cap: US$9.3b\nProvides financial products and services in Brazil.\nXP\nUS$16.00\n7D\n-8.2%\n1Y\n-18.2%\nUnited Parcel Service\nMarket Cap: US$73.3b\nA package delivery and logistics provider, offers transportation and delivery services.\nUPS\nUS$87.80\n7D\n0.4%\n1Y\n-31.9%\nBuckle\nMarket Cap: US$2.8b\nOperates as a retailer of casual apparel, footwear, and accessories for men, women, and kids under the Buckle and Buckle Youth brands in the United States.\nBKE\nUS$55.20\n7D\n-0.9%\n1Y\n31.2%\nCricut\nMarket Cap: US$1.2b\nEngages in the design, marketing, and distribution of a creativity platform that enables users to turn ideas into professional-looking handmade goods in the United States, Canada, the United Kingdom, Ireland, Australia, New Zealand, Western Europe, the Middle East, Latin America, South Africa, and Asia.\nCRCT\nUS$5.68\n7D\n2.2%\n1Y\n0.4%\nGlobal Ship Lease\nMarket Cap: US$1.1b\nEngages in owning and chartering of containerships under fixed-rate charters to container shipping companies worldwide.\nGSL\nUS$29.95\n7D\n-2.4%\n1Y\n13.4%\nMain Street Capital\nMarket Cap: US$5.9b\nA business development company and a small business investment company specializing in direct and indirect investments.\nMAIN\nUS$65.23\n7D\n-2.1%\n1Y\n32.3%\nMacy's\nMarket Cap: US$3.6b\nAn omni-channel retail organization, operates stores, websites, and mobile applications in the United States.\nM\nUS$13.04\n7D\n2.4%\n1Y\n-26.5%\nOxford Industries\nMarket Cap: US$679.7m\nAn apparel company, designs, sources, markets, and distributes lifestyle products worldwide.\nOXM\nUS$45.19\n7D\n4.5%\n1Y\n-47.2%\nMarket Cap: US$2.9b\nThrough its subsidiaries, operates as a social media platform for people to create, discover, and distribute content in the People’s Republic of China.\nWB\nUS$11.21\n7D\n11.0%\n1Y\n43.7%\nSila Realty Trust\nMarket Cap: US$1.3b\nSila Realty Trust, Inc., headquartered in Tampa, Florida, is a net lease real estate investment trust with a strategic focus on investing in the growing and resilient healthcare sector.\nSILA\nUS$24.76\n7D\n-2.4%\n1Y\n8.5%"
    }
  ],
  "argos_summary": "McCoy Global Inc. (TSE:MCB) announced a CA$0.025 dividend, giving a 3.2% yield that sits near the industry average. The payout ratio is high on cash flow (130%) but earnings coverage is solid, and EPS is projected to grow 27.9% next year, potentially bringing the payout ratio to a sustainable 25%. Historically the dividend has been declining, and the company has cut it at least once in the past decade, raising concerns for income‑focused investors. Overall, the stock offers modest yield and good earnings health but is not considered a top dividend play due to its volatile dividend history and high cash payout pressure.",
  "argos_id": "7QP50DXK0"
}