{
  "url": "https://finance.yahoo.com/news/tanzania-burundi-begin-construction-2-184306578.html",
  "authorsByline": "GlobalData",
  "articleId": "83758d604f62448c94793f3aff8b08fb",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://s.yimg.com/ny/api/res/1.2/2Lpvv.nHT3j6gqpe81lC_A--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU7Y2Y9d2VicA--/https://media.zenfs.com/en/railway_technology_356/bae6ed0cbf7ebb6fe670b51814765c8d",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-20T18:43:06+00:00",
  "addDate": "2025-08-20T19:05:31.491274+00:00",
  "refreshDate": "2025-08-20T19:05:31.491277+00:00",
  "score": 1.0,
  "title": "Tanzania and Burundi begin construction on $2.15bn line",
  "description": "The project will feature a fully electrified 1,435mm international standard gauge line and is expected to be completed by 2030.",
  "content": "Tanzania and Burundi have officially commenced the construction of a $2.15bn cross-border standard gauge railway that will connect Uvinza in western Tanzania to Musongati in eastern Burundi. The line will be used for passenger services and frieght transport.\n\nTanzanian Prime Minister Kassim Majaliwa laid the foundation stone for the 240km railway, which is set to be the first of its kind in the region and marks a step towards enhancing East African trade and connectivity.\n\nThe project will feature a fully electrified 1,435mm international standard gauge line and is expected to be completed by 2030.\n\nMajaliwa said: “Once completed, passengers will be able to travel from Musongati to Dar es Salaam in a single day. Currently, cargo trucks take up to 96 hours to reach Bujumbura from Dar es Salaam. With the railway, that journey will be reduced to just 20 hours.”\n\nThe railway promises to not only ease transport but also to open new investment opportunities and strengthen economic ties between the two nations.\n\nBurundian President Evariste Ndayishimiye said: “Many asked how we would transport the minerals. This railway is the answer.”\n\nNdayishimiye highlighted future plans to extend the railway to Kindu in the eastern Democratic Republic of the Congo and ultimately to the Atlantic coast of West Africa, envisioning the development of a pan-African corridor.\n\nA consortium led by China Railway Engineering Design and Consulting Group, a subsidiary of CREC, signed the contract with Tanzania Railways Corporation for the project in January.\n\nThe agreement encompasses sections 7 and 8 of the SGR. Section 7 pertains to the 156km segment connecting Uvinza with Malagarasi within Tanzania, and section 8 involves the 84km link from Malagarasi to Musongati in Burundi.\n\n\"Tanzania and Burundi begin construction on $2.15bn line\" was originally created and published by Railway Technology, a GlobalData owned brand.\n\n\n\n The information on this site has been included in good faith for general informational purposes only. It is not intended to amount to advice on which you should rely, and we give no representation, warranty or guarantee, whether express or implied as to its accuracy or completeness. You must obtain professional or specialist advice before taking, or refraining from, any action on the basis of the content on our site.",
  "medium": "Article",
  "links": [
    "https://www.railway-technology.com/news/tanzania-burundi-construction-standard-gauge-railway-line/",
    "https://www.railway-technology.com/news/tanzania-burundi-railway-construction-china/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Tanzania Railways Corporation",
      "weight": 0.07551699
    },
    {
      "name": "western Tanzania",
      "weight": 0.07378664
    },
    {
      "name": "Tanzania",
      "weight": 0.06991972
    },
    {
      "name": "Dar es Salaam",
      "weight": 0.069426976
    },
    {
      "name": "eastern Burundi",
      "weight": 0.06832968
    },
    {
      "name": "pan-African",
      "weight": 0.0680042
    },
    {
      "name": "Tanzanian Prime Minister Kassim Majaliwa",
      "weight": 0.06370865
    },
    {
      "name": "Railway Technology",
      "weight": 0.06338827
    },
    {
      "name": "Burundian President Evariste Ndayishimiye",
      "weight": 0.061893634
    },
    {
      "name": "East African trade",
      "weight": 0.06179595
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/Travel & Transportation/Transportation/Long Distance Bus & Rail",
      "score": 0.87353515625
    },
    {
      "name": "/Business & Industrial/Shipping & Logistics/Freight Transport/Rail Freight",
      "score": 0.8115234375
    },
    {
      "name": "/Business & Industrial/Construction & Maintenance/Other",
      "score": 0.67041015625
    },
    {
      "name": "/Travel & Transportation/Transportation/Urban Transit",
      "score": 0.65576171875
    },
    {
      "name": "/News/Local News",
      "score": 0.4453125
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.43603515625
    },
    {
      "name": "/News/Other",
      "score": 0.36083984375
    }
  ],
  "sentiment": {
    "positive": 0.36188015,
    "negative": 0.07721821,
    "neutral": 0.56090164
  },
  "summary": "Tanzania and Burundi have begun construction on a $2.15bn cross-border standard gauge railway, set to be the first of its kind in the region and aims to enhance East African trade and connectivity. The 240km line will connect Uvinza in western Tanzania to Musongati in eastern Burundia and will be used for passenger services and frieght transport. The project will feature a fully electrified 1,435mm international standard gauge line and is expected to be completed by 2030. Tanzania's Prime Minister, Kassim Majaliwa, stated that once completed, passengers will be able to travel from Dar es Salaam to Dar Undefined in a single day.",
  "shortSummary": "Tanzania and Burundi have begun construction on a $2.15bn cross-border standard gauge railway, aiming to enhance East African trade and economic ties by 2030.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "f8b0aea807ad4986885eb43b07820963",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Tanzania and Burundi have begun building a 240‑km, fully electrified standard gauge railway linking Uvinza to Musongati, a $2.15 billion project expected to finish by 2030. The line will cut travel times from 96 hours by truck to 20 hours by rail and enable passenger service across the corridor. Leaders highlighted the railway’s potential to boost trade, attract investment, and pave the way for future extensions to the Democratic Republic of Congo and West Africa. The contract is led by China Railway Engineering Design and Consulting Group, a subsidiary of CREC.",
  "argos_id": "LP6K99WMI"
}