{
  "url": "https://www.forbes.com/sites/jeanettehurt/2025/08/20/suntory-aims-to-become-the-number-1-ready-to-drink-company-in-world/",
  "authorsByline": "Jeanette Hurt",
  "articleId": "e9f3bd87dd574b36bfc37cb6b10c9a05",
  "source": {
    "domain": "forbes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NJ",
      "county": "Hudson County",
      "city": "Jersey City",
      "coordinates": {
        "lat": 40.7215682,
        "lon": -74.047455
      }
    }
  },
  "imageUrl": "https://imageio.forbes.com/specials-images/imageserve/68a615097321664027940ab2/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-20T18:37:08+00:00",
  "addDate": "2025-08-20T18:43:14.878497+00:00",
  "refreshDate": "2025-08-20T18:43:14.878499+00:00",
  "score": 1.0,
  "title": "Suntory Aims To Become The Number 1 Ready-To-Drink Company In World",
  "description": "“Suntory’s ambition is to be the number one RTD company in the world,”says Carol Robert, managing director U.S. ready-to-drink at Suntory Global Spirits.",
  "content": "Suntory wants to be the number one ready-to-drink company in the world.\n\n“Suntory’s ambition is to be the number one RTD company in the world,”says Carol Robert, managing director U.S. ready-to-drink at Suntory Global Spirits.\n\n“RTD as a category continues to grow exponentially,” says Eric Schuetzler, vice president of global research and development. “We believe this trend is here to stay. We believe this is going to be a huge part of the beverage space for us to play in.”\n\nRight now, Suntory is ranked third globally, and it is the number one RTD company in Japan, also leading in markets like Australia, Germany and Canada.\n\nAs a company, Suntory has been in the RTD space for decades. “RTD development at Suntory is backed by more than 100 years of distilling, blending and flavor mastery,” Robert says. “We used that expertise to enter the RTD space in the early 1990s with a gin and tonic offering and a Super Chi-Hi.”\n\nIn 2005, Suntory introduced the -196 Vodka Seltzer in Japan in 2005, and “we have continued innovating since then,” Robert says.\n\nEarlier this year, the -196 line unveiled in the United States. “The U.S. is a priority market,” Schuetzler says.\n\nThat priority makes sense. Grand View Research says the U.S. ready-to-drink cocktail market size is estimated at $903.4 million in 2024 and is expected to reach $1.03 billion in 2025, It's projected to grow at a Compound Annual Growth Rate of 15.4% from 2025 to 2030, increasing to $2.11 billion by 2030.\n\nAccording to IWSR, the RTD category is forecast to more than double its 2019 share of total beverage alcoholic servings by 2028.\n\n“RTDs are popular with many different consumers because they offer a wide variety of options and meet so many different needs,” Robert says. “We do see that RTDs are especially popular among younger generations who are seeking exciting flavor experiences but do not want to commit to a full bottled spirit.”\n\nFlavor expertise and technical prowess will help Suntory grow its market share, Schuetzler and Roberts say. For example, for -196, Suntory uses a freeze crush process in which whole fruits - lemons, strawberries, etc - are frozen in liquid nitrogen at -196 degrees Celsius. “That’s 11 times as cold as your freezer,” Schuetzler says. “We’re getting the whole fruit infused into the vodka. That makes the final product deliver something no one else can.”\n\nAnother innovative brand in the Suntory line is On the Rocks bottled and canned cocktails. “We just launched a new campaign for On The Rocks called ‘Make It A Cocktail,’” Robert says. “The campaign challenges the idea that cocktails are only for special occasions.”\n\nGrowth for Suntory will be fueled by authenticity and quality, Schuetzler says. “We don’t have to shield anything when we talk about our RTDs,” Schuetzler says. “If you look at any RTD in our portfolio, you should see the products in it, in the way it’s represented, and in the way that you perceive it when you consume it.”\n\n“Our goal is to deliver extraordinary experiences for consumers, so that means continuing to expand On The Rocks and -196 with new flavors and to develop new-to-the-world offerings, too,” Robert says.",
  "medium": "Article",
  "links": [
    "https://www.theiwsr.com/insight/maturing-rtd-category-poised-for-sustained-growth/",
    "https://www.grandviewresearch.com/industry-analysis/us-ready-to-drink-cocktails-market-report",
    "https://www.suntory.com/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Suntory",
      "weight": 0.08297454
    },
    {
      "name": "Suntory Global Spirits",
      "weight": 0.07876492
    },
    {
      "name": "RTD development",
      "weight": 0.075958446
    },
    {
      "name": "RTD",
      "weight": 0.07193386
    },
    {
      "name": "exciting flavor experiences",
      "weight": 0.06956152
    },
    {
      "name": "On The Rocks",
      "weight": 0.06938923
    },
    {
      "name": "Eric Schuetzler",
      "weight": 0.06909188
    },
    {
      "name": "Carol Robert",
      "weight": 0.06712884
    },
    {
      "name": "many different consumers",
      "weight": 0.06667512
    },
    {
      "name": "new flavors",
      "weight": 0.06639201
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.96142578125
    },
    {
      "name": "/Food & Drink/Beverages/Alcoholic Beverages",
      "score": 0.491455078125
    }
  ],
  "sentiment": {
    "positive": 0.8257175,
    "negative": 0.02017287,
    "neutral": 0.15410958
  },
  "summary": "Suntory is aiming to become the number one ready-to-drink company in the world, with its ambition being achieved through its innovative line of On the Rocks and -196. The company has been in the RTD space for decades and is currently ranked third globally and is the number two RTD company in Japan. Eric Schuetzler, vice president of global research and development, predicts that the category will continue to grow. Suntory's focus is on authenticity and quality, with the potential for an increase in market share.",
  "shortSummary": "Suntory aims to be the number one RTD company globally, leveraging its extensive global experience and innovative brands like On The Rocks and -196.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "38085897c2874526be9b0dba80b6912f",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.grandviewresearch.com/industry-analysis/us-ready-to-drink-cocktails-market-report",
      "text": "The U.S. ready-to-drink cocktails market size was valued at USD 903.4 million in 2024 and is anticipated to grow at a CAGR of 15.3% from 2025 to 2030. A key trend is the increasing demand for convenience and portability. Consumers, especially millennials and Gen Z, are drawn to RTDs as an easy-to-enjoy option for social gatherings, outdoor activities, and at-home consumption. This convenience factor, coupled with the perception that RTDs offer a consistent and pre-mixed cocktail experience, is fueling a shift away from traditional mixing and towards ready-to-enjoy alternatives. This preference for ease and on-the-go consumption positions RTDs as a versatile choice for meeting diverse needs.\nWhile convenience remains a core driver, consumers are increasingly seeking higher-quality ingredients, unique flavor profiles, and sophisticated packaging, driving demand for premium RTD options. This includes cocktails made with real spirits, high-quality juices, and natural flavors, often mirroring the experience of ordering a handcrafted cocktail at a bar. Moreover, the use of innovative packaging formats, such as sleek cans, resealable pouches, and even sustainable materials, also plays a key role in attracting consumers and differentiating products on the shelf. Besides, R&D efforts are focused on refining production processes to ensure consistent quality and shelf stability while preserving the integrity of the ingredients and flavor profiles.\nConsumers are becoming more conscious of their health and are seeking low-calorie, low-sugar, and gluten-free alcoholic beverage options. This has led to the emergence of RTDs made with lighter spirits, natural sweeteners, and innovative flavor combinations that appeal to health-conscious consumers. Moreover, the growing demand for healthier options is driving innovation in the ready-to-drink cocktails market, leading to the development of new products that cater to specific dietary needs and preferences. This includes exploring globally inspired flavors, such as Japanese Highballs or South American caipirinhas, and incorporating unique ingredients sourced from around the world.\nThe growth of e-commerce, direct-to-consumer channels, and the increasing availability of RTDs in various retail outlets are contributing to the market's growth. RTDs are now readily available in supermarkets, liquor stores, convenience stores, and even online platforms, making them easily accessible to a wider range of consumers. This increased availability, coupled with effective marketing and promotional campaigns, is further driving demand and contributing to the continued expansion of the U.S. ready-to-drink cocktails industry.\nFormulating RTDs that accurately replicate the taste of freshly made cocktails requires significant expertise in flavor chemistry and ingredient interactions. Companies are investing in research to optimize blending techniques, preservation methods, and packaging solutions that minimize flavor degradation over time. This includes exploring techniques such as retort processing, tunnel pasteurization, and modified atmosphere packaging to extend shelf life without compromising on the taste and aroma of the final product. Furthermore, R&D is also focused on developing new and innovative ingredients, such as natural preservatives and flavor enhancers, that can enhance the overall quality and appeal of RTD cocktails.\nThe U.S. malt-based RTD cocktails market accounted for a revenue share of 82.5% in 2024, driven by consumer demand for convenient and sessionable alcoholic beverages. A key trend is the focus on lower alcohol content (ABV) options that appeal to health-conscious consumers and those seeking a lighter drinking experience. Moreover, the versatility of flavors within the malt-based RTD segment, ranging from classic cocktails like margaritas and Moscow mules to innovative fruit-infused blends, also contributes to their expanding appeal. Besides, the demand is further fueled by the ease of distribution and availability of malt-based RTDs, as they often face less stringent regulatory hurdles compared to spirit-based counterparts.\nThe U.S. spirit-based RTD cocktails market is anticipated to witness a CAGR of 22.6% from 2025 to 2030, fueled by a desire for premium, authentic cocktail experiences without the hassle of mixing. Brands are focusing on replicating bar-quality cocktails in a convenient format, often featuring well-known spirit brands or crafting unique, in-house spirit blends. Direct-to-consumer (DTC) sales channels and sophisticated packaging are also increasingly important for differentiation and reaching target audiences. The rise of premiumization and a growing appreciation for authentic cocktails is also a key driver, with consumers willing to pay more for RTDs made with genuine spirits and high-quality ingredients. Furthermore, the increasing popularity of outdoor activities and social gatherings is boosting demand for portable and convenient cocktail options.\nThe U.S. canned RTD cocktails market accounted for a revenue share of 80.4% in 2024. Cans are lightweight, durable, and easily recyclable, making them a preferred choice for outdoor activities, concerts, and on-the-go consumption. Their compact size also allows for easier storage and chilling, appealing to consumers with limited fridge space. Furthermore, aluminum cans offer superior protection against light and oxygen, preserving the flavor and freshness of the cocktail for a longer shelf life. The visual appeal of cans is also a factor; manufacturers are leveraging creative designs and branding to attract consumers, creating visually appealing and attention-grabbing packaging that stands out on shelves. The lower cost of aluminum compared to glass contributes to competitive pricing, making canned RTDs attractive to price-conscious consumers.\nThe U.S. bottled RTD cocktails market is anticipated to witness a growth rate of 15.8% from 2025 to 2030, offering perceived premiumization and a more traditional cocktail experience. Glass bottles evoke a sense of sophistication and craftsmanship, appealing to consumers who are seeking a higher-end, bar-quality cocktail. Many premium brands opt for glass bottles to differentiate themselves and convey a sense of authenticity and luxury. The transparency of the glass allows consumers to see the color and clarity of the cocktail, enhancing the visual appeal and perceived quality of the product. While bottles may be less portable than cans, they remain a popular choice for at-home consumption, dinner parties, and gifting occasions, appealing to consumers who prioritize the aesthetic and sensory experience of enjoying a cocktail.\nThe sales of ready-to-drink cocktails through hypermarkets/supermarket channels accounted for a revenue share of 45.6% in 2024. Hypermarkets and supermarkets are pivotal channels for RTD cocktail distribution, leveraging their wide reach and established customer base. These retailers offer a convenient one-stop shopping experience, allowing consumers to purchase RTDs alongside their regular groceries and household items. The availability of RTDs in supermarkets is particularly appealing for planned purchases and social gatherings, where consumers are looking for convenient beverage options for a group. Strategic placement within the store, such as near the beer and wine sections or in dedicated RTD displays, can significantly impact sales. Furthermore, promotional activities like in-store sampling, discounts, and bundle deals drive trial and repeat purchases.\nThe online segment of the U.S. ready-to-drink cocktails industry is estimated to grow at a CAGR of 17.5% from 2025 to 2030, offering consumers unparalleled convenience, selection, and access. Direct-to-consumer (DTC) sales are witnessing significant growth, driven by factors like ease of browsing, personalized recommendations, and home delivery. Online platforms provide a valuable opportunity for brands, especially smaller and craft producers, to reach a wider audience beyond their immediate geographic area. Moreover, some consumers appreciate the discrete shopping experience that many online retailers provide, allowing them to easily browse and purchase products at their leisure. Besides, online retailers often offer unique product bundles, subscription services, and personalized recommendations, creating a more tailored shopping experience.\nKey companies operating in the U.S. ready-to-drink cocktails industry including Ranch Rider Spirits Co., House of Delola, LLC, Diageo plc, Brown-Forman, Bacardi Limited, Asahi Group Holdings, Ltd., Pernod Ricard, Halewood Wines & Spirits, White Claw, Suntory Holdings Limited, High Noon Spirits Company and Anheuser-Busch InBev hold significant positions in the U.S. RTD cocktails market, through their established distribution networks, strong brand recognition, and diversified product portfolios. These companies leverage their existing resources to launch innovative RTD variations of classic cocktails, experiment with unique flavor combinations, and cater to specific consumer preferences, such as low-calorie or organic options.\nStrategic activities like new product launches, mergers, acquisitions, and partnerships further shape the competitive landscape. Major players continuously innovate to stay ahead of evolving consumer trends, often focusing on sustainable packaging and collaborations with celebrity endorsements. For example, acquisitions of smaller, innovative RTD brands allow larger companies to quickly tap into emerging market segments. Partnerships with established beverage companies or retailers enable broader distribution reach and increased market penetration. These strategies are crucial for expanding market share, optimizing production capabilities, and ultimately, capturing a larger slice of the rapidly growing U.S. ready-to-drink cocktails industry.\nIn September 2024, Molson Coors made a significant move towards expanding its presence in the burgeoning non-alcoholic beverage market by announcing a strategic partnership with Naked Life, an Australian brand specializing in ready-to-drink (RTD) non-alcoholic cocktails. This collaboration aims to introduce Naked Life's innovative canned cocktails to the U.S. market, allowing Molson Coors to tap into the increasing demand for sophisticated, alcohol-free alternatives.\nIn September 2024, Bacardi Limited announced the form of a strategic partnership with The Coca-Cola Company to launch BACARDÍ rum and Coca-Cola as a ready-to-drink (RTD) cocktail, signaling a strategic move to capitalize on the burgeoning RTD market and leverage the iconic brand recognition of both powerhouse companies. This collaboration aims to provide consumers with a convenient and consistently high-quality version of a classic cocktail. The initial launch targeting select European markets and Mexico in 2025 indicates a phased rollout, allowing for market testing, refinement of the product based on consumer feedback, and optimization of supply chain logistics before a wider global expansion.\n|\nReport Attribute |\nDetails |\n|\nMarket size value in 2025 |\nUSD 1.03 billion |\n|\nRevenue forecast in 2030 |\nUSD 2.11 billion |\n|\nGrowth rate |\nCAGR of 15.3% from 2025 to 2030 |\n|\nActuals |\n2018 - 2024 |\n|\nForecast period |\n2025 - 2030 |\n|\nQuantitative units |\nRevenue in USD million/billion, and CAGR from 2025 to 2030 |\n|\nQuantitative units |\nVolume in thousand 9-liter cases and CAGR from 2025 to 2030 |\n|\nReport coverage |\nRevenue forecast, volume forecast, company ranking, competitive landscape, growth factors, and trends |\n|\nSegments covered |\nType, packaging, distribution channel |\n|\nKey companies profiled |\nRanch Rider Spirits Co.; House of Delola, LLC; Diageo plc; Brown-Forman; Bacardi Limited; Asahi Group Holdings, Ltd.; Pernod Ricard; Halewood Wines & Spirits; White Claw; Suntory Holdings Limited; High Noon Spirits Company; and Anheuser-Busch InBev |\n|\nCustomization scope |\nFree report customization (equivalent up to 8 analysts working days) with purchase. Addition or alteration to country, regional & segment scope. |\n|\nPricing and purchase options |\nAvail customized purchase options to meet your exact research needs. Explore purchase options |\nThis report forecasts volume and revenue growth on the country level and provides an analysis of the industry trends in each of the sub-segments from 2018 to 2030. For this study, Grand View Research has segmented the U.S. ready-to-drink cocktails market report based on type, packaging, and distribution channel:\nType Outlook (Volume, Thousand 9-Liter Cases; Revenue, USD Million, 2018 - 2030)\nMalt-based\nSpirit-based\nWine-based\nPackaging Outlook (Volume, Thousand 9-Liter Cases; Revenue, USD Million, 2018 - 2030)\nBottles\nCans\nDistribution Channel Outlook (Volume, Thousand 9-Liter Cases; Revenue, USD Million, 2018 - 2030)\nHypermarkets/Supermarkets\nOnline\nLiquor Stores\nb. The U.S. ready-to-drink cocktails market size was estimated at USD 903.4 million in 2024 and is expected to reach USD 1.03 billion in 2025.\nb. The U.S. ready-to-drink cocktails market is expected to grow at a compound annual growth rate of 15.4% from 2025 to 2030 to reach USD 2.11 billion by 2030.\nb. The U.S. malt-based RTD cocktails market accounted for a revenue share of 82.5% in 2024, driven by consumer demand for convenient and sessionable alcoholic beverages. A key trend is the focus on lower alcohol content (ABV) options that appeal to health-conscious consumers and those seeking a lighter drinking experience.\nb. Some of the key market players in the U.S. ready-to-drink cocktails market are Ranch Rider Spirits Co., House of Delola, LLC, Diageo plc, Brown-Forman, Bacardi Limited, Asahi Group Holdings, Ltd., Pernod Ricard, Halewood Wines & Spirits, White Claw, Suntory Holdings Limited, High Noon Spirits Company and Anheuser-Busch InBev.\nb. A key trend is the increasing demand for convenience and portability. Consumers, especially millennials and Gen Z, are drawn to RTDs as an easy-to-enjoy option for social gatherings, outdoor activities, and at-home consumption. This convenience factor, coupled with the perception that RTDs offer a consistent and pre-mixed cocktail experience, is fueling a shift away from traditional mixing and towards ready-to-enjoy alternatives.\n45% of our reports are customized. Tailor this report to your needs; reach out to us.\nESOMAR & Great Work to Place Certified\nISO 9001:2015 & 27001:2022 Certified\nWe are GDPR and CCPA compliant! Your transaction & personal information is safe and secure. For more details, please read our privacy policy.\n\"The quality of research they have done for us has been excellent.\""
    },
    {
      "url": "https://www.theiwsr.com/insight/maturing-rtd-category-poised-for-sustained-growth/",
      "text": "10/10/2024\nThe dynamic but maturing global RTD category will continue to expand its share of total beverage alcohol (TBA) over the next few years, with volume growth expected in all of its top 10 markets, according to new data from IWSR, the global authority on beverage alcohol data and intelligence.\nA resurgence in consumer recruitment and consumption frequency is driving renewed gains – albeit at a slower rate than in the past few years – and RTDs are increasingly viewed as an affordable alternative to spirits, beer and wine. At the same time, innovation is becoming more effective as the number of product launches diminishes, while volumes remain resilient.\nAccording to IWSR’s newly published RTDs Strategic Study 2024, RTD volumes in the top 10 global markets – Canada, the US, Mexico, Brazil, South Africa, the UK, Germany, China, Japan and Australia – rose by 2%, with the strongest gains in Mexico (+8%) and Germany (+4%). All markets except Australia (-1%) registered gains.\nIt caps a buoyant five-year period for the category, in which the US, Canada, Mexico, China and Germany all registered double-digit CAGR gains (2019-23), but growth has slowed in the past year as many markets reach maturity and TBA growth slows.\nNonetheless, all of the top 10 markets are forecast to register CAGR volume gains between 2023 and 2028, spearheaded by Brazil (+6%), Australia (+3.5%), Germany (+3.5%), the US (+3%) and Canada (+3%).\nThe RTD category’s chief growth engines are focused on the US, where hard tea, FABs and cocktails/long drinks will be the biggest volume drivers in the coming years.\n“Despite the slowdown in growth, RTDs are continuing to gain share of TBA – a trend that we expect to continue throughout the forecast period, and particularly in the more established markets of Japan, the US, Australia and Canada,” says Susie Goldspink, Head of RTD Insights, IWSR.\n“As this occurs, RTD consumption is impacting other categories, so companies need to join or invest in the RTD market in order to combat this. The UK, Japan, Brazil and Australia all report a decline in spirits consumption as a result of people drinking more RTDs, with other markets reporting a similar reduction in beer.\n“Building brand awareness and loyalty is necessary to remain competitive – as innovation slows and the category becomes more established, connecting with the consumer is becoming increasingly important.\n“But local is still paramount: despite the isolated successes of a few international products, RTD brands enjoy success through local propositions and flavour appeal. Brand owners would do well not to deter consumers by offering them an international proposition that lacks local nuance.”\nIWSR’s analysis of the global RTD category also shows:\nRecruitment resurgent\nAfter some years of declining levels of recruitment, more consumers entered the RTD category in 2024, according to IWSR consumer research, which was in turn reflected in cautious volume growth and an increased share of TBA.\nThis was particularly pronounced in the UK (where 19% of RTD consumers were new to the category), Germany (18%), Canada (18%) and the US (17%). Across all top 10 markets, the proportion of new entrants was 16%, marking a notable increase compared to 2023.\n“After several years of a slowdown in recruitment, 2024 accrued more RTD buyers who had entered the category in the past two years,” says Richard Halstead, COO Consumer Research, IWSR. “Markets with the highest level of recruitment are typically those that skew to older RTD buyers, and new recruits skew younger across markets.”\nFrequency and Intensity\nIWSR research shows that certain markets – mainly those with younger LDA consumers – have seen an increase in their frequency of RTD consumption, whereas intensity of consumption (the number of RTD drinks consumed per occasion) has stayed stable.\n“However, there are marked differences in consumption patterns across countries,” says Halstead. “Older consumer bases, such as those in Germany, Canada, the UK and the US, are more likely to drink less per occasion, while – perhaps unsurprisingly – markets with a larger younger consumer base see higher consumption intensity.”\nInfluence of flavour vs brand\nWhile flavour remains the most important choice cue, it is continuing to reduce in influence as consumers engage with the category: in 2022, 57% of RTD consumers said it was a cue to purchase, but in 2024 this figure fell to 49%.\nHowever, brand is also becoming a less significant cue, falling to 29% in 2024, reflecting the fact that brand loyalty is lower in more fragmented markets, and also that products with a branded spirit base are underperforming versus RTDs with an unbranded spirit base. Generally speaking, RTD brands are strong locally, rather than universally.\nConsumer confusion about alcohol bases\nMalt-based RTDs are continuing their decline, leaving spirit and wine bases to drive category growth; volume growth for spirit-based products remains strong, with wine performing well in the last year.\nHowever, IWSR research indicates that consumers are often confused about the base of RTD products: for example, most buyers (54%) associate the hard seltzer segment with spirits, when the vast majority of products (83%) are in fact malt-based.\nAt the same time, traditionally malt-based categories, such as hard seltzers and hard teas, are undergoing a switch to spirit-based products, premiumising the offering and also trying to alleviate malt-based RTDs’ structural decline.\n“A new innovation race in spirit-based hard seltzer products has taken over from the previous malt-based battle,” explains Goldspink. “But the establishment of this easy-to-drink, lower-ABV, spirit-based category, and the proliferation of me-too products, runs the risk of overwhelming consumers once again.”\nInnovation efficiency\nAs it matures, the RTD category is becoming less reliant on innovation to drive growth, and experimentation among consumers is also slowing down – reflecting both a diminishing appetite for new flavours and cost-conscious consumers unwilling to take a risk on an unfamiliar product. In 2021, there were more than 3,300 RTD product launches; in the first half of 2024, there were less than 1,000.\n“While the pace of innovation has tailed off, volumes continue to grow as we see less reliance on innovation to drive performance, and consumers wanting to minimise risk on new products they do not know,” says Goldspink.\n“At the same time, effective flavour options and variety packs are helping to sustain growth in many markets, especially among younger consumers – and innovation remains key to engaging with this age cohort.”\nThe IWSR RTDs Strategic Study 2024 is now available to all subscribing clients. For further information or to gain access, please email enquiries@theiwsr.com. Current IWSR clients can contact their IWSR Account Manager.\nThe above analysis reflects IWSR data from the 2024 data release. For more in-depth data and current analysis, please get in touch.\nCATEGORY: RTDs | MARKET: All | TREND: Convenience |\nIf you’re interested in learning more about our products or solutions, feel free to contact us and a member of our team will get in touch with you."
    }
  ],
  "argos_summary": "Suntory is positioning itself to become the world’s leading ready‑to‑drink (RTD) brand, currently ranked third globally and number one in Japan, by leveraging its 100‑year distilling heritage and innovative products such as the -196 Vodka Seltzer and On the Rocks cocktails. The company prioritises the U.S. market, where RTDs are projected to grow from $903.4 million in 2024 to $1.03 billion in 2025 and reach $2.11 billion by 2030, driven by consumer demand for convenience, premium ingredients, and health‑conscious options. Industry trends show a shift toward spirit‑based and low‑ABV RTDs, increased online and retail distribution, and a focus on local flavour appeal, while major players like Molson Coors and Bacardi are forming partnerships to expand their RTD portfolios. Suntory’s strategy emphasizes authenticity, quality, and continuous flavor innovation to capture a larger share of the expanding RTD market.",
  "argos_id": "OG6G8PAQS"
}