{
  "url": "https://www.usatoday.com/picture-gallery/pets-animals/wildlife/2025/08/20/trail-camera-project-wildlife-photos/85745168007/",
  "authorsByline": "Paul A. Smith",
  "articleId": "1df6858a2b844b1db2e82fbb0063ad64",
  "source": {
    "domain": "usatoday.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "VA",
      "county": "Fairfax County",
      "city": "McLean",
      "coordinates": {
        "lat": 38.9342888,
        "lon": -77.1776327
      }
    }
  },
  "imageUrl": "https://www.usatoday.com/gcdn/authoring/authoring-images/2025/08/08/PMJS/85584165007-snapshot-wisconsin-2015-images-of-romp-of-otters.jpg?crop=917,517,x0,y85&width=917&height=517&format=pjpg&auto=webp",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-20T18:47:14+00:00",
  "addDate": "2025-08-20T19:10:02.658049+00:00",
  "refreshDate": "2025-08-20T19:10:02.658050+00:00",
  "score": 1.0,
  "title": "Otters, hawks and wolves: 10-years of trail cam wildlife photos",
  "description": "In July 2025 the Snapshot Wisconsin project celebrated its 10th anniversary and 100 million images collected.",
  "content": "See the astonishing images and Snapshot Wisconsin, a Wisconsin trail cam project led by the Department of Natural Resources and involving hundreds of volunteers, is celebrating its 10th year and 100 million images captured in 2025. In one, a red-winged blackbird perches on the back of a sandhill crane. In another, eight river otters romp through a grassy opening.See the astonishing images and read more Snapshot Wisconsin And Department Of Natural Resources\n\nWild turkeys and white-tailed deer are captured by a Snapshot Wisconsin trail camera in Iowa County. Snapshot Wisconsin And Department Of Natural Resources\n\nA Snapshot Wisconsin trail camera captured this image of the sun streaming through trees as a white-tailed deer walked through a field with patches of snow. Snapshot Wisconsin And Department Of Natural Resources\n\nA white-tailed deer doe and fawn were captured by a Snapshot Wisconsin trail camera in Ashland County. Snapshot Wisconsin And Department Of Natural Resources\n\nA wild turkey and white-tailed deer fawn were captured by a Snapshot Wisconsin trail camera in Outagamie County. Snapshot Wisconsin And Department Of Natural Resources\n\nA red-winged blackbird perches on the back of a sandhill crane in this image captured by a Snapshot Wisconsin trail camera in Walworth County. Snapshot Wisconsin And Department Of Natural Resources\n\nA group of elk from a previous shipment from Kentucky are shown in a holding pen in northern Wisconsin shortly after their transfer. Provided By Wisconsin Department Of Natural Resources, Snapshot Wisconsin\n\nA cow elk with feeding offspring caught on a trail cam in 2015 in Sawyer County. Provided By Wisconsin Department Of Natural Resources, Snapshot Wisconsin\n\nA Wisconsin trail cam photographs a wolf. The images come from Snapshot Wisconsin, a volunteer-based project that helps to identify species. Provided By Wisconsin Department Of Natural Resources\n\nA great blue heron. This photo and the others in this gallery are from Snapshot Wisconsin, a citizen-science effort coordinated by the Department of Natural Resources to monitor wildlife and information wildlife management in the state. Read more about the project at https://jsonl.in/2J1VJGZ. Provided By Wisconsin Department Of Natural Resources",
  "medium": "Article",
  "links": [
    "https://www.jsonline.com/staff/2646621001/paul-a-smith/",
    "https://www.usatoday.com/story/sports/columnists/paul-smith/2025/08/17/dnr-and-volunteers-celebrate-10-years-and-100-million-animal-images/85532602007/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Snapshot Wisconsin",
      "weight": 0.163338
    },
    {
      "name": "Wisconsin Department",
      "weight": 0.15453215
    },
    {
      "name": "Wisconsin",
      "weight": 0.13247943
    },
    {
      "name": "northern Wisconsin",
      "weight": 0.13141835
    },
    {
      "name": "Natural Resources",
      "weight": 0.1220417
    },
    {
      "name": "trail cam wildlife photos",
      "weight": 0.112421006
    },
    {
      "name": "Snapshot",
      "weight": 0.11163967
    },
    {
      "name": "A Snapshot Wisconsin trail camera",
      "weight": 0.10845202
    },
    {
      "name": "a Snapshot Wisconsin trail camera",
      "weight": 0.10845202
    },
    {
      "name": "Wisconsin Department Of Natural Resources",
      "weight": 0.106581785
    }
  ],
  "topics": [
    {
      "name": "Wildlife"
    }
  ],
  "categories": [
    {
      "name": "Science"
    }
  ],
  "taxonomies": [
    {
      "name": "/Pets & Animals/Wildlife",
      "score": 0.892578125
    },
    {
      "name": "/Arts & Entertainment/Online Media/Online Image Galleries",
      "score": 0.5634765625
    },
    {
      "name": "/Pets & Animals/Animal Products & Services/Animal Welfare",
      "score": 0.45458984375
    },
    {
      "name": "/Arts & Entertainment/Offbeat/Other",
      "score": 0.426025390625
    },
    {
      "name": "/News/Local News",
      "score": 0.410888671875
    }
  ],
  "sentiment": {
    "positive": 0.20364884,
    "negative": 0.15493731,
    "neutral": 0.64141387
  },
  "summary": "The Wisconsin trail cam project led by the Department of Natural Resources, Snapshot Wisconsin, is celebrating its 10th year and will capture 100 million images of wildlife. The images include a red-winged blackbird perching on the back of a sandhill crane, wild turkeys and white-tailed deer, and a group of elk from Kentucky being transported from their previous shipment. The project aims to identify species and monitor wildlife and information wildlife management in the state.",
  "shortSummary": "The 10th anniversary of the Snapshot Wisconsin trail cam project features stunning images of wildlife, including stunningly close-up photos of red-winged blackbird perched on a sandhill crane.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "1ab9dcbef1c94822a8b162168ce4555c",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.usatoday.com/story/sports/columnists/paul-smith/2025/08/17/dnr-and-volunteers-celebrate-10-years-and-100-million-animal-images/85532602007/",
      "text": "Smith: Snapshot Wisconsin trail cam project captures major milestones\nSnapshot Wisconsin, a Wisconsin trail cam project led by the DNR and involving hundreds of volunteers, is celebrating its 10th year and 100 million images captured.\nThe images are astonishing.\nIn one, a red-winged blackbird perches on the back of a sandhill crane. In another, eight river otters romp through a grassy opening. In another, a pair of wild turkeys shares a trail with two white-tailed deer, each animal positioned so perfectly in the frame they appear to have taken cues from an art director.\nEven more astounding, they weren't taken by a professional nature photographer but by a trail camera.\nAnd to top it off, they aren't just amazing art, they are science.\nThe images were collected as part of Snapshot Wisconsin, a statewide trail camera project. It's led by the Department of Natural Resources but requires volunteers to make it go, both in maintaining trail cameras and in classifying data.\nI've written several times about the project since it was introduced more than a decade ago.\nThis year the project is celebrating two milestones: its 10th anniversary and 100 million images collected.\nI think it's safe to say: Snapshot has been a success all around.\nSnapshot Wisconsin is led by two DNR staffers, both with doctorates from the University of Wisconsin-Madison: Christine Anhalt-Depies, research scientist; and Jennifer Stenglein, wildlife research scientist.\nBoth have been with the program since its beginning, have helped guide its path and now have valuable perspective on one of the state's largest citizen science projects.\n\"We've learned so much in 10 years and it's grown so much,\" Stenglein said. \"I think we now know trail camera work is part of the future of wildlife management.\"\nThe work started with a focus on two counties, Sawyer and Iowa. Volunteers were provided with training and given a trail camera. Importantly, they were responsible to periodically upload images to a server.\nIt's here, on Zooniverse, that people across planet can participate by classifying photos.\nIs it a squirrel or a woodchuck? A fisher or a pine marten? A mink or an otter?\nWith its concept proven, Snapshot Wisconsin expanded statewide in 2018. More than 2,000 cameras are placed across the state, Anhalt-Depies said.\nApproximately 75% of volunteers participate on private property, the balance on public lands.\nSnapshot Wisconsin hit the 50 million image mark in 2020. Five years later it's surpassed 100 million.\nLike me, you may wonder: what species is captured most often by Snapshot Wisconsin trail cameras?\nIt's not even close.\nIt's white-tailed deer. Snapshot has more than 22 million detections of deer, said Anhalt-Depies.\nSquirrels are second, with 2.7 million, raccoons third with 2 million.\nAmong other wildlife of great interest, 365,245 images of wild turkeys, 161,061 of coyotes, 29,065 of black bears, 15,281 of bobcats, 6,608 of gray wolves and 3,363 of elk.\nThe data collected helps the DNR monitor wildlife populations throughout the state and informs management decisions.\nIt has resulted in more than 20 scientific publications and drawn more than 25,000 volunteers to contribute on Zooniverse.\nSnapshot Wisconsin is supporting management decisions for 14 species, Anhalt-Depies said. For some time, it has provided data for elk and wolf monitoring or management, as well as deer fawn-to-doe ratios for each deer management unit.\nThe more recent development is providing temporal and spatial trends for 11 other species: black bear, beaver, bobcat, coyote, fisher, gray fox, opossum, otter, raccoon, red fox, and skunk.\nThe project has also expanded to Snapshot in the Classroom, a resource which offers wildlife-focused K-12 lesson plans, flash cards and activities for parents and educators.\nAnother statistic from the project: out of all Snapshot Wisconsin photos, only 0.01% have multiple species in a trigger. The species most seen together are turkeys and deer.\nThe project's trail cams have picked up endangered species, including the pine marten and whooping crane.\nBut no image has been collected of a lynx, spotted skunk or wolverine, species not documented in the state for many years.\nOf course the advantage of trail cameras is they keep collecting images all day, every day they are in the field. This 24/7 monitoring increases the odds that, if a species is in the Badger State, it will eventually be detected by a trail cam. Will a previously undocumented animal show up in Wisconsin? Time, and dedicated reviewers of Snapshot Wisconsin images, will tell.\nHere's one thing that's certain for the project's future: Snapshot Wisconsin will work with the University of Wisconsin’s Department of Forest and Wildlife Ecology to study how the project can contribute to a better understanding of how wildlife is changing and responding to the seasons.\nIt will include the use of snow stakes, or marked poles, to record snow depth. These poles will be placed at approximately 300 Snapshot Wisconsin trail camera sites, with the aim that the cameras will pick up and record the changing snow depth.\nIt will also utilize temperature gauges placed alongside the cameras to record temperature data.\nIn addition, audio recording units will be placed near the cameras to capture the sounds of animals that might not necessarily be visually captured by a trail camera, for example bird songs or amphibian vocalizations.\nAnd all the time, the database will keep growing. Other partnerships and research initiatives will no doubt also be forthcoming for Snapshot Wisconsin.\n\"It's exciting to think about what the future will hold,\" Stenglein said. \"And I'm sure we will have surprises, just like we routinely see on the trail cams we have out there now.\""
    }
  ],
  "argos_summary": "Snapshot Wisconsin, a volunteer‑led trail camera initiative run by the Wisconsin Department of Natural Resources, marks its 10th anniversary and 100 million images captured in 2025. The project, which began in two counties and now covers more than 2,000 cameras statewide, has generated over 20 scientific papers, 25,000 volunteers on Zooniverse, and detailed data on species such as white‑tailed deer, squirrels, raccoons, and wildlife like elk, wolves, and endangered species. The data inform management decisions for 14 species and support research on population trends, snow depth, temperature, and acoustic monitoring. Snapshot also offers classroom resources and plans to expand collaborations with the University of Wisconsin to deepen ecological insights.",
  "argos_id": "V9ZPP8TI9"
}