{
  "url": "https://www.foxnews.com/politics/mamdani-sidesteps-communism-question-says-his-campaign-about-distribution-wealth",
  "authorsByline": "Nate Foy, Deirdre Heavey",
  "articleId": "d03af818d03d407195edb7e057a10ec4",
  "source": {
    "domain": "foxnews.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://static.foxnews.com/foxnews.com/content/uploads/2025/08/mamdani-brooklyn-megaphone.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-20T14:32:08-04:00",
  "addDate": "2025-08-20T18:41:02.100678+00:00",
  "refreshDate": "2025-08-20T18:41:02.100684+00:00",
  "score": 1.0,
  "title": "Mamdani sidesteps 'communism' question, says his campaign is about 'distribution of wealth'",
  "description": "Zohran Mamdani, New York City's Democratic mayoral candidate, addressed President Donald Trump's \"communist\" label by citing Dr. Martin Luther King Jr. and highlighting affordability.",
  "content": "New York City Democratic mayoral nominee Zohran Mamdani dodged a question about President Donald Trump labeling him a \"communist\" when pressed by Fox News' Nate Foy on Wednesday.\n\nReferencing a Fox News Digital report, in which his supporters dismissed Mamdani's \"communist\" label, Foy asked the self-described democratic socialist if the distinction between communism and socialism matters.\n\n\"Are there elements of communism in your platform?\" Foy asked.\n\n\"The elements of my platform are all about affordability, and I am a democratic socialist,\" Mamdani said. \"When New Yorkers ask me what it means, I take them to the words of Dr. Martin Luther King, who said, 'Call it democracy or call it democratic socialism, there must be a better distribution of wealth for all of God's children in this country.'\"\n\nSince Mamdani's primary upset earlier this summer, the Democratic mayoral nominee has been by Trump.\n\nZOHRAN MAMDANI LAUNCHES ANTI-TRUMP TOUR ACROSS FIVE BOROUGHS IN NEW YORK CITY\n\nMamdani supporters who spoke to Fox News Digital at a canvass launch in Prospect Park on Sunday dismissed the term, arguing that his primary win represented more than arbitrary labels.\n\n\"It's not necessarily communism that won the New York City primary, but the vision that he's delivering for a more affordable New York,\" said Nina, a door-knocker who wore an \"Educators for Zohran\" T-shirt on Sunday. \"That's what people voted for, and that's what he won on, and that's what he's going to win on.\"\n\nMamdani has been , including Sen. Bernie Sanders, I-Vt., and Rep. Alexandria Ocasio-Cortez, D-N.Y. Trump was quick to label him a \"100% Communist Lunatic\" after Mamdani declared victory in June.\n\nPerry, another Brooklyn canvasser, flipped the script on Trump's nickname for Mamdani, telling Fox News Digital to \"look at the people who are saying he can't do it or who are calling him a socialist or communist.\"\n\nBridget, a New York City teacher, and Perry both shook their heads in disagreement when asked if those labels worry them.\n\n\"It's not about ideology,\" said Nicholas, a Mamdani supporter who volunteered in Prospect Park on Sunday for the campaign's canvass launch. \"It's not trying to demonize these terms, , which, quite frankly, I think the American public does not have a very good idea of what those terms exactly mean.\"\n\nFox News Digital posed the same question to everyday New Yorkers in Manhattan's Union Square on Tuesday evening.\n\nOne voter, Ritvik, who said he was voting for Mamdani in the upcoming November election, despite usually leaning to the right, said the \"communist\" label didn't ;phase him.\n\n\"That kind of rhetoric has always come from the Trump administration, so not particularly surprising to me,\" Ritvik said.\n\nAnother Mamdani voter, Ian, told Fox News Digital that it's \"hard not to ignore the connection between the biggest city in America and the president.\"\n\nBut despite Trump's eagerness to criticize Mamdani, Ian said he appreciates that Mamdani is more focused on delivering for New Yorkers.\n\nMamdani hosted a weeklong \"Five Boroughs Against Trump\" tour across New York City last week.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nThe mayoral hopeful spoke to reporters on Wednesday after joining the Hotel & Gaming Trades Council (HTC) union for a rally outside the Surrey Hotel.\n\nThe protesters criticized the hotel for allegedly not rehiring over 100 union workers who were laid off during the pandemic.",
  "medium": "Article",
  "links": [
    "https://www.foxnews.com/politics/zohran-mamdani-launches-anti-trump-tour-across-five-boroughs-new-york-city",
    "https://www.foxnews.com/video/6377038285112",
    "https://www.foxnews.com/apps-products?pid=AppArticleLink",
    "https://www.foxnews.com/category/us/democratic-party",
    "https://www.foxnews.com/politics/zohran-mamdani-supporters-unfazed-trumps-communist-label-defend-candidates-affordability-fight",
    "https://www.foxnews.com/video/6377146297112",
    "https://www.foxnews.com/category/politics/socialism",
    "https://www.foxnews.com/politics/bernie-sanders-endorses-socialist-mamdani-nyc-mayoral-primary-against-cuomo",
    "https://www.foxnews.com/politics/trump-warns-new-york-city-faces-dire-future-communist-mamdani-takes-office-mayor"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "New York City Democratic mayoral nominee Zohran Mamdani",
      "weight": 0.104425386
    },
    {
      "name": "Mamdani supporters",
      "weight": 0.095165595
    },
    {
      "name": "Zohran Mamdani",
      "weight": 0.09380353
    },
    {
      "name": "Mamdani",
      "weight": 0.09080932
    },
    {
      "name": "New York City",
      "weight": 0.08916153
    },
    {
      "name": "Fox News Digital",
      "weight": 0.088351764
    },
    {
      "name": "New York",
      "weight": 0.08400022
    },
    {
      "name": "New Yorkers",
      "weight": 0.07530976
    },
    {
      "name": "everyday New Yorkers",
      "weight": 0.07380131
    },
    {
      "name": "Donald Trump",
      "weight": 0.070652544
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.9970703125
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.94140625
    },
    {
      "name": "/News/Politics/Campaigns & Elections",
      "score": 0.94140625
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.90283203125
    }
  ],
  "sentiment": {
    "positive": 0.05238267,
    "negative": 0.7373827,
    "neutral": 0.21023463
  },
  "summary": "New York City Democratic mayoral nominee Zohran Mamdani has denied a question about President Donald Trump's labeling him a \"communist\" during a press conference with Fox News' Nate Foy. Mammani, a self-described democratic socialist, said his campaign is about \"affordable\" and his political vision is more than arbitrary labels. Since Mamdagnani's victory in the June primary, Mamdan has been supported by Trump since his victory. Despite the president's criticism, Mammanani's supporters dismissed the term, arguing that his vision for a more affordable New York is what voters voted for.",
  "shortSummary": "New York City Democratic mayoral nominee Zohran Mamdani dismissed a question about communism, emphasizing his platform's focus on affordable, shared wealth.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "9ed5a30d006e4183930f377c16d45463",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.foxnews.com/politics/zohran-mamdani-supporters-unfazed-trumps-communist-label-defend-candidates-affordability-fight",
      "text": "Since Zohran Mamdani's primary upset earlier this summer, the New York City Democratic mayoral nominee has been branded a \"communist\" by President Donald Trump.\nMamdani supporters, who spoke to Fox News Digital at a canvass launch in Prospect Park on Sunday, dismissed the term, arguing that his primary win represented more than arbitrary labels.\n\"It's not necessarily communism that won the New York City primary, but the vision that he's delivering for a more affordable New York,\" Nina, a door-knocker wearing an \"Educators for Zohran\" T-shirt, said. \"That's what people voted for, and that's what he won on, and that's what he's going to win on.\"\nMamdani is a self-described democratic socialist who has been endorsed by progressive leaders, including Sen. Bernie Sanders, I-Vt., and Rep. Alexandria Ocasio-Cortez, D-N.Y. Trump was quick to label him a \"100% Communist Lunatic\" after Mamdani declared victory in June.\nZOHRAN MAMDANI LAUNCHES ANTI-TRUMP TOUR ACROSS FIVE BOROUGHS IN NEW YORK CITY\nPerry, another Brooklyn canvasser, flipped the script on Trump's nickname for Mamdani, telling Fox News Digital to \"look at the people who are saying he can't do it or who are calling him a socialist or communist.\"\nNY DEMS WHO HAVE YET TO ENDORSE MAMDANI UNITE IN HIS DEFENSE AGAINST TRUMP\nBridget, a New York City teacher, and Perry both shook their heads in disagreement when asked if those labels worry them.\n\"It's not about ideology,\" Nicholas, a Mamdani supporter who volunteered in Prospect Park on Sunday for the campaign's canvass launch, said. \"It's not trying to demonize these terms, communism and socialism, which, quite frankly, I think the American public does not have a very good idea of what those terms exactly mean.\"\nNicholas said Mamdani's campaign is \"much bigger than that.\"\nAmong the few dozen supporters who attended the canvass launch, many were teachers.\n\"I want a mayor who's going to stand up for students,\" Bridget said, telling Fox News Digital that it's critical New York City has a mayor who is \"going to fight against the Trump administration for the rights and safety of our students.\"\nMamdani concluded his \"Five Boroughs Against Trump\" tour across New York City last week, visiting a borough a day to spotlight how the Trump administration's sweeping second-term agenda, on key issues including immigration and the economy, is impacting everyday New Yorkers.\n\"I have a lot of students coming from immigrant backgrounds who are worried about their safety, about their parents' safety,\" Nicholas said. \"I have kids who are worried that ICE agents will come into the school and take them out of the classroom.\"\nNicholas explained that's why having a candidate like Mamdani, who is committed to protecting immigrant communities from \"what Trump and his cronies are trying to do, in disappearing people,\" is so important to him.\n\"Having a mayor who stands up against that firmly and boldly, that's why I'm out here,\" he added. \"That's why I want Zohran to be mayor.\"\nPerry said she supports Mamdani because he \"has a large vision for the city,\" particularly on housing.\n\"Let's be big again,\" Perry added, telling Fox News Digital that she loves his \"upbeatness\" and \"openness,\" the likes of which she said, \"We haven't seen in a while.\"\nMamdani has vowed to freeze rents if elected this November. He has accused Adams of appointing Rent Guidelines Board members to raise rents on stabilized apartments.\nFormer Mayor Bill de Blasio's board voted to freeze the rent three times during his tenure.\nFormer Gov. Andrew Cuomo, who lost the primary to Mamadani, called the socialist's plan to freeze rent \"politically convenient posture,\" and said such a move would hurt landlords, who would be \"unable to maintain their buildings.\"\nNina said Mamdani's campaign promises, including fast and free buses and universal child care, \"address the affordability crisis in New York City\" that creates a trickle-down impact on New Yorkers, like her high school students.\nCLICK HERE TO GET THE FOX NEWS APP\n\"I'm out here as an educator,\" Nina said. \"I'm here as a New Yorker who was raised here, who wants to stay here.\"\nUnder Mamdani's leadership, Nina said she believes it's possible."
    },
    {
      "url": "https://www.foxnews.com/politics/bernie-sanders-endorses-socialist-mamdani-nyc-mayoral-primary-against-cuomo",
      "text": "Rising democratic socialist New York City mayoral candidate Zohran Mamdani has secured the backing of one of the most influential figures on the American Left as he looks to edge out former Gov. Andrew Cuomo for the Democratic nomination.\nMamdani, 33, a New York state assembly member, on Tuesday secured the backing of former presidential candidate Sen. Bernie Sanders, I-Vt.\nIt’s a major boost for Mamdani, who has also scored the endorsement of progressive firebrand Rep. Alexandria Ocasio-Cortez, D-N.Y., thereby locking in the two most prominent national figures of the Left. Ocasio-Cortez and Sanders took part in a nationwide \"Fighting Oligarchy Tour\" earlier this year which tapped into discontent with President Donald Trump and sought to energize the democratic socialist movement while advocating for policies similar to Mamdani.\nAOC BACKS RISING PROGRESSIVE CANDIDATE IN NYC DEM PRIMARY IN PUSH TO DEFEAT FRONTRUNNER CUOMO\n\"We need a new politics and new leadership which is prepared to stand up to powerful corporate interests and fight for the working class,\" Sanders said in a statement, according to several reports.\n\"Zohran Mamdani is running an inspirational grassroots campaign, centered on the construction of 200,000 new affordable housing units, a rent freeze, free public buses, cutting fines and fees for small businesses, investing in citywide mental health services, city-owned grocery stores, universal free childcare and a minimum wage increase.\"\nSanders also said that Mamdani will pay for his agenda by taxing the richest 1% of New Yorkers, and said that his campaign is being funded largely through small-dollar donations, \"unlike the corporate Democratic establishment,\" in a dig at Cuomo.\nMamdani has been rising in the most recent public opinion polls in the mayoral primary race and is now a clear second to the more moderate former governor.\n\"At this dangerous moment in history, status quo politics isn’t good enough,\" Sanders, who was born in Brooklyn, wrote on X on Tuesday, sharing a Mamdani post about his endorsement. \"We need new leadership that is prepared to stand up to powerful corporate interests and fight for the working class.\"\nCUOMO ADMITS TO SEEING COVID NURSING HOME DEATH REPORT, SAYS HE MAY HAVE ALTERED IT\nMamdani, who was born in Uganda and moved to the U.S. when he was 7, gushed over the endorsement in his post.\n\"As for so many across this country, @BernieSanders has been the single most influential political figure in my life,\" Mamdani wrote. \"As mayor, I will strive to live up to his example by fighting for the working class every day and hopefully make Brooklyn’s own proud.\"\nWith multiple progressive candidates in the primary race, the endorsement of Mamdani by Sanders seeks to unite fractured progressive voters towards a single candidate in an attempt to block the more moderate Cuomo from returning to power.\nNew York City Council Speaker Adrienne Adams and state Sen. Jessica Ramos are among the progressives still in the race. Ramos has even endorsed Cuomo while staying in the race herself.\nCLICK HERE TO GET THE FOX NEWS APP\nFour years ago, New York City's progressives failed to unite behind a single candidate, which paved the way for now-Mayor Eric Adams, a moderate Democrat, to win the primary and eventually the general election. Adams announced in early April that he would run for re-election as an independent candidate rather than seek the Democratic Party nomination.\nEarly voting kicked off on Saturday, with Election Day being on June 24.\nSanders was first elected to the House of Representatives in 1991, serving for 16 years before being elected to the Senate.\nFox News’ Paul Steinhauser contributed to this report."
    },
    {
      "url": "https://www.foxnews.com/category/us/democratic-party",
      "text": "Texas 6 hours ago Texas GOP lawmakers poised to finalize Trump-backed map after Dem redistricting walkout ends Texas Democrats ended their walkout and returned as Republicans advance a redistricting plan that would likely create five new GOP congressional seats.\nNew York 9 hours ago Stefanik booed offstage as protesters chant 'traitor' during upstate New York memorial event Potential Republican gubernatorial candidate Rep. Elise Stefanik was disrupted by protesters at a memorial event in her home district in upstate New York.\nMedia 17 hours ago Ex-Obama aide warns Democrats can’t counter Trump because voters don’t know what the party stands for \"Pod Save America\" host Jon Lovett lamented during a podcast interview with MSNBC's Nicolle Wallace that Democratic voters don't know what the party stands for.\nCalifornia 18 hours ago ‘Tired of Democracy dying’: Newsom redistricting push faces GOP backlash over voter rights California Gov. Gavin Newsom’s redistricting effort is receiving pushback from Republicans who are accusing the Democrats of “disenfranchising Californians.\"\nMedia 1 day ago Transgender lawmaker says Democratic Party doesn't know how to respond to anti-trans attacks Rep. Sarah McBride, D-Del., a transgender lawmaker, said the Democratic Party didn't know how to respond or engage on transgender issues during an interview with Jaime Harrison.\nJ.B. Pritzker 1 day ago ‘Slap in the face’: Major blue state governor signs bill opening financial aid to illegals Illinois Gov. J.B. Pritzker signed a bill into law opening student financial aid to all residents, regardless of immigration status, including for illegal immigrants.\nDonald Trump 2 days ago Trump announces he'll helm movement to eliminate mail-in voting and voting machines: 'FIGHT LIKE HELL' President Donald Trump announced that he will \"lead a movement to\" eliminate mail-in voting and voting machines, saying he would sign an executive order.\nOpinion 2 days ago Democrats like Zohran Mamdani claim to embrace young people. They’re betraying them NYC mayoral frontrunner Zohran Mamdani's socialist agenda, including housing freezes and reduced police funding, faces criticism for potentially harming working class families\nMedia 2 days ago Eric Swalwell rejects Michelle Obama's 'when they go low, we go high' message, vows to 'bury' Republicans Rep. Eric Swalwell, D-Calif., said that he doesn’t have concerns about Democratic redistricting efforts backfiring while fighting against Texas Republicans.\nMedia 4 days ago Bill Maher slams Democrats like Kamala Harris and the Clintons for being 'afraid' to come on his show Bill Maher criticized Democrats like Kamala Harris and the Clintons on Friday for refusing to appear on his show while Republicans like Ron DeSantis and Bill Barr show up.\nOpinion 4 days ago DAVID MARCUS: Democrats abandon Schumer's imaginary couple, Joe and Eileen Bailey Chuck Schumer's fictional Massapequa voters Joe and Eileen Bailey highlight the Democratic Party's leftward movement on issues like immigration, crime, and abortion\nBarack Obama 4 days ago Obama praises Democrats who fled Texas redistricting vote as ‘inspiring’ Former President Barack Obama praised a group of Texas Democratic lawmakers for fleeing their state to stop a vote on a redistricting bill, calling their actions “inspiring.\"\nZohran Mamdani 5 days ago Mamdani recalls Obama call about 'darkness' in politics after NYC primary victory Democratic socialist Zohran Mamdani said he spoke with former president Barack Obama about hope in politics after his New York City mayoral primary win in June.\nZohran Mamdani 5 days ago Zohran Mamdani closes out his anti-Trump tour in his home borough in Queens Zohran Mamdani concluded his week-long, anti-Trump campaign tour across all five New York City boroughs at a Queens union office, joined by local workers and officials.\nZohran Mamdani 5 days ago 'Not welcome here': Staten Island activist arrested after confronting NYC mayoral candidate Protesters disrupted Zohran Mamdani's Staten Island campaign event with megaphones and profanities, leading to activist Scott Lo Baido's arrest by the NYPD.\nMedia 5 days ago Mamdani warns of 'withering faith' in democracy to deliver for working class NYC mayoral candidate Zohran Mamdani warned in a interview published Thursday that there was declining faith in democracy to deliver for the working class.\nSocial Security 5 days ago Social Security stronger under Trump, critics pushing ‘false’ narrative, commissioner says Frank Bisignano responds to concerns about Trump social security reforms, highlighting a number of operational statistics he says proves the program is doing better under Trump.\nElections 5 days ago Ex-Dem senator's PAC splurges on luxury perks while skirting hefty tax bill ahead of potential comeback bid Former Ohio Sen. Sherrod Brown faces criticism for late tax payments and luxury PAC spending as he considers a bid for re-election after being ousted by MAGA opponent in 2024.\nNew Mexico 6 days ago Democratic governor declares state of emergency in crime-ridden county New Mexico’s Democrat governor on Wednesday declared a state of emergency over rampant violence and drug trafficking in a large swath of her state.\nMedia 6 days ago AG Pam Bondi suggests Trump's crime crackdown in DC will help Latino residents U.S. Attorney General Pam Bondi says President Donald Trump's order to crack down on crime in Washington, D.C. is 'crystal clear,' as critics claim the capital's crime is down.\nSocial Security 6 days ago EXCLUSIVE: Trump touts 'zero tax' benefits for majority of seniors on social security’s 90th anniversary President Trump defends Social Security program achievements amid Democratic criticism, highlighting zero taxes for most seniors and improved customer service\nJD Vance 6 days ago Dems accuse JD Vance of ‘congressional level shoplifting,’ call for more to join AWOL lawmakers Democratic lawmakers slammed Republican redistricting efforts before the 2026 Midterm Elections, with one accusing JD Vance of engaging in \"congressional-level shoplifting.\"\nMedia 6 days ago Chris Matthews says Democrats 'falling into a trap of defending what’s indefensible' on crime Ex-MSNBC host Chris Matthews called out Democrats for their response to President Trump's crime plan, suggesting they were defending the indefensible.\nOpinion August 13 DAVID MARCUS: Trump understands that safety is for every citizen, not just the lucky few Trump announced his plans for a federal takeover of the Washington, D.C. police department on Monday following a spate of recent violent crimes in the capital.\nTexas August 12 Texas Dems begin to crack, confirm return to state after fleeing to obstruct GOP redistricting: report Texas House Democrats plan to return to the state after fleeing to block GOP redistricting efforts, local Texas media has confirmed.\nTexas August 12 Texas state Senate passes new Republican drawn congressional map as House Dems remain on the lam Texas Senate approves Republican-drawn redistricting maps in 19-2 vote as nine Democrats walk out in protest while House Democrats remain out of state.\nOhio August 12 MAGA-ousted Dem senator from key swing state launches comeback campaign after losing seat in 2024: report Ohio Democrat Sherrod Brown prepares Senate comeback bid after bruising defeat that saw him lose reelection for his fourth consecutive term.\nPolitics August 12 Texas GOP seeks to ‘domesticate’ rogue Dems for breaking quorum through nationwide civil arrest warrants Texas GOP officials are seeking to enforce civil arrest warrants across state lines for the House Democrats who fled to prevent a Republican redistricting vote.\nMedia August 12 Chuck Todd warns America is heading towards a 'cold civil war' as redistricting battle continues Former NBC host Chuck Todd argued that America is heading towards a \"cold civil war\" on \"The Chuck Toddcast\" on Tuesday as redistricting battles in states like Texas and California continue.\nElections Disputes August 12 Dems suggest GOP redistricting has forced them to play partisan politics, Republicans argue nothing's changed Democrats say GOP redistricting efforts are forcing them into partisan retaliation, but Republicans argue that partisan map drawing has always been part of the Democrats' game plan."
    },
    {
      "url": "https://www.foxnews.com/category/politics/socialism",
      "text": "Zohran Mamdani 50 mins ago Mamdani sidesteps 'communism' question, says his campaign is about 'distribution of wealth' Zohran Mamdani, New York City's Democratic mayoral candidate, addressed President Donald Trump's \"communist\" label by citing Dr. Martin Luther King Jr. and highlighting affordability.\nVIDEO 50 mins ago Zohran Mamdani evokes Dr. Martin Luther King, Jr., when asked about 'communist' label Fox News' Nate Foy pressed New York City Democratic mayoral nominee Zohran Mamdani about President Donald Trump calling him a \"communist.\" (WNYW)\nZohran Mamdani 1 day ago Zohran Mamdani supporters unfazed by Trump's 'communist' label, defend the candidate's affordability fight Zohran Mamdani's supporters dismissed accusations from President Donald Trump that he's a \"communist,\" telling Fox News Digital that the mayoral election is about more than labels.\nOpinion 2 days ago Democrats like Zohran Mamdani claim to embrace young people. They’re betraying them NYC mayoral frontrunner Zohran Mamdani's socialist agenda, including housing freezes and reduced police funding, faces criticism for potentially harming working class families\nZohran Mamdani 2 days ago Fatal Brooklyn lounge shooting reignites NYC mayoral candidate clash over gun violence response A fatal Crown Heights shooting prompted New York City mayoral candidates to clash over crime policies as city grapples with recent surge in gun violence incidents.\nVIDEO 3 days ago Victor Davis Hanson shares what's setting Democrats 'on fire' Hoover Institution senior fellow Victor Davis Hanson tells 'Life, Liberty & Levin' his take on Democrats 'melting down' over President Donald Trump targeting the roots of 'woke'-ness, NYC mayoral candidate Zohran Mamdani and more.\nVIDEO 3 days ago Lt. Gov. Winsome Earle-Sears: You cannot do socialism right Virginia Lt. Gov. Winsome Earle-Sears shares about her immigration story from Jamaica, the NYC mayor's race, her gubernatorial run and more on 'My View.'\nVIDEO 3 days ago Democrats are 're-orienting' themselves to 'kitchen-table' issues: Richard Fowler Bluestack Strategies founder Maura Gillespie and Fox News contributor Richard Fowler unpack Democratic socialist Zohran Mamdani's call with former President Barack Obama on 'Fox News Live.'\nZohran Mamdani 5 days ago Mamdani recalls Obama call about 'darkness' in politics after NYC primary victory Democratic socialist Zohran Mamdani said he spoke with former president Barack Obama about hope in politics after his New York City mayoral primary win in June.\nZohran Mamdani 5 days ago Zohran Mamdani closes out his anti-Trump tour in his home borough in Queens Zohran Mamdani concluded his week-long, anti-Trump campaign tour across all five New York City boroughs at a Queens union office, joined by local workers and officials.\nZohran Mamdani 5 days ago 'Not welcome here': Staten Island activist arrested after confronting NYC mayoral candidate Protesters disrupted Zohran Mamdani's Staten Island campaign event with megaphones and profanities, leading to activist Scott Lo Baido's arrest by the NYPD.\nOpinion 5 days ago I’m from Gen Z. We are the ones who have to stop socialism from taking over Generation Z writer argues against socialist policies gaining popularity among young Americans, citing concerns about freedom and the American experiment under threat\nZohran Mamdani 5 days ago Mamdani points to Bronx population loss as proof NYC’s affordability crisis during his anti-Trump tour Democratic mayoral nominee, Zohran Mamdani, visited a small business in the Bronx to attack Trump's tax policies while connecting the president to his rival candidate, Andrew Cuomo.\nVIDEO 6 days ago Dana Perino: It is ‘smart’ for Democratic socialist Zohran Mamdani to do this 'The Five' discusses Democratic socialist Zohran Mamdani taking shots at President Donald Trump as he tours New York City and the shutdown of a city-run grocery store.\nZohran Mamdani 6 days ago ‘Get out of town!’: Staten Island crowd confronts Zohran Mamdani at anti-Trump rally Zohran Mamdani held an anti-Trump campaign event on Staten Island where protesters supporting his Republican opponent, Curtis Sliwa, gathered with cowbells and megaphones.\nVIDEO August 13 Mamdani continues his ‘Five Boroughs Against Trump’ tour in Staten Island Fox News national correspondent Bryan Llenas discusses New York City mayoral candidate Zohran Mamdani’s initiative to visit all five boroughs ahead of the November election on ‘America Reports.’\nZohran Mamdani August 13 Mamdani takes aim at Trump's immigration policies in fiery Staten Island speech: 'We are fighting to keep NYC a sanctuary city' NYC Democratic mayoral nominee, Zohran Mamdani, brought his anti-Trump tour to Staten Island, criticizing the president's deportation rollout.\nVIDEO August 12 Greg Gutfeld: The Democratic Party was 'hijacked' by an 'unhinged' activist class 'The Five' discusses working-class voters being 'fed up' with Democrats as a historically Democratic labor union reportedly donated to Republicans in the upcoming midterms.\nBernie Sanders August 12 Bernie Sanders brings 'Fighting Oligarchy Tour' to Trump strongholds across deep-red West Virginia GOP officials point to 500,000 registered Republicans as evidence of political momentum in Mountain State.\nVIDEO August 11 Elise Stefanik: This is a 'raging, antisemite communist' Rep. Elise Stefanik, R-N.Y., calls out how 'radical' today's Democratic Party is as they 'fawn' over Democratic socialist Zohran Mamdani on 'Hannity.'\nVIDEO August 7 Katie Pavlich warns Mamdani could give the Left 'breath of life' Fox News contributor Katie Pavlich, Stagwell Inc. CEO Mark Penn and Hoover Institution senior fellow Victor Davis Hanson dissect the Democratic Party's 'radical' socialist movement on 'Hannity.'\nVIDEO August 7 Sean Hannity: Democrats are ‘nothing like the party they used to be’ Fox News host Sean Hannity exposes former House Speaker Nancy Pelosi’s, D-Calif., ‘dramatic shift’ and calls out Democrats’ old ‘tactics’ as they promote socialism on ‘Hannity.’\nVIDEO August 7 Newt Gingrich: Democrats are either 'rabid socialists' or 'totally negative' Former House Speaker Newt Gingrich analyzes how Democrats are 'going off the deep end' as so-called defenders of democracy on 'The Ingraham Angle.'\nVIDEO August 6 Sean Hannity: 'Marxist' Mamdani is the 'heart and soul' of the Democratic Party Fox News host Sean Hannity sounds the alarm on Democrats' 'extremism' using their own words on 'Hannity.'\nZohran Mamdani August 6 NYC mayor flips script on Mamdani amid scramble to walk back anti-police rhetoric NYC mayoral candidate Zohran Mamdani faces continued criticism for changing his stance from defunding police to a more moderate stance as he continues his competitive race for the job.\nZohran Mamdani August 5 Mamdani's attempted police pivot continues after Adams asks 'Where was he?' Zohran Mamdani cites 200 monthly NYPD officer departures due to forced overtime as NYC mayoral candidate shifts from previous defund police positions.\nNew York City August 5 Adams asks 'where was' Mamdani at previous NYPD funerals New York City Mayor Eric Adams has ripped his Democratic mayoral opponent Zohran Mamdani for attending the funeral of slain NYPD officer Didarul Islam last week — but skipping services for other fallen officers killed during his time in the state Assembly.\nZohran Mamdani August 5 Zohran Mamdani in position to help socialist party 'seize state power,' DSA leader admits In a recent panel, Democratic Socialists of America leaders discussed how they have been closely working with Zohran Mamdani and how he has the group positioned to \"seize state power.\"\nZohran Mamdani August 4 Mamdani studies 'America's Worst Mayor' Brandon Johnson to avoid his political pitfalls: report Democratic socialist Zohran Mamdani hopes to emulate Boston's Michelle Wu rather than Chicago's struggling Brandon Johnson in his New York mayoral campaign.\nAlexandria Ocasio-Cortez August 3 Young progressives look to Zohran Mamdani, AOC as future of the Democratic Party – under one condition Progressive activists look to Rep. Alexandria Ocasio-Cortez and Zohran Mamdani as inspiring leaders and the future of the Democratic Party at Voters of Tomorrow Summit in D.C."
    },
    {
      "url": "https://www.foxnews.com/politics/trump-warns-new-york-city-faces-dire-future-communist-mamdani-takes-office-mayor",
      "text": "President Donald Trump is reiterating his claim that the Democratic Party's nominee for mayor in the nation's most populous city is a \"communist.\"\n\"If a communist gets elected to run New York, it can never be the same,\" the president argued this week as he spoke to reporters during a Cabinet meeting at the White House.\nTrump was referring to Zohran Mamdani, the 33-year-old democratic-socialist assemblyman from Queens whose convincing victory two weeks ago over former New York Gov. Andrew Cuomo and nine other candidates in New York City's Democratic mayoral primary sent political shock waves across the country.\nFor Republicans, the strategy in reacting to Mamdani's victory is clear-cut – relentlessly paint Mamdani – who took a big step toward becoming New York City's first Muslim mayor – as an extremist and anchor him to Democrats across the country ahead of next year's midterm elections.\nTHE PLOT TO STOP MAMDANI: DEMOCRATS SCRAMBLE TO PREVENT FAR-LEFT TAKEOVER IN NYC\nFor Democrats, it's more complicated.\nMamdani surged to a primary victory thanks to an energetic campaign that put a major focus on affordability and New York City's high cost of living.\nHe made smart use of social media platforms, including TikTok, as he engaged low-propensity voters. He proposed eliminating fares to ride New York City's vast bus system, making CUNY (City University of New York) \"tuition-free,\" freezing rents on municipal housing, offering \"free childcare\" for children up to age 5, and setting up government-run grocery stores.\nRESURFACED MAMDANI PHOTO SPARKS SOCIAL MEDIA FIRESTORM\nThanks in part to the efforts of a massive grassroots army of volunteers, Mamdani rode a wave of support from younger and progressive voters to catapult into first place over Cuomo, who had been the primary frontrunner.\n\"I think it's clear that voters are prioritizing action over inaction, and not just incremental change but broad sweeping change,\" veteran Democratic strategist Joe Caiazzo told Fox News Digital, when asked about what Mamdani's victory means for the party.\nAnd Caiazzo, a veteran of Sen. Bernie Sanders' 2016 and 2020 presidential campaigns, said one reason for Mamdani's victory was that he tirelessly met \"voters where they are.\"\nBut the Mamdani political earthquake seems to have exacerbated tensions between the party's moderate and progressive wings. It's also fueled the existing debate over whether the Democratic Party's policy, or messaging, was to blame for last November's election setbacks, when Democrats lost control of the White House and Senate, and failed to win back the House majority.\n\"Democrats continue to have a fissure in their own party, which has been made worse by Mamdani's candidacy,\" said Wayne Lesperance, a veteran political scientist and the president of New England College.\nMAMDANI'S PROFESSOR FATHER CLAIMED HITLER INSPIRED BY ABRAHAM LINCOLN\nIn New York, top Democratic Party leaders, including Gov. Kathy Hochul, Senate Minority Leader Chuck Schumer and House Minority Leader Hakeem Jeffries, have praised Mamdani’s campaign. And while they've defended him from Trump's attacks, they have refrained, as of now, from endorsing the mayoral nominee.\nDemocratic strategist Lauren Hitt worked for Rep. Alexandria Ocasio-Cortez, D-N.Y., and served on the Biden-Harris 2024 presidential campaign. This year, she helped a super PAC boost Mamdani, and told Fox News that his primary victory was a \"clear rejection of the old guard.\"\nEven Matt Bennett, executive vice president for the moderate Democratic-aligned group the Third Way, acknowledged that Mamdani \"focused on affordability,\" which he said is \"great.\"\nBennett added that Mamdani is \"young, charismatic, a great communicator. All that is great. We want to see that.\"\nBut Bennett told Fox News \"the problem is he has the wrong prescription.\"\nCLICK HERE TO GET THE FOX NEWS APP\nWithout a singular leader steering Democrats as the party works to escape the political wilderness, the internal debates will continue.\nBut Caiazzo cautioned \"not to read too much into\" what Mamdani's victory means to the party as a whole, and argued that \"Republicans are making too much out of this.\""
    },
    {
      "url": "https://www.foxnews.com/apps-products?pid=AppArticleLink",
      "text": "Fox News is Everywhere.\nWatch Fox News Channel on all of your devices to keep up to date with the latest in news, politics, entertainment and more. On phones, tablets, wearables and TV, it's easy to stay connected anywhere.\niOS Devices\nAndroid Devices\nApple TV\nRoku\nChromecast\nAndroid TV\nAmazon Fire\nFubo TV\nApple Watch\nAmazon Echo\nGoogle Home\nFox News Go\nApple News\nAT&T TV Now\nYouTube TV\nHulu\nFacebook\nInstagram\nSamsung Devices\nSling TV\nVidgo\nSpotify\niHeartRadio\nFlipboard\nLinkedIn\nGoogle Newsstand\nNewsletters\nYouTube\nFAQ\nHow much data does Fox News Go use?\nFox News Go uses about 2GB per hour of SD viewing and 4GB per hour of HD viewing. This can vary depending on your device and internet connection. If you are concerned about your data usage we recommend not streaming over a cellular network and contacting your Internet or Cellular Service Provider.\nWhat broadcast quality will I get while streaming on my device?\nFox News will stream at the highest quality possible based on your device and internet connection quality. For the best quality we recommend streaming via Wi-Fi or 4G.\nWhat channels are available on Fox News Go?\nYou can Watch Fox News Channel on Fox News Go and Fox Business Channel on Fox Business Go"
    },
    {
      "url": "https://www.foxnews.com/politics/zohran-mamdani-launches-anti-trump-tour-across-five-boroughs-new-york-city",
      "text": "Zohran Mamdani, New York City's Democratic mayoral nominee, launched a \"Five Boroughs Against Trump\" tour in the Big Apple on Monday, as President Donald Trump's agenda takes center stage on the New York City campaign trail.\nMamdani began his anti-Trump tour alongside Rep. Jerry Nadler, D-N.Y., in Manhattan on Monday morning. He plans to visit Brooklyn on Tuesday, Staten Island on Wednesday, the Bronx on Thursday and Queens on Friday, Fox News has confirmed.\nThe 33-year-old self-described socialist's tour is a rejection of the Trump administration's sweeping second-term agenda and his so-called \"authoritarian\" attack on working New Yorkers, specifically, immigration and health care reform.\n\"There is no borough that will be free from Trump's cruelty,\" Mamdani said on Monday. \"We will feel the pain of this legislation, whether we are in Manhattan, Brooklyn, the Bronx, Queens or Staten Island, and we will shine a light this week and every week on the costs of this vision that is coming out of Washington, D.C.\"\nTRUMP CAUTIONS THAT NY WILL ‘NEVER BE THE SAME’ IF ‘COMMUNIST’ MAMDANI IS ELECTED\n\"Donald Trump is waging a full-scale assault on American democracy, dismantling our institutions, attacking our universities and our scientific research base, using government power to serve himself and his donors, and targeting New York City because New Yorkers have always seen him for what he is – a narcissistic, wannabe dictator,\" Nadler said during the event on Monday.\nNY DEMS WHO HAVE YET TO ENDORSE MAMDANI UNITE IN HIS DEFENSE AGAINST TRUMP\nAt the opening \"Manhattan Against Trump\" event, Mamdani was joined at the 1199 Service Employees International Union (SEIU) by Nadler, NYC Councilmember Carmen De La Rosa, NYC Councilmember Keith Powers, Assemblymember Harvey Epstein, Former Manhattan Borough President Ruth Messinger and 1199SEIU member Peggy Vujovick.\nMamdani has tied former Gov. Andrew Cuomo to Trump in recent weeks, as the latter remains in the race to run New York City as an independent candidate, despite losing the Democratic primary to Mamdani in June.\nIncumbent Mayor Eric Adams, who has developed his own public relationship with the president, is also running as an independent, and CEO of the Guardian Angels, Curtis Sliwa, is the Republican nominee.\n\"Comrade Mamdani is the American people’s worst nightmare,\" White House spokeswoman, Abigail Jackson, told Fox News Digital. \"His communist policies will crater our economy, increase crime, crowd out Americans with free health care for illegal immigrants, and defund the brave men and women of law enforcement who keep us safe.\"\nThe White House added that \"Mamdani's idea of ‘immigration reform’ is no borders and amnesty for all the violent criminal illegal aliens that Joe Biden released into our country. The American people have repeatedly rejected this Communist agenda and the more Mamdani shares his radical policies, the more the American people will recoil.\"\nAs House members return to their home districts during the August recess, Democrats are uniting against Trump’s \"big, beautiful bill,\" which narrowly passed through Congress last month, as congressional Democrats seek a united message ahead of competitive midterm elections expected next year.\n\"New York City needs a leader who won't give Trump an inch, who won't flinch or bargain away our rights,\" Nadler added. \"With Zohran Mamdani as mayor, we'll have a leader who will defend our hospitals, our schools and our neighbors from Trump's devastating policies. With the right mayor, with the right leadership, we can blunt Trump's attacks.\nThe New York Times reported last week that Trump recently spoke on the phone with Cuomo and has been speaking with associates about which candidate has the best chance to beat Mamdani in November. Meanwhile, Mamdani has described how his administration would be Trump's \"worst nightmare.\"\nThe president was quick to criticize Mamdani when the socialist shocked the political world and secured the Democratic nominee to become the next mayor of New York City in June, calling him a \"100% Communist Lunatic.\"\nCLICK HERE TO GET THE FOX NEWS APP\n\"We see far too many parallels between Donald Trump and Andrew Cuomo, far too many stories that make clear that both administrations have been characterized by corruption, by a sense of impunity, by an inability of an executive to understand that no means no, a prioritization of the interests of billionaires over working people, and an agenda that is driven by little else beyond the retention and accumulation of power,\" Mamdani said Monday."
    }
  ],
  "argos_summary": "Zohran Mamdani, the 33‑year‑old Democratic Socialist who won New York City’s mayoral primary, has been labeled a “communist” by President Trump, a claim he dismisses by framing his platform as a fight for affordable housing and wealth redistribution. Mamdani’s campaign, backed by Bernie Sanders and Alexandria Ocasio‑Cortez, has launched a “Five Boroughs Against Trump” tour to counter the president’s policies and rally progressive voters. Supporters argue the label is a political attack and emphasize his focus on practical issues such as rent freezes, free public transit, and universal childcare. The controversy highlights the growing divide within the Democratic Party between its moderate and progressive wings.",
  "argos_id": "ZNX55A03X"
}