{
  "url": "https://finance.yahoo.com/video/sea-meta-coreweave-cava-trending-123200333.html",
  "authorsByline": "Ramzan Karmali",
  "articleId": "d2e58f3d7d3e4ae68932778b55fc90b5",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://s.yimg.com/ny/api/res/1.2/Hy_pZBsNxquFrU2.pGxYtw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzY7Y2Y9d2VicA--/https://s.yimg.com/os/creatr-uploaded-images/2025-08/6f3113a0-7841-11f0-bfea-d550e91ec25f",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-13T12:32:00+00:00",
  "addDate": "2025-08-13T12:40:33.688484+00:00",
  "refreshDate": "2025-08-13T12:40:33.688486+00:00",
  "score": 1.0,
  "title": "Sea, Meta, Coreweave, Cava: Trending Stocks",
  "description": "Join Ramzan Karmali as he take's a look at this mornings Trending Tickers, kicking off with Sea (SEA), Meta (META), Coreweave (CRWV), Cava (CAVA).",
  "content": "Well, we're seeing some big moves, particularly in tech, with some clear winners and losers today. We start with rising stocks. Number one, Meta, which is inching closer to joining Nvidia, Microsoft, Apple, and Amazon in the exclusive club of two trillion dollar companies. Meta's trading just above $791 there as you can see in the pre-market, up around a 1/5 of a percent of the closing over 3% higher yesterday. Its valuation is hovering around $1.98 trillion. So what's pushing up Meta stock two weeks after strong earnings reports? Well, one reason, the head of Instagram, Adam Mosseri, said yesterday that its Threads platform had recently reached more than 400 million monthly active users. Also, note the analyst at J.P. Morgan reiterated an overweight buy, an overweight or buy rating for Meta justified by strong growth and promising results driven by its new tools in artificial intelligence and targeting. Meta plans to spend up to as much as $100 billion in capex next year. Okay, next up we have the Singaporean e-commerce and FinTech giant, C. Now, let's check the stock price. It's still in the green this morning, continuing its rally after it closed up 19% yesterday following standout second-quarter earnings and strong sales growth. This reflects renewed investor confidence in C's e-commerce and FinTech operations across Southeast Asia. And finally, let's move on to two stocks that are deep in the red this morning. First up, we have CoreWeave. The Nvidia backed company slid more than 10% in pre-market. The AI infrastructure provider beat revenue expectations posting $1.21 billion, above estimates of $1.08 billion, but missed on bottom line with a larger than anticipated net loss. Now, as you can see here, CoreWeave has been skyrocketing in recent months. So what's behind this pullback despite solid top-line growth and a backlog of $30 billion? Investors are jittery about its steep expenses. Operating costs surged to $1.19 billion from just under $400 million a year earlier. And one more ticker you need to watch is Cava Group. The Mediterranean fast casual restaurant chain is under heavy pressure today. Well, let's check the price. Cava is trading around $64 in the pre-market, down nearly 24% after the company cut its full-year same-store sales outlook. Here's what's driving the move. Late yesterday, Cava reported Q2 results that came in softer than expected. Same-store sales grew just 2.1%, and management now expects lower growth for the full year, well below earlier forecasts. Well, CEO Brett Schulman told analysts that consumers are navigating a fog in the current economic environment. The company is still expanding. It plans to open around 60 restaurants in total this year, but investors are clearly worried that it might be losing momentum. And we'll be bringing more news about Cava later today as we'll be joined by the CEO, Brett Schulman. Stay tuned for that interview later this morning here on Yahoo Finance.",
  "medium": "Video",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Meta stock",
      "weight": 0.08219801
    },
    {
      "name": "strong sales growth",
      "weight": 0.07729548
    },
    {
      "name": "strong growth",
      "weight": 0.071925215
    },
    {
      "name": "next year",
      "weight": 0.06738389
    },
    {
      "name": "-",
      "weight": 0.065309785
    },
    {
      "name": "Cava Group",
      "weight": 0.06436697
    },
    {
      "name": "Meta",
      "weight": 0.06397608
    },
    {
      "name": "Cava",
      "weight": 0.06295088
    },
    {
      "name": "lower growth",
      "weight": 0.062249295
    },
    {
      "name": "more news",
      "weight": 0.062210876
    }
  ],
  "topics": [
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.97509765625
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.95166015625
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.93603515625
    }
  ],
  "sentiment": {
    "positive": 0.15050445,
    "negative": 0.63333803,
    "neutral": 0.21615751
  },
  "summary": "The following day, a number of tech stocks have seen significant moves, particularly in tech, with rising stocks such as Meta, which is close to joining Nvidia, Microsoft, Apple, and Amazon in the exclusive club of two trillion dollar companies. The head of Instagram, Adam Mosseri, has stated that the company's Threads platform has reached over 400 million monthly active users and its valuation is around $1.98 trillion. However, CoreWeave, a Nvidia-backed AI infrastructure provider, slid more than 10% in pre-market due to concerns about its high expenses. Meanwhile, Cava Group, a Mediterranean fast casual restaurant chain, is under pressure after its Q2 results were less than expected and it reported softer than anticipated growth.",
  "shortSummary": "Despite strong earnings reports, some high-profile tech stocks like Meta, C. Smith, and CoreWeave are in turmoil, with strong gains but losses in other sectors.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "26679457fce04a16a86ce3d7e3b165b2",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Meta's stock is rising, nearing a $2 trillion valuation, driven by strong earnings and the success of its Threads platform, which has over 400 million monthly users. Meanwhile, Singapore's C is experiencing a rally after impressive second-quarter earnings, while CoreWeave's stock has dropped over 10% despite beating revenue expectations due to high operating costs. Cava Group's shares are down nearly 24% after cutting its full-year sales outlook, reflecting concerns about consumer spending.",
  "argos_id": "1RC8R7HC1"
}