{
  "url": "https://www.pymnts.com/smbs/2025/90percent-rural-small-businesses-confident-in-future/",
  "authorsByline": "PYMNTS",
  "articleId": "af8b20055f4c488d88061875623b76d9",
  "source": {
    "domain": "pymnts.com",
    "location": {
      "country": "us",
      "state": "MA",
      "county": "Suffolk County",
      "city": "Boston",
      "coordinates": {
        "lat": 42.3602534,
        "lon": -71.0582912
      }
    }
  },
  "imageUrl": "https://www.pymnts.com/wp-content/uploads/2025/08/rural-small-business.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-13T08:00:22+00:00",
  "addDate": "2025-08-13T08:07:35.480899+00:00",
  "refreshDate": "2025-08-13T08:07:35.480901+00:00",
  "score": 1.0,
  "title": "90% of Rural Small Businesses Confident in Future",
  "description": "With this week’s news that optimism has returned to small- to medium-sized businesses (SMBs), we took a look at its roots. While attention often focuses",
  "content": "With this week’s news that optimism has returned to small- to medium-sized businesses (SMBs), we took a look at its roots.\n\nBy completing this form, you agree to receive marketing communications from PYMNTS and to the sharing of your information with our sponsor, if applicable, in accordance with our Privacy Policy and Terms and Conditions .\n\nComplete the form to unlock this article and enjoy unlimited free access to all PYMNTS content — no additional logins required.\n\nWhile attention often focuses on the growing disparity in outlook between urban and rural SMBs, new PYMNTS data reveals a persistent, nuanced optimism across the entire sector, even as core economic anxieties unite businesses regardless of location.\n\nThis insight emerges from “The Urban-Rural Economic Divide: How Location Affects SMBs’ Outlook,” a recent PYMNTS Intelligence report based on a survey of 511 SMBs conducted from Jan. 7-23. The study provides a detailed look at varying opinions on long-term survival across numerous geographic areas.\n\nOverall, the research found SMBs generally optimistic about long-term growth, with fewer reporting decreased revenue — a drop from 22% in June 2022 to 17% in January.\n\nMost SMBs also reported increasing revenues in the past year, alongside fewer instances of contracting margins or staffing difficulties. However, this positive sentiment is countered by a significant geographic divergence: big-city SMBs expressed confidence, while those in small towns, suburban, or rural areas showed increasing concern about their future. These worries stem from factors like workers returning to offices, economic uncertainties and challenges in securing financing.\n\nThis underlying narrative of shared concerns amidst varying degrees of optimism is further illuminated by specific data points critical for financial services professionals:\n• None Despite a rise in pessimism among rural businesses regarding two-year survival — with the share doubling from 5% in October to over 10% in January — the report noted that 90% of rural SMBs remained confident in their ability to survive this period. This demonstrates a substantial level of resilience across the broad SMB landscape.\n• None When SMBs, regardless of location, expressed concern about their long-term survival, poor economic conditions emerged as the overwhelming primary reason, cited by between 46% and 51% of worried businesses depending on their geographic area. This highlights a pervasive macro-economic sensitivity that transcends regional differences.\n• None Beyond general economic worries, the report revealed how specific operational concerns disproportionately affect different industries, even when poor economic conditions remain the consensus top concern across sectors. For instance, 40% of professional services firms identified rising staffing costs, including salaries and benefits, as their top concern, a stark contrast to just 14% of retailers who cited the same. This offers critical understanding of nuanced pressures facing different business segments.\n\nThe report further dissected other prominent factors impacting SMB sentiment.\n\nIncreasing competition was a significant concern, identified by 43% of SMBs in small cities. Other frequently cited challenges among concerned SMBs include rising material or equipment costs and the inability to secure vital financing.\n\nThe hospitality sector, including hotels and restaurants, presented a volatile picture; while 56% reported increasing revenues, they were also the most likely to report decreases, suggesting high susceptibility to elastic consumer demand for discretionary spending. This contrasts sharply with essential industries like groceries.\n\nUnderstanding these varied — yet often shared — anxieties, coupled with underlying resilience and subtle shifts in optimism, is crucial for financial institutions, payment providers and FinTechs seeking to develop targeted solutions for the diverse, evolving needs of the SMB market.",
  "medium": "Article",
  "links": [
    "https://www.pymnts.com/study_posts/the-urban-rural-economic-divide-how-location-affects-smbs-outlook/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "rural SMBs",
      "weight": 0.09099178
    },
    {
      "name": "Rural Small Businesses",
      "weight": 0.07953188
    },
    {
      "name": "rural businesses",
      "weight": 0.07842802
    },
    {
      "name": "concerned SMBs",
      "weight": 0.07644369
    },
    {
      "name": "SMBs",
      "weight": 0.07620975
    },
    {
      "name": "Most SMBs",
      "weight": 0.074537784
    },
    {
      "name": "increasing concern",
      "weight": 0.07426782
    },
    {
      "name": "poor economic conditions",
      "weight": 0.073308825
    },
    {
      "name": "core economic anxieties",
      "weight": 0.07120079
    },
    {
      "name": "economic uncertainties",
      "weight": 0.06849196
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Business"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Other",
      "score": 0.9873046875
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.7802734375
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.646484375
    },
    {
      "name": "/Business & Industrial/Small Business/Other",
      "score": 0.480224609375
    },
    {
      "name": "/Business & Industrial/Business Operations/Management",
      "score": 0.429443359375
    }
  ],
  "sentiment": {
    "positive": 0.4954556,
    "negative": 0.2480383,
    "neutral": 0.25650612
  },
  "summary": "A recent PYMNTS Intelligence report revealed that 90% of rural SMBs remained confident in their ability to survive, despite a rise in pessimism from 5% to over 10% in January. The study, based on a survey of 511 SMBs conducted from Jan. 7-23, found that SMBs were generally optimistic about long-term growth, with fewer reporting decreased revenue. However, this positive sentiment was countered by a significant geographic divergence, with big-city SMBs expressing confidence while those in small towns, suburban, or rural areas showing increasing concern about their future. The report also highlighted that specific operational concerns disproportionately affect different industries, highlighting a lack of macro-economic sensitivity.",
  "shortSummary": "Despite regional economic concerns, most rural SMBs remain optimistic about their long-term survival, driven by rising competition and operational challenges, despite regional differences.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "4177bac415a74f6a9ccbc945a481cd9b",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.pymnts.com/study_posts/the-urban-rural-economic-divide-how-location-affects-smbs-outlook/",
      "text": "Most small to mid-sized businesses (SMBs) report increasing revenues in the past year, and fewer report contracting margins or difficulty finding staff. Despite this general optimism, a divide is forming between two groups of these businesses: those in big cities and those doing business in small towns, suburbs or rural areas.\nIn general, big-city SMBs are more likely to report steady growth and increased profits, while those not located in these urban areas show increased concern. These worries come from several sources, including workers returning to the office and not patronizing local SMBs, economic concerns and access to finance.\nThese are just some of the findings detailed in “The Urban-Rural Economic Divide: How Location Affects SMBs’ Outlook,” a PYMNTS Intelligence report. This edition examines the urban-rural divide in SMB growth optimism and draws on insights from a survey of 511 SMBs conducted from Jan. 7 to Jan 23.\nOverall Optimism Among SMBs\nFewer SMBs overall report decreasing revenues, but rural ones are more likely to do so.\nPYMNTS Intelligence research finds that the portion of SMBs reporting increased revenue has stayed relatively stable in the past few years. In June 2022, 49% of SMBs surveyed reported growing revenues and 50% reported the same as of January 2025. The number of SMBs reporting stagnant revenue had a similar slight increase, with 29% reporting it in 2022 and 32% reporting it in 2025. However, the share of these businesses reporting decreased revenue has declined from 22% to 17%. These trends combined form an overall rosy outlook on SMB revenue throughout the survey period.\nHowever, a significant divide in outlook begins to coalesce when these businesses are grouped by area. Those in rural areas are twice as likely as those in big cities to report decreasing revenues, at 30% compared to 15%. Additionally, rural SMBs are less likely to report growing revenues than those in other locations in the last three years. This trend has many possible explanations, including a shift from working from home to working in the office following the pandemic. As workers moved from their rural homes to big-city offices, they stopped patronizing local restaurants or shops as frequently.\nHotels and restaurants were also more likely than most other industries to report increasing revenues, at 56%. However, they were also the most likely to report decreasing revenues. This suggests a more volatile industry than others, which might stem from elastic demand. Travel and dining out are typically considered luxuries, and most consumers only do so when they have money to spare. This stands in contrast to other industries, such as groceries or toiletries, which consumers must purchase no matter what.\nVarying Opinions on Long-Term Survival\nUrban SMBs Are Driving Overall Optimism\nSMBs as a whole are now more optimistic about their survival in the next two years. When asked in July 2022, nearly 7% of these businesses said it was slightly or not likely at all that they would survive this period. This share fell to just 5% when surveyed in January 2025.\nHowever, this does not show the whole picture, and big-city SMBs primarily drive this overall trend. When divided by location, big-city SMBs have declined here in recent months, falling from 5% in November 2024 to 4% in January 2025. All other SMB groups, including small cities, small towns and rural areas, said it was less likely they would survive the next two years. Rural SMBs were particularly pessimistic: The share that said they would not survive doubled from 5% in October to more than 10% in January.\nIt should be noted, however, that this still represents a small minority of these businesses. It shows that 90% of rural SMBs are confident they will survive the next two years, showing an overall high level of optimism in the SMB space.\nEconomic Outlook Worries SMBs\nSMBs concerned about long-term survival cite poor economic conditions first and foremost.\nRegardless of location, SMBs that worry they will not survive the next two years share the exact reasons for believing so. At the top of the list is poor economic conditions. Between 46% and 51% of concerned SMBs cited this as their top reason, depending on their location. The only other factor that came close was increasing competition, which was the primary reason for just 43% of those in small cities specifically. Other prominent factors among concerned SMBs were increasing material or equipment costs, inability to secure financing and rising staffing costs such as salaries, benefits and payroll taxes.\nWhen these businesses were broken down by industry, poor economic conditions remained the consensus reason for concern about surviving the next two years. Approximately half of all these businesses in construction, consumer services, retail, professional services and hospitality listed this as their biggest concern. Some factors worried some industries much more than others. For example, nearly 30% of retailers were concerned about supply chain disruption, compared to 20% of construction firms. Meanwhile, 40% of professional services said staffing costs were their top concern, compared to 14% of retailers.\nRead More\nPYMNTS Intelligence is the leading provider of information on the trends driving SMB growth. To stay up to date, subscribe to our newsletters and read our in-depth reports.\nMethodology\n“The Urban-Rural Economic Divide: How Location Affects SMBs’ Outlook” is based on a survey of 511 SMBs conducted from Jan. 7 to Jan 23. The report details the varying opinions on long-term survival from SMBs in numerous areas."
    }
  ],
  "argos_summary": "Recent PYMNTS data reveals a nuanced optimism among small- to medium-sized businesses (SMBs), with fewer reporting decreased revenues and many experiencing growth. However, a significant divide exists between urban and rural SMBs, with urban businesses showing more confidence in their long-term survival, while rural counterparts express increasing concerns due to economic uncertainties and challenges in securing financing. Despite these worries, 90% of rural SMBs remain optimistic about their survival, highlighting resilience across the sector.",
  "argos_id": "3SY4WOMAJ"
}