{
  "url": "https://finance.yahoo.com/video/cavas-first-sales-growth-outlook-141643768.html",
  "authorsByline": "Yahoo Finance Video",
  "articleId": "047fd6d34f524df4ba0d9dbb7663466e",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://s.yimg.com/ny/api/res/1.2/sIAXdWnrWg6YvluFvPuF6Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzY-/https://s.yimg.com/os/creatr-uploaded-images/2025-08/6985b2b0-784d-11f0-be77-5f906fc77842",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-13T14:16:43+00:00",
  "addDate": "2025-08-13T14:25:00.882897+00:00",
  "refreshDate": "2025-08-13T14:25:00.882900+00:00",
  "score": 1.0,
  "title": "Cava's first sales-growth outlook cut: 4 earnings takeaways",
  "description": "Cava (CAVA) stock is plummeting after the company missed second quarter same-store sales expectations and cut its full-year sales growth forecast for the first time since going public in 2023. Yahoo Finance Senior Reporter Brooke DiPalma joins Morning Brief to discuss the top four takeaways from Cava's weak results and slowing momentum. To watch more expert insights and analysis on the latest market action, check out more Morning Brief.",
  "content": "Let's get to an individual stock story. Now, Cava plunging after missing expectations for same-store sales in the second quarter and lowering its full year sales growth forecast. Yahoo! Finance senior reporter Brooke DiPalma here now with more on the biggest takeaways from those results. Hi, Brooke.\n\nGood morning, Julie. Shares are down now about 23% in early market trading right here, rather pre-market trading. And one analyst from JP Morgan called this a crack in the momentum that we've been seeing from Cava. And largely, what this ultimately led to was that first time ever that we saw this company since its IPO in June 2023 decide to cut its full year guidance when it came to same-store sales growth. Let's take a start there because what led to this was ultimately lower, uh, lower same-store sales growth throughout the quarter that then took them to the decision to cut their same-store sales growth outlook for 2025 down to the range of 4% to 6%. That was down for the previously expected 6 to 8% range. Once again, this is the first time that the Mediterranean fast casual chain has ever done this. And during this quarter, we did have two key factors that really played into that lower same-store sales growth. They said that that was the lapse of the introduction of that new protein steak that launched in 2024. And so when it came to the second quarter of 2025, it was ultimately lapping that gain that they saw in 2024. And in addition to that, they also called this the honeymoon effect. This was the first time ever that Cava had experienced this honeymoon period. Essentially, what that meant was that they opened these stores in 2024 that really saw such strong same-store sales growth. Then when you come into 2025, what they saw at the stores that really outperformed their expectations was negative same-store sales growth. So they're calling that this honeymoon effect. Now, also what we saw was ultimately what they called this fluid macroeconomic environment, and that's what led to this large decline in same-store sales growth. Now, it was up 2%, but compared to the previous quarter, and especially where we were last year when we saw 14% sales growth, now we just saw 2.1%. And that also missed Wall Street's expectations of up more than 6%. And Cava called this a fluid macroeconomic environment. They said that consumers aren't as energetic. They were really stalled by the dynamic and the challenges that they were up against during Q2. As we make way into Q3, they are seeing a bit of momentum pick back up. And also, analysts are keeping a close eye on menu innovation, like salmon and chicken shawarma, to perhaps bring customers back in the door.",
  "medium": "Video",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "such strong same-store sales growth",
      "weight": 0.08889313
    },
    {
      "name": "same-store sales growth",
      "weight": 0.0884089
    },
    {
      "name": "negative same-store sales growth",
      "weight": 0.0883394
    },
    {
      "name": "same-store sales",
      "weight": 0.07856424
    },
    {
      "name": "its full year sales growth forecast",
      "weight": 0.07314047
    },
    {
      "name": "14% sales growth",
      "weight": 0.070896186
    },
    {
      "name": "full year",
      "weight": 0.07075759
    },
    {
      "name": "that lower same-store sales growth",
      "weight": 0.07074245
    },
    {
      "name": "their same-store sales growth outlook",
      "weight": 0.07006163
    },
    {
      "name": "early market trading",
      "weight": 0.06525699
    }
  ],
  "topics": [
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.990234375
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.9384765625
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.92578125
    },
    {
      "name": "/Shopping/Mass Merchants & Department Stores",
      "score": 0.7705078125
    }
  ],
  "sentiment": {
    "positive": 0.034872495,
    "negative": 0.834225,
    "neutral": 0.13090245
  },
  "summary": "Cava shares have dropped 23% after missing expectations for same-store sales in the second quarter and reducing its full-year sales growth forecast. This is the first time the company has done this, primarily due to the lapse of the introduction of a new protein steak launched in 2024. The company also cut its same-sex-sex growth outlook for 2025 down to the range of 4-6%, which was down for the previously expected 6-8% range. Cava attributed the lower growth to a fluid macroeconomic environment and stalled by challenges during Q2. As we make way into Q3, analysts are looking at menu innovation like salmon and chicken shawarma to bring customers back.",
  "shortSummary": "Cava's shares dropped 23% after missing sales expectations and cutting full year guidance due to the \"honeymoon effect,\" according to analyst Brooke DiPalma.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "e1bc29d534a842d6b99368395ca240a7",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Cava's shares dropped 23% after the company missed same-store sales expectations for the second quarter and lowered its full-year sales growth forecast for 2025 from 6-8% to 4-6%. This marks the first time since its IPO in June 2023 that Cava has cut its guidance, attributing the decline to a 'honeymoon effect' from previous store openings and a challenging macroeconomic environment. The company reported a mere 2.1% growth in same-store sales, significantly below Wall Street's expectations of over 6%.",
  "argos_id": "5HT4YZMOA"
}