{
  "url": "https://finance.yahoo.com/news/neuroglee-expands-partnership-mayo-clinic-115115852.html",
  "authorsByline": "GlobalData",
  "articleId": "51bf412dedc443d2b865c64c35dac99d",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://s.yimg.com/ny/api/res/1.2/YobeecptIK6.J3JT2aET9w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/hospital_management_177/28ed57a8d1cbc38d1c578fa30ab60fd4",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-13T11:51:15+00:00",
  "addDate": "2025-08-13T12:14:32.141696+00:00",
  "refreshDate": "2025-08-13T12:14:32.141698+00:00",
  "score": 1.0,
  "title": "Neuroglee expands partnership with Mayo Clinic for dementia care",
  "description": "The partnership builds on the existing work of both organisations with the Neuroglee Connect solution.",
  "content": "Neuroglee Health has extended its partnership with the US' Mayo Clinic to offer dementia and cognitive care, providing support for patients and their care partners.\n\nThis partnership builds on their existing work with the Neuroglee Connect solution, which draws upon the Healthy Action to Benefit Independence & Thinking (HABIT) programme's principles to help maintain cognitive function and independence in individuals with mild cognitive impairment.\n\nPeople struggling with dementia and cognitive impairment are eligible for Neuroglee's longitudinal virtual care programme, which is provided by a specialised team, including licensed social workers and advanced practice nurses, under the supervision of neurologists and geriatric psychiatrists.\n\nThe programme offers 24/7 high-touch, wraparound support, focusing on the whole person and emphasising the continuity of in-home care and hospital use avoidance.\n\nNeuroglee's solutions are designed to improve patient outcomes and experiences while controlling costs.\n\nCare teams engage in symptom management, testing and diagnosis, and remote monitoring while providing support to care partners throughout the dementia care journey.\n\nNeuroglee founder and CEO Aniket Singh Rajput said: \"Neuroglee's clinically proven, technology-enabled care model builds upon Mayo Clinic's expertise to provide long-term, individualised care that supports both patients and care partners at home.”\n\nThe collaboration is in line with Neuroglee's selection for the Center for Medicare & Medicaid Innovation's Guiding an Improved Dementia Experience (GUIDE) model, aiming to deliver dementia care to beneficiaries of Medicare.\n\nPatients eligible for the GUIDE will be enrolled across Mayo Clinic locations and partner hubs without incurring any extra charges to the patient or their family.\n\nThe average yearly expenditure of Medicare for dementia patients is $22,000, nearly triple the cost for members without dementia or Alzheimer's.\n\nNeuroglee's care model has the potential to save more than $6,300 per member annually via longitudinal care and early detection, addressing high-cost drivers and adapting to the patient's cognitive stage.\n\n\"Neuroglee expands partnership with Mayo Clinic for dementia care\" was originally created and published by Hospital Management, a GlobalData owned brand.\n\n\n\n The information on this site has been included in good faith for general informational purposes only. It is not intended to amount to advice on which you should rely, and we give no representation, warranty or guarantee, whether express or implied as to its accuracy or completeness. You must obtain professional or specialist advice before taking, or refraining from, any action on the basis of the content on our site.",
  "medium": "Article",
  "links": [
    "https://www.hospitalmanagement.net/news/neuroglee-mayo-clinic-dementia-care/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "dementia care",
      "weight": 0.112751424
    },
    {
      "name": "care partners",
      "weight": 0.10497643
    },
    {
      "name": "longitudinal care",
      "weight": 0.09970055
    },
    {
      "name": "Care teams",
      "weight": 0.09944739
    },
    {
      "name": "dementia patients",
      "weight": 0.09627286
    },
    {
      "name": "Mayo Clinic",
      "weight": 0.08426615
    },
    {
      "name": "Neuroglee Connect",
      "weight": 0.082926415
    },
    {
      "name": "Mayo Clinic locations",
      "weight": 0.08233028
    },
    {
      "name": "Neuroglee",
      "weight": 0.08114327
    },
    {
      "name": "Neuroglee Health",
      "weight": 0.08087801
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Health"
    }
  ],
  "taxonomies": [
    {
      "name": "/Health/Medical Facilities & Services/Other",
      "score": 0.853515625
    },
    {
      "name": "/Health/Medical Facilities & Services/Hospitals & Treatment Centers",
      "score": 0.8037109375
    },
    {
      "name": "/News/Health News",
      "score": 0.431640625
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.366455078125
    }
  ],
  "sentiment": {
    "positive": 0.56245744,
    "negative": 0.03063549,
    "neutral": 0.4069071
  },
  "summary": "Neuroglee Health has extended its partnership with the Mayo Clinic to offer dementia and cognitive care. This follows their work with Neuroglee Connect, their longitudinal virtual care programme. The partnership aligns with the Center for Medicare & Medicaid Innovation's Guiding an Improved Dementia Experience (GUIDE) model. Patients eligible for the GUIDE will be enrolled across Mayo Clinic locations without incurring any extra charges. The average yearly expenditure of Medicare for dementia patients is $22,000, nearly triple the cost for members without dementia or Alzheimer's.",
  "shortSummary": "Neuroglee Health extended its dementia care partnership with Mayo Clinic, providing intensive, longitudinal care with potential to reduce costs and improve patient outcomes.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "5d0aa30e857c45c4bcdebd19497f7da7",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Neuroglee Health has expanded its partnership with the Mayo Clinic to enhance dementia and cognitive care through the Neuroglee Connect solution, which utilizes principles from the HABIT program. The longitudinal virtual care program offers 24/7 support from a specialized team, aiming to improve patient outcomes and reduce costs associated with dementia care. This collaboration aligns with Neuroglee's participation in the Medicare GUIDE model, which seeks to deliver comprehensive dementia care without additional charges to patients.",
  "argos_id": "7W9VBVD9Q"
}