{
  "url": "https://nypost.com/2025/08/13/science/frankenstein-bunnies-with-head-spikes-invade-us/",
  "authorsByline": "Ben Cost",
  "articleId": "3600cf7c68a04c0b9f49b30d50d06455",
  "source": {
    "domain": "nypost.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://nypost.com/wp-content/uploads/sites/2/2025/08/109537434.jpg?quality=75&strip=all&w=1024",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-13T13:22:32+00:00",
  "addDate": "2025-08-13T13:24:21.260642+00:00",
  "refreshDate": "2025-08-13T13:24:21.260643+00:00",
  "score": 1.0,
  "title": "‘Frankenstein’ rabbits with horrifying spikes growing from their heads are invading the US — and experts warn to stay away",
  "description": "A rapidly spreading virus is causing cottontail rabbits to grow black, tentacle-like growths out of their heads, prompting warnings to steer clear of the mutated animals.",
  "content": "A rapidly spreading virus is causing cottontail rabbits to grow black, tentacle-like growths out of their heads, prompting warnings to steer clear of the mutated animals.\n\nThe so-called Frankenbunnies have been spotted multiple times in Fort Collins, Colorado. Resident Susan Mansfield told 9News she saw a rabbit with what looked like “black quills or black toothpicks sticking out all around his or her mouth.”\n\n“I thought he would die off during the winter, but he didn’t,” she said. “He came back a second year, and it grew.”\n\nOne person described the infected critter as having “a scabbiesh-looking growth over their face.”\n\nThe so-called bunny blight is actually a disease called cottontail papilloma virus (CRPV), also known as Shope papilloma virus, which causes cottontails to sprout tumors around their head.\n\nIt is spread by parasites ticks and fleas, which pass on the ailment through their bites, according to Pet MD.\n\n“Typically rabbits become infected in the warmer months of summer when transmitted by being bitten by insects like fleas and ticks,” said Colorado Parks and Wildlife spokesperson Kara Van Hoose, per the Coloradoan.\n\nWhile the recent sightings occurred in Colorado, the disease most frequently rears its horny head in the Midwest.\n\nIn 2013, a Minnesota resident caused a stir after posting a video of a tendril-ridden rabbit in his backyard, which he dubbed the “Frankenstein” bunny and compared to the mythical Jackalope — a hoax that was promulgated by jokesters sewing antlers onto taxidermy rabbits.\n\nIn light of the rampant CRPV sightings, wildlife experts have warned people not to approach or handle any of the afflicted critters.\n\nThankfully, while the virus can spread between rabbits, it is not known to infect humans or pets and is therefore not considered a threat to public health, according to Colorado Parks and Wildlife.\n\nThe rabbits, on the other hand, are often not so lucky.\n\nAlthough cases can resolve on their own, the Medusa-like protrusions can also balloon up to the point that they interfere with the infected carrot cruncher’s ability to eat, causing the creatures to die of starvation, the Daily Mail reported.\n\nIn addition, the disease is more severe in domestic bunnies than their wild brethren, with the big fear being that they can develop squamous cell carcinoma — a serious and potentially fatal skin cancer.\n\nFor this reason, experts advise keeping pet rabbits away from pets.\n\nIf a rabbit does become infected, veterinarians can surgically excise the malevolent dreadlocks before they can become malignant.\n\nUnfortunately, CRPV has no known cure.",
  "medium": "Article",
  "links": [
    "https://cvm.missouri.edu/diseases-of-research-animals-dora/rabbits/rabbit-shope-papilloma-virus/",
    "https://www.si.edu/stories/worlds-scariest-rabbit",
    "https://www.coloradoan.com/story/news/2025/08/12/frankenstein-rabbits-with-papillomas-sprout-tentacle-like-growths/85628242007/",
    "https://www.dailymail.co.uk/sciencetech/article-14993099/Frankenstein-rabbits-tentacles-heads-colorado.html",
    "https://nypost.com/2025/01/10/health/rabbit-fever-cases-rising-in-us-as-cdc-warns-of-zoonotic-bacterial-disease/",
    "https://www.petmd.com/rabbit/conditions/viral/c_rb_shope_papilloma_virus",
    "https://nypost.com/2025/06/17/science/psychopaths-are-most-likely-to-live-in-these-4-states-study/",
    "https://cpw.state.co.us/species/cottontail-rabbits#:~:text=Rabbit%20Papillomas,be%20treated%20by%20a%20veterinarian.",
    "https://nypost.com/2025/08/07/science/shroud-of-turin-study-unlocks-new-key-details-of-jesus-burial/",
    "https://nypost.com/2025/08/12/science/how-to-watch-2025-perseid-meteor-shower-with-a-special-surprise/",
    "https://www.9news.com/article/news/local/fort-collins-rabbits-virus/73-a3afc465-4296-4f2b-8491-023d10295661"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "cottontail rabbits",
      "weight": 0.09791386
    },
    {
      "name": "pet rabbits",
      "weight": 0.09046656
    },
    {
      "name": "rabbits",
      "weight": 0.09033129
    },
    {
      "name": "taxidermy rabbits",
      "weight": 0.08998039
    },
    {
      "name": "Colorado Parks",
      "weight": 0.074157804
    },
    {
      "name": "cottontail papilloma virus",
      "weight": 0.06978816
    },
    {
      "name": "wildlife experts",
      "weight": 0.063365795
    },
    {
      "name": "Colorado",
      "weight": 0.06265768
    },
    {
      "name": "domestic bunnies",
      "weight": 0.062605865
    },
    {
      "name": "black toothpicks",
      "weight": 0.06047598
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Science"
    }
  ],
  "taxonomies": [
    {
      "name": "/Pets & Animals/Wildlife",
      "score": 0.37646484375
    },
    {
      "name": "/Science/Biological Sciences/Other",
      "score": 0.3759765625
    },
    {
      "name": "/Health/Health Conditions/Infectious Diseases/Other",
      "score": 0.36669921875
    }
  ],
  "sentiment": {
    "positive": 0.053232912,
    "negative": 0.7094717,
    "neutral": 0.23729539
  },
  "summary": "A virus known as cottontail papilloma virus (CRPV), also known as Shope papillom virus, is causing cottontoail rabbits to grow black, tentacle-like growths out of their heads. The disease has been spotted multiple times in Fort Collins, Colorado, and has led experts to warn people not to approach or handle any infected rabbits. While the disease can resolve on their own, it can also balloon up to the point that it restricts the rabbit's ability to eat, leading to starvation and potentially fatal skin cancer. Despite these sightings, the disease is not known to infect humans or pets and is not considered a threat to public health.",
  "shortSummary": "Experts warn of a rapidly spreading virus, CRPV, causing cottontail rabbits to sprout massive head spikes, posing a public health threat but not inhumane.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "c01766255fac4b2288f16ef2b81bf02f",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.coloradoan.com/story/news/2025/08/12/frankenstein-rabbits-with-papillomas-sprout-tentacle-like-growths/85628242007/",
      "text": "Rabbits with horn-like growths appearing in Fort Collins, caused by rabbit papillomas\n- The virus, spread by insects or direct contact, poses no threat to humans.\n- While usually not harmful to wild rabbits, the virus can be more serious for domestic rabbits.\nCottontail rabbits with horn-like growths on their heads have appeared in Fort Collins in recent weeks, causing concern of the health risk to the rabbits and humans.\nColorado Parks and Wildlife spokesperson Kara Van Hoose said she was notified by the public late last week of rabbits with effects of the rabbit papillomas, a skin virus that produces horn-like growths or black nodules mostly around the head.\nVan Hoose said despite the appearance, the growths have no significant effects on wild rabbits unless they impact the rabbit's eyes or mouths and interfere with seeing and eating or drinking.\nThe virus is specific to rabbits and poses no risk to human or pet health, according to a Colorado Parks and Wildlife brochure.\n\"Typically rabbits become infected in the warmer months of summer when transmitted by being bitten by insects like fleas and ticks then clears from the system in colder months and the rabbits are typically fine,\" Van Hoose said.\nThe virus can also spread through direct contact and can infect domestic rabbits housed outdoors. In domestic rabbits, the disease is more severe than in wild rabbits and should be treated by a veterinarian, according to the brochure.\nVan Hoose said as with any wild animals, people and pets should not approach, touch, catch or feed infected rabbits."
    },
    {
      "url": "https://www.dailymail.co.uk/sciencetech/article-14993099/Frankenstein-rabbits-tentacles-heads-colorado.html",
      "text": "A bizarre virus is turning ordinary rabbits in the US into grotesque, horned creatures with black, tentacle-like growths sprouting from their faces – and sightings are on the rise.\nThe mutated rabbits have been spotted multiple times in Fort Collins, Colorado.\nReports date back to 2024, when a resident posted a photo online showing the creature's entire head covered in black, spike-like protrusions.\nResident Susan Mansfield told 9News that she recently spotted a rabbit with black spines or 'quills' around its mouth.\n'It looked like black quills or black toothpicks sticking out all around its mouth,' Mansfield said. 'I thought he'd die off during the winter, but he didn't. He came back a second year – and it grew.'\nThe rabbits are infected by the cottontail papilloma virus (CRPV), also known as Shope papilloma virus, which causes tumors to grow on or near the animal's head.\nColorado Parks and Wildlife (CPW) has urged anyone who sees infected rabbits to stay away and not touch them.\nCPW does not believe the virus can leap to other species, such as humans or pets, but is still urging the public to avoid the rabbits and not attempt to help them.\nA user on Reddit posted an image in 2024 of a rabbit in Fort Collins, Colorado exhibiting signs of Shope papilloma virus\nShope papilloma virus leads to large growths on the head and face of rabbits and is spread by disease-carrying mosquitoes\nAlthough these 'Frankenstein' rabbits have mainly been seen in Colorado recently, researchers noted that cottontail rabbits throughout the Midwest could become infected with the rare virus.\nThe virus spreads mainly via mosquitoes and ticks, which bite an infected animal and pass on the DNA-altering condition.\nScientists noted that SPV rarely spreads through direct contact between these rabbits, and there are no known cases of insects infecting people with it through a bite.\nThe first sign that a rabbit has the virus is red, raised spots on their skin that eventually turn into wart-like tumors.\nIn many cases, these warts develop into keratinized papillomas, the 'horns' and 'tentacles' seen growing out of midwestern rabbits.\nHowever, some of the warts can turn into a squamous cell carcinoma, a serious skin cancer that can be deadly if it spreads and isn't treated early.\nFor pet owners fearing their rabbits could contract the virus, medical experts said the best way to prevent SPV is to keep rabbits away from pests, especially mosquitoes.\nIf an insect bite does infect a pet rabbit with the virus, veterinarians can surgically remove the tumors before they become malignant.\nA normal cottontail rabbit with the virus. The first signs of SPV would be raised red spots on the skin (Stock Image)\nIn 2013, a video of another rabbit with Shope papilloma virus (pictured here) captivated viewers online\nThe virus is not thought to be painful unless the growths affect a rabbit's eyes or mouth\nOccasionally, the growths heal on their own, but locals say wild rabbits in the area tend to develop bigger and bigger horns.\nThe tumors can eventually become large enough to interfere with the rabbit's ability to eat, causing them to die of starvation.\nAccording to PetMD, these tumors typically develop on the ears, eyelids, or other parts of the head, making it sometimes impossible to see or hear.\nSome on social media have questioned whether euthanizing infected wild rabbits would stop the spread.\n'Is it more humane to kill them when [they're] like that or just leave them alone?' one person posted on Reddit.\nAnimal control officials in the US have not made any kind of recommendation supporting this, adding that the virus does not pose a public health risk to people.\nLocal wildlife officials have maintained that the best thing to do if you see these disfigured rabbits is to keep your distance and leave them undisturbed.\nThe horns created by Shope papilloma virus are often benign, but some cases of the virus can cause cancerous tumors to form (Stock Image)\nWildlife officials have noted that there is no threat to human health, but people are still warned not to touch infected rabbits\nRabbits that contract the virus have often been the source of stories about the mythical 'jackalope', which is a rabbit with antlers of an antelope.\nStories and illustrations of horned rabbits have appeared in scientific books dating back many years, such as the Tableau encyclopédique et méthodique from 1789."
    },
    {
      "url": "https://nypost.com/2025/01/10/health/rabbit-fever-cases-rising-in-us-as-cdc-warns-of-zoonotic-bacterial-disease/",
      "text": "Cases of tularemia, also known as “rabbit fever,” are on the rise in the U.S., according to a new report from the Centers for Disease Control and Prevention (CDC).\nCaused by the bacteria Francisella tularensis, the disease commonly infects rabbits, hares and rodents.\nHowever, it is zoonotic, which means it can spread from animals to humans.\nThe bacteria is a “tier-1 select agent,” a classification given to agents and toxins that “present the greatest risk of deliberate misuse with significant potential for mass casualties or devastating effects to the economy, critical infrastructure or public confidence, and pose a severe threat to public health and safety,” per the CDC.\nAlthough tularemia is relatively rare, with only 2,462 diagnoses between 2011 and 2022, cases have risen 56% compared to the prior decade (2001 to 2010), as reported in the CDC’s Morbidity and Mortality Weekly Report.\n“Increased reporting of probable cases might be associated with an actual increase in human infection, improved tularemia detection or both,” the report states.\nDaniel Ruderfer, M.D., chief of the Division of Pediatric Infectious Diseases at Hackensack Meridian K. Hovnanian Children’s Hospital in New Jersey, believes that the increase in cases is mostly due to improved microbiology detection methods.\n“The traditional method of confirming cases has historically been via growth in culture and antibody testing,” he told Fox News Digital.\n“However, newer detection methods, such as PCR testing, are likely a major contributor to the increase in reported cases.”\nHumans can contract the disease through bites from deer flies or ticks, contact with infected animals, or exposure to contaminated water or aerosols, the same source stated.\nSymptoms of tularemia can vary depending on the type of disease.\nGeneral symptoms include chills, headache, malaise, fatigue, anorexia, myalgia, chest discomfort, cough, severe sore throat, vomiting, diarrhea, and abdominal pain, according to Ruderfer.\n“Depending on the location of the infected bit or scratch, people can develop localized lymphadenopathy (enlarged lymph nodes) and a cutaneous ulcer at the infection site,” he said.\n“Other manifestations include conjuctivitis, pneumonia and potentially even bloodstream infections.”\nThe death rate from the disease is typically low, less than 2%, but the CDC noted that it can be as high as 24% in rare, severe cases.\nTularemia can be treated with antibiotics, but no vaccine is currently available.\n“The infection is absolutely dangerous and potentially life-threatening if not treated with appropriate antibiotics,” said Ruderfer.\nThose most at risk include children between 5 and 9 years of age, older men, American Indian and Alaskan Native people, and those living in central U.S. states, according to the report.\nThe general population is not at an “obvious” risk for infection unless they come into physical contact with an infected rabbit, tick or deer fly, the expert noted.\nThose who hunt or interact routinely with rabbits should see a doctor if they develop any concerning symptoms, he advised.\n“Many factors might contribute to the higher risk for tularemia in this population, including the concentration of Native American reservations in central states and sociocultural or occupational activities that might increase contact with infected wildlife or arthropods,” the CDC wrote."
    },
    {
      "url": "https://www.si.edu/stories/worlds-scariest-rabbit",
      "text": "The world’s scariest rabbit lurks within the Smithsonian’s collection\nAmong the bats, rats and other ferocious animals that lie within the storage drawers of the mammal collection in the Smithsonian’s National Museum of Natural History in Washington, D.C., an unusual freak of nature can be found.\nThe jackalope, also commonly known as a ‘Frankenstein’ rabbit, is the stuff of nightmares, with elongated horns protruding from its furry little head. The mythological jackrabbit with the horns of an antelope is an American legend, one that young biology students are taught to regard with the same disbelief as unicorns and werewolves.\nSo when one of the museum’s mammal collection managers, Suzanne Peurach, from U.S. Geological Survey Patuxent Wildlife Research Center, discovered an eastern cottontail rabbit with horny facial growths in the collection, she could not believe it was real.\n“When I pulled the rabbit out of the box I thought this must be a joke. I went to school in Albuquerque, N. M., and everywhere you go there are jackalopes in biology professors’ offices and even being sold in stores,” Peurach explains.\n“Those are fake animals, the result of people sewing taxidermy rabbits and deer antlers together. This rabbit was definitely not one of those.”\nIndeed the rabbit was real, and after conferring with Robert Hoffmann, senior Smithsonian mammologist and world authority on rabbits and hares, Peurach learned that the rabbit was infected by Shope papilloma virus. The virus infects rabbits and hares worldwide, causing tumors to grow in various places on a rabbit’s head and body.\nThe Shope papilloma virus is a cancer-causing strain related to the human papillomavirus, or HPV. Whereas HPV corrupts cells in the human cervix to build cancerous tumors, in rabbits the papillomavirus manifests as hard, keratinized horns. If they develop near the mouth, the tumors can become large enough that they interfere with the host’s ability to eat, eventually causing starvation. Such papillomaviruses are found throughout the animal kingdom, including in other mammals, birds and reptiles.\nAlthough American virologist Richard Shope discovered the virus in the 1930s, its distinctive symptoms in rabbits and hares have mystified and inspired people for centuries. Descriptions of horned hares as real or mythical creatures date back to medieval and early Renaissance times, appearing in Bavarian folklore and early scientific texts. Stories and illustrations of horned rabbits as real animals last appeared in scientific books in the late 1700s, after which the idea of a horned hare as a distinct species was mostly rejected.\nSightings of virus-affected rabbits in North America are thought to have influenced the resurrection of the horned rabbit legend. The term “jackalope” was most likely coined by taxidermists who reproduced the horned hare of legend by grafting pronghorn horns onto the mounted head or complete body of a jackrabbit.\nThe New York Times attributes the popularization of the jackalope to Douglas Herrick (1920–2003) of Douglas, Wyoming., who in 1932 created and sold the first taxidermy “jackalope.” These taxidermy mounts became hugely popular, with many thousands being made and sold by Herrick’s brother and son.\nToday the jackalope legend is still a popular story, with many outlandish and largely tongue-in-cheek claims as to the mythological creature’s habits. Like most campfire stories, a little bit of truth mixed in with large amounts of imagination can result in a strange cottontail."
    },
    {
      "url": "https://www.petmd.com/rabbit/conditions/viral/c_rb_shope_papilloma_virus",
      "text": "Head Tumors and Cancer in Rabbits\nShope Papilloma Virus\nShope papilloma virus, sometimes referred to as cottontail cutaneous papilloma virus, is a viral disease that causes malignant tumors to grow in rabbits, often on its head. The virus is seen in wild rabbits, as well as domestic or pet rabbits.\nOutbreaks of the disease more commonly seen during the summer and fall, when populations of disease-carrying insects are highest. Keeping rabbits indoors during these seasons is recommended.\nSymptoms and Types\nA member of the Papovaviridae family, this virus is frequently seen in cottontail rabbits, but may be contagious for other breeds. A rabbit suffering from Shope papilloma virus will have raised, red and rough lesions (usually circular), which are greater than one centimeter in length. These lesions are found in various locations on the upper half of the animal's body, including the neck and shoulders, but are primarily found on the eyelids, ears and other areas of the head. (They are occasionally seen on a rabbit's feet.)\nCause\nThis type of papilloma virus is often spread by biting insects known as arthropods, more specifically mosquitoes and ticks.\nDiagnosis\nTo diagnose the disease, the nodules will have to be removed. A biopsy will then be performed to confirm the malignancy of the cancer.\nTreatment\nSurgical removal of the tumors is generally recommended, as the nodules may become malignant, however, they do occasionally resolve themselves on their own.\nLiving and Management\nRoutine follow-up exams at the veterinarian's office is recommended. This will allow them to monitor the rabbit's progress and remove any recurring tumors. The rabbit must not be allowed to scratch the lesions, as they may bleed and can lead to an infection.\nPrevention\nKeeping the rabbit away from pests, including mosquitoes and ticks, is the best way to prevent the animal from contracting Shope papilloma virus; it will also prevent the spread of the disease.\nFeatured Image: iStock.com/skynesher"
    },
    {
      "url": "https://nypost.com/2025/08/07/science/shroud-of-turin-study-unlocks-new-key-details-of-jesus-burial/",
      "text": "Shroud of Turin study unlocks new, key details of Jesus’ burial — reinforcing accuracy of biblical accounts\nThe blood, sweat and tears on these threads are still — sorta — shrouded in mystery.\nNew findings provide more evidence on what Jesus might have been buried in after he was crucified.\nA recent study conducted by Johns Hopkins-trained immunologist Kelly Kearse suggests that it is, in fact, possible that Jesus was buried unwashed, wrapped in spices and linen — which is believed to be the Shroud of Turin — as biblical narratives suggest.\nThe research, published in the International Journal of Archaeology in June 2025, specifically referenced a garment where evidence of blood clotting was found.\nAmong the key discoveries from the study, visible rings around bloodstains — or serum halos — were found on the linen when examined with a UV light.\nKearse tested multiple samples — mimicking blood conditions after death, including thickened consistency and increased acidity.\nThe expert also studied the way that blood transfers to textiles in various conditions and compared it to the bloodstains on the Shroud of Turin with a microscope.\nThe immunologist, who has studied the shroud for years, believes that this is a revealing element that can help provide context for Jesus’ burial conditions — specifically, for what he calls ‘the washing hypothesis,’ according to the study.\nA previous study of the shroud, done in 1998, concluded that if a body was indeed enveloped in the cloth, it was washed before burial.\nThe serum halos are only visible if wounds begin to clot before touching the surface. If the body were washed or cleaned, the stains wouldn’t be as prominent.\nBiblical passages suggest that the Jewish burial customs observed prohibited the washing of bodies that suffered violent deaths, with the belief that blood should not be separated from the physical body in the case of murder.\nCountless studies about the Shroud of Turin have been conducted across the centuries since it surfaced, and skeptics have suggested various theories about the authenticity of the shroud itself and the biblical account.\nOne such recent inquiry into the iconic cloth is that it was not the messiah’s post-mortem mode, but rather, it was used to swathe an artist’s chiseled Christ-like copy, a study suggested."
    },
    {
      "url": "https://cpw.state.co.us/species/cottontail-rabbits#:~:text=Rabbit%20Papillomas,be%20treated%20by%20a%20veterinarian.",
      "text": "Meeker Office Closure\nThe Meeker office is closed until further notice due to the Lee Fire. Please view the news release for additional details and alternative office information.\nMeeker Office Closure\nThe Meeker office is closed until further notice due to the Lee Fire. Please view the news release for additional details and alternative office information.\nColorado is home to three species of cottontail rabbits: the mountain, the desert, and the eastern cottontails.\nAlmost everyone recognizes rabbits with their distinctive hopping gait and long ears. Colorado is home to three different species of cottontail rabbits; the mountain cottontail, the desert cottontail, and the eastern cottontail. The species of cottontails differ mostly by color and are difficult or impossible to distinguish in the field, except by habitat and geographic location.\nDisease\nRabbit papillomas are growths on the skin caused by the cottontail rabbit papillomavirus. The growths have no significant effects on wild rabbits unless they interfere with eating/drinking. Most infected cottontails can survive the viral infection, after which the growths will go away. For this reason, CPW does not recommend euthanizing rabbits with papillomas unless they are interfering with the rabbit’s ability to eat and drink.\nLike other papillomaviruses, this virus is specific to rabbits and does not cause disease in other species. There is a risk of transmission to domestic rabbits, especially if rabbits are housed outdoors where they may contact wild rabbits or biting insects. In domestic rabbits, the disease is more severe than in wild rabbits and should be treated by a veterinarian.\nCottontails are about 16 inches long and weigh about two pounds. Cottontails are smaller and have shorter ears than shoeshoe hares and jackrabbits. Also unlike hares, cottontails do not change color in the winter.\nMountain cottontails live in the mountains and in the northwest, desert cottontails live in the southwest and on the eastern plains, eastern cottontails live in woodlands along watercourses in the east.\nCottontails mostly live in brushy country. Therefore they may be favored by habitat disturbance, such as forest clearance, burning, and ornamental plantings. They spend the day in a shallow depression in the shelter of a thicket. Cottontails are a familiar sight across Colorado, including in urban and suburban areas.\nThey eat vegetation, both herbaceous and woody, feeding early morning and late afternoon throughout the year.\nReproduction takes place throughout the warmer months, with females giving birth to two to six litters of four to seven blind, pink young after a gestation period of about four weeks. Such high birth rates obviously must be balanced by high death rates or ecosystems would be overwhelmed by cottontails.\nThe primary predators of adult cottontails are coyotes, foxes, hawks, and owls. Weasels and rattlesnakes prey on the young, and disease and parasites take a toll on all age groups. Maximum life span in the wild is no more than about a year. Human hunters kill 50,000 or more cottontails some years."
    },
    {
      "url": "https://nypost.com/2025/08/12/science/how-to-watch-2025-perseid-meteor-shower-with-a-special-surprise/",
      "text": "How to watch tonight’s Perseid meteor shower and the special planetary surprise\nGather round and gaze up, cosmic kids, the annual Perseid meteor shower peaks tonight.\nIn previous years, the Perseid shower has produced as many as 40-50 visible meteors per hour at its peak. Unfortunately, this year, due to the shower peaking close to a nearly Full Moon, visibility will be compromised.\nThe moon will technically be in its waning gibbous phase, or 85% illuminated, making meteor viewing more challenging. Still, according to experts, sky gazers still stand to see 10 to 20 meteors per hour.\nWhen to watch the Perseid meteor shower\nHopeful watchers have two windows tonight and in the wee hours of tomorrow to catch the shooting star show.\nThis evening, there will be a one-hour gap between dusk and moonrise, providing a prime canvas to see “Earth grazers,” or meteors that graze the upper atmosphere.\nWhile these beauties may be few and far between, they are long and long-lasting, painting the sky for two to three seconds a pop.\nOur second viewing window opens in the last hours before daybreak on Wednesday, roughly 3 a.m. – 6 a.m.\nWhile the nearly full moon will be clogging the southern sky with its lunar light, viewers can turn their gaze northward toward the constellation Perseus and catch a few bright meteors before the sun rises.\nWhere to see the Perseid meteor shower\nAs a celestial boon to those who are rising early or staying up late, the Perseid peak occurs just after the conjunction of Venus and Jupiter, and the two luminaries will still be cuddling close together and shining brightly in the sky just before sunrise.\nHow to see the Perseid meteor shower\nThe Perseids are best viewed under clear skies and away from the maddening hum of crowds and the ugly interference of light pollution.\nAnd while many a noob will reach for a telescope or binoculars, it is better to take in the entirety of the sky, rather than a small part.\nThe meteors can and will appear anywhere up there, but your best bet is to stare into the darkest part of the sky that your location affords. For best results, lie flat on your back. After roughly 30 minutes, your eyes will adjust to the dark..\nWhile the Perseids peak tonight, the shower will keep on showering through Sept. 1, giving us more time for gazing. Conditions will improve as the moon wanes back to the black of a New Moon on Aug. 23.\nAstrologer Reda Wigle researches and irreverently reports on planetary configurations and their effect on each zodiac sign. Her horoscopes integrate history, poetry, pop culture, and personal experience. To book a reading, visit her website."
    },
    {
      "url": "https://nypost.com/2025/06/17/science/psychopaths-are-most-likely-to-live-in-these-4-states-study/",
      "text": "Psychopaths are most likely to live in these 4 states, a frightening new study reveals\nAs it turns out, our personalities are, in fact, shaped by the environments we grow up in, and Nevada, New York, South Dakota, and Texas contain the highest percentages of those in possession of “dark personality traits.”\nA recent study conducted by Ingo Zettler, Lau Lilleholt, Benjamin E. Hilbig, Morten Moshagen, and Martina Bader at the University of Copenhagen found that humans display different levels of dark personality traits depending on their location and the concentration of aversive societal conditions (ASC) that place possesses.\nDark personality traits, or the dark triad, are recognized by psychologists as psychopathy, narcissism, and Machiavellianism — the desire or urge to exploit others.\nMeanwhile, ASC can be defined as societal circumstances that occur on a large, collective scale, such as exploitation, fraud, corruption, inequality, and violence, among others.\n“It is relatively well known that both genetic and socio-ecological factors shape individuals’ personality. However, respective research has hardly considered ethically or socially aversive personality characteristics,” Ingo Zettler, co-author and point-person on the study, told Newsweek.\nThe study, published in 2025, took place across a period of 20 years, in which researchers studied global correlations between general living conditions and the percentage of the population that possesses dark traits.\nThe study probed 183 countries across the world with a total of 1,791,542 participants.\nIn their exploration of the correlation between dark personality traits and aversive social conditions, the researchers examined the U.S. through the lens of individual states.\nData was gathered via survey, and for the U.S.-focused portion of the study, used Census data on socioeconomic disparity and poverty, FBI homicide rates, and Justice Department corruption sentences to draw conclusions.\nWithin the U.S., researchers looked into all 50 states and compiled responses from 144,576 Americans.\n“The more adverse conditions in a society, the higher the level of the dark factor of personality among its citizens,” Zettler summarized. “Aversive personality traits are associated with behaviors such as aggression, cheating, and exploitation — and thus with high social costs. Therefore, even small variations can lead to large differences in how societies function.”\nUrban areas of the United States tend to house extraordinarily economically diverse populations — cities like Los Angeles, New York City, and San Francisco — in close concentration, which can lead to tensions and concerns over quality of life and equal access to essential resources, resulting in higher D levels.\nOn the other hand, rural areas — like much of Vermont, Utah, Maine, and Oregon, the four states with the lowest probability of producing individuals as a result of living conditions — are more likely to be geographically isolated and relatively economically balanced, per findings from the study.\n“Because you might grow up in a country with a high ASC, you’re not necessarily fated to become an immoral, exploitative, and self-centered individual,” wrote Susan Krauss Whitbourne in Psychology Today. “What the findings suggest, instead, is that consistent with the adaptational hypothesis, people may acquire a tendency toward high levels of D if that’s what they see around them, or if their own economic deprivation and hardship are particularly pronounced.”\n“Our findings substantiate that personality is not just something we are born with, but also shaped by the society we grew up and live in,” Zettler concluded.\n“This means that reforms that reduce corruption and inequality not only create better living conditions just now, they may also contribute to mitigating aversive personality levels among the citizens in the future.”"
    }
  ],
  "argos_summary": "A rapidly spreading virus known as cottontail papilloma virus (CRPV) is causing cottontail rabbits in Fort Collins, Colorado, to develop grotesque, horn-like growths on their heads. The virus, transmitted by parasites like ticks and fleas, primarily affects wild rabbits but can be more severe in domestic ones, potentially leading to starvation or cancer. While the virus poses no threat to humans or pets, wildlife experts advise the public to avoid contact with infected rabbits.",
  "argos_id": "BF8UV177X"
}