{
  "url": "https://www.forbes.com/councils/forbesbusinesscouncil/2025/08/13/what-successful-business-owners-do-when-motivation-disappears/",
  "authorsByline": "Minna Hu",
  "articleId": "c4e974875662445a880e2dc547d234f8",
  "source": {
    "domain": "forbes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NJ",
      "county": "Hudson County",
      "city": "Jersey City",
      "coordinates": {
        "lat": 40.7215682,
        "lon": -74.047455
      }
    }
  },
  "imageUrl": "https://imageio.forbes.com/specials-images/imageserve/68240f6b37552a7c1ff4b312/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-13T13:15:00+00:00",
  "addDate": "2025-08-13T13:22:34.188523+00:00",
  "refreshDate": "2025-08-13T13:22:34.188524+00:00",
  "score": 1.0,
  "title": "What Successful Business Owners Do When Motivation Disappears",
  "description": "Every entrepreneur loses steam sometimes.",
  "content": "Minna Hu, Founder of AI Bookkeeper, is committed to helping small-business owners free up the time they spend on bookkeeping.\n\nLast month, I hit a wall. My energy was gone, and even simple decisions felt like a burden. I wanted to sleep in, skip meetings and let emails pile up. Everything felt heavy.\n\nI defaulted to watching TV, hoping I’d feel better. I didn’t. I just procrastinated more and felt guilty. But in that guilt, I found clarity.\n\nHere’s what helped me recover—and what you, as a business leader, can do when you hit a motivation slump:\n\n1. Recognize that motivation is a byproduct (not a prerequisite).\n\nAs business owners, we often believe we need to feel motivated before we take action—before we launch that campaign, make that hire or face that client conversation. But the truth is, motivation rarely shows up before work. It tends to show up after.\n\nThis mindset shift is critical: Motivation follows momentum. Action comes first.\n\nThink of it this way: You’ve probably had days where you dreaded a meeting, but once it started, your energy kicked in and ideas started flowing. That’s not a coincidence. We often respond to motion, whether that's mental, physical or emotional.\n\nTry This: Pick one item from your to-do list right now. Not the biggest, just the one you can start. Don’t overthink it. Just move. That’s how motivation is made. Don’t wait for the spark—create it.\n\nWhen you’re dragging, it’s not just mental—it’s chemical. The brain’s motivation circuitry is driven by dopamine. According to neuroscientist Dr. Andrew Huberman, one of the best ways to reset your dopamine levels when struggling with amotivation is through short-term discomfort. Cold exposure, like a cold shower or an outdoor walk in cool air, can do the trick.\n\nFrom a business perspective, you can think of it like a reboot. You wouldn’t keep running software that’s glitching without restarting it. Your nervous system is the same.\n\nTry This: After a long meeting day or when you're spiraling in indecision, step away. Take a three-minute cold shower. Or go for a brisk 10-minute walk without your phone.\n\n3. Keep micro-promises to yourself.\n\nWhen motivation tanks, I've learned the worst thing you can do is try to overhaul your entire routine. Instead, focus on micro-promises. These are small commitments that you complete no matter what. It’s about rebuilding internal trust.\n\nFor business owners, that might look like:\n• Following up on one overdue invoice.\n• Responding to one client you’ve been avoiding.\n\nThese aren’t game-changing actions on their own. But psychologically, they flip the script. They remind you: You follow through. And that identity shift restores confidence.\n\nTry This: Pick one micro-promise for tomorrow. Make it small. Write it down. Keep it. Then tell yourself: “I did it.” That’s how the turnaround begins.\n\n4. Celebrate the win, then build the next step.\n\nAs high performers, we often move quickly from one task to the next without taking a moment to acknowledge what we’ve accomplished. But celebration—especially after a slump—isn’t vanity. It’s a form of reinforcement. You are training your brain to associate action with reward.\n\nIf you hit a business milestone, don’t just archive the email, savor it. If you completed a hard task today, take a walk, have a coffee or tell someone. It builds psychological momentum.\n\nThen pick the next micro-promise and repeat.\n\nTry This: When you complete your micro-promise today, pause. Smile. Say “I did it.” Feel the win, even if it’s small. Then choose what’s next.\n\n5. Start building momentum in the right direction.\n\nProcrastination doesn’t mean you’re lazy. It means you’ve started moving in the wrong direction. It has its own momentum, and I've found the longer you’re in it, the harder it is to stop.\n\nThe key is not to shame yourself out of it, but to interrupt the loop. The micro-promises and resets mentioned above are how you break inertia.\n\nAs a business owner, you know that when a project stalls, you don’t abandon it—you diagnose it and reengage. Do the same with your internal energy. Don’t label it as failure; treat it like a stuck process that needs a gentle nudge.\n\nTry This: Take stock right now. What’s one area where procrastination has crept in? Name it. Then take one tiny step toward it today. One email. One document opened. One reminder set. That’s how you turn momentum around.\n\nFinal thought: Business is a long game of returning to drive.\n\nEvery entrepreneur loses steam sometimes. That’s normal. What separates those who thrive is not constant motivation—it’s the ability to return to motivation again and again.\n\nIt only takes one spark to reignite the fire.\n\nAnd when you do it—one small promise at a time—you won’t just recover your momentum. You can rebuild your belief in yourself.\n\nis the foremost growth and networking organization for business owners and leaders.",
  "medium": "Article",
  "links": [
    "https://www.youtube.com/watch?app=desktop&v=48jlHaxZnig&t=1s",
    "https://pmc.ncbi.nlm.nih.gov/articles/PMC3032992/#S21",
    "https://councils.forbes.com/qualify?utm_source=forbes.com&utm_medium=referral&utm_campaign=forbes-links&utm_term=fbc&utm_content=in-article-ad-links",
    "https://longevity.stanford.edu/lifestyle/2024/05/22/jumping-into-the-ice-bath-trend-mental-health-benefits-of-cold-water-immersion/",
    "https://www.book-keeper.ai/",
    "https://councils.forbes.com/forbesbusinesscouncil?utm_source=forbes.com&utm_medium=referral&utm_campaign=forbes-links&utm_content=in-article-ad-links"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "business owners",
      "weight": 0.08842996
    },
    {
      "name": "Successful Business Owners",
      "weight": 0.08336464
    },
    {
      "name": "Business",
      "weight": 0.07178953
    },
    {
      "name": "constant motivation",
      "weight": 0.07031494
    },
    {
      "name": "Motivation",
      "weight": 0.06871273
    },
    {
      "name": "motivation",
      "weight": 0.06871273
    },
    {
      "name": "promise",
      "weight": 0.057605054
    },
    {
      "name": "promises",
      "weight": 0.057605054
    },
    {
      "name": "small-business owners",
      "weight": 0.05322042
    },
    {
      "name": "psychological momentum",
      "weight": 0.05112077
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Business"
    }
  ],
  "taxonomies": [
    {
      "name": "/Business & Industrial/Business Operations/Management",
      "score": 0.7744140625
    },
    {
      "name": "/People & Society/Self-Help & Motivational",
      "score": 0.486572265625
    },
    {
      "name": "/Jobs & Education/Jobs/Career Resources & Planning",
      "score": 0.453857421875
    },
    {
      "name": "/Business & Industrial/Business Operations/Human Resources",
      "score": 0.328125
    }
  ],
  "sentiment": {
    "positive": 0.10526882,
    "negative": 0.5377408,
    "neutral": 0.35699037
  },
  "summary": "Minna Hu, Founder of AI Bookkeeper, has shared her tips for overcoming a motivation slump when a lack of motivation can lead to a slump. She explains that motivation is a byproduct of action, not a prerequisite, and that motivation follows momentum. Instead of overhauling your entire routine, focus on small commitments that restore internal trust and remind you of the commitment to follow through. When motivation is struggling, it's not just mental but chemical, as such as a cold shower or outdoor walk without phone, it can help to reset the brain's motivation circuitry through discomfort. Hu suggests that instead of obsessing over tasks, creating a positive self-esteem and celebrating success rather than over-achieving moments.",
  "shortSummary": "Minna Hu's AI Bookkeeper helps small business owners recover from motivation struggles by focusing on micro-promises, recognizing momentum, and engaging in short-term discomfort.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "774eeb62a93c4596a29584d59da54f14",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Minna Hu, founder of AI Bookkeeper, shares strategies for overcoming motivation slumps that many business leaders face. She emphasizes that motivation often follows action, suggesting that taking small steps can help reignite energy and productivity. Techniques include recognizing the importance of micro-promises, celebrating small wins, and using short-term discomfort to reset motivation levels. Ultimately, Hu encourages entrepreneurs to view motivation as a cycle of returning to drive rather than a constant state.",
  "argos_id": "DP9334JUL"
}