{
  "url": "https://www.wsj.com/buyside/personal-finance/mortgage/mortgage-rates-today-8-13-2025",
  "authorsByline": "Miranda Marquit",
  "articleId": "58f4615f97424136aee5a4a2984b57b1",
  "source": {
    "domain": "wsj.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://www.wsj.com/buyside/content-images/e3c7478f-dfa4-45b4-8eee-db125a227c09",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-13T08:14:57.368000-05:00",
  "addDate": "2025-08-13T13:19:49.069989+00:00",
  "refreshDate": "2025-08-13T13:19:49.069991+00:00",
  "score": 1.0,
  "title": "Mortgage Rates Today, August 13, 2025: 30-Year Rates Drop to 6.66%",
  "description": "Explore current mortgage rates and what they mean for homebuyers.",
  "content": "Today's mortgage rates are influenced by economic and market conditions, as well as personal factors. The rate you’re quoted by a lender might be higher or lower than the national average. Here are some of the items considered when calculating your mortgage rate:\n• 10-year Treasury yield: Current mortgage rates, especially on a 30-year fixed-rate mortgage, are related to movements in the 10-year Treasury yield.\n• Mortgage-backed securities: The rate investors earn on mortgage-backed securities also plays a role. Spreads between mortgage-backed securities and Treasury yields, as well as between what lenders offer borrowers and mortgage-backed security rates, impact current mortgage rates.\n• Investor sentiment: Perceptions about fiscal policy and economic conditions can affect how Treasuries move, as well as how much risk lenders feel comfortable taking on.\n• Personal credit history: The information in your credit report and your credit score influence your mortgage rate quote.\n• Income: Lenders look at your income relative to your potential mortgage payment and other debts you have. If it appears you can handle your mortgage payments with relative ease, they feel more comfortable lending you money.\n• Down payment: Your mortgage rate might be lower if you make a larger down payment; often, the best results are when you put at least 20% down.\n• Points paid: Mortgage points, also known as discount points, are fees paid upfront as a way to directly reduce your rate and lower your monthly payments. Each point, which represents 1% of your loan amount, can potentially reduce your rate by up to 0.25 percentage points.\n• Loan term: A 15-year mortgage rate is usually lower than a 30-year rate. By choosing a shorter term, you might be able to get a lower interest rate, but your monthly payment might be higher.\n\nHow to choose the right mortgage for your financial goals\n\nWhen considering a mortgage, review your financial situation and goals. Often, 30-year fixed-rate mortgages are chosen because they spread a large payment over a longer period of time, making monthly payments more affordable. Even though the loan costs more overall, it might be more affordable on a day-to-day basis.\n\nIf your main concern is becoming debt-free sooner while paying less interest and you can afford a higher monthly payment, a shorter-term loan might make sense. Let’s say you get a $350,000 loan. Here’s what you might pay with different mortgage terms:\n• 30-year loan (6.97%): Monthly payment of $2,321.51 and total interest amount of $485,744.05\n• 20-year loan (6.74%): Monthly payment of $2,659.19 and total interest amount of $288,206.46\n• 15-year loan (6.20%): Monthly payment of $2,991.45 and total interest amount of $188,461.10\n• 10-year loan (6.16%): Monthly payment of $3,913.90 and total interest amount of $119,667.88\n\nThese scenarios don’t include other costs, like insurance and property taxes, that you might also be subject to. It’s important to consider those costs as well. For example, you might think you can afford the payments on a 20-year or 15-year mortgage, but once you add in other homeownership costs, your budget might feel tight.\n\nDon’t forget other homeownership costs that might impact your monthly budget, including maintenance, repairs, utilities and other expenses that might be higher once you move into a house. When choosing a mortgage, the principal and interest payments aren’t the only considerations.\n\nOne strategy might be to choose a longer loan, but make extra payments to pay down the debt faster and reduce the amount of interest you pay. With this approach, you can choose to pay extra each month, but if you need to cut back due to emergency, you can revert to the required lower monthly payment with a lower risk of not being able to meet the obligation. If you lock into a shorter loan term with a higher payment, you can’t scale back payments later without risking the loss of the home.",
  "medium": "Article",
  "links": [
    "https://www.wsj.com/buyside/personal-finance/mortgage/mortgage-rates-by-credit-score",
    "https://www.wsj.com/buyside/personal-finance/mortgage/should-i-pay-off-my-mortgage",
    "https://www.wsj.com/buyside/personal-finance/mortgage/15-year-mortgage-rates"
  ],
  "labels": [
    {
      "name": "Paid News"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Mortgage Rates",
      "weight": 0.127542
    },
    {
      "name": "Monthly payment",
      "weight": 0.12598032
    },
    {
      "name": "monthly payments",
      "weight": 0.12598032
    },
    {
      "name": "Current mortgage rates",
      "weight": 0.12020442
    },
    {
      "name": "current mortgage rates",
      "weight": 0.12020442
    },
    {
      "name": "extra payments",
      "weight": 0.10867866
    },
    {
      "name": "payments",
      "weight": 0.10744692
    },
    {
      "name": "Mortgage points",
      "weight": 0.10721972
    },
    {
      "name": "different mortgage terms",
      "weight": 0.10391228
    },
    {
      "name": "total interest amount",
      "weight": 0.08416024
    }
  ],
  "topics": [
    {
      "name": "Markets"
    },
    {
      "name": "Mortgage Rates"
    },
    {
      "name": "Real Estate"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/Finance/Credit & Lending/Loans",
      "score": 0.65380859375
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.5732421875
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.51708984375
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.4345703125
    }
  ],
  "sentiment": {
    "positive": 0.15169573,
    "negative": 0.3299616,
    "neutral": 0.5183426
  },
  "summary": "Mortgage rates are influenced by economic and market conditions, as well as personal factors such as mortgage rates. Factors such as the 10-year Treasury yield, mortgage-backed securities, mortgage interest rates, and investor sentiment can affect current mortgage rates, including investor sentiment, mortgage rate spreads, and mortgage interest rate spreads. The mortgage rate may be lower if you make a larger down payment, often when you put at least 20% down. Mortgage points, also known as discount points, are fees paid upfront to directly reduce your rate and lower monthly payments. Discount points can potentially reduce rates by up to 0.25 percentage points. When considering a mortgage, review your financial situation and goals such as becoming debt-free sooner while paying less interest, and consider other costs such as insurance and property taxes.",
  "shortSummary": "Today’s mortgage rates, based on economic and market factors, may vary depending on personal factors, especially the 10-year Treasury yield, which influences mortgage interest rates.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "ffa4e9d1a14145aaa5f919ebadfae69e",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Today's mortgage rates are influenced by various factors including the 10-year Treasury yield, mortgage-backed securities, investor sentiment, personal credit history, income, down payment size, points paid, and loan term. Borrowers must consider their financial situation and goals when choosing a mortgage, weighing options between longer-term loans with lower monthly payments and shorter-term loans that reduce overall interest costs. It's also crucial to account for additional homeownership costs beyond principal and interest payments.",
  "argos_id": "FIX3NP1VQ"
}