{
  "url": "https://www.engadget.com/ai/you-can-pick-chatgpts-older-ai-models-again-121549264.html",
  "authorsByline": "Mariella Moon",
  "articleId": "07f1c6a9ab1540bca1c36e9e1e28c85e",
  "source": {
    "domain": "engadget.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "San Francisco",
      "city": "San Francisco",
      "coordinates": {
        "lat": 37.7790262,
        "lon": -122.419906
      }
    }
  },
  "imageUrl": "https://o.aolcdn.com/images/dims?image_uri=https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-uploaded-images%2F2025-08%2F45b2bb70-7830-11f0-8f6f-e242c196e0ae&resize=1400%2C933&client=19f2b5e49a271b2bde77&signature=446c4b95bf4c33a5d4d60843a2f77a43362f5a46",
  "country": "jp",
  "language": "en",
  "pubDate": "2025-08-13T12:15:49+00:00",
  "addDate": "2025-08-13T12:25:50.550164+00:00",
  "refreshDate": "2025-08-13T12:25:50.550165+00:00",
  "score": 1.0,
  "title": "You can pick ChatGPT's older AI models again",
  "description": "ChatGPT will now allow you to choose between several GPT-5 variants and previous OpenAI models.",
  "content": "ChatGPT will now allow you to choose between several GPT-5 variants and previous OpenAI models. In a post on X, OpenAI CEO Sam Altman has revealed that the chatbot's model picker now comes with three GPT-5 choices: Auto, Fast and Thinking. He said most \"will want Auto,\" which is most likely the standard version that's already a reasoning model. But users will be able to choose the fast-responding version or the Thinking version that implies it delivers longer, more comprehensive answers if they want to. GPT-4o is now also back in the model picker for all paying users by default.\n\nOpenAI removed GPT-4o with the launch of GPT-5: The company significantly simplified ChatGPT because GPT-5 was supposed to offer a unified experience for users. However, its decision was met by criticism from people who preferred GPT-4o's personality better, especially since it didn't give them notice that it was deprecating older models. In his post, Altman promised users that if the company ever does deprecate GPT-4o, OpenAI \"will give plenty of notice.\" In addition to the GPT-5 and GPT-4o models, users can toggle to \"Show additional models\" in ChatGPT web settings if they want to access o3, 4.1, and GPT-5 Thinking mini. GPT-4.5 is only available to subscribers paying for the $200-a-month Pro tier, though, because it \"costs a lot of GPUs.\"\n\nAltman said that GPT-5 Thinking now has rate limits of 3,000 messages a week, after which users will only be able to use GPT-5 Thinking mini. He has also revealed that OpenAI is working to update GPT-5's personality to make it warmer, but \"not as annoying (to most users) as GPT-4o.\"",
  "medium": "Article",
  "links": [
    "https://www.reddit.com/r/OpenAI/comments/1mki5dm/removing_gpt4o_biggest_mistake_ever/",
    "https://x.com/sama/status/1955438916645130740",
    "https://www.engadget.com/ai/openai-brings-gpt-4o-after-users-melt-down-over-the-new-model-172523159.html"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "GPT-5 Thinking",
      "weight": 0.13216276
    },
    {
      "name": "GPT-5 Thinking mini",
      "weight": 0.12517925
    },
    {
      "name": "previous OpenAI models",
      "weight": 0.115327835
    },
    {
      "name": "GPT-5",
      "weight": 0.11307636
    },
    {
      "name": "several GPT-5 variants",
      "weight": 0.11293639
    },
    {
      "name": "older models",
      "weight": 0.10521156
    },
    {
      "name": "most users",
      "weight": 0.1028789
    },
    {
      "name": "additional models",
      "weight": 0.10257808
    },
    {
      "name": "OpenAI CEO Sam Altman",
      "weight": 0.09687855
    },
    {
      "name": "users",
      "weight": 0.09457364
    }
  ],
  "topics": [
    {
      "name": "AI"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Science/Computer Science/Machine Learning & Artificial Intelligence",
      "score": 0.955078125
    },
    {
      "name": "/News/Technology News",
      "score": 0.91650390625
    },
    {
      "name": "/Computers & Electronics/Software/Business & Productivity Software",
      "score": 0.312255859375
    }
  ],
  "sentiment": {
    "positive": 0.071431704,
    "negative": 0.5830956,
    "neutral": 0.34547272
  },
  "summary": "OpenAI CEO, Sam Altman, has revealed that ChatGPT will now allow users to choose between several GPT-5 variants and previous OpenAI models again. The model picker now comes with three Gpt-5 choices: Auto, Fast, and Thinking. This move was criticized by users who preferred GPT4o's personality better and was not given notice that it was being deprecated. GPT 4.5 is only available to subscribers paying for the $200-a-month Pro tier, but it costs a lot of GPUs. The company is working to update GPT 5's personality to make it warmer but less annoying.",
  "shortSummary": "OpenAI's ChatGPT now allows users to choose between GPT-5 variants of AI, including Auto, Fast, and Thinking, while Gpt-4o remains available by default.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "81aac60eeae04986b887ef5b22690514",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.engadget.com/ai/openai-brings-gpt-4o-after-users-melt-down-over-the-new-model-172523159.html",
      "text": "OpenAI brings GPT-4o back online after users melt down over the new model\nThe newly-released GPT-5 may be smarter and more efficient, but some users prefer GPT-4o's conversational tone.\nFollowing the rollout of OpenAI's latest GPT-5 model earlier this week, a certain user base was adamantly calling for the return of the previous GPT-4o model. Outspoken users complained about the writing quality of the updated model, with some even going so far as to grieve the loss of GPT-4o, which some said they considered a friend and confidant.\nIn the latest OpenAI update that labels GPT-5 as the \"smartest, fastest, most useful model yet,\" the company removed the option to choose which model to use and defaults to GPT-5 instead. With the new model, GPT-5 uses a \"real-time router\" that switches between a more efficient model for basic questions and a deeper reasoning alternative for more complex demands.\nThe initial rollout ran into some issues that made GPT-5 seem \"way dumber,\" according to OpenAI's CEO Sam Altman, who also opened up a Reddit AMA to offer more insight into the changes. On Reddit, Altman responded to a question by saying GPT-5's writing quality is better than previous models, but asked users if this felt true. In response, several Redditors voiced their opinion that the GPT-5 felt \"sterile\" and \"much worse\" and answered \"briefly and dryly.\" In response to the initial outcry, Altman posted on X that OpenAI would let Plus subscribers choose between using GPT-5 or GPT-4o.\n\"We for sure underestimated how much some of the things that people like in GPT-4o matter to them, even if GPT-5 performs better in most ways,\" Altman said on X.\nThe return of GPT-4o was celebrated, but there's still no guarantee that OpenAI will keep its older model around indefinitely. In the same X post, Altman said that OpenAI \"will watch usage as we think about how long to offer legacy models for.\" In the meantime, OpenAI is focusing on finishing the GPT-5 rollout and making changes that will \"make it warmer.\" However, for users who have grown attached to GPT-4o as more than just an AI chatbot, this could be the beginning of the end."
    }
  ],
  "argos_summary": "OpenAI has introduced a model picker for ChatGPT, allowing users to choose between three variants of GPT-5—Auto, Fast, and Thinking—along with the return of GPT-4o for paying users. This change comes after user feedback criticized the initial rollout of GPT-5, which some found less personable than GPT-4o. OpenAI's CEO, Sam Altman, acknowledged the importance of GPT-4o's conversational tone and promised to improve GPT-5's personality while monitoring the usage of legacy models.",
  "argos_id": "GSCJKKOE7"
}