{
  "url": "https://www.techradar.com/pro/security/microsofts-latest-major-patch-fixes-a-serious-zero-day-flaw-and-a-host-of-other-issues-so-update-now",
  "authorsByline": "Sead Fadilpašić",
  "articleId": "6563e6c88b4a47709a192a14ee90a5da",
  "source": {
    "domain": "techradar.com",
    "paywall": false,
    "location": {
      "country": "in",
      "city": "New Delhi",
      "coordinates": {
        "lat": 28.6138954,
        "lon": 77.2090057
      }
    }
  },
  "imageUrl": "https://cdn.mos.cms.futurecdn.net/5041fbe73089e0689408c540ac34ef05-1280-80.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-13T13:34:57+00:00",
  "addDate": "2025-08-13T13:41:03.401689+00:00",
  "refreshDate": "2025-08-13T13:41:03.401691+00:00",
  "score": 1.0,
  "title": "Microsoft's latest major patch fixes a serious zero-day flaw, and a host of other issues - so update now",
  "description": "August 2025 Patch Tuesday release fixes some worrying flaws",
  "content": "• Users should apply the patch immediately, or risk attack\n\nMicrosoft has released its August 2025 Patch Tuesday package, a cumulative set of updates addressing more than 100 vulnerabilities across a host of its products.\n\nAmong them was a known zero-day vulnerability in Windows Kerberos, the company's implementation of the Kerberos authentication protocol, which securely verifies user identities in a Windows network using tickets instead of sending passwords over the network.\n\nKerberos was found to contain a “relative path traversal” flaw which allows an authorized threat actor to elevate privileges over a network.\n\nBesides the zero-day, Microsoft fixed another 106 flaws, including 13 bugs labeled “critical”.\n\nOf those, nine are remote code execution (RCE) flaws that can be abused in device takeover attacks, information disclosure flaws that can be used in data exfiltration attacks, and an elevation of privilege bug.\n\nSome of the more notable vulnerabilities fixed in the release include a 10/10, critical flaw in Azure OpenAI, tracked as CVE-2025-53767 which could allow unauthenticated threat actors to remotely access sensitive information in AI environments.\n\nAnother notable mention is a remote code execution bug in Microsoft Graphics Component that can be exploited through malicious files or images. It is tracked as CVE-2025-50165, and was given a severity score of 9.8/10 (critical).\n\nThere are also CVE-2025-53766, CVE-50171, and CVE-2025-53792, all of which have a severity score of 9.1 and higher, making them critical.\n\nIn total, 111 vulnerabilities were addressed by Microsoft, and although none are marked as being actively exploited in the wild, admins would be wise to apply the fix without delay.\n\nYou might also like\n• Microsoft patches three worrying security flaws in its latest critical update, so update now\n• Take a look at our guide to the best authenticator app\n• We've rounded up the best password managers",
  "medium": "Article",
  "links": [
    "https://www.techradar.com/pro/security/trend-micro-patches-several-worrying-security-flaws-so-update-now",
    "https://www.techradar.com/best/password-manager",
    "https://www.techradar.com/pro/security/microsoft-patches-three-worrying-security-flaws-in-its-latest-critical-update-so-update-now",
    "https://www.techradar.com/best/best-malware-removal",
    "https://www.techradar.com/best/best-authenticator-apps",
    "https://www.techradar.com/tag/microsoft",
    "https://www.bleepingcomputer.com/news/microsoft/microsoft-august-2025-patch-tuesday-fixes-one-zero-day-107-flaws/",
    "https://www.techradar.com/pro/security/thousands-of-microsoft-exchange-servers-remain-unpatched-against-major-threat-heres-what-to-do-to-stay-safe",
    "https://www.techradar.com/pro/security/microsoft-releases-urgent-sharepoint-security-flaw-patches-heres-what-you-need-to-know-and-how-to-update"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "information disclosure flaws",
      "weight": 0.10505954
    },
    {
      "name": "Microsoft Graphics Component",
      "weight": 0.09036702
    },
    {
      "name": "Microsoft",
      "weight": 0.08471587
    },
    {
      "name": "unauthenticated threat actors",
      "weight": 0.07856771
    },
    {
      "name": "data exfiltration attacks",
      "weight": 0.07816928
    },
    {
      "name": "device takeover attacks",
      "weight": 0.07811102
    },
    {
      "name": "Windows Kerberos",
      "weight": 0.0779527
    },
    {
      "name": "attack",
      "weight": 0.06833826
    },
    {
      "name": "sensitive information",
      "weight": 0.06697537
    },
    {
      "name": "user identities",
      "weight": 0.06285914
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Technology News",
      "score": 0.96240234375
    },
    {
      "name": "/Computers & Electronics/Computer Security/Network Security",
      "score": 0.72998046875
    },
    {
      "name": "/Computers & Electronics/Software/Operating Systems",
      "score": 0.494140625
    },
    {
      "name": "/Computers & Electronics/Computer Security/Hacking & Cracking",
      "score": 0.431640625
    },
    {
      "name": "/Computers & Electronics/Computer Security/Other",
      "score": 0.3203125
    }
  ],
  "sentiment": {
    "positive": 0.07763147,
    "negative": 0.59472895,
    "neutral": 0.32763964
  },
  "summary": "Microsoft has released its August 2025 Patch Tuesday package, addressing over 100 vulnerabilities across its products. Among the most notable flaw was a zero-day vulnerability in Windows Kerberos, which allows an authorized threat actor to elevate privileges over a network. Other notable flaws included a critical flaw in Azure OpenAI, which could allow unauthenticated threat actors to remotely access sensitive information in AI environments. Despite not being actively exploited in the wild, users should apply the patch immediately.",
  "shortSummary": "Microsoft's latest patch addresses a serious zero-day vulnerability in Windows Kerberos, among others, including remote code execution and data exfiltration vulnerabilities.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "7ec05ae8aa20466eb02c4ea641ab3123",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.techradar.com/tag/microsoft",
      "text": "Microsoft\nLatest about Microsoft\nMicrosoft's latest major patch fixes a serious zero-day flaw, and a host of other issues - so update now\nBy Sead Fadilpašić published\nThe August 2025 Patch Tuesday release fixes a broad mix of vulnerabilities across different services.\nThe 24 best Xbox Game Pass games in 2025\nBy Jake Green last updated\nBuying Guide New to the service and wondering what the best Xbox Game Pass games are? Our curated list is here to help.\nBest Linux server distro of 2025\nBy Mayank Sharma last updated\nUpdated We list the best Linux server distros, to make it simple and easy to choose and manage the Linux distro that's most suited to your server needs.\nBest patch management software of 2025\nBy Mike Williams last updated\nUpdated We list the best patch management software, to make it simple and easy to maintain and schedule updates for applications on your PC or IT network.\nBest virtual machine software of 2025\nBy Mark Pickavance last updated\nUpdated We list the best virtual machine software, to make it simple and easy to setup and run a new OS virtually on an existing PC or laptop.\nBest Android box of 2025\nBy Stefan Ionescu last updated\nBuying Guide We compared the top Android boxes you can get right now.\nThousands of Microsoft Exchange servers remain unpatched against major threat - here's what to do to stay safe\nBy Sead Fadilpašić published\nImproper authentication bug found in Microsoft Exchange hybrid environments that could grant threat actors lateral movement across the network.\nThe 26 best Xbox Series X games to play in 2025\nBy Jake Green last updated\nBuying Guide Here you'll find our picks of the best Xbox Series X games across genres to enjoy current-gen gaming to the fullest.\nSign up for breaking news, reviews, opinion, top tech deals, and more."
    },
    {
      "url": "https://www.techradar.com/best/best-authenticator-apps",
      "text": "Best Authenticator App for 2025: Features and Security Reviewed and Compared\nAdd an extra layer of online security with the best authenticator app\nAuthenticator apps are security tools that enhance the security of your online accounts. They work by enabling two-factor authentication (2FA) or multi-factor authentication (MFA), which adds an extra layer of verification beyond just a username and password. Since passwords alone can be easily stolen, guessed, or leaked in data breaches, authenticator apps help ensure that even if someone has your login credentials, they still can’t access your account without a second form of authentication.\nAuthenticator apps typically work by generating time-based one-time passwords (TOTPs), which are unique codes that refresh every 30 seconds. When you log in to an account protected by 2FA, you'll be prompted to enter the current code displayed in your authenticator app. Because the code changes constantly and is tied to your device, it’s virtually impossible for a hacker to guess. In some cases, authenticator apps can also send push notifications that you simply approve to confirm your identity.\nMany authenticator apps go a step further by offering biometric verification, such as fingerprint or facial recognition, to open the app or to approve a login request. This adds another layer of protection, ensuring that even if someone has access to your device, they still can’t bypass authentication without your physical presence. Overall, authenticator apps provide a simple yet powerful way to safeguard your digital identity and reduce the risk of account takeovers.\nOur security experts have been testing and evaluating authenticator apps for years, looking at how each one verifies your identity, its compatibility across devices and platforms, adherence to security and compliance standards, overall usability, and the range of additional security features it offers.\nWe've also listed the best security keys and the best password managers.\nReader Offer: Save 61% on NordPass for Business\nNordPass provides an easy-to-use and highly secure solution that most businesses will love, according to Techradar editors. Plans start at less than $1.79 per user per month - plus get 3 months extra.\nPreferred partner (What does this mean?)\nThe best authenticator apps of 2025 in full:\nWhy you can trust TechRadar\nBest authenticator app overall\n1. Authenticator App by 2Stable\nOur expert review:\nReasons to buy\nReasons to avoid\nThe Authenticator App by 2Stable delivers a robust suite of features for users who value both privacy and convenience.\nOne area where the app excels is in secure cloud sync, which works through iCloud. This helps sync your 2FA codes across your iPhone, iPad, Mac, and even your Apple Watch. For users embedded in the Apple ecosystem, this significantly enhances the user experience. It also includes biometric authentication features adding yet another layer of protection.\nWe also like the app’s backup and restore functionality that stores 2FA tokens in an encrypted format, which helps reduce the risk of being locked out if you change or lose your device.\nOther thoughtful touches include Apple Watch support, widgets for quick access, multiple import options, the ability to use the app without creating an account, and a lot more.\nThe app’s biggest limitation is that it isn’t available on Android devices, though the developers claim this is in the works. The $50 annual price tag could be another hindrance for many, though the app offers a feature-restricted free version that can manage two accounts.\nAll things considered, 2Stable’s Authenticator app is best suited for users who view security and convenience as equally important, and don’t mind paying a premium for both.\nBest authenticator app for security\nReasons to buy\nReasons to avoid\nDeveloped by the makers of NordVPN, NordPass Authenticator benefits from the company’s established reputation in digital security. That said, NordPass Authenticator isn’t a general-purpose authenticator app. Instead the app is built for companies that already rely on NordPass Business for their password management needs.\nUsing NordPass Authenticator saves NordPass Business users the effort to copy codes from a separate app, as it allows all your employees to generate and use TOTP codes directly within the NordPass Business vault. This simplifies the login process for enterprise users and reduces friction in daily workflows.\nAlso, because it’s part of the NordPass Business infrastructure, admins can enforce policies around 2FA usage, monitor access logs, and maintain visibility into how 2FA is being used within your organization. That level of control simply doesn’t exist in standalone authenticator apps.\nOn the downside though, NordPass Authenticator lacks the robust backup and recovery features found in other authenticator apps. There’s no option for cloud backups, like you get with 2Stable’s authenticator app, nor the ability to restore your tokens on a new device. In the same vein, it also lacks any ability to sync tokens across multiple devices.\nNordPass Authenticator is bundled along with the NordPass Business product, plans for which start from $1.99/user/month when paid for a year, or $1.79/user/month when subscribed for two years.\nBest cross-platform authenticator app\n3. Authy\nOur expert review:\nReasons to buy\nReasons to avoid\nAuthy is a popular 2FA app that’s developed by Twilio. The app stands out for its ease of use and advanced features despite being available for free, and has a clean, responsive, and easy to navigate user interface.\nNot only does Authy support both Android and iOS, it also doesn’t restrict you to a single device. Thanks to its multi-device sync you can access your 2FA tokens across your smartphones, and tablets.\nAlso, unlike many other apps in the genre, Authy offers more than just basic 2FA functionality. One of its most popular features is the encrypted cloud backup system. This helps you access your 2FA token even if you lose or replace your phone. You can also lock Authy behind a PIN, fingerprint, or facial recognition, which adds an extra layer of protection.\nYet, despite its strong feature set, Authy isn't without drawbacks. For starters, your Authy account is tied to your phone number. This makes you vulnerable to SIM swap attacks and also means you’re sharing personal information with Twilio.\nAlso, once you’ve set up 2FA tokens in Authy, moving them to another app isn't straightforward as there’s no mechanism to export your data. So, if you ever want to switch to another authenticator, you’ll have to laboriously first disable 2FA on each of your online accounts and then re-enable it using the new authenticator app.\nBest authenticator app for ease of use\n4. Google Authenticator\nOur expert review:\nReasons to buy\nReasons to avoid\nMany folks have a love/hate relationship with Google and if you're in the latter category, you probably want to move on to the next option on this list. For everyone else, say hello to the easiest and most basic authenticator app on the planet.\nGoogle Authenticator has been around for over a decade, is free, and will work with virtually every service that supports TOTPs. The app is as streamlined as it gets. There are no bloated menus, and you don’t need to set up an account to use the app.\nFor a long time that was the extent of Google Authenticator’s capabilities. But the app has received significant updates in 2025. The biggest news for Google Authenticator users is the introduction of cloud syncing. You can now backup your codes to your Google account and sync it across all your devices, whether they're Android phones, iPhones, or iPads, as long as they are logged into the same Google account. The app now also has a Privacy Screen feature, which helps protect access with your device's screen lock, PIN, or fingerprint, and facial recognition.\nDespite the improvements, there are a few areas where it lags behind some of its peers. For instance, while there is a search facility to find specific accounts, you don’t get any organization features that you get with some other apps like Authy. Also, Google Authenticator remains a mobile-only app, and while it does work on iOS devices as well, unlike Duo Mobile, it can only backup and sync to a Google account.\nBest authenticator app for enterprise\n5. Duo Mobile\nOur expert review:\nReasons to buy\nReasons to avoid\nDeveloped by Cisco, Duo Mobile is best known for its use in corporate environments. Duo Mobile does more than just generate time-based TOTPs. It's built to work as part of a broader identity and access management system, but many of its core features make it a solid 2FA app even for personal use, especially since it’s available for free.\nDuo Mobile works on Apple and Android phones, and tablets, as well as on smart watches. The app has a straightforward interface that makes it easy to manage multiple accounts.\nOne of the standout features of Duo Mobile is push-based approval. Instead of typing in a 6-digit code, supported services can send you a push notification on your phone when trying to log in. Simply tap \"Approve\" and you're in. It’s fast, intuitive, and eliminates the need to manually input codes.\nThat said, the app also supports standard TOTP codes, so you can still use Duo Mobile to generate codes just like you would with other authenticator apps. The app also supports account recovery through secure cloud backups, via iCloud on iOS and Google Drive on Android.\nBut while you can back up and restore accounts, you can’t actively sync the codes between devices like you can with Authy or 2Stable’s Authenticator app. Similarly, Duo Mobile is a mobile-only app. So if you're looking to access your 2FA tokens from a computer or browser, you'll need to look elsewhere.\nBest authenticator app for LastPass users\n6. LastPass Authenticator\nOur expert review:\nReasons to buy\nReasons to avoid\nLastPass Authenticator is a good enough 2FA app, but it works best as an add-on for LastPass password manager users, rather than as a top-tier general-purpose authenticator on its own.\nThe app has a clean, user-friendly interface, and the process to add, remove, and view tokens is pretty straightforward. Like most 2FA apps, LastPass Authenticator works with virtually any online service that supports TOTPs. The app also scores for supporting fingerprint, and PIN protections, which helps keep your tokens secure if someone gets access to your unlocked phone.\nThat said, while it works as a general 2FA app, many of its interesting features are tied to your LastPass account.\nFor instance, unlike some of its peers, like Authy, which allows real-time sync across multiple devices, LastPass Authenticator only backs up and restores tokens through your LastPass account.\nIt also supports push notification for login approval, but again only when paired with the LastPass password manager. While it works on both Android and iOS, the app is strictly mobile-only, and doesn’t have a desktop or browser extension.\nAll things considered, while LastPass Authenticator is functional as a standalone 2FA app, it doesn’t offer much for non-LastPass users.\nBest authenticator app for Microsoft users\n7. Microsoft Authenticator\nOur expert review:\nReasons to buy\nReasons to avoid\nMicrosoft Authenticator is a good authenticator app, but it's primarily designed with Microsoft account users in mind. The app is available for both Android and iOS, works with any service that supports 2FA, and is fairly intuitive to use. It also offers a search function to sort through your 2FA accounts, which is helpful if you’ve enabled it for several services.\nThe app also by default locks itself behind the device’s biometric and PIN to add an extra layer of protection if someone gets access to your phone.\nAnd that’s the extent of its non-Microsoft account linked features. The app offers an encrypted cloud backup of your 2FA tokens, but this is linked to your Microsoft Account, or iCloud for iOS users.\nAlso, if you use Microsoft services, you’ll benefit from push-based logins that you can approve with a tap. Like many of its peers, Microsoft Authenticator too is a mobile-only app.\nFor a long time, Microsoft Authenticator has offered password autofill and even some basic password management functions. However, as of August 2025, these features are being deprecated to make the app a streamlined authenticator app, which further limits its appeal to non-Microsoft account users.\nBest authenticator app for Apple users\n8. Step Two\nOur expert review:\nReasons to buy\nReasons to avoid\nStep Two is a good authenticator app that’s designed specifically for the Apple ecosystem. While it’s not the most feature-rich authenticator out there, it offers a clean, distraction-free interface that works well across iPhone, iPad, Mac, and Apple Watch. If you regularly use multiple Apple devices, Step Two ensures your codes are available on all of them without any manual setup.\nTokens are automatically and securely synced via iCloud. This means your 2FA tokens are always backed up and restored across devices tied to your Apple ID cutting out the risk of losing access to them if you upgrade your phone.\nYou can use the app for free to manage up to 10 accounts/services. For a one-time purchase of $10, you can use Step Two to handle any number of accounts.\nThe biggest drawback of the app is that it is made exclusively for Apple platforms. This means that if you ever switch to Android, there's no way for you to transfer your tokens from Step Two.\nThe app also falls short of 2Stable’s authenticator app in terms of features. For starters, it only supports the Safari browser, unlike 2Stable’s that supports all the best web browsers.\nAuthenticator app FAQs\nHow to choose the best authenticator apps\nWhen deciding which authenticator app to use, first consider what your actual needs are, as sometimes free and budget software may only provide basic options, so if you need to use advanced tools you may find a paid platform is much more worthwhile. Additionally, higher-end software can really cater for every need, so do ensure you have a good idea of which features you think you may require from your authenticator app.\nHow do authenticator apps work?\nWithout fail, one of the easiest ways to begin using 2FA is by using your smartphone's camera and scanning a QR code provided by the company or website. Once you do, the authentication app gets to work by issuing an ever-changing unique code. That code is valid as the second form of identification for just a few seconds before the authentication app refreshes it.\nYou only have to scan the QR code once on a device. If you're using sync and backup (like many of the apps below), you probably won't have to scan a QR code during setup on another device. Otherwise, you will.\nThe codes are generated using a standard HMAC-Based One-Time Password (HOTP) algorithm developed by the Internet Engineering Task Force (IETF). However, at no time does the IETF gain access to the codes.\nIs 2FA all the protection we need?\nWhen 2FA options first arrived, many thought online vulnerability would finally end in the tech world. But, unfortunately, that isn't the case. 2FA, like every other form of online security, isn't 100% secure. Try as they might, a hacker or two will figure out a way to gain access to something they shouldn't. In January 2022, for example, Crypto.com was attacked. Nearly 500 accounts were compromised, and the thieves made off with more than $31 million in cryptocurrencies.\nDespite its imperfections, 2FA still provides better protection than passwords alone.\nHow we tested the best authenticator apps\nTo test for the best authenticator apps we first set up an account with the relevant platform. We then tested the service to see how the software could be used for different purposes and in different situations. The aim was to push each authenticator app to see how useful its basic tools were and also how easy it was to get to grips with any more advanced tools.\nRead how we test, rate, and review products on TechRadar.\nGet in touch\n- Want to find out about commercial or marketing opportunities? Click here\n- Out of date info, errors, complaints or broken links? Give us a nudge\n- Got a suggestion for a product or service provider? Message us directly\n- You've reached the end of the page. Jump back up to the top ^\nSign up to the TechRadar Pro newsletter to get all the top news, opinion, features and guidance your business needs to succeed!\nBenedict has been writing about security issues for over 7 years, first focusing on geopolitics and international relations while at the University of Buckingham. During this time he studied BA Politics with Journalism, for which he received a second-class honours (upper division), then continuing his studies at a postgraduate level, achieving a distinction in MA Security, Intelligence and Diplomacy. Upon joining TechRadar Pro as a Staff Writer, Benedict transitioned his focus towards cybersecurity, exploring state-sponsored threat actors, malware, social engineering, and national security. Benedict is also an expert on B2B security products, including firewalls, antivirus, endpoint security, and password management."
    },
    {
      "url": "https://www.techradar.com/best/password-manager",
      "text": "Best password manager of 2025: reviewed, rated, and ranked by the experts\nLooking to keep all your passwords in one super secure location? This is the guide for you\nPassword managers are used to store, automatically fill, and generate secure and unique passwords to help keep all your online accounts from being broken in to.\nMy team of experts have been testing the best password managers for over 11 years, and in that time have racked up over 5000 hours in testing. I also frequently write about new updates and product changes made to password managers.\nNordPass remains the best password manager for the vast majority of people, offering a very easy to use app that is highly secure. Dashlane and Roboform also offer great password manager apps.\nI also have guides to the best free password managers, the best password managers for families, and the best business password manager - but before you check out those guides, here are my top recommendations for the best password manager overall:\nReader Offer: Save 52% on NordPass Premium\nNordPass provides an accessible, competent, easy-to-use solution that most people will love, according to TechRadar editors. Save 52% on NordPass Premium plus 1 month extra with code TECHRADARPASS.\nPreferred partner (What does this mean?)\nBenedict has spent over 7 years writing about security issues, covering everything from major data breaches and cyber attacks, to the malware and credentials thefts that threaten livelihoods and personal security. He has a passion for security products that keep people safe, and the knowledge to help them make the right decision.\nBest Password Manager Quick List\nBest overall\nBest password manager overall\nThis feature-packed password manager has just about everything you could hope for, and is great for all users - individual, business, enterprise. The free tier is lacking somewhat, but the prices for the premium plans represent good value considering what you get.\nBest for security\nBest password manager for security\nAnother popular and well-loved password manager, Dashlane is keen to pitch its strong security credentials as a leading feature. While all the managers here have a good reputation in this regard, Dashlane also prides itself on its easy to use interface, so it isn't a chore to navigate.\nBest for mobile\nBest password manager for mobile\nRoboForm works great on mobile (both Android and iPhone), and the free version includes cloud syncing, which is a nice bone to be thrown. Multi-device syncing is for paid users only, though, but prices are good.\nLoad the next 8 products ↓\nBest for mid-size\nBest password manager for mid-sized business\nA great choice for medium-sized businesses, Keeper has some features that admins would love, including a policy engine and organizational structures. Prices can escalate quickly with add-ons though.\nBest for free\nBest free password manager\nBitwarden’s free tier alone should cater to most users’ needs. Unless you’re a serious power user who requires some very advanced features, it is more than capable of storing all your passwords securely across all your devices - all without paying a penny.\nBest for enterprise\nBest password manager for enterprise\nThere’s no out-of-the-box plan with N-able Passportal - this manager is a bona-fide enterprise offering, tailored to your needs based on consultation. Despite its advanced features, we found its user interface intuitive.\nBest for familes\nBest password manager for families\n1Password works well for families and businesses, with its sharing functionalities and some great security features that protect users from phishing and keylogging attacks.\nBest for privacy\nBest password manager for privacy\nBest known for its secure email service and VPN, Proton has now thrown its hat into the password management ring, and acquitted itself very well thus far. Its lack of pedigree in this area may deter some users, though.\nBest passwordless\nBest passwordless password manager\nOne of the notable features of this manager is the option to log in without a master password - you can use your fingerprint, a QR code or even a selfie instead. The overall package from LogMeOnce isn’t bad either, making it a strong contender.\nBest for small business\nBest password manager for small business\nAs the name suggests, this is a solid password manager, but the price is high for what you get, and the lack of admin features makes this suitable only for small businesses. Individuals may look elsewhere.\nBest for Apple users\nBest password manager for Apple users\nA boon for Apple users, this password manager can integrate with iCloud and even has an app for Apple watch. Its sleek interface is right at home on the Cupertino giant’s pristine devices too.\nThe best password managers of 2025 in full:\nWhy you can trust TechRadar\nBest password manager overall\nSpecifications\nReasons to buy\nReasons to avoid\n✅ You want great performance: When we tested this manager, we found the performance and interface to be top in the class, making for a seamless and hassle-free experience throughout.\n✅ You want it on every platform: With apps for Windows, Mac, Linux, iOS and Android, as well as browser extensions for Chrome, Firefox, Edge, Opera, Brave, and Safari, NordPass can be used on just about anything you have.\n❌ You won’t use it much: NordPass might be overkill if you're a casual single user, as you might not make full use of its many additional features.\n🔒 NordPass is a great password manager option for many individuals, families, and organizations, thanks to its array of advanced features and professional interface. It might be a bit too much for the needs of some, though. ★★★★½\nThe vendors of one of the best VPN services around, NordVPN, have now made a password manager, and it’s of a similarly impeccable standard.\nUnlike some, NordPass offers a free tier which provides storage for an unlimited number of passwords able to be accessed anywhere. The one downside being that only one active session can be used at a time, meaning that if you are logged in on more than one device, you will have to sign one out.\nThe premium plan offers the same as the free tier, with password strength detection, credential leak monitoring, and trusted password sharing to sweeten the deal at $1.89 per month.\nThe family plan allows six users to access all of the features offered on the free and premium plan, with the two year commitment coming in at just $2.79 per month for the whole family.\nThere is 24/7 email support and an online help center too, which helps to sweeten the deal further. All things considered, we believe NordPass to be a very capable password manager that offers plenty of value for money. There are even NordPass promo codes to bring the cost down more.\nRead our full NordPass review.\nBest password manager for security\nSpecifications\nReasons to buy\nReasons to avoid\n✅ You want to prioritize security: With features like real-time phishing alerts, Dashlane is great for those who want to keep constant vigilance on their security posture.\n✅ You want to go with the crowd: Dashlane is one of the most popular password managers for business, and its reputation should be of reassurance.\n❌ You're on a budget: With all its premium features, Dashlane doesn't exactly come cheap, and its miserly free version only lets you use a single device.\n🔒 Dashlane is very close to its main rival NordPass, but it puts a bit more emphasis on security features. Its premium plans can be expensive, but it is one of the go-to choices for millions of users for a reason. ★★★★½\nDashlane has established itself as one of the most prominent password managers for businesses and individuals alike, and it wasn't hard for us to see why.\nWith the ability to store an unlimited amount of passwords and protect them with multi-factor authentication, we couldn't find any reason to doubt this password manager on the basis of its convenience and security offerings.\nSet up was easy, taking us no more than five minutes to get going. There were only a handful of steps, and the interface was laid out well, making it simple to navigate.\nOn top of this, there is also the option to store files in the manager - although the best cloud storage providers may be a better option if you require lots of safe and easily accessible storage. Dashlane premium also comes with a VPN, and although we found it perfectly serviceable, again you may want to consider using the best business VPN available if this is a top priority for your firm.\nThe only real downsides we found with this manager were the limited live chat hours and the cost of the lowest paid-for plan, which is one of the most expensive out there. And we think it's needed to get the most out of it, since the free tier is limited to only one device.\nBut we believe the price is justified considering the top-draw features on offer. There are also plenty of Dashlane promo codes to keep costs down too.\nRead our full Dashlane review.\nBest password manager for mobile\nSpecifications\nReasons to buy\nReasons to avoid\n✅ You want easy autofill: RoboForm has some great autofill capabilities, making it easy to complete login forms.\n✅ You want good value: RoboForm is very reasonably priced, but still has the top-end features you would expect of a premium manager.\n❌ You want free device syncing: Syncing your passwords between devices is one of the most basic functionalities all good password managers should have, but the free version of RoboForm omits this.\n🔒 RoboForm is a well-priced password manager that has great autofill functionality. Device syncing isn't available on the free version. ★★★★\nRoboForm is another competent password manager in our view, with extensions for major browsers and apps for iPhone and Android devices.\nThe setup was fairly straightforward, although we found the mobile apps did require us to create a few more authentication methods, such as PIN codes and biometrics, in addition to the standard master password.\nWe were impressed with the free version, which has a lot of features considering, such as the ability to store your vault in the cloud - which is usually reserved for paying password manager customers - or on your device only. We found that it can also check up on weak and reused passwords and has a password generator to fix them.\nWhat you don’t get, however, is the ability to sync your passwords across multiple devices - you’ll have to pay for that privilege, although we found the price of its premium tiers to be reasonable. These plans also offer secure password sharing, multi-factor authentication and round-the-clock support, which we are always pleased to see.\nRead our full Roboform review.\nBest password manager for mid-sized business\nSpecifications\nReasons to buy\nReasons to avoid\n✅ You want plenty of features: Keeper has a lot of features to get your hands on, making it a great choice for medium-sized teams.\n❌ You want everything included: With Keeper, you have to purchase add-ons separately to get all those great aforementioned features - and the prices mount up.\n❌ You want a free option: True to its premium stylings, there is no free version of Keeper, only a free trial for 30 days.\n🔒 Keeper is a great pick for businesses and has plenty of features available. However, you do have to pay extra for those add-ons, and there isn't a free tier. ★★★★½\nUnlike our previous entrants, there is no free version of Keeper, although there is a free 30-day trial should you wish to try it out with no commitment. But we found that the real selling point of this password manager is its feature set aimed at small to medium-sized businesses.\nThese include security auditing and flexible controls for organizations thanks to the Admin Console, which allows you to perform all sorts of management tasks. There are also additional modules you can purchase to extend Keeper to your firm’s needs.\nHowever, some of these require further payment to add on and they can be quite expensive for what they are.\nThere is also a family plan, that let us share files between members securely as well as message each other with encryption, providing us with a handy alternative to popular messenger apps such as WhatsApp.\nIn our testing, Keeper was simple to set up desktop and mobile devices. Businesses will also be pleased to know that there are various ways of getting multiple users over to the manager, such as via domain name auto-provisioning, SSO and API/SDK.\nRead our full Keeper Security review.\nBest free password manager\nSpecifications\nReasons to buy\nReasons to avoid\n✅ You don’t want to pay anything: There isn’t another password manager on the market that gives away so much without demanding any of your money.\n✅ You want open source software: Being open source means it can’t really get away with hiding any major flaws or inconvenient truths.\n❌ You value a slick interface above all else: Although its UI is perfectly usable, there are occasions where it isn't as seamless as we'd like.\n🔒 Bitwarden is absolutely stellar when it comes to value, giving away a very competent password manager with features that its rivals usually closet behind a paywall. Some minor UI issues are the only real drawbacks. ★★★★½\nThe first open source password manager to make an appearance on our list, Bitwarden offered us plenty of features, making it ideal for individuals and businesses alike, even for those who opt for its free tier. We had multi-device synchronization, optional self-hosting and unlimited password storage - all without paying a penny.\nBeing open source means that others can contribute to the app's development and view the process, giving users peace of mind that there'll be no way for the company to cover up any flaws.\n2FA is also available with the free tier, via email or an authenticator app. The premium tier, however, offers more 2FA options, such as physical security keys and integration with Duo Security, a specialist third party who can provide authentication via its mobile app, SMS message or phone call.\nPremium plans impressed us with their weak password and unsecured website detection, as well as business-focused features such as password sharing, fine-grained access control and user groups.\nDespite being open source, download and setup is still a breeze. The interface is clear enough (if a little basic) and there is even a command line option if you really want to get into it.\nThe desktop app is pretty basic, but Bitwarden is compatible with a whole host of browsers and platforms, including more obscure ones such as F-droid. In the end, it certainly gives its paid-for rivals a run for their money.\nRead our full Bitwarden review.\nBest password manager for enterprise\nSpecifications\nReasons to buy\nReasons to avoid\n✅ You're an enterprise: N-Able Passportal is made for large organizations, and offers tailored packages to suit your specific needs.\n✅ You want control: Being enterprise focused, Passportal also provides plenty of admin controls to manage employee use and security protocols.\n❌ You want an off-the-shelf product: There are no pre-packaged plans for Passportal or even prices listed on its website - you have to contact support for a quote based on your requirements.\n🔒 N-able Passportal is a seriously capable password manager built for enterprise use. It offers plenty of control and admin tools, but it does require consultation to get going. ★★★★½\nWhen it comes to the best business password managers, look no further than the manager formerly known as Solarwinds Passportal. With some seriously advanced features, administration control for large teams and high-level security possibilities, it’s one of the most powerful managers we've ever tested.\nIn addition, we also found it offered great customer support and had an easy to use interface. The rest of the company’s ecosystem was also at our disposal should we have needed it.\nThe main issue we have with N-Able Passportal is that you have to get a quote from their sales team if you are interested in purchasing it (there is no free option) as there is no off-the-shelf product to choose from or even a price guide to view on their website.\nBut if you need to lock your business down tight, no matter its size, in a reliable and intuitive way, then Passportal should at least make it into your shortlist of password managers.\nRead our full N-Able Passportal review.\nBest password manager for families\nSpecifications\nReasons to buy\nReasons to avoid\n✅ You're a family: 1Password is great for family use, thanks to its sharing features.\n✅ You want good security: 1Password has a lot of useful security features, such as keylogging and phishing protection.\n❌ You want a free password manager: 1Password is another manager that doesn't have any free options available.\n🔒 1Password is another popular choice among the third-party password managers, with a good track record and useful features for families and the security conscious. ★★★★\nAnother very popular choice for a lot of people, 1Password has a great service for families with its shared password functionality.\nThere are two consumer plans offered, one for personal use and another for families with up to five members. There are also business and enterprise plans.\nSetup was once again easy for us, and even gave us the option to create what it calls an Emergency Kit - which you’ll need if you ever have to recover your account if you forget your master password, for instance.\nWe like the fact that protection is provided against breaches, keylogging hacks and phishing attacks, and that we could only use 1Password in verified browsers. In fact, in our discussion with veteran security expert Roger Grimes, he singled out 1Password as the exemplar for highly secure password managers.\nWhile there is no free option, we think 1Password is a great choice for many, especially families.\nIt's worth seeing what 1Password promo codes are currently available for ways to save on your purchase.\nRead our full 1Password review.\nBest password manager for privacy\nSpecifications\nReasons to buy\nReasons to avoid\n✅ Privacy is a priority for you: Proton's track record in the online privacy market is second to none, and this focus has carried over into its new password manager as well.\n✅ You don't want to pay anything: Like Bitwarden, Proton Pass has a very well-rounded free version, although Bitwarden has the edge in terms of features and pedigree.\n❌ You want support on every platform: Proton Pass is currently lacking desktop apps for macOS and Linux, and Safari is missing an extension too.\n🔒 Proton Pass is a very competent password manager, with some great features, including email aliasing and a 2FA authenticator. Although it is relatively new to the field, the company's ethos and reputation are reasons to be positive about this one. ★★★★\nProton is perhaps best known for its secure mail and VPN services, but it has recently entered the password manager game, bringing along its trademark emphasis on privacy.\nThe interface of Proton Pass was something we found very appealing, staying true to its purple palette. It's neat and tidy, and was easy for us to navigate our way around.\nThere are extensions for Chrome, Edge and Firefox, as well as the privacy browser Brave, which is no surprise given the company's philosophy. But Safari misses out, as do desktop versions for macOS and Linux, although these are coming soon.\nWhile the free plan permits an unlimited number of devices, there are still various features that only paying customers on the Proton Pass Plus plan get. These include an integrated 2FA solution and vault sharing with up to 10 people. Proton Sentinel, which is specifically designed to prevent hackers taking over your account, is also for Plus members only.\nIf you want the ultimate package, though, then there is Proton Unlimited for €9.99 per month, which gives you access to the company's entire suite of products, including its email service, VPN and cloud storage solution.\nA very handy feature in Proton Pass is email aliasing - similar to what NordPass has. This means that when you sign up to services, you can keep your real address hidden to protect you from spam and potential scams. The free version allows users to create up to 10 aliases, whereas those on Proton Plus get an unlimited amount.\nDespite Proton's reputation in the privacy field, some users may be put off by the fact that Proton Pass isn't even a year old yet, so this is uncharted territory for the Swiss firm. However, given how well its other products perform, there's little reason to doubt its ability to produce a high-quality, secure password manager.\nAlthough it's still relatively new, we feel that Proton Pass has earned its place in our guide, as it continues to show signs of expansion and improvement.\nRead our full Proton Pass review.\nBest password manager for small business\nSpecifications\nReasons to buy\nReasons to avoid\n✅ You're a small business: With its good password sharing features, we think KeepSolid Passwarden would make a great choice for small teams.\n❌ You're not willing to spend: KeepSolid Passwarden is relatively expensive compared to the competition, so be warned.\n❌ You're larger than a small team: With a lack of admin features, centralized management and SSO, KeepSolid Passwarden wouldn't really be suitable for large businesses or enterprises.\n🔒 KeepSolid Passwarden offers all the features you could want from a password manager if you're an individual or small team, but if you're anything bigger, then this probably isn't for you. ★★★★\nWe found KeepSolid Passwarden to be a capable password manager that can be used by everyone, from single users to families and businesses.\nSetup was the usual affair, taking us just minutes to download and create an account. We also received a recovery key in the event we get locked out for losing our master password. The import wizard was also impressive, letting us move passwords from other popular managers, such as LastPass, Dashlane, and 1Password, or a CSV file.\nThe manager can sync across multiple devices, has two-factor authentication and can be used in small teams to allow for password sharing from a single vault. The primary problem we had with Passwarden is its expense, which might not be worth it for personal users who won't need all the features it has to offer, such as password sharing.\nWe also thought the lack of administrative features, such as centralized password management and single sign-on, was disappointing, making for a password manager that works well in small team environments, but not really suitable for use within larger organizations. For those, N-able Passportal or Keeper are better options.\nIf you are using a password manager as part of a small business, though, we think this could be a great option.\nRead our full KeepSolid Passwarden review.\nBest for Apple users\nSpecifications\nReasons to buy\nReasons to avoid\n✅ You're an Apple person: mSecure offers iCloud syncing, and even has an Apple Watch app, making it a great choice for Apple fans.\n❌ You want to a free option: mSecure is yet another service that has no free option available.\n🔒 mSecure would be a great password manager for Apple users, given its iCloud support and Apple Watch app. It also makes regular improvements to its service, based on what we've seen so far. ★★★★\nmSecure comes with unlimited password storage and several different categories to save more than just passwords. There are also custom fields, useful when certain accounts require more than a password, such as an additional secret word, security question or PIN. In addition, you can also create groups for your passwords to better organize them.\nSetting up mSecure was quick and easy for us during our testing. Support for third-party devices and software was also something we welcomed. For instance, mSecure can sync with popular cloud storage providers Dropbox and Apple's own iCloud, and naturally has an app for Apple Watch too.\nThere are a few minor gripes we have with mSecure, though, including a lack of user support and no free option, but overall mSecure still remains affordable and capable enough for the majority of people.\nRead our full mSecure review.\nBest passwordless password manager\nSpecifications\nReasons to buy\nReasons to avoid\n✅ You don't want a master password: LogMeOnce lets you do away with a master password and instead just use your fingerprint, PIN, a QR code, or even a selfie.\n❌ You want it on alternative browsers: Browser extensions are only available for Chrome, Safari and Edge, so Firefox and other users may want to look elsewhere.\n🔒 LogMeOnce is a competent password manager that offers convenience in the form of passwordless access to your vault. Its lack of support for browsers outside the mainstream is the only real negative. ★★★★½\nAs well as offering features such as cross-platform and unlimited device support, even with its free tier, what set this password manager apart for us was the lack of a master password requirement. Instead, we could log in using facial recognition via Apple’s Face ID or even a selfie, as well as our fingerprint or PIN number.\nWhat’s more, we could choose to lock away certain passwords with one of these different methods, thus applying different levels of security and convenience to each of our credentials.\nAdditional security features include the ability to encrypt and store passwords online to make accessibility easier. Single Sign-On (SSO) is also available as with other password managers, which allows secure authentication for third-party applications.\nWe mark this manager down, though, for only having extensions for four browsers - namely Chrome, Safari, Edge and Internet Explorer (although the latter is no longer supported by Microsoft and we do not recommend you continue using it).\nIf you want greater browser extension support, then Bitwarden is an ideal choice, as it is compatible with many mainstream and alternative, privacy-focused browsers.\nRead our full LogMeOnce review.\nDésiré has been musing and writing about technology during a career spanning four decades. He's experienced in VPN, password managers and security and started narrating about the impact of technology on society just before the start of the Y2K hysteria at the turn of the last millennium.\nWe've also featured the best password recovery software.\nTested by\nMike Jennings has worked as a technology journalist for more than a decade. He worked as a staff writer at PC Pro magazine in London for seven years, and during that time wrote for other tech titles, such as Custom PC, Micro Mart and Computer Shopper.\nSince 2013, he’s been a freelance tech writer, and writes regularly for titles like Wired, TechRadar, Stuff, TechSpot, IT Pro, TrustedReviews and TechAdvisor. His coverage includes the latest password manager software.\nThe best password manager FAQs\nComparison table\n| Header Cell - Column 0 | NordPass | Dashlane | Bitwarden | Keeper | Logmeonce | N-able Passportal | Proton Pass | 1Password | KeepSolid Passwarden | RoboForm | mSecure |\n|---|---|---|---|---|---|---|---|---|---|---|---|\nFree tier | Yes | Yes | Yes | No | Yes | No | Yes | No | No | Yes | No |\nDevice limit | 6 | Unlimited | Unlimited | Unlimited | Unlimited | n/a | Unlimited | Unlimited | Unlimited | Unlimited (paid plan) | Unlimited |\nApps for | Windows, macOS, Linux, Android, iOS | Android, iOS, Apple Watch | Windows, macOS, Linux, Android, iOS, Apple Watch, F-Droid | Windows, macOS, Linux, Android, iOS, Apple Watch | Windows, macOS, Linux, Android, iOS | Android, iOS | Windows, Android, iOS | Windows, macOS, Linux, Android, iOS, Apple Watch | Windows, macOS, Android, iOS, Apple Watch | Windows, macOS, Linux, ChromeOS, Android, iOS | Windows, macOS, Android, iOS, Apple Watch |\nBrowser extensions | Chrome, Edge, Firefox, Safari, Opera, Brave | Chrome, Edge, Firefox, Safari | Chrome, Edge, Firefox, Safari, Opera, Brave, Vivaldi, Tor, DuckDuck Go for Mac | Chrome, Edge, Firefox, Safari, Opera, Brave | Chrome, Edge, Safari, Internet Explorer | Chrome, Edge, Firefox | Chrome, Edge, Firefox, Brave | Chrome, Edge, Firefox, Safari, Brave | Chrome, Edge, Firefox, Safari | Chrome, Edge, Firefox | Chrome, Edge, Firefox, Brave |\nWhy do we need password managers anyway?\nA lot of people still seem reluctant to use third-party password managers - at least according to our own survey of 1,000 people conducted last year, which found that over a quarter didn’t see the value in them. But the advantages of using one are quite clear.\nRather than being tied to the first-party managers offered by the likes of Apple and Google, using a standalone password manager means that you can access your credentials no matter what platform or device you are on.\nThey also give you the ability to organize your passwords how you like, by letting you create folders and grant different levels of access to certain items in your vault. Some come with additional tools, like a VPN in some cases, too.\nHow does a password manager work?\nA Password manager is a very simple and easy to use utility that requires minimal user interaction, since most of its actions are automated. They will work across numerous platforms, and they should feature a browser extension for use on desktop computers, as well as an app for smart devices such as your mobile phone. The passwords you use on each platform will synchronize across all the devices you use the password manager with.\nOnce you set up your password manager, you can go ahead and create whatever digital accounts you want. They will usually throw up a prompt to create a strong password for you when doing so - this is the password generation feature of the manager. Once you accept, it will then store the password and username for you in its vault, so when you next go to log in, you should find your credentials already filled out for you.\nIf you ever want to change or update your password for an existing account, you can do this too. Again, a prompt will usually appear from the password manager, confirming whether you want to overwrite the existing password with the new one you have created, ensuring your password manager remains up to date. Some password managers even have a version history, so you can see the previous passwords you have used.\nAs for importing your existing passwords stored on another manager, this should be a fairly straightforward process. Many managers will give you the option to import and export your passwords as a csv file, or any one that can be opened with spreadsheet software like Microsoft Excel or Google Sheets. This allows you to export them out from your old manager and import them into your new one.\nIf you have your passwords stored manually in a spreadsheet, you can also import that into your new manager too, providing you follow the correct formatting for the manager in question.\nWhat are the most secure password managers?\nUnderstandably, this is one of the most important questions to ask of a password manager. You would expect any password manager worth its salt would be secure as a given, but no one is perfect and some have had issues. LastPass, for instance, although a very reputable and popular choice, did suffer a security breach, and although the company reassured users that no passwords were accessible, it is still a cause for concern.\nThe managers offered by big tech companies, mainly Google and Apple, are generally very secure, as you might expect. Not only do they have the pockets deep enough to maintain the best protection possible, it would also be a huge PR disaster should they incur any major breaches, and companies of that size have an awful lot to lose.\nHow safe are password managers?\nAll the best password managers are very safe, using the best encryption methods to store your passwords securely.\nZero-knowledge architecture is one of the core principles for managers to keep your passwords as safe as possible. This means that no one but the user has access to the passwords contained in the encrypted vault. Even the vendor and providers of the cloud backup service for your passwords are unable to see what your passwords actually are - only you have the power to decrypt your stored passwords, using your master password, or biometric data if you have this set up on supported password managers.\nComplex algorithms are used to encrypt passwords, and there are different methods. Some managers, such as NordPass, use something called XChaCha20, which is military grade and considered to be at the cutting edge of current encryption technology. It is also favored by big tech companies like Google, and is faster than more traditional methods such as AES-256.\nAlso, NordPass claims that such methods may be crackable with new technologies - for instance, quantum computing could put traditional methods of encryption at risk - but it believes XChaCha20 is resistant to these dangers.\nAll good password managers will also allow for biometric login and feature multi-factor authentication, two aspects which most people will be familiar with by now. The former involves technologies that recognize the physical aspects of the user, such as fingerprint scanners and facial recognition cameras, to authenticate them as the legitimate user.\nMulti-factor authentication is an added layer of security on top of your password to make sure that it’s actually you who has entered your password on a given site or service, usually by sending a text message code on your phone that you have to input to make sure it is you. There are also separate authenticator apps you can have on your phone that give you a code to authenticate your login instead, if you’d rather not receive an SMS code.\nAnd as with any piece of digital tech, how it is used by an individual or business goes a long way in determining how secure it remains. At the very least, make sure you are accessing your manager on a secure and protected network - always be cautious when using them in spaces with public wifi - and make sure you're using the best malware removal tools and the best antivirus software for your system.\nSmartphones are generally very secure in this regard, although you should always be careful when downloading apps to make sure they are trustworthy - the Google Play store, for instance, has had its fair share of malicious apps doing the rounds recently.\nAlso, if you are using a master password to secure your password vault, then make sure it is a strong one. This will be one that you will have to remember yourself, so a long and complex string of various random characters will probably be out of the question.\nCurrent expert advice suggests that for passwords you choose yourself, a string of three random words together is quite strong, as it will be hard to guess and easy to remember for yourself. Whatever you use, just make sure to avoid ones that are easy to crack, like your mother’s maiden name, your birthday, or ‘password1234’.\nCan a password manager be hacked?\nIn a word: yes - in the sense that virtually any computer system can be hacked in theory. But the password managers in our list have a great safety record and utilize industry-standard encryption methods to protect your most valuable of assets. If we ever catch wind of any compromises to their security posture, we’ll be sure to let you know straight away.\nOf course, many of you will probably be aware by now of the breach suffered by LastPass, one of the most popular password managers around, where users’ password vaults were stolen. The company did assure them that they remained encrypted, so unless the hackers also guessed their master passwords too, they should remain safe. However, other personal data that were stolen, including names, payment information and the addresses of their IP, email and physical location, were not encrypted. For these reasons, LastPass no longer makes it onto our list of the best password managers.\nSpeaking of encryption, all good managers will use the strongest methods available when storing user passwords in their databases, which are extremely difficult to crack without the digital keys needed to unlock them. So the question then becomes can a hacker obtain these keys? In the case of LastPass, its subsidiary, GoTo, recently announced the encryption keys for its users’ accounts were stolen in the same attack that affected the password manager, but it is yet to confirm whether the same is true for its service.\nLastPass isn’t the only password manager to succumb to a breach, however. Many Norton LifeLock users had their accounts hacked in late 2022 via a credential stuffing attack, with the company warning them that unwarranted access to the suite’s password manager may have occurred.\nPasswordstate also saw its users fall victim to a devious fake software update that stole their stored passwords. Unsurprisingly, none of these password managers made it onto our list.\nShould you use your browser to manage your passwords?\nIt of course makes sense from a convenience perspective to use your browser’s integrated password manager, such as that in Google Chrome. And although it is a perfectly solid choice, there are various reasons why you may want a dedicated password manager instead or in addition to your browser’s.\nFirstly, your browser’s password manager will likely not work with other devices quite so easily.\nIf you use Google Chrome on a desktop and have an iPhone, then passwords associated with apps will not be saved to the manager in Chrome - by default they will be saved to Apple’s own password manager, Keychain. Keychain and Chrome password managers will not sync together, and there is no browser extension for Keychain that will work on Chrome. Therefore, you will be running two managers concurrently, one used for mobile app passwords, and the other for website passwords. If you have an account for a service that has both a website and an app, then they will be saved to both managers separately.\nAs you can imagine, things can start to get messy and disorganized fast. The solution would be to have a dedicated, third-party manager like those on this list, so they can centralize and sync all your passwords for both websites and apps across all your devices. They will usually have an app for mobile and for desktop, as well as an integrated extension compatible with most common web browsers, so no matter what platform you’re on, you’ll always have access to your passwords.\nSecondly, dedicated password managers often come with a lot more useful extras. For instance, a small but useful feature of many password managers is the ability to give a nickname to your account passwords, so you can locate them easily. Sometimes, you will find that searching for your account credentials by username or by the URL that the account is stored on may not yield the results you're looking for.\nWhere to find the password manager on Chrome\nGoogle Chrome is the most popular web browser in the world right now, so there’s a good chance you're using its integrated password manager already.\nOn desktop platforms, you’ll find it under settings - autofill - password manager. You can see all your passwords here, and search for them via their username or the web page they are used on. It will also show you any passwords that have been compromised, based on known data breaches and leaks.\nThere is also the Google Password manager, which is the official password manager for Android, and has now taken over the integrated manager in Chrome as well. This means it now stores passwords you use on Android apps as well, not just website passwords.\nDo password managers work with apps?\nAll the best password managers will have an app associated with them, and will work on both Android and Apple iOS devices. This means that passwords you use for other apps will be able to be stored in your password manager and easily accessible on your device, allowing for instant login.\nThey will be cross-platform, so can be used across all your different devices, as well as having an extension you can download to allow them to work in popular browsers, such as Google Chrome and Apple's Safari.\nHowever, as many smart devices now have biometric login capabilities, such as using fingerprint scanners and facial recognition, a lot of apps will simply require this to log in instead, without the need to input a password every time. This biometric data is stored on the device itself, such as your iPhone or Android phone, so a password manager isn’t used in these cases.\nHowever, many password managers now support biometric data too, so you can save it to the manager as well.\nHow to choose the top password managers\nChoosing the best password manager comes down to your personal needs, and whether others will be using it in addition to yourself, such as your family or the rest of your business.\nThe top two on our list, NordPass and Dashlane, are arguably the best all-round password managers available, more than capable of servicing anyone from single users to large organizations. But if you don’t want to pay a penny for a password manager, then there’s only one choice in our view: Bitwarden.\nHere are some key considerations when choosing a password manager:\n1. Security: This is of course one of the most important aspects of any password manager. We have done our best to check every manager featured in this guide adheres to best practices in terms of securing your vault and personal data.\nThey will use industry standard encryption methods to ensure that no one knows what your passwords are. Some will also offer biometric login in addition to or instead of a master password, and many will also offer two-factor authentication (2FA) to help prevent hackers accessing your account if they somehow manage to steal your master password.\nMany are also starting to support passkeys as a way of logging in too, which are thought to be both easier and more secure than using a master password.\n2. Synchronization: Although many other vendors will offer free versions of their managers, be aware that oftentimes, some fairly basic features will be omitted, such as cross-platform synchronization and unlimited storage and devices. Bitwarden does include these, though.\n3. Compatibility: We’ve also indicated what platforms and browsers each manager is compatible with, which is another very important consideration when choosing a password manager. In fact, it is one of the main advantages of using a third-party password manager in the first place, since managers integrated with Apple, Google and Microsoft products will usually only work within their respective ecosystems.\nThe managers in this list, though, will work across at least some of them, since they will be compatible with Windows and Mac (and even Linux in some cases), as well as Android and iPhone.\nFor those who value the utmost privacy when online, you should look for a password manager that has a browser extension for specialist privacy browsers, like Brave. Again, we’ve done our best to inform you which browsers and platforms each manager works with.\n4. Price: When it comes to price, bear in mind that while many will show monthly costs, they will often bill you annually, so keep in mind that you will have to part with a larger sum rather than spreading the cost throughout the year.\nMost managers on the market today will charge anywhere from $10 to $60 a year for individual plans, with family plans being somewhat more expensive. Business plans, on the other hand, can be more costly, and some even offer tailor-made enterprise plans that will require consultation before getting a quote.\nHow we tested the best password managers\nWe tested close to 30 of the most prominent password managers around, and picked out the very best to feature in this guide. During our testing, we made sure to try them out on every platform possible, to make sure they offered a consistent experience across all manner of devices and browsers.\nWe spent a considerable amount of time with each password manager to ensure that there were no nasty surprises that wouldn't necessarily crop up during a brief run through. We also tried to use them in every kind of situation we could think of, again in an effort to reveal any shortcomings that may have otherwise gone unnoticed.\nThe last thing you want to do is to change your password manager after discovering major flaws or aspects that you personally can’t live with, so we do our best to be as thorough as possible and consider all the different types of users that will deploy password managers for their specific wants and needs.\nHowever, it is worth noting that good password managers usually offer easy ways to export your vault from one manager to another, so if you don’t personally like a manager after spending a lot of time with it, don’t feel you’re stuck; most vendors offer easy-to-follow guides on switching to their manager from others - they want to win your custom, after all.\nRead more on how we test, rate, and review products on TechRadar.\nGet in touch\n- Want to find out about commercial or marketing opportunities? Click here\n- Out of date info, errors, complaints or broken links? Give us a nudge\n- Got a suggestion for a product or service provider? Message us directly\n- You've reached the end of the page. Jump back up to the top ^\nSign up to the TechRadar Pro newsletter to get all the top news, opinion, features and guidance your business needs to succeed!\nBenedict has been writing about security issues for over 7 years, first focusing on geopolitics and international relations while at the University of Buckingham. During this time he studied BA Politics with Journalism, for which he received a second-class honours (upper division), then continuing his studies at a postgraduate level, achieving a distinction in MA Security, Intelligence and Diplomacy. Upon joining TechRadar Pro as a Staff Writer, Benedict transitioned his focus towards cybersecurity, exploring state-sponsored threat actors, malware, social engineering, and national security. Benedict is also an expert on B2B security products, including firewalls, antivirus, endpoint security, and password management."
    },
    {
      "url": "https://www.techradar.com/pro/security/microsoft-releases-urgent-sharepoint-security-flaw-patches-heres-what-you-need-to-know-and-how-to-update",
      "text": "Microsoft releases urgent SharePoint security flaw patches - here's what you need to know, and how to update\nPatches for a critical severity SharePoint bug are now available\n- While fixing exploited flaws, Microsoft may have also introduced new bugs\n- The issues affected multiple SharePoint on-prem variants\n- Hackers are already exploiting them in the wild, so users should patch now\nMicrosoft has released an urgent patch to fix a zero-day vulnerability affecting on-premises SharePoint servers.\nThe vulnerability is already being exploited in the wild, which is why users are urged to apply the patch immediately and secure their assets.\nThree Microsoft products were said to be affected: SharePoint Server Subscription Edition, SharePoint Server 2019, and SharePoint Server 2016. SharePoint Online (Microsoft 365) is not affected.\nHow to secure your endpoints\nThe vulnerability being addressed is described as a deserialization of untrusted data in on-premises Microsoft SharePoint Server, which allows an unauthorized attacker to execute code over a network. It is tracked as CVE-2025-53770, and carries a severity score of 9.8/10 (critical).\n“Microsoft is aware that an exploit for CVE-2025-53770 exists in the wild,” the National Vulnerability Database (NVD) said in its advisory.\nTo secure the endpoints, Microsoft recommends applying the July 2025 security updates immediately, as well as enabling Antimalware Scan Interface (AMSI) for SharePoint and making sure Defender Antivirus is deployed.\nAfter patching, or enabling AMSI, users should rotate their ASP.NET machine keys, deploy Microsoft Defender for Endpoint to detect post-exploitation activity, or upgrade to supported SharePoint versions, if needed.\nSign up to the TechRadar Pro newsletter to get all the top news, opinion, features and guidance your business needs to succeed!\nThe vulnerability was actually introduced while fixing a pair of bugs that were also being exploited in the wild. Tracked as CVE-2025-49706 and CVE-2025-49704, these two were fixed in July, but introduced two new flaws - CVE-2025-53770, and CVE-2025-53771, a 6.3/10 (medium) path traversal bug that allows spoofing over a network.\nThe new bugs were quickly spotted by threat actors, and abused in attacks since July 18, with at least 85 organizations apparently being hit, including several multi-nationals and government entities, such as a private university and a private energy operator in California, a federal government health organization, and a private fintech firm in New York.\nVia BleepingComputer\nYou might also like\n- Top satellite communications company Viasat was also hit by Salt Typhoon – which shows just how widespread this massive attack was\n- Take a look at our guide to the best authenticator app\n- We've rounded up the best password managers\nSead is a seasoned freelance journalist based in Sarajevo, Bosnia and Herzegovina. He writes about IT (cloud, IoT, 5G, VPN) and cybersecurity (ransomware, data breaches, laws and regulations). In his career, spanning more than a decade, he’s written for numerous media outlets, including Al Jazeera Balkans. He’s also held several modules on content writing for Represent Communications.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.techradar.com/pro/security/thousands-of-microsoft-exchange-servers-remain-unpatched-against-major-threat-heres-what-to-do-to-stay-safe",
      "text": "Thousands of Microsoft Exchange servers remain unpatched against major threat - here's what to do to stay safe\nAn improper authentication bug was found in hybrid environments\n- Microsoft sounded the alarm on a hybrid Exchange bug in early August 2025\n- However almost 30,000 instances remain vulnerable\n- Microsoft has advised users how to defend their endpoints, so patch now\nAlmost a week after Microsoft publicized finding and patching a dangerous, high-severity flaw in hybrid Exchange deployments, experts have warned thousands of endpoints remain vulnerable.\nThe Shadowserver Foundation, a nonprofit organization dedicated to empowering the cybersecurity community, claims 29,000 Exchange servers remain unpatched and exposed online, basically inviting threat actors to break in and cause trouble.\nMatters could be even worse as activity from on-prem Exchange doesn’t always generate logs associated with malicious behavior in Microsoft 365, which could result in cyberattacks not being spotted via cloud-based auditing.\nEscalating privileges\nMicrosoft has urged customers to be on high alert for an “improper authentication bug”, which could allow threat actors with admin access to an on-prem Exchange Server to escalate privileges into the connected Exchange Online environment due to trust flaws in shared service principal configurations.\nOf the affected servers, 7,200 are located in the United States, 6,700 are in Germany, and around 2,500 are in Russia.\nA hybrid Microsoft Exchange deployment combines on-premises Exchange servers with Exchange Online in Microsoft 365, allowing them to work together as one system. It lets organizations support seamless email, calendar, and contact sharing across both environments.\n\"In an Exchange hybrid deployment, an attacker who first gains administrative access to an on-premises Exchange server could potentially escalate privileges within the organization's connected cloud environment without leaving easily detectable and auditable trace,\" Microsoft said. Both Exchange Server 2016 and Exchange Server 2019 are affected, and so is Microsoft Exchange Server Subscription Edition.\nSign up to the TechRadar Pro newsletter to get all the top news, opinion, features and guidance your business needs to succeed!\nEven though there is no evidence of abuse in the wild yet, Microsoft has urged its customers to apply April 2025 hotfixes, transition to the dedicated Exchange Hybrid app, and reset the shared service principal’s credentials to mitigate the risk.\nVia BleepingComputer\nYou might also like\n- Microsoft urges users to be on alert following high-severity flaw in hybrid Exchange deployments\n- Take a look at our guide to the best authenticator app\n- We've rounded up the best password managers\nSead is a seasoned freelance journalist based in Sarajevo, Bosnia and Herzegovina. He writes about IT (cloud, IoT, 5G, VPN) and cybersecurity (ransomware, data breaches, laws and regulations). In his career, spanning more than a decade, he’s written for numerous media outlets, including Al Jazeera Balkans. He’s also held several modules on content writing for Represent Communications.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.techradar.com/pro/security/microsoft-patches-three-worrying-security-flaws-in-its-latest-critical-update-so-update-now",
      "text": "Microsoft patches three worrying security flaws in its latest critical update, so update now\nThis month's Microsoft Patch Tuesday is a big one\n- Microsoft released January 2025 Patch Tuesday cumulative update\n- It fixes more than 150 vulnerabilities, including three being actively abused in the wild\n- Other details about the flaws are not being disclosed at this time\nThe first Microsoft Patch Tuesday of 2025 is upon us, and it’s a big one, as the update patches 161 vulnerabilities found in various products, including three zero-day bugs that have been actively abused in the wild.\nThe three vulnerabilities are tracked as CVE-2025-21333, CVE-2025-21334, and CVE-2025-21335. All three have a severity score of 7.8 (high), and all are found in Windows Hyper-V NT Kernel Integration VSP.\n\"An attacker who successfully exploited this vulnerability could gain SYSTEM privileges,\" Microsoft said in the advisory for the flaws.\nAdded to CISA's KEV\nOther details are not known right now, as Microsoft gives users enough time to apply the patch without a swarm of hackers going after them. Therefore, we don’t know who the threat actors are, who the victims were, or how the attackers managed to compromise their targets’ IT infrastructure.\nHowever, in its write-up, The Hacker News says the trio are privilege escalation bugs, and, citing Satnam Narang, senior staff research engineer at Tenable, are thus “very likely used as part of post-compromise activity, where an attacker has already gained access to a target system by some other means.\"\nSince the vulnerabilities are being actively exploited in the wild, users are advised to apply the patch immediately. CISA has already added all three to its Known Exploited Vulnerabilities (KEV) catalog, giving federal agencies a deadline of February 4, to apply the patch.\nWhile these three flaws are arguably the most dangerous ones (since they’re being actively used), Microsoft also addressed 11 critical-severity bugs, as well. The remaining 149 are rated as important. Zero Day Initiative says this is the largest Patch Tuesday since 2017. Aside from Patch Tuesday, Microsoft also addressed Edge browser flaws in a separate patch, fixing seven vulnerabilities in the process.\nSign up to the TechRadar Pro newsletter to get all the top news, opinion, features and guidance your business needs to succeed!\nVia The Hacker News\nYou might also like\n- Chinese hackers are switching to new malware for government attacks\n- Here's a list of the best antivirus tools on offer\n- These are the best endpoint protection tools right now\nSead is a seasoned freelance journalist based in Sarajevo, Bosnia and Herzegovina. He writes about IT (cloud, IoT, 5G, VPN) and cybersecurity (ransomware, data breaches, laws and regulations). In his career, spanning more than a decade, he’s written for numerous media outlets, including Al Jazeera Balkans. He’s also held several modules on content writing for Represent Communications.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.techradar.com/best/best-malware-removal",
      "text": "The Best Malware Removal in 2025: Our Comprehensive Guide and Recommendations\nThe best malware removal for viruses and ransomware\nIf you're wondering how to get rid of any malware, you're in the right place. The best malware removal can help get rid of malicious files, trojans, ransomware and other viruses.\nHere at TechRadar Pro, my team of security experts have been testing the best malware removal software for several years, carefully considering the compatibility of each service, as well as malware detection rates, ease of use, extra features, and value for money.\nNot everyone has the budget for a premium service, so I have also tested and ranked some of the best free malware removal services to help you remove malicious files for free.\nTo keep your device secure in the future, it might be worth taking a look at my rankings of the best antivirus software and the best firewalls to stop trojans and malware in their tracks before they infect your device.\nMalware protection to stop attacks before they occur\nMalware can wreak havoc—eliminate it before it infiltrates your system. NordLayer’s Threat Protection delivers comprehensive defense with real-time scanning, DNS filtering, and Deep Packet Inspection. Prevent malware infections and keep your business running smoothly—now with a 22% discount.\nPreferred partner (What does this mean?)\nJuly 2025: In this update I have reviewed all of the features of each malware removal service, updated pricing and comparisons, and I have included some helpful additions to the best malware removal FAQs.\nBenedict has spent over 7 years writing about security issues, covering everything from major data breaches and cyber attacks, to the malware and credentials thefts that threaten livelihoods and personal security. Benedict updates and maintains a wide ranging collection of security guides on everything from Antivirus to ZTNA.\nThe Best Malware Removal of 2025 in Full:\nWhy you can trust TechRadar\nThe best malware removal overall\nReasons to buy\nReasons to avoid\nMalwarebytes is updated daily, so you can trust it to identify and remove new threats the minute they appear.\nThe first time you install Malwarebytes Anti-Malware, you’re given a 14-day trial of the premium edition, which includes preventative tools like real-time scanning and specific protection from ransomware. After two weeks, it reverts to the basic free version. This has to be activated manually, but is still a top-notch security tool. We recommend running it at least once a week to check for any nasties that you haven't noticed, or if you notice that your web browser has suddenly started acting strangely (likely a result of adware).\nThe app also includes the Browser Guard extension (for Chrome, Edge, Firefox, Safari) that protects you from phishing scams, blocks annoying ads, and tracker and more. It’ll also review the security settings of your operating system, and can check if credentials associated with your email address have been leaked as part of a known data breach.. Malwarebytes Premium starts at $7/year for the personal edition, and goes all the way up to $ 799.99/year for protecting 20 devices.\nMalwarebytes also offers AdwCleaner, which targets and removes annoying programs that hijack your browser by changing your homepage, resetting your default search engine, or adding unwanted toolbars. It’s also available for free, and along with Anti-Malware, is a great addition to your security toolkit.\nRead our full Malwarebytes Anti-Malware review.\nBest malware removal for detection rates\nReasons to buy\nReasons to avoid\nAvast offers one of the most competent internet protection suites out there. While the company is famous for providing free antivirus software, it's worth noting that this now comes bundled with an anti-malware feature that uses behavioral monitoring to spot rogue programs.\nWhat's even better is that not only are Avast's basic products free, but they are also available for mobile devices as well as for desktops, which makes Avast a particular ideal choice if you have multiple devices you need to check. The app can also optionally install the free Avast Secure Browser with built-in protection from online ads, phishing scams, and more.\nWhile the basic Avast service is second-to-none, the company also provides paid-for anti-malware software that includes things, such as fine-tuning your PC to run better, to anti-ransomware software and secure file shredding.\nFor business users, there are paid-for internet security options to cover a range of needs and options.\nFor home users, though, the Avast free antivirus should keep your PC very well protected, though do note you'll be periodically prompted to update for one of Avast's other services.\nBoth the Premium (phishing protection, and more) and Ultimate (VPN, and more) versions can protect up to 10 devices. They cost $69.48 the first year, following which Premium renews at $99.99/year and Ultimate at $139.99/year.\nRead our full Avast antivirus review.\nBest malware removal for money value\nReasons to buy\nReasons to avoid\nTrend Micro Antivirus+ Security is a very capable package that's easy to use with above average anti-spam and an effective ‘Folder Shield’ module to block ransomware. And, it seems to get better as time goes on.\nHow good is it exactly? The top testing labs all rate it highly for protection, even though there’s a bit of disagreement on the details. In particular, AV-Comparatives says it gives a high number of false positives, which could be a real nuisance. On the other hand, AV-Test reports high levels of accuracy and no issues with false positives at all.\nOur experiences with the product is that protection levels look similar to Bitdefender, false positives are only marginally higher, and the system itself doesn't slow down our system noticeably more than anything else.\nStandout features include ransomware protection, advanced AI learning, email scam safeguarding, and Pay Guard to protect financial transactions. It costs $19.95/year for one Windows computer. The app also includes a free browser extension (for Chrome, Edge, Firefox) that can block ads, protects against phishing attacks, and more.\nWe'd recommend running the trial for its full 30 days before you buy, then, to see if you notice any problems. But if you're unaffected, its high levels of detection and excellent bonus features make Trend Micro a good choice.\nRead our full Trend Micro Antivirus+ Security review.\nBest malware removal for ease of use\nReasons to buy\nReasons to avoid\nF-Secure Internet Security is a great collection of antivirus tools, and while it's a bit pricier than some of the other antivirus software on this best of list, the number of features you get certainly makes that high price tag worthwhile.\nWith F-Secure Internet Security, you get the brilliant antivirus software from F-Secure, alongside banking protection for safe online shopping, a password manager, an unlimited VPN, and a device finder that lets you track your lost Android or iOS device, and if needs be, remotely lock or wipe it as well.\nThe package typically receives maximum marks for protection from AV-Test, and generally scores highly with AV-Comparatives. They also say it can generate significantly more false positives than most of the competition, but how that affects you will vary depending on how you use your computer.\nThe interface is a major advantage, as it's extremely easy to use, lightweight, and for the most part, you can just leave the app to work alone looking after your PC. The program has minimal effect on your system performance, and if you do need to intervene, you can generally solve any issues in a couple of clicks.\nAvailable for Windows, Mac, iOS, and Android, F-Secure Internet Security remains an appealing package: fast, lightweight, and able to run alongside many other security tools without conflict. Standout features include banking protection, and ransomware protection.\nF-Secure Internet Security costs $49.99/year for one device, or $89.99 for two years. To protect three devices, you’ll need to pay $64.99/year, or $114.99 for two years. Similarly, for up to five devices, the app costs $69.99/year or $124.99 for two years. Helpfully, there’s a 30-day free trial to help you explore all the nooks and crannies of the app.\nRead our full F-Secure review.\nBest free malware removal\nBest free malware removal overall\nReasons to buy\nReasons to avoid\nBitdefender Antivirus Free Edition is a straightforward security tool that offers essential protection without the complexity or clutter of a full security suite. Designed primarily for Windows users, you can use the free edition to protect up to three devices.\nThe app is very user friendly as it has a minimalistic interface, and an efficient background scanning engine. In fact, simplicity is one of Bitdefender Free’s strengths. The interface is clean and the software requires little to no user intervention after installation. It scans files automatically, blocks suspicious activity in real time, and keeps out of the way unless a threat is detected.\nIn terms of malware protection, the free edition performs well since it shares the same core technology and signatures found in Bitdefender’s paid products, which is a definite plus.\nOn the downside, the free edition doesn’t have features, such as a firewall, a VPN, ransomware file recovery, secure browsing tools, and more, which are reserved for Bitdefender’s paid products.\nOverall, Bitdefender Antivirus Free Edition is a strong option for anyone who wants a set-it-and-forget-it style antivirus with solid malware protection and minimal hassle, backed by a trusted name in the antivirus market.\nRead our full Bitdefender Antivirus Free Edition review.\nBest free malware removal for feature variety\nReasons to buy\nReasons to avoid\nThe Avira Free Security Suite provides one of the most comprehensive free security packages available on the internet.\nAs well as providing the standard anti-virus protection, the Avira Free security suite also provides a software updater, as well as scanning your network for vulnerabilities and helps you fix them.\nThere are also safe browsing and safe shopping options, as well as a system optimizer to speed up your PC which is normally charged for in other packages.\nIf that's not enough, there's also a free VPN included for up to 500 MB per month, as well as a password manager (although we recommend using the best password manager for more advanced features) and privacy settings manager.\nHowever, you actually have a choice of which features you want to install. This is a great plus as while the Avira suite is generous some users may want to run one or more features through a different suite.\nThere is an upgrade option, of course, but this is priced toward installation across 5, or 25 devices, and involves such features such as removing the VPN limit.\nIf there's one negative, it's that there's no anti-ransomware protection, but aside from that the Avira Free Security Suite is a very generous package indeed.\nRead our full Avira antivirus review.\nBest free malware removal for configuration\nReasons to buy\nReasons to avoid\nBacked by Avast, AVG Antivirus Free blends strong malware detection with a sleek, approachable interface that caters well to non-technical users. The app provides real-time protection against viruses, and other forms of malware.\nScans are reasonably fast, and it offers several of these including deep scans, USB scans, and performance scans. The performance scan though mainly functions as a teaser for its paid cleanup tool as many of the fixes it suggests require upgrading.\nAVG also includes web and email protection. It blocks dangerous links in browsers, warns about unsafe websites, and scans incoming and outgoing emails for malware.\nThe paid-for Pro model has more security options - it has more robust download protection, offers data encryption and includes a firewall - but the free version offers decent protection for most PC users. Most importantly though since AVG and Avast share backend technology, choosing between them often comes down to personal preference.\nRead our full AVG Antivirus Free review.\nBest free malware removal for portability\nReasons to buy\nReasons to avoid\nMost security software tries to stop malware and spyware getting onto your system. Emsisoft Emergency Kit doesn't: it's the 911 call of security software, the app you use when your PC's been poked by something unpleasant.\nUnlike traditional antivirus programs that run continuously in the background, Emsisoft Emergency Kit is entirely portable. The installation process actually just uncompressed it to a folder, which can be either on the local disk, or a portable USB one. Then you run the scanner manually. This makes the app especially useful for cleaning computers that are already compromised or sluggish due to malware.\nThe interface is minimal and utilitarian, and provides Quick, Malware, and Custom scan options. Once a scan is complete, you can quarantine or delete the detected threats.\nHowever, because it lacks real-time protection, scheduled scans, or automatic updates, the Emergency Kit is not a replacement for a primary antivirus solution. It also requires users to manually update the malware definitions, which can be a limitation if you're using it offline.\nRead our full Emsisoft Emergency Kit review.\nBest free malware removal for ease of use\nReasons to buy\nReasons to avoid\nSpybot Search & Destroy Free Edition is a long-standing anti-malware tool that specializes in detecting spyware, adware, and other privacy-invasive threats. A popular option in the early 2000s, Spybot has since evolved to include broader protection tools, though its core functionality in the free version remains focused on manual detection and removal of malware.\nThe Free Edition of Spybot is intended as a supplement to your main antivirus program, rather than a complete security solution. It doesn’t offer real-time protection, automatic updates, or full antivirus capabilities. These capabilities are reserved for its paid versions.\nWhen you install the program for the first time, it asks you whether you want to manually adjust the settings or let the software automatically configure its settings. This flexibility is great for both beginners and experienced users.\nOne of its signature features, the Immunization module, modifies browser settings to prevent your system from accessing thousands of malicious or tracking websites.\nNote however that the last stable release of the app was back in 2021, and though there have been several incremental releases since, Spybot Search and Destroy isn’t as regularly updated as its peers.\nRead our full Spybot Search & Destroy review.\nWe've also reviewed the best photo storage and sharing sites and the best free backup software.\nHonorable mentions\nThere are many vendors offering solutions to keep cyberattackers at bay, so that means there are a plethora of malware removal services to choose from. With that in mind, we took a look at many more tools than the ones listed above.\nHere are a few other honorable mentions that we tested and are worth considering:\n- ZoneAlarm Anti-Ransomware: Malware comes in many forms and ransomware is one of the most devastating. ZoneAlarm Anti-Ransomware focuses on this particular problem, detecting and eliminating ransomware attacks. It was even able to restore some of our files affected by ransomware during the detection period.\n- Webroot SecureAnywhere AntiVirus: One of Webroot's major strengths is its size. It consumes hardly any system resources because it is primarily cloud-based. Webroot monitors unknown programs, virtualizes their actions so they can’t make permanent changes and decides based on that whether it's malware or not.\n- ESET NOD32: This may not be the cheapest malware removal tool on the market, nor the most user-friendly, but we did find that it delivered excellent detection results. It also works across multiple devices, with the Security Home Essential plan (starting at $59.99/year) allowing you to protect three devices per account.\n- Fortect: Although primarily a PC optimizer, Fortect also does a pretty good job at removing malware. It searches for and removes malware slowing your computer down and can even alert users if malware appears in newly downloaded files in real-time.\nBest malware removal FAQs\nWhat is malware removal?\nMalware refers to any software that is designed to disrupt the operations of your computer. It could cause many negative effects such as depriving you of access to information, leaking sensitive information to a third party, or causing your device to be unusable in its entirety.\nMalware removal is the process that scans your device to detect any malware and eliminate anyone that is found. There are specific software programs built for this process, and they make use of various processes to detect malware. Most software look for malware by checking for the signature of a known malware program on your device; the companies behind these tools have large databases of these signatures that their software runs checks against. The malware removal program scans all files on your device to detect the presence of any known signatures.\nLately, malware removal programs are also employing artificial intelligence and machine learning to fish out malware, especially the type that may get past the usual process.\nHow do I remove malware from my computer?\nThere are many guides for dealing with specific types of malware, so if you know what kind of specific malware you have, there are some handy guides on how to remove malware from your computer.\nThe easiest way, of course, is to use one of the services on our guide as they do all the hard work for you. If you're wondering how malware removal works, they often check a list of known malware variants and their likely hiding places within your system. When they conduct a scan, they will check all of the nooks and crannies that are the chosen habitats for even the most elusive of malware, and then place them in to quarantine to stop the infection.\nWhile hindsight is 20-20, the first line of defense for your device should be an antivirus service that can stop infections from happening. For example, they will warn you of malicious files hidden in downloads or email attachments.\nIs free malware removal good enough?\nFree malware removal is good for one time infections, however it is worth bearing in mind that if you've been infected once, it can always happen again. That's why having a malware removal service on hand is the best course of action. So is free malware removal worth it?\nEvery second spent trying to download another service to remove malware from your device is another potentially second spent by an attacker inside your files, photos, and personal information. Plus, paid services come with added features such as real-time scanning and protection to prevent an infection from happening in the first place.\nAnother bonus of premium malware removal services is that some will even scan your system for potentially unwanted programs that could be running in the background and slowing down your device without you knowing.\nWhat are the signs that my device is infected with malware?\nThere are several key signs that your device could be infected with malware.\nSome are fairly subtle, such as your device being slower than usual or your battery draining more quickly. Other signs that could indicate an infection include an abnormal level of data usage or the appearance of apps, browser extensions, or search engines that you don't remember installing.\nPrograms could be stuttering or crashing altogether or causing your device to overheat in normal use. You may also find than your usual security software is missing or disabled and you are locked out of your administrator account.\nThe best way to know for sure is to install a malware removal program and scanning for viruses.\nHow can I continue to keep my device secure after malware removal?\nAfter you have removed a virus, you are still just as susceptible to infection as you were before unless you use an antivirus program. There are numerous choices, such as the premium options we've ranked and reviewed in our guide to the best antivirus software, or the budget-friendly free antivirus.\nA device without any protection will be quickly infected again, as hackers use automated programs to distribute their viruses wherever they can.\nWhat does real-time scanning do?\nReal-time scanning checks common places that viruses could lurk to make sure no modifications or unwanted files have suddenly appeared.\nReal-time scanning will also check each of the files you download from the internet to check for malicious code or software hidden in otherwise legitimate downloads.\nOutside of real-time scanning, many malware removal tools and antivirus software will offer a 'deep scan' function that will check every single file on your device for malware.\nHow is malware removal different from antivirus software?\nMalware removal differs from antivirus software in several key ways.\nFirstly, malware removal is a tool most commonly used after a device has been infected to find the malicious file, isolate it, and remove it while restoring access to your device. Antivirus on the other hand is used to prevent infection in the first place.\nSecondly, malware removal sometimes doesn't offer scanning capabilities. Antivirus software will often check downloads and other online files for harmful software that could damage your device.\nFinally, malware removal is often a standalone tool, whereas antivirus software will often include a complete suite of security tools including a VPN, firewall, malware removal, antivirus, password manager, and parental control in one handy package.\nHow to choose the best malware removal tool for you\n| Header Cell - Column 0 | Paid or free? | Trial period | Compatibility |\n|---|---|---|---|\nMalwarebytes | Paid | 14 days | Windows, macOS, iOS, Android |\nAvast | Paid | 30 days | Windows, macOS, iOS, Android |\nTrend Micro Antivirus+ Security | Paid | 30 days | Windows, macOS, iOS, Android |\nF-Secure SAFE | Paid | 30 days | Windows, macOS, iOS, Android |\nBitdefender Antivirus Free | Free | N/A | Windows, macOS, iOS, Android |\nAvira Free Security | Free | N/A | Windows, macOS |\nAVG Antivirus Free | Free | N/A | Windows, macOS, iOS, Android |\nEmsisoft Emergency Kit | Free | N/A | Windows only |\nSpyBot Search & Destroy | Free | N/A | Windows only |\nOur key buying criteria\nBudget\nMalware removal tools come in different grades. Some are free while others cost money. Among the paid ones, some are more expensive than others. Ensure you pick one that suits your budget.\nFor example, if you’re a student with a tight budget, there are many free or affordable malware programs you can choose from. On the other hand, if you’re a corporate worker entitled to a considerable security budget, it’s wise to pick more expensive and sophisticated software. It’s even more important for the latter because you might be handling sensitive data that’s worth a lot to your employer; being infected by malware can cause considerable damage for corporate employees, so it’s worth it to invest in a good removal program.\nEffectiveness\nA good malware removal tool should be able to detect and remove threats on your device with speed and accuracy. We don’t advise this, but it’s possible to test the program by deliberately infecting an unused computer with malware and seeing how good it is at identifying it. You can load many malware samples and measure how quickly each program you’re testing identifies and removes the samples. Look out for important statistics like the number of files it caught and how well the program could recover a device after an infection. Another key metric is the CPU load of the software; does it consume considerable resources and slow down your computer?\nExtra Features\nMany malware removal programs include extra features to entice users. For example, some include a VPN service (virtual private network) that lets you surf the web privately and anonymously. You may also find a password manager to help you manage your online accounts or a tool that monitors the dark web for leaked credentials and reports back to you if your credentials have been compromised. Either way, it's preferable to choose a program that offers extra features than those that do not. This way, you may not have to pay separately for a VPN, password manager, etc.\nEase of Use\nIt's important for any cybersecurity program to be easy to use. Most users aren’t technical people, so you must not be tech-savvy to know how to navigate your way around the program. When testing a program, try to cover all its features and see if you found it easy to navigate. If not, the program could give you problems in the future. Bitdefender was the most user-friendly out of the programs we tested, and you’ll likely find it easy to use.\nCustomer Support\nThings can go wrong at any time, and you should be able to contact someone for help if that happens. A lot of cybersecurity programs have customer support teams that you can contact through email, telephone, and live chat. If you have the time, you can test multiple programs to measure their response times to support inquiries.\nNote that customer support is usually reserved for paid users which makes sense because support reps cost money to train and employ. If you’re a free user, you’ll likely only have access to FAQs, forums, and online communities for support, which can be also valuable.\nHow we test\nTo test for the best malware removal we first set up an account with the relevant software platform, whether as a download or as an online service.\nWe then tested the service to see how the software could be used for different purposes and in different situations. The aim was to push each platform to see how useful its basic tools were and also how easy it was to get to grips with any more advanced tools.\nWe also referenced how well each platform scored for malware detection, and also for false positives.\nRead how we test, rate, and review products on TechRadar.\nTested by\nMike is a lead security reviewer at Future, where he stress-tests VPNs, antivirus and more to find out which services are sure to keep you safe, and which are best avoided.\nGet in touch\n- Want to find out about commercial or marketing opportunities? Click here\n- Out of date info, errors, complaints or broken links? Give us a nudge\n- Got a suggestion for a product or service provider? Message us directly\n- You've reached the end of the page. Jump back up to the top ^\nBenedict has been writing about security issues for over 7 years, first focusing on geopolitics and international relations while at the University of Buckingham. During this time he studied BA Politics with Journalism, for which he received a second-class honours (upper division), then continuing his studies at a postgraduate level, achieving a distinction in MA Security, Intelligence and Diplomacy. Upon joining TechRadar Pro as a Staff Writer, Benedict transitioned his focus towards cybersecurity, exploring state-sponsored threat actors, malware, social engineering, and national security. Benedict is also an expert on B2B security products, including firewalls, antivirus, endpoint security, and password management.\n- Desire AthowManaging Editor, TechRadar Pro\n- Barclay Ballard\n- Brian Turner"
    },
    {
      "url": "https://www.techradar.com/pro/security/trend-micro-patches-several-worrying-security-flaws-so-update-now",
      "text": "Trend Micro patches several worrying security flaws, so update now\nHalf a dozen flaws across different Trend Micro products have been addressed\n- Trend Micro patches multiple high- and critical-severity flaws\n- The issues were found in Apex Central and Endpoint Encryption PolicyServer\n- There are no workarounds or mitigations\nTrend Micro has fixed a handful of critical-severity vulnerabilities it recently discovered in a pair of enterprise-level tools.\nIn security advisories, the company said it fixed six remote code execution, and authentication bypass vulnerabilities, in Apex Central and Endpoint Encryption (TMEE) PolicyServer products.\nApex Central is a web‑based centralized management console designed for IT and security teams in mid‑sized to enterprise organizations using Trend Micro’s security products across endpoints, servers, email, and network. Endpoint Encryption PolicyServer, on the other hand, is a central management server used to manage encryption policies across devices. Users can handle authentication, key management, real-time policy synchronization and auditing, and are allowed remote commands such as locking, resetting or wiping lost or stolen endpoints.\nNo evidence of abuse\nThe vulnerabilities fixed with the most recent patches are listed below:\nCVE-2025-49212\nCVE-2025-49213\nCVE-2025-49216\nCVE-2025-49217\nCVE-2025-49219\nCVE-2025-49212\nAll of these are deemed either high-severity, or critical. More details about them can be found on this link.\nWhile Trend Micro stresses there is no evidence of abuse in the wild, it still urges its users to apply the fixes and secure their premises as soon as possible.\nSign up to the TechRadar Pro newsletter to get all the top news, opinion, features and guidance your business needs to succeed!\nThere are no mitigations, or workarounds, and the only way to secure the endpoints is to bring TMEE to version 6.0.0.4013 (Patch 1 Update 6), and for Apex Central, to install the Patch B7007.\nJust because threat actors did not take advantage of the flaws yet, it doesn’t mean they won’t. Many hacking groups watch for newly-released patches to try and exploit the vulnerabilities, banking on the fact that many organizations don’t rush with installing the fixes.\nFor example, in March 2025, Trend Micro warned about a Windows zero-day vulnerability which has remained unpatched for eight years and has been exploited by 11 nation-state attackers, and countless financially motivated groups.\nVia BleepingComputer\nYou might also like\n- Microsoft Copilot targeted in first “zero-click” attack on an AI agent - what you need to know\n- Take a look at our guide to the best authenticator app\n- We've rounded up the best password managers\nSead is a seasoned freelance journalist based in Sarajevo, Bosnia and Herzegovina. He writes about IT (cloud, IoT, 5G, VPN) and cybersecurity (ransomware, data breaches, laws and regulations). In his career, spanning more than a decade, he’s written for numerous media outlets, including Al Jazeera Balkans. He’s also held several modules on content writing for Represent Communications.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.bleepingcomputer.com/news/microsoft/microsoft-august-2025-patch-tuesday-fixes-one-zero-day-107-flaws/",
      "text": "Today is Microsoft's August 2025 Patch Tuesday, which includes security updates for 107 flaws, including one publicly disclosed zero-day vulnerability in Windows Kerberos.\nThis Patch Tuesday also fixes thirteen \"Critical\" vulnerabilities, nine of which are remote code execution vulnerabilities, three are information disclosure, and one is elevation of privileges.\nThe number of bugs in each vulnerability category is listed below:\n- 44 Elevation of Privilege Vulnerabilities\n- 35 Remote Code Execution Vulnerabilities\n- 18 Information Disclosure Vulnerabilities\n- 4 Denial of Service Vulnerabilities\n- 9 Spoofing Vulnerabilities\nWhen BleepingComputer reports on the Patch Tuesday security updates, we only count those released on Patch Tuesday. Therefore, the number of flaws does not include Mariner, Azure, and Microsoft Edge bugs fixed earlier this month.\nTo learn more about the non-security updates released today, you can review our dedicated articles on the Windows 11 KB5063878 & KB5063875 cumulative updates and the Windows 10 KB5063709 cumulative update.\nOne publicly disclosed zero-day fixed\nThis month's Patch Tuesday fixes one publicly disclosed zero-day in Microsoft SQL Server. Microsoft classifies a zero-day flaw as publicly disclosed or actively exploited while no official fix is available.\nThe publicly disclosed zero-day is:\nCVE-2025-53779 - Windows Kerberos Elevation of Privilege Vulnerability\nMicrosoft fixes a flaw in Windows Kerberos that allows an authenticated attacker to gain domain administrator privileges.\n\"Relative path traversal in Windows Kerberos allows an authorized attacker to elevate privileges over a network,\" explains Microsoft.\nMicrosoft says that an attacker would need to have elevated access to the following dMSA attributes to exploit the flaw:\n- msds-groupMSAMembership: This attribute allows the user to utilize the dMSA.\n- msds-ManagedAccountPrecededByLink: The attacker needs write access to this attribute, which allows them to specify a user that the dMSA can act on behalf of.\nMicrosoft attributes the discovery of this flaw to Yuval Gordon of Akamai, who published a technical report on the flaw in May.\nRecent updates from other companies\nOther vendors who released updates or advisories in July 2025 include:\n- 7-Zip released a security update for a path traversal flaw that could lead to RCE.\n- Adobe released emergency updates for AEM Forms zero-days after PoCs were released.\n- Cisco released patches for WebEx and Identity Services Engine.\n- Fortinet released security updates today for multiple products, including FortiOS, FortiManager, FortiSandbox, and FortiProxy.\n- Google released security updates for Android that fix two actively exploited Qualcomm vulnerabilities.\n- Microsoft warned about a Microsoft Exchange flaw tracked as CVE-2025-53786 that could be used to hijack cloud environments.\n- Proton fixed a bug in its new Authenticator app for iOS that logged users' sensitive TOTP secrets in plaintext.\n- SAP released the July security updates for multiple products, including numerous vulnerabilities with a 9.9 rating.\n- Trend Micro released a \"fix tool\" for an actively exploited remote code execution vulnerability in Apex One. Full security updates will come at a later date.\n- WinRAR released a security update at the end of July for an actively exploited path traversal bug that could lead to remote code execution.\nThe August 2025 Patch Tuesday Security Updates\nBelow is the complete list of resolved vulnerabilities in the July 2025 Patch Tuesday updates.\nTo access the full description of each vulnerability and the systems it affects, you can view the full report here.\n| Tag | CVE ID | CVE Title | Severity |\n|---|---|---|---|\n| Azure File Sync | CVE-2025-53729 | Microsoft Azure File Sync Elevation of Privilege Vulnerability | Important |\n| Azure Stack | CVE-2025-53793 | Azure Stack Hub Information Disclosure Vulnerability | Critical |\n| Azure Stack | CVE-2025-53765 | Azure Stack Hub Information Disclosure Vulnerability | Important |\n| Azure Virtual Machines | CVE-2025-49707 | Azure Virtual Machines Spoofing Vulnerability | Critical |\n| Azure Virtual Machines | CVE-2025-53781 | Azure Virtual Machines Information Disclosure Vulnerability | Critical |\n| Desktop Windows Manager | CVE-2025-53152 | Desktop Windows Manager Remote Code Execution Vulnerability | Important |\n| Desktop Windows Manager | CVE-2025-50153 | Desktop Windows Manager Elevation of Privilege Vulnerability | Important |\n| GitHub Copilot and Visual Studio | CVE-2025-53773 | GitHub Copilot and Visual Studio Remote Code Execution Vulnerability | Important |\n| Graphics Kernel | CVE-2025-50176 | DirectX Graphics Kernel Remote Code Execution Vulnerability | Critical |\n| Kernel Streaming WOW Thunk Service Driver | CVE-2025-53149 | Kernel Streaming WOW Thunk Service Driver Elevation of Privilege Vulnerability | Important |\n| Kernel Transaction Manager | CVE-2025-53140 | Windows Kernel Transaction Manager Elevation of Privilege Vulnerability | Important |\n| Microsoft Brokering File System | CVE-2025-53142 | Microsoft Brokering File System Elevation of Privilege Vulnerability | Important |\n| Microsoft Dynamics 365 (on-premises) | CVE-2025-49745 | Microsoft Dynamics 365 (on-premises) Cross-site Scripting Vulnerability | Important |\n| Microsoft Dynamics 365 (on-premises) | CVE-2025-53728 | Microsoft Dynamics 365 (On-Premises) Information Disclosure Vulnerability | Important |\n| Microsoft Edge for Android | CVE-2025-49755 | Microsoft Edge (Chromium-based) for Android Spoofing Vulnerability | Low |\n| Microsoft Edge for Android | CVE-2025-49736 | Microsoft Edge (Chromium-based) for Android Spoofing Vulnerability | Moderate |\n| Microsoft Exchange Server | CVE-2025-25005 | Microsoft Exchange Server Tampering Vulnerability | Important |\n| Microsoft Exchange Server | CVE-2025-25006 | Microsoft Exchange Server Spoofing Vulnerability | Important |\n| Microsoft Exchange Server | CVE-2025-25007 | Microsoft Exchange Server Spoofing Vulnerability | Important |\n| Microsoft Exchange Server | CVE-2025-53786 | Microsoft Exchange Server Hybrid Deployment Elevation of Privilege Vulnerability | Important |\n| Microsoft Exchange Server | CVE-2025-33051 | Microsoft Exchange Server Information Disclosure Vulnerability | Important |\n| Microsoft Graphics Component | CVE-2025-49743 | Windows Graphics Component Elevation of Privilege Vulnerability | Important |\n| Microsoft Graphics Component | CVE-2025-50165 | Windows Graphics Component Remote Code Execution Vulnerability | Critical |\n| Microsoft Office | CVE-2025-53732 | Microsoft Office Remote Code Execution Vulnerability | Important |\n| Microsoft Office | CVE-2025-53740 | Microsoft Office Remote Code Execution Vulnerability | Critical |\n| Microsoft Office | CVE-2025-53731 | Microsoft Office Remote Code Execution Vulnerability | Critical |\n| Microsoft Office Excel | CVE-2025-53759 | Microsoft Excel Remote Code Execution Vulnerability | Important |\n| Microsoft Office Excel | CVE-2025-53737 | Microsoft Excel Remote Code Execution Vulnerability | Important |\n| Microsoft Office Excel | CVE-2025-53739 | Microsoft Excel Remote Code Execution Vulnerability | Important |\n| Microsoft Office Excel | CVE-2025-53735 | Microsoft Excel Remote Code Execution Vulnerability | Important |\n| Microsoft Office Excel | CVE-2025-53741 | Microsoft Excel Remote Code Execution Vulnerability | Important |\n| Microsoft Office PowerPoint | CVE-2025-53761 | Microsoft PowerPoint Remote Code Execution Vulnerability | Important |\n| Microsoft Office SharePoint | CVE-2025-53760 | Microsoft SharePoint Elevation of Privilege Vulnerability | Important |\n| Microsoft Office SharePoint | CVE-2025-49712 | Microsoft SharePoint Remote Code Execution Vulnerability | Important |\n| Microsoft Office Visio | CVE-2025-53730 | Microsoft Office Visio Remote Code Execution Vulnerability | Important |\n| Microsoft Office Visio | CVE-2025-53734 | Microsoft Office Visio Remote Code Execution Vulnerability | Important |\n| Microsoft Office Word | CVE-2025-53738 | Microsoft Word Remote Code Execution Vulnerability | Important |\n| Microsoft Office Word | CVE-2025-53736 | Microsoft Word Information Disclosure Vulnerability | Important |\n| Microsoft Office Word | CVE-2025-53784 | Microsoft Word Remote Code Execution Vulnerability | Critical |\n| Microsoft Office Word | CVE-2025-53733 | Microsoft Word Remote Code Execution Vulnerability | Critical |\n| Microsoft Teams | CVE-2025-53783 | Microsoft Teams Remote Code Execution Vulnerability | Important |\n| Remote Access Point-to-Point Protocol (PPP) EAP-TLS | CVE-2025-50159 | Remote Access Point-to-Point Protocol (PPP) EAP-TLS Elevation of Privilege Vulnerability | Important |\n| Remote Desktop Server | CVE-2025-50171 | Remote Desktop Spoofing Vulnerability | Important |\n| Role: Windows Hyper-V | CVE-2025-50167 | Windows Hyper-V Elevation of Privilege Vulnerability | Important |\n| Role: Windows Hyper-V | CVE-2025-53155 | Windows Hyper-V Elevation of Privilege Vulnerability | Important |\n| Role: Windows Hyper-V | CVE-2025-49751 | Windows Hyper-V Denial of Service Vulnerability | Important |\n| Role: Windows Hyper-V | CVE-2025-53723 | Windows Hyper-V Elevation of Privilege Vulnerability | Important |\n| Role: Windows Hyper-V | CVE-2025-48807 | Windows Hyper-V Remote Code Execution Vulnerability | Critical |\n| SQL Server | CVE-2025-49758 | Microsoft SQL Server Elevation of Privilege Vulnerability | Important |\n| SQL Server | CVE-2025-24999 | Microsoft SQL Server Elevation of Privilege Vulnerability | Important |\n| SQL Server | CVE-2025-53727 | Microsoft SQL Server Elevation of Privilege Vulnerability | Important |\n| SQL Server | CVE-2025-49759 | Microsoft SQL Server Elevation of Privilege Vulnerability | Important |\n| SQL Server | CVE-2025-47954 | Microsoft SQL Server Elevation of Privilege Vulnerability | Important |\n| Storage Port Driver | CVE-2025-53156 | Windows Storage Port Driver Information Disclosure Vulnerability | Important |\n| Web Deploy | CVE-2025-53772 | Web Deploy Remote Code Execution Vulnerability | Important |\n| Windows Ancillary Function Driver for WinSock | CVE-2025-53718 | Windows Ancillary Function Driver for WinSock Elevation of Privilege Vulnerability | Important |\n| Windows Ancillary Function Driver for WinSock | CVE-2025-53134 | Windows Ancillary Function Driver for WinSock Elevation of Privilege Vulnerability | Important |\n| Windows Ancillary Function Driver for WinSock | CVE-2025-49762 | Windows Ancillary Function Driver for WinSock Elevation of Privilege Vulnerability | Important |\n| Windows Ancillary Function Driver for WinSock | CVE-2025-53147 | Windows Ancillary Function Driver for WinSock Elevation of Privilege Vulnerability | Important |\n| Windows Ancillary Function Driver for WinSock | CVE-2025-53154 | Windows Ancillary Function Driver for WinSock Elevation of Privilege Vulnerability | Important |\n| Windows Ancillary Function Driver for WinSock | CVE-2025-53137 | Windows Ancillary Function Driver for WinSock Elevation of Privilege Vulnerability | Important |\n| Windows Ancillary Function Driver for WinSock | CVE-2025-53141 | Windows Ancillary Function Driver for WinSock Elevation of Privilege Vulnerability | Important |\n| Windows Cloud Files Mini Filter Driver | CVE-2025-50170 | Windows Cloud Files Mini Filter Driver Elevation of Privilege Vulnerability | Important |\n| Windows Connected Devices Platform Service | CVE-2025-53721 | Windows Connected Devices Platform Service Elevation of Privilege Vulnerability | Important |\n| Windows DirectX | CVE-2025-53135 | DirectX Graphics Kernel Elevation of Privilege Vulnerability | Important |\n| Windows DirectX | CVE-2025-50172 | DirectX Graphics Kernel Denial of Service Vulnerability | Important |\n| Windows Distributed Transaction Coordinator | CVE-2025-50166 | Windows Distributed Transaction Coordinator (MSDTC) Information Disclosure Vulnerability | Important |\n| Windows File Explorer | CVE-2025-50154 | Microsoft Windows File Explorer Spoofing Vulnerability | Important |\n| Windows GDI+ | CVE-2025-53766 | GDI+ Remote Code Execution Vulnerability | Critical |\n| Windows Installer | CVE-2025-50173 | Windows Installer Elevation of Privilege Vulnerability | Important |\n| Windows Kerberos | CVE-2025-53779 | Windows Kerberos Elevation of Privilege Vulnerability | Moderate |\n| Windows Kernel | CVE-2025-49761 | Windows Kernel Elevation of Privilege Vulnerability | Important |\n| Windows Kernel | CVE-2025-53151 | Windows Kernel Elevation of Privilege Vulnerability | Important |\n| Windows Local Security Authority Subsystem Service (LSASS) | CVE-2025-53716 | Local Security Authority Subsystem Service (LSASS) Denial of Service Vulnerability | Important |\n| Windows Media | CVE-2025-53131 | Windows Media Remote Code Execution Vulnerability | Important |\n| Windows Message Queuing | CVE-2025-53145 | Microsoft Message Queuing (MSMQ) Remote Code Execution Vulnerability | Important |\n| Windows Message Queuing | CVE-2025-53143 | Microsoft Message Queuing (MSMQ) Remote Code Execution Vulnerability | Important |\n| Windows Message Queuing | CVE-2025-50177 | Microsoft Message Queuing (MSMQ) Remote Code Execution Vulnerability | Critical |\n| Windows Message Queuing | CVE-2025-53144 | Microsoft Message Queuing (MSMQ) Remote Code Execution Vulnerability | Important |\n| Windows NT OS Kernel | CVE-2025-53136 | NT OS Kernel Information Disclosure Vulnerability | Important |\n| Windows NTFS | CVE-2025-50158 | Windows NTFS Information Disclosure Vulnerability | Important |\n| Windows NTLM | CVE-2025-53778 | Windows NTLM Elevation of Privilege Vulnerability | Critical |\n| Windows PrintWorkflowUserSvc | CVE-2025-53133 | Windows PrintWorkflowUserSvc Elevation of Privilege Vulnerability | Important |\n| Windows Push Notifications | CVE-2025-53725 | Windows Push Notifications Apps Elevation of Privilege Vulnerability | Important |\n| Windows Push Notifications | CVE-2025-53724 | Windows Push Notifications Apps Elevation of Privilege Vulnerability | Important |\n| Windows Push Notifications | CVE-2025-50155 | Windows Push Notifications Apps Elevation of Privilege Vulnerability | Important |\n| Windows Push Notifications | CVE-2025-53726 | Windows Push Notifications Apps Elevation of Privilege Vulnerability | Important |\n| Windows Remote Desktop Services | CVE-2025-53722 | Windows Remote Desktop Services Denial of Service Vulnerability | Important |\n| Windows Routing and Remote Access Service (RRAS) | CVE-2025-50157 | Windows Routing and Remote Access Service (RRAS) Information Disclosure Vulnerability | Important |\n| Windows Routing and Remote Access Service (RRAS) | CVE-2025-53153 | Windows Routing and Remote Access Service (RRAS) Information Disclosure Vulnerability | Important |\n| Windows Routing and Remote Access Service (RRAS) | CVE-2025-50163 | Windows Routing and Remote Access Service (RRAS) Remote Code Execution Vulnerability | Important |\n| Windows Routing and Remote Access Service (RRAS) | CVE-2025-50162 | Windows Routing and Remote Access Service (RRAS) Remote Code Execution Vulnerability | Important |\n| Windows Routing and Remote Access Service (RRAS) | CVE-2025-50164 | Windows Routing and Remote Access Service (RRAS) Remote Code Execution Vulnerability | Important |\n| Windows Routing and Remote Access Service (RRAS) | CVE-2025-53148 | Windows Routing and Remote Access Service (RRAS) Information Disclosure Vulnerability | Important |\n| Windows Routing and Remote Access Service (RRAS) | CVE-2025-53138 | Windows Routing and Remote Access Service (RRAS) Information Disclosure Vulnerability | Important |\n| Windows Routing and Remote Access Service (RRAS) | CVE-2025-50156 | Windows Routing and Remote Access Service (RRAS) Information Disclosure Vulnerability | Important |\n| Windows Routing and Remote Access Service (RRAS) | CVE-2025-49757 | Windows Routing and Remote Access Service (RRAS) Remote Code Execution Vulnerability | Important |\n| Windows Routing and Remote Access Service (RRAS) | CVE-2025-53719 | Windows Routing and Remote Access Service (RRAS) Information Disclosure Vulnerability | Important |\n| Windows Routing and Remote Access Service (RRAS) | CVE-2025-53720 | Windows Routing and Remote Access Service (RRAS) Remote Code Execution Vulnerability | Important |\n| Windows Routing and Remote Access Service (RRAS) | CVE-2025-50160 | Windows Routing and Remote Access Service (RRAS) Remote Code Execution Vulnerability | Important |\n| Windows Security App | CVE-2025-53769 | Windows Security App Spoofing Vulnerability | Important |\n| Windows SMB | CVE-2025-50169 | Windows SMB Remote Code Execution Vulnerability | Important |\n| Windows StateRepository API | CVE-2025-53789 | Windows StateRepository API Server file Elevation of Privilege Vulnerability | Important |\n| Windows Subsystem for Linux | CVE-2025-53788 | Windows Subsystem for Linux (WSL2) Kernel Elevation of Privilege Vulnerability | Important |\n| Windows Win32K - GRFX | CVE-2025-50161 | Win32k Elevation of Privilege Vulnerability | Important |\n| Windows Win32K - GRFX | CVE-2025-53132 | Win32k Elevation of Privilege Vulnerability | Important |\n| Windows Win32K - ICOMP | CVE-2025-50168 | Win32k Elevation of Privilege Vulnerability | Important |\nPicus Blue Report 2025 is Here: 2X increase in password cracking\n46% of environments had passwords cracked, nearly doubling from 25% last year.\nGet the Picus Blue Report 2025 now for a comprehensive look at more findings on prevention, detection, and data exfiltration trends.\nComments\nam0309 - 20 hours ago\nThe full report is not showing up\nLawrence Abrams - 19 hours ago\nSorry, should work now.\nEmmsan - 8 hours ago\nHi, you wrote : 'This month's Patch Tuesday fixes one publicly disclosed zero-day in Microsoft SQL Server.'\nAre you sure about this? Isn't it a copy/paste from last month?\nIt seems to concern all Windows Server 2025."
    }
  ],
  "argos_summary": "Microsoft's August 2025 Patch Tuesday has released critical updates addressing over 100 vulnerabilities, including a zero-day flaw in Windows Kerberos that allows privilege escalation. The update fixes 111 vulnerabilities in total, with 13 classified as critical, including several remote code execution flaws that could lead to device takeovers. Notable vulnerabilities include a critical flaw in Azure OpenAI and a remote code execution bug in Microsoft Graphics Component. Users are urged to apply these patches immediately to mitigate potential security risks.",
  "argos_id": "HGY8GVIHA"
}