{
  "url": "https://www.forbes.com/sites/williamhaseltine/2025/08/13/an-unexpected-clue-to-how-metformin-the-worlds-top-diabetes-drug-works/",
  "authorsByline": "William A. Haseltine",
  "articleId": "f0143a0606cb432f9ff94602627277a6",
  "source": {
    "domain": "forbes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NJ",
      "county": "Hudson County",
      "city": "Jersey City",
      "coordinates": {
        "lat": 40.7215682,
        "lon": -74.047455
      }
    }
  },
  "imageUrl": "https://imageio.forbes.com/specials-images/imageserve/62fe40baadccff017f1dbcbd/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-13T13:25:03+00:00",
  "addDate": "2025-08-13T13:34:35.730102+00:00",
  "refreshDate": "2025-08-13T13:34:35.730105+00:00",
  "score": 1.0,
  "title": "An Unexpected Clue To How Metformin, The World’s Top Diabetes Drug, Works",
  "description": "New research reveals that metformin’s power may start in the brain, reshaping our understanding of blood sugar control and healthy aging.",
  "content": "Metformin is an unassuming hero of modern medicine. For more than sixty years, this humble pill has been a mainstay of diabetes care, helping millions of people manage their blood sugar. It lowers blood sugar, improves cholesterol, modestly reduces weight, and is so safe it’s prescribed to millions worldwide. And yet, for decades, scientists haven’t fully understood how it works.\n\nThe standard explanation has long been that metformin works in the liver, reducing how much sugar it sends into the bloodstream. It also helps muscles and fat cells respond more effectively to insulin. More recent research added other suspects: the gut, which can tweak hormones and the microbiome, and a cellular pathway called mTOR, a major regulator of metabolism and longevity. But a new study published in Science Advances suggests that part of metformin’s magic might be happening somewhere unexpected: in the brain.\n\nResearchers turned their attention to a protein called Rap1, found in a small pocket of the brain known as the ventromedial hypothalamus (VMH). This area is a metabolic mission control, coordinating hunger, energy use, and glucose balance.\n\nWhen scientists switched off Rap1 in this brain region in mice, blood sugar levels fell, even without metformin. But when they kept Rap1 switched on, metformin lost its blood-sugar-lowering power. The results hint that, at the doses typically prescribed, metformin may partly work by silencing Rap1’s activity in the brain, not just by acting on the liver or gut.\n\nMost of us think of blood sugar control as the domain of the pancreas, liver, and muscles. Yet the brain is deeply involved. The VMH works like an air traffic controller, taking in information from across the body and sending out signals to adjust glucose production and use. Metformin, it seems, may be tapping into this high-level control system. By dialing down Rap1 activity, the drug might trigger a cascade of neural instructions that ripple out to the rest of the body, improving how tissues handle sugar.\n\nMetformin has drawn attention far beyond the diabetes world. It’s being studied for its potential to slow certain aspects of aging, with researchers probing whether its effects on pathways like mTOR could help extend not just lifespan but healthspan.\n\nThe discovery of the brain-Rap1 link opens new possibilities. Could this same circuit be part of metformin’s longevity effects? If so, drugs that target Rap1 or its related pathways might someday offer more precise ways to improve metabolism or promote healthy aging, perhaps without some of metformin’s side effects.\n\nWhen Old Drugs Tell New Tales\n\nThis does not mean discarding what is already known about metformin’s effects on the liver, muscles, and gut. Those mechanisms are still in play. But at everyday doses, the brain may have a starring role in how the drug works. At much higher doses, peripheral mechanisms can take over, but in real-world clinical use, the brain’s contribution could be key.\n\nThe finding is also a reminder that the brain and body are not separate actors in the story of metabolism. They are in constant conversation, adjusting and responding to keep systems in balance. And as this research shows, an old drug can reveal something entirely new about that conversation. Even after six decades, metformin still has secrets to share: secrets that may change how both the medicine itself and the intricate links between the brain, the body, and health are understood.",
  "medium": "Article",
  "links": [
    "https://www.science.org/doi/10.1126/sciadv.adu3700"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "blood sugar control",
      "weight": 0.0893353
    },
    {
      "name": "blood sugar levels",
      "weight": 0.08495345
    },
    {
      "name": "blood sugar",
      "weight": 0.084224634
    },
    {
      "name": "metformin",
      "weight": 0.07480058
    },
    {
      "name": "Old Drugs",
      "weight": 0.06981034
    },
    {
      "name": "Rap1 activity",
      "weight": 0.06975892
    },
    {
      "name": "sugar",
      "weight": 0.06609658
    },
    {
      "name": "drugs",
      "weight": 0.06380082
    },
    {
      "name": "Rap1",
      "weight": 0.06130419
    },
    {
      "name": "body",
      "weight": 0.060463447
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Health"
    }
  ],
  "taxonomies": [
    {
      "name": "/Health/Medical Literature & Resources/Other",
      "score": 0.7744140625
    },
    {
      "name": "/Health/Pharmacy/Drugs & Medications",
      "score": 0.68896484375
    },
    {
      "name": "/News/Health News",
      "score": 0.6630859375
    },
    {
      "name": "/Business & Industrial/Pharmaceuticals & Biotech",
      "score": 0.44287109375
    },
    {
      "name": "/Health/Health Foundations & Medical Research",
      "score": 0.367919921875
    }
  ],
  "sentiment": {
    "positive": 0.17931634,
    "negative": 0.33574393,
    "neutral": 0.4849397
  },
  "summary": "Metformin, the world's top diabetes drug, has been a mainstay of modern medicine for over 60 years and is widely prescribed worldwide. However, a study published in Science Advances suggests that part of metformin's magic might be in the brain, specifically a protein called Rap1 found in the ventromedial hypothalamus (VMH), which controls hunger, energy use, and glucose balance. When scientists switched off Rap1 in this brain region in mice, blood sugar levels fell even without the drug. This discovery suggests that at certain doses, the brain may play a significant role in the drug's success. If successful, drugs that target Rap1 or its related pathways might offer more precise ways to improve metabolism or promote healthy aging without some of the side effects.",
  "shortSummary": "Metformin's unique combination of liver, gut, and brain functions, potentially leading to its unexpected and potentially life-extending benefits, enhancing blood sugar management and longevity.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "95c339463d714646b000d7e2599e827a",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Metformin, a longstanding medication for diabetes, has been found to have effects in the brain, specifically through a protein called Rap1 in the ventromedial hypothalamus (VMH), which regulates hunger and glucose balance. Recent research indicates that metformin may lower blood sugar by silencing Rap1's activity in the brain, suggesting a more complex mechanism than previously understood, which also involves the liver and gut. This discovery opens new avenues for understanding metformin's potential in promoting healthy aging and metabolism, highlighting the interconnectedness of brain and body in metabolic processes.",
  "argos_id": "IG5FF9AAR"
}