{
  "url": "https://www.cnn.com/2025/08/13/business/iea-oil-market-report-supply-intl?cid=external-feeds_iluminar_google",
  "authorsByline": "",
  "articleId": "3dd61ebc27454b0c956a53f0156e9bc5",
  "source": {
    "domain": "cnn.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2190445552.jpg?c=16x9&q=w_800,c_fill",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-13T13:11:50.079000+00:00",
  "addDate": "2025-08-13T13:21:10.038304+00:00",
  "refreshDate": "2025-08-13T13:21:10.038305+00:00",
  "score": 1.0,
  "title": "Global oil market looks ‘bloated’ amid lackluster demand from major economies",
  "description": "World oil supply will rise more rapidly than expected this year and next as OPEC+ members further increase output and supply from outside the group grows, the International Energy Agency said Wednesday.",
  "content": "World oil supply will rise more rapidly than expected this year and next as OPEC+ members further increase output and supply from outside the group grows, the International Energy Agency said Wednesday.\n\nSupply will rise by 2.5 million barrels per day in 2025, up from 2.1 million bpd previously forecast, said the IEA, which advises industrialized countries, in a monthly report, and by a further 1.9 million bpd next year.\n\nOPEC+ is adding more crude to the market after the Organization of the Petroleum Exporting Countries, Russia and other allies decided to unwind its most recent layer of output cuts more rapidly than earlier scheduled. The extra supply, along with concern about the economic impact of President Donald Trump’s tariffs, has weighed on oil this year.\n\nSupply is rising far faster than demand in the IEA’s view. It expects global oil demand to rise by 680,000 bpd this year and 700,000 bpd next year, both down 20,000 bpd from the previous forecast.\n\n“The latest data show lackluster demand across the major economies and, with consumer confidence still depressed, a sharp rebound appears remote,” the agency said in the report, which linked its higher output forecast to increased OPEC+ production targets. “Oil market balances look ever more bloated.”\n\nIEA demand forecasts are at the lower end of the industry range, as the agency expects a faster transition to renewable energy sources than some other forecasters. OPEC on Tuesday maintained its forecast for demand to rise by 1.29 million bpd this year –— almost double the IEA figure.\n\nOil prices extended losses after the IEA published its report at 8 a.m. GMT, with Brent crude trading lower than $66 a barrel.\n\nThe report implies that supply may exceed demand by almost 3 million bpd next year, driven by growth from outside the wider OPEC+ group and a limited expansion in demand.\n\nDespite higher OPEC+ production, non-OPEC producers will continue to lead supply growth this year and next owing to rising output in the US, Canada, Brazil and Guyana, according to the IEA.\n\nStill, additional sanctions on Russia and Iran may curb supplies from the world’s third and fifth largest producers, the IEA said.\n\nThe U.S. announced new sanctions on Iran last month and the European Union lowered a price cap for Russian oil as part of its latest sanctions on Moscow.\n\n“It is clear that something will have to give for the market to balance,” the IEA said.\n\nContinued Chinese stockbuilding due to major institutional and policy developments aimed at enhancing energy security may help absorb the surplus, the agency said. This helped support prices earlier in the year, analysts have said.\n\nDespite lowering its demand forecast, the IEA expects global crude oil refining rates to approach a fresh all-time high of 85.6 million bpd in August, after reaching 84.9 million bpd in July.\n\nGlobal refinery runs will rise by 670,000 bpd, to 83.6 million bpd, in 2025; and by a further 470,000 bpd, to 84 million bpd, in 2026, driven by better-than-expected data for market economies grouped in the Organisation for Economic Co-operation and Development and China, the agency said.",
  "medium": "Article",
  "links": [
    "https://www.cnn.com/follow"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "IEA demand forecasts",
      "weight": 0.10100768
    },
    {
      "name": "global oil demand",
      "weight": 0.094620906
    },
    {
      "name": "World oil supply",
      "weight": 0.09280456
    },
    {
      "name": "Global oil market",
      "weight": 0.09025638
    },
    {
      "name": "Oil market balances",
      "weight": 0.083836846
    },
    {
      "name": "rising output",
      "weight": 0.08315196
    },
    {
      "name": "supply growth",
      "weight": 0.07912858
    },
    {
      "name": "lackluster demand",
      "weight": 0.078098334
    },
    {
      "name": "next year",
      "weight": 0.077904284
    },
    {
      "name": "Oil prices",
      "weight": 0.07719304
    }
  ],
  "topics": [
    {
      "name": "Energy Sector"
    }
  ],
  "categories": [
    {
      "name": "Business"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Economy News",
      "score": 0.9150390625
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.90380859375
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.84619140625
    },
    {
      "name": "/Business & Industrial/Energy & Utilities/Oil & Gas",
      "score": 0.83447265625
    },
    {
      "name": "/Finance/Investing/Commodities & Futures Trading",
      "score": 0.326416015625
    }
  ],
  "sentiment": {
    "positive": 0.13338873,
    "negative": 0.6235968,
    "neutral": 0.2430145
  },
  "summary": "The International Energy Agency (IEA) has warned that global oil supply will rise more rapidly than expected this year and next, due to OPEC+ members increasing output and increasing supply from outside the group. The IEA predicts that supply will increase by 2.5 million barrels per day in 2025, up from 2.1 million bpd previously forecasted, and by a further 1.9 million bPD next year. This increase has led to a decrease in global oil demand, which is expected to rise by 680,000 bpd this year. The agency also noted that despite higher OPEC+ production, non-OPEC producers will continue to lead supply growth. However, additional sanctions on Russia and Iran may curb supplies from these countries.",
  "shortSummary": "The IEA predicts rapid global oil supply increases due to increased OPEC+ output, despite weak global demand and rising US-based production.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "cf5e5871e7d94da9b5d541ad91bcbcc9",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "The International Energy Agency (IEA) has revised its forecast for global oil supply, predicting an increase of 2.5 million barrels per day in 2025, driven by higher output from OPEC+ and non-OPEC producers. In contrast, the IEA expects global oil demand to rise by only 680,000 bpd this year, indicating a potential oversupply of nearly 3 million bpd next year. The report highlights a sluggish demand across major economies and suggests that additional sanctions on Russia and Iran could further impact supply.",
  "argos_id": "J99EM2TPZ"
}