{
  "url": "https://finance.yahoo.com/news/bullish-prices-ipo-at-37-per-share-valuing-crypto-exchange-above-5-billion-ahead-of-market-debut-133442012.html?_guc_consent_skip=1755092538",
  "authorsByline": "Jake Conley",
  "articleId": "9f275a91c5c440549d38cac172244b98",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://s.yimg.com/ny/api/res/1.2/xdVzH9LrwiF2WtbnLKKnsg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://s.yimg.com/os/creatr-uploaded-images/2025-08/0e2940b0-7840-11f0-aff9-4d5b324c2fe0",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-13T13:35:21+00:00",
  "addDate": "2025-08-13T13:42:33.988885+00:00",
  "refreshDate": "2025-08-13T13:42:33.988887+00:00",
  "score": 1.0,
  "title": "Bullish prices IPO at $37 per share, valuing crypto exchange above $5 billion ahead of market debut",
  "description": "Bullish is set to go public on Wednesday after pricing its IPO above a range that was increased during its roadshow.",
  "content": "Cryptocurrency exchange operator Bullish (BLSH) is set to go public Wednesday at a valuation north of $5 billion as the IPO market looks set to continue a strong summer.\n\nThe company, which operates a crypto exchange and owns the prominent trade publication CoinDesk, said Tuesday that it had priced its IPO at $37 per share, above the $32-$33 range the company had expected in its second shot at making a public market debut.\n\nBullish first attempted to go public via a SPAC merger in 2021 that would have valued the company at $9 billion, but the deal fell through after regulatory scrutiny and Bullish withdrew its registration.\n\nThis is the company's second range increase for its latest offering, with the previous $32-$33 per share estimate raised from an earlier range of $28-$31 per share. At 30 million shares offered, the IPO price will see Bullish raise $1.1 billion and value the fintech company at $5.41 billion.\n\nThe company will be looking to ride the outsized success of recent go-publics like Figma (FIG) and Circle (CRCL) and serve as the latest sign the IPO window remains wide open after a few challenging years for investors.\n\nThrough Wednesday, 2025 has so far seen 133 IPOs come to market worth more than $50 million, up more than 58% from the same time last year, according to IPO tracker and ETF operator Renaissance Capital.\n\nAhead of its IPO, Bullish has already garnered major institutional interest, with asset management giant BlackRock and Cathie Wood's investment firm fund Ark Invest have expressed interest in purchasing up to $200 million worth of shares in the offering, according to securities filings.\n\n\"We now intend to IPO because we believe that the digital assets industry is beginning its next leg of growth,\" said Bullish CEO Thomas Farley, previously COO and president of the NYSE Group, in a letter to investors about Bullish's offering.\n\n\"I believe that the digital assets industry is at the inflection point of institutional adoption and Bullish is uniquely positioned at the center of this market. The compliant, institutional- focused market infrastructure model is time-tested and works, and Bullish is proud to be the one bringing this proven framework to the crypto landscape.\"\n\nBullish's main business comes from its Bullish Exchange, a digital assets spot and derivative exchange geared toward institutional-sized clients. The operator processed an average $2.6 billion in daily volume through Q1, according to the company's prospectus.\n\nBullish is also riding the coattails of this year's hot streak of fintech IPOs. When USDC stablecoin manager Circle Internet Group went public in June, its shares soared by 168% in their first day of trading. And while the price has come down, the stock is still up more than 130% since inception.",
  "medium": "Article",
  "links": [
    "https://finance.yahoo.com/quote/CRCL",
    "https://www.renaissancecapital.com/IPO-Center/Stats",
    "https://www.fintechweekly.com/magazine/articles/bullish-ipo-target-990m-valuation-4-8b",
    "https://finance.yahoo.com/quote/BLSH",
    "https://finance.yahoo.com/quote/FIG",
    "https://www.sec.gov/Archives/edgar/data/1872195/000110465925075896/tm2421409-23_f1a.htm",
    "https://www.reuters.com/technology/coindesk-owner-bullish-prices-ipo-above-range-raise-over-11-billion-2025-08-13/",
    "https://finance.yahoo.com/quote/BLSH/",
    "https://www.cnbc.com/2025/08/04/peter-thiel-bullish-seeks-multi-billion-valuation-ipo.html",
    "https://finance.yahoo.com/news/circle-ipo-delivered-biggest-two-090000108.html?fr=sycsrp_catchall",
    "https://bullish.com/news-insights/news/bullish-announces-pricing-of-upsized-initial-public-offering/",
    "https://finance.yahoo.com/chart/BLSH"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Cryptocurrency exchange operator Bullish",
      "weight": 0.10078347
    },
    {
      "name": "Bullish",
      "weight": 0.09609223
    },
    {
      "name": "Bullish Exchange",
      "weight": 0.09599575
    },
    {
      "name": "Bullish CEO Thomas Farley",
      "weight": 0.090740524
    },
    {
      "name": "fintech IPOs",
      "weight": 0.08348573
    },
    {
      "name": "IPO",
      "weight": 0.080338955
    },
    {
      "name": "market debut",
      "weight": 0.07537464
    },
    {
      "name": "crypto exchange",
      "weight": 0.0736211
    },
    {
      "name": "market",
      "weight": 0.0699312
    },
    {
      "name": "asset management giant BlackRock",
      "weight": 0.069801256
    }
  ],
  "topics": [
    {
      "name": "Cryptocurrency"
    },
    {
      "name": "IPO"
    },
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.9951171875
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.8671875
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.80908203125
    },
    {
      "name": "/Finance/Investing/Currencies & Foreign Exchange",
      "score": 0.8037109375
    }
  ],
  "sentiment": {
    "positive": 0.75184685,
    "negative": 0.03173733,
    "neutral": 0.21641587
  },
  "summary": "Cryptocurrency exchange operator Bullish (BLSH) is set to go public at a valuation north of $5 billion. The company, which operates a crypto exchange and owns the trade publication CoinDesk, has priced its IPO at $37 per share, above the $32-$33 range the company had expected. This is the second increase in the company's IPO range. The IPO will raise $1.1 billion and value the fintech company at $5.41 billion. Major institutional interest has been expressed, with BlackRock and investment firm Ark Invest expressing interest in purchasing up to $200 million worth of shares in the offering.",
  "shortSummary": "The crypto exchange operator Bullish priced its IPO at $37 per share, valuing it at $5 billion, outpacing previous expectations, as the IPO market continues its strong summer.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "f47fee82e00d4360b49a4c0460a69f7b",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.cnbc.com/2025/08/04/peter-thiel-bullish-seeks-multi-billion-valuation-ipo.html",
      "text": "Crypto exchange Bullish is targeting a valuation of up to $4.23 billion in its United States listing, the company said in a filing on Monday, launching its roadshow to capitalize on the momentum built by digital assets amid regulatory clarity.\nCompanies leveraging crypto and related technologies have rallied on friendly policymaking from the Trump administration, such as the recent passage of the GENIUS Act, which provides an initial regulatory framework for stablecoins.\nBullish is seeking up to $629.3 million by offering 20.3 million shares priced between $28 and $31 each, marking its second attempt to go public in four years.\nAt the top of its proposed range, the company will list at a more than 52% discount to its $9 billion valuation target in a 2021 blank check merger that it called off in 2022, citing regulatory hurdles.\n\"When an IPO begins marketing, the bankers would rather undershoot on valuation and then price up, rather than overshoot and price down,\" said Matt Kennedy, senior strategist at Renaissance Capital, a provider of IPO-focused research and ETFs.\nBullish, backed by billionaire Peter Thiel, plans to convert a significant portion of the IPO proceeds to U.S.-dollar-denominated stablecoins with the assistance of one or more issuers of such tokens, it said in the filing.\nMajor stablecoin-issuer Circle Internet CRCL.K had a blowout debut on the NYSE in June and currently trades at more than 400% of its IPO price.\nInvestor focus\nBullish, whose CEO Thomas Farley previously served as president of the New York Stock Exchange, operates a crypto-trading exchange targeting institutions.\nIt also operates crypto news website CoinDesk, which it acquired from Barry Silbert's Digital Currency Group in 2023.\nBullish swung to a $349 million loss for the quarter ended March 31, compared with a profit of $105 million a year earlier, reflecting a fall in fair value of its crypto holdings.\nMeanwhile, public crypto exchange Coinbase reported a drop in second-quarter adjusted profit on Friday, due to a slowdown in trading, which dragged its shares down nearly 17%, even though the company recorded portfolio gains.\nSome investors tend to overlook the impact of quarterly swings in crypto prices when evaluating such companies, analysts have said.\nAccording to Renaissance Capital's Kennedy, investors will focus on \"how efficient (Bullish is) and how profitable it is as a pure exchange, without the impact of quarterly price changes.\"\nBullish aims to list on the NYSE under the symbol \"BLSH\". J.P.Morgan, Jefferies and Citigroup are the lead underwriters."
    },
    {
      "url": "https://finance.yahoo.com/news/circle-ipo-delivered-biggest-two-090000108.html?fr=sycsrp_catchall",
      "text": "The Circle IPO delivered the biggest two-day ‘pop’ since 1980—but the crypto company left $3 billion on the table\nBy the close of Circle Internet Group’s first trading day on Thursday, June 5, its stock had rocketed to $88, a 180% jump from the price institutional investors paid for their shares in the underwriting led by JPMorgan, Goldman Sachs, and Citigroup. The upshot: The company and insiders combined left a gigantic amount of money on the table by agreeing to a price far below what investors were willing to pay. As Fortune previously noted, that “left on the table” figure was the seventh largest in the history of all IPOs since 1980, exceeded only by the debuts of Visa, Airbnb, Snowflake, Rivian, DoorDash, and Coupang, the latter nicknamed “the Amazon of South Korea.”\nCircle was just revving up. On Friday, June 6, its stock jumped another nearly 30% to $107.5. That additional leap hurtled the issuer for the USDC stablecoin to a historic record. Jay Ritter—a professor at the University of Florida and the world’s leading expert on IPOs—confirmed that for all go-public events since 1980 that raised $500 million or more, Circle’s two-day moonshot of nearly 250% ranks as by far the highest. The crypto favorite’s showing easily eclipsed the second place “pop” sounded by software provider C3.ai of 209% at its 2020 entry on the Nasdaq.\nAll told, Circle sold 39 million shares, raising $1.145 billion after underwriting fees of $67 million. Had the shares fetched the $107.5 close on June 6 instead of the $31 (excluding fees) paid in the presale by the likes of mutual and hedge funds, the company and insiders combined would have collected $4.144 billion. Hence, as of the second day of trading, the IPO had left a staggering $3 billion on the table. Put simply, for every $1 going to the sellers, $3 in two-day gains flowed to the underwriters’ Wall Street clients as a windfall.\nAt a market cap of $22 billion, Circle is selling at 140 times earnings. Given that treacherous valuation and the onslaught of stablecoin rivals invading its space, Circle is the epitome of an ultrahigh-risk stock. Money that might have been sitting in its treasury as a buffer against tough times vanished in this mind-bending spectacle that only the confluence of crypto craziness and Wall Street’s genius for underpricing IPOs could have staged.\nThis story was originally featured on Fortune.com"
    },
    {
      "url": "https://finance.yahoo.com/quote/FIG",
      "text": "Figma, Inc. (FIG)\nThis price reflects trading activity during the overnight session on the Blue Ocean ATS, available 8 PM to 4 AM ET, Sunday through Thursday, when regular markets are closed.\n- Previous Close\n82.50 - Open\n84.00 - Bid --\n- Ask --\n- Day's Range\n83.91 - 90.69 - 52 Week Range\n76.65 - 142.92 - Volume\n10,264,874 - Avg. Volume\n28,371,622 - Market Cap (intraday)\n42.585B - Beta (5Y Monthly) --\n- PE Ratio (TTM)\n-- - EPS (TTM)\n-5.46 - Earnings Date --\n- Forward Dividend & Yield --\n- Ex-Dividend Date --\n- 1y Target Est\n--\nFigma, Inc. develops a browser-based tool for designing user interfaces that helps design and development teams build various products. The company offers Figma Design, a collaborative design tool for teams that explore ideas and gather feedback, build realistic prototypes, and streamline product development with design systems; Dev Mode to inspect designs and translate them into code without changing the design file; FigJam to define ideas, align on decisions, and move work forwardall in one place; and Figma Slides, a presentation tool built for designers and their teams. It also provides Figma Draw to create expressive designs with illustration tools; Figma Buzz that publishes brand templates to create social media assets, display ads, one-pagers, and others; Figma Sites to design, prototype, and publish; and Figma Make, an AI tool to design and prompt way to a functional prototype. The company was incorporated in 2012 and is headquartered in San Francisco, California.\nwww.figma.com--\nFull Time Employees\nDecember 31\nFiscal Year Ends\nSector\nIndustry\nRecent News: FIG\nView MoreRelated Videos: FIG\nPerformance Overview: FIG\nTrailing total returns as of 8/12/2025, which may include dividends or other distributions. Benchmark is S&P 500 (^GSPC) .\nYTD Return\n1-Year Return\n3-Year Return\n5-Year Return\nCompare To: FIG\nSelect to analyze similar companies using key performance metrics; select up to 4 stocks.\nStatistics: FIG\nView MoreValuation Measures\nMarket Cap\n42.58B\nEnterprise Value\n41.44B\nTrailing P/E\n--\nForward P/E\n--\nPEG Ratio (5yr expected)\n--\nPrice/Sales (ttm)\n47.69\nPrice/Book (mrq)\n40.91\nEnterprise Value/Revenue\n50.48\nEnterprise Value/EBITDA\n--\nFinancial Highlights\nProfitability and Income Statement\nProfit Margin\n-85.36%\nReturn on Assets (ttm)\n--\nReturn on Equity (ttm)\n--\nRevenue (ttm)\n820.98M\nNet Income Avi to Common (ttm)\n-700.76M\nDiluted EPS (ttm)\n-5.46\nBalance Sheet and Cash Flow\nTotal Cash (mrq)\n1.54B\nTotal Debt/Equity (mrq)\n4.87%\nLevered Free Cash Flow (ttm)\n--"
    },
    {
      "url": "https://finance.yahoo.com/quote/CRCL",
      "text": "Circle Internet Group (CRCL)\n- Previous Close\n163.21 - Open\n156.64 - Bid 161.13 x 300\n- Ask 161.24 x 200\n- Day's Range\n154.00 - 164.64 - 52 Week Range\n64.00 - 298.99 - Volume\n7,515,910 - Avg. Volume\n28,659,661 - Market Cap (intraday)\n39.034B - Beta (5Y Monthly) --\n- PE Ratio (TTM)\n1,970.38 - EPS (TTM)\n0.08 - Earnings Date Nov 11, 2025\n- Forward Dividend & Yield --\n- Ex-Dividend Date --\n- 1y Target Est\n191.18\nCircle Internet Group, Inc. operates as a platform, network, and market infrastructure for stablecoin and blockchain applications. The company provides a suite of stablecoins and related products that include a network utility and application platform for organizations to benefit from stablecoins and the internet financial system; and issues a U.S. dollar-denominated stablecoin. Its stablecoins network comprises circle stablecoins, tokenized funds, liquidity, payments, and developer services, as well as integration services. The company was founded in 2013 and is based in New York, New York.\nwww.circle.com900\nFull Time Employees\nDecember 31\nFiscal Year Ends\nSector\nIndustry\nRecent News: CRCL\nView MoreRelated Videos: CRCL\nPerformance Overview: CRCL\nTrailing total returns as of 8/13/2025, which may include dividends or other distributions. Benchmark is S&P 500 (^GSPC) .\nYTD Return\n1-Year Return\n3-Year Return\n5-Year Return\nCompare To: CRCL\nSelect to analyze similar companies using key performance metrics; select up to 4 stocks.\nStatistics: CRCL\nView MoreValuation Measures\nMarket Cap\n37.15B\nEnterprise Value\n36.34B\nTrailing P/E\n1.87k\nForward P/E\n163.93\nPEG Ratio (5yr expected)\n6.87\nPrice/Sales (ttm)\n19.22\nPrice/Book (mrq)\n49.87\nEnterprise Value/Revenue\n19.23\nEnterprise Value/EBITDA\n123.85\nFinancial Highlights\nProfitability and Income Statement\nProfit Margin\n9.09%\nReturn on Assets (ttm)\n--\nReturn on Equity (ttm)\n--\nRevenue (ttm)\n1.89B\nNet Income Avi to Common (ttm)\n19.43M\nDiluted EPS (ttm)\n0.08\nBalance Sheet and Cash Flow\nTotal Cash (mrq)\n848.61M\nTotal Debt/Equity (mrq)\n2.81%\nLevered Free Cash Flow (ttm)\n--"
    },
    {
      "url": "https://finance.yahoo.com/quote/BLSH",
      "text": "Bullish (BLSH)\n- Previous Close\n37.0000 - Open\n-- - Bid --\n- Ask --\n- Day's Range\n-- - 52 Week Range\n-- - Volume\n-- - Avg. Volume\n-- - Market Cap (intraday)\n1,461 - Beta (5Y Monthly) --\n- PE Ratio (TTM)\n-- - EPS (TTM)\n-- - Earnings Date --\n- Forward Dividend & Yield --\n- Ex-Dividend Date --\n- 1y Target Est\n--\nBullish provides market infrastructure and information services in United States. It operates Bullish Exchange, a digital assets spot and derivatives exchange that integrates a central limit order book matching engine with automated market making to provide deep and predictable liquidity. The company also offers CoinDesk Indices, a collection of tradable proprietary and single-asset benchmarks and indices that track the performance of digital assets for global institutions in the digital assets and traditional finance industries; CoinDesk Data, a comprehensive suite of digital assets market data and analytics, providing real-time insights into prices, trends, and market dynamics; and CoinDesk Insights, operates Coindesk.com, a leading digital media platform that covers news and insights about digital assets, the underlying markets, policy, and blockchain technology. Bullish was founded in 2020 and is based in George Town, Cayman Islands.\nwww.Bullish.com400\nFull Time Employees\nDecember 31\nFiscal Year Ends\nSector\nIndustry\nRecent News: BLSH\nView MoreRelated Videos: BLSH\nCompare To: BLSH\nSelect to analyze similar companies using key performance metrics; select up to 4 stocks.\nStatistics: BLSH\nView MoreValuation Measures\nMarket Cap\n--\nEnterprise Value\n--\nTrailing P/E\n--\nForward P/E\n--\nPEG Ratio (5yr expected)\n--\nPrice/Sales (ttm)\n--\nPrice/Book (mrq)\n--\nEnterprise Value/Revenue\n--\nEnterprise Value/EBITDA\n--\nFinancial Highlights\nProfitability and Income Statement\nProfit Margin\n-0.15%\nReturn on Assets (ttm)\n--\nReturn on Equity (ttm)\n--\nRevenue (ttm)\n250.11B\nNet Income Avi to Common (ttm)\n-369.04M\nDiluted EPS (ttm)\n--\nBalance Sheet and Cash Flow\nTotal Cash (mrq)\n288.74M\nTotal Debt/Equity (mrq)\n33.24%\nLevered Free Cash Flow (ttm)\n--"
    },
    {
      "url": "https://www.renaissancecapital.com/IPO-Center/Stats",
      "text": "The IPO ETF has almost NO Overlap with the S&P 500\nThe IPO ETF only contains New Stocks\n| The U.S. IPO Market YTD | ||\n|---|---|---|\n| (IPOs ≥ $50mm Market Cap) | ||\n| Pricing Activity | There have been 133 IPOs priced this year, a +58.3% change from last year. Get Chart | |\n| Proceeds Raised | Total proceeds raised were $22.2 bil this year, a -4.3% change from last year. Get Chart | |\n| Filing Activity | There have been 146 IPOs filed this year, a +19.7% change from last year. Get Chart | |\n| Industry Breakdown | There have been 81 SPAC IPOs, the most in any sector. Get Chart |\nStay up-to-date on the most recently priced IPOs and discover new investment ideas by keeping track of trending IPOs and new stocks in each industry.\nThere have been 133 IPOs in 2025. July has had the most with a total of 26. May has had the fewest with only 12. View all 2025 IPOs on IPO Pro.\nThere were 150 IPOs in 2024. October had the most with a total of 22. August had the fewest with only 7. View all 2024 IPOs on IPO Pro."
    },
    {
      "url": "https://finance.yahoo.com/quote/BLSH/",
      "text": "Bullish (BLSH)\n- Previous Close\n37.0000 - Open\n-- - Bid --\n- Ask --\n- Day's Range\n-- - 52 Week Range\n-- - Volume\n-- - Avg. Volume\n-- - Market Cap (intraday)\n1,461 - Beta (5Y Monthly) --\n- PE Ratio (TTM)\n-- - EPS (TTM)\n-- - Earnings Date --\n- Forward Dividend & Yield --\n- Ex-Dividend Date --\n- 1y Target Est\n--\nBullish provides market infrastructure and information services in United States. It operates Bullish Exchange, a digital assets spot and derivatives exchange that integrates a central limit order book matching engine with automated market making to provide deep and predictable liquidity. The company also offers CoinDesk Indices, a collection of tradable proprietary and single-asset benchmarks and indices that track the performance of digital assets for global institutions in the digital assets and traditional finance industries; CoinDesk Data, a comprehensive suite of digital assets market data and analytics, providing real-time insights into prices, trends, and market dynamics; and CoinDesk Insights, operates Coindesk.com, a leading digital media platform that covers news and insights about digital assets, the underlying markets, policy, and blockchain technology. Bullish was founded in 2020 and is based in George Town, Cayman Islands.\nwww.Bullish.com400\nFull Time Employees\nDecember 31\nFiscal Year Ends\nSector\nIndustry\nRecent News: BLSH\nView MoreRelated Videos: BLSH\nCompare To: BLSH\nSelect to analyze similar companies using key performance metrics; select up to 4 stocks.\nStatistics: BLSH\nView MoreValuation Measures\nMarket Cap\n--\nEnterprise Value\n--\nTrailing P/E\n--\nForward P/E\n--\nPEG Ratio (5yr expected)\n--\nPrice/Sales (ttm)\n--\nPrice/Book (mrq)\n--\nEnterprise Value/Revenue\n--\nEnterprise Value/EBITDA\n--\nFinancial Highlights\nProfitability and Income Statement\nProfit Margin\n-0.15%\nReturn on Assets (ttm)\n--\nReturn on Equity (ttm)\n--\nRevenue (ttm)\n250.11B\nNet Income Avi to Common (ttm)\n-369.04M\nDiluted EPS (ttm)\n--\nBalance Sheet and Cash Flow\nTotal Cash (mrq)\n288.74M\nTotal Debt/Equity (mrq)\n33.24%\nLevered Free Cash Flow (ttm)\n--"
    }
  ],
  "argos_summary": "Cryptocurrency exchange operator Bullish (BLSH) is going public with an IPO priced at $37 per share, aiming for a valuation over $5 billion. This marks its second attempt to enter the public market after a previous SPAC merger fell through in 2021. The company has attracted significant institutional interest, including from BlackRock and Ark Invest, and plans to leverage the recent success of fintech IPOs to capitalize on the growing digital assets market.",
  "argos_id": "K2O8EXSHC"
}