{
  "url": "https://www.polygon.com/samurai-jack-genndy-tartakovsky-interview-fixed/",
  "authorsByline": "Samantha Nelson",
  "articleId": "366615543b86463aa69aec599957db20",
  "source": {
    "domain": "polygon.com",
    "paywall": false,
    "location": {
      "country": "be",
      "county": "Antwerp",
      "city": "Antwerp",
      "coordinates": {
        "lat": 51.2211097,
        "lon": 4.3997081
      }
    }
  },
  "imageUrl": "https://static1.polygonimages.com/wordpress/wp-content/uploads/2025/08/fix-bull-zombie_final.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-13T14:01:13+00:00",
  "addDate": "2025-08-13T14:05:29.172515+00:00",
  "refreshDate": "2025-08-13T14:05:29.172518+00:00",
  "score": 1.0,
  "title": "The personal story behind Genndy Tartakovsky's Fixed",
  "description": "Warner Bros. shelved this raunchy, R-rated animated comedy and Netflix saved it — Samurai Jack's creator explains why that means so much to him",
  "content": "Fixed, the raunchy new animated Netflix movie from Samurai Jack and Primal creator Genndy Tartakovsky, follows a mutt named Bull (Adam DeVine) who’s about to get neutered, and copes by spending a raucous night out with his buddies. It almost didn’t get released: Tartakovsky had to censor some of the art to get approval for the R-rated film, but even after that, Warner Bros. Discovery declined to release the movie. which stayed shelved until Netflix picked it up for release. Tartakovsky, who co-scripted Fixed along with The Simpsons Movie writer Jon Vitti, says he was determined to get it to audiences, because it’s a deeply personal film.\n\n“The movie’s based on my friend group since high school,” Tartakovsky told Polygon in a Zoom interview. “They worked on the movie with me, in the beginning especially. I thought it would be fun, because they’re both writers — one’s in advertising and one’s a sports writer — so we were able to collaborate. It was really fun to work with my best friends.”\n\nTartakovsky and his friends crafted silly exaggerations of their group. One guy with a chip on his shoulder became Rocco (Idris Elba), a boxer constantly bringing up how he wasn’t breastfed because his mom had so many puppies. The dog pals also feature Lucky (Bobby Moynihan), a beagle who waxes philosophical when he isn’t eating poop, and Fetch (Fred Armisen), a dachshund influencer constantly sporting new outfits that Tartakovsky came up with by doodling.\n\n“I tried not to look online [for inspiration], because I knew that was going to be a rabbit hole of way too much. So I just thought, ‘What would be really funny?’” he said. “I also tried not to draw attention to it too much. When people look at it, they could just giggle once they realize he’s wearing a beret and a turtleneck or something.”\n\nTartakovsky says he had to make sure the jokes didn’t just appeal to him and his friends, which is why he cut the character who was meant as a stand-in for him: a Siberian Husky with a thick Russian accent, constantly saying things that didn’t make any sense.\n\n“I don’t know if it was too specific and weird; that was probably more in my own head,” Tartakovsky said. “I probably could have made it work, but it seemed like a fine sacrifice, because it’s hard to have a lot of characters, because everybody’s got to say something.”\n\nFixed is set in Chicago, where Tartakovsky went to high school. Bull romps around the “Wiggly Field Dog Park” and gorges himself at a food festival based on the annual Taste of Chicago event.\n\n“I didn’t have the opportunity to make it like Annie Hall, Woody Allen’s tribute to New York,” Tartakovsky said. “It was nothing that sophisticated. But it was just enough that there’s a city feel in the way we drew the buildings and the houses where they live.”\n\nAlong with his human friends, Tartakovsky also found inspiration for Fixed in his own dogs. “My three dogs all have three different personalities,” he said. “The Saint Bernard is giant and kind of loafy and lovable, and he sleeps for 20 hours of the day. The King Charles Alfie is kind of cranky and slow. I used to have two Saint Bernards, so he grew up with Saint Bernards, and I think he thinks he’s a Saint Bernard. When one of them passed away, we got another King Charles [that] was more energetic, and they’re running around, and all of a sudden Alfie started to [embody] those traits.”\n\nThe Fixed cast also told Polygon they looked to real canines to get into their roles.\n\n“I don’t currently have one, but my neighbor’s dog humps everything and has big old floppy nuts, so I try to channel his dog as Bull,” DeVine said.\n\nBeck Bennett, who plays Bull’s arrogant Borzoi rival Sterling, said he mostly modeled his character after Bradley Whitford’s performance in Billy Madison.\n\n“I have a Yorkie/terrier/shih tzu mix, an incredible dog who is nothing like my character,” he said. “If anything, I thought about what kind of dog would piss my dog off, and tried to bring that to the record.”\n\nTartakovsky said one of his favorite episodes of Dexter’s Laboratory is when the boy genius invents a device to communicate with a lost dog, only to find that the animal’s thoughts just aren’t that deep. They basically amount to “Feed me now.”\n\n“You think a dog would be more complicated, but they’re just [saying] exactly what they want,” he said. “We have such an amazing relationship with our animals, and we imbue so much personality on them, and I don’t know if it’s true or not.”\n\nFixed is now streaming on Netflix.",
  "medium": "Article",
  "links": [
    "https://www.polygon.com/tv/2017/3/2/14536782/samurai-jack-best-episodes/",
    "https://www.chicago.gov/city/en/depts/dca/provdrs/chicago_festivals/news/2025/june/taste_of_chicago.html",
    "https://www.polygon.com/interviews/22642789/primal-season-2-genndy-tartakovsky-animation-emmys/",
    "https://dexterslab.fandom.com/wiki/Dexter%27s_Lab:_A_Story",
    "https://www.polygon.com/animation-cartoons/601193/genndy-tartakovsky-preview-fixed-netflix-samurai-jack/",
    "https://www.mlb.com/cubs/ballpark"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Genndy Tartakovsky",
      "weight": 0.07978673
    },
    {
      "name": "Tartakovsky",
      "weight": 0.077088214
    },
    {
      "name": "Primal creator Genndy Tartakovsky",
      "weight": 0.074848235
    },
    {
      "name": "dog",
      "weight": 0.068182744
    },
    {
      "name": "Charles Alfie",
      "weight": 0.051276788
    },
    {
      "name": "Genndy Tartakovskys Fixed",
      "weight": 0.049714837
    },
    {
      "name": "Fixed",
      "weight": 0.047956195
    },
    {
      "name": "characters",
      "weight": 0.04746015
    },
    {
      "name": "Bull",
      "weight": 0.04527292
    },
    {
      "name": "Saint Bernards",
      "weight": 0.045211677
    }
  ],
  "topics": [
    {
      "name": "Gaming"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Movies/Movie Reference",
      "score": 0.96337890625
    },
    {
      "name": "/Arts & Entertainment/TV & Video/Online Video",
      "score": 0.82470703125
    },
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.71826171875
    },
    {
      "name": "/Arts & Entertainment/TV & Video/TV Guides & Reference",
      "score": 0.438720703125
    },
    {
      "name": "/Arts & Entertainment/Movies/Action & Adventure Films",
      "score": 0.436767578125
    },
    {
      "name": "/Arts & Entertainment/TV & Video/TV Shows & Programs",
      "score": 0.4169921875
    },
    {
      "name": "/Arts & Entertainment/Movies/Science Fiction & Fantasy Films",
      "score": 0.32275390625
    }
  ],
  "sentiment": {
    "positive": 0.10933188,
    "negative": 0.56081873,
    "neutral": 0.32984936
  },
  "summary": "The animated Netflix movie, Fixed, by Genndy Tartakovsky, follows a mutt named Bull (Adam DeVine) who is about to undergo a neutering procedure. The film, which almost didn't get released due to its controversial R-rated content, was co-scripted and co-wrote with The Simpsons Movie writer Jon Vitti and was chosen for release by Netflix. The movie is based on Tartakov's friend group since high school, which he and his friends crafted exaggerated versions of their group. The cast includes Idris Elba, Bobby Moynihan, and Fred Armisen, with a beagle and dachshund influencer named Fetch. Along with inspiration for the film, Tartakovich also found inspiration for his own dogs.",
  "shortSummary": "Genndy Tartakovsky’s \"Fixed” is a deeply personal Netflix movie about a gay, dysfunctional Chicago dog club, inspired by his own experiences, nearly forgotten by Warner Bros.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "c5368b9e7a8348b08b6891fef8b9891e",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.chicago.gov/city/en/depts/dca/provdrs/chicago_festivals/news/2025/june/taste_of_chicago.html",
      "text": "City of Chicago Announces Full Schedule for 2025 Taste of Chicago, Including Grant Park and Neighborhood Celebrations\nTaste of Chicago to take place in Marquette Park (June 28), Pullman Park (July 19), and Albany Park (Aug. 9) featuring local food vendors, family activities, and Chicago SummerDance lessons\nCHICAGO — Mayor Brandon Johnson and the Department of Cultural Affairs and Special Events (DCASE) are proud to announce the return of Taste of Chicago, the City’s signature food and music festival, with a dynamic lineup of events across Chicago neighborhoods and a grand finale in Grant Park, Sept. 5–7, 2025. All events are free admission and open to the public.\n“Taste of Chicago is a celebration of everything that makes our city vibrant—our neighborhoods, our food and our music,” said Mayor Brandon Johnson. “This year’s Taste honors our communities, while also bringing the city together at our beautiful lakefront.”\nThis year’s Taste Main Stage will feature an electrifying mix of Grammy-winning and chart-topping talent: Lupe Fiasco, the Chicago-born rapper and cultural voice, headlines Friday; JoJo, the pop-R&B singer with powerhouse vocals, performs on Saturday; and international Latin superstar Elvis Crespo brings his high-energy merengue hits to close out the weekend on Sunday. Evening performances begin at 5 p.m. each night.\n“We’re thrilled to showcase the incredible culinary and cultural diversity of Chicago through this year’s Taste,” said DCASE Commissioner Clinée Hedspeth. “Whether you’re dancing in Albany Park or enjoying a sweet treat in Grant Park, Taste of Chicago is where Chicagoans come together to experience the flavor of our city. Each bite, beat, and moment reflects the rich stories and neighborhoods that make Chicago home.”\nIn addition to the Grant Park weekend, Taste of Chicago continues its tradition of celebrating the city's diverse communities through neighborhood pop-up events in Marquette Park (June 28), Pullman Park (July 19), and Albany Park (Aug. 9). Each location will feature beloved local food vendors, live music and dance performances and Chicago SummerDance programming — offering free dance lessons and music in various cultural styles.\nThis year’s Taste of Chicago will feature a total of 44 vendor booths, including 39 traditional food booths and an expanded Snack Shack section with four featured vendors — one more than in 2024. Additionally, 15 food trucks will be serving up diverse, on-the-go culinary experiences throughout the weekend. Of the total food participants, approximately 20% are new to Taste this year, including nine new food booth vendors and two new food truck vendors, offering fresh flavors and unique bites to explore.\n“Taste of Chicago is a celebration of the restaurants, chefs and cultures that shape our city’s vibrant food scene,” said Sam Toia, President and CEO of the Illinois Restaurant Association. “It’s a beloved tradition that brings together neighbors and visitors alike to experience the flavors of all 77 neighborhoods -- reminding us why Chicago continues to lead as the culinary capital of the world.”\nNew food vendors for Grant Part include Beat Kitchen Cantina, ChefLife19, Chillafry, Crave Cookies, Dao Thai Restaurant, Hubbard Inn, Khmai, Lexington Betty Smoke House and Thimi’s Empanadas. Returning food vendors include Eli’s Cheesecake, African Food Palace, BJ’s Market & Bakery, Churro Factory, Connie’s Pizza, Franco’s Ristorante, Harold’s Chicken #55, JJ Thai Street Food, Porkchop, Prime Tacos, Moore Poppin Gourmet Popcorn, The Original Rainbow Cone, Yum Dum, and so many more.\nTaste of Chicago 2025 is made possible through the generous support of its sponsors and partners, whose contributions help enhance the festival experience for all attendees. Featured sponsored areas include the Goose Island Stage, showcasing local and emerging musical talent, and the Disney Resorts Family Village, a lively destination offering family-friendly activities and entertainment throughout the weekend. Additional support is provided by Capital Vacations, Chicago Transit Authority, Disney Resorts, Eli’s Cheesecake, Goose Island Beer Company, Illinois Lottery, Millennium Garages, NRG Energy, and Pepsi — each helping to bring this beloved Chicago tradition to life.\nFor more information and the full event lineup, visit Chicago.gov/Taste and follow this flavorful festival on Facebook at the Taste of Chicago.\nTaste of Chicago Neighborhood Events:\nBefore the main event in Grant Park, Taste of Chicago hits the road with three vibrant neighborhood pop-up events celebrating the city’s rich cultural tapestry through local food, music, and dance. Each neighborhood event features a curated lineup of live entertainment, family activities, community partners, and Chicago SummerDance programming — bringing the joy of movement to parks and public spaces across the city.\nMarquette Park\n6743 S. Kedzie Ave.\nSaturday, June 28 | noon–8 p.m.\nThe Taste season kicks off in Marquette Park with a high-energy afternoon of music, including performances by ALäZ, Keya Trammell, and DJ Boolumaster, plus a reggaeton party with Perreo 101. Chicago SummerDance invites guests to hit the dance floor with footwork, steppin’, line dancing, and punta, led by local teaching artists.\nEmcees: Inner-City Muslim Action Network (IMAN) and Pinqy Ring\nPullman Park\n11101 S. Cottage Grove Ave.\nSaturday, July 19 | noon–8 p.m.\nSet against the historic backdrop of Pullman, this event features performances from Meagan McNeal & Friends, Johnny Blas and the Afro Libre Orchestra, and a day-long DJ set from Duane Powell. SummerDance styles include Bhangra, merengue, swing, and footwork — perfect for families and dancers of all ages.\nAlbany Park\nKimball Ave. between Lawrence & Leland\nSaturday, Aug. 9 | noon–8 p.m.\nKnown as one of Chicago’s most diverse communities, Albany Park’s Taste event offers a global soundtrack featuring Los Gaiteros de Pueblo Santo, Chicago Immigrant Orchestra, Surabhi Ensemble, and FUGU DUGU. Chicago SummerDance adds a cultural twist with sessions in cumbia, Bollywood, Mexican folk, and open dance led by DJ BMazed.\n###\nChicago Department of Cultural Affairs and Special Events\nThe City of Chicago Department of Cultural Affairs and Special Events (DCASE) supports artists and cultural organizations, invests in the creative economy, and expands access and participation in the arts throughout Chicago’s 77 neighborhoods. As a collaborative cultural presenter, arts funder, and advocate for creative workers, our programs and events serve Chicagoans and visitors of all ages and backgrounds, downtown and in diverse communities across our city — to strengthen and celebrate Chicago. DCASE produces some of the city’s most iconic festivals, markets, events, and exhibitions at the Chicago Cultural Center, Millennium Park, and in communities across the city — serving a local and global audience of 25 million people. The Department offers cultural grants and resources, manages public art, supports TV and film production and other creative industries, and permits special events throughout Chicago. For details, visit Chicago.gov/DCASE and stay connected via our newsletters and social media.\nIllinois Restaurant Association\nFounded in 1914, the Illinois Restaurant Association is a non-profit organization dedicated to promoting, protecting, educating and improving the restaurant industry in Illinois. The Association manages the food and beverage portion of Taste of Chicago for the Department of Cultural Affairs and Special Events. For more information, visit www.illinoisrestaurants.org and follow on Facebook, Twitter and Instagram."
    },
    {
      "url": "https://dexterslab.fandom.com/wiki/Dexter%27s_Lab:_A_Story",
      "text": "|\n|\n| |||\n| \"The Laughing\" | Premiere Order \"Dexter's Lab: A Story\" |\n\"Coupon for Craziness\" |\n| \"You Vegetabelieve It!\" | Production Order \"Dexter's Lab: A Story\" |\n\"Coupon for Craziness\" |\n| Dexter's Lab: A Story | |\n| Season 2, Episode 24a | |\n| Episode name reference to/pun on: The series Dexter's Laboratory and the word \"lab\" which, in this context, is short for \"Labrador retriever.\" | |\n|---|---|\n| Air date | January 28, 1998 |\n| Production number | 224a |\n| Written by | Paul Rudish |\n| Storyboard by | Paul Rudish |\n| Directed by | Genndy Tartakovsky |\nDexter's Lab: A Story is the first segment of the twenty-fourth episode in season 2 of Dexter's Laboratory. It first aired on January 28, 1998.\nIn this episode, Dexter meets a stray Labrador Retriever that follows him while he walks home from school. At first, Dexter couldn't understand what the dog is saying due to its constant barking, but he soon comes up with a plan to make the dog speak like a human. Unfortunately for Dexter, the dog's endless talking drives Dexter crazy, up to the point where he tries to reunite the dog with his owner.\nPlot[]\nDexter is walking home from school reading his math textbook until he passes by a labrador retriever that barks at him. After it runs a circle around him, Dexter pats the dog and tells it not to follow him. It does so for a few more feet, then it barks at Dexter once more, forcing him to race back home and into his laboratory, where the dog was waiting for him.\nAs Dexter reminds the dog about his laboratory, he is cut off as Dee Dee starts to laugh. Angered by her antics, the labrador retriever chases Dee Dee around, barking while doing so. After catching Dee Dee, the dog returns to Dexter and he plays fetch with it, using Dee Dee as the stick. Dexter praises and admires the dog while Dee Dee leaves feeling annoyed.\nDexter then leaves his lab to go get the dog something to eat, and Dad peers into Dexter's room as he was heading downstairs. In the kitchen, Dexter pulls out a box of Scooby Snacks, but he overhears Dad saying the word \"lab\" then runs upstairs to explain. In his room, Dexter sees Dad with the labrador retriever and gives it a hug as it licks his face.\nWhen Dad asks, Dexter tells him he's not ready for the responsibiities that come with owning a dog, but Dad ignores his remark and lets him keep the labrador retriever. Back inside Dexter's laboratory, the dog fetches Dexter various things, licks him while he wears a suit, and pulls a bone off a parasaurolophus model, causing it and the nearby triceratops head to fall to pieces.\nLater, while Dexter is using a wide computer, the labrador runs toward him barking, but he can't understand what it's trying to tell him. While walking away, Dexter wishes the dog would tell him what he's trying to say and speak simple English. Suddenly, he gets an idea and goes to invent an antibiotic that he puts on top of dog food.\nThe labrador eats away at the dog food, knocking the pill out of the bowl. Dexter notices it on the floor, then inserts it into the dog's mouth, making it swallow the pill. Dexter asks the dog if it understands him, and it does. The dog suddenly remembers what it was trying to tell Dexter about the \"thing\" it saw, but it doesn't make any sense.\nMom then calls everyone to the kitchen for dinner. Dexter takes his seat at the kitchen table while the dog bumps into Dad, Mom, and Dee Dee underneath the table. After Mom serves Dee Dee the chicken and rice, the dog sniffs around wanting food. Dexter tells Dad he already fed him, but Dad orders him to take the dog upstairs.\nThat night in bed, Dexter covers his ears while the dog yells out the window, causing the other dogs in the neighborhood to bark. In the morning, the dog pounces on Dexter's bed and tells him to get up. Dexter then stamps several flyers around the neighborhood, tells the dog it does not belong to him, and goes back home. Just as Dexter enters the front door, the phone rings and he answers. Not long after, the dog and his owner reunite and they both leave to take a ride as Dexter stares out the front door bewildered.\nCharacters[]\nQuotes[]\n- Dee Dee: I don't have to stick around for this.\n- Talking Dog: It's here! The thing! I found the thing and here it is! Here's the thing! Right here! A thing!\n- Talking Dog: It's the stick!\n- Talking Dog: Food for me? Food for me?\n- Mom: Now, now, no chickey and ricey for the puppy.\n- Dad: Now didn't we have a talk about your responsibilities today?\n- Dexter: We? Who's 'We'?\n- Talking Dog: Hey! Hey you dogs! I can hear you barking, I'm a dog! Can you hear me barking? Hey dogs listen to me! I can hear you! Hey! Hey! Hey you!\n- Talking Dog's Owner: Hey it's my dog, I found my dog!\n- Talking Dog: Hey it's my man, I found my man!\nTrivia[]\nCultural References[]\n- Dexter is seen with a box of Scooby Snacks, referencing Scooby-Doo, Where Are You!, one of Hanna-Barbera's most popular cartoons.\nProduction Notes[]\n- Dexter's home phone number is revealed to be 555-0100.\n- This episode is produced in 1997 according to the credits.\n- This episode would later replace the Dial M for Monkey episode \"Barbequor\" during reruns, the DVD release of season 1 and on digital streaming services such as HBO Max due to the controversy surrounding the episode."
    },
    {
      "url": "https://www.polygon.com/tv/2017/3/2/14536782/samurai-jack-best-episodes/",
      "text": "Jack is back.\nAfter 13 years, Samurai Jack is coming back to televisions everywhere with a fifth season that promises to wrap up the journey of the foolish samurai warrior wielding a magic sword, once and for all. Whether you’re an old fan looking to refresh your memory of the series before the new season hits on March 11, or someone who’s curious what all the buzz is about, this post should help.\nSamurai Jack follows the adventures of a lone samurai warrior, stranded in the future, seeking a way to return to his native time period. Jack isn’t even his real name, just the slang that was thrown his way shortly after he arrived in the time period. The show takes place in a variegated, dystopian future Earth: a planet filled with aliens as well as recognizable human cultures, monstrous creatures as well as recognizable earth animals, magic as well as robots — lots and lots of robots.\nThe appeal of Samurai Jack was never in dense plotting or cliffhanger endings, but in watching animators push their boundaries\nJack wields his father’s magic katana, the only weapon capable of harming the shapeshifting master of darkness — and overlord of this future earth — Aku. When Jack stepped forth to oppose Aku in the past, Aku flung him into the future, counting on the fact that he would be all-powerful before he had to reckon with the samurai again.\nJack seeks to return to the past and undo Aku’s future, but his compassionate and righteous nature leads him to offer aid to any who need it, sometimes to the detriment of his larger mission. Aku’s goals are to kill the samurai at all costs — and to destroy any means he might find of returning to the past. This push and pull between the show’s hero and villain fuel most of Samurai Jack’s 22-minute episodes (and a few two- and three-parters). Jack travels the world searching for time portals and wishing gems, doing good wherever he is needed, while Aku’s minions and the evil wizard himself dog Jack’s every step.\nThat said, Samurai Jack doesn’t really have a continuity, per se. Jack never ends an episode closer to the end of his quest than he was when it started. Episodes can be watched in practically any order, and there are no recurring characters other than Jack and Aku (with one single, memorable exception). Which makes it the perfect series for a Watch or Skip list — there’s no overarching narrative, just 40-some standalone stories, and it’s all available on Hulu.\nThe appeal of Samurai Jack was never in dense plotting or cliffhanger endings. It was in watching a team of writers and story-boarders craft a perfect samurai movie, trippy magical interlude, noir detective story or epic historical battle in only 22 minutes of set up, payoff, and resolution — often with virtually no dialogue. It was in watching a team of animators push the boundaries of the show’s hand-painted backgrounds and minimalist design to glorious lengths. Samurai Jack had the sort of deliberately slow pacing, stylized design and highly choreographed action sequences rarely seen in Western action, Western animated action, or Western animated action television.\nHere’s what to watch and what to skip in Samurai Jack\nThe Premiere Movie (S1:E1-E2)\nSamurai Jack premiered on Cartoon Network in 2001 with a 90-minute spot, showing the first three episodes of the series — “The Beginning,” “The Samurai Called Jack” and “The First Fight” — back to back. This is the place to start with the series, covering Jack’s origin story, his childhood training and his banishment to the future.\nBut you can skip S1:E3, “The First Fight.” It opens with a very cute training montage full of talking dogs, but a huge chunk of the episode is devoted to a slow and repetitive fight between Jack and a horde of robotic beetle warriors. This is something of a hallmark Samurai Jack’s first season: The show’s flare for dramatic staging and pacing is undeniable, but once Jack actually comes down to trading blows with an opponent, the fight scenes are unremarkable.\nThis improves greatly over the course of the series, and there’s no reason to subject yourself to it now. “The First Fight” ends in the same way every other episode of Samurai Jack ends: with Jack walking off into the sunset, neither further or closer to his goal.\nJack, the Woolies and the Chritchellites (S1:E4)\nHere, we have an introduction to the purest form of a Samurai Jack story in the show’s first stand-alone episode. Jack encounters a strange new culture and place, finds something wrong there and rights it, forging a new friend along the way — only to leave them behind as he continues on his lonely journey.\nJack and the Three Blind Archers (S1:E7)\nMost cartoon shows of its era waited at least a season or two before doing their first no dialogue episode. Samurai Jack barely has any dialogue to begin with, and in its second stand-alone episode it goes even further — an episode whose climactic battle completely lacks any sound.\nJack vs. Mad Jack (S1:E8)\nAfter setting up its main rivalry so spectacularly in its opening, it actually takes Samurai Jack until its ninth episode to directly involve Aku again. The episode follows the evil wizard essentially pulling Jack’s id out of him and making a Jack-shaped assassin out of it.\nVoice actor Phil LaMarr cited this specific episode as the place he went to when crafting an older, wearier Jack for the new season, so that alone makes it worth a rewatch.\nJack and the Scotsman (S1:E11)\nAgainst the quiet, un-talkative samurai, place Samurai Jack’s only recurring character: the loud, motormouthed Scotsman. He has a machine gun for a peg leg.\n“Jack and the Scotsman” is an old story: Two dissimilar warriors meet, they fight, and when they are handcuffed together they must work together to defeat a larger enemy, while bickering the entire way. Show creator Genndy Tartakovsky has confirmed that the Scotsman will return in the final season of the show, so you should brush up on his appearances — the closest thing the show ever has to a continuity.\nAku’s Fairy Tales (S1:E13)\n“Aku’s Fairy Tales” is a glimpse into an alternate universe where Samurai Jack was not renewed after its initial 13-episode order. With no way to know whether they’d get to extend Jack’s adventures beyond one season or not, the folks behind the show managed to create an episode with all the catharsis of a full series wrap up — but without actually wrapping anything up.\nIt’s also just very funny to watch Aku attempt to rewrite fairy tales so that he is the world’s savior — as a group of bored children pester him to tell them about their greatest hero, the samurai called Jack.\nJack Learns to Jump Good (S2:E1)\nJack is unable to reach a time portal because he cannot jump high enough, but a tribe of benevolent and peaceful primates train him in their ways of jumping good.\nI promise you, this basic plot is one of the most delightful and compelling episodes of Samurai Jack.\nJack and the Scotsman II (S2:E4)\nThe Scotsman returns.\nJack Remembers the Past (S2:E6)\nIn his travels, Jack discovers the ruins of his now-ancient civilization and his childhood home, and we are treated to several heartwarming vignettes of Jack’s adventures as a child — a tiny, innocent version of our samurai, before Aku destroyed his home and he spent his adolescence training to defeat him. Also, there’s totally a cameo from Ogami Ittō and Daigorō from Lone Wolf and Cub.\nJack is Naked (S2:E11)\nWhat it says on the tin. A white rabbit steals Jack’s clothing and he spend the entire episode running naked through a strange wonderland, trying to get them back.\nJack and the Spartans (S2:E12)\nSamurai Jack’s first Emmy-winning episode — and one of its only episodes to be entirely letterboxed into widescreen — is a better reimagining of the Battle of Thermopylae than either Frank Miller or Zack Snyder have been able to produce.\nPlus, it has robot minotaurs on tank treads.\nJack’s Sandals (S2:E13)\nThe elements of Jack’s ensemble are simple and few — his sword, his nagaki, the fundoshi beneath it (to preserve his modesty when the nagaki inevitably gets trashed by an enemy), his straw hat and his geta sandals — and yet Samurai Jack uses every part of the wardrobe buffalo.\nHow else do you explain a charming episode that revolves entirely around Jack’s geta being destroyed by a roving biker gang? The samurai’s search for new footwear eventually leads him to a family who, though they live in the future, lovingly preserve a culture he finds very familiar. Just like the close of the first season of the show, “Jack’s Sandals” gives us a welcome look at what life is like for normal people at “peace” in Aku’s world — and how the wandering samurai warrior’s heroics proceed him.\nChicken Jack (S3:E1)\nIn this episode, a wizard turns Jack into a rooster for no reason — and he is scooped up by the unscrupulous boss of an underground robot animal fighting ring and forced to compete without hope of escape — until he bumps into the wizard again and is turned human for, again, really no reason. Then the episode ends.\nIt’s amazing.\nJack and the Zombies (S3:E4)\nJack and the Zombies is remarkable for being the only episode in the four original seasons of Samurai Jack in which Jack fights and destroys a horde of something other than robots.\nAlso Aku steals Jack’s sword, in order to destroy it so that he will be truly invincible, so that’s pretty high stakes.\nJack and the Traveling Creatures (S3:E7)\nSamurai Jack’s second Emmy-winning episode is also the closest the show has ever come to revealing Jack’s eventual fate — until now. Its a much watch, if only to see whether Genndy Tartakovsky has really known how all of this was going to end since 2003.\nJack and the Creature (S3:E7)\nJack finds an adorable but somewhat infuriating creature that begins to follow him on his travels.\nAlso, that creature is clearly Totoro, from My Neighbor Totoro.\nJack and the Haunted House (S3:E9)\nSamurai Jack has its standard episodes, and it has its wild divergences in tone and genre. In “Jack and the Haunted House,” that divergence is the ghost story, and the show plays upon that theme as well as it does everything else — and with a brand new this-episode-only art style, as well.\nThe Birth of Evil (S3:E11-12)\nSamurai Jack began with a nearly complete history of Jack’s life. At the end of its third season, we finally get an origin for its antagonist, Aku. In the two installments of “The Birth of Evil,” we find out how Jack’s sword came to be, how his father managed to defeat Aku a first time. We also learn about how his parents resolved to create at global network of enlightened warriors to train their son to defeat Aku, should he ever rise again.\nSamurai vs. Ninja (S4:E1)\nAsk me to show you a visually arresting episode of Samurai Jack that pushes “simplistic design” and “fight scene staging” to an incredible zenith, and I’ll put on “Samurai vs. Ninja.” It would take about fifty words to describe the visual trick of this episode, when you could just watch it and be amazed when you realize exactly how things are about to go down.\nJust watch it.\nThe Scotsman Saves Jack: Part I & II (S4: E6-7)\nFinally, Samurai Jack’s only recurring secondary character gets his own two-parter. After finding an amnesiac Jack, the Scotsman sets out on a quest to find what caused his heroic friend’s memory loss and cure it — all while defending a defenseless Jack from all of Aku’s bounty hunters who still want to kill him.\nSeasons of Death (S4:E10)\n“Jack faces four different menaces on different seasons of the year,” reads the Wikipedia description of this episode. It’s a simple sentence that belies a masterfully crafted 22-minutes of television — an achievement recognized with the show’s final (so far) Emmy. The four vignettes of “Seasons of Death” are each a full episode of Samurai Jack in microcosm. Each one is themed to a season of the year, each one shows Jack triumphing over an obstacle, and each subtly showcases a different aspect of Jack’s heroism and the tonality of the show overall.\nTale of X9 (S4:E11)\n“Tale of X9” is the only episode of Samurai Jack in which Jack is not the main character, and one of the most extreme breaks in structure the show has ever done (and two episodes before it would end, no less).\nIt’s a narration-heavy noir detective story set in the Samurai Jack universe, where our “Sam Spade” is a robot detective named X9 who is blackmailed out of retirement by Aku for one last hit.\nThink of this as the Brick of Samurai Jack. What happens to a Samurai Jack story when the assassin trying to kill Jack is our hero? I won’t spoil the ending.\nJack and the Baby (S4:E13)\nIf you’re expecting the final episode of Samurai Jack’s fourth season to be something of significance to its overall story, reign in those assumptions. “Jack and the Baby” is simple: Jack has to take care of a baby. The beating heart of this episode is Jack retelling the story of the Japanese folk hero Momotarō, but it doesn’t really come together as a whole until the punchline of its final moment."
    },
    {
      "url": "https://www.polygon.com/interviews/22642789/primal-season-2-genndy-tartakovsky-animation-emmys/",
      "text": "Genndy Tartakovsky is an animator’s animator. Over the course of 30 years, the Russian-American animator and director has amassed a career of enviable accolades and creative success, from working on such shows as The Powerpuff Girls and Batman: The Animated Series to his immensely popular original series in the case of Dexter’s Laboratory, Samurai Jack, and Star Wars: The Clone Wars.\nHis latest series Primal is arguably his most audacious yet. In the pulp adventure, a mute caveman known as “Spear” forms an unlikely bond with a Tyrannosaurus known as “Fang” while surviving in a fantastical prehistoric world filled with deadly creatures. Season 1, which wrapped last November, earned Tartakovsky a nomination for the 2021 Emmy for Outstanding Animated Program.\nAhead of this year’s Emmy Awards voting, which ends on Monday Aug. 30, Polygon spoke with Tartakovsky on his inspirations for creating Primal and what he hopes to achieve through the series’ forthcoming second season.\n[Ed. note: This interview has been edited and condensed for clarity.]\nThe first season of Primal feels like a big experiment; it’s 10 episodes of predominantly non-dialogue-driven action and character development. What did you learn from the creation of season 1, and how are you going harder or changing things up in season 2?\nFor us, the first 10 episodes are what we think of as one season. But the second five episodes, once we got through the first five and we were seeing the episodes come to life, we started to realize we could do stories that were more complex. When you’re doing episodes with no dialogue you’re like, How much can we really get across story-wise? And then we realized there was a lot that we could do. So for the second five, we started to really mess around with more complex stories, especially in the “Coven of the Damned” episode, where we have the flashbacks to everyone’s origins and this really complex emotional thing of the babies and the loss and the death. It was really fun to tell stories that way. We never intended for the show to be a “Monster of the Week”-type show.\nYou’ve said Robert Howard’s Conan the Barbarian series and the paintings of Frank Frazetta were key inspirations for the look and feel of Primal’s first season. What art and stories are inspiring the series’ second season?\nThe second season is … I don’t know if it’s a departure, but it is an evolution of what we did in the first season. It feels the same, I think, but it’s completely different in a way where there’s just more emotion, more complex storytelling, but still very simple in that there’s still either no dialogue or very sparse dialogue like we had in the first season.\nWhat I got from Robert Howard’s Conan books and his other writing is, he was a pulp writer in the ’20s. Those were always short stories; he trimmed the fat, there’s no novel-like exposition of things. They usually start with Conan, he’s in the desert with some girl, and they come upon a creature and they have to fight their way out. Those stories really connected with me because we make cartoons, right? So usually they’re short. Reading Howard’s work really connected with me because of his terse approach to storytelling because this is so much of what we do as animators, but with an emphasis on visuals and no dialogue.\nSo for the second season, we wanted more; we want it to evolve. We didn’t want to just do 10 more minor variations on the first season. This genre has been done so much. I wanted to do something different and push the genre out of the clichés associated with it as much as we could. And the second season is pushing out of the cliché. It’s really exciting because I haven’t really done anything like this. I’m not going to give anything away, because the more of a surprise it is, the more fun it’s going to be to watch. But we pushed ourselves story-wise to be more unconventional.\nWhat sort of clichés do you see season 2 of Primal explicitly pushing against?\nIt’s gonna be a little hard without giving anything away [laughter]. But let’s see … if we were to elevate Primal into a barbarian adventure, or a sword-and-sorcery-type story, it could live in that world but still get away from clichés, I think. Whenever you think of Stargate or 10,000 BC, the stories often gravitate to some kind of overlord scenario, some villain with thousands of slaves and that type of thing. I think in my very, very first development of the story of Primal, I had something like that. With a Pharaoh type of situation, but I quickly got away from it. It’s sort of like, you take everything from this genre and we had a tendency to go there, because it feels natural. But then you start to think about all the things that have been done in this genre, and you’re like No, we’re just rehashing and doing it in our way, we have to come up with something more unique. That’s as much as I can say at the moment though, it’s really hard to say anything more without giving everything away.\nBased on what happens at the end of season 1 and where you’re going in season 2, what do you hope to say through the story of Primal? What are the overarching themes you want to convey to the audience?\nI think it’s always been survival and evolution. The surviving part is easy, right? You just want to live. But the evolution part is complex. And even more so without dialogue, without pontificating in a scene where Spear is sitting down and just saying, “What is my place in the world?”\nHow do you do that visually? That was the thing we most wanted to do. It’s always been about that to a degree, Spear’s evolution as a character. That’s what we’re focusing on and that’s what I wanted to say. At the end of the day, you have these 20 episodes, and what you see there is an evolution.\nPrimal season 1 is available to stream on HBO Max."
    },
    {
      "url": "https://www.polygon.com/animation-cartoons/601193/genndy-tartakovsky-preview-fixed-netflix-samurai-jack/",
      "text": "Fifteen years after Emmy-winning Samurai Jack, Primal, and Star Wars: Clone Wars creator Genndy Tartakovsky sold his raunchy animated comedy Fixed to Sony, the movie will finally be released on Netflix on Aug. 13. The long journey to make the film, which Tartakovsky describes as an R-rated version of Lady and the Tramp, involved changing production studios — and fighting for the prominence of his canine characters’ genitals.\nFixed was produced by Sony Pictures Animation, where Tartakovsky completed the work in 2023. Warner Bros.’ New Line Cinema was scheduled to release it theatrically in 2024, but Warner Bros. Discovery shelved it as part of the same cost-cutting wave that stopped the releases of Coyote vs. Acme and The Day the Earth Blew Up: A Looney Tunes Movie. Tartakovsky pitched Fixed around to other distributors, and he says John Derderian, Netflix’s vice president of animation series, saw the film and loved it.\n“I think you always need a champion in these kinds of instances,” Tartakovsky told Polygon via video call. “If you look at streaming, Fox, or Adult Swim, adult animation is probably the most successful it’s ever been. But that hasn't translated over into theatrical. Because [mainstream adult animation in America is] new, everybody’s kind of unsure of how to take the risk. I think the audience that would watch it on TV would watch it theatrically, but I don’t have the focus groups or testing to back it up.”\nThe R-rated film follows Bull (Adam DeVine of The Righteous Gemstones), a mutt who learns he’s scheduled to be neutered, and decides he needs one last wild night out with his best friends.\n“He has kind of a false sense of security about his balls, like Samson and his hair, like it’s what makes [him] funny,” Tartakovsky said. “His friends have been neutered, and they’re just normal, but if I was going to get that surgery, I’d be pretty freaked out about it too.”\nBecause Bull’s testicles are so important to the plot, they’re also pretty visible in the film, which Tartakovsky said he had to fight for.\n“My theory is that it’s going to be a little shocking in the beginning, but then you get used to it, like going to a nude beach,” he said.\nTartakovsky did have to tone down the genital animation a bit, along with how the dogs’ rectums are depicted.\n“After our first test screening, we had a very serious discussion about it,” Tartakovsky said. “Our butthole is just a circle with a little X in it, or an asterisk, not drawn like a disgusting anus or anything. It’s like in real life, where the dog’s tails are up and you see the butt. So we colored them a bit more subtly, so you wouldn’t have a dark butthole on a white dog.”\nThe stylized, over-the-top animation is reminiscent of John Kricfalusi’s The Ren & Stimpy Show and its many stylistic followers. Tartakovsky says he’s a fan of that series, but any similarity between Kricfalusi’s work and Fixed goes back to the inspirations he and Kricfalusi share: classic Warner Bros. cartoons and characters, including Popeye and Tom & Jerry. Tartakovsky assembled a team of animators from around the world to mesh that Warner Bros. look with the work of Tex Avery, who helped create core Looney Tunes characters like Daffy Duck and Elmer Fudd. Tartakovsky’s childhood favorites included Avery’s deadpan basset hound Droopy, and his 1950 short Ventriloquist Cat.\n“It’s one of the styles that I trained in when I was first starting out, and that I love to do,” Tartakovsky said. “We don’t have big googly-eyed takes or anything like that. It’s much more controlled. And it’s a very different language, because our dogs walk like dogs. I didn’t want hand gestures. I didn’t want to make a Hanna-Barbera cartoon.”\nBeneath the adult humor, Fixed is a love story about Bull finding the courage to share his feelings for Honey (Agatha All Along star Kathryn Hahn), the beautiful show dog next door.\n“She’s like twice as tall as him, so he doesn’t think he could get her,” Tartakovsky said. “He thinks they’re just friends. It’s kind of heartfelt. This movie has raunchiness, really funny characters, and great hand-drawn animation. I think it’s really unique, and I’m excited for it to get out there.”\nFixed will debut on Netflix Aug. 13."
    }
  ],
  "argos_summary": "Genndy Tartakovsky's new animated film, Fixed, follows a mutt named Bull who, facing neutering, embarks on a wild night with friends. Initially shelved by Warner Bros., the R-rated film was picked up by Netflix after Tartakovsky fought for its release and made necessary edits for approval. The film features exaggerated canine characters and blends raunchy humor with heartfelt moments, showcasing Tartakovsky's unique animation style and personal inspirations from his own life and friendships.",
  "argos_id": "KXCVF2ECC"
}