{
  "url": "https://finance.yahoo.com/news/wise-joins-hands-google-remittance-115533154.html",
  "authorsByline": "GlobalData",
  "articleId": "764c3a655da242ecb376300d1ab78332",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://s.yimg.com/ny/api/res/1.2/tn.sD_O_gHjXtwP1X_vMlg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU7Y2Y9d2VicA--/https://media.zenfs.com/en/electronic_payments_938/95cdfb67ca417def6dc777a60d49de29",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-13T11:55:33+00:00",
  "addDate": "2025-08-13T12:19:49.729140+00:00",
  "refreshDate": "2025-08-13T12:19:49.729142+00:00",
  "score": 1.0,
  "title": "Wise joins hands with Google for remittance services in US",
  "description": "Users intending to transfer money internationally can now do so by accessing Wise's services through Google Wallet.",
  "content": "Payments firm Wise has announced its integration with Google to enhance remittance services for consumers in the US.\n\nThe service, which is currently in a testing phase for Google users in the US, leverages Wise Platform, the company's infrastructure designed to facilitate global payments for banks and enterprises.\n\nUsers intending to transfer money internationally can now do so by accessing Wise's services through Google Wallet online or by searching for specific currency exchange rates via Google Search.\n\nThis remittance solution focuses on popular currency routes from the US dollar to the Indian Rupee (INR), Philippine Peso (PHP), Mexican Peso (MXN), and Brazilian Real (BRL).\n\nGoogle will provide users with the ability to compare fees and transaction speeds across various providers, including Wise, within the search results.\n\nWise Platform is known for powering international payment services for several financial institutions as well as digital platforms such as Morgan Stanley, Standard Chartered, Brex, and Ramp.\n\nWise Platform Commercial Director Lauren Langbridge said: “We’re thrilled to collaborate with Google in helping to bring this new remittance experience to life.\n\n“By joining forces with Google, Wise will enable fast, reliable international payments for more users across the US, and empower everyday people to make the best choice based on their needs.”\n\nIn March, Wise facilitated international payment services for Spendesk, a spend management and procurement platform, serving over 5,000 businesses.\n\nThe integration with Spendesk allows companies within the European Economic Area and the UK to manage payments and reimbursements through a centralised dashboard, offering the facility to handle invoices and expenses in 30 different currencies at the “mid-market exchange rate”.\n\n\"Wise joins hands with Google for remittance services in US \" was originally created and published by Electronic Payments International, a GlobalData owned brand.\n\n\n\n The information on this site has been included in good faith for general informational purposes only. It is not intended to amount to advice on which you should rely, and we give no representation, warranty or guarantee, whether express or implied as to its accuracy or completeness. You must obtain professional or specialist advice before taking, or refraining from, any action on the basis of the content on our site.",
  "medium": "Article",
  "links": [
    "https://www.electronicpaymentsinternational.com/news/spendesk-wise-platform-global-payments/",
    "https://www.electronicpaymentsinternational.com/news/wise-google-remittance-us/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "international payment services",
      "weight": 0.102357395
    },
    {
      "name": "Payments firm Wise",
      "weight": 0.09900209
    },
    {
      "name": "Google users",
      "weight": 0.09633898
    },
    {
      "name": "remittance services",
      "weight": 0.091603845
    },
    {
      "name": "Wise Platform",
      "weight": 0.090782546
    },
    {
      "name": "Google Wallet",
      "weight": 0.08433772
    },
    {
      "name": "Wise Platform Commercial Director Lauren Langbridge",
      "weight": 0.083528325
    },
    {
      "name": "Google",
      "weight": 0.08287788
    },
    {
      "name": "Wise",
      "weight": 0.08241867
    },
    {
      "name": "Google Search",
      "weight": 0.08186482
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.89990234375
    },
    {
      "name": "/Finance/Banking/Other",
      "score": 0.541015625
    }
  ],
  "sentiment": {
    "positive": 0.48479134,
    "negative": 0.0397941,
    "neutral": 0.4754146
  },
  "summary": "Payments firm Wise has partnered with Google to enhance remittance services for consumers in the US. The service uses Wise Platform, the company's infrastructure designed to facilitate global payments for banks and enterprises. Users can transfer money internationally via Google Wallet or search for specific currency exchange rates via Google Search. The partnership allows users to compare fees and transaction speeds across various providers. This collaboration follows Wise's recent successful integration with Spendesk, a spend management platform serving over 5,000 businesses.",
  "shortSummary": "Wise Platform integrates Google Wallet with Wise Platform to enhance US remittance services, enabling seamless international payments and seamless transactions across various currencies via Google Wallet and Google Search.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "9213cfe84f264cec9071fd1fd719b1da",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Payments firm Wise is integrating with Google to enhance remittance services for US consumers, currently in testing. This collaboration allows users to transfer money internationally via Google Wallet and compare fees and transaction speeds for various providers, including Wise. The service focuses on popular currency routes such as USD to INR, PHP, MXN, and BRL, aiming to provide fast and reliable international payments.",
  "argos_id": "KY8YNGK48"
}