{
  "url": "https://www.morningstar.com/news/globe-newswire/9511743/aeronero-deep-tech-raises-15m-in-landmark-round-led-by-callapina-capital-and-rezwan-razack-of-prestige-group-to-scale-air-water-tech",
  "authorsByline": "",
  "articleId": "6e6d7e2d404341d0898872bd48f7d838",
  "source": {
    "domain": "morningstar.com",
    "location": {
      "country": "us",
      "state": "IL",
      "county": "Cook County",
      "city": "Chicago",
      "coordinates": {
        "lat": 41.8755616,
        "lon": -87.6244212
      }
    }
  },
  "imageUrl": "https://images.contentstack.io/v3/assets/blt4eb669caa7dc65b2/blta7dd42ebdd7b93b8/61899b34a3c7df383578294c/morningstar-og.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-13T07:28:07-05:00",
  "addDate": "2025-08-13T13:21:10.046471+00:00",
  "refreshDate": "2025-08-13T13:21:10.046472+00:00",
  "score": 1.0,
  "title": "Aeronero Deep Tech Raises $1.5M in Landmark Round Led by Callapina Capital and Rezwan Razack of Prestige Group to Scale Air Water Tech",
  "description": "Aeronero Deep Tech Raises $1.5M in Landmark Round Led by Callapina Capital and Rezwan Razack of Prestige Group to Scale Air Water Tech",
  "content": "CHENNAI, India, Aug. 13, 2025 (GLOBE NEWSWIRE) -- Aeronero, a pioneering deep-tech innovation company revolutionizing the future of water through science-led technology, has secured USD 1.5 million in its first-ever funding round. The raise was led by Callapina Capital and co-invested by Rezwan Razack, MD of Prestige Properties (Razack Family Trust), SAN ANGELS, Jamwant Ventures, and marquee HNIs including Kiran Deshpande (Former CEO, Tech Mahindra) and S. Ramadorai (Former CEO & Vice Chairman, TCS).\n\nThis capital injection marks a significant inflection point for the Chennai-headquartered startup, which has developed a suite of Air Water solutions that generate clean, alkaline, drinkable water directly from the atmosphere. Aeronero's flagship systems are already deployed across homes, offices, and military outposts in India and abroad, addressing severe water scarcity in regions where traditional sources are failing.\n\nAt the heart of the company’s mission is its guiding principle: Water for All, Always. The company’s Founder & CEO, Dr. Durga Das—a former professional athlete recently honored with a Doctorate in Technology and Innovation—shared, “This funding marks a pivotal moment for us. Water scarcity is not just a crisis—it’s a call to reimagine the systems that sustain life. With the right science, scale, and partners, we’re not just building machines—we're building a global movement toward water independence.”\n\nBacked by 13 global patents (many already commercialized) and a robust research-driven platform, Aeronero has achieved 400% YoY growth in the past year. The company currently holds an order book of nearly ₹30 crore and is rapidly scaling its in-house manufacturing capacity to produce 2,000 units per month, with a ₹100 crore topline in its sights.\n\nVinod Jose, General Partner at Callapina Capital, noted, “After tracking Air Water generation for three years, we believe this is the most disruptive innovation the water sector has seen in a century. Aeronero’s decentralized, patent-backed model and visionary leadership position them to lead the global AWG market. They’re answering a fundamental question: Can we source water without extracting it from overburdened natural ecosystems? The answer is yes—and it’s in the air.”\n\nPrestige Group, one of India’s leading real estate developers, sees the collaboration as a critical step toward sustainable infrastructure integration. Rezwan Razack, MD of Prestige Properties (Razack Family Trust), remarked, “We’ve engaged deeply with Aeronero and are excited by the promise their innovations offer. Our investment reflects our confidence in Durga’s vision and Aeronero’s potential to reshape water sustainability across the communities we serve.”\n\nThe startup has also gained endorsements from leading industry figures. Kiran Deshpande shared, “We are proud users of Aeronero’s ‘Bubble’ system. The water is pure, alkaline, and ideal for drinking. Durga and her team are doing phenomenal work in creating sustainable, decentralized water systems.”\n\nEchoing this sentiment, S. Ramadorai added, “Aeronero is visionary and scientific in equal measure—creating drinkable water from thin air. Their platform is not only efficient but smart and internet-enabled. It’s a scalable solution to one of humanity’s oldest challenges.”\n\nJamwant Ventures, another investor in this round, emphasized the strategic significance of Aeronero’s work in national resilience. “Our investment in Aeronero aligns with our belief in Atma Nirbhar Bharat—backing innovations that strengthen India’s defense and sustainability infrastructure,” the firm stated.\n\nAs climate change and urbanization continue to place immense stress on traditional water infrastructure, Aeronero is stepping into a leadership role in redefining how the world sources its most critical resource. Its fully Made-in-India solutions span from smart household units to large-scale industrial systems, all engineered for decentralized deployment.\n\nWith its latest funding and a growing coalition of strategic backers, Aeronero is poised to lead a water-secure future—one where clean, safe drinking water flows not from a pipe, but from the air itself.\n\nDisclaimer: This content is provided by AeroNero. The statements, views, and opinions expressed in this column are solely those of the content provider. This media platform provides the content of this article on an \"as-is\" basis, without any warranties or representations of any kind, express or implied. We do not assume any responsibility or liability for the accuracy, content, images, videos, licenses, completeness, legality, or reliability of the information presented herein. Any concerns, complaints, or copyright issues related to this article should be directed to the content provider mentioned above.\n\nA photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/3a2bed92-fc38-4faf-92c8-d8bc727195df",
  "medium": "Article",
  "links": [
    "https://www.globenewswire.com/NewsRoom/AttachmentNg/3a2bed92-fc38-4faf-92c8-d8bc727195df/en",
    "https://www.globenewswire.com/Tracker?data=dO3XaKP6XeTR4S2k7zV02X4IwpW6j24XhW2r5G49A0HKoA0LNl3sivAcLuXvzeQ_LiZrGBIbL6tiQyLjy6eFVkqbCzSaERWc9UcnU5b_1kZXFXEtOzlIuZbmU3N3SqHRP-yly63CpMdGbIM0y0IveLxvem7WIjSFYOAGYD_hPDnX3JpJQKGsuW4bv4pwew3zGYyYD60JdHygHuc5E_Ol9_GwqSxcIjGqSYnyuUtUq0yhmMFqyHlSkZT4t_KXzkIBRpDv9hv4aSmmKnT1mLabQw==",
    "https://www.globenewswire.com/Tracker?data=dO3XaKP6XeTR4S2k7zV02aJax1Vn8oprlUCNi5zkj7zSMCfFWanm3HnB0LbBCxlcY7Rv1aCQGb-e-ouw4tH83XEq_KKCkrImZQnxriOvYzU=",
    "https://www.globenewswire.com/Tracker?data=476qufDSrnwXaNMOdvPKbcwFc3bPC3dLtUjKfdNrDb0XbTL6TBJ1ufHn_Bjj-eFOjY5swBRAW5F6uHxzqKjv-cVoJMAdZufWEiT-CDRg5Ps=",
    "https://www.globenewswire.com/NewsRoom/AttachmentNg/10a0fb4a-6087-4b9b-af17-cc3092012b8f"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "traditional water infrastructure",
      "weight": 0.082906395
    },
    {
      "name": "water sustainability",
      "weight": 0.082705274
    },
    {
      "name": "drinkable water",
      "weight": 0.08235565
    },
    {
      "name": "Water scarcity",
      "weight": 0.08212029
    },
    {
      "name": "Water",
      "weight": 0.080595024
    },
    {
      "name": "water",
      "weight": 0.080595024
    },
    {
      "name": "severe water scarcity",
      "weight": 0.07873892
    },
    {
      "name": "water independence",
      "weight": 0.07822892
    },
    {
      "name": "Aeronero",
      "weight": 0.07560514
    },
    {
      "name": "Aeronero Deep Tech",
      "weight": 0.07375441
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.9931640625
    },
    {
      "name": "/News/Technology News",
      "score": 0.5927734375
    },
    {
      "name": "/Business & Industrial/Energy & Utilities/Renewable & Alternative Energy",
      "score": 0.427734375
    },
    {
      "name": "/Business & Industrial/Business Finance/Venture Capital",
      "score": 0.39501953125
    },
    {
      "name": "/Business & Industrial/Energy & Utilities/Other",
      "score": 0.367431640625
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.325927734375
    }
  ],
  "sentiment": {
    "positive": 0.8705264,
    "negative": 0.020194821,
    "neutral": 0.10927884
  },
  "summary": "Aeronero, a deep-tech innovation company in India, has secured its first-ever funding round with a total of $1.5 million led by Callapina Capital and Rezwan Razack of Prestige Group. The money was co-invested by major HNIs including Kiran Deshpande (Former CEO, Tech Mahindra) and S. Ramadorai (former CEO & Vice Chairman, TCS). This investment marks a significant inflection point for the Chennai-based startup, which has developed a suite of Air Water solutions that generate clean, alkaline, drinkable water directly from the atmosphere. Aeronero's flagship systems are already deployed across homes, offices, and military outposts in India and abroad, addressing severe water scarcity in regions where traditional sources are failing. The company's Founder & CEO, Dr. Durga Das, a former professional athlete, shared that this funding marks a pivotal moment for the company. Backs with 13 global patents and a robust research-driven platform, AeronERO has achieved 400% YoY growth in the past year.",
  "shortSummary": "Aeronero, a deep-tech innovation company creating clean, alkaline water from the atmosphere, secured a $1.5 million funding boost to expand its global operations.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "203c58b6af7a4606bf542f240ae7d9e3",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.globenewswire.com/Tracker?data=dO3XaKP6XeTR4S2k7zV02aJax1Vn8oprlUCNi5zkj7zSMCfFWanm3HnB0LbBCxlcY7Rv1aCQGb-e-ouw4tH83XEq_KKCkrImZQnxriOvYzU=",
      "text": "From sustaining the smallest households to powering the largest industries, we want to\ncreate a water-secure planet\nEmpowering sustainable living with cutting-edge air-to-water technology, providing clean, accessible water to communities while combating climate change.\nthat condenses water vapour\nto remove impurities\nto remove colour, odour, and taste\nto eliminate Bacteria\nto ensure alkaline water\npH 7-8.5\nAeronero’s products generate pure alkaline rich water, that contain no bacteria, viruses or chemicals. Read our reports to know more\nAeronero products are equipped with cutting-edge technology, delivering real-time data for enhanced performance and monitoring.\nGet live updates and monitor the water levels and humidity\nReceive instant notifications for important updates\nStay on top of your service schedules to avoid downtime\nTrack machine performance and metrics directly from your app\nSolutions Delivered\nLives Benefited Till Date\nLitres of Water Generated Till Date\nLitres of Water Saved Till Date\n| Parameter | Aeronero Water | RO Water | Bottled Water |\n|---|---|---|---|\n| Ground Water | Saves Ground Water | Polluting & Exhausting Ground Water | Depleting Ground Water |\n| Air Purification | Cleans the Air | NA | NA |\n| Carbon Footprint | Low | High | High (Transportation also required) |\n| Plastic Pollution | Nil | High | High |\n| Water Wastage | Nil | More than 50% | More than 50% |\n| Spreading of Microbes | Minimised by Reducing the Medium | No Change | High due to Handling by Humans |\n| Cost per Litre Rs | Rs. 3.5 | Rs. 4 | Rs. 4 |\n| Parameter | Aeronero Water | RO Water | Bottled Water |\n|---|---|---|---|\n| Ground Water | Saves Ground Water | Polluting & Exhausting Ground Water | Depleting Ground Water |\n| Air Purification | Cleans the Air | NA | NA |\n| Carbon Footprint | Low | High | High (Transportation also required) |\n| Plastic Pollution | Nil | High | High |\n| Water Wastage | Nil | More than 50% | More than 50% |\n| Spreading of Microbes | Minimised by Reducing the Medium | No Change | High due to Handling by Humans |\n| Cost per Litre Rs | $ 0.042 | $ 0.048 | $ 0.048 |\nWe would love to hear from you! Reach out to us for inquiries, partnerships, and collaboration.\nFrom sustaining the smallest households to powering the largest industries, we want to create a water-secure planet.\nAeronero\nAll rights reserved.\nHead – Production\nDixon is a seasoned refrigeration expert with extensive experience in the Middle East and India, specializing in advanced cooling and heat exchange technologies. He played a pioneering role in developing the first Atmospheric Water Generator (AWG) in the country, demonstrating his innovative approach to sustainable water solutions. With a deep understanding of refrigeration systems, he has contributed to cutting-edge cold storage solutions, enhancing food preservation and logistics. His expertise spans heat exchangers, energy-efficient cooling systems, and large-scale HVAC projects. Dixon’s commitment to excellence and innovation has established him as a thought leader in refrigeration and climate control technologies.\nHead of Sales (G)\nWith 18 years of experience in sales and marketing, Hilda Phillip has developed a strong expertise across the health, technology, and water industries. She holds a BA from the University of Pennsylvania and furthered her education with advanced studies in Information Systems Auditing at the Hong Kong University of Science and Technology, as well as a specialized IT Automation course at Google.\nHilda is also an accomplished athlete with eight national awards in athletics and a passionate sailor and biker. In her professional career, she has consistently demonstrated success as a Business Development Manager, driving growth and delivering results. Known for her leadership, negotiation skills, and customer service expertise, Hilda combines ambition, motivation, and a results-oriented approach. In her most recent role, she successfully secured Rs 167 Cr in business, achieving a bottom-line profit of Rs 17 Cr FY2024\nCFO\nVisionary leader with 20+ years driving transformation in finance, strategy, and global P&L management. Currently CFO at MGA Entertainment, formerly CXO at Disney.\nCFA charterholder\nExperienced early-stage investor and finance professional, CFA charterholder, with 13 years finance, 16 years engineering; managed Shelter Venture Fund, advised startups, ran accelerators, authored finance articles, and holds multiple patents.\nIAS\nP. Murari, MA (Economics) from Madras University, served in the Indian Administrative Service (IAS) from 1957 to 1992, holding various esteemed positions including Secretary to the President of India. Currently, he advises the President of FICCI.\nResearcher\nDr. R. Velraj is a renowned academic and researcher with over 34 years of experience in thermal engineering and energy applications. He has served as Vice Chancellor of Anna University and Director of the Institute for Energy Studies. With numerous publications, patents, and international recognitions, he is a leading expert in the field. He is committed to nurturing young researchers and promoting sustainable energy solutions.\nCo-founder of HIEx and WiNFUND\nInnovative global health leader, co-founder of HIEx and WiNFUND, facilitating over $200M in investments and supporting female health entrepreneurship. Also co-founded TSF, the largest UN technical assistance mechanism in HIV.\nOperations | Supply Chain Logistics | Customer Support\nA seasoned professional with over 20 years of service in the Indian Army’s Engineers Corps, bringing expertise in operations management, logistics, and customer support. Post-retirement, I have successfully transitioned to corporate roles, excelling in optimizing workflows, scaling operations, and driving customer satisfaction. With a strong foundation in leadership, strategic planning, and process improvement, I am committed to delivering results and fostering organizational growth.\nCTO/Chairman of the Board\nMaj. Gen. Indrabalan (R) is a transformative leader with 37 years of exemplary military service. His extensive operational experience in extreme environments spanning UN Missions, deserts, high-altitude terrains, and conflict zones shaped his unwavering commitment to addressing critical challenges like water security through innovation and strategic thinking.\nAn alumnus of the National Defence Academy and IIT Kharagpur, with advanced degrees in science, technology, and management, he has applied strategic foresight to pioneer cutting-edge water technologies.\nIn his post-military career, Maj. Gen. Indrabalan merges his operational expertise and military exposure with technological vision to drive sustainable innovations for atmospheric water generation technology to keep Aeronero ahead of its competitors in the product innovation map. By uniting his operational experience with forward-thinking strategies, he is delivering scalable solutions to combat global water scarcity and enhance resilience for military and civilian communities alike. He is also the Trustee Director in the Board of Unifi Capital Mutual Fund a 23K Cr PMS company.\nFounder and CEO\nDurga Das is a pioneering entrepreneur, former professional cricketer, and Goldman Sachs 10K Women alumnus. As the founder of Aeronero, she is revolutionizing air-to-water generation (AWG) technology, converting humidity into clean water to address global water scarcity. A Vital Voices Fellow and included in the 2024 MB 100 Global awards list by Meaningful Business, Durga blends innovation with philanthropy, founding WODER to improve water access for refugee camps and empower women.\nHer leadership has earned accolades such as the “Best Innovator” award at the 2024 World Health Assembly and the Women Leadership Award presented by Ms. Kiran Bedi. With 30+ years of startup expertise, Durga also advises WICCI, the Asian African Chamber of Commerce, and the World Talent Economic Forum, all while championing her vision: “Water for all, Always.”\nTechnology/R&D\nPranav Nair is a skilled Mechanical Engineer with a Master’s degree from the University of Auckland. He has experience in design, analysis, and manufacturing, using tools like ANSYS and Creo. His passion lies in innovation and development, and he seeks a challenging role in R&D to contribute to world-class products. Beyond his technical skills, Pranav is an active individual with interests in sports, arts, and writing.\nHead Production & Operations\nAn Electronics & Communication engineer with post graduation in IT with two decades of Pioneering IT Companies like WIPRO, NIIT and Global Software Ltd. Worked with The Indian Coast Guard RHQ- East and was instrumental creating their IT infrastructure backbone, through Advance Logic Systems including GPS based multiple targets tracking and monitoring.\nChief Investment Advisor\nMadhu G N is a visionary leader and innovator with extensive experience in technology, investment, and business strategy. Holding numerous patents in wastewater treatment, he has a distinguished career marked by positions such as CEO, CIO, CSO. His strategic foresight as a Chief Strategy and Investment Officer has been recognized with multiple awards. As an angel investor, he has a keen eye for transformative start-ups and is actively involved in shaping the business landscape through his contributions to tech forums & investment seminars.\nChief Financial Officer\nSriram Sundaravadanan is a seasoned finance professional with over 30 years of experience in financial services and banking. He has a proven track record in handling large-scale transactions and working closely with legal teams. As an investor, he supports startups in the tech sector, providing CFO services to ensure financial discipline and compliance. With an MBA in Finance and a Graduate Program from ANU, Sriram has worked with leading companies like the Birla Group, Tata Group, and ICICI Bank."
    }
  ],
  "argos_summary": "Aeronero, a Chennai-based deep-tech startup focused on water generation, has raised USD 1.5 million in its first funding round led by Callapina Capital and supported by notable investors. The company specializes in Air Water solutions that produce clean, alkaline drinking water from atmospheric moisture, addressing water scarcity issues in various regions. With 13 global patents and significant year-on-year growth, Aeronero aims to revolutionize water sourcing and sustainability, positioning itself as a leader in the atmospheric water generation market.",
  "argos_id": "LCJFKOVXB"
}