{
  "url": "https://gizmodo.com/alien-earth-recap-episode-1-episode-2-2000641951",
  "authorsByline": "Germain Lussier",
  "articleId": "8ae09044424a48d188825f03544577b4",
  "source": {
    "domain": "gizmodo.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://gizmodo.com/app/uploads/2025/08/Alien-Earth-Recap-1-1200x675.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-13T14:00:30+00:00",
  "addDate": "2025-08-13T14:09:56.096384+00:00",
  "refreshDate": "2025-08-13T14:09:56.096387+00:00",
  "score": 1.0,
  "title": "'Alien: Earth' Begins With Crucial Context and Constant Chaos",
  "description": "Sydney Chandler, Timothy Olyphant, and Alex Lawther star in the FX series created by Noah Hawley, which debuted this week.",
  "content": "There’s a moment in the second episode of Alien: Earth where everything changes in an instant. The show you think you are watching, about a crashed ship and some weird hybrids, becomes the show you’ve always wanted to see. One of the most iconic creatures in film history makes its debut on your TV screen, it’s slow-motion, and it’s glorious. From there, things only get more interesting, more disgusting, and more awesome. It’s off to the races.\n\nThe first two episodes of Noah Hawley’s Alien: Earth premiered this week, and we’re going to be here with you all season to break it down. The show’s arrival is the culmination of years of curiosity and anxiety, especially for fans of the Alien franchise. Alien on Earth? How would that work? Would the show feel like an Alien movie? How can we care without Ripley? Well, in the show’s first episode, Hawley erases all of that by giving you a ton of fascinating context and potential. Then, in the second episode, he blends those with the wild, horror-driven chaos Alien fans know and crave. By the end, we’re left gasping for air, dying to see where it all goes next. Let’s recap, shall we?\n\nFrom the first moments of “Neverland,” the premiere episode of Alien: Earth, you know you’re in good hands. The slow, methodical title reveal, directly inspired by the original films, shows both a reverence for the material as well as an ability to evolve with it. We meet the crew of USCSS Maginot, a deep-space research vessel owned by Weyland-Yutani, and in a very familiar scene of groggy space-travelers crowding around a dinner table, are hit with a ton of exposition about the world of the show. Paramount among these revelations is that five companies control the entire planet, with Weyland-Yutani only being one, and that this mission was about acquiring specimens. A mission that cost many, many lives. Then, to illustrate that, we enter another room in the ship, lovingly referred to as “The Zoo,” and we see not just Facehuggers and eggs from the other movies, but all sorts of new, weird, creepy, crawly things.\n\nSo the show basically starts as an Alien movie. People wake up on a ship, they talk, and there are creatures. This is comfortable. This is good. But the episode is called “Neverland,” and we quickly pivot to something completely different, a remote research facility of another of those companies, Prodigy. It’s run by a young trillionaire named Boy Kavalier (Samuel Blenkin), and we pick things up right as he’s about to make history. He’s about to transfer a human consciousness into a synthetic body, basically defeating death. That human is a young girl named Marcy, who we see to be kind, sweet, and empathetic. She’s sick, though, and in her new body, sickness won’t be a thing. She chooses a new name for herself, Wendy, as per Boy’s obsession with Peter Pan.\n\nWendy (Sydney Chandler) is still Marcy on the inside, but not the outside. On the outside, she’s fast, strong, and potentially immortal. She discusses some of that with Kirsh (Timothy Olyphant), a fellow synthetic being, and Dame Sylvia (Essie Davis), one of the scientists responsible for the procedure. Wendy then learns more kids are coming to join her, and she’s to act as their big sister, easing them into the obviously terrifying notion of leaving their mortal bodies. Here, Hawley is setting up a whole new world for us, ripe with philosophical implications. Are these beings human? What is their potential? What are their limits? And what are the larger implications of life if there is no more death?\n\nAll questions for another moment because things need to get going. Hawley channels David Fincher’s camerawork from Alien 3 to let us know that some terrible things have happened on the Maginot. People are dead, creatures are out, and the ship’s security officer, a cyborg named Morrow (Babou Ceesay), relays this information to Weyland-Yutani. Even as he dooms one of his shipmates by not allowing her access to his secure cabin, the only priority for Morrow is getting the specimens to the company. That final shipmate subsequently gets torn apart by the now fully grown xenomorph, which then almost gets Morrow too before he hides in a special compartment.\n\nAs the Maginot zooms towards Earth, we meet the show’s other main character, Joe (Alex Lawther). Joe is Wendy’s older brother, and she, through some mysterious power no one at Prodigy can figure out, has been accessing and manipulating cameras to spy on him. Whether or not that attachment to her brother is a good thing is up for debate among the powers that be. Joe is a medic working in the military of Prodigy, and after he tells his friends that a request for transfer has been denied, the Maginot crashes into the city. Joe and the team immediately jump into action, gearing up and heading to help survivors.\n\nWendy sees this on her screens and has a wild idea. Prodigy should send her and her fellow multi-billion-dollar immortal children to the crash site to help. This moment seems wildly out of place and forced for many reasons, but the biggest one is they’re kids. What do they know about military movements or rescue missions? And the other characters all tell Boy this over and over. Wendy only wants to go because her brother is in peril. Even so, the trillionaire agrees to her plan. He wants to see what his new toys can do.\n\nBack at the crash site, we watch multiple teams go deeper and deeper into the ship. We see how it has smashed through a skyscraper to create a deep hole of danger. Morrow escapes his hatch and reports back to Weyland-Yutani that he’s going to try and secure the cargo despite the soldiers boarding the ship. Joe’s group and a few others walk around too. Each finds signs that some very, very bad things happened, including one cryochamber where a guy has a hole in his chest. (“Uh-oh,” thinks every Alien fan.) Two others enter a lab that has lots of creatures still in containment, but not all of them. Two massive insect-looking creatures slip into their clothes, later emerging to suck the blood out of their bodies, killing them.\n\nAs the episode comes to an end, Kirsh talks to Wendy about the differences between humanity and their kind. But Wendy doesn’t want to hear any of it. She tells Kirsh that, no matter what she has to do, her brother will survive. She’s cheated death; she now wants to do the same for him.\n\nSince FX gave us two episodes to start things off, instead of breaking things down after episode one, let’s dive right into episode two and save the minutiae for after. Episode two of Alien: Earth is called “Mr. October,” both a direct reference to the episode’s inclusion of baseball Hall of Famer Reggie Jackson, and a broader scope term for a hero stepping up to the challenge when it’s most needed. Both Wendy and Joe fit that bill in the episode, which makes sense, because the term was taught to them by their father, who we meet in several flashbacks and yes, is played by series creator Noah Hawley himself.\n\nAlso, the beginning of “Mr. October” establishes something very cool about the series. Instead of some kind of “Previously on Alien: Earth” montage, the show replays those moments during the slow, methodical title reveal. It’s a fun way to both suck us right back into the show and give us a few brief reminders of what to remember as the story moves forward.\n\nAs Joe and his team dive deeper into the crash site, learning more and more about the horrors that befell the crew, Boy and Sylvia have a discussion back at Prodigy. He explains that he didn’t create Wendy and the other hybrids to cheat death and sell immortality. That’s certainly a benefit, but not the main reason. He’s an unparalleled genius and simply wants to meet someone who blows his mind. Someone who is smarter than him. And, he hopes, by mixing a human being with a supercomputer, maybe he’ll achieve that. Sylvia seems skeptical about the claim, but the conversation is ripe with foreshadowing, not just of why he let the kids go to the crash site, but of what Wendy and his new family might become.\n\nThat’s especially true in light of what we see later. A day before the crash, we learn that Wendy was spying on her brother remotely as always. He was at an office and asked a government robot for an early exit from his military job so he could go to college on Mars. But, fearing she’d lose him, Wendy manipulates the code of the robot from thousands of miles away, denying his claim. She even makes it retort with an inside joke she and he shared from an Ice Age movie, which confuses him amid the disappointment. The Prodigy scientists are blown away by this because they have no idea how she did it. The next day, when he’s forced to deal with the crash, Wendy feels guilty about it. She kept her brother in his job and caused him to be in this dangerous situation. This informs not just her seemingly random request to go to the crash, but Boy Kavalier’s even more surprising agreement with her. He saw her do something he’s never seen before, and he wants to see what else she’s capable of.\n\nWhich brings us all the way back to 1,500 words ago and the first paragraph of this piece. The moment it all changes. Joe and his friends continue to search the crash when he senses something above him. Slowly, out of the dark, emerges the xenomorph, and it chases Joe across the giant pit at the center of the structure. It’s here when, after all the thoughts of crashes, hybrid beings, and humanity, we were reminded this is an Alien show. And Alien is awesome.\n\nIt’s a sentiment that continues through the rest of the episode as the creature chases Joe up and down the building. At one point, it gleefully massacres a costume party. The next, it obliterates a group of soldiers. In both instances, the xenomorph leaves gallons of blood, guts, and exploded body parts everywhere. In a show that seemed so quiet and introspective at the start, it was wholly surprising and awesome to get some real, gross, Alien carnage. We absolutely loved it.\n\nWhen Wendy and the kids reach the crash site, she immediately starts hearing something. Something no one else hears. When she then abandons her team to go find her brother, it only intensifies. As Wendy and Slightly (Adarsh Gourav) go after Joe, Kirsh and the rest of the group dive deeper into the ship. They discover numerous other alien species, including an incredibly creepy eyeball octopus that jumps on your face, sucks out your eye, and then takes over your body. Or, at least that’s what it appeared to do to the cat it had infected and what it tried to do to Nibs (Lily Newmark), another of Wendy’s siblings.\n\nAfter a second encounter with the xenomorph, including a very cinematic slow-motion jump over a gaudy chandelier, Joe is about to die. But, he’s saved by Morrow, who has finally caught up to one of the specimens he and his crew found in space, and he is supposed to reacquire for the company. We even get a glimpse of how he and those soldiers were probably able to neutralize these creatures, by using electricity to freeze them and then a weird, organic net gun to trap them. The net doesn’t hold, of course, as the xeno escapes and kills a bunch of other soldiers, but Joe survives and Wendy finally finds him.\n\nKirsh wants Wendy and Slightly to head to the front of the ship, where they’ve discovered there are a bunch of eggs in storage (“Uh-oh,” thinks every Alien fan), so Wendy convinces Joe to go with them. On the way, Slightly lets it slip that she is his sister, which Joe doesn’t understand. He buried his sister. But, we learn, her dad agreed to donate her to Prodigy to save her life. It just had to be kept a secret. Joe is scared and skeptical, but after asking a few hyper-specific questions only his little sister would know, he gives in. We’ve only been with these characters for two episodes, but it was still an incredibly touching, heartfelt moment. A moment that’s very quickly taken from them when the xeno returns and seemingly smashes Joe down into the building. Wendy decides she’ll go after him and that’s the episode.\n\nThe first two episodes of Alien: Earth are incredibly dense but also very entertaining. Each is filled with interesting ideas and possibilities, plus lots of gross, creature horror. We also begin to see how this is all going to weave together. Corporations fighting over these creatures. Wendy and the hybrids exploring themselves and these other creatures. Creatures that, like themselves, are not of this world. Plus, a brother and sister reunite under impossible circumstances. Sign us the heck up for six more weeks of Alien: Earth.\n\nHere’s where we’re going to mention a few things that didn’t quite fit into the flow of the story above but were worth noting.\n• We love all the winks back to the original Alien movies. Clearly, the whole Magniot scenario is Ridley Scott’s original, but Joe and the Prodigy team being transported to the crash site was very James Cameron, and the show goes full Alien 3 a few times to show the POV of the xenomorph. It felt like just the right level of homage without being in your face.\n• Will we get to see what happened on the Magniot? The show obviously leaves it to the imagination but even without all the killer aliens and stuff, they set up some weird dynamics between the characters, especially with that other cyborg character, Mr. Tang.\n• Who else was creeped out by the long, lingering shot of the “See no evil, speak no evil, hear no evil” sculpture on the wall at Prodigy? Clearly, we’re supposed to be very, very skeptical of the ethics happening at this place.\n• Did you catch that Joe kept that Reggie Jackson ball? It was a subtle thing, but we think, speaks to his character. He’s a good guy, clearly, but not infallible. If the owner of a huge piece of baseball history has just been cut in half by a killer alien, sure, he’s taking it.\n• Both episodes this week had a single shot of a man, in a full hazmat suit, powerwashing a wall at Prodigy. It is not connected to anything else so far but was obviously put in there for some reason. What could it be?\n• We loved the scene between Boy Kavalier and Yutani (Sandra Yi Sencindiver). Just two trillionaires, trying to outsmart one another, completely oblivious to the actual implications of what they’re doing. It’s going to be fun to see how that corporate battle surrounding the crash and creatures plays out. Plus, do we think we learn how Yutani knew about the xenos?\n• What the hell is up with the giant pod creature hanging from the ceiling? It started to reveal itself, but then Tootles (Kit Young) left. We can’t wait to find out.\n• Morrow mentioned that the xenomorph can sense fear. Is the true? How would he know that? That feels like a very interesting thread that could be explored.\n• Why is Marcy/Wendy special? Boy tells her she’s special, and not just because she’s the first human to be transferred. There are other reasons too, which is why he went and took her from her family. She must have something about her that made her an ideal candidate for this. What could it be?\n\nWhat did you think of the premiere of Alien: Earth? Let us know below.",
  "medium": "Article",
  "links": [
    "https://gizmodo.com/ridley-scott-has-thoughts-on-that-upcoming-alien-tv-sho-1847847547",
    "https://gizmodo.com/alien-earth-is-better-than-we-ever-dreamed-possible-2000637323",
    "https://gizmodo.com/warner-bros-dc-release-dates-hbo-max-cast-details-1848354161",
    "https://gizmodo.com/doctor-who-release-dates-streaming-ncuti-gatwa-rtd-1849745140",
    "https://gizmodo.com/star-trek-release-dates-where-to-stream-picard-discover-1848839650",
    "https://gizmodo.com/moms-the-word-on-the-anniversary-of-james-camerons-alie-1847281734",
    "https://gizmodo.com/alien-1979-review-sigourney-weaver-romulus-fox-2000376725",
    "https://gizmodo.com/marvel-release-dates-when-to-see-upcoming-mcu-movies-1848196856",
    "https://gizmodo.com/star-wars-movies-tv-shows-release-dates-disney-1848494806"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Alien fans",
      "weight": 0.058401696
    },
    {
      "name": "Alien",
      "weight": 0.056168973
    },
    {
      "name": "Wendy",
      "weight": 0.054860007
    },
    {
      "name": "Joe",
      "weight": 0.05341032
    },
    {
      "name": "Episode",
      "weight": 0.051399697
    },
    {
      "name": "episode",
      "weight": 0.051399697
    },
    {
      "name": "Creatures",
      "weight": 0.04703142
    },
    {
      "name": "creatures",
      "weight": 0.04703142
    },
    {
      "name": "crashes",
      "weight": 0.046483535
    },
    {
      "name": "other soldiers",
      "weight": 0.045486268
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/TV & Video/TV Guides & Reference",
      "score": 0.84912109375
    },
    {
      "name": "/Arts & Entertainment/TV & Video/TV Shows & Programs",
      "score": 0.83642578125
    },
    {
      "name": "/Arts & Entertainment/Movies/Movie Reference",
      "score": 0.79150390625
    },
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.398681640625
    },
    {
      "name": "/Arts & Entertainment/Movies/Science Fiction & Fantasy Films",
      "score": 0.363037109375
    },
    {
      "name": "/Arts & Entertainment/TV & Video/Online Video",
      "score": 0.310791015625
    }
  ],
  "sentiment": {
    "positive": 0.13783342,
    "negative": 0.47409016,
    "neutral": 0.38807636
  },
  "summary": "The first two episodes of Noah Hawley's Alien: Earth, which premiered this week, have been described as a show about a crashed ship and some weird hybrids. The first episode, \"Neverland,\" reveals that Hawley gives fascinating context and potential, blending these with the wild, horror-driven chaos Alien fans know and crave. The second episode focuses on the crew of USCSS Maginot, a deep-space research vessel owned by Weyland-Yutani, and a mission to acquire specimens. The main character, named Wendy, is introduced as a young girl named Marcy, who learns that her new identity will be different from the outside and potentially immortal. The show also explores the implications of leaving their bodies and exploring the limits of life.",
  "shortSummary": "The first two episodes of Noah Hawley’s Alien: Earth, a thrilling new drama about life on Earth, blend horror and science fiction with human-like, context-rich storytelling.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "b6795da2a06a4e529e724aefc1968d8e",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://gizmodo.com/alien-1979-review-sigourney-weaver-romulus-fox-2000376725",
      "text": "It’s clearly not some giant leap to say Ridley Scott’s Alien is a masterpiece. That’s simply been a factual statement since the day it opened. But as we get ready for the next Alien movie to hit theaters this summer, we decided to look back on the franchise to see if we could dive a little deeper. Find something new, or at least try. Here’s what we came up with.\nThese days, we consider Alien to be both one of the best sci-fi and maybe even horror movies of all time. Which, clearly, it is. But I also think it should be considered one of the greatest mysteries of all time. Mystery and intrigue are the engine that keeps things going in the film well before an alien pops out of a man’s chest and wreaks bloody havoc.\nThe whole film moves and is built around creating questions. Questions that are then answered with answers that provide more questions. It starts when we see the crew of the Nostromo wake up. We wonder why they are waking up, what life is like on the ship, and more. Those questions are answered when it’s revealed a mysterious message has been detected and they have been tasked to investigate. Who sent that message? Why did they send it? Once they arrive on the mysterious planet, the crew discovers a massive alien spacecraft. Clearly, this is who sent the message but what the hell is this ship? Where did it come from? Who is on it?\nThings get taken to a whole other level once the crew boards the ship. They encounter a giant skeleton sitting in some mix of a chair and weapon fans would later name the Pilot. Who is this creature? How long has it been there? What was it doing? How did it die? Those questions, unlike most of the rest, never get answered because quickly things take a turn when Kane (John Hurt) encounters these equally fascinating eggs, only to open one and, well, we know what happens from there.\nScott’s focus on mystery extends to the filmmaking techniques too. The film opens with his camera slowly exploring the Nostromo, almost like a person quietly sneaking around looking for something specific. That camera move is copied again after the Facehugger lets go of Kane and Ash (Ian Holm) is dissecting it. The sets themselves are also created like a maze, with multiple levels, tunnels, nooks, and crannies everywhere, each one piquing curiosity in unique ways. Characters are often viewed in shadow, the music is always moody and contemplative, everything is slow and deliberate.\nOnce the alien bursts out of Kane’s chest, the film certainly shifts, but still maintains its identity. The narrative mysteries are merely replaced by the structure of a typical murder mystery as the creature picks off each crew member one by one like something out of an Agatha Christie novel. Is it a traditional murder mystery structure? No, especially since we know who the killer is and what they look like. But that’s just a unique way to give it a fresh approach while also raising tension and anticipation.\nEventually, the film tees up one final, major mystery to be solved, which is how and why the Nostromo ended up with the creature in the first place. We learn the company, later revealed to be Weyland-Yutani, ordered the android Ash to find and return it, even at the expense of the lives of the crew. The revelation is painful and shocking for the remaining characters but delicious for the audience. It’s such a ruthless directive that we both hate everything about it but also simply need to know more. What does the company think this creature will do? How did they find out about it? And what do they expect to happen if the mission is a success?\nScott’s film has no interest in those answers. Instead, like so many great sci-fi films of the era, it leaves those to the imagination in favor of character and story. Which, obviously, Alien has in every single frame. That’s why it’s a masterpiece. But watching it again, thinking about the new film coming out, we couldn’t help but marvel at the specific ways Alien draws us in and hasn’t let go in over four decades.\nWatch Alien now on Hulu. The new film, Alien: Romulus, opens August 16.\nCorrection 2:15 p.m.: We called the skeleton the “Engineer” in our original post, which is a Prometheus term not Alien. That’s been updated.\nWant more io9 news? Check out when to expect the latest Marvel, Star Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about the future of Doctor Who."
    },
    {
      "url": "https://gizmodo.com/moms-the-word-on-the-anniversary-of-james-camerons-alie-1847281734",
      "text": "A good movie is one you enjoy the first time you watch it. A great movie is one you find joy in dozens of viewings later. For me, James Cameron’s Aliens is not just a great movie, it’s an incredible movie, and though I’ve seen it so many times over the years, I sat down to watch it again for its upcoming 35th anniversary to see if, or how, it could reward me yet again. Not only did it do that, it spoke to me in a way I never expected, and it has to do with my late mom.\nMy first memories of Aliens are all about my mom, Nancy. A few years after the film was released, I’d of course heard about it and wanted to see it. When it finally came on HBO, probably eight or nine-year-old me told my mom I wanted to watch it and she said she wasn’t sure it was appropriate. So, she said, she’d watch it first and let me know if I could see it. I think it was on at 9 or 10 p.m. one night and as I went to bed, I anxiously awaited the morning to get the verdict. “Can I see Aliens?” was the first thing I asked when I woke up and my mom said “Absolutely not. That was way too scary.” She hated it, was terrified by it, but watched it anyway because she knew it was important to me. She caved eventually, and I probably saw it soon after, but having that maternal instinct hovering over my first memories of the film is why, to me, Aliens, resonated much more this time around.\nThe film is way more than an entertaining, smart way to make a sequel from a classic, which is what one urban myth would like you to believe is what happened. The myth goes like this: before he made the film, writer/director James Cameron walked into a conference room at 20th Century Fox, wrote the word “Alien” on a whiteboard, gave it a second, then added an “S.” Then he put two lines through it making it a dollar sign. Whether or not that story is true, a) I’d like to believe it is, and b) it’s an excellent surface reading of Aliens.\nIn its most basic form, Aliens is the perfect, quintessential sequel. It takes everything you knew and loved about the first movie, flips it on its head, and makes it bigger. (For years, I thought it made it better too, but these days, I think the original holds that title.) And yet, besides the fact the film has more aliens, more humans, more guns, and bigger stakes, Aliens sits in that pantheon of perfect sequels because of its humanity and its portrayal of the strongest of human bonds.\nAs the film begins, Ripley (Sigourney Weaver) is dealing with a lot. She’s been in hyper sleep for almost six decades and hasn’t really had the time to process that. Plus, she’s still grappling with the fact that what seems like just days ago for her, a mysterious alien killed her entire crew and she was forced to destroy it and the ship she was on. She has nightmares about it every night and the corporate executives who owned that ship don’t actually believe her. She also finds out dozens of families are now on LV-426, the planet where she and her crew found that alien, which fills her with dread and guilt. She may have defeated one alien, but it seems very likely there could be more. Basically, she’s deeply, psychologically traumatized. (Side note: I rewatched the theatrical version because that’s what was released 35 years ago but it’s worth noting the extended Special Edition adds in the revelation that during Ripley’s extended hypersleep her daughter back on Earth had passed away, which only bolsters this characterization.)\nEventually—with the promise of a new job—Ripley begrudgingly decides to go back to LV-426, save the families in danger, and destroy all the aliens. This time though she’s not going with just a few crew members. She’s going with the Colonial Marines, an elite team of space soldiers who, over the course of the film, become a new family for Ripley. She fosters relationships with them and, ultimately, mutual respect which makes the fact that very quickly upon landing the majority of the Marines are wiped out even more devastating. There’s also the later revelation that all of the promises made to Ripley before the trip were lies and the only reason everyone went is to bring an alien home for experimentation, just like in the original movie.\nBut then something changes. Ripley and the Marines find Newt (Carrie Henn), a young girl who seems to be the lone survivor of the apparent massacre that happened on the planet. Finding survivors isn’t what the Marines are there for but it’s Ripley’s reason for living. She’s a protector at heart and very quickly her maternal instincts, which we’d previously seen directed at Jonesy the cat, come out. Aliens goes from being a movie about Marines destroying monsters to about a mother protecting a young girl who she begins to see as a daughter. Beyond just the anti-corporate subtext and blossoming familial relationship, basically everything about the movie is excellent: the cast of supporting characters (Al Matthews as Apone! Bill Paxton as Hudson! Jenette Goldstein as Vasquez! Michael Biehn as Hicks!), the surprising evil mastermind (Paul Reiser as Burke), the huge action set pieces, the constant humor, quotable dialogue, all of it. But it’s Ripley and Newt who make the film work so well all these years later.\nAs the film reaches its climax and Ripley can get off the planet, she decides to stay and risk everything for Newt—which is also the point where Ripley discovers the Alien Queen, a character who, like Ripley, wants to protect her children. That means the film’s final battle between Ripley and the Queen is really the fight between two mothers who will stop at nothing to protect their families. Ripley wins, of course, and if you weren’t quite convinced this thread was the beating heart of the film, Newt calls Ripley “Mommy” for the first time. It’s a beautifully touching moment in the midst of all the goo and gore. The film then ends with both Newt and Ripley agreeing they can dream again, a signifier they’re beginning to deal with the trauma. As they go to (hyper) sleep, what has previously been such a bombastic, militaristic score by James Horner plays out like a lullaby, letting the mother and daughter finally sleep. And dream.\nSome of you might be reading this and thinking, much like Cameron’s “$,” this is a fairly obvious reading of Aliens. And you’d be right. I’m not pretending like I’m the one who finally cracked the code after 35 years. In that time though I’d usually key more into anticipation for the action, humor, and violence instead of the mother/child relationship. Which brings me back to Nancy.\nLast year, I lost my mom to a long battle with breast cancer. Though I don’t remember exactly when I first saw Aliens, I do remember when I didn’t see it, and it was the day after she watched it. My mom was protecting me from the nightmares a young child definitely would have had watching the film at that age. Now, 35 years later, I realize my late mom was trying to shelter me from it. To protect me from any potential trauma watching this intense, scary movie might have caused. It’s that personal subtext, 16 months removed from my mom’s passing, that really helped punctuate the emotion Cameron put into the film in a way it hasn’t before. She was my Ripley. I was her Newt.\nMy mom never protected me from any killer aliens (that I know of) but always wanted the best for me and fostered everything I am today. From always taking me to the movies as a kid, to helping me get a job at a video store in high school, to supporting a college education where I primarily studied film—she always supported me on my road ahead, toward a future where I write about movies every day. Like Ripley and Newt, we too dreamed together.\nWhen I sat down to rewatch Aliens last week, I didn’t expect it to turn into this. But, ultimately, that’s what the great movies do. They forge personal relationships with you and evolve in different ways every time you watch them—and Aliens is certainly a great movie, one that might be best known for its action, but is truly unforgettable because of how much it’s concerned with a mother’s relationship with a child. Aliens was first released July 18, 1986, which means it’s celebrating its 35th anniversary on Sunday. You can watch it on Amazon or, likely, your personal collection.\nWondering where our RSS feed went? You can pick the new up one here."
    },
    {
      "url": "https://gizmodo.com/marvel-release-dates-when-to-see-upcoming-mcu-movies-1848196856",
      "text": "There’s now over 30 feature films in addition to eight Disney+ shows in 15 years in the Marvel Cinematic Universe. 2023 got off to a promising start here’s what’s coming next from the MCU. In short: a lot, we began Phase Five with Ant-Man and the Wasp: Quantumania followed by Guardians of the Galaxy: Volume 3, Secret Invasion and by the fall we’ve got The Marvels on the horizon along with season 2 of Loki.\nHere’s the latest news for Marvel theatrical release dates and Marvel TV release dates on Disney+—which the studio can often tweak or reschedule—so we get it, keeping track of when your favorite superheroes are returning or making their debuts can be challenging. Don’t worry, to help you stay on top of things, we’re compiling all the current MCU release dates; when specific titles have been announced but still not officially scheduled, we’ll put them in order when we think they’re most likely to show up.\n(Last updated 6/16/23)\nWhat’s the next Marvel movie?\nThe Marvels\nRelease date: November 10 (In theaters)\nThe sequel to Captain Marvel will pull together three of the MCU’s most powerful women: Brie Larsen’s titular Captain, Ms. Marvel’s Iman Vellani as Kamala Khan, and Teyonah Parris as Monica Rambeau. Nia DaCosta (who most recently helmed the revival of Candyman) is directing the film.\nIn the finale of Ms. Marvel season one, Carol Danvers showed up in Kamala Khan’s bedroom, marking the first real tease of the film. The film release date change came with a poster. Most recently the teaser trailer dropped and here’s our breakdown of everything we saw.\nUpcoming Marvel Cinematic Universe Release Dates\nSecret Invasion\nRelease date: June 21 (On Disney+)\nThis series picks up storylines from both Captain Marvel and Spider-Man: Far From Home to explain the decades-long Skrull invasion of Earth. Samuel L. Jackson and Ben Mendelsohn will star withEmilia Clarke taking on the role of Talos’ grown daughter who has joined a rebellious splinter cell of Skrulls. Martin Freeman has also confirmed he will be appearing in Secret Invasion.\nThe Disney+ blurb of the series describes the series as a “crossover event series showcasing a faction of shape-shifting Skrulls who have been infiltrating Earth for years.” A trailer was released at D23.\nLoki Season 2\nRelease date: Fall 2023 (On Disney+)\nThe smash hit series about Tom Hiddleston’s antihero will return soon for more variant shenanigans across the multiverse. Hiddleston confirmed “the whole cast” of Loki’s first season will return for season two on an episode of Jimmy Kimmel Live. In December, we got a very, very brief tease of season two.\nEcho\nRelease date: November 29, 2023 (On Disney+)\nThis spinoff from the Hawkeye series will follow Echo, a deaf martial artist, as played by actress Alaqua Cox. Devery Jacobs (Reservation Dogs) co-stars. Echo officially began filming on May 24, according to a tweet by series creator Marion Dayre. According to James Clement on an episode of the Weekly Planet podcast, both Vincent D’Onofrio and Charlie Cox are set to return for the Echo series at Disney+.\nThe series was recently announced along with Ironheart, Agatha Coven of Chaos and What If season 2 as potentially moving to 2024.\nX-Men ‘97\nRelease date: Fall 2023 (On Disney+)\nThe X-Men are coming to the MCU… kinda. X-Men ‘97 is a revival of the classic ‘90s animated show, bringing back the same style, stories and yes, theme song, of the iconic series. (See more: X-Men ‘97 Looks Like a Nostalgic Blast From the Past)\nIronheart\nRelease date: 2024 (On Disney+)\nWith Tony Stark gone, the MCU needs a new super-genius inventor. Enter teenage prodigy Riri Williams (played by Dominique Thorne), who creates a brand new, ultra-advanced armored suit. Other cast members include Anthony Ramos (In the Heights) as the villain the Hood and Lyric Ross (This Is Us). Chinaka Hodge (TNT’s Snowpiercer) is attached as the head writer, and Black Panther director Ryan Coogler is an executive producer alongside Marvel’s Kevin Feige and others. Manny Montana (Good Girls) has joined the cast of Marvel’s Ironheart in an undisclosed role as well as Han Solo himself, Alden Ehrenreich.\nAgatha: Coven of Chaos\nRelease date: Winter 2024 (On Disney+)\nThis spinoff from WandaVision will star Kathryn Hahn as her fan-favorite character Agatha Harkness. Joe Locke (Heartstopper) and Aubrey Plaza (Hahn’s Parks and Recreation co-star, among her other many credits) are also in the cast, as is Patti LuPone. (A second WandaVision spin-off, this one focusing on Paul Bettany’s Vision, is also reportedly in the works.)\nCaptain America: Brave New World\nRelease date: August 26, 2024 (in Theaters)\nWe’ve got a new Captain America, so it was inevitable that we’d be getting a new Cap movie. Anthony Mackie will appear in the title role. Harrison Ford was announced to take over the role of General Thaddeus Ross and will make his debut in this release.\nDaredevil: Born Again\nRelease date: Spring 2024 (On Disney+)\nCharlie Cox and Vincent D’Onofrio will return as Daredevil and Kingpin for an 18-episode Disney+ series. Jon Bernthal has signed on to reprise his role as the Punisher. Things remain uncertain for Foggy and Karen.\nThunderbolts\nRelease date: December 20, 2024 (In theaters)\nMarvel Studios is readying a movie based on the comic Thunderbolts and director Jake Schreier has been tapped to bring it to life. This film marks the end of Phase Five of the Marvel Cinematic Universe. Steven Yeun (Nope) signed on for an undisclosed role\nBlade\nRelease date: February 14, 2025 (In theaters)\nDisney hasn’t revealed much about this reboot of the franchise that features a badass vampire-hunter who is also a vampire, but we know that it stars two-time Academy Award winner Mahershala Ali, who also played Cornell “Cottonmouth” Stokes in Netflix Marvel series Luke Cage. We also know Blade appeared (or at least his voice did) in the end credits of The Eternals. After losing director Bassam Tariq, who would have been the first U.S.-Pakistani person to helm a Marvel Studios film, Blade was put on pause, and its release date was shifted. But now it has a new director in place: Lovecraft Country’s Yann Demange, as well as a writer in Michael Starrbury, so the September 2024 date looks ever more likely.\nDeadpool 3\nRelease date: May 3, 2024 (In Theaters)\nRyan Reynolds’ “merc with the mouth” is set to appear in Disney’s first R-rated film following the company’s completed acquisition of Fox assets. Oh, and did you happen to hear that Hugh Jackman’s Wolverine is also appearing in this one? Unless you are cut off from all social media, you no doubt caught that announcement.\nDeadpool 3 writers Rhett Reese and Paul Wenick spoke with Den of Geek about how Deadpool’s move to the MCU will not affect the feel of the movie. Or, in Wernick’s words: “Deadpool’s gonna be Deadpool.” Reese also said that Disney has been more than willing to ensuring the franchise keeps its core identity. Shawn Levy (Free Guy) is directing.\nFantastic Four\nRelease date: May 2, 2025 (In theaters)\nPhase Six of the Marvel Cinematic Universe, kicks off with the MCU debut of Marvel’s most famous family. Jon Watts was scheduled to directbut he is no longer doing that—Matt Shakaman of WandaVision is now in the chair—and though we saw John Krasinski as Mr. Fantastic in Doctor Strange in the Multiverse of Madness, there’s no guarantee he returns.\nAvengers: The Kang Dynasty\nRelease date: May 1, 2026 (In theaters)\nSince neither Phase Four or Phase Five ended with Avengers movies, Phase Six will end with two, back to back. The first is The Kang Dynasty, a title which heavily suggests that Kang (Jonathan Majors) will play a major role. Destin Daniel Cretton (Shang-Chi) will direct.\nAvengers: Secret Wars\nRelease date: May 7, 2027 (In theaters)\nIt all comes down to this. Phase Six, and the whole Phase 4-6 arc of the Multiverse Saga, ends with Secret Wars. We don’t know anything about the plot other than the comics that the title is based on; Marvel veteran Michael Waldron (Loki, Doctor Strange in the Multiverse of Madness) is writing the script.\nArmor Wars\nRelease date: Unknown (In theaters)\nThis project—originally slated for a Disney+ series, but now getting the feature film treatment—will follow James Rhodes (Don Cheadle) as he tracks down stolen tech that allows criminals to replicate Iron Man technology.\nAlso: Marvel slotted several other projects for Phase Six that take place alongside Fantastic Four and the Avengers films. There are two in fall 2024, two in winter 2024, one in winter 2025, two in spring 2025 and two in summer 2025. Some of those are probably…\nUnscheduled But Probably Still Happening Shows & Movies\nMoon Knight Season 2\nRelease date: Unknown (On Disney+)\nMoon Knight himself, Oscar Isaac, was recently spotted in Egypt and teased that a second season of his show could be on the way. Marvel and Disney have yet to confirm.\nMarvel Zombies\nRelease date: Unknown (On Disney+)\nThis new animated show is loosely spun out from a breakout episode of What If? that saw MCU heroes battling a zombie apocalypse.\nSpider-Man: Freshman Year\nRelease date: Unknown (On Disney+)\nDisney says this new animated series follows Peter Parker “on his way to becoming Spider-Man in the MCU, with a journey unlike we’ve ever seen and a style that celebrates the character’s early comic book roots.”\nWhat if…? Season 2\nRelease date: Unknown (On Disney+)\nThe speculative animated series and its omnipresent narrator the Watcher will return with an all-new season. The show’s creators say next season will focus on new stories, new heroes, and “lots of fun.” Though the trailer still hasn’t been released, the Marvel Animation Panel at San Diego Comic Con revealed some Phase 4 characters that will be in the show.\nUntitled Wakanda Series\nRelease date: Unknown (On Disney+)\nNot much is known yet about this show set in Black Panther’s home country.\nUntitled Shang-Chi sequel\nRelease date: Unknown (In theaters)\nShang-Chi’s debut movie was compelling, exciting and fun. It also made a ton of money, so a sequel is inevitable. That the film’s director is making Avengers: The Kang Dynasty does throw it into limbo a bit.\nUntitled Wonder Man series\nRelease date: Unknown (On Disney+)\nMarvel Studios has announced that it’s moving ahead with a Wonder Man series. Shang-Chi and the Legend of the Ten Rings director Destin Daniel Cretton is attached to helm and Brooklyn 99 writer Andrew Guest (who also produced Hawkeye) is on board to showrun the series. On October 31, the title star was announced: genre favorite Yayha Abdul-Mateen II.\nUntitled mutants movie\nRelease date: Unknown (In theaters)\nNow that Disney owns the old Fox assets that included all the “mutant” Marvel superheroes, you can very likely count on characters like the X-Men making an MCU debut.\nWant more io9 news? Check out when to expect the latest Marvel, Star Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about the future of Doctor Who."
    },
    {
      "url": "https://gizmodo.com/star-trek-release-dates-where-to-stream-picard-discover-1848839650",
      "text": "Trying to keep track of what’s coming in the realm of Star Trek feels like trying to stop a tribble from procreating. Before even more new series are announced, here’s our guide of when to expect all the new Star Trek shows, as well as returning familiar favorites, and what else is in the works right now. Engage!\nThis post was last updated 7/14/23.\nCurrently Airing: Star Trek: Strange New Worlds Season 2\nThe Enterprise is back after a successful first season, and this time Captain Kirk will be along for the ride with another appearance by Paul Wesley after his surprise finale role in season one. Not much else is known about the season so far, other than one episode will see the show crossover with Star Trek: Lower Decks in a live-action/animated hybrid directed by The Next Generation’s Jonathan Frakes. The show has also been renewed for a third season.\nSeason two recaps:\n“Tomorrow and Tomorrow and Tomorrow”\n“Charades”\nUpcoming: Star Trek: Lower Decks Season 4\nThe third season of the animated series following the misfit crew of the USS Cerritos—and in particular its cadre of ensigns, Mariner (Tawny Newsome), Boimler (Jack Quaid), Tendi (Noël Wells), and Rutherford (Eugene Cordero)—once again followed our heroic ensigns and the remaining bridge officers aboard the Cerritos. Season four will be arriving in late summer. The show has also been renewed for a fifth season.\nUpcoming: Star Trek: Discovery Season 5\nExpected in early 2024, Discovery’s fifth season will be 10 episodes long, down from the 13 of prior seasons. In the wake of season four‘s climax earlier this year, Michael Burnham (Sonequa Martin-Green) led her crew in a desperate attempt to save the galaxy from a mysterious anomaly created by an extra-galactic race, ensuring peace and stability for the Federation once more… for now. As her romantic partner Book (David Ajala) pays time for his own role in a campaign to surreptitiously destroy that anomaly, we’re not sure what awaits Burnham and Discovery’s crew just yet, but given this show, we’re sure it’ll be very, very dramatic.\nIn Flux: Star Trek: Prodigy Season 2\nThe animated series aimed at younger Trek fans (and Janeway fans!) and kids at heart can be found on both Nickelodeon and Paramount+. The first season was divided into two parts, with part two wrapping up at the end of 2022; after Paramount+ announced it would not move forward with the show’s already greenlit season two, it was removed from the service. (A home release of the complete first season is still possible; the first 10 episodes are still available for purchase.) Fans are still waiting to hear if Prodigy season two will surface on a different outlet.\nUpcoming: Starfleet Academy\nIt’s really happening! After a long tease, filming on this series will begin in 2024. Here’s the official announcement from co-showrunners and executive producers Alex Kurtzman and Noga Landau:\n“Admission is now open to Starfleet Academy! Explore the galaxy! Captain your destiny! For the first time in over a century, our campus will be re-opened to admit individuals a minimum of 16 Earth years (or species equivalent) who dream of exceeding their physical, mental and spiritual limits, who value friendship, camaraderie, honor and devotion to a cause greater than themselves. The coursework will be rigorous, the instructors among the brightest lights in their respective fields, and those accepted will live and study side-by-side with the most diverse population of students ever admitted. Today we encourage all who share our dreams, goals and values to join a new generation of visionary cadets as they take their first steps toward creating a bright future for us all. Apply today! Ex Astris, Scientia!”\nUpcoming (movie): Star Trek: Section 31\nAnnounced as a TV series back in 2019 as a spinoff for fan-favorite Discovery guest star Michelle Yeoh, this plunge into the seediest side of Starfleet—the shadowy spy organization Section 31 first introduced in Deep Space Nine—is now planned as a Paramount+ film.\nNewly minted Oscar winner Yeoh will return as former emperor of the Mirror Universe’s Terran Empire, Phillipa Georgiou, now turned into a kinder, but still kickass person by her time with Michael Burnham. “I’m beyond thrilled to return to my Star Trek family and to the role I’ve loved for so long,” Yeoh said in a statement. “Section 31 has been near and dear to my heart since I began the journey of playing Philippa all the way back when this new golden age of Star Trek launched. To see her finally get her moment is a dream come true in a year that’s shown me the incredible power of never giving up on your dreams. We can’t wait to share what’s in store for you, and until then: live long and prosper (unless Emperor Georgiou decrees otherwise)!”\nWritten by Craig Sweeny and directed by Olatunde Osunsanmi, Star Trek: Section 31 will start production later this year, and eventually come to Paramount+.\nWhere Can I Stream Classic Star Trek Shows?\nThat’s all the new bits of Star Trek coming. But what about the old Star Trek? In the U.S. at least, the vast majority of classic Star Trek shows are available exclusively to stream on Paramount+ (albeit not without issues), although some holdouts remain on other streaming services. Here’s a full list of classic Star Trek shows and where to stream them, as well as links to our recommended episode guides for every series!\nStar Trek: The Original Series (Paramount+)\nStar Trek: The Animated Series (Paramount+)\nStar Trek: The Next Generation (Paramount+, Netflix)\nStar Trek: Deep Space Nine (Paramount+, Netflix)\nStar Trek: Voyager (Paramount+)\nStar Trek: Enterprise (Paramount+)\nWant more io9 news? Check out when to expect the latest Marvel and Star Wars releases, what’s next for the DC Universe on film and TV, and everything you need to know about House of the Dragon and Lord of the Rings: The Rings of Power."
    },
    {
      "url": "https://gizmodo.com/alien-earth-is-better-than-we-ever-dreamed-possible-2000637323",
      "text": "When the idea was first floated of bringing the iconic Alien franchise to TV, many were skeptical. Films such as Ridley Scott’s 1979 original and James Cameron’s 1986 sequel are all-time classics. Follow-ups, like David Fincher’s 1992 film and Scott’s 2012 return, were also noteworthy for their own reasons. Alien just felt like a franchise that had been very well-explored already and could only be damaged in translation to a different medium.\nWell, I am elated to report that any skeptics, myself included, were beyond wrong. Alien: Earth is not just a worthy addition to the Alien franchise; it’s the best thing that’s happened to it since James Cameron’s Aliens. The show is an imaginative, surprising, and fascinating evolution of the franchise in every single way. Creator Noah Hawley somehow found a perfect balance of everything we know and love about Alien, combined it with new, wild perspectives on those preconceptions, and then centered it around an emotional, riveting human tale. Alien: Earth is an excellent show that is both worthy of the Alien franchise and also makes the entire thing immeasurably more interesting. The Alien franchise is better today than it was yesterday thanks to Alien: Earth.\nio9 saw six of season one’s eight total episodes, and after watching them, we are extremely confident those final two won’t change any of this. The story is too rich, the twists and turns too fun, and the scares too perfect to get messed up. We can’t wait to see where it all goes and to explore everything about it, all season long.\nSet three years before the events of the first Alien, the inciting incident of Alien: Earth is when a Weyland-Yutani ship, the USCSS Maginot, crashes into a city run by a corporation called Prodigy. While all the Alien movies have had their plots based on some kind of Earth story, we never actually saw what was happening on Earth, and this show takes that concept and runs with it. On the show, Earth is run by five mega corporations, two of which are Weyland-Yutani and Prodigy, and when the Weyland-Yutani ship crashes in Prodigy territory, all bets are off.\nThat’s especially true because the Maginot is not a normal ship. It’s a deep space research vessel that has been away for 65 years collecting alien creatures to bring back to Earth for study. One of those, of course, is the xenomorph. But there are others too, some of which are even grosser and creepier. And, if you’ve seen an Alien movie, we bet you can figure out how a ship full of killer creatures ended up crashing into Earth instead of landing safely. (Which the show at first teases, and later explores in an episode that’s akin to its own Alien movie.)\nAll of this, however, is merely set dressing for the main story of Alien: Earth. That’s the story of Wendy (Sydney Chandler), a hybrid person created by Prodigy. Prodigy, and the other companies, are in a race to figure out immortality, and Prodigy has innovated technology that transfers the consciousness and memories of a child into a superior, mechanic body. Wendy is the first, but she’s followed by others, and their childlike wonder and curiosity factor into them being sent to the Maginot crash to aid in the rescue efforts. That Wendy’s brother Hermit (Alex Lawther from Andor) is there is also a big part of it, especially since he thinks his sister is dead.\nAnd while that super compelling story of cyborgs, hybrids, and immortality is always present, Alien: Earth never loses sight of the fact it’s an Alien show. The xenomorph, and the other creatures, are slightly tangential at the start but very quickly become crucial to the plot. That, in turn, then leads to lots and lots of scary, bloody, Alien-worthy scenes. Also, by having aliens actually make it back to Earth, we get to see almost an Alien fan’s fantasy of what these companies would actually do if these creatures were returned safely. Everything in the movies was always just about Weyland-Yutani getting a xenomorph back to Earth, but it never happened. Here, we learn it has happened, and those stories are some of the most satisfying, shocking, and awesome moments in the series. Alien: Earth might technically be a prequel to the movies, but it delivers in ways the movies never do.\nAs this is all happening, Hawley also makes sure every inch of every frame screams “Alien.” Wires are exploding from everywhere. Chains with hooks hang down from the ceilings. Plenty of blinking monitors and broken crates illuminate spaces. Everything has this almost gooey, gross feeling about it. That even extends to the characters, such as the head of Prodigy Boy Kavalier (Samuel Blenkin), a “boy genius” trillionaire who sees major opportunities when the Maginot crashes into his city. There’s also Kavalier’s synthetic sidekick Kirsch, played by Timothy Olyphant, who is supposed to be trustworthy but always has that whiff of something being wrong with him. We are constantly on our toes around these slimy characters, and it adds even more drama and mystery.\nThe heart of the show, though, once you get past the xenomorphs, is Wendy. Putting this superheroic robot, who has the mind and demeanor of a child, at the center of the action adds an extremely unique and profound feel to the whole show. She’s loveable, she’s sweet, she can rip your head off in two seconds, and she can jump off cliffs without a scratch. As we watch her struggle with her new body, her emotions, her past, and eventually these creatures, we’re watching not just this fascinating, layered character; we’re watching a megastar be born in Chandler. She’s incredible.\nAlien: Earth is incredible too. It took this self-proclaimed, lifelong Alien super fan on a ride unlike anything I’d been on in years. I was left completely entertained, wholly engaged, and desperate to learn more about everything in this world. There are scares, surprises, and a story that keeps you wanting more and more. Best of all, all of it can, and will, be derailed at any time by a well-placed Facehugger, a Chestburster, or one of those giant, acid-for-blood monsters.\nAlien: Earth debuts with a two-part premiere August 12 on both Hulu and FX and will continue each Tuesday after that. Episodes drop at 8 p.m. EST on Hulu and 8 p.m. EST/PST on FX. Don’t miss it.\nCorrection: An original version of this article misnamed the ship from the show as the USS Maginot. It’s actually the USCSS Maginot, which has been updated. We also added more specifics about when episodes air.\nWant more io9 news? Check out when to expect the latest Marvel, Star Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about the future of Doctor Who."
    },
    {
      "url": "https://gizmodo.com/warner-bros-dc-release-dates-hbo-max-cast-details-1848354161",
      "text": "The DC Extended Universe is finally giving Marvel a run for its money—something that’s bound to increase now that James Gunn is running the show. The DCEU’s myriad projects stretch far beyond superhero mainstays Batman, Superman, and the Justice League, promising to include new and interesting takes on DC Comics’ enormous stable of characters.\nWhat follows is an up-to-date list of everything DCEU-related that’s on the way: DC movies heading to theaters, as well as DC streaming movies and shows coming to Max.\nLast updated 8/23/2023.\nWhat’s the next DC Movie?\nAquaman and the Lost Kingdom\nRelease date: December 20 (in theaters)\nDirector James Wan returns for the next adventure following Arthur Curry (Jason Momoa) as the newly crowned King of Atlantis. Now in his new role, Arthur will explore more of the world under the sea while also dealing with new threats from Black Manta (Yahya Abdul-Mateen II) and others. Like Shazam 2, Aquaman 2 has endured its share of release-date changes, with its new Christmas 2023 date designed to give Wan and company ample time to complete all the necessary special effects.\nUpcoming DC Movie Release Dates\nJoker: Folie à Deux\nRelease date: October 4, 2024 (in theaters)\nTodd Phillips never saw his Joker movie as anything but a singular film. But over a billion dollars at the box office and an Oscar for Best Actor (for star Joaquin Phoenix) obviously changed things. We have a few nuggets of info so far: the title is Joker: Folie à Deux(French for “shared madness”), Phoenix is returning and will co-star with Lady Gaga (who’s playing Harley Quinn), Zazie Beetz is probably returning as Arthur Fleck’s neighbor, and… it’s likely going to be a musical? Filming wrapped in early April 2023.\nThe Batman 2\nRelease date: 2025 (in theaters)\nHot off the success of Matt Reeves’ long-awaitedThe Batman, everyone involved made it clear that wasn’t a one-and-done. Robert Pattinson’s Batman will be back. Will he face off with the Joker? It’s possible but not definitive. You’d imagine the Penguin and Catwoman could be back too. We don’t know much yet about this one, but we do know it won’t be arriving until 2025.\nCurrent DC Shows\nDoom Patrol Season 4, Part 2\nRelease date: TBD 2023 (on Max)\nThe fourth and final season of Doom Patrol—starring Brendan Fraser, Matt Bomer, Diane Guerrero, April Bowlby, Joivan Wade, Timothy Dalton, Skye Roberts, and Michelle Gomez—already aired its first batch of episodes; the remaining six will return later this year.\nUpcoming DC Movies and Shows Without Release Dates\nThe Penguin\nRelease date: Unknown (on Max)\nYou saw him in The Batman and now, Colin Farrell’s Penguin is getting his own Max series. As of April 2023, the show is in production, with a cast that also includes Cristin Milioti, Rhenzy Feliz, Michael Kelly, Shohreh Aghdashloo, and Deirdre O’Connell, with Clancy Brown and Michael Zegen recurring.\nPeacemaker Season 2\nRelease date: Unknown (on Max)\nFrom the instant that opening credits scene rolled for the first time, DC fans and non-fans alike fell in love with Peacemaker. Well, he’s coming back, still played by John Cena and still from the twisted mind of James Gunn. There’s no word on when it’ll happen but we’re guessing 2024.\nSuperman: Legacy\nRelease date: July 11, 2025\nJames Gunn will write and direct this Superman movie, which is touted as not being an origin story. Casting announcements started with Clark Kent/Superman and Lois Lane, who’ll be played by David Corenswet and Rachel Brosnahan. We also know Isabela Merced will play Hawkgirl, Edi Gathegi is Mister Terrific, and Nathan Fillion is a Green Lantern (Guy Gardner), as well as Anthony Carrigan as Metamorpho.\nMore Upcoming DC Movies and Shows Announced for the Gunn/Safran Era\nThe shake-up at DC Studios got a huge zap of energy at the end of January, when James Gunn and Peter Safran announced their massive slate of planned projects. Little is known about most of these projects so far in terms of cast and crew and even release dates—but we do have a few tidbits for each.\nCreature Commandos (An animated Max show) – A seven-episode animated series written by James Gunn himself. It stars Indira Varma (Obi-Wan Kenobi, Game of Thrones) as the Bride, who’s the lead character, and Marvel veteran Frank Grillo as Rick Flagg Sr.—father of Rick Flagg, played by Joel Kinnaman in The Suicide Squad. The rest of the cast includes David Harbour (Stranger Things) as Eric Frankenstein, Sean Gunn (Guardians of the Galaxy Vol. 3) as G.I. Robot, Zoe Chao (The Afterparty) as Nina Mazursky, Alan Tudyk (Star Wars: Rogue One) as Dr. Phosphorus, Maria Bakalova (Guardians of the Galaxy Vol. 3) as new character Princess Ilana Rostovic, and Peacemaker’s Steve Agee and Sean Gunn returning as John Economos and Weasel, respectively.\nWaller (A live-action Max show) – Viola Davis will reprise her Suicide Squad character; the story will bring back characters from the Peacemaker show and tell a story with events set between Peacemaker seasons one and two.\nLanterns (A live-action Max show) – Set on Earth, this mystery series will follow Hal Jordan and John Stewart doing their thing as DC’s “super cops.”\nThe Authority (Theatrical film) – The Wildstorm superhero characters will make their big-screen debut in a film co-written by Gunn.\nParadise Lost (A live-action Max show) – How did Wonder Woman’s world, Themyscira, come to be? Find out in this Game of Thrones-ish tale set before her birth.\nThe Brave and the Bold (Theatrical film) – Based on the acclaimed Grant Morrison comic run, this will explore the story of Batman’s son, Damien Wayne, and will feature “other members of the extended Bat-family.”\nBooster Gold (A live-action Max show) – The “loser from the future” superhero character gets his own series.\nSupergirl: Woman of Tomorrow (Theatrical film) – Based on Tom King’s comics run, this movie will explore how Supergirl is different from Superman. It’s not yet certain if Sasha Calle, who plays Supergirl in The Flash, will reprise the role here.\nSwamp Thing (Theatrical film) – The character’s “dark origins” will be the focus of this one. DC does horror! Rumored but not yet confirmed to be directing, James Mangold (Indiana Jones 5) told Collider that he’s slated to write the script.\nUpcoming DC Movies and Shows That Were Once in Development, But Whose Fate Is Unclear in the Gunn/Safran Era\nTa-Nehisi Coates and J.J. Abrams’ Superman movie\nRelease date: Unknown (in theaters)\nThe news of Superman: Legacy cast uncertainty on this project from writer Ta-Nehisi Coates and producer J.J. Abrams. There hadn’t been an update on this one in a while, but in late April, James Gunn himself told io9 that the two films don’t necessarily cancel each other out: “That’s an exciting movie … if it comes in and it’s great … and if the timing is right, that could absolutely happen. That’s totally unrelated. It would be an Elseworlds tale like Joker.”\nMichael B. Jordan Superman Series\nRelease date: Unknown (for Max)\nMichael B. Jordan was once developing a Superman take for Max as a limited series that would feature Val-Zod as opposed to Clark Kent. Again, there hasn’t been an update in a while.\nStatic Shock\nRelease date: Unknown\nPart of the relaunch of the Milestone comic brand is this adaptation produced by, once again, Michael B. Jordan. A writer was hired back in 2021 to come up with a script and we haven’t heard much since.\nJustice League Dark\nRelease date: Unknown (for Max)\nJ.J. Abrams was among the people involved with bringing this evil super-team to life and while there hasn’t been a ton of movement on the project of late, it’s been around long enough that we’d imagine it happens eventually.\nMetal Men\nRelease date: Unknown\nOne of the more recent pre-Gunn/Safran DC films to go into development, this is this tale of six beings based on various powerful metals. It’s from directors Ron Clements and John Musker (Aladdin, The Little Mermaid, and Moana), so if it happens, it’ll have an incredible pedigree.\nZatanna\nRelease date: Unknown\nLast year, Emerald Fennell won an Oscar for writing Promising Young Woman. She followed that up landing the job to write this DC superhero flick about the young magician. Like most of the films in this section, there hasn’t been movement in a while.\nHourman\nRelease date: Unknown\nYes, the hero who takes a drug that makes him a hero for an hour was, back in 2021, rumored to be in development. Whether or not that’s still the case is unknown but we figured it was worth noting.\nUntitled Arkham Show\nRelease date: Unknown (on Max)\nIn addition to The Penguin, Matt Reeves has said he plans to expand the world of The Batman into Max shows. At one point, a series about Gotham PD was in the works, but now he says it might be more about the inner workings at Arkham Asylum. On October 25, The Staircase’s Antonio Campos came aboard as a writer—the third to hold that position on the potential series so far—and may direct and serve as showrunner if the show happens, according to a report in Variety.\nWant more io9 news? Check out when to expect the latest Marvel and Star Wars releases, what’s next for the DC Universe on film and TV, and everything you need to know about House of the Dragon and Lord of the Rings: The Rings of Power."
    },
    {
      "url": "https://gizmodo.com/ridley-scott-has-thoughts-on-that-upcoming-alien-tv-sho-1847847547",
      "text": "Ridley Scott is never one to mince words. Just Google his name and you’re likely to find the legendary director’s hot takes on a variety of subjects, like extraterrestrials, Star Wars, and beyond. That’s especially true when it comes to franchises he helped make famous like Blade Runner and Alien. So, with the first Alien TV show in the works, it’s no surprise that Scott’s opinion of it is decidedly spicy.\nLate last year, Disney confirmed that writer-director Noah Hawley was working on a brand new TV show based on the iconic Alien franchise. But, unlike the movies from Scott, James Cameron, David Fincher, and others, which mostly take place on faraway planets or in space, Hawley’s story will be set on Earth. “The alien stories are always trapped,” he said earlier this year. “Trapped in a prison, trapped in a space ship. I thought it would be interesting to open it up a little bit so that the stakes of ‘What happens if you can’t contain it?’ are more immediate.”\nWhich, hypothetically, sounds interesting since the Alien stories were largely about keeping the aliens away from Earth. Flipping that at least makes sense as a way to do something new and fresh. However, one person seems to disagree: Ridley Scott. “It’ll never be as good as the first one,” Scott told The Independent when asked for his opinion on the show. “That’s what I’ll say.”\nBy just saying that, Scott is obviously implying a lot. He’s implying that he’s not a fan of the idea or the show and that he feels his version of the franchise remains the best which, honestly,it pretty much does. In the same interview he even pointed out that having the xenomorph creature at the center of the story isn’t necessarily what audiences want, using the example that his prequel Prometheus, which didn’t center on xenomorphs (though one does appear), massively outgrossed Alien: Covenant, which did.\nNeither of those films are as good as the original either, so Scott’s opinion on the show kind of applies to his own work as well. Nevertheless, anytime the director of Alien, Blade Runner, Gladiator, and The Martian talks, we love to listen.\nWondering where our RSS feed went? You can pick the new up one here."
    },
    {
      "url": "https://gizmodo.com/star-wars-movies-tv-shows-release-dates-disney-1848494806",
      "text": "“Star Wars! Nothing but Star Wars! Give me those Star Wars! Don’t let them end…” Just as Bill Murray said it in 1978, we’re still saying it today. Star Wars is everywhere these days, with multiple movies and TV shows in the works from Disney and Lucasfilm. This article will give you the most up-to-date Star Wars release dates so you know exactly when every new Star Wars movie or Disney+ show will arrive.\nWhat are the next three movies? What TV shows are coming up? Have any TV shows or movies been canceled? What are people saying about what’s next? We’ve got you covered on all things in a galaxy far, far away.\nThis post was last updated on 9/13/2023.\nWhat’s the next Star Wars movie?\nSharmeen Obaid-Chioy’s New Jedi Order Film Film\nRelease Date: TBD, but May 26, 2026, December 18, 2026 or December 17, 2027 (In Theaters)\nAt Star Wars Celebration 2023 in London, Lucasfilm announced that three Star Wars movies are now in the works.\nJames Mangold (Indiana Jones 5) will direct a film 25,000 years before any known Star Wars timeline about the first Jedi to use the Force.\nDave Filoni will direct a film that’s kind of the Star Wars Disney+ Avengers, telling the story of a climactic event meeting the stories of The Book of Boba Fett, The Mandalorian, Ahsoka and more in the time between Return of the Jedi and The Force Awakens.\nAnd Sharmeen Obaid-Chioy will direct a film set 15 years after the events of The Rise of Skywalker following Rey (Daisy Ridley) as she creates a New Jedi Order.\nThis last one, we think, is the film that Damon Lindelof (Lost, The Leftovers, Watchmen) was co-writingwith Justin Britt-Gibson before departing the project. Steven Knight is now reportedly writing.\nA week after the news of these films first broke, it began to seem like the Rey project by Obaid-Chioy could be the first one out of the gate. However, in June, Disney shuffled its release schedule and moved its December 2025 Star Wars movie to May 2026, and added a third Star Wars movie to the schedule in December 2026. So maybe these three movies are on those dates. We’ll see.\nUpcoming Star Wars release dates\nThese shows and movies have all been officially announced and are in various stages of production, even if we don’t know when they will definitely come out.\nStar Wars: Ahsoka\nRelease Date: Now Playing (On Disney+)\nThe first full live-action Ahsoka Tano show from co-creator Dave Filoni is finally here. Rosario Dawson is, of course, returning. And our first look at footage confirmed that actress Natasha Liu Bordizzo has been cast as Sabine Wren; more recently, Eman Esfandi was confirmed as Ezra Bridger. At Star Wars Celebration this year we learned Mary Elizabeth Winstead is playing Hera Syndulla, Lars Mikkelsenis playing Grand Admiral Thrawn and Wes Chatham is his right-hand man.\nWhat does that all mean? Well, in the first teaser trailer, you can see she’ll make good onthe Star Wars Rebels finale and go after Thrawn. And what about the fact she knows Luke Skywalker now? And how does Ray Stevenson’s lightsaber-wielding character fit in?\nThe show is now airing on Disney+ and here you can read our weekly recaps:\nEpisode 1, “Master and Apprentice: and Episode 2, “Toil and Trouble”\nEpisode 6, premiering September 19\nEpisode 7, premiering September 26\nEpisode 7, premiering October 3\nStar Wars: Skeleton Crew\nRelease Date: 2023 (On Disney+)\nCreated by Spider-Man Homecoming/Far From Home/No Way Home director Jon Watts along with writer Chris Ford, this mystery Star Wars show is now currently in development. The title for the show was released during the Star Wars Celebration, and was previously internally referred as “Grammar Radio.” Celebration also revealed its headlining star, Jude Law.\nSet after the events of Return of the Jedi, Skeleton Crew is described as an adventure in the mold of Amblin adventures of the 1980s. The show will be about seeing the galaxy through the eyes of children (but it is not a kids show), and will follow a group of children who get lost in the galaxy and try to find their way home. Jon Watts explained that the series will take place during the same time period as the upcoming Ahsoka series and The Mandalorian.\nFilming on the series began in 2022 and ended in early 2023. And though not much is know about what happens on the show,it has been revealed that The Daniels, the Oscar-winning directors of Everything Everywhere All At Once, directed an episode. Ditto David Lowery, who did the film The Green Knight. Read more about the show here.\nio9 saw the first footage at Star Wars Celebration 2023 and you can read about it here. Three of the main stars of the show are played by Ravi Cabot-Conyers, Kyriana Kratter, and Robert Timothy Smit. Rumors suggest it could debut in November or December 2023.\nStar Wars: The Acolyte\nRelease Date: 2024 (On Disney+)\nRussian Doll co-creator Leslye Headland will be the first person to bring the excellent High Republic timeline into live-action with this show, long rumored to star Amandla Stenberg before an actual confirmation finally arrived at San Diego Comic-Con 2022—one of few Star Wars bits of news to emerge from the convention.\nIn an interview in 2022, Headland revealed the show would be about 100 years before the events of The Phantom Menace. “A lot of those characters haven’t even been born yet,” she said. “We’re taking a look at the political and personal and spiritual things that came up in a time period that we don’t know much about. My question when watching The Phantom Menace was always like, ‘Well, how did things get to this point?’ How did we get to a point where a Sith lord can infiltrate the Senate and none of the Jedi pick up on it? Like, what went wrong? What are the scenarios that led us to this moment?”\nIn an interview released later, Headland spoke about her goals for the series. For Headland, above all else The Acolyte is a mystery, and that mystery is figuring out what is going on in this peak period. It was also suggested that The Acolyte will bring more elements from the Expanded Universe to canon, but what parts that will be incorporated will remain to be seen.\nIn September 2022, both Jodie Turner-Smith and Squid Game’s Emmy-winning Lee Jung-Jae joined the cast, with an official announcement in November adding Carrie-Anne Moss, Manny Jacinto, and others to the roster. The first image, which you see above, was released in November and you can read about the first footage here, which was shown at Star Wars Celebration 2023.\nAnd no, despite what bullcrap rumors you may have been reading online, the show has not been canceled.\nAndor: Season 2\nRelease Date: August 2024 (On Disney+)\nSeason one of Tony Gilroy’s Rogue One prequel starring Diego Luna showed an excitingly different side of Star Wars. Season two will reportedly be spread across the four years leading up to Rogue One, with four episodes covering each year in Cassian Andor’s life until that fateful point. Filming began in late 2022.\nAt Star Wars Celebration 2023, Gilroy announced the show should be out in August 2024 and showed fans the first footage from the season. Read about it here. Plus, the final episodes of the season/series will take place just days before Rogue One, leading right into that story.\nOne minor hiccup though, due to the Writer’s Guild strike, showrunner and head writer Tony Gilroy left his duties show in May 2023. He’s unlikely to return until the Writer’s Strike is over, which could cause a delay.\nStar Wars: A Droid Story\nRelease Date: TBD (On Disney+)\nLucasfilm Animation is teaming up with Industrial Light and Magic for this streaming show that will “introduce us to a new hero, guided by legendary duo R2-D2 and C-3PO.” We don’t know anything beyond that and there hasn’t been a significant update in years, which could be a good thing or bad thing.\nStar Wars: Lando\nRelease Date: TBD (On Disney+)\nWay back in December 2020, Disney announced a bunch of Star Wars TV shows. Among them was a Lando show which, at the time, was going to be made by Dear White People creator Justin Simien. After that, things went quiet for about three years. Then,in an April 2023 article, Donald Glover hinted that he’s still interested and it’s still possible in the works. A May 2023 interview with Lucasfilm president Kathleen Kennedy confirmed it’s still in the works.\nThe first significant update in almost three years came in July when news broke that Simien has been off the project since he started working on Haunted Mansion, and not only is Donald Glover going to star in the series, he’s co-writing it with his brother Stephen.\nUntitled Taika Waititi Star Wars Movie\nRelease Date: TBD\nIn May 2020, news broke that Oscar-winning director of Thor: Ragnarok would be helming and co-writing along with Krysty Wilson-Cairns. “Taika’s approach to Star Wars will be fresh, unexpected, and … unique,” Lucasfilm president Kathleen Kennedy said. “His enormous talent and sense of humor will ensure that audiences are in for an unforgettable ride.”\nThere was a time when this was likely to be the next Star Wars film but, after Star Wars Celebration 2023, it seems like it’s now on the back burner. That was confirmed by Lucasfilm president Kathleen Kennedy who said the Oscar-winner is still working on the film, it’s just going slowly.\nIn the past, Waititi has discussed some broad ideas of what he wants to do with his upcoming film. Read those below.\nTaika Waititi Doesn’t Want Star Wars to Rely on Legacies\nAre You as Confused About Taika Waititi’s Star WarsMovie as We Are?\nUntitled Dave Filoni Star Wars Movie\nRelease Date: TBD\nWe mentioned this one above but, at some point, Dave Filoni will be directing a film that is meant to be a climactic event wrapping up stories that have begun on shows he’s involved with such as The Mandalorian, Ahsoka, The Book of Boba Fett, Skeleton Crew and others.\nUntitled James Mangold Star Wars Movie\nRelease Date: TBD\nThis was one of the three films announced at Star Wars Celebration but, like Filoni’s, isn’t likely to be next. This one is set 25,000 years before the original trilogy and tells the story of the first person to use the Force.\n“For me, it’s about, I want to be part of the saga, but I also don’t want to be holding so much lore in the air that you can hardly tell a story,” Mangold told io9 when asked about this film. “And what I really wanted to do…was just can we make a kind of the Ten Commandments of the Force, you know? A kind of origin story of how the Force came to be known, understood, wielded, and harnessed.” We love this idea so much we even wrote about it.\nStar Wars Movies and TV Shows That Are Currently Unscheduled and Haven’t Been Officially Announced, But We Think Are Still Happening\nThe Mandalorian Season 4\nRelease Date: TBD\nWith The Mandalorian Season 3 now in the books, all eyes look ahead to season 4. However, the season has not yet been officially announced. Unofficially though, series creator Jon Favreau said he’s already written a fourth season which he probably wouldn’t have done just for fun. It’s coming. It’s just a matter of when, especially with writers and actors on strike.\nThe Book of Boba Fett Season 2\nRelease Date: TBD (On Disney+)\nThe Book of Boba Fett season one ended with the implication that we’d see more of these character in the future. But alas, there has been no official announcement… yet. Dive into the making-of season one while we wait and ponder the words of executive producer Robert Rodriguez who said he knows when the character is coming back, but he can’t say when.\nUntitled Shawn Levy Movie\nRelease Date: TBD\nShawn Levy, the prolific director and producer behind Stranger Things, Night at the Museum, and Free Guy is gearing up to develop a film in a galaxy far far away. He’ll focus on that after completing Deadpool 3, which stars Ryan Reynolds and Hugh Jackman.\nStar Wars Movies and TV Shows That Are Currently Unscheduled and Probably NOT Going To Happen\nStar Wars: Rangers of the New Republic\nOriginally announced alongside shows like Obi-Wan Kenobi, Ahsoka, and Andor, Rangers of the New Republic was rumored to be Cara Dune’s show which would tie into The Mandalorian and Book of Boba Fett. However, with actress Gina Carano no longer a part of Star Wars, word on the street is this will no longer be happening. Nothing is official though.\nUntitled Rian Johnson Trilogy\nLet’s be honest. Do we think this is happening anymore? Probably not. Rian Johnson has moved on to other things. But, until we hear otherwise (and no one is officially saying), we’d be remiss if we didn’t mention that before the divisive release of The Last Jedi, Lucasfilm officially said Johnson would make his very own trilogy. It hasn’t officially been canceled yet but, in a new interview, Lucasfilm president Kathleen Kennedy suggested that it’s been placed on the back burner as Johnson does other things. With Johnson’s next film, Glass Onion, set for release in late 2022 though, he’s been quoted saying he still hopes these movies happen. So do we.\nStar Wars: Rogue Squadron\nFor several years, Wonder Woman director Patty Jenkins’ film about pilots in the Star Wars universe has been earmarked as the next film. Well, that’s no longer the case. After months of rumors suggesting it might move off its 2023 release date, Disney officially took it off the schedule. On December 13 2022, Jenkins said the movie is still in “active development” but recent news suggests it’s dead. Lucasfilm president Kathleen Kennedy disagrees, saying in May 2023 it’s still on the books.\nUntitled Kevin Feige Movie\nMarvel Studios President Kevin Feige is best known for helping create the Marvel Cinematic Universe. But as much as he loves Marvel, he loves Star Wars even more. And so it was exciting to hear that he was producing a Star Wars movie and even recruited Loki and Doctor Strange in the Multiverse of Madness writer Michael Waldron to help him. Feige doesn’t like to even acknowledge this project though and in a 2022 interview, Lucasfilm president Kathleen Kennedy also tiptoed around the project’s existence. Then, a few weeks before Star Wars Celebration 2023, we learned the project is likely dead.\nFor more, check out io9’s list of every canceled (or re-worked) Disney Star Wars project.\nWant more io9 news? Check out when to expect the latest Marvel, Star Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about the future of Doctor Who."
    },
    {
      "url": "https://gizmodo.com/doctor-who-release-dates-streaming-ncuti-gatwa-rtd-1849745140",
      "text": "At a Glance:\nDoctor Who ended the eras of both Chris Chibnall as series showrunner and Jodie Whittaker as the 13th Doctor in 2022 with “The Power of the Doctor,” bringing to a close a three-season, three-special run.\nWhittaker’s replacement is returning star David Tennant. He will play the official 14th incarnation of the Doctor under returning showrunner Russell T. Davies, who revived Doctor Who in 2005 and managed the series until 2009.\nTennant will appear in three specials in November 2023 to coincide with the 60th anniversary of Doctor Who on November 23.\nHe’ll be joined by returning characters Donna Noble and Wilfred Mott, who were played by Catherine Tate and Bernard Cribbins in season four of Doctor Who. Neil Patrick Harris will play a new villain, while Heartstopper’s Yasmin Finney will play a character named Rose.\nTennant will be succeeded by Sex Education’s Ncuti Gatwa as the 15th Doctor. His announcement in May 2022 makes him the first Black male actor to play the character on-screen.\nGatwa will star in Doctor Who’s 14th season, set to air some time in 2024.\nMillie Gibson will co-star as the 15th Doctor’s companion.\nGame of Thrones star Indira Varma will play a mysterious character known as “the Duchess.”\nDoctor Who’s beloved tradition of doing a Christmas Special—no more New Year’s Day Specials, in other words—will return in 2023, with another confirmed for 2024.\nComedian Sooz Kempner will star in Doom’s Day, a new transmedia Doctor Who campaign tied into the anniversary. She’ll play Doom, the titular intergalactic assassin, who has found herself hunted by Death itself—and must use a purloined vortex manipulator with a day’s worth of time-jumping charge to find the Doctor and save herself.\nThis post was last updated 5/30/23.\nWhat’s Been Going on in Doctor Who?\nThree Doctor Who specials aired out the last days of Jodie Whittaker’s time as the Doctor in 2022. “Eve of the Daleks” saw the Doctor and her companions Dan (introduced in the prior 13th season, known as Doctor Who: Flux) and Yaz facing the titular iconic monsters in a time loop paradox. “Legend of the Sea Devils” revived the classic ‘70s monsters for a new adventure, while “Power of the Doctor” saw the 13th Doctor face off against the Master in an adventure that ultimately saw her mortally wounded, returning her companions to contemporary Earth while she regenerated into a new body.\nWhy Is David Tennant the Doctor Again? Is David Tennant Playing the 10th Doctor?\nWhittaker regenerated not into previously announced new Doctor Ncuti Gatwa, but David Tennant, who played the official 10th incarnation of the Time Lord from Christmas 2005 to New Year’s Day 2010, before reprising the role for Doctor Who’s 50th anniversary special, “The Day of the Doctor,” in 2013.\nWhile this marks his first return on-screen in the series since then, Tennant will not be playing the 10th Doctor, but the official 14th incarnation—and the character will be aware that they are both using a familiar form and are a new entity. Aside from the fact that Tennant is arguably the most popular actor to take on the role, so bringing him back for the 60th anniversary makes sense, there’s plenty of reasons Doctor Who can come up with as to why the Doctor’s regenerative process decided to re-use an old identity, more of which you can read about here.\nWhen Will Doctor Who Return in 2023?\nDoctor Who will return for three special episodes in November 2023, set to air in celebration of the series’ 60th anniversary.\nWhat Is Doctor Who’s 60th Anniversary Special About?\nAside from Tennant returning as the Doctor, he’ll be joined by former companions Donna Noble and Wilfred Mott, played by Catherine Tate and Bernard Cribbins (the actor’s last role prior to his passing in July 2022) in Doctor Who’s fourth season. Donna exited the series as a regular character after an adventure lead to her needing to have her memory wiped by the 10th Doctor, forgetting her time alongside him lest her mind face grievous harm, so just how Donna will play into the the story remains to be seen.\nThe Doctor and Donna will face a mysterious new adversary, played by Neil Patrick Harris, and will be joined in the specials by Yasmin Finney as a new character named Rose. How Finney’s Rose might connect to the other famous Rose of Doctor Who, Billie Piper’s Rose Tyler, also remains to be seen.\nIs There a Trailer for Doctor Who’s 60th Anniversary?\nThe first premiered at the end of “The Power of the Doctor,” and you can watch it above. The second premiered in December and you can watch it here:\nWhen Will Ncuti Gatwa Become the Doctor?\nGatwa is briefly seen in the trailer for Doctor Who’s 60th anniversary, so will presumably follow the long tradition of new Doctors appearing in the final moments of their predecessor’s last episodes to become the 15th Doctor. The BBC has announced that Gatwa will appear as the Doctor first “over the festive season” in 2023, before he takes over full-time in a new season of the show after that.\nIs There a Doctor Who Season 14 Release Date?\nThere’s no current release date for season 14 of Doctor Who, but it is expected to be broadcast some time in 2024.\nWhere Is Doctor Who Streaming in the U.S. and UK?\nCurrently, the first 13 seasons of the revived Doctor Who are streaming on the BBC iPlayer in the UK; in the U.S., the revived series streams exclusively on HBO Max. In both countries, episodes from the classic era of the show are available through Britbox.\nThis will change in 2023, at least in the U.S. The BBC and Disney have announced that as part of a new deal, Doctor Who will stream exclusively worldwide on Disney+, except for in the UK and Ireland, where it will still stream on the BBC iPlayer and BBC One. It’s currently unknown if this will affect Doctor Who’s place on BBC America, where it currently airs in the U.S..\nDoes Disney Co-Own Doctor Who Now?\nA report in the wake of the BBC/Disney announcement from British paper the Telegraph alleged that the deal will also see Disney contribute finances to help create the show, and while the series’ creative team will still hold control of the series primarily, the deal will allow Disney some level of say in the creative decisions for the series—as well as allowing access to talent or “cinematic production moments” previously inaccessible due to the BBC’s budget for the show.\nNone of this has been confirmed by the BBC, however. The announcement strictly focused on Disney’s acquisition of Doctor Who’s streaming rights, and did not mention any co-owning. The new era of the series will be made for the BBC by Bad Wolf Studios, created by former Doctor Who producer Julie Gardner and former BBC Controller of Fiction Jane Tranter—which is now owned by Sony Pictures Television, after the studio took a majority stake in Bad Wolf in December 2021. The series was previously made by BBC Studios directly.\nIn January, Davies did say that Doctor Who is now working with a bigger budget, telling GQ that Disney’s involvement came about as part of “the BBC’s notion to go for a streamer to invest in the show worldwide … We’re not on the budget level with Star Wars and the Marvel shows, [but] it’s better than it was … We’re not allowed to talk about budget… but it’s more than I’ve ever had to work with.”\nWant more io9 news? Check out when to expect the latest Marvel,\nStar Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about James Cameron’s Avatar: The Way of Water."
    }
  ],
  "argos_summary": "The first two episodes of 'Alien: Earth' premiered, showcasing a blend of horror and philosophical themes within the iconic Alien franchise. The series introduces a deep-space research vessel, the USCSS Maginot, which crashes on Earth, leading to chaos as various alien creatures, including the xenomorph, emerge. Central to the plot is Wendy, a hybrid child created by a corporation, who grapples with her identity and the implications of immortality while trying to save her brother amidst the horror. The show has been praised for its engaging storytelling and emotional depth, marking a significant evolution of the franchise.",
  "argos_id": "LH5Q6K6UA"
}