{
  "url": "https://seekingalpha.com/article/4813043-glanbia-plc-glapf-q2-2025-earnings-call-transcript",
  "authorsByline": "SA Transcripts",
  "articleId": "56334b5180e14272b93a2142978f4933",
  "source": {
    "domain": "seekingalpha.com",
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-13T12:23:49+00:00",
  "addDate": "2025-08-13T12:26:47.796144+00:00",
  "refreshDate": "2025-08-13T12:26:47.796145+00:00",
  "score": 1.0,
  "title": "Glanbia plc (GLAPF) Q2 2025 Earnings Call Transcript",
  "description": "Glanbia plc (OTCPK:GLAPF) Q2 2025 Earnings Conference Call August 13, 2025 3:30 AM ETCompany ParticipantsHugh McGuire - CEO & Executive DirectorLiam...",
  "content": "Good day, and thank you for standing by. Welcome to the Glanbia 2025 Half Year Results Presentation. [Operator Instructions] Please be advised that today's conference is being recorded. I will now hand over to Liam Hennigan, Group Secretary and Head of Investor Relations, to open the presentation. Please go ahead.\n\nThank you. Good morning, and welcome to the Glanbia 2025 Half Year Results Call. During today's call, the directors may make forward-looking statements. These statements have been made by the directors in good faith based on the information available to them up to the time of their approval of the Glanbia Half Year 2025 results announcement. Due to the inherent uncertainties, including both economic and business risk factors underlying such forward-looking information, actual results may differ materially from those expressed or implied by these forward-looking statements.\n\nThe directors undertake no obligation to update any forward-looking statements made on today's call, whether as a result of new information, future events or otherwise. I'm now handing the call over to Hugh McGuire, CEO, Glanbia plc.\n\nThank you, Liam. Good morning, everyone, and welcome to the Glanbia Half Year 2025 Results Call and Presentation. I'm joined on today's call by Mark Garvey. I'll provide an overview of our performance for the first half, and Mark will then cover the financials and outlook. And at the end",
  "medium": "Article",
  "links": [
    "https://seekingalpha.com/symbol/GLAPF"
  ],
  "labels": [
    {
      "name": "Non-news"
    },
    {
      "name": "Opinion"
    },
    {
      "name": "Roundup"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Half Year",
      "weight": 0.11216779
    },
    {
      "name": "Glanbia plc",
      "weight": 0.10511438
    },
    {
      "name": "Glanbia",
      "weight": 0.09751613
    },
    {
      "name": "actual results",
      "weight": 0.09251024
    },
    {
      "name": "new information",
      "weight": 0.088905945
    },
    {
      "name": "Good morning",
      "weight": 0.08654753
    },
    {
      "name": "good faith",
      "weight": 0.08508967
    },
    {
      "name": "today",
      "weight": 0.08050778
    },
    {
      "name": "Mark Garvey",
      "weight": 0.07796437
    },
    {
      "name": "Group Secretary",
      "weight": 0.07532239
    }
  ],
  "topics": [
    {
      "name": "Markets"
    },
    {
      "name": "Earnings Calls"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.994140625
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.9873046875
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.97802734375
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.4638671875
    }
  ],
  "sentiment": {
    "positive": 0.14800623,
    "negative": 0.13354935,
    "neutral": 0.7184444
  },
  "summary": "The announcement of the Glanbia 2025 Half Year Results will be made at the bottom of the page. The company's representatives may make forward-spirational statements regarding the company's performance, but these statements are subject to numerous uncertainties due to both economic and business risk factors. The call will be opened and covered by Liam Hennigan, Group Secretary and Head of Investor Relations, who will provide an overview of our performance for the first half and discuss the financial implications.",
  "shortSummary": "Granath's Glanbia plc's Q2 2025 results call, featuring Hugh McGuire, Mark Garvey, and other notable individuals, may contain forward-looking statements about their performance.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "77c055dfc83044c88b6a3a6279ef7ae0",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Glanbia plc held its Half Year Results Presentation for 2025, where CEO Hugh McGuire and Group Secretary Liam Hennigan discussed the company's performance and provided forward-looking statements. The directors cautioned that actual results may differ from these projections due to various economic and business risks. Mark Garvey will present the financial details and outlook following McGuire's overview.",
  "argos_id": "NLLQYJSD8"
}