{
  "url": "https://www.morningstar.com/news/pr-newswire/20250813ph50673/servicepower-previews-the-future-of-field-service-with-ai-on-demand-home-services-cloud",
  "authorsByline": "",
  "articleId": "7f352129c1fd4cdfb9162bc62d407254",
  "source": {
    "domain": "morningstar.com",
    "location": {
      "country": "us",
      "state": "IL",
      "county": "Cook County",
      "city": "Chicago",
      "coordinates": {
        "lat": 41.8755616,
        "lon": -87.6244212
      }
    }
  },
  "imageUrl": "https://images.contentstack.io/v3/assets/blt4eb669caa7dc65b2/blta7dd42ebdd7b93b8/61899b34a3c7df383578294c/morningstar-og.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-13T07:27:00-05:00",
  "addDate": "2025-08-13T12:54:05.783571+00:00",
  "refreshDate": "2025-08-13T12:54:05.783573+00:00",
  "score": 1.0,
  "title": "ServicePower Previews the Future of Field Service with AI On-Demand Home Services Cloud",
  "description": "ServicePower Previews the Future of Field Service with AI On-Demand Home Services Cloud",
  "content": "Platform will connect brands with 222,000 vetted contractors to deliver intelligent, automated, and compliant service at scale.\n\nMCLEAN, Va., Aug. 13, 2025 /PRNewswire/ -- ServicePower, a leading provider of field service management solutions, today unveiled its vision for the On-Demand Home Services Cloud—the first and only AI-assisted platform designed to transform how brands deliver service. When fully realized, the platform will combine contracted workforce management, AI/ML-driven intelligence, and access to over 222,000 fully vetted contractors across more than ten home service trades.\n\nDesigned for a wide-variety of industries including home and extended warranty providers, home appliance manufacturers, fiber optic broadband companies, utilities deploying smart meters, single-family and multi-family property managers, the On-Demand Home Services Cloud will enable brands to deliver high first-time fix rates while providing complete transparency throughout the service lifecycle.\n\nBuilding on ServicePower's industry-leading field service platform and enhanced by recent acquisitions—including Inveniam (AI-powered diagnostics and computer vision) and PlusOne Solutions (broad-based contractor intelligence and compliance)—the Home Services Cloud will combine multiple layers of intelligence to enable smarter decision-making and service execution.\n• Contractor Intelligence – Build and maintain the optimal contractor network by combining your own resources with ServicePower's extensive pool of vetted contractors, all evaluated through a platform-wide scorecard to ensure the best contractor is always assigned.\n• Asset Intelligence – Understand and predict asset performance and needs.\n• Parts Prediction – Ensure the right part is ready for every repair.\n\n\"This is a game-changer for brands, contractors, and consumers,\" said Frank Gelbart, CEO of ServicePower. \"With our new Home Services Cloud, we're not just connecting jobs to contractors, we're using intelligence at every step to ensure the right labor, the right part, and the right outcome, every time. No one else offers this level of automation and precision.\"\n\nFor contractors, the platform represents a powerful growth opportunity. ServicePower helps identify, recruit, onboard, and activate contractors while managing profiles, background checks, licensing, and insurance. The acquisition of PlusOne Solutions further expands opportunities by connecting contractors with major brands that need service coverage.\n\n\"Brands need trusted partners to deliver quality service at scale,\" Gelbart added. \"With ServicePower, they get the first and only fully automated, AI-driven platform that ensures exceptional experiences for everyone involved.\"\n\nTo learn more and speak with our team about how this vision can align with your organization visit servicepower.com.",
  "medium": "Article",
  "links": [
    "https://c212.net/c/link/?t=0&l=en&o=4487643-1&h=326007625&u=http%3A%2F%2Fwww.servicepower.com%2F&a=servicepower.com",
    "https://c212.net/c/link/?t=0&l=en&o=4487643-1&h=1347164054&u=https%3A%2F%2Fwww.servicepower.com%2Fblog%2Fservicepower-acquires-inveniam&a=Inveniam",
    "https://c212.net/c/link/?t=0&l=en&o=4487643-1&h=446484393&u=https%3A%2F%2Fwww.servicepower.com%2Fblog%2Fservicepower-acquires-plusone-solutions&a=The+acquisition+of+PlusOne+Solutions",
    "https://c212.net/c/link/?t=0&l=en&o=4487643-1&h=3915022292&u=https%3A%2F%2Fwww.servicepower.com%2Fblog%2Fservicepower-acquires-plusone-solutions&a=PlusOne+Solutions",
    "https://www.prnewswire.com/news-releases/servicepower-previews-the-future-of-field-service-with-ai-on-demand-home-services-cloud-302528981.html",
    "https://mma.prnewswire.com/media/820704/ServicePower_Logo.html"
  ],
  "labels": [
    {
      "name": "Opinion"
    },
    {
      "name": "Roundup"
    },
    {
      "name": "Press Release"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "vetted contractors",
      "weight": 0.1008715
    },
    {
      "name": "contractors",
      "weight": 0.09384369
    },
    {
      "name": "Field Service",
      "weight": 0.0929651
    },
    {
      "name": "field service management solutions",
      "weight": 0.089734346
    },
    {
      "name": "Home Services Cloud",
      "weight": 0.087534755
    },
    {
      "name": "quality service",
      "weight": 0.085324585
    },
    {
      "name": "service",
      "weight": 0.08450355
    },
    {
      "name": "service execution",
      "weight": 0.083249636
    },
    {
      "name": "service coverage",
      "weight": 0.08293269
    },
    {
      "name": "intelligence",
      "weight": 0.06864585
    }
  ],
  "topics": [
    {
      "name": "AI"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.95947265625
    },
    {
      "name": "/Computers & Electronics/Software/Business & Productivity Software",
      "score": 0.8857421875
    },
    {
      "name": "/Computers & Electronics/Enterprise Technology/Other",
      "score": 0.68701171875
    },
    {
      "name": "/Internet & Telecom/Web Services/Cloud Storage",
      "score": 0.55419921875
    },
    {
      "name": "/News/Technology News",
      "score": 0.393798828125
    },
    {
      "name": "/Computers & Electronics/Enterprise Technology/Data Management",
      "score": 0.356201171875
    },
    {
      "name": "/Business & Industrial/Business Operations/Management",
      "score": 0.321533203125
    }
  ],
  "sentiment": {
    "positive": 0.7513672,
    "negative": 0.033795644,
    "neutral": 0.21483716
  },
  "summary": "ServicePower, a leading provider of field service management solutions, has unveiled its vision for the On-Demand Home Services Cloud, the first AI-assisted platform designed to transform how brands deliver service. The platform will connect brands with over 222,000 vetted contractors across more than ten home service trades. It will be designed for industries such as home and extended warranty providers, home appliance manufacturers, utilities, and property managers. The company's CEO, Frank Gelbart, described the platform as a game-changer for brands, contractors, and consumers. The acquisition of PlusOne Solutions further expands opportunities by connecting contractors with major brands.",
  "shortSummary": "ServicePower's new AI-assisted Home Services Cloud combines extensive vetted contractors and sophisticated workforce management, enabling brands to deliver intelligent, automated service at scale and ensure compliance for multiple industries.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "7a536363c3ee458e84b3c8ebcb62cc43",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://c212.net/c/link/?t=0&l=en&o=4487643-1&h=1347164054&u=https%3A%2F%2Fwww.servicepower.com%2Fblog%2Fservicepower-acquires-inveniam&a=Inveniam",
      "text": "ServicePower Acquires Inveniam, Revolutionizing Field Service Management with Vision AI Technology\nMcLean, VA and Paris, France – May 7, 2025 – ServicePower, a leading provider of field service management software, today announced its acquisition of Inveniam, a French-based pioneer in AI-powered computer vision technology designed to automate quality assurance for field operations. This strategic acquisition marks a significant step in ServicePower’s mission to drive innovation and automation in the global field service management industry.\nInveniam delivers cutting-edge visual intelligence solutions that allow enterprises—particularly in the telecommunications, utilities, and infrastructure sectors—to conduct real-time quality assurance and operational assessments as well as guide the work technicians are performing in the field with computer vision and AI techniques. With this acquisition, ServicePower strengthens its ability to offer data-driven, automated insights that reduce costs, boost technician efficiency, and elevate the customer experience.\n“This acquisition marks a transformative milestone for ServicePower and our customers,” said Frank Gelbart, chief executive officer of ServicePower. “Inveniam’s proprietary AI technology enables us to bring a new layer of intelligence to the field—allowing for smarter decision-making, real-time visual diagnostics, and better service outcomes. We’re excited to integrate Inveniam’s vision into our platform and push the boundaries of what field service technology can achieve.”\n“Joining forces with ServicePower represents a pivotal moment in our journey to revolutionize field operations through Vision AI,” added Ahmed Ghorbal, founder, and chief executive officer of Inveniam. “Since founding Inveniam, I’ve been driven by the goal of turning visual complexity in the field into scalable, real-time intelligence. Integrating our technology into ServicePower's esteemed platform amplifies our impact, bringing us closer to a future where field operations are smarter, more autonomous, and highly efficient.”\nThe integration of Inveniam’s technology will allow ServicePower customers to benefit from AI-powered visual data capture and analysis—automating everything from fiber optic installation checks to asset condition monitoring. This will drive higher first-time fix and install rates, reduce manual oversight, and support predictive service models.\nServicePower plans to integrate Inveniam’s capabilities into its platform over the coming months, with dedicated solutions tailored to key verticals, including telecommunications, utilities, and infrastructure.\nThe transaction officially closed on May 6, 2025. Financial details were not disclosed.\n###\nAbout ServicePower\nServicePower is a global leader in AI-powered field service management software, helping enterprise organizations drive operational and cost-saving efficiencies. With end-to-end optimization of workforce productivity, its solutions deliver real-time scheduling, intelligent automated contractor dispatch, and enhanced customer, contractor, and employee experiences. Trusted by Fortune 500 companies, including GE Appliances, LG, Electrolux, Hisense, and AIG, ServicePower is the only cloud-based platform that seamlessly manages both employed and contracted workforces to drive improved first-time fix rates, reduced drive times, higher CSAT, and fast ROI. With integration across CRM, ERP, and IoT systems, ServicePower is a scalable, intelligent field service solution that transforms field operations and elevates the end customer journey. The company is headquartered in McLean, Virginia, and operates across the US and EMEA. For more information, visit servicepower.com.\nAbout Inveniam\nFounded in 2018, Inveniam is a leading provider of AI-powered computer vision solutions that enhance operational efficiency in telecommunications, utilities, and infrastructure sectors. Recognized for its innovative approach, Inveniam has partnered with industry leaders to transform field operations through advanced visual data analysis. Visit inveniam.fr/.\nMedia Contact:\nServicePower\nHeather Mills\nVice President, Marketing\nh.mills@servicepower.com"
    },
    {
      "url": "https://c212.net/c/link/?t=0&l=en&o=4487643-1&h=3915022292&u=https%3A%2F%2Fwww.servicepower.com%2Fblog%2Fservicepower-acquires-plusone-solutions&a=PlusOne+Solutions",
      "text": "ServicePower Acquires Inveniam, Revolutionizing Field Service Management with Vision AI Technology\nServicePower Acquires Inveniam, Revolutionizing Field Service Management with Vision AI Technology\n2 min read\nServicePower : June 06, 2025\nMcLean, VA & Orlando, FL — June 6, 2025 — ServicePower, a global leader in field service management software, and PlusOne Solutions, a premier provider of background screening and contractor compliance solutions, announced today that the two companies will come together in a strategic acquisition.\nTogether, the companies will integrate their technologies, contractor networks and long-time industry expertise to create a best-in-class offering for field workforce optimization—seamlessly bridging field service management, Certificate of Insurance and License Management Solutions, background checks, and contractor onboarding. Customers will benefit from access to a broader suite of products, solutions and over 79,000 vetted contractors across a broad set of trades – HVAC, plumbing, electrical, home improvement, appliance, electronics, furniture repair and home services to efficiently manage their contracted workforces, drive revenue, and improve end-customer satisfaction.\n“We have been partners with PlusOne Solutions for many years, which makes this acquisition a natural fit and an exciting endeavor,” said Frank Gelbart, CEO of ServicePower. “Together, we will offer unmatched capabilities to organizations looking to streamline their field operations with robust, compliant, and scalable workforce solutions. PlusOne Solutions brings deep industry knowledge in background screening and contractor compliance solutions that complement our core field service platform. We look forward to offering clients a broader suite of solutions and an integrated, vetted network of home services providers, while maintaining the excellent quality of service they have come to expect.”\nGiven PlusOne Solutions’ well-established reputation within the industry, the company will continue to operate with the same name but as a ServicePower company for the foreseeable future.\n“We are excited to be combining with ServicePower to accelerate PlusOne’s strategic goals and deliver added value for our company, clients, and employees,” said Craig Reilly, CEO of PlusOne Solutions. “Our shared vision of helping companies build trusted, high-performing workforces is now stronger than ever. Working together with ServicePower allows us to bring greater innovation, enhanced automation, and an integrated experience to our clients and other contractor centric industries.”\nThe transaction officially closed on June 6, 2025. Financial details were not disclosed.\n###\nAbout ServicePower\nServicePower is a global leader in AI-powered field service management software, helping enterprise organizations drive operational and cost-saving efficiencies. With end-to-end optimization of workforce productivity, its solutions deliver real-time scheduling, intelligent automated contractor dispatch, and enhanced customer, contractor, and employee experiences. Trusted by Fortune 500 companies, including GE Appliances, LG, Electrolux, Hisense, and AIG, ServicePower is the only cloud-based platform that seamlessly manages both employed and contracted workforces to drive improved first-time fix rates, reduced drive times, higher CSAT and fast ROI. With integration across CRM, ERP, and IoT systems, ServicePower is a scalable, intelligent field service solution that transforms field operations and elevates the end customer journey. The company is headquartered in McLean, Virginia and operates across the US and EMEA. For more information, visit servicepower.com.\nAbout PlusOne Solutions\nPlusOne Solutions has been an industry leader in the risk management field by specializing in background screening, compliance and field service support programs that meet the complex challenges of geographically dispersed contractors, vendors, and employee networks. PlusOne Solutions protects companies from operational, financial, legal, and reputational risks associated with contractor and vendor relationships while creating safer work environments. To learn more, visit PlusOneSolutions.net.\nMedia Contact:\nServicePower\nHeather Mills\nVice President, Marketing\nh.mills@servicepower.com\nServicePower Acquires Inveniam, Revolutionizing Field Service Management with Vision AI Technology\nCombining ServicePower's field service management software with PlusOne Solutions' automated compliance platform, reduces risk, lowers costs, and...\nServicePower again named a Visionary in the Gartner report, which provides an overview of the Field Service Management marketplace"
    },
    {
      "url": "https://c212.net/c/link/?t=0&l=en&o=4487643-1&h=446484393&u=https%3A%2F%2Fwww.servicepower.com%2Fblog%2Fservicepower-acquires-plusone-solutions&a=The+acquisition+of+PlusOne+Solutions",
      "text": "ServicePower Acquires Inveniam, Revolutionizing Field Service Management with Vision AI Technology\nServicePower Acquires Inveniam, Revolutionizing Field Service Management with Vision AI Technology\n2 min read\nServicePower : June 06, 2025\nMcLean, VA & Orlando, FL — June 6, 2025 — ServicePower, a global leader in field service management software, and PlusOne Solutions, a premier provider of background screening and contractor compliance solutions, announced today that the two companies will come together in a strategic acquisition.\nTogether, the companies will integrate their technologies, contractor networks and long-time industry expertise to create a best-in-class offering for field workforce optimization—seamlessly bridging field service management, Certificate of Insurance and License Management Solutions, background checks, and contractor onboarding. Customers will benefit from access to a broader suite of products, solutions and over 79,000 vetted contractors across a broad set of trades – HVAC, plumbing, electrical, home improvement, appliance, electronics, furniture repair and home services to efficiently manage their contracted workforces, drive revenue, and improve end-customer satisfaction.\n“We have been partners with PlusOne Solutions for many years, which makes this acquisition a natural fit and an exciting endeavor,” said Frank Gelbart, CEO of ServicePower. “Together, we will offer unmatched capabilities to organizations looking to streamline their field operations with robust, compliant, and scalable workforce solutions. PlusOne Solutions brings deep industry knowledge in background screening and contractor compliance solutions that complement our core field service platform. We look forward to offering clients a broader suite of solutions and an integrated, vetted network of home services providers, while maintaining the excellent quality of service they have come to expect.”\nGiven PlusOne Solutions’ well-established reputation within the industry, the company will continue to operate with the same name but as a ServicePower company for the foreseeable future.\n“We are excited to be combining with ServicePower to accelerate PlusOne’s strategic goals and deliver added value for our company, clients, and employees,” said Craig Reilly, CEO of PlusOne Solutions. “Our shared vision of helping companies build trusted, high-performing workforces is now stronger than ever. Working together with ServicePower allows us to bring greater innovation, enhanced automation, and an integrated experience to our clients and other contractor centric industries.”\nThe transaction officially closed on June 6, 2025. Financial details were not disclosed.\n###\nAbout ServicePower\nServicePower is a global leader in AI-powered field service management software, helping enterprise organizations drive operational and cost-saving efficiencies. With end-to-end optimization of workforce productivity, its solutions deliver real-time scheduling, intelligent automated contractor dispatch, and enhanced customer, contractor, and employee experiences. Trusted by Fortune 500 companies, including GE Appliances, LG, Electrolux, Hisense, and AIG, ServicePower is the only cloud-based platform that seamlessly manages both employed and contracted workforces to drive improved first-time fix rates, reduced drive times, higher CSAT and fast ROI. With integration across CRM, ERP, and IoT systems, ServicePower is a scalable, intelligent field service solution that transforms field operations and elevates the end customer journey. The company is headquartered in McLean, Virginia and operates across the US and EMEA. For more information, visit servicepower.com.\nAbout PlusOne Solutions\nPlusOne Solutions has been an industry leader in the risk management field by specializing in background screening, compliance and field service support programs that meet the complex challenges of geographically dispersed contractors, vendors, and employee networks. PlusOne Solutions protects companies from operational, financial, legal, and reputational risks associated with contractor and vendor relationships while creating safer work environments. To learn more, visit PlusOneSolutions.net.\nMedia Contact:\nServicePower\nHeather Mills\nVice President, Marketing\nh.mills@servicepower.com\nServicePower Acquires Inveniam, Revolutionizing Field Service Management with Vision AI Technology\nCombining ServicePower's field service management software with PlusOne Solutions' automated compliance platform, reduces risk, lowers costs, and...\nServicePower again named a Visionary in the Gartner report, which provides an overview of the Field Service Management marketplace"
    },
    {
      "url": "https://www.prnewswire.com/news-releases/servicepower-previews-the-future-of-field-service-with-ai-on-demand-home-services-cloud-302528981.html",
      "text": "Platform will connect brands with 222,000 vetted contractors to deliver intelligent, automated, and compliant service at scale.\nMCLEAN, Va., Aug. 13, 2025 /PRNewswire/ -- ServicePower, a leading provider of field service management solutions, today unveiled its vision for the On-Demand Home Services Cloud—the first and only AI-assisted platform designed to transform how brands deliver service. When fully realized, the platform will combine contracted workforce management, AI/ML-driven intelligence, and access to over 222,000 fully vetted contractors across more than ten home service trades.\nDesigned for a wide-variety of industries including home and extended warranty providers, home appliance manufacturers, fiber optic broadband companies, utilities deploying smart meters, single-family and multi-family property managers, the On-Demand Home Services Cloud will enable brands to deliver high first-time fix rates while providing complete transparency throughout the service lifecycle.\nBuilding on ServicePower's industry-leading field service platform and enhanced by recent acquisitions—including Inveniam (AI-powered diagnostics and computer vision) and PlusOne Solutions (broad-based contractor intelligence and compliance)—the Home Services Cloud will combine multiple layers of intelligence to enable smarter decision-making and service execution.\nThis includes:\n- Contractor Intelligence – Build and maintain the optimal contractor network by combining your own resources with ServicePower's extensive pool of vetted contractors, all evaluated through a platform-wide scorecard to ensure the best contractor is always assigned.\n- Service Intelligence – Optimize operations with end-to-end visibility.\n- Asset Intelligence – Understand and predict asset performance and needs.\n- Diagnostic Intelligence – Identify issues before a technician arrives.\n- Parts Prediction – Ensure the right part is ready for every repair.\n\"This is a game-changer for brands, contractors, and consumers,\" said Frank Gelbart, CEO of ServicePower. \"With our new Home Services Cloud, we're not just connecting jobs to contractors, we're using intelligence at every step to ensure the right labor, the right part, and the right outcome, every time. No one else offers this level of automation and precision.\"\nFor contractors, the platform represents a powerful growth opportunity. ServicePower helps identify, recruit, onboard, and activate contractors while managing profiles, background checks, licensing, and insurance. The acquisition of PlusOne Solutions further expands opportunities by connecting contractors with major brands that need service coverage.\n\"Brands need trusted partners to deliver quality service at scale,\" Gelbart added. \"With ServicePower, they get the first and only fully automated, AI-driven platform that ensures exceptional experiences for everyone involved.\"\nTo learn more and speak with our team about how this vision can align with your organization visit servicepower.com.\nContact:\nHeather Mills\n[email protected]\nSOURCE ServicePower\nWANT YOUR COMPANY'S NEWS FEATURED ON PRNEWSWIRE.COM?\nNewsrooms &\nInfluencers\nDigital Media\nOutlets\nJournalists\nOpted In\nShare this article"
    }
  ],
  "argos_summary": "ServicePower has launched the On-Demand Home Services Cloud, an AI-assisted platform aimed at revolutionizing service delivery by connecting brands with over 222,000 vetted contractors across various home service trades. This platform integrates contractor management, AI-driven intelligence, and predictive analytics to enhance service efficiency and transparency. Recent acquisitions, including Inveniam and PlusOne Solutions, bolster its capabilities in diagnostics and contractor compliance, positioning ServicePower as a leader in automated field service management.",
  "argos_id": "O5I9RE9TU"
}