{
  "url": "https://www.cnet.com/deals/lg-c5-series-oled-tv-amazon-sale/",
  "authorsByline": "Max McHone",
  "articleId": "79b720e2050044bfb4b940de0ba5f45d",
  "source": {
    "domain": "cnet.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "San Francisco",
      "city": "San Francisco",
      "coordinates": {
        "lat": 37.7790262,
        "lon": -122.419906
      }
    }
  },
  "imageUrl": "https://www.cnet.com/a/img/resize/3124fbd80652d8e74018c12dc9b0dac359cc4784/hub/2025/08/13/dc7ca854-63c7-4f9a-9d58-82dd9c5a5727/lg-c5-series-oled.jpg?auto=webp&fit=crop&height=675&width=1200",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-13T12:16:00+00:00",
  "addDate": "2025-08-13T12:28:41.444220+00:00",
  "refreshDate": "2025-08-13T12:28:41.444221+00:00",
  "score": 1.0,
  "title": "Amazon Slashes Up to $600 Off LG’s Gorgeous C5 Series OLED TVs for a Limited Time",
  "description": "This 2025 model is one of the best and brightest TVs on the market, and you've got a rare chance to grab any size at a serious discount right now.",
  "content": "LG's OLED TVs among the absolute best and brightest on the market right now, which has earned several models a spot on our list of the best TVs of 2025. However, they're also extremely pricey, which is why our reviewers have kept the previous-gen LG C4 series on the list, rather than replacing it with the new and improved C5 series.\n\nCNET TV expert Ty Pendlebury was impressed by the 2025 LG C5, but recommended waiting for a price drop if you're looking to upgrade. Well, now's your chance with Amazon offering up to $600 off models ranging from 42- to 83-inches. Just be sure to get your order in soon, as these discounts could expire at any time.\n\nOur reviewer was seriously impressed by this premium 2025 TV, specifically citing its excellent overall image quality, vivid colors and \"deep contrast expected of OLED.\" It features an absolutely stunning 4K display with a 120Hz native refresh rate and a peak brightness of around 1,400 Nits (200 more than the C4 series). It's also features LG's \"Perfect Black\" and \"Perfect Color\" tech, which provides black levels of less than 0.24 nits and 100% color fidelity.\n\nIt's equipped with a powerful Alpha A9 AI processor, which supports next-level AI upscaling to improve the resolution, brightness, depth and clarity of each frame. There are also some fun AI beslls and whistles Voice ID and personalized viewing suggestions, though our reviewer found these to be a bit unnecessary.\n\nAmazon currently has all screen sizes on sale. Prices start at $1,197 for the 42-inch model ($200 off), and range up to a staggering $4,797 for the massive 83-inch model ($600 off). Though midsize screens like the 55-inch model will offer the best value at $1,300 ($500 off).\n\nWith an absolutely stunning and vibrant 4K OLED display, the LG C5 series is one of the most advanced TVs on the market. It left quite an impression on our reviewer, who specifically noted that you should wait for a discount to pick one up. That makes this Amazon sale the perfect time to upgrade with the online retailer currently offering up to $600 off.",
  "medium": "Article",
  "links": [
    "https://www.amazon.com/dp/B0DYQMWSKG/ref=twister_B0FGDF5QTT?_encoding=UTF8&th=1&tag=cnet-buy-button-20",
    "https://www.amazon.com/dp/B0DYQF1Q3Z?th=1&tag=cnet-buy-button-20",
    "https://www.cnet.com/tech/home-entertainment/lg-c5-oled-tv-review-great-picture-now-wait-for-the-price-drop/",
    "https://www.amazon.com/dp/B0DYQF1Q3Z/ref=twister_B0FGDF5QTT?_encoding=UTF8&th=1&tag=cnet-buy-button-20",
    "https://www.amazon.com/dp/B0DSRHTGYG?tag=cnet-buy-button-20",
    "https://www.amazon.com/dp/B0BYPNLKP4?tag=cnet-buy-button-20",
    "https://www.amazon.com/dp/B0DYQF1Q3Z/ref=twister_B0FGDF5QTT?_encoding=UTF8&psc=1&tag=cnet-buy-button-20",
    "https://www.amazon.com/dp/B0CV9LXH45/?tag=cnet-buy-button-20",
    "https://www.cnet.com/tech/home-entertainment/best-tv/",
    "https://www.amazon.com/dp/B0CV9VGMPT/th=1?tag=cnet-buy-button-20",
    "https://www.amazon.com/dp/B0CVS18PH9/th=1?tag=cnet-buy-button-20"
  ],
  "labels": [
    {
      "name": "Paid News"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "C5 series",
      "weight": 0.08918771
    },
    {
      "name": "LG",
      "weight": 0.08154888
    },
    {
      "name": "CNET TV expert Ty Pendlebury",
      "weight": 0.0814548
    },
    {
      "name": "Alpha A9 AI",
      "weight": 0.07892653
    },
    {
      "name": "Gorgeous C5 Series",
      "weight": 0.078670576
    },
    {
      "name": "several models",
      "weight": 0.07824907
    },
    {
      "name": "C4 series",
      "weight": 0.07525886
    },
    {
      "name": "LG’s Gorgeous C5 Series OLED TVs",
      "weight": 0.074644774
    },
    {
      "name": "models",
      "weight": 0.072930835
    },
    {
      "name": "C5",
      "weight": 0.07107941
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Shopping/Consumer Resources/Product Reviews & Price Comparisons",
      "score": 0.96240234375
    },
    {
      "name": "/Shopping/Consumer Resources/Coupons & Discount Offers",
      "score": 0.3974609375
    }
  ],
  "sentiment": {
    "positive": 0.554463,
    "negative": 0.06352898,
    "neutral": 0.382008
  },
  "summary": "Amazon is selling LG's C5 Series OLED TVs for a limited time, offering up to $600 off for models from 42- to 83-inches. The TVs are among the best and brightest on the market, but they are also expensive. The C5 series features an advanced 4K display with a 120Hz native refresh rate and peak brightness of around 1,400 Nits, and features LG's \"Perfect Black\" and \"Perfect Color\" tech. All screen sizes are currently on sale at $1,197 for the 42-inch model and $4,797 for the 83-in model. However, these discounts could expire at any time.",
  "shortSummary": "Amazon is offering up to $600 off LG's flagship C5 Series OLED TVs, including the 2025 LG C5, offering discounts ranging from 42-to 83-inch models with excellent image quality and advanced AI upscaling.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "96f9bd508816417ba32ab4eb62997bc3",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.amazon.com/dp/B0CV9LXH45/?tag=cnet-buy-button-20",
      "text": "| Brand Name | Samsung |\n|---|---|\n| Item Weight | 93.7 pounds |\n| Product Dimensions | 13.6 x 74.8 x 44.2 inches |\n| Item model number | QN85Q60DAFXZA |\n| Color Name | Black |\n| Special Features | Well-lit details, Dual LED | True-to-life color, 100% Color Volume with Quantum Dot | A smart processor, Quantum Processor Lite with 4K Upscaling | Clear Motion, Motion Xcelerator | Incredible Audio, Object Tracking Sound Lite | Distinct contrast, Quantum HDR | Slim and Sleek, AirSlim | Samsung Tizen OS | Expert-validated colors | Game all day – no console required |\n| Speaker Type | 2CH |\n| Item Weight | 93.7 Pounds |\n| Standing screen display size | 85 Inches |\n| Aspect Ratio | 16:9 |\n| Voltage | 120 Volts |\nLearn more\nNo featured offers available\nWe feature offers with an Add to Cart button when an offer meets our high standards for:\n- Quality Price,\n- Reliable delivery option, and\n- Seller who offers good customer service\n- 8 VIDEOS\nImage Unavailable\nColor:\n-\n-\n-\n- To view this video download Flash Player\nSamsung 85-Inch Class QLED 4K Q60D Series Quantum HDR Smart TV w/Object Tracking Sound Lite, Motion Xcelerator, Slim Design, Gaming Hub, Alexa Built-in (QN85Q60D, 2024 Model)\nOur specialist Customer Support for large items dispatched from Amazon is on hand to help with your order. Contact us via phone or chat 7 days a week.\nAlexa Built-in\nThis smart TV has been certified by Amazon. Select Alexa Built-in smart TVs are Push-to-Talk and require pressing and holding the button on your remote to talk to Alexa, while other smart TVs have hands-free available with Alexa. Please see product details.\n| Screen Size | 85 Inches |\n| Brand | Samsung |\n| Display Technology | QLED |\n| Resolution | 4K |\n| Refresh Rate | 60 Hz |\n| Special Feature | Well-lit details, Dual LED | True-to-life color, 100% Color Volume with Quantum Dot | A smart processor, Quantum Processor Lite with 4K Upscaling | Clear Motion, Motion Xcelerator | Incredible Audio, Object Tracking Sound Lite | Distinct contrast, Quantum HDR | Slim and Sleek, AirSlim | Samsung Tizen OS | Expert-validated colors | Game all day – no console required See more |\n| Included Components | Power Cable, Remote, User Manual |\n| Connectivity Technology | Bluetooth, Wi-Fi |\n| Aspect Ratio | 16:9 |\n| Product Dimensions | 13.6\"D x 74.8\"W x 44.2\"H |\nAbout this item\n- DUAL LED: Get a natural, realistic picture and accurate contrast that adapts automatically to match your content with our innovative backlight technology\n- 100% COLOR VOLUME w/ QUANTUM DOT: Take in breathtaking color that stays true at any level of brightness; Marvel as your TV transforms light into over a billion beautiful shades¹\n- QUANTUM PROCESSOR LITE w/ 4K UPSCALING: Automatically transform your content into 4K and improve your sound; Our processor enhances each pixel, regardless of the source so you get great visuals and audio\n- MOTION XCELERATOR: Watch your content smoothly while experiencing less lag and blur; It improves motion between frames so you have a seamless picture\n- OBJECT TRACKING SOUND LITE: You’ll hear 3D surround sound that follows the movement on screen using our incredible virtual top channel audio—putting you right in the middle of the car chase, stampede or party scene\n- QUANTUM HDR: View a range of color, contrast and detail; Vibrant imagery brings full power to the picture\n- AIRSLIM: This TV blends right into your wall with a slim design; It brings clutter-free minimalism to the room without distracting you from what you watch\n- SAMSUNG TIZEN OS: Stream your favorite shows, play games, work out with a trainer; Do all you enjoy with Smart TV Powered by Tizen; Discover your must-have apps and streaming services all just a few clicks away²\n- PANTONE VALIDATED: Enjoy color validated by industry leading experts at Pantone, so that images on the screen look as incredible as they do in real life; Every hue, tint and skin tone offers a more accurate and beautiful picture\n- GAMING HUB: Where gaming comes together; Stream your favorite games right from your TV, no console required; You’ll also get recommendations on what to play next, based on what you like³\nProduct voltage: 120\nThis product is compatible with outlets that support 120 volts and might require a converter when used outside of the United States.\nTop Brand: Samsung\nWhat's in the box\nProduct information\nTechnical Details\nAdditional Information\n| ASIN | B0CV9LXH45 |\n|---|---|\n| Customer Reviews |\n4.4 out of 5 stars |\n| Best Sellers Rank |\n|\n| Date First Available | February 26, 2024 |\nWarranty & Support\nFeedback\nProduct Description\nThis advanced TV features a bright new world of color and contrast, with 4K upscaling and seamless motion for crisp, smooth content.\n¹QLED televisions can produce 100% Color Volume in the DCI-P3 color space, the format for most cinema screens and HDR movies for television. ²Samsung Account required for network-based smart services, including streaming apps and other smart features. Separate [connected] computer, mobile or other device may be necessary to create/log in to Samsung Account (free to download and create). Without Account log in, only external device connections (e.g., via HDMI) and terrestrial/over-the-air TV (only for TVs with tuners) available. ³High speed internet connection, additional gaming service subscriptions and compatible controller required. Samsung Account required for network-based smart services, including streaming apps and other smart features. Separate [connected] computer, mobile or other device may be necessary to create/log in to Samsung Account (free to download and create). Without Account log in, only external device connections (e.g., via HDMI) and terrestrial/over-the-air TV (only for TVs with tuners) available.\nFrom the manufacturer\nCustomer reviews\nCustomer Reviews, including Product Star Ratings help customers to learn more about the product and decide whether it is the right product for them.\nTo calculate the overall star rating and percentage breakdown by star, we don’t use a simple average. Instead, our system considers things like how recent a review is and if the reviewer bought the item on Amazon. It also analyzed reviews to verify trustworthiness.\nLearn more how customers reviews work on AmazonCustomers say\nCustomers praise the TV's picture quality, describing it as crystal clear with great contrast, and appreciate its value for money. The size receives mixed feedback, with some finding it perfect while others consider it small. Setup experiences are mixed, with some finding it very easy to use while others report it's not intuitive. The sound quality and functionality also get mixed reviews, with some finding the speakers adequate while others report issues with volume, and some saying it works well while others find it doesn't work very well. The TV's quality receives mixed feedback, with some finding it good while others express disappointment.\nAI Generated from the text of customer reviews\nCustomers praise the TV's picture quality, describing it as phenomenal with crystal clear visuals and great contrast.\n\"I love this tv. Great picture easy setup. Works well with game systems\" Read more\n\"...Beautiful picture great quality!\" Read more\n\"...but this fits perfect, was easy to set up, has a great picture, great sound, and a silly little remote that proves invaluable....\" Read more\n\"Happy with purchase. Nice picture.\" Read more\nCustomers praise the TV's picture quality, describing it as exquisite.\n\"Great TV, did my homework, was ready to buy it from Walmart for $1000 and then on sale for $600 on Prime Day! An offer I couldn't refuse.\" Read more\n\"Great tv! Sketchy about getting it off Amazon but highly recommend it. I’ve had it for two months and it’s gorgeous\" Read more\n\"Good TV. Brought into the home and hooked it up. Yes I recommend it for you.\" Read more\n\"Nice TV at a good price. This replaced an older Samsung TV that did not have all of the apps and could not be updated....\" Read more\nCustomers find the TV offers good value for money, describing it as a solid purchase. One customer specifically mentions getting resolution for $600.\n\"...awesome the feature as well i use every single as on there and also great price\" Read more\n\"...Bottom line though? Great value, for under $500 you really can't go wrong with it and you definitely can't find anything other than PC monitors that...\" Read more\n\"...Overall, excellent TV for what I think is a good price for what you get.\" Read more\n\"Great purchase for bedroom, need an upgrade and it was perfect size and price. Delivery, unboxing and setup were free!...\" Read more\nCustomers have mixed experiences with the TV's setup process, with some finding it easy to use while others report it being very hard to set up and not intuitive.\n\"...Very pleased with Samsung. Easy set up also.\" Read more\n\"This tv has an excellent picture and audio but the features are hard to understand for an elderly person. The joke of a manual isn’t much help....\" Read more\n\"I love this tv. Great picture easy setup. Works well with game systems\" Read more\n\"...but this fits perfect, was easy to set up, has a great picture, great sound, and a silly little remote that proves invaluable....\" Read more\nCustomers have mixed opinions about the TV's quality, with some finding it good while others express disappointment, particularly noting the flimsy remote.\n\"Great quality if you can get it on sale like I did....\" Read more\n\"...I was able to pull that out with some effort. It kept tearing but finally released from inside the console....\" Read more\n\"What a beautiful picture this tv has definitely the Samsung quality I pay for you will not be disappointed, fabulous experience 🥰🥰🥰...\" Read more\n\"Samsung TV is solid, great color picture and audio works well also. Have it in our master bedroom and works perfect for that application.\" Read more\nCustomers have mixed opinions about the TV's sound quality, with some finding it great and the speakers adequate, while others report issues with the volume, particularly noting that it gets louder with gunfire.\n\"...Wonderful picture and sound.\" Read more\n\"...Perhaps the poor sound quality seeks to encourage one to purchase a sound bar (interesting marketing strategy, since Samsung also sells those).\" Read more\n\"...but this fits perfect, was easy to set up, has a great picture, great sound, and a silly little remote that proves invaluable....\" Read more\n\"This tv has an excellent picture and audio but the features are hard to understand for an elderly person. The joke of a manual isn’t much help....\" Read more\nCustomers have mixed opinions about the TV's size, with some finding it perfect and noting it fits well in corners, while others consider it small, particularly mentioning the compact remote control.\n\"Great purchase for bedroom, need an upgrade and it was perfect size and price. Delivery, unboxing and setup were free!...\" Read more\n\"Big & Nice...\" Read more\n\"WoW what a great picture, Warning - this is a very large TV - LOL I did not realize the how big it is....\" Read more\n\"...ok, it's never going to blow you away but it definitely is decent enough for a small room....\" Read more\nCustomers have mixed experiences with the TV's functionality, with some saying it works beautifully while others report that it doesn't work very well.\n\"So far is working great and is a good quality\" Read more\n\"...set purchaser for years might make me a little bios but this set does a bad job with zero enhancements on B&W content as well, which you would...\" Read more\n\"Works well, especially for the price. I would give it 5 stars but when the first one arrived it was cracked....\" Read more\n\"I love this tv. Great picture easy setup. Works well with game systems\" Read more\nReviews with images\nHigh quality Asmongold TV\nTop reviews from the United States\nThere was a problem filtering reviews. Please reload the page.\n- Reviewed in the United States on April 28, 2025Size: 32-InchStyle: TV OnlyVerified PurchaseBought this for the size of it (32\") first and foremost and everything else was more or less secondary to that. What you are getting at this price is a very nice TV with a pretty good user interface. It's not the best on earth but it definitely does everything you need it to do. Certain things are just not explained well either. Like how do you add an app to the quick launch bar in the home menu?? I had to google how that worked. Should have been part of the setup process after logging you into all the common apps like Disney+, Netflix, Amazon, Hulu, and Youtube. Maybe you wanted them in a particular order, without googling it I wouldn't have figured it out.\nPicture-wise? You really can't go wrong with it. There is a bit of backlight bleed on one of the edges of my screen when staring at a black screen, but with content up? You can't even tell it's there. The fact that it's a 4K screen at this size is really awesome too. The amount of detail is just fantastic for the size; It really pulls you into whatever you're watching. Colors aren't too bad out of the box, skin tones look decent and accurate. Only real negatives are it doesn't get SUPER bright and it doesn't support 120HZ refresh rate so it's not the *best* for gaming.\nSound-wise? It's ok, it's never going to blow you away but it definitely is decent enough for a small room. If you want better sound there are always sound bars or full on surround setups that will solve that problem for you. Not an issue for me though.\nFinal note: Weird little thing I noticed when setting it up on a wall mount, it is a VESA 100x100 pattern, BUT.. The wall mount I bought came with either REALLY short screws, or Samsungs mounting depth is just too deep. I ended up running over to Home Depot to grab some longer screws and that ended up fixing my issue. Not sure who's at fault for this but it's worth knowing just in case you do end up mounting it to a wall.\nBottom line though? Great value, for under $500 you really can't go wrong with it and you definitely can't find anything other than PC monitors that are 4k in this size range. Wish I could give it 4.5 stars for the backlight bleed and weird UI but that doesn't seem fair, everything else is great.\n- Reviewed in the United States on July 27, 2025Size: 70-InchStyle: TV OnlyVerified PurchaseI love this tv. Great picture easy setup. Works well with game systems\n- Reviewed in the United States on July 20, 2025Size: 65-InchStyle: TV OnlyVerified PurchaseI did not expect to fall in love with a television... but I have. I am. I downsized from a bigger screen (can you imagine?) but this fits perfect, was easy to set up, has a great picture, great sound, and a silly little remote that proves invaluable. It has buttons to go directly to Netflix, Disney+, and Prime Video. There is also a button for Samsung TV Plus bonus channels and features, which are AMAZING!!!\n- Reviewed in the United States on July 30, 2025Size: 70-InchStyle: TV OnlyVerified PurchaseI have only had it for a couple of weeks, but I am very pleased with the tv. The picture is sharp and the technology is solid. Assuming it holds up over time, I would certainly recommend it.\n- Reviewed in the United States on June 30, 2025Size: 43-InchStyle: TV OnlyVerified PurchaseThis tv has an excellent picture and audio but the features are hard to understand for an elderly person. The joke of a manual isn’t much help. I still really don’t understand much of what it can do when it took me a half hour to adjust the volume when I first got it.\n- Reviewed in the United States on July 29, 2024Size: 65-InchStyle: TV OnlyVerified PurchaseWe bought this TV to replace a 10 year old Samsung that was a great TV. This model not so much, it is beyond disappointing.\nThe picture is just average, the sound is below average and the tiny solar powered remote is horrible. This TV will absolutely not turn off, you have to pair the remote before you try to turn it off each time and it normally takes 3 tries to get it to turn off. The instructions state you can turn it off at the bottom right side of the TV screen. Well, that doesn’t work either as the TV turns off then right back on as it does with the remote. We are planning on sending it back!\nUpdate: Unfortunately the Service Quick technicians, who were great guys, did not fix our TV (that would not turn off without unplugging it) on August 2, 2024. After they left our house that day TV still would not turn off with the remote or at the TV. A Samsung supervisor (Janie) called me on August 8, 2024, and told me the Service Quick Technicians would be at our house on 8/12/24 for yet another service call. During the conversation Janie said she believed we needed to remove the ROKU box from the TV to get it to turn off. She was correct! As a result, I called Samsung on August 9, 2024, to cancel the service appointment and was asked if I needed anything else. I said \"yes can you help me with the ROKU Box Problem\". I was then transferred to Technical Support and THANKFULLY spoke to Scarlette, who asked permission to take control of our TV remotely. 10 minutes later, thanks to Scarlette’s efforts, the TV would turn off with the ROKU Box still in use! Thank you Janie and Scarlette!\nI also need to add that in addition to fixing the ROKU problem Scarlina adjusted the picture settings on our new TV and the picture is now fantastic.\n**LESSONS LEARNED: Amazon was of no help in this entire two week process, stating we bought The Samsung QN65Q60D 65” TV from a third party vendor and the best Amazon could do for us was to file a claim for us. (We have the Amazon ad for this TV and it states our TV was bought and delivered from the Amazon Store). ** No more major purchases from Amazon.\nAs part of the Amazon purchase for this new TV we bought the 3 year warranty from Asurion. They were no help and specialized in apologizing for all the stress and inconvenience we suffered with this TV not turning off. Asurion finally stated that their warranty was not valid because our TV was defective from the factory, before we took delivery. ** No more warranty purchases from this company.\n- Reviewed in the United States on July 13, 2025Size: 75-InchStyle: TV OnlyVerified PurchaseThis 75 inch Samsung TV is everything I hoped it would be. Super clear, crisp sharp picture. I’m using my own surround sound system so I can’t speak to sound quality. Getting it set up online was quick and easy.\nWe used the free delivery, unbox and assemble service that Amazon offers on this TV. Fantastic service. Those two guys weren’t in the house 10 minutes and they were finished. They took the set up to a second floor, unboxed, installed the legs, then got it plugged in and on.\nI’ve wanted a big screen like this for years, but have no way of getting it home, inside the house and set up. Other venders offer delivery and setup but want $250.\nTop reviews from other countries\n-\nMaryReviewed in Mexico on March 9, 2025\n5.0 out of 5 stars Colores nítidos\nSize: 65-InchStyle: TV OnlyVerified PurchaseHasta ahora muy bien! Buena calidad\n-\nPierre LanouetteReviewed in Canada on May 4, 2025\n5.0 out of 5 stars Belle image\nSize: 70-InchStyle: TV OnlyVerified PurchaseComme neuf, impeccable\n-\nDaniel M. Garza K.Reviewed in Mexico on April 17, 2025\n5.0 out of 5 stars EXCELENTE RESOLUCION, LA PANTALLA REALMENTE DE 1\" DE ESPESOR\nSize: 32-InchStyle: TV OnlyVerified PurchaseEXCELENTE RESOLUCION, LA PANTALLA REALMENTE DE 1\" DE ESPESOR\n-\nJavierReviewed in Mexico on March 24, 2025\n1.0 out of 5 stars Recibí un producto que no era nuevo\nSize: 65-InchStyle: TV OnlyVerified PurchaseEl producto estaba claramente usado. Vino con el material de empaque en mal estado, sin film protector en la pantalla y con una falla pequeña, pero una falla al fin (había una zona oscura sin retroiluminación en una de las esquinas). Si el producto es reacondicionado o devuelto debería estar en la descripción.\n-\nNinaReviewed in Mexico on January 8, 2025\n5.0 out of 5 stars muy fácil de instalar, calidad de imagen fabulosa\nSize: 32-InchStyle: TV OnlyVerified PurchaseRecibimos la TV en tiempo y forma. Instalarla es súper fácil, incluso usando el control que viene con la TV. Por cierto, el control se carga con luz, y viene precargado para que todo sea sencillo. Tiene botones específicos para plataformas de uso común, como Netflix, Disney y Prime. Para imágenes con buena iluminación es fantástica. Para imágenes oscuras es igual que cualquier otra TV. Creo que es una muy buena compra.\nImportant information\nVisible screen diagonal\n85\" / 216 cm"
    },
    {
      "url": "https://www.amazon.com/dp/B0CV9VGMPT/th=1?tag=cnet-buy-button-20",
      "text": "| Brand Name | Samsung |\n|---|---|\n| Item Weight | 49.6 pounds |\n| Product Dimensions | 10.4 x 56.9 x 35.3 inches |\n| Item model number | QN65S90DAFXZA |\n| Batteries | 2 AAA batteries required. |\n| Output Wattage | 70 Watts |\n| Color Name | Graphite Black |\n| Special Features | NQ4 AI Gen2 Processor; HDR10+; Object Tracking Sound; Active Voice Amplifier Pro, OLED HDR Pro; Motion Xcelerator 144Hz; Ultra Viewing Angle; Real Depth Enhancer |\n| Speaker Type | 2.1CH |\n| Item Weight | 49.6 Pounds |\n| Standing screen display size | 65 Inches |\n| Aspect Ratio | 16:9 |\n| Wattage | 70 watts |\nLearn more\nNo featured offers available\nWe feature offers with an Add to Cart button when an offer meets our high standards for:\n- Quality Price,\n- Reliable delivery option, and\n- Seller who offers good customer service\n- 7 VIDEOS\nImage Unavailable\nColor:\n-\n-\n-\n- To view this video download Flash Player\nSamsung 65-Inch Class OLED 4K S90D Series HDR+ Smart TV w/Dolby Atmos, Object Tracking Sound Lite, Motion Xcelerator, Real Depth Enhancer, 4K AI Upscaling, Alexa Built-in (QN65S90D, 2024 Model)\nOur specialist Customer Support for large items dispatched from Amazon is on hand to help with your order. Contact us via phone or chat 7 days a week.\nAlexa Built-in\nThis smart TV has been certified by Amazon. Select Alexa Built-in smart TVs are Push-to-Talk and require pressing and holding the button on your remote to talk to Alexa, while other smart TVs have hands-free available with Alexa. Please see product details.\n| Screen Size | 65 Inches |\n| Brand | Samsung |\n| Display Technology | OLED |\n| Resolution | 4K |\n| Refresh Rate | 120Hz (Up to 144Hz) Hz |\n| Special Feature | NQ4 AI Gen2 Processor; HDR10+; Object Tracking Sound; Active Voice Amplifier Pro, OLED HDR Pro; Motion Xcelerator 144Hz; Ultra Viewing Angle; Real Depth Enhancer See more |\n| Included Components | Power Cable, Remote, User Manual |\n| Connectivity Technology | Bluetooth, Wi-Fi |\n| Aspect Ratio | 16:9 |\n| Product Dimensions | 10.4\"D x 56.9\"W x 35.3\"H |\nAbout this item\n- OLED TECHNOLOGY: Discover pure blacks, bright whites and Pantone-validated color; Combined with detail and brightness, this pixel-packed screen gives you a dramatic view for everything you watch\n- OLED HDR+: Enjoy powerful brightness and rich contrast; Your TV analyzes each scene to boost brightness and improve image clarity¹\n- MOTION XCELERATOR 144Hz: Play games and content with ultra-smooth motion and virtually no lag or blur; Get uninterrupted action with crisp visuals rendered at top speeds²\n- REAL DEPTH ENHANCER: Experience depth and dimension on screen just like you do in real life; For all content, Real Depth Enhancer mirrors how the human eye processes depth by increasing foreground contrast\n- 4K AI UPSCALING: Content instantly transformed to incredibly sharp up to 4K resolution; Whether you’re streaming an HD movie, watching live sports, or looking back at home videos, experience it all transformed into sharp 4K resolution³\n- DOLBY ATMOS & OBJECT TRACKING SOUND LITE: Keep your ears on the action with built-in Dolby Atmos; You’ll hear 3D surround sound that follows the movement on screen using our incredible virtual top channel audio\n- NQ4 AI GEN2 PROCESSOR: The power behind the 4K picture that actively improves the quality; Utilizing 20 specialized networks the AI-powered processor drives the intuitive Smart TV Hub, Dolby Atmos sound, and expertly upscaled 4K resolution\n- SAMSUNG TIZEN OS: Stream your favorite shows, play games and work out with a trainer; Do all you enjoy with Smart TV Powered by Tizen; Discover your must-have apps and streaming services all just a few clicks away⁴\n- PANTONE VALIDATED: Enjoy color validated by industry leading experts at Pantone, so that images on the screen look as incredible as they do in real life; Every hue, tint and skin tone offers a more accurate and beautiful picture\n- SAMSUNG GAMING HUB: Where gaming comes together; Stream your favorite games right from your TV, no console required; You’ll also get recommendations on what to play next, based on what you like⁵\nImportant information\nEnergy consumption\n213 kWh per year, based on the power consumption of the television operating 4 hours per day for 365 days. The actual energy consumption will depend on how the television is used.\nVisible screen diagonal\n65\" / 166 cm\nTop Brand: Samsung\nWhat's in the box\nProduct information\nTechnical Details\nAdditional Information\n| ASIN | B0CV9VGMPT |\n|---|---|\n| Customer Reviews |\n4.1 out of 5 stars |\n| Best Sellers Rank |\n|\n| Date First Available | March 21, 2024 |\nWarranty & Support\nFeedback\nProduct Description\nThis premium TV features a detailed image, strong contrast and clear motion. Increased depth and AI-powered 4K upscaling all work to bring clarity to your content. ¹S90D 48\" and 42\" have OLED HDR. ²144Hz requires compatible content connection from compatible PCs. Motion Xcelerator 144Hz is sometimes called Motion Xcelerator Turbo+. ³Utilizes AI-based formulas. ⁴Samsung Account required for network-based smart services, including streaming apps and other smart features. Separate [connected] computer, mobile or other device may be necessary to create/log in to Samsung Account (free to download and create). Without Account log in, only external device connections (e.g., via HDMI) and terrestrial/over-the-air TV (only for TVs with tuners) available. ⁵High speed internet connection, additional gaming service subscriptions and compatible controller required. Samsung Account required for network-based smart services, including streaming apps and other smart features. Separate [connected] computer, mobile or other device may be necessary to create/log in to Samsung Account (free to download and create). Without Account log in, only external device connections (e.g., via HDMI) and terrestrial/over-the-air TV (only for TVs with tuners) available.\nFrom the manufacturer\nCustomer reviews\nCustomer Reviews, including Product Star Ratings help customers to learn more about the product and decide whether it is the right product for them.\nTo calculate the overall star rating and percentage breakdown by star, we don’t use a simple average. Instead, our system considers things like how recent a review is and if the reviewer bought the item on Amazon. It also analyzed reviews to verify trustworthiness.\nLearn more how customers reviews work on AmazonCustomers say\nCustomers praise the TV's picture quality, with one noting a noticeable jump in performance, and appreciate its gorgeous colors that pop during movies. Moreover, the sound quality is good, and customers find it worth the price. However, the TV's functionality receives mixed reviews, with several customers reporting that it doesn't turn on anymore. Setup experiences are also mixed, with some finding it easy to set up and use while others find it difficult to handle. Additionally, build quality is a concern, with multiple customers reporting units arriving broken.\nAI Generated from the text of customer reviews\nCustomers praise the TV's picture quality, with one mentioning how it draws viewers into the content, while another notes the noticeable improvement in contrast and clarity.\n\"Great picture and refresh rate. I use it for gaming....\" Read more\n\"TV has a great picture and sound. The Samsung software is kind of a pain to get working....\" Read more\n\"The image is absolutely stunning. The picture is bright, clear and picture perfect right out of the box....\" Read more\n\"...The picture is amazing and the TV pairs incredible with Amazon's Echo Studios, which are designed for Dolby Atmos....\" Read more\nCustomers praise the TV's quality, with one mentioning it's perfect for watching the Olympics.\n\"Great tv with very accurate color and crisp image....\" Read more\n\"Great TV except there can only be one remote paired to the TV at a time. No more having dueling remotes, one for me and one for my wife....\" Read more\n\"This is great TV with great image quality! Also, the TV OS is very responsive, unlike some other TVs where its slow and leggie.\" Read more\n\"...My impression? The TV is Junk The Chat/help is worthless...\" Read more\nCustomers praise the TV's color contrast, noting that the colors are gorgeous and pop, with one customer highlighting its natural color temperature.\n\"...The TV is great!!!! Beautiful picture and the refresh algorithm and speed easily allows for one to see the football all the way across the screen...\" Read more\n\"...Incredible clarity and color. Worth every penny....\" Read more\n\"...Picture has outstanding quality with excellent brightness ,colors and contrast....\" Read more\n\"This TV has the sharpest picture, very good sound, great color and contrast, and it’s super thin and unobtrusive....\" Read more\nCustomers like the TV's sound quality, with one mentioning that voices are never buried and another noting that no special sound bar is needed.\n\"TV has a great picture and sound. The Samsung software is kind of a pain to get working....\" Read more\n\"...Just like it said in the reviews it has very good sound right from the TV. Easy to adjust the picture too....\" Read more\n\"...It makes my PS5 and PC games look next-level. The Dolby Atmos sound and Object Tracking Audio are also surprisingly good for built-in...\" Read more\n\"...The sound quality is better than any flat panel TV I have ever owned. There is no need for a stereo soundbar....\" Read more\nCustomers find the TV worth its price, with one mentioning it offers the best picture quality for the money.\n\"...I am 80 and got it done! Great price with all the features you could want, Was also from South Korea, not China. Support friendly nations!\" Read more\n\"...Incredible clarity and color. Worth every penny....\" Read more\n\"...tech inside, this paperthin monitor with 0 screen reinforcement is a scammy gemmic to minimize material cost and make it easy for people to break...\" Read more\n\"...Other than that, this tv was worth every penny. I will update this review if anything changes.\" Read more\nCustomers have mixed experiences with setting up the TV, with some finding it easy to use and intuitive, while others report it being a super pain to configure correctly.\n\"Love the 55 inch Samsung OLED 4K QN55S90D Smart TV. Easy to set up. SOUND, PICTURE QUALITY, AND REFRESH RATE ARE EXCELLENT!!!...\" Read more\n\"...The built-in threaded nuts are also not very well installed, 2 of mine seemed to be semi free-spinning and I had to slightly pull on the machine...\" Read more\n\"...I thought it was an easy setup from start to finish. I’m very happy with this absolutely gorgeous TV. :)...\" Read more\n\"...But happens rarely. Picture and sound is excellent. Easy setup. Easy to use and figure out the new style remote and navigate the menu.\" Read more\nCustomers have mixed experiences with the TV's build quality, with some finding it good while others report units arriving broken and being designed so fragile.\n\"Great quality. Very thin screen.\" Read more\n\"...A- speakers: for being on-board, they aren't bad B+ Build quality: mostly relative to competitors....\" Read more\n\"Awesome Picture and Brilliant Quality!...\" Read more\n\"...Update: just went off and tripped breaker, awaiting Samsungs repair company call and schedule fix...Make sure and get a warranty, they have 1 year...\" Read more\nCustomers report significant issues with the TV's functionality, with multiple units failing to turn on or powering off unexpectedly while in use. Additionally, several customers mention that the power supply failed after only a month of use.\n\"The tv died within 3 months of delivery - no power, seems like a motherboard failure....\" Read more\n\"After 5 months, the TV won't turn on....\" Read more\n\"Died suddenly and won't turn on. I'm returning it and going with LG. Never again Samsung.\" Read more\n\"Stopped working after one month. Amazon refused to help as a few days outside 30 day return window.\" Read more\nReviews with images\nAn amazing TV, a great price, shipped carefully by a great company. (Amazon)\nTop reviews from the United States\nThere was a problem filtering reviews. Please reload the page.\n- Reviewed in the United States on July 18, 2025Size: 55-InchStyle: TV OnlyVerified PurchaseAwesome Picture and Brilliant Quality! I am seeing my movies in a different way that blows my mind of the quality and accuracy of a 4k UHD in Movie Mode!! The pictures are amazing and bright, especially the dark black\nColors. I do not regret this purchase, especially during Amazon Prime Deals! My tv arrived earlier than expected and was taken care of. You will not regret buying this model.\n5.0 out of 5 starsAwesome Picture and Brilliant Quality! I am seeing my movies in a different way that blows my mind of the quality and accuracy of a 4k UHD in Movie Mode!! The pictures are amazing and bright, especially the dark blackBrilliant and Vibrant Features\nReviewed in the United States on July 18, 2025\nColors. I do not regret this purchase, especially during Amazon Prime Deals! My tv arrived earlier than expected and was taken care of. You will not regret buying this model.\nImages in this review\n- Reviewed in the United States on June 2, 2025Size: 65-InchStyle: TV OnlyVerified PurchaseI’m writing this just days after setting up my Samsung S90D 65” OLED TV (purchased May 2025), and all I can say is—WOW. I am very happy with this purchase.\nThe picture quality is jaw-dropping. Deep blacks, vibrant colors, and razor-sharp clarity make everything look incredible, whether it’s movies, sports, or streaming. But where this TV really shines for me is gaming—it is so freaking awesome! With Motion Xcelerator 144Hz and near-instant response times, gameplay is buttery smooth and totally immersive. It makes my PS5 and PC games look next-level.\nThe Dolby Atmos sound and Object Tracking Audio are also surprisingly good for built-in speakers—it feels like the action is all around you.\nSetup was quick, the interface is snappy, and the AI upscaling even makes older content look fresh. Easily one of the best tech purchases I’ve made recently.\n- Reviewed in the United States on January 3, 2025Size: 77-InchStyle: TV OnlyVerified PurchaseI waited until today to write this review of this TV for a specific reason to be shared below.\nThis comment has NOTHING to do with the seller or the actual delivery and setup. Both of those parts of the purchase went without issue or headache.\nThis TV was delivered December 9th and on Sunday December 29th the TV would not turn on.\nI first thought it might be the remote not getting enough solar charge, but that didn't seem to fix the issue after letting the remote set in light for a while. Not a reason I am giving this TV a score of 1 star, but there should be a way to see if the remote is getting enough power or is charging at all. I find it a bit ridiculous that there isn't a couple of LED lights on the remote to just let you know where you are in the charging aspect.\nI then did what any normal person would do and went to the Samsung website for assistance. The Samsung website was so useless that I don't even understand why they have the help section.\nNo red light?\nTry a different plug>You think!? It worked yesterday, but sure.\nPush the home button on the remote>Okay, but I don't know if the remote is charged, but nothing changed\nHit the power button on the TV to see if that fixes the issue> Okay, where is the power button? Since I have no manual and couldn't seem to find it on the website, I could only find \"For newer models it is usually on the right side of the TV\" > Only HDMI/USB ports on the right side of the TV.\nOut of options, I went to chat and got the automated chat that took me through the same steps. I get that for people who didn't read the help section. Then I requested to chat with someone, that person just wrote down what the help and automated chat stated before. I had to provide the SN of the device prior to them proceeding. When we got to the power button part, I kept saying there isn't a power button over here. Then I would ask through chat, you have my model, where is the power button? I just received the can answer of it being on the right side of the TV. I asked to escalate it to someone who wasn't going to provide me the canned answers and could actually help, I was directed to the Samsung in house support.\nI decided that trying chat again was not going to be useful. I then thought about returning the TV and purchasing something else, but got a good deal on this one for Black Friday. I decided to move forward with the in home support. The first day that they had available was Friday Jan 3rd, meaning 20 days of owning the TV it goes out and I have to wait 6 days with a broken TV equaling a 76% uptime on a brand NEW TV!\nI went back and started watching my 14 year old Panasonic Plasma TV ( I know old, but it was working) until the repairman arrived. I made sure that it was accessible per their instructions. When HE arrived to work on it, he informed me that I had to HELP him take it off the stand, place it on the floor for him to work on it. I asked him if he had a blanket for the floor and he seemed shocked that I wasn't going to provide my blanket for him to repair my device. He went and got one from the truck after he remember he had one. We put it down for him to repair the device and put it back together and back on the stand. He left in a rush that he didn't realize that he had left a part in the back of the TV. We had to do the same steps again to get HIS part out of the back of my TV! Before him leaving I asked if he had anything to clean the screen and he said no and left.\nThis got me starting to think where else do we accept this type of behavior? Would anyone go to get an oil change and need to help the mechanic drain the oil, because he couldn't? Then when getting back in the vehicle it is covered in oil and they just skip away! What about the people at home that cannot assist the in home support to get the TV down and on the floor? Do they just cancel and say, that is on you to get it on the floor, because that isn't the instructions provided prior to them coming out to fix a BRAND NEW TV!\nMy impression?\nThe TV is Junk\nThe Chat/help is worthless\nIn Home support is slow and lacking forethought\nI waited until today to write this review of this TV for a specific reason to be shared below.\nThis comment has NOTHING to do with the seller or the actual delivery and setup. Both of those parts of the purchase went without issue or headache.\nThis TV was delivered December 9th and on Sunday December 29th the TV would not turn on.\nI first thought it might be the remote not getting enough solar charge, but that didn't seem to fix the issue after letting the remote set in light for a while. Not a reason I am giving this TV a score of 1 star, but there should be a way to see if the remote is getting enough power or is charging at all. I find it a bit ridiculous that there isn't a couple of LED lights on the remote to just let you know where you are in the charging aspect.\nI then did what any normal person would do and went to the Samsung website for assistance. The Samsung website was so useless that I don't even understand why they have the help section.\nNo red light?\nTry a different plug>You think!? It worked yesterday, but sure.\nPush the home button on the remote>Okay, but I don't know if the remote is charged, but nothing changed\nHit the power button on the TV to see if that fixes the issue> Okay, where is the power button? Since I have no manual and couldn't seem to find it on the website, I could only find \"For newer models it is usually on the right side of the TV\" > Only HDMI/USB ports on the right side of the TV.\nOut of options, I went to chat and got the automated chat that took me through the same steps. I get that for people who didn't read the help section. Then I requested to chat with someone, that person just wrote down what the help and automated chat stated before. I had to provide the SN of the device prior to them proceeding. When we got to the power button part, I kept saying there isn't a power button over here. Then I would ask through chat, you have my model, where is the power button? I just received the can answer of it being on the right side of the TV. I asked to escalate it to someone who wasn't going to provide me the canned answers and could actually help, I was directed to the Samsung in house support.\nI decided that trying chat again was not going to be useful. I then thought about returning the TV and purchasing something else, but got a good deal on this one for Black Friday. I decided to move forward with the in home support. The first day that they had available was Friday Jan 3rd, meaning 20 days of owning the TV it goes out and I have to wait 6 days with a broken TV equaling a 76% uptime on a brand NEW TV!\nI went back and started watching my 14 year old Panasonic Plasma TV ( I know old, but it was working) until the repairman arrived. I made sure that it was accessible per their instructions. When HE arrived to work on it, he informed me that I had to HELP him take it off the stand, place it on the floor for him to work on it. I asked him if he had a blanket for the floor and he seemed shocked that I wasn't going to provide my blanket for him to repair my device. He went and got one from the truck after he remember he had one. We put it down for him to repair the device and put it back together and back on the stand. He left in a rush that he didn't realize that he had left a part in the back of the TV. We had to do the same steps again to get HIS part out of the back of my TV! Before him leaving I asked if he had anything to clean the screen and he said no and left.\nThis got me starting to think where else do we accept this type of behavior? Would anyone go to get an oil change and need to help the mechanic drain the oil, because he couldn't? Then when getting back in the vehicle it is covered in oil and they just skip away! What about the people at home that cannot assist the in home support to get the TV down and on the floor? Do they just cancel and say, that is on you to get it on the floor, because that isn't the instructions provided prior to them coming out to fix a BRAND NEW TV!\nMy impression?\nThe TV is Junk\nThe Chat/help is worthless\nIn Home support is slow and lacking forethought\nImages in this review\n- Reviewed in the United States on June 13, 2025Size: 65-InchStyle: TV OnlyVerified PurchaseThis was recommended by a consumer ratings website as a good match for the PS5 Pro. I could not agree more. The picture quality is amazing, and it elevates the gaming experience with a console that can take advantage of it. The screen is bright, sharp, and simply beautiful for gaming.\nBeyond that, I am not that excited about the 'Smart TV' functionality from Samsung. Most of my other TVs are Vizio. I prefer the 'smart tv' experience from Vizio over this one. If you use an external device for that functionality, it likely won't matter as much. The sound quality is better than any flat panel TV I have ever owned. There is no need for a stereo soundbar. If you're looking for surround sound, you will need an external soundbar/subwoofer. But, for gaming and TV shows, this has performed admirably for me.\n- Reviewed in the United States on July 28, 2025Size: 65-InchStyle: TV OnlyVerified PurchaseThis TV was a massive upgrade for me from my old TV and is incredible in image quality and brightness. The main thing to keep in mind is that the smaller models and the largest ones are only WOLED panels, as opposed to the QD-OLED panels of the middle sizes. The listing page doesn't say this anywhere that I could find, so do your research before buying the size you want.\nThe game mode works well with both the PlayStation 5 and the Switch 2. Having four HDMI 2.1 ports is also a big bonus over all the competition at this price point.\n- Reviewed in the United States on July 3, 2025Size: 65-InchStyle: TV OnlyVerified PurchaseI purchased the 65\" OLED. I wasn't prepared for how amazing the screen would look. It's my first OLED tv. My main reason for going with an OLED was for gaming. Between the higher refresh rate (than my previous tv) and the way \"black\" pixes are handled with OLEDs...I've had perfect gaming experiences. One complaint, that I won't ding the tv for, is how much heat it puts out. I have mine in the bedroom. It's like a little heater. I always feel the need to turn on the fan or open windows to compensate. It's worth it for that amazing screen.\nI would definately suggest using two people to set it up. It's not heavy. It's just an awqward weight. I've never been more afraid of breaking a tv...just for moving it. It is crazy thin at the top.\nI purchased the 65\" OLED. I wasn't prepared for how amazing the screen would look. It's my first OLED tv. My main reason for going with an OLED was for gaming. Between the higher refresh rate (than my previous tv) and the way \"black\" pixes are handled with OLEDs...I've had perfect gaming experiences. One complaint, that I won't ding the tv for, is how much heat it puts out. I have mine in the bedroom. It's like a little heater. I always feel the need to turn on the fan or open windows to compensate. It's worth it for that amazing screen.\nI would definately suggest using two people to set it up. It's not heavy. It's just an awqward weight. I've never been more afraid of breaking a tv...just for moving it. It is crazy thin at the top.\nImages in this review"
    },
    {
      "url": "https://www.amazon.com/dp/B0DYQMWSKG/ref=twister_B0FGDF5QTT?_encoding=UTF8&th=1&tag=cnet-buy-button-20",
      "text": "| Brand Name | LG |\n|---|---|\n| Item Weight | 22.3 pounds |\n| Product Dimensions | 6.7 x 36.7 x 22.7 inches |\n| Item model number | OLED42C5PUA.AUSZ |\n| Batteries | 2 AAA batteries required. (included) |\n| Special Features | Amd freesync, Built-In Speaker, Google Cast built-in, Multiple Voice Assistance, Nvidia G Sync |\n| Item Weight | 22.3 Pounds |\n| Standing screen display size | 42 Inches |\n| Aspect Ratio | 16:9 |\n| Voltage | 120 Volts |\nLearn more\nNo featured offers available\nWe feature offers with an Add to Cart button when an offer meets our high standards for:\n- Quality Price,\n- Reliable delivery option, and\n- Seller who offers good customer service\n- 7 VIDEOS\nImage Unavailable\nColor:\n-\n-\n-\n- To view this video download Flash Player\nLG 42-Inch Class OLED evo AI 4K C5 Series Smart TV w/Dolby Atmos, Dolby Vision, HDR10, AI Super Upscaling 4K, Filmmaker Mode, Wow Orchestra, Alexa Built-in (OLED42C5PUA, 2025)\nOur specialist Customer Support for large items dispatched from Amazon is on hand to help with your order. Contact us via phone or chat 7 days a week.\n| Screen Size | 42 Inches |\n| Brand | LG |\n| Display Technology | OLED |\n| Resolution | 4K |\n| Refresh Rate | 120 Hz |\n| Special Feature | Amd freesync, Built-In Speaker, Google Cast built-in, Multiple Voice Assistance, Nvidia G Sync |\n| Included Components | Power Cable, Remote Control, Stand, User Manual |\n| Connectivity Technology | Bluetooth, Ethernet, HDMI, USB, Wi-Fi |\n| Aspect Ratio | 16:9 |\n| Product Dimensions | 6.7\"D x 36.7\"W x 22.7\"H |\nAbout this item\n- Alpha 9 AI Processor Gen8. This processor is the brains behind a truly unforgettable TV experience. You'll get personalized smooth, vivid picture no matter what you watch. AI Super Upscaling technology automatically enhances picture quality whether you're watching sports, movies, or a late-night favorite. Everything looks and sounds incredible on a LG OLED TV.\n- PERFECT BLACK AND PERFECT COLOR: LG's flagship OLED technology creates an incredible watching experience and stellar picture quality with Perfect Black and Perfect Color technology on over 8.3 million self-lit smart pixels, even in bright rooms.\n- DOLBY VISION, DOLBY ATMOS, FILMMAKER MODE: Experience the magic of the big screen right from your couch. Loaded with Dolby Vision for extraordinary color, contrast and brightness, plus Dolby Atmos³ for sound you can feel all around you. Land in the center of the action with FILMMAKER MODE, allowing you to see films just as the director intended.\n- ULTIMATE GAMING: Packed with gaming features, this LG OLED evo Series comes with everything you need to win. Experience crisp, smooth imagery from a 0.1ms response time and up to 144Hz refresh rate⁴ to let you game at blinding speed without any blurring or tearing to keep up with the fastest games. All LG OLED TVs have NVIDIA G-Sync, AMD FreeSync Premium and VRR to further improve gaming quality. Four HDMI 2.1 inputs allow you to plug in all the devices you need. Whether you game on consoles or on the cloud,⁷ the LG Game Dashboard and Game Optimizer put all the control at your fingertips\n- PERSONALIZED PICTURE AND SOUND WIZARD: \"Set your personalized picture and audio settings. The Personalized Picture & Sound Wizard uses AI technology to analyze your favorite images and sound clips to create a personalized picture and audio experiences tailored for you. \"\n- AI SEARCH AND CONCIERGE: \"Set your personalized picture and audio settings. The Personalized Picture & Sound Wizard uses AI technology to analyze your favorite images and sound clips to create a personalized picture and audio experiences tailored for you. \"\n- WEBOS: Search less and stream more with LG’s Award-winning Smart TV platform - which delivers a smarter more personalized experience. Browse all your favorite streaming apps and let LG Channels connect you to over 350 free channels and thousands of titles on demand. Plus with LG’s Re:New Program enjoy future software updates and feature refreshes.\nProduct voltage: 120\nThis product is compatible with outlets that support 120 volts and might require a converter when used outside of the United States.\n4 stars and above\nTop Brand: LG\nWhat's in the box\nFrom the manufacturer\n-\nWorld's No.1 OLED TV Brand\nCelebrating 12 years of perfecting award-winning OLED TV technology.¹\n-\nBright and beautifulAlpha 9 AI Processor Gen8\nThis processor powers a truly unforgettable TV experience, delivering personalized, vivid picture with AI Super Upscaling² to enhance quality for sports, movies, or late-night favorites.\n-\nPerfect Black & Perfect Color\nOLED technology creates an incredible watching experience and stellar picture quality with perfect black and perfect color on over 8.3 million self-lit smart pixels, even in bright rooms.\n-\nBring home the magic of home cinema\nExperience the magic of the big screen at home with Dolby Vision for stunning color, contrast, and brightness, Dolby Atmos³ for immersive sound, and FILMMAKER MODE for films as the director intended.\nGame with the power of LG OLED\nBuilt for gaming with a 0.1ms response time, up to 144Hz refresh rate⁴, and no blurring or tearing. NVIDIA G-Sync, AMD FreeSync Premium, and VRR, and 4 HDMI 2.1 ports.\n-\nLG’s award-winning webOS Smart TV platform\nBrowse all your favorite streaming apps and let LG Channels connects you to over 300 free channels. Plus with LG’s Re:New Program enjoy new software updates and feature refreshes for up to 5 years.⁵\n-\nPersonalized Picture & Sound\nThe Personalized Picture & Sound Wizard uses AI technology to analyze your favorite images and sound clips to create a personalized picture and audio experiences tailored for you.\n-\nPersonalized search and recommendations\nLG AI makes watching easier by learning your preferences. Press the mic button, and AI Concierge suggests tips and recommendations tailored to your viewing habits and the app or source you're using.\n-\nTV Mirroring: Seamlessly Connect and Share\nWith Apple AirPlay 2 and Google Cast, stream content from your phone, tablet, or computer to your TV for a bigger, more immersive experience, perfect for videos, games, and photos.\n-\nReady assist with your connected devices\nControl your TV and connected devices with built-in support for ThinQ, Google Assistant, Amazon Alexa, Matter and Apple HomeKit.⁶\nProduct information\nTechnical Details\nAdditional Information\n| ASIN | B0DYQMWSKG |\n|---|---|\n| Customer Reviews |\n4.4 out of 5 stars |\n| Best Sellers Rank |\n|\n| Date First Available | March 10, 2025 |\nWarranty & Support\nFeedback\nProduct Description\nExperience gaming at its best with the LG OLED evo C5-Series. Powered by the exclusive α9 AI Processor Gen7, the OLED evo C5 delivers lifelike contrast, perfect black, and rich color with over 8.3 million self-lit pixels.¹ With NVIDIA G-SYNC, AMD FreeSync Premium, VRR, and 4 HDMI 2.1 ports, it’s built for serious gaming. Game Optimizer and Game Dashboard put settings at your fingertips, while HDR Expression Enhancer deepens immersion for both movies and games. AI Picture Pro and AI Sound Pro use deep learning to optimize content²—and with LG’s latest webOS 25,³ you get quick access to your favorite streaming apps⁵ with less searching and more watching. Plus, it’s all wrapped in a sleek design with an ultra-thin bezel that keeps the focus on what’s on screen. Dolby Vision and Dolby Atmos³ combine to create vivid visuals and immersive audio, and FILMMAKER MODE shows movies the way directors intended. Whether you're exploring virtual worlds or watching blockbusters, the LG OLED evo C5 is engineered to elevate the experience.⁴⁶⁷ ¹Source: Omdia. Unit shipments, 2013–2024. Results are not an endorsement of LG Electronics. Any reliance on these results is at the third party’s own risk. ²Image quality of upscaled content will vary based on source resolution. ³Dolby, Dolby Vision, Dolby Atmos, and the double-D symbol are registered trademarks of Dolby Laboratories Licensing Corporation. Manufactured under license from Dolby Laboratories. Confidential unpublished works. Copyright 2012–2025 Dolby Laboratories. All rights reserved. ⁴PC with 144Hz graphic card required. ⁵Internet connection and subscriptions to streaming services are required; number of LG Channels subject to change. Software update will automatically download. Consumers who disable “auto-update” will receive a pop-up notification to accept or deny software update. ⁶Google is a trademark of Google LLC. Google Assistant is not available in certain languages and countries. Apple, the Apple logo and HomeKit are trademarks of Apple Inc., registered in the U.S. and other countries. ⁷Subscription and compatible gaming controller are required.\nRelated products with free delivery on eligible orders\nCustomer reviews\nCustomer Reviews, including Product Star Ratings help customers to learn more about the product and decide whether it is the right product for them.\nTo calculate the overall star rating and percentage breakdown by star, we don’t use a simple average. Instead, our system considers things like how recent a review is and if the reviewer bought the item on Amazon. It also analyzed reviews to verify trustworthiness.\nLearn more how customers reviews work on AmazonCustomers say\nCustomers are impressed with the TV's picture quality, with one noting its natural outdoor scenes, and they find it relatively easy to set up. The sound quality is adequate, and while some customers say it's worth the price, others find it too bright and vivid. The remote control receives mixed feedback, with some finding it user-friendly while others consider the pointer a major annoyance. Customers report mixed experiences with lag, with some noting no lag while others find it slow.\nAI Generated from the text of customer reviews\nCustomers are impressed with the TV's picture quality, particularly its colors, with one customer noting how facial features are beautifully rendered and how outdoor scenes appear very natural.\n\"...I use Fire Stick TV and Sony Blu-Ray through the HDMI ports. Great picture. Great sound. Well worth the investment.\" Read more\n\"...rein. - \"Pinocchio\" (2022, 4K, Guillermo del Toro), a brilliantly filmed, very dark stop-motion animated film that hits every button...\" Read more\n\"...I like it a lot better than my Samsung TV that it replaced. My PS5 looks amazing on it....\" Read more\n\"Looks great to me, blacks BAF, works very well in daylight and sunny room comparatively to 2020 LG LCD and games fast, responsive… feels snappy with...\" Read more\nCustomers are satisfied with the TV's quality, with one customer specifically praising its video performance.\n\"Extremely well-engineered and intuitive HDTV. I was able to master operating techniques easily....\" Read more\n\"...You get what you pay for and this TV isn’t cheap but it’s definitely quality. 5 stars from me...\" Read more\n\"High quality OLED. Brilliant picture....\" Read more\n\"...To recap. Gonna be a great TV. Pretty good sound quality even without a sound bar or hifi set up. Once I get settings dialed in, I will like it....\" Read more\nCustomers find the TV easy to set up.\n\"Extremely well-engineered and intuitive HDTV. I was able to master operating techniques easily....\" Read more\n\"...Set up was pretty user-friendly. Sound is a lot better than most. You get what you pay for and this TV isn’t cheap but it’s definitely quality....\" Read more\n\"...Total hassle.\" Read more\n\"...Very easy to set up, and user friendly remote control.\" Read more\nCustomers find the TV's sound quality adequate.\n\"...Great picture. Great sound. Well worth the investment.\" Read more\n\"...Set up was pretty user-friendly. Sound is a lot better than most. You get what you pay for and this TV isn’t cheap but it’s definitely quality....\" Read more\n\"High quality OLED. Brilliant picture. Although the sound is adequate, to complement the high quality picture, I would strongly suggest adding a...\" Read more\n\"...To recap. Gonna be a great TV. Pretty good sound quality even without a sound bar or hifi set up. Once I get settings dialed in, I will like it....\" Read more\nCustomers have mixed opinions about the TV's remote control, with some finding it user-friendly, while others report issues with setup and functionality.\n\"...Magic remote pointer is a major annoyance in LG models and there is no option to turn the pointer off permanently....\" Read more\n\"Extremely well-engineered and intuitive HDTV. I was able to master operating techniques easily....\" Read more\n\"...The remote’s a little weird at first, but I had a Wii growing up, so it wasn’t a big adjustment to using the pointer....\" Read more\n\"...Very easy to set up, and user friendly remote control.\" Read more\nCustomers have mixed opinions about the TV's value for money, with some finding it worth every penny and offering good quality for the price, while others consider it inexcusable for its price range.\n\"...Great picture. Great sound. Well worth the investment.\" Read more\n\"...Sound is a lot better than most. You get what you pay for and this TV isn’t cheap but it’s definitely quality. 5 stars from me...\" Read more\n\"...Seeing the etching on Smaug's hide (without the sheen) is worth every penny....\" Read more\n\"Junk! I think we got a bad TV. It cost us $105.00 to send it back. Never again! HDMI connection issues even with 3 brand new HDMI cables....\" Read more\nCustomers have mixed opinions about the TV's brightness, with some finding it too bright and vivid, while one customer notes it works well in daylight and sunny rooms.\n\"Looks great to me, blacks BAF, works very well in daylight and sunny room comparatively to 2020 LG LCD and games fast, responsive… feels snappy with...\" Read more\n\"...MAN (60fps): I know what you're thinking: this movie is intolerable for its irremediable sheen/glow. You're right....\" Read more\n\"Fantastic picture! No complaints so far. Works great with my LG Sound Bar\" Read more\n\"...As I write this, I notice the screen's gradual dimmer is working very well to ensure no image burn-in occurs when I stop typing for a while....\" Read more\nCustomers have mixed experiences with the TV's responsiveness, with some reporting no lag while others find it slow.\n\"...It took almost the entire movie for me to register that there was no lag or choppiness in Dune Part 2 at all... none (at least with BFI engaged)....\" Read more\n\"...voice sounds as if the person inhaled helium from a balloon and spoke very fast....\" Read more\n\"...well in daylight and sunny room comparatively to 2020 LG LCD and games fast, responsive… feels snappy with high HZ feedback. Niiice....\" Read more\n\"...Slow, sluggish, and inexcusable for this price range....\" Read more\nReviews with images\nLG's BFI TAMES BILBO's and SMAUG's HORRID GLOWING!\nTop reviews from the United States\nThere was a problem filtering reviews. Please reload the page.\n- Reviewed in the United States on June 4, 2025Size: 55 InchesStyle: TV OnlyVerified PurchaseExtremely well-engineered and intuitive HDTV. I was able to master operating techniques easily. I use Fire Stick TV and Sony Blu-Ray through the HDMI ports. Great picture. Great sound. Well worth the investment.\n- Reviewed in the United States on June 14, 2025Size: 55 InchesStyle: TV OnlyVerified PurchaseComparison: My new LG 4K Smart OLED TV (OLED55C5PUA, 2025) vs my old LG 4K Smart OLED TV (OLED55CXPUA, 2020)\nSources Used: Sony UBP-X700 4K Ultra HD Player (October 2024) and 4K Ultra HD Blu-ray discs.\nConnectors: Zeskit Maya 8K 48Gbps Certified Ultra High-Speed HDMI Cable 16ft CL3 In-Wall Rated\nRemote Control Solution: As others rightly indicate, the new remote that comes with this TV is not up to the tasks required. I ended up using the remote that came with the previous version of this TV - the \"LG Remote Magic Remote Control\" (AKB75855501) - which is available on Amazon.\nLG TV's UNIQUE STANDOUTS SUMMARY\n- \"Nightmare Alley\" (2021, 4K, Guillermo del Toro) joins perfect details and colors to allow the genre's nihilism free rein.\n- \"Pinocchio\" (2022, 4K, Guillermo del Toro), a brilliantly filmed, very dark stop-motion animated film that hits every button (Note: not for young children).\n- \"TRON: Legacy\" (2010, 2K upscaled to 4K, Joseph Kosinski) is everything a gorgeous Sci-Fi drama - with stellar soundtrack - should be thanks to LG and Disney.\n(DETAILED EVALUATIONS BELOW)\nPreface: All my viewing was in HDR mode for 4k. I used the movies listed below, all of which benefitted from excellent motion smoothing, without awful sheen/glow, when rendered using moderate level of this TV's Black Frame Insertion (BFI) in Game Mode and a touch of extra brightness. Bright or dark room did not matter. (See bottom of page for comments on 2K SDR/Regular Blu-ray.)\nTHE HOBBIT - THE DESOLATION OF SMAUG (48fps): If you hated the 48fps of The Hobbit, your troubles are over! Watch this movie with correct BFI and generally accepted parameters for Game Mode on this TV. Then the natural appearance of everything in this movie will bowl you over. Faces are normal. The spiders of Mirkwood show markings that are easier to see and have colors that make sense on those horrid creatures. Seeing the etching on Smaug's hide (without the sheen) is worth every penny.\nSTAR WARS (2020 UHD Release)(24fps): The movie is fun and impressive to watch given how old it is. The color and lighting are very good. Its sheen was tamed very well on this TV, and scenes filmed outdoors were very natural. (When I watched this movie on my previous LG TV - the OLED55CXPUA, 2020 - I was distracted by the less manageable sheen/glow.)\nDUNE, PARTS 1 and 2:\n- (Dune1, 24fps) The abundance of sand colors and sunlight make the DUNE movies bright overall. Beautiful browns in their various shades are a treat. In the midst of all that brown, you should notice subtle dark shades of green on clothing, and quilt-like stitching on the jackets. Facial features are beautifully rendered. The Bene Gesserit ship passing through and out of The Spacing Guild's Heighliner (at 20m:50s) and the Worm Spotter aircraft's flight (at 1h:01m:50s) should not break up in their movements across the screen. In the battle scenes when the Harkonnen invade, you should see no tearing or empty space in the rolling flames.\n- (Dune2, 24fps/48fps) It took almost the entire movie for me to register that there was no lag or choppiness in Dune Part 2 at all... none (at least with BFI engaged). Turns out Dune Part 2 occasionally used 48fps in some places instead of 24fps only, an approach that worked almost magically. It now takes 1st place as the best all-around film in my collection.\nBLADE RUNNER 2049 (24fps): The BFI nailed the surrounding colors and movement of K's police vehicle as it passed behind buildings. The vehicle's movement was smooth and the snow/rain contrails moving over and past the back of the vehicle were easy to pick out. Colors were incredibly detailed and vibrant at every turn.\n1917 (24fps): This movie benefits enormously from BFI and reduces the number of \"jittery\" scenes to two: 1) the stuttering movement as the camera views an embankment and pans left to right just after the two soldiers narrowly escape the collapsing tunnels, and 2) the panning left to right as the two soldiers are in a barn looking through wood slats at a plane in the distance.\nOBLIVION (24fps): I've watched this movie many times and this LG TV brought out colors better than the previous LG. The motions were very smooth and details abounded. Things to look for are Vicca's tears running down her face and off her nose as she betrays Jack, and the flickering lights when Julia and the hapless people are in the sights of the drone programmed to kill them (the flickering lights should not tear or have holes).\nFORD v FERRARI (24fps): The most interesting and exciting (and perpetual) visual experience I had with this movie was the heightened detail seen on clothing I don't recall seeing on the previous TV. But most of all the colors of red and brown in their various shades were able to make me fall further into the movie as everything seemed so very natural.\nTHE PRESTIGE (24fps): This is a very detailed movie where the differing shades of brown are everywhere. Especially look for the brown variants (and other colors) in the weave of the tweed coats, especially prominent near the end of the movie.\nGEMINI MAN (60fps): I know what you're thinking: this movie is intolerable for its irremediable sheen/glow. You're right. It's also too intimate: it's as close to \"being there\" than I could tolerate... feels creepy, like eavesdropping. I played this all the way through again but came away with no changed opinions, except for very slightly better colors all 'round. HOWEVER, the climax near the end of the movie is visceral in how it renders the minigun being used to shred the store where the heroes are sheltering. TECHNICALLY SPEAKING, I must say that one of the most impressive demonstrations of BFI motion smoothing is how, in the opening scene, the filmmaker was able to sweep the camera across the ribbed structure above the train station and not induce seizures. (On the other hand, you might want seizure medicine handy if you try to view that panned ribbed structure with no BFI enabled.) On the whole, its motion smoothing and details are absolutely amazing.\nRegarding 2K SDR (i.e., regular Blu-ray), my results were either very good or very poor. For instance, the original releases of Avatar, Total Recall (2012), and The Imitation Game rendered outstanding results. On the other hand, The Last Samurai and Sherlock Holmes: A Game of Shadows were a disappointment. While the upscaling and motion smoothing were excellent on all these 2K movies, the Last Samurai and Sherlock Holmes renderings were too dark or dull, foggy, and wispy. The previous model of this same TV (OLED55CXPUA, 2020) did not have such challenges and disparities.\nAs I write this, I notice the screen's gradual dimmer is working very well to ensure no image burn-in occurs when I stop typing for a while. (At the moment, I am using the TV's input connected to my computer.) Even though the dimming feature is not good for watching movies, it is a must for anything else. Thankfully, when using the 4k input for movies, and Game Mode is enabled, the TV will not dim on its own.\n5.0 out of 5 starsComparison: My new LG 4K Smart OLED TV (OLED55C5PUA, 2025) vs my old LG 4K Smart OLED TV (OLED55CXPUA, 2020)LG's BFI TAMES BILBO's and SMAUG's HORRID GLOWING!\nReviewed in the United States on June 14, 2025\nSources Used: Sony UBP-X700 4K Ultra HD Player (October 2024) and 4K Ultra HD Blu-ray discs.\nConnectors: Zeskit Maya 8K 48Gbps Certified Ultra High-Speed HDMI Cable 16ft CL3 In-Wall Rated\nRemote Control Solution: As others rightly indicate, the new remote that comes with this TV is not up to the tasks required. I ended up using the remote that came with the previous version of this TV - the \"LG Remote Magic Remote Control\" (AKB75855501) - which is available on Amazon.\nLG TV's UNIQUE STANDOUTS SUMMARY\n- \"Nightmare Alley\" (2021, 4K, Guillermo del Toro) joins perfect details and colors to allow the genre's nihilism free rein.\n- \"Pinocchio\" (2022, 4K, Guillermo del Toro), a brilliantly filmed, very dark stop-motion animated film that hits every button (Note: not for young children).\n- \"TRON: Legacy\" (2010, 2K upscaled to 4K, Joseph Kosinski) is everything a gorgeous Sci-Fi drama - with stellar soundtrack - should be thanks to LG and Disney.\n(DETAILED EVALUATIONS BELOW)\nPreface: All my viewing was in HDR mode for 4k. I used the movies listed below, all of which benefitted from excellent motion smoothing, without awful sheen/glow, when rendered using moderate level of this TV's Black Frame Insertion (BFI) in Game Mode and a touch of extra brightness. Bright or dark room did not matter. (See bottom of page for comments on 2K SDR/Regular Blu-ray.)\nTHE HOBBIT - THE DESOLATION OF SMAUG (48fps): If you hated the 48fps of The Hobbit, your troubles are over! Watch this movie with correct BFI and generally accepted parameters for Game Mode on this TV. Then the natural appearance of everything in this movie will bowl you over. Faces are normal. The spiders of Mirkwood show markings that are easier to see and have colors that make sense on those horrid creatures. Seeing the etching on Smaug's hide (without the sheen) is worth every penny.\nSTAR WARS (2020 UHD Release)(24fps): The movie is fun and impressive to watch given how old it is. The color and lighting are very good. Its sheen was tamed very well on this TV, and scenes filmed outdoors were very natural. (When I watched this movie on my previous LG TV - the OLED55CXPUA, 2020 - I was distracted by the less manageable sheen/glow.)\nDUNE, PARTS 1 and 2:\n- (Dune1, 24fps) The abundance of sand colors and sunlight make the DUNE movies bright overall. Beautiful browns in their various shades are a treat. In the midst of all that brown, you should notice subtle dark shades of green on clothing, and quilt-like stitching on the jackets. Facial features are beautifully rendered. The Bene Gesserit ship passing through and out of The Spacing Guild's Heighliner (at 20m:50s) and the Worm Spotter aircraft's flight (at 1h:01m:50s) should not break up in their movements across the screen. In the battle scenes when the Harkonnen invade, you should see no tearing or empty space in the rolling flames.\n- (Dune2, 24fps/48fps) It took almost the entire movie for me to register that there was no lag or choppiness in Dune Part 2 at all... none (at least with BFI engaged). Turns out Dune Part 2 occasionally used 48fps in some places instead of 24fps only, an approach that worked almost magically. It now takes 1st place as the best all-around film in my collection.\nBLADE RUNNER 2049 (24fps): The BFI nailed the surrounding colors and movement of K's police vehicle as it passed behind buildings. The vehicle's movement was smooth and the snow/rain contrails moving over and past the back of the vehicle were easy to pick out. Colors were incredibly detailed and vibrant at every turn.\n1917 (24fps): This movie benefits enormously from BFI and reduces the number of \"jittery\" scenes to two: 1) the stuttering movement as the camera views an embankment and pans left to right just after the two soldiers narrowly escape the collapsing tunnels, and 2) the panning left to right as the two soldiers are in a barn looking through wood slats at a plane in the distance.\nOBLIVION (24fps): I've watched this movie many times and this LG TV brought out colors better than the previous LG. The motions were very smooth and details abounded. Things to look for are Vicca's tears running down her face and off her nose as she betrays Jack, and the flickering lights when Julia and the hapless people are in the sights of the drone programmed to kill them (the flickering lights should not tear or have holes).\nFORD v FERRARI (24fps): The most interesting and exciting (and perpetual) visual experience I had with this movie was the heightened detail seen on clothing I don't recall seeing on the previous TV. But most of all the colors of red and brown in their various shades were able to make me fall further into the movie as everything seemed so very natural.\nTHE PRESTIGE (24fps): This is a very detailed movie where the differing shades of brown are everywhere. Especially look for the brown variants (and other colors) in the weave of the tweed coats, especially prominent near the end of the movie.\nGEMINI MAN (60fps): I know what you're thinking: this movie is intolerable for its irremediable sheen/glow. You're right. It's also too intimate: it's as close to \"being there\" than I could tolerate... feels creepy, like eavesdropping. I played this all the way through again but came away with no changed opinions, except for very slightly better colors all 'round. HOWEVER, the climax near the end of the movie is visceral in how it renders the minigun being used to shred the store where the heroes are sheltering. TECHNICALLY SPEAKING, I must say that one of the most impressive demonstrations of BFI motion smoothing is how, in the opening scene, the filmmaker was able to sweep the camera across the ribbed structure above the train station and not induce seizures. (On the other hand, you might want seizure medicine handy if you try to view that panned ribbed structure with no BFI enabled.) On the whole, its motion smoothing and details are absolutely amazing.\nRegarding 2K SDR (i.e., regular Blu-ray), my results were either very good or very poor. For instance, the original releases of Avatar, Total Recall (2012), and The Imitation Game rendered outstanding results. On the other hand, The Last Samurai and Sherlock Holmes: A Game of Shadows were a disappointment. While the upscaling and motion smoothing were excellent on all these 2K movies, the Last Samurai and Sherlock Holmes renderings were too dark or dull, foggy, and wispy. The previous model of this same TV (OLED55CXPUA, 2020) did not have such challenges and disparities.\nAs I write this, I notice the screen's gradual dimmer is working very well to ensure no image burn-in occurs when I stop typing for a while. (At the moment, I am using the TV's input connected to my computer.) Even though the dimming feature is not good for watching movies, it is a must for anything else. Thankfully, when using the 4k input for movies, and Game Mode is enabled, the TV will not dim on its own.\nImages in this review\n- Reviewed in the United States on July 10, 2025Size: 42 InchesStyle: TV OnlyVerified PurchaseWhy did you pick this product vs others?:The media could not be loaded.\nI like it a lot better than my Samsung TV that it replaced. My PS5 looks amazing on it. Currently playing armored core 6 and the visuals are outstanding. Set up was pretty user-friendly. Sound is a lot better than most. You get what you pay for and this TV isn’t cheap but it’s definitely quality. 5 stars from me\n- Reviewed in the United States on August 1, 2025Size: 65 InchesStyle: TV OnlyVerified PurchaseLooks great to me, blacks BAF, works very well in daylight and sunny room comparatively to 2020 LG LCD and games fast, responsive… feels snappy with high HZ feedback. Niiice. $1000 off the 2696$ ($1696 total) brand new price tag for 65”. Okay. Thanks! Remote doesn’t seem to have an input fast switch, first time ever maybe, that sucks.\n- Reviewed in the United States on July 13, 2025Size: 48 InchesStyle: TV OnlyVerified PurchaseJunk! I think we got a bad TV. It cost us $105.00 to send it back. Never again! HDMI connection issues even with 3 brand new HDMI cables. It would on see on device at a time. You’d have to keep unplugging and plugging in whatever HDMI you wanted to use at the time. Total hassle.\n- Reviewed in the United States on May 27, 2025Size: 55 InchesStyle: TV OnlyVerified PurchaseI'd give this 4 or 5 stars for the TV but the manuals for it from LG are beyond pathetic. You have to find websites to help you figure out options you may want. If you want to just plug it in and have it be acceptable, this ain't for you. If you want a good manual for the manufacturer, this ain't for you. I found and downloaded the manual on their site (because, of course it does not come with one that is of any use). And the online details almost nothing. The little quick set up manual is the most pathetic of any I've ever seen. Tiny print. Hardly worth looking at.\nAs for good screen display set up, I looked at a lot of recommendations online. Those suggesting a number of setting changes recommend filmmakers mode. One guy recommended Cinema mode with lower brightness on leds to get good image and color. First night with it I watched a hockey game and none of the standard presets looked good (between standard, sports, gamer, vivid). All too bright too vivid, too unreal looking. Ended up turning off power saving because it was always too bright for my room no matter what. It could not adjust itself down enough. Ended up, after reading that one persons recs on Cinema mode with LEDs output turned down to 50%. That got it to a very good place with good color, excellent brightness, and it looked fantastic on another hockey game and movie test on Apple TV.\nNow for the remote. I suggest you get a standard LG tv remote. We have one. It is so vastly better than the model that comes with it. Not even a simple button to get to selecting which HDMI input. The old, basic, non floating around your screen cursor models work far better. And you can turn that function off. But you know what does? A basic LG remote that does not have that function but has FAR more obvious and simple buttons. I got an LG tv for our conference room at work. Non LED and a 1/4th the cost four years ago. On that model, you can turn off the Magic mousing feature, whatever they call it.\nTo recap. Gonna be a great TV. Pretty good sound quality even without a sound bar or hifi set up. Once I get settings dialed in, I will like it. None of the default set up choices presents an acceptable picture to me. Too bright, too vivid, even on standard mode. Going to take a lot of fiddling or get a pro to come to your house. Serious.\nAnyway, summary.\nTV great. Or I expect it to be.\nManuals, utterly pathetic. And since there is no easy mode, that's bad.\nRemote. Unacceptably poor, few functions, very unintuitive.\nAbout me. Life long tech nerd with a lot of experience. This TV and manuals and remotes would suck for a novice.\n- Reviewed in the United States on August 7, 2025Size: 55 InchesStyle: TV OnlyVerified PurchaseGood enough quality for the price and being a new model. If possible, you should go for the 55\" model instead of the 42\" as the price difference is negligible. During setup, the voice sounds as if the person inhaled helium from a balloon and spoke very fast. Magic remote pointer is a major annoyance in LG models and there is no option to turn the pointer off permanently. For this price, people should get a remote with backlight but that is not the case, unfortunately. Minus one star just due to annoying remote and pointer.\nImportant information\nOn-mode power consumption\n82 watts\nVisible screen diagonal\n42\" / 107 cm\nEnergy consumption\n153 Kilowatt Hours Per Year per year, based on the power consumption of the television operating 4 hours per day for 365 days. The actual energy consumption will depend on how the television is used."
    },
    {
      "url": "https://www.amazon.com/dp/B0DYQF1Q3Z?th=1&tag=cnet-buy-button-20",
      "text": "| Brand Name | LG |\n|---|---|\n| Item Weight | 35.3 pounds |\n| Product Dimensions | 9.1 x 48.1 x 29.8 inches |\n| Item model number | OLED55C5PUA.AUSZ |\n| Batteries | 2 AAA batteries required. (included) |\n| Special Features | Amd freesync, Built-In Speaker, Google Cast built-in, Multiple Voice Assistance, Nvidia G Sync |\n| Item Weight | 35.3 Pounds |\n| Standing screen display size | 55 Inches |\n| Aspect Ratio | 16:9 |\n| Voltage | 120 Volts |\nLearn more\nNo featured offers available\nWe feature offers with an Add to Cart button when an offer meets our high standards for:\n- Quality Price,\n- Reliable delivery option, and\n- Seller who offers good customer service\n- 7 VIDEOS\nImage Unavailable\nColor:\n-\n-\n-\n- To view this video download Flash Player\nLG 55-Inch Class OLED evo AI 4K C5 Series Smart TV w/Dolby Atmos, Dolby Vision, HDR10, AI Super Upscaling 4K, Filmmaker Mode, Wow Orchestra, Alexa Built-in (OLED55C5PUA, 2025)\nOur specialist Customer Support for large items dispatched from Amazon is on hand to help with your order. Contact us via phone or chat 7 days a week.\n| Screen Size | 55 Inches |\n| Brand | LG |\n| Display Technology | OLED |\n| Resolution | 4K |\n| Refresh Rate | 120 Hz |\n| Special Feature | Amd freesync, Built-In Speaker, Google Cast built-in, Multiple Voice Assistance, Nvidia G Sync |\n| Included Components | Power Cable, Remote Control, Stand, User Manual |\n| Connectivity Technology | Bluetooth, Ethernet, HDMI, USB, Wi-Fi |\n| Aspect Ratio | 16:9 |\n| Product Dimensions | 9.1\"D x 48.1\"W x 29.8\"H |\nAbout this item\n- World's No.1 OLED: Celebrating 12 years of perfecting award-winning OLED TV technology.\n- Brightness Booster: Our Brightness Booster technology magnifies each individual pixel for luminous quality that shines with every detail.\n- Bright Room Ready: Verified by UL for Discomfort Glare Free (UGR less than 22), you can be confident your LG OLED TV performs great no matter the room or the lighting. With LG OLED you still experience perfect black that delivers stunning pictures other brands just can't match.\n- Alpha 9 AI Processor Gen8: This processor is the brains behind a truly unforgettable TV experience. You'll get personalized smooth, vivid pictures no matter what you watch. AI Super Upscaling technology automatically enhances picture quality whether you're watching sports, movies, or a late-night favorite. Everything looks and sounds incredible on a LG OLED TV.\n- Perfect Black & Perfect Color (8.3 million self-lit pixels: LG's flagship OLED technology creates an incredible watching experience and stellar picture quality with Perfect Black and Perfect Color technology on over 8.3 million self-lit smart pixels, even in bright rooms.\n- Dolby Vision, Dolby Atmos & FILMMAKER MODE: Experience the magic of the big screen right from your couch. Loaded with Dolby Vision for extraordinary color, contrast and brightness, plus Dolby Atmos* for sound you can feel all around you. Land in the center of the action with FILMMAKER MODE, allowing you to see films just as the director intended.\n- Ultimate Gaming: Packed with gaming features, this LG OLED evo Series comes with everything you need to win. Experience crisp, smooth imagery from a 0.1ms response time and up to 144Hz refresh rate** to let you game at blinding speed without any blurring or tearing to keep up with the fastest games. All LG OLED TVs have NVIDIA G-Sync, AMD FreeSync Premium and VRR to further improve gaming quality. Four HDMI 2.1 inputs allow you to plug in all the devices you need. Whether you game on consoles or on the cloud,* the LG Game Dashboard and Game Optimizer put all the control at your fingertips.\nProduct voltage: 120\nThis product is compatible with outlets that support 120 volts and might require a converter when used outside of the United States.\nSimilar items in new arrivals\nImportant information\nOn-mode power consumption\n133.1 watts\nEnergy consumption\n246 Kilowatt Hours Per Year per year, based on the power consumption of the television operating 4 hours per day for 365 days. The actual energy consumption will depend on how the television is used.\nVisible screen diagonal\n55\" / 140 cm\nTop Brand: LG\nWhat's in the box\nFrom the manufacturer\n-\nWorld's No.1 OLED TV Brand\nCelebrating 12 years of perfecting award-winning OLED TV technology.¹\n-\nBright and beautiful\nOur Brightness Boosting technology magnifies each individual pixel for luminous quality that shines with every detail.\n-\nAlpha 9 AI Processor Gen8\nThis processor powers a truly unforgettable TV experience, delivering personalized, vivid picture with AI Super Upscaling² to enhance quality for sports, movies, or late-night favorites.\n-\nPerfect Black & Perfect Color\nOLED technology creates an incredible watching experience and stellar picture quality with perfect black and perfect color on over 8.3 million self-lit smart pixels, even in bright rooms.\n-\nBring home the magic of home cinema\nExperience the magic of the big screen at home with Dolby Vision for stunning color, contrast, and brightness, Dolby Atmos³ for immersive sound, and FILMMAKER MODE for films as the director intended.\nBright Room Ready\nVerified by UL for Discomfort Glare Free (UGR less than 22), you can be confident your LG OLED TV performs great no matter the room or the lighting. With LG OLED you still experience perfect black that delivers stunning picture other brands just can't match.\n-\nGame with the power of LG OLED\nBuilt for gaming with a 0.1ms response time, up to 144Hz refresh rate⁴, and no blurring or tearing. NVIDIA G-Sync, AMD FreeSync Premium, and VRR, and 4 HDMI 2.1 ports.\n-\nLG’s award-winning webOS Smart TV platform\nBrowse all your favorite streaming apps and let LG Channels connects you to over 300 free channels. Plus with LG’s Re:New Program enjoy new software updates and feature refreshes for up to 5 years.⁵\n-\nPersonalized Picture & Sound\nThe Personalized Picture & Sound Wizard uses AI technology to analyze your favorite images and sound clips to create a personalized picture and audio experiences tailored for you.\n-\nPersonalized search and recommendations\nLG AI makes watching easier by learning your preferences. Press the mic button, and AI Concierge suggests tips and recommendations tailored to your viewing habits and the app or source you're using.\n-\nTV Mirroring: Seamlessly Connect and Share\nWith Apple AirPlay 2 and Google Cast, stream content from your phone, tablet, or computer to your TV for a bigger, more immersive experience, perfect for videos, games, and photos.\n-\nReady assist with your connected devices\nControl your TV and connected devices with built-in support for ThinQ, Google Assistant, Amazon Alexa, Matter and Apple HomeKit.⁶\nProduct information\nTechnical Details\nAdditional Information\n| ASIN | B0DYQF1Q3Z |\n|---|---|\n| Customer Reviews |\n4.4 out of 5 stars |\n| Best Sellers Rank |\n|\n| Date First Available | March 10, 2025 |\nWarranty & Support\nFeedback\nProduct Description\nLG's Most Popular Selling OLED TV\nThe advanced LG OLED evo C5-Series is better than ever. The LG OLED evo C5 is powered by the next-gen Alpha 9 Gen8 AI Processor —exclusively made for LG OLED—for ultra-realistic picture and sound along with boosted brightness for luminosity and high contrast, even in well-lit rooms. AI-assisted deep learning analyzes what you're watching and uses your preferences to choose the best picture and sound setting for your content. The C5's almost invisible bezel, ensures it blends with your surroundings. When you're finished watching, display art, photos and other content make the C5 a versatile statement piece. Search less and stream more, thanks to the next generation of AI technology from LG webOS 25. Every LG OLED comes loaded with Dolby Vision for extraordinary color, contrast and brightness, plus Dolby Atmos for immersive sound you can feel all around you. FILMMAKER MODE allows you to see films just as the director intended. Packed with gaming features, the LG OLED evo C-Series comes with everything you need to win like a 0.1ms response time, native 120Hz refresh rate, with VRR up to 144hz for PC gaming and four HDMI 2.1 inputs.\n¹Source: Omdia. Unit shipments, 2013-2024. Results are not an endorsement of LG Electronics. Any reliance on these results is at the third-party’s own risk. ²Image quality of upscaled content will vary based on source resolution. ³Dolby, Dolby Vision, Dolby Atmos, and the double-D symbol are registered trademarks of Dolby Laboratories Licensing Corporation. Manufactured under license from Dolby Laboratories. Confidential unpublished works. Copyright 2012–2025 Dolby Laboratories. All rights reserved. ⁴PC with 144Hz graphic card required. ⁵Internet connection and subscriptions to streaming services are required; number of LG Channels subject to change. Software update will automatically download. Consumers who disable “auto-update” will receive a pop-up notification to accept or deny software update. ⁶Google is a trademark of Google LLC. Google Assistant is not available in certain languages and countries. Apple, the Apple logo and HomeKit are trademarks of Apple Inc., registered in the U.S. and other countries. ⁷Subscription and compatible gaming controller are required.\nProduct Videos\nCustomer reviews\nCustomer Reviews, including Product Star Ratings help customers to learn more about the product and decide whether it is the right product for them.\nTo calculate the overall star rating and percentage breakdown by star, we don’t use a simple average. Instead, our system considers things like how recent a review is and if the reviewer bought the item on Amazon. It also analyzed reviews to verify trustworthiness.\nLearn more how customers reviews work on AmazonCustomers say\nCustomers are impressed with the TV's picture quality, with one noting its natural outdoor scenes, and they find it relatively easy to set up. The sound quality is adequate, and while some customers say it's worth the price, others find it too bright and vivid. The remote control receives mixed feedback, with some finding it user-friendly while others consider the pointer a major annoyance. Customers report mixed experiences with lag, with some noting no lag while others find it slow.\nAI Generated from the text of customer reviews\nCustomers are impressed with the TV's picture quality, particularly its colors, with one customer noting how facial features are beautifully rendered and how outdoor scenes appear very natural.\n\"...I use Fire Stick TV and Sony Blu-Ray through the HDMI ports. Great picture. Great sound. Well worth the investment.\" Read more\n\"...rein. - \"Pinocchio\" (2022, 4K, Guillermo del Toro), a brilliantly filmed, very dark stop-motion animated film that hits every button...\" Read more\n\"...I like it a lot better than my Samsung TV that it replaced. My PS5 looks amazing on it....\" Read more\n\"Looks great to me, blacks BAF, works very well in daylight and sunny room comparatively to 2020 LG LCD and games fast, responsive… feels snappy with...\" Read more\nCustomers are satisfied with the TV's quality, with one customer specifically praising its video performance.\n\"Extremely well-engineered and intuitive HDTV. I was able to master operating techniques easily....\" Read more\n\"...You get what you pay for and this TV isn’t cheap but it’s definitely quality. 5 stars from me...\" Read more\n\"High quality OLED. Brilliant picture....\" Read more\n\"...To recap. Gonna be a great TV. Pretty good sound quality even without a sound bar or hifi set up. Once I get settings dialed in, I will like it....\" Read more\nCustomers find the TV easy to set up.\n\"Extremely well-engineered and intuitive HDTV. I was able to master operating techniques easily....\" Read more\n\"...Set up was pretty user-friendly. Sound is a lot better than most. You get what you pay for and this TV isn’t cheap but it’s definitely quality....\" Read more\n\"...Total hassle.\" Read more\n\"...Very easy to set up, and user friendly remote control.\" Read more\nCustomers find the TV's sound quality adequate.\n\"...Great picture. Great sound. Well worth the investment.\" Read more\n\"...Set up was pretty user-friendly. Sound is a lot better than most. You get what you pay for and this TV isn’t cheap but it’s definitely quality....\" Read more\n\"High quality OLED. Brilliant picture. Although the sound is adequate, to complement the high quality picture, I would strongly suggest adding a...\" Read more\n\"...To recap. Gonna be a great TV. Pretty good sound quality even without a sound bar or hifi set up. Once I get settings dialed in, I will like it....\" Read more\nCustomers have mixed opinions about the TV's remote control, with some finding it user-friendly, while others report issues with setup and functionality.\n\"...Magic remote pointer is a major annoyance in LG models and there is no option to turn the pointer off permanently....\" Read more\n\"Extremely well-engineered and intuitive HDTV. I was able to master operating techniques easily....\" Read more\n\"...The remote’s a little weird at first, but I had a Wii growing up, so it wasn’t a big adjustment to using the pointer....\" Read more\n\"...Very easy to set up, and user friendly remote control.\" Read more\nCustomers have mixed opinions about the TV's value for money, with some finding it worth every penny and offering good quality for the price, while others consider it inexcusable for its price range.\n\"...Great picture. Great sound. Well worth the investment.\" Read more\n\"...Sound is a lot better than most. You get what you pay for and this TV isn’t cheap but it’s definitely quality. 5 stars from me...\" Read more\n\"...Seeing the etching on Smaug's hide (without the sheen) is worth every penny....\" Read more\n\"Junk! I think we got a bad TV. It cost us $105.00 to send it back. Never again! HDMI connection issues even with 3 brand new HDMI cables....\" Read more\nCustomers have mixed opinions about the TV's brightness, with some finding it too bright and vivid, while one customer notes it works well in daylight and sunny rooms.\n\"Looks great to me, blacks BAF, works very well in daylight and sunny room comparatively to 2020 LG LCD and games fast, responsive… feels snappy with...\" Read more\n\"...MAN (60fps): I know what you're thinking: this movie is intolerable for its irremediable sheen/glow. You're right....\" Read more\n\"Fantastic picture! No complaints so far. Works great with my LG Sound Bar\" Read more\n\"...As I write this, I notice the screen's gradual dimmer is working very well to ensure no image burn-in occurs when I stop typing for a while....\" Read more\nCustomers have mixed experiences with the TV's responsiveness, with some reporting no lag while others find it slow.\n\"...It took almost the entire movie for me to register that there was no lag or choppiness in Dune Part 2 at all... none (at least with BFI engaged)....\" Read more\n\"...voice sounds as if the person inhaled helium from a balloon and spoke very fast....\" Read more\n\"...well in daylight and sunny room comparatively to 2020 LG LCD and games fast, responsive… feels snappy with high HZ feedback. Niiice....\" Read more\n\"...Slow, sluggish, and inexcusable for this price range....\" Read more\nReviews with images\nLG's BFI TAMES BILBO's and SMAUG's HORRID GLOWING!\nTop reviews from the United States\nThere was a problem filtering reviews. Please reload the page.\n- Reviewed in the United States on June 4, 2025Size: 55 InchesStyle: TV OnlyVerified PurchaseExtremely well-engineered and intuitive HDTV. I was able to master operating techniques easily. I use Fire Stick TV and Sony Blu-Ray through the HDMI ports. Great picture. Great sound. Well worth the investment.\n- Reviewed in the United States on June 14, 2025Size: 55 InchesStyle: TV OnlyVerified PurchaseComparison: My new LG 4K Smart OLED TV (OLED55C5PUA, 2025) vs my old LG 4K Smart OLED TV (OLED55CXPUA, 2020)\nSources Used: Sony UBP-X700 4K Ultra HD Player (October 2024) and 4K Ultra HD Blu-ray discs.\nConnectors: Zeskit Maya 8K 48Gbps Certified Ultra High-Speed HDMI Cable 16ft CL3 In-Wall Rated\nRemote Control Solution: As others rightly indicate, the new remote that comes with this TV is not up to the tasks required. I ended up using the remote that came with the previous version of this TV - the \"LG Remote Magic Remote Control\" (AKB75855501) - which is available on Amazon.\nLG TV's UNIQUE STANDOUTS SUMMARY\n- \"Nightmare Alley\" (2021, 4K, Guillermo del Toro) joins perfect details and colors to allow the genre's nihilism free rein.\n- \"Pinocchio\" (2022, 4K, Guillermo del Toro), a brilliantly filmed, very dark stop-motion animated film that hits every button (Note: not for young children).\n- \"TRON: Legacy\" (2010, 2K upscaled to 4K, Joseph Kosinski) is everything a gorgeous Sci-Fi drama - with stellar soundtrack - should be thanks to LG and Disney.\n(DETAILED EVALUATIONS BELOW)\nPreface: All my viewing was in HDR mode for 4k. I used the movies listed below, all of which benefitted from excellent motion smoothing, without awful sheen/glow, when rendered using moderate level of this TV's Black Frame Insertion (BFI) in Game Mode and a touch of extra brightness. Bright or dark room did not matter. (See bottom of page for comments on 2K SDR/Regular Blu-ray.)\nTHE HOBBIT - THE DESOLATION OF SMAUG (48fps): If you hated the 48fps of The Hobbit, your troubles are over! Watch this movie with correct BFI and generally accepted parameters for Game Mode on this TV. Then the natural appearance of everything in this movie will bowl you over. Faces are normal. The spiders of Mirkwood show markings that are easier to see and have colors that make sense on those horrid creatures. Seeing the etching on Smaug's hide (without the sheen) is worth every penny.\nSTAR WARS (2020 UHD Release)(24fps): The movie is fun and impressive to watch given how old it is. The color and lighting are very good. Its sheen was tamed very well on this TV, and scenes filmed outdoors were very natural. (When I watched this movie on my previous LG TV - the OLED55CXPUA, 2020 - I was distracted by the less manageable sheen/glow.)\nDUNE, PARTS 1 and 2:\n- (Dune1, 24fps) The abundance of sand colors and sunlight make the DUNE movies bright overall. Beautiful browns in their various shades are a treat. In the midst of all that brown, you should notice subtle dark shades of green on clothing, and quilt-like stitching on the jackets. Facial features are beautifully rendered. The Bene Gesserit ship passing through and out of The Spacing Guild's Heighliner (at 20m:50s) and the Worm Spotter aircraft's flight (at 1h:01m:50s) should not break up in their movements across the screen. In the battle scenes when the Harkonnen invade, you should see no tearing or empty space in the rolling flames.\n- (Dune2, 24fps/48fps) It took almost the entire movie for me to register that there was no lag or choppiness in Dune Part 2 at all... none (at least with BFI engaged). Turns out Dune Part 2 occasionally used 48fps in some places instead of 24fps only, an approach that worked almost magically. It now takes 1st place as the best all-around film in my collection.\nBLADE RUNNER 2049 (24fps): The BFI nailed the surrounding colors and movement of K's police vehicle as it passed behind buildings. The vehicle's movement was smooth and the snow/rain contrails moving over and past the back of the vehicle were easy to pick out. Colors were incredibly detailed and vibrant at every turn.\n1917 (24fps): This movie benefits enormously from BFI and reduces the number of \"jittery\" scenes to two: 1) the stuttering movement as the camera views an embankment and pans left to right just after the two soldiers narrowly escape the collapsing tunnels, and 2) the panning left to right as the two soldiers are in a barn looking through wood slats at a plane in the distance.\nOBLIVION (24fps): I've watched this movie many times and this LG TV brought out colors better than the previous LG. The motions were very smooth and details abounded. Things to look for are Vicca's tears running down her face and off her nose as she betrays Jack, and the flickering lights when Julia and the hapless people are in the sights of the drone programmed to kill them (the flickering lights should not tear or have holes).\nFORD v FERRARI (24fps): The most interesting and exciting (and perpetual) visual experience I had with this movie was the heightened detail seen on clothing I don't recall seeing on the previous TV. But most of all the colors of red and brown in their various shades were able to make me fall further into the movie as everything seemed so very natural.\nTHE PRESTIGE (24fps): This is a very detailed movie where the differing shades of brown are everywhere. Especially look for the brown variants (and other colors) in the weave of the tweed coats, especially prominent near the end of the movie.\nGEMINI MAN (60fps): I know what you're thinking: this movie is intolerable for its irremediable sheen/glow. You're right. It's also too intimate: it's as close to \"being there\" than I could tolerate... feels creepy, like eavesdropping. I played this all the way through again but came away with no changed opinions, except for very slightly better colors all 'round. HOWEVER, the climax near the end of the movie is visceral in how it renders the minigun being used to shred the store where the heroes are sheltering. TECHNICALLY SPEAKING, I must say that one of the most impressive demonstrations of BFI motion smoothing is how, in the opening scene, the filmmaker was able to sweep the camera across the ribbed structure above the train station and not induce seizures. (On the other hand, you might want seizure medicine handy if you try to view that panned ribbed structure with no BFI enabled.) On the whole, its motion smoothing and details are absolutely amazing.\nRegarding 2K SDR (i.e., regular Blu-ray), my results were either very good or very poor. For instance, the original releases of Avatar, Total Recall (2012), and The Imitation Game rendered outstanding results. On the other hand, The Last Samurai and Sherlock Holmes: A Game of Shadows were a disappointment. While the upscaling and motion smoothing were excellent on all these 2K movies, the Last Samurai and Sherlock Holmes renderings were too dark or dull, foggy, and wispy. The previous model of this same TV (OLED55CXPUA, 2020) did not have such challenges and disparities.\nAs I write this, I notice the screen's gradual dimmer is working very well to ensure no image burn-in occurs when I stop typing for a while. (At the moment, I am using the TV's input connected to my computer.) Even though the dimming feature is not good for watching movies, it is a must for anything else. Thankfully, when using the 4k input for movies, and Game Mode is enabled, the TV will not dim on its own.\n5.0 out of 5 starsComparison: My new LG 4K Smart OLED TV (OLED55C5PUA, 2025) vs my old LG 4K Smart OLED TV (OLED55CXPUA, 2020)LG's BFI TAMES BILBO's and SMAUG's HORRID GLOWING!\nReviewed in the United States on June 14, 2025\nSources Used: Sony UBP-X700 4K Ultra HD Player (October 2024) and 4K Ultra HD Blu-ray discs.\nConnectors: Zeskit Maya 8K 48Gbps Certified Ultra High-Speed HDMI Cable 16ft CL3 In-Wall Rated\nRemote Control Solution: As others rightly indicate, the new remote that comes with this TV is not up to the tasks required. I ended up using the remote that came with the previous version of this TV - the \"LG Remote Magic Remote Control\" (AKB75855501) - which is available on Amazon.\nLG TV's UNIQUE STANDOUTS SUMMARY\n- \"Nightmare Alley\" (2021, 4K, Guillermo del Toro) joins perfect details and colors to allow the genre's nihilism free rein.\n- \"Pinocchio\" (2022, 4K, Guillermo del Toro), a brilliantly filmed, very dark stop-motion animated film that hits every button (Note: not for young children).\n- \"TRON: Legacy\" (2010, 2K upscaled to 4K, Joseph Kosinski) is everything a gorgeous Sci-Fi drama - with stellar soundtrack - should be thanks to LG and Disney.\n(DETAILED EVALUATIONS BELOW)\nPreface: All my viewing was in HDR mode for 4k. I used the movies listed below, all of which benefitted from excellent motion smoothing, without awful sheen/glow, when rendered using moderate level of this TV's Black Frame Insertion (BFI) in Game Mode and a touch of extra brightness. Bright or dark room did not matter. (See bottom of page for comments on 2K SDR/Regular Blu-ray.)\nTHE HOBBIT - THE DESOLATION OF SMAUG (48fps): If you hated the 48fps of The Hobbit, your troubles are over! Watch this movie with correct BFI and generally accepted parameters for Game Mode on this TV. Then the natural appearance of everything in this movie will bowl you over. Faces are normal. The spiders of Mirkwood show markings that are easier to see and have colors that make sense on those horrid creatures. Seeing the etching on Smaug's hide (without the sheen) is worth every penny.\nSTAR WARS (2020 UHD Release)(24fps): The movie is fun and impressive to watch given how old it is. The color and lighting are very good. Its sheen was tamed very well on this TV, and scenes filmed outdoors were very natural. (When I watched this movie on my previous LG TV - the OLED55CXPUA, 2020 - I was distracted by the less manageable sheen/glow.)\nDUNE, PARTS 1 and 2:\n- (Dune1, 24fps) The abundance of sand colors and sunlight make the DUNE movies bright overall. Beautiful browns in their various shades are a treat. In the midst of all that brown, you should notice subtle dark shades of green on clothing, and quilt-like stitching on the jackets. Facial features are beautifully rendered. The Bene Gesserit ship passing through and out of The Spacing Guild's Heighliner (at 20m:50s) and the Worm Spotter aircraft's flight (at 1h:01m:50s) should not break up in their movements across the screen. In the battle scenes when the Harkonnen invade, you should see no tearing or empty space in the rolling flames.\n- (Dune2, 24fps/48fps) It took almost the entire movie for me to register that there was no lag or choppiness in Dune Part 2 at all... none (at least with BFI engaged). Turns out Dune Part 2 occasionally used 48fps in some places instead of 24fps only, an approach that worked almost magically. It now takes 1st place as the best all-around film in my collection.\nBLADE RUNNER 2049 (24fps): The BFI nailed the surrounding colors and movement of K's police vehicle as it passed behind buildings. The vehicle's movement was smooth and the snow/rain contrails moving over and past the back of the vehicle were easy to pick out. Colors were incredibly detailed and vibrant at every turn.\n1917 (24fps): This movie benefits enormously from BFI and reduces the number of \"jittery\" scenes to two: 1) the stuttering movement as the camera views an embankment and pans left to right just after the two soldiers narrowly escape the collapsing tunnels, and 2) the panning left to right as the two soldiers are in a barn looking through wood slats at a plane in the distance.\nOBLIVION (24fps): I've watched this movie many times and this LG TV brought out colors better than the previous LG. The motions were very smooth and details abounded. Things to look for are Vicca's tears running down her face and off her nose as she betrays Jack, and the flickering lights when Julia and the hapless people are in the sights of the drone programmed to kill them (the flickering lights should not tear or have holes).\nFORD v FERRARI (24fps): The most interesting and exciting (and perpetual) visual experience I had with this movie was the heightened detail seen on clothing I don't recall seeing on the previous TV. But most of all the colors of red and brown in their various shades were able to make me fall further into the movie as everything seemed so very natural.\nTHE PRESTIGE (24fps): This is a very detailed movie where the differing shades of brown are everywhere. Especially look for the brown variants (and other colors) in the weave of the tweed coats, especially prominent near the end of the movie.\nGEMINI MAN (60fps): I know what you're thinking: this movie is intolerable for its irremediable sheen/glow. You're right. It's also too intimate: it's as close to \"being there\" than I could tolerate... feels creepy, like eavesdropping. I played this all the way through again but came away with no changed opinions, except for very slightly better colors all 'round. HOWEVER, the climax near the end of the movie is visceral in how it renders the minigun being used to shred the store where the heroes are sheltering. TECHNICALLY SPEAKING, I must say that one of the most impressive demonstrations of BFI motion smoothing is how, in the opening scene, the filmmaker was able to sweep the camera across the ribbed structure above the train station and not induce seizures. (On the other hand, you might want seizure medicine handy if you try to view that panned ribbed structure with no BFI enabled.) On the whole, its motion smoothing and details are absolutely amazing.\nRegarding 2K SDR (i.e., regular Blu-ray), my results were either very good or very poor. For instance, the original releases of Avatar, Total Recall (2012), and The Imitation Game rendered outstanding results. On the other hand, The Last Samurai and Sherlock Holmes: A Game of Shadows were a disappointment. While the upscaling and motion smoothing were excellent on all these 2K movies, the Last Samurai and Sherlock Holmes renderings were too dark or dull, foggy, and wispy. The previous model of this same TV (OLED55CXPUA, 2020) did not have such challenges and disparities.\nAs I write this, I notice the screen's gradual dimmer is working very well to ensure no image burn-in occurs when I stop typing for a while. (At the moment, I am using the TV's input connected to my computer.) Even though the dimming feature is not good for watching movies, it is a must for anything else. Thankfully, when using the 4k input for movies, and Game Mode is enabled, the TV will not dim on its own.\nImages in this review\n- Reviewed in the United States on July 10, 2025Size: 42 InchesStyle: TV OnlyVerified PurchaseWhy did you pick this product vs others?:The media could not be loaded.\nI like it a lot better than my Samsung TV that it replaced. My PS5 looks amazing on it. Currently playing armored core 6 and the visuals are outstanding. Set up was pretty user-friendly. Sound is a lot better than most. You get what you pay for and this TV isn’t cheap but it’s definitely quality. 5 stars from me\n- Reviewed in the United States on August 1, 2025Size: 65 InchesStyle: TV OnlyVerified PurchaseLooks great to me, blacks BAF, works very well in daylight and sunny room comparatively to 2020 LG LCD and games fast, responsive… feels snappy with high HZ feedback. Niiice. $1000 off the 2696$ ($1696 total) brand new price tag for 65”. Okay. Thanks! Remote doesn’t seem to have an input fast switch, first time ever maybe, that sucks.\n- Reviewed in the United States on July 13, 2025Size: 48 InchesStyle: TV OnlyVerified PurchaseJunk! I think we got a bad TV. It cost us $105.00 to send it back. Never again! HDMI connection issues even with 3 brand new HDMI cables. It would on see on device at a time. You’d have to keep unplugging and plugging in whatever HDMI you wanted to use at the time. Total hassle.\n- Reviewed in the United States on May 27, 2025Size: 55 InchesStyle: TV OnlyVerified PurchaseI'd give this 4 or 5 stars for the TV but the manuals for it from LG are beyond pathetic. You have to find websites to help you figure out options you may want. If you want to just plug it in and have it be acceptable, this ain't for you. If you want a good manual for the manufacturer, this ain't for you. I found and downloaded the manual on their site (because, of course it does not come with one that is of any use). And the online details almost nothing. The little quick set up manual is the most pathetic of any I've ever seen. Tiny print. Hardly worth looking at.\nAs for good screen display set up, I looked at a lot of recommendations online. Those suggesting a number of setting changes recommend filmmakers mode. One guy recommended Cinema mode with lower brightness on leds to get good image and color. First night with it I watched a hockey game and none of the standard presets looked good (between standard, sports, gamer, vivid). All too bright too vivid, too unreal looking. Ended up turning off power saving because it was always too bright for my room no matter what. It could not adjust itself down enough. Ended up, after reading that one persons recs on Cinema mode with LEDs output turned down to 50%. That got it to a very good place with good color, excellent brightness, and it looked fantastic on another hockey game and movie test on Apple TV.\nNow for the remote. I suggest you get a standard LG tv remote. We have one. It is so vastly better than the model that comes with it. Not even a simple button to get to selecting which HDMI input. The old, basic, non floating around your screen cursor models work far better. And you can turn that function off. But you know what does? A basic LG remote that does not have that function but has FAR more obvious and simple buttons. I got an LG tv for our conference room at work. Non LED and a 1/4th the cost four years ago. On that model, you can turn off the Magic mousing feature, whatever they call it.\nTo recap. Gonna be a great TV. Pretty good sound quality even without a sound bar or hifi set up. Once I get settings dialed in, I will like it. None of the default set up choices presents an acceptable picture to me. Too bright, too vivid, even on standard mode. Going to take a lot of fiddling or get a pro to come to your house. Serious.\nAnyway, summary.\nTV great. Or I expect it to be.\nManuals, utterly pathetic. And since there is no easy mode, that's bad.\nRemote. Unacceptably poor, few functions, very unintuitive.\nAbout me. Life long tech nerd with a lot of experience. This TV and manuals and remotes would suck for a novice.\n- Reviewed in the United States on August 7, 2025Size: 55 InchesStyle: TV OnlyVerified PurchaseGood enough quality for the price and being a new model. If possible, you should go for the 55\" model instead of the 42\" as the price difference is negligible. During setup, the voice sounds as if the person inhaled helium from a balloon and spoke very fast. Magic remote pointer is a major annoyance in LG models and there is no option to turn the pointer off permanently. For this price, people should get a remote with backlight but that is not the case, unfortunately. Minus one star just due to annoying remote and pointer."
    },
    {
      "url": "https://www.amazon.com/dp/B0DYQF1Q3Z/ref=twister_B0FGDF5QTT?_encoding=UTF8&th=1&tag=cnet-buy-button-20",
      "text": "| Brand Name | LG |\n|---|---|\n| Item Weight | 35.3 pounds |\n| Product Dimensions | 9.1 x 48.1 x 29.8 inches |\n| Item model number | OLED55C5PUA.AUSZ |\n| Batteries | 2 AAA batteries required. (included) |\n| Special Features | Amd freesync, Built-In Speaker, Google Cast built-in, Multiple Voice Assistance, Nvidia G Sync |\n| Item Weight | 35.3 Pounds |\n| Standing screen display size | 55 Inches |\n| Aspect Ratio | 16:9 |\n| Voltage | 120 Volts |\nLearn more\nNo featured offers available\nWe feature offers with an Add to Cart button when an offer meets our high standards for:\n- Quality Price,\n- Reliable delivery option, and\n- Seller who offers good customer service\n- 7 VIDEOS\nImage Unavailable\nColor:\n-\n-\n-\n- To view this video download Flash Player\nLG 55-Inch Class OLED evo AI 4K C5 Series Smart TV w/Dolby Atmos, Dolby Vision, HDR10, AI Super Upscaling 4K, Filmmaker Mode, Wow Orchestra, Alexa Built-in (OLED55C5PUA, 2025)\nOur specialist Customer Support for large items dispatched from Amazon is on hand to help with your order. Contact us via phone or chat 7 days a week.\n| Screen Size | 55 Inches |\n| Brand | LG |\n| Display Technology | OLED |\n| Resolution | 4K |\n| Refresh Rate | 120 Hz |\n| Special Feature | Amd freesync, Built-In Speaker, Google Cast built-in, Multiple Voice Assistance, Nvidia G Sync |\n| Included Components | Power Cable, Remote Control, Stand, User Manual |\n| Connectivity Technology | Bluetooth, Ethernet, HDMI, USB, Wi-Fi |\n| Aspect Ratio | 16:9 |\n| Product Dimensions | 9.1\"D x 48.1\"W x 29.8\"H |\nAbout this item\n- World's No.1 OLED: Celebrating 12 years of perfecting award-winning OLED TV technology.\n- Brightness Booster: Our Brightness Booster technology magnifies each individual pixel for luminous quality that shines with every detail.\n- Bright Room Ready: Verified by UL for Discomfort Glare Free (UGR less than 22), you can be confident your LG OLED TV performs great no matter the room or the lighting. With LG OLED you still experience perfect black that delivers stunning pictures other brands just can't match.\n- Alpha 9 AI Processor Gen8: This processor is the brains behind a truly unforgettable TV experience. You'll get personalized smooth, vivid pictures no matter what you watch. AI Super Upscaling technology automatically enhances picture quality whether you're watching sports, movies, or a late-night favorite. Everything looks and sounds incredible on a LG OLED TV.\n- Perfect Black & Perfect Color (8.3 million self-lit pixels: LG's flagship OLED technology creates an incredible watching experience and stellar picture quality with Perfect Black and Perfect Color technology on over 8.3 million self-lit smart pixels, even in bright rooms.\n- Dolby Vision, Dolby Atmos & FILMMAKER MODE: Experience the magic of the big screen right from your couch. Loaded with Dolby Vision for extraordinary color, contrast and brightness, plus Dolby Atmos* for sound you can feel all around you. Land in the center of the action with FILMMAKER MODE, allowing you to see films just as the director intended.\n- Ultimate Gaming: Packed with gaming features, this LG OLED evo Series comes with everything you need to win. Experience crisp, smooth imagery from a 0.1ms response time and up to 144Hz refresh rate** to let you game at blinding speed without any blurring or tearing to keep up with the fastest games. All LG OLED TVs have NVIDIA G-Sync, AMD FreeSync Premium and VRR to further improve gaming quality. Four HDMI 2.1 inputs allow you to plug in all the devices you need. Whether you game on consoles or on the cloud,* the LG Game Dashboard and Game Optimizer put all the control at your fingertips.\nProduct voltage: 120\nThis product is compatible with outlets that support 120 volts and might require a converter when used outside of the United States.\nSimilar items in new arrivals\nTop Brand: LG\nWhat's in the box\nFrom the manufacturer\n-\nWorld's No.1 OLED TV Brand\nCelebrating 12 years of perfecting award-winning OLED TV technology.¹\n-\nBright and beautiful\nOur Brightness Boosting technology magnifies each individual pixel for luminous quality that shines with every detail.\n-\nAlpha 9 AI Processor Gen8\nThis processor powers a truly unforgettable TV experience, delivering personalized, vivid picture with AI Super Upscaling² to enhance quality for sports, movies, or late-night favorites.\n-\nPerfect Black & Perfect Color\nOLED technology creates an incredible watching experience and stellar picture quality with perfect black and perfect color on over 8.3 million self-lit smart pixels, even in bright rooms.\n-\nBring home the magic of home cinema\nExperience the magic of the big screen at home with Dolby Vision for stunning color, contrast, and brightness, Dolby Atmos³ for immersive sound, and FILMMAKER MODE for films as the director intended.\nBright Room Ready\nVerified by UL for Discomfort Glare Free (UGR less than 22), you can be confident your LG OLED TV performs great no matter the room or the lighting. With LG OLED you still experience perfect black that delivers stunning picture other brands just can't match.\n-\nGame with the power of LG OLED\nBuilt for gaming with a 0.1ms response time, up to 144Hz refresh rate⁴, and no blurring or tearing. NVIDIA G-Sync, AMD FreeSync Premium, and VRR, and 4 HDMI 2.1 ports.\n-\nLG’s award-winning webOS Smart TV platform\nBrowse all your favorite streaming apps and let LG Channels connects you to over 300 free channels. Plus with LG’s Re:New Program enjoy new software updates and feature refreshes for up to 5 years.⁵\n-\nPersonalized Picture & Sound\nThe Personalized Picture & Sound Wizard uses AI technology to analyze your favorite images and sound clips to create a personalized picture and audio experiences tailored for you.\n-\nPersonalized search and recommendations\nLG AI makes watching easier by learning your preferences. Press the mic button, and AI Concierge suggests tips and recommendations tailored to your viewing habits and the app or source you're using.\n-\nTV Mirroring: Seamlessly Connect and Share\nWith Apple AirPlay 2 and Google Cast, stream content from your phone, tablet, or computer to your TV for a bigger, more immersive experience, perfect for videos, games, and photos.\n-\nReady assist with your connected devices\nControl your TV and connected devices with built-in support for ThinQ, Google Assistant, Amazon Alexa, Matter and Apple HomeKit.⁶\nProduct information\nTechnical Details\nAdditional Information\n| ASIN | B0DYQF1Q3Z |\n|---|---|\n| Customer Reviews |\n4.4 out of 5 stars |\n| Best Sellers Rank |\n|\n| Date First Available | March 10, 2025 |\nWarranty & Support\nFeedback\nProduct Description\nLG's Most Popular Selling OLED TV\nThe advanced LG OLED evo C5-Series is better than ever. The LG OLED evo C5 is powered by the next-gen Alpha 9 Gen8 AI Processor —exclusively made for LG OLED—for ultra-realistic picture and sound along with boosted brightness for luminosity and high contrast, even in well-lit rooms. AI-assisted deep learning analyzes what you're watching and uses your preferences to choose the best picture and sound setting for your content. The C5's almost invisible bezel, ensures it blends with your surroundings. When you're finished watching, display art, photos and other content make the C5 a versatile statement piece. Search less and stream more, thanks to the next generation of AI technology from LG webOS 25. Every LG OLED comes loaded with Dolby Vision for extraordinary color, contrast and brightness, plus Dolby Atmos for immersive sound you can feel all around you. FILMMAKER MODE allows you to see films just as the director intended. Packed with gaming features, the LG OLED evo C-Series comes with everything you need to win like a 0.1ms response time, native 120Hz refresh rate, with VRR up to 144hz for PC gaming and four HDMI 2.1 inputs.\n¹Source: Omdia. Unit shipments, 2013-2024. Results are not an endorsement of LG Electronics. Any reliance on these results is at the third-party’s own risk. ²Image quality of upscaled content will vary based on source resolution. ³Dolby, Dolby Vision, Dolby Atmos, and the double-D symbol are registered trademarks of Dolby Laboratories Licensing Corporation. Manufactured under license from Dolby Laboratories. Confidential unpublished works. Copyright 2012–2025 Dolby Laboratories. All rights reserved. ⁴PC with 144Hz graphic card required. ⁵Internet connection and subscriptions to streaming services are required; number of LG Channels subject to change. Software update will automatically download. Consumers who disable “auto-update” will receive a pop-up notification to accept or deny software update. ⁶Google is a trademark of Google LLC. Google Assistant is not available in certain languages and countries. Apple, the Apple logo and HomeKit are trademarks of Apple Inc., registered in the U.S. and other countries. ⁷Subscription and compatible gaming controller are required.\nCustomer reviews\nCustomer Reviews, including Product Star Ratings help customers to learn more about the product and decide whether it is the right product for them.\nTo calculate the overall star rating and percentage breakdown by star, we don’t use a simple average. Instead, our system considers things like how recent a review is and if the reviewer bought the item on Amazon. It also analyzed reviews to verify trustworthiness.\nLearn more how customers reviews work on AmazonCustomers say\nCustomers are impressed with the TV's picture quality, with one noting its natural outdoor scenes, and they find it relatively easy to set up. The sound quality is adequate, and while some customers say it's worth the price, others find it too bright and vivid. The remote control receives mixed feedback, with some finding it user-friendly while others consider the pointer a major annoyance. Customers report mixed experiences with lag, with some noting no lag while others find it slow.\nAI Generated from the text of customer reviews\nCustomers are impressed with the TV's picture quality, particularly its colors, with one customer noting how facial features are beautifully rendered and how outdoor scenes appear very natural.\n\"...I use Fire Stick TV and Sony Blu-Ray through the HDMI ports. Great picture. Great sound. Well worth the investment.\" Read more\n\"...rein. - \"Pinocchio\" (2022, 4K, Guillermo del Toro), a brilliantly filmed, very dark stop-motion animated film that hits every button...\" Read more\n\"...I like it a lot better than my Samsung TV that it replaced. My PS5 looks amazing on it....\" Read more\n\"Looks great to me, blacks BAF, works very well in daylight and sunny room comparatively to 2020 LG LCD and games fast, responsive… feels snappy with...\" Read more\nCustomers are satisfied with the TV's quality, with one customer specifically praising its video performance.\n\"Extremely well-engineered and intuitive HDTV. I was able to master operating techniques easily....\" Read more\n\"...You get what you pay for and this TV isn’t cheap but it’s definitely quality. 5 stars from me...\" Read more\n\"High quality OLED. Brilliant picture....\" Read more\n\"...To recap. Gonna be a great TV. Pretty good sound quality even without a sound bar or hifi set up. Once I get settings dialed in, I will like it....\" Read more\nCustomers find the TV easy to set up.\n\"Extremely well-engineered and intuitive HDTV. I was able to master operating techniques easily....\" Read more\n\"...Set up was pretty user-friendly. Sound is a lot better than most. You get what you pay for and this TV isn’t cheap but it’s definitely quality....\" Read more\n\"...Total hassle.\" Read more\n\"...Very easy to set up, and user friendly remote control.\" Read more\nCustomers find the TV's sound quality adequate.\n\"...Great picture. Great sound. Well worth the investment.\" Read more\n\"...Set up was pretty user-friendly. Sound is a lot better than most. You get what you pay for and this TV isn’t cheap but it’s definitely quality....\" Read more\n\"High quality OLED. Brilliant picture. Although the sound is adequate, to complement the high quality picture, I would strongly suggest adding a...\" Read more\n\"...To recap. Gonna be a great TV. Pretty good sound quality even without a sound bar or hifi set up. Once I get settings dialed in, I will like it....\" Read more\nCustomers have mixed opinions about the TV's remote control, with some finding it user-friendly, while others report issues with setup and functionality.\n\"...Magic remote pointer is a major annoyance in LG models and there is no option to turn the pointer off permanently....\" Read more\n\"Extremely well-engineered and intuitive HDTV. I was able to master operating techniques easily....\" Read more\n\"...The remote’s a little weird at first, but I had a Wii growing up, so it wasn’t a big adjustment to using the pointer....\" Read more\n\"...Very easy to set up, and user friendly remote control.\" Read more\nCustomers have mixed opinions about the TV's value for money, with some finding it worth every penny and offering good quality for the price, while others consider it inexcusable for its price range.\n\"...Great picture. Great sound. Well worth the investment.\" Read more\n\"...Sound is a lot better than most. You get what you pay for and this TV isn’t cheap but it’s definitely quality. 5 stars from me...\" Read more\n\"...Seeing the etching on Smaug's hide (without the sheen) is worth every penny....\" Read more\n\"Junk! I think we got a bad TV. It cost us $105.00 to send it back. Never again! HDMI connection issues even with 3 brand new HDMI cables....\" Read more\nCustomers have mixed opinions about the TV's brightness, with some finding it too bright and vivid, while one customer notes it works well in daylight and sunny rooms.\n\"Looks great to me, blacks BAF, works very well in daylight and sunny room comparatively to 2020 LG LCD and games fast, responsive… feels snappy with...\" Read more\n\"...MAN (60fps): I know what you're thinking: this movie is intolerable for its irremediable sheen/glow. You're right....\" Read more\n\"Fantastic picture! No complaints so far. Works great with my LG Sound Bar\" Read more\n\"...As I write this, I notice the screen's gradual dimmer is working very well to ensure no image burn-in occurs when I stop typing for a while....\" Read more\nCustomers have mixed experiences with the TV's responsiveness, with some reporting no lag while others find it slow.\n\"...It took almost the entire movie for me to register that there was no lag or choppiness in Dune Part 2 at all... none (at least with BFI engaged)....\" Read more\n\"...voice sounds as if the person inhaled helium from a balloon and spoke very fast....\" Read more\n\"...well in daylight and sunny room comparatively to 2020 LG LCD and games fast, responsive… feels snappy with high HZ feedback. Niiice....\" Read more\n\"...Slow, sluggish, and inexcusable for this price range....\" Read more\nReviews with images\nLG's BFI TAMES BILBO's and SMAUG's HORRID GLOWING!\nTop reviews from the United States\nThere was a problem filtering reviews. Please reload the page.\n- Reviewed in the United States on June 4, 2025Size: 55 InchesStyle: TV OnlyVerified PurchaseExtremely well-engineered and intuitive HDTV. I was able to master operating techniques easily. I use Fire Stick TV and Sony Blu-Ray through the HDMI ports. Great picture. Great sound. Well worth the investment.\n- Reviewed in the United States on June 14, 2025Size: 55 InchesStyle: TV OnlyVerified PurchaseComparison: My new LG 4K Smart OLED TV (OLED55C5PUA, 2025) vs my old LG 4K Smart OLED TV (OLED55CXPUA, 2020)\nSources Used: Sony UBP-X700 4K Ultra HD Player (October 2024) and 4K Ultra HD Blu-ray discs.\nConnectors: Zeskit Maya 8K 48Gbps Certified Ultra High-Speed HDMI Cable 16ft CL3 In-Wall Rated\nRemote Control Solution: As others rightly indicate, the new remote that comes with this TV is not up to the tasks required. I ended up using the remote that came with the previous version of this TV - the \"LG Remote Magic Remote Control\" (AKB75855501) - which is available on Amazon.\nLG TV's UNIQUE STANDOUTS SUMMARY\n- \"Nightmare Alley\" (2021, 4K, Guillermo del Toro) joins perfect details and colors to allow the genre's nihilism free rein.\n- \"Pinocchio\" (2022, 4K, Guillermo del Toro), a brilliantly filmed, very dark stop-motion animated film that hits every button (Note: not for young children).\n- \"TRON: Legacy\" (2010, 2K upscaled to 4K, Joseph Kosinski) is everything a gorgeous Sci-Fi drama - with stellar soundtrack - should be thanks to LG and Disney.\n(DETAILED EVALUATIONS BELOW)\nPreface: All my viewing was in HDR mode for 4k. I used the movies listed below, all of which benefitted from excellent motion smoothing, without awful sheen/glow, when rendered using moderate level of this TV's Black Frame Insertion (BFI) in Game Mode and a touch of extra brightness. Bright or dark room did not matter. (See bottom of page for comments on 2K SDR/Regular Blu-ray.)\nTHE HOBBIT - THE DESOLATION OF SMAUG (48fps): If you hated the 48fps of The Hobbit, your troubles are over! Watch this movie with correct BFI and generally accepted parameters for Game Mode on this TV. Then the natural appearance of everything in this movie will bowl you over. Faces are normal. The spiders of Mirkwood show markings that are easier to see and have colors that make sense on those horrid creatures. Seeing the etching on Smaug's hide (without the sheen) is worth every penny.\nSTAR WARS (2020 UHD Release)(24fps): The movie is fun and impressive to watch given how old it is. The color and lighting are very good. Its sheen was tamed very well on this TV, and scenes filmed outdoors were very natural. (When I watched this movie on my previous LG TV - the OLED55CXPUA, 2020 - I was distracted by the less manageable sheen/glow.)\nDUNE, PARTS 1 and 2:\n- (Dune1, 24fps) The abundance of sand colors and sunlight make the DUNE movies bright overall. Beautiful browns in their various shades are a treat. In the midst of all that brown, you should notice subtle dark shades of green on clothing, and quilt-like stitching on the jackets. Facial features are beautifully rendered. The Bene Gesserit ship passing through and out of The Spacing Guild's Heighliner (at 20m:50s) and the Worm Spotter aircraft's flight (at 1h:01m:50s) should not break up in their movements across the screen. In the battle scenes when the Harkonnen invade, you should see no tearing or empty space in the rolling flames.\n- (Dune2, 24fps/48fps) It took almost the entire movie for me to register that there was no lag or choppiness in Dune Part 2 at all... none (at least with BFI engaged). Turns out Dune Part 2 occasionally used 48fps in some places instead of 24fps only, an approach that worked almost magically. It now takes 1st place as the best all-around film in my collection.\nBLADE RUNNER 2049 (24fps): The BFI nailed the surrounding colors and movement of K's police vehicle as it passed behind buildings. The vehicle's movement was smooth and the snow/rain contrails moving over and past the back of the vehicle were easy to pick out. Colors were incredibly detailed and vibrant at every turn.\n1917 (24fps): This movie benefits enormously from BFI and reduces the number of \"jittery\" scenes to two: 1) the stuttering movement as the camera views an embankment and pans left to right just after the two soldiers narrowly escape the collapsing tunnels, and 2) the panning left to right as the two soldiers are in a barn looking through wood slats at a plane in the distance.\nOBLIVION (24fps): I've watched this movie many times and this LG TV brought out colors better than the previous LG. The motions were very smooth and details abounded. Things to look for are Vicca's tears running down her face and off her nose as she betrays Jack, and the flickering lights when Julia and the hapless people are in the sights of the drone programmed to kill them (the flickering lights should not tear or have holes).\nFORD v FERRARI (24fps): The most interesting and exciting (and perpetual) visual experience I had with this movie was the heightened detail seen on clothing I don't recall seeing on the previous TV. But most of all the colors of red and brown in their various shades were able to make me fall further into the movie as everything seemed so very natural.\nTHE PRESTIGE (24fps): This is a very detailed movie where the differing shades of brown are everywhere. Especially look for the brown variants (and other colors) in the weave of the tweed coats, especially prominent near the end of the movie.\nGEMINI MAN (60fps): I know what you're thinking: this movie is intolerable for its irremediable sheen/glow. You're right. It's also too intimate: it's as close to \"being there\" than I could tolerate... feels creepy, like eavesdropping. I played this all the way through again but came away with no changed opinions, except for very slightly better colors all 'round. HOWEVER, the climax near the end of the movie is visceral in how it renders the minigun being used to shred the store where the heroes are sheltering. TECHNICALLY SPEAKING, I must say that one of the most impressive demonstrations of BFI motion smoothing is how, in the opening scene, the filmmaker was able to sweep the camera across the ribbed structure above the train station and not induce seizures. (On the other hand, you might want seizure medicine handy if you try to view that panned ribbed structure with no BFI enabled.) On the whole, its motion smoothing and details are absolutely amazing.\nRegarding 2K SDR (i.e., regular Blu-ray), my results were either very good or very poor. For instance, the original releases of Avatar, Total Recall (2012), and The Imitation Game rendered outstanding results. On the other hand, The Last Samurai and Sherlock Holmes: A Game of Shadows were a disappointment. While the upscaling and motion smoothing were excellent on all these 2K movies, the Last Samurai and Sherlock Holmes renderings were too dark or dull, foggy, and wispy. The previous model of this same TV (OLED55CXPUA, 2020) did not have such challenges and disparities.\nAs I write this, I notice the screen's gradual dimmer is working very well to ensure no image burn-in occurs when I stop typing for a while. (At the moment, I am using the TV's input connected to my computer.) Even though the dimming feature is not good for watching movies, it is a must for anything else. Thankfully, when using the 4k input for movies, and Game Mode is enabled, the TV will not dim on its own.\n5.0 out of 5 starsComparison: My new LG 4K Smart OLED TV (OLED55C5PUA, 2025) vs my old LG 4K Smart OLED TV (OLED55CXPUA, 2020)LG's BFI TAMES BILBO's and SMAUG's HORRID GLOWING!\nReviewed in the United States on June 14, 2025\nSources Used: Sony UBP-X700 4K Ultra HD Player (October 2024) and 4K Ultra HD Blu-ray discs.\nConnectors: Zeskit Maya 8K 48Gbps Certified Ultra High-Speed HDMI Cable 16ft CL3 In-Wall Rated\nRemote Control Solution: As others rightly indicate, the new remote that comes with this TV is not up to the tasks required. I ended up using the remote that came with the previous version of this TV - the \"LG Remote Magic Remote Control\" (AKB75855501) - which is available on Amazon.\nLG TV's UNIQUE STANDOUTS SUMMARY\n- \"Nightmare Alley\" (2021, 4K, Guillermo del Toro) joins perfect details and colors to allow the genre's nihilism free rein.\n- \"Pinocchio\" (2022, 4K, Guillermo del Toro), a brilliantly filmed, very dark stop-motion animated film that hits every button (Note: not for young children).\n- \"TRON: Legacy\" (2010, 2K upscaled to 4K, Joseph Kosinski) is everything a gorgeous Sci-Fi drama - with stellar soundtrack - should be thanks to LG and Disney.\n(DETAILED EVALUATIONS BELOW)\nPreface: All my viewing was in HDR mode for 4k. I used the movies listed below, all of which benefitted from excellent motion smoothing, without awful sheen/glow, when rendered using moderate level of this TV's Black Frame Insertion (BFI) in Game Mode and a touch of extra brightness. Bright or dark room did not matter. (See bottom of page for comments on 2K SDR/Regular Blu-ray.)\nTHE HOBBIT - THE DESOLATION OF SMAUG (48fps): If you hated the 48fps of The Hobbit, your troubles are over! Watch this movie with correct BFI and generally accepted parameters for Game Mode on this TV. Then the natural appearance of everything in this movie will bowl you over. Faces are normal. The spiders of Mirkwood show markings that are easier to see and have colors that make sense on those horrid creatures. Seeing the etching on Smaug's hide (without the sheen) is worth every penny.\nSTAR WARS (2020 UHD Release)(24fps): The movie is fun and impressive to watch given how old it is. The color and lighting are very good. Its sheen was tamed very well on this TV, and scenes filmed outdoors were very natural. (When I watched this movie on my previous LG TV - the OLED55CXPUA, 2020 - I was distracted by the less manageable sheen/glow.)\nDUNE, PARTS 1 and 2:\n- (Dune1, 24fps) The abundance of sand colors and sunlight make the DUNE movies bright overall. Beautiful browns in their various shades are a treat. In the midst of all that brown, you should notice subtle dark shades of green on clothing, and quilt-like stitching on the jackets. Facial features are beautifully rendered. The Bene Gesserit ship passing through and out of The Spacing Guild's Heighliner (at 20m:50s) and the Worm Spotter aircraft's flight (at 1h:01m:50s) should not break up in their movements across the screen. In the battle scenes when the Harkonnen invade, you should see no tearing or empty space in the rolling flames.\n- (Dune2, 24fps/48fps) It took almost the entire movie for me to register that there was no lag or choppiness in Dune Part 2 at all... none (at least with BFI engaged). Turns out Dune Part 2 occasionally used 48fps in some places instead of 24fps only, an approach that worked almost magically. It now takes 1st place as the best all-around film in my collection.\nBLADE RUNNER 2049 (24fps): The BFI nailed the surrounding colors and movement of K's police vehicle as it passed behind buildings. The vehicle's movement was smooth and the snow/rain contrails moving over and past the back of the vehicle were easy to pick out. Colors were incredibly detailed and vibrant at every turn.\n1917 (24fps): This movie benefits enormously from BFI and reduces the number of \"jittery\" scenes to two: 1) the stuttering movement as the camera views an embankment and pans left to right just after the two soldiers narrowly escape the collapsing tunnels, and 2) the panning left to right as the two soldiers are in a barn looking through wood slats at a plane in the distance.\nOBLIVION (24fps): I've watched this movie many times and this LG TV brought out colors better than the previous LG. The motions were very smooth and details abounded. Things to look for are Vicca's tears running down her face and off her nose as she betrays Jack, and the flickering lights when Julia and the hapless people are in the sights of the drone programmed to kill them (the flickering lights should not tear or have holes).\nFORD v FERRARI (24fps): The most interesting and exciting (and perpetual) visual experience I had with this movie was the heightened detail seen on clothing I don't recall seeing on the previous TV. But most of all the colors of red and brown in their various shades were able to make me fall further into the movie as everything seemed so very natural.\nTHE PRESTIGE (24fps): This is a very detailed movie where the differing shades of brown are everywhere. Especially look for the brown variants (and other colors) in the weave of the tweed coats, especially prominent near the end of the movie.\nGEMINI MAN (60fps): I know what you're thinking: this movie is intolerable for its irremediable sheen/glow. You're right. It's also too intimate: it's as close to \"being there\" than I could tolerate... feels creepy, like eavesdropping. I played this all the way through again but came away with no changed opinions, except for very slightly better colors all 'round. HOWEVER, the climax near the end of the movie is visceral in how it renders the minigun being used to shred the store where the heroes are sheltering. TECHNICALLY SPEAKING, I must say that one of the most impressive demonstrations of BFI motion smoothing is how, in the opening scene, the filmmaker was able to sweep the camera across the ribbed structure above the train station and not induce seizures. (On the other hand, you might want seizure medicine handy if you try to view that panned ribbed structure with no BFI enabled.) On the whole, its motion smoothing and details are absolutely amazing.\nRegarding 2K SDR (i.e., regular Blu-ray), my results were either very good or very poor. For instance, the original releases of Avatar, Total Recall (2012), and The Imitation Game rendered outstanding results. On the other hand, The Last Samurai and Sherlock Holmes: A Game of Shadows were a disappointment. While the upscaling and motion smoothing were excellent on all these 2K movies, the Last Samurai and Sherlock Holmes renderings were too dark or dull, foggy, and wispy. The previous model of this same TV (OLED55CXPUA, 2020) did not have such challenges and disparities.\nAs I write this, I notice the screen's gradual dimmer is working very well to ensure no image burn-in occurs when I stop typing for a while. (At the moment, I am using the TV's input connected to my computer.) Even though the dimming feature is not good for watching movies, it is a must for anything else. Thankfully, when using the 4k input for movies, and Game Mode is enabled, the TV will not dim on its own.\nImages in this review\n- Reviewed in the United States on July 10, 2025Size: 42 InchesStyle: TV OnlyVerified PurchaseWhy did you pick this product vs others?:The media could not be loaded.\nI like it a lot better than my Samsung TV that it replaced. My PS5 looks amazing on it. Currently playing armored core 6 and the visuals are outstanding. Set up was pretty user-friendly. Sound is a lot better than most. You get what you pay for and this TV isn’t cheap but it’s definitely quality. 5 stars from me\n- Reviewed in the United States on August 1, 2025Size: 65 InchesStyle: TV OnlyVerified PurchaseLooks great to me, blacks BAF, works very well in daylight and sunny room comparatively to 2020 LG LCD and games fast, responsive… feels snappy with high HZ feedback. Niiice. $1000 off the 2696$ ($1696 total) brand new price tag for 65”. Okay. Thanks! Remote doesn’t seem to have an input fast switch, first time ever maybe, that sucks.\n- Reviewed in the United States on July 13, 2025Size: 48 InchesStyle: TV OnlyVerified PurchaseJunk! I think we got a bad TV. It cost us $105.00 to send it back. Never again! HDMI connection issues even with 3 brand new HDMI cables. It would on see on device at a time. You’d have to keep unplugging and plugging in whatever HDMI you wanted to use at the time. Total hassle.\n- Reviewed in the United States on May 27, 2025Size: 55 InchesStyle: TV OnlyVerified PurchaseI'd give this 4 or 5 stars for the TV but the manuals for it from LG are beyond pathetic. You have to find websites to help you figure out options you may want. If you want to just plug it in and have it be acceptable, this ain't for you. If you want a good manual for the manufacturer, this ain't for you. I found and downloaded the manual on their site (because, of course it does not come with one that is of any use). And the online details almost nothing. The little quick set up manual is the most pathetic of any I've ever seen. Tiny print. Hardly worth looking at.\nAs for good screen display set up, I looked at a lot of recommendations online. Those suggesting a number of setting changes recommend filmmakers mode. One guy recommended Cinema mode with lower brightness on leds to get good image and color. First night with it I watched a hockey game and none of the standard presets looked good (between standard, sports, gamer, vivid). All too bright too vivid, too unreal looking. Ended up turning off power saving because it was always too bright for my room no matter what. It could not adjust itself down enough. Ended up, after reading that one persons recs on Cinema mode with LEDs output turned down to 50%. That got it to a very good place with good color, excellent brightness, and it looked fantastic on another hockey game and movie test on Apple TV.\nNow for the remote. I suggest you get a standard LG tv remote. We have one. It is so vastly better than the model that comes with it. Not even a simple button to get to selecting which HDMI input. The old, basic, non floating around your screen cursor models work far better. And you can turn that function off. But you know what does? A basic LG remote that does not have that function but has FAR more obvious and simple buttons. I got an LG tv for our conference room at work. Non LED and a 1/4th the cost four years ago. On that model, you can turn off the Magic mousing feature, whatever they call it.\nTo recap. Gonna be a great TV. Pretty good sound quality even without a sound bar or hifi set up. Once I get settings dialed in, I will like it. None of the default set up choices presents an acceptable picture to me. Too bright, too vivid, even on standard mode. Going to take a lot of fiddling or get a pro to come to your house. Serious.\nAnyway, summary.\nTV great. Or I expect it to be.\nManuals, utterly pathetic. And since there is no easy mode, that's bad.\nRemote. Unacceptably poor, few functions, very unintuitive.\nAbout me. Life long tech nerd with a lot of experience. This TV and manuals and remotes would suck for a novice.\n- Reviewed in the United States on August 7, 2025Size: 55 InchesStyle: TV OnlyVerified PurchaseGood enough quality for the price and being a new model. If possible, you should go for the 55\" model instead of the 42\" as the price difference is negligible. During setup, the voice sounds as if the person inhaled helium from a balloon and spoke very fast. Magic remote pointer is a major annoyance in LG models and there is no option to turn the pointer off permanently. For this price, people should get a remote with backlight but that is not the case, unfortunately. Minus one star just due to annoying remote and pointer.\nImportant information\nOn-mode power consumption\n133.1 watts\nEnergy consumption\n246 Kilowatt Hours Per Year per year, based on the power consumption of the television operating 4 hours per day for 365 days. The actual energy consumption will depend on how the television is used.\nVisible screen diagonal\n55\" / 140 cm"
    },
    {
      "url": "https://www.cnet.com/tech/home-entertainment/best-tv/",
      "text": "Buying the best TV for your needs is a balancing act of finding the best picture quality, the best price and the size that's right for your room. Here at CNET, I test TVs head-to-head in our dedicated lab, and I want to help you choose the television with the best bang for your buck. Whether you need it for gaming, sports or streaming shows and movies, there’s a model here for you.\nOur Picks\nTV DEALS OF THE WEEK\n- $1,000 (save $700)\n- $850 (save $150)\n- $1,397 (save $1,303)\n- $1,298 (save $702)\n- $2,997 (save $700)\nThere are a bunch of 2025 televisions now available in stores, and I've reviewed a good deal of them, but even so, some of the recommendations below debuted last year. This is because TVs are a stable technology, and year-to-year improvements are usually minor, which means in some cases you can buy a similar TV to a 2025 model, but for half the price. That said, here are the best TVs you can buy now, from high-end QLED and OLED TVs to midrange mini-LED and cheap 4K smart TVs.\nThese are the best TVs for 2025\nPros\n- Best overall image quality I've tested\n- Best-in-class glare reduction in a bright room\n- Superior contrast and off-angle viewing\n- Ultrathin panel with external input box\nCons\n- Expensive\n- Slightly diminished contrast in bright rooms\nIf you want the best TV you can buy in 2025, this is it. Samsung's S95F takes everything we loved about last year's S95D -- great picture quality, super-fast gaming, superior anti-glare -- and somehow manages to improve upon it. What's especially impressive is how good this TV is at banishing reflections, which makes it well-suited to watching in a bright room. If you find yourself squinting at the screen because you can see a window or overhead lights in your picture, this TV is for you. While there is some loss of contrast with the lights on, it's not as pronounced as with the S95D, and its overall lack of reflectivity is well worth the trade-off.\nPicture quality is just as great as you'd expect from an OLED, with vivid colors and fantastic contrast. The TV has also had a brightness boost in 2025 of around 30 percent and can go toe-to-toe with the even-brighter (on paper, at least) LG G5.\nThe only downside? It costs a lot of money. Yet, as Samsung's flagship OLED, the S95F makes your investment worthwhile -- and rewards movie fans and gamers alike with excellent performance in an attractive package.\nBrightest OLED TV of 2025\nLG OLED G5\nPros\n- The G5 has the highest brightness of any OLED TV yet\n- It's capable of stunning image quality\nCons\n- Brightness boost is not visible in all content\n- Remote is not as good as previous versions\n- Expensive compared to LG C4\nWhile every other OLED TV until now has shown modest increases year-over-year, the LG G5 is a massive improvement on its predecessor. LG says it has a 40% improvement in brightness -- and I verified this through my own testing -- and it's a TV that can take on LCD TVs for its clarity and punch. The G5 has better color than the company's own C5, and it's a lot better for gaming, too. For the right person, the extra $600 or so for the G5 over the C5 is well worth it.\nWith its high brightness the G5 is also great for use in a lit room, though it's second to the excellent Samsung S95F, in my testing, in terms of reducing glare in a bright room.\nWith excellent brightness, punchy contrast and bold color, the LG G5 is one of the best TVs if you want the best picture possible from a 2025 TV.\nBest TV value for 2025\nLG OLED C4\nPros\n- Better picture quality than any non-OLED TV we've tested\n- Superior contrast and off-angle image\n- Best-in-class gaming features\n- Sleek styling with ultralight, thin panel\nCons\n- Expensive\n- Not as bright as higher-end OLED TVs\n- No major improvements over the C3\nThe C4 may be a 2024 TV, but it is the best TV you can buy right now for number of reasons: namely, it has better picture quality than any LCD TV on this list, including the TCL QM8, and it's currently selling for the same price as a mid-range LCD TV. As I found in my measurements, the C4 has perfect black levels, unbeatable contrast and well-saturated colors. In my comparison tests, its overall brightness isn't quite as impressive as 2025 OLEDs like the C5 and G5, but it's still an incredible performer in all types of room lighting.\nThe C4 is well-suited to almost any kind of content. For example, its fast pixel response times and high saturation make it great for watching sports, as well as making it a superb gaming TV.\nThe C4 demonstrates why it's often better to buy last year's version of a TV. It's very similar to the new C5 and about a grand cheaper in the 65-inch size.\nAs an OLED, the C4 is still more expensive than the cheaper TVs here, so the only reason you wouldn't buy this TV is if you wanted a better \"bang for buck.\" The TCL QM8 or even the Roku Pro Series is a better value.\nBest TV under $1,000 in 2025\nTCL QM6K\nPros\n- The TCL QM6K has excellent picture quality\n- The black levels are surprisingly deep\n- This TV offers outstanding bang for buck\nCons\n- The TV's brightness and color saturation could be better\nWhen it comes to the best TVs for the money, it's the TVs priced under a grand typically include the features you want without paying too much. The TCL QM6K started at a grand and is now even cheaper (around $650) and it has those tick boxes already checked -- excellent picture quality, streaming, and gaming. It's an attractive TV with its \"bezel-less\" design and is simple to put to together and set up.\nThe TV boasts compatibility with all the HDR formats -- including both Dolby Vision and HDR10+ -- and includes the company's Halo Control System processing, which is designed to eliminate backlight haloing in its 500 dimming zones.\nIn my side-by-side tests of the TV I found that it had plenty of contrast compared to its competition, though I had hoped for a lot more oomph in the brightness department -- its 655 nit reading is super low for a modern TV. Yet, if you're watching in the dark, or without direct reflections, its lack of dazzling whites won't be an issue.\nBest TV for the money\nTCL QM851 (2024)\nPros\n- Relatively affordable\n- Excellent overall image quality\n- Best-in-class brightness and contrast\n- Capable Google TV system\nCons\n- Not as accurate as some competitors\n- Available only in 65-inch size and larger\nTCL has topped CNET's list of the best TVs for the past few years, and the QM851 is even better than before. In my side-by-side comparison tests with the Roku Pro and the Hisense U8, the TCL stood out with superior brightness and excellent color -- all while maintaining excellent contrast: a combination the other TVs couldn’t match at this price.\nThe key to its picture-quality performance is mini-LED tech and well-implemented full-array local dimming.\nIt also has a sleek design with a center-mount stand. The operating system is Google TV, which I don't like as much as Roku TV, but it's still a solid smart TV.\nApart from an ever-so-slightly-slower gaming response time -- measured at about 1ms slower than most and 4ms slower than the best -- the main downside of the TCL QM8 is that it's only available in large sizes (65 inches and up). If you're looking for a TV for a smaller space, I recommend the Hisense U8 instead.\nBest budget TV\nSamsung DU7200\nPros\n- Cheap\n- Excellent black levels and shadow detail\n- Plenty of streaming options\nCons\n- Desaturated reds\n- Interface is less user-friendly than a Roku TV\nIn terms of the best bang for buck, one of the most impressive models has been the Samsung DU7200 -- it's a TV that delivers a really good picture for an affordable price. The black levels and shadow detail are excellent for the money, and while my test unit looked a little desaturated out of the box, that was easily fixed by adjusting the Color control. The TV has onboard streaming, and the sound quality isn't too bad either. If you're looking for a bedroom unit or a smaller gaming TV then the Samsung DU7200 is the model I would choose. Don't buy it if you're a stickler for image quality, but for the price, it's pretty great.\nRecent updates\nAug 7, 2025: Added TCL QM6K to best TV under $1,000\nJuly 18, 2025: Samsung S95F OLED is now my Editors' Choice for best high-end TV, and added the Samsung S90F and LG C5 to Also tested.\nJuly 3, 2025: Updated list with a review of 2025's Samsung S95F, plus the latest pricing.\nOther TVs I've tested\nRoku Pro Series: If you're looking for a gaming TV and don't want to spend the money on an OLED model, the Roku Pro is a solid choice. Read CNET's review of the Roku Pro (2024)\nSamsung S90F: The Samsung S90F is a fantastic TV with great contrast levels and highly saturated colors, and it's great for gaming, too. Yet it's still more expensive than last year's LG C4 and S90D, and not that much different. Get those instead while they're still available. Read my review of the S90F OLED TV\nLG C5: Like the S90F, this is an excellent OLED TV for watching TV or playing games. However, at the moment, it's stuck between the much-cheaper LG C4 and the much better, though more expensive, LG G5. Read my review of the LG C5 TV.\nPanasonic Z95A: The Panasonic Z95A is a superb TV and it has one advantage over most at the price because of its dedicated speaker system, giving it decent sound quality. The inclusion of Amazon Fire TV is also unusual for the price but I still prefer Google TV. Read CNET's hands-on of the Panasonic Z95A.\nSamsung S90D: The S90D performed well in our measurement tests but it suffered some contrast loss compared to the C4. Any differences between the C4 and S90D were subtle. Read CNET's full review of the Samsung S90D.\nSamsung S95D: With a versatile matte screen and awesome picture, the Samsung S95D delivers astounding image quality, and is quite a bit cheaper than the,nbest muscle relaxers albeit better, S95F. Read CNET's full review of the Samsung S95D.\nHow CNET tests TVs\nIn every CNET TV review, I compare three or more similar TVs side by side in a dedicated, light-controlled test lab. With each review, I employ a rigorous, unbiased evaluation process that has been honed in more than two decades of TV reviews. I test TVs with a combination of scientific measurements and real-world evaluations of TV, movies and gaming content.\nTo ensure I can evaluate the picture quality of every TV I employ the use of an AVPro Connect 8x8 4K HDR splitter so each one receives the same signal. I test the TVs using various lighting conditions playing different media, including 4K HDR movies and console games, across a variety of test categories, from color to video processing to gaming to HDR.\nIn order to measure each TV, I use specialized equipment to grade according to light output and color. My hardware includes a Konica Minolta CS-2000 spectroradiometer and a Murideo Six-G 4K HDR signal generator. I use Portrait Displays CalMan Ultimate software to evaluate every TV I review according to their brightness, black levels and color.\nMy reviews also account for such things as features, design, smart TV performance, connectivity including HDMI inputs and gaming compatibility.\nCheck out How CNET Tests TVs for more details.\nFactors to consider when choosing a TV\nWith all of the TVs available today, and all of the technical terms and jargon associated with television technology, it can be tough to figure out what's important. Here's a quick guide to help cut through the confusion.\nPicture quality: Broadly speaking, the type of display technology helps dictate how good a TV's picture quality is, but OLED is typically the best display technology, and this is followed by LCD (including QLED, and Mini LED). OLED tends to have the best picture quality because it doesn't need a backlight and every pixel can be either on or off, leading to great black levels. In comparison, each LED in a backlight looks after multiple pixels at a time so it isn't as precise -- it's not yet 1:1. Among midrange models, look for a feature including full-array local dimming, mini-LED and 120Hz refresh rate, which (unlike some other extras) do help improve the picture in my experience. Additionally, If a TV uses Quantum Dots it often leads to better color performance, whether it's an OLED or an LCD.\nScreen size: Bigger is better in my book. I recommend a size of at least 43 inches for a bedroom TV and at least 55 inches for a living room or main TV -- and 65 inches or larger is best. More so than any \"feature,\" stepping up in TV screen size is the best use of your money. One of the most common post-TV-purchase complaints I've heard is from people who didn't go big enough. And I rarely hear people complain that their TV is too large. It's worth adding that while TVs can get really big indeed, 4K resolution is sufficient for even the biggest models, and CNET doesn't recommend any 8K TVs as they represent a poor comparative value.\nPrice: TVs range in price from $100 to more than $2,000. Smaller screens are cheaper, well-known brands are more expensive and spending more money can also get you better image quality. Most entry-level TVs have a good enough picture for most people, but TVs last a long time, so it might be worth spending more to get a better picture. It's also best to shop for a TV in the fall when prices are lower.\nSound quality: Every TV has some sort of built-in speaker, but in my twenty years of reviewing AV equipment the sound of modern TVs has been routinely terrible. While I do test the audio on each model, if you are serious about sound quality then buying a separate soundbar (from $100) or home theater system will instantly improve vital aspects such as speech and bass reproduction.\nSmart TV: Among entry-level TVs the most important feature is what kind of smart TV system the TV uses, and while some are proprietary to each brand (Samsung and LG) some models do offer Roku and Google TV.\nFor more TV buying advice check out How to Buy a TV.\nTV brightness according to CNET's testing\nOne important aspect of image quality I test is overall brightness using the CS-2000 spectroradiometer. Here's how brightness compares in nits across select TVs listed above.\nLight output in nits\n| TV | Brightest mode (HDR) | Accurate mode (HDR) | Brightest mode (SDR) | Accurate mode (SDR) |\n|---|---|---|---|---|\n| TCL QM8 (2024) | 3,183 | 3,183 | 3,084 | 1,262 |\n| Hisense U8N | 3,175 | 3,175 | 3,168 | 1,112 |\n| LG OLED C4 | 1,213 | 968 | 414 | 390 |\n| LG OLED G5 | 2,813 | 2.297 | 1,030 | 412 |\n| Samsung S95F | 2,150 | 2,150 | 391 | 297 |"
    },
    {
      "url": "https://www.amazon.com/dp/B0DSRHTGYG?tag=cnet-buy-button-20",
      "text": "| Brand Name | TCL |\n|---|---|\n| Item Weight | 51.8 pounds |\n| Product Dimensions | 2.2 x 65.8 x 37.8 inches |\n| Item model number | 75QM6K |\n| Batteries | 2 AAA batteries required. (included) |\n| Color Name | Black |\n| Special Features | 144hz Refresh Rate, 288hz Variable Gaming Refresh Rate, Google TV, High Contrast Screen, Onkyo Audio System |\n| Item Weight | 51.8 Pounds |\n| Standing screen display size | 75 Inches |\n| Aspect Ratio | 16:9 |\nLearn more\nNo featured offers available\nWe feature offers with an Add to Cart button when an offer meets our high standards for:\n- Quality Price,\n- Reliable delivery option, and\n- Seller who offers good customer service\n- 7 VIDEOS\nImage Unavailable\nColor:\n-\n-\n-\n- To view this video download Flash Player\nTCL 75-Inch Class QM6K Series QD-Mini LED 4K UHD Google Smart TV Best Value Mini-LED TV - QLED, 144hz, 288hz Gaming Rate, High Contrast Screen, Onkyo Audio, Dolby Atmos (75QM6K, 2025 Model)\nOur specialist Customer Support for large items dispatched from Amazon is on hand to help with your order. Contact us via phone or chat 7 days a week.\n| Screen Size | 75 Inches |\n| Brand | TCL |\n| Display Technology | 4K UHD, Mini Led, QLED |\n| Resolution | 4K |\n| Refresh Rate | 144 Hz |\n| Special Feature | 144hz Refresh Rate, 288hz Variable Gaming Refresh Rate, Google TV, High Contrast Screen, Onkyo Audio System See more |\n| Included Components | Power Cable, Remote Control, Stand, User Manual |\n| Connectivity Technology | Ethernet, HDMI, RF, USB, Wi-Fi |\n| Aspect Ratio | 16:9 |\n| Product Dimensions | 2.2\"D x 65.8\"W x 37.8\"H |\nAbout this item\n- TCL QM6K QD-MINI LED TV SERIES - AFFORDABLE PREMIUM PERFORMANCE FOR SPORTS, GAMING & STREAMING. Experience superior contrast, rich color, and ultra-smooth motion with TCL’s QD-Mini LED technology. Designed to outperform traditional QLED and OLED TVs, the QM6K is the best TV for every moment—whether you're streaming, gaming, or watching the big game.\n- QD-MINI LED. IT’S MINI LED PLUS QLED COLOR - BREATHTAKING BRIGHTNESS AND COLOR IN ANY LIGHT. Combines ultra-precise Mini LEDs with Quantum Dot technology for incredible brightness, bold contrast, and over a billion vibrant colors.\n- TCL HALO CONTROL SYSTEM - BETTER BLACKS. SHARPER DETAIL. NO BLOOMING. Advanced local dimming eliminates haloing, enhances shadow detail, and improves picture accuracy—so dark scenes look deeper, and bright scenes stay crisp.\n- DOLBY VISION, HDR10+, HDR10 & HLG - STUNNING HDR IN EVERY FORMAT. Enjoy 4K content the way it was meant to be seen. Dynamic HDR support delivers exceptional color, contrast, and detail across all major formats.\n- 144HZ NATIVE REFRESH RATE + MOTION RATE 480 - SMOOTH, FAST ACTION—PERFECT FOR LIVE SPORTS. Watch fast-paced action with incredible clarity and minimal motion blur—making this one of the best TVs for sports.\n- GAME ACCELERATOR 288 + AUTO GAME MODE + GAMEBAR - GAME AT PRO SPEED WITH TOTAL CONTROL. Play at up to 288 VRR with ultra-low input lag and HDMI 2.1 support. GameBar puts real-time performance stats on screen so you're always in command—making this one of the best TVs for gaming.\n- AIPQ ENGINE WITH HDR PRO+ - SMARTER PICTURE, AUTOMATICALLY OPTIMIZED. AI-powered processing analyzes every scene to enhance brightness, color, and contrast in real time, so everything looks its best—without adjustments.\n- DOLBY ATMOS + ONKYO 2.1 CHANNEL AUDIO SYSTEM - IMMERSIVE SOUND THAT PULLS YOU IN. Hear every detail with rich, powerful sound and built-in subwoofer. Dolby Atmos delivers surround-like audio without the need for external speakers.\n- GOOGLE TV OS + HANDS-FREE VOICE CONTROL - STREAM SMARTER AND DO MORE WITH YOUR VOICE. All your content organized in one simple interface. Use your voice to search, launch apps, and control smart home devices—no remote needed.\n- ART MODE - TURN YOUR TV INTO ART WHEN IT’S OFF. Display personal photos, ambient visuals, or curated artwork to blend your screen into your space even when not in use.\nTop Brand: TCL\nWhat's in the box\nProduct information\nTechnical Details\nAdditional Information\n| ASIN | B0DSRHTGYG |\n|---|---|\n| Customer Reviews |\n4.4 out of 5 stars |\n| Best Sellers Rank |\n|\n| Date First Available | February 3, 2025 |\nWarranty & Support\nFeedback\nProduct Description\nTCL QM6K Series Smart TV, The New Definition of Affordable Premium, is ideal for fast action movies, sports, and next level gaming TCL’s Halo Control System that includes the New Super High Energy LED Microchip, Condensed Micro Lens, Micro OD Reduced Optical Distance, High Contrast HVA Panel, Enhanced QLED, Zero Delay Transient Response, Bi-direction 23-bit Backlight Controller, and Dynamic Light Algorithm for Stunning “Halo-Free” Images. With Up to LD500 Precise Dimming Series and High HDR Brightness, you’ll experience pure black levels and a great picture in virtually any room lighting environment. TCL's AIPQ PRO Processor, an advanced processor optimizing each scene with machine learning provides an unrivaled cinematic experience. 144Hz native panel refresh rate with Motion Rate 480 focuses on best-in-class motion clarity producing smooth video playback. With TCL's Game Accelerator 288 (240 on 50”/55”) and Auto Game Mode gameplay is blistering fast keeping you ahead of the competition. TCL QM6K TVs feature Dolby Atmos, DTS Virtual:X, and an all new ONKYO speaker system with a built-in subwoofer* for high performance spatial sound. TCL QM6K Series Smart TVs are the new definition of Affordable Premium.\nFrom the brand\n-\nTCL delivers meaningful experiences through thoughtful design and the latest technology.\nAfter spending nearly 40 years at the forefront of consumer technology, TCL has pushed the boundaries of what's possible, raising the bar across our industry, and proudly pioneering new innovations.\nTCL produces millions of TVs, mobile devices, and appliances globally, making us a leader in consumer electronics.\n-\nBest Sellers\n-\nTCL Sound Bars\nFrom the manufacturer\nModel Comparison\n| QM6K QD Mini-LED TV | QM7K QD Mini-LED TV | S5 4K UHD TV | Q6 QLED 4K TV | NXTVISION Lifestyle TV | |\n|---|---|---|---|---|---|\n|\nCustomer Reviews\n|\n4.4 out of 5 stars 265\n|\n4.2 out of 5 stars 95\n|\n4.0 out of 5 stars 2,572\n|\n4.3 out of 5 stars 2,201\n|\n4.0 out of 5 stars 156\n|\n|\nScreen Sizes\n| 50\", 55\", 65\", 75\", 85\", 98\" | 55\", 65\", 75\", 85\", 98\", 115\" | 43\", 50\", 55\", 65\", 75\", 85\" | 43\", 50\", 55\", 65\", 75\", 85\", | 55\", 65\", 75\", 85\" |\n|\nTV Category\n| QD-Mini LED (144Hz) | QD-Mini LED (144Hz) | 4K UHD | QLED | Lifestyle TV |\n|\nTCL Halo Control System\n| ✔ | ✔ | ✘ | ✘ | ✘ |\n|\nHigh Contrast HVA Panel\n| ✔ | ✔ | ✔ | ✔ | ✔ |\n|\nFull Array Local Dimming\n| Up to LD500 Precise Dimming | Up to LD2800 Precise Dimming | - | - | - |\n|\nHDR Peak Brightness\n| High HDR Brightness | Up to HDR 3000 | High Brightness | High Brightness+ | High Brightness+ |\n|\nNative Panel Refresh Rate\n| 144Hz | 144Hz | 60Hz | 60Hz (85\"/98\" 144Hz) | 144Hz |\n|\nTCL AiPQ Processor\n| ✔ | ✔ | ✘ | ✘ | ✔ |\n|\nHDR: HDR10 & HLG\n| ✔ | ✔ | ✔ | ✔ | ✔ |\n|\nDolby Vision & HDR10+\n| ✔ | ✔ | ✔ | ✔ | ✔ |\n|\nGame Accelerator (Up To VRR)\n| 288 (50\" / 55\" 240) | 288 (55\" / 115\" 240) | 120 | 120 (85\"/98\" 240) | 240 |\n|\nSmart TV OS\n| Google TV | Google TV | Google TV | Google TV | Google TV |\nCustomer reviews\nCustomer Reviews, including Product Star Ratings help customers to learn more about the product and decide whether it is the right product for them.\nTo calculate the overall star rating and percentage breakdown by star, we don’t use a simple average. Instead, our system considers things like how recent a review is and if the reviewer bought the item on Amazon. It also analyzed reviews to verify trustworthiness.\nLearn more how customers reviews work on AmazonCustomers say\nCustomers praise the TV's picture quality, highlighting its vibrant colors and excellent contrast, while also appreciating its brightness with almost perfect blacks. They find it easy to set up and use, with fantastic sound quality featuring built-in subwoofers, and one customer notes its native 144Hz refresh rate for gaming and sports. The TV receives positive feedback for its functionality and value for money.\nAI Generated from the text of customer reviews\nCustomers praise the TV's picture quality, noting its vibrant colors and excellent contrast, with one customer highlighting its smooth image presentation.\n\"...Great picture and super easy setup.\" Read more\n\"...I am totally blown away by the picture quality. Colors are beautiful and even the sound quality is good for a TV. Love this purchase.\" Read more\n\"...Right out of the box it's just stunning picture even the over the air antenna channels look amazing....\" Read more\n\"Clear picture. As with many televisions, the sound quality could be better. The set up of Google TV was easy. The colors could be brighter.\" Read more\nCustomers praise the TV's picture quality, with one mentioning it's perfect for gaming.\n\"Great TV ! Love the color and depth.\" Read more\n\"Great tv\" Read more\n\"I'll make this short. I've had this TV for about a week. It's the best TV I've ever owned, and I've had about five. HDTVs....\" Read more\n\"This is a great TV....\" Read more\nCustomers find the TV offers great value for money, with one customer specifically noting it's a bargain for its mini-led and 144hz features.\n\"...This unit hit a sweet spot with most of the latest features at a great price. Picture quality: Very good so far....\" Read more\n\"...had all the settings for gaming on my Xbox and this one does at a reasonable price. VRR, Dolby Vision, 120Hz, HDR etc. Super happy with my purchase.\" Read more\n\"...Worth the upgrade to your existing tv especially if it's just regular 4k LED or HD....\" Read more\n\"...Clear and color reproduction. Good sound (Onkyo speakers). At this price segment this is a very good choice. Works as advertised. Highly recommend it.\" Read more\nCustomers appreciate the TV's brightness, noting its almost perfect blacks, vibrant colors, and well-lit room performance, with one customer specifically mentioning its nice backlit remote.\n\"Super TV for the price. Picture is very clear, sharp and bright. Does everything that an expensive TV can do and more....\" Read more\n\"...The colors pop and with the local dimming zones the blacks are super black....\" Read more\n\"...noticeable improvement is the picture quality—brighter colors, deeper blacks, and incredible detail make every scene more immersive....\" Read more\n\"...The set up of Google TV was easy. The colors could be brighter.\" Read more\nCustomers find the TV easy to set up and use, with one customer noting that switching between apps is quick.\n\"This is the second TCL GOOGLE TV I have purchased. It is easy to set up and has a great picture....\" Read more\n\"The television has great picture quality and sound, and the setup was easy....\" Read more\n\"...The user experience is fantastic, from the easy setup to the intuitive interface. Definitely a great purchase—highly recommended!\" Read more\n\"Great picture. Easy setup and the sound is good, no need for a soundbar.\" Read more\nCustomers praise the TV's sound quality, particularly its built-in subwoofers, with one customer noting that it eliminates the need for a separate soundbar.\n\"The television has great picture quality and sound, and the setup was easy....\" Read more\n\"...The sound is fantastic, it has two speakers in the middle of the back of the TV, and a. Subwoofer built in....\" Read more\n\"...Disney + and Apple TV+ is just breathtaking on this set, even the sound is decent without a soundbar though not amazing....\" Read more\n\"...Tv works great and has very easy setup . Sound quality for a tv is fine but I use a sound system on all of my TVs as I’m hard of hearing ....\" Read more\nCustomers appreciate the TV's fast performance, noting no lag time and quick app switching, with one customer highlighting its native 144Hz refresh rate for gaming and sports.\n\"Fast start up and navigation.\" Read more\n\"...The refresh rate ensures ultra-smooth motion with no lag, which is perfect for fast-paced action scenes and gaming....\" Read more\n\"...Great picture for the price. Only downside we noticed was a lag at start up that our previous tv didn’t have. We suspect that’s chip based....\" Read more\n\"...contrast, great black levels, nice backlit remote with responsive Google TV interface....\" Read more\nCustomers find that the TV functions well, with one mentioning it works perfectly with their Google home setup.\n\"...doesn't feel super premium as it is light but it is backlit and functions very well)....\" Read more\n\"Remote control while mini Plastic is very easy to use . Tv works great and has very easy setup ....\" Read more\n\"Tve works and looks great! Took me a bit to get it working with my Xbox. Ended up buying an 8k hdmi cable with 120hz to get it working properly....\" Read more\n\"...At this price segment this is a very good choice. Works as advertised. Highly recommend it.\" Read more\nReviews with images\nVery good tv for now and delivery was amazingly perfect!!!!!!!!!!\nTop reviews from the United States\nThere was a problem filtering reviews. Please reload the page.\n- Reviewed in the United States on July 16, 2025Size: 55 inchesVerified PurchaseI'll make this short. I've had this TV for about a week. It's the best TV I've ever owned, and I've had about five. HDTVs. Out of the box the picture's great. I only tweaked a couple settings based on my preferences, and that's all I did. The sound is fantastic, it has two speakers in the middle of the back of the TV, and a. Subwoofer built in. The controls are very easy and makes sense. All in all, I would highly recommend this TV and you won't be disappointed.\n- Reviewed in the United States on July 6, 2025Size: 65 inchesVerified PurchaseAmazing contrast, great black levels, nice backlit remote with responsive Google TV interface.\nDolby Vision content streaming from Disney + and Apple TV+ is just breathtaking on this set, even the sound is decent without a soundbar though not amazing.\nThough I understand this isn't the brightest set, for me it is plenty bright and I usually have the brightness set to 65% for my not super bright bedroom. Apart from off axis color fade I think this set is nearly perfect. When viewing close to center I think looks as good as any OLED I've seen.\nHaving owned 2 older 1080p Plasma TVs and 5 other older 4K LCD TVs from LG and Samsung, this thing is just so much better with any content that has dark sections (even just letterbox video I always saw some light bleed even on my most recent Samsung 4K Frame TV - also visible banding from LED backlight that bothered me on the Samsung with very dark content is completely eliminated on this set).\nI really like the remote (it doesn't feel super premium as it is light but it is backlit and functions very well). The TV itself is quite thin and light (though a proper OLED costing 2-3 as much does look much cooler from the side with the thin glass panel) though I found mount points on this set to be much lower than average so needed custom bracket work to mount to my motorized TV lift.\nThe sound can go from so-so to excellent depending upon the settings and mode.\nOverall I am super impressed with this TV even more than expected from several glowing youtube reviews.\nA slight upgrade to sound system and having that beautiful OLED panel thinness (and off angle viewing) are about the only things I miss here, but for the price this set is by far the best TV I've considered purchasing.\n- Reviewed in the United States on July 30, 2025Size: 65 inchesVerified PurchaseAfter my 55\" 5 year old Hisense Android TV crapped-out on me, I went with the 65\" version of this TCL. I mostly use it with my Xbox Series X and wanted something that could run games at 120fps in 4k. This TV excels at this - hits every codec in the Series X setting list.\nThe picture quality is great. The contrast between bright and dark is amazing. I don't know what kind of voodoo magic they're using on the HDR, but keep it up. Sound out of the default speakers is surprisingly crisp and clear.\nI've only tinkered with Google TV a little but have no complaints about their app selection. Setup of this device was quick - completed mostly through my phone. Ability to import account settings directly from my phone made the experience more intuitive, saved on the aggravation of having to reset 45788745654567 different forgotten passwords.\nThis has got to be one of the better mid-tier TVs out there. Nothing I'd change.\n- Reviewed in the United States on July 16, 2025Size: 65 inchesVerified PurchaseI've never had a tv this good at this price. Right out of the box it's just stunning picture even the over the air antenna channels look amazing. I do have a dolby atmos receiver, so to be fair I used only the built in speakers and subwoofer. The sound is a big upgrade from my Vizio V-series 4k. The QLED/Mini LED produces a stunning picture great clarity and color. It was so intense I had to make a few minor adjustments to match our viewing preferences and still enjoy the higher quality picture.I would highly recommend this tv. It has a lot of the higher end features, is a 2025 model that debuted at CES in January. Worth the upgrade to your existing tv especially if it's just regular 4k LED or HD. The built in speakers act like a soundbar adding value with out the need to purchase one. If like me you already have a sound system it's going to integrate easily and deliver stunning sound. One other thing very appreciated is Amazon includes deluxe delivery and basic unboxing setup. Wall mounting would be extra. I watched a review on YouTube from a very reliable and respected Caleb Denison and he was right \"Just Get it\" lol, I did.\n- Reviewed in the United States on July 18, 2025Size: 65 inchesVerified PurchaseRemote control while mini\nPlastic is very easy to use . Tv works great and has very easy setup . Sound quality for a tv is fine but I use a sound system on all of my TVs as I’m hard of hearing . I see no real lag in it while loading the apps . Plenty of free channels and apps to choose from . This tv is replacing an lg and it has a far superior picture and operating system .\n- Reviewed in the United States on July 14, 2025Size: 65 inchesVerified PurchaseOn the bottom of the screen is a little plastic piece that is snapped on, this is where your power button is located, as well as an indicator light. Your tv remote also is reliant on this piece being installed correctly. Mine was not. That little piece was completely loose, barely snapped on. there was a faulty wire connection from what I can guess. If i pushed on the box into the perfect position, the indicator LED light would come on and I would be able to use the remote. so it works? barely. if i walk up to it and fiddle with the little plastic piece for a bit and hold it steady, sure i can turn it on. once i had it on, wifi would not connect or populate any signals, and bluetooth would also not turn on. Its absolutely worthless.\nIts a shame, I've heard lots of great reviews on this particular model and this is my first TCL experience. most likely the last.\nnow I get to have the pleasure of re-boxing it. and waiting around all day for a driver to come pick it up! :)\nI also purchased on prime day sale, so that was nice, but now that I will be returning it, im losing out on getting a decent deal on something else. way to go TCL, you really know how to make a first impression. To be honest, I just probably wont purchase another TV off Amazon going forward just to be safe.\nImportant information\nEnergy consumption\n600.0 kWh per year, based on the power consumption of the television operating 4 hours per day for 365 days. The actual energy consumption will depend on how the television is used.\nVisible screen diagonal\n75\" / 191 cm"
    },
    {
      "url": "https://www.amazon.com/dp/B0CVS18PH9/th=1?tag=cnet-buy-button-20",
      "text": "| Brand Name | LG |\n|---|---|\n| Item Weight | 40.8 pounds |\n| Product Dimensions | 9.1 x 56.73 x 34.65 inches |\n| Item model number | E1LGOLED65C4PUARB |\n| Batteries | 2 AA batteries required. (included) |\n| Color Name | Black |\n| Special Features | Amd freesync, Built-In Speaker, Flat, Game Mode, Nvidia G Sync |\n| Speaker Type | 2.2 Channel |\n| Item Weight | 40.79 Pounds |\n| Standing screen display size | 65 Inches |\n| Aspect Ratio | 16:9 |\nLearn more\nNo featured offers available\nWe feature offers with an Add to Cart button when an offer meets our high standards for:\n- Quality Price,\n- Reliable delivery option, and\n- Seller who offers good customer service\n- 7 VIDEOS\nImage Unavailable\nColor:\n-\n-\n-\n- To view this video download Flash Player\nLG 65-Inch Class OLED evo C4 Series Smart TV 4K Processor Flat Screen with Magic Remote AI-Powered with Alexa Built-in (OLED65C4PUA, 2024)\nOur specialist Customer Support for large items dispatched from Amazon is on hand to help with your order. Contact us via phone or chat 7 days a week.\nAlexa Built-in\nThis smart TV has been certified by Amazon. Select Alexa Built-in smart TVs are Push-to-Talk and require pressing and holding the button on your remote to talk to Alexa, while other smart TVs have hands-free available with Alexa. Please see product details.\n| Screen Size | 65 Inches |\n| Brand | LG |\n| Display Technology | OLED |\n| Resolution | 4K |\n| Refresh Rate | 144 Hz |\n| Special Feature | Amd freesync, Built-In Speaker, Flat, Game Mode, Nvidia G Sync |\n| Included Components | E-Manual: Yes, Power Cable: Yes (attached), Quick Start Guide: Yes, Remote Control Battery: Yes (AA x 2EA), Remote: Magic Remote MR24 See more |\n| Connectivity Technology | Bluetooth, Ethernet, HDMI, USB, Wi-Fi |\n| Aspect Ratio | 16:9 |\n| Product Dimensions | 9.1\"D x 56.73\"W x 34.65\"H |\nAbout this item\n- SELF-LIT PIXELS: LG's signature OLED technology creates an incredible watching experience and stellar picture quality illuminated with over 8 million self-lit pixels. Take in rich and accurate colors from the brightest to darkest parts of the scene thanks to 100% Color Volume* and with 100% Color Fidelity.\n- BRIGHTNESS BOOSTER: Our Brightness Boosting technology magnifies each individual pixel for luminous quality that shines with every detail.\n- DOLBY VISION, FILMMAKER AND DOLBY ATMOS: Experience the magic of the big screen right from your couch. Every LG OLED comes loaded with Dolby Vision for extraordinary color, contrast and brightness, plus Dolby Atmos* for sound you can feel all around you. Land in the center of the action with FILMMAKER MODE, allowing you to see films just as the director intended.\n- a9 AI PROCESSOR GEN7: The C4's exclusive processor is the brains behind a truly unforgettable TV experience. You'll get smooth, vivid picture no matter what you watch with AI Super Upscaling which automatically enhances picture quality whether you're watching sports, movies, or a late-night favorite. Multi View with 2 screens lets you split your screen into 2 unique views so you can watch even more than before, everything looks and sounds incredible on a LG OLED TV.\n- 144 HZ REFRESH RATE: Enjoy crisp, smooth visuals with a 0.1ms response time and up to 144Hz refresh rate. LG OLED TVs feature NVIDIA G-Sync, AMD FreeSync Premium, and VRR for enhanced gaming quality. With four HDMI 2.1 inputs, connect all your devices effortlessly. The LG Game Dashboard and Game Optimizer provide complete control whether you game on consoles or in the cloud.\n- webOS RE:NEW PROGRAM: Enjoy new software updates and feature refreshes for 5 years with webOS Re:New Program.\nSimilar items in new arrivals\nImportant information\nOn-mode power consumption\n145.3 watts\nVisible screen diagonal\n65\" / 166 cm\nEnergy consumption\n269 Kilowatt Hours Per Year per year, based on the power consumption of the television operating 4 hours per day for 365 days. The actual energy consumption will depend on how the television is used.\nTop Brand: LG\nWhat's in the box\nProduct information\nTechnical Details\nAdditional Information\n| ASIN | B0CVS18PH9 |\n|---|---|\n| Customer Reviews |\n4.5 out of 5 stars |\n| Best Sellers Rank |\n|\n| Date First Available | March 11, 2024 |\nWarranty & Support\nFeedback\nProduct Description\nA new height of stunning picture for a new level of wow\nThe advanced LG OLED evo C4-Series is better than ever. The LG OLED evo C4 is powered by the next-gen α9 Gen7 AI Processor —exclusively made for LG OLED—for ultra-realistic picture and sound along with boosted brightness for luminosity and high contrast, even in well-lit rooms.* AI-assisted deep learning analyzes what you're watching to choose the best picture and sound setting for your content. The C4's almost invisible bezel, ensures it blends with your surroundings. When you're finished watching, display art, photos and other content make the C4 a versatile statement piece. Search less and stream more, thanks to the next generation of AI technology from LG webOS 24. Every LG OLED comes loaded with Dolby Vision for extraordinary color, contrast and brightness, plus Dolby Atmos®** for sound you can feel all around you. And FILMMAKER MODE allows you to see films just as the director intended. Packed with gaming features, the LG OLED evo C-Series comes with everything you need to win like a 0.1ms response time, native 120Hz refresh rate and four HDMI 2.1 inputs.\n*Based on LG internal testing: 55/65/77/83” LG OLED evo C4 models are brighter than OLED B4 models.**Dolby, Dolby Vision, Dolby Atmos, and the double-D symbol are registered trademarks of Dolby Laboratories Licensing Corporation. Manufactured under license from Dolby Laboratories. Confidential unpublished works. Copyright 2012–2024 Dolby Laboratories. All rights reserved.\nFrom the brand\nFrom the manufacturer\nGET IT TODAY\nBolder picture, bigger thrills\nExperience picture at its best with a stunning 2024 OLED TV— featuring 8.3 million self-lit pixels for darker blacks and richer color, with screen sizes ranging from 42” to a captivating 97”.\n-\nLevel up with OLED power\nEnjoy tear-free gaming with a 0.1ms response time and up to 144HZ refresh rate. Plus, NVIDIA G-Sync and AMD FreeSync technology make it easier than ever to dominate the competition.\n-\nBring home the magic of the big screen\nLoaded with Dolby Vision picture and Dolby Atmos sound, get the full cinema experience without leaving home.\n-\nA new era of OLED\nMake every detail shine with signature OLED technology. Enhanced brightness and over 8 million self-lit pixels mean you can watch from any room without missing a thing.\n-\nA world of content awaits\nIt’s easier than ever to search for content with new webOS 24— plus enjoy over 300 free LG channels for sports, fitness, cooking and more.\nDESIGN\nMade to match your style\nOur 2024 OLED TVs blend in seamlessly with your space, featuring nearly invisible bezels and easy-to-install no-gap designs.\n-\nα9 AI PROCESSOR\nPicture that adapts\nEnjoy smooth, vivid picture with AI Super Upscaling. Multi View splits screen for enhanced viewing.\n-\nBUILT-IN VOICE SUPPORT\nJust say the word\nControl your TV and connected devices via Amazon Alexa, Apple AirPlay 2, Google Assistant and more.\n-\nVOICE ASSIST\nJust Talk\nFar-field microphone capabilities let you operate your TV with just the sound of your voice.\n-\nGALLERY MODE\nTV or a work of art\nNot watching? Display paintings, photos and more as your OLED transforms from TV to a gallery.\nCustomer reviews\nCustomer Reviews, including Product Star Ratings help customers to learn more about the product and decide whether it is the right product for them.\nTo calculate the overall star rating and percentage breakdown by star, we don’t use a simple average. Instead, our system considers things like how recent a review is and if the reviewer bought the item on Amazon. It also analyzed reviews to verify trustworthiness.\nLearn more how customers reviews work on AmazonCustomers say\nCustomers praise the TV's picture quality, noting its crystal clear display and perfect contrast, while also appreciating its brightness and built-in speakers. The TV is easy to set up and offers good value for money, with one customer noting it's better than the movie theater experience. The functionality and ease of use receive mixed feedback - while the apps work perfectly and the interface is easy to use, some customers report issues with the TV not turning on.\nAI Generated from the text of customer reviews\nCustomers praise the TV's picture quality, noting its super clear display and perfect contrast, with games appearing amazing. One customer mentions that the picture quality is consistent from any viewing angle.\n\"Great picture. I got it to play video games on. Fast enough input and refresh. LG menu and setup could be better....\" Read more\n\"Nice TV with great picture and sound....\" Read more\n\"...Beautiful picture but just okay sound but that is okay as I use it with a soundbar....\" Read more\n\"TV is bright and beautiful and sound is good enough that I don't feel I need a sound bar....\" Read more\nCustomers praise the TV's quality, particularly noting its suitability for living room gaming, and one customer mentions it performs better than movie theaters.\n\"Great TV…I wanted this OLED model and LG has the longest experience with OLED....\" Read more\n\"Good price. Great tv.\" Read more\n\"...Still a great value and great tv. Value for money: Great deal on prime day....\" Read more\n\"Best TV I have ever owned. Sleek, beautiful and looks great in my den.\" Read more\nCustomers like the TV's sound quality, particularly its decent built-in speakers, with one customer noting that it performs well even without additional sound equipment.\n\"Nice TV with great picture and sound....\" Read more\n\"...the most sophisticated engineering producing the best picture and sound quality I have ever owned....\" Read more\n\"Very nice TV. Excellent sound and picture\" Read more\n\"...well lg speakers must be alittle bit of an exception because I get good sound on this not to say I wouldn’t get a nice soundbar though\" Read more\nCustomers find the TV easy to set up and connect.\n\"Best TV I've ever had. Crystal clear picture, easy to set up, and easy to navigate.\" Read more\n\"...Item was received in good condition and promptly. Easy to set up. Great picture and sound.\" Read more\n\"...Excellent broadcast features. No manuals included, need to go online or within the TV to read how to get the best of this TV. Enjoy, we are.\" Read more\n\"...Easy setup, intuitive remote control with unique tracking feature....\" Read more\nCustomers find the TV to be a great value for the money and consider it a good investment.\n\"...No glare view from any angle. Great price Very pleased with LG and this TV is spectacular...\" Read more\n\"This is a very expensive television and it is worth every penny. I am very pleased with my purchase.\" Read more\n\"about as good as it gets, at this price point. I prefer this brand over the others every single time, these actually work.\" Read more\n\"...Overall I feel it is a good value and great quality both in construction and how the picture looks, but the few things that should be nice...\" Read more\nCustomers praise the TV's brightness, noting it performs exceptionally well in dark rooms, with one customer highlighting its self-lit OLED pixels.\n\"...And I love it! The LG OLED C4 42”. The picture is so sharp and bright, the action looks live! And the sound is amazing!...\" Read more\n\"...The first was a the B3 (I think). This one is brighter and truly an amazing TV. Hands down the best that Ive owned....\" Read more\n\"...office task like word or and semi static content it would aggressively dim the screen and the only way to get it to return was to cause a full...\" Read more\n\"...Amazing color, contrast, and brightness....\" Read more\nCustomers have mixed experiences with the TV's functionality, with some reporting that it works great and all apps function perfectly, while others mention that it stops working or won't turn on at all.\n\"...gloss mirror like finish as well as textured finish on back; has 4 HDMI ports; has infinite contrast; has great motion for everything including...\" Read more\n\"...Although I have to say the Sling app in the tv works ok. It buffers a lot, but ok on the other apps....\" Read more\n\"Works great and I read a lot about people not liking the remote bc of the cursor. It’s not as bad as everyone make its out to be....\" Read more\n\"...] This LG OLED had an amazing picture — until it suddenly stopped working about a month after delivery....\" Read more\nCustomers have mixed opinions about the TV's ease of use, with some finding the interface easy to use and intuitive, while others describe it as difficult to navigate.\n\"...as I prefer my Apple TV and PS5 interfaces but it is functional and easy to use when I need it....\" Read more\n\"...Also, the remote controller is really bulky. It has many unnecessary shortcut buttons.\" Read more\n\"Best TV I've ever had. Crystal clear picture, easy to set up, and easy to navigate.\" Read more\n\"...the operating system is pretty user-friendly and responsive....\" Read more\nReviews with images\nGreat as a 42\" PC monitor\nTop reviews from the United States\nThere was a problem filtering reviews. Please reload the page.\n- Reviewed in the United States on June 29, 2025Size: 42 InchStyle: TV OnlyVerified PurchaseI've been wanting a C series for a long time and finally got one. Mac Mini M4 Pro using a Highwings HDMI cable (ASIN B08M9HND4F). Picture quality is fantastic. Whites are white. Blacks are black. So much cleaner than my LG IPS display from 2020. Build quality appears to be great except I would have liked hex screw heads for the feet instead of the normal Phillips or JIS style. With the recent price drop I think this is a fantastic purchase.\nFor functionality, WebOS, in my opinion is slow. Even basic settings takes a few seconds for the menu to come up. You are presented with various terms and agreements that you have to agree to. I've only agreed to two of them and so far there hasn't been any more nags. Unfortunately, I find the agreement terms to be less than desirable but I'm still keeping the tv.\nWebOS has your standard streaming service apps built in. Plex works well. Youtube works well. I haven't tried the other apps but I assume they function just as well. Sound quality is good. Nothing fancy. If sound is important and you won't be using headphones then grab a soundbar. HDMI audio does pass through from the Mac so that works.\nBad part.. The Mac Mini M4 does not support HiDPI so those 4k resolutions are okay for graphics but text is not going to look good. I'm running it at 2560x1440 which is what I've been used to and have no is sues with blury text. I've also installed Better Display to help with quick tweaks for brightness and resolution if I want to do any quick changes. Overall I'm pretty happy with this purchase and would recommend the LG C4 and absolutely if you can find one on sale!\n- Reviewed in the United States on July 13, 2025Size: 77 InchStyle: TV OnlyVerified PurchaseBefore going too far, this TV is amazing and you can't go wrong getting it. Thats's just the first impressions since it's only been a few days. I've always kept an eye on an LG C-series, along with G and the lesser B. The C5 is now out, so C4's are dropping in price. Compared to other options, it was finally time. I missed out on what was likely a price mistake months ago where the 77\" appeared for the price of the 55\". The price updated before purchase could be completed.\nThe TV is large, but not all that heavy with the very thin panel on it. I can say I was unsure how to handle during setup it since it's so large and thin. I managed to get it out of the packaging, attach the stand and set it on it's new home by myself. The stand looks like it should require one more screw, but picture instructions didn't say so. There are two holes in the bottom and three in the back to attach the upright portion that then attaches to the TV, but only 4 screws for the job, two below and two in the back, then 4 others to attach the panel to the stand.\nInitial setup was pretty simple, and settings can always be revisited to make any changes. The picture requires a minor amount of adjustment for my liking. I hate true motion, so that's always the first to go along with most extra processing. Reds were heavily saturated, but easy enough to correct. There's options I may never get through, but they're there. The picture settings can change automatically by detected content, so may need adjustments again for each content type. I have experienced some issue with ARC staying connected with my receiver, but that may be on my hardware, not the TV. Cutting power to everything solves it for a time, usually. It is currently my biggest annoyance, but I'm still getting acquainted with the TV.\nThe picture, the star of the show, it's what you buy this quality TV for and it delivers. The first time the screen went black during a cut scene, I wasn't sure if the TV was still on. Those typical demo videos on screen in the store that are elusive at home are not so with this set. Watching test videos from YouTube with high resolution and frame rate looked incredible. It really lights up a room with it's brightness not even at full power. It's a centerpiece of the room for sure.\nI'm sure I'll revisit this review in time, but for now, I'm loving this TV and glad we finally got one. Our last new TV is 15 years old, also an LG and has always looked great. I have high hopes for this one too.\n- Reviewed in the United States on March 5, 2025Size: 65 InchesStyle: TV OnlyVerified PurchaseI bought this TV on somewhat of a whim during Black Friday sales. We knew we wanted a new TV and had zeroed in on this model from browsing at Best Buy because the picture quality and color looked very nice. We've been very pleased with it in the several months since. The picture quality is great. We use a soundbar so I can't speak much to sound quality, but when we initially didn't have the soundbar configured the built-in speakers seemed adequate. While it was quite cumbersome to get through all the screens of initial setup before we could actually watch something (including multiple agreements that are required to enable certain features), the operating system is pretty user-friendly and responsive. The list of apps on the home screen is almost fully customizable; there are a couple native apps that can't be removed. The TV responds pretty quickly to the remote or to an Alexa command to turn on or off. The main disappointments I have with the TV relate to other aspects of Alexa integration. When I request for the show I'm watching to be paused/stopped/played it either doesn't respond at all or the response takes 30+ seconds. The TV can also act as an Alexa device and field commands including by using an Alexa button on the remote, but this often triggers by accident and opens the Alexa screen when I'm in the middle of watching something, to the point that I want to disable this function. Lastly, I'm disappointed that the dual-screen functionality is almost worthless. There are extremely limited apps you can select to use in this mode. You can see I have quite a few apps installed on the home page, but the only things available for dual-screen are Web Browser, Camera, Live TV, and YouTube. Overall I feel it is a good value and great quality both in construction and how the picture looks, but the few things that should be nice convenience features are lacking.\n5.0 out of 5 starsI bought this TV on somewhat of a whim during Black Friday sales. We knew we wanted a new TV and had zeroed in on this model from browsing at Best Buy because the picture quality and color looked very nice. We've been very pleased with it in the several months since. The picture quality is great. We use a soundbar so I can't speak much to sound quality, but when we initially didn't have the soundbar configured the built-in speakers seemed adequate. While it was quite cumbersome to get through all the screens of initial setup before we could actually watch something (including multiple agreements that are required to enable certain features), the operating system is pretty user-friendly and responsive. The list of apps on the home screen is almost fully customizable; there are a couple native apps that can't be removed. The TV responds pretty quickly to the remote or to an Alexa command to turn on or off. The main disappointments I have with the TV relate to other aspects of Alexa integration. When I request for the show I'm watching to be paused/stopped/played it either doesn't respond at all or the response takes 30+ seconds. The TV can also act as an Alexa device and field commands including by using an Alexa button on the remote, but this often triggers by accident and opens the Alexa screen when I'm in the middle of watching something, to the point that I want to disable this function. Lastly, I'm disappointed that the dual-screen functionality is almost worthless. There are extremely limited apps you can select to use in this mode. You can see I have quite a few apps installed on the home page, but the only things available for dual-screen are Web Browser, Camera, Live TV, and YouTube. Overall I feel it is a good value and great quality both in construction and how the picture looks, but the few things that should be nice convenience features are lacking.Very nice quality TV and operating system with a couple underwhelming features\nReviewed in the United States on March 5, 2025\nImages in this review"
    },
    {
      "url": "https://www.cnet.com/tech/home-entertainment/lg-c5-oled-tv-review-great-picture-now-wait-for-the-price-drop/",
      "text": "Pros\n- Excellent overall image quality\n- Great for gaming\n- High levels of contrast in bright rooms\nCons\n- Very similar to the C4\n- Remote is harder to use than before\n- AI Assistant is not compelling\nThe LG C5 OLED TV may be the highly anticipated follow-up to last year's excellent C4, but perhaps the company was too distracted by AI to make a big deal of it at CES. The TV didn't receive the splashy press debut accorded to its big brother, the G5; instead, it was hidden away at the company's private, invite-only booth in Las Vegas.\nThat's a shame because the C5 is thrilling to high-end TV buyers in its own way, with the deep contrast expected of OLED and the bright, saturated colors demanded of today's movies and video games. But this does pose the question: Is the C5 better than the C4? Regarding the numbers I tested at our New York City lab, I can point to the differences on a chart. Yet, in my comparisons of four different OLED TVs, including last year's Samsung S95D and the LG G5, I found they all looked very similar -- and all superb. The new G5 was capable of one thing: getting a lot brighter, which I found made the most difference with gaming. It's up to you if paying around $600 extra for the G5 over the C5 is worthwhile to you.\nNevertheless, the LG C5 is a great way to watch your favorite movies, play video games or follow your favorite sports team. That said, if you're in the market to buy a TV now, it's worth looking at last year's TV. There's very little to separate these two models, aside from the $1,000-plus difference in price in favor of the C4.\nEditor's note, July 18: The score has changed from 8.7 to 8.5 following a review of, and comparison with, the Samsung S90F TV, but the rest is as was originally published in April 2025.\nAlso read: Best TVs of 2025\nLG C5 OLED TV sizes and series comparison\nI performed a hands-on evaluation of the 65-inch LG C5, but this review also applies to the other screen sizes in the series. All sizes have very similar specs and should provide very similar picture quality.\n- LG OLED83C5PUA (83-inch)\n- LG OLED77C5PUA (77-inch)\n- LG OLED65C5PUA (65-inch)\n- LG OLED55C5PUA (55-inch)\n- LG OLED48C5PUA (48-inch)\n- LG OLED42C5PUA (42-inch)\nGet thin, OLED\nUnlike the G5, which is much chunkier front-to-back, the C5 panel is quite thin at 0.25-inch, with a textured back that resembles black marble. Like last year's TV, the panel is attached to a much thicker base containing the inputs, circuit boards and such. The overall design aesthetic is \"loft apartment chic,\" but remember that when that TV is wall-mounted or placed on a unit, you'll never see more than the front of the screen itself.\nThe biggest change this year is the remote control -- that huge, fluted wand has been replaced by a more traditional bar. You might be saying, \"Goodbye, hyperactive moth cursor,\" but no, the Magic Remote capability is still there. And as described below, some of the remote redesigns aren't exactly magical.\nGet smart, AI TV\nThe TV uses LG's WebOS for streaming and navigation, which I found straightforward, with all of the popular streaming services made available. Like most TVs today, the LG C5 has a gallery mode that also includes the ability to create your own AI art or upload a photo gallery.\nThe company is all-in on \"Affectionate Intelligence\" and one of the biggest machine-y features this year is the AI Concierge. The concierge purports to do everything AI because, of course, it does, but it could end up being as useful as ordering pizza from a DVD player.\nOne thing it claims to do is learn your viewing history so it can suggest programs you might like. Yet, every streaming service does this natively already, so what would be more useful is tracking all the shows I am currently watching so I can go back to them easily, as Google TV can.\nI tested the AI feature of the LG C5, and it can currently tell you the time or the weather, take you to an app that plays the show you want, or do limited web searches. Like any assistant it's a little finicky; for example, a search for Severance took me to a 2007 horror movie, while saying \"Play Severance\" brought up the Apple TV show first.\nLastly, most of the C5's TV setup routines are typically tedious, just a series of click-through screens. However, I did find the C5 (and G5) unintentionally amusing. The TV has its screen reader turned on by default, which is usually helpful for the vision impaired, but the robotic voice speaks too fast to be intelligible. Instead, it sounds like it's reciting side effects in a pharmaceutical commercial. \"Do-not-use-the-Magic-Remote-if-you-are-allergic-to-the-Magic-Remote!\"\nDolby Vision, check\nThe OLED panel features the company's Brightness Boosting tech and has been UL-certified as \"Glare-Free,\" for what it's worth. The C5 comes with a 120Hz native refresh rate for smoother motion and Dolby Vision and HDR 10 for more vivid gaming and movie-watching.\n- 120Hz Native (VRR 144Hz)\n- Four HDMI inputs with HDMI 2.1, HDCP 2.2\n- Three USB 2.0 ports\n- Optical digital audio output\n- RF (antenna) input\n- RS-232 port (minijack, for service only)\n- Ethernet (LAN) port\nWhile LG was one of the first adopters of the NextGen TV (ATSC 3.0) standard, the company has not included tuners in its TVs since 2023.\nWith that new remote, which is all decked out in AI livery, there comes a new challenge. There is no longer any obvious way to change inputs. If you use your TV as a switch, which many high-end users do, this becomes more tedious. I used the THINQ button and the input shortcut there. But a dedicated input button on the remote would cut the time to change inputs by at least a third. You need to hold down the Home Hub button to access inputs.\nTrying to mute the TV is also a challenge, as you have to hold the volume button down for a few seconds. Through a quirk in my setup routine, the TV didn't register the cursor, so it then became a \"normal\" remote. Don't ask me how I did that -- I can't say. Though I did try to replicate it and failed, the experience was better.\nHigh-end OLED (and mini-LED) comparison: LG C5 vs. LG C5 vs. Samsung S95D vs. LG C4 vs. TCL QM850\nTV and movies\nWhile LCD and its derivatives keep getting brighter and brighter every year, gains in OLED's brightness have been less dramatic. While the more expensive G5 is noticeably brighter than the G4, the C5 is just a little better than the model before it. That said, most content is not designed to be eye-searingly bright; this may not even translate to differences when you're watching streaming content. During movies from Netflix and Fandango, and when set to their respective Filmmaker modes, the LG C4, LG C5, LG G5 and Samsung S95D all behaved very similarly. I also compared the TVs against a TCL mini-LED (in Imax mode); it was the only one that demonstrated significant differences.\nRead More: How We Test TVs\nThe opening scene of It Part One is a great test of a TV's capabilities with its high-contrast images, and I was a little surprised to see the four OLEDs perform at a similar level despite their price differences. As Georgie starts to descend the stairs into the basement, you see an area of wall next to the railing with some low-level shadow detail. The C4, C5 and TCL shadows looked a little more detailed than with the G5 and Samsung, but it was only by a smidgen -- I had to look really hard. In the intercut shots of his brother, Bill, the view through the windows looked much brighter and more blue on the TCL than the OLEDs. The drawbacks of LCD technology were also on display in the cellar, as there was a little bit of blue hazing in completely black areas of the screen. This is something that the OLEDs didn't do; the pixels were simply turned off and appeared black, as expected.\nAfter inconclusive results with the OLEDs and It, I tried two colorful and very dynamic movies, Spider-Man: Into the Spider-Verse and Mad Max: Fury Road. During Spider-Man, the colors and brightness of the OLEDs were very similar again -- even during the overwhelming Super Collider sequence at the 24-minute mark.\nMeanwhile, in Mad Max (4:48) there is a chase scene as the War Boys wrestle with Max in a water-filled room that is lit overhead. At the right of the screen, a blue flame briefly appears. It looks a little brighter in this red and green scene on the G5 versus the others. The C4 and C5 looked very similar.\nI next streamed The Avengers: Age of Ultron and saw the differences between the mini-LED TCL QM850 and the OLEDs. The opening scenes of the team assaulting a Hydra base look brighter than the OLEDs, though they're not as cinematic-looking. They're quite nice, though.\nI followed that up, then, with a 4K Blu-ray test disc from Spears and Munsil comprising mostly static footage and, apart from gaming, here is where the C5 and G5 showed the differences in performance. The C5 still looked very good, with deep contrast and plenty of color saturation, but the G5 showed where the extra $600 was going: brighter images and clearer, less-green snowy fields. Most movies don't look like test discs, but at least I could finally see a difference between the two.\nBright room\nLight output in nits\n| TV | Brightest mode (HDR) | Accurate mode (HDR) | Brightest mode (SDR) | Accurate mode (SDR) |\n|---|---|---|---|---|\n| LG G5 | 2,813 | 2,297 | 1,030 | 412 |\n| LG C5 | 1,434 | 1,187 | 480 | 288 |\n| TCL QM851 | 3,183 | 3,183 | 3,084 | 1,262 |\n| Hisense U8N | 3,175 | 3,175 | 3,168 | 1,112 |\n| Samsung S95D | 1,734 | 1,666 | 544 | 265 |\n| LG G4 | 1,799 | 1,420 | 792 | 792 |\n| LG C4 | 1,213 | 968 | 414 | 390 |\nThe C5 is a little brighter than last year's C4 -- and I measured a maximum brightness of 1,400 vs. 1,200 in Vivid mode. Yet what makes the C4 even better suited to use in a bright room is its improved screen coating. In a lit room I found that the C5 was better than the C4 at rejecting reflections, while the Samsung S95F was the best of the lot. The downside to the Samsung, in particular, is that, without the slightly shiny screen coating of the other TVs, the shade of black could look gray in direct light.\nGaming\nI played several different games on my four-TV setup, and it was here that the biggest differences between the G5, in particular, and the rest of the lineup appeared. While the C5 looked as good as the higher-end Samsung S95D during games, it didn't stand up to the G5. Pixel response times of the C5, as tested with the Leo Bodnar test units, were only average -- about 13ms. The best I've seen is around 9ms on TVs like the Samsung S95D or the Roku Pro Series. These discrepancies probably won't be noticeable during play, but I know that after playing FPS games on all four OLED screens, the tiny differences in response gave me motion sickness.\nUniformity and viewing angle\nI found that the C5's picture was not only uniform with both solid color and black or white but also stayed consistent when viewed off-axis. This is consistent with most OLED TVs, which don't have the image clouding or viewing angle problems of LCD screens.\nPicture settings and testing notes\nIn testing -- both in measurements and in the real world -- it became apparent that the C5 is slightly improved over the C4, mostly in terms of a little more brightness and better color accuracy. The test comes up as Poor when it comes to Gamma. This is because we use a 2.2 gamma as the basis of our test -- this 2.2 curve looks better in lit rooms and also gives better shadow detail in a cinema-like environment. Gamma 2.4 may be an industry standard -- which the C5 meets -- but in our tests, 2.2 gives a better experience.\nThe C5's measurable color is a little better than last year's, but only by a percentage point and was not really detectable by the eye. As before, Filmmaker mode proved to be the overall best picture mode on the C4. Cinema mode was a close second, but it enables some smoothing, which can create the often undesirable soap opera effect.\nLG C5 test measurements\n| Test | Result | Score |\n|---|---|---|\n| Black luminance (0%) | 0.000 | Good |\n| Peak white luminance (SDR) | 480 | Average |\n| Avg. gamma (10-100%) | 2.43 | Poor |\n| Avg. grayscale error (10-100%) | 1.06 | Good |\n| Dark gray error (30%) | 0.66 | Good |\n| Bright gray error (80%) | 1.31 | Good |\n| Avg. color checker error | 1.03 | Good |\n| Avg. saturation sweeps error | 1.00 | Good |\n| Avg. color error | 1.08 | Good |\n| 1080p/24 Cadence (IAL) | Pass | Good |\n| Input lag (Game mode) | 13.63 | Good |\n| HDR10 | ||\n| Black luminance (0%) | 0.000 | Good |\n| Peak white luminance (10% win) | 1434.00 | Good |\n| Gamut % UHDA/P3 (CIE 1976) | 99.3 | Good |\n| ColorMatch HDR error | 17.01 | Good |\n| Avg. color checker error | 1.64 | Good |\n| Input lag (Game mode, 4K HDR) | 13.00 | Good |\nPortrait Displays Calman calibration software was used in this review."
    },
    {
      "url": "https://www.amazon.com/dp/B0DYQF1Q3Z/ref=twister_B0FGDF5QTT?_encoding=UTF8&psc=1&tag=cnet-buy-button-20",
      "text": "| Brand Name | LG |\n|---|---|\n| Item Weight | 35.3 pounds |\n| Product Dimensions | 9.1 x 48.1 x 29.8 inches |\n| Item model number | OLED55C5PUA.AUSZ |\n| Batteries | 2 AAA batteries required. (included) |\n| Special Features | Amd freesync, Built-In Speaker, Google Cast built-in, Multiple Voice Assistance, Nvidia G Sync |\n| Item Weight | 35.3 Pounds |\n| Standing screen display size | 55 Inches |\n| Aspect Ratio | 16:9 |\n| Voltage | 120 Volts |\nLearn more\nNo featured offers available\nWe feature offers with an Add to Cart button when an offer meets our high standards for:\n- Quality Price,\n- Reliable delivery option, and\n- Seller who offers good customer service\n- 7 VIDEOS\nImage Unavailable\nColor:\n-\n-\n-\n- To view this video download Flash Player\nLG 55-Inch Class OLED evo AI 4K C5 Series Smart TV w/Dolby Atmos, Dolby Vision, HDR10, AI Super Upscaling 4K, Filmmaker Mode, Wow Orchestra, Alexa Built-in (OLED55C5PUA, 2025)\nOur specialist Customer Support for large items dispatched from Amazon is on hand to help with your order. Contact us via phone or chat 7 days a week.\n| Screen Size | 55 Inches |\n| Brand | LG |\n| Display Technology | OLED |\n| Resolution | 4K |\n| Refresh Rate | 120 Hz |\n| Special Feature | Amd freesync, Built-In Speaker, Google Cast built-in, Multiple Voice Assistance, Nvidia G Sync |\n| Included Components | Power Cable, Remote Control, Stand, User Manual |\n| Connectivity Technology | Bluetooth, Ethernet, HDMI, USB, Wi-Fi |\n| Aspect Ratio | 16:9 |\n| Product Dimensions | 9.1\"D x 48.1\"W x 29.8\"H |\nAbout this item\n- World's No.1 OLED: Celebrating 12 years of perfecting award-winning OLED TV technology.\n- Brightness Booster: Our Brightness Booster technology magnifies each individual pixel for luminous quality that shines with every detail.\n- Bright Room Ready: Verified by UL for Discomfort Glare Free (UGR less than 22), you can be confident your LG OLED TV performs great no matter the room or the lighting. With LG OLED you still experience perfect black that delivers stunning pictures other brands just can't match.\n- Alpha 9 AI Processor Gen8: This processor is the brains behind a truly unforgettable TV experience. You'll get personalized smooth, vivid pictures no matter what you watch. AI Super Upscaling technology automatically enhances picture quality whether you're watching sports, movies, or a late-night favorite. Everything looks and sounds incredible on a LG OLED TV.\n- Perfect Black & Perfect Color (8.3 million self-lit pixels: LG's flagship OLED technology creates an incredible watching experience and stellar picture quality with Perfect Black and Perfect Color technology on over 8.3 million self-lit smart pixels, even in bright rooms.\n- Dolby Vision, Dolby Atmos & FILMMAKER MODE: Experience the magic of the big screen right from your couch. Loaded with Dolby Vision for extraordinary color, contrast and brightness, plus Dolby Atmos* for sound you can feel all around you. Land in the center of the action with FILMMAKER MODE, allowing you to see films just as the director intended.\n- Ultimate Gaming: Packed with gaming features, this LG OLED evo Series comes with everything you need to win. Experience crisp, smooth imagery from a 0.1ms response time and up to 144Hz refresh rate** to let you game at blinding speed without any blurring or tearing to keep up with the fastest games. All LG OLED TVs have NVIDIA G-Sync, AMD FreeSync Premium and VRR to further improve gaming quality. Four HDMI 2.1 inputs allow you to plug in all the devices you need. Whether you game on consoles or on the cloud,* the LG Game Dashboard and Game Optimizer put all the control at your fingertips.\nProduct voltage: 120\nThis product is compatible with outlets that support 120 volts and might require a converter when used outside of the United States.\nSimilar items in new arrivals\nTop Brand: LG\nWhat's in the box\nFrom the manufacturer\n-\nWorld's No.1 OLED TV Brand\nCelebrating 12 years of perfecting award-winning OLED TV technology.¹\n-\nBright and beautiful\nOur Brightness Boosting technology magnifies each individual pixel for luminous quality that shines with every detail.\n-\nAlpha 9 AI Processor Gen8\nThis processor powers a truly unforgettable TV experience, delivering personalized, vivid picture with AI Super Upscaling² to enhance quality for sports, movies, or late-night favorites.\n-\nPerfect Black & Perfect Color\nOLED technology creates an incredible watching experience and stellar picture quality with perfect black and perfect color on over 8.3 million self-lit smart pixels, even in bright rooms.\n-\nBring home the magic of home cinema\nExperience the magic of the big screen at home with Dolby Vision for stunning color, contrast, and brightness, Dolby Atmos³ for immersive sound, and FILMMAKER MODE for films as the director intended.\nBright Room Ready\nVerified by UL for Discomfort Glare Free (UGR less than 22), you can be confident your LG OLED TV performs great no matter the room or the lighting. With LG OLED you still experience perfect black that delivers stunning picture other brands just can't match.\n-\nGame with the power of LG OLED\nBuilt for gaming with a 0.1ms response time, up to 144Hz refresh rate⁴, and no blurring or tearing. NVIDIA G-Sync, AMD FreeSync Premium, and VRR, and 4 HDMI 2.1 ports.\n-\nLG’s award-winning webOS Smart TV platform\nBrowse all your favorite streaming apps and let LG Channels connects you to over 300 free channels. Plus with LG’s Re:New Program enjoy new software updates and feature refreshes for up to 5 years.⁵\n-\nPersonalized Picture & Sound\nThe Personalized Picture & Sound Wizard uses AI technology to analyze your favorite images and sound clips to create a personalized picture and audio experiences tailored for you.\n-\nPersonalized search and recommendations\nLG AI makes watching easier by learning your preferences. Press the mic button, and AI Concierge suggests tips and recommendations tailored to your viewing habits and the app or source you're using.\n-\nTV Mirroring: Seamlessly Connect and Share\nWith Apple AirPlay 2 and Google Cast, stream content from your phone, tablet, or computer to your TV for a bigger, more immersive experience, perfect for videos, games, and photos.\n-\nReady assist with your connected devices\nControl your TV and connected devices with built-in support for ThinQ, Google Assistant, Amazon Alexa, Matter and Apple HomeKit.⁶\nProduct information\nTechnical Details\nAdditional Information\n| ASIN | B0DYQF1Q3Z |\n|---|---|\n| Customer Reviews |\n4.4 out of 5 stars |\n| Best Sellers Rank |\n|\n| Date First Available | March 10, 2025 |\nWarranty & Support\nFeedback\nProduct Description\nLG's Most Popular Selling OLED TV\nThe advanced LG OLED evo C5-Series is better than ever. The LG OLED evo C5 is powered by the next-gen Alpha 9 Gen8 AI Processor —exclusively made for LG OLED—for ultra-realistic picture and sound along with boosted brightness for luminosity and high contrast, even in well-lit rooms. AI-assisted deep learning analyzes what you're watching and uses your preferences to choose the best picture and sound setting for your content. The C5's almost invisible bezel, ensures it blends with your surroundings. When you're finished watching, display art, photos and other content make the C5 a versatile statement piece. Search less and stream more, thanks to the next generation of AI technology from LG webOS 25. Every LG OLED comes loaded with Dolby Vision for extraordinary color, contrast and brightness, plus Dolby Atmos for immersive sound you can feel all around you. FILMMAKER MODE allows you to see films just as the director intended. Packed with gaming features, the LG OLED evo C-Series comes with everything you need to win like a 0.1ms response time, native 120Hz refresh rate, with VRR up to 144hz for PC gaming and four HDMI 2.1 inputs.\n¹Source: Omdia. Unit shipments, 2013-2024. Results are not an endorsement of LG Electronics. Any reliance on these results is at the third-party’s own risk. ²Image quality of upscaled content will vary based on source resolution. ³Dolby, Dolby Vision, Dolby Atmos, and the double-D symbol are registered trademarks of Dolby Laboratories Licensing Corporation. Manufactured under license from Dolby Laboratories. Confidential unpublished works. Copyright 2012–2025 Dolby Laboratories. All rights reserved. ⁴PC with 144Hz graphic card required. ⁵Internet connection and subscriptions to streaming services are required; number of LG Channels subject to change. Software update will automatically download. Consumers who disable “auto-update” will receive a pop-up notification to accept or deny software update. ⁶Google is a trademark of Google LLC. Google Assistant is not available in certain languages and countries. Apple, the Apple logo and HomeKit are trademarks of Apple Inc., registered in the U.S. and other countries. ⁷Subscription and compatible gaming controller are required.\nCustomer reviews\nCustomer Reviews, including Product Star Ratings help customers to learn more about the product and decide whether it is the right product for them.\nTo calculate the overall star rating and percentage breakdown by star, we don’t use a simple average. Instead, our system considers things like how recent a review is and if the reviewer bought the item on Amazon. It also analyzed reviews to verify trustworthiness.\nLearn more how customers reviews work on AmazonCustomers say\nCustomers are impressed with the TV's picture quality, with one noting its natural outdoor scenes, and they find it relatively easy to set up. The sound quality is adequate, and while some customers say it's worth the price, others find it too bright and vivid. The remote control receives mixed feedback, with some finding it user-friendly while others consider the pointer a major annoyance. Customers report mixed experiences with lag, with some noting no lag while others find it slow.\nAI Generated from the text of customer reviews\nCustomers are impressed with the TV's picture quality, particularly its colors, with one customer noting how facial features are beautifully rendered and how outdoor scenes appear very natural.\n\"...I use Fire Stick TV and Sony Blu-Ray through the HDMI ports. Great picture. Great sound. Well worth the investment.\" Read more\n\"...rein. - \"Pinocchio\" (2022, 4K, Guillermo del Toro), a brilliantly filmed, very dark stop-motion animated film that hits every button...\" Read more\n\"...I like it a lot better than my Samsung TV that it replaced. My PS5 looks amazing on it....\" Read more\n\"Looks great to me, blacks BAF, works very well in daylight and sunny room comparatively to 2020 LG LCD and games fast, responsive… feels snappy with...\" Read more\nCustomers are satisfied with the TV's quality, with one customer specifically praising its video performance.\n\"Extremely well-engineered and intuitive HDTV. I was able to master operating techniques easily....\" Read more\n\"...You get what you pay for and this TV isn’t cheap but it’s definitely quality. 5 stars from me...\" Read more\n\"High quality OLED. Brilliant picture....\" Read more\n\"...To recap. Gonna be a great TV. Pretty good sound quality even without a sound bar or hifi set up. Once I get settings dialed in, I will like it....\" Read more\nCustomers find the TV easy to set up.\n\"Extremely well-engineered and intuitive HDTV. I was able to master operating techniques easily....\" Read more\n\"...Set up was pretty user-friendly. Sound is a lot better than most. You get what you pay for and this TV isn’t cheap but it’s definitely quality....\" Read more\n\"...Total hassle.\" Read more\n\"...Very easy to set up, and user friendly remote control.\" Read more\nCustomers find the TV's sound quality adequate.\n\"...Great picture. Great sound. Well worth the investment.\" Read more\n\"...Set up was pretty user-friendly. Sound is a lot better than most. You get what you pay for and this TV isn’t cheap but it’s definitely quality....\" Read more\n\"High quality OLED. Brilliant picture. Although the sound is adequate, to complement the high quality picture, I would strongly suggest adding a...\" Read more\n\"...To recap. Gonna be a great TV. Pretty good sound quality even without a sound bar or hifi set up. Once I get settings dialed in, I will like it....\" Read more\nCustomers have mixed opinions about the TV's remote control, with some finding it user-friendly, while others report issues with setup and functionality.\n\"...Magic remote pointer is a major annoyance in LG models and there is no option to turn the pointer off permanently....\" Read more\n\"Extremely well-engineered and intuitive HDTV. I was able to master operating techniques easily....\" Read more\n\"...The remote’s a little weird at first, but I had a Wii growing up, so it wasn’t a big adjustment to using the pointer....\" Read more\n\"...Very easy to set up, and user friendly remote control.\" Read more\nCustomers have mixed opinions about the TV's value for money, with some finding it worth every penny and offering good quality for the price, while others consider it inexcusable for its price range.\n\"...Great picture. Great sound. Well worth the investment.\" Read more\n\"...Sound is a lot better than most. You get what you pay for and this TV isn’t cheap but it’s definitely quality. 5 stars from me...\" Read more\n\"...Seeing the etching on Smaug's hide (without the sheen) is worth every penny....\" Read more\n\"Junk! I think we got a bad TV. It cost us $105.00 to send it back. Never again! HDMI connection issues even with 3 brand new HDMI cables....\" Read more\nCustomers have mixed opinions about the TV's brightness, with some finding it too bright and vivid, while one customer notes it works well in daylight and sunny rooms.\n\"Looks great to me, blacks BAF, works very well in daylight and sunny room comparatively to 2020 LG LCD and games fast, responsive… feels snappy with...\" Read more\n\"...MAN (60fps): I know what you're thinking: this movie is intolerable for its irremediable sheen/glow. You're right....\" Read more\n\"Fantastic picture! No complaints so far. Works great with my LG Sound Bar\" Read more\n\"...As I write this, I notice the screen's gradual dimmer is working very well to ensure no image burn-in occurs when I stop typing for a while....\" Read more\nCustomers have mixed experiences with the TV's responsiveness, with some reporting no lag while others find it slow.\n\"...It took almost the entire movie for me to register that there was no lag or choppiness in Dune Part 2 at all... none (at least with BFI engaged)....\" Read more\n\"...voice sounds as if the person inhaled helium from a balloon and spoke very fast....\" Read more\n\"...well in daylight and sunny room comparatively to 2020 LG LCD and games fast, responsive… feels snappy with high HZ feedback. Niiice....\" Read more\n\"...Slow, sluggish, and inexcusable for this price range....\" Read more\nReviews with images\nLG's BFI TAMES BILBO's and SMAUG's HORRID GLOWING!\nTop reviews from the United States\nThere was a problem filtering reviews. Please reload the page.\n- Reviewed in the United States on June 4, 2025Size: 55 InchesStyle: TV OnlyVerified PurchaseExtremely well-engineered and intuitive HDTV. I was able to master operating techniques easily. I use Fire Stick TV and Sony Blu-Ray through the HDMI ports. Great picture. Great sound. Well worth the investment.\n- Reviewed in the United States on June 14, 2025Size: 55 InchesStyle: TV OnlyVerified PurchaseComparison: My new LG 4K Smart OLED TV (OLED55C5PUA, 2025) vs my old LG 4K Smart OLED TV (OLED55CXPUA, 2020)\nSources Used: Sony UBP-X700 4K Ultra HD Player (October 2024) and 4K Ultra HD Blu-ray discs.\nConnectors: Zeskit Maya 8K 48Gbps Certified Ultra High-Speed HDMI Cable 16ft CL3 In-Wall Rated\nRemote Control Solution: As others rightly indicate, the new remote that comes with this TV is not up to the tasks required. I ended up using the remote that came with the previous version of this TV - the \"LG Remote Magic Remote Control\" (AKB75855501) - which is available on Amazon.\nLG TV's UNIQUE STANDOUTS SUMMARY\n- \"Nightmare Alley\" (2021, 4K, Guillermo del Toro) joins perfect details and colors to allow the genre's nihilism free rein.\n- \"Pinocchio\" (2022, 4K, Guillermo del Toro), a brilliantly filmed, very dark stop-motion animated film that hits every button (Note: not for young children).\n- \"TRON: Legacy\" (2010, 2K upscaled to 4K, Joseph Kosinski) is everything a gorgeous Sci-Fi drama - with stellar soundtrack - should be thanks to LG and Disney.\n(DETAILED EVALUATIONS BELOW)\nPreface: All my viewing was in HDR mode for 4k. I used the movies listed below, all of which benefitted from excellent motion smoothing, without awful sheen/glow, when rendered using moderate level of this TV's Black Frame Insertion (BFI) in Game Mode and a touch of extra brightness. Bright or dark room did not matter. (See bottom of page for comments on 2K SDR/Regular Blu-ray.)\nTHE HOBBIT - THE DESOLATION OF SMAUG (48fps): If you hated the 48fps of The Hobbit, your troubles are over! Watch this movie with correct BFI and generally accepted parameters for Game Mode on this TV. Then the natural appearance of everything in this movie will bowl you over. Faces are normal. The spiders of Mirkwood show markings that are easier to see and have colors that make sense on those horrid creatures. Seeing the etching on Smaug's hide (without the sheen) is worth every penny.\nSTAR WARS (2020 UHD Release)(24fps): The movie is fun and impressive to watch given how old it is. The color and lighting are very good. Its sheen was tamed very well on this TV, and scenes filmed outdoors were very natural. (When I watched this movie on my previous LG TV - the OLED55CXPUA, 2020 - I was distracted by the less manageable sheen/glow.)\nDUNE, PARTS 1 and 2:\n- (Dune1, 24fps) The abundance of sand colors and sunlight make the DUNE movies bright overall. Beautiful browns in their various shades are a treat. In the midst of all that brown, you should notice subtle dark shades of green on clothing, and quilt-like stitching on the jackets. Facial features are beautifully rendered. The Bene Gesserit ship passing through and out of The Spacing Guild's Heighliner (at 20m:50s) and the Worm Spotter aircraft's flight (at 1h:01m:50s) should not break up in their movements across the screen. In the battle scenes when the Harkonnen invade, you should see no tearing or empty space in the rolling flames.\n- (Dune2, 24fps/48fps) It took almost the entire movie for me to register that there was no lag or choppiness in Dune Part 2 at all... none (at least with BFI engaged). Turns out Dune Part 2 occasionally used 48fps in some places instead of 24fps only, an approach that worked almost magically. It now takes 1st place as the best all-around film in my collection.\nBLADE RUNNER 2049 (24fps): The BFI nailed the surrounding colors and movement of K's police vehicle as it passed behind buildings. The vehicle's movement was smooth and the snow/rain contrails moving over and past the back of the vehicle were easy to pick out. Colors were incredibly detailed and vibrant at every turn.\n1917 (24fps): This movie benefits enormously from BFI and reduces the number of \"jittery\" scenes to two: 1) the stuttering movement as the camera views an embankment and pans left to right just after the two soldiers narrowly escape the collapsing tunnels, and 2) the panning left to right as the two soldiers are in a barn looking through wood slats at a plane in the distance.\nOBLIVION (24fps): I've watched this movie many times and this LG TV brought out colors better than the previous LG. The motions were very smooth and details abounded. Things to look for are Vicca's tears running down her face and off her nose as she betrays Jack, and the flickering lights when Julia and the hapless people are in the sights of the drone programmed to kill them (the flickering lights should not tear or have holes).\nFORD v FERRARI (24fps): The most interesting and exciting (and perpetual) visual experience I had with this movie was the heightened detail seen on clothing I don't recall seeing on the previous TV. But most of all the colors of red and brown in their various shades were able to make me fall further into the movie as everything seemed so very natural.\nTHE PRESTIGE (24fps): This is a very detailed movie where the differing shades of brown are everywhere. Especially look for the brown variants (and other colors) in the weave of the tweed coats, especially prominent near the end of the movie.\nGEMINI MAN (60fps): I know what you're thinking: this movie is intolerable for its irremediable sheen/glow. You're right. It's also too intimate: it's as close to \"being there\" than I could tolerate... feels creepy, like eavesdropping. I played this all the way through again but came away with no changed opinions, except for very slightly better colors all 'round. HOWEVER, the climax near the end of the movie is visceral in how it renders the minigun being used to shred the store where the heroes are sheltering. TECHNICALLY SPEAKING, I must say that one of the most impressive demonstrations of BFI motion smoothing is how, in the opening scene, the filmmaker was able to sweep the camera across the ribbed structure above the train station and not induce seizures. (On the other hand, you might want seizure medicine handy if you try to view that panned ribbed structure with no BFI enabled.) On the whole, its motion smoothing and details are absolutely amazing.\nRegarding 2K SDR (i.e., regular Blu-ray), my results were either very good or very poor. For instance, the original releases of Avatar, Total Recall (2012), and The Imitation Game rendered outstanding results. On the other hand, The Last Samurai and Sherlock Holmes: A Game of Shadows were a disappointment. While the upscaling and motion smoothing were excellent on all these 2K movies, the Last Samurai and Sherlock Holmes renderings were too dark or dull, foggy, and wispy. The previous model of this same TV (OLED55CXPUA, 2020) did not have such challenges and disparities.\nAs I write this, I notice the screen's gradual dimmer is working very well to ensure no image burn-in occurs when I stop typing for a while. (At the moment, I am using the TV's input connected to my computer.) Even though the dimming feature is not good for watching movies, it is a must for anything else. Thankfully, when using the 4k input for movies, and Game Mode is enabled, the TV will not dim on its own.\n5.0 out of 5 starsComparison: My new LG 4K Smart OLED TV (OLED55C5PUA, 2025) vs my old LG 4K Smart OLED TV (OLED55CXPUA, 2020)LG's BFI TAMES BILBO's and SMAUG's HORRID GLOWING!\nReviewed in the United States on June 14, 2025\nSources Used: Sony UBP-X700 4K Ultra HD Player (October 2024) and 4K Ultra HD Blu-ray discs.\nConnectors: Zeskit Maya 8K 48Gbps Certified Ultra High-Speed HDMI Cable 16ft CL3 In-Wall Rated\nRemote Control Solution: As others rightly indicate, the new remote that comes with this TV is not up to the tasks required. I ended up using the remote that came with the previous version of this TV - the \"LG Remote Magic Remote Control\" (AKB75855501) - which is available on Amazon.\nLG TV's UNIQUE STANDOUTS SUMMARY\n- \"Nightmare Alley\" (2021, 4K, Guillermo del Toro) joins perfect details and colors to allow the genre's nihilism free rein.\n- \"Pinocchio\" (2022, 4K, Guillermo del Toro), a brilliantly filmed, very dark stop-motion animated film that hits every button (Note: not for young children).\n- \"TRON: Legacy\" (2010, 2K upscaled to 4K, Joseph Kosinski) is everything a gorgeous Sci-Fi drama - with stellar soundtrack - should be thanks to LG and Disney.\n(DETAILED EVALUATIONS BELOW)\nPreface: All my viewing was in HDR mode for 4k. I used the movies listed below, all of which benefitted from excellent motion smoothing, without awful sheen/glow, when rendered using moderate level of this TV's Black Frame Insertion (BFI) in Game Mode and a touch of extra brightness. Bright or dark room did not matter. (See bottom of page for comments on 2K SDR/Regular Blu-ray.)\nTHE HOBBIT - THE DESOLATION OF SMAUG (48fps): If you hated the 48fps of The Hobbit, your troubles are over! Watch this movie with correct BFI and generally accepted parameters for Game Mode on this TV. Then the natural appearance of everything in this movie will bowl you over. Faces are normal. The spiders of Mirkwood show markings that are easier to see and have colors that make sense on those horrid creatures. Seeing the etching on Smaug's hide (without the sheen) is worth every penny.\nSTAR WARS (2020 UHD Release)(24fps): The movie is fun and impressive to watch given how old it is. The color and lighting are very good. Its sheen was tamed very well on this TV, and scenes filmed outdoors were very natural. (When I watched this movie on my previous LG TV - the OLED55CXPUA, 2020 - I was distracted by the less manageable sheen/glow.)\nDUNE, PARTS 1 and 2:\n- (Dune1, 24fps) The abundance of sand colors and sunlight make the DUNE movies bright overall. Beautiful browns in their various shades are a treat. In the midst of all that brown, you should notice subtle dark shades of green on clothing, and quilt-like stitching on the jackets. Facial features are beautifully rendered. The Bene Gesserit ship passing through and out of The Spacing Guild's Heighliner (at 20m:50s) and the Worm Spotter aircraft's flight (at 1h:01m:50s) should not break up in their movements across the screen. In the battle scenes when the Harkonnen invade, you should see no tearing or empty space in the rolling flames.\n- (Dune2, 24fps/48fps) It took almost the entire movie for me to register that there was no lag or choppiness in Dune Part 2 at all... none (at least with BFI engaged). Turns out Dune Part 2 occasionally used 48fps in some places instead of 24fps only, an approach that worked almost magically. It now takes 1st place as the best all-around film in my collection.\nBLADE RUNNER 2049 (24fps): The BFI nailed the surrounding colors and movement of K's police vehicle as it passed behind buildings. The vehicle's movement was smooth and the snow/rain contrails moving over and past the back of the vehicle were easy to pick out. Colors were incredibly detailed and vibrant at every turn.\n1917 (24fps): This movie benefits enormously from BFI and reduces the number of \"jittery\" scenes to two: 1) the stuttering movement as the camera views an embankment and pans left to right just after the two soldiers narrowly escape the collapsing tunnels, and 2) the panning left to right as the two soldiers are in a barn looking through wood slats at a plane in the distance.\nOBLIVION (24fps): I've watched this movie many times and this LG TV brought out colors better than the previous LG. The motions were very smooth and details abounded. Things to look for are Vicca's tears running down her face and off her nose as she betrays Jack, and the flickering lights when Julia and the hapless people are in the sights of the drone programmed to kill them (the flickering lights should not tear or have holes).\nFORD v FERRARI (24fps): The most interesting and exciting (and perpetual) visual experience I had with this movie was the heightened detail seen on clothing I don't recall seeing on the previous TV. But most of all the colors of red and brown in their various shades were able to make me fall further into the movie as everything seemed so very natural.\nTHE PRESTIGE (24fps): This is a very detailed movie where the differing shades of brown are everywhere. Especially look for the brown variants (and other colors) in the weave of the tweed coats, especially prominent near the end of the movie.\nGEMINI MAN (60fps): I know what you're thinking: this movie is intolerable for its irremediable sheen/glow. You're right. It's also too intimate: it's as close to \"being there\" than I could tolerate... feels creepy, like eavesdropping. I played this all the way through again but came away with no changed opinions, except for very slightly better colors all 'round. HOWEVER, the climax near the end of the movie is visceral in how it renders the minigun being used to shred the store where the heroes are sheltering. TECHNICALLY SPEAKING, I must say that one of the most impressive demonstrations of BFI motion smoothing is how, in the opening scene, the filmmaker was able to sweep the camera across the ribbed structure above the train station and not induce seizures. (On the other hand, you might want seizure medicine handy if you try to view that panned ribbed structure with no BFI enabled.) On the whole, its motion smoothing and details are absolutely amazing.\nRegarding 2K SDR (i.e., regular Blu-ray), my results were either very good or very poor. For instance, the original releases of Avatar, Total Recall (2012), and The Imitation Game rendered outstanding results. On the other hand, The Last Samurai and Sherlock Holmes: A Game of Shadows were a disappointment. While the upscaling and motion smoothing were excellent on all these 2K movies, the Last Samurai and Sherlock Holmes renderings were too dark or dull, foggy, and wispy. The previous model of this same TV (OLED55CXPUA, 2020) did not have such challenges and disparities.\nAs I write this, I notice the screen's gradual dimmer is working very well to ensure no image burn-in occurs when I stop typing for a while. (At the moment, I am using the TV's input connected to my computer.) Even though the dimming feature is not good for watching movies, it is a must for anything else. Thankfully, when using the 4k input for movies, and Game Mode is enabled, the TV will not dim on its own.\nImages in this review\n- Reviewed in the United States on July 10, 2025Size: 42 InchesStyle: TV OnlyVerified PurchaseWhy did you pick this product vs others?:The media could not be loaded.\nI like it a lot better than my Samsung TV that it replaced. My PS5 looks amazing on it. Currently playing armored core 6 and the visuals are outstanding. Set up was pretty user-friendly. Sound is a lot better than most. You get what you pay for and this TV isn’t cheap but it’s definitely quality. 5 stars from me\n- Reviewed in the United States on August 1, 2025Size: 65 InchesStyle: TV OnlyVerified PurchaseLooks great to me, blacks BAF, works very well in daylight and sunny room comparatively to 2020 LG LCD and games fast, responsive… feels snappy with high HZ feedback. Niiice. $1000 off the 2696$ ($1696 total) brand new price tag for 65”. Okay. Thanks! Remote doesn’t seem to have an input fast switch, first time ever maybe, that sucks.\n- Reviewed in the United States on July 13, 2025Size: 48 InchesStyle: TV OnlyVerified PurchaseJunk! I think we got a bad TV. It cost us $105.00 to send it back. Never again! HDMI connection issues even with 3 brand new HDMI cables. It would on see on device at a time. You’d have to keep unplugging and plugging in whatever HDMI you wanted to use at the time. Total hassle.\n- Reviewed in the United States on May 27, 2025Size: 55 InchesStyle: TV OnlyVerified PurchaseI'd give this 4 or 5 stars for the TV but the manuals for it from LG are beyond pathetic. You have to find websites to help you figure out options you may want. If you want to just plug it in and have it be acceptable, this ain't for you. If you want a good manual for the manufacturer, this ain't for you. I found and downloaded the manual on their site (because, of course it does not come with one that is of any use). And the online details almost nothing. The little quick set up manual is the most pathetic of any I've ever seen. Tiny print. Hardly worth looking at.\nAs for good screen display set up, I looked at a lot of recommendations online. Those suggesting a number of setting changes recommend filmmakers mode. One guy recommended Cinema mode with lower brightness on leds to get good image and color. First night with it I watched a hockey game and none of the standard presets looked good (between standard, sports, gamer, vivid). All too bright too vivid, too unreal looking. Ended up turning off power saving because it was always too bright for my room no matter what. It could not adjust itself down enough. Ended up, after reading that one persons recs on Cinema mode with LEDs output turned down to 50%. That got it to a very good place with good color, excellent brightness, and it looked fantastic on another hockey game and movie test on Apple TV.\nNow for the remote. I suggest you get a standard LG tv remote. We have one. It is so vastly better than the model that comes with it. Not even a simple button to get to selecting which HDMI input. The old, basic, non floating around your screen cursor models work far better. And you can turn that function off. But you know what does? A basic LG remote that does not have that function but has FAR more obvious and simple buttons. I got an LG tv for our conference room at work. Non LED and a 1/4th the cost four years ago. On that model, you can turn off the Magic mousing feature, whatever they call it.\nTo recap. Gonna be a great TV. Pretty good sound quality even without a sound bar or hifi set up. Once I get settings dialed in, I will like it. None of the default set up choices presents an acceptable picture to me. Too bright, too vivid, even on standard mode. Going to take a lot of fiddling or get a pro to come to your house. Serious.\nAnyway, summary.\nTV great. Or I expect it to be.\nManuals, utterly pathetic. And since there is no easy mode, that's bad.\nRemote. Unacceptably poor, few functions, very unintuitive.\nAbout me. Life long tech nerd with a lot of experience. This TV and manuals and remotes would suck for a novice.\n- Reviewed in the United States on August 7, 2025Size: 55 InchesStyle: TV OnlyVerified PurchaseGood enough quality for the price and being a new model. If possible, you should go for the 55\" model instead of the 42\" as the price difference is negligible. During setup, the voice sounds as if the person inhaled helium from a balloon and spoke very fast. Magic remote pointer is a major annoyance in LG models and there is no option to turn the pointer off permanently. For this price, people should get a remote with backlight but that is not the case, unfortunately. Minus one star just due to annoying remote and pointer.\nImportant information\nOn-mode power consumption\n133.1 watts\nEnergy consumption\n246 Kilowatt Hours Per Year per year, based on the power consumption of the television operating 4 hours per day for 365 days. The actual energy consumption will depend on how the television is used.\nVisible screen diagonal\n55\" / 140 cm"
    },
    {
      "url": "https://www.amazon.com/dp/B0BYPNLKP4?tag=cnet-buy-button-20",
      "text": "| Brand Name | Sony |\n|---|---|\n| Item Weight | 80.7 pounds |\n| Product Dimensions | 15.63 x 65.75 x 39.13 inches |\n| Item model number | XR75X90L |\n| Batteries | 2 AAA batteries required. |\n| Is Discontinued By Manufacturer | No |\n| Color Name | Black |\n| Special Features | Billions of colors with XR Triluminos Pro, Exclusive features for PlayStation® 5, Movies on us with BRAVIA CORE (5 credits/12 months), NEW Eco Dashboard, NEW Game Menu |\n| Item Weight | 80.7 Pounds |\n| Standing screen display size | 75 |\n| Aspect Ratio | 16:9 |\n| Voltage | 1.1E+2 Volts |\nLearn more\nNo featured offers available\nWe feature offers with an Add to Cart button when an offer meets our high standards for:\n- Quality Price,\n- Reliable delivery option, and\n- Seller who offers good customer service\n- 9 VIDEOS\nImage Unavailable\nColor:\n-\n-\n-\n- To view this video download Flash Player\nSony 75 Inch 4K Ultra HD TV X90L Series: BRAVIA XR Full Array LED Smart Google TV with Dolby Vision HDR and Exclusive Features for The PlayStation® 5 XR75X90L- Latest Model,Black\nOur specialist Customer Support for large items dispatched from Amazon is on hand to help with your order. Contact us via phone or chat 7 days a week.\n| Screen Size | 75 |\n| Brand | Sony |\n| Display Technology | LED |\n| Resolution | 4K |\n| Refresh Rate | 120 |\n| Special Feature | Billions of colors with XR Triluminos Pro, Exclusive features for PlayStation® 5, Movies on us with BRAVIA CORE (5 credits/12 months), NEW Eco Dashboard, NEW Game Menu See more |\n| Included Components | Power Cable, Remote Control, AAA batteries, Stand |\n| Connectivity Technology | Bluetooth, Ethernet, HDMI, USB, Wi-Fi |\n| Aspect Ratio | 16:9 |\n| Product Dimensions | 15.63\"D x 65.75\"W x 39.13\"H |\nAbout this item\n- HANDPICKED BY AMAZON: They did the research so you don’t have to.\n- LIFELIKE PICTURE– The intelligent and powerful Cognitive Processor XR delivers a picture with wide dynamic contrast, detailed blacks, natural colors, and high peak brightness, replicating how we see the real world.\n- FULL ARRAY LED CONTRAST AND COLOR– See enhanced contrast with high peak brightness and billions of accurate colors, all controlled by Full Array LED backlight technology and XR Triluminos Pro.\n- PREMIUM SMART TV – Get access to all your favorite streaming apps in one place with Google TV, and simply use your voice to search and ask questions with Google Assistant. Supports Apple AirPlay.\n- MOVIES ON US WITH BRAVIA CORE - Enjoy streaming high-bitrate, high-quality 4K UHD movies included with the BRAVIA CORE app. Get 5 credits to redeem on latest release movies and 12 months subscription on hundreds of classics.\n- ALL YOUR GAME SETTINGS IN ONE PLACE– Game Menu puts all your gaming picture settings and exclusive assist features in a single easy-to-manage interface.\n- HDMI 2.1 GAMING – Get the advantage in high-performance gaming with HDMI 2.1 features like 4K/120, VRR, and ALLM.\n- PERFECT FOR PLAYSTATION 5– Take your gaming to the next level with exclusive features Auto HDR Tone Mapping and Auto Genre Picture Mode for optimized picture quality while gaming and streaming on your PS5 console.\n- ENHANCED ENTERTAINMENT – Enjoy engaging and immersive cinematic content the way the creators intended, with support for Dolby Vision, IMAX Enhanced, Netflix Adaptive Calibrated Mode, and more.\n- ELEVATED AUDIO– With Acoustic Multi-Audio and support for Dolby Atmos, sound positioning tweeters produce wider, elevated sound that matches the picture you see.\nProduct voltage: 110\nThis product is compatible with outlets that support 110 volts and might require a converter when used outside of the United States.\nTop Brand: Sony\nWhat's in the box\nProduct information\nTechnical Details\nAdditional Information\n| ASIN | B0BYPNLKP4 |\n|---|---|\n| Customer Reviews |\n4.4 out of 5 stars |\n| Best Sellers Rank |\n|\n| Date First Available | June 19, 2023 |\nWarranty & Support\nFeedback\nProduct Description\nSee a vivid, crisp picture while you watch and game, all powered by the intelligent Cognitive Processor XR™. Full Array LED and XR Contrast Booster precisely controls zones of LEDs expanding the contrast range for deep, detailed blacks and increased peak brightness. HDMI 2.1 VRR, 4K120, and ALLM support lets you unlock the full potential of your favorite games for smooth and clear gameplay.\nFrom the brand\n-\nSony is a creative entertainment company with a portfolio that encompasses electronics, music, motion pictures, mobile, gaming, and more.\nFor over 70 years, imagination has been the fuel of everything we do. From how people listen to music, to how they play games, to how they watch TV, our big imaginations have led us to create products that innovate and inspire generations.\n-\nShop Sony TVs\n-\nShop Sony Home Audio & Video\n-\nShop Sony Headphones\n-\nShop Sony Wireless Speakers\n-\nShop Sony INZONE Gaming\n-\nShop Sony Imaging & Phones\n-\nShop Sony Video & Audio\n-\nShop Sony PlayStation\nFrom the manufacturer\nVibrant contrast. Vivid colors.\nBRAVIA XR X90L Full Array LED 4K HDR Google TV\nIntelligent and powerful TV processing\nSee how real your entertainment can be, with immersive depth and lifelike picture quality, powered by Sony’s intelligent Cognitive Processor XR. Hundreds of thousands of individual on-screen elements are processed and remastered boosting color, contrast, and clarity, bringing astounding realism.\nEnhanced contrast and impressive brightness\nBy controlling brightness in sections of the screen independently, Full Array LED backlighting balances light output to ensure scenes are full of breathtaking contrast. XR Contrast Booster further enhances contrast to feel more true-to-life by maximizing peak brightness & controlling black levels.\nBillions of real-world colors\nAccess billions of accurate colors and reproduce each shade with the subtle differences seen in the real world. XR Triluminos Pro enhances the range of hues and saturation, revealing extremely precise details within textures, and skin tones that look completely natural.\nMovies included with SONY PICTURES CORE\nInstantly enjoy top movies with the SONY PICTURES CORE app. Your BRAVIA TV comes with movie credits included so you can immediately watch some of the latest releases. You’re also subscribed to an amazing selection of new and classic movies to stream anytime, and updated regularly.\nThe entertainment you love. With help from Google.\nWith 700,000+ movies and TV episodes available across 10,000+ apps and 800+ free live TV channels, Google TV takes streaming to the next level – bringing together your favorite entertainment from across your apps and organizing it all, just for you. Looking for something special? Just ask Google.\nPerfect for PlayStation 5\nTake your gaming to the next level with exclusive features Auto HDR Tone Mapping and Auto Genre Picture Mode for optimized picture quality while gaming and streaming on your PS5 console.\nLevel up your gaming with HDMI 2.1 features\nWith features such as 4K/120, VRR, and ALLM as specified in HDMI 2.1, BRAVIA XR TVs deliver a thrilling gaming experience. With 4K/120 you get up to 120fps on compatible games and Variable Refresh Rate (VRR) virtually eliminates screen tearing and stuttering.\n-\nDoes this TV have enhanced audio?\nYes, with Acoustic Multi-Audio and support for Dolby Atmos, sound positioning tweeters produce wider, elevated sound that matches the picture you see.\n-\nCan you control this TV with your voice?\nYes, you can ask Google to find movies, stream apps, play music, and control the TV - all with your voice. Even get answers, control smart home devices, and more. Press the Google Assistant button on your remote to get started.\n-\nDoes this TV work with AirPlay 2?\nYes, with Apple AirPlay 2 you can share pictures, video or audio to your television right from your iPhone, iPad or Mac. Watch movies and shows from your favorite apps and the Apple TV app, or even Safari. Share your photos with everyone in the room.\n-\nDoes this TV work with Alexa?\nYes, through an Alexa enabled device (sold separately), ask Alexa to change channels, adjust volume, and turn your TV on/off.\n-\nCan you video chat?\nYes with the optional BRAVIA CAM (sold separately) – you can video chat with family and friends using your big screen. Ambient Optimization Pro automatically adjusts the picture and sound according to your room environment.\nSony 4K HDR TVS\n| BRAVIA 3 Series | X90L Series | BRAVIA 5 Series |\n|---|---|---|\n| Display Type & Screen sizes 4K LED (43\"/50\"/55\"/65\"/75\"/85\") | Display Type & Screen sizes 4K Full Array LED (55\"/65\"/75\"/85\"/98\") | Display Type & Screen sizes 4K Mini LED (55\"/65\"/75\"/85\"/98\") |\n| Main Features Expanded color / Varity of sizes, perfect for any room | Main Features Advanced processing / Enhanced contrast and brightness | Main Features XR Processor and enhanced Mini LED contrast |\n| SONY PICTURES CORE App 5 credits for new release movies / 12 months unlimited streaming on classics | SONY PICTURES CORE App 5 credits for new release movies / 12 months unlimited streaming on classics | SONY PICTURES CORE App 5 credits for new release movies / 12 months unlimited streaming on classics |\n| Studio Calibrated Picture Mode N/A | Studio Calibrated Picture Mode Netflix / SONY PICTURES CORE | Studio Calibrated Picture Mode Prime Video / Netflix / SONY PICTURES CORE |\n| Sound X-Balanced Speakers | Sound Acoustic Multi-Audio / Side Firing Tweeters | Sound Acoustic Multi-Audio + / Side Firing Tweeters / Voice Zoom 3 |\nCustomer reviews\nCustomer Reviews, including Product Star Ratings help customers to learn more about the product and decide whether it is the right product for them.\nTo calculate the overall star rating and percentage breakdown by star, we don’t use a simple average. Instead, our system considers things like how recent a review is and if the reviewer bought the item on Amazon. It also analyzed reviews to verify trustworthiness.\nLearn more how customers reviews work on AmazonCustomers say\nCustomers praise the TV's stunning picture quality, with one noting how standard HD content is beautifully upscaled to 4K, and its vivid colors with impressively black blacks. Moreover, the TV receives positive feedback for its sound quality, ease of setup, and value for money, with one customer highlighting its seamless integration with Google TV. However, the functionality receives mixed reviews, with some customers reporting it stopped working after five months.\nAI Generated from the text of customer reviews\nCustomers praise the TV's picture quality, describing it as stunning and bright with incredible resolution, with one customer noting that standard HD content is beautifully upscaled to 4K.\n\"55\" is perfect size for my 250 sq ft bedroom. Great picture. Decent sound. Took a little longer to set up the apps/tv functions than I expected....\" Read more\n\"...Great sound and great picture. I would highly recommend!\" Read more\n\"...Combined with the great reputation of Sony for picture quality and reliability, I think this is an excellent television for the price....\" Read more\n\"The Yays: Beautiful picture! 4 HDMI ports (1 of them ARC) Physical Switch to disable the hot mic. The Bluetooth remote!...\" Read more\nCustomers find this TV to be amazing for movies, gaming, and casual YouTube viewing, with one customer specifically mentioning it's great for watching live sports.\n\"Great tv! Upgrade from last Sony, great for price\" Read more\n\"Great TV. Best picture quality I have ever owned, but that's a low hurdle. Input delay is barely noticeable....\" Read more\n\"Excellent TV that we put in our basement. The delivery team was on time and very professional....\" Read more\n\"The TV is great and I have been using Google TV for some time, but for some reason you can't turn off the sleep mode....\" Read more\nCustomers praise the TV's picture quality, noting its vivid colors, excellent contrast, and impressively deep blacks.\n\"...This TV is awesome!! It is well made, looks great. I even mounted it onto the wall stand myself. It weighs 55lbs with the bracket rails on it....\" Read more\n\"...The full array LED display delivers vibrant, crisp colors with deep blacks and excellent contrast....\" Read more\n\"...I will be honest here on the OLED tv's. Yes, they are vivid, yes they are bright and eye popping, but they are over contrasted, over sharpened and...\" Read more\n\"The wide range of color is lifelike and beautiful it’s sharp and detailed also smooth and the sound is very good for a flat screen the side tweeters...\" Read more\nCustomers like the TV's sound quality, with one customer highlighting its fantastic stereo effect and another mentioning its Dolby Atmos capabilities.\n\"Great picture and sound at a price much lower than comparable TVs. Movies to sports to daily news. No complaints.\" Read more\n\"...Sound, quality, color of the TV are superb! I absolutely love it.\" Read more\n\"...on a table with the lowest feet adjustment, and all I can say is it sounds tinny... The speakers have almost no noticeable bass, even with it...\" Read more\n\"...One of the nicest surprises of the TV is the sound it puts out!...\" Read more\nCustomers find the TV offers excellent value for money, providing a great balance between quality and price.\n\"...It's worth every penny!\" Read more\n\"...So, my conclusion is that it's all right for the price....\" Read more\n\"...It nearly matches the quality of OLED sets, but at a much better price....\" Read more\n\"...This is a very affordable TV. 65\" is awesome for my sports.\" Read more\nCustomers find the TV easy to set up and navigate, with one customer noting that it integrates seamlessly with Alexa and another mentioning that the menu is simple to move through.\n\"...It was easy to set up, programmed itself, along with high definition, theater bar. Sound, quality, color of the TV are superb! I absolutely love it.\" Read more\n\"...Such a great display - easy to setup, easy to use, easy to install and mount, colors are great, and motion is great....\" Read more\n\"...Sorry I didn’t buy the 65 in , but I am enjoying it anyway. Easy to set up ....\" Read more\n\"It's big and beautiful! Easy setup. Great picture quality. The TV speakers have amazingly good sound....\" Read more\nCustomers praise the TV's quality, noting that it matches the performance of OLED sets and is solid in construction.\n\"...The TV itself is a great quality and has been used as a little movie theater experience for this household.\" Read more\n\"...I like the stand legs, they are long and sturdy. The picture quality is nice and way better than my previous LG tv....\" Read more\n\"...The picture is crips, the colors vibrant, and the TV of great quality....\" Read more\n\"...It nearly matches the quality of OLED sets, but at a much better price....\" Read more\nCustomers report mixed experiences with the TV's functionality, with some saying it works great while others mention it stopped working after five months or won't work at all.\n\"Works great, only problem is it is very tilted. Scared that it will fall off one day\" Read more\n\"...It couldn't have been more cheaply made and limited in function....\" Read more\n\"...The big thing for me was that it worked seamlesssly with my Bose Soundbar, which was my big problem with my older Hisense display....\" Read more\n\"...me do a security check and I am in an infinite loop and the TV won't work at all.\" Read more\nReviews with images\nGreat picture quality. Poor wi-fi and bluetooth.\nTop reviews from the United States\nThere was a problem filtering reviews. Please reload the page.\n- Reviewed in the United States on July 25, 2025Size: 65Style: TV OnlyVerified PurchaseI think, for the price, this is a fantastic TV. The picture is crips, the colors vibrant, and the TV of great quality. Its not the newest and brightest, but if you can get it under $900 I would highly recommend. It does surprisingly well in a well lit space and there are really no down sides so far. I have not tried gaming on it yet but Netflix or TV is awesome.\nJust remember to unpack it from the top unlike I did haha.\n- Reviewed in the United States on January 17, 2024Size: 65Style: TV OnlyVerified PurchaseThis is the nicest TV I've ever owned in my 40+ years on this planet. My last TV was a 42\"1080p, which was decent, but this thing is on a whole other level!\nThe picture on this thing is so good! My cable TV only lets me get decent picture, but when I turn on my Xbox Series X and play a 4k game or watch a DVD or downloaded video I get to see what this thing is capable of, and I love it! I don't see any problems with it at all. I'm not a videophile or expert, but when I saw a random comment here and there about a random thing being a small issue with their TV I tried to recreate the same thing and never got anything that would ever remotely qualify as a problem. Maybe I'm just not sensitive enough, but to me this TV is pretty much perfect.\nOne of the nicest surprises of the TV is the sound it puts out! I was kind of expecting decent sound because I've seen that some modern TVs (like my last one) have what is essentially like a little mini soundbar built into the bottom of the TV when they're big enough. Since my last 42\" sounded good I hoped this would too. Well I was NOT disappointed! The sound is really clear, and gets more than loud enough for my small living room (20'x30'). I have never turned it up past 40 and I'm pretty sure it goes up to 100. It's not going to shake the house or make your ears bleed since there's no sub woofer or anything, but for a TV I can't help but to be impressed.\nActually, not only is there good sound coming from the bottom of the TV, but Sony seems to have done some kind of magic with speakers mounted in the back on the side of the TV up towards the top. These things can throw sound around the room and create a kind of surround sound. I don't know how they do it, because there isn't even a speaker grill or anything back there, the sound just comes through the plastic. I only noticed because I was standing next to it and heard them. It's a cool feature I wasn't expecting.\nAs I sit here typing this I have the TV on and I'm sitting in a menu for Forza Motorsport. The sounds of the menu music really seem like they're coming from the sides, and even behind me a little bit. The sound from this TV really impresses me. More than a few times since I bought it I'll think I hear something outside to my left, but it's just the TV doing it's thing. It's great!\nOne thing to note is that this TV is heavy. I believe the box said 70lbs when it was delivered. I have it mounted on the wall and I needed a friend to help me so I didn't risk breaking anything. So if you see the listed weight on here and think that other TVs are so much lighter and easy to pick up so it must be a typo, it isn't. This thing is so much heavier than I thought it would be.\nI know there are better TVs out there, but they cost a lot more. I believe Sony pushed the tech in this kind of TV about as far as they can, and in my opinion they did an amazing job. It isn't the latest and greatest, but I wouldn't hesitate to recommend this TV. If you're on the fence, do it! I think you'll be happy. You've probably done enough research to be where you're wondering if you should pull the trigger. Well I think you should. I don't think you'll be disappointed. I'm so happy I bought this thing! I'll update if anything changes, but part of the reason I bought this is because Sony is supposed to build TVs that last much longer than others. We'll see. Right now I couldn't be happier.\n- Reviewed in the United States on July 3, 2025Size: 65Style: TV OnlyVerified PurchaseWhy did you pick this product vs others?:\nSuch a great display - easy to setup, easy to use, easy to install and mount, colors are great, and motion is great. The big thing for me was that it worked seamlesssly with my Bose Soundbar, which was my big problem with my older Hisense display. This is an easy recommendation.\n- Reviewed in the United States on December 4, 2023Size: 65Style: TV OnlyVerified PurchaseI really tried to like this TV, but the S95B has definitely spoiled me... even after all the nerfs and downright bad updates. The X90L just doesn't hold a candle to an OLED in HDR content. The processing really does carry this TV though. The way it's able to focus on highlights with so few dimming zones is impressive. I was also very pleased with the motion and sharpening features.\nUnfortunately, it just doesn't do well enough. In darker content, especially anything with black bars, the image would look washed out in those scenarios. I tested only a few movies, but I really wasn't pleased with how dark HDR was and how it inherently forced the Sony to struggle. In SDR content, I was consistently blown away by the brightness compared to my OLED. It even came close in color, but it didn't have the deep reds that the S95B had.\nUser interface: This was one of my biggest gripes with the TV. None of the menus and apps use your TV's settings or local dimming, so everything looks pretty bad unless you're playing content. Another problem I had was with the settings menu not saving my motion settings and also not having separate presets for HDR and SDR. I like to use DCI color for SDR and keep it on Auto for HDR, but I have to switch them back and forth every time. It also just feels kinda clunky sometimes.\nSound: I have the TV set up on a table with the lowest feet adjustment, and all I can say is it sounds tinny... The speakers have almost no noticeable bass, even with it boosted in the EQ. The cinema mode was the best sound mode, but I would definitely recommend a sound bar. I personally use a pair of Jamo S803 bookshelf speakers with a Yamaha RV685 receiver (the receiver is definitely overkill). Also, the S95B murders this TV in the sound department too.\nSo, my conclusion is that it's all right for the price. I didn't enjoy it that much for gaming, as my panel had pretty noticeable DSE, and it looked surprisingly blurry in motion, even for LCD standards. The SDR performance is great and almost eye-searingly bright, but HDR falls flat and doesn't give the contrast you need for most content. Demo content looks good, but movies/shows are typically mastered a lot darker and will show this TV's weaknesses.\nFor what it offers, I think it should be less expensive, and from what I've seen in-store, the U8K is much better overall. I bought this TV because I wanted a 65-inch over my 55-inch and also wanted to see if the brightness would win me over, but the only time it's brighter is in SDR, and the S95B crushes it in HDR, no contest. I would recommend an S90C instead for HDR and gaming.\nTop reviews from other countries\n- Stephen HatchReviewed in Canada on February 8, 2025\n5.0 out of 5 stars This is a great TV\nSize: 65Style: TV OnlyVerified PurchaseI replaced an existing 46\" Sony Bravia that was almost 15 years old and still working good.\nThe new TV is 65 \" and the picture quality is really good. The TV arrived almost 3 weeks ahead of the predicted delivery date. The setup was very easy. So far very happy with this purchase.\n-\nMZAJYReviewed in Saudi Arabia on February 26, 2024\n5.0 out of 5 stars الوان ووضوح\nSize: 65Style: TV OnlyVerified Purchaseاجمل شاشة اقتنيتها .. الالوان والوضوح والصوت شي رهيب … الشاشة يميزها انها مقاربة تماما لشاشات ال OLED من ناحية عمق السواد بل هي افضل عند استخدام الستلايت او اليوتيوب لان ما يجعلك تعدل على زيادة السطوع من فترة لفترة … اخذتها بعد الخصم ٥٦٠٠ ريال اضافة الى خصم الكويون ١١٠٠ ريال المجموع تقريبا ٤٥٠٠ ريال.. واخذت معها سوند بار بعد التخفيض ب ١٠٠٠ طلع المجموع ٥٥٠٠ ريال\n- ManeaReviewed in the United Arab Emirates on November 28, 2024\n5.0 out of 5 stars Great TV 85X90L\nSize: 85Style: TV OnlyVerified PurchaseGreat TV .. worth the deal, with Two Years Jumbo warranty. Appreciate positive info by the sellers.\n-\nOmar Bernardo Lopez MartinezReviewed in Mexico on May 31, 2025\n5.0 out of 5 stars Recomendada para Cinefilos y Gamers!!\nSize: 55Style: TV OnlyVerified PurchaseLa pantalla supero mis expectativas, solo puedo decir que si eres fan del cine y de los videojuegos es la ideal… contiene muchas opciones para audio (Dolby DTS, Dolby Atmos, Dolby Audio) visualmente también ofrece una opción para formatos de película IMAX Enhanced. Tiene una opción especial para la consola PS5 (llamada VRR: evitando el desgarro de pantalla (tearing)). Ofrece opciones para Apple TV variadas (Home kit, AirPlay), tiene una aplicación que se llama Sony Pictures Core donde te ofrece películas de muy alta calidad (IMAX, DTS, 4K - HDR, Dolby Atmos, Pure Stream). La tele tiene mucho para ofrecer y disfrutar, de las mejores compras que he hecho! Feliz con lo adquirido!The media could not be loaded.\n-\nWalid R.Reviewed in Saudi Arabia on October 2, 2024\n4.0 out of 5 stars جودة الشركة\nSize: 65Style: TV OnlyVerified Purchaseتستحق الشراء وخورافية نقص النجمة الاخيرة لوجود ميزات اعلى ولكن بسعر اغلى"
    }
  ],
  "argos_summary": "The LG C5 OLED TV has received positive reviews for its stunning picture quality, vibrant colors, and excellent contrast, making it a top choice for 2025. It features advanced technology such as the Alpha 9 AI Processor and supports Dolby Vision and Dolby Atmos for an immersive viewing experience. However, some users have noted that the remote control is less intuitive than previous models, and there are mixed opinions on the AI features and overall functionality. Discounts on various models, including the C5, are currently available, making it a good time to consider an upgrade.",
  "argos_id": "UQB94NY63"
}