{
  "url": "https://www.foxnews.com/politics/scoop-trumps-new-dc-crime-crackdown-yields-more-than-100-arrests",
  "authorsByline": "Emma Colton",
  "articleId": "2b66d0163c774dddbef48fa8f46a651c",
  "source": {
    "domain": "foxnews.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://static.foxnews.com/foxnews.com/content/uploads/2025/08/dc-arrest-federalization.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-13T09:54:52-04:00",
  "addDate": "2025-08-13T14:09:25.755314+00:00",
  "refreshDate": "2025-08-13T14:09:25.755315+00:00",
  "score": 1.0,
  "title": "SCOOP: Trump's new DC crime crackdown yields more than 100 arrests",
  "description": "President Trump federalized Washington D.C. police department under emergency powers, resulting in 103 arrests since Monday's law and order crackdown.",
  "content": "FIRST ON FOX: Law enforcement officials in Washington, D.C., have arrested more than 100 people since Aug. 7, Fox Digital has learned, as President Donald Trump cracks down on crime in the city.\n\nLaw enforcement officials have arrested a total of 103 individuals as of Wednesday morning since Aug. 7, which includes 43 who were arrested Tuesday, a White House official told Fox Digital Wednesday morning.\n\n\"President Trump’s bold leadership is quickly making our nation’s capital safer,\" White House spokeswoman Taylor Rogers told Fox Digital. \"In less than one week, over 100 violent criminals have already been arrested and taken off of the streets in Washington, D.C. President Trump is delivering on his campaign promise to clean up this city and restore American Greatness to our cherished capital.\"\n\nTrump announced Monday that he was federalizing the local police department under section 740 of the District of Columbia Home Rule Act, which allows the president to assume emergency control of the capital's police force for 30 days.\n\nFBI DIRECTOR KASH PATEL BACKS TRUMP'S DC POLICE TAKEOVER: 'WHEN YOU LET GOOD COPS BE COPS, THEY DELIVER'\n\nHundreds of National Guard members have since converged on the nation's capital, as well as federal law enforcement departments such as the FBI, DEA, U.S. Capitol Police and ATF assisting with Trump's law and order crackdown and sweeps of the city.\n\nThe first phase of the crime crackdown Monday resulted in 23 arrests, FBI Director Kash Patel revealed on X Tuesday.\n\n\"On the first big push of FBI supporting initiative to make DC safe again, FBI reported 10 arrests with partners,\" the director wrote on X.\n\n\"These are just a few examples — we are just getting started,\" Patel continued. \"Federal partners joined local police and arrested 23 in total.\" \n\n\n\n\"When you let good cops be cops they can clean up our streets and do it fast,\" he said. \"More to come. Your nation’s Capital WILL be safe again.\"\n\nThe nation's capital in the following years has been that have left innocent children shot and dead, a trend of juveniles committing carjackings that have turned deadly in some cases, shoplifting crimes and attacks on government employees, summer interns and others, including the fatal shooting of 21-year-old congressional intern, Eric Tarpinian-Jachym, in June.\n\nTRUMP ACTIVATES NATIONAL GUARD TROOPS TO ADDRESS ‘TOTALLY OUT OF CONTROL’ CRIME IN WASHINGTON\n\nTrump had threatened to federalize the D.C. police department in recent weeks, citing a spate of high-profile crimes that have left locals and visitors of the city dead or seriously injured, such as Tarpinian-Jachym's killing, the fatal shooting of a pair of Israeli embassy staffers in May, and a brutal attack on a former Department of Government Efficiency staffer earlier in August.\n\n\"Our capital city has been overtaken by violent gangs and bloodthirsty criminals, roving mobs of wild youth, drugged-out maniacs and homeless people,\" Trump said Monday. \"And we're not going to let it happen anymore. We're not going to take it.\"\n\nDemocratic lawmakers and local leaders have slammed Trump over the move, arguing crime has fallen in recent years following the wildly violent crime trends of 2020 that rocked cities nationwide.\n\nTrump described the federalization of the police as \"Liberation Day in D.C.,\" declaring, \"We're going to take our capital back.\"\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n\"We're taking it back under the authority vested in me as the president of the United States, I'm officially invoking section 740 of the District of Columbia Home Rule Act. You know what that is. And placing the under direct federal control. … In addition, I'm deploying the National Guard to help reestablish law, order and public safety in Washington, D.C. And they're going to be allowed to do their job properly,\" he said Monday.",
  "medium": "Article",
  "links": [
    "https://www.foxnews.com/category/crime",
    "https://www.foxnews.com/apps-products?pid=AppArticleLink",
    "https://www.foxnews.com/video/6376807795112",
    "https://www.foxnews.com/politics/fbi-director-kash-patel-backs-trumps-dc-police-takeover-when-you-let-good-cops-cops-deliver",
    "https://x.com/realDonaldTrump",
    "https://www.foxnews.com/person/p/kash-patel",
    "https://www.foxnews.com/politics/white-house-launches-federal-security-blitz-president-vows-end-dc-crime-plague",
    "https://x.com/POTUS",
    "https://www.foxnews.com/category/us/crime/police-and-law-enforcement",
    "https://www.foxnews.com/category/us/washington-dc",
    "https://www.foxnews.com/politics/trump-activates-national-guard-troops-address-totally-out-control-crime-washington"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "President Trump",
      "weight": 0.076874666
    },
    {
      "name": "President Donald Trump",
      "weight": 0.07458236
    },
    {
      "name": "Donald Trump",
      "weight": 0.0732036
    },
    {
      "name": "Trump",
      "weight": 0.07252819
    },
    {
      "name": "shoplifting crimes",
      "weight": 0.07087998
    },
    {
      "name": "local police",
      "weight": 0.07049403
    },
    {
      "name": "federal law enforcement departments",
      "weight": 0.069480866
    },
    {
      "name": "crime",
      "weight": 0.0689135
    },
    {
      "name": "Law enforcement officials",
      "weight": 0.06581064
    },
    {
      "name": "FBI Director Kash Patel",
      "weight": 0.06546012
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.96240234375
    },
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.93701171875
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.90869140625
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.9013671875
    }
  ],
  "sentiment": {
    "positive": 0.07200211,
    "negative": 0.73720604,
    "neutral": 0.19079183
  },
  "summary": "President Donald Trump's new crime crackdown in Washington, D.C., has resulted in over 100 arrests since Aug. 7 as part of a crackdown on crime in the city. The arrests, which include 43 people arrested on Tuesday, were made by law enforcement officials. The president has also federalized the local police department under section 740 of the District of Columbia Home Rule Act, allowing him to take control of the police force for 30 days. Hundreds of National Guard members, federal law enforcement departments, and the FBI are assisting in the crackdown. The first phase of the crime crackdown resulted in 23 arrests, with FBI Director Kash Patel stating that \"we are just getting started.\"",
  "shortSummary": "President Donald Trump's crackdown on crime in Washington has resulted in over 100 arrests, including 43 under federal control.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "24764dfc93af43499fb38af383d282b6",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.foxnews.com/category/crime",
      "text": "VIDEO 7 hours ago Podcast host poses question to Jimmy Kimmel: 'What are you waiting for?' A 'Fox News @ Night' panel discusses Jimmy Fallon getting a ratings boost from Greg Gutfeld's appearance, Dana Bash's remarks over D.C. violence, Jimmy Kimmel getting Italian citizenship and more.\nVIDEO 8 hours ago Man attacked by violent teen mob in DC's Navy Yard neighborhood An unidentified man was attacked by a mob of violent teen strangers during a street takeover in Washington, D.C.'s Navy Yard neighborhood in May. (Courtesy Cameron Russell)\nVIDEO 9 hours ago If the National Guard presence works in D.C., other cities would welcome their help, predicts Sen. John Kennedy Sen John Kennedy defends Trump's DC crackdown: 'I see a dysfunctional local government' that enables crime\nCrime 10 hours ago National Guard troops spotted in Washington DC as Trump launches crackdown on street crime Trump invokes federal control over D.C. police amid crime surge, with National Guard spotted leaving armory as authorities arrest 23 suspects.\nMedia 10 hours ago Jeanine Pirro shuts down reporters questioning Trump’s DC crime crackdown Jeanine Pirro defended D.C. crime response efforts by referencing families of murder victims and assault cases during heated media exchange.\nVIDEO 10 hours ago Video shows parents begging cops to storm Uvalde elementary school after 2022 shooting Body camera footage from police shows desperate parents begging officers to storm an elementary school in Uvalde, Texas, after a gunman opened fire in 2022. (Uvalde County Sheriff's Department)\nVIDEO 10 hours ago Journalist opens up about her experience with crime in DC Washington Examiner reporter Anna Giaritelli shares her experience with crime in the nation's capital on 'The Ingraham Angle.'\nFox News Flash 11 hours ago DEA head says phone calls are coming from 'all over the country’ from fed agents wanting to help in DC DEA head Terry Cole outlined the “unified effort\" to reduce crime in Washington, D.C. after Trump declared a federal takeover of local police.\nMedia 13 hours ago MSNBC host reveals DC journalist privately shared concerns about crime while publicly denouncing Trump's plan Joe Scarborough pointed out on \"Morning Joe\" contradictions between reporters' private safety concerns and public criticism of Trump's federal control of DC police.\nU.S. 14 hours ago Mountain town rocked after country singer's mom murdered in random home invasion A Virginia sheriff said the fatal home invasion stabbing of the mother of an an up-and-coming country music singer is unlike “anything\" he's ever seen."
    },
    {
      "url": "https://www.foxnews.com/politics/trump-activates-national-guard-troops-address-totally-out-control-crime-washington",
      "text": "President Donald Trump announced Monday that he is activating approximately 800 National Guard troops and is taking over the Metropolitan Police Department to tackle crime in Washington, after beefing up federal law enforcement presence in the nation's capital Saturday.\n\"I'm deploying the National Guard to help reestablish law, order and public safety in Washington, DC,\" Trump told reporters at a Monday press conference. \"And they're going to be allowed to do their job properly.\"\nTrump also said that he would federalize the Metropolitan Police Department in Washington to respond to crime, placing it under the authority of Attorney General Pam Bondi.\nNational Guard troops are reserve forces that are mobilized in response to state and federal operations, including natural disasters, and are typically overseen by their respective state governments. However, Trump controversially deployed National Guard troops from California to respond to immigration riots in June, bypassing California Gov. Gavin Newsom to dispatch the troops.\nThe federal government oversees the District of Columbia National Guard.\nSecretary of Defense Pete Hegseth said that Secretary of the Army Dan Driscoll will operationalize the D.C. National Guard, and signaled that more National Guard troops could be roped into the deployment down the line.\n\"You will see them flowing into the streets of Washington in the coming week,\" Hegseth told reporters Monday. \"At your direction as well, sir, there are other units we are prepared to bring in. Other National Guard units, other specialized units. They will be strong, they will be tough, and they will stand with their law enforcement partners.\"\nTrump’s remarks come just after he promised Washington would be \"LIBERATED\" from \"Crime, Savagery, Filth, and Scum\" in a post on Truth Social Monday morning. He said in the post that the \"days of ruthlessly killing, or hurting, innocent people, are OVER!\"\nTrump floated the idea of taking over Washington’s Metropolitan Police Department and utilizing National Guard troops to manage crime in Washington Wednesday, following the assault of a former Department of Government Efficiency (DOGE) staffer on Aug. 3 in Washington’s Logan Circle.\nTRUMP THREATENS TO FEDERALIZE DC AFTER EX-DOGE EMPLOYEE 'BIG BALLS' VIOLENTLY BEATEN\n\"What a shame – rate of crime, the rate of muggings, killings and everything else, we’re not going to let it, and that includes bringing in the National Guard, maybe very quickly, too,\" Trump told reporters Wednesday at the White House.\nTrump also told reporters at the time he was open to taking over Washington’s Metropolitan Police Department because crime in the nation’s capital is \"ridiculous.\"\nWhile a temporary federal takeover of the Metropolitan Police Department is justified in cases of emergency, Trump's move will likely be challenged in court over whether the situation in Washington qualifies as an emergency.\nTrump has historically railed against violence in Washington, and said Tuesday that crime is \"totally out of control\" in the nation's capital.\nMeanwhile, crime in Washington is on the decline. Violent crime is down 26% this year, in comparison to the same timeframe in 2024, according to Washington’s Metropolitan Police Department. Likewise, assaults with a dangerous weapon are down 20%, and homicides are down by 12%.\nWATCH: TRUMP HINTS HE WILL FEDERALIZE DC SOON, BRING IN NATIONAL GUARD AFTER ‘BIG BALLS’ ATTACK\nWashington’s Mayor Muriel Bowser challenged Trump’s description of the city during an interview with MSNBC Sunday, and voiced concerns about the possibility of activating the National Guard to tackle the city’s crime.\n\"Any comparison to a war-torn country is hyperbolic and false,\" Bowser said.\nCLICK HERE TO GET THE FOX NEWS APP\n\"I’m concerned about them not being used efficiently, and I just think that’s not the most efficient use of our Guard,\" Bowser said.\nThe Associated Press contributed to this report.\nThis is a breaking news story and will be updated."
    },
    {
      "url": "https://www.foxnews.com/category/us/crime/police-and-law-enforcement",
      "text": "VIDEO 7 hours ago Podcast host poses question to Jimmy Kimmel: 'What are you waiting for?' A 'Fox News @ Night' panel discusses Jimmy Fallon getting a ratings boost from Greg Gutfeld's appearance, Dana Bash's remarks over D.C. violence, Jimmy Kimmel getting Italian citizenship and more.\nVIDEO 8 hours ago If the National Guard presence works in D.C., other cities would welcome their help, predicts Sen. John Kennedy Sen John Kennedy defends Trump's DC crackdown: 'I see a dysfunctional local government' that enables crime\nMedia 10 hours ago Jeanine Pirro shuts down reporters questioning Trump’s DC crime crackdown Jeanine Pirro defended D.C. crime response efforts by referencing families of murder victims and assault cases during heated media exchange.\nVIDEO 10 hours ago Inside the federal takeover of DC's police department Fox News correspondent David Spunt has the latest on the Justice Department's takeover of Washington, D.C.'s police department on 'Special Report.'\nVIDEO 10 hours ago Video shows parents begging cops to storm Uvalde elementary school after 2022 shooting Body camera footage from police shows desperate parents begging officers to storm an elementary school in Uvalde, Texas, after a gunman opened fire in 2022. (Uvalde County Sheriff's Department)\nFox News Flash 10 hours ago DEA head says phone calls are coming from 'all over the country’ from fed agents wanting to help in DC DEA head Terry Cole outlined the “unified effort\" to reduce crime in Washington, D.C. after Trump declared a federal takeover of local police.\nPolitics 11 hours ago BLM activist leading resistance to Trump's DC crime plan repeatedly called for abolishing police One of the leaders of the protests against President Trump's plan to combat crime in Washington, D.C., has long been a supporter of defunding the police.\nPolice and Law Enforcement 12 hours ago CDC shooter had police contacts over suicide, used father's guns in attack: officials The man accused of killing a police officer while shooting at the U.S. Centers for Disease Control and Prevention (CDC) headquarters in Atlanta had previously been reported to police for suicidal thoughts and launched the deadly attack with his father’s weapons to send a message against COVID-19 vaccines, authorities said Tuesday.\nOpinion 13 hours ago I support Trump taking control of DC police — the Constitution is on his side President Donald Trump's D.C. police takeover could signal the end of home rule as administration asserts federal control over the nation's capital city and its law enforcement.\nPolice and Law Enforcement 14 hours ago DC police chief ripped for 'mind blowing' response to basic policing question: 'Yikes' D.C. Police Chief Pamela Smith faces social media mockery after appearing confused by reporter's question about chain of command following Trump's federalization of department.\nVIDEO 14 hours ago If DC was a state, it would have the highest murder rate in the country, former top AG says Former U.S. Attorney General Bill Barr ridicules criticism of President Donald Trump's actions to fight crime as 'completely out-of-touch' on 'America Reports.'\nVIDEO 14 hours ago Karoline Leavitt: This should be a 'winning issue' for all Americans White House press secretary Karoline Leavitt responds to criticism from Democrats on President Donald Trump deploying the National Guard in Washington, D.C. after podcast host Benny Johnson shares experiences living in the capital.\nGeorgia 15 hours ago Who is Quornelius Radford? The Army sergeant accused of shooting 5 soldiers at Fort Stewart in Georgia Army Sergeant Quornelius Radford, 28, accused of shooting five soldiers at Fort Stewart where he works as automated logistics sergeant in combat team area.\nOhio 15 hours ago Cincinnati leaders 'demanding prosecution' of White man in viral street fight Cincinnati mayor promises swift decision on additional charges as community questions investigation into viral confrontation involving racial slurs.\nVIDEO 15 hours ago US Attorney for DC Jeanine Pirro says she does not 'need any more statistics' on crime U.S. Attorney for D.C. Jeanine Pirro speaks out about those shot and killed in the nation's capital and the city's juvenile crime.\nVIDEO 16 hours ago ICE official describes the 'BAD ACTORS' the agency is 'going after' Acting I.C.E. director Todd Lyons weighs in on the agency reportedly setting a new detention record this week and addresses whether Rhode Island police 'cooperated' with the arrest of an alleged sex offender on 'America Reports.'\nVIDEO 16 hours ago National Guard will get the 'worst of the worst' off DC streets: Chris Swecker Former FBI assistant director Chris Swecker and former Assistant District Attorney Phil Holloway discuss President Donald Trump's crackdown on crime on 'The Faulkner Focus.'\nVIDEO 17 hours ago 'Get lost!': Dems, media rage over Trump's DC crime crackdown 'Outnumbered' reacts to President Donald Trump deploying the National Guard to crack down on crime in Washington, D.C. as Democrats protest the president's move.\nOhio 22 hours ago Seventh Cincinnati assault suspect arrested over violent beatdown Seventh arrest made in Cincinnati downtown beatdown that went viral after injuring six people, with Gregory Wright facing riot and assault charges.\nOpinion 1 day ago Black fatherlessness is turning DC into a war zone Liberal policies and absent fathers fuel crime and violence in D.C. A cultural change is needed alongside Trump's law enforcement approach.\nVIDEO 1 day ago Trump-Putin summit is the 'inflection point' in Ukraine-Russia war: Dasha Burns A 'Special Report' panel weighs in on President Donald Trump's federalization of Washington, D.C. and the upcoming summit between the president and Vladimir Putin.\nFox News Flash 1 day ago Defense Secretary Pete Hegseth vows to be 'force multipliers' of DC police Defense Secretary Pete Hegseth explains what is ‘front and center’ in President Donald Trump’s quest to make Washington, D.C. safe on 'The Ingraham Angle.'\nVIDEO 1 day ago Sean Hannity: Few places are as violent as DC Fox News host Sean Hannity compares the crime rate in Washington, D.C. to other cities in America and globally on 'Hannity.'\nKash Patel 1 day ago FBI Director Kash Patel backs Trump's DC police takeover: 'When you let good cops be cops, they deliver' FBI Director Kash Patel spoke to agents as the Trump administration places D.C. Metropolitan Police under federal control and activates National Guard troops amid high crime.\nVIDEO 1 day ago Trump goes out of the way to protect reporters who call him a 'dictator': Kilmeade Fox News' Brian Kilmeade discusses President Donald Trump's redecorating prowess in the White House, his moves to clean up crime in Washington, D.C. and the reaction from Democrats on 'Jesse Watters Primetime.'\nVIDEO 1 day ago Trump’s ‘got the guts’ to do this: Pete Hegseth Defense Secretary Pete Hegseth reveals what’s ‘front and center’ of President Donald Trump’s quest to make Washington, D.C. safe and explains why he aims to bring back ‘shark attacks’ on ‘The Ingraham Angle.’\nVIDEO 1 day ago How Trump is federalizing DC police and deploying National Guard Fox News correspondent Alexandria Hoff has the latest on how the Justice Department will run Washington, D.C.'s police force on 'Special Report.'\nVIDEO 1 day ago 911 calls released in death of 10-year-old Arizona girl Police have released the 911 calls in the case of 10-year-old Rebekah Baptiste, depicting a lack of emotion from the woman calling for help.\nVIDEO 1 day ago Gunman opens fire at Texas Target store Austin Police said at least two people were killed after a gunman opened fire at a Target store. Police also said the suspect was detained. (Credit: KTBC)\nVIDEO 1 day ago Mother of son caught in DC crossfire weighs in on Trump’s crime crackdown Tamara Tarpinian-Jachym, the mother of a murdered congressional intern, weighs in on President Donald Trump’s takeover of Washington, D.C. police on ‘The Story.’"
    },
    {
      "url": "https://www.foxnews.com/politics/fbi-director-kash-patel-backs-trumps-dc-police-takeover-when-you-let-good-cops-cops-deliver",
      "text": "FBI Director Kash Patel endorsed President Donald Trump's plans to take over the Metropolitan Police Department to tackle crime in Washington D.C., amid heavy criticism from Democrats and local officials who say the move is part of a power grab.\nPatel was seen Monday afternoon inside a command post for the first night of the temporary takeover in a show of support for law enforcement.\n\"Proud to stand shoulder to shoulder with the men and women who keep our nation’s capital safe,\" Patel said in an exclusive statement to Fox News Digital. \"When you let good cops be cops, give them the tools they need, and back them every step of the way, they deliver - every time.\"\nIn photos exclusively provided to Fox News Digital, Patel can be seen speaking Monday to FBI and Department of Homeland Security (DHS) personnel wearing protective vests at a command center at a U.S. Park Police station.\nOn Monday, Trump said he would federalize the police department and place it under the authority of U.S. Attorney General Pam Bondi in an effort to address crime. He also said he was activating approximately 800 National Guard troops to \"reestablish law, order and public safety\" in the capital.\nWashington D.C., Mayor Muriel Bowser called the move \"unsettling and unprecedented.\"\n\"While this action today is unsettling and unprecedented, I can’t say that given some of the rhetoric of the past, that we’re totally surprised,\" Bowser said during a news conference. \"I can say to D.C. residents that we will continue to operate our government in a way that makes you proud.\"\nTRUMP'S PLAN TO DEPLOY NATIONAL GUARD IN DC SPARKS BACKLASH FROM RESIDENTS—BUT SOME WELCOME IT\nThe District of Columbia Home Rule Act allows Trump to place the city's police department under federal control for up to 30 days. Bowser noted that granting D.C. statehood, an issue local officials have repeatedly advocated for, could have prevented the takeover.\n\"If people are concerned about the president being able to move the National Guard into our city, the time to do that would have been when the Congress had a bill that it could have given control of the D.C. National Guard to D.C.,\" she said. \"So there are things that, when a city is not a state, and not fully autonomous, and doesn’t have senators, that the federal government can do.\"\nOther Democrats heavily criticized the Trump administration for the move.\n\"If President Trump wants to help make Chicago safer, he can start by releasing the funds for anti-violence programs that have been critical to our work to drive down crime and violence,\" the office of Chicago Mayor Brandon Johnson said. \"Sending in the national guard would only serve to destabilize our city and undermine our public safety efforts.\"\nThe Washington, D.C. City Council called the temporary takeover a \"manufactured intrusion on local authority.\"\nTRUMP CLAIMS DC CRIMES TROUNCE STATS FROM NOTORIOUSLY VIOLENT CITIES WORLDWIDE\n\"Violent crime in the District is at the lowest rates we’ve seen in 30 years. Federalizing the Metropolitan Police Department is unwarranted because there is no Federal emergency,\" the council said in a joint statement. \"Further, the National Guard has no public safety training or knowledge of local laws. The Guard’s role does not include investigating or solving crimes in the District. Calling out the National Guard is an unnecessary deployment with no real mission.\"\nThe National Capital Region Delegation, a body comprised of several House Democratic lawmakers, accused Trump of personally inciting crime in the capital, referring to the Jan. 6, 2021 riot at the U.S. Capitol building.\n\"Trump’s ‘temporary’ takeover of the Metropolitan Police Department is not intended to prevent crime, it is a soft launch of authoritarianism,\" the group said in a statement. \"Trump has a longstanding pattern of seeking showy displays of power. As he has shown repeatedly, Trump is working to serve himself and is not concerned with keeping American families safe in cities and towns across our country.\"\n\"The President’s announcement this morning is an unserious and unacceptable publicity stunt,\" they added. \"If he wants to reduce crime in the District of Columbia, he should focus on getting his Republican allies in Congress to restore the funding they arbitrarily stripped out of the city’s budget, which risks cuts to law enforcement and other public safety measures.\"\nCLICK HERE TO GET THE FOX NEWS APP\nRandi Weingarten, president of the American Federation of Teachers union, called Trump's announcement a \"gross overreach, disconnected from actual conditions on the ground.\"\n\"So, we have to ask: Will the president’s heavy-handed show of force make the average D.C. resident feel safer? Will it create jobs for working people and bring patrons back to downtown businesses?\" she said. \"Will it provide young people a pathway to jobs, skills or other activities that keep them off the streets?\"\n\"The answer to those questions is ‘no,’ she added. \"That’s why this move is yet another crass spectacle from a president who cares more about targeting, intimidating and playing king than the safety of D.C. and its residents.\"\nTrump's opponents have cited crime statistics showing crime in Washington is on the decline. Crime in Washington is down 26% this year compared to the same timeframe in 2024, according to the MPD. Assaults with a dangerous weapon are down 20%, and homicides are down by 12%, according to police data. In January, the Justice Department said violent crime in 2024 in the district was down 35% from 2023, the lowest it has been in over 30 years.\nHowever, Trump disagrees.\nMetropolitan Police Department data shows that while the homicide rate is falling, the last five years saw the greatest number of murders since 2008.\n\"The murder rate in Washington today is higher than that of Bogota, Colombia, Mexico City, some of the places that you hear about as being the worst places on Earth, much higher,\" Trump said Monday. \"This is much higher. The number of car thefts has doubled over the past five years, and the number of carjackings has more than tripled. Murders in 2023 reached the highest rate, probably ever. They say 25 years, but they don't know what that means because it just goes back 25 years can't be worse.\"\nFox News Digital's Andrew Mark Miller contributed to this report."
    },
    {
      "url": "https://www.foxnews.com/category/us/washington-dc",
      "text": "Media 3 hours ago Ex-Harris aide argues more police won’t make streets safer, citing experience as a ‘Black woman in America’ Ex-Harris spokesperson Sanders-Townsend pushed back against Trump's crime initiative, arguing increased police presence doesn't improve safety for everyone in America.\nCrime 3 hours ago National Guard troops spotted in Washington DC as Trump launches crackdown on street crime Trump invokes federal control over D.C. police amid crime surge, with National Guard spotted leaving armory as authorities arrest 23 suspects.\nMedia 3 hours ago Jeanine Pirro shuts down reporters questioning Trump’s DC crime crackdown Jeanine Pirro defended D.C. crime response efforts by referencing families of murder victims and assault cases during heated media exchange.\nVIDEO 3 hours ago Inside the federal takeover of DC's police department Fox News correspondent David Spunt has the latest on the Justice Department's takeover of Washington, D.C.'s police department on 'Special Report.'\nFox News Flash 4 hours ago DEA head says phone calls are coming from 'all over the country’ from fed agents wanting to help in DC DEA head Terry Cole outlined the “unified effort\" to reduce crime in Washington, D.C. after Trump declared a federal takeover of local police.\nWashington DC 4 hours ago Trump's DC public safety sweep results in 23 arrests including murder suspect on opening day FBI Director Kash Patel reports 23 arrests as part of Trump's initiative to federalize Washington D.C. police and tackle crime in the nation's capital.\nPolitics 4 hours ago BLM activist leading resistance to Trump's DC crime plan repeatedly called for abolishing police One of the leaders of the protests against President Trump's plan to combat crime in Washington, D.C., has long been a supporter of defunding the police.\nMedia 6 hours ago MSNBC host reveals DC journalist privately shared concerns about crime while publicly denouncing Trump's plan Joe Scarborough pointed out on \"Morning Joe\" contradictions between reporters' private safety concerns and public criticism of Trump's federal control of DC police.\nOpinion 6 hours ago I support Trump taking control of DC police — the Constitution is on his side President Donald Trump's D.C. police takeover could signal the end of home rule as administration asserts federal control over the nation's capital city and its law enforcement.\nPolice and Law Enforcement 7 hours ago DC police chief ripped for 'mind blowing' response to basic policing question: 'Yikes' D.C. Police Chief Pamela Smith faces social media mockery after appearing confused by reporter's question about chain of command following Trump's federalization of department.\nVIDEO 8 hours ago Karoline Leavitt: This should be a 'winning issue' for all Americans White House press secretary Karoline Leavitt responds to criticism from Democrats on President Donald Trump deploying the National Guard in Washington, D.C. after podcast host Benny Johnson shares experiences living in the capital.\nMedia 8 hours ago DC Attorney General Brian Schwalb slams Trump's federal takeover, breaking with police union DC Attorney General Biran Schwalb spoke out against President Donald Trump's federal takeover of Washington, D.C., and said it was an \"unprecedented step.\"\nVIDEO 9 hours ago US Attorney for DC Jeanine Pirro says she does not 'need any more statistics' on crime U.S. Attorney for D.C. Jeanine Pirro speaks out about those shot and killed in the nation's capital and the city's juvenile crime.\nWhite House 9 hours ago Schiff blasts ‘tinpot dictator’ Trump’s National Guard mobilization, warns other cities are next Senator Adam Schiff criticizes President Trump's deployment of National Guard troops and federalization of Washington police.\nMedia 9 hours ago CNN’s effort to ridicule Trump as Washington’s Batman backfires as social media hails 'cool' comparison CNN host Abby Phillip's comparison of President Trump to Batman during criticism of his D.C. police federalization plan backfired as conservatives praised the superhero analogy.\nMedia 10 hours ago Wash Post editorial sees possible short term success in Trump's decision to send National Guard to DC The Washington Post backed Trump's law-and-order approach in D.C. while also calling for long-term fixes including more police officers and juvenile justice reforms on Monday.\nUS protests 10 hours ago DC paid protester requests surge 400% amid Trump’s federal takeover of city police: crowd company Washington, D.C., crowd rental inquiries surge 400% as Trump announces federal takeover of Metropolitan Police Department amid rising crime concerns.\nUS Education 10 hours ago Trump admin rips George Washington University in DC as 'deliberately indifferent' to antisemitism The Trump Justice Department found George Washington University in violation of federal civil rights law, citing an indifference to antisemitic harassment.\nMedia 12 hours ago CNN panel knocks national Democrats on 'tone-deaf' response to Trump DC crime plan A CNN panel suggested on Monday that the response from national Democrats to President Donald Trump's plan to address crime in Washington, D.C. might come across as tone-deaf.\nMedia 13 hours ago CNN's Dana Bash roasted for calling Jan. 6 'most violent moment in recent history' after Trump crime presser CNN host Dana Bash referred to the Jan. 6 Capitol riot while reporting on President Donald Trump’s announcement that he would federalize the D.C. police.\nWashington DC 16 hours ago Man in DC shot and killed hours after Trump federalizes city's police department A man was shot and killed in Washington D.C.'s Logan Circle neighborhood Monday night, just hours after President Trump announced a federal takeover of city police.\nWashington DC 16 hours ago DC councilman charged with corruption scheme says leaders are 'responsible,' don't need 'federal interference' D.C. Councilman Trayon White blasts Trump's plan to takeover capital law enforcement, despite facing charges of running a bribery scheme in his office.\nOpinion 17 hours ago Black fatherlessness is turning DC into a war zone Liberal policies and absent fathers fuel crime and violence in D.C. A cultural change is needed alongside Trump's law enforcement approach.\nFox News Flash 18 hours ago Chris Christie praises Trump's 'long overdue' DC crime crackdown Chris Christie praises Trump's decision to activate National Guard and federalize D.C. police under Pam Bondi to restore law and order in Washington.\nFox News Flash 1 day ago US Attorney Pirro says administration won’t tolerate ‘out of control’ crime in the nation’s capital Jeanine Pirro, the United States attorney for the District of Columbia, discusses President Donald Trump's efforts to make the nation's capital safe again amid crime concerns.\nFox News Flash 1 day ago Defense Secretary Pete Hegseth vows to be 'force multipliers' of DC police Defense Secretary Pete Hegseth explains what is ‘front and center’ in President Donald Trump’s quest to make Washington, D.C. safe on 'The Ingraham Angle.'\nKash Patel 1 day ago FBI Director Kash Patel backs Trump's DC police takeover: 'When you let good cops be cops, they deliver' FBI Director Kash Patel spoke to agents as the Trump administration places D.C. Metropolitan Police under federal control and activates National Guard troops amid high crime.\nCrime 1 day ago Mother of slain congressional intern praises Trump's Washington, DC crime crackdown Mother of slain congressional intern Eric Tarpinian-Jachym praises Trump's efforts to address Washington, D.C. crime after son's unsolved murder in June.\nVIDEO 1 day ago Trump’s ‘got the guts’ to do this: Pete Hegseth Defense Secretary Pete Hegseth reveals what’s ‘front and center’ of President Donald Trump’s quest to make Washington, D.C. safe and explains why he aims to bring back ‘shark attacks’ on ‘The Ingraham Angle.’\nDonald Trump 1 day ago MSNBC contributor rages at Trump's federal takeover of DC police to fight crime President Trump places D.C.'s 3,400 police officers under federal control using emergency powers and proposes legislation to end no-cash bail practices."
    },
    {
      "url": "https://www.foxnews.com/politics/white-house-launches-federal-security-blitz-president-vows-end-dc-crime-plague",
      "text": "In an effort to crack down on crime in the nation’s capital, President Donald Trump is ramping up federal enforcement in Washington, D.C., and deploying additional federal law enforcement agents this week.\nBacked by a March executive order, the White House, respective federal agencies and local officials will work together to drive down D.C. crime.\nD.C. residents can expect an increase in federal enforcement starting as early as Friday, officials said.\n\"Washington, D.C., is an amazing city, but it has sadly been plagued by petty and violent crime for far too long,\" White House press secretary Karoline Leavitt wrote in a statement to Fox News Digital. \"President Trump is committed to making our nation’s capital safer and even more beautiful for its residents, lawmakers, and visitors from all around the world.\"\nDC US ATTORNEY SAYS ‘ENOUGH IS ENOUGH’ AS YOUTH CRIME PUTS SPOTLIGHT ON NATION’S CAPITAL\nTrump on Monday threatened to federalize Washington, D.C., calling for local minors and gang members over the age of 14 to be prosecuted as adults after a former Department of Government Efficiency (DOGE) employee reported being violently beaten in the city by two juveniles.\nA White House official told Fox News Digital the effort to revitalize the capital has been an ongoing priority for the president, who established the D.C. Safe and Beautiful Task Force through the \"Making the District of Columbia Safe and Beautiful\" executive order.\nFederal officials will monitor D.C.’s sanctuary city status to ensure compliance with federal immigration law and support the full accreditation of the district’s forensic crime laboratory to aid local investigations.\nTRUMP THREATENS TO FEDERALIZE DC AFTER EX-DOGE EMPLOYEE 'BIG BALLS' VIOLENTLY BEATEN\nThe task force is also providing assistance to the city's Metropolitan Police Department (MPD) to boost recruitment, retain officers and facilitate work with federal personnel to reduce crime.\nOther areas of focus include expediting the concealed carry permitting process in D.C., ending fare evasion and other crimes within the Washington Metropolitan Area Transit Authority system and reviewing prosecutorial policies on pretrial detention to ensure suspects who pose a genuine threat to public safety are detained.\nWATCH: TRUMP HINTS HE WILL FEDERALIZE DC SOON, BRING IN NATIONAL GUARD AFTER ‘BIG BALLS’ ATTACK\nOne of the most visible changes will be a heightened federal law enforcement presence in and around key locations in the city.\nOfficials said deployments will include areas including the National Mall, Lafayette Park, Union Station, Rock Creek Park and major parkways.\nCLICK HERE TO GET THE FOX NEWS APP\nThe task force has already made progress, using federal enforcement and the National Park Services to increase enforcement, arrest illegal immigrants and remove homeless encampments from parks and public spaces.\nOperational details had not been finalized as of Thursday afternoon."
    },
    {
      "url": "https://www.foxnews.com/apps-products?pid=AppArticleLink",
      "text": "Fox News is Everywhere.\nWatch Fox News Channel on all of your devices to keep up to date with the latest in news, politics, entertainment and more. On phones, tablets, wearables and TV, it's easy to stay connected anywhere.\niOS Devices\nAndroid Devices\nApple TV\nRoku\nChromecast\nAndroid TV\nAmazon Fire\nFubo TV\nApple Watch\nAmazon Echo\nGoogle Home\nFox News Go\nApple News\nAT&T TV Now\nYouTube TV\nHulu\nFacebook\nInstagram\nSamsung Devices\nSling TV\nVidgo\nSpotify\niHeartRadio\nFlipboard\nLinkedIn\nGoogle Newsstand\nNewsletters\nYouTube\nFAQ\nHow much data does Fox News Go use?\nFox News Go uses about 2GB per hour of SD viewing and 4GB per hour of HD viewing. This can vary depending on your device and internet connection. If you are concerned about your data usage we recommend not streaming over a cellular network and contacting your Internet or Cellular Service Provider.\nWhat broadcast quality will I get while streaming on my device?\nFox News will stream at the highest quality possible based on your device and internet connection quality. For the best quality we recommend streaming via Wi-Fi or 4G.\nWhat channels are available on Fox News Go?\nYou can Watch Fox News Channel on Fox News Go and Fox Business Channel on Fox Business Go"
    }
  ],
  "argos_summary": "Since August 7, over 100 arrests have been made in Washington, D.C. as part of President Trump's crackdown on crime, which includes federalizing the local police department and deploying approximately 800 National Guard troops. The initiative has drawn criticism from local leaders and Democrats, who argue that crime rates have been declining and that the federal takeover is unnecessary and politically motivated. Trump, however, claims that crime is out of control and insists that his actions are necessary to restore safety in the capital.",
  "argos_id": "V2OZFXSYL"
}