{
  "url": "https://www.usatoday.com/story/life/health-wellness/2025/08/13/cringe-summer-explained/85506760007/",
  "authorsByline": "Nicole Fallert",
  "articleId": "4f97412e919e4250b1bcc2b66977a987",
  "source": {
    "domain": "usatoday.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "VA",
      "county": "Fairfax County",
      "city": "McLean",
      "coordinates": {
        "lat": 38.9342888,
        "lon": -77.1776327
      }
    }
  },
  "imageUrl": "https://www.usatoday.com/gcdn/authoring/authoring-images/2025/07/01/USAT/84435531007-20250628-t-184132-z-558411414-rc-2-ubfaltvri-rtrmadp-3-peoplebezoswedding.JPG?crop=3119,1755,x0,y162&width=3119&height=1755&format=pjpg&auto=webp",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-13T14:03:51+00:00",
  "addDate": "2025-08-13T14:10:13.089767+00:00",
  "refreshDate": "2025-08-13T14:10:13.089768+00:00",
  "score": 1.0,
  "title": "Goodbye, 'brat summer.' It's time for 'cringe summer.'",
  "description": "The zeitgeist this summer is making us shudder with second-hand embarrassment, from Jeff Bezos to Labubus. Why? Welcome to \"cringe summer.\"",
  "content": "\"The Summer I Turned Pretty?\" More like \"The Summer I Turned Cringe.\"\n\nUnlike last year's \"Brat Summer,\" all about dancing out our messy side to Charli XCX's album, Summer 2025 has been one cringey moment after the next. Kissing billionaires teetering on water taxis at the Bezos Venice wedding. The unrelenting eye contact of a Labubu (or Lafufu). The shuddering horror of the Coldplay couple. President Donald Trump's awkward moment on stage with Chelsea after the team's FIFA Club World Cup victory. Travis Kelce wearing a construction vest in the ocean.\n\nAll these moments have us covering our eyes – but not necessarily for the same reason. What's \"cringe\" to one person may not bother another. Plus, for all you know, someone might think you're cringe. And some argue that's actually worth embracing. If the zeitgeist is so \"cringe,\" should we all just lean into being ourselves?\n\n\"Cringe\" happens when we see something awkward or humiliating and internalize that discomfort, according to Alicia M. Walker, professor of sociology at Missouri State University.\n\n\"You're doing something that is so gauche and so tacky and so lacking in self-awareness and you have no idea,\" Walker says, defining the term. \"You're not feeling embarrassed, so I'm feeling embarrassed for you.\"\n\nWe shudder, blush, giggle because we take on that embarrassment second-hand, Walker says. Take Lena Dunham's Netflix series \"Too Much,\" it's sex-obsessed characters made audiences recoil as they candidly discussed intercourse at work functions. Or \"The Summer I Turned Pretty\" fans watching through their fingers as mismatched characters slow danced at a college frat party.\n\nThe unabashed interactions in these shows make us reflexively cringe because they remind us of somewhere, sometime, we've been the gawky one, Walker says. We've all been the uninvited guest or the too-passionate dancer or the one caught on camera, and seeing these buried memories recast in pop culture takes us right back to that terrifying social trauma.\n\nIt's important to ask why we have such a strong aversion to being called cringe or seemingly cringe things, says Cassie Willson, 30, a Brooklyn-based comedian and content-creator.\n\nWe post \"cringe\" in social media comments to shame each other's idiosyncrasies, almost to the point it \"that becomes a little scary and dangerous,\" Willson says. Take how the internet mocks millennial cringe compilations, tallying the ways 30-somethings are un-cool.\n\n\"If you have a cringe reaction to something, it is worth listening to,\" says Willson. \"Write it down. Figure out the actual definition of cringe for you. We have to pay attention to how we react to the things we see.\"\n\nSome are taking to social media to say that \"being cringe\" can be empowering.\n\n\"If you have to be nonchalant around your friends, those aren't your real friends,\" said one TikToker encouraging others to \"be corny\" and be themselves out loud.\n\n\"We are discouraging them from setting themselves apart in any way,\" another TikToker said. \"Fear of cringe can create a fear of curiosity and discovery.\"\n\nAs summer turns to fall, take the opportunity to be cringey self, Willson says. We're \"climbing the cringe mountain,\" and no matter if people call you embarrassing, she says, you're being yourself.",
  "medium": "Article",
  "links": [
    "https://www.usatoday.com/story/shopping/best-streaming-deals-bundles-free-trials/83951337007/?utm_source=usat&utm_medium=content&utm_campaign=spike",
    "https://www.tiktok.com/@cassiewillson/video/7488454869334920494?is_from_webapp=1&sender_device=pc&web_id=7519146009022088726",
    "https://www.usatoday.com/story/life/health-wellness/2025/07/17/coldplay-concert-couple-viral/85259048007/",
    "https://www.usatoday.com/story/life/health-wellness/2025/08/01/attention-span-rehab-zentangle-drawings-are-going-viral-on-tiktok/85413574007/",
    "https://www.usatoday.com/story/entertainment/celebrities/2025/07/01/jeff-bezos-wedding-billionaire-analysis/84427203007/",
    "https://www.usatoday.com/story/life/health-wellness/2025/07/23/the-summer-i-turned-pretty-phenomenon/85323290007/",
    "https://www.usatoday.com/story/money/2025/08/04/labubu-vs-lafufu-popmart-differences-fake/85372706007/",
    "https://www.tiktok.com/@gq/photo/7537674945552223518",
    "https://www.usatoday.com/story/life/health-wellness/2025/07/16/too-much-sex-lena-dunhams-netflix-show-intimacy/85237571007/",
    "https://www.usatoday.com/picture-gallery/life/health-wellness/2025/07/30/ellie-for-the-girls-nyc-dating-scene/85427488007/",
    "https://www.usatoday.com/news/politics/donald-trump/",
    "https://www.tiktok.com/@grant2191/video/7532564155304348941?is_from_webapp=1&sender_device=pc&web_id=7519146009022088726",
    "https://www.usatoday.com/story/entertainment/pop-culture/2024/07/25/what-is-brat-summer-meme-charli-xcx-kamala-harris/74541348007/",
    "https://www.usatoday.com/story/sports/soccer/2025/07/13/trump-chelsea-club-world-cup-trophy-celebration/85173092007/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "cringe summer",
      "weight": 0.09210076
    },
    {
      "name": "millennial cringe compilations",
      "weight": 0.08067322
    },
    {
      "name": "Cringe",
      "weight": 0.07969574
    },
    {
      "name": "cringe",
      "weight": 0.07969574
    },
    {
      "name": "Alicia M. Walker",
      "weight": 0.06486024
    },
    {
      "name": "social media comments",
      "weight": 0.062193543
    },
    {
      "name": "Brat Summer",
      "weight": 0.06205968
    },
    {
      "name": "social media",
      "weight": 0.06006001
    },
    {
      "name": "Walker",
      "weight": 0.05762112
    },
    {
      "name": "cringey self",
      "weight": 0.05761587
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Lifestyle"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.8427734375
    },
    {
      "name": "/Arts & Entertainment/Music & Audio/Rock Music",
      "score": 0.7666015625
    },
    {
      "name": "/Arts & Entertainment/Music & Audio/Pop Music",
      "score": 0.5830078125
    },
    {
      "name": "/Arts & Entertainment/Music & Audio/Music Reference",
      "score": 0.4990234375
    }
  ],
  "sentiment": {
    "positive": 0.06380941,
    "negative": 0.6887008,
    "neutral": 0.24748981
  },
  "summary": "The term \"cringe\" is coined when we see something awkward or humiliating and internalize it, according to Alicia M. Walker, professor of sociology at Missouri State University, defines it as \"gaudlish\" and \"tacky\" behavior. While some argue that being \"crackled\" may cause others to feel embarrassed, others argue that it's worth embracing. Some social media users have argued that \"being cringe\" can be empowering. Comedian Cassie Willson, a Brooklyn-based comedian and content-creator, suggests that as summer turns to fall, embrace being yourself.",
  "shortSummary": "The Summer of 2025 has been marked by cringe-inducing moments like this one called \"The Summer I Turned Cringe,\" urging embracing self-expression, highlighting societal sensitivities and social media acceptance.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "f3a49ff111764977bac15da5f039fe96",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.usatoday.com/story/life/health-wellness/2025/07/16/too-much-sex-lena-dunhams-netflix-show-intimacy/85237571007/",
      "text": "Lena Dunham's 'Too Much' on Netflix and our obsession with sex talk\nIn Lena Dunham's new Netflix comedy \"Too Much,\" sex isn't treated in the way it is in the period-drama fantasies the show's protagonist Jessica (Megan Stalter) adores. There's no Mr. Darcy walking wistfully through the morning mist when she relocates her life from New York City to London following a break up.\nInstead, \"Too Much\" subverts Austenian propriety and makes sex the main catalyst. The show's characters seemingly discuss it constantly, everywhere without constraint: Jessica walks through the London fog on FaceTime with her mother, Lois (Rita Wilson), detailing her sex life with her new British beau. Her coworkers talk about who'd they sleep with at a company party. Jessica's boss Jonno Ratigan (Richard E. Grant) and his wife, Ann (Naomi Watts), joke about oral sex in front of his employees. Her sister's ex-husband, Jameson (Andrew Rannells), laments his sexless life post-parenthood. Even her grandmother, Lois (Rhea Perlman), makes a foot massage suggestive.\nIs it all a bit \"Too Much\"? It might be for you. Or maybe it's just right. Some people are more open to talking about sex and others are not. And while some may find Dunham's approach too extreme to be relatable, the show is a reminder it's best in your own life to gauge comfort and work from there.\n\"Discomfort isn’t necessarily a bad thing, especially when we're watching television or film,\" said Alicia M. Walker, associate professor of sociology at Missouri State University.\nAnd there's also the chance the show is meant to make us feel like it's too much, she said. When that happens, Walker said, we need to ask ourselves as viewers, \"What is this discomfort trying to say to me?\"\nIs it 'Too Much' sex?\nThe conversations about sex in \"Too Much\" aren't that different from the details viewers may have seen on other shows like \"Sex and The City\" and, of course, Dunham's \"Girls.\" It's where those conversations happen and with whom that make us react, Walker explained. And the messy lack of boundaries is likely a message about society now: We're highly connected online but disconnected in real life.\n\"And the fact Jessica's a woman,\" Walker said. \"That makes people squirm. ... We still expect women to be private and polished and quiet about their desire, and this show really challenges that.\"\nThe degree of sexual oversharing shows that for people who don't have a solid support network, they look to the closest possible space to open up, Walker said.\nTake the cue and turn off your phone while watching \"Too Much,\" Walker suggested, and focus on the reason why Dunham filled Jessica's world with highly individualized personalities who grapple so openly with their intimacy. This is what happens to us as innately social beings without social outlets.\n\"What's happening in the show is a bigger commentary on our social lives in general,\" she said. \"You have to search for [the meaning] between these moments of cringey self-disclosure.\"\nHow to talk about sex with the people in your life\nFor anyone looking to open up more about sex, Walker recommends finding people with whom you can be your true self.\n\"It's something you have to really practice,\" Walker said. Jessica speaks out loud, recording videos with her inner thoughts to create a diary of sorts. It's not a bad tactic, Walker noted. \"Practicing with yourself is a really important first step. Then look at your relationships and figure who might be a safe person.\""
    },
    {
      "url": "https://www.usatoday.com/story/sports/soccer/2025/07/13/trump-chelsea-club-world-cup-trophy-celebration/85173092007/",
      "text": "Chelsea put on show in Club World Cup final — only to have Trump steal their moment\nEAST RUTHERFORD, N.J. — Chelsea star Cole Palmer was like much of the world wondering why President Donald Trump was obliviously standing in the middle of their trophy celebration after winning the FIFA Club World Cup.\n“Wait, wait, what’s he doing?” Palmer said to Chelsea captain Reece James before the customary celebration soccer clubs perform when commemorating a major title.\n“Are you going to leave?” James asked Trump before hoisting the golden-globed trophy. Trump smiled and clapped amongst the Chelsea players before FIFA president Gianni Infantino eventually pulled him away.\n“I knew he was going to be there, but I didn't know he was going be on the stand where we lift the trophy. So, I was a bit confused,” said Palmer, the Club World Cup Golden Ball winner after scoring two goals with an assist in Chelsea’s dominant 3-0 win over the reigning UEFA Champions League winners Paris Saint-Germain on Sunday, July 13.\nAdded James: “I thought he was going to exit the stage, but he wanted to stay.”\nLeave it to Trump to deliver this perplexingly hilarious and cringeworthy moment that easily is the lasting image of this competitive, yet controversial, Club World Cup hosted in the United States this summer.\nThe Club World Cup showed the U.S. is capable of being a soccer nation, but Trump’s unawareness shows how far away soccer is in this country compared to the NFL, NBA, MLB and NHL among sports viewers.\nThe World Cup will take over the country next summer — from June 11-July 19, 2026 — with Trump and Infantino continuing to be the leading faces outside of some players such as Lionel Messi and Cristiano Ronaldo (if they both play).\nTrump was booed loudly multiple times by the 81,118 fans at MetLife Stadium — when he first appeared on the Jumbotron next to Infantino in a suite and when he walked on the field for the postgame festivities.\n“It was a little bit of an upset, I guess you would say,” Trump told reporters on the tarmac after the game. “But it was a great, great match, very well played, tremendous crowd.”\nInfantino believes his budding relationship with Trump is necessary in order to run massive tournaments such as the Club World Cup and World Cup.\nFIFA estimates 6.5 million people are expected to attend World Cup matches next year, while ongoing immigration issues and customs raids leave an uninviting impression on many wishing to represent their countries in this country.\nFrom a sporting perspective, FIFA still has plenty to do to ensure a positive experience for the players and clubs involved in the World Cup.\nBefore Trump’s poor soccer etiquette stole the show, the stories of the Club World Cup were photos of empty seats at NFL-sized stadiums, how players coped with playing in high temperatures in the height of the summer heat, and how the tournament overloaded the players’ packed schedules.\nNearly 2.5 million fans attended Club World Cup matches, Infantino said before the final.\nMore important, the Club World Cup culminated in a final that delivered the unexpected.\nChelsea shocked PSG with three goals in the first 42 minutes — despite initially being a +460 underdog, according to BetMGM.\nPalmer is already a household name in England and Europe. But this breakout performance in the Club World Cup final put the rest of the world, including the United States, on notice of the mild-mannered, softspoken star with the coldest goal celebration in the sport.\n“Obviously, it’s a great feeling — even better because everyone doubted us before the game,” said Palmer, who folds his arms and rubs his biceps to warm himself up after each goal metaphorically making light of his name — and his game — being ice cold.\nThis was supposed to be the other way around.\nHeading into the final, PSG was lauded for being the best team in the world. The Parisians won every trophy they could earlier this year in dominant fashion.\nMany believed they would cap their historic season by waltzing into the venue, and putting on another clinical performance like they did when they won the Champions League final 5-0 against Inter Milan, beat Lionel Messi and Inter Miami 4-0 earlier in the Club World Cup and dominated Real Madrid 4-0 in the semifinals.\nInstead, Palmer and Chelsea put on a show with a trophy celebration soccer fans will surely remember when they reflect on the Club World Cup.\nAt least Trump has a year to figure out how he’s going to top this moment, or wisely bow out of the way when the World Cup trophy is awarded after the final next year.\nThe biggest stories, every morning. Stay up-to-date on all the key sports developments by subscribing to USA TODAY Sports' newsletter."
    },
    {
      "url": "https://www.usatoday.com/story/life/health-wellness/2025/07/23/the-summer-i-turned-pretty-phenomenon/85323290007/",
      "text": "The cult of 'The Summer I Turned Pretty', explained\nBreanna Quigley thought of everything.\nFor her watch party last week for the debut of \"The Summer I Turned Pretty\" Season 3, the 24-year-old in Charlotte, North Carolina, had custom cookies, matching pool floats, a popcorn machine, a custom painted banner, a big speaker, seashell place mats, a fish net table runner, blue hydrangeas ... the list goes on.\nEach item was a reference to the show about a love triangle between Belly Conklin (Lola Tung) and brothers Conrad Fisher (Christopher Briney) and Jeremiah Fisher (Gavin Casalegno) as they navigate life, growing pains and one immeasurable loss.\nBlue water appeared on Quigley's blow-up TV screen as she and her friends watched from her pool, chimes sounding as the opening credits played like a call to worship for the devout fans of Jenny Han's fan-favorite novels-turned-Amazon Prime Video series.\nQuigley, who dropped $350 on her event, is among many fans gathering at one another's homes and public venues weekly to enjoy the guilty pleasure of watching Belly navigate her love for two boys she's known her whole life – and that each present a different future for her.\nThe watch parties are pure sun-soaked indulgence for viewers who know deep in their souls whether they're Team Jeremiah or Team Conrad – and are ready to present a thesis as to why. Series creators even issued a foreboding warning imploring fans to refrain from online harassment as the angst of the season plays out.\n\"I think the show has such a following because of how it makes you feel,\" Quigley said. \"Everyone loves summer romance and I feel a lot of people can relate and love to see Belly choose between brothers. It’s funny because the show can be pretty cringey but it’s cute.\"\nEmphasis on the cringe. Some viewers are really embarrassed about the degree of investment they have in Season 3, despite watching these young lovers through their fingers.\n\"I'm one episode in and already cringing and very uncomfy,\" posted one audience member.\nWhen Belly and Jeremiah middle-school-style slow dance to \"Dilemma\" by Kelly Rowland and Nelly at a college frat party, one viewer physically twinged with second-hand shudders. Fans' significant others are watching from the other room, stunned and bewildered by the dynamics of a girl who loves two siblings. Bearing witness to the \"icks\" on screen are a test of endurance.\nBut why do we watch anyway, and get so invested? It reminds us so much of our own loves, the ones we lost or never had, according to Alicia M. Walker, professor of sociology at Missouri State University.\n\"Maybe we're cringing, but we might be a bit jealous, too,\" Walker said.\nWho wouldn't want to experience love for the first time against the lustful backdrop of fictional Cousins Beach, an idyllic East Coast town, Walker said. The raw unabashed relationships on screen, while we recoil, may remind viewers of any age of the significant impact of being chosen for simply being yourself, Walker said.\n\"The show doesn't just depict first love, it restores its emotional weight,\" Walker said. \"The show almost doesn't feel like fiction, it feels like memory.\"\nThe cult of \"TSITP\" is especially powerful because its ethos juxtaposes our cultural zeitgeist, one deprived of connection and defined by division, she said. We want something we can all gather around right now and root for, awkwardness included, she said.\n\"It ends up being emotional comfort food during this time,\" Walker said. \"The cult following around the show really shows how starved we are for something that we can feel, not just watch. The characters become avatars for our own longing, heartbreak, hopefulness and grief ... Whether you're 17 or 57, that hunger for connection, clarity and care is real and this show feeds that.\""
    },
    {
      "url": "https://www.usatoday.com/story/entertainment/pop-culture/2024/07/25/what-is-brat-summer-meme-charli-xcx-kamala-harris/74541348007/",
      "text": "What is 'brat summer' and why the Charli XCX meme has taken over, explained\nWelcome to FTW Explains, a guide to catching up on and better understanding stuff going on in the world. Have you seen some stuff about \"brat summer\" and something about a Charli XCX meme and how Kamala Harris is somehow being called \"brat\"? And you’re very confused about that whole thing? Don’t worry. We’re here to help.\nI think we just summed it up above, but: yeah. \"Brat\" is all the rage right now, from music to a meme, and we're here to help you understand what the heck that means (full disclosure: I was one of those people until recently!).\nLet's dive in:\nWhat the heck is \"brat\"?\nBritish singer/songwriter Charli XCX just released her newest album in June. Guess what? It's called Brat. It has a green cover, which has led to a lot of people doing stuff like this:\nPeople are also doing a TikTok dance to the song Apple and it is so good:\nOK, but what is \"brat summer\" then?\nIn the tradition of other trends we've seen like \"Hot Girl Summer,\" it's a way of embodying the coolness of that trend. So whatever you're feeling while listening to Brat, you're embodying that this summer.\nWhy are people calling Kamala Harris \"brat\"?\nGood question! It's a way of calling her cool -- Charli XCX tweeted as much -- although there's some confusion around that.\nWait, they're not calling her a brat, right?\nCorrect.\nWow, this is all a lot.\nThat's brat summer for you.\nMore Pop Culture!\nIs SNL new tonight on February 22, 2025? Here's the answer.\nStrands hints today: Clues and answers on Saturday, February 22 2025\nConnections hints, clues and answers on Saturday, February 22 2025"
    },
    {
      "url": "https://www.usatoday.com/story/entertainment/celebrities/2025/07/01/jeff-bezos-wedding-billionaire-analysis/84427203007/",
      "text": "The billionaire wedding photo op and depthless parade of Jeff Bezos' controversial wedding\nVenice or a movie set, no one would have known the difference.\nThe Italian city, known for is unique canals and historic architecture, felt more like a prop in a play than part of a real-life love story as celebrities draped in designer ensembles carefully teetered into water taxis to sail toward the luxe nuptials of Jeff Bezos and Lauren Sánchez Bezos last weekend. Everyone in attendance got the best photos – bride and groom included – but to the outside onlooker something was amiss.\nThe affair, which ended Saturday with its third official day of festivities, is estimated to have cost some $50 million.\nThe depthless expense culminated a deluge of events facing many Americans: The country held its breath and doomscrolled in fear of war with Iran, endured record heat, witnessed charged protests over President Donald Trump's immigration policies, heard major Supreme Court decisions about reproductive health and saw Zohran Mamdani (who said on June 29, \"I don't think we should have billionaires\") win New York City's mayoral Democratic primary. Meanwhile, the city of Venice erupted in protests by locals and activists who saw the Bezos wedding as a sign of garish commodification of a fragile city. And that's a smattering of the news from last week.\nThe atmosphere of whiplash could explain our numbness. When social media timelines showed the world's richest zooming across Venetian waters to the wedding venue on the island of San Giorgio, its lack of substantial meaning or cultural impact is likely why so many hated it.\nIt's OK if you enjoyed gobbling up images of the richest people in the world in their fanciest attire. And we naturally seek fantasy in moments like these, according to culture journalist Louis Pisano (who was blocked on Instagram by Sánchez after posting his impressions about the wedding). But this wedding didn't provide sentimental escapism, he said – it was a chilly reminder there's a billionaire-dollar world we'll never dream of inhabiting.\n\"It felt extremely exploitative, which turned off any audience from the get-go,\" Pisano says. \"The public had no bandwidth.\"\nThe Bezos wedding was an Italian melodrama we've seen before\nThe Italian celebrity wedding is a formula we've already experienced, Pisano says.\nThe wedding heavily sampled Ye (formerly Kanye West) and Kim Kardashian's pan-European nuptials in 2014, which saw Parisian pre-wedding events, a rehearsal dinner in Versailles and a Florence ceremony. The Bezos-Sánchez affair mapped itself along this Kardashian inspiration, mirroring Kim's highly-visible Parisian bachelorette party and featuring a performance at the main event by Mateo Bocelli, son of Andre Bocelli, who famously sang at both Kim and Kanye's and sister Kourtney Kardashian's weddings, Pisano points out.\nReference spawns much creativity in the world of fashion and culture (Kim expressed approval of the event, calling it \"magical\"). But somehow the Italian drama didn't hit the same tone. While not everyone is a Kardashian-West fan, audiences engaged with their wedding because they feel they knew the bride and groom, Pisano says, from watching the reality star and her family on TV to listening to the rapper's music.\n\"All of that created this worldbuilding around their wedding and their marriage … to see how far both of them came,\" Pisano says.\nTheir wedding was innovative for 2014, lifting worlds traditionally reserved for magazine pages onto social media. But this time, the parade felt vapid.\nThe event seems to have desperately wanted a spot in the canon of celebrity weddings, says Discoursted newsletter writer Pisano. Fans approved as lifelong bachelor George Clooney finally (and romantically) tied the knot in Venice in 2014 to accomplished lawyer Amal Clooney. Or Nick Jonas and Priyanka Chopra's multiday party melding ritual with rich visuals. Or, most recently, the billionaire Ambani wedding in India that drew former U.S. officials, celebrities and, of course, Rihanna to its epicenter. They weren't just icing on the wedding cake, but cultural touchpoints realized through marriages.\nBut Bezos and Sánchez's wedding lacked a story to \"root for,\" Pisano says. Rather, the couple invited a 200-person guest list that felt \"random,\" if not transactional, Pisano says, with names like Sydney Sweeney, Oprah Winfrey, Bill Gates, Ellie Goulding and a solo Orlando Bloom.\n\"It was all very strategic from everybody's side,\" he says. \"Was it believable that all of these people were such good friends? Absolutely not.\"\nThe guest list drew reactions across the internet.\n\"Does she know them?\" one TikToker mused of Sweeney's invite. Leonardo DiCaprio was called out for attending a \"carbon-intensive billionaire's wedding\" in apparent opposition to the actor's climate activism. Commentator Blakely Thornton even went as far as to call the guests \"confirmed losers\" seeking gratification and status.\n\"I have a newly found disrespect for all of the celebrities who attended the Bezos wedding,\" one TikToker said. \"Even if you don't think about the politics of it all, it's just an utterly swagless move. Now we all know who's tacky and tasteless.\"\nAnd those guests didn't come cheap: The cost of this single affair could cover the cost about 1,515 weddings in the U.S. today. As couples weigh economic uncertainty while planning their own weddings, they couldn't relate. Pisano says the grandeur felt incongruent with current trends favoring smaller, more thoughtful weddings.\nAnd then there's the fact the pair waved and blew kisses as they boarded motorboats while protests raged across the city, decrying environmental and antitourist messages to the overcrowded city that is struggling with rising water levels. While the couple donated to local Venetian charities, Pisano says he's skeptical how much impact that holds.\n\"For one of the richest men in the world, to go to one of the most troubled cities in the world, and contribute to that, doesn't help bring public goodwill toward them,\" he says.\nJeff Bezos' bride and a fashion message not received\nThe fashion is also a reason why the wedding was seemingly detached for people. Sánchez donned numerous looks over the multiday spectacle, but perhaps most notable was her wedding gown from Dolce & Gabbana, designers who've had their own controversies.\nThe more conservative dress featured a high-neck, adorned with 180 silk chiffon-covered priest buttons paired with a tulle-and-lace veil, according to a Vogue magazine exclusive.\nThe buttoned-up 1950s-inspired look was nod to Italian actress Sophia Loren. While the bride recognized the look was a \"departure,\" for her, Pisano says the style was too jarring of a twist from the peekaboo lacy bra Sánchez wore to President Donald Trump's inauguration earlier this year.\n\"It's such a jump that feels inauthentic to her,\" Pisano says, noting her \"girl boss bombshell persona.\"\nDonatella Versace, who has been an outspoken LGBTQ+ advocate, also dressed the bride for one of the wedding party events, in spite of Amazon's rollback of diversity, equity and inclusion measures.\nTo her credit, Sánchez wears a heavy mantle trying to fit in as such a visible figure, but people were left wondering who this woman is supposed to be to them, Pisano says.\n\"She's looking for legitimacy ... She wants to switch into 'icon mode.'\"\nBut was it a fit?\nThe couple desperately wanted to recreate an image from an outdated attention economy. The curation left the Bezos-Sánchez wedding feeling tired, working too hard to squeeze itself into a size it was starving for."
    },
    {
      "url": "https://www.usatoday.com/story/life/health-wellness/2025/07/17/coldplay-concert-couple-viral/85259048007/",
      "text": "TikTok of couple caught on camera at Coldplay concert goes viral. The internet is determined to find 'cheaters.' Why?\nColdplay’s live performance of “Sparks” went viral last month as the heartbreak anthem resonated among yearners. Now, the band is back under the spotlight, but not for Chris Martin’s singing.\nA couple caught on camera at a Coldplay concert in Foxborough, Massachusetts, on July 16 has the internet up in arms. With nearly 80 million views and counting, the video shows the couple swaying and smiling, but they quickly hide from the camera after landing on the Jumbotron.\n“Uh oh, what? Either they’re having an affair or they’re just very shy,” Martin, 48, joked.\nSpeculation ensued in the comments, and TikTok users made efforts to identify the couple, with commenters investigating their supposed jobs, employers and marital status. USA TODAY has reached out for comment.\nMassive media accounts like Pop Crave and Pop Base spread the alleged affair to millions of followers on X –– along with the rumored names and titles of the couple.\nAs we seep deeper into surveillance culture, people are subjected to increased scrutiny online. Every wrong action, suspicious glance or physical attribute can be picked apart by millions of people on social media. TikTok sleuthing, in particular, appears to have a sharp focus on exposing cheaters.\nAdd this incident to a growing trend on social media, where internet sleuths are going out of their way to find strangers they deem deserving of a public shaming. Some on TikTok are accusing their airplane seatmates of cheating on their spouse; others post detailed accounts of meeting men on their bachelor parties to alert their fiancées they are being unfaithful. \"Are We Dating the Same Guy\" Facebook groups alert women to allegedly toxic men, and “loyalty testers” have made a living off of catching cheaters in the act.\nThough much of this seems well-intentioned, experts say becoming an amateur social media detective isn't the greatest idea, as you might wind up causing more harm than good.\n\"They justify violating the privacy of the alleged offender because they have accepted the story as true and, thus, prematurely judged the individual as guilty and undeserving of privacy rights,\" psychologist Reneé Carr previously told USA TODAY.\nWhy do we care about these strangers’ personal lives?\nAt the surface level, spectators simply love the drama. But beneath that, psychologists say society has developed a “gotcha mentality” that fuels this discourse.\n\"We love to partake in other's messy lives,\" Erica Chito-Childs, senior associate dean of the College of Arts & Sciences at Hunter College, previously told USA TODAY. \"Partly because it makes us feel better about our own lives and/or it resonates with what we are adamantly for or against, thanks to the ever more accurate algorithms.\"\nThe quick snap of a camera or even observing someone opening an app is fodder for nosy observers to gain a few details about someone's life. Nothing stops them from posting about it – and people are quick to add to the discourse, trying to right supposed wrongs.\n\"With the birth of cancel culture and an increase in self-entitlement, a large part of society has adopted a 'gotcha' mentality as well as a hypersensitivity to offense and any perceptions of injustice,\" Carr explained. \"For the social media audience, this is even more so.\"\nSleuthing can have unintended consequences\nJust because we have the tools to find people faster doesn’t mean we should.\nSleuthing and the online hate campaigns that follow can lead to negative consequences. \"Sharing sensitive information that a person intended to keep private can adversely impact that person’s mental health, and it can put them at risk of being harassed, bullied or harmed physically,\" said Brad Fulton, associate professor of management and social policy at Indiana University – Bloomington.\nThe Coldplay couple reacted suspiciously — had they simply smiled or turned their heads rather than bolting away from the cameras, people may have brushed it off as a shy duo. But even if they are having an affair, does the crime fit the punishment?\n\"I highly caution others to not be so eager to bandwagon, pick sides and jump to conclusions when presented with limited information,\" Chase Cassine, licensed clinical social worker, explained. \"You may be presented with a flawed, biased and one-sided perspective where pertinent information has been concealed or omitted.\"\nContributing: David Oliver, USA TODAY"
    },
    {
      "url": "https://www.usatoday.com/story/life/health-wellness/2025/08/01/attention-span-rehab-zentangle-drawings-are-going-viral-on-tiktok/85413574007/",
      "text": "'Attention rehab videos' are going viral. See why.\nDo you find yourself daydreaming during office meetings? Feeling a constant urge to click or scroll? Can’t stay still during a conversation?\nYou may need attention span rehab.\nLos Angeles-based artist Lizi Phoenix is going viral on TikTok for her calming drawing series, where she guides viewers through soothing art exercises as a means of boosting their attention span. On a platform dominated by quick-hit content, Phoenix’s videos, which are sometimes upwards of eight minutes, break the mold — and are helping viewers end the cycle of doom scrolling.\n“This evening we’ll be doing another watercolor Zentangle painting,” Phoenix starts as she flips through a notebook filled with twisting paintings of hearts, stars, swirls and diamonds before settling on a soft turquoise color for her new page. “This is going to be a nice soothing video for you to chill out to and get lost in the zone for a little bit.”\nChild psychiatrist and Yale School of Medicine professor Yann Poncin says the videos are resonating because they provide a respite from short-burst content.\n“The algorithm is created in a way that it does feed you novel information, and that novelty is what keeps you there,” Poncin says. “Her TikTok site… is getting away from that and having a slower process.”\nWhy our attention spans are shrinking\nAs our lives and workplaces become more tied to digital devices, our attention spans are shrinking.\nThis is most extreme in people under 30, who are the largest demographic of social media users. Nearly half of teens say they’re online constantly, according to 2024 data from the Pew Research Center, and 72% of teens say they sometimes or frequently check their notifications as soon as they wake up.\nTechnology allows for constant avenues of distraction and interruption during everyday tasks, whether it’s a text message pinging your GPS’s bluetooth configuration while driving or getting pulled away by Slack and Microsoft Teams messages during a task. The increasingly common habit of second screening — like texting or browsing social media while watching a TV show — further fragments the attention span.\nWhile multitasking might feel beneficial, doing multiple tasks at once can send the brain into cognitive overload.\n“I'm someone who has lots of tabs open in my mind all the time, which is helpful, but it can be really, really draining,” Phoenix says. “I see the zentangles as a moment where I'm able to recharge.\nSmartphone addiction is heavily tied to social media algorithms that feed curated content to users, but can also be impacted by color saturation, notifications and refresh screens. Over time, technology addiction rewires the brain to expect higher dopamine, depleting the brain’s cognitive patience and threshold for tolerating frustration in the process.\n“If we over expose ourselves to these sort of easy dopamine hits, cheap dopamine hits when we're younger, then we're resetting our homeostasis where we can only feel good by having access to these items,” Poncin says.\nPhoenix wants her videos to be a reset that helps people “snap out of that dopamine chase.”\n“I had no idea this was 8 minutes long. I watched the entire thing and thought it was three minutes at most,” one person commented under a video of olive green heart tracings. “This video was like a nap for my brain,” said another.\nHow to DIY your own attention span rehab\nPoncin says training the brain to be able to relax is an important part of regulating attention span. He suggests limiting smartphone distraction throughout the day in small interventions, like leaving your phone at your desk instead of bringing it on your bathroom break or watching a full TV episode without checking your notifications.\n“I always say that being present is just as beneficial as being productive,” Phoenix says. “When you're doom scrolling, you're not actually resting, because there's so many emotions that pop up with every single different video.”\nFor those who want to try their own attention span rehab, Phoenix says the first step is carving out intentional time to take a break and setting up a conducive environment. She likes to draw while listening to a podcast or audio book — she’s currently fixated on Nora Ephron — with a hot latte nearby.\n“I kind of envision a bubble around myself, and while I'm zentangling, this is my safe space to work,” Phoenix says.\nShe says to set an intention, whether that’s a thought to focus on or an amount of time to draw for. Then, she hits “do not disturb” on her phone and concentrates on the methodological nature of the drawings.\n“It just does force everything to fall away, because I need to focus on the specific moment, the specific curve I'm making,” Phoenix says.\n“Rachel Hale’s role covering Youth Mental Health at USA TODAY is supported by a partnership with Pivotal and Journalism Funding Partners. Funders do not provide editorial input. Reach her at rhale@usatoday.com and @rachelleighhale on X."
    }
  ],
  "argos_summary": "The article explores the concept of 'cringe' in contemporary culture, highlighting various awkward moments from summer 2025, including celebrity events and social media reactions. Experts suggest that cringe reflects our discomfort with social awkwardness, often reminding us of our own past experiences. The piece also discusses how some individuals are embracing their 'cringe' moments as a form of empowerment, encouraging authenticity in social interactions. Additionally, it touches on the popularity of shows like 'The Summer I Turned Pretty' and Lena Dunham's 'Too Much,' which evoke strong emotional responses and resonate with viewers' personal experiences.",
  "argos_id": "Y4OZNQ42Q"
}