{
  "url": "https://www.benzinga.com/news/topics/25/08/47092144/former-google-employees-ai-startup-openart-raises-5-million-as-6m-users-create-brainrot-videos-in-jus",
  "authorsByline": "Paula Tudoran",
  "articleId": "ac605570d60b46a38fb52a54fcb17eeb",
  "source": {
    "domain": "benzinga.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "MI",
      "county": "Wayne County",
      "city": "Detroit",
      "coordinates": {
        "lat": 42.3315509,
        "lon": -83.0466403
      }
    }
  },
  "imageUrl": "https://cdn.benzinga.com/files/images/story/2025/08/13/A-Mesmerizing-3d-Abstract-Multicolor-Vis.jpeg?width=1200&height=800&fit=crop",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-13T10:16:06-04:00",
  "addDate": "2025-08-13T14:27:23.514316+00:00",
  "refreshDate": "2025-08-13T14:27:23.514317+00:00",
  "score": 1.0,
  "title": "Former Google Employees' AI Startup OpenArt Raises $5 Million As 6M Users Create 'Brainrot' Videos In Just One Click",
  "description": "OpenArt, founded in 2022 by two former Google employees, now powers a viral AI craze that transforms wild ideas, such as a shark wearing sneakers o...",
  "content": "OpenArt, founded in 2022 by two former Google employees, now powers a viral AI craze that transforms wild ideas, such as a shark wearing sneakers or a ballerina with a cappuccino head, into \"brainrot\" videos with a single click, and the platform already has roughly 6 million monthly active users, TechCrunch reports.\n\nThe company's new \"one-click story\" feature, launched in open beta, lets users turn a single input, whether a sentence, a script, or even a song, into a one-minute video with a complete story arc, for everything from a lighthearted TikTok clip to a serious explainer or YouTube music video, even advertising. TechCrunch says that creators can select from three templates: Character Vlog, Music Video, or Explainer, to build their video story.\n• The same firms that backed Uber, Venmo and eBay are investing in this pre-IPO company disrupting a $1.8T market — and you can too at just $2.90/share.\n• ‘Scrolling To UBI' — Deloitte's #1 fastest-growing software company allows users to earn money on their phones. You can invest today for just $0.30/share.\n\nCharacter Vlog starts by uploading an image of your character and entering a prompt. According to TechCrunch, uploading a song allows the AI to parse the lyrics and create an animated story aligned with the music, such as illustrating flowers blooming, all automatically.\n\nUsers can refine their projects by returning to a storyboard mode and tweaking prompts for individual clips. TechCrunch says that OpenArt aggregates over 50 AI models, including DALLE-3, GPT, Imagen, Flux Kontext, and Stable Diffusion, giving creators control over the tools behind each production.\n\nOpenArt emphasizes that one of its defining strengths is keeping characters visually consistent throughout an entire video, a challenge many AI tools struggle to address. Rather than leaving creators with disconnected clips that must be manually stitched into a story, TechCrunch says the platform is designed to maintain both visual and narrative flow from start to finish.\n\nTrending: If there was a new fund backed by Jeff Bezos offering a 7-9% target yield with monthly dividends would you invest in it?\n\n\"A problem that a lot of AI couldn't really handle well is to have the character consistent in the same video…If you don't have the same character, then it's hard to get immersed in the story,\" OpenArt co-founder and CEO Coco Mao told TechCrunch.\n\nMao added that when users upload protected IP characters, \"by default, the models we use will reject them, and it's not able to produce the IP character, but sometimes it slips.\" Mao said they are open to licensing discussions with major IP holders.\n\nTechCrunch reports that Character Vlog prompts featuring characters like Pikachu, SpongeBob, and Super Mario may raise legal risk. If a video infringes copyright, it may be removed and the creator held liable, potentially facing legal action from rights holders.\n\nSee Also: Bill Gates Warned About Water Scarcity. This Award-Winning Device Just Might Fix It — And You Can Invest Early\n\nCredit-Based Pricing, $5 Million in Funding, On Track for $20 Million Revenue Run Rate\n\nOpenArt uses a credit-based subscription model, TechCrunch says. The basic plan is $14 per month for 4,000 credits, which include up to four One-Click stories, 40 videos, 4,000 images, and four characters.\n\nFor $29 per month, users can access 12,000 credits, including up to 12 One-Click stories. The \"Infinite\" plan costs $56 per month for 24,000 credits. There is also a team plan available at $35 per month per member.\n\nTo date, OpenArt has raised $5 million in funding from Basis Set Ventures and DCM Ventures. The company says it is generating positive cash flow and expects to surpass an annual revenue run rate of $20 million.\n\nRead Next: Kevin O'Leary Says Real Estate's Been a Smart Bet for 200 Years — This Platform Lets Anyone Tap Into It",
  "medium": "Article",
  "links": [
    "https://www.benzinga.com/money/pacaso",
    "https://www.benzinga.com/money/arrived-private-credit-fund",
    "https://www.benzinga.com/money/mode-mobile-2",
    "https://www.benzinga.com/personal-finance/crowdsourcing/25/06/46133986/cheat-on-everything-viral-ai-startup-cluely-lands-15m-from-andreessen-horowitz-after-its-ceo-was-suspended-from-columbia",
    "https://www.benzinga.com/go/fundrise",
    "https://www.benzinga.com/go/robinhood-retirement",
    "https://benzingapartners.go2cloud.org/aff_c?offer_id=587&aff_id=1",
    "https://openart.ai/",
    "https://www.benzinga.com/news/topics/25/06/45895934/vercept-raises-16m-with-google-legend-and-dropbox-co-founder-backing-to-build-future-of-workflows-with-vision-based-mac-app-called-vy",
    "https://www.benzinga.com/money/wiseradvisor-retirement-planning-bzwidget",
    "https://techcrunch.com/2025/08/08/former-googlers-ai-startup-openart-now-creates-brainrot-videos-in-just-one-click/",
    "https://www.benzinga.com/money/mogul"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "protected IP characters",
      "weight": 0.06979185
    },
    {
      "name": "YouTube music video",
      "weight": 0.06817122
    },
    {
      "name": "many AI tools",
      "weight": 0.06663455
    },
    {
      "name": "characters",
      "weight": 0.06292085
    },
    {
      "name": "AI",
      "weight": 0.061999764
    },
    {
      "name": "Users",
      "weight": 0.061502703
    },
    {
      "name": "users",
      "weight": 0.061502703
    },
    {
      "name": "OpenArt",
      "weight": 0.056736648
    },
    {
      "name": "Character Vlog prompts",
      "weight": 0.055008855
    },
    {
      "name": "TechCrunch",
      "weight": 0.05461611
    }
  ],
  "topics": [
    {
      "name": "Startups"
    },
    {
      "name": "AI"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    },
    {
      "name": "Business"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.9873046875
    },
    {
      "name": "/News/Technology News",
      "score": 0.88134765625
    },
    {
      "name": "/Science/Computer Science/Machine Learning & Artificial Intelligence",
      "score": 0.6572265625
    },
    {
      "name": "/Arts & Entertainment/TV & Video/Online Video",
      "score": 0.55126953125
    }
  ],
  "sentiment": {
    "positive": 0.2865474,
    "negative": 0.13489355,
    "neutral": 0.57855904
  },
  "summary": "OpenArt, a startup founded in 2022 by two former Google employees, has raised $5 million in funding for its viral AI platform, which allows users to create 'brainrot' videos with a single click. The platform already has 6 million monthly active users. The company's \"one-click story\" feature allows users control over a single input into a one-minute video with a complete story arc. Users can select from three templates: Character Vlog, Music Video, or Explainer. The firm aggregates over 50 AI models and provides creators with control over the tools behind each production. OpenArt's defining strength is keeping characters visually consistent throughout an entire video. If a video infringes copyright, it may be removed and the creator held liable, potentially facing legal action from rights holders.",
  "shortSummary": "OpenArt, an AI-based platform allowing users to create \"brainrot\" videos with a single click, raised $5 million in funding and aims for $20 million revenue.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "60c608a4c0da4a7589f65a69e9b6d69c",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://openart.ai/",
      "text": "OpenArt turns imagination into visual stories—from idea to final frame. Make wonders with OpenArt.\nOpenArt gives you the power to turn any idea into a captivating visual story, within minutes.Whether you're creating viral social media posts, explaining a concept, or building brand content, OpenArt is where ideas become visual stories.\nCreating a tutorial? Making a montage? Producing an ad? Make the most out of your photos. Convert an image to video on OpenArt for free and use our intuitive editing tools to make your visual story come alive.\nBreak free from the constraints of traditional AI art generators. With OpenArt, using prompts is optional, allowing you to bring your visions to life unrestricted. Interact with our AI on your terms and unleash creativity like never before.\nOpenArt Characters lets you create images of consistent characters from just one image or description. Pose, place, and combine them in any scene for infinite storytelling possibilities.\nExperience the future of image creation with OpenArt's innovative suite of AI-powered tools. From effortless InPainting to precise object removal, our advanced features empower you to achieve stunning transformations in seconds.\nOpenArt is an AI-powered art platform where users can create images using pre-built models or by training their own models. A suite of AI tools is provided to enhance the creation of the artwork. We also have an active Discord community where OpenArt Users can connect, engage, share ideas, and collaborate on artistic projects.\nAn AI art generator like OpenArt leverages state-of-the-art generative AI technologies to convert user-provided textual prompts into exquisite visual artworks. These generators can imitate a wide range of artistic styles by utilizing complex algorithms such as diffusion models. This technology spans from replicating the intricate brushwork found in Renaissance oil paintings to creating dynamic, abstract visuals akin to modern digital art. Users have the opportunity to craft custom images, elaborate illustrations, or detailed digital paintings effortlessly. By simply providing descriptive prompts, they unlock the potential to produce artwork that is both unique and reflective of their personal vision. This process not only democratizes art creation, making it accessible regardless of one's traditional artistic skills, but it also paves the way for innovative expressions in art.\nOpenArt offers a variety of plans for users ages 18 and up. Here are our current plans:\nFREE\nPerfect for the ultimate newbie, this plan is 100% free, with no credit card required! The Free Plan includes up to 4 parallel generations and a daily free credits on the basic models including the newest Stable Diffusion XL model (Image size up to 512 x 512 pixels, up to 25 steps). BONUS: We are currently offering new users a bonus of 20 free credits to explore our premium models, and if you join our Discord community, you'll receive even more additional free credits. (Note: Bonuses are subject to change/withdrawal at any time).\nSTARTER\nThis plan is perfect for the frequent experimenter who wants a deeper dive into the world of AI art. The Starter Plan includes 5,000 credits per month, up to 8 parallel generations, 20+ public models, all community models, 2 fine-tuned models, access to the exclusive premium AI tools (e.g., Creative Upscaler, Sketch to Image), editing with inpainting, Img2Img, ControlNet, 2/4upscale image, face/anime enhancement and more!\nHOBBYIST\nOur most popular plan! The Hobbyist is for AI art enthusiasts and regular project makers seeking advanced capabilities. The Hobbyist Plan includes 15,000 credits per month, up to 16 parallel generations, 4 custom fine-tuned models every month, plus everything included in the Starter plan.\nPRO\nReady to take your art to the Pro level? We've got you covered! Our Pro plan is for dedicated creators and businesses to experience the full power of OpenArt, including a faster generation speed!The Pro Plan includes UNLIMITED credits, up to 32 parallel generations, and 8 new custom fine-tuned models every month, and everything included at the Hobbyist & Starter levels.\nOpenArt stands out from other AI art generators due to its focus on high-quality art creation and comprehensive support for both amateur and professional artists. Unlike many other platforms, OpenArt offers a variety of advanced tools and models that cater to different artistic needs and preferences. These include high-resolution image generation, a wide range of artistic styles and models, ultimate image upscale, AI image editing tools, and the ability to fine-tune models to specific artistic visions. Additionally, OpenArt emphasizes user education through resources like the Prompt Book, Model Training Book, YouTube tutorials, which are designed to enhance user understanding and capabilities in AI-driven art creation.\nAbsolutely! OpenArt is designed not only as a tool for creating art but also as a platform for learning and skill development. Users can experiment with various styles and techniques without the need for traditional artistic training, which can accelerate the learning process and inspire creativity. The platform provides detailed feedback on art creation processes, allowing users to refine their techniques and understand art concepts better. Moreover, OpenArt offers community models and collaborative projects on its Discord channel, where users can receive critiques and advice from a community of like-minded artists and AI enthusiasts. This supportive environment fosters both personal growth and artistic improvement.\nOpenArt uses advanced AI to interpret your textual prompts and convert them into visual art. This process involves neural networks that have been trained on a diverse dataset, allowing the AI to apply various artistic styles and elements to produce unique artworks.\nPrompts are highly detailed written instructions that you input into an AI art generator like OpenArt to create your desired artwork. These prompts act as creative commands that guide the AI in generating images, ranging from simple sketches to complex scenes. You can experiment with various artistic styles, from photorealistic drawings to vibrant abstract art, by just describing what you envision.For example, if you're interested in AI-generated images of fantastical landscapes, you might use a prompt like \"a snowy mountain landscape under a starry night sky.\" The AI uses this prompt to understand and visualize the scene in artistic forms. The process is flexible, allowing you to adjust your prompts based on the results, ensuring the artwork aligns closely with your vision.Prompts can be as specific as you need—detailing not just the subject but also the style, mood, and even particular color schemes. This tool is particularly useful for creating digital art, generating unique illustrations, or conceptualizing visuals for projects that require a quick turnaround, such as graphic design, marketing campaigns, and entertainment media.Whether you're a professional artist or a hobbyist, AI art generators empower you to expand your creative boundaries by turning your written ideas into visual realities efficiently and effectively.\nView our Prompt Book for details and examples.\nA well-crafted Prompt uses defined subjects, styles, and detailed descriptions. Doing so will significantly improve the quality of your artwork. Below are a few tips to help you create good Prompts. View our Prompt Book and Prompt Template for even more tips, descriptions, and prompt examples.\nSubject and Concept\nClearly define what you aim to create, whether it’s a landscape, portrait, or abstract idea. Be specific and give a strong direction. Example: \"An abstract concept of a majestic bald eagle flying over an emerald green sea.\"\nStyle or Theme\nDescribe your favorite art style, historical period, or artist. Impressionism:\n\"A red barn with an owl flying in the style of Impressionism, capturing light and color.\"\nHistorical:\n\"A bustling Ancient Rome marketplace in the Baroque period’s architectural style.\"\nArtist:\n\"In Vincent van Gogh's style, a star-filled night over a tranquil village with vibrant colors.\"\nComposition and Perspective\nDetail the arrangement of elements (foreground, background, central figure) and use perspective (bird’s eye view, worm’s eye view) to enhance the artwork’s depth and angle.Example: \"A majestic oak tree as the central figure, with a bustling forest scene in the background and wildflowers in the foreground.\"\nAtmosphere and Mood\nDescribe the mood, time of day, or weather to enhance its emotional tone. Example: \"A surreal sunset with clouds melting into a sea of liquid gold.\"\nColors and Lighting\nName your desired colors and lighting conditions to set the artwork’s mood and visual impact. Example: \"Use warm oranges, yellows, and deep purples for a sunset depiction.\nYes! OpenArt's Free Plan is 100% risk-free with no cost and no credit card required. Registered users can generate images up to 512 x 512 pixels and up to 25 steps for free on our basic models (OpenArt SDXL, OpenArt Creative, Stable Diffusion XL). As a new member of the Free Plan, you'll also receive a one-time bonus of 20 FREE CREDITS to try any OpenArt premium features and advanced models. Want more? Join our Discord community to earn additional FREE CREDITS. Discord is our hub for artists and AI art enthusiasts. Community participation will enrich your artistic journey through events, contests, brainstorming, and creative discussions. Click here to join Discord.\nOpenArt provides a comprehensive free AI art generator that makes the creation of digital art accessible to everyone, eliminating economic barriers. This platform is particularly beneficial for beginners and enthusiasts, offering basic models that produce artworks with resolutions up to 1024x1024 pixels under its free plan. This setup is perfect for those exploring the potential of AI in art, allowing them to dabble in various styles and media without upfront costs. For those desiring to delve deeper into high-resolution creations or more sophisticated features, OpenArt promotes active community engagement and periodic promotional offers to earn additional credits. These initiatives not only enrich the user experience but also cultivate a sense of community among users, enhancing their connection to the platform. Consequently, OpenArt stands out as an excellent resource for anyone looking to explore the frontiers of AI-generated art, encouraging creativity and exploration across its user base.\nYes, OpenArt includes features that can transform your photos into artworks. By upload your own image under Image Guidance, using styles from famous artists or particular art movements, you can recreate your photo in the style of Impressionism, Baroque, or even in the unique strokes of Van Gogh.You can read more about Image Guidance on our wiki page.\nUtilizing AI for drawing and creating art provides numerous benefits that can transform the creative process across various industries, including digital marketing, animation, video game design, and more. Here are some of the key advantages:Rapid Visualization of Concepts: AI art tools enable swift translation of ideas into visual formats. This is particularly valuable in fields where concept development is crucial and time-sensitive, such as in advertising or game design. Artists and designers can quickly iterate over multiple visual concepts without the need for extensive physical or digital resources typically required in traditional art-making.Accessibility and Ease of Use: AI generators, like OpenArt, lower the barriers to entry for digital art creation. They provide platforms where both novices and professionals can create complex artworks without needing advanced skills in painting or drawing. This inclusivity opens up the art and design field to a broader audience, fostering diversity in creative expression.Experimentation with Diverse Styles: AI art tools offer the flexibility to explore a vast array of artistic styles—from classical to contemporary, from realistic portraits to surreal landscapes. This allows creators to experiment freely, blending different styles or creating entirely new ones without the constraints of traditional mediums.Enhanced Productivity: AI accelerates the art creation process, allowing artists to produce more work in less time. This increased productivity can be a significant advantage for commercial artists who need to meet tight deadlines or manage multiple projects simultaneously.Educational Tool: For educational purposes, AI art generators serve as excellent resources for learning about art techniques, historical styles, and the elements of visual composition. Educators can use these tools to provide students with hands-on experience in art creation, enhancing their understanding of aesthetic principles through practical application.Cost-Effectiveness: By using AI, artists and companies can reduce the costs associated with art production, such as materials, studio space, and even human resources. AI art generators require only a digital platform and minimal computing resources, making high-quality art creation more affordable and financially sustainable.Personalized Art Creation: AI can analyze individual preferences and past interactions to suggest or create personalized artworks that resonate more deeply with the user. This personalized approach can enhance user engagement and satisfaction, particularly in sectors like personalized gifts or bespoke interior design.\nAbsolutely! OpenArt enables users to create AI-generated fanart by inputting prompts related to their favorite characters, series, or themes from various media, including anime, movies, and comics. For instance, you could enter a prompt such as \"anime character in a futuristic cityscape\" or \"superhero in action in a dramatic comic book style.\" Our AI uses these prompts to generate unique and visually appealing artworks that capture the essence of the characters and settings you love.The platform supports a wide range of artistic styles, so you can experiment with different looks—whether you want your anime characters in a classic watercolor style, a vibrant pop art look, or even emulating the styles of specific artists. This feature allows fans to see their favorite characters in new and creative ways, expanding the universe of their beloved series through art.Furthermore, OpenArt provides tools that allow for detailed customizations, such as adjusting color schemes, backgrounds, and even the emotions portrayed in the characters' expressions. This level of control ensures that the fanart not only meets but often exceeds the fans’ expectations, making OpenArt a fantastic tool for fanart creators at all skill levels.\nAI can significantly speed up the creative process in 2 ways.First, it can automate the initial stages of art creation. Artists can use AI to generate multiple drafts in different styles quickly, which they can then refine or combine using their artistic skills. Second, OpenArt offer advanced tools like Composition guidance, ControlNet and Sketch to Image where one give OpenArt a draft and get a fully-rendered image within seconds.\nTIP 1 - Refine your PromptsIf an image isn't what you expected, tweak your Prompts by adding or removing details, changing styles, or putting emphasis on different elements. Simplify your Prompts if your images consistently turn out too complex or cluttered. Conversely, add more details or elements to your prompts if the images are too simple.View our Prompt Book for details and examples. You can also visit our Style Palettes page to for a variety of prompt examples.\nTIP 2 - Leverage our editing toolsIf you’re not 100% happy with your AI generated image, you can use our advanced yet easy AI image editing tools to refine the image to exactly you want it to be.\nTIP 3 - Explore OpenArt ResourcesSeeing what works for others can inspire your own prompts and help you understand the details that lead to the best results. Explore samples on our Discover page or Prompt Book or our YouTube channel, or join Discord, our interactive community. You can even talk directly to the OpenArt founders!\nExplore the power of AI to bring your ideas to life. Generate, refine, and innovate—your creative journey starts here."
    },
    {
      "url": "https://www.benzinga.com/money/pacaso",
      "text": "Benzinga Money is a reader-supported publication. We may earn a commission from the advertisers associated with this article. Read our Advertiser Discloser.\nThree of the same VC firms that backed Uber, Venmo, and eBay, respectively, are all investing in another private company: Pacaso.\nVenture backing in companies like Pacaso is nothing new. After all, early-stage companies often have the potential to deliver the most outsized returns.\nBut, recent regulatory updates have opened the door for individual investors to invest alongside these venture capitalists. Normally, everyday investors have to wait for a company to go public before they can invest, missing out on that early gain potential. Now, some companies are opening up investment opportunities to the public.\nThis type of investing has already seen some great success stories. For example, in 2016, 433 people invested an average of $2,730 in a private startup named Revolut. Fast-forward to today, those $2,730 stakes are worth over $1 million, up 89,900%.\nToday, thousands of investors have joined big-name VCs in taking a chance on Pacaso. It's no surprise, considering Pacaso's resumé:\n- The company has made $110M in gross profits to date\n- Pacaso's co-founder sold his last company to Zillow for $120M\n- They operate in over 40 vacation destinations across the US, Mexico, UK, and France\n- The company reserved the Nasdaq ticker PCSO\nBut the growth potential is where the excitement is. Below we'll reveal more about how Pacaso has ramped up and built a competitive moat so quickly, and how you can share in their growth.\nNext-Generation Co-Ownership\nAfter his $120M exit and subsequent role as a Zillow executive, Austin Allison created Pacaso’s game-changing co-ownership model. Powered by proprietary tech and an innovative structure that eliminates the headaches of traditional vacation home ownership, it’s already leaving a mark. Here’s how:\n- Seamless Transactions: Clients easily buy, finance, and resell, shares of luxury homes through Pacaso’s intuitive platform\n- Turnkey Ownership: Pacaso handles maintenance, scheduling, and furnishing; owners simply enjoy their vacation homes\n- Maximized Value: Homes that once sat empty up to 90% of the year now stay occupied nearly year-round, benefiting owners and local economies\nThe demand for their services and expertise is real. In top destinations, co-ownership is growing 21% annually in the US, and Pacaso homes have appreciated nearly 10% since 2021 – roughly double the growth of the broader luxury market.\nScaling Into 10 New International Destinations\nPacaso is already leading the charge in the $1.3 trillion US vacation home market, combining real estate innovation with tech-driven efficiency to generate multiple revenue streams. These include transaction service fees on every sale, recurring property management fees, and exclusive financing options tailored to co-owners.\nNow, the platform’s global reach is growing quickly, and they’re already seeing strong returns in the $500B global market. In 2024, they set records in Paris and London. Meanwhile, Cabo (Mexico) is the #3-most-searched destination on their platform. No surprise Europe and Mexico have accounted for 22% of their revenue over the past two years.\nNow, they’re taking international expansion to an entirely new level. They recently announced 10 new international destinations will be added to their platform, spread across Italy, the Caribbean, and Mexico. That means Pacaso’s unique model is poised to dominate a combined $1.8T in vacation home markets.\nWhy Investors Are Paying Attention\nThere are many reasons why firms managing a combined $180B+ in assets, and 10,000+ individual investors have already backed Pacaso, including:\n- Proven Leadership: Allison is joined by executives with decades of real-estate and startup experience.\n- Strong Growth Metrics: Full-year 2024 financials showed a 21% YoY increase in gross real estate volume and a 24% improvement in adjusted EBITDA.\n- Surging Demand: 40% of Americans want to buy a vacation home in the next year (Coldwell Banker)\nAfter impressive full-year earnings showed gross profit grew 41%, and with continued growth and expansion ahead, Pacaso is really hitting their stride.\nPacaso is offering securities through the use of an Offering Statement that has been qualified by the Securities and Exchange Commission under Tier II of Regulation A. A copy of the Final Offering Circular that forms a part of the Offering Statement may be obtained from: invest.pacaso.com. Reserving the ticker symbol is not a guarantee that the company will go public. Listing on the Nasdaq is subject to approvals.\nDon’t Miss Your Chance to Become an Early Investor in Pacaso:\nDisclaimers\nPlease be advised that alternative investments carry a risk of monetary loss. Neither Benzinga nor its staff recommends that you buy, sell, or hold any security. We do not offer investment advice, personalized or otherwise. All information contained on this website is provided as general commentary for informative and entertainment purposes and does not constitute investment advice.\nBenzinga will not accept liability for any loss or damage, including without limitation to, any loss of profit, which may arise directly or indirectly from use of or reliance on this information, whether specifically stated in the above Terms of Service or otherwise. Benzinga recommends that you conduct your own due diligence and consult a certified financial professional for personalized advice about your financial situation."
    },
    {
      "url": "https://www.benzinga.com/news/topics/25/06/45895934/vercept-raises-16m-with-google-legend-and-dropbox-co-founder-backing-to-build-future-of-workflows-with-vision-based-mac-app-called-vy",
      "text": "Vercept, a Seattle-based AI startup, has secured $16 million in seed funding to develop Vy, a computer vision-powered Mac application designed to automate digital workflows with a single natural language command, GeekWire reports.\nThe company was founded by a group of former leaders from the Allen Institute for AI, and according to GeekWire, its backers include some of the most prominent names in tech, such as former Google CEO Eric Schmidt, Google DeepMind chief scientist Jeff Dean, Dropbox DBX co-founder Arash Ferdowsi, and Cruise founder Kyle Vogt.\nDon't Miss:\n- Maker of the $60,000 foldable home has 3 factory buildings, 600+ houses built, and big plans to solve housing — this is your last chance to become an investor for $0.80 per share.\n- ‘Scrolling To UBI' — Deloitte's #1 fastest-growing software company allows users to earn money on their phones. You can invest today for just $0.30/share with a $1000 minimum.\nThe round was led by San Francisco-based venture firm Fifty Years, with participation from Point Nine and the AI2 Incubator, which was Vercept's first institutional investor, GeekWire says.\nVy Uses Vision AI To Mimic Human Computer Interaction\nVercept's flagship product, Vy, uses artificial intelligence to \"see\" and interpret screens the way a human does, allowing it to replicate complex workflows after observing them once, GeekWire reports.\nAccording to the company’s website, Vercept was founded with the goal of radically rethinking how people interact with technology, aiming to replace the maze of menus and code-heavy workflows with a seamless, intuitive interface that feels like an extension of the user's mind.\nThe company describes its mission as enabling users to do more with less effort, tackling tasks that were once considered too technical or time-consuming to attempt. Users can perform any digital task, such as filling out forms, organizing invoices, or creating content, while Vy records the actions, and then it automates those same tasks using natural language commands.\nTrending: Invest where it hurts — and help millions heal: Invest in Cytonics and help disrupt a $390B Big Pharma stronghold.\nUnlike traditional robotic process automation tools, GeekWire says that Vy does not require pre-built application programming interfaces, connectors, or hardcoded steps to engage with software. Vercept CEO Kiana Ehsani told GeekWire that the product is a “unified paradigm for interacting with the computer.”\nFounding Team Brings Elite AI Pedigree\nEhsani previously led robotics and embodied AI projects at Ai2, while other Vercept co-founders include Oren Etzioni, the founding CEO of Ai2, and Matt Deitke, who worked on prominent AI projects like Molmo, ProcTHOR, and Objaverse, GeekWire reports.\nLuca Weihs, another co-founder, was a research manager and infrastructure lead at Ai2, focusing on AI agents and reinforcement learning. According to GeekWire, Ross Girshick, a pioneer in combining deep learning and computer vision, also joined the founding team after stints at Meta META AI and Ai2.\nSee Also: Maximize saving for your retirement and cut down on taxes: Schedule your free call with a financial advisor to start your financial journey – no cost, no obligation.\nEarly Use Cases Hint At Broad Market Fit\nVy has already found traction with a wide range of early adopters, from students using it to manage assignments to businesses automating administrative workflows. In one example, GeekWire reports that individuals with disabilities have integrated Vy with speech-to-text systems, allowing them to remotely operate computers and complete digital tasks independently.\nWhile user growth and revenue figures were not disclosed, Ehsani told GeekWire that the reception to Vy has exceeded expectations. Vercept currently employs eight full-time staff members.\nAs major tech players like OpenAI, Google, and Amazon AMZN explore generative AI tools for task automation, GeekWire says that Vercept is differentiating itself with a visual-first solution that requires no technical setup or custom coding.\nRead Next:\n- Are you rich? Here’s what Americans think you need to be considered wealthy.\n- Deloitte's fastest-growing software company partners with Amazon, Walmart & Target – Many are rushing to grab 4,000 of its pre-IPO shares for just $0.30/share!\nImage: Midjourney\nEdge Rankings\nPrice Trend\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
      "url": "https://www.benzinga.com/money/mogul",
      "text": "Benzinga Money is a reader-supported publication. We may earn a commission from the advertisers associated with this article. Read our Advertiser Discloser.\nFirst-time real estate investors can face several hurdles when trying to get started: high upfront costs, dealing with tenants and maintenance, finding and closing on a suitable property, and the fear that your initial investment won’t see a return, just to name a few.\nNow, there’s a company that handles all the grunt work and provides a money-back guarantee on your initial investment.\nIntroducing mogul, the simplest way to own income-producing blue chip real estate.\nFounded by former Goldman Sachs executives who have closed more than $10 billion in deals, they handle the sourcing, underwriting, and day-to-day management of every property.\nTo remove first-time jitters, mogul gives new investors their First-$10k Protection Guarantee: If your initial investment of up to $10,000 loses value in the first year, mogul refunds every lost dollar.\nInvestors in mogul portfolios have earned an average annualized return of 18.8%, paid out as monthly rental income plus appreciation.\nStart building a diversified property portfolio in minutes while mogul absorbs the downside.\n‘If we ever brag about a 4% IRR, I will quit’\nAlex Blackwood and Joey Gumataotao, mogul’s co-founders, routinely surpassed 15-20% annual returns when closing deals at Goldman Sachs. When they looked at other real estate investment platforms at the time, they found those companies would often brag to those investors about 4% annual returns on billions of dollars.\nAs Alex says on mogul’s website, “If we ever brag about a 4% IRR, I will quit immediately.”\nTo date, properties in mogul’s portfolio have generated an average 10-12% annual cash-on-cash yield that hit users’ accounts as rent dividends each month. When long-term appreciation is included, historical performance rises to an 18.8% annualized returns, giving investors both regular income and capital growth\nPart of their success is due to the fact that mogul mogul approves fewer than one percent of properties reviewed. Each candidate asset must clear a 12% bear case hurdle rate before moving to the next level of diligence.\nYou can browse eligible properties on mogul’s website and buy part or all of a house in under 30 seconds, or use the same data and tools available to top real estate firms to underwrite any property across the U.S.\nRent collections are aggregated and distributed to investors every month. At the same time, independent third-party valuations refresh inside your dashboard, letting you watch equity climb in real time while still enjoying depreciation and other pass-through tax advantages unique to real estate.\nMore than $1.2 million was invested on mogul last month.\nDisclaimers\nPlease be advised that alternative investments carry a risk of monetary loss. Neither Benzinga nor its staff recommends that you buy, sell, or hold any security. We do not offer investment advice, personalized or otherwise. All information contained on this website is provided as general commentary for informative and entertainment purposes and does not constitute investment advice.\nBenzinga will not accept liability for any loss or damage, including without limitation to, any loss of profit, which may arise directly or indirectly from use of or reliance on this information, whether specifically stated in the above Terms of Service or otherwise. Benzinga recommends that you conduct your own due diligence and consult a certified financial professional for personalized advice about your financial situation."
    },
    {
      "url": "https://techcrunch.com/2025/08/08/former-googlers-ai-startup-openart-now-creates-brainrot-videos-in-just-one-click/",
      "text": "AI-generated “brain rot” videos are popping up all over the internet and getting a lot of attention. Currently gaining traction among younger users, these clips feature wild characters, like a shark wearing sneakers and a ballerina with a cappuccino for a head.\nOne startup driving this trend is OpenArt, founded by two former Google employees in 2022. It touts around 6 million monthly active users.\nThe company recently launched a new “one-click story” feature in open beta, which allows users to input a single sentence, a script, or even a song and turn it into a one-minute video with a story arc. This can include anything from a light-hearted story for TikTok to more serious content like explainer videos or music videos for YouTube. OpenArt even envisions this feature being used for advertising.\nWith One-Click Story, there are three templates to choose from: Character Vlog, Music Video, or Explainer. For a character vlog, users start by uploading an image of their character and entering a prompt. If a song is uploaded, the software understands the lyrics and creates an animation that aligns with the song’s themes, like illustrating flowers blooming in a garden.\nUsers can edit individual clips by revisiting the editor’s storyboard mode and tweaking prompts for a more refined result. The platform aggregates over 50 AI models, allowing users to choose their preferred tools, such as DALLE-3, GPT, Imagen, Flux Kontext, and Stable Diffusion.\nThe goal of the new feature is to further lower the barrier for becoming an AI creator, a medium that remains immensely popular despite ongoing controversy.\nWhile these tools can be beneficial — like using video generators to quickly produce content with original characters and narratives — there are numerous ethical issues to address. These include imitating other artists’ styles, intellectual property rights, and the dangers of misuse and creating misinformation.\nTech and VC heavyweights join the Disrupt 2025 agenda\nNetflix, ElevenLabs, Wayve, Sequoia Capital, Elad Gil — just a few of the heavy hitters joining the Disrupt 2025 agenda. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $600+ before prices rise.\nTech and VC heavyweights join the Disrupt 2025 agenda\nNetflix, ElevenLabs, Wayve, Sequoia Capital — just a few of the heavy hitters joining the Disrupt 2025 agenda. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise.\nDuring testing, we noticed that the Character Vlog option may tread into a grey legal area due to the types of characters it offers — such as Pikachu, SpongeBob, and Super Mario — which could pose risks of intellectual property (IP) infringement. In June, Disney and Universal sued AI firm Midjourney over AI-generated images.\nUsers should be aware that if their videos are found to infringe another’s copyright, the video may be taken off social media platforms, and if the user is found to have contributed to the infringement, they can potentially be held liable under copyright law, which can result in legal action from the copyright holder.\n“We try to be cautious around the IP infringement,” Coco Mao, co-founder and CEO, told TechCrunch. “When you upload some IP characters, by default, the models we use will reject them, and it’s not able to produce the IP character, but sometimes it slips.”\nMao added that the company is open to talking to major IP holders to get licensing for characters.\nOne aspect that OpenArt believes sets it apart is its ability to maintain character consistency. It argues that, unlike the average video model that often relies on simple, standalone clips that users have to piece together into a cohesive story, OpenArt aims to ensure that both the visuals and the narrative remain consistent.\n“A problem that a lot of AI couldn’t really handle well is to have the character consistent in the same video…If you don’t have the same character, then it’s hard to get immersed in the story,” Mao said.\nLooking ahead, the company plans to iterate on the one-click feature by allowing users to create videos featuring conversations between two different characters. Another plan on the roadmap is developing a mobile app.\nOpenArt operates on a credit-based system. It offers four plans, with the most basic costing $14 per month for 4,000 credits, which includes up to four One-Click stories, 40 videos, 4,000 images, and four characters. The advanced plan costs $30 per month for 12,000 credits and includes up to 12 One-Click stories. The Infinite plan is priced at $56 per month for 24,000 credits, and there is also a team plan available for $35/month per member.\nOpenArt has raised $5 million in funding to date from Basis Set Ventures and DCM Ventures, and it boasts a positive cash flow. Additionally, the company said it’s on track to achieve an annual revenue rate of over $20 million.\nThis story was updated with an updated number of MAUs."
    },
    {
      "url": "https://www.benzinga.com/money/mode-mobile-2",
      "text": "Benzinga Money is a reader-supported publication. We may earn a commission from the advertisers associated with this article. Read our Advertiser Discloser.\nYou see a shocking number of ads daily – researchers estimate between 6,000 and 10,000 and 375 to 625 per waking hour. In the modern age, most of them come from social media apps whose entire business model revolves around constantly showing you ads and keeping 100% of the revenue. But what if users got a share? That company might just grow its revenue by 32,481% in three years, help users earn and save $325 million and be named Deloitte's fastest-growing software company in North America. That’s what Mode Mobile did. You can still get in for just $0.30 per share.\nReaching Financial Stability One Tap at a Time\nMost Americans can’t afford a $1,000 emergency bill. That means many are one car breakdown or ER visit away from serious financial trouble. There's no quick fix to such a big financial challenge that over 50% of Americans face. However, it's safe to bet that the masses will flock to any good solutions. Mode Mobile created one such solution years ago by allowing people to earn money doing what they already spend a third of their waking hours on – tapping, scrolling and looking at their smartphone screens.\nMode Mobile developed a smartphone called EarnPhone, which allows users to earn and save money by playing video games, listening to music and reading the news. With the phone priced at an affordable $99, the barriers to adoption are low. However, users can earn income on their existing devices as well. This extreme competitiveness has allowed Mode Mobile to attract over 50 million registered beta users. Launching the finalized version could bring in millions more, helping the company reach its goal of $150 million in annual revenue within three years.\n6,955,000,000 Users to Go\nCurrently, seven billion smartphones worldwide provide functionality or entertainment but take all the profits. Mode Mobile’s disruption offers the same benefits but allows users to earn money at a time when the prices of goods are skyrocketing. Just like Airbnb lets users earn extra cash by renting out their bedrooms and Uber allows users to make money on their rides back home from work, Mode Mobile wants to enable its users to make money from their phones. However, its total addressable market is much larger than Airbnb’s and Uber’s – currently at over $1 trillion.\nYou can invest in Mode Mobile at $0.30 per share with a minimum investment of $4,950. Plus, the company is offering the chance to earn up to 120% in bonus shares, if you invest more. All funding rounds open to non-accredited investors, including Mode Mobile’s, are limited in time. So, if you’d like to be part of the future it's building, consider acting soon.\nDisclaimer:\nAN OFFERING STATEMENT REGARDING THIS OFFERING HAS BEEN FILED WITH THE SEC. THE SEC HAS QUALIFIED THAT OFFERING STATEMENT, WHICH ONLY MEANS THAT THE COMPANY MAY MAKE SALES OF THE SECURITIES DESCRIBED BY THE OFFERING STATEMENT. THE OFFERING CIRCULAR THAT IS PART OF THAT OFFERING STATEMENT IS AVAILABLE HERE.\nMode Mobile recently received their ticker reservation with Nasdaq ($MODE), indicating an intent to IPO in the next 24 months. An intent to IPO is no guarantee that an actual IPO will occur.\nThe Deloitte rankings are based on submitted applications and public company database research, with winners selected based on their fiscal-year revenue growth percentage over a three-year period.\nDisclaimer: Please be advised that alternative investments carry a risk of monetary loss. Neither Benzinga nor its staff recommends that you buy, sell, or hold any security. We do not offer investment advice, personalized or otherwise. All information contained on this website is provided as general commentary for informative and entertainment purposes and does not constitute investment advice. Benzinga will not accept liability for any loss or damage, including without limitation to, any loss of profit, which may arise directly or indirectly from use of or reliance on this information, whether specifically stated in the above Terms of Service or otherwise. Benzinga recommends that you conduct your own due diligence and consult a certified financial professional for personalized advice about your financial situation."
    },
    {
      "url": "https://www.benzinga.com/money/arrived-private-credit-fund",
      "text": "Benzinga Money is a reader-supported publication. We may earn a commission from the advertisers associated with this article. Read our Advertiser Discloser.\nCollect passive income from real estate without taking on the headaches of being a landlord. You can now take advantage of the higher-for-longer interest rate environment by investing in a portfolio of private real estate debt with as little as $100.\nThe explosion of private credit returns is unlikely to last forever, but currently, it’s one of the hottest asset classes out there. In 2020, its total value stood at $1.04 trillion. Just three years later, it grew by a staggering 55% to reach $1.61 trillion. BlackRock expects it to climb up to $3.5 trillion by 2028. The IMF has recognized its spectacular returns in recent years. Bezos’ darling real estate platform, which has completely disrupted the industry, now targets 7%-9% in annual cash dividends through private debt investing.\nPrivate Debt for All\nArrived has become a household investment platform that knows how to deliver passive investments. It has generated $5.6 million for its investors in dividends alone, and its user base continues to grow throughout market fluctuations. The company now boasts 614,000 registered investors who routinely snap up the shares of its carefully vetted offerings. Over the years, it has developed deep knowledge about what makes real estate markets tick. Now, using that knowledge to deliver 7%-9% for investors looking to diversify into real estate private debt through the Arrived Private Credit Fund.\nThis type of corporate credit offers relatively higher profits at lower risk as it's backed by real estate. If things go south, investors may be able to recoup their losses, depending on their position. Arrived uses a tried and tested fund mechanism to deliver passive income to the investors. It pools the funds and uses them to finance specific real estate projects that pay out monthly interest. It’s targeting 7% to 9% returns after all fees and expenses. To achieve this goal across its loans, it approaches individual loans with the same scrutiny level as the homes.\nArrived's Q3 2024 report underscores the broader success of its investment strategy. During the quarter, investors earned over $1.54 million in dividend income, marking a 25% increase from Q2 2024. Across 354 individual properties, single-family residential investments averaged 3.7% annualized dividends, while vacation rentals provided an average return of 2.8%. These consistent results demonstrate the platform's ability to balance income and appreciation across its portfolio.\nLIMITED TIME FOR JUST $100\nThe Byers House\nOwn a piece of the Byers House, a vacation rental located at the iconic home of Joyce, Jonathan, and Will Byers, featured in Stranger Things and located in Fayetteville, GA, just 20 minutes from Hartsfield Jackson International Airport. This property was used to film the exterior scenes in the actual show and influenced the design for the interior sets, which were filmed in a nearby studio.\nDebt Acquisition Tactics\nArrived partners only with experienced professionals with a history of successful real estate projects and a spotless financial record. Sticking to this criterion mitigates the risk of delays, cost overruns, and other unpredictable problems that may arise.\nAdditionally, the platform only considers residential properties in the first loan position, which creates a thick protection barrier in the event of a downside. If the borrower fails to repay the loan, Arrived and its investors would be the first to get their investment back.\nLocation also plays an important factor. Just like with its fractional share offerings, Arrived uses a combination of data science and human expertise to pinpoint the most promising deals that come its way.\nA Way In\nPrivate credit was reserved only for high-net-worth individuals who could afford the astronomical investment minimums and fees. But with the Arrived Private Credit Fund, any investor, accredited or non-accredited, can acquire a stake in the fund with as little as $100 and receive monthly dividends.\nClick here to invest in the Arrived Private Credit Fund.\nCheck out the latest offerings on Arrived\nDiversify your portfolio with a mix of debt and equity real estate investments through Arrived's multiple offerings.\nHold on!\nInvestors are seeing outstanding returns through curated real estate investment alerts. Sign up to get them sporadically and don’t miss out on offers you’d likely never hear about.\nMore From Benzinga\nDisclaimer: Please be advised that alternative investments carry a risk of monetary loss. Neither Benzinga nor its staff recommends that you buy, sell, or hold any security. We do not offer investment advice, personalized or otherwise. All information contained on this website is provided as general commentary for informative and entertainment purposes and does not constitute investment advice. Benzinga will not accept liability for any loss or damage, including without limitation to, any loss of profit, which may arise directly or indirectly from use of or reliance on this information, whether specifically stated in the above Terms of Service or otherwise. Benzinga recommends that you conduct your own due diligence and consult a certified financial professional for personalized advice about your financial situation."
    },
    {
      "url": "https://www.benzinga.com/money/wiseradvisor-retirement-planning-bzwidget",
      "text": "Retirement, ideally a period of relaxation and enjoyment after years of hard work, is often envisioned as a time to pursue hobbies, travel or simply unwind. But without a solid financial plan, many Americans worry they’ll outlive their money. This fear is often more acute among married couples, who face the added complexity of planning for two people with varying financial needs.\nIf you're 50 or older and have over $100,000 in investable assets, now is the time to take retirement planning seriously. Finding a financial advisor doesn't have to be difficult. WiserAdvisor's free tool matches you with a vetted financial advisor that meets your needs, with no obligation to hire.\n60% of Americans Lack a Retirement-Specific Account– Do you?\nA NerdWallet study, using the 2022 Survey of Consumer Finances, indicates that 60% of Americans lack a retirement-specific account. The disparity in average household retirement savings by age group further illustrates this issue:\n- Under 35: $49,130 (median: $18,880)\n- Ages 35 to 44: $141,520 (median: $45,000)\n- Ages 45 to 54: $313,220 (median: $115,000)\n- Ages 55 to 64: $537,560 (median: $185,000)\n- Ages 65 to 74: $609,230 (median: $200,000)\nThese figures show a significant gap between average and median savings, pointing to a broad spectrum of financial preparedness across different age groups. Those nearing retirement, especially those with $250,000 or more in retirement savings, stand to benefit most from expert, fiduciary guidance.\nTo guide couples in their retirement planning, T. Rowe Price, a reputable global investment management firm, provides savings benchmarks as multiples of income, varying by household income and marital status.\nFor example, a dual-income married couple with an annual income of $75,000 at age 55 should have retirement savings equal to five times their income, which should increase to 8.5 times by age 65. These benchmarks scale up for higher-income brackets, and for those with $250,000 or more in assets, strategic investment planning becomes especially important.\nFind a Vetted Financial Advisor\nIf you’ve worked hard to build a nest egg of $100,000 or more, WiserAdvisor can connect you with a trusted, independent fiduciary advisor who understands the unique financial needs of pre-retirees and retirees.\nFiduciary advisors are legally required to put your interests first. They can help you:\n- Create a tax-smart drawdown plan\n- Manage and grow a diversified investment portfolio\n- Maximize Social Security strategies\n- Protect assets for your spouse or heirs\n- The matching service is fast and free—and designed specifically for individuals with significant investable assets who are looking for personalized, high-quality advice.\nTake the first step toward a more confident retirement. If you have at least $100,000 in investable assets, WiserAdvisor can match you with a pre-screened fiduciary financial advisor in your area.\nBook here to get started; no cost, no obligation.\nBenzinga Money is a reader-supported publication. We may earn a commission from the advertisers associated with this article. Read our Advertiser Discloser."
    },
    {
      "url": "https://www.benzinga.com/personal-finance/crowdsourcing/25/06/46133986/cheat-on-everything-viral-ai-startup-cluely-lands-15m-from-andreessen-horowitz-after-its-ceo-was-suspended-from-columbia",
      "text": "Cluely, the controversial AI startup originally built to help users “cheat on everything,\" has raised $15 million in a new funding round led by venture capital powerhouse Andreessen Horowitz, co-founder Chungin “Roy” Lee announced on X on June 20.\nThe San Francisco-based company was co-founded by 21-year-old Lee, who rose to notoriety earlier this year after being suspended from Columbia University for launching an early version of the software, TechCrunch says. Cluely's other co-founder, Neel Shanmugam, also 21 and a former Columbia student, serves as the company's chief operating officer. Like Lee, Shanmugam faced disciplinary action at Columbia related to the AI tool. According to TechCrunch, both founders have since dropped out.\nDon't Miss:\n- GoSun's breakthrough rooftop EV charger already has 2,000+ units reserved — become an investor in this $41.3M clean energy brand today.\n- Invest early in CancerVax's breakthrough tech aiming to disrupt a $231B market. Back a bold new approach to cancer treatment with high-growth potential.\nOriginally called \"Interview Coder,\" the tool helped software engineers cheat on technical job interviews by providing real-time, AI-generated answers while the interview was in progress, TechCrunch says.\nAlthough Cluely has since scrubbed explicit references to cheating from its website, Business Insider reports that the platform still promotes itself as an \"undetectable\" AI assistant capable of viewing the user's screen and feeding answers in real-time during high-stakes conversations like interviews, exams, and sales calls.\nHow a Columbia Suspension Became a Springboard for Virality\nAccording to TechCrunch, Lee's suspension from Columbia accelerated his momentum. His viral online presence, often driven by controversial videos and stunts, has helped Cluely break through the noise in a crowded AI market.\nIn April, Cluely released a video in which Lee used the software to impress a woman on a date by pretending to know about art, wealth, and wine. The comedic tone turned heads across social media, but not everyone was amused, TechCrunch says.\nEarlier this week, the startup attempted to throw a massive after-party following Y Combinator's AI Startup School. According to TechCrunch, police intervened after 2,000 people flooded the venue and stopped the party.\nTrending: This Jeff Bezos-backed startup will allow you to become a landlord in just 10 minutes, with minimum investments as low as $100.\n‘Whatever It Takes’: The Growth Plan Backed by Silicon Valley's Elite\nLee told Business Insider the company's top priority is achieving 1 billion total views across all social platforms. \"We'll do pretty much whatever it takes to do that,\" he said.\nThat ambition is reflected in the company's new hiring strategy. Cluely announced on LinkedIn that it will bring on 50 \"growth interns\" who will each be required to post four TikToks per day promoting the brand.\nAndreessen Horowitz partner Bryan Kim told Business Insider that Lee is a \"founder with the boldness to rethink what’s possible,\" which highlights Andreessen Horowitz's support for Lee's unconventional vision. “We backed Roy early because he brings a rare mix of vision and fearlessness,” Kim said.\nCluely's Future Includes Profitability, Pushback, and Potential\nCluely's $15 million Series A round follows a previous $5.3 million seed investment co-led by Abstract Ventures and Susa Ventures. Two unnamed investors told TechCrunch they believe the startup's current post-money valuation is approximately $120 million, although neither the company nor Andreessen Horowitz confirmed that figure.\nAccording to multiple posts from Lee on X and podcast appearances, Cluely is already profitable, TechCrunch says. Lee's provocative social media presence, including highly produced and often controversial videos, has played a key role in building brand awareness and driving public attention to Cluely.\nWhile Cluely's rapid rise has drawn praise for its bold marketing and attention-grabbing tactics, some reactions have been more critical. One of the company’s launch videos was compared by viewers to the dystopian themes of \"Black Mirror,\" showcasing a broader tension between innovation and ethical boundaries in emerging AI tools, TechCrunch reports.\nSee Next:\n- $100k in assets? Maximize your retirement and cut down on taxes: Schedule your free call with a financial advisor to start your financial journey – no cost, no obligation.\n- Warren Buffett once said, \"If you don't find a way to make money while you sleep, you will work until you die.\" Here’s how you can earn passive income with just $100.\nImage: Shutterstock\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    }
  ],
  "argos_summary": "OpenArt, an AI startup founded by former Google employees in 2022, has gained popularity for its 'one-click story' feature that allows users to create one-minute videos from simple prompts, attracting around 6 million monthly active users. The platform offers various templates for video creation and utilizes over 50 AI models to maintain character consistency throughout the videos. OpenArt operates on a subscription model and has raised $5 million in funding, projecting an annual revenue run rate of over $20 million. However, the use of copyrighted characters in videos raises potential legal concerns for users.",
  "argos_id": "Y9D515SMB"
}