{
  "url": "https://www.foxnews.com/politics/venezuelan-migrants-progressive-group-sue-dhs-cbp-after-noem-nixes-biden-era-protected-status",
  "authorsByline": "Charles Creitz",
  "articleId": "c3ffa63727ce41c08953c10b163cc365",
  "source": {
    "domain": "foxnews.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://static.foxnews.com/foxnews.com/content/uploads/2025/07/trump-noem-migrants.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-13T09:26:37-04:00",
  "addDate": "2025-08-13T13:35:38.445386+00:00",
  "refreshDate": "2025-08-13T13:35:38.445387+00:00",
  "score": 1.0,
  "title": "Venezuelan migrants, progressive group sue Trump admin after Noem nixes Biden-era ‘protected status’",
  "description": "Venezuelan Association of Massachusetts files federal suit over sudden policy shift ending protected status for migrants who used required CBP One app process",
  "content": "A Venezuelan civic group and several migrants sued federal immigration agencies this week, alleging the Trump administration unlawfully ended Biden-imposed \"Temporary Protected Status\" for Venezuelans.\n\nThe Venezuelan Association of Massachusetts, a progressive group called Democracy Forward, and three migrants filed suit in Boston federal court against the Department of Homeland Security, Customs and Border Protection and U.S. Citizenship and Immigration Services challenging what they called President Donald Trump and Homeland Security Secretary Kristi Noem’s \"sudden and unlawful termination\" of temporary protected statuses.\n\nIn a statement, Democracy Forward said the plaintiffs objected to an alleged April mass email from DHS to TPS migrants stating: \"It is time for you to leave the United States.\"\n\nThe plaintiffs suggested the recipients of the blunt missive have the legal right to remain in the U.S. given their work-permitting and other related documentation they may have applied for.\n\nFEDERAL JUDGE FINDS 'RACIAL AND DISCRIMINATORY ANIMUS' IN TRUMP MOVE TO CANCEL TEMPORARY PROTECTED STATUS\n\nThey further argued that TPS revocation requires case-by-case determinations and wrongly disrupts lives and occupations and risks becoming subject to deportation.\n\n\"As a community-based organization, we have seen firsthand the direct harm this sudden policy inflicts on people who arrived lawfully, complied with every DHS requirement, including the CBP One process, and worked hard to build stable lives for their families,\" Venezuelan Association of Massachusetts official Carlina Velázquez and Carlos Martín Medina said in a joint statement obtained by Fox News Digital.\n\nDemocracy Forward President Skye Perryman added that the \"sudden policy shift\" exhibits the \"Trump-Vance administration’s assault on immigrants who have followed the rules.\"\n\n\"Let me be clear: none of this is about immigration, it’s about cruelty and the targeting of people in vulnerable circumstances,\" Perryman claimed.\n\n\"Our clients used the CBP One app because DHS required it. To now strip them of their rights and threaten them with deportation is a gross violation of the law and public trust.\"\n\nFEDERAL JUDGE HALTS TRUMP TPS POLICY, ACCUSES DHS OF MAKING MIGRANTS 'ATONE FOR THEIR RACE'\n\nMigrants fleeing Venezuela – effectively a dictatorship since the late Hugo Chávez’s 1999 election – were granted special protection by former President Joe Biden in 2021 due to humanitarian concerns.\n\nBiden then extended TPS in 2023, qualifying about 350,000 more Venezuelan migrants to arrive after the original timeframe imposed.\n\nAfter Trump took office, Noem revoked the 2023 TPS extension, which set the ball rolling on the eventual cancellation of protected status for Venezuelan migrants.\n\nIn April, Obama-appointed Judge Edward Milton Chen issued an injunction blocking Noem’s move to end TPS. The Supreme Court overruled Chen in a brief, unsigned order in May, allowing Noem’s timeline to resume.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nBut Chen then followed up in June with a narrow ruling noting that preexisting work permits and the like should not be canceled retroactively.\n\nA three-judge Ninth Circuit panel in Pasadena, California, last heard arguments during a July appeal by the Trump administration during which one judge reportedly called the president's comments \"arguably racist.\"\n\nIn comments to Fox News Digital, DHS Assistant Secretary Tricia McLaughlin said the lawsuit is \"a desperate attempt to keep half a million poorly vetted illegal aliens in this country and undermine President Trump’s constitutional authority to enforce America’s immigration laws.\"\n\n\"The Biden administration abused its parole authority to create an industrial-scale catch-and-release scheme, and the Trump administration is correcting that,\" she added.\n\n\"This lawsuit is an insult to the tens of millions of Americans who gave this president a mandate to restore safety and common sense to our immigration system.\"",
  "medium": "Article",
  "links": [
    "https://www.foxnews.com/video/6376614470112",
    "https://www.foxnews.com/video/6376702085112",
    "https://www.foxnews.com/politics/federal-judge-blocks-trumps-immigration-policy-shocking-decision-haitian-protections",
    "https://www.reuters.com/legal/government/us-judges-skeptical-trump-ending-venezuelan-migrants-legal-status-2025-07-16",
    "https://www.foxnews.com/politics/federal-judge-postpones-dhss-attempt-end-temporary-protected-status-venezuelans",
    "https://www.foxnews.com/politics/federal-judge-halts-trump-tps-policy-accuses-dhs-making-migrants-atone-race",
    "https://www.foxnews.com/politics/federal-judge-finds-racial-discriminatory-animus-trump-move-cancel-temporary-protected-status",
    "https://www.foxnews.com/video/6376767542112",
    "https://www.foxnews.com/us/up-1m-migrants-who-used-bidens-cbp-one-app-ordered-deport-trump-admin",
    "https://foxnews.com/download"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "TPS migrants",
      "weight": 0.07493934
    },
    {
      "name": "Venezuelan migrants",
      "weight": 0.06837001
    },
    {
      "name": "Donald Trump",
      "weight": 0.06627668
    },
    {
      "name": "Trump admin",
      "weight": 0.066160016
    },
    {
      "name": "Trump",
      "weight": 0.06534247
    },
    {
      "name": "former President Joe Biden",
      "weight": 0.064448565
    },
    {
      "name": "Democracy Forward President Skye Perryman",
      "weight": 0.062770486
    },
    {
      "name": "federal immigration agencies",
      "weight": 0.062137827
    },
    {
      "name": "several migrants",
      "weight": 0.062094398
    },
    {
      "name": "FEDERAL JUDGE",
      "weight": 0.060791932
    }
  ],
  "topics": [
    {
      "name": "Lawsuits"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.9560546875
    },
    {
      "name": "/Law & Government/Government/Visa & Immigration",
      "score": 0.8828125
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.87060546875
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Other",
      "score": 0.857421875
    },
    {
      "name": "/Sensitive Subjects/Other",
      "score": 0.5322265625
    },
    {
      "name": "/Law & Government/Government/Courts & Judiciary",
      "score": 0.435302734375
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.35205078125
    }
  ],
  "sentiment": {
    "positive": 0.04540751,
    "negative": 0.7483895,
    "neutral": 0.20620298
  },
  "summary": "A Venezuelan civic group and several migrants have sued federal immigration agencies in Boston federal court, alleging that the Trump administration unlawfully ended Biden-imposed \"Temporary Protected Status\" for Venezuelans. The Venezuelan Association of Massachusetts, a progressive group called Democracy Forward, and three migrants are challenging what they call President Donald Trump and Homeland Security Secretary Kristi Noem's \"sudden and unlawful termination\" of temporary protected statuses. The plaintiffs argue that TPS revocation wrongly disrupts lives and occupations and risks being subject to deportation. They also object to an alleged mass email from DHS stating that it is time for TPS migrants to leave the United States.",
  "shortSummary": "A Venezuelan civic group and several migrants sued the Trump administration for unlawfully ending TPS, a temporary protected status granted by Joe Biden.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "f6c8ccc3bbae4a678929a6a5b66dde94",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.foxnews.com/politics/federal-judge-postpones-dhss-attempt-end-temporary-protected-status-venezuelans",
      "text": "A U.S. District judge in San Francisco, California, on Monday granted a motion to postpone the Trump administration’s attempt to end temporary protected status (TPS) for Venezuelan nationals, which was granted under a program implemented by the Biden administration.\nDepartment of Homeland Security (DHS) Secretary Kristi Noem announced actions three days after being sworn into her role to strip nearly 350,000 Venezuelan nationals of their protection under the TPS program, which allows them to live and work temporarily in the U.S.\nBy stripping the Venezuelans of their TPS status, the court said Noem is subjecting them to \"possible imminent deportation\" back to their country, which the State Department has categorized as a \"Level 4: Do Not Travel\" country because of the \"high risk of wrongful detentions, terrorism, kidnapping, the arbitrary enforcement of local laws, crime, civil unrest, [and] poor health infrastructure.\"\nThe action would reverse the Biden administration’s efforts to extend temporary protections of Venezuelan nations that have been in place since 2021.\nTRUMP ADMIN PULLING LEGAL STATUS FOR MORE THAN 530K MIGRANTS\nU.S. District Judge Edward Chen of the San Francisco Federal Court granted a postponement of Noem’s order on Monday, saying, \"The Court finds that the Secretary’s action threatens to: inflict irreparable harm on hundreds of thousands of persons whose lives, families, and livelihoods will be severely disrupted, cost the United States billions in economic activity, and injure public health and safety in communities throughout the United States.\"\nChen also said the government has failed to identify \"any real countervailing harm\" in continuing TPS for Venezuelan beneficiaries.\n\"Plaintiffs have also shown they will likely succeed in demonstrating that the actions taken by the Secretary are unauthorized by law, arbitrary and capricious, and motivated by unconstitutional animus,\" Chen wrote. \"For these reasons, the Court grants Plaintiffs’ request to postpone the challenged actions pending final adjudication of the merits of this case.\"\nDHS' KRISTI NOEM SAYS TRUMP ADMIN WILL RESUME CONSTRUCTION OF 7 MILES OF SOUTHERN BORDER\nFox News Digital has reached out to DHS for comment on the decision.\nThe National TPS Alliance – an organization representing individuals with Temporary Protected Status (TPS) in the U.S. – and individuals from Venezuela who have TPS challenged the Trump administration's decision to terminate TPS for Venezuelans in the U.S., argue that Noem’s action was unlawful and motivated by racial bias.\nVenezuelan migrants were allowed to fly directly to the U.S. after applying from abroad under a policy started during the Biden administration that was designed to open legal migration pathways, but President Donald Trump suspended the program when he returned to office in January.\nJUDGE GIVES MAHMOUD KHALIL LEGAL TEAM MORE TIME TO REVIEW IMMIGRATION CASE\nThe Cuba, Haiti, Nicaragua and Venezuela program, CHNV, allowed migrants and their immediate family members to fly into the U.S. if they had American sponsors. They could then remain in the country for two years under a temporary immigration status known as parole. The program first applied to Venezuelans before it was expanded to additional countries.\nTrump's efforts to remove legal and illegal migrants from the U.S. since taking office in January as part of his immigration agenda have faced numerous legal obstacles.\nCLICK HERE TO GET THE FOX NEWS APP\nThe Trump administration is also reportedly dismantling internal watchdogs for DHS, including its Office for Civil Rights and Civil Liberties, which investigated allegations of abuse and discrimination within immigration enforcement, according to Bloomberg News.\nFox News Digital’s Landon Mion contributed to this report."
    },
    {
      "url": "https://www.foxnews.com/us/up-1m-migrants-who-used-bidens-cbp-one-app-ordered-deport-trump-admin",
      "text": "Migrants who entered the U.S. under the Biden-era CBP One app have had their parole protections terminated and ordered to leave the U.S. immediately or face a permanent ban from reentry.\nThe app was used by nearly 1 million migrants to schedule appointments at official ports of entry before they were paroled into the U.S. The migrants were permitted to seek asylum and given temporary work authorization for two years while they waited for the outcomes of their respective proceedings.\nTrump ended the use of the CBP One app to parole migrants on his first day in office. His administration has also paused applications for parole programs and allowed ICE to cancel parole statuses of migrants.\nNOEM ANNOUNCES DHS REGISTRY FOR ILLEGAL ALIENS IN US THAT WILL REQUIRE THEM TO BE FINGERPRINTED\nThe Trump administration has now begun notifying migrants who used the app, telling them their legal status has been revoked, according to a report by CBS, citing a Homeland Security message the outlet obtained.\n\"If you do not depart the United States immediately you will be subject to potential law enforcement actions that will result in your removal from the United States — unless you have otherwise obtained a lawful basis to remain here,\" the message reads, per the outlet.\nThe notification encourages migrants to sign up for self-deportation through the CBP One app, which is now called CBP Home.\n\"Again, DHS is terminating your parole. Do not attempt to remain in the United States — the federal government will find you,\" the notice says. \"Please depart the United States immediately.\"\nCBS reported that the message was verified by DHS. Fox News Digital reached out to DHS for confirmation but did not immediately receive a response.\nThe CBP One app launched in January 2023 and was used to admit more than 936,500 people through December 2024, the New York Post reports, citing DHS data.\nNOEM SENDS MESSAGE TO THOSE CONSIDERING ENTERING US ILLEGALLY: ‘DON’T EVEN THINK ABOUT IT'\n\"Formal termination notices have been issued, and affected aliens are urged to voluntarily self-deport using the CBP Home App,\" a DHS spokesperson said, per the outlet. \"Those who refuse will be found, removed, and permanently barred from reentry,\"\nThe Biden administration had expanded the use of the CBP One app to allow migrants to enter the U.S. at ports of entry or via a separate parole process. That process involved them uploading information including a photograph.\nThe Biden administration also allowed for the app to be used by migrants for air travel. The Transportation Security Administration (TSA) was permitted to verify a migrant without sufficient ID by comparing a photograph of a migrant to DHS records and also using biometric matching. Those verified would also receive additional physical screenings.\nCLICK HERE TO GET THE FOX NEWS APP\nNoem ended the use of CBP One to allow migrants to board domestic flights, unless it is being used for their self-deportation.\nThe administration has also canceled extensions of Temporary Protected Status for some nationalities, including for more than 600,000 Venezuelans.\nTPS grants protection from deportation and allows work permits for nationals living in the U.S. from countries deemed unsafe for them to be returned. Then-DHS Secretary Alejandro Mayorkas announced extensions for TPS for Venezuela, as well as El Salvador, Sudan and Ukraine, for an additional 18 months in the final few days of the Biden administration.\nThe Trump administration’s move to end Temporary Protected Status has been held up in the courts."
    },
    {
      "url": "https://www.foxnews.com/politics/federal-judge-halts-trump-tps-policy-accuses-dhs-making-migrants-atone-race",
      "text": "A federal judge in California delayed the Department of Homeland Security's (DHS) decision to terminate protections for immigrants from three countries, a move that adds to the legal hurdles for the Trump administration as it pushes to carry out its deportation agenda.\nJudge Trina Thompson said that DHS Secretary Kristi Noem’s terminations of temporary protected status, also known as TPS, for immigrants from Honduras, Nicaragua and Nepal were likely \"preordained decisions\" that violated the Administrative Procedure Act and were driven by racial animus.\n\"The freedom to live fearlessly, the opportunity of liberty, and the American dream. That is all Plaintiffs seek,\" Thompson, a Biden-appointee, wrote in an order. \"Instead, they are told to atone for their race, leave because of their names, and purify their blood. The Court disagrees.\"\nThompson later added: \"Color is neither a poison nor a crime.\"\nDHS TERMINATES TEMPORARY PROTECTED STATUS FOR AROUND 76K HONDURAN, NICARAGUAN MIGRANTS\nThe lawsuit was brought by a group representing TPS holders, including some who have lived in the country for more than two decades.\nAttorneys wrote in court papers on behalf of the immigrants that they were \"laborers, health care workers, artists, and caretakers\" who have \"relied on TPS to provide the most basic forms of human security — a stable place to live and a chance to work for a living during a time of severe crisis in their home countries.\"\nThey argued that Noem declining to extend their TPS status was, by law, supposed to be reached based on an individualized analysis of each country. The judge found that Noem likely failed to condition TPS termination on factors specific to the immigrants' countries of origin.\nThey also said Noem had given the immigrants a historically short notice period of 60 days before they would lose their TPS status. And she and other Trump administration officials have normalized using \"racist invective\" to explain their TPS decisions, the attorneys said.\nFEDERAL JUDGE BLOCKS TRUMP'S IMMIGRATION POLICY IN SHOCKING DECISION ON HAITIAN PROTECTIONS\nThe attorneys cited dozens of examples of Trump or Noem describing migrants as MS-13 gang members, murderers, terrorists and people who have it in their \"genes\" to commit crime. They pointed to Trump’s viral debate moment in which he made the unproven claim that Haitian immigrants were eating Ohioans' house pets.\nThe TPS program gives the DHS authority to permit immigrants who might otherwise have no legal status to temporarily reside in the United States because of extraordinary circumstances in their home countries, such as wars or natural disasters.\nThe plaintiffs argued that roughly 61,000 people would lose their TPS as a result of Noem's decision, which would end the immigrants' legal status and work authorizations and make them eligible for deportation.\nThe Trump administration has argued that the statute governing TPS gives DHS secretaries sole discretion over TPS designations and that Noem should be allowed to end the status using the same authority that past secretaries used to grant it.\nCLICK HERE TO GET THE FOX NEWS APP\nIn May, the Supreme Court sided with the Trump administration in an emergency order related to a case involving TPS for Venezuelans. The order temporarily paused a lower court order, clearing the way for Noem to end TPS for about 350,000 immigrants.\nThompson's decision will stay in place until at least November, when the next hearing is scheduled. DHS told Fox News Digital it plans to appeal the decision."
    },
    {
      "url": "https://www.foxnews.com/politics/federal-judge-blocks-trumps-immigration-policy-shocking-decision-haitian-protections",
      "text": "A federal judge shot down the Trump administration’s efforts to end temporary protection status (TPS) for over 520,000 Haitian immigrants currently living in the U.S.\nThe TPS designations for Haitians were expected to expire on Aug. 3 with termination to become effective on Sept. 2.\nU.S. District Judge Brian Cogan in Brooklyn rejected those plans on Tuesday, saying Department of Homeland Security (DHS) Secretary Kristi Noem did not follow a timeline and instructions mandated by Congress to reconsider TPS designations for Haitians.\nIn his decision, Cogan wrote, \"Secretary Noem does not have statutory or inherent authority to partially vacate a country’s TPS designation.\" Doing so, he added, made her actions \"unlawful.\"\nTRUMP ADMIN ENDS TEMPORARY PROTECTED STATUS FOR HAITIAN MIGRANTS CURRENTLY IN THE US\n\"Plaintiffs are likely to (and, indeed, do) succeed on the merits,\" Cogan added.\nHe went on to say Haitians' interests in living and working in the U.S. \"far outweigh\" potential harm to the U.S. government.\nThat being said, the government is still able to freely enforce immigration laws and terminate TPS status as established by Congress.\nFox News Digital reached out to DHS for comment on the matter, but did not hear back by the time of publication.\nSUPREME COURT HANDS TRUMP WIN ON REVOKING PAROLE FOR 500K FOREIGN NATIONALS\nA DHS spokesperson said Friday – before Cogan ruled on the matter – that the decision to end TPS ensures the status is in fact only temporary but also restores the integrity of the U.S. immigration system.\n\"The environmental situation in Haiti has improved enough that it is safe for Haitian citizens to return home,\" the spokesperson said. \"We encourage these individuals to take advantage of the Department’s resources in returning to Haiti, which can be arranged through the CBP Home app. Haitian nationals may pursue lawful status through other immigration benefit requests, if eligible.\"\nNoem originally made the decision to revoke TPS status from Haitians after reviewing a U.S. Citizenship and Immigration Services (USCIS) report showing the island nation no longer met the statutory requirements that grant foreign residents the ability to obtain TPS.\nSUPREME COURT ALLOWS TRUMP ADMIN TO MOVE AHEAD WITH ENDING PROTECTED LEGAL STATUS FOR SOME MIGRANTS\nSources at DHS have told Fox News that they are encouraging Haitians living in the U.S. with TPS to use the CBP Home application to secure a safe departure home by offering a complimentary plane ticket and a $1,000 exit bonus.\nCongress created TPS as part of the Immigration Act of 1990, with the intention of allowing residents of countries who have faced war, disasters or other unsafe and extraordinary conditions, to find refuge in the U.S. The program has the ability to be extended in increments of 18-month periods.\nThe Trump administration has been pressing to roll back TPS designations to fulfill a campaign promise to strengthen the border and deport many illegal immigrants who crossed the border under former President Joe Biden's administration.\nCLICK HERE TO GET THE FOX NEWS APP\nBiden gave Venezuelans TPS status in 2021, then renewed that designation before the end of his term in January 2025.\nThe newest designation will run from April 3, 2025, to Oct. 2, 2026. It is estimated the protection would have applied to about 300,000 Venezuelan nationals, before the Trump administration rolled back the decision.\nFox News Digital’s Preston Mizell and Reuters contributed to this report."
    },
    {
      "url": "https://www.foxnews.com/politics/federal-judge-finds-racial-discriminatory-animus-trump-move-cancel-temporary-protected-status",
      "text": "A federal judge on Friday postponed the Trump administration from revoking the temporary status for Nicaraguan, Honduran and Nepali immigrants, finding the cancellation was likely rooted in racial animus.\nThe 37-page ruling by San Francisco-based U.S. District Judge Trina Thompson, a Biden appointee, argued the move by Homeland Security Secretary Krisiti Noem to cancel the temporary humanitarian protections appeared to be parietally rooted in \"racial and discriminatory animus\" in support of their Fifth Amendment claim.\n\"Color is neither a poison nor a crime,\" the ruling states. \"Therefore, Plaintiffs have provided sufficient evidence to establish that Plaintiffs will likely succeed on the merits of their Fifth Amendment claim.\"\nDHS TERMINATES TEMPORARY PROTECTED STATUS FOR AROUND 76K HONDURAN, NICARAGUAN MIGRANTS\nIn a statement, the Department of Homeland Security likened Thompson's ruling to a New York Times opinion piece.\n\"Restoring integrity to our immigration system to keep our homeland and its people safe. That is all we—and the American people who elected President Trump in a landslide election—seek,\" said DHS Assistant Secretary Tricia McLaughlin. \"TPS was never meant to be a de facto asylum system, yet that is how previous administrations have used it for decades. This is yet another example of how out of control judges are race-baiting to distract from the facts and President’s constitutionally vested powers under Article II. We will appeal, and we expect a higher court to vindicate us.\"\nThe ruling is a reprieve for more than 60,000 immigrants who have been allowed to legally live and work in the United States under the TPS program.\nA White House spokesperson told Fox News Digital that the program was never intended to become permanent.\n\"‘Temporary Protected Status’ is, by definition, temporary. It was never intended to be a pathway to permanent status or legal residency, and no bizarre analysis from radical judges will change that fact,\" White House spokesperson Abigal Jackson said. \"This judge simply did not have lawful authority to review the TPS designation - the Supreme Court already affirmed in prior rulings that extensions of TPS are committed by law to the discretion of the Secretary of Homeland Security.\"\n\"The ruling reads like a left-wing fever dream, not a serious judicial opinion,\" she added. \"Ultimately, the lower court’s ruling will not stand and we look forward to ultimate vindication in this case.\"\nFEDERAL JUDGE BLOCKS TRUMP'S IMMIGRATION POLICY IN SHOCKING DECISION ON HAITIAN PROTECTIONS\nThe Trump administration was poised to end the protections for Honduran and Nicaraguan migrants as it ramps up deportations. TPS was set to expire for Honduras and Nicaragua in September.\nThe decision to end TPS for the two nations comes weeks after DHS terminated the same status for Haiti and months after terminating TPS for Venezuelans. A federal judge has since blocked that termination amid an ongoing legal battle.\nIn her ruling, Thompson noted statements made by Noem, like those that cast illegal immigrants as \"invaders\" or \"criminals,\" \"perpetuate the discriminatory belief that certain immigrant populations will replace the white population.\"\n\"Although the Secretary’s statements ‘may appear innocent or only mildly offensive to one who is not a member of the targeted group,’ the statements are ‘in reality . . . intolerably abusive or threatening when understood from the perspective of a plaintiff who is a member of the targeted group',\" she wrote.\nThe Department of Homeland Security noted that some of the people who \"exploited\" the TPS program include several Hondurans with convictions for aggravated assault, possessing, selling, or manufacturing a dangerous weapon, sex crimes against children, domestic violence and resisting arrest.\nIn May, the U.S. Supreme Court sided with the Trump administration in a ruling that lifted a San Francisco District Court Judge's injunction that temporarily blocked the termination of TPS for Venezuelans, paving the way for the administration to legally revoke TPS for subsequent nations.\nCLICK HERE TO GET THE FOX NEWS APP\nCreated by Congress through the Immigration Act of 1990, TPS allows individuals from countries affected by natural disasters, war, or other dangerous, unusual circumstances to seek refuge in the U.S. This program can be renewed in 18-month increments.\nFox News Digital's Preston Mizell contributed to this report."
    }
  ],
  "argos_summary": "A lawsuit has been filed by the Venezuelan Association of Massachusetts, Democracy Forward, and several migrants against federal immigration agencies, claiming the Trump administration unlawfully ended Temporary Protected Status (TPS) for Venezuelans. The plaintiffs argue that the abrupt termination of TPS disrupts lives and violates legal rights, as many migrants complied with all DHS requirements. A federal judge has previously ruled against the Trump administration's attempts to revoke TPS, citing potential irreparable harm to affected individuals and suggesting that the actions may be motivated by racial bias.",
  "argos_id": "YVNGHZCCN"
}