{
  "url": "https://www.benzinga.com/trading-ideas/movers/25/08/47089494/red-cat-holdings-stock-is-rising-wednesday-whats-going-on",
  "authorsByline": "Adam Eckert",
  "articleId": "144bd668e39346b1914a9058b43b3ccd",
  "source": {
    "domain": "benzinga.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "MI",
      "county": "Wayne County",
      "city": "Detroit",
      "coordinates": {
        "lat": 42.3315509,
        "lon": -83.0466403
      }
    }
  },
  "imageUrl": "https://cdn.benzinga.com/files/images/story/2025/08/13/Red-CatMunich--Bavaria--Germany---March-.jpeg?width=1200&height=800&fit=crop",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-13T09:23:54-04:00",
  "addDate": "2025-08-13T13:33:14.305201+00:00",
  "refreshDate": "2025-08-13T13:33:14.305203+00:00",
  "score": 1.0,
  "title": "Red Cat Holdings Stock Is Rising Wednesday: What's Going On? - Red Cat Holdings (NASDAQ:RCAT)",
  "description": "Red Cat Holdings Inc (NASDAQ:RCAT) shares are trading higher. The company on Wednesday announced that one of its subsidiaries achieved AS9100 certification from NSF International Strategic Registrations.",
  "content": "Red Cat Holdings Inc RCAT on Wednesday announced that one of its subsidiaries achieved AS9100 certification from NSF International Strategic Registrations.\n\nWhat Happened: Red Cat’s Teal Drones subsidiary achieved AS9100 certification, the globally recognized benchmark for quality management in the aviation, space and defense sectors.\n\nThe certifications shows that Teal Drones has met NSF International Strategic Registrations standards across design, manufacturing and maintenance and acts as positive reinforcement of the company’s Black Widow drones.\n\n“Earning AS9100 certification is a major milestone for Teal Drones and comes at a pivotal moment in our growth,” said Mike McCormick, quality system manager at Teal Drones.\n\n“It validates the strength of our processes and the dedication of our team, and it gives our customers added confidence that we can consistently deliver mission-ready systems at scale.”\n\nRed Cat said it’s currently expanding its facilities and manufacturing capabilities to meet rising demand for its family of drone systems.\n\nBy now you're likely curious about how to participate in the market for Red Cat Holdings – be it to purchase shares, or even attempt to bet against the company.\n\nBuying shares is typically done through a brokerage account. You can find a list of possible trading platforms here. Many will allow you to buy “fractional shares,” which allows you to own portions of stock without buying an entire share.\n\nIf you're looking to bet against a company, the process is more complex. You'll need access to an options trading platform, or a broker who will allow you to “go short” a share of stock by lending you the shares to sell. The process of shorting a stock can be found at this resource. Otherwise, if your broker allows you to trade options, you can either buy a put option, or sell a call option at a strike price above where shares are currently trading – either way it allows you to profit off of the share price decline.\n\nRCAT Price Action: Red Cat shares were up 1.79% at $9.67 at the time of publication Wednesday, according to Benzinga Pro.\n• Pentagon Says Trump’s Golden Dome To Feature Satellite, Ground-Based Defenses — Elon Musk’s SpaceX May Miss Out",
  "medium": "Article",
  "links": [
    "https://www.benzinga.com/money/best-stock-trading-platforms",
    "https://www.benzinga.com/pressreleases/25/08/g47087028/red-cats-teal-drones-achieves-globally-recognized-as9100-certification-for-aerospace-and-defense-m",
    "http://benzinga.com/quote/RCAT",
    "https://www.benzinga.com/money/how-to-short-a-stock",
    "http://pro.benzinga.com",
    "https://www.benzinga.com/news/space/25/08/47084266/pentagon-says-trumps-golden-dome-to-feature-satellite-ground-based-defenses-elon-musks-spacex-may-miss-out"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Red Cat shares",
      "weight": 0.11913931
    },
    {
      "name": "Red Cat Holdings Stock",
      "weight": 0.11115599
    },
    {
      "name": "Red Cat Holdings",
      "weight": 0.10677981
    },
    {
      "name": "Red Cat Holdings Inc",
      "weight": 0.10282341
    },
    {
      "name": "Red Cat Holdings Inc RCAT",
      "weight": 0.10235613
    },
    {
      "name": "Red Cat",
      "weight": 0.09974094
    },
    {
      "name": "shares",
      "weight": 0.08794192
    },
    {
      "name": "Teal Drones",
      "weight": 0.084259294
    },
    {
      "name": "NSF International Strategic Registrations standards",
      "weight": 0.07492962
    },
    {
      "name": "Red Cat’s Teal Drones subsidiary",
      "weight": 0.07405158
    }
  ],
  "topics": [
    {
      "name": "Stocks"
    },
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.97314453125
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.96875
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.9541015625
    },
    {
      "name": "/Business & Industrial/Aerospace & Defense/Other",
      "score": 0.4443359375
    }
  ],
  "sentiment": {
    "positive": 0.79617727,
    "negative": 0.03024449,
    "neutral": 0.17357825
  },
  "summary": "Red Cat Holdings (NASDAQ:RCAT) has reported that one of its subsidiaries, Teal Drones, has achieved AS9100 certification from NSF International Strategic Registrations. This certification is a globally recognized benchmark for quality management in the aviation, space and defense sectors. The certifications support the company's Black Widow drones. Red Cat shares were up 1.79% at $9.67 at the time of publication Wednesday. The company is expanding its facilities and manufacturing capabilities to meet increasing demand for its drone systems.",
  "shortSummary": "Red Cat Holdings Inc. rose 1.79% after achieving AS9100 certification for its subsidiary, Teal Drones, enhancing its manufacturing capabilities and potential for future growth.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "79d6c3c824ef4999b553292d6c7faca2",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.benzinga.com/pressreleases/25/08/g47087028/red-cats-teal-drones-achieves-globally-recognized-as9100-certification-for-aerospace-and-defense-m",
      "text": "SAN JUAN, Puerto Rico, Aug. 13, 2025 (GLOBE NEWSWIRE) -- Red Cat Holdings, Inc. RCAT (\"Red Cat\"), a drone technology company integrating robotic hardware and software for military, government, and commercial operations, today announced that its wholly owned subsidiary, Teal Drones, has achieved AS9100 certification from NSF International Strategic Registrations (NSF-ISR), a leading global certification body for aerospace and defense quality systems.\nThe AS9100 standard, developed by the International Aerospace Quality Group (IAQG) and based on ISO 9001, is the globally recognized benchmark for quality management in the aviation, space, and defense sectors. It includes aerospace-specific requirements that strengthen quality control, safety, and traceability. The certification confirms that Teal Drones meets these demanding standards across the full product lifecycle, covering design, manufacturing, and maintenance, ensuring consistent quality, reliability, and performance for customers and partners worldwide.\nAchieved in July 2025, the certification is the result of a rigorous audit process that validates Teal's dedication to operational excellence, continuous improvement, and process innovation. Meeting strict aerospace quality and safety standards, Teal Drones will continue to increase product reliability, streamline workflows, reduce waste, and strengthen customer satisfaction. The certification signals to buyers and partners that Red Cat's Black Widow™ drones are supported by a robust quality management system, reinforcing the safety and trust of doing business with the company.\n\"Earning AS9100 certification is a major milestone for Teal Drones and comes at a pivotal moment in our growth,\" said Mike McCormick, Quality System Manager at Teal Drones. \"It validates the strength of our processes and the dedication of our team, and it gives our customers added confidence that we can consistently deliver mission-ready systems at scale. This certification comes at a time when we are expanding our facilities and manufacturing capabilities to meet rising demand for our drones while maintaining the highest standards the industry requires.\"\nThe Black Widow, part of Red Cat's Family of Systems, is a secure, NDAA-compliant ISR drone that was selected as the winner of the U.S. Army's Short-Range Reconnaissance (SRR) Program. It is designed to deliver real-time intelligence at the tactical edge and is built to meet the mission-critical needs of U.S. and allied forces. The AS9100 certification reinforces Red Cat's role as a trusted domestic manufacturer committed to strengthening the resilience of America's drone industrial base, ensuring that advanced, high-performing unmanned systems are designed, built, and serviced in the United States.\nAbout Red Cat, Inc.\nRed Cat RCAT is a U.S.-based provider of advanced all-domain drone and robotic solutions for defense and national security. Through its wholly owned subsidiaries, Teal Drones and FlightWave Aerospace, Red Cat develops American-made hardware and software that support military, government, and public safety operations across air, land, and sea. Its Family of Systems, led by Black Widow™, delivers unmatched tactical capabilities in small unmanned aircraft systems (sUAS). Expanding into the maritime domain, Red Cat is also innovating in uncrewed surface vessels (USVs) and autonomous underwater vehicles (AUVs), delivering integrated platforms designed to enhance safety and multi-domain mission effectiveness. Learn more at www.redcat.red.\nForward-Looking Statements\nThis press release contains \"forward-looking statements\" that are subject to substantial risks and uncertainties. All statements, other than statements of historical fact, contained in this press release are forward-looking statements. Forward-looking statements contained in this press release may be identified by the use of words such as \"anticipate,\" \"believe,\" \"contemplate,\" \"could,\" \"estimate,\" \"expect,\" \"intend,\" \"seek,\" \"may,\" \"might,\" \"plan,\" \"potential,\" \"predict,\" \"project,\" \"target,\" \"aim,\" \"should,\" \"will,\" \"would,\" or the negative of these words or other similar expressions, although not all forward-looking statements contain these words. Forward-looking statements are based on Red Cat Holdings, Inc.'s current expectations and are subject to inherent uncertainties, risks and assumptions that are difficult to predict. Further, certain forward-looking statements are based on assumptions as to future events that may not prove to be accurate. These and other risks and uncertainties are described more fully in the section titled \"Risk Factors\" in the final prospectus related to the public offering filed with the Securities and Exchange Commission. Forward-looking statements contained in this announcement are made as of this date, and Red Cat Holdings, Inc. undertakes no duty to update such information except as required under applicable law.\nContacts:\nINVESTORS:\nE-mail: Investors@redcat.red\nNEWS MEDIA: Indicate Media\nPhone: (347) 880-2895\nEmail: peter@indicatemedia.com\nEdge Rankings\nPrice Trend\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
      "url": "https://www.benzinga.com/news/space/25/08/47084266/pentagon-says-trumps-golden-dome-to-feature-satellite-ground-based-defenses-elon-musks-spacex-may-miss-out",
      "text": "The Pentagon has said that President Donald Trump's $175 billion Golden Dome missile defense system will have four layers of protection as the 2028 deadline looms.\nBlending Satellite and Ground-Based Defenses\nThe Pentagon reportedly showcased around 3,000 defense contractors a slide show that illustrated the system's complex inner workings during an event in Alabama, Reuters reported on Tuesday.\nThe system still faces uncertainty as the exact figure of key components, including launchers, interceptors, ground stations, as well as missile sites, has not been determined by the Pentagon, the report suggests.\nThe defenses include a satellite-based sensing and missile tracking layer, which also has a ‘missile defense' system. The other layers are ground-based and include radar, interceptors, as well as \"lasers,\" the report suggests.\nNo Mention Of SpaceX\nWhile the slideshow mentioned defense giant Lockheed Martin Corp LMT, Northrop Grumman Corp NOC, as well as Boeing Co. BA, the slides did not mention Elon Musk's commercial space exploration company, SpaceX.\nSpaceX was reportedly a frontrunner to secure government contracts for the Golden Dome system alongside Peter Thiel's software company Palantir Technologies Inc. PLTR.\nU.S. Government Opened Invitations To Begin Bidding Process\nThe news comes as the Trump administration was preparing to invite private proposals for the system under the Scalable Homeland Innovative Enterprise Layered Defense or SHIELD initiative.\nThe 10-year plan seeks to fund contracts for a wide array of applications, including R&D, Cybersecurity, as well as the deployment of defense systems against cruise, hypersonic and ballistic missiles.\nL3 Harris’ Hypersonic Missile Tracking Satellite, Joby Eyes Defense Contracts\nElsewhere, the Golden Dome system has attracted a lot of defense bidders, with L3Harris Technologies Inc. LHX saying it can deploy over 45 hypersonic missile tracking satellites for the defense system. Meanwhile, Joby Aviation Inc. JOBY CEO JoeBen Bevirt says that the company sees a lot of potential in the Pentagon’s $9.4 billion budget for uncrewed aircraft.\nJoby also recently announced a partnership with L3 Harris to build hybrid military aircraft that will be capable of crewed as well as autonomous operations.\nCheck out more of Benzinga's Future Of Mobility coverage by following this link.\nRead Next:\nPhoto courtesy: Shutterstock\nEdge Rankings\nPrice Trend\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
      "url": "https://www.benzinga.com/money/how-to-short-a-stock",
      "text": "If you're interested in learning how to short stocks, get an edge over other traders with Benzinga Pro while we're currently offering a 14-day trial.\nIt’s easy to understand that you make money after buying a stock when the stock price increases. Traders who want to profit from a declining market can use a strategy called shorting stock. Continue reading to find out how you short a stock.\nQuick Look at How to Short a Stock:\n- Research: Identify a stock that you believe will decrease in value.\n- Borrow Shares: Borrow shares of the stock from your broker through a margin account.\n- Sell Shares: Sell the borrowed shares on the open market at the current market price.\n- Wait for Price to Drop: Monitor the stock’s price and wait for it to decrease.\n- Buy Back Shares: Once the price drops to your desired level, buy back the shares from the market.\n- Return Shares: Return the shares to your broker to close out the short position.\n- Profit/Loss: The difference between the price at which you sold the shares and the price at which you bought them back determines your profit or loss.\n- What Does it Mean to Short a Stock?\n- How Do You Do It?\n- An Example\n- See All 13 Items\nWhat Does it Mean to Short a Stock?\nTraders called short sellers use a short selling strategy to speculate on a future market fall of a particular share price.\n- Shorting a stock first involves borrowing the stock you wish to sell at a market-determined interest rate and then selling the borrowed equities to take advantage of a future market decline.\n- You profit by selling the borrowed stock at a higher price and subsequently buying it back at a lower price if the stock price falls. The profit consists of the difference between the price at which the trader sold the stock and the price they buy it back at less any borrowing and transaction costs.\nYou can also lose money if the market rises instead of declines as you expected when you initiated the position. This can be particularly problematic and cause something called a “short squeeze” if a large short position accumulates in a stock and significant buying interest subsequently emerges. Retail investors can take action here if they feel comfortable, and they will simply wait as the price declines further.\nStockbrokers generally have a stock loan arrangement with other clients and brokers where the broker pays a certain amount to borrow requested stock, if available. This arrangement allows the broker to use its customer’s stock held in margin accounts or to borrow stock from other brokers to facilitate its other clients’ short sales.\nSome market participants feel that this is a form of market manipulation, but it’s akin to seizing on an opportunity. Stocks often don’t fall into a position where shorting will make sense, and that’s it’s not a popular investment strategy.\nTypically, the fee for a stock loan on a liquid exchange traded stock is 0.30% per annum. If the stock is difficult to borrow, the stock loan fee could go up substantially.\nIn 2010, the U.S. Securities and Exchange Commission (SEC) implemented its alternative uptick rule, known as Rule 201, that lets investors in a stock exit their long positions before any short selling can legally occur. The rule becomes active if a stock’s price falls more than 10% in a single day. Short selling is then only allowed “if the price of the security is above the current national best bid.” The goal of this rule is to preserve investor confidence and promote market stability during times of high volatility and extreme selling pressure in a stock.\nHow Do You Do It?\nWhile it may sound complicated because of the borrowing aspect, the process of shorting a stock is actually pretty easy to put into practice. Shorting a stock can be explained in four simple steps:\n- The short seller asks their broker to borrow the stock they intend to sell from a holder willing to loan out their stock. They will need to pay a certain interest rate to the stockholder known as the broker loan rate.\n- They then either sell the stock they borrowed at the current market price or they place a limit order to sell it at a specific price and await execution of that order.\n- Once the short seller has successfully established a short position in the stock, they can close out that position by buying back the stock in the market, ideally at a lower price. This is known as “buying to cover.”\n- The borrowed stock is then returned to the owner with interest via the short seller’s brokerage account along with any dividends earned while the stock was borrowed.\nAn Example\nThe following example illustrates the concept of shorting stock using a specific company that had dropped significantly in January 2021.\nThe Company\nAcelRx Pharmaceuticals Inc. (NASDAQ:ACRX) is a specialty pharmaceutical company that saw its shares drop by over 16% in late January of 2021. The decline was attributed in large part to the company’s announcement of a secondary stock offering of 14.5 million new shares that would generate an additional $27.5 million for the company. This created quite a lot of downside risk.\nBeginning the Short Selling Process\nA short seller might expect that AcelRx’s stock price would decline after the stock offering was announced. To take advantage of this anticipated drop, the short seller would contact their broker to borrow the shares they need. As an example, they might ask for a loan of 1,000 shares of AcelRx. The short seller then places an order to sell the borrowed shares at a desired sell price.\nThe short seller could have sold the borrowed AcelRX stock at $2.80 on January 20 and bought back their short stock the next day for $2 per share. Had they done that, they would have realized a profit of $0.80 per share or $800 on a 1,000 share position.\nThe Result of Shorting a Stock\nAfter the announcement of the secondary offering, AcelRX stock declined significantly. This gave the short seller the opportunity to cash in their profits the very next day. If the short seller had not covered their short position quickly, the stock’s subsequent rebound may have cost the short seller money instead of allowing them to realize a profit.\nKeep in mind that the short seller is liable to pay any dividends received from the borrowed stock to the lender of the stock being shorted. The formula used for calculating the rate of return on a shorted security is as follows:\nRate of Return = (Sales proceeds from the short sale - dividends paid to stock lender - purchase price of the stock) / Initial margin requirement\nIn the above equation, the initial margin requirement is the proportion of the total market value of the securities that the short seller has to put up in cash to hold their short position.\nA margin account holder can borrow up to 50% of the equity in their trading account for the purchase of new securities or for short sales on normally traded stocks. A margin account also stipulates a maintenance margin that is typically 30% of the equity value. If the account’s equity falls below this maintenance margin level, the broker will issue a margin call to ask the client to take steps to bring the equity back to 50% within a given time frame. If that is not done promptly, then the client’s positions can be liquidated by the broker.\nMargin trading accounts have their own set of rules and minimum deposits depending on the broker and the stock you plan on shorting. Remember to check with your broker for information about how much of a particular stock you can sell short in your margin account and what your account’s maintenance margin level is.\nBest Online Brokers\nTake a look at these recommended stock brokers for your shorting needs.\n- Best For:Active and Global TradersVIEW PROS & CONS:Securely through Interactive Brokers’ website\n- Best For:Momentum tradersVIEW PROS & CONS:securely through Centerpoint Securities's website\n- Best For:Day Traders and ScalpersVIEW PROS & CONS:securely through Guardian Trading's website\n- Best For:Active Short Sellers With Modest CapitalVIEW PROS & CONS:securely through TradeZero's website\n- Best For:High-Capital Short SellersVIEW PROS & CONS:securely through Cobra Trading's website\nWhat to Know Before Short Selling\nIf you’re considering shorting a stock, make sure you’re informed about your broker’s requirements before you borrow stock to short. You should also be aware of any special circumstances that could make the stock rally before you cover your short position. The following list includes some things you should keep in mind before selling a stock short.\n- The security used for shorting should be liquid since illiquid stocks tend to be harder for brokers to borrow.\n- A trader who intends to short a stock should maintain a funded margin account with their broker, since margin is needed for shorting a stock.\n- Shorting is done by borrowing stock, so the broker will charge interest on that loan to pay to the stockholder. A short seller’s profit earned will be trimmed to that extent.\n- Short selling may be restricted on some stocks due to a low supply of available stock.\n- Stock borrowing costs can rise significantly under certain market conditions.\n- Shorting stocks is not allowed in your IRA account or in any other tax-deferred account.\nUsing Put Options\nShorting could lead to staggering losses if the shorted stock continues to move higher. A safer alternative to shorting a stock is buying a put option that gives you the right, but not the obligation, to sell the underlying security at the strike price on or before the expiration of the option.\nFor example, if you buy one $50 strike put option on ABC stock for $1.50 when it is “at the money” so that the underlying stock’s price is equal to the put option’s strike price, then that gives you the right to sell 100 shares of ABC stock at $50 up until the option’s expiration. You stand to make a profit on that option if the price of the stock drops below $48.50 by expiration since you paid $1.50 to purchase the put option.\nWhen you exercise the put option, you sell the stock at the strike price. You can then pocket the difference between the strike price minus the $1.50 you paid for it and the sale price of the stock.\nAlternatively, you can sell the put option contract before it expires. If the market has since declined, you might make a profit on your initial investment. This can sometimes fetch you better returns than what you might gain by shorting the stock, especially if relatively little time has passed and volatility in the stock has risen.\nRisks\nBefore you begin shorting stocks, it’s important to understand all the risks associated with this type of trade.\nBeware of a Short Squeeze\nOne of the key risks associated with shorting stocks is known as a “short squeeze.” This can occur when unexpected positive news concerning the company or the market triggers a notable upward move in a stock that has attracted considerable short interest. This can then send shorts sellers scurrying to cover their positions to minimize their losses.\nA perfect example of a short squeeze can currently be seen in the stock of GameStop. Some analysts estimate that the stock has a short interest of almost 140% of the total float of the company’s stock. When short sellers chase the security higher to cover their short positions, demand perks up from technical traders, which can trigger a further sharp rise in the price of a stock.\nAnother risk that can fuel a short squeeze comes from something called buy-ins. This occurs when a broker is forced to close out a short position in a highly non-liquid stock since the lender demands their security back, perhaps because they want to close out their long position.\nBuy-ins and short sellers rushing to cover their positions have thus far pushed the price of GameStop stock to dizzying heights well beyond its fundamental valuation as a company. The massive short squeeze has also bankrupted professional hedge funds that have been short the stock for years.\nDespite such pitfalls, shorting as a trading strategy is here to stay, primarily because it offers traders the opportunity to make money even in a downward trending stock market.\nIs Shorting Stock Right for You?\nAlthough shorting stocks has its associated risks, the trading strategy can show high returns if done correctly and at the right times. Make sure to carefully perform your research on any stock before initiating a short position. If you’re ready to start selling stocks short, check out Benzinga’s list of the best online stock brokers for shorting.\nFrequently Asked Questions\nCan I short any stock?\nNot all stocks can be shorted; it depends on the brokerage and market conditions. Some stocks may be hard to borrow or have restrictions.\nWhat fees or costs are associated with short selling?\nShort sellers may incur borrowing fees, margin interest and any dividends paid if the stock pays them while you are short.\nIs short selling recommended for beginner investors?\nShort selling is generally considered risky and may not be recommended for beginners due to its complexity and potential for significant losses.\nAbout Ryan Peterson\nRyan Peterson is a seasoned personal finance writer with a Bachelor’s Degree in Business from Indiana University. With over five years of experience, Ryan has crafted insightful content for multiple finance websites, including MoneyLion At Benzinga, he brings his expertise and passion for helping readers navigate the complex world of personal finance and investing, empowering them to make informed financial decisions."
    },
    {
      "url": "https://www.benzinga.com/money/best-stock-trading-platforms",
      "text": "Online stock trading platforms have revolutionized how investors access and participate in the markets. With just a few clicks, you can execute trades, monitor portfolios and conduct in-depth research from anywhere.\nBut with so many options, how do you choose the right platform for your financial goals? This guide will explore the best online stock trading platforms available, highlighting their features, fees and who they’re best suited for to help you get started on your investing journey.\nBest Online Stock Trading Platforms\n- Charles Schwab — Best for All-Around Value\n- Fidelity — Best for Research\n- E*Trade — Best User-Friendly Platform\n- Interactive Brokers — Best for Global Trading\n- Webull — Best for Advanced Charting\nHow We Chose the Best Online Stock Trading Platforms\nTo choose the best online stock trading platforms, we evaluated their fees, investment product variety, platform usability and quality of research and educational tools.\nBest Online Stock Trading Platforms\nCharles Schwab — Best for All-Around Value\n- Best For:Fund InvestingVIEW PROS & CONS:securely through Charles Schwab's website\nCharles Schwab offers a well-rounded experience for all types of investors. Its acquisition and integration of TD Ameritrade’s thinkorswim platform have cemented its position as a top choice for active traders, while its commitment to commission-free trading, extensive research and broad range of investment products make it equally appealing to long-term investors and beginners. Schwab provides robust tools, comprehensive education and strong customer support.\nKey Features:\n- Fees: Charles Schwab offers commission-free trading of U.S.-listed stocks, exchange-traded funds (ETFs) and options. Options incur a $0.65 per-contract fee. There are generally no account minimums for opening a standard brokerage account. While most online trades are free, some exceptions apply, such as over-the-counter (OTC) equities and certain transaction-fee mutual funds.\n- Investment Access: Schwab provides access to a variety of investment products, including stocks, ETFs, no-transaction fee mutual funds, bonds, certificates of deposit (CDs), options, futures and forex. It also offers robo advisory services and full-service financial advising.\n- Platform Experience: Schwab’s multiple platforms include the main Schwab.com website, which is user-friendly and great for general investing and research; thinkorswim, available as a desktop platform, web platform or mobile app for active traders; and the Schwab Mobile app for on-the-go trading and account management.\n- Tools/Education Highlights: Schwab’s research and educational resources include third-party analysis, stock and ETF screeners, market commentary, and news feeds. Its educational content covers everything from investing basics to advanced trading strategies, delivered through articles, videos, podcasts, live coaching and webcasts. The paperMoney virtual trading environment in thinkorswim allows users to practice strategies risk-free.\n- Drawbacks: Thinkorswim can be overwhelming for beginners. Schwab does not offer direct cryptocurrency trading, though it provides indirect access through crypto-related ETFs and mutual funds. Basic trades are free, but some fees apply to less common transactions or broker-assisted trades.\nWho It’s Best For: Beginners looking for low-cost investing and educational support and active traders who want sophisticated tools and extensive market access through the thinkorswim platform.\nFidelity — Best for Long-Term Growth\n- Best For:Stock ResearchVIEW PROS & CONS:securely through Fidelity Investments's website\nFidelity’s robust and user-friendly investment app makes it an excellent choice for investors focused on long-term wealth accumulation. It combines commission-free trading with a wealth of educational resources, top-tier research and exceptional customer service, providing a secure and supportive environment for investors who want to build a diversified portfolio and achieve their long-range financial goals.\nKey Features:\n- Fees: Fidelity offers commission-free trading for online U.S. stocks, ETFs and options. Options incur a $0.65 per contract fee. There are no account minimums to open an account, and Fidelity’s own index funds often have a zero expense ratio. Most non-trading fees, like account maintenance or electronic transfers, are also free.\n- Investment Access: Investors can choose from a variety of investments, including U.S. and international stocks, more than 3,700 no-transaction fee mutual funds, a wide selection of ETFs, options, bonds and CDs. Fidelity also offers fractional shares on most U.S. stocks and ETFs, enabling beginners to invest with as little as $1 and build diversified portfolios.\n- Platform Experience: The intuitive interface balances simplicity with powerful functionality. Beginners can easily navigate to buy and sell securities, track portfolio performance, and access research. The app supports mobile check deposit, bill pay and customizable watchlists. The Active Trader Pro is a desktop platform with advanced charting, real-time data and customizable layouts. The Fidelity mobile app is easy to use for managing portfolios, research and trading on the go. The Trading Dashboard offers a consolidated view of market data, research and trading directly on the web.\n- Tools/Education Highlights: Fidelity provides free, independent research from more than 20 third-party providers; advanced screeners for stocks, ETFs and mutual funds; and powerful charting tools with various indicators. The platform has news feeds, market commentary and alerts. Educational content covers everything from investment basics to advanced trading strategies through articles, videos and interactive coaching sessions.\n- Drawbacks: The breadth of Fidelity’s offerings and research may be overwhelming for someone seeking the absolute simplest interface. The platform may not cater to extremely niche or highly specialized trading needs.\nWho It’s Best For: Beginners and serious long-term investors who want a reputable, full-service broker with a user-friendly mobile app, educational resources, commission-free trading and excellent customer support.\nE*Trade — Best User-Friendly Platform\nE*Trade offers a combination of easy-to-use platforms and tools catering to both new investors and active traders. Its emphasis on commission-free trading for stocks and ETFs, coupled with competitive pricing for options and futures, makes it a good choice for traders at all levels. Its well-designed mobile apps and Power E*Trade platform provide advanced features for investors who want more control over their trades.\nKey Features:\n- Fees: E*Trade offers commission-free trading on stocks, options, mutual funds and ETFs. Options contacts incur a $0.65 per trade fee.\n- Investment Access: E*Trade provides a range of investment choices, including stocks, ETFs, no-transaction-fee mutual funds, bonds, CDs and options. It also offers access to futures, and various retirement and managed portfolio solutions. Direct cryptocurrency trading is not available, but crypto-related ETFs and futures can be traded.\n- Platform Experience: E*Trade offers two web platforms and corresponding mobile apps: the standard E*Trade Web and the more advanced Power E*Trade. E*Trade Web is easy to navigate and ideal for beginners or people with simpler investing needs. Power E*Trade is designed for active traders and features advanced charting, analytical tools, customizable dashboards and complex order types.\n- Tools/Education Highlights: E*Trade’s research and educational content include proprietary insights from Morgan Stanley, third-party research from providers like Thomson Reuters and Morningstar, advanced screeners for various asset classes, and real-time market data. Its library covers topics for all skill levels, from investing fundamentals to options strategies, delivered through articles, videos and webinars.\n- Drawbacks: E*Trade does not offer direct access to international stock exchanges. Fractional share trading is primarily for dividend reinvestment or through its robo-adviser, not for direct purchases of all stocks. Interest rates on uninvested cash in default sweep programs are lower than dedicated high-yield savings accounts.\nWho It’s Best For: New investors who want an easy-to-use platform with comprehensive investment options and active traders who are focused on options and futures.\nInteractive Brokers — Best for Global Trading\n- Best For:Active and Global TradersVIEW PROS & CONS:Securely through Interactive Brokers’ website\nInteractive Brokers (IBKR) is renowned for its advanced trading tools, low costs and access to global markets. Its desktop platform, Trader Workstation, is powerful, but its mobile app brings much of that sophistication to your fingertips. It’s a good choice for active traders who want advanced order types, extensive research and the ability to trade a variety of assets across numerous international exchanges.\nKey Features:\n- Fees: IBKR’s competitive pricing includes the Lite plan with zero commission on U.S. exchange-listed stocks and ETFs. For more active traders on the Pro tier, trades range from $0.0005 to $0.0035. Per share. There are no account minimums.\n- Investment Access: Provides access to more than 160 markets in 33 countries, allowing trading in stocks, options, futures, currencies, bonds and funds. It also offers fractional share trading.\n- Platform Experience: IBKR offers different platforms to suit different experience levels. The feature-rich desktop Trader Workstation platform is suitable for advanced and active traders. IBKR Desktop combines popular TWS tools with even more features. For traders on the go, there’s IBKR Mobile and IBKR GlobalTrader. The Client Portal is an easy-to-use web platform for account management and basic trading.\n- Tools and Education: Offers tools like IBKR GlobalAnalyst for international portfolio diversification, a Bond Marketplace and a Mutual Fund Marketplace. It provides educational resources and webinars..\n- Drawbacks: The breadth of features and platforms can be overwhelming for beginners.\nWho It’s Best For: Experienced and active traders who want extensive market access, advanced tools and competitive pricing for international investments.\nWebull — Best for Advanced Charting\nWebull's commission-free trading platform targets tech-savvy and active retail traders, offering a sleek mobile-first experience combined with robust charting and analytical tools. This design appeals to users who appreciate a modern interface and seek in-depth market data and customizable analysis features.\nKey Features:\n- Fees: Webull offers commission-free trading for online U.S. stocks, ETFs and options, which incur a regulatory fee but no per-contract commission. There are no account minimums and no inactivity or maintenance fees.\n- Investment Access: Webull focuses on U.S. exchange-listed stocks, ETFs and options. It also offers cryptocurrency and futures trading. Fractional shares are available for a range of U.S. stocks and ETFs.\n- Platform Experience: Webull’s mobile app is a major draw for younger investors and people who want to manage their investments on the go. The desktop and web platforms mirror much of the app’s functionality, providing advanced charting capabilities, technical indicators and customizable layouts. The interface is designed for easy use.\n- Tools/Education Highlights: Webull provides real-time market data, charting tools with many technical indicators and screeners to identify trading opportunities. It offers access to news feeds, analyst ratings and community features where traders can share ideas.\n- Drawbacks: The research offerings may not be as in-depth as those found on platforms like Fidelity or Schwab, which integrate third-party professional research.\nWho It’s Best For: Active retail traders who prefer a mobile-first experience, value commission-free trading and want advanced charting and analytical tools without the complexity of traditional professional platforms.\nChoosing the Best Online Stock Trading Platform\nThe best platform for you will align with your investing goals and trading style, whether you’re a beginner seeking education or an active trader needing advanced tools and global reach.\nFor all around-value, Charles Schwab is a great choice, while Fidelity stands out for in-depth research. E*Trade offers user-friendly access, and Interactive Brokers is a standout for global trading. Webull excels for investors who want advanced charting tools.\nFrequently Asked Questions\nWhat is the cheapest online trading platform for stocks?\nMany platforms now offer commission-free trading on U.S. stocks and ETFs, but Webull, Fidelity and Charles Schwab are standouts for low costs. They provide free trades with no account minimums, making them ideal for budget-conscious investors.\nWhat platform is best for beginner investors?\nFidelity and Charles Schwab are excellent choices for beginners. They offer intuitive interfaces, extensive educational resources and access to commission-free trades. These features help new investors learn the ropes while keeping costs low.\nWhich trading platform is best for active traders?\nInteractive Brokers and Charles Schwab’s thinkorswim platform are top options for active traders. They provide advanced charting, customizable order types and tools to execute complex strategies, along with competitive pricing for high-volume trading."
    }
  ],
  "argos_summary": "Red Cat Holdings Inc's subsidiary, Teal Drones, has achieved AS9100 certification from NSF International, marking a significant milestone in quality management for the aviation, space, and defense sectors. This certification validates Teal Drones' adherence to rigorous standards in design, manufacturing, and maintenance, enhancing customer confidence in their Black Widow drones. The company is also expanding its facilities to meet increasing demand for its drone systems.",
  "argos_id": "ZV4ZV5UE7"
}