{
  "url": "https://www.cnbc.com/2025/08/13/older-student-loan-delinquencies-under-trump.html",
  "authorsByline": "Annie Nova",
  "articleId": "77eded9af9714626b73b2dc086da7131",
  "source": {
    "domain": "cnbc.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NJ",
      "county": "Bergen County",
      "city": "Englewood Cliffs",
      "coordinates": {
        "lat": 40.8853773,
        "lon": -73.9523597
      }
    }
  },
  "imageUrl": "https://image.cnbcfm.com/api/v1/image/108184725-1755007913404-gettyimages-1434359674-22082022dsc01517.jpeg?v=1755007927&w=1920&h=1080",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-13T13:05:01+00:00",
  "addDate": "2025-08-13T13:12:49.736260+00:00",
  "refreshDate": "2025-08-13T13:12:49.736263+00:00",
  "score": 1.0,
  "title": "Older student loan borrowers face high delinquency rates as Trump administration ramps up collections",
  "description": "There's still time for older student loan borrowers who are behind on their bills to avoid default, and garnishment of their retirement benefits and wages.",
  "content": "There's still time to prevent default\n\nThere are key differences between student loan delinquency and default. While becoming delinquent for 90 days or more on your student loans can show up on your credit report and lower your score, the more severe consequences of federal collection activity don't usually start until you're more than 270 days late and eventually fall into default, said higher education expert Mark Kantrowitz. Meanwhile, private lenders typically consider student borrowers in default after 120 days without a payment, he said. Delinquent student loan borrowers have time to get current, said certified financial planner Douglas Boneparth, president of Bone Fide Wealth in New York. \"For those struggling, the first step is to explore all available federal repayment options, especially income-driven repayment plans, which can significantly lower monthly payments and prevent default,\" said Boneparth, who is also a member of the CNBC Financial Advisor Council. You can try to find a repayment plan with monthly bills you can afford at Studentaid.gov.\n\nThe so-called Income-Based Repayment plan is one of what may be a dwindling number of manageable repayment options left to borrowers, after recent court actions and the passage of President Donald Trump's tax and spending bill. That legislation phases out several other repayment plans. There are tools from the Education Department to help you determine how much your monthly bill would be under different plans. Struggling borrowers can also see if they're eligible to pause their payments, such as through a forbearance or economic hardship deferment — though it's important to check if your debt will accrue interest during the reprieve. \"Requesting a temporary forbearance can buy time, but ideally, borrowers should aim for an affordable, sustainable payment plan rather than stop-gap measures,\" Boneparth said.\n\nOlder student loan borrowers who are behind on their payments received some good news earlier this summer: The Department of Education has paused its plan to garnish defaulted borrowers' Social Security benefits. Normally, Social Security recipients can see their checks reduced by up to 15% to pay back their defaulted student loan. An Education Department spokesperson told CNBC in an email Tuesday that the department has not offset any Social Security benefits since restarting collections on May 5 and has paused future Social Security offsets. Still, older borrowers should take steps to get their debt out of delinquency as quickly as possible and avoid becoming at risk for more punishing collection activity, said AARP's Trawinski. While the Trump administration said in June that it was pausing Social Security offsets, \"what they did not do is issue a formal rule or regulation saying they won't do so in the future,\" Trawinski said. As a result, she said, \"there's an expectation that they will at some point resume those garnishments.\" For those older borrowers who are still working, the Education Department can also garnish up to 15% of your disposable, or after-tax, pay, toward a defaulted student loan, Kantrowitz said. \"We anticipate wage garnishment to begin later this summer,\" a spokesperson for the Education Department told CNBC on Aug. 5.",
  "medium": "Article",
  "links": [
    "https://www.cnbc.com/2025/08/04/a-bearish-double-top-pattern-just-formed-in-the-dow-what-that-means.html",
    "https://www.cnbc.com/advisor-council/",
    "https://www.cnbc.com/2025/07/25/student-loan-forgiveness-tax-trump-big-beautiful-bill.html",
    "https://www.cnbc.com/2025/08/07/nvidia-gets-price-target-hike-from-goldman-sachs-ahead-of-earnings.html",
    "https://www.cnbc.com/2025/07/25/trump-stimulus-check-tariff-rebate.html",
    "https://studentaid.gov/help-center/answers/article/ibr-plan",
    "https://studentaid.gov/loan-simulator/",
    "https://studentaid.gov/sites/default/files/EconomicHardshipDeferment.pdf",
    "https://www.cnbc.com/2024/01/11/how-paying-student-debt-could-boost-your-401k-balance.html",
    "https://www.cnbc.com/2025/06/02/trump-pauses-social-security-benefit-cuts-over-defaulted-student-loans.html",
    "https://studentaid.gov/manage-loans/repayment/plans",
    "https://studentaid.gov/manage-loans/lower-payments/get-temporary-relief/forbearance",
    "https://www.cnbc.com/donald-trump/",
    "https://www.cnbc.com/2025/05/17/student-loan-borrowers-how-to-avoid-delinquency-default-garnishment.html",
    "https://www.cnbc.com/2025/08/04/student-loan-borrowers-tell-cnbc-how-the-end-of-save-may-affect-you.html",
    "https://www.ed.gov/about/news/press-release/us-department-of-education-begin-federal-student-loan-collections-other-actions-help-borrowers-get-back-repayment",
    "https://www.cnbc.com/2025/08/04/the-charts-show-tesla-shares-could-be-on-the-verge-of-a-big-swing-katie-stockton-says.html",
    "https://www.cnbc.com/2025/05/12/defaulted-student-loan-borrowers-and-wage-garnishment-what-to-know.html",
    "https://www.newyorkfed.org/microeconomics/hhdc/background",
    "https://www.cnbc.com/2025/08/05/caterpillar-eaton-industrial-earnings-tariff-trump.html"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Older student loan borrowers",
      "weight": 0.10886783
    },
    {
      "name": "Delinquent student loan borrowers",
      "weight": 0.10699261
    },
    {
      "name": "student loan delinquency",
      "weight": 0.09478467
    },
    {
      "name": "older borrowers",
      "weight": 0.088815965
    },
    {
      "name": "several other repayment plans",
      "weight": 0.085276246
    },
    {
      "name": "borrowers",
      "weight": 0.084851466
    },
    {
      "name": "Struggling borrowers",
      "weight": 0.083259605
    },
    {
      "name": "Social Security offsets",
      "weight": 0.078102835
    },
    {
      "name": "Social Security",
      "weight": 0.077481076
    },
    {
      "name": "future Social Security offsets",
      "weight": 0.0762604
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/Finance/Credit & Lending/Loans",
      "score": 0.6640625
    }
  ],
  "sentiment": {
    "positive": 0.12312233,
    "negative": 0.55233514,
    "neutral": 0.32454258
  },
  "summary": "The Trump administration is increasing student loan delinquency rates among older student loan borrowers as it ramps up collections. While becoming delinquent for 90 days or more on your student loans can negatively impact your credit report and lower your score, the more severe consequences of federal collection activity usually occur after 270 days late and eventually falling into default. For those struggling, try finding a repayment plan with monthly bills at Studentaid.gov. The Income-Based Repayment plan may be one of the dwindling number of manageable repayment options left to borrowers following court actions and the passage of President Donald Trump's tax and spending bill. The Department of Education has paused its plan to garnish defaulted Social Security benefits, but there is a expectation that it will resume these garnishments. Older borrowers who are still working may also face wage garnishment.",
  "shortSummary": "Older borrowers face high delinquency rates and potential debt increases due to increased collection activity, urging instead for affordable repayment options.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "f0b2d57e69f54711a384315cd22e4d68",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.cnbc.com/2025/08/07/nvidia-gets-price-target-hike-from-goldman-sachs-ahead-of-earnings.html",
      "text": "Goldman Sachs is getting more bullish on Nvidia ahead of the company's quarterly results. The firm increased its price target on Nvidia to $200 per share from $185 in a Thursday note and reiterated its buy rating. Goldman's new forecast implies more than 11% upside from Wednesday's close. Analyst James Schneider said that even though investor expectations are high heading into fiscal second-quarter results at the end of August, the chipmaker should have no trouble rising to the occasion. NVDA YTD mountain Nvidia stock in 2025. \"We expect Nvidia to deliver a clean beat-and-raise quarter, with the stock reaction likely hinging on the level of upside to guidance and impact from China (if any) - and we increase our estimates,\" the analyst said. \"We expect three focal points on the call: (1) the shape of the Blackwell ramp in 2H and timing of Rubin introduction in 2026; (2) the timing of China's H20 ramp and go-forward contribution; (3) any gross margins benefits from previously reserved H20 inventory,\" he added. Schneider said any potential upside that could drive the stock could be a company update on revenue in China as well as its gross margin outlook. Shares have advanced nearly 34% in 2025. Nvidia will report results on Aug. 27 after the closing bell. Analysts polled by FactSet forecast earnings per share of $1 on revenue of $45.7 billion."
    },
    {
      "url": "https://www.cnbc.com/2025/08/04/a-bearish-double-top-pattern-just-formed-in-the-dow-what-that-means.html",
      "text": "A \"double top\" pattern formed in the Dow Jones Industrial Average last week, an indicator of tough times ahead as signs of fatigue surface in the overall market. A double top occurs when an asset reaches a high price twice and fails to break through it, often a bearish indicator suggesting buyer exhaustion and a loss of momentum. Last week, the 30-stock index formed the pattern when it failed to punch past resistance around the 45,000 level. That failure could mean further downside for the Dow, starting with support at 42,500, which is just below the 200-day simple moving average, and a roughly 2.5% drop from Friday's close, according to a Sunday note from Bank of America Securities. More Fibonacci retracement levels, which chart out potential support thresholds, are also at 41,800 and 40,800. \"The Dow failed to breakout about 45,073.63 to show signs of breadth and rotation. Instead, it formed a double top pattern with shorter-term downside target of about 42,500 or just below the 200d SMA,\" Paul Ciana, technical strategist at Bank of America Securities, wrote Sunday. \"Burden on bulls to show signs of support.\" .DJI YTD mountain Dow Jones Industrial Average, year to date The double top in the Dow is not the only sign of weakening market internals, with many chart analysts over the weekend flagging other potential warning signs for the near-term outlook. JC O'Hara, chief market technician at Roth, pointed out that \"plenty of equity indices have run straight into chart resistance,\" with the average stock last week unable to create new highs. BTIG's Jonathan Krinsky noted that the S & P 500 's streak of closes above its 20-day moving average ended Friday. He said he expects there's further downside risk for the broad market index, with support at 6,100, which is roughly 2.2% below Friday's close. \"The Bears started to awaken from their summer slumber,\" Roth's O'Hara wrote Sunday, adding, \"The market is priced to perfection and now prone to near-term downside risk.\" A weakening macroeconomic outlook also adds to the market's woes. Stocks sold off Friday, after the latest jobs data revealed severe cracks in the labor market that raised fears the U.S. is headed for a recession. On Monday, however, stocks recouped some of their losses from Friday's sell-off. The Dow was last higher by more than 500 points, or 1.2%. The S & P 500 and Nasdaq Composite rallied 1.3% and 1.8%, respectively."
    },
    {
      "url": "https://www.cnbc.com/2025/06/02/trump-pauses-social-security-benefit-cuts-over-defaulted-student-loans.html",
      "text": "The U.S. Department of Education is pausing its plan to garnish people's Social Security benefits if they have defaulted on their student loans, a spokesperson for the agency tells CNBC.\n\"The Trump Administration is committed to protecting Social Security recipients who oftentimes rely on a fixed income,\" said Ellen Keast, an Education Department spokesperson.\nThe development is an abrupt change in policy by the administration.\nThe Trump administration announced on April 21 that it would resume collection activity on the country's $1.6 trillion student loan portfolio. For nearly half a decade, the government did not go after those who'd fallen behind as part of Covid-era policies.\nMore from Personal Finance:\nWhat the House GOP budget bill means for your money\n'Maycember' is over — here's how to recover financially\nCourt order challenges Trump's plan to move student loans to SBA\nThe federal government has extraordinary collection powers on its student loans and it can seize borrowers' tax refunds, paychecks and Social Security retirement and disability benefits. Social Security recipients can see their checks reduced by up to 15% to pay back their defaulted student loan.\nMore than 450,000 federal student loan borrowers age 62 and older are in default on their federal student loans and likely to be receiving Social Security benefits, according to the Consumer Financial Protection Bureau.\nThe administration's reprieve gives older student borrowers who've defaulted on their debt more time to try to get current, and to avoid a reduced benefit check down the line.\nCarolina Rodriguez, director of the Education Debt Consumer Assistance Program in New York, recently told CNBC that she was especially concerned about the consequences of resumed collections on retirees.\n\"Losing a portion of their Social Security benefits to repay student loans could mean not having enough for food, transportation to medical appointments or other basic necessities,\" Rodriguez said in an April interview."
    },
    {
      "url": "https://www.cnbc.com/2025/07/25/trump-stimulus-check-tariff-rebate.html",
      "text": "President Donald Trump said the administration is considering a rebate for some consumers from revenue raised by higher tariffs on U.S. trade partners.\nWhen asked by a reporter on Friday at the White House about a possible rebate for Americans from tariff revenue, Trump said: \"We're thinking about that. We have so much money coming in, we're thinking about a little rebate.\"\n\"The big thing we want to do is pay down debt,\" Trump said. \"But we're thinking about a rebate.\"\n\"A little rebate for people of a certain income level might be very nice,\" he said.\nIt's unclear whether a rebate could happen without Congressional approval. If enacted, it's unknown whether the rebate would come via stimulus checks or another form of tax relief, experts say.\nMore from Personal Finance:\nStudent loan forgiveness may soon be taxed again\nWhat the Fed's interest-rate decision could mean for your money\nHow to lower capital gains on your home sale as Trump eyes ending the tax\n\"It's kind of unlikely that they would go ahead and do that,\" said Tax Foundation senior economist Alex Durante. \"But I wouldn't put anything past this administration.\"\nThe Treasury Department reported an unexpected surplus for June, with a boost from tariff revenue. Customs duties totaled roughly $27 billion for the month, compared to $23 billion in May. The duties reflect a 301% gain from June 2024.\nI would prefer that the revenue was used for deficit reduction rather than just cutting checks to people.Alex DuranteTax Foundation senior economist\nTrump's rebate idea comes as a chorus of lawmakers and policy experts voice concerns about the federal budget deficit.\n\"I don't think [a rebate] would be particularly good policy,\" Durante said. \"I would prefer that the revenue was used for deficit reduction rather than just cutting checks to people.\"\nEnacted in early July, Trump's \"one big beautiful\" tax-and-spending package could add an estimated $3.4 trillion to the deficit through 2034, according to a conventional score released by the Congressional Budget Office this week.\nRebates could 'put upward pressure on prices'\nThe motivation for sending the direct payments would be different than they were during the Covid pandemic, when many households were losing income or unable to work, said Joseph Rosenberg, senior fellow at the Urban-Brookings Tax Policy Center's tax and income supports division.\nNow, the federal government is imposing tariffs that will cost U.S. households, and this would be a way of helping those individuals and families, Rosenberg said.\nBecause Congress just passed the very expensive \"big beautiful\" budget and tax legislation, rebates to individuals could exacerbate the effects on the federal budget deficit, he said.\nThe rebates would reinforce the inflationary effects of the tariffs that already exist, Rosenberg said.\n\"People will go out and spend some of that money, and that would further put upward pressure on prices and probably magnify inflationary effects,\" Rosenberg said.\nPandemic-era fiscal stimulus contributed to an increase in inflation of about 2.6 percentage points in the U.S., according to 2023 research from the Federal Reserve Bank of St. Louis."
    },
    {
      "url": "https://www.cnbc.com/2025/05/12/defaulted-student-loan-borrowers-and-wage-garnishment-what-to-know.html",
      "text": "Shortly after the Trump administration resumed collection efforts on defaulted federal student loans, the Education Department offered more detail to borrowers about the timeline for garnishments and other involuntary collections.\nDozens of borrowers reached out to CNBC with questions and concerns about the change in policy.\nWe spoke with experts to get answers. Here's what we know so far.\nWhy are borrowers now at risk of wage garnishment?\nSince the Covid pandemic began in March 2020, collection activity on federal student loans had mostly been paused. The Biden administration focused on extending relief measures to struggling borrowers in the wake of the public health crisis and helping them to get current.\nThe Trump administration's move to resume collection efforts and garnish wages of those behind on their student loans is a sharp turn away from that strategy. Officials have said that taxpayers shouldn't be on the hook when people don't repay their education debt.\n\"Borrowers should pay back the debts they take on,\" said U.S. Secretary of Education Linda McMahon in a video posted on X on April 22.\nMore from Personal Finance:\nHow many consumers are preparing for an economic hit\nWhy Americans think real estate, gold are the best long-term investments\nTrump tariffs sparked 'uptick' in I bond interest, advisor says. What to know\nConsumer advocates argue that federal student loan borrowers have faced a chaotic lending system, with constantly changing rules, unfair costs and bad information.\n\"People who default on loans typically truly cannot afford to pay them,\" said James Kvaal, who served as U.S. undersecretary of education for former President Joe Biden, in a previous interview with CNBC.\nHow much of my wages can the government take?\nThe U.S. Department of Education can garnish up to 15% of your disposable, or after-tax, pay, said higher education expert Mark Kantrowitz.\nBy law, you must be left with at least 30 times the federal minimum hourly wage ($7.25) a week, which is $217.50, Kantrowitz said.\nWhen could the wage garnishments start?\nThe Treasury Department will send notices to 5.3 million defaulted borrowers about the collection activity of their wages \"later this summer,\" the Education Department wrote in a recent press release.\nAs soon as June, the Trump administration says it will begin seizing portions of defaulted student loan borrowers' federal benefits when applicable, including their Social Security retirement checks. (Social Security recipients can typically see up to 15% of their monthly benefit reduced to pay back their defaulted student debt, but beneficiaries need to be left with at least $750 a month.)\nWhat if I'm self-employed, or a gig worker?\nIt is more difficult for the federal government to garnish the wages of someone who receives 1099 income, Kantrowitz said.\n\"If there is no employer, wage garnishment can't happen,\" he said.\nCan I challenge the wage garnishment?\nYes.\nBorrowers in default will receive a 30-day notice before their wages are garnished, a spokesperson for the Education Department told CNBC.\nDuring that period, you should have the option to have a hearing before an administrative law judge, Kantrowitz said. The Education Department notice is supposed to include information on how you request that, he said.\nYour wages may be protected if you've recently been unemployed, or if you've recently filed for bankruptcy, Kantrowitz said.\nBorrowers can also challenge the wage garnishment if it will result in financial hardship, he added.\nWhat should I tell my employer?\nMost employers will already be familiar with the wage garnishment process, Kantrowitz said, \"since this occurs for a variety of reasons, such as child support, alimony and unpaid taxes — not just student loans.\"\nYour boss is not allowed to terminate you because of the wage garnishment, Kantrowitz said.\nHow do I get out of default?\nYou can contact the government's Default Resolution Group and pursue a number of different avenues to get current on your loans, including enrolling in an income-driven repayment plan or signing up for loan rehabilitation.\nSome borrowers may also be eligible for deferments or a forbearance, which are different ways to pause your payments, said Carolina Rodriguez, director of the Education Debt Consumer Assistance Program in New York, in an earlier interview with CNBC.\n\"We're advising clients to request a retroactive forbearance to cover missed payments, and a temporary forbearance until they can get enrolled in an income-driven repayment plan,\" she said."
    },
    {
      "url": "https://www.cnbc.com/advisor-council/",
      "text": "Advisor Council\nLee Baker, CFP\nLee Baker is a certified financial planner and the founder, owner and president of Claris Financial Advisors in Atlanta.\nLouis Barajas, CFP\nLouis Barajas is a certified financial planner and the CEO of International Private Wealth Advisors in Irvine, California.\nDouglas A. Boneparth, CFP\nDouglas Boneparth is a certified financial planner and the president and founder of Bone Fide Wealth in New York City.\nJude Boudreaux, CFP\nJude Boudreaux is a certified financial planner and a partner and senior financial planner at The Planning Center in New Orleans.\nLazetta Rainey Braxton, CFP\nLazetta Rainey Braxton is a certified financial planner and the founder and managing principal of virtual firm The Real Wealth Coterie.\nMarguerita Cheng, CFP\nMarguerita Cheng is a certified financial planner and the CEO of Blue Ocean Global Wealth in Gaithersburg, Maryland.\nPreston D. Cherry, CFP\nPreston D. Cherry, PhD, is a certified financial planner, founder and president of Concurrent Financial Planning in Green Bay, Wisconsin.\nCathy Curtis, CFP\nCathy Curtis is a certified financial planner and the founder and owner of Curtis Financial Planning in Oakland, California.\nSophia Bera Daigle, CFP\nSophia Bera Daigle is a certified financial planner and the founder of virtual firm Gen Y Planning.\nRianka R. Dorsainvil, CFP\nRianka R. Dorsainvil is a certified financial planner and founder and senior wealth advisor at YGC Wealth.\nBlair duQuesnay, CFA, CFP\nBlair duQuesnay is a chartered financial analyst and certified financial planner, and an investment advisor at Ritholtz Wealth Management.\nKamila Elliott, CFP\nKamila Elliott is a certified financial planner and the co-founder and CEO of Collective Wealth Partners in Atlanta.\nStacy Francis, CFP\nStacy Francis is a certified financial planner and the president and CEO of Francis Financial in New York City.\nBarry Glassman, CFP\nBarry Glassman is a certified financial planner and the founder and president of Glassman Wealth Services in Vienna, Virginia.\nIvory Johnson, CFP\nIvory Johnson is a certified financial planner and the founder of Delancey Wealth Management in Washington, D.C.\nBradley T. Klontz, Psy.D., CFP\nBradley T. Klontz, a psychologist and certified financial planner, is a managing principal of YMW Advisors in Boulder, Colorado.\nTim Maurer, CFP\nTim Maurer is a certified financial planner and the chief advisory officer at SignatureFD, which has offices in Atlanta and Charlotte, North Carolina.\nCarolyn McClanahan, M.D., CFP\nCarolyn McClanahan, a physician and certified financial planner, is the founder of Life Planning Partners in Jacksonville, Florida.\nWinnie Sun\nWinnie Sun is the co-founder and managing director of Sun Group Wealth Partners in Irvine, California."
    },
    {
      "url": "https://www.cnbc.com/2025/08/04/the-charts-show-tesla-shares-could-be-on-the-verge-of-a-big-swing-katie-stockton-says.html",
      "text": "The chart of Tesla Inc. (TSLA) shows uncertainty on the part of investors, with fickle price action keeping the stock tethered to its 200-day moving average (MA). Following April's recovery, the stock entered a consolidation phase characterized by volatile swings within a tightening range. This has resulted in a triangle pattern, with TSLA now approaching the lower boundary of that formation near $295. Weakened short-term momentum has characterized the recent downdraft into this support level, which is bolstered by the daily cloud model (shaded area on the chart). However, short-term oversold conditions may help prevent a breakdown. From a longer-term perspective, TSLA remains below resistance from the weekly cloud model, and the weekly MACD is pinched in a reflection of weakened intermediate-term momentum. A crossover would imply downside follow-through, noting also the weekly stochastics are trending lower with room to oversold levels, supporting a breakdown below triangle support. Currently, the weekly cloud model puts initial resistance near $314, and the triangle's upper boundary is near $330. It would be good to see TSLA reclaim these levels. If a triangle breakdown occurs (below $295), secondary support is approximately $273 based on a Fibonacci retracement level. With applications beyond TSLA, we would note that triangle patterns often precede significant directional moves, and breakouts (either up or down) tend to result in immediate follow-through. With this in mind, we would monitor the pattern's boundaries closely. —Katie Stockton with Will Tamplin Access research from Fairlead Strategies for free here . DISCLOSURES: (None) All opinions expressed by the CNBC Pro contributors are solely their opinions and do not reflect the opinions of CNBC, NBC UNIVERSAL, their parent company or affiliates, and may have been previously disseminated by them on television, radio, internet or another medium. THE ABOVE CONTENT IS SUBJECT TO OUR TERMS AND CONDITIONS AND PRIVACY POLICY . THIS CONTENT IS PROVIDED FOR INFORMATIONAL PURPOSES ONLY AND DOES NOT CONSITUTE FINANCIAL, INVESTMENT, TAX OR LEGAL ADVICE OR A RECOMMENDATION TO BUY ANY SECURITY OR OTHER FINANCIAL ASSET. THE CONTENT IS GENERAL IN NATURE AND DOES NOT REFLECT ANY INDIVIDUAL'S UNIQUE PERSONAL CIRCUMSTANCES. THE ABOVE CONTENT MIGHT NOT BE SUITABLE FOR YOUR PARTICULAR CIRCUMSTANCES. BEFORE MAKING ANY FINANCIAL DECISIONS, YOU SHOULD STRONGLY CONSIDER SEEKING ADVICE FROM YOUR OWN FINANCIAL OR INVESTMENT ADVISOR. Click here for the full disclaimer. Fairlead Strategies Disclaimer: This communication has been prepared by Fairlead Strategies LLC (\"Fairlead Strategies\") for informational purposes only. This material is for illustration and discussion purposes and not intended to be, nor construed as, financial, legal, tax or investment advice. You should consult appropriate advisors concerning such matters. This material presents information through the date indicated, reflecting the author's current expectations, and is subject to revision by the author, though the author is under no obligation to do so. This material may contain commentary on broad-based indices, market conditions, different types of securities, and cryptocurrencies, using the discipline of technical analysis, which evaluates the demand and supply based on market pricing. The views expressed herein are solely those of the author. This material should not be construed as a recommendation, or advice or an offer or solicitation with respect to the purchase or sale of any investment. The information is not intended to provide a basis on which you could make an investment decision on any particular security or its issuer. This document is intended for CNBC Pro subscribers only and is not for distribution to the general public. Certain information has been provided by and/or is based on third party sources and, although such information is believed to be reliable, no representation is made with respect to the accuracy, completeness, or timeliness of such information. This information may be subject to change without notice. Fairlead Strategies undertakes no obligation to maintain or update this material based on subsequent information and events or to provide you with any additional or supplemental information or any update to or correction of the information contained herein. Fairlead Strategies, its officers, employees, affiliates and partners shall not be liable to any person in any way whatsoever for any losses, costs, or claims for your reliance on this material. Nothing herein is, or shall be relied on as, a promise or representation as to future performance. PAST PERFORMANCE IS NOT INDICATIVE OF FUTURE RESULTS. Opinions expressed in this material may differ or be contrary to opinions expressed, or actions taken, by Fairlead Strategies or its affiliates, or their respective officers, directors, or employees. In addition, any opinions and assumptions expressed herein are made as of the date of this communication and are subject to change and/or withdrawal without notice. Fairlead Strategies or its affiliates may have positions in financial instruments mentioned, may have acquired such positions at prices no longer available, and may have interests different from or adverse to your interests or inconsistent with the advice herein. Any investments made are made under the same terms as nonaffiliated investors and do not constitute a controlling interest. No liability is accepted by Fairlead Strategies, its officers, employees, affiliates, or partners for any losses that may arise from any use of the information contained herein. Any financial instruments mentioned herein are speculative in nature and may involve risk to principal and interest. Any prices or levels shown are either historical or purely indicative. This material does not take into account the particular investment objectives or financial circumstances, objectives or needs of any specific investor, and are not intended as recommendations of particular securities, investment products, or other financial products or strategies to particular clients. Securities, investment products, other financial products or strategies discussed herein may not be suitable for all investors. The recipient of this information must make its own independent decisions regarding any securities, investment products or other financial products mentioned herein. The material should not be provided to any person in a jurisdiction where its provision or use would be contrary to local laws, rules, or regulations. This material is not to be reproduced or redistributed absent the written consent of Fairlead Strategies."
    },
    {
      "url": "https://www.cnbc.com/2025/05/17/student-loan-borrowers-how-to-avoid-delinquency-default-garnishment.html",
      "text": "As the Trump administration ramps up its student loan collection efforts, worried borrowers need to ask themselves a key question: Am I delinquent, or in default? The answer determines your best next steps.\n\"We've had a lot of clients contacting us recently who are extremely stressed and, in some cases panicked, about their loan situation,\" said Nancy Nierman, assistant director of the Education Debt Consumer Assistance Program in New York.\nMore from Personal Finance:\nHow many consumers are preparing for an economic hit\nWhy Americans think real estate, gold are the best long-term investments\nTrump tariffs sparked 'uptick' in I bond interest, advisor says. What to know\nHowever, some borrowers wrongly believe they'll be subject to wage garnishments or offsets of their retirement benefits — when in fact they are delinquent but not yet in default, Nierman said.\nIf you're delinquent, there are things you can do to avoid default. And even those who are in default and at risk for collections can take steps to avoid such outcomes.\n\"The federal student loan system does provide several paths for bringing loans out of default,\" she said.\nDelinquent or in default? Here's how to tell\nJust because you're behind on your payments doesn't mean you're in default.\nYour student loan becomes past due, or delinquent, the first day after you miss a payment, according to the U.S. Department of Education.\nNearly 8% of total student debt was reported as 90 days past due in the first quarter of 2025, the New York Fed recently found.\nOnce you are delinquent for 90 days or more, your student loan servicer will report your past due status to the national credit bureaus, which can lead to a drop in your credit score.\nThe Federal Reserve predicted in March that some people with a student loan delinquency could see their scores fall by as much as 171 points. (Credit scores typically range from 300 to 850, with around 670 and higher considered good.)\nLower credit scores can lead to higher borrowing costs on consumer loans such as mortgages, car loans and credit cards.\nBut you're not considered to be in default on your student loans until you haven't made your scheduled payment in at least 270 days, the Education Department says.\nOnly borrowers in default face garnishments\nThe federal government has extraordinary collection powers on its student loans and it can seize borrowers' tax refunds, paychecks and Social Security retirement and disability benefits.\nBut only those who've defaulted on their student loans can face these consequences, experts said.\nHow to get out of student loan delinquency\nDelinquent student loan borrowers should call their student loan servicer right away and request a retroactive forbearance for missed payments and then a temporary forbearance until they enroll in a repayment plan they can afford, according to the experts at the Education Debt Consumer Assistance Program. Some monthly bills under income-driven repayment plans wind up being as low as zero dollars.\nThere are also economic hardship and unemployment deferments available for those who qualify, as well as other ways to keep your loan payments paused while not falling behind.\nHow to get out of student loan default\nMeanwhile, more than 5.3 million student loan borrowers are currently in default, and that total could swell to roughly 10 million borrowers within a few months, the Education Department estimates.\nYou can contact the government's Default Resolution Group and pursue a number of different avenues to get current on your loans, including enrolling in an income-driven repayment plan or signing up for loan rehabilitation.\nYou can get out of default on your student loans through rehabilitating or consolidating your debt, Nierman said.\nRehabilitating involves making \"nine voluntary, reasonable and affordable monthly payments,\" according to the U.S. Department of Education. Those nine payments can be made over \"a period of 10 consecutive months,\" it said.\nConsolidation, meanwhile, may be available to those who \"make three consecutive, voluntary, on-time, full monthly payments.\" At that point, they can essentially repackage their debt into a new loan.\nAfter you've emerged from default, experts also recommend requesting a monthly bill you can afford.\nIf you don't know who your loan servicer is, you can find out at Studentaid.gov.\n\"Explore your options and create a plan for returning your loans back to good standing so you will not be subject to punitive collections activity,\" Nierman said."
    },
    {
      "url": "https://www.cnbc.com/2024/01/11/how-paying-student-debt-could-boost-your-401k-balance.html",
      "text": "Student debt often makes it harder for people to save for retirement. But that may soon change.\nA provision in the Secure 2.0 Act of 2022, which had a delayed effective date of Jan. 1, 2024, allows employers to match workers' student loan payments with contributions to their retirement plans.\n\"Many employees paying off their student loans are having trouble saving for the future,\" said Mary Moreland, executive vice president of human resources at Abbott, a medical device and health-care company whose 401(k) matching program for student borrowers led the way to the new policy. \"Now employers can help.\"\nOutstanding student loan debt in the U.S. exceeds $1.6 trillion, and burdens Americans more than credit card or auto loan debt. The average loan balance at graduation has tripled since the 1990s to $30,000 from $10,000. Additionally, about 7% of student loan borrowers are now more than $100,000 in debt.\nMore from Personal Finance:\nWhy workers' raises are smaller in 2024 — and may not go up from here\nRocky FAFSA rollout leaves millions of students, families frustrated\nTax filing season kicks off Jan. 29. Here's what taxpayers need to know\nNearly half of student loan borrowers said their debt affected how much they were able to salt away in their retirement plans, according to a recent Morning Consult survey of about 500 borrowers between the ages of 18 and 39.\nHere's what borrowers should know about the new benefit.\nIt may take time before your employer offers it\nWhen in 2016 Abbott began to develop its 401(k) match to student loan payments, which it dubbed \"Freedom 2 Save,\" \"there was no other program like it,\" Moreland said. The company requested and received a private ruling from the IRS to allow it to launch the benefit in 2018.\n\"Other companies expressed interest in developing similar programs, but they weren't able to because only Abbott had the private letter ruling,\" she added. \"Secure 2.0 now makes it possible for other employers to implement this type of program with no special dispensation required.\"\nStill, since the broader law just went into effect, it may take some time before the matching program takes off across employers, said higher education expert Mark Kantrowitz.\nWorkers interested in the nascent benefit should ask their company's human resources department about it, he said: \"If several people ask for it, they will start thinking about it.\"\nMoreland recommends employees who hope to see the benefit adopted at their company also share Abbott's \"Freedom 2 Save\" blueprint, available on its website, when they make the case.\n\"In the blueprint you'll find details on how our program works and a guide for how to develop and implement a program of your own,\" Moreland said.\nHow the student debt 401(k) match works\nAt Abbott, eligible employees who put at least 2% of their pay toward their student loan debt will get a 5% company contribution into their 401(k) each year.\nBut companies can decide on their own numbers, Kantrowitz said.\nIn most cases, employers will likely decide whether to match either your student loan payments or your retirement contributions, but not both, Kantrowitz said. If your employer currently has a 401(k) match in effect, it is unlikely to raise that rate, even if it establishes the benefit.\n\"Employees do not actually need to prove that they are making payments on their student loan,\" Kantrowitz added. \"They simply need to sign a document attesting that they are making the payments.\"\nThe law allows employers to match workers' payments on both federal and private loans.\nOne thing to keep in mind is your contributions to your 401(k) are pretax and reduce your taxable income, and so pausing these payments to focus on paying down your debt may leave you with a slightly larger tax obligation.\nDon't miss these stories from CNBC PRO:\n- There's one stock Wall Street loves so much for 2024 that five analysts in one day picked it as their favorite\n- Morgan Stanley names its top stocks for 2024, including this streaming giant\n- Investing tips from Warren Buffett to start the new year on the right foot\n- Goldman sees a 50% gain ahead for this Chinese electric vehicle stock, initiates with buy rating\n- 'Twice as cheap': These stocks' discount to the S&P 500 is double its average, Ritholtz's Brown says"
    },
    {
      "url": "https://www.ed.gov/about/news/press-release/us-department-of-education-begin-federal-student-loan-collections-other-actions-help-borrowers-get-back-repayment",
      "text": "The U.S. Department of Education today announced its Office of Federal Student Aid (FSA) will resume collections of its defaulted federal student loan portfolio on Monday, May 5th. The Department has not collected on defaulted loans since March 2020. Resuming collections protects taxpayers from shouldering the cost of federal student loans that borrowers willingly undertook to finance their postsecondary education. This initiative will be paired with a comprehensive communications and outreach campaign to ensure borrowers understand how to return to repayment or get out of default.\nWhile Congress mandated that student and parent borrowers begin to repay their student loans in October 2023, the Biden-Harris Administration refused to lift the collections pause and kept borrowers in a confusing limbo. The previous Administration failed to process applications for borrowers who applied for income-driven repayment and continued to push misguided “on-ramps” and illegal loan forgiveness schemes to win points with borrowers and mask rising delinquency and default rates.\n“American taxpayers will no longer be forced to serve as collateral for irresponsible student loan policies,” said U.S. Secretary of Education Linda McMahon. “The Biden Administration misled borrowers: the executive branch does not have the constitutional authority to wipe debt away, nor do the loan balances simply disappear. Hundreds of billions have already been transferred to taxpayers. Going forward, the Department of Education, in conjunction with the Department of Treasury, will shepherd the student loan program responsibly and according to the law, which means helping borrowers return to repayment—both for the sake of their own financial health and our nation’s economic outlook.”\nFederal student loans are financed by the American people. Instead of protecting responsible taxpayers, the Biden-Harris Administration put them on the hook for irresponsible lending, pushing the federal student loan portfolio toward a fiscal cliff:\n- Today, 42.7 million borrowers owe more than $1.6 trillion in student debt.\n- More than 5 million borrowers have not made a monthly payment in over 360 days and sit in default—many for more than 7 years—and 4 million borrowers are in late-stage delinquency (91-180 days). As a result, there could be almost 10 million borrowers in default in a few months. When this happens, almost 25 percent of the federal student loan portfolio will be in default.\n- Only 38 percent of borrowers are in repayment and current on their student loans. Most of the remaining borrowers are either delinquent on their payments, in an interest-free forbearance, or in an interest-free deferment. A small percentage of borrowers are in a 6-month grace period or in-school.\n- Currently, almost 1.9 million borrowers have been unable to even begin repayment because of a processing pause put in place by the previous administration. Since August 2024, the Department has not processed applications for enrollment in any repayment plan such as Income-Based Repayment, Income-Contingent Repayment, or PAYE. The Department is currently working with its federal student loan servicers and anticipates processing to begin next month.\nInvoluntary Collections for Defaulted Borrowers\nFSA will restart the Treasury Offset Program, administered by the U.S. Department of Treasury, on Monday, May 5, 2025. All borrowers in default will receive email communications from FSA over the next 2 weeks making them aware of these developments and urging them to contact the Default Resolution Group to make a monthly payment, enroll in an income-driven repayment plan, or sign up for loan rehabilitation. Later this summer, FSA will send required notices beginning administrative wage garnishment.\nThe Department will also authorize guaranty agencies that they may begin involuntary collections activities on loans under the Federal Family Education Loan Program. All FSA collection activities are required under the Higher Education Act and conducted only after student and parent borrowers have been provided sufficient notice and opportunity to repay their loans under the law.\nSupport for Current and Struggling Borrowers\nFSA is committed to keeping borrowers updated with clear information about their payment options to put them on a productive path toward repaying their federal student loans. Over the next two months, FSA will conduct a robust communications campaign to engage all borrowers on the importance of repayment. FSA will conduct outreach to borrowers through emails and social media reminding them of their obligations and providing resources and support to assist them in selecting the best repayment plan, like the new Loan Simulator, AI Assistant (Aiden), and extended servicers call times. FSA will also launch an enhanced Income-Driven Repayment (IDR) process, simplifying the time that it will take borrowers to enroll in IDR plans and eliminating the need for borrowers to recertify their income every year. More information will be posted on StudentAid.gov next week.\nFSA intends to enlist its partners – states, institutions of higher education, financial aid administrators, college access and success organizations, third-party servicers, and other stakeholders – to assist in this campaign to restore commonsense and fairness with the message: student and parent borrowers – not taxpayers – must repay their student loans. There will not be any mass loan forgiveness. Together, these actions will move the federal student loan portfolio back into repayment, which benefits borrowers and taxpayers alike.\nDetailed information to help borrowers get out of default is also available at StudentAid.gov/end-default."
    },
    {
      "url": "https://www.cnbc.com/2025/07/25/student-loan-forgiveness-tax-trump-big-beautiful-bill.html",
      "text": "President Donald Trump's \"big beautiful bill,\" which Congress passed earlier this month, has tax implications for people who receive student loan forgiveness.\nHere's what borrowers expecting the loan relief should know.\nStudent loan forgiveness may be taxable again\nThe American Rescue Plan Act of 2021 made student loan forgiveness tax-free at the federal level through the end of 2025. Trump's \"big beautiful bill,\" while making other specific kinds of student loan relief tax-free, did not extend or make permanent that broader provision.\nIn theory, lawmakers could move to protect the relief from taxes before the end of the year, but borrowers shouldn't count on it, experts say.\n\"Republicans do not like [student loan] forgiveness, and are unlikely to make it tax-free,\" said higher education expert Mark Kantrowitz.\nWithout action from Congress, student loan borrowers who get their debt forgiven under the U.S. Department of Education's income-driven repayment plans, or IDRs, would face a federal tax bill again starting in 2026. (IDR plans cap people's monthly payments at a share of their discretionary income and cancel any remaining debt after a certain period, typically 20 years or 25 years.)\nThat tax bill at the end of repayment could be significant — the IRS typically counts forgiven debt as income, Kantrowitz said.\nMore from Personal Finance:\nTrump's 'big beautiful bill' slashes CFPB funding\n78% say Trump's tariffs will make it harder to deal with debt\nTax changes under Trump's 'big beautiful bill' — in one chart\nThe average loan balance for borrowers enrolled in an IDR plan is around $57,000, Kantrowitz said. For those in the 22% tax bracket, having that amount wiped out would trigger a tax burden of over $12,000, Kantrowitz estimates. Lower earners, or those in the 12% tax bracket, would still owe around $7,000.\nBorrowers could also be on the hook for state taxes following their student loan forgiveness. (Many states mirror the federal government's tax policy on student loans, meaning more states may start to levy the aid next year as well, experts say.)\nConsumer advocates have long criticized the practice of taxing borrowers on their student loan forgiveness. They say that borrowers who enroll in IDR plans tend to struggle to keep up with their bills, and that the government's policy often wipes away one's student debt just to saddle them with a tax debt.\n\"Forcing borrowers to remain drowning in debt is cruel,\" said Persis Yu, deputy executive director and managing counsel at the Student Borrower Protection Center.\n'Big beautiful bill' makes other student relief tax-free\nThe \"big beautiful bill\" did permanently make it so that student loan forgiveness in cases of death or disability are tax-free, Kantrowitz said.\nEmployees who receive help from their company paying down their debt also won't owe any taxes in the future on that relief, due to the legislation, he added. The current allowable annual tax-free contribution from firms is $5,250, but that amount will increase with inflation.\nPublic Service Loan Forgiveness has always been, and will continue to be, tax-free on the federal level, under its terms. (It's possible your state will tax you on the aid). That program allows government and certain non-profit workers to get their debt excused after a decade of payments."
    }
  ],
  "argos_summary": "The article discusses the differences between student loan delinquency and default, emphasizing that borrowers have options to avoid default, such as exploring federal repayment plans and forbearance. The U.S. Department of Education has paused plans to garnish Social Security benefits for defaulted borrowers, providing them with more time to address their debts. Additionally, the Secure 2.0 Act allows employers to match student loan payments with retirement contributions, potentially easing the financial burden on borrowers. However, there are concerns about the tax implications of student loan forgiveness under recent legislation.",
  "argos_id": "ZZZGZAGGF"
}