{
  "url": "https://nypost.com/2025/08/31/us-news/three-victims-of-florida-18-wheeler-u-turn-crash-idd-as-haitian-immigrants-report/",
  "authorsByline": "Shane Galvin",
  "articleId": "fb0be61ad9eb47e595237893f25c0e8a",
  "source": {
    "domain": "nypost.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://nypost.com/wp-content/uploads/sites/2/2025/08/newspress-collage-5w9u4z3qw-1756617893282.jpg?quality=75&strip=all&1756603558&w=1024",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-31T05:33:48+00:00",
  "addDate": "2025-08-31T05:35:49.452590+00:00",
  "refreshDate": "2025-08-31T05:35:49.452595+00:00",
  "score": 1.0,
  "title": "Three victims of Florida 18-wheeler U-turn crash ID’d as Haitian immigrants: report",
  "description": "The crash happened on a Florida highway on Aug. 12.",
  "content": "The three victims of the Indian immigrant truck driver who made an illegal U-turn across a Florida highway earlier this month have been identified as Haitian immigrants, according to officials.\n\nThe driver Herby Dufresne, 30, and passengers Faniola Joseph, 27, and Rodrigue Dor, 53, all Haitian immigrants, were in their minivan when it plowed into the side of an 18-wheeler driven by Harjinder Singh, an immigrant from India, on Aug. 12, the Miami Herald reported.\n\nDufresne arrived in Miami in December 2023 from Port-au-Prince and was given a two-year permit to live and work in the US after obtaining a financial sponsor under a Biden-era program, the outlet reported, citing a friend of the victim.\n\nNo information was provided on Joseph and Dor’s arrival or immigration status other than that they previously lived in Florida, the Miami Herald reported.\n\nThe Department of Homeland Security did not respond to a request for comment.\n\nAt the time of the fatal accident, all three men were on the way to Indiana, where Dor relocated after failing to secure work in Miami, a friend told the outlet.\n\nFootage from the driver’s side of Singh’s truck showed him making a wide U-turn on the Florida Turnpike — with the minivan plowing into its side and wedging itself partially underneath the tow bed. The 28-year-old barely reacts to the visibly devastating crash, video showed.\n\nSingh, an illegal migrant from India, came to the United States in 2018, failed English proficiency exams administered by the Federal Motor Carrier Safety Administration after the April 12 crash.\n\nHe was able to accurately read only one of four signs he was presented during that test, Department of Transportation officials said.\n\nAfter being nearly deported in 2018, Singh was granted a work permit under the Biden administration in 2021.\n\nThe now-Florida inmate received his commercial driver’s license in California in 2024 and received one in Washington in 2023, according to the DOT.\n\nCDL tests are only administered in English in California, while in Washington, they can be taken in English, Spanish, Russian, or Serbian-Croatian.",
  "medium": "Article",
  "links": [
    "https://nypost.com/2025/08/30/us-news/us-open-hat-snatcher-identified-as-polish-ceo-as-tennis-star-kamil-majchrzak-meets-with-boy/",
    "https://www.miamiherald.com/news/nation-world/world/americas/haiti/article311906580.html",
    "https://nypost.com/2025/08/30/us-news/powerball-winning-numbers-drawn-for-1-billion-jackpot-results-for-aug-30/",
    "https://nypost.com/2025/08/28/us-news/judge-awards-family-nearly-1b-for-botched-delivery-of-baby-at-utah-hospital/",
    "https://nypost.com/2025/08/18/us-news/illegal-migrant-suspect-in-deadly-florida-crash-was-nearly-deported-then-allowed-to-stay-after-claiming-he-was-afraid-to-return-to-india/",
    "https://nypost.com/2025/08/19/us-news/illegal-migrant-truck-driver-in-deadly-florida-crash-failed-english-road-sign-tests-despite-getting-licenses-from-2-sanctuary-states/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Haitian immigrants",
      "weight": 0.08907282
    },
    {
      "name": "Rodrigue Dor",
      "weight": 0.071750335
    },
    {
      "name": "English proficiency exams",
      "weight": 0.07142721
    },
    {
      "name": "Harjinder Singh",
      "weight": 0.069410615
    },
    {
      "name": "Florida",
      "weight": 0.067714155
    },
    {
      "name": "passengers Faniola Joseph",
      "weight": 0.06610013
    },
    {
      "name": "Miami",
      "weight": 0.0660849
    },
    {
      "name": "Dor",
      "weight": 0.065535404
    },
    {
      "name": "CDL tests",
      "weight": 0.06529156
    },
    {
      "name": "Singh",
      "weight": 0.063563116
    }
  ],
  "topics": [
    {
      "name": "Traffic"
    }
  ],
  "categories": [],
  "taxonomies": [
    {
      "name": "/News/Other",
      "score": 0.9697265625
    },
    {
      "name": "/Sensitive Subjects/Accidents & Disasters",
      "score": 0.95068359375
    },
    {
      "name": "/News/Local News",
      "score": 0.92431640625
    },
    {
      "name": "/Sensitive Subjects/Death & Tragedy",
      "score": 0.91650390625
    },
    {
      "name": "/Sensitive Subjects/Other",
      "score": 0.5927734375
    },
    {
      "name": "/Law & Government/Government/Visa & Immigration",
      "score": 0.494140625
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Other",
      "score": 0.36572265625
    },
    {
      "name": "/Sensitive Subjects/Violence & Abuse",
      "score": 0.321044921875
    }
  ],
  "sentiment": {
    "positive": 0.09754677,
    "negative": 0.47478002,
    "neutral": 0.4276732
  },
  "summary": "The three victims of the Florida 18-wheeler U-turn crash identified as Haitian immigrants. The driver, Herby Dufresne, and passengers Faniola Joseph, 27, and 53, were Haitian immigrants and were on their way to Indiana when their minivan plowed into the side of an 18-wheer driven by Harjinder Singh, an immigrant from India. No information was provided on Joseph's arrival or immigration status. Singh, who came to the US in 2018, failed English proficiency exams administered by the Federal Motor Carrier Safety Administration after the crash and was granted a work permit under the Biden administration in 2021.",
  "shortSummary": "Three Haitian immigrants killed in a Florida 18-wheeler U-turn were killed by Harjinder Singh, who failed English proficiency tests, officials confirmed.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "3310b6b1ed8e4cb3a739f089e3c7b145",
  "places": [
    {
      "osmId": "10590182661",
      "road": "Homestead Extension of Florida's Turnpike",
      "city": "Kendall",
      "county": "Miami-Dade County",
      "state": "Florida",
      "postcode": "33283",
      "country": "United States",
      "countryCode": "us",
      "coordinates": {
        "lat": 25.6906205,
        "lon": -80.387998
      }
    }
  ],
  "scraped_sources": [
    {
      "url": "https://nypost.com/2025/08/28/us-news/judge-awards-family-nearly-1b-for-botched-delivery-of-baby-at-utah-hospital/",
      "text": "Judge awards family nearly $1B for botched delivery of baby at Utah hospital he blasted as ‘most dangerous place on the planet’\nA Utah judge awarded a family nearly $1 billion dollars — the largest in the state’s history — after a hospital was so negligent in handling a baby girl’s delivery that she will likely suffer a lifetime of disabilities, according to a report.\nAnyssa Zancanella, Danniel McMicheal, and their 5-year-old daughter Azaylee were awarded $951 million by Judge Patrick Corum earlier this month after he found Steward Health Care liable for the botched delivery of the newborn in West Valley City, Utah, on Oct. 14, 2019.\nThe nurses assigned to Zancanella at Jordan Valley Medical Center — then owned by Steward — were so green they’d barely finished their training, and they gave the mom dangerous doses of a labor-inducing drug while the on-call doctor slept in a nearby room, the family’s lawsuit filed in 2021 alleged.\nAzaylee wasn’t delivered until more than a day later — and after a long-overdue C-section, the suit claimed.\nZancanella “would have been better off delivering this baby at the bathroom of a gas station, or in a hut somewhere in Africa, than in this hospital,” Corum said in an early August ruling. “Literally, this was the most dangerous place on the planet for her to have given birth.”\n“The person [Azaylee] was to be, the person she deserved to be, is trapped inside a brain-damaged child,” Corum said. “I cannot think of anything more profound, total or complete than that loss.”\nThe astonishing damages award is the largest in Utah’s history, the Salt Lake Tribune first reported, citing lawyers for the family.\nBut the family must now attempt to collect on their award from the embattled hospital chain, which is currently in bankruptcy as it owes billions to various creditors.\nZancanella’s lawyers hope they will be able to collect at least the punitive damages against Steward — or half of the total award.\nZancanella and McMicheal had been on a short getaway in Salt Lake City away from their Wyoming home when the wife went into labor on Oct. 12, 2019, and was forced to deliver her girl at the local hospital, the suit said.\nBut the nurses, who’d only finished their training the day Zancanella was admitted, pushed “excessive” amounts of the labor-inducing drug Pitocin for hours — despite alarm bells like the baby’s blood pressure rising and the fact that the drug wasn’t working to dilate Zancanella, the suit alleged.\nWhen the nurses finally told the on-call doctor about the baby’s alarming blood pressure and the mom’s fever, the doctor simply went back to sleep in a room mere footsteps from where the labor was underway, the suit claimed.\nWhen Azaylee was delivered via C-section, she had a “misshapen head,” a “swollen” face, and bruising and bulging on the front of her scalp, the suit claimed.\nThe baby had to be airlifted to Primary Children’s Hospital’s intensive care unit in Salt Lake City for a slew of complications, including having been without sufficient oxygen during labor, the suit alleged.\nAzaylee now needs 24/7 care because of regular seizures.\nShe is mostly non-verbal and lacks the cognitive and executive functioning of others her age. Doctors think she’ll never be able to carry out normal activities like driving a car, attending college, or working.\nAzaylee’s seizures are so frequent that the family — including her younger sister — all sleep in a giant bed to be close in case one of the attacks happens while she’s asleep. And they take oxygen with them everywhere they go to help with the seizures.\nThe parents say they plan to get Azaylee a service dog to help with seizure detection.\nThe young girl receives physical and occupational therapy and can only attend kindergarten for a few hours every day.\nAzaylee “had her life stolen. We all did. We had her taken from us,” Zancanella said during a three-day bench trial, according to Corum’s ruling.\n“She is trapped. I know that my daughter is in there, but she can’t come out and I think of that every day.”\nSteward denied the allegations and any liability in May 2024 court papers but later that year its lawyers asked to withdraw from the case on the grounds they were no longer getting paid and were having trouble getting into contact with the company. The judge approved their withdrawal but the company never appointed new lawyers.\nThe hospital was renamed Holy Cross Hospital-West Valley after it was acquired by CommonSpirit Health two years ago.\nSteward, the nurses and the doctors involved didn’t return requests for comment from the Tribune."
    },
    {
      "url": "https://nypost.com/2025/08/19/us-news/illegal-migrant-truck-driver-in-deadly-florida-crash-failed-english-road-sign-tests-despite-getting-licenses-from-2-sanctuary-states/",
      "text": "Illegal migrant truck driver in deadly Florida crash failed English, road sign tests — despite getting licenses from 2 sanctuary states\nThe Indian immigrant truck driver accused of killing three people in a crash when he made an illegal U-turn across a Florida highway badly flunked English fluency and road sign tests following the smash-up, the US Department of Transportation revealed.\nHarjinder Singh answered just two of 12 questions correctly when being tested for English language proficiency by the Federal Motor Carrier Safety Administration after the April 12 crash.\nAnd when asked to read highway signs and their meanings, Singh could only identify one out of four signs shown to him, the US Department of Transportation (DOT) announced Tuesday.\nDespite these failures, Singh – who is believed to have entered the US illegally in 2018 — had been granted commercial driver’s licenses (CDL) in California and Washington state.\n“This crash was a preventable tragedy directly caused by reckless decisions and compounded by despicable failures,” Transportation Secretary Sean Duffy said in a statement.\n“Non-enforcement and radical immigration policies have turned the trucking industry into a lawless frontier, resulting in unqualified foreign drivers improperly acquiring licenses to operate 40-ton vehicles.”\nSingh is accused of sparking the deadly accident after he attempted an illegal U-turn through a highway cut-through marked “Official Use Only,” with his massive tractor trailer blocking the four-lane highway.\nA minivan was left without a chance to brake or turn, and hurtled at full speed into the trailer.\nAll three people in the van were killed, while footage from inside Singh’s cab showed him apparently unmoved by the carnage unfolding outside.\nFederal law has mandated for decades that CDL holders must be able to speak English “sufficiently” enough to converse with the public and read road signs – with Duffy signing an order in May to bolster those laws.\nHere is the latest on the illegal immigrant truck driver who killed three people\n- Shocking footage shows illegal-migrant driver make outrageous rogue U-turn, killing 3\n- Illegal immigrant trucker charged in deadly wreck flown back to Florida after he fled to sanctuary state\n- Illegal migrant truck driver in deadly Fla. crash failed English, road sign tests — despite getting licenses from 2 sanctuary states\n- Illegal migrant truck driver suspect in deadly Florida crash was given work permit under Biden after being denied by Trump: DHS\n- Illegal migrant suspect in deadly Florida crash was nearly deported — but allowed to stay after claiming he was afraid\nAnd in California, CDL tests are administered only in English, while Washington allows tests to be taken in English, Spanish, Russian, or Serbian-Croatian.\nExactly how Singh was able to obtain a license under those parameters remains unclear, but the DOT said it intended to find out.\n“We will use every tool at our disposal to hold these states and bad actors accountable. President Trump and I will restore safety to our roads,” Duffy said.\nSingh was nearly deported in 2018 after he was detained crossing the border, but was released on $5,000 bond in January 2019 telling US Citizenship and Immigration Services that he feared returning to India, police sources previously told The Post.\nHe has been in immigration proceedings ever since.\nUnder the first Trump administration he was denied a work permit, but was granted one in 2021 under the Biden presidency — details which sparked a social media spat between California Gov. Gavin Newom’s office and the Department of Homeland security.\nSingh received his Washington CDL in 2023, and his California license in 2024, the DOT said.\nHe was arrested in California Saturday by US Marshals on three counts of vehicular homicide."
    },
    {
      "url": "https://nypost.com/2025/08/30/us-news/powerball-winning-numbers-drawn-for-1-billion-jackpot-results-for-aug-30/",
      "text": "Powerball winning numbers drawn for $1 billion jackpot\nThere was no winner of the $1 billion Powerball drawing on Saturday — sending the jackpot soaring even higher.\nThe winning numbers were: 3, 18, 22, 27, 33, and Powerball 17.\nThe jackpot now stands at $1.10 billion.\nDespite the big prize going unclaimed, three Match 5 + Power Play ticket holders won $2 million prizes and nine people put $1 million in their pocket, thanks to Match 5.\nThe next Powerball drawing will take place on Monday, which is Labor Day.\nAny jackpot lucky winner could choose to take home a lump sum of over $498.4 million — before taxes — or the full $1.10 billion in annuity payments, which start at over $4.5 million and increase by 5% each year to $18.7 million over the next three decades.\nPowerball is on a near three-month drought, not having been won since a ticket worth $204.5 million was sold in California on May 31."
    },
    {
      "url": "https://nypost.com/2025/08/30/us-news/us-open-hat-snatcher-identified-as-polish-ceo-as-tennis-star-kamil-majchrzak-meets-with-boy/",
      "text": "US Open hat snatcher identified as Polish CEO — as tennis star Kamil Majchrzak meets with boy\nThis rich guy’s got some poor form!\nThe “entitled” jerk who seemingly snatched a hat autographed by tennis star Kamil Majchrzak from a young boy at the US Open has been identified as Polish millionaire Piotr Szczerek.\nMajchrzak, fresh off his victory over ninth seed Karen Khachanov when the incident unfolded Thursday night, confirmed Szczerek’s identity to The Post on Saturday and said he was initially oblivious to the now-viral snafu.\n“Obviously it was some kind of confusion,” the tennis pro said, adding that Szczerek sponsors his tennis federation in Poland.\n“I was pointing, giving the hat, but I had a lot going on after my match, after being super tired and super excited for the win. I just missed it. I had like a dead look if you know what I mean. I’m sure the guy was also acting in the moment of heat, in the moment of emotions.”\nSzczerek, CEO of paving company Drogbruk, was allegedly caught on the live broadcast Thursday night apparently snatching the prized memento from young fan Brock’s hands after Majchrzak, also Polish, appeared to be gifting it to the child while signing autographs courtside.\nThe businessman – who was seen placing the prized hat into his wife’s bag as the devastated young fan protested – has since deactivated his social media accounts after the incident sparked widespread fury, Spanish outlet MARCA reported.\nSzczerek’s countrymen swiftly blasted him on a Polish job search site as a “sack of garbage,” “common thief,” “primitive scammer,” and “shameful jerk.”\n“Only an ordinary idiot and a jerk could snatch a hat from a child’s hands,” wrote one Gowork.pl user. “You can’t buy class,” offered another critic.\n“If the company’s president so unscrupulously stole a child’s hat, if I were a customer, I would no longer use his services” chime in another. “I’d be afraid he’d steal from me too.”\nThe millionaire has since attempted to make amends with the cheated fan and his family, according to Majchrzak.\n“He also wanted to make things right, so I gave him the credentials for Brock’s mom on the same social media I was using to contact her,” Majchrzak said.\n“So, maybe he can make things right himself.”\nSzczerek – an amateur competitive tennis player in Poland — and was introduced to the sport by his racket-swinging wife Anna, according to Polish outlet Tenis Magazyn.\nFollow along for The Post’s live coverage of the 2025 US Open\nAt their tony home in Kalisz, Poland, the Szcereks boast a private tennis court where they once hosted Polish legend Urszula Radwanska.\n“It was the most wonderful gift of my life. Our employees came up with the idea, and my husband helped them implement it,” Anna Szcerek told the outlet, adding it was a her birthday gift.\nThe couple, who have two sons, also play competitive doubles tennis together — but Piotr Szczerek’s prowess has propelled him to the second division of the Kalisz Tennis Association, the outlet reported.\nThe doting pair co-founded Drogbruck in 1999, and was described by the outlet as a leader in the industry.\nIn an interview, he noted that the paving industry was thriving in his country at the time, prompting him and his wife to establish a business in their hometown.\nThe company reportedly sponsors local sports programs and supports Polish tennis players, including Piotr Matuszewski.\nSzczerek could not be reached for comment, and emails sent to his company were not immediately returned.\nBut what began as an ugly incident ended on a brighter note for the slighted boy, when Majchrzak used the “power of the internet” to track him down and gifted him a signed cap, along with other keepsakes.\nA video posted Saturday to Majchrzak’s Instagram stories shows him reuniting with the overjoyed young fan, who he said was named Brock, and his family – showering him with gifts, snapping photos, and warmly chatting with them.\n“Today after warm up I had a nice meeting,” the tennis star wrote with a hands up emoji, followed by, “Do you recognize?” and a hat emoji.\nIn the clip, Brock beamed as he placed the hat on his head, proudly showing it off to what appeared to be his mother.\nMajchrzak then shared a photo of himself with the young boy, who was proudly wearing the prized possession.\n“Hello World, Together with Brock we wish you a great day!”"
    },
    {
      "url": "https://nypost.com/2025/08/18/us-news/illegal-migrant-suspect-in-deadly-florida-crash-was-nearly-deported-then-allowed-to-stay-after-claiming-he-was-afraid-to-return-to-india/",
      "text": "Illegal migrant suspect in deadly Florida crash was nearly deported — but allowed to stay after claiming he was afraid\nAn illegal migrant who allegedly killed three people after making a rogue U-turn on a Florida highway is an Indian national who was previously processed for deportation but was able to stay after claiming he was afraid of being sent back to his home country.\nHarjinder Singh crossed the southern border into California in September 2018 and was processed for fast-track deportation by the first Trump administration, police sources told The Post.\nBut after claiming fear of being sent back to India to US Citizenship and Immigration Services, Singh was released on a $5,000 immigration bond in January 2019 and has remained in immigration proceedings ever since.\nIn June 2021, the Biden administration granted him work papers that had been denied during Trump’s first term, the Department of Homeland Security said Monday.\nHe was then able to secure a Commercial Driver’s License in California, according to DHS.\nSingh was arrested on Saturday by US Marshals in California on a warrant for three counts of vehicular homicide in connection with a deadly crash in Florida at around 3 p.m. last Thursday.\nA tractor-trailer driven by Singh made a hard left turn on the Florida Turnpike near Fort Pierce and attempted to cross the median through an “Official Use Only” pass, authorities said.\nAs it blocked all lanes of oncoming traffic, a minivan then slammed into the trailer at full speed, becoming wedged underneath and killing a 37-year-old Pompano Beach woman, a 30-year-old Florida City man and a 54-year-old Miami man, Treasure Coast Newspapers reported.\nThe two passengers died at the scene, while the driver was rushed to a nearby hospital, where he later died of his injuries.\nHere is the latest on the illegal immigrant truck driver who killed three people\n- Shocking footage shows illegal-migrant driver make outrageous rogue U-turn, killing 3\n- Illegal immigrant trucker charged in deadly wreck flown back to Florida after he fled to sanctuary state\n- Illegal migrant truck driver in deadly Fla. crash failed English, road sign tests — despite getting licenses from 2 sanctuary states\n- Illegal migrant truck driver suspect in deadly Florida crash was given work permit under Biden after being denied by Trump: DHS\n- Illegal migrant suspect in deadly Florida crash was nearly deported — but allowed to stay after claiming he was afraid\nNeither Singh nor a passenger in the semi-truck with him at the time was injured, the Florida Highway Patrol said.\nShocking video from inside the truck cab window shows Singh apparently completely unaffected at the moment of impact, calmly putting his vehicle into park and turning the engine off.\nSingh is being held on an ICE detainer and faces three counts of vehicular homicide.\n“The actions taken by the Defendant while operating a commercial tractor-trailer are both shocking and criminal, FLHSMV Director Dave Kerner said.\n“Three people lost their lives as a result of his recklessness, and countless friends and family members will experience the pain of their loss forever.”"
    }
  ],
  "argos_summary": "An Indian immigrant truck driver, Harjinder Singh, caused a fatal crash in Florida on Aug. 12 after making a rogue U‑turn, killing three Haitian immigrants. Despite failing English proficiency and road‑sign tests, Singh had obtained commercial driver licenses in California and Washington, states that allow non‑English testing. The incident highlights gaps in driver‑licensing enforcement and has prompted federal scrutiny of state licensing practices.",
  "argos_id": "0ME5OMQDM"
}