{
  "url": "https://www.yahoo.com/news/articles/just-couldn-t-stop-crying-140411662.html",
  "authorsByline": "Helena Addison, Yale University",
  "articleId": "d27459d2dfa944d6aa72f2069fd9040f",
  "source": {
    "domain": "yahoo.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://s.yimg.com/ny/api/res/1.2/BkEDI1F0Y7H4KhePM2ZGdA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU7Y2Y9d2VicA--/https://media.zenfs.com/en/the_conversation_us_articles_815/087de1fe24f66b1ba8c138e4bdf76584",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-31T14:04:11+00:00",
  "addDate": "2025-08-31T14:29:01.888094+00:00",
  "refreshDate": "2025-08-31T14:29:01.888096+00:00",
  "score": 1.0,
  "title": "‘I just couldn’t stop crying’: How prison affects Black men’s mental health long after they’ve been released",
  "description": "Over 2 dozen Philadelphia men shared their experiences with trauma and psychological distress as they worked to rebuild their lives after release.",
  "content": "Mike returned home to Philadelphia after a 15-year prison sentence and suffered an emotional breakdown.\n\n“I just couldn’t stop crying … I don’t know. It was the anxiety. It was just a lot,” he said. “I was under a lot of pressure and it just came crashing down.”\n\nMike, who was in his late 40s when we spoke, told me about his childhood filled with abuse, his first arrest at age 14, and the over 20 years of his life that he spent behind bars.\n\nAs a registered nurse and nurse scientist who studies how incarceration affects mental health, I know Mike’s experience after release from prison is not uncommon. Studies show that Black men who have experienced incarceration have higher rates of PTSD, depression and psychological distress compared with Black men who have never been incarcerated.\n\nWorking in psychiatric hospitals in Philadelphia, I met many patients in crisis who had been incarcerated at some point in their lives. As a part of my doctoral research, funded by the National Institute of Nursing Research, I interviewed 29 formerly incarcerated Black men to understand how incarceration has affected their mental health.\n\nMy peer-reviewed findings were published in the journal Social Science & Medicine. All quotes shared here use pseudonyms to protect the men’s privacy.\n\nMass incarceration in the U.S. has serious health consequences for individuals, families and communities. In Philadelphia alone, over 20,000 people return home from incarceration each year.\n\nWhile incarceration rates are declining in Philadelphia, the needs of those coming home remain significant.\n\nMany formerly incarcerated men described experiencing or witnessing violence, including being beaten by correctional officers and witnessing close friends get assaulted or killed.\n\n“You know you are not regular because you come from a traumatic situation, right?” said Thomas, 44, who spent 18 years incarcerated.\n\nThe participants expressed that racism was common, especially while incarcerated in facilities located in the rural central and northern regions of Pennsylvania.\n\n“I ain’t gonna sugar coat it – Black people going up into them white people mountains, they call you [n-word] all day long and you basically there to accept it,” Antonio told me.\n\nIncarceration was especially difficult for those who were held for months pretrial without ever being convicted and those incarcerated during COVID restrictions who spent more than 23 hours a day in their cells.\n\nParticipants described life on parole or probation, or in transitional housing, as another form of confinement.\n\nKen, 56, has been out of prison for over a decade but said, “I’m still locked up, even though I’m free, I ain’t free. You just get a whole new set of rules and regulations.”\n\nMen described significant anxiety related to community supervision requirements, including difficulty sleeping the night before a probation appointment.\n\nParticipants also described distress caused by “no association” restrictions. These are common parole and probation requirements that prohibit people under supervision from interacting with others who have criminal records, are also under supervision or are currently incarcerated. Violating this requirement can lead to a technical violation and reincarceration.\n\nWhile these requirements are meant to reduce the risk of reoffending, they often isolate people from supportive relationships and resources, including housing and employment.\n\n“[There are] a lot of smart brothers in there. And it hurts my heart. And that’s where the depression coming in too,” said Reese, who spent six years incarcerated. “I can’t contact them in jail. … That’s just how it is in the system.”\n\nPhiladelphia has the highest rate of community supervision – including probation and parole – among the largest U.S. cities, according to a 2019 analysis by The Philadelphia Inquirer.\n\nAt that time, the Inquirer reports, 1 in 23 adults in Philadelphia were under community supervision – and 1 in 14 Black adults in Philadelphia.\n\nThe men I interviewed said they felt like parts of them never left jail or prison, while others felt that they brought prison or jail home with them.\n\nTyrese, 34, said he stays home as often as he can.\n\n“I’ve been out of the joint for seven years now and feel like I’m still institutionalized, I guess,” he said. “I know people that don’t even come outside,” referring to other formerly incarcerated men.\n\nOthers had dreams that they were back in a cell, or at home still wearing jail clothing. Long after release, many described constant hypervigilance and anxiety.\n\n“I can be walking to the bus station and there be people walking around me, I’m constantly watching them,” said Anthony, who was first incarcerated at age 18 and served 16 years. “I’m watching every movement they’re doing. That’s a habit I had from jail.”\n\nPeople who have been incarcerated often struggle to find employment after release, as many employers are unwilling to hire a person with a criminal record.\n\nThis leaves about 35% of formerly incarcerated Black men unemployed.\n\nAt the time of our interview, Tay, 31, was working part-time in carpentry. “Because I had felonies on my record a lot of places won’t hire me,” he said. “And a couple of places that I was working with, they ended up firing me once they did the background check.”\n\nThese frustrations can easily spill over into family life.\n\nMark, 30, also works part-time and said he found himself frequently becoming agitated and snapping at his kids, other family members and his girlfriend. “I can’t get the job I want or the job that I need to do what I need to do for my family and I’ll be frustrated,” he shared.\n\nParticipants struggled with having to depend on others for basic needs upon release. Kenny, who is now self-employed as a caterer, recalled his experience a few years earlier. “I was crying. I was a grown man, almost 40 years old, and my mother had to buy me underwear, socks,” he said.\n\nDespite their many hardships, some of the men spoke with joy about reconnecting with their children.\n\n“I think the most positive thing that happened since I’ve been out of prison is I got custody of my sons,” said Ken, a father of two. “Them kids saved me.”\n\nLike many of the other participants with children, however, he was frustrated about being unable to provide for them and worried about repeating harmful cycles.\n\n“You want to do good, but it makes you think bad stuff when you don’t have the right resources,” he continued. “You don’t want [your kids] to do the same things you did.”\n\nOthers struggled to bond with their children after years of separation.\n\nJohn, 29, explained, “The bonding is kind of awkward, because you wasn’t there, especially during the pandemic when there was no visits allowed.”\n\nMost people released from incarceration return to neighborhoods with high rates of poverty, violence and other disadvantages.\n\nShawn, who lives in pubic housing, showed me abandoned buildings and boarded storefronts in his neighborhood and described how the environment made rebuilding his life harder.\n\nFor many participants, returning to divested communities brought stress. They experienced frequent exposure to substance use, violence and negative police encounters, and they had limited access to basic resources and job opportunities needed to support recovery and stability.\n\n“This is my real life. It’s not fake. It’s not no, ‘Well, why did he go back and do this or that?’” he said. “I live in an underserved, impoverished, danger zone – period.”\n\nThe experiences these men shared with me demonstrate how traumatic incarceration is, even many years after release.\n\nSupporting the mental health of formerly incarcerated Black men requires trauma-informed services, such as culturally responsive counseling, peer support and care that acknowledges the lasting effects of incarceration.\n\nIt also means helping them build or rebuild their financial resources, reconnect with their children and loved ones, and supporting the broader communities they return to through investment in housing, employment and accessible health and social services.\n\nRead more of our stories about Philadelphia.\n\nThis article is republished from The Conversation, a nonprofit, independent news organization bringing you facts and trustworthy analysis to help you make sense of our complex world. It was written by: Helena Addison, Yale University\n• None Philadelphians with mental illness want to work, pray, date and socialize just like everyone else – here’s how creating more inclusive communities is good for public health\n• None ‘It’s a deep emotional ride’ – 12 young people in Philly’s toughest neighborhoods explain how violence disrupts their physical and mental health\n• None Pennsylvania overhauled its sentencing guidelines to be more fair and consistent − but racial disparities may not disappear so soon\n\nHelena Addison received funding from National Institute of Nursing Research of the National Institutes of Health under Award Number F31NR020434, the Substance Abuse and Mental Health Administration and American Nurses Association Minority Fellowship Program, the University of Pennsylvania's Presidential PhD Fellowship, and Jonas Philanthropies to support this study and/or her PhD training. The content is solely the responsibility of the authors and does not necessarily represent the official views of the National Institutes of Health, or any other funding organizations or institutions. The views expressed in written training materials or publications and by speakers and moderators do not necessarily reflect the official policies of the Department and Human Services; nor does mention of trade names, commercial practices, or organizations imply endorsement by the U.S. Government.",
  "medium": "Article",
  "links": [
    "http://theconversation.com/philadelphians-with-mental-illness-want-to-work-pray-date-and-socialize-just-like-everyone-else-heres-how-creating-more-inclusive-communities-is-good-for-public-health-254441?utm_source=Yahoo&utm_medium=related-link&utm_campaign=related-link0&utm_content=article-259975",
    "https://doi.org/10.2105/AJPH.2019.305460",
    "https://theconversation.com/us/philadelphia-pennsylvania-news",
    "http://theconversation.com/pennsylvania-overhauled-its-sentencing-guidelines-to-be-more-fair-and-consistent-but-racial-disparities-may-not-disappear-so-soon-224941?utm_source=Yahoo&utm_medium=related-link&utm_campaign=related-link2&utm_content=article-259975",
    "https://doi.org/10.1016/j.drugalcdep.2018.04.034",
    "https://doi.org/10.1016/j.socscimed.2025.118244",
    "https://www.phila.gov/media/20250616114000/May-2025-Full-Public-Report.pdf",
    "https://www.prisonpolicy.org/reports/outofwork.html",
    "https://doi.org/10.1016/j.healthplace.2018.09.013",
    "https://www.science.org/content/article/trump-budget-proposes-killing-nursing-research-institute",
    "http://theconversation.com/its-a-deep-emotional-ride-12-young-people-in-phillys-toughest-neighborhoods-explain-how-violence-disrupts-their-physical-and-mental-health-222251?utm_source=Yahoo&utm_medium=related-link&utm_campaign=related-link1&utm_content=article-259975",
    "https://doi.org/10.1111/jan.15235",
    "https://www.inquirer.com/news/inq/probation-parole-pennsylvania-philadelphia-criminal-justice-system-20191024.html",
    "https://doi.org/10.17226/25471",
    "https://doi.org/10.1016/S0140-6736(17)30259-3",
    "http://theconversation.com/us?utm_source=Yahoo&utm_medium=related-link&utm_campaign=related-link-0&utm_content=article-259975",
    "https://theconversation.com/institutions/yale-university-1326?utm_source=Yahoo&utm_medium=related-link&utm_campaign=byline-link&utm_content=article-259975",
    "https://theconversation.com/profiles/helena-addison-2421508?utm_source=Yahoo&utm_medium=related-link&utm_campaign=byline-link&utm_content=article-259975",
    "https://www.prisonpolicy.org/blog/2023/11/08/association_restrictions/",
    "https://scholar.google.com/citations?hl=en&user=K3GGjU4AAAAJ",
    "https://www.gettyimages.com/detail/news-photo/rapper-meek-mill-greets-fans-at-a-rally-outside-the-news-photo/978445880"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Black men",
      "weight": 0.06780721
    },
    {
      "name": "Black people",
      "weight": 0.06355637
    },
    {
      "name": "many years",
      "weight": 0.06115218
    },
    {
      "name": "Men",
      "weight": 0.05624215
    },
    {
      "name": "community supervision requirements",
      "weight": 0.05615423
    },
    {
      "name": "incarceration rates",
      "weight": 0.05462537
    },
    {
      "name": "mental health",
      "weight": 0.053169396
    },
    {
      "name": "community supervision",
      "weight": 0.0521991
    },
    {
      "name": "Most people",
      "weight": 0.051139634
    },
    {
      "name": "many participants",
      "weight": 0.050866924
    }
  ],
  "topics": [
    {
      "name": "Social Issues"
    },
    {
      "name": "African American"
    }
  ],
  "categories": [
    {
      "name": "Health"
    }
  ],
  "taxonomies": [
    {
      "name": "/People & Society/Other",
      "score": 0.59619140625
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Other",
      "score": 0.50390625
    },
    {
      "name": "/Sensitive Subjects/Violence & Abuse",
      "score": 0.471435546875
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Discrimination & Identity Relations",
      "score": 0.459228515625
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.43994140625
    },
    {
      "name": "/Sensitive Subjects/Other",
      "score": 0.37890625
    },
    {
      "name": "/Health/Mental Health/Other",
      "score": 0.374755859375
    },
    {
      "name": "/People & Society/Social Sciences/Psychology",
      "score": 0.3232421875
    }
  ],
  "sentiment": {
    "positive": 0.05260056,
    "negative": 0.7429852,
    "neutral": 0.20441428
  },
  "summary": "A registered nurse and nurse scientist, Mary Kohn, has found that long after release from prison, Black men who have experienced incarceration have higher rates of PTSD, depression, and psychological distress compared to Black men without being incarcerated. Kohn interviewed 29 formerly incarcerated Black men to understand how incarceration has affected their mental health. The findings were published in the journal Social Science & Medicine. The participants described living on parole or probation, or in transitional housing, as another form of confinement. They also experienced significant anxiety related to community supervision requirements, which often isolate individuals from supportive relationships and resources. Kook's research findings were funded by the National Institute of Nursing Research and used pseudonyms to protect the men’s privacy.",
  "shortSummary": "After a 15-year prison term, Black men experience mental health issues like PTSD, depression, and social isolation due to community supervision requirements, despite overall reduction in incarceration rates.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "2d9412d106624438bc35a064bbbc4bf0",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://doi.org/10.17226/25471",
      "text": "The high rate of incarceration in the United States contributes significantly to the nation's health inequities, extending beyond those who are imprisoned to families, communities, and the entire society. Since the 1970s, there has been a seven-fold increase in incarceration. This increase and the effects of the post-incarceration reentry disproportionately affect low-income families and communities of color. It is critical to examine the criminal justice system through a new lens and explore opportunities for meaningful improvements that will promote health equity in the United States.\nThe National Academies convened a workshop on June 6, 2018 to investigate the connection between incarceration and health inequities to better understand the distributive impact of incarceration on low-income families and communities of color. Topics of discussion focused on the experience of incarceration and reentry, mass incarceration as a public health issue, women's health in jails and prisons, the effects of reentry on the individual and the community, and promising practices and models for reentry. The programs and models that are described in this publication are all Philadelphia-based because Philadelphia has one of the highest rates of incarceration of any major American city. This publication summarizes the presentations and discussions of the workshop.\nNational Academies of Sciences, Engineering, and Medicine. 2020. The Effects of Incarceration and Reentry on Community Health and Well-Being: Proceedings of a Workshop. Washington, DC: The National Academies Press. https://doi.org/10.17226/25471.\nThe Chapter Skim search tool presents what we've algorithmically identified as the most significant single chunk of text within every page in the chapter. You may select key terms to highlight them within pages of each chapter.\nThe National Academies Press (NAP) has partnered with Copyright Clearance Center's Marketplace service to offer you a variety of options for reusing NAP content. Through Marketplace, you may request permission to reprint NAP content in another publication, course pack, secure website, or other media. Marketplace allows you to instantly obtain permission, pay related fees, and print a license directly from the NAP website. The complete terms and conditions of your reuse license can be found in the license agreement that will be made available to you during the online order process. To request permission through Marketplace you are required to create an account by filling out a simple online form. The following list describes license reuses offered by the NAP through Marketplace:\nClick here to obtain permission for the above reuses. If you have questions or comments concerning the Marketplace service, please contact:\nMarketplace Support\nInternational +1.978.646.2600\nUS Toll Free +1.855.239.3415\nE-mail: support@copyright.com\nmarketplace.copyright.com\nTo request permission to distribute a PDF, please contact our Customer Service Department at customer_service@nap.edu."
    },
    {
      "url": "https://theconversation.com/profiles/helena-addison-2421508?utm_source=Yahoo&utm_medium=related-link&utm_campaign=byline-link&utm_content=article-259975",
      "text": "Helena Addison PhD, RN is a postdoctoral fellow and VA scholar in the National Clinician Scholars Program at Yale University. She earned her PhD in Nursing Science from the University of Pennsylvania School of Nursing with her dissertation focused on Mental Health and Health-Seeking Behaviors of Formerly Incarcerated Black Men. She also earned her bachelor’s degree in psychology at University of Maryland Baltimore County and her MSN through the Master’s Entry into Nursing Program at Johns Hopkins School of Nursing. Her research interests were, in part, informed by her clinical experiences as a Registered Nurse in inpatient psychiatric hospitals caring for adults with mental illness and substance use disorder who, too often, have a history of incarceration. Her research interests include examining the impact of incarceration, violence, and additional trauma exposures on mental health, as well as the role of nurse-led interventions and multi-sector collaborations in increasing access to mental health care. Her overall career goal is to engage in innovative and interdisciplinary research that informs policies and practices to improve mental health and quality of life for all people."
    },
    {
      "url": "http://theconversation.com/its-a-deep-emotional-ride-12-young-people-in-phillys-toughest-neighborhoods-explain-how-violence-disrupts-their-physical-and-mental-health-222251?utm_source=Yahoo&utm_medium=related-link&utm_campaign=related-link1&utm_content=article-259975",
      "text": "In 2023, 410 people were murdered in Philadelphia – more than a quarter of them under age 25. In addition to the people who died, countless others lost loved ones and people they relied on.\nAs a social scientist who studies different forms of violence and how they affect a person’s health, I know that the violence young people in Philadelphia experience is about more than shootings, homicides and physical injuries. Social science recognizes many different types of violence beyond the physical – for example, poverty, racism and negative interactions with police.\nFurthermore, violence can take a toll on one’s health even if the person is unaware of it. For example, I once interviewed a young man from West Philadelphia and tracked his heart rate. When a shooting occurred outside his living room window, his heart rate spiked suddenly from 51 beats per minute and hit 116. He had heard the gunshot, but it did not upset him. He felt he had been hardened to the violence happening in front of his door, and he was shocked to learn that his body had reacted so strongly.\nTo better understand the relationship between forms of violence and their impacts, I conducted an ethnographic study involving 12 young people ages 16 to 21 who lived in different Philadelphia neighborhoods where violence is prevalent. These included Kensington, the Northeast, Germantown, Cobbs Creek and Belmont. The study lasted from 2016 to 2018 and was recently published in the peer-reviewed Journal of Adolescent Research. The names used in this article are pseudonyms to protect the identities of the young people who contributed to my research.\nI spent a month with each young person. I walked through their neighborhoods with them, interviewed them about their family histories and measured their heart rates as they went about their day. They wore wristband health monitors and carried a separate GPS tracker for four days. At the end of each day, I sat with them and reviewed their heart rate data and where they went.\nI learned that where a young person lives, the societal messages they absorb and the different forms of violence they experience can deeply affect their physical and mental health.\n‘No shade, no trees, no big parks’\nThe young people I worked with understood the lack of investments in their neighborhoods as signals that those in power did not care about them, their families or their communities. They talked about public school closures, the limited access to libraries and lack of trees or green space. Walking with me around her Cobbs Creek neighborhood, Desmond, 21, said, “Who would want to live here? There’s no shade, no trees, no big parks.”\nThey also saw how gentrification – the process of wealthier persons and investments displacing local businesses and residents – was changing their neighborhoods. Kalia, having lived her life in “little Puerto Rico,” as she called her Kensington neighborhood, told me how she felt about wealthier people moving in.\n“Remember how I was saying that we’re loud, and we’re all like close to each other, we all just hang out and stuff? And they’re not like that. They’re quiet, and they have all their money, you know?” she said. “So I feel like they’re not only trying to change the neighborhood, they’re just trying to change the way people live.”\n‘I can’t blame them, though’\nWorking with the five young Black men in the study, I learned how their day-to-day interactions with the police impacted their self-worth. They shared experiences of police slamming them against a wall, knocking food out of their hands, refusing to believe they didn’t have a criminal record or chasing them out of parks.\nIn sharing these interactions, it was clear that several of the young men had internalized false messages from society and culture that Black men commit more crimes and act more aggressively than white people. Kareem, from West Philadelphia, summed up his thoughts on it like this: “If you was a criminal, then they probably treat you in a certain way. But since almost every Black person be getting into almost everything, they think we all criminals. I can’t blame them, though.”\nFuture, from Southwest Philly, had a particularly tense interaction with police and came into an interview feeling, he said, “hyped up.” His heart rate had increased from 60 to 106 beats per minute when approached by the police, and then elevated to 130 BPM within 10 minutes. It remained elevated for 30 minutes.\nWhile walking to our interview, Future told me, he had stopped to spend the last of his cash on a breakfast sandwich and a coffee. Shortly after, a police officer knocked the sandwich out of his hand, pushed him against a wall and handcuffed him. “They thought I had dope, weed and pills on me, and then I’m like, ‘I don’t got nothing,’” he said. They asked him for his ID, to which he countered, “Why you got me in cuffs?” Then they threatened to bring him into the station.\n“Listen, I’m being obedient,” Future told the officers, explaining that he was on probation. After police “threw” him in the back of the car, he said, a neighbor began filming the incident and asked the police what they were doing. Future said the younger cop reached for his gun while his partner “tried to get me to rat on my ‘hood.”\nThe purpose of the police encounter, it seemed, was to gain information about the goings on in the neighborhood. The young men I talked with said they’d often had similar experiences.\n'It’s a deep emotional ride’\nWhether it was through experiencing police brutality, the child welfare system, homelessness or past trauma, each of the young people I worked with grappled with the impacts of interpersonal, structural and symbolic violence in different ways. Sometimes it was apparent in their mental health, manifesting in eating disorders, severe anxiety or bouts of depression.\nConner, a young Black man living in Belmont, experienced severe anxiety that at times kept him from leaving his house. His heart rate would spike on public transit, sometimes reaching 150 BPM, as he worried about neighborhood arguments spilling over onto the bus. He would go to the gym late at night to avoid fights, and he talked about the friends he had lost to gun violence. On how he felt about these losses, he said, “It’s a deep emotional ride, but I mean, the majority of us, people of color, we’re used to things like that happening.”\nFor others, their physical health suffered as well. One young woman, for instance, had witnessed severe violence in her home during her childhood and had been involved with the child welfare system both as a child and as a mother. She struggled with hypertension, severe headaches, obesity and anxiety. She lamented that getting care was just out of reach, particularly for her mental health. Every time she started to connect to a therapist, she said, either the center would close or the therapist would leave.\nThe research is clear that childhood trauma leads to higher rates of early morbidity and health ailments such as cardiovascular disorders. But it was striking to see these symptoms starting among people still in their teenage years.\nHolistic interventions\nSociety typically tries to reduce violence by fixing individual behaviors – using metal detectors to curb weapons, for example, or creating mentoring programs for individuals deemed at-risk for violence.\nI believe a more holistic approach would go further. Libraries, parks and community centers promote education, physical activity and social cohesion for children in high-poverty neighborhoods. Connecting people with jobs that pay a living wage helps them maintain a decent quality of life and increase their self-worth. Investing in quality mental health services in neighborhoods that lack them can provide young people with the professional support they need to process their environment and what is happening around them.\nIn short, recognizing that violence comes in many forms, and requires multiple levels of intervention, could make a world of difference."
    },
    {
      "url": "https://www.prisonpolicy.org/blog/2023/11/08/association_restrictions/",
      "text": "Guilty by association: When parole and probation rules disrupt support systems\nRequiring people on supervision to avoid others with criminal legal system contact can actually hinder their success in the community. We found that it’s common for probation and parole agencies to impose these “association” restrictions, tearing apart critical social networks and threatening to lock people up for harmless — and even helpful — interactions.\nby Leah Wang, November 8, 2023\nFor the 3.7 million people on parole or probation in the United States, the very people who can best support their success are often unable to help because of supervision conditions that prohibit them from being in contact. Individuals reentering their communities on probation or parole often rely on support networks of family and peers who have been through similar reentry experiences.1 Though research supports the unique benefits of these social connections, many states actually prohibit people on supervision from this contact, under the false assumption that it will lead people into criminalized behaviors. These “association” restrictions — sometimes called “no-association conditions” — are isolating and costly to those on supervision. And the stakes are high: Failure to follow association restrictions can result in incarceration.\nIn prior work on probation and parole, we’ve referred to more widely known, difficult-to-satisfy supervision conditions — like securing employment and paying relentless fees— as examples of why supervision doesn’t “work” for so many people and too often results in incarceration for “technical” violations. In this briefing, we add to this work by compiling the most thorough research and data on association restrictions to date. We show that, despite their illogical foundations and documented harms, they are imposed on hundreds of thousands of people (and impact many others) at any given time. If states and local jurisdictions truly want people on supervision to succeed, they should acknowledge and ultimately abandon association restrictions.\nParole and probation conditions outlaw crucial relationships\nResearch suggests that association-related release conditions are common in parole and probation. These restrictions are relics of antiquated supervision systems that required people under their control to live virtuous lives, “be good,” and associate with “good people.” They generally prohibit interactions between people on supervision and large swaths of the population, such as those with felony convictions or others on probation or parole. As a result, people must steer clear of certain places altogether, producing a complex web of prohibited activities and relationships that make it even harder to find housing and work, arrange for transportation, participate in treatment programs, or otherwise succeed in reentry.\nIn most parole systems, association conditions are standard\nWhile they’re not the most infamous supervision conditions,2 association restrictions are incredibly common across probation and parole systems, and impact hundreds of thousands of people. In a recent study, researchers found that over half of the 187 supervision programs they examined (including parole, probation, and electronic monitoring) in 2023 had some regulation about “who people can be around, talk with, or socialize with.” But these rules are especially entrenched in parole systems: A recurring census of standard parole conditions revealed that rules related to “undesirable associates/correspondence” have been used by an average of 30 jurisdictions over each of the six censuses, the first of which was in 1956.3\nBut when we look beyond standard conditions, it’s clear these restrictions are imposed almost universally. According to a 2019 law review article, nearly all parole jurisdictions (50 states, D.C. and the federal supervised release system)4 have association restrictions, whether they are standard or special conditions that could be imposed at any time by an authority such as a parole officer or judge. This valuable survey, which we’ve updated for this briefing, also identifies which categories of people are off-limits for individuals on supervision. (We’re thankful to Professor James M. Binnall for this work addressing association restrictions so comprehensively.) Using Professor Binnall’s categories, we found that some states go to great lengths to control these relationships:\n- More than half of jurisdictions (28 of 52) have some form of association restriction that is standard. But even states where it wasn’t a standard condition (California, Colorado, Pennsylvania, Nevada, and Minnesota) had an association restriction spelled out in its optional special conditions.\n- Ten states have a problematic “discretionary” condition, where a parole officer, parole board, judge, or other authority can simply decide to restrict interactions with any individual or group of people they claim would undermine their client’s success.5\n- Association restrictions most commonly prohibit contact with people with felony convictions (7 states) or people with any criminal conviction (10 additional states). Massachusetts and Iowa have a restriction on associating with anyone with a criminal record, which would apply to others on supervision and currently incarcerated people, too. It’s worth noting that an estimated 1 in 3 U.S. adults has a criminal record.\n- Fourteen states explicitly restrict association with people described vaguely as “involved in” or “actively engaged in” criminal activity; this restriction often extends to places where criminal activity is or may be happening. Here we included vague restrictions like Mississippi’s “persons of bad reputation” and Alabama’s “persons of disrepute or harmful character.”\n- Twelve states restrict association with currently incarcerated people and visiting correctional institutions generally, and eight states restrict other people on supervision. Given how many people in prison report a family history of incarceration,6 there are countless family visits and communications that are prohibited as a result of these restriction categories.\n- Five states restrict association with purported members of gangs or other “criminal organizations,” who are already tracked in some cities in a separate effort to over-police neighborhoods of color.7\nIn many states, people on supervision can seek permission to associate with specific individuals in restricted categories — to visit a loved one in prison, for example — by asking their supervision officer or through a more formal hearing. But many may decide that these extra hurdles aren’t worth it to be told “no” or to have their interactions even more closely scrutinized. Overall, the landscape of association restrictions is highly repressive, leaving people to navigate reentry without valuable support.\nHow different states limit relationships for people on parole\n| Standard condition? | Felony convictions | Criminal convictions | People targeted as gang members | Other people on supervision | Discretionary | Criminalized activity | Currently incarcerated people | |\n|---|---|---|---|---|---|---|---|---|\n| Link to statute or agency document | People with a felony conviction | People with a felony or misdemeanor conviction | Includes language like “street gang,” “criminal organization,” “criminal gang member” | Includes parole, probation, other supervised release, or those in law enforcement custody | A catch-all provision allowing a field agent specifically to impose association restrictions on individuals | People targeted for alleged “illegal activity” or “controlled substances,” and people targeted for “disreputable character” or similar | Includes correctional facilities generally | |\n| Alabama | Yes | X | ||||||\n| Alaska | Yes | X | X | X | ||||\n| Arizona | Yes | X | X | X | ||||\n| Arkansas | Yes | X | X | X | ||||\n| California | No | X | ||||||\n| Colorado | No | X | ||||||\n| Connecticut | Yes | X | ||||||\n| Delaware | No | |||||||\n| District of Columbia | Yes | X | X | |||||\n| Florida | Yes | X | X | |||||\n| Georgia | No | X | ||||||\n| Hawaii | Yes | X | X | X | ||||\n| Idaho | No | |||||||\n| Illinois | Yes | X | X | X | X | |||\n| Indiana | Yes | X | ||||||\n| Iowa | Yes | X | X | X | ||||\n| Kansas | Yes | X | X | |||||\n| Kentucky | Yes | X | X | |||||\n| Louisiana | Yes | X | ||||||\n| Maine | No | |||||||\n| Maryland | No | |||||||\n| Massachusetts | Yes | X | X | X | X | |||\n| Michigan | Yes | X | ||||||\n| Minnesota | No | |||||||\n| Mississippi | Yes | X | X | X | ||||\n| Missouri | Yes | X | ||||||\n| Montana | No | |||||||\n| Nebraska | Yes | X | X | |||||\n| Nevada | No | X | X | X | X | |||\n| New Hampshire | Yes | X | X | X | ||||\n| New Jersey | No | |||||||\n| New Mexico | Yes | X | ||||||\n| New York* | No | |||||||\n| North Carolina | No | |||||||\n| North Dakota | No | |||||||\n| Ohio | Yes | X | ||||||\n| Oklahoma | Yes | X | X | X | ||||\n| Oregon | No | |||||||\n| Pennsylvania | No | X | ||||||\n| Rhode Island | Yes | X | ||||||\n| South Carolina | Yes | X | X | |||||\n| South Dakota | No | |||||||\n| Tennessee | No | |||||||\n| Texas | No | |||||||\n| Utah | Yes | X | X | |||||\n| Vermont | Yes | X | ||||||\n| Virginia | No | |||||||\n| Washington | No | |||||||\n| West Virginia | No | |||||||\n| Wisconsin | No | |||||||\n| Wyoming | No | |||||||\n| Federal (supervised release) | Yes | X | X | |||||\n| Totals | 28 | 7 | 10 | 5 | 8 | 10 | 14 | 12 |\nProbation agencies ban certain people from interacting as well\nNearly 3 million people are on probation, the most common type of mass punishment. While we don’t have a complete picture of how the thousands of probation agencies nationwide approach association restrictions, research confirms that some of the largest jurisdictions impose them:\n- Georgia, which has the largest probation population in the U.S. at over 347,000, requires people to “avoid persons or places of disreputable or harmful character.”\n- The three biggest counties in Texas — Harris, Dallas, and Tarrant counties — also impose this condition on anyone under probation supervision.\n- California, which had over 157,000 people on probation in 2021, imposes a standard condition wherein people must “refrain from becoming abandoned to improper associates.”8\nIf these conditions sound a bit archaic and vague, it’s because they are. Association restrictions needlessly complicate life in the community and should be eliminated from supervision rules.\nAssociation restrictions are presumptuous and undermine social networks that are important for reentry\nThe senselessness and cruelty of association restrictions undermine the very purpose of supervision, which includes helping people get the resources and build the relationships they need to achieve stability in the community. Breaking down some of their biggest harms, we argue that:\n- Association restrictions have it wrong and backward. The idea that someone with even a minor or bygone criminal history will have a negative influence on someone under supervision is unfounded. The myth of the “career criminal” or permanent criminal disposition has been busted, time and time again. Evidence shows that the opposite is true: people actually benefit from associating with those with lived experience. Highly regarded reentry organizations often use “mutual-help” or “credible messenger” models employing formerly incarcerated people as counselors and mentors to others navigating reentry. This supportive, non-judgemental model is shown to have positive impacts on both participants and staff.\n- They are vague. Even when states are clear in categorically excluding whole groups of people, they are comically unclear about what it means to “associate” with those people. This nebulous language makes it difficult to know what counts as an association: Does an interaction with someone’s social media post, sending money through an app, or an accidental encounter at a gas station threaten public safety? It’s also difficult, then, for someone to challenge the legality of an association restriction when the courts can make their own interpretation. According to law professor Fiona Doherty, these restrictions are “purposefully — indeed, rigorously — unclear.”\n- They force people on supervision to live in isolation and fear. Many people plan to live with or receive substantial support from family after being released from prison. But such relationships and living options may suddenly be off-limits due to an association restriction, forcing stressful and costly relocation. Some people on supervision have desperately turned to internet forums, reasonably confused about how their living situation could be prohibited, given the requirement to maintain housing. Their fear and lack of clarity puts them at risk of violating their terms of release and being subject to incarceration — but it may also feel risky to seek answers from their supervision officer. Loved ones, too, are pulled into enforcing and cooperating with these restrictions, impacting many people beyond those with an actual supervision contract.\n- The millions of people in restricted categories make it nearly impossible to avoid prohibited associations. An estimated 24 million people in the U.S. have a felony conviction on record, while an estimated 80 million people have a criminal record of any sort.9 And nearly 2 million more people are currently incarcerated, which means they’re off-limits to people on parole in eight states, according to our analysis. Given that 44% of parole jurisdictions10 restrict at least one of these large categories of people, association restrictions have an outsized impact compared to the little criticism they’ve received.\n- These restrictions disproportionately impact Black communities. We know that Black people are overrepresented everywhere within the criminal legal system, including parole and probation systems,11 and most likely those with criminal records.12 The sheer scale of overcriminalization, as well as geographic and social segregation that continues to hinder economic opportunity, makes it difficult to avoid regular contact with other people in restricted categories, tearing apart vital relationships and community ties for Black people in particular.\nUnfortunately, we don’t know how many people face consequences for violating association restrictions. But as with other over-enforced conditions, association restrictions that lead to any time behind bars are an example of excessive and costly “technical” violations. And judges have imposed some extreme punishments: In Texas, a man on probation was sentenced to four years in prison for being seen near enough to a “crack house” to be in association with people who sell drugs or engage in other illegal activity, thus violating Texas’ condition to “avoid persons or places of disreputable or harmful character.” Another man, on federal supervised release, received 18 months in prison, followed by three more years on supervised release for speaking to a fellow member of his treatment group on the subway.\nAs supervision technology advances, association is an easy target for aggressive enforcement\nExperts studying association restrictions and other onerous supervision conditions warn of the creep of new surveillance technology into carceral systems like probation and parole. Smartphones and location-tracking apps, for example, may supplement older methods like GPS-enabled ankle monitoring, and artificial intelligence (AI) promises “real-time” monitoring of people on supervision. Those engineering or hoping to deploy these technologies may view them as benign or even altruistic developments, but we see them as an ominous new frontier in the enforcement of supervision conditions that are already burdensome.\nAs law professor Kate Weisburd warns, “There is little doubt that improved surveillance capabilities enhance the ability of supervising agents to detect violations.” The recurring parole census mentioned earlier also sounds the alarm: An “ever-expanding” arsenal of technological solutions, they argue, will lead to “enhanced micro-surveillance” of people on supervision. New technology will undoubtedly appeal to lawmakers as an acceptable mechanism for moving people out of prisons and saving taxpayer money. But as widely understood extensions of carceral systems (rather than alternatives to incarceration), probation and parole shouldn’t be given invasive technologies that expand their reach into people’s lives.\nIf association restrictions go unchecked as surveillance technology expands, state and local lawmakers will continue to trap people on supervision in cycles of incarceration and being “free.” People who judges or parole boards have already deemed “safe” to release to the community should be able to decide with whom they associate and from whom they seek support, housing, or job opportunities. Association restrictions perpetuate harmful assumptions about people with criminal legal involvement, set people up for failure, and should be abolished as a condition of probation or parole.\nFootnotes\n-\nAn early version of this concept is the “wounded healer,” a term coined by Carl Jung in 1951. The wounded healer idea claims that an analyst or physician’s own experience of being “wounded” (through illness, mental health struggles, or something else) promotes a sense of solidarity and improves communication between “healer” and “patient.” ↩\n-\nPerhaps the most widely known and imposed supervision conditions include finding and maintaining employment (which is very difficult for someone with a criminal record) and meeting all legal-financial obligations (which is very difficult for someone who is more likely to be poor, whether they were in state prison, jailed, or simply on probation). ↩\n-\nThis long-term study of standard parole conditions provides an extremely useful historical perspective on how the number and nature of parole conditions has changed. Unfortunately, the study doesn’t capture the specific wording of states’ parole association restrictions, so it doesn’t tell us which states prohibit which group(s) of people through their restrictions. ↩\n-\nWhile not all states have a system of discretionary parole release, all have some form of “parole” or post-release supervision. Sixteen states have abolished or severely curtailed discretionary parole, but they still have laws in place governing parole for those who are still eligible (i.e., their crime happened before a certain date). The federal parole system was also abolished but replaced with a similar “supervised release” status. And D.C. operates its own “supervised release” system, responsible for D.C. residents granted parole by the U.S. Parole Commission as well as other supervision programs. ↩\n-\nThough not part of our analysis, the vast majority of jurisdictions allow for any additional condition at all to be imposed by the proper authority; this could conceivably include association restrictions with individuals or groups. ↩\n-\nMore than half (59%) of state and federal prisoners report having an immediate family member who has been incarcerated, according to the Bureau of Justice Statistics’ Profile of Prison Inmates, 2016. ↩\n-\nSeparate from association restrictions, some police departments and other agencies keep “gang databases” that list personal information about people — including children — identified as being “suspected” members of street organizations like gangs. These lists and their criteria for inclusion, often kept hidden from public view, also tear at the social fabric of communities and are widely regarded as a tactic for targeting Black and Brown residents. ↩\n-\nIn 2015, a version of California Penal Code, as amended by Senate Bill 517, contained language restricting people on probation from “improper associates.” This is the version cited by Prof. Fiona Doherty in her 2016 paper Obey All Laws and Be Good: Probation and the Meaning of Recidivism; a current version of the state penal code does not have the same reference, and we couldn’t locate an updated resource outlining conditions of probation. ↩\n-\nThis estimate is calculated using data from SEARCH’s 2020 Survey of Criminal History Information Systems and the methodology proposed by NELP’s 65 Million Need Not Apply, reducing the total number of people with criminal records in the United States by 30 percent (to account for people with records in multiple states). Note that this is a slightly different estimate than what we’ve published in the Whole Pie report, because that was based on 2018 survey data. This estimate is likely an undercount due to a lack of data on people who have been arrested for misdemeanors. ↩\n-\nSpecifically, 23 out of the 52 parole jurisdictions whose restrictions we analyzed restrict people with felony convictions, criminal convictions, and/or currently incarcerated people. ↩\n-\nIn 2021, white people made up 59% of the U.S. population, but only 38% of the probation population and 39% of the probation population. Meanwhile, Black people were approximately 12% of the U.S. population but made up 21% and 28% of the probation and parole populations, respectively. U.S. population data by race in 2021 are calculated from the U.S. Census Bureau’s American Community Survey, 2021 5-Year Estimates, and parole and probation population data by race in 2021 come from the Bureau of Justice Statistics. ↩\n-\nWhile it’s highly likely that the massive populations of people with criminal records are disproportionately Black, we do not have robust data on these populations. Some studies estimate the racial makeup of the felony conviction population on more granular levels. For example, over a six-year period in Massachusetts, Black people comprised 6.2% of the state population, but 19.7% of people convicted of a felony offense. And in New York, Black people make up about 14% of the population, but 40% of the felony conviction population. ↩"
    },
    {
      "url": "https://www.gettyimages.com/detail/news-photo/rapper-meek-mill-greets-fans-at-a-rally-outside-the-news-photo/978445880",
      "text": "Rapper Meek Mill greets fans at a rally outside the...\nPHILADELPHIA, PA, UNITED STATES - 2018/06/18: Rapper Meek Mill greets fans at a rally outside the courthouse where he returns today, continuing to seek a new trial on charges he's been fighting for a decade. (Photo by Michael Candelori/Pacific Press/LightRocket via Getty Images)\nPURCHASE A LICENSE\nHow can I use this image?\nkr 2,800.00\nSEK\nDETAILS\nRestrictions:\nContact your local office for all commercial or promotional uses.\nCredit:\nEditorial #:\n978445880\nCollection:\nLightRocket\nDate created:\nJune 18, 2018\nUpload date:\nLicense type:\nRelease info:\nNot released. More information\nSource:\nLightRocket\nObject name:\nCandelori_MeekMill061918(5)\nMax file size:\n4717 x 3145 px (15.72 x 10.48 in) - 300 dpi - 5 MB\n- Meek Mill,\n- Courthouse,\n- Artist,\n- Arts Culture and Entertainment,\n- Criminal,\n- Fan - Enthusiast,\n- Greeting,\n- Hip Hop Music,\n- History,\n- Horizontal,\n- Legal Proceeding,\n- Legal Trial,\n- Music,\n- New,\n- Performer,\n- Philadelphia - Pennsylvania,\n- Photography,\n- Political Rally,\n- Prison Cell,\n- Prisoner,\n- Probation,\n- Protest,\n- Protestor,\n- Pursuit - Concept,\n- Rapper,\n- Social Issues,\n- USA,"
    },
    {
      "url": "https://theconversation.com/us/philadelphia-pennsylvania-news",
      "text": "Highlighting emerging research and expert analysis on issues important to Philly, Delaware and Southern New Jersey.\nPart of a pilot project funded by the Knight Foundation.\nLatest news\nHello Readers! Our local team wants to hear your feedback and story ideas. Send an email to Emily Costello, Director of Local News + Collaborations, and Philadelphia Editor Kate Kilpatrick at philadelphia@theconversation.com\nPolitics\nAre you an academic who studies Philadelphia or Pennsylvania?\nPitch usAddiction and treatment\nImmigration\nClimate change and environment\nPhilly media! Reach out to learn more about how to republish our content, request stories, data visualizations or expert sources to enrich your reporting -- or share your out-of-the-box idea for teaming up. You can reach our local team at philadelphia@theconversation.com. We have photos to share, too!"
    },
    {
      "url": "http://theconversation.com/pennsylvania-overhauled-its-sentencing-guidelines-to-be-more-fair-and-consistent-but-racial-disparities-may-not-disappear-so-soon-224941?utm_source=Yahoo&utm_medium=related-link&utm_campaign=related-link2&utm_content=article-259975",
      "text": "Pennsylvania’s new sentencing guidelines went into effect on Jan. 1, 2024. They mark the eighth iteration since the state first introduced such guidelines in 1982 and are perhaps the most comprehensive revision to date.\nSince Philadelphia has by far the largest share of incarcerated people in the state, the new sentencing guidelines affect many Philadelphia residents.\nC. Clare Strange, an assistant research professor in the Department of Criminology and Justice Studies at Drexel University, is the principal investigator in a study that will evaluate the impacts of the new guidelines on racial and ethnic disparities in sentencing outcomes over the next five years. She spoke with The Conversation U.S. about how the guidelines have changed and what people with a criminal history in Philadelphia need to know about them.\nHow do judges determine a person’s sentence?\nPennsylvania uses what are known as advisory sentencing guidelines. This means that judges are required to consider what the state guidelines suggest a criminal sentence should be, but they are not required to comply with the guidelines. That’s different from other states such as Minnesota and Oregon that have mandatory sentencing guidelines. Meanwhile, a majority of U.S. states have no sentencing guidelines at all.\nIn Pennsylvania, judges primarily consider what crime the person is charged with along with their prior record or criminal history.\nA matrix tells judges what the standard recommended sentencing range would be. Typically, judges sentence a defendant to a minimum term and then, after that minimum term, a parole board decides when it’s appropriate for the person to be released.\nWhat’s new in the 2024 sentencing guidelines?\nA lot has changed. Probably the most significant change is re-weighting the two categories in the matrix — offense severity and criminal history. These categories are officially known as the Offense Gravity Score and the Prior Record Score. There are now fewer categories of criminal history and far more categories of offense severity.\nThe revised guidelines have more than double the number of categories for Offense Gravity Score, which aim to ensure that sentences better align with crime severity. This is important because there is less opportunity for disparities to come through when a sentencing recommendation is more specific and more consistent between similar types of crimes.\nChanges to Prior Record Score calculations and categories aim to address racial disparities and refocus sentence recommendations on the current offense. Lapsing policies, for example, have been expanded to reduce the impact of criminal history on sentencing for less serious offenders. These can involve the removal of specific prior offenses from inclusion in the Prior Record Score calculation after a certain amount of time has passed or after the person has had an extended crime-free period.\nWhat’s the goal of the new guidelines?\nPennsylvania’s sentencing guideline system was mandated by the state legislature. The guidelines themselves were created by the Pennsylvania Commission on Sentencing with the the goal of promoting fair and uniform decisions on the severity of people’s punishment.\nThe commission was not explicitly formed to reduce punishment. That said, it has taken explicit efforts to reduce disparities in punishment that are linked to race and ethnicity.\nThe commission has 11 members who are appointed by the state Legislature. The members are typically judges, legislators and other criminal justice professionals. These commission members provide direction and oversight and are unique from commission staff, who collect, analyze and monitor the sentencing data for the state.\nWhat’s been the reaction so far?\nAnytime there’s talk about reducing the impact of criminal history on punishment, people express a whole spectrum of beliefs. Not everybody has the same primary concern of reducing disparities. For example, some people prefer more tough-on-crime policies. As a legislative body, the commission answers to many different constituencies.\nThe new guidelines mirror the federal sentencing guidelines in that there are many offense gravity categories. One critique I’ve heard is that the Offense Gravity Score now has too many categories and adjustments, and that this might complicate things such as plea negotiations.\nAbout 95% of criminal cases are settled in plea negotiation and never go to trial. Plea negotiations are a hidden interaction where the prosecution negotiates charges and punishments with defense attorneys and their clients in exchange for a plea of guilty or no contest. Having more Offense Gravity Score categories could lead to more complicated and slower plea negotiations.\nWill the guidelines reduce racial disparities in Pa.’s criminal justice system?\nNational statistics show that, on average, a Black person is more likely than a white person to be stopped by police, to experience police use of force when stopped, to be charged when arrested, to receive more charges when charged, to receive a harsher sentence, to be sentenced to confinement and so on. It’s a cumulative disadvantage across the justice process.\nThese disparities occur within Pennsylvania, too. For example, a December 2023 analysis by the Rand Corporation, a nonprofit global policy think tank, looked at racial disparities within the criminal justice system in Allegheny County, which includes Pittsburgh and is Pennsylvania’s second-most populated county after Philadelphia. It found that significant racial disparities exist at each of the key stages of people’s encounter with the criminal justice system, from having charges filed against them to having their parole revoked.\nCourts to some degree inherit disparities from police and prosecutor decision making, though the new guidelines may help to reduce them at later stages, such as sentencing.\nRacial and ethnic disparities in sentencing are widespread in the U.S. and are almost never entirely explained by legally relevant factors such as type of crime committed or criminal history. So researchers like me explain this leftover variation as the “race effect,” or “race and ethnicity effect.”\nPart of the commission’s charge is to collect and monitor data, which can be used by the state and other criminal justice researchers. Some states may lack the infrastructure to collect or monitor data to the degree that Pennsylvania does.\nThat’s where my project comes in. It is designed to use commission data so that at the end of the five years we can determine whether these changes to the guidelines had the intended impact on disparities – and if they didn’t, why not."
    },
    {
      "url": "http://theconversation.com/philadelphians-with-mental-illness-want-to-work-pray-date-and-socialize-just-like-everyone-else-heres-how-creating-more-inclusive-communities-is-good-for-public-health-254441?utm_source=Yahoo&utm_medium=related-link&utm_campaign=related-link0&utm_content=article-259975",
      "text": "Do you remember the COVID-19 shutdowns?\nMany Americans could no longer do the activities they enjoyed once businesses, schools, churches, gyms and community organizations shut their doors. Even spending time with friends and family became nearly impossible.\nNow imagine living that kind of isolation all the time.\nFor millions of Americans with serious mental health conditions, being unable to engage in meaningful activities is not just a temporary crisis – it’s daily life.\nCommunity inclusion refers to everyone’s right to participate in meaningful social roles. This includes working, going to school, practicing one’s faith or simply connecting with others in shared activities.\nYet, for the estimated 15.4 million U.S. adults living with significant mental health conditions – about 6% of the adult population – community inclusion is far from guaranteed. Compared with the general population, they are far less likely to be involved in social activities that bring purpose and connection, as well as health benefits.\nI am a psychologist who has worked in inpatient and outpatient psychiatric settings, and I directed a federally funded research and training center at Temple University in Philadelphia for more than 20 years that focuses on independent living and participation of people with serious mental illnesses.\nMy colleagues and I have conducted research which demonstrates that people with such conditions want to participate in their community just like everyone else. We also found that they can do so – with proper supports like medications, therapy, rehabilitation services and communities making reasonable accommodations for them. And furthermore, they should: Community inclusion is good for their health.\nBenefits of community life\nCommunity involvement gets people with mental illness out of bed and out of the house. It encourages movement and activity, which enhances physical health.\nThis is especially critical because people with serious mental illnesses die 15 to 20 years earlier than the general population – often due to preventable illnesses like diabetes, cancer and cardiovascular disease.\nRegular participation in life’s routines provides social and emotional stimulation that also boosts cognitive functioning, like memory and problem-solving, and reduces depression and loneliness.\nWhat really causes exclusion\nSome people may assume that people with severe mental illnesses are restricted from active participation in their communities solely due to the mental health symptoms themselves.\nFor example, they might think that cognitive issues related to schizophrenia make it too difficult for people to work or go to school; or that mania, anxiety and depression prevent them from having good relationships with others.\nBut environment also plays a major role.\nThe social model of disability suggests that people are not disabled by their diagnosis. Instead, they experience a disability through limitations in their communities because of physical, structural and social barriers.\nFor example, someone with anxiety or depression may be penalized in a college class that deducts points for students who do not speak up.\nA person with a disability that causes fluctuating moods or low energy might not succeed in a rigid nine-to-five job without accommodations.\nAnd a churchgoer who talks to themselves or has to walk around during services because their medications make them jittery – a condition called akathisia – or who is known to have been diagnosed with schizophrenia might be asked to leave because their presence makes others uncomfortable.\nThe result is that people are unable to participate not simply because of an impairment, but because of an environment that does not accommodate or appreciate their unique attributes.\nHelping people with mental illness rejoin community life\nSome programs here in Pennsylvania are working to change that.\nEducation Plus helps Philadelphia residents with mental health conditions complete college and financial aid application forms, obtain school accommodations for their disability, and develop good study habits or learn to ask for help from their instructors.\nPathways to Housing PA offers transitional job opportunities to people who have been homeless, and organizes picnics, trips to Phillies baseball games and other fun activities that create a sense of community belonging.\nA voter access initiative at an inpatient psychiatric facility in Pennsylvania helps patients check their voter registration status, register to vote and apply for mail-in ballots.\nThe nonprofit Compeer in suburban Philadelphia connects community volunteers to people with mental illnesses to engage in mutual leisure or educational interests. This oftentimes leads to long-term friendships.\nAnd a current study I am conducting is examining ways to support faith communities in Montgomery County to be more welcoming and embracing of individuals with mental illnesses.\nWhat you can do\nFamily members, friends and mental health professionals can simply ask people with mental illnesses about their interests – whether it’s employment, going to school, dating or making new friends – and then encourage and support them in pursuing those interests.\nCreating inclusive communities means not just offering services to people with serious mental illness, but also changing negative beliefs and behaviors toward them. This includes embracing people who might express emotions differently, require flexibility or simply behave in ways we’re not used to.\nFor example, say you’re in a coffee shop and encounter a person who is muttering to themselves and may not have bathed in a few days. Maybe you make eye contact, smile and say hello. Certainly reconsider complaining.\nIt takes empathy, open-mindedness and patience to create a community that welcomes people with mental illness and increases the likelihood that they can participate in society like everyone else.\nRead more of our stories about Philadelphia."
    },
    {
      "url": "http://theconversation.com/us?utm_source=Yahoo&utm_medium=related-link&utm_campaign=related-link-0&utm_content=article-259975",
      "text": "Get context to understand the news, in your inbox daily or weekly\nSubscribe to our newslettersJoin the 1,746 readers who give monthly to fund fact-based journalism\nI'll pitch inMore from The Conversation\nAre you an academic expert who wants to share your knowledge?\nPitch an articleTrump administration\nInternational\nNew research in health and science\nArtificial intelligence\nExtreme weather and natural disasters\nYou might also like…\nMost read this week\nOur partners and funders\nThe Conversation is a nonprofit organization and our work is made possible by the generosity of our readers, foundations, and university and college members. They make it possible for us to bring this journalism to the public without paywalls or licensing fees.\nView all our partners and funders"
    },
    {
      "url": "https://theconversation.com/institutions/yale-university-1326?utm_source=Yahoo&utm_medium=related-link&utm_campaign=byline-link&utm_content=article-259975",
      "text": "Yale University comprises three major academic components: Yale College (the undergraduate program), the Graduate School of Arts and Sciences, and the professional schools. In addition, Yale encompasses a wide array of centers and programs, libraries, museums, and administrative support offices. Approximately 11,250 students attend Yale.\nAprès des décennies d’exploitation par la France, Haïti a fini par verser des sommes considérables à son ancien colonisateur. Aujourd’hui, les appels à la restitution deviennent de plus en plus difficiles à ignorer.\nNero, Rome’s emperor from 54 to 68 C.E., rose to power at a young age and remained focused on himself, letting the needs of citizens fall to the wayside.\nAs mulheres que procuram os médicos por causa de dores causadas por problemas de saúde reprodutiva geralmente são aconselhadas a relaxar e procurar ajuda para a ansiedade.\nPublic records requested under the Freedom of Information Act have helped shape health policy and keep the government accountable – but recent staff cuts may make this impossible.\nAfter being exploited for decades by France, Haiti ended up forking over huge sums of money to its former colonizer. Now, the Caribbean nation’s calls for restitution are becoming harder to ignore.\nWhether by shuffling agency personnel, creating new agencies, or limiting their capacity for oversight, a common tactic among power-hungry leaders is establishing control over the country’s bureaucracy.\nTwins are pretty rare, accounting for just 3% of births in the US these days. But new research shows that for primates 60 million years ago, giving birth to twins was the norm.\nA biblical scholar traces how images of the ‘city of God’ have shaped American culture – especially when it comes to who should be allowed into the country.\nBlack and Hispanic women are less likely to receive an endometriosis diagnosis, reflecting a possible systemic bias or disparity in health care access.\nLa melatonina es un principio activo con un gran potencial terapéutico, pero aún se desconocen en buena medida sus posibles efectos adversos a largo plazo."
    },
    {
      "url": "https://scholar.google.com/citations?hl=en&user=K3GGjU4AAAAJ",
      "text": "| Mental health outcomes in formerly incarcerated Black men: A systematic mixed studies review HA Addison, TS Richmond, LM Lewis, S Jacoby Journal of Advanced Nursing 78 (7), 1851-1869, 2022 | 37 | 2022 |\n| Compelling Voices of Diversity, Equity, and Inclusion in Prelicensure Nursing Students: Application of the Cultural Humility Framework R Wright, DL Baptiste, A Booth, H Addison, M Abshire, D Alvarez, ... Nurse educator 46 (5), E90-E94, 2021 | 19 | 2021 |\n| Contraceptive use among women experiencing intimate partner violence and reproductive coercion: the moderating role of PTSD and depression JL Zemlak, L Marineau, TC Willie, H Addison, G Edwards, T Kershaw, ... Violence against women 30 (9), 2075-2095, 2024 | 3 | 2024 |\n| The Lasting Impact of Incarceration: A Qualitative Thematic Analysis of Mental Health in Formerly Incarcerated Black Men HA Addison, TS Richmond, T Ghose, SF Jacoby Social Science & Medicine, 118244, 2025 | 1 | 2025 |\n| Prevalence of mental health conditions, substance use disorders, suicidal ideation and attempts, and experiences of homelessness among Veterans with criminal-legal involvement … ER Edwards, A Fortuna, R Holliday, H Addison, J Tsai Clinical Psychology Review 115, 102533, 2025 | 1 | 2025 |\n| Resident perspectives on police involvement in the response to mental health crises H Addison, R Shefner, J Wood, E Anderson Journal of Community Safety and Well-Being 8 (3), 112-118, 2023 | 1 | 2023 |\n| Development of an HIV/STI and partner violence health promotion intervention for abused US Virgin Islands women KA Alexander, P Sharps, H Addison, D Bertrand, A Bauman, ... Health promotion international 38 (4), daad072, 2023 | 1 | 2023 |\n| “I Know What I Need”: A Mixed Methods Study of Mental Health-Seeking Behaviors in Formerly Incarcerated Black Men HA Addison, TS Richmond, T Ghose, SF Jacoby Journal of Racial and Ethnic Health Disparities, 1-13, 2025 | | 2025 |\n| MENTAL HEALTH AND HEALTH-SEEKING BEHAVIORS IN FORMERLY INCARCERATED BLACK MEN H Addison University of Pennsylvania, 2024 | | 2024 |\n| 0080 Do traditional masculinity attitudes moderate relationships between cumulative violence experiences and marijuana/alcohol use among black young men in Baltimore, Maryland? L Marineau, V Flanagan, H Addison, K Alexander Injury prevention 27 (Suppl 3), A22-A23, 2021 | | 2021 |\n| 0086 Mental health in formerly incarcerated black men: a systematic mixed studies review H Addison, SF Jacoby Injury prevention 27 (Suppl 3), A24-A25, 2021 | | 2021 |"
    },
    {
      "url": "https://www.prisonpolicy.org/reports/outofwork.html",
      "text": "By Lucius Couloute and Daniel Kopf\nJuly 2018\nFormerly incarcerated people need stable jobs for the same reasons as everyone else: to support themselves and their loved ones, pursue life goals, and strengthen their communities. But how many formerly incarcerated people are able to find work? Answering this fundamental question has historically been difficult, because the necessary national data weren’t available — that is, until now.\nUsing a nationally representative dataset, we provide the first ever estimate of unemployment among the 5 million formerly incarcerated people living in the United States.1 Our analysis shows that formerly incarcerated people are unemployed at a rate of over 27% — higher than the total U.S. unemployment rate during any historical period, including the Great Depression.\nOur estimate of the unemployment rate establishes that formerly incarcerated people want to work, but face structural barriers to securing employment, particularly within the period immediately following release. For those who are Black or Hispanic — especially women — status as “formerly incarcerated” reduces their employment chances even more. This perpetual labor market punishment creates a counterproductive system of release and poverty, hurting everyone involved: employers, the taxpayers, and certainly formerly incarcerated people looking to break the cycle.\nFortunately, as the recommendations presented in this report illustrate, there are policy solutions available that would create safer and more equitable communities by addressing unemployment among formerly incarcerated people.\nOver 600,000 people make the difficult transition from prisons to the community each year2 and although there are many challenges involved in the transition, the roadblocks to securing a job have particularly severe consequences. Employment helps formerly incarcerated people gain economic stability after release and reduces the likelihood that they return to prison,3 promoting greater public safety to the benefit of everyone. But despite the overwhelming benefits of employment, people who have been to prison are largely shut out of the labor market.4\nWe find that the unemployment rate5 for formerly incarcerated people is nearly five times higher than the unemployment rate for the general United States population, and substantially higher than even the worst years of the Great Depression.6 Although we have long known that labor market outcomes for people who have been to prison are poor, these results point to extensive economic exclusion that would certainly be the cause of great public concern if they were mirrored in the general population.7\nThese inequalities persist even when controlling for age. Among working-age individuals (25-44 in this dataset), the unemployment rate for formerly incarcerated people was 27.3%, compared with just 5.2% unemployment for their general public peers. That such a large percentage of prime working-age formerly incarcerated people are without jobs but wish to work suggests structural factors — like discrimination — play an important role in shaping job attainment.8\nPrior research suggests that employers discriminate against those with criminal records, even if they claim not to. Although employers express willingness to hire people with criminal records, evidence shows that having a record reduces employer callback rates by 50%.9 What employers say appears to contradict what they actually do when it comes to hiring decisions.10\nOur analysis also shows that formerly incarcerated people are more likely to be “active” in the labor market than the general public. Among 25-44 year old formerly incarcerated people, 93.3% are either employed or actively looking for work, compared to 83.8% among their general population peers of similar ages.11 Though unemployment among formerly incarcerated people is five times higher than among the general public, these results show that formerly incarcerated people want to work.\nUnemployment among this population is a matter of public will, policy, and practice, not differences in aspirations.\nIn the general public, people of color tend to face higher unemployment rates than whites, while men tend to have lower unemployment rates than women. The overrepresentation of people of color and men among those who have been to prison, then, could have conceivably influenced the inequalities we observed between formerly incarcerated people and the general public.\nAfter disaggregating by race and gender, however, we found that the unemployment rate of every formerly incarcerated group remains higher than that of any comparable group in the general public. High unemployment among formerly incarcerated people is not simply explained by the overrepresentation of people of color in the criminal justice system; it’s the status of being formerly incarcerated that sets them apart.\nBut the story here is intersectional. Formerly incarcerated Black women in particular experience severe levels of unemployment, whereas white men experience the lowest. Overall, we see working-age “prison penalties”12 that increase unemployment rates anywhere from 14 percentage points (for white men) to 37 percentage points (for Black women) when compared to their general population peers.13 Our findings mirror prior research establishing that both race and gender shape the economic stability of criminalized people.14\n| Unemployment rate general population | Unemployment rate formerly incarcerated |\n|\n|---|---|---|\n| Black women | 6.4% | 43.6% |\n| Black men | 7.7% | 35.2% |\n| White women | 4.3% | 23.2% |\n| White men | 4.3% | 18.4% |\nWe also find that unemployment is highest within the first two years of release, suggesting that pre- and post-release employment services are critical in order to reduce recidivism and help incarcerated people quickly integrate back into society. Of those most recently released from prison (that is, within two years of the survey date), over 30% were unemployed. Unemployment rates were lower for those released within 2-3 years of the survey (21%), and people who had been out of prison for at least 4 years reported the lowest rates of unemployment (just under 14%). 15\n| Year Released (Years since release at the time of the 2008 survey) | Unemployment rate |\n|---|---|\n| 2007-2008 (less than 2 years since release) | 31.6% |\n| 2005-2006 (2-3 years since release) | 21.1% |\n| 2004 or before (4 or more years since release) | 13.6% |\nThe transition from prison back to the community is fraught with challenges; the search for employment is one of many tasks that can derail successful reentry. In the period immediately following release, formerly incarcerated people are likely to struggle to find housing16 and attain addiction and mental health support.17 They also face disproportionately high rates of death due to drug overdose, cardiovascular disease, homicide, and suicide within this crucial period.18 Taken together, these results make it easy to understand how various barriers to reentry operate as an interconnected system to increase inequality.\nWhen formerly incarcerated people do land jobs, they are often the most insecure and lowest-paying positions.19 According to an analysis of IRS data by the Brookings Institution,20 the majority of employed people recently released from prison receive an income that puts them well below the poverty line.21\nOur data suggests that, in combination with a criminal record, race and gender play a significant role in shaping who gets access to good jobs and livable incomes. Almost all employed formerly incarcerated white men (the group most likely to be employed) work in full-time positions, whereas Black women (the group least likely to be employed) are overrepresented in part-time and occasional jobs (see figure 3).\nThough Black women in the general public tend to have higher rates of full-time work than their Hispanic or white peers, low rates of full-time work among formerly incarcerated Black women illustrates that gender and race operate together in the context of reentry.22\nOne of the primary concerns for people being released from prison is finding a job. But as our analysis illustrates, formerly incarcerated people are almost five times more likely than the general public to be unemployed, and many who are employed remain relegated to the most insecure jobs. Our analysis also shows that formerly incarcerated people of color and women face the worst labor market disadvantages despite being more likely to be looking for jobs (See Table 3).\nExclusionary policies and practices — not individual-level failings of criminalized people — are responsible for these labor market inequalities. Fortunately, research shows that those with prior criminal justice system contact want to work and that hiring them can benefit both employers and the general public:\nThe evidence illustrates that broad stereotypes about people with criminal records have no real-world basis. But convincing employers that people with criminal records are good workers is not enough. Improving the wellbeing of formerly incarcerated people — and increasing equity in all communities — will require concerted policy efforts that address the underlying structural sources of inequality shaping the lives of criminalized people across the United States.\nThere are promising policy choices available to lawmakers at each level of government that would help formerly incarcerated people gain employment and increase public safety:\nEmployment outcomes for formerly incarcerated people vary widely by race and gender. In the chart and table below, we explore these disparities in richer detail:\nThe unemployment rate in all demographic groups is different from the joblessness rate. Joblessness includes anyone who does not have a job, whether they are looking for one or not, and was, prior to our analysis, the only measurement of formerly incarcerated people’s labor market status. Unemployment, which is typically used to measure the economic well-being of the general U.S. population, includes only those people who want to work but can’t find a job. The table below provides both figures.\n| Race/ethnicity | Gender | Jobless rate | Unemployment rate |\n|---|---|---|---|\n| Hispanic | Women | 51.39% | 39.42% |\n| Men | 33.14% | 26.55% | |\n| Black | Women | 51.37% | 40.00% |\n| Men | 40.96% | 34.96% | |\n| White | Women | 38.17% | 23.10% |\n| Men | 27.17% | 18.31% |\nThis report calculating an unemployment rate for formerly incarcerated people is based on our analysis of a little-known and little-used government survey, the National Former Prisoner Survey, conducted in 2008. The survey was a product of the Prison Rape Elimination Act, and is therefore primarily about sexual assault and rape behind bars, but it also contains some very useful data on employment.\nBecause this survey contains such sensitive and personal data, the raw data was not available publicly on the internet. Instead, it is kept in a secure data enclave in the basement of the University of Michigan Institute for Social Research. Access to the data required the approval of an independent Institutional Review Board, the approval of the Bureau of Justice Statistics, and required us to access the data under close supervision. The practicalities of having to travel across the country in order to query a computer database limited the amount of time that we could spend with the data, and other rules restricted how much data we could bring with us. For these reasons, there are two tables (Table 1 and Table 2) where, if we had the benefit of hindsight or the resources for a return trip to the enclave, we would have collected some more nuanced data to make comparisons by race/ethnicity, gender, and age even more complete. Even so, to the best of our knowledge, the analysis in this report is the only one of its kind to date.\nAlthough the employment status of formerly incarcerated people is not a new subject, this report extends upon previous research by constructing an unemployment rate for formerly incarcerated people that is similar to what is typically accepted by economists: those who were not employed at the time of the survey but were available and actively looking for a job, divided by the total number of people in the labor force (Note: the Bureau of Labor Statistics considers jobless people who have looked for work in the past 4 weeks as part of the labor force. The National Former Prisoner Survey does not stipulate 4 weeks and instead asked respondents if they were currently looking for work).\nTraditionally, researchers have used joblessness as a measure of post-imprisonment labor market success, a measurement that includes anyone who does not have a job, whether they are looking for one or not. Calculating the unemployment rate allows policymakers, advocates, and the general public to directly compare the labor market exclusion of formerly incarcerated people to that of the rest of the United States.\nAs we have done in the past,33 comparisons between the formerly incarcerated and general U.S. populations were disaggregated by factors such as age, race, and gender in order to account for the established relationships between those factors and labor market outcomes. In this way, we provide rough controls that help us examine comparable populations.\nWe used the Bureau of Justice Statistics’ National Former Prisoner Survey (NFPS) as our primary data source. This survey began in January 2008 and concluded in October 2008, and was derived from the Prison Rape Elimination Act of 2003, which mandated that the Bureau of Justice Statistics investigate sexual victimization among formerly incarcerated people.\nThe NFPS dataset includes 17,738 adult respondents who were formerly incarcerated in state prisons and under parole supervision at the time of the survey. Individual respondents were randomly selected from a random sample of over 250 parole offices across the United States.\nIt is important to note that because this survey was given to people on parole, it is not a perfect tool to measure the employment experiences of all formerly incarcerated people. Some incarcerated people are released without supervision and their ability to attain employment may be different than those on parole. Previous research suggests, however, that parole officers have a minimal effect on post-release employment, far outweighed by the effect of having a criminal record. In a 2008 Urban Institute study, only 20% of formerly incarcerated men found their parole officers helpful in finding a job when surveyed two months after release; after eight months, only 13% thought their parole officers were helpful. Yet 70% of the men believed that their criminal record had negatively affected their job search.34 A more recent study finds that for people on parole in Florida, supervision did not have a significant effect on employment outcomes, although it had a positive effect for those under supervision as part of a split sentence.35 Future research should more closely examine the effect of supervision on employment.\nWe drew upon specific NFPS survey questions for this report:\nComparable general United States population data was gathered from the Bureau of Labor Statistics Current Population Survey.\nHistorical U.S. unemployment data for Figure 1 comes from two sources:\nThe non-profit, non-partisan Prison Policy Initiative was founded in 2001 to expose the broader harm of mass criminalization and spark advocacy campaigns to create a more just society. The organization is known for its visual breakdown of mass incarceration in the U.S., as well as its data-rich analyses of how states vary in their use of punishment. The Prison Policy Initiative’s research is designed to reshape debates around mass incarceration by offering the “big picture” view of critical policy issues, such as probation and parole, women’s incarceration, and youth confinement.\nThe Prison Policy Initiative also works to shed light on the economic hardships faced by justice-involved people and their families, often exacerbated by correctional policies and practice. Past reports have shown that people in prison and people held pretrial in jail start out with lower incomes even before arrest, earn very low wages working in prison, yet are charged exorbitant fees for phone calls, electronic messages, and \"release cards\" when they get out.\nLucius Couloute is a Policy Analyst with the Prison Policy Initiative and a PhD candidate in Sociology at the University of Massachusetts Amherst, his dissertation examines both the structural and cultural dynamics of reentry systems. His previous work with the Prison Policy Initiative examines reentry, solitary confinement, and the elimination of in-person jail visits across the country.\nDaniel Kopf is an economics reporter for Quartz and and a former data scientist who has been part of our network of volunteers since February 2015. He has previously written about money bail and has co-authored several exciting statistical reports with the Prison Policy Initiative: Prisons of Poverty: Uncovering the pre-incarceration incomes of the imprisoned, Separation by Bars and Miles: Visitation in state prisons, and The Racial Geography of Mass Incarceration. Dan has a Master’s degree in Economics from the London School of Economics. He is @dkopf on Twitter.\nThis report benefitted from the expertise and input of many individuals. The authors are particularly indebted to Alma Castro for IRB assistance, Allen Beck for his insight into the NFPS, the ICPSR staff for their data retrieval support, Elydah Joyce for the illustrations, our Prison Policy Initiative colleagues, and the National Employment Law Project for their helpful comments.\nThis report was supported by a generous grant from the Public Welfare Foundation and by our individual donors, who give us the resources and the flexibility to quickly turn our insights into new movement resources.\nS. Shannon, C. Uggen, J. Schnittker, M. Thompson, S. Wakefield, and M. Massoglia. 2017. The Growth, Scope, and Spatial Distribution of People With Felony Records in the United States, 1948-2010. Demography. ↩\nE. Ann Carson. 2018. Prisoners in 2016. Bureau of justice Statistics. ↩\nMark T. Berg and Beth M. Huebner. 2011. Reentry and the Ties that Bind: An Examination of Social Ties, Employment, and Recidivism. Justice Quarterly. ↩\nMichelle Natividad Rodriguez and Maurice Emsellem. 2011. 65 Million “Need Not Apply”: The Case for Reforming Criminal Background Checks for Employment. National Employment Law Project. ↩\nAlthough most studies of post-imprisonment labor market outcomes examine important indicators such as wages and joblessness, criminal justice researchers have yet to produce an unemployment rate comparable to the general U.S. population. Using data from the National Former Prisoner Survey (NFPS), this report fills that gap by estimating a standard unemployment rate among formerly incarcerated people on parole. To our knowledge, this report is the only nationally representative study of unemployment among formerly incarcerated people currently available.\nOur calculation of the unemployment rate allows us to examine the pervasiveness of labor market exclusion among formerly incarcerated people who are actively seeking work. Traditionally, researchers have used joblessness as a measure of post-imprisonment labor market success, which includes anyone who does not have a job, whether they are looking for one or not. While joblessness is a useful measure, and one that we also use, focusing on unemployment allows us to better pinpoint the structural sources of labor market inequality without falling into unfounded “culture of poverty” traps, or mistaking age or disability-based causes of joblessness for a lack of motivation. ↩\nIt is important to note that we are comparing the unemployment rate among formerly incarcerated people in 2008 to the general public in 2008 - which is the most recent year in which comparable data exists. Contemporary unemployment rates may differ, but we are confident that formerly incarcerated people are still substantially disadvantaged compared to the general public. We also calculated joblessness, a more commonly used indicator of post-imprisonment labor market success (see footnote 5), and found that 31.9% of 25-44 year olds who are formerly incarcerated do not have jobs. Conversely, only about 19% of their similarly aged general public peers are without jobs. ↩\nIt is important to note that the general public unemployment rate also includes formerly incarcerated people. If the appropriate data existed to separate out formerly incarcerated people from the general public unemployment rate we would find even larger disparities. ↩\nIndividual-level factors such as old age were not the primary drivers of unemployment among formerly incarcerated people. If they were, we would observe a substantial drop in the unemployment rate among the working age group. ↩\nDevah Pager examined the effect of a criminal record in the labor market by sending out paired job testers (two white testers and two Black testers) where one tester in each pair was given a fictitious felony record. Pager’s audit methodology allowed her to examine the independent effects of race and criminal records. Importantly, Black job testers without criminal records were less likely to receive callbacks from employers than white job testers with criminal records. Source: Devah Pager. 2003. The Mark of a Criminal Record. American Journal of Sociology. ↩\nDevah Pager and Lincoln Quillian. Walking the Talk? What Employers Say versus What They Do. American Sociological Review. ↩\nThis measurement is widely known as the “labor force participation rate.” We also find that the labor force participation rate of working-age formerly incarcerated men released from 2005 to 2008 is 94.9%, compared to 92% among men in the general public (suggesting that the difference between general public and formerly incarcerated labor force participation rates are not simply the product of men being overrepresented in the NFPS data). ↩\nOur term “prison penalty” refers to the unemployment gap between the general public and formerly incarcerated people. Although our data should not be interpreted to say that prison alone causes high unemployment rates among formerly incarcerated people, a wealth of data suggests that going to prison does negatively affect labor market outcomes. Apart from prison itself, criminal records and pre-imprisonment structural disadvantages such as low educational levels and pervasive racial discrimination undoubtedly contribute to high unemployment rates among people who have spent time in correctional facilities. ↩\nUnfortunately, because we had limited time and resources allocated to retrieving this data at the Inter-university Consortium for Political and Social Research (ICPSR) Physical Data Enclave located in Michigan, we were not able to collect all of the data we originally set out to gather. We are therefore only able to present disaggregated unemployment data for Black and white 35-44 year olds within 4 years of release (released 2005-2008). We believe, however, that this cross section of data still provides a useful comparison to Black and white men and women ages 35-44 in the general public.\nAlthough we were not able to construct comparable Hispanic rates of unemployment by gender and age, we can compare formerly incarcerated and general public Hispanic unemployment rates by gender alone:\n| Unemployment rate General population over age 20 (2008) | Unemployment rate Formerly incarcerated (2008) | |\n|---|---|---|\n| Hispanic women | 6.9% | 39.4% |\n| Hispanic men | 6.8% | 26.5% |\nBernadette Rabuy and Daniel Kopf. 2015. Prisons of Poverty: Uncovering the pre-incarceration incomes of the imprisoned Prison Policy Initiative. ↩\nThis analysis includes individuals 25 and older. It should also be noted that we analyzed the data on time since release on a calendar year basis, and respondents were surveyed over a 10-month period between January and October 2008. For that reason, our categories for time since release (e.g. “2-3 years since release”) are approximate. There may be some overlap between categories; for example, if a respondent was released in December 2006 and surveyed in January 2008, they would appear in our analysis in the “2-3 years since release” category, despite having only been released 13 months before the survey. ↩\nBrianna Remster. 2017. A Life Course Analysis of Homeless Shelter Use among the Formerly Incarcerated. Justice Quarterly. ↩\nJeffrey Draine and Daniel B. Herman. 2007. Critical Time Intervention for Reentry From Prison for Persons With Mental Illness. Psychiatric Services. ↩\nIngrid A. Binswanger, Marc F. Stern, Richard A. Deyo, Patrick J. Heagerty, Allen Cheadle, Joann G. Elmore, and Thomas D. Koepsell. 2007. Release from Prison — A High Risk of Death for Former Inmates.The New England Journal of Medicine. ↩\nGretchen Purser. 2012. “Still Doin’ Time:” Clamoring for Work in the Day Labor Industry. The Journal of Labor & Society. ↩\nAdam Looney and Nicholas Turner. 2018. Work and opportunity before and after incarceration. The Brookings Institution. ↩\nUnfortunately, according to the Congressional Research Service, most states have policies limiting access to needs-based financial and social resources such as SNAP, TANF, and housing assistance for those who have been convicted of drug-related crimes. Excluding people with drug convictions from welfare provisioning undoubtedly exacerbates other reentry barriers faced by formerly incarcerated people. ↩\nAlejandra Molina. 2017. For black women, finding work after prison has added challenges. The Press-Enterprise. ↩\nJennifer Hickes Lundquist, Devah Pager, and Eiko Strader. 2018. Does a Criminal Past Predict Worker Performance? Evidence from One of America’s Largest Employers. Social Forces. ↩\nDylan Minor, Nicola Persico, and Deborah M. Weiss. 2017. Criminal Background and Job Performance. Available at SSRN. ↩\nBeth Avery and Phil Hernandez. 2018. https://www.nelp.org/wp-content/uploads/Ban-the-Box-Fair-Chance-State-and-Local-Guide.pdf National Employment Law Project. ↩\nLucius Couloute. 2018. Target agrees to compensate thousands in discriminatory hiring case. Prison Policy Initiative. ↩\nMichelle Natividad Rodriguez and Beth Avery. 2016. Unlicensed & Untapped: Removing Barriers to State Occupational Licenses for People with Records National Employment Law Project. ↩\nThe Federal Bonding Program “provides Fidelity Bonds for ‘at risk,’ hard-to-place job seekers. The bonds cover the first six months of employment at no cost to the job applicant or the employer.” ↩\nThe Work Opportunity Tax Credit (WOTC) “is a Federal tax credit available to employers for hiring individuals from certain target groups [including ‘Ex-Felons’] who have consistently faced significant barriers to employment.” ↩\nThe pervasive use of criminal records to exclude people from the labor market can actually itself result in increased criminal behavior. And research shows that one’s risk of committing a crime declines significantly with age and time since conviction. ↩\nDaniel Munczek Edelman. 2017. Cash for Leaving Prison: A New Solution to Recidivism? Stanford Social Innovation Review. ↩\nBernadette Rabuy and Daniel Kopf. 2015. Prisons of Poverty: Uncovering the pre-incarceration incomes of the imprisoned. Prison Policy Initiative. ↩\nC. Visher, S. Debus, and J. Yahner. October 2008. Unemployment after Prison: A Longitudinal Study of Releasees in Three States.\" Urban Institute Justice Policy Center. ↩\nC. Clark, W. Bales, S. Scaggs, D. Ensley, P. Coltharp, and T. Blomberg. 2015. Assessing the Impact of Post-Release Community Supervision on Post-Release Recidivism and Employment Report submitted to the National Institute of Justice Office of Justice Programs. ↩\nWe could not analyze the trans population because the number of trans-identified people in the survey was too small to use, and doing so posed a risk of respondent identification. ↩\nNot near you?\nInvite us to your city, college or organization."
    }
  ],
  "argos_summary": "The article examines the mental‑health toll of mass incarceration on formerly incarcerated Black men in Philadelphia, drawing on peer‑reviewed research that links imprisonment to higher rates of PTSD, depression, and anxiety. It highlights systemic barriers—such as restrictive probation conditions, employment discrimination, and limited access to housing and health services—that perpetuate trauma and social isolation long after release. The piece underscores the need for trauma‑informed, community‑based interventions and policy reforms to address these health inequities and support successful reentry.",
  "argos_id": "3NBCXZ6E2"
}