{
  "url": "https://www.inc.com/reuters/senator-sanders-says-us-health-secretary-kennedy-must-resign/91234263",
  "authorsByline": "Reuters",
  "articleId": "c228c649adbe4385b6a537680f734782",
  "source": {
    "domain": "inc.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "AZ",
      "county": "Pima County",
      "city": "Tucson",
      "coordinates": {
        "lat": 32.1988848,
        "lon": -110.8218543
      }
    }
  },
  "imageUrl": "https://img-cdn.inc.com/image/upload/f_webp,q_auto,c_fit/vip/2024/05/inc_logo_6a11b5.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-31T18:42:02+00:00",
  "addDate": "2025-08-31T18:54:46.313573+00:00",
  "refreshDate": "2025-08-31T18:54:46.313575+00:00",
  "score": 1.0,
  "title": "Senator Sanders Says US Health Secretary Kennedy Must Resign",
  "description": "Four CDC officials resigned in protest to the firing of Susan Monarez, the director of the Centers for Disease Control and Prevention.",
  "content": "Four CDC officials resigned in protest to the firing of Susan Monarez, the director of the Centers for Disease Control and Prevention.\n\nU.S. Senator Bernie Sanders on Saturday called on Secretary of Health and Human Services Robert F. Kennedy Jr. to resign, days after a senior public health official was fired and four others resigned in disputes over Kennedy’s unorthodox opposition to vaccines.\n\nSanders, an independent senator from Vermont who caucuses with Democrats, wrote in a New York Times guest essay that Kennedy is “endangering the health of the American people now and into the future.” This week, Kennedy ousted the director of the Centers for Disease Control and Prevention, Susan Monarez, less than a month into her tenure, deepening disarray at the nation’s main public health agency. Monarez had refused to adopt new limitations on the availability of some vaccines urged by Kennedy, saying they went against scientific evidence. Four other senior CDC officials resigned in protest, citing anti-vaccine policies and misinformation promoted by Kennedy and his team; hundreds of their colleagues walked out of the CDC’s headquarters in Atlanta in support of the departing leaders.\n\nSanders, the ranking member of the Senate’s health committee and an opponent of Kennedy’s confirmation earlier this year, wrote that Kennedy ousted Monarez because she refused “to act as a rubber stamp for his dangerous policies.” “Despite the overwhelming opposition of the medical community, Secretary Kennedy has continued his longstanding crusade against vaccines and his advocacy of conspiracy theories that have been rejected repeatedly by scientific experts,” Sanders wrote. He said that vaccines for diseases such as polio and Covid-19 had saved hundreds of millions of lives around the world. A spokesperson for Kennedy did not respond to a request for comment.\n\nKennedy, a lawyer and prominent anti-vaccine advocate, ran an unsuccessful campaign for the presidency last year. He espouses healthy eating, natural foods and exercise, but also frequently shares his theories about vaccines and other medical issues that many doctors and scientists say are groundless and drawn from the conspiratorial fringe. On Wednesday, Kennedy baffled doctors when he said he kept seeing children walking through airports that he had diagnosed as “overburdened with mitochondrial challenges, with inflammation,” based on their faces and body movements. President Donald Trump, a Republican, nominated Kennedy to become the health secretary earlier this year and he was sworn in in February. Kennedy emphasized in a congressional hearing in May that he did not think Americans should ever take medical advice from him.",
  "medium": "Article",
  "links": [
    "https://incbestinbusiness.secure-platform.com/bib/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Secretary Kennedy",
      "weight": 0.11183852
    },
    {
      "name": "Kennedy",
      "weight": 0.10676129
    },
    {
      "name": "US Health Secretary Kennedy",
      "weight": 0.1045204
    },
    {
      "name": "Robert F. Kennedy Jr.",
      "weight": 0.09715831
    },
    {
      "name": "anti-vaccine policies",
      "weight": 0.07059329
    },
    {
      "name": "prominent anti-vaccine advocate",
      "weight": 0.06784761
    },
    {
      "name": "Susan Monarez",
      "weight": 0.06721893
    },
    {
      "name": "Senator Sanders",
      "weight": 0.06619226
    },
    {
      "name": "U.S. Senator Bernie Sanders",
      "weight": 0.06544553
    },
    {
      "name": "other medical issues",
      "weight": 0.06411667
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Business"
    },
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.9931640625
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.9541015625
    },
    {
      "name": "/Health/Public Health/Health Policy",
      "score": 0.87158203125
    },
    {
      "name": "/Law & Government/Government/Legislative Branch",
      "score": 0.7734375
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.6865234375
    },
    {
      "name": "/Health/Public Health/Other",
      "score": 0.362060546875
    }
  ],
  "sentiment": {
    "positive": 0.039516125,
    "negative": 0.7898365,
    "neutral": 0.1706474
  },
  "summary": "U.S. Senator Bernie Sanders has called on US Health Secretary Robert F. Kennedy Jr. to resign following the firing of Susan Monarez, the director of the Centers for Disease Control and Prevention. This follows four other CDC officials who resigned in protest over Kennedy's anti-vaccine policies. Sanders argues that Kennedy's actions are jeopardising the health of the American people and that vaccines have saved hundreds of millions of lives worldwide.",
  "shortSummary": "US Senator Bernie Sanders calls for Health Secretary Robert F. Kennedy to resign over his controversial anti-vaccine policies, including firing CDC director Susan Monarez.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "abfa46b610d1452ab0a92e202d1484b7",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://incbestinbusiness.secure-platform.com/bib/",
      "text": "National Recognition\nEarn distinction from Inc. as one of America’s Best in Business and automatically be considered for Inc.’s prestigious Company of the Year award!\ndouble-click to edit, do not edit in source\nThe Inc. Best in Business awards celebrate the projects and initiatives that were true business wins for your company over the past year. Whether it is about a new innovation, a standout marketing campaign, a creative use of AI, or a bold move that paid off, we want to hear your story.\nTell us about a successful project or business win and find your company among the winners that will be featured on Inc.com and in the pages of Inc. magazine. Hundreds of companies will be named to the Best in Business list, with even more recognized in several standout categories.\nNow’s your chance to earn national—and global—recognition for the success you’ve had. Submit your project today and let the world see what makes your company the best in business.\nFor over 40 years, Inc. magazine has been devoted to recognizing America’s most dynamic businesses and honoring the great things they do. This year, hundreds of companies will make the cut and be honored in print and online. Honorees in 2025 will enjoy the following benefits:\nEarn distinction from Inc. as one of America’s Best in Business and automatically be considered for Inc.’s prestigious Company of the Year award!\nBe featured in the Winter issue of Inc. magazine, get a dedicated company profile on Inc.com, and receive national and local media coverage.\nEvery application will be seen and evaluated directly by Inc.’s editors, who will source stories and articles directly from the honorees and applicant pool.\nShow your current employees that all of their long days and nights of hard work are paying off, and improve recruiting opportunities with prospective employees.\nApplying is simple! Fill out the online application, where you will enter a few details about your company and answer three questions about your company’s achievement:\nDescribe a specific project, initiative, or innovation your organization achieved over the past year that is noteworthy.\nExplain how the outcome of this project is a win for your company, leadership team, or industry, and how it sets you apart from your competitors.\nCite some metrics over the past 12 months, directly related to this project, that show positive business outcomes resulting in a win.\nYou will then select which business categories you’d like to apply for—the more categories you apply to, the higher the chances of being recognized. You can see a list of award categories below. That’s it!\nApply Now\nFinal Deadline: September 12\nAll applicants must first apply to the prestigious Best in Business main list—celebrating hundreds of companies for standout projects and initiatives over the past 12 months. Then, boost your chances for recognition by adding any of our exclusive award categories, with multiple winners honored in each.\nCelebrating AI projects and initiatives that have delivered tangible results—whether through increased efficiency, cost savings, improved customer experiences, or new revenue opportunities— by demonstrating clear, measurable wins for the organization.\nCelebrating successful projects or initiatives built without external funding—highlighting the creativity, resilience, and resourcefulness of founders and teams.\nRecognizing the branding, guerrilla marketing, pop-up, experiential, and social media campaigns of upstart companies that have successfully challenged industry leaders and won devoted communities of customers.\nRecognizing successful projects or initiatives that resulted from the partnership of two or more companies.\nHonoring projects or initiatives that have successfully built new communities or deepened engagement within existing ones—fostering connection, participation, and lasting value for their members.\nRecognizing outstanding projects or initiatives from family-owned businesses.\nRecognizing projects or initiatives that successfully attracted investment or were a direct result of investment.\nRecognizing groundbreaking innovations, inventions, or products of all types that have delivered meaningful outcomes, marking them as true wins worth celebrating.\nCelebrating bold brand marketing and other strategies and campaigns that truly moved the needle. Advertising, brand marketing, digital marketing, and performance marketing will be recognized in this category.\nCelebrating projects or initiatives that have made a measurable, positive impact on society, whether by addressing social challenges, advancing equity, improving well-being, or fostering sustainable change in communities.\nHonoring social media campaigns or innovations that have driven significant results, such as increased engagement, brand awareness, audience growth, or business impact.\nGet recognized as one of the top companies in your region, whether you’re leading in the Mid-Atlantic, Midwest, Northeast, Pacific, Rocky Mountain, Southeast, or Southwest.\nWhether you’re a scrappy startup or a powerhouse enterprise, get recognized for achieving excellence at your scale: Small and Mighty (0-49 employees), Medium (50-99 employees), Large (100-499 employees), Extra Large (500+ employees).\nWhether you’re building momentum or leading your market, get recognized for what you’ve accomplished at your revenue level: Lean and Mean (under $5 million in gross revenue), Prosperous and Thriving ($5 million to $50 million in gross revenue), Robust and Powerful ($50 million and up in gross revenue).\nFrom rising stars to legacy leaders, showcase how your company is making its mark at every stage of growth: On the Rise (0-4 years in business), Established Excellence Companies (5-14 years in business), Legacy Companies (15+ years in business).\nHonoring outstanding leaders who have successfully guided a key project or initiative, delivering significant results for their organization through strategic vision, effective execution, and impactful leadership.\nThe early-rate deadline is Friday, July 18, at 11:59 p.m. PT.\nThe preferred-rate deadline is Friday, August 15, at 11:59 p.m. PT.\nThe final deadline to apply is Friday, September 12, at 11:59 p.m. PT.\nAll applicants will be notified via email if they were chosen for the list.\nWe’ll send you a complimentary honoree toolkit to help you promote this incredible honor.\nAll Inc. Best in Business honorees will appear in the Winter issue of Inc. magazine and on Inc.com\nFinal Deadline: September 12\nThe Inc. Best in Business awards are open to all companies—public, private, nonprofit, U.S.-based, and international. Applicants must apply to the Main List to showcase standout work across industries, and may apply to optional additional categories for more visibility.\nInc. editors will review all entries. Honorees will be announced on Inc.com in December 2025 and in the Winter 2025/2026 issue of Inc. magazine. Applicants will be notified by mid-November 2025 whether they have made the list.\nSee your win immortalized in pages of the Winter issue of Inc. magazine, get a dedicated company profile on Inc.com, and receive national and local media coverage.\n2024 List"
    }
  ],
  "argos_summary": "Four senior CDC officials resigned after HHS Secretary Robert F. Kennedy Jr. fired the agency's director, Susan Monarez, over her refusal to endorse his anti‑vaccine policies. Senator Bernie Sanders, who opposed Kennedy’s confirmation, has urged the secretary to step down, citing the endangerment of public health. The resignations and calls for resignation highlight growing turmoil within the CDC amid Kennedy’s controversial stance on vaccines.",
  "argos_id": "4S2CQYVEG"
}