{
  "url": "https://www.engadget.com/deals/get-up-to-77-percent-off-nordvpn-two-year-plans-for-labor-day-151807565.html",
  "authorsByline": "Matt Tate",
  "articleId": "c497b2b4b8a44e6f84035fa3e0427fa4",
  "source": {
    "domain": "engadget.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "San Francisco",
      "city": "San Francisco",
      "coordinates": {
        "lat": 37.7790262,
        "lon": -122.419906
      }
    }
  },
  "imageUrl": "https://s.yimg.com/ny/api/res/1.2/8V.hQ6d3kU2tnb1Cm6yn3A--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://s.yimg.com/os/creatr-uploaded-images/2025-06/2bf9e6e0-4865-11f0-b375-58c089da814d",
  "country": "jp",
  "language": "en",
  "pubDate": "2025-08-31T19:01:26+00:00",
  "addDate": "2025-08-31T19:07:23.580017+00:00",
  "refreshDate": "2025-08-31T19:07:23.580019+00:00",
  "score": 1.0,
  "title": "Get up to 77 percent off NordVPN two-year plans for Labor Day",
  "description": "Nord is also offering three free months as part of the offer.",
  "content": "Engadget has been testing and reviewing consumer tech since 2004. Our stories may include affiliate links; if you buy something through a link, we may earn a commission. Read more about how we evaluate products .\n\nVPN users are overwhelmed with choice, and there are as many bad options out there as there are good ones. Luckily, NordVPN sits in the latter category, and right now Nord is offering discounted plans across its various tiers. If you take out a two-year NordVPN Plus plan (the company's most popular plan) it’ll cost you $108 for the duration of the contract, with Nord throwing in three extra months at no extra cost. That’s 73 percent off the usual rate.\n\nAs well as Nord’s VPN service, a Plus plan also includes the Threat Protection Pro anti-malware tool, password management and an ad- and tracker-blocker. A Prime plan additionally comes with encrypted cloud storage or NordProtect, which insures you against identity theft and monitors dark web activity. That's also on sale — down to $189 on the same two-year commitment with those three additional months thrown in, which works out to a 77 percent savings on the regular price.\n\nWhen Engadget’s Sam Chapman reviewed NordVPN earlier this year, he praised its excellent download speeds, exclusive features and extensive server network. Less impressive is its clunky interface and inconsistent design when jumping between different platforms running a NordVPN app. While it doesn't quite make the cut in our guide to the best VPNs available right now, it generally performed well in speed tests and Threat Protection Pro is really worth having.\n\nFollow @EngadgetDeals on X for the latest tech deals and buying advice.",
  "medium": "Article",
  "links": [
    "https://www.engadget.com/cybersecurity/vpn/nordvpn-review-2025-innovative-features-a-few-missteps-163000578.html",
    "https://shopping.yahoo.com/rdlw?merchantId=c52a3d27-2d9a-44d8-8cf2-6f6387b122a0&siteId=us-engadget&pageId=pnr-product-module&contentUuid=0069d326-45b9-43cf-9dfd-1b9decf5fc9a&featureId=manual-entry&itemName=NordVPN+Plus&merchantName=NordVPN&custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsImxhbmRpbmdVcmwiOiJodHRwczovL25vcmR2cG4uY29tL3ByaWNpbmcvIiwiY29udGVudFV1aWQiOiIwMDY5ZDMyNi00NWI5LTQzY2YtOWRmZC0xYjlkZWNmNWZjOWEiLCJvcmlnaW5hbFVybCI6Imh0dHBzOi8vbm9yZHZwbi5jb20vcHJpY2luZy8ifQ&signature=AQAAAaVM0v5b5iPZc7x5Rcgc-ebmyr7sBiVAGPauCrl93EOx&gcReferrer=https%3A%2F%2Fnordvpn.com%2Fpricing%2F",
    "https://shopping.yahoo.com/rdlw?merchantId=c52a3d27-2d9a-44d8-8cf2-6f6387b122a0&siteId=us-engadget&pageId=1p-autolink&contentUuid=0069d326-45b9-43cf-9dfd-1b9decf5fc9a&featureId=text-link&merchantName=NordVPN&linkText=Prime+plan&custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsImxhbmRpbmdVcmwiOiJodHRwczovL25vcmR2cG4uY29tL3ByaWNpbmcvIiwiY29udGVudFV1aWQiOiIwMDY5ZDMyNi00NWI5LTQzY2YtOWRmZC0xYjlkZWNmNWZjOWEiLCJvcmlnaW5hbFVybCI6Imh0dHBzOi8vbm9yZHZwbi5jb20vcHJpY2luZy8ifQ&signature=AQAAAaVM0v5b5iPZc7x5Rcgc-ebmyr7sBiVAGPauCrl93EOx&gcReferrer=https%3A%2F%2Fnordvpn.com%2Fpricing%2F",
    "https://www.engadget.com/deals/",
    "https://shopping.yahoo.com/rdlw?merchantId=c52a3d27-2d9a-44d8-8cf2-6f6387b122a0&siteId=us-engadget&pageId=1p-autolink&contentUuid=0069d326-45b9-43cf-9dfd-1b9decf5fc9a&featureId=text-link&merchantName=NordVPN&linkText=NordVPN+Plus+plan&custData=eyJzb3VyY2VOYW1lIjoiV2ViLURlc2t0b3AtVmVyaXpvbiIsImxhbmRpbmdVcmwiOiJodHRwczovL25vcmR2cG4uY29tL3ByaWNpbmcvIiwiY29udGVudFV1aWQiOiIwMDY5ZDMyNi00NWI5LTQzY2YtOWRmZC0xYjlkZWNmNWZjOWEiLCJvcmlnaW5hbFVybCI6Imh0dHBzOi8vbm9yZHZwbi5jb20vcHJpY2luZy8ifQ&signature=AQAAAaVM0v5b5iPZc7x5Rcgc-ebmyr7sBiVAGPauCrl93EOx&gcReferrer=https%3A%2F%2Fnordvpn.com%2Fpricing%2F",
    "https://www.engadget.com/cybersecurity/vpn/best-vpn-130004396.html",
    "https://twitter.com/EngadgetDeals",
    "https://www.engadget.com/best-tech/"
  ],
  "labels": [
    {
      "name": "Paid News"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "discounted plans",
      "weight": 0.09080295
    },
    {
      "name": "NordVPN Plus",
      "weight": 0.087187365
    },
    {
      "name": "Threat Protection Pro",
      "weight": 0.085579455
    },
    {
      "name": "NordVPN",
      "weight": 0.07749738
    },
    {
      "name": "speed tests",
      "weight": 0.068579204
    },
    {
      "name": "encrypted cloud storage",
      "weight": 0.067010276
    },
    {
      "name": "affiliate links",
      "weight": 0.065621294
    },
    {
      "name": "consumer tech",
      "weight": 0.06499482
    },
    {
      "name": "the Threat Protection Pro anti-malware tool",
      "weight": 0.06415156
    },
    {
      "name": "good ones",
      "weight": 0.063725
    }
  ],
  "topics": [
    {
      "name": "Shopping"
    },
    {
      "name": "Labor Day"
    },
    {
      "name": "Holidays"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Shopping/Consumer Resources/Product Reviews & Price Comparisons",
      "score": 0.462890625
    }
  ],
  "sentiment": {
    "positive": 0.4452266,
    "negative": 0.1130115,
    "neutral": 0.44176182
  },
  "summary": "NordVPN is offering discounted plans across its various tiers for the holiday period. The most expensive one, the Plus, will cost $108 for the duration of the contract, with three months of additional service being provided. The Plus plan also includes an anti-malware tool, password management and an ad- and tracker-blocker. The Prime plan costs $189, a 77 percent reduction from the regular price.",
  "shortSummary": "NordVPN is offering discounts of up to 77% on various tiers, including Plus, with enhanced security, and a comprehensive website.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "42a1c9cc410146edabd0a9ea2bf83c96",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.engadget.com/cybersecurity/vpn/best-vpn-130004396.html",
      "text": "Engadget has been testing and reviewing consumer tech since 2004. Our stories may include affiliate links; if you buy something through a link, we may earn a commission. Read more about how we evaluate products.\nThe best VPN service for 2025\nThese are the best virtual private networks out there, as reviewed and tested by experts.\nVirtual private networks (VPNs) are notoriously difficult to work with. Maybe you’re a remote worker who has to sign in to one each day to access company services, or you tried it once because you heard you could use it to access international content, but were met with laggy service and frequent disruptions. Today’s VPNs don’t have to come with those headaches. We tested nine of the best VPN services available now to come up with our top picks, and lay out what you should know before paying for one.\nWe tested nine of the most popular VPN services available now to come up with our top picks, and lay out what you should know before paying for one. Our top pick remains ProtonVPN thanks to its easy-to-use interface, no-logs policy and open-source framework, while other popular options like NordVPN didn't quite make the cut. While we think ProtonVPN is the best VPN for most people, we lay out other good options you can consider, too.\nEditor's note (5/30/25): We're in the process of revamping our VPN coverage to provide more in-depth, actionable information and buying guides. Our recommendations, and all the info on this page, are subject to change as the update continues. Check out our revamped ExpressVPN review to see the new direction, or learn more about how we test VPNs.\nTable of contents\nBest VPNs for 2025\nSimultaneous connections: 10 | Number of devices: 10 | Platforms: Windows, Mac, Android, iOS, and Linux | Browser extensions: Chrome, Firefox | Dedicated IP addresses: Yes, for business users only | Trial/Money-back guarantee: None/30-day money-back guarantee\nRead our full ProtonVPN review\nThe VPNs we tried out ranked pretty consistently across all of our tests, but ProtonVPN stood out as a strong option because of its overall security, usability and privacy features. The Proton Technologies suite of services includes mail, calendar, drive and a VPN known for its end-to-end encryption. This makes it a strong contender for overall security, but its VPN specifically came across as a well-rounded independent service.\nProtonVPN’s no-logs policy has passed audits, and the company has proven not to comply with law enforcement requests. Because it is based in Switzerland, there are no forced logging obligations, according to the company, making it a secure VPN option. Plus, it’s based on an open-source framework, and has an official vulnerability disclosure program along with clear definitions on what it does with personal information.\nWhile ProtonVPN offers a free version, it’s limited compared to other options, with access to server networks in just three countries. Its paid version normally starts at around $5.39 per month, and includes access to VPN server locations in more than 65 countries on 10 devices at a time. While we wouldn't consider it a cheap VPN, it's a relatively affordable price for basic protection. For dedicated Proton Technologies users, they can pay closer to $8.63 for a monthly plan to access the entire suite.\nProtonVPN passed our geoblock, streaming and gaming tests with only a very small toll on connection speeds. It also comes with malware-, ad- and tracker-blocking as an additional service, plus it has a kill switch feature on macOS, Windows, Linux, iOS and the latest version of Android. It’s available on most major operating systems, routers, TV services and more including Firefox, Linux and Android TV. For dedicated Linux users, ProtonVPN added a new Linux-specific app to support its services in August.\n- Easy to use\n- No-logs policy\n- Based on open-source framework\n- Kill switch feature on macOS, Windows, Linux, iOS and Android\n- Free version is limited\nSimultaneous connections: Unlimited | Number of devices: Unlimited | Platforms: Windows, Mac, Android, iOS, and Linux | Browser extensions: Chrome, Firefox | Dedicated IP addresses: No | Trial/Money-back guarantee: None/None\nBy signing up for Windscribe's free plan with your email, users can access 10GB per month of data, unlimited connections and access to more than 10 countries. We selected it as the best free VPN because of its high security and wide range of server locations compared to other free VPNs. It has over 500 servers in over 60 countries, according to the company, and can be configured to routers, smart TVs and more on top of the usual operating systems.\nWindscribe doesn’t have a recent independent security audit, but it does publish a transparency report showing that it has complied with zero requests for its data, runs a vulnerability disclosure program encouraging researchers to report flaws and offers multiple protocols for users to connect with.\nOn top of that, it’s easy to use. The set up is intuitive and it passed our geoblock, streaming and gaming tests. The paid version costs $5.75 to $9 each month, depending on the plan you choose, and includes unlimited data, access to all servers and an ad/tracker/malware blocker. Or, for $1 per location per month, users can build a plan tailored to the VPNs they want to access. Windscribe is still expanding its reach, adding Japan to its list of available spots.\n- 10GB of data per month with free version\n- Unlimited connections with free plan\n- Wide range of server locations\n- Easy to use\n- Does not offer dedicated IP addresses\nSimultaneous connections: 8 | Number of devices: 8 | Platforms: Windows, Mac, Android, iOS, and Linux | Browser extensions: Chrome, Firefox | Dedicated IP addresses: No | Trial/Money-back guarantee: 3 free months/30-day money-back guarantee\nRead our full Express VPN review\nWe picked the best VPN service for travel, gaming and streaming based on which one had access to the most locations with fast connections and no lag. ExpressVPN met all those criteria and was one of the most premium VPNs we tried, not to mention one of the fastest VPNs, too. Now, it even comes with an in-house password manager, ExpressVPN Keys, to manage and autofill logins across sites included with the subscription. That will make it easier to toggle between streaming and gaming accounts while browsing securely.\nAn internet speed test measured faster upload and download speed compared to using no VPN, practically unheard of compared to the other VPNs tested. But being this fast is likely a fluke due to the VPN service circumventing traffic shaping by the ISP or another disparity because even top VPNs will in some way slow down speeds. With 2,000 servers in 160 cities, according to the company, it had one of the broadest global reaches. It also passed our geoblock, streaming and gaming tests, and it does regular security audits. Plus, Network Lock is its kill switch feature, which keeps your data safe even if you lose connection to the VPN. Subscription costs range from $8.32 to $12.95 per month depending on the term of the plan, and include a password manager.\nWith ExpressVPN, users can connect to up to five devices at once, which is on the lower side compared to other services. That said, it works on a bunch of devices from smart TVs to game consoles, unlike some other services that lack support beyond the usual suspects like smartphones and laptops.\n- High speed connections with no lag in many locations\n- Supports Network Lock kill switch feature\n- Works on a variety of devices like smart TVs and game consoles\n- On the expensive side\nSimultaneous connections: 7 | Number of devices: 7 | Platforms: Windows, Mac, Android, iOS, and Linux | Browser extensions: Chrome, Firefox | Dedicated IP addresses: Yes, additional purchase required | Trial/Money-back guarantee: 2 free months/45-day money-back guarantee\nBecause several of the best VPN services connect to routers, cross-platform accessibility isn’t always necessary. By connecting a VPN to your home router, you can actually connect to unlimited devices in your household, as long as they all access the internet through that router.\nBut if you use VPNs on the go, and across several devices, being able to connect to a wide range of platforms will be indispensable. CyberGhost offers simultaneous connectivity on up to seven devices for $2.11 to $12.99 per month depending on subscription term. It supports several types of gadgets like routers, computers, smart TVs and more. It’s similar to the support that ExpressVPN offers, but CyberGhost provides detailed instructions on how to set up the cross-platform connections, making it a bit more user-friendly for those purposes. Plus, it just expanded its network of servers from 91 to 100 countries, adding Bolivia, Ecuador, Peru, Uruguay, Laos, Myanmar, Nepal, Guatemala and the Dominican Republic to its available locations.\nFrom a security perspective, CyberGhost completed an independent security audit by Deloitte earlier this year, runs a vulnerability disclosure program and provides access to a transparency report explaining requests for its data. An updated version of its transparency report went live in August. While it did pass all of our tests, it’s worth noting that we had trouble connecting to servers in the United Kingdom and had to opt to run our gaming test through an Ireland-based server instead.\n- Works well across different kinds of devices/platforms\n- Provides detailed instructions for setting service up on different devices\n- Dedicated IP addresses come at an additional cost\nSimultaneous connections: Unlimited | Number of devices: Unlimited | Platforms: Windows, Mac, Android, iOS, and Linux | Browser extensions: Chrome, Firefox, Edge | Dedicated IP addresses: Yes, additional purchase required | Trial/Money-back guarantee: 1 free month/30-day money-back guarantee\nRead our full Surfshark VPN review\nAs we mentioned before, connecting to a router can provide nearly unlimited access to devices in a single household. But Surfshark VPN is one of few VPN services that offer use on an unlimited number of devices without bandwidth restrictions, according to the company. And you get that convenience without a significant increase in price: Surfshark subscriptions cost about $2.49 to $12.95 for a monthly subscription, and the company recently conducted its first independent audit. It added QR-code-enabled login across devices and expanded support for alternative ID profiles since our initial review, a feature that some of its competitors already had.\nWe ran into some trouble connecting to Surfshark’s WireGuard protocol, but tested on an IKEv2 protocol instead. The VPN speed was a bit slow and struggled to connect for our geoblock test at first, but ultimately passed. What makes it different from other VPNs with unlimited connection options is that it has access to a larger number of servers and is available on more types of devices.\n- Unlimited simultaneous connections\n- Large number of servers available\n- On the expensive side\n- Slower speeds than the competition\nWhat is a VPN?\nVPNs, or virtual private networks, mask your IP address and the identity of your computer or mobile device on the network and creating an encrypted \"tunnel\" that prevents your internet service provider (ISP) from accessing data about your browsing history. VPNs are not a one-size-fits-all security solution, though.\nInstead, they’re just one part of keeping your data private and secure. Roya Ensafi, assistant professor of computer science and engineering at the University of Michigan, told Engadget that VPNs don’t protect against common threats like phishing attacks, nor do they protect your data from being stolen. Much of the data or information is stored with the VPN provider instead of your ISP, which means that using a poorly designed or unprotected network can still undermine your security. But they do come in handy for online privacy when you’re connecting to an untrusted network somewhere public because they tunnel and encrypt your traffic to the next hop.\nThat means sweeping claims that seem promising, like military-grade encryption or total digital invisibility, may not be totally accurate. Instead, Yael Grauer, program manager of Consumer Reports’ online security guide, recommends looking for security features like open-source software with reproducible builds, up-to-date support for industry-standard protocols like WireGuard (CR's preferred protocol) or IPsec, and the ability to defend against attack vectors like brute force.\nRead more:\nUnderstanding VPNs and your needs\nBefore considering a VPN, make sure your online security is up to date in other ways. That means complex passwords, multi-factor authentication methods and locking down your data sharing preferences. Even then, you probably don’t need to be using a VPN all the time.\n“If you're just worried about somebody sitting there passively and looking at your data then a VPN is great,” Jed Crandall, an associate professor at Arizona State University, told Engadget.\nThat brings us to some of the most common uses cases for VPNs. If you use public WiFi networks a lot, like while working at a coffee shop, then VPN usage can help give you private internet access. They’re also helpful for hiding information from other people on your ISP if you don’t want members of your household to know what you’re up to online.\nGeoblocking has also become a popular use case as it helps you reach services in other parts of the world. For example, you can access shows that are only available on streaming services, like Netflix, Hulu or Amazon Prime, in other countries, or play online games with people located all over the globe.\nThere are also a few common VPN features that you should consider before deciding if you want to use one, and which is best for you:\nWhat is split tunneling?\nSplit tunneling allows you to route some traffic through your VPN, while other traffic has direct access to the internet. This can come in handy when you want to protect certain activity online without losing access to local network devices, or services that work best with location sharing enabled.\nWhat is a double VPN?\nA double VPN, otherwise known as multi-hop VPN or a VPN chain, passes your online activity through two different VPN servers one right after the other. For VPN services that support this, users are typically able to choose which two servers they want their traffic to pass through. As you might expect, this provides an extra layer of security.\nAre VPNs worth it?\nWhether or not VPNs are worth it depends how often you could use it for the above use cases. If you travel a lot and rely on public WiFi or hotspots, are looking to browse outside of your home country or want to keep your traffic hidden from your ISP, then investing in a VPN will be useful. But, keep in mind that even the best VPN services often slow down your internet connection speed, so they may not be ideal all the time.\nIn today's world, we recommend not relying on a VPN connection as your main cybersecurity tool. VPN use can provide a false sense of security, leaving you vulnerable to attack. Plus, if you choose just any VPN, it may not be as secure as just relying on your ISP. That’s because the VPN could be based in a country with weaker data privacy regulation, obligated to hand information over to law enforcement or linked to weak user data protection policies.\nFor VPN users working in professions like activism or journalism that want to really strengthen their internet security, options like the Tor browser may be a worthwhile alternative, according to Crandall. Tor is free, and while it's less user-friendly, it’s built for anonymity and privacy.\nHow we tested VPNs\nTo test the security specs of different VPNs and name our top picks, we relied on pre-existing academic work through Consumer Reports, VPNalyzer and other sources. We referenced privacy policies, transparency reports and security audits made available to the public. We also considered past security incidents like data breaches.\nWe looked at price, usage limits, effects on internet speed, possible use cases, ease of use, general functionality and additional “extra” VPN features like multihop. The VPNs were tested across iOS, Android and Mac devices so we could see the state of the mobile apps across various platforms (Windows devices are also supported in most cases). We used the “quick connect” feature on the VPN apps to connect to the “fastest” provider available when testing internet speed, access to IP address data and DNS and WebRTC leaks or when a fault in the encrypted tunnel reveals requests to an ISP.\nOtherwise, we conducted a test of geoblocking content by accessing Canada-exclusive Netflix releases, a streaming test by watching a news livestream on YouTube via a Hong Kong-based VPN and a gaming test by playing on servers in the United Kingdom. By performing these tests at the same time, it also allowed us to test claims about simultaneous device use. Here are the VPN services we tested:\nRead more: The best password managers for 2023\nOther VPN services our experts tested\nNordVPN\nNordVPN didn’t quite make the cut because it’s overhyped, and underwhelming. As I've written in our full review of NordVPN, the pricing, up to $14.49 for a “complete” subscription, seemed high compared to other services, and its free or lower cost plans just didn’t have the same wide variety of features as its competitors.\nTunnelBear\nDespite the cute graphics and user friendliness, TunnelBear wasn’t a top choice. It failed numerous basic security tests from Consumer Reports, and had limited availability across platforms like Linux. It did, however, get a major security boost in July when it updated to support WireGuard protocol across more of its platforms.\nBitdefender VPN\nBitdefender doesn’t offer support for devices like routers, which limits its cross-platform accessibility. It also lacked a transparency report or third-party audit to confirm security specs.\nAtlas VPN\nAtlas ranked lower on our speed tests compared to the other VPNs tested, with a notably slower difference on web browsing and streaming tests. It was a good option otherwise, but could easily cause headaches for those chasing high speed connections. Security-wise, an Atlas VPN vulnerability leaked Linux users’ real IP addresses.\nVPN FAQs\nWhat are some things VPNs are used for?\nVPNs are traditionally used to protect your internet traffic. If you’re connected to an untrusted network like public WiFi in a cafe, using a VPN hides what you do from the internet service provider. Then, the owner of the WiFi or hackers trying to get into the system can’t see the identity of your computer or your browsing history.\nA common non-textbook use case for VPNs has been accessing geographically restricted content. VPNs can mask your location, so even if you’re based in the United States, they can make it appear as if you’re browsing abroad and unblock access. This is especially useful for streaming content that’s often limited to certain countries, like if you want to watch Canadian Netflix from the US.\nWhat information does a VPN hide?\nA VPN doesn’t hide all of your data. It only hides information like your IP address, location and browser history. A common misconception is that VPNs can make you totally invisible online. But keep in mind that the VPN provider often still has access to all of this information, so it doesn’t grant you total anonymity. You’re also still vulnerable to phishing attacks, hacking and other cyberthreats that you should be mindful of by implementing strong passwords and multi-factor authentication.\nAre VPNs safe?\nGenerally, yes. VPNs are a safe and reliable way to encrypt and protect your internet data. But like most online services, the safety specifics vary from provider to provider. You can use resources like third-party audits, Consumer Reports reviews, transparency reports and privacy policies to understand the specifics of your chosen provider.\nCan you get a VPN on your phone?\nYes, you can use a VPN on your phone. Most major VPN services have mobile apps you can install on iPhones and Android devices so you can connect on your phone to protect your mobile browsing.\nWhat about Google’s One VPN?\nGoogle One subscriptions include access to the company’s VPN, which works similarly to other VPNs on our list, hiding your online activity from network operators. However, Google announced recently that it plans to shut down the One VPN because \"people simply weren’t using it.\" There's no specific date for the shutdown, with Google simply saying it will discontinue the service sometime in 2024. Pixel phone owners, however, will continue to have access to the free VPN available on their devices.\nRecent updates\nApril 2025: Updated for timeliness and to ensure our top picks are still current.\nOctober 2024: Added a \"read more\" section with links to additional VPN content.\nJune 2024: Updated to include table of contents."
    },
    {
      "url": "https://www.engadget.com/cybersecurity/vpn/nordvpn-review-2025-innovative-features-a-few-missteps-163000578.html",
      "text": "Engadget has been testing and reviewing consumer tech since 2004. Our stories may include affiliate links; if you buy something through a link, we may earn a commission. Read more about how we evaluate products.\nNordVPN review 2025: Innovative features, a few missteps\nNordVPN is as fast as it claims, but its apps sometimes get in their own way.\nWhen we say that NordVPN is a good VPN that's not quite great, it's important to put that in perspective. Building a good VPN is hard, as evidenced by all the shovelware VPNs flooding the market. NordVPN may not be perfect, but it's easily top-five caliber and excels in certain use cases.\nFirst, the bad: NordVPN's apps could all stand to undergo a little more quality control, with elements distracting from other elements and inconsistent designs from platform to platform. At least one of its FAQ pages directly contradicts itself. And while all the server locations could unblock Netflix, the one in Nigeria still showed U.S. content, indicating that our real location might have leaked.\nHowever, there's a lot of good to balance that out. Speeds are fantastic and we saw no other hint of any kind of leak. Its server network is expansive and not overly reliant on virtual locations. The vast majority of servers are ideal for unblocking foreign websites. The real draw, though, is the extra features, including the innovative and flexible Meshnet, plus a malware blocker that acts more like a full antivirus and forward-looking quantum resistant encryption.\nEditors' note: We're in the process of revamping our VPN coverage to provide more in-depth, actionable information and buying guides. Our recommendations, and all the info on this page, are subject to change as the update continues. To see the new direction, check out our revamped ExpressVPN review and Proton VPN review, or learn more about how we test VPNs.\nNordVPN is a fast service with a powerful content scanner and built-in file transfer features.\n- Excellent download speeds\n- Useful exclusive features\n- Extensive server network\n- Clunky interface choices\n- Collects device info by default\nTable of contents\nFindings at a glance\nCheck out a summary of our NordVPN review in the table below.\nCategory | Notes |\nInstallation and UI | Connections happen quickly and features are easy to use on all platforms UI sometimes gets in the way; map screens can be clunky and apps come with unnecessary notifications Surprisingly, the best UI may be in the browser extension |\nSpeed | Extremely fast download speeds with only a 6.4-percent average drop Good latencies on nearby servers, but farther ones have some lag Fast upload speeds, but losses spiked in a few locations |\nSecurity | Uses acceptable protocols with uncracked encryption NordWhisper obfuscated protocol recently implemented on Windows, Android and Linux No DNS, WebRTC or IPv6 leaks on five test servers |\nPricing | Best plan is the 2-year Basic for $81.36, or $3.39 per month Basic gives you the complete VPN If you get a multi-year plan, be sure to manually renew in order to keep the promotional rates |\nBundles | Plus tier adds advanced malware protection and NordPass password manager Complete plan adds NordLocker cloud storage Prime tier adds ID theft protection and insurance features |\nPrivacy policy | NordVPN does not log user activity on the VPN, a policy backed up by several third-party audits However, it does log potentially identifiable device information unless you opt out in settings Some concerning liberties taken in the overall Nord policy, but no documented malfeasance |\nVirtual location change | Four out of five test servers unblocked Netflix three times running, including virtual India location Location in Nigeria got into Netflix, but didn't change available titles |\nServer network | 153 server locations in 117 countries and territories Server network is about 40 percent virtual, including all locations in Africa |\nFeatures | Extra servers grant additional privacy (double VPN, Onion over VPN, obfuscation) or specific optimizations (P2P, dedicated IP) Meshnet directly connects two devices without a NordVPN server mediating Threat Protection blocks dangerous domains and the Pro upgrade has some antivirus capability Dark Web Monitor reports to you when any sensitive information has appeared on clandestine leak sites Presets let you activate several settings with one clickPost-quantum encryption is nice, but not necessary yet Kill switch is a useful safety feature on all appsSplit tunneling by app on Windows and Android, and by URL on browser extensions |\nCustomer support | Written FAQs, live chat and email support Live chat connected to an expert human within a minute FAQs are poorly organized and contain some conflicts, but well-written on average |\nBackground check | NordVPN is headquartered in Panama, while its parent company Nord Security is based in the Netherlands 2018 theft of public keys was a mistake, but NordVPN did almost everything right in response Claims of law enforcement collaboration are overblown — NordVPN will comply with requests, but that doesn't mean they'll have information to provide |\nInstalling, configuring and using NordVPN\nNordVPN's biggest strengths are its speeds and the range of options it puts at your fingertips. User experience is important, but it's not quite as front-and-center as it is with ExpressVPN and Proton VPN. Here's how the apps run on all the major platforms.\nWindows\nThe Windows app is the first instance of NordVPN's UI being not bad enough to complain about, but not good enough to be considered excellent. The initial connection process is a little slow, and it's far easier to connect than it is to disconnect (click the power button while connected to shut the VPN off). The map takes up space that would have been better allocated to the server list.\nThe minor problems continue in the settings list, which makes the mistake of not keeping all its tabs visible in the window — if you open one, you have to click back to the main menu to reach another page. The pages themselves are easy to use; it's just a bit clunkier than it could have been.\nMac\nSetup is swift and easy on Mac, but the full NordVPN interface is a little awkward. The vast majority of the main window is taken up by a large map, which is mostly useless. There's no way to zoom out to see the whole world, and you can't choose between servers in each country unless you zoom way in. The server list on the left-hand side is almost always more useful.\nThe preferences panel is better. All the tabs come with clear explanations of their function, and are laid out so the menu is always visible, unlike the Windows app. The gear icon at the bottom includes its own set of tabs that encompass most of the common functions, including changing your VPN protocol, activating the kill switch and setting the VPN to automatically connect on untrusted networks.\nAndroid\nNordVPN on mobile can be described in much the same way as its desktop apps: generally great, occasionally getting in its own way. On Android, the map screen is much more helpful. It's expandable to the entire world and allows you to choose between servers within a country. On the other hand, the important settings are buried in the Profile tab, and the app notifies you about your \"security score\" to pressure you into activating certain settings.\nTo find the general settings page on Android, tap the bottom-right Profile tab and scroll down. Except for Threat Protection, which has its own tab on the main window, every feature is located here. It's probably necessary to keep the main app from getting cluttered, but still mildly frustrating.\niOS\nThe NordVPN iOS app resembles a compressed version of the macOS client, for better or worse. As with Android, most of its features are in the bottom-right Profile tab. It works well most of the time, but often feels slightly cumbersome. There's a bit too much on the screen, and a bit too much of the stuff has nothing to do with the VPN's core function.\nAs an example, you can't log into your account within the app — you have to load your Nord account page in a web browser. Forced app switching is a design choice that truly needs to die. That said, VPN connections happen quickly. If you tend to simply leave your VPN active, you probably won't notice any of this stuff.\nBrowser extensions\nMost VPN browser extensions consist of the same features on a smaller scale, and NordVPN's — on Chrome, Firefox and Edge — are no exception. They are important for one reason, though: they're the only way to split tunnels by URL and the only split tunneling at all on macOS and iOS. Despite being more compact, they're also easy to use, making for an excellent quick-start VPN solution.\nNordVPN speed test\nAll VPNs slow down your average browsing speeds by adding extra steps into the connection process. When we test speed, we're looking for the VPN to drag as little as possible on your unprotected speeds. Download speed will be the most important stat for most users, since that determines how fast web pages load and how quickly videos can buffer.\nLatency is important for live connections like video chats, games and live streaming. Latency increases with distance — in the test below, data packets were sent to the remote server, then back to our home network. Upload speeds likewise influence your live two-way communications and are also vital for torrenting. Let's see how NordVPN performs on all three metrics.\nServer location | Latency (ms) | Increase factor | Download speed (Mbps) | Percentage drop | Upload speed (Mbps) | Percentage drop |\nUnprotected (Portland, OR, USA) | 22 | -- | 59.20 | -- | 5.86 | -- |\nSeattle, WA, USA (Fastest) | 44 | 2x | 57.21 | 3.4 | 5.62 | 4.1 |\nNew York, NY, USA | 177 | 8x | 56.90 | 3.9 | 5.60 | 4.4 |\nStockholm, Sweden | 371 | 16.9x | 55.94 | 5.5 | 5.63 | 3.9 |\nIstanbul, Turkey | 411 | 18.7x | 53.02 | 10.4 | 5.78 | 5.9 |\nHong Kong | 350 | 15.9x | 56.18 | 5.1 | 5.72 | 2.4 |\nJohannesburg, South Africa | 602 | 27.4x | 53.26 | 10.0 | 5.67 | 3.3 |\nAverage | 326 | 14.8x | 55.42 | 6.4 | 5.54 | 4.0 |\nTo summarize: NordVPN's download speeds are the fastest we've seen and its upload speeds and latency tie with the best. Downloads only dropped by an average of 6.4 percent across the globe and readings were mostly consistent — the servers in question performed much the same in each test. We even threw in Turkey and South Africa, two locations that commonly cause problems, but NordVPN still kept the drop to 10 percent.\nLatency is more a product of physical distance than VPN infrastructure, but you can still see differences between services. When tested on a similar range of locations, ExpressVPN and Proton VPN both kept average latencies under 300 ms. NordVPN's average came out to 326 milliseconds, though we should note that its latency increased less than Proton's on the closest server.\nUpload speeds declined an average of four percent, but there were a few anomalously high readings in Istanbul that skewed those numbers up. Without that location, NordVPN's upload rates would also have been the industry's current best.\nNordVPN security test\nNo matter how well-built a VPN looks from the outside, there are several ways its security can fail. The most common problems are outdated protocols with weak encryption, failing to block IPv6 traffic or inadvertent leaks from sending DNS requests outside the encrypted tunnel. We'll start by looking for those common leak sources, then check whether NordVPN's encryption might be failing in less traceable ways.\nVPN protocols\nA VPN protocol is a set of rules used to get data quickly and safely from your device to a VPN server and back, even while that data is encrypted. Different protocols are connected with different encryption algorithms and can impact the speed, security and stability of your connection.\nWhen testing VPN security, the first step is to see if it's using any protocols like PPTP that are outdated and crackable, or homebrewed protocols with unclear security. NordVPN users have four options for protocols: OpenVPN, IKEv2 (not available on Mac or iOS), NordLynx and NordWhisper (available on Windows, Android and Linux only).\nOpenVPN and IKEv2 are both standard protocols you'll find on most VPN providers. Both use various strengths of the Advanced Encryption Standard (AES), with OpenVPN defaulting to AES-256 and IKEv2 to AES-128. OpenVPN can be set to UDP (faster but less stable) or TCP (more reliable but slower). So far, so secure.\nNordLynx is unique to NordVPN, but it's not that far off the beaten track — it's just WireGuard with extra security. WireGuard normally works by saving a stable IP address for each connection, which raises the very slight risk of exposing a user. NordLynx adds a second layer of abstraction that means those stable addresses are never revealed. Since NordVPN strongly recommends it for most situations, we used it for all our tests in this review.\nFinally, there's NordWhisper, a new protocol introduced in early 2025 that disguises your VPN traffic as normal web traffic to evade blanket web blocks. It's likely to be slower than the other protocols, so don't use it unless everything else has been blocked. We also don't recommend counting on it too much in general — large-scale censorship technology, like the Great Firewall of China, tends to rely on blocklists of known VPN servers, whose identity NordWhisper can't disguise.\nLeak test\nOur first order of business was to check five test servers to see if they leaked our real IP address — staying away from the ones in the speed test in order to get as comprehensive a picture of NordVPN's security as possible. With help from ipleak.net, we found all five to be free of the three major types of leaks.\nDNS leaks occur when a VPN sends DNS requests (in short, how your browser knows which websites to show you) outside its encrypted tunnel. By default, NordVPN uses its own private DNS servers, which our tests showed to effectively prevent leaks.\nWebRTC leaks are caused by real-time communication protocols sending information outside the VPN, which may reveal your real IP address. NordVPN is consistently successful at keeping WebRTC inside the tunnel, but you can have your browser block it if you're still worried.\nIPv6 leaks happen when a VPN only blocks IPv4 traffic and lets v6 through. NordVPN automatically blocks IPv6 traffic while it's active, so an IPv6 leak is all but impossible.\nAlthough that's all great news, it is still possible for leaks to occur without a clear explanation, so we ran one final test on NordVPN.\nEncryption test\nWireshark is a program that captures detailed images of information sent over a device's internet connection. Even though our tests showed NordVPN to be free of leaks, we wanted to inspect it at the most granular level. Using WireShark, we recorded the traffic sent to an unencrypted HTTP site, before and after connecting to each NordVPN test server.\nEvery server showed the same pattern: readable plaintext before, encrypted ciphertext after. If there is a security flaw remaining in NordVPN, it's unlikely to be relevant to the overwhelming majority of users.\nHow much does NordVPN cost?\nNordVPN's pricing structure looks convoluted at first, but it's much simpler than it appears. A Basic subscription gets you full VPN functionality, and all the other tiers just add more features. If all you need is a VPN, you only need to concern yourself with the left side of the table below.\nThe best deal for a Basic NordVPN subscription, which lets you connect to NordVPN with up to 10 devices at once, costs $81.36 for two years when you pay upfront ($3.39 per month). One year of the same plan costs $59.88 in advance ($4.99 per month) or $12.99 for one month at a time. The table below shows the complete cost; for more information on plans above Basic, see \"side apps and bundles\" in the next section.\nPlan | 1-month cost | 1-year cost | 2-year cost |\nBasic | $12.99 | $59.88 ($4.99/month) | $81.36 ($3.39/month) |\nPlus | $13.99 | $71.88 ($5.99/month) | $105.36 ($4.39/month) |\nComplete | $14.99 | $83.88 ($6.99/month) | $129.36 ($5.39/month) |\nPrime | $17.99 | $107.88 ($8.99/month) | $177.36 ($7.39/month) |\nThe longer plans save money, but be careful: if you let them expire, you'll automatically renew at the more expensive one-year plan. Enough customers claim to have been auto-renewed at the higher rate that they've launched a class-action lawsuit against NordVPN, accusing the company of deceptive pricing practices and making renewals too difficult to cancel. A NordVPN PR rep said they could not comment on ongoing legal action, \"other than to state that we are and always have been very clear about the recurring nature of our services.\" No court date has been set so far.\nThat said, there's a fairly straightforward workaround in the meantime: To prevent the auto renewal, log out of your NordVPN account, then sign up for a discounted plan again using the same email. As long as you do this before your subscription expires, your new account should link to your old one, keeping you subscribed at the introductory rate.\nFree trials and refunds\nEvery NordVPN plan comes with a 30-day money-back guarantee. If you cancel and request a refund before 30 days are up, you'll get the full cost back. The only way to try it for free without paying is to get the app on Android, where there's a seven-day trial through the Google Play Store.\nNordVPN side apps and bundles\nNordVPN is part of a larger family of Nord Security products, which you can save money on if you need more than one. We won't review all of them here, but for reference, here's everything you'll get from the higher subscription tiers.\nBasic: VPN on 10 devices, specialty servers, DNS ad-blocking, Meshnet\nPlus: All Basic features, plus malware scanning, extra scam blocking, tracker blocking, NordPass password manager, data breach scanner\nComplete: All Plus features, along with 1TB of NordLocker encrypted cloud storage\nPrime: All Complete features, plus NordProtect features like dark web monitoring, credit monitoring, ID theft insurance and extortion insurance\nAnother tier called Ultra includes a subscription to Incogni, a data removal service run by Nord's partner Surfshark. The Ultra bundle is only available in certain countries, since NordVPN is still testing it; users outside the test countries can still add Incogni service at checkout. There also used to be a NordVPN family plan, but it seems to have been eliminated after Nord expanded the devices per subscription to 10.\nYou can get a dedicated IP address on NordVPN to ensure you have the same IP every time you connect. This lets you configure remote firewalls to let you through while you're connected to the VPN. A dedicated IP costs $8.99 per month, $70.68 for a year ($5.89 per month) or $100.56 for two years ($4.19 per month).\nThe NordVPN pricing page lists access to a Saily eSIM plan as a perk, though mysteriously, none of the existing plans seem to include it yet. A lot of VPNs are expanding into the eSIM space, so this may change soon.\nClose-reading NordVPN's privacy policy\nA VPN privacy policy isn't just empty words — it's a contract between the provider and its users. If a service openly defied its own policy, it could be sued for false advertising. VPNs tend to sneak loopholes into their privacy policies instead of flouting them outright; these loopholes can shed light on how the provider actually views your privacy.\nWe combed through NordVPN's privacy policy to see whether it tries to take any such liberties. The policy has two parts: the general Nord Security policy and an addendum specific to NordVPN.\nGeneral Nord privacy policy\nThis policy applies to all Nord Security apps. It's impossible to create an account without a valid email address, but you can use a separate email masking service to make that anonymous. The policy also explicitly says that your email address will be added to a marketing mailing list, though you can opt out. Irritating, but not a privacy risk in itself.\nWe're more concerned about the later statement that it may process data without the user's consent \"under the legal basis of our or third parties' legitimate interest.\" This clause covers some cases we'd agree are legitimate, such as identifying people who launch cyberattacks from NordVPN servers. But Nord also considers it \"legitimate interest\" to process your personal data \"to improve or maintain our services and provide new products and features.\"\nReached for comment, a NordVPN representative said that using personal data in this way \"generally involves aggregated, depersonalized or technical information.\" That's somewhat reassuring, but the \"generally\" leaves a bit too much wiggle room. Ideally, we'd prefer that personal data exist wholly in the \"consent only\" section.\nThe section on sharing your data with third parties only lists \"some of\" the service providers who may receive your information. Among these are Google Analytics, which is known to store personal data on U.S. servers — all of which are potential security risks in the age of DOGE. Other unnamed \"third parties\" are involved in targeting ads at users of Nord websites.\nThe NordVPN representative said that \"since some partners, such as payment processors, can vary by region or specific service and may change over time depending on our operational needs, we do not publish a fixed list.\" They added that all third parties are \"contractually required to handle personal data in accordance with applicable laws and industry standards.\"\nWe aren't using this to condemn Nord; many of these practices are fairly standard in the VPN industry. But it's important to know about all the potential leakage points before trusting your deepest secrets to any company.\nNordVPN specific policies\nThe NordVPN privacy policy doesn't add much atop the general Nord notice. It does track session activity connected to your username to make sure you're staying within the 10-device limit, but it automatically deletes these logs 15 minutes after you disconnect. The logs also don't include your IP address or the addresses of VPN servers you used.\nThe only real problem we found is that NordVPN apps collect information about your activity on the app by default. This doesn't include information about your browsing habits, but it does include unique traits that could conceivably be used for \"device fingerprinting\" — in which a third party can deduce a user's identity through clues about their device. You can turn this off in the General settings.\nA NordVPN spokesperson told us that the data collected is \"not personally identifiable,\" and that the company takes \"deliberate steps to strip out anything that could be linked back to a specific person.\" This presumably means the data is aggregated so it only shows general trends, not any one device's activity. That's a lot less risky, but we still recommend switching the setting off.\nThird-party privacy audits\nNordVPN has passed five independent audits of its privacy policy so far, most recently from Deloitte in late 2024. Annoyingly, you can only read the entire report by logging into a Nord account, but it at least doesn't have to be a paid account.\nThe audit found that NordVPN was following its own no-logs policy. Specifically, the Deloitte Lithuania investigators concluded that \"the configuration of IT systems and management of the supporting IT operations is properly prepared, in all material respects in accordance with the NordVPN's description set out in the Appendix I.\" (Appendix I of the report is identical to NordVPN's privacy policy.)\nCan NordVPN change your virtual location?\nYou'll be most interested in this section if you mainly use a VPN to change their location for streaming. To see if NordVPN could unlock new streaming libraries, we picked a new batch of five test servers, then logged onto Netflix. Since Netflix tries to block all VPN servers to prevent copyright issues, our first question was whether we'd get through at all.\nOur second question: would connecting to a NordVPN server actually change what Netflix library we saw? It should, given that NordVPN seems leak-proof, but thoroughness demands we check anyway. Here's what we found.\nServer location | Netflix unblocked? | Content changed? |\nCanada | Yes | Yes |\nArgentina | Yes | Yes |\nGermany | Yes | Yes |\nIndia | Yes | Yes |\nNigeria | Yes | No |\nFour out of five locations worked perfectly. On a Canadian server, we were able to stream Star Trek: The Next Generation, which left American Netflix years ago. The Argentine server gave us access to something called Pasion de Gavilanes, which we'd never heard of but sounds great.\nThe only problem was Nigeria. We tested it several times, connected to multiple different Nigerian locations, but saw our American Netflix library every time. We then ran a leak test on Nigeria, which wasn't one of our security test locations, and found it to be working normally. It's hard to say what happened, especially since the Nigeria server doesn't appear to be virtual, but we can confirm that it wasn't working.\nInvestigating NordVPN's server network\nNordVPN has servers in 153 cities in 117 countries. Out of all total options, 62 are virtual locations (about 40 percent), where the server is really located somewhere else. This makes it possible to get servers into more places, but depending on your actual location relative to the server, it may perform differently than you expect.\nVirtual locations have allowed NordVPN's server network to grow quite extensive, with lots more locations in South America, Africa and Asia than the industry standard. Check out the distribution in the table.\nRegion | Countries and territories with servers | Total server locations | Total virtual server locations |\nNorth America | 15 | 36 | 12 |\nSouth America | 10 | 10 | 6 |\nEurope | 48 | 57 | 11 |\nAfrica | 10 | 10 | 10 |\nMiddle East | 7 | 7 | 4 |\nAsia | 24 | 26 | 18 |\nOceania | 3 | 7 | 1 |\nTotal | 117 | 153 | 62 (40.5 percent) |\nThe relatively low proportion of virtual locations (nearly identical to that of ExpressVPN) is a good sign, as it means NordVPN has been growing its server network thoughtfully. Some VPNs — looking at you, HMA — inflate their server lists as a marketing point without seriously considering what it takes to maintain such a large network. That thankfully doesn't seem to be the case here.\nExtra features of NordVPN\nHere's everything you get with a NordVPN app other than the VPN itself. There's a lot going on here, so we'll limit ourselves to a sketch of each feature.\nSpecialty servers\nAs soon as you load NordVPN, you'll see a list of special servers near the top of the right-hand column. We'll go over each of them in order.\nDedicated IP: As discussed in the bundles section, a dedicated IP address costs extra. With this, you'll always connect with the same IP, which is private to you alone. It may be worth the price if you find yourself getting asked for CAPTCHAs a lot more while connected to NordVPN — though for what it's worth, that didn't happen to us.\nDouble VPN: This sends your connection through a second VPN server before it reaches your ISP. The second server is your apparent location. There are 10 endpoints to choose from. As you might imagine, your internet will run slower with two VPN servers in the mix, so only use this if you seriously need security.\nObfuscated servers: These are only available on OpenVPN. Obfuscation can help you get around firewalls that seek out and block VPN traffic. If you can't get online with NordVPN when you're on a certain network, obfuscated servers might work.\nOnion Over VPN: After encrypting your data as normal, these servers send it through several nodes of the Tor network, granting you the total anonymity of onion routing while keeping you safe from malicious relays. It's available in two locations, Netherlands and Switzerland, and — like double VPN — is best used only when you need the utmost privacy.\nP2P: NordVPN only allows torrenting on its peer-to-peer servers, but fortunately, it's got P2P servers in 114 countries — only three fewer than it has in total. NordVPN keeps your download and upload speeds very fast on average, so you shouldn't have trouble torrenting from any location.\nMeshnet\nMeshnet is NordVPN's most unique and exciting feature by a long shot. By logging into the same NordVPN account on multiple devices, you can connect those devices directly through a NordLynx tunnel without needing a NordVPN server in between.\nEssentially, you're using your own devices as VPN servers — obviously not great for privacy, but amazing for accessing web services in other countries. While two devices are connected, you can transfer files between them through the NordLynx tunnel. You can even invite friends and use their devices.\nThreat Protection\nNordVPN has two levels of antivirus: Threat Protection and Threat Protection Pro. The former is a simple DNS filter that stops your browsing from loading unsafe web pages while NordVPN is active. It's the highest level available on Android, iOS and Linux, or on any Basic subscription.\nThreat Protection Pro, which Plus subscribers or higher can set up on Windows and Mac, can work even when you aren't connected to a NordVPN server. It acts more like a standalone antivirus by scanning downloaded files for malware, and can even block trackers. Basic Threat Protection (without Pro) can block some trackers by filtering out domains known to use them, but doesn't block the trackers directly.\nDark Web Monitor\nWhile active, Dark Web Monitor continually searches known data breach dump sites on the dark web and notifies you if it ever finds your account email address. If you get that notification, change any passwords associated with the address. With a Prime subscription, you can also have it search for your phone number, social security number or other financial information.\nPresets\nPresets let you set up one-click VPN connections with a desired group of settings, a lot like Proton VPN's Profiles. NordVPN comes pre-loaded with presets that optimize for \"Downloads,\" \"Speed\" and \"Browsing,\" which sounds to us like the same thing three times.\nMore usefully, you can create presets for particular countries, then add website shortcuts that will appear once you've connected. You could, for example, set one that connects to a specific location, then add a shortcut to a streaming site available in that location.\nPost-Quantum encryption\nExperts widely believe that quantum computers will eventually make our current encryption algorithms obsolete, but there's almost no consensus on when that will actually happen — except that it hasn't happened yet. Knowing that, NordVPN's \"post-quantum encryption\" feature comes across as a bit premature, but it's reassuring that someone is thinking about it.\nHaving said that, we don't recommend using post-quantum encryption yet. It works by layering one of the known quantum-proof encryption standards on top of a standard NordLynx session, which makes your VPN connection slower and more erratic. Until we can verify a real quantum cyberattack, post-quantum encryption is a needless precaution.\nKill switch\nA kill switch cuts off your internet the instant you lose your connection to a NordVPN server. This protects you in case a server unexpectedly fails, and as a side benefit, prevents you from connecting to any fake VPN servers. You should keep the kill switch on at all times.\nSplit tunneling\nSplit tunneling is available on NordVPN's Windows and Android apps (and Android TV by extension), along with its browser extensions. On Windows and Android, it splits by app: you can determine which apps get online through the VPN and which go unprotected. The browser extensions let you split by URL, so the VPN only protects certain sites.\nNordVPN customer support options\nNordVPN's apps link directly to its online help center. As always, we went in with a specific question in mind: whether the basic level of Threat Protection could block trackers, and if so, what kind. We found the categories on the written support page difficult to parse, especially the troubleshooting section — would the average user appreciate the difference between \"app issues,\" \"connection issues\" and \"errors\"?\nWe correctly guessed that our question would be under \"Using NordVPN -> Features,\" but the introductory article on Threat Protection and Threat Protection Pro was buried at the bottom of the list. Unfortunately, that made things more confusing, as this article says that Threat Protection (not Pro) both does and doesn't block trackers. In NordVPN's favor, however, using the search bar brought us instantly back to that article without any confusion.\nThe live support experience\nUsing NordVPN's live chat was a smooth and reassuring experience. From the time we decided to ask directly, it took us less than a minute to connect with a real person, who quickly cleared up the confusion and promised to update the confusing support page (we'll check back to see if they actually do).\nOne other option is an email support form, which can be found both on the website and in the help sections of NordVPN apps. This is best for complex problems that require screenshots to explain, and promises a response within 24 hours.\nNordVPN background check\nNordVPN was founded in 2012. Launching with its desktop apps, it moved to iOS and Android in 2016, then added apps for browser extensions and smart TVs. Its developer, Nord Security, has no parent company, and its history is relatively uncontroversial. We've documented two notable incidents below, plus more about Nord Security's operations.\nHeadquarters and ownership\nNord Security was founded in Lithuania, and maintains offices there. Although Nord Security is registered in Amsterdam, NordVPN operates under a separate license in Panama, which makes any data requests subject to Panama's courts.\nFinland server breach\nThe first serious incident in NordVPN's history began in March 2018, when unidentified hackers managed to steal three private keys from one of Nord's data centers in Finland. Researchers didn't notice the leak until October 2019, well after the stolen keys had expired, but NordVPN's encryption was still technically vulnerable for several months.\nWe say \"technically,\" because it was really only the outer layer of encryption — and even if they'd broken through it all, the hackers would only have seen browsing activity, not usernames, passwords or anything else sensitive. If anything, NordVPN's response actually makes us trust it more. It ended its relationship with the contractor who ran the Finnish data center and revamped its policies to eliminate the kind of negligence that led to the breach.\nArguably, its only real error was not immediately disclosing the breach. NordVPN learned about the leak and started addressing it in May 2018, but the news didn't break until more than a year later. That timing probably made it look more suspicious than any actual mishandling did.\nLaw enforcement compliance\nAnother minor controversy erupted in 2022, when PCMag and other outlets reported that NordVPN had edited its website to say that it would comply with data requests from law enforcement. NordVPN responded with a new post that said nothing had changed: their policy was always to comply with lawful requests, which — provided the requests were lawfully submitted through a Panamanian court — is literally their only option.\nWe're inclined to agree. VPNs are legal companies. They wouldn't last long if they openly declared their intent to break the law. The key is that when law enforcement comes calling, there shouldn't be anything to show them, as with the Turkish seizure of ExpressVPN. That's why verifiable no-logging policies are so important.\nFinal verdict\nNordVPN is a great service on its own merits. It only suffers from having to be compared with the likes of ExpressVPN and Proton VPN. For example, its P2P servers are good for torrenting, but not as useful without Proton's port forwarding. It's fast, but speed tests fluctuated just a little more than Express.\nNordVPN's extra features are the best reason to pick it over its rivals. With Meshnet, you can theoretically set up a VPN connection anywhere in the world, and no other VPN has anything close to Meshnet's file transfer powers. Threat Protection Pro is also great if you can get it, adding file scanning to bolster the typical approach of just blocking suspicious DNS addresses. Specialty servers round out the offering, with double VPN maintaining good speeds with extra safety and Onion over VPN being among the safest ways to use Tor."
    },
    {
      "url": "https://www.engadget.com/best-tech/",
      "text": "The best tech you can buy right now\nWe at Engadget have reviewed a ton of gadgets. These are our favorites.\nThe best wireless earbuds for 2025\nThese are the wireless earbuds we've tested and reviewed that are the best for all needs and budgets.\nBest Smartphones\nBest Laptops\nThe best MacBook accessories for 2025\nStep up your MacBook Pro’s game with these handy accessories.\nThe best Windows laptops for 2025\nWe've got the best laptop recommendations for every size and situation.\nThe best Chromebook you can buy in 2025\nPlus, expert advice on how to choose one.\nThe best cheap Windows laptops for 2025\nThese top Windows laptops are all under $700.\nThe best budget laptops for 2025\nGet a great machine for cheap with our top-rated picks for budget laptops all costing $1,000 or less.\nThe best gaming laptops for 2025\nWe reviewed dozens of portable PCs — these are our favorite gaming laptops.\nBest Gaming\nBest Health & Fitness\nBest Headphones\nBest Tech Accessories\nBest Smart Home\nThe best Wi-Fi extenders in 2025\nFix those dead zones and get better coverage throughout your home.\nThe best robot vacuum for 2025\nIf you’re going to drop some money on a robo-vac, make sure it’s the right one.\nThe best smart scales for 2025\nSmart bathroom scales do so much more than just check your weight.\nThe best mesh Wi-Fi systems of 2025\nThese are the best routers we tested that can up your home Wi-Fi game.\nThe 7 best cordless vacuums for 2025\nDitch the heavy machines and get a lightweight, cordless stick vacuum instead."
    }
  ],
  "argos_summary": "Engadget reports that NordVPN is offering significant discounts on its two‑year plans, with the Plus tier at $108 (73% off) and the Prime tier at $189 (77% off). The review highlights NordVPN’s fast speeds, extensive server network, and added features such as Threat Protection, Meshnet, and a kill switch, while noting some UI clunkiness and a history of data‑breach incidents. The article also discusses the company’s privacy policy, independent audits, and the broader context of VPN usage for streaming and security.",
  "argos_id": "ALTPK7QT2"
}