{
  "url": "https://www.forbes.com/sites/tylerroush/2025/08/30/are-trumps-tariffs-still-in-effect-what-to-know-after-court-rules-most-levies-are-illegal/",
  "authorsByline": "Ty Roush",
  "articleId": "81146560370d41099da0a596f18560a4",
  "source": {
    "domain": "forbes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NJ",
      "county": "Hudson County",
      "city": "Jersey City",
      "coordinates": {
        "lat": 40.7215682,
        "lon": -74.047455
      }
    }
  },
  "imageUrl": "https://imageio.forbes.com/specials-images/imageserve/68b310a7d12fb711098cd7c1/0x0.jpg?format=jpg&crop=2054,1155,x0,y10,safe&height=900&width=1600&fit=bounds",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-30T15:00:10+00:00",
  "addDate": "2025-08-30T15:12:35.784147+00:00",
  "refreshDate": "2025-08-30T15:12:35.784148+00:00",
  "score": 1.0,
  "title": "Are Trump’s Tariffs Still In Effect? Here’s What To Know.",
  "description": "Trump challenged the appellate court ruling and claimed the Supreme Court would likely keep his tariffs in place.",
  "content": "An appellate court ruled most tariffs imposed by President Donald Trump are illegal, backing a lower court’s argument that the levies exceeded Trump’s authority, though the duties will remain in place for weeks as the Trump administration brings the case to the Supreme Court. Trump challenged the appellate court ruling and claimed the Supreme Court would likely keep his tariffs in place.\n\nThe U.S. Court of Appeals for the Federal Circuit ruled 7-4 late Friday that Trump overstepped his authority by issuing tariffs, as the court wrote the power to impose such tariffs is “vested exclusively in the legislative branch” and a “core Congressional power.” Dissenting judges argued Trump’s use of the International Emergency Economic Powers Act (IEEPA)—a 1977 law allowing the president to regulate international trade—to justify his tariffs is not an “unconstitutional delegation of legislative authority.” The IEEPA neither mentions tariffs nor has “procedural safeguards” that set limits on the president’s power to impose tariffs and does not “give the president wide-ranging authority” to issue levies, the majority ruling said. The appellate court’s ruling does not take effect until Oct. 14, however, allowing the Trump administration time to appeal to the Supreme Court. “The president's tariffs remain in effect, and we look forward to ultimate victory on this matter,” White House spokesperson Kush Desai said in a statement.\n\n“ALL TARIFFS ARE STILL IN EFFECT!” Trump wrote on Truth Social in criticism of the “Highly Partisan” appeals court. Trump claimed, “If these Tariffs ever went away, it would be a total disaster for the country.” He suggested the Supreme Court would “help” keep the tariffs in place for the “benefit of our Nation,” adding if the appellate court’s ruling is “allowed to stand, this Decision would literally destroy the United States of America.”\n\nWhat Happens If Trump’s Tariffs Are Ruled Illegal?\n\nThe ruling covers Trump’s “reciprocal” tariffs imposed on most U.S. trade partners, including additional rates on goods imported from China, Mexico and Canada. If upheld, the ruling would prevent the levies from being enforced, though other tariffs, including those imposed on steel, aluminum and copper, would remain in place because they were issued under a different presidential authority. It’s not immediately clear how the ruling would impact trade deals reached between the U.S. and countries like Japan, South Korea and others in response to the tariffs, or how the broader financial market would react.\n\nTrump unveiled wide-reaching tariffs on U.S. trade partners earlier this year, claiming authority to do as he argued an international trade imbalance was harming national security. Friday’s ruling upholds a decision from the Court of International Trade in May, which disputed Trump’s authority to impose sweeping tariffs under the IEEPA, ruling in favor of a consolidated lawsuit filed by a dozen states and five small businesses. The Trump administration has argued courts previously approved President Richard Nixon’s emergency use of tariffs in 1971 under earlier emergency powers legislation, though the Court of International Trade rejected the claim and said Trump’s tariffs “exceed any authority granted to the president” under the law.",
  "medium": "Article",
  "links": [
    "https://truthsocial.com/@realDonaldTrump/posts/115114339832960282",
    "https://www.forbes.com/sites/tylerroush/2025/08/12/trump-says-his-tariffs-collected-trillions-in-revenue-so-far-heres-the-real-figure/",
    "https://storage.courtlistener.com/recap/gov.uscourts.cafc.23105/gov.uscourts.cafc.23105.159.0_1.pdf"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "tariffs",
      "weight": 0.11240307
    },
    {
      "name": "most tariffs",
      "weight": 0.111844
    },
    {
      "name": "other tariffs",
      "weight": 0.11006732
    },
    {
      "name": "such tariffs",
      "weight": 0.110035405
    },
    {
      "name": "sweeping tariffs",
      "weight": 0.10988256
    },
    {
      "name": "Trump",
      "weight": 0.09497273
    },
    {
      "name": "Donald Trump",
      "weight": 0.09412973
    },
    {
      "name": "President Donald Trump",
      "weight": 0.09368261
    },
    {
      "name": "U.S. trade partners",
      "weight": 0.07934384
    },
    {
      "name": "most U.S. trade partners",
      "weight": 0.07932593
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.98095703125
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.939453125
    },
    {
      "name": "/People & Society/Social Sciences/Political Science",
      "score": 0.7265625
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.491943359375
    },
    {
      "name": "/Law & Government/Government/Courts & Judiciary",
      "score": 0.451416015625
    }
  ],
  "sentiment": {
    "positive": 0.068798155,
    "negative": 0.651147,
    "neutral": 0.28005484
  },
  "summary": "The U.S. Court of Appeals for the Federal Circuit has ruled most tariffs imposed by President Donald Trump are illegal, ruling that the levies exceeded Trump's authority. The ruling, which does not take effect until October 14, supports a lower court's argument that the tariffs exceeded the president's authority, will remain in place for weeks as the Trump administration appeals to the Supreme Court. The court ruled that the president overstepped his authority by issuing tariffs, stating that the power to impose such tariffs is \"vested exclusively in the legislative branch\" and a \"core Congressional power\". Dissenting judges argued that Trump's use of the International Emergency Economic Powers Act (IEEPA) to justify his tariffs was not an \"unconstitutional delegation of legislative authority\". If upheld, the ruling would prevent the tariffs from being enforced, but other tariffs, including those imposed on steel, aluminum and copper, would stay in place as they were issued under a different presidential authority.",
  "shortSummary": "A US appellate court ruled most tariffs imposed by President Donald Trump exceeded his legislative authority, but the Trump administration may appeal.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "d63259c6f7bc4911b378d500106dbb59",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.forbes.com/sites/tylerroush/2025/08/12/trump-says-his-tariffs-collected-trillions-in-revenue-so-far-heres-the-real-figure/",
      "text": "Topline\nPresident Donald Trump on Tuesday said his tariffs are taking in “trillions of dollars”—which matches estimates from some economists for revenue his levies could generate, but over the next decade, not so far this year.\nKey Facts\n“Trillions of dollars are being taken in on tariffs,” Trump wrote on Truth Social, suggesting his levies have “not caused inflation, or any other problems for America, other than massive amounts of CASH pouring into our Treasury’s coffers.”\nTrump leaves out that tariffs are paid by U.S. companies to import foreign goods, with those costs eventually paid by U.S. consumers.\nHow Much Revenue Has The U.s. Collected From Trump’s Tariffs?\nThe U.S. has collected $142 billion from tariff revenue so far this fiscal year, which ends in September, according to Treasury Department data released Tuesday. Since Trump’s tariffs took effect in April, his levies have generated about $96 billion in revenue, after customs duties jumped to $28 billion in July, marking an annual increase of 273%. Customs duties accounted for $27 billion in revenue for June, $22 billion in May and $16 billion in April. Before Trump’s tariffs were announced, customs duties totaled $8 billion in March and $7 billion in February and January. Customs duties are tariffs or taxes paid by importers in international trade, meaning companies, businesses or individuals in the U.S. are required to pay levies as goods enter the country. Consumers tend to carry the weight of tariff costs as companies adjust prices to offset or absorb the effects of tariffs.\nHow Much Revenue Will Trump’s Tariffs Generate?\nEven Treasury Secretary Scott Bessent told MSNBC earlier this month he expects tariffs would generate $300 billion annually, noting “there’s a chance that could be higher” in 2026. The Tax Foundation projected Trump’s tariffs would raise about $2.5 trillion over the next decade, even as the levies will likely raise the price of common goods and taxes for the average household by nearly $1,300 in 2025 and $1,700 in 2026. The Committee for a Responsible Federal Budget, a public policy nonprofit, expects Trump’s tariffs to generate $2.8 trillion to the U.S. gross domestic product by fiscal year 2034 if they continue.\nHave Trump’s Tariffs Influenced Inflation?\nInflation jumped lower than expected to 2.7% in July, though core consumer prices—a measurement that excludes food and energy—rose 3.1% year-over-year, matching a high this year set in January. It appears Trump’s tariffs have raised prices, and some economists have warned his levies could hike costs through the end of the year. JPMorgan Chase’s chief U.S. economist, Michael Feroli, argued in a note earlier this year that Trump’s tariffs would result in “meaningfully larger increases” to consumer prices and higher inflation at some point this year. Federal Reserve Chair Jerome Powell said last month that while the U.S. economy was in a “solid position,” the effects of tariffs on the economy and inflation “remain to be seen.”\nTangent\nTrump said last month his administration would “consider” sending checks based on the revenue his tariffs have generated. Sen. Josh Hawley, R-Mo., introduced a bill after Trump signaled interest in a rebate check, which would send at least $600 to each eligible adult and dependent child this year. A larger rebate check would be issued if tariff revenue exceeds projections, according to a draft of the bill, which reduces the rate by 5% to about $570 for joint filers with an adjusted gross income above $150,000, a head of household with an income above $112,500 or an individual whose income exceeds $75,000. The bill has yet to be considered."
    }
  ],
  "argos_summary": "An appellate court ruled that most of President Trump’s tariffs exceed his authority, declaring them illegal under the principle that tariff power is a core congressional function. The decision will not take effect until October 14, giving the administration time to appeal to the Supreme Court, while the tariffs remain in place for the interim. Trump maintains that the tariffs will stay and that the ruling would harm the country, while the court’s majority cited the International Emergency Economic Powers Act as insufficient to grant tariff authority. The ruling covers reciprocal tariffs on China, Mexico, Canada, and others, though steel, aluminum and copper duties issued under different powers will remain. The case highlights the tension between executive trade actions and congressional authority, with potential implications for U.S. trade policy and market sentiment.",
  "argos_id": "B50S2PG8O"
}