{
  "url": "https://www.slashgear.com/1952547/worlds-largest-oil-rig-where-located-how-works/",
  "authorsByline": "Edward Munene",
  "articleId": "1cc594656ae8420a9afe4a391c6442c4",
  "source": {
    "domain": "slashgear.com",
    "paywall": false,
    "location": null
  },
  "imageUrl": "https://www.slashgear.com/img/gallery/where-is-the-largest-oil-rig-in-the-world/l-intro-1756280264.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-31T19:15:00+00:00",
  "addDate": "2025-08-31T19:23:46.749200+00:00",
  "refreshDate": "2025-08-31T19:23:46.749202+00:00",
  "score": 1.0,
  "title": "Where Is The Largest Oil Rig In The World?",
  "description": "How big is the largest oil rig in the world? Find out more about the location, capacity, impact, and other facts about the Pacific Berkut oil rig.",
  "content": "When you think about offshore oil rigs, what comes to mind is what you may have seen in movies — skeletal towers in the middle of a vast sea, some flares cutting through the darkness, and a crew that goes months without a sight of land. Such images do well to paint the picture, but they don't always show how enormous these machines really are.\n\nFar from any coastline, in the icy waters of Russia's Far East, specifically in the Sea of Okhotsk and close to Sakhalin Island, sits the Pacific Berkut (which translates to \"golden eagle\" in Russian), an offshore oil rig built for Arctic oil and gas operations. This $12 billion station is surrounded by freezing waters, sometimes reaching as low as -47 degrees Fahrenheit, cold enough to test both the crew and steel alike.\n\nSpanning over 344 feet long, 196 feet wide, 472 feet tall, and weighing a whopping 200,000 tons, it's easily one of the largest drilling rigs ever built. And being a gravity-based structure (GBS), it's anchored to the seabed and designed to withstand waves as tall as 60 feet and winds of up to 75 miles per hour, among other subarctic conditions. The rig is co-owned by several big oil companies from Russia, the U.S., India, and Japan under a consortium known as the Sakhalin-1, which was at some point the largest foreign direct investment in Russia.",
  "medium": "Article",
  "links": [
    "https://www.slashgear.com/1848521/how-offshore-oil-rigs-are-built/"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "offshore oil rigs",
      "weight": 0.11127465
    },
    {
      "name": "several big oil companies",
      "weight": 0.093084864
    },
    {
      "name": "freezing waters",
      "weight": 0.07684593
    },
    {
      "name": "Russia",
      "weight": 0.07321624
    },
    {
      "name": "The Largest Oil Rig",
      "weight": 0.06895359
    },
    {
      "name": "other subarctic conditions",
      "weight": 0.06570961
    },
    {
      "name": "an offshore oil rig",
      "weight": 0.06567084
    },
    {
      "name": "Sakhalin Island",
      "weight": 0.06507236
    },
    {
      "name": "Far East",
      "weight": 0.064941496
    },
    {
      "name": "golden eagle",
      "weight": 0.063427575
    }
  ],
  "topics": [
    {
      "name": "Energy Sector"
    }
  ],
  "categories": [],
  "taxonomies": [],
  "sentiment": {
    "positive": 0.312918,
    "negative": 0.1276087,
    "neutral": 0.55947334
  },
  "summary": "The largest offshore oil rig in the world, the Pacific Berkut, is located in the Sea of Okhotsk and near Sakhalin Island, Russia. The $12 billion vessel is designed to withstand waves as high as 60 feet and winds up to 75 miles per hour. It is co-owned by several major oil companies under a consortium named the Sakhili.",
  "shortSummary": "The Pacific Berkut is the world's largest offshore oil rig, weighing nearly 400,000 feet (1.4%) and capable of withstand multiple waves.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "a3f768a170fa4436a88dcbca95af038c",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.slashgear.com/1848521/how-offshore-oil-rigs-are-built/",
      "text": "How Are Offshore Oil Rigs Built?\nTry as so many private and government organizations might, switching everywhere on Earth over to clean, renewable energy — including some strange sources being explored — is still a long way away. Thus, oil remains one of the hottest commodities on the planet, for everything from keeping automobiles going to helping out virtually all major forms of manufacturing. Naturally, the extraction of it remains a major industry as well, and it hasn't stuck to the boundaries of dry land. Offshore oil rigs have made it possible to collect oil and natural gas from below the ocean's floor, appearing as massive megastructures in the middle of open water.\nGiven their sheer size and placement, one has to wonder how offshore oil rigs are constructed. Unsurprisingly, these monuments to the modern world's need for fossil fuels aren't constructed from the ocean floor up. Keeping things far more practical, they're assembled like any other structure: by large construction crews on land before being moved to the desired drilling location in the ocean. This is done with the aid of several heavy-duty transport vessels and massive cranes to move rigs without issue. These structures typically float and are anchored in place, having been meticulously designed so that they do not topple over at the first reasonably strong gust of wind.\nSpeaking of design, as notable as offshore oil rig construction is, it's nothing without solid blueprints behind it. Designing such structures is no small feat.\nBefore oil rig construction, preliminary designing is crucial\nLong before offshore oil rigs are put together, much less sent out into the open ocean, they're expertly designed. Schematics are drawn up, and in many cases, engineers will take these plans and put them into action digitally, creating 3D models of the rigs to get an idea of scale and function. Of course, this pre-visualization isn't done without some form of scientific backing. These are massive, labor-intensive, and monetarily demanding structures set to live a life on unpredictable waters, after all. They need to be put through their paces before being built to avoid real-world disasters.\nAside from ensuring they can function as needed and accommodate for massive crews, the most important aspect of the design phase is to make sure the oil rig can handle the elements. Buoyancy — an aspect of one of Archimedes' inventions that remains a staple of modern engineering — is key with oil rigs. If it can't float, it's not going to be very effective, so the implementation of proper water displacement is something to keep in mind. They also need to be stable, with the added weight, or ballast, consciously placed at specific points on the lower end of the rig. This keeps its center of gravity low, preventing capsizing. Additionally, the rig should be able to withstand different wave patterns and water pressures.\nSo long as oil rigs are well designed, constructed, and maintained, they should deliver on their purpose. At least, that's what the people or companies behind them would hope, considering the monumental costs that come along with their creation.\nThe astounding cost of offshore oil rig construction\nA lot goes into budgeting for the construction and use of an offshore oil rig. The weight of the rig should be considered, as should the environment in which it's supposed to drill. The capabilities it will have and the depth of the waters it will operate in are incredibly important, too. Ultimately, these factors can lead to companies spending, in the most literal sense, a fortune to get one. More basic units tend to cost around $20 million, while larger, more complex ones can soar well above $1 billion. Between this, paying laborers, maintaining the rig, and other associated costs, offshore oil drilling can get absurdly expensive.\nWith such major costs involved, it's no surprise that the hope is for these offshore oil rigs to make their money back and then some. Oil drilling is far from a sure thing. One can set up on a speculative plot that isn't a guarantee to deliver, complex economic factors can increase and decrease the demand for oil, and navigating environmental regulations can consume time and money alike. Estimates place it at roughly 10 years before offshore drilling efforts generate a full return on the initial investment. Historically, profits between 15% and 20% have been the average industry-wide.\nIn the wake of the effective failure of biodiesel, and as green energy continues to evolve, oil is here to stay for a while longer. As a result, one can expect plenty more time, money, and resources to go into the construction and use of offshore oil rigs and other drilling equipment in the coming years."
    }
  ],
  "argos_summary": "The article describes the Pacific Berkut, a $12 billion, 200,000‑ton gravity‑based offshore rig operating in Russia’s Sea of Okhotsk near Sakhalin Island, and highlights its massive dimensions and extreme Arctic operating conditions. It explains how offshore rigs are designed and built on land, transported, and anchored, emphasizing engineering challenges such as buoyancy, stability, and harsh weather. The piece notes the high construction costs—ranging from $20 million for smaller units to over $1 billion for larger rigs—and the long pay‑back horizon of roughly ten years, underscoring oil’s continued importance amid renewable energy transitions.",
  "argos_id": "CKW3BXT3L"
}