{
  "url": "https://www.businessinsider.com/empty-nester-loneliness-art-hobbies-dog-traveling-helped-2025-8",
  "authorsByline": "Gary Nunn",
  "articleId": "836fa4bd1bd64faf964bd459fcd91217",
  "source": {
    "domain": "businessinsider.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://i.insider.com/68b05615a17a8c5b4053a434?width=1200&format=jpeg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-31T11:17:01+00:00",
  "addDate": "2025-08-31T11:23:03.853332+00:00",
  "refreshDate": "2025-08-31T11:23:03.853334+00:00",
  "score": 1.0,
  "title": "I struggled with loneliness when I became an empty nester. I found new hobbies, got a dog, and started traveling.",
  "description": "Justine Martin struggled with loneliness when she became an empty nester. She went to therapy, got a new dog, and started traveling.",
  "content": "This as-told-to essay is based on a conversation with Justine Martin, a single mom in Geelong, Australia. It has been edited for length and clarity.Ten years ago, my last child left home at 17. Initially, I was shocked — I thought I'd have her around until she was in her mid-20s. I wasn't ready for her to leave as a teenager, and I also wasn't sure who I was outside of being a parent. I'd been a mom for 22 years since my eldest — my son — was born.My daughter and I had also been arguing when she moved out, and she went to live with her boyfriend. It was not how I'd imagined things going.I became an empty-nester about eight years before I envisaged it, which is part of why I wasn't mentally prepared. My son left in his mid-20s, so I expected my daughter to do the same. Looking back, I sometimes wonder if I made my children a little too self-sufficient, too soon.I felt so alone. I had so much time on my hands that I didn't know what to do with it. As a sole parent, I didn't have a partner to fall back on. The house was deadly quiet.I booked a therapist to help me process my loneliness. I realized I had to reinvent myself as \"more than just a mom.\" That'd be a long journey, as hard battles were ahead.I began dog-sitting to help a friend out. It also helped me out and gave me much-needed company through a distressing time: I'd had to leave work due to being diagnosed with multiple sclerosis in 2011, then cancer in 2016. The cancer came less than a year after my daughter left. I couldn't bring myself to get my own dog; I didn't know if I'd survive the cancer, so it didn't seem fair.Once I went into remission from cancer in 2018, I realized his dog had filled such a void for me — it was time to become a mom to a furbaby myself. I got a mini sausage puppy, Pansy, and she has been my constant companion ever since. Dachshunds are very needy. She follows me literally everywhere — even to the toilet!Even with Pansy, I needed to decide what to do with the spare time. As my grief began to subside, I realized I could go where I wanted whenever I wanted and didn't have to rush home or get out of bed early for my daughter. Gradually, I went from feeling depressed to feeling liberated.I traveled across the beautiful, big country I live in — Australia — staying with friends, and my son, who lives interstate. At first, it felt strange traveling solo, without having to book extra flights for my daughter.Over time, I began noticing things I liked about being an empty-nester. My grocery bill decreased. With the extra money, I was able to buy more supplies for my hobbies. I started painting and sculpting more, then selling my artwork and sculptures. I also began illustrating children's books.My key to surviving loneliness was not waiting for someone else to make me happy, which is what a lot of lonely people do. I went out there and did it myself. It began with little things, like simply making sure I made the bed every day. It's a mindset thing; it starts your day right. Then, even if the rest of the day went poorly, at least I'd accomplished that small thing for myself.No one tells you how it'll feel when you suddenly become an empty nester, and I was under-prepared. That's why therapy was so helpful. However, sometimes I still get sad, thinking about how my children are all grown up and that phase of life is over.These days, though, that sadness passes more quickly than it once did. I'm a grandma now, and my daughter and I have a great relationship again. My grandkids come over to stay once a fortnight, and the house is alive again. I'm so grateful for that.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "time",
      "weight": 0.0608497
    },
    {
      "name": "little things",
      "weight": 0.06035956
    },
    {
      "name": "more supplies",
      "weight": 0.059784852
    },
    {
      "name": "things",
      "weight": 0.05698709
    },
    {
      "name": "cancer",
      "weight": 0.05307572
    },
    {
      "name": "hard battles",
      "weight": 0.050373677
    },
    {
      "name": "Justine Martin",
      "weight": 0.048964325
    },
    {
      "name": "new hobbies",
      "weight": 0.047813997
    },
    {
      "name": "loneliness",
      "weight": 0.047713414
    },
    {
      "name": "extra flights",
      "weight": 0.047070947
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/People & Society/Family & Relationships/Family/Other",
      "score": 0.837890625
    },
    {
      "name": "/People & Society/Self-Help & Motivational",
      "score": 0.453857421875
    }
  ],
  "sentiment": {
    "positive": 0.06245303,
    "negative": 0.6753791,
    "neutral": 0.26216787
  },
  "summary": "Single mom Justine Martin, a single mom in Geelong, Australia, struggled with loneliness when she became an empty-nester after her last child left home at 17 and left at the age of 17. Martin found new hobbies, got a dog, and started traveling. She also experienced a period of depression when her daughter moved out of the house at 17, leaving her with a boyfriend and feeling alone. Martin had to leave work due to multiple sclerosis in 2011 and cancer in 2016, but was able to overcome this and reinvent herself as \"more than just a mom.\" She credits her self-reliance to a mini sausage puppy, Pansy, who has been her constant companion since. Martin credits her transformation to not waiting for someone else to make her happy, but instead doing what it's possible to make a living. She credits therapy for helping her cope with her loneliness. However, she still feels sad as her children grow up and her relationship with them is reevaluated.",
  "shortSummary": "When my daughter left at 17, I struggled with loneliness and found new hobbies, including dog-sitting, and reinventing myself as a single mother.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "76d47b4f75774980b9163b2100748f08",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Justine Martin, a single mother from Geelong, Australia, reflects on the emotional transition to empty‑nest life after her children left home, compounded by her battles with multiple sclerosis and cancer. She sought therapy, took up dog‑sitting, and later adopted a puppy to fill the void, finding companionship and renewed purpose. The extra free time allowed her to travel, pursue artistic hobbies, and sell her work, ultimately reshaping her identity beyond motherhood. While loneliness still surfaces, she now embraces a more autonomous lifestyle and enjoys visits from her grandchildren.",
  "argos_id": "CWWLV3WK9"
}