{
  "url": "https://www.nytimes.com/live/2025/08/31/us/trump-news/noem-defends-deployment-of-the-national-guard-in-us-cities",
  "authorsByline": "Maggie Haberman",
  "articleId": "4c21d793db504705b71f1ff83495f59a",
  "source": {
    "domain": "nytimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "AZ",
      "county": "Pima County",
      "city": "Tucson",
      "coordinates": {
        "lat": 32.1988848,
        "lon": -110.8218543
      }
    }
  },
  "imageUrl": "https://static01.nyt.com/images/2025/08/31/multimedia/31trump-news-noem-gclv/31trump-news-noem-gclv-mediumSquareAt3X.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-31T12:54:39+00:00",
  "addDate": "2025-08-31T18:20:53.962118+00:00",
  "refreshDate": "2025-08-31T18:20:53.962121+00:00",
  "score": 1.0,
  "title": "Noem defends deployment of the National Guard in U.S. cities.",
  "description": "Kristi Noem, the Homeland Security se",
  "content": "Noem defends deployment of the National Guard in U.S. cities. Kristi Noem, the Homeland Security secretary, at a news conference in Washington in July. Kristi Noem, the Homeland Security secretary, defended the deployment of the National Guard in U.S. cities on Sunday, claiming that Los Angeles “wouldn’t be standing today” if President Trump had not deployed troops there to help quiet protests over federal immigration crackdowns. Ms. Noem made the comments on CBS’s “Face the Nation,” as the host Ed O’Keefe pressed her about upcoming plans to send federal forces into Chicago and other cities in Democratic-leaning states for law enforcement purposes. Mr. Trump on Monday directed the Defense Department to take a larger role in domestic law enforcement, including by “quelling civil disturbances.” The model for that move was the National Guard’s deployment in Los Angeles, where troops were sent in June during protests in the city. Los Angeles “wouldn’t be standing today if President Trump hadn’t taken action,” Ms. Noem said. “That city would have burned down if left to the devices of the mayor and the governor of that state.” She added that “so many of those homes and businesses that were in downtown L.A. and those areas were dealing with violence and riots.” The unrest in Los Angeles, which arose in response to Immigration and Customs Enforcement sweeps in the city, in some cases included fires and chunks of cement being thrown at officers. But it was mostly confined to a small area of the city. Mr. O’Keefe asked Ms. Noem about comments made by Gov. J.B. Pritzker of Illinois, who has been a focus of Mr. Trump’s ire. The president has repeatedly described Chicago as rife with crime and said publicly that Mr. Pritzker and others should ask the federal government to come in. Mr. Pritzker, who was one of 19 Democratic governors who signed a joint statement this week condemning the president’s threat to send National Guard troops into major cities, said that Ms. Noem has been “inflaming passions.” He said that police officers in his state had made sure that no one was attacking ICE agents during their operations. But, he said, people also have a protected right to express themselves. In the interview, Ms. Noem blamed Mr. Pritzker for not calling President Trump and not looking for people to work with in the federal government.\n\nChicago’s mayor rejects Trump’s plans to send troops to his city. Mayor Brandon Johnson of Chicago has pushed back against the Trump administration’s threats of militarized immigration enforcement in the city. Mayor Brandon Johnson of Chicago has rejected the Trump administration’s plans to send troops or militarized federal agents to his city for immigration enforcement, and ordered local police officers not to aid the federal crackdown. The mayor’s executive order, signed on Saturday, steps up the tensions between the White House and state and local officials. It comes after President Trump said he would send troops to Chicago and New York, as he did to Washington, D.C., in August and to Los Angeles in June. The mayor’s order said the city would pursue “all available legal and legislative avenues” to resist actions by the federal government “that violate the rights of the City and its residents, including the Constitutional rights to peacefully assemble and protest and the right to due process.” “Federal law prohibits the use of U.S. Military for domestic law enforcement except in extraordinary circumstances — which do not exist in Chicago,” the order said. Crime in Chicago has fallen in nearly every major category over the past year, according to city figures, and murders are down 50 percent from their peak during the pandemic. At a news conference last week alongside other city and state leaders, Mayor Johnson and Gov. JB Pritzker of Illinois, who are both Democrats, denounced Mr. Trump’s threat to send troops. But Mr. Trump repeated his threat in a social media post on Saturday, saying the governor needed to take action to prevent crime “or we’re coming!” Mr. Johnson’s executive order said that federal agents should comply with city policies that prohibit law enforcement officers from wearing masks to intentionally disguise or conceal their identities. It also calls for the city to take steps to ensure that residents know their rights when encountering federal agents. “We have received credible reports that we have days, not weeks, before our city sees some type of militarized activity by the federal government,” Mr. Johnson told reporters on Saturday. “We have not called for this.” Chicago has clashed with the Trump administration over the city’s sanctuary laws for immigrants. Illinois and Chicago limit how city agencies may interact with federal immigration authorities; the White House says that a lack of cooperation at the local and state levels impedes federal immigration enforcement efforts.\n\nMore than 2,200 member of the National Guard have been deployed in Washington. Jeanine Pirro, the U.S. attorney in Washington, on Sunday defended the Trump administration’s takeover of the city’s police force and the deployment of more than 2,200 members of the National Guard to the capital. Speaking on “Fox News Sunday,” Ms. Pirro said that since the federal deployment began in early August, the authorities had made 1,528 arrests and seized 156 guns. “They can’t be used to shoot and kill other people,” she said of the confiscated weapons. But a review by The New York Times of about a thousand arrests that were made during the first two weeks of the federal law enforcement surge suggests that the operation has been more of a sprawling dragnet than a targeted crime-fighting operation. Ms. Pirro also sought to deflect criticism over a case in which federal prosecutors were unable to persuade a grand jury to approve a felony indictment against a man who threw a sandwich at a federal agent on the streets of Washington this month. The grand jury’s rejection of the felony charge was a remarkable failure by Ms. Pirro’s office and the second time in recent days that a majority of grand jurors refused to vote to indict a person accused of felony assault on a federal agent. “A lot of those people who sit on juries live in Georgetown or in Northwest or in some of these better areas, and they don’t see the reality of crime that is occurring,” Ms. Pirro said. “The grand jurors don’t take it so seriously.”\n\nA U.S. Air Force plane that was used to deport migrants in Guatemala City in January. Daniele Volpe for The New York Times A federal judge temporarily blocked the Trump administration from deporting Guatemalan children back to their home country, and scheduled an emergency hearing on Sunday afternoon to determine whether deporting them would be legal. Judge Sparkle L. Sooknanan of U.S. District Court for the District of Columbia issued the order after the National Immigration Law Center filed an emergency request in federal court to stop the deportations. The lawyers argued that the government had violated the children’s rights to due process and had ignored special protections for minors who cross the border alone. The court forbade the administration from deporting the children, who are as young as 10, for 14 days. Even so, dozens of children were removed by immigration authorities from shelters overnight and were gathered in preparation to be placed on chartered planes to Guatemala, according to officials with knowledge of the situation. The judge’s order could temporarily hamstring the federal government’s attempts to return to Guatemala hundreds of unaccompanied minors who have been in U.S. custody after crossing the southern border. On Sunday morning, after the temporary restraining order was issued, shelters holding children received a letter from the federal Office of Refugee Resettlement stating that the agency was responsible for the care and custody of the children, and that the shelters must comply with the agency’s directives. The officials with knowledge of the situation, speaking on condition of anonymity out of fear of retribution from the government, said that dozens of children were removed from shelters in the early morning hours Sunday. Though the judge’s order is temporary, it is the second recent setback for President Trump’s immigration policies. On Friday, another judge blocked the administration from carrying out rapid deportations far from the border, a cornerstone of the White House’s immigration policy. The lawsuit over the Guatemalan children was filed after staff members at shelters that were holding the children were notified by email on Saturday that they should prepare some of them to be sent back to Guatemala. Lawyers representing some of the children received a similar email. In its 25-page complaint, the National Immigration Law Center said that the children had active cases before immigration courts across the country, and that their repatriation would violate federal law and the Constitution. It called the government’s actions “unlawful and reckless.” Ten children are identified by their initials in the lawsuit. All of them have cases pending in immigration courts and have told judges that they are afraid to return to Guatemala, the lawsuit says. The number of unaccompanied minors entering the United States has plummeted since Mr. Trump began his second term. Migrant children have posed a particular challenge to the Trump administration because they are entitled to special protections. Hundreds of thousands of children, mainly from Central America, have crossed the southern border into the United States in the last decade, often seeking to join friends or relatives. Many of the minors have won the right to remain in the United States permanently by proving that they were abandoned or persecuted in their home countries. The move to repatriate the Guatemalan children has the backing of the Guatemalan government. Carlos Ramíro Martínez, Guatemala’s minister of foreign affairs, said on Friday that his country had been coordinating with the United States. and expected to receive more than 600 minors. When unaccompanied children entering the United States are taken into custody, they typically remain in shelters until they are released to sponsors or guardians once those adults have been vetted. The children the Trump administration is seeking to deport have been awaiting release from the shelters. Lawyers fighting the removal of unaccompanied minors have cited the Trafficking Victims Protection Reauthorization Act, which provides special protections for unaccompanied minors who seek refuge in the United States, including the opportunity to have their cases adjudicated by a court. “We are very concerned that our clients could be returned to unsafe situations,” said Ms. Sendukas, managing attorney with the Galveston-Houston Immigrant Representation Project.\n\nTrump says he will sign an executive order mandating voter I.D. for elections. President Trump said in a post on Truth Social that he would sign an executive order mandating voter ID. Karsten Moran for The New York Times President Trump said late Saturday that he would issue an executive order to require voter identification for all U.S. elections, a continuation of his efforts to overhaul the nation’s election laws, which he has long attacked and falsely blamed for his 2020 election loss. In a post on Truth Social, Mr. Trump said, “Voter I.D. Must Be Part of Every Single Vote. NO EXCEPTIONS! I Will Be Doing An Executive Order To That End!!!” He did not provide further details about the order. He also reiterated his intention to restrict mail-in voting except for those who are very ill or serving far away in the military, as well as his opposition to voting machines. The announcement signals Mr. Trump’s latest effort to influence election laws using an executive order, something that he has dubious authority to do. The Constitution gives the president no explicit authority to regulate elections. Rather, it gives states the power to decide the rules of elections, oversee voting and try to prevent fraud. It gives Congress the ability to override state laws on voting. Any executive order from the president regarding elections is likely to see immediate legal challenges. Mr. Trump and his allies have started a wide-ranging effort to gain any advance they can ahead of midterm elections, which are set for November 2026. Earlier this month, Mr. Trump said that a team of lawyers were preparing an executive order to end all mail-in ballots and wrote on social media that the executive order would “help bring HONESTY to the 2026 Midterm Elections.” He has long opposed mail-in voting and falsely claimed it was a source of fraud after he lost the 2020 presidential election to Joseph R. Biden Jr. In March, Mr. Trump signed an executive order seeking to require people to show government-issued proof of U.S. citizenship to register to vote in federal elections. The order was swiftly challenged in court, and a federal judge blocked the vast majority of the order in June. The judge, Denise J. Casper of the Federal District Court for the District of Massachusetts, sided with states that had sued to stop the requirements, writing in her judgment that the states were likely to succeed in showing that the order exceeded Mr. Trump’s authority and risked disenfranchising some of the electorate. Judge Casper was appointed by President Obama. “The Constitution does not grant the president any specific powers over elections,” she wrote.\n\nFrom Cracker Barrel to Sydney Sweeney, Trump has an opinion to share. Mr. Trump at the Kennedy Center earlier this month. Cracker Barrel didn’t ask for this. Just a couple weeks ago, it was a restaurant where patrons could play checkers and eat Chicken n’ Dumplins. That changed when the chain removed an image of a man sitting next to a barrel from its logo. The restaurant endured cultural backlash from conservatives, including President Trump’s eldest son, who accused the company’s executives of supporting diversity efforts. After a call with White House officials and a logo change earlier this week, the company unwoked itself to Mr. Trump’s liking. “Congratulations Cracker Barrel!” read the statement from Mr. Trump, who celebrated the old barrel man’s return to the logo. “All of your fans very much appreciate it.” It used to be that you could switch off the so-called culture wars, or at least find a place to mute them for a little while. Cracker Barrel was actually one of those places. But now, not even something as low stakes as a company’s logo can escape the gaze of a president bent on changing — or forcing — American life to reflect his own views and tastes, which often mirror the far-right ideological movement that fueled his rise. The White House declined to comment on why this matter was worthy of the president’s time, and why officials had held the call with Cracker Barrel. But an official passed on a statement from Mr. Trump’s press secretary, Karoline Leavitt, who praised the president’s “unmatched business instincts.” The logo debacle seems like a small thing, but really, it shows how Mr. Trump is now using his power to reshape all aspects of American culture, not just American policy. He has not hesitated to retaliate against those who disagree. A Cracker Barrel restaurant in Binghamton, N.Y., whose sign shows the chain restaurant’s original logo. He has effectively taken over the Kennedy Center, where he will decide what art is appropriate to receive national recognition, and where he will host the annual awards ceremony. (No “wokesters,” he said of the recipients.) He is reviewing Smithsonian museums and exhibits “to assess tone, historical framing and alignment with American ideals.” He issued an executive order requiring that all future federal buildings eschew modernist architecture. He called in the National Guard to control Washington’s crime, and now its members, some with little to do, are spreading mulch in parks downtown. He has returned to earlier threats to investigate or exert control over television networks. After crowing over the cancellation of “The Late Show With Stephen Colbert,” whose host is an ardent critic, Mr. Trump vowed to investigate NBC over extending the contract of the late-night host Seth Meyers. (His contract was extended before Mr. Trump took office for the second time.) Golf buddies have also been given the benefit of the presidential bullhorn. Mr. Trump has demanded that Roger Clemens, the former major-league pitcher whose career was overshadowed by steroid suspicions, be elected to the Hall of Fame, “NOW.” (Mr. Clemens played golf with the president recently.) Turn off the television and he’ll turn up at your college football game talking about transgender people in sports. Try to do some doomscrolling on Instagram and there’s Sydney Sweeney, she of the “Good jeans” American Eagle ad. Mr. Trump proudly claimed recently that she is a registered Republican with the “HOTTEST” commercial going. Mute social media and he’ll be onstage at the Kennedy Center, praising the physique of Sylvester Stallone. Steven Levitsky, a professor of government at Harvard who studies authoritarianism and threats to democracies, said that Mr. Trump’s impulses have led to unprecedented attacks on American institutions, and that the early months of his term appear to have emboldened him. “We have a lot of muscle in American society,” Mr. Levitsky said. “It’s a very wealthy society and a lot of highly skilled lawyers, and it is well organized. The United States has the raw materials to push back. It’s just not doing it.” Mr. Levitsky predicted that Americans might be finding the cultural overreach into their homes and televisions and social media accounts “annoying.” But he said there was little to stop the president from continuing his disruptive cultural campaign. Mr. Trump’s criticisms and demands have evolved since he was a pop culture obsessive who lived on Twitter to comment on the news of the day. When he entered the White House, he used the presidential bully pulpit to attack a dizzying range of critics, from celebrities to former members of his first presidential administration. In some cases, the line between his political opponents living under mere threat of retaliation and those actually facing it is growing thinner. A number of former Trump administration officials whom Mr. Trump has considered insufficiently loyal have had their Secret Service details pulled, including Mike Pompeo, the former secretary of state, and Dr. Anthony S. Fauci, the former government scientist. They are part of a growing list of Democrats, including Vice President Kamala Harris, who’ve also had their details revoked. A number of other perceived enemies of Mr. Trump are facing investigations, including Lisa Cook, a Fed governor the president has accused of mortgage fraud. (She has not been charged with a crime.) Others have been threatened without evidence, including former President Barack Obama, whom Mr. Trump has accused of undermining his 2016 presidential campaign. Mr. Obama’s office called those claims a “weak attempt at distraction.” Even his old pop-culture Twitter foils have faced increasingly dark threats. Rosie O’Donnell, a longtime and very vocal Trump critic, is now living in Ireland. Mr. Trump has mused about revoking her American citizenship, which is unconstitutional. One former target who got off relatively easy was Taylor Swift, the pop star who recently announced her engagement to Travis Kelce of the Kansas City Chiefs. Ms. Swift did not endorse Mr. Trump, and he has attacked her before. This week, in the Cabinet Room of the White House, Mr. Trump magnanimously offered her good luck with her engagement. But not before pointedly wishing Mr. Kelce good luck.",
  "medium": "Article",
  "links": [
    "https://www.nytimes.com/by/ali-watkins",
    "https://www.nytimes.com/by/eric-schmitt",
    "https://www.nytimes.com/2025/08/27/us/politics/trump-sandwich-assault-indictment-justice-department.html",
    "https://www.nytimes.com/2025/08/25/us/politics/fbi-agent-assault-dc.html",
    "https://www.nytimes.com/2025/08/25/us/politics/pritzker-chicago-trump-national-guard.html",
    "https://www.nytimes.com/2025/03/26/us/politics/trump-elections-voting-executive-order.html",
    "https://chicityclerk.s3.us-west-2.amazonaws.com/s3fs-public-1/reports/EXECUTIVE%20ORDER%202025-6_0.pdf?VersionId=AcXfAhKkTWUaG9pc80.pAwo5rv4n6CAN",
    "https://www.pbs.org/newshour/politics/fact-checking-trumps-threat-to-take-away-rosie-odonnells-u-s-citizenship",
    "https://www.nytimes.com/by/miriam-jordan",
    "https://www.chicagopolice.org/wp-content/uploads/1_PDFsam_Week-33.pdf",
    "https://www.thedailybeast.com/donald-trump-79-struggles-to-walk-in-a-straight-line-at-golf-outing/",
    "https://www.nytimes.com/2025/03/25/us/politics/trump-elections-executive-order.html",
    "https://www.nytimes.com/by/sonia-a-rao",
    "https://truthsocial.com/@realDonaldTrump/posts/115120863399877029",
    "https://www.nytimes.com/by/katie-rogers",
    "https://www.nytimes.com/2025/08/18/us/politics/trump-mail-ballots-voting-machines-election.html",
    "https://www.nytimes.com/2025/08/29/us/immigration-guatemala-children.html",
    "https://www.nytimes.com/by/yan-zhuang",
    "https://www.nytimes.com/2025/06/13/us/politics/trump-voting-proof-of-citizenship.html",
    "https://www.nytimes.com/2025/08/28/us/politics/democratic-governors-trump-troops.html",
    "https://www.nytimes.com/by/maggie-haberman",
    "https://constitution.congress.gov/browse/article-1/section-4/",
    "https://www.nytimes.com/2025/08/29/us/politics/judge-fast-track-deportations.html?smid=nytcore-ios-share&referringSource=articleShare",
    "https://www.nytimes.com/2025/08/25/us/politics/trump-national-guard.html",
    "https://www.nytimes.com/2016/01/31/magazine/letter-of-recommendation-cracker-barrel.html",
    "https://www.nytimes.com/2025/08/29/us/federal-crackdown-washington-dc-arrest-data.html",
    "https://www.nytimes.com/2025/02/06/us/politics/trump-immigration-chicago-sanctuary.html"
  ],
  "labels": [
    {
      "name": "Feed"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Mr. Trump",
      "weight": 0.08513677
    },
    {
      "name": "President Trump",
      "weight": 0.072931446
    },
    {
      "name": "former Trump administration officials",
      "weight": 0.06950438
    },
    {
      "name": "Trump",
      "weight": 0.06881493
    },
    {
      "name": "federal elections",
      "weight": 0.0617006
    },
    {
      "name": "Federal law",
      "weight": 0.06108194
    },
    {
      "name": "federal law",
      "weight": 0.06108194
    },
    {
      "name": "federal immigration authorities",
      "weight": 0.060040098
    },
    {
      "name": "Mr. Pritzker",
      "weight": 0.059930217
    },
    {
      "name": "federal immigration enforcement efforts",
      "weight": 0.059926406
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.9873046875
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.8798828125
    },
    {
      "name": "/Law & Government/Military/Other",
      "score": 0.69873046875
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.640625
    },
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.322509765625
    }
  ],
  "sentiment": {
    "positive": 0.05306758,
    "negative": 0.7591586,
    "neutral": 0.18777382
  },
  "summary": "Homeland Security Secretary Kristi Noem defended the deployment of the National Guard in U.S. cities, stating that Los Angeles would not have stood if President Trump had not deployed troops to quell protests over federal immigration crackdowns. The comments were made on CBS's \"Face the Nation\" as Noem was pressed about plans to send federal forces into Chicago and other cities in Democratic-leaning states for law enforcement purposes. President Trump has directed the Defense Department to take a larger role in domestic law enforcement, inspired by the model for this move in Los Angeles. Noem also commented on comments by Gov. J.B. Pritzker of Illinois, who was one of 19 Democratic governors condemning the president's threat to send National Guard troops into major cities, said Noem had been \"inflaming passions\" and blamed him for not calling President Trump. Chicago's mayor, Brandon Johnson, has rejected the administration's plans to deploy troops or militarized federal agents to his city for immigration enforcement, and ordered local police officers not to aid the federal crackdown. The mayor's executive order, signed Saturday, steps up tensions between the White House and local officials.",
  "shortSummary": "Kristi Noem defends deploying the National Guard in U.S. cities, citing President Trump’s actions to quell civil unrest and tensions with local officials over federal immigration crackdowns.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "53ebe512a4a74a61abb273d3b2a5d2fa",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.nytimes.com/by/maggie-haberman",
      "text": "Noem defends deployment of the National Guard in U.S. cities.\nKristi Noem, the Homeland Security se\nBy Maggie Haberman\nI covered the 2024 presidential campaign, down ballot races, and the investigations into former President Donald J. Trump. Now I am covering his second term as president after his election win.\nI’m a New York City native and graduated from Sarah Lawrence College. My first reporting job was at the New York Post, where I started working as a clerk in 1996, followed by the New York Daily News and Politico, before joining The Times as a campaign reporter in 2015. I have covered five presidential elections, several governors’ races and New York City mayoral races. I covered Rudolph W. Giuliani’s second term at City Hall in New York, Hillary Clinton’s 2000 U.S. senate race, both of President Obama’s national campaigns, and the rebuilding at the World Trade Center site, among other topics.\nI am also the author of “Confidence Man: The Making of Donald Trump and the Breaking of America.”\nI was part of a team that won a Pulitzer Prize in 2018 for reporting on President Trump’s advisers and their connections to Russia. In 2021, I was part of a team that was a Pulitzer finalist for coverage of President Trump’s handling of the coronavirus.\nMaintaining journalistic independence is important for us at The Times, which has an extensive ethics policy. I strive to provide a fair and accurate report on every topic I’m covering. I strive for transparency in the news report itself and the reporting process, while balancing that with the importance of ensuring that the sources of confidential, sensitive information are able to speak freely, particularly as relates to investigations.\nI’d prefer to be contacted by email.\nEmail: maggie.haberman@nytimes.com\nX: @maggienyt\nAnonymous tips: nytimes.com/tips\nKristi Noem, the Homeland Security se\nBy Maggie Haberman\nThe mutually beneficial relationship between President Trump and Robert F. Kennedy Jr. is based on a striking alignment of some of their views.\nBy Zolan Kanno-Youngs and Maggie Haberman\nThe director, Susan Monarez, declined to fire agency leaders or to accept all recommendations from a vaccine advisory panel made over by Mr. Kennedy, according to people with knowledge of the events.\nBy Sheryl Gay Stolberg, Apoorva Mandavilli and Christina Jewett\nIt is not clear what country intercepted Mr. Bolton’s private emails, but the investigation into President Trump’s former national security adviser picked up momentum under the Biden administration.\nBy Devlin Barrett, Julian E. Barnes, Michael S. Schmidt, Glenn Thrush and Maggie Haberman\nThe meeting focused on the postwar future of the Gaza Strip, where Mr. Trump has mused about removing Palestinian residents and setting up a luxury resort.\nBy Maggie Haberman\nThe shooting was reported at Annunciation Catholic Church, which operates a school.\nBy Aimee Ortiz, Michael Levenson, Glenn Thrush and Chelsia Rose Marcius\nThe president’s Middle East envoy signaled that the war would be settled before the end of the year, but seemed to rule out a temporary truce.\nBy Aaron Boxerman\nThe president has praised Chinese students several times. But his policies are making it more difficult for students from China to come to the United States.\nBy Anemona Hartocollis\nPresident Trump, during his campaign for a second term, was accused of fraudulently inflating his net worth in order to get better rates on bank loans.\nBy Maggie Haberman\nIn the Oval Office, President Trump met his South Korean counterpart as the relationship between their countries has been strained.\nBy Maggie Haberman"
    },
    {
      "url": "https://www.nytimes.com/by/ali-watkins",
      "text": "Judge Temporarily Blocks U.S. Efforts to Deport Guatemalan Children\nMinors were removed from shelters overnight by immigration authorities. A hearing was scheduled for Sunday afternoon.\nBy Miriam Jordan and Ali Watkins\nI’m an investigative reporter by training, and now cover international news. I’m drawn to stories about people, especially ones involving crime, conflict and identity.\nI grew up in Fleetwood, Pa., a small town about an hour and a half outside of Philadelphia. I studied journalism at Temple University and wrote for the campus paper. In Washington I covered national security for McClatchy Newspapers, BuzzFeed News and Politico, and in 2017, I joined The Times where I covered national security from Washington, then moved to New York to cover the New York Police Department. I also wrote about the rural American west.\nI received my master’s in creative writing at the University in Galway, in Ireland, where I finished an investigative nonfiction book, “The Next One Is for You,” about Irish American gunrunning to the Provisional IRA. I’m now based in Belfast.\nAs a Times journalist, I am committed to upholding the standards of integrity outlined in our Ethical Journalism Handbook. I strive to make all of my work straightforward, accurate and fair. I try to report every story with empathy, honesty and transparency, and believe strongly in seeking out voices that are historically overlooked or left out of mainstream news coverage. I correct mistakes, and interrogate facts.\nEmail: ali.watkins@nytimes.com\nX: @AliWatkins\nAnonymous tips: nytimes.com/tips\nMinors were removed from shelters overnight by immigration authorities. A hearing was scheduled for Sunday afternoon.\nBy Miriam Jordan and Ali Watkins\nA G.O.P. effort to carve up a Democratic stronghold ignored the will of voters, a judge said. The ruling, which Republicans can appeal, makes the state another battleground in the national fight over redistricting.\nBy Ali Watkins\nAfter years on Broadway in behind-the-scenes jobs, he had transformed into an actor late in life, in films and on television shows including “The Good Wife” and “Rescue Me.”\nBy Alex Williams and Ali Watkins\nNostalgic fans of the interstate staple lamented the loss of its country kitsch, while some conservatives blamed “wokeness” for the sleek redesign.\nBy Ali Watkins\nNine others were treated for injuries after the early-morning shooting in the Crown Heights neighborhood, the police said.\nBy Maria Cramer, Chelsia Rose Marcius, Nate Schweber and Taylor Robinson\nNicholas Rossi lived for years as a fugitive before being extradited. A jury in Utah found him guilty of a 2008 sexual assault.\nBy Ali Watkins\nMr. Uribe, a presidential hopeful, was shot in June at a campaign rally in Bogotá in an attack that shocked the nation.\nBy Genevieve Glatsky and Julie Turkewitz\nRecord-setting rainfall caused intense flooding in and around the Milwaukee area starting on Saturday night.\nBy Dan Simmons and Ali Watkins\nA video showing the man casually walking across the Tomb of the Unknown Soldier beneath the Arc de Triomphe set off outrage in France.\nBy Ali Watkins\nRescuers have recovered the bodies of four miners and are searching for two more after an earthquake caused a partial collapse at El Teniente mine last week.\nBy Ali Watkins"
    },
    {
      "url": "https://www.thedailybeast.com/donald-trump-79-struggles-to-walk-in-a-straight-line-at-golf-outing/",
      "text": "President Donald Trump’s wobbly walk is in the spotlight again, with a video appearing to show the president struggling to move his legs with any fluidity.\nThe 79-year-old played golf with former Major League Baseball pitcher Roger Clemens and his son Kacy at Trump National Golf Club in Virginia on Saturday. A new bruise was spotted on his left hand after Kacy posted a video on Instagram, stoking concerns about the president’s health in the wake of another furor about the president’s cankles.\nThe video, which Kacy titled “A Day On the Course With the President,” features a compilation of clips from the Clemens’ Saturday golf outing, with footage of the group driving their golf carts, hitting the links, and walking between holes. At one point, Trump is seen walking alongside Roger with apparent difficulty, as he appears to drag his right leg behind him as he moves.\n“He’s dragging that right leg again, and he can’t walk in a straight line,” Ben Meiselas of MeidasTouch said, reviewing the video.\nTrump heads toward a set of steps, before the video cuts to a shot of him already at the bottom. The post, which Kacy captioned “Incredible day at Trump National Washington DC with The President, Donald Trump!,” was set to the song “I Won’t Back Down” by Tom Petty. In 2020, Petty’s family issued an official cease-and-desist letter to the Trump campaign after the late singer’s track was used at a rally.\nClemens’ social media post is the second time this month that Trump’s unsteady walk has been in the spotlight, after first making headlines following his summit with Russian President Vladimir Putin in Alaska on August 15.\nThe president was seen veering from left to right as he walked on a red carpet rolled out for the Kremlin dictator, unable to stay in its center, before reaching a set meeting point.\nThe footage also comes as bruises on Trump’s hands repeatedly generate headlines. “President Trump is a man of the people and he meets more Americans and shakes their hands on a daily basis than any other President in history. His commitment is unwavering and he proves that every single day,” White House Press Secretary Karoline Leavitt told the Daily Beast in a statement after she was quizzed about the new bruise.\nLeavitt first offered up the hand-shaking explanation back when the bruising was first spotted in February. Trump’s physician, Sean Barbabella, later expanded on Leavitt’s comment, explaining that the bruising “is consistent with minor soft tissue irritation from frequent handshaking and the use of aspirin, which is taken as part of a standard cardiovascular prevention regimen.”\nThe hand-shaking explanation has regularly been rolled out when Trump’s recurring bruising pops up on his right hand. The new mark, however, is on his left hand.\nAs has become the usual, Trump’s right hand was coated in makeup during Saturday’s golf outing. According to a game scorecard shared by Roger, Trump finished fourth out of four—a result that might have also bruised his ego.\n“President Trump is the most active and transparent president in American history,” White House spokesperson Liz Huston told the Daily Beast.\nMeanwhile, Joe Biden’s handlers covered up his mental decline for four years while they did everything in their power to destroy America.\""
    },
    {
      "url": "https://www.pbs.org/newshour/politics/fact-checking-trumps-threat-to-take-away-rosie-odonnells-u-s-citizenship",
      "text": "By — Maria Ramirez Uribe, PolitiFact Maria Ramirez Uribe, PolitiFact Leave your feedback Share Copy URL https://www.pbs.org/newshour/politics/fact-checking-trumps-threat-to-take-away-rosie-odonnells-u-s-citizenship Email Facebook Twitter LinkedIn Pinterest Tumblr Share on Facebook Share on Twitter Fact-checking Trump’s threat to take away Rosie O’Donnell’s U.S. citizenship Politics Updated on Jul 16, 2025 1:55 PM EDT — Published on Jul 15, 2025 10:01 AM EDT This article originally appeared on PolitiFact. CORRECTION: PolitiFact corrected the date of President Donald Trump’s post on Rose O’Donnell. President Donald Trump is threatening to strip people of their U.S. citizenship, including political foes, as his administration works to deport people from the country in mass numbers. On July 12, he said he was considering revoking comedian Rosie O’Donnell of her constitutional citizenship right — something no president can do. READ MORE: Trump says he’s considering ‘taking away’ comedian Rosie O’Donnell’s U.S. citizenship Trump has also threatened to rescind former White House adviser Elon Musk and New York City Democratic mayoral candidate Zohran Mamdani’s citizenship. Musk and Mamdani were born outside of the country and received U.S. citizenship through a legal process. The process of stripping them of citizenship is known as denaturalization. Unlike O’Donnell, who was born in the U.S., the government can strip naturalized citizens of their citizenship under limited circumstances and after a legal process. The Trump administration wants to pursue more of these cases, though political differences with Musk or Mamdani would not be grounds for denaturalization. Trump’s Justice Department issued a June memo directing attorneys to prioritize denaturalization cases. The memo’s list of priority categories included people who pose national security concerns and gang members and a catchall category for “any other cases referred to the Civil Division that the Division determines to be sufficiently important to pursue.” The memo does not apply to citizens born in the U.S. In 1967, the U.S. Supreme Court ruled that under the citizenship clause of the 14th Amendment, they may only lose their citizenship by voluntarily relinquishing it. “Once you have American citizenship, you have a constitutional entitlement to it,” said Eugene Volokh, a UCLA law professor. “If you like your American citizenship, you can keep your American citizenship — and that’s with the Supreme Court’s guarantee.” It’s not just Rosie O’Donnell. Trump cannot revoke the citizenship of a person born in the U.S. Protesters stand next to President Donald Trump’s star on the Hollywood Walk of Fame to denounce him for threatening to strip comedian Rosie O’Donnell of her citizenship, in Los Angeles on July 14, 2025. Photo by Daniel Cole/ Reuters In a July 12 Truth Social post, Trump said O’Donnell’s U.S. citizenship “is not in the best interests of our Great Country” and he called her a “Threat to Humanity.” O’Donnell moved to Ireland following Trump’s re-election and said she’s seeking Irish citizenship. (Her grandparents were born there.) Trump and O’Donnell have had a contentious relationship since 2006. O’Donnell has publicly criticized Trump and his policies, and Trump has insulted O’Donnell and her appearance. READ MORE: Judge in New Hampshire to pause Trump’s birthright citizenship plan, certify class action lawsuit Their disagreements have no bearing on her U.S. citizenship. The president cannot strip a U.S.-born person’s citizenship because of personal or political disagreements, legal experts said. “The Supreme Court has been very clear that native-born U.S. citizens cannot have their citizenship stripped by the government under any circumstances,” said Cassandra Burke Robertson, a Case Western Reserve University law professor who studies denaturalization. Robertson cited a 1958 U.S. Supreme Court case involving a U.S.-born soldier who escaped from a U.S. Army enclosement in Morocco before surrendering to the U.S. Army the next day. The soldier was dishonorably discharged and stripped of his U.S. citizenship. The Supreme Court ruled that it was unconstitutional to strip the U.S. soldier of his citizenship, calling it a “a form of punishment more primitive than torture.” U.S.-born citizens can voluntarily renounce their U.S. citizenship. According to immigration law, there are certain acts a U.S. citizen can take that when “performed voluntarily and with the intention of relinquishing U.S. nationality” may lead to a loss of U.S. citizenship. These acts include serving in the armed forces of another country “engaged in hostilities against the United States,” accepting employment with a foreign government if it requires a declaration of allegiance to that country or formally renouncing U.S. citizenship at a consulate. Being convicted of treason against the U.S. or attempting to overthrow the U.S. government by force, if those acts were done with the intention of relinquishing U.S. citizenship, can also lead to a loss of citizenship for U.S. born people. How naturalized U.S. citizens can lose their U.S. citizenship Elon Musk speaks with then-President-elect Donald Trump and guests at a viewing of the launch of the sixth test flight of the SpaceX Starship, in Brownsville, Texas, on Nov. 19, 2024. File photo by Brandon Bell/ Pool via Reuters Though limited, there are two ways naturalized U.S. citizens can lose their citizenship. Neither method lets the president revoke citizenship based on political differences. Trump said he would “have to take a look” when asked whether he would consider denaturalizing Musk, who feuded with Trump over his signature spending bill. Musk was born in South Africa and became a U.S. citizen in 2002. Trump also baselessly questioned Mamdani’s citizenship saying, “A lot of people are saying he’s here illegally,” and asserting his administration would “look at everything.” Mamdani, who was born in Uganda, became a U.S. citizen in 2018. Rep. Andy Ogles, R-Tenn., called for the Justice Department to initiate denaturalization proceedings against Mamdani. The executive branch cannot denaturalize people, Michelle Mittelstadt, communications director for the nonpartisan Migration Policy Institute, said. “Denaturalization is exceedingly rare and has occurred for people who concealed information of war crimes, Nazi membership, criminal histories, or immigration fraud such as using a stolen identity,” she said. The U.S. government can charge people with naturalization fraud, meaning they secured their citizenship through fraud or wilful misrepresentation or they didn’t meet eligibility requirements. If convicted, a person’s citizenship is automatically revoked. WATCH: A look at the split in Trump’s base over the Epstein files These are criminal cases in which defendants are entitled to an attorney, Robertson said. There’s a 10-year statute of limitations and the government has the burden of proof beyond a reasonable doubt, she said. The second way the government can seek to denaturalize a person is through a civil action. In these cases, the government says the person “illegally procured” citizenship, meaning they didn’t meet eligibility requirements. This process, which is more commonly used by the government, “lacks many constitutional protections,” Robertson said. People don’t have the right to a court appointed lawyer, there’s no statute of limitation, no jury trial, and a lower burden of proof. The Justice Department’s June memo calls for these types of procedures. PolitiFact chief correspondent Louis Jacobson contributed to this report. We're not going anywhere. Stand up for truly independent, trusted news that you can count on! Donate now By — Maria Ramirez Uribe, PolitiFact Maria Ramirez Uribe, PolitiFact\nThis article originally appeared on PolitiFact. CORRECTION: PolitiFact corrected the date of President Donald Trump’s post on Rose O’Donnell. President Donald Trump is threatening to strip people of their U.S. citizenship, including political foes, as his administration works to deport people from the country in mass numbers. On July 12, he said he was considering revoking comedian Rosie O’Donnell of her constitutional citizenship right — something no president can do. READ MORE: Trump says he’s considering ‘taking away’ comedian Rosie O’Donnell’s U.S. citizenship Trump has also threatened to rescind former White House adviser Elon Musk and New York City Democratic mayoral candidate Zohran Mamdani’s citizenship. Musk and Mamdani were born outside of the country and received U.S. citizenship through a legal process. The process of stripping them of citizenship is known as denaturalization. Unlike O’Donnell, who was born in the U.S., the government can strip naturalized citizens of their citizenship under limited circumstances and after a legal process. The Trump administration wants to pursue more of these cases, though political differences with Musk or Mamdani would not be grounds for denaturalization. Trump’s Justice Department issued a June memo directing attorneys to prioritize denaturalization cases. The memo’s list of priority categories included people who pose national security concerns and gang members and a catchall category for “any other cases referred to the Civil Division that the Division determines to be sufficiently important to pursue.” The memo does not apply to citizens born in the U.S. In 1967, the U.S. Supreme Court ruled that under the citizenship clause of the 14th Amendment, they may only lose their citizenship by voluntarily relinquishing it. “Once you have American citizenship, you have a constitutional entitlement to it,” said Eugene Volokh, a UCLA law professor. “If you like your American citizenship, you can keep your American citizenship — and that’s with the Supreme Court’s guarantee.” It’s not just Rosie O’Donnell. Trump cannot revoke the citizenship of a person born in the U.S. Protesters stand next to President Donald Trump’s star on the Hollywood Walk of Fame to denounce him for threatening to strip comedian Rosie O’Donnell of her citizenship, in Los Angeles on July 14, 2025. Photo by Daniel Cole/ Reuters In a July 12 Truth Social post, Trump said O’Donnell’s U.S. citizenship “is not in the best interests of our Great Country” and he called her a “Threat to Humanity.” O’Donnell moved to Ireland following Trump’s re-election and said she’s seeking Irish citizenship. (Her grandparents were born there.) Trump and O’Donnell have had a contentious relationship since 2006. O’Donnell has publicly criticized Trump and his policies, and Trump has insulted O’Donnell and her appearance. READ MORE: Judge in New Hampshire to pause Trump’s birthright citizenship plan, certify class action lawsuit Their disagreements have no bearing on her U.S. citizenship. The president cannot strip a U.S.-born person’s citizenship because of personal or political disagreements, legal experts said. “The Supreme Court has been very clear that native-born U.S. citizens cannot have their citizenship stripped by the government under any circumstances,” said Cassandra Burke Robertson, a Case Western Reserve University law professor who studies denaturalization. Robertson cited a 1958 U.S. Supreme Court case involving a U.S.-born soldier who escaped from a U.S. Army enclosement in Morocco before surrendering to the U.S. Army the next day. The soldier was dishonorably discharged and stripped of his U.S. citizenship. The Supreme Court ruled that it was unconstitutional to strip the U.S. soldier of his citizenship, calling it a “a form of punishment more primitive than torture.” U.S.-born citizens can voluntarily renounce their U.S. citizenship. According to immigration law, there are certain acts a U.S. citizen can take that when “performed voluntarily and with the intention of relinquishing U.S. nationality” may lead to a loss of U.S. citizenship. These acts include serving in the armed forces of another country “engaged in hostilities against the United States,” accepting employment with a foreign government if it requires a declaration of allegiance to that country or formally renouncing U.S. citizenship at a consulate. Being convicted of treason against the U.S. or attempting to overthrow the U.S. government by force, if those acts were done with the intention of relinquishing U.S. citizenship, can also lead to a loss of citizenship for U.S. born people. How naturalized U.S. citizens can lose their U.S. citizenship Elon Musk speaks with then-President-elect Donald Trump and guests at a viewing of the launch of the sixth test flight of the SpaceX Starship, in Brownsville, Texas, on Nov. 19, 2024. File photo by Brandon Bell/ Pool via Reuters Though limited, there are two ways naturalized U.S. citizens can lose their citizenship. Neither method lets the president revoke citizenship based on political differences. Trump said he would “have to take a look” when asked whether he would consider denaturalizing Musk, who feuded with Trump over his signature spending bill. Musk was born in South Africa and became a U.S. citizen in 2002. Trump also baselessly questioned Mamdani’s citizenship saying, “A lot of people are saying he’s here illegally,” and asserting his administration would “look at everything.” Mamdani, who was born in Uganda, became a U.S. citizen in 2018. Rep. Andy Ogles, R-Tenn., called for the Justice Department to initiate denaturalization proceedings against Mamdani. The executive branch cannot denaturalize people, Michelle Mittelstadt, communications director for the nonpartisan Migration Policy Institute, said. “Denaturalization is exceedingly rare and has occurred for people who concealed information of war crimes, Nazi membership, criminal histories, or immigration fraud such as using a stolen identity,” she said. The U.S. government can charge people with naturalization fraud, meaning they secured their citizenship through fraud or wilful misrepresentation or they didn’t meet eligibility requirements. If convicted, a person’s citizenship is automatically revoked. WATCH: A look at the split in Trump’s base over the Epstein files These are criminal cases in which defendants are entitled to an attorney, Robertson said. There’s a 10-year statute of limitations and the government has the burden of proof beyond a reasonable doubt, she said. The second way the government can seek to denaturalize a person is through a civil action. In these cases, the government says the person “illegally procured” citizenship, meaning they didn’t meet eligibility requirements. This process, which is more commonly used by the government, “lacks many constitutional protections,” Robertson said. People don’t have the right to a court appointed lawyer, there’s no statute of limitation, no jury trial, and a lower burden of proof. The Justice Department’s June memo calls for these types of procedures. PolitiFact chief correspondent Louis Jacobson contributed to this report. We're not going anywhere. Stand up for truly independent, trusted news that you can count on! Donate now"
    },
    {
      "url": "https://www.nytimes.com/by/katie-rogers",
      "text": "From Cracker Barrel to Sydney Sweeney, Trump Has an Opinion to Share\nIn his second term, President Trump is using his power to reshape American culture, not just American policy. He has threatened consequences for many who disagree.\nBy Katie Rogers\nI’m one of several reporters at The Times who cover the White House, a role I’ve had since 2018. I covered President Trump's first term and President Biden’s term.\nI am drawn to stories that give readers a better understanding of the inner lives of presidents and the people around them — how a key event, a shared history or a past failure can inform the decisions of the most powerful people in the world. That curiosity has driven my coverage across a range of stories, from foreign policy to the complicated dynamics of first families.\nI joined The Times in 2014 as a reporter covering breaking news. Before that, I worked at The Guardian, The Washington Post and at my hometown paper in Elkhart, Ind. I graduated from Loyola University Chicago and have a master’s degree from Northwestern.\nI am the author of “American Woman: The Transformation of the Modern First Lady, from Hillary Clinton to Jill Biden.”\nMaintaining journalistic independence is important for every journalist at The Times, which has an extensive ethics policy.\nI want all of my work to be accurate and fair, and I make every effort to understand a story from multiple viewpoints. I protect my sources and work hard to build and keep their trust.\nI do not accept gifts, money or favors from anyone who might figure into my reporting. I do not participate in politics, nor do I make political donations. When I am working, I always identify myself as a reporter for The Times.\nEmail: katie.rogers@nytimes.com\nX: @katierogers\nInstagram: @katienyt\nThreads: @katienyt\nAnonymous tips: nytimes.com/tips\nIn his second term, President Trump is using his power to reshape American culture, not just American policy. He has threatened consequences for many who disagree.\nBy Katie Rogers\nAs hours ticked by, President Trump played reality television host — “This has never been done before!” — as his cabinet members offered praise. It was a glimpse of how he runs his presidency.\nBy Katie Rogers\nSecretary of State Marco Rubio and Steve Witkoff, an envoy for President Trump, suggested that a peace deal was still distant.\nBy Katie Rogers and Carol Rosenberg\nThe papers, laying out the sequence of events and including the phone numbers of several officials, were found around 9 a.m. on Friday and sent to NPR by a guest of the hotel.\nBy Katie Rogers\nPresident Trump gave President Vladimir Putin a warm public reception, effectively ending his diplomatic isolation over the past three years for his invasion of Ukraine. But Mr. Putin did not agree to stop the war.\nBy Peter Baker and Katie Rogers\nPresident Trump clapped for his guest, Vladimir V. Putin, as he stepped off the plane. But their visit ended with little but an agreement to see each other again — perhaps, Mr. Putin said, “in Moscow?”\nBy Katie Rogers\nThis was featured in live coverage.\nBy Katie Rogers, David E. Sanger, Peter Baker, Ivan Nechepurenko and Constant Méheut\nPlus, your Friday news quiz.\nBy Tracy Mumford, Will Jarvis, Ian Stewart, Jessica Metzger and Katie Rogers\nThe Army expects up to 200 soldiers out on the capital’s streets within the next few days at any given time in support of federal law enforcement.\nBy Nicholas Bogel-Burroughs, Darren Sands and Ashley Ahn\nHours after presenting a united front with allies, President Trump warned Vladimir V. Putin of “severe consequences” if Russia refuses to end the war in Ukraine. But he also suggested that he has limited power to alter the Russian leader’s behavior.\nBy Katie Rogers"
    },
    {
      "url": "https://www.nytimes.com/by/miriam-jordan",
      "text": "Judge Temporarily Blocks U.S. Efforts to Deport Guatemalan Children\nMinors were removed from shelters overnight by immigration authorities. A hearing was scheduled for Sunday afternoon.\nBy Miriam Jordan and Ali Watkins\nI cover lawful and unlawful immigration. This means that I report on people who arrive in the United States with visas to work, study and find refuge, as well as those who cross the border without authorization, many of them fleeing extreme weather or violence or seeking a chance to work and escape economic hardships in their homelands.\nMy coverage takes me frequently to the U.S.-Mexico border. It also takes me across the country, to places like Northwest Arkansas, where Indian computer programmers develop software for Walmart; the fields of California, Florida and Georgia, where undocumented farmworkers toil; and Louisville, Ky., home to the country’s fastest-growing Cuban community. I rode a Greyhound bus from Arizona to Tennessee to report on the mass movement of migrant families.\nAmong my areas of interest are the changing composition of the migrant population, the broken asylum system, refugee resettlement and DACA, the program that offers deportation protection and work permits to hundreds of thousands of undocumented young adults.\nBefore joining The Times in 2017, I worked at Reuters and The Wall Street Journal, where I was a Gerald Loeb Award finalist for my work on stories about “the moral, legal and economic dilemmas of illegal immigration.” I have been a correspondent in the Middle East, Asia and Latin America, focusing on poverty, public health and gender issues.\nI earned an undergraduate degree from Stanford University and a graduate degree in journalism from Columbia University. I speak Portuguese, Spanish, French and Hebrew. I was born in Brooklyn and spent my first nine years in different parts of the country, including Ames, Iowa; Houston; and New Orleans. I later lived in São Paulo and Rio de Janeiro, where I finished high school.\nI strive to understand issues deeply, and to report impartially. I do not participate in politics, nor do I make political donations. You can learn more about The Times’s ethics policy here.\nPlease feel free to contact me with tips and story ideas.\nX: @mirjordan\nWhatsApp: NYT tips, or DM to contact me\nSignal: NYT tips, or DM to contact me\nAnonymous tips: nytimes.com/tips\nMinors were removed from shelters overnight by immigration authorities. A hearing was scheduled for Sunday afternoon.\nBy Miriam Jordan and Ali Watkins\nThe children, who crossed the border as unaccompanied minors, are being kept in shelters. Experts said the move raised troubling legal questions.\nBy Jody García, Miriam Jordan and Jazmine Ulloa\nAn analysis of census data by the Pew Research Center found that between January and June, the foreign-born population declined by nearly 1.5 million.\nBy Miriam Jordan\nSpringfield faced a crisis after Donald Trump falsely claimed Haitians were eating pets. Now his policies are driving out workers like Wilford Rinvil, who left for Canada.\nBy Miriam Jordan\nCourt-mandated oversight will remain in place for migrant children in custody. Lawyers have reported poor medical care and lack of sunlight and showers.\nBy Miriam Jordan\nAn appellate panel upheld a finding that federal agents appeared to rely exclusively on race and other factors, such as speaking Spanish, in making arrests.\nBy Miriam Jordan and Tim Arango\nA federal judge temporarily halted the administration from making indiscriminate arrests based on race and denying detainees access to lawyers, in a lawsuit that could have national repercussions.\nBy Miriam Jordan\nDuring an immigration raid on Thursday, a worker fell from a greenhouse at a cannabis farm. A farmworkers union had initially said the worker died on Friday, but a lawyer for the family said the death occurred Saturday afternoon.\nBy Miriam Jordan and Jonathan Wolfe\nThe tech giant has quietly shed warehouse employees whose work authorizations were revoked after the Trump administration ended a Biden-era immigration program.\nBy Miriam Jordan and Karen Weise\nThe latest networks of volunteers are hyperlocal and focused on responding to federal actions. As the crackdown becomes more intense, so could confrontations.\nBy Jazmine Ulloa and Miriam Jordan"
    },
    {
      "url": "https://www.nytimes.com/by/eric-schmitt",
      "text": "I write about U.S. national security, with a particular focus on U.S. military affairs and counterterrorism issues overseas. I have written extensively on security matters in the Middle East, South Asia, Africa and Europe.\nMy Background\nI have been a reporter at The New York Times for 40 years — starting as a news assistant and working my way up to cover the U.S. military, counterterrorism and other national security issues for more than three decades. I have covered every conflict involving the U.S. military since the 1991 Persian Gulf war, and reported extensively from Iraq, Afghanistan, Africa and the Middle East. I have shared four Pulitzer Prizes. I got my start reporting on local education at the Tri-City Herald in Kennewick, Wash.\nI am the co-author of “Counterstrike: The Untold Story of America’s Secret Campaign Against Al Qaeda.” I earned a bachelor’s degree in political science from Williams College, studied in Madrid for a year and was a journalism fellow at Stanford University. I was born in Minneapolis and reared in the San Francisco Bay Area.\nJournalistic Ethics\nKeeping my sources protected is a top priority for me, especially during sensitive or high-risk stories. I strive to be accurate and fair in my coverage, no matter what the subject. And, like all Times journalists, I follow the standards in our Ethical Journalism Handbook.\nI don’t back away from difficult stories, and will give subjects a chance to comment and express their side of a story.\nI do not participate in politics, nor do I make political donations. I am always careful to identify myself as a reporter for The Times in news-related conversations.\nJeanine Pirro, the U.S. attorney for Washington, also deflected criticism of a case in which her office was unable to obtain an indictment against a man who threw a sandwich at a federal agent.\nAn executive order released on Monday directs the creation of specialized Guard units to quell civil disturbances in each state and seeks civilian volunteers to assist federal agents in Washington.\nThe move comes weeks after the agency drafted a preliminary report contradicting President Trump’s contention that U.S. strikes had “obliterated” nuclear sites in Iran.\nThe Pentagon provided few details about the operation. But counterterrorism raids — as opposed to airstrikes — typically involve helicopter-borne commandos."
    },
    {
      "url": "https://www.nytimes.com/by/sonia-a-rao",
      "text": "I report on disability for The New York Times as a member of the 2025-26 Times Fellowship class, a program for early-career journalists.\nWhat I Cover\nI write about disability issues across the country. I also cover general assignment stories and breaking news.\nI am eager to hear what you would like to read in The Times about America’s large and diverse disability community. What is our coverage missing? Do you have a personal story to share? Please send me your thoughts.\nMy Background\nI have reported on many different beats for newsrooms around the world. Most recently, I was a reporter for Reuters as part of its East Africa bureau based in Nairobi, Kenya. I have worked for regional newspapers in Florida, Texas, Virginia and North Carolina, where I covered breaking news, education, local government and business. I spent a semester in college writing about human rights for a nonprofit news outlet in Cape Town, South Africa.\nI am a member of the Asian American Journalists Association and the Overseas Press Club of America.\nI am a proud North Carolinian. I was born and raised just outside of Raleigh, N.C. I graduated from the University of North Carolina at Chapel Hill, where I studied journalism and history.\nJournalistic Ethics\nLike all Times journalists, I share the values and adhere to the standards of integrity outlined in our Ethical Journalism Handbook. I make every effort to understand issues from multiple angles. I want all of my work to be accurate and fair. I protect my sources. When I am working, I identify myself as a reporter for The Times.\nContact Me"
    },
    {
      "url": "https://www.nytimes.com/by/yan-zhuang",
      "text": "Trump Says He Will Sign Executive Order Mandating Voter I.D.\nHe also wants to restrict mail-in voting and allow only paper ballots. The Constitution doesn’t give the president explicit authority over election law.\nBy Yan Zhuang\nI work for the Express team at The Times, a department with staff on three continents tasked with jumping on breaking news. I write about news from around the world that happens while readers are asleep in the United States, as well as stories that are just fun, trending, quirky and thought-provoking.\nI graduated from the University of Melbourne with a Bachelor of Arts and got my start in journalism at The Age newspaper in Melbourne. I joined The Times’s Australia bureau in 2020, covering breaking news, features and the occasional slice of life story, before moving to the Seoul bureau in 2024. I speak English and Mandarin.\nMy work is governed by The Times’s ethics policy, and by a commitment to writing with accuracy, fairness, empathy and nuance. I protect my sources. I make every effort to understand issues from multiple angles. When I am working, I always identify myself as a reporter for The Times.\nEmail: yan.zhuang@nytimes.com\nX: @yanzhuang25\nHe also wants to restrict mail-in voting and allow only paper ballots. The Constitution doesn’t give the president explicit authority over election law.\nBy Yan Zhuang\nThe group in Southern California stole goods worth millions of dollars since January, officials said. Nine people were charged this week over the thefts.\nBy Yan Zhuang\nRestrictions on pigeon feeding in India’s largest city prompted a backlash from a religious community that believes in nonviolence against all creatures.\nBy Suhasini Raj and Yan Zhuang\nMs. Cook said that she would not resign from the Board of Governors, hours after President Trump announced he was firing her.\nBy Yan Zhuang\nThe walls of dust, known as haboobs, came after intense thunderstorms in the area. A brief ground stop at Sky Harbor International Airport was lifted on Monday evening.\nBy Yan Zhuang and Nazaneen Ghaffar\nOfficials on Hainan Island, China’s only tropical beach destination, halted public transportation. Businesses were closed in Sanya, a popular resort city on the island.\nBy Yan Zhuang\nTwo sailors sustained minor injuries, the Navy said, adding that the ship’s crew will remain on board in Okinawa.\nBy Yan Zhuang\nBeaches along the New Jersey coast and in Delaware were closed Tuesday as the powerful storm churned in the Atlantic. New York City announced its beaches would close on Wednesday and Thursday.\nBy Taylor Robinson and Mike Ives\nThe Humanoid Robot Games in Beijing — featuring running, kickboxing and soccer — highlighted advancements in robotics. Limitations, too.\nBy Yan Zhuang\nA man opened fire on the sheriff’s deputies, wounding them with shrapnel, as they served warrants, officials said.\nBy Yan Zhuang"
    }
  ],
  "argos_summary": "Kristi Noem defended President Trump’s deployment of the National Guard to quell protests in Los Angeles and is advocating similar moves in Chicago and other Democratic‑leaning cities. Trump has directed the Defense Department to take a larger role in domestic law enforcement, citing the LA deployment as a model. Chicago Mayor Brandon Johnson has issued an executive order rejecting federal troop deployment and demanding local police not assist, citing constitutional rights. The debate highlights tensions between federal authority and local autonomy over civil unrest.",
  "argos_id": "DNQRVPIRR"
}