{
  "url": "https://www.newsmax.com/world/globaltalk/artificial-intelligence-ai-music-suno-udio/2025/08/31/id/1224577/",
  "authorsByline": "KELVIN CHAN",
  "articleId": "1e2dc00855df4c44b106b1a5c9050ed6",
  "source": {
    "domain": "newsmax.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "FL",
      "county": "Palm Beach County",
      "city": "Boca Raton",
      "coordinates": {
        "lat": 26.3586885,
        "lon": -80.0830984
      }
    }
  },
  "imageUrl": "",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-31T10:01:33-04:00",
  "addDate": "2025-08-31T14:16:52.870844+00:00",
  "refreshDate": "2025-08-31T14:16:52.870848+00:00",
  "score": 1.0,
  "title": "The Success of AI Music Creators Sparks Debate on Future of Music Industry",
  "description": "When pop groups and rock bands practice or perform, they rely on their guitars, keyboards and drumsticks to make music. Oliver McCann, a British AI music creator who goes by the stage name imoliver, fires up his chatbot. McCann's songs span a range of genres, from indiepop...",
  "content": "LONDON (AP) — When pop groups and rock bands practice or perform, they rely on their guitars, keyboards and drumsticks to make music. Oliver McCann, a British AI music creator who goes by the stage name imoliver, fires up his chatbot.\n\nMcCann's songs span a range of genres, from indie-pop to electro-soul to country-rap. There’s just one crucial difference between McCann and traditional musicians.\n\n“I have no musical talent at all,” he said. “I can’t sing, I can’t play instruments, and I have no musical background at all.\"\n\nMcCann, 37, who has a background as a visual designer, started experimenting with AI to see if it could boost his creativity and \"bring some of my lyrics to life.” Last month, he signed with independent record label Hallwood Media after one of his tracks racked up 3 million streams, in what's billed as the first time a music label has inked a contract with an AI music creator.\n\nMcCann is an example of how ChatGPT-style AI song generation tools like Suno and Udio have spawned a wave of synthetic music. A movement most notably highlighted by a fictitious group, Velvet Sundown, that went viral even though all its songs, lyrics and album art were created by AI.\n\nIt fueled debate about AI's role in music while raising fears about \"AI slop\" — automatically generated low quality mass produced content. It also cast a spotlight on AI song generators that are democratizing song making but threaten to disrupt the music industry.\n\nExperts say generative AI is set to transform the music world. However, there are scant details, so far, on how it's impacting the $29.6 billion global recorded music market, which includes about $20 billion from streaming.\n\nThe most reliable figures come from music streaming service Deezer, which estimates that 18% of songs uploaded to its platform every day are purely AI generated, though they only account for a tiny amount of total streams, hinting that few people are actually listening. Other, bigger streaming platforms like Spotify haven't released any figures on AI music.\n\nUdio declined to comment on how many users it has and how many songs it has generated. Suno did not respond to a request for comment. Both have free basic levels as well as pro and premium tiers that come with access to more advanced AI models.\n\n“It’s a total boom. It’s a tsunami,” said Josh Antonuccio, director of Ohio University's School of Media Arts and Studies. The amount of AI generated music “is just going to only exponentially increase” as young people grow up with AI and become more comfortable with it, he said.\n\nYet generative AI, with its ability to spit out seemingly unique content, has divided the music world, with musicians and industry groups complaining that recorded works are being exploited to train AI models that power song generation tools.\n\nRecord labels are trying to fend off the threat that AI music startups pose to their revenue streams even as they hope to tap into it for new earnings, while recording artists worry that it will devalue their creativity.\n\nThree major record companies, Sony Music Entertainment, Universal Music Group and Warner Records, filed lawsuits last year against Suno and Udio for copyright infringement. In June, the two sides also reportedly entered negotiations that could go beyond settling the lawsuits and set rules for how artists are paid when AI is used to remix their songs.\n\nGEMA, a German royalty collection society, has sued Suno, accusing it of generating music similar to songs like “Mambo No. 5” by Lou Bega and “Forever Young” by Alphaville.\n\nMore than 1,000 musicians, including Kate Bush, Annie Lennox and Damon Albarn, released a silent album to protest proposed changes to U.K. laws on AI they fear would erode their creative control. Meanwhile, other artists, such as will.i.am, Timbaland and Imogen Heap, have embraced the technology.\n\nSome users say the debate is just a rehash of old arguments about once-new technology that eventually became widely used, such as AutoTune, drum machines and synthesizers.\n\nPeople complain “that you’re using a computer to do all the work for you. I don’t see it that way. I see it as any other tool that we have,” said Scott Smith, whose AI band, Pulse Empire, was inspired by 1980s British synthesizer-driven groups like New Order and Depeche Mode.\n\nSmith, 56 and a semi-retired former U.S. Navy public affairs officer in Portland, Oregon, said “music producers have lots of tools in their arsenal” to enhance recordings that listeners aren't aware of.\n\nLike McCann, Smith never mastered a musical instrument. Both say they put lots of time and effort into crafting their music.\n\nOnce Smith gets inspiration, it takes him just 10 minutes to write the lyrics. But then he'll spend as much as eight to nine hours generating different versions until the song “matches my vision.”\n\nMcCann said he'll often create up to 100 different versions of a song by prompting and re-prompting the AI system before he’s satisfied.\n\nAI song generators can churn out lyrics as well as music, but many experienced users prefer to write their own words.\n\n“AI lyrics tend to come out quite cliche and quite boring,” McCann said.\n\nLukas Rams, a Philadelphia-area resident who makes songs for his AI band Sleeping With Wolves, said AI lyrics tend to be “extra corny” and not as creative as a human, but can help get the writing process started.\n\n“It’ll do very basic rhyme schemes, and it’ll keep repeating the same structure,” said Rams, who writes his own words, sometimes while putting his kids to bed and waiting for them to fall asleep. “And then you’ll get words in there that are very telling of AI-generated lyrics, like ‘neon,’ anything with ‘shadows’.”\n\nRams used to play drums in high school bands and collaborated with his brother on their own songs, but work and family life started taking up more of his time.\n\nThen he discovered AI, which he used to create three albums for Sleeping With Wolves. He's been taking it seriously, making a CD jewel case with album art. He plans to post his songs, which combine metalcore and EDM, more widely online.\n\n“I do want to start putting this up on YouTube or socials or distribution or whatever, just to have it out there,” Rams said. “I might as well, otherwise I’m literally the only person that hears this stuff.”\n\nExperts say AI's potential to let anyone come up with a hit song is poised to shake up the music industry's production pipeline.\n\n\"Just think about what it used to cost to make a hit or make something that breaks,\" Antonuccio said. \"And that just keeps winnowing down from a major studio to a laptop to a bedroom. And now it’s like a text prompt — several text prompts.”\n\nBut he added that AI music is still in a “Wild West” phase because of the lack of legal clarity over copyright. He compared it to the legal battles more than two decades ago over file-sharing sites like Napster that heralded the transition from CDs to digital media and eventually paved the way for today's music streaming services.\n\nCreators hope AI, too, will eventually become a part of the mainstream music world.\n\n“I think we’re entering a world where anyone, anywhere could make the next big hit,” said McCann. “As AI becomes more widely accepted among people as a musical art form, I think it opens up the possibility for AI music to be featured in charts.”",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "AI Music Creators",
      "weight": 0.09872368
    },
    {
      "name": "AI generated music",
      "weight": 0.097006015
    },
    {
      "name": "AI music",
      "weight": 0.09584086
    },
    {
      "name": "AI song generators",
      "weight": 0.09083375
    },
    {
      "name": "AI music startups",
      "weight": 0.08983057
    },
    {
      "name": "Music Industry",
      "weight": 0.08287621
    },
    {
      "name": "music",
      "weight": 0.0815859
    },
    {
      "name": "AI lyrics",
      "weight": 0.08051347
    },
    {
      "name": "music producers",
      "weight": 0.07925175
    },
    {
      "name": "synthetic music",
      "weight": 0.07878416
    }
  ],
  "topics": [
    {
      "name": "Music"
    },
    {
      "name": "AI"
    }
  ],
  "categories": [
    {
      "name": "World"
    },
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.560546875
    },
    {
      "name": "/Arts & Entertainment/Music & Audio/Music Reference",
      "score": 0.5009765625
    },
    {
      "name": "/News/Technology News",
      "score": 0.447265625
    },
    {
      "name": "/Arts & Entertainment/Music & Audio/Rock Music",
      "score": 0.423828125
    },
    {
      "name": "/Arts & Entertainment/Music & Audio/Pop Music",
      "score": 0.30908203125
    },
    {
      "name": "/Arts & Entertainment/Music & Audio/Other",
      "score": 0.30712890625
    }
  ],
  "sentiment": {
    "positive": 0.1401594,
    "negative": 0.4429315,
    "neutral": 0.41690913
  },
  "summary": "British AI music creator, Oliver McCann, who goes by the stage name imoliver, started experimenting with AI to increase his creativity and bring some of his lyrics to life. Last month, he signed with independent record label Hallwood Media after one of his tracks received 3 million streams. This is the first time a music label has signed a contract with an AI creator for their tracks. The success of these artists has sparked debate about AI's role in music and raised fears about \"AI slop\" - automatically generated low quality mass produced content. However, experts predict that generative AI is set to transform the music industry, with 18% of songs uploaded to Deezer estimated to be purely AI generated daily, suggesting few people are listening to these songs. Record labels are trying to protect their revenue streams from AI startups, while artists fear it will devalue their creativity. Three major record companies, Sony Music Entertainment, Universal Music Group and Warner Records, filed lawsuits last year against Suno and Udio for copyright infringement.",
  "shortSummary": "AI music creators like Oliver McCann have transformed music by creating unique, original songs for commercial audiences, sparking debate on its potential impact on traditional musicians' creativity and revenue.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "d0ccd46b0b3e4c1da3e776670c86ad68",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "British AI music creator imoliver, who has no musical background, signed with Hallwood Media after a track hit 3 million streams, marking the first label contract for an AI-generated artist. His work exemplifies a surge in synthetic music from tools like Suno and Udio, sparking debate over quality, copyright, and industry disruption. Major labels have sued AI platforms for infringement, while some artists embrace the technology, and the market remains uncertain as streaming services report only a small share of AI‑generated songs. The rise of AI composition could democratize hit‑making but also threatens traditional revenue streams and creative control.",
  "argos_id": "F1S4V4LC5"
}