{
  "url": "https://www.gamesradar.com/games/action-rpg/i-built-a-home-and-ran-a-business-in-kingdom-come-deliverance-2s-next-dlc-and-the-added-role-playing-guarantees-ill-spend-another-70-hours-in-my-current-game-of-the-year/",
  "authorsByline": "Andrew Brown",
  "articleId": "5b9f24d74c0f4d7aafac87f52545e076",
  "source": {
    "domain": "gamesradar.com",
    "paywall": false,
    "location": null
  },
  "imageUrl": "https://cdn.mos.cms.futurecdn.net/5niFzK94wjuM5ayKzUkDFT.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-31T18:00:00+00:00",
  "addDate": "2025-08-31T18:09:37.170711+00:00",
  "refreshDate": "2025-08-31T18:09:37.170714+00:00",
  "score": 1.0,
  "title": "I built a home and ran a business in Kingdom Come: Deliverance 2's next DLC, and the added role-playing guarantees I'll spend another 70 hours in my current game of the year",
  "description": "Gamescom 2025",
  "content": "While Henry goes through several abodes in Kingdom Come: Deliverance 2, none of them quite feel like home. But Warhorse's Legacy of the Forge DLC, which is set to launch on September 9, puts an end to the young master's couch-surfing ways. We're finally getting permanent lodgings to settle down with – though it's a bit of a fixer-upper – along with a blacksmithing business to run and a lengthy quest line.\n\nIt's a lot, and I wouldn't have it any other way. Despite the glut of fantastic titles I've been spoiled with this year, Kingdom Come: Deliverance 2 remains my personal game of the year as things currently stand. But after rolling credits just a few months into 2025, I haven't found much reason to return – not for lack of activities, as there are undoubtedly side quests left to unearth, but because I always feel like I've been cut loose once the main quest in an RPG has wrapped up.\n\nPlus, Henry is at this point a terminator in plate armor, and nothing short of starting afresh seemed capable of giving me back the sense of hard-fought progression I adored at the beginning of the game. But with Legacy of the Forge, I've got one – finally giving Henry somewhere to settle down.\n\nIn Legacy of the Forge, Henry reconnects with his father's blacksmithing ties to the city of Kuttenberg, setting up a shop of his own while reconnecting with his late dad's friends. While the ultimate goal will be to prove himself as a blacksmith and repair the town's intricate clock, my hands-on with the DLC revolves around its property customization.\n\nWithin the property – which includes a forge and shop, upstairs apartment, and large garden – there are a large number of customization slots, some with practical purposes. Build Henry a nice wardrobe, for example, and it will gradually repair any clothes stored within. The forge is fully functional (though blacksmithing is only mandatory for two parts of the DLC, I'm told), and your garden is so big that there's room to build a decked-out alchemy shed. I had a lot of fun choosing the material and color of the main building – you can choose different options for upstairs and downstairs – and took great pleasure in swapping out a muddy outdoor path for lovely, lovely gravel.\n\nWhile building anything costs gold – and quite a lot, for some of the bougier options – it also takes prestige, which is earned by completing randomized quests added in the DLC. Marked with their own icon, these range from dueling with other blacksmiths, forging items for customers, gambling (I can't connect the dots on that one), and generally helping around the city.\n\nI spent so long kitting out Henry's apartment that I only had time for one quest, and suspect I picked the wildest of the bunch. When someone asked for help removing their husband's tooth — which blacksmiths really did! – I figured it would be a quick buck. What I didn't count on was that their husband was very reluctant to have the tooth pulled, resulting in me chasing a very scared adult man around the city before knocking the tooth out by complete accident. Oh, Henry.\n\nThese quests are refreshed each morning, which means there's a slice-of-life element to Legacy of the Forge. To me, that's the most exciting part of the DLC. Across the 70-odd hours I've sunk into Kingdom Come: Deliverance 2, my favorite parts were far and away the downtime – aimless horse rides, stopping at inns, soaking up the atmosphere – and the prospect of building an actual life and routine in Kuttenberg is music to my ears. If you're a fan of blacksmithing in particular, you can take specific orders from customers or craft what you want and chuck it in the shop's chest, from which your staff will sell it all for a slightly lower fee.\n\nIn the same way I'll boot up Oblivion and wander like a tourist , returning to Bohemia with objectives to sate my lizard brain is all the justification I need for Kingdom Come: Deliverance 2 to become a role-playing mainstay. Given the DLC also comes with an estimated 15-20 hours of story, it's proving impossible to talk myself out of jumping back in – if you need me when it launches on September 9, no you don't.\n\nKingdom Come: Deliverance 2 review: \"Even if some friction can lead to frustration, its realization of medieval life remains utterly absorbing\"",
  "medium": "Article",
  "links": [
    "https://www.gamesradar.com/games/rpg/kingdom-come-deliverance-2-review-even-if-some-friction-can-lead-to-frustration-its-realization-of-medieval-life-remains-utterly-absorbing/",
    "https://www.gamesradar.com/games/the-elder-scrolls/from-arduous-to-glorious-how-oblivion-remastered-saved-the-siege-of-kvatch/",
    "https://www.gamesradar.com/games/the-elder-scrolls/ive-spent-20-hours-playing-oblivion-remastered-as-an-evil-tourist-and-may-have-accidentally-found-the-best-way-to-play-bethesdas-liveliest-rpg/",
    "https://www.gamesradar.com/games/rpg/with-over-one-million-customization-combos-kingdom-come-deliverance-2s-second-story-dlc-will-turn-the-rpg-into-a-city-builder-that-looks-like-the-sims-medieval-remake-ill-never-get/",
    "https://www.gamesradar.com/games/adventure/indiana-jones-and-the-great-circle-has-quickly-become-one-of-favorite-adventure-games-of-all-time-and-the-dlc-promises-to-give-me-exactly-what-i-want-more-of-it/",
    "https://www.gamesradar.com/games/rpg/instant-gratification-in-gaming-has-become-a-problem-kingdom-come-deliverance-2-dev-says-the-rpg-is-meant-to-feel-like-a-spiritual-successor-to-oblivion-and-morrowind/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Kingdom Come",
      "weight": 0.07711825
    },
    {
      "name": "side quests",
      "weight": 0.060708344
    },
    {
      "name": "randomized quests",
      "weight": 0.060485147
    },
    {
      "name": "Deliverance",
      "weight": 0.058970537
    },
    {
      "name": "other blacksmiths",
      "weight": 0.05542769
    },
    {
      "name": "Henry",
      "weight": 0.053252846
    },
    {
      "name": "Kingdom Come: Deliverance",
      "weight": 0.051538046
    },
    {
      "name": "medieval life",
      "weight": 0.049674157
    },
    {
      "name": "blacksmithing",
      "weight": 0.04879569
    },
    {
      "name": "shop",
      "weight": 0.04737838
    }
  ],
  "topics": [
    {
      "name": "Gaming"
    }
  ],
  "categories": [],
  "taxonomies": [
    {
      "name": "/Games/Computer & Video Games/Gaming Reference & Reviews",
      "score": 0.9716796875
    },
    {
      "name": "/Games/Computer & Video Games/Action & Platform Games",
      "score": 0.79638671875
    },
    {
      "name": "/Games/Roleplaying Games",
      "score": 0.60400390625
    },
    {
      "name": "/Games/Computer & Video Games/Adventure Games",
      "score": 0.5986328125
    },
    {
      "name": "/Games/Computer & Video Games/Massively Multiplayer Games",
      "score": 0.369140625
    },
    {
      "name": "/Games/Computer & Video Games/Shooter Games",
      "score": 0.35595703125
    }
  ],
  "sentiment": {
    "positive": 0.27236423,
    "negative": 0.28288844,
    "neutral": 0.44474727
  },
  "summary": "Warhorse's next DLC, Legacy of the Forge, is set to launch on September 9. The game's main character, Henry, is finally settling down with permanent lodgings and a blacksmithing business, along with a lengthy quest line. The DLC allows for property customization, which includes a forge and shop, an upstairs apartment, and large garden. The player can also take specific orders from customers or craft items in the shop's chest for a slightly lower fee. Despite the glut of games this year, Kingdom Come: Deliverance 2 remains my personal game of the year. The story of the DLC also includes an estimated 15-20 hours of story.",
  "shortSummary": "The Legacy of the Forge DLC, launching September 9, offers a new lease of home and business in Kingdom Come: Deliverance 2, allowing Henry to settle down and pursue his blacksmithing interests.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "870d25532b49414a8ea6051f0eaae69d",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.gamesradar.com/games/rpg/instant-gratification-in-gaming-has-become-a-problem-kingdom-come-deliverance-2-dev-says-the-rpg-is-meant-to-feel-like-a-spiritual-successor-to-oblivion-and-morrowind/",
      "text": "\"Instant gratification in gaming has become a problem\" – Kingdom Come: Deliverance 2 dev says the RPG is meant to feel like a spiritual successor to Oblivion and Morrowind\nOn the Radar | Warhorse senior game designer Ondřej Bittner explains why going back to \"the roots of RPGs\" is a good thing\nThe first hours of a life-changing RPG are intoxicating. You probably know the feeling – just as a game's mechanics start to click and you start to get your bearings, you're struck by the sheer enormity of it all. The world is an open book, yet to be explored, and completely yours. To me, nothing exemplifies this more than stepping out of the Imperial City Sewers to explore Cyrodiil for the first time in The Elder Scrolls 4: Oblivion. Time has never been able to dilute that sense of staggering possibility – so imagine my surprise when, almost 20 years later, I felt the same way in Warhorse Studios' medieval RPG Kingdom Come: Deliverance 2.\nIn many ways, I think Kingdom Come: Deliverance 2 is as close a spiritual successor to Oblivion as we'll ever get. Some of its resemblances are skin-deep, like the way that 15th-century Bohemia's lush forests and rolling hills seem to sprawl in every direction like Cyrodiil's own. Elsewhere, it's a little more mechanical. NPCs live their own lives that you can't just twist around your own, which makes it all the funnier when a passing noble decides to jump off his horse to help you kill a roadside bandit with his bare hands. Importantly, though, the two games share that feeling of complete liberation in their beginnings: the implication that everything is possible, if you can just pick a direction and walk.\nOf course, there was always the possibility that I was just being a huge Oblivion sicko – so when I caught up with Warhorse to discuss all things Kingdom Come: Deliverance 2, I had to ask whether there was any tangible connection there.\nWorking backwards\nKingdom Come: Deliverance 2 review: \"Even if some friction can lead to frustration, its realization of medieval life remains utterly absorbing\"\nRight off the bat, Ondřej Bittner – senior game designer for Kingdom Come: Deliverance 2 – has a confession. \"I'm not much of an Oblivion guy myself,\" he says, laughing. \"I'm more of a Morrowind person.\"\nBut that era of RPGs has played a major role in Warhorse's approach to crafting an RPG – Morrowind was released just four years before Oblivion, which makes the ever-growing gap between Skyrim and The Elder Scrolls 6 sting all the more. \"Most of our designers are in their mid 30s – like, 30s to 40s – so these games had a huge impact on us,\" says Bittner.\nThat's largely due to the slower pacing of older RPGs, in which the emphasis lay more on discovery and slow-burn adventure. Those attitudes – to me, at least – were exemplified by the fact that the process of finding a side quest was just as exciting and important as actually playing one.\n\"Instant gratification in games has become a problem where, to sustain dopamine for people, you have to constantly bombard [players] with stuff,\" says Bittner. \"One day they wake up and go 'oh, this is all really obnoxious' and they shut it all down. So we kind of go back to the roots of RPGs where it's sort of like: well, you can do whatever you want, and maybe go and do the main story.\"\nWeekly digests, tales from the communities you love, and more\nBittner describes the approach as \"going back to the [genre's] roots with less hand-holding,\" but acknowledges that it can cause friction. \"We don't really tell you what to do exactly, and sometimes this can clash with players from a younger generation,\" he explains. \"They can be like 'I don't know where to go' – well, have you thought about where to go? If I tell you where to go, it's not really as fun, is it?\"\nAcrobatics\nAt times, this approach can be as much a burden for the team at Warhorse as it is a boon, as the studio doesn't want to alienate players by taking away some guidance systems they may be used to. Bittner says the first Kingdom Come: Deliverance – which features a notoriously difficult opening segment – was a \"massive lecture\" in finding the right balance. \"We wanted to make mechanics [in Kingdom Come: Deliverance 2] more approachable so that they're hard, but not so hard that players don't even know what to do. So that learning curve should be a little bit smoother, especially in combat, so it's not detracting and you can actually start exploring – so you can enjoy doing it, and you're not immediately like 'oh, this is not for me'.\"\nThere's no better example of that compromise than the moment Kingdom Come: Deliverance 2 cuts players loose from its on-rails introduction. You're ditched in a strange land with no money, clothes, or weapons to your name, while survival mechanics like needing to eat, drink, and sleep make merely finding your feet in this world feel more important than the main quest. Mere feet away from your starting position, a local beggar can suggest ways for you to find essentials. Bittner says this character, designed as a \"road sign for players who were like 'I don't know what to do'\", was added to avoid losing potential fans too early. It's one of the more unforgiving introductions to an RPG, but that sort of in-world guidance makes Kingdom Come: Deliverance 2 feel far more approachable than its predecessor without losing its very deliberate challenge.\nIt's that carefully-cultivated feeling of being lost by design that makes Kingdom Come: Deliverance 2 sit closer to the likes of Oblivion than anything I've played in a long time – and subsequently, one of the best RPGs I've played in a long time. I would love to see more have confidence in their world and set players loose as freewheeling nobodies, whether that leads to accidentally getting roped into Cyrodiil's local Dark Brotherhood chapter (a story for another time) or seeing poor Henry arrested for the humble crime of sleeping uninvited in someone's attic. Not knowing how a world will react to you is a thrill unlike any other, and that goes double for a game as mechanically deep as Kingdom Come: Deliverance 2 – in which you can literally be too stinky to sneak.\nAndy Brown is the Features Editor of Gamesradar+, and joined the site in June 2024. Before arriving here, Andy earned a degree in Journalism and wrote about games and music at NME, all while trying (and failing) to hide a crippling obsession with strategy games. When he’s not bossing soldiers around in Total War, Andy can usually be found cleaning up after his chaotic husky Teemo, lost in a massive RPG, or diving into the latest soulslike – and writing about it for your amusement."
    },
    {
      "url": "https://www.gamesradar.com/games/rpg/kingdom-come-deliverance-2-review-even-if-some-friction-can-lead-to-frustration-its-realization-of-medieval-life-remains-utterly-absorbing/",
      "text": "GamesRadar+ Verdict\nBuilding upon and refining its predecessor's commitment to historical realism, Kingdom Come: Deliverance 2 is an absorbing RPG that fully immerses you in medieval life. If you have the patience to endure a wilfully slow progression system, you'll be richly rewarded with heaps to do in 15th century Bohemia.\nPros\n- +\nVast, beautifully realised and believable open world\n- +\nSkills system that rewards you with perks the more you use them\n- +\nThoroughly written and open-ended quests\nCons\n- -\nProgression can be stubbornly slow\n- -\nCombat is (deliberately) not the most responsive or accurate\nWhy you can trust GamesRadar+\nMuch like its predecessor, Kingdom Come: Deliverance 2's defining ingredient that separates it from fantasy-fuelled RPGs is its commitment to historical realism. Whereas The Witcher 3 may be based on Polish culture and folklore, Warhorse's first-person action RPG is about immersing you in 15th century Bohemia where the characters you meet aren't just based on real figures but your actions feel just as believable and consequential as in real life, rather than a typical power fantasy.\nWhile that often means progression can be a more pedestrian affair, having the patience to meet the game on its terms makes for a more genuine form of role-playing, where drawing your sword is rarely the first choice for solving a problem. Which isn't to say Kingdome Come: Deliverance 2 has a slow start, instead thrusting you in media res into a full-scale castle siege.\nOur returning protagonist, the likeable and occasionally bumbling Henry of Skalitz, has come some way from being an illiterate blacksmith's apprentice. But even in the context of warring allegiances in the kingdom, some of your immediate concerns when you're set out questing into the world involve simply trying to find your missing dog, or helping the reclusive herbwoman who saved your life find her daughter. It's a reminder that you aren't a powerful hero, but a small cog doing your best amid grand political machinations.\nNonetheless, Kingdom Come: Deliverance 2 is a sequel on a much larger canvas, painted in a variety of brushstrokes. The emphasis on realism may mean life is hard and brutal, especially if you don't have a groschen to your name, yet there is an equally bawdy tone, backed by colorful characters using equally as colorful language, or where even a seemingly mundane quest can stretch into relatively epic proportions that'll dominate your next few hours of play. Even if some friction can lead to frustration while occasional glitches break the immersion, its realization of medieval life remains utterly absorbing.\nAudentes fortuna iuvat\nRelease date: February 4, 2025\nPlatform(s): PC, PS5, Xbox Series X\nDeveloper: Warhorse Studios\nPublisher: Deep Silver\nFor an RPG with no spells, the real magic of Kingdom Come: Deliverance 2 is just how believable and beautifully rendered with CryEngine its open world is. That's especially evident when simply walking or riding across open countryside in the early morning or sunset, without being spoiled by the usual clutter of collectibles or waypoints. Come across a village and it will be about the size that a real medieval village would be with humble amenities. Larger towns are fortified with a few specific guarded entrance points, and waltzing into someone's private property will immediately be unwelcome, albeit still giving you reasonable time to clear off before escalating.\nNaturally, wielding a sword in a tavern or market needlessly will also draw ire from the locals. Instead, you're encouraged to use your powers of persuasion to affect a favorable outcome, which can depend as much on your appearance as much as your stats. High charisma points alone aren't enough to charm someone if you don't dress the part and haven't had a wash for a week.\nThis isn't to say that there aren't videogamey conveniences available to you, such as fast-travelling to towns you've previously visited or being able to advance time so you don't have to potter around while waiting for a rendezvous. It's nonetheless intriguing how these systems have some consistency. While time advances while you fast travel, for instance, poor Henry's hunger and sleep stats will decrease, and he'll begin to grumble at you for leaving him unrested and unfed should the numbers get dangerously low.\nWeekly digests, tales from the communities you love, and more\nWhat there's no getting away from is that progression is purposely slow, even without including the times you may find yourself having to reload a save to try again, contributing to an already lengthy campaign well beyond 60 hours and split between two large regions of Bohemia. Some of that comes naturally as you play, and early on when circumstances leave Henry penniless in beggar's clothing, you're primed for a slow and steady climb to go from surviving to thriving, where every coin in your pouch matters.\nThe first main quest, for instance, has you attempting to gain access to a wedding, which means taking on a handful of menial and tertiary tasks before you can even get close to receiving the coveted invite. But ultimately, you need to put in the work, because much like in real life, the only way to get better at something is to keep doing it. That's quite literally the case when it comes to crafting weapons or brewing potions, each with their own involved and methodical minigames. There's no shortcutting these processes, at least not without causing problems down the line.\nDespite usually preferring the stealthy approach, I found myself avoiding lockpicking or pickpocketing in the early hours as successfully pulling them off is difficult at first – your novice hand moves wobbly. Yet while the open-ended design for most quests means there's usually other ways to get what you want, including outright bribery, it also meant when it came to a later quest that required me to sneak into a house to steal an item, opting out of lockpicking earlier on meant my thievery stats and perks hadn't made any meaningful progression, rendering medium-level locks impossible to crack.\nYou're not completely (ahem) locked out, as potions can temporarily supercharge stats. But then that also means acquiring the recipe for it and having the ingredients to brew it. In other words, it all takes time and planning, one way or another.\nSuch is the breadth of options available to you that violence rarely needs to be the answer. Though, at times, the dangerous world will require you to rise up to meet it with steel. It's tempting to avoid bandit skirmishes on the road when you see them coming, but ultimately those will be experience points you lose out on that may put you at a disadvantage in unavoidable scraps later. Of course, beyond combat mastery, other factors like having your weapon sharpened or actually having armor equipped are also vital.\nEven then, combat is one of the least appealing aspects of Kingdom Come: Deliverance 2, more like something you have to do rather than something you'd go out of your way to engage in – arguably a realistic response to violence. Its directional system for attacking, blocking, and parrying can feel weighty one moment, yet hard to parse the next. At times, inconsistent animations have hits on enemies you swore connected fail to register.\nIt's especially messy during group fights, exacerbated by an annoying targeting system that I found could all too easily disengage at inopportune moments. Of course, you would expect being outnumbered by the enemy to be unwieldy and difficult in real life too, but it's also unsatisfying when some of these encounters are just about enduring long enough before a cutscene arbitrarily moves things along. Expect to see the partying skeleton on the Game Over screen many times.\nThe less said about firearms, the better. They're introduced as a new and devastating weapon but are so horribly cumbersome to use to the point of being useless unless you're prepared to waste a lot of shots just so you can gradually improve your skill with them. You can understand why it would take longer to load a single shot than to loose an arrow, but there is something especially wilful in the design that the game has an onscreen crosshair by default almost all the time… apart from when you're holding a ranged weapon.\nGetting medieval\nWhile Henry is primarily your protagonist, the story occasionally switches perspectives where you'll take control of Father Godwin, a priest who despite being pious also doesn't hide his enjoyment of wine and women, and a fan favorite from the first game.\nFor those who really want to be transported to medieval Bohemia, however, there is much to enjoy by slowing down and taking everything in the minutia. The city of Kuttenberg is especially impressive, with each of its districts distinct and faithfully realized, while you could go as far as follow any citizen's daily routine.\nSometimes that's actually the best thing to do, too, since some quests have Henry play detective, asking the locals and trying to find leads in his investigation to puzzle out the location of clues – without a marker on the map, mind you. Quests are often lengthy and involved affairs, and will sometimes tangentially lead to other stories beginning to unwind, blossoming the narrative quite naturally.\nWhile it will of course help your stats, it's just as easy to break away from your main objectives and spend your time gambling with dice, smithing and selling weapons, or hunting animals in the wild (although you'll also run into trouble as you'll technically be guilty of poaching the king's game). But you can also find side quests to undertake from the unlikeliest of sources. Ironically, the best way to find new adventure is by fast-travelling, where there's always a chance you'll be interrupted by a random encounter, whether that's bandits trying to rob an innocent passerby or a stranger who may or may not have good intentions. One of my most surreal moments was encountering a man walking around with an arrow still lodged in his head.\nEven if you can't talk to everyone, the larger scale of Kingdom Come: Deliverance 2 means a much larger script, reportedly more than 2.2 million words. Players may bristle at the quality of the writing, which can flip from earnest and serious to coarse and bawdy, with liberal droppings of c-bombs and 'Kurva'. The constant reference to women as 'wench' can also be cringe-inducing despite being common usage in the middle ages. Katherine, a quick-witted spy Henry teams up with regularly in the story, subverts the mostly silent or servile housewives and bathmaids you encounter, but that doesn't stop the game from pointing out her other assets first.\nYet these different facets to the tone also add to the authenticity, where life is diverse and riddled with contradictions. Talk of God is in earnest in between drinking, cursing, and whoring, death can come suddenly but the game doesn't revel in gratuitous violence. Even a mission that requires you to torture someone allows you to weigh up the moral unpleasantness of the task and even avoid it altogether, not least because you'll find yourself on the receiving end. In contrast to the exclusively white population of the first game, this sequel makes the effort of including other ethnicities in Bohemia, which impact both the narrative and the gameplay.\nOverall then, Kingdom Come: Deliverance 2 is a vast accomplishment, an even more complete and immersive follow-up that paints a wide picture of medieval life. Provided you have the patience with its pacing and are willing to put in the hours to get deeper into its systems rather than just trying to min-max your way out of a problem at optimal speed, it's a thoroughly absorbing RPG that's quite unlike anything else.\nKingdom Come: Deliverance 2 was reviewed on PS5 Pro, with a code provided by the publisher.\nLooking for another epic adventure? Check out our best RPG games!\nI'm a freelance games journalist who covers a bit of everything from reviews to features, and also writes gaming news for NME. I'm a regular contributor in print magazines, including Edge, Play, and Retro Gamer. Japanese games are one of my biggest passions and I'll always somehow find time to fit in a 60+ hour JRPG. While I cover games from all platforms, I'm very much a Switch lover, though also at heart a Sega shill. Favourite games include Bloodborne, Persona 5, Resident Evil 4, Ico, and Breath of the Wild."
    },
    {
      "url": "https://www.gamesradar.com/games/rpg/with-over-one-million-customization-combos-kingdom-come-deliverance-2s-second-story-dlc-will-turn-the-rpg-into-a-city-builder-that-looks-like-the-sims-medieval-remake-ill-never-get/",
      "text": "With \"over one million\" customization combos, Kingdom Come: Deliverance 2's second story DLC will turn the RPG into a city builder that looks like the Sims Medieval remake I'll never get\nManor Lords is quaking\nIf you ever wanted to see Kingdom Come: Deliverance 2 hero Henry of Skalitz's pound some anvils and do almost nothing else, the RPG's newest story DLC has you covered.\nKingdom Come: Deliverance 2's Legacy of the Forge expansion was just given another showing at Gamescom, confirming that the second DLC is set to come to Warhorse's epic tale on September 9.\nLegacy of the Forge will offer up an array of creative base-building tools that makes KCD2 look more like a city-builder than one of the best RPGs. In the DLC, we'll see Henry return to his hometown and be put in charge of running his very own smithy as the new owner of Kuttenberg's old forge, creating bespoke, opulent pieces worthy of only the finest of knights – and fixing up his own private pad while he's at it.\nThe latest trailer shows off an array of exterior and interior design tools we'll soon have at our fingertips, and we'll be able to do anything from rebuilding Henry's ramshackle private living quarters to returning the burned-down forge to its former glory.\nWe'll also get to redecorate everything with \"over one million\" customization combinations at our disposal, and I can't wait to give Henry the lavish bedchambers he so desperately deserves. In true Kingdom Come style, though, how we choose to decorate the forge will have a direct impact on other gameplay areas. Because this game needs consequences for everything, duh.\nOn top of all of this, we'll also learn more about Henry's family history, including the revelation that his father had once been a master blacksmith himself, but I'll leave that to you to discover in September.\nI, for one, am completely hyped. In a game renowned for its hyper-authentic historical realism, Kingdom Come: Deliverance 2 - Legacy of the Forge looks like it's about to scratch just about every itch for a rustic city builder I could have. This is welcome news, since Manor Lords is still in Early Access (check out my Early Access review for more) and The Sims Medieval came out more than a decade ago.\nWeekly digests, tales from the communities you love, and more\nThere's plenty of other upcoming PS5 games where this DLC comes from, and you'll find them all right here.\nJasmine is a staff writer at GamesRadar+. Raised in Hong Kong and having graduated with an English Literature degree from Queen Mary, University of London in 2017, her passion for entertainment writing has taken her from reviewing underground concerts to blogging about the intersection between horror movies and browser games. Having made the career jump from TV broadcast operations to video games journalism during the pandemic, she cut her teeth as a freelance writer with TheGamer, Gamezo, and Tech Radar Gaming before accepting a full-time role here at GamesRadar. Whether Jasmine is researching the latest in gaming litigation for a news piece, writing how-to guides for The Sims 4, or extolling the necessity of a Resident Evil: CODE Veronica remake, you'll probably find her listening to metalcore at the same time.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.gamesradar.com/games/the-elder-scrolls/from-arduous-to-glorious-how-oblivion-remastered-saved-the-siege-of-kvatch/",
      "text": "From arduous to glorious: How Oblivion Remastered saved the Siege of Kvatch\nNow Playing | In Oblivion Remastered, bad(ass) things come to those who level up\nA dreary prison cell. One surprise visit from Emperor Uriel Septim VII. An unexpected bestowment of royal jewelry, and a rather daunting mission: \"to close shut the jaws of Oblivion\" – that's how The Elder Scrolls 4: Oblivion Remastered begins. Before long, you're sent to the city of Kvatch, which, due to a freshly opened Oblivion Gate, has been overrun by demons.\nSounds like an unfortunate yet thrilling situation, doesn't it? As someone who survived the Siege of Kvatch in both the original Oblivion and the Remastered version, early game and late game, I can tell you that this part of your Cyrodiillian adventure can either be the most exciting or dullest, easiest or hardest, thing you'll ever do in this game – and it all depends on character levelling.\nCursed Kvatch\nMy earliest memory of Kvatch is not a happy one. In fact, it's a rather embarrassing part of my first time in Cyrodiil. With my early-game character, undeterred by the sight of a town in smithereens, I headed towards the ominous Oblivion Gate. All that stood between me and the surviving Kvatchians was a measly Scamp or two, so what could possibly go wrong? Well, long story short, the scampy fellows flattened me.\nA bit surprised, I tried again and again, but same story; my attacks hardly chipped away at the enemy's HP, whereas they could easily kill me. As dying to misshapen minions is only fun for so long, I looked into Oblivion's levelling system and realised that the issue was, quite literally, skill-based. No, my character level certainly wasn't too low for the Siege of Kvatch, but some of my skill levels certainly were, and it took a long time to fix it.\nAs I discovered, you could only level your character by levelling your major skills, which you'd chosen during character creation. Once you'd gained enough major skill improvements, sleeping in a bed would level you up – even without improving any minor skills. On top of that, the Attribute Points (stat points) received upon levelling up were based on the major skills you had leveled. For example, Security, Sneak, and Marksman would belong to the 'Governing Attribute' Agility, which meant you would have to level those three skills to improve your Agility stat.\nWhile this only scratches the surface of Oblivion's overly complex levelling system, it's enough to realize what went wrong during my first Siege of Kvatch. You see, during the tutorial, I thought I had discovered a brilliant exploit when I continuously improved my Sneak skill by loitering behind an unsuspecting Goblin. I also engaged in way too many alchemical experiments while ignoring all skills governed by Endurance, which happened to be Oblivion's most important Attribute as it provides an extra HP boost per character level gained.\nIn many games, such disregard for efficient levelling doesn't pose much of an issue. Just become a bit overlevelled and you'll be fine. But that doesn't work in Oblivion, because enemy difficulty scales with character level. Imagine a player walking into Kvatch with a ridiculously high Sneak skill, neglected minor skills, terribly low HP, and a bunch of useless potions… Suddenly, those deadly Scamps make sense.\nWeekly digests, tales from the communities you love, and more\nA sleepy siege\nImagine my surprise when I – again – didn't pay attention to levelling in my first Oblivion Remastered playthrough, only to find my second Siege of Kvatch rather… uneventful. I was fully prepared to fight those Scamps to the death and give it my all, but it merely required my 15%. One or two well-aimed arrows and down they went.\nThe Remastered version has made significant changes to Oblivion's levelling system. Although the difficulty scaling remains the same, the Governing Attributes and Endurance-based HP bonus are removed in favour of free Attribute Point allocation, and all skills, including minor ones, now contribute to character levelling. It is, in other words, much harder to screw up your character build as royally as I did all those years ago.\nI should be happy, right? But although I consider this a win for the less statistically inclined Oblivion player, I couldn't help but feel that this Siege of Kvatch left me more unsatisfied than the first one. When I saw others commemorating their magnificent Kvatch battles online, I realized I still wasn't handling Oblivion's levelling system correctly.\nTo understand the phenomenon of the vastly-different-Kvatches, there's something you should know about Oblivion's difficulty scaling, which hasn't been changed. Rather than just making enemies harder to defeat as you level up, the enemy type changes. So, if you try to save Kvatch in early-game, you'd be met by measly Scamps, but if you were to ignore the whole thing until mid- to late-game… Well, I had to see that for myself.\nIn my second Oblivion Remastered playthrough, I purposely avoided Kvatch until I was level 36, and I can tell you that it was, without exaggeration, glorious. Monstrosities of all shapes and sizes came pouring out of that Oblivion Gate as soon as I approached. Daedroth, Spider Daedra, Storm Atronachs, Xivilai… These were proper demons, befitting an event of catastrophic proportions.\nOf course, I did die quite a few times before the title of 'Hero of Kvatch' was bestowed upon me (as did all the nearby soldiers – oops!), but dying to an onslaught of Daedric forces feels much better than dying to a Scamp. In the original Oblivion, it certainly wouldn't have been possible to clear Kvatch at such a high level without meticulously planning my levelling progress, which is why I now consider this the best part of the Remastered version - apart from that gorgeous visual upgrade.\nAs unlocking the best version of the Siege of Kvatch still requires a good deal of patience (you don't need character level 36 though, 20+ will do), when and how to become the Hero of Kvatch is up to you. But if you want to get a truly unforgettable experience… You know what to do.\nI’m a freelance journalist who (surprise!) kind of has a thing for videogames. When I’m not working on guides for GamesRadar, you can probably find me somewhere in Teyvat, Novigrad, or Whiterun. Unless I’m feeling competitive, in which case you should try Erangel. You can also find my words on PCGamesN, Fanbyte, PCGamer, Polygon, Esports Insider, and Game Rant.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.gamesradar.com/games/the-elder-scrolls/ive-spent-20-hours-playing-oblivion-remastered-as-an-evil-tourist-and-may-have-accidentally-found-the-best-way-to-play-bethesdas-liveliest-rpg/",
      "text": "I've spent 20 hours playing Oblivion Remastered as an evil tourist, and may have accidentally found the best way to play Bethesda's liveliest RPG\nNow Playing | Reject difficulty discourse, embrace Tourist Mode\nDespite the fresh coat of paint and subtle improvements, The Elder Scrolls 4: Oblivion Remastered is still the same game I've spent nearly two decades playing. For that reason, I came into the remaster intent on making it really feel fresh, which meant abandoning the comfortable routine I've settled into across my many playthroughs. This has taken a few changes in direction – no more rushing to become Grand Champion, for starters – but more importantly, I've slowed things right down.\nIt's an approach I'm calling Tourist Mode, which is essentially just Adept difficulty with a few caveats. Fast travel is relegated to emergency use only (see: egregious cases of backtracking), my character needs to sleep in a bed every night, and – this one's a little vaguer – I'm trying to avoid bouncing from one quest objective to the next, which encourages a more freewheeling style of adventuring.\nAs part of this, I've taken to loitering in Cyrodiil's cities to get the most out of visiting them. Sometimes that turns up a fun side quest to pass the day before staying at an inn for the night, but having something to complete isn't mandatory – yesterday, for example, I hiked along Anvil's coastline because one resident told me the views were nice. They are!\nBut the real backbone of Tourist Mode has been tackling the Dark Brotherhood questline whilst trying to join the Mages Guild. While the Dark Brotherhood's targets are scattered all over Cyrodiil, the latter of which requires getting a recommendation from a guild branch in each of the game's major cities. It's sort of like a travelling salesman trying to earn a degree while out on the road, except the travelling salesman is a bloodthirsty assassin and the degree is actually a license to cast spells that make rats invisible. It's also, conveniently, an excuse to see Cyrodiil through fresh eyes for the first time in 19 years.\nTake a picture\nAt 7am, I leave my room in Imperial City's Tiber Septim Hotel and pass through the city's gates. I'm on my way to Skingrad, and although the road from Imperial City rises over hills and past goblin-infested caves, I make good time and get into the city by lunch. I pop in and out of shops to sell baubles I've picked up along the way, dawdling to admire the city's winding medieval architecture.\nSkingrad isn't my favorite city in Cyrodiil – it's a little too clean and grey for my liking – but after spending a good chunk of 2025 in Kingdom Come: Deliverance 2, I've got a newfound appreciation for its practical design. From the way its castle sits above the town, protected by gates and narrow bridges, you can see Skingrad was designed not as a hub for the player's convenience, but as a real medieval city would have been; ready to withstand wholly theoretical battles and sieges. This is, I'm only realizing while typing this out, around the point where my tourism meter hit peak Dad On Holiday.\nWhen I finally get around to business, it's evening and a thunderstorm has rolled in. My favorite quest in Oblivion – Whodunit? – takes place at Skingrad's Summitmist Manor, where five party guests have gathered for a treasure hunting lock-in. As the sixth guest – and more crucially, a Dark Brotherhood assassin – it's the player's job to kill everyone inside, with a bonus on offer if you can do that without ever being suspected as the murderer. I'll spare you the exact details (in the hopes that you're yet to experience it for the first time) but by the time I leave Summitmist Manor to find an inn, it's dead of night and Skingrad has five fewer citizens.\nWeekly digests, tales from the communities you love, and more\nThe next morning, I stay in Skingrad to earn a recommendation from the city's Mages Guild chapter. The associated quest takes me in and out of the city to rescue a wayward wizard from a cave, but it's a straightforward job and it's not long before I'm on the road back to the Dark Brotherhood's sanctuary in Cheydinhal. The trip bagged me a completed Dark Brotherhood contract, another recommendation closer to stepping foot in the Arcane University, and – best of all – a renewed fondness for Skingrad.\nI've stuck to this slow, savoring playstyle for a little over 20 hours by this point, and every city has a similar experience – kill someone in the area, get in good with the local mages, and spend a little time doing nothing. Rejecting intention has made Cyrodiil feel fresh and new in a way that goes beyond even the remaster's fancy visuals, and to get the most out of Oblivion I'd encourage everyone to try Tourist Mode (patent pending).\nWhen it comes to classics, I think we have a tendency to beeline toward the known quantities, the best bits (I'm certainly guilty of that with Whodunit?). But over time, that reduces an entire world to scenery through a train window. Instead of rushing to relive those fond memories, join me in making some new ones. Take a hike along Anvil's coast, clear a few dungeons if the mood takes you, then spend the night in definitely-not-haunted Benirus Manor. Book a room in Cheydinhal Bridge Inn, and stick around to find a missing artist or dealing with a corrupt guard. Or do none of that – it's your holiday!\nAndy Brown is the Features Editor of Gamesradar+, and joined the site in June 2024. Before arriving here, Andy earned a degree in Journalism and wrote about games and music at NME, all while trying (and failing) to hide a crippling obsession with strategy games. When he’s not bossing soldiers around in Total War, Andy can usually be found cleaning up after his chaotic husky Teemo, lost in a massive RPG, or diving into the latest soulslike – and writing about it for your amusement.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.gamesradar.com/games/adventure/indiana-jones-and-the-great-circle-has-quickly-become-one-of-favorite-adventure-games-of-all-time-and-the-dlc-promises-to-give-me-exactly-what-i-want-more-of-it/",
      "text": "Indiana Jones and the Great Circle has quickly become one of favorite adventure games of all-time, and the DLC promises to give me exactly what I want - more of it\nOpinion | More Indiana Jones and the Great Circle is all I could have ever asked for this Summer Game Fest\nAs soon as I came to the end of Indiana Jones and the Great Circle, all I wanted was more. More puzzles, more whip-cracking traversal, more fist-fights. More Indiana. Did I expect my prayers to be answered quite so soon during Summer Game Fest? Absolutely not. But am I over the moon that we're getting an Indiana Jones and the Great Circle: Order of the Giants DLC this September?\nYou better believe it. I tucked into MachineGames' globe-trotting adventure for the first time this year on PS5, and it's safely one of my favorite games in recent memory. I don't say that lightly, either, as someone who's a diehard fan of the fedora-wearing archaeologist and the movies from George Lucas and Steven Spielberg.\nWith the promise of letting me really become the character I grew up loving, I wondered if the studio behind Wolfenstein could actually fulfill that fantasy, but boy did it deliver and then some. From the many nods to the films, to nailing the spirit of the iconic character, and putting on the signature hat for myself, I can't remember the last time I felt as sad to reach a game's conclusion as I did in The Great Circle. Happily, the Order of the Giants looks set to give me exactly what I yearn for, and better yet, it's going to do it in the most exciting way possible by drawing us into another mystery-filled quest in a new location: Rome.\nA dark secret in the depths\nIndiana Jones and the Great Circle review: \"The best adventure Indy has embarked on in over 30 years\"\nNothing spells adventure quite like going to a new destination to face challenges unknown, which is why I loved the variety of locations in Indiana Jones and the Great Circle's core experience. Each and every one offered something different: from the sandy pyramids of Gizeh to the snowy climbs of the Himalayas, and the streets of the Vatican, every place presented its own distinct feel – all with unique disguises, landscapes, hidden secrets, and puzzles. So, the prospect of going somewhere fresh once again in the Order of the Giants DLC is exactly what I want.\n\"This is where it starts. Beneath the streets of Rome\", says Indiana, who sets the scene for the expansion in the reveal trailer, which will plunge us into ancient crypts and sewers nestled deep below the city. Admittedly it does sound pretty spooky, with the official Lucasfilm site painting a picture of the dark quest that's in store for us.\nSet during the events of the main game, we'll be setting out to uncover \"dark secrets\" that lie beneath Rome with the help of a cryptic priest called Father Ricci. As we traverse ancient sewer systems and venture to different areas, we'll have to face \"members of a frightening cult\" who \"sneak around in the shadows\". At first blush, I get the impression that I may have to face my fears once again, with The Order of the Giants seemingly tapping into the unsettling vibes that put me to the test at the tail end of Gizeh's main questline. But hell, even if it sounds pretty creepy, I'm more than on board with the idea of peeling back the mysteries of Rome.\nAnd not unlike the pyramids of Egypt and the ceiling of the Sistine Chapel in the Vatican, I'm just as excited to see MachineGames' recreation of famous historic landmarks, because not only will we be going below the city, but we'll also get to explore the ruins of the Colosseum. Sign me up, right now. With \"intricate puzzles\" to solve as we explore ancient Rome, the DLC looks set to fill a hole the main game left behind, and it's also teased that a \"few familiar faces\" will be making a return – I can't wait to find out which characters will make an appearance.\nWeekly digests, tales from the communities you love, and more\nHonestly, I'd be happy for MachineGames to keep dropping more DLC in the future so I can keep finding excuses to put Indiana's fedora back on. But in my heart of hearts, I'd absolutely love to see more games starring the iconic character come our way from the studio.\nI mean heck, give me a whole trilogy of Indiana Jones adventures just like the Great Circle and I'll be happier than an archaeologist uncovering an ancient find. For now, though, I'll bide my time finding any remaining collectibles, and you best believe I'll make the most of the Order of the Giants expansion when it comes around on September 4.\nLook ahead with our roundup of upcoming Bethesda games.\nI started out writing for the games section of a student-run website as an undergrad, and continued to write about games in my free time during retail and temp jobs for a number of years. Eventually, I earned an MA in magazine journalism at Cardiff University, and soon after got my first official role in the industry as a content editor for Stuff magazine. After writing about all things tech and games-related, I then did a brief stint as a freelancer before I landed my role as a staff writer here at GamesRadar+. Now I get to write features, previews, and reviews, and when I'm not doing that, you can usually find me lost in any one of the Dragon Age or Mass Effect games, tucking into another delightful indie, or drinking far too much tea for my own good.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    }
  ],
  "argos_summary": "The article reviews Warhorse Studios’ upcoming Legacy of the Forge DLC for Kingdom Come: Deliverance 2, set to launch on September 9. It highlights Henry’s new permanent home, a blacksmith shop, and extensive customization options, along with a daily quest system that adds a slice‑of‑life element. The DLC promises 15‑20 hours of story and deep gameplay, reinforcing the game’s focus on realistic medieval life and slow, rewarding progression.",
  "argos_id": "F48VZ52MT"
}