{
  "url": "https://www.sfchronicle.com/news/article/australian-government-signs-deal-to-deport-former-21023473.php",
  "authorsByline": "Associated Press",
  "articleId": "ce87bdca732340579b4efe2eef3a2f34",
  "source": {
    "domain": "sfchronicle.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "city": "San Francisco",
      "coordinates": {
        "lat": 37.7790262,
        "lon": -122.419906
      }
    }
  },
  "imageUrl": "",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-30T22:21:18+00:00",
  "addDate": "2025-08-30T22:25:15.460481+00:00",
  "refreshDate": "2025-08-30T22:25:15.460482+00:00",
  "score": 1.0,
  "title": "Australian government signs deal to deport former detainees to the tiny island country of Nauru",
  "description": "Australia and Nauru signed an agreement on Friday to allow the Australian government to deport formerly detained people without valid visas to the tiny island nation. Under the memorandum of...",
  "content": "Australia and Nauru signed an agreement on Friday to allow the Australian government to deport formerly detained people without valid visas to the tiny island nation, the Australian Associated Press reported.\n\nUnder the memorandum of understanding, Australia will pay Nauru 408 million Australian dollars ($267 million) up front once the first people arrive, followed by 70 million Australian dollars ($46 million) annually for the resettlement.\n\nThe move is being slammed by refugee advocates, some of whom say the deal could open the door to mass deportations without notice. Human rights organizations have protested deportations to Nauru since a report by the United Nations found “systematic violations” of the International Convention Against Torture.\n\nTony Burke, Australia's home affairs minister, said in a statement that the memorandum “contains undertakings for the proper treatment and long-term residence of people who have no legal right to stay in Australia, to be received in Nauru.\"\n\nThe two countries struck a deal in February to allow Australia to deport three violent criminals to Nauru. They were granted 30-year visas.\n\nAn Australian High Court decision in 2023 overturned the government’s policy of indefinite detention for immigrants who could neither get a visa, in some cases because of criminal conduct, nor be deported because they would face persecution or harm in their home countries. More than 200 immigrants have been released from detention as a result of the case. Some were charged with further offenses after their release.\n\n\"Anyone who doesn’t have a valid visa should leave the country,” he said. “This is a fundamental element of a functioning visa system.”\n\n“This deal is discriminatory, disgraceful and dangerous,” she said. \"At a time when the entire country has just voted for unity and rejected fear, rather than embrace this and show leadership, the Albanese Government has launched yet another attack on migrants and refugees.”",
  "medium": "Article",
  "links": [
    "https://asrc.org.au/2025/08/30/albanese-government-makes-secret-deportation-deal-with-nauru-for-almost-half-a-billion-dollars/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Australian government",
      "weight": 0.093131475
    },
    {
      "name": "valid visas",
      "weight": 0.08774766
    },
    {
      "name": "Nauru",
      "weight": 0.07918709
    },
    {
      "name": "Australia",
      "weight": 0.077622116
    },
    {
      "name": "Australian",
      "weight": 0.07653822
    },
    {
      "name": "deal",
      "weight": 0.07142574
    },
    {
      "name": "people",
      "weight": 0.06528982
    },
    {
      "name": "indefinite detention",
      "weight": 0.063954465
    },
    {
      "name": "Human rights organizations",
      "weight": 0.062444963
    },
    {
      "name": "mass deportations",
      "weight": 0.0623905
    }
  ],
  "topics": [
    {
      "name": "Australia"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/People & Society/Social Issues & Advocacy/Other",
      "score": 0.927734375
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.88037109375
    },
    {
      "name": "/Law & Government/Government/Visa & Immigration",
      "score": 0.86474609375
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.83203125
    },
    {
      "name": "/News/Other",
      "score": 0.62890625
    },
    {
      "name": "/People & Society/Social Sciences/Political Science",
      "score": 0.379150390625
    },
    {
      "name": "/Sensitive Subjects/Other",
      "score": 0.333740234375
    }
  ],
  "sentiment": {
    "positive": 0.06142158,
    "negative": 0.7345122,
    "neutral": 0.20406628
  },
  "summary": "Australia and Nauru have signed a memorandum of understanding allowing the Australian government to deport former detainees without valid visas to the tiny island nation. The agreement is being criticised by human rights groups, who believe it could lead to mass deportations without notice. Australia will pay Naurutan $267 million up front, followed by $46 million annually for resettlement. The two countries previously agreed to allow three violent criminals to be deported.",
  "shortSummary": "Australia and Nauru signed a deal to deport former detainees without valid visas, sparking concerns from refugee advocates about mass deportations.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "2379e9b274a648fd9c0f6c1b6184c28e",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://asrc.org.au/2025/08/30/albanese-government-makes-secret-deportation-deal-with-nauru-for-almost-half-a-billion-dollars/",
      "text": "Albanese Government makes secret deportation deal with Nauru for almost half a billion dollars\nRefugee organisations have slammed the Albanese Government for making yet another secret deal with Nauru, this time paving the way for mass deportations at a cost to the taxpayer of nearly half a billion dollars initially as well as another $70 million every year.\nA statement silently uploaded to the website late Friday afternoon showed that Home Affairs Minister Tony Burke has secretly travelled to Nauru to sign an agreement with the Pacific nation. Past agreements with Nauru have been fraught with corruption, and in just August it was revealed that the leader of the notorious Finks bikie gang was promised $40 million in Australian taxpayers’ money for security and policing.\nThe move gives context to the Government’s attempts this week to sneak laws into the Parliament that would strip the right to fairness from decisions to deport people under this arrangement. They are expected to try to rush the laws through in the coming week.\nThis secret deal has real life implications for a huge number of people, opening the door to mass, without-notice deportations to harm under the powers the government gave themselves in their brutal Bills passed in the last sitting week of 2024, which have the potential to apply to over 80,000 people, tearing families apart and destroying lives forever.\nJana Favero, Deputy CEO of the Asylum Seeker Resource Centre said:\n“The Albanese government has already thrown $13 billion of Australian taxpayers money down the toilet in these outrageous deals to inflict cruelty on people. These secret deals send one clear message – in Australia, some people will be punished simply because of where they were born. This deal is discriminatory, disgraceful and dangerous. At a time when the entire country has just voted for unity and rejected fear, rather than embrace this and show leadership, the Albanese Government has launched yet another attack on migrants and refugees. An attack that will result in the most significant of outcomes – mass deportation.”\nSarah Dale, Centre Director and Principal Solicitor at the Refugee Advice and Casework Service said:\n“Earlier this year it was found by the UN that the Australian Government could not outsource their obligations to Nauru. The Government was found to have breached the human dignity of those it sent there. It’s extraordinarily alarming, some months later, the Government proposes to send even more people warehoused offshore in yet another secret backdoor deal. Where does it end? The human cost, including that of family separation under this evolving offshore regime just continues to escalate.”\nBethany Rose from the Visa Cancellations Working Group (a nationwide coalition of lawyers, academics and professionals) said:\n“This is policy-making at its worst. It takes Australia down a dangerous path: secret deals, avoidance of scrutiny, without-notice exiling of refugees; and outsourcing of key responsibilities at extreme human cost. We are talking about people’s lives. Like anyone else, these people have served their time and restarted their lives in the communities, recovering after what may be years of indefinite detention. When the Government starts offshoring its citizens into responsibilities and dismantling key legal and accountability protections, we should all be gravely alarmed.”\nMedia enquiries\nFor further information or to request an interview, contact Natasha Blucher (ASRC) on +61 412 034 821 or media@asrc.org.au\nLeave a reply\nConnect with us\nNeed help from the ASRC? Call 03 9326 6066 or visit us: Mon-Tue-Thur-Fri 10am -4pm. Closed on Wednesdays."
    }
  ],
  "argos_summary": "Australia and Nauru signed a memorandum of understanding to allow the Australian government to deport people without valid visas to Nauru, with Australia paying Nauru 408 million AUD upfront and 70 million AUD annually for resettlement. The deal, announced on Friday, has been condemned by refugee advocates and human rights groups who warn it could enable mass, unannounced deportations and violates international conventions. Australian Home Affairs Minister Tony Burke defended the agreement as a necessary visa‑system measure, while critics argue it is discriminatory and dangerous, especially amid recent policy changes that could affect up to 80,000 people.",
  "argos_id": "FO6DHUAHL"
}