{
  "url": "https://www.bloomberg.com/news/videos/2025-08-26/balance-of-power-late-edition-8-25-2025-video",
  "authorsByline": "bn",
  "articleId": "25aef0db0ad643a98ccb02981cef4367",
  "source": {
    "domain": "bloomberg.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/ifMs2cbNFdcs/v3/-1x-1.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-26T00:39:28.483000+00:00",
  "addDate": "2025-08-26T00:59:08.171698+00:00",
  "refreshDate": "2025-08-26T00:59:08.171701+00:00",
  "score": 1.0,
  "title": "Trump Threatens to Send National Guard to Chicago",
  "description": "\"Balance of Power: Late Edition\" focuses on the intersection of politics and global business. On today's show, Mary Lovely, Peterson Institute for International Economics Senior Fellow, discusses her takeaways from President Trump meeting with South Korean President Lee Jae Myung. Rep. Robin Kelly (D) Illinois shares why Chicago does not need the National Guard, and Nancy Tengler, Laffer Tengler Investments CEO & CIO, talks about President Trump taking equity stake in Intel and the impacts of his tariffs. (Source: Bloomberg)",
  "content": "> > THIS IS BALANCE OF POWER LIVE , FROM WASHINGTON, D.C. JOE: > > FROM BLOOMBERG'S WASHINGTON, DC STUDIOS TO OUR TV AND RADIO AUDIENCES WORLDWIDE, WELCOME TO \"BALANCE OF POWER.\" I JOE MATHIEU. TODAY THE PRESIDENT EXERTS POWER IN UNLIMITED WAYS. PRES. TRUMP: I'M NOT A DICTATOR. WHEN I SEE WAS HAPPENING TO OUR CITIES, AND THEN YOU SEND IN TROOPS, INSTEAD OF BEING PRAISED, THEY'RE SAYING YOU'RE TRYING TO TAKE OVER THE REPUBLIC. JOE: FROM ARM TO NATIONAL GUARD TROOPS NOW WALKING THE STREETS OF D.C. WITH THE PRESIDENT THREATENING TO SEND IN TROOPS TO OTHER CITIES LIKE CHICAGO AND NEW YORK, TO WIN POWER WORSTED -- OR STEAD REELING FROM BLOCKING IT PROJECT ON THE CUSP OF COMPLETION, TO THE FEDERAL STAKE IN INTEL WITH THE CHIPMAKER NOW WARNING THE U.S. GOVERNMENT THEY COULD IN FACT HURT GLOBAL BUSINESS. NOW THE PRESIDENT NAMING HIS IRE AND SOUTH KOREA ON TRUE SOCIAL BEFORE EXPRESSING OPTIMISM WHILE SITTING DOWN WITH THE COUNTRY'S NEW PRESIDENT ANY OVAL OFFICE AFTER THE TWO NATIONS STRUCK A TRADE DEAL TO TAP CARE OF SET 15%. PLUS ELON MUSK'S NEW LAWSUITS AGAINST APPLE AND OPENAI, SEEING BILLIONS IN DAMAGES AFTER ACCUSING BOTH COMPANIES OF HURTING ARTIFICIAL INTELLIGENCE COMPETITION. ALSO THIS EVENING, NATIONAL DEMOCRATS CONVENING TO TAKE STOCK AND FIND A PATH FORWARD IN 2026 AND BEYOND. WE STARTED AT THE WHITE HOUSE. THANKS FOR JOINING US ON BLOOMBERG TV AND RADIO AS PRESIDENT TRUMP POST-E SOUTH KOREAN COUNTERPART, JUST HOURS BEFORE THE MEETING PRESIDENT TRUMP STOPED TENSION BY POSTING TO SOCIAL MEDIA, WHAT IS GOING ON IN SOUTH KOREA? SEEMS LIKE A PERJURER REVOLUTION, HE WROTE. WE CAN HAVE THAT AND DO BUSINESS THERE. DURING THE MEETING, THE SOUTH KOREAN LEADER LAUNCHING A CHARM OFFENSIVE, DESPITE PRESIDENT FROM SAYING HE WAS RELUCTANT TO RENEGOTIATE ANY TRADE DEAL. PRES. TRUMP: WE HAVE SOME ADDITIONAL TRADE BECAUSE I HEAR THEY WANT TO RENEGOTIATE THE DEAL, BUT THAT'S OK, I DON'T MIND THAT. THAT DOESN'T MEAN THEY'RE GOING TO GET ANYTHING, BUT I DON'T MIND. > > ARE YOU ABLE TO SUSTAIN -- GOING FORWARD, HOPE TO DEVELOP A FUTURE ORIENTED ALLIANCE FOR SECURITY AND ALSO THE ECONOMY AND SCIENCE AND TECHNOLOGY. JOE: JOINING US WITH MORE IS BLOOMBERG'S WENDY BENJAMINSON LIVE IN OUR WASHINGTON BUREAU. WE BROUGHT THOSE REMARKS TO OUR VIEWERS LIVE FROM THE OVAL OFFICE AND IT WAS A LITTLE BIT DIFFICULT TO TELL EXACTLY WHAT PRESIDENT TRUMP WAS GETTING AT, REFERRING TO A PERJURER REVOLUTION. GUESS HE WAS REFERRING TO WHAT HE REFERRED TO AS RAIDS IN CHURCHES THAT WENT INTO MILITARY BASES. IT WAS A PRETTY OUTRAGEOUS ALLEGATION. WAS IT SETTLED TODAY? > > I DON'T KNOW IF IT WAS SETTLE, BUT WHAT WE HAVE DETERMINED THAT HE WAS TALKING ABOUT AT LEAST WAS PART OF THE INVESTIGATION INTO LEE'S PREDECESSOR WHO WAS IMPEACHED AND THEN THERE WAS A MARTIAL LAW THING, THERE WAS A BIG MESS THERE A FEW MONTHS AGO AND SOUTH KOREA. NOW THERE IS AN INVESTIGATION INTO CORRUPTION BY THE FORMER PRESIDENT AND HIS FAMILY. AND SO THE SOUTH KOREAN LAW ENFORCEMENT DID GO INTO A UNIFICATION CHURCH, WHICH IF YOU REMEMBER FROM THE OLD DAYS WE USED TO CALL THEM THE MUNIS, AND THEY RATED -- THE MOONIES AND THEY RATED THE UNIFICATION CHARGE FOR CORRUPTION. THAT'S WHAT THIS WAS ABOUT. IT WAS A FEW DAYS AGO. I DON'T KNOW OF ANY INCIDENT -- INSURGENCIES INTO U.S. MILITARY BASES, WE HAVEN'T ALREADY THING ABOUT THAT IS TRUMP SUGGESTED HAPPEN, BUT IT'S PART OF THE INTERNAL POLITICS GOING ON IN SOUTH KOREA. I DON'T KNOW -- THAT'S AS MUCH AS I KNOW. JOE: DON'T PLAY VIDEOS FOR THE PRESIDENT OF SOUTH AFRICA AND WHAT SOME THOUGHT MIGHT BE AN AMBUSH, BUT THEY SEEM TO GET ALONG, THE PRESIDENT REACHED FOR KIM JONG-UN AND TALKED ABOUT HIS GREAT RELATIONSHIP WITH THE NORTH KOREANS, DOES THAT HELP US? > > NO, IT DOESN'T. IT MUST'VE BEEN VERY UNCOMFORTABLE FOR PRESIDENT LOU WHO WE SAW SITTING THERE VERY STIFF WITH A SMILE SORT OF PLASTER ON HIS FACE, WAITING FOR THE TRANSLATIONS. AND SUGGESTING THAT THERE BE A TRILATERAL MEETING WITH KIM JONG-UN, WHICH A REPORT ABOUT IT, BUT TRUMP SORT OF EMBRACED IT, LIKE, YES, LET'S ALL GET TOGETHER AND TALK. AND PRESIDENT XI, WHICH WOULD BE EXTRAORDINARY AND HIGHLY UNLIKELY THAT IT WOULD HAPPEN. AND HE LEFT EMPTY-HANDED. HE TRIED TO RENEGOTIATE THE TRADE DEAL AND IN THAT I WOULD NO CHANGES WHATSOEVER. SO THE TRIP IS OVER NOW, AND WE WILL SEE WHAT HAPPENS NEXT. JOE: THANK YOU AS ALWAYS FOR THE INSIGHTS. MORE ON TODAY'S MEETING IS MARY LOVELY, SENIOR FELLOW AT THE PETERSON INSTITUTE FOR NATIONAL ECONOMICS, AN EXPERT IN U.S. AND CHINA TRADE RELATIONS. AS YOU WILL KNOW IF YOU'RE FAMILIAR WITH THIS PROGRAM. GREAT TO HAVE YOU BACK. DID TODAY'S SESSION WITH THE SOUTH KOREAN PRESIDENT BRING US CLOSER TO OR FURTHER AWAY FROM A DEAL WITH CHINA? > > ONE OF THE ISSUES FOR SOUTH KOREA AND OTHER ASIAN NATIONS IS HOW MUCH THEY ARE WILLING TO REMAIN INTEGRATED WITH CHINA IN TERMS OF THE EXPORTS TO THE UNITED STATES. SO THERE ARE VERY IMPORTANT ISSUES THAT NEED TO BE DISCUSSED WITH THE U.S., IF THE U.S. DEMANDS THE SO-CALLED RULES OF ORIGIN OR CHANGE, LIMITING THE AMOUNT OF CHINESE CONTENT IN EAST ASIAN EXPORTS TO THE U.S., THAT WILL REALLY HAVE IMPLICATIONS FOR THEIR BUSINESSES. THEY MAY HAVE TO CREATE SOME SUPPLY CHAINS EXCLUSIVELY FOR THE UNITED STATES. SO THERE ARE SERIOUS ISSUES. I'M AFRAID TODAY'S DISCUSSION REALLY TOUCHED ON THINGS THAT EVEN THE PRESIDENT SEEMED TO BE ADMITTING WERE MISUNDERSTANDINGS OR MISINFORMATION. SO I DON'T THINK WE MOVED THE BALL AT ALL TODAY. JOE: I WANT TO ASK YOU AS WELL ABOUT THIS INVESTMENT IN U.S. SHIPBUILDING THAT WE HEARD ABOUT LAST WEEK ON UBER, WE TALKED ABOUT THIS WITH GENE SEROKA. BUT IT'S SOMETHING I ASKED CHRISTOPHER SMART ABOUT TODAY. HE WAS AN ECONOMIC ADVISOR TO PRESIDENT OBAMA. ABOUT THE CURRENT TRADE DEAL BETWEEN THE U.S. AND SOUTH KOREA AND WHAT IT MIGHT MEAN FOR INVESTMENT IN OUR SHIPBUILDING. LISTEN TO WHAT HE SAID. > > KOREA HAS COMMITTED TO INVEST I THINK $350 BILLION IN THE U.S., INCLUDING IN SHIP GOING. IN RETURN FOR THAT, THEY WERE ABLE TO MATCH TARIFFS THE JAPANESE GOVERNMENT WAS ABLE TO SECURE FOR 15%. ON PAPER AT LEAST IT LOOKS LIKE A VERY GOOD DEAL FOR KOREA IN THE CONTEXT OF WHAT OTHER COUNTRIES HAVE BEEN GETTING. JOE: HOW DOES BEIJING ABOUT KOREA INVESTING IN U.S. SHIPBUILDING? > > I THINK JUST ON THE SURFACE THERE'S NOTHING WRONG WITH SOUTH KOREA INVESTING IN U.S. SHIPBUILDING. SOUTH KOREA HAS AN ADVANTAGE IN SHIPBUILDING, THEY WOULD BE WELCOMED -- A WELCOME INVESTOR IN THE U.S. TO INCREASE SHIPBUILDING. I THINK THE CHINESE UNDERSTAND THAT WHAT IS LOOMING IN THE BACKGROUND ARE COMING CHARGES ON CHINESE SHIPS THAT DOCKED IN THE UNITED STATES, PARTICULARLY THOSE THAT ARE OWNED BY CHINESE COMPANIES, SO CHINA HAS TO SEE THIS AS AN OFFENSIVE MOVE, EVEN THOUGH ON ITS FACE THE SIMPLE FOREIGN INVESTMENT SOUTH KOREA AND THE UNITED STATES IS NOT REALLY A THREAT TO THEM. JOE: INTERESTING. THERE'S A LOT MORE THAT WE CAN TALK ABOUT HERE WITH REGARD TO CHINA, INCLUDING A POTENTIAL MEETING, THE PRESIDENT WAS ASKED TODAY ABOUT IT. SETTING UP A MEETING, A BILATERAL OR TRILATERAL MEETING, THE U.S., SOUTH KOREA, AND CHINA, THEY EVEN SUGGESTED KIM JONG-UN FROM NORTH KOREA. IS THIS JUST HAPPY TALK IN SORT OF AN OFFHAND REMARK ENABLED OFFICE OR SOMETHING THAT COULD ACTUALLY HAPPEN? > > PRESIDENT XI JINPING IS NOT GOING TO ENGAGE IN ANY MEETING, INCLUDING BILATERALLY, WITH PRESIDENT TRUMP UNLESS THERE IS A DEAL THAT IS ALREADY JUST WAITING TO BE INKED. IT IS COMPLETELY UNCLEAR WHAT WE WANT FROM NORTH KOREA IN THE TRUMP ADMINISTRATION, AND IF THE NORTH KOREANS ARE ANYWHERE CLOSE TO BE HAVING -- BEING ABLE TO DO IT OR ANY SECURITY GUARANTEES OF CHANGES, THEY ARE VERY MUCH INVOLVED DEEPLY IN THE ARMS TRADE AND THEY ARE ADVANCING THEIR TECHNOLOGY. IT'S VERY HARD TO SEE WHAT THEY THINK THEY COULD GAIN FROM SOME KIND OF MORATORIUM OR WHATEVER IT IS THE PRESIDENT BELIEVES THAT HIS SPECIAL RELATIONSHIP WITH KIM JONG-UN COULD PROVIDE FOR THE UNITED STATES. SO RIGHT NOW I HAVE TO SAY IT SOUNDS LIKE HAPPY TALK. THERE'S NOT GOING TO BE ANY SUCH MEETING UNLESS THERE IS A LOT OF DIPLOMATIC GROUNDWORK THAT GETS DONE AND REAL OUTCOMES THAT THE CHINESE COULD SIGN ON TO. JOE: PRESIDENT TRUMP IS STILL THREATENING MORE TARIFFS ON CHINA, I BELIEVE A 200% TARIFF WAS THE THREAT TODAY, IF NO MAGNETS -- THE LATEST STRATEGY I GUESS OF PREEMPTING WHATEVER THE NEXT CONVERSATION IS GOING TO BE WITH BEIJING, BUT WE ARE ALREADY SEEING CHINA PULL BACK. I'M SURE YOU SEEN EVIDENCE OF THIS AS WELL. I MENTION GENE SEROKA, HE JOINED US FROM LOS ANGELES AND TALKED ABOUT THE SHIFTING CARGO SHIP CEASING SINCE PRESIDENT TRUMP'S TARIFFS POLICIES TOOK EFFECT. LISTEN TO HOW HE PUT IT. > > WHAT WE HAVE SEEN HIS CARGO EMANATING FROM CHINA REALLY DROPPING. BACK IN 2018 IT WAS 60% OF OUR PORTFOLIO. TODAY IS 45% AND CONTINUING TO DECLINE. AN UPTICK FROM VIETNAM, INDONESIA, MALAYSIA, AND THAILAND. NOT SO MUCH FROM INDIA. WITH THE 50% TARIFF SLAPPED ON THAT COUNTRY, I DON'T SEE MUCH CHANGE THERE YET, BUT DEFINITELY A SHIFT TO SOUTHEAST ASIA. JOE: ARE THOSE NUMBERS A MOTIVATING FACTOR FOR PRESIDENT XI? HELLO CAN THOSE NUMBERS GET BEFORE CHINA NEEDS TO WORRY? > > I THINK IT'S JUST REFLECTIVE OF WHAT WE HAVE SEEN IN THE SHIFT AWAY FROM DEPENDENCE ON THE AMERICAN MARKET IN CHINA HAS BEEN HAPPENING FOR A VERY LONG TIME. CHINA GOT THE MESSAGE TO DIVERSIFY ITS TRADE, ITS IMPORT SOURCES AND EXPORT DESTINATIONS LIGHT A WHILE AGO. THE U.S. HASN'T BEEN STRATEGIC ABOUT DOING THAT EXCEPT IN THE CASE OF CHINA WHERE WE RAISE TARIFFS EARLY ON IN THE FIRST TRUMP ADMINISTRATION. THESE KINDS OF THREATS ARE NOTHING NEW TO PRESIDENT XI JINPING. THIS IS NOT GOING TO MOVE HIM. YES, IT IS CAUSING PAIN FOR PARTICULARLY COASTAL PROVINCES THAT ARE HEAVILY DEPENDENT ON EXPORT MANUFACTURING, BUT THIS IS NOT THE FUTURE OF CHINA AND XI JINPING SEES IT. THE CHINESE HAVE NOW HAD TO -- A SHOT ACROSS THE BOW, A BIG ONE. WE ARE GOING TO WITHHOLD MAGNETS IF YOU CONTINUE TO TRY TO BULLY US, AND WHAT THEY'VE GOTTEN RESPONSES, MORE BULLYING. THEY DO HAVE TOOLS THAT THEY COULD USE TO HURT THE UNITED STATES, AND THEY ARE TRYING TO GET THE U.S. TO THE BARGAINING TABLE JUST AS MUCH AS THE U.S. IS TRYING TO GET CHINA. SO THIS IS A RELATIONSHIP THAT BOTH SIDES NEED RIGHT NOW BUT TODAY WE ARE NOT SEEING ANY REAL CHANGE OR BREAKTHROUGH THAT WILL GIVE US A HINT AS TO WHERE THIS IS GOING TO END UP. JOE: SO WHAT HAPPENS FIRST, MAGNETS ARE SHOWING UP, OR ARE WE ACTUALLY SEEING A 200% TARIFF ON CHINA? > > IF WE SEE A 200% TARIFF, WE ARE DEFINITELY NOT GOING TO SEE MAGNET AND WE WILL SEE MORE THINGS DISAPPEAR AREA THERE ARE MANY CATEGORIES WHERE CHINA IS THE DOMINANT SUPPLIER. SO THEY HAVE MORE BULLETS, IN A SENSE, TOO FAR BEHIND THIS ONE. I THINK THE NEGOTIATORS, SECRETARY BESSENT AND THE TRADE REPRESENTATIVE ARE DOING ALL THEY CAN TO MAKE SURE THEY CAN GET A NEGOTIATING SETTLEMENT TO DISPUTE, AND ON THE CHINESE SIDE, TO THE LIKING OF PRESIDENT XI JINPING. WHETHER THEY CAN MAKE THAT PROGRESS IN TIME TO MEET PRESIDENT TRUMP'S -- WHICH SEEMS TO BE AN INCREASINGLY SHORT FUSE, WE REALLY DON'T KNOW. THAT IS A CONTINUING SOURCE OF GREAT UNCERTAINTY, NOT ONLY FOR THE PORT OF L.A., BUT FOR ALL BUSINESSES. BUT THERE'S OTHERS OUT THERE, THE 50% ON BRAZIL, THE INCREASING TENSIONS THAT HAVE BEEN THROWN AT OTHER COUNTRIES LIKE INDIA, THOUGH STILL REMAIN OUT THERE, EVEN AS SOME UNCERTAINTY HAS DISSIPATED. NOW THAT WE HAVE DEALS WITH MANY OF THE ADVANCED ECONOMIES IN THE WORLD SUCH AS JAPAN, SOUTH KOREA, ETC. IN THE PRESENT HOUSE A MEETING LIKE HE DID TODAY TALKING ABOUT TRADE DEALS WITH SOUTH KOREA, I THINK THAT MAKES COMPANIES WORRY ABOUT WHERE IS THE BEST PLACE TO INVEST AND SOURCE. JOE: IT'S ALWAYS GREAT TO HEAR YOUR INSIGHTS, MARY. MARY LOVELY, WE THANK YOU. THIS MORNING A BLOOMBERG SURVEILLANCE, ANALYSTS DISCUSS HOW MARKETS ARE WATCHING TARIFFS AND INFLATION. > > THE RHETORIC SAYS THAT THE 2% TARGET IS GOING TO STICK AROUND, BUT LET'S BE HONEST, THEY'VE MISSED IT FOR A 52 MONTHS. THEY ARE LIKELY TO MISS IT FOR ANOTHER YEAR, GIVEN WHAT POWELL SAID YESTERDAY AND THE PAIR OF'S TERRACE. > > INFLATION FROM TARIFFS HAS NOT YES HAPPEN BUT IT'S ON THE WAY -- AND THE PACE OF TARIFFS. > > THERE'S A LOT OF BUSINESSES IN CONSUMER AND TECH HARDWARE. > > WE'RE ABOUT TO SEE MARTELL MOLD IN THAT TARIFF SPACE THAN WE DID IN THE FIRST HALF OF THE YEAR. JOE: FOR A CLOSER LOOK ON HOW WASHINGTON IS WATCHING ALL THIS, ROMAINE BOSTICK JOINS US LIVE FROM WORLD HEADQUARTERS IN NEW YORK. ROMAINE: THEY ARE STILL HAVING THE CONVERSATION BUT THE MARKET'S ATTENTION HAS SHIFTED JUST A BIT. THERE'S A LOT OF TALK ON FRIDAY ABOUT THE DOVISH COMMENTS FROM JAY POWELL, THE POTENTIAL RATE CUTS. RIGHT NOW THE BIG FOCUS IS ON NVIDIA AND THERE'S BEEN A BIG JOKE OF WHAT IS MORE IMPORTANT TO THIS MARKET, WHAT JAY POWELL DOES NEXT, WHAT PRESIDENT TRUMP DOES NEXT, OR WHAT JENSEN HUANG DOES NEXT. WE WILL FIND OUT ON WEDNESDAY WHEN NVIDIA DOES REPORT EARNINGS. WE SHOULD POINT OUT THE STOP ALONG MAKES UP 10% OF THE S & P 500 SO AS IT GOES, SO, TOO, DOES THE BROADER MARKET. BUT THERE'S A TRADE POLICY TIE INTO ALL THIS. THIS IS A COMPANY THAT PRIOR TO JUST A COUPLE OF YEARS AGO MADE THE MAJORITY OF ITS REVENUE FROM OVERSEAS, NOT U.S. COMPANIES. BUT THE REVENUE SHIFT HAS SHIFTED MORE TOLD -- TOWARD U.S. BASED COMPANIES. SOME OF THAT IS DUE TO AI TRADE BUT THERE'S A BIG CONCERN RIGHT NOW THAT THIS COMPANY IS NOT ABLE TO FEEL INTO FOREIGN MARKETS AT THE SAME RATE AS IT WOULD HAVE BECAUSE OF THE POLICIES COMING OUT OF THE WHITE HOUSE. AND WHEN WE GET THAT EARNINGS REPORT AFTER THE BELL ON WEDNESDAY, THE BIG QUESTION WILL BE HOW MUCH REVENUE AND EARNINGS IT MADE, BUT MORE IMPORTANTLY, WHAT JENSEN HUANG HAS TO SAY ABOUT THE COMPANY'S ABILITY TO REENTER AND EXPAND INTO THE CHINESE MARKET. JOE: WITH 8% OF THE S & P 500, IT SEEMS LIKE EVERYBODY'S GOING TO FEEL IT, FOR BETTER OR WORSE. BLOOMBERG'S ROMAINE BOSTICK IN NEW YORK. COMING UP, HOW THE MARKETS ARE RESPONDING TO PRESIDENT TRUMP'S ECONOMIC AGENDA BEYOND WHAT WE JUST HEARD. WE WILL DIVE INTO IT WITH NANCY TENGLER. FIRST, THE PRESIDENT HAS AMPLIFIED HIS CRITICISM OF BLUE CITIES LIKE CHICAGO WITH RENEWED THREATS TO SIN IN THE NATIONAL GUARD BEYOND D.C. AND L.A.. THAT IS NEXT ON \"BALANCE OF POWER,\" ON BLOOMBERG TV AND RADIO. PRES. TRUMP: CHICAGO, ILLINOIS IS A DISASTER. IN IS VIOLATING OUR RIGHTS. I MADE THE STATEMENT THAT NEXT YEAR IT WOULD BE CHICAGO BECAUSE AS YOU ALL KNOW, CHICAGO IS A KILLING FIELD, AND THEY DON'T ACKNOWLEDGE IT. JOE: IT'S \"BALANCE OF POWER,\" ON BLOOMBERG TV AND RADIO. I'M JOE MATHIEU IN WASHINGTON. THANK YOU FOR JOINING US. PRESIDENT TRUMP FROM THIS MORNING IN THE OVAL OFFICE, REITERATING HIS CRITICISM OF CHICAGO, FLOATING THE IDEA THAT IT MAY WELL BE THE NEXT CITY WHERE HE PLANS TO DEPLOY NATIONAL GUARD TROOPS. JOINING US WITH HER REACTION TO ALL THIS, PRESIDENT TRUMP'S LATEST COMMENTS, CRADDICK REPRESENTATIVE FROM CHICAGO. TODAY'S NOT THE FIRST TIME THAT HE SAID IN FACT CHICAGO WOULD BE NEXT, WITH NATIONAL GUARD TROOPS DEPLOYED ON THE STREETS OF YOUR CITY. THE WHITE HOUSE EVEN PUT OUT A FACT SHEET TODAY REFUTING THE NARRATIVE OF LOWER CRIME RATES IN YOUR CITY. TALKING MORE ABOUT ANECDOTAL EVIDENCE, THE WAY PEOPLE FEEL. GIVE US YOUR TAKE ON WHAT IS HAPPENING ON THE STREET THERE, DOES CHICAGO NEED THE NATIONAL GUARD TO KEEP STREETS SAFE? > > CHICAGO DOES NOT NEEDS AND NATIONAL GUARD. CHICAGO COULD USE GUN VIOLENCE INTERVENTION FUNDING THAT HE SEEN FIT TO CLAW BACK FROM AGENCIES THAT WERE PROMISED FUNDING AND HE WAS SO WORRIED ABOUT CRIME HE WOULD NOT HAVE SHUT DOWN THE OFFICE OF GUN VIOLENCE PREVENTION ON DAY ONE OR TWO OF HIS PRESIDENCY. THE STATS ARE THE STATS, CRIME HAS GONE DOWN. NO ONE HAS SAID THERE'S NO MORE CRIME, BUT CHICAGO WAS WORKING ON IT, AND THEY BEEN WORKING ON IT, AND WE ARE SEEING THE PROOF OF THEM WORKING ON IT. CRIME HAS GONE DOWN. IT'S NOT ELIMINATED, BUT IT HAS GONE DOWN. JOE: I'M LOOKING AT CHICAGO'S CRIME TRACKER, IT'S GOT CRIME DOWN IN ALL CATEGORIES FROM THIS TIME LAST YEAR. DO YOU BELIEVE THAT'S A TOTAL REPRESENTATION OF WHAT IS HAPPENING IN CHICAGO? > > I DO. I DON'T THINK THE MAYOR OR ANYBODY ELSE IS TRYING TO SAY IS NOT MORE WORK TO DO. THERE IS MORE WORK TO DO. ANY CRIME IS TOO MUCH CRIME, BUT HE'S POINTING TO ALL DEMOCRATIC CITIES AND I WOULD SAY ALL DEMOCRATIC CITIES THAT HAVE BLACK MAYORS ON TOP OF IT. THIS IS PART OF HIS SCHEME OF FEAR, RACISM AND DIVISION. JOE: YOU KNOW WHAT A LOT OF REPUBLICANS ARE SAYING RIGHT NOW, AND I'VE BEEN HEARING THIS SINCE BEFORE CHICAGO WAS PART OF A CONVERSATION, IS THAT THIS IS A WIN POLITICALLY FOR REPUBLICANS, THAT THE WHOLE POINT OF THIS IS FOR DONALD TRUMP GET DEMOCRATS LIKE YOU TO PUSH BACK ON THIS IDEA, TO REINFORCE THE IDEA THAT DEMOCRATS ARE SOFT ON CRIME, CONGRESSWOMAN. HOW WOULD YOU REACT TO THAT? > > WE ARE NOT SOFT ON CRIME, WE JUST HAVE OTHER WAYS TO DEAL WITH IT. JOE: IS THIS AN EFFORT TO TRY TO MAKE YOU LOOK SOFT ON CRIME? > > I'M SURE THEY WILL TRY EVERYTHING THEY CAN DO BECAUSE THEY KNOW THEY'RE ON THEIR WAY TO LOSING IN NOVEMBER 2026, AND HE DOESN'T WANT TO GIVE UP HIS KINGDOM. SO THAT'S WHAT THIS IS ALL ABOUT. WE JUST HAVE TO KEEP SPEAKING THE TRUTH AND ALSO DO EVERYTHING THEY CAN DO TO DECREASE CRIME IN ALL OF OUR CITIES, BUT THERE'S A LOT OF PROOF THAT RED STATES HAVE CRIME, TOO, A LOT OF CRIME. JOE: HE WAS ASKED TODAY IF HE WOULD SEND GUARD TROOPS INTO CITIES IN RED STATES, HE SAID THERE WEREN'T MANY OF THEM, BUT THAT HE WOULD, IN FACT. YOU STARTED TALKING ABOUT THE FUNDING YOU WOULD NEED TO PURSUE CRIME PROGRAMS IN CHICAGO. QUARTER OF THE PROVEN METHODS YOU ARE REFERRING TO? > > YOU CAN LOOK AT, PEOPLE TALK ABOUT, I CAN NAME AND LOT OF ORGANIZATIONS PEOPLE HAVE NOT HEARD OF, THERE'S A LOT OF DIFFERENT PROGRAMS THAT WORK TO KEEP KIDS OFF THE STREET, TO GET KIDS HOPE, TO GIVE THEM POSITIVE THINGS AND NEW PROVEN METHODS OF GUN VIOLENCE PREVENTION. IT DOESN'T STOP EVERYTHING, DOESN'T STOP EVERY MURDER, EVERY HOMICIDE OR SUICIDE, BUT THERE'S DEFINITELY IMPROVEMENTS AND THOSE ARE IMPROVEMENTS ALL AROUND THE UNITED STATES, NOT JUST IN CHICAGO. JOE: WHERE ARE THE GUNS COMING FROM? ILLINOIS HAS VERY STRICT GUN LAWS. THEY ARE COMING FROM OUT OF STATE. CAN THEY BE STOPPED AT THE BORDER? > > LIE PART OF IT WAS TRAFFICKING, EVERY TIME A WAY TO D.C., PEOPLE WOULD SAY THAT CHICAGO HAS THE TOUGHEST GUN LAWS, BUT HAVE NO ON ELSE AROUND US HAS TOUGH GUN LAWS, IT MAKES IT VERY HARD. IF YOU TAKE THE RESOURCES AWAY FROM ALCOHOL, TOBACCO AND FIREARMS, WHOSE JOB IT IS TO TRACK GUNS, IT'S DIFFICULT TO DO THAT. I BELIEVE SINCE I'VE BEEN IN CONGRESS, THE LAST 12 YEARS, INDIANA HAS MADE IT EVEN EASIER TO BUY A GUN IS OTHER PLACES HAVE AROUND THE UNITED STATES. SO OUR GUNS COME FROM INDIANA, I WOULD VENTURE TO SAY THEY'RE COMING FROM SOME OF THE SOUTHERN STATES. I KNOW IN NEW YORK THEY TALK ABOUT THEIR GUNS COMING UP FROM THE SOUTHERN STATES ALSO. BUT WE'RE KIND OF LIKE AN OASIS, AT LEAST NEW YORK HAS NEW JERSEY AND CONNECTICUT, OR OTHER PLACES. JOE: I WANT TO ASK ABOUT NO CASH BAIL, THE PRESIDENT SIGNED A NOTE ENDING THAT PRACTICE. YOUR STAY WITH THE FIRST TO PASS A CASHLESS BAIL LAW. WHAT DOES PRESIDENT TRUMP NOT UNDERSTAND? > > HE DOESN'T UNDERSTAND THAT JUDGES NEED MORE DISCRETION TO MAKE THAT DECISION. THEY CAN SAY NO, I THINK IT IS SOMEONE THAT WILL GO OUT AND BE VIOLENT, THEY ARE TOO RISKY, BUT IF THEY HAVE NOTHING IN THE PAST OR THE JUDGE FEELS THAT THEY WILL BE SAFE, AND IT'S OK TO LET THEM OUT, THEY HAVE TO HAVE DISCRETION. BUT DONALD TRUMP DOESN'T CARE. AGAIN, THIS IS PART OF HIS FEAR, PART OF HIS DISTRACTION FROM OTHER THINGS GOING ON IN THE WORLD, OTHER THINGS GOING ON IN THE UNITED STATES, LIKE HE SAID HE WOULD LOWER PRICES, THAT HASN'T HAPPENED. SO THESE ARE ALL DISTRACTIONS. JOE: LET'S KEEP TALKING ABOUT THIS, IF THE GUARD IN FACT I SHOW UP IN CHICAGO. COMING UP, DEMOCRATS FROM AROUND THE COUNTRY GATHERING IN PRES. TRUMP: I JUST MADE 0 BILLION OR 11 BOONE DOLLARS FOR THE UNITED STATES OF AMERICA. YES, THERE WILL BE OTHER CASES TO HAVE THAT OPPORTUNITY, AND YOU DO HAVE STUPID PEOPLE SAY THAT'S A SHAME. IT IS NOT A SHAME. IT IS CALLED BUSINESS. JOE: IT'S \"BALANCE OF POWER,\" ON BLOOMBERG TV AND RADIO. I'M JOE MATHIEU. HAVING HEARD FROM PRESIDENT TRUMP EARLIER TODAY TELLING THE GOVERNMENT'S 10% STAKE IN INTEL, SAYING HE WOULD WANT TO SEE MANY MORE CASES LIKE IT. THAT RUNS COUNTER TO THE VIEW OF SOME IN HIS OWN PARTY. KEVIN O'LEARY, OF SHARK TANK FAMOUS SAYING TODAY, I AM POOR THIS IDEA. WE LET DITTO COMPANIES DIE IN OUR VERSION OF CAPITAL MARKETS. INTEL SHOULD HAVE BEEN SOLD FOR CAR PARTS THREE YEARS AGO. IT'S ONE OF SEVERAL COMPANIES ON WE SHOULD PRESIDENT HAS HAD DIRECT IMPACT, AMONG THEM TESLA, NVIDIA, NOW DID MARKS OR STAYED WHICH FELL TO A RECORD LOW AFTER BLOCKING CONSTRUCTION OF AN OFFSHORE WIND FARM BEING BUILT IN RHODE ISLAND. THERE ARE QUESTIONS ABOUT WHETHER THIS IS IN FACT CAPITALIST. > > NO DOUBT ABOUT IT, WE'VE HAD A STRING OF YOU HAVE THE DEAL WITH THE CHIP COMPANIES TO TAKE SOME OF THEIR REVENUE FROM CHIP SALES AND THEN EXAMPLES LIKE INTEL THAT YOU WERE MENTIONING AS WELL. CRITICS WOULD SAY THIS POSES SOVEREIGN RISK, A LOSS OF TAXPAYER MONEY, AND IDEOLOGICALLY THE GOVERNMENT SHOULD NOT BE COMPETING WITH THE FREE MARKETS. THE WHITE HOUSE IS ADAMANT, IN THE CASE OF INTEL, THEY REMIND VOTERS THAT INTEL IS ALREADY SAVING YES GOVERNMENT RESPONSE ANYWAY FROM THE CHIPS AT. VERY SLICK VIEWS ON THIS, BUT NO DOUBT ABOUT IT IT'S AN INTERVENTIONIST A REPORTS -- APPROACH. JOE: THE PRESIDENT WRITES ON TRUE SOCIAL, INTEL IS WORTH APPROXIMATELY 1 BILLION. BUYER STUPID PEOPLE UNHAPPY WITH THAT? IS IT TRUE WE PAID ZERO FOR INTEL? > > THE POINT HE'S MAKING IS, THEY PUT THESE CONDITIONS AROUND IT. BUT THERE IS TAXPAYER MONEY ON THE TABLE, THE QUESTION IS WILL THE GOVERNMENT GET THEIR RETURN ON INVESTMENT OR WILL THEY LOSE IT. INDUSTRY EXCERPTS WOULD SAY THERE'S LOVE SCRUTINY ON INTEL AND WHETHER IT CAN TURN AROUND. SO THE INTEL STORY HAS A BIT TO GO YET. JOE: HERE'S PRESIDENT IMPACT HYSTERIC POLICY IS HAVING ON THE STOCK MARKET. PRES. TRUMP: THE STOCK MARKET IS UP ALMOST A THOUSAND POINTS, AND IT'S BASICALLY ON THE NEWS THAT, THE RELEASE OF JUST CAME OUT FROM GOVERNMENT THAT THE TARIFFS THAT EVERYBODY WAS TALKING ABOUT , THAT THE WHOLE LAUREL RESPECTS US FOR HAS HAD A HUGE IMPACT IN THE STOCK MARKET IS WAY UP. JOE: JOINING US NOW ON \"BALANCE OF POWER,\" ON BLOOMBERG TV AND RADIO. ON TRIP THAT STRUMS POLICIES WHETHER THEY INCLUDE TAKING THE STOP NOT MISTAKEN INTEL OR ADDING NEW TARIFFS. NANCY TENGLER, IT'S GREAT TO HAVE YOU BACK HERE. BROADLY SPEAKING, IT IS HARD TO ARGUE WITH WHAT THE PRESIDENT IS SAYING, THE S & P 500 IS HANGING JUST BELOW AND ALL-TIME HIGH, WERE JUST ABOVE 6400 RIGHT NOW. IT DOESN'T LOOK LIKE A MARKET THAT'S TOO WORRIED ABOUT THE RISK OF TARIFFS TAKING EFFECT, DOES IT? NANCY: STILL LAUGHING ABOUT YOUR COMMENT ABOUT THE PRESIDENT WAS RIGHT ABOUT EVERYTHING. THE MARKET IS PRETTY SANGUINE, SO FAR DURING EARNINGS SEASON WE DID NOT SEE ANY MAJOR IMPACT FROM TARIFFS. MARGINS REMAINED NEAR HISTORIC HIGHS, COMPANIES WERE BEATING 83% ON THE BOTTOM LINE, 80% ON THE TOP LINE WHICH IS A NOTEWORTHY NUMBER. I DON'T REMEMBER EVER SEEING THAT MANY COMPANIES BEING ON THAT. ALL THAT SAID, WE HAVE NOT YET SEEN THE FULL FACTS OF TARIFFS. BUT I'M ONE OF THOSE WHO ARE SOMEWHAT SANGUINE BECAUSE THEY THINK THE CORPORATE TAX INCENTIVES ARE PRETTY ROBUST AND WILL BRING ABOUT 50 BILLION IN CASH TO CORPORATE BALANCE SHEETS, SO I THINK THAT IS A GOOD ENOUGH OFFSET FOR ME TO REMAIN BULLISH. BUT I'M NOT BULLISH BECAUSE TARIFFS HAVEN'T CAUSED A PROBLEM, I'M BULLISH BECAUSE WE REALLY ARE IN THE FOURTH INDUSTRIAL REVOLUTION, AND THAT TECHNOLOGY OF CAPEX WILL CONTINUE FOR SOME TIME AND THAT WILL DRIVE THE ECONOMY FOR SOME TIME. JOE: THAT'S GOING TO BE IN VERY CLEAR FOCUS ON WEDNESDAY WHEN NVIDIA REPORTS, BUT IT IS INTEL THAT WE WERE JUST TALKING ABOUT HERE, THAT STOCK WAS ACTUALLY LOWER TODAY. I KNOW IT WAS IN THE NEWS LAST WEEK BUT HAVING OF BARRAGE OF COMMENTARY FROM ADMINISTRATION OFFICIALS ON SUNDAY, THE PRESIDENT BACK OUT THERE TODAY DOESN'T SEEM TO BE DRAWING A MASSIVE AMOUNT OF RETAILER OR INSTITUTIONAL INVESTMENT INTO INTEL. WILL THAT CHANGE? > > I DON'T THINK SO. I THINK THIS IS ONE OF THE WORST IDEAS OF HEARD MY 40 YEARS OF BEING IN THIS BUSINESS. FIRST WELL, THE GOVERNMENT IS GOING TO DILUTE EXISTING SHAREHOLDERS. IF THE EXERCISE THOSE WARRANTS, IT WILL DILUTE EXISTING SHAREHOLDERS EVEN MORE. WHAT WE KNOW IS THAT INTEL IS SO FAR BEHIND, IT'S LIKELY THEY WILL NEVER CATCH UP. THE PITCH MADE TO THE PRESIDENT WAS WE ARE THE LAST OF THE ONLY HOMEGROWN CHIP MANUFACTURERS, BUT THE PLANT IN ARIZONA AND JUST IN GENERAL IS NOW DELAYED UNTIL 2031. SO THIS ALL SOUNDS GREAT AND THE PRESIDENT CAN SAY THAT HE MADE 0 BILLION FOR THE AMERICAN PEOPLE, BUT I REMEMBER CHRYSLER, AND THE FIRST BAILOUT WITH JIMMY CARTER IN 1970 NINE. LEE IACOCCA KIND OF TURN THINGS AROUND, BUT NOT REALLY. IN THE SECOND BAILOUT WAS IN 2009 AND I DON'T SEE A LOT OF CHRYSLERS ON THE ROADS. THE GOVERNMENT IS NOT GOOD AT THIS. THEY SHOULD FOCUS ON GOVERNING AND NATIONAL DEFENSE AND LEAVE BUSINESS TO BUSINESS PEOPLE. I GET IT, THE PRESIDENT IS A BUSINESS PERSON, BUT THAT IS NOT HIS ROLE CURRENTLY. I AGREE WITH KEVIN O'LEARY, MAYBE FOR THE FIRST TIME AND I CAREER. JOE: TAKE IT OUT BEHIND THE BARN AND SHOOT IT I THINK IS WHAT HE SAID. IT SOUNDS LIKE WE ARE GOING TO LOSE A LOT OF MONEY, IF YOU DON'T THINK INTEL IS EVER GOING TO CATCH UP. THAT'S A PRETTY REMARKABLE STATEMENT. I WANT TO ASK ABOUT THE FEDERAL RESERVE. THERE ARE A LOT OF QUESTIONS ABOUT WHETHER IT WAS JUSTIFIED FOLLOWING THE COMMENTS OF JAY POWELL I JACKSON HOLE. SUGGESTING THERE WERE HAWKISH UNDERTONES NOT REFLECTED IN THE REACTION ON WALL STREET. CHRISTOPHER SMART IS WITH OUR GROWTH GROUP, FORMER ECONOMIC ADVISER IN THE OBAMA ADMINISTRATION. HERE'S WHAT HE SAID ABOUT THE REACTION TO POWELL AT JACKSON HOLE. > > MARKETS ALWAYS TEND TO OVERREACT TO JACKSON HOLE BECAUSE IT FOLLOWS WHAT I CALLED IN THE PAST THE JACKSON HOLE IN SEOUL. THERE'S BEEN LITTLE GUIDANCE LEADING UP TO THOSE MEETINGS. THE SPEECH BECOMES ALL THAT MUCH MORE IMPORTANT AND THAT MUCH MORE CAREFULLY DISSECTED. WITH THE PRESSURE FROM THE WHITE HOUSE ON JAY POWELL HIMSELF ON SOME OF HIS FED COLLEAGUES, THERE'S JUST A LOT OF NOISE IN THE BACKGROUND. JOE: NANCY, IS A MARKET GOING TO FIND ITSELF OVER ITS SKIS IN SEPTEMBER? NANCY: POTENTIALLY. I THINK YOU SAW LITTLE BETTER PULLBACK TODAY AS INVESTORS DIGESTED WHAT HE DID SAYING WHAT HE DIDN'T REALLY SAY. BUT I'VE BEEN VERY CRITICAL OF THIS FED CHAIRMAN BECAUSE HE’'S PIVOTED, HE'S BEEN BEHIND AT EVERY TURNING POINT AND HE'S MADE A LOT OF STATEMENTS AND THEN GIVEN AND IN THE OPPOSITE DIRECTION AT THE NEXT MEETING. SO I'M ALWAYS SURPRISED THAT THE MARKET PUTS THIS MUCH CREDENCE INTO THIS PARTICULAR FED. I LONG AND FERVENTLY HOPE FOR THE DAYS OF ALAN GREENSPAN, WHERE WE HEARD NARY A WORD FROM THE FED CHAIRMAN, AND THAT LEFT INVESTORS ABLE TO JOE: JOE: DISSECT THE DATA. SO THERE'S TOO MUCH FED SPEAK IS WHAT IT COMES DOWN TO. NANCY: THERE IS. AND THIS FED CHAIRMAN HAS BEEN WRONG AN AWFUL LOT. LET'S KEEP OUR FINGERS CROSSED THAT WE GET SOME SORT OF MOVING AWAY FROM DATA DEPENDENCE BECAUSE WE KNOW THE NUMBERS HAVE BEEN FRAUGHT, AND THAT WE GET A NEW FED CHAIRMAN THIS GOING TO FOCUS ON NARROWING THE MISSION CREEP WE'VE SEEN FROM THE FED. JOE: I CAN ONLY ASSUME THAT SOME OF THE PRESSURE FROM PRESIDENT TRUMP WILL GET PEOPLE ADJUSTING EXPECTATIONS AS WE MAKE OUR WAY TOWARD THAT SEPTEMBER MEETING. IS THAT THE ONLY CUT WE WILL GET FOR THE REST OF THE YEAR? NANCY: IT MAY BE. I THINK THE FED WAS REMISS IN CUTTING 50 BASIS POINTS LAST FALL AND IN THE MARKET BACK THAT UP WITH A 100 BASIS POINT MOVE UP IN THE YIELD IN THE TENURE. IF WE GET A CUT -- HERE'S WHAT I WILL SAY ABOUT IT. IN THE 1990'S WE HAD 3% INFLATION AND A 5% FED FUNDS RATE. THE TENURE WAS BETWEEN 7% AND 8% AND WE HAD ROBUST DOC RETURN. IF PRODUCTIVITY DRIVES THIS ECONOMY AND THE MARKETS, WE WILL BE OK WE JUST A 25 BASIS POINT CUT. JOE: GREAT TO SEE YOU, NANCY TENGLER, GREAT TO HAVE YOU BACK ON BLOOMBERG. COMING UP, DEMOCRATS GATHER IN MINNEAPOLIS FOR THE BIG SUMMER MEETING OF THE DNC. WE WILL DISCUSS WHAT IS ON THEIR AGENDA. PLUS PRESIDENT TRUMP REITERATING HIS CRITICISM OF CHICAGO. WE'LL TALK ABOUT THE IMPLICATIONS OF HIM POSSIBLY SENDING TROOPS TO CHICAGO, NEXT ON \"BALANCE OF POWER,\" ON BLOOMBERG TV AND RADIO. JOE: THIS IS \"BALANCE OF POWER,\" ON BLOOMBERG TV AND RADIO. I'M JOE MATHIEU. HERE ARE SOME OF THE SORES WERE WATCHING IN TODAY'S POWER BRIEF. KILMORE ARE -- KILMAR ABREGO GARCIA IT HAS BEEN TAKEN INTO CUSTODY AGAIN AFTER HE WAS AGGRESSIVE -- ARRESTED AGAIN AFTER MANDATORY CHECKING APPOINTMENT. HAPPEN LESSON 72 HOURS AFTER THE JUDGE OVERSEEING HIS CRIMINAL CASE IN TENNESSEE RELEASED HIM SO HE COULD RETURN TO MARYLAND TO AWAIT TRIAL. THE ADMINISTRATION HAS THREATENED TO DEPORT HIM TO UGANDA, A COUNTRY WHERE HE HAS NO TIES UNLESS HE PLAYS -- PLEADS GUILTY TO HUMAN SMUGGLING CHARGES. HE'S A MARYLAND RESIDENT WHO IS MARRIED TO U.S. CITIZEN AND HAS FILED A CHALLENGE. A MARYLAND JUDGE HAS TEMPORARILY BLOCKED HIS DEPORTATION TO UGANDA. DEPRIVING CONSUMERS OF CHOICE, MUSK FILED A FEDERAL LAWSUIT TODAY IN FORT WORTH, TEXAS ON BEHALF OF HIS COMPANY'S X AND XAI. LAST YEAR APPLE ANNOUNCED HE WOULD PARTNER WITH OPENAI TO INTEGRATE CHATGTP INTO ITS PRODUCTS. THE LAWSUIT EXCLAIMS THE EXCLUSIVE ARRANGEMENT ALLOWS THE COMPANIES TO MAINTAIN THEIR LOT -- MALAAK ELISE -- MAINTAIN THEIR MINNEAPOLIS FOR THE D & C SUMMER MEETING, THE FIRST UNDER THE NEW CHAIR KEN MARTIN. > > WE CANNOT BE THE ONLY PART OF THAT PLACE BY THE RULES ANYMORE. GOT TO STAND UP AND FIGHT. WERE NOT GOING TO HAVE A HAND TIED BEHIND OUR BACK ANYMORE. THAT'S GROW A DAMN SPINE AND GET IN THIS FIGHT, DEMOCRATS. JOE: IN ADDITION TO DEVELOPING A STRATEGY AND PLOT -- EFFORTS TO RETAKE THE HOUSE NEXT FALL, THEY'RE LOOKING AHEAD TO 2028. REPRESENTATIVES FROM NEW HAMPSHIRE, NEVADA, SOUTH CAROLINA AND OHIO ARE ALL MAKING THEIR CASE TO LEAD THE PARTY'S PRIMARY CONTEST. IOWA AND NEW HAMPSHIRE HAVE OPEN THEIR -- SOUTH CAROLINA WAS MOVED FIRST PLACE, BUMPING UP MICHIGAN AND ELIMINATING I A AFTER -- ELIMINATING IOWA. JOINING US IS OUR POLITICAL PANEL, RICK DAVIS, ALONGSIDE MEGAN HAYES, FORMER SPECIAL ASSISTANT TO PRESIDENT BIDEN. GREAT TO HAVE YOU BOTH WITH US. I'VE TO START WITH HIS PRIMARY SCHEDULE, NEW HAMPSHIRE CLOSELY ASSOCIATED WITH RICK DAVIS AND JOHN MCCAIN OF COURSE. WILL HE BE BACK UP FRONT BOTH PARTIES THIS YEAR? > > I HAVE TO BELIEVE THE DEMOCRATIC PARTY WOULD NOT MAKE THE MISTAKE OF BYPASSING NEW HAMPSHIRE AND GOING STRAIGHT TO SOUTH CAROLINA. FRANKLY AFTER THE IOWA DEBACLE IN 2016, WOULD TRY TO EVEN RESURRECT THAT IF I WITH THE DEMOCRATS JUST TO PROVE THEY CAN PUT ON HER CAUCUS. AT THE END OF THE DAY, THESE -- REPUBLICANS AND DEMOCRATS SHOULD BE A IN THE STATE AT THE SAME TIME TO GIVE THEM A COMPARISON. THE LAST THING YOU EVER WANT TO DO IS CEDE TURF TO YOUR OPPONENT WITHOUT BEING THERE TO MAKE THE COUNTERARGUMENT. JOE: THE ARGUMENT OF COURSE FROM A LOT OF PROGRESSIVES IS THAT I WAY AND NEW HAMPSHIRE DON'T LOOK LIKE THE REST OF THE COUNTRY, THEY DON'T REPRESENT THE ELECTORATE. IS THAT FAIR? > > ABSOLUTELY. WE LEARN THAT IN 2020. I CAN'T MEMBER HOW IT ALL PLAYED OUT BUT WE ENDED UP WINNING AND BEING PRESIDENT OF THE UNITED STATES. THE CAUCUS IS SUCH A LITTLE REPRESENTATION OF ESSAY, SO FEW PEOPLE TURN OUT TO CAUCUS, IT'S UNBELIEVABLE THEY DECIDE THE NARRATIVE AND THE MOMENTUM GOING FORWARD. THE THOUGHT PROCESS IS MORE PEOPLE IN MORE STATES IT REALLY MATTER AND THAT LOOK LIKE THE UNITED STATES SHOULD BE THE ONES MAKING THE DECISION. JOE: WE WERE TALKING ABOUT, IT WAS A YEAR AGO LAST WEEK WE WERE IN CHICAGO FOR THE DNC CONVENTION THAT NOMINATED KAMALA HARRIS. EARLIER THIS HOUR WE SPOKE WITH ROBIN KELLY OF ILLINOIS, OR DISTRICT INCLUDES PART OF THE SOUTHSIDE OF CHICAGO, ABOUT PRESIDENT TRUMP LATEST CRITICISM OF THE CITY. I ASK ABOUT THE PRESENT THREAT TO SEND IN THE NATIONAL REGARD -- THE NATIONAL GUARD. > > CHICAGO DOES NOT NEED THE NATIONAL GUARD. CHICAGO COULD USE SOME VIOLENCE INTERVENTION FUNDING THAT HE IS SEEN FIT TO CLAW BACK FROM AGENCIES THAT WERE PROMISED FUNDING AND IF HE WAS SO WORRIED ABOUT CRIME, HE WOULD NOT HAVE SHUT DOWN THE OFFICE OF GUN VIOLENCE PREVENTION ON DAY ONE OR TWO OF HIS PRESIDENCY. THE STATS ARE THE STATS. CRIME HAS GONE DOWN. NO ONE HAS SAID THERE IS NO CRIME, BUT CHICAGO IS WORKING ON IT, AND THEY HAVE BEEN WORKING ON IT. WE ARE SEEING THE PROOF OF THEM WORKING ON IT. CRIME HAS GONE DOWN. JOE: RICK, YOU HAVE MADE THE POINT THAT THAT IS THE EXACT RESPONSE THAT DONALD TRUMP IS TRYING TO INVOKE. > > HE COULD HAVE WRITTEN HER TALKING POINTS TODAY. DEMOCRATS ARE THE PARTY OF URBAN AMERICA. MULTICULTURAL, HIGHER INCOME, HIGHER EDUCATION CITIES, AND THEY HAVE TO PROVE THAT THEY CAN MANAGE CITIES. NOBODY IN THE WORLD THING CITIES IN AMERICA ARE SAFER THAN THEY USED TO BE. SO GET RIGHT ON THIS ISSUE. DON'T LET DONALD TRUMP GET TO THE RIGHT OF YOU ON CRIME IN CITIES. TAKE IT ON, IT SHOULD BE THE NUMBER ONE ISSUE, ESPECIALLY NOW THAT IMMIGRATION HAS FALLEN. JOE: THE BIG STORY IN WASHINGTON IS THE FACT THAT SOME NATIONAL GUARD TROOPS ARE CARRYING WEAPONS, THEY ARE ARMED AS I STAND IN FRONT OF UNION STATION AND OTHER LOCATIONS. THIS RECAP UP ON, SHOULD DEMOCRATS EMBRACE SOME OF THIS IDEA? > > I AGREE THAT DEMOCRATS TAKING THE BAIT, WE'VE SEEN A PLAY OUT TIME AND TIME AGAIN. DEMOCRATS SHOULD BE FOCUSING THE CONVERSATION RIGHT BACK TO THE ECONOMY AND LOWERING COSTS. THAT IS WHAT PEOPLE ACTUALLY CARE ABOUT. SO MANY LIVE IN THESE CITIES, THEY DON'T UNDERSTAND THE DYNAMIC OR THE SPECIFICS, IT'S JUST LIKE WITH IMMIGRATION, AND DEMOCRATS ARE LETTING HIM WIN ON THE ISSUE. THEY NEED TO TURN THE MESSAGING BACK TO THE ECONOMY AND PRESSED TRUMP ON WHY HE IS NOT LOWERING COSTS. JOE: -- > > MY VIEW IS GOVERNOR PRITZKER OUGHT TO BRING IN THE NATIONAL GUARD HIMSELF. I WOULD PUT THEM IN CHICAGO AND I'M NOT GOING TO LISTEN TO WHAT IS GOING ON IN WASHINGTON BECAUSE THAT IS NOISE IN THE SYSTEM. I AGREE THAT WE NEED TO DO MORE ON CRIME, AND I'M GOING TO DO IT MYSELF. JOE: THAT WOULD BE AN INTERESTING MOVE TO CALL THE PRESIDENT'S BLUFF. > > WE CANNOT FALL INTO THE TRAP. WE NEED TO PUSH ON THE ECONOMY AND LET THE AMERICAN PEOPLE SEE WHAT DEMOCRATS REALLY STAND FOR. TRYING TO BE THE PARTY THAT DID NOT WANT TO FIGHT CRIME OR IMMIGRATION IS NOT BENEFITING THE PARTY. JOE: FOUR OR FIVE HOURS COMBINE, HE WAS WOUND UP TODAY. HE TALKED ABOUT CRIME AND GEOPOLITICS. HE HAD THE PRESIDENT OF SOUTH KOREA ALONGSIDE HIM WHILE SPEAKING ABOUT HIM. HE TOUTED HIS RELATIONSHIP WITH KIM JONG-UN NORTH KOREA, OF ALL PEOPLE. PRES. TRUMP: KIM JONG-UN AND I HAD A VERY GOOD RELATIONSHIP IF YOU REMEMBER, AND STILL DO. WHEN I CAME IN, I DIDN'T KNOW HIM. WE HAD TWO SUMMONS, BUT WE BECAME VERY FRIENDLY. THERE WAS GREAT RESPECT. WE CAN DO SOMETHING IN THAT REGARD WITH RESPECT TO NORTH AND SOUTH, BUT I THINK YOU ARE MUCH MORE PRONE TO DOING THAT THAN OTHER LEADERS I'VE BEEN WORKING WITH. I LOOK FORWARD TO MEETING WITH KIM JONG-UN IN THE APPROPRIATE FUTURE. JOE: THESE WERE UNSOLICITED REMARKS, IT'S BASICALLY THE WAY HE OPENED THE MEETING WITH THE PRESIDENT OF SOUTH KOREA. HE LATER REFERRED TO THE INCREDIBLE EXPERIENCE HE HAD AN SUGGESTED HE MAY DO IT AGAIN. > > IT'S A GOOD STRATEGY TO MAKE YOUR GUESS VERY UNCOMFORTABLE. THEY WANT TO ANNIHILATE THAT ENTIRE COMMUNITY. I JUST THOUGHT THE PRESIDENT LEE DID A GREAT JOB OF BEING STOIC, NOT SHOWING EMOTION, NOT ARGUING WITH THE PRESIDENT. YOU KNOW HOW THAT GOES. AND AT THE SAME TIME, IT'S A SORT OF CARD THAT DONALD TRUMP LOVES TO PLAY. I'M GOING TO GET THAT NOBEL PRIZE MATTER WHAT AND I'M GOING TO DO IT WITH NORTH KOREA AND SOUTH KOREA. JOE: SO IS DONALD TRUMP THE ONE TO BRING PEACE TO THE KOREAN PENINSULA? > > KNOW, AND IT'S DESPICABLE. THE UNITED STATES SHOULD NOT BE ON THE SIDE OF DICTATORS. THIS IS REPREHENSIBLE THAT THIS IS NOW OUR FOREIGN POLICY. JOE: YOU WONDER WHAT PEOPLE THING IN THE REGION, AS THEY ENTERTAIN THE IDEA OF A FOUR WAY MEETING BETWEEN PRESIDENTXI, LEE, KIM JONG-UN, AND TRUMP. I'M GUESSING THAT SONG TO HAPPEN. > > I DON'T REALLY QUITE UNDERSTAND IT BECAUSE THE LAST TIME DONALD TRUMP MET WITH THE GREAT LEADER OF NORTH KOREA, IT TURNED OUT TO BE A REAL BUMMER. HE WALKED AWAY FROM THE MEETING WITH NOTHING. SO WHY TRUST A GUY WHO HAS LEFT YOU WANTING? JOE: HE TALKED ABOUT RENAMING THE DEPARTMENT OF DEFENSE THE DEPARTMENT OF WAR, ALONG WITH MANY OTHER TOPICS IN THE OVAL OFFICE. HE HAD PETE HEGSETH NEXT TO HIM. A LOT OF THIS IS JUST SPIT BAWLING, BUT WHEN YOU TAKE IT SERIOUSLY? > > IT IS OUTRAGEOUS, BUT DEMOCRATS NEED TO FOCUS ON WHAT IS IMPORTANT, AND THAT IS THE ECONOMY. THEY CAN'T CHANGE THE NAME WITHOUT CONGRESS. DO NOT GIVE YOURSELF WORKED UP. ISSUE PHONE MORE THING HE WANTS TO MAKE NOISE WITH AND CONTINUE TO DRIVE A WEDGE BETWEEN EVERYONE. JOE: IT BRINGS BACK SOME MEMORIES, 2019, PRESIDENT TRUMP AND KIM JONG-UN. WILL THE NATURE OF THEIR RELATIONSHIP PLAY INTO WHATEVER HAPPENS WITH CHINA OR IS IT JUST THE PRESIDENT HAVING FUN IN THE OVAL OFFICE? > > I THINK THERE'S A LITTLE BIT OF HIM HAVING FUN ON AN AUGUST DAY, BUT AT THE END OF THE DAY, HE'S NOT WITHOUT HIS RESOURCES TO CREATE CHANGE. ANYONE WHO DOUBTS HIS ABILITY TO CHANGE THE WORLD ORDER AS IT EXISTS TODAY HAS NOT PAID ATTENTION SINCE LAST YEAR. YOU DON'T WANT TO ASSUME ANYTHING. WE WENT INTO TODAY NOT THINKING THE PRESIDENT WOULD POTENTIALLY HAVE A MEETING WITH PRESIDENT XI OF CHINA, NOW IT LOOKS LIKE IT MAY BE A SUMMIT IN THE WAITING. AND WHAT ELSE IS GOING TO HAPPEN IF THE NORTH AMERICAN LEADER IS NOT INVITED TO THE APEC SUMMIT? MY GUESS IS NO ONE WILL GET CONSENSUS ON THAT. JOE: I'LL TAKE YOUR WORD ON THAT. A TRUMP-XI SUMMIT, WOULD IT BE MORE PRODUCTIVE THAN THE LAST? > > I DON'T KNOW, I DON'T THINK WE WILL HAVE A LOT OF PRODUCTIVE FOREIGN POLICY. I DON'T THINK TRUMP IS ANYWHERE BEING SERIOUS ABOUT HAVING THESE MEETINGS THAT WILL HAVE ANY DIPLOMATIC REWARDS FOR THE UNITED STATES. I DON'T THINK IT HAPPENS AT ALL AND IF IT DOES IS PROBABLY LIKE THE MEETING WHERE THERE'S A LOT OF HOOPLA AROUND IT AND NOTHING HAPPENING AND THE UNITED STATES LOOKS LIKE FOOLS ON THE WORLD STAGE. JOE: A GREAT CONVERSATION, THANK YOU FOR THE GREAT PANEL. IN JUST 90 MINUTES, SPACEX IS SET TO LAUNCH STARSHIP LIKE 10 FROM SOUTHERN TEXAS. AFTER PLANS WERE SCRAPPED YESTERDAY TO TROUBLESHOOT AN ISSUE WITH GROUND SYSTEMS, IF IT LAUNCHES, YOU WILL SEE IT AND HEAR IT HERE ON BLOOMBERG. IN THE MEANTIME, CHECK OUT THE WASHINGTON EDITION NEWSLETTER ONLINE. THANKS FOR JOINING US ON BALANCE OF POWER. I'M JOE MATHIEU.",
  "medium": "Video",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "PRESIDENT TRUMP",
      "weight": 0.068735644
    },
    {
      "name": "PRESIDENT TRUMP LATEST CRITICISM",
      "weight": 0.061306734
    },
    {
      "name": "PRESIDENT",
      "weight": 0.055397756
    },
    {
      "name": "PRESIDENT XI",
      "weight": 0.05535175
    },
    {
      "name": "PRESIDENT OBAMA",
      "weight": 0.05358702
    },
    {
      "name": "PRESIDENT LOU",
      "weight": 0.05321706
    },
    {
      "name": "PRESIDENT BIDEN",
      "weight": 0.05292338
    },
    {
      "name": "PRESIDENT XI JINPING",
      "weight": 0.05257401
    },
    {
      "name": "DONALD TRUMP",
      "weight": 0.04956191
    },
    {
      "name": "TRUMP SORT",
      "weight": 0.048843097
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.986328125
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.94970703125
    },
    {
      "name": "/Law & Government/Military/Other",
      "score": 0.53271484375
    }
  ],
  "sentiment": {
    "positive": 0.12025208,
    "negative": 0.5606748,
    "neutral": 0.31907314
  },
  "summary": "President Donald Trump has threatened to send the National Guard to Chicago and other cities in an attempt to gain power over the Republican Party, stating he is not a dictator but a leader who exerts power in limited ways. This comes after the two nations agreed to a 15% trade deal between the two countries, and after a series of controversial developments in South Korea, including a recent spat with South Korea's President, who likened the situation to a \"PerJURER REVOLUTION\" and suggested that the US government could harm global business. Meanwhile, there are also new lawsuits filed by Elon Muskk against Apple and OpenAI, accusing them of injuring each other in a technological innovation competition. The White House has also been criticized for creating an \"anti-terrorism\" atmosphere in the US.",
  "shortSummary": "President Donald Trump is emphasizing power through strategic actions, sending troops to cities like Chicago, while South Korea faces tensions over a trade deal.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "dff06600baa74b2abe176836895d5944",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Trump’s ‘Balance of Power’ broadcast highlighted his threat to deploy National Guard troops to cities like Chicago, his praise for trade deals with South Korea, and his continued pressure on China with potential 200% tariffs. He also discussed federal involvement in tech, citing Intel and Nvidia, while critics warned of government overreach. The segment touched on domestic policy, including gun violence funding and the political climate ahead of the 2026 election.",
  "argos_id": "GZ6IVYG2A"
}