{
  "url": "https://www.forbes.com/sites/stevebanker/2025/08/30/trump-administration-loses-a-second-significant-tariff-case/",
  "authorsByline": "Steve Banker",
  "articleId": "f6a9193adc8b4c04ac5633cfba0f27af",
  "source": {
    "domain": "forbes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NJ",
      "county": "Hudson County",
      "city": "Jersey City",
      "coordinates": {
        "lat": 40.7215682,
        "lon": -74.047455
      }
    }
  },
  "imageUrl": "https://imageio.forbes.com/specials-images/imageserve/68b3562b7cac8738aa943fa0/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-30T19:55:32+00:00",
  "addDate": "2025-08-30T20:06:59.556268+00:00",
  "refreshDate": "2025-08-30T20:06:59.556270+00:00",
  "score": 1.0,
  "title": "Trump Administration Loses Again In A Significant Tariff Case",
  "description": "Yesterday, the Trump Administration suffered its second loss in court in its legal battle to impose 'Liberation Day' tariffs as it sees fit.",
  "content": "Yesterday, the Trump Administration suffered its second loss in court in its legal battle to impose Liberation Day tariffs as it sees fit. In a 7-4 ruling issued moments ago, the U.S. Court of Appeals for the Federal Circuit upheld the U.S. Court of International Trade’s unanimous May 28 decision in favor of the Liberty Justice Center’s clients—a decision which held that the Trump Administration’s tariffs are unconstitutional and enjoined them from continuing.\n\nThe Liberty Justice Center, along with constitutional scholar Ilya Somin, filed a lawsuit to challenge the “Liberation Day” tariffs on April 14, representing five small businesses whose operations would be decimated by the tariffs. The lawsuit was joined by leading appellate lawyers and constitutional scholars Judge Michael W. McConnell and Neal Katyal after the Trump Administration appealed to the Federal Circuit.\n\nOne of those small businesses was owned by David Levi. Mr. Levi began designing an educational electronic musical toy kit in 2020. Initially, he made batches of a few hundred at a time and sold them on Amazon. As sales grew, he rented a workshop and a small warehouse in Charlottesville, Virginia, purchased some light production machines, and hired his first employee. Due to the lag between purchasing components and selling his products, his family agreed to lend him money to help with cash flow.\n\nHe plowed all the money earned back into the business until last year, when he finally started taking a salary for himself. This year, “I was just starting to get to the payoff zone, where all the investment that I put in of my own money, and all the money I could have been making from a corporate job, was paying off. Now everything's really slowed down because of the tariffs,” Mr. Levi exclaimed.\n\nLast year, the business shipped 16,000 units. Mr. Levi’s business – MicroKits - was looking to make 20,000 units this year. However, due to rush orders caused by the looming tariffs, MicroKits was only able to purchase the components for 11,000 units.\n\nBut Mr. Levi was not willing to take this lying down. He joined a lawsuit with four other small owner-operated businesses to challenge the tariffs. Now, Mr. Levi has prevailed again in the second round of the V.O.S. Selections v. Trump court case.\n\nIn today’s decision, the Federal Circuit Court of Appeals found that the Trump tariffs “are unbounded in scope, amount, and duration,” they “apply to nearly all articles imported into the United States, . . . impose high rates which are ever-changing and exceed those set [by Congress,]\n\nand are not limited in duration.” And the Court affirmed the Court of International Trade’s holding, finding that the Trump tariffs “assert an expansive authority” that is “beyond the authority delegated to the President by IEEPA.”\n\nToday’s ruling reiterates the arguments that the Liberty Justice Center and co-counsel Neal Katyal made before the federal appeals court on July 31—the International Emergency Economic Powers Act (IEEPA) does not give the President unilateral authority to impose tariffs on any country he wants, at any time he wants, at any rate he wants, for any reason he wants.\n\n“For the second time in this case, a federal court has held that the President’s so-called “Liberation Day” tariffs are unlawful,” said Jeffrey Schwab, Senior Counsel and Director of Litigation at the Liberty Justice Center. “The President cannot lawfully impose tariffs on his own; and IEEPA does not give him unlimited unilateral tariff authority. This decision protects American businesses and consumers from the uncertainty and harm caused by these unlawful tariffs.”\n\nThe appellate court’s ruling does not take effect until Oct. 14, however, which means that it is too early for Mr. Levi and the other small businessmen in the V.O.S. Selections v. Trump to celebrate. “The president's tariffs remain in effect, and we look forward to ultimate victory on this matter,” White House spokesperson Kush Desai said in a statement.\n\nAs Ty Rousch wrote in Forbes.com yesterday, “the ruling covers Trump’s ‘reciprocal’ tariffs imposed on most U.S. trade partners, including additional rates on goods imported from China, Mexico and Canada. If upheld, the ruling would prevent the levies from being enforced, though other tariffs, including those imposed on steel, aluminum and copper, would remain in place because they were issued under a different presidential authority. It’s not immediately clear how the ruling would impact trade deals reached between the U.S. and countries like Japan, South Korea and others in response to the tariffs, or how the broader financial market would react.”",
  "medium": "Article",
  "links": [
    "https://www.forbes.com/sites/tylerroush/2025/08/30/are-trumps-tariffs-still-in-effect-what-to-know-after-court-rules-most-levies-are-illegal/",
    "https://nam11.safelinks.protection.outlook.com/?url=https%3A%2F%2Flsxumwhbb.cc.rs6.net%2Ftn.jsp%3Ff%3D001e8cpCSsZPZeOHyuJUKTD9Nh9WPYAAG_jZ-2XY5kYz-Hz-LXg6X-6Gxk1Jyy_0VL6yjgEOX1d2uW4tld3xpXyAby84G30QHAJ_z0TEX978duNGWrJGKdFVV45ypR1Jm9IxcM75eZNDAn7EvyL-QWcMx-vuhxapIrPkJiDye9e6PqeMQAZ2bg_NccS34M2tsh8%26c%3Dobbl8E5NCfEhUYimgNcQgfwvd2YsW216ruqGfoqq5swisHpI_P1D_g%3D%3D%26ch%3Dv0a3T57fgG6MrEhJzD9A8SURmkq7Sowyx0T0bbTU9z235M7qxEXT0g%3D%3D&data=05%7C02%7Cmorgan%40libertyjusticecenter.org%7C91208bf13d5c41d2271108dde74c1ffc%7C682788bcea4941329a1622af91c9ab4f%7C0%7C0%7C638921036354853645%7CUnknown%7CTWFpbGZsb3d8eyJFbXB0eU1hcGkiOnRydWUsIlYiOiIwLjAuMDAwMCIsIlAiOiJXaW4zMiIsIkFOIjoiTWFpbCIsIldUIjoyfQ%3D%3D%7C0%7C%7C%7C&sdata=NObxnYo23I0IJfobtT4khLB5spXvSyabD5G1oqBoP48%3D&reserved=0",
    "https://nam11.safelinks.protection.outlook.com/?url=https%3A%2F%2Flsxumwhbb.cc.rs6.net%2Ftn.jsp%3Ff%3D001e8cpCSsZPZeOHyuJUKTD9Nh9WPYAAG_jZ-2XY5kYz-Hz-LXg6X-6Gxk1Jyy_0VL657rFUhnmeoMli8rgENDcNrUyy0eeoiAo3ZyqZXNibKEmXGrcP5uCJTHhJJL6P0c1Vf8Nxc_cOYBmPbYZSs3idHivOqjwVduuPsZaL1kUTd6YNw_KfzoJzF8RBJbvjqNZulyX_EgNLfQ%3D%26c%3Dobbl8E5NCfEhUYimgNcQgfwvd2YsW216ruqGfoqq5swisHpI_P1D_g%3D%3D%26ch%3Dv0a3T57fgG6MrEhJzD9A8SURmkq7Sowyx0T0bbTU9z235M7qxEXT0g%3D%3D&data=05%7C02%7Cmorgan%40libertyjusticecenter.org%7C91208bf13d5c41d2271108dde74c1ffc%7C682788bcea4941329a1622af91c9ab4f%7C0%7C0%7C638921036354868565%7CUnknown%7CTWFpbGZsb3d8eyJFbXB0eU1hcGkiOnRydWUsIlYiOiIwLjAuMDAwMCIsIlAiOiJXaW4zMiIsIkFOIjoiTWFpbCIsIldUIjoyfQ%3D%3D%7C0%7C%7C%7C&sdata=qiusRSZ8IkH188HN7vzUervJiRiYZPhmUOp5yHfwi%2Fk%3D&reserved=0",
    "https://www.forbes.com/sites/stevebanker/2025/05/15/small-toymakerwhose-business-was-blown-up-by-tariffs--fights-back/",
    "https://nam11.safelinks.protection.outlook.com/?url=https%3A%2F%2Flsxumwhbb.cc.rs6.net%2Ftn.jsp%3Ff%3D001e8cpCSsZPZeOHyuJUKTD9Nh9WPYAAG_jZ-2XY5kYz-Hz-LXg6X-6Gxk1Jyy_0VL6TL8NzZkuy8cJgfJqwqPbAvKbLw4h0w4RF-irhvCaQ7pbXe81c8BXiAFpsEMbboWrDQqRrRyzbBlNR4eUObSINZoYg0mbNyVFzRxKWt4gic2g0neyUS30jJvxo241MZZ8%26c%3Dobbl8E5NCfEhUYimgNcQgfwvd2YsW216ruqGfoqq5swisHpI_P1D_g%3D%3D%26ch%3Dv0a3T57fgG6MrEhJzD9A8SURmkq7Sowyx0T0bbTU9z235M7qxEXT0g%3D%3D&data=05%7C02%7Cmorgan%40libertyjusticecenter.org%7C91208bf13d5c41d2271108dde74c1ffc%7C682788bcea4941329a1622af91c9ab4f%7C0%7C0%7C638921036354884740%7CUnknown%7CTWFpbGZsb3d8eyJFbXB0eU1hcGkiOnRydWUsIlYiOiIwLjAuMDAwMCIsIlAiOiJXaW4zMiIsIkFOIjoiTWFpbCIsIldUIjoyfQ%3D%3D%7C0%7C%7C%7C&sdata=U%2BWGC5xAMs%2FQzTd7cvlJshHHS0P6k5i3lWn52eCYaDQ%3D&reserved=0",
    "https://nam11.safelinks.protection.outlook.com/?url=https%3A%2F%2Flsxumwhbb.cc.rs6.net%2Ftn.jsp%3Ff%3D001e8cpCSsZPZeOHyuJUKTD9Nh9WPYAAG_jZ-2XY5kYz-Hz-LXg6X-6G_j52pSiMLLCzP-autl6uIRs48rsFuY29QWThiFAY4bO0Q2-YYB_XOw6pSnBMMIrwyJKVV-4f9uaWf1BKbR0aH3lhGeWPVK_3mLiJlaGUCOhps1yRYuwzB4-Y6_745asGHyFf-jC5LQGpS1AWYPeL56ilcNTh37SoIzDts2RjeN_aPRirXPQ3vnCrvcWFzqEL1lp_R34hsJb1mEoZ8Krae-DqTKGXoYP61Oy2eCUjgq-s_ckzcugkKY0eXQmqaSDBljf6jDMaGDe2hcnEI4j0peftYHgJyWkKfgmcQJdPI2Y%26c%3Dobbl8E5NCfEhUYimgNcQgfwvd2YsW216ruqGfoqq5swisHpI_P1D_g%3D%3D%26ch%3Dv0a3T57fgG6MrEhJzD9A8SURmkq7Sowyx0T0bbTU9z235M7qxEXT0g%3D%3D&data=05%7C02%7Cmorgan%40libertyjusticecenter.org%7C91208bf13d5c41d2271108dde74c1ffc%7C682788bcea4941329a1622af91c9ab4f%7C0%7C0%7C638921036354837845%7CUnknown%7CTWFpbGZsb3d8eyJFbXB0eU1hcGkiOnRydWUsIlYiOiIwLjAuMDAwMCIsIlAiOiJXaW4zMiIsIkFOIjoiTWFpbCIsIldUIjoyfQ%3D%3D%7C0%7C%7C%7C&sdata=HyJTkYCcRdwrIb7y%2B3Tq%2BxFXb7VlEdRatVind78K%2F78%3D&reserved=0"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "other tariffs",
      "weight": 0.0967023
    },
    {
      "name": "Liberation Day tariffs",
      "weight": 0.09636145
    },
    {
      "name": "tariffs",
      "weight": 0.09360776
    },
    {
      "name": "unlimited unilateral tariff authority",
      "weight": 0.0892483
    },
    {
      "name": "Trump Administration",
      "weight": 0.07531916
    },
    {
      "name": "Mr. Levi",
      "weight": 0.06882147
    },
    {
      "name": "Trump",
      "weight": 0.065838374
    },
    {
      "name": "American businesses",
      "weight": 0.06067687
    },
    {
      "name": "the Trump tariffs",
      "weight": 0.05722129
    },
    {
      "name": "Liberation Day",
      "weight": 0.056712084
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.97998046875
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.9208984375
    },
    {
      "name": "/People & Society/Social Sciences/Political Science",
      "score": 0.75732421875
    },
    {
      "name": "/Law & Government/Government/Courts & Judiciary",
      "score": 0.62451171875
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.442138671875
    },
    {
      "name": "/Law & Government/Legal/Other",
      "score": 0.369140625
    }
  ],
  "sentiment": {
    "positive": 0.05516483,
    "negative": 0.72665405,
    "neutral": 0.21818113
  },
  "summary": "The Trump Administration has lost again in court, losing to the U.S. Court of Appeals for the Federal Circuit, ruling that the President's \"Liberation Day\" tariffs are unconstitutional. The ruling, which does not take effect until Oct. 14, supports the Liberty Justice Center's clients, five small businesses whose operations would be severely impacted by the tariffs. The court upheld the Court of International Trade's unanimous decision in favor of the clients on May 28, finding that the tariffs \"are unbounded in scope, amount, and duration\" and apply to nearly all articles imported into the United States. It is unclear how the ruling would impact trade deals reached between the US and South Korea, or if it were upheld, other tariffs, including those imposed on most goods imported from China, Mexico, would not be enforced.",
  "shortSummary": "The Trump Administration lost again in court, this time for the second time, as the Federal Circuit ruled that the President's \"Liberation Day” tariffs are unconstitutional and must be halted.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "24a54f8f03164accafe578be2f94a4a4",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.forbes.com/sites/tylerroush/2025/08/30/are-trumps-tariffs-still-in-effect-what-to-know-after-court-rules-most-levies-are-illegal/",
      "text": "Topline\nAn appellate court ruled most tariffs imposed by President Donald Trump are illegal, backing a lower court’s argument that the levies exceeded Trump’s authority, though the duties will remain in place for weeks as the Trump administration brings the case to the Supreme Court.\nKey Facts\nThe U.S. Court of Appeals for the Federal Circuit ruled 7-4 late Friday that Trump overstepped his authority by issuing tariffs, as the court wrote the power to impose such tariffs is “vested exclusively in the legislative branch” and a “core Congressional power.”\nDissenting judges argued Trump’s use of the International Emergency Economic Powers Act (IEEPA)—a 1977 law allowing the president to regulate international trade—to justify his tariffs is not an “unconstitutional delegation of legislative authority.”\nThe IEEPA neither mentions tariffs nor has “procedural safeguards” that set limits on the president’s power to impose tariffs and does not “give the president wide-ranging authority” to issue levies, the majority ruling said.\nThe appellate court’s ruling does not take effect until Oct. 14, however, allowing the Trump administration time to appeal to the Supreme Court.\n“The president's tariffs remain in effect, and we look forward to ultimate victory on this matter,” White House spokesperson Kush Desai said in a statement.\nChief Critic\n“ALL TARIFFS ARE STILL IN EFFECT!” Trump wrote on Truth Social in criticism of the “Highly Partisan” appeals court. Trump claimed, “If these Tariffs ever went away, it would be a total disaster for the country.” He suggested the Supreme Court would “help” keep the tariffs in place for the “benefit of our Nation,” adding if the appellate court’s ruling is “allowed to stand, this Decision would literally destroy the United States of America.”\nWhat Happens If Trump’s Tariffs Are Ruled Illegal?\nThe ruling covers Trump’s “reciprocal” tariffs imposed on most U.S. trade partners, including additional rates on goods imported from China, Mexico and Canada. If upheld, the ruling would prevent the levies from being enforced, though other tariffs, including those imposed on steel, aluminum and copper, would remain in place because they were issued under a different presidential authority. It’s not immediately clear how the ruling would impact trade deals reached between the U.S. and countries like Japan, South Korea and others in response to the tariffs, or how the broader financial market would react.\nKey Background\nTrump unveiled wide-reaching tariffs on U.S. trade partners earlier this year, claiming authority to do as he argued an international trade imbalance was harming national security. Friday’s ruling upholds a decision from the Court of International Trade in May, which disputed Trump’s authority to impose sweeping tariffs under the IEEPA, ruling in favor of a consolidated lawsuit filed by a dozen states and five small businesses. The Trump administration has argued courts previously approved President Richard Nixon’s emergency use of tariffs in 1971 under earlier emergency powers legislation, though the Court of International Trade rejected the claim and said Trump’s tariffs “exceed any authority granted to the president” under the law."
    },
    {
      "url": "https://www.forbes.com/sites/stevebanker/2025/05/15/small-toymakerwhose-business-was-blown-up-by-tariffs--fights-back/",
      "text": "David Levi began designing an educational electronic musical toy kit in 2020. Initially, he made batches of a few hundred at a time and sold them on Amazon. As sales grew, he rented a workshop and small warehouse in Charlottesville, Virginia, bought some light production machines, and hired his first worker. Because of the lag between buying components and selling his products, his family agreed to loan him money to help with cash flow.\nHe ploughed all the money earned back into the business until last year, when he finally started to take a salary for himself. This year, “I was just starting to get to the payoff zone, where all the investment that I put in of my own money, and all the money I could have been making from a corporate job, was paying off. Now everything's really slowed down because of the tariffs,” Mr. Levi exclaimed.\nLast year, the business shipped 16,000 units. Mr. Levi’s business – MicroKits - was looking to make 20,000 units this year. But with rush orders because of the looming tariffs, MicroKits was only able to buy the components for 11,000 units.\nBut Mr. Levi was not willing to take this lying down. He joined a lawsuit with four other small owner-operated businesses to challenge the tariffs. The case - V.O.S. Selections v. Trump – went before the U.S. Court of International Trade on Wednesday. An independent observer doesn’t think things went well for the Trump administration.\nThe MicroKits Story\nMr. Levi got into electronics as a sophomore in high school. “I found this weird musical instrument called the theremin,” Mr. Levi explained. “I saw a video of someone waving their hands in the air, then as you move your hands near the antenna, it changes the volume and the pitch., I thought, oh, this video is fake. They're just putting audio over it. There's no way that you can just get a little circuit with a little antenna,” and use it to create music. It is, Mr. Levi added, “very difficult to play.”\nMr. Levi decided to build his own circuit to see if “this thing is real. That's what got me really interested in electronics. This is “really cool from a physics standpoint.”\n“So yeah, as a high schooler, I tried to build my own. It was really complicated. I had to order a circuit board from one place, then order components from another place. Eventually, I did get it working. But that's sparked my interest in electronics.”\n“I kept building circuits. I got a degree in electrical engineering” from Cal Poly in San Luis Obispo. Cal Poly’s motto is “learn by doing.” This was just the kind of education Mr. Levi was looking for.\nMr. Levi ended up working at some big toy companies. He was part of a design team working on Barbie and another team that worked on Transformers. “I had experience making toys light up and play noises.”\nMr. Levi was laid off in 2020 during the pandemic, which gave him time to design his own Theremin kit. There was an upside to being laid off during the pandemic. “I,” Mr. Levi said, “had time to design it right.”\nPCWorld reviewed the product in 2023. The subtitle of the article was “This is a Lot of Fun!” The author added “it’s wonderfully easy to assemble” and “ridiculously fun to play.” It was also educational. The author - Ashley Biancuzzo - added “I have a better understanding of circuitry.”\nSince then, Mr. Levi has designed the Synth-a-Sette, a cassette-sized synthesizer. It is a circuit board shaped like a cassette. This device turns everyday objects into musical keys by clipping them to the device. It can be connected to virtually anything conductive, even items you would not think were conductive, like bananas, and play notes.\n“I haven't yet figured out if I'm tricking electrical people to get interested in music,” Mr. Levi said. “Or if I'm tricking music people to get interested in electronics. It's a little bit of both.” But Mr. Levi does want to help inspire the next generation of electrical engineers.\nThe MicroKits Supply Chain\nMr. Levi said it took years to develop the MicroKits supply chain. These electrical kits are assembled with imported parts from a number of different countries, including China, Mexico, and Thailand. 60% of the parts do come from China. According to the suit, these parts “are not readily available from United States suppliers at all, without substantial additional costs, or without having to redesign its products.”\nFor a startup business, getting the right employees – employee in this case – and keeping them happy is critical. “I've designed my business,” Mr. Levi explained, around the worker who assembles the kits. “My goal has always been to have Debbie work constantly throughout the year.” The business planning is based on working backwards to keep her working. This determines when and how many parts are ordered and when and how hard to run marketing campaigns. Products are built all year long and stored. Most get sold during the holiday season.\nBefore the tariffs, Mr. Levi was considering adding a new employee. Now he can’t keep the employee he has fully employed.\nEven though tariffs on Chinese goods have now been lowered to 30% from 145%, this is still barely tenable. Mr. Levi had stopped buying components when prices soared. His warehouse is empty. Usually, it takes 10 weeks to get goods from China. But with everyone now placing rush orders, it is apt to take considerably longer. This limits his ability to build his finished goods inventory for the Christmas selling season. “I am only going to have a couple of months of real production time before September and October, when I need to ship things out.” There is a cutoff because of the time it takes retailers to get goods into their stores for the holiday.\nMr. Levi has been forced to raise prices. The Theremin kit was $40, the Synth-a-Sette used to be $50. $10 added to the price of both products.\nIt is not just higher production costs driving the price increase. Higher production costs ripple through the sales and marketing value chain in ways one would not expect. “When you sell in a retail store, the price you sell the product to the retail store is typically half of what the actual price the customer pays. So, if I have to pay an extra $5 in tariffs,” the final price ends up being $10 more.\nMarketing costs associated with Amazon sales also increase. An ad placed higher in the Amazon search queue generates much higher sales. While the exact algorithms Amazon uses for ordering ads are not known, the more revenue a product generates is undoubtedly part of the math. If higher production costs lead to lower sales, then prices must be raised even more to generate the same revenues as before.\nSmall businesses have fewer options in dealing with tariffs. Cash flow can be improved by using bonded warehouses. If MicroKits had a bonded warehouse in the U.S., the company could delay payments of the duties until the goods were released from the warehouse. “I don't have the bandwidth to figure out how to set up a bonded warehouse,” Mr. Levi said.\nAnd higher shipping costs are coming as well. Jena Santoro, Senior Manager of Global Risk Intelligence at Everstream Analytics, says that one main impact to anticipate with the 90-day tariff pause will be higher maritime shipping rates. “While the tariffs are relaxed, we’ll see a surge of advanced shipments to restock & replenish inventories, and thus a spike in freight costs.”\nHigher costs, of course, lead to less demand. “We're going to have fewer units to sell, which means that there are going to be kids this Christmas season who, instead of getting a cool science kit for Christmas, they're going to spend more time on their iPad. That's kind of sad, because I'm trying to get kids and students interested in electronics,” Mr. Levi bemoaned.\nOne of the goals of the new tariffs is to boost manufacturing in the U.S. For MicroKits, the better solution might be to do light assembly in the U.K. The U.K. has low tariffs on Chinese electronic components. If goods were assembled in the U.K. and then exported to the U.S., the tariffs would be significantly lower than those associated with building the goods in the U.S.\nV.O.S. Selections v. Trump\nWhile Mr. Levi was initially dismayed and discouraged by the tariffs, that did not stop him from acting. He became one of the plaintiffs in the V.O.S. Selections v. Trump lawsuit. On April 14, the Liberty Justice Center filed a lawsuit challenging the Trump Administration’s authority to unilaterally issue the “Liberation Day” tariffs, which are “devastating small businesses across the country. The lawsuit argues that the Administration has no authority to issue across-the-board worldwide tariffs without congressional approval.”\nThe President invoked the International Emergency Economic Powers Act (IEEPA) to justify the “Liberation Day” tariffs. But under that law, the President may invoke emergency economic powers only after declaring a national emergency in response to an “unusual and extraordinary threat” to national security, foreign policy, or the U.S. economy originating outside the United States. The lawsuit argues that the Administration’s justification— a trade deficit in goods—is neither an emergency nor an unusual or extraordinary threat. Trade deficits have existed for decades, and do not constitute a national emergency or threat to security.\nIan Millhiser, a senior correspondent at Vox, focuses on the Supreme Court and Legal Issues. He reports that while it is unclear how the three-judge panel will rule, “it appears somewhat more likely than not that they will rule that the tariffs are unlawful. All three of the judges, who sit on the U.S. Court of International Trade, appeared troubled by the Trump administration’s claim that the judiciary may not review the legality of the tariffs at all.\nBut the lawyer representing several small businesses challenging the tariffs also faced many skeptical questions.” One judge pushed the plaintiff's lawyer to define a standard that the court could use to decide whether Trump’s emergency declaration was lawful, but the lawyer argued that a definition was unnecessary considering the unprecedented nature of the case.\n“I’m asking the court to be an umpire and call a strike, and you’re asking me, ‘What’s the strike zone, is it at the knees or slightly below the knees?’” Jeffrey Schwab said. “I’m saying it’s a wild pitch, it’s on the other side of the batter and hit the backstop. So we don’t need to debate the difference between the strike zone.”\nSome of the judges sounded offended when the lawyer for the Trump administration claimed that the question of what constitutes an extraordinary threat is a “political question” — a legal term meaning that the courts aren’t allowed to decide that matter. As Judge Jane Restani, a Reagan appointee, told Hamilton, his argument suggests that there is “no limit” to the president’s power to impose tariffs, even if the president claims that a peanut butter shortage is a national emergency.\nThe overall picture presented by the argument is that all three judges (the third is Judge Timothy Reif, a Trump appointee) are troubled by the broad power Trump claims in this case. But they were also frustrated by a lack of guidance — both from existing case law and from Schwab and Hamilton’s arguments — on whether Trump can legally claim the power to issue such sweeping tariffs.\nIf the Trump administration loses, they are sure to appeal. However, Riley Stephens with the Liberty Justice Center says the appeals process may be faster because the case appeared before the Court of International Trade. The Court of International Trade is a specialty court that deals specifically with trade issues. In other tariff cases appearing in federal courts, the government is filing motions to move the case to this court."
    }
  ],
  "argos_summary": "A 7‑4 ruling by the U.S. Court of Appeals for the Federal Circuit declared most of President Trump’s ‘Liberation Day’ tariffs unconstitutional, affirming a lower court’s decision that the president lacked authority under the International Emergency Economic Powers Act. The judgment does not take effect until October 14, so tariffs remain in place for the interim and the administration is expected to appeal to the Supreme Court. The ruling is expected to ease pressure on small U.S. importers—such as the toy‑kit maker MicroKits—by potentially halting the high duties that have raised costs and constrained production. Market reaction remains uncertain, but the decision could dampen the broader trade‑policy uncertainty that has weighed on equities, credit spreads, and commodity prices.",
  "argos_id": "H0B8KAOD1"
}