{
  "url": "https://www.forbes.com/sites/georgecalhoun/2025/08/28/will-the-fed-cut-interest-rates-does-it-matter-recent-history-says-no/",
  "authorsByline": "George Calhoun",
  "articleId": "98c95d74f3724e2b8a8da875b5743b66",
  "source": {
    "domain": "forbes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NJ",
      "county": "Hudson County",
      "city": "Jersey City",
      "coordinates": {
        "lat": 40.7215682,
        "lon": -74.047455
      }
    }
  },
  "imageUrl": "https://imageio.forbes.com/specials-images/imageserve/68b07bf8beca3352bac012b4/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-28T17:36:42+00:00",
  "addDate": "2025-08-28T17:52:03.705807+00:00",
  "refreshDate": "2025-08-28T17:52:03.705809+00:00",
  "score": 1.0,
  "title": "Will The Fed Cut Interest Rates? Does It Matter? Recent History Says No.",
  "description": "The normal relationship between the Fed’s interest rate policy and various market rates – the ones that matter for consumers and businesses – has broken down.",
  "content": "The Federal Reserve’s most important monetary policy tool is the Fed Funds Interest Rate target. By raising or lowering this benchmark, the Fed hopes to influence the cost of credit throughout the economy, to stimulate or restrain, to control inflation and promote full employment. It is widely assumed that the Fed Funds Rate is an effective lever to move market interest rates, both short-term and long-term rates. For decades, that assumption appeared to hold up.\n\nNo longer. This critical policy lever is broken. It stopped working quite suddenly about a year ago. The Fed lowered its target rate three times from September to December 2024, and is getting ready to lower it further – but real interest rates in the market have moved decisively upwards. The correlations between the policy rate and the most important market rates (like Treasury yields and mortgage rates) flipped from extremely positive (i.e, strongly synchronized) prior to September of last year to extremely negative (moving in opposite directions) almost overnight. It is not clear if the breakdown of this long-standing relationship is temporary (“transitory”?) or if it represents a structural shift in the way the macroeconomic system operates. If it is structural, it would mean that the Fed has lost some of its ability to influence the economy. Which could have momentous consequences.\n\nThe financial markets are treating the prospect of a rate cut next month as a psychological event. Market sentiment surrounding this prospect is decidedly positive. But viewed as a fundamental economic event, the outlook is cloudy. Last year’s cuts have not worked as a stimulus – have not lowered important market interest rates, and appear in fact to have pushed them higher. Why should a different outcome be expected this time?\n\nAs summer comes to an end, the attention of the financial world is locked in on the Federal Reserve, and the possibility of an interest rate cut in September.\n\nThe markets are pretty well convinced. Investors have been positioning for a cut for weeks. “Bets on Fed Rate Cuts Are Sweeping Through US Bond Market” was a Bloomberg headline earlier this month, and that was even before Chairman Powell teased in his Jackson Hole speech that “a shifting balance of risks may warrant adjusting our policy stance” – classic Fedspeak which the markets took as a Yes, and bid up the value of U.S. equities by about a trillion dollars that same day. The President has been leaning hard on Fed Chairman Powell to reduce rates, and the pressure to cut is building within the Fed itself. Two Fed Governors dissented from the no-change consensus at the July Federal Open Market Committee meeting and voted for a cut – the first time since 1993 that two FOMC members have broken ranks on a key policy decision.\n\nTechnical metrics and forecasts are flashing green. CME’s FedWatch tool puts the chance of a September rate cut at 87% (up from 60% a month ago). Other financial industry estimates approach near-certainty. Prediction markets are currently showing a 75-80% probability of a 25 bps reduction in the Fed Funds target, and many professional traders are betting on a larger move. Treasury Secretary Scott Bessent has projected the possibility of a 50 bps cut – on a downward path to 150-175 bps lower soon.\n\nSo, will it happen? It seems so.\n\nBut the more important question is: If or when it does happen, will it actually matter?\n\nLet’s go back a year. On September 16, 2024, after a long period of quiescence in interest rate policy, the Federal Reserve finally lowered the Fed Funds Rate target – the first downshift in more than 4 years. It was intended as a stimulus, or an easing of restraint. The normal expectation would have been for market interest rates to move downwards as well, lowering the cost of credit for consumers and businesses to encourage borrowing and spending. Lower rates on treasury bonds would reduce the cost of funding the federal government. Lower mortgage rates would unlock the stalled housing market. Cutting the Fed Funds target is the normal policy tool for this purpose. It has almost always worked before.\n\nNot this time. The rate cut on Sept 16 triggered a rapid and pronounced rise in the yields on Treasury bonds, and a similar steep increase in average mortgage rates. In just 6 weeks, both long-term rates lurched upwards.\n\nTwo more rate cuts followed in November and December, dropping the Fed Funds rate by a total of 100 basis points in three months. The long-term market rates continued to surge upwards, bolting higher with each rate reduction.\n\nThe gap between the policy rate and the most important long-term market rates ballooned by more than 2 full percentage points.\n\nThe rise in treasury bond yields and mortgage rates leveled off after January, but the gap has not closed.\n\nSince 1972, the Fed Funds Rate has been almost perfectly correlated with the 10-year Treasury Bond yield (90.4%) and the 30-year mortgage interest rate (91.6%). That relationship has broken down.\n\nTreasury yields and mortgage rates were inversely correlated with the Fed’s policy rate from September 2024 to to January 2025 – strongly so, at negative 80-90%.\n\nCorporate bond yields followed the same pattern, as did – strangely – German and British government bond yields.\n\nAcross all these markets, the shift in direction was decisive – from moving with the Fed prior to the first rate cut, to moving strongly against the Fed afterwards. The reversal of the long-established pattern was abrupt and definitive.\n\nFrom a policy perspective, thsi means that the Fed has been unable to effect a monetary stimulus by the traditional means. The rate cuts backfired, probably helping to drive up the cost of credit in the economy.\n\nIt is true that certain short term rates such as the interest rate on auto loans, rates on personal bank loans, and credit card interest appear to have moved downward with the Fed’s rate cuts. The so-called Prime Rate has move down as well. But it is the long-term rates that apply to the largest credit markets. Treasury bonds, municipal bonds, residential and commercial mortgages, and corporate loans and debt securities – which have all moved against the Fed’s rate cuts – account for about 25 times the amount of interest bearing debt compared to the categories that have moved in sync with the Fed Funds Rate.\n\nThe Federal Reserve may be trying to drive a car with a gas pedal that doesn’t work.\n\nThis has happened before. In February 2005, in the course of Congressional testimony then-Fed Chairman Alan Greenspan mused about a “conundrum” in the bond market. The Fed had raised the Fed Funds target rate by 150 basis points between June 29, 2004 and February 2, 2005 – but the yields in the Treasury market did not rise – which was the Fed’s policy goal. Instead they fell by 70 bps, contrary to the long-established pattern and to the Fed Chairman’s expectations.\n\nIt got worse. Over the next two and a half years the Federal Reserve raised the Fed Funds target rate by a whopping 425 basis points – and the 10 year Treasury yields ended about 5% lower than when the rate increases began.\n\nThe phenomenon spurred a fairly large “conundrum literature” over the following dozen or so years — and a surfeit of alternative explanations with no clear winner. It wasn’t just academic economists who were flummoxed. Bill Gross, then-head of Pimco and a true bond market expert, was just as puzzled.\n\nToday’s anomaly is if anything even more of a departure from the norm than the 2004-2005 episode. Greenspan’s “conundrum” involved a non-response by the market to Fed policy. The divergence of important market rates from Fed policy rates in the last 11 months constitutes a strong contrary response.\n\nDoes the Fed’s Interest Rate policy lever really work?\n\nTwo large doubts loom over this question.\n\n1. Why Should Short-Term Rate Adjustments Affect the Long-Term Rates Anyway?\n\nThe Fed Funds Rate is a target, intended to guide the cost at which member banks lend reserves to one another overnight. It addresses the very shortest of short-term rates – less than 24 hours. It pertains to a limited and peculiar form of credit. The interbank lending to which it applies is not connected to any “investment” or other ordinary business purposes in the larger economy, at least not directly. It is a process of technical calibration, designed to allow banks to stay in compliance with reserve requirements and manage liquidity – essentially to keep their cash balance in good order for purposes of regulatory conformance and general prudence.\n\nThere has always been something slightly preposterous about the idea that these ultra-short-term interest rates, which apply to such functionally narrow transactions between huge banks taking place deep inside the Federal Reserve system, could somehow decisively influence the interest rates on, say, 30-year mortgages prevailing out in the vast consumer housing market. And aside from the timing disparity between “overnight” adjustments and loans lasting decades, there is also a disparity in scale. The average daily volume of overnight bank funding is about $200-250 Billion. The combined long-term credit markets described above total more than $70 Trillion. Can such a tiny tail wag such a gigantic dog?\n\nAcademic studies of “transmission mechanisms” between short-term policy rate changes and long-term market rate responses have tried to make sense of this policy proposition, but in the end they present a complex and less-than-coherent picture. One study published by the Kansas City Federal Reserve put it this way:\n\nThere is another confounding factor that may offset the stimulus effect of interest rate cuts altogether. In April 2022, after at least four rounds of massive bond buying in the previous 12 years (so-called “quantitative easing”), the Fed’s balance sheet peaked at almost $9 Trillion, and then began to decline as the Fed allowed maturing bonds to “roll off” (mature without replacement). The yield curve almost immediately ticked into an inverted state, recovered briefly and then two months later entered the longest period of inversion in history. It only ended in September 2024, just when the Fed began reducing the Fed Funds target rate. By then this process of “quantitative tightening” (QT) had reduced the Fed’s balance sheet by almost $2 Trillion.\n\nIn the 11 months since the first rate cut, another half a trillion dollars of bonds have rolled off – in effect, removing a half a trillion dollars of demand from the bond market. Less demand means lower prices, which means higher yields. How much higher? One recent study calculated that a $1 Trillion reduction in the Fed’s bond holdings would increase the 10-year Treasury yield by 200 basis points – which is almost exactly what we see (half a trillion dollars => 100 basis points rise in yields).\n\nThe Fed is pursuing two contradictory policies at the same time. It is attempting to ease credit conditions by cutting interest rates, and it is tightening credit conditions through QT.\n\nTo return to the previous metaphor — maybe the gas pedal on this vehicle isn’t broken. Maybe it’s just that the Fed is driving with one foot on the gas and one on the brake at the same time.\n\nMarket interest rates have not responded to the past three interest rate cuts in the way policy makers at the Federal Reserve intended. Instead of lower borrowing costs, the result has been significantly higher cost of credit for consumers and businesses in all the most important categories: Treasury bonds, corporate bonds, mortgage rates.\n\nShould we expect a different outcome from the next rate cut in September (or whenever)? Does the Fed’s interest rate policy still have a meaningful influence over broader credit conditions? Current evidence would say No.",
  "medium": "Article",
  "links": [
    "https://www.newyorkfed.org/markets/reference-rates/obfr",
    "https://www.brookings.edu/articles/cracking-the-conundrum/",
    "https://www.cmegroup.com/markets/interest-rates/cme-fedwatch-tool.html",
    "https://www.bloomberg.com/news/articles/2025-08-13/bessent-says-rates-should-likely-be-150-175-basis-points-lower",
    "https://www.graduateinstitute.ch/sites/internet/files/2024-08/HEIDWP14-2024.pdf",
    "https://www.brookings.edu/wp-content/uploads/2007/03/2007a_bpea_backus.pdf",
    "https://ideas.repec.org/a/fip/fedker/y1995iqivp73-89nv.80no.4.html",
    "https://www.bloomberg.com/news/articles/2025-08-05/bets-on-fed-rate-cuts-are-sweeping-through-the-us-bond-market"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Fed policy rates",
      "weight": 0.117238015
    },
    {
      "name": "Fed Rate Cuts",
      "weight": 0.11644553
    },
    {
      "name": "Market interest rates",
      "weight": 0.10703371
    },
    {
      "name": "market interest rates",
      "weight": 0.10703371
    },
    {
      "name": "interest rate policy",
      "weight": 0.10426708
    },
    {
      "name": "important market interest rates",
      "weight": 0.103559576
    },
    {
      "name": "interest rate cuts",
      "weight": 0.103375204
    },
    {
      "name": "important market rates",
      "weight": 0.10268466
    },
    {
      "name": "Interest Rates",
      "weight": 0.09829287
    },
    {
      "name": "interest rates",
      "weight": 0.09829287
    }
  ],
  "topics": [
    {
      "name": "Federal Reserve"
    },
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Economy News",
      "score": 0.9677734375
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.94482421875
    },
    {
      "name": "/News/Business News/Fiscal Policy News",
      "score": 0.93603515625
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.91162109375
    },
    {
      "name": "/Finance/Banking/Other",
      "score": 0.67138671875
    },
    {
      "name": "/People & Society/Social Sciences/Economics",
      "score": 0.54296875
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.363037109375
    }
  ],
  "sentiment": {
    "positive": 0.06549332,
    "negative": 0.6976175,
    "neutral": 0.23688927
  },
  "summary": "The Federal Reserve's most important monetary policy tool is the Fed Funds Interest Rate target, which aims to influence the cost of credit throughout the economy, stimulate or restrain, control inflation and promote full employment. However, recent history suggests that this policy has not worked, with the Fed having previously lowered its target rate three times from September to December 2024. This change was made suddenly about a year ago, with real interest rates moving upwards. The correlation between the policy rate and the most important market rates (like Treasury yields and mortgage rates) has been significantly reduced. This could have significant implications on the economy. The President has been pushing for Fed Chairman Powell to reduce rates, and the Fed itself is under pressure. The potential rate cut in September is seen as a psychological event.",
  "shortSummary": "The Federal Reserve is expected to cut interest rates, potentially reducing the Fed Funds Rate to stimulate the economy, but its effectiveness remains uncertain due to recent policy changes.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "ef6dfb99d8bc4e9899116680ee1c10bb",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.brookings.edu/articles/cracking-the-conundrum/",
      "text": "The Brookings Institution is committed to quality, independence, and impact.\nWe are supported by a diverse array of funders. In line with our values and policies, each Brookings publication represents the sole views of its author(s).\nResearch\nBPEA | Spring 2007Cracking the Conundrum\nDiscussants:\nGlenn D. Rudebusch\nGlenn D. Rudebusch\nNonresident Senior Fellow\n- Economic Studies, The Hutchins Center on Fiscal and Monetary Policy\nGlenn D. Rudebusch\nNonresident Senior Fellow\n- Economic Studies, The Hutchins Center on Fiscal and Monetary Policy\nSpring 2007\nBETWEEN JUNE 29, 2004, and February 2, 2005, the Federal Open Market\nCommittee increased the target federal funds rate by 150 basis points (bp),\nor 1.50 percentage points. Over the same period, the long end of the yield\ncurve fell, with the ten-year yield declining by 70 bp and the ten-year\n(instantaneous) forward rate by more than 100 bp. This pronounced rotation\nin the yield and forward rate curves caught many by surprise. Then–\nFederal Reserve chairman Alan Greenspan was one. In his February 2005\ntestimony to Congress, he noted."
    },
    {
      "url": "https://ideas.repec.org/a/fip/fedker/y1995iqivp73-89nv.80no.4.html",
      "text": "Monetary policy actions and long-term interest rates\nAuthor\nAbstract\nSuggested Citation\nDownload full text from publisher\nReferences listed on IDEAS\n- Gordon H. Sellon, 1994. \"Measuring monetary policy,\" Research Working Paper 94-12, Federal Reserve Bank of Kansas City.\n- Marvin Goodfriend, 1993.\n\"Interest rate policy and the inflation scare problem: 1979-1992,\"\nProceedings, Board of Governors of the Federal Reserve System (U.S.).\n- Marvin Goodfriend, 1993. \"Interest rate policy and the inflation scare problem: 1979-1992,\" Economic Quarterly, Federal Reserve Bank of Richmond, issue Win, pages 1-24.\n- Rudebusch, Glenn D., 1995.\n\"Federal Reserve interest rate targeting, rational expectations, and the term structure,\"\nJournal of Monetary Economics, Elsevier, vol. 35(2), pages 245-274, April.\n- Glenn D. Rudebusch, 1995. \"Federal Reserve interest rate targeting, rational expectations, and the term structure,\" Working Papers in Applied Economic Theory 95-02, Federal Reserve Bank of San Francisco.\n- Bennett T. McCallum, 2005.\n\"Monetary policy and the term structure of interest rates,\"\nEconomic Quarterly, Federal Reserve Bank of Richmond, vol. 91(Fall), pages 1-21.\n- Bennett T. McCallum, 1994. \"Monetary Policy and the Term Structure of Interest Rates,\" NBER Working Papers 4938, National Bureau of Economic Research, Inc.\n- Longstaff, Francis A, 1990. \"Time Varying Term Premia and Traditional Hypotheses about the Term Structure,\" Journal of Finance, American Finance Association, vol. 45(4), pages 1307-1314, September.\n- Engle, Robert F & Lilien, David M & Robins, Russell P, 1987. \"Estimating Time Varying Risk Premia in the Term Structure: The Arch-M Model,\" Econometrica, Econometric Society, vol. 55(2), pages 391-407, March.\n- Cook, Timothy & Hahn, Thomas, 1989. \"The effect of changes in the federal funds rate target on market interest rates in the 1970s,\" Journal of Monetary Economics, Elsevier, vol. 24(3), pages 331-351, November.\nMost related items\nThese are the items that most often cite the same works as this one and are cited by the same works as this one.- Modena, Matteo, 2008.\n\"The term structure and the expectations hypothesis: a threshold model,\"\nMPRA Paper\n9611, University Library of Munich, Germany.\n- Matteo Modena, 2008. \"The Term Structure and the Expectations Hypothesis: a Threshold Model,\" Working Papers 2008_36, Business School - Economics, University of Glasgow.\n- Shu Wu, 2008.\n\"Monetary Policy And Long‐Term Interest Rates,\"\nContemporary Economic Policy, Western Economic Association International, vol. 26(3), pages 398-408, July.\n- Shu Wu, 2005. \"Monetary Policy and Long-term Interest Rates,\" WORKING PAPERS SERIES IN THEORETICAL AND APPLIED ECONOMICS 200512, University of Kansas, Department of Economics, revised Apr 2005.\n- D H Kim, 2002. \"Another look at yield spreads: The role of liquidity,\" Centre for Growth and Business Cycle Research Discussion Paper Series 04, Economics, The University of Manchester.\n- Sarno, Lucio & Thornton, Daniel L., 2003.\n\"The dynamic relationship between the federal funds rate and the Treasury bill rate: An empirical investigation,\"\nJournal of Banking & Finance, Elsevier, vol. 27(6), pages 1079-1110, June.\n- Sarno, Lucio & Thornton, Daniel L, 2002. \"The Dynamic Relationship Between the Federal Funds rate and the Treasury Bill Rate: An Empirical Investigation,\" CEPR Discussion Papers 3225, C.E.P.R. Discussion Papers.\n- Lucio Sarno & Daniel L. Thornton, 2002. \"The dynamic relationship between the federal funds rate and the Treasury bill rate: an empirical investigation,\" Working Papers 2000-032, Federal Reserve Bank of St. Louis.\n- Sophocles N. Brissimis & Evangelia A. Georgiou, 2022. \"The effects of Federal Reserve's quantitative easing and balance sheet normalization policies on long-term interest rates,\" Working Papers 299, Bank of Greece.\n- D H Kim, 2003. \"Another Look at Yield Spreads: The Role of Liquidity,\" Economics Discussion Paper Series 0306, Economics, The University of Manchester.\n- Jaroslav Brada & Karel Brůna, 2004. \"Analýza citlivosti referenčních úrokových sazeb PRIBOR na změny repo sazby České národní banky [An analysis of PRIBOR interest rates sensitivity to changes in Czech national bank repo rate],\" Politická ekonomie, Prague University of Economics and Business, vol. 2004(5), pages 601-621.\n- Hiona Balfoussia & Mike Wickens, 2007.\n\"Macroeconomic Sources of Risk in the Term Structure,\"\nJournal of Money, Credit and Banking, Blackwell Publishing, vol. 39(1), pages 205-236, February.\n- Hiona Balfoussia & Mike Wickens, 2007. \"Macroeconomic Sources of Risk in the Term Structure,\" Journal of Money, Credit and Banking, Blackwell Publishing, vol. 39(1), pages 205-236, February.\n- Michael R. Wickens & Chiona Balfoussia, 2004. \"Macroeconomic Sources of Risk in the Term Structure,\" CEIS Research Paper 61, Tor Vergata University, CEIS.\n- Chiona Balfoussia & Michael Wickens & Michael R. Wickens, 2004. \"Macroeconomic Sources of Risk in the Term Structure,\" CESifo Working Paper Series 1329, CESifo.\n- Dong Heon Kim, 2008. \"Another Look at Yield Spreads: The Role of Liquidity,\" Southern Economic Journal, John Wiley & Sons, vol. 74(4), pages 952-970, April.\n- Karel Brůna, 2006. \"Glenn Rudebusch's View on the Targeting of Short-Term Interest Rates [Cílování krátkodobých úrokových sazeb pohledem Glenna Rudebusche],\" Český finanční a účetní časopis, Prague University of Economics and Business, vol. 2006(1), pages 163-169.\n- Bordo, Michael D. & Schwartz, Anna J., 1999.\n\"Monetary policy regimes and economic performance: The historical record,\"\nHandbook of Macroeconomics, in: J. B. Taylor & M. Woodford (ed.), Handbook of Macroeconomics, edition 1, volume 1, chapter 3, pages 149-234,\nElsevier.\n- Michael D. Bordo & Anna J. Schwartz, 1997. \"Monetary Policy Regimes and Economic Performance: The Historical Record,\" NBER Working Papers 6201, National Bureau of Economic Research, Inc.\n- G. Boero & C. Torricelli, 1999. \"The Information in the Term of Structure: further Results for Germany,\" Working Paper CRENoS 199912, Centre for North South Economic Research, University of Cagliari and Sassari, Sardinia.\n- Gianna Boero & Costanza Torricelli, 2002. \"The information in the term structure of German interest rates,\" The European Journal of Finance, Taylor & Francis Journals, vol. 8(1), pages 21-45.\n- Huse, Cristian, 2011. \"Term structure modelling with observable state variables,\" Journal of Banking & Finance, Elsevier, vol. 35(12), pages 3240-3252.\n- Philip Lowe & Luci Ellis, 1997. \"The Smoothing of Official Interest Rates,\" RBA Annual Conference Volume (Discontinued), in: Philip Lowe (ed.),Monetary Policy and Inflation Targeting, Reserve Bank of Australia.\n- Eric Jondeau & Frédéric Sedillot, 1998. \"La pr vision des taux longs fran ais et allemands partir d'un modele anticipations rationnelles,\" Working papers 55, Banque de France.\n- McCallum, Bennett T., 1999.\n\"Issues in the design of monetary policy rules,\"\nHandbook of Macroeconomics, in: J. B. Taylor & M. Woodford (ed.), Handbook of Macroeconomics, edition 1, volume 1, chapter 23, pages 1483-1530,\nElsevier.\n- Bennett T. McCallum, 1997. \"Issues in the Design of Monetary Policy Rules,\" NBER Working Papers 6016, National Bureau of Economic Research, Inc.\n- repec:hal:spmain:info:hdl:2441/5221 is not listed on IDEAS\n- Go Tamakoshi & Shigeyuki Hamori, 2014. \"Nonlinear adjustment between the Eonia and Euribor rates: a two-regime threshold cointegration analysis,\" Applied Financial Economics, Taylor & Francis Journals, vol. 24(2), pages 139-143, January.\n- Jennifer E. Roush, 2001. \"Evidence uncovered: long-term interest rates, monetary policy, and the expectations theory,\" International Finance Discussion Papers 712, Board of Governors of the Federal Reserve System (U.S.).\n- Michael Dotsey & Christopher Otrok, 1995. \"The rational expectations hypothesis of the term structure, monetary policy, and time-varying term premia,\" Economic Quarterly, Federal Reserve Bank of Richmond, issue Win, pages 65-81.\nCorrections\nAll material on this site has been provided by the respective publishers and authors. You can help correct errors and omissions. When requesting a correction, please mention this item's handle: RePEc:fip:fedker:y:1995:i:qiv:p:73-89:n:v.80no.4. See general information about how to correct material in RePEc.\nIf you have authored this item and are not yet registered with RePEc, we encourage you to do it here. This allows to link your profile to this item. It also allows you to accept potential citations to this item that we are uncertain about.\nIf CitEc recognized a bibliographic reference but did not link an item in RePEc to it, you can help with this form .\nIf you know of missing items citing this one, you can help us creating those links by adding the relevant references in the same way as above, for each refering item. If you are a registered author of this item, you may also want to check the \"citations\" tab in your RePEc Author Service profile, as there may be some citations waiting for confirmation.\nFor technical questions regarding this item, or to correct its authors, title, abstract, bibliographic or download information, contact: Zach Kastens (email available below). General contact details of provider: https://edirc.repec.org/data/frbkcus.html .\nPlease note that corrections may take a couple of weeks to filter through the various RePEc services."
    },
    {
      "url": "https://www.cmegroup.com/markets/interest-rates/cme-fedwatch-tool.html",
      "text": "FedWatch\nStay up-to-date with the latest probabilities of FOMC rate moves.\nThe next FOMC meeting is in:\nWhat is the likelihood that the Fed will change the Federal target rate at upcoming FOMC meetings, according to interest rate traders? Use FedWatch to track the probabilities of changes to the Fed rate, as implied by 30-Day Fed Funds futures prices.\nMEDIA: Please attribute rate probabilities used in your reporting to “CME FedWatch.”\nQuick links\n*Disclaimer: The data and output from this tool does not constitute investment advice and is not a personal recommendation from CME Group. Nothing contained herein constitutes the solicitation of the purchase or sale of any futures or options. Any investment activities undertaken using this tool will be at the sole risk of the relevant investor. CME Group expressly disclaims all liability for the use or interpretation (whether by visitor or by others) of information contained herein. Decisions based on this information are the sole responsibility of the relevant investor. Any visitor to this page agrees to hold the CME Group and its affiliates and licensors harmless against any claims for damages arising from any decisions that the visitor makes based on such information.\nFollow related Interest Rate markets\nSee how changing FOMC expectations are impacting U.S. Treasury yields and key short-term interest rates.\nMore in Interest Rates\nRelated Research and Analysis\nGet our experts' perspectives on current trends.\nYield Insights from a market expert\nGet pro perspectives from Jim Iuorio, Managing Director, TJM Institutional Services, on trading current market events with Micro Treasury Yield futures.\nCourses\nTake self-guided courses on Interest Rates\nIf you're new to futures, the courses below can help you quickly understand the Interest Rate market and start trading.\nSubscribe to FOMC related updates\nSign up to receive updates on FedWatch and related interest rate products."
    },
    {
      "url": "https://www.newyorkfed.org/markets/reference-rates/obfr",
      "text": "The overnight bank funding rate is a measure of wholesale, unsecured, overnight bank funding costs. It is calculated using federal funds transactions, certain Eurodollar transactions, and certain domestic deposit transactions, all as reported in the FR 2420 Report of Selected Money Market Rates. The federal funds market consists of domestic unsecured borrowings in U.S. dollars by depository institutions from other depository institutions and certain other entities, primarily government-sponsored enterprises. The Eurodollar market consists of unsecured U.S. dollar deposits held at banks or bank branches outside of the United States. U.S.-based banks can also take Eurodollar deposits domestically through international banking facilities (IBFs). Also included in the calculation of the OBFR are U.S. dollar deposits with a fixed overnight term and a negotiated interest rate that are booked in U.S. offices of banks. These transactions are collected in the FR 2420 under Part D, \"Selected Deposits.\"\nThe overnight bank funding rate (OBFR) is calculated as a volume-weighted median of overnight federal funds transactions, Eurodollar transactions, and the domestic deposits reported as “Selected Deposits” in the FR 2420 Report. The New York Fed publishes the OBFR for the prior business day on the New York Fed website at approximately 9:00 a.m.\nFor more information on the OBFR’s publication schedule and methodology, see Additional Information about Reference Rates Administered by the New York Fed."
    }
  ],
  "argos_summary": "The article argues that the Federal Reserve’s Fed Funds rate cuts, which historically lowered long‑term rates, have stopped working since September 2024. After three cuts, Treasury yields, mortgage rates, and corporate bonds rose instead of falling, reversing a long‑standing positive correlation. The author attributes this to simultaneous quantitative tightening and a possible structural shift in the transmission mechanism, suggesting the Fed’s policy lever may now be ineffective. Market expectations still favor a September cut, but the evidence indicates it may not lower borrowing costs as intended.",
  "argos_id": "HYJA10SKI"
}