{
  "url": "https://www.howtogeek.com/the-era-of-desktop-pcs-could-end-sooner-than-you-think/",
  "authorsByline": "Sydney Butler",
  "articleId": "36a5a9e112604cc7b4b23c289efd7e92",
  "source": {
    "domain": "howtogeek.com",
    "location": {
      "country": "us",
      "state": "VA",
      "county": "Fairfax County",
      "city": "McNair",
      "coordinates": {
        "lat": 38.9695316,
        "lon": -77.3859479
      }
    }
  },
  "imageUrl": "https://static0.howtogeekimages.com/wordpress/wp-content/uploads/2022/12/shutterstock_1590467296.jpg?w=1600&h=900&fit=crop",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-31T18:30:15+00:00",
  "addDate": "2025-08-31T18:41:04.868693+00:00",
  "refreshDate": "2025-08-31T18:41:04.868695+00:00",
  "score": 1.0,
  "title": "Desktop PCs: A Dying Breed in the Age of Laptops and Mobile Devices",
  "description": "It is inevitable.",
  "content": "There was a time that the only shape computers came in was a desktop or tower case. All computers were big, bulky, and plugged into the wall. Then, as components shrank and became less power-hungry, computers became portable, and later truly mobile.\n\nToday, laptop computers far outsell desktop systems, with the former growing every year, and the latter in a steady decline. It's not hard to imagine that the desktop as we know it will soon fade to a niche system, with even mini PCs being a more sensible choice where desktops used to offer a better deal.\n\nThe Golden Age of the Tower\n\nOur first ever computer, an IBM-compatible 80286 system, came in a lovely beige horizontal desktop case with the CRT monitor perched on top. This was around 1990, and we would re-use that case throughout the 90s, ending its run with a Pentium 166 MMX somehow shoehorned into that aging chassis. In the meantime, everywhere else people were moving over to tower cases, which is what people think of when we talk about \"desktop\" PCs, though, of course, towers are meant to stand on the floor, not on the actual desktop.\n\nEither way, for decades the tower form-factor has been the go-to for desktop computers. They have a small footprint, you can put them basically anywhere, and there's lots of space for drives, cards, and any other components you might want.\n\nThanks to the rise of SSDs and component integration (such as sound cards in motherboards), most modern tower PCs are actually mainly wasted space. Which is why you're seeing more small form-factor computers like mini-towers and various interesting mini-ITX designs.\n\nWhatever exact desktop chassis you go with, desktop computers offer the most flexibility, the highest potential performance, the best performance-to-price ratio, and the option to upgrade your PC incrementally rather than replacing the whole thing every time, though in practice, upgrading one component at a time might not be as common as you think.\n\nThe thing is, computer technology kept getting more powerful, and eventually any computer became powerful enough to accommodate the daily needs of the vast majority of people. For most people, there's no practical difference between a $500 Windows laptop and a $5,000 high-end desktop PC when it comes to watching YouTube and writing reports in Google Docs.\n\nWhat matters much more is the convenience, simplicity, and mobility of a laptop computer. Most people would rather have a MacBook Air or similar computer than a desktop PC, and even when working at a desktop it's dead simple to simply connect external peripherals. Often with a single USB-C or Thunderbolt cable.\n\nThe numbers don't lie—in the third quarter of 2008, laptop computers overtook desktop sales for the first time, and it's been progressing in that direction since. In the first quarter of 2024 (according to the IDC) about 64% of computer shipments were laptops, tablets, or 2-in-1 mobile computers.\n\nSo, in their personal lives, most people are probably not opting for a desktop system, because the traditional strengths of that form factor don't mean much to them. At the same time, traditional bastions for desktops, such as large companies flooding their desks with office PCs, might find that providing a laptop makes more sense, or that they might just as well use mini PCs, which are often no more than laptop guts stuffed into a tiny screenless box.\n\nThe actual situations where a traditional desktop system is necessary are dwindling, and so people are making different choices that better fit their needs.\n\nA major bastion of the desktop tower is PC gaming. It's one of the few situations where you can actually make use of every ounce of performance modern PC components can produce. Desktop systems appeal to gamers at every budget level too, so it's not just the $5,000 enthusiast rigs we're talking about here.\n\nYet, the RTX 4060 laptop GPU is the second most common GPU on the Steam Hardware Survey as of July 2025. Laptops with this GPU tend to be pretty affordable, and offer performance very similar to current-generation consoles like the PlayStation 5 and Xbox Series X.\n\nGames are generally designed for these platforms, and it seems we've hit a point of diminishing returns with graphics for most players. Cloud gaming is also on the rise, which can give people access to high-end PC hardware on-demand. These are all different factors that together exert a downward pressure on the demand for desktop PCs, even for gamers.\n\nPhones, Tablets, and Other Devices Ate the Rest\n\nThis isn't just about laptops versus desktop PCs. A lot of people just don't need a PC of any kind in their daily lives. Tablets and phones offer plenty of power and functionality for someone to operate in the modern world. You can even hook up a monitor, mouse, and keyboard to these devices for more \"serious\" work if you really need to.\n\nIt's not uncommon for members of Gen Z (and presumably soon Gen Alpha) to enter college or the world of work with practically zero PC literacy, because they've simply had no need to own or use a PC up to that point.\n\nForget the year of the Linux desktop, the final year of the desktop itself may be on the horizon.\n\nWhat Survives When the Tower Dies?\n\nIs this the death knell for desktops? Not quite—but they’re certainly retreating to niche terrain. Enthusiasts, modders, creators, and professionals with specific hardware demands still prize the expandability and customization of towers. Gaming desktops, for instance, enjoy a loyal market, especially among high-performance seekers.\n\nThough even with serious workstation hardware, the trend now may be to put those high-end workstations in server racks, and have engineers and developers access them remotely using laptops. The need for ultra-high performance in a local machine just isn't as high in a world with plenty of high-speed broadband.\n\nI don't think the desktop tower computer will be gone tomorrow, but we're already at the point where they just aren't the best choice for the vast majority of people. As time goes by the list of reasons to own and operate a desktop tower will grow shorter and shorter, until it's just the hardcore among us keeping the desktop dream alive.",
  "medium": "Article",
  "links": [
    "https://www.shutterstock.com/image-illustration/server-racks-room-data-center-3d-495697993",
    "https://bestbuy.7tiv.net/c/156932/614286/10014?subId1=UUhtgUeUpU2016144&subId2=ehtg&u=https%3A%2F%2Fwww.bestbuy.com%2Fsite%2Fapple-macbook-pro-14-inch-apple-m4-pro-chip-built-for-apple-intelligence-24gb-memory-512gb-ssd-space-black%2F6602748.p%3FskuId%3D6602748",
    "https://store.steampowered.com/hwsurvey/videocard/",
    "https://www.howtogeek.com/mini-itx-vs-microatx/",
    "https://www.howtogeek.com/best-2-in-1-laptops/",
    "https://www.howtogeek.com/825202/what-is-a-pc-anyway/",
    "https://www.amazon.com/Apple-MacBook-Laptop-12%E2%80%91core-16%E2%80%91core/dp/B0DLHDJH98/?tag=hotoge-20&ascsubtag=UUhtgUeUpU2016144&asc_refurl=https%3A%2F%2Fwww.howtogeek.com%2Fthe-era-of-desktop-pcs-could-end-sooner-than-you-think%2F&asc_campaign=Feed",
    "https://www.wired.com/2008/12/desktops-dying/",
    "https://www.shutterstock.com/image-illustration/vintage-desktop-pc-floppy-drive-keyboard-2015060411",
    "https://www.howtogeek.com/mini-pc-week-2025/",
    "https://www.apple.com/shop/buy-mac/macbook-pro/14-inch-m4-pro",
    "https://www.shutterstock.com/image-photo/aug-18th-2020-woman-standing-holding-1799864374",
    "https://www.shutterstock.com/image-photo/computer-desktop-pc-297056774",
    "https://www.howtogeek.com/desktop-linux-keeps-winning-the-wrong-battles/",
    "https://www.idc.com/promo/pcdforecast/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Desktop PCs",
      "weight": 0.11727639
    },
    {
      "name": "desktop PCs",
      "weight": 0.11727639
    },
    {
      "name": "desktop computers",
      "weight": 0.114940345
    },
    {
      "name": "Desktop systems",
      "weight": 0.1037944
    },
    {
      "name": "desktop systems",
      "weight": 0.1037944
    },
    {
      "name": "desktops",
      "weight": 0.09742304
    },
    {
      "name": "Gaming desktops",
      "weight": 0.09363362
    },
    {
      "name": "laptop computers",
      "weight": 0.09278656
    },
    {
      "name": "most modern tower PCs",
      "weight": 0.09219167
    },
    {
      "name": "modern PC components",
      "weight": 0.08317251
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Shopping/Consumer Resources/Product Reviews & Price Comparisons",
      "score": 0.6513671875
    },
    {
      "name": "/News/Technology News",
      "score": 0.61083984375
    }
  ],
  "sentiment": {
    "positive": 0.20901841,
    "negative": 0.2690574,
    "neutral": 0.5219242
  },
  "summary": "The article discusses the decline of desktop PCs in favor of laptops and mobile devices, with laptop computers surpassing desktop systems every year. The article suggests that the desktop as we know it will soon fade to a niche system, with even mini PCs being a more sensible choice. The author suggests that desktop computers offer flexibility, potential performance, the best performance-to-price ratio, and the option to upgrade your PC incrementally rather than replacing the whole thing every time. However, the article also notes that desktop PCs are becoming less portable and more accessible due to the increasing popularity of laptops, tablets, or 2-in-1 mobile computers. Most people prefer the convenience, simplicity, and mobility of a laptop computer over a desktop PC, and are choosing smaller form-factor computers like mini-towers and mini-ITX designs. The book also notes the decline in desktop PCs due to advances in computer technology such as SSDs and component integration, and that consumers are shifting towards smaller, more compact, smaller devices. Despite this shift, the author notes that the demand for desktop PCs is waning due to factors such as PC gaming and cloud computing.",
  "shortSummary": "The traditional desktop PC form-factor is dying as laptop computers dominate, with smaller, portable computers and mobile devices dominating our daily lives and evolving consumer choices.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "ea6cffb594d64bc5a8d1a5ff656bfd7f",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.apple.com/shop/buy-mac/macbook-pro/14-inch-m4-pro",
      "text": "Buy MacBook Pro with education savings, get AirPods or an eligible accessory of your choice.§ Learn more\nChoose your new MacBook Pro.\nStudents and educators — save on a new Mac for college.\nGet special pricing in the Education Store.\nShop now Students and educators — save on a new Mac for college.\nCompare Mac models.\nChoose the best Mac laptop or desktop for you (opens in a new window)\nMac. Handled with AppleCare.\nAppleCare offers one-stop support and service for all of your Apple products — from the people who know them best. Get easy, fast repairs for accidents like drops and spills. And 24/7 priority care with just a chat, call, or tap. ${translate.store.a11y.footnote} °\nYou can enjoy individual coverage for Mac with AppleCare+. Or you can cover multiple products with AppleCare One. No matter which plan you choose, you’ll get peace of mind for the products you love. ${translate.store.a11y.footnote} °°"
    },
    {
      "url": "https://www.howtogeek.com/best-2-in-1-laptops/",
      "text": "If you're stuck between choosing a laptop and a tablet, you can get the best of both worlds with a 2-in-1 laptop. It functions like an ordinary laptop, but with a quick fold, it's suddenly a tablet.\nWhat to Look For in a 2-in-1 Laptop\nAlthough a 2-in-1 laptop may sound wildly different from a regular laptop, it’s anything but. What makes a good laptop also makes a good 2-in-1 laptop. Of course, the defining trait is that a 2-in-1 laptop almost always has a touchscreen display.\nSince that’s its most significant trait, the display should be in line with your needs. After all, when you switch from laptop to tablet, you’ll usually get closer. Therefore, the minimum resolution should be no lower than 1080p and, ideally, no smaller than 13 inches. Anything less would make it incredibly uncomfortable to use.\nSpeaking of the display, if your purpose for getting a 2-in-1 laptop is to edit videos, images, or art, then color gamut and color space are essential, as well as contrast. The more colors a display can output, the more true-to-life images and whatnot. In contrast, a higher ratio means darker areas will appear black instead of gray.\nAs a side note, a stylus packaged with the laptop will help offset the cost. For example, the Microsoft Surface Pro 11, featured on our list, doesn’t include a stylus but is compatible with the Surface Slim Pen. On the other hand, the Lenovo Yoga i9 Laptop comes with a stylus. Keep in mind that styluses are not universal!\nIf you’re hoping to game on your 2-in-1 laptop, GPU and CPU are, without a doubt, the most important aspects. While integrated graphics from CPUs can work fine for light gaming and creative software, a discrete GPU is needed to run games at higher frames, resolution, and graphics settings. However, a discrete GPU is usually a half-step behind its full-sized external GPU counterparts, but you'll still get comparable performance.\nLastly, it also wouldn't hurt to consider what operating system you want to use. Windows is the obvious winner, but a 2-in-1 laptop using Chrome OS could significantly reduce the resources needed to function. Ultimately, it would reduce the overall cost of the machine.\nBest 2-in-1 Laptop Overall: Microsoft Surface Pro 11\n|\nPros |\nCons |\n|\n14-hour battery life |\nKeyboard sold separately |\n|\nOLED display is magnificent |\n|\n|\nCan downgrade specs to make it more affordable |\n|\n|\nRemovable SSD |\nThe Microsoft Surface Pro 11 is an interesting prospect because you’re given the reins on key features, such as storage, display, RAM, and CPU. In the end, you’ll always end up with a powerful and efficient laptop that’s well-balanced for anything you throw at it.\nFor instance, the choice between a Snapdragon X Elite and a Snapdragon X Plus ultimately comes down to how many cores you want or need—the X Elite having 12 and the X Plus having 10. That’s not a major difference, but those two extra cores come in handy for multitasking or editing software.\nRegardless of the components you pick, the Microsoft Surface Pro’s CPU won’t suck your battery dry after an hour. It’s quite efficient, lasting up to 14 hours. Even if you put the laptop through its paces, you can rest easy knowing it’ll handle the day’s work.\nMicrosoft Surface Pro 11 (OLED)\nMicrosoft's Snapdragon-powered Surface Pro 11 combines desktop-class performance with an incredible 14-hour battery life. Windows on ARM still has plenty of growing pains, but the Surface Pro 11 is still a no-brainer for casual users and some professionals.\nBest 2-in-1 Budget Laptop: Lenovo IdeaPad Flex 5i Chromebook Plus\n|\nPros |\nCons |\n|\nDecent selection of ports |\nNot exactly a powerhouse |\n|\nChrome OS is easier on the limited system resources |\n|\n|\n13-hour battery life |\n|\n|\nCan install Google Play apps natively |\nIn the budget department, the Lenovo IdeaPad Flex 5i Chromebook Plus is a slimmer option in terms of features and performance. However, with Chrome OS being pretty lightweight and a good selection of ports really makes up for it.\nFor starters, Chrome OS is much easier on resources than Windows 11. It won’t be as taxing for the Lenovo IdeaPad Flex 50 Chromebook Plus, given its Intel Core i3-1315U and 8GB of RAM. And with Google Play being accessible natively, it grants you a wealth of apps.\nSpeaking of wealth, this 2-in-1 laptop also has a good set of ports. Looking to expand your storage? Use the microSD card slot. Want to connect your laptop to an external display? There are two USB-C 3.2 Gen 2 ports. There’s even a USB-A, headphone jack, and Kensington Nano security slot for good measure.\nLenovo IdeaPad Flex 5i Chromebook Plus\nWith a good battery life, 14-inch display, and slim design, the Lenovo IdeaPad Flex 5i Chromebook Plus is a well-rounded 2-in-1 laptop on a tight budget. It's perfectly suited for general use, like entertainment, work, and taking notes.\nBest 2-in-1 Laptop for Students: HP Envy x360\n|\nPros |\nCons |\n|\nBuilt-in camera has a privacy shutter |\nIntel integrated graphics only |\n|\nIntel Ultra 5 125U processor with 12 cores and 14 threads |\n|\n|\nIPS display has better viewing angles |\n|\n|\nLow blue light for late night studying |\nAs a student, you'll need a 2-in-1 laptop with plenty of storage and a CPU that can handle multiple programs at once. You'll also want a good webcam, just in case you need to contact professors, teachers, and classmates. The HP Envy x360 has that and more.\nIn the case of storage, the HP Envy x360 has a 512GB NVMe M.2 SSD, which is plenty, but more importantly, having an SSD will ensure programs, booting, and file access will feel far snappier than a mechanical hard drive.\nLastly, the HP Envy x360 has a 5MP camera, with dual array digital microphones built right in. It even has some temporal noise reduction to keep your voice audible and clear.\nHP Envy x360\nGiven its CPU designed for multitasking, fast SSD, and 5MP camera, the HP Envy x360 already has the makings of a great 2-in-1 laptop for school. It has a healthy selection of ports if and when you need to expand your workspace.\nBest 2-in-1 Laptop for Drawing: Lenovo Yoga i9 2-in-1 Laptop\n|\nPros |\nCons |\n|\nIncludes the Lenovo Slim Pen |\nNo HDMI |\n|\n14-inch OLED display |\n|\n|\n100% DCI-P3, True Black 500, and Dolby Vision |\nFor artists, any 2-in-1 laptop needs two things: a good CPU and a big enough screen. Luckily, the Lenovo Yoga 9i has the Intel Core Ultra 7 155H, with Intel’s Arc integrated graphics. It’s even loaded with 32GB of LPDDR5x memory to make the system snappier.\nOf course, the crowning jewel is the display itself. The Lenovo Yoga 9i 2-in-1 Laptop has a 14-inch PureSight OLED touchscreen that covers 100% of the DCI-P3 color space. Add in True Black 500 and Dolby Vision support, and you’ve got a display that’ll make those colors pop, whether you're editing images or drawing.\nBest of all, you don’t have to splurge for a pen. The Lenovo Yoga 9i comes packaged with the Lenovo Slim Pen. When you’re done using it for the day, it can be attached magnetically for easy storage.\nLenovo Yoga 9i 2-in-1\nThe Lenovo Yoga 9i 2-in-1 combines powerful hardware, a great-looking OLED touchscreen, and a thin and light design to make this one of the best 2-in-1s you can buy.\nBest 2-in-1 Laptop for Gaming: Asus ROG Flow Z13\n|\nPros |\nCons |\n|\nStays very cool and quiet while gaming |\nPricey |\n|\n1TB SSD |\n|\n|\nDiscrete GeForce RTX 4050 graphics card |\n|\n|\nThin and compact |\nLook, tablets have come a long way in the gaming department, but those chipsets can’t compare to a discrete GeForce RTX 4050 with 6GB of VRAM. Yes, that’s what this Asus ROG Flow Z13 is rocking, along with 16GB of RAM to boot.\nAlthough the Asus ROG Flow Z13 is slim—half an inch thin, as a matter of fact—it’s more or less a master class in cooling. Asus gave the Flow Z13 a custom vapor chamber with plenty of surface area to reach the GPU, CPU, and VRM. To top it off, the CPU even has liquid metal thermal paste because you can never have enough cooling for your processor.\nTo be fair, you’re going to need as much cooling as possible, given the 13.4-inch 2K display. It’s not just running the laptop at higher resolutions, but running it at 165Hz, but the Asus ROG Flow Z13 does both beautifully.\nAsus ROG Flow Z13\nWith a discrete GeForce RTX 4050 and an Intel Core i9-13900H, there's no game beyond your reach when you use the Asus ROG Flow Z13. And to top it off, the special attention to cooling will ensure the laptop stays cool and quiet while you play.\nFAQ\nWhat is a 2-in-1 laptop?\nSimply put: a 2-in-1 laptop can be used as a tablet or laptop. It's still a laptop, but thanks to a hinge, you can fold it and use it like a tablet.\nIs there a 3-in-1 laptop?\nNo. About the closest you can get to a 3-in-1 laptop is one that has a video port for connecting to external monitors.\nCan I remove the keyboard on a 2-in-1 laptop?\nIt depends on the model.\nMicrosoft Surface Pro 11 has a detachable keyboard, whereas the Lenovo Yoga i9 does not.\nAre all 2-in-1 laptops Windows based?\nNope!\nAlthough it's the majority of 2-in-1 laptops to be Windows-based, plenty of models run Chrome OS. With a detachable keyboard, you could turn a iPad into a 2-in-1 laptop!"
    },
    {
      "url": "https://www.wired.com/2008/12/desktops-dying/",
      "text": "Desktops have been on the road to oblivion for a few years now in the U.S. but now the rest of the world seems to be catching up.\nGlobal notebook shipments exceeded those of desktops on a quarterly basis for the first time ever in the third quarter, says research firm iSuppli.\n\"This marks a major event in the PC market because it marks the start of the age of the notebook,\" said Matthew Wilkins, principal analyst for compute platforms at iSuppli in a statement.\nLaptop sales rose almost 40 percent in the third quarter to reach 38.6 million devices shipped, while sales of desktop PCs declined\n1.3 percent to 38.5 million units.\nDespite a weak economy, people didn't slow down on their purchases of a computer. Worldwide PC sales rose 15.4 percent in the third quarter to 79 million units.\nIn terms of the top players, Hewlett-Packard retained its position as the market leader followed by Dell and Acer. Lenovo and Toshiba ranked fourth and fifth on iSuppli's charts.\nFor Apple fans there was some bad news. Apple lost almost half a point of market share from the previous quarter, placing it seventh overall, says iSuppli.\n“The big news was undoubtedly the performance of Taiwan’s Acer ” said Wilkins said.\nAcer's netbook strategy paid big dividends for the company. It grew its market share by 45\npercent in the third quarter and by 79 percent on a year-over-year basis.\nAcer shipped almost 3 million more notebooks in the third quarter than it did in the previous quarter, with a majority of them being netbooks.\nSo will netbooks become the notebook-killers of the future? Will they do to notebooks, what notebooks did to desktops?\nPhoto: (coda/Flickr)"
    },
    {
      "url": "https://www.howtogeek.com/desktop-linux-keeps-winning-the-wrong-battles/",
      "text": "Linux is one of the most prolific operating systems in the world—except when it comes to desktop PCs. Yet lovers of Linux hold on to the idea that one of these years, Linux will reach the tipping point and become the most popular desktop operating system—the year of the Linux desktop.\nWhile this could absolutely happen, the way that Linux as a whole has been developing over the years isn't always conducive to making the world's Windows and macOS users convert en masse. Linux is always winning a new battle, but are they the right ones?\nThe Myth of the “Year of the Linux Desktop”\nThe idea of \"The year of the Linux desktop\" is less a prediction of something, and more like a prophecy. Like a belief that a messiah will one day come and whisk us all away to Linux heaven.\nEvery time a new computer that ships with Linux makes waves, or there's a promising new user-friendly distro, you'll hear that this is the year Linux makes its mark on the desktop market.\nWhere Linux Actually Wins\nIf you look closely, Linux is making gains—just not the ones that get splashy headlines. Gaming support has improved dramatically thanks to initiatives like Proton and Steam Deck’s Linux-friendly ecosystem. Hardware compatibility has gotten better, with manufacturers finally shipping devices that don’t require endless driver hacks. Polished distros like Pop!_OS, Fedora, and Ubuntu have made Linux more approachable for newcomers.\nThe problem is that these are \"wins\" because they bring Linux closer to Windows or macOS. In some cases, it's literally about making Windows software work on Linux, which is impressive and arguably necessary, but that's a rather pyrrhic victory, don't you think?\nWe get desktop environments more like Windows, and Linux laptops are just laptops that usually ship with Windows. Nothing bespoke the way that Apple does it, for example. In short, Linux is \"winning' by chasing other operating systems rather than leading.\nThe Wrong Battles\nMeanwhile, the Linux community spends enormous energy on debates that rarely affect mainstream adoption. Consider the “init wars,” where systemd sparked endless flame wars (and memes) about the proper way to boot a Linux system.\nDesktop Environment rivalries—KDE versus GNOME versus XFCE—consume attention and fragment effort. Packaging formats and distribution philosophies generate near-religious arguments.\nNone of this matters to the regular folks who could actually make the \"year of desktop Linux\" happen. They don't care about Snap or Flatpack, they care that their favorite apps will work, that updates won't break anything (which Windows does all the time), and that they don't have to learn a list of text commands to make basic changes to their computers.\nFocusing on these technical minutia isn't gaining Linux any ground in this particular war for desktop dominance.\nThe Battles That Matter\nReal desktop adoption comes down to four areas: usability, applications, hardware partnerships, and user experience.\nPeople want an operating system that feels coherent, and that simply runs the software they need without any friction. This isn't just a Linux problem, of course. Look at how quickly Windows for Arm crashed and burned when people realized that their favorite Windows apps wouldn't run, or would run very poorly. Contrast that with Apple's Rosetta 2, where not a single macOS user needed to know what it is, how it works, or do anything special. Their old Intel macOS apps almost always just worked. Usually better than before.\nBasically, Linux (and maybe even Windows, at this point) has a distinct leadership problem, and no unified direction of development. I understand that the open-source, community-based nature of Linux makes this difficult, but we've seen it happen to some extent.\nCompanies like Valve have demonstrated that strategic vision and thoughtful integration can make Linux viable for large audiences. The Steam Deck proves that Linux can deliver a polished, cohesive experience—when someone decides to focus on the battles that actually matter.\nSteam Deck OLED\n- Power Source\n- 50Whr battery\n- What's Included\n- Console, charger, carrying case\nWhat It Would Take to Truly Win\nFor Linux to really win that coveted spot as most popular desktop OS, it needs more than just software that does the job. It would require coordination with hardware and software vendors, and some sort of coherent leadership.\nUntil then, Linux will continue to excel in servers, embedded devices, and niche gaming rigs, all while the desktop remains a fragmented playground of technical victories that don't really have any true impact on whether people will switch from the operating systems they're already using."
    },
    {
      "url": "https://www.howtogeek.com/mini-pc-week-2025/",
      "text": "You no doubt use your PC for all kinds of tasks, but you might find one even more useful in a tiny form factor. Mini PCs aren't just cute; they're versatile, portable, and can be more powerful than you'd expect.\nWe're big fans of these small devices here at How-To Geek, and that's why we're dedicating an entire week to them. From June 30 to July 6, we'll be writing about our favorite uses for mini PCs—and our favorite excuses to get one.\nWhy We Love Mini PCs\nWe aren't just hyping up these little fellas for kicks and giggles. There are plenty of good reasons to hop on the mini PC bandwagon:\n- They're Compact and Portable: The biggest appeal of mini PCs is that their size makes them perfect for taking with you on the road or around the house. They're also great for tucking away when you want a clean and minimalist desk, entertainment center, or server room.\n- They're Highly Versatile: Thanks to their size and still respectable resources, mini PCs have countless uses. Need a headless server? A mini PC saves you from a bulky tower or a pointless laptop screen, and with lower power draw. Want more room on your desk? Tiny PCs always have a smaller footprint than your standard PC. Want a dedicated computer for retro gaming? A cheap and basic mini PC will run most old-school games with ease.\n- They Can Get Surprisingly Powerful: In spite of their humble appearance, you can find mini PCs in no short supply of performance. They can often be configured or upgraded to 64GB RAM and beyond. While most don't have the space for a built-in graphics card, many models include ports that enable use of an external GPU for serious computing power.\nMini PC Week on How-To Geek\nThis week, we'll be publishing several articles about mini PCs and how you can use them for everything from gaming to Plex streaming to being productive. In case you get tiny PC fever, we'll also talk about the best and most affordable mini PC options out there.\nTo avoid missing any of that, check out our Mini PC Week hub. I also recommend subscribing to our newsletter, where you'll get in your inbox everything we publish, this week and beyond."
    },
    {
      "url": "https://www.howtogeek.com/mini-itx-vs-microatx/",
      "text": "Quick Links\nSummary\n- Mini-ITX motherboards are significantly smaller than microATX motherboards, making them ideal for tiny computer builds suitable for travel.\n- Mini-ITX motherboards have fewer features and limited expandability compared to microATX motherboards.\n- MicroATX motherboards are suitable for budget builds, as they're cheaper and offer better compatibility with PC parts.\nAre you getting tired of your regular-sized case and want a smaller computer? In that case, your choice essentially boils down to Mini-ITX and microATX motherboards and their respective cases. Mini-ITX is the smaller of the two, but how much exactly do you lose?\nSize: Mini-ITX Build Is Absolutely Tiny\nOne of the key reasons people buy a Mini-ITX or microATX over a standard ATX motherboard is size. A Mini-ITX motherboard measures 6.7 by 6.7 inches (17 by 17 cm), while microATX motherboards are 9.6 by 9.6 inches (24.4 by 24.4 cm). If you do the math, you'll find that microATX motherboards are about 40% larger than Mini-ITX. Still, both are significantly smaller than ATX motherboards, which measure 12 by 9.6 inches (30.5 by 24.4 cm). To put things into perspective, a Mini-ITX motherboard has a smaller footprint than a 10-inch laptop.\nThis difference in size primarily affects the overall expandability and choice of case. Let's first talk about cases. We could talk about case dimensions, but because PC cases come in many different shapes, it's better to look at the volume. We measure PC case volume in liters. Although there aren't any strictly defined definitions, manufacturers typically put Mini-ITX cases in the 5–12-liter range. Small microATX cases are about 12 to 30 liters.\nThere's some overlap between the two standards in the 12–16 liter range, so be sure to check the specs to see what motherboards are supported before ordering a case. Remember, you can always go up in the size of the case but not down.\nIn real-world scenarios, the difference between a Mini-ITX and a microATX case is not as substantial as you might expect. Neither option will occupy much space on your desk or under your TV. If your goal is to have a small and not the smallest possible computer, microATX will be great. But if a small form factor PC is what you're after, you can't go wrong with a Mini-ITX case. If you need the smallest computer possible, you should take mini PCs into consideration too. Some can even fit in the palm of your hand or inner coat pocket.\nPerformance and Expandability: How Much Do You Lose With Mini-ITX?\nThis is where the real differences between Mini-ITX and microATX hide. microATX motherboards are essentially a trimmed version of a full-size ATX case. While the exact configuration varies, microATX motherboards typically have fewer PCI and M.2 slots, USB and SATA connectors, fan headers, and a few other minor features. They still retain four RAM slots, although some budget options only have two. All in all, microATX motherboards make sacrifices in all the right places, so you won't even notice that important features are missing.\nMini-ITX is even smaller than microATX, so it has fewer of everything. Mini-ITX motherboards only have a single PCIe x16 slot for the graphics card, a maximum of two M.2 slots and SATA connectors, fewer USB connectors, and only a couple of fan and RGB headers. But the biggest sacrifice is that Mini-ITX motherboards typically only have two RAM slots. The only exception is motherboards that use SODIMM RAM (which are designed for laptops), like the AsRock X570D4I-2T AM4 Server Motherboard.\nIf you don't need a whole lot of storage and don't care about expansion cards, you could still make Mini-ITX work. I advise you to buy more RAM than you initially planned and to look for a motherboard with built-in Wi-Fi and Bluetooth. Adding those features later will be difficult or impossible. If you're a gamer, we have recommendations for excellent motherboards for AMD and Intel.\nOpting for a higher-tier motherboard will provide you with better features and expandability, regardless of the motherboard form factor.\nCooling is another factor that's at play with small PCs. Cramming powerful components into a tiny space will result in a lot of heat that has nowhere to go, and you can't always add more case fans to fix the issue. Some Mini-ITX cases allow for AIO liquid cooling and relatively tall air coolers, but size will always be a limiting factor. microATX cases are larger, which means more fans, larger radiators, and better cooling.\nPrice: Pay More to Get Less With Mini-ITX\nYou'd think that Mini-ITX would be cheaper because it's smaller and has fewer parts. However, Mini-ITX is a niche form factor for small PC builders; it's not in demand like microATX and ATX. Mini-ITX can't benefit from economies of scale to scale up production and reduce costs, so you end up paying more and getting less.\nOn the other hand, microATX is often cheaper than standard ATX motherboards. microATX is a popular form factor that strikes a perfect balance between size and features. Manufacturers need fewer parts to make a microATX motherboard than an ATX one, so the resulting product usually costs less. For example, the Gigabyte B650M Aorus Elite AX motherboard is typically cheaper than the full-size Gigabyte B650 Aorus Elite AX while still retaining all of its core features. Not only are microATX great for small PC builds, but they're also amazing for budget-conscious buyers who don't need half a dozen fan headers and expansion slots.\nPortability: How Small Do You Need?\nWe've already established that Mini-ITX motherboards allow for significantly smaller PC builds while still allowing for desktop-sized graphics cards. Although Mini-ITX isn't as portable as a gaming laptop, it can give you significantly better performance for your money. A Mini-ITX PC with a handle—like the KXRORS S300—is perfect if you frequently travel between two destinations that have displays you can plug into.\nIf you don't travel often or only have to move your PC occasionally, a small microATX case offers more value without a significant compromise in space and portability. microATX cases can easily fit inside car trunks without taking up that much space.\nBuild Difficulty: Mini-ITX Is Finicky\nThe number one complaint you'll hear from Mini-ITX owners isn't overheating—it's build difficulty. Cable routing is a nightmare, and good luck trying to fit more than one SSD or HDD. The motherboard is pretty much the only thing guaranteed to fit. Everything else is incredibly difficult to cram in, especially if it's a full-sized component. To make things easier, opt for a small form factor power supply and graphics card and a low-profile CPU cooler.\nmicroATX doesn't suffer from this problem as much, but smaller cases still pose a challenge. You'll have more room for cables, storage, fans, and long graphics cards. You'll have more options for PC parts, so you can better tailor the PC to meet your needs and budget.\nChoose a Case Before You Build the PC\nWhile you could pick a graphics card or motherboard and go from there, your case will be the piece that makes or breaks the whole small PC build. Mini-ITX and microATX are universal standards, and while there are some tiny differences in their dimensions, you shouldn't have any trouble fitting a motherboard with a well-designed case.\nTo get you started, take a look at our roundups of the best Mini-ITX and microATX cases and pick one that aligns with your needs and fits your budget. Look for something that makes smart use of the limited space available, has plenty of airflow, and can fit full-size components. Unless you absolutely need a tiny Mini-ITX computer, I recommend going for a small microATX case because you'll get more of everything at a potentially lower cost."
    },
    {
      "url": "https://www.idc.com/promo/pcdforecast/",
      "text": "“Though the market has been experiencing a slower return to growth, there was some room for optimism in Q4 as government subsidies in China led to better than expected performance within the consumer segment,” said Jitesh Ubrani, research manager with IDC’s Worldwide Mobile Device Trackers. “Beyond that, the US and some European countries also showed strong performance due to end-of-year sale promotions, as well as enterprises continuing on the path of upgrading hardware before the end of support for Windows 10 which is scheduled for October 2025.”\nThe approaching administration change in the US along with the threat of new and increased tariffs have elevated the level of concern across the industry, with some brands looking to get ahead of what is essentially uncertainty. Supply side research showed some pull-in during December, largely from those brands that have limited manufacturing capacity outside of China. Presumably as a preventative measure around US tariffs on goods made in China.\n“The overall macroeconomic concerns seem to be overshadowing some of the progress and excitement around AI PCs. However, we maintain the view that the impact that on-device AI will have on the industry will be positive, even if the inflection point is delayed,” said Ryan Reith, group vice president with IDC’s Worldwide Device Trackers. “When the industry is trying to push new AI PCs that come with higher cost at a time when use cases are still being vetted and budgets are tight, that is clearly going to be a challenge. But on-device AI for PCs is inevitable, therefore, right now it is about suppliers trying to be patient as their customers are dealing with headwinds unrelated to these technology advancements.”\nLooking ahead to 2025, weakening market sentiment and U.S. tariffs on China drive reduction in PC and tablet demand. In the wake of the USA’s tariffs on China as well as a weakening market sentiment, mostly in the consumer space, IDC has reduced its traditional PC forecast in 2025 and beyond. Global PC volume is now expected to reach 273 million in 2025, still growing +3.7% over the prior year though this is a slight reduction from the prior forecast. Beyond 2025, IDC forecasts sub 1% growth each year through 2029 for the traditional PC market, due in part from volume stabilization following Windows 11 migration. Meanwhile, tablets are not expected to fare much better as shipments are anticipated to shrink 0.8% in 2025 to 143.3 million and the market faces a slight gradual decline, reaching 141.6 million units by the end of 2029 due mostly to consumer saturation.\nIn addition to form factor-specific trends, the commercial space will be the main driver for the gains in 2025. Commercial PC volume (including Education PCs) grew 2% in 2024, driven by some large deals and modest Windows 11 migration volume. As shown in the table below, IDC expects commercial and school renewal projects to be the biggest driver for 2025. In keeping with past Windows PC refresh cycles, IDC expects firms to largely continue Windows 11 PC purchases through 2025, although budgets and other constraints will leave some to choose in-place upgrades or pay for extended Windows 10 support. AI PC purchases have faced hurdles since their launch, but IDC expects a more robust ecosystem to emerge by latter 2025, leading most new PCs to be GenAI-capable by 2026."
    },
    {
      "url": "https://www.howtogeek.com/825202/what-is-a-pc-anyway/",
      "text": "Quick Links\nEveryone knows that \"PC\" is short for \"Personal Computer,\" but not everyone can agree on what counts as a PC or doesn't. It turns out that the term \"PC\" is packed with more nuance than you might have thought!\nThe Broad Meaning of PC\nVirtually all words have multiple meanings, depending on the context you use them in and what you mean when you use them. Dictionaries record how we use words and how their meanings change over time. In other words, they describe the living meaning of words rather than prescribe what a word \"should\" mean.\nThe broadest meaning of \"Personal Computer\" covers any computer designed for personal use. In general, \"computer\" in this sense means a general-purpose computer. One that can run any type of application and can be programmed in infinite ways. So although a pocket calculator is certainly a computer in the strictest sense, it's not the type of computer that \"PC\" refers to.\nUnder this broad umbrella, a smartphone certainly counts as a PC. There's no fundamental difference between it and a typical laptop computer. However, there is an argument that an Android tablet is a personal computer while an iPad isn't.\nWhy? Because on an iPad, you don't have the freedom to run any software you like, only software approved by Apple. On an Android tablet, you can install whatever you like. Although Apple advertises modern iPads as personal computers, they blur the line between a personal computer and a computer appliance, albeit due to an artificial limitation.\nUndoubtedly, every Mac, Linux, or Windows system is certainly a personal computer in the broad sense. Still, most people wouldn't think to refer to an Android smartphone as a PC despite it neatly fitting the broad meaning of the word.\nThe IBM PC\nSome confusion around the term \"PC\" is thanks to the IBM PC. In 1981 IBM released the Model 5150, which was just another microcomputer. \"Microcomputer\" is a term that refers to small computers you can use on a desk. Other contemporary microcomputers included the Commodore 64, ZX Spectrum, and BBC Micro.\nIBM pushed the term \"PC\" to set the IBM PC apart from other microcomputers and larger business machines in its own product line. IBM's design was cloned, creating a massive open market. While IBM may not have been thrilled at the time to have so-called \"IBM-compatible\" computers flood the market, this is why a PC is called a PC today as opposed to all the other names used for computers suitable for personal use.\nThe \"PC\" in \"Gaming PC\"\nPeople refer to \"PC Gaming\" in the context of the IBM PC and its legacy. Every gaming PC can trace its family tree in a straight line back to the first IBM PCs. They all use \"x86\" CPU architecture. In other words, the same processor \"language\" that sits at the core of the IBM PC still sits at the core of modern gaming PCs.\nWhen a game developer says it's releasing a game \"for PC,\" it always means releasing it for an x86 computer. It almost always means the software is meant for Microsoft Windows, but it's important to remember that \"PC\" in this case refers to the hardware architecture, not the operating system. Linux, Windows, and myriad other x86 operating systems are all PC operating systems.\nThe \"PC\" in \"Mac Vs. PC\"\nWhen Apple or Apple users talk about \"Mac vs. PC,\" it refers to the differences between Macs and IBM PCs. Apple Mac computers competed directly with all other microcomputers, including IBM PCs, and had a distinct architecture.\nThe first Macs used Motorola 68000 CPUs, then switched to IBM PowerPC, which in a somewhat ironic twist, is another IBM architecture that's entirely different from IBM PC x86 architecture.\nFollowing PowerPC, Apple switched to Intel CPUs and the x86 architecture. Suddenly the \"Mac Vs. PC\" debate didn't make much sense anymore. In a practical sense, Macs were PCs and you could install Windows and run all the same apps as any PC.\nHowever, Intel Macs still didn't have the open hardware support of typical PCs, with Apple's Mac firmware being substantially different from standard PC firmware. We're comfortable including Intel Macs in the PC family, but there will always be some debate about whether Intel Macs are truly PCs.\nThe point is somewhat moot now, though, since Apple left Intel behind for its own Apple Silicon hardware, based on the ARM architecture. Apple Silicon Macs are definitely not PCs in the IBM-compatible sense!\nWhat About x86 Gaming Consoles?\nAnother interesting wrinkle to the question of what a \"PC\" really is comes from modern gaming consoles. Microsoft and Sony moved to x86-based consoles with the Xbox One and PlayStation 4. To be fair, the first Xbox was an x86 system, so the Xbox One was a return to form for Microsoft's consoles rather than a radical shift.\nThe Xbox Series and PlayStation 5 consoles retained this change to x86 hardware, so these devices are customized PCs. The core architecture and hardware are no different from what you'd find in a typical laptop or desktop PC. In the case of Xbox's consoles, even the software is essentially Microsoft Windows. So why are these \"consoles\" and not \"PCs\"?\nIt's true that the core architecture of these devices is PC architecture, but the firmware is locked down, and these systems contain proprietary hardware components for security and performance reasons. They are different in many ways, whether you think of them as \"consolized\" PCs or PC-derivatives. You can't install whatever software or operating system you want or install drivers for hardware not approved by the console maker.\nConsoles can be considered PCs in terms of their hardware architecture, but they certainly don't count as PCs broadly, having more in common with computer appliances such as iPads.\nIt Has Nothing to Do With Form Factor\nWhether something is a PC or not, whether in the broad sense or in the hardware architecture sense, has nothing to do with form factors. An x86 laptops and an x86 desktop computer are both PCs. They have the same hardware architecture, run the same software, and conform to open industry standards.\nThis is why a handheld computer like the Steam Deck is a PC, but a console like the Nintendo Switch is not. The Steam Deck is an x86 IBM-compatible, open-platform personal computer. Anything you can do with a big gaming PC desktop, or a gaming laptop, you can do with a device like the Steam Deck, Aya Neo, or GPD Win computers.\nWhile the meaning of words can and do change over time, for now, when someone says \"PC\" they probably mean a computer that can call a 1981 IBM PC its ancestor."
    }
  ],
  "argos_summary": "The article traces the decline of desktop PCs as laptops, tablets, and mobile devices become the dominant personal computing platforms, driven by portability, convenience, and the rise of AI and cloud gaming. Desktop sales are shrinking, with laptops overtaking them globally for the first time in Q3 2023 and continuing to grow, while niche segments like gaming desktops and mini PCs retain a loyal base. Market forecasts project modest PC growth into 2025, but anticipate a gradual slowdown as Windows 11 adoption stabilizes and AI-enabled PCs face budget constraints. The piece also highlights the impact of U.S. tariffs, AI PC adoption, and commercial demand on future PC volumes.",
  "argos_id": "JUFS3BECF"
}