{
  "url": "https://www.businessinsider.com/taco-bell-cmo-key-brand-success-listening-reading-youtube-comments-2025-8",
  "authorsByline": "Katherine Tangalakis-Lippert",
  "articleId": "2a148dbd65ea451d88efcd6ede50772d",
  "source": {
    "domain": "businessinsider.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://i.insider.com/68b26af0194a2d49b8af7f8f?width=1200&format=jpeg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-30T22:08:20+00:00",
  "addDate": "2025-08-30T22:12:10.382956+00:00",
  "refreshDate": "2025-08-30T22:12:10.382957+00:00",
  "score": 1.0,
  "title": "Taco Bell's CMO breaks down the secret to ensuring a brand's success with its fans",
  "description": "Taco Bell CMO Taylor Montgomery sat down with Business Insider to discuss why major brands misstep with fans — and how to avoid it.",
  "content": "Taco Bell Chief Marketing Officer Taylor Montgomery believes if brands misstep with their fans, they probably aren't listening very well.Surrounded by diehard fans who drove from all over Southern California to converge upon Taco Bell's Decades Y2K launch event on Thursday night in West Hollywood, Montgomery — dressed in an outfit plucked from the early aughts — reveled in the raucous support that stemmed from being \"brave enough to hand the brand over to our fans and see what they do.\"The event, held at West Hollywood's Zouk nightclub and celebrating Crunchwrap's 20th birthday, was filled with taco zealots clad in early 2000s fashion — chokers, cheetah print, and all. They spent the night sampling re-released menu items like Cool Ranch Doritos Locos Tacos and caramel apple empanadas, drinking Baja Blast-infused cocktails, and jamming to DJ sets featuring Missy Elliot hits in addition to a live performance from Grammy Award-winning rapper Lil Jon.The reverberating enthusiasm surrounding Taco Bell's launch party stood in stark contrast to other restaurant news this week, namely that of Cracker Barrel, the classic southern comfort restaurant, which found itself in hot salsa after the rollout of a modernized logo left fans and President Donald Trump calling for a course correction or a boycott.\"Just listen to your consumer,\" Montgomery said, speaking generally about the recent news cycle. \"Listen to your consumer and at the same time, be really true to who you are. I think that's the balance that the most iconic brands need, and you can do both of those things at the same time.\"Still, he added, \"There's a difference between listening and hearing. These are two very different things.\"For decades, Taco Bell has enjoyed a cultlike popularity among its most fervent fans. Dedicated fan accounts on social media track every product release and cross-brand collaboration. One of the major brands of the Yum! portfolio, Taco Bell has meaningfully outpaced other restaurants in the quick-service sector throughout 2024 and into this year, even as inflation concerns have mounted and consumer spending has slowed. Earnings reports show that while many fast-food chains have reported sluggish sales, Taco Bell's same-store sales have been resilient year over year.Montgomery, now in his fourth year of leading the company's branding, credits that success to having a team that \"does the best job in the entire industry, maybe in the entire world,\" to really understand what its consumers are saying. Still, he said he applies a \"secret\" strategy to ensure Taco Bell is capturing all the insight it can.\"There are three different ways that you should be in touch with your consumer,\" Montgomery said.The first is \"what everybody else\" in the industry gets: the market research. That data is valuable and should act as a guideline, but it doesn't paint a complete picture.\"The second piece is to really understand what consumers are saying about you on social every single day,\" Montgomery said. \"And it's not just the loudest parts, but who are your real fans?\"That may mean a small but persistent YouTube channel consistently reviewing products or commenting on the brand's posts. To know who is most valuable to your brand, and is part of the core audience you serve, you've got to meet them where they're at — usually online.\"I will go and read every single comment,\" Montgomery said. \"You've got to read every single comment, look at all of the posts.\"When you're a brand as big as Taco Bell, Montgomery said, you can't just limit yourself to social media feedback. You've also got to see how people experience the brand in real time.\"The third thing is — our category is so ingrained in culture — everything's a focus group,\" Montgomery said. \"So when I take my little girls to dance practice, I'll ask all the parents, 'Hey, what did you think about that thing that we launched?' If you're really listening, all the insights you want are right there.\"When a brand thinks it's doing all those things but its leadership isn't doing them authentically, missteps are bound to happen — that's the difference between listening and hearing, Montgomery said.\"You can listen to what consumers are saying, but if you're really internalizing and hearing deeply what consumers are asking for, what they really love and appreciate about your brand, and you stay really true to that, most times, you're gonna get it right,\" he said.Judging by the dance floor, where fans decked out in butterfly clips and puka shells partied like it was 2002 to celebrate the Crunchwrap's birthday, Montgomery — and Taco Bell — are getting it right.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Taco Bell",
      "weight": 0.09221268
    },
    {
      "name": "Taco Bell Chief Marketing Officer Taylor Montgomery",
      "weight": 0.08596651
    },
    {
      "name": "brands",
      "weight": 0.072232276
    },
    {
      "name": "Taylor Montgomery",
      "weight": 0.0690805
    },
    {
      "name": "Montgomery",
      "weight": 0.068368785
    },
    {
      "name": "diehard fans",
      "weight": 0.062799715
    },
    {
      "name": "fans",
      "weight": 0.062475182
    },
    {
      "name": "Dedicated fan accounts",
      "weight": 0.0610377
    },
    {
      "name": "other restaurant news",
      "weight": 0.057647757
    },
    {
      "name": "Taco Bells Decades Y2K launch event",
      "weight": 0.057199378
    }
  ],
  "topics": [
    {
      "name": "Business Leaders"
    }
  ],
  "categories": [
    {
      "name": "Business"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.9580078125
    },
    {
      "name": "/Food & Drink/Beverages/Alcoholic Beverages",
      "score": 0.374267578125
    },
    {
      "name": "/Business & Industrial/Advertising & Marketing/Other",
      "score": 0.36083984375
    },
    {
      "name": "/Food & Drink/Restaurants/Other",
      "score": 0.318115234375
    }
  ],
  "sentiment": {
    "positive": 0.38511807,
    "negative": 0.25896668,
    "neutral": 0.35591522
  },
  "summary": "Taco Bell's Chief Marketing Officer, Taylor Montgomery, has shared his secret strategy to ensure a brand's success with its fans, stating that brands who misstep with their fans often aren't listening well. He recommends listening to their consumer and staying true to who you are, but also understanding what consumers are saying about you on social media. Despite recent controversies surrounding Cracker Barrel's recent logo update, Montgomery credits his strategy to having a team that understands what its consumer is saying. He also recommends a persistent YouTube channel reviewing products or commenting on the brand's posts. Despite inflation concerns and consumer spending slowing, Taco Bell's same-store sales have remained steady year over year.",
  "shortSummary": "Taco Bell's CMO Taylor Montgomery emphasizes the importance of listening to fans and staying true to the brand, despite recent industry controversies.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "630b058a78f6481baddb04263acf933c",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Taco Bell’s chief marketing officer Taylor Montgomery highlighted the importance of listening to fans, citing a recent Decades Y2K launch event that drew diehard fans to celebrate Crunchwrap’s 20th birthday. The event, held at West Hollywood’s Zouk nightclub, showcased re‑released menu items and live performances, underscoring the brand’s cult‑like popularity. Montgomery stressed that true listening goes beyond market research to include social media chatter and real‑world feedback, arguing that brands must stay authentic to avoid missteps. He noted Taco Bell’s resilient same‑store sales amid inflationary pressures, attributing success to a deep understanding of its core audience. The article contrasts Taco Bell’s fan‑centric approach with Cracker Barrel’s logo rollout backlash, emphasizing the need for brands to balance consumer input with brand identity.",
  "argos_id": "KGPDWP1IM"
}