{
  "url": "https://www.foxnews.com/entertainment/happy-days-star-henry-winkler-insists-one-thing-hasnt-changed-after-decades-hollywood",
  "authorsByline": "Stephanie Giang-Paunon, Larry Fink",
  "articleId": "3f271dd889ba494bbf9f600674882a20",
  "source": {
    "domain": "foxnews.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/07/931/523/Getty_HenryWinkler.jpg?ve=1&tl=1",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-31T11:30:52-04:00",
  "addDate": "2025-08-31T15:40:46.760837+00:00",
  "refreshDate": "2025-08-31T15:40:46.760839+00:00",
  "score": 1.0,
  "title": "'Happy Days' star Henry Winkler insists one thing hasn't changed after decades in Hollywood",
  "description": "Emmy-winning actor Henry Winkler shares how fame hasn't changed his perspective on family, gratitude and human connections after a 50-year career.",
  "content": "Henry Winkler has been in Hollywood for more than five decades, and there’s one thing stardom hasn’t touched — his grounded perspective on life.While he's earned fame, awards and the admiration of generations, the \"Happy Days\" star opened up about what still matters most to him — regardless of the spotlight. When Fox News Digital asked the 79-year-old actor what fame hasn’t changed, he replied, \"The way that I view the world, the way that I view my family and our puppies, the way that I view the human beings I meet all over the world.\"HENRY WINKLER CONFESSES THE SIMPLE SECRET TO HIS FIVE DECADES OF SUCCESSFUL PARENTINGThe Emmy-winning actor was among several celebrities honored at the 27th Television Academy Hall of Fame event in Los Angeles. He joined an exclusive group that included actress Viola Davis and director Ryan Murphy.Despite decades of success, Winkler expressed gratitude and shared what continues to drive him in Hollywood. \"I love getting up in the morning. I love being alive. I love that I'm still at the table,\" he said.Winkler has taken on prominent roles across generations of Hollywood, from \"Happy Days\" to \"Barry\" and, most recently, \"Hazardous History.\"When Fox News Digital asked which role had the greatest impact on Winkler, he replied, \"I don't know. I got the Fonz when I was 27, I got Barry when I [was] 72 and now … ‘Hazardous History.’\"Winkler doesn’t show signs of slowing down and revealed how he’d like to be remembered in Hollywood after his decades-long career — as \"a good human being.\"When it comes to acting advice, Winkler told Fox News Digital there are two key factors. 'HAPPY DAYS' STAR HENRY WINKLER TOOK MARLEE MATLIN IN AFTER DIFFICULT RELATIONSHIP WITH WILLIAM HURT\"One is, you must be tenacious. You must really eat and sleep and breathe you want to be in this industry.\"But it's not just about drive — it's about being present. WATCH: HENRY WINKLER DISHES ON THE ONE THING FAME HASN’T CHANGED ABOUT HIM\"The ear is the center of all things,\" he said. \"Listening — listening to the creators, listening to yourself and listening to your fellow actors.\"However, it hasn’t been all glitz and glamor for Winkler.CLICK HERE TO SIGN UP FOR THE ENTERTAINMENT NEWSLETTERWhile the \"Hazardous History\" host spoke about the wildest hazard he ever faced on set, he recalled a moment that could’ve turned fatal while working on \"Happy Days.\"\"We're on the set of ‘Happy Days,’ 50 years ago, and the phone all of a sudden rings… It is a police officer somewhere in the Midwest. There is a young man who's 17 years old who is on the ledge wanting to jump, but before he jumps he wants to talk to me,\" Winkler recalled to Fox News Digital on the Televerse red carpet.WATCH: ‘HAZARDOUS HISTORY’ HOST HENRY WINKLER SHARES THE WILDEST HAZARD HE EVER FACED ON SET \"Where I got the nerve to talk to this guy, I don't know. But I said to him, the first thing that came to my mind: ‘Do you have a record collection?’ He said, ‘I do.’ I said, ‘Look, just go inside and write on a piece of paper that you're going to sign your record collection over to me.’ And then when he got inside, they stopped him from jumping.\"HARRISON FORD ADMITS WHAT KEEPS HIM GOING IN HOLLYWOODAfter decades in the spotlight, Winkler said kindness has carried him a long way in Hollywood despite the challenges he’s faced.\"Kindness has never been a disadvantage. Also, I don't think of myself as a nice guy. I think of myself as a grateful guy,\" he said. \"My gratitude allows the journey — with all the bumps and the bruises and all of the success — to equal out.\"As for meeting his idols, Winkler recalled the moment he met fellow Hollywood actor Robert De Niro. LIKE WHAT YOU’RE READING? CLICK HERE FOR MORE ENTERTAINMENT NEWS\"Ron Howard and I are walking down the street, Robert De Niro is standing in the doorway… I said, ‘I'm really a fan, and I must say to you that the first movie I ever saw in Hollywood was ‘Mean Streets.’ And you used the word ‘f---’ better than anybody on the planet.’\"He continued, \"Cut to 40 years later, he's in ‘The Intern,’ we’re at the party. I walked up to him. I said, ‘Look, I've got to do what everybody does. I need to take a selfie.’ He turned to me, and he said, ‘You said I used the word ‘f---’ better than anybody on the planet.’ I dropped and smashed the phone.\"Winkler turned Arthur \"Fonzie\" Fonzarelli from a supporting role on \"Happy Days\" into a breakout star and cultural icon. Decades later, he reflected on the journey that took him from fan favorite to Hall of Famer.\"I dreamt maybe I would win an award,\" Winkler said during the event. \"I never dreamt Hall of Fame. Unbelievable. I am living my dream, and what I am the most proud of is … that I am still at the table.\"",
  "medium": "Article",
  "links": [
    "https://www.foxnews.com/entertainment/happy-days-stars-first-public-reunion-over-50-years",
    "https://www.foxnews.com/newsletters",
    "https://www.foxnews.com/entertainment",
    "https://www.foxnews.com/video/6377091142112",
    "https://www.foxnews.com/video/6377207021112",
    "https://www.foxnews.com/apps-products?pid=AppArticleLink",
    "https://www.foxnews.com/category/person/robert-deniro",
    "https://www.foxnews.com/entertainment/harrison-ford-admits-what-keeps-him-going-hollywood",
    "https://www.foxnews.com/category/entertainment/events/emmys",
    "https://www.foxnews.com/entertainment/happy-days-star-henry-winkler-took-marlee-matlin-after-difficult-relationship-william-hurt",
    "https://www.foxnews.com/entertainment/henry-winkler-confesses-simple-secret-his-five-decades-successful-parenting"
  ],
  "labels": [
    {
      "name": "Pop Culture"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "fellow Hollywood actor Robert De Niro",
      "weight": 0.07675774
    },
    {
      "name": "Happy Days",
      "weight": 0.0755795
    },
    {
      "name": "Henry Winkler",
      "weight": 0.0718129
    },
    {
      "name": "Fox News Digital",
      "weight": 0.069594
    },
    {
      "name": "Winkler",
      "weight": 0.06894498
    },
    {
      "name": "Hollywood",
      "weight": 0.06528368
    },
    {
      "name": "HENRY WINKLER",
      "weight": 0.060858626
    },
    {
      "name": "decades",
      "weight": 0.05924391
    },
    {
      "name": "Robert De Niro",
      "weight": 0.055676095
    },
    {
      "name": "actress Viola Davis",
      "weight": 0.052693646
    }
  ],
  "topics": [
    {
      "name": "Celebrities"
    }
  ],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.998046875
    },
    {
      "name": "/News/Gossip & Tabloid News/Other",
      "score": 0.751953125
    },
    {
      "name": "/Arts & Entertainment/Movies/Other",
      "score": 0.73779296875
    },
    {
      "name": "/Arts & Entertainment/TV & Video/TV Shows & Programs",
      "score": 0.6796875
    }
  ],
  "sentiment": {
    "positive": 0.3065358,
    "negative": 0.30123135,
    "neutral": 0.3922328
  },
  "summary": "Henry Winkler, the 79-year-old actor known for his grounded perspective on life in Hollywood, has been in Hollywood for over five decades. Despite earning awards and admiration, Winkler remains grounded and focused on his everyday experiences. He was among several celebrities honored at the 27th Television Academy Hall of Fame event in Los Angeles. Despite his success, Winklers expressed gratitude and shared his love for life and his desire to be remembered as a \"good human being.\" He also shared his key acting advice: tenacious, present, and kindness.",
  "shortSummary": "Henry Winkler, after decades in Hollywood, emphasizes that fame and kindness remain his driving force, emphasizing his commitment to life and work.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "a792ff0e18fb4abbad08fc96872e5654",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.foxnews.com/category/person/robert-deniro",
      "text": "Robert De Niro March 25 Robert De Niro admits he’s out of touch with young daughter’s Gen Z slang Hollywood actor Robert De Niro admitted his daughter requested he read a list of teenage slang he was unfamiliar with and shared her reaction.\nRobert De Niro February 1 Robert De Niro was ‘smitten’ with Whitney Houston, but told to ‘stop making a fool’ of himself: author Whitney Houston passed away in 2012 at age 48. Her former bodyguard, David Roberts, has written a book about working with the singer, \"Protecting Whitney: The Memoir of Her Bodyguard.\"\nPhiladelphia Eagles November 3 Robert De Niro stumps for Harris at Eagles tailgate as presidential race comes down to wire Actor Robert De Niro stumped for Vice President Kamala Harris at a Philadelphia Eagles tailgate at Lincoln Financial Field on Sunday afternoon.\nMedia September 24 Robert De Niro and Spike Lee are worried about Trump’s continued chances for victory: ‘Very, very close' Actors Robert De Niro and Spike Lee voiced their concerns about the upcoming election while hosting a Q&A at the premiere of Francis Ford Coppola‘s latest film, “Megalopolis.\"\nPOLITICS September 13 'Paisans for Kamala' event features De Niro, Pelosi blasting Trump on immigration Italian-American Democrats and celebrities headlined a three-hour virtual dinner this week in support of Vice President Kamala Harris’ presidential bid.\nMedia June 4, 2024 Robert De Niro defends controversial press conference outside NY Trump trial: 'I had to do something' Actor Robert De Niro told \"TODAY\" on Tuesday that he felt he \"had\" to speak out against former President Trump during a press conference near Trump's hush money trial.\nMedia May 31, 2024 Robert De Niro reportedly loses prestigious award over anti-Trump outburst: 'This event is proudly bipartisan' Robert De Niro will no longer receive a National Association of Broadcasters (NAB) award after he unleashed an anti-Trump tirade outside the former president’s Manhattan trial this week.\nDonald Trump May 31, 2024 De Niro says Trump guilty verdict means 'justice was served' Actor Robert De Niro said \"justice was served\" when former President Trump was found guilty on Thursday in his New York criminal trial.\nDonald Trump May 29, 2024 Trump mocks 'wacko' De Niro in late-night rant after actor's chaotic presser Former President Trump tore into actor Robert De Niro, who claimed Tuesday that Trump \"wants to destroy\" New York City and the nation and eventually could destroy the entire world.\nGutfeld! May 28, 2024 Charlamagne tha God says he agrees with Robert De Niro: I also suffer from 'Trump Derangement Syndrome' \"The Breakfast Club\" co-host\" Charlamagne Tha God said he was in lockstep with liberal anti-Trump actor Robert De Niro during his appearance on Fox News' \"Gutfeld!\" Tuesday night.\nMedia May 28, 2024 De Niro's chaotic Biden campaign conference garners mockery on social media: 'Disaster for Democrats' Actor Robert De Niro's press conference in support of President Biden outside the NYC courthouse where Trump is on trial was panned on social media by the right.\nMedia May 14, 2024 Robert De Niro warns on 'The View' that Trump could return to power like Hitler or Mussolini Actor Robert De Niro slammed former President Trump in a guest appearance on ABC's \"The View,\" comparing him to some of history's most infamous authoritarian rulers.\nRobert De Niro March 9, 2024 Robert De Niro blasts 'sociopathic' Trump, says he'd never play him in a movie: There's 'nothing redeemable' Two-time Oscar winner Robert De Niro tore into former President Trump, insisting he'd never play him in a movie during an interview on \"Real Time with Bill Maher.\"\nRobert De Niro February 7, 2024 Robert De Niro says grandson's fentanyl overdose 'shouldn't have happened' Robert De Niro wondered if he could have \"made a difference\" for his late grandson Leandro De Niro Rodriguez who died of a fentanyl overdose last summer.\nENTERTAINMENT January 20, 2024 'Killers of the Flower Moon' star blasts 'Yellowstone' as 'deplorable' but auditioned for show 'several times' \"Killers of the Flower Moon\" star Lily Gladstone slammed \"Yellowstone\" as \"deplorable\" and \"despicable\" despite previously auditioning for the hit series.\nMarriage January 13, 2024 Jennifer Lawrence told Robert De Niro to 'go home' during wedding rehearsal Stars reflect on major mishaps that occurred on their big wedding day, including Jennifer Lawrence telling Robert De Niro to leave during rehearsal.\nRobert De Niro November 12, 2023 Top 5 moments from Robert De Niro's explosive trial Robert De Niro's production company was ordered to pay his former assistant roughly $1.2 million following a nearly two-week trial. De Niro had been accused of gender discrimination.\nIn Court November 9, 2023 Robert De Niro's production company found liable in gender discrimination lawsuit, ordered to pay $1.2M The jury in Robert De Niro's gender discrimination trial reached a verdict Thursday. Canal Productions was found liable of gender discrimination and retaliation.\nRobert De Niro November 9, 2023 Robert De Niro worked out for up to 7 hours at a time: personal trainer testifies Robert De Niro's personal trainer detailed the actor's work out regimen while testifying in the gender discrimination lawsuit. Daniel Harvey took the stand Thursday.\nRobert De Niro November 7, 2023 Plaintiff in Robert De Niro harassment lawsuit gets intimidating text from his family: lawyer Robert De Niro's daughter reportedly sent his former assistant, who is accusing him of gender discrimination and harassment, an intimidating text amid the ongoing trial.\nRobert De Niro November 4, 2023 Robert De Niro's ex-top assistant slams actor for abusive behavior with 'creepy' back-scratching requests Robert De Niro's former assistant Graham Chase Robinson has alleged the actor repeatedly made inappropriate requests and showed abusive behavior.\nRobert De Niro November 2, 2023 Robert De Niro's girlfriend blasts former assistant as 'mean-spirited' and a 'hot mess' during testimony Robert De Niro's girlfriend Tiffany Chen slammed his former assistant Graham Chase Robinson while testifying in court during the actor's civil trial on Thursday.\nIn Court November 2, 2023 Robert De Niro's baby mama emerges as key figure in explosive employee discrimination suit Robert De Niro's girlfriend, Tiffany Chen, has emerged as a key player in the actor's gender discrimination lawsuit brought by his ex-assistant, Graham Chase Robinson.\nIn Court October 31, 2023 Robert De Niro admits he 'berated' ex-assistant, called her 'f---ing spoiled brat' during court testimony Robert De Niro admitted to berating his former assistant during court testimony on Tuesday. The actor was sued by Graham Chase Robinson for gender discrimination in 2019.\nIn Court October 30, 2023 Robert De Niro testifies discrimination lawsuit 'is all nonsense' Robert De Niro took the stand in his legal battle with former employee Graham Chase Robinson. The actor was sued for gender discrimination in 2019.\nENTERTAINMENT October 23, 2023 Leonardo DiCaprio wanted villain role in 'Killers of the Flower Moon’ despite concerns from studio Leonardo DiCaprio wanted to play the less than ethical character in Martin Scorsese's new movie, \"Killers of the Flower Moon,\" which also stars Robert De Niro.\nENTERTAINMENT October 18, 2023 Robert De Niro relies on Tiffany Chen to take care of their infant daughter: 'I don't do the heavy lifting' Robert De Niro became a new father again right before his 80th birthday, and the actor is admitting that his girlfriend Tiffany Chen is responsible for the \"heavy lifting.\"\nENTERTAINMENT August 18, 2023 Robert De Niro hosts star-studded 80th birthday party as Hollywood hides amid SAG-AFTRA strike Robert De Niro was joined by Alec Baldwin, Andrew Cuomo, Paul McCartney and more as he celebrated his 80th birthday in New York City on Thursday.\nENTERTAINMENT August 12, 2023 Robert De Niro's daughter shares birthday message for son 1 month after his death: 'Hope you are at peace' Robert De Niro's daughter on Friday marked what would have been her late son's 20th birthday with an Instagram post, calling him her \"little angel\" and sharing several photos of him.\nENTERTAINMENT August 10, 2023 Robert De Niro's daughter condemns 'tabloid fodder' surrounding son's fentanyl overdose Robert De Niro's daughter Drena is speaking out after it was confirmed her son Leandro died in July from an accidental fentanyl overdose"
    },
    {
      "url": "https://www.foxnews.com/video/6377091142112",
      "text": "Live Now\nAll times easternNOW - 9:00 PM\n9:00 PM\n9:30 PM\n10:00 PM\n10:30 PM\n11:00 PM\nFox News Channel\nMy View with Lara Trump\n9:00 PM - 10:00 PM\nFOX News Saturday Night with Jimmy Failla\n10:00 PM - 11:00 PM\nGutfeld!\n11:00 PM - 11:30 PM\nFox Business Channel\nAmerican Dream Home\n9:00 PM - 9:30 PM\nAmerican Dream Home\n9:30 PM - 10:00 PM\nAmerican Dream Home\n10:00 PM - 10:30 PM\nAmerican Dream Home\n10:30 PM - 11:00 PM\nAmerican Dream Home\n11:00 PM - 11:30 PM\nFox Weather Channel\nFox News Radio\nFox News Channel Live"
    },
    {
      "url": "https://www.foxnews.com/entertainment/henry-winkler-confesses-simple-secret-his-five-decades-successful-parenting",
      "text": "Henry Winkler is sharing wisdom he's gained from five decades of parenting.\nThe \"Happy Days\" star appeared on the \"Today\" show this week, where he was shown a surprise Father's Day video message from his children that he admitted left him feeling \"so emotional.\"\nIn the video, his daughter Zoe, 45, said, \"The way you were raised and in the household you came from, where you weren’t allowed to be yourself and you weren’t allowed to question or speak your mind. You did the exact opposite, and you raised us in the most loving home where we could be ourselves.\"\n‘HAPPY DAYS’ STAR HENRY WINKLER TOOK MARLEE MATLIN IN AFTER DIFFICULT RELATIONSHIP WITH WILLIAM HURT\n\"Fifty years of incredible memories, which is unbelievable,\" Jed, Winkler's wife's son from a previous marriage, noted, while son Max, 41, said, \"I wish you the happiest, happiest Father's Day, and I love you so much.\"\nWhen the video finished playing, Winkler was seen tearing up as he profusely thanked the team who put the clips of his children together.\nLIKE WHAT YOU’RE READING? CLICK HERE FOR MORE ENTERTAINMENT NEWS\n\"Today\" host Jenna Bush Hager, who was so touched that she began crying herself, asked him, \"What did you do to raise such beautiful children?\"\n\"I'm going to tell you now, I think that the center of all relationships … is the ear,\" he answered. \"It is not how you meant it, it is how it landed. It's how it's heard.\"\nHe continued, \"And I was never able to say anything. I never had a point of view growing up … and my children could say what was on their mind.\"\nWinkler has spoken in the past about the difficulties he faced growing up. His parents, two Jewish immigrants who had fled Nazi Germany for New York City, were very hard on him.\nAs he explained last year on the \"How To Fail\" podcast with host Elizabeth Day, he doesn't think \"strict\" was the proper term to describe them – he said that he was a strict parent himself, but his own parents \"did not see me … my parents did not acknowledge who I was as a human being.\"\nCLICK HERE TO SIGN UP FOR THE ENTERTAINMENT NEWSLETTER\nHe acknowledged that they \"went through a trauma,\" but said \"They literally saw me as an extension to making them grander. I had to do well. If I didn't do well, I embarrassed them. That is a tragedy, it is one of the no-nos of being a parent – you have to see the child in front of you, you have to hear the child in front of you … if you see your child is having a problem, it is your job to make sure you don't let that child's self-image plummet to the bottom of the ocean.\"\nWATCH: HENRY WINKLER SAYS DAUGHTER ‘USED ME LIKE A GARDEN TOOL’ GROWING UP\nAlthough he didn't have a name for it until he was an adult, Winkler struggled with dyslexia throughout his childhood, and he continues to struggle with it. In 2020, he told Howard Stern that his parents called him the German word for \"dumb dog.\"\nWhen he became a father, he admitted, \"I didn't know if I could be a parent, I just knew that I was duty-bound, and I was going to get this right. Of course, you know you never get it right … you try.\""
    },
    {
      "url": "https://www.foxnews.com/category/entertainment/events/emmys",
      "text": "Entertainment August 16 Harrison Ford admits what keeps him going in Hollywood Hollywood legend Harrison Ford shares what drives his passion after five decades in the industry following his Emmy nomination for \"Shrinking.\"\nStephen Colbert July 22 Trump may have 'just handed an Emmy' to Stephen Colbert, industry reporter says Stephen Colbert's feud with Trump following CBS' cancellation of \"The Late Show\" could finally earn his show its first Emmy, a Hollywood Reporter editor suggested.\nMedia May 2 CBS shouldn't celebrate Emmy nom for Harris interview that ignited network turmoil, industry insider says Emmy nomination for CBS News' Kamala Harris interview draws scrutiny amid Trump's massive lawsuit claiming the edited segment interfered with the presidential election.\nLIFESTYLE October 23 On this day in history, October 23, 1925, late-night TV star and host Johnny Carson is born Johnny Carson, born in Iowa on this day in history, Oct. 23, 1925, went on to become the iconic and Emmy Award-winning host of \"The Tonight Show.\" Here's his story.\nMedia September 16 Candice Bergen takes jab at JD Vance during 2024 Emmys using 'Murphy Brown' reference Actress Candice Bergen took a jab at Republican JD Vance for his comments about \"childless cat ladies\" during the 2024 Emmy Awards.\nMedia September 16 John Leguizamo delivers speech in defense of DEI at Emmys Actor John Leguizamo spoke out in favor of Diversity, Equity and Inclusion policies at the Emmys on Sunday night, saying he was a proud member of \"Hollywood's DEI hires.\"\nEmmys September 16 Emmys fans furious over ‘The Shining’ star Shelley Duvall's omission from In Memoriam tribute: ‘Shame on you’ Following the 76th Annual Emmy Awards, fans voiced their disdain for the omission of actress Shelley Duvall from the In Memoriam segment of the show.\nENTERTAINMENT September 15 Emmys 2024: Complete winners list The 76th Annual Emmy Awards aired live from the Peacock Theater in Los Angeles. \"Schitt's Creek\" co-stars and father-son duo, Dan and Eugene Levy, hosted the award show on Sunday night.\nENTERTAINMENT September 15 'Happy Days' stars Henry Winkler and Ron Howard reunite at 2024 Emmy Awards \"Happy Days\" stars Ron Howard and Henry Winkler reunited on the Emmy Awards' stage on Sunday night.\nEmmys September 15 2024 Emmy Awards red carpet Television's biggest stars stepped up their fashion game on the red carpet at the 2024 Emmy Awards, including Selena Gomez, Jennifer Aniston and Sofia Vergara.\nEmmys September 15 Emmy nominee Sofia Vergara's painful connection to drug lord 'Griselda' role Sofia Vergara earned an Emmy Award nomination for her portrayal of Griselda Blanco in \"Griselda.\" The actress recently opened up about playing a drug lord after her own brother was murdered by a cartel.\nEmmys September 14 Everything you need to know about the 2024 Emmy Awards The Emmy Awards are just around the corner. Here is everything you need to know, including who's hosting and why there are two Emmy ceremonies in 2024.\nLIFESTYLE August 13, 2024 On this day in history, August 13, 2004, iconic American chef Julia Child dies Julia Child taught Americans how to cook — hosting TV programs, writing cookbooks and promoting traditional French cuisine. On this day in history, Aug. 13, 2004, she passed away at age 94.\nReese Witherspoon March 22, 2024 Reese Witherspoon's roles in blockbuster movies, hit TV shows, from 'Legally Blonde' to 'Big Little Lies' Reese Witherspoon has found massive success in the entertainment industry. The Oscar-winning actress has taken on roles across genres in both television and film.\nENTERTAINMENT February 3, 2024 Ted Danson throws more cold water on hopes for 'Cheers' reunion: 'I think it'd be a little sad' Ted Danson shared his doubts about the likeliness of a \"Cheers\" reunion in an interview with Fox News Digital.\nCulture January 16, 2024 'The Crown' actor poses with message on palm in call for Gaza ceasefire on Emmys red carpet \"The Crown\" actor Khalid Abdalla offered another message calling for a ceasefire at the 75th Emmys as war rages on between Israel and Hamas in the Middle East.\nEmmys January 16, 2024 Elton John earns Emmy, becoming one of 19 EGOT winners Elton John won an Emmy for best variety special (live) for \"Elton John Live: Farewell from Dodger Stadium,\" making him one of 19 people to have won an Emmy, Grammy, Oscar, and Tony.\nENTERTAINMENT January 16, 2024 Katherine Heigl returns to Emmys after 10 years, excited to dress up after living 'in sweatpants' on Utah farm Katherine Heigl reunited with some of her \"Grey's Anatomy\" co-stars at the 2024 Emmy Awards. Members of \"Martin\" and \"Cheers\" also reunited on Monday night.\nENTERTAINMENT January 15, 2024 2024 Emmys: Complete winners list The 75th annual Primetime Emmy Awards have arrived. Anthony Anderson hosted the award show live from the Peacock Theater in Los Angeles, California.\nENTERTAINMENT January 15, 2024 75th Emmy Awards red carpet: PHOTOS See the stars as they walk the red carpet at the 75th Emmy Awards in Los Angeles, California.\nExclusive January 15, 2024 Emmys host Anthony Anderson weighs in on Jo Koy's rocky Golden Globes performance: 'You can't please everyone' Emmys host Anthony Anderson shared his thoughts on Jo Koy's hosting performance at the Golden Globes last week.\nENTERTAINMENT January 14, 2024 Taylor Swift trolled by Jo Koy, Heidi Klum falls, Will Smith slap lead wildest award show fails ahead of Emmys From Will Smith slapping Chris Rock to Kanye West crashing Taylor Swift's acceptance speech, Fox News Digital takes a look at some of the wildest moments in award show history.\nEmmys January 12, 2024 Moon landing tops Academy's '75 Most Impactful' TV Moments list ahead of milestone Emmys The Television Academy ranked the \"75 Most Impactful\" moments broadcast on the small screen ahead of Monday's 75th edition of the annual Emmy awards.\nSPORTS January 11, 2024 ESPN gave Academy fake names to obtain more Emmy Awards for ineligible on-air talent: report ESPN reportedly duped the National Academy of Television Arts & Sciences to give the network at least 30 Emmy Awards to ineligible on-air talent by submitting fake names.\nMedia January 8, 2024 Nikole Hannah-Jones taunts 'haters' after 1619 Project wins Emmy Award Nikole Hannah-Jones posted a video of her \"twirling on the haters\" after the six-part Hulu docuseries \"The 1619 Project\" won an Emmy Award on Sunday.\nENTERTAINMENT January 3, 2024 Adam Driver has strong message for comments on his acting choices: 'Who gives a s---?' Adam Driver is addressing critiques he received for portraying two Italian characters in back-to-back films. Driver doesn't see a problem in the roles.\nENTERTAINMENT December 28, 2023 Susan Lucci, 76, has no plans to slow down, calls retirement a 'dirty word' Susan Lucci is firmly against retiring, sharing that she considers it to be a \"dirty word.\" At 76, the actress is also sharing how she remains effortlessly radiant.\nTV October 25, 2023 'Young and the Restless' star Christian LeBlanc reveals cancer diagnosis after 'fans caught' sign of disease \"The Young and the Restless\" star Christian LeBlanc revealed that he was diagnosed with multiple myeloma in June but he is now in remission. He said that fans had noticed an early symptom of the disease.\nThis Day in History September 5, 2023 On this day in history, September 5, 1929, legendary actor and comedian Bob Newhart is born Comedian and actor Bob Newhart was born in Oak Park, Illinois, on this day in history, Sept. 5, 1929. He's the only comedian to win the Grammy Award for Best New Artist.\nDeparted August 19, 2023 Ron Cephas Jones, Emmy-winning 'This Is Us' star, dead at 66 Ron Cephas Jones, who won two Emmy Awards for his role in the hit show \"This Is Us\" has died at 66. A representative confirmed that he died of a \"long-standing pulmonary issue.\""
    },
    {
      "url": "https://www.foxnews.com/entertainment/happy-days-star-henry-winkler-took-marlee-matlin-after-difficult-relationship-william-hurt",
      "text": "When Marlee Matlin ended her tumultuous relationship with William Hurt, she leaned on her mentor, Henry Winkler, for support.\nThe Oscar winner is detailing her rise to Hollywood stardom in a new documentary, \"Marlee Matlin: Not Alone Anymore.\"\nAccording to the film, Matlin turned to the \"Happy Days\" star after she ended her relationship with actor William Hurt. In the documentary, Matlin claimed that her \"Children of a Lesser God\" co-star had a \"habit of abuse.\" Hurt died in 2022 at age 71.\nHENRY WINKLER'S DAUGHTER SHARES THE TRUTH ABOUT GROWING UP WITH 'HAPPY DAYS' STAR AS HER DAD\nThe 59-year-old, who is deaf, told Fox News Digital through an interpreter that turning to Winkler during a difficult time in her life was a no-brainer.\n\"He didn’t make it hard for me to reach out to him,\" said Matlin. \"He was always available. It was like an open door – an open door to his heart and my heart. And he knew that.\"\n\"He knows that he’s done that to a lot of people,\" she shared. \"But to have that close relationship, I was just very, very fortunate. And I knew that both he and his wife were gold to me. I don’t think if I had Henry in my life, I would be here. I don’t think I would’ve made it this far. I don’t think so.\"\nHurt and Matlin starred in the 1986 film about a deaf woman’s romance with a hearing-speech teacher. Matlin was 19 when she was cast opposite Hurt, 35.\nWhile the relationship was plagued with problems, Matlin did credit Hurt for inspiring her to check into the Betty Ford Center after using up every bit of cocaine and marijuana she had in their New York City apartment.\nHowever, post-rehab, Matlin realized their relationship would not be the same.\nCLICK HERE TO SIGN UP FOR THE ENTERTAINMENT NEWSLETTER\n\"I walked out of that house and never went back,\" she said in the film.\nWinkler encouraged a sober Matlin to visit him and his wife Stacey Weitzman at their California home. There, they could \"talk.\" Matlin took up his offer.\nThe actor, who catapulted to fame as \"The Fonz,\" described Matlin knocking on his door.\nWATCH: 'HAPPY DAYS' STAR HENRY WINKLER SHARES HIS FONDEST MEMORY FROM THE SHOW\n\"’I just broke up with my boyfriend,’\" Winkler recalled Matlin telling him in the film. \"’Can I stay with you just for the weekend?’ ‘Sure. Stace, what do you think?’ ‘Of course.’\"\n\"Two years later, she finally moved out!\" Winkler chuckled.\nMatlin said Winkler and his family took her in \"as if I were one of their own.\"\nWinkler noted that Matlin was not \"completely whole at that time.\"\n\"What I told her was, ‘If you know what you want without ambivalence, if you’re clear about what you want, everything else will fall into place,'\" he said in the film.\nNot only did Matlin begin to heal, but she also found true love. In 1993, she married Kevin Grandalski, a police officer, at Winkler’s home.\nLIKE WHAT YOU’RE READING? CLICK HERE FOR MORE ENTERTAINMENT NEWS\n\"You just knew,\" said Winkler in the film about the romance. \"This is different. This is where a home is made. [And] there was no other thing to do, there was no other place for her to get married, except in our yard, in her home away from home.\"\nWinkler first saw a 12-year-old Matlin on stage in a Chicago variety show. In the documentary, Winkler recalled how Matlin’s mother took him aside and asked if he could warn her daughter from pursuing an acting career because it would be too difficult for her. Winkler replied, \"You got the wrong guy.\"\nWinkler became a friend and mentor to the then-aspiring actress. Their friendship has lasted for decades.\n\"I think anyone who has that kind of mentor would understand and appreciate how important he was to me,\" Matlin explained for Fox News Digital.\n\"He provided a place for me to feel safe,\" she said. \"I could always depend on the fact that he was a person who believed in me, genuinely, believed, and helped build my own self-confidence and trust the fact that he allowed me to be open and see the world more clearly. I'm so fortunate… that I was one of the people that he really cares about, truly cares about, genuinely cares about.\"\n\"He was probably one of the most famous people in the world at times,\" Matlin beamed. \"He was more famous than the President, in my opinion, and one of the most beloved people in the world. So, who would've ever thought that he would take the time and give attention to someone like me, the little girl that I was when he met me, the little deaf girl when he didn't even know American sign language?\"\nCLICK HERE TO GET THE FOX NEWS APP\n\"He didn't know anything about being deaf, about deaf culture,\" Matlin continued. \"But you know what? It didn't matter to him. He acknowledged, of course, yes, that I communicated. He didn't ignore the fact that I was deaf, but at the same time, he treated me with love and respect, as anyone should to anyone. And I grabbed that moment when we first met, knowing that he was the real deal.\"\nWinkler, 79, said in a statement sent to Fox News Digital, \"When we first saw her at age 12, it was evident how powerful and talented she was. She will always be part of our lives.\"\nMatlin is the youngest and first deaf best actress Academy Award winner. Her memoir, \"I'll Scream Later,\" was published in 2009. In it, the actress said she was molested as a child and alleged abuse from Hurt during their relationship.\n\"I didn't know that you could ask for help,\" Matlin told Fox News Digital. \"I didn't know that while screaming for help, I didn't know that I could go out and seek out help, as opposed to while it was happening… hoping that somebody would come. But no one did while I was screaming. No one did… I don't want to dwell on that, but that's what happened.\"\nFollowing the book’s publication, Hurt issued a statement to Access that read, \"My own recollection is that we both apologized, and both did a great deal to heal our lives. Of course, I did, and do apologize for any pain I caused. And I know we both have grown. I wish Marlee and her family nothing but good.\"\nThe documentary’s director, Shoshannah Stern, who is also deaf, told Fox News Digital through an interpreter that she admired Matlin’s bravery in speaking before the #MeToo movement.\n\"Everyone had so much doubt,\" said Stern. \"And then asking Marlee, ‘Why didn’t you leave?’ ‘Why did you stay in that relationship?’ I just felt that they just re-traumatized her… The questions that they asked made it worse, asking, ‘Did you think that those events happened to you because you were deaf?’ And Marlee continuing to say, ‘I didn’t know.’… And people just overlooking that comment over and over, not understanding what she meant and her strength.\"\n\"She didn’t know that abuse was abuse at the time,\" said Stern. \"And that’s what happens to so many deaf people in the world.\"\nThe work continues for Matlin, along with telling her story.\n\"I was determined to prove [my critics wrong],\" Matlin told Fox News Digital about pursuing a Hollywood career. \"It just made me want to roll up my sleeves, even more, to prove to them that I’m a deaf woman who loves acting as much as anybody else… I didn’t get into this business for nothing. It was a dream come true. So why shouldn't I be able to do another film?\"\n\"But if it happened today, I would’ve made a lot of noise back then,\" Matlin reflected. \"I didn’t know how to speak out against those who… wanted to put me in a negative light… As a result of all those criticisms, I had to grow up so quickly.\n\"I was 19 years old when I got into [‘Children of a Lesser God’], I turned 20 during the making of the film, and I had a much older boyfriend. It was my first film, and I was trying to get sober, and everything was coming at once. And they were more interested in pulling me down than all the other things that I was going through.\"\n\"Marlee Matlin: Not Alone Anymore\" premieres June 20."
    },
    {
      "url": "https://www.foxnews.com/entertainment/happy-days-stars-first-public-reunion-over-50-years",
      "text": "\"Happy Days\" stars came together for the first time in decades.\nDuring a panel at Steel City Con in Pittsburgh, Pennsylvania, Ron Howard, Henry Winkler, Anson Williams and Don Most reunited in public for the first time in 50 years and walked onto the stage with loud cheers from the audience.\n\"It feels like 50 minutes,\" Howard can be heard saying in an Instagram video posted on the event's official page. \"It does. We're having so much fun hanging, and this is sort of our great excuse to come together, so thank you.\"\nThe foursome starred on the popular family-friendly sitcom together from 1974 to 1984, except for Howard, who left the show in 1980 after its seventh season. The show followed the Cunningham family and their close friends in Milwakee, Wisconsin, throughout the 1950s and 60s.\n'HAPPY DAYS' STAR HENRY WINKLER TALKS REBOOT RUMORS AND IF HE WOULD RETURN\nAt the event, Winkler reflected on the 11 seasons he spent working on the show, crediting the show's creator, Garry Marshall, for being a \"brilliant creator\" and \"great writer\" who put together a \"wonderful cast.\"\n\"Some of them, unfortunately, are no longer on the Earth with us, but we played together, we stayed together, and we worked hard together,\" Winkler said about the relationships between the show's cast. \"Nobody thought they were better than anybody else.\"\nHoward echoed Winkler's sentiment, explaining \"that was a huge key\" to the show's success, and that as time went on, \"the show evolved as, really, an ensemble.\"\n\"It was a life experience that's unlike anything else that I've ever known,\" he said. \"And we had great chemistry. We had fun working together from the beginning, and it never failed us.\"\nLIKE WHAT YOU’RE READING? CLICK HERE FOR MORE ENTERTAINMENT NEWS\nPrior to the panel, Winkler spoke with the Pittsburgh Post-Gazette about how happy he was to reunite with his former cast mates publicly, noting that while \"this is the first time that we will be together in a public setting\" in the past 50 years, they have seen each other and \"been together.\"\nHe also reiterated how instrumental Marshall was in the success of the show, sharing he \"would not let bad behavior into the set\" and brought the cast together.\n\"No matter who you were, no matter what, you were part of an ensemble. Everybody respected each other. Then, he created a softball team, and we played every Sunday. Then we traveled all over the country. Then we traveled all over the world.\"\nIn a separate Instagram post shared on the events page, the four men can be seen posing for photos while holding a certificate. The caption explained the certificates signify the declaration by the President of Allegheny County Council that April 5 will now be known as Happy Days Day in Allegheny County, Pennsylvania.\nCLICK HERE TO SIGN UP FOR THE ENTERTAINMENT NEWSLETTER\nWinkler and Howard previously reunited on stage at the 2024 Emmy Awards, to honor the 50th anniversary of \"Happy Days.\" The pair walked out onto the stage, which was recreated to look like the set of Arnold’s Drive-In."
    },
    {
      "url": "https://www.foxnews.com/newsletters",
      "text": "Newsletters and Alerts\nSign up for our free email newsletters and alerts\n-\nBreaking News Alerts\nFast, 24/7 alerts to keep you in the know on the most important moments around the world.\nArrives 24/7By entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox Business Breaking News Alerts\nFast, 24/7 alerts to keep you in the know on the most important business moments around the world.\nArrives 24/7By entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox News First\nGet all the stories you need-to-know from the most powerful name in news delivered first thing every morning to your inbox.\nArrives WeekdaysBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nAntisemitism Exposed\nFox News' Antisemitism Exposed\" newsletter brings you stories on the rising anti-Jewish prejudice across the U.S. and the world.\"\nArrives WeeklyBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox News Politics\nGet the latest updates on the Trump administration and Congress, exclusive interviews and more Fox News politics content.\nArrives WeekdaysBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox Business Rundown\nGet a brief on the top business stories of the week, plus CEO interviews, market updates, tech and money news that matters to you.\nArrives WeeklyBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox News Entertainment\nGet a daily look at the top news in music, movies, television and more in the entertainment industry.\nArrives WeekdaysBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox True Crime\nThe hottest stories ripped from the headlines, from crime to courts, legal and scandal.\nArrives WeeklyBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nBest of Opinion\nGet the recap of top opinion commentary and original content throughout the week.\nArrives Twice a weekBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox News Lifestyle\nA look at the top-trending stories in food, relationships, great outdoors and more.\nArrives Twice a weekBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox News Health\nStay up-to-date on the biggest health and wellness news with our weekly recap.\nArrives WeeklyBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox News Sports Huddle\nReceive your weekly recap of all the happenings around the world of sports.\nArrives WeeklyBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox News Artificial Intelligence\nStay up-to-date on the latest AI technology advancements and learn about the challenges and opportunities AI presents now and for the future.\nArrives WeeklyBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox News Autos\nGet revved up with the week's hottest stories from the new and classic car worlds.\nArrives WeeklyBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nLearn More About Fox Nation\nFox Nation is an entertaining streaming service featuring your favorite Fox News personalities, with original shows and documentaries that Celebrate America.\nArrives WeeklyBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\nUnsubscription Successful\nYou have successfully unsubscribed from the newsletter. To re-subscribe or to subscribe to any of our other newsletters, please close this prompt and follow the directions on the page."
    },
    {
      "url": "https://www.foxnews.com/apps-products?pid=AppArticleLink",
      "text": "Fox News is Everywhere.\nWatch Fox News Channel on all of your devices to keep up to date with the latest in news, politics, entertainment and more. On phones, tablets, wearables and TV, it's easy to stay connected anywhere.\niOS Devices\nAndroid Devices\nApple TV\nRoku\nChromecast\nAndroid TV\nAmazon Fire\nFubo TV\nApple Watch\nAmazon Echo\nGoogle Home\nFox News Go\nApple News\nAT&T TV Now\nYouTube TV\nHulu\nFacebook\nInstagram\nSamsung Devices\nSling TV\nVidgo\nSpotify\niHeartRadio\nFlipboard\nLinkedIn\nGoogle Newsstand\nNewsletters\nYouTube\nFAQ\nHow much data does Fox News Go use?\nFox News Go uses about 2GB per hour of SD viewing and 4GB per hour of HD viewing. This can vary depending on your device and internet connection. If you are concerned about your data usage we recommend not streaming over a cellular network and contacting your Internet or Cellular Service Provider.\nWhat broadcast quality will I get while streaming on my device?\nFox News will stream at the highest quality possible based on your device and internet connection quality. For the best quality we recommend streaming via Wi-Fi or 4G.\nWhat channels are available on Fox News Go?\nYou can Watch Fox News Channel on Fox News Go and Fox Business Channel on Fox Business Go"
    },
    {
      "url": "https://www.foxnews.com/entertainment/harrison-ford-admits-what-keeps-him-going-hollywood",
      "text": "Hollywood icon Harrison Ford is no stranger to accolades, but his first-ever Emmy nomination has left him reflecting on what truly drives him.\nThe legendary actor spoke with Fox News Digital at a Televerse red carpet event in Los Angeles about his Emmy nod and what continues to fuel his passion for Hollywood.\n\"It's nice, I appreciate the attention, and I appreciate… the proposition,\" Ford said of his nomination for outstanding supporting actor in a comedy series for his work in \"Shrinking.\"\n\"It’s gratifying, but my real pleasure is in the work.\"\nHARRISON FORD WAS TOLD TO DITCH ‘PRETENTIOUS’ NAME, COPY ELVIS PRESLEY TO SUCCEED IN HOLLYWOOD\nThe 83-year-old actor, whose decades-long career includes famous roles in \"Indiana Jones\" and \"Star Wars,\" isn’t one to get bogged down in awards and accolades. Instead, the thrill has always been in the craft. And despite a career that spans over 50 years, he’s still as driven as ever.\nThe seasoned Hollywood veteran spoke about what keeps him motivated in the industry, explaining that what he loves is \"The mystery of it.\"\n\"What’s going to happen, who’s going to do what—it’s fascinating to be alive, and the stuff we do is so demanding, you’re really scared not to do anything.\"\nWATCH: HARRISON FORD GETS REAL ABOUT WHAT DRIVES HIM IN HOLLYWOOD\nWhether he’s starring in \"Shrinking\" or another big Hollywood project, Ford emphasized that the thrill of the unknown fuels his passion.\n\"It makes the day go by pretty fast,\" Ford said, as he explained he feels energized by the fast-paced nature of the industry. \"I like not knowing what’s going to happen. It’s very exciting.\"\nFord was joined on the red carpet by his \"Shrinking\" co-star, Jessica Williams, who agreed with his assessment, saying, \"I like that too. I like not knowing what's going to happen. It's very exciting.\"\nHe also acknowledged and credited the show's writers for pushing him further as a Hollywood actor.\nTOM CRUISE, HARRISON FORD, CHARLIZE THERON SUFFER BRUTAL INJURIES RISKING THEIR BODIES ON SET\n\"I like having writers that you trust… they’ve helped me extend my range,\" he continued to explain to Fox News Digital.\nMeanwhile, his co-star Williams dished on the \"Shrinking\" wrap party that went on until 3 a.m. — which Ford missed.\nWATCH: HARRISON FORD GIVES A GLIMPSE INTO HIS PAST PARTY LIFE\nWhen Fox News Digital asked whether he could still hang with the party crowd, Ford flashed a mischievous grin and quipped, \"It’s happened before.\"\nLIKE WHAT YOU’RE READING? CLICK HERE FOR MORE ENTERTAINMENT NEWS\nAt the beginning of Ford’s acting career, he was told that he had no future in Hollywood.\nAccording to a Hollywood executive in the ‘60s, Ford was never going to be a household name.\nLast month, Ford explained that when he got his debut role in \"Dead Heat on a Merry-Go-Round,\" he was making $150 per week and was treated accordingly.\n\"I was under contract to Columbia Pictures at the time for $150 a week and all the respect that that implies. I was called into the office of the head of the new talent program, and he told me that I had no future in the business, which was OK,\" Ford told Variety.\nHe explained that the head of talent at Columbia Pictures told him to change his look and his name.\n\"And then he asked me to get my hair cut like Elvis Presley. That I didn’t go along with.\"\nCLICK HERE TO SIGN UP FOR THE ENTERTAINMENT NEWSLETTER\n\"He thought that ‘Harrison Ford’ was too pretentious a name for a young man,\" the actor said.\nAlthough he's undeniably one of the most famous leading men in Hollywood history, he said he never expected or necessarily desired the level of fame he'd achieve.\nCLICK HERE TO GET THE FOX NEWS APP\nFox News Digital's Janelle Ash contributed to this report."
    }
  ],
  "argos_summary": "Henry Winkler, the 79‑year‑old actor known for \"Happy Days,\" reflects on a five‑decade career, emphasizing his grounded perspective, gratitude, and the importance of listening and kindness. He shares parenting lessons, noting how his own upbringing shaped his approach to raising children, and recounts mentoring Marlee Matlin during a difficult period. Winkler also highlights his recent Hall of Fame honor and reunion with former castmates, underscoring the enduring value of collaboration and resilience in Hollywood.",
  "argos_id": "KK4HXNBMA"
}