{
  "url": "https://www.usatoday.com/press-release/story/13051/cotec-completes-infill-and-expansion-resource-drilling-programme-at-the-lac-jeannine-project-engages-corem-for-metallurgical-testing-and-commences-a-process-to-appoint-an-epcm-provider-for-the-feasib/",
  "authorsByline": "accesswire",
  "articleId": "6b770e317b5e4db79925c96924bf6f0d",
  "source": {
    "domain": "usatoday.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "VA",
      "county": "Fairfax County",
      "city": "McLean",
      "coordinates": {
        "lat": 38.9342888,
        "lon": -77.1776327
      }
    }
  },
  "imageUrl": "http://usatoday.xpr-gannett.com/wp-content/uploads/sites/3/2025/05/image-14.webp",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-30T22:26:59+00:00",
  "addDate": "2025-08-30T22:31:18.520404+00:00",
  "refreshDate": "2025-08-30T22:31:18.520405+00:00",
  "score": 1.0,
  "title": "CoTec Completes Infill and Expansion Resource Drilling Programme at the Lac Jeannine Project, Engages Corem for Metallurgical Testing and Commences a Process To Appoint an EPCM Provider for the Feasibility Study",
  "description": "VANCOUVER, BC / ACCESS Newswire / August 28, 2025 / CoTec Holdings Corp. (TSXV:CTH)(OTCQB:CTHCF) (“CoTec” or the “Company”) is pleased to announce the completion of its 2025 sonic drilling and bulk sampling testing programme at the Lac Jeannine Iron Tailings Project, Québec, Canada (“Lac Jeannine”, or the “Project”). The Company has engaged Corem to complete […]",
  "content": "VANCOUVER, BC / ACCESS Newswire / August 28, 2025 / CoTec Holdings Corp. (TSXV:CTH)(OTCQB:CTHCF) (“CoTec” or the “Company”) is pleased to announce the completion of its 2025 sonic drilling and bulk sampling testing programme at the Lac Jeannine Iron Tailings Project, Québec, Canada (“Lac Jeannine”, or the “Project”). The Company has engaged Corem to complete the metallurgical testing and has commenced a process to appoint a EPCM provider for the Feasibility Study. The Feasibility Study is expected to commence in Q3, 2025.\n\nJulian Treger, CoTec CEO commented; “CoTec has progressed its discussions with strategic partners to move rapidly onto preparation of a Feasibility Study with the support of all stakeholders, including the Government of Québec, First Nations and other interested parties. The results from this next phase of drilling and bulk sample collection will allow CoTec to increase its current resource estimate for Lac Jeannine and potentially unlock additional material outside of the tailings dam to reprocess.\n\nThe Company is very excited to commence a Feasibility Study regarding the recovery and production of critical mineral iron ore concentrate at competitive cost structures which can deliver high purity iron concentrates for the green steel industry. The Lac Jeannine Project offers great potential for the resource industry to recover the economic benefit of large Fe tailing sites.”\n\nIn June 2024 CoTec announced the completion of an initial Mineral Resource Estimate (the “MRE”) and positive Preliminary Economic Assessment (“PEA”) for the Project[i]. Based on open-pit extraction methods and the production of a gravity concentrate via conventional processing techniques and at a discount rate of 7.0% (and based solely on the MRE), the pre-tax NPV is US$93.6M, and its IRR is 38%, and the after tax NPV is US$59.5M, and its IRR is 30%. As part of the Feasibility Study, the Company is including the application of the Salter Cyclone Multi-Gravity Separators (“MGS”) technology for the recovery of additional iron ore from the Project.\n\nThe completed drilling targeted upgrading the existing Inferred Mineral Resource of 73 million tonnes (Mt) at 6.7% total Fe for 4.9 Mt of contained total Fe to Indicated and to extend the Project to a larger portion of the Adjacent Tailings. The inclusion of the Adjacent Tailings has the potential to almost double the life of mine with no additional capex unlocking substantial upside potential.\n• An infill and expansion programme totalling 572 meters of sonic drilling for 12 holes, drilled up to 58 meters, was completed on the historical tailings of the previous Lac Jeannine iron ore mine operated by the Québec Cartier Mining Company between 1959 and 1985.\n• Additional bulk sampling has also been concluded, a total of 7 tonnes of tailings and waste rock dumps were recovered to assess their iron content and has been shipped to Corem’s testing facility in Québec.\n• Bulk sampling and assay results are expected in Q4 2025.\n\nThe Independent Qualified Person as defined by NI 43-101 for the Lac Jeannine Mineral Resource, Mr. Christian Beaulieu, P.Geo., is a member of l’Ordre des géologues du Québec (#1072). The Qualified Person has reviewed and approved the scientific and technical content of this announcement relating to the Lac Jeannine Mineral Resource.\n\nAbout CoTec\n\nCoTec Holdings Corp. (TSXV:CTH)(OTCQB:CTHCF) is redefining the future of resource extraction and recycling. Focused on rare earth magnets and strategic materials, CoTec integrates breakthrough technologies with strategic assets to unlock secure, sustainable, and low-cost supply chains for the United States and its allies.\n\nCoTec’s mission is clear: accelerate the energy transition while strengthening U.S. economic and national security. By investing in and deploying disruptive technologies, the Company delivers capital-efficient, scalable solutions that transform marginal assets, tailings, waste streams, and recycled products into high-value critical minerals.\n\nFrom its HyProMag USA magnet recycling joint venture in Texas, to iron tailings reprocessing in Québec, to next-generation copper and iron solutions backed by global majors, CoTec is building a diversified portfolio with long-term growth, rapid cash flow potential, and high barriers to entry. The result is a game-changing platform at the intersection of technology, sustainability, and strategic materials.\n\nFor more information, please visit www.cotec.ca\n\nFor further information, please contact:\n\nBraam Jonker – (604) 992-5600\n\nForward-Looking Information Cautionary Statement\n\nStatements in this press release regarding the Company and its investments which are not historical facts are “forward-looking statements” which involve risks and uncertainties, including statements relating to the Lac Jeannine 2025 sonic drilling and bulk sampling testing programme and management’s expectations with respect to other current and potential future investments and the benefits to the Company which may be implied from such statements. Since forward-looking statements address future events and conditions, by their very nature, they involve inherent risks and uncertainties. Actual results in each case could differ materially from those currently anticipated in such statements, due to known and unknown risks and uncertainties affecting the Company, including but not limited to resource and reserve risks; environmental risks and costs; labor costs and shortages; uncertain supply and price fluctuations in materials; increases in energy costs; labor disputes and work stoppages; leasing costs and the availability of equipment; heavy equipment demand and availability; contractor and subcontractor performance issues; worksite safety issues; project delays and cost overruns; extreme weather conditions; and social and transport disruptions. For further details regarding risks and uncertainties facing the Company please refer to “Risk Factors” in the Company’s filing statement dated April 6, 2022, a copy of which may be found under the Company’s SEDAR profile at www.sedar.com. The Company assumes no responsibility to update forward-looking statements in this press release except as required by law. Readers should not place undue reliance on the forward-looking statements and information contained in this news release and are encouraged to read the Company’s continuous disclosure documents which are available on SEDAR at www.sedarplus.ca.\n\nNeither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this news release.",
  "medium": "Article",
  "links": [
    "https://pr.report/dpbj",
    "https://pr.report/dpbi",
    "https://pr.report/dpbh",
    "https://www.accessnewswire.com/",
    "https://www.accessnewswire.com/newsroom/en/metals-and-mining/cotec-completes-infill-and-expansion-resource-drilling-programme-at-the-lac-jeann-1066434",
    "https://pr.report/dpao"
  ],
  "labels": [
    {
      "name": "Press Release"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Lac Jeannine",
      "weight": 0.06865139
    },
    {
      "name": "iron tailings",
      "weight": 0.064623825
    },
    {
      "name": "Company",
      "weight": 0.06260338
    },
    {
      "name": "additional iron ore",
      "weight": 0.06051165
    },
    {
      "name": "high purity iron concentrates",
      "weight": 0.05972215
    },
    {
      "name": "critical mineral iron ore concentrate",
      "weight": 0.05872398
    },
    {
      "name": "CoTec Holdings Corp.",
      "weight": 0.058172997
    },
    {
      "name": "energy costs",
      "weight": 0.057642292
    },
    {
      "name": "such statements",
      "weight": 0.057478745
    },
    {
      "name": "CoTec CEO",
      "weight": 0.057184204
    }
  ],
  "topics": [
    {
      "name": "Energy Sector"
    },
    {
      "name": "Environment-ESG"
    }
  ],
  "categories": [
    {
      "name": "Environment"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.97509765625
    },
    {
      "name": "/Business & Industrial/Metals & Mining/Other",
      "score": 0.853515625
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.62744140625
    },
    {
      "name": "/Business & Industrial/Energy & Utilities/Oil & Gas",
      "score": 0.385498046875
    },
    {
      "name": "/Business & Industrial/Manufacturing/Other",
      "score": 0.366455078125
    }
  ],
  "sentiment": {
    "positive": 0.6192489,
    "negative": 0.017601084,
    "neutral": 0.36314997
  },
  "summary": "CoTec Holdings Corp. (TSXV:CTH)(OTCQB:CTHCF) has completed its 2025 sonic drilling and bulk sampling testing programme at the Lac Jeannine Iron Tailings Project, Québec, Canada. The Company has engaged Corem for metallurgical testing and is beginning a process to appoint an EPCM provider for the Feasibility Study. The Feasible Study is expected to begin in Q3, 2025. The drilling will allow CoTec to increase its current resource estimate for Lac Jeanine and potentially unlock additional material outside of the tailings dam to reprocess. The initial Mineral Resource Estimate (MRE) and positive Preliminary Economic Assessment (PEA) for the Project was completed in June 2024.",
  "shortSummary": "CoTec Holdings Corp. completes its extensive drilling and metallurgical testing at the Lac Jeannine Iron Tailings Project, aiming to develop a viable Feasibility Study with significant upside potential.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "8184ea9f00c64853b9d7543e7d72d8d2",
  "places": [
    {
      "osmId": "190372666",
      "county": "Jamésie",
      "state": "Quebec",
      "country": "Canada",
      "countryCode": "ca",
      "coordinates": {
        "lat": 49.80141705,
        "lon": -74.43000845025324
      }
    }
  ],
  "scraped_sources": [
    {
      "url": "https://pr.report/dpbh",
      "text": "Sign up for email alerts of financial disclosure documents\nSign up for email alerts of Cease Trade Orders and the Disciplined List\nSearch the archive for public documents filed prior to the launch of SEDAR+\nQUICK REFERENCE\nCSA National Systems Status\nAccess the most current information about CSA National Systems updates, scheduled maintenance and known issues that are being addressed\nSEDAR+ Fee Guide\nThe relevant regulatory filing fees governed by the provincial and territorial securities regulatory authorities\nSEDAR+ Resources\nRead the overview information on profiles, filings, payments and refunds, and records of cease trade orders and disciplinary actions in SEDAR+\nSEDAR+ Rules and Forms\nView the rules and access forms regarding the electronic transmission of documents and payments through SEDAR+\nActivity Reports\nAccess the annual reports of CSA member enforcement activities, intended to provide the public with a better contextual understanding of enforcement activities\nCrypto Trading Platforms\nView crypto trading platforms (CTPs) that are registered, filed a pre-registration undertaking, or banned from the Canadian Capital Markets\nInvestment Tools and Alerts\nLearn how investment frauds happen and how to protect your investments. The CSA has resources to help you understand how to detect potential scams and fraudulent activities."
    },
    {
      "url": "https://pr.report/dpao",
      "text": "CoTec is a next-generation resource company focused on transforming undervalued mineral assets into high-margin operations through the deployment of breakthrough extraction and processing technologies.\nOur approach targets low-grade and complex deposits that have historically been uneconomic. By leveraging technologies that dramatically reduce water and energy usage compared to traditional methods, CoTec unlocks new sources of critical minerals with improved economics and sustainability.\nWe currently hold investments in six transformative technologies and three mineral assets, providing exposure to key commodities such as rare earths, iron ore, and copper. Our strategy is to acquire and operate assets where our technologies offer a clear advantage—creating value through scalability, strategic partnerships, and ultimately spinning off these businesses as standalone operations.\nCoTec is publicly listed on the TSX Venture Exchange and OTCQB under the symbols TSX-V: CTH and OTCQB: CTHCF.\nCoTec invests in disruptive, scalable technologies that have the potential to fundamentally change how minerals and metals are extracted, refined, and processed. We focus on early-stage innovations with commercial potential and back them with decades of operational experience and a highly engaged Board of Directors.\nWhat sets CoTec apart is our dual network: deep roots in the global resource extraction industry, and strong connections to technology funds, universities, innovation labs, and forward-thinking mining professionals. This unique positioning enables us to accelerate the development and deployment of next-generation technologies.\nFor more advanced technologies, CoTec pursues joint ventures and partnerships to fast-track commercial applications. In an industry often slow to adopt change, we bring an entrepreneurial mindset and a nimble approach—ready to move where incumbents hesitate.\nWe scale value through a two-pronged strategy:\nCoTec is building a new kind of resource company—one that brings together innovation and ownership to deliver profitability, efficiency, and long-term value.\nAt CoTec, we believe the future of resource production will be defined by innovation. We’re not just following the transition—we’re building it, by backing breakthrough technologies that can unlock value where others can’t.\nGlobal demand for critical minerals is accelerating, but traditional mining methods alone won’t meet the moment. CoTec is pioneering a new model: we invest in and deploy proven, disruptive technologies that make it possible to extract and process materials more efficiently, more cleanly, and from sources previously considered uneconomic—such as legacy stockpiles, tailings, and recycled material.\nWhat sets us apart is our strategy. We don’t just fund technology—we own it, and integrate it into undervalued assets we control, creating a clear path from innovation to production. Our goal is to build a portfolio of scalable, cost-effective operations that can meet the growing demand for critical minerals—with faster timelines, lower capital intensity, and stronger margins.\nWe’ve already screened hundreds of technologies, invested in only the most credible and commercially viable, and are now entering the next phase: applying them to real-world assets to create long-term value."
    }
  ],
  "argos_summary": "CoTec Holdings Corp. announced completion of its 2025 sonic drilling and bulk sampling program at the Lac Jeannine Iron Tailings Project in Quebec, with metallurgical testing underway and a feasibility study slated to begin in Q3 2025. The company plans to expand the resource estimate and potentially double mine life by reprocessing adjacent tailings, leveraging Salter Cyclone Multi‑Gravity Separators to recover additional iron ore. Positive preliminary economic assessment from 2024 shows a pre‑tax NPV of $93.6 M and IRR of 38 %, and the firm expects bulk sampling assay results in Q4 2025.",
  "argos_id": "M9SKOG76Q"
}