{
  "url": "https://www.pocket-lint.com/features-galaxy-s26-pro-needs-to-win-me-from-iphone-16-pro/",
  "authorsByline": "Roger Fingas",
  "articleId": "e50285095cb0462f83c02bf1f38f65f5",
  "source": {
    "domain": "pocket-lint.com",
    "location": {
      "country": "gb",
      "city": "London",
      "coordinates": {
        "lat": 51.5073219,
        "lon": -0.1276474
      }
    }
  },
  "imageUrl": "https://static0.pocketlintimages.com/wordpress/wp-content/uploads/wm/2025/03/galaxy-s25-plus-hero-image-2.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-31T18:00:16+00:00",
  "addDate": "2025-08-31T18:06:47.177838+00:00",
  "refreshDate": "2025-08-31T18:06:47.177840+00:00",
  "score": 1.0,
  "title": "4 features the Galaxy S26 Pro needs to win me from the iPhone 16 Pro",
  "description": "It's an uphill battle, particularly when it comes to battery technology.",
  "content": "The word is that for the Galaxy S26 lineup, Samsung is working on a significant overhaul, with the aim of reducing its next flagship phones to just three models: the Edge, the Ultra, and a new \"Pro\" device. No more Plus, no more vanilla models, though of course the Pro might as well be that, based on rumors so far. Versus the S25, it's expected to upgrade to a slightly bigger 6.27-inch display, and a similarly bumped 4,300mAh battery. No luck convincing Samsung to match something like the 6,260mAh silicon-carbon battery in the OnePlus 13T, I'm afraid.\n\nMy daily driver at the moment is actually the iPhone 16 Pro. I do sometimes toy with the idea of going back to Android, however, and for both that and work reasons, I like to keep tabs on where the best Android phones are at. There's a list of specific upgrades the S26 Pro would need for me to jump ship from the iPhone world, some of them more plausible than others.\n\nConsider it food for thought while we wait for Samsung's next Galaxy Unpacked event, which is likely to happen in late January 2026.\n\nA fix to one of the linchpins of any smartphone\n\nThe Galaxy S25 already has an advantage over most iPhones simply for having a telephoto camera. Apple has never bothered putting one on any of its non-Pro devices, instead limiting those products to wide and ultra-wide lenses, at best. It's a little ridiculous, considering that people more often need to get closer to a subject rather than further away. That's one of the main reasons I bought an iPhone 16 Pro -- I was sick of missing out on shots that even cheap DSLRs and mirrorless cameras can take.\n\nThe 16 Pro's telephoto camera still leaves something to be desired. While it has 5x zoom with optical image stabilization, its low-light sensitivity is weak, such that noise and blur start to creep into pictures under anything less than bright conditions. An S26 Pro with a larger telephoto sensor better matching its main one would be amazing. That would entail bumping up the megapixel count to at least 50 megapixels, but it would provide knock-on benefits, namely better cropping and digital zoom. Samsung might well have to take that route if it's going to market a phone as \"pro.\"\n\nSamsung may also need to push optical zoom past the S25's 3x mark. 3x is fine in many situations, yet even 5x often feels too short, say if you're trying to take a shot of the lead singer at a concert instead of the whole stage. I doubt Samsung will make the leap to 10x, though.\n\nA man can dream, can't he?\n\nA 4,300mAH battery should be enough to last a day, and possibly beat my iPhone 16 Pro, if Samsung's performance optimization is on-point. But something smartphone owners have been demanding for decades is a product that can last two days or more on a charge without enabling any special battery-saving features.\n\nIt's not just a matter of convenience, either. In emergency situations, such as hurricanes and wildfires, a single-day phone can become a serious liability, forcing users to scramble for power when they should be concerned with more important things. It's a sad commentary that relief agencies sometimes make charging outlets a key feature of their aid stations.\n\nWe already do have two-day phones in the form of products with silicon-carbon (Si-C) batteries, like the OnePlus 13T I mentioned. What I'm really saying, then, is that I'm not happy with Samsung's overly conservative battery specs, assuming the rumors are true. It's not only ignoring something every phone buyer wants, but a clear opportunity to make iPhones seem archaic.\n\nIndeed, some of us were surprised that the S25 Edge shipped without Si-C, never mind something coming out in 2026.\n\nThe new minimum for wireless charging\n\nOnce you've got used to MagSafe on an iPhone, it's hard to go back. USB-C charging is faster, but MagSafe allows for extremely convenient wireless charging stands, not to mention other quick-release accessories like wallets, batteries, and grips. An Anker travel charger I own is capable of topping off my iPhone, Apple Watch, and Jabra earbuds without any cables beyond the wall adapter, and props my iPhone up in landscape mode so I can watch fullscreen videos.\n\nQi2 -- based on MagSafe -- has technically been available to Android phone makers for a while, but largely ignored for reasons that aren't quite clear. Now that Google has embraced it for the Pixel 10, though, Samsung doesn't have an excuse for leaving it out of the S26 series. Thinking about it, it's strange that the company didn't seize on Qi2 the moment it became available, since much of its success is based on intentionally imitating or leapfrogging Apple.\n\nSpeaking of imitating Apple, one of the things Samsung has always had its eye on is a walled garden that deters people from switching platforms. You're prompted to use Samsung Wallet instead of Google Wallet, SmartThings instead of Google Home, and even Samsung Health instead of Google Fit and Google Health Connect. In fact, you can't even wear a Galaxy Watch without Samsung Health installed.\n\nYou might think that wouldn't bother me, since I'm used to stricter barriers on my iPhone. For me, though, one of the main appeals of Android is the freedom to switch brands not just at will, but easily. Some phones might have specific features, but the essentials carry over in a heartbeat -- a Nothing or OnePlus device won't ask you to switch away from Google Wallet. If I'm going to make the leap someday, I don't want to find myself right back where I started in terms of the ecosystem landscape.\n\nWhile I'm at it, it's time that Samsung finally admitted defeat and did away with Bixby. The voice assistant was never popular, and has become increasingly irrelevant in the age of Google Gemini. It's only good for executing on-device commands, and in fact, that's about all it does on the S25.\n\nIf Samsung can exorcise Bixby entirely, I'll know it's on the right track for prioritizing users rather than its control over them. In the long run, I'd rather every phone support multiple assistants -- no matter the brand.",
  "medium": "Article",
  "links": [
    "https://www.pocket-lint.com/samsung-s26-edge-replacing-plus/",
    "https://www.pocket-lint.com/should-you-buy-regular-iphone-16-or-iphone-16-pro/",
    "https://www.pocket-lint.com/oneplus-13t-next-phone/",
    "https://www.pocket-lint.com/google-pixel-10-series-details-you-might-have-missed/",
    "https://www.pocket-lint.com/until-apple-fixes-iphone-telephoto-cameras/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Samsung Wallet",
      "weight": 0.07888456
    },
    {
      "name": "Samsung Health",
      "weight": 0.07856989
    },
    {
      "name": "Samsung",
      "weight": 0.076980345
    },
    {
      "name": "iPhone 16 Pro",
      "weight": 0.07662785
    },
    {
      "name": "Android phone makers",
      "weight": 0.066203356
    },
    {
      "name": "iPhone",
      "weight": 0.06078759
    },
    {
      "name": "Galaxy S26",
      "weight": 0.059997365
    },
    {
      "name": "Pro",
      "weight": 0.057677478
    },
    {
      "name": "batteries",
      "weight": 0.05396038
    },
    {
      "name": "Google Wallet",
      "weight": 0.052482754
    }
  ],
  "topics": [
    {
      "name": "Electronics"
    },
    {
      "name": "iPhone"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Computers & Electronics/Software/Operating Systems",
      "score": 0.875
    },
    {
      "name": "/News/Technology News",
      "score": 0.80078125
    },
    {
      "name": "/Internet & Telecom/Mobile & Wireless/Mobile Phones",
      "score": 0.7470703125
    },
    {
      "name": "/Shopping/Consumer Resources/Product Reviews & Price Comparisons",
      "score": 0.673828125
    }
  ],
  "sentiment": {
    "positive": 0.18061559,
    "negative": 0.33366603,
    "neutral": 0.4857183
  },
  "summary": "The article discusses the four features the Galaxy S26 Pro needs to win over readers, including myself, who are currently using the iPhone 16 Pro. The S26 is expected to be replaced by a larger 6.27-inch display and a significantly bumped 4,300mAh battery. The article also notes that Samsung may need to increase its telephoto camera to at least 50 megapixels, which could provide better cropping and digital zoom. The author also notes dissatisfaction with Samsung's overly conservative battery specs, suggesting a product that can last two days or more on a charge without requiring special battery-saving features. The new minimum for wireless charging is USB-based MagSafe, which allows charging stands, travel accessories, and travel accessories. Samsung's next Galaxy Unpacked event is expected in late 2026.",
  "shortSummary": "Samsung's upcoming Galaxy S26 Pro, featuring upgraded features like a larger telephoto camera, increased battery, and USB-charging, aims to win over the iPhone 16 Pro with its upcoming models.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "36e31bcad8314a339140b3d60a9af031",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.pocket-lint.com/oneplus-13t-next-phone/",
      "text": "Summary\n- OnePlus has confirmed the existence of the OnePlus 13T (aka the OnePlus 13 mini), and it's set to launch this April in China. Hopefully a global release will follow soon after.\n- The OnePlus 13T is rumored to have a 6.3-inch display, smaller than the OnePlus 13's 6.82-inch display, and have bezels as slim as the iPhone 16 Pro.\n- The OnePlus 13T will have a new customizable side button that replaces the alert slider, similar to the iPhone's Action Button.\nOnePlus launched the OnePlus 13 in China last year and globally at the beginning of this year. Since then, it has received widespread acclaim from the Android community. The phone is arguably one of the best Android flagships available right now and offers significant value considering its $900 price tag, including the Snapdragon 8 Elite chipset and a 6.82-inch AMOLED display.\nWhile the OnePlus 13 is a strong all-around package, for those of us who prefer smaller handsets, the 6.82-inch display feels a bit too large. It would have been fantastic to see a smaller display option offered. OnePlus appears to have listened to concerns like mine, as well as those of many others, with the introduction of the OnePlus 13T (commonly known as the OnePlus 13 mini).\nOnePlus confirmed the existence of the OnePlus 13T on April 1 (thankfully, it was not a joke), and since then, it has been teasing information about its upcoming flagship phone, rumored to be a smaller version of the OnePlus 13. Unlike the OnePlus 13R, which is a slightly smaller mid-range version of the OnePlus 13, the 13T is expected to retain more premium features. With the launch of the phone imminent, here are five exciting reasons why the OnePlus 13T should be your next smartphone.\nOnePlus 13\n- Brand\n- OnePlus\n- SoC\n- Snapdragon 8 Elite\n- Display\n- 6.82-inch, 3168 × 1440 pixel resolution (510ppi) 120Hz adaptive refresh\n- RAM\n- 12GB, 16GB\n- Storage\n- 256GB, 512GB\n- Battery\n- 6,000mAh\nThe latest and greatest flagship handset from OnePlus, featuring the all-new Snapdragon 8 Elite chipset and IP69 water and dust resistance.\nSamsung's One UI 7 is rolling out now: Eligible devices and how to update\nSamsung's One UI 7 update has begun rolling out in the US.\n5 A 6.3-inch display\nSlim bezels like the iPhone 16 Pro\nThe most significant rumored difference between the OnePlus 13 and the OnePlus 13T is the size of the display. While the OnePlus 13 features a 6.82-inch display, the OnePlus 13T is anticipated to have a 6.31-inch panel. Even with a reduced display size, the 13T is expected to maintain the same quality as the OnePlus 13's screen, sporting an OLED panel, a 120Hz adaptive refresh rate, and an ultrasonic fingerprint sensor.\nFor the 13T, it appears that OnePlus is taking a cue from Apple's approach, given that it offers a 6.3-inch iPhone 16 Pro and a 6.9-inch iPhone 16 Pro Max, which are nearly identical to the sizes of the OnePlus 13T and OnePlus 13.\nLi Jie, the president of OnePlus China, recently shared an image of the 13T on Weibo (as seen above), showcasing its display with slim bezels next to what appears to be the iPhone 16 Pro, all but confirming that its display will likely be the same 6.3-inch size. Jie referred to the OnePlus 13T as the \"small screen king\" (translated via Google Translate).\nThe Pixel 9a is so much better than the iPhone 16e, it's not even close\nAs far as 2025 mid-range smartphones go, the Pixel 9a beats the competition by a significant margin.\n4 Goodbye alert slider, hello Quick Key\nJust like the iPhone's Action Button\nJie wasn't just teasing the size of the 13T's bezels recently. He posted another image on Weibo, teasing the phone's new customizable shortcut button (seen above). This button will essentially be similar to the iPhone's Action Button and could be called \"Quick Key\" (via Android Headlines).\nThe Quick Key button will be located on the upper portion of the left-hand side of the phone, replacing the old alert slider. The button has significantly more functionality than the alert slider, enabling users to switch between various modes, such as mute, vibration, and ring. Alert sliders are becoming obsolete, and I'm glad to see OnePlus incorporating a button that users can customize to their liking instead.\n5 default iPhone apps I ditched as soon as I tried these alternatives\nApple's native suite of in-box apps are serviceable, but third-party developers have, in many instances, crafted superior experiences.\n3 A larger battery\nSmaller phone, larger battery\nOne of the most interesting rumors circulating about the OnePlus 13T is the size of its battery. The OnePlus 13 packs a 6,000mAh battery, whereas the OnePlus 13T is rumored to feature a larger 6,200mAh battery. The president of OnePlus China confirmed that the phone's battery will start with a \"6,\" but didn't spill the details on the exact number (via GSMArena).\nTypically, when a company releases a smaller variant of its phone, it reduces the battery size. For instance, Apple's iPhone 16 Pro has a smaller battery than the 16 Pro Max. Similarly, Samsung's Galaxy S25 has a smaller battery than the S25+. It seems OnePlus is debunking the notion that a smaller phone necessitates a smaller battery. Google recently did the same thing with the Pixel 9a, providing a 5,100mAh battery for its mid-range phone, slightly larger than the Pixel 9 Pro XL's 5,060mAh battery.\nThis new Color E-Paper tech lasts up to 200 days on a single charge\nSamsung is launching a new 32-inch Color E-Paper display panel, and it's a compelling and flexible product with several theoretical use cases.\n2 A new color option\nThe OnePlus 13T will be available in pink\nIn the past, OnePlus hasn't offered the brightest colors for its phones, but that will change for the OnePlus 13T. Once again drawing comparisons to the iPhone, Li Jie, president of OnePlus China, posted a teaser picture of the OnePlus 13T on Weibo, showcasing the phone's light pink color scheme alongside the iPhone 16's pink hue.\nOnePlus has never really aimed for eye-popping colors like the iPhone, so it's refreshing to see it mix things up for the OnePlus 13T. It seems that OnePlus wants people who gravitate toward the base model iPhone to give the 13T a shot, and offering a variety of striking color options could do the trick. It's unclear what all the colors for the OnePlus 13T will be yet. Jie described the 13T as having \"an unprecedented wonderful feel, which is very good and you can't put it down\" (translated via Google Translate).\nI found the cheapest way to keep your tech in pristine condition\nYou might not realize it, but a battery-powered compressed air duster is something you need in your life.\n1 A powerful chipset\nHopefully, the phone releases outside of China\nWhen it comes to power, the OnePlus 13T isn't likely to compromise like the OnePlus 13R. Qualcomm's Snapdragon 8 Elite chipset, the exact same one found in the OnePlus 13, is expected to power the OnePlus 13T. So, if you were worried about performance due to its smaller size, you have nothing to worry about; leaked benchmarks indicate it is just as powerful.\nThe president of OnePlus China has announced that the OnePlus 13T is launching this April, but that's likely just in China. Its global release is a bit uncertain at the moment, especially amidst the ongoing trade war between the US and China. Despite everything happening in the world right now, I really hope that OnePlus can release the phone in the US and other markets eventually. This is a compact flagship handset many OnePlus fans have been waiting for, and it would be a shame if it didn't release outside of China. The cost of the phone hasn't been revealed yet, but it will likely be lower than the $900 OnePlus 13.\nI found the easiest way to clean USB ports\nIt's easy for dust and lint to build up in your device's USB port, but luckily, it just as easy to clean it."
    },
    {
      "url": "https://www.pocket-lint.com/samsung-s26-edge-replacing-plus/",
      "text": "Summary\n- Samsung's upcoming Galaxy S26 series may include the Galaxy S26, S26 Edge, and S26 Ultra.\n- The Galaxy S26 Edge is expected to replace the Plus model in Samsung's lineup, with no S26+ model next year.\n- Apple is expected to do something similar later this year, with the iPhone 17 Air rumored to be replacing the Plus model iPhone in the iPhone 17 series.\nNow that Samsung has unveiled its new foldable devices, including the Z Fold 7, Flip 7, and Flip 7 FE, the rumor mill for next year's Galaxy S26 series is in full swing. Samsung is widely expected to release its next smartphone series early next year. However, a major change is anticipated in the usual lineup.\nEarlier this year, Samsung launched the Galaxy S25 Edge, its new ultra-slim smartphone, which remains powerful despite its lightweight and thin design. Now, its successor might play an important role in Samsung's main S26 lineup. According to The Elec (via Tech Radar), Samsung reportedly plans to launch only three devices for the S26 series: the Galaxy S26, Galaxy S26 Edge, and Galaxy S26 Ultra.\nThis suggests that the Galaxy S26 Edge will likely replace the Plus model in Samsung's Galaxy S26 lineup in the upcoming year. As a result, it's possible there won't be a Galaxy S26+ next year, and the Galaxy S25+ could be the last Plus model we'll see from Samsung for the foreseeable future.\nSamsung Galaxy S25 Edge\n- Brand\n- Samsung\n- SoC\n- Octa-core Snapdragon 8 Elite (3nm)\n- Display\n- 6.7-inch 3120 x 1440 pixel resolution QHD+ Dynamic AMOLED2X\n- RAM\n- 12GB\n- Storage\n- 256GB / 512GB\n- Battery\n- 3,900 mAh\nThe Galaxy Z Fold 7 is Samsung's best foldable yet, but it'll cost you $2,000\nThe Galaxy Z Fold 7 is Samsung's most impressive foldable ever. Its price? Not so much.\nSamsung may be echoing Apple's plans\nSamsung's S25 Edge phone is similar to the S25+\nWhen Samsung first revealed the Galaxy S25 Edge, I had a sinking feeling it might one day replace the Plus in the lineup. The S25 Edge is essentially a slimmer version of the S25+, with one less rear camera and a smaller battery. Aside from that, they're very similar, so it makes sense why Samsung would do this, especially if the S26 Edge has improvements that make it nearly on par with a Plus phone (hopefully a larger battery).\nWhat I find most interesting about this potential move from Samsung is that it's widely expected to be similar to what Apple is doing this year with the iPhone 17 Air. For months, there have been leaks about the iPhone 17 Air potentially replacing the Plus model in Apple's iPhone 17 series. And if those leaks are true, and Apple proceeds, and this news about the S26 Edge is accurate, then Samsung is essentially doing the same thing -- goodbye, Plus phones, hello slimmer models.\nI use the S25+ daily, so I'll be sad to see it go next year if it happens. It's a great size at 6.7 inches and relatively slim at 7.3mm, but it's still not as thin as the S25 Edge's 5.8mm thickness. Additionally, The Elec reports that the screen sizes for the S26 series will mostly stay the same as this year, with the S26 reportedly featuring a 6.27-inch display, the S26 Edge having a 6.66-inch display, and the S26 Ultra sporting a 6.89-inch display. It's worth noting that there have been reports suggesting Samsung might keep the Plus model around if the S25 Edge doesn't sell well, so the S26 Edge replacing the S26+ might not be a forgone conclusion.\niPhone 17 potential launch date revealed\nThe launch of the iPhone 17 series is coming soon, and significant changes are expected this year."
    },
    {
      "url": "https://www.pocket-lint.com/google-pixel-10-series-details-you-might-have-missed/",
      "text": "Summary\n- Google officially unveiled its Pixel 10 lineup of smartphones at a hardware keynote in New York City on August 20.\n- These new flagship phones bring much-hyped additions to the table, including built-in Qi2 magnets, all-new Tensor processors, and brighter OLED displays.\n- However, there are several smaller details that Google didn't mention in its presentation -- here are five in particular.\nOn Wednesday, Google officially unveiled its next-generation of Android smartphones: the Pixel 10 series. This all-new flagship lineup consists of the standard Pixel 10, the higher-end Pixel 10 Pro, the plus-sized Pixel 10 Pro XL, and the book-style Pixel 10 Pro Fold.\nGoogle's hardware keynote was informative when it came to core device specifications, including important details about the new Tensor G5 chipset, the built-in array of Qi2 wireless charging Pixelsnap magnets, the Fold's industry-first IP68 water and dust resistance rating, as well as general pricing and availability.\nHowever, the search giant's New York City-based presentation, which was hosted by late-night show host Jimmy Fallon, also left out some key details about the Pixel 10 et al. Some genuinely interesting new hardware and software additions were brushed under the rug, as were a couple of questionable product decisions.\nHere are five Pixel 10 series details that you probably missed, even if you tuned into the Made by Google live stream last week.\n-\nPixel 10\n- Brand\n- SoC\n- Tensor G5\n- Display\n- 6.3-inch Actua Display 1080 x 2424 pixel resolution OLED (60-120Hz)\n- RAM\n- 12GB\n- Storage\n- 128GB/256GB\n- Battery\n- 4,970mAh\nGoogle's Pixel 10 features the tech giant's new Tensor G5 chip and a three-camera setup for the first time that includes a 10.8-megapixel telephoto camera.\n- Ports\n- USB-C\n- Operating System\n- Android 16\n- Front camera\n- f/2.2 10.5-megapixel\n- Rear camera\n- Wide f/1.7 48-megapixel, f/2.2 13-megapixel, f/3.1 10.8-megapixel\n- Charge speed\n- Fast charging – up to 55% in about 30 minutes using 30W USB-C\n-\nPixel 10 Pro\n- Brand\n- SoC\n- Tensor G5\n- Display\n- 6.3-inch Super Actua display 1280 x 2856 pixel resolution OLED (1-120Hz)\n- RAM\n- 16GB\n- Storage\n- 128GB, 256GB, 512GB, 1TB\n- Battery\n- 4,870mAh, 30+ hours of battery life\nThe Pixel 10 Pro features Google's new Tensor G5 chip, 16GB of RAM, and 128GB, 256GB, 512GB or 1TB of storage. The smartphone's overall design looks very similar to its predecessor, including its sprawling camera bump.\n- Ports\n- USB-C\n- Operating System\n- Android 16\n- Front camera\n- 42-megapixel f/2.2 selfie camera\n- Rear camera\n- 50-megapixel f/1.68 wide camera, 48-megapixel f/1.7 ultrawide camera, 48-megapixel f/2.8, telephoto camera with 5x optical zoom\n- Charge speed\n- 30+ hour battery life Up to 100-hour battery life with Extreme Battery Saver\n-\nPixel 10 Pro XL\n- Brand\n- SoC\n- Tensor G5\n- Display\n- 6.8-inch Super Actua display 1344 x 2992 pixel resolution OLED (1-120Hz)\n- RAM\n- 16GB\n- Storage\n- 256GB, 512GB, 1TB\n- Battery\n- 5,200mAh, 30+ hours of battery life\nThe 6.8-inch Pixel 10 XL features the same specs as the Pixel 10, including Google's Tensor G5 chip, 16GB of RAM, and a suite of Gemini AI-powered features.\n- Ports\n- USB-C\n- Operating System\n- Android 16\n- Front camera\n- f/2.2 42-megapixel\n- Rear camera\n- Wide f/1.68 50-megapixel, ultrawide f/1.7 48-megapixel, telephoto f/2.8 48-megapixel\n- Charge speed\n- Fast charging – up to 70% in about 30 minutes7 – using 45W USB-C, Pixelsnap wireless charging (Qi2.2-certified) up to 25W\n-\nPixel 10 Pro Fold\n- Brand\n- SoC\n- Tensor G5, Titan M2 security processor\n- Display\n- 6.4-inch 120Hz 2364 x 1080 pixel resolution OLED Actua outer display, 8-inch 120Hz 2076 x 2152 pixel resolution OLED Super Actua Flex inner display\n- RAM\n- 16GB\n- Storage\n- 256GB, 512GB\n- Battery\n- 5,015mAh\nThe Pixel 10 Pro Fold is Google's third-generation book-style foldable phone, with a Tensor G5 processor, a slightly larger 6.4-inch cover display, and full IP68 water and dust resistance.\n- Ports\n- USB-C\n- Operating System\n- Android 16\n- Front camera\n- 10-megapixel f/2.2 (Main Screen), 10-megapixel f/2.2 (Cover Camera)\n- Rear camera\n- 48-megapixel f/1.7 wide, 10.5-megapixel f/2.2 ultrawide, 10.8-megapixel f/3.1 telephoto\n- Charge speed\n- Qi2\n1 Say goodbye to physical SIM in the US\nThis year, eSIM is your only option unless you're picking up a foldable\nThat's right -- with the Pixel 10 series, Google is following in the footsteps of Apple by forgoing physical Nano SIM card slots entirely in the US market. All Pixel 10 phones sold in the United States (except for the 10 Pro Fold) will instead rely exclusively on eSIM, which is a digital technology that simulates a traditional SIM card virtually.\nIt's clear that, like Apple, Google is keen to push the industry in the direction of eSIM ubiquity, which has its pros and cons. On the bright side, there's more room inside the phone for other components, and it's impossible for a bad actor to remove your SIM card without your consent. On the other hand, it can still be a pain to transfer eSIMs from one device to the next, and it can sometimes make traveling an exercise in frustration.\nFor those outside the US, Pixel 10 series devices will continue to include a dedicated Nano SIM tray, while also including support for eSIM out of the box. There are sure to be some growing pains during this transitional process, but I hope in the long run this will all be worth it when a more robust eSIM ecosystem extends its reach across the entire globe.\n2 AOD gets an upgrade (assuming you're a Pro)\nIf you opt for the 10 Pro or 10 Pro XL, you can enjoy a more colorful Always-On Display\nThanks to some investigative work from APK teardown specialists over at Android Authority, we've known for some time now that Google has been working on updating the Pixel's Always-On Display (AOD). Now that Pixel 10 series units are officially out in the wild, it has been confirmed that yes, indeed, there is an upgraded AOD experience on offer.\nSpecifically, the Pixel 10 Pro and Pixel 10 Pro both feature a new AOD setting that showcases a dimmer and blurrier version of your lock screen wallpaper at all times -- a feature we've become familiar with in recent years from the iPhone and from certain other Android hardware makers.\nThankfully, this more colorful AOD mode is an optional experience, with a simple toggle available in settings to revert to a minimalistic black AOD for those who prefer it. It's worth noting that only the slab-style Pro Pixel 10 models are receiving this upgraded experience, likely owing to their use of LTPO display tech with a more flexible variable refresh rate when compared to the vanilla Pixel 10 and the Pixel 10 Pro Fold.\n3 Thread radios have finally arrived\nFor the first time on Android, Thread is built right into the Pixel 10 series\nThread is a low-powered mesh networking protocol co-created by Google, Samsung, Apple, Qualcomm, and several other tech titans via the Thread Group alliance. Thread is designed to improve the experience of using smart home and Internet of Things (IoT) devices, by creating a more reliable, stable, and fluid wireless connection. Theoretically, the more Thread-enabled devices join the fray, the more effective the system as a whole will become.\nUntil now, the only high-profile mobile devices to have shipped with Thread radios have been from Apple, but this all changes with the Pixel 10 series. All four Pixel 10 models include built-in Thread support, which is an excellent bit of futureproofing that might come in handy within the seven-year lifespan of these handsets. With Thread in tow, commands can be sent directly from a Pixel 10 to a compatible smart device, sidestepping the need to interface with an external Thread Border Router.\n4 The Pixel 10's main camera is actually nerfed\nThe camera situation on the vanilla Pixel 10 is a double-edged sword\nGoogle rightfully highlighted the base-level Pixel 10's all-new triple rear camera setup at its keynote, which brings a dedicated 5X telephoto lens to the standard Pixel for the very first time. This inclusion makes the non-Pro Pixel 10 a far more flexible photography system than the Pixel 9, with the new zoom sensor perfectly complimenting the existing wide angle and ultra-wide angle focal lengths.\nHowever, the devil is in the details with this one: the Pixel 10's wide-angle and ultra-wide cameras have actually been nerfed when compared to the ones found on its direct predecessor, at least from an optical hardware standpoint. The Pixel 10's main shooter is of 48-megapixel resolution with a 1/2-inch sensor size, matching that of the mid-range Pixel 9a from earlier this year. By contrast, the Pixel 9's main camera was 50-megapixels with a 1/1.31-inch sensor size.\nAs for the ultra-wide lens, the Pixel 10 gets a 13MP ultra-wide sensor at a 1/3.1-inch sensor size, down from the Pixel 9's 48-megapixel lens at a size of 1/2.55 inches. The former also looses out on the latter's autofocus, which is a genuine shame in my opinion. And, so, while it's nice that the base-level Pixel finally has a triple array of rear cameras ( beating Apple to the punch), they're not quite as high-end as the ones found on the 10 Pro and 10 Pro XL.\n5 The Pixel 10 Pro XL offers additional peaks\nGoogle outfitted this year's oversized XL variant with some additional tech specs\nAs someone who prefers compact handsets, I appreciate Google's commitment to offering its highest-end Pixel 10 Pro lineup in two size classes. However, despite most specifications being a one-to-one match across both models, the Pixel 10 Pro does enjoy a few small-yet-noteworthy benefits over its smaller Pixel 10 Pro counterpart.\nAs it turns out, the 10 Pro is the only handset in the Pixel 10 lineup to support the very latest Qi2.2 wireless charging specification, which unlocks 25W of Pixelsnap power delivery as opposed to the 15W found on the other units. The Pixel 10 Pro XL is also the only model to support 45W of wired charging, besting the 30W of its non-XL counterpart.\nI'm cynical about Google's less than generous storage offering on the Pixel 10 Pro.\nAdditionally, the Pixel 10 Pro XL is the only model to start at 256GB of storage, with the smaller model shipping with a base configuration of 128GB. For 2025, I'd certainly expect both models to ship with the more roomy 256GB by default, especially when taking into account how much internal storage is taken up out of the box by the Android system and various on-device AI models.\nI'm cynical about Google's less than generous storage offering on the Pixel 10 Pro, but I can at least see the justification behind the decision to throttle charging speeds. Both Pro models utilize a vapor cooling system (as opposed to the vanilla Pixel 10's graphene cooling system), but the smaller footprint of a non-XL phone is sure to create engineering challenges when it comes to thermal performance, heat management, safety, and overall battery longevity."
    },
    {
      "url": "https://www.pocket-lint.com/until-apple-fixes-iphone-telephoto-cameras/",
      "text": "Summary\n- The iPhone 16 Pro's telephoto camera is sorely in need of upgrades to resolution and light sensitivity, since it produces noise and blur the main camera doesn't.\n- Telephoto quality is extremely important -- zoom produces better portraits, and in some cases, it's the only way of meaningfully capturing a subject.\n- It would make sense for Apple to stuff the iPhone 16 Pro's primary sensor into the 17 Pro's telephoto camera in fall 2025, but the company can be unpredictable sometimes.\nWhen I decided to upgrade from an iPhone 13 to an iPhone 16 Pro last fall, one of the major incentives was gaining a telephoto lens. There were other reasons, of course -- such as an always-on display, and Apple Intelligence compatibility for testing purposes -- but the telephoto was arguably more important. Coming from a pro photography background, I've always bristled at the idea of being limited to a 24mm main lens or a 13mm ultra-wide, at least without buying into third-party add-on kits that may or may not be usable the next time I upgrade.\nI have to admit, though, I've been a little disappointed with the 16 Pro's telephoto now that I've used for nearly 10 months. I'm glad I have it, and I continue to use it occasionally -- but it's made me question the value of buying Pro iPhones in general, especially since the base iPhone 17may finally get an always-on display too.\nApple iPhone 16 Pro\n- Brand\n- Apple\n- SoC\n- A18 Pro (3nm)\n- Display\n- 6.3-inch 1,206 x 2,622 pixel resolution 120Hz LTPO Super Retina XDR OLED, 120Hz, HDR10, Dolby Vision, 1000 nits (typical), 2000 nits (peak)\n- Storage\n- 128GB, 256GB, 512GB, 1TB\n4 changes I make immediately on a new iPad\nApple doesn't deliver the best iPad experience out of the box, but it's not far out of reach.\nWhat's wrong with the iPhone 16 Pro's telephoto camera?\nPromises versus practice\nOn paper, it should be excellent. It has a 120mm focal length, an f/2.8 aperture, and sensor-shifting optical image stabilization (OIS) to reduce motion blur. It's true that a lot of pro camera lenses will have longer focal lengths, and/or adjustable zoom -- my favorite Nikon lens was a Nikkor 80-200mm f/2.8 -- but 120mm is a great length for portraits, as well as some events if you're not in the nosebleeds.\nVery quickly, though, I learned that the sensor in the telephoto is substantially worse than the one in the main camera. It's not about megapixel count, although 12 megapixels will naturally produce less detail and room for cropping than the main camera's 48 megapixels. No, the real issues are light sensitivity and stabilization, one or both of which need to be better.\nThe real issues are light sensitivity and stabilization, one or both of which need to be better.\nIn bright conditions, mostly midday sun, the telephoto does a decent job. I've used it to take many a photo of my son playing at the park. But the moment things transition from \"bright\" to just \"well-lit,\" visible noise starts to creep in. Photos with purely indoor lighting can be a crapshoot -- some turn out fine, but others look like I'm shooting on a phone a decade old, even when the lighting isn't that different. It's often impossible to take an indoor action shot -- I've seen excessive motion blur that made me question whether OIS was working at all.\nYou might say it's unfair to expect high quality from something much cheaper and smaller than pro-level equipment, but that argument falls apart when you look at images from the 16 Pro's main camera. They're roundly excellent, even in low light -- I've shot photos at night or in dark rooms that my old Nikon D300 could never have achieved. Clearly, Apple made an intentional decision to use an inferior telephoto sensor. It almost feels insulting when you consider that here in Canada, a 16 Pro starts at $1,449 CAD. I'd feel legitimately ripped off if I'd spent $1,749 CAD on a Pro Max.\nI like my smartphones bright - here's what you need to know about phone brightness\nIt's nice to have the brightest screen possible, but you shouldn't necessarily take advantage of it.\nHow Apple can fix its telephoto cameras\nObvious and not-so-obvious changes\nApple should at least upgrade its telephoto sensors to match its main ones. A telephoto can be as important as a primary camera, if not moreso -- it's not only better for portraits, but often the only way of capturing a subject in any meaningful detail. Let's say you're at a wedding reception -- the gap between a 24mm lens and a 120mm one might mean the difference between filling the frame with the couple or mostly seeing the dance floor, and you shouldn't have to opt for the wider shot because the sun isn't directly overhead. You also shouldn't have to cross your fingers that a telephoto shot can be used uncropped.\nI'd like to see improvements to image stabilization too, but that might be a tall order in the design space smartphone cameras have to work with. The most important thing is a sensor with better low-light sensitivity -- any new OIS tech will be icing on the cake.\nSince the iPhone 17 Pro is rumored to be sticking to the same magnification as the 16 Pro, at some point, Apple's going to have to crack and move beyond 5x zoom. Samsung's Galaxy S25 Ultra can produce a 10x \"optical quality\" zoom, thanks to a 5x lens with a croppable 50-megapixel sensor. The leap between 5x and 10x isn't trivial. I find that a 200mm lens or longer is often needed for scenarios like concerts and wildlife, so the 16 Pro's 120mm can still fall well short.\n5 tips for phone photographers that make your pictures not suck\nYou can do a lot with a little if you think like a pro.\nThe prospects for a telephoto upgrade\nSooner or later...\nI wouldn't be surprised to see the iPhone 17 Pro bump its telephoto to the same 48-megapixel sensor found in the 16 Pro's main camera. Apple loves recycling parts, especially in a way that lets it spin them as an upgrade -- just look at the M3 chip in the iPad Air, or any given Apple TV 4K upgrade. It's also likely feeling pressure to compete with Samsung, not to mention Google, which put a 48-megapixel 5x camera in the Pixel 9 Pro. The Pixel 10 Pro is right around the corner, and it would look terrible if the IPhone 17 Pro was stuck with a quarter the resolution for years running.\nApple needs to wow me with real-world telephoto performance before I'll consider dropping money on another Pro iPhone.\nI'm surprised at what Apple will put up with, sometimes, so it's hard to say much with confidence. What I will say is that Apple needs to wow me with real-world telephoto performance before I'll consider dropping money on another Pro iPhone -- I can make 2x zoom work if I have to in order to save hundreds of dollars. That's money that could be put towards a better standalone camera.\nEverything you need to know about PEVs, or personal electric vehicles\nYou can use PEVs like e-bikes and scooters to explore, run errands, or speed up your commute."
    },
    {
      "url": "https://www.pocket-lint.com/should-you-buy-regular-iphone-16-or-iphone-16-pro/",
      "text": "Summary\n- The iPhone 16 Pro offers a larger display and flagship camera features.\n- The iPhone 16 Pro features better battery life and USB 3.0 data speeds.\n- For most, the regular iPhone 16 is good enough.\nAs a tech shopper, one tactic you have to be prepared for is something known as a price ladder. Apple is infamous for it -- the company offers a (relatively) cheap entry option in a product category, but the price increases in a way that makes you feel like you'd be crazy not to spend another $50, $100, or even $200 to step up to better features. For a non-iPhone example, consider the Apple Watch Series 10 -- if you get a 46mm titanium model, you're just $50 away from owning an Ultra 2.\nThat's in full effect with the iPhone 16 series, since there are Plus, Pro, and Pro Max tiers. We're going to tackle the most fundamental split, however, which is whether to look at one of the Pro models. The best iPhone features are reserved for Pro models, but you may not need them as much as you think you do.\nThe 4 biggest iPhone 16 series issues I've found so far\nBe on the lookout if you've got a launch-day iPhone.\nWhat are the iPhone 16 Pro's advantages?\nSuperior display technology\nPro displays are bigger. Whereas the standard iPhone 16 is 6.1 inches, even the smallest Pro is 6.3 inches, and that goes up to 6.9 inches on the Pro Max -- nearly as large as some tablets. If you don't care about the Pro Max's other perks, you can save a little money on size by choosing the 6.7-inch 16 Plus.\nProMotion makes iOS feel a lot smoother.\nThe Pro also remains the only iPhone with ProMotion, Apple's branding for a dynamic 120Hz refresh rate. This makes iOS feel a lot smoother and enables always-on display (AOD) features, since the Pro can scale back refresh rates to conserve power. iOS' lockscreen widgets and StandBy modes don't have much use without AOD. The iPhone 16 and 16 Plus are locked at a constant 60Hz, no matter what they're running.\nA better camera system\nThe 16 and 16 Plus are equipped with just two rear cameras: a 48-megapixel main (wide-angle) with optical stabilization, and a 12-megapixel ultra-wide. The Pro and Pro Max share that main camera, but also sport a 48-megapixel ultra-wide and a 12-megapixel 5x telephoto with optical stabilization. Simply put, you get sharper ultra-wide and macro images, and there's no alternative if you want an iPhone that can zoom past 2x without cropping.\nThere's no alternative if you want an iPhone that can zoom past 2x without cropping and ugly pixelation.\nPro models also get support for ProRAW photo files and ProRes video recording. These offer maximum quality and flexibility, but shouldn't be a factor when shopping unless you're a professional. In fact, file sizes can be problematic. If you want to shoot in 4K ProRes at 60 or 120 frames per second, Apple forces you to connect to an external USB-C storage drive, even if you own a 1TB Pro. Incidentally, only Pros have a 1TB storage option -- otherwise you're limited to 128GB, 256GB, or 512GB.\nIs the iPhone 16 Pro worth buying for photographers and videographers?\nCalling something Pro doesn't always make it professional.\nA (slightly) faster processor\nThe iPhone 16 Pro is equipped with the A18 Pro, Apple's most advanced phone processor. The chip includes a six-core CPU, a six-core GPU, and a 16-core Neural Engine for Apple Intelligence and other AI tasks. It's not radically faster than the A18 in the iPhone 16 and 16 Plus, though. The only difference is that the A18 uses a five-core GPU, so it won't perform as well with graphics-heavy tasks like 3D gaming. However, the iPhone 16 isn't a slouch in that department either.\nBattery life and connectivity\nThe regular iPhone 16 is rated for 22 hours of video playback, while the 16 Plus gets 27. The iPhone 16 Pro starts with 27-hours of battery, which increases to 33 hours if you choose a Pro Max. Just remember that real-world performance is likely to be lower, since most people engage in a variety of activities, from playing games to updating apps.\nAll iPhones are now equipped with USB-C ports instead of Lightning, but for whatever reason, only the iPhone 16 Pro supports USB 3.0 data speeds. That makes transfers up to 20 times faster than the iPhone16 and 16 Plus, which are capped at the same USB 2.0 speeds as Lightning.\nTougher construction\nPro models are built around Grade 5 titanium shells. That should, in theory, make them stronger than the iPhone 16 and 16 Plus, which use aluminum, but I'd still recommend using a case. The metal coating Apple uses is prone to scratching, and all iPhones have plenty of glass to break. That glass may be reinforced, but even the Ceramic Shield glass on the front can crack or scratch under difficult circumstances.\nThe best iPhone 16 Pro cases to keep your new phone safe and stylish\nKeep your new iPhone 16 Pro looking like new and functioning like a dream for years to come.\nShould you get a regular iPhone 16 or a 16 Pro?\nDon't succumb to tech lust\nFor most shoppers, the answer should be no, since the gap between Pro and cheaper iPhones is smaller than ever, at least in daily usage. All iPhone 16 models have USB-C, MagSafe charging, and customizable Action and Camera Control buttons. The value of bigger screens is subjective, and a 60Hz refresh rate is fine if you're used to it. It's just hard to go back once you've experienced a Pro's 120Hz and always-on display features. Similarly, while the A18 Pro does rate faster in benchmarks -- as PCMag notes -- you'll rarely notice a difference versus the A18 unless you play a lot of 3D games.\nFor most shoppers, the answer should be no since the gap between Pros and regular iPhones is smaller than ever, at least in daily usage.\nThe Pro's cameras could be more compelling for some people, since a 5x telephoto makes a world of difference in terms of what you can capture. Events and distant scenery may make a telephoto almost mandatory. You can still snap high-quality 2x photos with the iPhone 16 and 16 Plus, however, and that's usually plenty with subjects like friends and family.\nSo, who should buy an iPhone 16 Pro? Mostly people that need the best possible photo and video options on an iPhone, whether that's for professional reasons or replacing a standalone camera. If you work within their zoom and sensitivity limits, the iPhone 16 Pro can capture content on par with cameras costing twice as much.\nYou may be eyeing the iPhone Pro Max in particular if you're a frequent traveler, but don't think you need one. 33 hours of battery is impressive, but the 27 hours on the Plus should be more than enough for most people, especially if you've got a battery pack you can use. I'd only choose a Pro Max if I had money to burn or really did need the best of everything, not just battery performance."
    }
  ],
  "argos_summary": "Samsung is set to launch a streamlined Galaxy S26 series with only three models—S26, S26 Edge, and S26 Ultra—dropping the Plus variant. The S26 Edge will likely replace the S26+, featuring a slightly larger 6.27‑inch display and a 4,300‑mAh battery, while the S26 Ultra is expected to push optical zoom beyond 5×. Samsung may also upgrade telephoto sensors, improve battery life, and adopt Qi2 wireless charging to stay competitive with Apple’s iPhone 17 and Google’s Pixel 10. The launch is anticipated in late January 2026.",
  "argos_id": "OBUPWED7P"
}