{
  "url": "https://www.slashgear.com/1950363/cars-nissan-never-should-have-discontinued/",
  "authorsByline": "Ivo Gievski",
  "articleId": "713f2bdadb9f4329b0a121b47a09ca95",
  "source": {
    "domain": "slashgear.com",
    "paywall": false,
    "location": null
  },
  "imageUrl": "https://www.slashgear.com/img/gallery/3-more-cars-nissan-never-should-have-discontinued/l-intro-1755771806.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-30T23:30:00+00:00",
  "addDate": "2025-08-30T23:38:11.751644+00:00",
  "refreshDate": "2025-08-30T23:38:11.751646+00:00",
  "score": 1.0,
  "title": "3 More Cars Nissan Never Should Have Discontinued",
  "description": "Nissan once built icons like the Silvia, Maxima, and Cube. Here’s why these discontinued models still matter and deserve a comeback.",
  "content": "3 More Cars Nissan Never Should Have Discontinued\n\nIt's safe to say that today, Nissan is a shadow of its former self. The company has suffered serious financial difficulties in recent years, leading to plant shutdowns and discontinued models. During the 1990s, Nissan was the second-largest Japanese automaker in terms of market share, behind Toyota. Today, it's in third place. But it's not just sales that have dipped. Take a look at Nissan's 2025 model range. You'll see the usual lineup of SUVs, cheap passenger cars, and the odd truck. Ah, yes, and we shouldn't forget the fast and fun Nissan Z. Yes, the Nissan Z sits on the FM platform, which dates back to the 350Z, but it's a nice sports car nevertheless. Other than that, though, nothing really stands out. There is no GT-R anymore to attract new Nissan enthusiasts. And no Xterra for real off-road aficionados. These are just two of the five discontinued models we wish were still available today. But you know what? We think there is room for three more discontinued Nissans we'd love to see back. This time, we focused on fun and quirky cars, while still including a mass-market favorite. Let's have a closer look.\n\nThe Silvia, also known as the 240SX, 200SX, and 180SX internationally, is one of the most beloved Nissan cars among car enthusiasts. It was the Toyota GR86/Subaru BRZ of its day — a relatively affordable RWD sports car with an incredibly balanced chassis. The Silvia handled so well, in fact, that it became one of the best drift cars ever. It was tail-happy but controllable, thanks to its low weight and multi-link rear suspension. It was cheap, too, allowing even cash-strapped enthusiasts an entry into the sport. But that was only part of its appeal. Spanning across seven generations, the Silvia was also powered by some great engines, like the legendary SR20DET. Highly tunable, supporting builds of over 600 hp, it holds a special place in Nissan's pantheon of great engines. Still, the SR20DET was a beast even without tuning. The 2.0-liter turbocharged four-cylinder produced almost 250 hp in the last S15-generation Spec-R. Given the Spec-R's weight of just 2,734 pounds, the turbo-four propelled the Silvia to 62 mph (100 km/h) in just 5.5 seconds. The Spec-R wasn't only fast — it also had four-wheel HICAS steering, a limited-slip differential, and aluminum suspension components for the best possible handling. In other words, this was no barebones sports car but a showcase of Nissan's engineering prowess — in a more affordable, down-to-earth body. A GT-R for the masses, if you will. Yes, the U.S. never got the legendary models — the 240SX available stateside was powered by the paltry 2.4-liter KA24 engine family. But that didn't hurt the 240SX's reputation as a drift car, especially since SR20DET swaps are straightforward.\n\nThe Maxima certainly doesn't have the cachet of the Silvia, particularly among car enthusiasts. But of course, it didn't. The Maxima was a large mass-market sedan designed to fit the needs of American buyers, not to lure them with performance and excitement. As far as sedans go, though, it was a damn good one. Always equipped with six-cylinder engines, the Maxima had enough power to move the big body. For instance, the last 2023 Maxima came standard with a potent 3.5-liter V6 with 300 hp, enough for a 0-60 sprint of just 5.7 seconds. That's quick for a family-oriented sedan. Yes, we won't avoid the CVT elephant in the room. The Maxima has been equipped with a continuously variable transmission since 2007, and it has plagued the model ever since. The CVT didn't get along with the Maxima's sharp handling, and it also had its fair share of reliability issues. Still, let's not forget that the Maxima was a large, FWD, family-oriented sedan. The fact that it handled well was actually a welcome bonus. So, it still makes us quite sad that Nissan discontinued the Maxima in 2023 after 42 years in service. With the Altima and Versa also on the chopping block next year, Nissan's range will largely consist of crossovers and SUVs. The only sedan left will be the Sentra, which should be completely redesigned for the 2026 model year.\n\nThe Cube is the perfect example of the state of affairs at Nissan. Can you even imagine the Japanese automaker launching something as quirky as the Cube today? Out of the question. The Cube was a brave move — something Nissan sorely needs today. It was a middle finger to convention. It dared to be different. See, asymmetry was the name of the game with the Cube. The left side had a sizeable C-pillar, while the right side had wraparound rear glass. This eccentric approach, rooted in Japanese culture, gave the Cube youthful, fun vibes. Cartoonish, even. But even more impressive is the fact that designer Tadamasa Hayakawa succeeded in giving a simple cube-like car an organic quality, borrowing curved lines from 1950s fridge doors. But the cube-like body also had a purpose — maximizing interior space. The Cube sold in the U.S. was actually the third-gen model; the previous two generations were already on sale in Japan, where space is at a premium. The first-gen model had a more traditional design, while the second-gen model brought asymmetrical styling, but each one was designed with a roomy cabin in mind. Heck, there was even a seven-seat version called the Cubic. Crucially, though, the cabin had the same quirky style as the exterior, with fun colors and rounded surfaces. Powered by a 1.8-liter four-cylinder engine, the Cube was never great behind the wheel. Still, it was fun because it was cheap and tiny, yet offered enough space for adults. So, in an era full of huge SUVs, we are of course sad Nissan discontinued the Cube in 2014.",
  "medium": "Article",
  "links": [
    "https://www.slashgear.com/1746283/discontinued-nissan-models-we-wish-available-today/",
    "https://global.nissannews.com/en/heritage_model_silvia",
    "https://usa.nissannews.com/en-US/search?query=maxima&selectedTabId=us-united-states-nissan-photo-galleries&gallery=release-bf474e990500454c1e768fb260611cb4&viewallTab=photos",
    "https://www.slashgear.com/923878/14-best-drift-cars-ever-made/",
    "https://www.slashgear.com/1568983/2024-nissian-z-nismo-review-fast-0-to-60-speed-driving-experience-details/",
    "https://www.slashgear.com/1674345/why-nissan-discontinue-nissan-maxima/",
    "https://usa.nissannews.com/en-US/search?query=cube&selectedTabId=us-united-states-nissan-photos",
    "https://www.slashgear.com/1812313/nissan-cube-discontinued-reason/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Nissan",
      "weight": 0.078793354
    },
    {
      "name": "new Nissan enthusiasts",
      "weight": 0.078201234
    },
    {
      "name": "car enthusiasts",
      "weight": 0.076598816
    },
    {
      "name": "discontinued models",
      "weight": 0.07554822
    },
    {
      "name": "cheap passenger cars",
      "weight": 0.07402893
    },
    {
      "name": "Maxima",
      "weight": 0.055308662
    },
    {
      "name": "Cube",
      "weight": 0.052543376
    },
    {
      "name": "great engines",
      "weight": 0.05103994
    },
    {
      "name": "enough space",
      "weight": 0.049842626
    },
    {
      "name": "fun colors",
      "weight": 0.04963179
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Auto"
    }
  ],
  "taxonomies": [
    {
      "name": "/Autos & Vehicles/Vehicle Shopping/Vehicle Specs, Reviews & Comparisons",
      "score": 0.8408203125
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.642578125
    },
    {
      "name": "/Autos & Vehicles/Motor Vehicles (By Type)/Trucks, Vans & SUVs",
      "score": 0.465087890625
    },
    {
      "name": "/Business & Industrial/Automotive Industry",
      "score": 0.4482421875
    }
  ],
  "sentiment": {
    "positive": 0.2697503,
    "negative": 0.36365402,
    "neutral": 0.3665957
  },
  "summary": "Nissan, once the second-largest Japanese automaker in terms of market share in the 1990s, has experienced significant financial difficulties and discontinued models. The company, which once held a significant market share, is now in third place. The Nissan Z is a nice sports car, but the company's 2025 model range includes SUVs, cheap passenger cars, and trucks. The Silvia, also known as the 240SX, 200SX and 180SX internationally, is one of the most beloved Nissan cars among car enthusiasts. The Maxima was a popular mass-market sedan designed to appeal to American buyers, not necessarily to impress them with performance and excitement. However, the Maxima's performance and reliability issues have plagued the car. The last 2023 Maxima came standard with a 3.5-liter V6 with 300 horsepower, enough for a 0-60 sprint of just 5.7 seconds. The former GT-R and Xterra are also mentioned as two of the five discontinued models we wish were still available today.",
  "shortSummary": "Nissan's discontinued models like the Silvia and Maxima were ideal additions to our daily lives, but overall they lack the high-end appeal and reliability.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "910fded86b104df9b3927e6d5435f733",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://usa.nissannews.com/en-US/search?query=maxima&selectedTabId=us-united-states-nissan-photo-galleries&gallery=release-bf474e990500454c1e768fb260611cb4&viewallTab=photos",
      "text": "USA\nNewsroom\nModels\nOpen Models\nAll Models\nElectric Vehicles\nOpen Electric Vehicles\nAriya\nLEAF\nCrossovers and SUVs\nOpen Crossovers and SUVs\nArmada\nKicks\nMurano\nPathfinder\nRogue\nCars\nOpen Cars\nAltima\nMaxima\nSentra\nVersa\nSports Cars\nOpen Sports Cars\nZ\nGT-R\nTrucks\nOpen Trucks\nFrontier\nTITAN\nConcepts\nPress Kit Archive\nNews\nOpen News\nAll News Releases\nNissan Stories\nMotorsports\nOpen Motorsports\nFormula E\nNissan Z GT4\nU.S. Sales Reports\nGlobal Financial Results\nTechnology & Safety News\nAwards & Accolades\nGalleries\nOpen Galleries\nCurrent Models\nCompany Logos\nEmployees\nPhilanthropy\nPhotos\nVideos\nB-Roll\nCorporate\nOpen Corporate\nLeadership\nOpen Leadership\nExecutive Biographies\nManagement Announcements\nFacilities\nPhilanthropy\nHeritage\nTechnology Library\nSpeaker Request Form\nManufacturing\nOpen Manufacturing\nPlant Tours\nNissanManufacturing.com\nEvents\nWhat's New\nNissan Stories\nManufacturing\nEmail Alerts\nRegions\nContacts\nNo Saved Items\nSaved Item\nSaved Items\nEmail Alerts\nRegions\nContacts\nModels\nAll Models\nElectric Vehicles\nAriya\nLEAF\nCrossovers and SUVs\nArmada\nKicks\nMurano\nPathfinder\nRogue\nCars\nAltima\nMaxima\nSentra\nVersa\nSports Cars\nZ\nGT-R\nTrucks\nFrontier\nTITAN\nConcepts\nPress Kit Archive\nJune 24, 2025\n2026 Nissan Armada debuts exciting new NISMO version\nJune 17, 2025\nThe iconic EV reimagined: Nissan unveils all-new third-generation LEAF\nNews\nAll News Releases\nNissan Stories\nMotorsports\nFormula E\nNissan Z GT4\nU.S. Sales Reports\nGlobal Financial Results\nTechnology & Safety News\nAwards & Accolades\nJuly 23, 2025\nBattle-tested: Nissan quality isn’t just promised – it’s recognized\nJuly 1, 2025\nNissan Group reports 2025 second quarter U.S. Sales\nGalleries\nCurrent Models\nCompany Logos\nEmployees\nPhilanthropy\nPhotos\nVideos\nB-Roll\n2026 Nissan Armada NISMO – Exterior\n2026 Nissan LEAF – Exterior\nCorporate\nLeadership\nExecutive Biographies\nManagement Announcements\nFacilities\nPhilanthropy\nHeritage\nTechnology Library\nSpeaker Request Form\nManufacturing\nPlant Tours\nNissanManufacturing.com\nChristian Meunier - Chairman, Nissan Americas\nJuly 30, 2025\nNissan to integrate vehicle production from CIVAC plant to Aguascalientes plant in Mexico\nEvents\nWhat's New\nNissan Stories\nManufacturing\nNissan News Alerts\nName\nEmail\nCompany/Affiliation\nSelect the category below that best describes your affiliation with Nissan:\nSelect...\nMedia\nNissan Vehicle Owner\nDealer Associate\nAnalyst/Investor\nEmployee\nIndustry Peer\nOther\nThis form is for news and media updates from The US Nissan Newsroom. You may opt into additional updates from the US Nissan Stories site below.\nUS Stories Site updates\nSubscribe\nTop Searches\nRe:Nissan\nMurano\nAccolades\nArmada\nKicks\nZ\nLEAF\nAriya\nHeritage\nShowing Results for\n‘maxima’\nAll Time\nNewest\nNewest\nOldest\nRelevance\nReleases\nPress Kits\nPhotos\nPhoto Galleries\nGallery: 4 Photos\n2022 Nissan\nMaxima\nexterior\nGallery: 3 Photos\n2022 Nissan\nMaxima\ninterior\nGallery: 12 Photos\n2021\nMaxima\nVideos\nTop"
    },
    {
      "url": "https://www.slashgear.com/1674345/why-nissan-discontinue-nissan-maxima/",
      "text": "Why Did Nissan Discontinue The Nissan Maxima After 42 Years Of Production?\nThe 2023 model year saw the end of many popular vehicles, with the likes of the Dodge Charger and Challenger, Audi R8, Mercedes-Benz CLS, and Audi TT all being discontinued — much to the shock of consumers. Perhaps even more surprising was the departure of the Maxima in mid-2023, which, up until that point, was Nissan's flagship sedan. First introduced in 1980 as the Datsun 810 (ahead of the 1981 model year), the Nissan Maxima was sold continuously through eight different generations. It was highly reputed for offering a spacious and comfortable interior, with some iterations having heated front seats, leather upholstery, dual-zone automatic climate control, an 8-inch touchscreen infotainment system, Apple CarPlay and Android Auto, as well as Wi-Fi hotspot as standard amenities.\nPerformance was also great for a large car, as the Maxima was powered by the 3.5-liter version of Nissan's popular VQ engine, which joined the lineup in the 2000 model year. In the eighth generation introduced in 2016, the V6 dispenses an immensely puissant 300 hp and 261 lb-ft of torque, with that power flowing to the front wheels through a continuously variable transmission (CVT). With that combination, a 2023 Maxima Platinum scooted from 0-60 mph in 5.7 seconds in a Car and Driver testing; top speed in appropriate condition is also respectable at 133 mph. Considering these terrific features and performance specs, it's understandable to question why Nissan decided to end the Maxima lineup.\nThe Maxima was discontinued due to declining sales and Nissan's shift to EVs\nLike many sedans, the Nissan Maxima has been victimized by shifting consumer priorities over the years. Although the SUV segment had been moving in an uptrend long before, it wasn't until 2019 that it became quite evident that the popularity of sedans are seriously under threat from the burgeoning SUVs and crossovers. Up to that point, the Toyota Camry reigned supreme as the best-selling passenger vehicle in the U.S. for almost 20 years.\nHowever, in 2019, it was beaten to the top spot by the Toyota RAV4, which sold 448,068 units. Toyota Camry sales in the U.S., by comparison, dropped slightly to 336,978 units in the same year (down from 343,439 in 2018). That figure meant that the Camry was also leapfrogged by the Honda CR-V (384,168), Nissan Rogue, and Rogue Sport (350,447), as well as the Chevy Equinox (346,049).\nIn stark contrast, the Nissan Maxima was already struggling to find new owners by this point, underscored by sales of only 35,076 units. Later models only saw limited success, with sales falling to 7,110 units by 2022. There was a slight uptick to 9,653 units in its final model year, but it was negligible and too late, as Nissan had already made the decision to discontinue the model by then. Nissan did also say it was doubling down on electric vehicles and hinted at the possibility of reviving the Maxima down the line, perhaps as an all-electric model as previewed by the brand's IMs concept."
    },
    {
      "url": "https://www.slashgear.com/1746283/discontinued-nissan-models-we-wish-available-today/",
      "text": "5 Discontinued Nissan Models We Wish Were Still Available Today\nQuestioning the decisions of professionals is a time-honored tradition of sports fans and automotive enthusiasts alike. Professional athletes train their entire lives, honing physiques, sharpening minds, studying every aspect of their chosen game, only to have thousands of fans spilling beverages while scrutinizing every move and shouting suggested improvements. While automotive enthusiasts aren't as vocal, we suffer the same angst and spill the occasional beverage when discussing the state of automobiles for which we've developed a passion.\nOne area in particular that gets our blood boiling is news that a beloved model is getting the axe just because some corporate bean counter (no offense intended to those tasked with the counting of beans) placed more beans in the \"cons\" column than they did in the \"pros.\" We won't include the Nissan MID4 among our lost loves since it was discontinued before it even rolled off the factory floor, but the recently announced discontinuance of the Nissan GT-R has already left a hole in some of our hearts.\nIn addition to the GT-R, the Nissan Titan XD is among the top brand cars and trucks being discontinued in 2025 that we wish would stick around. Other Nissan models we wish were still available include the Xterra, Juke, and Murano CrossCabriolet.\nIt hasn't left yet, but we miss the Nissan GT-R\nIf you hurry, you might be able to snag a new Nissan GT-R, but with the beloved model's slated demise following a limited 2025 production run, your opportunity to be the first owner of one of Nissan's most iconic sports cars is slipping away, at least for a while. The suggested prices of the 2024 Nissan GT-R range from $121,090 for the Premium AWD version to $221,090 for the AWD Nismo. Intermediate models include the Skyline Edition and T-spec AWD. In all, these model names are reminiscent of some of the best special edition Nissan GT-Rs ever made.\nThe top-spec 2024 Nissan GT-R Nismo AWD features a specially-tuned 600-horsepower twin-turbo 3.8-liter V6. The Nismo V6 produces 481 pound-feet of torque and gets an estimated 22 mpg on the highway using premium unleaded gas. Power transmits to all four tires through a six-speed auto-shift manual transmission and limited-slip differential system.\nThe final GT-R features independent double wishbone suspension up front and independent multi-link rear suspension with front and rear stabilizer bars. The rack-and-pinion steering mechanism features hydraulic power-assist and speed-sensitive operation.\nThe Nissan Titan XD served a noble purpose\nThe Titan is another discontinued model you might still find on a dealer lot if you hurry. While the Cummins diesel-powered Nissan Titan XD, discontinued following the 2019 model year, was never particularly well-suited to compete in the heavy-duty pickup truck segment it was often associated with, it served a noble purpose nonetheless. It was the worst truck, the truck that other trucks aspired to be better than. With the Titan XD's absence, other automakers could let their trucks slip into the lowest position and begin to feel comfortable there. The loss of diesel-powered half-ton trucks, and entire V8-engine lineups, are the slippery-slope that the Nissan Titan XD once held firm.\nWhile rumors of the Nissan Titan making a comeback in 2025 appear false, the gas-powered 2024 Titan XD is likely still available, although it's also being discontinued. The 2024 Titan XD featured a 400-horsepower 5.6-liter V8 with 413 lb-ft of torque. Its drivetrain consisted of a nine-speed automatic transmission, a two-speed switch-operated transfer case, and Nissan's standard four-wheel drive while the Titan XD PRO-4X trim came with an electronic locking rear differential. However, we wish the 5.0 Cummins diesel-powered Nissan Titan XD was still available.\nThe Xterra put the utility in Nissan's SUV lineup\nWe'll admit that if you peruse the pages of SlashGear you'll find the Nissan Xterra listed among the used Nissan models you should steer clear of at all costs. But that was the 2005 model year that kicked off the Xterra's second generation. Of course, we'd like to see a host of improvements associated with the return of the Xterra, but hopefully with enough of its rugged charm to compete with other off-road-oriented SUVs dominating the market today.\nEarly versions of the Xterra included the XE and SE trims. Engine offerings were divided between a 2.4L inline four-cylinder and a 3.3L V6. We'd expect a returning Nissan Xterra to share drivetrain specs with the ongoing midsize Nissan Frontier pickup truck. For 2024, the Frontier featured a 310-horsepower 3.8-liter V6 delivering up to 281 lb-ft of torque, a nine-speed automatic transmission, and a two-speed transfer case on 4x4 models.\nHopefully, if it returns, the Xterra doesn't devolve into another soccer-team-transport vehicle best suited to traversing mall parking lots. It would be nice to see an Xterra equipped to compete with the likes of the Ford Bronco Raptor, or Wildtrak.\nThe Juke, a face only its fans could love\nThe Nissan Juke, with its quirky front turn signals perched atop its fenders like raised eyebrows, didn't present a face everyone loved. Nissan introduced the Juke, a compact crossover, in 2010. Inspired by the Qazana concept vehicle that debuted at the Geneva Motor Show the year prior, the innovative Juke featured torque-vectoring technology, the first for a compact car.\nIn the early model Jukes, it was common to find a naturally aspirated 188-horsepower 1.6-liter engine under the hood. However, before the Juke was discontinued in the U.S. and replaced by the Nissan Kicks following the 2017 model year, Nissan changed up the Juke's engine lineup. Starting in 2014, Nissan began offering the Juke with a smaller 1.2-liter DIG-T 115 (Direct Injection Gasoline-Turbo offering 115 ps, or 113 horsepower) and a revised 188-horsepower DIG-T 190 engine for the Juke Nismo with 177 lb-ft of torque.\nOf course the Nismo RS sits on top of our Nissan Juke wishlist. It not only featured race-inspired seats, an aerodynamic body kit, and Nismo-tuned suspension components, its engine produced 215 horsepower and 210 lb-ft of torque.\nThe unique Nissan Murano CrossCabriolet convertible SUV\nUp to this point, our wish list for returning Nissan models has included a sports car, a diesel pickup, a rugged off-road vehicle, and a quirky yet sporty compact SUV. For our final wish, provided we can find a genie that grants five wishes, we'd like to see an updated version of the Nissan Murano CrossCabriolet.\nSure, maybe the Murano CrossCabriolet, arguably one of the weirdest SUVs ever made, was ahead of its time when it debuted in 2011 as a convertible SUV with soft suspension and odd steering. And its low sales volume suggests that the SUV-buying public didn't warm up to its uniqueness by the time Nissan pulled the plug on it after the 2014 model year. But the world has changed in the 11 years since its departure.\nThe basic Nissan Murano, now in its fourth generation, has proved quite popular with U.S. SUV buyers, although it flopped in other parts of the world. Given the Nissan Murano's staying power and the popularity of convertible SUVs like the Jeep Wrangler and Ford Bronco, the CrossCabriolet is sure to find some buyers given the proper treatment and an affordable suggested price from Nissan."
    },
    {
      "url": "https://usa.nissannews.com/en-US/search?query=cube&selectedTabId=us-united-states-nissan-photos",
      "text": "USA\nNewsroom\nModels\nOpen Models\nAll Models\nElectric Vehicles\nOpen Electric Vehicles\nAriya\nLEAF\nCrossovers and SUVs\nOpen Crossovers and SUVs\nArmada\nKicks\nMurano\nPathfinder\nRogue\nCars\nOpen Cars\nAltima\nMaxima\nSentra\nVersa\nSports Cars\nOpen Sports Cars\nZ\nGT-R\nTrucks\nOpen Trucks\nFrontier\nTITAN\nConcepts\nPress Kit Archive\nNews\nOpen News\nAll News Releases\nNissan Stories\nMotorsports\nOpen Motorsports\nFormula E\nNissan Z GT4\nU.S. Sales Reports\nGlobal Financial Results\nTechnology & Safety News\nAwards & Accolades\nGalleries\nOpen Galleries\nCurrent Models\nCompany Logos\nEmployees\nPhilanthropy\nPhotos\nVideos\nB-Roll\nCorporate\nOpen Corporate\nLeadership\nOpen Leadership\nExecutive Biographies\nManagement Announcements\nFacilities\nPhilanthropy\nHeritage\nTechnology Library\nSpeaker Request Form\nManufacturing\nOpen Manufacturing\nPlant Tours\nNissanManufacturing.com\nEvents\nWhat's New\nNissan Stories\nManufacturing\nEmail Alerts\nRegions\nContacts\nNo Saved Items\nSaved Item\nSaved Items\nEmail Alerts\nRegions\nContacts\nModels\nAll Models\nElectric Vehicles\nAriya\nLEAF\nCrossovers and SUVs\nArmada\nKicks\nMurano\nPathfinder\nRogue\nCars\nAltima\nMaxima\nSentra\nVersa\nSports Cars\nZ\nGT-R\nTrucks\nFrontier\nTITAN\nConcepts\nPress Kit Archive\nJune 24, 2025\n2026 Nissan Armada debuts exciting new NISMO version\nJune 17, 2025\nThe iconic EV reimagined: Nissan unveils all-new third-generation LEAF\nNews\nAll News Releases\nNissan Stories\nMotorsports\nFormula E\nNissan Z GT4\nU.S. Sales Reports\nGlobal Financial Results\nTechnology & Safety News\nAwards & Accolades\nJuly 23, 2025\nBattle-tested: Nissan quality isn’t just promised – it’s recognized\nJuly 1, 2025\nNissan Group reports 2025 second quarter U.S. Sales\nGalleries\nCurrent Models\nCompany Logos\nEmployees\nPhilanthropy\nPhotos\nVideos\nB-Roll\n2026 Nissan Armada NISMO – Exterior\n2026 Nissan LEAF – Exterior\nCorporate\nLeadership\nExecutive Biographies\nManagement Announcements\nFacilities\nPhilanthropy\nHeritage\nTechnology Library\nSpeaker Request Form\nManufacturing\nPlant Tours\nNissanManufacturing.com\nChristian Meunier - Chairman, Nissan Americas\nJuly 30, 2025\nNissan to integrate vehicle production from CIVAC plant to Aguascalientes plant in Mexico\nEvents\nWhat's New\nNissan Stories\nManufacturing\nNissan News Alerts\nName\nEmail\nCompany/Affiliation\nSelect the category below that best describes your affiliation with Nissan:\nSelect...\nMedia\nNissan Vehicle Owner\nDealer Associate\nAnalyst/Investor\nEmployee\nIndustry Peer\nOther\nThis form is for news and media updates from The US Nissan Newsroom. You may opt into additional updates from the US Nissan Stories site below.\nUS Stories Site updates\nSubscribe\nTop Searches\nRe:Nissan\nMurano\nAccolades\nArmada\nKicks\nZ\nLEAF\nAriya\nHeritage\nShowing Results for\n‘cube’\nAll Time\nNewest\nNewest\nOldest\nRelevance\nReleases\nPress Kits\nPhotos\nAll-new 2025 Nissan Murano\nHigh-Resolution\nLow-Resolution\n2009 Nissan\ncube\n(Z12)\nHigh-Resolution\nLow-Resolution\n2014 Nissan\ncube\nHigh-Resolution\nLow-Resolution\n2014 Nissan\ncube\nHigh-Resolution\nLow-Resolution\n2014 Nissan\ncube\nHigh-Resolution\nLow-Resolution\n2014 Nissan\ncube\nHigh-Resolution\nLow-Resolution\n2014 Nissan\ncube\nHigh-Resolution\nLow-Resolution\n2014 Nissan\ncube\nHigh-Resolution\nLow-Resolution\nVideos\nTop"
    },
    {
      "url": "https://www.slashgear.com/1812313/nissan-cube-discontinued-reason/",
      "text": "Why Was The Nissan Cube Discontinued?\nThe Nissan Cube is proof that the Japanese automaker is not afraid to take risks. The subcompact car debuted with an unconventional design. Its front grille was inspired by a bulldog wearing shades, and it had a large asymmetrical wraparound window at the back. It also featured a refrigerator-style rear door. The uniquely styled vehicle was a standout in its segment, but it only had a relatively short run in the United States.\nFirst introduced in Nissan's home country in 1998, the Cube was marketed as a subcompact crossover rather than a kei car. It was in production for two decades in Japan, with newer generations launched in 2002 and 2008. The third-generation model reached the U.S. in 2009, while the North American market was seemingly warming up to boxy cars like the Scion xB and Honda Element.\nHowever, the Cube struggled to find a strong foothold in the U.S. market. By 2014, sales had plummeted so badly that Nissan removed the model from its North American lineup the following year. Nissan did not provide a specific reason for the Cube's discontinuation, but the low sales figures were telling of its fate. Not only that, the subcompact market was already becoming more competitive, with the Chevrolet Sonic, Toyota Prius, and Kia Rio leading the charge.\nThe subcompact only lasted a few years more in Japan until Nissan ultimately chose to retire it in 2019. Poor sales and the lack of a generational update after the 2008 refresh seemingly plagued the model in its final years.\nWas the Nissan Cube considered an ugly car?\nOne major factor that may have contributed to the Cube's underwhelming sales in North America was its unconventional and polarizing design. While Nissan intended to create an eye-catching, quirky vehicle, many found the Cube's aesthetic to be downright unattractive. It even landed on our 5 of the worst-looking Nissan models ever made and the 12 strangest Nissans ever built lists.\nThe Cube's asymmetrical design was controversial. In particular, it was taking the heat because its rear window wrapped around only one side of the car. It gave the vehicle an off-kilter, unfinished look. Its exaggerated upright stance, rounded edges, and other quirks all the more made it an oddity on the road.\nUnlike other boxy cars with a rugged or modern look, the Cube's styling was seen as eccentric, even awkward. So while the model gained a cult following in Japan, where unique and small urban vehicles are still popular to this day, it failed to resonate with American buyers who preferred sleeker, more conventional aesthetics. Going by this, the Suzuki Jimny would have fared better if it weren't banned in the U.S.\nOnline discussions about the ugliest cars frequently include the Cube, with critics likening it to a \"rolling shoebox\" or a \"half-melted Scion xB.\" Edmunds even included the Cube on its list of the 100 Ugliest Cars of All Time. While functional and spacious on the inside, the Cube's design simply did not appeal to mainstream consumers.\nCan you still buy a Nissan Cube at present?\nNissan no longer produces the Cube, but you can still buy one today, since many used models are up for grabs on different marketplaces. Since the car was sold in the U.S. from 2009 to 2014, prospective buyers can only find these model years on the used car market. Websites such as Edmunds and CarGurus list available Cubes, with prices ranging from as low as $4,900 for older models to around $13,000 for the last model year in 2014.\nDespite its divisive looks, the Cube does have qualities that make it a worthwhile purchase for the right buyer. For one, it offers a generous interior space for a compact vehicle, with ample headroom and legroom for both driver and passengers. Additionally, its small size and efficient fuel economy make it a practical city car.\nStandard features in the 2014 model include Bluetooth connectivity, keyless entry, steering wheel-mounted controls, and a six-speaker stereo system. Under the hood, it is powered by a 1.8L four-cylinder engine with 122 horsepower, paired with either a six-speed manual or an optional continuously variable transmission (CVT).\nAnother good reason to consider buying the Cube is it could become a future niche classic with its unique design and limited run. Unconventional cars often gain a cult following over time, much like the Volkswagen Thing or the AMC Pacer. While the Cube may not have been a commercial success, its quirky charm ensures that it will remain memorable in the industry."
    },
    {
      "url": "https://www.slashgear.com/1568983/2024-nissian-z-nismo-review-fast-0-to-60-speed-driving-experience-details/",
      "text": "2024 Nissan Z NISMO Review: Fast, But 0-60 Isn't The Point\nThe Nissan (or Datsun if we are being historically accurate) Z car is the original Japanese performance car. Long before Supras, Skylines, STis, and Lancer Evos, the Z car was speeding around. The Z has been around in some way shape or form since 1969. That means it was up against absolute historical automotive monsters like the Plymouth Roadrunner, the original Dodge Charger, the Chevy Chevelle, and Ford Torino. My neighbor, who was a semi-professional drag racer in the 1970s, remembers street racing against Datsuns in his Mercury Cyclone. The Z has been here for a while, is what I'm getting at. When I saw that I was going to drive a 2024 Nissan Z Nismo, I was giddy. I had only seen a current Z car one other time (and I was driving it).\nThe current Nissan Z sits at a weird spot in the automotive landscape. Really, only the Toyota Supra can be compared to it, and that shares a running gear with the BMW Z4. Subaru doesn't have any house built performance cars (the BRZ is a Toyota at heart). The Mitsubishi Lancer has long shuffled off its mortal coil, and Honda has moved towards the \"really mean sedan\" route with the still very good Type R Civic. If you want an angry two door Japanese sports car, you are stuck between the BMW-engined Supra, or the Nissan Z. After a week behind the wheel of the Z, I think it's an easy choice to make.\nThe NISMO treatment\nAll Z car trims–Sport, Performance, and NISMO–are powered by a 3.0-liter twin-turbo V6 that Nissan internally refers to by the catchy name of \"VR30DDTT.\". The Sport and Performance versions \"only\" have 400 horsepower, while the NISMO, the version I had for the week, generates 420 horsepower.\nThe NISMO trim manages to stand a little higher than just a goofy graphics package or slightly lowered suspension. In addition to the boost in horsepower, the interior has been wiped clean, leaving only Recaro seats, an infotainment system, and a few knobs for the air conditioning. No heated seats or power adjustable seats for you, but you can bring your race harness if you want.\nYou also get a number of red accents all over the exterior and interior trim, and a unique front fascia that Nissan refers to as (and I'm not kidding) the \"Grand-Nose.\" Grand indeed. The Chekhov's gun of the NISMO is its stock choice of tires for its 19-inch wheels, Dunlop SP Sport Maxx GT600s, which are little more than an entire can of Flex Seal sprayed over the rims.\nNot a normal car at all\nLet's start with what the Nissan Z NISMO isn't, and that's a normal car at all. The Sport and Performance Zs can likely do the work of a sports car and grand tourer pretty easily. You can live with one. Huskies are a little more difficult to train and maintain due to their high energy and intelligence, but they're a perfectly normal dog to own. Owning a Nissan Z NISMO as your only car would be like owning an alligator you taught how to open doors, at least marginally more difficult.\nYou have to be aware of steep driveways, potholes, and other road hazards, or you'll scrape on the ground. You can't carry anything around much larger than a backpack, and inclement weather will be your mortal enemy. I drove to a gravel parking lot with the Z and between the sticky tires picking up every stone and the undulating parking lot, I immediately thought \"I am not supposed to be here.\"\nSeats and a steering wheel\nThe leather and Alcantara trimmed seats are comfortable enough, but only barely adjustable and hard to get in and out of. I had to practice folding myself in half and sort of falling into the car to get into the seat. But once I was in the seat and buckled in, I was suitably nestled in for the ride. \"Climate control\" would be a stretch for what type of HVAC system the Z has, as it possesses a mere three knobs: fan speed, a numbered temperature dial, and vent control. The inside was small enough that it didn't really have a hard time getting warm, but I can see that it isn't exactly a selling point of the car.\nAs far as gauges and instruments go, the Z has a turbocharger boost gauge, a volt meter for some reason, and a turbo speed gauge. Never did those gauges become useful over the week, but I like them nonetheless. The Z NISMO also comes with a few extra screens on the digital instrument panel that show you the current G-forces and some other performance metrics. There are no rear seats, and only a shelf in the back that does double duty as the trunk as it's a liftback.\nThat rounds out the little bit of an \"interior\" that the Z actually has. Most of the length of the car is rightfully dedicated to the engine bay. It's all about saving weight and having anything that approaches a well appointed interior is heavy. Writer Adoniram Judson said \"There is no success without sacrifice.\" The success, here, being a really fast Nissan, and the sacrifice being the bare bones interior.\nIt's about vibes\nDespite the lack of inside creature comforts, the Z NISMO was an absolute blast to drive and I would suffer the spartan interior for hours on end just to drive the Z more. Although the Z's 9-speed automatic transmission propels the car to 60 miles per hour in more time than a comparable car like the BMW Z4's 3.9 seconds, at a somewhat lengthy 4.2 seconds, the grippy tires, stiff suspension, and P-38 Lightning-like cockpit of the Z made that highway speed sprint feel a lot more interesting. The Z4 is a fast and efficient bullet train you take to work, while the Z NISMO is a roller coaster on a school field trip when you're 11 years old.\nThe Z is much more exciting feeling. It might be the most fun I've had in a car on public roads. The Dunlop tires came into the fun equation a number of times as it was raining during a good portion of the week. Rain and wide slick tires don't always mix well, and I had to be very careful when I was driving to go get groceries or run errands. When I wanted to have fun while driving, however, the Z NISMO became a traction-less madhouse of noise and goofiness.\nEveryone's best friend\nThe regular public seemed to love this car. Visiting family, my aunts and uncles all gathered around the car admiring it with its Black Diamond Pearl paint job and red accents. All of my automotive-inclined friends wanted to sit in the passenger's seat and go for a ride. I was once getting groceries late at night and drove past some street racer type kids with a Mazda RX-8, Chrysler 300, and Honda Civic Sport. They all dropped what they were doing to admire the NISMO and stare at it. More than once, people would pull next to me in traffic and compliment the Z. It was as hilarious as the car.\nYou look cool sitting in it and behind the wheel, and you look uncoordinated and clumsy getting in and out of it. I think that's a fair trade off. It bears no semblance to every other car in the Wal-Mart parking lot, nor is it making any attempt to blend in. On that, it's so low to the ground, that I lost it in the parking lot more than once because a crossover parked next to it, completely obscuring it from view.\n2024 Nissan Z NISMO Verdict\nThe 2024 Nissan Z NISMO starts at $64,990, putting another nail in the coffin of practicality. The only options I was graced with were kick plates and floor mats, which, with the destination charge, brought the price up to $66,985, right within the ballpark of a BMW Z4 and the 45th Anniversary Edition of the Toyota Supra. It's more than twice as expensive as a Subaru BRZ and more than $20,000 more than a Honda Civic Type R. The car itself is wild escapism on a set of four wheels, but the price is a shock back to reality.\nIt likely wouldn't be wise to own a Nissan Z NISMO as your daily driver without a more pedestrian backup. It would, however, be one of the greatest instances of \"committing to the bit.\" All that said, I greatly enjoyed the NISMO and I wish more cars were capable of having as much fun as the Z seemed to be having, although the grille's demeanor could also be interpreted as the rictus grin of madness. I choose the former."
    },
    {
      "url": "https://www.slashgear.com/923878/14-best-drift-cars-ever-made/",
      "text": "18 Best Drift Cars Ever Made\nDrifting as a motorsport discipline is a fairly new idea, originating in the mountain roads of Japan in the early 1990s. It has quickly become a very popular spectacle around the globe, with competitive series like the US-based Formula Drift and Japan-based D1GP providing outlets for drifters to show off their skills. Any car can technically be used for drifting, as long as the driver is able to initiate oversteer, but some cars are naturally more set up for the sport than others.\nAn excellent drift car will usually have a low center of gravity, be rear-wheel drive, and be easy to modify and upgrade. Plus, it'll usually be affordable, as drifters aren't too keen on paying huge sums for a car that's likely to end up clipping a lot of concrete barriers throughout its sporting life. It might be relatively new as a discipline, but drifting already has a huge enthusiast community across the globe, and it shows no sign of stopping. In fact, according to Red Bull, it's the fastest-growing motorsport in the world right now.\nWhat is drifting?\nThe basic premise of drifting is initiating controlled oversteer, then delicately balancing the amount of countersteering with throttle control to ensure the car stays appropriately sideways throughout a corner. The discipline shot to international fame through cult classic manga and anime series like \"Initial D,\" and later through the \"Fast and Furious\" movie franchise. In particular, \"The Fast and The Furious: Tokyo Drift\" was instrumental in introducing the art of drifting to a mainstream audience, as (spoiler alert) the film's hero character, Sean, uses his drift skills to defeat his mafia boss nemesis Takashi in a tight race down a winding mountain road.\nBack in the real world, drifting has become a fiercely contested motorsport, with major competition series being run everywhere from New Zealand to Ireland. Competitions add extra layers of difficulty to the art of going sideways by scoring how well drivers drift in close proximity to each other, and how well the driver can link multiple drifts together, among other things. The more precise a driver can be in controlling their car's movements, the higher the score. Of course, for every meticulously measured pro-level competition, there are plenty more grassroots events that exist simply for attendees to have as much fun as possible, regardless of their skill level. The cars listed here are among the community's favorites and can be seen everywhere from grassroots events right up to national competitions.\nFord Mustang RTR\nThe Ford Mustang is one of the world's best-selling sports cars, and its readily-available nature, combined with its extensive aftermarket, make it an excellent candidate for a drift car. Three Mustangs are currently running in the top-flight 2022 Formula Drift championship. Two of those feature modifications from RTR, an aftermarket parts maker founded by drifter Vaughn Gittin Jr. shortly after releasing its first Mustang project in 2009, RTR entered into a partnership with Ford itself, effectively giving factory backing to this startup drift company.\nThis was one of the first times that an automaker had expressly given its support to producing drift cars, and this continued support from Ford makes the Mustang a recurring favorite for high-level drift competitions today. RTR-modified cars can also be ordered from select Ford dealerships, and the company has now expanded to produce performance variants of several other models in the Ford range. But, the Mustang remains RTR's most high-profile model and the car that gave the company its start in the industry.\nNissan Silvia/240SX (S14)\nAlthough it was the S13 that first thrust the Silvia/240SX range into the spotlight as a drifter, the S14 has now become the most popular generation with buyers looking for a drift-ready S-chassis. Data from Hagerty insurance shows that 64% of insurance quotes for the S14 were flagged as modified, as opposed to 52% for the S13. So, it's safe to say that at least half the S14s remaining on the road in the US are modified in some way, with many of those likely to be set up as drift cars. The S14 was lowered, widened, and featured better weight distribution than the previous-gen car, according to Hagerty. The other big selling point of the car is its engine bay, which is roomy enough to fit a number of engine swaps, with LS swaps being common in the US.\nS14s were once very affordable, but their popularity among drifters has made them subject to what's often called, \"the drift tax.\" As more examples get modified, raced, and often crashed, it gets harder to find stock examples in good condition. This pushes prices up, to the point where enthusiasts on a tight budget are now often priced out of the market altogether. Hagerty reports that an unmodified, well-preserved S14 can now command a premium of $20,000, a far cry from the four-digit price tags that the same cars would have sold for just a few years ago.\nBMW M3 (E36)\nThe E36 is currently the cheapest generation of the BMW M3 on the used market, and its affordability has made it an increasingly popular option for drifters in recent years. With enough technical know-how, the car's stock 3.0L straight-six engine can be turbocharged, saving the need for an engine swap. However, those in search of maximum horsepower can swap in an LS engine without too much hassle. The M3's well-balanced chassis and handling prowess make it a great driver's car, and as a result, a great base from which to build a pro-spec drift car.\nLike many of the cars here, the E36 is supported by a large aftermarket, which makes finding upgrades as easy as clicking \"Buy It Now\" on a webstore and waiting for said upgrade to be delivered straight to the door. Its rising popularity with the modding community is one factor contributing to the E36's rising price, although for now, examples can still be found for comfortably under the $20,000 mark. How much longer it will stay that way remains to be seen.\nToyota Supra MkIV\nOn the subject of rising prices, few cars have seen their value skyrocket quite as much as the MkIV Toyota Supra over the past decade. Low-mileage examples of the car can now sell for a quarter of a million dollars, making them practically unobtainable for anyone looking to modify one. However, there are plenty of examples out there that were already converted to drift cars long before the Supra became a collector's item. One such example is pro drifter Dan Burkett's Formula Drift car, which racked up over 230,000 miles of regular road use before being converted for competition. The Supra's 2JZ straight-six engine is famed for its ability to crank out huge horsepower figures with minimal modification, and Burkett's car makes 957 horsepower to the wheels.\nDespite their reputation as one of the most well-known JDM cars, Supras aren't actually that common in Japan, and the ones that are modified there are mostly street builds. Their reputation as drift cars was earned mainly in the US and Europe, as Western drifters saw bags of potential in the car's highly-tunable 2JZ, creating builds that could make well over 1,000 horsepower. Ever since it was immortalized in the \"Fast and Furious\" movie franchise, the A80 Supra has remained one of the most sought-after JDM cars, and its popularity doesn't seem likely to wane anytime soon.\nDodge Viper\nThe Dodge Viper isn't the easiest car to keep under control even in stock form, but nevertheless, a few brave souls have added huge turbochargers to more than double the car's stock power. The result is a car that's unlike anything else on the pro drift circuit. Dean Kearney's #43 Formula Drift car is a great example, having been through several build generations and making over 1,350 horsepower in its current form. This huge horsepower figure is made possible by fitting two turbochargers to the 8.3L V10 engine, then upgrading the camshafts, pistons, rods, and a host of other components to cope with the increased power.\nIt might not be the most conventional of drift cars, but it's certainly an effective one, as its success in top-flight competitions has proved. Swedish driver Samuel Hubinette won the inaugural 2004 season of the Formula Drift championship in one, then two years later clinched the title a second time in the same car. The upfront cost of buying a Viper has kept them out of the hands of most grassroots drivers, but they have remained a favorite among professional drifters since the earliest days of the sport in America.\nMazda RX-7 FD3S\nThe Mazda RX-7 is the best-selling rotary car of all time by a considerable margin, with over 800,000 units sold between 1978 and 2002. The FD generation was the ultimate iteration of the car, with a suite of technology, powertrain, and styling improvements over its predecessor. The RX-7 was immortalized as a drift car in \"The Fast and The Furious: Tokyo Drift,\" with the movie car featuring a distinctive Veilside body kit. The kit has remained Veilside's most iconic product to date, and is still available to purchase, according to Motor Authority. However, it's far from the only kit available for the RX-7, as nearly every major parts maker has designed one, from local Japanese legends like Re Amemiya to new-school brands like Rocket Bunny.\nThe RX-7's potent 13B rotary engine makes it a natural candidate for a drifter, and its visceral soundtrack at high revs adds to its appeal. However, used prices for the car are starting to become out of reach of grassroots drifters, in part due to the \"drift tax,\" and in part due to the car's high maintenance costs, which sent many examples to the scrapyard before they became collector's items.\nNissan 350Z\nLaunched in 2002, the Nissan 350Z heralded the return of the Z line of sports cars after several years on hiatus. The car went back to the Z line's roots, ditching the cutting-edge tech and complicated systems of its predecessor, the 300ZX, for a simple front-engined V6, rear-wheel-drive layout. It was a formula that resonated well with enthusiasts, and the car sold over 165,000 units in the US in the seven years it was on sale. That popularity has meant that there are lots of examples for sale on the used market, which has kept prices low and meant that the 350Z is one of the best-value Japanese sports cars out there at the moment.\nIt might be cheap, but the 350Z has the potential to compete at the top level of drifting and is one of the most common cars in Formula Drift. The aftermarket for the car is huge, giving owners plenty of options during the build process. The car's stock V6 is ripe for upgrading, but a 2JZ can also be easily swapped in for maximum horsepower figures.\nSubaru BRZ\nThe Subaru BRZ and its twin, the Toyota GT86, have now been on sale for 10 years, and in that time they've established themselves as two of the best cheap sports cars on the market. The second generation of the BRZ went on sale in 2022, with a number of improvements over its predecessor, including a revised chassis and a new, more powerful engine. It now makes 228 horsepower in stock form, but with such a huge aftermarket for the car, it can easily be modified to make significantly more. One of the biggest selling points of the BRZ is its price: It comes in at a fraction under $30,000 in base-spec form.\nThe car's top-tier handling, sizable aftermarket, and affordable starting price all combine to make a very attractive package for drifters looking for a new project car. It's common to see BRZs at grassroots competitions or as drift-ready street builds, but they can also be found at the highest levels of the sport.\nLexus IS300\nIt might seem like an unusual choice for a drift car, but the Lexus IS300 ticks all the right boxes for shredding tires on the track. The rear-wheel-drive sedan hides a naturally-aspirated 2JZ-GE engine under the hood, the same engine that's found in the MkIV Toyota Supra. It's also very affordable, with examples in good condition selling for as little as $10,000. Anyone who wants to upgrade their car's performance and looks can do so through the car's extensive aftermarket, and there are plenty of engine swap options, with 1JZs and 1UZs being common swaps.\nThe IS300 was originally designed to compete with German rivals like the BMW 3 Series, but its class-leading reliability and tuning potential gave it a unique appeal that sets it apart from its competition. It's also now one of the cheapest ways for buyers to get their hands on a 2JZ engine, as prices for the Supra have shot through the roof in recent years, putting them out of reach for many drivers. With the IS300, buyers get the performance potential of the 2JZ, albeit in non-turbo form, but in the shell of a car that can comfortably seat four adults. A unique combination for sure, and one that's very well suited to drivers on a tighter budget.\nHolden Commodore\nThe name might not be big in America, but the Holden Commodore holds a special place in the hearts of many Australian car fans. The Commodore has been one of the most popular models Down Under for decades, and it held the title of Australia's best-selling car for fourteen consecutive years between 1996 and 2010. Top-spec versions of the car are powered by GM's mod-ready LS V8 engine, and the car's traditional rear-wheel drive, and manual transmission layout make it the perfect candidate for a drift car. The Holden remained a local drift favorite for years but achieved some international recognition when Josh Robinson brought a Commodore Ute to the Formula Drift series in 2017.\nUnfortunately, 2017 was also the same year that Commodore production was stopped in Australia, as rising production costs and dwindling sales had made the car unprofitable. Between 2017 and 2019, a rebadged Opel Insignia was sold under the Commodore name, but its non-Aussie roots made it deeply unpopular. 9News reports that the car was axed by 2020. Still, it's not all bad news, as the car's long-standing popularity among Australians means that there are still plenty of examples floating about on the domestic used market. Americans can also buy their own piece of drift-ready Aussie muscle, as the Commodore was rebadged and sold as the Chevrolet SS between 2014 and 2017.\nBMW M3 (E46)\nMuch like the previous generation E36, the E46 M3 has now depreciated to the point of being affordable for grassroots enthusiasts. And, as it has become cheaper, the number of drift E46 builds has steadily increased. The car's S54 engine is powerful even in stock form, but it's capable of handling horsepower increases that can reach triple its original output. One competition car developed by Essa Motorsports for Formula Drift made 1,015 wheel horsepower with surprisingly few modifications.\nHowever, it's not uncommon for builders to engine swap their E46s, with 2JZ swaps and LS swaps being the top choices. One drift build even features the S85 V10 engine from the M5 and M6, which seems like an odd choice considering that the engine was famed for unreliability. Even so, it just demonstrates the number of options available to E46 owners. As used examples keep getting cheaper, it's likely that even more unusual builds will be shown off soon.\nNissan Silvia S15 Spec-R\nThe last car to bear the distinguished Silvia nameplate was the S15, which came in two flavors: Spec-S and Spec-R. The Spec-R was the more powerful of the two, featuring a turbocharged SR20DET engine that made 247 horsepower as opposed to the Spec-S' naturally-aspirated 163 horsepower SR20DE. So, the Spec-R became the version to get for drifters. The success of the S13 and S14 Silvia as drift cars ensured that the S15 was highly sought after even from the factory. This popularity has continued on to today, and the S15 is now one of several JDM cars succumbing to the \"drift tax.\"\nPrices will no doubt increase even further when the car is no longer subject to the US 25-year import rule, which currently prevents Americans from legally importing one. The first S15s rolled off the production line in 1999, so will be available to import from 2024. The Silvia is currently the most popular car among pro drivers in the Japanese D1GP Championship, with 10 drivers running the car in the 2022 season.\nMazda RX-8\nMazda's successor to the lauded RX-7 FD3S was the RX-8, and to say that the car had big shoes to fill is an understatement. The RX-7's twin-turbo rotary and sharp handling had made it into a rival to the likes of the Porsche 911, but there were concerns that the car was getting too complicated and costly. So, for the RX-8, Mazda decided to take things back to basics, giving it a naturally-aspirated version of the Wankel rotary engine. This meant the car felt slower in the real world than its predecessor, even though on paper it had similar horsepower figures, according to Top Gear. Nevertheless, RX-8 sales were strong for the first year but tailed off shortly after amid concerns about reliability issues.\nThese concerns have remained among JDM fans to the present day, keeping prices low and making it an excellent budget drift car. With a 9,000 rpm redline, a decent aftermarket and a number of high-profile drift builds to take inspiration from, the RX-8 makes a great choice despite its mixed reputation. Anyone who still needs convincing should take a look at Mad Mike Whiddett's \"BADBUL\" RX-8, which makes 800 horsepower from its original triple-rotor engine. It has competed in Formula Drift, the New Zealand Drift Series, Red Bull Drift Shifters, and a number of other high-profile events. The RX-8 might not be as popular as the RX-7, but it's just as capable as a drift car.\nToyota Corolla AE86\nThe Corolla AE86 already had a reputation as a great drift car throughout the sport's earliest days, but what really catapulted it to stardom was its prominent role in the cult classic Japanese manga \"Initial D.\" The comic series featured a young hero, Takumi Fujiwara, who honed his drifting skills on Japanese mountain roads while working as a delivery driver. He drove an AE86, and as the original manga and spin-off anime became international cult hits, so did the car. Keiichi Tsuchiya, a Japanese racing driver nicknamed \"Drift King,\" provided technical advice for the series, and it's been speculated that the main character is based off Tsuchiya himself, as he famously competed on Japan's mountain passes in an AE86 in his early days.\nSo, the car is not only an anime star, but also one of the earliest known drift cars. It's no surprise, then, to find out that values of the AE86 are on a one-way trend upwards. The car is now incredibly difficult to find in original, unmodified condition, and the few that do come up for sale can sell for more than their original list price. Ironically, this popularity has put them out of reach of drifters in many markets around the world, and now grassroots drivers have turned to a new generation of drift-ready cars to get their tire-shredding fix.\nMazda MX-5 Miata\n\"The answer is always Miata.\" It's a common response whenever some well-meaning individual posts on a forum looking for car advice, but there's a good reason why the Miata continues to be one of the most recommended grassroots enthusiast cars for any motorsport, not just drift. It's affordable, with plenty of cheap used examples on the market at any given time. It's also easy to modify, thanks to the huge aftermarket that covers every generation of the car. But most importantly, it's great fun to drive, and makes for a surprisingly competitive drift car in the right hands.\nIts power output might be bested by most modern econoboxes, but the light weight and rear-wheel drive layout of the Miata means it doesn't need many ponies to go sideways. Even so, the car's popularity means that all sorts of weird and wonderful builds have emerged over the years, with engine swaps ranging from Cummins diesels to 525-horsepower LS3 V8 swaps. Whether it's left mostly stock or built into a tire-shredding monster, it's hard to argue with the value that the Miata offers, and that's kept generations of drifters coming back to it across all levels of the sport.\nNissan 180SX/240SX (S13)\nKnown as the 180SX in Japan and the 240SX in North America, the sister car to the S13 Silvia has long been a drift favorite both in Japan and around the world. The 180SX was the first generation of the S-chassis line to really establish itself as a perfect car for drifting, with the classic front-engine, rear-wheel drive formula and an engine ripe for upgrades. In particular, the SR20DET available in JDM cars was the pick of the bunch — USDM cars had to make do with the KA24E at launch, and even the upgraded version never quite compared.\nThe S13's popularity as a drift car saw a broad aftermarket quickly spring up around it, leading to increasingly powerful builds and a wider array of kits available for drivers to add their own personal touch to their cars. Like many of the most sought-after drift cars, they're no longer as cheap as they once were, but their popularity at launch has meant that there's still plenty of affordable examples on the market for now.\nToyota Soarer/Lexus SC300\nThe Japanese-market Toyota Soarer, sold as the Lexus SC300 or SC400 in North America, is at first glance just another '90s sports coupe. However, under the hood of the SC300 was a naturally aspirated version of Toyota's 2JZ — the same engine as the MkIV Supra. While the twin-turbo version, the 2JZ-GTE, was never offered in either the Soarer or the SC300, the JDM Soarer was also available with a 1JZ-GTE. The only real difference between the famous Supra engine and the Soarer's was the slightly smaller displacement of the 1JZ, but the huge tuning potential remained the same.\nThe 1JZ can be modified to produce more than double its stock power output with just a few aftermarket parts, making it an ideal candidate for a drift missile. The car is relatively heavy when stock, and so needs to be stripped out for optimal sideways action, but many drift enthusiasts have done exactly that over the years. Supras have now risen in price way beyond what the average enthusiast can afford, but anyone who can find a nicely sorted Soarer will have an equally bulletproof engine at their disposal for a fraction of the cost.\nNissan Skyline R32\nWhile the R32 GT-R was making waves in the racing and tuning worlds, lesser versions of the legendary Nissan Skyline remained popular drift cars in Japan for years. The GT-R is a less-than-ideal candidate for drift car conversion for several reasons: Its status as one of the most sought-after JDM cars of its era makes it too expensive for many enthusiasts to purchase at all, and there's also the issue of the 4WD system, which needs to be disabled to drift. Not to mention, fixing a GT-R if something breaks will require considerably deeper pockets than fixing a lesser Skyline.\nBuying an R32 GTS-t or GTS solves all of these problems, and the RB engine under the hood still has plenty of potential for upgrading, even if it's never going to live up to the crazy horsepower figures of an RB26DETT. It is annoyingly common to see lower-spec Skylines with GT-R badges, but that distracts from the real appeal of the likes of the GTS-t — they're affordable enough to buy with plenty of tuning potential, and probably won't bankrupt their owners if they clip a wall or blow an engine while drifting."
    },
    {
      "url": "https://global.nissannews.com/en/heritage_model_silvia",
      "text": "Global\nNewsroom\n日本語\nNews\nNews Releases\nRelease Photos\nNotices\nModels\nNissan\nINFINITI\nHeritage\nMore From Nissan\nSustainability\nElectrification\nTechnology\nFacilities\nHistory of Nissan\nNissan Stories\nCorporate\nVision & Business Plan\nNissan Ambition 2030\nRe:Nissan\nSales, Production & Export Results\nInvestor News\nInvestor Site\nResults, Reports and Presentations\nExecutive Bios\nExecutive management changes\nCorporate Governance\nRenault Nissan Mitsubishi Alliance\nEvents\n2025\nAuto Shanghai\nTokyo Auto salon\n2024\nAuto Guangzhou\nAuto China 2024 (Beijing)\nTokyo Auto salon\n2023\nJapan Mobility Show\nAuto Shanghai\nNissan Futures\nTokyo Auto salon\nArchive\nMotorsports\nFormula E\nNISMO News\nSuper GT\nNissan Z GT4\nSentra Cup\nINFINITI\nEmail Alerts\nRegions\nContacts\n日本語\nNo Saved Items\nSaved Item\nSaved Items\nEmail Alerts\nRegions\nContacts\n日本語\nNews\nNews Releases\nRelease Photos\nNotices\nAugust 26, 2025\nNissan bids fond farewell to R35 GT-R as final vehicle rolls off the line\nJune 17, 2025\nEffortlessly electric: the all-new Nissan LEAF is the EV for everyone\nModels\nNissan\nINFINITI\nHeritage\nAugust 22, 2025\nThe new Nissan Roox redefines Kei car segment with space, style and tech\nAugust 21, 2025\nNissan launches X-Trail NISMO in Japan\nMore From Nissan\nSustainability\nElectrification\nTechnology\nFacilities\nHistory of Nissan\nNissan Stories\nAugust 27, 2025\nNissan introduces world’s first valve seat using cold spray technology in new e-POWER dedicated engine\nAugust 20, 2025\nNissan partners with LiCAP Technologies to develop all-solid-state battery electrode production process technology\nCorporate\nVision & Business Plan\nNissan Ambition 2030\nRe:Nissan\nSales, Production & Export Results\nInvestor News\nInvestor Site\nResults, Reports and Presentations\nExecutive Bios\nExecutive management changes\nCorporate Governance\nRenault Nissan Mitsubishi Alliance\nRe:Nissan plan\nJuly 30, 2025\nNissan posts first quarter results, reaffirms commitment to recovery and cost discipline\nEvents\n2025\nAuto Shanghai\nTokyo Auto salon\n2024\nAuto Guangzhou\nAuto China 2024 (Beijing)\nTokyo Auto salon\n2023\nJapan Mobility Show\nAuto Shanghai\nNissan Futures\nTokyo Auto salon\nArchive\nAuto Shanghai 2025\nTokyo Auto Salon 2025\nMotorsports\nFormula E\nNISMO News\nSuper GT\nNissan Z GT4\nSentra Cup\nAugust 27, 2025\n#23 MOTUL AUTECH Z secures dominant win at Suzuka\nAugust 7, 2025\nNissan Formula E Team confirms Rowland and Nato for Season 12\nINFINITI\nNissan News Alerts\nClose\nName\n*\nEmail\n*\n*\nRequired Field\nSelect one or more categories below to receive email alerts for major media releases:\nAll News\nProduct\nCorporate\nStatistics\nincluding sales/registration volumes\nMotorsports\nStories\nSubscribe\nTop Searches\nRe:Nissan Recovery Plan\nLEAF\nGT-R\nAriya\ne-POWER\nProPILOT\nExecutive Bios\nCEO\nFinancial results\nSilvia\nCSP311(1965-1968)\nSilvia Generations\nCSP311(1965-1968)\nS10(1975-1979)\nS110(1979-1983)\nS12(1983-1990)\nS13(1988-1993)\nS14(1993-1999)\nCSP311(1965-1968)\nBack to top\n1965 Silvia\nS10(1975-1979)\nBack to top\n1977 LS-E Type G\n1977 LS-E Type G\n1977 LS-E Type G\n1977 LS-E Type G\n1976 L18E Engine\n1976 LS-E Type X\n1976 LS-E Type X\n1976 LS-E Type X\n1976 LS-E Type X\n1976 L18S Engine\n1975 LS Type X\n1975 LS Type X\n1975 LS Type X\n1975 LS Type X\n1975 Silvia 1800 LS\n1975 Silvia 1800 LS\n1975 Silvia 1800 LS\nS110(1979-1983)\nBack to top\n1982 240RS (Base Car)\n1982 240RS (DOHC Rally Car)\n1982 240RS (DOHC Rally Car)\n1982 240RS (DOHC Rally Car)\n1982 240RS (DOHC Rally Car)\n1982 Speech Recognition Wind\n1982 Speech Recognition Microphone\n1982 FJ20 Engine\n1982 H/T RS\n1982 H/T RS\n1982 H/T RS\n1982 H/T RS\n1982 H/T RS Extra\n1982 H/T RS Extra\n1982 H/T RS Extra\n1982 H/T RS Extra\n1982 H/T RS Extra\n1982 Silvia Hardtop RS Extra\n1982 Silvia Hardtop RS Extra\n1982 Silvia Rally\n1981 H/B Turbo ZSE\n1981 H/B Turbo ZSE\n1981 H/T Turbo ZSE-X\n1981 H/T Turbo ZSE-X\n1981 H/T Turbo ZSE-X\n1981 H/T Turbo ZSE-X\n1981 Silvia Hatchback Turbo ZSE-X\n1981 Silvia Hatchback 2000ZSE-X G\n1981 Silvia Hardtop Turbo ZSE-X\n1981 Silvia Hardtop 2000ZSE-X G\n1980 H/B 2000 ZSE-X (Rear Hatch Open)\n1980 H/B 2000 ZSE-X\n1980 H/B 2000 ZSE-X\n1980 H/B 2000 ZSE-X\n1980 H/B 2000 ZSE-X\n1979 Z18E Engine\n1979 Z20E Engine\n1979 H/B 2000 ZSE-X\n1979 H/B 2000 ZSE-X\n1979 H/B 2000 ZSE-X\n1979 H/B 2000 ZSE-X\n1979 H/B 2000 ZSE-X\n1979 2000 ZSE-X\n1979 2000 ZSE-X\n1979 2000 ZSE-X\n1979 2000 ZSE-X\n1979 2000 ZSE-X\n1979 Silvia 2000ZSE-X\n1979 Silvia 2000ZSE-X\n1979 Silvia 2000ZSE-X\n1979 Silvia 2000ZSE-X\n1979 Silvia 2000ZSE-X\n1979 Silvia 2000ZSE-X\nS12(1983-1990)\nBack to top\n1987 Coupe 1800 Twincam Turbo Full White RS-X\n1987 Coupe 1800 Twincam Turbo Full White RS-X\n1986 Coupe 1800 Twincam Turbo RS-X\n1986 Coupe 1800 Twincam Turbo RS-X\n1986 Silvia Hatchback 1800 Twincam Turbo RS-X\n1986 Silvia Coupe 1800 Twincam Turbo RS-X\n1986 Silvia Hatchback 1800 Twincam Turbo RS-X\n1986 Silvia Coupe 1800 Twincam Turbo RS-X\n1984 H/B Turbo R-L FISCO\n1984 H/B Turbo R-L FISCO\n1984 H/B Turbo R-L FISCO\n1984 H/B Turbo R-L FISCO\n1984 Coupe Tirbo R-X·G\n1984 Coupe Tirbo R-X·G\n1983 CA18S Engine\n1983 CA18E Engine\n1983 CA18ET Engine\n1983 FJ20E Engine\n1983 FJ20TE Engine\n1983 H/B Turbo RS-X\n1983 Coupe RS-X\n1983 Coupe RS-X\n1983 Coupe RS-X\n1983 Coupe RS-X\n1983 Coupe Turbo RS-X\n1983 Coupe Turbo RS-X\n1983 Coupe Turbo RS-X\n1983 Coupe Turbo RS-X\n1983 FJ20E engine\n1983 Silvia Coupe Turbo RS-X\n1983 Silvia Coupe Turbo R-X\n1983 Silvia Hatchback Turbo RS-X\n1983 Silvia Coupe Turbo RS\n1983 Silvia Coupe Turbo R-X G\nS13(1988-1993)\nBack to top\n1992 Silvia Almighty\n1992 Silvia Almighty\n1992 Silvia K's\n1992 Silvia Q's Dia Package\n1992 Silvia K's\n1992 Silvia Q's Dia Package\n1988 CA18DET engine\n1988 CA18DE engine\n1988 Silvia K's\n1988 Silvia K's\n1988 Silvia J's\n1988 Silvia Q's\n1988 Silvia K's\n1988 Silvia J's\n1988 Silvia Q's\n1988 Silvia K's\n1988 Silvia Q's\n1988 Silvia K's\n1988 Silvia J's\n1988 Silvia Q's\n1988 Silvia Convertible\n1988 Silvia J's\n1988 Silvia Q's\n1988 Silvia K's\n1988 Silvia Convertible\nS14(1993-1999)\nBack to top\n1993 SR20DET engine\n1993 Silvia K's Type S\n1993 Silvia K's Type S\n1993 Silvia K's Type S\n1993 Silvia K's Type S\nTop"
    }
  ],
  "argos_summary": "Nissan’s recent model cuts reflect a shift away from sedans and quirky niche cars toward SUVs and electrics, with the discontinuation of the Maxima, Silvia, and Cube driven by weak sales and changing consumer preferences. The Maxima’s 300‑hp V6 and long production run ended as SUV demand eclipsed sedans, while the Silvia’s turbocharged RWD platform, once a drift icon, fell out of favor as newer performance cars emerged. The Cube, a quirky compact with asymmetrical styling, saw limited appeal and was retired after 2014, illustrating Nissan’s broader strategy to streamline its lineup for a more profitable, electric‑focused future.",
  "argos_id": "SWC7XMU46"
}