{
  "url": "https://www.theverge.com/verizon/768450/verizon-is-down-outage-network-software-issue",
  "authorsByline": "Jay Peters",
  "articleId": "b3e9f5831b9149b8a5056619ef5c2cb4",
  "source": {
    "domain": "theverge.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "DC",
      "city": "Washington",
      "coordinates": {
        "lat": 38.8949924,
        "lon": -77.0365581
      }
    }
  },
  "imageUrl": "https://platform.theverge.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/25594448/STK066_VERIZON_A.jpg?quality=90&strip=all&crop=0%2C10.732984293194%2C100%2C78.534031413613&w=1200",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-30T21:54:13+00:00",
  "addDate": "2025-08-30T21:56:16.109310+00:00",
  "refreshDate": "2025-08-30T21:56:16.109313+00:00",
  "score": 1.0,
  "title": "Verizon’s ‘software issue’ has disconnected many wireless customers across the US",
  "description": "It’s not just you.",
  "content": "is a news editor covering technology, gaming, and more. He joined The Verge in 2019 after nearly two years at Techmeme.\n\nPosts from this author will be added to your daily email digest and your homepage feed.\n\nVerizon has confirmed to customers in stores and online that its network is having an issue on Saturday. Many people have been unable to connect and make or receive calls for hours, while DownDetector’s tracker peaked in the afternoon at around 3:30PM ET with more than 20,000 reports. Some customers report their service has continued to function throughout the day, so it’s unclear what the cause is exactly.\n\nDowndetector’s outage map showed hotspots in many cities, and Verizon didn’t specifically list affected areas. On X, the @VerizonSupport account confirmed the issue in response to customers’ questions, but didn’t have additional details on restoration or how widespread it is.\n\nDiana Alvear, the head of media relations for the Atlantic North Market, responded to our inquiry about the issue and confirmed the outage, saying,\n\nWe are aware of a software issue impacting wireless service for some customers. Our engineers are engaged and we are working quickly to identify and solve the issue. Please visit our Check Network Status page for updates on service in your area. We know how much people rely on Verizon and apologize for any inconvenience. We appreciate your patience.\n\nIf we find out more information, we will update this post.\n\nFollow topics and authors from this story to see more like this in your personalized homepage feed and to receive email updates.",
  "medium": "Article",
  "links": [
    "https://downdetector.com/status/verizon/",
    "https://www.reddit.com/r/verizon/comments/1n4793z/service_outages/",
    "https://x.com/VerizonSupport/status/1961902907973931060?t=ip8BBqRSGLUq1EAQQN7K2g&s=19",
    "https://downdetector.com/status/verizon/map/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "many wireless customers",
      "weight": 0.101438925
    },
    {
      "name": "more information",
      "weight": 0.08456681
    },
    {
      "name": "Many people",
      "weight": 0.08173076
    },
    {
      "name": "wireless service",
      "weight": 0.07913459
    },
    {
      "name": "many cities",
      "weight": 0.077686235
    },
    {
      "name": "customers",
      "weight": 0.07746911
    },
    {
      "name": "Verizon",
      "weight": 0.07381884
    },
    {
      "name": "email updates",
      "weight": 0.07079378
    },
    {
      "name": "media relations",
      "weight": 0.06661607
    },
    {
      "name": "service",
      "weight": 0.0632336
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.955078125
    },
    {
      "name": "/News/Technology News",
      "score": 0.86181640625
    },
    {
      "name": "/Internet & Telecom/Service Providers/Other",
      "score": 0.60009765625
    },
    {
      "name": "/Internet & Telecom/Service Providers/Phone Service Providers",
      "score": 0.53662109375
    },
    {
      "name": "/Internet & Telecom/Service Providers/ISPs",
      "score": 0.5
    }
  ],
  "sentiment": {
    "positive": 0.06324303,
    "negative": 0.62302244,
    "neutral": 0.31373456
  },
  "summary": "Verizon's wireless network has been experiencing a software issue, which has affected many customers across the US for several hours. The issue has been confirmed to customers in stores and online, but no details have been released on how widespread it is. Some customers have reported that their service continues to function throughout the day. The outage was caused by a surge in demand from customers, with Downdetector's outage map showing hotspots in many cities.",
  "shortSummary": "Verizon's wireless service is experiencing a widespread outage, with many customers unable to connect, make calls or receive calls for hours due to a software issue.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "fe3067fe81074a48a3a71539bf740c5c",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Verizon is experiencing a widespread network outage that has left many customers unable to make or receive calls, with DownDetector reporting over 20,000 incidents at its peak. The outage appears to be linked to a software issue affecting wireless service, though Verizon has not specified the exact cause or affected areas. Verizon’s support team has confirmed the problem and is working to resolve it, offering updates via its Check Network Status page.",
  "argos_id": "VEJ1I9BMD"
}