{
  "url": "https://www.businessinsider.com/excel-most-in-demand-skill-tech-job-listings-ai-2025-8",
  "authorsByline": "Lakshmi Varanasi",
  "articleId": "1f0c4fa490fb4f9999662a83d488d166",
  "source": {
    "domain": "businessinsider.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://i.insider.com/68b0ad13194a2d49b8af63b0?width=1200&format=jpeg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-31T18:14:29+00:00",
  "addDate": "2025-08-31T18:20:53.982217+00:00",
  "refreshDate": "2025-08-31T18:20:53.982219+00:00",
  "score": 1.0,
  "title": "Forget ChatGPT, Excel remains the most in-demand skill",
  "description": "AI isn't changing everything. Spreadsheet whizzes are still competitive in the current job market.",
  "content": "AI is fueling talent wars in Silicon Valley, but one of the most coveted skills in the industry is more than four decades old.Microsoft Excel, first released all the way back in 1985, is still the most cited skill in job listings.Course Report, which tracks the tech education industry, including coding bootcamps, recently reviewed more than 12 million tech job postings on Indeed to identify the most sought-after skills. Excel came out on top, showing up 531,000 times, far surpassing Python, an essential programming language used in AI, which came in at 67,000, and SQL, another programming language used in data management, which came in at 60,000.AI-related expertise appeared less frequently. Machine learning showed up in 31,000 listings, while AI itself was mentioned in just 25,000.The tech industry still needs Excel whizzes to help manage the backbone of the AI boom: data. The hunt for unique data is so fierce that even leading AI companies are pushing boundaries — sometimes at the risk of copyright violations. Others are turning to synthetic data, artificial data generated by machine learning algorithms from little more than a seed of original data.Rajoshi Rhosh, cofounder of PromptQL, a tech unicorn that helps Fortune 500 companies build hallucination-free AI systems, told Business Insider that expertise in Excel will long be in demand.\"The interface is too deeply ingrained in how business users think and operate. What will change is how the data gets into Excel,\" he said over text message. \"As AI matures, its real role is to deliver accurate, contextual data directly into the tools people already trust: like Excel.\"Pukar Hamal, CEO of security questionnaire company SecurityPal, said that behind the sheen of chatbots and agents is good, old-fashioned Excel.\"We keep pretending the future arrives through new interfaces,\" he told Business Insider. For most B2B companies, \"the last mile is the same. You either dress up an Excel model with a UI, or you give buyers a way to take your data back to Excel. That is where real decisions and real dollars move.\"This tried-and-true skill remains vital even as tech giants battle for top AI talent.Firms are shelling out premiums of up to $200,000 for candidates with machine learning skills. Tech giants like Meta, Google, Amazon, and OpenAI are offering AI experts $1 million pay packages.Even job seekers without deep technical skills are landing lucrative roles with skills like vibe-coding and prompt engineering, which is essentially just finessing the best responses from chatbots, agents, and other AI tools.Although Excel might not be as flashy or result in paydays that rival professional athletes, it is still a highly relevant skill at the frontier of technology.Here are the other top skills employers are looking for in the tech industry:",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "machine learning skills",
      "weight": 0.09427776
    },
    {
      "name": "tech industry",
      "weight": 0.09083996
    },
    {
      "name": "Excel whizzes",
      "weight": 0.086193874
    },
    {
      "name": "Excel",
      "weight": 0.08520262
    },
    {
      "name": "skills",
      "weight": 0.08468227
    },
    {
      "name": "Microsoft Excel",
      "weight": 0.08392589
    },
    {
      "name": "deep technical skills",
      "weight": 0.08366105
    },
    {
      "name": "Tech giants",
      "weight": 0.08254418
    },
    {
      "name": "tech giants",
      "weight": 0.08254418
    },
    {
      "name": "data management",
      "weight": 0.079305746
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Science/Computer Science/Machine Learning & Artificial Intelligence",
      "score": 0.6943359375
    },
    {
      "name": "/Jobs & Education/Jobs/Career Resources & Planning",
      "score": 0.640625
    },
    {
      "name": "/News/Technology News",
      "score": 0.53125
    },
    {
      "name": "/Jobs & Education/Jobs/Job Listings",
      "score": 0.44677734375
    },
    {
      "name": "/Business & Industrial/Business Operations/Human Resources",
      "score": 0.36669921875
    }
  ],
  "sentiment": {
    "positive": 0.185017,
    "negative": 0.38190776,
    "neutral": 0.43307525
  },
  "summary": "Microsoft Excel, a programming language used in AI, has been the most sought-after skill in the tech industry since its release in 1985. Course Report reviewed over 12 million tech job postings on Indeed to find out which Excel was the most prevalent skill. The search for unique data is so intense that leading AI companies are exploring new methods, sometimes at risk of copyright violations. However, Rajoshi Rhosh, cofounder of PromptQL, believes that Excel will remain vital as AI matures and its real role is to deliver accurate, contextual data directly into business tools. Companies offering premium salaries of up to $200,000 for candidates with machine learning skills.",
  "shortSummary": "Microsoft Excel remains the most popular skill in tech, overtaking Python, while AI-related expertise is often overlooked due to its deep-rooted integration and user familiarity.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "dfffcbc861d1434783a47cafaefce1cb",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "AI talent wars in Silicon Valley highlight that Microsoft Excel remains the most cited skill in tech job listings, far outpacing Python and SQL. Despite AI’s prominence, demand for Excel experts persists because the tool is integral to managing the data that fuels AI. Companies are willing to pay up to $200,000 for machine‑learning talent and up to $1 million for top AI specialists, but even non‑technical hires can earn lucrative roles through prompt engineering. The narrative underscores that as AI matures, its real value lies in delivering accurate, contextual data directly into familiar tools like Excel.",
  "argos_id": "X73LG1GSU"
}