{
  "url": "https://www.slashgear.com/1950582/cheap-ipad-mini-alternative-redmagic-astra-best-tablet-2025/",
  "authorsByline": "Max Miller",
  "articleId": "e1da23f6eaaf4630be332d1aee59d179",
  "source": {
    "domain": "slashgear.com",
    "paywall": false,
    "location": null
  },
  "imageUrl": "https://www.slashgear.com/img/gallery/this-cheap-ipad-mini-alternative-might-be-2025s-best-tablet-according-to-reviews/l-intro-1756214476.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-30T22:15:00+00:00",
  "addDate": "2025-08-30T22:23:19.812855+00:00",
  "refreshDate": "2025-08-30T22:23:19.812856+00:00",
  "score": 1.0,
  "title": "This Cheap iPad Mini Alternative Might Be 2025's Best Tablet (According To Reviews)",
  "description": "The RedMagic Astra packs flagship-grade power Snapdragon 8 Elite, 9\" OLED 165 Hz display, active cooling, all into a compact, gaming-focused tablet.",
  "content": "This Cheap iPad Mini Alternative Might Be 2025's Best Tablet (According To Reviews)\n\nThe Android tablet market is in a strange place, most of all when it comes to small form factors. Samsung's best tablets have vibrant displays and great software, but its most recent Galaxy S10 Ultra flagship uses a last-generation chip, backing away from direct competition with the most powerful tablet processor of all time in the M4 iPad Pro. Meanwhile, the budget Android market is awash in low-end hardware with lackluster specs, and that's where small tablets abound. If there's a reason why Apple has yet to put an M-series processor in the iPad Mini, it's probably because the A17 Pro mobile processor it currently runs on is leagues faster than the lackluster chips found in even the best small Android tablets. All of that makes a new tablet from RedMagic quite the eyebrow-raiser. The company has until now been known for its smartphones. Year on year, RedMagic has managed to deliver flagship Android gaming phones with some of the most impressive spec sheets on the market. They're odd devices in many ways — no other brand ships phones with a built-in AI anime waifu companion — but there's no arguing with the value proposition. The RedMagic Astra continues that trend, this time in tablet form. Pairing a flagship processor with a frankly astonishing amount of memory and an impressive display, it's tough to find a better tablet at this size and price point, at least on paper. But to see whether it holds up in the real world, we looked at professional reviews. What they had to say was surprisingly consistent. Let's dive in.\n\nThe RedMagic Astra looks simple on the outside. Get past the RGB logo and tiny cooling fan on the back — aesthetic reminders that this is a gaming-focused device — and it's a metal and glass slab like any other. Inside, things get a lot more interesting. The Astra runs on a Qualcomm Snapdragon 8 Elite processor, the same chip powering the Samsung Galaxy Z Fold 7 and other 2025 flagships. It's a considerably more powerful chip than the Apple A17 Pro in the iPad Mini, or the older, MediaTek processor found in the far more expensive Galaxy Tab S10 Plus. The Astra can be configured with 12 to 24 gigabytes of RAM, another flex compared to the 8 GB in the iPad Mini and 12 GB in the Tab S10 Ultra. In other words, it's both more powerful on paper than competing small tablets or any other Android tablet, period. RedMagic has paired that horsepower with a 9.06-inch, 2.4K, OLED display running at 165Hz. If the pattern isn't yet clear, yes, those specs are variously more impressive than what Apple or Samsung offer, even at the high end of their lineups. For instance, neither competitor offers any device with a refresh rate higher than 120Hz. Rounding things out is an 8,200 milliamp-hour battery with 80-watt fast charging. You'd be forgiven for calling it overkill, but the price certainly isn't. At $549 for the base model and $899 for the maxed-out RAM and storage configuration, the RedMagic Astra isn't a cheap Android tablet, but it undercuts its direct competition. But does the lower price reflect a hidden compromise? We looked at reviews to find out.\n\nReviewers agree the RedMagic Astra lives up to its spec sheet Reviewers who got their hands on the RedMagic Astra gaming tablet formed a surprising consensus. After scouring reviews from reputable sources, the consensus is sweepingly positive. With that said, some nitpicks were picked. Speaking of nits, the display was a highlight across the board. Tom's Guide called it \"jaw-dropping.\" \"Pretty impressive,\" said Phone Arena. And 9to5Google considered it \"way better ... than many other tablets on the market.\" Performance was another easy win for the Astra. The Snapdragon 8 Elite is the most powerful mobile processor for Android at the moment, and RedMagic gives it as much headroom as possible by adding an actual cooling fan in addition to an almost comical amount of RAM. The result? Nary a stutter or dropped frame, even during sweaty gaming sessions. Many Android devices fall short in the software department. However, reviewers were pleasantly surprised by the Astra's lightweight Android 15 skin. One gripe came from 9to5Google, which disliked the built-in games launcher since it looks like gaming-oriented software in a very cliche way, though ZDNet found that the CPU tuning it offers provided a boost in performance for the most demanding games. Android Central was justifiably displeased with the Astra's meager two years of promised software updates, which lag behind commitments from other brands. Even if this isn't the tablet for you, it's good to see a company like RedMagic carrying the torch for powerful, smaller tablets that don't compromise on specs. If the Astra can spur market leaders like Apple and Samsung to bolster their own lineups, tablet lovers everywhere will be better off.",
  "medium": "Article",
  "links": [
    "https://www.slashgear.com/1720223/most-powerful-tablet-processsors-ranked-geekbench/",
    "https://nanoreview.net/en/soc-compare/qualcomm-snapdragon-8-gen-4-vs-apple-a17-pro",
    "https://www.slashgear.com/1776554/best-android-tablet-under-ten-inches-small/",
    "https://www.slashgear.com/1686687/samsung-galaxy-tab-s10-plus-review-premium-android-tablet-stylus-test-2024/",
    "https://intl.redmagic.gg/pages/redmagic-astra-gaming-tablet",
    "https://www.zdnet.com/article/finally-an-android-tablet-that-i-can-confidently-recommend-to-gamers/",
    "https://www.androidcentral.com/tablets/redmagic-astra-oled-gaming-tablet-ive-always-wanted",
    "https://www.tomsguide.com/computing/android-tablets/forget-the-ipad-mini-this-9-inch-oled-android-tablet-is-way-better-for-gaming",
    "https://www.phonearena.com/reviews/redmagic-astra-tablet-review_id7446",
    "https://9to5google.com/2025/07/18/redmagic-astra-android-tablet-review/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "RedMagic Astra",
      "weight": 0.09201619
    },
    {
      "name": "many other tablets",
      "weight": 0.09056744
    },
    {
      "name": "small tablets",
      "weight": 0.0896706
    },
    {
      "name": "competing small tablets",
      "weight": 0.08539993
    },
    {
      "name": "flagship Android gaming phones",
      "weight": 0.081135064
    },
    {
      "name": "tablet form",
      "weight": 0.080805525
    },
    {
      "name": "tablet lovers",
      "weight": 0.07915596
    },
    {
      "name": "Many Android devices",
      "weight": 0.07568695
    },
    {
      "name": "the RedMagic Astra gaming tablet",
      "weight": 0.070629865
    },
    {
      "name": "Astra",
      "weight": 0.06964937
    }
  ],
  "topics": [
    {
      "name": "iPad"
    },
    {
      "name": "Electronics"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Shopping/Consumer Resources/Product Reviews & Price Comparisons",
      "score": 0.84326171875
    },
    {
      "name": "/Computers & Electronics/Software/Operating Systems",
      "score": 0.83984375
    },
    {
      "name": "/News/Technology News",
      "score": 0.73681640625
    },
    {
      "name": "/Internet & Telecom/Mobile & Wireless/Mobile Phones",
      "score": 0.67431640625
    }
  ],
  "sentiment": {
    "positive": 0.46298534,
    "negative": 0.11535876,
    "neutral": 0.42165586
  },
  "summary": "The RedMagic Astra gaming tablet, a cheap replacement for the Apple's iPad Mini, may be 2025's best tablet, according to reviews. The Astra runs on a Qualcomm Snapdragon 8 Elite processor, the same chip powering the Samsung Galaxy Z Fold 7 and other 2025 flagships. It can be configured with 12 to 24 gigabytes of RAM, significantly more powerful than the Apple A17 Pro in the iPad Mini or the older, MediaTek processor in the Galaxy Tab S10 Plus. The device also features a 9.06-inch, 2.4K, OLED display running at 165Hz and an 8,200 milliamp-hour battery with 80-watt fast charging. Despite some criticism, reviews found the Astra lives up to its spec sheet.",
  "shortSummary": "The RedMagic Astra offers an impressive, affordable Android tablet with a Qualcomm Snapdragon 8 Elite processor, offering premium gaming and multimedia features at a lower price.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "215649c9418640a29e86a88ee1fbe46d",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.slashgear.com/1776554/best-android-tablet-under-ten-inches-small/",
      "text": "8 Of The Best Android Tablets Under 12 Inches You Can Buy Right Now\nWe may receive a commission on purchases made from links.\nAndroid has a proud history of tiny tablets. In fact, before the iPad Mini was a gleam in Tim Cook's eye, the first tablet to break mainstream with Google's OS was the petite Nexus 7 tablet released back in 2012. I still have my second generation Nexus 7, and despite all the advances in technology since then, it remains, in my opinion, one of the most well-designed devices in mobile history. But as phones ballooned in size, tablets of this size got crowded out of the market. Today, my Samsung Galaxy S25 Ultra boasts a screen almost exactly the same size as that tablet, while new Android tablets are verging into laptop territory with their screen sizes.\nWell, tiny tablets may be going the way of the dodo, but not everyone wants a mammoth mobile device. Sometimes, you need something that's easy to hold one-handed, or that doesn't hog space in a bag. As a major enthusiast of both Android and tablets (I even ditched my Windows laptop in favor of DeX on a tablet) I've rounded up the best shrunken slabs. I selected these devices based on their sweet specs and the satisfaction of both shoppers and professional reviewers, along with my own subjective sense of quality based on my knowledge of the tablet market.\nBecause of segmentation in the market, the best slab tablets under 10 inches are all budget or midrange devices. No flagships here. So, in order to give you more options, the definition of tablet is a bit loose here, including foldable devices and E-Ink tablets, so long as they run Android. So, here are eight of the best Android tablets under 10 inches you can buy today.\nBest small budget tablet: Samsung Galaxy Tab A9\nIf you're looking for a smaller-sized Android tablet on a budget, it's hard to go wrong with the Samsung Galaxy Tab A9. The A series is Samsung's budget range, so it's not the most powerful tablet on the market by a long shot. However, you won't notice unless you're planning to do heavy tasks like video editing or gaming. The main benefit of a cheap Samsung tablet is that it's got a great ecosystem, software and great support. Oh, and also, this tablet is ridiculously cheap, clocking in at under $190 on Amazon as of this writing, while Walmart offers it for an astonishing $102. All of that averages out to make this tiny tablet not great, but good enough for most people.\nThe A9 is powered by a Mediatek Helio G99, a 6 nm process that benchmarks solidly in the midrange of mobile processors. If none of that means much to you, this is the tablet you're looking for. With its 8.7-inch, 800 x 1340 pixel, TFT LCD display, it's not reaching the ludicrous specs of Samsung's larger, more premium tablets, but it's also not charging the eye-watering prices those devices command. For binging YouTube and Netflix, checking your email, or banging out a few rounds of Candy Crush, it will do the job just as well as tablets 10 times its price. This is the tablet I bought for my dad, and he's perfectly happy with it. I set it up for him, so I can confirm that it's got snappy performance out of the box, a crisp display, and solid build quality.\nReviews of the Tab A9 are similarly satisfied, though reviewers accustomed to testing bleeding-edge tech are predictably not shouting its praises from the rooftops. The consensus is clear: if you're looking to get the best possible tablet for the least possible money, you've found it. There is also a kids version available, if you're looking for a cheap way to get your kid a tablet.\nBest small gaming tablet: Lenovo Legion Tab Gen 3\nDespite being a relatively small player in the tablet space, Lenovo has been stepping its game up lately, and the latest product of those efforts is the Legion Tab Gen 3. This well reviewed slab is a delightfully compact package with an 8.8-inch screen, yet it packs a big punch with its Qualcomm Snapdragon 8 Gen 3 chip, a unique cooling system, and 12 GB of LPDDR5X RAM. Sure, that's last year's chip, but it's a seriously fast one found on many of the fastest flagship Android devices from that cycle.\nThat display seems pretty awesome given the Legion Tab Gen 3's size. It's a 2.5K resolution, LTPS panel, with a refresh rate of 165 Hz. That means the screen is faster than the most expensive Apple iPad Pro or Samsung Galaxy Tab, and although you'd rather see the newer LTPO technology over the LTPS Lenovo went with, it's hard to complain when this tablet starts at just shy of $500. Other specs are decidedly modern, though. For instance, the presence of Wi-Fi 7 here means you'll be able to take full advantage of the fastest wireless Internet speeds for years to come, and the 6,550mAh battery is massive for this size of a device.\nOn the software end, Lenovo's Android skin is competent, aesthetically inoffensive, and competes against Samsung with features like PC mode (a DeX-like experience). Unfortunately, it ships with Android 14 despite Google already dropping betas for Android 16. You'll save money on the accessories side, as the Tab Gen 3 comes with a breathable folio case with a screen cover and kickstand functionalities, as well as a tempered glass screen protector. And yes, the charger comes in the box, as it should.\nBest E-Ink Android tablet: Boox Palma 2\nThe original Boox Palma developed a bit of a cult following, especially among tech nerds bored with the status quo, and there are a ton of Boox Palma alternatives now. It was a tablet the size of a large phone running Android on an e-ink display of the sort typically found in e-readers. The Boox Palma 2 doubles down on that concept with a faster processor, newer version of Android, and more. Importantly, you should not expect to watch YouTube or Netflix on the Palma 2, as the e-ink screen is meant for showing paper-like text. You can download and run those or other video apps, but the videos will look hilariously low-quality. Boox touts the Palma series as an antidote to distractions, something you can break out on the train to catch up on your reading without feeling the urge to scroll TikTok instead.\nThe Boox Palma 2 has a 6.13-inch E Ink Carta display, 6 GB of RAM and 128 GB of storage. That's plenty of power for a device that won't ever be used for gaming and other tasks that require more modern specs. Android's strength has always been to let a thousand flowers bloom with innumerable form factors and configurations, and the Palma 2 is an oddball even by those standards. Of course, that's precisely what's made it such a hit with its niche audience of minimalist tech lovers and bookworms. Pretty much every review of this thing goes something along the lines of, \"I thought this would be stupid but then I fell in love with it.\" The biggest downside, assuming you're okay with the limitations of E-Ink, is that the Palma 2 commands a price tag of $280, which feels a bit much on Onyx's part.\nBest E-Ink Android tablet: Onyx Boox Tab Mini C\nIf the Palma 2 is a bit too grayscale for your tastes, or if you don't like the phone-like form factor, Onyx offers other smallish Boox devices. Gander at the Boox Tab Mini C, which has a 7.8-inch, color e-ink display great for comics readers, or for those who want a more expansive, vibrant canvas for note-taking. Again, this is not a tablet meant for video media consumption —other tablets on this list will serve you better in that arena —but it is purpose built for reading, note taking, and other such tasks. It includes a basic stylus as well.\nThe two main benefits to getting the Boox Tab Mini C over a more conventional Android tablet are that it's more comfortable for your eyes, and that the battery will last for what feels like forever. E-Ink has a slower refresh rate than a normal screen and renders images without using lights, and it can hold a static image without drawing any power, meaning the battery only needs to kick in every time you turn a page in a book or add a line to a drawing. This adds up to exceptional battery life, though in return you'll get a 12 Hz refresh rate. Reviewers have claimed several days on a charge with heavy use and weeks with normal use.\nDownsides other than those you'd expect from E-Ink are present, with reviewers miffed by the reliance on the older Android 11. Not as much of a problem here, in my opinion, since it's so heavily modified anyway, and what matters is whether Onyx updates it regularly. This device is also quite expensive, commanding a price tag of $400, though we've seen it on sale for less.\nBest foldable tablet: OnePlus Open\nIf you're looking for a small device that packs a big screen, a foldable phone might be the right choice. You get all the benefits of portability that come with a phone, yet you have instant access to a big, beautiful display when the need for one arises. The brand most synonymous with folding phones is Samsung, but savvy consumers should take a look at the OnePlus Open. As noted in SlashGear's OnePlus Open review, OnePlus is delivering a refreshingly different software experience that has some unique multitasking innovations to better take advantage of its expansive 7.8-inch inner display.\nThe OnePlus Open got rave reviews for its build quality and great feel in the hand, but the real star of the show is its software. Using an Android layer called Open Canvas, the Open finally provided a refreshingly different vision for multitasking after years of dominance by Samsung, whose One UI is as cumbersome as it is feature dense. Your phone or tablet isn't a desktop computer, and OnePlus doesn't treat it as such. Instead of minimizing windows, Open Canvas lays apps out side-by-side like sheets of paper on a table, letting you slide them around in a big grid.\nTwo things to consider before you spring for this device. First, it's only got an IPX4 water resistance rating, so don't splash it. Second, OnePlus is gearing up to release a sequel device in the near future, with leaks already showing that device in people's hands. You may want to wait for that device. Even if it ends up a dud, it should still drive the price down on the original Open.\nBest foldable tablet for Google fans: Google Pixel 9 Fold Pro\nI know, I know. Two folding phones on a list of small tablets is pushing things. But trust me, it's slim pickings in the sub-ten-inch tablet category these days. So open your mind like a foldable display as I extol the virtues of the Google Pixel 9 Fold Pro, a fantastic alternative to the OnePlus open if you're looking for something available from your phone carrier, or just enjoy the Google ecosystem. The handset has received reviews that range from satisfied to thrilled from the tech press, praised for its build quality, expansive 8-inch display, performance and battery life. What don't reviewers like? The price tag, which clocks in at a whopping $1,800 for an unlocked version of the 256 GB entry model. Even so, SlashGear's Pixel 9 Pro Fold review awarded it a stellar 9 out of 10 score.\nThe Pixel 9 Pro Fold is definitely among the most powerful devices on this list, with its latest generation Google Tensor chip and a chunky 16 GB of RAM. It's also guaranteed to get the latest versions of Android for another six years, which puts it leagues ahead of other devices mentioned here. And, like any other foldable phone-tablet hybrid, you're arguably getting two devices in one: a tablet that becomes a regular, pocket-sized phone when the extra screen isn't needed.\nBest small tablet for Amazon addicts: Fire HD 8\nSlightly removed from the wider world of Android tablets is Amazon's Fire Tablet HD 8, but if you're already invested significantly in the company's ecosystem, it can be a great choice. First, Fire Tablets are cheap, since Amazon expects them to be a gateway to further purchases, it takes less of a profit on its hardware devices than other companies can afford to and even runs ads on your lockscreen to make up the difference. With an 8-inch, HD 1280 x 800 pixel display, 3 GB of RAM, and 32 GB of base storage, you could do much worse for $100.\nHowever, the Fire Tablet line is best for Amazon enthusiasts. The Fire Tablet HD 8 is well reviewed, but boasts a custom version of Android — Amazon Fire OS — which relies heavily on the web retailer's services. You can make a Fire Tablet feel more like normal Android with some tricks. However, Alexa is here instead of Google Assistant, for example, and you'll have to use the Amazon Silk browser in lieu of Chrome, while apps come from the proprietary Amazon Appstore. That's an especially big problem if you use a lot of Google services. Just like Chrome, Gmail, Drive, and other Google services are absent on the Fire Tablet HD 8. What it offers instead is a heavily entertainment-focused experience that's connected to Amazon Prime Video, Kindle ebooks, and the company's game library. If you want to read the latest bestselling books, enjoy shows like \"The Boys,\" do your shopping at Amazon and Whole Foods, and already use Alexa for your smart home, this is the small tablet for you. If not, you'll find it frustratingly limited.\nBest small non-E-ink e-reader tablet: Barnes & Noble Nook 9 by Lenovo\nUnless it has an E-Ink display, the dividing line between a small Android tablet and an e-reader is blurry. After all, the e-reader portion of the device is just an app you could install on any old Android device. That's especially the case when it comes to the Barnes & Noble Nook 9\" Lenovo Tablet, a collaboration between bookseller and hardware manufacturer that's simply a custom version of the latter's M9 tablet from 2023 with the former's Nook app slapped on top. However, that combination actually adds up to a pretty decent little tablet, especially if you'd rather avoid Amazon for your e-reading needs, which helped make it one of our picks for the best non-Kindle e-readers.\nWith a 9-inch, 1,340 x 800 pixel, fingerprint resistant, LCD display backed up by the midrange MediaTek Helio G80 chipset and 64 GB of storage, its $150 price tag feels fair. Like other, similar tablets on this list, it's geared toward media consumption and has more than enough power for that purpose. What differentiates it from them is the preloaded Nook app that gives users access to Barnes & Noble's ebook storefront. Of course, you can add other e-reader apps like Amazon Kindle or Libby by Overdrive, as well as any other supported apps from the Play Store.\nThe Nook 9\" is well reviewed, with the main gripe from those reviews being the out-of-date Android version. Indeed, if that matters strongly to you, your best bet is a newer Samsung tablet. What reviewers enjoyed was the audio quality from the built-in speakers with Dolby Atmos surround sound support, the inclusion of a headphone jack, and specialized reading modes to prevent eye strain.\nHow these tablets were chosen\nEach of these devices were selected based on a combination of qualifiers to ensure adherence to SlashGear's rigorous editorial standards, including reviews from SlashGear and other outlets, as well as their specs within the overall market, and special considerations on a per-device basis. My expert opinion based on extensive knowledge of the tablet market was also a factor."
    },
    {
      "url": "https://www.slashgear.com/1686687/samsung-galaxy-tab-s10-plus-review-premium-android-tablet-stylus-test-2024/",
      "text": "Samsung Galaxy Tab S10 Plus Review: Premium Android Tablet With A Price To Match\nWe may receive a commission on purchases made from links.\nIn the world of Android tablets, there is a push to make a productivity machine that can compete with a laptop but be as light and portable as a tablet. Samsung in particular has been leading that charge for many years. There've been long periods of time where the only real viable choice for a high-end Android tablet was one made by Samsung.\nProductivity tablets in particular are a weird sort of niche for Android tablet users. If you ask around, you'll find a ton of uses from the education to the construction industries. It used to be that Android tablets in particular would just be glorified Netflix boxes, good for consumption and that was the end of the list.\nThese days, with processing power relatively easy to come by, the \"productivity tablet\" is becoming a force to be reckoned with. The advantages are obvious — mobile operating systems are what most people spend most of their time on, so why shouldn't that come in a larger form factor that's good for getting work done too?\nAt its most recent fall event, Samsung launched a pair of new tablets — the Galaxy Tab S10+ and the Tab S10 Ultra. I've been using a Samsung Galaxy Tab S10 Plus sample, provided my Samsung, in my office for around two weeks, and this is my full review.\nPlus and Ultra\nRight off the bat, something seems a little weird in that Samsung launched the Galaxy Tab S10+ (or Galaxy Tab S10 Plus, however you prefer), and the Tab S10 Ultra. In the past, we've seen a trio of tablets, starting with a non-plus version. What's a little peculiar is when you start with a plus edition, you start to wonder \"plus compared to what?\" and that's where Samsung left us scratching our collective heads.\nRegardless, here what you get in the Tab S10+. You get a 12.4-inch gorgeous screen at 1,752 x 2,800 pixels and 120Hz refresh rate. The tablet comes in 256 GB or 512 GB configurations, both with 12GB of RAM. But there's one more interesting part about the internals.\nYou also get a Mediatek Dimensity 9300+ processor, which is a first for a U.S.-based flagship. Qualcomm's Snapdragon processors typically power Samsung devices in the U.S., but a switch to Mediatek could prove to be an interesting one. At the very least it should spur Qualcomm into improving its own processors now that there's real competition in the space. It'll be exciting to see how this develops going forward.\nExtremely thin\nIn addition to the MediaTek processor and all the other specifications, this tablet has a 10,090 mAh battery, which is pretty large in the tablet space, especially considering how thin the table is. It's just 5.6mm thick, which is pretty impressive considering the amount of power this tablet packs. The type cover adds some bulk to it, but overall, this is an impressively thin and light tablet at 571 grams.\nAround the sides of the device, when it landscape orientation, there's a power and volume rocker in the upper left-hand corner, and a microSD card holder in the upper right corner. There are four side-firing speaker grilles on the top and bottom of each side and a USB Type C port on the right for power and data transfer.\nOn the back, there are dual cameras that you should not use. There's a 13-megapixel main camera and an 8-megapixel ultrawide camera. The front facing 12-megapixel selfie camera is just fine for video calling.\nProductivity comes extra\nAs with Samsung Galaxy Tabs in the past, the Galaxy Tab S10 Plus and Ultra both ship with the stylus in the box. That stylus attaches to the back of the tablet magnetically, and for those who want to draw and/or make fine selections, that's a nice addition. Personally, I rarely use the stylus on any tablet, but that's me. I would much rather buy a tablet with a keyboard in the box — oh and by the way, that's not the case here. The keyboard is sold separately.\nThis is just as surprising as it is welcome — which is to say in both cases, not at all. But Samsung is going a step further by marketing the fact that you have AI at the press of a button, without actually giving you the button to press. Never mind that this is marketed to be a productivity tablet that is basically impossible to be productive with. Maybe I'm an odd use case; maybe there are a ton of people out there with Bluetooth keyboards that they just refuse to give up. But the worst part is, the keyboard isn't even all that good.\nTo be fair, I don't mind it all that much, but I like slim, low-profile keyboards with minimal travel. But when you compare this keyboard to something like Apple's Magic Keyboard, this one is laughable. At least the keyboard on the OnePlus Pad 2 is detachable and can still work with Bluetooth. The fact that Samsung actually charges extra for this keyboard feels a bit silly.\nSpeaking of AI\nOf course, this is a Samsung tablet, so we need to talk about AI. One of the easiest ways to access AI is with the dedicated AI button which is on the keyboard that isn't included. Pressing the AI button summons either Bixby — which is still a thing by the way — or Google Gemini into a side panel. The implementation is actually really nice in that regard. I enjoy it.\nSamsung's other AI functions are here. Most of the ones I use are geared around the tablet's camera and image generation. In one case, I took a photo of the main reading room at the library and sketched a dog into being. It was quite a cute pupper at that.\nCircle to Search is here as well — basically all the AI functions you can access on phones are here on the tablet. A lot of Samsung's AI services are built into Samsung's own apps, such as Samsung notes, so if you're not into that ecosystem, you'll have trouble finding ways to utilize it — but the opposite is true, too, of course. Services like Circle to Search of course is more universal.\nWorking on the tablet\nBattery life is great on the tablet. I've been using the tablet for about two weeks and I've only had to charge it twice in that time. During those two weeks, I watched movies, did a lot of writing, and some of the lighter aspects of my job. I need to clarify this by saying that I'm not able to fully do all of my job on just this tablet because a lot of the systems we use for my job don't react kindly to tablets. This isn't a Samsung thing.\nAnything that was written or researched — over the span of two weeks — I did on this tablet. It came with me to several remote work sites including my local theme park for a bit of Sunday writing while my daughter enjoyed an early Halloween celebration. At no time was I nervous about battery life nor about the tablet's ability to do anything I needed.\nAs for benchmarking action with Geekbench 6, the tablet scores a 2,115/6,966 single/multi-core scores which are very solid numbers. Mediatek has been making waves in the flagship space; I'm not sure it's ready to stand toe to toe with Qualcomm, but it's doing a lot of things right.\nPrice, Availability, and Verdict\nThe Samsung Galaxy Tab S10 Plus is a worthy successor to the Tab S9 in every way. In fact, I almost prefer the smaller size to that of the Ultra, just in terms of portability. Mostly everything else is the same between the two tablets, so your choice will come down to size and of course budget. The price of the Tab S10 Plus starts at $999, which is in line with last year's offerings. What's different is there is no not-plus version, which is a bummer if you wanted something smaller and cheaper.\nOne dollar away from $1k is a very high price for a tablet like this, but this is a fine tablet in a lot of ways. The keyboard (which you have to buy separately anyway) does not feel as high-quality as the tablet — it has a \"cheap\" feeling.\nThe tablet itself is thin, and light, and high quality. The S Pen attachment to the back of the tablet is fairly solid but won't stand up to being put into nor taken out of a bag — unless you have the keyboard case (which is not included) with the convenient cover. Did I mention the keyboard case is not included, because I didn't want to accidentally not mention that the keyboard is not included in the price of the tablet.\nIf you can get past all that, you then need to ask yourself if you need a $1000 tablet, and if so, what do you need it for? $1000 is well into very good laptop range, so if all you want is a laptop, there are options. If you need that laptop to run Android for some reason, I guess you have a point, but in this particular area your mileage will vary.\nAs such, if you're in the market for an Android tablet whose value matches its $1,000 price tag, this is the new best one to beat. The Tab S10+ can be bought from Samsung.com and many other retail outlets like Amazon."
    },
    {
      "url": "https://www.zdnet.com/article/finally-an-android-tablet-that-i-can-confidently-recommend-to-gamers/",
      "text": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nFinally, an Android tablet that I can confidently recommend to gamers\nRedMagic Astra\nZDNET's key takeaways\n- The RedMagic Astra gaming tablet is available on Amazon starting at $700.\n- The tablet offers unmatched performance for an Android tablet.\n- When the fan is in use on the Astra, the battery does drain a bit faster, and the price is up there for a tablet.\nAs far as gaming is concerned, I'm not ashamed to say that I've done it all: consoles, PCs, handhelds, phones, and now, tablets. For the most part, I've found Android devices to offer less than stellar results. Tablets are often too slow or their displays aren't up to the task, and phones are simply too small. That's a shame, because tablets and phones are the most portable.\nAlso: Why I recommend this Lenovo tablet over competing models that cost twice the price\nRecently, however, I was sent the RedMagic Astra Gaming Tablet, and I do believe it's changed my opinion on gaming with Android. What about this tablet has flipped the switch?\nMy experience\nWith every Android device, the onboarding is fairly simple, so I was able to get to the gaming fairly quickly. Even before that, my first impression was that this tablet seemed faster than any Android tablet I've ever used. On top of that, the display was gorgeous. The animations are as buttery smooth as I've ever seen on an Android tablet. By a long shot.\nAlso: I use this budget Android tablet more than my iPad Pro - and why you probably would, too\nAfter I played around with various actions to keep testing the animations and app opening speeds (which were blazing fast), I decided to dive into what this tablet was built for: gaming. I downloaded \"Diablo: Immortal\" because I've experienced that on lesser tablets and witnessed, first hand, what underpowered hardware can do to the game.\nThe first thing that struck me was how fast the game installed, and then how fast the data download was. I've installed this game on several Android devices, and the data download was always slow.\nWithin two minutes, I was playing the game and, it was impressive. The RedMagic Astra plays every bit as well as a console system. The graphics are smooth, the sound is surprisingly good, and the overall experience is phenomenal.\nAnd that was without flipping the performance tuning switch. The Astra has a small red switch you can toggle to enable a special mode. When I switched it on, a new UI opened (called Energy Cube) with the \"Diablo: Immortal' launcher ready to go. I'd already played the game for a while outside of this special mode, so I decided to see if there was any improvement to gameplay with it on.\nEnergy Cube features behavioral learning as well as an auto fan option (to keep the tablet cooler during longer sessions), as well as on-demand recording. You can also tune the performance to meet your needs (or the needs of a particular game).\nOnce I launched Diablo: Immortal from the Energy Cube, there was a slight improvement in performance. Remember, however, that the game already played incredibly well outside of Energy Cube, so even a slight bump in performance was impressive.\nAlso: Why I prefer this Lenovo tablet over the iPad for multimedia consumption\nThe big thing I noticed, from playing the game within Energy Cube, is that the device didn't get nearly as warm (because of the fan activation). At the same time, the battery did drain a bit faster.\nThe tablet's fan is a 20,000 RPM active cooling fan, which is combined with a 13-layer IEX cooling system. Needless to say, this tablet does not get hot, so I wonder if the hardware is a bit overkill, here. Even with a faster power drain, however, it still holds its own. The 8,200 mAh battery supplies hours of gameplay on a full charge.\nWhat about everyday use?\nThis tablet absolutely excels at gaming (far beyond any tablet I've tested). But outside of that use case, I was just as pleasantly surprised.\nAlso: This ultra-tough Android tablet can handle drop, bumps, and long hours on the job\nFrist off, the Astra is on the smaller side (nine inches), which is great for gaming. I've tried to game with a larger tablet, only to find my fingers and wrists grew tired after a longer session. For everyday use, the nine-inch screen is a bit small, but not too small to render it a burden for web browsing, email, and the usual tasks I do on a tablet. In fact, after a while, I got used to the smaller display and found I preferred it to the larger tablets I have.\nZDNET's buying advice\nI have no trouble saying that this is the most satisfying Android tablet experience I've had to date. The RedMagic Astra Gaming tablet is offered in three different configurations, starting at $700. That extra 4GB of RAM and 256 GB of added storage are well worth the price bump, and part of what contributed to my tablet's fantastic performance. It's not the cheapest tablet on the market, but its performance justifies the cost.\nIf you're looking for an Android tablet for gaming, this is definitely the one to beat (and I don't see any Android tablet beating it any time soon). As well, if you want a high-end tablet for everyday usage (and you don't mind the smaller screen), this is still a fabulous option.\nThe specs\n- CPU - Snapdragon 8 Elite.\n- Display - 9.06-inch 2.4K OLED.\n- Cooling - 13-layer ICE-X cooling system.\n- RAM/Storage - Up to 24GB RAM and 1TB of storage (a version that is only available on the RedMagic site)\n- Battery - 8,200 mAh large battery with fast charging support."
    },
    {
      "url": "https://www.androidcentral.com/tablets/redmagic-astra-oled-gaming-tablet-ive-always-wanted",
      "text": "Redmagic Astra is the OLED gaming tablet I've always wanted\nWith a 9.06-inch OLED and the best internals money can buy, the $499 Astra is a delightful gaming tablet.\nRedmagic is clearly intent on building out its portfolio this year; the 10S Pro proved to be a terrific gaming phone, and the brand is now venturing into Android tablets. The Astra is a mid-range tablet with a stylish design that's in line with the brand's phones, and it runs the latest Qualcomm silicon alongside an 8,200mAh battery.\nBut what I like the most is that the Astra comes with an OLED panel. Most Android tablets continue to use an LCD panel, and you just don't get the rich contrast levels and vibrancy that an OLED delivers, so the fact that Redmagic went with OLED is enough to distinguish the Astra from its rivals.\nThen there's the value; the Astra starts at just $499 on Redmagic's site, and that's ridiculous when you consider the hardware it's packing. The same tablet is listed on Amazon for $699, so it's clear that Redmagic is incentivizing the launch with a decent discount on its site. The base model comes with 12GB of RAM and 256GB of storage, and there's also a 16GB/512GB edition that costs $649, and a 24GB/1TB model that retails at $849.\nA design that's meant to stand out\nThere's no mistaking the fact that the Astra is a gaming tablet; it has a bold design that's similar to Redmagic's gaming phones, and it looks pretty distinctive. There's RGB lighting at the back (obviously) around the Redmagic logo and the built-in fan next to the camera housing, and it is customizable.\nThe back of the tablet is made out of aluminum, but there's a glass insert that breaks up the design quite well, while giving it a bit of flair. The Astra has excellent in-hand feel; the sizing is just right, and it isn't uncomfortable in the least. It isn't too heavy at 370g either, and I didn't have any issues using the tablet for hours on end.\nWhat's particularly great is that the tablet has a flat back with no camera protrusion whatsoever — just like the 10S Pro — and that alone makes it much better to use. There's no wobble when using the Astra on a table, and the 6.9mm width along the sides along with rounded edges make it easy to hold and use.\nThe build quality is excellent; the mid-frame is made out of aluminum as well, and I didn't see any problems whatsoever in the month I used the tablet. It gets IP54 ingress protection as well, and there are identical stereo channels, delivering great onboard sound.\nGet the latest news from Android Central, your trusted companion in the world of Android\nThe bezels are thinner than most Android tablets I used in recent months, and they're symmetrical on all sides, which is an achievement in and of itself. I like that Redmagic went with a 9.06-inch OLED panel instead of the usual 11 or 12-inch tablets that are standard; the smaller size makes the Astra that much more portable, but you still get adequate screen real estate.\nThis is a gaming powerhouse\nThe panel itself is fantastic; it has a resolution of 2400 x 1504, and it goes up to 165Hz refresh in select games. The OLED panel has outstanding color vibrancy and contrast, and it's a definite point of differentiation. You also get LTPO tech and 5,280Hz PWM dimming, and it gets bright enough that I didn't notice any issues even under sunlight. It's not a tandem OLED panel like my iPad Pro M4, but it is better than any other Android tablet I used.\nGaming on the Astra is a real delight, and the tablet handles demanding titles without breaking a sweat. It uses an active cooling solution (a small fan that's located at the back) alongside an innovative thermal management system, and the result is that it doesn't throttle even under load. It tends to overheat at times, but it isn't anywhere as uncomfortable as a gaming phone thanks to the larger surface area, and this was only an issue while running 3DMark's stress tests.\nBasically, this is the most affordable way to get your hands on the Snapdragon 8 Elite in the U.S., and the gaming tablet lives up to its potential. I got the 16GB/512GB model, and I believe this is the sweet spot; all models come with LPDDR5X RAM and UFS 4.1 storage.\nJust like Redmagic's gaming phones, the Astra delivers high refresh rate gaming in select titles, and that makes it highly enjoyable. The onboard sound gets loud and detailed, and there's a Magic Key on the side that's customizable. The tablet gets a fingerprint reader along with face unlock, and it's fast to authenticate. The vibration motor is pretty good too, and it has decent feedback.\nThanks to an 8,200mAh battery, the Astra easily lasts a few days with regular use, and it delivers nearly eight hours of gaming. It takes just over 80 minutes to charge the device thanks to 80W charging, but there isn't a charger included in the package.\nSoftware that you actually want to use\nThe tablet runs Redmagic OS 10.5 based on Android 15 out of the box, and the software has good fluidity and not much in the way of overt styling. There's enough customizability should you need it, and I like that Redmagic cleaned up its interface in the last 18 months. There isn't any unnecessary AI bloat either, with Redmagic instead teaming up with Google to deliver Gemini and real-time translation and editing utilities.\nThe only issue is that the Astra will get just two software updates, and that limits its long-term usability. The hardware should easily last a half-decade at least without any noticeable slowdowns, and Redmagic really needs to do better. Other than that, the only other omission is 5G connectivity — the Astra doesn't get any cellular modem.\nOverall, the Astra is the best Android gaming tablet available today. The OLED panel combined with the latest Qualcomm silicon makes it a true gaming powerhouse, and the portable size along with huge battery means you can game just about anywhere.\nHarish Jonnalagadda is Android Central's Senior Editor overseeing mobile coverage. In his current role, he leads the site's coverage of Chinese phone brands, networking products, and AV gear. He has been testing phones for over a decade, and has extensive experience in mobile hardware and the global semiconductor industry. Contact him on Twitter at @chunkynerd.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.tomsguide.com/computing/android-tablets/forget-the-ipad-mini-this-9-inch-oled-android-tablet-is-way-better-for-gaming",
      "text": "Tom's Guide Verdict\nRedMagic is taking the fight to Apple when it comes to small tablets. The Astra gaming tablet offers a one-two punch of the latest Snapdragon processor alongside an OLED screen with a 2.4k resolution and a 165Hz refresh rate. The design is cool without being garish, and while the price may seem high, what you get in return is undeniable. Battery life isn't going to outperform larger form factors, but if you want a small, powerful Android device, then this is what you should get.\nPros\n- +\nCompact and powerful\n- +\nSnapdragon 8 Elite chipset\n- +\n2.4K OLED screen is jaw-dropping\n- +\nActive cooling system\n- +\nNo camera bump\nCons\n- -\nBloatware\n- -\nOccasional software glitches\n- -\nWeird USB-C placement\n- -\nNo 5G cellular\n- -\nOnly 3 years of software support\nWhy you can trust Tom's Guide\nThere's been a hole in my life ever since I finally said goodbye to my aging iPad mini several years ago. In my mind, Apple's smallest iPad is one of the best tablets out there, but the arrival of the RedMagic Astra this month has given me pause. What's on offer is pretty simple: a compact Android tablet running the latest and greatest chipset designed for a supreme gaming experience.\nWhile I'm not a massive mobile gamer, I've always appreciated that the iPad mini 7 didn't compromise on power even though it was smaller than its bigger brethren. The same is true here. RedMagic has thrown everything but the kitchen sink into this device thanks to a Snapdragon 8 Elite chip, a stunning OLED screen, active cooling, fast charging and a slick design.\nSpace is at a premium in my everyday carry, and I'm not quite willing to pony up for one of the best foldable phones, no matter how slim the new Samsung Galaxy Z Fold 7 is. That leaves me looking for that Goldilocks device; a tablet larger than a phone but not as big as a hybrid, that doesn't compromise on power and has a few unique tricks up its sleeve. And after having used it for a couple of weeks, I think the RedMagic Astra delivers on all fronts. Let me tell you how...\nRedMagic Astra: Specs\n| Row 0 - Cell 0 | RedMagic Astra |\nStarting price | £529 / $699 |\nDisplay | 9.06-inch OLED (2,400 x 1,504) |\nRefresh rate | 165Hz adaptive |\nRear camera | 13MP |\nFront cameras | 9MP |\nChipset | Snapdragon 8 Elite |\nRAM | 12GB/16GB/24GB |\nStorage | 256GB/512GB/1TB |\nBattery | 8,200 |\nCharging | 80W |\nOperating system | RedMagicOS 10 / Android 15 |\nSize | 207 x 134.2 x 6.9 mm / 8.1 x 5.2 x 0.27 inches |\nWeight | 370 grams / 0.81 pounds |\nColors | Eclipse/Starfrost |\nRedmagic Astra: Price and availability\nThe Redmagic Astra comes in three different configurations with pricing to match. The entry-level price for both the Eclipse (black) and Starfrost (silver) versions gets you 12GB RAM and 256GB of storage for $699 / £499.\nIf you opt for 16GB RAM and 512GB storage, that pricing increases to $799 / £699.\nAnd if you push up to 24GB RAM and 1TB storage, the cost goes up to $949 / £879. Just note: only the Eclipse colorway is available in this configuration.\nThose prices are a little on the high side and put this above the level of a casual purchase. For example, the entry-level price is actually higher than the $499 starting price for the iPad mini 7. It's true that Apple's tablet has half the storage for that price, but still — if you want a small tablet on a budget, then Apple actually has the edge here.\nGet instant access to breaking news, the hottest reviews, great deals and helpful tips.\nHowever, Apple's pricing increases to $799 if you want 512GB of storage on the iPad mini 7, so once you start getting into the higher configurations, you're getting better value from Redmagic.\nPerhaps a more realistic comparison is Lenovo's Legion Tab, another 8-inch tablet with a gaming focus that also starts at $549, albeit with an older chipset and an LCD screen rather than an OLED one.\nAnother recent Android tablet to launch with the Snapdragon 8 Elite chipset is the OnePlus Pad 3, which commands a £599 / $699 price for its 16GB RAM and 512GB configuration — but that's also got a larger 13.2-inch screen.\nRedMagic Astra: Design\nGaming devices can be somewhat divisive when it comes to design, but I think most people would be hard-pressed to find fault with the RedMagic Astra. Bezels around the front of the device are kept to a minimum, thanks to the 90.1% screen-to-body ratio, while the back is pretty understated.\nFirst up, I'm not sure I can remember the last time I used a tablet (or phone) without a camera bump. Seriously, it's been that long. The Astra is completely flush across the back, which means you can slide it in and out of a backpack, prop it up on a stand or even attach it to a telescopic controller without any resistance.\nThe aluminum frame has rounded corners and measures a pitch-perfect 7.3mm thick — enough to give you something to grip onto without being too chunky. The power button sits on the left edge naturally, where your index finger rests while holding it in landscape mode, and doubles up as a fingerprint scanner. The Astra's USB-C port is across from it on the right edge. Up top is the volume rocker and RedMagic's metallic red slider that toggles on its Game Space launcher — more on that later.\nI'm not quite sure why RedMagic decided to put the USB-C on the right-hand side — it's too far up to use in a telescopic controller, and because it's not on the bottom, you can't easily attach it to a dock or charging station.\nWhether you opt for the Starfrost or Eclipse color, you get a soft matte finish on the back that looks awesome. It dulls those pesky reflections you get with a glossy finish, although this slate still isn't immune to fingerprint smudges.\nAside from the single RedMagic logo in the middle of the chassis, there's a rectangular glass window running along the top that gives you a glimpse of a PCB-stylised graphic with gold stamps for the Snapdragon 8 Elite logo, as well as highlighting the vapor chamber and \"composite liquid metal\" build.\nThere's also the RedMagic logo written out in font, which you can set to pulse with light in the tablet's settings. You can also illuminate the ring around the camera lens.\nThese small bits of RGB lighting let you subtly know it's a gaming machine and they can be set for additional functionality, like working with an alarm or indicating a charging process.\nThe RedMagic Astra is rated IP54 waterproof, which means it'll survive the odd splash if you want to take your gaming session outside in the rain or into the shower — but it's not going to survive being fully submerged.\nOne small gripe I have about the design is that the speaker vents are placed on the left and right below the power button and USB-C port. This means that when you're gripping the tablet in landscape mode, your palms can muffle the output and spoil the audio quality. Given the relative size of the device, I'm not sure where else you would locate the speakers, but if the power button and USB-C port had been shifted to the top and bottom, respectively, RedMagic may have been able to shift the speaker grilles further up and alleviate the problem.\nAll told, though, I'm a real fan of the RedMagic Astra design. It leans just enough into a premium, gamer sci-fi vibe to be recognized as a premium tablet without being garish. Meanwhile, the heft (370g) and proportions — about the same as a Moleskine notebook at 134.2mm (H) x 207mm (W) x 6.9mm (D) — are just right to slip into my rucksack without making a nuisance.\nRedMagic Astra: Display\nIf the design around back is cool, then the RedMagic Astra's display is ice cold — and probably one of the best reasons I have to recommend this device. Not just to anyone wanting a gaming machine, but anyone wanting a small, powerful tablet, period.\nYou get a full-on OLED display with a 165Hz refresh rate and 1,600 nits of peak brightness. It's absolutely popping with vibrancy and contrast in games like Call of Duty: Mobile or Genshin Impact, and it's really impressive.\nThe 2,400 x 1,504 pixel resolution is more than enough on the Astra's 9.06-inch screen (with a 16:10 aspect ratio), and if you want to switch off the games and enjoy one of the best streaming shows, it's just as good. It doesn't support HDR on services like Netflix, but to my eye, the contrast on those deep blacks still looked fantastic.\nRedMagic Astra: Performance\nThe Snapdragon 8 Elite chipset has made itself at home in a number of the best Android phones, but is still relatively rare in tablets. The RedMagic Astra has the regular version of the chip without an overclocked CPU. I was able to comfortably run Genshin Impact, Call of Duty, FC Mobile, Command & Conquer: Rivals and Horizon Chase with the Astra set to 165Hz, and it was the best gaming experience I've ever had on a tablet.\nFrom loading up and navigating through menus to actual gameplay, the experience was fluid and responsive without a hint of stutter or lag. I'm no fan of touchscreen gaming, but the response rate — to my untrained fingers — was sublime.\nThere's an active cooling system and the vapor chamber inside the RedMagic Astra, and the fan will start up under aggressive conditions to try and keep the thing cool. You can hear it whirring away if you put your ear to the back of the device, but otherwise it won't spoil your gaming session, and it succeeds in keeping the tablet cool throughout even the most demanding games.\nRunning the Astra through a series of benchmarks just confirms the inevitable; this device blows its competition away when it comes to sheer grunt. It scored higher than the OnePlus Pad 3 on single-core Geekbench score and narrowly lost out on multi-core. Meanwhile, it swatted away Apple's M3 iPad Air without breaking a sweat. You can see the full results in the table below.\n| Row 0 - Cell 0 | RedMagic Astra | OnePlus Pad 3 | Samsung Galaxy Tab S10 Plus | iPad Air 2025 (11-inch) |\nChipset | Snapdragon 8 Elite | Snapdragon 8 Elite | Dimensity 9300 Plus | Apple M3 |\nGeekbench 6 score (single-core / multi-core) | 3,136 / 7,376 | 2,980 / 8,993 | 2,137 / 7,130 | 3,042 / 11,804 |\n3DMark Wild Life Extreme Unlimited (score / fps) | 5,628 / 33.70 | 6,410 / 38.38 | 5,121 / 30 | 5,806 / 34.8 |\nAdobe Premiere Rush time to transcode (mins:secs) | 0:54 | 0:53 | 0:43 | 0:18 |\nThe basic RedMagic Astra comes with 12GB RAM and 256GB storage, while the higher-spec model I've been using has 16GB RAM with 512GB onboard memory. If you really want to go overboard, you can pick this tablet up with 24GB of RAM and a massive 1TB of storage.\nMost people won't need that, but if you've got deep pockets (read: $899) and want a device for the long haul, you may be interested.\nRedMagic Astra: Battery and charging\nBattery life is something you usually have to sacrifice with smaller devices, but the Astra does a commendable job when it comes to staying power. Tucked inside that stylized matte casing is an 8,200mAh battery that RedMagic quotes will give you around 5.5 hours of gameplay at full frame rate or 5.3 hours of gameplay whilst livestreaming.\nIf you want to use it for movies, RedMagic claims you'll get 33 hours of continuous playback before it dies.\nIn more day-to-day usage, you're going to get somewhere in between those two extremes. I fired the RedMagic Astra up at 9am and used it continuously until 6pm for streaming video, playing music, browsing the web and playing some games. All of which with the screen at full brightness and locked to 165Hz.\nI took a break for a few hours at 6pm, but came back to it for another two hours later in the evening for a little more YouTube and gaming with a Bluetooth controller attached. Even after nearly 12 hours, I still had a quarter of its available charge left. That's pretty good considering my colleague Tony took a similar approach with the iPad mini 7 and landed on 10 hours and 34 minutes before that device died.\nAs you'd expect, the Astra supports 80W charging and will charge to full in 71 minutes when connected to a compatible charging brick. You just need to be aware that RedMagic doesn't ship the device with its own charger.\nPart of the reason RedMagic says the Astra can last this long is due to its \"Liquid Metal\" technology. The company says it used an indium-based alloy formed mostly from potassium to create a solid piece of metal with strong thermal conductivity. Placing this directly over the CPU lowers the chip's temperature by up to 5°C and improves the overall thermal performance and, by extension, efficiency.\nRedMagic Astra: Software\nThere's some good and some bad when it comes to the software side of things here. Bad stuff first; this tablet comes pre-loaded with the kind of bloat I assumed was a thing of the past, but is sadly all too common with Chinese manufacturers. Thankfully, much of it can be uninstalled swiftly, but it's still a laborious process that takes some of the sheen off firing up a brand-new tablet.\nSimilarly, I noticed a particular quirk when I was scrolling through my email inbox, and the messages were all layered on top of each other into a blurry mess. I fixed the issue by forcibly locking the screen to 65Hz and reloading the app. It hasn't happened before, but I wouldn't be surprised if I run into a few other glitches here and there.\nThankfully, the RedMagic Astra keeps things mostly to stock Android 15 with a few tweaks added by the company's RedMagic OS 10.5 skin. You get some extra options like the aforementioned RGB lighting on the back of the device, around the camera lens and the company's logo. Alongside the aforementioned bloatware, there's also some AI gimmicks like \"RedMagic Translation\" that offers you real-time voice translation on voice content. Finally, there's an app sidebar you can call up at any time by swiping in from the side of the screen and holding for a few seconds. This displays your recently or most-used apps and can be handy.\nOne thing I would have liked to see is a real multitasking solution akin to OnePlus' Canvas feature. The RedMagic Astra is more than powerful enough to run a bunch of apps simultaneously, so (even on a small screen) not having software take advantage of this seems like a missed opportunity.\nBut when the rubber meets the road, this is a gaming device, so the star of the show is RedMagic's Game Space — activated via a slide of the metallic red toggle on top.\nThis transports you (through a fancy, lightspeed-esque graphic) into a game launcher where you can find all your games as well as quick settings for CPU and GPU performance.\nAnd you can tweak the settings for each individual game. It's a simple procedure to toggle superior performance for a demanding game like Genshin Impact while easing back on the throttle for something simple like your next round at Solitaire.\nRedMagic Astra review: Verdict\nThe RedMagic Astra is a certified contender for the best gaming tablet you can buy, thanks to the combination of the Snapdragon 8 Elite chip and a jaw-dropping OLED 165Hz screen. It doesn't come cheap, but then considering the hardware and specs you're getting for the price, there's a whole lot of value on offer here.\nAre there some drawbacks? Of course. There's no 5G cellular option for a start, and whilst the hardware and battery will last you a good few years, the same can't be said for the software. RedMagic has committed to three years of software updates (including one major Android update), which isn't good enough in an age where Samsung is supporting its phones for seven years.\nLooking past those points, the RedMagic Astra is a fantastic device even if you're not a huge gamer. It'll handle any pro-grade app you throw at it, and you could just as easily use this for a bit of on-the-go video editing or hook it up to a monitor and a Bluetooth keyboard and use it as a work machine. You can get a range of dedicated accessories, like a stylus, case or gamepad, directly from RedMagic, too.\nSmaller tablets generally don't have the allure of their larger siblings, but I'm a big fan because I rate portability highly. And while I feel like I've always had to compromise on power or battery life to achieve that, the RedMagic Astra shows I can have my small cake and eat it.\nIf you want a small, powerful tablet that's not the iPad Mini 7, then this is the device for you. It helps a bit if you like to play games, too.\nJeff is UK Editor-in-Chief for Tom’s Guide looking after the day-to-day output of the site’s British contingent.\nA tech journalist for over a decade, he’s travelled the world testing any gadget he can get his hands on. Jeff has a keen interest in fitness and wearables as well as the latest tablets and laptops.\nA lapsed gamer, he fondly remembers the days when technical problems were solved by taking out the cartridge and blowing out the dust.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.phonearena.com/reviews/redmagic-astra-tablet-review_id7446",
      "text": "RedMagic Astra tablet review: Gaming at 9 inches\nCan a 9-inch gaming tablet make some ripples in the vast slate ocean? The RedMagic Astra aims to do just that\nRedMagic Astra Intro\nA couple of years ago, when smartphones started pushing the 7-inch screen size, we thought that small tablets were done for. And they did slowly wither away, leaving the scene open to their bigger 10-inch and above relatives.\nNow we're looking at the RedMagic Astra and can't help but wonder, is there really a place for a sub-10 inch tablet on the market, and especially for a gaming tablet? Because that's what the Astra is – a 9-inch gaming tablet with some interesting tech inside and cool looks.\nWith its price tag of around $500 (499 euros in Europe), the device is quite attractive and actually aims to challenge the iPad Mini that carries the same price and is very similar in size. But at the end of the day, it's a dedicated gaming device, and we shouldn't forget that.\nNow we're looking at the RedMagic Astra and can't help but wonder, is there really a place for a sub-10 inch tablet on the market, and especially for a gaming tablet? Because that's what the Astra is – a 9-inch gaming tablet with some interesting tech inside and cool looks.\nWith its price tag of around $500 (499 euros in Europe), the device is quite attractive and actually aims to challenge the iPad Mini that carries the same price and is very similar in size. But at the end of the day, it's a dedicated gaming device, and we shouldn't forget that.\nAbove, you can find a breakdown of the RedMagic Astra tablet review score by category.\nTable of Contents:\nRedMagic Astra Specs\n165Hz of smoothness\nLet's start with an overview of the RedMagic Astra specs:\n| RedMagic Astra |\n|---|\n| Size and Weight 134.2 x 207 x 6.9mm, 370 grams |\n| Display 9.06 inches, OLED 2,400 x 1,504 pixels (~312 PPI) 165Hz, 1600 nits peak brightness |\n| Processor Qualcomm Snapdragon 8 Elite (3nm) Adreno 830 at 1.1GHz |\n| Software Android 15, Redmagic OS 10.5 |\n| Cameras 13 MP main camera 9 MP front camera |\n| Battery Size 8200 mAh |\n| Charging Speeds 90W wired No wireless |\n| Storage and RAM 12/256GB 16/512 GB 24GB/1TB |\nRedMagic Astra Design and Display\nCompact and stylish\nThe overall aesthetics of the RedMagic Astra fall in line with the latest members of the RedMagic 10 family. There's a transparent strip of glass on the back housing the camera, the RGB fan and RedMagic logo, as well as some faux-schematics of the internals of the tablet, including the Snapdragon 8 Elite chip, the vapor chamber cooling, etc.\nWe got the black version of the Astra, which relies on a matte black finish, and in this color, the design looks extremely cool. The aluminum unibody has an ever-so-slight radius to the sides and feels premium to the touch.\nIn terms of buttons, we have a slightly recessed power button on the left side, a volume rocker on the top left, and the red slider called Magic Key that activates the GameSpace mode. There are also two stereo speakers on both sides and a USB-C port.\nRedMagic boasts a 4.9 mm uniform bezel around the screen, which sounds quite thin, but with such a compact device, it just looks normal. This kind of a bezel would've looked amazing on a 12-inch tablet.\nWe got the black version of the Astra, which relies on a matte black finish, and in this color, the design looks extremely cool. The aluminum unibody has an ever-so-slight radius to the sides and feels premium to the touch.\nIn terms of buttons, we have a slightly recessed power button on the left side, a volume rocker on the top left, and the red slider called Magic Key that activates the GameSpace mode. There are also two stereo speakers on both sides and a USB-C port.\nRedMagic boasts a 4.9 mm uniform bezel around the screen, which sounds quite thin, but with such a compact device, it just looks normal. This kind of a bezel would've looked amazing on a 12-inch tablet.\nThe retail box isn't as lavish as we've been used to when it comes to RedMagic devices. Normally, you would find a charging brick inside, some kind of a cover or a case, and sometimes even additional accessories.\nIn this case, though, you're getting the tablet, some stickers and a USB-C cable, and that's it. It's a bit disappointing, especially given the gaming nature of this beast, but it is what it is. Let's move to the screen, which kind of redeems the modest retail box.\nThe Astra comes with a 9.06-inch OLED panel that can refresh at 165 Hz (mainly during gaming) and also boasts 1600 nits of peak brightness (1100 nits typical). It's not unusual to see OLED screens on tablets nowadays, but some, if not most, still use LCD panels to keep the cost down.\nThe resolution is 2.4K (2,400 x 1,504 pixels), which at this screen diagonal equals around 312 PPI pixel density, pretty good for a 9-incher. RedMagic also claims that the Astra's display covers 100% of the DCI-P3 color gamut with precise color accuracy of ΔE < 1, and we're about to test all those claims.\nYou have complete control over many aspects of the Astra's hardware and software. You can choose the mode the CPU and GPU are using, add helpful software tools such as crosshairs, quick presets, and control notifications; add hardware periphery such as a mouse and keyboard; and more.\nIt's done in a very intuitive way; you can either choose from various performance presets or dive deep and tweak parameters yourself. For the gaming test we decided to use Genshin Impact, as it's one of the heaviest and most resource-demanding mobile games out there.\nThe Astra handled the game flawlessly – we set everything to maximum, and the game ran smoothly with no lag or any frame rate drops. To be fair, the tablet got a bit hot while playing, and the fan could be heard, but nothing too unpleasant to our ears or hands.\nThe battery inside the RedMagic Astra has an 8,200 mAh capacity, which is pretty decent considering the small footprint of the tablet. The company advertises a gaming battery life of 5.5 hours in Honkai: Star Rail, as well as up to 33 hours of video playback.\nLet's see how the tablet tackled our battery tests.\nThat's an excellent question right there! The RedMagic Astra gaming tablet caters to a very specific audience. On the one hand, people who enjoy some heavy and competitive mobile gaming but, for some reason, find most smartphones too small in terms of display size.\nOn the other hand, though, the Astra lacks dedicated hardware controls such as shoulder buttons or capacitive zones to give you that extra precision and flexibility during gaming, so it's a pros-and-cons situation.\nThere are some very strong sides to this slate – the display is simply amazing, and the 165 Hz refresh rate is super smooth. There's power on tap you can use in non-gaming scenarios as well, and the compact nature of the Astra makes it a perfect travel buddy.\nBut you have to outweigh this against the kind of short battery life, the lack of wireless charging and the mediocre camera if you want to use it as a non-gaming regular tablet.\nThe resolution is 2.4K (2,400 x 1,504 pixels), which at this screen diagonal equals around 312 PPI pixel density, pretty good for a 9-incher. RedMagic also claims that the Astra's display covers 100% of the DCI-P3 color gamut with precise color accuracy of ΔE < 1, and we're about to test all those claims.\nLooking at the test results above, most of the claims hold true. The Astra was able to output over 1000 nits at 100% APL (and pretty much the same number at 20% APL, which leads us to the conclusion that it's limited at this threshold), and that's quite good.\nThe cited under deltaE of under 1 was apparently measured at different brightness levels and settings than the ones we use in our test, but nevertheless, a result of 1.34 is impressive for a tablet and a gaming device. Minimum brightness is a bit high, so gaming sessions at night might require some ambient lighting, but all in all, the display of the Astra is pretty impressive.\nThe cited under deltaE of under 1 was apparently measured at different brightness levels and settings than the ones we use in our test, but nevertheless, a result of 1.34 is impressive for a tablet and a gaming device. Minimum brightness is a bit high, so gaming sessions at night might require some ambient lighting, but all in all, the display of the Astra is pretty impressive.\nNow, in terms of biometrics, the power button doubles as a capacitive fingerprint scanner, and you can also set up facial recognition. The latter relies only on one simple front-facing camera, so it's not as secure as other systems that employ ToF sensors and 3D facial scans.\nThe Snapdragon 8 Elite is the go-to silicon when it comes to high-intensity applications nowadays, and gaming is surely one such scenario. The RedMagic Astra comes with the regular version of the chip (no overclock to the performance core), but the Adreno 830 GPU has been clocked to reach up to 1,100 MHz (pretty much the graphics performance of the Leading Version of the Snapdragon 8 Elite we tested inside the RedMagic 10S Pro).\nIf you set the Astra to 165 Hz and leave it in high-performance mode, your day-to-day experience outside of gaming will be amazingly smooth. It makes the table a tad hot and also engages the cooling fan, but the performance is there. Let's check out the synthetic benchmarks for some data-driven proof of the above.\nIf you set the Astra to 165 Hz and leave it in high-performance mode, your day-to-day experience outside of gaming will be amazingly smooth. It makes the table a tad hot and also engages the cooling fan, but the performance is there. Let's check out the synthetic benchmarks for some data-driven proof of the above.\nGPU Performance\nThe benchmarks tell a pretty convincing story. The RedMagic Astra just obliterates the tablet competition, and only the iPad Mini is able to hang on with its great single-core performance. When it comes to graphics, though, the Astra and its overclocked Adreno 830 core are unbeatable.\nOf course, the active cooling system with a tiny fan running at 20,000 RPM has something to do with the consistent 3D Mark score, as well as the Liquid Metal 2.0 material and the vapor chamber design.\nThis machine can run Genshin Impact at 165 Hz and max graphics without any problems, but more on this in the software section below. Finally, there are three memory configurations to choose from. The basic one has 12GB of RAM and 256GB of storage, then there's the 16GB version that also comes with 512GB onboard memory, and you can go all-out and get the 1TB model that also happens to have 24GB of RAM onboard (a bit of overkill, but extremely future-proof).\nThis machine can run Genshin Impact at 165 Hz and max graphics without any problems, but more on this in the software section below. Finally, there are three memory configurations to choose from. The basic one has 12GB of RAM and 256GB of storage, then there's the 16GB version that also comes with 512GB onboard memory, and you can go all-out and get the 1TB model that also happens to have 24GB of RAM onboard (a bit of overkill, but extremely future-proof).\nOne thing we miss on the hardware side is capacitive triggers or shoulder buttons. There aren't any on the RedMagic Astra, which is a shame, really. The RedMagic 10S Pro features two of those with a very high touch sampling rate, but the Astra has to rely on screen input at all times.\nRedMagic Astra Software\nThe Astra gaming tablet comes running Android 15 with RedMagic OS 10.5 on top. It's a straightforward distribution with minimal tweaks and bloatware and with a sprinkle of AI on top. Nothing groundbreaking, just some AI translation options, coupled with intuitive application selection for your most frequently used apps.\nBut the Game Space is the crown jewel when it comes to software tools and gaming tools in particular. You can trigger the mode with the red slider button, and it takes you to a dedicated gaming space (as the name implies).\nBut the Game Space is the crown jewel when it comes to software tools and gaming tools in particular. You can trigger the mode with the red slider button, and it takes you to a dedicated gaming space (as the name implies).\nYou have complete control over many aspects of the Astra's hardware and software. You can choose the mode the CPU and GPU are using, add helpful software tools such as crosshairs, quick presets, and control notifications; add hardware periphery such as a mouse and keyboard; and more.\nIt's done in a very intuitive way; you can either choose from various performance presets or dive deep and tweak parameters yourself. For the gaming test we decided to use Genshin Impact, as it's one of the heaviest and most resource-demanding mobile games out there.\nThe Astra handled the game flawlessly – we set everything to maximum, and the game ran smoothly with no lag or any frame rate drops. To be fair, the tablet got a bit hot while playing, and the fan could be heard, but nothing too unpleasant to our ears or hands.\nRedMagic Astra Audio Quality\nThere are just two speakers on both sides of the RedMagic Astra, but they are quite powerful and loud. The tablet supports DTS:X Ultra and various audio formats, including WAV, AAC, MP3, and FLAC.\nThere's no 3.5 mm headphone jack, which is a drawback if you want to game in public and not disturb everybody, but of course you can pair Bluetooth headphones and use them to isolate the sound from your surroundings or vice versa.\nThe haptic motor inside the Astra is quite strong and powerful, as well as precise. This is key when we talk about gaming devices and contributes to the overall experience quite a bit.\nThe haptic motor inside the Astra is quite strong and powerful, as well as precise. This is key when we talk about gaming devices and contributes to the overall experience quite a bit.\nRedMagic Astra Battery and Charging\nThe battery inside the RedMagic Astra has an 8,200 mAh capacity, which is pretty decent considering the small footprint of the tablet. The company advertises a gaming battery life of 5.5 hours in Honkai: Star Rail, as well as up to 33 hours of video playback.\nLet's see how the tablet tackled our battery tests.\nPhoneArena Battery Test Results:\nWell, in terms of gaming, we were able to get a very similar result of around 5 hours and 10 minutes. And while this pales in comparison with other, non-gaming devices, we think it's a good result for maxed-out competitive gaming.\nThe browsing and video streaming results are not very impressive, especially next to other tablets (some with smaller batteries), but performance comes at a cost, and the Astra is just not built for efficiency.\nIn terms of charging, the tablet supports fast charging, and we were able to get the 8,200 mAh cell from zero to full in 1 hour and 12 minutes, a decent result. There are no wireless charging coils onboard, and thus, no wireless charging support.\nThe browsing and video streaming results are not very impressive, especially next to other tablets (some with smaller batteries), but performance comes at a cost, and the Astra is just not built for efficiency.\nIn terms of charging, the tablet supports fast charging, and we were able to get the 8,200 mAh cell from zero to full in 1 hour and 12 minutes, a decent result. There are no wireless charging coils onboard, and thus, no wireless charging support.\nThe usual caveat we put when we test tablets and gaming devices, especially, applies here as well. The Astra comes equipped with a pretty modest camera system – just one 13MP wide camera at the back and a 9MP front one.\nThe specs of these two cameras won't make you jump in your seat, and they're there to get the job done in a very basic sense. To be fair, there's some AI processing going on in the background, and the results are very palatable, so to speak, but nothing spectacular.\nThe specs of these two cameras won't make you jump in your seat, and they're there to get the job done in a very basic sense. To be fair, there's some AI processing going on in the background, and the results are very palatable, so to speak, but nothing spectacular.\nPhoto Quality\nWell, you can check out the samples above. You have the option to use digital zoom – 2x and 5x – and while the 2x samples are okay-ish, when going to 5x digital, the noise gets pretty high, and the overall detail and quality fall down quite a bit.\nThat's an excellent question right there! The RedMagic Astra gaming tablet caters to a very specific audience. On the one hand, people who enjoy some heavy and competitive mobile gaming but, for some reason, find most smartphones too small in terms of display size.\nThere are some very strong sides to this slate – the display is simply amazing, and the 165 Hz refresh rate is super smooth. There's power on tap you can use in non-gaming scenarios as well, and the compact nature of the Astra makes it a perfect travel buddy.\nBut you have to outweigh this against the kind of short battery life, the lack of wireless charging and the mediocre camera if you want to use it as a non-gaming regular tablet.\nThings that are NOT allowed:\nTo help keep our community safe and free from spam, we apply temporary limits to newly created accounts:"
    },
    {
      "url": "https://www.slashgear.com/1720223/most-powerful-tablet-processsors-ranked-geekbench/",
      "text": "The 10 Most Powerful Tablet Processors (Ranked By Geekbench)\nWe may receive a commission on purchases made from links.\nTablets have been around for a long time — probably longer than you think. From early '90s proto-tablets like Samsung's PenMaster and the infamous Apple Newton to Microsoft's innovative 2001 Tablet PC — a touch-input tablet that predated the Apple iPad by nearly a decade — and culminating in modern-day touchscreen powerhouses from Apple and Samsung, tablets have grown from simple pen-input devices to sleek slabs of metal and glass that can rival some of the best laptops out there in raw performance.\nThey may not be to everyone's taste, but it's hard to argue against how useful tablets can be. Just ask the many users worldwide behind the recent resurgence of the format, which saw an impressive year-on-year growth of 22.1% in the second quarter of 2024. Whether you want a tablet for reading ebooks, working on the go, increasing productivity at home, or even just playing video games on a larger screen than your smartphone, these devices can offer a lot — all thanks to how much power they pack under the hood these days.\nAnd that power is what we'll be going over here with this list of the 10 most powerful processors in the Geekbench database, ranked by single-core scores.\n10. Apple A12 Bionic\nThe 10th-most powerful tablet processor in Geekbench's ranking is Apple's venerable A12 Bionic, which first debuted in the iPhone Xs, Xs Max, and XR back in 2018. The A12 Bionic's six-core CPU and four-core GPU would later power the third-gen iPad Air and fifth-gen iPad mini, which debuted the year after. In 2020, Apple also brought it back for a third time for the eighth iteration of its entry-level iPad.\nThe A12 Bionic introduced Apple's next-generation Neural Engine, with a new eight-core chip giving it much better performance than its predecessor and opening up the possibility for apps to use real-time machine learning (ML) on A12 Bionic-equipped devices. The A12 Bionic also brought Apple's Neural Engine to iPads for the first time, as the A11 Bionic — the chip that introduced the Neural Engine — had not been present in any iPads. The seventh-gen base iPad had the A10 Fusion, while the second-gen iPad Air and fourth-gen iPad mini sported Apple's A8X and A8, respectively.\nAs far as raw performance (at least, as measured via Geekbench), the A12 Bionic offered a significant boost over the processors in older iPads. The processor's best numbers on the chart come in the third-gen iPad Air, with 1,325 points in the single-core test and 2,945 points in multi-core. Unexceptional numbers now, but a massive leap over the 442 and 949 points that the iPad Air 2's A8X scored.\n9. Apple A12X/A12Z Bionic\nThe A12 Bionic was a notable leap over predecessors like the A11 Bionic, but Apple had more than just that one chip up its sleeves in 2018. Mere weeks after introducing the A12 Bionic in the iPhone Xs, the company introduced a souped-up version for the then-new 11- and 12.9-inch iPad Pro models called the A12X Bionic.\nThe A12X featured two more CPU cores and three more GPU cores, making for eight and seven cores, respectively. Apple touted impressive performance improvements from the new processor, boasting of 35% better single-core performance and an alleged 90% improvement in multi-threaded workloads — improvements that the company claimed made the A12X faster than 92% of mobile computers. The A12's upgraded Neural Engine was also present in the A12X, allowing the new iPad Pros to deliver better performance in Core ML than previous Apple devices.\nApple introduced another A12 variant in 2020, bringing a new lidar-equipped iPad Pro to the market with the A12Z Bionic under the hood. Apple didn't make any major performance claims about the A12Z Bionic, with the only notable change in the company's marketing materials being the introduction of an eight-core GPU in place of the old seven-core unit. Geekbench results bear this out, with the two processors performing nearly identically — that said, the A12Z Bionic is ever-so-slightly faster, with 1,333 single-core and 4,668 multi-core points (vs. the A12X's 1,329 and 4,635).\n8. Google Tensor G2\nGoogle's push into in-house SoCs began in 2021 with the Pixel 6 and Pixel 6 Pro, which saw the company introduce the AI- and ML-focused Google Tensor chip to the world. The company quickly followed it up with the Tensor G2, which powered 2022's Pixel 7 and Pixel 7 Pro, and would later resurface as the chip powering the Pixel Tablet.\nDespite the Tensor chips broadly following in Apple's footsteps with the A-series SoCs, Google was never particularly focused on raw performance for its processors. The company has generally focused on camera and AI-assisted features, both of which the Tensor chips help accelerate and improve. This isn't to say that the Tensor G2 is weak, but it's not all that impressive in terms of raw power, either. The Tensor G2 in the Google Pixel Tablet scores 1,421 single-core and 3,614 multi-core points.\nDoes the Tensor G2's middling performance hobble the Pixel Tablet? Not necessarily, as our review shows — the Pixel Tablet does everything you need it to do, and does it well. But it says a lot about Google's priorities that its 2022 processor is only slightly faster in the single-core tests than an Apple processor from 2018 — and gets thoroughly destroyed in Geekbench by the SoCs that come after it in this list.\n7. Apple A13 Bionic\nA new year, a new Apple SoC. Hot on the heels of the A12 Bionic came the A13 Bionic, which debuted in 2019's dual-camera iPhone 11. At launch, Apple claimed that the A13 was the fastest smartphone chip to date, thanks to 20% higher CPU and GPU performance over the A12 Bionic. Apple also included a faster Neural Engine and all-new, built-in ML accelerators to push its devices' AI and ML capabilities even further.\nUnlike previous Bionic SoCs, the A13 Bionic only ever made it to one Apple tablet. 2021 saw the debut of the ninth-generation iPad, with the A13 Bionic under the hood. Apple didn't mince words in its press release, stating that its new entry-level tablet was \"up to three times faster than the best-selling Chromebook, and up to a whopping six times faster than the best-selling Android tablet.\" The iPad vs. Android tablet battle may not necessarily be clear-cut, but confident statements like that show that Apple's raw performance advantage has never been in question.\nGeekbench scores bear it out, with only one Android processor ranking above the A13 Bionic. 1,736 points in Geekbench's single-core tests and 3,853 points in the multi-core test putting it ahead of all but the best Android tablet processors, even though it's five years old at this point. The ninth-gen iPad wasn't the last we saw of the A13 Bionic, though: Apple would later use it for its third-generation iPhone SE, which debuted in 2022.\n6. Snapdragon 8 Gen 2\nAnd now we come to the most powerful Android tablet processor in Geekbench's charts — at least until the Samsung Galaxy Tab S10's MediaTek SoC makes its official Geekbench debut. The Snapdragon 8 Gen 2 may not be the latest version of Qualcomm's flagship processor, but it flies the flag for Android tablets on the Geekbench charts, courtesy of Samsung's Galaxy Tab S9 tablets.\nQualcomm's Snapdragon 8 processors didn't get off to the greatest start, with the Snapdragon 8 Gen 1's much-publicized heat issues stopping it from performing significantly better than the Snapdragon 888 SoC it replaced. Qualcomm thankfully sorted that problem out with the Snapdragon 8+ Gen 1, before introducing the Snapdragon 8 Gen 2 in 2022 to firmly put its troubled start behind it. Qualcomm's big focus was on the Snapdragon 8 Gen 2's AI prowess, but the processor also offered notable performance and efficiency improvements: the company claimed 25% better GPU performance and 40% more CPU power efficiency.\nGeekbench numbers for the Snapdragon 8 Gen 2 were a big improvement over its predecessor, especially in the Samsung Galaxy Tab S9. The Tab S9, which we rank as one of the best tablets for students thanks to its iPad Pro-rivaling qualities, also happens to have best performing implementation of Qualcomm's eight-core processor, with single- and multi-core scores of 2,028 and 5,423, respectively.\n5. Apple A14 Bionic\nNow we get into the current (at time of writing) top five tablet processors on Geekbench's charts. You likely won't be surprised to find that they're all Apple SoCs. In fifth place is the Apple A14 Bionic, which first debuted on the scene powering the 2020 iPhone 12s — from the iPhone 12 mini all the way up to the big boy iPhone 12 Pro Max — and the 2020 iPad Air.\nThe A14 Bionic was the first 5nm smartphone chip, with performance allegedly up to 50% faster than what Apple called \"competing smartphone chips\" — in other words, Qualcomm's offerings. This big performance boost came from a new six-core CPU design and a four-core GPU, making for 40% and 30% better performance, respectively. The A14 Bionic also had an upgraded Neural Engine with 16 cores, up from the eight cores Apple had introduced with the A12 Bionic — allowing for a claimed 80% increase in ML performance.\nIn 2022, Apple introduced the A14 Bionic to the entry-level iPad, updating the base tablet with a new 10.9-inch screen and the A14 Bionic's processing power. The new processor offered an alleged three times more performance than the seventh-gen iPad, putting the 10th-generation Apple iPad well ahead of the Android competition in pure performance. As far as Geekbench goes, the A14 Bionic's best tablet performance is 2,084 single-core and 5,005 multi-core points in the fourth-gen iPad Air.\n4. Apple A15 Bionic\nThe A15 Bionic was the final Apple's A-series SoC to power any of the company's tablets. This chip, with its six-core CPU and five-core GPU, debuted as the processor powering Apple's iPhone 13 family of smartphones and the sixth-gen iPad mini in 2021.\nIn keeping with Apple's high-performance track record, the company claimed that the CPU and GPU were around 50% faster than Qualcomm's SoCs — not hard to believe, seeing as how it's still in the top five fastest smartphone processors despite being three years old as of late 2024. But the A15 Bionic was also a big upgrade for those already in the Apple ecosystem: The company claimed that the new A15 Bionic-powered Apple iPad mini had 40% and 80% better CPU and graphics performance, respectively, compared to the previous iPad Mini.\nCombined with the ML improvements from the 16-core Neural Engine Apple had introduced with the A14 Bionic, the new iPad mini could chew through ML tasks at twice the speed. The A15 Bionic wasn't a huge leap in raw performance over the A14 Bionic otherwise, but its Geekbench scores of 2,121 and 5,364 in the single- and multi-core tests, respectively, are still excellent all the same.\n3. Apple M1\nFor most of their life, Apple's iPad Pros had essentially shared processors with the company's smartphones, albeit in upgraded form, as with the A12X and A12Z Bionic from 2018. That all changed in 2021 when the company introduced the fifth-generation 12.9-inch iPad Pro and third-generation 11-inch iPad Pro. These closed the performance gap between Apple's flagship tablets and its laptops, sporting Apple's M1 chip which had debuted a year earlier in laptops like the Apple M1 MacBook Air.\nThe M1 was essentially an eight-core desktop- and laptop-grade processor, so it's no surprise that this new SoC offered major performance gains over the A12Z Bionic used in the previous-generation iPad Pro. Apple claimed 50% better CPU performance and 40% faster GPU performance, with extras such as a 16-core Neural Engine, an image signal processor (ISP), and high-performance memory thrown into the package. The end result was a tablet that on paper, could probably have replaced most laptops — though contemporary reviews of the iPad Pro felt that iPadOS held it back from doing that.\nRestrictive OS aside, there was no argument about the new iPad Pros when it came to sheer performance. Geekbench scores for the Apple M1 inside the 12.9-inch iPad Pro came out to 2,305 and 8,357 in the single- and multi-core tests, with the improved single-core performance and two extra cores undoubtedly behind the huge multi-core boost over the A15 Bionic.\n2. Apple M2\nDespite having an unassailable lead at the top of the tablet hierarchy, Apple didn't rest on its laurels and launched the new Apple M2-powered iPad Pro in 2022. Size options remained the same as the previous generation — 11 inches and 12.9 inches — and had broadly the same features, with two major upgrades to try and entice M1 iPad Pro owners to upgrade.\nThe first, of course, was the new processor. The Apple M2 chip debuted in mid-2022 sporting an upgraded eight-core CPU combined with a much beefier 10-core GPU, up from the seven or eight-core GPUs available on the M1. The result was up to 15% more CPU performance and an impressive 35% uptick in graphics rendering. The extra grunt also helped the M2's Neural Engine perform 40% more operations than the M1, making the M2-powered iPad Pros even more capable of ML tasks than before. Geekbench scores climbed once again, with the 12.9-inch iPad Pro posting single- and multi-core scores of 2,572 and 9,777 points, respectively.\nDespite the better performance, the biggest upgrade on the M2 iPad Pro was the introduction of Apple Pencil hover. Our Chris Davies tested the iPad Pro in 2022 and loved hover, which essentially allowed the tablet to detect and recognize the stylus from up to 12 millimeters away from the screen — allowing for pleasing UX details such as app icons and text fields enlarging before you touch them, as well as useful behaviors like brush and eraser previews in drawing apps.\n1. Apple M4\nThe Apple M2 ruled the roost for a couple of years, with Apple keeping it in place through 2023 despite launching the 3nm M3 chips toward the end of that same year. Apple could have just kept making the iPad Pro M2 for the next handful of years without issue, such was the chipset's performance lead over Android rivals. It didn't, of course, and launched the Apple M4-powered iPad Pro in 2024.\nApple's iPad Pro M4 — which our Nadeem Sarwar reviewed and loved — launched in mid-2024 and was a big departure from the old iPad Pro. Bumped up fully to 11 and 13 inches, the iPad Pro also featured a new Ultra Retina XDR display, a new thin body — the company's thinnest ever, according to its marketing material — and the power of Apple's latest and greatest chipset. The Apple M4 has a 10-core CPU to match the 10-core GPU, with new hardware features and ML accelerators allowing for a claimed 1.5x CPU performance uptick over the M2 iPad Pro, all while using half of the power.\nThe upshot? Frankly impressive Geekbench scores of 3,668 single-core and 13,674 multi-core points, well ahead of even the M2 — at least, that's if you pony up for all 10 cores. Apple locks the M4's full performance behind a premium upgrade, with the most affordable iPad Pros only having a nine-core CPU. The software is also still a stumbling block, with our review finding that iPadOS can't quite offer the same productivity experience as macOS."
    },
    {
      "url": "https://intl.redmagic.gg/pages/redmagic-astra-gaming-tablet",
      "text": "Back-to-School Sale: Up to $100 Off + Free Gift by September 3. Shop Now >\nBack-to-School Sale: Up to $100 Off + Free Gift by September 3. Shop Now >\nBalance performance and portability with a compact, premium transparent metal body and a flat 9.06-inch design paired with comfortable rounded corners, dynamic RGB lighting, standard USB 3.2 Gen 2, and our Magic Key feature.\nPowered by the most advanced Snapdragon chipset in any Android tablet, the Snapdragon 8 Elite takes mobile gaming and multitasking to new heights. Together with RedCore R3 Pro, it delivers smooth, intelligent performance whenever you need it.\n45% Boost CPU Performance\n44% Improved Power Efficiency\n3nmProcess Node\nUp to 4.32GHz CPU Speeds\nEquipped with up to 24GB of LPDDR5T RAM and up to 1TB of UFS 4.1 Pro storage, you can now enjoy more memory and speed than most laptops.\nLPDDR5T9,600Mbps\nUFS 4.1 ProPerformance Improved by 36%\nStay ahead with elite power, graphics, and endurance—delivering CODM performance that leaves other tablets in the dust.\n144.6 FPS vs 120 FPS\n40.1 °C vs 41.5°C\n6.67 Hours vs 5.26 Hours\nExperience stunning detail with our high-resolution OLED display, richer colors, deeper blacks, and lightning-fast response that leave LCD rivals behind.\nStay steady on the road to victory with our impressive 165Hz refresh rate. A 16:10 aspect ratio and 90.1% screen-to-body ratio ensure an incredibly immersive visual experience through every level.\nEnjoy your favorite games that are now optimized for high refresh rate gameplay.\nand more to be added soon!\nGame with ease using certified eye comfort from SGS that stays in low blue light mode to prevent eye fatigue and strain during longer gaming sessions.\nDisplay\nRefresh Rate\nResolution\nPeak Brightness\nAspect Ratio\nScreen-to-Body Ratio\nWide Color Gamut\nCertified by SGS\nThe enhanced 13-layer ICE-X cooling system combines Liquid Metal 2.0, dual-layer sandwich vapor chambers, and a high-speed turbofan. It reduces core temperatures by up to 8°C and improving cooling efficiency by 28%.\nAs the largest battery for a tablet of this size, our 8,200mAh capacity will keep you on a winning streak for longer - delivering up to 33 hours of movie playback.\nGenshin Impact Gameplay\nPUBG Gameplay\nContinuous Movie Playback\nBoss Level Gameplay\nCapable of running AAA games with ease, even while activating multiple plugins to enhance your skills. You can also use Frame Rate Boost to upscale various games to 2K resolution at 120 FPS for superior image quality. For an even bigger experience, cast your gameplay to a larger screen and seamlessly connect console controllers, keyboards, mice, and more.\nDynamic and Versatile\nStay ahead of the curve with a tablet built to adapt to your needs. Whether you're streaming, editing videos, or making video calls, you'll enjoy seamless multitasking!\nA Sound Spectacle\nHear the sound of victory clearly with symmetrical, dual 1620 high-fidelity speakers certified by DTS:X Ultra for immersive surround audio.\nCatch the Vibe\nFeel every moment with dual X-axis linear motors for 4D vibration feedback while dynamic rear RGB lighting syncs with every sound for an experience like no other.\n1. External factors and running apps can affect the speed of data transmission and screen operations, the experience may vary for each user.\n2. The device's performance may be affected by external conditions.\n3. The quality of the local network may have an effect on Wi-Fi speeds.\n4. Images are for illustrative purposes only, the actual product may vary.\n5. All data sourced from REDMAGIC Labs."
    },
    {
      "url": "https://9to5google.com/2025/07/18/redmagic-astra-android-tablet-review/",
      "text": "The Android tablet market was devoid of decent options for a long time, but we’re finally seeing new options pop up. Lenovo’s Legion Tab is what really garnered attention earlier this year, but after spending a few weeks with the Redmagic Astra, I think it’s clear that this is a near-perfect version of a compact Android tablet, thanks in large part to its specs and OLED display.\nRedmagic Astra is, at its core, a gaming tablet, and it has the hardware to back that up. Let’s start with the physical design.\nThis compact Android tablet features a fully metal chassis that, for a gaming-centric device, still has a pretty subdued design. The “Eclipse” color of my unit just looks like an iPad Mini when the screen is turned off, and from the back the only think that really stands out is the “transparent” window that has the Redmagic logo, some faux internals, the camera/flash, and the fan. Of course, all with some (controllable) RGB. The metal is an absolute fingerprint magnet, though.\nIt’s not a design that screams “I’m a gaming tablet!” at you, but also not one that completely forgoes what it is. Lenovo’s Legion Tab still has a more subdued design, but Redmagic isn’t far off here.\nRedmagic Astra is also remarkably thin at 6.9mm, making it feel even more compact compared to Lenovo’s tablet.\nBut there are two big hardware standouts. Firstly, there’s the inclusion of a fingerprint sensor. Functionally, it’s not the best sensor I’ve used, but its existence alone is reason to be happy. Too many Android tablets are relying on worthless face unlock instead of using real biometrics, so Astra already has a leg up on most of the competition if only because I don’t need to type in my password every time I use the tablet or a secure app.\nThe other big deal is the display.\nThe 9.06-inch display comes in at 2400×1504, already being a sharp panel for its size, but OLED is the real kicker. The deep blacks and consistency of an OLED display contribute to a display that’s just way better than the one in the Lenovo Legion Tablet, and many other tablets on the market today. And there’s no real compromise either. You’re still getting 165Hz refresh rate, as well as up to 1,600 nits in the high-brightness mode. It’s a stellar display, whether you’re just watching movies or using this for gaming.\nWhen it comes to gaming, you’ve got plenty of power available.\nUnder the hood, this tablet is powered by Snapdragon 8 Elite paired with at least 12GB of RAM and with 256GB of storage. Upgrades to that include 16GB/512GB and 24GB/1TB. I spent my time with the mid-tier 16GB/512GB option, and to say I’ve been pleased with the experience is an understatement.\nGames fly, with Fortnite and Fall Guys – my usual benchmarks – going off without a hitch. Fortnite was able to keep a consistent 90fps even at high settings, while Fall Guys and basically everything else I tested running as smoothly as I’d expect from a device with these specs.\nBattery life is also very solid. You’ll see the battery drop during gameplay, of course, but the 8,200 mAh battery has plenty of life to give. It does drain a tiny bit faster than expected at times, though. On a 10-hour flight with the Astra being used for movies with Bluetooth headphones, I landed with about 30% left in the tank. That was less than I expected, but not exactly bad either.\nThen, there’s the actual software. I was ready for this to be the disappointment of Redmagic Astra, but I was pleasantly surprised to find that Redmagic’s skin is pretty light. Android 15 is available out of the box and it’s relatively clean. There are some minor homescreen and settings tweaks but, for the most part, it just feels like a “normal” Android build. There’s not much bloatware either.\nOn the flip side, the software policy isn’t great. Redmagic promises “regular” updates every 1-2 months for 3 years, and only a single major Android OS upgrade. That’s borderline unacceptable at this point, and deserves to be a dealbreaker for many.\nThe only place you really feel that this is a “gaming tablet” is when you flip the physical switch into the “Game Lobby.” This is a dedicated gaming UI that surfaces your games. It’s a whole experience, and perhaps the one part of the software that I avidly dislike – which is why I’m glad the physical switch can be remapped to other functions. It’s full of text tickers that shouldn’t exist, tons of wasted space, and gaudy UI design. The only purpose it really serves is to give you quick access to other gaming optimization tools, such as the fan controls, touch sampling rate adjustments, and performance settings. I found the “Balance” performance just fine for everything, but “Rise” puts everything into high gear, assuming you can find an Android game power-hungry enough to actually need that.\nWhile on this note, we’ll circle back to the built-in fan. This cooling aspect is actually pretty nice for a gaming tablet in my eyes, and did indeed help keep the tablet cooler to the touch. Is it 100% necessary? Not at all, but it’s nice to have if you’re a devout mobile gamer. The fan cleverly routes air through the side-mounted speakers (which, in themselves, sound pretty good), so you can literally feel the air moving through the tablet.\nThe only thing I wish Redmagic did better here was in the accessory department.\nOne area I’ll definitely give Lenovo’s tablet points is what comes in the box. Not only do you get a free screen protector, but also a really good case. And the case selection for Astra is, at the moment, pretty scarce. The official case won’t be available until August either. Redmagic does have an official screen protector, but it’s a very overpriced $25 add-on. Not worth it when you can get third-party options for a fraction of that.\nBut, a few negative points aside, I think Redmagic Astra is as close to perfect as I can ask for in this form factor. The hardware is good, the software is clean, and the display is gorgeous. The bigger dealbreaker in my mind is the update policy, as spending $549+ on a tablet that will be out of date for most of its lifespan is just not acceptable. I hope Redmagic revisits this because, genuinely, I consider this an essentially perfect compact Android tablet in nearly every other way.\nIf you’re interested in Redmagic Astra, it’s available now through the company’s website starting at $549.\nMore on Android Tablets:\n- Google launches Android 16 with desktop windowing for tablets coming later\n- Lenovo Legion Tab Review: Three months with Android’s iPad Mini\n- I want the next Pixel Tablet to revisit the past – what do you want in a sequel?\nFollow Ben: Twitter/X, Threads, Bluesky, and Instagram\nFTC: We use income earning auto affiliate links. More.\nComments"
    }
  ],
  "argos_summary": "The RedMagic Astra is a compact gaming tablet that outperforms rivals with a Snapdragon 8 Elite processor, 9.06‑inch 2.4K OLED display at 165 Hz, and up to 24 GB RAM, delivering smooth high‑fps gaming and strong benchmark scores. It features an active cooling fan, 8,200 mAh battery, and a clean Android 15 skin, but offers only three years of software support, which may deter long‑term buyers. Priced between $549 and $899, the Astra offers a powerful, portable gaming experience that could push competitors like Apple and Samsung to upgrade their small‑tablet lines. The review highlights its strong performance, impressive display, and limited software updates as the main trade‑offs.",
  "argos_id": "Z7HEWJ29Z"
}