{
  "url": "https://www.bloomberg.com/news/videos/2025-08-28/cook-suggests-clerical-error-was-behind-mortgage-issue-video?srnd=phx-technology",
  "authorsByline": "bn",
  "articleId": "2128bacd7a804e7aba0c51fe25457ba2",
  "source": {
    "domain": "bloomberg.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/i.QXf_6EEJZc/v3/-1x-1.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-28T20:01:20.821000+00:00",
  "addDate": "2025-08-28T20:22:56.752224+00:00",
  "refreshDate": "2025-08-28T20:22:56.752230+00:00",
  "score": 1.0,
  "title": "Fed's Cook Suggests 'Clerical Error' Was Behind Mortgage Dispute",
  "description": "Bloomberg's Erik Larson and Mike McKee break down what Federal Reserve governor Lisa Cook's lawsuit against the Trump administration and how the proceedings could play out as she seeks an injunction to stay in her role.  (Source: Bloomberg)",
  "content": "She did not explicitly deny the allegations. But clearly, at this stage in the case, they're signaling a potential defense here, which is that not only could this be a clerical error, but that it wasn't material to any decisions that were made on these mortgages, that no one was harmed by it. And and really, that's it. Regardless, it's not cause to fire her because these mortgages were done a year before she joined the board. And it has nothing to do with her job. So she laid out a wide array of potential defenses in this filing. An emergency hearing scheduled tomorrow at 10 a.m. What's going to happen? What can we expect? How critical is that in this saga? It's really critical. This is this TRO hearing is going to indicate whether or not the firing can go forward at this early stage in the case. Such orders usually last around two weeks. So they will probably seek a longer lasting order that would block her firing during the entire case, which could take months or longer. But this will be the initial thoughts about what this judge thinks about this evidence, whether or not it's very strong, and who could really be harmed here. This all hinges on whether or not the judge agrees which side is going to be harmed at the most without an order like this. Cook is arguing the entire economy will be harmed without an order like this. And of course, Trump is. Trump's lawyers will be pushing back hard on that in court. Well, exactly. To that point, Mike, Mickey, we think about the filing that we got this morning, the filing of that lawsuit. And as Eric mentioned in the lawsuit, her lawyer saying that this could cause irreparable harm. That's the term that they use to the U.S. economy. What exactly do they mean by that? Well, essentially what they're saying is that the Fed would lose credibility and the markets would tank and the economy would go into freefall because the markets would no longer have any faith in the Federal Reserve that the irreparable harm line is something you see quite often in these filings. And I'm sure that the administration will say that if the president can't fire her, there would be irreparable harm. They did that in other cases where the president has fired people. But the one thing I think is different in this case is that she he doesn't have a direct interest in whether or not she is gone. This isn't the question, given what the Supreme Court said. This isn't a question of his right to fire her at will. He has to have cause. And so then the question becomes, is there cause, as Eric was saying, that we've seen the beginning of a defense of that from the cook side. Well, how difficult is it to prove on both sides of the equation, Mike? Well, it depends on what you're trying to prove in her case. This isn't going to be a trial. This is this would be a temporary restraining order hearing. And the evidence that the judge will see is essentially what's being filed. And the argument that it is a clerical error or a possible clerical error is probably hard to disprove. In a way. You would need to get somebody from one of the banks to come in and say, no, she knew what she was doing and we gave her a favor in return for this. For the administration, it's they've just basically made this broad assertion that in all of these cases, the president has the right and it harms the president's ability to do his job if you take away his ability to fire people at will. So I imagine we'll get something along those lines as well, although they may argue, as the president did in his tweet, that having somebody who has a cloud over her head hurts credibility of the Fed. Well, when we talk about, you know, Fed credibility, we talk about potential irreparable harm. What sticks out to me is that the markets aren't pricing any of that in right now. Again, the S & P 500 at record highs. You take a look at the bond market, the ten year Treasury yield pretty well-behaved right now. We're sitting out at about 421 right now on your benchmark ten year end. Eric, I want to talk about timelines a little bit more here because we mentioned that tomorrow, maybe tomorrow morning, we do get that TRO hearing and the timeline here matters because we are counting down to the next Fed decision on the 17th. Yeah, I'm not sure that a judge is necessarily going to want to take a deadline like that into account. I mean, sure, she'll take it into account, but it's not going to be all she bases it on because these are cases that need to move along at sort of a deliberative pace. Trump has successfully gotten a lot of these cases to move quickly. But this is one, like you were saying, that it's not just about his right to fire people. It's about whether or not he has cause. And that is going to take a little bit longer, perhaps, to demonstrate in court not to look back at these old mortgage filings. Are they just going to focus on whether or not it even amounts to cause at all? She's saying that Trump jumped the gun here, that really he she should have at least gotten a hearing internally presented with. The evidence allowed to refute it before any of this even happened. And instead she was just fired through a tweet. So there's all kinds of different angles where the judge is going to want to look at this. And that could could slow it down a little bit. Eric, the word unprecedented has been used a lot, right? How does this fit into some of the other cases you've been covering and especially everything coming out of the administration? Well, it fits right in nicely. It has been like one unprecedented case sort of after another. And as you were saying, you know, a lot of these cases are about the president's power. He's really been pushing the power of the executive in ways that I frankly don't think anyone anticipated a president would try to do. There has been just one little bit of, you know, pushback from the Supreme Court and regarding for cause firings at the Fed. So there's really is kind of a new bar that Trump is having to meet as a result of that Supreme Court ruling, which carves out the Fed and gives it a little bit more of a higher bar for these firings. And so it really could go either way. I have to say, I hear what you're saying, that, you know, the judge probably is in operating under the deadline of we have FOMC decision coming up. But, Mike, it feels like it's going to be the elephant in the room, especially when Jerome Powell takes the stage at the press conference. It feels like the past few months all of the Fed meetings have been politicized. But now this one especially. Oh, definitely. And the markets will be paying very close attention. I don't imagine anybody will be praying harder for a temporary restraining order than Jay Powell, because then he can get up and answer all our questions by saying it's an ongoing legal case. I can't comment on it. But in this case, the politics and the timing are tough because of the the coming meeting that Erick's right. The judge will take into consideration a whole bunch of things. But it almost doesn't matter in that sense, because the judge can grant the temporary restraining order and about an hour later, they're going to be before the appeals court asking for that to be overturned. And that takes time. So it's really hard to say whether she's going to be able to participate on the 17th or not. So we're just going to have to watch that. But I don't think it makes a big difference in terms of monetary policy. She's been voting with the chairman. She did express some concern about the fact that the labor report in July was not good. And so she's opened the door to voting with the chair if Jay Powell decides that they're going to cut rates. So it's probably if you take her out of the mix, it isn't going to change the fact that the majority would be voting for a rate cut. And the only the real question is if they decided not to and if the Senate puts Steven Myron through to be to replace Adrian Kugler in time to participate, you might get that third dissent. Yeah, might. Katie mentioned it, though. We are at all time highs. We're not seeing a huge movement as it relates to treasuries, even the U.S. dollar. Is it a summer Thursday or all the juniors on the desk? Why are we not seeing a real reaction? Well, I mean, it is a summer Thursday during the U.S. Open. We could point out maybe Tim should go around it, ask people there why they are selling. I think it's my guess and I don't know if Eric has the same sort of feeling is that the markets are looking at this as in two ways. One, that there's a chance that Trump will lose this, that this isn't this isn't a slam dunk case. So why worry about it until we need to? There are all these legal steps in between and video is going up. So, you know, we buy and they're also looking at it as it doesn't really matter so much what happens with Lisa Cook. Now, the follow on to that is there are people who are speculating that if Trump were to win this, for example, if she doesn't get the TRO, then it emboldens the president to try to fire Powell, because if he can come up with a pretext to fire Lisa Cook, he could come up with a pretext to fire Jay Powell. And by the time all of that played out, Powell would be leaving anyway. So he might be able to get rid of him early. And just a reminder for those maybe listening at home, we're having a conversation with Bloomberg TV and Radio International economics and policy correspondent Mike McKee. This is radio on TV. I have to keep reminding myself, we're also speaking to Bloomberg News, U.S. legal reporter Erik Larson. And Eric, weigh in on this, on this non reaction. Are there just too many questions about how this will go, given that, as Billy mentioned, this is unprecedented? Yeah, you know, I was thinking about that as you were discussing it. And I think that we've seen so many of these disputes over firings and all these other Trump policies go so quickly, relatively quick, quickly to the Supreme Court. And I think a lot of people who are trading on stuff like this are like, well, we know how this goes now. We're going to wait until the Supreme Court says something that could have something to do with it. And certainly we have seen a lot of even these tee arrows as we've been discussing these temporary orders. Usually you can't appeal those, and Trump has successfully appealed some of those, too. So it is possible that it could get to the Supreme Court on a very preliminary ruling early on, even if the case continues to drag on for months or longer. But everyone could just be waiting for the Supreme Court to weigh in. So I think people are noticing, too, that the decisions the court has made on these appeals have been whether somebody can stay in office while all of this is adjudicated. So even if no matter which way the judges rule on whether she can remain in office, it's going to be a long time till we have a decision and probably probably a long time before the court decides what cause is. Yeah. Mike, you made an interesting point. If Trump feels emboldened to then go after Jay Powell. To me, the other question is, if he is not successful in ousting Cook, do we see the administration pivot towards another member of the Fed or kind of what does that kind of path forward hypothetically look like? Well, if they lose and they pivot immediately towards someone else from the board, that's not a good look before a judge, because then it becomes clear this is animosity towards the Fed. And you're trying, you know, to to find somebody to get a number of people at the Fed are worried that they have been investigated without them knowing and that this could happen to them as well. But I suspect one of the reasons that he went ahead with the Lisa Cook case is it doesn't really matter if he loses. He hasn't lost a lot. If he lost the Powell case, that would be much worse. So in this case, it's sort of a trial balloon and he can go after her. If he wins, then he has more power. If he loses, then he can move on to something else and Powell will just serve out his term. Yeah, it'll be fascinating, of course, to see how this plays out. We'll continue to follow it very closely on Bloomberg. But speaking of that September 17th rate decision that we're going to get, there's plenty to look at other than the politics of it because we're going to get pissy tomorrow. And in the conversations I've been having on Bloomberg TV, many of the guests, the investors that we've been speaking to, when you think about the odds, 85% price chances of a rate cut next month. One of the things that could upset that applecart, of course, will be delivered at 8:30 a.m. tomorrow. It could, except that I always warn people don't trade in Fed funds futures because they change on a dime and we might get a dime. Do they listen to you, those people? They don't for some reason. But the PC numbers, they're composed of other data that are reported in other forums, other databases. And so once we get CPI, RPI, then the economists looking at this and the Fed folks looking at this have a pretty good idea of what PC is going to be. And Jay Powell usually tells us what it's going to be in his news conference. And tomorrow we're expecting the headline number to go down by a 10th of a point. And the core not to be changed at all. So year over year, there's no change which would leave you without a definitive number from PC for the Fed to rely on. But we get that CPI report on September 11th and of course, the jobs report on September 5th. Those will probably matter more. What will matter more tomorrow, if anything, is probably personal spending, because the Fed wants to know that people are not pulling back because they're worried about the economy right now. And the forecast is for a half a percent gain. It was 3/10 in June. So it could be relatively good news for the president in that regard.",
  "medium": "Video",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "other cases",
      "weight": 0.07152201
    },
    {
      "name": "cases",
      "weight": 0.06250344
    },
    {
      "name": "Fed credibility",
      "weight": 0.059933748
    },
    {
      "name": "Fed",
      "weight": 0.057552215
    },
    {
      "name": "Fed funds futures",
      "weight": 0.055531994
    },
    {
      "name": "Jay Powell",
      "weight": 0.053578563
    },
    {
      "name": "Supreme Court",
      "weight": 0.053425394
    },
    {
      "name": "Jerome Powell",
      "weight": 0.04682756
    },
    {
      "name": "people",
      "weight": 0.046641525
    },
    {
      "name": "cause firings",
      "weight": 0.04600753
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.7568359375
    },
    {
      "name": "/Law & Government/Legal/Other",
      "score": 0.68017578125
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.62060546875
    },
    {
      "name": "/Shopping/Consumer Resources/Consumer Advocacy & Protection",
      "score": 0.3935546875
    },
    {
      "name": "/Finance/Credit & Lending/Loans",
      "score": 0.38623046875
    }
  ],
  "sentiment": {
    "positive": 0.0354235,
    "negative": 0.7906411,
    "neutral": 0.1739354
  },
  "summary": "The Federal Reserve Board member, Janet Cook, has suggested that a clerical error may have been behind a mortgage dispute, which she believes is not cause to fire as it was done a year before she joined the board and has nothing to do with her job. An emergency hearing is set to determine whether or not the firing can proceed at this early stage in the case. The administration's claim that this could cause irreparable harm to the U.S. economy could include the loss of credibility in the Fed and the collapse of confidence in the Federal Reserve. However, an emergency hearing will determine if the case can proceed, which could take months or longer. The judge's initial thoughts on the evidence will depend on who could be harmed without an order like this. The next Fed decision on the next day is on 17th.",
  "shortSummary": "The Federal Reserve's chairwoman, Yellen Cook, may use a potential defense defense against claims of clerical error to block her firing, potentially leading to market losses and irreparable harm.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "7e15333ce30047eb8c5784926278dd94",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "The article covers the legal battle over President Trump's attempt to fire Fed Governor Lisa Cook, focusing on the upcoming temporary restraining order hearing and its potential impact on Fed credibility and market stability. Lawyers argue that Cook’s removal could cause irreparable harm to the U.S. economy, while the Fed and Trump contend that the president has the right to fire her without cause. The court’s decision will be closely watched ahead of the Fed’s September 17 policy meeting, as markets remain largely unchanged but could shift if the ruling undermines confidence in the central bank.",
  "argos_id": "ZWNYHHFG0"
}