{
  "url": "https://www.businessinsider.com/gen-z-stock-investing-housing-market-wealth-accumulation-trends-jpmorgan-2025-8",
  "authorsByline": "Jennifer Sor",
  "articleId": "5d502b3d22f24d40a304c3b3f5c21f2e",
  "source": {
    "domain": "businessinsider.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://i.insider.com/68b1e8a2cfc04e97619c4eef?width=1024&format=jpeg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-01T09:40:02+00:00",
  "addDate": "2025-09-01T09:49:35.321327+00:00",
  "refreshDate": "2025-09-01T09:49:35.321329+00:00",
  "score": 1.0,
  "title": "Gen Z is turning to stocks instead of housing market to build wealth",
  "description": "A third of 25-year-olds started adding money to retail investing accounts last year, a sixfold jump from a decade prior.",
  "content": "Gen Zers love to invest. It might be because many of them are locked out of the housing market, according to a new analysis from JPMorganChase Institute.The firm found that retail-investing activity has seen a particularly large uptick among younger Americans over the last decade. Last year, 37% of 25-year-olds added funds to a retail investment account, the bank found.That's around six times the share recorded in 2015, when 6% of 25-year-olds added funds to an account, the bank said in a report.This marks a shift in wealth-accumulation habits for the younger generation: rather than start to build a nest egg through homeownership, Gen Z is instead investing in the market.\"Housing market conditions — namely, low affordability — may be shifting the allocation of savings, making financial assets like stocks relatively more attractive or accessible than home equity,\" JPMorgan researchers wrote.They continued: \"The housing market has long been a core asset for most households. However, fewer young individuals are becoming first-time homebuyers, while the investing population has moved sharply in the opposite direction.\"Underpinning this whole dynamic is the fact that it's a tough time to break into the US housing market. The median sales price of a US home hovered around $410,800 in the first quarter, up 29% from  five years ago, according to data from the US Census Bureau.Home-borrowing costs are also elevated. The average 30-year fixed mortgage rate hovered around 6.56% in the last week, according to Freddie Mac, well-above the pandemic norm of around 3%.The median age of a first-time homebuyer climbed to 38 last year, a record high, according to the National Association of Realtors.Meanwhile, 60% of Gen Zers said they were worried they would never be able to afford a home, according to a 2024 survey conducted by Clever Real Estate.\"If appropriately managed, younger people's earlier adoption of these accounts presents a potentially positive sign for their wealth-building opportunities,\" JPMorgan said of the investing trend.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "housing market",
      "weight": 0.09603798
    },
    {
      "name": "Last year",
      "weight": 0.0937027
    },
    {
      "name": "\"Housing market conditions",
      "weight": 0.079900935
    },
    {
      "name": "home equity",
      "weight": 0.078125745
    },
    {
      "name": "younger Americans",
      "weight": 0.07407556
    },
    {
      "name": "fewer young individuals",
      "weight": 0.07278275
    },
    {
      "name": "Gen Z",
      "weight": 0.070815526
    },
    {
      "name": "Gen Zers",
      "weight": 0.069559425
    },
    {
      "name": "financial assets",
      "weight": 0.062961675
    },
    {
      "name": "the US housing market",
      "weight": 0.060507927
    }
  ],
  "topics": [
    {
      "name": "Real Estate"
    },
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.96337890625
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.93505859375
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.72705078125
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.6123046875
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.5419921875
    },
    {
      "name": "/Real Estate/Other",
      "score": 0.33984375
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.318115234375
    }
  ],
  "sentiment": {
    "positive": 0.46493787,
    "negative": 0.1632484,
    "neutral": 0.37181377
  },
  "summary": "A new analysis from JPMorganChase Institute has revealed that younger Americans are increasingly investing in stocks rather than the housing market, as many are locked out of the market. The study found that 37% of 25-year-olds added funds to a retail investment account last year, six times the share recorded in 2015. This shift may be due to low affordability in the housing industry, which may make financial assets like stocks more accessible than home equity. The median sales price of a US home was $419,800 in the first quarter, up 29% from five years ago, and the average 30-year fixed mortgage rate was 6.56% in the last week, well above the norm of around 3%. The trend could be seen as a potentially positive sign for younger people's wealth-building opportunities.",
  "shortSummary": "Gen Zers are increasingly investing in stocks and bonds due to high housing market affordability, though this trend may not last long.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "9b5f82b30bf0469c940431511e0b2934",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Gen Z investors are increasingly turning to retail investment accounts instead of homeownership, driven by high housing prices and mortgage rates. JPMorgan Chase found that 37% of 25‑year‑olds added funds to investment accounts last year, up from 6% in 2015. The trend reflects a shift in wealth‑accumulation habits, with younger Americans viewing financial assets as more accessible than home equity.",
  "argos_id": "2I6T18613"
}