{
  "url": "https://finance.yahoo.com/news/oaktree-capital-co-founder-says-130027631.html",
  "authorsByline": "nickthomas2@benzinga.com",
  "articleId": "d19ced27924f49e4bee614880f5ea2b9",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://s.yimg.com/cv/apiv2/cv/apiv2/social/images/yahoo-finance-default-logo.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-01T13:00:27+00:00",
  "addDate": "2025-09-01T13:14:42.180558+00:00",
  "refreshDate": "2025-09-01T13:14:42.180559+00:00",
  "score": 1.0,
  "title": "Oaktree Capital Co-Founder Says We're in the 'Early Days' of a Market Bubble—Here's His Defense Strategy for the Storm Ahead",
  "description": "Oaktree Capital Management LP co-founder Howard Marks is sounding a cautionary note on today’s market, drawing parallels to the late 1990s tech boom while offering investors a roadmap for navigating what he believes are the early stages of another bubble. Speaking on Bloomberg Television on Aug. 20, the legendary investor painted a picture of a market where stocks have become “expensive relative to fundamentals or reality,” driven by psychological forces where investors increasingly “like stocks",
  "content": "Oaktree Capital Management LP co-founder Howard Marks is sounding a cautionary note on today’s market, drawing parallels to the late 1990s tech boom while offering investors a roadmap for navigating what he believes are the early stages of another bubble. Speaking on Bloomberg Television on Aug. 20, the legendary investor painted a picture of a market where stocks have become “expensive relative to fundamentals or reality,” driven by psychological forces where investors increasingly “like stocks too much.” But unlike many market bears, Marks isn’t hitting the panic button just yet.\n• Would You Have Invested in eBay or Uber Early? The Same Backers Are Betting on This Vacation Home Platform\n• They Sold Their Last Real Estate Company for Nearly $1B — Now They're Building the Future of U.S. Industrial Growth “We’re in the early days of a bubble,” Marks explained, comparing the current environment to around 1997, when markets were “falling in love with tech stocks” without concern for valuations—a period that preceded former Federal Reserve Chair Alan Greenspan’s famous “irrational exuberance” warning. However, Marks emphasized a crucial distinction: “We are currently in the early days and not yet at nutty valuation levels, so I’m not ringing the alarm bells for an immediate correction.” While Magnificent Seven tech giants like Amazon Inc. (NASDAQ:AMZN) and Alphabet Inc. (NASDAQ:GOOGL, GOOG)) grab headlines with their outsized market gains and lofty valuations, Marks finds something more troubling lurking beneath the surface. “What’s more alarming is that high valuations are being applied to more average companies”—the other 493 stocks in the S&P 500—”rather than just exceptional companies,” Marks noted. While acknowledging the Magnificent Seven as “great companies” whose valuations he cannot definitively call “excessive,” the broader market’s embrace of rich multiples across ordinary businesses signals a more concerning shift in investor psychology. This widespread valuation expansion reflects what Marks identifies as the biggest mistake investors make, concluding that “the way things are today is the way it’ll always be.” This mindset, he argues, ignores the more probable “reversion to the mean” and has been fostered by the absence of a serious market correction in 16 years.\n\nTrending: An EA Co-Founder Shapes This VC Backed Marketplace—Now You Can Invest in Gaming's Next Big Platform Rather than advocating for a complete exit from risk assets, Marks suggests a more nuanced approach. “It’s a time for some caution. Put a little more defense into your portfolio,” said Marks. His preferred defensive strategy? A shift toward credit markets. “Investing in credit as opposed to equities is one way to achieve this,” Marks explained, highlighting credit’s inherent defensive characteristics compared to stocks. Credit offers what equities cannot: “a promise of payment and a contractual rate of return,\" noted Marks. Even with tight credit spreads, Marks argues that “a contractual guarantee approaching returns in the sixes over the next 10 years is more defensive than being in the stock market at these elevated valuations.” The math is compelling from a risk-adjusted perspective. Credit has a “high probability of doing fine,” while stocks at current valuations face a “reasonable probability of doing less than fine.” See Also: Kevin O'Leary Says Real Estate's Been a Smart Bet for 200 Years — This Platform Lets Anyone Tap Into It America Still Leads, But the Gap Is Narrowing Despite his cautions, Marks remains fundamentally bullish on America’s long-term prospects. He still considers the U.S. the “best place in the world to invest,” citing the nation’s “spirit of innovation, free markets, rule of law, capital markets, growth, dynamism, and great companies.” However, he acknowledges a subtle shift: the U.S. may be “a little less best than we used to be.” This creates opportunities for discerning investors willing to trade some quality for better prices, as they can find “less good assets in other parts of the world at cheaper prices.” Marks closed his analysis with a quote from philosopher John Stuart Mill that encapsulates his investment philosophy: “He who knows only his own side of the case knows little of that.” By understanding both bull and bear cases, investors can make more informed decisions about navigating these uncertain waters. For investors heeding Marks’ advice, the message is clear: maintain exposure to quality assets while building defensive positions through credit investments—a strategy designed to weather whatever storm may come while still participating in continued market growth. Read Next: From Chipotle to Red Bull, Top Brands Are Already Building With Modern Mill's Tree-Free Wood Alternative — Here's How You Can Invest Too UNLOCKED: 5 NEW TRADES EVERY WEEK. Click now to get top trade ideas daily, plus unlimited access to cutting-edge tools and strategies to gain an edge in the markets. Get the latest stock analysis from Benzinga? This article Oaktree Capital Co-Founder Says We're in the 'Early Days' of a Market Bubble—Here's His Defense Strategy for the Storm Ahead originally appeared on Benzinga.com © 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.",
  "medium": "Article",
  "links": [
    "https://www.benzinga.com/quote/AMZN?getReport=1",
    "https://www.benzinga.com",
    "http://finance.yahoo.com/q?s=AMZN",
    "https://www.benzinga.com/money/gameflip?utm_campaign=partner_feed&utm_source=yahooFinance&utm_medium=partner_feed&utm_content=site&nid=47437613",
    "https://www.youtube.com/watch?v=jOLHX9MNJ6o&ab_channel=BloombergTelevision",
    "https://www.benzinga.com/premium/ideas/benzinga-edge-checkout/?t=be8be9spja3yaad2&utm_source=yahoo",
    "https://www.benzinga.com/money/built-by-mainstreet?utm_campaign=partner_feed&utm_source=yahooFinance&utm_medium=partner_feed&utm_content=site&nid=47437613",
    "https://www.benzinga.com/quote/GOOGL?getReport=1",
    "http://finance.yahoo.com/q?s=GOOGL",
    "https://www.benzinga.com/personal-finance/management/25/09/47437613/oaktree-capital-co-founder-says-were-in-the-early-days-of-a-market-bubble-heres-his-d",
    "https://www.benzinga.com/money/mogul?utm_campaign=partner_feed&utm_source=yahooFinance&utm_medium=partner_feed&utm_content=site&nid=47437613",
    "https://www.benzinga.com/money/pacaso?utm_campaign=partner_feed&utm_source=yahooFinance&utm_medium=partner_feed&utm_content=site&nid=47437613",
    "https://www.benzinga.com/money/modern-mill?utm_campaign=partner_feed&utm_source=yahooFinance&utm_medium=partner_feed&utm_content=site&nid=47437613"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "credit markets",
      "weight": 0.08502737
    },
    {
      "name": "free markets",
      "weight": 0.07935966
    },
    {
      "name": "Marks",
      "weight": 0.078963175
    },
    {
      "name": "Howard Marks",
      "weight": 0.07767523
    },
    {
      "name": "markets",
      "weight": 0.07682921
    },
    {
      "name": "capital markets",
      "weight": 0.07566888
    },
    {
      "name": "continued market growth",
      "weight": 0.075143516
    },
    {
      "name": "many market bears",
      "weight": 0.07395872
    },
    {
      "name": "Oaktree Capital Management LP co-founder Howard Marks",
      "weight": 0.073312685
    },
    {
      "name": "tech stocks",
      "weight": 0.065588914
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Business"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.9892578125
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.96875
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.916015625
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.90478515625
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.4072265625
    }
  ],
  "sentiment": {
    "positive": 0.17052114,
    "negative": 0.47882253,
    "neutral": 0.3506563
  },
  "summary": "Howard Marks, founder of Oaktree Capital Management LP, has warned that the market is in the early stages of a market bubble. He compared the current environment to the late 1990s tech boom, where investors increasingly \"like stocks too much\" without concern for valuations. Despite these warnings, Marks remains positive about America's long-term prospects and believes that the U.S. should be more discerning in its trade. He recommends a shift towards credit markets as a defensive strategy, citing the inherent defensive characteristics of credit as opposed to equities. Marks also acknowledges that there may be a growing gap in investor understanding between bull and bear cases, which can make informed decisions informed.",
  "shortSummary": "Howard Marks warns of the early stages of a market bubble, advocating for a more defensive approach while cautioning investors against over-hyped valuations and relying on credit markets for defensive returns.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "9ce23c7ea46a4210899f224cd5ce6fbc",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.benzinga.com",
      "text": "España\nItalia\n대한민국\n日本\nFrançais\nMy Account\nBenzinga Edge\nBenzinga Research\nBenzinga Pro\nLogin\nSPY\n644.95\n0.61%\nQQQ\n569.68\n1.28%\nBTC/USD\n109192.23\n0.8724%\nDIA\n456.60\n0.04%\nGLD\n318.07\n0.96%\nTLT\n86.49\n0.84%\nGet Benzinga Pro\nData & APIs\nEvents\nPremarket\nAdvertise\nContribute\nEspaña\nItalia\n대한민국\n日本\nFrançais\nLogin\nRegister\nPremium Services\nFinancial News\nLatest\nEarnings\nGuidance\nDividends\nM&A\nBuybacks\nInterviews\nManagement\nOfferings\nIPOs\nInsider Trades\nBiotech/FDA\nPolitics\nHealthcare\nSmall-Cap\nMarkets\nPre-Market\nAfter Hours\nMovers\nETFs\nOptions\nCryptocurrency\nCommodities\nBonds\nFutures\nMining\nReal Estate\nVolatility\nRatings\nAnalyst Color\nDowngrades\nUpgrades\nInitiations\nPrice Target\nInvesting Ideas\nTrade Ideas\nLong Ideas\nShort Ideas\nTechnicals\nAnalyst Ratings\nAnalyst Color\nLatest Rumors\nWhisper Index\nStock of the Day\nBest Stocks & ETFs\nBest Penny Stocks\nBest S&P 500 ETFs\nBest Swing Trade Stocks\nBest Blue Chip Stocks\nBest High-Volume Penny Stocks\nBest Small Cap ETFs\nBest Stocks to Day Trade\nBest REITs\nMoney\nInvesting\nCryptocurrency\nMortgage\nInsurance\nYield\nPersonal Finance\nForex\nStartup Investing\nReal Estate Investing\nProp Trading\nCredit Cards\nStock Brokers\nFinancial News\nLatest\nEarnings\nGuidance\nDividends\nM&A\nBuybacks\nInterviews\nManagement\nOfferings\nIPOs\nInsider Trades\nBiotech/FDA\nPolitics\nHealthcare\nSmall-Cap\nMarkets\nPre-Market\nAfter Hours\nMovers\nETFs\nOptions\nCryptocurrency\nCommodities\nBonds\nFutures\nMining\nReal Estate\nVolatility\nRatings\nAnalyst Color\nDowngrades\nUpgrades\nInitiations\nPrice Target\nInvesting Ideas\nTrade Ideas\nLong Ideas\nShort Ideas\nTechnicals\nAnalyst Ratings\nAnalyst Color\nLatest Rumors\nWhisper Index\nStock of the Day\nBest Stocks & ETFs\nBest Penny Stocks\nBest S&P 500 ETFs\nBest Swing Trade Stocks\nBest Blue Chip Stocks\nBest High-Volume Penny Stocks\nBest Small Cap ETFs\nBest Stocks to Day Trade\nBest REITs\nMoney\nInvesting\nCryptocurrency\nMortgage\nInsurance\nYield\nPersonal Finance\nForex\nStartup Investing\nReal Estate Investing\nProp Trading\nCredit Cards\nStock Brokers\nResearch\nMy Stocks\nTools\nFree Benzinga Pro Trial\nCalendars\nAnalyst Ratings Calendar\nConference Call Calendar\nDividend Calendar\nEarnings Calendar\nEconomic Calendar\nFDA Calendar\nGuidance Calendar\nIPO Calendar\nM&A Calendar\nUnusual Options Activity Calendar\nSPAC Calendar\nStock Split Calendar\nTrade Ideas\nFree Stock Reports\nInsider Trades\nTrade Idea Feed\nAnalyst Ratings\nUnusual Options Activity\nHeatmaps\nFree Newsletter\nGovernment Trades\nPerfect Stock Portfolio\nEasy Income Portfolio\nShort Interest\nMost Shorted\nLargest Increase\nLargest Decrease\nCalculators\nMargin Calculator\nForex Profit Calculator\n100x Options Profit Calculator\nScreeners\nStock Screener\nTop Momentum Stocks\nTop Quality Stocks\nTop Value Stocks\nTop Growth Stocks\nCompare Best Stocks\nBest Momentum Stocks\nBest Quality Stocks\nBest Value Stocks\nBest Growth Stocks\nRecent\nMarkets\nSPY\n644.95\n0.61%\nQQQ\n569.68\n1.28%\nBTC/USD\n109192.23\n0.8724%\nDIA\n456.60\n0.04%\nGLD\n318.07\n0.96%\nTLT\n86.49\n0.84%\nTrending\nLatest News\nStock Ideas\nBriefs\nExclusives\nBenzinga TV\n0\nAre Markets Open On Labor Day? Here's What's Open And What's Closed On September 1\nTrump Says Prices Are 'Way Down' With 'Virtually No Inflation', Targets Windmills Again\nMeta–Scale AI Partnership Sees Signs Of Strain As Key Executive Departs In Just Two Months, Researchers Pick Rivals: Report\nTrump Says Prices Are 'Way Down' With 'Virtually No Inflation', Targets Windmills Again\nMeta–Scale AI Partnership Sees Signs Of Strain As Key Executive Departs In Just Two Months, Researchers Pick Rivals: Report\nDonald Trump Says $15 Trillion Investment In US Will Be 'Immediately Cancelled!' If Courts Strike Down Tariffs: 'Would Become A Third World Nation'\nAmerican Middle Class Hitting The Panic Button? Consumer Sentiment Dives 6% In August\nQuick links\nKDP\nMDB\nMRVL\nNVDA\nSNOW\nJensen Huang\nElon Musk\nTop Stories\nEric Trump To Attend Shareholder Meeting Of A Company In Japan That Is Emulating Michael Saylor's Bitcoin Hoarding Strategy: Report\nBTC/USD\nDJT\nMSTR\nOptions Corner: Identity Security Specialist Okta's Wild Swings Offer A Quick Flare Pass Opportunity\nOKTA\nMarjorie Taylor Greene Put Money In BlackRock's Bitcoin ETF This Year — Here's How Her Returns Stack Up Against Others In Congress\nBTC/USD\nAMD\nBITB\n4 others\nGS\nIBIT\nMSTR\nTSLA\nLoad more\nLatest\nAll News\n|\nMy Watchlist News\nBloomberg's Chief U.S. Economist's Inflation Tracker Just Flashed A September Rate Cut Warning—Markets Aren't Listening\nTrump's Immigration Crackdown Leaves US Short 1.2 Million Workers, Inflation Fears Mount\nOaktree Capital Co-Founder Says We're in the 'Early Days' of a Market Bubble—Here's His Defense Strategy for the Storm Ahead\nAMZN\nGOOGL\nFinally, A Tech ETF That Doesn't Snub Nvidia—VanEck's TRUT Cuts The Cap\nTRUT\nExclusives\nSee more\nBenzinga's 'Stock Whisper' Index: 5 Stocks Investors Secretly Monitor But Don't Talk About Yet\nEXCLUSIVE: Beeline Expands AI Agent Bob Beyond Support To Drive Mortgage Sales, Origination Growth\nEXCLUSIVE: Envoy Medical Retires $32 Million Debt, Glen Taylor Steps Down From Board After Two Decades\nEXCLUSIVE: Virax Biolabs Inks Research Pact To Advance Long COVID Diagnostic Studies\nPalantir New All-Time Highs In 2025? Less Than 50% Say Yes In New Poll\nBenzinga's 'Stock Whisper' Index: 5 Stocks Investors Secretly Monitor But Don't Talk About Yet\nEpicQuest Education Shoots Up 114% After Hours: Here's Why\nIONS Premarket Gains 2.4% After C-Suite Insider Sells $440K In Stock\nHundreds Of Microsoft Employees Just Revealed Their Pay — From $111K To $340K — As Company Fights To Keep AI Talent From Meta\nTharimmune Rockets 42% After Hours — Adding To Stunning 206% Daytime Rally: What's Going On?\nPalantir, AppLovin, Robinhood or Coinbase? Benzinga Readers Pick Their Top Jim Cramer 'PARC' Stock\nPalantir, AMD, Oracle And Nvidia Decline After-Hours: Here's What You Should Know\nAlternative Investments\nSee more\nUS Housing Market Hits Rough Patch as Home Prices Struggle To Match Inflation\nMark Zuckerberg Once Gave His Palo Alto Neighbors Noise-Cancelling Headphones, Wine And Doughnuts For This Reason\nMortgage Fraud Is Now A Trump-Era Flashpoint—Here's Everything You Need To Know\nDFGR\nFMCC\nFNMA\n7 others\nIYR\nRWR\nSCHH\nUSRT\nVNQ\nXHB\nXLRE\nOfferpad Shares Surge Alongside Opendoor In Volatile Real Estate Sector\nOPAD\nOPEN\nOptions\nSee more\nBooking Holdings's Options: A Look at What the Big Money is Thinking\nBKNG\nUnpacking the Latest Options Trading Trends in Astera Labs\nALAB\nHut 8 Options Trading: A Deep Dive into Market Sentiment\nHUT\nOptions Corner: Identity Security Specialist Okta's Wild Swings Offer A Quick Flare Pass Opportunity\nOKTA\nExpert Ideas\nOptions Corner: Identity Security Specialist Okta's Wild Swings Offer A Quick Flare Pass Opportunity\nJosh Enomoto\nWhat's Going On With Best Buy Stock Today?\nNabaparna Bhattacharya\nGap Shares Rise As JPMorgan Sees Inflection Point Under CEO's Merchandising Playbook\nNabaparna Bhattacharya\nUlta Beauty Delivers Strong Quarter, Investors Brush Off The Glow\nNabaparna Bhattacharya\nEvery Story That Matters Around The Web\nTrump Says Prices Are 'Way Down' With 'Virtually No Inflation', Targets Windmills Again\nDonald Trump Says $15 Trillion Investment In US Will Be 'Immediately Cancelled!' If Courts Strike Down Tariffs: 'Would Become A Third World Nation'\nDave Ramsey Tells Divorced Dad Earning $86,000 To Ditch Mobile Home, Pay Off Truck Debt, Save For A Real House That Builds Wealth\nEric Trump To Attend Shareholder Meeting Of A Company In Japan That Is Emulating Michael Saylor's Bitcoin Hoarding Strategy: Report\nTrump 'Must Fire' Robert F Kennedy Jr, Calls For Dismissal Get Louder — Don Beyer, Bernie Sanders, Wisconsin's Sara Rodriguez Join The Chorus\nA Son Warned His Mom To Save For Retirement, But She Told Him It's A Scam. Now She's Getting Divorced And Is Retired With Nothing Saved"
    },
    {
      "url": "https://www.benzinga.com/quote/AMZN?getReport=1",
      "text": "Bulls vs Bears\nClick to unlock major analysts' bullish and bearish positions by joining Benzinga Edge.\nBenzinga Rankings give you vital metrics on any stock – anytime.\nExplore Amazon.com stock price, quotes, charts and forecasts with Benzinga. Stay updated on market trends for AMZN.\nYou can purchase shares of Amazon.com (NASDAQ:AMZN) through any online brokerage.\nOther companies in Amazon.com’s space includes: Hour Loop (NASDAQ:HOUR), QVC Group (NASDAQ:QVCGA), Groupon (NASDAQ:GRPN), Global E Online (NASDAQ:GLBE) and Macy's (NYSE:M).\nAmazon.com has a consensus price target of $262.08.\nThe stock price for Amazon.com (NASDAQ: AMZN) is $228.6967 last updated August 29, 2025 at 7:58 PM EDT.\nThere are no upcoming dividends for Amazon.com.\nAmazon.com’s Q3 earnings are confirmed for Thursday, October 30, 2025.\nThere is no upcoming split for Amazon.com.\nAmazon.com is in the Consumer Discretionary sector and Broadline Retail industry. They are listed on the NASDAQ."
    },
    {
      "url": "https://www.benzinga.com/money/mogul?utm_campaign=partner_feed&utm_source=yahooFinance&utm_medium=partner_feed&utm_content=site&nid=47437613",
      "text": "Benzinga Money is a reader-supported publication. We may earn a commission from the advertisers associated with this article. Read our Advertiser Discloser.\nFirst-time real estate investors can face several hurdles when trying to get started: high upfront costs, dealing with tenants and maintenance, finding and closing on a suitable property, and the fear that your initial investment won’t see a return, just to name a few.\nNow, there’s a company that handles all the grunt work and provides a money-back guarantee on your initial investment.\nIntroducing mogul, the simplest way to own income-producing blue chip real estate.\nFounded by former Goldman Sachs executives who have closed more than $10 billion in deals, they handle the sourcing, underwriting, and day-to-day management of every property.\nTo remove first-time jitters, mogul gives new investors their First-$10k Protection Guarantee: If your initial investment of up to $10,000 loses value in the first year, mogul refunds every lost dollar.\nInvestors in mogul portfolios have earned an average annualized return of 18.8%, paid out as monthly rental income plus appreciation.\nStart building a diversified property portfolio in minutes while mogul absorbs the downside.\n‘If we ever brag about a 4% IRR, I will quit’\nAlex Blackwood and Joey Gumataotao, mogul’s co-founders, routinely surpassed 15-20% annual returns when closing deals at Goldman Sachs. When they looked at other real estate investment platforms at the time, they found those companies would often brag to those investors about 4% annual returns on billions of dollars.\nAs Alex says on mogul’s website, “If we ever brag about a 4% IRR, I will quit immediately.”\nTo date, properties in mogul’s portfolio have generated an average 10-12% annual cash-on-cash yield that hit users’ accounts as rent dividends each month. When long-term appreciation is included, historical performance rises to an 18.8% annualized returns, giving investors both regular income and capital growth\nPart of their success is due to the fact that mogul mogul approves fewer than one percent of properties reviewed. Each candidate asset must clear a 12% bear case hurdle rate before moving to the next level of diligence.\nYou can browse eligible properties on mogul’s website and buy part or all of a house in under 30 seconds, or use the same data and tools available to top real estate firms to underwrite any property across the U.S.\nRent collections are aggregated and distributed to investors every month. At the same time, independent third-party valuations refresh inside your dashboard, letting you watch equity climb in real time while still enjoying depreciation and other pass-through tax advantages unique to real estate.\nMore than $1.2 million was invested on mogul last month.\nDisclaimers\nPlease be advised that alternative investments carry a risk of monetary loss. Neither Benzinga nor its staff recommends that you buy, sell, or hold any security. We do not offer investment advice, personalized or otherwise. All information contained on this website is provided as general commentary for informative and entertainment purposes and does not constitute investment advice.\nBenzinga will not accept liability for any loss or damage, including without limitation to, any loss of profit, which may arise directly or indirectly from use of or reliance on this information, whether specifically stated in the above Terms of Service or otherwise. Benzinga recommends that you conduct your own due diligence and consult a certified financial professional for personalized advice about your financial situation."
    },
    {
      "url": "https://www.benzinga.com/personal-finance/management/25/09/47437613/oaktree-capital-co-founder-says-were-in-the-early-days-of-a-market-bubble-heres-his-d",
      "text": "Oaktree Capital Management LP co-founder Howard Marks is sounding a cautionary note on today’s market, drawing parallels to the late 1990s tech boom while offering investors a roadmap for navigating what he believes are the early stages of another bubble.\nSpeaking on Bloomberg Television on Aug. 20, the legendary investor painted a picture of a market where stocks have become “expensive relative to fundamentals or reality,” driven by psychological forces where investors increasingly “like stocks too much.” But unlike many market bears, Marks isn’t hitting the panic button just yet.\nDon't Miss:\n- Would You Have Invested in eBay or Uber Early? The Same Backers Are Betting on This Vacation Home Platform\n- They Sold Their Last Real Estate Company for Nearly $1B — Now They're Building the Future of U.S. Industrial Growth\n“We’re in the early days of a bubble,” Marks explained, comparing the current environment to around 1997, when markets were “falling in love with tech stocks” without concern for valuations—a period that preceded former Federal Reserve Chair Alan Greenspan’s famous “irrational exuberance” warning. However, Marks emphasized a crucial distinction: “We are currently in the early days and not yet at nutty valuation levels, so I’m not ringing the alarm bells for an immediate correction.”\nThe Real Concern Isn’t Just Big Tech\nWhile Magnificent Seven tech giants like Amazon Inc. AMZN and Alphabet Inc. GOOGL GOOG)) grab headlines with their outsized market gains and lofty valuations, Marks finds something more troubling lurking beneath the surface.\n“What’s more alarming is that high valuations are being applied to more average companies”—the other 493 stocks in the S&P 500—”rather than just exceptional companies,” Marks noted. While acknowledging the Magnificent Seven as “great companies” whose valuations he cannot definitively call “excessive,” the broader market’s embrace of rich multiples across ordinary businesses signals a more concerning shift in investor psychology.\nThis widespread valuation expansion reflects what Marks identifies as the biggest mistake investors make, concluding that “the way things are today is the way it’ll always be.” This mindset, he argues, ignores the more probable “reversion to the mean” and has been fostered by the absence of a serious market correction in 16 years.\nTrending: An EA Co-Founder Shapes This VC Backed Marketplace—Now You Can Invest in Gaming's Next Big Platform\nA Strategic Shift Toward Credit\nRather than advocating for a complete exit from risk assets, Marks suggests a more nuanced approach. “It’s a time for some caution. Put a little more defense into your portfolio,” said Marks.\nHis preferred defensive strategy? A shift toward credit markets. “Investing in credit as opposed to equities is one way to achieve this,” Marks explained, highlighting credit’s inherent defensive characteristics compared to stocks.\nCredit offers what equities cannot: “a promise of payment and a contractual rate of return,\" noted Marks. Even with tight credit spreads, Marks argues that “a contractual guarantee approaching returns in the sixes over the next 10 years is more defensive than being in the stock market at these elevated valuations.”\nThe math is compelling from a risk-adjusted perspective. Credit has a “high probability of doing fine,” while stocks at current valuations face a “reasonable probability of doing less than fine.”\nSee Also: Kevin O'Leary Says Real Estate's Been a Smart Bet for 200 Years — This Platform Lets Anyone Tap Into It\nAmerica Still Leads, But the Gap Is Narrowing\nDespite his cautions, Marks remains fundamentally bullish on America’s long-term prospects. He still considers the U.S. the “best place in the world to invest,” citing the nation’s “spirit of innovation, free markets, rule of law, capital markets, growth, dynamism, and great companies.”\nHowever, he acknowledges a subtle shift: the U.S. may be “a little less best than we used to be.” This creates opportunities for discerning investors willing to trade some quality for better prices, as they can find “less good assets in other parts of the world at cheaper prices.”\nMarks closed his analysis with a quote from philosopher John Stuart Mill that encapsulates his investment philosophy: “He who knows only his own side of the case knows little of that.” By understanding both bull and bear cases, investors can make more informed decisions about navigating these uncertain waters.\nFor investors heeding Marks’ advice, the message is clear: maintain exposure to quality assets while building defensive positions through credit investments—a strategy designed to weather whatever storm may come while still participating in continued market growth.\nRead Next: From Chipotle to Red Bull, Top Brands Are Already Building With Modern Mill's Tree-Free Wood Alternative — Here's How You Can Invest Too\nImage: Shutterstock\nEdge Rankings\nPrice Trend\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
      "url": "https://www.benzinga.com/money/modern-mill?utm_campaign=partner_feed&utm_source=yahooFinance&utm_medium=partner_feed&utm_content=site&nid=47437613",
      "text": "Benzinga Money is a reader-supported publication. We may earn a commission from the advertisers associated with this article. Read our Advertiser Discloser.Own Shares in the Future of Wood™. See How Modern Mill is Building For the Next Generation.\nYour parents built with wood. Your grandparents built with wood. But what if there's something better for the next generation?\nHere’s the reality: Harvesting 200 year old-growth trees that take centuries to mature is wasteful, costly, and increasingly impractical. With new tariffs, environmental regulation and global supply disruptions, wood has seemingly never been more difficult to source.\nModern Mill has changed that. From their hometown in Mississippi, the next-generation manufacturer has engineered ACRE, a 100% tree-free composite made from upcycled rice hulls. ACRE mirrors the beauty of tropical hardwoods like ipe, walnut, mahogany, and teak, without the environmental toll or premium price of cutting down old-growth forests.\nNow you can own shares in the company that aims to redefine the future of building, one tree-free board at a time.\nWood for the Next Generation™\nFor centuries, wood has been the go-to material for building, but it comes with problems: constant upkeep, poor durability in tough climates, and the environmental toll of cutting down old-growth trees.\nTraditional composites were the next attempt at a solution. While they delivered durability, they were difficult to work with and couldn’t simulate the authentic look and feel of real wood.\nModern Mill believes ACRE changes that. It’s the first material to combine the warmth and workability of wood with the low-maintenance durability of composites. Builders, architects, and homeowners are switching to ACRE for siding, decking, trim, fencing, cabinetry, and more.\nMade in Mississippi, Modern Mill is bringing manufacturing back to the USA, creating quality jobs and revolutionizing the way the world builds. ACRE is made with a zero-waste process that transforms landfill-bound rice hulls into a high-performance wood alternative.\nModern Mill has already proven impact, generating over $20M of revenue in 2024 and more than $84M raised in private funding. Now the company is inviting investors to join their mission to bring a new standard of building materials to a $500B market opportunity for siding, trim, decking, millwork, and more.\n*HISTORICAL GROWTH & PAST PERFORMANCE IS NOT INDICATIVE OF FUTURE RESULTS.\nThe big names are already on board. ACRE was chosen by major brands like Red Bull, Heineken, Chipotle, and OMNI Hotels for high-profile projects, and it’s quickly becoming a go-to choice for consumers who want a durable and sustainable alternative to wood.\nWith national distribution in place, Modern Mill reaches the market through established two-step distributors, dealers, and lumber yards, supported by sales and marketing programs that drive product demand from the ground up.\nThe company’s vision and innovation have also earned recognition from PBS’ This Old House, Forbes, and Fast Company’s Most Innovative Companies List.\nDisclaimers\nThis Reg CF offering is made available through StartEngine Primary, LLC. This investment is speculative, illiquid, and involves a high degree of risk, including the possible loss of your entire investment.\nPlease be advised that alternative investments carry a risk of monetary loss. Neither Benzinga nor its staff recommends that you buy, sell, or hold any security. We do not offer investment advice, personalized or otherwise. All information contained on this website is provided as general commentary for informative and entertainment purposes and does not constitute investment advice.\nBenzinga will not accept liability for any loss or damage, including without limitation to, any loss of profit, which may arise directly or indirectly from use of or reliance on this information, whether specifically stated in the above Terms of Service or otherwise. Benzinga recommends that you conduct your own due diligence and consult a certified financial professional for personalized advice about your financial situation."
    },
    {
      "url": "https://www.benzinga.com/money/pacaso?utm_campaign=partner_feed&utm_source=yahooFinance&utm_medium=partner_feed&utm_content=site&nid=47437613",
      "text": "Benzinga Money is a reader-supported publication. We may earn a commission from the advertisers associated with this article. Read our Advertiser Discloser.\nThree of the same VC firms that backed Uber, Venmo, and eBay, respectively, are all investing in another private company: Pacaso.\nVenture backing in companies like Pacaso is nothing new. After all, early-stage companies often have the potential to deliver the most outsized returns.\nBut, recent regulatory updates have opened the door for individual investors to invest alongside these venture capitalists. Normally, everyday investors have to wait for a company to go public before they can invest, missing out on that early gain potential. Now, some companies are opening up investment opportunities to the public.\nThis type of investing has already seen some great success stories. For example, in 2016, 433 people invested an average of $2,730 in a private startup named Revolut. Fast-forward to today, those $2,730 stakes are worth over $1 million, up 89,900%.\nToday, thousands of investors have joined big-name VCs in taking a chance on Pacaso. It's no surprise, considering Pacaso's resumé:\n- The company has made $110M in gross profits to date\n- Pacaso's co-founder sold his last company to Zillow for $120M\n- They operate in over 40 vacation destinations across the US, Mexico, UK, and France\n- The company reserved the Nasdaq ticker PCSO\nBut the growth potential is where the excitement is. Below we'll reveal more about how Pacaso has ramped up and built a competitive moat so quickly, and how you can share in their growth.\nNext-Generation Co-Ownership\nAfter his $120M exit and subsequent role as a Zillow executive, Austin Allison created Pacaso’s game-changing co-ownership model. Powered by proprietary tech and an innovative structure that eliminates the headaches of traditional vacation home ownership, it’s already leaving a mark. Here’s how:\n- Seamless Transactions: Clients easily buy, finance, and resell, shares of luxury homes through Pacaso’s intuitive platform\n- Turnkey Ownership: Pacaso handles maintenance, scheduling, and furnishing; owners simply enjoy their vacation homes\n- Maximized Value: Homes that once sat empty up to 90% of the year now stay occupied nearly year-round, benefiting owners and local economies\nThe demand for their services and expertise is real. In top destinations, co-ownership is growing 21% annually in the US, and Pacaso homes have appreciated nearly 10% since 2021 – roughly double the growth of the broader luxury market.\nScaling Into 10 New International Destinations\nPacaso is already leading the charge in the $1.3 trillion US vacation home market, combining real estate innovation with tech-driven efficiency to generate multiple revenue streams. These include transaction service fees on every sale, recurring property management fees, and exclusive financing options tailored to co-owners.\nNow, the platform’s global reach is growing quickly, and they’re already seeing strong returns in the $500B global market. In 2024, they set records in Paris and London. Meanwhile, Cabo (Mexico) is the #3-most-searched destination on their platform. No surprise Europe and Mexico have accounted for 22% of their revenue over the past two years.\nNow, they’re taking international expansion to an entirely new level. They recently announced 10 new international destinations will be added to their platform, spread across Italy, the Caribbean, and Mexico. That means Pacaso’s unique model is poised to dominate a combined $1.8T in vacation home markets.\nWhy Investors Are Paying Attention\nThere are many reasons why firms managing a combined $180B+ in assets, and 10,000+ individual investors have already backed Pacaso, including:\n- Proven Leadership: Allison is joined by executives with decades of real-estate and startup experience.\n- Strong Growth Metrics: Full-year 2024 financials showed a 21% YoY increase in gross real estate volume and a 24% improvement in adjusted EBITDA.\n- Surging Demand: 40% of Americans want to buy a vacation home in the next year (Coldwell Banker)\nAfter impressive full-year earnings showed gross profit grew 41%, and with continued growth and expansion ahead, Pacaso is really hitting their stride.\nPacaso is offering securities through the use of an Offering Statement that has been qualified by the Securities and Exchange Commission under Tier II of Regulation A. A copy of the Final Offering Circular that forms a part of the Offering Statement may be obtained from: invest.pacaso.com. Reserving the ticker symbol is not a guarantee that the company will go public. Listing on the Nasdaq is subject to approvals.\nDon’t Miss Your Chance to Become an Early Investor in Pacaso:\nDisclaimers\nPlease be advised that alternative investments carry a risk of monetary loss. Neither Benzinga nor its staff recommends that you buy, sell, or hold any security. We do not offer investment advice, personalized or otherwise. All information contained on this website is provided as general commentary for informative and entertainment purposes and does not constitute investment advice.\nBenzinga will not accept liability for any loss or damage, including without limitation to, any loss of profit, which may arise directly or indirectly from use of or reliance on this information, whether specifically stated in the above Terms of Service or otherwise. Benzinga recommends that you conduct your own due diligence and consult a certified financial professional for personalized advice about your financial situation."
    },
    {
      "url": "https://www.benzinga.com/premium/ideas/benzinga-edge-checkout/?t=be8be9spja3yaad2&utm_source=yahoo",
      "text": "While Wall Street panics, Edge members stay one step ahead of the chaos. With real-time portfolio alerts, actionable stock ideas, and pro-grade tools…you get the complete investor’s arsenal — ready to help you profit in any market, starting now.\n“After months of feeling like a deer in headlights, Edge finally gave me the conviction to make a move—and it was the right one.”\n“I was juggling so many newsletters and software subscriptions I lost count… now I just use this! Way more effective. And way easier to manage.”\n“I check Edge before I check the news. Before emails. It’s that important. Especially in this market.”\nForget endless market noise. We’ll give you what actually matters -clear signals, actionable opportunities, and the tools you need to invest with confidence.\nGo beyond information overload, and get powerful trade ideas delivered straight to your inbox. We’re talking 5 hidden gems weekly, pre-market setups daily, and instant rankings on any ticker. Plus, two ‘done for you’ portfolios crushing the market so far in 2025.\nEdge gives you the same powerful research tools the pros use — track what politicians are trading, detect insider moves, and spot breakout signals before they hit the news. No $10K Bloomberg terminal required.\nEvery morning we zero in on ONE stock flashing clear technical signals...\nthen hand you a confusion free chart setup with high profit potential.\nGain unfiltered access to what politicians are buying and selling. Our Government Trade Tracker allows you to invest alongside the Washington elite. Because why should Nancy and co. have all the fun? (and make all the money.)\nNever be caught off-guard by market-moving moments. Access 10+ critical event calendars to track earnings, FDA decisions, product launches, and other pivotal events that can dramatically impact stock prices.\nUncover near endless opportunities with this advanced Stock Screener. It includes 100+ customizable filters. Target precise metrics from fundamentals to technical indicators. Save hours of research while discovering what other traders miss.\nEliminate guesswork with our powerful Smart Calculators. They make it easy to map your potential profit zones for margins, options, and forex. Save hours of manual work while maximizing returns and reducing costly errors.\nMonitor elite market moves with our real-time Insider Trading Tracker. Spot exactly when executives buy or sell their own company stock. Follow the smart money when insiders put their personal wealth on the line.\nSpot big-money options bets that often signal coming price moves. See what the pros are targeting before major market swings happen. The Unusual Options Activity tool shows you exactly when someone makes a huge options bet.\nWall Street Ratings: Tap directly into the minds of Wall Street's top 1000 analysts. See which stocks are gaining favor, losing appeal, or catching fresh attention—all with proven accuracy metrics that separate signal from noise.\nDiscover what’s really moving markets… get actionable intelligence on hidden drivers, and upcoming profit triggers most investors are missing.\nSpot tomorrow’s market leaders, today…uncover the stocks that will shape the future – before they hit mainstream news.\nTrack where billionaires and Wall Street insiders are putting their personal fortunes…then see how to profit alongside them.\nMost just give you more content – Edge gives you a complete investing advantage in three powerful ways:\n1) Exclusive Research – We uncover the real stories driving markets before they become common knowledge, so you’re always a step ahead of the crowd.\n2) Expert Vetted Stock Picks – Instead of vague recommendations, you get specific trades with proven track records from analysts who put their reputation on the line.\n3) Professional-Grade Tools – Access the same institutional-level trading technology to spot opportunities and analyze market moves.\nNot at all. Whether you’re just starting out or investing for decades for, Edge translates Wall Street complexity into clear opportunities. Every insight comes with straightforward action steps, so you always know exactly what to do next. Advanced traders particularly value our institutional-grade tools and deep market intelligence.\nThink of Edge as your personal market filter. Instead of drowning in data, you get only what drives profits: key market moves, actionable trade ideas, and critical alerts for your watchlist. Every feature is designed to cut through the noise, delivering exactly what you need to know – nothing more, nothing less. Plus, your welcome email shows you exactly how to use each tool for maximum profit potential.\nFor annual memberships at regular price, we offer a 7-day money-back guarantee. However, the special 43% New Member Discount is non-refundable due to its significant savings. That’s why most new members choose the New Member Discount – it’s simply too valuable to pass up. You get instant access to everything Edge offers at our lowest possible rate."
    },
    {
      "url": "https://www.benzinga.com/quote/GOOGL?getReport=1",
      "text": "Bulls vs Bears\nClick to unlock major analysts' bullish and bearish positions by joining Benzinga Edge.\nBenzinga Rankings give you vital metrics on any stock – anytime.\nExplore Alphabet stock price, quotes, charts and forecasts with Benzinga. Stay updated on market trends for GOOGL.\nYou can purchase shares of Alphabet (NASDAQ:GOOGL) through any online brokerage.\nOther companies in Alphabet’s space includes: Grindr (NYSE:GRND), ZoomInfo Technologies (NASDAQ:GTM), Tripadvisor (NASDAQ:TRIP), Baidu (NASDAQ:BIDU) and JOYY (NASDAQ:JOYY).\nAlphabet has a consensus price target of $211.03.\nThe stock price for Alphabet (NASDAQ: GOOGL) is $212.7399 last updated August 29, 2025 at 7:59 PM EDT.\nThe next Alphabet (GOOGL) dividend date is projected to be Monday, September 8, 2025.\nAlphabet’s Q3 earnings are confirmed for Tuesday, October 28, 2025.\nThere is no upcoming split for Alphabet.\nAlphabet is in the Communication Services sector and Interactive Media & Services industry. They are listed on the NASDAQ."
    }
  ],
  "argos_summary": "Howard Marks warns that the U.S. equity market is in the early stages of a bubble, with high valuations expanding beyond tech giants to the broader S&P 500. He advises a defensive tilt toward credit, citing its contractual returns as more resilient than equities at current multiples. While remaining bullish on long‑term U.S. growth, Marks urges investors to balance quality exposure with credit defenses to weather potential corrections.",
  "argos_id": "2NMLW5DVQ"
}