{
  "url": "https://www.digitaltrends.com/tablets/i-found-an-ipad-mini-antidote-for-android-fans-but-its-a-lot-better/",
  "authorsByline": "Nadeem Sarwar",
  "articleId": "5e37961d1c5d400e8f21a40c0e6c5ef4",
  "source": {
    "domain": "digitaltrends.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "OR",
      "county": "Multnomah County",
      "city": "Portland",
      "coordinates": {
        "lat": 45.5202471,
        "lon": -122.6741949
      }
    }
  },
  "imageUrl": "https://www.digitaltrends.com/wp-content/uploads/2025/08/Red-Magic-Astra3904.jpg?resize=1200%2C630&p=1",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-30T14:33:00-07:00",
  "addDate": "2025-09-01T04:51:07.572066+00:00",
  "refreshDate": "2025-09-01T04:51:07.572068+00:00",
  "score": 1.0,
  "title": "I found an iPad mini antidote for Android fans, and it’s a lot better",
  "description": "The Red Magic Astra is a fantastic small tablet that takes on the iPad mini, and beats it with more substance than it ideally should at a $499 ask.",
  "content": "Imagine a small tablet for reading and content consumption, and the first recommendation that you will get from people around you is the iPad mini. And deservedly so. It’s a terrific little slate. Unfortunately, Android failed to step up in the segment for years. In 2025, Red Magic Astra finally shifts that status quo. And quite handsomely, if I might put it.\n\nNow, unless you’re someone who can bravely look beyond the Apple ecosystem, you can be forgiven for not knowing about Red Magic. Android enthusiasts, however, hold the brand in pretty high regard. For years, Red Magic has made some terrific gaming-centric phones at the edge of compelling design and top-tier performance.\n\nIt was only last year that Red Magic made a no-holds-barred tablet. This year, the company delivered another knockout punch with the compact Red Magic Astra, a tablet that clearly has the iPad mini in its crosshairs, but goes beyond its Apple rival in so many ways.\n\nThere’s nothing quite like it\n\nWhen I first held the Red Magic Astra in my hands, it immediately felt like a tablet that is not here to play, but to impress. The all-metal build is extremely polished, but it’s the rear shell where this tablet stands out with a unique design element.\n\nJust like the Asus ROG Flow, the Astra has a glass strip at the back that allows you to take a peek at the silicon and vapor chamber areas, alongside the RGB-lit fan. Yes, there’s a physical fan fitted inside this palm-friendly tablet, rocking shark fin blades that can whir at an impressive 20,000 RPM.\n\nRed Magic claims that these fans can bring down the slate’s temperature by as much as eight degrees Centrigrade. These fans actually deliver on their intended purpose. Their side-mounted position allows them to circulate the hot air and vent it through the speaker grilles. If you put a finger on the side, you can actually feel the airflow.\n\nThere are a few minor gripes that I have with this tablet, but none too make-or-break type. The off-center position of the USB-C port is a bit awkward, especially when playing games in handheld mode via touch-screen inputs. The power button at the top is a tad too thin, though the fingerprint sensor embedded within does an acceptable job at authentication.\n\nAnother minor issue is the placement of the dual-speaker array. Their enter-aligned position almost always gets covered with palms if you are playing games in landscape mode. I also miss the capacitive shoulder-mounted trigger buttons that you get on the Red Magic smartphones, such as their latest 10S Pro flagship.\n\nLots of flash, but even more substance\n\nYet, what this tablet misses out on in a few minor areas, it more than makes up for it with the perks at hand – especially if you put the asking price into consideration. Let’s start with the build. The Astra comes with an IP54 clearance for dust and water resistance. It’s not the best, but still better than nothing, as is the case with the iPad mini.\n\nMoving on to the display, which makes the iPad mini feel like a bad value for the bill it incurs. On the Red Magic Astra, you get a slightly bigger 9-inch OLED panel with a 165Hz refresh rate, which is far better than the 60Hz LCD panel on the iPad mini. In side-by-side tests, it’s easy to see the deeper black levels and the extra punch in colors.\n\nAnother major advantage is the brightness levels. Apple’s tablet can only reach 500 nits, and coupled with the screen glare problem, it can give you trouble with outdoor visibility. The Astra offers a peak brightness of 1,600 nits, though it can manually “only” manage 1,100 nits.\n\nIt’s a joy watching videos and playing games on this screen. To go with the sharp visuals, the Astra also adopts dual X‑axis linear motors for haptics, and it makes a tangible difference while playing games. And oh, let’s not forget the bezels, by the way. Have a look:\n\nThe Red Magic Astra draws power from Qualcomm’s top-tier Snapdragon 8 Elite SoC, the best silicon you can get in an Android device out there. What surprised me was the tablet’s stability, which even surpassed that of the M4 iPad Pro. After running the 20-loop 3DMark Wild Life Extreme test, the Red Magic Astra delivered an impressive performance stability of 88.4% on the synthetic run. The iPad mini, on the other hand, could only muster around 74% stability.\n\nNext, I switched to the more demanding ray-traced simulated environment of the 3DMark Steel Nomad Light stress test. The Astra wowed me once again with an impressive stability of 93.1%, while the iPad mini with Apple’s A17 Pro silicon couldn’t go past the 80% mark.\n\nEven under peak graphics and thermal load, the frame rates only dipped 7% below their maximum value, and even recovered over time. This is something I have rarely seen on phones powered by the same Qualcomm silicon.\n\nInterestingly, the Astra does an even better job at delivering top-tier performance and heat management than the bigger Red Magic Nova tablet. There are a total of 13 dedicated cooling components fitted inside the tablet’s all-metal chassis.\n\nTo give you an idea, the thermal architecture of the Nova includes multiple layers of graphene and copper foil, a dual-layer vapor chamber, and liquid metal, something you only come across on high-end gaming laptops such as the Asus ROG Strix Scar 18.\n\nMoving beyond simulated performance runs and into the realm of top-shelf gaming, the Red Magic tablet doesn’t disappoint. I have rarely seen a tablet with a metallic shell running as cool as the Red Magic Astra. Certainly not in the Android segment.\n\nAnother pretty cool aspect of the Red Magic Astra is that it fully embraces its gamer-first identity. To that end, it offers deep performance tuning controls, which let you control everything from the fan speed to CPU and GPU clock speeds, taking the latter to its GHz scale limit.\n\nRed Magic calls it Diablo Mode. Now, there aren’t many games that can tap into this extra firepower to level up the graphics quality or deliver a sizable jump in gaming performance, the way you would expect on a gaming PC. But to give you a brief idea, it can boost the multi-core performance by around 7% and the graphics output by nearly 11% in synthetic benchmarks.\n\nThe mileage will vary depending on the workload or the game at hand. To the naked eye, the difference is hard to spot, unless you’re pushing a demanding title like Zenless Zone Zero, where you get a buttery smooth experience at the best graphics preset and peak resolution.\n\nDiablo Mode must be enabled from the side panel, which you can access after starting games from within the Game Space launcher. This is where the fun truly begins. This launcher not only works on the tablet, but also seamlessly transforms into a desktop gaming center when connected to a larger screen.\n\nIt’s a simple plug-and-play approach, and it works just as fine for native Android games as it does for emulated titles for legacy consoles. Even with resolution and graphics upscaling, you can comfortably play console Nintendo and PSP titles, and even a few emulated PC games, without running into any performance shortfalls.\n\nRed Magic has spent a lot of time developing game-centric plug-ins that offer an extra edge, such as color inversion to spot enemies, directional sound cues, and boosted zoom in crosshair, among others. Then there’s the in-game dashboard, which offers quick access to a whole bunch of gameplay and system utilities.\n\nThis is something that sets the Red Magic Astra apart from every other Android tablet out there. It sets out to deliver a fantastic gaming experience, and surpasses those expectations at both hardware and software levels.\n\nAs far as power efficiency goes, this one comes equipped with a dual-cell 8,200 mAh battery. Now, it’s hard to quantify the battery life because that would vary dramatically depending on the game you’re playing and the performance preset active in those sessions. But based on my non-gaming usage that includes reading web comics, articles, and a bit of sports streaming, this tablet should last around 8-10 hours.\n\nIf you’re pushing it (and I mean really pushing it) at games, the battery will be exhausted in roughly six to seven hours. Thankfully, topping it up is not a hassle. The Astra supports 80W charging, which can fill the battery up to 60% in just about 30 minutes, while a full charge takes an hour.\n\nA cool perk is bypass charging, which separates the battery from the power draw. Simply put, the connected cable only supplies enough juice to keep the device running, and in the process, avoids heat buildup.\n\nOverall, the Red Magic Astra is a fantastic small tablet that fills a unique iPad mini-sized gap in the Android hardware ecosystem. But it’s really when you look at its asking price that you realize just how astoundingly good value it offers, especially when compared against Apple’s small tablet.\n\nStarting at $499 for the variant with 12GB of RAM and 256GB of onboard storage, the Red Magic Astra is already leagues ahead of the iPad mini in terms of sheer hardware-level goodness. And as you factor in benefits like an OLED display, far superior thermal hardware, deep levels of performance tuning, way faster charging chops, and a console-in-tablet approach, the Astra seems like a stuff of dreams for compact tablet fans.\n\nUnless you are smitten by iPadOS or can’t part ways with the conveniences of the Apple ecosystem, there is no better “small” tablet on the planet for the price than the Red Magic Astra. The only bitter pill you need to swallow is the import route and the somewhat limited 3-year OS update situation. As for the rest of the package, it’s pretty magical.",
  "medium": "Article",
  "links": [
    "https://www.digitaltrends.com/computing/asus-rog-strix-scar-18-2025-review/",
    "https://www.digitaltrends.com/phones/i-tested-a-wild-phone-that-apple-must-copy-for-iphones-gaming-ambitions/",
    "https://www.digitaltrends.com/mobile/every-ipad-release-in-chronological-order-2010-2025/",
    "https://intl.redmagic.gg/pages/redmagic-astra-gaming-tablet",
    "https://www.digitaltrends.com/tablets/asus-rog-flow-z13-2025-review/",
    "https://www.digitaltrends.com/tablets/redmagic-nova-review/",
    "https://www.digitaltrends.com/tablets/the-first-ipad-mini-2024-reviews-are-out-here-is-what-people-are-saying/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Red Magic Astra",
      "weight": 0.09661293
    },
    {
      "name": "Red Magic",
      "weight": 0.08593203
    },
    {
      "name": "Red Magic Nova",
      "weight": 0.08152005
    },
    {
      "name": "compact tablet fans",
      "weight": 0.07210856
    },
    {
      "name": "tablet",
      "weight": 0.06750336
    },
    {
      "name": "Astra",
      "weight": 0.06432773
    },
    {
      "name": "native Android games",
      "weight": 0.060706057
    },
    {
      "name": "gaming performance",
      "weight": 0.060318515
    },
    {
      "name": "the bigger Red Magic Nova tablet",
      "weight": 0.059562337
    },
    {
      "name": "the compact Red Magic Astra",
      "weight": 0.058290936
    }
  ],
  "topics": [
    {
      "name": "iPad"
    },
    {
      "name": "Electronics"
    },
    {
      "name": "Android"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Computers & Electronics/Software/Operating Systems",
      "score": 0.8984375
    },
    {
      "name": "/News/Technology News",
      "score": 0.82177734375
    },
    {
      "name": "/Shopping/Consumer Resources/Product Reviews & Price Comparisons",
      "score": 0.76318359375
    },
    {
      "name": "/Internet & Telecom/Mobile & Wireless/Mobile Phones",
      "score": 0.7431640625
    }
  ],
  "sentiment": {
    "positive": 0.27563733,
    "negative": 0.2185934,
    "neutral": 0.50576925
  },
  "summary": "Red Magic has developed a compact tablet named the Red Magic Astra, a tablet that surpasses the iPad mini in many ways. The Astra's unique design features a glass strip at the back and a fan that can bring down the tablet’s temperature by up to eight degrees Centrigrade. The 9-inch OLED panel with a 165Hz refresh rate is also a major advantage over Apple's iPad mini. Despite a few minor issues, the Astra offers an impressive 8-hour run on an iPad mini, which surpassed the run on the iPad Mini. The company also offers an IP54 clearance for dust and water resistance and a X‑axis linear visuals. The device uses Qualcomm's Snapdragon 8 EliteC, the best silicon silicon in silicon.",
  "shortSummary": "Red Magic Astra offers an excellent design and features, surpassing the iPad mini, with enhanced multimedia features, and affordable storage options.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "bba7923e71ff474da99ff4ae49024a5e",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.digitaltrends.com/mobile/every-ipad-release-in-chronological-order-2010-2025/",
      "text": "Apple’s legacy is most frequently tied to the iPhone and Mac. And to some extent, what a service-based revenue model can achieve when executed well. But there is no category where Apple has enjoyed as much dominating success as tablets.\nWhen Apple co-founder and former CEO Steve Jobs revealed the first iPad on stage back in 2010, he questioned the concept of a “third category” of personal devices. To him, the iPad represented something “more intimate than a laptop, and so much more capable than a smartphone.”\nOver a decade later, the iPad sits comfortably as a successful third category, one that can handle the fun of watching films and playing games with as much pizzazz as handling complex creative works. Look no further than iPadOS 26 to sense just how much it has evolved. Here’s a brief history of every iPad launched so far, and how it kept refining the tablet formula.\nThe 1st generation iPad – 2010\nThe one that started it all. The first iPad was a chunky slate with a metallic enclosure, thick bezels, and a 9.7-inch screen. Back then, it couldn’t handle calls, lacked a rear camera, had no concept of multitasking, or even an official keyboard accessory.\nStarting at $499, Apple referred to it as “a magical and revolutionary device at an unbelievable price.” Equipped with the A4 processor, it was quite snappy at the time, and even marked the release of a dedicated SDK for developers to build tablet experiences.\nApple also released a version of the iWork package specifically for the iPad’s touch-sensitive computing approach. Back then, Apple sold the Pages, Keynote, and Numbers apps at $9.99 each, but they now come preinstalled on iPads.\n“As time goes by, you’ll find many more usages and situations in which the iPad will become an indispensable part of your everyday life, not only the blank ones,” concluded Digital Trends’ review. It was not perfect back then, but a sign of great things to come.\niPad (2nd generation) – 2011\nApple called it the iPad 2. The biggest upgrade on this one was the dual-core Apple A5 chip, which doubled the performance, according to Apple. When Digital Trends went hands-on with the slate, it turned out to be more agile, especially at demanding apps such as GarageBand.\nAside from being dramatically thinner and lighter, Apple also added a rear camera into the mix, making it the first iPad to feature two cameras. “As opposed to using an iPhone or fourth-gen iPod touch, it was good to use the nearly 10-inch real estate to see who you’re talking to,” wrote Digital Trends.\nInterestingly, Apple kept the price unchanged, but shipped it with a catalog of approximately 350,000 apps, a huge jump compared to the original iPad. Back then, the lack of Flash support in the Safari browser was deemed a big miss, and so was NFC support.\niPad (3rd generation) – 2012\nThings started to pick up pace for the iPad when the third-generation iPad came out. It was the first to embrace the Retina display, which delivered four times more pixels than its predecessor. Apple said the new iPad offered “the highest resolution display ever seen on a mobile device with 3.1 million pixels.”\nApple also upgraded it to a quad-core A5X processor that boosted the graphics performance significantly. Another key selling point was the new 5 megapixel iSight camera that let users record full-HD videos. And let’s not forget about 4G LTE support landing on Apple’s tablet, at last.\n“For the first time, the new iPad feels like the device Steve Jobs promised two years ago. This is a capable post-PC device and should usher in another great year for tablets,” concluded Digital Trends’ review of the slate.\niPad (4th generation) and iPad Mini – 2012\nThe big reveal at Apple’s late 2012 event was the iPad mini. “iPad mini is as thin as a pencil and as light as a pad of paper,” said Apple at launch. This one introduced a fresh design language with an aluminum enclosure and a bunch of impressive tricks.\nIt offered a 9.7-inch Retina display, drew power from the A5 processor, packed an iSight camera, and next-gen network hardware for improved wireless speeds. Apple put it on the shelf starting at $329 in two colors – slate and silver.\nTagging alongside the iPad mini was the fourth-generation iPad, which dialed things up a notch by landing the new A6X processor. It doubled the CPU and GPU performance compared to the A5X processor, offered wider cellular connectivity, and, for the first time, a Lightning connector. All this happened while the price remained the same.\niPad Air (1st generation) and iPad Mini 2 – 2013\nIn 2013, Apple launched the first iPad Air, a thinner and lighter tablet that pushed the iPad into the premium computing segment for the first time. It was thinner, lighter, featured slimmer bezels, and came equipped with the next-gen A7 processor.\nThe new 64-bit silicon opened the doors for OpenGL ES for enhanced gaming performance, and came equipped with the M7 motion coprocessor to enhance power efficiency. Apple said it was the lightest full-sized tablet in the world, keeping the price at $599.\nIt was launched alongside the second-generation iPad mini, which also shared the same A7 processor as its A7 sibling, quadrupling the CPU performance compared to its predecessor. The standout, once again, was the light form factor and the sharp 7.9-inch Multi-Touch Retina display with a higher pixel density.\niPad Air (2nd generation) and iPad Mini (3rd generation) – 2014\nIn 2014, Apple once again reinvented the design philosophy. The second-generation iPad Air came equipped with a fingerprint sensor within the home button, a choice that came to be known as TouchID, while also improving the camera.\nAt just 6.1mm across, it was the thinnest iPad Apple had ever made. It came armed with the A8X chip that offered a 2.5x improvement in graphics performance and offered a Retina display with anti-reflective coating on top.\n“It’s a fantastic tablet and outshines everything else out there in almost every meaningful way,” concluded Digital Trends’ review of the slate. The third-generation iPad mini also got a fingerprint sensor and a new gold color, but not much else. “The iPad Mini 3 is an amazing tablet and an atrocious waste of money,” concluded our review.\niPad Pro (1st generation) and iPad mini (4th generation) – 2015\nIn 2015, Apple once again pulled a surprise by launching the iPad Pro with a massive 12.9-inch Retina Display. It was fitted with the A9X processor and Apple’s highest resolution display yet. It also marked the debut of the Apple Pencil and a keyboard for Apple’s tablet.\n“As a tablet, we can confidently recommend the iPad Pro as the best big slate on the market,” said Digital Trends’ review of the slate. The big downer was the price, as the starting price was $799, but it only offered 32GB of storage.\nThe 4th Gen iPad mini wasn’t much of an upgrade. It stuck with the same design, offered an older A8 processor, but got a lift from iOS 9. “If you really want a small iPad and don’t mind spending money, you can’t go wrong with the Mini 4,” remarked Digital Trends’ review.\niPad Pro (9.7-inch) – 2016\nApple returned to its roots for making smaller, but power-packed devices in 2016. The result was the 9.7-inch iPad Pro. This one introduced an improved Retina display with higher brightness and the new True Tone technology for white balance adjustment.\nIt was powered by the A9X processor, packed a quad speaker system, an improved 12-megapixel rear camera that could shoot 4K videos, and a full suite of Lightning accessories to go with it. Notably, it brought down the price of a flagship iPad to $599 in the US.\n“For its 10-inch size, it’s the most powerful, best-sounding, pinkest, and most camera-ready tablet on the market,” said Digital Trends’ review of the slate. “What it isn’t is a great bargain, or a great substitute for a good laptop.”\niPad (5th generation) — 2017\nAfter a long gap where the Air, Pro, and mini lines grabbed all the limelight, Apple returned to the vanilla iPad, positioning it as the most affordable large-screen tablet in the brand’s portfolio. It was a smash hit.\nPacking a 9.7-inch Retina display, the A9 processor, all-metal chassis, improved front and rear cameras, and Touch ID button, the fifth-generation iPad offered a lot for just $329. It was just a great return to form, and an all-around budget-friendly slate without any big misses.\n“This is the everyman’s tablet. The tablet you can use to consume media and browse the web, and the tablet you can use to perform light to moderately-heavy work tasks while expecting smooth performance,” said Digital Trends’ review of the slate.\niPad Pro (10.5-inch) and iPad Pro (12.9-inch 2nd generation) — 2017\nThe same year, Apple made a minor revision to the iPad Pro, lifting the screen size up from 9.7 inches to 10.5 inches. This one made its debut alongside the second-generation iPad Pro with a 12.9-inch panel. The rest of the package was more or less identical across the board.\nThe two tablets introduced the ProMotion tech for the Retina display, which enhanced the screen refresh rate to 120Hz for improved fluidity, while the Apple Pencil was also treated to reduced input latency.\nPowering the two tablets was the A10X Fusion processor, featuring six CPU cores and a dozen GPU cores. It also came equipped with a beefy OIS-enabled 12-megapixel rear camera. On the software side, these two benefited from the new Files app, a Dock with customizability, and improved multitasking.\niPad (6th generation) – 2018\nCarrying forward the momentum it built with the baseline iPad, Apple released the sixth-generation variant a year later. This time around, the asking price remained identical, but the company finally enabled Apple Pencil support for its most affordable tablet.\nOn the outside, nothing had changed. Under the hood, Apple upgraded it to the A10 Fusion processor with an embedded M10 coprocessor. The most notable update, surprisingly, proved to be the iOS 11 software and how well it was optimized for the tablet.\n“The best tablet is the iPad. Period. For $330, it can handle a variety of tasks you throw at it, has a good-looking display, and best of all works with the fantastic Pencil. It continues to be the everyman’s tablet,” concluded Digital Trends’ analysis of the iPad.\niPad Pro (11-inch) and iPad Pro (12.9-inch, 3rd generation) — 2018\nApple’s tablet team shifted gears once again in 2018 when it introduced new “Pro” tablets with a fresh design. The Touch ID button was gone, and so were the thick bezels. The new iPad Pro design embraced symmetrically thin bezels, Face ID replaced the fingerprint sensor, and the storage capacity reached 1TB.\nThe new 11-inch and 12.9-inch flagship Apple tablets also shifted away from the Lightning connector, embraced the USB-C standard, and enabled Gigabit-tier cellular connectivity. The slates came equipped with the mighty A12X Bionic chip, packing a total of eight CPU cores in two clusters, offering a 90% gain in performance.\nThe new USB 3.1 Gen 2 port allowed driving up to a 5K display, while iOS 12 put RAW image editing support and the Shortcuts app on the tablet. “The new iPads are expensive, yes, but there’s so much you can do with them that they are worthwhile investments,” pointed out Digital Trends’ review.\niPad Air (3rd generation), iPad mini (5th generation), and iPad (7th generation) – 2019\nIn 2019, Apple once again delivered a trifecta of tablets. In the first half of the year, the iPad Air and iPad mini arrived in the market. Both tablets came equipped with the A12 Bionic processor, Gigabit-class LTE, eSIM support, and upgraded cameras.\nApple Pencil support on the iPad mini was a big draw, even though both tablets offered a Retina display with the True Tone tech onboard. Just like their design, Apple also stuck with a familiar pricing strategy, hawking the iPad Air at a base price of $499, while the iPad mini went for $399.\nLater that year, Apple launched the seventh-generation entry-level iPad at an unchanged asking price of $329 in the US. This one came equipped with a slightly bigger 10.2-inch Retina Display that offered stylus support, the A10 support, and more importantly, the physical smart connector to pair with Apple’s keyboard case.\niPad Pro (11-inch and 13.9-inch), iPad (8th generation), and iPad Air (4th generation) – 2020\nThe year 2020 was a massive leap for the iPad family. Apple kicked off the launch spree with the iPad Pro. This one upgraded to a dual rear camera design with a new LiDAR sensor, the A12Z Bionic chip, trackpad support in iPadOS for the first time, and a new magnetic levitating keyboard.\nApple followed it up with a modest update for the eighth-generation iPad, while keeping the price locked to $329, once again.. The baseline tablet didn’t get any aesthetic overhaul, but Apple equipped it with a powerful A12 Bionic silicon that brought a Neural Engine to the entry-level iPad for the first time.\nA month later, Apple introduced the flashy new iPad. Featuring a clean monolithic design inspired by the iPad Pro, the new tablet also embraced some peppy new colors, a first for Apple in a long time. To go with the massive overhaul, Apple also armed it with the A14 Bionic, its most advanced chip at the time, and a Touch ID sensor integrated withing the power button.\niPad Pro (11-inch and 13-inch), iPad (9th generation), and iPad mini (6th generation) – 2021\nApple’s hot tablet streak continued well into 2021. This time, the company decided to put a desktop-class processor, the M1 silicon, inside the iPad Pro. Support for 5G connectivity was another big draw, alongside a new Liquid Retina XDR display with mini-LED tech and Center Stage support for the front camera.\nIn the Fall season, Apple delivered yet another surprise with a redesigned iPad mini, which embraced the same design language as the iPad Air. It also served a bigger 8.3-inch Liquid Retina display, a faster A15 Bionic silicon, 5G support, and switched to a USB-C port, as well.\nAlongside its pocket-sized tablet, Apple also launched the ninth-generation iPad. This one was mostly an iterative upgrade, featuring the A13 Bionic chip while keeping the rest of the package unchanged. The most notable change? Doubling the base storage to 64GB while the price remained unchanged.\niPad Air (5th generation), iPad (10th generation), and iPad Pro (11-inch and 12.9-inch) – 2022\nThe year 2022 marked another major shift for Apple’s tablet lineup. The iPad Air kicked off the upgrade cycle by shifting from A-series mobile processors to the desktop-tier M1 chip. Apple didn’t change the price, but still treated the tablet to an improved front camera with Center Stage support, 5G compatibility, and a faster USB-C port.\nLater in the year, the entry-level iPad got its first major design overhaul in a long time. Apple treated it to the same all-metal unibody look as the iPad Air and mini, and jazzed things up by adding vibrant colors into the mix. It also shifted to a USB-C port, the A14 Bionic chip, a 12-megapixel front camera, 5G support, and a higher asking price of $449.\nTagging alongside the vanilla iPad was the next-gen iPad Pro. The 2022 version was a rather modest upgrade. The major change was the new M2 processor, while on the software side, Stage Manager was the marquee addition with full external display and hover gesture for the Apple Pencil.\niPad Air (11-inch and 13-inch), iPad Pro (11-inch and 13-inch), and iPad mini (7th generation) – 2024\nApple shuffled things around in its tablet department once again in 2024. In addition to the usual 11-inch size format of the iPad Air, the company also launched a new 13-inch variant of its mid-tier tablet. Powered by the M2 processor, the tablets also shifted the front camera to portrait mode, came adorned in new shades, and also got their magnetic keyboard across both sizes.\nThe bigger surprise, however, was the 2024 iPad Pro refresh. This one introduced a brand new design language with the slimmest tablet chassis ever, and a new M4 processor to go with it. The OLED display was another crucial upgrade, and so was the metallic Magic Keyboard and the Apple Pencil Pro.\nLater in the year, Apple introduced the seventh-generation iPad mini. The latest compact tablet from Apple didn’t change anything on the outside, but on the inside, it moved to the A17 Pro processor that allowed it to run the full Apple Intelligence experience. The tablet also landed support for the Apple Pencil Pro and a couple of new color options, as well.\niPad (11th generation) and iPad Air (11-inch and 13-inch) – 2025\nIn 2025, Apple didn’t serve any major surprises. The new entry-point iPad kept the same chassis for another year. On the positive side, Apple once again doubled the base storage capacity, landing at 128GB, without increasing the price. The tablet also got its customary year-on-year chip upgrade and kept its vibrant color palette, as well.\nSimultaneously, Apple also launched the refreshed iPad Air in the familiar 11-inch and 13-inch form factors. The new mid-point tablets switched to the M3 processor, landed support for Apple’s advanced graphics architecture, and got a custom Magic Keyboard, as well.\nWhat’s next?\nGiven Apple’s history and the leaks situation, there are no major surprises planned for the iPad portfolio in 2025. The iPad Pro will reportedly be getting an M5 silicon refresh and a dual front camera design, with one sensor placed alongside the horizontal and vertical edges.\nOn the software side, iPadOS 26 has given a macOS-inspired design makeover to the iPad’s software by introducing the menu bar, a whole new app multitasking interface, and improved tiling controls. Additionally, the Preview and Phone apps have also landed on Apple’s tablets, alongside an improved Files app."
    },
    {
      "url": "https://www.digitaltrends.com/tablets/redmagic-nova-review/",
      "text": "- Solid build and standout looks\n- Blazing fast performance\n- Incredible charge speeds\n- Thermal hardware is impressive\n- An impressive set of gaming features\n- Strong haptic feedback\n- UI design is a bit tacky\n- Color and glare issues with the screen\n- Runs hot, especially on the glass strip\n“Why you can trust Digital Trends – We have a 20-year history of testing, reviewing, and rating products, services and apps to help you make a sound buying decision. Find out more about how we test and score products.“\nI recently had a brief experience with Samsung’s latest tablet. Starting at a cool $1,000, the first sentiment that the Galaxy Tab S10+ elicited from me was “Meh.” It isn’t exactly a sloth, but it lacks oomph. For that price, you can buy the M4-powered iPad Pro, a much better deal for multiple reasons.\nSo, are Android tablets doomed? No, and the RedMagic Nova is a prime example of that. It costs half of what the big boys out there ask for their high-end tablets, and yet, the Nova still serves a specially-tuned version of Qualcomm’s yesteryear flagship silicon. It’s the fastest tablet I’ve ever used, and paired with great battery life, excellent gaming features, and a killer price, it may just be one of 2024’s best tablet choices.\nRedMagic Nova specs\n| Thickness | 7.3mm |\n| Weight | 530 grams |\n| Screen size and resolution | 10.9 inches 2.8K (2880 x 1800 pixels) 144Hz refresh rate 550 nits brightness 840Hz Instant Touch Sampling Rate 16:10 aspect ratio |\n| Operating system | Android 14, REDMAGIC OS 9.5 |\n| Storage | 256GB / 512GB |\n| Processor | Qualcomm Snapdragon 8 Gen 3 Leading Version |\n| RAM | 12GB / 16GB |\n| Cameras | 50MP rear, 20MP front |\n| Battery | 10,100mAh 80W fast wired charging |\n| Colors | Midnight |\n| Thermals | 17173.4mm High-Speed Turbine Centrifugal Fan Fan Speed: 20,000 RPM 9-Layer Cooling 29,400 mm² Large Area Under-Screen Aerospace Aluminum 9,268 mm² Large Area Mainboard Superconducting Copper Foil 89.114 mm² Large Area Integrated Aerospace Aluminum Shell Thermal Conductivity: 6000 W/m·K 103mm x 9.3mm 3D Heat Pipe |\n| Connectivity | WI-Fi 802.11 a/b/g/n/ac/ax Bluetooth: BT 5.4 |\n| Price | $499 |\nYou’ve never seen a tablet quite like this\nThe RedMagic Nova tablet captivates your attention from the get-go. The surprises begin right from the unboxing experience. The company ships an 80W charging brick inside the retail package, and based on your location, you will get either the EU or NA version.\nIn a world where brands (cough, Samsung and Apple, cough) have the audacity of selling tablets that cost as much as $1,200 but still burden buyers with the added cost of spending on a charging brick, RedMagic is standing tall. To make matters better, the RedMagic Nova starts at just $499.\nBut that’s just the start, as the Nubia-owned brand isn’t pulling any punches in any core department. Let’s start with the chassis, which is made entirely out of aerospace-grade aluminum. The dark gray aluminum has an anodized finish, which feels really nice to touch.\nIt’s not nearly as slim as the M4 iPad Pro (7.3mm versus 5.3mm) and about 17% heavier, tipping the scales at 530 grams. The craftsmanship is really impressive here, especially when you factor in the asking price. There are no creaking parts, the cuts are sharp, and the subtle polish across the corners adds to the in-hand feel.\nThe thickness can also be attributed to the thermal hardware, including a real physical fan and a nine-layer cooling system. This whole contraption works, but more on that later in the performance section.\nOver the years, I’ve grown quite wary of sharp edges, especially on large and heavy tablets, but the trend remains a mainstay. It’s pretty refreshing to see a small player like RedMagic daring to deviate and then execute its vision well.\nThe craftsmanship is really impressive here, especially when you factor in the asking price.\nThe RedMagic Nova has subtly brushed edges angled at 45 degrees to offer a more cozy in-hand experience. At the top, the fingerprint sensor is integrated into the power button.\nThe standout element is the transparent strip running across the camera lens, offering a glimpse of the RedMagic Nova’s innards. This strip is not merely decorative, even though it looks stunning, in the same vein as the transparent aesthetics of the Nothing smartphones.\nThe top layer is made out of lens-grade aluminosilicate glass, which, so far, has managed to keep scuff marks at bay despite my rough usage patterns. Underneath the camera island is the fan cavity, lit by an RGB array that extends all the way to the RedMagic branding at the bottom.\nAlso, apart from RedMagic and Asus, you won’t find any mainstream brand that offers a tablet with all those snazzy light-up effects to sell the “gamer” vibes. So, there’s that RGB cred, as well.\nOverall, the RedMagic Nova will surprise you with its solid engineering and unmistakably bold design. That’s something I can’t say for tablets hawked by mainstream brands, and this in itself is quite a victory for an upstart like RedMagic.\nA quality display, with some catches\nThe Nova tablet offers a 10.9-inch display with a 2.8K (2880 x 1800 pixels) resolution, eclipsing the iPad Air and the Samsung Galaxy S10+ in pixel density and sharpness. The aspect ratio is your usual 16:10 format.\nIt’s an LCD panel that delivers a peak brightness of 550 nits, higher than that of the aforementioned Apple tablet. Where the RedMagic tablet races far ahead is the refresh rate figures, which stand at 144Hz.\nTo keep up with gamers’ quick reflex demands, the touch sampling rate has climbed to 840Hz. For comparison, the touch sampling rate of Asus’ ROG Phone 8 Pro only reaches 720Hz.\nThe screen is sharp, and thanks to the high refresh rate, every UI interaction feels snappy. Compared side by side, even the mighty M4 iPad Pro feels slightly slow. Or maybe the Apple tablet is normal, and the RedMagic Nova is naturally faster.\nIt’s the same kind of fluidity that I usually get on a phone or tablet after adjusting window animation, transition animation, and animator duration scales within the developer options. Or maybe it’s the lightweight software interface that is weaving its magic.\nThe display has a couple of oddities going on. To anyone who has experienced the deeper blacks of an OLED screen and the vibrant colors, the Nova’s screen will instantly stand out, but not in a good way.\nThe blacks are not, well, black, and the color science is also slightly off. The screen calibration here is pretty cold, and to such an extent that it takes a severe hit on the content color reproduction.\nTake, for example, this side-by-side comparison with the iPad mini. Notice the difference between the color output, especially the highlights and saturation levels. That’s interesting, as both the tablets use an LCD screen with similar peak brightness levels.\nThe display has a couple of oddities going on.\nThe chroma details are crushed aggressively in the shadow regions. Third-party apps and Netflix list the DRM support level at L1, with a catch. The DRM Info app mentions support for HDR and HLG, while the Netflix app clearly says “None” for HDR capabilities.\nAnother issue is glare. The screen is quite reflective, and it could have been a tad brighter to balance things out. However, you can still read content on it under daylight without too much squinting, though angle adjustments would be required from time to time.\nIndoors, this screen gets the job done for its intended task. A majority of mobile games out there, and even those accessible through emulation platforms, don’t usually offer a ton of settings to specifically draw the benefits of OLED or HDR compliance.\nTouch response rates are impressive. Of the nearly half a dozen gaming enthusiasts who tried the RedMagic Nova, they loved the motion clarity and silky smooth interactions. For shooter games like Call of Duty: Mobile, that combination can make a real difference.\nFeature-rich software package\nThe RedMagic Nova runs a mostly stock Android experience, and save for the utility apps, there isn’t much third-party jargon installed on the machine. There are a couple of clusters named Hot Apps and Hot Games, but these are merely pre-download shortcuts that can be easily removed.\nThe company has only done a minimal job with reskinning Android 14 and now calls it RedMagic OS. However, the OS offers many tools baked at the system level, in addition to theming material, light, and sound effects. You hear the vroom of a sports car when you launch the Game Space. And the fan also triggers its own engine sound. Call it dedication to the craft!\nOn the connectivity front, we have Z Smart Cast, a wireless lane for casting the tablet’s screen on a TV or monitor. The larger screen becomes the hub of activity, while the tablet’s screen can be turned into a touchpad or control point.\nIt’s a mix and match of Samsung’s DeX and the iPad’s own screen mirroring and extension systems. In wireless mode, there is some expected lag, so it’s not ideal for fast-paced gaming. Thankfully, you can also go with an HDMI or USB screen casting option.\nRemember that RedMagic isn’t chasing a full-fledged desktop environment for work, so it lacks the tools you would otherwise get with DeX. This is a gaming tablet, and in wired connection mode, it does its intended job without any hiccups.\nI hooked it up with my 24-inch gaming monitor and played my fair share of Diablo Immortal and emulated games such as God of War. The experience was fantastic, and I didn’t run into any issues with frame rate dissonance or random stutters.\nThe theming system offers a dedicated dashboard for the light strip at the back. You can enable it for games, media playback, notifications, and other activities. You can also pick the colors and effects to set the whole mood for each activity.\nSimilar to Samsung and OnePlus devices, a hidden floating sidebar offers quick access to utility tools and frequently used apps. Additionally, a quick ball system inspired by iPhones combines navigation and a few other system tools into a neat little cluster.\nMoving over to the notifications shade, the RedMagic Nova offers a handful of quick access buttons for casting, fan control, and light strip switch, in addition to the usual set of shortcuts.\nThe star of the show is the Game Space. It’s a neat little game launcher, but this is also where you see the work RedMagic has done for its gaming audience. At the top is RedMagic Time, a unified dashboard to access all your in-game capture files, neatly arranged in a slide format for each game.\nRedMagic has done a commendable job with the software.\nIn the Settings section, you can separately control the CPU and GPU performance profiles, adjust fan and recording behavior, and customize screen attributes such as touch sampling rate, sensitivity, and stabilization, among others.\nWithin the Game Space, you can customize keyboard/mouse and controller interactions for each game, both of which are accessible right by the start button. Casting controls are also available in the same draw-out menu bundle for seamless launch.\nSwitching away from the game Game Lobby, there’s Super Base. Here, you get access to Gravity X, where you can create and save presets for physical input devices. The mapping controls are also accessible within a game by swiping to access the game assistant.\nFinally, there’s the plug-in library, where you can play with over a dozen custom tools that can give you an edge in games. For example, there is somatosensory manipulation, which lets you flick the tablet in your hands to execute an on-screen click. For games with crowded on-screen buttons, this one comes in handy.\nIn shooter games, you can enable the Audio and Visual Probes, which offer a guided highlight of the action far away, by circling the audio and motion activity. You don’t necessarily have to whip out the scope to find the action.\nThere’s a dedicated sound equalizer, plus a Free Display plug-in that lets you adjust a game’s aspect ratio. What I loved the most was the easy key remapping system, which saved me the hassle of dealing with dedicated controller apps.\nOverall, RedMagic has done a commendable job with the software, which is clean and loaded with meaningful gaming-first features. I wish the desktop casting mode offered a few more tricks, but that’s not why someone is buying a tablet like the Nova, so the omission makes sense.\nFast and hot performance\nUnhinged silicon throughput is what you buy the RedMagic Nova for, and it does deliver on that front. You can pick between variants with 12GB and 16GB RAM and up to 512GB storage. The keyboard and stylus are sold separately.\nLeading the charge here is the Qualcomm Snapdragon 8 Gen 3 Leading Version. Compared to the regular version, this special silicon is an overclocked trim that speeds up the GPU to 1GHz, while the prime Cortex X4 CPU core touches a peak frequency of 3.4 GHz.\nThe best part is that you can tap into all that firepower — if you are willing to bear the heat tax. The tablet offers three performance profiles by default: Rise, Eco, and Balance.\nBut there’s a hidden Diablo mode, too. Compared to Rise mode (the top system-level performance preset), Diablo mode takes the GPU frequency from 500MHz to 1GHz, while the CPU speed goes from 2.3GHz to 3.4GHz.\nStarting with AnTuTu benchmarks, the RedMagic Nova topped the GPU leaderboard with 876,442 points, eclipsing the MediaTek Dimensity 9300+ and other Snapdragon 8 Gen 3 devices.\nThe overall score of over 2 million points put it ahead of mainstream options such as the Samsung Galaxy S24 Ultra, and it only lags behind a few other gaming-centric phones with the Snapdragon 8 Gen 3 silicon.\nHowever, it still can’t quite catch up with the M4 silicon inside the iPad Pro. The Apple tablet had a lead of around 21%, while the GPU tally was also ahead by a similar margin. Running the 3DMark Wildlife Extreme Stress test, the Nova raced past the Asus ROG Phone 8 Pro and sat at the top of the list. However, something really interesting happened here.\nThe net tally was higher, and the stability was lower when running the test in standard mode, but when overclocked in Diablo preset, the overall score fell slightly. Still, the stability went from 27.7% to 86%, which is intriguing.\nThat’s a massive leap, though it comes at a cost. When the CPU and GPU are running at their peak frequencies, the frame rate fluctuation is minimal and pretty uniform.\nEven after 20 successive loops, the performance stability only drops by around 8%. In Rise mode, after the 17th loop, the tally takes a sharp plunge, and you land at nearly one-third of the maximum system output.\nSo, how do the fans fit into the picture? Well, within five minutes of enabling the fan, the battery temperature dropped from 44 degrees to 36 degrees Celsius. But in overclock mode, things get toasty pretty quickly.\nAfter a stress test, I measured the external temperature at 48 degrees and the battery temperature at 46 degrees. The glass strip runs really hot, and on one occasion, it reached 51 degrees.\nBut those figures were recorded after running the full suite of tests in GFXBench. While playing games like Zenless Zone Zero or Call of Duty: Warzone, the average temperatures didn’t climb above 42 degrees range.\nRealistically, you will feel the warmth.\nRealistically, you will feel the warmth, but not enough to ditch the tablet. Plus, the cooldown effect is the quickest I have seen on a performance-oriented tablet, so there’s that.\nSynthetic benchmarks are only one side of the equation. At gaming, the RedMagic Nova crushes it. I cherry-picked the most demanding titles out there, and every single one of them performed admirably.\nFor titles that can touch 60 fps, the average range always hovered between the 56-60 fps mark. Running emulators, you can easily get between 30-45 fps, at least for the PlayStation 2. Winlator, which is super cranky with the setup, also delivers a playable experience of AAA titles.\nIf you’re primarily concerned with mobile titles, like native Android or emulation for PlayStation Portable (via PPSSPP) and retro platforms, the RedMagic Nova will offer an enjoyable experience.\nI mostly stuck with 6x-10x upscaling and had a good time with PSP games running on the Vulkan graphics backend. That’s nearly 4K resolution equivalent, for reference. With the Dolphin emulator, 4x is the sweet spot running atop the OpenGL framework for Nintendo titles.\nThe experience translates well on a large screen using Z Smart Cast in wired mode, with controller and keyboard inputs. Feral’s Alien Isolation game, a fairly demanding title, worked well in a steady 60 fps ballpark.\nFor cooling the whole kit, the RedMagic Nova comes armed with a nine-layer cooling system, which, aside from a 20,000 RPM fan, also includes a heat pipe, air duct, copper foil, insulation sheet, thermal gel, and an alloy array underneath the screen.\nThe whole system rises to the occasion, more so at post-usage cooldown instead of keeping things consistently cool under stress. Overall, if you are after an Android tablet for gaming and emulation, the RedMagic Nova is easily the best deal out there.\nGood battery life, better charging\nThe RedMagic Nova comes equipped with a dual-cell 10,100mAh battery, which is good for a tablet of its footprint. But what sets it apart is the charging speed, which makes sense given the kind of utility you seek out of it.\nThis slate supports 80W fast charging. The only tablet that comes close to that figure is the OnePlus Pad 2, at 67W, while Samsung and Apple only reach close to the halfway mark.\nI could get a 100% top-up from a blank slate in about 1 hour and 7 minutes. For a quick run, you can reliably go from an empty tank to about 40% level in roughly 20 minutes. For this tablet, it’s more of a necessity than a perk.\nDepending on the kind of game and what levels of graphics output you are expecting, the battery levels drop rather haphazardly. Take, for example, the mobile version of PUBG, which can eat up to 12%-15% in just about 30 minutes at peak frame rate and visual settings.\nIn Diablo Immortal, the drop was slightly lower at around 10%-11%. Now, those figures will vary dramatically. For example, most games play nearly as well in Balanced mode as they do in the overclocked Diablo mode, but the battery uptake varies by a healthy margin.\nConversely, you may not necessarily see the kind of fps gains you are expecting by doubling the GPU frequency and increasing the CPU clock speed to its maximum limit. The situation with the Nova is rather unique in more ways than one.\nCompared to Android native games, emulated games take a heavier toll on the battery. But even while sticking with Android games, it depends entirely on the game’s visual architecture on just how much battery it will suck up per session.\nWhile playing PUBG Mobile, Diablo Mode consumed 13% of battery at the best graphics presets in 30 minutes, while Rise Mode used only 10% with smooth graphics and delivered a fairly good 60fps experience.\nInterestingly, if you take things up a notch to 90 fps, the battery draw is equal across the Rise and Diablo system profiles. If you plan to primarily engage in gaming, you can expect anywhere between three and five hours of battery life.\nFor days where you only seek casual gaming for short spells, the tablet can last a whole day, but try to tone down the screen refresh rate and brightness levels to achieve that.\nThere are a couple of cool charging features in the context of heating. The first one is Turbo mode, which increases the pace of charging but at the cost of the battery running hotter than usual.\nThen, there is charge separation. This one cuts off access to the battery when a charger is plugged. The entire system is driven entirely by the power delivered through the USB-C port, which means the battery doesn’t heat up. This mode is ideal for long gaming sessions and should also bode well for battery health in the long run.\nShould you buy the RedMagic Nova?\nThe RedMagic Nova is quite an easy recommendation, primarily because it’s the only product of its kind in the segment. For just $499, you can tap into the full potential of a top-tier Qualcomm silicon, which is half the competition’s current ask for such a facility.\nThe build is great, and gaming enthusiasts will appreciate a healthy bunch of innovative features. It acts more like a mobile gaming console if you also have a larger screen at your disposal and love emulation gaming.\nThe RedMagic Nova is quite an easy recommendation.\nThe RedMagic Nova is also the fastest-charging tablet, and the heat dissipation kit is reliable. The UI is also clean. The only downsides are crushed color output on the screen, garish software design, and heat generation courtesy of its performance profiles.\nOverall, the RedMagic Nova ticks off more boxes than almost any slate in its price bracket, and it does so in style. For its target audience, it delivers on the aspects where it matters, and that’s a win at the end of the day."
    },
    {
      "url": "https://www.digitaltrends.com/tablets/asus-rog-flow-z13-2025-review/",
      "text": "- Solid build quality\n- Cohesive gaming aesthetic\n- Excellent productivity and creative performance\n- Solid tablet gaming performance\n- Outstanding IPS display\n- Very good keyboard\n- Expensive\n- Slightly thick and heavy\n- Gaming performance not an upgrade\n“Why you can trust Digital Trends – We have a 20-year history of testing, reviewing, and rating products, services and apps to help you make a sound buying decision. Find out more about how we test and score products.“\nAsus makes the most powerful gaming tablet around — perhaps, the only hardcore gaming tablet you can buy. It’s a completely different animal from most detachable tablet 2-in-1 laptops, which tend to be focused on productivity work and media consumption. As I discovered with the 2024 Flow Z13, this tablet is aimed at running modern titles at playable frame rates.\nThe thing is, while the CPU got a significant upgrade, the GPU options are now limited to just one, the integrated AMD Radeon 8060S graphics compared to the highest-end option of the Nvidia GeForce RTX 4060. In my testing, that makes the Flow Z13 a faster machine for everything but gaming, which is at best a step sideways in performance.\nSpecs and configurations\n| Asus ROG Flow Z13 | |\n| Dimensions | 11.81 x 8.03 x 0.59 inches (tablet only) |\n| Weight | 2.65 pounds (tablet only) 0.85 pounds (keyboard) 3.50 pounds (tablet + keyboard) |\n| Processor | AMD Ryzen AI MAX 390 AMD Ryzen AI MAX+ 395 |\n| Graphics | Radeon 8060S graphics |\n| RAM | 32GB LPDDR5X-8000 64GB LPDDR5X-8000 128GB LPDDR5X-8000 |\n| Display | 13.4-inch 16:10 QHD+ (2560 x 1600), 180Hz |\n| Storage | 1TB PCIe SSD |\n| Touch | Yes |\n| Ports | 2 x USB4 1 x USB-A 3.2 Gen 2 1 x HDMI 2.1 1 x 3.5mm audio 1 x microSD card reader |\n| Wireless | Wi-Fi 7 and Bluetooth 5.4 |\n| Webcam | 5MP front-facing camera with IR 13MP rear-facing |\n| Operating system | Windows 11 |\n| Battery | 70 watt-hour |\n| Price |\nThere are three versions of the 2025 ROG Flow Z13 currently listed on the Asus web store. The base model is $2,100, coming with an AMD Ryzen AI MAX 390 chipset, 32GB of RAM, a 1TB SSD, and a 13.4-inch QHD+ IPS display (the only option). Upgrading to a Ryzen AI MAX+ 395 chipset adds $200 to the price, and the high-end configuration with a whopping 128GB of RAM costs $2,800.\nThat’s expensive, especially compared to the Microsoft Surface Pro 11 that starts at $1,000. But, you’re getting a ton of performance that other tablets simply cannot match.\nDesign\nIf you’re looking for a tablet because you want a thin and light device that you can easily take on the road for productivity work, then the ROG Flow Z13 isn’t the best choice. It’s considerably thicker at 0.59 inches and heavier at 2.65 inches than the leading Windows tablet, Microsoft’s Surface Pro 11 that’s 0.37 inches thick and weighs just 1.97 points. Add in the detachable keyboard, which is heavier in the newest model, and you’ll definitely feel like you’re carrying something around. Of course, if you’re looking for a gaming machine, then it’s quite light and highly portable. And of course, that’s exactly what this is supposed to be.\nAesthetically, this is an ROG gaming laptop through and through. It’s an all-black slate, with bold lines and aggressive venting along the top that’s obviously functional — a lot hot hot air escapes in the direction. In back, you’ll find a bunch of ROG design cues, along with a very Surface Pro-like fold-out kickstand that works great and has a notch cut out to reveal the most gaming touch Asus built into the ROG Flow Z13. Specifically, that’s a window cutout revealing an RGB-lit view into some of the guts inside. The lighting is controllable and you won’t see the effect when you’re using the tablet — but your lan party friends will see it.\nIt’s built solidly enough, as well as all other premium laptops I’ve used, using high-density aluminum that receives two anodizing coats and has a soft-touch anti-fingerprint finish. It’s sealed up tight, which is a departure from larger gaming laptops that often some offer upgradable components.\nKeyboard and touchpad\nThe detachable keyboard has been upgraded a bit, with larger keycaps, and it features single-zone RGB lighting that’s customizable using the ROG Armory Crate app. The layout is fine, with separate arrow keys, and the switches are deep and responsive. It should please most gamers who don’t want to carry a mechanical keyboard around with them. The keyboard props up at a comfortable angle, as with the Surface Pro 11 Type Cover, and that gives it the same kind of slight bounce when you’re mashing keys.\nThe touchpad is also a little larger in this version, and it’s large enough to be comfortable — which is sometimes unusual with detachable keyboards. It’s a good-enough mechanical version with slightly loud and harsh button clicks. The display is touch- and pen-enabled, and the pen is a $50 option.\nWebcam and connectivity\nThere are two cameras, a front-facing 5MP version with an infrared camera for Windows 11 Hello facial recognition, and a 13MP rear-facing camera for taking pictures and video. Both have decent images. The AMD Ryzen AI Max+ chipset has a very fast Neural Processing Unit (NPU) running at 50 tera operations per second (TOPS), exceeding the Microsoft Copilot+ PC requirement of 40 TOPS for on-device AI processing. That gives you plenty of headroom for using today’s AI features and heading into the future.\nConnectivity is changed up this time around. The last version used an Intel chipset and so had Thunderbolt 4. This generation is AMD, and so it’s USB4. That’s just as fast. There’s also an HDMI 2.1 port this time, to go with the USB-A port and 3.5mm audio port. The microSD card reader is welcome.\nThe larger change is that Asus has dropped the ROG XG Mobile proprietary interface, with the new ROG XG Mobile that connects via Thunderbolt 5. Here, you’d use a USB4 port instead. The XG Mobile is an external GPU enclosure that packs an Nvidia GeForce RTX 5090 laptop GPU inside. That’s the accessory that enables the ROG Flow Z13 to be a pretty fast portable gaming tablet and an incredibly fast desktop gaming machine. The 2025 XG Mobile is smaller and lighter than the previous model, which was a pretty hefty unit. I don’t have pricing for the accessory, but it will likely be upwards of $2,000, so it will be attractive to the most hardcore gamers.\nThermals\nWith a very high-performance AMD Ryzen AI MAX 390 or MAX+ 395 chipset inside, both of which run at a default TDP of 55 watts and can run at up to 120 watts, there’s a need for a serious thermal solution. That’s what Asus built, taking advantage of the slate format — no hinges to work around — to build in larger fans and a wider vapor chamber. And, air flow is better than with traditional laptops, given that the unit stands upright and so can suck an and expel a lot of air a lot more easily. The 2025 model incorporates a new airflow channel to keep the display cooler, an issue I noticed at times using the previous generation.\nThe vapor chamber is constructed of a mix of stainless steel and copper to reduce weight while still boosting cooling. The stainless steel portion serves as a heat sink, while the copper portion conducts heat away from the internal components. The ROG Flow Z13 uses second-generation Arc Flow fans that are incredibly thin and pack in 71 blade for improve performance without generating additional noise.\nIn use, the fans spun up but weren’t as loud and harsh as with many other gaming laptops I’ve used. 2025 ROG Flow Z13 certainly seems quieter than the previous model I reviewed.\nPerformance\nThere’s a choice between the Ryzen AI MAX 390 and MAX+ 395 chipsets. The former has 12 CPU cores and 24 threads and runs at up to 5 GHz, while the latter has 16 CPU cores and 32 threads and runs slightly faster an 5.1 GHz. I reviewed with the Ryzen AI MAX+ 395. As we’ll see, it’s a very fast chipset that churns through CPU-intensive tasks.\nLooking at the 2025 model versus its predecessor, the AMD chipset provides a distinct advantage for highly demanding productivity tasks. It’s faster in both single-core and multi-core tasks, and it’s one of the few laptops that even pretends to compete with the MacBook Pro 16 with the new M4 Max chipset. In fact, it actually beat the MacBook Pro 16 in our Handbrake test that encodes a 420MB video to H.265.\nUnlike its predecessor, the 2025 ROG Flow Z13 uses AMD integrated graphics, specifically the Radeon 8060S. The AI MAX 390 has 32 GPU cores, while the MAX+ 395 has 40 GPU cores. In our benchmarks, the AMD graphics perform most like an Nvidia GeForce RTX 4060 discrete GPU, which is what was offered in the previous ROG Flow Z13 generation. We’ll talk more about that in the gaming section below.\nUnfortunately, the ROG Flow Z13 wouldn’t complete the Pugetbench Premiere Pro benchmark that we use to rate a laptop’s performance with intensive video editing and encoding tasks. I suspect that the 2025 model would perform similarly to the previous model, which would make it a fast enough solution for moderately demanding video editors. I spent a few hours trying to get the benchmark to run, and I believe it was an issue with the benchmark and not the laptop.\nRegardless, this is by far the fasted tablet around for anyone who wants to get work done on the road. And paired with the XG Mobile and the RTX 5090, and it will be one of the faster stationary system for video editing as well. That I can guarantee.\n| Geekbench 6 (single/multi) |\nHandbrake (seconds) |\nCinebench R24 (single/multi/GPU) |\n|\n| Asus ROG Flow Z13 (Ryzen AI MAX+ 395 / Radeon 8060S) |\n2,993 / 20,659 | 36 | 121 / 1,568 / NA |\n| Asus ROG Flow Z13 (Core i9-13900H / RTX 4060) |\n1,873 / 13,175 | 71 | 117 / 916 / 8,873 |\n| Microsoft Surface Pro 11 (Snapdragon X Elite / Adreno) |\n1,170 / 6,518 | N/A | 124 / 841 / NA |\n| Dell XPS 14 (Core Ultra 7 165H / RTX 4050) |\n2,344 / 12,818 | Bal: 84 | 101 / 681 / 5,738 |\n| Apple MacBook Pro 16 (M4 Max 16/40) |\n3,600 / 25,332 | 48 | 179 / 2,072 / 16,463 |\n| HP Omen Transcend 14 (Core Ultra 7 155H / RTX 4060) |\nN/A | N/A | 101 / 907 / 8,962 |\n| Alienware m16 R2 (Core Ultra 7 155H / RTX 4070) |\n2,366 / 12,707 | N/A | 103 / 1,040 / 10,884 |\n| Asus ROG Strix 18 (Core i9-14900HX / RTX 4090) |\n2,946 / 17,622 | N/A | Bal: 124 / 1,533 / 22,067 |\nGaming\nWhile the 2025 ROG Flow Z13 is a significant uptick in performance for everything but gaming, the question becomes: how is it as a gaming laptop? In short, the integrated Radeon 8060S graphics are close to the same performance as the RTX 3060, meaning the 2025 model is a sideways step and certainly not an advance.\nThe display runs at a faster 180Hz, compare to the previous generation’s 165Hz and it now supports AMD’s FreeSync technology, so if you connect the XG Mobile with the RTX 5090, you’ll have a better chance at tear-free gaming. By itself, the tablet’s refresh rate vastly exceeds its performance capabilities.\nStarting with 3DMark’s Time Spy test, the ROG Flow Z13 scored 10,352, compared to the 2024 model’s 12,159. That’s a 17% drop, which isn’t great. However, the Asus ROG Zephyrus G16 with an AMD Ryzen AI HX 370 and an RTX 4070 scored just 10,743, while the Acer Swift X 14 with a Core Ultra 7 155H and an RTX 4070 scored 9,545. By this synthetic benchmark, the 2025 ROG Flow Z13 is a very good performer, even if it drops off a bit from the previous generation that was clearly impressive.\nSwitch to some real-life gaming benchmarks, we’ll start with Assassin’s Creed Valhalla. In 1200p and ultra high graphics mode, the 2025 ROG Flow Z13 hit 86 frames per second (FPS), compared to the 2024 model’s 117 FPS, another drop off. The Asus ROG Strix G17 with an AMD Ryzen 9 7845HX and RTX 4060 hit 102 FPS, and the HP Omen 16 with a Ryzen 9 7940HS and RTX 4070 managed 103 FPS. This wasn’t a strong title for the 2025 ROG Flow Z13.\nIn Red Dead Redemption 2 at 1200p and Ultra graphics, the 2025 ROG Flow Z13 ran at 96 FPS, compared to the 2024 model at 78 FPS. The ROG Strix G17 hit 78 FPS. That makes the newest tablet quite a bit stronger. And in Cyberpunk 2077 at 1200p and ultra graphics with FSR 2.1 on auto, the 2025 ROG Flow Z13 hit 67 FPS, compared to the previous generation’s 88 FPS.\nSo, ultimately, the 2025 ROG Flow Z13 is around the same speed as the 2024 model, and depending on the title might be a bit faster or a bit slower. It’s a very competent 1200p gaming tablet across the board, able to sustain 60 FPS or better in most modern games, and it will play older or less demanding titles at 1440p.\nBattery life\nWith such powerful components inside and a high-resolution, high-refresh rate display, you shouldn’t really expect great battery life. There’s a 70 watt-hour battery inside, which is considerably larger than the 56 watt-hour version of the previous generation, but seriously. You’ll really want to take the very large power brick along with you if you plan to be away from your office for any significant period of time.\nI saw just 7.5 hours of video looping and less than an hour of running through out demanding Cinebench R24 test. That’s slightly more than the previous generation, but not enough to change my mind. It’s another area where this is definitely a gaming tablet and not a productivity tablet, given that the Microsoft Surface Pro 11 lasts for more than twice as long in the same tasks.\nDisplay and audio\nThe 2025 ROG Flow Z13 has a 13.4-inch 16:10 QHD+ (2560 x 1400) IPS display running at 180Hz. That makes it fast enough to avoid tear-free gaming, and high-resolution enough to support 144op gaming and make for a great work machine. And the image was bright and colorful during my testing.\nWhen I used my colorimeter to evaluate the display, I was pleasantly surprised. First, it’s incredibly bright at 533 nits, one of the brighter displays we’ve tested and rivaling the Apple MacBook Pro 16 mini-LED panel. It’s way above our threshold of 300 nits, and means you’ll enjoy an incredibly bright gaming experience. Contrast was also very good for IPS at 1,270:1, beating our 1,000:1 benchmark. It doesn’t have the inky brightness of OLED and its HDR performance won’t be as good, but it’s still excellent. Colors were unusually wide for IPS, coming in at 100% sRGB, 90% AdobeRGB, and 97% DCI-P3, well above the IPS averages of 100%, 75%, and 75%, respectively. And the color accuracy was excellent at a DeltaE of 0.97 (less than 1.0 is as good as it gets).\nThis is a great display for every user. Gamers, productivity users, creators, and media consumers will all find something to like.\nAudio is provided by two side-firing speakers, and it’s fine. You’ll want some headphones or an external speaker when gaming or streaming.\nA step sideways, but still the best gaming tablet\nYes, the 2025 ROG Flow Z13 doesn’t take a huge step forward in terms of gaming performance. Perhaps Asus will optimize the drivers and the Radeon graphics will get faster, but for now, you’re not going to see better gaming than the 2024 model.\nBut that’s okay, because the portable gaming performance is still the best you’ll find in a tablet. And the ability to add a crazy-fast RTX 5090 when you’re stationary is an intriguing — if expensive — option for hardcore gamers. And if you want a tablet that will churn through demanding productivity and creative tasks, then the ROG Flow Z13 has you covered there, as well."
    },
    {
      "url": "https://intl.redmagic.gg/pages/redmagic-astra-gaming-tablet",
      "text": "Back-to-School Sale: Up to $100 Off + Free Gift by September 3. Shop Now >\nBack-to-School Sale: Up to $100 Off + Free Gift by September 3. Shop Now >\nBalance performance and portability with a compact, premium transparent metal body and a flat 9.06-inch design paired with comfortable rounded corners, dynamic RGB lighting, standard USB 3.2 Gen 2, and our Magic Key feature.\nPowered by the most advanced Snapdragon chipset in any Android tablet, the Snapdragon 8 Elite takes mobile gaming and multitasking to new heights. Together with RedCore R3 Pro, it delivers smooth, intelligent performance whenever you need it.\n45% Boost CPU Performance\n44% Improved Power Efficiency\n3nmProcess Node\nUp to 4.32GHz CPU Speeds\nEquipped with up to 24GB of LPDDR5T RAM and up to 1TB of UFS 4.1 Pro storage, you can now enjoy more memory and speed than most laptops.\nLPDDR5T9,600Mbps\nUFS 4.1 ProPerformance Improved by 36%\nStay ahead with elite power, graphics, and endurance—delivering CODM performance that leaves other tablets in the dust.\n144.6 FPS vs 120 FPS\n40.1 °C vs 41.5°C\n6.67 Hours vs 5.26 Hours\nExperience stunning detail with our high-resolution OLED display, richer colors, deeper blacks, and lightning-fast response that leave LCD rivals behind.\nStay steady on the road to victory with our impressive 165Hz refresh rate. A 16:10 aspect ratio and 90.1% screen-to-body ratio ensure an incredibly immersive visual experience through every level.\nEnjoy your favorite games that are now optimized for high refresh rate gameplay.\nand more to be added soon!\nGame with ease using certified eye comfort from SGS that stays in low blue light mode to prevent eye fatigue and strain during longer gaming sessions.\nDisplay\nRefresh Rate\nResolution\nPeak Brightness\nAspect Ratio\nScreen-to-Body Ratio\nWide Color Gamut\nCertified by SGS\nThe enhanced 13-layer ICE-X cooling system combines Liquid Metal 2.0, dual-layer sandwich vapor chambers, and a high-speed turbofan. It reduces core temperatures by up to 8°C and improving cooling efficiency by 28%.\nAs the largest battery for a tablet of this size, our 8,200mAh capacity will keep you on a winning streak for longer - delivering up to 33 hours of movie playback.\nGenshin Impact Gameplay\nPUBG Gameplay\nContinuous Movie Playback\nBoss Level Gameplay\nCapable of running AAA games with ease, even while activating multiple plugins to enhance your skills. You can also use Frame Rate Boost to upscale various games to 2K resolution at 120 FPS for superior image quality. For an even bigger experience, cast your gameplay to a larger screen and seamlessly connect console controllers, keyboards, mice, and more.\nDynamic and Versatile\nStay ahead of the curve with a tablet built to adapt to your needs. Whether you're streaming, editing videos, or making video calls, you'll enjoy seamless multitasking!\nA Sound Spectacle\nHear the sound of victory clearly with symmetrical, dual 1620 high-fidelity speakers certified by DTS:X Ultra for immersive surround audio.\nCatch the Vibe\nFeel every moment with dual X-axis linear motors for 4D vibration feedback while dynamic rear RGB lighting syncs with every sound for an experience like no other.\n1. External factors and running apps can affect the speed of data transmission and screen operations, the experience may vary for each user.\n2. The device's performance may be affected by external conditions.\n3. The quality of the local network may have an effect on Wi-Fi speeds.\n4. Images are for illustrative purposes only, the actual product may vary.\n5. All data sourced from REDMAGIC Labs."
    },
    {
      "url": "https://www.digitaltrends.com/tablets/the-first-ipad-mini-2024-reviews-are-out-here-is-what-people-are-saying/",
      "text": "Early reviews of the iPad mini (2024), which Apple announced last week, are primarily favorable. They highlight the impressive performance of the A17 Pro chip and the device’s continued portability. Reviewers also appreciate the brighter display and support for the Apple Pencil Pro, which enhances precision for drawing and note-taking.\nHowever, the design remains unchanged, with noticeable bezels around the display that feel somewhat dated compared to other modern tablets. A significant drawback for some users will be the need for more support from Apple keyboard accessories, which limits its productivity potential.\nWhile the improved screen is a plus, some reviewers note that it still lacks more advanced display technology — like a 120Hz refresh rate — found in the iPad Pro models.\nOverall, the consensus is that the iPad mini 2024 is a powerful and portable option for content consumption and casual use. Still, its high price point and limited keyboard support may give pause to those seeking a tablet for more intensive productivity tasks.\nWired expressed satisfaction with the enhanced storage options available on the iPad mini (2024) and noted a noticeable performance improvement thanks to the new chipset. It also highlighted the elimination of the “jelly scrolling” issue that affected the previous model. This problem, which some users reported on the iPad mini (2021), appears to have been resolved in the latest version.\nEngadget rightly criticized Apple for maintaining a 60Hz refresh rate on the latest iPad mini, similar to its approach with the iPhone 16 and iPhone 16 Plus. The site also noted that the bezels are too thick for 2024. On the positive side, Endgadget appreciated the compatibility with the Apple Pencil Pro on the new iPad mini, was pleased to see the elimination of the “jelly-scrolling” issue, and felt that the A17 Pro chip is “plenty powerful.”\nMeanwhile, Tom’s Guide praised the new iPad mini for its improved performance, enhanced storage options, and a vivid display. However, it criticized Apple for supporting the Apple Pencil Pro, but not the Apple Pencil 2.\nFinally, The Verge published an intriguing review of the iPad mini (2024), describing it as a “real head-scratcher.” The review noted that the only notable updates to the device are a faster chip and support for the Apple Pencil Pro. It raises questions about whether the upcoming integration of Apple Intelligence will be beneficial, detrimental, or ultimately insignificant in the long run.\nThe iPad mini (2024) begins shipping this week. It’s the third in a series of new Apple tablets released this year, following the iPad Air (2024) and iPad Pro (2024)."
    },
    {
      "url": "https://www.digitaltrends.com/phones/i-tested-a-wild-phone-that-apple-must-copy-for-iphones-gaming-ambitions/",
      "text": "About six months ago, I got my hands on a rather curious phone, one that packed more punch than top-shelf flagships, which cost nearly twice as much. The Red Magic 10 Pro is a beastly phone, but the company has now entered a ludicrous territory where it offers an overclocked Snapdragon 8 Elite silicon and improved thermals inside the Red Magic 10S Pro.\nAfter pushing the device for about two weeks, I’ve realized that it’s not just a fantastic phone and a ridiculously good value at just $649. Instead, it serves as a template for what a top-tier phone should look like, especially one that sells the promise of top-notch performance even in the most demanding scenarios.\nThat brings me to Apple. Over the past couple of years, the company has made some major strides in the gaming segment, especially on mobile devices. Top-tier titles such as Death Stranding, Assassin’s Creed Mirage, and Resident Evil Village have made their way to the iPhone.\nThe Apple Arcade gallery is home to a rewarding bunch of titles, and more are yet to come. Yet, aside from launching a social-friendly Games app, the company hasn’t done much to really catch the true spirit of gaming. That’s a crucial miss, one where Red Magic has done a terrific job.\nA studio of its own\nSo, what exactly is keeping the iPhone from truly reaching its among potential? A lot. Thankfully, all it needs to do is look at Red Magic and pull some “inspired” software magic of its own. As for the Red Magic 10S Pro, well, it’s just a treat for gaming in a lot of ways.\nMy favorite aspect is the Red Magic Studio, which allows the phone to mirror its contents to a larger screen, somewhat like AirPlay. But if you ask any game enthusiast, wireless is not where the fun is at, thanks in no small part to latency. Red Magic knows that all too well and offers a seamless wired console experience.\nAs soon as you connect your phone to a monitor, you get a dedicated game launcher UI where you can find all the native titles as well as your emulation bundles. No complex set-up required, at all. It’s just plug and play. Yes, you get full support for controllers, keyboard, and mouse input. And here’s the best part.\nWhen you connect to a large screen, the Red Magic 10S Pro’s screen turns into a touchpad. So, for the rare occasions where the controller inputs can latch onto system-level pop-up windows, you can simply drag and tap on the phone’s screen and handle the arrowhead cursor, which looks similar to the one on the iPad.\nAll the titles are neatly catalogued on the home dashboard, and the gaming experience is fluid, as well. I had a lot of fun playing Diablo: Immortal and revisiting my PSP collection at the best possible graphics settings, and never ran into any blackouts or crashes that could mar the gaming experience.\nCustomization and perks\nWhen Apple announced the Games app, I was hoping that the iPhone would finally get deep tuning and in-game customization tools. After all, the silicon fitted inside iPhones has remained a step ahead of what you get inside Android devices. Unfortunately, none of that materialized. Fortunately, Red Magic has got you covered.\nNotice that slider button on the side? It takes you straight into the Game Space, a dedicated system of its own solely for playing games. This is where you will find all your games, customize the controller layout, access gameplay capture, adjust fan activity, and separately tune the CPU and GPU power draw as per your needs.\nOn the overclocked Snapdragon 8 Elite silicon inside the Red Magic 10S Pro, the CPU goes up to 4.47 GHz (compared to 4.23 GHz on the standard trim), while the Adreno GPU is also 30% beefier. For the latter, you can even choose the strength of anisotropic filtering, anti-aliasing, and texture filtering to get the best out of graphics-intensive games.\nSince the 144Hz OLED display offers a ridiculously high touch sampling rate of 960Hz for fast input in games, you can deeply customize the screen behavior, as well. You can adjust the sampling rate, sensitivity, slide response, and input stability. Moreover, depending on the on-screen control layout in games, you can also adjust the inactive area of the screen to prevent accidental touch input.\nYou don’t get any of that on iPhones. But that’s just the surface of the deep customization tools you get on the Red Magic 10S Pro. If you take your mobile (and extended large screen) gaming seriously, there’s a custom plug-in library to give you the extra edge.\nHere, you get access to plug-ins such as Hunt that invert the screen color briefly to find hidden enemies, scout mode for adding a zoom superpower within the crosshair, a high sensitivity movement wheel, 4D vibrations, and more. When you enter the game, you get a slide-out tray that provides access to performance modes and plug-ins on the left, and gameplay controls on the right.\nThere are a lot of them, actually, and you can customize them further, just like the control center on iPhones. From changing call behavior to quickly launching your favorite apps in a small floating window, you get it all here. It’s one of the deepest levels of in-game utility customization that I have ever seen on a mobile device, and it really makes a difference.\nApple can — and should — bake deeper in-game controls and customizations within the Games app. And while at it, the company should also pay special attention to aspects such as button remapping, game presets, and hopefully, add a few performance plug-ins of its own.\nThe secret hardware sauce\nThe standout aspect of the Red Magic 10S Pro is the pair of capacitive shoulder trigger buttons on the right edge. With a 520Hz sampling rate, these buttons are blazing fast, but more than sheer speed, they make a tangible difference in the gameplay.\nFrom using them as brake and accelerator in racing games, to peek and shoot buttons in RPG games, they free your thumbs from the clutter of on-screen controls and offer a more console-like experience. These are freely customizable, and you can make adjustments even in the middle of gameplay.\nUsing them almost feels like cheating, because these shoulder buttons really ease the in-game controls and boost the response time, as well. Interestingly, Apple put a similar capacitive button on the iPhone 16 Pro — the camera control — and Oppo has implemented it, too.\nNow, it’s hard to imagine Apple putting two such buttons on its phones, but letting users at least customize it for games and get a physical shoulder button would be neat. It supports both press and slide gestures already, so there’s some serious gaming potential here waiting to be exploited.\nAs far as the rest of the package goes, the Red Magic 10S Pro is a beast. When was the last time you saw a phone with a physical RGB fan for cooling, whirring at 23,000 RPM? Yeah, that’s what you get on this one. Over at the front is a large 6.85-inch OLED screen with an under-display selfie camera, while a huge 7,050mAh battery keeps the lights on, with support for 80W charging in tow.\nIt also offers up to 24GB of RAM, 1TB of super-fast UFS 4.1 storage, and a rewarding haptic motor for intense in-game vibration feedback. It’s as good as a $650 phone gets, and then some more. You just need to make the leap and import one, preferably from one of the Red Magic warehouses closest to your location."
    },
    {
      "url": "https://www.digitaltrends.com/computing/asus-rog-strix-scar-18-2025-review/",
      "text": "- Spectacular mini-LED display\n- Very fast gaming performance\n- Excellent creativity performance\n- Solid build quality\n- Attractive gaming aesthetic\n- Good gaming keyboard\n- Expensive\n- Very large and heavy\n- Touchpad is disappointing\n“Why you can trust Digital Trends – We have a 20-year history of testing, reviewing, and rating products, services and apps to help you make a sound buying decision. Find out more about how we test and score products.“\nI’ve now reviewed my second laptop built around Intel’s newest Arrow Lake-HX chipset and Nvidia’s Blackwell GPU architecture. The first, the Lenovo Legion Pro 7i, was very fast and lived up to the hype, while being a very large 16-inch gaming laptop with some nice aesthetic flair.\nThe second is the Asus ROG Strix SCAR 18, and it’s even larger, with a spectacular 18-inch mini-LED display that’s the best one I’ve reviewed yet. It’s also very fast, although a tiny bit behind, and it, too, offers up a lot to gamers looking for a great, kind of portable gaming machine.\nSpecs and configurations\n| Asus ROG Strix SCAR 18 2025 | |\n| Dimensions | 15.71 x 11.73 x 0.93-1.26 inches |\n| Weight | 7.28 pounds |\n| Processor | Intel Core Ultra 9 275HX |\n| Graphics | Nvidia GeForce RTX 5070 Ti Nvidia GeForce RTX 5080 Nvidia GeForce RTX 5090 |\n| RAM | 16GB DDR5-5600 32GB DDR5-5600 |\n| Display | 18.0-inch 16:10 QHD+ (2560 x 1600) mini-LED, 240Hz |\n| Storage | 1TB SSD 2TB SSD |\n| Touch | No |\n| Ports | 2 x USB-C with Thunderbolt 5 3 x USB-A 3.2 Gen 2 1 x HDMI 2.1 1 x 2.5G RJ45 1 x 3.5mm audio |\n| Wireless | Wi-Fi 7 and Bluetooth 5.4 |\n| Webcam | 1080p with infrared camera for Windows 11 Hello |\n| Operating system | Windows 11 |\n| Battery | 90 watt-hour |\n| Price |\nThe ROG Strix SCAR 18 will be available in a few configurations, only some of which are available as this review is being written. The base model will include an Intel Core Ultra 9 275HX chipset, which is common to all configurations, along with 16GB of RAM, a 1TB SSD, a 16.0-inch QHD+ mini-LED display (the only option), and an Nvidia GeForce RTX 5070 Ti. Upgrading to an RTX 5080 and a 2TB SSD brings the price to $3,400, while an RTX 5090 boosts the price to $4,500.\nThose are expensive prices, but of course, you get a lot of gaming laptop. It’s a lot more expensive than the Legion Pro 7i, which comes in at $3,399 with a Core Ultra 9 275HX, 32GB of RAM, two 1TB SSDs, the RTX 5080, and a 16.0-inch QHD+ OLED display. But I imagine much of that price difference is down to the larger and very good mini-LED panel that Asus is using with the ROG Strix SCAR 18.\nDesign\nThere’s no way around it: the ROG Strix SCAR 18 is a very large laptop. Of course, packing so much power into a chassis that also needs to house an 18.0-inch display would be pretty hard to do and keep things svelte at the same time. The Razer Blade 18 is a little thinner at 1.1 inches versus 1.26 inches, and lighter at 7.06 pounds versus 7.28 pounds. But these 18-inch gaming laptops are just big. You’ll have to deal with it if you want such a large display that can be carried around in one piece.\nThe ROG Strix SCAR 18 is constructed of a mix of materials, including aluminum in the keyboard deck and plastic in the bottom chassis and lid. It’s solid enough, with no bending, flexing, or twisting. I’m sure the Razer Blade 18 might come across as better made, given Razer’s devotion to make the most MacBook Pro-like gaming laptops. But there’s nothing wrong with Asus’s construction.\nIn terms of its aesthetics, the ROG Strix SCAR 18 incorporates most of the things gamers want to see in their machines. First, there’s plenty of RGB lighting, including the per-key RGB lighting on the keyboard, the full-surround RGB LEDs lining the underside of the chassis all the way around, and the large ROG logo on the lid that pulses according to what’s set up in the Armoury Crate utility.\nAnd the white Asus AniMe Vision LEDs on the lid are quite striking, showing a variety of present and custom messages that flow like a high-tech ticker tape. One of the biggest hardware-side changes on the ROG Strix Scar is the focus on easy upgrades. The rear panel can be opened without any screws, thanks to a slider mechanism, providing easy access to the RAM, SSD, and other parts.\nRemoving and replacing the SDD modules is also a screw-free affair owing to the convenient Q-latch system for both storage sticks. There are also a pair of SO-DIMM slots, and once again, they can be accessed to upgrade the RAM without using any tools.\nAt the same time, the overall design doesn’t include some of the more aggressive gamer touches like jet fighter exhaust venting on the back. The vents on the ROG Strix SCAR 18 are more pedestrian and functional, and neither add to nor detract from the overall gamer aesthetic. The Lenovo Legion Pro 7i has RGB LED lighting around its fighter jet exhausts and it looks pretty cool. The ROG Strix SCAR 18 lacks those kinds of touches. Whether that matters will be down to individual tastes.\nOverall, I like the design. Yes, it’s large and bulky, but like I said, that’s really unavoidable.\nKeyboard and touchpad\nThe ROG Strix SCAR 18 keyboard is a bit of a mixed bag. As mentioned above, it has per-key RGB lighting that looks great. And it’s pretty expansive, even with the numeric keypad for macro binding in various games. I found the keycaps oddly small, though, which made it harder than necessary to keep my fingers on home row. And the switches are deep and springy enough for gaming, but not quite as satisfying as I like. I didn’t really enjoy typing this review on the keyboard, but gamers will probably find it good enough, if not the best they’ve used.\nThe touchpad was disappointing. It’s large, but the buttons weren’t very responsive. I took to using an external mouse because I found myself repeatedly trying to click to get things done, and it was frustrating. Most gamers will use gaming mice, so that’s probably not as much of an issue. But it’s certainly not a strength.\nConnectivity and webcam\nThere’s plenty of connectivity, with a mix of ultramodern Thunderbolt 5 ports and legacy connections. That includes a 2.5G RJ45 Ethernet port, which will be appreciated for those who don’t want to game wirelessly. My biggest complaint is that all the ports are on the side, where putting them on the back would keep them out of the way. Wireless connectivity is fully up-to-date.\nThe webcam is a 1080p version, and it’s fine. It has an infrared camera for Windows 11 Hello facial recognition, which I appreciate. The Arrow Lake-HX chipset doesn’t have a fast Neural Processing Unit (NPU), and so the ROG Strix SCAR 18 isn’t a Microsoft Copilot+ PC laptop. That’s probably fine, because if you want to use this laptop for AI processing, you’ll want to use the incredibly fast Nvidia Blackwell GPU.\nPerformance\nThis is just the second laptop I’ve reviewed with Intel’s Arrow Lake-HX chipset, the Core Ultra 9 275HX. It has 24 cores (eight Performance and 16 Efficient), running at up to 5.4 GHz and consuming 55 watts of power, boosting to a maximum of 160 watts. Asus gives it up to 65 watts in its configuration. The Core Ultra 9 275HX is a very fast chipset, with slightly faster cores that result in slightly faster multi-core scores over the previous generation Core i9-14900HX with around the same basic specs. I noticed a discrepancy between Asus’s website where it says the CPU can get up to 80 watts, while my press materials say it’s 65 watts.\nThe Strix SCAR 18 is also the second I’ve reviewed with an Nvidia Blackwell 5000-series GPU, the GeForce RTX 5080. It has Nvidia’s newest CUDA cores, streaming multiprocessors, and RT and tensor cores, and it powers Nvidia’s DLSS 4 that leverages on-device AI processing speeds for much faster scaling and frame generation with an eye toward dramatically improving visual quality while running at similar framerates to the previous generation. It also boosts performance in tasks like video editing with advanced encoding/decoding engines. Asus gives the RTX 175 up to 175 watts, totaling 240 watts — just a bit less than the 250 watts Lenovo gives to the Legion Pro 7i. Again, that’s per my press materials, while the Asus website says it’s up to 255 watts. If I can get that clarified, I’ll update the review.\nAsus includes its Armoury Crate utility that provides finder control over performance than Lenovo’s LegionSpace utility in the Legion Pro 7i. In addition to several performance-based presets, you can enter a manual mode where you can get more granular in configuring the CPU and GPU. I didn’t dig into the settings, but they are there for anyone who wants to fully optimize performance. In our benchmarks, I used the Windows, Performance, and Turbo settings and reported the latter in the table below.\nThe Asus ROG Intelligent Cooling system makes great use of all that interior space, with an end-to-end vapor chamber, triple fans, and Liquid Metal helping to keep things cool. The fans spun up during intense sessions, especially in Turbo mode, but they were slightly quieter than with the Legion Pro 7i. I’ve used gaming laptops that were a lot louder and where the fan noise was harsher.\nThe end-to-end vapor chamber, triple fan layout, and the liquid cooling fan do an acceptable job of keeping things cool under stress. Notably, the tactic of pulling in air through the keyboard deck yields tangible improvements in keeping the rising temperatures under control. For regular workloads, especially if you have selected a Windows profile from the pre-installed Armory Create tuning software, the external chassis doesn’t run hot. Compared to a bunch of gaming laptops that have recently passed our test labs, the heat localization is better and comparatively restrained.\nWhile working, I measured the temperature levels within the 41-43 degrees Celsius range in the area above the keyboard deck. Talking about the innards, the CPU temperatures usually hovered in the 65-68 degrees Celsius ballpark, while the discrete graphics engine remained under 80 degrees Celsius while pushing the machine at AAA games.\nThe noise situation is somewhat of a mixed bag. As long as you stick with the Windows or Silent performance profiles, this is one of the quietest gaming laptops out there. But as you dial things up a notch and move to the Turbo profile, the fan noise is harsh and can only be drowned out by a decent pair of noise-cancelling earbuds or headphones.\nIn our standard suite of benchmarks, the two Arrow Lake-HX/Blackwell laptops perform similarly, with the Lenovo machine being slightly faster across the board. That might be down to either the slight increase in power or more aggressive tuning. Both are much faster than previous-generation Windows laptops in most of our benchmarks, with only the Asus ROG Flow Z13 (a very diminutive machine) being faster in Geekbench 6 multi-core with its AMD Ryzen AI MAX+ 935 chipset. But there’s no doubt that the Strix SCAR 18 will be very fast for the most demanding productivity tasks.\nCreative professionals looking for a fast Windows laptop for photo editing and video editing, along with users who use 3D design and rendering software, often look to gaming laptops, given their high-end components and focus on pure performance. The Pugetbench Premiere Pro and Photoshop benchmarks run in the live versions of each Adobe app and give a good indication of a laptop’s performance for demanding creators. The Strix SCAR 18 is very fast in both, even beating out the Apple MacBook Pro 16 in the Premiere Pro benchmark, where the M4 Max chipset benefits from fast encoding/decoding circuitry. Again, the Legion Pro 7i was faster.\n| Geekbench 6 (single/multi) |\nHandbrake (seconds) |\nCinebench R24 (single/multi/GPU) |\nPCMark 10 Complete |\nPugetBench Premiere Pro |\nPugetbench Photoshop |\n|\n| Asus ROG Strix SCAR 18 (2025) (Core Ultra 9 275HX /RTX 5080) |\n3,050 / 18,876 | 35 | 133 / 1,998 / N/A | 8,601 | 9,867 | 8,486 |\n| Lenovo Legion Pro 7i (2025) (Core Ultra 9 275HX / RTX 5080) |\n3,136 / 20,228 | 33 | 135 / 2,054 / N/A | 9,361 | 10,377 | 9,087 |\n| Lenovo Legion 9i Gen 9 (Core i9-14900H / RTX 4090) |\n1,873 / 13,175 | 71 | 117 / 916 / 8,873 | 9,122 | N/A | 6,622 |\n| Asus ROG Strix 18 (Core i9-14900HX / RTX 4090) |\n2,946 / 17,622 | N/A | Bal: 124 / 1,533 / 22,067 | N/A | 7,430 | N/A |\n| Asus ROG Flow Z13 (Ryzen AI MAX+ 395 / Radeon 8060S) |\n2,993 / 20,659 | 36 | 121 / 1,568 / NA | N/A | 7,250 | 7,250 |\n| Alienware m16 R2 (Core Ultra 7 155H / RTX 4070) |\n2,366 / 12,707 | N/A | 103 / 1,040 / 10,884 | 7,028 | 5,590 | 5,590 |\n| Apple MacBook Pro 16 (M4 Max 16/40) |\n3,626 / 25,332 | 48 | 179 /2,072 / 16,463 | N/A | 9,347 | 13,856 |\nGaming\nAs mentioned above, the Nvidia Blackwell 5000-series is aimed at providing comparable framerates to the previous 4000-series GPUs, but dramatically enhancing visual quality. It does this by using various AI-powered processes for upscaling and frame generation, using Blackwell’s very fast AI performance. The visual improvements are striking, for sure, but we don’t currently benchmark performance using any games that fully support DLSS 4 and so will show off the visual impact.\nSo far, the two RTX 5080 laptops I’ve reviewed have been very fast, but not necessarily much faster in various games than previous 4000-series laptops. Which is to say, you’re not giving up performance across the board, you’re getting much better visual quality, and you’ll see performance increases as games become more optimized. There’s nothing wrong with that. Note that I ran some benchmarks with the Strix SCAR 18 GPU set at the highest setting, but it made no difference in the benchmarks.\nIn the synthetic 3DMark Time Spy benchmark, the ROG Strix SCAR 18 was slightly behind the Legion Pro 7i, and we’ll see that this pattern held in all of our benchmarks. As with our non-gaming benchmarks, the Asus is just a little slower than the Lenovo. That’s likely down to tuning, but the differences likely won’t be enough to force a decision.\nBreaking down by individual games — and all listed results are in each laptop’s highest performance mode — we’ll start with Civilization VI. This title benefits from both very fast CPU and very fast GPU performance, and like the Legion Pro 7i, the Strix SCAR 18 was very fast at running it.\nIn Cyberpunk 2077, the Strix SCAR 18 was slightly behind the Legion Pro 7i, while the Lenovo Legion 9i Gen 9 with an RTX 4090 was the fastest in this comparison group. I suspect that the RTX 5090 will take the top spot in this game, although again, I wouldn’t expect a massive increase.\nIn Red Dead Redemption, the Asus was actually the second-slowest laptop. For whatever reason, it fell further behind than in the other titles. It’s still quite playable at 1600p and Ultra graphics, but this game wasn’t its best showing.\nFinally, Assassin’s Creed Valhalla showed that the laptops we’ve tested have been around the same level of performance. And it’s very fast.\nOverall, once again, the ROG Strix SCAR 18 didn’t break any records, and in fact didn’t keep up with some RTX 4000-series laptops, but it was more than fast enough for most gamers in these older titles. I suspect that these results will only improve.\n| 3DMark Time Spy |\nCiv VI 1600p Ultra |\nCyberPunk 2077 1600p Ultra RT |\nRed Dead Redemption 16oop Ultra |\nAssassin’s Creed Valhalla 1440p Ultra High |\n|\n| Asus ROG Strix SCAR 18 (2025) (Core Ultra 9 275HD /RTX 5080) |\n19,823 | 273 fps | 70 fps | 87 fps | 122 fps |\n| Lenovo Legion Pro 7i (2025) (Core Ultra 9 275HX / RTX 5080) |\n21,486 | 296 fps | 77 fps | 94 fps | 127 fps |\n| Lenovo Legion Pro 7i (2023) (Core i9-13900HX / RTX 4080) |\n18,382 | 223 fps | 45 fps | 99 fps | 126 fps |\n| Lenovo Legion 9i Gen 9 (Core i9-14900H / RTX 4090) |\n20,293 | N/A | 88 fps | N/A | N/A |\n| Asus ROG Zephyrus M16 (Core i9-13900H / RTX 4090) |\n18,372 | 191 fps | N/A | 99 fps | N/A |\n| Lenovo ThinkPad P1 Gen 6 (Core i7-13800H / RTX 4080) |\n13,615 | 170 fps | 57 fps | N/A | N/A |\n| Asus ROG Flow Z13 (Ryzen AI MAX+ 395 / Radeon 8060S) |\n10,532 | 88 fps | N/A | 73 fps | 67 fps |\nSo, you must be intrigued about the performance gulf between the ROG Strix Scar 18 variants with the Nvidia GeForce RTX 5080 and 5090 GPUs, right? Well, there is both good and bad news. First, the latter is an absolute monster, but if we go by granular measures such as cost-per-FPS, you are essentially paying an Nvidia tax. Across simulated workflows and gaming tests, the two models are only separated by a margin of 5%.\nThe biggest difference I saw was on 3DMark, where the flagship Nvidia GPU helped score a 17% lead. Moving over to games, I ran Cyberpunk 2077 with ray-tracing and Forza Horizon 5, and only noticed a 10% lift in the raw FPS output, with DLSS4 and frame generation enabled.\nOn its own, the RTX 5090 variant of the ROG Strix Scar 18 offers an astounding performance in games, as long as you are plugged in to a charging port and running the show at Turbo or Manual mode. Running CyberPunk 2077 with ray-tracing enabled, I consistently saw 120fps output. As you jump to the top Ultra preset, you can still enjoy the game comfortably at over 80fps.\nPlaying Black Myth: Wukong at a similar 1600p resolution with ray-tracing and the highest graphics preset, the outing was no different. But enabling DLSS4 and frame generation is where you see the machine really shine. Cyberpunk 2077 climbs over 200fps, Monster Hunter Wilds ran above 140fps, Horizon Zero Dawn fell close to the 120fps bracket, while Doom: The Dark Ages touched the 280-300fps range.\nBut speaking purely from a raw firepower perspective, the Asus ROG Strix Scar 18 is as future-proof as a laptop can get. If running the most graphics-intensive games is your key criterion, this machine will deliver top-of-the-chart results for at least the next couple of years. And as far as longevity goes, you can expect it to handle gaming titles above the 90fps mark for an even longer spell with all the ray-tracing pizzazz thrown into the mix.\nHowever, you must also ask whether the slight lift above the RTX 5080 variant is worth the $1,100 premium you pay. If you intend to stick with this machine for a long innings, the splurge is justified. But if you’re concerned about the FOMO of next-gen silicon will eventually occupy your mind, the RTX 5080 model is significantly cheaper without any major performance hits.\nBattery life\nWe test battery life with gaming laptops, and invariably, we reach the same conclusion. These aren’t laptops that you should plan to carry around and use without being plugged in, especially for their primary purpose of gaming which pushes every component to its limits. And then considering the size and weight of the ROG Strix SCAR 18, this isn’t really meant to be carried around all that much at all. You can move it from place to place for gaming sessions, but you’ll be carrying the very large and heavy power brick along with you regardless.\nIn our web browsing and video looping battery tests, the laptop barely made it to two hours, and in our more demanding Cinebench R24 test, it didn’t make it to an hour. A 90 watt-hour battery just can’t keep up with powerful components and a very power-hungry 18-inch mini-LED display. Just plan on keeping the thing plugged in.\nDisplay and audio\nI’ve reviewed a few mini-LED displays, and they all been pretty good. That includes the MacBook Pro 16, which until now has had the best example. The Strix SCAR 18, though, might beat them all in some very important metrics. It’s an 18.0-inch 16:10 QHD+ (2560 x 1600) mini-LED panel running at up to 240Hz. It’s incredibly bright and has brilliant colors. It’s not as sharp as the MacBook Pro 16’s display, being both lower resolution and much larger. But for gamers, it promises outstanding high dynamic range (HDR) performance along with a super fast refresh rate that supports Nvidia G-Sync for tear-free gaming.\nMy Datacolor SpyderPro colorimeter captured the objective excellence of this panel. It’s incredibly bright at 1,084 nits, which is brighter than the MacBook Pro 16’s 585 nits with SDR content. Apple’s panel can peak as high at 1,600 nits with HDR, but in terms of sustained SDR brightness, the Asus comes out on top. And, its contrast ratio is incredibly high at 16,310:1, beating out the MacBook Pro 16’s 12,940:1. Both have deep blacks, but the Strix SCAR 18 is a bit deeper. The colors are also wide at 100% sRGB, 89% AdobeRGB, and 100% DCI-P3, with excellent color accuracy at DeltaE 1.05 (less than 1.0 is indistinguishable to the human eye). The MacBook Pro 16 comes in at 100%, 87%, and 99%, respectively, along with DeltaE 1.18.\nThe one negative of mini-LED versus, say, OLED displays, is that there can be some blooming on bright objects against black backgrounds. I didn’t notice anything significant, and unless you’re in a very dark environment, you may not notice it either. Instead, everything looked spectacular, and HDR content was great. That’s for both gaming and HDR media content. This is a very good display that will show off every game you play, and will take advantage of all the power this laptop provides.\nAudio is provided by dual tweeters and downward-firing speakers, and quite frankly, it’s not all that impressive. It gets loud, but there’s some distortion at full volume, and bass was noticeably lacking. I strongly suggest a good pair of gaming headphones — which you’ll probably already plan on using.\nA very large, and very awesome, gaming laptop\nIf you want a gaming machine that you can lug around with you and don’t might the girth and weight, the ROG Strix SCAR 18 will reward you even while it gives you a little exercise. To begin with, the large size is necessary to gain access to that awesome mini-LED display that’s as bright and colorful as any I’ve reviewed — and even better than most.\nAnd then the performance is also excellent, even if it’s not the fastest I’ve reviewed. It will keep up with everything you throw at it, from gaming to creative workflows, without breaking a sweat. It’s not inexpensive, but that’s not to be expected with such a well-designed gaming machine."
    }
  ],
  "argos_summary": "Red Magic’s new Astra tablet offers a compelling alternative to Apple’s iPad mini, boasting a 9‑inch OLED display with 165 Hz refresh, a Snapdragon 8 Elite SoC, and a built‑in 20,000 RPM fan that keeps temperatures down. The device delivers higher performance and better gaming features—such as a 144 Hz screen, 80 W fast charging, and extensive customization—while priced at $499, undercutting the iPad mini’s $699 price. Despite minor design quirks like an off‑center USB‑C port, the Astra’s superior specs and value make it a strong contender for Android tablet users seeking high‑end performance and gaming capability.",
  "argos_id": "546W3R2C7"
}