{
  "url": "https://www.businessinsider.com/tin-can-landline-kids-cellphone-cell-alternative-how-2025-9",
  "authorsByline": "Katie Notopoulos",
  "articleId": "9772987383c74541973f79ab3d896653",
  "source": {
    "domain": "businessinsider.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://i.insider.com/68b1edad194a2d49b8af7698?width=1200&format=jpeg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-01T09:01:02+00:00",
  "addDate": "2025-09-01T09:10:30.578003+00:00",
  "refreshDate": "2025-09-01T09:10:30.578004+00:00",
  "score": 1.0,
  "title": "Tin Can is a 'landline' for kids. It comes as more parents are trying to keep their kids from cellphones.",
  "description": "Tin Can is a kid-friendly WiFi phone that replicates an old-fashioned landline. It's aimed at parents who want to delay giving their kids a cellphone.",
  "content": "Alison Bennett, a mom in Los Angeles, has been going \"full '90s\" in her efforts to avoid buying her 8-year-old a phone. Bennett bought her an MP3 player for music, rents DVDs for movies, and gets paper delivery of the Los Angeles Times.Now, she's found another way to put off getting her daughter a cellphone: She ordered three $75 Tin Can \"landline\" phones — one for her 8-year-old daughter, and two for friends.\"I want my daughter to be able to chat with her friends, like I did as a child in the '90s\" Bennett said — without worrying about all the other stuff that comes with a mobile phone. She said she heard about the Tin Can on a Facebook group.Tin Can is a phone that runs off your home's WiFi. It's similar to a regular VoIP phone, except that it has parental controls so that only approved contacts can call, and only during approved hours. There's also a free plan where Tin Can users can call only other Tin Can users.The company was founded last fall by three friends in the Seattle area. Two of them were dads, and they wanted to create a phone for their own kids. They sat around the kitchen table with soldering irons, working on a prototype with an old corded landline phone.\"We didn't know if this would be a business or a cool walkie-talkie,\" Chet Kittleson, cofounder of Tin Can, said in an interview.Soon, they started giving a few of these phones to their kids' friends so they would have someone to talk to.\"I was like, 'Let's just see if our kids use it,'\" Kittleson said. \"They lost their minds. Kids used the crap out of the thing. They were so excited when it rang, they would jump over the couch.\"The company has raised $3.5 million so far, a spokesperson said, including from Pioneer Square Ventures, Newfund Capital, Mother Ventures, and Solid Foundation, among a few others. The are seven full-time employees, including Kittleson and his co-founders, Max Blumen and Graeme Davies. Kittleson said they've sold \"tens of thousands\" of the phones since launching in early 2025 — and tens of thousands just in the last month. They're backordered until December.The Tin Can comes as a newish movement of parents are wanting to delay giving older kids and tweens a phone until as late as possible — some not until high school, even.But that leaves kids stuck without a way to communicate with friends, and forces parents to act as their kids' social secretary, fielding texts from other parents to set up playdates or other communications.There's also a market for older kids who aren't quite ready for a full cellphone, but need to communicate with parents or friends. This market is mainly served by a variety of smartwatches, flip phones, or devices from companies like Gabb, Troomi, or Pinwheel that are usually Android smartphones with heavy parental control software.But a WiFi \"landline\" phone is something different than just a safe cellphone — and some parents are rediscovering it.An added benefit is giving kids a crash course in phone etiquette. (Alarmingly, some Gen Zers don't say \"hello\" when they answer a phone call; they expect the caller to just start talking.)I started seeing moms talk about the Tin Can on a few different Facebook groups in late August. (That's where I heard Bennett say she had bought one.) By the time I mentioned to other parents at Business Insider that I was working on this story, a bunch of them had already heard about the product.Kittleson said part of his motivation in creating the phone was mental health. \"I want to create a world where, structurally, my kids are less likely to be anxious,\" he said. \"And I think all this stuff [social media] can definitely be a cause of anxiety.\"When Kittleson gave the first Tin Can prototype to his daughter and a few of her friends, he said they were thrilled. But he was even more delighted when he discovered that his daughter and her friend had set up a playdate all on their own — using their Tin Cans — no parents needed. He dropped her off at the friend's house and marveled at how easy it was.\"It's important for kids to have social autonomy — independence to connect with people they want to connect with,\" Kittleson said. \"If we push back the age for cellphones, which I believe we should, then we must find an alternative. That's the role I see Tin Can playing.\"",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Tin Can",
      "weight": 0.10007392
    },
    {
      "name": "Tin Can users",
      "weight": 0.09574123
    },
    {
      "name": "only other Tin Can users",
      "weight": 0.09251338
    },
    {
      "name": "older kids",
      "weight": 0.090632826
    },
    {
      "name": "flip phones",
      "weight": 0.08919488
    },
    {
      "name": "phone etiquette",
      "weight": 0.08712699
    },
    {
      "name": "Kids",
      "weight": 0.081636354
    },
    {
      "name": "kids",
      "weight": 0.081636354
    },
    {
      "name": "other parents",
      "weight": 0.07664154
    },
    {
      "name": "Tin Cans",
      "weight": 0.07619769
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/People & Society/Family & Relationships/Family/Other",
      "score": 0.7138671875
    },
    {
      "name": "/Shopping/Consumer Resources/Product Reviews & Price Comparisons",
      "score": 0.465576171875
    }
  ],
  "sentiment": {
    "positive": 0.19279268,
    "negative": 0.26894346,
    "neutral": 0.5382638
  },
  "summary": "Tin Can, a phone that runs off your home's WiFi, has been developed by three friends in the Seattle area who wanted to create a phone for their own kids. The company's $75 \"landline\" phone, which runs off WiFi, allows only approved contacts to call and only during approved hours. The product was founded by Chet Kittleson, cofounder of Tin Can, and has raised $3.5 million so far and has sold tens of thousands of phones since its launch in 2025. The Tin Can also offers a free plan where users can call only other Tin Can users. This comes as more parents are trying to keep their children from cellphones as they delay giving them a phone until as late as possible, leaving kids without a way to communicate with friends. The technology also provides an additional benefit for kids who need to communicate without a full cell phone.",
  "shortSummary": "Tin Can, a WiFi-based phone for kids, helps parents delay buying their daughter a mobile phone, offering parental controls and a social media presence.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "7d363e4026534771ba4d671fbe6980d7",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Tin Can, a Wi‑Fi landline phone with parental controls, has surged in popularity among parents who want to delay giving their children cellphones. Founded in Seattle by three dads, the startup has raised $3.5 million and sold tens of thousands of units since early 2025, with backorders expected until December. The device offers a safe, controlled communication channel for kids, allowing approved contacts and hours, and has sparked a broader trend toward alternative, low‑risk communication tools for tweens and pre‑teens.",
  "argos_id": "5A5AX35H6"
}