{
  "url": "https://www.livescience.com/archaeology/how-the-racist-study-of-skulls-gripped-victorian-britains-scientists",
  "authorsByline": "Elise Smith",
  "articleId": "7042c6b749ba4990b7b7997b175cae93",
  "source": {
    "domain": "livescience.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://cdn.mos.cms.futurecdn.net/yNGqVjCcfM6tGXpXBBzGje.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-30T14:10:00+00:00",
  "addDate": "2025-08-30T14:14:06.126519+00:00",
  "refreshDate": "2025-08-30T14:14:06.126522+00:00",
  "score": 1.0,
  "title": "How the racist study of skulls gripped Victorian Britain's scientists",
  "description": "Craniometry, the study of skull measurements, was widely taught in medical schools in the nineteenth and early twentieth centuries.",
  "content": "The recent publication of the University of Edinburgh's has drawn attention to its : of 1,500 human craniums procured for study in the 19th century.\n\nCraniometry, the study of skull measurements, was widely taught in medical schools across Britain, Europe, and the United States in the 19th and early 20th centuries.\n\nToday, the harmful and racist foundations of craniometry have been discredited. It's long been proven that the size and shape of the head have no bearing on mental and behavioral traits in either individuals or groups.\n\nIn the 19th and early 20th century, however, thousands of skulls were amassed to enable research and instruction in scientific racism. Edinburgh's skull room is by no means unique.\n\nUnlike phrenology, a popular theory which linked personality traits to bumps on the head, enjoyed widespread scientific support in the 19th century because it revolved around data collection and statistics.\n\nRelated: What's the difference between race and ethnicity?\n\nCraniometrists measured skulls and averaged the results for different population groups. This data was used to classify people into races based on the size and shape of the head. Craniometrical evidence was used to explain why some peoples were supposedly more civilized and evolved than others.\n\nThe vast accumulation of data drawn from skulls appealed to Victorian scientists who believed in the . It equally helped to validate racial prejudice by suggesting that differences among peoples were innate and biologically determined.\n\nThe study of skulls was central to the development of 19th-century anthropology. But before anthropology was taught at British universities, markers of supposed racial difference were studied by anatomists skilled in identifying minute differences in skeletons. The study of skulls entered the university curriculum through medical schools, and particularly through anatomy departments.\n\nFor example, when was appointed as professor of anatomy at Cambridge in 1884, some of his first lectures were on \"The Race Types of the Human Skull.\"\n\nMacalister's annual report for 1892 in the describes how he had increased Cambridge's cranial holdings from 55 to 1,402 specimens. In 1899, he reported the donation of more than 1,000 ancient Egyptian craniums from the archaeologist Flinders Petrie. Much of Macalister's skull collection remains housed in the university's , which was established in 1945.\n\nAs the prestige of craniometrical research increased, institutions had to compete for cranial collections as they went on the market. Statistical accuracy depended on vast series of craniums being measured to produce representative \"types\". This created an increased demand for human remains.\n\nIn 1880, the Royal College of Surgeons from the of . This was added to their existing cache of to create . This collection was largely destroyed in 1941 when the college building was bombed during world war two. The remaining skulls are no longer held by the Royal College of Surgeons.\n\nOxford's University Museum of Natural History included rows of crania in their in the 19th century, as did the University of Manchester's medical school (the medical school is no longer on the same site). This investment in skulls ensured that racial researchers had enough material to study and use in their teaching.\n\nCatalogues kept by universities in the 19th and early 20th centuries reveal not only the size of their skull collections, but also the origin of individual specimens.\n\nSome medical schools, , repurposed skulls procured by phrenological societies earlier in the century to enhance their holdings. Others, including Oxford's, made unearthed by archaeologists to conduct racial research into the country's past. This attempted to trace the movements of Celts, Normans, Saxons, and Scandinavians across the British Isles.\n\nYet because craniologists wanted to capture the full extent of racial variation, skulls from abroad were especially prized. Medical graduates of British universities posted to the colonies to their old professors.\n\nIn research for my forthcoming book on skull collections, I've found that Cambridge's cranial register includes a skull sent from a former student stationed in India. He had plucked it from a cremation site in Bombay despite the outrage of gathered mourners. Brazen grave-robbing and colonial violence were central to the international network that furnished British universities' skull rooms.\n\nThe racist ideology that spurred the collection of skulls 150 years ago has been completely discredited. However, believe these bones may still shed light on human origins, relations and migrations.\n\nYet ethical factors now equally shape institutional policies towards human remains. The Pitt Rivers Museum in Oxford took its infamous off display in 2020.\n\nIncreasingly, universities and museums have confronted the historic injustices and inter-generational trauma perpetuated by their retention of . Since the 1970s, Indigenous groups from around the world have launched campaigns to repatriate their ancestors' bones. Research institutions have become to these requests.\n\nIn London, the Museum of the Royal College of Surgeons no longer displays the skeleton of , the so-called \"Irish Giant\". Byrne had consent for his remains to be dissected and mounted before he died in 1783.\n\nThe skulls in British universities are a testament to a vast theft of human remains from almost every territory on earth. Yet they have the potential to become powerful symbols of reconciliation if their discriminatory histories are acknowledged, and remedied through their return.\n\nA spokesperson for the Duckworth Laboratory, University of Cambridge, said:\n\n\"We, like many institutions in the UK, are dealing with the legacies and past unethical practice in assembling the collections in our care. The Duckworth Collection and the Department of Archaeology are dedicated to fostering an open dialogue and building robust relationships with traditional communities and other stakeholders. This commitment is seen as an integral part of a continuous, reciprocal exchange of knowledge, perspectives, and cultural values. The aim is not only to address past inequities but also to enrich contemporary academic and cultural understanding through a respectful and equal partnership. In this vein, the Duckworth Collection is actively expanding its work with archival documentation and improving our records and database. In essence, the Duckworth Laboratory's approach to repatriation and community engagement is marked by a commitment to openness, inclusivity, and a recognition of the need for an ongoing dialogue.\"\n\nThis edited article is republished from under a Creative Commons license. Read the .",
  "medium": "Article",
  "links": [
    "https://britisharchaeology.ashmus.ox.ac.uk/highlights/rolleston.html",
    "https://www.bbc.co.uk/news/world-africa-63171981",
    "https://daily.jstor.org/will-an-18th-century-giant-finally-get-a-burial-at-sea/",
    "https://www.livescience.com/archaeology/oddly-shaped-head-left-in-italian-cave-12-500-years-age-is-europes-oldest-known-case-of-cranial-modification-study-finds",
    "http://theconversation.com/",
    "https://archive.org/details/b28119381/page/n3/mode/2up?view=theater",
    "https://upf.com/book.asp?id=9781683401575",
    "https://www.livescience.com/archaeology/we-know-humans-arose-in-africa-but-archaeology-is-only-just-uncovering-secrets-of-the-continents-early-civilizations",
    "https://adelaideaz.com/articles/coroner-william-smith-s-part-in-adelaide-trade-in-aboriginal-people-s-bodies-exposed-by-tommy-walker-scandal-in-1903",
    "https://archive.org/details/b21466403/page/n3/mode/2up",
    "https://www.bbc.co.uk/future/article/20240118-is-it-ever-ethical-for-museums-to-display-human-remains",
    "https://archive.org/details/in.ernet.dli.2015.45445/page/n3/mode/2up",
    "https://theconversation.com/how-the-racist-study-of-skulls-gripped-victorian-britains-scientists-262280",
    "https://www.livescience.com/archaeology/alien-skull-of-toddler-is-actually-evidence-of-long-standing-practice-of-head-shaping",
    "https://www.degruyterbrill.com/document/doi/10.7208/9780226481104-022/html?lang=en&srsltid=AfmBOoq6rWKsH0JQTlcGyaDOp-Qouw1MfJaZG0N9Voq2NJj2ppEvbjhr",
    "https://www.google.co.uk/books/edition/Supplement_to_Thesaurus_Craniorum/njQvAAAAYAAJ?hl=en&gbpv=1",
    "https://www.theguardian.com/education/2025/jul/28/edinburgh-university-skull-room-highlights-its-complicated-history-with-phrenology",
    "https://proof.vanilla.tools/livescience/articles/edit/ZctWavDHVp4jGbLJnHfck6",
    "https://www.prm.ox.ac.uk/shrunken-heads",
    "https://www.reporter.admin.cam.ac.uk/",
    "https://www.cambridge.org/core/books/abs/british-barrows/general-remarks-upon-the-series-of-prehistoric-crania-by-dr-rolleston/BE1502F8C73E04F00AD16522DACE40C9",
    "https://www.ed.ac.uk/about/race-review/read-the-review",
    "https://www.livescience.com/geneticist-adam-rutherford-on-how-eugenics-darwins-monster-took-over-the-world",
    "https://en.wikisource.org/wiki/1911_Encyclop%C3%A6dia_Britannica/Craniometry",
    "https://web.prm.ox.ac.uk/sma/index.php/articles/article-index/379-rolleston-publications.html",
    "https://www.bshs.org.uk/wp-content/uploads/Viewpoint_114.pdf",
    "https://www.ed.ac.uk/sites/default/files/2025-07/Decolonised%20Transformations%3A%20Confronting%20the%20University%20of%20Edinburgh%E2%80%99s%20History%20and%20Legacies%20of%20Enslavement%20and%20Colonialism.pdf",
    "https://www.arch.cam.ac.uk/institutes-and-facilities-overview/duckworth-laboratory",
    "https://hunterianmuseum.org/news/statement-on-the-skeleton-of-charles-byrne-from-the-board-of-trustees-of-the-hunterian-collection",
    "https://exhibitions.ed.ac.uk/exhibitions/mind-shift/",
    "https://www.livescience.com/difference-between-race-ethnicity.html",
    "https://www.livescience.com/health/racism-is-a-global-public-health-crisis-author-layal-liverpool-says-racist-ideas-still-pervade-medicine-and-that-hurts-all-of-us",
    "https://www.jstor.org/stable/25252691?seq=1",
    "https://commons.wikimedia.org/wiki/File:Ascertaining_capacity_of_cranial_cavity_by_means_of_water_05.jpg"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "skull collections",
      "weight": 0.090247534
    },
    {
      "name": "skulls",
      "weight": 0.078389816
    },
    {
      "name": "skull measurements",
      "weight": 0.07681743
    },
    {
      "name": "repurposed skulls",
      "weight": 0.07642961
    },
    {
      "name": "cranial collections",
      "weight": 0.06174536
    },
    {
      "name": "British universities",
      "weight": 0.060822815
    },
    {
      "name": "racial research",
      "weight": 0.060472697
    },
    {
      "name": "data collection",
      "weight": 0.058909304
    },
    {
      "name": "human remains",
      "weight": 0.05780464
    },
    {
      "name": "supposed racial difference",
      "weight": 0.05732974
    }
  ],
  "topics": [
    {
      "name": "Racial Injustice"
    },
    {
      "name": "Social Issues"
    }
  ],
  "categories": [
    {
      "name": "Science"
    }
  ],
  "taxonomies": [
    {
      "name": "/People & Society/Other",
      "score": 0.52001953125
    },
    {
      "name": "/Sensitive Subjects/Other",
      "score": 0.442138671875
    },
    {
      "name": "/Reference/Humanities/History",
      "score": 0.4287109375
    }
  ],
  "sentiment": {
    "positive": 0.13374196,
    "negative": 0.43841594,
    "neutral": 0.42784202
  },
  "summary": "The University of Edinburgh's 19th century skull room contains a collection of 1,500 human craniums. The study of skull measurements was widely taught in medical schools across Britain, Europe, and the United States in the 19th and early 20th centuries. Craniometrists measured skulls and averaged results for different population groups, which was used to classify people into races based on the size and shape of the head. The vast accumulation of data from skulls appealed to Victorian scientists who believed in the idea of racial differences. The skulls were used to explain why some peoples were supposedly more civilized and evolved than others. The research has since been discredited and led to the creation of modern scientific science. However, there are still campaigns to repatriate the bones of Indigenous groups' ancestors.",
  "shortSummary": "Craniometry, the scientific study of skulls in Victorian Britain, was central to scientific racism, leading to widespread scientific racism and subsequent controversies.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "0410377d21864fc3ade9a3e6fcc2c6ba",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.theguardian.com/education/2025/jul/28/edinburgh-university-skull-room-highlights-its-complicated-history-with-phrenology",
      "text": "Hundreds of skulls are neatly and closely placed, cheekbone to cheekbone, in tall, mahogany-framed glass cabinets. Most carry faded, peeling labels, some bear painted catalogue numbers; one has gold teeth; and the occasional one still carries its skin tissue. This is the University of Edinburgh’s “skull room”.\nMany were voluntarily donated to the university; others came from executed Scottish murderers; some Indigenous people’s skulls were brought to Scotland by military officers on expeditions or conquest missions. Several hundred were collected by supporters of the racist science of phrenology – the discredited belief that skull shape denoted intelligence and character.\nAmong them are the skulls of two brothers who died while studying at Edinburgh. Their names are not recorded in the skull room catalogue, but cross-referencing of matriculation and death records suggests they were George Richards, a 21-year-old medic who died of smallpox in 1832, and his younger brother, Robert Bruce, 18, a divinity scholar who died of typhoid fever in 1833.\nExactly how the Richards brothers’ skulls came to be separated from their bodies, recorded as interred in the South Leith parish church cemetery, is unknown. But they were almost certainly acquired by the Edinburgh Phrenological Society to study supposed racial difference.\nResearchers believe their case exemplifies the challenging questions facing the university, which, it has now emerged, played a pivotal role in the creation and perpetuation of racist ideas about white superiority and racial difference from the late 1700s onwards – ideas taught to thousands of Edinburgh students who dispersed across the British empire.\nUniversity records studied by Dr Simon Buck suggest the brothers were of mixed African and European descent, born in Barbados to George Richards, an Edinburgh-educated doctor who practised medicine on sugar plantations and who owned enslaved people – possibly including George and Robert Bruce’s mother. Edinburgh Phrenological Society’s 1858 catalogue records the skulls (listed as No 1 and No 2) as having belonged to “mulatto” students of divinity and medicine.\n“It can be assumed that the racialisation of these two individuals as ‘mulatto’ – a hybrid racial category that both fascinated and bewildered phrenologists – is what aroused interest among members of the society in the skulls of these two students,” Edinburgh’s decolonisation report concludes.\nThe brothers’ skulls are among the roughly 400 amassed by the society and later absorbed into the anatomical museum’s collection, which now contains about 1,500 skulls. These are held in the Skull Room, to which The Guardian was granted rare access.\nMany of these ancestral remains, the report states, “were taken, without consent, from prisons, asylums, hospitals, archaeological sites and battlefields”, with others “having been stolen and exported from the British empire’s colonies”, often gifted by a global network of Edinburgh alumni.\n“We can’t escape the fact that some of [the skulls] will have been collected with the absolute express purpose of saying, ‘This is a person from a specific race, and aren’t they inferior to the white man’,” said Prof Tom Gillingwater, the chair of anatomy at the University of Edinburgh, who now oversees the anatomical collection. “We can’t get away from that.”\nThe Edinburgh Phrenological Society was founded by George Combe, a lawyer, and his younger brother, Andrew, a doctor, with roughly a third of its early members being physicians. Both were students at the university, and some Edinburgh professors were active members.\nThrough its acquisition of skulls from across the globe, the society played a central role in turning the “science” of phrenology, which claimed to decode an individual’s intellect and moral character from bumps and grooves on the skull, into a tool of racial categorisation that placed the white European man at the top of a supposed hierarchy.\nGeorge Combe’s book, The Constitution of Man, was a 19th-century international bestseller and the Combe Trust (founded with money made from books and lecture tours promoting phrenology) endowed Edinburgh’s first professorship in psychology in 1906 and continues to fund annual Combe Trust fellowships in the Institute for Advanced Studies in the Humanities.\nPhrenology was criticised by some of Edinburgh’s medical elite for its unscientific approach. But some of its most vocal critics were nonetheless persuaded that immutable biological differences in intelligence and temperament existed between populations, a study by Dr Ian Stewart for the university’s decolonisation report reveals.\nThese included Alexander Monro III, an anatomy professor at the University of Edinburgh medical school, who lectured “that the Negro skull, and consequently the brain, is smaller than that of the European”, and Robert Jameson, a regius professor of natural history, whose lectures at the university in the 1810s included a hierarchical racial diagram of brain size and intelligence.\nDespite the fact that phrenology was never formally taught at Edinburgh, and its accuracy was heavily contested by Edinburgh academics, the skull room, which is closed to the public, was built partly to house its collection by the then professor of anatomy Sir William Turner, when he helped oversee the construction of its new medical school in the 1880s.\nAmong its reparatory justice recommendations of Edinburgh’s investigation is that the university provide more support for the repatriation of ancestral remains to their original communities.\nThis, Gillingwater suggested, possibly underplays the complexities involved – even for cases such as the Richards brothers. He regards the circumstantial evidence in their case as “strong” but says it does not meet the forensic threshold required for conclusive identification.\n“From a legal perspective, it wouldn’t be watertight,” said Gillingwater. “I would never dream of returning remains to a family when I didn’t know who they definitely were.”\nActive engagement surrounding repatriation is taking place in relation to several of the skulls from the phrenology collection; more than 100 have already been repatriated to their places of origin. But each case takes time building trust with communities and in some cases navigating geopolitical tensions over which descendent community has the strongest claim to the remains.\n“To look at perhaps repatriation, burials, or whatever, it’s literally years of work almost for each individual case,” said Gillingwater. “And what I found is that every individual culture you deal with wants things done completely differently.”\nMany of the skulls will never be identified and their provenance is likely to remain unknown. “That is something that keeps me awake at night,” said Gillingwater. “For some of our skulls, I know that whatever we do, we’re never going to end up with an answer.”\n“All I can offer at the minute is that we just continue to care for them,” he added. “They’ve been with us, many of them, for a couple of hundred years. So we can look after them. We can care for them. We can treat them with that dignity and respect they all deserve individually.”"
    },
    {
      "url": "https://web.prm.ox.ac.uk/sma/index.php/articles/article-index/379-rolleston-publications.html",
      "text": "Taken from Scientific Papers and Addresses [1884]:\nLIST OF THE PUBLISHED WRITINGS OF PROFESSOR GEORGE ROLLESTON, M.D., F.R.S, ARRANGED IN CHRONOLOGICAL ORDER.\n1. [1856]. Report on Smyrna, prepared at the request of the Right Honourable the Secretary of State for War. (London: Queen's Printers, 1856: pp. 1-123.) [This Report contains a geographical description of Smyrna; an account of its political history, of its population, the languages spoken there, its climate with medical notes, and its commerce.]\n2. [1861]. On the Homologies of the Lobes of the Liver in Mammalia. (British Association Reports, 1861: Part II. pp. 174, 175.)\n3. [1861]. On the Anatomy of Pteropus. (British Association Reports, 1 86 1: Part II. p. 173. Title only.)\n4. [1861]. On some Points in the Anatomy of Insectivora. (Short abstract in British Association Reports: Part II. pp. 173, 174.)\n5. [1861]. On the Affinities of the Brain of the Orang-Utang. (Natural History Review, 1861: pp. 201-217.)\n6. [1861]. On the Correlations of Growth, with a special example from the Anatomy of a Porpoise. (Natural History Review, 1861: pp. 484-488.)\n7. [1862]. On the Affinities and Differences between the Brain of Man and the Brains of Certain Animals. A Lecture delivered at the Royal Institution, January 24, 1862. (Medical Times and Gazette, 22 Feb.- i5 March, 1862.)\n8. [1862]. On Certain Modifications in the Structure of Diving Animals. (Abstract in the British Association Reports, 1862 : Part II. pp. 1 1 8-1 1 9.)\n9. [1862]. Sugar as Food and as a Product of the Body. A Review. (British and Foreign Medico-Chirurgical Review, 1862.)\n10. [1862]. On the Difference of Behaviour exhibited by Inuline and ordinary Starch when treated with Salivary Diastase and other converting Agents. (British Association Reports, 1862 : Part II. p. 135.)\n11. [1863]. Notes on the Post-mortem Examination of a Man supposed to have been a hundred and six years old. (British and Foreign Medico-Chirurgical Review, XXXI. 1863: pp. 505-513.)\n11a. [1863]. Address on Physiology to British Association at Newcastle. (Reports, p. 109, 1864.)\n12. [1864]. Von Baer on Papuans and Alfourous and the Origin of Species. (The Reader, 9 January, 1864.) [A Review]\n13. [1866]. On the Placental Structures of the Tenrec (Centetes ecaudatus), and those of certain other Mammalia; with remarks on the value of the Placental System of Classification (1863). (Zoological Society's Transactions, V. 1866: pp. 285-316.)\n14. [1866]. Sewage and Sewerage. A Review. (Quarterly Journal of Science, III. April, 1866: pp. 180-199.) In this Article the author discusses 'how we are to dispose of our sewage without either spoiling our rivers, or robbing our fields, or poisoning ourselves.']\n15. [1867]. Note on the Blood Corpuscles of the Two-toed Sloth (Cholopus didactylus) and of the Elephant (Elephas Indicus). (Quarterly Journal of Microscopical Science, VII. 1867: pp. 127-130.)\n16. [1868]. On the Domestic Cats (Felis domesticus and Mustela foina) of Ancient and Modern Times. (Journal of Anatomy and Physiology, II. 1868: pp. 47-6i.)\n17. [1868]. On the Cat of the Ancient Greeks. (Journal of Anatomy and Physiology, II. 1868: pp. 437-438.)\n18. [1868]. Physiology in Relation to Medicine in Modern Times. An Address delivered at the Meeting of the British Medical Association at Oxford, 5 August, 1868. (Published in the Lancet, 8 August, 1868, p. 176; the Medical Times and Gazette, 15 August, 1868, p. 184; and in Medicine in Modern Times,' pp. 49-102, London, 1869.)\n19. [1868]. On the Pectorales Muscles. (British Association Reports, 1868, p. 120, Title only; and Medical Times and Gazette, 1868, Vol. II, p. 274.)\n20. [1868]. On the Physiology of Pain. {British Association Reports, 1868, p. 120, Title only; and abstract in Medical Times and Gazette, 1868, Vol. II, p. 250.)\n21. [1868]. On Sixteen Eskimo Crania. (British Association Reports, 1868, p. 120, Title only; and abstract in Medical Times and Gazette, 1868, Vol. II, p. 274.) [A number of general propositions were stated with reference to this series of Crania; some of which were referable to the special habits of the people, others to their tribal or ethnological peculiarities.]\n22. [1868]. The Fallacy of Reference. (A Letter to the Lancet, 19 September, 1868: p. 395.) [This letter was written to show how unsafe it is to take any assertion as to a third writer at second hand.]\n23. [1868]. Hints on House Construction. (A Letter to the Lancet, 21 November, 1868 : p. 681.) [This letter was written to recommend that in building a house a layer of impervious material should be spread over the entire area on which the house is to be built, and not confined to the so-called 'damp course ' which is put into the walls. Also that the small-calibred drain pipes should be surrounded by a layer of gravel, so as to dry a water-logged soil.]\n24. [1868]. On the Modes of Sepulture observable in late Romano- British and early Anglo-Saxon Times in this Country. (Transactions of the International Congress of Prehistoric Archaeology, Third Session, 1868: pp. 176-184.) [This paper is mainly based upon investigations conducted in a cemetery at Frilford in Berkshire. Dr. Rolleston subsequently published in the Archaeologia detailed accounts of these investigations]\n25. [1869]. The Earth Closet System. (Lancet, 6 March, 1869: p. 319.)\n26. [1869]. The Dry Earth System. (A Letter to the Lancet, 20 March, 1869: p. 411.) [This letter was written in reply to one by the Rev. Henry Moule, the introducer of the dry-earth system for the disposal of sewage. Dr. Rolleston advocates a water system as preferable to a dry-earth system, and points out what he regards as the dangers of the latter.]\n27. [1869]. On the various Forms of so-called 'Celtic' Cranium. (Journal of Anatomy and Physiology, III. 1869: pp. 252-255.)\n28. [1870]. On the Character and Influence of the Anglo-Saxon Conquest of England, as illustrated by Archaeological Research. (Proceedings of the Royal Institution, Vol. VI, p. 116; reprinted in Nature, Vol. I, p. 661.)\n29. [1870]. The Relative Value of Classical and Scientific Training. A Review. (Nature, 1870, Vol. II, pp. 250-252.)\n30. [1870]. Biological Training and Studies. Address to the Biological Section of the British Association, Liverpool. (British Association Reports, XL. 1870: pp. 91-109.)\n31. [1870]. Forms of Animal Life, being Outlines of Zoological Classification, based upon anatomical investigation and illustrated by descriptions of specimens and of figures. 8vo. pp. 436. (Clarendon Press, Oxford, 1870.)\n32. [1870]. On the Homologies of certain Muscles connected with the Shoulder Joint (1868). (Linnean Society Transactions, XXVI. 1870 : pp. 609-630.)\n33. [1870]. On Trophic Nerves. A Review. (Quarterly Journal of Science, VII. 1870: pp. 200-206.)\n34. [1870]. Researches and Excavations carried on at an Ancient Cemetery at Frilford near Abingdon in the years 1867 and 1868. (Archaeologia, 1870: Vol. XLII, pp. 417-485.)\n35. [1871]. Reasons for appointing a Medical Inspector to hold office during the carrying out of our Drainage Scheme. Addressed to the Members of the Oxford Local Board. (Oxford, 1 87 1: pp. 1-13.) [A print of a speech delivered 15 November, 1871, in support of a motion made by Dr. Rolleston that it was expedient to appoint an Officer of Health during the carrying out of the Drainage works.]\n36. [1871]. On Typhoid or Enteric Fever in Indian Gaols, and on the Relations of that Disease and of Cholera to the Dry-earth System of Conservancy. (Lancet, January 7, p. 7, and 14, p. 42.)\n37. [1871]. The Propagation of Cholera. (A Letter to the Lancet, September 2, 187 1, p. 339.) [This letter was written to show that whilst cholera is and may be propagated by drinking water, yet that water is not the sole channel of its propagation.]\n38. [1871]. On the Development of the Enamel in the Teeth of Mammals, as illustrated by the various stages of growth demonstrable in the evolution of the fourth molar of a young Elephant (Elephas indicus), and of the incisor teeth of the foetal Calf (Bos taurus). (Transactions of the Odontological Society of Great Britain, 187 1, Vol. Ill, p. 239; and reprinted in the Quarterly Journal of Microscopical Science, XII. 1872, pp. 109-m.)\n39. [1872]. On the Skulls obtained in Canon Greenwell's Excavations. (British Association Reports, XLII. 1872: pp. 193-194.)\n40. [1872]. On the Weddo of Ceylon. (Abstract in British Association Reports, XLII. 1872 : p. 194.)\n41. [1873]. Harveian Oration, 1873. (London: Macmillan & Co.)\n42. [1874]. Address on the Examination System, delivered at the Distribution of Prizes in the St. Mary's Hospital Medical School, London, May 7, 1874.\n43. [1874]. In Memoriam John Phillips, M.A., F.R.S. (Proceedings of the Ashmolean Society, Oxford, May 15, 1874 : pp. 1-7.)\n44. [1875]. Address on Anthropology to the Anthropological Department of the British Association, Bristol. (British Association Reports, XLV. 1875, p. 142; Nature, 1875, XII. pp. 382-386.)\n45. [1875]. On the Applicability of Historical Evidence to Ethnographical Inquiries. (British Association Reports, 1875 : p. 178. Title only.)\n46. [1875]. Letter in Archives de Zoologie Experimentale, Vol. IV, 1875, Notes et Revue, p.m.\n47. [1876]. On the People of the Long-Barrow Period. (Journal of the Anthropological Institute, Vol. V: pp. 120-172. Plates IV, V, VI. Bead 13 April, 1875.) Article XVIII, P- 353- OF PROFESSOR GEORGE ROLLESTON. lxxiii\n48. [1876]. On the Domestic Pig of Prehistoric Times in Britain, and on the mutual Relations of this variety of Pig and Sus scrofa ferus, Sus cristatus, Sus andamanensis, and Sus barbatus. (Linnean Society Transactions, Second Series, Zoology, Vol. 1, 1876 ; also under title, 'On the Prehistoric British Sus, 1 in abstract in Journal of Linnean Society, Zoology, XIII. p. 108.)\n49. [1877]. Notes on the Animal Remains found at Cissbury. (Journal of the Anthropological Institute, Vol. VI: pp. 20-36. Plate XIX. Paper read 23 November, 1875, and pub- lication delayed.)\n50. [1877]. Description of Figures of Skulls obtained in British Barrows. ('British Barrows,' by Canon Greenwell, pp. 559-623. Clarendon Press, Oxford, 1877.)\n51. [1877]. General Remarks upon the preceding Series of Prehistoric Crania. (' British Barrows,' by Canon Greenwell, pp. 627-718.)\n52. [1877]. On the Prehistoric Flora of this Country in the Neolithic Period, being an Appendix to the Account of the Crania obtained in British Barrows. ('British Barrows.’ by Canon Greenwell, pp. 720-725.)\n53. [1877]. On the Prehistoric Fauna of Neolithic Times, being an Appendix to the Account of the Skulls obtained in British Barrows. ('British Barrows.’ by Canon Greenwell, pp. 725-750.)\n54. [1877]. On the Flora and Fauna of Prehistoric Times. (Abstract in British Association Reports, XLVII, 1877 : pp. 120-121.) [This paper is incorporated in the Appendix to the Crania described in British Barrows]\n55. [1877]. On the Rationale of Brachycephaly and Dolichocephaly. (The same. Title only.)\n56. [1877]. On the Rationale of Artificial Deformations of the Head. (The same. Title only.)\n57. [1877]. New Points in the Zoology of New Guinea. (Abstract in British Association Reports, 1877, XLVII. pp. 102-103; Nature, 1877, p. 409.)\n58. [1878]. The Blood Corpuscles of the Annelides. (Journal of Anatomy and Physiology f XII. April, 1878: p. 401.)\n59. [1878]. Three Anatomical Notes and two Anatomical Queries. (Journal of Anatomy and Physiology, XIII. October, 1878: p. 115.)\n60. [1878]. On the three Periods known as the Iron, the Bronze, and the Stone Ages. (Transactions of the Bristol and Gloucestershire Archaeological Society',1878.)\n61. [1878]. Report of Excavation of a Twin Barrow and a single Round Barrow at Sigwell, Somerset. (Journal of the Anthropological Institute, VIII. 1878: pp. 185-191.)\n62. [1879]. Notes on a Skeleton found at Cissbury, April, 1878. (Journal of the Anthropological Institute, VIII. May, 1879 : pp. 377-389.)\n63. [1879]. Note on the preservation of Encephala by the Zinc Chloride. Journal of Anatomy and Physiology, XIII. Jan. 1879: pp. 232-233.)\n64. [1879]. Description of a Human Skeleton found in a Barrow at Rockley. ( Wiltshire Archaeological Society, August, 1879.) Article XXII, p. 453.\n65. [1879]. The Changes produced by Man in the Indigenous Fauna and Flora of Great Britain. (Glasgow Science Lectures Association, Jan. 9, 1879: pp. 1-16.)\n66. [1879]. Further Researches in an Anglo-Saxon Cemetery at Frilford, with Remarks on the Northern Limit of Anglo-Saxon Cremation in England. (Archaeologia, 1879, XLV: pp. 405-410.) Article XXXV, p. 653.\n67. [1880]. The Modifications of the External Aspects of Organic Nature produced by Man's interference. Lecture at Evening Meeting of the Royal Geographical Society, May 12, 1879. (Journal of the Royal Geographical Society, 1880, XLIX: pp. 320-392.)\n68. [1880]. Jade Tools in Switzerland. (Letter to The Times, January 2, 1880.)\n69. [1880]. Crayfish : an Introduction to the Study of Zoology. [A Review of Professor Huxley's well-known book.] (The Times, May 24, 1880.)\n70. [1880]. Report on the Fauna of a Crannog at Lochlee, Tarbolton, Ayrshire. (Proceedings of Society of Antiquaries of Scotland, XIII. 1880: pp. 241-245.)\n71. [1880]. Report on Bones from Chastleton. (Journal of Anthropological Institute, X. August, 1880: pp. 126-127.)\n72. [1880]. On the Double Malar Bone. (British Association Reports, 1880, L: p. 604. Title only.)\n73. [1880]. On the Classification of Rodents. (The same. Title only.)\n74. [1880]. On the Structure of Round and of Long Barrows. (The same: p. 623. Title only. Nature, XXII : p. 478.)\n75. [1880]. On Bushmen Crania. (The same: p. 631. Title only.)\n76. [1880]. On the Rot in Sheep. (The Times, April 14, 1880, and reprint in Zoologische Anxeiger, Jahrg. III. p. 258, 1880.)\n77. [1881]. Note on the Geographical Distribution of Limax agrestis, Arion hortensis, and Fasciola hepatica. (Zoologische Anzeiger, Jahrg. III. p. 400, 1880; Journal of the Royal Agricultural Society of England, XVII. S. S. 1881, Part I.)\n78. [1881]. Report on Bushmen Crania in 'Matabele Land and the Victoria Falls: a Naturalist's Wanderings in the Interior of South Africa. From the Letters and Journals of the late Frank Oates, F.R.G.S. Edited by C. G. Oates, B.A.' (London, 1881.)\n79. [1861]. On the Aquiferous and Oviducal System in the Lamelli-branchiate Mollusks. (Transactions of the Royal Society, London, 1861.)\nHitherto unpublished\n1. Notes on the site of Roman Pottery \"Works at the Mynchery, upon the Sewage Farm near Oxford. Page 937. Notes on Archaeological Discoveries at \"Wytham, Berkshire. Page 939. Notes on Archaeological Discoveries at Yarnton, Oxfordshire. Page 942. 1 These notes form an Appendix to the second volume.\nTranscribed by AP October 2012"
    },
    {
      "url": "https://britisharchaeology.ashmus.ox.ac.uk/highlights/rolleston.html",
      "text": "George Rolleston, FRCP; FRS. (1829-1881) was the first Linacre Professor of Anatomy and Physiology at the University of Oxford (1860-1881). Rolleston was a close colleague and protégé of the evolutionary biologist Thomas Huxley, and was one of the most influential and distinguished scientists in Oxford during the later nineteenth century.\nDuring his time at Oxford he developed innovative teaching and research in anthropology and archaeology as well as in his specialism of comparative anatomy and physiology. He was especially interested in brain development and the study of human and animal skulls, and during his research he built up an extensive collection of human skulls from around the world. This collection was presented to the Oxford University Museum of Natural History (OUM), and much of it survives there today.\nHe was also a pioneer in archaeological practice, advocating scientific rigour in fieldwork and research. Rolleston participated in a number of archaeological excavations: he opened Anglo-Saxon graves at Frilford in 1867–68; with his friend, A.H.L.F. Pitt-Rivers, he explored barrows at Sigwell and at Rushmore, and contributed reports on skeletal remains uncovered from Pitt-Rivers work at Cissbury; in 1877 he published a book on British Barrows with Canon William Greenwell, his contribution focussing on crania; and with John Thurnam he dug in Wiltshire. His archaeological collections and archive were transferred from the OUM to the Ashmolean Museum in the mid-1880s as part of a wider reorganisation of the university's collections. At about the same time his ethnographic collections were transferred to the then newly-founded Pitt Rivers Museum.\nThe archive held by the Ashmolean Museum primarily relates to aspects of George Rolleston’s professional career, specifically his involvement with the OUM, as well as his craniological and archaeological research. Only a minority of the papers concern his work on comparative anatomy and zoology, and very few papers are personal or family-related. The largest section is the correspondence files, which date from 1861 to 1881. The archive is of considerable importance both to research into the development of the natural sciences in Oxford the late19th century, and to the documentation of archaeological, anthropological and human skeletal material held by University of Oxford museums.\nIn 2011-2012, the John Fell University Press (OUP) Research Fund supported an inter-museum research project to catalogue the George Rolleston archive. The aims of the project were to enhance access to the papers, and to assess the potential for contributing to further reseach on the archaeological and anthropologial collections to which they relate, and to the history of science and scientific collecting in Oxford in the 19th century.\nA copy of the catalogue by Alice Stevenson is available to download.\nPlease cite this work as follows, indicating the author, year, title, date accessed or downloaded, and that it is available on the Ashmolean website.\nClick to enlarge\nGeorge Rolleston, by William Edwards Miller, pencil and chalk, 1877. NPG 1933. (Image by permission of the National Portrait gallery under a CC BY-NC-ND 3.0 licence).\nClick to enlarge\nSkulls forming part of the anatomical collections display, University Museum, Oxford, c.1860�90 © Oxford University Museum.\nThe documents in the archive were written during the mid to late nineteenth century and some of the language used and attitudes expressed by Rolleston and his correspondants should be considered within the context of that time.\nFor enquiries and information about consulting the papers, please contact the Department of Antiquities Administrator at antiquities@ashmus.ox.ac.uk. Information about the Antiquities Study Room is available here.\nThe catalogue of the George Rolleston archive arises from research funded by the John Fell University Press (OUP) Research Fund.\nProject 103/752: The Professor George Rolleston archive: a resource for the history of archaeology, anthropology and evolutionary biology at Oxford. Award holders: Alison Roberts (Ashmolean Museum) and Malgosia Nowak-Kemp (Oxford University Museum of Natural History). Archivist: Alice Stevenson (Pitt Rivers Museum).\nThe Pitt Rivers Museum research project 'Scoping Museum Anthropology' (2012-2013) is conducting further work on the George Rolleston archive and has made additional information and transcriptions of some of the papers available on-line. The project concerns the history and development of museum anthropology at the University of Oxford from 1850 to 1920. Alison Petch has also transcribed a draft letter from Rolleston to the Vice Chancellor of the University of Oxford in 1867 concerning the future of ethnological material in the University Museum. This letter is catalogued as AMS 45/10, although it may once have been part of the Rolleston archive.\nThe Pitt Rivers Museum research project 'Rethinking Pitt-Rivers' (2009-2012) conducted further work on the letters from Augustus Henry Lane Fox Pitt-Rivers in the Rolleston archive, and has made additional information, tracings of sketches and transcriptions of these letters available on-line. The work took place immediately after the archive was catalogued in 2012. There is also an article on the friendship and collaboration between Pitt Rivers and Rolleston.\nM. Nowak-Kemp and Y. Galanakis, Ancient Greek skulls in the Oxford University Museum, Part I: George Rolleston, Oxford and the formation of the human skulls collection. Journal of the History of Collections(2011) pp. 1–16. (Advance access copy available online from the Journal of the History of Collections and Oxford University Press)\nThe Wellcome Library holds further archival material relating to George Rolleston and the Rolleston family.\nRolleston's published papers were collated after his death by his colleagues William Turner and Edward Tylor (1884). Scientific Papers and Addresses by George Rolleston. Arranged and edited by William Turner, with a biographical sketch by Edward B. Tylor. Two volumes. Both volumes are available online from the Internet Archive. Volume 1; Volume 2.\nWilliam Greenwell, George Rolleston, British barrows, a record of the examination of sepulchral mounds in various parts of England. the Clarendon press. Together with description of figures of skulls, general remarks on prehistoric crania, and an appendix by George Rolleston. (Oxford, Clarendon Press, 1877). Available online from the Internet Archive.\nFind out more about:\nAlison Roberts\nMay 2013"
    },
    {
      "url": "https://archive.org/details/b21466403/page/n3/mode/2up",
      "text": "Catalogue of the specimens illustrating the osteology and dentition of vertebrated animals, recent and extinct, contained in the Museum of the Royal College of Surgeons of England. homo sapiens, Linn [electronic resource]\nBookreader Item Preview\nShare or Embed This Item\ntexts\nCatalogue of the specimens illustrating the osteology and dentition of vertebrated animals, recent and extinct, contained in the Museum of the Royal College of Surgeons of England. homo sapiens, Linn [electronic resource]\n- by\n- Flower, William Henry, Sir, 1831-1899; Royal College of Surgeons of England; University of Glasgow. Library\n- Publication date\n- 1907\n- Publisher\n- London : Taylor and Francis\n- Contributor\n- University of Glasgow Library\n- Language\n- English\n- Item Size\n- 494.2M\nThis material has been provided by The University of Glasgow Library. The original may be consulted at The University of Glasgow Library\nThe University of Glasgow Library\nThe University of Glasgow Library\n- Addeddate\n- 2015-02-03 13:49:05.39292\n- Associated-names\n- Royal College of Surgeons of England; University of Glasgow. Library\n- Bookplateleaf\n- 0004\n- Camera\n- Canon EOS 5D Mark II\n- Collection_added\n- medicallibrary\n- Crate\n- 28\n- External-identifier\n- urn:oclc:record:970803712\n- Foldoutcount\n- 0\n- Identifier\n- b21466403\n- Identifier-ark\n- ark:/13960/t3808bq4m\n- Invoice\n- 1008\n- Ocr_converted\n- abbyy-to-hocr 1.1.37\n- Ocr_module_version\n- 0.0.21\n- Openlibrary_edition\n- OL33069861M\n- Openlibrary_work\n- OL24878441W\n- Page-progression\n- lr\n- Page_number_confidence\n- 98\n- Page_number_module_version\n- 1.0.3\n- Pages\n- 470\n- Ppi\n- 350\n- Republisher_date\n- 20150217150815\n- Republisher_operator\n- associate-scott-greenberg@archive.org\n- Scandate\n- 20150212090028\n- Scanner\n- scribe1.euston.archive.org\n- Scanningcenter\n- euston\n- Shelfmark\n- Store 29157\n- Full catalog record\n- MARCXML\ncomment\nReviews\n365 Views\nDOWNLOAD OPTIONS\nFor users with print-disabilities\nIN COLLECTIONS\nUniversity of Glasgow Library UK Medical Heritage Library Medical Heritage Library European Libraries Medical LibraryUploaded by admin-chris-booth@archive.org on"
    },
    {
      "url": "https://www.livescience.com/difference-between-race-ethnicity.html",
      "text": "What's the difference between race and ethnicity?\nRace and ethnicity are terms that are sometimes used sloppily, almost interchangeably. But race and ethnicity are not the same thing.\nRace and ethnicity are both terms that describe human identity, but in different — if related — ways. Identity might bring to mind questions of skin color, nationality, language, religion, cultural traditions or family ancestry. Both race and ethnicity encompass many of these descriptors.\n\"'Race' and 'ethnicity' have been and continue to be used as ways to describe human diversity,\" said Nina Jablonski, an anthropologist and paleobiologist at The Pennsylvania State University, who is known for her research into the evolution of human skin color. \"Race is understood by most people as a mixture of physical, behavioral and cultural attributes. Ethnicity recognizes differences between people mostly on the basis of language and shared culture.\"\nRelated: Why did some people become white?\nIn other words, race is often perceived as something that's inherent in our biology, and therefore inherited across generations. Ethnicity, on the other hand, is typically understood as something we acquire, or self-ascribe, based on factors like where we live or the culture we share with others.\nBut just as soon as we've outlined these definitions, we're going to dismantle the very foundations on which they're built. That's because the question of race versus ethnicity actually exposes major and persistent flaws in how we define these two traits, flaws that — especially when it comes to race — have given them an outsized social impact on human history.\nNina G. Jablonski is a professor of Anthropology at Pennsylvania State University. Her research on human adaptations to the environment centers on the evolution of human skin and skin pigmentation, as well as understanding the history and social consequences of skin-color-based race concepts. She has published several books, including “Living Color: The Biological and Social Meaning of Skin Color” (University of California Press, 2014) and “Skin: A Natural History” (University of California Press, 2008), and has given a TED Talk, called “Skin Color is an Illusion.”\nWhat is race?\nThe idea of \"race\" originated from anthropologists and philosophers in the 18th century, who used geographic regions and phenotypic traits like skin color to place people into different racial groupings, according to Britannica. That not only cemented the notion that there are separate racial \"types\" but also fueled the idea that these differences had a biological basis.\nThat flawed principle laid the groundwork for the belief that some races were superior to others — which white Europeans used to justify the slave trade and colonialism, entrenching global power imbalances, as reported by University of Cape Town emeritus professor Tim Crowe at The Conversation.\nGet the world’s most fascinating discoveries delivered straight to your inbox.\n\"We can't understand race and racism outside of the context of history, and more importantly economics. Because the driver of the triangular trade [which included slavery] was capitalism, and the accumulation of wealth,\" said Jayne O. Ifekwunigwe, a medical anthropologist at the Center on Genomics, Race, Identity, Difference (GRID) at the Social Science Research Institute (SSRI), Duke University. She is also the associate director of engagement for the Center on Truth, Racial Healing & Transformation (TRHT) at Duke. The center is part of a movement across the United States whose members lead events and discussions with the public to challenge historic and present-day racism.\nThe effects of this history prevail today — even in current definitions of race, where there's still an underlying assumption that physical characteristics like skin color or hair texture have biological, genetic underpinnings that are completely unique to different racial groups, according to Stanford. Yet, the scientific basis for that premise simply isn't there.\n\"If you take a group of 1,000 people from the recognized 'races' of modern people, you will find a lot of variation within each group,\" Jablonski told Live Science. But, she explained, \"the amount of genetic variation within any of these groups is greater than the average difference between any two [racial] groups.\" What's more, \"there are no genes that are unique to any particular 'race,'\" she said.\nRelated: What are genes?\nJayne O. Ifekwunigwe is a senior research scholar in the Center for Genomics, Race, Identity, Difference at Duke University in Durham, North Carolina. As a critical and global ‘mixed race’ studies pioneer, Ifekwunigwe researches anthropological interpretations of both constructs of race as well as ‘mixed race’ and social interfaces between conceptualizations of biology and culture. Ifekwunigwe is author of “Scattered Belongings: Cultural Paradoxes of Race, Nation and Gender” (Routlege, 1999) as well as multiple journal papers.\nIn other words, if you compare the genomes of people from different parts of the world, there are no genetic variants that occur in all members of one racial group but not in another. This conclusion has been reached in many different studies. Europeans and Asians, for instance, share almost the same set of genetic variations. As Jablonski described earlier, the racial groupings we have invented are actually genetically more similar to each other than they are different — meaning there's no way to definitively separate people into races according to their biology.\nJablonski's own work on skin color, published in the journal Proceedings of the National Academy of Sciences in 2010, demonstrates this. \"Our research has revealed that the same or similar skin colors — both light and dark — have evolved multiple times under similar solar conditions in our history,\" she said. \"A classification of people based on skin color would yield an interesting grouping of people based on the exposure of their ancestors to similar levels of solar radiation. In other words, it would be nonsense.\" What she means is that as a tool for putting people into distinct racial categories, skin color — which evolved along a spectrum — encompasses so much variation within different skin color \"groupings\" that it's basically useless, she said during a TED Talk in 2009.\nWe do routinely identify each other's race as \"Black,\" \"white\" or \"Asian,\" based on visual cues. But crucially, those are values that humans have chosen to ascribe to each other or themselves. The problem occurs when we conflate this social habit with scientific truth — because there is nothing in individuals' genomes that could be used to separate them along such clear racial lines.\nIn short, variations in human appearance don't equate to genetic difference. \"Races were created by naturalists and philosophers of the 18th century. They are not naturally occurring groups,\" Jablonski emphasized.\nWhat is ethnicity?\nThis also exposes the major distinction between race and ethnicity: While race is ascribed to individuals on the basis of physical traits, ethnicity is more frequently chosen by the individual. And, because it encompasses everything from language to nationality, culture and religion, it can enable people to take on several identities. Someone might choose to identify themselves as Asian American, British Somali or an Ashkenazi Jew, for instance, drawing on different aspects of their ascribed racial identity, culture, ancestry and religion.\nEthnicity has been used to oppress different groups, as occurred during the Holocaust, or within interethnic conflict of the Rwandan genocide, where ethnicity was used to justify mass killings. Yet, ethnicity and ethnic groups can also be a boon for people who feel like they're siloed into one racial group or another, because it offers a degree of agency, Ifekwunigwe said.\n\"That's where this ethnicity question becomes really interesting, because it does provide people with access to multiplicity,\" she said. (That said, those multiple identities can also be difficult for people to claim, such as in the case of multiraciality, which is often not officially recognized.)\nEthnicity and race are also irrevocably intertwined — not only because someone's ascribed race can be part of their chosen ethnicity but also because of other social factors.\n\"If you have a minority position [in society], more often than not, you're racialized before you’re allowed access to your ethnic identity,\" Ifekwunigwe said. \"That's what happens when a lot of African immigrants come to the United States and suddenly realize that while in their home countries, they were Senegalese or Kenyan or Nigerian, they come to the U.S. — and they're Black.\" Even with a chosen ethnicity, \"race is always lurking in the background,\" she said.\nThese kinds of problems explain why there's a growing push to recognize race, like ethnicity, as a cultural and social construct, according to the RACE Project.\nYet in reality, it's not quite so simple.\nImpact of race and ethnicity\nRace and ethnicity may be largely abstract concepts, but that doesn't override their very genuine, real-world influence. These constructs wield \"immense power in terms of how societies work,\" said Ifekwunigwe. Defining people by race, especially, is ingrained in the way that societies are structured, how they function and how they understand their citizens: Consider the fact that the U.S. Census Bureau officially recognizes five distinct racial groups, according to the U.S. Census Bureau.\nThe legacy of racial categories has also shaped society in ways that have resulted in vastly different socioeconomic realities for different groups. That's reflected, for instance, in higher levels of poverty for minority groups, poorer access to education and health care, and greater exposure to crime, environmental injustices and other social ills. What's more, race is still used by some as the motivation for continued discrimination against other groups that are deemed to be \"inferior,\" the Southern Poverty Law Center explained.\n\"It's not just that we have constructed these [racial] categories; we have constructed these categories hierarchically,\" Ifekwunigwe said. \"Understanding that race is a social construct is just the beginning. It continues to determine people's access to opportunity, privilege and also livelihood in many instances, if we look at health outcomes,\" she said. One tangible example of health disparity comes from the United States, where data shows that African American women are more than twice as likely to die in childbirth compared with white women, the Census Bureau reported.\nPerceptions of race even inform the way we construct our own identities — though this isn't always a negative thing. A sense of racial identity in minority groups can foster pride, mutual support and awareness. Even politically, using race to gauge levels of inequality across a population can be informative, helping to determine which groups need more support, because of the socioeconomic situation they’re in. As the U.S. Census Bureau website explains, having data about people's self-reported race \"is critical in making policy decisions, particularly for civil rights.\"\nAll this paints a complex picture, which might leave us pondering how we should view the idea of race and ethnicity. There are no easy answers, but one thing is clear: While both are portrayed as a way to understand human diversity, in reality they also wield power as agents of division that don't reflect any scientific truths.\nScience does show us that across all the categories that humans construct for ourselves, we share more in common than we don't. The real challenge for the future will be to see that instead of our \"differences\" alone.\nAdditional resources\nFor a deeper understanding of how the U.S. government categorizes race and ethnicity, read \"Research to Improve Data on Race and Ethnicity,\" which traces how the Census bureau is working to keep up with individuals' understanding of their own identities. (Hint: It's usually complex.) The nonpartisan Pew Research Center has a landing page for its research and survey data related to race and ethnicity, which touches on topics as diverse as immigration, health, and education.\nAs is easy to imagine for such a hot topic, mountains of books have been written about issues around race and ethnicity. \"Superior: The Return of Race Science\" (Beacon Press, 2019) by Angela Saini Beacon tracks the history of scientific racism and the ways discredited ideas still influence scientific fields today. \"Genetics and the Unsettled Past: The Collision Between DNA, Race, and History\" (Rutgers University Press, 2013), is a scholarly look at how the field of genetics has complicated how we talk about genetics and history. Isabel Wilkerson's \"Caste: The Origins of our Discontents\" (Random House, 2020) explores how race and ethnicity are used to divide people into hierarchies.\nBibliography\nBibliography\n\"About the topic of race.\" U.S. Census Bureau. Dec. 3, 2021.\n\"Racism and Health.\" Centers for Disease Control and Prevention. November 24, 2021.\n\"What Racism Costs Us All.\" Finance & Development, International Monetary Fund. Fall 2020.\n(2014, July 31). A New African American Identity: The Harlem Renaissance. Smithsonian. https://nmaahc.si.edu/explore/stories/new-african-american-identity-harlem-renaissance\nRoberts, Frank Leon. (2018, July 13). How Black Lives Matter Changed the Way Americans Fight for Freedom. ACLU. https://www.aclu.org/blog/racial-justice/race-and-criminal-justice/how-black-lives-matter-changed-way-americans-fight\nWhite Nationalist. Southern Poverty Law Center. https://www.splcenter.org/fighting-hate/extremist-files/ideology/white-nationalist\nNewkirk II, Vann R. (2018, Feb. 28). Trump’s EPA Concludes Environmental Racism Is Real. The Atlantic. https://www.theatlantic.com/politics/archive/2018/02/the-trump-administration-finds-that-environmental-racism-is-real/554315/\nAmerican Psychological Association. Ethnic and Racial Minorities & Socioeconomic Status. https://www.apa.org/pi/ses/resources/publications/minorities\n(2019, June 10). Ethnic Cleansing. The History Channel. https://www.history.com/topics/holocaust/ethnic-cleansing\nSmedley, Audrey, The history of the idea of race. Britannica. Accessed April 9, 2022. https://www.britannica.com/topic/race-human/Scientific-classifications-of-race\nJablonski, Nina and Chaplin, George. (2010, May 5). Human skin pigmentation as an adaptation to UV radiation. PNAS. https://www.pnas.org/doi/10.1073/pnas.0914628107\nOriginally published on Live Science on Feb. 8, 2020 and updated on April 9, 2022.\nEmma Bryce is a London-based freelance journalist who writes primarily about the environment, conservation and climate change. She has written for The Guardian, Wired Magazine, TED Ed, Anthropocene, China Dialogue, and Yale e360 among others, and has masters degree in science, health, and environmental reporting from New York University. Emma has been awarded reporting grants from the European Journalism Centre, and in 2016 received an International Reporting Project fellowship to attend the COP22 climate conference in Morocco.\n- Stephanie PappasLive Science Contributor"
    },
    {
      "url": "https://www.cambridge.org/core/books/abs/british-barrows/general-remarks-upon-the-series-of-prehistoric-crania-by-dr-rolleston/BE1502F8C73E04F00AD16522DACE40C9",
      "text": "Published online by Cambridge University Press: 05 June 2015\nTo save this book to your Kindle, first ensure no-reply@cambridge.org is added to your Approved Personal Document E-mail List under your Personal Document Settings on the Manage Your Content and Devices page of your Amazon account. Then enter the ‘name’ part of your Kindle email address below. Find out more about saving to your Kindle.\nNote you can select to save to either the @free.kindle.com or @kindle.com variations. ‘@free.kindle.com’ emails are free but can only be saved to your device when it is connected to wi-fi. ‘@kindle.com’ emails can be delivered even when you are not connected to wi-fi, but note that service fees apply.\nFind out more about the Kindle Personal Document Service.\nTo save content items to your account, please confirm that you agree to abide by our usage policies. If this is the first time you use this feature, you will be asked to authorise Cambridge Core to connect with your account. Find out more about saving content to Dropbox.\nTo save content items to your account, please confirm that you agree to abide by our usage policies. If this is the first time you use this feature, you will be asked to authorise Cambridge Core to connect with your account. Find out more about saving content to Google Drive."
    },
    {
      "url": "https://www.livescience.com/archaeology/we-know-humans-arose-in-africa-but-archaeology-is-only-just-uncovering-secrets-of-the-continents-early-civilizations",
      "text": "We know humans arose in Africa, but archaeology is only just uncovering secrets of the continent's early civilizations\nSmall settlements and the scourge of slavery left gaps in Africa's archaeological record. Yet sites and artifacts are revealing clues to the continent’s more recent history. An archaeologist explains the findings and threats to this heritage.\nThe continent of Africa is recognized as the place where humankind originated and evolved over millennia. From famous ancestors like Lucy, the Australopithecus afarensis remains unearthed in Ethiopia in 1974, to the Turkana Boy, a Homo erectus fossil found in Kenya in 1984, archaeological evidence has shown time and again that Africa is the ultimate homeland of not just early hominins, but also modern Homo sapiens, who arose about 300,000 years ago and departed in successive waves to populate much of Earth.\nOf course, the story of humans in Africa doesn't end with their migration away from the mother continent. After all, many stayed put. But there's a big information gap. Although researchers have plumbed much of humankind's deep past, far less is known about what was happening across much of Africa at the time when permanent settlements were emerging elsewhere starting some 6,000 years ago: in places like Mesopotamia, for example, and later in China and India, as well as Egypt in Africa's northeastern tip.\nIn part, that's because African individuals did not cram together as closely as they did in more well-known cradles of civilization. So it's less likely that modern archaeologists will discover major towns or cities. Another factor is the slave trade that slashed a 400-year wound through African history and led many communities to be abandoned. Longstanding biases about the continent, too, have left the full story of Africa's cultures, trade and urbanism out of many history lessons.\nThat's starting to change. Recent advances in East African archaeology reveal advanced civilizations that established international trade relationships and developed powerful and practical technologies during the most recent 11,700 years — the Holocene Epoch — as Chapurukha M. Kusimba, an archaeologist at the University of South Florida in Tampa, describes in the 2024 Annual Review of Anthropology.\nKusimba, who grew up in Kenya and has regularly returned there for research, says East African archaeology is evolving as more Africans and women join the field. Knowable Magazine spoke with Kusimba about African civilization and the practice of archaeology there today, as well as threats new and old that the research must contend with — from ongoing demolition of ancient sites to make way for growing populations to recent funding cuts by US institutions that long supported such studies.\nThis conversation has been edited for length and clarity.\nRelated: 'Huge surprise' reveals how some humans left Africa 50,000 years ago\nGet the world’s most fascinating discoveries delivered straight to your inbox.\nI'd like to start with a question you raised in your review: Whose past is East African archaeology about?\nEast Africa is homeland to all of us. I've sometimes joked with Kenyan politicians that any human being entering Kenya should not have to present a passport, because they're actually coming home.\nI think when many of us think about East Africa, we think about the seminal work of anthropologists Louis and Mary Leakey on human origins, and the discovery of the hominin Lucy. But what do we know about the rise of civilization among modern humans, Homo sapiens, in Africa?\nThe human origins question has been settled, but we know precious little about the emergence of civilization in Africa.\nMost Holocene archaeologists define civilization, in part, in terms of settling down in one place, which happened elsewhere starting around 6,000 years ago. But I think in Africa, that model creates a major problem because Africa is so huge, and population numbers remained low, so it was very difficult to have a critical mass of people to congregate together. So you can't find many places in Africa that you can compare with, for example, the Near East.\nThat doesn't necessarily mean settlements didn't exist. But the jury's still out, because we don't have the kind of intensified site research that's been carried out in other places. And it's very difficult to conduct surveys, say, under the dunes of the Sahara Desert. That desert would have been much more habitable during the humid \"Green Savannah\" period 14,500 to 5,000 years ago, but it's just impossible to find sites under those massive sand dunes.\nWe do know of some sites. For example, people were settling together as early as 3000 BCE in the site of Kadero along the Nile. There is evidence of houses, stone tools, pottery and jewelry, as well as bones of people and domesticated animals.\nStill, Africanists can't compete with Mesopotamia, with Egypt, with Mesoamerica. The result is that when you pull out any book that teaches civilization, there is only a very small section devoted to sub-Saharan civilizations.\nSo what was going on in Africa as Mesopotamia and other regions were tending farms and building cities?\nThe African communities appear to have been mobile much longer. We think this is true because there are few sites of long-term settlement. The sites that are well preserved tend to be rock-shelter sites that were probably temporarily inhabited.\nNonetheless, these people were highly advanced; they ate well and lived healthy lives. For example, the Sangoan peoples of eastern and central Africa had advanced stone tool technologies and bone fishhooks. And there were people making carbon steel 2,000 years ago.\nThere is often a tendency to think of the European Stone Age as the first, the original, the most sophisticated phase of stone working. But you have stone tool technologies in modern-day Ethiopia and Kenya starting 2.8 to 3 million years ago, earlier than it began in Europe.\nOf course, the European Paleolithic tools were incredibly sophisticated, but the core stone was relatively easy to work; in contrast, African stone is much harder to work than European stone. If you give any modern flintknapper African rock, they immediately recognize how difficult it is. But Africans were using these very tough materials to make extremely sophisticated tools.\nAnd what happened when Africans finally started to settle down?\nIn most cases, permanent settlements appear in Africa 3,000 or 4,000 years after they did in places like the Near East. About 8,000 years ago, we begin to see more extensive evidence of settled life in modern-day western Kenya, eastern Uganda and the African Great Lakes region — and I think climate change might have been a reason behind that societal change. Suddenly, around 7,000 to 8,000 years ago you have a dry spell that lasts for about 700 years, and that's when you see the introduction of pastured livestock.\nSo Africans did get there eventually, but we don't see the real emergence of highly complex chiefdoms and societies, with more division of wealth, in much of Africa until about 2,500 years ago. That division of wealth is apparent in differences between households. Some have exotic items from distant places and most others didn't. Just like today, there are things that only elites can acquire. Most likely, they were gifts, given to grease the wheels of business for trade of desirable items.\nFor example, the port town of Mtwapa, near modern-day Mombasa, Kenya, was inhabited from about 1100 to 1750 CE. Wealthy inhabitants possessed multiroom homes with coral door frames and roof tiles, indoor plumbing and wells; poorer denizens lived in single-room homes of mud and wood, with grass or coconut thatch roofs. Wealthy citizens also reserved the right to the most sacred burial places, near a key religious site.\nFrom about 2,000 years ago, there were towns all over sub-Saharan Africa, including inland and along the coasts. But many African settlements were smaller in size compared to similar communities elsewhere. For example, the medieval site of Gedi, in modern-day Kenya, was massive by African standards, but at about 48 acres of built-up areas, it was much smaller than contemporary sites in India, China or the Near East. But we believe these sites were built and inhabited by Africans, not immigrants from other civilizations, because 96 percent of artifacts such as pottery, metals and beads found in those cities are of local origin.\nA perfect example of an advanced community, located inland, would be the region of Great Zimbabwe, which was inhabited from about the 11th to 15th centuries CE. It covered about 50,000 square kilometers, including early village settlements and a stone city built later. Great Zimbabwe is an amazing place, but the residential quarters were built out of mud, stone and thatch so they didn't preserve well archaeologically.\nHow did these societies interact with the rest of the world?\nMy work and the work of others shows that before the African slave trade, which reached the continent's interior with slave caravans starting in the 17th century, Africans were trading with other cultures. We've found glass and carnelian beads of Indian origin in every archaeology site in sub-Saharan Africa. Chinese and Indian historians also describe the presence of African mariners in their own towns, so the trade was bidirectional: Africans traded ivory and gold for products such as Chinese porcelain and Indian cloth.\nCrops were also exchanged. For example, sorghum is a traditional African crop. It's hard to date its origins, but it was being cultivated in Africa from at least the fourth millennium BCE. And it arrives in places like India later. Meanwhile, the banana, first domesticated in southeast Asia, arrived in central Africa more than a thousand years ago.\nAnd Africans were trading as equals. Here's one reason I think so: From at least 800 CE, there is clear evidence that people were engaging in the ivory trade, but they traded in mostly cut ivory. This allowed them to weigh it, grade it, and assign value consistent with quality. Cut ivory was also easier to transport from inland to trade partners on the coast. Before the slave trade Africans financed and were in charge of the ivory and other industries.\nLater, around the 1500s when smaller-scale slave trading began in some regions, that evidence disappears and you begin to see transportation and sale of whole, unprocessed ivory tusks. Similarly, around that time, the evidence of industries such as iron smelting and weaving disappears. The emergence of slavery led to loss of control of their own industries. Work is outsourced, and materials such as cloth are imported. So as people lose skills and become more dependent on external trade, you begin to see a real decline in the political economy of these places.\nHow else did the slave trade impact African civilizations?\nThe 400 years of slavery had a huge, huge effect on this continent. Africans were being invaded both from the Islamic world and, of course, the Western world.\nUp to that point, communities had settled in comfortable places, such as plains and valleys. There are numerous abandoned settlements with single-household villages, but also remnants of crops such as mangoes, oranges and rice in what is now the Tsavo National Park. These communities provided food to more urban cities along the coasts.\nBut then, suddenly, they all disappeared. From around the 1450s up to the time of the colonial period beginning in the 1870s, we have found little evidence of new, permanent buildings in the interior of Africa — why is nothing being constructed there? In Tsavo, for example, people migrated to uninhabitable but defensible lands, such as hillsides and mountains, for safety. They could not go back to the plains because they were not safe.\nAs these events were happening inland, we also begin to see the abandonment of the coastal towns. They lost their inland food supply. Prior to the slave trade, there were 250 thriving towns in Kenya and Somalia alone. By the time the 400 years of slavery are over, there were, perhaps, less than 10 of those towns still being sustainably inhabited.\nSlavery and the slave trade led to a loss of knowledge, of power, of memory. This violent gap that history created would open Africa for others to exploit while also conveniently blaming Africans for not being innovative, for not having industries, for not contributing much to global history, even though they did have advanced societies and technologies.\nYet despite this, I think we must credit Africans for their resilience. Despite the genocide that they experienced, they're still standing.\nHow has East African archaeology changed over your career?\nI'm now in my 60s. In my time, there were a handful of African-born archaeologists, probably fewer than five. But today the number of African-born archaeologists, most of whom are our students, has grown. It's rare to see a major paper on East Africa that does not include African authors — though, unfortunately perhaps, the names of those in leadership positions, such as museum directors and department chairs, are often on these publications, which creates the impression that young scientists who do most of the research are not being fully acknowledged.\nOn the other hand, in Europe and the United States, there has been a huge increase in the number of women archaeologists. Obviously, during the colonial period, most of the archaeologists were men, and perhaps they were not much interested in questions of gender dynamics in prehistoric societies. Today most active North American archaeologists working in East Africa are women.\nThis presents a lot of opportunities: For the first time, we have a moment in which women can have a real footprint in the kinds of topics they want to pursue — for example, what role did prehistoric African women play in shaping these societies?\nBut there are also challenges for these scholars, because there are parts of East Africa and elsewhere where it might be much harder for women leading an expedition to get the kind of respect they richly deserve and have earned.\nWhat would you like to see archaeologists in East Africa pursue in the future?\nWe are in the news all the time with major discoveries — but most of the time, it's new information about large sites that are already well known, and that have been studied since the colonial period. A lot of studies are being done on museum collections in Europe and North America, too. Many of these artifacts were collected during the colonial period and are often criticized today because some of them were looted from their original locations, and many people think these artifacts should be returned to their original countries. We are not seeing surveys and descriptions of new sites, and that concerns me.\nI think that East African archaeology is very much tied to global climate change, and this is something that is really important to us today. If you look at the history of people living in East Africa for 4 million years: What did they do to survive? How did they cope with climate change? We could learn a lot from that research.\nMany sites that have been all but forgotten, but deserve attention, are Homo erectus sites. Homo erectus is, anatomically, our direct ancestor. They lived from about 1.9 million to 110,000 years ago. Homo erectus is credited with learning to manage fire, which may have enabled their kind to leave Africa and inhabit other parts of the world. We've seen so many advances in biochemistry and in the study of ancient DNA, and I hope these techniques could be applied to Homo erectus sites to reveal more than we know now. But their rapid destruction in Kenya is alarming.\nWhat other sites have been lost, or are at risk?\nThe Leakeys did a great job in sensitizing East Africans to their long past and their responsibility to care for that history. You can go to any part of Tanzania, Kenya or Ethiopia and find people who are proud of that past, who welcome archaeologists to do all kinds of research.\nBut we are also dealing with population growth. When I was young, Kenya's population was about 8 million, then 15 million, and now it is more than 55 million. There's been similar population explosions in Tanzania, in Uganda, in Rwanda, in Burundi, in Ethiopia. And these people must live somewhere. As in the past many people have migrated. And they move into new areas where they are less emotionally engaged in local histories; they destroy archaeological sites that hold the histories and sacred knowledge of earlier residents.\nSo we have lost a lot of urban sites along the east coast of Africa. I think we archaeologists need to communicate their importance better, and these nations need to manage the heritage sites better. If we can conserve some of these sites, we can make our case for their future study. If we don't, we will fail future generations of young men and women who want to be archaeologists.\nWill East African archaeology be able to continue in the face of such threats, including the loss of those sites and funding woes?\nMost African governments, with the exception of South Africa and Egypt, do not have dedicated funds for this kind of research. The bulk of funding for archaeology has always come from the United States and Europe. For example, the US National Science Foundation has been one of the engines that funded a lot of archaeology research around the world, but US funding of research has been slashed recently.\nI think that those moments of change are very important, not only for people in East Africa, but for the rest of us. These funding cuts are very tragic, but this research is very important, and despite threats to supporting research on our origins, I remain optimistic that we'll find a way to continue research of the deep history of humankind in East Africa.\nThis article originally appeared in Knowable Magazine, a nonprofit publication dedicated to making scientific knowledge accessible to all. Sign up for Knowable Magazine’s newsletter.\nEditor's note: This article was updated at 12:07 p.m. on August 19th to correct the date of carbon steel invention.\nAmber Dance is an award-winning freelance science writer based in Southern California. She is a contributor at Knowable Magazine, program director for the New Horizons in Science Briefings at the Sciencewriters annual conference for the Council for the Advancement of Science Writing and an instructor teaching Science Writing I for UCLA Extension.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://en.wikisource.org/wiki/1911_Encyclop%C3%A6dia_Britannica/Craniometry",
      "text": "1911 Encyclopædia Britannica/Craniometry\nCRANIOMETRY. The application of precise methods of measurement marks a definite phase in the development of most branches of modern science, and thus craniometry, a comprehensive expression for all methods of measuring the skull (cranium), provides a striking landmark in the progress of anthropological studies. The origin of craniometry appears to be twofold. Certain artists made measurements of heads and skulls with a view to attaining greater accuracy in their representation of those parts of the human frame. Bernard de Palissy and A. Dürer may be mentioned as pioneers in such researches. Again, it is clearly shown in the literature of this subject, that anatomists were led to employ methods of measurement in their study of the human skull. The determining cause of this improvement in method is curious, for it appeared at the end of a famous anatomical controversy of the later middle ages, namely the dispute as to whether the Galenic anatomy was based on the study of the human body or upon those of apes. In the description of the dissection of a chimpanzee (in 1680) Tyson explains that the measurements he made of the skull of that animal were devised with a view to exhibiting the difference between this and the human skull.\nThe artists did not carry their researches very far. The anatomists on the contrary continued to make measurements, and in 1764 Daubenton published a noteworthy contribution to craniometry. Six years later, Pieter Camper, distinguished both as an artist and as an anatomist, published some lectures containing an account of his craniometrical methods, and these may be fairly claimed as having laid the foundation of all subsequent work. That work has been described above as anthropological, but as the studies thus defined are very varied in extent, it is necessary to consider the subdivisions into which they naturally fall.\n| Fig. 1.—The Skull and head of a young orang-utan, and of a negro, showing the lines including the facial angle (MGND) devised by Pieter Camper. |\nIn the first place (and omitting further reference to the contributions of artists), it has been explained that the measurements were first made with a view to elucidating the comparison of the skulls of men with those of other animals. This wide comparison constitutes the first subdivision of craniometric studies. And craniometric methods have rendered the results of comparison much more clear and comprehensible than was formerly the case. It is further remarkable that among the first measurements employed angular determinations occur, and indeed the name of Camper is chiefly perpetuated in anthropological literature by the “facial angle” invented by that artist-anatomist (fig. 1). It appears impossible to improve on the simple terms in which Camper describes the general results of the employment of this angle for comparative purposes, as will appear from the following brief extract from the translation of the original work: “The two extremities of the facial line are from 70 to 80 degrees from the negro to the Grecian antique: make it under 70, and you describe an ourang or an ape: lessen it still more, and you have the head of a dog. Increase the minimum, and you form a fowl, a snipe for example, the facial line of which is nearly parallel with the horizon.” (Camper’s Works, p. 42, translated by Cogan, 1821.)\nIn the 19th century the names of notable contributors to the literature of craniometry quickly increase in number; while it is impossible to analyse each contribution, or even record a complete list of the names of the authors, it must be added that for the purposes of far-reaching comparisons of the lower animals with mankind, craniometric methods were used by P. P. Broca in France and by T. H. Huxley (figs. 2 and 3) in England, with such genius and success as have not yet been surpassed.\nThe second division of craniometric studies includes those in which the skulls of the higher and lower races of mankind are compared. And in this domain, the advent of accurate numerical methods of recording observations brought about great advances. In describing the facial angle, it will be seen that the modern European, the Greek of classical antiquity and the Negro are compared. Thus it is that Camper’s name appears as that of a pioneer in this second main division of the subject. Broca and Huxley cultivated similar comparative racial fields of research, but to these names that of Anders Retzius of Stockholm must be added here. The chief claim of Retzius to distinction rests on the merits of his system of comparing various dimensions of the skull, and of a classification based on such comparisons. These indices will be further defined below. It is convenient to mention here that the first aim of all these investigators was to obtain from the skull reliable data having reference to the conformation or size of the brain once contained within it. Only in later days did the tendency to overlook this, the fundamental aim and end of craniometry, make its appearance; such nevertheless was the case, much to the detriment of craniometric science, which for a time seems to have become purely empirical.\nThe third subdivision of craniometric researches is one in which the field of comparison is still further narrowed. For herein the various sub-racial types such as the dark and fair Europeans are brought together for the purposes of comparison or contrast. But although the range of research is thus narrowed and restricted, the guiding principles and the methods remain unchanged. In this department of craniometry, Anders Retzius has gained the foremost place among the pioneers of research. Retzius’s name is, as already mentioned, associated not with any particular angle or angular measurement, but rather with a method of expressing as a formula two cranial dimensions which have been measured and which are to be compared. Thus for instance one skull may be so proportioned that its greatest width measures 75% of its greatest length (i.e. its width is to its length as three to four).\n| From Tylor's Anthropology, by permission of Macmillan & Co., Ltd. |\n| Fig. 4.—Top view of skulls. (A) Negro, index 70, dolichocephalic; (B) European, index 80, mesaticephalic; (C) Samoyed, index 85, brachycephalic. |\nThis ratio (of 75%) is termed the cephalic or breadth-index, which in such an instance would be described as equal to 75. A skull providing a breadth-index of 75 will naturally possess very different proportions from another which provides a corresponding index equal to 85. And in fact this particular index in human skulls varies from about 58 to 90 in undistorted examples (fig. 4). Such is the general scheme of Retzius’s system of classification of skulls by means of indices, and one of his earliest applications of the method was to the inhabitants of Sweden. One striking result was to exhibit a most marked contrast in respect of the breadth-index of the skull, between the Lapps and their Scandinavian neighbours, and thus a craniometric difference was added to the list of characters (such as stature, hair-colour and complexion) whereby these two types were already distinguished. Since the publication of Retzius’s studies, the cephalic or breadth-index of the skull has retained a premier position among its almost innumerable successors, though it is of historical interest to note that, while Retzius had undoubtedly devised the method of comparing “breadth-indices,” he always qualified the results of its use by reference to other data. These qualifications were overlooked by the immediate successors of Retzius, much to the disadvantage of craniometry. In addition to the researches on the skull forms of Lapps and Swedes, others dealing with the comparison of Finns and Swedes (by Retzius) as well as the investigation of the form of skull in Basques and Guanches (by Broca) possess historic interest.\n| Fig. 5.—Callipers used in Craniometry, Professor Martin’s (P. Hermann, Zürich) model. |\n| Fig. 6.—Flower’s Craniometer as modified by Dr W. L. H. Duckworth. |\nThus far little or nothing has been said with regard to instruments. Camper devised a four-sided open frame with cross-wires, through which skulls were viewed and by means of which accurate drawings could be projected on to paper. The methods of Retzius as here described require the aid of callipers of various sorts, and such instruments were quickly devised and applied to the special needs of the case. Such instruments are still in use, and two forms of simple craniometer are shown in the accompanying illustrations (figs. 5 and 6). For the more accurate comparison required in the study of various European types, delicate instruments for measuring angles were invented by Anthelme in Paris (1836) and John Grattan in Belfast (1853). These instruments enabled the observer to transmit to the plane surface of a sheet of drawing paper a correct tracing of the contour of the specimen under investigation. A further modification was devised by the talented Dr Busk in the year 1861, and since that date the number and forms of these instruments have been greatly multiplied. With reference to contributors to the advance of knowledge in this particular department of craniometry, there should be added to the foregoing names those of Huxley, Sir W. H. Flower and Sir W. Turner in England, J. L. A. de Quatrefages in France, J. C. G. Lucae and H. Welcker in Germany. Moreover, the methods have also been multiplied, so that in addition to angular and linear measurements, those of the capacity or cubical contents of the cranium and those of the curvature of its surface demand reference. The masterly work of Cleland claims special mention in this connexion. And finally while two dimensions are combined in the cephalic index of Retzius, the combination of three dimensions (in a formula called a modulus) distinguishes some recent work, although the employment of the modulus is actually a return to a system devised in 1859 by Karl E. von Baer.\nThe fourth subdivision of craniometry is closely allied to that which has just been described, and it deals with the comparison of the prehistoric and the recent types of mankind. The methods are exactly similar to those employed in the comparison of living races; but in some particular instances where the prehistoric individual is represented only by a comparatively minute portion of the skull, some special modifications of the usual procedures have been necessitated. In this field the works of W. His and L. Rütimeyer on the prehistoric races of Switzerland, those of Ecker (South Germany), of Broca in France, of Thurnam and Davis in England, must be cited. G. Schwalbe, Kramberger, W. J. Sollas and H. Klaatsch are the most recent contributors to this department of craniometry.\n| Fig. 8.—The facial angle of the Frankfort Agreement is shown in the crania of:—A, a New Guinea native (male) 75°; B, a European (woman) 93°; C, a new-born infant (93°). |\nThus the complexity of craniometric studies has inevitably increased. In the hands of von Török of Budapest, as in those of M. Benedikt of Vienna at an earlier date, the number of measurements regarded as necessary for the complete “diagnosis” of a skull has reached a colossal total. Of the trend and progress of craniometry at the present day, three particular developments are noteworthy. First come the attempts made at various times to co-ordinate the systems of measurements so as to ensure uniformity among all observers; of these attempts two, viz. that of the German anthropologists at Frankfort in 1882 (figs. 7 and 8), and that of the Anthropometric Committee of the British Association (1906) seem to require at least a record. In the second place, the application of the methods of statistical science in dealing with large numbers of craniometric data has been richly rewarded in Prof. Karl Pearson’s hands. Thirdly, and in connexion with such methods, there may be mentioned the extension of these systems of measurement, and of the methods of dealing with them on statistical principles, to the study of large numbers of the skulls of domestic and feral animals, such as white rats or the varieties of the horse. And lastly no account of craniometry would be complete without mention of the revolt, headed by the Italian anthropologist Sergi, against metrical methods of all kinds. It cannot, however, be alleged that the substitutes offered by the adherents of Sergi’s principles encourage others to forsake the more orthodox numerical methods.\nLiterature.—Tyson, The Anatomy of a Pygmie (London, 1699); Daubenton, “Sur la différence de la situation du tron occipital dans l’homme et dans les animaux,” Comptes rendus de l’académie des sciences (Paris, 1764); Camper, Works (1770, translated by Cogan, 1821); Broca, Mémoires (1862 and following years); Huxley, Journal of Anatomy and Physiology, vol. 1 (1867); Retzius, Über die Schädelformen der Nordbewohner (Stockholm, 1842); Anthelme, Physiologie de la pensée (Paris, 1836); Grattan, Ulster Journal of Archaeology, vol. 1 (1853); Busk, “A System of Craniometry,” Transactions of the Ethnological Society (1861); Flower, Catalogue of the Hunterian Museum, Osteology, part 1 (London, 1879); Turner, “‘Challenger’ Reports,” Zoology, vol. x. pt. 29, “Human Crania” (1884); de Quatrefages, Crania ethnica (Paris, 1873); Lucae, Architectur des menschlichen Schädels (Frankfort, 1855); Welcker, Bau und Wachsthum des menschlichen Schädels (1862); Cleland, “An Inquiry into the Variations of the Human Skull,” Phil. Trans. Roy. Society (1870), vol. 160, pp. 117 et seq.; von Baer, “Crania selecta,” Académie impériale des sciences de S. Pétersbourg (1859); His and Rütimeyer, Crania Helvetica (Basel, 1866); Ecker, Crania Germaniae meridionalis (1865); Thurnam and Davis, Crania Britannica; von Török, Craniometrie (Stuttgart, 1890); Benedikt, Manuel technique et pratique d’anthropométrie cranio-céphalique (Paris, 1889); Pearson, Biometrika, from vol. 1 (in 1902) onwards; Sergi, “The Varieties of the Human Species,” English translation, Smithsonian Institution (Washington, 1894); Schwalbe, “Der Neanderthalschädel,” Bonner Jahrbücher, Heft 106; also Sonderheft der Zeitschrift für Morphologie und Anthropologie; Kramberger, Der paläolithische Mensch von Krapina (Nägele, Stuttgart, 1901); Sollas, “The Cranial Characters of the Neanderthal Race,” Phil. Transactions of the Royal Society, vol. 199, Series B, p. 298, 1908; Klaatsch, “Bericht über einen anthropologischen Streifzug nach London,” Zeitschrift für Ethnologie, Heft 6, 1903, p. 875.\nHandbooks.—Topinard, Éléments d’anthropologie générale (Paris, 1885); Schmidt, Anthropologische Methoden (Leipzig, 1888); Duckworth, Morphology and Anthropology (Cambridge, 1904).\nJournals.—Bulletins de la Société d’Anthropologie de Paris, Journal of the Royal Anthropological Institute of Great Britain and Ireland, Archiv für Anthropologie, Zeitschrift für Morphologie und Anthropologie. (W. L. H. D.)"
    },
    {
      "url": "https://www.degruyterbrill.com/document/doi/10.7208/9780226481104-022/html?lang=en&srsltid=AfmBOoq6rWKsH0JQTlcGyaDOp-Qouw1MfJaZG0N9Voq2NJj2ppEvbjhr",
      "text": "Chapter\nLicensed\nUnlicensed\nRequires Authentication\n20. Metrology, Metrication, and Victorian Values\n-\nSimon Schaffer\nYou are currently not able to access this content.\nYou are currently not able to access this content.\nChapters in this book\n- Frontmatter i\n- Contents v\n- Acknowledgments vii\n- Introduction 1\n-\nPART ONE. DEFINING KNOWLEDGE\n- 1. Defining Knowledge: An Introduction 15\n- 2. The Construction of Orthodoxies and Heterodoxies in the Early Victorian Life Sciences 24\n- 3. The Probable and the Possible in Early Victorian England 51\n- 4. Victorian Economics and the Science of Mind 72\n- 5. Biology and Politics: Defining the Boundaries 94\n- 6. Redrawing the Boundaries: Darwinian Science and Victorian Women Intellectuals 119\n- 7. Satire and Science in Victorian Culture 143\n-\nPAR T TWO. Ordering Nature\n- 8. Ordering Nature: Revisioning Victorian Science Culture 179\n- 9. \"The Voices of Nature\": Popularizing Victorian Science 187\n- 10. Science and the Secularization of Victorian Images of Race 212\n- 11. Elegant Recreations? Configuring Science Writing for Women 236\n- 19. Strange New Worlds of Space and Time: Late Victorian Science and Science Fiction 256\n-\nPART THREE. Practicing Science\n- 13. Practicing Science: An Introduction 283\n- 14. Wallace's Malthusian Moment: The Common Context Revisited 290\n- 15. Doing Science in a Global Empire: Cable Telegraphy and Electrical Physics in Victorian Britain 312\n- 16. Zoological Nomenclature and the Empire of Victorian Science 334\n- 17. Remains of the Day: Early Victorians in the Field 354\n- 18. Photography as Witness, Detective, and Impostor: Visual Representation in Victorian Science 378\n- 19. Instrumentation and Interpretation: Managing and Representing the Working Environments of Victorian experimental Science 409\n- 20. Metrology, Metrication, and Victorian Values 438\n- Contributors 475\n- Index 477\nChapters in this book\n- Frontmatter i\n- Contents v\n- Acknowledgments vii\n- Introduction 1\n-\nPART ONE. DEFINING KNOWLEDGE\n- 1. Defining Knowledge: An Introduction 15\n- 2. The Construction of Orthodoxies and Heterodoxies in the Early Victorian Life Sciences 24\n- 3. The Probable and the Possible in Early Victorian England 51\n- 4. Victorian Economics and the Science of Mind 72\n- 5. Biology and Politics: Defining the Boundaries 94\n- 6. Redrawing the Boundaries: Darwinian Science and Victorian Women Intellectuals 119\n- 7. Satire and Science in Victorian Culture 143\n-\nPAR T TWO. Ordering Nature\n- 8. Ordering Nature: Revisioning Victorian Science Culture 179\n- 9. \"The Voices of Nature\": Popularizing Victorian Science 187\n- 10. Science and the Secularization of Victorian Images of Race 212\n- 11. Elegant Recreations? Configuring Science Writing for Women 236\n- 19. Strange New Worlds of Space and Time: Late Victorian Science and Science Fiction 256\n-\nPART THREE. Practicing Science\n- 13. Practicing Science: An Introduction 283\n- 14. Wallace's Malthusian Moment: The Common Context Revisited 290\n- 15. Doing Science in a Global Empire: Cable Telegraphy and Electrical Physics in Victorian Britain 312\n- 16. Zoological Nomenclature and the Empire of Victorian Science 334\n- 17. Remains of the Day: Early Victorians in the Field 354\n- 18. Photography as Witness, Detective, and Impostor: Visual Representation in Victorian Science 378\n- 19. Instrumentation and Interpretation: Managing and Representing the Working Environments of Victorian experimental Science 409\n- 20. Metrology, Metrication, and Victorian Values 438\n- Contributors 475\n- Index 477"
    },
    {
      "url": "https://www.bbc.co.uk/future/article/20240118-is-it-ever-ethical-for-museums-to-display-human-remains",
      "text": "Toward the end of the 1800s, as European settlers continued to encroach on the land of the Bunuba people in what is now Western Australia, Jandamarra became a legendary leader of the resistance. The colonial police searched for him for three years, finally hiring another Aboriginal tracker to find him.\nIn 1897, the police shot, killed and beheaded Jandamarra. He was around 24 years old. His skull was then sent, as a grisly colonial trophy, to a private museum of a gun factory in Birmingham, UK. The factory was demolished in the 1960s, and Jandamarra's skull disappeared. Bunuba elders and researchers have been trying for decades to find the skull of this celebrated freedom fighter. The whereabouts remain unknown.\nWhile Jandamarra has become a revered Bunuba figure, museums around the world house the physical remnants of numerous other people – many of whom are anonymous. Increasingly, museums are reckoning with their responsibilities for exhibiting or retaining these, and in some cases considering returns, as descendant communities and others call for more dignity in the treatment of human remains.\nWhat counts as human remains\nDefining human remains within museums (or even using the term \"human remains\") is not straightforward. The UK's Human Tissue Act, for example, does not apply to nails and hair, and only requires consent for the use of human remains from people who died within the last 100 years. However, some UK museums take a broader definition.\nInternational standards vary as well. When the Human Remains Working Group of the German Museums Association drew up its first guidelines in 2013, \"for our recommendations, it really didn't matter if a person died 100 years ago or 1,000 years ago\", says ethnologist Wiebke Ahrndt, the chair of the working group. Human remains were defined as all physical remains of Homo sapiens, including hair, teeth or nails that may not have been attached to the person at the time of collection.\nAhrndt explains that certain items were ruled out for practical reasons, such as grave goods and photos of humans, although for certain cultures these also carry special significance. Thus, the National Museum of Scotland has removed all images of (unwrapped) human remains from its online database.\nLike many museums worldwide, the Pitt Rivers Museum in the UK is currently in the process of decolonising its displays (Credit: Getty Images)\nDifferent cultures also have different beliefs about how human remains should be treated. Ahrndt gives the examples of Tibetan musical instruments made using human bones, and skulls embedded within religious objects in Haitian voodoo traditions. However, in many cultural traditions, to separate or disturb body parts is deeply harmful.\nAnother area of debate is whether it's permissible to exhibit human bodies as long as they're completely enclosed. A good example is Egyptian mummies, which are often \"seen more as artefacts than as people\", says Lewis McNaught, whose curatorial work has included a stint in the British Museum's Department of Egyptian Antiquities. Though these mummies are ancient and often have no body parts exposed, there is an ongoing discussion about whether displaying these humans continues to objectify them, without increasing genuine understanding. (The British Museum was approached for comment, but did not reply before publication.)\nChanging attitudes\nEdward Halealoha Ayau is a lawyer who has spent 35 years advocating for the repatriation of Native Hawaiian ancestors from cultural institutions. When he and his colleagues started this work, museums displaying human remains were not considering the ethics of doing so.\nA sea change has occurred since then, says Ayau. \"There's been a [shift in the] maturity of views with regard to human remains.\"\nWhen Ahrndt, the director of the Übersee-Museum in Bremen, Germany, came to the museum over 20 years ago, shrunken heads from South America were on display without explanation or respect for their sensitivity. They were there just for the spectacle, Ahrndt felt, and those were \"the first thing I put in storage\". This was followed by mummy bundles with visible skulls from Peru.\nThe museum explained its reasoning for no longer exhibiting these remains, and there was no backlash. While some museums fear a slippery slope of starting to question and relinquish items, which might end with near-empty collections, that certainly hasn't been the Übersee-Museum's experience, says Ahrndt. Its changing policies around human remains have had no effects on visitor numbers or museum funding, she says.\nNow, amid conversations around colonial legacies and responsibilities, there's actually more pressure from the German public and the media to speed up the repatriation of human remains acquired in colonial contexts. \"What we realised in the last decade is that the attitudes of visitors in regard to sensitive material have changed,\" Ahrndt says.\nThe American Museum of Natural History has announced it is removing all human remains from display, and committed to reviewing its repatriation procedures (Credit: Getty Images)\nToday's museum visitors may not understand why repatriation can take such a long time. While some museums have used legal loopholes to delay the process, in other cases more time is necessary to respect indigenous groups' decision-making processes. Communities of origin face very complex and emotional decisions on what to do with returned remains, says Ahrndt. For instance, two Toi moko (tattooed Māori heads) that the Übersee-Museum offered in 1999 to the Museum of New Zealand Te Papa Tongarewa, in Wellington, were finally handed over in 2006.\nOne key consideration with human remains in museums is the manner in which they entered the collection. If it's known that they were acquired illegally or unethically, Ahrndt believes that they shouldn't be presented to the public in any way. In the Übersee-Museum's experience, the human remains that have now been repatriated were not initially collected in good faith. \"They were against the will of the people,\" says Ahrndt. \"They were stolen, they were dug out, at nighttime.\"\nIn Ayau's opinion, since consent cannot be presumed, museums have the responsibility never to display people who are deceased. He points out that when family members pass away and they are buried, for example, it is not with the intent that one day they will be put on display.\nToday there's also more scrutiny of whether there genuinely is any scientific or other academic value to retaining human remains. And where there may be an argument for scientific merit, that is now increasingly weighed against other considerations, including the dignity of the person and the wishes of the community of origin.\nMany of the human bodies in Western museums ended up there as justifications for colonialism and scientific racism. The examples are numerous, even just from early-20th-Century incidents.\nIn Sweden, where Sami women were forcibly sterilised and eugenics research conducted, Sami bones and skulls remain in a number of museums. Human remains were taken from German colonies, then transported to museums, in the false belief that they demonstrated white superiority. In the early 20th Century, an anthropologist at the National Museum of Natural History in Washington (NMNH), DC, collected hundreds of body parts particularly from poor and vulnerable people both within the US and abroad, for what he called the \"racial brain collection\" and \"racial collection of pelvises\".\nA representative from the Smithsonian Institution, which administers the NMNH, told the BBC: \"The Smithsonian has been returning human remains since 1984. Since then, we've focused on returning Native remains, in line with the National Museum of the American Indian Act of 1989. In 2024, we are focusing on non-native remains. In May of last year, the Smithsonian named 13 members for its task force on human remains, which focused on crafting recommendations that address the future of the Institution's human remains collection. The task force is wrapping up its recommendations to the Secretary, who will issue a revised human remains policy in the next six to 12 months.\"\nUntil 2020, the Pitt Rivers Museum, in Oxfordshire, UK, had South American tsantsa – sometimes referred to as shrunken heads – on display. McNaught, the editor of Returning Heritage, a website about cultural restitution, describes the museum as previously being a \"very Victorian museum environment\". However, the museum has now removed 120 human remains from display. This includes the tsantsa, which may have originally come from three Jivaroan peoples, including the Shuar ethnic group. According to the Pitt Rivers Museum website: \"The decision was taken to remove the tsantsa from public display because it was felt that the way they were displayed did not sufficiently help visitors understand the cultural practices related to their making and instead led people to think in stereotypical and racist ways about Shuar culture.\"\nTsantsa made by the Shuar ethnic group, who live in the Ecuadorian and Peruvian Amazon, have now been taken off display at the Pitt Rivers Museum in the UK (Credit: Alamy)\nWhile it's clear that many museums acquired human parts under pseudoscientific premises, some argue that there are scientifically valid reasons for continuing to display them. For example, in the British Museum, near the delicate bones and skeleton of a young child from ancient Egypt who had the genetic disorder osteogenesis imperfecta, otherwise known as \"brittle bone\" disease, a sign discusses the role of human remains in studying ancient diseases.\nThe UK's Natural History Museum, which is open to continuing to collect human remains, maintains for instance that the chemical signatures of bones and teeth can help to shed light on past population movements. Additionally, skeletal analyses can help to improve the identification techniques used by forensic anthropologists. Some curators believe that technological advancements in the future may allow for more scientific applications for the body parts in museums today.\nA representative from the Natural History Museum said \"…the Human Tissue Act 2004 requires procedures for consent from the person whose remains were being researched if they died within the last 100 years. And proposals for the public display of remains are subject to approval following consideration of relevant legal, regulatory, ethical and other issues.\"\nOne approach is to remove a controversial human exhibit from public view, but to keep the remains in storage for possible scientific use. McNaught is sceptical of arguments for keeping bodies indefinitely, as DNA samples can be taken now and then the body respectfully returned or buried.\nHowever, not everyone agrees with this approach. London's Hunterian Museum has the remains of an Irish man with gigantism who died in 1783 within its collection. Before his death, Charles Byrne reportedly went to great lengths to prevent his body from being acquired by anatomists. In the end, the surgeon whom the museum was named after intervened. Byrne's remains were taken off display before the museum reopened after refurbishment in 2023. According to the museum's website, the skeleton \"will be retained as it is an integral part of the Hunterian Collection and will be available for bona fide research into the conditions of acromegaly and gigantism\".\nHow to treat human remains with dignity\n\"It's really now common practice to review and consider returning human remains,\" says McNaught. This has gained the most ground in some Western countries, which in McNaught's view are far more exposed because of the scale of the looting and removal of human remains that occurred in the past.\nHowever, this is more of a challenge in some former colonial powers in Western Europe. For example, historically French law has made it difficult for public institutions to return portions of their collections. In Ayau's experience of seeking repatriation of Native Hawaiian ancestors, \"the country that is probably most challenging is France\". It is hoped that recent changes to the law may speed up the process.\nMany Western museums have collections that have been shaped by colonialism (Credit: Getty Images)\nAdditionally, some museums are struggling with their own cataloguing and records, which may be unwieldy. \"There are still far too many human remains in in public collections which we can't even identify where they came from, let alone whether they could be returned to their homeland,\" McNaught says. \"I think we are still scratching the surface.\" Indeed, Ayau says of tracing ancestral remains: \"Every time we think we're finished, we're finding more.\"\nWhere a return does happen, it can be a form of healing or reconciliation. Ayau has seen it stir up strong emotions from museum representatives, not just communities of origin: \"The emotion of repatriation impacts all,\" he says.\nThe Übersee-Museum's public handover ceremonies have included signing of the official handover documents and the historical \"Golden Book\" in the Bremen town hall. They have also included apologies from Ahrndt, as the museum director, and the Bremen mayor.\n\"They took reconciliation very seriously,\" Ayau recollects of the ceremony he took part in, which was livestreamed. \"It was a great example for others.\"\nThese kinds of apologies aren't hard for Ahrndt. \"The question was more what will actually follow out of that.\" Ideally repatriation is not the end of a relationship between museums and descendant communities.\nFor instance, in 2017, following the Übersee-Museum's handover of Māori and Moriori remains, partners in New Zealand expressed a desire to work together on cultural projects in the future. Ahrndt agreed but didn't think it was likely, given limited funding.\nHowever, five years later, the Übersee-Museum sourced funding for a new exhibition in partnership with the Museum of New Zealand, Te Papa Tongarewa. \"That was very touching, for both sides,\" Ahrndt reflects. \"Now I can say, five years later, repatriation is not the end. It is, in fact, the beginning of something new.\"\nThe Übersee-Museum continues to display Egyptian mummy bundles. For now its South American shrunken heads remain in storage, where they are accessible to researchers who have a strong scientific case for accessing them. There needs to be a good rationale for exhibiting people, Ahrndt says. \"You always should think: 'Could I tell my story also without the human remains?'\"\nAnd the situation is always changing. Amid continuing controversy, the British Museum and the Smithsonian Institution are both reviewing their human remains policies.\n\"In a couple of years colleagues will come and say we need new guidelines, and then another generation will rewrite them completely,\" Ahrndt says. \"I'm absolutely sure about that.\" To remain relevant, museums are always changing in line with scientific and societal shifts.\n\"We're in a watershed period between the old colonial-type museum, which after all was built to celebrate our colonial history, and brought back trophies from India and Africa and elsewhere, and a future museum environment where there will be no human remains on display,\" says McNaught.\n--\nIf you liked this story, sign up for The Essential List newsletter – a handpicked selection of features, videos and can't-miss news delivered to your inbox every Friday.\nJoin one million Future fans by liking us on Facebook, or follow us on Twitter or Instagram."
    },
    {
      "url": "https://www.livescience.com/health/racism-is-a-global-public-health-crisis-author-layal-liverpool-says-racist-ideas-still-pervade-medicine-and-that-hurts-all-of-us",
      "text": "'Racism is a global public health crisis': Author Layal Liverpool says racist ideas still pervade medicine, and that hurts all of us\nIn a new book, Layal Liverpool discusses how addressing racial biases in medicine and upending ideas like the \"inferior Black pelvis\" will lead to a healthier world.\nRacism pervades health care systems across the world, putting patients' health and lives at risk. In \"Systemic: How Racism is Making Us Ill\" (Bloomsbury Circus, 2024), science journalist Layal Liverpool shows how people of all socioeconomic statuses experience racism in health care, as exemplified by the widely covered story of Serena Williams' complications after childbirth, for instance. The book traces the historical legacy of racial inequities in medicine and reveals disturbing trends that still persist in medical education and research.\nLiverpool worked in biomedical research at the University of Oxford and University College London, specializing in the study of viruses and the immune system before becoming a journalist.\nIn \"Systemic,\" she draws from both sides of her expertise to highlight the stories of people who are working to close the pervasive, racialized gaps that persist in health care, education and research.\n\"I really do think there are reasons for hope — for optimism,\" Liverpool told Live Science. \"I think that by recognizing that racism is behind so much unfairness in health, it means we can begin to tackle the problem.\"\nLive Science spoke with Liverpool about her new book and what she hopes readers will take away from it.\nNicoletta Lanese: It seems like representation in the sciences and health inequalities were major focuses of your journalism from the start — would you say that's true?\nGet the world’s most fascinating discoveries delivered straight to your inbox.\nLayal Liverpool: I think initially, it was kind of the opposite. Maybe I felt like, \"I don't want to be pigeonholed as this Black journalist who covers race,\" for example, even though I actually think these issues are so important.\nAfter a while I felt like I just couldn't not report on these issues, especially in 2020 during the COVID pandemic — there [were] just huge health inequities. I really wanted to be able to contribute to that discussion and also to contribute my kind of scientific background to analyzing those things and helping to hopefully explain those inequalities. I think that was also something that inspired me — that when I saw inequities, I thought maybe, by telling stories or by unveiling the data, I can try to make some kind of positive change or drive some changes, even in a small way.\nNL: You made a point there about drawing forth the data and putting it out on a platform. In your book, I'm also appreciating how you place these big statistics in the context of people's real stories. Did you feel that was important?\nLL: Statistics can be quite overwhelming and also impersonal. At the same time, I think data is so important. Obviously, as a science journalist, I rely on studies, research data a lot. And I think it was a balance, because sometimes I think people's experiences are kind of delegitimized or questioned because of a lack of data or understanding.\nI thought it was important to have that there, to kind of validate people's experiences. But at the same time, I really wanted people to feel the kind of human stories here.\nNL: In some of the stories you're bringing to light very antiquated ideas that seem to still plague medical science — I was wondering if any really surprised you?\nLL: I recently became a mom, so I've been thinking a lot about maternal health recently and think one … that kind of stood out is these ideas about pelvic anatomy. The idea that Black women's pelvises are shaped differently to white women's, for example, or Indigenous women have different pelvises and that these might somehow be \"inferior.\"\nA lot of these ideas are traced back to even the 1800s, where there were researchers in the U.K., for example — there was an anatomist called William Turner who was trying to classify pelvises into subtypes and decided that African pelvises were different and inferior, even, to the pelvises of European women at the time. Inferior for childbirth, let's say. Obviously, this is pseudoscience, but I found that shocking, that some of those classifications have still made their way into medical textbooks that are used today. I think, thankfully, this is increasingly being challenged.\nThat was something that for me was really hopeful when I was writing the book. I had a feeling that, speaking to people working in medicine and research, that there was a strong motivation to kind of challenge these ideas and almost audit the assumptions that are embedded into medical practices and sometimes even guidelines.\nNL: I'm thankful that you're feeling optimistic after reporting the book — I'm wondering if there are any particular people or organizations making meaningful changes that stick out in your brain?\nLL: There are a lot of people who really inspired me [while] writing the book. I think an example I'd give is Naomi Nkinsi. She's a [now-graduated] medical student based in the U.S., so we connected across the Atlantic because we were working on similar things. She has been working to campaign against the use of race adjustment in medical tech. This is a practice where, in diagnosis or in treatment decisions, race is being incorporated sometimes into algorithms to guide those clinical decisions. And as a medical student, she was being taught about kidney function testing and how race is used, in particular.\nThere's an adjustment for Black race that was really widespread in the U.S., but also in the U.K. And I was quite inspired [by] how, as just a medical student, she felt confident to challenge that. She said, \"We've learned that race is a social construct. Why is race being used? Why are you telling us that Black people's kidneys work differently to white people's? This doesn't really chime with what we've learned in our physiology lectures.\"\nRelated: Geneticist Adam Rutherford on how eugenics, 'Darwin's monster,' took over the world\nSo she questioned her teachers and that led to a series of events where eventually her medical school — that was UW Medicine in the University of Washington — they removed the use of race adjustment in their hospital. Then there were a few other hospitals across the U.S. who started to remove it, and then eventually, there was a consensus established against that in the U.S. by the National Kidney Foundation and the American Society for Nephrology.\nIn the U.K., in parallel, I was reporting on this issue and NICE, the National Institute for Health and Care Excellence in the U.K. They also published guidelines and I had come across a study here in the U.K. showing that the use of race adjustment for kidney function tests … is harmful for Black patients. And so, sharing that study with NICE and asking them to comment, eventually they came back to me and said that they've decided to update their guideline.\nThat's not due to me, only to my reporting, but also [due] to work from researchers who are doing studies to demonstrate the harms of race-based medicine. I think it's really great to see that kind of change.\nNL: I think your answer touched on a major theme in the book, where you're looking at drawing that line between this historical construct of race as this inherent biological feature, versus what we now know it to be practically and how it impacts medicine. Do you have any tips for readers as to how they should interpret news about studies that suggest race is a \"risk factor\" for a given disease?\nLL: The scientific consensus is clear that race is a social construct; it doesn't have a place in terms of biology. But of course, as you said, there's a long history — a context of trying to sometimes even justify enslavement or oppression of people, colonization in the past — where I think there was an incentive within science to construct this biological idea of race.\nAnd unfortunately, I think that still sometimes makes its way into research today. Something that I saw, for example, during COVID: There was a lot of effort to look for the gene to explain why, let's say, in the U.K., Black people [and] people of South Asian ethnicity were at more risk from COVID. Similarly in the U.S.\nI think genetics is a fascinating study. I think it's really important; we should fund that research. But I think that when it comes to looking at racial inequalities in health, often, the more simple explanation is the correct one.\nI think it's so important that we remember that racism is the cause of racial and ethnic health gaps. Because otherwise, it creates this feeling — like for me as a Black woman in the U.K., I'm four times more likely to die during pregnancy or childbirth compared to a white woman. That can create a feeling as if there's something inherently wrong with my body, that there's something wrong with Black people's bodies or the bodies of people of color. When in fact, that's not the case. The evidence really shows that it's living in a racist society that is affecting people's health.\nNL: You mentioned hoping to see this book in medical schools — having it reach up-and-coming doctors, essentially. I'm wondering if you had any other intended audiences for the book?\nLL: So I actually would like this book to reach everyone.\nClearly, this is horrific for those of us who are most marginalized, but I also make the case that it's terrible for all of us. I think racism is a global public health crisis. It permeates medicine, science, as we've talked about; it makes our healthcare systems unfair and inefficient.\nAnd it also makes medical research less effective for all of us. So I think this is an issue that everyone should care about. It affects us all.\nEditor's note: This interview has been condensed and edited for clarity.\nEver wonder why some people build muscle more easily than others or why freckles come out in the sun? Send us your questions about how the human body works to community@livescience.com with the subject line \"Health Desk Q,\" and you may see your question answered on the website!\n\"Systemic: How Racism Is Making Us Ill\" by Layal Liverpool is available now — $30 on Amazon\nIf you enjoyed this interview, you can learn more in Layal Liverpool's new book. In it, she delves into the reasons racial health disparities exist and reveals that diseases are not \"great equalizers\" — not when you live in an unequal society. She shows how the widespread adoption of new, anti-racist medical standards will be central in creating a healthier world for everyone.\nNicoletta Lanese is the health channel editor at Live Science and was previously a news editor and staff writer at the site. She holds a graduate certificate in science communication from UC Santa Cruz and degrees in neuroscience and dance from the University of Florida. Her work has appeared in The Scientist, Science News, the Mercury News, Mongabay and Stanford Medicine Magazine, among other outlets. Based in NYC, she also remains heavily involved in dance and performs in local choreographers' work."
    },
    {
      "url": "https://hunterianmuseum.org/news/statement-on-the-skeleton-of-charles-byrne-from-the-board-of-trustees-of-the-hunterian-collection",
      "text": "11th January 2023\nStatement on the skeleton of Charles Byrne from the Board of Trustees of the Hunterian Collection\nThe best-known human anatomical specimen in the collection of 18th century surgeon anatomist John Hunter is the skeleton of Charles Byrne. Byrne had an undiagnosed benign tumour of his pituitary gland, an adenoma, which caused acromegaly and gigantism. He lived with these conditions and grew to be 7’7’’ (2.31m) tall. In the last years of his life he made a living exhibiting himself as the ‘Irish Giant’. He died in 1783 and it has been said that to prevent his body being seized by anatomists he wanted to be buried at sea. Before Byrne could be buried, Hunter intervened, paying Byrne’s friends £500 for his body. Three years later Hunter displayed Byrne’s skeleton in his Leicester Square museum and part of it is shown in the background of the portrait of Hunter by Sir Joshua Reynolds.\nJohn Hunter (1728-1793) and other anatomists and surgeons of the 18th and 19th centuries acquired many specimens in ways we would not consider ethical today and which are rightly subject to review and discussion.\nDuring the period of closure of the Museum the Board of Trustees of the Hunterian Collection discussed the sensitivities and the differing views surrounding the display and retention of Charles Byrne’s skeleton. The Trustees, with the approval of the Council of the Royal College of Surgeons of England, agreed that:\n- Charles Byrne’s skeleton will not be displayed in the new Hunterian Museum.\n- The skeleton will be retained as it is an integral part of the Hunterian Collection and will be available for bona fide research into the conditions of acromegaly and gigantism.\n- A new programme called Hunterian Provocations will begin soon to promote new research and explore issues around the display of human remains and the acquisition of specimens during British colonial expansion\nFAQ about Charles Byrne’s skeleton\nQ1: Why is Charles Byrne’s skeleton controversial?\nA1: Charles Byrne was born in Littlebridge near Lough Neagh in the north of Ireland in 1761. He lived with the conditions known today as acromegaly and gigantism. He grew to be 7’7’’ (2.31m) tall and in the last years of his life made a living exhibiting himself as the ‘Irish Giant’ in Edinburgh and London. He died in 1783 and it was said that to prevent his body being seized by anatomists he wanted to be buried at sea.\nBefore Byrne could be buried John Hunter intervened and is reported to have paid Byrne’s friends £500 for his body. Three years later Hunter displayed Byrne’s skeleton in his Leicester Square museum and part of it is shown in the background of the portrait of Hunter by Sir Joshua Reynolds.\nQ2: What makes the skeleton of Charles Byrne such an important osteological specimen?\nA2: Osteo means bone (as in osteoarthritis) and osteology is the study of the form and function of bones. In basic anatomy, the skeleton is the foundation of learning about animals’ bodies.\nCharles Byrne’s skeleton is a very rare specimen showing the effects of an untreated pituitary adenoma, causing acromegaly and gigantism from excessive bone growth.\nIt is a significant specimen in the Hunterian collection, the largest anatomy collection in England to survive from the 18th century.\nQ3: Why will Charles Byrne's skeleton not be displayed in the new Hunterian?\nA3: During the five-year period of closure of the Hunterian Museum, the Board of Trustees of the Hunterian Collection reviewed and discussed the sensitivities and the differing views surrounding the display and retention of Charles Byrne’s skeleton. The Trustees, with the approval of the Council of the Royal College of Surgeons of England, agreed that\nCharles Byrne’s skeleton will not be displayed in the new Hunterian Museum.\nThe skeleton will be retained as it is an integral part of the Hunterian Collection and will be available for bona fide research into the conditions of acromegaly and gigantism.\nQ4: Has the Royal College of Surgeons of England chosen to ignore Charles Byrne’s last wishes?\nA4: Decisions about the display and care of the Hunter collection rest with the Board of Trustees of the Hunterian Collection, appointed by the British Government in 1799, and not directly with the Royal College of Surgeons of England.\nThe anecdotal references to Charles Byrne’s wishes are well documented although no written evidence exists.\nThe Trustees of the Hunterian Collection recognise the sensitivities and the differing views surrounding the display and retention of Charles Byrne’s skeleton.\nThe importance of Hunter’s Collection rests in its entirety. The skeleton of Charles Byrne is an integral part of the collection (RCSHC/osteo 223) and is therefore covered by these conditions.\n*The responsibilities of the Corporation of Surgeons (later the Royal College of Surgeons of England) and the Board of Trustees of the Hunterian Collection were set out in the Terms and Conditions of 1799:\nParagraph 3 ‘That the preparations shall be kept in a state of Preservation, and the collection in as perfect a state as possible, at the Expense of the Corporation of Surgeons, subject to the annual inspection and superintendence of the Trustees’.\nQ5: Where will the skeleton be stored if it will not displayed in the museum?\nA5: The skeleton is kept in store at the Royal College of Surgeons of England at Lincoln’s Inn Fields under Department for Culture, Media & Sport (DCMS) guidelines on best practice for the care of human remains.\nQ6: What sort of scientific research will be carried out on Charles Byrne’s remains?\nA6: We cannot foresee the ways in which gene and bone analysis technologies may develop that could allow greater understanding of the causes of pituitary acromegaly and gigantism.\nPrevious research was undertaken in the early 20th century by the American pioneer of neurosurgery Harvey Cushing. In the early 21st century, DNA analysis by endocrinologist Professor Marta Korbonits and her team at Queen Mary University of London linked a living person with pituitary acromegaly and Charles Byrne through a common ancestor.\nQ7: When will future multidisciplinary projects be undertaken?\nA7: In the autumn of 2023 RCS England Museums will launch a new programme of research, collaborations and events called ‘Hunterian Provocations’ which seeks to address issues surrounding the display of human remains and the practice of acquisition of specimens for museums, power imbalances and the exploitation of peoples and natural environments during British colonial expansion."
    },
    {
      "url": "https://www.livescience.com/archaeology/alien-skull-of-toddler-is-actually-evidence-of-long-standing-practice-of-head-shaping",
      "text": "'Alien' skull of toddler is actually evidence of long-standing practice of head shaping\nWorkers digging a pipeline in Argentina found the flattened skull of an ancient toddler, raising questions about its asymmetrical shape.\nWhile installing a water pipeline in Argentina last month, workers stumbled upon the skull of a child who was buried at least 700 years ago. The archaeological discovery quickly garnered media attention because of the asymmetry of the skull, drawing comparisons to aliens.\nBut the flattening on the back of the skull, which belonged to a 3- to 4-year-old child, is simply the result of the cultural practice of head shaping, Cristian Sebastián Melián, director of the Provincial Directorate of Anthropology in Catamarca, Argentina, told Live Science in a translated email.\nThe skull was found on May 27 in the town of San Fernando del Valle de Catamarca in northwestern Argentina. When archaeologists investigated the pits made in the infrastructure project, they found broken and burned llama remains, along with a ceramic vessel typical of pottery from the Inca occupation there between 1430 and 1530, Melián said.\nBut the child's skull was found several feet away along with the rest of the skeleton, which was placed in the grave in the fetal position. Although the child had no grave goods, pottery fragments in the dirt suggested a date of death around 1100 to 1300.\nThe archaeologists did not see any trauma on the child's skeleton, but they noted the \"pronounced cultural cranial alteration of the oblique tabular type,\" Melián said.\nThe practice of head shaping, or cranial modification, dates back thousands of years and has been found in all parts of the world. While some cultures used long stretches of cloth wrapped around a baby's head to create an elongated shape, others applied padding to the front or back of the baby's head to create a flatter shape. Nowadays, often for medical purposes, parents may employ a special helmet to ensure their baby has a round, symmetrical head.\nRelated: 'Cone-headed' skull from Iran was bashed in 6,200 years ago, but no one knows why\nGet the world’s most fascinating discoveries delivered straight to your inbox.\nThe child's skull found in San Fernando was likely shaped using padding to encourage the \"oblique tabular\" shape, which is flat or sloping at the front and back of the skull. This practice can cause the sides of the skull to widen and appear bulged.\nMost scholars of ancient head shaping agree that the practice had few, if any, negative health consequences. Instead, experts say the practice was linked to social identity or to child-rearing preferences.\nCurrently, the Provincial Directorate of Anthropology has more than 100 skulls from ancient people in its skeletal collection, Melián said, and evidence of head shaping is extremely common.\n\"Approximately 90% of them have an erect or oblique tabular shape\" to their skulls, Melián said.\nKristina Killgrove is a staff writer at Live Science with a focus on archaeology and paleoanthropology news. Her articles have also appeared in venues such as Forbes, Smithsonian, and Mental Floss. Kristina holds a Ph.D. in biological anthropology and an M.A. in classical archaeology from the University of North Carolina, as well as a B.A. in Latin from the University of Virginia, and she was formerly a university professor and researcher. She has received awards from the Society for American Archaeology and the American Anthropological Association for her science writing.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://archive.org/details/b28119381/page/n3/mode/2up?view=theater",
      "text": "Catalogue of the specimens illustrating the osteology and dentition of vertebrated animals, recent and extinct : contained in the Museum of the Royal College of Surgeons of England\nBookreader Item Preview\nShare or Embed This Item\ntexts\nCatalogue of the specimens illustrating the osteology and dentition of vertebrated animals, recent and extinct : contained in the Museum of the Royal College of Surgeons of England\n- Publication date\n- 1879\n- Publisher\n- London : Printed for the College and sold by David Bogue\n- Collection\n- wellcomelibrary; ukmhl; medicalheritagelibrary; europeanlibraries; medicallibrary\n- Contributor\n- Wellcome Library\n- Language\n- English\n- Item Size\n- 1.3G\npt. 1. Man: Homo sapiens, Linn, by W. H. Flower.--pt. 2. Class Mammalia, other than Man, by W. H. Flower and J. G. Garson.--pt. 3. Class Aves, by R. B. Sharpe\nNotes\nCopyright in the title page.\n- Addeddate\n- 2016-06-20 07:54:36\n- Associated-names\n- Flower, William Henry, 1831-1899\n- Collection_added\n- medicallibrary\n- External-identifier\n- urn:oclc:record:1040545641\n- Foldoutcount\n- 0\n- Identifier\n- b28119381\n- Identifier-ark\n- ark:/13960/t1ng9dk18\n- Invoice\n- 1008\n- Ocr_converted\n- abbyy-to-hocr 1.1.37\n- Ocr_module_version\n- 0.0.21\n- Page-progression\n- lr\n- Page_number_confidence\n- 94\n- Page_number_module_version\n- 1.0.5\n- Pages\n- 298\n- Ppi\n- 300\n- Republisher_date\n- 20160709093856\n- Republisher_operator\n- ken@archive.org\n- Republisher_time\n- 318\n- Scandate\n- 20160627215935\n- Scanner\n- ttscribe4.euston.archive.org\n- Scanningcenter\n- euston\n- Full catalog record\n- MARCXML\ncomment\nReviews\n327 Views\nDOWNLOAD OPTIONS\nFor users with print-disabilities\nIN COLLECTIONS\nWellcome Library UK Medical Heritage Library Medical Heritage Library European Libraries Medical LibraryUploaded by associate-rosie-curran@archive.org on"
    },
    {
      "url": "https://www.livescience.com/archaeology/oddly-shaped-head-left-in-italian-cave-12-500-years-age-is-europes-oldest-known-case-of-cranial-modification-study-finds",
      "text": "'Oddly shaped head' left in Italian cave 12,500 years ago is Europe's oldest known case of cranial modification, study finds\nA Stone Age skull discovered in a cave in Italy is the oldest evidence of artificial cranial modification ever found in Europe.\nA prehistoric skull discovered half a century ago in an Italian cave is the oldest example of artificial cranial modification ever discovered in Europe, new research reveals. The unusually long skull, which is about 12,500 years old, confirms that this practice dates back to at least the Stone Age.\n\"Body modification — including cranial shaping — was one of many strategies used by past societies to construct and communicate identity, status, and belonging,\" study co-author Irene Dori, a bioarchaeologist at the University of Florence, told Live Science in an email.\nIn the new study, published July 30 in the journal Scientific Reports, researchers analyzed a skull from Arene Candide Cave, a Late Upper Paleolithic site on the northwestern coast of Italy. Between about 12,900 and 11,600 years ago, generations of hunter-gatherers used the cave to bury their dead. In the 1940s, archaeologists found dozens of human skeletons at the site, and most had been rearranged after death in an ancient ritual. One particular skull of an adult male, called AC12, was discovered in a niche on top of another burial.\nIn the 1980s, researchers suggested that the long, narrow skull of AC12 may have been the result of a disease or accident that altered the growth of the skull when the man was a child.\nBut Dori and colleagues were intrigued by another potential explanation: artificial cranial modification. For the new research, they virtually reconstructed the skull and statistically demonstrated that the best explanation for the \"oddly shaped head\" of AC12 was childhood body modification, they wrote in the study.\nThe practice of artificial cranial modification involves applying pressure to an infant's head during growth and development. When done consistently for months or years, this results in a permanent reshaping of the person's skull. It is unclear whether the practice would have affected the person's brain function.\nThe AC12 skull had been reconstructed and glued together in the 1970s, so the researchers had to take it apart to properly measure the skull fragments. They opted to do this nondestructively by performing CT scans of the skull and virtually separating the bones. Then, the researchers digitally reconstructed AC12 in four ways and used a technique called geometric morphometrics, which quantifies the biological shape of a bone, to compare the virtual reconstructions to skulls from around the world.\nGet the world’s most fascinating discoveries delivered straight to your inbox.\nRelated: 'Cone-headed' skull from Iran was bashed in 6,200 years ago, but no one knows why\nAll of the results of this analysis revealed that AC12 was similar to other artificially modified skulls rather than to normal skulls or those affected by disease or trauma. Specifically, the shape of the AC12 skull was probably made by wrapping strips of fabric tightly around the circumference of his head, the study authors said.\n\"This would be the earliest known case of artificial cranial modification in Europe,\" the researchers wrote in the study, as the bones have been dated to between 12,190 and 12,620 years ago.\nThe reasoning behind the practice of artificial cranial modification is still unknown, and its meaning probably varied among the cultures that performed it.\n\"Cultural body modification was likely an ancient and widespread practice,\" Dori said, and \"it may have been one of the several practices used to express identity and transmit social norms.\" At Arene Candide, there is also evidence from people's teeth that they decorated their faces with cheek plugs. But because the skeletons are very fragmentary, Dori said, it is unclear how common artificial cranial modification was.\nOne idea the researchers are investigating is whether AC12 was somehow different from others buried in the Stone Age cemetery. Analysis of the Arene Candide skeletons' DNA is ongoing, Dori said, and it could shed light on possible long-distance migration or genetic affiliation with other groups.\nBut artificial cranial modification has been practiced around the world. The oldest example from Asia dates to about 11,200 years ago, while the oldest example in Australia is from 13,500 years ago. Although the practice may be best known from Central and South America, where it was performed for almost 10,000 years, it \"has its roots in the Palaeolithic,\" the researchers wrote.\n\"It is possible that this practice arose independently in different regions,\" Dori said, as a practice \"rooted in shared human tendencies to use the body as a medium of expression.\" But given the number of modified skulls throughout Eurasia, \"the available evidence does not allow us to determine definitively whether cranial modification was independently invented or culturally transmitted between groups,\" Dori said.\nStone Age quiz: What do you know about the Paleolithic, Mesolithic and Neolithic?\nKristina Killgrove is a staff writer at Live Science with a focus on archaeology and paleoanthropology news. Her articles have also appeared in venues such as Forbes, Smithsonian, and Mental Floss. Kristina holds a Ph.D. in biological anthropology and an M.A. in classical archaeology from the University of North Carolina, as well as a B.A. in Latin from the University of Virginia, and she was formerly a university professor and researcher. She has received awards from the Society for American Archaeology and the American Anthropological Association for her science writing.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://exhibitions.ed.ac.uk/exhibitions/mind-shift/",
      "text": "The work of Edinburgh phrenologists excluded Black people from narratives of civilization and progress. Not everyone agreed with phrenology and these racist theories did not go unchallenged by Black scholars, both in Edinburgh and beyond.\nMind Shift\nConfronting a colonial collection\nThe University's Anatomical Museum holds one of the largest and most historically significant collections relating to phrenology in the world. Now discredited, phrenology was a science of measurement which promoted a colonial agenda, situating Edinburgh as a centre for scientific racism in the 19th century.\nThis exhibition, of life and death masks, models, artworks and human remains, spotlights contemporary historical, scientific and artistic research into this colonial collection.\nWhat is Phrenology?\nDerived from the Greek words φρήν and λόγος meaning “mind” and “knowledge”, phrenology involved the study of bumps and hollows of the skull, believing they indicated a person's character, personality, or intelligence. The differently-coloured regions on this model are numbered to correspond to areas of the brain that were thought to have certain attributes relating to instinct, sentiment, perception and reflection.\nPress ‘Full Information’ below for the qualities that phrenologists associated with each region.\n|\nSocieties and their Collections\nPhrenological societies collected life and death masks, skulls and skull casts from individuals across society to support their theories. These included famous authors, politicians, and military figures, as well as known criminals, people of different races, or people with mental illness. Confirmation bias often reinforced their theories but, in some cases, analysis was not what the phrenologists expected.\nUse the arrows to explore a selection of masks and casts from the collection.\n|\n|\nBell was executed aged fourteen as punishment for killing another child. After his death, phrenologists made this death mask and his body was given to the surgeons of Rochester for dissection. Murderers like Bell were thought to have pronounced organs of destructiveness (the instinct to kill) and underdeveloped organs of benevolence (the sentiment producing kindness).\n|\nOrnithologist, artist, and a strong believer in phrenology, Audubon’s major work The Birds of America (1827-29), a colour-plate book, is still considered one of the finest works on ornithology ever produced. Phrenologists asserted that his \"Organs of form, size, weight, colour, sociality and individuality – the principle observing faculties, most necessary to a painter, are all well developed\".\n|\nBonaparte was a French military and political leader. He was a critic of phrenology: \"it is an ingenious fable, which might seduce the gens du monde [fashionable people], but could not stand the scrutiny of the anatomist\". His death mask was prepared by his physician François Carlo Antommarchi (1780-1838). Napoleon’s phrenological reading was not particularly complimentary: \"A precise and sensible mind, but little capable of high conceptions.. On the whole, a sound, well-developed intelligence, but nowise approaching to genius: general aptitude for a variety of subjects, but only to a feeble degree\".\n|\nBurke and William Hare murdered 16 people to supply cadavers for dissection to the Edinburgh anatomist Dr Robert Knox. Burke's hanged body was dissected by Professor Alexander Monro tertius and his skeleton became part of the Anatomical Museum collection. The analysis of his brain surprised the phrenologists. Burke’s organ of destructiveness (the instinct to kill) was not well developed, while his organ of benevolence (the sentiment producing kindness) was larger than expected.\nPhrenology in Edinburgh\nAlready a historically significant and leading city for the teaching and advancement of Western medicine for over 400 years, Edinburgh became the principal centre for the study of phrenology in Britain in the 19th century.\nWhile not officially taught as an academic subject, phrenology was supported and discussed by several influential figures in science and medicine whose close connections with the University gave it legitimacy and prestige.\nUses the arrows to learn more about some of these supporters.\n|\nGeorge and Andrew Combe, brothers from Edinburgh, were both educated at the University. George became a firm believer in phrenology after attending a lecture by Johann Gasper Spurzheim, one of phrenology’s founders. The brothers founded the Edinburgh Phrenological Society in 1820 and a museum was set up to display their growing collection of life and death masks.\n|\nIn 1887 Sir William Turner arranged the transfer of the Edinburgh Phrenological Society’s original collection into the newly built medical school and museum at Teviot Place. Previously a senior demonstrator in the department of Anatomy for 13 years, Turner succeeded Sir John Goodsir as Professor of Anatomy in 1867, eventually becoming the University’s Principal in 1903.\nMost of the skulls in the Anatomical Museum today were assembled by Turner. Craniology, which involved measuring the angle of the face, the size of the braincase, or the ratio of the length to the breadth of the head, were used by academics like Turner to classify people into racial groupings, to make claims about alleged differences in intelligence, and to study human variation. Because of its prominence in Britain and abroad, skulls continued to be sent to the University into the early 20th century to formulate racist theories in other fields.\n|\nOver the course of the nineteenth century, many University graduates wrote about and discussed the subject of phrenology, including George Murray Paterson, the Scottish physician and surgeon for the East India Company; John William Jackson, an anthropologist and Fellow of the Anthropological Society of London; and Sir George Steuart Mackenzie, a geologist, chemist and agriculturalist. Two former medical students, in particular, had significant, albeit different, impact beyond Edinburgh.\nSamuel George Morton, an American physician and anatomy professor, trained at the University until 1823. Influenced by phrenology, Morton is regarded as the founder of \"American School\" ethnography which claimed the difference between humans was one of species. Morton’s work was referenced by phrenologist James Hunt, who published a pamphlet during the American Civil War arguing that Black people were intellectually inferior to Europeans and destined to remain in the subservient positions that Morton’s work described.\nCharles Darwin considered Morton an authority on the subject of race. As a student between 1825 and 1827, a young Darwin participated in phrenological discussions at the Plinian Society, a University club for students interested in natural history. He made this observation in the same notebook as his groundbreaking theories about natural selection: \"One is tempted to believe phrenologists are right about habitual exercise of the mind altering form of head, & thus these qualities become hereditary.\" Charles Darwin (1838) The M Notebook.\nThe Abolitionist\nFrederick Douglass was born into slavery in Maryland, USA, but went on to become a famous public speaker, philosopher, intellectual and self-liberated freedom fighter. A frequent visitor to Edinburgh between 1845 and 1847, he campaigned across Britian and Ireland against slavery for freedom and social justice.\nDouglass was acquainted with phrenology in Edinburgh, visiting George Combe alongside abolitionists George Thompson and William Lloyd Garrison and reading Combe’s Constitution of Man. In 1854, Frederick Douglass hit out at phrenology, arguing that in their comparisons phrenologists “invariably present the highest type of the European, and the lowest type of the negro.” Once again linking phrenology directly to slavery, Douglass concluded “by making the enslaved a character fit only for slavery, they excuse themselves for refusing to make the slave a freeman.”\nDouglass is also one of the inspirations behind the artist's commission for this exhibition: Tayo Adekunle's Fitting the Character.\n|\nEdinburgh's First African Graduate\nJames ‘Africanus’ Beale Horton was born in Sierra Leone. Following the British War Office’s idea to train Africans in medicine, Horton was among the first Africans to be sent to Britain to study for a medical degree in 1853.\nAround a third of Horton’s 1868 work, West African Countries and Peoples, British and Native: and a Vindication of the African Race, is dedicated to the discussion of race, anatomy, and phrenology. In his book he challenges the phrenologist James Hunt by name, whose pamphlet he says contains “tissues of the most deceptive statements, calculated to mislead those who are unacquainted with the African race... his descriptions are borrowed from the writings of men who are particularly prejudiced against that race; his absurd pro-slavery views, as contained in his pamphlet, would have perhaps suited a century ago; but all true Africans must dismiss them with scorn”.\nPhrenology may have been debunked over 150 years ago, but its foundational theories continued to have impact, even today.\nPhrenology deeply influenced the development of modern anthropology, criminology, and evolutionary biology as well as eugenics which further encouraged skull-collecting activities as the British Empire grew. Discover more about the role of skull collecting in the next section."
    },
    {
      "url": "https://commons.wikimedia.org/wiki/File:Ascertaining_capacity_of_cranial_cavity_by_means_of_water_05.jpg",
      "text": "File:Ascertaining capacity of cranial cavity by means of water 05.jpg\nTools\nActions\nGeneral\nPrint/export\nIn other projects\nAppearance\nFrom Wikimedia Commons, the free media repository\nSize of this preview: 609 × 600 pixels. Other resolutions: 244 × 240 pixels | 487 × 480 pixels | 780 × 768 pixels | 1,040 × 1,024 pixels | 1,979 × 1,949 pixels.\nOriginal file (1,979 × 1,949 pixels, file size: 2 MB, MIME type: image/jpeg)\nFile information\nStructured data\nCaptions\nSummary\n[edit]| DescriptionAscertaining capacity of cranial cavity by means of water 05.jpg |\nEnglish: Ascertaining capacity of cranial cavity by means of water.\nPhotograph No. 4. Using insufflator charged with dry powder to define the surface of the water. In this and other pictures are seen various appliances: scales, weights, reservoir, tube, stop-cock, half-gallon-measure, bread-board, rolling-pin, measuring-glass, insufflator, metronome, etc. |\n| Date | |\n| Source | On composite photography as applied to craniology; and on measuring the cubic capacity of skulls. Memoirs of the National Academy of Sciences, vol. 3: 103-116. 1885 |\n| Author | J.S. Billings and Washington Matthews |\n| Other versions |\n|\nLicensing\n[edit]| Public domainPublic domainfalsefalse |\nThis media file is in the public domain in the United States. This applies to U.S. works where the copyright has expired, often because its first publication occurred prior to January 1, 1930, and if not then due to lack of notice or renewal. See this page for further explanation.\n|\n||\nThis image might not be in the public domain outside of the United States; this especially applies in the countries and areas that do not apply the rule of the shorter term for US works, such as Canada, Mainland China (not Hong Kong or Macao), Germany, Mexico, and Switzerland. The creator and year of publication are essential information and must be provided. See Wikipedia:Public domain and Wikipedia:Copyrights for more details.\n|\nFile history\nClick on a date/time to view the file as it appeared at that time.\n| Date/Time | Thumbnail | Dimensions | User | Comment | |\n|---|---|---|---|---|---|\n| current | 22:45, 26 March 2015 | 1,979 × 1,949 (2 MB) | Animalparty (talk | contribs) | User created page with UploadWizard |\nYou cannot overwrite this file.\nFile usage on Commons\nThe following 5 pages use this file:\n- File:Ascertaining capacity of cranial cavity by means of water 01.jpg\n- File:Ascertaining capacity of cranial cavity by means of water 02.jpg\n- File:Ascertaining capacity of cranial cavity by means of water 03.jpg\n- File:Ascertaining capacity of cranial cavity by means of water 04.jpg\n- File:Ascertaining capacity of cranial cavity by means of water 05.jpg\nMetadata\nThis file contains additional information such as Exif metadata which may have been added by the digital camera, scanner, or software program used to create or digitize it. If the file has been modified from its original state, some details such as the timestamp may not fully reflect those of the original file. The timestamp is only as accurate as the clock in the camera, and it may be completely wrong.\n| Orientation | Normal |\n|---|---|\n| File change date and time | 13:48, 26 March 2015 |\n| Unique image ID | 23AC41416E694240B385D12EC06AB4B4 |\n| Software used | Microsoft Windows Live Photo Gallery 15.4.3538.513 |"
    },
    {
      "url": "https://www.livescience.com/geneticist-adam-rutherford-on-how-eugenics-darwins-monster-took-over-the-world",
      "text": "Geneticist Adam Rutherford on how eugenics, 'Darwin's monster', took over the world\nAdam Rutherford’s new book takes readers on a journey into genetics's dark past.\nIn the Victorian era, in the shadow of Darwin's revolutionary theory of evolution, a sinister ideology took root — eugenics. It was an attempt to impose political control upon humanity’s unruly DNA by encouraging those with \"desirable\" traits to breed, while removing those with \"undesirable\" ones from the gene pool.\nThe idea, which enjoyed popular support among scientists, politicians and the general public for 60 years in Europe and the U.S., later became a cornerstone of Hitler’s Third Reich, taking the world on a horrific journey from forced sterilizations to the mass murder of millions in concentration camps such as Auschwitz.\nYet remnants of the now-discredited practice still haunt us to this day — glimpsed in reports of involuntary sterilizations of Uyghurs in China and detainees in U.S. Immigration and Customs Enforcement (ICE) detention centers; in the claims made by new biotech companies to be able to successfully screen human egg cells for traits like intelligence; or the controversial creation of gene-edited twins by a biophysicist in China.\nIn Adam Rutherford’s new book \"Control: The Dark History and Troubling Present of Eugenics,\" (W.W. Norton & Company, 2022) the British geneticist and science writer time travels to the very beginning of what he calls \"a defining idea of the 20th century\" to explain its persistent hold on our present. His starting point is his own university, University College London, where Darwin’s younger half-cousin, the polymath Francis Galton, first coined the term 140 years ago.\nLive Science spoke with him about how eugenics originated, why it failed, and why he believes it still lives with us now.\nWhat is the modern definition of \"scientific\" eugenics, and how did Charles Darwin and Francis Galton contribute to its creation?\nAs far as we can tell, the idea of trying to control and mold populations through biology — by restricting reproductive rights or in the infanticide of babies deemed unworthy — appears to be almost universal in almost every culture as long as we have records.\nGet the world’s most fascinating discoveries delivered straight to your inbox.\nWhat happened in the 19th century, though, is the emergence of the ideas of natural selection and evolution in 1859 as described by Charles Darwin. Darwin demonstrated that the behavioral or physical characteristics of any species can be changed over generational time by selection, either natural or artificial. Darwin doesn't mention humans in the \"Origin of Species\" at all, but later on, in 1871, he published the \"Descent of Man\" which is the application of evolutionary theory to humans.\nDarwin’s half cousin, Francis Galton — who was very enamored with the work of his relative, and his celebrity status — took those principles of artificial selection and applied them to human populations. He wanted to craft better societies, better cultures, filled with people with more \"desirable\" characteristics.\nGalton wrote about the inheritance of genius in 1869 and he developed statistical techniques to model how societies should be shaped. He believed that the characteristics of humans are determined much more by biology than they are by environment, and he is the person who gives us the phrase \"nature versus nurture,\" where nature is what we now call genetics and nurture is everything that isn't.\nBy 1883, he had come up with a term for this attempt to alter humans physically or behaviorally by changing their social structures: eugenics. It provided a scientific scaffold to the ancient idea of reshaping populations according to biological means.\nRelated: Charles Darwin's stolen 'tree of life' notebooks returned after 20 years\nYet the eugenics we’re discussing here emerged as an idea before Gregor Mendel gave us the concept of the unit of heritable information — the gene. What did eugenicists believe about how we inherit traits such as intelligence? And how did early developments in genetics influence them?\nWhen Darwin described natural selection in 1859, he didn’t have a mechanism, just an overall scheme: evolution occurs as descent with modification. But he didn't know what was descending; what the unit of inheritance was; or how the inherited characteristics were divided up.\nMeanwhile, Gregor Mendel is in Moravia working on his famous pea plants experiments. He breeds the plants together, carefully selecting them for specific traits. And through this he identifies inheritance patterns that can be expressed by the passing of discrete units of inheritance from generation to generation, and that these patterns can be predicted with alarming accuracy. What he discovered is the units of inheritance we call genes.\nThese two things are happening in parallel, but Mendel's work was only translated into English in 1900, after which it became the framework for genetics. The rediscovery of his work and the concept of the gene happens at exactly the right time for the eugenicists. Now, not only do they understand that humans are mutable and can change over generational time, but they have the unit of inheritance, the Mendelian gene. It gives a huge boost to the eugenicists' hereditarian thinking, cementing the idea that characteristics are encoded more genetically than they are environmentally.\nSo what is it exactly about hereditarian thinking that’s wrong?\nIn most countries, we start teaching genetics by talking about Mendel’s pea plants. We say he discovers the unit of inheritance, the gene, and this is how they run through families — recessive, dominant, co-dominant and there’s all these statistical models that emerge from that.\nIt’s not untrue, but what we neglect to mention is that Mendel’s experiment is one of the best designed experiments in the history of biology … He bred 29,000 pea plants together, carefully selecting them to account for genetic complexity. Those that remained displayed uniform and easily identifiable traits such as wrinkly pea shape, petal color, and height. This makes them effectively monogenic-expressing plants [meaning one gene determines each of these traits], but that’s not how people work in the wild.\nThe notion that there are single genes for particular traits and that these are deterministic is a culturally ubiquitous idea. Yet by the time that we finished sequencing the human genome in 2003, we found that while there are thousands of monogenic traits, they're all influenced by other genes, by other phenomena within the genome, and also heavily affected by the environment too. We are complex symphonies of our genes and our environment. There are vanishingly few characteristics which are binary and predictable based on genetics. Whether you have sticky or dry earwax is a monogenic trait, but eye color is polygenic — at least 15 genes have been identified that influence iris color.\nThe reason why people assume eye color is genetically simple is because Charles Davenport, the key protagonist in the American eugenics movement, claimed that Mendelian genetics meant he could show that every trait — eye color, hair color, sexual proclivities, poverty, and weirdly even seafaringness — were mendelian, they were controlled by a single gene, and if you had that gene, you had that trait, and it’s not true. It’s a deterministic, monogenic, genetic-essentialist argument. And it is simply not correct.\nRelated: Your doppelgänger doesn’t just look like you — they behave like you too\nFrom its starting point in Victorian Britain, eugenics went on to take root across Europe and the U.S., finding supporters in figures such as Winston Churchill, George Bernard Shaw, Theodore Roosevelt, John D. Rockefeller, Jr., and John Harvey Kellogg. Why was it so popular? And how did it shape politics in the U.K. and the U.S. in the late 19th and early 20th centuries?\nIt was enormously popular, and it's quite humbling for us to understand how popular it was not just in culture, but across the political spectrum. It's easy to associate eugenics with the Holocaust and other Nazi atrocities. But in fact, it was equally well supported on the emerging socialist left in Britain, and across all demographics in the United States — where it really took hold with a fervor.\nIn the U.K., we have the end of the Victorian era. You have the repeal of the Tudor poor laws transferring care for those at the bottom of society from church to state; massive urbanization as a result of the Industrial Revolution; you've got a lot of emigration from the colonies; and you've got a lot of trouble in those colonies too. [British defeat during] the Boer Wars had a significant effect in prompting people like Churchill to say: ‘Well, we're not fit enough to deal with those we regard as an inferior species.’\nSo to solve these visible problems in British society, politicians and scientists turned to this new idea that Galton was championing — instead of social reform, we need biological reform. And the most powerful people are the ones deciding who gets to reproduce.\nIn America, it's the same but different. Immigration is the hot topic of the day — something like 15 million people migrated into the United States between the years 1900 and 1915 — and it is, as it is to an extent today, the most contentious subject. You see this idea emerging called the \"great replacement theory,\" which is that the existing population is being threatened by an underclass. Immigrants, Indigenous Americans and the descendants of slaves are having too many children, the theory goes, and the upper classes are not having enough. It's never been shown to have been the case, but it’s a persistent threat. Dare I say a phantom menace?\nThe great replacement theory continues to this day. It’s a topic discussed all over the world, but particularly by the right in Silicon Valley and by extreme white supremacists and neo-Nazis in America and globally.\nIt has echoes of the 2006 film Idiocracy. Its plot is that stupid people, too reckless to spend time considering family planning or contraception, will outbreed everyone else, making the far future one populated exclusively by idiots. It seems to present a reductive understanding of how a complex trait like intelligence is passed on.\nIt’s incredibly reductive. What all of my work tends to be about is how quickly biology and new scientific research gets co-opted into pre-existing political ideologies. It's a pattern that we see throughout history. People do research, discover new things, publish it and then watch how quickly it gets used to reinforce the ideas that people already have. It’s why I encourage learning the history of biology to mitigate against that because the crimes justified by it are two of the most significant geopolitical problems that we've had for the last 500 years: European expansionism and scientific racism and eugenics.\nRelated: Dark regions of the genome may drive the evolution of new species\nThe U.K. narrowly avoided putting forced sterilization into its eugenics laws, but it did happen in the U.S. Do you mind taking us into how both countries brought eugenics into legislation?\nSure. Even though the concept of eugenics was invented in the U.K., the British were slower to get off the mark than the Americans, who adopted eugenics policies very enthusiastically. The first enforced sterilization bills passed in Indiana in 1907. Over the course of the next few decades, 31 states introduced coerced sterilization as part of their eugenics policies.\nMeanwhile, in the U.K., politicians and social campaigners are promoting eugenics, but it’s Winston Churchill who's trying to drive it into the legislation. He’s specifically influenced by the Indiana laws. He reads a pamphlet by a doctor from the Indiana reformatory called Harry Clay Sharp. Sharp is best described as an enthusiastic vasectomizer — he claimed he could do 300 vasectomies a day without any anesthetic or health repercussions.\nChurchill read Sharp’s pamphlet, underlining passages as he went, and during his time as Home Secretary under the Asquith government [1908-1915] he proposed legislation for the involuntary sterilization of the \"feeble-minded\"— a kind of pseudo-psychiatric bucket diagnosis for mental health and developmental problems. Churchill suggested the procedure could be performed with X-rays. He was involved in the early drafts of the U.K.’s Mental Deficiencies Act, which did pass in 1913, but his involuntary sterilization suggestions were removed. A lot of that was due to the campaigning work of the member of parliament Josiah Wedgewood, a loud but lonely voice who successfully filibustered those parts of the bill.\nIn America, it was adopted wholesale. The majority of states had coercive sterilization on their books for most of the 20th century. Over this timeframe, somewhere between 70,000 to the highest estimates of 400,000 people were sterilized against their will or knowledge.\nOne state accounts for half of these, and no-one ever guesses which one it was: California. The main industry in California for much of the 20th century wasn’t Hollywood or Silicon Valley but farming — and eugenicists encouraged a lot of these farmers to apply the same principles to their families as they did their livestock.\nRelated: New study provides first evidence of non-random mutations in DNA\nYou mentioned that eugenicists believed \"feeble-mindedness\" was a genetic trait. It always comes as a surprise to people to learn that words like \"moron,\" \"imbecile\" and \"idiot\" were the descending eugenicist classifications for low intelligence.\nYeah, that’s right. I'm sure we’ve all called people those things, probably in the last few days. They’re originally American terms that got adopted everywhere else. The term \"moron\" was coined by Henry Herbert Goddard, who was the first person to translate the IQ test from French into English in America. He was a significant IQ researcher and an important player in this whole story. The idea was you measure IQ and get a diagnosis of \"moron,\" \"high-grade imbecile,\"’ \"low-grade imbecile,'' or \"idiot\" and that then forms part of a criteria for euegnic selection and sterilization.\nYou write in your book that eugenics, particularly American eugenics, later served as the inspiration for the Nazis in their pursuit of \"racial hygeine.\" Hitler referred to \"The Passing of the Great Race\" — a 1916 bestselling book written by American eugenicist Madison Grant — as his \"bible,\" and it was the first foreign language book to be published in Germany after the Nazis came to power. How big an influence did American eugenics have on the Nazis?\nIt’s undeniable that the key influences for the development of German \"rassenhygeine\" [racial hygiene], the german word for eugenics] came from the American Eugenics Records Office — the center for the development of eugenics in America in what is now Cold Spring Harbor Laboratories on Long Island, Upstate New York. The key characters in this are Charles Davenport, the head of the lab, and his deputy, a guy called Harry Laughlin.\nIn 1920, Laughlin saw that states around America were introducing new sterilization bills, but he thought they were doing it in an ad hoc way. So he wrote a template — a boilerplate legal document — that states could simply fill in the blanks for and pass legislation easier. In 1933, this document was translated into German and became the first of the Nuremberg Laws.\nNone of this is a coincidence. The German eugenics institutions in Berlin were funded by the Rockefeller Foundation, and Charles Davenport and Harry Laughlin were paying these places visits. When Hitler took power in 1933, eugenics became a central principle of what developed into the Holocaust. The Nazis argued for purifying the German people to make them more \"aryan\" while removing other races and people with disabilities from the gene pool. Nazi policies were fairly haphazard and deranged, and eugenics is just one strand in a complex grouping of racist, ethnonationalist and antisemitic policies.\nAfter the war during the Doctor’s Trials (the first of the Nuremberg Trials focusing on scientific and medical atrocities), the witness testimonies there talk about how some eugenics policies in the U.S. were seen by the Nazis as a little bit too stringent, particularly on who should qualify as Jewish. In the Jim Crow era, the \"one drop rule\" [referring to \"one drop of Black blood\"] said that if you had a single ancestor of African origin, then you qualify as African American — regardless of what you look like or what the rest of your ancestry is. The Nazis looked at that and thought it was too strict.\nRelated: Children's ID tags unearthed at Nazi death camp in Poland\nIn the aftermath of the Second World War, the horrors of Nazi atrocities and the Doctor’s Trial at Nuremberg significantly diminished popular support for eugenics. But it also waned in popularity because it didn’t even succeed on its own terms, right?\nI think one of the reasons that eugenics began to fall apart as a centralized movement in America is because they just weren't delivering on the science. Many of the British eugenicists criticized the Americans for not doing the statistics well enough. Charles Davenport had a reputation for being sloppy, and the still profoundly racist British eugenicists — particularly those at UCL [University College London] such as Karl Pearson — criticized Davenport's work not because they thought that eugenics was bad, but because they thought it would damage eugenics’s international reputation.\nThe American physicist Stephen Hsu, who co-founded the prenatal screening service Genomic Prediction Inc., has said that it may soon become possible to select for superior intelligence during IVF screenings. How much power have modern technologies given scientists to identify and shape complex human traits?\nI shy away from calling those interventions eugenics, but I think they would have been of interest to the eugenicists of the past. In the 20th century, eugenics was a top-down government imposed strategy rather than one that offers a personal choice for the alleviation of suffering from genetic disorders. Since the 1990s, we’ve used embryo selection for polygenic traits during IVF. We can look at an embryo’s DNA and not just select against particular diseases, but select for complex traits.\nHowever, I think the services being offered by new companies emerging in the United States — where regulation does not forbid the selection of traits rather than diseases — are scientific folly. Set aside the morality of it all, and you could drop hundreds of thousands of dollars on it with the promise not being deliverable.\nIf you take traits that are polygenic traits [meaning they are determined by many genes, not just one], such as intelligence or height, we understand what those genetic contributions are by looking at populations. We take a population, we look at particular characteristics, and then we study their genomes to find the bits that are more similar within that cohort than with another trait. This technique (a genome wide association study) only works at the population level; we don’t really know how it works in an individual.\nRelated: 1st UK child to receive gene therapy for fatal genetic disorder is now 'happy and healthy'\nSo there’s really no evidence that prenatal screening can perform a Gattaca-style selection for IQ?\nWe do know that IQ and cognitive abilities are highly heritable. But let’s say you measure IQ in a population of 100,000 people, and you determine the genes you think are behind it and how many of these genes are heritable. When you get to the stage of an individual using IVF to select for smarter genes, you’re choosing between ten possible eggs? Eight? Even four, maybe? The statistics fall off a cliff.\nOne paper I cite in my book suggests that if you’re picking between that many eggs, and you’re selecting for the very highest genetic associations with intelligence, you’re going to be able to improve IQ by one or two points. The margin of error for IQ tests is five points anyway because IQ is variable — it changes across your life and even based on whether you’ve had a coffee that morning or what day you take the test on.\nI just think it's a colossal waste of money and that these services are cons. They’re looking for effects that we won't be able to see clearly for decades, and will be absolutely swamped by other factors. We know how to raise the IQ of the population already — you do it by improving childcare and reading books; improving teaching practices; providing better access to sanitation, medical care and sports facilities. All of these things have a very positive, and measurable, effect on the behaviors of individuals within societies.\nBut as ever with these types of things, people turn to the \"authority\" of science. Somehow tinkering with something that you really don't understand is going to be more advantageous than something that we know how to do — that being, I don't know, reading books or making sure that people are well fed.\nRelated: Humans might be making genetic evolution obsolete\nYou write in your book that in the U.S. a 2014 state audit in California revealed that 39 inmates had been forcibly sterilized between 2005 to 2013, and in 2020 reports emerged that 20 women had undergone involuntary sterilization in ICE detention centers. The involuntary sterilization of ethnic minorities and people with disabilities has been reported in countries such as China, India, Peru, Canada and Sweden. Why does this still persist despite it being so thoroughly discredited, both ethically and scientifically?\nBecause it's not a science, it's a mindset. It is a political view …\nEugenics is a manifestation of power. And in one of those situations you just described, it is the powerful dominating the powerless, in the most freedom restricting way possible — which is reproductive freedom.\nIt's an ideology that will never quite go away. The name changes, it becomes toxic after the Second World War, but the principle doesn't go away. Maybe it diminishes in that the numbers of people being sterilized against their knowledge or will today are minuscule compared to the genocidal numbers during the Holocaust and throughout the 20th century in America.\nBut it doesn’t go away because it’s a way of thinking — about people and about maintaining one's own power at the expense of others. And unfortunately, that doesn't look like it will disappear.\nSo we talk about it, we expose it as a non-scientific idea, and an idea that science will not be able to deliver. We educate people about genetics, so that others can't have my tools to enact their bigotry. Eugenics was bigotry disguised as biology.\nEditor's Note: This interview has been condensed and lightly edited for clarity.\nBen Turner is a U.K. based staff writer at Live Science. He covers physics and astronomy, among other topics like tech and climate change. He graduated from University College London with a degree in particle physics before training as a journalist. When he's not writing, Ben enjoys reading literature, playing the guitar and embarrassing himself with chess."
    },
    {
      "url": "https://www.bbc.co.uk/news/world-africa-63171981",
      "text": "UK museums willing to return skulls to Zimbabwe\n- Published\nLondon's Natural History Museum and Cambridge University have said that they are ready to co-operate with Zimbabwe to return human remains that were taken in the colonial era.\nThe fresh statements come after a delegation from Zimbabwe held talks with officials from both institutions.\nThe Zimbabweans are looking for the skulls of late-19th Century anti-colonial heroes, which they believe could be in the UK.\nBut these have not yet been found.\nThe authorities in Zimbabwe have long suspected that the remains of some of the leaders of an uprising against British rule in the 1890s - known as the First Chimurenga - were taken to the UK as trophies.\nThe most significant among them was a woman who became known as Mbuya Nehanda. She was executed in what is now the capital, Harare and is revered as a national heroine.\nIn doing a search of its archive, the Natural History Museum did uncover 11 remains \"that appear to be originally from Zimbabwe\" - but its records do not connect them with Nehanda. These include three skulls taken in 1893, thought to be from Zimbabwe's second city, Bulawayo, as well as remains uncovered in mineshafts and archaeological digs and later donated.\nCambridge University's Duckworth Laboratory has not been so specific, simply saying it has \"a small number of human remains from Zimbabwe\", but in a statement sent to the BBC it said it had not identified any of these as belonging to First Chimurenga figures.\nThe Natural History Museum, with 25,000 human remains, and the Duckworth Laboratory, with 18,000, have some of the largest such archives in the world.\nThese have come from a variety of sources including archaeological excavations of ancient sites, but for many the exact origins have been obscured by time.\nDuring the colonial era, body parts were sometimes removed from battlefields or dug up from graves either as trophies or for research into a now-discredited scientific field.\nIn the 19th Century, phrenology, which investigated the idea that human characteristics could be determined by the shape of the skull, was very popular in the UK and other parts of Europe. Phrenological societies would collect skulls to help develop the theory, which for some extended to racial classification.\nSome researchers set out to show that skull shape indicated that people from different parts of the world were inherently inferior.\nSome of the archives that now exist in the UK are amalgamations of what had been amassed by defunct phrenological societies as well as private collectors.\nZimbabwe's government believes that somehow the skulls of the country's heroes ended up in the archives of a British museum.\nChief among them were spiritual leaders, including Charwe Nyakasikana, who became known as Mbuya (Grandmother) Nehanda as she was the medium of the revered ancestral spirit Nehanda. She was arrested after being accused of murdering a British official.\nNehanda was then hanged and her body decapitated, it is believed. What happened next is not clear, but in recent years, Zimbabwean officials have made several public statements saying it ended up in the Natural History Museum.\nWith a death cry of \"my bones will surely rise\", Nehanda became an increasingly potent symbol for those fighting against white-minority rule in what was then known as Rhodesia from the late 1960s.\nZimbabwe gained independence in 1980.\nA three-metre statue of Nehanda now stands over a major road in the centre of Harare. At its unveiling in 2021, President Emmerson Mnangagwa pledged to continue to call for the return of her skull and others from the Natural History Museum.\nFor Zimbabweans, the removal of the head \"means that you have literally punished the person beyond the grave\", Godfrey Mahachi, who led the delegation to the UK, told the BBC in 2020 when the visit was being planned.\n\"If the head is separated, that means that the spirit of that person will forever linger and never settle.\"\nDespite not finding what the Zimbabwean delegation was looking for, both the Natural History Museum and Cambridge University say they are committed to working with the Zimbabwean government to repatriate what was found.\nAs part of its policy of repatriation, earlier this year, the Natural History Museum returned ancestral Moriori and Maori remains.\nIn a press statement following a recent cabinet meeting, Zimbabwe's government said that the delegation that went to the UK was satisfied that \"there are indeed human remains of Zimbabwean origin in the UK\".\n\"Government will spare no effort to ensure the repatriation of our ancestors,\" it added.\nThe Zimbabwean delegation also held talks with the British Museum, Oxford University's Pitt Rivers Museum, the University of Manchester Museum and the UK's National Archives. But no details are given about what was discussed.\nDespite the lack of success in this trip to the UK, the historical significance to Zimbabwe of the remains of Nehanda and others means that the search will continue.\nRelated topics\n- Published13 November 2018\n- Published28 June 2019"
    },
    {
      "url": "https://upf.com/book.asp?id=9781683401575",
      "text": "Repatriation and Erasing the Past\nElizabeth Weiss and James W. Springer\nHardcover: $90.00\nEngaging a longstanding controversy important to archaeologists and indigenous communities, Repatriation and Erasing the Past takes a critical look at laws that mandate the return of human remains from museums and laboratories to ancestral burial grounds. Anthropologist Elizabeth Weiss and attorney James Springer offer scientific and legal perspectives on the way repatriation laws impact research.\nWeiss discusses how anthropologists draw conclusions about past peoples through their study of skeletons and mummies and argues that continued curation of human remains is important. Springer reviews American Indian law and how it helped to shape laws such as NAGPRA (the Native American Graves Protection and Repatriation Act). He provides detailed analyses of cases including the Kennewick Man and the Havasupai genetics lawsuits. Together, Weiss and Springer critique repatriation laws and support the view that anthropologists should prioritize scientific research over other perspectives.\nElizabeth Weiss, professor of anthropology at San José State University, is the author of Reading the Bones: Activity, Biology, and Culture. James W. Springer is a retired attorney and anthropologist based in Peoria, Illinois.\n- Sample Chapter(s):\n- Excerpt\n- Table of Contents\nThere are currently no reviews available"
    },
    {
      "url": "https://theconversation.com/how-the-racist-study-of-skulls-gripped-victorian-britains-scientists-262280",
      "text": "The recent publication of the University of Edinburgh’s Review of Race and History has drawn attention to its “skull room”: a collection of 1,500 human craniums procured for study in the 19th century.\nCraniometry, the study of skull measurements, was widely taught in medical schools across Britain, Europe, and the United States in the 19th and early 20th centuries.\nToday, the harmful and racist foundations of craniometry have been discredited. It’s long been proven that the size and shape of the head have no bearing on mental and behavioural traits in either individuals or groups.\nIn the 19th and early 20th century, however, thousands of skulls were amassed to enable research and instruction in scientific racism. Edinburgh’s skull room is by no means unique.\nUnlike phrenology, a popular theory which linked personality traits to bumps on the head, craniometry enjoyed widespread scientific support in the 19th century because it revolved around data collection and statistics.\nCraniometrists measured skulls and averaged the results for different population groups. This data was used to classify people into races based on the size and shape of the head. Craniometrical evidence was used to explain why some peoples were supposedly more civilised and evolved than others.\nThe vast accumulation of data drawn from skulls appealed to Victorian scientists who believed in the objectivity of numbers. It equally helped to validate racial prejudice by suggesting that differences among peoples were innate and biologically determined.\nMedical history\nThe study of skulls was central to the development of 19th-century anthropology. But before anthropology was taught at British universities, markers of supposed racial difference were studied by anatomists skilled in identifying minute differences in skeletons. The study of skulls entered the university curriculum through medical schools, and particularly through anatomy departments.\nFor example, when Alexander Macalister was appointed as professor of anatomy at Cambridge in 1884, some of his first lectures were on “The Race Types of the Human Skull.”\nMacalister’s annual report for 1892 in the Cambridge University Reporter describes how he had increased Cambridge’s cranial holdings from 55 to 1,402 specimens. In 1899, he reported the donation of more than 1,000 ancient Egyptian craniums from the archaeologist Flinders Petrie. Much of Macalister’s skull collection remains housed in the university’s Duckworth Laboratory, which was established in 1945.\nAs the prestige of craniometrical research increased, institutions had to compete for cranial collections as they went on the market. Statistical accuracy depended on vast series of craniums being measured to produce representative “types”. This created an increased demand for human remains.\nIn 1880, the Royal College of Surgeons purchased 1,539 skulls from the private collection of Joseph Barnard Davis. This was added to their existing cache of 1,018 craniums to create Britain’s largest craniological collection. This collection was largely destroyed in 1941 when the college building was bombed during world war two. The remaining skulls are no longer held by the Royal College of Surgeons.\nOxford’s University Museum of Natural History included rows of crania in their anatomical displays in the 19th century, as did the University of Manchester’s medical school (the medical school is no longer on the same site). This investment in skulls ensured that racial researchers had enough material to study and use in their teaching.\nCatalogues kept by universities in the 19th and early 20th centuries reveal not only the size of their skull collections, but also the origin of individual specimens.\nHistorical trauma\nSome medical schools, such as Edinburgh’s, repurposed skulls procured by phrenological societies earlier in the century to enhance their holdings. Others, including Oxford’s, made use of skulls unearthed by archaeologists to conduct racial research into the country’s past. This research attempted to trace the movements of Celts, Normans, Saxons, and Scandinavians across the British Isles.\nYet because craniologists wanted to capture the full extent of racial variation, skulls from abroad were especially prized. Medical graduates of British universities posted to the colonies sent foreign bones to their old professors.\nIn research for my forthcoming book on skull collections, I’ve found that Cambridge’s cranial register includes a skull sent from a former student stationed in India. He had plucked it from a cremation site in Bombay despite the outrage of gathered mourners. Brazen grave-robbing and colonial violence were central to the international network that furnished British universities’ skull rooms.\nThe racist ideology that spurred the collection of skulls 150 years ago has been completely discredited. However, some anthropologists believe these bones may still shed light on human origins, relations and migrations.\nYet ethical factors now equally shape institutional policies towards human remains. The Pitt Rivers Museum in Oxford took its infamous “shrunken heads” off display in 2020.\nIncreasingly, universities and museums have confronted the historic injustices and inter-generational trauma perpetuated by their retention of human remains. Since the 1970s, Indigenous groups from around the world have launched campaigns to repatriate their ancestors’ bones. Research institutions have become increasingly responsive to these requests.\nIn London, the Museum of the Royal College of Surgeons no longer displays the skeleton of Charles Byrne, the so-called “Irish Giant”. Byrne had explicitly denied consent for his remains to be dissected and mounted before he died in 1783.\nThe skulls in British universities are a testament to a vast theft of human remains from almost every territory on earth. Yet they have the potential to become powerful symbols of reconciliation if their discriminatory histories are acknowledged, and remedied through their return.\nA spokesperson for the Duckworth Laboratory, University of Cambridge, said:\n“We, like many institutions in the UK, are dealing with the legacies and past unethical practice in assembling the collections in our care. The Duckworth Collection and the Department of Archaeology are dedicated to fostering an open dialogue and building robust relationships with traditional communities and other stakeholders. This commitment is seen as an integral part of a continuous, reciprocal exchange of knowledge, perspectives, and cultural values. The aim is not only to address past inequities but also to enrich contemporary academic and cultural understanding through a respectful and equal partnership. In this vein, the Duckworth Collection is actively expanding its work with archival documentation and improving our records and database. In essence, the Duckworth Laboratory’s approach to repatriation and community engagement is marked by a commitment to openness, inclusivity, and a recognition of the need for an ongoing dialogue.”"
    },
    {
      "url": "https://www.prm.ox.ac.uk/shrunken-heads",
      "text": "Shrunken heads\nUntil 2020, the cabinet in the Pitt Rivers Museum labelled ‘Treatment of Dead Enemies’ held tsantsa, or shrunken heads, which were displayed with many other human remains from other parts of the world. The decision was taken to remove the tsantsa from public display because it was felt that the way they were displayed did not sufficiently help visitors understand the cultural practices related to their making and instead led people to think in stereotypical and racist ways about Shuar culture. Standing in front of the case, people would talk about the people who had made them as ‘savage’ or ‘primitive’ and use words such as ‘gory’, ‘gruesome’ or a 'freakshow' when talking about the display. Shuar people have expressed dismay at their culture being represented in such ways, and the Museum is now working with Shuar partners to redress this situation.\nTo download the Museum's 2011 publication on the tsantsa, by Prof Laura Peers, please click here.\nThe tsantsa in the Pitt Rivers Museum\nThe tsantsa (shrunken heads) in the Pitt Rivers Museum were acquired between 1884 and 1936.\nRecent research by Dr Laura Van Broekhoven has shown that the Museum’s Shuar/Achuar collection comprises 173 objects, ten of which are tsantsa, six human, two sloth, and two monkey. The tsantsa were acquired between 1884 and 1936 from five different collectors and were, as far as we know, only added to the original display in the 1940s. Previously it was thought that there were 12 tsantsa, but that was due to a previous misidentification, and a tsantsa that seems to have never been brought into the collection, but did appear in the databases.\nThe data that accompanies the tsantsa does not provide us with either geographically or chronologically clear provenance information. The tsantsa are said to have been collected from either ‘Xebaroe’ or ‘Jivaro’ people along three different rivers where we know Jivaroan peoples were known to have lived. We suspect that these particular tsantsa come from three main Jivaroan peoples: the Untsuri Shuar who lived along the Zamora River; the Achuara from the Pastaza River and the Aguaruna along the Marañon River. Around the time these tsansa were collected the Achuara were regularly raided for heads by the Untsuri Shuar, but further research is required into this.\nTwo of the tsantsa (one human and one sloth) are from the Museum's founding collection belonging to General Augustus Henry Lane Fox Pitt-Rivers: a sloth tsantsa (1874.115.1) collected by Clarence Buckley from the ‘Xebaroe’, and a human tsantsa (1874.115.2) probably sold to the General by a person identified as ‘Jamrach’ (and possibly collected by the same Buckley). They are amongst the oldest tsantsa recorded in any museum collection.\nAccording to the Museum’s records, the other tsantsa consist of a human head (1932.32.92) collected by William L. Stevenson Loat in Ecuador along the Upper Santiago river, a ‘Jivaro’ human tsantsa (1911.77.1) bought in 1911 for £3 by a Mrs Sanders in the Peruvian Marañón River district, and a sloth tsantsa (1923.88.364) purchased by Major R. H. Thomas in 1922 when visiting the ‘Jivaros’ of the Upper Santiago River in Ecuador. In 1936, Major Thomas also aquired the two monkey tsantsa (1936.53.44 and 1936.53.45) in Ecuador along the Pastaza River. He also collected the three commercial (or forgeries of) human tsantsa along the Zamora River, Guallaquisa in Ecuador (1923.88.363) and along the Pastaza River in Ecuador (1936.53.42 and 1936.53.43). The Museum hopes to do further work to identify which of the tsantsa are likely to be forgeries.\nHow and why were tsantsa made?\nLittle is known about the reasons tsantsa were made or the method of making them. Most historical records that do exist were written by foreigners who did not speak Shuar. As far as is recorded, tsantsa were made by Shuar and Achuar people of Ecuador and South America. The process of creating a shrunken head involved peeling the skin and hair off the skull, which was thrown away. Only the skin and hair were kept. This was soaked in hot water briefly, and then hot sand poured inside the skin cavity. The hot sand treatment was repeated several times, and the facial features were reshaped after each stage. Many tsantsa were not made from humans but from sloths and monkeys, and this was increasingly so as European demand for tsantsa grew. However, sloths were also used as they are considered sacred by Shuar communities.\nGenuine tsantsa were made in order to capture the power of one of the multiple souls that Shuar and Achuar people believed their men had. That power was used by the group to strengthen themselves and increase harvests. Tsantsa are thus different from other kinds of war trophies around the world made from the body parts of enemies.\nConsiderations for display\nWhile the largest collection of tsantsa can be found in Ecuador, there are several in museums in Europe and the USA. With a few exceptions (the Pitt Rivers Museum, the American Museum of Natural History in New York, the Mutter Museum in Philadelphia and the Wellcome Collection in London) tsantsa have not been on public display for a number of years now in most institutions as it is felt to be unethical or inappropriate.\nRecent legislation and professional discussions in the UK have addressed the display and care of human remains in museum collections. Human remains have also been returned to indigenous communities from many British institutions, including the University of Oxford, which has returned Māori and Australian Aboriginal remains from the Pitt Rivers Museum and the Oxford University Museum of Natural History.\nThe UK government’s Guidance for the Care of Human Remains in Museums (DCMS 2005) recommends that: ‘Human remains should be displayed only if the museum believes that it makes a material contribution to a particular interpretation, and that contribution could not be made equally effectively in another way. Displays should always be accompanied by sufficient explanatory material … As a general principle, human remains should be displayed in such a way as to avoid people coming across them unawares.”\nFor over a decade Pitt Rivers staff have been considering other ways of displaying the shrunken heads. We are now working with Shuar delegates as part of a project with the Universidad de San Francisco in Quito, Ecuador. The project is led by Maria Patricia Ordoñez and involves multiple conversations with Shuar and Achuar delegates to decide what would be the best way forward with regard to the care and/or display of these human remains."
    },
    {
      "url": "https://archive.org/details/in.ernet.dli.2015.45445/page/n3/mode/2up",
      "text": "471 Views\nIN COLLECTIONS\nPublic Library of India JaiGyan: Bharat Ek KhojUploaded by Public Resource on\nAsk the publishers to restore access to 500,000+ books.\nBook Source: Digital Library of India Item 2015.45445\ndc.contributor.author: Davis, Joseph Barnard\ndc.date.accessioned: 2015-06-26T08:48:39Z\ndc.date.available: 2015-06-26T08:48:39Z\ndc.date.digitalpublicationdate: 2007-04-27\ndc.date.citation: 1867\ndc.identifier.barcode: 4990010225529\ndc.identifier.origpath: /data3/upload/0080/214\ndc.identifier.copyno: 1\ndc.identifier.uri: http://www.new.dli.ernet.in/handle/2015/45445\ndc.description.scanningcentre: C-DAK, Kolkata\ndc.description.main: 1\ndc.description.tagged: 0\ndc.description.totalpages: 400\ndc.format.mimetype: application/pdf\ndc.language.iso: English\ndc.publisher.digitalrepublisher: Digital Library Of India\ndc.publisher: Printed For The Sobscribers, London\ndc.rights: In Public Domain\ndc.source.library: The Asiatic Society, Kolkata\ndc.subject.classification: Natural Sciences\ndc.subject.classification: Generalities About The Pure Sciences\ndc.subject.classification: Generalities About The Pure Sciences. Mathematical Sciences In The Broad Sense\ndc.title: Thesaurus Craniorum\n471 Views\nFor users with print-disabilities\nUploaded by Public Resource on"
    },
    {
      "url": "https://www.google.co.uk/books/edition/Supplement_to_Thesaurus_Craniorum/njQvAAAAYAAJ?hl=en&gbpv=1",
      "text": "Supplement to Thesaurus Craniorum\nCatalogue of the Skulls of the Various Races of Man\nBy Joseph Barnard Davis · 1875\nRead free of charge\n- About this editionPage count: 101Published: 1875Publisher: subscribersOriginal from: Harvard UniversityDigitized: October 22, 2008Language: EnglishAuthor: Joseph Barnard DavisCreate citationOther editionsOct 27, 2022Oct 27, 2022Feb 7, 2018Aug 27, 2015Creative Media Partners, LLCCreative Media Partners, LLCCreative Media Partners, LLCCreative Media Partners, LLCPaperbackHardcoverPaperbackHardcover130 pages130 pages132 pages132 pagesMore editionsCommon terms and phrasesaboriginalætAfghanAïnoalisphenoidsAlomboAncientAnthropAustralianAverage measurementsBalumbaBARIAM SINGHbelongedBotocudobrachycephalicBulgarianBurmeseCallaoCalvcalvariacalvariumcephalic indexCerro del OroChatham IslandChinesecollectionColonel E. T.coronalCrancraniacraniologycraniumdepressiondiameterDibeiadolichocephalicdolichocephalic calvariumMore terms and phrasesShow lessGet bookBorrowFind in a librarySearch in WorldCat.Search WorldCatAbout the workOriginally published: 1875Subject: Craniology, Craniology -- Collections, Catalogs, SkullAuthorJoseph Barnard Davis was an English medical doctor now remembered as a collector and craniologist. WikipediaSearch Joseph Barnard DavisMore by authorContributions Towards Determining the Weight of the Brain in Different Races of ManBy Joseph Barnard DavisCrania BritannicaDelineations and Descriptions of the Skulls of the Aboriginal and Early Inhabitants of the British Islands: with Notices of Their Other Remains. By Joseph Barnard Davis and John Thurnam · Volume 2By Joseph Barnard Davis, John ThurnamMore booksPublishersubscribersSearch subscribers"
    }
  ],
  "argos_summary": "The University of Edinburgh’s recently published review of its skull room—housing 1,500 19th‑century human craniums—highlights the discredited practice of craniometry and its role in scientific racism. The article details how skulls were collected from colonial and indigenous sources, used to justify racial hierarchies, and now face ethical scrutiny and repatriation demands. It notes the museum’s efforts to document provenance, engage with descendant communities, and balance scientific research with cultural sensitivity. The piece underscores the broader movement among UK institutions to reassess and return human remains acquired under colonial exploitation.",
  "argos_id": "5RP77W4TK"
}