{
  "url": "https://www.bloomberg.com/news/videos/2025-09-01/insight-with-haslinda-amin-9-1-2025-video?srnd=all",
  "authorsByline": "bn",
  "articleId": "1f7431a65d1e4dd58f4646943246b98c",
  "source": {
    "domain": "bloomberg.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/irz90zvLDvCY/v3/-1x-1.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-01T05:37:48.079000+00:00",
  "addDate": "2025-09-01T06:04:54.565333+00:00",
  "refreshDate": "2025-09-01T06:04:54.565336+00:00",
  "score": 1.0,
  "title": "Indonesian Markets Tumble Amid Protests, Looting",
  "description": "Insight with Haslinda Amin, a daily news program featuring in-depth, high-profile interviews and analysis to give viewers the complete picture on the stories that matter. The show features prominent leaders spanning the worlds of business, finance, politics and culture. (Source: Bloomberg)",
  "content": "But no widespread outrage and violence sweeping across Indonesia, leaving at least four people dead and hundreds injured. The unrest, which began over rising costs of living, has turned into the most serious test yet for president Prabowo Subianto. Live from singapore, this is inside with Haslinda Amin, where we dive deeper into the worsening conflict with crucial context and sharp analysis is his use of Asia Institute's muddy Suprema will be with us to look at how the unrest could impact politics in the country. Indonesia is benchmark sliding the most since April to meet those protests. We're also on watch for how Thai markets will shape up following political upheaval in the kingdom and the US-China rivalry in the spotlight after Alibaba touts progress in Asia. A report suggests the tech firm is looking to fill China's AI chip gap. Plus, as India's Narendra modi shows up ties with China and Russia. We're taking a deep dive into Beijing and New Delhi's bilateral reset with a former Indian ambassador to China. So, I mean, I sincerely ask all Indonesian citizens to stay calm and trust the government. The government I lead along with party leaders, including those outside the government, is committed to always fighting for the people's interests to the police and the Indonesian national armed forces. I order them to take the strictest actions against those who have committed acts of damage to public facilities, looting of individual homes or public places or economic centers. President Prabowo is moving to quell a wave of unrest in Indonesia that intensified over the weekend. Protests spread to nearly a dozen major cities, with government buildings being burned and looters reportedly targeting the homes of the finance minister and several lawmakers. Parliament has now removed hefty lawmaker's allowances, which sparked outrage for being nearly ten times the monthly minimum wage. The death of a motorcycle taxi driver who was run over by a police vehicle during a rally also further inflamed tensions. Concerns over the political instability has sent Indonesian stocks tumbling by the most in nearly five months. The rupiah, however, is relatively steady as the central bank continued its intervention in the currency market. Let's get perspective on the developing story in Indonesia. My dear Supriya Sharma is a visiting fellow at the ISI's Use of Asia Institute. He joins us now from Jakarta. Murray, good to have you with us. Is the country now calmer given that President Prabowo has revoked the housing allowance for lawmakers? First of all, thank you for having me. I think the answer is no for certain. Today in Georgia, there's a two big demonstration in the house. One is in a local parliament and the other is in near the university, the biggest university there this year. I think the president did address the substance of the problem that the people feel. I think I heard a lot of people demonstrators policies because it's just a gimmick. So I think basically the demand is centered around three things. One is the rise of inequality. If you say before that this is the purpose for the legislative member is so high compared to the the minimum wage. And then the second thing is this systemic corruption within a decent political system, especially by the elites. And it is about the brutality of the police and also the expansion of the military. These three things the presidents ignore and no want to talk. I think the people want to see force. First is he replaced the head of the police, the chief police general, to get this deal. So I think it it will be continued for a while. And I don't know where it will end or when it will have the. So you're expecting a further escalation in the situation in Indonesia. I mean, some people are concerned that we might see the days of 1997, 1998. Is that a possibility? Yeah. This escalation. Yes, but not like in 1998, 1997 to 1988. But this, I think, is right now the protest is more about the elites, more about the distrust of the political system. And I think the president promoted instill good leadership here. I think he he I have to say that he failed the first steps test of leadership because it turns out he didn't he didn't act swiftly. He just consulted the the old people, the establishment, the political parties for so yesterday. I think the the people have a pretty high distrust to the parliament, to the deep end. And the political party has a very big role in that. And the distrust to political parties are very high. So I think the president misread all of the things that happened in the society just because he what does he live in in in a very tight bubble surrounded by his loyal support person to get the information. What really happened in the society. How much of it has to do with the promises that Prabowo made during the campaign. He talked about 8% growth. He talked about jobs. He talked about a good life. And we know that the young Indonesians were looking for the good life that they saw during this hard two days, and they're expecting to see the same. And now one year on, they're disappointed. Yeah, I think I think it's very ironic. We expect a lot of people expect that by voting for him, they will get a strong leader by voting for him as he promised that this would be a great country. How can you be a great country if you cannot even handle your domestic security? Yeah, I think this is a is this unprecedented? That is as long as my career as a political scientist. So watching it really fear that the police, the police institution has collapsed. Yeah. In several days you see that the people they are to to burn down the police headquarters, the regional here in Georgia, they just they burn it down and people start attacking the police force everywhere in Indonesia. So I think the police institution is collapsing and under his watch. So I think this is a very, very sad because then the law and order, you know, as the police will have the effect of yeah, it's yeah, nobody care about that. And also I think it's not only prob also responsibility, but for all of the elites right now they don't show any leadership to uh, to quell the situation, to tame the riots. So the response is very weak, very weak, and then we don't know what's going on in the future. Yeah. I think if he was wrong, did you go into my day? How much appetite there is in terms of people wanting to address low wages? I mean, he's got great spending plans. He has that $1 billion plan for free meals. He is already struggling to fund that. I mean, how do how does he address the issues of the people? Yeah. I think here again, for example, people sample the free, nutritious meal. A lot of people here say that it will benefit a lot of people. It will benefit the of the producers of the food producers in the region. But in fact, a lot of those who got a contract, it's the old money, the old people the establishment in the region. So also yeah, also in the at the national level. So this is only the economy for the elites. I think he misled everything of his red and white corporate is for example he didn't inform people. Yeah he just right now he has a very, very big cabinet and I think it costs a lot. But he is not governed by the usual ministries channel. He create his own passport in order to bypass all of the ministries. So that's a lot of waste, actually. And people don't see that this is this will bring hope for the future. This will bring this will increase their welfare for simple. So there's a lot of pessimism, lack of hope for this government. You talk about how Indonesia right now is for the elites. This is a population of 270 million people. Isn't it true as well that even the businesses are not that happy? I mean, Prabowo has talked about issuing Patriot bonds, wanting companies to buy these bonds at lower yields, and these are bonds that people are not really interested in but might be forced to buy anyways. Yes, it's crazy. I heard about that. That complaint also from the business side. Yeah. How can you. Yeah. You have to show your your nationalism by buying this this kind of book. So the big players like Goldman, so, well, they have to buy these kind of bonds. I think you can't do that this to the market. Yeah. And then the people, I think, are not really happy about this, especially the business community. And yeah, everything was measured by by, you know, your nationalism, the countries. And I think it's a kind of look at the other example that they have also the pump oil. Yeah. How the the government confiscated the the pump oil that that located inside to protect the tourists and they keep it as part of which is the state company's was all by the general. So people saw this this kind of think that it is just everything is circle around trouble and is. Yeah small circle of what retired generals and people in his own party. So this is not healthy. I think he has to change the course. He has to reshuffle. The cabinet is up. He has to manage how to control the police and also the military. And he has to stop the expansion of the military. The question really is, do you see him doing that and how soon might he do that? And the other thing is sort of this disguise is trouble is is a very firm I believe he's a military man. And I think from from his biography of his memoir, three books of his memoir, they conclude that he really wants to do what he really wants to do is a state capitalism and control Cobra's economy, the current economy. So everything will be simpler. Yeah, you see that all of this protest started from the region, started from partly because of the taxes. This is because of his policies. He cut all the transport to the region. Yeah. Yeah. By 50 trillion rupiah. It's not big money, but it forced the government, the local government, to do to look for another fund. And they raised taxes and it's create unrest in the region. And then for the next budget year, I think you will cut it again four or five fold. So it will force the local government to find more funding somewhere else. So he squeezed them and then take it over to the central government and will bring it back to the to the local government by using a project. So if you plan everything centrally, it doesn't work right. Indonesia has enjoyed 25 years of reformation. We have digitalization works really well. Yeah, you like it or not, but. But the centralization is the is the future oriented. It's not the central decision. But maybe some of the people I talked to in Indonesia expect Prabowo to take a tougher stance from here. They say that he may deem routine looting and rioting as treason, and that will allow the police and the military to take really a hard stance on the looters and the people. Do you see this happening? It started to happen. But I think if this again, this is the leadership, a lack of what a clear command from from the top. So there's a kind of hesitation for the either the police or the military to crack down on the looting and the burning. I think it it will not quit until he shows that the clear what he what he really wants to crack down. Everything he does really want to limit the free or freedom of speech, for example. Yeah. That's the consequences of of if you have a freedom of speech. Of course a lot of people will joining and some of them are rioters are some of them take this opportunity. This is a very tight rope for him to to walk in. So for investors, do they wait and see? Do they pull their money out? Given the history that Indonesia has when it comes to protests and riot and how violent that may turn out to be? Yeah, This will go on for a while until we find a balance. I think what we need is what's a while? Are we talking about the next few days, the next few weeks? The next few months? What? What? The while I expect it will be reasonably glum in a few weeks. Not. Not really months, because people will get tired and the government will find its food. But I think he has probably has to address the basic and substantive issues that make this protest happen. So as I say, that he has to address the corruption cases. He has to address the inequality. Yeah, he has to look at his program again. And I hope he will be he will be humbled by these protests and riots and the the collapse of the police institution because this is not good for him. And people will see him as a weak leader. Yeah, his enemies domestically and abroad see that as well will probably deal with this kind of guy is weak. He cannot handle this kind of protest. So I think right now, sadly, I would say that forget about the Rudisha head. The major regional becomes a regional power because, you know, we are not as strong as that actually. But muddy as an Indonesian, what's your biggest worry? What's your biggest concern right now? My biggest worry that this country will go without a clear direction. People really don't want to replace probable because the next in line is not really it will bring huge instability if the next in line will take over. I don't think that he has any capabilities to handle the situation. So I think for Mr. Probable, I think overall, I really hope that he seems to course be a make or for do or make over again his cabinet making smaller, make it more efficient and lower his ambitions, lower his spending and think more about the people. But Marty will continue to track developments in Indonesia. Marty, superintendent of the ISI's Yusuf Ishak Institute, coming to us from Jakarta. Still to come, we're keeping the focus on Southeast Asian markets as investors weigh the growing political risks in both Indonesia and Thailand. Keep it here with us. This is Bloomberg. Here's a look at how local markets are trading in Indonesia and Thailand. Not surprising they are in the negative. Southeast Asian investors grappling with elevated political risks in both key markets after a weekend of widespread protests in Indonesia and the removal of yet another prime minister in Thailand. Let's get more on the market implications and live market strategist Mary Nicola is with us. I go away for one week and I come back to a completely different investment landscape in Southeast Asia. I mean, you can't imagine. I mean, these are the two among the two largest markets in Southeast Asia. Sentiment will be impacted. Well, before you left, also keep in mind that there were strong inflows into Indonesian markets in the month of August. So it had quite a good run where you saw this reversal and people coming back in. And actually there were some green shoots coming through, whether you saw from the budget side where they weren't going to escalate wide in the budget deficit, there were some signs that things were improving, that the economy was holding up despite these the tariffs. And then, of course, these political protests and the civil unrest is really going to impact sentiment. So, of course, you've got as long as they linger, that's what's going you're going to see a drag on whether it's the stock market or the currency, because at the end of the day, investor confidence is is has been shaken. And now what we saw is inflows could start seeing as outflows. So you talked about how there were inflows. That has to do with the rotation from the U.S. given the low valuations here. So that's going to take a break. But when you take a look at Indonesia year to date, still up 11% ain't too shabby. And plus, when you take a look at the currency, pretty stable thanks to Bank Indonesia, it's pretty stable, but it has been an underperformer. Let's keep in mind, especially with we've seen a drag on the dollar. No, it hasn't. It hasn't. But you have to keep in mind that. And so how much investors are, especially if you look at the bond market, the bond market, foreign participation has gone down significantly. So you're not seeing as much of the volatility as, let's say we were used to, you know, take, for example, during the taper tantrum where you saw IDR volatility really high. But of course, because of that, foreign participation has come down quite substantially. That's obviously meant that there's less disruption or as much as less as what we've seen in the past. And then, of course, you have the BSE coming in, supporting the currency consistently. That's also provided a buffer for the Indonesian rupiah. And of course, you have that ongoing slide in the dollar and you've seen that there has been an outperformance of a lot of the Asian currencies because not only because of the dollar has been sliding, but because also the yuan has been quite stable and that's been really an anchor for the rest of the region. So in a way, Indonesia and Thailand being buffeted by the easing monetary cycle that is expected to happen. The question really is, is that enough to lure, in fact, some of those investments? See those, you know, inflows of capital? For now, no. I think for now, investors are going to remain focused on what's happening on the political unrest, especially for Indonesia. And I think especially because you've seen the disruption become quite dangerous and quite concerning, not only for for locals, but of course for for investors as well. So I think that is is how does it end? And that becomes and the outlook becomes a lot more muddied there of how this how this unfolds. And so as long as we see any sort of political unrest, any sort of disruption, people taking it to the streets, that's going to have a real impact on assets there. How about Thailand? If you take a longer term view, would you be a buyer? Because, you know, this is a country that's that has seen a rotation of prime ministers in a huge way. Two prime ministers have been kicked out in the last three years. Yeah, it's interesting because even if you see at the performance of the Thai baht, the Thai baht has been actually relatively stable given the unrest because of that fact, because we've seen a lot of political changes in Thailand over the course of the year. So you can argue and say that we're a lot more used to it as investors in terms of what's happening in Thailand. But it's really going to four, but it's really going to be on Indonesia this time around because risk premium. Talk about risk premiums right now. Mary, thank you so much for that. Live market strategist Mary Nicola. Still to come on the show, Alibaba rallying hard this Monday after touting steady progress in AI. We'll have more details next. Keep it here with us. This is Glenn. Take a look at that. Alibaba leading gains in China's tech giants today after reporting a surge in AI revenue. The stock jumping as much as 19% for its biggest gain in almost three years. China's e-commerce leader reported a triple digit percentage gain in AI revenue alongside better than expected sales in its cloud division. Alibaba's progress on AI helping to offset investor concerns of its price war with Meituan and JD dot com in China's massive food delivery sector and Alibaba's rally today helping China's biggest tech names extend the lead over their US peers. As this chart shows, a grouping of tech giants including Alibaba, Tencent and Sony is up by more than 50% over the past year, more than double the Nasdaq 100. Yet even with that outperformance, forward valuations for the Chinese names are still much cheaper than those for the US index. For more insights on these rival markets and the air race, let's bring in Goldman Sachs Asset Management portfolio manager and co-head of public tech investing some. Joe, so good to have you with us all. Always good to have you in the line city. So when you take a look at the air play, given that China's air play is a much cheaper valuations, are we cheaper than the US? Why wouldn't you be buying the China than try to keep on, you know, racking up gains in the U.S.? I think I think the rally certainly started in the US, but it has brought it out to areas like China because the applications around are really start to expand. But let's not forget what's happening at the US markets as well. The US markets historically grew earnings at about six or 7% that year and post high since 2022. US markets earnings, EPS is growing at double digits. So we've grown from a market that's growing at six or 7% to now a market that's growing at 11 to 12% for the next three years. We think that earnings growth is once again going to be in the double digits. And so you've seen a little bit of an expansion in the absolute valuation in the US, but we think it's much more than justified. And the thing is, and Vedere disappointed. Was it a surprise to you? I mean, expectations were sky high. It was kind of bound to disappoint. Yeah. Look, the stock's doubled in a very short period of time, so expectations had certainly got a lot higher. But I think it was a very, very good, good result. And fundamentally, the question around NVIDIA is always what happens to the trajectory of CapEx from these levels? Right? CapEx, remember, at the beginning of the year, the CapEx of the four major HYPERSCALERS was expected to be around $280 billion. You know what that number is now it's $360 billion. And so that's the single biggest KPI that's still impacting NVIDIA. And we think that models are going to get increasingly more competitive. Hyperscalers are chasing after artificial general intelligence. They're not happy with standing still right now. They understand that this is going to be the biggest technology pivot that we've seen in our lifetime and they want to be the leaders. And that race is not slowing down. And until it does, you know, Nvidia is going to continue to be interesting. The thing is, show me the money. If CapEx is so high, I want to see the returns and I'm not seeing the kind of returns that I should be seeing if I'm putting that much money. Yeah, So you might start. So part of the reason why Alibaba has been so strong today is because they're actually starting to see the returns around AI as well. You're seeing a lot of consumer Internet platforms, the level that you're investing though. So one interesting stat that in video put out over the last couple of quarters is that if you look at training versus inference workloads, inference is actually the monetization piece. Training is actually the building of the models. Right. We're now crossed over to the point where more than 50% of the workload is on inference relative to training. And so you're actually getting to the point where modernization is increasing. And we're optimistic as we look into 2026 with things like the development of AI agents, the continued monetization of consumer Internet platforms like Meta, Netflix and Spotify. The reason why these stocks have been so strong is because they are using AI and leveraging AI to actually try higher levels of monetization. So there might not necessarily be visible forms of ROI to us right now because enterprise is just getting started, but it's well underway. But you can understand why people are beginning to think about it being a bubble, right, because of the surge in the stock prices. So you're optimistic about the future, but you have changed your mind before. Yeah. Deep SEC moment did prompt you to reassess perhaps your position on NVIDIA. What what caused you to rethink again? Yeah. Look, I think what will cause us to rethink and first of all, we've been talking about an A.I. tech bubble for the last ten years, right? It's 2015. It's. Oh, it's a bubble of 2016. It's a bubble. It's just a reality. And by the way, the reason why is because we had to start such a sharp correction down that there's a rally up has been so powerful that people are saying, hey, we need to be cautious. But if you think about 2025 in isolation, the Nasdaq is up 12% over the last ten years. The Nasdaq has average about a 16% return per year. So we're just really just back on track. To where it has been. Right. And if you told me at the start of the year that the single most important KPI for a trade is CapEx and I CapEx has gone from 280 billion to 360 billion. And now the trajectory going forward is many, many people think that it's going to be more than the size of the US Department of Defense spending, which is crazy to think about. Then you've got to think that the trade continues to have legs. So how do you play this? I mean, do you buy the dip? Yeah, I mean, this is a this is a period of digestion. So like stocks, any time, every dip by every dip, you know, you buy every dip. So you have to think about what's happening and you have to really go into the mindset of these people that are the companies that are spending this large amount of capital. So if you think about what meta is thinking, that is just hiring engineers for $100 billion per engineer, is that because they're going to stop spending on AI tomorrow? No, you have to think about what they're chasing after. And the big goal of what they're trying to chase after is AGI. And AGI is trying to unearth something beyond what humans are capable of today. So how do we cure cancer? How do we solve climate change? How do we solve like, are there aliens in existence? Right? There's like things that human intelligence can't currently comprehend and we're trying to move towards that AGI and we're just scratching the surface on that. I just don't see them slowing down in terms of that. So outside of any kind of big multi standard deviation event where we lead to a big correction, I just think that the medium to long term trajectory of spend is upward, not downward. And so for those reasons I'd probably be buying a lot of the dips. I'm a little bit nervous because I think there are risks there and I guess risk being underpriced right now. How do you hedge? I mean, you know, just in case you're wrong. Yeah. Yeah. So, look, I think you have to think about it in and one of the things about Goldman is what we try to pride ourselves on is trying to be humble. And anytime the fact pattern changes, we're going to change our opinion as well, Right? At least the investing culture is is that way. And so, you know, we're going to continue to look for signposts that maybe we are wrong on this, including like what? What signposting. So basically, any time that we think there's indicators that the CapEx director is slowing, think about it. That's the most important KPI right now in the whole AI CapEx trade. And so what we're going to look for is any indications that that's slowing down some great perspective do come back again. So Joe, portfolio manager and co-head of public tech investing at Goldman Sachs Asset Management. Coming up, Chinese President Xi Jinping urges allies to oppose any Cold War mentality as a CSO summit gets underway in Tianjin. Read Life from the event next. Keep it here with us. This is Bloomberg. We should seek common ground while putting aside differences, allow for shared aspirations of a source of strength and advantage and the will to seek commonality while shelving differences reflects wisdom and vision. Chinese President Xi Jinping. Speaking at the CSO summit in Tianjin. North Asia correspondent Stephen Engle is at the event and joins us now. Steve, it is a much anticipated speech given the political dynamics in the world today. What was President Xi's key message when he addressed the summit in the last hour? Well, essentially that if they work together, they can share in prosperity and in peace. So that's a broad brushstrokes, no doubt. But he's banking a lot on the building out of the SCO as a regional bloc of strategic alliances. Yes, it's just ten members. With Belarus being the more recent addition as a full time member. But there are 26 in total, including partners and observers. And, you know, you have, for the first time in many years, essentially up on the same podium, the presidents of China, of Russia, of India, of Pakistan and of Iran. So that in itself is a regional bloc of quite significant magnitude. And no doubt that this SCO in particular being held in China will be more prominent. It will be the largest. It is the largest probably since it was founded in 2001. But again, one of our guests in the previous hour talked about it's no doubt going to be more prominent. Will it be more relevant? That's the good question. As as a counterweight, if you will, to the US led world order. Now, for me, the biggest interesting point is that man there you see on your screen, Narendra modi and China's courting of détente with India. Surely over the last five years there's been differences between New Delhi and Beijing, highlighted it well, lowlight it, if you will, by the border skirmishes in 2020 to the point now where there is a chance of an opening, given Washington's 50% tariff on Indian goods going to the United States, something that was probably surprised New Delhi quite a bit. So Beijing sees an opportunity to bring India into the fold, if you will. But again, keep in mind, India has a long standing strategy of not necessarily taking sides. They have the policy of strategic autonomy. Yes, they're part of BRICS. Yes. They're also part of the quad security arrangement. But they also want to remain neutral in many ways to maintain their flexibility. And, of course, that's come to the fore. You talked about Indian Prime Minister Modi, President Xi. We know both men met over the weekend. What transpired, what was achieved? Yeah. So Modi announced that they're going to resume direct flights. I mentioned about the difficulties of the last five years. So the main at least news point that came out late yesterday was that they're going to be resuming flights. Indigo Airlines says already that they're willing to start up flights. Air India also likely involved. Also before the flights that were disrupted, we had the three main airlines, Air China, China, Southern and China Eastern, also flying direct routes to India. So those will likely resume as well going forward. We also, of course, have Vladimir Putin here. Putin and Xi have that. No limited partnership. How much is that going to be expanded? Will Vladimir Putin be able to convince the Chinese to purchase more energy from Russia? Of course, there's this long shelved second gas pipeline called the Power of Siberia, to which China has been reluctant to pony up the money to build out that one. Could that possibly be something that could be moved forward? It's pie in the sky right now. I think a lot of the the the headlines that we're going to get is just about this Tianjin initiative that will be released later today. We're getting bits and pieces of a preliminary draft that's going to be highlighting a lot about the security in the region across Central Asia and of course, the terrorist attacks in Gaza, as well as the terrorist attacks back in April in Jammu Kashmir. So we're waiting to get the details on that. That's probably the biggest newsmaking event coming later today. Steve, thank you so much for that. Chief north Asia correspondent Stephen Engle on the ground in Tianjin. Let's get further perspective on the CISO summit with Ashok Canton, former Indian ambassador to China. He's currently honorary fellow at the Institute of Chinese Studies. Ambassador, good to have you with us. We know that this is Professor Modi's first trip to China in seven years. Meeting Xi Jinping in person. Do you see this as a diplomatic hedge or a counterweight? How are you assessing this visit? Well, I don't see that either as diplomatic hedge or contrary to what we are doing. You know, after an extended period of downturn relations, for reasons you are aware of since October last year when Prime Minister Modi met with President Xi, we are trying to rebuild India-China relations and that process has been taken forward yesterday when the two leaders met. I think there is a desire to sort of step up to what we call people centric contacts and also economic engagement. The Prime Minister made it very clear that we will pursue strategic autonomy and we are not looking at India-China relations through the prism of a third country. And that was an important message, essentially allaying certain that perceptions that India is trying to move closer to China to compensate for certain difficulties we have with the US at this point of time. Our relations with the U.S. are extremely important, notwithstanding current turbulence which we are witnessing and we are not interested in, in less sort of being a counterweight to or joining up with China or Russia or this year to counter us. Likewise, when Steve referred to in a developing issue as a bloc that has not been India's policy, we believe that the ACA was conceived initially as a platform for combating terrorism and it has acquired a digital agenda so it can play an important role. And today we are faced with terrorism. We hope there will be a forceful message coming out of Asia, outcome documents later today. All right. But we would like no escort to remain a platform for functional cooperation rather than becoming a geopolitical instrument. So Fara, to describe India's foreign policy as being anchored in diversification. Yes. I mean, that has been their policy goal. We follow mental strategic autonomy. We follow, you know, multi alignment. They we believe, you know, we can have very good relations with all major countries and Global South at the same time today. You know, given all the difficulties on the U.S. there, clearly there is a greater incentive to explore their options, particularly in terms of expansion of fair trade and investment links and China being the second largest economy in the world. So it's a it's it's an option that we are exploring. So one message which came across clearly is that we are trying to reset the developmental partnership with China is not going to be easy because there are all kinds of difficulty in the relationship. But we are we are trying to move in that direction. We heard from my colleague Steve earlier about the initiatives announced over the weekend, the resumption of flights, the easing of export controls. Are these concrete, are these meaningful or are they symbolic because they're they will be difficult to implement for some of them at least? Well, as far as direct flights are concerned, that understanding at least earlier this year, you know, we have technical talks going on. In fact, we had a visit of a delegation there to Beijing just a few days ago to work out modalities, including an updated air services agreement. We hope that will happen soon. That's something we need also know in terms of liberalisation or visa. Now, in terms of greater trade and investment flows, I think those are objectives India would like to pursue while at the same time mindful of the challenges there, you know, particularly need to ensure economic security. Because recently we saw how China is seeking to weaponize India's dependencies on imports from China, certain products that are not limited to India that they have done with other partner countries as well. So we'll I'm sure our leadership will keep that in mind while moving ahead. So it will be a process of calibrated step by step improvement of relations. And at the same time, I think we are very clear that the border areas must remain peaceful. That is essential for continued, you know, normalization of relations. And also, we would like to see some progress towards the boundary settlement. And when the foreign Minister, Wang Yi, was in India, but, you know, two weeks ago, I think that matter received a lot of attention and some new understandings have been reached. Maybe they need to be followed through now. Some of these lingering issues like China-US relations, military relations, and Pakistan might be, I guess, limited India's engagement with China. I guess they will. Indoor in Oman. Prime Minister told President Xi that there we are partners and rivals. But the fact remains that there are areas where we have very serious concerns about China's policies. For instance, during recent for the hostilities that we had with Pakistan in May, China provided very significant operational support to Pakistan, apart from new advanced Chinese weapon systems being deployed there in combat situation for the first time against India. There are other issues, including this massive potential hydropower project which is coming up in India's immediate vicinity, which is three times the size of Three Gorges Project, present day largest in the world. And there are several other issues which will be taken into account there while developing the, say no process of fair rebuilding relations. So the rebuilding relations, I don't think we are there anywhere close to a reset in India-China ties. India and China are among the biggest economies in the world, growing in excess of, what, 5% for China and much higher for India. How might they reshape global trade? You know, this is one matter which was discussed yesterday, that day. How can we work together to to impart greater stability to global trade? China is one of the largest trading partners, but problem is that we have a huge trade deficit with China. And this is something which is flagged by Prime Minister Modi of President Xi yesterday of you would like, you know, WTO to become a more effective platform. As you know, it has not been functioning well for the right reasons. But what we can achieve between India and China, frankly, is somewhat limited because, you know, there are very serious structural problem problems today in the way multilateral institutions are working, and many of them are, in fact, comatose. So bringing them back to life is not going to be easy at all, especially when an open U.S. is trying to sort of further move away from its global commitments. And Europe also is preoccupied with a lot of issues. So given the unreliability of the U.S. in this case, might Asian countries now lean towards each other as as as a strategy? Do you see that happening? You know, you would have noticed that, Deb, before they're going to continue their prime minister had gone to Japan and it was a very substantive visit. You know, it's a relationship we have tried to develop for quite some time. So we will they will definitely been or tried to develop these major relationships as also engagement with the Global South. But, you know, I would like to underline that for India, US remains an essential partner. It's a. Critical relationship. We are quite unhappy at present with kind of negative signals we are receiving from Trump administration. Both President Trump personally and some of his senior advisers. They have caused a lot of federal heartburn and they are no doubt about it. But we are taking a longer term view. We would like to address those issues and clearly we don't. Ambassador? Oh, yeah. No, we don't see that. We have to. Yeah. I'm just last point. We thank you so much for your insights, Ambassador. Yeah. I'm afraid we have to leave it there. I shall contact former aide and ambassador to China. Now, before we go, here's a look at our show tomorrow. We'll continue keeping an eye on the latest developments in Indonesia and Thailand with bar group Asia's nadir. Now, that is it for INSIGHT Horizon's Middle East and Africa is next. This is Mumbai.",
  "medium": "Video",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "China",
      "weight": 0.054528933
    },
    {
      "name": "Air China",
      "weight": 0.05292933
    },
    {
      "name": "China Eastern",
      "weight": 0.052642364
    },
    {
      "name": "many people",
      "weight": 0.049654026
    },
    {
      "name": "people",
      "weight": 0.04824939
    },
    {
      "name": "people centric contacts",
      "weight": 0.044038214
    },
    {
      "name": "India",
      "weight": 0.04177012
    },
    {
      "name": "many years",
      "weight": 0.041659556
    },
    {
      "name": "Air India",
      "weight": 0.04134453
    },
    {
      "name": "October last year",
      "weight": 0.041096915
    }
  ],
  "topics": [
    {
      "name": "Social Issues"
    },
    {
      "name": "Protests"
    },
    {
      "name": "Crime"
    }
  ],
  "categories": [
    {
      "name": "General"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.95263671875
    },
    {
      "name": "/Sensitive Subjects/War & Conflict",
      "score": 0.8759765625
    },
    {
      "name": "/News/World News",
      "score": 0.80419921875
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.787109375
    },
    {
      "name": "/People & Society/Social Sciences/Political Science",
      "score": 0.63671875
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.63134765625
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.39404296875
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.378662109375
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.374267578125
    }
  ],
  "sentiment": {
    "positive": 0.057113074,
    "negative": 0.79693675,
    "neutral": 0.14595021
  },
  "summary": "Indonesian President Prabowo Subianto has faced a significant test as he attempts to quell a wave of unrest, which has resulted in at least four deaths and hundreds injured. Protests began over rising costs of living, with government buildings being burned and looters targeting the homes of the finance minister and several lawmakers. Parliament has removed lawmaker's allowances, which sparked outrage for being nearly ten times the monthly minimum wage. Concerns over political instability have sent Indonesian stocks to the most in nearly five months. However, the rupiah is relatively steady as the central bank continues its intervention in the currency market. Supriya Sharma, a visiting fellow at the Asia Institute, suggests that the public distrusts the political system and that the president failed to act swiftly. She also discusses the US-China rivalry with India's Narendra modi, as India shows up ties with China and Russia.",
  "shortSummary": "Indolese markets tumbled as violent protests over rising costs and corruption intensified, impacting investor confidence and political stability, amid concerns over economic stability and corruption.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "84dd405131aa480c9fc794f914d4edf4",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Indonesia’s widespread protests over rising living costs have shaken investor confidence, causing stocks to fall and prompting the central bank to intervene in the rupiah, while Thai markets remain under pressure amid political uncertainty. Alibaba’s AI revenue surge has boosted Chinese tech stocks, but the broader market still lags U.S. valuations. Meanwhile, Chinese President Xi’s speech at the SCO summit and India’s outreach to China signal a potential shift in regional alliances, though strategic autonomy remains a key theme for India. These developments collectively add volatility to Asian equities, FX, and risk‑premium dynamics across the region.",
  "argos_id": "9LHAVVT7E"
}