{
  "url": "https://www.forbes.com/sites/siladityaray/2025/09/01/powerful-earthquake-in-afghanistan-kills-at-least-610-people-thousands-injured/",
  "authorsByline": "Siladitya Ray, Forbes Staff",
  "articleId": "f30b5cb6a00e49bba702fa6bb882c14d",
  "source": {
    "domain": "forbes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NJ",
      "county": "Hudson County",
      "city": "Jersey City",
      "coordinates": {
        "lat": 40.7215682,
        "lon": -74.047455
      }
    }
  },
  "imageUrl": "https://imageio.forbes.com/specials-images/imageserve/68b53a167cbe27990a87a122/0x0.jpg?width=960",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-01T02:42:09-04:00",
  "addDate": "2025-09-01T06:49:46.221299+00:00",
  "refreshDate": "2025-09-01T06:49:46.221300+00:00",
  "score": 1.0,
  "title": "At Least 610 Dead After Strong Earthquake Strikes Afghanistan",
  "description": "The epicenter of the 6.0 magnitude temblor struck near the Afghan-Pakistan border, and the death toll is expected to rise.",
  "content": "At least 610 people have died and more than a thousand have been injured after a powerful earthquake struck eastern Afghanistan near the country’s border with Pakistan, the latest in a series of deadly seismic events the country has faced in the past few years. Injured Afghan people receive treatment at a hospital after an earthquake in Afghanistan's Jalalabad.\n\nCiting local authorities, the Associated Press reported that at least 1,300 people have been injured by the quake, and the death toll could rise further. According to the United States Geological Survey’s tracker, the 6.0 magnitude quake’s epicenter was located approximately 17 miles from Jalalabad, a city with a population of around 300,000 people. The epicenter was at a depth of only 5 miles below the surface and such shallow quakes tend to be more destructive. According to The New York Times, aftershocks of the earthquake could be felt in Kabul throughout Sunday night, although it is unclear if there were any casualties in the Afghan capital, located 100 miles away from Jalalabad.\n\nIn a post on X, a spokesperson for Afghanistan’s Taliban run government, Zabihullah Mujahid, said: “Sadly, tonight's earthquake has caused loss of life and property damage in some of our eastern provinces. Local officials and residents are currently engaged in rescue efforts for the affected people.”",
  "medium": "Article",
  "links": [
    "https://apnews.com/article/afghanistan-earthquake-jalalabad-52d1948cde125c9ca8a01ebda08e7919",
    "https://x.com/Zabehulah_M33/status/1962271404436369530",
    "https://www.nytimes.com/2025/08/31/world/asia/afghanistan-earthquake-jalalabad.html",
    "https://earthquake.usgs.gov/earthquakes/eventpage/us7000qsvj/region-info"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Strong Earthquake",
      "weight": 0.10325509
    },
    {
      "name": "eastern Afghanistan",
      "weight": 0.09743287
    },
    {
      "name": "Injured Afghan people",
      "weight": 0.09710068
    },
    {
      "name": "such shallow quakes",
      "weight": 0.09203245
    },
    {
      "name": "Afghanistan",
      "weight": 0.08273531
    },
    {
      "name": "deadly seismic events",
      "weight": 0.07620003
    },
    {
      "name": "local authorities",
      "weight": 0.07001603
    },
    {
      "name": "Local officials",
      "weight": 0.06780949
    },
    {
      "name": "rescue efforts",
      "weight": 0.06672946
    },
    {
      "name": "Zabihullah Mujahid",
      "weight": 0.066549525
    }
  ],
  "topics": [
    {
      "name": "Earthquakes"
    }
  ],
  "categories": [
    {
      "name": "Weather"
    }
  ],
  "taxonomies": [
    {
      "name": "/Sensitive Subjects/Accidents & Disasters",
      "score": 0.9482421875
    },
    {
      "name": "/Sensitive Subjects/Death & Tragedy",
      "score": 0.86767578125
    },
    {
      "name": "/News/Other",
      "score": 0.82568359375
    }
  ],
  "sentiment": {
    "positive": 0.052900337,
    "negative": 0.7880658,
    "neutral": 0.15903394
  },
  "summary": "A powerful 6.0 magnitude earthquake has resulted in at least 610 deaths and more than 1,300 injuries, according to the Associated Press. The quake's epicenter was located just 17 miles from the city of Jalalabad, Afghanistan. It is the latest in a series of deadly seismic events the country has faced in the past few years. Aftershocks could be felt in the country's capital, although no deaths were reported.",
  "shortSummary": "A powerful 6.0 magnitude earthquake hit eastern Afghanistan, leaving at least 610 people dead and 1,300 injured.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "ebffb3d9661647f99106f009a5a14cec",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://apnews.com/article/afghanistan-earthquake-jalalabad-52d1948cde125c9ca8a01ebda08e7919",
      "text": "An earthquake destroys villages in eastern Afghanistan and kills more than 620 people\nAn earthquake destroys villages in eastern Afghanistan and kills more than 620 people\nKABUL, Afghanistan (AP) — An earthquake destroyed numerous villages in eastern Afghanistan, killed at least 620 people and injured more than 1,300, a spokesman for the Taliban government said Monday.\nThe 6.0 magnitude quake late Sunday hit a series of towns in the province of Kunar, near the city of Jalalabad in neighboring Nangahar province, causing extensive damage.\nFootage from Nangarhar showed people frantically digging through rubble with their hands, searching for loved ones in the dead of night. The injured were stretchered out of collapsed buildings and into helicopters. Villagers in Kunar gave interviews outside their wrecked homes.\nThe quake at 11:47 p.m. was centered 27 kilometers (17 miles) east-northeast of the city of Jalalabad in Nangarhar province, the U.S. Geological Survey said. It was just 8 kilometers (5 miles) deep. Shallower quakes tend to cause more damage. Several aftershocks followed.\nInterior Ministry spokesman Abdul Matin Qani told The Associated Press that 610 people had been killed and 1,300 injured in Kunar and a dozen people died and hundreds were injured in Nangarhar. Many houses were destroyed.\nBuildings in Afghanistan tend to be low-rise constructions, mostly of concrete and brick, with homes in rural and outlying areas made of mud bricks and wood. Many are of poor construction.\nOne resident in Nurgal district, one of the worst-affected areas in Kunar, said almost the entire village had collapsed.\n“Children are under the rubble. The elderly are under the rubble. Young people are under the rubble,” said the villager, who did not give his name. “We need help here,” he pleaded. “We need people to come here and join us. Let us pull out the people who are buried. There is no one who can come and remove dead bodies from under the rubble.”\nEastern Afghanistan is mountainous, with remote areas. The quake has worsened communications.\nRescue operations are underway and medical teams from Kunar, Nangarhar and the capital Kabul have arrived in the area, said Sharafat Zaman, a health ministry spokesman.\nZaman said many areas had not been able to report casualty figures and that “the numbers were expected to change” as deaths and injuries are reported. The Taliban government’s chief spokesman, Zabihullah Mujahid, said “all available resources will be utilized to save lives.”\nNearby Jalalabad is a bustling trade city due to its proximity with neighboring Pakistan and a key border crossing between the countries. Although it has a population of about 300,000 according to the municipality, it’s metropolitan area is thought to be far larger.\nJalalabad also has considerable agriculture and farming, including citrus fruit and rice, with the Kabul River flowing through the city.\nA magnitude 6.3 earthquake struck Afghanistan on Oct. 7, 2023, followed by strong aftershocks. The Taliban government estimated at least 4,000 people perished in that quake.\nThe U.N. gave a far lower death toll of about 1,500. It was the deadliest natural disaster to strike Afghanistan in recent memory."
    }
  ],
  "argos_summary": "A 6.0‑magnitude earthquake struck eastern Afghanistan near Jalalabad, killing at least 610 people and injuring more than 1,300. The shallow quake, centered 5 miles below the surface, devastated villages in Kunar and Nangarhar provinces, collapsing homes and disrupting communications. Rescue efforts are underway, with medical teams from Kabul and local authorities mobilizing to recover survivors and provide aid.",
  "argos_id": "AQV8BZD0B"
}