{
  "url": "https://www.forbes.com/sites/llewellynking/2025/08/31/texas-co-op-takes-first-step-into-data-center-market-that-could-quadruple-its-size/",
  "authorsByline": "Llewellyn King",
  "articleId": "cf0e201b7de4408cbcc2d81377d1c829",
  "source": {
    "domain": "forbes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NJ",
      "county": "Hudson County",
      "city": "Jersey City",
      "coordinates": {
        "lat": 40.7215682,
        "lon": -74.047455
      }
    }
  },
  "imageUrl": "https://imageio.forbes.com/specials-images/imageserve/62fe40baadccff017f1dbcbd/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-01T03:33:14+00:00",
  "addDate": "2025-09-01T03:42:00.144385+00:00",
  "refreshDate": "2025-09-01T03:42:00.144387+00:00",
  "score": 1.0,
  "title": "Texas Co-op Takes First Step Into Data Center Market That Could Quadruple Its Size",
  "description": "Rayburn Electric Cooperative, based in Rockwall, Texas, is planning to grow. It is negotiating with a data center to become its first data center customer next year.",
  "content": "While some utilities, notably in the Midwest and New England, fear they may not meet rising demand and will have to curtail supply, others are quietly surging ahead, particularly some rural electric cooperatives.\n\nRayburn Electric Cooperative, based in Rockwall, northeast of Dallas, a rural electric bulk-power supplier to four member co-ops, is planning to grow. It is negotiating with a data center to become its first data center customer next year.\n\nDavid Naylor, Rayburn’s president and CEO, said the addition is small compared to most data center loads. “Just 400 megawatts, but it is a start,” he told me in an interview.\n\nNaylor pointed out that if it accommodated all of the data center demand it has in prospect, the utility would triple or quadruple in size. Even without data centers, Naylor said their load is increasing by 4 percent to 5 percent a year.\n\nLuckily for Rayburn, most of its power, whether self-generated or purchased, comes from natural gas, which is plentiful in Texas and has political support at the state level from the federal government.\n\nThis doesn’t mean that Naylor and Rayburn are opposed to renewables. “Our load is mostly residential and solar fits the shape of our load well, but we have nothing against wind,” he said. Although Rayburn’s wind purchases are modest and it doesn’t generate any power from wind, Texas is the wind capital of the nation.\n\nMore wind power is generated in Texas than any other state. If it were generated in another state, there might be tension between the state and the federal government. But, as Naylor said, “This is Texas, and we keep as far away from anything to do with the federal government as we can.”\n\nRayburn and the Texas system operator, ERCOT, haven’t felt any stress this summer and are in a strong position for winter. There is no chance that the disaster of Winter Storm Uri in 2021, when 254 known deaths from cold were reported, will be repeated.\n\nNaylor said a lot of equipment which froze during that storm has now been winterized, and there is much more battery storage available on the Texas system.\n\nWhile utilities seek to accommodate data center load, they also look warily at the impact of the big tech companies and their power demands on the shape of the utility.They are cautious about the impact of this massive new demand on the structure of the industry.\n\nNaylor said if the data centers start generating their own power and “coming in before the meter,” that will change the nature of the utility business.\n\nAnother pressure — seldom mentioned but raised by Naylor — is the impact of the cash-rich tech behemoths on the skilled job market. \"They can pay much more than we can, particularly for IT workers,” he said.\n\nRayburn compensates by trying to make itself a great place to work “and to devote your career to. It’s a very exciting place,” he said.\n\nOver in Colorado, United Power has celebrated the commissioning of a new natural gas plant, Mountain Peak, which its president and CEO, Mark Gabriel, told me “was conceived and built in less than two years.”\n\nNaylor and Gabriel agree: Co-ops have the ability to move with a dexterity and speed that their compatriots in the investor-owned sector of the industry don’t enjoy. Likewise, some public power entities.\n\nPublic power companies, mostly municipally owned, are answerable to a city council or other board which makes decision-making more difficult, more political and slower. The investor-owned utilities are subject to directors, shareholders and layered regulators.\n\nCo-ops are, by comparison, free agents, answerable to their customers who double mostly as their regulators.\n\nAbout 166 investor-owned utilities generate around 72 percent of the nation’s power. They hold many of the keys to the future, including the adoption of new small modular reactors and have the resources for large projects.\n\nBut co-ops enjoy the kind of freedom that makes them able to pioneer in some things — able to be adventurous, as at Rayburn and United.",
  "medium": "Article",
  "links": [
    "https://www.rayburnelectric.com",
    "https://www.unitedpower.com",
    "https://www.forbes.com/sites/llewellynking/2022/02/15/uri-fallout-texas-rayburn-electric-is-first-co-op-to-securitize-uri-debt-still-expected-to-sue/"
  ],
  "labels": [
    {
      "name": "Roundup"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "data center load",
      "weight": 0.08281643
    },
    {
      "name": "most data center loads",
      "weight": 0.08155446
    },
    {
      "name": "data centers",
      "weight": 0.07693146
    },
    {
      "name": "Data Center Market",
      "weight": 0.07645975
    },
    {
      "name": "More wind power",
      "weight": 0.07214392
    },
    {
      "name": "Public power companies",
      "weight": 0.07027068
    },
    {
      "name": "Rayburn Electric Cooperative",
      "weight": 0.063011445
    },
    {
      "name": "David Naylor",
      "weight": 0.06295587
    },
    {
      "name": "Naylor",
      "weight": 0.06287755
    },
    {
      "name": "Texas Co",
      "weight": 0.062194668
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.85595703125
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.81005859375
    },
    {
      "name": "/News/Technology News",
      "score": 0.7568359375
    },
    {
      "name": "/Business & Industrial/Energy & Utilities/Electricity",
      "score": 0.70068359375
    },
    {
      "name": "/Business & Industrial/Energy & Utilities/Other",
      "score": 0.45263671875
    },
    {
      "name": "/Business & Industrial/Energy & Utilities/Renewable & Alternative Energy",
      "score": 0.38623046875
    }
  ],
  "sentiment": {
    "positive": 0.2039256,
    "negative": 0.33449706,
    "neutral": 0.46157736
  },
  "summary": "Rural electric co-op, Rayburn Electric Cooperative, is planning to expand into the data center market, potentially doubling its size. The company is negotiating with a data center to become its first data center customer next year. Most of Rayburn's power comes from natural gas, which is plentiful in Texas and has political support from the federal government. If Rayburn could meet all of its data center demand, it could triple or quadruple its size, according to CEO David Naylor. While utilities are eager to accommodate data center load, they also worry about the impact of big tech companies' power demands on the shape of the utility. Naylor cited the potential impact of this shift on the industry's structure.",
  "shortSummary": "Rayburn Electric Cooperative is entering a data center market, facing challenges from rising demand and competition from tech giants like Google and Facebook.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "50d1d10b2e4b450ca04fc0b7a2d5f062",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.forbes.com/sites/llewellynking/2022/02/15/uri-fallout-texas-rayburn-electric-is-first-co-op-to-securitize-uri-debt-still-expected-to-sue/",
      "text": "The week of Feb. 7 history was made in Rockwall, Texas. But there was no jubilation: No hats were tossed into the air, no champagne corks popped.\nInstead, there was a sense of it is what it is. Rayburn Country Electric Cooperative, Inc., a nonprofit electric generation and transmission utility with four distribution member companies, closed on Texas’ first cooperative securitization bond, arising out of Winter Storm Uri a year earlier.\nThe bond for $908 million, and rated by Moody’s as Aaa (fs), shoulders the debt incurred by Rayburn and its 229,000 customers as a result of the extraordinary prices allowed by the state’s public utility commission and charged by the Electric Reliability Council of Texas (ERCOT) for what power was available during the Winter Storm Uri.\nThat storm layered Texas in ice and snow and freezing temperatures for five days, from Feb. 17-22. It also left, according to official counts, 246 people dead – either from freezing to death or from related accidents, such as carbon monoxide poisoning from gasoline generators operated indoors, or fires that got out of hand.\nDuring the height of the freeze, ERCOT ordered electric load shedding by utilities, including Rayburn, and left more than 5 million Texans in the frigid cold and the dark.\nGas Failure Crux of Catastrophe\nMany of the state’s 324 generation plants suffered some weather disability, but it was weather-induced failure in the gas supply —the principal fuel in Texas’ generating mix — that was at the crux of the catastrophe. What gas there was available went for stratospheric prices; and last summer gas companies, like Energy Transfer, reported earnings in the billions.\nDavid Naylor, president and CEO of Rayburn, told me that in five days of Uri, the utility spent three years’ worth of its power supply budget. The PUCT allowed electricity prices to rise to $9,000 a kilowatt hour, and kept them there longer than necessary, according to the electric utilities in the state.\nRayburn reserves the right to sue and may do so, Naylor told me.\nOther regions, from the Gulf Coast to Canada, were affected by Uri but didn’t suffer as badly as Texas.\nIn a statement, Naylor said, “Alongside our members and with thanks to policymakers, we are proud to be the first to leverage a law crafted to assist our members by mitigating the impact of egregious charges levied in the middle of a crisis. This financing goes a long way in supporting our communities as we continue to seek recovery and resolution of unjust charges from Winter Storm Uri.”\nClinton Vince, chair of the U.S. energy practice at Dentons, the globe-circling law firm, told me, “We are very pleased that our client Rayburn Country Electric Cooperative was able to successfully complete a first-of-its-kind, $908-million securitization with a Moody’s rating of Aaa (sf) to minimize the severe impact on its customers, resulting from outrageous invoices sent by ERCOT for a five-day period during Winter Storm Uri last February 3.\n“This securitization will allow Rayburn to avoid bankruptcy and to proceed as a fully viable utility while shielding its customers from the rate shock that ERCOT’s bills would have caused.”\nIt is anticipated that many other utilities in Texas, big and small, will be taking the securitization road. Securitization means that customers will still pay, but their indebtedness will be spread out over many years — in Rayburn’s case, until 2049.\nThe sad matter of Uri and the Texas grid points up both a weakness in the market in the state which, unlike other states, has no mechanism for guaranteeing reserve capacity, and the asymmetry between gas suppliers and utilities. The latter are regulated by the PUCT, and the former are lightly regulated by the Texas Railroad Commission with regard to things like drilling rigs and don’t have the electric utilities’ public service obligations.\nSecuritization Is Political Solution\nMeeting last summer, the Texas Legislature passed the securitization law but didn’t provide any other relief for the utilities in the state. It did, though, mandate that the utilities weatherize but made no such demands on the gas industry — another example of the asymmetry with their utility customers.\nPut more simply, there is one set of rules for the utilities in Texas and another for the oil and gas interests, which are politically powerful in the state and revered by the political establishment.\nAfter the gas industry declared huge profits, it also rewarded politicians with campaign funds: the largest was $1 million from Energy Transfer boss Kelcy Warren to Texas Gov. Greg Abbott’s re-election fund. Energy Transfer made $2.4 billion off Uri, according to published reports."
    },
    {
      "url": "https://www.unitedpower.com",
      "text": "Rebates & Programs\nMembers qualify for exclusive rebates and programs. Enroll in a program or apply for rebates on energy efficient electric equipment and appliances.\n500 Cooperative Way\nBrighton, CO 80603\nMember Services:\n303-637-1300\nE-mail Member Services\nReport an Outage:\n303-637-1350\nMembers qualify for exclusive rebates and programs. Enroll in a program or apply for rebates on energy efficient electric equipment and appliances.\nUnited Power has a wildfire mitigation plan to protect its members and communities. The plan is continuously evaluated and updated to reduce risk.\nOperation Round Up is a voluntary way United Power members can give to their communities by having their monthly billing statements rounded up.\nThe electric industry is progressing rapidly. Our Cooperative Roadmap highlights the co-op's objectives for success now and in the future.\nUnited Power Celebrates Mountain Peak Power Plant at Ribbon Cutting\nWe Trim Trees to Keep Your Lights On\nFour Colorado Utilities Partner to Explore Transmission Solutions\nUnited Power Promotes Jonathan Aust to Senior Vice President and Chief Energy Resource Officer\n©2025 United Power. Your Local Electric Cooperative."
    }
  ],
  "argos_summary": "Rayburn Electric Cooperative in Texas is expanding its grid to serve a new data‑center customer, projecting a 4–5% annual load growth and potentially tripling its size if it captures all data‑center demand. The co‑op recently secured a $908 million securitization bond, rated Aaa, to offset the extreme costs incurred during Winter Storm Uri and to protect customers from future rate shocks. While Texas utilities benefit from abundant natural gas and political support, the state’s lack of reserve capacity and regulatory asymmetry between gas producers and utilities remain key vulnerabilities. Co‑ops’ agility contrasts with slower investor‑owned utilities, positioning them to pioneer infrastructure projects such as new gas plants and battery storage. The article highlights the broader implications for Texas’ energy market and the evolving role of data centers in utility planning.",
  "argos_id": "CGLERWUW5"
}