{
  "url": "https://www.ajc.com/news/2025/09/trump-plans-a-hefty-tax-on-imported-drugs-risking-higher-prices-and-shortages/",
  "authorsByline": "PAUL WISEMAN and TOM MURPHY",
  "articleId": "48767adc64fa42fa986b4265ad40864b",
  "source": {
    "domain": "ajc.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "GA",
      "county": "Fulton County",
      "city": "Atlanta",
      "coordinates": {
        "lat": 33.7489924,
        "lon": -84.3902644
      }
    }
  },
  "imageUrl": "https://www.ajc.com/resizer/v2/2KSJ5OUMJVDB5K5P5VX3E4Z5OM.jpg?auth=b51b18ffd68059ebf002897e244142fa7b990b67d343315afa181ebeb29b0a66&width=1200&height=630&smart=true",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-01T08:32:53.895000+00:00",
  "addDate": "2025-09-01T08:53:59.734408+00:00",
  "refreshDate": "2025-09-01T08:53:59.734412+00:00",
  "score": 1.0,
  "title": "Trump plans a hefty tax on imported drugs, risking higher prices and shortages",
  "description": "President Donald Trump has plastered taxes on products from almost every country on earth",
  "content": "That’s starting to change. U.S. and European leaders recently detailed a trade deal that includes a 15% tariff rate on some European goods brought into the United States, including pharmaceuticals. Trump is threatening duties of 200% more on drugs made elsewhere.\n\n“Shock and awe’’ is how Maytee Pereira of the tax and consulting firm PwC describes Trump’s plans for drugmakers. “This is an industry that’s going from zero (tariffs) to the potentiality of 200%.’’\n\nTrump has promised Americans he’ll lower their drug costs. But imposing stiff pharmaceutical tariffs risks the opposite and could disrupt complex supply chains, drive cheap foreign-made generic drugs out of the U.S. market and create shortages.\n\n“A tariff would hurt consumers most of all, as they would feel the inflationary effect ... directly when paying for prescriptions at the pharmacy and indirectly through higher insurance premiums,’’ Diederik Stadig, a healthcare economist with the financial services firm ING, wrote in a commentary last month, adding that lower-income households and the elderly would feel the greatest impact.\n\nThe threat comes as Trump also pressures drugmakers to lower prices in the United States. He recently sent letters to several companies telling them to develop a plan to start offering so-called most-favored nation pricing here.\n\nBut Trump has said he’d delay the tariffs for a year or a year and a half, giving companies a chance to stockpile medicine and shift manufacturing to the United States — something some have already begun to do.\n\nLeerink Partners analyst David Risinger said in a July 29 note that most drugmakers have already increased drug product imports and may carry between six and 18 months of inventory in the U.S.\n\nJefferies analyst David Windley said in a recent research note that tariffs that don’t kick in until the back half of 2026 may not be felt until 2027 or 2028 due to stockpiling.\n\nMoreover, many analysts suspect Trump will settle for a tariff far lower than 200%. They also are waiting to see whether any tariff policy includes an exemption for certain products like low-margin generic drugs.\n\nStill, Stadig says, even a 25% levy would gradually raise U.S. drug prices by 10% to 14% as the stockpiles dwindle.\n\nIn recent decades, drugmakers have moved many operations overseas – to take advantage of lower costs in China and India and tax breaks in Ireland and Switzerland. As a result, the U.S. trade deficit in medicinal and pharmaceutical products is big -- nearly $150 billion last year.\n\nThe COVID-19 experience – when countries were desperate to hang onto their own medicine and medical supplies — underscored the dangers of relying on foreign countries in a crisis, especially when a key supplier is America’s geopolitical rival China.\n\nIn April, the administration started investigating how importing drugs and pharmaceutical ingredients affects national security. Section 232 of the Trade Expansion Act of 1962 permits the president to order tariffs for the sake of national security.\n\nMarta Wosińska, a health policy analyst at the Brookings Institution, says there is a role for tariffs in securing U.S. medical supplies. The Biden administration, she noted, successfully taxed foreign syringes when cheap Chinese imports threatened to drive U.S. producers out of business.\n\nTrump has bigger ideas: He wants to bring pharmaceutical factories back to the United States, noting that U.S.-made drugs won’t face his tariffs.\n\nDrugmakers are already investing in the United States.\n\nThe Swiss drugmaker Roche said in April that it will invest $50 billion in expanding its U.S. operations. Johnson & Johnson will spend $55 billion within the United States in the next four years. CEO Joaquin Duato said recently that the company aims to supply drugs for the U.S. market entirely from sites located there.\n\nBut building a pharmaceutical factory in the United States from scratch is expensive and can take several years.\n\nAnd building in the U.S. wouldn’t necessarily protect a drugmaker from Trump’s tariffs, not if the taxes applied to imported ingredients used in the medicine. Jacob Jensen, trade policy analyst at the right-leaning American Action Forum, notes that “97% of antibiotics, 92% of antivirals and 83% of the most popular generic drugs contain at least one active ingredient that is manufactured abroad.’’\n\n“The only way to truly protect yourself from the tariffs would be to build the supply chain end to end in the United States,’’ Pereira said.\n\nBrand-name drug companies have fat profit margins that provide flexibility to make investments and absorb costs as Trump’s tariffs begin. Generic drug manufacturers do not.\n\nSome may decide to leave the U.S. market rather than pay tariffs. That could prove disruptive: Generics account for 92% of U.S. retail and mail-order pharmacy prescriptions.\n\nA production pause at a factory in India a couple years ago led to a chemotherapy shortage that disrupted cancer care. “Those are not very resilient markets,” Brookings’ Wosińska said. “If there’s a shock, it’s hard for them to recover.”\n\nShe argues that tariffs alone are unlikely to persuade generic drug manufacturers to build U.S. factories: They'd probably need government financing.\n\n“In an ideal world, we would be making everything that’s important only in the U.S.,’’ Wosińska said. “But it costs a lot of money ... We have offshored so much of our supply chains because we want to have inexpensive drugs. If we want to reverse this, we would really have to redesign our system ... How much are we willing to spend?''\n\nMurphy reported from Indianapolis. AP Health Writer Matthew Perrone contributed to this report.",
  "medium": "Article",
  "links": [
    "https://hbr.org/2025/05/how-u-s-tariffs-stand-to-impact-prescription-drugs",
    "https://apnews.com/article/roche-switzerland-pharmaceuticals-us-trump-kellersutter-f765bcfc4b65d5e1d213d3a01d079ae8",
    "https://apnews.com/article/fact-check-trump-prescription-drug-prices-drop-b3e5bf8a98310de45e39d3911d112979",
    "https://apnews.com/article/us-eu-trade-trump-von-der-leyen-f49188375527cac6a4d458b49f641bab",
    "https://apnews.com/article/cancer-chemotherapy-drug-shortage-6a653e9f0878b4ddf05358fb90911952",
    "https://apnews.com/article/johnson-apple-north-carolina-trump-3afc1b68dd0ba09242b5d56a0e2eb86d",
    "https://apnews.com/article/tariffs-trump-pharmaceutical-semiconductor-chips-65b528a3ae455b197a26f61f847063ef"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "U.S. drug prices",
      "weight": 0.09374945
    },
    {
      "name": "stiff pharmaceutical tariffs",
      "weight": 0.08149241
    },
    {
      "name": "U.S. factories",
      "weight": 0.07947937
    },
    {
      "name": "tariffs",
      "weight": 0.07938175
    },
    {
      "name": "U.S. medical supplies",
      "weight": 0.079074934
    },
    {
      "name": "imported drugs",
      "weight": 0.07744731
    },
    {
      "name": "Generic drug manufacturers",
      "weight": 0.0771356
    },
    {
      "name": "generic drug manufacturers",
      "weight": 0.0771356
    },
    {
      "name": "drug product imports",
      "weight": 0.07593157
    },
    {
      "name": "U.S.",
      "weight": 0.07277763
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.93701171875
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.85888671875
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.845703125
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.82568359375
    },
    {
      "name": "/News/Business News/Fiscal Policy News",
      "score": 0.46337890625
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.39501953125
    },
    {
      "name": "/People & Society/Social Sciences/Economics",
      "score": 0.3408203125
    }
  ],
  "sentiment": {
    "positive": 0.09324276,
    "negative": 0.5893124,
    "neutral": 0.3174449
  },
  "summary": "The United States and European leaders have revealed a trade deal that includes a 15% tariff rate on some European goods brought into the United States, including pharmaceuticals, and Trump is threatening to impose 200% more on drugs made elsewhere. This could disrupt supply chains, drive cheap foreign-made generic drugs out of the U.S. market and create shortages. The threat comes as Trump pressures drugmakers to lower their prices in the US. However, he has said he would delay the tariffs for a year or a year and a half, allowing companies to stockpile medicine and shift manufacturing to the US, which some have already done. Many analysts believe that even a 25% levy would gradually raise U.,S. drug prices by 10% to 14% as stockpiles dwindle. The administration is investigating whether importing drugs and pharmaceutical ingredients affects national security, and there is a role for tariffs in securing U.K. medical supplies.",
  "shortSummary": "President Donald Trump plans to impose tariffs on imported drugs, potentially leading to higher prices and shortages, while considering US manufacturing flexibility.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "7851ad25aaee4219a257adf3c759f41b",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://apnews.com/article/roche-switzerland-pharmaceuticals-us-trump-kellersutter-f765bcfc4b65d5e1d213d3a01d079ae8",
      "text": "Swiss pharmaceuticals company Roche announces $50B investment in US over next 5 years\nGENEVA (AP) — Swiss pharmaceuticals powerhouse Roche announced Tuesday it plans to invest $50 billion in the United States over the next five years, creating 12,000 jobs.\nThe Basel-based company, whose array of products includes cancer medicines and multiple sclerosis treatment Ocrevus, said the investment would go toward high-tech research and development sites and new manufacturing facilities in places including California, Indiana, Massachusetts and Pennsylvania.\nSome of the $50 billion in investments were already underway or planned for the next several years, Roche spokesperson Rebekka Schnell said in an e-mail, adding that the company was not specifying how much was announced for the first time on Tuesday.\nThe announcement comes as U.S. President Donald Trump has urged foreign businesses to invest more in the United States, and announced sweeping tariffs earlier this month on imports as part of hopes to reduce a large U.S. trade deficit when it comes to sales of goods.\nBefore the Trump administration backed off its most stringent tariff plans, products imported from Switzerland had been set to face tariffs of 31% — more than the 20% tariffs on goods from the European Union. Switzerland is not a member of the 27-country bloc but is virtually surrounded by four EU countries.\nTrump’s sweeping “Liberation Day” tariffs on April 2 set off turmoil in world stock markets. A week later, Trump spoke by phone with Swiss President Karin Keller-Sutter in a conversation that her office said focused on tariffs. She emphasized the “important role of Swiss companies and investments in the United States.”\nHours later, the U.S. president announced the U-turn that paused the steep new tariffs on about 60 countries for 90 days, fanning speculation — which was not confirmed — in some Swiss media that her chat with Trump might have played a role in the change of course.\nRoche, in its statement, said that once the new, expanded manufacturing comes on line, the company “will export more medicines from the U.S. than it imports” — though it made no mention of tariffs.\n“Today’s announced investments underscore our longstanding commitment to research, development and manufacturing in the U.S.,” said Roche CEO Thomas Schinecker in a statement.\nCompany spokesperson Schnell, in the email, said “we have conducted a thorough analysis of potential scenarios over the last weeks and are well prepared to navigate them, apply mitigation measures and adapt to the changing environment.” She said the investments “have also been aligned with the Swiss government and form part of the ongoing discussions between the U.S. and Switzerland.”\nThe company — like cross-town competitor Novartis — has deep ties to the U.S. market and said it currently employs 25,000 people and operates 15 R&D centers and 13 manufacturing sites in the United States.\nThe planned investment will add 1,000 jobs at Roche in the U.S. and “more than 11,000 in support of new U.S. manufacturing capabilities,” it said, which will increase its footprint in the United States to 24 sites in eight states.\nRoche tallied more than 60 billion Swiss francs (about $74 billion) in worldwide sales last year, and nearly 25 billion francs of sales in its key pharmaceuticals division alone came in the United States. Roche’s share price has fallen by about 18% over the past month, with most of the drop coming after the U.S. tariff announcement on April 2."
    },
    {
      "url": "https://apnews.com/article/fact-check-trump-prescription-drug-prices-drop-b3e5bf8a98310de45e39d3911d112979",
      "text": "FACT FOCUS: Trump says he’s cut drug prices by up to 1,500%. That’s not possible\nDays after he sent letters instructing top pharmaceutical manufacturers to use a “most favored nation” pricing model for prescription drugs, President Donald Trump told reporters on Sunday that he had cut costs by up to 1,500%.\nBut Trump’s grandiose claim is mathematically impossible.\nHere’s a closer look at the facts.\nTRUMP: “You know, we’ve cut drug prices by 1,200, 1,300, 1,400, 1,500%. I don’t mean 50%, I mean 14 — 1,500%.”\nTHE FACTS: This is false. Cutting drug prices by more than 100% would theoretically mean that people are being paid to take medications. The Trump administration has taken steps to lower prescription drug prices, but experts say there’s no indication costs have seen such a massive drop.\nGeoffrey Joyce, director of health policy at the University of Southern California’s Schaeffer Center, called Trump’s claim “total fiction” made up by the Republican president. He agreed that it would amount to drug companies paying customers, rather than the other way around.\n“I find it really difficult to translate those numbers into some actual estimates that patients would see at the pharmacy counter,” said Mariana Socal, an associate professor of health policy and management at Johns Hopkins University who studies the U.S. pharmaceutical market. She added that Trump’s math is “really hard to follow.”\nAsked what Trump was using to back up his claim, White House spokesman Kush Desai said: “It’s an objective fact that Americans are paying exponentially more for the same exact drugs as people in other developed countries pay, and it’s an objective fact that no other Administration has done more to rectify this unfair burden for the American people.”\nThe White House provided a chart of price differentials for drugs in the U.S. and comparable countries, but did not offer any other evidence. On Sunday, Trump also described cuts to drug prices as a future development, not that already happened.\n“So we’ll be dropping drug prices,” he said. “It will start over the next two to three months by 1,200, 1,300 and even 1,400%.”\nPrices for most prescription drugs — unbranded generics are the exception — are higher in the U.S. than they are in other high-income countries. This is in large part due to the way drug prices are negotiated in the United States.\nTrump made his recent appeal in letters to 17 pharmaceutical manufacturers, the White House announced last week. He asked them to reduce costs in the U.S. by matching the lowest prices of prescriptions drugs in other comparably developed countries. Some drugmakers have since indicated that they are open to cutting costs.\nThis move follows an executive order Trump signed in May setting a 30-day deadline for drugmakers to electively lower prices in the U.S. or face new limits in the future over what the government will pay.\nThe federal government has the most power to shape the price it pays for drugs covered by Medicare and Medicaid. It’s unclear what — if any — impact the Trump administration’s efforts will have on millions of Americans who have private health insurance.\nSocal pointed out that if drug manufacturers had cut costs to the extent Trump claims, they would be shouting it from the rooftops, especially given the heat they’ve taken over the years for their pricing practices.\n“My expectation would be that they would make announcements — public announcements — and that those announcements would come way in advance of the actual effective dates when those price cuts would come into effect,” she said.\nJoyce agreed that there has been no indication of a substantial cut.\n“Not at all, not at all, none whatsoever,” he said. “And let alone 1,500.”\n___\nFind AP Fact Checks here: https://apnews.com/APFactCheck."
    },
    {
      "url": "https://apnews.com/article/johnson-apple-north-carolina-trump-3afc1b68dd0ba09242b5d56a0e2eb86d",
      "text": "Johnson & Johnson plans $55 billion in US investments over the next four years\nJohnson & Johnson says it will invest more than $55 billion within the United States over the next four years, including four new manufacturing plants.\nA number of companies have highlighted investments in the U.S. in recent months, a focus of Trump administration. J&J rival Eli Lilly and Co. announced in late February that it planned to build four new factories in the U.S. Both Lilly and J&J cited tax cut legislation passed in 2017 as factors in their U.S. investments.\nJohnson & Johnson said Friday that it is a 25% increase in investment compared with the prior four years and estimates the U.S. economic impact will be more than $100 billion a year.\n“Our increased U.S. investment begins with the ground-breaking of a high-tech facility in North Carolina that will not only add U.S.-based jobs but manufacture cutting edge medicines to treat patients in America and around the world,” Chairman and CEO Joaquin Duato said in a statement.\nThe North Carolina plant is in Wilson, just east of Raleigh. The locations of the other three facilities were not disclosed.\nAside from building four new plants, Johnson & Johnson said that it will expand several existing sites. The company is also planning to make investments in research and development infrastructure and technology.\nJohnson & Johnson’s efforts are among several companies pledging to enhance their manufacturing in the U.S. Earlier this month chip giant Taiwan Semiconductor Manufacturing Co. said that it plans to invest $100 billion in the U.S., on top of $65 billion in investments the company had previously announced.\nIn February Apple announced that it plans to invest more than $500 billion in the U.S. over the next four years, including plans to hire 20,000 people and build a new server factory in Texas.\nApple outlined several concrete moves in its announcement, the most significant of which is the construction of a new factory in Houston — slated to open in 2026 — that will produce servers to power Apple Intelligence, its suite of AI features.\n___\nAP Health Writer Tom Murphy contributed to this report."
    },
    {
      "url": "https://apnews.com/article/tariffs-trump-pharmaceutical-semiconductor-chips-65b528a3ae455b197a26f61f847063ef",
      "text": "US moves ahead on tariffs with investigations into computer chips and pharmaceuticals\nUS moves ahead on tariffs with investigations into computer chips and pharmaceuticals\nBANGKOK (AP) — The Trump administration has taken its next steps toward imposing more tariffs on key imports, launching investigations into imports of computer chips, chip making equipment and pharmaceuticals.\nThe Department of Commerce posted notices about the probes late Monday on the Federal Register, seeking public comment within three weeks. It had not formally announced them earlier.\nAlthough President Donald Trump paused most of his biggest tariff hikes last week for 90 days, apart from those for imports from China, he has said he still plans tariffs on pharmaceutical drugs, lumber, copper and computer chips.\nThe Commerce Department said it is investigating how imports of computer chips, equipment to make them and products that contain them — which include many daily necessities such as cars, refrigerators, smart phones and other items — affect national security. Section 232 of the Trade Expansion Act of 1962 permits the president to order tariffs for the sake of national security.\nThe probe includes assessing the potential for U.S. domestic production of computer chips to meet U.S. demand and the role of foreign manufacturing and assembly, testing and packaging in meeting those needs.\nAmong other aspects of the entire computer chip supply chain, the government intends to also study the risks of having computer chip production concentrated in other places and the impact on U.S. competitiveness from foreign government subsidies, “foreign unfair trade practices and state-sponsored overcapacity.”\nAfter Trump said electronics would not be included in what his administration calls “reciprocal” tariffs of up to 50% on some nations, U.S. Commerce Secretary Howard Lutnick explained in an interview on ABC News that pharmaceuticals, semiconductors and autos will be handled with “sector specific” tariffs.\n“And those are not available for negotiation,” Lutnick said. “They are just going to be part of making sure we reshore the core national security items that need to be made in this country. We need to make medicine in this country,” he said. “We need to make semiconductors.”\nThe investigation into pharmaceutical imports includes ingredients used to make such drugs and touches on many of the same aspects of relying on imports to make them.\nAsked about his plans for more tariffs on pharmaceuticals, Trump said Monday, “Yeah, we’re going to be doing that.”\nHe said it would be in the “not too distant future.”\n“We’re doing it because we want to make our own drugs,” he said.\nMore than 70% of the materials, or active pharmaceutical ingredients, used to make medicines made in the United States are produced in other countries, with India, the European Union and China leading suppliers. The U.S. produces about a fifth of all pharmaceuticals made worldwide, but consumes about 45%, far more than any other country.\nThe U.S. also is a major producer of semiconductors, but only in some areas. It relies heavily on imports from Taiwan and South Korea for certain kinds of advanced chips. In particular, Taiwan dominates advanced logic chip production at 92% of all fabrication capacity according to the International Trade Administration, with South Korea making 8%.\nProducts like laptops, smartphones and the components needed to make them accounted for nearly $174 billion in U.S. imports from China last year. The administration’s plans suggest that such electronics will still be taxed by previous (non-“reciprocal”) tariffs — and potentially under additional, sector-specific levies.\nAlthough major computer chip makers like Taiwan Semiconductor Manufacturing Corp. are investing heavily in U.S. manufacturing facilities, partly due to incentives put in place during former President Joe Biden’s time in office, the costly process of changing entire supply chains would take years.\nSeparately, the Commerce Department said Monday that it was withdrawing from a 2019 agreement that had suspended an antidumping investigation into imports of fresh tomatoes from Mexico, effective in 90 days. It said the current arrangement failed to protect U.S. growers from “unfairly priced” imports of tomatoes. Most tomatoes from Mexico will be subject to a 20.91% tariff, it said."
    },
    {
      "url": "https://apnews.com/article/us-eu-trade-trump-von-der-leyen-f49188375527cac6a4d458b49f641bab",
      "text": "The US and EU release a bare-bones account of their trade deal, but it’s a work in progress\nBRUSSELS (AP) — American and European Union officials released a bare-bones account Thursday of their trade deal that imposes a 15% import tax on 70% of European goods exported to the United States, but they left blank key areas such as wine and spirits as well as steel and indicated that talks would continue on those and a slew of other important sectors.\nThe two sides said the document was only “a first step in a process that can be further expanded to cover additional areas.” They are dealing with the vast range of goods traded between the two economies in what is the largest bilateral trading relationship in the world, involving $2 trillion in annual trans-Atlantic business.\nThe 3 1/2-page text represents a political commitment and is not legally binding. It contrasts with the typical format for trade agreements, which can be hundreds of pages long and carry legal force.\nThe key provisions are the 15% tariff on most EU goods, a zero rate on U.S. cars and other industrial goods exported to the 27-member EU, and a range of exceptions to the 15% rate for aircraft and aircraft parts, generic pharmaceuticals and pharmaceutical ingredients, with other sectors to be added for goods crucial to each other’s economies. Those goods would face lower tariffs from before President Donald Trump’s tariff onslaught.\n“The EU has agreed to open its $20 Trillion market,” Trump’s commerce secretary, Howard Lutnick, said on X. “The second largest in the world behind the great USA.”\nHe said the deal was “a major win for American workers, US industries, and our national security. Tariffs should be one of America’s favorite words.”\nEuropean officials have had to defend the deal against dismay from businesses and member governments at the higher tariffs and criticism that the EU gave away too much. European Commission President Ursula von der Leyen sold the deal as granting quick relief from the even higher U.S. tariff on EU cars of 27.5% and as opening the way for further negotiations that could exclude more goods from the 15% tariffs. The deal provides that the lower tariff on cars would apply retroactively from Aug. 1 if the EU can introduce legislation to implement its part of the deal by then, which EU officials say they will do.\n“Faced with a challenging situation, we have delivered for our member states and industry and restored clarity and coherence to transatlantic trade,” von der Leyen said. “This is not the end of the process.”\nThe chief EU trade negotiator, Maros Sefcovic, echoed those sentiments. “The alternative was a trade war with sky high tariffs ... it builds confidence. It brings stability,” he said.\nEconomists say higher tariffs slow economic growth and will be reflected in higher consumer prices.\nOne category of goods not excluded from tariffs on EU goods was wine and spirits, which had enjoyed zero tariffs on both ends since a 1997 trade deal. Sefcovic, said EU officials had not won an exemption “yet” but hoped to in future talks and that “doors are not closed forever” on that issue.\nThat means American distillers face zero tariffs in Europe the short term, but also the possibility of EU retaliation down the line, said Chris Swonger, president and CEO of the Distilled Spirits Council of the United States. “Without a permanent return to zero-for-zero tariffs on spirits, American distillers do not have the certainty to plan for future export and job growth without the fear of retaliatory tariffs returning,” Swonger said in a statement.\nThe EU has suspended retaliatory tariffs on US goods including wine and spirits until Feb. 5, 2026.\nProposals to exempt a certain amount of EU steel imports, known as a tariff rate quota, have been left unresolved pending more talks.\nThe 15% tariff is much higher than tariff levels on both sides from before Trump began imposing his tariffs, when they averaged in the low single digits. The tariffs are paid on the U.S. end, either absorbed by American businesses importing the goods, lowering their profits, or passed on to U.S. consumers in the form of higher prices at the cash register.\nThe deal also includes nonbinding EU commitments to purchase $750 billion in U.S. energy and for EU companies to invest $600 billion in the U.S. In both cases, the money would come from private companies and is based on assessment by the European Commission on what companies were planning to spend.\n___\nMcHugh reported from Frankfurt, Germany, and Hussein from Washington."
    },
    {
      "url": "https://apnews.com/article/cancer-chemotherapy-drug-shortage-6a653e9f0878b4ddf05358fb90911952",
      "text": "Cancer centers say US chemotherapy shortage is leading to treatment complications\nA growing shortage of common cancer treatments is forcing doctors to switch medications and delaying some care, prominent U.S. cancer centers say.\nThe National Comprehensive Cancer Network said Wednesday that nearly all the centers it surveyed late last month were dealing with shortages of carboplatin and cisplatin, a pair of drugs used to treat a range of cancers. Some are no longer able to treat patients receiving carboplatin at the intended dose or schedule.\nDr. Kari Wisinski has had to turn to other treatments for some patients or switch the order in which people receive their drug combinations. She said she’s done that “hoping that within three months there will be a better carboplatin supply.”\n“It’s really difficult as a physician to have these conversations with a family or a patient about not having a medication you’d like to prescribe to them,” she said.\nWisinski is a breast cancer specialist with the UW Health Carbone Cancer Center in Madison, Wisconsin, a member of the network. She said doctors, nurses and pharmacists at her center have done a good job managing the drug supply, but doing so has taken them away from other elements of care.\nOf the 27 cancer centers that responded to the network’s survey, 25 reported a shortage of carboplatin. Among the cancer centers with shortages of carboplatin, more than a third said they were unable to treat all patients according to the intended dose and schedule.\nNineteen hospitals also reported cisplatin shortages, but all said they were able to maintain the treatments for existing patients.\nThe problem started developing earlier this year, said Mike Ganio, who studies drug shortages at the American Society of Health-System Pharmacists.\n“I think it went from being a shortage to being a really bad shortage really quickly,” he said. “There’s not a whole lot of room for it to get worse.”\nGanio’s society reported the cisplatin shortage in January and then carboplatin in late March, months after a factory in India that makes both drugs paused production following an inspection that raised quality concerns.\nManufacturing problems, unexpected demand spikes and tight ingredient supplies have all contributed to a growing number of prescription drug shortages in the United States. Many patients with attention deficit/hyperactivity disorder have had a hard time filling prescriptions for Adderall this year, and drugstores ran out of children’s medicines during last winter’s cold-and-flu season.\nThere were 301 active national drug shortages through this year’s first quarter, according to the University of Utah Drug Information Service.\nThe U.S. Food and Drug Administration has taken some steps to try to ease the chemotherapy shortage. The agency is allowing the temporary importation of some foreign-approved versions of cisplatin from factories registered with the FDA.\nThat should help, but the big factor is getting the factory in India back up to full production, Ganio said.\nHe also noted that drug supply shortages are a decades-old problem.\n“We really need to get at the root causes of these shortages or they’re going to continue happening,” he said.\n___\nThe Associated Press Health and Science Department receives support from the Howard Hughes Medical Institute’s Science and Educational Media Group. The AP is solely responsible for all content."
    }
  ],
  "argos_summary": "The U.S. and EU have agreed on a 15% tariff on most EU goods, while the U.S. keeps a zero rate on cars, but Trump’s administration is still pursuing sector‑specific duties, notably a potential 200% tariff on imported pharmaceuticals that could raise U.S. drug prices and disrupt supply chains.  Trump’s threat is likely to be moderated and delayed, with analysts expecting a lower rate and a lagged impact until 2027‑28 due to stockpiling.  In response, major pharma firms such as Roche and Johnson & Johnson are committing $50 B and $55 B to U.S. manufacturing, aiming to shift production domestically and mitigate tariff exposure, but the shift will take years and may not fully shield generic makers from higher costs.  The combined tariff and investment moves signal a broader U.S. strategy to reshoring critical industries while managing inflationary pressures and national‑security concerns.",
  "argos_id": "EA9SBW2T3"
}