{
  "url": "https://www.bbc.com/news/articles/c0qljy44553o?at_medium=RSS&at_campaign=rss",
  "authorsByline": "Tessa Wong",
  "articleId": "f95afa499d04498a92440dd4ad08489e",
  "source": {
    "domain": "bbc.com",
    "paywall": false,
    "location": {
      "country": "gb",
      "state": "",
      "county": "",
      "city": "London",
      "coordinates": {
        "lat": 51.5073219,
        "lon": -0.1276474
      }
    }
  },
  "imageUrl": "https://ichef.bbci.co.uk/news/1024/branded_news/38f6/live/b673be30-86fa-11f0-b936-3914273c9c85.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-01T08:32:33.375000+00:00",
  "addDate": "2025-09-01T08:46:17.995303+00:00",
  "refreshDate": "2025-09-01T08:46:17.995305+00:00",
  "score": 1.0,
  "title": "Ukraine war: Vladimir Putin says he reached 'understandings' with Donald Trump over war's end",
  "description": "The Russian president also defended his decision to invade Ukraine, once again blaming the war on the West.",
  "content": "Putin says he reached 'understandings' with Trump over end of Ukraine war\n\nVladimir Putin was speaking at the Shanghai Cooperation Organisation summit held in Tianjin, China\n\nFollowing the Alaska meeting , US special envoy Steve Witkoff said Putin had agreed to security guarantees for Ukraine as part of a potential future peace deal, though Moscow has yet to confirm this.\n\nSpeaking during a summit in China, Putin continued to defend his decision to invade Ukraine, once again blaming the war on the West.\n\nBut he did not say whether he would agree to peace talks with Ukrainian President Volodymyr Zelensky brokered by Trump, who had apparently given Monday as a deadline for Putin's response.\n\nRussian President Vladimir Putin says he reached \"understandings\" with US President Donald Trump over the end of the Ukraine war, at their meeting in Alaska last month.\n\nPutin was speaking in Tianjin at the Shanghai Cooperation Organisation summit, where he met Xi Jinping and Narendra Modi.\n\nHe thanked the Chinese and Indian leaders for their support and their efforts to \"facilitate the resolution of the Ukrainian crisis\".\n\nChina and Russia are the biggest buyers of Russian crude oil, attracting criticism from the West that they are propping up the Russian economy which has been battered by the war effort.\n\nIn his speech, Putin also said that the \"understandings reached\" at his meeting with Trump in Alaska are \"I hope, moving in this direction, opening the way to peace in Ukraine\".\n\nAt the same time, he reiterated his view that \"this crisis wasn't triggered by Russia's attack on Ukraine, but was a result of a coup in Ukraine, which was supported and provoked by the West\".\n\nHe also attributed the war to \"the West's constant attempts to drag Ukraine into Nato\".\n\nThe Russian president has consistently opposed the idea of Ukraine joining the Western military alliance.\n\nIt was in 2014 that Putin seized Crimea and Russian proxies grabbed part of eastern Ukraine. Years later, in February 2022, Putin then ordered Russia's full-scale invasion of Ukraine.\n\nPutin's comments come days after Russia launched its second biggest aerial attack on Ukraine in the war.\n\nOn Friday, French President Emmanuel Macron said that Putin faced a Monday deadline set by Trump to agree to peace talks with Zelensky.\n\nIf the Russian leader does not agree, \"it will show again President Putin has played President Trump\", said Macron.\n\nBut in an interview with CNN, on 22 August, Trump himself again gave Putin \"a couple of weeks\" to give a response before the US takes action, in the latest of a series of ultimatums and deadlines he has issued to the Russian leader.\n\nTrump had previously said he could solve the Ukraine war in one day.\n\nFollowing his meeting with Putin last month, Trump dropped a demand for a ceasefire and called instead for a permanent peace deal.\n\nHe also met Ukrainian President Volodymyr Zelensky along with top European leaders who paid an urgent visit to Washington DC.\n\nTrump insisted there would be \"no going into Nato by Ukraine\" as part of a peace deal.\n\nBut he also hinted there would be security guarantees, saying Europe was the \"first line of defence\" and that the US would be involved.\n\n\"We'll give them good protection,\" he said, though he clarified it would not mean sending US troops to Ukraine.\n\nThe president's special envoy Steve Witkoff also told CNN that Putin had agreed to security guarantees.\n\nHe said this would see the US and Europe \"effectively offer Article 5-like language to cover a security guarantee\", referring to the Nato clause which states that member states should defend another member that has come under attack.\n\nZelensky said he expected a framework for security guarantees to be set out on paper as soon as this week.\n\nBut last Friday Russia criticised Western proposals as \"one-sided and clearly designed to contain Russia\", adding that it turned Kyiv into a \"strategic provocateur\".\n\nRussian attacks have also continued. Last Thursday Moscow fired 629 drones and missiles at Kyiv, killing 23 people in one of the biggest aerial assaults of the war so far that prompted outrage from European leaders.\n\nGermany and France have since pledged to put pressure on Russia to agree to a deal.\n\nMeanwhile, Zelensky has rejected proposals for a buffer zone with Russia as part of a peace deal.\n\nHe has accused Russia of not being ready for diplomacy and seeking ways to postpone the end of the war.",
  "medium": "Article",
  "links": [
    "https://www.bbc.com/news/articles/crm4ln2ekg1o",
    "https://www.bbc.co.uk/news/articles/cj0q964851po",
    "https://www.bbc.com/news/articles/cy9834jp9qno",
    "https://www.bbc.com/news/articles/c04r0z1pr25o"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Ukraine war",
      "weight": 0.102550246
    },
    {
      "name": "Russian President Vladimir Putin",
      "weight": 0.09893806
    },
    {
      "name": "President Putin",
      "weight": 0.0946057
    },
    {
      "name": "US President Donald Trump",
      "weight": 0.09126024
    },
    {
      "name": "President Trump",
      "weight": 0.086595684
    },
    {
      "name": "Vladimir Putin",
      "weight": 0.084410146
    },
    {
      "name": "Ukraine",
      "weight": 0.08403829
    },
    {
      "name": "eastern Ukraine",
      "weight": 0.08243163
    },
    {
      "name": "Putin",
      "weight": 0.08165094
    },
    {
      "name": "Russia",
      "weight": 0.07490256
    }
  ],
  "topics": [
    {
      "name": "Russia-Ukraine War"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.97802734375
    },
    {
      "name": "/Sensitive Subjects/War & Conflict",
      "score": 0.92236328125
    },
    {
      "name": "/People & Society/Social Sciences/Political Science",
      "score": 0.89208984375
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.85888671875
    },
    {
      "name": "/News/World News",
      "score": 0.83984375
    }
  ],
  "sentiment": {
    "positive": 0.099897034,
    "negative": 0.6332211,
    "neutral": 0.26688182
  },
  "summary": "Russian President Vladimir Putin has stated that he reached \"understandings\" with US President Donald Trump over the end of the Ukraine war. This statement was made during a summit in Tianjin, China, where Putin defended his decision to invade Ukraine and blamed the war on the West. However, he did not confirm whether he would agree to peace talks with Ukrainian President Volodymyr Zelensky. US special envoy Steve Witkoff reported that Putin had agreed to security guarantees for Ukraine as part of a potential peace deal. This comes after Russia launched its second largest aerial attack on Ukraine in the war.",
  "shortSummary": "Russian President Vladimir Putin reached agreement with US President Donald Trump on ending the Ukraine war, but remains non-committal about peace talks with Ukraine's leader.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "cb7d869c1a9a47bf9692386406c14f3a",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.bbc.com/news/articles/cy9834jp9qno",
      "text": "Kyiv in mourning after strikes as allies discuss military support\nA day of mourning is being observed in Kyiv after the second biggest Russian aerial attack of the war so far killed at least 23 people, including four children, and injured dozens of others.\nThe city's mayor, Vitaly Klitschko, said it was to honour the dead, as a massive recovery effort continues at the five-storey block of flats where 22 of the 23 were killed.\nThe attack has been widely condemned - the White House said President Donald Trump was \"not happy\" but not surprised, while European Union Commission President Ursula von der Leyen said Russia would \"stop at nothing to terrorise Ukraine\".\nMeanwhile, EU defence ministers are meeting in Copenhagen, Denmark to discuss support for Ukraine.\nThe drone and missile strikes also damaged the EU's diplomatic mission and the British Council building in central Kyiv.\nSpeaking on the way into Friday's meeting, Lithuania's Defence Minister Dovilė Šakalienė said Russian President Vladimir Putin was \"cheaply buying time to kill more people\".\n\"Hopes of possible peace negotiations are at least naïve when we look at what is happening in Ukraine and what just happened [on Thursday],\" she added.\nEstonia's Defence Minister Hanno Pevkur said the best security guarantee for Ukraine would be membership of Nato.\nOn Friday, the Swedish government summoned its Russian ambassador to protest the continued attacks on Ukrainian cities and civilians - following a similar action by the UK on Thursday.\nOvernight from Thursday into Friday saw less fighting, although both Russia and Ukraine reported shooting down dozens of drones.\nKharkiv regional head Oleh Syniehubov said five settlements in his region had been attacked, with one person being killed in Kupyansk.\nThe Ukrainian military said it had carried out overnight strikes on a facility in Russia's Bryansk region which it said was responsible for pumping fuel to supply Moscow's war effort.\nTrump had hoped to organise a summit involving Ukrainian President Volodymyr Zelensky and Putin to bring an end to the war, but those efforts have since stalled.\nSpeaking after Thursday's attack, Zelensky said Moscow had chosen \"ballistics instead of the negotiating table\", and reiterated the need for \"new, tough sanctions\" on Russia.\nSpeaking after a meeting with French President Emmanuel Macron on Thursday, German Chancellor Friedrich Merz said it seemed unlikely now that a meeting between Putin and Zelensky would take place.\nRussia's Foreign Ministry spokeswoman Maria Zakharova told reporters on Friday that current western proposals for a security guarantee risked turning Ukraine into what she called a \"provocateur\" on Russia's border.\nRussia has long argued against any western military presence in a post-war Ukraine."
    },
    {
      "url": "https://www.bbc.co.uk/news/articles/cj0q964851po",
      "text": "Why did Putin's Russia invade Ukraine?\n- Published\nWhen Russian President Vladimir Putin ordered up to 200,000 soldiers into Ukraine, his aim was to sweep into the capital, Kyiv, in days, overthrow its pro-Western government and return Ukraine to Russia's sphere of influence.\nPutin failed but, more than three years on, a fifth of Ukrainian territory is in Russian hands.\nUS President Donald Trump has been pushing for a peace deal, and is set to meet his Russian counterpart in Alaska on Friday, for what the White House has described as \"one-on-one\" talks. However, previous optimism over an agreement has not led to any progress.\nWhy did Putin invade Ukraine?\nLaunching the biggest European invasion since the end of World War Two, Putin gave a fiery speech on TV declaring his goal was to \"demilitarise and denazify\" Ukraine.\nRussia has repeatedly painted modern Ukraine as a Nazi state, in a crass distortion of history.\nPutin had already seized Ukraine's Crimean peninsula eight years earlier, after a revolution that ousted Ukraine's pro-Russian president and replaced him with a more pro-Western government.\nPutin then triggered a lower-level war in Ukraine's eastern Donbas region, with pro-Russian proxy forces occupying territory and setting up rebel states supported by Moscow.\nBut the 2022 invasion was on a different scale.\nPutin had just recognised the rebel states as independent. Then, as the invasion began, he said the people there - many of whom are Russian speakers - needed protection from the Kyiv \"regime\".\nA day later, Putin called on Ukraine's military to \"take power into your own hands\" and target the \"gangs of drug addicts and neo-Nazis\" running the government.\nHe then added another objective - to ensure Ukraine stayed neutral. He accused the Western defensive alliance, Nato, of trying to gain a foothold in Ukraine to bring its troops closer to Russia's borders.\nThe Russian leader has long questioned Ukraine's right to exist, claiming that \"modern Ukraine was entirely created by Russia\" after the communist revolution in 1917.\nIn a long-winded 2021 essay he even suggested \"Russians and Ukrainians were one people\" dating back to the late 9th Century. Last year he told US TV talk show host Tucker Carlson that Ukraine was an \"artificial state\".\nThose comments have led many to believe that the goal of the invasion was in effect to erase the state of Ukraine.\nRussia's state-run Ria news agency explained that \"denazification is inevitably also de-Ukrainisation\" - seemingly tying the idea of erasing Ukraine to the stated goal of the invasion.\nUkrainian culture and identity have in fact existed for centuries independently of Russia.\nDoes Putin want to get rid of Zelensky?\nPutin has long sought to get rid of Ukraine's elected pro-Western president, and Zelensky was apparently a target from the very start of the war.\nRussian troops made two attempts to storm the presidential compound soon after the invasion, according to Zelensky's adviser, and Ukraine's elected leader said they wanted him dead.\n\"The enemy has designated me as target number one; my family is target number two.\n\"They want to destroy Ukraine politically, external by destroying the head of state.\"\nZelensky said later that Putin had initially tried to replace him with the wealthy head of a pro-Russian party, Viktor Medvedchuk, who was accused of treason in Ukraine and is now in Russia.\nEven now, Putin has not agreed to peace talks with Zelensky and his officials call him a \"loser\" and a \"clown\". He has spoken of the Ukrainian leader's \"illegitimacy\" - a false narrative that has also been repeated by Trump.\nAs evidence Putin cites the postponement of Ukraine's March 2024 presidential election, although it is because of Russia's war that Ukraine is under martial law and elections are barred under the constitution.\nPutin's own re-election in 2024 is highly questionable, as Russia's opposition leaders are either in exile or dead.\nWas Nato expansion to blame for the war?\nPutin has for years complained about Nato's eastward expansion as a security threat, and sees any possibility of Ukraine joining the alliance as a major red line.\nBefore Russia's 2022 invasion he demanded that Nato remove multinational deployments from the Central and Eastern European states that joined the Western alliance after 1997.\nBut it was Russia that launched military action in Eastern Europe, when it invaded Georgia in 2008 and then Crimea in 2014.\nAfter the Crimea invasion, Nato established a continuous presence on its eastern flank - closest to Russia.\nNato has always stressed the whole purpose of the alliance is to defend territories \"with no aggressive intentions\". Sweden and Finland have joined Nato in the past two years precisely because of the perceived Russian threat.\nIt is part of Ukraine's constitution to join the European Union and Nato, but there was no real prospect of this when the full-scale war began.\nZelensky said as much two weeks into the invasion: \"Nato is not prepared to accept Ukraine.\"\nHe has since said he would consider resigning in exchange for Nato membership, but Trump says Kyiv should \"forget about\" joining the Western alliance.\nPutin has accused Nato of participating in the war, because its member states have increasingly sent Ukraine military hardware, including tanks and fighter jets, air defence systems, missile systems, artillery and drones.\nNato has provided security assistance and training to Ukraine, but it insists that does not make it a party to the war.\nPutin's grievance against Nato dates back to 1990, when he claims the West promised not to expand \"an inch to the East\".\nHowever that was before the Soviet Union collapsed and it was based on a limited commitment made to then Soviet President Mikhail Gorbachev.\nGorbachev said \"the topic of Nato expansion was never discussed\" at the time.\nHow could the war end?\nThe most likely route is through direct talks, although previous rounds of negotiations between the two sides made little progress on a ceasefire.\nAfter a fifth visit to Moscow by Trump envoy Steve Witkoff on 6 August, the US president said a there was a \"good chance\" he could meet the Russian and Ukrainian leaders for talks in person.\nThe Kremlin also said a Trump-Putin meeting would happen in the coming days, but Putin ruled out an imminent meeting with Zelensky, saying the right conditions were not in place.\nSo far though, the two sides have been unable to find a way of bridging their differences.\nRussia wants direct talks to address the \"root causes of the conflict\", a phrase that harks back to Putin's \"maximalist\" demands at the start of the war in March 2022.\nThese included Ukraine becoming a neutral state, dramatically reducing its military and abandoning its Nato aspirations.\nRussia also wants international recognition of its territorial gains in Ukraine reflected in any future deal, including annexation of Crimea and four eastern regions. He also wants immediate scheduling of presidential and parliamentary elections.\nKyiv will never recognise its sovereign territory as part of Russia, even if it might accept it has been lost temporarily. It will also look for Western security guarantees to ensure Russia never invades its territory again.\nWas Zelensky to blame for the war?\nBefore his return to the White House and in the first months of his presidency, Trump suggested Ukraine's president was responsible for the war with Russia.\n\"[Zelensky] should never have let the war start, that war's a loser,\" he said in October 2024.\nIn reality, the war began in 2014, when Putin seized Crimea and Russian proxies grabbed part of eastern Ukraine. Zelensky had not even entered politics by then. Putin then ordered Russia's full-scale invasion eight years later, after months of meticulous co-ordination and denials of any such plan.\nHowever, the US president's messaging has not been altogether consistent, and in recent weeks his position appears to have hardened against Russia.\n\"We thought we had [the war] settled numerous times, and then President Putin goes out and starts launching rockets into some city like Kyiv and kills a lot of people,\" he said last month.\nTrump has announced sweeping new secondary tariffs on any country still trading with Russia if a ceasefire with Ukraine is not agreed by Friday, 8 August.\nDo Putin's claims on Nazis and genocide stack up?\nAt the start of the 2022 invasion, Putin vowed to protect people in occupied areas of eastern Ukraine from eight years of Ukrainian \"bullying and genocide, during the war in the east.\nMore than 14,000 people died on both sides of the front line between 2014-2022, but Russian claims of Ukrainian Nazis committing genocide in the occupied regions never added up, and no international body has spoken of genocide. Germany's chancellor called the allegation \"ridiculous\".\nThe Russian taunts of Nazis in charge in Kyiv are also not correct.\nModern Ukraine has no far-right parties in parliament - they failed to get enough votes in the 2019 elections. On top of that, Zelensky is Jewish and many of his relatives were murdered by the Nazis in World War Two.\nPutin condemns him as a \"disgrace to the Jewish people\", but the US Holocaust Memorial Museum rejects his claims outright, saying he \"misrepresented and misappropriated Holocaust history\".\nPutin himself was accused of war crimes by the International Criminal Court in 2024, although that has been rejected by the Kremlin.\nWhen did Russia invade Ukraine?\nRussia's attempt to stop Ukraine leaving its sphere of influence goes back years, and its initial invasion began in 2014 when pro-Russian president Viktor Yanukovych was ousted after months of mass demonstrations.\nYanukovych had abandoned an EU deal under Putin's pressure, prompting protests that ended when snipers shot dead dozens of demonstrators. Yanukovych soon fled to Russia.\nPutin quickly seized Ukraine's Crimean peninsula and Russian proxies took up arms against the government, occupying parts of the eastern Luhansk and Donetsk regions.\nTwo attempts to stop the war came to nothing.\nThey were known as the Minsk agreements and were brokered by France, Germany and Russia itself. They reduced the scale of violence, but Zelensky has called them a trap that created a frozen conflict on Russia's terms.\nBoth sides accused each other of violations, and the Kremlin said ultimately the failed accords were a precursor to Moscow's full-scale invasion.\nThe Ukrainian leader has warned the Trump administration not to trust Putin: \"He broke the ceasefire, he killed our people.\"\nWho is winning the war?\nAfter more than three years of offensives and counter-offensives, Russian and Ukrainian forces are in a war of attrition on an active front line of more than 1,000km (629 miles).\nNeither side has any realistic prospect of winning this war, although Russia is attempting to make further territorial gains during a summer offensive.\nRussia annexed four regions in eastern and southern Ukraine after sham referendums in 2022, and yet it can really only claim to have full control of one of them, Luhansk.\nUkrainian forces were able to liberate large areas of the north and parts of the south in 2022, but more recent counter-offensives have not had the same success.\nThey remain active in a very small part of Russia's Kursk region after launching an offensive in August 2024, but have lost control of all major settlements there. Ukrainian troops have also lost ground in the east.\nMuch of Russia's firepower has been turned towards the Donetsk region, as towns and villages are destroyed in a slow and grinding advance.\nThe war is taking its toll on Russia's economy, with high interest rates and inflation and defence spending this year of at least 33% of the federal budget.\nUkraine has lost a big part of its economic wealth to Russian occupation and destruction in its industrial east. Growth has been hit by attacks on its energy infrastructure.\nAlthough inflation and interest rates are high, Ukraine has secured Western aid to cover its budget deficit.\nHow many people have died in the Ukraine war?\nTens of thousands of people have died since Putin sent in the troops in 2022.\nUkraine's president has spoken of 46,000 Ukrainian military deaths, but open source site ualosses.org suggests the number is more than 77,000.\nMore than 13,500 civilians have lost their lives in Ukraine, according to the UN, which says the true toll is likely far higher. It says 6,754 civilians were killed in the first half of 2025 alone.\nRussia rarely admits to military losses, but BBC analysis estimates that Russian deaths could range from 185,143 to 267,500.\nThe war has forced millions of Ukrainians to seek refuge abroad or flee their homes within Ukraine.\nAt the start, Putin did not even call it war but a \"special military operation\". Eventually in 2024 he accepted it was a war, but claimed it had been instigated by Kyiv or its \"Western handlers\".\nWhat are the historical ties between Ukraine and Russia?\nPutin appears to believe that Ukraine should remain in Russia's sphere of influence because of the historical links between the two countries.\nFrom 1922 to 1991 Ukraine was part of the Soviet Union and many Ukrainians speak Russian, especially in the east, and including Volodymyr Zelensky who is a native speaker.\nMany Russians view Crimea as their own. It was annexed by Catherine the Great in 1783 and handed to Ukraine by Soviet leader Khrushchev in 1954. Ten years earlier, his predecessor Stalin had deported Crimea's Tatar population, so the majority population was ethnic Russian.\nSince 1991 Ukraine has been an independent state. It abandoned its nuclear weapons in 1994 in return for guaranteed security from Russia, the UK and US which Moscow failed to respect.\nSince the war, many Ukrainians have turned their back on Russian, and Zelensky himself avoids using the language in public.\nTrump: The First 100 Days\nMr Trump's return to the White House has seen sweeping change in the US and far beyond. From tariffs to Ukraine and much more, there have been dozens of new policies. So, what does it all mean?"
    },
    {
      "url": "https://www.bbc.com/news/articles/crm4ln2ekg1o",
      "text": "Putin agreed to 'robust' security guarantees for Ukraine, US envoy says\nDonald Trump's special envoy said Russia had agreed to allow the US and Europe to give Ukraine \"robust\" security guarantees as part of a potential peace deal.\nSteve Witkoff told CNN it was agreed at the Alaska summit that the US and Europe could \"effectively offer Article 5-like language to cover a security guarantee\", referring to Nato's principle that an attack on one member is an attack on all.\nPutin has long opposed Ukraine joining Nato, and Witkoff said the arrangement could be an alternative if the Ukrainians \"can live with it\".\nUkraine's President Volodymyr Zelensky described the US's security guarantee offer as \"historic\" ahead of talks with Trump and European leaders on Monday.\nSpeaking ahead of his visit to Washington DC, Zelensky said any guarantee \"must really be very practical, delivering protection on land, in the air, and at sea, and must be developed with Europe's participation\".\nMeanwhile, following a meeting on Sunday of the \"coalition of the willing\" - a group of nations including the UK, France and Germany that have pledged to protect peace in Ukraine once it is achieved - a No10 spokesman said leaders had commended Trump's \"commitment\" to providing security guarantees.\nThe leaders also \"re-emphasised the readiness to deploy a reassurance force once hostilities have ceased, and to help secure Ukraine's skies and seas and regenerate Ukraine's armed forces\", the spokesman added.\nUK Prime Minister Sir Keir Starmer, French President Emmanuel Macron, Chancellor Friedrich Merz of Germany, European Commission President Ursula von der Leyen and Nato Secretary-General Mark Rutte are set to join Zelensky in Washington on Monday.\nMacron said the group would challenge Trump on how far he was willing to go in terms of security guarantees.\n\"If we're not strong today, we'll pay dearly tomorrow,\" he said, adding the group's plan was to \"present a united front\".\nWitkoff also told CNN on Sunday that Russia had made \"some concessions at the table\" about territory, noting Donetsk would be part of an \"important discussion\" on Monday.\nIt comes after Putin reportedly presented Trump with a peace offer in Alaska on Friday that would require Ukraine withdrawing from the Donetsk region of the Donbas, in return for Russia freezing the front lines in Zaporizhzhia and Kherson.\nThe BBC's US partner CBS cited diplomatic sources as saying that European officials were concerned Trump may try to press Zelensky to agree to the terms.\nRussia claims the Donbas as Russian territory, controlling most of Luhansk and about 70% of Donetsk. It also illegally annexed the Crimean peninsula in 2014, eight years before launching its full-scale invasion of Ukraine.\nZelensky on Tuesday said Ukraine would reject any Russian proposal to give up the Donbas region, warning it could be used as a springboard for future attacks.\nHe has also pointed to the country's constitution, which requires a referendum before a change in its territory.\nMonday's White House meeting will be Zelensky's first since an acrimonious public exchange in the Oval Office in February, when Trump told him to be more \"thankful\" for US support and accused him of \"gambling with World War Three\".\nZelensky was then told to leave the White House.\nHe appeared to reconcile with Trump in April, in what the White House described as a \"very productive\" 15-minute meeting before they attended Pope Francis's funeral.\nUkraine has also signed a minerals deal that gave the US a financial stake in the country, and Kyiv made it clear they were willing to pay for US arms.\nBut there will have been concern in Kyiv and other European capitals following the Trump-Putin meeting on Friday.\nThe Russian president, who is facing an International Criminal Court arrest warrant for alleged war crimes in Ukraine, stepped off his jet and onto a red carpet to be warmly received by Trump, who later said they had a \"fantastic relationship\"."
    },
    {
      "url": "https://www.bbc.com/news/articles/c04r0z1pr25o",
      "text": "Zelensky rejects proposals for buffer zone to end Ukraine war\nUkrainian President Volodymyr Zelensky has rejected proposals for a buffer zone between Ukrainian and Russian forces as part of a peace deal, arguing it does not reflect the realities of modern warfare.\n\"Only those who do not understand the technological state of today's war propose a buffer zone,\" he told reporters on Friday.\nHis comments followed a report suggesting European leaders were considering a 40km (25-mile) buffer zone as part of either a ceasefire or longer-term agreement.\nThe war in Ukraine has evolved into a conflict driven by drone technology, and Zelensky suggested a buffer zone of sorts already existed because of the threat of drone strikes close to the front line.\nBuffer zones can create demilitarised zones between warring countries, such as North and South Korea, and physical boundaries such as the Iron Curtain - which separated the Soviet bloc and the West following World War Two.\nAccording to a report in Politico, European diplomats said the proposal among military and civilian officials was for a strip of land in Ukraine to be blocked off between the two forces.\nBut Zelensky said there already was an area on either side of the front line where heavy artillery was unable to operate because of the risk of drone-fire.\n\"Today, our heavy weapons are located at a distance of more than 10km from each other, because everything is hit by drones, \" he said.\n\"This buffer - I call it a 'dead zone', some call it a 'grey zone' - it already exists.\"\nAny such deal could also mean Ukraine giving up some territory within the zone, which Zelensky also rejected: \"If Russia wants to have a greater distance from us, they can retreat deep into the temporarily occupied territories of Ukraine.\"\nHe added that Russia was not ready for diplomacy but seeking ways to postpone the end of the war.\nA US-led diplomatic offensive to end Russia's full-scale war, which has now lasted more than 40 months, appears to be losing momentum.\nA high-stakes meeting last week between US President Donald Trump, Zelensky and European leaders raised hopes of a possible summit between the Ukrainian leader and Russia's Vladimir Putin.\nBut those hopes are looking increasingly remote and German Chancellor Friedrich Merz said there would \"obviously not\" be a meeting and it looked like Putin was \"unwilling\" to take part.\nRussia fired 629 drones and missiles at Kyiv in the early hours of Thursday, killing 23 people, in one of the biggest aerial assaults of the war so far that has prompted outrage from European leaders. Two missiles landed near the EU's offices in central Kyiv.\nAfter talks in the French city of Toulon, Merz and France's Emmanuel Macron said they would increase pressure on Russia due to Putin showing little interest in ending the war.\nMacron said that if Putin did not meet a Monday deadline to agree to the talks, \"it will show again President Putin has played President Trump\".\nMerz suggested the war could last \"many more months\".\nEU foreign policy chief Kaja Kallas has condemned \"Russia's ongoing assaults on civilians and civilian infrastructure, which are a deliberate escalation and undermine efforts toward peace\".\nOn Friday, Zelensky's chief of staff Andriy Yermak discussed US peace moves with Trump's special envoy Steve Witkoff as well as US Secretary of State Marco Rubio and Vice President JD Vance.\nYermak said after their meeting in New York that while Ukraine welcomed all peace initiatives put forward by the US, \"unfortunately, each of them is being stalled by Russia\".\nEuropean leaders are working on providing Ukraine with security guarantees if a deal with Russia can be agreed.\nKaja Kallas said that EU defence ministers had agreed on Friday that they would need to be \"robust and credible\" and Zelensky said he expected talks to continue next week on \"Nato-like\" commitments that would provide Ukraine with protection.\nHowever, Russian foreign ministry spokeswoman Maria Zakharova described latest Western proposals as \"one-sided\" and aimed at containing Russia.\n\"Security guarantees must be based on achieving a common understanding that takes into account Russia's security interests,\" she said."
    }
  ],
  "argos_summary": "Vladimir Putin claimed he reached \"understandings\" with former U.S. President Donald Trump about ending the Ukraine war, citing a meeting in Alaska that allegedly included security guarantees for Ukraine.  However, Moscow has not confirmed the deal, and U.S. envoy Steve Witkoff says the talks were still preliminary, with Trump setting a Monday deadline for a response.  The claim comes amid continued Russian attacks on Kyiv and a stalled peace process, with European leaders urging a robust, NATO‑style security guarantee for Ukraine if a settlement is reached.",
  "argos_id": "I05V0RSO5"
}