{
  "url": "https://www.androidauthority.com/samsung-galaxy-s26-edge-battery-upgrade-filing-3593060/",
  "authorsByline": "Hadlee Simons",
  "articleId": "7568322733cf49cea4d6b0044d483d58",
  "source": {
    "domain": "androidauthority.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "",
      "county": "",
      "city": "",
      "coordinates": {
        "lat": 0.0,
        "lon": 0.0
      }
    }
  },
  "imageUrl": "https://www.androidauthority.com/wp-content/uploads/2025/05/Samsung-Galaxy-S25-Edge-cameras-close-up.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-01T08:31:36+00:00",
  "addDate": "2025-09-01T08:45:05.039297+00:00",
  "refreshDate": "2025-09-01T08:45:05.039299+00:00",
  "score": 1.0,
  "title": "New Galaxy S26 Edge battery leak keeps piling on the bad news",
  "description": "We've heard plenty of claims regarding the Galaxy S26 Edge's battery. Now, a regulatory filing hints at more battery capacity details.",
  "content": "The Samsung Galaxy S25 Edge might be the most polarizing Android phone of 2025. The device has a very slim and light design, but this form factor comes at the expense of battery life. We’re expecting a bigger battery in the Galaxy S26 Edge, but it sounds like those expecting a huge upgrade might be disappointed.\n\nSamLover and SamMobile report that the apparent Galaxy S26 Edge battery has passed through the website of China’s 3C regulatory body. A screenshot posted by SamLover reveals a 4,078mAh rated capacity. This hints at a typical capacity of 4,200mAh.\n\nThis listing comes some time after we heard conflicting rumors about the Galaxy S26 Edge battery, pointing to either a 4,200mAh or 4,400mAh capacity. However, this latest leak suggests a modest upgrade.\n\nColleague Ryan Haines wasn’t very happy with the Galaxy S25 Edge battery life in his review. Ryan said the phone had “mediocre” endurance, and that battery life “dropped like a stone” when the device was subjected to slightly more demanding workloads. So a ~300mAh increase would be welcomed, even if it isn’t a big upgrade.\n\nThese aren’t the only Galaxy S26 Edge leaks we’ve heard in recent months. The device is also tipped to be 5.5mm thick (0.3mm thinner than the current model), so we could be getting a larger battery in an even slimmer form factor. Coincidentally, the iPhone 17 Air is also rumored to be 5.5mm thick. Nevertheless, I can’t help but wonder how much more capacity you could squeeze into the S26 Edge if it retained the same thickness as the current Edge phone.",
  "medium": "Article",
  "links": [
    "https://www.androidauthority.com/tag/samsung/",
    "https://www.androidauthority.com/android-authority-comment-policy/",
    "https://www.androidauthority.com/tag/samsung-galaxy-s26/",
    "https://samlover.com/2025/08/30/galaxy-s26-edge-battery-capacity-revealed-through-a-certification/",
    "https://www.androidauthority.com/android-authority-preferred-source-google-search-3586296/",
    "https://www.androidauthority.com/samsung-galaxy-s26-edge-battery-leak-3583707/",
    "https://www.androidauthority.com/samsung-galaxy-s25-edge-review-3561939/",
    "https://www.sammobile.com/news/the-most-anticipated-galaxy-s26-edge-battery-upgrade-isnt-happening/",
    "https://www.androidauthority.com/samsung-galaxy-s26-edge-thin-design-leak-3584428/",
    "https://www.androidauthority.com/best-android-phone-3563254/",
    "https://www.androidauthority.com/news/"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Galaxy S26 Edge",
      "weight": 0.15904637
    },
    {
      "name": "New Galaxy S26 Edge battery leak",
      "weight": 0.15762132
    },
    {
      "name": "Galaxy S25 Edge",
      "weight": 0.14400417
    },
    {
      "name": "Edge",
      "weight": 0.11851484
    },
    {
      "name": "battery life",
      "weight": 0.11327719
    },
    {
      "name": "the apparent Galaxy S26 Edge battery",
      "weight": 0.108196594
    },
    {
      "name": "the Galaxy S26 Edge battery",
      "weight": 0.106821656
    },
    {
      "name": "the Galaxy S25 Edge battery life",
      "weight": 0.10338437
    },
    {
      "name": "the only Galaxy S26 Edge leaks",
      "weight": 0.10158625
    },
    {
      "name": "the Galaxy S26 Edge",
      "weight": 0.09386422
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Technology News",
      "score": 0.85693359375
    },
    {
      "name": "/Computers & Electronics/Software/Operating Systems",
      "score": 0.84130859375
    },
    {
      "name": "/Internet & Telecom/Mobile & Wireless/Mobile Phones",
      "score": 0.7451171875
    },
    {
      "name": "/Shopping/Consumer Resources/Product Reviews & Price Comparisons",
      "score": 0.72607421875
    }
  ],
  "sentiment": {
    "positive": 0.2967518,
    "negative": 0.17651853,
    "neutral": 0.5267297
  },
  "summary": "A new report suggests that the Samsung Galaxy S26 Edge battery has been listed on the website of China's 3C regulatory body, indicating a capacity of 4,078. This is not expected to be a significant upgrade, as colleague Ryan Haines complained about the phone's poor battery life during a review. The device is also predicted to be 5.5mm thick, making it potentially larger than the current model.",
  "shortSummary": "A leaked Galaxy S26 Edge battery reveals a 4,078mAh capacity, but consumers may be disappointed by the smaller frame and limited endurance, despite expecting an increased capacity.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "534e94273cd44710890d125f1f2dc7e6",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.androidauthority.com/samsung-galaxy-s26-edge-thin-design-leak-3584428/",
      "text": "Affiliate links on Android Authority may earn us a commission. Learn more.\nGalaxy S26 Edge leak reveals just how thin Samsung's next Edge could be\nAugust 6, 2025\n- A leaker has claimed that the Samsung Galaxy S26 Edge will be 5.5mm thin.\n- This means it could be as thick as the rumored iPhone 17 Air and slightly thinner than the Galaxy S25 Edge.\n- The leaker also reiterated that the phone could have a 4,200mAh battery.\nNumerous leaks suggest that Samsung will replace the Galaxy S26 Plus with the Galaxy S26 Edge. This phone is expected to offer a thin form factor similar to that of the Galaxy S25 Edge, and we’ve now got a better idea of what to expect.\nLeaker Ice Universe has claimed on Twitter that the Galaxy S26 Edge will be 5.5mm thick. That would make it 0.3mm thinner than the Galaxy S25 Edge, which measures 5.8mm thick. It would also be on par with the iPhone 17 Air’s rumored thickness.\nThe tipster also reiterated previous claims that the new phone would have a 4,200mAh battery. That would be a small but welcome boost over the Galaxy S25 Edge’s 3,900mAh battery. It would also be a notable achievement given the apparent thinner design. This capacity would also be notably bigger than the iPhone 17 Air’s rumored ~2,900mAh battery.\nColleague Ryan Haines praised the current model’s slim and light design, build quality, and “solid” main camera in his Galaxy S25 Edge review. However, Ryan criticized the phone’s “mediocre” battery life, poor thermals, slow charging, and lack of a tele camera. It’s no wonder that he gave the device three out of five stars. So we really hope the Galaxy S26 Edge isn’t a repeat performance.\nThis news also comes after we recently discovered evidence that Samsung could shake up the Galaxy S26 series branding. The evidence suggests we could see a Galaxy S26 Pro, Galaxy S26 Edge, and Galaxy S26 Ultra. The Pro model would replace the base S26, while the S26 Edge would apparently replace the S26 Plus.\nThank you for being part of our community. Read our Comment Policy before posting."
    },
    {
      "url": "https://www.androidauthority.com/tag/samsung-galaxy-s26/",
      "text": "Pages tagged:\nSamsung Galaxy S26\nNew Galaxy S26 Edge battery leak keeps piling on the bad news\nThose expecting a 4,400mAh battery might be disappointed.\nHadlee Simons2 hours ago\n0\nStephen SchenckAugust 28, 2025\n0\nPoll: Just how round do you like the corners on your smartphone?\nGalaxy S26 Ultra rumor hints at the return of a nostalgic design choice from 2021\nRyan McNealAugust 26, 2025\n0\n4 reasons to buy the Pixel 10 Pro XL instead of waiting for the S26 Ultra\nAndrew GrushAugust 25, 2025\n0\nThe Galaxy S26 Ultra could cut corners in the best way possible\nHadlee SimonsAugust 25, 2025\n0\nGalaxy S26 Ultra could make spying on your screen impossible with this crazy tech\nHadlee SimonsAugust 19, 2025\n0\nThe Galaxy S26 Pro might kill the best Samsung phone for most people\nKarandeep SinghAugust 15, 2025\n0\n7 things the Galaxy S26 Pro needs to be my next Android phone\nZac Kew-DennissAugust 12, 2025\n0\nGalaxy S26 Ultra leak hints at a serious upgrade for power users\nMatt HorneAugust 8, 2025\n0\nGalaxy S26 Edge leak reveals just how thin Samsung's next Edge could be\nHadlee SimonsAugust 6, 2025\n0"
    },
    {
      "url": "https://www.sammobile.com/news/the-most-anticipated-galaxy-s26-edge-battery-upgrade-isnt-happening/",
      "text": "Massive Galaxy deals! Galaxy Fold 7, Flip 7, S25 Ultra and Watch Ultra 2025\nLast updated: August 30th, 2025 at 11:59 UTC+02:00\nSamMobile has affiliate and sponsored partnerships, we may earn a commission.\nDon't hold hope for a silicon-carbon battery.\nReading time: 2 minutes\nSamsung launched the super-slim Galaxy S25 Edge with a 3,900mAh battery this year. Rumors have since emerged that the company may not just increase the capacity on its successor but also go with a silicon-carbon battery.\nNew information has surfaced that reveals this highly anticipated upgrade isn't happening, and that Samsung will stick with a lithium-ion battery for the Galaxy S26 Edge.\nSamsung's battery for the Galaxy S26 Edge, bearing part number EB-BS947ABY, has been certified by China's 3C body. The certification listing reveals some key details about this component.\nIt has a rated capacity of 4,078mAh which will be marketed as 4,200mAh. The 4,200mAh figure has been rumored several times already, so it's nicely to see that customers who were waiting for a larger battery on the device before they decided to pick one up will finally have one more reason to drop cash on Samsung's slim flagship.\nThe listing also reveals that this is a lithium-ion battery, not silicon-carbon. Samsung is yet to make a transition to this technology for its smartphones, which would allow for higher capacities without requiring more space inside the shell. The Edge series would be the perfect starting point as Samsung's aim is to make this lineup as slim as possible.\nPerhaps the company wishes to play it safe and if it can deliver a respectable increase in capacity while sticking with the tried and tested lithium-ion technology, it may be enough to push the transition to silicon-carbon down the road for a little while longer.\nAdnan Farooqui is a long-term writer at SamMobile. Based in Pakistan, his interests include technology, finance, Swiss watches and Formula 1. His tendency to write long posts betrays his inclination to being a man of few words.\nTrending"
    },
    {
      "url": "https://www.androidauthority.com/best-android-phone-3563254/",
      "text": "Affiliate links on Android Authority may earn us a commission. Learn more.\nI test all the best Android phones every year, and these are the ones you should buy in 2025\nAugust 20, 2025\nIt’s a funny thing, this idea of calling something the best. After all, everyone wants to think that their favorite of anything is the best — the best album, book, or cup of coffee — but that can’t always be true. And, when you apply the idea of being the best to a category as wide open as Android phones, which can come in different shapes, sizes, and prices, the task becomes even greater.\nHowever, I think I have a pretty good idea of what makes an Android phone great. I test and review dozens of them every year, and I’ve spent time with just about every phone you can get your hands on in the US (and even some that you can only buy elsewhere). And, across my many Android-fueled adventures, I’ve learned to pick the qualities that make a phone worth buying. So, with that in mind, here’s what I think are the best Android phones you can buy in 2025.\nGoogle Pixel 9 Pro XL: The best Android phone overall\n- Excellent build quality, refined design\n- Stunning display\n- Extensive update policy\n- Sharp, powerful cameras\n- Improved wired charging\n- Clever Gemini features\n- Tensor still runs warm\n- Confusing charging situation\n- Only 128GB base storage\nI remember when Google’s Pixel phones felt like niche picks for the most dedicated Android fans. They paired clean, simple software with brilliant cameras and added a dash of fun Google design to the mix, and I always felt clever spotting one out in the wild. These days, the Pixel 9 Pro XL hangs its hat on many of the same features as its predecessors, but it’s no longer a pick for those in the know — it’s just the best Android phone that money can buy.\nI’ve spent perhaps more time with the Pixel 9 Pro XL (and its smaller Pixel 9 Pro sibling) than anyone else at Android Authority, and it continues to find new ways to impress. Its updated design with smooth, shiny side rails and a camera bar that’s become more of an island feels a little bit Apple-inspired, but in a way that makes me think the student has become the master. Granted, I’ve always been a fan of Google’s camera bar design, but it now feels polished and premium in a way that can stand with any other phone on the market.\nAnd, since we’re already on the topic of the camera bar, let’s dig into Google’s impressive hardware a little further. The Pixel 9 Pro XL packs a 50MP primary sensor that’s simply excellent, capturing plenty of detail and processing images with a very natural color profile thanks to the Tensor G4 chipset. Google’s ultrawide and 5x optical telephoto sensor help to round out the setup with up to 30x zoom, while tricks like a revamped panorama mode and Add Me helped to earn the phone the title of best Android camera phone, too.\nWith an updated design, improved Tensor G4 chipset, and tons of AI features, the Pixel 9 Pro XL is Google's most complete phone to date.\nUpdates under the hood have helped to keep Google’s top-end flagship at the front of my mind since it launched last fall. Its 16GB of RAM (with 4GB reserved for Gemini) and up to 1TB of storage space feel like clever future-proofing methods that will keep the Pixel 9 Pro XL near the top of the list as Google rolls out new AI-powered features like updates to the Pixel Studio, better support for Pixel Screenshots, and new capabilities for Gemini Live over the course of seven years of updates.\nEven the Pixel 9 Pro XL’s battery and charging setup have taken a step forward, thanks in no small part to the combination of the more efficient Tensor G4 chipset and upgraded 37W wired speeds. I don’t even mind that I needed to pick up Google’s new USB-C Pixel charger, as I’m still achieving close to two days of battery life between charges. And, with a starting price of $1,099 (or $999 for the Pixel 9 Pro), Google’s best Pixel to date is a little more approachable than rivals from Samsung and Apple.\nSamsung Galaxy S25 Ultra: The best ultra-tier Android phone\n- Premium materials\n- Great battery life\n- Solid cameras\n- Top-tier Snapdragon performance\n- Brilliant display\n- Excellent software policy\n- Downgraded S Pen\n- Mostly AI-based upgrades\n- Still no full Qi2 support\n- Can be uncomfortable to hold\n- Very expensive\nAs a Pixel fan, it’s easy for me to hype up the Pixel 9 Pro XL as the best Android phone, but for many Samsung diehards, it’s Galaxy or nothing. And, with the amount of power packed into the Galaxy S25 Ultra, I can see where they’re coming from. If there’s a spec you’re looking for — solid charging, flexible cameras, ample RAM and storage — I’d be willing to bet that Samsung’s top-end option checks that box, which is why we’re calling it the best ultra-tier Android phone.\nFrom the minute you take it out of the box, the Galaxy S25 Ultra feels like a tool that’s ready to work. Its massive titanium frame protects panels of Gorilla Glass Victus 2 on both the front and back, and it continues to house the S Pen that’s boosted productivity users since the days of the Galaxy Note lineup. Yes, Samsung simplified its built-in stylus a bit this year and took away a few features, but it remains the easiest way to take notes and doodle your way into Sketch to Image on the gorgeous 6.9-inch AMOLED panel.\nTo me, though, the Galaxy 25 Ultra stands out because of its four rear cameras. Like the previous generation, the start of the show is a huge 200MP sensor that covers much of the short-range zoom until the dual 3x and 5x optical telephoto sensors take over to push to 100x Space Zoom with a bit of help from some Galaxy AI processing. I prefer the Galaxy S25 Ultra’s shots up to about the 10x zoom length, as there’s barely any drop in quality, and the built-in camera filters make it easier to put some personality into your images right off the bat.\nSamsung's Galaxy S25 Ultra remains a productivity powerhouse with four rear cameras and a built-in S Pen.\nThe rest of Samsung’s internals keep the Galaxy S25 Ultra well-positioned for the future, even if they come at a cost. Yes, this ultra-tier flagship starts at $1,299 — more than any of our other primary picks — but that’s what you pay for an “Ultra” phone, and for your money, you get an overclocked Snapdragon 8 Elite chip, 12GB of RAM across most configurations, frequently updated Galaxy AI features, and the fastest charging that you’ll currently find on a Samsug phone at 45W. But, with seven years of updates, you can stretch your time with the Galaxy S25 Ultra further than most of its rivals.\nGoogle Pixel 9a: The best Android phone under $500\n- Solid, reliable cameras\n- Excellent update commitment\n- Clever AI-powered features\n- Great battery life\n- New, streamlined design\n- Excellent price\n- Relatively slow charging\n- Aging Gorilla Glass 3 (again)\n- Missing Pixel Screenshots\nAlthough I love spending time with the biggest, most expensive flagship Android phones, I think I’m ready to tell you a little secret: They’re not my favorites. Instead, I think the mid-range is the best section of the Android market right now — the phones that pick up a few flagship-level features without the painful price tag. There’s no better example than the slimmed-down, sped-up Pixel 9a.\nIn almost every way, the Pixel 9a is just the type of addition the larger Pixel 9 series needed. It carries over most of the great AI-powered features I mentioned falling in love with on the Pixel 9 Pro XL, like access to the Pixel Studio, using Gemini to multitask across apps, and receiving the same regular Pixel Drops as its flagship siblings. It’s a bummer to see Pixel Screenshots wind up on the cutting room floor, but I’ve always found screenshot management in Photos good enough that I don’t mind too much.\nI love the Pixel 9a's slimmed-down design and flagship-tier features at the $500 price point.\nPerhaps the one thing that initially surprised me about the Pixel 9a was its updated design. I’d seen leaks and rumors that the camera bar was going away, and I didn’t want to believe it. However, since spending time with Google’s most affordable model, I’ve come around to the benefit of simplicity. Google didn’t just axe its iconic camera bar for fun, but instead found ways to slim the internal components to free up the space to embed its cameras deeper into the body. The result is a phone that doesn’t collect dust around its cameras, but still manages to have the same Google-y personality I love about Pixels.\nAlong with that refreshed design, Google gave its mid-ranger several other updates to make the $500 price tag feel like even more of a bargain. It carries the same Tensor G4 chipset as its flagship siblings, and has swapped to a wider 48MP primary camera that lets in more light for Google’s brilliant image processing to play with, and it’s all topped off with the largest battery on any Pixel at 5,100mAh. I called it the best $500 phone I’ve ever used, and I’ll stand by that until the Pixel 10a comes around.\nCMF Phone 2 Pro: The best Android phone under $300\n- Incredibly low price\n- Amazing design and display\n- Cool modular features\n- Primary, ultrawide, and telephoto lenses\n- Good update commitment\n- Not good for a US-based buyer\n- Controversial Essential Key\nMoving down another step, it’s remarkable to see how far the budget Android segment has come in just a few years. I remember bashing cheap options for their lame cameras, underwhelming charging, and bland designs, and now the CMF Phone 2 Pro feels like a breath of fresh air by comparison. It’s the personality-packed follow-up to one of the most interesting phones of 2024, the CMF Phone 1, and it improves on almost every aspect of the modular design without jumping the price too much.\nOf course, I should point out that it still doesn’t work well in the US. Yes, you’ll get some band support, but it won’t completely cover any of the big three networks. That said, if you live in a supported market, or can live with some signal inconsistency, there is absolutely no better phone under $300.\nThe modular design is the most fun I’ve had with a phone since Samsung brought back the flip phone with its Galaxy Z Flip lineup. The design still works the same as it did on the first CMF Phone, having you release the back panel with a series of screws before attaching different accessories like a lanyard, card holder, or a kickstand.\nCMF's Phone 2 Pro builds on a quirky, modular design in a way that's still fun to switch up every day.\nI think the coolest accessory that the team at CMF has cooked up is one that’s out for Moment’s lunch. The Phone 2 Pro supports new external camera lenses, which you can screw on and off the updated 50MP sensors to give them macro and fisheye functionality. It’s perhaps a slightly old-fashioned take on what’s usually done with software or a dedicated sensor, but I like that it means you don’t have to worry about macro mode turning on and off as it senses you nearing a subject. Oh, and have I mentioned that you can give this quirky pick a try for less than $300?\nAt that price, we usually expect some pretty significant cuts to budget phones, but I think the Phone 2 Pro has managed to avoid most of the pitfalls. Its Dimensity 7300 Pro is up for most tasks, and adding the Essential Key allows the budget pick to tap into the same convenient AI journal that Nothing introduced on its recent Phone 3a duo. The upgraded IP54 rating (up from IP52) is also a nice touch, but it falls slightly behind the IP68 protection that Samsung and Motorola have started adding to their affordable options.\nSamsung Galaxy A16 5G: The best Android phone under $200\n- Stellar software update promise\n- Solid primary camera\n- Decent battery life\n- Great price\n- Good charging\n- Just-okay build quality\n- Aging performance\n- Weak peripheral cameras\n- Bland design\nThe last of our budget picks, the Galaxy A16 5G, somehow manages to dance within one of the tightest categories of Android phones. When launching for less than $200, you have to make some serious concessions on the spec sheet, yet this cheap Android option manages to check off quite a few boxes with a decent IP54 rating (matching the CMF Phone 2 Pro above), an AMOLED panel with a 90Hz refresh rate, and an in-house Exynos 1330 processor in the US. It also looks the part of a more expensive Galaxy device, pulling heavily from Samsung’s streamlined flagship style.\nI spent a fair portion of my winter with the Galaxy A16 5G in my pocket, and I came away impressed more often than not. Yes, I have to put it into the context that this is merely a $200 Android phone, but sometimes good enough is all you need. Its display is bright enough in most conditions, its primary camera is flexible enough to cover day-to-day shooting in decent lighting, and its battery life is pretty solid because of the power-sipping processor. However, one thing truly adds a mountain of value to a phone that costs little more than a mole hill.\nSamsung's Galaxy A16 5G is a fine value pick boosted by an incredible update commitment.\nYes, it’s Samsung’s downright remarkable commitment to software updates. Despite costing about the same as a premium pair of running shoes, the Galaxy A16 5G is on tap for six years of updates across major Android patches and regular security coverage. That puts this budget option at more updates than either the OnePlus 13 or Motorola Razr Ultra can match, despite both flagships costing at least four times more.\nUltimately, that mix of value and long-term support makes the Galaxy A16 5G great for a few particular groups of people, like kids or grandparents. It makes sense for the former as you won’t have to worry too much about the phone picking up scuffs or scrapes since it doesn’t cost too much to repair or replace, while it makes sense for the latter as One UI probably won’t change too much over the course of its many updates, making it easy for you to lend a hand as the go-to tech support person in your family.\nGoogle Pixel 9 Pro: The best Android camera phone\n- Impressive Gemini-powered features\n- Excellent build quality\n- Gorgeous display\n- Flexible, capable cameras\n- Reliable update commitment\n- Tensor G4 still runs hot\n- Charges slower than 9 Pro XL\n- Limited base storage\nA lazier guide would tell you to scroll back up to the Pixel 9 Pro XL — our pick for the best overall Android phone — skim that entry, and then come back here to understand why the Pixel 9 Pro also makes this list, as both phones share the same camera specs and smarts. But I’d much rather take this chance to hype up one of the best pocket-sized phones you can still get your hands on. After all, this is the one phone that’s made its way back into my pocket more than any other whenever I find myself between reviews, and if you don’t care about having a larger screen for snaps, the Pixel 9 Pro gets you that same industry-leading camera package for under $1,000, so it’ll save you some cash, too.\nGoogle’s 6.3-inch flagship packs the same hardware — 50MP primary, 48MP periscope telephoto, and 48MP ultrawide sensors — as the Pixel 9 Pro XL, but the smaller body makes it much easier to pull out of your pocket and grab a photo before you miss the moment. On top of that, the Pixel 9 Pro still supports all of the same AI-powered shooting modes like Add Me, the refreshed Panorama mode, and the ability to edit your shots after the fact with Magic Editor.\nWant to see the proof for yourself? You can check out a whole bunch of our camera test samples in this Google Drive.\nThe Pixel 9 Pro takes everything we loved about the XL and, well, shrinks it.\nOf course, to make its compact Pro model run smoothly, Google had to make a cut or two. Thankfully, it didn’t follow the path of Apple’s previous Pros, putting different telephoto sensors on each size, but instead opted for a smaller battery. The Pixel 9 Pro packs a still-solid 4,700mAh battery with 27W wired charging from the same USB-C Pixel charger I’ve mentioned once or twice and 21W wireless charging from the in-house Pixel Stand. Otherwise, though, everything from the combination of aluminum and Gorilla Glass Victus 2 to the top-notch build quality and the still-questionable Temperature Sensor is a perfect match for the full-sized flagship.\nMotorola Razr Ultra: The best flip-style Android foldable\n- Blisteringly fast charging and excellent battery life\n- Ultra-flagship-tier performance\n- Solid dual camera setup\n- Top-notch materials and eye-catching Pantone colors\n- Two very vibrant displays\n- Clean, simple software\n- Moto AI feels half baked\n- Limited software commitment\n- Long-range zoom kinda stinks\n- Expensive\nIt’s tough to pick a flip phone as my favorite overall Android phone, but I think the Motorola Razr Ultra is about as close as any has come. After all, it’s the first of its form factor to truly take the training wheels off, packing its spec sheet with Ultra-grade decisions while carefully dancing within its limits. It takes almost everything I loved about the previous flagship Razr foldable, fixes the odd camera decision I thought I’d like, and then adds an extra dose of power in the form of additional RAM and Qualcomm’s top-tier chipset.\nMore specifically, the Razr Ultra packs an impressive 16GB of RAM in its base configuration with 512GB of storage by default, both of which are more than any of Samsung’s foldables can match. It then pairs them up with the Snapdragon 8 Elite chipset and a 4,700mAh battery that towers over that of most flip phones I’ve reviewed. Not only that, but Motorola’s top-tier flip phone also packs a charging setup worth writing home about. The Razr Ultra ships ready to handle up to 68W wired TurboPower speeds with 30W wireless charging as a backup, at least as long as you have a capable charger. That’s fast enough to run circles around everyone but OnePlus in the US, and makes an already great phone feel even better.\nThe Razr Ultra is by far the best-looking, most powerful flip phone I've ever used.\nPerhaps what wins the Razr Ultra the most points over Samsung’s Galaxy Z Flip lineup is that I still prefer its cover screen experience. There are no hoops to jump through, no extra software to install, and no weird layouts to avoid. Yes, your apps use the entire display by default, meaning they might get cut off by the camera cutouts, but you can quickly fix that with a press of the gesture pill to compact the interface into a smaller square. On top of that, AI companions like Perplexity, Gemini, and Moto AI come optimized for the cover screen, making it easy to ask for help when needed.\nWhile I don’t usually like to put too much stock into the way a phone looks — especially if I’m going to put it into a case — there’s no way around it on the Razr Ultra. Every colorful finish that Motorola offers comes from its close partnership with Pantone, and the different back panels offer more personality than the usual mix of Gorilla Glass can match. I reviewed the Mountain Trail version, which comes with a wooden back and a bronzed aluminum frame, but Motorola’s Scarab finish is an eye-catcher with its deep green color and slightly fuzzy Alcantara back panel. I might be concerned about how it’ll age in the coming years, but I can’t say I’ve seen anyone use materials quite like Motorola.\nGoogle Pixel 9 Pro Fold: The best tablet-style Android foldable\n- Impressively thin design that opens completely flat\n- Excellent displays with high brightness\n- Thoughtful enhancements to Android for foldables\n- Lots of Gemini-powered AI features\n- Seven years of update support\n- Camera setup weaker than other Pixel 9s\n- Sluggish, frustrating charging\n- Tensor G4 behind the competition for power\n- Buttons too low\n- Extremely high price\nAt long last, there’s a new king of the tablet-style Android foldable phones. Yes, this was Samsung’s spot to lose for a long time — partly because it was the only real option in the US for several years — and now it’s happened. After an original Pixel Fold that felt like a bright idea with classic prototype flaws, the Pixel 9 Pro Fold feels ready to stand on its own two feet, or at least two sides of its hinge. Google took everything we liked about its original form factor, ironed out the quirks, and then completely reimagined its internal display for a more comfortable experience.\nWhat surprised me most about coming to the Pixel 9 Pro Fold a little late in the game is that it doesn’t feel too different from the small Pixel 9 Pro, at least not when closed. As a result, I’m much more willing to pull it out of my pocket for casual tasks like streaming, social media, and updating my Strava activities without feeling like I’m trying to type on a knife’s edge. Then, when I’ve found whatever show I’m desperately trying to keep up with, I’m perfectly comfortable opening the nearly bezelless internal display and only losing a bit of space to letterboxing.\nThe Pixel 9 Pro Fold feels like a much larger upgrade than simply a second-year refresh.\nAlthough it’s a massive leap forward for Google’s foldables overall, the Pixel 9 Pro Fold isn’t without its quirks. Its slim form factor means the Tensor G4 chipset has to work a little harder to vent heat, while the 4,650mAh battery is held back by just 21W wired charging — barely faster than what you get from the Pixel 9a for a third of the cost. Google’s peripheral cameras feel like odd choices, too, with just a 10.8MP telephoto and 10.5MP ultrawide to hold down the newly square camera bump.\nAnd yet, I still feel like the Pixel 9 Pro Fold is the best tablet-style foldable you can get your hands on. Maybe it’s because many of the Android Authority crew are Pixel fans by nature, but I feel like Google’s approach to Android remains one of the cleanest and easiest to navigate, with the right mix of optimizations for the internal display. You’ll also get the full suite of AI-powered features like Call Screen, Pixel Studio, and Gemini Live, just with far more real estate on which to explore them.\nOnePlus 13: The best Android phone for battery life\n- Gorgeous design\n- Incredible camera zoom and overall photography\n- Helpful AI integration\n- Excellent charging options\n- Simplified Oxygen OS experience\n- Great performance\n- Magnetic charging requires accessories\n- Fewer updates than Samsung or Google\nThese days, 5,000mAh batteries have almost become the standard on large Android flagships. Everyone is using them, from Google to Samsung to Motorola, and it’s made life hard when hunting for the phone with the best battery life. However, whenever everyone seems to catch up, there’s always one brand ready to jump ahead again. To nobody’s surprise, it’s once again the flagship killer, OnePlus. Its OnePlus 13 is a shoo-in for the best battery life, and it comes down to a no-limits combination of capacity and charging speed. Plus, it also helps that it’s generally one of the best phones OnePlus has ever made.\nUp first, the cell that keeps the lights on. The OnePlus 13’s 6,000mAh cell is large enough to make all but the most dedicated gaming phones feel inadequate. It’s a full 1,000mAh larger than the battery Samsung tapped for its Galaxy S25 Ultra or Google chose for its Pixel 9 Pro XL, yet the OnePlus 13 is no thicker than either one. It can achieve such a remarkable capacity thanks to its switch from lithium-ion technology to silicon-carbon, a move that we’d love to see the likes of Samsung copy the next time it tries an ultra-thin Edge model.\nBetter, our objective drain testing showed that the OnePlus 13 can go on and on thanks to its impressive cooling setup and efficient Snapdragon 8 Elite chipset. It does experience some pretty extreme throttling here and there, occasionally quitting out benchmarking tests in the name of thermal management, but I’ve always been able to go two days between charges, so I’m not complaining.\nOnePlus's 6,000mAh battery looms large over most other Android flagships.\nAnd, when you inevitably drain your OnePlus 13, SuperVOOC charging is some of the best in the business. You’ll need to keep the included USB-A charger close at hand since SuperVOOC is a much different standard than USB PD PPS in terms of support, but when you watch the OnePlus 13 fly back to a 50% charge in just 13 minutes, you probably won’t have an issue with it. OnePlus’s latest flagship also supports 50W wireless charging through a brand-new magnetic charger with a built-in fan, though you’ll need a magnetic charger and might have to use a special plastic panel to protect the Arctic Dawn finish should you choose that colorway — it’s a bit of a confusing mess, and the only blot on an otherwise near-perfect package.\nASUS ROG Phone 9 Pro: Best Android phone for gaming\n- Overkill performance\n- Outstanding battery life\n- Fast, universal charging\n- Super-stable video\n- Handy AI tools\n- Expensive Pro model\n- Poor software commitment\n- Inconsistent cameras\n- No 4K recording on all lenses\nThe last of our main selections for this list of the best Android phones is one for the gamers, literally. ASUS’s ROG Phone 9 Pro is about as close to a gaming laptop as you can get, at least if you can ignore that it doesn’t fold in half. It has a frankly ridiculous spec sheet, offering up to 24GB of RAM with a Snapdragon 8 Elite chip under the hood and 65W wired charging that’s much faster than the MacBook Air I’m using to assemble this list.\nOf course, those features aren’t completely unheard of in the flagship Android segment — well, 24GB of RAM is a lot — but its clever gaming tweaks set the ROG Phone 9 Pro apart. It pulls the programmable matrix from the back of the ROG Zephyrus and pairs it with pressure-sensitive triggers dotted around the frame to help you draw some of the controls off the 6.78-inch AMOLED itself. Those features, combined with the improved efficiency of the Snapdragon 8 Elite chip, had my colleague Rob Triggs gaming with a smile, pushing the ROG Phone 9 Pro as hard as he wanted to find out where its throttling point lay.\nFor what might be the first time, though, Rob also declared this to be a gaming phone he might not mind using every day. See, a lot of gaming-specific devices fall into the common trap of being too big, too edgy, and too expensive for casual usage, not to mention the fact that camera hardware almost always comes last. On the ROG Phone 9 Pro, however, you get an updated 50MP LYTIA 700 sensor for the bulk of your photography, and ASUS has reimagined its stabilization for better video shooting. The display is also brighter and smoother than before, topping out at a 185Hz refresh rate and 2,500 nits of brightness, which is more than enough for a bright, sunny day.\nThe ROG Phone 9 Pro is an elite gaming phone that's flexible enough for everyday usage.\nAlso, if you’re serious about pushing the ROG Phone 9 Pro to its gaming limits (and why wouldn’t you be?), ASUS has several accessories worth checking out. Rob got plenty of mileage out of the detachable controller below, though he also mentioned the external cooling setup as a helpful option when trying to game and charge simultaneously. And, if you’re not set on the customizable LED matrix on the back, you can also check out the ROG Phone 9 to save a couple of bucks.\nHonorable mentions\nIf the Xiaomi 15 Ultra were just a little bit easier to access in the US, it might have earned a full spot on our list rather than simply an honorable mention, and I think it still has a legitimate claim to being the best Android camera phone. Like the last few Ultras, it’s practically a mirrorless camera with a phone on the back, pairing a trio of 50MP sensors with a 200MP telephoto camera and sporting an overall design that’s reminiscent of a Leica mirrorless camera to go along with Xiaomi’s Leica-tuned color science.\nMaking its first full appearance on this list (CMF Phone 2 Pro not withstanding), the Nothing Phone 3a Pro is one of the most fun mid-rangers I’ve reviewed in a while. Yes, it suffers from the same limited US band support as its siblings, but it’s easy to fall in love with the dot-based Nothing OS skin, the light-up Glyph Interface, and the snappy 50W wired charging. I might like the more subtle camera bump on the Nothing Phone 3a a little better, but the extra zoom flexibility is a worthy tradeoff.\nOnePlus’s proper 2025 flagship is more than deserving of its place as our battery king, but its mid-range option isn’t far behind. Some might say that the OnePlus 13R is a bit of a 2024 flagship in disguise, and I think they’d be right — in the best of ways. It pairs a Snapdragon 8 Gen 3 chipset with a OnePlus 13-esque design, housing a trio of camera sensors in its circular bump. I’ll never complain about a phone with a 6,000mAh battery capacity, though it’s a bit of a bummer that the included SuperVOOC charger will only get you to 55W.\nAlthough I’m happy to call Motorola’s latest Razr Ultra the best flip phone, it’s also the most expensive. Samsung’s Galaxy Z Flip 6, on the other hand, picks up right where the Galaxy Z Flip 5 left off, with two capable cameras, a folder-shaped Flex Window, and nabs a chipset upgrade to keep things interesting. You’ll have to get used to having two app drawers if you want more than Maps, YouTube, and Google Messages at your disposal, but Samsung’s full-screen widgets are simply excellent.\nIn that same vein, the Galaxy Z Fold 6 has gone from setting the standard for book-style foldables to playing second fiddle to the Pixel. It’s still an excellent foldable, and its taller, thinner internal display sometimes makes a bit more sense than Google’s wide aspect ratio, but it hasn’t changed too much outside of a chipset upgrade in recent years, still sporting the same battery, charging setup, and cameras as the Folds that came before it.\nIf you’ve spent any time looking for a great Android phone, you’ll know there aren’t many small ones left. Somehow, 6.5-inch or larger displays have become the standard, leaving those of us with smaller hands relegated to a precious few picks. Thankfully, the Pixel 9 is one of those, offering quite a lot of the Pro-level experience in a slightly more comfortable form factor. Its 6.3-inch display is easy to reach across yet doesn’t feel so tiny that you’re missing out on real estate. If we hadn’t already put every other Pixel 9 device on this list, this one might have earned more than an honorable mention.\nMany of Samsung’s best offerings lay it on pretty heavy with the focus on power users, and there’s nothing wrong with that. However, it also has the unintended benefit of making Samsung’s budget-conscious picks stand out slightly more. The Galaxy S24 FE is one such option, landing just below the flagship tier with a display that nearly matches the Galaxy S25 Plus, materials like aluminum and Gorilla Glass Victus Plus that I’d trust without a case, and just enough of a dip into Galaxy AI to give more users a taste of Chat Assist, Note Assist, and better photo editing tools.\nWhat to look for in a good Android phone\nWe could sit here and list the best Android phones all day — we’re phone nerds, it’s our job. We’ll sit here and reminisce on some of the best phones from yesteryear, too, looking for any excuse to pull something fun out of the closet. However, just because we like one or two or ten things about a phone doesn’t mean it’s right for you. There’s much more to consider before you splash the cash, especially if you plan to have this phone for several years.\nWe have our favorite Android phones, but the best way for you to pick one is to break it down into the features you really want.\nFor example, if you want a small, super-portable phone, something like the Galaxy S25 Ultra simply won’t work, no matter how you try to wrangle it. That 6.9-inch display will always feel too big for your pocket. At the same time, it’s a great phone that packs flexible cameras, a powerful chipset, and a convenient S Pen, so it’s all about deciding what features you absolutely must have in a device.\nSo, with that in mind, here are a few things I always tell people to look for when buying a new phone:\n- Software updates: A phone is only as good as the number of software updates it will receive. You won’t be able to change your battery, display, or camera hardware over time, so most of the value you’ll pull from a phone comes from keeping it for years and years after you’ve paid it off. The best way to guarantee some of that value is with a Pixel or Galaxy device set for seven years of patches, though Motorola and OnePlus are catching up with four and five years of support at their flagship levels.\n- Camera flexibility: If you’re after one of the best Android phones on the market, you probably have high camera expectations. It’s perfectly understandable — you’ll probably capture your life with this device for several years. And, as you might have noticed, single-camera Android phones aren’t a thing anymore. So, if you prioritize a great camera phone, you’ll want to keep an eye on things like sensor size, telephoto focal length, and how your phone processes images after the fact.\n- Display size: As mentioned above, finding a small Android phone is easier said than done these days. There aren’t many 6.1-inch or 6.2-inch options left, with premium picks like the Pixel 9 Pro XL and Galaxy S25 Ultra measuring close to 7 inches, and many budget to mid-range options measuring 6.5 inches or larger. Also, if display size is no issue (or you want a phone that can check two boxes at once), you might consider a foldable that can take over for a tablet, too.\n- RAM and storage options: Depending on your needs, you might also want to monitor the RAM and storage that your chosen Android phone comes with. At one point, 8GB of RAM was enough to tackle everything from web browsing to gaming to streaming a full season on Netflix, but no longer. With the explosion of AI-powered features, 12GB is closer to the bare minimum for flagships, while the Pixel 9 Pro series feels even more capable with 16GB across the board.\n- To fold or not to fold: Foldable Android phones remain one of the most exciting categories in tech, at least to me. They’ve improved by leaps and bounds in recent years, picking up better cameras, thinner hinges, and better protection against water and dust. However, you’ll still have to weigh out whether or not you have the budget to try something new and if you can live with a spec sheet that hasn’t caught up just yet.\n- Durability: These days, phones feature more premium materials than ever, sometimes pairing aluminum and titanium frames with advanced glasses like Panda Glass and Gorilla Glass or interesting textures like vegan leather and, in the case of the Razr Ultra, Alcantara. My advice would be to think about what materials you want and whether or not you plan to put your phone in a case. Also, keep in mind that IP68 ratings against water and dust have become the standard for many flagships, so think twice before settling for a lower rating, even if it saves money.\n- Charging speed: It’s no longer a surprise to see phones ship with 5,000mAh batteries — in fact, it’s expected on phones of a certain size. However, with great power capacity comes great responsibility, so you’ll want to keep an eye on the charging speeds that your new phone supports. Some, like OnePlus, offer up to 80W speeds with the correct charger, while others, like the Galaxy S25, won’t go above 25W no matter how hard you try. Also, if you opt for something like the Pixel 9 Pro XL, you’ll need Google’s in-house USB-C charger to guarantee the best speeds, so you might need to budget for some extra charging accessories.\n- AI features: One last thing worth watching — and probably the least essential of my picks — is the list of AI features your new phone will support. If you opt for a flagship Pixel or a Galaxy S25, you’ll get a pretty solid set of Gemini and Galaxy AI picks, while the OnePlus 13 and Motorola Razr lineup might lag behind just a bit. Then again, you might find that the available features don’t quite mesh with your usage or don’t feel quite polished enough, so you may also be able to get by with Circle to Search and some of the other features that have made their way to lower price points.\nWhy you should trust me\nI’m a phone guy — always have been. I can still rattle off every device I’ve ever purchased with my own money, and I continue to hold the LG G3 as one of my favorite phones of all time. I stayed almost perfectly true to Android ever since my parents got me my first smartphone after I made it to high school, at least as long as you’re willing to forgive the few years I spent with an iPhone 7 when I let green bubble bullying get the best of me.\nSince then, I’ve made my love of phones into my day job, shifting my personal SIM more times than I can count and spending time with everything from the Motorola Moto G Play (2021) to the OnePlus Open to the Galaxy S25 Ultra in my pocket. I won’t pretend to have loved every phone I’ve reviewed — you have to break a few eggs to make an omelet — but I’ve taken highlights away from each one and come to appreciate Android options both high and low.\nI review dozens of Android phones every single year, and my personal SIM moves around enough to qualify for frequent flyer status.\nFurther, my opinions come from more than simply running around with a new phone in my pocket. Part of my role as a reviewer is to work closely with my colleague, and our resident testing expert, Rob Triggs, to come up with objective metrics by which we can compare devices. We’ve worked closely to cook up tests for battery life and charging, along with a nicely standardized set of ways to put CPUs and GPUs through their paces long before I ever sit down to write a review. Do I still count my hands-on experience? Of course I do, but I also like to ensure that data backs them up. If you want more information on our testing procedures, you can read our full methodology at the link.\nWhat do you look for in an Android phone?\nSometimes, my need to be thorough means that I’m not the first reviewer to press the publish button, and I’m rarely the shortest and sweetest among my peers, but I don’t mind. I’ll happily cause a little bit of a headache for my editor (shout out to you, Ollie) if it means I know I’m being as thorough as possible. Besides, with how far phones have come in just the last few years, I’m not sure how anyone could put together a review without stopping and taking a few stretch breaks.\nThank you for being part of our community. Read our Comment Policy before posting."
    },
    {
      "url": "https://www.androidauthority.com/tag/samsung/",
      "text": "Pages tagged:\nSamsung\nNew Galaxy S26 Edge battery leak keeps piling on the bad news\nThose expecting a 4,400mAh battery might be disappointed.\nHadlee Simons2 hours ago\n0\nRyan McNealAugust 29, 2025\n0\nSamsung Messages rolls out 'Bubble Emoji' to put some personality into your texts\nSamsung Galaxy Tab S11 and Galaxy S25 FE leaks are getting even better as Unpacked looms\nStephen SchenckAugust 29, 2025\n0\nThe time to say goodbye to your Tizen OS smartwatch is almost here\nRyan McNealAugust 29, 2025\n0\nSamsung multi-fold leak teases some of the phone's wireless features\nRyan McNealAugust 29, 2025\n0\nSamsung's take on Pixel Screenshots is finally available to global users\nRyan McNealAugust 29, 2025\n0\nSamsung's latest dig at the iPhone lacks wit, but it has a cat at least\nTushar MehtaAugust 29, 2025\n0\nThe Galaxy Watch 8 is the first smartwatch I forgot I was wearing\nAdamya SharmaAugust 29, 2025\n0\nThe latest One UI 8 beta finally brings Now Brief to Galaxy S24 series\nHadlee SimonsAugust 29, 2025\n0\nSave $200 on the already-affordable Samsung Galaxy Z Flip 7 FE\nEdgar CervantesAugust 28, 2025\n0"
    },
    {
      "url": "https://samlover.com/2025/08/30/galaxy-s26-edge-battery-capacity-revealed-through-a-certification/",
      "text": "Galaxy S26 Edge Battery Capacity Revealed Through a Certification\nSamsung Galaxy S26 Edge is supposed to replace the Plus variant from the Galaxy S26 lineup, and its battery has now appeared on the 3C certification.\nThe Korean tech giant has already started working on its next-generation Galaxy S26 series, which is expected to launch between January and February next year. The lineup will include three models, including the Galaxy S26 Pro, Galaxy S26 Edge, and Galaxy S26 Ultra.\nA few weeks ago, it was reported that the Galaxy S26 Edge will have a 4,200mAh battery packed into an ultra-slim 5.5 mm profile. However, some battery rumors suggest that it will have a 4,400mAh battery.\nSamsung Galaxy S26 Edge Battery to Get Massive Upgrade Over S25 Edge\nMeanwhile, the Galaxy S26 Edge’s battery has now been spotted on the 3C certification, which revealed that the rated battery capacity of the device is 4,078mAh. This hints that the typical capacity could be 4,200mAh.\nHowever, there’s no official statement regarding the battery capacity of the Galaxy S26 Edge, so it remains to be seen whether the typical capacity will be 4,200mAh or 4,400mAh. According to the previous report, the Galaxy S26 Edge could feature a 50MP camera from Sony. Recently, the device appeared on Geekbench’s database, which confirmed that it will be powered by the Snapdragon 8 Gen 2 chipset."
    },
    {
      "url": "https://www.androidauthority.com/news/",
      "text": "News\nAudioComputingGamingGeneral technologyMobileSmart homeStreaming and entertainmentWearables and health\nAYN's flagship gaming handheld confirms a massive screen upgrade\nThis \"exclusive\" panel might be the Odin 3's killer feature.\nNick Fernandez\nSony just locked one of the best Xperia features behind a paywall\nTushar Mehta56 minutes ago\n0\nNew Galaxy S26 Edge battery leak keeps piling on the bad news\nHadlee Simons1 hour ago\n0\nPorts, price, performance, or support: What trumps all on a Google TV streaming box?\nAndy Walker2 hours ago\n0\nAndroid 16 has an annoying notification bug, but a fix is coming\nNot hearing notification sounds in Android 16? Google says a fix is on the way.\nHadlee Simons\nAcer just announced a Google TV box with all the ports you want (Update)\nHadlee SimonsAugust 31, 2025\n0\nIt's surprisingly easy to remove Google's digital AI watermark on the Pixel 10\nRita El KhouryAugust 30, 2025\n0\nLibby introduces 'Inspire Me' to beef up your reading list\nKaitlyn CiminoAugust 29, 2025\n0\nOur latest\nSamsung Messages rolls out 'Bubble Emoji' to put some personality into your texts\nRyan McNealAugust 29, 2025\n0\nSamsung Galaxy Tab S11 and Galaxy S25 FE leaks are getting even better as Unpacked looms\nStephen SchenckAugust 29, 2025\n0\nGoogle Pixel 10 phones are out, and you can still get free gift cards if you buy one!\nEdgar CervantesAugust 29, 2025\n0\nThe time to say goodbye to your Tizen OS smartwatch is almost here\nRyan McNealAugust 29, 2025\n0\nThat upcoming dual-screen Android gaming handheld now somehow sounds even more appealing\nStephen SchenckAugust 29, 2025\n0\nBose QuietComfort Ultra price finally drops again, saving you $50\nEdgar CervantesAugust 29, 2025\n0\nSamsung multi-fold leak teases some of the phone's wireless features\nRyan McNealAugust 29, 2025\n0\nHot deal: Motorola Razr Plus 2025 plummets to new record-low price, saving you $550!\nEdgar CervantesAugust 29, 2025\n0\nGoogle just can't stop reimagining how it wants Quick Share to work (APK teardown)\nStephen SchenckAugust 29, 2025\n0\nGoogle’s Expressive Clock redesign is already ticking people off (Update: Google response)\nMatt HorneAugust 29, 2025\n0\nSamsung's take on Pixel Screenshots is finally available to global users\nRyan McNealAugust 29, 2025\n0\nSamsung upgrades Family Care with health data, smarter alerts, and easier setup\nMatt HorneAugust 29, 2025\n0"
    },
    {
      "url": "https://www.androidauthority.com/samsung-galaxy-s26-edge-battery-leak-3583707/",
      "text": "Affiliate links on Android Authority may earn us a commission. Learn more.\nThe Galaxy S26 Edge battery rumors just got even more promising\nAugust 4, 2025\n- A new leak suggests the Galaxy S26 Edge will have a 4,400mAh battery.\n- That’s noticeably up from 3,900mAh in the S25 Edge and slightly more than a previous 4,200mAh claim.\n- Both leaks point to Samsung addressing one of the biggest complaints about the S25 Edge.\nThe Galaxy S25 Edge was one of Samsung’s most criticized flagships of recent years, and much of that frustration rightly centered on battery life. Now, we have a second clue that Samsung may address that with a beefier battery for its successor.\nAccording to a new Weibo post from leaker Setsuna Digital, the Galaxy S26 Edge will feature a 4,400mAh battery. That’s notably higher than the 3,900mAh cell in the S25 Edge, and slightly more than the 4,200mAh figure suggested by a previous leak last week.\nThe difference between the two leaks isn’t huge, but they both reinforce the same message: Samsung is taking battery concerns seriously this time around. The S25 Edge combined a sharper display and higher-resolution camera with a smaller battery than the base S25, so it wasn’t surprising to see worse battery life in our testing — though the drop-off was bigger than you might expect from a 100mAh difference.\nIf this latest number holds, the S26 Edge would slot between the S25 and S25 Plus in terms of capacity, rather than still being lower than the cheapest of those two models. Indications are that we won’t get a Galaxy S26 and S26 Plus next year anyway, with them both to be ditched for an S26 Plus model, but it’s a decent benchmark nonetheless.\nIt’s nice to see Samsung responding positively to the constructive feedback of the fans, especially concerning an area of the specs that a large proportion of users care about.\nThank you for being part of our community. Read our Comment Policy before posting."
    },
    {
      "url": "https://www.androidauthority.com/android-authority-comment-policy/",
      "text": "Android Authority is a community of technology enthusiasts. We’re brought together by our interest in all things tech, regardless of brand, platform, and price point. Our writers care deeply about the topics they cover, and so do our readers.\nBecause we’re all passionate, it’s easy for discussions around certain topics to become heated, but that’s not an excuse for discussions to degenerate.\nHere are the general rules that cover commenting on Android Authority platforms, including on-site comment sections, YouTube, and various social media channels.\nDo’s\n- Always be civil.\n- Read the content before commenting.\n- Post thoughtful comments that meaningfully contribute to the discussion.\n- Give constructive criticism in response to posts and other comments.\n- Ignore the trolls, they crave attention.\n- Downvote low-quality comments. Flag spam and abusive comments.\nDon’ts\n- Attack commenters, Android Authority staff, or other individuals.\n- Post off-topic comments.\n- Post abusive, insulting, threatening, harassing, sexist, racist, misogynist, homophobic comments.\n- Reveal personal information of any individuals.\n- Spam, self-promote, impersonate.\n- Post low-effort comments that don’t add anything to the discussion.\n- Post porn, gore, or other NSFW content.\n- Post or link to pirated content of any type.\n- Post slanderous or defamatory comments.\nHouse rules\n- Comments are solely the opinions of the individuals leaving them. In no way does Android Authority endorse or condone them.\n- Failure to comply with the guidelines above may result in your comments being deleted or moderated.\n- Repeat and serious offenders will be banned.\n- We reserve the right to delete or moderate comments at any time and at our sole discretion.\n- This policy may be changed at any time and at our sole discretion."
    },
    {
      "url": "https://www.androidauthority.com/android-authority-preferred-source-google-search-3586296/",
      "text": "Affiliate links on Android Authority may earn us a commission. Learn more.\nWant more Android Authority? How to set us as your preferred source in Google Search\nAugust 12, 2025\nSince 2007, Android Authority has strived to bring all of our readers the very best coverage of Android and the mobile tech world. And even after 18+ years as a proudly independent media outlet, we’re as driven as we’ve ever been to bring you all the latest exclusive reports, app teardowns, leaks, hands-on reviews, experience-based features, lab testing, and other expert analysis.\nOf course, how we’ve been able to get that coverage to you has changed in countless ways during that time, be it via our website, YouTube channel, social media, or new projects like Authority Insights, which combines our elite reporting with a podcast and a newsletter, as well as our brand new YouTube channel from Android Authority‘s Pixel guy, C. Scott Brown.\nWe want to continue to bring you the very best Android and mobile tech coverage, and you can help us do that.\nWe know and deeply appreciate that so many of you repeatedly visit our website and other channels to constantly see what we’ve been working on, often every day. Every one of those clicks or interactions helps us remain independent and every bit as innovative and ambitious as we’ve been since day one.\nSo, if you want to see even more of our content, guarantee you don’t miss anything from us, or just want to continue to support our mission, we’d like to ask you a big favor and set Android Authority as a preferred source in Google Search. It only takes a few seconds, it doesn’t cost you anything, and it will help us continue to bring you the best possible content for the next decade and beyond.\nThis feature is currently only available in the US and India, but we’ll let you know when other regions are included in this new feature. For those who already have it, here’s how to do it:\nHow to set Android Authority as a preferred source\nMethod 1:\n- Head to this link and you can add us directly to your list of preferred sources.\nMethod 2:\n- Search for a topic that’s in the news and find the “Top stories” header. If you don’t see this, you might need to input a different query. “Galaxy S26 Pro” worked for us at the time of writing.\n- Click on the icon on the right of the “Top stories” header. That’s the icon with the stacked squares and a star on top.\n- Search for “Android Authority” and select it to set it as a preferred source. You can add other websites at this stage, too — support your favorite publications!\n- Refresh your search results to see more from your favorite sites.\nOnce again, a big thank you to all our readers, viewers, and followers — your passion for Android and tech is what pushes us forward. We hope you’ll add us as a preferred source (and please feel free to encourage any other tech enthusiasts you know to do the same!), but even if you don’t, we’re grateful for every one of you that supports our work in any way possible. And as ever, if you have any feedback for us, please drop an email to contact@androidauthority.com.\nThank you for being part of our community. Read our Comment Policy before posting."
    },
    {
      "url": "https://www.androidauthority.com/samsung-galaxy-s25-edge-review-3561939/",
      "text": "Affiliate links on Android Authority may earn us a commission. Learn more.\nIf ultra-thin phones are the future, I hope they learn from the Galaxy S25 Edge's biggest mistakes\nMay 31, 2025\nSamsung Galaxy S25 Edge\nWhat we like\nWhat we don't like\nSamsung Galaxy S25 Edge\nThere’s something to be said for throwing an idea at the wall and seeing if it sticks. Sometimes, it gives us something brilliant, like HTC introducing dual camera setups to the world or Samsung resurrecting the foldable phone. Other times, like with the LG Wing, it leaves us scratching our heads, wondering how an idea ever grew the wings it needed to fly — pun intended.\nSo, when Samsung teased the Galaxy S25 Edge at the end of its first Unpacked event of 2025, I figured it could go one of two ways: we could have a new standard for ultra-slim smartphones on our hands, or we could have a one-off design that reminds us why innovation isn’t always progress. Unfortunately, I think this is a case of the latter, and here’s why.\nIt’s a design marvel…\nDon’t get me wrong — the Galaxy S25 Edge looks impressive. It even feels impressive. Every time I pick it up, I’m in awe of how Samsung managed to make something with such a large display so thin and feel so light. Whenever I hand it off to a friend, they seem to heft it once in their hands before immediately pulling out their iPhone for a side-by-side comparison. Every time, the Galaxy S25 Edge is thinner and lighter, at least for its size.\nThat’s what’s most exciting about the Galaxy S25 Edge: Every time someone holds it, you get to see the look of surprise on their face. It’s the Galaxy S25 Edge’s entire bit — at just 5.8mm thick from top to bottom, it’s probably the thinnest device most people have held in a long time, unless they’re dedicated iPad Pro users. And yes, there’s a bit more of a bump around the cameras, because there’s no way a 200MP primary sensor would fit directly into the body, but it certainly doesn’t break the illusion of top-to-bottom thinness.\nSeeing my friends' faces as they hold a phone this thin and light is almost worth the price of admission... almost.\nHowever, it also takes just a few seconds of holding the Galaxy S25 Edge for the questions to start rolling in. I’ve been peppered with everything from “How do you hold it comfortably?” to “Do you think you could bend it?” to “Why are you using it without a case?”\nHonestly, the answers to all three of those questions are pretty much the same — you just have to trust Samsung a little bit. It decked out the Galaxy S25 Edge in its best materials, sandwiching a titanium frame between Gorilla Glass Ceramic 2 on the front and Gorilla Glass Victus 2 on the back. If you find a way to bend it in your pocket or your backpack, then you’re probably going to destroy a thicker, less expensive phone, too.\nOf course, that level of faith in the top-tier materials doesn’t make the Galaxy S25 Edge any more comfortable to hold. It feels like picking up a vinyl record to put it on your turntable, by which I mean you hold it so carefully by the frame because you’re worried about smudging the front by accident. I know I’m not going to damage the 6.7-inch AMOLED by touching it — it’s a phone, it’s meant to be touched — but I’m more worried about accidentally opening an app, pressing on my home screen to edit the layout, or launching Circle to Search via the gesture pill, because all three of those things have happened thanks to my stocky little fingers.\nOh, and I simply refuse to use the Galaxy S25 Edge with a case, because that would essentially make it as thick as any other phone, which I would also prefer to use caseless. You could argue that it’s better to have a protected thin phone that’s only as thick as an unprotected regular phone, but I still think it defeats the point of buying the Edge. Besides, the phone is already IP68 protected, so I shouldn’t have a problem letting it stand up to the elements while the glass and titanium defend it in case I take a tumble.\nUnfortunately, to go back to that vinyl record metaphor I used, that’s my biggest problem with the Galaxy S25 Edge. Even though I know it’s durable, just like I know that lightly touching a vinyl record won’t cause irreparable harm, I can’t bring myself to use it like I would another phone. I’m still determined to treat it like a work of art that’s to be handled as if it were about to break, and that makes me not want to use it at all. I’m too nervous to simply toss it in a backpack or leave it on the couch when I dash out for a couple of morning miles, all because I’m not sure what would happen if I were a little too rough.\nEven worse, by treating the Galaxy S25 Edge with such care, I feel like I’m depriving myself of one of Samsung’s best features: its excellent display. The Galaxy S25 Edge packs a nearly identical 6.7-inch LTPO AMOLED panel to the one on the Galaxy S25 Plus, right down to the variable 120Hz refresh rate. We loved the display on that phone (even though the phone itself was a bit of a meh-burger), and it’s just as good this time, too.\nThe colors are rich and vibrant, the refresh rate is buttery smooth, and the nearly nonexistent bezels make the Edge feel like all content, all the time. It was the perfect display for checking the finales of Andor and The Last of Us off my list, and I propped it up next to my laptop to watch Chelsea lift the UEFA Conference League trophy, completing world football before Arsenal has won any European silverware (whoops, sorry, stream of consciousness there… moving on).\nOne thing I didn’t expect from the Galaxy S25 Edge’s display, though, is just how dim it can get. Sure, it’s fun to brag about peak brightness, and reaching 2,600 nits in bright sunlight is great, but I wasn’t expecting Samsung’s ultra-thin flagship to go the other way, too. While testing the camera, I watched the phone overrule me, kicking into the most extreme form of battery saver and dropping the panel to what I can only guess was one nit. At the time, I was annoyed, as it was a bright, sunny day, so I could no longer see the camera interface itself, but I’ve since come around to the idea that it was doing everything possible to stretch its battery just a little bit further.\n…with performance pitfalls…\nAlthough most of the questions I’ve fielded about the Galaxy S25 Edge have been about its eye-catching, barely there design, one more comes up just as often: Does its performance keep up? After all, with such a slim body, there’s only so much room for cooling technology and to fit a battery, so something has to give, right? Unfortunately, yes.\nBefore we talk about shortcomings, though, we should touch on the Edge’s chipset and storage combos — they do everything they can to set the phone up for success. It picks up where its siblings left off, pairing a Snapdragon 8 Elite processor with 12GB of RAM and up to 512GB of fixed storage. That’s more than good enough for day-to-day tasks, and sets the Galaxy S25 Edge up to make a solid run at our gauntlet of benchmarks.\nAt first, the Edge’s performance backed up exactly what I thought it would. My colleague Rob Triggs and I put it up against its fellow Galaxy S25 models across our pair of CPU-intensive tests, and it hung right with its counterparts. It only came up shy of the Galaxy S25 Ultra in single-core Geekbench 6 performance, and barely edged the crowd on the more comprehensive PCMark Work test. Unfortunately, as Rob noted in his head-to-head… -to-head-to-head comparison, that’s where the good news runs out.\nWhen we flipped our testing to the more graphically intensive Wild Life stress tests, the Galaxy S25 Edge was quick to throw in the towel. Both times, it started out running like an Olympic sprinter, only to drop below even the smallest Galaxy S25 model by the fourth or fifth run. At its worst, the Edge scored about 8.5% slower than the Galaxy S25 and a painful 24.8% behind the Galaxy S25 Ultra — no small margin when spending over $1,100 on a new phone.\nIt’s pretty straightforward to figure out why the Galaxy S25 Edge stumbles when it does, though: Its thermal regulation isn’t there. It peaks at the same internal temperature as Samsung’s other flagships, but when it hits that temperature, it has to throttle its performance much harder to compensate for the condensed cooling setup. Unfortunately, that means cutting its performance in half by the end of our testing — something we haven’t seen since the Galaxy Z Flip 6 with its equally tricky cooling setup.\nThe Edge has trouble keeping up with non-Samsung devices, too. We’ve already established that it starts sky-high, just about matching the OnePlus 13’s peak despite the latter having a massive cooling chamber, before dropping much closer to the performance of the iPhone 16 Pro Max and Pixel 9 Pro XL just a few runs later. It’s not bad company to keep — both Apple and Google make great flagships — but you get more out of both in terms of battery life and camera flexibility to make up for whatever performance woes pop up. The Galaxy S25 Edge has no such luck. Oh, and the Galaxy S24 FE puts up similar final numbers despite costing nearly $500 less.\nNow, this is where you might hope I’ll swoop in and say the Galaxy S25 Edge’s day-to-day performance is different from its controlled benchmarks. It’s not.\nThe phone runs fine under casual load but stumbles when you ask it to work a little harder. The Snapdragon 8 Elite chipset heats up, the battery drops like a stone, and you start to get battery anxiety in a hurry. I can make do if I’m just walking around my neighborhood, listening to Spotify and scrolling social media, but when I was home for Memorial Day Weekend, I decided to work the Edge a bit harder. I took it for the photo walk I mentioned in the design section above, and it showed me just where its weaknesses lie.\nWhen I started my trip around town, the phone was at a comfortable 25% charge — perfectly reasonable, and no battery saver was needed yet. I put my trusty CMF Buds Pro 2 in my ears and fired up my daylist while looking for interesting scenes worth shooting. After about 20 minutes in the sun, opening and closing the camera as needed, the battery dropped to a mere 3%, and the titanium frame felt uncomfortably warm in my hand. This is when Samsung hacked its brightness down to just one nit, marking the end of my adventure because I couldn’t see the screen any longer.\nOf course, I wasn’t in an emergency, so I just shrugged and went back to my parents’ house to look for a charger. However, that poor battery return has stuck with me to the point where I’m not sure I’d leave home with anything less than a 30% charge and expect to have any juice left by the time I get back.\nThe Galaxy S25 Edge is great in short bursts, but like a sprinter, it runs out of energy in a hurry.\nThen again, I can’t imagine that many people will be using the last 20% of their phone’s battery to take photos of the place where they grew up, but I prefer to think of it as a warning. The stakes were very low for me, but if you were out on a hike and got lost or got into a car accident and needed to call for help, I’m worried that you wouldn’t be able to trust the Galaxy S25 Edge like you could another phone. And, if you can’t trust your phone when you need it most, you’re probably not going to have that phone for very long.\nGranted, the Galaxy S25 Edge is much more reliable for casual workloads. It soared through the last few episodes of some of my favorite shows, as mentioned above, and it’s been perfectly happy to load up Pokémon TCG Pocket while I waste time opening pack after pack looking for a few more shinies. More graphically intensive titles like Call of Duty Mobile and even Warhammer 40,000 Tacticus would probably turn the Galaxy S25 Edge into a small neutron star, though — either that, or it would throttle to the point where they became unplayable.\nAnd, since I’ve opened the door of complaining about the Galaxy S25 Edge’s tiny battery, let’s stay a while. Personally, I think this is the biggest thing that would make me nervous about keeping and using this phone in the long term. Due to size constraints, Samsung could only fit its flagship with a 3,900mAh battery, making it smaller than the cell inside the base Galaxy S25. Had Samsung adopted a silicon-carbon battery, it probably could have bumped that capacity by a few hundred milliamp-hours, much like OnePlus did with the OnePlus 13, but it didn’t. It settled for less, and our controlled battery drain test shows why that was probably a bad idea.\nOn the left side, we have the Edge’s performance against its fellow Samsung models, discounting the Galaxy S25 Ultra to keep the graph legible. Across four of the first five categories, the ultra-slim Galaxy S25 Edge comes up short. Sure, it ties the Exynos-toting Galaxy S24 on a simulated Zoom call, and it’s right in the mix for camera performance, but everywhere else, it’s hovering around fifth place out of five. It, of course, has the fifth-largest battery out of the five, so there’s not much for the Galaxy S25 Edge to hang its hat on here.\nThe problems get worse on the right side when we put the Edge up against similarly priced competition, including the beefed-up Motorola Razr Ultra and the iPhone 16 Pro. Yes, the Edge generally stays ahead of its iOS-powered rival, but it falls far behind the other three Snapdragon 8 Elite flagships, stopping hundreds of minutes short of the rest in terms of 4K video playback, web browsing, and even a simulated Zoom call. Mix in the fact that the rest of these phones have much larger batteries for not much more money (or sometimes less), and it becomes tough to reach for the Galaxy S25 Edge.\nSwapping over to charging, the Galaxy S25 Edge once again takes after Samsung’s smallest flagship. It packs the same 25W wired and 15W wireless charging options as the base Galaxy S25, ignoring that Samsung’s more expensive options bump the rate to 45W with a compatible USB PD PPS block. This strict limitation means that although it has the smallest battery of the phones I compared it to on the right side, it charges second-slowest, only finishing faster than Apple’s turtle-esque iPhone 16 Pro.\nAnd yes, I’ll admit that it’s probably unnecessary to complain about a phone that can fill its battery in just about an hour, but when options like the Razr Ultra and OnePlus 13 can fill their much larger cells in as little as half the time, I’m going to pick them whenever I get the chance.\n…and inflexible cameras…\nWhile I can understand Samsung stripping back the battery capacity on its slimmest flagship to date, it’s tougher for me to understand a few other limitations, including the dual camera setup. Yes, for the first time since the Galaxy S10e (which cost a fraction of what the Galaxy S25 Edge does), we have a flagship Samsung phone with only two rear cameras. Granted, the primary camera is an absolute beast — the same 200MP sensor from the Galaxy S25 Ultra — but it feels like Samsung has given up one of the things I’ve always trusted to keep it among the best camera phones you can buy.\nTo me, when you pick up a traditional Samsung flagship, you expect a pretty flexible triple camera setup. You expect a solid primary camera, a telephoto sensor set to 3x optical zoom, and an ultrawide sensor that rounds things out. That’s not the case with the Edge. It’s content to pair its Ultra-tier primary sensor with a Plus-tier 12MP ultrawide shooter, creating a camera duo that’s equally excellent and just kind of everyday average. It could have pulled over the 50MP ultrawide sensor from the Galaxy S25 Ultra, giving the Edge more megapixels and cropping ability than it could know what to do with, but instead went the more pedestrian route while stripping most of the zoom capability.\nThere are plenty of megapixels here, I'm just not sure they're in the right place.\nOf course, I can only imagine that Samsung decided to axe the telephoto sensor in order to limit the size of its camera bump, thus keeping the Edge, well, edgy. Engineers probably already took exception because the bump is just as thick as the rest of the phone, and maybe they put their foot down at the extra space the hardware would have required. Unfortunately, that means the zoom on the Galaxy S25 Edge is all digital and tops out at just 10x zoom — the same as an iPhone 16 or a base Pixel 9. You could technically get creative and shoot full 200MP images from the primary camera only to crop them in tighter afterwards, but otherwise, there’s no way to push the default interface further. In practice, that makes the Galaxy S25 Edge feel like a Fiat with the engine of a Ferrari — you know it could probably do more, it just won’t.\nLet’s get to some camera samples, and you’ll see what I mean.\nI don’t have too many issues with any of the shots I picked for this first row — they show the Galaxy S25 Edge’s strengths pretty nicely. The subjects in all four samples are clean and sharp, with pleasant natural fall-off behind the sign in my hometown and good shadows below the rail car to the far right side. If I had to pick out a hiccup from the bunch, it would be that Samsung’s heavily saturated red and green color profile is back with a vengeance. I know it was a sunny day, but the caboose that sits in the park in my hometown hasn’t been that red for a few years, nor is the grass usually quite so lively at this point in the spring. Also, for being a mostly digital crop, the shot of the blue crab holds pretty solid detail.\nMoving on, Samsung’s dedicated portrait mode is just as reliable as its natural bokeh, if a bit sharper. I like that it was able to pick out the entire lion sculpture against the white fence, as I’ve had other experiences where a phone will isolate the lion’s head and then call it a day. The massive 200MP sensor had no troubles with the slightly lower lighting conditions in the shot to the right, either. It correctly exposed the ice cream sign while keeping accurate shadows in the doorway and on the ivy-coated building in the background. The macro-like shot of the succulent on the left-hand side brought one of Samsung’s other quirks to my attention, which is the way it handles Focus Enhancer in close-ups.\nNow, I didn’t think to snap two shots of the first succulent, so I went back out to find a hydrangea on my street back home in Baltimore. I grabbed two photos — one with Focus Enhance active and one with it turned off. After a glance between the two, I think I’ll be turning Focus Enhancer off for the foreseeable future. Although it cleverly adjusts for macro-like detail, Samsung’s artificial sharpening is just too much for me to think the image is natural.\nAlso, while I gave Samsung some heat for picking the lower-resolution ultrawide sensor over the 50MP option on its Ultra, I still think it’s a good camera. I love the colors in the shot of the town hall to the far left, and I think the camera does a great job of showing the scale of the church tower on the right side. It’s a little tougher to get a look I like when trying to capture street art up close, referring to the mosaic on the far side, but the colors are still spot-on given the gray, overcast day when I was walking around.\nAlright, here’s where I get to illustrate the problem with Samsung ditching the telephoto sensor. Despite having a monstrous 200 megapixels to work with, the Galaxy S25 Edge is happy to stick with just 10x zoom. That’s a fraction of what the smaller Galaxy S25 models can achieve at 30x and hardly compares to the 100x Space Zoom of the Galaxy S25 Ultra. Yes, I will admit that limiting the zoom ensures better finished photos across the entire range — everything below is plenty sharp enough for me to share it, though, because it’s digital, you can’t pixel peep without things getting dicey — but it feels like an artificial limitation on such an expensive smartphone.\nThe last piece of Samsung’s premium camera setup is its 12MP selfie camera. This time, I have to give it some credit for matching the Galaxy S25 Ultra — even if a 12MP sensor isn’t a high bar in a punch hole. Either way, I think the colors and details are good enough, and the artificial bokeh does a pretty good job of capturing all of my hair without putting too sharp a line around my head. I’m not entirely sure why my white shirt has such a blue cast, but I’m much happier with the tones in my face, even if I got a little burnt over the holiday weekend.\nIf high-quality video is what you’re after, you can probably guess what I’m about to say. Yes, the Galaxy S25 Edge shoots great footage at 1x or 2x zoom. Yes, the stabilization is excellent, and the ability to shoot 8K at 30fps or 4K at up to 120fps means you have plenty of options. I like how a few of my simple clips around town came out, but like above, the lack of zoom flexibility means there are scenes you just won’t be able to dial in closely enough.\nOn the bright side, some of Samsung’s latest software wrinkles make it more enjoyable to use the cameras overall. The Edge supports a smooth zoom slider when shooting videos, which makes clips, well, smoother. It also lets you save exposure settings when you flip between camera modes so that you don’t have to raise and lower your exposure and risk missing a shot. Perhaps the coolest trick in the Galaxy S25 Edge’s camera book, though, is its ability to shoot Log format videos from both the front and rear sensors, meaning that you can easily hop in and color grade your footage later on.\nYou can also check out full-resolution versions of these camera samples and several more at this Google Drive link.\n…but I do like One UI 7!\nDespite everything that’s let me down about the Galaxy S25 Edge, there’s one bright spot to the phone that didn’t used to be one. For a long time, I ranked Samsung’s One UI as one of my least favorite Android skins, complaining that it’s too cluttered and forces me through too many menus to get my phone feeling just right. I begged to spend time in Pixel UI or on Nothing OS, only dipping back into One UI for major updates or while writing a review. Now, though, I feel at least a little bit more at home, and will probably like it even better once I get to try a stable build of One UI 8.\nFor starters, Samsung has simplified its customization options — or at least made them look better. It’s improved the color-matched theme options, added the ability to resize and reshape your widgets to break up the traditional home screen grid, and cooked up a little thing called DIY Home. Personally, I don’t think I could ever use the wide-open chaos of DIY Home, which allows you to put apps anywhere on your home screen and overlap them with stickers and doodles, but I respect what Samsung is going for. I’ve seen a few very creative layouts floated across the One UI subreddit, and I would steal them if I didn’t have to recreate them by hand.\nDIY Home is chaos, but I like that Samsung is embracing its wild side.\nThe Now Bar is also an essential part of One UI 7, and one of the better Dynamic Island clones I’ve ever used. It’s not exactly like Apple’s implementation in that it’s invisible most of the time, but I appreciate that it pops up with timely notifications on my lock screen before shuffling off to the top right corner when I open my phone. I’ve used it for everything from stacking an endless rotation of kitchen timers to monitoring the Europa League final so that I didn’t have to watch Tottenham take on Manchester United — a pairing that would have put me to sleep by halftime. I’m less sold on Samsung’s Now Brief, which updates you on the weather, upcoming events, and news headlines every few hours, but only because I already get those things from the widgets on my home screen.\nThis is also where I should take a second to acknowledge Galaxy AI. There’s not much new on this front, at least not if you read our Galaxy S25 reviews, but the overall experience keeps getting smoother. I’ve started to find more and more uses for things like Photo Assist and its generative edits, and I’m glad that Drawing Assist finally feels more like an image generator than the original Portrait Studio. Samsung’s Call Assist and Chat Assist are pretty good, too, now that they have built-in translation features that make it easier to tolerate my younger brother when he busts out one of the many languages he studied in college. I’m not sold on everything yet — you won’t find me using Writing Assist to punch up paragraphs when I already wordsmith for a living, but who knows, even that might change over the impressive seven years of updates that the Edge is due.\nSamsung Galaxy S25 Edge review verdict: Who’s buying this?\nWhen I started this review, I wondered which side of the innovation line the Galaxy S25 Edge would fall on. I pondered whether it would feel like a stroke of genius, beating Apple to the ultra-thin punch and becoming one of the best Android phones, or if it would feel more like LG’s famous (or infamous) Wing — a bold idea that didn’t work how we’d hoped. Now, after about two weeks with the phone, I have my answer: I hope the Galaxy S25 Edge is a one-and-done.\nI know, I know, that sounds dramatic. In fact, in a vacuum, the Galaxy S25 Edge probably does everything Samsung hoped for. It’s powerful in small doses, feels durable to carry through a busy day, and is about as slim as my mind can comprehend. If those were the only criteria I had to grade it on, it would pass with flying colors. I would even be willing to give it some of the same grace that I give flip phones, acknowledging their hardware limitations without giving them a total pass.\nThe Galaxy S25 Edge banks on being thin, but that's not enough of a reason for me to recommend it.\nMost of the time, the Galaxy S25 Edge is even more limited than a Galaxy Z Flip 6 ($1099.99 at Samsung). Yes, they’re both ambitious form factors, and yes, they both have just two rear cameras compared to Samsung’s usual three, but that feels more like a perk of the Flip and a drawback of the Edge. See, I like the fact that I can grab Samsung’s most recent flip phone, slip it into my pocket, and go about my day. When I need to check on something, I can usually do it from the power-sipping Flex Window, which helps ease my inevitable battery anxiety. I can let the two rear cameras do more than their usual workload, doubling as high-resolution selfie shooters with reliable wide and ultrawide fields of view. I can even tap into most of the Galaxy AI features I’ve come to rely on, all without ever unfolding the hinge.\nHowever, when I need to check something on the Galaxy S25 Edge, I may as well check it on the Galaxy S25 Plus ($999.99 at Amazon). I have to pull the big 6.7-inch slab out of my pocket, fire up its entire display, and hope that I’m done before the battery starts to tick away too quickly. And, if I’m doing all that, I may as well do it on the Galaxy S25 Plus itself since the battery life is better, the charging is faster, and the cameras are more flexible thanks to the 10MP telephoto sensor. On top of it all, the Galaxy S25 Plus is cheaper — and if you don’t care about the latest chip, the very similar Galaxy S24 Plus is likely available for even less on sale.\nHonestly, for the money, I think I’d even take Samsung’s smaller Galaxy S25 ($809.99 at Amazon) over the Edge. No, that phone might not be as technically impressive — if we’re still going to give being thin that much credit — but it once again comes out ahead on battery life and camera flexibility. It’s also quite a bit cheaper than the Edge, and I think its more traditional cooling setup gives me hope that it’ll age better than the twice-as-bright, half-as-long Edge might. If you want to spend a little more money, Samsung’s Galaxy S25 Ultra ($1299.99 at Amazon) is probably its best flagship phone to date, even though the design remains a bit played out. It has all of the camera flexibility that the Edge lacks, and the S Pen is a go-to for power users, even if it’s been simplified to little more than a basic stylus.\nLooking outside the Samsung bubble, I think most of the Edge’s rivals offer better bang for about the same number of bucks, too. Google’s Pixel 9 Pro XL ($1099 at Amazon) and Apple’s iPhone 16 Pro ($999 at Amazon) or Pro Max ($1199 at Amazon) won’t be as thin or as light, and they’ll offer differing slates of AI-powered features, but they have many of the same strengths as the other Galaxy S25 options. In Google’s case, we continue to fall in love with its clever camera tricks, prompt software updates, and the fact that its hardware has improved by leaps and bounds over the previous generation. The Pro Pixels also charge faster than the Galaxy S25 Edge and have bigger batteries, so even though the Tensor G4 still tends to run warm, it still manages to counteract most of my battery anxiety.\nThin phone obsession isn't going anywhere, but I hope the next generation doesn't require quite so many crucial sacrifices.\nI also want to throw the OnePlus 13 ($899.99 at OnePlus) out as a competitor. Where Samsung decided to make cuts to make its Galaxy S25 Edge as slim as possible, OnePlus chose to pack its latest flagship with more and more. It has sharper, more flexible cameras that zoom to 120x, and the Hasselblad color profile is among my favorites. OnePlus earns points for its massive 6,000mAh battery and 80W wired charging, too, along with 50W wireless charging and a cool new magnetic charger that works with compatible cases. It’s not quite the same as Qi2, but it’s a step in the right direction.\nDespite my vain hopes that the Edge will be a one-off, it’s pretty clear the thin phone obsession isn’t going anywhere. With the long-rumored iPhone 17 Air on the way and various concepts in the works at other Android OEMs, the S25 Edge is the dawn of a new form factor for larger display smartphones (we’ve seen plenty of thin phones before, after all). I just hope the next generation doesn’t require quite so many crucial sacrifices for the sake of the undeniable wow factor.\n- Incredibly slim design\n- Impressively lightweight\n- Great materials\n- Improved One UI experience\n- Solid primary cameras\n- Poor thermals\n- Mediocre battery life\n- No telephoto camera\n- Slow wired charging\nThank you for being part of our community. Read our Comment Policy before posting."
    }
  ],
  "argos_summary": "Samsung’s Galaxy S26 Edge battery capacity has been confirmed by a 3C certification listing, showing a rated 4,078 mAh cell that will be marketed as 4,200 mAh. The leak confirms a modest upgrade over the 3,900 mAh S25 Edge, but falls short of the 4,400 mAh figure floated by some rumors. Samsung remains committed to lithium‑ion chemistry rather than silicon‑carbon, and the new battery will fit into the 5.5 mm ultra‑thin chassis expected for the S26 Edge. The certification also signals Samsung’s intent to address battery‑life complaints while keeping the device’s slim profile.",
  "argos_id": "KUKFX49SE"
}