{
  "url": "https://www.fastcompany.com/91387375/iphone-17-price-trump-tariff-apple-plus-pro-max-cost",
  "authorsByline": "Michael Grothaus",
  "articleId": "d19d09f046a44347b561284d83a6b934",
  "source": {
    "domain": "fastcompany.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://images.fastcompany.com/image/upload/f_webp,q_auto,c_fit,w_1024,h_1024/wp-cms-2/2025/08/p-1-91387375-Tech-Will-Trumps-tariffs-mean-you-pay-more-for-the-iPhone-17-next-month-.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-30T09:00:00+00:00",
  "addDate": "2025-08-30T09:12:41.063245+00:00",
  "refreshDate": "2025-08-30T09:12:41.063246+00:00",
  "score": 1.0,
  "title": "Do Trump’s tariffs mean you'll pay more for the iPhone 17 next month?",
  "description": "iPhone 17 models will almost certainly cost more due to the tariffs Trump has put in place. How much more? Here are two likely scenarios.",
  "content": "But economic uncertainty isn’t the only thing rising. Prices of consumer goods, especially those manufactured in some of the highest-tariffed countries, including China, Vietnam, and India, are up, or are likely to be before the end of the year. And that’s bad news for iPhone fans because Apple manufactures a majority of its most popular devices—or at least the components that go into them—in those countries. Will the new iPhone 17 models that Apple is on track to debut next month cost more due to Trump’s tariffs? Unfortunately, the answer is likely a big “yep”—though some uncertainty remains. Based on what we know today, here’s how much you could be paying for your next iPhone 17. How much could a tariffed iPhone 17 cost? It’s important to note that just because there is a 30%, 40%, or even 50% tariff on goods from select countries, it doesn’t mean that consumer items shipped in from those countries will automatically be 30%, 40%, or 50% more expensive. This is because large companies often have some leverage in reducing the impact of tariffs on their bottom lines. Yes, they can, and often will, pass some of the tariff costs onto their customers. But they can also reduce some tariff costs in other ways.\n\nI’ve previously written about how Apple is likely to do this, including by pressuring its suppliers in tariff-affected countries to absorb some of the costs themselves (by lowering the rates they charge Apple). Why would the suppliers agree to it? Apple is one of their biggest customers and is likely to remain so long after Trump leaves office. Therefore, it’s better to keep Apple happy by taking a short-term financial hit. Yet it’s still very likely that Apple will also raise prices on consumers for its iPhone 17 family this year. By how much? Well, that depends on which of two likely scenarios play out. First, here’s what consumers in the United States currently pay for the base storage model of iPhone 16:\n\nAnd here are the two ways it might go. This scenario is floated by Jefferies analyst Edison Lee (via 9to5Mac), who expects that Apple will raise the price of most iPhone 17 models by $50. The entry-level iPhone 17 would be spared a price increase, while the other models would all see a $50 bump. If that’s accurate, then these are the starting prices that you’ll be paying for the iPhone 17 family next month:\n\nHowever, there’s an alternative scenario making the rounds, too. In this one, Apple will keep the “regular” iPhone 17 models at the same price as their iPhone 16 counterparts, and only raise the prices of its Pro models. If this is accurate, then here’s what you can expect to pay for the iPhone 17 family next month: If I had to choose between the two scenarios, I’d predict that Apple will opt for the first scenario, meaning that the company will only spare the “regular” iPhone 17 model a price increase.\n\nConsumers who buy the iPhone Pro models are usually willing to spend more for better tech. In other words, these consumers prioritize capabilities over costs. They probably wouldn’t balk at an increase of $50 as much as “regular” consumers would—and Apple likely knows that. A user known as Instant Digital on the Chinese social media network Weibo also claims that Apple will increase the base storage of its iPhone 17 Pro model from 128GB to 256GB. If this happens, Apple could argue that the iPhone 17 Pro consumer is actually getting more for less. Currently, an iPhone 16 Pro with an option of 256GB of storage costs $1,099—$50 more than the 256GB iPhone 17 Pro is likely to cost. As for the new, supposedly “thinnest ever” iPhone, the 17 Air/Slim, which will reportedly replace the iPhone 16 Plus, I can see Apple bumping its originally planned price up by $50, too. Most consumers probably wouldn’t even notice the price point shift for the device, considering that they will likely view the iPhone 17 Slim/Air (or whatever its final name will be) as a new device entirely.\n\nWhat about the “budget” iPhone 17e? You’ll notice that the “budget” iPhone 17e is absent from the lists above. This is because Apple is not expected to introduce the iPhone 17e until next Spring. The budget iPhone 16e only came out in February, and it seems reasonable to assume that its price will likely remain the same. (Though starting at $599, the iPhone 16e can barely be considered a true “budget” phone already). As for whether Apple will blame its iPhone 17 price rises on President Trump’s tariffs . . . don’t bet on it. Doing so would likely be tantamount to tariff suicide for the company. As I’ve written before, Apple CEO Tim Cook is one of the most adept chief executives in America when it comes to dealing with Trump. His good relationship with and handling of the president have helped the company navigate extremely rough economic waters.\n\nIf Apple were now to outright blame its iPhone price increases on Trump’s tariffs, it would likely lead to—at best—a strained relationship with the president and, more likely, the possible elimination of some of the tariff exemptions Apple and other tech giants have managed to finagle. I mean, look at how well the proposed tariff cost labels went for Amazon. In other words, you will likely be paying more for at least some iPhone 17 models next month. You can blame Trump if you want—but Apple won’t.",
  "medium": "Article",
  "links": [
    "https://www.fastcompany.com/91328987/iphone-apple-change-release-schedule-company-fall-spring-pro-calendar-china-labor",
    "https://www.fastcompany.com/91386050/layoffs-2025-companies-have-announced-over-800000-jobs-cuts-so-far-there-are-3-big-reasons-why",
    "https://www.fastcompany.com/91307955/what-is-liberation-day-april-2-trump-reciprocal-tariffs-roil-economy-what-it-means",
    "https://www.fastcompany.com/91281261/the-iphone-16e-is-here-here-are-5-ways-its-different-from-the-iphone-se",
    "https://www.cnbc.com/2025/08/13/nvidia-amd-and-apple-big-tech-is-paying-its-way-out-of-trump-tariffs.html#:~:text=Apple,%20which%20relies%20on%20hundreds,exempt%20from%20the%20proposed%20tariffs.",
    "https://www.cnbc.com/2025/08/01/trumps-tariffs-rekindle-global-trade-tensions.html",
    "https://www.fastcompany.com/91319020/apple-needs-tim-cook-trump-steve-jobs-tarriffs-supply-chain-ceo-succession",
    "https://www.fastcompany.com/apply/most-innovative-companies",
    "https://weibo.com/5143897135/PFCi1stYT",
    "https://www.fastcompany.com/91312841/how-much-iphone-cost-trump-tariff-apple-china-vietnam-india-sales-business-model",
    "https://www.bloomberg.com/news/articles/2025-04-29/us-consumer-confidence-slumps-to-an-almost-five-year-low",
    "https://9to5mac.com/2025/07/30/apple-will-increase-iphone-17-prices-by-50-with-one-exception-says-analyst/",
    "https://www.fastcompany.com/91325345/trump-amazon-proposal-to-label-tariff-costs"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "iPhone Pro",
      "weight": 0.111627005
    },
    {
      "name": "iPhone",
      "weight": 0.106396794
    },
    {
      "name": "iPhone 16e",
      "weight": 0.10529111
    },
    {
      "name": "iPhone fans",
      "weight": 0.10385577
    },
    {
      "name": "Apple",
      "weight": 0.09402281
    },
    {
      "name": "Apple CEO Tim Cook",
      "weight": 0.08592948
    },
    {
      "name": "tariffs",
      "weight": 0.07952567
    },
    {
      "name": "tariff suicide",
      "weight": 0.078646824
    },
    {
      "name": "Prices",
      "weight": 0.074864164
    },
    {
      "name": "prices",
      "weight": 0.074864164
    }
  ],
  "topics": [
    {
      "name": "iPhone"
    },
    {
      "name": "Electronics"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    },
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Technology News",
      "score": 0.81396484375
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.78662109375
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.76318359375
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.7451171875
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.712890625
    },
    {
      "name": "/People & Society/Social Sciences/Political Science",
      "score": 0.417724609375
    },
    {
      "name": "/Business & Industrial/Shipping & Logistics/Import & Export",
      "score": 0.33447265625
    }
  ],
  "sentiment": {
    "positive": 0.29590055,
    "negative": 0.20050982,
    "neutral": 0.50358963
  },
  "summary": "Will the new iPhone 17 models that Apple is set to debut next month will cost more due to President Trump's tariffs, particularly those manufactured in countries such as China, Vietnam, and India, are likely to increase. This is bad news for iPhone fans as Apple manufactures a majority of its most popular devices in these countries. However, large companies often have leverage in reducing the impact of tariffs on their bottom lines, including Apple's suppliers in tariff-affected countries. While large companies can pass some of the tariff costs onto their customers, they can reduce these costs in other ways. This raises the possibility of Apple raising prices on consumers for its iPhone 17 family this year by $50 or $50, depending on which scenario plays out. The entry-level iPhone 17 model would be spared a price increase, while the other models would all see a $50 bump. The base storage of the iPhone 17 Pro model is also expected to increase from 128GB to 256GB. The new, supposedly “thinnest ever” iPhone 17 Air/Slim, which will replace the iPhone 16, is expected to cost $50 and is likely to be replaced by the new “budget” phone, which is not expected to launch until Spring.",
  "shortSummary": "President Trump's tariffs are expected to push up consumer goods prices, potentially leading to higher prices for the iPhone 17 family.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "bab013985aec47f895d6eba2686f1f05",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://9to5mac.com/2025/07/30/apple-will-increase-iphone-17-prices-by-50-with-one-exception-says-analyst/",
      "text": "A new analyst report suggests that Apple will increase prices for three iPhone 17 models, when compared to iPhone 16 pricing.\nThe report suggests two reasons for the increase, and indicates that the price of the base model will remain unchanged, with a starting price of $799 …\niPhone 17 prices\nIt’s been widely speculated that Apple will increase prices for this year’s iPhones, in order to cover the costs of US tariffs imposed on products manufactured in China.\nThe exact impact on the company’s finances is unknown – while Trump’s tariffs add 20% to Apple’s costs for Chinese-made iPhones, the company is aiming to meet as much US demand as possible with phones made in India. This is unlikely to meet total US launch demand, however, so there will be some cost increase for the company.\nApple initially chose to absorb these extra costs, taking a $900M hit in Q2, but is expected to pass on at least some of the costs to consumers in future.\nAnalyst says $50 raise for three models\nI said back in May that my best guess was a $50 price raise, and an analyst has today echoed this – though suggested that the base model will escape.\nJefferies analyst Edison Lee maintained a Hold rating and $188.32 price target on Apple […] Jefferies expects a $50 price increase for iPhone 17 Slim/P/PM models to offset rising component costs and China tariffs.\nIf accurate, this year’s starting prices would be:\n- iPhone 17: $799\n- iPhone 17 Pro: $1,049\n- iPhone 17 Pro Max: $1,249\n- iPhone 17 Air: Unknown\nIt’s not known what basic of comparison Jefferies is using for the iPhone 17 Air, as this will be a completely new model, but it likely means the company is adding $50 to the price initially planned.\nTop comment by MaxM\nPeople expected expectations to remain stagnant or even decline further (after the C1 chip). But what's the reality? Apple's market share is likely to continue to decline in China, as is currently the case, and this trend is likely to continue in other countries as well. In India, too, there's a growing preference for domestically produced brands, and like a second China, they too will likely favor domestic products in a few years. Apple hopes to remain price competitive.\nThe report was tweeted by the Walter Bloomberg account. While not associated with Bloomberg, the account usually posts headlines from Bloomberg Terminal before the news hits the paper’s main website.\n9to5Mac’s Take\nThis would not be unexpected. Apple is very protective of its margins, and seemed unlikely to want to continue to absorb the additional costs indefinitely.\nHowever, it remains to be seen what impact it might have to take the Pro model over the psychological $1,000 barrier.\nHighlighted accessories\n- Official Apple Store on Amazon\n- Anker 511 Nano Pro ultra-compact iPhone charger\n- Spigen MagFit case for iPhone 16e – adds MagSafe support\n- Apple MagSafe Charger with 25w power for iPhone 16 models\n- Apple 30W charger for above\n- Anker 240W braided USB-C to USB-C cable\nFTC: We use income earning auto affiliate links. More.\nComments"
    },
    {
      "url": "https://www.cnbc.com/2025/08/13/nvidia-amd-and-apple-big-tech-is-paying-its-way-out-of-trump-tariffs.html#:~:text=Apple,%20which%20relies%20on%20hundreds,exempt%20from%20the%20proposed%20tariffs.",
      "text": "Top tech executives are at the forefront of a recent swathe of unprecedented deals with U.S. President Donald Trump.\nIn just the last few days, the White House confirmed that two U.S. chipmakers, Nvidia and Advanced Micro Devices, would be allowed to sell advanced chips to China in exchange for the U.S. government receiving a 15% cut of their revenues in the Asian country.\nApple CEO Tim Cook, meanwhile, recently announced plans to increase the firm's U.S. investment commitment to $600 billion over the next four years. The move was widely seen as a bid to get the tech giant out of Trump's crosshairs on tariffs — and appears to have worked for now.\nAltogether, analysts say the deals show just how important it is for the world's largest companies to find some tariff relief.\n\"The flurry of deal-making is an effort to secure lighter treatment from tariffs,\" Paolo Pescatore, technology analyst at PP Foresight, told CNBC by email.\n\"In some shape or form, all of the big tech companies have been negatively impacted by tariffs. They can ill afford to fork out on millions of dollars in additional fees that will further dent profits as underlined by recent quarterly earnings,\" Pescatore said.\nWhile the devil will be in the detail of these agreements, Pescatore said that Apple leading the way with its accelerated U.S. investment will likely trigger \"a domino effect\" within the industry.\nRead more\nApple, for its part, has long been regarded as one of the Big Tech firms most vulnerable to simmering trade tensions between the U.S. and China.\nEarlier this month, Trump announced plans to impose a 100% tariff on imports of semiconductors and chips, albeit with an exemption for firms that are \"building in the United States.\"\nApple, which relies on hundreds of different chips for its devices and incurred $800 million in tariff costs in the June quarter, is among the firms exempt from the proposed tariffs.\nA 'bizarre' deal\nThe Nvidia and AMD deal with the Trump administration has meanwhile sparked intense debate over the potential impact on the chip giants' businesses and whether the U.S. government may seek out similar agreements with other firms.\nSome strategists described the arrangement as a \"shakedown,\" while others suggested it may even be unconstitutional and comparing it to a tax on exports.\nWhite House spokesperson Karoline Leavitt said Tuesday that the legality and mechanics of the 15% export tax on Nvidia and AMD were \"still being ironed out.\" She also hinted deals of this kind could expand to other companies in future.\nRay Wang, founder and chairman of Constellation Research, described the Nvidia and AMD deal to pay 15% of China chip sales revenues to the U.S. government as \"bizarre.\"\nSpeaking on CNBC's \"Squawk Box\" on Monday, Wang said what is \"really weird\" is there is still some uncertainty over whether these chips represent a national security issue.\n\"If the answer is no, fine OK. The government is taking a cut out of it,\" Wang said. \"Both Nvidia's Jensen Huang and Lisa Su at AMD both decided that OK, we've got a way to get our chips into China and maybe there is something good coming out of it.\"\nInvestor concerns\nWhile investors initially welcomed the deal as broadly positive for both Nvidia and AMD, which once more secure access to the Chinese market, Wang said some in the industry will nevertheless be concerned.\n\"As an investor, you're worried because then, is this an arbitrary decision by the government? Does every president get to play kingmaker in terms of these deals?\" Wang said.\n\"So, I think that's really what the concern is, and we still have additional tariffs and trade deals to come from the China negotiations,\" he added.\nLooking ahead, Dan Niles, founder and portfolio manager at Niles Investment Management, said the question for investors is whether the Trump administration's \"hands-on\" approach is positive or negative for U.S. companies.\n\"I think for each company, it is very different. So, it certainly it is something I take into account. The bigger thing for me is do you have some stability of policy? Do you have a policy one week and then it flips the next?\" Niles told CNBC's \"Closing Bell: Overtime\" on Monday. \"Right now, that is what concerns me a little bit more.\"\n— CNBC's Arjun Kharpal and Kif Leswing contributed to this report."
    },
    {
      "url": "https://www.cnbc.com/2025/08/01/trumps-tariffs-rekindle-global-trade-tensions.html",
      "text": "What you need to know\n- President Donald Trump signed an executive order that adjusted so-called \"reciprocal\" tariffs on a slew of countries, with new levies ranging from 10% to 41%.\n- Trump told NBC News in a phone interview that he was open to more compelling offers, but it was \"too late\" for some nations to avoid duties as of next week.\n- World leaders have been reacting to the developments.\n- A weak jobs report is raising pressure on the White House to blunt potential negative impacts of tariffs.\n- Canada, Brazil and Switzerland were hit especially hard with higher rates. Lesotho, Madagascar and the Falkland Islands appear to have gotten a reprieve from previously threatened hikes.\nCNBC's reporters covered the tariffs and their impact, on-air and online from our bureaus in Washington; London; Singapore; San Francisco; and Englewood Cliffs, New Jersey."
    }
  ],
  "argos_summary": "Apple is likely to raise iPhone 17 prices by about $50 on most models to offset U.S. tariffs on components from China, Vietnam, and India, though the base model may remain unchanged. Analysts predict a $50 bump for Pro and higher‑end variants, while suppliers may absorb some costs to keep Apple competitive. The move follows broader U.S. trade tensions, including recent deals with Nvidia and AMD to mitigate tariff impacts. Apple’s strategy aims to balance margin protection with consumer price sensitivity amid ongoing tariff uncertainty.",
  "argos_id": "LITR2IQEW"
}