{
  "url": "https://finance.yahoo.com/news/estimating-fair-value-everyman-media-063511259.html",
  "authorsByline": "Simply Wall St",
  "articleId": "92b2a569dba24fc9825882459cccdc8b",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/simply_wall_st__316/fbcb1fb47846c704491b7cdca16e4528",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-01T06:35:11+00:00",
  "addDate": "2025-09-01T07:06:07.005424+00:00",
  "refreshDate": "2025-09-01T07:06:07.005427+00:00",
  "score": 1.0,
  "title": "Estimating The Fair Value Of Everyman Media Group plc (LON:EMAN)",
  "description": "Key Insights Using the 2 Stage Free Cash Flow to Equity, Everyman Media Group fair value estimate is UK£0.48 With...",
  "content": "• Using the 2 Stage Free Cash Flow to Equity, Everyman Media Group fair value estimate is UK£0.48\n• With UK£0.42 share price, Everyman Media Group appears to be trading close to its estimated fair value\n• The average premium for Everyman Media Group's competitorsis currently 1,276% Today we will run through one way of estimating the intrinsic value of Everyman Media Group plc (LON:EMAN) by taking the forecast future cash flows of the company and discounting them back to today's value. This will be done using the Discounted Cash Flow (DCF) model. There's really not all that much to it, even though it might appear quite complex. Companies can be valued in a lot of ways, so we would point out that a DCF is not perfect for every situation. For those who are keen learners of equity analysis, the Simply Wall St analysis model here may be something of interest to you. We've found 21 US stocks that are forecast to pay a dividend yield of over 6% next year. See the full list for free. We use what is known as a 2-stage model, which simply means we have two different periods of growth rates for the company's cash flows. Generally the first stage is higher growth, and the second stage is a lower growth phase. To start off with, we need to estimate the next ten years of cash flows. Where possible we use analyst estimates, but when these aren't available we extrapolate the previous free cash flow (FCF) from the last estimate or reported value. We assume companies with shrinking free cash flow will slow their rate of shrinkage, and that companies with growing free cash flow will see their growth rate slow, over this period. We do this to reflect that growth tends to slow more in the early years than it does in later years. Generally we assume that a dollar today is more valuable than a dollar in the future, so we need to discount the sum of these future cash flows to arrive at a present value estimate: (\"Est\" = FCF growth rate estimated by Simply Wall St)\n\nPresent Value of 10-year Cash Flow (PVCF) = UK£21m We now need to calculate the Terminal Value, which accounts for all the future cash flows after this ten year period. For a number of reasons a very conservative growth rate is used that cannot exceed that of a country's GDP growth. In this case we have used the 5-year average of the 10-year government bond yield (2.7%) to estimate future growth. In the same way as with the 10-year 'growth' period, we discount future cash flows to today's value, using a cost of equity of 13%.\n\nPresent Value of Terminal Value (PVTV)= TV / (1 + r)10= UK£77m÷ ( 1 + 13%)10= UK£23m The total value, or equity value, is then the sum of the present value of the future cash flows, which in this case is UK£44m. The last step is to then divide the equity value by the number of shares outstanding. Relative to the current share price of UK£0.4, the company appears about fair value at a 13% discount to where the stock price trades currently. The assumptions in any calculation have a big impact on the valuation, so it is better to view this as a rough estimate, not precise down to the last cent. The calculation above is very dependent on two assumptions. The first is the discount rate and the other is the cash flows. If you don't agree with these result, have a go at the calculation yourself and play with the assumptions. The DCF also does not consider the possible cyclicality of an industry, or a company's future capital requirements, so it does not give a full picture of a company's potential performance. Given that we are looking at Everyman Media Group as potential shareholders, the cost of equity is used as the discount rate, rather than the cost of capital (or weighted average cost of capital, WACC) which accounts for debt. In this calculation we've used 13%, which is based on a levered beta of 2.000. Beta is a measure of a stock's volatility, compared to the market as a whole. We get our beta from the industry average beta of globally comparable companies, with an imposed limit between 0.8 and 2.0, which is a reasonable range for a stable business. Check out our latest analysis for Everyman Media Group Although the valuation of a company is important, it ideally won't be the sole piece of analysis you scrutinize for a company. It's not possible to obtain a foolproof valuation with a DCF model. Rather it should be seen as a guide to \"what assumptions need to be true for this stock to be under/overvalued?\" For example, changes in the company's cost of equity or the risk free rate can significantly impact the valuation. For Everyman Media Group, there are three essential elements you should explore:\n• Risks: For instance, we've identified 2 warning signs for Everyman Media Group that you should be aware of.\n• Future Earnings: How does EMAN's growth rate compare to its peers and the wider market? Dig deeper into the analyst consensus number for the upcoming years by interacting with our free analyst growth expectation chart.\n• Other Solid Businesses: Low debt, high returns on equity and good past performance are fundamental to a strong business. Why not explore our interactive list of stocks with solid business fundamentals to see if there are other companies you may not have considered! PS. The Simply Wall St app conducts a discounted cash flow valuation for every stock on the AIM every day. If you want to find the calculation for other stocks just search here. Have feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\n\n\n\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.",
  "medium": "Article",
  "links": [
    "https://github.com/SimplyWallSt/Company-Analysis-Model/blob/master/MODEL.markdown#discounted-cash-flow-dcf",
    "https://simplywall.st/company/id/032D6C85-5043-494D-B961-B084FE201533?blueprint=4031524&utm_medium=finance_user&utm_campaign=cta&utm_source=yahoo",
    "https://au.finance.yahoo.com/quote/EMAN.L",
    "https://simplywall.st/company/id/032D6C85-5043-494D-B961-B084FE201533?blueprint=4031524&utm_medium=finance_user&utm_campaign=conclusion&utm_source=yahoo",
    "https://simplywall.st/discover/investing-ideas/434616/us-dividend-powerhouses-with-a-forecast-yield-of-6percent/global?blueprint=4031524&utm_medium=finance_user&utm_campaign=investing-ideas&utm_source=yahoo&utm_content=dividend-forecast-yield-6pcnt",
    "https://simplywall.st/company/id/032D6C85-5043-494D-B961-B084FE201533/future?blueprint=4031524&utm_medium=finance_user&utm_campaign=conclusion&utm_source=yahoo",
    "https://simplywall.st/company/id/032D6C85-5043-494D-B961-B084FE201533/valuation?blueprint=4031524&utm_medium=finance_user&utm_campaign=cta&utm_source=yahoo",
    "https://simplywall.st/discover/investing-ideas/10146/solid-balance-sheet-and-fundamentals/global?blueprint=4031524&utm_medium=finance_user&utm_campaign=conclusion-grid&utm_source=yahoo",
    "https://simplywall.st/discover/investing-ideas/157/popular-view?blueprint=4031524&utm_medium=finance_user&utm_campaign=conclusion-grid&utm_source=yahoo",
    "https://simplywall.st/company/id/032D6C85-5043-494D-B961-B084FE201533/valuation?blueprint=4031524&amp;utm_medium=finance_user&amp;utm_campaign=infographic&amp;utm_source=yahoo"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "future cash flows",
      "weight": 0.095876925
    },
    {
      "name": "Everyman Media Group fair value estimate",
      "weight": 0.093222305
    },
    {
      "name": "cash flows",
      "weight": 0.09075885
    },
    {
      "name": "growing free cash flow",
      "weight": 0.09031211
    },
    {
      "name": "shrinking free cash flow",
      "weight": 0.09008109
    },
    {
      "name": "Everyman Media Group",
      "weight": 0.08993664
    },
    {
      "name": "Everyman Media Group plc",
      "weight": 0.08650693
    },
    {
      "name": "growth rates",
      "weight": 0.08487951
    },
    {
      "name": "future growth",
      "weight": 0.081130214
    },
    {
      "name": "equity value",
      "weight": 0.0804851
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.9951171875
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.9921875
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.990234375
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.7841796875
    }
  ],
  "sentiment": {
    "positive": 0.13145576,
    "negative": 0.3155,
    "neutral": 0.5530442
  },
  "summary": "The article discusses the process of estimating the intrinsic value of Everyman Media Group plc (LON:EMAN) using the Discounted Cash Flow (DCF) model. This method involves discounting forecast future cash flows back to today's value and extrapolating the previous free cash flow (FCF) from the last estimate or reported value. We use a 2-stage model, which involves two periods of growth rates for the company's cash flows. The Terminal Value accounts for all future cash flow after this ten year period using a conservative growth rate. The total value, or equity value, is then divided by the number of shares outstanding. Despite this, the company appears about fair value at a 13% discount to where the stock price trades currently.",
  "shortSummary": "Everyman Media Group's fair value is estimated by using the 2 Stage Free Cash Flow to Equity model, based on forecasts of future cash flows, with a 13% discount compared to current share prices.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "646616426f904338ad12efd1727765a5",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://simplywall.st/discover/investing-ideas/434616/us-dividend-powerhouses-with-a-forecast-yield-of-6percent/global?blueprint=4031524&utm_medium=finance_user&utm_campaign=investing-ideas&utm_source=yahoo&utm_content=dividend-forecast-yield-6pcnt",
      "text": "Results\n19\nThese stocks are forecast to deliver over a 6% dividend yield next year. Their dividend payments are well covered by cash flows and they have been growing steadily. Perfect for income-focused investors seeking robust returns.\n19 companies\nOmega Healthcare Investors\nMarket Cap: US$13.0b\nA Real Estate Investment Trust (“REIT”) providing financing and capital to the long-term healthcare industry with a focus on skilled nursing and assisted living facilities located in the United States and the United Kingdom.\nOHI\nUS$42.57\n7D\n1.3%\n1Y\n7.7%\nVerizon Communications\nMarket Cap: US$186.5b\nThrough its subsidiaries, engages in the provision of communications, technology, information, and entertainment products and services to consumers, businesses, and governmental entities worldwide.\nVZ\nUS$44.23\n7D\n-0.5%\n1Y\n5.9%\nBanco Latinoamericano de Comercio Exterior S. A\nMarket Cap: US$1.7b\nBanco Latinoamericano de Comercio Exterior, S.\nBLX\nUS$46.13\n7D\n0.9%\n1Y\n47.1%\nConagra Brands\nMarket Cap: US$9.2b\nOperates as a consumer packaged goods food company primarily in the United States.\nCAG\nUS$19.13\n7D\n-2.7%\n1Y\n-38.7%\nBrookline Bancorp\nMarket Cap: US$975.7m\nOperates as a bank holding company for the Brookline Bank that provides commercial, business, and retail banking products and services to corporate, municipal, and retail customers in the United States.\nBRKL\nUS$10.95\n7D\n-1.9%\n1Y\n7.0%\nFlowers Foods\nMarket Cap: US$3.2b\nProduces and markets packaged bakery food products in the United States.\nFLO\nUS$15.04\n7D\n-1.6%\n1Y\n-35.3%\nArtisan Partners Asset Management\nMarket Cap: US$3.8b\nArtisan Partners Asset Management Inc. is publicly owned investment manager.\nAPAM\nUS$46.79\n7D\n0.7%\n1Y\n12.5%\nXP\nMarket Cap: US$9.6b\nProvides financial products and services in Brazil.\nXP\nUS$18.14\n7D\n10.2%\n1Y\n-1.5%\nTFS Financial\nMarket Cap: US$3.9b\nThrough its subsidiaries, provides retail consumer banking services in the United States.\nTFSL\nUS$14.06\n7D\n1.2%\n1Y\n3.5%\nUnited Parcel Service\nMarket Cap: US$74.1b\nA package delivery and logistics provider, offers transportation and delivery services.\nUPS\nUS$87.44\n7D\n-0.3%\n1Y\n-32.0%\nBuckle\nMarket Cap: US$2.8b\nOperates as a retailer of casual apparel, footwear, and accessories for men, women, and kids under the Buckle and Buckle Youth brands in the United States.\nBKE\nUS$56.59\n7D\n0.7%\n1Y\n35.1%\nCricut\nMarket Cap: US$1.2b\nEngages in the design, marketing, and distribution of a creativity platform that enables users to turn ideas into professional-looking handmade goods in the United States, Canada, the United Kingdom, Ireland, Australia, New Zealand, Western Europe, the Middle East, Latin America, South Africa, and Asia.\nCRCT\nUS$5.70\n7D\n-3.2%\n1Y\n-1.4%\nGlobal Ship Lease\nMarket Cap: US$1.1b\nEngages in owning and chartering of containerships under fixed-rate charters to container shipping companies worldwide.\nGSL\nUS$30.05\n7D\n1.6%\n1Y\n19.8%\nMacy's\nMarket Cap: US$3.6b\nAn omni-channel retail organization, operates stores, websites, and mobile applications in the United States.\nM\nUS$13.23\n7D\n-0.3%\n1Y\n-15.0%\nOxford Industries\nMarket Cap: US$657.9m\nAn apparel company, designs, sources, markets, and distributes lifestyle products worldwide.\nOXM\nUS$44.05\n7D\n-3.9%\n1Y\n-49.4%\nMarketWise\nMarket Cap: US$294.0m\nOperates a content and technology multi-brand platform for self-directed investors in the United States and Internationally.\nMKTW\nUS$17.96\n7D\n0.4%\n1Y\n13.5%\nMarket Cap: US$2.8b\nThrough its subsidiaries, operates as a social media platform for people to create, discover, and distribute content in the People’s Republic of China.\nWB\nUS$11.46\n7D\n-0.8%\n1Y\n53.2%\nSila Realty Trust\nMarket Cap: US$1.4b\nSila Realty Trust, Inc., headquartered in Tampa, Florida, is a net lease real estate investment trust with a strategic focus on investing in the growing and resilient healthcare sector.\nSILA\nUS$24.94\n7D\n0.8%\n1Y\n5.6%\nQfin Holdings\nMarket Cap: US$3.9b\nQfin Holdings, Inc., together with its subsidiaries, operate AI- driven credit-tech platform under the Qifu Jietiao brand in the People’s Republic of China.\nQFIN\nUS$29.12\n7D\n-6.3%\n1Y\n9.9%"
    },
    {
      "url": "https://simplywall.st/company/id/032D6C85-5043-494D-B961-B084FE201533/future?blueprint=4031524&utm_medium=finance_user&utm_campaign=conclusion&utm_source=yahoo",
      "text": "Everyman Media Group Future Growth\nFuture criteria checks 1/6\nEveryman Media Group is forecast to grow earnings and revenue by 80.6% and 11.2% per annum respectively while EPS is expected to grow by 82% per annum.\nKey information\n80.6%\nEarnings growth rate\n81.95%\nEPS growth rate\n| Entertainment earnings growth | 0.9% |\n| Revenue growth rate | 11.2% |\n| Future return on equity | n/a |\n| Analyst coverage | Low |\n| Last updated | 29 Jul 2025 |\nRecent future growth updates\nRecent updates\nEveryman Media Group plc (LON:EMAN) Might Not Be As Mispriced As It Looks After Plunging 25%\nJan 29Be Wary Of Everyman Media Group (LON:EMAN) And Its Returns On Capital\nJan 18A Piece Of The Puzzle Missing From Everyman Media Group plc's (LON:EMAN) 26% Share Price Climb\nAug 20Investors Still Aren't Entirely Convinced By Everyman Media Group plc's (LON:EMAN) Revenues Despite 26% Price Jump\nAug 20Everyman Media Group plc (LON:EMAN) Might Not Be As Mispriced As It Looks\nFeb 03Is Everyman Media Group (LON:EMAN) Weighed On By Its Debt Load?\nNov 25There Are Reasons To Feel Uneasy About Everyman Media Group's (LON:EMAN) Returns On Capital\nMar 29Is Everyman Media Group (LON:EMAN) Weighed On By Its Debt Load?\nMay 12Would Everyman Media Group (LON:EMAN) Be Better Off With Less Debt?\nApr 10If You Had Bought Everyman Media Group's (LON:EMAN) Shares Three Years Ago You Would Be Down 48%\nDec 21Earnings and Revenue Growth Forecasts\n| Date | Revenue | Earnings | Free Cash Flow | Cash from Op | Avg. No. Analysts |\n|---|---|---|---|---|---|\n| 12/31/2026 | 134 | -2 | 1 | 22 | 2 |\n| 12/31/2025 | 122 | -3 | 0 | 18 | 2 |\n| 1/2/2025 | 107 | -9 | 6 | 22 | N/A |\n| 10/2/2024 | 103 | -5 | 4 | 18 | N/A |\n| 6/27/2024 | 99 | -2 | 2 | 14 | N/A |\n| 3/27/2024 | 95 | -2 | 0 | 16 | N/A |\n| 12/28/2023 | 91 | -3 | -2 | 18 | N/A |\n| 9/28/2023 | 84 | -5 | -8 | 14 | N/A |\n| 6/29/2023 | 76 | -7 | -15 | 10 | N/A |\n| 3/29/2023 | 78 | -5 | -12 | 11 | N/A |\n| 12/29/2022 | 79 | -4 | -8 | 12 | N/A |\n| 9/29/2022 | 80 | 0 | -1 | 16 | N/A |\n| 6/30/2022 | 82 | 3 | 7 | 21 | N/A |\n| 3/31/2022 | 66 | -1 | 6 | 17 | N/A |\n| 12/30/2021 | 49 | -5 | 4 | 12 | N/A |\n| 9/30/2021 | 33 | -11 | 0 | 6 | N/A |\n| 7/1/2021 | 17 | -17 | -4 | -1 | N/A |\n| 4/1/2021 | 21 | -19 | -9 | -3 | N/A |\n| 12/31/2020 | 24 | -20 | -14 | -5 | N/A |\n| 9/30/2020 | 38 | -15 | -14 | 2 | N/A |\n| 7/2/2020 | 51 | -11 | -13 | 9 | N/A |\n| 4/2/2020 | 58 | -4 | -11 | 12 | N/A |\n| 1/2/2020 | 65 | 2 | -8 | 16 | N/A |\n| 10/2/2019 | 60 | 2 | -10 | 14 | N/A |\n| 7/4/2019 | 56 | 2 | -12 | 13 | N/A |\n| 4/4/2019 | 54 | 2 | -14 | 10 | N/A |\n| 1/3/2019 | 52 | 2 | -15 | 8 | N/A |\n| 10/3/2018 | 49 | 2 | N/A | 8 | N/A |\n| 7/5/2018 | 47 | 2 | N/A | 8 | N/A |\n| 4/5/2018 | 44 | 1 | N/A | 11 | N/A |\n| 12/28/2017 | 41 | 1 | N/A | 14 | N/A |\n| 9/28/2017 | 38 | 1 | N/A | 12 | N/A |\n| 6/29/2017 | 36 | 1 | N/A | 11 | N/A |\n| 3/29/2017 | 33 | 1 | N/A | 8 | N/A |\n| 12/29/2016 | 30 | 0 | N/A | 5 | N/A |\n| 9/29/2016 | 27 | 0 | N/A | 4 | N/A |\n| 6/30/2016 | 24 | -1 | N/A | 2 | N/A |\n| 3/31/2016 | 22 | -1 | N/A | 2 | N/A |\n| 12/31/2015 | 20 | -1 | N/A | 3 | N/A |\n| 9/30/2015 | 18 | 0 | N/A | 2 | N/A |\n| 6/30/2015 | 16 | 0 | N/A | 1 | N/A |\n| 3/31/2015 | 15 | 0 | N/A | 1 | N/A |\n| 12/31/2014 | 14 | 0 | N/A | 2 | N/A |\n| 9/30/2014 | 13 | 0 | N/A | 2 | N/A |\nAnalyst Future Growth Forecasts\nEarnings vs Savings Rate: EMAN is forecast to remain unprofitable over the next 3 years.\nEarnings vs Market: EMAN is forecast to remain unprofitable over the next 3 years.\nHigh Growth Earnings: EMAN is forecast to remain unprofitable over the next 3 years.\nRevenue vs Market: EMAN's revenue (11.2% per year) is forecast to grow faster than the UK market (9.4% per year).\nHigh Growth Revenue: EMAN's revenue (11.2% per year) is forecast to grow slower than 20% per year.\nEarnings per Share Growth Forecasts\nFuture Return on Equity\nFuture ROE: Insufficient data to determine if EMAN's Return on Equity is forecast to be high in 3 years time\nDiscover growth companies\nCompany Analysis and Financial Data Status\n| Data | Last Updated (UTC time) |\n|---|---|\n| Company Analysis | 2025/09/01 05:55 |\n| End of Day Share Price | 2025/08/29 00:00 |\n| Earnings | 2025/01/02 |\n| Annual Earnings | 2025/01/02 |\nData Sources\nThe data used in our company analysis is from S&P Global Market Intelligence LLC. The following data is used in our analysis model to generate this report. Data is normalised which can introduce a delay from the source being available.\n| Package | Data | Timeframe | Example US Source * |\n|---|---|---|---|\n| Company Financials | 10 years |\n| |\n| Analyst Consensus Estimates | +3 years |\n|\n|\n| Market Prices | 30 years |\n| |\n| Ownership | 10 years |\n| |\n| Management | 10 years |\n| |\n| Key Developments | 10 years |\n|\n* Example for US securities, for non-US equivalent regulatory forms and sources are used.\nUnless specified all financial data is based on a yearly period but updated quarterly. This is known as Trailing Twelve Month (TTM) or Last Twelve Month (LTM) Data. Learn more.\nAnalysis Model and Snowflake\nDetails of the analysis model used to generate this report is available on our Github page, we also have guides on how to use our reports and tutorials on Youtube.\nLearn about the world class team who designed and built the Simply Wall St analysis model.\nIndustry and Sector Metrics\nOur industry and section metrics are calculated every 6 hours by Simply Wall St, details of our process are available on Github.\nAnalyst Sources\nEveryman Media Group plc is covered by 2 analysts. 2 of those analysts submitted the estimates of revenue or earnings used as inputs to our report. Analysts submissions are updated throughout the day.\n| Analyst | Institution |\n|---|---|\n| Mark Photiades | Canaccord Genuity |\n| Andrew Renton | Cavendish |"
    },
    {
      "url": "https://simplywall.st/company/id/032D6C85-5043-494D-B961-B084FE201533?blueprint=4031524&utm_medium=finance_user&utm_campaign=cta&utm_source=yahoo",
      "text": "Everyman Media Group (EMAN) Stock Overview\nOwns and manages cinemas in the United Kingdom. More details\n| Snowflake Score | |\n|---|---|\n| Valuation | 4/6 |\n| Future Growth | 1/6 |\n| Past Performance | 0/6 |\n| Financial Health | 2/6 |\n| Dividends | 0/6 |\nEMAN Community Fair Values\nSee what others think this stock is worth. Follow their fair value or set your own to get alerts.\nEveryman Media Group plc Competitors\nPrice History & Performance\n| Historical stock prices | |\n|---|---|\n| Current Share Price | UK£0.42 |\n| 52 Week High | UK£0.62 |\n| 52 Week Low | UK£0.35 |\n| Beta | 0.82 |\n| 1 Month Change | 0% |\n| 3 Month Change | 3.70% |\n| 1 Year Change | -29.41% |\n| 3 Year Change | -59.02% |\n| 5 Year Change | -51.72% |\n| Change since IPO | -56.70% |\nRecent News & Updates\nRecent updates\nEveryman Media Group plc (LON:EMAN) Might Not Be As Mispriced As It Looks After Plunging 25%\nJan 29Be Wary Of Everyman Media Group (LON:EMAN) And Its Returns On Capital\nJan 18A Piece Of The Puzzle Missing From Everyman Media Group plc's (LON:EMAN) 26% Share Price Climb\nAug 20Investors Still Aren't Entirely Convinced By Everyman Media Group plc's (LON:EMAN) Revenues Despite 26% Price Jump\nAug 20Everyman Media Group plc (LON:EMAN) Might Not Be As Mispriced As It Looks\nFeb 03Is Everyman Media Group (LON:EMAN) Weighed On By Its Debt Load?\nNov 25There Are Reasons To Feel Uneasy About Everyman Media Group's (LON:EMAN) Returns On Capital\nMar 29Is Everyman Media Group (LON:EMAN) Weighed On By Its Debt Load?\nMay 12Would Everyman Media Group (LON:EMAN) Be Better Off With Less Debt?\nApr 10If You Had Bought Everyman Media Group's (LON:EMAN) Shares Three Years Ago You Would Be Down 48%\nDec 21Shareholder Returns\n| EMAN | GB Entertainment | GB Market | |\n|---|---|---|---|\n| 7D | 0% | 1.7% | 2.7% |\n| 1Y | -29.4% | 3.1% | 19.1% |\nReturn vs Industry: EMAN underperformed the UK Entertainment industry which returned 3.1% over the past year.\nReturn vs Market: EMAN underperformed the UK Market which returned 19.1% over the past year.\nPrice Volatility\n| EMAN volatility | |\n|---|---|\n| EMAN Average Weekly Movement | 2.5% |\n| Entertainment Industry Average Movement | 4.5% |\n| Market Average Movement | 4.8% |\n| 10% most volatile stocks in GB Market | 10.6% |\n| 10% least volatile stocks in GB Market | 2.5% |\nStable Share Price: EMAN has not had significant price volatility in the past 3 months compared to the UK market.\nVolatility Over Time: EMAN's weekly volatility (3%) has been stable over the past year.\nAbout the Company\n| Founded | Employees | CEO | Website |\n|---|---|---|---|\n| 1920 | 1,989 | Alex Scrimgeour | www.everymancinema.com |\nEveryman Media Group plc, together with its subsidiaries, owns and manages cinemas in the United Kingdom. The company provides mainstream, independent and classic films, special events, launches, and live satellite broadcasts. It also offers technical equipment, property maintenance, construction, cleaning, and other professional services.\nEveryman Media Group plc Fundamentals Summary\n| EMAN fundamental statistics | |\n|---|---|\n| Market cap | UK£38.30m |\n| Earnings (TTM) | -UK£8.53m |\n| Revenue (TTM) | UK£107.17m |\nIs EMAN overvalued?\nSee Fair Value and valuation analysisEarnings & Revenue\n| EMAN income statement (TTM) | |\n|---|---|\n| Revenue | UK£107.17m |\n| Cost of Revenue | UK£38.11m |\n| Gross Profit | UK£69.07m |\n| Other Expenses | UK£77.60m |\n| Earnings | -UK£8.53m |\nLast Reported Earnings\nJan 02, 2025\nNext Earnings Date\nSep 24, 2025\n| Earnings per share (EPS) | -0.094 |\n| Gross Margin | 64.44% |\n| Net Profit Margin | -7.96% |\n| Debt/Equity Ratio | 76.8% |\nHow did EMAN perform over the long term?\nSee historical performance and comparisonCompany Analysis and Financial Data Status\n| Data | Last Updated (UTC time) |\n|---|---|\n| Company Analysis | 2025/09/01 05:55 |\n| End of Day Share Price | 2025/08/29 00:00 |\n| Earnings | 2025/01/02 |\n| Annual Earnings | 2025/01/02 |\nData Sources\nThe data used in our company analysis is from S&P Global Market Intelligence LLC. The following data is used in our analysis model to generate this report. Data is normalised which can introduce a delay from the source being available.\n| Package | Data | Timeframe | Example US Source * |\n|---|---|---|---|\n| Company Financials | 10 years |\n| |\n| Analyst Consensus Estimates | +3 years |\n|\n|\n| Market Prices | 30 years |\n| |\n| Ownership | 10 years |\n| |\n| Management | 10 years |\n| |\n| Key Developments | 10 years |\n|\n* Example for US securities, for non-US equivalent regulatory forms and sources are used.\nUnless specified all financial data is based on a yearly period but updated quarterly. This is known as Trailing Twelve Month (TTM) or Last Twelve Month (LTM) Data. Learn more.\nAnalysis Model and Snowflake\nDetails of the analysis model used to generate this report is available on our Github page, we also have guides on how to use our reports and tutorials on Youtube.\nLearn about the world class team who designed and built the Simply Wall St analysis model.\nIndustry and Sector Metrics\nOur industry and section metrics are calculated every 6 hours by Simply Wall St, details of our process are available on Github.\nAnalyst Sources\nEveryman Media Group plc is covered by 2 analysts. 2 of those analysts submitted the estimates of revenue or earnings used as inputs to our report. Analysts submissions are updated throughout the day.\n| Analyst | Institution |\n|---|---|\n| Mark Photiades | Canaccord Genuity |\n| Andrew Renton | Cavendish |"
    },
    {
      "url": "https://simplywall.st/company/id/032D6C85-5043-494D-B961-B084FE201533/valuation?blueprint=4031524&amp;utm_medium=finance_user&amp;utm_campaign=infographic&amp;utm_source=yahoo",
      "text": "Is EMAN undervalued compared to its fair value, analyst forecasts and its price relative to the market?\nValuation Score\n4/6\nValuation Score 4/6\nBelow Fair Value\nSignificantly Below Fair Value\nPrice-To-Sales vs Peers\nPrice-To-Sales vs Industry\nPrice-To-Sales vs Fair Ratio\nAnalyst Forecast\nShare Price vs Fair Value\nWhat is the Fair Price of EMAN when looking at its future cash flows? For this estimate we use a Discounted Cash Flow model.\nDiscounted Cash Flow\nSimply Wall St\nUK£0.48\nFair Value\n13.1% undervalued intrinsic discount\n2\nNumber of Analysts\nBelow Fair Value: EMAN (£0.42) is trading below our estimate of fair value (£0.48)\nSignificantly Below Fair Value: EMAN is trading below fair value, but not by a significant amount.\nKey Valuation Metric\nWhich metric is best to use when looking at relative valuation for EMAN?\nKey metric: As EMAN is unprofitable we use its Price-To-Sales Ratio for relative valuation analysis.\nThe above table shows the Price to Sales ratio for EMAN. This is calculated by dividing EMAN's market cap by their current\nrevenue.\nWhat is EMAN's PS Ratio?\nPS Ratio\n0.4x\nSales\nUK£107.17m\nMarket Cap\nUK£38.30m\nEMAN key valuation metrics and ratios. From Price to Earnings, Price to Sales and Price to Book to Price to Earnings Growth Ratio, Enterprise Value and EBITDA.\nPrice-To-Sales vs Industry: EMAN is good value based on its Price-To-Sales Ratio (0.4x) compared to the European Entertainment industry average (1.9x).\nPrice to Sales Ratio vs Fair Ratio\nWhat is EMAN's PS Ratio\ncompared to its\nFair PS Ratio?\nThis is the expected PS Ratio taking into\naccount the company's forecast earnings growth, profit margins\nand other risk factors.\nEMAN PS Ratio vs Fair Ratio.\nFair Ratio\nCurrent PS Ratio\n0.4x\nFair PS Ratio\n1.2x\nPrice-To-Sales vs Fair Ratio: EMAN is good value based on its Price-To-Sales Ratio (0.4x) compared to the estimated Fair Price-To-Sales Ratio (1.2x).\nAnalyst Price Targets\nWhat is the analyst 12-month forecast and do we have any statistical confidence in the consensus price target?\nThe above table shows the analyst EMAN forecast and predictions for the stock price in 12 month’s time.\nDate\nShare Price\nAverage 1Y Price Target\nDispersion\nHigh\nLow\n1Y Actual price\nAnalysts\nCurrent\nUK£0.42\nUK£1.38\n+227.38%\n16.36%\nUK£1.60\nUK£1.15\nn/a\n2\nAug ’26\nUK£0.42\nUK£1.38\n+227.38%\n16.36%\nUK£1.60\nUK£1.15\nn/a\n2\nJul ’26\nUK£0.41\nUK£1.38\n+235.37%\n16.36%\nUK£1.60\nUK£1.15\nn/a\n2\nJun ’26\nUK£0.41\nUK£1.38\n+239.51%\n16.36%\nUK£1.60\nUK£1.15\nn/a\n2\nMay ’26\nUK£0.41\nUK£1.38\n+235.37%\n16.36%\nUK£1.60\nUK£1.15\nn/a\n2\nApr ’26\nUK£0.38\nUK£1.38\n+266.67%\n16.36%\nUK£1.60\nUK£1.15\nn/a\n2\nAnalystConsensusTarget\nConsensus Narrative from 2 Analysts\nUK£1.38\nFair Value\n69.5% undervalued intrinsic discount\n2\nNumber of Analysts\nAnalyst Forecast: Target price is more than 20% higher than the current share price, but there are not enough analysts covering the stock to determine statistical confidence in agreement.\nDiscover undervalued companies\n7D\n1Y\n7D\n1Y\n7D\n1Y\nCompany Analysis and Financial Data Status\nData\nLast Updated (UTC time)\nCompany Analysis\n2025/09/01 05:55\nEnd of Day Share Price\n2025/08/29 00:00\nEarnings\n2025/01/02\nAnnual Earnings\n2025/01/02\nData Sources\nThe data used in our company analysis is from S&P Global Market Intelligence LLC. The following data is used in our analysis model to generate this report. Data is normalised which can introduce a delay from the source being available.\n* Example for US securities, for non-US equivalent regulatory forms and sources are used.\nUnless specified all financial data is based on a yearly period but updated quarterly. This is known as Trailing Twelve Month (TTM) or Last Twelve Month (LTM) Data. Learn more.\nAnalysis Model and Snowflake\nDetails of the analysis model used to generate this report is available on our Github page, we also have guides on how to use our reports and tutorials on Youtube.\nLearn about the world class team who designed and built the Simply Wall St analysis model.\nIndustry and Sector Metrics\nOur industry and section metrics are calculated every 6 hours by Simply Wall St, details of our process are available on Github.\nAnalyst Sources\nEveryman Media Group plc is covered by 2 analysts. 2 of those analysts submitted the estimates of revenue or earnings used as inputs to our report. Analysts submissions are updated throughout the day."
    },
    {
      "url": "https://simplywall.st/company/id/032D6C85-5043-494D-B961-B084FE201533?blueprint=4031524&utm_medium=finance_user&utm_campaign=conclusion&utm_source=yahoo",
      "text": "Everyman Media Group (EMAN) Stock Overview\nOwns and manages cinemas in the United Kingdom. More details\n| Snowflake Score | |\n|---|---|\n| Valuation | 4/6 |\n| Future Growth | 1/6 |\n| Past Performance | 0/6 |\n| Financial Health | 2/6 |\n| Dividends | 0/6 |\nEMAN Community Fair Values\nSee what others think this stock is worth. Follow their fair value or set your own to get alerts.\nEveryman Media Group plc Competitors\nPrice History & Performance\n| Historical stock prices | |\n|---|---|\n| Current Share Price | UK£0.42 |\n| 52 Week High | UK£0.62 |\n| 52 Week Low | UK£0.35 |\n| Beta | 0.82 |\n| 1 Month Change | 0% |\n| 3 Month Change | 3.70% |\n| 1 Year Change | -29.41% |\n| 3 Year Change | -59.02% |\n| 5 Year Change | -51.72% |\n| Change since IPO | -56.70% |\nRecent News & Updates\nRecent updates\nEveryman Media Group plc (LON:EMAN) Might Not Be As Mispriced As It Looks After Plunging 25%\nJan 29Be Wary Of Everyman Media Group (LON:EMAN) And Its Returns On Capital\nJan 18A Piece Of The Puzzle Missing From Everyman Media Group plc's (LON:EMAN) 26% Share Price Climb\nAug 20Investors Still Aren't Entirely Convinced By Everyman Media Group plc's (LON:EMAN) Revenues Despite 26% Price Jump\nAug 20Everyman Media Group plc (LON:EMAN) Might Not Be As Mispriced As It Looks\nFeb 03Is Everyman Media Group (LON:EMAN) Weighed On By Its Debt Load?\nNov 25There Are Reasons To Feel Uneasy About Everyman Media Group's (LON:EMAN) Returns On Capital\nMar 29Is Everyman Media Group (LON:EMAN) Weighed On By Its Debt Load?\nMay 12Would Everyman Media Group (LON:EMAN) Be Better Off With Less Debt?\nApr 10If You Had Bought Everyman Media Group's (LON:EMAN) Shares Three Years Ago You Would Be Down 48%\nDec 21Shareholder Returns\n| EMAN | GB Entertainment | GB Market | |\n|---|---|---|---|\n| 7D | 0% | 1.7% | 2.7% |\n| 1Y | -29.4% | 3.1% | 19.1% |\nReturn vs Industry: EMAN underperformed the UK Entertainment industry which returned 3.1% over the past year.\nReturn vs Market: EMAN underperformed the UK Market which returned 19.1% over the past year.\nPrice Volatility\n| EMAN volatility | |\n|---|---|\n| EMAN Average Weekly Movement | 2.5% |\n| Entertainment Industry Average Movement | 4.5% |\n| Market Average Movement | 4.8% |\n| 10% most volatile stocks in GB Market | 10.6% |\n| 10% least volatile stocks in GB Market | 2.5% |\nStable Share Price: EMAN has not had significant price volatility in the past 3 months compared to the UK market.\nVolatility Over Time: EMAN's weekly volatility (3%) has been stable over the past year.\nAbout the Company\n| Founded | Employees | CEO | Website |\n|---|---|---|---|\n| 1920 | 1,989 | Alex Scrimgeour | www.everymancinema.com |\nEveryman Media Group plc, together with its subsidiaries, owns and manages cinemas in the United Kingdom. The company provides mainstream, independent and classic films, special events, launches, and live satellite broadcasts. It also offers technical equipment, property maintenance, construction, cleaning, and other professional services.\nEveryman Media Group plc Fundamentals Summary\n| EMAN fundamental statistics | |\n|---|---|\n| Market cap | UK£38.30m |\n| Earnings (TTM) | -UK£8.53m |\n| Revenue (TTM) | UK£107.17m |\nIs EMAN overvalued?\nSee Fair Value and valuation analysisEarnings & Revenue\n| EMAN income statement (TTM) | |\n|---|---|\n| Revenue | UK£107.17m |\n| Cost of Revenue | UK£38.11m |\n| Gross Profit | UK£69.07m |\n| Other Expenses | UK£77.60m |\n| Earnings | -UK£8.53m |\nLast Reported Earnings\nJan 02, 2025\nNext Earnings Date\nSep 24, 2025\n| Earnings per share (EPS) | -0.094 |\n| Gross Margin | 64.44% |\n| Net Profit Margin | -7.96% |\n| Debt/Equity Ratio | 76.8% |\nHow did EMAN perform over the long term?\nSee historical performance and comparisonCompany Analysis and Financial Data Status\n| Data | Last Updated (UTC time) |\n|---|---|\n| Company Analysis | 2025/09/01 05:55 |\n| End of Day Share Price | 2025/08/29 00:00 |\n| Earnings | 2025/01/02 |\n| Annual Earnings | 2025/01/02 |\nData Sources\nThe data used in our company analysis is from S&P Global Market Intelligence LLC. The following data is used in our analysis model to generate this report. Data is normalised which can introduce a delay from the source being available.\n| Package | Data | Timeframe | Example US Source * |\n|---|---|---|---|\n| Company Financials | 10 years |\n| |\n| Analyst Consensus Estimates | +3 years |\n|\n|\n| Market Prices | 30 years |\n| |\n| Ownership | 10 years |\n| |\n| Management | 10 years |\n| |\n| Key Developments | 10 years |\n|\n* Example for US securities, for non-US equivalent regulatory forms and sources are used.\nUnless specified all financial data is based on a yearly period but updated quarterly. This is known as Trailing Twelve Month (TTM) or Last Twelve Month (LTM) Data. Learn more.\nAnalysis Model and Snowflake\nDetails of the analysis model used to generate this report is available on our Github page, we also have guides on how to use our reports and tutorials on Youtube.\nLearn about the world class team who designed and built the Simply Wall St analysis model.\nIndustry and Sector Metrics\nOur industry and section metrics are calculated every 6 hours by Simply Wall St, details of our process are available on Github.\nAnalyst Sources\nEveryman Media Group plc is covered by 2 analysts. 2 of those analysts submitted the estimates of revenue or earnings used as inputs to our report. Analysts submissions are updated throughout the day.\n| Analyst | Institution |\n|---|---|\n| Mark Photiades | Canaccord Genuity |\n| Andrew Renton | Cavendish |"
    },
    {
      "url": "https://simplywall.st/discover/investing-ideas/157/popular-view?blueprint=4031524&utm_medium=finance_user&utm_campaign=conclusion-grid&utm_source=yahoo",
      "text": "Results\n921\nMost Popular Stocks on the market\n921 companies\nInvestor\nMarket Cap: SEK 892.6b\nA private equity firm specializing in mature, middle market, buyouts and growth capital investments.\nINVE A\nSEK 291.50\n7D\n-1.9%\n1Y\n-4.6%\nAtlas Copco\nMarket Cap: SEK 709.3b\nProvides compressed air and gas, vacuum, energy, dewatering and industrial pumps, industrial power tools, and assembly and machine vision solutions in North America, South America, Europe, Africa, the Middle East, Asia, and Oceania.\nATCO A\nSEK 151.00\n7D\n0.7%\n1Y\n-18.6%\nAB Volvo\nMarket Cap: SEK 591.3b\nManufactures and sells trucks, buses, construction equipment, and marine and industrial engines in Europe, the United States, Asia, Africa, and Oceania.\nVOLV B\nSEK 290.90\n7D\n-1.8%\n1Y\n8.1%\nEQT\nMarket Cap: SEK 399.3b\nA global private equity & venture capital firm specializing in private capital and real asset segments.\nEQT\nSEK 340.00\n7D\n-1.7%\n1Y\n0%\nASSA ABLOY\nMarket Cap: SEK 371.1b\nProvides door opening and access products for the institutional, commercial, and residential markets.\nASSA B\nSEK 334.10\n7D\n-0.8%\n1Y\n0.5%\nSkandinaviska Enskilda Banken\nMarket Cap: SEK 345.4b\nProvides corporate, retail, investment, and private banking services.\nSEB A\nSEK 174.95\n7D\n-2.5%\n1Y\n10.5%\nSandvik\nMarket Cap: SEK 299.9b\nAn engineering company, provides products and solutions for mining and rock excavation, metal cutting, and materials technology worldwide.\nSAND\nSEK 239.10\n7D\n-1.8%\n1Y\n9.5%\nSwedbank\nMarket Cap: SEK 299.3b\nProvides various banking products and services to private and corporate customers in Sweden, Estonia, Latvia, Lithuania, Norway, the United States, Finland, Denmark, Luxembourg, and China.\nSWED A\nSEK 266.20\n7D\n-3.4%\n1Y\n20.6%\nSaab\nMarket Cap: SEK 287.2b\nProvides products, services, and solutions for military defense, aviation, and civil security markets Internationally.\nSAAB B\nSEK 535.20\n7D\n0.04%\n1Y\n133.6%\nHexagon\nMarket Cap: SEK 282.8b\nProvides geospatial and industrial enterprise solutions worldwide.\nHEXA B\nSEK 105.35\n7D\n-2.0%\n1Y\n0.9%\nTelefonaktiebolaget LM Ericsson\nMarket Cap: SEK 251.1b\nProvides mobile connectivity solutions to communications service providers, enterprises, and the public sector.\nERIC B\nSEK 75.30\n7D\n-0.6%\n1Y\n-1.2%\nSvenska Handelsbanken\nMarket Cap: SEK 243.7b\nProvides various banking products and services for private and corporate customers primarily in Sweden, the United Kingdom, Norway, the Netherlands, and internationally.\nSHB A\nSEK 121.65\n7D\n-4.3%\n1Y\n14.3%\nEpiroc\nMarket Cap: SEK 230.5b\nDevelops and produces equipment for use in surface and underground applications in North America, Europe, South America, Europe, Africa, the Middle East, Asia, Australia, and India.\nEPI A\nSEK 197.60\n7D\n-0.2%\n1Y\n0.7%\nH & M Hennes & Mauritz\nMarket Cap: SEK 222.6b\nProvides clothing, accessories, footwear, cosmetics, home textiles, and homeware for women, men, and children worldwide.\nHM B\nSEK 138.85\n7D\n-2.3%\n1Y\n-14.4%\nAlfa Laval\nMarket Cap: SEK 177.9b\nProvides heat transfer, separation, and fluid handling products and solutions worldwide.\nALFA\nSEK 430.50\n7D\n-1.5%\n1Y\n-6.9%\nEssity\nMarket Cap: SEK 175.6b\nDevelops, produces, and sells hygiene and health products and services in Europe, North and Latin America, Asia, and internationally.\nESSITY B\nSEK 255.60\n7D\n-0.8%\n1Y\n-17.9%\nEvolution\nMarket Cap: SEK 165.6b\nDevelops, produces, markets, and licenses online casino systems to gaming operators in Europe, Asia, North America, Latin America, and internationally.\nEVO\nSEK 820.00\n7D\n-4.7%\n1Y\n-22.4%\nAB Industrivärden\nMarket Cap: SEK 162.6b\nAB Industrivärden is a publicly owned investment manager.\nINDU A\nSEK 376.40\n7D\n-0.6%\n1Y\n2.2%\nInvestment AB Latour\nMarket Cap: SEK 153.5b\nAn investment firm.\nLATO B\nSEK 240.10\n7D\n-3.3%\n1Y\n-24.2%\nLifco\nMarket Cap: SEK 152.6b\nEngages in the dental, demolition and tools, and systems solutions businesses in Sweden, Norway, Germany, rest of Europe, the United Kingdom, Asia, Australia, Italy, North America, and internationally.\nLIFCO B\nSEK 336.00\n7D\n-2.3%\n1Y\n-1.3%\nTelia Company\nMarket Cap: SEK 138.8b\nProvides communication services to businesses, individuals, families, and communities in Sweden, Finland, Norway, Denmark, Lithuania, Estonia, and Latvia.\nTELIA\nSEK 35.30\n7D\n-1.1%\n1Y\n9.1%\nL E Lundbergföretagen\nMarket Cap: SEK 118.7b\nEngages in the manufacture and sale of paperboard, paper, and sawn timber products worldwide.\nLUND B\nSEK 478.80\n7D\n-2.0%\n1Y\n-15.6%\nTele2\nMarket Cap: SEK 115.5b\nProvides fixed and mobile connectivity and entertainment services in Sweden, Lithuania, Latvia, and Estonia.\nTEL2 B\nSEK 166.60\n7D\n1.3%\n1Y\n41.8%\nAB SKF\nMarket Cap: SEK 110.5b\nDesigns, manufactures, and sells bearings and units, seals, lubrication systems, condition monitoring, and services worldwide.\nSKF B\nSEK 242.70\n7D\n-1.1%\n1Y\n25.8%\nSwedish Orphan Biovitrum\nMarket Cap: SEK 99.4b\nA biopharma company, provides medicines in the areas of haematology, immunology, and specialty care in Europe, North America, the Middle East, Asia, and Australia.\nSOBI\nSEK 287.20\n7D\n-1.0%\n1Y\n-9.1%\nSkanska\nMarket Cap: SEK 96.8b\nOperates as a construction and project development company in the Nordics, Europe, and the United States.\nSKA B\nSEK 234.80\n7D\n-2.1%\n1Y\n13.5%\nBoliden\nMarket Cap: SEK 92.6b\nEngages in the extracting, producing, and recycling of base metals in Sweden, Finland, other Nordic region, Germany, the United Kingdom, Europe, North America, and internationally.\nBOL\nSEK 325.80\n7D\n-0.8%\n1Y\n4.8%\nSvenska Cellulosa Aktiebolaget\nMarket Cap: SEK 90.4b\nA forest products company, develops, manufactures, and sells forest, wood, pulp, and containerboard products in Sweden, the United States, Germany, the United Kingdom, rest of Europe, Asia, and internationally.\nSCA B\nSEK 128.70\n7D\n-2.8%\n1Y\n-8.9%\nAddtech AB (publ.)\nMarket Cap: SEK 89.5b\nProvides high-tech products and solutions in Sweden, Denmark, Finland, Norway, Germany, the United Kingdom, rest of Europe, and internationally.\nADDT B\nSEK 331.60\n7D\n-3.8%\n1Y\n-0.2%\nIndutrade\nMarket Cap: SEK 85.8b\nManufactures, develops, and sells components, systems, and services to various industries worldwide.\nINDT\nSEK 235.40\n7D\n0%\n1Y\n-26.9%\nTrelleborg\nMarket Cap: SEK 83.2b\nProvides engineered polymer solutions for seal, damp, and protect critical applications worldwide.\nTREL B\nSEK 366.00\n7D\n1.9%\n1Y\n-7.5%\nSecuritas\nMarket Cap: SEK 82.9b\nProvides security services in North America, Europe, Latin America, Africa, the Middle East, Asia, and Australia.\nSECU B\nSEK 144.75\n7D\n-3.9%\n1Y\n20.8%\nBeijer Ref\nMarket Cap: SEK 81.6b\nProvides commercial and industrial refrigeration, heating, and air conditioning products worldwide.\nBEIJ B\nSEK 160.90\n7D\n-5.3%\n1Y\n-7.2%\nFastighets AB Balder\nMarket Cap: SEK 80.1b\nDevelops, owns, leases, and manages residential and commercial properties in Sweden, Denmark, Finland, Norway, Germany, and the United Kingdom.\nBALD B\nSEK 67.30\n7D\n-2.0%\n1Y\n-17.4%\nNIBE Industrier\nMarket Cap: SEK 78.3b\nDevelops, manufactures, markets, and sells energy-efficient solutions for indoor climate comfort, and components and solutions for intelligent heating and control.\nNIBE B\nSEK 38.82\n7D\n-8.4%\n1Y\n-21.7%\nAB Sagax\nMarket Cap: SEK 73.7b\nA property company, owns and manages a property portfolio in Sweden, Finland, France, Benelux, Spain, Germany, and other European countries.\nSAGA A\nSEK 206.00\n7D\n-2.4%\n1Y\n-23.4%"
    },
    {
      "url": "https://simplywall.st/discover/investing-ideas/10146/solid-balance-sheet-and-fundamentals/global?blueprint=4031524&utm_medium=finance_user&utm_campaign=conclusion-grid&utm_source=yahoo",
      "text": "Results\n1955\nHigh return on equity, past performance and sound balance sheet.\n1955 companies\nAnthem Biosciences\nMarket Cap: ₹459.4b\nOperates as technology-focused contract research, development, and manufacturing organization.\nANTHEM\n₹818.05\n7D\n-0.6%\n1Y\nn/a\nChewy\nMarket Cap: US$16.9b\nEngages in the e-commerce business in the United States.\nCHWY\nUS$40.96\n7D\n3.1%\n1Y\n43.5%\nMarico Bangladesh\nMarket Cap: ৳91.9b\nEngages in the manufacture and marketing of consumer products in Bangladesh.\nMARICO\n৳2,918.80\n7D\n2.5%\n1Y\n25.8%\nPJT Partners\nMarket Cap: US$7.4b\nAn investment bank, provides various strategic advisory, shareholder advisory, capital markets advisory, and restructuring and special situations services to corporations, financial sponsors, institutional investors, and governments worldwide.\nPJT\nUS$179.00\n7D\n0.6%\n1Y\n44.9%\nCarlsberg Brewery Malaysia Berhad\nMarket Cap: RM 4.9b\nEngages in the production, distribution, and sale of beer, stout, cider, shandy, liquor, and non-alcoholic beverages in Malaysia, Singapore, and internationally.\nCARLSBG\nRM 16.16\n7D\n-3.2%\n1Y\n-15.8%\nDunelm Group\nMarket Cap: UK£2.4b\nEngages in the retail of homewares in the United Kingdom.\nDNLM\nUK£12.00\n7D\n-2.2%\n1Y\n-3.6%\nBouvet\nMarket Cap: NOK 7.0b\nProvides IT and digital communication consultancy services for public and private sectors in Norway, Sweden, and internationally.\nBOUV\nNOK 68.20\n7D\n-4.9%\n1Y\n-3.7%\nHeineken Malaysia Berhad\nMarket Cap: RM 6.1b\nEngages in producing, packaging, marketing, and distributing alcoholic beverages primarily in Malaysia.\nHEIM\nRM 20.22\n7D\n-6.3%\n1Y\n-12.1%\nTips Music\nMarket Cap: ₹74.4b\nEngages in the acquisition and exploitation of music rights in India and internationally.\nTIPSMUSIC\n₹581.75\n7D\n0.03%\n1Y\n-22.7%\nOkomu Oil Palm\nMarket Cap: ₦973.0b\nEngages in the cultivation and plantation of oil palm and rubber in Nigeria.\nOKOMUOIL\n₦1,020.00\n7D\n0%\n1Y\n144.2%\nGQG Partners\nMarket Cap: AU$5.2b\nOperates as a boutique asset management company worldwide.\nGQG\nAU$1.75\n7D\n-1.7%\n1Y\n-36.3%\nOrganization of Football Prognostics\nMarket Cap: €6.9b\nEngages in the operation and management of numerical lottery and sports betting games in Greece and Cyprus.\nOPAP\n€19.17\n7D\n-0.7%\n1Y\n18.7%\nAlef Education Holding\nMarket Cap: د.إ7.1b\nTogether with its subsidiary, provides AI-powered learning solutions in the United Arab Emirates, Indonesia, the United States, and the Kingdom of Saudi Arabia.\nALEFEDT\nد.إ1.02\n7D\n0%\n1Y\n-17.7%\nArabian Cement CompanyE\nMarket Cap: ج.م14.8b\nManufactures and sells cement and other related products in Egypt.\nARCC\nج.م39.10\n7D\n-5.5%\n1Y\n240.0%\nPlover Bay Technologies\nMarket Cap: HK$7.2b\nAn investment holding company, designs, develops, and markets software defined wide area network routers.\n1523\nHK$6.57\n7D\n-1.6%\n1Y\n68.5%\nAlexandria Container&Cargo Handling\nMarket Cap: ج.م63.1b\nProvides container handling services in Egypt.\nALCN\nج.م21.17\n7D\n-3.0%\n1Y\n-9.1%\nClear Secure\nMarket Cap: US$4.9b\nOperates a secure identity platform under the CLEAR brand name primarily in the United States.\nYOU\nUS$36.31\n7D\n-0.1%\n1Y\n19.5%\nMoelis\nMarket Cap: US$5.8b\nOperates as an investment banking advisory firm in North and South America, Europe, the Middle East, Asia, and Australia.\nMC\nUS$72.11\n7D\n0.2%\n1Y\n8.0%\nIfirma\nMarket Cap: zł204.8m\nIFirma SA engages in the provision of Internet services.\nIFI\nzł32.00\n7D\n3.1%\n1Y\n38.5%\neMemory Technology\nMarket Cap: NT$154.2b\nResearches, develops, manufactures, and sells embedded flash memory products in Taiwan and internationally.\n3529\nNT$2,065.00\n7D\n1.7%\n1Y\n-21.6%\nHindustan Zinc\nMarket Cap: ₹1.8t\nExplores for, extracts, and processes minerals in India, rest of Asia, and internationally.\n500188\n₹419.20\n7D\n-1.3%\n1Y\n-16.2%\nHemnet Group\nMarket Cap: SEK 23.3b\nOperates a residential property platform in Sweden.\nHEM\nSEK 246.00\n7D\n-7.4%\n1Y\n-35.1%\ninnoscripta\nMarket Cap: €1.2b\nProvides software-as-a-service for managing research and development (R&D) tax incentives and project management consulting in Germany.\n1INN\n€121.00\n7D\n16.1%\n1Y\nn/a\nDocebo\nMarket Cap: CA$1.2b\nDevelops and provides a learning management platform for training in North America and internationally.\nDCBO\nCA$42.79\n7D\n0.8%\n1Y\n-26.1%\nIntellego Technologies\nMarket Cap: SEK 6.3b\nManufactures and sells colorimetric ultraviolet indicators in Sweden.\nINT\nSEK 205.00\n7D\n32.3%\n1Y\n718.4%\nGaztransport & Technigaz\nMarket Cap: €5.9b\nA technology and engineering company, provides cryogenic membrane containment systems for the maritime transportation and storage of liquefied gases in South Korea, China, and internationally.\nGTT\n€159.40\n7D\n0.6%\n1Y\n19.6%\nForesight Group Holdings\nMarket Cap: UK£516.1m\nOperates as an infrastructure and private equity manager in the United Kingdom, Italy, Luxembourg, Ireland, Spain, and Australia.\nFSG\nUK£4.61\n7D\n-1.5%\n1Y\n-8.9%\nNetwealth Group\nMarket Cap: AU$8.4b\nA financial services company, engages in the wealth management business in Australia.\nNWL\nAU$34.47\n7D\n-4.8%\n1Y\n53.1%\nASPEED Technology\nMarket Cap: NT$188.9b\nOperates as a fabless integrated circuit (IC) design company in Taiwan, China, the United States, and internationally.\n5274\nNT$4,995.00\n7D\n-0.6%\n1Y\n1.3%\nNordrest Holding\nMarket Cap: SEK 2.8b\nOperates as a foodservice company in Sweden and internationally.\nNREST\nSEK 219.50\n7D\n10.2%\n1Y\n75.6%\nJarir Marketing\nMarket Cap: ر.س15.2b\nEngages in the retail and wholesale trading of office and school supplies in the Kingdom of Saudi Arabia, Egypt, and other Gulf countries.\n4190\nر.س12.66\n7D\n0.2%\n1Y\n-2.2%\nAustralian Ethical Investment\nMarket Cap: AU$851.8m\nAustralian Ethical Investment Ltd is a publicly owned investment manager.\nAEF\nAU$7.51\n7D\n-7.9%\n1Y\n81.0%\nData#3\nMarket Cap: AU$1.4b\nProvides information technology (IT) solutions and services in Australia.\nDTL\nAU$9.21\n7D\n15.1%\n1Y\n19.6%\nSleep Cycle\nMarket Cap: SEK 614.4m\nEngages in providing sleep tracking applications in Sweden.\nSLEEP\nSEK 30.30\n7D\n6.7%\n1Y\n-27.5%\nShoper\nMarket Cap: zł1.4b\nProvides Software as a Service solutions for e-commerce in Poland.\nSHO\nzł49.00\n7D\n-1.4%\n1Y\n4.3%\nCanal Shipping Agencies\nMarket Cap: ج.م8.8b\nProvides various shipping services to the international commercial fleet in Egypt.\nCSAG\nج.م29.35\n7D\n1.7%\n1Y\n52.4%"
    },
    {
      "url": "https://simplywall.st/company/id/032D6C85-5043-494D-B961-B084FE201533/valuation?blueprint=4031524&utm_medium=finance_user&utm_campaign=cta&utm_source=yahoo",
      "text": "Is EMAN undervalued compared to its fair value, analyst forecasts and its price relative to the market?\nValuation Score\n4/6\nValuation Score 4/6\nBelow Fair Value\nSignificantly Below Fair Value\nPrice-To-Sales vs Peers\nPrice-To-Sales vs Industry\nPrice-To-Sales vs Fair Ratio\nAnalyst Forecast\nShare Price vs Fair Value\nWhat is the Fair Price of EMAN when looking at its future cash flows? For this estimate we use a Discounted Cash Flow model.\nDiscounted Cash Flow\nSimply Wall St\nUK£0.48\nFair Value\n13.1% undervalued intrinsic discount\n2\nNumber of Analysts\nBelow Fair Value: EMAN (£0.42) is trading below our estimate of fair value (£0.48)\nSignificantly Below Fair Value: EMAN is trading below fair value, but not by a significant amount.\nKey Valuation Metric\nWhich metric is best to use when looking at relative valuation for EMAN?\nKey metric: As EMAN is unprofitable we use its Price-To-Sales Ratio for relative valuation analysis.\nThe above table shows the Price to Sales ratio for EMAN. This is calculated by dividing EMAN's market cap by their current\nrevenue.\nWhat is EMAN's PS Ratio?\nPS Ratio\n0.4x\nSales\nUK£107.17m\nMarket Cap\nUK£38.30m\nEMAN key valuation metrics and ratios. From Price to Earnings, Price to Sales and Price to Book to Price to Earnings Growth Ratio, Enterprise Value and EBITDA.\nPrice-To-Sales vs Industry: EMAN is good value based on its Price-To-Sales Ratio (0.4x) compared to the European Entertainment industry average (1.9x).\nPrice to Sales Ratio vs Fair Ratio\nWhat is EMAN's PS Ratio\ncompared to its\nFair PS Ratio?\nThis is the expected PS Ratio taking into\naccount the company's forecast earnings growth, profit margins\nand other risk factors.\nEMAN PS Ratio vs Fair Ratio.\nFair Ratio\nCurrent PS Ratio\n0.4x\nFair PS Ratio\n1.2x\nPrice-To-Sales vs Fair Ratio: EMAN is good value based on its Price-To-Sales Ratio (0.4x) compared to the estimated Fair Price-To-Sales Ratio (1.2x).\nAnalyst Price Targets\nWhat is the analyst 12-month forecast and do we have any statistical confidence in the consensus price target?\nThe above table shows the analyst EMAN forecast and predictions for the stock price in 12 month’s time.\nDate\nShare Price\nAverage 1Y Price Target\nDispersion\nHigh\nLow\n1Y Actual price\nAnalysts\nCurrent\nUK£0.42\nUK£1.38\n+227.38%\n16.36%\nUK£1.60\nUK£1.15\nn/a\n2\nAug ’26\nUK£0.42\nUK£1.38\n+227.38%\n16.36%\nUK£1.60\nUK£1.15\nn/a\n2\nJul ’26\nUK£0.41\nUK£1.38\n+235.37%\n16.36%\nUK£1.60\nUK£1.15\nn/a\n2\nJun ’26\nUK£0.41\nUK£1.38\n+239.51%\n16.36%\nUK£1.60\nUK£1.15\nn/a\n2\nMay ’26\nUK£0.41\nUK£1.38\n+235.37%\n16.36%\nUK£1.60\nUK£1.15\nn/a\n2\nApr ’26\nUK£0.38\nUK£1.38\n+266.67%\n16.36%\nUK£1.60\nUK£1.15\nn/a\n2\nAnalystConsensusTarget\nConsensus Narrative from 2 Analysts\nUK£1.38\nFair Value\n69.5% undervalued intrinsic discount\n2\nNumber of Analysts\nAnalyst Forecast: Target price is more than 20% higher than the current share price, but there are not enough analysts covering the stock to determine statistical confidence in agreement.\nDiscover undervalued companies\n7D\n1Y\n7D\n1Y\n7D\n1Y\nCompany Analysis and Financial Data Status\nData\nLast Updated (UTC time)\nCompany Analysis\n2025/09/01 05:55\nEnd of Day Share Price\n2025/08/29 00:00\nEarnings\n2025/01/02\nAnnual Earnings\n2025/01/02\nData Sources\nThe data used in our company analysis is from S&P Global Market Intelligence LLC. The following data is used in our analysis model to generate this report. Data is normalised which can introduce a delay from the source being available.\n* Example for US securities, for non-US equivalent regulatory forms and sources are used.\nUnless specified all financial data is based on a yearly period but updated quarterly. This is known as Trailing Twelve Month (TTM) or Last Twelve Month (LTM) Data. Learn more.\nAnalysis Model and Snowflake\nDetails of the analysis model used to generate this report is available on our Github page, we also have guides on how to use our reports and tutorials on Youtube.\nLearn about the world class team who designed and built the Simply Wall St analysis model.\nIndustry and Sector Metrics\nOur industry and section metrics are calculated every 6 hours by Simply Wall St, details of our process are available on Github.\nAnalyst Sources\nEveryman Media Group plc is covered by 2 analysts. 2 of those analysts submitted the estimates of revenue or earnings used as inputs to our report. Analysts submissions are updated throughout the day."
    }
  ],
  "argos_summary": "Everyman Media Group (LON:EMAN) is valued at UK£0.48 per share using a 2‑stage DCF model, placing its current trading price of UK£0.42 near fair value. The analysis highlights a high industry premium (≈1,276%) and notes the company’s unprofitable status, high debt/equity ratio, and modest revenue growth of 11.2% per year. Despite a fair value discount of about 13%, analyst coverage is limited and the stock’s valuation is considered weak relative to peers. The report underscores the sensitivity of the valuation to discount rate and cash‑flow assumptions, and signals potential upside if the company improves profitability and reduces leverage.",
  "argos_id": "NBCPI6OPS"
}