{
  "url": "https://www.bloomberg.com/news/videos/2025-09-01/chinese-tech-giants-outpace-nasdaq-100-video?srnd=phx-markets",
  "authorsByline": "bn",
  "articleId": "b226a83b68df456ca1274388fd717c4c",
  "source": {
    "domain": "bloomberg.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iA3joRbzYwhI/v3/-1x-1.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-01T05:19:02.548000+00:00",
  "addDate": "2025-09-01T05:28:48.885037+00:00",
  "refreshDate": "2025-09-01T05:28:48.885051+00:00",
  "score": 1.0,
  "title": "Chinese Tech Giants Outpace Nasdaq 100",
  "description": "A grouping of Chinese tech giants has outpaced the Nasdaq 100 in the past year, even as forward valuations for the Chinese names remain much cheaper than those for the US index.\nBut Goldman Sachs Asset Mgmt Co-Head of Public Tech Investing, Sung Cho, tells us why he's still bullish on US tech. (Source: Bloomberg)",
  "content": "Always good to have you in the lions city. So when you take a look at the air play, given that China's air is a much cheaper valuation, subway cheaper than the U.S., why wouldn't you be buying to China than try to keep on, you know, racking up gains in the U.S.? I think I think the rally certainly started in the US, but it has brought it out to areas like China because the applications around air are really start to expand. But let's not forget what's happening at the US markets as well. The US markets historically grew earnings at about six or 7% that year and post I since 2020 to U.S. markets, earnings EPS is growing at double digits. So we've grown from a market that's growing at six or 7% to now a market that's growing at 11 to 12% for the next three years. We think that earnings growth is once again going to be in the double digits. And so you've seen a little bit of an expansion in the absolute valuation in the US, but we think it's much more than justified. The thing is, and video disappointed. Was it a surprise to you? I mean, expectations were sky high. It was kind of bound to disappoint. Yeah. Look, the stock's doubled in a very short period of time, so expectations had certainly got a lot higher. But I think it was a very, very good, good result. And fundamentally, the question around NVIDIA is always what happens to the trajectory of CapEx from these levels? Right? CapEx, remember, at the beginning of the year, the CapEx of the four major HYPERSCALERS was expected to be around $280 billion. You know what that number is now it's $360 billion. And so that's the single biggest KPI that's still impacting NVIDIA. And we think that models are going to get increasingly more competitive. Hyperscalers are chasing after artificial general intelligence. They're not happy with standing still right now. They understand that this is going to be the biggest technology pivot that we've seen in our lifetime and they want to be the leaders. And that race is not slowing down. And until it does, you know, in video is going to continue to be interesting. The thing is, show me the money. CapEx is so high, I want to see the returns and I'm not seeing the kind of returns that I should be seeing if I'm putting that much money. Yeah, So you might start. So part of the reason why Alibaba has been so strong today is because they're actually starting to see the returns around AI as well. You're seeing a lot of consumer Internet platforms, the level that you're investing though. So one interesting stat that in video put out over the last couple of quarters is that if you look at training versus inference workloads, inference is actually the monetization piece. Training is actually the building of the models. Right. We're now crossed over to the point where more than 50% of the workload is on inference relative to training. And so you're actually getting to the point where modernisation is increasing and we're optimistic as we look into 2026 with things like the development of AI agents, the continued monetization of consumer Internet platforms like Meta, Netflix and Spotify. The reason why these stocks have been so strong is because they're using AI and leveraging AI to actually try higher levels of monetization. So there might not necessarily be visible forms of ROI to us right now because enterprise is just getting started, but it's well underway. But you can understand why people are beginning to think about it being a bubble, right, because of the surge in the stock prices. So you're optimistic about the future, but you have changed your mind before. Yeah. Deep SEC moment did prompt you to reassess perhaps your position on in video. What what caused you to rethink again? Yeah. Look, I think what what will cause us to rethink and first of all, we've been talking about an AI tech bubble for the last ten years, right? It's 2015. It's. Oh, it's about bubble 2016. It's a bubble. It's just the reality. And by the way, the reason why is because we had to start such a sharp correction down that there's a rally up has been so powerful that people are saying, hey, we need to be cautious. But if you think about 2025 in isolation, the Nasdaq is up 12% over the last ten years. The Nasdaq has average about a 16% return per year. So we're just really just back on track to where it has been. Right. And if you told me at the start of the year that the single most important KPI for air trade is CapEx and CapEx has gone from 280 billion to 360 billion. And now the trajectory going forward is many, many people think that is going to be more than the size of the US Department of Defense spending, which is crazy to think about. Then you've got to think that the trade continues to have legs. So how do you play this? I mean, do you buy the dip? Yeah, I mean, this is a this is a period of digestion. So like stocks, anytime we dip by every dip, you buy every dip. So you have to think about what's happening and you have to really go into the mindset of these people that are the companies that are spending this large amounts of capital. So if you think about what meta is thinking about is just hiring engineers for $100 million per engineer, Is that because they're going to stop spending on AI tomorrow? No, you have to think about what they're chasing after. And the big goal of what they're trying to chase after is AGI. And AGI is trying to unearth something beyond what humans are capable of today. So how do we cure cancer? How do we solve. Climate change. How do we solve? Like, are there aliens in existence? Right? There's like, things that human intelligence can't currently comprehend. And we're trying to move towards that AGI and we're just scratching the surface on that. I just don't see them slowing down in terms of that. So outside of any kind of big multi standard deviation event where we lead to a big correction. I just think that the medium to long term trajectory of spend is upward, not downward. And so for those reasons I'd probably be buying a lot of the dips. I'm a little bit nervous because I think there are risks there and I guess risk being underpriced right now. How do you hedge? I mean, you know, just in case you're wrong. Yeah. So, look, I think you have to think about it in and one of the things about Goldman is what we try to pride ourselves on is trying to be humble. And anytime the fact pattern changes, we're going to change our opinion as well. Right. At least the investing culture is is that way. And so, you know, we're going to continue to look for signposts that maybe we are wrong on this, including like what? What signposting. So basically, any time that we think there's indicators that the CapEx victory is slowing. Think about it. That's the most important KPI right now in the whole CapEx trade. And so what we're going to look for is any indication that that's slowing down.",
  "medium": "Video",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "air trade",
      "weight": 0.056316614
    },
    {
      "name": "year",
      "weight": 0.0551927
    },
    {
      "name": "big multi standard deviation event",
      "weight": 0.05507698
    },
    {
      "name": "consumer Internet platforms",
      "weight": 0.054888606
    },
    {
      "name": "many people",
      "weight": 0.05422628
    },
    {
      "name": "U.S. markets",
      "weight": 0.05257522
    },
    {
      "name": "higher levels",
      "weight": 0.05091892
    },
    {
      "name": "US",
      "weight": 0.049948808
    },
    {
      "name": "things",
      "weight": 0.049508035
    },
    {
      "name": "people",
      "weight": 0.048889592
    }
  ],
  "topics": [
    {
      "name": "Stocks"
    },
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.9951171875
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.9462890625
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.9404296875
    },
    {
      "name": "/News/Technology News",
      "score": 0.4775390625
    }
  ],
  "sentiment": {
    "positive": 0.34019002,
    "negative": 0.2777906,
    "neutral": 0.3820193
  },
  "summary": "The author discusses the rise in Chinese tech giants, including Alibaba and Microsoft, as well as the US markets, highlighting the expanding applications around air applications. He also discusses the potential for an AI tech bubble in the US, which has seen a sharp increase in earnings for both companies. Despite this, he believes that the US market is growing at double digits and expects double-digit earnings growth for the next three years. The author also highlighted that the most important KPI for the company is CapEx and CapEx spending, which was expected to be around $280 billion at the start of the year, now it's $360 billion. He highlighted that AI is becoming increasingly competitive with hyper-hyperscalers who are chasing artificial general intelligence. However, the author also noted that expectations were high, and the author believes that this is more than justified. The article concludes that while the author's optimism about the future is still being questioned, the article suggests that there's a need to be cautious about the potential of a potential AI bubble. It also mentions that the company's focus is on the development of AI agents, the continued monetisation of consumer Internet platforms like Meta, Netflix and Spotify.",
  "shortSummary": "The recent rally in Chinese tech stocks has driven investment in China's air space and driven growth in other markets, despite concerns over CapEx's high CapEx costs.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "2ea095d8d57b4e3eaad4bcd0c52d08aa",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "The interview discusses the rapid growth of AI spending, especially by hyperscalers like NVIDIA, Meta, and others, noting CapEx has risen from $280 billion to $360 billion and continues to accelerate toward AGI ambitions. It highlights a shift from training to inference workloads, with inference now over 50% of AI usage, driving monetization for consumer platforms. The speaker remains bullish on AI’s long‑term upside but cautions to monitor any signs of CapEx slowdown as a potential risk. Overall, the narrative frames AI investment as a sustained, high‑growth trend with a focus on future breakthroughs rather than short‑term corrections.",
  "argos_id": "PFDIKNS75"
}