{
  "url": "https://www.businessinsider.com/former-microsoft-worker-job-hunt-money-struggles-2025-9",
  "authorsByline": "Jacob Zinkula",
  "articleId": "07d347d965634126aff5614449b09011",
  "source": {
    "domain": "businessinsider.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://i.insider.com/68b1b584a17a8c5b4053b9e6?width=1200&format=jpeg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-01T07:46:02+00:00",
  "addDate": "2025-09-01T07:49:56.055784+00:00",
  "refreshDate": "2025-09-01T07:49:56.055787+00:00",
  "score": 1.0,
  "title": "He once earned 6 figures at Microsoft. Now he's unemployed, burning through savings, and at risk of losing his home.",
  "description": "A former Microsoft worker is struggling to find work amid the tech industry's white-collar hiring slowdown. He's unemployed and burning through money.",
  "content": "Before he was fired last December, Mody Khan was earning a six-figure salary as a cloud solution architect at Microsoft. Nine months into his job search, he's at risk of losing his home.\"I had savings, and I've depleted almost all of it,\" said Khan, who's in his 50s and based in Texas. \"I'm in a very tight spot.\"A new job could stabilize his finances — but despite a five-year run at Microsoft and his prior experience in the tech industry, even landing interviews has been challenging.\"It feels like recruiters are looking for Superman,\" he said.Khan is among the thousands of Microsoft employees who've lost their jobs over the past year. In recent years, Big Tech firms — including Microsoft, Google, Meta, and Amazon — have revamped their performance review and compensation systems to better reward top performers and weed out underperformers in pursuit of smaller, higher-performing teams.Then there are the layoffs. After cutting about 6,000 jobs in May, Microsoft laid off roughly 9,000 more in July. A Microsoft spokesperson previously told Business Insider that the company was focused on reducing management layers and streamlining processes. The cuts have also affected many individual contributor roles.Microsoft isn't alone. Google, Intel, Amazon, and Walmart are among the companies that have also announced plans to reduce the number of managers in a trend dubbed the \"Great Flattening.\"While layoffs across the US economy remain low by historical standards, tech workers have been hit particularly hard. Since the beginning of this year, global tech companies have laid off more than 80,000 workers, according to data from the online tracker Layoffs.fyi. These cuts have come amid a white-collar hiring slowdown.\"I've been constantly applying, and I've had interviews, but I've been turned down everywhere,\" Khan said.Business Insider has heard from dozens of tech workers about how corporate strategy shifts, layoffs, and hiring slowdowns have affected their careers. If you have a story to share, contact this reporter via email at jzinkula@businessinsider.com or Signal at jzinkula.29. Use a personal email address, a nonwork WiFi network, and a nonwork device; here’s our guide to sharing information securely. Read more on the topic:After immigrating to the US from Pakistan in 2007, Khan said he struggled to find high-paying work during the 2008 recession. But over time, his job prospects improved — and he held various tech roles before joining Microsoft in July 2019 as a contract support engineer.He became a full-time employee in May 2020, working as a support escalation engineer. In December 2021, he was promoted to cloud solution architect — a fully remote role he held until his termination in December 2024.Khan's final years at the company were very difficult. He said multiple managers raised concerns about his performance over the years and eventually warned him that his job was in jeopardy.While he made efforts to improve, he said it didn't seem to make a difference — and that he believes his managers didn't give him the support he needed to succeed. He said he often lacked clear guidance on expectations and would have benefited from more constructive feedback and coaching. At times, he said, it felt like his managers were more focused on \"building a case\" against him than helping him improve.At one point, he told his wife that if he ever won even a small lottery jackpot, he'd walk away. The pressure had become too much.\"I hated going from the bedroom to my home office,\" he said. \"I was under so much stress.\"Last December, Khan learned he was being fired for performance reasons and wouldn't be receiving severance pay. He was told he could still apply for other roles at Microsoft — and said he later applied to as many as 30 internal positions — but never received an offer.Khan said he sold some of his Microsoft stock holdings but now has only about $10,000 in \"survival money\" left in his bank account — enough to last him and his wife about two more months. If that runs out, they'd be forced to tap into his remaining investments or 401(k).To make matters worse, they fell behind on their mortgage payments — and if they can't resume payments once their forbearance plan ends in November, they could face foreclosure. The financial toll has also caused his credit score to drop from the high 600s into the 500s in just a few months.Since expanding his search outside Microsoft, Khan said he's managed to land some interviews, but no matter how well they seem to go, none have led to offers.\"I've had so many good interviews where I'm ready for them to say, 'Mody, let's rock 'n' roll' — and then they don't move forward,\" he said.He added that it's particularly frustrating when seemingly promising conversations with recruiters don't end in a clear rejection — but in silence, leaving him unsure whether he was ever truly considered.\"Recruiters contact me, take my résumé, and they ghost me,\" he said.Khan believes a few factors may be hindering his job search. He's concerned that some employers assume, because of his age, that he's not up to date on the latest technologies. To push back on that perception, he said he completed an AI certification through the University of Texas. He added that many of his interviewers appeared to be looking for candidates with startup backgrounds, which made him feel like his experience at a tech giant like Microsoft was almost a strike against him.Additionally, he said he believes his Pakistani background has, at times, been an obstacle. He believes some Indian recruiters or interviewers may carry biases that surface during the hiring process, particularly given long-standing regional and political tensions between India and Pakistan.Khan said he continues to apply to roles every week, hoping that one will finally come through. But with the financial pressure mounting and his savings running low, he said the stakes are getting higher.\"It's a very, very dangerous situation,\" he said.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Microsoft employees",
      "weight": 0.0694136
    },
    {
      "name": "Microsoft",
      "weight": 0.06542954
    },
    {
      "name": "Mody Khan",
      "weight": 0.065043606
    },
    {
      "name": "various tech roles",
      "weight": 0.06337923
    },
    {
      "name": "global tech companies",
      "weight": 0.06256955
    },
    {
      "name": "tech workers",
      "weight": 0.06058015
    },
    {
      "name": "Khan",
      "weight": 0.059987016
    },
    {
      "name": "many individual contributor roles",
      "weight": 0.05491843
    },
    {
      "name": "recent years",
      "weight": 0.04880361
    },
    {
      "name": "final years",
      "weight": 0.048761837
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Business & Industrial/Business Operations/Human Resources",
      "score": 0.81201171875
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.7744140625
    },
    {
      "name": "/Jobs & Education/Jobs/Job Listings",
      "score": 0.646484375
    },
    {
      "name": "/Jobs & Education/Jobs/Career Resources & Planning",
      "score": 0.449462890625
    }
  ],
  "sentiment": {
    "positive": 0.029337773,
    "negative": 0.8473866,
    "neutral": 0.123275615
  },
  "summary": "Mody Khan, a cloud solution architect at Microsoft, was fired in December for performance reasons and is now unemployed, burning through savings, and at risk of losing his home. Despite his five-year tenure at Microsoft and his prior experience in the tech industry, he has been unable to land a new job. Despite Microsoft cutting about 6,000 jobs in May, it laid off roughly 9,000 more in July. The company is focusing on reducing management layers and streamlining processes, and individual contributor roles. Other tech companies, including Microsoft, Google, Meta, and Amazon, have also announced plans to reduce the number of managers in a trend dubbed the \"Great Flattening.\" While layoffs across the US economy have been low by historical standards, tech workers have been particularly hit by this trend. Business Insider has heard from dozens of tech workers about how corporate strategy shifts, layoffs, and hiring slowdowns have affected their careers.",
  "shortSummary": "Mody Khan, once a major Microsoft employee, is struggling with financial struggles due to job cuts and corporate strategy shifts.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "ff9335a574074002b40eca9f9069e083",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Mody Khan, a former Microsoft cloud solution architect, was laid off in December 2024 after a series of performance concerns and is now facing financial hardship with limited savings and a looming mortgage default. His job search has been hampered by age bias, perceived lack of startup experience, and possible regional discrimination, despite completing an AI certification. The article highlights broader tech layoffs—Microsoft, Google, Amazon, and others have cut thousands of jobs amid a hiring slowdown—illustrating the sector’s tightening labor market and the challenges mid-career tech professionals face in securing new roles.",
  "argos_id": "QH2DA7YYD"
}