{
  "url": "https://www.zdnet.com/article/google-pixel-10-pro-fold-vs-samsung-galaxy-z-fold-7-heres-the-clear-winner-after-testing-both/",
  "authorsByline": "Prakhar Khanna",
  "articleId": "d5fc785e11d04709a0db4bb72e8c6c05",
  "source": {
    "domain": "zdnet.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://www.zdnet.com/a/img/resize/8e8daae08e16402de788ddcb8a8a62864457f3a1/2025/08/20/00f9a70a-aca1-4f65-9609-fabb12c054bc/google-pixel-10-pro-fold-vs-samsung-galaxy-z-fold-7.jpg?auto=webp&fit=crop&height=675&width=1200",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-01T09:00:17+00:00",
  "addDate": "2025-09-01T09:08:48.434944+00:00",
  "refreshDate": "2025-09-01T09:08:48.434946+00:00",
  "score": 1.0,
  "title": "Google Pixel 10 Pro Fold vs. Samsung Galaxy Z Fold 7: Here's the clear winner after testing both",
  "description": "Samsung and Google's new foldables target different types of users - here's the one that's right for you.",
  "content": "The Google Pixel 10 Pro Fold has finally arrived, and it isn't taking on the Galaxy Z Fold 7 with a generational design leap. Instead, it competes by adding quality-of-life features -- a couple of which are industry-firsts for a foldable phone.\n\nIf you are ready to upgrade from a slab phone to a foldable one, now is the best time to do so. However, it can be confusing to make a decision when both Google and Samsung book-style foldables are so good this year.\n\nAlso: I ran a 100x camera zoom test with the Pixel 10 Pro and Samsung S25 Ultra - and there's a clear winner\n\nHere's how the new Google Pixel 10 Pro Fold compares to the Samsung Galaxy Z Fold 7, and which one is the best for you.\n\nGet more in-depth ZDNET tech coverage: Add us as a preferred Google source on Chrome and Chromium browsers.\n\nYou should buy the Google Pixel 10 Pro Fold if…\n\nThe Pixel 10 Pro Fold is the first book-style foldable to sport an IP68 rating, which means it is truly resistant against minute dust particles. In comparison, the Galaxy Z Fold 7 is rated IP48 for dust and water resistance, so it is protected against solid particles bigger than 1 millimeter. Since dust particles are smaller than 1mm, there's no guarantee that a Z Fold 7 will do well against dust.\n\nAlso: Google just settled the foldable phone debate with one number -- and I hope Samsung is watching\n\nIf you live in a place susceptible to dust or work in a dusty environment, the Google foldable will serve you better. It isn't dustproof, per se, but you can get extra peace of mind when using it in those environments.\n\n2. You are shifting from an iPhone\n\nIf you can't wait for a foldable iPhone and want to switch to a book-style foldable this year, the Pixel 10 Pro Fold is the phone to buy. While switching to a Samsung foldable is equally easy/tedious, you'll be able to retain your iPhone's MagSafe-compatible accessories if you buy the Google foldable.\n\nThe Pixel 10 series comes with a new feature called PixelSnap. It is like MagSafe, where you get magnets to attach a slew of accessories. The new tech is based on Qi2 standards and offers 15W wireless charging on the Pixel 10 Pro Fold. So, if you have MagSafe-compatible charging pads, power banks, or even tripods, they should theoretically be compatible with the new Google phones. This makes shifting to an Android foldable easier for an iPhone user.\n\n3. You want a more affordable folding phone\n\nThe Samsung Galaxy Z Fold 7 is one of the best (if not the best) book-style foldables you can buy right now. It weighs less than most slab flagship phones and feels like a 'normal' phone in the hand. But it also carries a massive $2000 price tag. If you don't want to spend two grand on your new phone, the Google Pixel 10 Pro Fold is the way to go.\n\nAlso: I went hands-on with every Google Pixel 10 model - and was surprised by the one I loved most\n\nThe new Google foldable undercuts its Samsung rival by $200. The base 256GB storage variant is priced at $1,800. You can currently purchase the Galaxy Z Fold 7 for as low as $1,700 on Amazon, but that's the current discount price. Once it goes on sale, you should be able to find discounts on the Pixel foldable, too.\n\n4. You want to use all the Gemini AI features for a year\n\nIf you are new to the AI world and want to try the best of Google AI features for free, Pixel 10 Pro Fold is the way to go. The company is offering a year's worth of Gemini AI Pro subscription for free with its Pixel 10 Pro series. This means you can get enhanced features like access to Gemini 2.5 Pro, Veo 3 for AI-generated videos, 2TB of cloud storage, and previews of upcoming AI tools. By contrast, Samsung is giving six months of free access to the same service with its Galaxy Z Fold 7.\n\nYou should buy the Samsung Galaxy Z Fold 7 if…\n\n1. You want the slimmest and lightest folding phone\n\nI love my Galaxy Z Fold 7 for its slim and light design. In fact, it is more comfortable to hold and use than big flagship phones like the iPhone 16 Pro Max and Samsung's own Galaxy S25 Ultra. At 215 grams, it is one of the most comfortable phones to use on the market right now. Plus, it measures just 8.9mm when folded and 4.2mm when unfolded, which feels surreal at times.\n\nAlso: I spent a week in New York City with the Samsung Z Fold 7 - and it spoiled me the entire time\n\nSamsung has almost perfected the form factor with its latest foldable. If you want a foldable phone without the foldable design quirks, the Galaxy Z Fold 7 is the phone for you (if you are a right-hander, because hinge edges are still very sharp for left-handed people).\n\nWhen I first unboxed the Galaxy Z Fold 7, I was amazed by the inner screen's flatness when I rubbed my hand over it. If you have used a folding phone before but couldn't live with it because of a gigantic crease running down the middle of its big screen, the Galaxy Z Fold 7 will be a breath of fresh air for you.\n\nSamsung's new folding phone features the smallest crease in its segment. You can still see it at certain angles, but it won't bother you at all. In comparison, Google's crease situation still needs work.\n\n3. You want a polished suite of AI features\n\nThe Samsung Galaxy Z Fold 7 can run Gemini, but the Pixel 10 Pro Fold can't run Galaxy AI features. That's not to say the Google phone doesn't have exclusives. The new Magic Cue and Camera Coach features are worth trying.\n\nAlso: PixelSnap is the MagSafe for Android phones we've been waiting for - here's our first look\n\nHowever, Galaxy AI has a more tried-and-tested suite of comparatively more polished AI features, such as AI Select, a damn good object eraser, and more. You can also avail free six months of Gemini AI Pro to try Veo 3, NotebookLM, etc., with the Galaxy Z Fold 7.\n\n4. You want to buy a foldable in the next few weeks\n\nIf you want to buy a new folding phone in the next month, the Galaxy Z Fold 7 is your only choice because the Google Pixel 10 Pro Fold won't go on sale till October 9. That's seven weeks after launch. By contrast, the Galaxy Z Fold 7 is already available and might persuade potential Pixel buyers, especially at the new price.\n\nI have yet to use the Pixel 10 Pro Fold as a daily driver, so I don't have an opinion on the cameras or battery life. While it packs a bigger cell than its counterpart, I'll only be able to tell the difference after I have used it in daily life. Both phones run Android 16 out of the box and are promised to receive up to seven years of OS and Android security updates, so they should last long.",
  "medium": "Article",
  "links": [
    "https://www.anrdoezrs.net/links/9041660/type/dlg/sid/subid_value/https://store.google.com/magazine/google_pixel_10?hl=en-US",
    "https://www.zdnet.com/article/i-spent-a-week-in-new-york-city-with-the-samsung-z-fold-7-and-it-spoiled-me-the-entire-time/",
    "https://www.zdnet.com/article/googles-gemini-2-5-pro-update-makes-the-ai-model-even-better-at-coding/#link=%7B%22role%22:%22standard%22,%22href%22:%22https://www.zdnet.com/article/googles-gemini-2-5-pro-update-makes-the-ai-model-even-better-at-coding/%22,%22target%22:%22%22,%22absolute%22:%22%22,%22linkText%22:%22Gemini%202.5%20Pro%22%7D",
    "https://www.zdnet.com/article/i-ran-a-100x-camera-zoom-test-with-the-pixel-10-pro-and-samsung-s25-ultra-and-theres-a-clear-winner/",
    "https://www.zdnet.com/article/pixelsnap-is-the-magsafe-for-android-phones-weve-been-waiting-for-heres-our-first-look/",
    "https://www.zdnet.com/article/45-windows-keyboard-shortcuts-i-use-to-instantly-boost-my-productivity/",
    "https://www.zdnet.com/article/changing-these-10-settings-on-my-samsung-phone-greatly-improved-the-user-experience/",
    "https://www.zdnet.com/article/samsungs-new-galaxy-ai-features-are-what-iphone-users-wish-they-got-with-apple-intelligence/",
    "https://www.zdnet.com/article/i-went-hands-on-with-every-google-pixel-10-model-and-was-surprised-by-the-one-i-loved-most/",
    "https://www.zdnet.com/article/meta-might-be-secretly-scanning-your-phones-camera-roll-how-to-check-and-turn-it-off/",
    "https://www.zdnet.com/article/google-pixel-10-pro-vs-iphone-16-pro-ive-used-both-handsets-and-theres-a-clear-winner/",
    "https://www.zdnet.com/article/googles-veo-3-ai-video-generator-is-now-available-to-everyone-heres-how-to-try-it/#link=%7B%22role%22:%22standard%22,%22href%22:%22https://www.zdnet.com/article/googles-veo-3-ai-video-generator-is-now-available-to-everyone-heres-how-to-try-it/%22,%22target%22:%22%22,%22absolute%22:%22%22,%22linkText%22:%22Veo%203%22%7D",
    "https://www.zdnet.com/article/google-just-settled-the-foldable-phone-debate-with-one-number-and-i-hope-samsung-is-watching/#link={%22role%22:%22standard%22,%22href%22:%22https://www.zdnet.com/article/google-just-settled-the-foldable-phone-debate-with-one-number-and-i-hope-samsung-is-watching/%22,%22target%22:%22_blank%22,%22absolute%22:%22%22,%22linkText%22:%22Google%20just%20settled%20the%20foldable%20phone%20debate%20with%20one%20number%20--%20and%20I%20hope%20Samsung%20is%20watching%22}",
    "https://shop-links.co/link/?url=https%3A%2F%2Fwww.samsung.com%2Fus%2Fsmartphones%2Fgalaxy-z-fold7%2Fbuy%2Fgalaxy-z-fold7-512gb-unlocked-sku-sm-f966uzkexaa%2F&publisher_slug=zdnet&article_name=__ARTICLE_NAME__&article_url=__ARTICLE_URL__&exclusive=1&u1=subid_value",
    "https://www.zdnet.com/article/i-retested-gpt-5s-coding-skills-using-openais-guidance-and-now-i-trust-it-even-less/",
    "https://www.google.com/preferences/source?q=zdnet.com"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Samsung Galaxy Z Fold",
      "weight": 0.12303643
    },
    {
      "name": "Galaxy AI features",
      "weight": 0.09373332
    },
    {
      "name": "Google AI features",
      "weight": 0.09117714
    },
    {
      "name": "Galaxy AI",
      "weight": 0.086847894
    },
    {
      "name": "Android phones",
      "weight": 0.08264354
    },
    {
      "name": "Gemini AI Pro",
      "weight": 0.08256672
    },
    {
      "name": "big flagship phones",
      "weight": 0.0813664
    },
    {
      "name": "The Samsung Galaxy Z Fold",
      "weight": 0.078483455
    },
    {
      "name": "the Samsung Galaxy Z Fold",
      "weight": 0.078483455
    },
    {
      "name": "Gemini AI Pro subscription",
      "weight": 0.07808899
    }
  ],
  "topics": [
    {
      "name": "Google Pixel"
    },
    {
      "name": "Android"
    },
    {
      "name": "Electronics"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Computers & Electronics/Software/Operating Systems",
      "score": 0.845703125
    },
    {
      "name": "/Shopping/Consumer Resources/Product Reviews & Price Comparisons",
      "score": 0.763671875
    },
    {
      "name": "/News/Technology News",
      "score": 0.7236328125
    },
    {
      "name": "/Internet & Telecom/Mobile & Wireless/Mobile Phones",
      "score": 0.68701171875
    }
  ],
  "sentiment": {
    "positive": 0.42953423,
    "negative": 0.09373621,
    "neutral": 0.47672957
  },
  "summary": "The Google Pixel 10 Pro Fold has been released, beating the Samsung Galaxy Z Fold 7 by $200. The new phone offers more quality-of-life features than its rival, including IP68 rating for dust and water resistance, which are industry-firsts for a foldable phone. While the Galaxy Z fold 7 is rated IP48, the Google foldable is protected against solid particles bigger than 1 millimeter. The Pixel 10 series also comes with a new feature called PixelSnap, which allows magnets to attach various accessories. The company is offering a year's worth of Gemini AI Pro subscription for free, while Samsung is offering six months of free service with its Galaxy Z folding phone. However, switching to an Android foldable can be difficult.",
  "shortSummary": "The Google Pixel 10 Pro Fold offers superior design and features, but Samsung Galaxy Z Fold 7 offers better quality-of-life and affordable options.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "2f68774a298c40aa9f4f8a04bcf7a874",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.zdnet.com/article/i-ran-a-100x-camera-zoom-test-with-the-pixel-10-pro-and-samsung-s25-ultra-and-theres-a-clear-winner/",
      "text": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nI replaced my Samsung Galaxy S25 Ultra with the Pixel 10 Pro XL for a week - and can't go back\nGoogle Pixel 10 Pro and Pro XL\nZDNET's key takeaways\n- The latest Pixel flagships are priced the same as last year, but get meaningful upgrades across the board.\n- The Pro XL model, with its base storage of 256GB and faster wired and wireless charging, is the best Pixel phone right now.\n- You'll just have to settle for the same design and camera hardware as last year.\nFollow ZDNET: Add us as a preferred source on Google.\nIt's hard to believe that we're officially at year 10 for the Google Pixel, but even just a look back at the past three generations of the search giant's phone lineup paints a clear picture of its maturity and where things are headed.\nCase in point, the Pixel 10 Pro series, consisting of the Pixel 10 Pro and Pixel 10 Pro XL, is, at first glance, a safe upgrade. Their designs look nearly identical to last year's models, you'll struggle to spot the differences in specs between the 10th and 9th generations, and they're priced squarely in the threshold of modern flagships.\nAlso: I compared the Pixel 10 Pro to every older Google flagship model - the biggest upgrades\nBut they also have a software suite that truly advances the way we interact with our smartphones -- or at least, that was my takeaway after using the phones for the past week. With the Pixel 10 series (standard model included), I've never been more convinced that AI on phones is here to stay. It doesn't have to be forced, intrusive, or excessive; it just has to be intelligent enough to know its place.\nBefore I dive into all the AI madness, there's a critical topic that deserves just as much attention: eSIM. It's the first hurdle every new Pixel 10 owner (in the US) will encounter -- whether they're switching from an older Pixel or jumping ship from an iPhone -- and thankfully, it's one Google has made surprisingly painless.\nTo compare the setup processes, I ported my physical SIM from T-Mobile onto the Pixel 10 Pro XL and my secondary eSIM from Mint Mobile onto the Pixel 10 Pro. Both methods took less than five minutes and were only a few QR code scans away from working cellular connections.\nAlso: Google made a bold move with the Pixel 10, even if it's not obvious yet. Here's why\nI'd never had a more burdenless interaction at my local carrier shop, but something did catch me off guard. At one point, the T-Mobile associate congratulated me on switching to a Google Pixel 9 Pro XL. That's not a typo. With the Pixel 10 Pro series, the year-over-year difference in hardware design is at an all-time low, and I don't blame Google for that -- or the associate for mixing up the models.\nThe contoured edges still greet your fingers with a warm embrace, the polished aluminum frame exudes premium, and the camera bar constantly reminds you how seriously Google takes its mobile optics.\nAllow me to chase my geekery with one of the few downsides of this year's Pixel design: the weight. At 232 grams, the Pixel 10 Pro XL is one of the heaviest phones on the market, beating my previous daily driver, the Samsung Galaxy S25 Ultra (218 grams), and iPhone 16 Pro Max (227 grams). The phone isn't necessarily top or bottom-heavy, either, meaning you'll feel the slow build-up of wrist strain no matter how you hold the device up.\nGoogle tells me there are several reasons why its phones weigh more this year, which I can only nod in approval to. First, the Pixel 10 Pro series features upgraded top and bottom speakers, producing a change in loudness that I noticed almost immediately when playing my usual recipe videos by J. Kenji López-Alt in the kitchen.\nThe Pixel 10 Pro and Pro XL also have larger 4,870 and 5,200mAh batteries, respectively, up from last year's 4,700 and 5,070mAh capacities. Throughout the weekend, I was ending my days with roughly 35% of battery remaining on the XL model, a minor but still appreciated improvement over its predecessor. The faster 45W wired charging, exclusive to the XL, was another welcome touch.\nPerhaps the biggest new feature, and the one that may be most effective in convincing iPhone users to switch over, is Pixelsnap, a system of in-body magnets that can pull in wireless power at the Qi2 standard. Think MagSafe for Android. This enables the phones to snap onto the thousands of magnet-based accessories on the market, from tripod stands to wallet cases to charging docks.\nAlso: The best Google Pixel 10 and Pixel 10 Pro cases of 2025\nGoogle has fully embraced the technology by offering a slew of screen savers that appear when you're charging its Pixel 10 phones. These include a full-scale weather display, a Google Photos slideshow, smart home controls, and a clock. As someone who often sets their phone on a wireless charging stand bedside and at the office desk, the ambient feature is easy to appreciate.\nThe option to proc the screen saver when the Pixel 10 Pro is charging or charging and set upright is a nice touch. You can also restrict the feature to when the device is in wireless charging only, as it would otherwise appear with even a wired connection.\nHowever, the screen savers aren't perfect. For one, the weather panel, especially when I saw it demoed on the Pixel 10 Pro Fold at the Made by Google event, can appear too conspicuous and display an excessive amount of information for what will likely be something I look at every half an hour. And while the clock screen saver can also display the temperature, it doesn't show incoming notifications, making it feel more like a downgraded always-on display.\nAlso: I'm a longtime iPhone user, but Google just sold me on the Pixel 10 with these features\nOne of the looming questions going into my Pixel 10 Pro testing was how significant an upgrade the new Tensor G5 chipset brings. Since Google took the matter of processing power and silicon into its own hands, the brand has always played second fiddle to Qualcomm's Snapdragon models. Based on benchmarks, that still holds true, with the Tensor G5 performing worse than the Snapdragon 8 Elite found on competing flagship phones.\nBut from a more practical outlook, I've found the Tensor G5 still capable enough to operate under intense workloads, from editing HDR, 60fps videos to gaming to running Android Auto navigation while on a call. The in-house processor, which features a modified architecture that dynamically shifts between full and sub models, is truly realized in the various new AI features on the Pixel 10 Pro series.\nI'm talking faster compute times across Pixel Screenshots, Recorder transcriptions and translations, and other native AI tasks that would typically take seconds longer. That saved time adds up, folks.\nAlso: 7 AI features I'd like to see the iPhone 17 embrace from Google, OpenAI, and others\nA standout AI feature for me is Magic Cue, which, when it works most often, sifts through your Gmail, Calendar, and other Google services to populate relevant information and context when and where it makes sense. I recently booked the wrong return flight for a work trip, and during my call with United, Magic Cue displayed my flight and account information on the phone app screen, reducing the friction of me parsing through my Gmail and the various confirmation messages that typically come with booking flights.\nIt's this seamless, intuitive integration of AI that keeps catching me off guard - in the best way. That carries through to the cameras, a familiar assembly of 50MP wide, 48MP ultrawide, and 48MP telephoto sensors. The most notable change with the Pixel 10 Pro camera is the Tensor G5 chip's enhanced image signal processing (ISP) and the slew of AI tricks that it handles.\nI took hundreds of photos over the past week with the Pixel 10 Pro XL, 9 Pro XL, and Galaxy S25 Ultra, and I found the former to deliver the ideal combination of colors, shadows, and highlights. The improved image stabilization on the main lens also helps preserve detail with fast-moving subjects and low-lit photography.\nAlso: Pixel just zoomed ahead of iPhone in the camera photography race\nWhere the Pixel 10 Pro camera truly shines this year is in far-distance capturing, thanks to a new Pro Res Zoom that uses generative AI to correct noise and distortion. It's a touchy subject, I know, but the output, even at 100X zoom, is what customers who favor idealism over realism and convenience over labor have been waiting for. The difference between the Pixel Pro Res Zoom and Samsung's Space Zoom leans heavily in Google's favor.\nThe AI-enhanced zoom on the Pixel 10 Pro series isn't flawless -- at times, it overcorrects and makes people look like sci-fi characters. But when it works, which is at a 95% success rate for me, it's genuinely impressive.\nCamera Coach is the other big new AI feature within the camera app, and I found the on-screen instructions easy to follow, clear to understand, and flexible enough to capture various shots of the same subject. Where it falls short is in capturing moving objects like impatient children or speeding vehicles, as going through the tips and tricks requires time and constant focus. So long as you're leaving the camera app with one helpful takeaway each time you use the feature, I'd consider that a win for Google.\nZDNET's buying advice\nThere's still plenty to unpack with the Pixel 10 Pro series, but my first week with the devices has shown me what living with AI superphones feels like. For longtime Pixel users eyeing an upgrade, both models are a no-brainer -- showcasing Google's best hardware to date and an Android 16 experience that feels tastefully familiar, delightfully playful, and genuinely useful.\nThe Pixel 10 Pro is the way to go for users who prefer a more ergonomic and comfortable mobile experience. If mobile entertainment and fast charging are high on your priority list, consider the Pixel 10 Pro XL. The larger model costs $100 more than last year, but it also starts with 256GB of storage (versus 128GB), so the $1,199 may be easier to justify.\nAs always, consider the various trade-in offers and promotions from your carriers and big-box retailers. There's a good chance you'll score a couple of hundred dollars off with minimum effort.\nHow we test phones\nZDNET's review team spends upwards of a year testing the ins and outs of every major phone release, evaluating the day-to-day performance, camera quality, battery life and endurance, and special features. Here's a breakdown of every factor we consider before we make recommendations:\n- Design and ergonomics: How good a phone looks and feels plays a big role in many users' buying journeys, so we consider these aspects heavily when testing.\n- Performance: Several factors affect a phone's performance, including LTE/5G signal, battery life, and background tasks. Therefore, we typically begin our evaluations with a fully charged handset, all background tasks closed, and as stable a mobile connection as possible.\n- Camera quality: ZDNET tests phone cameras by capturing hundreds of photos and videos of various subjects and in various lighting conditions. We also compare the output to that of older models.\n- Battery life and charging: It's also important for us to evaluate how long phones last under light, moderate, and heavy usage, how long they take to recharge, and how they do it (wired, wireless, or both).\n- Special features: These features distinguish tested devices from a bustling smartphone market and hopefully bring added value to users, not the opposite.\n- Pricing and availability: Beyond budget considerations, we also note if a phone is available in the US or only internationally.\nFor a more extensive breakdown, check out our comprehensive phone testing methodology page."
    },
    {
      "url": "https://www.zdnet.com/article/google-just-settled-the-foldable-phone-debate-with-one-number-and-i-hope-samsung-is-watching/#link={%22role%22:%22standard%22,%22href%22:%22https://www.zdnet.com/article/google-just-settled-the-foldable-phone-debate-with-one-number-and-i-hope-samsung-is-watching/%22,%22target%22:%22_blank%22,%22absolute%22:%22%22,%22linkText%22:%22Google%20just%20settled%20the%20foldable%20phone%20debate%20with%20one%20number%20--%20and%20I%20hope%20Samsung%20is%20watching%22}",
      "text": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nGoogle just gave the Pixel foldable phone its most important upgrade yet - and Samsung should follow suit\nZDNET's key takeaways\n- Pixel 10 Fold is first foldable with IP68 dust, water rating.\n- Pixel 10 Pro Fold resists dust better than rival foldables.\n- One of few upgrades in Google's $1,799 foldable.\nGet more in-depth ZDNET tech coverage: Add us as a preferred Google source on Chrome and Chromium browsers.\nDid Google just pull off the impossible? At its Made by Google hardware event this week, the company unveiled its new Pixel 10 Pro Fold, a $1,799 foldable phone that's the first of its kind to feature an IP68 rating.\nThose two digits -- especially the first one -- are really important, whether you're a frequent beach goer or often find a pile of dust and debris when you pull your phone out of your pocket. An IP68 rating represents the device's Ingress Protection code, a compliance standard for how well it can resist water and dust.\nAlso: Everything announced at Made by Google 2025: Pixel 10 Pro, Fold, Watch 4, and more\nWhile foldable phones like the Samsung Galaxy Z Fold 7 have long offered water resistance (IPX8), their vulnerability to dust and small particles has made many consumers hesitant to commit -- especially at premium prices. That's why the Pixel 10 Pro Fold's IP68 rating is as noteworthy as it is.\nThe enhanced durability should greatly reduce the likelihood of the phone being damaged by everyday wear, particle intrusion, and more. An IP68 rating also puts the Pixel 10 Pro Fold in the same protection level as traditional slab phones -- it's quite the feat considering how difficult it is to design a device with moving parts that also withstand dust and debris.\nAlso: The best flip phones of 2025: Where does the Samsung Galaxy Z Flip 7 stand?\nGoogle says the Pixel 10 Pro Fold features a remodeled hinge, with a gearless, high-strength beam system made from spacecraft-grade materials. You're looking at a foldable phone that's advertised to withstand more than 10 years of folding.\nThe redesigned interior also gave room for Google to squeeze in a larger 5,010mAh battery (up from last year's 4,650mAh) as well as magnetic adapters for PixelSnap accessories -- think MagSafe for Android.\nAlso: Finally, Pixel 10 ends Android's MagSafe envy with its new PixelSnap feature\nHow significant is the Pixel 10 Pro Fold's durability upgrade to you? Does the IP68 rating make it a more enticing option than other foldable phones? Sound off in the comments below.\nGet the morning's top stories in your inbox each day with our Tech Today newsletter."
    },
    {
      "url": "https://www.anrdoezrs.net/links/9041660/type/dlg/sid/subid_value/https://store.google.com/magazine/google_pixel_10?hl=en-US",
      "text": "- EnglishUnited States\n- Deutsch\n- English\n- Español\n- Français\n- Italiano\n- Svenska\n- All languages\n- Afrikaans\n- azərbaycan\n- bosanski\n- català\n- Čeština\n- Cymraeg\n- Dansk\n- Deutsch\n- eesti\n- EnglishUnited Kingdom\n- EspañolEspaña\n- EspañolLatinoamérica\n- euskara\n- Filipino\n- FrançaisCanada\n- FrançaisFrance\n- Gaeilge\n- galego\n- Hrvatski\n- Indonesia\n- isiZulu\n- íslenska\n- Italiano\n- Kiswahili\n- latviešu\n- lietuvių\n- magyar\n- Melayu\n- Nederlands\n- norsk\n- o‘zbek\n- polski\n- PortuguêsBrasil\n- PortuguêsPortugal\n- română\n- shqip\n- Slovenčina\n- slovenščina\n- srpski (latinica)\n- Suomi\n- Svenska\n- Tiếng Việt\n- Türkçe\n- Ελληνικά\n- беларуская\n- български\n- кыргызча\n- қазақ тілі\n- македонски\n- монгол\n- Русский\n- српски\n- Українська\n- ქართული\n- հայերեն\n- עברית\n- اردو\n- العربية\n- فارسی\n- አማርኛ\n- नेपाली\n- मराठी\n- हिन्दी\n- অসমীয়া\n- বাংলা\n- ਪੰਜਾਬੀ\n- ગુજરાતી\n- ଓଡ଼ିଆ\n- தமிழ்\n- తెలుగు\n- ಕನ್ನಡ\n- മലയാളം\n- සිංහල\n- ไทย\n- ລາວ\n- မြန်မာ\n- ខ្មែរ\n- 한국어\n- 日本語\n- 简体中文\n- 繁體中文\n- 繁體中文香港\n- EnglishUnited States\n- Deutsch\n- English\n- Español\n- Français\n- Italiano\n- Svenska\n- All languages\n- Afrikaans\n- azərbaycan\n- bosanski\n- català\n- Čeština\n- Cymraeg\n- Dansk\n- Deutsch\n- eesti\n- EnglishUnited Kingdom\n- EspañolEspaña\n- EspañolLatinoamérica\n- euskara\n- Filipino\n- FrançaisCanada\n- FrançaisFrance\n- Gaeilge\n- galego\n- Hrvatski\n- Indonesia\n- isiZulu\n- íslenska\n- Italiano\n- Kiswahili\n- latviešu\n- lietuvių\n- magyar\n- Melayu\n- Nederlands\n- norsk\n- o‘zbek\n- polski\n- PortuguêsBrasil\n- PortuguêsPortugal\n- română\n- shqip\n- Slovenčina\n- slovenščina\n- srpski (latinica)\n- Suomi\n- Svenska\n- Tiếng Việt\n- Türkçe\n- Ελληνικά\n- беларуская\n- български\n- кыргызча\n- қазақ тілі\n- македонски\n- монгол\n- Русский\n- српски\n- Українська\n- ქართული\n- հայերեն\n- עברית\n- اردو\n- العربية\n- فارسی\n- አማርኛ\n- नेपाली\n- मराठी\n- हिन्दी\n- অসমীয়া\n- বাংলা\n- ਪੰਜਾਬੀ\n- ગુજરાતી\n- ଓଡ଼ିଆ\n- தமிழ்\n- తెలుగు\n- ಕನ್ನಡ\n- മലയാളം\n- සිංහල\n- ไทย\n- ລາວ\n- မြန်မာ\n- ខ្មែរ\n- 한국어\n- 日本語\n- 简体中文\n- 繁體中文\n- 繁體中文香港\nBefore you continue to Google\nWe use cookies and data to\n- Deliver and maintain Google services\n- Track outages and protect against spam, fraud, and abuse\n- Measure audience engagement and site statistics to understand how our services are used and enhance the quality of those services\nIf you choose to “Accept all,” we will also use cookies and data to\n- Develop and improve new services\n- Deliver and measure the effectiveness of ads\n- Show personalized content, depending on your settings\n- Show personalized ads, depending on your settings\nIf you choose to “Reject all,” we will not use cookies for these additional purposes.\nNon-personalized content is influenced by things like the content you’re currently viewing, activity in your active Search session, and your location. Non-personalized ads are influenced by the content you’re currently viewing and your general location. Personalized content and ads can also include more relevant results, recommendations, and tailored ads based on past activity from this browser, like previous Google searches. We also use cookies and data to tailor the experience to be age-appropriate, if relevant.\nSelect “More options” to see additional information, including details about managing your privacy settings. You can also visit g.co/privacytools at any time."
    },
    {
      "url": "https://www.zdnet.com/article/meta-might-be-secretly-scanning-your-phones-camera-roll-how-to-check-and-turn-it-off/",
      "text": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nMeta might be secretly scanning your phone's camera roll - how to check and turn it off\nFollow ZDNET: Add us as a preferred source on Google.\nZDNET's key takeaways\n- Meta could be scanning your camera roll right now.\n- It's using your photos to provide AI-powered suggestions.\n- Check Facebook settings to turn off the features.\nMeta could be analyzing and retaining your phone's photos without your explicit consent.\nSome Facebook users have noticed that, deep within their app settings, Meta has switched on two toggles that allow it to access their camera roll to offer AI-powered suggestions, including \"personalized creative ideas, like travel highlights and collages.\"\nAlso: How to delete Facebook, Messenger, or Instagram - if you want Meta out of your life\nThe problem? The toggles for the AI suggestion features, called \"camera roll sharing suggestions,\" appear to be turned on for users who claim they haven't seen a pop-up from Facebook asking for permission to enable them. If you get that \"cloud processing\" pop-up and tap \"Allow\" on it, you'll agree to Meta's AI Terms of Service and permit your \"media and facial features\" to be analyzed by AI.\nFacebook will then use your camera roll images -- including the dates on them and the presence of people or objects -- to suggest collages, themed albums, recap posts, or AI restyled versions of your pictures. These AI suggestions are only visible to you, unless you choose to share them, and Meta says the media won't be used for ad targeting.\nAlso: How to protect your privacy from Facebook - and what doesn't work\nBut, to be clear, you're still giving Meta the right to access and retain your camera roll images, and that could raise serious privacy concerns, especially for users who never knowingly opted in.\nZDNET's editorial director found Meta's camera roll sharing suggestions enabled in her Facebook app without her knowledge. I also noticed they were enabled for me, although I vaguely recall seeing a pop-up from Facebook about the new features a few weeks ago. I think I dismissed it quickly, and I can't remember whether I tapped Allow or Don't allow on it.\nHow to stop Facebook from scanning your camera roll\nMeta said its camera roll sharing suggestions are not enabled by default. If you're worried you dismissed Facebook's pop-up, unknowingly opted-in, and gave access to your camera roll, here's how to check and turn it off.\n1. Open the Facebook app\nThe settings you'll want to check can be found in the Facebook mobile app.\n- Grab your iPhone or Android phone.\n- Open the Facebook app. You'll need to be signed into your account.\n2. Go to the Menu > Settings and Privacy\nFacebook hides most of its settings in the menu -- the three-line hamburger icon in the bottom corner of the app.\n- Tap the Menu icon in the bottom right corner of the screen.\nOnce the menu opens, look for Settings and Privacy with a gear icon. This will take you directly to Settings.\n3. Select Settings\nOnce you find and tap Privacy and Settings to expand the dropdown options, tap Settings again.\n- Under Settings and Privacy, tap Settings.\n- Now, scroll down and look for \"Camera roll sharing suggestions.\"\n4. Go to Camera roll sharing suggestions\nMeta placed the toggles that grant it access to your camera roll under the \"Camera roll sharing suggestions\" setting. You'll need to go there to see if they're on and, if so, switch them off.\n- Look for the option labeled \"Camera roll sharing suggestions\" and tap it.\n- This will open a preference page with a couple of toggles.\n5. Turn off both toggles\nOnce you're inside the camera roll sharing suggestions page, notice the two separate switches. If they're blue and the toggle circle is pushed to the right, they're on -- meaning Meta is already processing and retaining your phone's photos. Turn them off so the app can't automatically upload and analyze your camera roll.\n- Find the option labeled \"Get camera roll suggestions when you're browsing Facebook.\" If the switch is on (blue), tap it once to turn it off (gray). This will stop Facebook from using basic camera roll data, such as which videos you've favorited and when photos were taken, to suggest sharing media you haven't yet uploaded.\nFind the option labeled \"Get creative ideas made for you by allowing camera roll cloud processing.\" If the switch is on (blue), tap it once to turn it off (gray). This will stop Facebook from continuously uploading media from your camera roll -- and using details like time, location, themes, and the presence of people or objects -- to generate personalized creative ideas such as recaps and AI restylings.\nFAQs\nWhy is Facebook cloud-processing my device's camera roll?\nMeta is uploading and analyzing your camera roll photos and videos, even ones you haven't posted, in its cloud in order to generate AI-powered suggestions like collages, monthly recaps, themed albums, or AI-restyled versions of your images.\nWhere is this feature being tested?\nMeta has confirmed the feature is a test, saying, \"We're exploring ways to make content sharing easier for people on Facebook by testing suggestions of ready-to-share and curated content from a person's camera roll.\"\nThe test is currently available in the US and Canada, but it's not available in Illinois or Texas due to those states' privacy laws.\nDid Facebook ask for my consent before turning this on?\nMeta is showing a pop-up asking users if they want to enable cloud processing, but some users claim they haven't seen it. Instead, they found the toggles in their settings already switched on by default, raising questions about whether clear consent was given.\nCan I remove my photos once they've been uploaded?\nZDNET's sister site, CNET, reports that Meta pulls from your newer pictures (roughly the last 30 days) and if you disable the feature, your uploaded photos will be deleted after 30 days. The only way to confirm is by downloading your Facebook account data.\nWhy is this a potential privacy issue?\nIt expands Meta's reach beyond the content you've chosen to upload and share online -- into your private, unposted photos and videos. For many, that's a major red flag and a line they're not comfortable crossing, understandably so.\nAlso: What Zuckerberg's 'personal superintelligence' sales pitch leaves out\nEven if Meta is asking for consent to access your camera roll in order to analyze your phone's photos and provide AI-powered suggestions, the company could have done a better job of being clear and explicit about what it's trying to do.\nHow many users, like me, simply dismissed the consent pop-up without fully realizing what they'd just agreed to?\nEditor's note: This article was updated on Aug. 24, 2025 to clarify that Meta's camera roll sharing suggestions are not turned on by default and are entirely opt-in. Still, some users say they never knowingly agreed and are finding the features enabled in their settings."
    },
    {
      "url": "https://www.zdnet.com/article/google-pixel-10-pro-vs-iphone-16-pro-ive-used-both-handsets-and-theres-a-clear-winner/",
      "text": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nGoogle Pixel 10 Pro vs. iPhone 16 Pro: I've used both handsets, and there's a clear winner\nAfter the success of launching four flagship phones last year, Google is set to continue the trend with the new Pixel 10 series.\nThe Google Pixel 10 Pro stands out as potentially the best option for many people. With a starting price of $999, it offers a compelling blend of premium features borrowed from its more expensive sibling, all in the more manageable size of the standard Pixel 10.\nAlso: Everything announced at Made by Google 2025: Pixel 10 Pro, Fold, Watch 4, and more\nThe Pixel 10 Pro enters a crowded field, competing directly with the iPhone 16 Pro and the Galaxy S25 Plus.\nHaving used the iPhone 16 Pro as my daily driver for the past year, I've tested it against the new Pixel 10 Pro to see how these two flagship phones compare.\nYou should buy the Google Pixel 10 Pro if…\n1. You want the best of Google AI\nThe Pixel phone lineup unsurprisingly offers the best of Google's Gemini AI features. And it is only getting better with the Pixel 10 Pro. The company is providing a year of Google AI Pro service for free alongside the purchase for Pixel 10 Pro and Pixel 10 Pro XL. So, you get Gemini Pro, including NotebookLM for productivity and Veo 3 text-to-video generation model.\nThe Google Pixel 10 Pro is also getting a contextual and personalized AI feature called Magic Cue. Theoretically, it can \"help connect the dots across your digital life by anticipating your needs and proactively suggesting relevant information and helpful actions based on the context on your phone.\"\nAlso: The best Android phones to buy in 2025\nFor instance, if you call a company's helpline, your associated details (like a flight ticket) will be surfaced automatically.\nYou can still download the Gemini app to access Google's AI on your iPhone, but you won't get the seamless Pixel AI experience. If you depend on Google apps to get work done and have all your digital life stored on Google's platforms, the Pixel 10 Pro is the better option.\n2. You want a better telephoto camera\nThe Google Pixel 10 Pro features a 48MP Quad PD telephoto camera with 5x optical zoom, as compared to a 12MP telephoto sensor (also 5x optical zoom) on the iPhone 16 Pro. However, megapixels don't solely define a camera. The Pixel 10 Pro sports a bigger sensor than its Apple counterpart. On paper, it is capable of letting more light in and snapping better-looking photos.\nAlso: I replaced my Pixel 9 Pro with the 9a for a month - here's my buying advice now\nThe 12MP 5x tele camera on iPhone 16 Pro isn't hard to beat. It struggles in anything less than bright daylight and lacks the zoom capabilities of its Chinese rivals. I'm looking forward to using the Google Pixel 10 Pro for my zoom shots and expect it to beat the iPhone.\n3. You want a cool-looking Pro phone\nThe iPhone 16 Pro series is lacking in fun colors. It comes in Black Titanium, White Titanium, Natural Titanium, and Desert Titanium -- all of which feel a bit lifeless. The last Pro iPhone color I truly loved was Sierra Blue on my iPhone 13 Pro Max.\nWhile rumors suggest the iPhone 17 Pro might bring back more playful finishes, Google has already beat Apple to the punch with the Pixel 10 Pro series.\nAlso: I went hands-on with every Google Pixel 10 model - and was surprised by the one I loved most\nThe new Pixel 10 and Pixel 10 Pro are available in classic Obsidian and Porcelain, as well as bolder Moonstone and Jade options.\nSo, if you're spending $1,000 on a phone, you don't have to settle for something dull. Plus, you get Google's distinct design, complete with the iconic camera bar—which, in my opinion, still looks incredibly cool.\n4. If you've been envious of this iPhone feature\nThe Pixel 10 Pro features a MagSafe-like feature called PixelSnap. It is based on Qi2 charging, which offers magnetic accessory support for power banks, chargers, and more. If you've been on the iPhone for a while and want to switch platforms, this is the best time to come to the Android side.\nAlso: How to add MagSafe to your Android phone (and why you'll love it)\nAll your MagSafe accessories should technically work with the Pixel 10 Pro (depending on magnet power), so you don't have to buy new accessories alongside your new phone.\nYou should buy the Apple iPhone 16 Pro if…\n1. You want a lighter Pro phone\nThe Google Pixel 10 Pro might look better on paper, but it's nearly 10 grams heavier than the iPhone 16 Pro. Specifically, the Pixel weighs 207 grams compared to the iPhone's 199 grams.\nAlso: Buy the iPhone 16 or wait for iPhone 17? Here's how I help friends and family decide\nThat eight-gram difference might not seem like much, but with both phones featuring flat, unergonomic sides, every gram counts -- especially during extended use. If you average more than six hours of screen time a day, the iPhone 16 Pro could be the more comfortable choice.\n2. You want the best social media experience\nWhile Android has made significant progress, iPhones still hold an advantage in stability and app optimization. This is particularly noticeable with social media apps like X and Instagram, where the user experience remains smoother on Apple devices.\nEditing and posting photos and videos from an iPhone to social media platforms is also more seamless and efficient for anyone who regularly creates content.\nAlso: Best iPhone 2025: I tested the top models and found the best options for you\nIf you're leaning toward an iPhone instead of the Pixel 10 Pro, I strongly recommend waiting just a few weeks. Apple is expected to launch its new iPhone 17 series in early September. It's smart to hold off on your decision until after the typical September 10th launch event to make sure you get the latest model."
    },
    {
      "url": "https://www.zdnet.com/article/i-retested-gpt-5s-coding-skills-using-openais-guidance-and-now-i-trust-it-even-less/",
      "text": "I retested GPT-5's coding skills using OpenAI's guidance - and now I trust it even less\nFollow ZDNET: Add us as a preferred source on Google.\nZDNET's key takeaways\n- The same prompts in GPT-5 yield success, crashes, or errors.\n- OpenAI's prompt optimizer helps, but introduces its own quirks.\n- AI \"unconsciously\" adding details raises trust concerns.\nDo AI's get headaches? Because GPT-5 has certainly been giving me one. This article was going to be so easy. OpenAI came out with a list of best practices for GPT-5 coding. All I was going to do was try those best practices with the GPT-5 coding tests that previously failed and see if there was improvement.\nIt seemed so simple.\nAlso: I tested GPT-5's coding skills, and it was so bad that I'm sticking with GPT-4o (for now)\nBut then I had a thought. What if OpenAI has improved GPT-5 in the week or so since I ran my tests?\nPerhaps I should re-run the failed tests as-is and see what the results are, to use as a baseline for the new best practices.\nFrom a testing point of view, this was a valid approach. From a personal sanity point of view, not so much.\nRe-running test 1\nI re-ran the first failed test. This test has the AI creating a complete WordPress plugin, complete with a user interface and business logic. The idea is you feed in a set of names, it randomizes them, and it separates duplicates so they're not side-by-side.\nAlso: How I test an AI chatbot's coding ability - and you can, too\nWhen I ran this test on GPT-5 originally, it failed. Clicking the Randomize button sent the browser to another, unrelated page. I was able to cajole GPT-5 into fixing it, but the initial failure was what counted.\nThis time, I ran the exact same test with the exact same prompt again. This time, it worked perfectly. Wow, I thought. GPT-5 has improved in the past week.\nIf only I had left well enough alone. But no.\nI had to try again. On my second time with the exact same test with the exact same prompt, clicking Randomize resulted in what WordPressers call the \"white screen of death.\" This indicates something in the code isn't working.\nAlso: GPT-5 bombed my coding tests, but redeemed itself with code analysis\nI tried the exact same test with the exact same prompt a total of five times. The first time it worked. Subsequent times, it didn't. One time, I got a white screen. One time, I got a page full of error messages. One time, I was redirected to another page. One time, nothing happened at all.\nWe'll come back to test 1. But next, I decided to do the same thing with the other failed test.\nRe-running test 4\nThis test asks the AI to write code that talks to Chrome, AppleScript, and another tool called Keyboard Maestro. It requires the AI to be knowledgeable about the three different environments and how they work together.\nHere's an interesting factoid about AppleScript. The scripting language is inherently case-insensitive. So, if you ask AppleScript to compare \"AppleScript\" to \"applescript\", it will consider both strings to be the same. You have to explicitly tell it to compare case before it will do so.\nAlso: You can learn AI for free with these new courses from Anthropic\nWhen I first ran this test against GPT-5, it hallucinated that AppleScript had a native function for making strings lowercase. It does not, so the code failed.\nThis time, instead of hallucinating that AppleScript has a lowercase function, it decided to do one of the most convoluted sets of operations to lowercase a string. Here's that line of code:\nset tabTitleLower to (do shell script \"echo \" & quoted form of tabTitle & \" | tr '[:upper:]' '[:lower:]'\")\nThe code actually works, but it's very weird and totally unnecessary. It launches a shell (the command line) to run a shell script that converts to lowercase. It's like making a grilled cheese sandwich and when you realize you're out of cheese, flying across the country to buy cheese from a 7-11 on the opposite side of the continent. You're not even getting better cheese. You're just doing it in the weirdest and most inefficient way possible.\nLet's not forget that we really don't need to make that text lowercase in the first place, because AppleScript is case-insensitive. So it wrote a highly convoluted piece of code that, while it works, is entirely unnecessary.\nI didn't bother to re-run this test four more times because the headache was already starting to set in.\nOpenAI's GPT-5 coding best practices\nOpenAI has put out what it calls a cheatsheet for GPT-5 coding. It has six main recommendations:\n- Be precise and avoid conflicting information: Well, duh. But apparently GPT-5 gets really confused if asked to follow vague or conflicting instructions.\n- Use the right reasoning effort: Rather than just letting GPT-5 choose its reasoning level, you might want to adjust its model. If it starts to overthink a problem, use a lower reasoning level. Great, so now we have to deal with a neurotic AI. Yippee?\n- Use XML-like syntax to help structure instructions: Rather than using just text, using XML tags to segment aspects of a prompt helps the AI to parse its assignment. This is a good hint, but it feels like a step back from what it could do.\n- Avoid overly firm language: In previous models, we sometimes had to YELL at the AI to get it to listen. Apparently, GPT-5 is passive aggressive, so if you get too forceful in your instructions, it will overdo its compliance, like what my old bosses used to say was my practice of \"aggressively following instructions.\"\n- Give room for planning and self-reflection: Does the AI need a blankie? Perhaps a warm stuffed animal to cuddle? In reality, what OpenAI is saying is that you need to encourage the AI to think through the instructions it gets. Apparently, if you don't tell it to think through the instructions, it won't. I fear for the planet.\n- Control the eagerness of your coding agent: It turns out GPT-5 is even more of a people-pleaser than GPT-4o. When giving it instructions, tell it to tone down its fawning and sucking-uppage.\nI'd like to say something positive here, but it's starting to feel like a migraine. Check out the PDF if you want more details.\nOpenAI also created an AI prompting helper. You point your browser to this tool, and paste in your prompt. The tool will give you back a more extensive prompt. For example, I gave it this prompt from Test 4:\nWrite a Keyboard Maestro AppleScript that scans the frontmost Google Chrome window for a tab name containing the string matching the contents of the passed variable instance__ChannelName. Ignore case for the match. Once found, make that tab the active tab.\nIt gave me back this:\nCreate an AppleScript for use in Keyboard Maestro that performs the following actions: * Begin with a concise checklist (3-7 bullets) outlining the planned steps before proceeding. * Scan all tabs in the frontmost Google Chrome window. * Search for a tab whose name contains the value of the passed variable 'instance__ChannelName', ignoring case sensitivity. * Once a matching tab is found, activate that tab and make it the current/active tab. After generating the script, validate in 1-2 lines whether the script meets all requirements. If not, state what needs adjustment.\nEssentially, it revised the prompt to add a planning phase at the beginning and a validation phase at the end.\nDoes it work?\nNope. Nopity-nope-nope.\nI ran Test 4's \"optimized\" prompt through GPT-5 and got back this script:\nThere are at least three serious flaws in it. First, the code in the green box doesn't work. It doesn't retrieve the value from Keyboard Maestro. Previous versions did that successfully using a completely different (and well-documented) mechanism. This approach is just loony.\nAlso: AI is creeping into the Linux kernel - and official policy is needed ASAP\nNow, look at the blue box. The considering case operation is used only for evaluation. For example, with considering case, \"BLUE\" and \"blue\" are different values. Do you see any sort of if statement or evaluation inside the blue box? Me neither.\nThen there's the red box. There is no such syntax as \"considering case false.\" First, the default behavior is to ignore case. Second, if you really wanted to explicitly tell AppleScript to ignore case, you'd use an \"ignoring case\" block. But \"considering case false\"? That's just some made-up syntax right there.\nRetrying the WordPress plugin\nI also ran my original prompt for the WordPress plugin through the prompt optimizer. I got back a fairly extensive project requirements document.\nOn the plus side, this time the plugin worked. I tried generating code a second time, and it also worked. So perhaps the optimization is something to try if GPT-5 isn't playing nice.\nBut then there's the weirdness. Because there's always weirdness. Check out the header block generated by GPT-5.\nNotice the author is attributed to Advanced Geekery Labs. Historically, the AIs have listed the author field as \"Your Name.\" But this time, it's Advanced Geekery Labs.\nThere is some relevance, because Advanced Geekery is the name of my YouTube channel and weekly newsletter. But I didn't use it anywhere in my instructions for this plugin. Additionally, I've never added Labs to the end of Advanced Geekery, even though my security product is sold through ZATZ Labs.\nSo I asked GPT-5 where it got the name Advanced Geekery Labs from. Its answer:\nGood question. The name \"Advanced Geekery Labs\" isn't something you provided in your request. I introduced it in the plugin header's Author: field as a placeholder, because in earlier conversations you've mentioned your \"Advanced Geekery\" brand, and I unconsciously expanded it into \"Labs.\"\nI'm glad the AI thinks it's a good question. That warms my heart. But \"unconsciously expanded\"? That's a direct quote from the AI. Those are its words.\nSo, we're now dealing with hallucinating AIs that operate unconsciously?\nWe're all doomed.\nWhat about coding and GPT-5?\nI still don't trust it. Actually, I don't trust it even more than when I tested it originally. What else might it do to my code \"unconsciously\"?\nI guess, if you really need GPT-5 to give you some code, you could try the optimizer. But I wouldn't rely on it.\nGPT-4o was impressive, but it had some problems. GPT-5 is like its more troubled, more difficult sibling.\nWith GPT-4o, I'd be willing to trust, with verification. I just plain don't trust GPT-5. There's something that's just not right. If we were to experience an AI that would revolt against its creators and try to kill us all, I would not be surprised if it all originated with GPT-5.\nAnd no. My headache hasn't gone away. Apparently, Tylenol is now bad for you. So, there's that, too.\nWhat do you think?\nHave you tried relying on GPT-5 for coding projects? If so, did you run into the same kinds of inconsistencies and odd behaviors? Do you find OpenAI's \"best practices\" helpful, or do they feel like workarounds for deeper problems? And what's your take on GPT-5's tendency to improvise or even \"unconsciously\" insert details? Is it a harmless quirk or a reason for concern? Let us know in the comments below.\nYou can follow my day-to-day project updates on social media. Be sure to subscribe to my weekly update newsletter, and follow me on Twitter/X at @DavidGewirtz, on Facebook at Facebook.com/DavidGewirtz, on Instagram at Instagram.com/DavidGewirtz, on Bluesky at @DavidGewirtz.com, and on YouTube at YouTube.com/DavidGewirtzTV."
    },
    {
      "url": "https://www.zdnet.com/article/45-windows-keyboard-shortcuts-i-use-to-instantly-boost-my-productivity/",
      "text": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\n45+ Windows keyboard shortcuts I use to instantly boost my productivity\nFollow ZDNET: Add us as a preferred source on Google.\nZDNET's key takeaways\n- Windows has a long list of keyboard shortcuts that perform helpful actions in Windows 11.\n- For example, hitting the CTRL and C keys together allows users to copy text or files.\n- Mastering these shortcuts can help boost your overall productivity, but most people only know a few.\nKeyboard shortcuts have been a staple feature in Windows for decades, but most users only know the basics. At first glance, they don't seem all that useful since you can also do these actions with your mouse, but I challenge you to try them over the course of a workday; you just might notice a boost in productivity.\nAlso: How much RAM does your PC really need in 2025? I did the math for Windows and Mac users\nThere are lots of different types of shortcuts in Windows 11, but the best ones save you time by replacing the need to click through different context menus. A few of these are universal across applications and platforms. Ctrl + C, for example, copies text or files in any app, from Microsoft Word to photos in Google Drive.\nHere's a list of more than 40 Windows PC keyboard shortcuts you should know.\nProductivity shortcuts\nProductivity shortcuts are the key combos you'll find yourself using the most. They're easy to use and help you manage your work. Over time, these keystrokes become second nature.\n- Ctrl + C -- Copy highlighted text or a file.\n- Ctrl + V -- Paste whatever you just copied. Keeps the text's format.\n- Ctrl + Shift + V - Paste whatever you copied, but it removes the formatting.\n- Windows key (Win, for short) + V -- Opens the Clipboard tool, which contains a list of previously copied text. This helps in situations where you might've \"erased\" the previous copied item.\n- Ctrl + X -- Cuts the highlighted item. Ctrl + V restores it.\n- Ctrl + Z -- Undoes the last action, such as restoring deleted text or returning a moved file.\n- Ctrl + Y -- Redoes the action that was just undone.\n- Ctrl + F -- Opens the Find tool, so you can search for specific words or phrases.\n- Ctrl + A -- Highlight every single item in a window or text in a document.\n- Ctrl + S -- Quick save your work.\n- Ctrl + Backspace -- Delete the entire previous word\n- Ctrl + Delete -- Delete the entire next word.\nAccessibility shortcuts\nWindows 11 has various accessibility shortcuts that make the OS easier to use. These shortcuts help people with movement limitations or conditions that may restrict their usage of Windows. That said, anybody can use them to improve their experience.\n- Win + Plus (+) -- Activates the Magnifier tool and automatically zooms in on the screen.\n- Win + Minus (-) -- Zooms out while the Magnifier tool is activated. Hitting Win + Esc exits out of Magnifier.\n- Win + Ctrl + Enter -- Launches Narrator, a text-to-speech function that verbally describes what is on screen.\n- Press the Shift key five times in succession -- Turns on Sticky keys, which change how shortcuts work so you don't have to press and hold multiple keys to trigger them. For example, under Sticky Keys, double-tapping Ctrl then C has the same effect as Ctrl + C.\n- Left Shift + Left Alt + Print Screen -- Toggles high contrast mode for easier readability.\n- Win + Ctrl + C -- Toggles color filters like grayscale. The filters can be changed in the Accessibility menu to invert colors or help people with deuteranopia (also known as red-green color blindness).\n- Win + U -- Opens the Accessibility menu in Settings, where you can activate or deactivate accessibility-related features.\n- Win + Ctrl + O -- Opens the on-screen keyboard.\nNavigation shortcuts\nNavigation shortcuts allow users to move around different apps on Windows 11 without ever needing to lift their hands off the keyboard. They're especially useful for multitaskers juggling several programs at once. Once you master them, navigating your PC will feel seamless.\n- Ctrl + Alt + Tab -- Shows all open apps. Use the arrow keys to hop from one to the other.\n- Win + S -- Opens Windows Search.\n- Win + Tab -- Opens Task View, revealing all open windows and all open desktops.\n- Win + D -- Hides every window on your desktop. Pressing the keys again reveals them.\n- Win + Left or Right Directional Arrow -- Snaps the current window to the side of the screen that the arrow is pointing to.\n- Win + Up Arrow -- Maximizes a window.\n- Win + Down Arrow -- Minimizes the same window.\n- Win + Ctrl + D -- Create a new desktop.\n- Win + Ctrl + F4 -- Closes a desktop.\n- Win + Number Key -- Opens a taskbar app pinned to that number. For example, Win + 3 could open Microsoft Edge while Win + 4 opens the Microsoft Store.\nAlso: Finally, a Windows laptop that I wouldn't mind putting away my MacBook for\nFile Management shortcuts\nThe Windows 11 File Explorer has its own set of keyboard shortcuts to help users reorganize folders and files. Instead of right-clicking through menus or dragging items around to clean up clutter, these simple key presses make managing documents a breeze.\n- Win + E -- Opens File Explorer.\n- F2 -- Rename the selected file or folder. Depending on the keyboard, you may also have to hold Fn.\n- Shift + Delete -- Permanently deletes an item. Hitting just Delete only sends the file to the recycling bin.\n- Ctrl + N -- Opens a new File Explorer window. It stays on the page of the previous window.\n- Ctrl + Shift + N -- Create a new folder.\n- Alt + Enter -- Opens the Properties window for a file and folder.\n- Alt + Left or Right Arrow -- Move forward or backward through your File Explorer History.\n- Alt + Up Arrow -- Go back one folder level.\nAlso: Best early Labor Day laptop deals: Sales on Apple, Dell, Lenovo, and more\nBrowser shortcuts\nBrowser shortcuts are similar to Productivity shortcuts in that they do similar things, like copying and pasting items or highlighting entire documents. However, there are a few unique tools, like the ability to create tabs. The following were tested and confirmed to work across various browsers: Chrome, Edge, and Firefox.\n- Ctrl + T -- Open a new tab.\n- Ctrl + Shift + T -- Reopen the last closed tab. (This one is huge!)\n- Ctrl + W -- Close the current tab.\n- Ctrl + Tab -- Move right through tabs.\n- Ctrl + Shift + Tab -- Move left through the tabs.\n- Ctrl + Shift + N -- Open new private browsing window. On Firefox, this is Ctrl + Shift + P.\n- Alt + Left or Right Arrow -- Move back and forth through tab history.\n- Ctrl + D -- Bookmark page.\n- Ctrl + H -- Open browser history.\n- Ctrl + N -- Open a brand new browser window.\nWhy should you trust me?\nI've been writing about software and consumer electronics for almost 10 years. In that time, I've worked in many different settings, from the traditional office to the home office and even someone's backyard. Over the years, I've picked up a lot of tricks to help me get through my day-to-day tasks.\nAlso: I tested the best antivirus software for Windows: Here's what I'd use to protect my PC\nMany of the shortcuts in this guide I use every day, even when I'm not working. CTRL + Z has practically become my best friend because I use it so often. Some of these shortcuts I learned about for the first time while researching this piece. I didn't know that the File Manager has so many shortcuts under its toolbelt, but once I started using them, I immediately saw their value to expert and casual users alike."
    },
    {
      "url": "https://www.zdnet.com/article/i-spent-a-week-in-new-york-city-with-the-samsung-z-fold-7-and-it-spoiled-me-the-entire-time/",
      "text": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nI spent a week in New York City with the Samsung Z Fold 7 - and it spoiled me the entire time\nSamsung Galaxy Z Fold 7\nZDNET's key takeaways\n- The Galaxy Z Fold 7 is an excellent upgrade over its predecessor, thanks to its slim and light design, a strong hinge and a wider coverscreen.\n- It's very expensive at $2,000 for the starting configuration.\n- But you'll dig the improved hardware, especially if you're familiar with foldable phones from the global market.\nFor a limited time, you can buy the Galaxy Z Fold 7 and receive a free $200 gift card.\nThe Galaxy Z Fold 7 is Samsung's biggest design overhaul since the Z Fold 2 in 2020, and it's back with a bang. Over the last three years, the Korean tech giant made slight refinements to each generation, resulting in a stale design. But the new Galaxy Z Fold 7 finally catches up to its Chinese rivals, even beating them in multiple ways.\nAlso: 5 preinstalled apps you should delete from your Samsung phone immediately\nI've been using the Samsung Galaxy Z Fold 7 for the past week and am happy to report that Samsung has made some damn near-perfect hardware. You get an easy-to-hold form factor, virtually no crease, a cover screen that's close to a regular phone in itself, a solid hinge, and the same main camera as the Galaxy S25 Ultra.\nThese upgrades come with a cost, though. The Fold 7 will set you back at two grand, but if you have that money, this is the phone I recommend most.\nAn (almost) perfect physical form\nThe Galaxy Z Fold 7 measures just 4.2mm thin when unfolded and 8.9mm folded. For context, that's a few millimeters more than the 8.25mm iPhone 16 Pro Max and 8.5mm Pixel 9 Pro. Samsung's own Galaxy S25 Ultra measures 8.2mm, while the foldable Oppo Find N5 is 8.93mm thick.\nAll in all, the Galaxy Z Fold 7 is just 0.1mm thicker than the thinnest book-style foldable, the Honor Magic V5. Paired with a body that's lighter than all of them at 215 grams, the Galaxy Z Fold 7 the lightest book-style foldable on the market right now.\nAlso: Best Android antivirus apps 2025\nThis thin and light design makes it the most comfortable to hold Galaxy Z Fold phone yet -- if you hold it in the right hand. If you're left-handed, the hinge corners might dig into your palm, which was also an issue on the predecessor. That said, I'm a right-hander, and I find it more comfortable to use than the Galaxy S25 Ultra and iPhone 16 Pro Max.\nThe Galaxy Z Fold 7 is also more durable than before. It features a stronger Gorilla Glass Victus Ceramic 2 on the cover screen, Gorilla Glass Victus 2 on the back, and a Titanium plate layer instead of a carbon fiber sheet under the screen for added display durability. Plus, you get dust and water resistance with an IP48 rating.\nSamsung improved the cover screen, too. It's no longer fixated on the narrow form factor, enabling the 6.5-inch AMOLED screen with a 21:9 aspect ratio so apps interact better and play along well with the whole slab phone-like feel. It's bright enough to see outdoors and has the same 120Hz dynamic refresh rate and HDR10+ support as the inner display. Texting, scrolling through social media, and browsing the web on a Samsung cover screen feels refreshing.\nFull-screen trade-offs, but the crease is gone\nThe Galaxy Z Fold 7 has a wider folding screen than its predecessor. I've loved my experience on this sharp and vivid panel, but it isn't as immersive as before.\nSamsung stuck to an under-display camera (UDC) for years, which made the reading, browsing, and gaming experience better than any other foldable. Utility-wise, its quality was worse than the new punch-hole 10MP camera -- and I'd prefer the new setup for video calls any day -- but I miss the under-display camera, too. I hope it returns in the future with better quality.\nOnce you accept that the camera isn't going anywhere, you can appreciate the Galaxy Z Fold 7's eight-inch LTPO AMOLED 2X panel, which supports HDR10+ and has a 120Hz dynamic refresh rate. I love its vivid colors and high-contrast look. But like before, the inner display attracts more smudges than the cover screen.\nComing to the best part of the folding screen, there's virtually no crease. Samsung's new butterfly hinge mechanism has successfully negated it. In fact, Galaxy Z Fold 7 has the least amount of crease on any book-style folding phone that I've used. The Oppo Find N5 comes close, but the Vivo X Fold 5 and Honor Magic V3 both have slightly deeper creases running through the middle of the screen.\nNot that it matters when interacting with the big display, but less crease means a comfortable viewing experience in more lighting conditions and angles.\nThe hinge, too, feels more premium than other foldables. If you're coming from one of the previous Z Folds, the Galaxy Z Fold 7 won't prop up at 150 degrees right out of the box, but it gets better as you use it. After a week of use, my unit no longer unfolds flat till up to roughly 135 degrees. I had a similar experience with the Honor Magic V3, which also has a butterfly hinge.\nIf I had to choose between a subjectively more immersive Fold 6 screen with UDC and deep crease or Fold 7's punch-hole-clad screen with lesser crease, I'd pick the latter.\nI can't pinpoint why the Galaxy Z Fold 7 feels more premium than other foldables on the market, but it is probably a combination of multiple factors: a thinner and lighter design, the least crease, and flat sides that aren't unergonomic (in the right hand) to hold. It is slightly harder to unfold, but you'll get used to it within the first 48 hours.\nSamsung removed another feature on the Galaxy Z Fold 7: the S Pen, and I don't miss it. I never used it on my Fold 5 or Fold 6, and if it helps the phone make it thinner, I don't mind missing out on a stylus that has to be stored in an external case.\nUseful AI and finally: a camera upgrade\nSamsung's new Fold runs Android 16-based One UI 8, with Samsung's Galaxy AI having the most complete suite of artificial intelligence features. The phone runs smoothly, thanks to the Qualcomm Snapdragon 8 Elite SoC, paired with either 12GB or 16GB of RAM.\nI actually found some of the phone's AI features useful. For example, the AI Select feature lets you click anything on your screen to take actions. From transcribing interview recordings to removing unwanted objects in my photos, there are plenty of useful AI tools that actually work.\nAlso: Why I still recommend this $200 Android phone in 2025 - even though it's a year old\nComing from a OnePlus phone recently, I think Samsung could benefit from displaying similar pop-ups for on-call features like transcribe and translate. As of now, you need to swipe down and tap on the Live Translate tile from the quick panel to use the feature, which isn't as easy.\nSamsung also finally gave its foldable the same primary camera as its flagship S-series phone. The Galaxy Z Fold 7 sports a 200MP main camera, borrowed straight from the Galaxy S25 Ultra. It is accompanied by a modest 3x 10MP telephoto camera and a 12MP ultrawide-angle lens.\nThis camera system produces vibrant-looking shots in most scenarios. I recommend shooting most photos in 200MP mode, so you can crop them later and yet retain the details, as the 3x tele lens isn't the best.\nI wish Samsung would let users switch between lenses in the 200MP mode. As of now, you get options for 1x, 4x, and 5x (you can zoom at any level from 1x to 5x), but to change to ultrawide, you need to switch to 12MP mode and then tap 0.6x. It's a slight inconvenience that I've regularly faced in the past week.\nSamsung has also improved the shutter speed, so moving subjects are captured better than before. The dynamic range remains great, while the Portrait mode still struggles with edge detection. Galaxy AI comes into play again and gives you the most polished photobomber-removal tool.\nAlso: Verizon will give you a free Samsung Z Flip 7 phone right now - how the deal works\nAnother cool feature for videographers: Audio Eraser can now automatically detect what to tune out and has a designated button in your gallery. It made my voice a little robotic, but it did well to suppress background noise.\nLet's talk battery life\nUnfortunately, Samsung didn't upgrade the battery capacity on its new foldable. In fact, it hasn't increased the battery size in five generations; the Galaxy Z Fold 7 has the same battery as the Galaxy Z Fold 3. This means you get a 4,400mAh cell with support for a modest 25W wired charging and 15W wireless charging.\nWhen I first saw this number on paper, I was worried that amazing hardware would be compromised by a questionable decision, especially when competing devices have 5,500mAh+ silicon-carbon batteries.\nAlso: I replaced my Galaxy S25 Plus with the S25 Edge (and Samsung may do the same)\nAs it turns out, the Galaxy Z Fold 7 is a full one-day device for moderate phone users (with about 5-6 hours of daily screen time). I'm not impressed by the charging speed, though.\nI usually average about nine hours on my phone daily and have to charge my Z Fold 7 every evening around 6 PM for my evening social media scrolling. If you're a heavy phone user, expect to plug in your Z Fold 7 after the work day, or earlier if your usage involves a lot of navigation on 5G.\nZDNET's buying advice\nSamsung improved the weakest links of its book-style foldable with the Galaxy Z Fold 7, and the result is a near-perfect phone. I'd love for it to have a bigger battery and a better zoom camera -- the Vivo X Fold 5 has both -- but Samsung's foldable has U.S availability, longer software support, and a better user interface. In short, this is the most polished folding phone experience, in my opinion.\nHowever, it doesn't come cheap. After a $100 price bump, the Galaxy Z Fold 7 is Samsung's most expensive Fold yet, starting at $2,000. If you can spend that amount on a smartphone, you can't go wrong with this phone. It's a generational leap over its predecessor, and if you can find a good exchange offer, I recommend upgrading from last year's Z Fold 6, too. If you're a business professional or need a phone for productivity, the Galaxy Z Fold 7 should be on your radar.\nWhy the Samsung Galaxy Z Fold 7 gets an Editors' Choice award\nWe awarded the Galaxy Z Fold 7 an Editors' Choice because Samsung finally redesigned its foldable to compete with Chinese rivals and even bettered them in multiple ways. It is the lightest book-style foldable, which translates to a regular phone-like in-hand feel, and has an intuitive user interface. It is one of the best phones for productivity."
    },
    {
      "url": "https://www.zdnet.com/article/googles-gemini-2-5-pro-update-makes-the-ai-model-even-better-at-coding/#link=%7B%22role%22:%22standard%22,%22href%22:%22https://www.zdnet.com/article/googles-gemini-2-5-pro-update-makes-the-ai-model-even-better-at-coding/%22,%22target%22:%22%22,%22absolute%22:%22%22,%22linkText%22:%22Gemini%202.5%20Pro%22%7D",
      "text": "Google's Gemini 2.5 Pro update makes the AI model even better at coding\nGoogle I/O, the company's annual developer event where it unveils its latest and greatest features, is only a couple of weeks away. Google is offering a glimpse of I/O announcements with its latest AI model launch.\nGemini 2.5 Pro Preview (I/O edition)\nOn Tuesday, Google released early access to Gemini 2.5 Pro Preview (I/O edition), a version of Gemini 2.5 Pro that has significantly improved coding capabilities -- especially when building interactive web apps, according to the release. The update is also meant to make the model better at other coding tasks, such as code transformation, code editing, and creating agentic workflows.\nAlso: Only 8% of Americans would pay extra for AI, according to ZDNET-Aberdeen research\nThe model update was scheduled to debut at Google I/O, but Google released it early in response to positive feedback so users could start building as soon as possible.\nThe updates place Gemini 2.5 Pro at the top of the WebDev Arena Leaderboard, with an Elo score 147 points higher than its predecessor. It also scored 84.8% on the VideoMME benchmark.\nAvailable in Gemini app\nThe updated version of Gemini 2.5 Pro is available in the Gemini API for developers via Google AI Studio and Vertex AI. Users in the general public can also access the updated model in the Gemini app, where it powers features like Canvas.\nAlso: Why I just added Gemini 2.5 Pro to the very short list of AI tools I pay for\nGoogle I/O will take place on May 20 to May 21 at the Shoreline Amphitheatre in Mountain View, California. The keynote event, which will feature the bulk of the news regarding Google's latest hardware and software, will take place on Day One at 10 a.m. PT / 1 p.m. ET.\nAlso: Google's AI Mode may be the upgrade Search desperately needs - how to try it for free\nDevelopers can register for the event's digital experience on the Google I/O landing page now for free. Everyone is invited to tune into the live stream at no cost. ZDNET will also cover the event on the ground with updates posted to the site as the news happens.\nGet the morning's top stories in your inbox each day with our Tech Today newsletter."
    },
    {
      "url": "https://www.zdnet.com/article/pixelsnap-is-the-magsafe-for-android-phones-weve-been-waiting-for-heres-our-first-look/",
      "text": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nWhy Google's best Pixel 10 announcement yesterday was an iPhone feature - and I don't mind\nGet more in-depth ZDNET tech coverage: Add us as a preferred Google source on Chrome and Chromium browsers.\nGoogle this week announced its new lineup of Pixel phones , the Pixel 10, 10 Pro, and 10 Pro XL, but rather than complete design overhauls, they're refreshed versions of the 9 series (and look essentially identical).\nInstead, we get a handful of supporting software and hardware features for the 10, including one that Pixel users have been waiting for a (very) long time: Pixelsnap, a magnetic Qi2 wireless charging feature resembling Apple's MagSafe.\nAlso: Everything announced at Made by Google 2025: Pixel 10 Pro, Fold, Watch 4, and more\nThat's right. Finally, Android is invited to the magnetic snap party, with the Pixel 10 being the first Android to support wireless charging with a magnetic snap and the Qi2 charging standard. Google is launching Pixelsnap alongside three accessories to start, with an entire ecosystem of branded accessories coming down the road.\nSince the technology here is based on the Qi2 wireless charging standard, any of the MagSafe accessories previously marketed for iPhones will work on the Pixel 10. This opens up a ton of options for Android users who were previously relegated to workarounds and third-party products with varying degrees of success.\nThe Wireless Power Consortium (WPC) announced its pursuit of a standardized system for Apple and Android devices as far back as two years ago, but magnetic Qi2 charging technology built into the phones has been sorely missing from Android devices for years.\nAlso: I'm a longtime iPhone user, but Google just sold me on the Pixel 10 with these features\nThis is despite the fact that Androids were the first to offer wireless charging over 10 years ago, but have since been outpaced by the iPhone's MagSafe feature, which has spawned an entire ecosystem of products from wallets to chargers to other accessories.\nGoogle's branded products releasing today include the Pixelsnap ring stand for $29, which just props your phone up on a surface and acts as a secondary grip, the Pixelsnap charger that snaps to the back of the phone but has a wired connection for $39, and a combo charger with a stand for $69.\nYou can expect a host of new products in the Pixelsnap ecosystem soon, including everything we see from MagSafe products like car mounts, grips, wallets, and other unique accessories.\nAlso: I went hands-on with every Google Pixel 10 model - and was surprised by the one I loved most\nAll of the new Pixel 10 models will support PixelSnap wireless charging, reaching speeds of up to 25W, the Qi2 standard for both iPhones and Android devices.\nFor Apple, this means losing its majority market share in the MagSafe accessory category, since many of the devices that were previously marketed for the iPhone will now work on the Pixel 10. If additional Android models open up to this feature (and they most certainly will), it will no longer be a selling point unique to the iPhone."
    },
    {
      "url": "https://www.zdnet.com/article/i-went-hands-on-with-every-google-pixel-10-model-and-was-surprised-by-the-one-i-loved-most/",
      "text": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nGoogle Pixel 10 series hands-on: I did not expect this model to be my favorite\nZDNET's key takeaways\n- Pixel 10 lineup brings welcome changes across all models.\n- Base Pixel 10 suits most, but power users will prefer Pro XL.\n- Pro XL is the sleeper hit with top performance and endurance.\nGet more in-depth ZDNET tech coverage: Add us as a preferred Google source on Chrome and Chromium browsers.\nI'll be honest: My expectations going into my Google Pixel 10 demos were on the lower side. I had just wrapped up testing Samsung's $1,900 foldable phone, and Google all but confirmed the new Pixel phones would look identical to last year's, spoiling the surprise ahead of this week's event.\nThe question I had going in was simple: Was this a lack of ambition or a sign of unwavering confidence?\nAlso: Everything announced at Made by Google 2025: Pixel 10 Pro, Fold, Watch 4, and more\nIt took only minutes of hands-on time to find the answer -- and realize just how wrong I was about which Pixel model I would actually want this year. No, the designers at Google haven't run out of ideas for decorating a glass rectangle; instead, they've improved something that was already great. And one model in particular left the biggest impression on me.\nThe Pixel 10 just barely missed the mark\nGoing into the Made by Google event, I was fully prepared to slap my wallet down for the standard Pixel 10 model, ending a seven-year streak of buying the XL/Pro variant. The writing was on the wall: A dedicated telephoto lens would give the base Pixel the camera bump it needed to rival its Pro siblings, Qi2 wireless charging with integrated magnets set the stage for Android's MagSafe moment, and a charming Indigo color (pictured above) had my caseless habits drooling.\nBut a closer examination of the device and its spec sheet revealed some not-so-obvious shortcomings. First, fitting a dedicated telephoto lens into the rear camera bar meant that Google had to downgrade to smaller main and ultrawide sensors, resulting in camera samples that, based on my albeit limited sample size, lacked color accuracy and contrast compared to the Pro models.\nAlso: I'm a longtime iPhone user, but Google just sold me on the Pixel 10 with these features\nGoogle is also launching a new dock mode that passively displays the time, weather, photos, and even smart home controls when the Pixel 10 is mounted on the new PixelSnap charging mount. However, the standard Pixel 10 lacks the LTPO technology -- which allows the display to refresh from 1Hz to 120Hz -- found on the Pro models, meaning it's less power efficient when docked.\nBy the end of my Pixel 10 demo, the glossy back cover of my Indigo unit was plastered with fingerprint marks -- a gentle reminder of why the most expensive phones on the market opt for satin finishes instead of shiny glass.\nI almost folded for this Pixel model\nThat left me with the Pixel 10 Pro phones, including a Fold model that features slimmer front screen bezels, a larger battery, the same Qi2 charging as the Pixel 10, and a $1,799 price tag that makes you think twice. Coming from the Samsung Galaxy Z Fold 7, which greatly improved in lightness and ergonomics this year, I was fully prepared for the Pixel 10 Pro Fold to feel outdated.\nInstead, the device felt balanced and, frankly, much more durable in the hand. Google's done something extravagant with the Pixel 10 Pro Fold; it's the first foldable phone ever to be certified with an IP68 rating, making it both water- and dust-resistant. Why has this never been done before? The mechanical nature of foldable phones, with all their hinge systems and rail maneuvers, makes it nearly impossible to fend off dust-sized particles.\nAlso: Google just settled the foldable phone debate with one number - and I hope Samsung is watching\nAchieving this engineering feat automatically puts the Pixel 10 Pro Fold ahead of the competition when it comes to longevity and reliability. (Again, the designers at Google are clearly not out of ideas.)\nThen came the bad news. Like previous years, Google's most expensive hardware product is a tier below the Pro and Pro XL models when it comes to general specs like camera and charging, a choice that makes the Pro Fold a tough sell against more capable, non-folding flagships. This model also charges at up to 30W wired and 15W wireless, compared to the Pro XL's 45W wired and 25W wireless.\nThat leaves two, and one big difference\nGoogle has kept the feature parity between its Pro and Pro XL models fairly balanced over the years, and from a bird's-eye view, that remains true in 2025. But then you start to notice the minor ways in which the XL model pulls ahead and wonder if the gap has ever been larger.\nLike with the Pixel 10 Pro Fold, charging and endurance are the most notable differences between the Pro and Pro XL. The latter has both a larger battery (5,200mAh vs. 4,870mAh) and faster wired and wireless charging. It's also the only Pixel model this year to support the new Qi2.5 standard, allowing it to pull in wireless energy at a 25W rating.\nI've also found the Pro XL model's larger 6.8-inch screen more optimal for Google's various new AI features, whether it's for displaying Magic Cues in messages and phone calls, or photo tips when Camera Coach is turned on, cementing it as the phone I'll likely upgrade to this summer."
    },
    {
      "url": "https://www.zdnet.com/article/googles-veo-3-ai-video-generator-is-now-available-to-everyone-heres-how-to-try-it/#link=%7B%22role%22:%22standard%22,%22href%22:%22https://www.zdnet.com/article/googles-veo-3-ai-video-generator-is-now-available-to-everyone-heres-how-to-try-it/%22,%22target%22:%22%22,%22absolute%22:%22%22,%22linkText%22:%22Veo%203%22%7D",
      "text": "Google's Veo 3 AI video generator is now available to everyone - here's how to try it\nVeo 3, Google's new video-generating model that's been making waves across the internet, is now available for everyone in public preview, the company announced Thursday.\nThe tool was initially available only to subscribers of Gemini Ultra and through Flow, Google's AI-powered filmmaking platform that was also revealed at the most recent I/O. As of Thursday, it can be accessed as a public preview by all Google Cloud customers and partners in the Vertex AI Media Studio.\nAlso: The best AI image generators of 2025: Gemini, ChatGPT, Midjourney, and more\nUnveiled last month at I/O, Google's annual developer conference, Veo 3 is able to generate video with synchronized audio -- a long-standing technical challenge in the field. Imagine you prompt the system to generate a video set inside a busy subway car, for example. Veo 3 can produce the video, complete with AI-generated ambient background noise to add to the sense of realism. You can even prompt it to generate audio of human voices, according to Google.\nThe model also specializes in realistically simulating real-world physics, such as the fluid dynamics of water and the movement of shadows, making it a potentially valuable tool for filmmakers and advancing Google's broader mission of bringing usable AI to creative industries.\nUsers can create videos on Veo 3 via natural language text prompts, fine-tuning their instructions to modify subtle creative details -- \"from the shade of the sky to the precise way the sun hits the water in the afternoon light,\" the company wrote in a blog post on Thursday.\nUse cases - and drawbacks\nGoogle noted in its blog post that a range of companies are actively experimenting with Veo 3 to generate customer-facing content, including social media ads and product demos, as well as internal materials like training videos. One CEO described it as \"the single greatest leap forward in practically useful AI for advertising since gen AI first broke into the mainstream in 2023.\"\nAlso: Open-source skills can save your career when AI comes knocking\nGoogle and other leading AI developers have been investing heavily in tools designed to generate video from natural language prompts, betting that this will be a major practical use case for generative AI. AI avatar company Synthesia, for example, offers the technology as a way to make enterprise content faster and with fewer resources, including by letting users, like CEOs, replicate their likeness to create company video addresses.\nGet the morning's top stories in your inbox each day with our Tech Today newsletter.\nThe response among creative professionals has been mixed. Some see positive potential for the future of AI-assisted filmmaking; the acclaimed director Darren Aronofsky, for one, has formed a creative partnership with Google DeepMind. A similar deal has been struck between Lionsgate and the AI start-up Runway.\nOthers, however, have been critical of the growing encroachment of AI-generated video throughout creative industries. A video ad for Toys R' Us created using OpenAI's Sora last year, for example, received widespread online ridicule. Unions of entertainment workers are organizing to protect their jobs as the technology rapidly evolves.\nThat hasn't stopped tech companies from building and releasing new video-generating tools for marketers. Earlier this month, Amazon Ads announced the general launch across the US of its Video Generation tool; Meta has set its sights even higher, reportedly aiming to automate every step of the ad production process.\nA major technical challenge\nVeo 3 represents one of the first models from a major tech developer that can synchronize AI-generated video and audio. Meta's Movie Gen, released in October, is another. Some other tools, like Runway's Gen-3 Alpha, come with features that enable AI-generated audio to video in a post-production process, but the concurrent generation of the two requires the compute and resources of a major force like Google.\nAlso: I chatted with five AI bots - these made the best conversations\nBuilding AI models capable of generating synchronized video and audio has been a thorny technical challenge and an active area of research across the AI industry. Both AI-generated video and AI-generated audio are distinct technical challenges, and fusing them introduces a whole new dimension of complexity. Here's a demo of Veo 3.\nFor one thing, video is a series of still frames, whereas audio is a continuous wave. Syncing the two therefore requires models that can operate across these two modalities, accounting for the vastly different timescales in which they operate.\nAlso: Google Flow is a new AI video generator meant for filmmakers - how to try it today\nAn AI model fusing video with sound must also be able to dynamically account for variables like material, distance, and speed. A car driving at 100 miles per hour sounds a lot different than one traveling at 10 miles per hour; a horse walking on cobblestones sounds different than one that's walking on grass."
    },
    {
      "url": "https://www.zdnet.com/article/changing-these-10-settings-on-my-samsung-phone-greatly-improved-the-user-experience/",
      "text": "Changing these 10 settings on my Samsung phone greatly improved the user experience\nI've been fairly vocal recently that Samsung's One UI 7 is my favorite Android skin. It is fast, responsive, and intuitive. But nothing comes fine-tuned to your experience straight out of the box. You need to personalize your smartphone to make it more appealing. I change almost a dozen settings on every Samsung Galaxy phone to best suit my needs, and I believe these will elevate your user experience, too.\nAlso: The best Samsung phones to buy\nFrom setting the highest available screen resolution to more privacy-focused features, here are 10 Galaxy phone settings (plus a bonus) that I recommend changing to enhance your Galaxy phone experience. Please note that some settings might be phone-specific.\n1. Turn off pop-up notifications\nI do not like it when a message from a contact or an intrusive app notification pops up while I am in the middle of reading online or texting my favorite people. I get distracted easily. If a notification pops up, I tap on it and forget what I was doing.\nAlso: Everything announced at Samsung Unpacked this week: Z Fold 7, Watch 8 Classic, tri-fold phone, more\nIf you are anything like me, you should change this setting even before switching to gesture navigation. Go to Notifications > Notification pop-up style > Apps to show as brief > Toggle off All apps.\n2. Switch to gesture navigation\nUnless you are setting up your new Samsung Galaxy phone from an older model, it defaults to the older three-button navigation system. If you like it, that is fine. But I find Android's gesture navigation more intuitive -- everything is a swipe away instead of an on-screen button.\nIf you want that, you can change the system navigation to gestures by going to Settings > Display > Navigation bar > Swipe gestures.\n3. Set to the highest screen resolution\nSamsung's Galaxy S25 Ultra has the best display on a smartphone right now. Thanks to second-generation Gorilla Armor, it is less reflective and displays colors better than its predecessor. You get a sharp QHD+ screen, but it is not set to that resolution by default.\nYou need to go to Settings > Display > Screen resolution to get the best available display experience. It will use more battery, but the Ultra is an efficient smartphone. Even after maxing out the screen resolution, I still get an all-day battery life.\n4. Change the side key's function\nSmartphones no longer have a \"power button.\" It is called a side key or side button now, and it is one of my most disliked changes in recent times. Phone companies have renamed the power button to accommodate their smart assistants on long press.\nAlso: 5 preinstalled apps you should delete from your Samsung phone immediately\nGoogle's Gemini is available by other methods, and Bixby is not as useful anyway, so I suggest changing the side key's function to offer a power menu. You can do so by going to Settings > Advanced features > Side button > Long Press > Power off menu.\n5. Adjust lock screen notifications\nOne UI 7 has changed how notifications appear on your lock screen. It is set to show icons on the top left corner by default, which is a big change from the previous card view. I prefer apps to show notifications in the latter form. To change this, you can go to Settings > Notifications > Lock screen notifications > Cards.\nI also hide sensitive notification content on the lock screen because I do not want anyone to walk up to my phone and see my personal messages. To change this setting, you can opt for Hide content under the same Lock screen notifications menu.\n6. Sign in or sign up for a Samsung account\nI juggle between different phones but keep coming back to Samsung phones for One UI. Having a Samsung account is a big part of the user experience on Galaxy phones. From Samsung Wallet to Samsung's own password manager, I have a lot of information saved in them.\nAlso: I've tested every Samsung Galaxy S25 model - and my favorite isn't the Ultra\nMany might want to turn to Google Passwords for better cross-device functionality, but I still recommend signing up for a Samsung account to access Galaxy Themes (more on this below) and the Galaxy Store. It will also benefit you when you move from one Samsung phone to another with a seamless transfer.\n7. Install this app\nI recommend installing the Good Lock app from the Galaxy Store. It enables a slew of Samsung-exclusive features on your phone. I found the best use case for it when I was reviewing the Galaxy S25 Ultra. It features a module called Home Up that has a One Hand Operation+ function.\nAlso: I spent a week in New York City with the Samsung Z Fold 7 - and it spoiled me the entire time\nSince the new Samsung flagship is a big phone, I set up a swipe down from the right edge to access Quick Settings. You can do the same for six shortcuts within the Short swipe and Long swipe gestures, and access many more features within the Good Lock app.\n8. Uninstall the bloatware\nSamsung Galaxy phones come with many apps that you might not use. Unlike previous years, you can now uninstall or at least disable them to save memory. For example, I do not have a Samsung TV and do not want the Microsoft Copilot app on my phone, so I uninstall TV and CoPilot, respectively. Other apps I disable or uninstall include Facebook, Samsung Tutor, and OneDrive.\n9. Customize the home screen\nSamsung has some of the best widgets on a phone. I love the Calendar widget because I can adjust the transparency. As a result, it looks better and keeps the functionality intact without disturbing the layout of my home screen. I have it located on the top so everything is just a glance away, yet it never asks for attention -- unlike other opaque Calendar widgets.\nAlso: I bought Samsung's Galaxy Watch Ultra 2025, but I'd recommend this model instead\nI also change my icon grid to the 5x5 layout to accommodate more icons on the bottom-most row. They are just a thumb tap away. Additionally, I apply my wallpaper color tones to the app icons for a more pleasing look. You can go to Wallpaper and style > Color palette and toggle it on to apply wallpaper colors to the whole system. It is not perfect, and some icons might still not be supported. However, it looks better than the basic colors.\n10. Fix always-on display\nYou get efficient displays on Samsung phones -- make use of them and enable everything, including the Always On display. I like having the time, day, and date information right there on the screen, available at a quick glance. Samsung defaults it to the Tap to show setting, meaning you need to tap on the screen for information.\nI recommend changing that to Always to make it more functional. Go to Settings > Lock screen and AOD > Always-on Display > Always. You can choose if you want to display the wallpaper or not -- I have set it to just display a black screen so it does not drain more battery.\nBonus. Revert changes to the Notification Panel\nSamsung changed its notification panel design to an iOS-like drawer. A right swipe down gives you access to Quick Settings, whereas a swipe down from the left side of the screen gives you access to notifications. However, if you like the previous design better, you can change it.\nI like having my notifications under Quick Settings, like the good old days. To revert this new design element, swipe down from the top right corner of the home screen > Pencil icon > Panel Settings > Together. You can also edit the top quick settings within this menu.\nAlso: Every Samsung Galaxy S25 model compared: Which phone should you buy?\nA few other things I do on my Galaxy phones include changing the keyboard to Google Keyboard and sorting the home drawer icons in alphabetical order so it is easier to navigate. Samsung phones are some of the best on the market. While they do not promise over-the-top features, they are reliable and offer the most polished user interface with One UI. Just adjust these few settings, and you are all set. Enjoy your new Galaxy phone!\nGet the morning's top stories in your inbox each day with our Tech Today newsletter."
    },
    {
      "url": "https://www.zdnet.com/article/samsungs-new-galaxy-ai-features-are-what-iphone-users-wish-they-got-with-apple-intelligence/",
      "text": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nSamsung's new Galaxy AI features are what iPhone users wish they got with Apple Intelligence\nWhen Apple held its WWDC launch event in July, it unveiled Apple Intelligence, which represented a leap in mobile on-device AI, at least for iPhones, MacBooks, and iPads. However, since then, the company has yet to roll out its most promising features, with Genmoji being the best one available right now. That's why Samsung's Unpacked announcements this week are all the more significant.\nAlso: Everything announced at Samsung Unpacked 2025: Galaxy S25 Edge, Ultra, Gemini AI, more\nApple Intelligence's biggest advantage is providing users with a personal AI assistant that gets to know you and your data to provide seamless and integrated assistance -- at least on paper. Although Samsung did not unveil anything with as flashy branding, it did unveil a series of AI upgrades to both Galaxy AI and One UI 7 that, when working in tandem, provide users with an even greater experience. The best part is that they will be available on the devices at launch.\nI had the opportunity to demo each of the new AI features, and here are the ones giving Apple the biggest run for its money.\n1. Personal Data Engine\nAs implied by the inclusion of \"personal\" in the title, this is the most similar feature to the overarching principle of Apple Intelligence. Samsung's Personal Data Engine functions as a personal LLM that learns from you with your everyday device usage, ultimately creating an assistant that can anticipate your needs using the context of your phone activity.\nAlso: Every Samsung Galaxy S25 model compared: Which phone should you buy?\nEssentially, the Personal Data Engine learns what you do and what you want to do to provide you with all day support that predicts what you are about to do and display helpful insights.\nOf course, data concerns naturally arise from such an application, which Samsung addressed heavily upon launch. For starters, the experience can be turned on or off with a menu toggle. Even if you turn the feature on initially, if you change your mind and turn it off, all of your data is erased.\nWhen the toggle is on, the data is stored on the device, and not on the cloud, giving users the reassurance that their personal data will remain more heavily protected. However, the tradeoff of the extra security is that if you lose the device, your data is lost forever.\nUsing this information, it can provide tailored experiences for you such as Now Brief, a feature that gives you suggestions accessible via your Now Bar on the lock screen. Intended to anticipate your needs based on your routines and habits, it may suggest driving mode or display directions to a specific destination.\nAlso: Samsung Galaxy S25 Ultra hands-on: 3 major upgrades I'm looking forward to testing\nPersonal Data Engine will also provide morning and evening briefs, which each offer different relevant information depending on the time of day. Your morning brief may include summary of your sleep, weather forecasts for the day and schedule reminders. Your evening brief may include a summary of your day's events and photos you took. Either way, it is a helpful tool to give you the information you need without you having to look for it -- saving you time.\n2. Multi-app commands\nWhen an AI feature is implemented into a smartphone, to really be deemed useful, it should save people time by assisting them with a task they would have ultimately had to do themselves. The ability to ask Gemini to take a multi-step, multi-app action does exactly that.\nUsing natural language, you can now simply ask Gemini to perform actions across multiple apps, with a prompt such as, \"Search for the upcoming Warriors game and add to it to my calendar.\" There are many times a day where you could take advantage of Gemini chaining actions, such as looking for the best-rated restaurants and sending them to a friend, or finding the insights on a specific topic and sending them in an email.\nAlso: The best Samsung phones you can buy in 2025\nWhile Apple has hinted at a future where Siri can be more deeply integrated across apps and services, that's still unavailable to this day, months after the iPhone 16 and Apple Intelligence launched. Compared to the enhanced Gemini model running on Galaxy S25 phones, Apple's AI capabilities are much more elementary.\n3. AI Select\nAI Select can intelligently understand the contents of your screen and provide you with suggestions of actions that may help with your next steps. For example, if you are watching a video, if you toggle AI Select, it may suggest making a GIF for you, and when tapped, it will do so. A more practical example is if you see a site or a flyer with a date, if you tap AI Select, it will suggest adding it to your Samsung Calendar for you.\nIt essentially brings the same experience of Circle to Search in which you can just circle something to learn more about it, but instead of searching the web, suggests actions you can take within your phone. I think this is particularly helpful because it allows you to save time in the long-run, being able to minimize the amount of apps you have to open, and the time it takes to manually input information.\nAlso: Is this the OnePlus Open 2? Oppo's new foldable phone is as thin as its USB-C port\nApple has yet to roll out a similar feature to new phones, although it did say that Siri would have on-screen awareness, which could accomplish similar tasks. This feature will likely roll out in the upcoming months, but once again, gives Samsung the lead.\nBonus: Natural language search for everything\nUsing natural language instead of specifically-worded keywords to look for things is one of the best applications of AI, and one Apple has already implemented within their devices. Now, Samsung joins the party, introducing natural language search for photos and settings.\nNow you could say prompts such as, \"Find photos from my trip to Italy two years ago,\" or \"Help me make the text on my screen a lot bigger\" and find what you need within seconds.\nAlso: This secret Pixel camera feature makes your photos appear more vibrant - how to enable it\nGoogle Photos has a much more superior photo search engine than Apple's Photos gallery, showing pictures that are much more relevant to your search prompt. If Samsung implements the same technology by using Gemini, it will be much better than Apple's counterpart."
    }
  ],
  "argos_summary": "The article compares Google’s Pixel 10 Pro Fold and Samsung’s Galaxy Z Fold 7, highlighting the Pixel’s first IP68 dust‑water rating, lower price ($1,800 vs $2,000), free one‑year Gemini AI Pro subscription, and PixelSnap magnetic Qi2 charging. Samsung offers a slimmer hinge, a 120 Hz LTPO display, and a 6‑month free Gemini AI Pro, but at a higher cost and with a less durable hinge. Both phones target users looking for foldable convenience, with the Pixel appealing to budget‑savvy and AI‑centric buyers, while Samsung attracts those prioritizing design refinement and premium features. The piece notes the Pixel’s IP68 advantage in dusty environments and the Galaxy’s superior crease and display performance as key differentiators.",
  "argos_id": "T9C9G9O1V"
}