{
  "url": "https://www.nytimes.com/athletic/6586289/2025/09/01/atlanta-falcons-right-tackle-defensive-linemen-michael-penix/",
  "authorsByline": "Josh Kendall",
  "articleId": "d7b3c118e8a14b7d8a1a672c46e5650c",
  "source": {
    "domain": "nytimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "AZ",
      "county": "Pima County",
      "city": "Tucson",
      "coordinates": {
        "lat": 32.1988848,
        "lon": -110.8218543
      }
    }
  },
  "imageUrl": "https://static01.nyt.com/athletic/uploads/wp/2025/08/31100531/GettyImages-2231582549-scaled.jpg?width=1200&height=630&fit=cover",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-01T09:05:03+00:00",
  "addDate": "2025-09-01T09:29:55.106058+00:00",
  "refreshDate": "2025-09-01T09:29:55.106060+00:00",
  "score": 1.0,
  "title": "Falcons mailbag: What’s up at right tackle? Why so few D-linemen? Does Penix need more reps?",
  "description": "The Atlanta Falcons have brought in three new right tackles in the last week. Do any of them have a chance to start?",
  "content": "FLOWERY BRANCH, Ga. — The regular season is finally here; Atlanta hosts NFC South rival Tampa Bay Sunday at Mercedes-Benz Stadium. Before that, though, there are some lingering questions for head coach Raheem Morris heading into Year 2.\n\nSo, we’re going to try to answer as many of them as we can as we dive into a Falcons mailbag. We’ll start at the most worrisome spot, right tackle, where you all seem to be wondering, “Is this all there is?”\n\nEditor’s note: Questions were edited for length and clarity.\n\nWith the loss of Kaleb McGary and Michael Penix Jr.’s injury history, shouldn’t the Falcons be doing more than bargain basement shopping to replace his blindside blocker? — Josh R.\n\nTrent Brown and Kenyon Green were two players I thought the Falcons might be interested in at right tackle, but apparently, they’ve decided to go in another, more developmental direction. Thoughts? Also, who is the backup center? — MJ\n\nMichael Jerrell was likely to make the Seattle Seahawks’ final roster, so he’s not nothing, but surely he can’t be their final move at right tackle. — David H.\n\nFor starters, yes, I believe this is it as far as offensive line moves go. In addition to sending a conditional seventh-round pick to Seattle for Jerrell, the Falcons signed Carter Warren and Ryan Hayes after they were released by the New York Jets and Miami Dolphins, respectively. Those pickups probably don’t ease David’s concerns, though. (And, MJ, the backup center is Jovaughn Gwyn.)\n\nNone of them is competing for the starting job in Week 1. That is expected to go to Elijah Wilkinson, an eight-year veteran with starting right tackle experience in the league, although Morris has said Brandon Parker and rookie Jack Nelson are also competing for the job.\n\nNo matter how good the new tackles are, it would be very difficult for any player to step in and start in less than two weeks. That’s especially true in Atlanta, where the Falcons’ zone-run game puts an especially high premium on cohesion among the five starters. In fact, Wilkinson, who spent the 2022 and 2024 seasons in Atlanta, said getting his zone-blocking timing down with right guard Chris Lindstrom will be tougher than the pass-blocking responsibilities he assumes.\n\nRunning behind Lindstrom and McGary had become something of a cheat code for the Falcons. Atlanta averaged 5.3 yards per carry (fifth in the league) while running to the right last season, according to Next Gen Stats. That fell to 4.0 (28th in the league) when the team ran left.\n\nWhether Wilkinson can hold the job is an open question. He’s only started more than 10 games in a season three times in his career, and the last time was in 2021. Warren’s pedigree suggests he’s the most likely of the trio to get into the starting lineup conversation at some point this year.\n\nWarren was a fourth-round pick by the Jets in 2023 out of the University of Pittsburgh, where he was a four-year starter at left tackle. At the time, these were The Athletic’s Dane Brugler’s thoughts on that pick: “As a pass blocker, Warren is efficient in his setup and displays effective use of independent hands mid-engagement. He creates vertical displacement in the run game (when he wants to), but his inconsistent leverage and hand technique lead to negative reps.”\n\nJerrell and Hayes feel more like developmental prospects. Jerrell was a sixth-round pick with a basketball background but without ideal NFL offensive line size, and Hayes was a seventh-round pick and doesn’t have a great track record as a run blocker.\n\nMy predictions are that McGary (leg) will have a lot more fans in the Falcons’ fan base in a month, and Storm Norton (ankle) will be in the thick of the offensive line conversation as soon as he’s healthy, which might not be until the second half of the season.\n\nDon’t the Falcons need more than five interior defensive linemen on the roster? — Rick W.\n\nOur roster is heavy on edge rushers and very light on run-stopping defensive tackles. Should we be worried that the heavy offseason emphasis on improving the pass rush has led to neglect of the run defense? — Jason M.\n\nWhy did the Falcons keep so many wide receivers and linebackers? Are they only planning to play two of their defensive linemen on a given play, and that’s why they only have five? It sure seems like they think they’re going to score a lot of points because this defense is getting run over. — Paul M.\n\nI don’t know if y’all need to be worried about the run defense, but I am. Like Rick, I was surprised Atlanta only kept five interior defensive linemen on the initial 53-man roster, especially after defensive line coach Nate Ollie spent all offseason talking about how he wanted to limit his players to four snaps in a row and send out linemen in “waves.” How the Falcons will manage that with just five bodies, I don’t know. Morris didn’t seem worried about that prospect last week and pointed out that Atlanta has Kentavius Street on its practice squad. I would expect Street to get elevated to the active roster multiple times this season if he’s not added to the 53-man roster directly before long. Atlanta could also get Ta’Quon Graham off injured reserve before the midpoint of the season.\n\nThe Falcons were 26th in run defense success rate last season (57.7 percent) and 20th in run defense EPA (1.7 per 100 snaps). For that to improve this year, second-year tackle Ruke Orhorhoro will have to prove himself as a run defender, and former undrafted free agent LaCale London has to pay off the confidence Atlanta has shown by keeping him on the 53-man roster ahead of Street.\n\nWhat is the Falcons’ actual Super Bowl window? What is Terry Fontenot’s plan for this team to get back there? Thomas Dimitroff at least built a team with a Super Bowl window — albeit a very short-lived one with an underwhelming performance. — Michael V.\n\nI’m sorry, but I don’t think this team has a Super Bowl window right now. I think it’s healthier to think about it as a playoff window. When Arthur Smith and Fontenot were hired in 2021, they placed a high premium on building an organization that could be an annual contender — if not for the Super Bowl, then at least to be in the conversation every year.\n\nThat required two years of growing pains, shedding unfavorable contracts and trading a franchise quarterback. Those Falcons were so focused on not getting ahead of the process and avoiding a bad long-term decision that they put their hopes in third-round quarterback Desmond Ridder to keep Atlanta competitive while building the roster around him.\n\nThat didn’t work, which brings us to 2024, when the Falcons signed Kirk Cousins to the largest free-agent deal in NFL history and then added veteran defenders Matt Judon and Justin Simmons. All three were win-now moves. Patience didn’t work, so Atlanta was trying the opposite approach.\n\nRemember, it looked like it was working for a while. The Falcons were 6-3 and had a two-game lead in the division last year before things fell apart.\n\nNow that Atlanta has gone to a more aggressive, year-to-year approach in team building, it’s hard to go back. That’s how you end up trading a future first-round draft pick to take two edge rushers in the first round this year.\n\nThe Falcons are not Super Bowl contenders, but if their most aggressive moves from the last two years (Penix Jr., Jalon Walker and James Pearce Jr.) are difference-makers, they could be division winners and give somebody a tough day in the playoffs.\n\nI was surprised Penix Jr. didn’t get any reps in preseason, given his inexperience. What’s the thinking here? Was it just to avoid injuries? — Seth S.\n\nIt’s not a satisfying answer, but yes, it’s as simple as that. And if I’m being honest, I don’t think it’s a big deal or that the success or failure of this season hinges on this issue. Kirk Cousins didn’t play in the preseason last year, and Atlanta started 6-3. The Falcons believe their practice structure (almost exclusively 11-on-11 with very few seven-on-seven snaps in team work) prepares players just as well as, if not better than, preseason games.\n\nAssuming the Falcons don’t make the playoffs, will that finally motivate Arthur Blank to clean house and start over entirely?— Will H.\n\nWithout wanting to start on a downer (although I think we might all be there to some extent!), do you feel “success” this season is the same for everyone in the building? I’m assuming for the general manager, this is a playoffs-or-out scenario. Do you think that’s the same bar for Morris, or do you get the sense he’d be given a third year under a new general manager if the team were to fall short (say with a similar record to last year)? — David W.\n\nI would be shocked if Morris is fired after two seasons, regardless of the record. I do think it’s a critical year for Fontenot, who is entering Year 5 and has yet to preside over a team with a winning record. If Atlanta misses the postseason for the eighth straight time, I do think Blank will make a change.\n\nWith McGary gone and the strong-side run weakened, how will Zac Robinson formulate his offensive strategy against Tampa Bay? Will we run to the right to surprise? Run to the left to counter? Come out attacking with the pass? And when we pass, will we surprise and throw to Kyle Pitts or Bijan Robinson or Ray-Ray McCloud/Darnell Mooney over Drake London, since Tampa is no doubt looking for the Penix-London connection? — Seaborn H.\n\nI’ll go in reverse order here and start by saying I don’t think anything is going to stop Penix from looking for London first and foremost all season long. London led the NFL in targets last year after Penix took over the starting job, and training camp made it look like that is going to continue this season.\n\nI also don’t think Atlanta will abandon the run despite McGary’s loss. So much of what the Falcons do offensively is built off of it. Atlanta was ninth in the league last year in rush percentage (45.6).\n\nBeyond that, I’m going to be waiting and seeing on the plan, just like you.\n\nIs kicker Younghoe Koo on thinner ice than we’re told? – Charles O.\n\nFirst of all, I think every kicker is on thin ice every week. That Atlanta brought in Lenny Krieg this offseason doesn’t really change the fact that the Falcons could replace Koo at any time, considering the number of free-agent kickers who are always available.\n\nHowever, I don’t think Morris’ comments can be dismissed. So much of a kicker’s job security rests on his head coach’s confidence in him, and I think Morris’ confidence is sincere. He has forgiven Koo for last year. If the veteran is shaky to start, though, Krieg is right there.",
  "medium": "Article",
  "links": [
    "https://www.nytimes.com/athletic/6582489/2025/08/29/falcons-elijah-wilkinson-right-tackle-week-1/"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "last year",
      "weight": 0.07711175
    },
    {
      "name": "last season",
      "weight": 0.06873249
    },
    {
      "name": "Year",
      "weight": 0.06506549
    },
    {
      "name": "year",
      "weight": 0.06506549
    },
    {
      "name": "Falcons",
      "weight": 0.061022438
    },
    {
      "name": "Falcons mailbag",
      "weight": 0.060403243
    },
    {
      "name": "starting right tackle experience",
      "weight": 0.058920506
    },
    {
      "name": "Atlanta",
      "weight": 0.055775855
    },
    {
      "name": "run defense success rate",
      "weight": 0.055654794
    },
    {
      "name": "right tackle",
      "weight": 0.054689284
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Auto"
    },
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.97998046875
    },
    {
      "name": "/Sports/Team Sports/American Football",
      "score": 0.9716796875
    }
  ],
  "sentiment": {
    "positive": 0.10492922,
    "negative": 0.48047274,
    "neutral": 0.41459805
  },
  "summary": "The Falcons are facing some serious questions ahead of their season opener against Tampa Bay. The team's lack of defensive linemen and lack of experienced players are causing concern for head coach Raheem Morris. The most concerning spot is right tackle, where Kaleb McGary and Michael Penix Jr. have both been sidelined due to injury. The Falcons signed Carter Warren and Ryan Hayes after being released by the New York Jets and Miami Dolphins. However, there are concerns about the potential replacements for these players. The starting job is expected to be held by Elijah Wilkinson, an eight-year veteran with starting right tackle experience in the league, although Brandon Parker and rookie Jack Nelson are also competing for the position.",
  "shortSummary": "The Falcons face challenges at right tackle and defensive injuries, with new signings like Carter Warren and Ryan Hayes raising concerns about the team's defensive system.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "7fcf1ab6b9d9484a9b8d2744b8c9c6b1",
  "places": [
    {
      "osmId": "536744534",
      "road": "Andrew Young International Boulevard",
      "city": "Atlanta",
      "county": "Fulton County",
      "state": "Georgia",
      "postcode": "30313",
      "country": "United States",
      "countryCode": "us",
      "neighbourhood": "Castleberry Hill",
      "coordinates": {
        "lat": 33.7554123,
        "lon": -84.40084932004368
      }
    }
  ],
  "scraped_sources": [
    {
      "url": "https://www.nytimes.com/athletic/6582489/2025/08/29/falcons-elijah-wilkinson-right-tackle-week-1/",
      "text": "FLOWERY BRANCH, Ga. — In the wake of a season-ending injury to right tackle Kaleb McGary, the Atlanta Falcons added three new offensive linemen to their roster in the last two days. But it doesn’t sound like any of them will be taking McGary’s place anytime soon.\n“I wouldn’t say they are all competing,” Falcons coach Raheem Morris said Thursday. “The guys that are really competing are the guys who have been here, the guys who know what’s going on and everything that is happening.”\nAdvertisement\nThat means Elijah Wilkinson, Brandon Parker or rookie Jack Nelson should be expected to open the game when Atlanta kicks off its season at home Sept. 7 against Tampa Bay — and the smart money is on Wilkinson.\nMorris said that his coaching staff already knows who it plans to start on the right side against the Buccaneers, and on Thursday, Wilkinson was working with the starting group in drills during the portion of practice open to the media.\n“That’s the way it looks to me,” Wilkinson said after practice when asked if he was expecting to be the starter. “I’m pretty comfortable.”\nThe eight-year veteran has started 45 games in the NFL, including 19 at right tackle for the Denver Broncos in 2019 and 2020. Wilkinson joined the team as an undrafted rookie in 2017.\n“I’m comfortable with him, I really am,” Falcons offensive line coach Dwayne Ledford said. “When we got Elijah here (in 2022), most of what we saw was him playing tackle. He’s got great length, he’s athletic, we’ve used him a lot at tackle in training camp, so I like what I see there.”\nWilkinson has played for the Broncos, Chicago Bears, Arizona Cardinals and Falcons. He started 12 games for Denver in 2019 and has started 26 in the five seasons since. Brandon Thorn, a scouting coordinator for OL Masterminds and the owner of the Trench Warfare newsletter, described Wilkinson on Thursday as “big, thickly built, very physical,” but not the ideal option as a regular starter.\n“He has some power to him, heavy hands, but a little wild, loose, uncontrolled (and) will lose glaringly in pass protection when he’s isolated,” Thorn said. “He’s a marginal-level pass protector anytime he’s isolated, so that’s the issue, and having zero experience next to (right guard) Chris Lindstrom with the run game stuff, that’s concerning. I’ll be shocked if he’s the starter all year.”\nAdvertisement\nAfter McGary’s injury, Thorn dropped the Falcons from 13th to 23rd in his offensive-line unit rankings, but he emphasized that he hadn’t studied Wilkinson closely since his days as a regular starter with the Broncos.\n“You can win football games with that, but I think it’s going to be harder now,” he said.\n#Falcons RT Kaleb McGary (leg) done for season after injury in practice last week.\nOur @BrandonThornNFL has dropped the unit from 13th to 23rd in his ranks. https://t.co/VxxwaPBQ6z pic.twitter.com/Upg4aVX1Os\n— Adam Levitan (@adamlevitan) August 26, 2025\nIn contrast, Morris said he was “really fired up” about Wilkinson after watching him work in training camp. That didn’t stop the Falcons, though, from making a flurry of moves to strengthen their depth at the position.\nAfter McGary’s injury, the Falcons traded a conditional seventh-round pick to the Seattle Seahawks for second-year tackle Michael Jerrell, who was added to the 53-man roster Wednesday. A sixth-round pick in 2024, he started three games as a rookie. On Thursday, the Falcons signed Carter Warren and Ryan Hayes, who were released by the New York Jets and Miami Dolphins, respectively, earlier in the week. Warren was a fourth-round pick in 2023 who has started six games in the last two years. Hayes was a seventh-round pick in 2023 who has appeared in one game.\n“We definitely added some significant pieces in that area to give us a little more depth,” Morris said. “It’d be unrealistic for me to tell you they’ll be ready Week 1.”\n“It’s a lot that (the new guys) are taking in right now, but we have some great leaders in that room,” Ledford said. “You sense Chris Lindstrom and Matthew Bergeron and Jake Matthews rallying to try to help catch guys up and the urgency. Here in a week, it’s real.”\nNelson was not on the field during the open portion of Thursday’s practice, but the Falcons did not provide an update on his status. Storm Norton, who was Atlanta’s top backup at both tackle positions last year, is on the injured reserve list after having ankle surgery. The earliest he could return is Week 6 against the Buffalo Bills.\nAdvertisement\nAtlanta considered moving left guard Bergeron, who played left tackle at Syracuse, to McGary’s position but decided against it. At least for now, Morris said.\n“He’s definitely a guy who could still go out there at any point,” Morris said. “I’ve got high regard for Bergeron. He’s one of the guys who’s very unique in his ability to do many things. He’s always going to be one of the guys considered.”\nWhile Wilkinson takes over the blind-side blocking responsibilities because Falcons quarterback Michael Penix is left-handed, the bigger problem could be McGary’s loss in run blocking.\n“We run the ball significantly better to the right side — there’s no secret there — because of guys like McGary and Lindstrom,” Morris said. “That’s definitely more of a deal than the blind-side protection. The reason you can downplay some of the blind-side protection stuff is the shotgun stuff. When I’m standing like this (in shotgun), I can see that instead of there being a blind side. When you receive the ball, it’s not as blind as it used to be.”\nAtlanta’s reliance on zone-blocking run schemes makes the loss of any part of the offensive line a bigger issue because of the cohesion needed in zone blocking, Thorn said.\n“McGary and Lindstrom had a palpable continuity,” Thorn said. “Their spacing, their timing, their fits, everything was just really good. Losing that throws in more variance to the run game. I think the run game, for sure, is going to take a step back. How dramatic remains to be seen.”\n(Photo of Elijah Wilkinson: David J. Griffin / Icon Sportswire via Getty Images)"
    }
  ],
  "argos_summary": "The Atlanta Falcons added three offensive linemen—Michael Jerrell, Carter Warren, and Ryan Hayes—after right tackle Kaleb McGary suffered a season‑ending injury, but head coach Raheem Morris says none will start until later in the season.  Wilkinson, Parker, or rookie Nelson are expected to open the season at right tackle, with Wilkinson the most likely starter.  The move deepens a line that has struggled with cohesion in its zone‑blocking scheme, and the loss of McGary is expected to hurt the Falcons’ right‑side run game until the new players acclimate.",
  "argos_id": "TE8IXGR12"
}