{
  "url": "https://qz.com/ford-evs-electric-truck-louisville-jim-farley",
  "authorsByline": "Shannon Carroll",
  "articleId": "8a234ce28cff4d58af430e58441e1ed0",
  "source": {
    "domain": "qz.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "AZ",
      "county": "Pima County",
      "city": "Tucson",
      "coordinates": {
        "lat": 32.1988848,
        "lon": -110.8218543
      }
    }
  },
  "imageUrl": "https://qz.com/cdn-cgi/image/width=300,quality=85,format=auto/https://assets.qz.com/media/GettyImages-2229439045.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T17:06:46.482000+00:00",
  "addDate": "2025-08-11T19:57:07.496990+00:00",
  "refreshDate": "2025-08-11T19:57:07.496992+00:00",
  "score": 1.0,
  "title": "Ford invests $5 billion on EV plant expansion, electric trucks",
  "description": "The automaker’s Kentucky factory revamp is the first step in its plan to deliver affordable, mass-market EVs — starting with a truck in 2027",
  "content": "The automaker is investing nearly $2 billion to overhaul its 70-year-old Louisville Assembly Plant, transforming a gas-vehicle-era workhorse into the launchpad for a midsize, four-door electric pickup that the company says will start around $30,000 when it rolls out in 2027.\n\nPaired with a $3 billion battery plant in Michigan, the two projects represent a $5 billion bet on making EVs that can compete on price, quality, and scale — without bleeding red ink. Ford said the work will create or secure almost 4,000 U.S. jobs, including about 2,200 in Louisville.\n\nWhat’s coming to life is an “assembly tree,” where three sub-lines feed into one, which Ford said will shave 15% off build time and cut part counts by 20% and workstations by 40%.\n\nThe new truck will be the first built on Ford’s “Universal EV Platform,” which is designed for a family of affordable, software-enabled electric vehicles. The company says the architecture uses 20% fewer parts and 25% fewer fasteners than comparable models, trims the wiring harness by more than 4,000 feet, and incorporates lithium-iron-phosphate prismatic batteries that double as the vehicle floor. The design lowers the center of gravity for better handling and frees up more passenger space — Ford claims it’ll have more than the latest Toyota RAV4 — along with a “frunk” and a bed.\n\nOn the company’s most recent earnings call, Ford’s CEO, Jim Farley, cast the endeavor as a “Model T moment,” positioning the project as a breakthrough in bringing EVs to the mass market. The goal: deliver an EV that’s affordable, efficient, and built by American hands — and that actually makes money. The company’s EV unit, Model e, lost more than $5 billion in 2024 and another $1.3 billion in the second quarter of this year. With federal EV tax credits set to shrink, Ford needs lower costs to compete with Tesla, GM, and a growing slate of cheaper Chinese players such as BYD.\n\nThe electric truck is designed to be more affordable than Ford’s current F-150 Lightning, which has seen limited market appeal due to the higher price point that it carries. The vehicle will compete against coming electric trucks from other manufacturers such as General Motors and Rivian.\n\n“We took inspiration from the Model T – the universal car that changed the world,” Doug Field, Ford’s chief EV, digital, and design officer, said in the press release. “We assembled a really brilliant collection of minds across Ford and unleashed them to find new solutions to old problems. We applied first‑principles engineering, pushing to the limits of physics to make it fun to drive and compete on affordability. Our new zonal electric architecture unlocks capabilities the industry has never seen. This isn’t a stripped‑down, old‑school vehicle.”\n\n​​Ford’s strategy is in contrast with some of its competitors in the auto industry. GM has scaled back some of its electric vehicle targets, while other automakers have expressed caution about EV investments amid concerns about profitability and consumer demand. Right now, the EV market faces headwinds: high battery costs, supply chain challenges, and intense price competition. Still, Ford is betting that improvements in manufacturing efficiency and scale will eventually lead to profitability — and that it can develop EVs for mainstream consumers.\n\n“We have all lived through far too many ‘good college tries’ by Detroit automakers to make affordable vehicles that ends up with idled plants, layoffs and uncertainty,” Farley said in a press release. “So, this had to be a strong, sustainable and profitable business. From Day 1, we knew there was no incremental path to success. … We tore up the moving assembly line concept and designed a better one. And we found a path to be the first automaker to make prismatic LFP batteries in the U.S.”\n\nKentucky officials are backing the project with incentives through the state’s Economic Development Finance Authority. The plant will also get a 52,000-square-foot expansion and a digital network upgrade to support more quality checks. The Louisville plant is expected to keep producing gas-powered SUVs alongside the new EVs during the transition, with full EV capacity ramping up ahead of the 2027 truck launch. If the strategy works, it could give Ford a template for converting other legacy plants — and a much-needed foothold in a segment where price, speed, and scale now decide the winners.",
  "medium": "Article",
  "links": [
    "https://qz.com/top-tesla-leaders-departures",
    "https://qz.com/ford-evs-electric-truck-louisville-jim-farley",
    "https://qz.com/trump-china-tariff-pause-august",
    "https://qz.com/trump-forever-war-trade-tariffs",
    "https://www.businesswire.com/news/home/20250811460533/en/Fords-%245B-Bet-on-America-Innovation-Meets-Efficiency-in-New-EV-Platform-Assembly-Process-and-Midsize-Truck",
    "https://qz.com/most-popular-books-of-2025"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Ford",
      "weight": 0.07834412
    },
    {
      "name": "EV plant expansion",
      "weight": 0.07703191
    },
    {
      "name": "affordable vehicles",
      "weight": 0.066889055
    },
    {
      "name": "electric trucks",
      "weight": 0.065858155
    },
    {
      "name": "coming electric trucks",
      "weight": 0.065644465
    },
    {
      "name": "EV investments",
      "weight": 0.06377472
    },
    {
      "name": "other legacy plants",
      "weight": 0.063653946
    },
    {
      "name": "full EV capacity",
      "weight": 0.06280213
    },
    {
      "name": "federal EV tax credits",
      "weight": 0.06006631
    },
    {
      "name": "high battery costs",
      "weight": 0.05890264
    }
  ],
  "topics": [
    {
      "name": "Green Energy"
    },
    {
      "name": "Electric Vehicles"
    }
  ],
  "categories": [
    {
      "name": "Auto"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.97998046875
    },
    {
      "name": "/Business & Industrial/Automotive Industry",
      "score": 0.89501953125
    },
    {
      "name": "/Autos & Vehicles/Motor Vehicles (By Type)/Hybrid & Alternative Vehicles",
      "score": 0.87890625
    },
    {
      "name": "/News/Technology News",
      "score": 0.57666015625
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.47314453125
    },
    {
      "name": "/Autos & Vehicles/Vehicle Parts & Services/Vehicle Parts & Accessories",
      "score": 0.305908203125
    }
  ],
  "sentiment": {
    "positive": 0.5999775,
    "negative": 0.060577493,
    "neutral": 0.33944505
  },
  "summary": "Ford is investing nearly $2 billion to overhaul its 70-year-old Louisville Assembly Plant and prepare for a midsize, four-door electric pickup that the company estimates will start at around $30,000 when it launches in 2027. The project, paired with a $3 billion battery plant in Michigan, represents a $5 billion bet on making EVs that can compete on price, quality, and scale without causing significant financial losses. Ford's CEO, Jim Farley, called this a “Model T moment” for bringing EVs to the mass market. The new truck will be built on Ford’s “Universal EV Platform” which uses 20% fewer parts and 25% fewer fasteners than comparable models, and incorporates lithium-iron-phosphate prismatic batteries that double as the vehicle floor. The Louisville plant is expected to keep producing gas-powered SUVs alongside the new EVs during the transition of full EV capacity.",
  "shortSummary": "Ford is investing $5 billion to upgrade its Louisville Assembly Plant and produce affordable electric trucks, creating nearly 4,000 jobs globally.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "41f67da18d68491d923e8d86fed5b56c",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Ford is investing nearly $2 billion to revamp its Louisville Assembly Plant for the production of a new midsize electric pickup truck, set to launch in 2027 at a starting price of around $30,000. This initiative, alongside a $3 billion battery plant in Michigan, aims to create nearly 4,000 jobs and enhance manufacturing efficiency by reducing build time and part counts. The new truck will utilize Ford's 'Universal EV Platform,' designed to be affordable and competitive in the growing electric vehicle market, which faces challenges such as high battery costs and intense competition.",
  "argos_id": "005XGNIN1"
}