{
  "url": "https://www.usatoday.com/story/sports/nfl/steelers/2025/08/11/cam-heyward-contract-negotiation-steelers/85618469007/",
  "authorsByline": "Chris Bumbaca",
  "articleId": "678f6fab020a45048a804d361227905f",
  "source": {
    "domain": "usatoday.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "VA",
      "county": "Fairfax County",
      "city": "McLean",
      "coordinates": {
        "lat": 38.9342888,
        "lon": -77.1776327
      }
    }
  },
  "imageUrl": "https://www.usatoday.com/tangstatic/sites/usat/og-image-q1a2z3fb72acfa.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T23:02:20+00:00",
  "addDate": "2025-08-11T23:04:08.620503+00:00",
  "refreshDate": "2025-08-11T23:04:08.620505+00:00",
  "score": 1.0,
  "title": "Pittsburgh Steelers' Cam Heyward explains desire for new deal, says he could sit out games",
  "description": "Pittsburgh Steelers All-Pro defensive lineman Cam Heyward says he wants a new deal that reflects his caliber of play from the 2024 season.",
  "content": "Last offseason, as he signed a new contract with the Pittsburgh Steelers, Cam Heyward apparently told team brass that after he had an All-Pro season, he would be back at the negotiating table for a new deal.\n\nHeyward made true on his prediction in 2024 and earned first-team All-Pro honors for the fourth time in his career, all 14 seasons of which have been with the Steelers.\n\nBut through the offseason and first few weeks of training camp, a new deal for Heyward has yet to materialize. The 36-year-old has been off to the side during much of the team drills at camp, while still maintaining a presence during individual work – what has been dubbed, in the NFL world, as a \"hold in.\"\n\nHeyward's current deal, which includes the 2025 and 2026 seasons, calls for him to be paid $29 million total.\n\n“Honestly, I’m looking to be valued,\" Heyward said. \" … I know what I bring to this team and what I’m capable of on and off the field. It’s hard for me, after the year I’ve had, to justify playing at the number I’m playing at.\n\n\"To be completely honest with you, I told them, 'When I have an All-Pro year, expect me to come back (to the negotiating table).' And you can look at the contract and see what it was. I think everybody kind of giggled a little bit. But in my head, I used it as my motivation to go out there and prove it.\"\n\nHeyward had eight sacks and broke up 11 passes (a career high) last season to go with 20 quarterback hits. The Ohio State product and 2011 first-round pick said that he made his request for a new deal in February. When asked whether he would consider missing regular-season games to receive a new deal, he replied: \"There are definitely options out there that could reflect that.\"\n\nSteelers head coach Mike Tomlin didn't seem concerned with Heyward's request and incomplete participation.\n\n\"Cam's been doing this a long time,\" Tomlin said. \"I don't work Cam a lot in these scenarios anyway.\"\n\nIt has been an impatient offseason for Heyward, who in March complained on his podcast about the lack of movement when it came to the Steelers signing quarterback Aaron Rodgers.",
  "medium": "Article",
  "links": [
    "https://www.usatoday.com/story/sports/nfl/steelers/2025/03/18/cameron-heyward-aaron-rodgers-steelers-qb-situation/82519592007/",
    "https://www.usatoday.com/sports/nfl/pittsburgh-steelers",
    "https://www.usatoday.com/picture-gallery/sports/nfl/2025/08/07/nfl-preseason-week-1-photos/85568485007/",
    "https://sportsdata.usatoday.com/football/nfl/teams/pittsburgh-steelers/356"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "new deal",
      "weight": 0.10869192
    },
    {
      "name": "Cam Heyward",
      "weight": 0.10739644
    },
    {
      "name": "Heyward",
      "weight": 0.09345944
    },
    {
      "name": "last season",
      "weight": 0.09096155
    },
    {
      "name": "season",
      "weight": 0.08393494
    },
    {
      "name": "Steelers head coach Mike Tomlin",
      "weight": 0.08367784
    },
    {
      "name": "team brass",
      "weight": 0.08027657
    },
    {
      "name": "Steelers",
      "weight": 0.07527392
    },
    {
      "name": "first few weeks",
      "weight": 0.07470599
    },
    {
      "name": "Pittsburgh Steelers Cam Heyward",
      "weight": 0.07353764
    }
  ],
  "topics": [
    {
      "name": "Football"
    },
    {
      "name": "NFL"
    },
    {
      "name": "Pittsburgh Steelers"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.97607421875
    },
    {
      "name": "/Sports/Team Sports/American Football",
      "score": 0.958984375
    }
  ],
  "sentiment": {
    "positive": 0.05079817,
    "negative": 0.7220954,
    "neutral": 0.22710648
  },
  "summary": "Pittsburgh Steelers' Cam Heyward has expressed his desire for a new contract with the team, stating that after he had an All-Pro season, he would return to the negotiating table for a fresh deal. However, this has not occurred so far. Heyward's current deal, which includes the 2025 and 2026 seasons, is worth $29 million. He also stated that he would consider missing regular-season games to receive a new deal.",
  "shortSummary": "Pittsburgh Steelers' Cam Heyward expressed a desire to secure a new contract after an All-Pro season, and may skip regular season games to achieve it.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "2d6b16a89f7f4059b5b477fa55919fc7",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.usatoday.com/story/sports/nfl/steelers/2025/03/18/cameron-heyward-aaron-rodgers-steelers-qb-situation/82519592007/",
      "text": "Cam Heyward 'tired' of waiting on Aaron Rodgers' Steelers decision\nCameron Heyward actively pushed for veteran quarterback Russell Wilson to sign with the Pittsburgh Steelers last offseason. Aaron Rodgers shouldn't expect to receive that same courtesy.\nPittsburgh's four-time All-Pro defensive lineman said on the Tuesday episode of his \"Not Just Football\" podcast that he's not going out of his way to pitch Rodgers on joining the Steelers.\n\"Not Just Football\" co-host Hayden Walsh asked Heyward if he'd join Rodgers on one of the quarterback's infamous \"darkness retreat\" if it meant the quarterback would come to Pittsburgh.\nHeyward responded, \"I ain't doing that darkness retreat. I don't need any of that crap. Either you want to be a Pittsburgh Steeler or you don't. It's that simple. That's the pitch. If you want me to recruit, that's the recruiting pitch. Pittsburgh Steelers. If you want to be part of it, so be it. If you don't, no skin off my back.\"\n\"I just want to play football. I'm tired of talking about the quarterback situation. I'd rather have it done. I don't know what ends up happening. I'm ready to move on into free agency. There's too much going on.\"\nSteelers QB depth chart\nThe Steelers have one quarterback signed to their active roster as of the time of writing: Mason Rudolph, who returned to Pittsburgh on a two-year, $8 million deal.\nRudolph previously played for the Steelers from 2019 to 2023 and appeared in 21 games (13 starts), most of which were as a rookie. He spent the 2024 season with the Titans, appearing in eight games and starting five.\nHeyward praised the Steelers' decision to bring back Rudolph on his podcast, saying, \"If we don't sign a QB, and we go in there with Mason, we feel good about it. Excited to have him back.\"\nLatest Aaron Rodgers news\nRodgers has been a free agent since the Jets released him after the start of the new league year last Wednesday.\nESPN's Adam Schefter reported on his podcast Tuesday that Rodgers' top choice is to land with the Vikings, though he added that a resolution to the Rodgers-Minnesota situation may not come for some time.\n\"Do I think that that's happening? Not today. Not next week. Do I think it's out of the question? Not entirely. Do I think it's likely? No,\" Schefter said."
    }
  ],
  "argos_summary": "Cam Heyward, a four-time All-Pro defensive lineman for the Pittsburgh Steelers, is seeking a new contract after a standout season, but negotiations have yet to progress. He expressed frustration over his current deal, which totals $29 million through 2026, and indicated he might consider missing games if necessary. Meanwhile, Heyward has also commented on the Steelers' quarterback situation, expressing impatience with the lack of movement regarding potential signings, particularly concerning Aaron Rodgers.",
  "argos_id": "03X9IZMI7"
}