{
  "url": "https://www.ajc.com/news/2025/08/taylor-swift-announces-12th-studio-album-the-life-of-a-showgirl/",
  "authorsByline": "MARIA SHERMAN",
  "articleId": "9a355318e72c4a96ae156f9e74d83cf4",
  "source": {
    "domain": "ajc.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "GA",
      "county": "Fulton County",
      "city": "Atlanta",
      "coordinates": {
        "lat": 33.7489924,
        "lon": -84.3902644
      }
    }
  },
  "imageUrl": "https://www.ajc.com/resizer/v2/H4UTHV5LLZGTRAJO7WCNXB23YQ.jpg?auth=e712beb5207768b3f143b29ca9d78644c1b6284ae249e89e58dc52a1564ff494&width=1200&height=630&smart=true",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T04:32:32.262000+00:00",
  "addDate": "2025-08-12T04:48:12.181019+00:00",
  "refreshDate": "2025-08-12T04:48:12.181021+00:00",
  "score": 1.0,
  "title": "Taylor Swift announces 12th studio album, 'The Life of a Showgirl'",
  "description": "Look what you made her do",
  "content": "A special limited vinyl edition of the album will be released in “portofino orange glitter,\" according to a pre-order page on her site.\n\nSensing a pattern, eagle-eyed fans noticed that 12 minutes earlier, the popular “New Heights” podcast posted a tease for Wednesday. The show, hosted by Swift's boyfriend and Chiefs tight end Travis Kelce alongside his brother, former Eagles center Jason Kelce, posted an orange image on social media with a mysterious silhouette, many believing to be Swift.\n\nSwift also announced early Tuesday that she would appear on the podcast.\n\n“The Life of a Showgirl” follows last year’s “The Tortured Poets Department,” announced during the 2024 Grammys and released during her record-breaking tour, which raked in over $2.2 billion across two years and five continents, making it the highest-grossing tour of all time.\n\nThe album is also her first release since Swift regained control over her entire body of work. In May, that pop star said she purchased her catalog of recordings — originally released through Big Machine Records — from their most recent owner, the private equity firm Shamrock Capital. She did not disclose the amount.\n\nIn recent years, Swift has been rerecording and releasing her first six albums in an attempt to regain control of her music. The project was instigated by Hybe America CEO Scooter Braun’s purchase and sale of her early catalog and represents Swift’s effort to control her own songs and how they’re used. Previous “Taylor’s Version” releases have been more than conventional re-recordings, arriving with new “from the vault” music, Easter eggs and visuals that deepen understanding of her work.\n\nSo far, there have been four rerecorded albums, beginning with “Fearless (Taylor’s Version)” and “Red (Taylor’s Version)” in 2021. All four have been massive commercial and cultural successes, each one debuting at No. 1 on the Billboard 200.\n\nSwift’s last rerecording, “1989 (Taylor’s Version),” arrived in October 2023, just four months after the release of “Speak Now (Taylor’s Version).” That was the same year Swift claimed the record for the woman with the most No. 1 albums in history.",
  "medium": "Article",
  "links": [
    "https://apnews.com/article/kelce-chiefs-eagles-jason-travis-new-heights-92761f6968b12ee06603d66e7ce9c5b7",
    "https://apnews.com/article/taylor-swift-1989-taylors-version-a4002b50f70b5899a846baf3e20de5ab",
    "https://apnews.com/article/scooter-braun-what-to-know-d5669e8b0fe641dd268c2e2cf88b0e24",
    "https://apnews.com/hub/travis-kelce",
    "https://apnews.com/article/taylor-swift-travis-kelce-chiefs-bills-nfl-playoffs-d978fa0be8100cc145cb6a63ffc656cf",
    "https://apnews.com/article/taylor-swift-redoing-fearless-album-127eefa2a3ef3373e65507495f50145c",
    "https://apnews.com/article/5725558c87b14859b6a8d4760b7f0232",
    "https://apnews.com/article/taylor-swift-eras-tour-billion-dollar-record-52945111233438b1f2166aa19eee365f",
    "https://apnews.com/article/taylor-swift-tortured-poets-department-review-b24d2275df5cf78ffa9069c61b9825ec",
    "https://apnews.com/article/taylor-swift-speak-now-taylors-version-a41998c4d1f08af9d89c6d314ed4c2bd",
    "https://apnews.com/article/red-taylor-swift-travis-kelce-super-bowl-6fe895e1691f6cd85216e520cc3b8ce1",
    "https://apnews.com/article/taylor-swift-number-one-albums-speak-now-5dfb913b75ee6628d8804d5a02f9333f"
  ],
  "labels": [
    {
      "name": "Pop Culture"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Taylor Swift",
      "weight": 0.10035477
    },
    {
      "name": "Swift",
      "weight": 0.08605201
    },
    {
      "name": "12th studio album",
      "weight": 0.07835975
    },
    {
      "name": "recent years",
      "weight": 0.072775446
    },
    {
      "name": "former Eagles center Jason Kelce",
      "weight": 0.06887701
    },
    {
      "name": "Jason Kelce",
      "weight": 0.06072115
    },
    {
      "name": "Travis Kelce",
      "weight": 0.060699914
    },
    {
      "name": "Chiefs tight end",
      "weight": 0.058199722
    },
    {
      "name": "Big Machine Records",
      "weight": 0.056620903
    },
    {
      "name": "portofino orange glitter",
      "weight": 0.05600815
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.9873046875
    },
    {
      "name": "/Arts & Entertainment/Music & Audio/Pop Music",
      "score": 0.89990234375
    },
    {
      "name": "/News/Gossip & Tabloid News/Other",
      "score": 0.359619140625
    },
    {
      "name": "/Arts & Entertainment/Music & Audio/Rock Music",
      "score": 0.33740234375
    },
    {
      "name": "/Arts & Entertainment/Music & Audio/Country Music",
      "score": 0.303466796875
    }
  ],
  "sentiment": {
    "positive": 0.40379727,
    "negative": 0.1031482,
    "neutral": 0.4930546
  },
  "summary": "Taylor Swift has announced her 12th studio album, \"The Life of a Showgirl,\" which will be released in a limited edition in \"portofino orange glitter.\" This is the first release since she regained control over her entire body of work in May, purchasing her catalog from its most recent owner, Shamrock Capital. The project was initiated by Hybe America CEO Scooter Braun and represents Swift's effort to control her own songs and their use. The album follows a series of rerecorded albums by the singer, including \"The Tortured Poets Department\" and \"The Truth\" by her boyfriend Travis Kelce and his brother Jason Kelce.",
  "shortSummary": "Taylor Swift's 12th album, \"The Life of a Showgirl,\" will be released in portofino orange, marking her return to full control of her music.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "eda5278118044c66a89126f0c1851ffa",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://apnews.com/article/kelce-chiefs-eagles-jason-travis-new-heights-92761f6968b12ee06603d66e7ce9c5b7",
      "text": "Kelces cash in: Travis and Jason Kelce take popular ‘New Heights’ podcast to Amazon’s Wondery\nKelces cash in: Travis and Jason Kelce take popular ‘New Heights’ podcast to Amazon’s Wondery\nKANSAS CITY, Mo. (AP) — Chiefs tight end Travis Kelce and his brother, former Eagles center Jason Kelce, are taking their popular “New Heights” podcast to Amazon’s Wondery under a three-year deal that gives the company exclusive advertising sales and distribution rights.\nThe financial terms of the deal were not immediately available, though some reports put the total at nine figures.\nThe deal, announced by Wondery on Tuesday, will begin with this week’s episode, which drops Wednesday. It includes the back catalog of podcast content along with exclusive rights to monetize and distribute audio and video episodes.\n“We couldn’t be more excited to team up with Wondery for the next phase of ‘New Heights,’” the Kelce brothers said in a statement. “We love this show and the fanbase that has grown with us over the last two seasons. Wondery understands the shared vision and will offer a wealth of experience and resources to take us to ‘New Heights!’”\nThe personable Kelce brothers launched their podcast two years ago. It initially was designed to peel back the cover on the world of professional football players, but has since expanded to touch other corners of the pop culture universe.\nThe weekly series was chosen podcast of the year at the 2024 iHeartPodcast Awards.\n“‘New Heights’ on the surface is a sports podcast, and sports is such a well-listened-to category,” Wondery chief executive Jen Sargent said, “but it’s become a cultural phenomenon. They’re in that cultural zeitgeist.”\nTravis Kelce’s celebrity status reached another level early last season, when the tight end of the two-time defending Super Bowl champion Chiefs began dating pop superstar Taylor Swift. He has several crossover projects in the works, including a 20-episode game show for Amazon Prime Video called “Are You Smarter Than a Celebrity?”\nJason Kelce recently retired after a 13-year career spent entirely with the Eagles. But his popularity also has been on the rise; he was frequently seen attending the Paris Olympics and will appear on “Monday Night Countdown” on ESPN.\n___\nAP NFL: https://apnews.com/hub/nfl"
    },
    {
      "url": "https://apnews.com/article/taylor-swift-redoing-fearless-album-127eefa2a3ef3373e65507495f50145c",
      "text": "Taylor Swift has finished redoing sophomore album ‘Fearless’\nNEW YORK (AP) — Last year, Taylor Swift gave us a lot of new music. This year it will be old — the pop star has announced she’s dropping the first of her re-recorded albums.\nSwift said online Thursday that “Fearless: Taylor’s Version” is finished and “will be with you soon,” featuring re-recorded songs from Swift’s sophomore album, “Fearless.”\nThe new set will have 26 songs — the original album had 13 — and also contain six never-before released songs, tunes which “almost made” the album. She said listeners will get a chance to hear the collection in all its “whimsical, effervescent, chaotic entirety.”\nSwift will also release a new version of her song “Love Story” from “Fearless” on Thursday at midnight, just in time for Valentine’s Day weekend.\nSwift has vowed to re-record her first six albums after music manager Scooter Braun announced that his Ithaca Holdings company had acquired Big Machine Label Group, the home to Swift’s first six albums. He then sold Swift’s catalogue without the singer-songwriter being given a chance to acquire her masters.\n“Fearless” was written when Swift was between 16-18 and earned Swift her first Grammy Award. The re-recorded version is likely to be embraced by her fans and push the original recordings lower in searches.\nSwift hasn’t announced when “Fearless: Taylor’s Version” will be available but a statement she posted on Twitter included a hidden message using only the capital letters which reads: April Ninth.\nAbout the stuffed new recording, Swift wrote: “I’ve decided I want you to have the whole story, see the entire vivid picture, and let you into the entire dreamscape” that is the “Fearless” album.\n“This process has been more fulfilling and emotional than I could’ve imagined and has made me even more determined to re-record all my music,” she added.\nIn 2020, Taylor dropped two albums — “Folklore” and “Evermore.”\n___\nMark Kennedy is at http://twitter.com/KennedyTwits"
    },
    {
      "url": "https://apnews.com/article/taylor-swift-travis-kelce-chiefs-bills-nfl-playoffs-d978fa0be8100cc145cb6a63ffc656cf",
      "text": "Taylor Swift watches boyfriend Travis Kelce and the Chiefs beat the Bills and get back to Super Bowl\nTaylor Swift watches boyfriend Travis Kelce and the Chiefs beat the Bills and get back to Super Bowl\nKANSAS CITY, Mo. (AP) — You could say that Taylor Swift’s championship era has reached its second consecutive season.\nThe 14-time Grammy Award-winning superstar returned to Arrowhead Stadium on Sunday night to watch her boyfriend, Travis Kelce, and the rest of the Kansas City Chiefs beat the Buffalo Bills 32-29 for a spot in their third consecutive Super Bowl.\nAs confetti rained down on the field afterward, Swift and Kelce kissed in celebration. Swift gave Chiefs coach Andy Reid a big hug, and she continued the party with Kelce’s mother, Donna, and some 80,000 fans who simply refused to leave their seats.\n“I’m very thankful that I’m here in Kansas City, playing with the guys and everybody in this building,” said Kelce, who had just two catches for 19 yards as the Bills refused to let him beat them single-handedly. “It’s a special, special place. We feel that every single day and we just try to take advantage of it and not let it slip out of our hands.”\nSwift began her high-profile romance with Kelce last season, when he invited the “Anti-Hero” singer to watch him in a September matchup with the Bears. And their relationship only seemed to blossom into the playoffs last season, with Swift celebrating on the field with Kelce after the Chiefs had beaten the Ravens in Baltimore for the AFC championship.\nThen came the Super Bowl, and Swift’s much-watched dash from a concert in Tokyo for kickoff of the big game in Las Vegas.\nShe made it with plenty of time to spare, of course. And Swift became the focus of attention in her own right, winning what appeared to be a beer-chugging contest, partying with celebrity suite mates such as Blake Lively, Ice Spice and Lana Del Rey, and standing next to Kelce’s mother, Donna, while he held aloft the Lombardi Trophy following the 25-22 win over the 49ers.\nThe couple eventually locked lips again on the field at Allegiant Stadium that night.\nOn Sunday, Swift walked toward her usual suite about 90 minutes before kickoff against Buffalo. And while she was decked out in Chanel for their divisional-round win over Houston, Swift opted for a sleek black-and-gold Louis Vuitton look for the AFC title game, including a jacquard knit jacket that retails for $5,000 and a stocking cap with a list price of $830.\nModest fare compared to what suite prices for the Super Bowl will probably run.\nSwift will almost certainly be in New Orleans with her celebrity friends when the Chiefs go for an unprecedented third straight Lombardi Trophy against the Eagles on Feb. 9. They got a big game from Patrick Mahomes — no surprise there — and some key stops from their defense to end the Bills’ season for the fourth time in the last five years.\n“There’s nothing better than to be playing at Arrowhead for an AFC championship,” Kelce said. “They had that thing rocking more than ever, and we needed them more than ever. That Buffalo team was as good as we’ve ever played. A lot of great competitors over there. Got a lot of respect for those guys. They made it hard.”\n___\nAP NFL: https://apnews.com/hub/NFL"
    },
    {
      "url": "https://apnews.com/article/taylor-swift-eras-tour-billion-dollar-record-52945111233438b1f2166aa19eee365f",
      "text": "Taylor Swift’s Eras Tour is the first tour to gross over $1 billion, Pollstar says\nTaylor Swift’s Eras Tour is the first tour to gross over $1 billion, Pollstar says\nLOS ANGELES (AP) — Taylor Swift’s Eras Tour is the first tour to cross the billion-dollar mark, according to Pollstar’s 2023 year-end charts.\nNot only was Swift’s landmark Eras Tour the No. 1 tour both worldwide and in North America, but she also brought in a whopping $1.04 billion with 4.35 million tickets sold across 60 tour dates, the concert trade publication found.\nPollstar data is pulled from box office reports, venue capacity estimates, historical Pollstar venue ticket sales data, and other undefined research, collected from Nov. 17, 2022 to Nov. 15, 2023.\nRepresentatives for the publication did not immediately clarify if they adjusted past tour data to match 2023 inflation in naming Swift the first to break the billion-dollar threshold.\nPollstar also found that Swift brought in approximately $200 million in merch sales and her blockbuster film adaptation of the tour, “Taylor Swift: The Eras Tour,” has reportedly earned approximately $250 million in sales, making it the highest-grossing concert film of all time.\nAccording to their estimates, Pollstar predicts a big 2024 for Swift as well. The magazine projects the Eras Tour will once again reach $1 billion within their eligibility window, meaning Swift is likely to bring in over $2 billion over the span of the tour.\nWorldwide, Swift’s tour was followed by Beyoncé in second, Bruce Springsteen & The E Street Band in third, Coldplay in fourth, Harry Styles in fifth, and Morgan Wallen, Ed Sheeran, Pink, The Weeknd and Drake.\nIn North America, there was a similar top 10: Swift, followed by Beyoncé, Morgan Wallen, Drake, P!nk, Bruce Springsteen & The E Street Band, Ed Sheeran, George Strait, Karol G, and RBD.\nBeyond the Swift of it all, 2023 was a landmark year for concert sales: worldwide, the top 100 tours of the year saw a 46% jump from last year, bringing in $9.17 billion compared to 2022’s $6.28 billion.\nIn North America, that number jumped from $4.77 billion last year to $6.63 billion.\nEarlier this week, Swift was named Time Magazine’s Person of the Year. Last month, Apple Music named her its artist of the year; Spotify revealed she was 2023’s most-streamed artist globally, raking in more than 26.1 billion streams since Jan. 1 and beating Bad Bunny’s three-year record.\nConsider 2023 a year of incredible pop music dominance — (Taylor’s Version.)"
    },
    {
      "url": "https://apnews.com/article/red-taylor-swift-travis-kelce-super-bowl-6fe895e1691f6cd85216e520cc3b8ce1",
      "text": "Score one for red, the color, thanks to Taylor, Travis and the red vs. red Super Bowl\nScore one for red, the color, thanks to Taylor, Travis and the red vs. red Super Bowl\nNEW YORK (AP) — Ever-present on the lips of Taylor Swift and the uniforms of both Super Bowl teams. In streetwear and along the Gucci runway. Amid the sea of Valentine’s Day goods and in bright, dopamine home decor.\nThe color red has gone boom as loud as TNT.\nNot that TNT. We’re talking TNT as in Taylor and Trav. The phenom that is Taylor Swift at boyfriend Travis Kelce’s Kansas City Chiefs games was a red-hued wonder of a lead-up to Super Bowl LVIII. Media feast barely covers it.\nThe Chiefs and their opponents, the San Francisco 49ers, sport red during the regular season, just as they did ahead of their 2020 Super Bowl matchup. But this time around, it’s the Tay factor that’s been a score for classic red and other hues in its family.\nPower, passion, seduction. Luxurious and royal. Red is one of those colors that’s both aspirational and proletarian at the same time. It can also symbolize anger or danger.\nIt’s a color Kelce’s paramour is intimately familiar with. We’ve got Swift’s albums “Red” and “Red (Taylor’s Version),” of course, and her weekslong game-day Chiefs gear, and we’ve always had her signature and remarkably immovable red lip color. Which lip brands she wears she usually keeps to herself, but we’re looking at you Pat McGrath Labs.\nFOOTBALL AS A PLATFORM FOR RED\nThat aside, color experts consider football a perfect place for red.\n“Red in sport, no surprise. It’s speed, it’s energy, it’s confidence building, it’s power. So who wouldn’t want that, especially if you’re playing in the Super Bowl?” said Laurie Pressman, vice president of the Pantone Color Institute, a consulting service that keeps a sharp eye on trends.\nBut red is so much more, and has been since the dawn of red-blooded humankind and their big brains.\nRed in sport, no surprise. It’s speed, it’s energy, it’s confidence building, it’s power. So who wouldn’t want that, especially if you’re playing in the Super Bowl?\nBecause of its sharpness, our eyes pick up on red more quickly than they do other colors, said Stuart Semple, a British artist who creates and sells his own line of affordable paint. “We’re hardwired to look out for danger in our environment. At the moment, we’re seeing red just about everywhere.”\nRED ON THE RISE IN FASHION AND BEAUTY\nKlarna, the Swedish buy now, pay later service, clocked a 254% increase in September over the same month the year before in red lipstick purchases. Red heels enjoyed an 86% boost in the same period, along with red blouses (a 161% rise) and red dresses (a 71% hike), said Erin Jaeger, head of the company for North America.\n“Red has always been an `it’ color and a classic statement look, but it’s had a resurgence on runways and in mainstream culture over the past few months. What really makes red a go-to color is its versatility. You can wear red accessories to add color to a more neutral look or throw on a red lip or red nail polish. Right now, people are turning to red as a winter statement color, worn both casually or in a more dressed-up look,” she said.\nTHE RED VS. RED SUPER BOWL\nThe 49ers have some skin in the red fashion game, too, in running back Christian McCaffrey’s fiancee, Olivia Culpo, and in Kristin Juszczyk, fullback Justin Juszczyk’s wife.\nKristin, a designer, landed an NFL licensing deal to use league logos on apparel after creating a custom Chiefs puffer for Swift.\n“Ahead of the red vs. red Super Bowl matchup, my eyes are going to be on the fashion we see from the players’ walk-in looks, fans and WAGs,” Jaeger said, using sports speak for wives and girlfriends. “I’m expecting some really fun red-centric looks with hints of black and white.”\nRED ON FASHION WEEK RUNWAYS\nRed made a splash on Paris runways, and Vogue declared it the color of 2023 in street style. In Milan, Gucci’s new creative director, Sabato De Sarno, debuted his vision for the house in September, introducing Gucci Rosso, a rich shade of oxblood that teeters on burgundy.\nAnother of red’s attributes is that some people have convinced themselves they can’t wear it.\n“Historically, a lot of people have stayed away from red, particularly redheads and others who feel like it’s not their color. I truly think anyone can wear it. It’s just a matter of finding the right hue for you,” Jaeger said.\nBianca Betancourt, the digital culture editor at Harper’s Bazaar, sees a lot less divisiveness over red these days.\n“Red has always been credited as a power color and not meant for the sartorially shy, which is why seeing it as a leading trend is so fascinating. The answer to what women want to wear right now is clear: They simply just want to be seen. Wearing red accomplishes that,” she said.\nRED THROUGHOUT HISTORY\nThe color is among the oldest natural pigments. Red ochre, an iron oxide, dates to prehistoric times and drawings on cave walls. Red has been used to adorn the body in many cultures, including the ancient Egyptians, Mayans, Roman generals and during the Renaissance. It is the symbolic color of communism and socialism. In China, India and other Asian countries, red expresses happiness and good fortune.\nSemple, who went to war with fellow artist Anish Kapoor over the latter’s exclusive rights to the world’s blackest of blacks, made his first red when he was 17. It’s called Raygun.\nA bull becomes furious only if he is presented with a red cloth; a philosopher, on the other hand, goes into a rage as soon as the color is mentioned.\n“I made it in my garden shed with a bag of cadmium red and some linseed oil. It’s probably really toxic. I shouldn’t have done it. It still uses cadmium to this day, which is why it carries such a strong warning when artists use it. But honestly, I can’t find a better pigment,” he said.\nGeothe, the great German writer, had his own take on red, according to Michel Pastoureau’s book “Red: The History of a Color.”\n“A bull becomes furious only if he is presented with a red cloth; a philosopher, on the other hand, goes into a rage as soon as the color is mentioned.”"
    },
    {
      "url": "https://apnews.com/article/taylor-swift-tortured-poets-department-review-b24d2275df5cf78ffa9069c61b9825ec",
      "text": "Music Review: Taylor Swift’s ‘The Tortured Poets Department’ is great sad pop, meditative theater\nMusic Review: Taylor Swift’s ‘The Tortured Poets Department’ is great sad pop, meditative theater\nWho knew what Taylor Swift’s latest era would bring? Or even what it would sound like? Would it build off the moodiness of “Midnights” or the folk of “evermore”? The country or the ‘80s pop of her latest re-records? Or its two predecessors in black-and-white covers: the revenge-pop of “Reputation” and the literary Americana of “folklore”?\n“The Tortured Poets Department,” here Friday, is an amalgamation of all of the above, reflecting the artist who — at the peak of her powers — has spent the last few years re-recording her life’s work and touring its material, filtered through synth-pop anthems, breakup ballads, provocative and matured considerations.\nIn moments, her 11th album feels like a bloodletting: A cathartic purge after a major heartbreak delivered through an ascendant vocal run, an elegiac verse, or mobile, synthesized productions that underscore the powers of Swift’s storytelling.\nAnd there are surprises. The lead single and opener “Fortnight” is “1989” grown up — and features Post Malone. It might seem like a funny pairing, but it’s a long time coming: Since at least 2018, Swift’s fans have known of her love for Malone’s “Better Now.”\nTaylor Swift’s “The Tortured Poets Department” is here.\n- In her review, AP Music Writer Maria Sherman calls it “an amalgamation of an artist who has spent the last few years re-recording her life’s work and touring its material, filtered through synth-pop anthems, breakup ballads, provocative and matured subject matter.”\n- Swift announced a surprise two hours after the album release: 15 additional tracks.\n- The project is Swift’s first original album since her record-breaking Eras Tour kicked off last year.\n“But Daddy I Love Him” is the return of country Taylor, in some ways — fairytale songwriting, a full band chorus, a plucky acoustic guitar riff, and a cheeky lyrical reversal: “But Daddy I love him / I’m having his baby / No, I’m not / But you should see your faces.” (Babies appear on “Florida!!!” and the bonus track “The Manuscript” as well.)\nThe fictitious “Fresh Out The Slammer” begins with a really pretty psych guitar tone that disappears beneath wind-blown production; the new wave-adjacent “My Boy Only Breaks His Favorite Toys” brings back “Barbie”: “I felt more when we played pretend than with all the Kens / ‘Cause he took me out of my box.”\nEven before Florence Welch kicks off her verse in “Florida!!!,” the chorus’ explosive repetition of the song title hits hard with nostalgic 2010s indie rock, perhaps an alt-universe Swiftian take on Sufjan Stevens’ “Illinois.”\nAs another title states, “So Long, London,” indeed.\nIt would be a disservice to read Swift’s songs as purely diaristic, but that track — the fifth on this album, which her fans typically peg as the most devastating slot on each album — evokes striking parallels to her relationship with a certain English actor she split with in 2023. Place it next to a sleepy love ode like “The Alchemy,” with its references to “touchdown” and cutting someone “from the team” and well ... art imitates life.\nRevenge is still a pervasive theme. But where the reprisal anthems on “Midnights” were vindictive, on “The Tortured Poets Department,” there are new complexities: “Who’s Afraid of Little Old Me?” combines the musical ambitiousness of “evermore” and “folklore” — and adds a resounding bass on the bridge — with sensibilities ripped from the weapons-drawn, obstinate “Reputation.” But here, Swift mostly trades victimhood for self-assurance, warts and all.\n“Who’s afraid of little old me?” she sings. “You should be,” she responds.\nAnd yet, “The Smallest Man Who Ever Lived” may be her most biting song to date: “You didn’t measure up in any measure of a man,” she sings atop propulsive piano. “I’ll forget you, but I won’t ever forgive,” she describes her target, likely the same “tattooed golden retriever,” a jejune description, mentioned in the title track.\nMissteps are few, found in other mawkish lyrics and songs like “Down Bad” and “Guilty as Sin?” that falter when placed next to the album’s more meditative pop moments.\nElsewhere, Swift holds up a mirror to her melodrama and melancholy — she’s crying at the gym, don’t tell her about “sad,” is she allowed to cry? She died inside, she thinks you might want her dead; she thinks she might just die. She listens to the voices that tell her “Lights, camera, bitch, smile / Even when you want to die,” as she sings on “I Can Do It with a Broken Heart,” a song about her own performances — onstage and as a public figure.\n“I’m miserable and nobody even knows!” she laughs at the end of the song before sighing, “Try and come for my job.”\n“Clara Bow” enters the pantheon of great final tracks on a Swift album. The title refers to the 1920s silent film star who burned fast and bright — an early “It girl” and Hollywood sex symbol subject to vitriolic gossip, a victim of easy, everyday misogyny amplified by celebrity. Once Bow’s harsh Brooklyn accent was heard in the talkies, it was rumored, her career was over.\nIn life, Bow later attempted suicide and was sent to an asylum — the same institution that appears on “Who’s Afraid of Little Old Me?” “Clara Bow” works as an allegory and a cautionary tale for Swift, the same way Stevie Nicks’ “Mabel Normand” — another tragic silent film star — functioned for the Fleetwood Mac star.\nNicks appears in “Clara Bow,” too: “You look like Stevie Nicks in ’75 / The hair and lips / Crowd goes wild.”\nLater, Swift turns the camera inward, and the song ends with her singing, “You look like Taylor Swift in this light / We’re loving it / You’ve got edge / She never did.” The album ends there, on what could be read as self-deprecation but stings more like frustrating self-awareness.\nSwift sings about a tortured poet, but she is one, too. And isn’t it great that she’s allowed herself the creative license?"
    },
    {
      "url": "https://apnews.com/article/taylor-swift-1989-taylors-version-a4002b50f70b5899a846baf3e20de5ab",
      "text": "From country to pop, 2014 nostalgia to 2023 reality — it’s time for Taylor Swift’s ‘1989'\nFrom country to pop, 2014 nostalgia to 2023 reality — it’s time for Taylor Swift’s ‘1989'\nLOS ANGELES (AP) — Taylor Swift’s reimagined “1989” is here, the album that ushered in the first Peak Swift era — revisited at the height of her massive pop culture dominance.\nReleased in 2014 and named for her birth year, the original “1989” signified a sonic rebirth. Swift had shed the Nashville country roots of her first four studio albums and announced herself a full-fledged pop superstar.\n“1989 (Taylor’s Version),” out Friday, takes that version of Swift — then in her mid-20s, living in New York, prepared to take on the world with an arsenal of ’80s synth sounds and a new producer named Jack Antonoff — and includes five unreleased “vault” tracks that deliver more clues about the artist she was then.\nPrevious “Taylor’s Version” releases have been more than conventional rerecordings, arriving with new music, Easter eggs and visuals that deepen understanding of her work. The project — the fourth of six rereleases — was instigated by music manager Scooter Braun’s purchase and sale of her early catalog and represents Swift’s effort to control her own songs and how they’re used.\nHer return to “1989” — the album where she began to confront media portrayals of herself and in song — comes at another Swift popularity crescendo but also during a 2010s nostalgia (Yes, it’s only 2023. Yes, the nostalgia is real).\nHere are some key things to consider as “1989” propels the New Peak Swift era forward:\nOPENING THE VAULT\nListeners will dive deep into the vault tracks for clues into Swift’s mind around 2014. “Slut!” may recall her contentious relationship with the press, which fixated on her alleged romantic relationships and the songs she’d write once they ended.\nThey’ll find connections to “Out of the Woods” on “Is It Over Now?” in the lyrics “when you lost control / red blood, white snow.” They’ll wonder who made her pretend to like acid rock and mega yachts on “Now That We Don’t Talk.” But more insight will be found in thinking about where Swift was at the time, what came next, and how that mirrors the current moment.\nSwift dominated headlines and award show crowd shots in 2014, reaching a point of oversaturation, and leading to her retreat from the public eye prior to the release of her undercelebrated revenge record, 2017’s “Reputation.” With Swift getting similar treatment on NFL broadcasts due to her relationship with Kansas City Chiefs star Travis Kelce, could history repeat itself?\nBrittany Spanos, senior writer at Rolling Stone, puts it simply: “People just get easily sick of anyone who’s super famous. And I think that we haven’t had a lot of monocultural kind of celeb moments like this in a minute,” she says of Swift in 2023.\nRebecca Jennings, a senior correspondent at Vox covering social platforms and the creator economy, sees a connection between the 2014 eras as being “post-recession” and 2023 being “post-COVID,” a time where Swift succeeds because there’s a sort of cultural “bouncing back vibe,” a time where people want celebratory music.\nIn 2014, that was Swift finding her pop sound with “1989.”\nIn 2023, it’s becoming the most successful version of herself, and rereleasing “1989 ” while on the top of her game.\nFROM COUNTRY TO POP: A TRANSITIONAL ALBUM\n“It was a huge risk for her to move completely outside of country – there’s no country elements on this album whatsoever,” says Spanos, who also teaches a course on Swift at New York University’s Clive Davis Institute. She says Swift’s penchant for pop songwriting is evidenced all the way back on her 2008 sophomore release “Fearless” in tracks like “Love Story,” but “1989” is “her first official, full-length pop project.”\nHowever, more so than a declarative move into pop, Spanos views “1989” as “more in the lineage of the kind of transitional albums teen stars tend to make when they move into adulthood,” comparing it to Janet Jackson’s “Control” and Christina Aguilera’s “Stripped.” “1989” is the album where Swift’s divorced herself from adolescence. She’s moved to NYC; she’s working with new people; she’s making synth pop.\nRachel Brodsky, a music and culture writer who has been covering Swift for well over a decade, points out that Swift’s sonic experimentations were earned — and that she very well might be one of the final pop superstars who couldn’t come out of the gate playing with genre the way listeners are accustomed to now.\n“She came up in the shadow of the Chicks, where she was told under certain circumstances by her team, like, ’You don’t want to be the Chicks,” Brodsky says of the country music group who were chastised for going against the expectations of their audience.\nThe Chicks, acts like Shania Twain and LeAnn Rimes cracked open the door for Swift to burst open on “1989,” she says. And not just as a pop musician, but as someone bucking convention — something Brodsky says artists like Kacey Musgraves, Maren Morris and even Olivia Rodrigo have followed.\nENGAGING WITH HER OWN CELEBRITY\nBy the time “1989” rolled around, Swift was no longer writing high school romances and fairytale narratives.\nShe’d begun engaging with her celebrity reality — inviting Beyoncé and Jay-Z to her birthday party, hanging out with models and other very famous people in a group labeled “the Squad” in the media.\nShe was also writing songs like “’Bad Blood,’ which is about her feud with Katy Perry,” says Spanos, a decisive move away from the kind of humility and “hometown girl” image associated with “country Taylor.” That meant occupying more space in the pop landscape: reconciling with Kanye West after the infamous 2009 VMAs moment, starring alongside Drake in a commercial, getting Kendrick Lamar on a remix, so on and so forth.\nIn 2023, Swift is more famous now than she was then, and she’s still engaging with her celebrity in a very public way.\n‘1989 (TAYLOR’S VERSION)’ PLAYS INTO FONDNESS FOR 2014\nJennings believes people are nostalgic for the year 2014 and always will be — because it was one of the last online periods before the hyper-commodification of social media — which makes 2023 the ideal time for revisiting “1989.”\nThere were blogs, and Tumblr, and our internet lives were less defined by algorithms. “It is looked at as this Edenic time of innocence and purity,” she says. At the time, there was a kind of monoculture that leans itself to nostalgia in 2023, she says — everyone receiving the same information on the same topics at the same time, Taylor Swift’s “1989” era included — as opposed to the current influencer-based model.\n(It’s worth noting that Swift herself was very active on Tumblr, using the social media platform to find fans to invite to private listening sessions held in her home.)\nAdditionally, in the last few months, Swift has been seen dining with very famous friends like Blake Lively, Sophie Turner and Selena Gomez, a return to the language of her “Squad.” “By parading out many of the same friends she had during that era that she was also parading about, she’s playing into this nostalgia element,” argues Jennings.\nAt the time, theories swirled around Swift’s assumed romantic relationships — many believe the song “Style” is about her short relationship with Harry Styles — and in 2023, her latest assumed romance has become a top story again.\n“It’s almost like she’s method promoting,” Spanos jokes. “She’s leaning into it again.” But there’s a huge difference in the kind of treatment she’s receiving from the public this time around. The press appears to be rooting for her relationship, she says, instead of thinking about the breakup songs it might inspire, warning her male partners and turning Swift into the butt of the joke — as the media was doing in 2014.\n“There’s a little bit less of that level of misogyny,” Spanos says.\nSo what’s next for Swift?\nThe continuation of her Eras tour, which is set to resume on November 9th in Buenos Aires, Argentina. And, of course, two more “Taylor’s Version” albums."
    },
    {
      "url": "https://apnews.com/article/taylor-swift-speak-now-taylors-version-a41998c4d1f08af9d89c6d314ed4c2bd",
      "text": "‘Speak Now (Taylor’s Version)’ is here. Here’s how to reconsider Taylor Swift’s transformative album\n‘Speak Now (Taylor’s Version)’ is here. Here’s how to reconsider Taylor Swift’s transformative album\nLOS ANGELES (AP) — In 2010, newly anointed as a Grammy winner, Taylor Swift released “Speak Now,” her third studio album and her first without a single songwriting collaboration.\nHer 2006 self-titled debut and 2008’s “Fearless” had inspired both acclaim and criticism for her bold bridges and keen lyricism — these are masterful country-pop songs, critics argued, but surely a teen idol wasn’t responsible for them. Swift proved her detractors wrong on “Speak Now,” an album that arrived just before her pivot from country’s youngest hope to pop’s freshest voice.\nThe album served as a close document of her nascent fame and future career ambitions, and now, 13 years on, it’s back. “Speak Now (Taylor’s Version),” released Friday, is the third release of the six albums Swift plans to re-record. The Taylor’s Version albums, instigated by music manager Scooter Braun’s sale of her early catalog, represent Swift’s effort to control her own songs and how they’re used — a fitting ethos for “Speak Now,” a record built exclusively of her own voice.\nIn preparation for “Speak Now (Taylor’s Version),” The Associated Press reached out to Taylor Swift scholars to discuss all the ways listeners can and should think about the release.\nADOLESCENCE TO ADULTHOOD\nBefore “Speak Now” became “Speak Now,” the working title was “Enchanted,” named after the power ballad of the same name. The mythology ( folklore, anyone? ) behind the shift is that Swift’s label president at the time, Big Machine Records CEO Scott Borchetta, told her to move on from whimsy and fairytale iconography — she was entering her 20s and this LP warranted a more mature title.\nTransition creates an interesting framework for thinking about this album: Written largely between the ages of 18 and 20, released when she turned 21, “Speak Now” is a collection of songs on a precipice — of adulthood, of fame, of declaring ownership but still concerned with the subject matters that concern a young adult. There are crushes (“Superman,” “Sparks Fly”) and bittersweet breakups (“Back to December,” “If This Was a Movie”), alike.\n“You hear a youngness when you listen to these songs,” says musicologist Lily Hirsch, author of “Can’t Stop the Grrrls: Confronting Sexist Labels in Music from Ariana Grande to Yoko Ono.” “It’s all about these romantic relationships. The world hinges on all of that, which is so typical of that age. So, it is interesting hear the re-recordings bring a more mature voice to those earlier preoccupations.”\nElizabeth Scala teaches a course on Taylor Swift’s songbook at the University of Texas at Austin as an introduction to literary studies and research methods.\n“I think ‘Speak Now’ is still in the vein of ‘I don’t have enough life experience at my ripe age of 18 to give you a fully autobiographical anything, but I’m going to use what I read and what I know from other people,’” she says of the songs’ lyrical content, which still manage to “make really beautiful, coherent things out of the messiness and inaccuracy of our memories.”\nIN CONVERSATION WITH HER CRITICS AND CELEBRITY\nComing a year after Kanye West interrupted her acceptance speech at the 2009 MTV Video Music Awards, “Speak Now” is the moment in Swift’s career where she began to use her celebrity as a mirror to her interior life.\n“Mean,” a takedown of a rock critic, becomes a banjo-led treatise on antagonism of any kind; the blues-y “Dear John” centers on a young woman’s tumultuous relationship with an older man.\n“Insults are everywhere in music, and men don’t get the same flak for it,” Hirsch says, in reference to “Dear John” and “Mean.” “There’s this idea that women especially are supposed to take the high road, turn the other cheek and all of that, and men can get away with the low road, and they certainly do in music. It’s a kind of double standard. Women are labeled ‘catty’ when confronting bad behavior, like in ‘Dear John.’”\nA common pastime among Swift fans is to unearth the identities of her songs’ subjects. But, to Scala, “the most boring way to think about Taylor Swift is in terms of her biography.”\nAt a recent stop of her Eras Tour in Minneapolis, Swift seemed to agree, playing “Dear John” live for the first time in 11 years after delivering this introduction:\n“I’m 33 years old. I don’t care about anything that happened to me when I was 19 except the songs I wrote and the memories we made together. So what I’m trying to tell you is, I’m not putting this album out so you should feel the need to defend me on the internet against someone you think I might have written a song about 14 billion years ago.”\nScala sees a throughline between this album and its successors, with “Dear John” as a precursor to “All Too Well” and “Mean” as prescient to “Blank Space,” a song that parodies how she’s been portrayed in the media.\nREVISIONIST HISTORY\nMuch online chatter surrounding the re-recording of “Speak Now” has centered on “Better Than Revenge,” a pop-punk song that takes aim at another woman instead of the man that wronged them both. It takes both sonic and thematic cues from Paramore’s 2007 pop-rock hit “Misery Business,” a similar song about the same subject. (In fact, on “Speak Now (Taylor’s Version),” Paramore singer Hayley Williams lends vocals to a “vault” song, “Castles Crumbling.”)\nIn the original chorus of “Better Than Revenge,” Swift sings, “She’s an actress / She’s better known for the things she does on the mattress,” a rare lyrical misstep in a career underscored by poetic turns of phrases (in the opener “Mine,” she sings “You made a rebel of a careless man’s careful daughter”). In her 2023 “Better Than Revenge” version, the lyric becomes “He was a moth to the flame / She was holding the matches.”\n“If we think about 2010, slut-shaming rhetoric certainly existed in movies and shows. She’s certainly not the only one who has done this at that time,” Hirsch argues, quick to point out that Swift has also been the target of sexist vitriol.\nSwift’s alteration of the song in her re-recording follows a lineage of other pop stars doing the same. Lizzo and Beyoncé recently changed lyrics to songs deemed offensive. Weird Al no longer performs his Michael Jackson parodies. And because Swift hasn’t performed “Better Than Revenge” live for well over a decade, she hasn’t needed to confront this particular song, in this particular way.\n“We are willing to replace the old version with Taylor’s Versions because they are exact replicas, as much as they can be,” Scala argues. “If she does something different, it becomes a different song.” A different song, this time, owned by Swift.\nART EVOLVES WITH TIME\n“From a literary historian’s point of view, when you first hear ‘Speak Now,’ you could only look at her career up to that point: It meant something in her creative timeline,” says Scala. “And now we have the rest of her career to compare it to, so it’s hard to listen to the record the same way. You can compare it to the older recording, but its deeper and richer.”\nTechnology has changed from 2010. So has Swift: Her voice has matured, no longer possessing the sweet self-restraint that colored her earliest releases.\nEach release comes with a few “From the Vault” tracks, unreleased songs from each album’s period reimagined for the current moment. They, too, give a fuller picture.\nAN EXERCISE IN ARTISTIC AUTONOMY\nBeyond all of the music and cultural considerations, the fact is: Taylor Swift is re-recording this album to own her work, like she is doing with so many of her records — but this is the only album in her discography that is entirely self-penned, the one celebrated for its dismissals of exploitative male characters and poetic embrace of girlhood.\nIn fact, it’s hard not to think of “Could’ve, Would’ve, Should’ve” from her 2022 LP, “Midnights,” where Swift sings “Give me back my girlhood, it was mine first,” as a self-reflection of her “Speak Now” self. That track is a creative reclamation of the teen who wrote “Dear John” as an adult; “Speak Now (Taylor’s Version)” is the literal reclamation.\n“Owning these masters, she decided to take back that control,” Hirsch says. “I love what it communicates: that we all have power, we don’t have to just sit back and take these situations, especially when it concerns our own voice.”"
    },
    {
      "url": "https://apnews.com/article/taylor-swift-number-one-albums-speak-now-5dfb913b75ee6628d8804d5a02f9333f",
      "text": "It’s official: Taylor Swift has more No. 1 albums than any woman in history\nIt’s official: Taylor Swift has more No. 1 albums than any woman in history\nLOS ANGELES (AP) — Congratulations are in order for Taylor Swift and her loyal fans, known as Swifties. The pop star officially has more No. 1 albums than any woman in history.\n“Speak Now (Taylor’s Version)”, released earlier this month, is the third in her endeavor to re-record her first six albums, instigated by music manager Scooter Braun’s sale of her early catalog. It has officially debuted at No. 1 on the Billboard 200, becoming her 12th album to reach the top spot.\nPreviously, Barbra Streisand held the record, with 11 No. 1 albums.\nSwift ties Drake’s record of 12 No. 1 records, but sits just behind Jay-Z, who has 14 No. 1 albums to his name, and the Beatles, who have 19.\nIn addition to hitting this incredible milestone, Swift has 2023’s biggest album release to date, with 716,000 equivalent album units, according to Luminate. An impressive 506,600 are in traditional album sales (a combination of 410,000 physical and 96,600 digital sales.)\nWith those figures, Swift has dethroned country singer Morgan Wallen, whose album “One Thing at a Time” sold 501,000 units in its first week."
    },
    {
      "url": "https://apnews.com/article/scooter-braun-what-to-know-d5669e8b0fe641dd268c2e2cf88b0e24",
      "text": "What’s going on with Scooter Braun’s artist roster? What we know and what’s still speculation\nWhat’s going on with Scooter Braun’s artist roster? What we know and what’s still speculation\nLOS ANGELES (AP) — Scooter Braun is one of the most recognizable names in the music business for his singular work as an executive and entrepreneur. He’s managed many of your favorite artists, propelling the likes of Justin Bieber to stratospheric fame, and earned the ire of Taylor Swift and her legions of fans for his business practices.\nOn Friday, rumors circulated online that Justin Bieber was leaving Braun, his longtime manager — and the man credited with discovering him. In the days that followed, speculation grew, and media outlets began reporting that some of Braun’s other hype-profile clients like Ariana Grande, and Demi Lovato were also parting ways with him — all of which has yet to be confirmed.\nBraun hasn’t issued a public statement, but did tweet in jest, writing “Breaking news… I’m no longer managing myself.”\nAs the story continues to unfold, here’s everything we know — and everything we don’t — about what’s going with Scooter Braun and his powerful client roster.\nWho has Scooter Braun managed?\nWithout confirmation from artists, their teams, or Braun himself, changes to Braun’s roster are conjectural. AP reached out to every artist listed as being managed under Braun’s company, SB Projects, on their official website and only heard back from a select few.\nA person familiar with SB Projects’ business dealings, who was not authorized to speak publicly, told the AP the artists on the company’s roster have day-to-day managers who are not Braun, and he consults with them. The person noted that no single person would be able to manage his roster of some of the biggest names in music on their own.\nThe site mentions his company’s “past and present work” and includes artists Braun no longer works with, including Hilary Duff and J Balvin.\nRepresentatives for Carly Rae Jepsen, BabyJake, and Asher Roth confirmed to AP that those artists no longer work with Braun and haven’t for quite some time.\nA person close to Idina Menzel told AP the singer is no longer managed by Braun but was not authorized to speak publicly.\nA representative for pop star Ava Max confirmed that she is still represented by Braun.\nOK, but why is Scooter Braun a big deal?\nIn the early 2000s, Braun dropped out of Emory College to throw parties for elite musicians traveling to Atlanta: Ludacris, Eminem, even Britney Spears. Jermaine Dupri recruited him to become So So Def’s executive director of marketing. Later, in 2007, Braun started his own talent management company, SB Projects, where in 2008, he’d discover Justin Bieber on YouTube, growing the teen heartthrob’s profile by utilizing social media.\nSB Projects encompasses a few ventures: Management, which included clients like Bieber, Ariana Grande, J Balvin, and for a short-stint, Kanye West; Sheba Publishing, a joint venture with Universal Music Group Publishing; and Schoolboy Records, a record label first put on the map by Braun’s client Asher Roth and his 2009 hit “I Love College.”\nBraun operated his assorted companies under one entity called Ithaca Holdings.\nIn the midst of his incredible success, in 2019, Braun bought Big Machine Records, the label that originally signed Taylor Swift and released her first six records. Its CEO Scott Borchetta stayed in place. With the purchase, Braun purchased ownership to Swift’s master recordings, which he sold to an investment fund the following year. As a result, Swift announced that she would re-record her albums to own her new masters in a project called “Taylor’s Version.”\nIn April 2021, Braun sold Ithaca Holdings to HYBE — the publicly traded company formerly known as Big Hit Entertainment, best known for creating the K-pop group BTS — in a $1.05 billion deal. According to the corporate filling, Braun would receive about 462,380 shares of the company (totaling $86.2 million) while his star clients Grande and Bieber would each receive 53,557 shares, or almost $11.0 million apiece.\nIn January 2023, he became the sole CEO of HYBE America, having previously shared the title after the merger with Big Hit’s Lenzo Yoon.\nBack up — what is Braun doing with HYBE?\nWhen Braun’s Ithaca Holdings merged with the globally minded HYBE in April 2021, it became one of the largest music companies in the world. Just a few months later, in July, Bang Si-hyuk, the CEO of Bit Hit Entertainment/HYBE stepped down, Park Ji-won took over, and Lenzo Yoon and Scooter Braun were named co-CEOs of HYBE America. In January, Braun became the sole CEO — which means he’s busy.\nThere has been speculation that if Braun’s artists are leaving SB Projects management, it is because Braun is slowly placing his focus on HYBE America instead of acting as an artist manager. But so far, there’s been no confirmation that’s what’s happening.\nWhat does a music manager do?\nThe role of a music manager is an elusive one, based largely on the kind of relationship between the businessperson and the musician. The best music managers — and we’re excluding business and tour managers here, whose specialties are in the title — are fiercely organized, dedicated to the success of their artist. They possess a deep understanding of the industry and the artist’s place within it.\nThey work to ensure their artist’s projects run smoothly, connecting teams to reach a particular goal. Think of them as the behind-the-scenes engine responsible for allowing the artist to succeed. Often, they invest in and help develop an artist, and tackle anything from creative production to day-to-day operations."
    }
  ],
  "argos_summary": "Taylor Swift is set to release a special limited vinyl edition of her upcoming album, \"The Life of a Showgirl,\" in a unique color, coinciding with her appearance on the \"New Heights\" podcast hosted by her boyfriend Travis Kelce and his brother Jason Kelce. This album follows her successful re-recording project, which aims to regain control over her music catalog after the controversial sale of her original recordings. Meanwhile, the Kelce brothers have signed a lucrative deal with Amazon's Wondery for their podcast, further solidifying their cultural impact.",
  "argos_id": "0DD0DKXU8"
}