{
  "url": "https://finance.yahoo.com/news/global-industry-leaders-launch-ccus-043600393.html?.tsrc=rss",
  "authorsByline": "Hatch Ltd",
  "articleId": "423525e2f7834cd4addb0f58e5844b7a",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://s.yimg.com/ny/api/res/1.2/RDlJeYy4gMhcNJXNA5VRMg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/globenewswire.com/37d27d4ba716829650d6f95bf87d6bac",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T04:36:00+00:00",
  "addDate": "2025-08-12T04:50:44.529785+00:00",
  "refreshDate": "2025-08-12T04:50:44.529787+00:00",
  "score": 1.0,
  "title": "Global Industry Leaders Launch CCUS Hub Study to Accelerate Decarbonization in Asia",
  "description": "Consortium signing ceremony Members of the Consortium gathered in Singapore. From left: Michiel Hovers, Group Sales and Marketing Officer, BHP Arvind Bodhankar, Chief Sustainability Officer, Arcelor Mittal/Nippon Steel India Yonghee Kim, Vice President - Process R&D Sub-Division Leader, Hyundai Steel Prabodha Archarya, Chief Sustainability Officer, JSW Steel Alice Flesher, VP - Downstream Midstream & Chemicals, Corporate Business Development, Chevron Ken Yasuhara, General Manager Carbon Neutral",
  "content": "Unlock novel solutions for multiple hard-to-abate industries at once, to enable regional decarbonisation efforts to be accelerated, and/or\n\nBy concentrating on regional hubs, the Consortium’s study will look to find ways to solve the challenge of scale by aggregating captured carbon into sufficiently large quantities to:\n\nThe Consortium is prioritising the next important step - the study of scalable utilisation and storage solutions to test the potential for broader adoption to support decarbonisation, especially in regions where regulatory hurdles and market maturity limit progress.\n\nA role for CCUS is well represented in a number of external global climatic scenarios. Carbon capture technologies used in a range of existing industrial applications are relatively mature, and able to integrate with existing facilities.\n\nThe study is expected to conclude at the end of 2026, with findings to be shared publicly to promote broader industry learning and support the development of enabling policy and regulatory frameworks.\n\nThe Consortium, which is open to additional members joining and contributing to the study, has appointed Hatch as Project Management Officer in collaboration with Global CCS Institute, McDaniel, and Pace CCS.\n\nThe study will also look at non-technical enablers required to make CCUS hubs a reality, for example regulatory assessments including intra and inter-regional assessments of CCUS and cross border transport.\n\nThe plan is for each participant in the study to be included in at least one hub, and the study will deliver conceptual development strategies for each hub including cost and schedule estimates, and potential commercialisation pathways.\n\nBy leveraging shared infrastructure and economies of scale, the study will seek potential applications for captured CO2 in industrial processes, or transport captured CO2 via pipeline or shipping to storage sites in Asia or Northern Australia.\n\nThe CCUS Hub study is the first independent industry-led study of its kind in Asia and will examine the technical and commercial pathways to utilising CCUS in hard-to-abate industries across Asia. The study will focus on the potential to develop large-scale projects which can repurpose, or store, captured carbon dioxide (CO2).\n\nSINGAPORE, Aug. 12, 2025 (GLOBE NEWSWIRE) -- An industry consortium comprised of leading steelmakers ArcelorMittal Nippon Steel India, JSW Steel, Hyundai Steel Company and other value chain players, BHP, Chevron, Mitsui & Co., Ltd. (the Consortium), are undertaking a pre-feasibility study to assess the development of Carbon Capture, Utilisation and Storage (CCUS) hubs across Asia.\n\n“BHP is committed to supporting our steelmaking customers on their journey to decarbonise the industry.\n\nWith more than 1 billion tonnes of production a year in Asia coming from blast furnace capacity that is relatively early in its production life, it’s important for industry to progress technologies to decarbonise existing steelmaking assets while new commercial pathways to decarbonise steelmaking are developed over time.\n\nBy leveraging shared knowledge and resources with our partners, we are investing in support for innovative solutions—like the potential of CCUS—that we see as an essential part of decarbonising hard-to-abate sectors such as steelmaking.”\n\nComment from Dr. Arvind Bodhankar, the Chief Sustainability Officer at ArcelorMittal Nippon Steel India (AM/NS India)\n\n\"At AM/NS India, we recognise that the future of steel is inextricably linked to the well-being of our planet and the generations to come. The choices we make today will fundamentally shape the next generation, far more than our own. This profound responsibility underpins our commitment, which extends well beyond the delivery of world-class steel. It is this shared vision that has led to the formation of a robust consortium, which will enable all stakeholders to strategically undertake pioneering initiatives not only to decarbonise steelmaking but also set new benchmarks in industrial practices. For AM/NS India, the priority is to spearhead a new era of industrial responsibility and leadership, with the clear purpose of accelerating India's journey towards the net-zero goal and significantly enhancing its global competitiveness.\"\n\nComment from Prabodha Acharya, the Chief Sustainability Officer at JSW Group\n\n“Sustainability is a value that lies at the very core of JSW's Sustainability Vision that shapes the organization's strategic goals and priorities.\n\nWe remain committed to transforming our sustainability vision into reality with specific targets and commitments. We aim to reduce our CO2 emission intensity in steelmaking by 42% by 2030 from a base year of 2005 and achieving net neutral carbon emissions by 2050. This commitment to decarbonization has already progressed well and achieved a reduction of carbon emissions intensity by 30% against our 2005 baseline.\n\nHowever, we believe that, CCUS has to be developed to become a financially viable decarbonization lever which would be crucial to achieve near zero emissions in the steel sector. Partnerships and collaboration to accelerate the development and deployment of CCUS is essential, and this consortium would help pave the way forward”.\n\nComment from Yonghee Kim, Vice President of the Process R&D Sub-division, Hyundai Steel\n\n“Hyundai Steel is committed to leading the decarbonisation of the steel industry, despite it being one of the most carbon-intensive and technically challenging sectors to decarbonise.\n\nThis consortium goes beyond conventional technological development – it aims to deliver real and measurable emissions reductions through collaboration with global partners, sharing knowledge and experience across borders.\n\nHyundai Steel will continue to take the lead in developing a wide range of low-carbon technologies, including CCUS, contributing to the overall sustainability of the industry.”\n\n“Chevron believes in the critical role CCUS can play in a lower carbon world, including by reducing carbon emissions in the hard-to-abate sectors.\n\nWe are focused on leveraging our expertise and global reach to advance CCS technologies and scale lower carbon solutions across the value chain with a focus on areas including the hard-to-abate sector.”\n\nComment from Masaya Inamuro, Chief Operating Officer of Mineral & Metal Resources Business Unit, Mitsui & Co., Ltd.\n\n\"Mitsui has established a vision to achieve net-zero emissions by 2050 and is targeting a 30% reduction by 2030, relative to 2020 levels.\n\nWe are committed to accelerating the transition to a low-carbon future by initiating a study on CCUS in collaboration with key industrial partners across the Asia-Pacific region.\n\nThis initiative aims to explore viable pathways for large-scale CO₂ reduction and lay the groundwork for future deployment of decarbonization solutions in various industries.\"\n\nBHP is a global resources company. With more than 90,000 employees and contractors, we work in more than 90 locations worldwide and our products are sold globally. We're focused on the resources the world needs to grow and decarbonise. Population growth, urbanisation and improving living standards are global trends that underpin strong demand for the commodities we produce. Demand for essential commodities is expected to increase as the world seeks to decarbonise. Our project pipeline and focus on continuous improvement in existing operations leave us well positioned for growth across our four commodity pillars of copper, potash, iron ore and steelmaking coal in the decades ahead.\n\nWe are partnering with customers and others to try to accelerate decarbonisation in steelmaking. BHP’s 2030 goals include supporting industry to develop steel production technology capable of 30 per cent lower GHG emissions intensity relative to conventional blast furnace steelmaking, with widespread adoption expected post-2030.\n\nArcelorMittal Nippon Steel India (AM/NS India) is a joint venture between ArcelorMittal and Nippon Steel, two of the world’s leading steel manufacturing organisations. A leading integrated flat carbon steel producer in India, the company has a crude steel capacity of 9 million tonnes per annum with state-of-the-art downstream facilities. It produces a fully diversified range of flat steel products, including value-added steel, and has a pellet capacity of 20 million tonnes. With the objective to make steel production climate-neutral, AM/NS India has strategic plans to transition its business to cleaner technology and is looking to strengthen its sustainability roadmap through clean energy sources viz., renewable power, natural gas, carbon capture utilization and/or storage and green hydrogen.\n\nHyundai Steel Company, established in 1953 as Korea’s first steel manufacturer, is a member of Hyundai Motor Group and a recognized leader in high-performance steel materials. Hyundai Steel has paved the way for sustainable growth by launching its blast furnace business in the 2010s as a new growth engine, in addition to its existing electric arc furnace-based operations. Hyundai Steel has served as a prime mover in Korea’s steel industry and is now actively undertaking the establishment of an overseas production base to secure a foundation for future growth. Hyundai Steel aims to achieve Net Zero carbon emissions by 2050, emphasizing sustainable practices and innovative carbon-neutral technologies to meet government-mandated carbon reduction requirements and become a low-carbon steelmaker.\n\nJSW Steel is the flagship company of the US$23 billion JSW Group, a diversified Indian conglomerate with interests spanning energy, infrastructure, cement, paints, realty, mobility, defence, sports, and venture capital. Over three decades, JSW Steel has evolved into India’s leading integrated steel producer with a consolidated crude steel capacity of 35.7 MTPA (including 1.5 MTPA in the US), set to grow to 43.4 MTPA in three years. Its Vijayanagar plant in Karnataka is India’s largest single-location steel facility at 17.5 MTPA.JSW Steel is recognized for sustainability and operational excellence, earning accolades like the Steel Sustainability Champion (2019–2025), Deming Prize for TQM, and top rankings in CDP disclosures and global sustainability indices. It ranks 2nd globally in S&P Global CSA Score 2024 and 8th in World-Class Steelmaker Rankings by WSD. Committed to climate goals, JSW Steel targets a 42% CO₂ reduction by 2030 and net-zero emissions by 2050, aiming to power steel-making entirely with renewables by 2030. It’s also certified as a Great Place to Work and recognized among India’s best employers in health and wellness.\n\nChevron Australia New Energies (CANE) is a subsidiary of Chevron, one of the world's leading integrated energy companies and through its Australian subsidiaries, has been present in Australia for more than 70 years. With the ingenuity and commitment of thousands of workers, Chevron in Australia operates the Gorgon and Wheatstone natural gas facilities and is a significant investor in exploration, operates one of the world’s largest integrated CCS projects at Gorgon, and delivers quality fuels and lubricants primarily via its Caltex network of service stations across Australia. Globally, Chevron aims to grow its oil and gas business, lower the carbon intensity of its operations, and grow new businesses in renewable fuels, carbon capture and offsets, hydrogen, power generation for data centers, and emerging technologies, through various subsidiaries including CANE.\n\nMitsui & Co., Ltd. is a global trading and investment company with a presence in more than 60 countries and a diverse business portfolio covering a wide range of industries. Mitsui & Co., Ltd. identifies, develops, and grows its businesses in partnership with a global network of trusted partners including world leading companies, combining its geographic and cross-industry strengths to create long-term sustainable value for its stakeholders. Mitsui & Co., Ltd. has set \"Global Energy Transition\" as one of Key Strategic Initiatives in the Medium-term Management Plan 2026.\n\nA photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/5dd7c568-05ba-4c5d-9c27-1199bc80641a",
  "medium": "Article",
  "links": [
    "https://www.globenewswire.com/Tracker?data=EpnWZ4FBGsS5QsdzQ7GYKgmDH96eo1GIhbXzi1uD_h9JVzPNkmeQxCUSTY6sig8e2m-INA_ON2-qbwsMYhbgMAq2tzU6eNoBKiT-a6-vnF5nEHC2Ogxfk-NEVNsa0tia8gkb4_N3jHAvgtf8GPGv1BN6FLAzFYO7RwzE42zHicrBltQ_mnHRwIc2j9nfI3cMKG_NZOyOwpBk95PkeyUXc-vYtsDQH_oc8l1G1Dq0e2Qw2UPiuvxf9l-j6P6Qg2Hru6HJAHBDTncO3GL_SGVGLA==",
    "https://www.globenewswire.com/Tracker?data=tDzgnjVzhSKhQ7yWAsHy4D8lnsJT_pk82CijbXC4yjjSh0J1UNkjf1t-A679si7zTofjvLN7GQ-HLL9miMq3qZuimy4AG11P0mofjtCRAmI=",
    "https://www.globenewswire.com/Tracker?data=4OEGoaYw28zk9D51ZKeA8o7Wok6CzzNsMS9mKy3cpHTZb63xted1tDKmdoHbDkl_jTkcB58P4a3qkt8tvqUqnHQz4W9PzPb_bkTFz-ckN-s="
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "CCUS Hub Study",
      "weight": 0.06723815
    },
    {
      "name": "carbon emissions",
      "weight": 0.06559123
    },
    {
      "name": "steel production technology",
      "weight": 0.06512143
    },
    {
      "name": "carbon emissions intensity",
      "weight": 0.065058604
    },
    {
      "name": "lower carbon solutions",
      "weight": 0.063183896
    },
    {
      "name": "net neutral carbon emissions",
      "weight": 0.06304452
    },
    {
      "name": "Carbon capture technologies",
      "weight": 0.06264517
    },
    {
      "name": "ArcelorMittal Nippon Steel India",
      "weight": 0.062315896
    },
    {
      "name": "steel production",
      "weight": 0.06056315
    },
    {
      "name": "Hyundai Steel",
      "weight": 0.059605114
    }
  ],
  "topics": [
    {
      "name": "Energy Sector"
    },
    {
      "name": "Oil Sector"
    }
  ],
  "categories": [
    {
      "name": "Business"
    }
  ],
  "taxonomies": [
    {
      "name": "/People & Society/Social Issues & Advocacy/Green Living & Environmental Issues",
      "score": 0.96533203125
    },
    {
      "name": "/Business & Industrial/Energy & Utilities/Renewable & Alternative Energy",
      "score": 0.71923828125
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.69287109375
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.66796875
    },
    {
      "name": "/Science/Ecology & Environment/Other",
      "score": 0.38427734375
    },
    {
      "name": "/Business & Industrial/Energy & Utilities/Other",
      "score": 0.36572265625
    }
  ],
  "sentiment": {
    "positive": 0.40916672,
    "negative": 0.036191706,
    "neutral": 0.55464154
  },
  "summary": "Global Industry Leaders have launched a study by a consortium of steelmakers ArcelorMittal Nippon Steel India, JSW Steel, Hyundai Steel Company, BHP, Chevron, Mitsui & Co., Ltd. (the Consortium), to assess the development of Carbon Capture, Utilisation and Storage (CCUS) hubs across Asia. The study will focus on finding solutions for multiple hard-to-abate industries to enable regional decarbonisation efforts to be accelerated. The Consortium will also study the potential for scalable utilisation and storage solutions, particularly in regions where regulatory hurdles and market maturity limit progress. The findings are expected to be shared publicly to promote industry learning and support regulatory frameworks.",
  "shortSummary": "The Consortium of Asian Industry is conducting a major study to develop scalable carbon capture and storage solutions for hard-to-abate industries.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "798eac57cc8f43399493f9e261dad46c",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "An industry consortium, including major steelmakers and energy companies, is conducting a pre-feasibility study to develop Carbon Capture, Utilisation and Storage (CCUS) hubs across Asia, aiming to address decarbonisation in hard-to-abate industries. The study will explore scalable solutions for carbon capture and storage, focusing on regulatory and commercial pathways to facilitate broader adoption. Expected to conclude by the end of 2026, the findings will promote industry learning and support policy development for decarbonisation efforts.",
  "argos_id": "0E31K3QH3"
}