{
  "url": "https://www.usmagazine.com/celebrity-news/news/rhoa-star-porsha-williams-home-hit-with-lien-due-to-ex-excl/",
  "authorsByline": "Ryan Naumann",
  "articleId": "6719ffe3bebd4229857be4ac384a3672",
  "source": {
    "domain": "usmagazine.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://www.usmagazine.com/wp-content/uploads/2025/08/GettyImages-1420047244-porsha-williams-ex-lien.jpg?crop=0px%2C117px%2C1389px%2C729px&resize=1200%2C630&quality=55&strip=all",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T16:26:00-04:00",
  "addDate": "2025-08-11T21:29:08.779185+00:00",
  "refreshDate": "2025-08-11T21:29:08.779188+00:00",
  "score": 1.0,
  "title": "RHOA Star Porsha Williams’ Home Hit With Lien Due to Ex (Excl)",
  "description": "Porsha Williams’ ex-husband Simon Guobadia was accused of failing to pay his legal bills following his loss in court, Us Weekly can exclusively report",
  "content": "Porsha Williams’ ex-husband, Simon Guobadia, has been accused of failing to pay up on a six-figure debt owed to his divorce lawyer, Us Weekly can exclusively report.\n\nOn June 10, Guobadia’s divorce lawyer, Onyema Farrey, filed an attorney’s lien against his 5-bedroom, 8-bathroom, 15,284 square foot Georgia home, worth an estimated $7.3 million. Williams currently lives in the home after being awarded possession in the divorce.\n\nThe lien said Guobadia owed $205,884.25 for services provided on his divorce from Williams.\n\nThe RHOA star filed for divorce in February 2024 after 15 months of marriage. She asked the court to enforce the terms of the prenuptial agreement.\n\nGuobadia, 61, demanded that the prenup not be enforced due to Williams, 44, making alleged misrepresentations during the negotiations. Specifically, he said she intended to be a stay-at-home mom and had no plans to return to reality television.\n\n“[Williams] failed to disclose that she would return to her employment on The Real Housewives of Atlanta as a cast member,” Guobadia argued. “Instead of disclosing this material fact, the Wife made it very clear to [Guobadia] (and the public) that she was leaving the television show and not returning.”\n\nA couple of weeks after filing for divorce, Williams asked for temporary exclusive use of the home she shared with Guobadia. The court granted her request and Williams has been there ever since.\n\nAs Us previously reported, the divorce was finalized in court on June 11. Guobadia had been deported to Nigeria, due to immigration issues, days before the hearing.\n\nThe judge sided with Williams and ordered the prenup to be enforced. “The Court finds that the Prenuptial Agreement between the parties contains all essential elements of an enforceable contract,” the order read.\n\nFurther, the order read, “the Court finds that [Williams] has been a reality TV celebrity for years, which was well known to Husband at the time of negotiating the Prenuptial Agreement, and [Guobadia] nevertheless married Wife with this knowledge.”\n\nThe judge added, “The Court does not find merit in [Guobadia’s] argument that [Williams’] desire to return to reality television or employment in the future constitutes a non-disclosure of material fact and misrepresentation, as these terms are not mentioned whatsoever in the parties’ Prenuptial Agreement.”\n\nAt the hearing, Guobadia claimed his company Simcol’s value went from $296 million to nothing after he was detained by ICE. “The Court finds that [Guobadia’s] testimony is inconsistent and lacks credibility, especially given [Guobadia’s] testimony that prior to the ICE detention, he resided outside of the U.S. for more than one-half of the year and was able to successfully run and operate the company internationally,” the judge wrote.\n\nThe judge said Guobadia’s testimony “that almost $297 million dollars in business value vanished entirely over the course of a few months, without recourse or recovery, strains credibility.”\n\nPer the prenuptial agreement, Guobadia will pay Williams $40,000 a month in spousal support for 14 months. In addition, Williams was awarded the home but will have to pay her ex 50 percent of the equity.\n\nWilliams will have 36 months to refinance the mortgage to remove Guobadia’s name or sell the home.\n\nThe deal also awarded Williams a 2021 Rolls Royce and all other cars in her name. Guobadia will also have to pay Williams’ legal bill totaling $224,000.",
  "medium": "Article",
  "links": [
    "https://www.usmagazine.com/celebrity-news/news/porsha-williams-ex-simon-guobadia-breaks-silence-after-ice-detention/",
    "https://www.usmagazine.com/celebrity-news/news/rhoas-porsha-williams-ex-demands-500k-over-erectile-dysfunction-posts-excl/",
    "https://www.usmagazine.com/celebrity-news/news/rhoas-porsha-williams-wins-prenup-battle-with-ex-simon-guobadia/",
    "https://www.usmagazine.com/shows/the-real-housewives-of-atlanta/",
    "https://www.usmagazine.com/celebrities/porsha-williams/",
    "https://www.usmagazine.com/celebrity-news/news/rhoas-porsha-williams-ex-simon-guobadia-released-from-ice-detention/",
    "https://www.usmagazine.com/celebrity-news/news/porsha-williams-ex-vows-rhoa-star-wont-benefit-from-his-wealth/",
    "https://www.usmagazine.com/celebrity-news/news/rhoas-porsha-williams-claims-estranged-husband-changed-locks/",
    "https://www.usmagazine.com/celebrity-news/news/emilie-kiser-son-triggs-death-redacted-police-report-details/",
    "https://www.usmagazine.com/entertainment/news/billy-joels-ex-wife-elizabeth-weber-on-their-relationship-now/",
    "https://www.usmagazine.com/celebrity-news/news/brandon-blackstock-cause-of-death-revealed-after-cancer-battle/",
    "https://news.google.com/publications/CAAqBwgKMM7UwQEwjJAU?hl=en-US&gl=US&ceid=US%3Aen",
    "https://www.usmagazine.com/celebrity-news/news/inside-brandon-blackstocks-final-months-at-his-montana-ranch/",
    "https://apple.news/TdBoH5or6Q0afHo2MxaGA6A",
    "https://www.usmagazine.com/entertainment/news/is-prime-videos-upcoming-period-drama-the-next-game-of-thrones/",
    "https://www.usmagazine.com/celebrity-news/news/rhoas-porsha-williams-breaks-silence-on-simon-guobadia-divorce/",
    "https://www.amazon.com/MEROKEETY-Womens-Summer-Striped-Pockets/dp/B085WKKJ9V?&linkCode=sl1&tag=dotd-merokeety-striped-shirt-dress-sale-8-11-25-20&linkId=f7feced7a5edeb9678c4a84f1b3dacde&language=en_US&ref_=as_li_ss_tl"
  ],
  "labels": [
    {
      "name": "Pop Culture"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Guobadia",
      "weight": 0.10593226
    },
    {
      "name": "Simon Guobadia",
      "weight": 0.10442527
    },
    {
      "name": "Williams",
      "weight": 0.1020448
    },
    {
      "name": "home",
      "weight": 0.07330665
    },
    {
      "name": "divorce",
      "weight": 0.07118152
    },
    {
      "name": "RHOA Star Porsha Williams’ Home",
      "weight": 0.070324026
    },
    {
      "name": "Guobadia’s divorce lawyer",
      "weight": 0.06900135
    },
    {
      "name": "reality television",
      "weight": 0.06236158
    },
    {
      "name": "Porsha Williams’ ex",
      "weight": 0.060474392
    },
    {
      "name": "Guobadia’s testimony",
      "weight": 0.05892379
    }
  ],
  "topics": [
    {
      "name": "The Real Housewives"
    }
  ],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.98193359375
    },
    {
      "name": "/News/Gossip & Tabloid News/Other",
      "score": 0.97412109375
    },
    {
      "name": "/Arts & Entertainment/TV & Video/TV Shows & Programs",
      "score": 0.671875
    },
    {
      "name": "/People & Society/Family & Relationships/Troubled Relationships",
      "score": 0.548828125
    },
    {
      "name": "/People & Society/Family & Relationships/Romance",
      "score": 0.381591796875
    }
  ],
  "sentiment": {
    "positive": 0.050554205,
    "negative": 0.7026662,
    "neutral": 0.24677953
  },
  "summary": "Porsha Williams' ex-husband, Simon Guobadia, has been hit with a six-figure debt owed to his divorce lawyer, Onyema Farrey, for services provided on his divorce from Williams. The lawyer filed an attorney's lien against his 5-bedroom, 8-bathroom, 15,284 square foot Georgia home, worth an estimated $7.3 million. Guobada had asked the court to not enforce the prenuptial agreement due to Williams' alleged misrepresentations during negotiations. The judge agreed to enforce the agreement, finding that Williams had been a reality TV celebrity for years and had no plans to return to reality television. The divorce was finalised in court on June 11 and was ordered to be enforced.",
  "shortSummary": "Porsha Williams' ex-husband Simon Guobadia faces a $205,000 debt owed to his divorce lawyer, violating the prenuptial agreement and claiming his testimony lacks credibility.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "cfc1bf8cec084935a524a397995a0c4d",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.usmagazine.com/entertainment/news/billy-joels-ex-wife-elizabeth-weber-on-their-relationship-now/",
      "text": "Billy Joel’s ex-wife Elizabeth Weber is opening up about where she stands with the famed singer after their infamous affair and nearly decade-long marriage.\n“If I wanna talk to him or if I have something to say, I am able to contact him whenever I want to,” Weber exclusively told Us Weekly on Friday, August 8. “But he has a wife and he has children and right now, he’s struggling with something that’s… that’s a big thing.”\nIn May, Joel, 76, canceled the remaining dates of his 2025 tour after revealing he had been diagnosed with normal pressure hydrocephalus, a brain condition in which an abnormal amount of cerebrospinal fluid builds up, causing walking, memory, balance and bladder control problems.\n“So, [our relationship] is as close as it needs to be for two people who decided to divorce 40 years ago,” Weber continued, adding that “of course” she reaches out to her ex amid his health diagnosis.\nWeber first met Joel when she was married to his best friend and former bandmate, Jon Small. The pair engaged in a subsequent affair, which led to the band breaking up and Joel battling a severe depression that included two suicide attempts. (The affair and its aftermath were discussed in the two-part HBO documentary Billy Joel: And So It Goes, which premiered in July.)\nThe pair later reconnected after Weber’s divorce and married in 1973, going on to spend nearly 10 years together before ending their marriage in 1982. Joel went on to marry Christie Brinkley in 1985, welcoming daughter Alexa Ray Joel before calling it quits in 1994. Joel then married cookbook author Katie Lee in 2004 — the pair divorced five years later in 2009. In 2015, Joel married Alex Roderick. The pair share two children, Della Rose Joel and Remy Anne Joel.\nWeber, for her part, shares a son, Sean Weber-Small, with her first husband.\nWhile speaking with Us, Weber said that her son and her grandchildren also know and are even somewhat close to Joel.\n“I have my grandchildren that he knows and they know him,” she explained. “My granddaughter Ella taught Bill what TikTok was and showed him what was happening. And his relationship with Sean is important to both of them.”\nShe added, “So, we’re not distant but we’re, you know, and he lives in Florida and I live in California. But it’s all good. “\nWeber said that her son Sean and Joel “were very close,” adding that during their marriage the three “lived on top of the mountain.”\n“We entertained each other,” she explained. “Bill and I worked all day long and the whole writing process was never done — in the years that Bill and I were together — was never done remotely or in [a] studio. It happened in our living room, and Sean was an integral part.”\nIf you or someone you know is struggling or in crisis, help is available. Call or text 988 or chat at 988lifeline.org."
    },
    {
      "url": "https://www.usmagazine.com/entertainment/news/is-prime-videos-upcoming-period-drama-the-next-game-of-thrones/",
      "text": "Game of Thrones wrapped up its eight-season run in 2019, and there have been a few contenders to be the next GoT, including the prequel series House of the Dragon.\nHowever, Amazon Prime Video‘s upcoming miniseries King & Conqueror is giving off some serious Game of Thrones vibes, and there isn’t a dragon in sight.\nThis story is based on the conflict between Harold Godwinson and William the Conqueror in 1066 for the throne of England.\nWhile only a few previews have been released so far, Watch With Us is sharing three reasons to watch King & Conqueror when it debuts on Prime Video later this year.\nThe ‘Game of Thrones’ Connection\nIf you thought William the Conqueror looked familiar in the trailer, you’re not wrong. Game of Thrones‘ Nikolaj Coster-Waldau — who portrayed Jaime Lannister on the series — is playing William on this show. William is a vastly different character from the one that Coster-Waldau played for eight seasons, but the actor just seems to fit in well within a medieval setting.\nJames Norton is also leading the cast as William’s rival, Harold Godwinson. The rest of the performers include several veteran British actors, including Clémence Poésy, Emily Beecham, Luther Ford and Eddie Marsan. They may not be household names in America, but that’s a solid cast by any standard.\n‘King & Conqueror’ Looks Like It Has High Production Values\nAdmittedly, we haven’t seen a lot of trailers from King & Conqueror yet, so our impressions may change. But even from the early look at the show, it looks like a big budget was spent to bring this show to life in a convincing way.\nEverything from the costumes to the battle scenes suggests that King & Conqueror is going all-out with its production. It may not hit on the same level as last year’s incredible Shogun adaptation, but it seems very promising for now.\nThe Series Will Tackle One of the Most Famous Battles in History\nUnless you’re a student of history, you may not be familiar with the Battle of Hastings. Nearly a thousand years later, that battle is still considered to be one of the bloodiest encounters in English history. William and Harold’s forces met on the battlefield, and the winner went on to rule the country and consolidate their power.\nHistorical details about what happened at the Battle of Hastings are incomplete, and there are also conflicting accounts. So there will probably be some creative liberties taken with it. But we do know how it ends, and it should be entertaining to see this fight play out.\nKing & Conqueror will premiere on Prime Video later this year."
    },
    {
      "url": "https://www.usmagazine.com/celebrity-news/news/emilie-kiser-son-triggs-death-redacted-police-report-details/",
      "text": "New details surrounding the drowning death of Emilie and Brady Kiser’s son Trigg, 3, have emerged following the release of the redacted police report.\nThe documents, obtained by Us Weekly on Friday, August 8, detail the events that led up to Trigg’s death on May 18 after he was pulled unconscious from a pool at the influencer’s home in Arizona.\nAlthough details of the security footage were redacted, the Chandler Police Report noted there were discrepancies between what the footage showed and Brady’s initial recollection of events. The report also noted that the pool was unsecured at the time of the incident and that the toddler was not adequately supervised while outside playing near the uncovered pool and did not know how to swim.\nThe police report noted that Trigg had exited the home without being accompanied by a supervising adult and Brady was “aware” that his son was playing outside alone.\nAccording to the report, Brady, 28, told officers at the scene who arrived after he called 911 that Trigg had been out of his sight for around “three minutes” or “five minutes” before he saw him in the pool and immediately jumped in to pull him out.\nPer Brady’s statement, he told an officer, “I didn’t have a clock, obviously, I don’t know the exact time, but it was moments, it wasn’t minutes, it was moments, it wasn’t that he’d been out of sight for long.”\nHowever, the police report also noted that the security footage did not appear to line up with Brady’s versions of events. Discrepancies included how long Trigg was outside before Brady checked on him and Brady reporting instances that did not occur on the surveillance camera such as saying he saw Trigg “playing on the grass.” Due to this, a second interview with Brady was undertaken.\nFollowing the second interview with Brady, the report concluded, “This tragic incident was the result of [Trigg] being in the backyard unsupervised while playing around the unsecured pool and unable to swim. It is clear from the video that he did not go into the water intentionally, rather he tripped and fell in while playing with an inflatable chair.”\nThe Chandler Police Department conclusion continued: “[Redacted] was in the backyard from 18:29:42 hours until Brady found him in the pool at 18:39:00 hours. He was in the water from 18:32:15 until 18:39:07. It is clear Brady’s attention was divided, and he was not watching at all during the critical times mentioned. During two interviews he did not know what was doing before he fell in and did not see [redacted] struggling to swim.”\nIn other statements to the Chandler Police Department, both Brady and Emilie, 26, noted that Trigg had limited swimming skills.\nBrady told police that Trigg had taken some lessons and “knows how to kick his feet and swing his arms…but he’s not proficient.” He added that his son “knows not to go in the water without us.”\nMeanwhile, Emilie also confirmed Trigg had taken some lessons but “didn’t fully know how to swim.” She added he knew “how to swim to us and he knew how to climb the wall, but where he fell in there was no wall.”\nThe documents also noted that there was no cover securing the pool at the time of the incident. Brady and Emilie both noted they usually use a “Katchakid” safety net, but this was not in place at the time of the incident. In addition, the documents noted there were four access doors to the backyard and the alarm systems did not sound on any of them, none were self-closing and one appeared to be malfunctioning.\nThe Chandler Police Department also included its reasons for submitting the case to Maricopa County Attorney’s Office for a review into child abuse with criminal negligence claims.\n“This conclusion is based on several factors. Brady knew the pool net was not on the pool. He knew [redacted] was in the backyard and didn’t know how to swim. According to video evidence, [redacted] was in the backyard unsupervised for more than nine minutes, and in the water for about seven of those minutes,” the report read. “Brady’s statements do not match what is seen on the video; he did not accurately describe one thing did after he went outside. This leads to the conclusion that Brady was not aware of what was doing and was not watching him. The combination of these factors led to drowning, and a remedy to any of the contributing circumstances could have prevented the outcome.”\nThe Maricopa County Attorney’s Office released a statement on July 25, announcing Brady will not face child abuse charges due to there being “no likelihood of conviction” following review of the evidence.\n“Every case submitted to the Maricopa County Attorney’s Office is evaluated using the same standard: whether there is a ‘reasonable likelihood of conviction,’” the statement continued. “After careful review of the evidence submitted by Chandler PD, it was determined this case does not meet that standard. MCAO’s review of the case involved the attorneys assigned to it, along with highly experienced senior attorneys and the County Attorney herself.”\nBrady’s attorney Flynn Carey responded to the update in the case via a statement shared with multiple outlets at the time.\n“We are grateful to law enforcement and the county attorney for conducting a thorough investigation and confirming that this was a tragic accident,” the statement read.“Brady remains in the midst of the grieving process and is thankful to be with his family as they heal together. We appreciate the compassion and support shown during this difficult time.”"
    },
    {
      "url": "https://www.usmagazine.com/celebrity-news/news/porsha-williams-ex-vows-rhoa-star-wont-benefit-from-his-wealth/",
      "text": "Porsha Williams’ ex-husband Simon Guobadia is not done fighting the Real Housewives of Atlanta star in court, telling Us Weekly that he has no “desire” to see her benefit from his decades of hard work.\nGuobadia, 61, who is living in Dubai after being deported from the United States earlier this month, spoke to Us after People published an exclusive interview with Williams, 44, and weeks after the court sided with the Bravo star by enforcing the prenuptial agreement they signed before walking down the aisle.\n“This isn’t the first time I’ve had a prenuptial agreement,” he told Us. “In past relationships, the agreements were honored and never challenged, largely because they were approached with mutual respect and without animosity. In contrast, this situation has been marked by an unprecedented level of disrespect and dishonesty. Porsha’s actions appear designed to trigger financial provisions in the prenup by manufacturing grounds for divorce — thereby causing direct harm to my businesses, my name, and my family.”\nGuobadia claimed that “Porsha initiated divorce proceedings in a manner I believe was entirely dishonest” in February 2024.“What unfolded was a calculated and elaborate scheme — crafted for a story line — to rejoin the Bravo RHOA franchise by targeting and damaging the legacy I’ve spent 43 years building in the United States.”\nHe added, “For 35 of those years, I’ve had no issues with the law, and have instead dedicated myself to sustained professional work, successful business ventures, and longstanding support of the Atlanta community.”\nHe told Us he plans to appeal the decision.\nHe said, “I will continue to challenge the validity of this prenuptial agreement through every legal avenue available to me, especially as long as Porsha continues to seek its enforcement.”\n“Let me be clear: I have no desire — whether in life or in death—for Porsha or her family to benefit from the wealth I’ve built through 43 years of hard work, particularly at the expense of my own children,” the businessman added.\nIn her sit-down, the reality star told People spoke fondly of her time with Guobadia and claimed he was a “safety net” after being hurt in previous situations.\nShe claimed that she confronted Guobadia after learning about his immigration issues. Williams said she told him not to travel, but he refused.\nWilliams told People that she hired an immigration lawyer to handle her ex’s “complex” issues with his legal status in early 2024.\nShe said she later tried to bring in attorneys to deal with paperwork but said Guobadia was against it.\nShe said she pressed him about the issue on Valentine’s Day but she received a “look that felt dark” from Guobadia. Williams said she filed for divorce days later.\nShe filed for divorce a little over a week later.\nA source close to the situation tells Us, “Porsha has moved on and wishes Simon the best.”\nAs Us first reported, Guobadia was arrested on a return flight to America where he planned to attend a hearing in his divorce. He was detained at an ICE facility for months.\nAround the time of his release, the judge presiding over the divorce ruled in favor of Williams and ordered that the prenuptial agreement they signed was valid.\nGuobadia had argued Williams made misrepresentations during negotiations and he would have never agreed to it if he knew what he knows now. In court, his lawyer claimed the prenup, “requires [Guobadia] to pay a substantial financial obligation to [Williams] totaling over hundreds of thousands of dollars and terms that require him to split the equity of his $7,000,000 million pre-marital home (the Marital Residence) with [Williams], and pay significant debts and expenses for the Wife’s benefit.”\nAs Us first reported, Guobadia told Us he has no bad feelings towards President Donald Trump despite his deportation as part of the ICE raids.\n“I don’t have any animosity towards the situation. I don’t have any problems with Donald Trump like any other CEO or chief executive, who I am. We look to hire the best people we can find. And the issues that he’s dealing with are no different than any other organization,” Guobadia told Us. He said he hoped to talk to Trump, 79, about immigration in the near future."
    },
    {
      "url": "https://news.google.com/publications/CAAqBwgKMM7UwQEwjJAU?hl=en-US&gl=US&ceid=US%3Aen",
      "text": "- EnglishUnited States\n- Deutsch\n- English\n- Español\n- Français\n- Italiano\n- Svenska\n- All languages\n- Afrikaans\n- azərbaycan\n- bosanski\n- català\n- Čeština\n- Cymraeg\n- Dansk\n- Deutsch\n- eesti\n- EnglishUnited Kingdom\n- EspañolEspaña\n- EspañolLatinoamérica\n- euskara\n- Filipino\n- FrançaisCanada\n- FrançaisFrance\n- Gaeilge\n- galego\n- Hrvatski\n- Indonesia\n- isiZulu\n- íslenska\n- Italiano\n- Kiswahili\n- latviešu\n- lietuvių\n- magyar\n- Melayu\n- Nederlands\n- norsk\n- o‘zbek\n- polski\n- PortuguêsBrasil\n- PortuguêsPortugal\n- română\n- shqip\n- Slovenčina\n- slovenščina\n- srpski (latinica)\n- Suomi\n- Svenska\n- Tiếng Việt\n- Türkçe\n- Ελληνικά\n- беларуская\n- български\n- кыргызча\n- қазақ тілі\n- македонски\n- монгол\n- Русский\n- српски\n- Українська\n- ქართული\n- հայերեն\n- עברית\n- اردو\n- العربية\n- فارسی\n- አማርኛ\n- नेपाली\n- मराठी\n- हिन्दी\n- অসমীয়া\n- বাংলা\n- ਪੰਜਾਬੀ\n- ગુજરાતી\n- ଓଡ଼ିଆ\n- தமிழ்\n- తెలుగు\n- ಕನ್ನಡ\n- മലയാളം\n- සිංහල\n- ไทย\n- ລາວ\n- မြန်မာ\n- ខ្មែរ\n- 한국어\n- 日本語\n- 简体中文\n- 繁體中文\n- 繁體中文香港\n- EnglishUnited States\n- Deutsch\n- English\n- Español\n- Français\n- Italiano\n- Svenska\n- All languages\n- Afrikaans\n- azərbaycan\n- bosanski\n- català\n- Čeština\n- Cymraeg\n- Dansk\n- Deutsch\n- eesti\n- EnglishUnited Kingdom\n- EspañolEspaña\n- EspañolLatinoamérica\n- euskara\n- Filipino\n- FrançaisCanada\n- FrançaisFrance\n- Gaeilge\n- galego\n- Hrvatski\n- Indonesia\n- isiZulu\n- íslenska\n- Italiano\n- Kiswahili\n- latviešu\n- lietuvių\n- magyar\n- Melayu\n- Nederlands\n- norsk\n- o‘zbek\n- polski\n- PortuguêsBrasil\n- PortuguêsPortugal\n- română\n- shqip\n- Slovenčina\n- slovenščina\n- srpski (latinica)\n- Suomi\n- Svenska\n- Tiếng Việt\n- Türkçe\n- Ελληνικά\n- беларуская\n- български\n- кыргызча\n- қазақ тілі\n- македонски\n- монгол\n- Русский\n- српски\n- Українська\n- ქართული\n- հայերեն\n- עברית\n- اردو\n- العربية\n- فارسی\n- አማርኛ\n- नेपाली\n- मराठी\n- हिन्दी\n- অসমীয়া\n- বাংলা\n- ਪੰਜਾਬੀ\n- ગુજરાતી\n- ଓଡ଼ିଆ\n- தமிழ்\n- తెలుగు\n- ಕನ್ನಡ\n- മലയാളം\n- සිංහල\n- ไทย\n- ລາວ\n- မြန်မာ\n- ខ្មែរ\n- 한국어\n- 日本語\n- 简体中文\n- 繁體中文\n- 繁體中文香港\nBefore you continue to Google\nWe use cookies and data to\n- Deliver and maintain Google services\n- Track outages and protect against spam, fraud, and abuse\n- Measure audience engagement and site statistics to understand how our services are used and enhance the quality of those services\nIf you choose to “Accept all,” we will also use cookies and data to\n- Develop and improve new services\n- Deliver and measure the effectiveness of ads\n- Show personalized content, depending on your settings\n- Show personalized ads, depending on your settings\nIf you choose to “Reject all,” we will not use cookies for these additional purposes.\nNon-personalized content is influenced by things like the content you’re currently viewing, activity in your active Search session, and your location. Non-personalized ads are influenced by the content you’re currently viewing and your general location. Personalized content and ads can also include more relevant results, recommendations, and tailored ads based on past activity from this browser, like previous Google searches. We also use cookies and data to tailor the experience to be age-appropriate, if relevant.\nSelect “More options” to see additional information, including details about managing your privacy settings. You can also visit g.co/privacytools at any time."
    },
    {
      "url": "https://www.usmagazine.com/celebrity-news/news/brandon-blackstock-cause-of-death-revealed-after-cancer-battle/",
      "text": "The official cause of death for Kelly Clarkson’s ex-husband, Brandon Blackstock, has been confirmed.\nSilver Bow County Coroner Dan Hollis told Us Weekly on Monday, August 11, that Blackstock’s cause of death was melanoma, a form of skin cancer, and the manner of his death was natural causes. “Brandon Blackstock passed away peacefully at his home in Butte, Montana on August 7th under hospice care surrounded by his family,” Hollis said in a statement.\nBlackstock died on August 7 after privately battling cancer for three years. He was 48.\n“It is with great sadness that we share the news that Brandon Blackstock has passed away. Brandon bravely battled cancer for more than three years. He passed away peacefully and was surrounded by family,” a family rep told Us in a statement. “We thank you for your thoughts and prayers and ask everyone to respect the family’s privacy during this very difficult time.”\nOne day earlier, Clarkson, 43, alerted fans to Blackstock’s illness when she put her Las Vegas residency on pause, though she didn’t reveal the nature of his condition at the time.\n“Unfortunately, I need to postpone the remainder of the August Studio Session dates in Las Vegas,” she announced via Instagram on August 6. “While I normally keep my personal life private, this past year, my children’s father has been ill and at this moment, I need to be fully present for them. I am sincerely sorry to everyone who bought tickets to the shows and I so appreciate your grace, kindness and understanding.”\nClarkson and Blackstock wed in October 2013 and went on to welcome daughter River, 11, and son Remington, 9. During their marriage, Blackstock worked as the singer’s manager. Clarkson ultimately filed for divorce in June 2020 after nearly seven years. The pair finalized the proceedings in March 2022 following a messy legal battle.\nPrior to his relationship with Clarkson, Blackstock was married to Melissa Ashworth from 2001 to 2012. The exes shared daughter Savannah, 23, and son Seth, 18.\nIn January 2022, Blackstock became a first-time grandfather when Savannah gave birth to her and now-husband Quentin Lee’s son, Lake. Savannah announced in July that the couple are expecting their second baby.\nOutside of his marriage to Clarkson, Brandon had another Hollywood connection via his father, Narvel Blackstock, who was Clarkson’s manager earlier in her career. Narvel was previously married to Reba McEntire from 1989 to 2015, during which time she was stepmom to Brandon and his two sisters, Chassidy and Shawna. Narvel and McEntire’s son, Shelby, who was born in 1990, was Brandon’s half-brother."
    },
    {
      "url": "https://www.usmagazine.com/celebrity-news/news/rhoas-porsha-williams-wins-prenup-battle-with-ex-simon-guobadia/",
      "text": "Real Housewives of Atlanta star Porsha Williams scored a win in her divorce battle with ex Simon Guobadia after a judge ruled in her favor to enforce their prenup, Us Weekly can report.\nOn Tuesday, June 11, a hearing took place in Williams and Guobadia’s bitter divorce. The exes were fighting over the enforcement of the prenup they signed before walking down the aisle.\nThe hearing had been postponed several times, partly due to Guobadia, 61, being taken into custody by ICE. As Us first reported, Guobadia was released from custody last week and deported back to Nigeria.\nWilliams, 43, filed for divorce in February 2024, following 15 months of marriage. In her petition, she asked for support and for the division of property to be determined by the prenup.\nGuobadia opposed the request to enforce the agreement. He claimed Williams made misrepresentations during the negotiations.\n“[Williams] failed to disclose that she would return to her employment on The Real Housewives of Atlanta as a cast member,” the docs read. “Instead of disclosing this material fact, the Wife made it very clear to [Guobadia] (and the public) that she was leaving the television show and not returning. [Guobadia] relied on the representations — or misrepresentations — [Williams] made to him during their engagement, the negotiation phase, and at the time that the parties signed the Prenuptial Agreement.”\nGuobadia claimed that if it were not for Williams’ “misrepresentations” about leaving RHOA, he would not have agreed to a prenup that, “requires him to pay a substantial financial obligation to [Williams] totaling over hundreds of thousands of dollars and terms that require him to split the equity of his $7,000,000 million pre-marital home (the Marital Residence) with [Williams], and pay significant debts and expenses for the Wife’s benefit.”\nWilliams did not agree with Guobadia on the matter. She said that the negotiations took place over the course of months.\nAt the recent hearing, the judge sided with Williams and ordered the prenup to be enforced. Sources tell Us that Guobadia has yet to determine if he will appeal the decision.\nBefore the hearing, Williams requested permission to attend via video.\nShe told the court she was offered a job that would help her “offset the numerous financial obligations that [Guobadia] has failed to maintain under the Temporary Order, as well as to offset the significant legal expenses [Williams] has already incurred in pursuing enforcement of the parties’ Prenuptial Agreement and defending herself against [Guobadia] as it relates to the instant divorce action.”\nHer lawyer added, “[Williams] shows that her request for virtual appearance is made in good faith and reflects a balancing of her professional obligations and the serious nature of these proceedings, not a desire to delay or further complicate the instant litigation.”\nGuobadia appeared at the hearing via video.\nAs Us first reported, Guobadia was deported to Nigeria last week. The businessman has been in ICE custody since February.\nGuobadia’s friend and business partner, Tai Savet, told Us that he was in “good spirits” after his release. Tai told Us that Guobadia hoped to have a conversation with President Donald Trump."
    },
    {
      "url": "https://www.usmagazine.com/celebrity-news/news/rhoas-porsha-williams-ex-simon-guobadia-released-from-ice-detention/",
      "text": "Porsha Williams’ estranged husband, Simon Guobadia, was released from ICE custody and deported back to his home country after spending months at a detention center, Us Weekly can exclusively report.\nGuobadia’s friend and business partner, Tai Savet, tells Us that the Nigeria-born businessman was sent on a flight back home a couple of days ago.\nThe U.S. Department of Homeland Security website no longer lists Guobadia as being in their system. Us also obtained a selfie taken by Simon on Monday, June 9.\nSavet said Guobadia, 61, was in “good spirits” after a tough experience at the detention center, which was the first time he had ever been behind bars.\nSavet added that Guobadia is not mad at President Donald Trump, and would like a sit-down with him.\nGuobadia and his team launched a new business where they will be selling shirts that will help people in ICE custody.\nBack in February, Williams’ ex was taken to the Stewart Detention Center in Lumpkin, Georgia, about two hours outside of Atlanta, as part of the government’s mass deportation efforts.\nGuobadia moved to the United States in 1982 but reportedly overstayed his visa. He left the country but came back and overstayed his visa a second time, according to a local report.\nWSB-TV reported Guobadia was deported in 1992 but was granted permanent residency status the same year when he used an “undisclosed identity.”\nHe attempted to gain citizenship over the years but was shut down each time.\nWilliams, 43, filed for divorce from Guobadia in February 2024, following 15 months of marriage.\nThe exes went back and forth for months over Williams’ request for exclusive use of their marital home.\nThe judge sided with Williams and ordered that she could live in the home until a final decision is reached in the divorce.\nThe exes are set to face off at a divorce hearing later this week, with Guobadia being allowed to appear via video due to his deportation.\nThe reality star and her ex are fighting over the prenuptial agreement they signed before they walked down the aisle on November 25, 2022.\nThe hearing has been postponed several times, partly due to Guobadia’s detention.\nAfter he was taken into custody, Guobadia asked for the hearing to be postponed to allow him time to attend.\nHis lawyer argued, “The motion to enforce the Prenuptial Agreement is a substantive motion that requires findings of fact by this Court. The outcome of the motion will also have a substantial effect on how the remainder of the divorce case proceeds, as it may be dispositive of some of the issues and result in litigation on others.”\nThe judge granted Guobadia’s motion and rescheduled the hearing for June 11.\nThe order instructed ICE agents to transport Guobadia to the hearing if he was not released.\nFor her part, Williams filed a motion requesting permission to attend the hearing via video.\nThe RHOA star’s lawyer told the court, “[Williams] is a well-known reality television personality, a career in which last-minute travel and unexpected opportunities frequently arise.”\nHe continued, “[Williams] shows that this employment opportunity would help [Williams] offset the numerous financial obligations that [Guobadia] has failed to maintain under the Temporary Order, as well as to offset the significant legal expenses [Williams] has already incurred in pursuing enforcement of the parties’ Prenuptial Agreement and defending herself against [Guobadia] as it relates to the instant divorce action.”\n“[Williams] shows that her request for virtual appearance is made in good faith and reflects a balancing of her professional obligations and the serious nature of these proceedings, not a desire to delay or further complicate the instant litigation,” the reality star’s attorney argued.\nThe judge has yet to rule."
    },
    {
      "url": "https://www.usmagazine.com/celebrity-news/news/rhoas-porsha-williams-ex-demands-500k-over-erectile-dysfunction-posts-excl/",
      "text": "Porsha Williams’ ex-husband Simon Guobadia revealed he is seeking a massive six-figure sum in damages from The Real Housewives of Atlanta star as part of his federal lawsuit against her, Us Weekly can exclusively report.\nAccording to court documents obtained by Us, Guobadia, 61, told the court he will be seeking $500,000 for lost business opportunities and sponsorships. In addition, he will also be seeking unspecified general damages for harm to his reputation, emotional distress and humiliation.\nGuobadia said he believes he is also entitled to punitive damages for Williams’ alleged “malicious conduct.” As Us previously reported, Guobadia sued Williams, 44, for defamation in November 2024 over a series of Instagram posts she made.\nGuobadia, who split from Williams in 2024, claimed their relationship became “contentious” when she started “making negative, false and misleading statements about him on social media, using her outsized platform to negatively influence public perception of him.” In his suit, he said Williams made statements regarding erectile dysfunction.\n“These posts were intentionally crafted to imply that [Guobadia] suffers from this condition, casting him in a negative and humiliating light,” his lawyer alleged.\nGuobadia’s attorney added, “The nature, timing, and context of these posts, amidst the couple’s public separation, led reasonable viewers to infer that [Williams’] statements were referring to [Guobadia] – because they were.”\nIn court documents, Guobadia argued that Williams’ posts were “presented in a factual manner” that implied he had ED and were “clearly intended to cast” him in a “negative and humiliating light.”\n“[Williams’] statements were false; [Guobadia] does not have ED and has never suffered from or been diagnosed with this condition,” his lawyer wrote.\nThe businessman, who was recently deported, claimed he had suffered emotional distress and personal anguish due to the Instagram posts made by his ex-wife.\nHis suit added, “By making these claims in a public forum, [Williams] ensured their immediate and widespread dissemination, amplifying the harm to [Guobadia’s] credibility and social esteem.”\nIn response, Williams demanded the suit be thrown out of court. Her lawyer wrote, “None of [Williams’] posts refer to any particular individual, let alone [Guobadia] specifically. [Williams] cannot and should not be held liable for sharing information regarding a common condition that likely plagues many of [Williams’] social media followers. For this reason, and the reasons detailed herein, this Court should dismiss [Guobadia’s] Complaint in its entirety.”\nHer lawyer argued, “These posts simply provide information regarding a common condition, and Defendant even uses the hashtag ‘Mens Health Awareness’ to draw awareness to the information that may help some of Defendant’s social media followers.”\nIn his new filing, Guobadia claimed he would submit his medical records to rebut “implications” made by Williams. The case is ongoing.\nAs Us first reported, last month, Williams’ divorce was finalized. The judge ruled in the RHOA star’s favor and said the prenuptial agreement would be enforced, which Guobadia had opposed. He vowed to appeal the decision."
    },
    {
      "url": "https://www.usmagazine.com/celebrity-news/news/porsha-williams-ex-simon-guobadia-breaks-silence-after-ice-detention/",
      "text": "Real Housewives of Atlanta star Porsha Williams’ ex Simon Guobadia broke his silence exclusively to Us Weekly days after being released from ICE custody — and detailed the “nightmare” four months he spent in detainment as well as his plans for the future.\nGuobadia, who was deported to Nigeria over the weekend, explained he was spending time overseas amid his divorce. He took a flight back home to America to attend a hearing in the case.\nHe said he was “met at the entrance” of the gate, and “about seven agents with ICE” came on board the plane to escort him off.\nGuobadia, 61, said he was asked “a bunch of questions about my business and where I was traveling from, and then they asked me to turn over my devices.”\nHe said they took his laptop and two phones, one of which was dedicated to business in Dubai and the other for work in the United States.\n“So I had everything on me, literally a mobile office. [They] took those from me and [I] gave them passcodes so they could do their forensic investigation, [if] you will. After that, they basically came and told me that I was being detained and that they would be taking me in, and I’ll be seeing a judge at some point. So they slapped the cuffs on and I was taken away,” he told Us.\nGuobadia said he had no idea he was going to be taken into custody that day. He noted it all happened “a day or two before the premiere of season 16” of The Real Housewives of Atlanta.\nHe found the whole thing odd since his immigration issues were well-known. Guobadia said he had never had any issues traveling.\nWhen asked if it felt like he was targeted, Guobadia told Us, “Yes, it felt like a target. It felt like a target because they had no reason [and] it felt like a target on a number of fronts. One, for sure, is the new administration and new administration policies, they’ve heightened their targets apparently as agents are waiting, looking through flight [logs] for names that may have popped up on their radar and take them into custody.”\nHe continued, “And the second one was that I expected that I’m in a contentious divorce, and it’s not just one individual I’m dealing with. I am dealing with those behind her, the powers behind her that, obviously, would like to see her succeed and ensure that the investment in this person will come to fruition. So I was not totally oblivious to the possibilities of … some interference.”\nGuobadia said he did not know but felt it was possible Williams, 43, or someone connected to her may have called ICE. “It’s possible. I just don’t know. I don’t have all the facts,” he said. (A source with knowledge of the situation tells Us, “There’s zero truth to this theory that there’s a connection between Porsha and Simon’s arrest. It was an internet meme.”)\nAfter being questioned at the airport, Guobadia said he was transported to a facility. He was told he would see a judge eventually but could not get bond.\n“That’s when my shock realization kicked in that, ‘Oh my God, what’s about to happen?’I was transported to a detention center that I don’t recall the name right now, to be housed overnight and went through that experience [of] taking my regular street clothes off and having to put on inmate clothes,” he told Us.\nGuobadia choked up at one point, telling Us, “I’m sorry. There are a lot of things that I kind of bottled up for a while. So this interview is the first time I’m truly speaking out about the experience.”\nEventually, he was transported – with his hands and feet in cuffs – to the Stewart Detention Center, where he stayed until his recent release.\nGuobadia said he slept for two days upon his arrival. He said his friends and family were able to come visit him shortly after. He was able to spend one hour with them.\n“That was the first time [they visited me]. It was very emotional for me because prior to that, I didn’t have a phone call. I didn’t have a chance to phone them. I didn’t have my phone book. I guess the kindness, or I don’t know what it was, but the officer let me use this phone and I was able to get through to my house manager and she in turn got in touch with [my close friend].”\nHe added, “But the way this thing is designed is not like you’re arrested and you’re immediately given time to call. It could take a while, and sometimes it could take days before you’re able to reach your family.”\nA couple of days after his arrival. Guobadia said he was pulled aside and told he was being put into protective custody due to his being a celebrity.\n“They said, ‘Well, there are people who recognize that you’re a celebrity,’ and they want to take precautions. And so they took me into protective custody. I was taken to an area that is called segregation,” Guobadia told Us.\nGuobadia said he was placed in an area with dangerous people but given his own cell. He said he was given the choice to be with the general population, but decided to go to assess the situation. In segregation, Guobadia said he was locked in a cell for 23 hours of the day. He would be allowed one hour outside. If the weather was bad, he said he spent the whole day inside the cell.\n“I understood why people would kill themselves, but I’m too strong to do that. But I understand why people, when you [are] put in a certain mental headspace, you start to understand why people do what they do,” he told Us.\nEventually, Guobadia said he convinced a guard to let him back into the general population. Guobadia told Us that the population was mostly Hispanic men “who looked like they were picked up from work sites or their jobs.”\nHe said the facility was mostly “clean.”\nHowever, he noted, “some of the glaring things I saw were … the staff was poorly trained, they didn’t have a whole lot of staffing. There was overcrowding, there were people detained, individuals who were sleeping in makeshift beds.”\nHe continued, “Those facilities were built to house … about 200 people [per unit], and each cell would house two people, a top and a bottom bunk.” He said the facility had many more people than it was built to hold.\nGuobadia also described the “terrible” food at the facility.\n“Breakfast is typical cereal and milk. I never got coffee. I never got tea. There was no purified water, no bottled water … none of that,” he explained.\nWhen he was in segregation, he said, “There’s a panel [in my door] to open and serve the food, and sometimes they come back and take the [empty trays]. Sometimes they wait till the end of the day while I pile three meals in a day with empty trays and then get it back to them.”\nThe lunch consisted of a “make-believe burger” that was not real meat and “lot of beans.”\nHe said, “Every meal came with beans.” Guobadia said they had tacos and rice, and Spaghetti for dinner, but not much variation.\n“The food was bad,” he added. “There was nothing; it had no nutritional value.”\nIn the general population, Guobadia said he made a few friends. He would often watch the news on a TV in the main waiting room.\nHe said the other detainees played basketball, volleyball, and soccer when allowed outside. He said the cell doors were open for people to roam around during the day but there were guards around and rules to follow.\nGuobadia said the entire experience was a “nightmare,” but it also “made me realize that I’m a pretty tough cookie.”\nWhile in custody, he ended up with the flu and had to be housed at a clinic for days.\nGuobadia said he received no updates on his case while inside. He said the running joke inside was that ICE agents were “never truthful” when asked by detainees when they were leaving.\nHe said he was only told he was leaving two weeks before being deported. When it was time for him to leave, he was put into a holding cell with others and not given food for 18 hours.\nLooking forward, Guobadia has plans to head to Dubai, where he has previously lived, and is in the process of reuniting with his children."
    },
    {
      "url": "https://www.usmagazine.com/celebrity-news/news/rhoas-porsha-williams-claims-estranged-husband-changed-locks/",
      "text": "Porsha Williams has demanded an emergency hearing after allegedly being locked out of her home by her estranged husband, Simon Guobadia.\nWilliams, 42, claimed Guobadia, 59, changed the locks on their Atlanta residence to prevent her attempts “to access her home, seemingly to be vindictive and retaliatory for wanting to divorce him,” according to court documents obtained by Radar Online.\nThe reality star further claimed that, in the event of a divorce, the couple’s prenup stipulates that Guobadia would vacate the home within 30 days of filing. Williams filed for divorce from Guobadia on February 22 after 15 months of marriage. Guobadia allegedly requested an extension that would have allowed him to stay in the house until March 31, but Williams denied it.\nOnce the proposal was shot down, the legal documents claim Guobadia “disabled her access to the gate of the Marital Residence, effectively blocking her ability to access her own residence.”\nWilliams was eventually able to access the gate, but then Guobadia allegedly “disabled Wife’s access to the residence, changed the locks, and changed the garage code almost immediately after Wife left the residence.”\nFurther, Williams’ attorney was told Guobadia had obtained a new lawyer who indicated Guobadia had no intention of leaving the home. Calling Guobadia’s behavior “erratic,” Williams said her daughter Pilar, 5, had also been “displaced from the residence.”\nDespite his insistence to stand his ground, the legal filing indicated Guobadia is not even in the country at the moment, rather currently spending time in Dubai.\nIn separate legal documents obtained by Page Six on Monday, March 25, Guobadia claimed Williams had brought “an armed gunman” to their home. The documents allege Williams left their home and returned with “a man visibly bearing a gun for reasons unknown.”\nOn Thursday, March 21, Guobadia called the police to “maintain the peace.” Three days later on Sunday, March 24, Williams allegedly forced her way into their home with her mother and her mother’s boyfriend, where Guobadia claimed they disengaged security cameras and “tampered with items and evidence.”\nAfter the couple’s split was announced, Williams broke her silence via Instagram on February, 25, thanking fans for their “prayers & support.”\nWilliams’ divorce filing came just over a week after she announced her return to The Real Housewives of Atlanta, which she left after season 13 in 2021."
    },
    {
      "url": "https://www.usmagazine.com/celebrity-news/news/rhoas-porsha-williams-breaks-silence-on-simon-guobadia-divorce/",
      "text": "Porsha Williams broke her silence after filing for divorce from husband Simon Guobadia following 15 months of marriage.\n“Thank you for your prayers & support. – PW,” the Real Housewives of Atlanta star, 42, wrote via Instagram on Sunday, February 25. Porsha added a broken heart and prayer hands emoji to her social media message.\nWilliams’ Instagram post came days after news broke on Friday, February 23, that she had filed for divorce from Guobadia. (Williams still has her married name on her Instagram profile as of Monday, February 26.)\nGuobadia, 59, addressed the split in a since-deleted Instagram Story post.\n“Will Stop Loving My Wife When Divorce is Final,” he wrote, according to a Bravo fan account who shared the post on Sunday.\nPeople was first to report the news of Williams’ divorce filing on Friday, with a source telling the publication that the split had nothing to do with reports regarding Guobadia’s citizenship status. (Guobadia was born in Nigeria.)\nDays before filing for divorce, Williams referred to Guobadia as her “ride or die” in an Instagram post. The video, posted on February 17, showed the estranged couple riding on a boat that appeared to be modeled after a yellow sports car.\nWilliams took her relationship with Guobadia public with her engagement in May 2021, revealing that they had only been together for one month. (Guobadia and ex-wife Falynn Guobadia announced their divorce had been finalized one month prior.)\n“I know it’s fast but we are living life each day to its fullest. I choose happiness every morning and every night. Tuning out all negative energy and only focused on positive wishes. He makes me so happy and to me, that is what matters most,” Williams wrote on Instagram when sharing the engagement news. “For all of you that need facts, I get the optics but Simon filed for divorce from a previous marriage in January. I had nothing to do with their divorce filing. That’s between the two of them.”\nFalynn appeared on RHOA in a “friend of” role during season 13, which forced Williams to explain her connection to the fellow Bravo star.\n“Falynn and I are not friends, and Simon’s divorce has been settled,” she concluded. “Our relationship is a positive, loving step forward in everybody’s lives.”\nWilliams and Guobadia ultimately tied the knot in November 2022.\nWeeks before her divorce news, Williams announced her plans to return to RHOA for the upcoming 16th season. She also signed an overall scripted deal with NBCUniversal.\n“I’m incredibly thankful for the vision and faith NBCUniversal has put in me to be a larger part of their family,” Williams shared in a statement on February 13. “I’m looking forward to being back on ‘The Real Housewives of Atlanta,’ and showing the world my new world!”"
    }
  ],
  "argos_summary": "Porsha Williams' ex-husband, Simon Guobadia, is facing legal issues after being accused of failing to pay a six-figure debt to his divorce lawyer, leading to an attorney's lien against his Georgia home. Williams, who was awarded possession of the home in their divorce, filed for divorce in February 2024 after 15 months of marriage, citing issues with Guobadia's alleged misrepresentations during their prenuptial agreement negotiations. The court ruled in favor of Williams, enforcing the prenup, which requires Guobadia to pay her spousal support and share equity from their marital home.",
  "argos_id": "0LFY1OUO8"
}