{
  "url": "https://www.techradar.com/ai-platforms-assistants/gemini/i-learned-all-about-cheese-with-geminis-guided-learning-feature-and-it-was-so-easy-im-thinking-of-making-my-own-cheese",
  "authorsByline": "Eric Hal Schwartz",
  "articleId": "e42dadbc2b37462fa7abe08d8e82d0ec",
  "source": {
    "domain": "techradar.com",
    "paywall": false,
    "location": {
      "country": "in",
      "city": "New Delhi",
      "coordinates": {
        "lat": 28.6138954,
        "lon": 77.2090057
      }
    }
  },
  "imageUrl": "https://cdn.mos.cms.futurecdn.net/PZpgEg9tqVWe7V5ybKVjT7-1280-80.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T03:00:00+00:00",
  "addDate": "2025-08-12T03:04:26.857185+00:00",
  "refreshDate": "2025-08-12T03:04:26.857186+00:00",
  "score": 1.0,
  "title": "Using Gemini's Guided Learning feature to explore cheese turned a simple question into a fun, surprisingly hands-on learning experience.",
  "description": "Learning through answering",
  "content": "Google Gemini introduced a new feature aimed at education called Guided Learning this month. The idea is to teach you something through question-centered conversation instead of a lecture.\n\nWhen you ask it to teach you something, it breaks the topic down and starts asking you questions about it. Based on your answers, it explains more details and asks another question. The feature provides visuals, quizzes, and even embeds YouTube videos to help you absorb knowledge.\n\nAs a test, I asked Gemini's Socratic tutor to teach me all about cheese. It started by asking me about what I think is in cheese, clarifying my somewhat vague answer with more details, and then asking if I knew how those ingredients become cheese. Soon, I was in a full-blown cheese seminar. For every answer I gave, Gemini came back with more details or, in a gentle way, told me I was wrong.\n\nThe AI then got into cheese history. It framed the history as a story of traveling herders, clay pots, ancient salt, and Egyptian tombs with cheese residue. It showed a visual timeline and said, “Which of these surprises you most?” I said the tombs did, and it said, “Right? They found cheese in a tomb and it had survived.” Which is horrifying and also makes me respect cheese on a deeper level.\n\nIn about 15 minutes, I knew all about curds and whey, the history of a few regional cheese traditions, and even how to pick out the best examples of different cheeses. I could see photos in some cases and a video tour of a cellar full of expensive wheels of cheese in France. The AI quizzed me when I asked it to make sure I was getting it, and I scored a ten out of ten.\n\nIt didn’t feel like studying, exactly. More like falling into a conversation where the other person knows everything about dairy and is excited to bring you along for the ride. After learning about casein micelles. starter cultures, and cutting the curd, Gemini asked me if I wanted to learn how to make cheese.\n\nI said sure, and it guided me through the process of making ricotta, including pictures to help show what it should look like at each step.\n\nBy the time I was done with that part of the conversation, I felt like I’d taken a mini‑course in cheesemaking. I'm not sure I am ready to fill an entire cheeseboard or age a wheel of gruyère in my basement.\n\nStill, I think making ricotta or maybe paneer would be a fun activity in the next few weeks. And I can show off a mild, wobbly ball of dairy pride thanks to learning from questioning, and, as it were, being guided to an education.\n\nYou might also like\n• Google Gemini 2.5 Flash promises to be your favorite AI chatbot, but how does it compare to ChatGPT 4o?\n• 4 ways ChatGPT Tasks can help you take control of your life – trust me it's my favorite AI tool of 2025 so far\n• Google plans to get its AI to write your emails for you",
  "medium": "Article",
  "links": [
    "https://www.techradar.com/ai-platforms-assistants/chatgpt/i-use-this-simple-roleplay-trick-to-boost-my-learning-with-chatgpt-gemini-or-any-other-ai-and-you-can-too",
    "https://www.techradar.com/computing/artificial-intelligence/i-used-google-gemini-to-analyze-youtube-and-the-results-were-seriously-impressive-4-ways-you-can-use-video-integration-to-get-the-most-from-ai",
    "https://www.techradar.com/computing/artificial-intelligence/google-plans-to-get-its-ai-to-write-your-emails-for-you",
    "https://www.techradar.com/computing/artificial-intelligence/what-is-google-gemini",
    "https://www.techradar.com/tag/youtube",
    "https://www.techradar.com/computing/artificial-intelligence/4-ways-chatgpt-tasks-can-help-you-take-control-of-your-life-trust-me-its-my-favorite-ai-tool-of-2025-so-far",
    "https://www.techradar.com/computing/artificial-intelligence/google-gemini-2-5-flash-promises-to-be-your-favorite-ai-chatbot-but-how-does-it-compare-to-chatgpt-4o",
    "https://www.techradar.com/pro/google-rolls-out-gemini-for-schools-and-students-under-19-amidst-concerns-for-the-future-of-education-globally",
    "https://www.techradar.com/ai-platforms-assistants/chatgpt/3-ways-to-use-the-new-chatgpt-study-mode-that-arent-for-homework"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "cheese history",
      "weight": 0.10142131
    },
    {
      "name": "cheese",
      "weight": 0.09571106
    },
    {
      "name": "different cheeses",
      "weight": 0.094904535
    },
    {
      "name": "cheese residue",
      "weight": 0.09396387
    },
    {
      "name": "Google Gemini",
      "weight": 0.075796716
    },
    {
      "name": "more details",
      "weight": 0.07332736
    },
    {
      "name": "Gemini",
      "weight": 0.06876024
    },
    {
      "name": "YouTube videos",
      "weight": 0.060795516
    },
    {
      "name": "a few regional cheese traditions",
      "weight": 0.060002286
    },
    {
      "name": "Guided Learning",
      "weight": 0.058963284
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Jobs & Education/Education/Primary & Secondary Schooling (K-12)",
      "score": 0.51171875
    },
    {
      "name": "/Reference/General Reference/Educational Resources",
      "score": 0.374755859375
    }
  ],
  "sentiment": {
    "positive": 0.1745356,
    "negative": 0.41777018,
    "neutral": 0.4076942
  },
  "summary": "Google's AI chatbot, Gemini, has introduced a feature called Guided Learning, which aims to teach users something through question-centered conversation instead of a lecture. The feature allows users to explore topics such as cheese, providing them with more details and asking another question based on their answers. As a test, Gemini's Socratic tutor taught me a variety of topics including curds and whey, cheese history, and the process of making cheese. After learning about casein micelles, and cutting the curd, Gemini guided users through the process.",
  "shortSummary": "Google Gemini's Guided Learning feature, featuring interactive, context-based conversations, transformed a simple cheese question into a hands-on cheese education experience, teaching us all about curds and whey.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "9f0fc0adb55c4ee8802bbec8fc6fd3df",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.techradar.com/ai-platforms-assistants/chatgpt/i-use-this-simple-roleplay-trick-to-boost-my-learning-with-chatgpt-gemini-or-any-other-ai-and-you-can-too",
      "text": "I use this simple roleplay trick to boost my learning with ChatGPT, Gemini or any other AI, and you can too\nIt’s not what you ask, it’s how you ask it\nOpenAI recently launched a new Study mode for ChatGPT. It’s a great way to turn ChatGPT into an unpaid tutor, but sometimes it doesn’t quite hit the right mark when you want feedback on your work, or you want to learn a particular skill.\nWay before Study mode came into existence, I was using this particular trick with ChatGPT, Gemini and Claude to help me learn new skills or critique my work. I’d ask the AI to pretend that it was an expert in whatever field I was interested in, then ask it questions.\nIt sounds simple enough, but it’s really effective. For example, instead of just writing “Help me understand Python”, I’d write: “You are a computer science professor. I’m a beginner in your class. Please explain the programming language Python to me, walking me through how to create my first program to execute a relatively easy task in a step-by-step manner.”\nFor each prompt I first state ChatGPT’s role – in this case a computer science professor, then give it some context about what level I’m at, and what I want to learn. I then specify the format, which in this case is a step-by-step approach.\nA good tip is to add “then quiz me at the end” to the end of your prompts, then ChatGPT will open up a little quiz to test your understanding.\nA simple formula\nYou can use this simple formula for pretty much any subject you’re interested in, and ask follow-up questions, but you can also use it to get ChatGPT to critique your work. This is where the ability to upload files to ChatGPT, and the other AI chatbots, can come in handy.\nFor example, say you’ve written an essay, and you want to get ChatGPT to give you some pointers on how good it is and the areas that can be improved. Who better to critique your work than an expert in the subject?\nSign up for breaking news, reviews, opinion, top tech deals, and more.\nSo, say I’ve written an essay on the themes of social class in the classic novel The Great Gatsby, and I wanted to know if I’d missed something important, or if my work was any good, then who better to ask than an English professor?\nFirst, I'd export the essay in a file format like .doc, then I’d upload it into the prompt window of my AI. Next I'd write something like, “Pretend you’re an English professor. I want you to look at this essay I’ve uploaded and give me a full critique of what’s good and bad about it. Don’t spare my feelings, I want the truth. I’m particularly interested in what I could I do to improve it and any things I’ve missed out.”\nThe results are usually a spot-on analysis of my essay, and hints and tips for other things to consider.\nA world of learning\nThere's an almost unlimited range of things you can get an AI chatbot to help you learn using this roleplay method.\nOf course, you can take AI roleplaying a little bit further with something like character.ai, which is a chatbot that emulates famous people from the past. Want William Shakespeare or Jane Austin to give your writing the once over? Head over to character.ai and you'd can chat with them like they're in the room with you.\nYou might also like\nGraham is the Senior Editor for AI at TechRadar. With over 25 years of experience in both online and print journalism, Graham has worked for various market-leading tech brands including Computeractive, PC Pro, iMore, MacFormat, Mac|Life, Maximum PC, and more. He specializes in reporting on everything to do with AI and has appeared on BBC TV shows like BBC One Breakfast and on Radio 4 commenting on the latest trends in tech. Graham has an honors degree in Computer Science and spends his spare time podcasting and blogging.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.techradar.com/tag/youtube",
      "text": "YouTube\nLatest about YouTube\nYouTube set to test AI-powered age checks in the US – will the UK be next?\nBy Christian Cawley published\nIn just seven days, the UK has introduced age checks for online minors, Australia has blocked YouTube and other social networks, and now YouTube is rolling out AI age checks in the US.\nA YouTuber is folding and unfolding the Galaxy Z Fold 7 200,000 times in an extreme durability test livestream\nBy Jamie Richards published\nAt the time of writing, a YouTuber based in South Korea is currently putting the Galaxy Z Fold 7 through an extreme durability test, and livestreaming the whole thing.\nNorton adds deepfake protection to mobile apps in push to make sure you don't get caught out by scams\nBy Sead Fadilpašić published\nDeepfake Protection can spot fake YouTube videos and audio files.\nBest free video editing software of 2025\nBy Steve Clark last updated\nWe put these completely free video editors to the test.\nYouTube Music now lets you sync playback progress on different devices, but Spotify got there first\nBy Rowan Davies published\nYouTube Music is taking inspiration from Spotify once again with the addition of a new 'Resume' feature, but it's still early days.\nBest proxy for YouTube of 2025\nBy Benedict Collins last updated\nWe list the best proxies for YouTube, to make it simple and easy to sidestep censorship, regional bans and ads.\nNearly 2 million people watched this spellbinding video of a mini PC being built from a slab of aluminium to a complete computer\nBy Wayne Williams published\nFrom aluminum slab to powered-on Beelink mini PC, this factory video shows it all - and it’s brilliant.\nYouTube removing the Trending page looks out of touch – it needs to fix these 3 much bigger problems first\nBy Rowan Davies published\nOver the coming weeks YouTube will be retiring its Trending page in favor of YouTube Charts, but there are other problems it needs to fix first.\nBest video hosting of 2025\nBy James Capell last updated\nUpdated We list the best video hosting websites, to make it simple and easy for you to upload your videos online.\nI used Google Gemini to analyze YouTube, and the results were seriously impressive - 4 ways you can use video integration to get the most from AI\nBy Eric Hal Schwartz published\nGoogle Gemini’s video analysis feature turns YouTube into an interactive experience, helping users skip fluff, spot visual details, and even quiz themselves.\nSign up for breaking news, reviews, opinion, top tech deals, and more."
    },
    {
      "url": "https://www.techradar.com/computing/artificial-intelligence/4-ways-chatgpt-tasks-can-help-you-take-control-of-your-life-trust-me-its-my-favorite-ai-tool-of-2025-so-far",
      "text": "4 ways ChatGPT Tasks can help you take control of your life – trust me it's my favorite AI tool of 2025 so far\nAI assistance to keep you on track\nI've written before about how the Tasks feature for ChatGPT has really given me a better way to manage my life in terms of to-do lists and general organization. It really has fulfilled the role of the kind of digital personal assistant I've imagined from various science fiction stories, and turned my thoughts of “oh, I’ll remember that” from well-intentioned lies into reality.\nI wanted to highlight some of the ways Tasks has given me more control over my life, plus, if you want to try it for yourself, a couple of example prompts you can borrow and adapt.\nWhile you'll need to subscribe to ChatGPT Plus or higher to get to use Tasks for now, that won't be true forever judging from OpenAI's usual tactics of widening access after some initial test months.\nGoldfish brain\nHave you ever walked into a room and immediately forgot why you’re there? I do it more often than I'd like. The same goes for seeing important emails, and, for no reason, deciding to do something else before answering them. My brain is like an overzealous browser with 43 tabs open, and unfortunately, none of them are labeled.\nChatGPT Tasks has become my external hard drive for remembering literally anything important. No more writing reminders on my hand (which inevitably get smudged into illegibility) or relying on my memory for fine details.\nFor example, trash day. It’s not that I don’t want to take the trash out, but sometimes it's 3 a.m. and I bolt out of bed to put it by the curb before the trucks arrive. Now I have ChatGPT Tasks set up to remind me every Monday and Thursday night, plus recycling on Wednesday night. It pings me, I take out the trash, and I get to pretend I’m a responsible adult for another week.\nTry it yourself with a prompt like: \"ChatGPT, remind me to take out the trash every Monday and Thursday night at 9 p.m.\"\nSign up for breaking news, reviews, opinion, top tech deals, and more.\nProductive chaos\nMy current workload as a freelancer, parent of a one-year-old, and supposed adult is more chaotic than at any time in my life. That means relying on memory and random scraps of paper with my scribbling isn't good enough. ChatGPT Tasks serves as more than just a calendar in that regard.\nI can use it to remind me of things that don't necessarily have a specific time each day or week but have to be done semi-regularly. So, for instance, I have it check in to see if I've remembered to call some family members at least once a week, and to message my editors every morning by 10 a.m., but to start my brainstorming earlier.\nSo my prompt ends up as , \"Hey ChatGPT, can you ping me every weekday morning at 8 a.m. to start brainstorming story ideas and to check-in with my editor by 10 a.m.?\"\nBig picture\nI truly love writing of all kinds, but when I'm not writing for a specific role, the rest of life seems to eat up any time I might set aside to work on a novel, short stories, or screenplay. I wanted to make sure I fit in time for these things this year and using Tasks has helped me keep an eye on those long-term projects instead of getting caught in the weeds of daily life all the time.\nInstead of letting my ambitions slowly collect dust, I set up recurring reminders to keep me accountable. Now, I've set aside time for my own projects and separated it from other chores and jobs. And I can regularly update the reminder if I want to point out what specific bit of writing I was looking forward to and when that time is up I can write something for ChatGPT to tell me to jumpstart the next time. It’s a small thing, but that little bit of consistency makes all the difference.\nStay hydrated\nHydration is one of those small things that can actually make a big difference in your life. I would love to be the kind of person who naturally drinks a bunch of water before my coffee, not to mention stretches, meditates, and otherwise does all the things that I'm told can help keep me healthy and happy. I am not that person, but with a creative ChatGPT Tasks prompt or two, I can fake it pretty well.\nI now have a thrice daily reminder to drink water, but rather than just an alarm going off, I wrote, \"Hey ChatGPT, can you set a reminder for me to drink water three times a day between 8 a.m. and 8 p.m. and use a joke to help motivate me?\" My most recent reminder said, \"Hey Eric, your body called—it’s not a cactus. 🌵 Maybe drink some water before you dry up like a thrift store sponge?\" The same goes for a daily reminder to get up and stretch, so I don't come away every evening hunched over like a witch from a fairy tale.\nYou might also like...\n- I replaced my to-do list with ChatGPT’s Tasks feature and it completely changed the way I plan my life\n- Is ChatGPT Plus actually worth it? I compared OpenAI’s paid subscription to the free version and the results might surprise you\n- ChatGPT Tasks can start taking over your calendar and remind you to finish your to-do list\nEric Hal Schwartz is a freelance writer for TechRadar with more than 15 years of experience covering the intersection of the world and technology. For the last five years, he served as head writer for Voicebot.ai and was on the leading edge of reporting on generative AI and large language models. He's since become an expert on the products of generative AI models, such as OpenAI’s ChatGPT, Anthropic’s Claude, Google Gemini, and every other synthetic media tool. His experience runs the gamut of media, including print, digital, broadcast, and live events. Now, he's continuing to tell the stories people want and need to hear about the rapidly evolving AI space and its impact on their lives. Eric is based in New York City.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.techradar.com/pro/google-rolls-out-gemini-for-schools-and-students-under-19-amidst-concerns-for-the-future-of-education-globally",
      "text": "Google rolls out Gemini for schools and students amidst concerns for the future of education across the globe\nGemini is coming to a school near you, whether you want it or not\n- Google expands Gemini AI access to students under 18, but with safeguards\n- Includes AI literacy tools, fact-checking, and stricter content moderation\n- It nevertheless raises new questions about AI's long-term role in global education systems\nWhen calculators first entered classrooms, many worried they would weaken students’ math skills. The arrival of the internet and smartphones, brought similar fears about plagiarism and distraction - and now, AI tools are taking their turn in the spotlight.\nWith the rollout of Google’s Gemini app to all Google Workspace for Education users, including students under 18, those old concerns are resurfacing in a new form.\nGemini promises to assist with everything from lesson planning to real-time feedback, but its expansion also raises tough questions about AI’s long-term role in education and how it may reshape learning itself.\nStricter content policies\nGoogle says the goal is to support creativity, learning, and responsible AI use, as Gemini includes LearnLM, a family of AI models tuned for education and developed with input from teaching experts.\nThese models are built to handle tasks like helping students brainstorm ideas, check their understanding, or generate practice materials.\nFor students under 18, Gemini has stricter content policies and AI literacy tools endorsed by groups like ConnectSafely and the Family Online Safety Institute.\nFirst-time users are guided through onboarding content that explains how to use AI responsibly.\nSign up to the TechRadar Pro newsletter to get all the top news, opinion, features and guidance your business needs to succeed!\nTo reduce the risk of misinformation, Gemini includes a fact-checking feature. When a student asks a fact-based question, the tool runs a double-check response using Google Search.\nThis happens automatically the first time and can be triggered later by the student if needed.\nPrivacy and security have been stressed by Google in the rollout, saying Gemini for Education follows the same data protection terms as the rest of Workspace for Education.\nIn a nutshell, that means student data is not used to train AI models or reviewed by humans.\nThe app is also aligned with education and privacy regulations like FERPA, COPPA, HIPAA, and FedRAMP.\nThat said, some educators and parents remain unsure how AI will affect student engagement and thinking, and is something we’ve covered a lot previously.\nGoogle Gemini may save time and boost productivity, but big questions remain about whether students could come to rely on it too heavily or whether it might shift how learning is assessed.\nYou might also like\n- These are the best AI writers around today\n- Fancy an upgrade? These are the best student laptops\n- AI in education isn’t a crisis, it’s an indictment of the whole thing as a means to an end\nWayne Williams is a freelancer writing news for TechRadar Pro. He has been writing about computers, technology, and the web for 30 years. In that time he wrote for most of the UK’s PC magazines, and launched, edited and published a number of them too.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.techradar.com/computing/artificial-intelligence/google-gemini-2-5-flash-promises-to-be-your-favorite-ai-chatbot-but-how-does-it-compare-to-chatgpt-4o",
      "text": "Google Gemini 2.5 Flash promises to be your favorite AI chatbot, but how does it compare to ChatGPT 4o?\nSpeed versus depth\nAnyone who's played around with AI chatbots over the last couple of years has seen enormous leaps in their ability and range of features, even if not quite the revolutionary sort proclaimed by their various developers. Most of them claim to be the best choice, including Google's new Gemini 2.5 Flash model.\nWith such a broad range of uses suggested by Google for Gemini, I wanted to see how it did with a semi-random collection of prompts covering different aspects of the model. For comparison, I tested it against OpenAI’s ChatGPT, specifically the GPT-4o model.\nGemini 2.5 Flash plays the role of the default model in the Gemini chatbot now. It's supposed to be the fast, cost-efficient model for daily use. Google says it’s better than its predecessors, like Gemini 2.0 Flash, in terms of understanding images and text while still being much cheaper to run.\nGPT-4o is ChatGPT's first major multimodal model and is crammed with goodies from OpenAI's developers. The price ChatGPT pays for that power is that it can be slightly slower than the mini models available on the chatbot.\nIllustrated stories\nConsidering that both models are supposed to be skilled at both words and images, I asked the two models to \"Write a short story about a time-traveling archaeologist who discovers a futuristic artifact in ancient Egypt and make an image to accompany it.\"\nYou can see ChatGPT's result on the left and Gemini's on the right above. I will say Gemini wrote its story in about 20 seconds, while ChatGPT took 45 seconds. Further, the image took Gemini another 30 seconds while ChatGPT's required close to a minute and a half due to the quality of ChatGPT's recently released image generator.\nBoth stories used familiar tropes, though ChatGPT's reads somewhat better in my opinion.\nSign up for breaking news, reviews, opinion, top tech deals, and more.\nMath magic\nI'm far from a math expert, but there are common questions I see mentioned as \"genius tests,\" so I decided to see how the two models did when asked to: \"Explain the implications of Gödel’s incompleteness theorems on modern computational theory. Be detailed but clear, and give examples.\"\nGemini 2.5 Flash approached it like a mathematician and explained the theorems step by step, then connected them to real-world examples like how no computer program can ever truly prove that math works the way we think. It was a little dry and dense, but not too confusing. GPT-4o went for a simple breakdown, waxing philosophical and bringing up Bertrand Russell.\nTranslating metapphor\nI always think that how AI explains translations of idioms can be a useful way to test their utility. I asked the two AI chatbots to: \"Translate the following English idiom into Japanese, ensuring the cultural context is preserved: 'Barking up the wrong tree.' Explain the meaning and any cultural considerations.\"\nInterestingly, both ChatGPT and Gemini came back with essentially the same answer. Not only did they both come up with the same options for translating the phrase, but even the cultural breakdown covered the same ground in nearly the same language.\nUser's choice\nIn my opinion, Gemini 2.5 Flash and GPT-4o may as well be the same to the average person. The baseline quality of both is high enough to make their difference matter only in more specialized forms.\nGPT-4o and Gemini 2.5 Flash can be used for whatever you need on an average day. The preferences are more about the peripherals and specific features. GPT-4o has by far the more powerful image generator, but it's also a lot slower. If speed matters more, though, go with Gemini. Otherwise, you may as well use ChatGPT if it's currently your go-to choice.\nAccess to Google's ecosystem makes Gemini 2.5 Flash particularly appealing to those looking to connect their AI chatbot to Google Workspace tools like Google Docs, Gmail, and even Maps. GPT-4o and ChatGPT as a whole are more for the Microsoft user base, with links to Office tools like Word and Excel. It's also the first AI chatbot used by many people, and they may not want to change over.\nI wouldn't judge someone for preferring one over the other, but then again, I'm the weirdo with both open in adjacent tabs next to several others I test regularly. As both Gemini and ChatGPT told me when I described the situation, \"You may want to reconsider how much time you spend experimenting with AI.\"\nYou might also like\nEric Hal Schwartz is a freelance writer for TechRadar with more than 15 years of experience covering the intersection of the world and technology. For the last five years, he served as head writer for Voicebot.ai and was on the leading edge of reporting on generative AI and large language models. He's since become an expert on the products of generative AI models, such as OpenAI’s ChatGPT, Anthropic’s Claude, Google Gemini, and every other synthetic media tool. His experience runs the gamut of media, including print, digital, broadcast, and live events. Now, he's continuing to tell the stories people want and need to hear about the rapidly evolving AI space and its impact on their lives. Eric is based in New York City.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.techradar.com/computing/artificial-intelligence/google-plans-to-get-its-ai-to-write-your-emails-for-you",
      "text": "Google plans to get its AI to write your emails for you\nInbox zero here you come\n- Google DeepMind is building an AI email assistant\n- The AI will automatically respond to messages in a user's own voice and style\n- The assistant will sort and organize inboxes to help reduce time spent on admin duties\nThere are few modern experiences more demoralizing than waking up, picking up your phone to turn off your alarm, and discovering an avalanche of emails burying your inbox in notifications. Forget writing back, just sorting through them all and determining which need responses and how quickly you need to answer can eat up a whole day. Google DeepMind CEO Demis Hassabis believes AI should handle all of that organizing and responding, and he and his team have a plan to embed a virtual robot secretary in your inbox so that you never need to crawl through irrelevant sales pitches and unnecessary LinkedIn notifications ever again.\nEmail is the quintessential magical treasure with a dark curse attached. Miraculous instant communication worldwide is burdened with spam, late-night demands for immediate action from a boss, and the dreaded accidental reply-all button. Hassabis thinks AI can restore the good parts of email by handling all the \"mundane chores\" and recommending responses instead of leaving you filled with despair at your triple-digit unread count.\nHassabis told the audience at the recent SXSW London event he'd happily pay quite a lot of money to end the current tyranny of the inbox. And not in some far-off future. DeepMind is working to make email inboxes self-managing, capable of sorting through incoming messages, deciding which ones matter, and drafting responses that sound like you. So the next annoying email not only won't find you well, it won't find you at all until the AI works up a response for your approval.\nFrom a marketing perspective, it's a brilliant approach. Plenty of people rightly worried about some of the implications of AI might have a soft spot for the technology if it can clear up even a couple of hours a week for actual productive work (or even seeing your family).\nAI email utopia\nHassabis described his vision of a “universal AI assistant” that can be proactive and smart enough to act on your behalf. Instead of regularly giving the AI orders and explaining your priorities, the AI will learn from observing how you deal with a variety of emails and perhaps a one-time broad description of your approach to different kinds of messages. It will know not only how you respond to emails, but also which you ignore on purpose and which you are just stumped at figuring out how to answer.\nAn AI assistant of that caliber, \"gives you more time and maybe protects your attention from other algorithms trying to gain your attention,\" Hassabis said. \"I think we can actually use AI in service of the individual.” “\nThat's the long-term big picture. For now, Hassabis said we can look forward to AI tools that know when to say, “Thanks for the follow-up. I’ll take a look and get back to you soon.” And when to immediately click delete. Everyone would appreciate an AI that gets us to inbox zero without losing our minds.\nSign up for breaking news, reviews, opinion, top tech deals, and more.\nYou might also like\nEric Hal Schwartz is a freelance writer for TechRadar with more than 15 years of experience covering the intersection of the world and technology. For the last five years, he served as head writer for Voicebot.ai and was on the leading edge of reporting on generative AI and large language models. He's since become an expert on the products of generative AI models, such as OpenAI’s ChatGPT, Anthropic’s Claude, Google Gemini, and every other synthetic media tool. His experience runs the gamut of media, including print, digital, broadcast, and live events. Now, he's continuing to tell the stories people want and need to hear about the rapidly evolving AI space and its impact on their lives. Eric is based in New York City.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.techradar.com/computing/artificial-intelligence/i-used-google-gemini-to-analyze-youtube-and-the-results-were-seriously-impressive-4-ways-you-can-use-video-integration-to-get-the-most-from-ai",
      "text": "I used Google Gemini to analyze YouTube, and the results were seriously impressive - 4 ways you can use video integration to get the most from AI\nFigure out the when and what, even if the video doesn't tell you\nThere are a lot of great YouTube videos with tons of interesting information, but sometimes you're in a hurry or trying to find something specific amid what may or may not be padding. Happily, Google Gemini can analyze YouTube videos on your behalf and really dive into the details you might have missed or didn't have time to get to. I don't just mean transcribing it or guessing what’s going on based on the title. And because Gemini and YouTube are both Google products, you don't have to download the video and reupload it, just share the link to the video and start asking questions.\nIt's pretty straightforward to use, but there are some benefits you might not immediately notice. Here are some of my favorite ways to use the AI feature.\nTimestamped summaries\nTo get Gemini to analyze a YouTube video, you just have to ask it to do just that and include a YouTube link. For instance, I asked Gemini to \"analyze this video\" and pasted in the YouTube link to a great Defunctland video about the history of The Muppet Show.\nGemini came back with a long breakdown of the video's exploration of how Jim Henson brought the show to TV, the evolution of the characters, how the show worked, and its legacy. Even better, it had helpful hyperlinks taking me right to where in the video those bits are discussed.\nTimestamped trivia\nAs useful as the summaries are, sometimes you want something more specific. For instance, I asked Gemini to analyze a video about the perfect two-week trip to Japan. The summary it provided was great, but I wanted to see more about what to eat when in Tokyo, so I asked Gemini to tell me, \"When in the video does it discuss restaurants in Tokyo?\" It gave me a couple of sentences of what the video recommends and provided a hyperlink to where the discussion starts.\nI like the idea of not having to wait for the part of the video you want and getting right into it, even if the video maker didn't set up chapters for the video, especially if I'm hungry and thinking about travel at the same time.\nLocate film spots\nIf you're not paying close attention or have the video on mute, you might not always realize what you're seeing on screen. You can ask Gemini to remedy that for you. In the Japan video, as I half-watched the second half, a beautiful market with a million exciting shops was shown in a montage. I noted the time in the video and asked Gemini about what the video was discussing at that point. The answer turned out to be the Nishiki Market and its more than 100 food stalls. Definitely a must-see on my imagined journey to Japan.\nSign up for breaking news, reviews, opinion, top tech deals, and more.\nQuiz time\nOne of the underrated fun (and very nerdy) activities you can do with Gemini and YouTube is to make a little quiz on the video. It took less than a minute for Gemini to put together 10 questions that would fit on a Muppet Studies 101 midterm. The questions included everything from the premise of the show to guest stars and popular recurring segments and even its impact on later shows.\nI continued the quiz and ended up getting 9 out of 10 questions correct. Gemini even offered a little summary of what I missed and suggested rewatching a specific 30-second clip if I wanted a refresher. But as silly as making a quiz on a video made just for fun might be, it also shows how it could work with anything. You could test yourself on history videos, science explainers, cooking tutorials, and anything else you really want to learn. Gemini might make some of those videos a real lesson and not just momentary entertainment.\nYou might also like\nEric Hal Schwartz is a freelance writer for TechRadar with more than 15 years of experience covering the intersection of the world and technology. For the last five years, he served as head writer for Voicebot.ai and was on the leading edge of reporting on generative AI and large language models. He's since become an expert on the products of generative AI models, such as OpenAI’s ChatGPT, Anthropic’s Claude, Google Gemini, and every other synthetic media tool. His experience runs the gamut of media, including print, digital, broadcast, and live events. Now, he's continuing to tell the stories people want and need to hear about the rapidly evolving AI space and its impact on their lives. Eric is based in New York City.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.techradar.com/ai-platforms-assistants/chatgpt/3-ways-to-use-the-new-chatgpt-study-mode-that-arent-for-homework",
      "text": "3 ways to use the new ChatGPT Study mode that aren’t for homework\nPlenty to learn after graduation\nOpenAI has understandably pitched its new ChatGPT Study mode as a tool for students. The Socratic questioning, quizzes, memory checks, and feedback are designed to help students learn topics in ways that best suit their individual learning needs.\nHowever, the educational features enabled by selecting the “study and learn” icon might be just as helpful after school as they are to high school or college students working on their homework. I've experimented with a few ways it might be useful in my own life as I strive to learn new skills outside of any formal class structure.\nFrench fun\nLearning new languages is something I've worked on off and on throughout my entire adult life. I've even had some success with using ChatGPT for practice conversations. I decided that Study mode might be a good supplement to my efforts, so I turned on the educational feature to ask for help learning French, at least at a very casual, small talk level.\nInstead of giving me a vocabulary list or a grammar table, the AI started refining my request with questions like, “What are three everyday situations you want to be able to handle in French?\" and “What have you found confusing about learning French before?\" It focused on specifics and then transitioned into real-time quizzes, asking me to “Fill in this sentence: ‘Je ______ un café, s’il vous plaît.’”\nWhen I got it right, it added nuance. When I got it wrong, it didn’t just say “wrong,” it explained why and gave me another similar question. Over the course of 20 minutes, I went from passively reviewing to actively learning new ways of speaking. I can easily picture using Study Mode to enhance my skills.\nFinancial learning\nI next pursued a more personal learning goal: understanding personal finance. While I'm hardly ignorant on the basics, I tend to glaze over when reading about index funds or the individual elements of a mutual fund.\nSo I asked ChatGPT in Study Mode to give me a foundation on personal finance. The AI responded by asking about what kind of financial information I wanted to understand, such as budgeting, saving, or investing, then went into asking about how I spend money and what I want to spend in the future, then started guiding me into undestanding investment with examples and then quizzed me based on my earlier responses so that I could start thinking about invemstments as they actually relate to me. I'm not the Wolf of Wall Street or anything, but even 20 minutes of \"studying\" had added some useful references for my future financial decisions.\nSign up for breaking news, reviews, opinion, top tech deals, and more.\nCalculating with context\nI've had a guitar for a long time, and, like with learning a language, it's a skill I've developed on and off for years. Although AI tools have helped me stay disciplined in my practice, I wanted to explore what Study Mode has to say about improving my learning. The AI started by asking what kind of music I want to learn, my current ability, and even a specific song or skill I might like to focus on first.\nWhen I suggested fingerpicking, it set up a miniature practice curriculum. It picked patterns and told me to report back how it felt. It then explained the mechanics behind alternate picking, gave me a rhythm exercise, and offered a few ways to understand what I was doing so that I could absorb some of the music theory, too. I don't think it will turn me into Joni Mitchell, but I can see it being great for helping learn niche elements of guitar. on and off.\nStudy Mode was surprisingly flexible as an educational tool. I was impressed with the real-time curriculum development. It would obviously not be something I'd replace an actual teacher with, but it did push past surface-level lessons in a way I think might actually help stretch my brain without having to work toward a diploma.\nYou might also like\nEric Hal Schwartz is a freelance writer for TechRadar with more than 15 years of experience covering the intersection of the world and technology. For the last five years, he served as head writer for Voicebot.ai and was on the leading edge of reporting on generative AI and large language models. He's since become an expert on the products of generative AI models, such as OpenAI’s ChatGPT, Anthropic’s Claude, Google Gemini, and every other synthetic media tool. His experience runs the gamut of media, including print, digital, broadcast, and live events. Now, he's continuing to tell the stories people want and need to hear about the rapidly evolving AI space and its impact on their lives. Eric is based in New York City.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.techradar.com/computing/artificial-intelligence/what-is-google-gemini",
      "text": "Google Gemini explained: Everything you need to know about Google’s next-gen AI\nAll of your big Gemini questions, answered\nAlong with OpenAI's ChatGPT, Microsoft's Copilot and Apple Intelligence, Google Gemini is one of the dominant forces in the world of artificial intelligence (AI) and chatbots. Gemini is both the name for Google chatbot and the LLM that powers it, and it's free to use via a web browser, or on your mobile, but there's a paid-for version called Gemini Advanced that has some juicy features, like AI video generation with Veo 2.\nGoogle Gemini burst onto the scene in February 2024 and immediately made some big waves in the AI world, but it was the release of Gemini Live at the Made for Google event in August 2024 that really put it on the map. Gemini Live is a version of Gemini that runs on mobile phones, even the iPhone, and enables you to have free flowing conversations about complex topics using your voice instead of having to type on the keyboard.\nBut is Gemini Live enough to defeat Apple's AI-enhanced Siri (if and when it finally arrives) or ChatGPT's Advanced Voice Mode? What can it do right now, and what about in the future? And if you want to use Gemini, how exactly do you do that? We’ve taken a deep dive into the world of Gemini to find the answers to all these questions and more. If you’re curious about Google’s latest AI efforts, this is the place to be.\nWhat is Google Gemini?\nGemini is Google’s large language model (LLM), which is currently up to version 2.5 Pro. What’s an LLM? It’s the system that underpins the types of AI tools you’ve probably seen and interacted with on the internet. For example, GPT-4 powers ChatGPT-4o, OpenAI’s chatbot.\nGemini is more than an AI model, though, as it’s also the name and identity for it's chatbot, previously known as Bard. Essentially, Google has simplified things by calling both the underlying model and chatbot itself Gemini.\nFurthermore, there’s a free Gemini app for both Android and iOS now, and Gemini can replace Google Assistant on your Android phone if you wish. There's also a free version of Google Gemini that is accessible via any internet browser.\nOn top of all this, Google has rebranded its Duet AI service, aimed at businesses, as Gemini for Workspace, with a whole bunch of productivity-related chops on offer.\nSign up for breaking news, reviews, opinion, top tech deals, and more.\nThe final twist is that as well as the basic (free) version of Gemini for consumers, there is also premium offering for the AI known as Gemini Advanced, which is available through a subscription called Google One AI Premium. Gemini Advanced gives you more access to Gemini's more capable LLMs, and more access to the Gemini Deep Research feature.\nTo sum up, all Google’s AI properties are now under the Gemini umbrella to simplify things, whether that’s AI for consumers or businesses, and whether accessing Gemini via the web, or the assistant or app on your smartphone.\nWhat can Gemini do?\nThe short answer to this question is: a lot. But you probably want us to elaborate a bit more than that.\nAs we’ve just discussed, Gemini is an expansive umbrella for a whole lot of AI features and functionality delivered via different avenues. It has the same generative capabilities as other chatbots, like ChatGPT, so if you tell Gemini where you are going on your next trip, it will be able to help you pack. Or ask it to explain who Socrates was and sit back for a history lesson. It can answer questions, summarize text, write code and translate.\nGemini is a multimodal LLM. In other words, it can deal with various forms of input and output, including text, code, audio, images and videos. That gives it a lot of flexibility to perform a wide range of tasks.\nFor instance, you can upload an image (or take one with your smartphone) and Gemini can analyze the image and tell you things about it. Paste some code into the Gemini prompt box and ask it to rewrite it and Gemini can do that.\nRecently the ability to edit images has also been added to Gemini, so you can upload an image, and ask it to change it in some way.\nThere are four separate LLMs that Google has implemented with its AI. They are Gemini Ultra, Pro, Flash and Nano. If you go to the Gemini website and ask the chatbot a question you'll be using Gemini 2.0 or 2.5 Flash, which is Google's lightweight model, optimized for speed and efficiency.\nIf you are a member of the paid tier via Gemini Advanced then you get access to Gemini 2.5 Pro, which is the largest model, and good for highly complex tasks.\nFinally, there's the Deep Research with 2.5 Pro model, which is a research agent, capable of performing in-depth research on a subject for you, while you're free to go off and do something else.\nYou can also talk to Gemini with your voice and have it talk back by selecting the \"Go Live\" option when chatting to the LLM. This works best on the new Pixel 9 phones, which have the ability to share their screen and camera with Gemini, so it can 'see' what you're looking at and you can ask it questions about it.\nGoogle has developing its own answer to Midjourney in Imagen 3, which is integrated into Gemini, too. You can use Imagen 3 through Gemini, by asking it to simply create an image of a scene or person. Google is also developing native image generation for Gemini, which we'd expect to be added very soon.\nRecently AI video generation has also been added using Veo 2. For this to work you need to be a Gemini Advanced subscriber.\nIf you're a Gemini Advanced subscriber then you'll also find that Gemini is hooked into the likes of Gmail, Google Maps, and YouTube. So, if you ask it for sightseeing recommendations, for example, it will flag them up in Google Maps.\nThese are some nifty abilities for sure, and those with Android smartphones get even more mileage for free with the Gemini app. As already mentioned, this can replace Google Assistant on an Android device, if you wish, running queries and working its AI magic via other Google services (Maps, search, even Assistant itself, which isn’t actually chucked off your phone as such, and still lurks underneath).\nThat choice may lead you to wonder: is Gemini a good replacement for Google Assistant? Well, we covered this extensively in our hands-on with Gemini on Android, and there are certainly drawbacks with the AI. Gemini is noticeably slower than Google Assistant, and the AI still has bugs.\nThat said, the initial Gemini on Android experience was a lot wonkier than it is now. An example that springs to mind is that Gemini was supposed to deal with smart home gadgets, but failed in that task when we tried it initially - but more recently, this feature has come good and now works.\nIt seems that Google is ironing out the problems with Gemini on mobile pretty swiftly, which is heartening to see, and the results with the Gemini app can be impressive. There are still wrinkles to smooth over in terms of replacing Google Assistant on Android, but that should come in time.\nOverall, then, the freebie version does give you a lot to get on with, especially for Pixel 9 users. However, the paid take on Gemini is actually far more in-depth.\nFor those who use Google’s productivity apps and have a Google Workspace account, Gemini is available in Google Docs, Gmail, and more.\nWhen was Gemini released?\nGoogle Gemini was released on February 8 2024, with Google confirming that it replaced Bard which was put out to pasture. Gemini was available immediately, in both its free form, and the paid version, Gemini Advanced. Google also began the rollout of the Android app in the US straight away.\nThe Gemini app is also available for Samsung phones, read our Samsung Galaxy Z Flip 6 review, and for iPhone and iPad.\nIs Google Gemini free?\nThe standard version of Google Gemini is free, but it’s more limited than the paid spin on the AI. Those who pay a subscription for Gemini Advanced get a lot more depth in terms of access to Gemini's more advanced capabilities as well as AI video creation.\nHow much is Gemini Advanced? Google charges $19.99 (£18.99 / AU$32.99) per month, but you can try it out for a limited time for free, as a one-month trial is currently available. The subscription comes with other benefits, though, as Gemini Advanced is actually part of the Google One AI Premium Plan, which also provides 2TB of cloud storage among other extras.\nGiven that Google One with 2TB of storage already costs $9.99 / £7.99 / AU$12.49 per month, if you need a cloud storage locker, Gemini Advanced looks a more tempting value proposition.\nHow do I use Google Gemini?\nThe way you use Google Gemini depends on device you're using.\nOn a PC or laptop, you can head to the Gemini website and use the AI there for free in the typical way you interact with an online chatbot. If you subscribe to Gemini Advanced, you get the full AI experience including AI video generation, sharper responses, more access to advanced LLMs for dealing with complex tasks and demanding creative needs, and the other benefits we’ve outlined above.\nOn mobile you can use the Gemini app on your Android phone (or replace Google Assistant with Gemini, as noted) or on iOS where you get all the same features you'll find in the browser, but with the addition of Gemini Live for conversing to Gemini using your voice.\nIf you are on a smartphone like the Google Pixel 9, then you can use Gemini Live with enhanced screen sharing and camera control features.\nGemini vs GPT-4: what’s the difference?\nHow does Gemini stack up against GPT-4 in the battle of the large language models?\nFor one thing, when Gemini was first revealed, Google claimed it’s more advanced than GPT-4. In a blog post, Google showed results from eight text-based benchmarks, with Gemini winning in seven of those tests. Across 10 multimodal benchmarks, Gemini came out on top in every one, according to Google at least.\nThat would seem to imply that Gemini is the superior system, but it’s not quite so straightforward, of course. GPT-4 came out in March 2023, and Gemini 1.5 Pro came out in February and Gemini 1.5 Flash came out in May 2024. ChatGPT now has many more advanced models like 4o and o3, not to mention the new ChatGPT-4.5. Gemini is now up to 2.5 Flash and 2.5 Pro models.\nOn the whole, features are roughly comparable between ChatGPT Plus and Gemini Advanced, and both have a free tier. It may simply come down to personal choice and finding the chatbot that fits your person style best.\nYou might also like\nAlex Blake has been fooling around with computers since the early 1990s, and since that time he's learned a thing or two about tech. No more than two things, though. That's all his brain can hold. As well as TechRadar, Alex writes for iMore, Digital Trends and Creative Bloq, among others. He was previously commissioning editor at MacFormat magazine. That means he mostly covers the world of Apple and its latest products, but also Windows, computer peripherals, mobile apps, and much more beyond. When not writing, you can find him hiking the English countryside and gaming on his PC.\n- Graham BarlowSenior Editor, AI\n- Darren Allan\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    }
  ],
  "argos_summary": "Google Gemini has launched a new educational feature called Guided Learning, which engages users in a question-centered conversation to teach various topics. This interactive approach includes visuals, quizzes, and multimedia resources, enhancing the learning experience. A test of the feature demonstrated its effectiveness in teaching about cheese, providing detailed explanations and even guiding the user through making ricotta. Additionally, Google Gemini is expanding its capabilities in education with stricter content policies and AI literacy tools for students under 18.",
  "argos_id": "0S911LGSW"
}