{
  "url": "https://www.startribune.com/trumps-washington-police-takeover-echoes-history-of-racist-narratives-about-urban-crime/601453430",
  "authorsByline": "MATT BROWN",
  "articleId": "49d24db0759f4834b3d783ead56a52c8",
  "source": {
    "domain": "startribune.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "MN",
      "county": "Hennepin County",
      "city": "Minneapolis",
      "coordinates": {
        "lat": 44.9772995,
        "lon": -93.2654692
      }
    }
  },
  "imageUrl": "https://www.startribune.com/200.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T04:04:01.024000+00:00",
  "addDate": "2025-08-12T04:16:36.856450+00:00",
  "refreshDate": "2025-08-12T04:16:36.856454+00:00",
  "score": 1.0,
  "title": "Trump's Washington police takeover echoes history of racist narratives about urban crime",
  "description": "President Donald Trump has taken control of the District of Columbia's law enforcement and ordered National Guard troops to deploy onto the streets of the nation's capital, arguing the extraordinary moves are in response to an urgent public safety crisis.",
  "content": "Man wielding knife in Walker is charged in attack on police officer who shot him\n\nCharge: Teen on phone when he caused Twin Cities crash that killed girl, 11, in other vehicle\n\nBuxton was itching to return to top of the lineup for young and energetic Twins\n\nWASHINGTON — President Donald Trump has taken control of the District of Columbia's law enforcement and ordered National Guard troops to deploy onto the streets of the nation's capital, arguing the extraordinary moves are in response to an urgent public safety crisis. Even as district officials questioned the claims underlying his emergency declaration, the president promised a \"historic action to rescue our nation's capital from crime, bloodshed, bedlam and squalor and worse.\" His rhetoric echoed that used by conservative politicians going back decades who have denounced American cities, especially those with majority non-white populations or led by progressive politicians, as lawless or crime-ridden and in need of outside intervention. ''This is liberation day in D.C., and we're going to take our capital back,'' Trump promised Monday. But for many residents, the prospect of federal troops surging into the district's neighborhoods represents an alarming violation of local agency. To some, it echoes uncomfortable historical chapters when politicians used language to paint historically or predominantly Black cities and neighborhoods with racist narratives to shape public opinion and justify aggressive police action. April Goggans, a longtime Washington resident and grassroots organizer, said she was not surprised by Trump's actions. Communities had been preparing for a potential federal crackdown in the district since the summer of 2020, when Trump deployed National Guard troops during racial justice protests after the murder of George Floyd. ''We have to be vigilant,'' said Goggans, who has coordinated protests and local civil liberties educational campaigns for nearly a decade. She worries about what a surge in law enforcement could mean for residents' freedoms. ''Regardless of where you fall on the political scale, understand that this could be you, your children, your grandmother, your co-worker who are brutalized or have certain rights violated,'' she said.\n\nAccording to White House officials, National Guard troops will be deployed to protect federal assets in the district and facilitate a safe environment for law enforcement to make arrests. The administration believes the highly visible presence of law enforcement will deter violent crime. It is unclear how the administration defines providing a safe environment for law enforcement to conduct arrests, raising alarm bells for some local advocates. ''The president foreshadowed that if these heavy-handed tactics take root here, they will be rolled out to other majority-Black and Brown cities, like Chicago, Oakland and Baltimore, across the country,'' said Monica Hopkins, executive director of the American Civil Liberties Union's D.C. chapter. ''We've seen before how federal control of the D.C. National Guard and police can lead to abuse, intimidation and civil rights violations — from military helicopters swooping over peaceful racial justice protesters in 2020 to the unchecked conduct of federal officers who remain shielded from full accountability,'' Hopkins said.\n\nConservative lawmakers have for generations used denigrating language to describe the condition of major American cities and called for greater law enforcement, often in response to changing demographics in those cities driven by nonwhite populations relocating in search of work or safety from racial discrimination and state violence. Republicans have called for greater police crackdowns in cities since at least the 1965 Watts Riots in Los Angeles. President Richard Nixon won the White House in 1968 after campaigning on a \"law and order\" agenda to appeal to white voters in northern cities alongside overtures to white Southerners as part of his ''Southern Strategy.'' Ronald Reagan similarly won both his presidential elections after campaigning heavily on law and order politics. Politicians ranging from former New York Mayor Rudy Giuliani to former President Bill Clinton have cited the need to tamp down crime as a reason to seize power from cities like Washington for decades. District of Columbia Mayor Muriel Bowser called Trump's takeover of the local police force ''unsettling'' but not without precedent. The mayor kept a mostly measured tone during a Monday news conference following Trump's announcement but decried the president's reasoning as a ''so-called emergency'' and said the district's residents ''know that access to our democracy is tenuous.'' Trump threatened to ''take over'' and ''beautify'' the nation's capital on the campaign trail and claimed the district was ''a nightmare of murder and crime.'' He also argued the city was ''horribly run'' and said his team intended ''to take it away from the mayor.'' The president repeated comments he'd previously made about some of the nation's largest cities during his news conference, including Baltimore, Chicago, Los Angeles, Oakland, California, and his hometown of New York City. All are currently run by Black mayors. ''You look at Chicago, how bad it is. You look at Los Angeles, how bad it is. We have other cities in a very bad, New York is a problem. And then you have, of course, Baltimore and Oakland. We don't even mention that anymore. They're so far gone. We're not going to let it happen,'' he said. Civil rights advocates see the president's rhetoric as part of a broader political strategy.\n\n''It's a playbook he's used in the past,'' said Maya Wiley, CEO of the Leadership Conference on Civil and Human Rights. The president's rhetoric \"paints a picture that crime is out of control, even when it is not true, then blames the policies of Democratic lawmakers that are reform- and public safety-minded, and then claims that you have to step in and violate people's rights or demand that reforms be reversed,'' Wiley said. She added that the playbook has special potency in the capital because the district's local law enforcement can be directly placed under federal control, a power Trump invoked in his announcement. Trump's actions in Washington and comments about other major American cities sent shock waves across the country, as other cities prepare to respond to potential federal action. Democratic Maryland Gov. Wes Moore said Trump's plan ''lacks seriousness and is deeply dangerous'' in a statement and pointed to a 30-year-low crime rate in Baltimore as a reason the administration should consult local leaders rather than antagonize them. In Oakland, Mayor Barbara Lee called Trump's characterization of the city ''fearmongering.''\n\nThe administration already faced a major flashpoint between local control and federal power earlier in the summer, when Trump deployed National Guard troops to quell protests and support immigration enforcement operations in Los Angeles despite opposition from California Gov. Gavin Newsom and Los Angeles Mayor Karen Bass. Civil rights leaders have denounced Trump's action in Washington as an unjustified distraction. ''This president campaigned on ‘law and order,' but he is the president of chaos and corruption,\" said NAACP President Derrick Johnson. ''There's no emergency in D.C., so why would he deploy the National Guard? To distract us from his alleged inclusion in the Epstein files? To rid the city of unhoused people? D.C. has the right to govern itself. It doesn't need this federal coup.\"",
  "medium": "Article",
  "links": [
    "https://www.startribune.com/news-politics/nation"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "other cities",
      "weight": 0.07459496
    },
    {
      "name": "other major American cities",
      "weight": 0.07316254
    },
    {
      "name": "law enforcement",
      "weight": 0.07302841
    },
    {
      "name": "greater law enforcement",
      "weight": 0.07047608
    },
    {
      "name": "American cities",
      "weight": 0.070278846
    },
    {
      "name": "major American cities",
      "weight": 0.07024848
    },
    {
      "name": "cities",
      "weight": 0.066903464
    },
    {
      "name": "northern cities",
      "weight": 0.06583922
    },
    {
      "name": "President Donald Trump",
      "weight": 0.06295048
    },
    {
      "name": "Trump",
      "weight": 0.061402895
    }
  ],
  "topics": [
    {
      "name": "Racial Injustice"
    },
    {
      "name": "Social Issues"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.94482421875
    },
    {
      "name": "/Sensitive Subjects/Violence & Abuse",
      "score": 0.91845703125
    },
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.853515625
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.8095703125
    },
    {
      "name": "/Sensitive Subjects/Other",
      "score": 0.744140625
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.642578125
    },
    {
      "name": "/Sensitive Subjects/Death & Tragedy",
      "score": 0.38623046875
    },
    {
      "name": "/News/Other",
      "score": 0.36669921875
    }
  ],
  "sentiment": {
    "positive": 0.07198265,
    "negative": 0.72345793,
    "neutral": 0.20455948
  },
  "summary": "President Donald Trump has taken control of the District of Columbia's law enforcement and ordered National Guard troops to be deployed onto the streets of the nation's capital, in response to an urgent public safety crisis. However, many residents believe this represents an alarming violation of local agency. The move echoes a history of conservative politicians' denigrating language about American cities, particularly those with majority non-white populations, as lawless or crime-ridden. The White House plans to use these National Guard forces to protect federal assets and create a safe environment for law enforcement. The administration believes this visible presence of law enforcement will deter violent crime. Critics worry that this could lead to abuse, intimidation and civil rights violations in other majority-Black and Brown cities across the country.",
  "shortSummary": "President Donald Trump's takeover of Washington's police force amid a public safety crisis echoes past racist narratives and concerns about civil liberties.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "891d3371c5a0445aa1f3db5a8dc4287f",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.startribune.com/news-politics/nation",
      "text": "President Donald Trump extended a trade truce with China for another 90 days Monday, at least delaying once again a dangerous showdown between the world's two biggest economies.\nMore from Nation\nOfficials are still investigating the cause of a Pennsylvania steel plant explosion that killed 2\nAn explosion rocked a steel plant outside Pittsburgh on Monday, leaving two dead and 10 others injured, including a person who was rescued from the smoldering rubble after hours of being trapped.\nAugust 12, 2025\nFIFA moves ahead with new human rights strategy for World Cup games, but advocates are skeptical\nHuman rights scandals have marred World Cup tournaments for years, but FIFA is testing a new protocol requiring all host committees to develop action plans to protect human rights for the 2026 games in North America.\nAugust 12, 2025\nTrump's Washington police takeover echoes history of racist narratives about urban crime\nPresident Donald Trump has taken control of the District of Columbia's law enforcement and ordered National Guard troops to deploy onto the streets of the nation's capital, arguing the extraordinary moves are in response to an urgent public safety crisis.\nAugust 12, 2025\nFederal becomes local: The nation's capital finds itself at the center of a Donald Trump maelstrom\nThe questions came fast to the mayor of the nation's capital, many of them designed to get her to say something harsh about Donald Trump — in particular, the president's freshly announced plan to take over the Metropolitan Police Department and call in the National Guard.\nAugust 12, 2025\nInflation likely moved higher last month as tariffs bite, putting the Fed in bind\nInflation likely ticked up in July for the third straight month as tariffs lift the cost of imported goods such as furniture, appliances, and toys, which could make it harder for the Federal Reserve to cut short-term interest rates as President Donald Trump has demanded.\nAugust 12, 2025\nUvalde school records show teenage gunman's spiral before 2022 shooting\nThe teenage gunman in the 2022 Robb Elementary School massacre entered school in Uvalde, Texas, as a bright learner before years of escalating academic and behavioral troubles that preceded him opening fire on a fourth-grade classroom, according to records released Monday.\nAugust 12, 2025\nTrump's tax law will mostly benefit the rich, while leaving poorer Americans with less, CBO says\nPresident Donald Trump'stax and spending law will result in less income for the poorest Americans while sending money to the richest, the nonpartisan Congressional Budget Office reported Monday.\nAugust 12, 2025\nDodgers star Shohei Ohtani and agent accused of sabotaging $240M Hawaii real estate project\nA Hawaii real estate investor and broker are suing Shohei Ohtani, claiming the Los Angeles Dodgers star and his agent got them fired from a $240 million luxury housing development on the Big Island's coveted Hapuna Coast that they brought him in to endorse.\nAugust 12, 2025\nRobbie Brewer dies after medical emergency during race at Bowman Gray Stadium\nA veteran stock-car driver at a North Carolina short track died over the weekend after suffering a medical emergency while competing in a race, officials said.\nAugust 12, 2025\nPlane crashes into parked aircraft while landing at Montana airport, sparking fire\nA small plane landing on Monday at a Montana airport crashed into parked aircraft, triggering a large fire but causing no serious injuries, authorities said.\nAugust 12, 2025"
    }
  ],
  "argos_summary": "President Donald Trump has taken control of law enforcement in Washington, D.C., deploying National Guard troops in response to what he claims is a public safety crisis, despite local officials questioning the legitimacy of this emergency declaration. His actions and rhetoric have raised concerns among residents and civil rights advocates, who view them as a violation of local autonomy and a continuation of historical patterns of federal intervention in predominantly Black cities. Critics argue that Trump's portrayal of urban crime is exaggerated and serves a political agenda, echoing tactics used by conservative politicians for decades.",
  "argos_id": "0WO14RI1Y"
}