{
  "url": "https://nypost.com/2025/08/11/sports/yankees-woes-disappear-as-they-top-twins-for-much-needed-win/",
  "authorsByline": "Zach Braziller",
  "articleId": "3d1005273e8d44b5a7d1c1989d7cd4dd",
  "source": {
    "domain": "nypost.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://nypost.com/wp-content/uploads/sites/2/2025/08/newspress-collage-v8bnkfk5k-1754962713007.jpg?quality=75&strip=all&1754948437&w=1024",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T01:52:23+00:00",
  "addDate": "2025-08-12T01:55:20.294994+00:00",
  "refreshDate": "2025-08-12T01:55:20.294997+00:00",
  "score": 1.0,
  "title": "Yankees’ woes disappear as they bully familiar foil Twins for much-needed win",
  "description": "The schedule makers presented the Yankees with a gift this week. An antidote to their struggles. A magic elixir.",
  "content": "The schedule makers presented the Yankees with a gift this week. An antidote to their struggles. A magic elixir.\n\nComing off a disappointing series against the Astros, engulfed in an extended dismal stretch that has seen them play their way from the top of the AL East to nearly out of a wild-card spot, luck would have it that the stripped-down Minnesota Twins would be visiting The Bronx starting Monday night.\n\nSuddenly, their woes disappeared. The Twins, the personal punching bag for the Yankees over the past two decades, have that effect on them.\n\nThey played their part to a tee, as they have since 2002. The Twins only managed two solo homers off Will Warren in 6 ²/₃ strong innings and the Yankees did enough offensively for a much-needed 6-2 victory, improving to an almost incomprehensible 124-44 (including the playoffs) against the AL Central foe since said year.\n\nThe Yankees have beaten them eight straight times and are 30-5 against them at the Stadium since 2015.\n\nConsidering how the Yankees have played for a while, entering the night 11 games under .500 since June 12, they’ll take wins any way they can get them. The four-run margin was their largest in a victory since an 11-0 rout of the Cubs on July 11. That was before the All-Star break.\n\nSo consider this a minor step in the right direction, a start to a soft portion of the schedule the Yankees really need to take advantage of. Warren fanned five of the first six Twins he faced, Cody Bellinger, Ben Rice and Giancarlo Stanton all went deep in the first three innings, and the result was never really in doubt.\n\nWarren continued his recent run of strong work. He has allowed two earned runs or fewer in six of his past seven starts. In that span, he has a 2.84 ERA. Warren needed just 50 pitches to get through the first four innings of one-hit ball, and became the first Yankees starter to complete six innings since he himself went six on July 30.\n• CHECK OUT THE LATEST MLB STANDINGS AND YANKEES STATS\n\nIt wasn’t until Warren’s 65th pitch, a slider that got too much of the plate, that the Twins scored. Byron Buxton went deep with two outs in the sixth inning for his 24th homer of the year.\n\nAn inning later, Trevor Larnach went yard, and Warren was pulled in favor of Luke Weaver. Trent Grisham and Aaron Judge added run-scoring singles to extend the lead in the bottom half of the inning.\n\nThe Twins never threatened again, as the Yankees cruised to a rare stress-free victory.\n\nThere were a number of positives, from Warren’s sterling effort to Judge coming through with a key hit late after struggling since coming off the IL.\n\nBut perhaps the biggest one was this: Two more games against the Twins.",
  "medium": "Article",
  "links": [
    "https://sportstats.nypost.com/baseball/mlb/teamstatistics/2970",
    "https://nypost.com/video/yankees-talent-cant-mask-their-issues-this-season/",
    "https://nypost.com/2025/08/11/sports/giancarlo-stanton-is-giving-the-yankees-everything-they-ask-for/",
    "http://nypost.com/account/subscribe/",
    "https://nypost.com/video/yankees-mets-showed-new-yorkers-its-officially-football-season-ny-sports-minute/",
    "https://sportstats.nypost.com/baseball/mlb/standings"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Yankees",
      "weight": 0.090884365
    },
    {
      "name": "Minnesota Twins",
      "weight": 0.08125238
    },
    {
      "name": "Will Warren",
      "weight": 0.08113719
    },
    {
      "name": "familiar foil Twins",
      "weight": 0.080173366
    },
    {
      "name": "Warren",
      "weight": 0.078435
    },
    {
      "name": "Twins",
      "weight": 0.078162685
    },
    {
      "name": "first",
      "weight": 0.060854018
    },
    {
      "name": "the first Yankees starter",
      "weight": 0.05857173
    },
    {
      "name": "Aaron Judge",
      "weight": 0.057254042
    },
    {
      "name": "AL Central",
      "weight": 0.056549553
    }
  ],
  "topics": [
    {
      "name": "Baseball"
    },
    {
      "name": "MLB"
    },
    {
      "name": "New York Yankees"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.97998046875
    },
    {
      "name": "/Sports/Team Sports/Baseball",
      "score": 0.94384765625
    }
  ],
  "sentiment": {
    "positive": 0.27215785,
    "negative": 0.40163442,
    "neutral": 0.32620776
  },
  "summary": "The New York Yankees defeated the Minnesota Twins 6-2, a crucial victory for the team following a disappointing series against the Astros. The Twins managed only two solo home runs off Will Warren, while the Yankees improved to an almost incomprehensible 124-44 (including the playoffs) against them. The victory was the largest in a victory since an 11-0 victory against the Cubs on July 11. The win was a significant step forward for the Yankees, who have been 11 games under.500 since June 12.",
  "shortSummary": "The Yankees overcame their recent struggles with a 6-2 win over the Minnesota Twins, thanks to strong performances from Warren and a significant increase in support.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "9adfa8a62f90469f99e0ab508d42c63b",
  "places": [
    {
      "osmId": "9691916",
      "suburb": "The Bronx",
      "city": "New York",
      "state": "New York",
      "country": "United States",
      "countryCode": "us",
      "coordinates": {
        "lat": 40.8466508,
        "lon": -73.8785937
      }
    }
  ],
  "scraped_sources": [],
  "argos_summary": "The New York Yankees secured a much-needed 6-2 victory against the Minnesota Twins, breaking a dismal stretch that had seen them fall significantly in the standings. Will Warren delivered a strong performance, allowing only two solo homers in 6 ²/₃ innings, while the Yankees' offense featured home runs from Cody Bellinger, Ben Rice, and Giancarlo Stanton. This win marks the Yankees' eighth consecutive victory over the Twins, and they look to capitalize on a favorable schedule ahead.",
  "argos_id": "12QDS8HW5"
}