{
  "url": "https://www.ajc.com/news/2025/08/asian-shares-advance-on-relief-that-trump-is-delaying-higher-china-tariffs/",
  "authorsByline": "YURI KAGEYAMA",
  "articleId": "e0d48a8331264475ada4139738bd92a4",
  "source": {
    "domain": "ajc.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "GA",
      "county": "Fulton County",
      "city": "Atlanta",
      "coordinates": {
        "lat": 33.7489924,
        "lon": -84.3902644
      }
    }
  },
  "imageUrl": "https://www.ajc.com/resizer/v2/QCYAF5JI6JFY5DR5BYHBDKEYHA.jpg?auth=4a38d6c9c4e0f4a24407bb6cc23afcec6598cb040de9f2424ae555350858b68a&width=1200&height=630&smart=true",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T04:33:02.318000+00:00",
  "addDate": "2025-08-12T04:48:12.165308+00:00",
  "refreshDate": "2025-08-12T04:48:12.165310+00:00",
  "score": 1.0,
  "title": "Asian shares advance on relief that Trump is delaying higher China tariffs",
  "description": "Asian shares are mostly higher after President Donald Trump delayed raising tariffs on China for another 90 days",
  "content": "Trump signed an executive order Monday putting on hold a possible showdown between the world’s two major economies to allow time for more talks on a broad trade agreement. Without an extension, taxes on Chinese imports might have jumped from an already high 30%.\n\nBeijing could have responded by raising retaliatory levies on U.S. exports to China but it issued a similar statement about the extension of the tariff pause.\n\nThe reprieve makes room for a possible deal with Trump, but it also prolongs the uncertainty that has bedeviled companies since the president began escalating his trade war.\n\n“The extension isn’t about goodwill; it’s about keeping oxygen in the room for deals that matter,” Stephen Innes of SPI Asset Management said in a commentary.\n\nElsewhere in Asia, Australia’s S&P/ASX 200 was little changed, rising less than 0.1% to 8,852.80. South Korea’s Kospi added 0.6% to 3,227.10.\n\nOn Monday, U.S. stocks edged back from their record highs ahead of an update on U.S. inflation. The S&P 500 dipped 0.3% to 6,373.45 after flirting with its all-time high, which was set two weeks ago.\n\nThe Dow Jones Industrial Average dropped 0.5% to 43,975.09, and the Nasdaq composite slipped 0.3% to 21,385.40.\n\nThe highlight of this week for Wall Street will likely arrive on Tuesday, when the government will report how bad inflation was across the country in July. Economists expect it to show U.S. consumers had to pay prices for groceries, gasoline and other costs of living that were 2.8% higher than a year earlier, a slight acceleration from June’s 2.7% inflation.\n\nInflation has remained above 2%, even if it has improved substantially from its peak above 9% three years ago. And the worry is that President Donald Trump’s tariffs could push prices still higher.\n\nThat in turn is raising fears about a potential, worst-case scenario called “stagflation” where the economy stagnates but inflation remains high. The Federal Reserve has no good tool to fix both at once, and it would need to concentrate on either the job market or inflation first. But helping one of those areas by moving interest rates would likely hurt the other.\n\nA top Fed official, Michelle Bowman, said on Saturday that she believes the job market is the bigger concern. She is still backing three cuts to interest rates by the Fed this year following this month’s stunning, weaker-than-expected report on the U.S. job market. Trump has also been angrily calling for cuts to interest rates to support the economy.\n\nOther Fed officials, led by Chair Jerome Powell, have been more hesitant. Powell has said he wants to wait for more data about how Trump’s tariffs are affecting inflation before the Fed makes its next move, and Tuesday’s update on the consumer price index may offer a big clue about that.\n\nThe price of gold eased after Trump said he would not place tariffs on the metal. That followed a brouhaha Friday in the gold market after the U.S. Customs and Border Patrol seemed to rule that some kinds of gold bars coming from Switzerland would face a tariff. That caused a disconnect between the prices of gold trading in New York versus in London, but the market has since calmed.\n\nGold for December delivery settled at $3,404.70 per ounce in New York, down 2.5%. Early Tuesday, it was down 0.1% at $3,399.70.\n\nIn other dealings early Tuesday, benchmark U.S. crude rose 17 cents to $64.13 a barrel. Brent crude, the international standard, added 21 cents to $66.84 a barrel.\n\nIn currency trading, the U.S. dollar edged up to 148.44 Japanese yen from 148.15 yen. The euro cost $1.1621, up from $1.1618.",
  "medium": "Article",
  "links": [
    "https://apnews.com/article/trump-tariffs-deadline-delay-d8ffef07d944dc1d460b472e4ffd2f57",
    "https://apnews.com/article/inflation-trump-fed-powell-prices-8842d6ebca9d1870983e678e578d2091",
    "https://apnews.com/article/jobs-unemployment-economy-trump-federal-reserve-68a15f89d68793a6cf88a522ff33246c",
    "https://apnews.com/article/federal-reserve-michelle-bowman-interest-rates-d24adfa4429586bb95f538c3fe0a2989",
    "https://apnews.com/article/federal-reserve-powell-trump-rates-99d90bab1ba2faa0fc5d4a6106125da7",
    "https://apnews.com/article/stocks-markets-tariffs-trump-eu-72eaa68a1a9e4079a5ff7adb89a51315",
    "https://truthsocial.com/@realDonaldTrump/posts/115011325631302905"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "U.S. inflation",
      "weight": 0.08856653
    },
    {
      "name": "U.S. consumers",
      "weight": 0.07868476
    },
    {
      "name": "benchmark U.S. crude",
      "weight": 0.07627427
    },
    {
      "name": "U.S. exports",
      "weight": 0.07470841
    },
    {
      "name": "U.S. stocks",
      "weight": 0.07367018
    },
    {
      "name": "higher China tariffs",
      "weight": 0.073180914
    },
    {
      "name": "U.S.",
      "weight": 0.07299501
    },
    {
      "name": "Donald Trump",
      "weight": 0.0703011
    },
    {
      "name": "Trump",
      "weight": 0.06866699
    },
    {
      "name": "Other Fed officials",
      "weight": 0.067624494
    }
  ],
  "topics": [
    {
      "name": "Asian"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.96533203125
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.93115234375
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.85205078125
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.76708984375
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.7236328125
    },
    {
      "name": "/People & Society/Social Sciences/Political Science",
      "score": 0.72216796875
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.66064453125
    }
  ],
  "sentiment": {
    "positive": 0.081773795,
    "negative": 0.78691244,
    "neutral": 0.13131377
  },
  "summary": "Asian shares rose following President Donald Trump's decision to delay higher China tariffs to allow for more trade talks. The extension of the tariff pause makes room for a potential deal with the world's two major economies, but also prolongs uncertainty. Without the extension, taxes on Chinese imports might have risen from an already high 30% to a maximum of 30%. China could have responded by raising retaliatory levies on U.S. exports to China, but it issued a similar statement about the extension. The highlight of this week for Wall Street is expected to be a report on inflation in July, which economists expect to show that the government will report how bad inflation was across the country in July. The price of gold eased after Trump announced he would not place tariffs on the metal.",
  "shortSummary": "Asian shares rose as investors welcomed President Donald Trump's executive order delaying higher China tariffs, allowing for more trade talks and raising inflation concerns.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "19a82cf2b7284f91a296a350607ce8e0",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://apnews.com/article/federal-reserve-michelle-bowman-interest-rates-d24adfa4429586bb95f538c3fe0a2989",
      "text": "A top Federal Reserve official says dour jobs data backs the case for 3 rate cuts\nNEW YORK (AP) — A top official at the Federal Reserve said Saturday that this month’s stunning, weaker-than-expected report on the U.S. job market is strengthening her belief that interest rates should be lower.\nMichelle Bowman was one of two Fed officials who voted a week and a half ago in favor of cutting interest rates. Such a move could help boost the economy by making it cheaper for people to borrow money to buy a house or a car, but it could also threaten to push inflation higher.\nBowman and a fellow dissenter lost out after nine other Fed officials voted to keep interest rates steady, as the Fed has been doing all year. The Fed’s chair, Jerome Powell, has been adamant that he wants to wait for more data about how President Donald Trump’s tariffs are affecting inflation before the Fed makes its next move.\nAt a speech during a bankers’ conference in Colorado on Saturday, Bowman said that “the latest labor market data reinforce my view” that the Fed should cut interest rates three times this year. The Fed has only three meetings left on the schedule in 2025.\nThe jobs report that arrived last week, only a couple of days after the Fed voted on interest rates, showed that employers hired far fewer workers last month than economists expected. It also said that hiring in prior months was much lower than initially thought.\nOn inflation, meanwhile, Bowman said she is getting more confident that Trump’s tariffs “will not present a persistent shock to inflation” and sees it moving closer to the Fed’s 2% target. Inflation has come down substantially since hitting a peak above 9% after the pandemic, but it has been stubbornly remaining above 2%.\nThe Fed’s job is to keep the job market strong, while keeping a lid on inflation. Its challenge is that it has one main tool to affect both those areas, and helping one by moving interest rates up or down often means hurting the other.\nA fear is that Trump’s tariffs could box in the Federal Reserve by sticking the economy in a worst-case scenario called “stagflation,” where the economy stagnates but inflation is high. The Fed has no good tool to fix that, and it would likely have to prioritize either the job market or inflation before helping the other.\nOn Wall Street, expectations are that the Fed will have to cut interest rates at its next meeting in September after the U.S. jobs report came in so much below economists’ expectations.\nTrump has been calling angrily for lower interest rates, often personally insulting Powell while doing so. He has the opportunity to add another person to the Fed’s board of governors after an appointee of former President Joe Biden stepped down recently."
    },
    {
      "url": "https://apnews.com/article/stocks-markets-tariffs-trump-eu-72eaa68a1a9e4079a5ff7adb89a51315",
      "text": "Wall Street kicks off a week full of potential flashpoints with a whisper\nWall Street kicks off a week full of potential flashpoints with a whisper\nNEW YORK (AP) — U.S. stock indexes drifted through a quiet Monday after the United States agreed to tax cars and other products coming from the European Union at a 15% rate, lower than President Donald Trump had earlier threatened. Many details of the trade deal are still to be worked out, and Wall Street is heading into a week full of potential flashpoints that could shake markets.\nThe S&P 500 was nearly flat and edged up by less than 0.1% to set an all-time high for a sixth straight day. The Dow Jones Industrial Average dipped 64 points, or 0.1%, while the Nasdaq composite added 0.3% to its own record.\nTesla rose 3% after its CEO, Elon Musk, said it signed a deal with Samsung Electronics that could be worth more than $16.5 billion to provide chips for the electric-vehicle company. Samsung’s stock in South Korea jumped 6.8%.\nOther companies in the chip and artificial-intelligence industries were strong, continuing their run from last week after Alphabet said it was increasing its spending on AI chips and other investments to $85 billion this year. Chip company Advanced Micro Devices rose 4.3%, and server-maker Super Micro Computer climbed 10.2%.\nBut an 8.3% drop for Revvity helped to keep the market in check. The company in the life sciences and diagnostics businesses reported a stronger profit for the latest quarter than Wall Street expected, but its forecast for full year profit disappointed analysts.\nCompanies are broadly under pressure to deliver solid growth in profits following big jumps in their stock prices the last few months. Much of the gain was due to hopes that Trump would walk back some of his stiff proposed tariffs, and critics say the U.S. stock market looks expensive unless companies produce bigger profits.\nAll told, the S&P 500 added 1.13 to 6,389.77 points. The Dow Jones Industrial Average dipped 64.36 to 44,837.56, and the Nasdaq composite rose 70.27 to 21,178.58.\nMore fireworks may be ahead this week. “This is about as busy as a week can get in the markets,” according to Chris Larkin, managing director, trading and investing, at E-Trade from Morgan Stanley.\nHundreds of U.S. companies are lined up to report how much profit they made during the spring, with nearly a third of the businesses in the S&P 500 index scheduled to deliver updates. That includes market heavyweights Apple, Amazon, Meta Platforms and Microsoft. Those companies have grown so huge that their stock movements can almost dictate what the overall S&P 500 index does. Microsoft alone is worth $3.8 trillion.\nOn Wednesday, the Federal Reserve will announce its latest decision on interest rates.\nTrump has been angrily calling for the Fed to cut interest rates, a move that could give the economy a boost. But Fed Chair Jerome Powell insists that he wants more data about how Trump’s tariffs are affecting the economy and inflation before the Fed makes its next move. Lower interest rates can fuel inflation, and the economy only recently came out of its scarring run where inflation briefly topped 9%.\nThe widespread expectation on Wall Street is that Fed officials will wait until September to resume cutting interest rates, though a couple of Trump’s appointees could dissent in the vote. The Fed has been on hold with interest rates this year since cutting them several times at the end of 2024.\nThis week will also feature several potentially market-moving updates about the economy. On Tuesday will come reports on how confident U.S. consumers are feeling and how many jobs openings U.S. employers were advertising. Wednesday will show the first estimate of how quickly the U.S. economy grew during the spring, and economists expect to see a slowdown from the first three months of the year.\nOn Thursday, the latest measure of inflation that the Federal Reserve prefers to use will arrive. A modest reading could give the Fed more leeway to cut interest rates in the short term, while a hotter-than-expected figure could make it more cautious.\nAnd Friday will bring an update on how many more workers U.S. employers hired during June than they fired.\nTreasury yields held relatively steady in the bond market ahead of all that action. The yield on the 10-year Treasury edged up to 4.41% from 4.40% late Friday. The two-year Treasury yield, which more closely tracks expectations for Fed action, rose to 3.92% from 3.91%.\nIn stock markets abroad, indexes dipped in Europe following the announcement of the trade deal’s framework.\nChinese stocks rose as officials from the world’s second-largest economy prepared to meet with a U.S. delegation in Sweden for trade talks. Stocks climbed 0.7% in Hong Kong and 0.1% in Shanghai.\nIndexes were mixed across the rest of Asia, where Japan’s Nikkei 225 fell 1.1% for one of the world’s bigger losses.\n___\nAP Business Writer Elaine Kurtenbach contributed."
    },
    {
      "url": "https://apnews.com/article/federal-reserve-powell-trump-rates-99d90bab1ba2faa0fc5d4a6106125da7",
      "text": "Fed’s Powell sticks with patient approach to rate cuts, brushing off Trump’s demands\nFed’s Powell sticks with patient approach to rate cuts, brushing off Trump’s demands\nWASHINGTON (AP) — Federal Reserve Chair Jerome Powell gave little indication on Wednesday of bowing anytime soon to President Donald Trump’s frequent demands that he cut interest rates, even as signs of dissent emerged on the Fed’s governing board.\nThe Fed left its key short-term interest rate unchanged for the fifth time this year, at about 4.3%, as was expected. But Powell also signaled that it could take months for the Fed to determine whether Trump’s sweeping tariffs will push up inflation temporarily or lead to a more persistent bout of higher prices. His comments suggest that a rate cut in September, which had been expected by some economists and investors, is now less likely.\n“We’ve learned that the process will probably be slower than expected,” Powell said. “We think we have a long way to go to really understand exactly how” the tariffs will affect inflation and the economy.\nThere were some signs of splits in the Fed’s ranks: Governors Christopher Waller and Michelle Bowman voted to reduce borrowing costs, while nine officials, including Powell, favored standing pat. It is the first time in more than three decades that two of the seven Washington-based governors have dissented. One official, Governor Adriana Kugler, was absent and didn’t vote.\nThe choice to hold off on a rate cut will almost certainly result in further conflict between the Fed and White House, as Trump has repeatedly demanded that the central bank reduce borrowing costs as part of his effort to assert control over one of the few remaining independent federal agencies.\nPowell has in the past signaled during a news conference that a rate move might be on the table for an upcoming meeting, but he gave no such hints this time. The odds of a rate cut in September, according to futures pricing, fell from nearly 60% before the meeting to just 45% after the press conference, the equivalent of a coin flip, according to CME Fedwatch.\n“We have made no decisions about September,” Powell said. The chair acknowledged that if the Fed cut its rate too soon, inflation could move higher, and if it cut too late, then the job market could suffer.\nMajor U.S. stock indexes, which had been trading slightly higher Wednesday, went negative after Powell’s comments.\n“The markets seem to think that Powell pushed back on a September rate cut,” said Lauren Goodwin, chief market strategist at New York Life Investments.\nPowell also underscored that the vast majority of the committee agreed with a basic framework: Inflation is still above the Fed’s target of 2%, while the job market is still mostly healthy, so the Fed should keep rates elevated. On Thursday, the government will release the latest reading of the Fed’s preferred inflation gauge, and it is expected to show that core prices, excluding energy and food, rose 2.7% from a year earlier.\nGus Faucher, chief economist at PNC Financial, says he expects the tariffs will only temporarily raise inflation, but that it will take most of the rest of this year for that to become apparent. He doesn’t expect the Fed to cut until December.\nTrump argues that because the U.S. economy is doing well, rates should be lowered. But unlike a blue-chip company that usually pays lower rates than a troubled startup, it’s different for an entire economy. The Fed adjusts rates to either slow or speed growth, and would be more likely to keep them high if the economy is strong to prevent an inflationary outbreak.\nEarlier Wednesday, the government said the economy expanded at a healthy 3% annual rate in the second quarter, though that figure followed a negative reading for the first three months of the year, when the economy shrank 0.5% at an annual rate. Most economists averaged the two figures to get a growth rate of about 1.2% for the first half of this year.\nThe dissents from Waller and Bowman likely reflect jockeying to replace Powell, whose term ends in May 2026. Waller in particular has been mentioned as a potential future Fed chair.\nMichael Feroli, an economist at JPMorgan Chase, said in a note to clients this week if the pair were to dissent, “it would say more about auditioning for the Fed chair appointment than about economic conditions.”\nBowman, meanwhile, last dissented in September 2024, when the Fed cut its key rate by a half-point. She said she preferred a quarter point cut instead, and cited the fact that inflation was still above 2.5% as a reason for caution.\nWaller said earlier this month that he favored cutting rates, but for very different reasons than Trump has cited: Waller thinks that growth and hiring are slowing, and that the Fed should reduce borrowing costs to forestall a rise in unemployment.\nThere are other camps on the Fed’s 19-member rate-setting committee — only 12 of the 19 actually vote on rate decisions. In June, seven members signaled that they supported leaving rates unchanged through the end of this year, while two suggested they preferred a single rate cut. The other half supported more reductions, with eight officials backing two cuts, and two — widely thought to be Waller and Bowman — supporting three reductions.\nThe dissents could be a preview of what might happen after Powell steps down, if Trump appoints a replacement who pushes for the much lower interest rates the White House desires. Other Fed officials could push back if a future chair sought to cut rates by more than economic conditions would otherwise support.\nOverall, the committee’s quarterly forecasts in June suggested the Fed would cut twice this year. There are only three more Fed policy meetings — in September, October, and December.\nWhen the Fed cuts its rate, it often — but not always — results in lower borrowing costs for mortgages, auto loans and credit cards.\nSome economists agree with Waller’s concerns about the job market. Excluding government hiring, the economy added just 74,000 jobs in June, with most of those gains occurring in health care.\n“We are in a much slower job hiring backdrop than most people appreciate,” said Tom Porcelli, chief U.S. economist at PGIM Fixed Income."
    },
    {
      "url": "https://apnews.com/article/trump-tariffs-deadline-delay-d8ffef07d944dc1d460b472e4ffd2f57",
      "text": "Trump’s latest tariff deadline is approaching. Here are the trade deals the US has announced so far\nNEW YORK (AP) — The clock is ticking closer to U.S. President Donald Trump’s latest tariff deadline of Aug 1. And while several more deals — or at least frameworks for deals — have been reached since his last tariff deadline of July 9 came and went, trade talks with many countries are still in flux.\nTrump unveiled sweeping import taxes on goods coming into the U.S. from nearly every country back in April. That included heightened so-called reciprocal rates for certain countries, the bulk of which have since been postponed twice.\nThe first 90-day pause arrived in an apparent effort to quell global market panic and facilitate country-by-country negotiations, with the Trump administration at one point setting a lofty goal of reaching 90 trade deals in 90 days.\nBut three months later, only two deals emerged: with the U.K. and Vietnam. A separate “framework” for a deal was hashed out with China. And by early July, Trump began sending warning letters that higher tariffs would be imposed against dozens of countries on Aug. 1.\nSince then, the U.S. has announced more trade frameworks. But, many key details remain sparse — or not immediately captured in writing.\nHere’s what we know about the agreements so far, in the order of those most recently announced.\nPakistan\nThe U.S. and Pakistan reached a trade agreement expected to allow Washington to help develop Pakistan’s largely untapped oil reserves and lower tariffs for the South Asian country, officials from both nations said Thursday.\nOfficials did not specify where the exploration would take place — and in a post on his Truth Social platform, Trump said “we are in the process of choosing the oil company that will lead this partnership.”\nPakistan’s Prime Minister Shehbaz Sharif welcomed the “long-awaited” deal and thanked Trump for playing a key role in finalizing it. Pakistan’s Finance Ministry said the agreement aims to boost bilateral trade, expand market access, attract investment and foster cooperation in areas of mutual interest.\nThe deal includes a reduction in reciprocal tariffs, particularly on Pakistani exports to the U.S., the statement from the ministry said. A new figure wasn’t immediately provided.\nSouth Korea\nTrump on Wednesday said the U.S. reached an agreement with Seoul on July 30 that would impose a 15% tariff for goods from South Korea.\nThe two countries have also agreed for South Korea to buy $100 billion in energy resources from the U.S. and for South Korea to give to the U.S. $350 billion for “investments owned and controlled by the United States, and selected by myself, as president,” Trump said.\nSouth Korean president Lee Jae Myung later added that the $350 billion investment fund is meant to solidify a foundation for bilateral cooperation on strategic industries — noting that the fund will support South Korean companies’ entrance to the U.S. market in areas such as shipbuilding, semiconductors, secondary batteries, biotechnology and energy.\nEuropean Union\nThe U.S. and the EU announced a trade framework that imposes 15% tariffs on most European goods — warding off Trump’s most recent threat of 30% if no deal had been reached by Aug. 1.\nBut some key details require more work. The headline of the agreement, unveiled July 27, is that the 15% tariff rate will apply to 70% of European goods brought into the U.S. — with the EU later confirming that that rate applies to pharmaceuticals, semiconductors, and car and car parts. But the remaining 30% of those imports is still open for negotiations.\nEuropean Commission President Ursula von der Leyen said that both sides had agreed to zero tariffs for a range of “strategic” goods. Meanwhile, Trump pointed to heightened investments from European companies in the U.S. — including what Trump said was $750 billion (638 billion euros) worth of natural gas, oil and nuclear fuel over three years, as well as an additional $600 billion (511 billion euros) under a political commitment that isn’t legally binding, officials said.\nJapan\nOn July 22, Trump announced a trade framework to impose 15% tariffs on Japan — down from his previously-threatened rate of 25%. The U.S. president also said Japan would invest $550 billion into the U.S. and would “open” its economy to American autos and rice.\nThe newly-agreed on 15% tariff rate also applies to Japanese cars — marking a welcome relief for automakers like Toyota Motor Corp. and Honda — which, like other automakers, have faced a 25% levy on key parts and finished vehicles going into the U.S. since earlier this year. But car companies in other countries, including U.S. competitors, worry that this could put them at a disadvantage.\nPhilippines\nShortly after a July 22 meeting with Philippine President Ferdinand Marcos, Jr., Trump announced that he would lower his upcoming tariffs on imports from the country to 19% — down just 1% from his previous threat of 20%.\nIn return, Trump said on Truth Social, the U.S. would not pay tariffs on American goods it shipped to the Philippines. But additional details remained unclear. Marcos said his country was considering options such as having an open market without tariffs for U.S. automobiles, but emphasized details were still left to be worked out.\nIndonesia\nOn July 15, Trump again took to social media to announce that he’s agreed to lower his planned tariffs on Indonesian goods to 19% — down from a previously-threatened levy of 32% — while American goods sent to the southeast Asian country will face no tariffs. A fact sheet from the White House later confirmed that “over 99% of U.S. products” exported to Indonesia would be sent duty-free.\nIndonesian President Prabowo Subianto said he will continue to negotiate with Trump, in hopes of further lowering the coming U.S. tariffs.\nVietnam\nOn July 2, Trump announced a trade deal with Vietnam that he said would allow U.S. goods to enter the country duty-free. Vietnamese exports to the U.S., by contrast, would face a 20% levy.\nThat’s less than half the 46% “reciprocal” rate Trump proposed for Vietnamese goods back in April. But in addition to the new 20% tariff rate, Trump said the U.S. would impose a 40% tax on “transshipping’’ — targeting goods from another country that stop in Vietnam on their way to the United States. Washington complains that Chinese goods have been dodging higher U.S. tariffs by transiting through Vietnam.\nUnited Kingdom\nOn May 8, Trump agreed to cut tariffs on British autos, steel and aluminum, among other trade pledges — while the U.K. promised to reduce levies on U.S. products like olive oil, wine and sports equipment. The deal was announced in grandiose terms by both countries, but some key details remained unknown for weeks.\nWhen the deal was announced, for example, the British government notably said that the U.S. agreed to exempt the U.K. from its then-universal 25% duties on foreign steel and aluminum — which would have effectively allowed both metals from the country to come into the U.S. duty-free.\nBut the timing for when those cuts would actually take effect stayed up in the air for almost a month. It wasn’t until early June, when Trump hiked his steel and aluminum tariffs to a punishing 50% worldwide, that the U.S. acknowledged it was time to implement the agreement. And even then, U.S. tariffs on British steel and aluminum did not go to zero. The U.K. was the only country spared from Trump’s new 50% levies, but still faces 25% import taxes on the metals.\nChina\nAt its peak, Trump’s new tariffs on Chinese goods totaled 145% — and China’s countertariffs on American products reached 125%. But on May 12, the countries agreed to their own 90-day truce to roll back those levies to 30% and 10%, respectively. And in June, details began trickling in about a tentative trade agreement.\nU.S. Treasury Secretary Scott Bessent said that China had agreed to make it easier for American firms to acquire Chinese magnets and rare earth minerals critical for manufacturing and microchip production. Meanwhile, the Chinese Commerce Ministry said that the U.S. would “lift a series of restrictive measures it had imposed on China.”\nOther key details of the deal remain murky — including the timing of implementation for these terms. On July 29, China’s top trade official said the two sides had agreed to work on extending an Aug. 12 deadline for new tariffs on each other, following a two-day trade meeting in Stockholm. The U.S. side said extension plans were discussed, but not decided.\n_________\nAssociated Press reporters from all over the world contributed to this report."
    },
    {
      "url": "https://apnews.com/article/inflation-trump-fed-powell-prices-8842d6ebca9d1870983e678e578d2091",
      "text": "The tariff-driven inflation that economists feared begins to emerge\nInflation rose last month to its highest level since February as President Donald Trump’s sweeping tariffs push up the cost of a range of goods, including furniture, clothing, and large appliances.\n▶ Follow live updates on President Donald Trump and his administration\nWASHINGTON (AP) — Inflation rose last month to its highest level since February as President Donald Trump’s sweeping tariffs push up the cost of everything from groceries and clothes to furniture and appliances.\nConsumer prices rose 2.7% in June from a year earlier, the Labor Department said Tuesday, up from an annual increase of 2.4% in May. On a monthly basis, prices climbed 0.3% from May to June, after rising just 0.1% the previous month.\nWorsening inflation poses a political challenge for Trump, who as a candidate promised to immediately lower costs, but instead has engaged in a whipsawed frenzy of tariffs that have jolted businesses and consumers. Trump insists that the U.S. effectively has no inflation as he has attempted to pressure Federal Reserve Chair Jerome Powell into cutting short-term interest rates.\nYet the new inflation numbers make it more likely that the central bank will leave rates where they are. Powell has said that he wants to gauge the economic impact of Trump’s tariffs before reducing borrowing costs.\nExcluding volatile food and energy, core inflation increased 2.9% in June from a year earlier, up from 2.8% in May. On a monthly basis, it picked up 0.2% from May to June. Economists closely watch core prices because they typically provide a better sense of where inflation is headed.\nThe uptick in inflation was driven by a range of higher prices. The cost of gasoline rose 1% just from May to June, while grocery prices increased 0.3%. Appliance prices jumped for the third straight month. Toys, clothes, audio equipment, shoes, and sporting goods all got more expensive, and are all heavily imported.\n“You are starting to see scattered bits of the tariff inflation regime filter in,” said Eric Winograd, chief economist at asset management firm AllianceBernstein, who added that the cost of long-lasting goods rose last month, compared with a year ago, for the first time in about three years.\nWinograd also noted that housing costs, a big inflation driver since the pandemic, have continued to cool, actually holding down broader inflation. The cost of rent rose 3.8% in June compared with a year ago, the smallest yearly increase since late 2021.\n“Were it not for the tariff uncertainty, the Fed would already be cutting rates,” Winograd said. “The question is whether there is more to come, and the Fed clearly thinks there is,” along with most economists.\nSome items got cheaper last month, including new and used cars, hotel rooms, and airfares. Travel prices have generally declined in recent months as fewer international tourists visit the U.S.\nA broader political battle over Trump’s tariffs is emerging, a fight that will ultimately be determined by how the U.S. public feels about their cost of living and whether the president is making good on his 2024 promise to help the middle class.\nThe White House pushed back on claims that the report showed a negative impact from tariffs, since the cost of new cars fell despite the 25% tariffs on autos and 50% tariffs on steel and aluminum. The administration also noted that despite the June bump in apparel prices, clothing prices are still cheaper than three months ago.\n“Consumer Prices LOW,” Trump posted on Truth Social. “Bring down the Fed Rate, NOW!!!”\nFor Democratic lawmakers, the inflation report confirmed their warnings over the past several months that Trump’s tariffs could reignite inflation. They said Tuesday that it will only become more painful given the size of the tariff rates in the letters that Trump posted over the past week.\n“For those saying we have not seen the impact of Trump’s tariff wars, look at today’s data. Americans continue to struggle with the costs of groceries and rent — and now prices of food and appliances are rising,” said Sen. Elizabeth Warren, D-Mass.\nMany businesses built up a stockpile of goods this spring and were able to delay price hikes, while others likely waited to see if the duties would become permanent.\nMore businesses now appear to be throwing in the towel and passing on costs to consumers, including Walmart, the world’s largest retailer, which has said it raised prices in June. Automaker Mitsubishi said last month that it was lifting prices by an average of 2.1% in response to the duties, and Nike has said it would implement “surgical” price hikes.\nPowell said last month that companies up and down the supply chain would seek to avoid paying tariffs, but that ultimately some combination of businesses and consumers would bear the cost.\n“There’s the manufacturer, the exporter, the importer, the retailer, and the consumer, and each one of those is going to be trying not to be the one to pay for the tariff,” the Fed chair said. “But together, they will all pay for it together—or maybe one party will pay it all. But that process is very hard to predict, and we haven’t been through a situation like this.”\nTrump has imposed sweeping duties of 10% on all imports plus 30% on goods from China. Last week the president threatened to hit the European Union with a new 30% tariff starting Aug. 1.\nHe has also threatened to slap 50% duties on Brazil, which would push up the cost of orange juice and coffee. Orange prices leaped 3.5% just from May to June, and are 3.4% higher than a year ago, the government said Tuesday.\nOverall, grocery prices rose 0.3% last month and are up 2.4% from a year earlier. While that is a much smaller increase than after the pandemic, when inflation surged, it is slightly bigger than the pre-pandemic pace. The Trump administration has also placed a 17% duty on Mexican tomatoes.\nFamilies have cut spending on food as prices rise. Cassidy Grom, 29, her husband, and his mother are eating out less and try to stretch grocery store rotisserie chickens as far as possible, using them in salads and the bones for soup.\n“It feels like a miracle if I’m able to leave the grocery store without spending $100,” the Edison, New Jersey resident said. “We’re trying to save for a house, we’re trying to save for a family, so prices are really on our mind.”\nAccelerated inflation could provide a respite for Powell, who has come under withering fire from the White House over interest rates.\nThe Fed chair has said that the duties could both push up prices and slow the economy, a tricky combination for the central bank since higher costs would typically lead the Fed to hike rates while a weaker economy often spurs it to reduce them."
    },
    {
      "url": "https://apnews.com/article/jobs-unemployment-economy-trump-federal-reserve-68a15f89d68793a6cf88a522ff33246c",
      "text": "US employers slash hiring as Trump advances a punishing trade agenda\nUS employers slash hiring as Trump advances a punishing trade agenda\nWASHINGTON (AP) — U.S. hiring is slowing sharply as President Donald Trump’s erratic and radical trade policies paralyze businesses and raise doubts about the outlook for the world’s largest economy.\nU.S. employers added just 73,000 jobs last month, the Labor Department reported Friday, well short of the 115,000 expected.\nWorse, revisions shaved a stunning 258,000 jobs off May and June payrolls. And the unemployment rate ticked higher to 4.2% as Americans dropped out of the labor force and the ranks of the unemployed rose by 221,000.\n“A notable deterioration in U.S. labor market conditions appears to be underway,’' said Scott Anderson, chief U.S. economist at BMO Capital Markets. ”We have been forecasting this since the tariff and trade war erupted this spring and more restrictive immigration restrictions were put in place. Overall, this report highlights the risk of a harder landing for the labor market.’'\nEconomists have been warning that the rift with every U.S. trading partner will begin to appear this summer and the Friday jobs report appeared to sound the bell.\n“We’re finally in the eye of the hurricane,” said Daniel Zhao, chief economist at Glassdoor. “After months of warning signs, the July jobs report confirms that the slowdown isn’t just approaching—it’s here.”\nU.S. markets recoiled at the jobs report and the Dow tumbled more than 600 points Friday.\nAP Washington correspondent Sagar Meghani reports on a sharp slowdown in hiring.\nBut President Donald Trump responded to the weak report by calling for the firing of Erika McEntarfer, the director of the Labor Department’s Bureau of Labor Statistics, which compiles the jobs numbers. “I have directed my Team to fire this Biden Political Appointee, IMMEDIATELY,” Trump said on Truth Social. “She will be replaced with someone much more competent and qualified.”\nTrump questioned the big revisions, but they are a standard part of the monthly jobs report. The Labor Department revises its numbers as more data comes in. Particularly since COVID-19, businesses have taken longer to respond to the government’s survey on hiring. As more data has come in later than in the past, the potential for large revisions has increased.\nRevelations in the new data raise questions about the health of the job market and the economy as Trump pushes forward an unorthodox overhaul of American trade policy.\nTrump has discarded decades of U.S. efforts to lower trade barriers globally, instead, imposing hefty import taxes — tariffs — on products from almost every country on earth. Trump believes the levies will bring manufacturing back to America and raise money to pay for the massive tax cuts he signed into law July 4.\nMainstream economists warned that the cost of the tariffs will be passed along to Americans, both businesses and households.\nThat has begun.\nWalmart, Procter & Gamble, Ford, Best Buy, Adidas, Nike, Mattel, Shein, Temu, Stanley Black & Decker, have all hiked prices due to U.S. tariffs. Economists at Goldman Sachs estimate that overseas exporters have absorbed just one-fifth of the rising costs from tariffs, while Americans and U.S. businesses have picked up the lion’s share of the tab.\nTrump has sowed uncertainty in the erratic way he’s rolled the tariffs out — announcing, then suspending them, then coming up with new ones. Overnight, Trump signed an executive order that set new tariffs on a wide swath of U.S. trading partners to that go into effect on Aug. 7, and that comes after a flurry of unexpected tariff-related actions this week.\n“There was a clear, significant, immediate, tariff effect on the labor market and employment growth essentially stalled, as we were dealing with so much uncertainty about the outlook for the economy and for tariffs,” said Blerina Uruci, chief U.S. economist for the brokerage T. Rowe Price.\nStill, Uruci said the data suggests we could be past the worst, as hiring actually did pick up a bit in July from May and June’s depressed levels.\n“I’m not overly pessimistic on the U.S. economy based on this morning’s data,” she said, though she does think that hiring will remain muted in the coming months as the number of available workers remains limited due to reduced immigration and an aging population.\n“Because of immigration policy, labor supply growth has nearly ground to a halt,” said Guy Berger, senior fellow at the Burning Glass Institute, which studies employment trends. “So we’re going to have very weak employment growth. And we look like southern Europe or Japan.”\nStill, with fewer workers available, the economy doesn’t need to generate many jobs to soak up the unemployed. That could keep the unemployment rate from climbing much, Berger added.\nTrump has sold the tariffs hikes as a way to boost American manufacturing, but factories cut 11,000 jobs last month after shedding 15,000 in June and 11,000 in May. The federal government, where employment has been targeted by the Trump administration, lost 12,000 jobs. Jobs in administration and support fell by nearly 20,000.\nHealthcare companies added 55,400 jobs last month – accounting for 76% of the jobs added in July and offering another sign that recent job gains have been narrowly concentrated.\nThe department originally reported that state and local governments had added 64,000 education jobs in June. The revisions Friday slashed those jobs to less than 10,000.\nThose revisions also revealed that the U.S. economy has generated an average of just 85,000 jobs a month this year, barely half last year’s average of 168,000 and well below an average 400,000 from 2021-2023 as the economy rebounded from COVID-19 lockups.\nThe weak jobs data makes it more likely that Trump will get one thing that he most fervently desires: A cut in short-term interest rates by the Federal Reserve, which often -- though not always -- can lead to lower rates for mortgages, car loans, and credit cards.\nFed Chair Jerome Powell and other Fed officials have repeatedly pointed to a healthy job market as a reason that they could take time to evaluate how Trump’s tariffs were affecting inflation and the broader economy. Now that assessment has been undercut and will put more pressure on the Fed to reduce borrowing costs.\nWall Street investors sharply raised their expectations for a rate cut at the Fed’s next meeting in September after the report was released.\nOn Wednesday, the Fed left its key rate unchanged for fifth consecutive meeting and Powell signaled little urgency to reduce rates anytime soon. He said the “labor market is solid” with “historically low unemployment.” But he also acknowledged there is a “downside risk” to employment stemming from the slow pace of hiring that was evident even before Friday’s weaker numbers.\nThe current situation is a sharp reversal from the hiring boom of just three years ago when desperate employers were handing out signing bonuses and introducing perks such as Fridays off, fertility benefits and even pet insurance to recruit and keep workers.\nThe rate of people quitting their jobs — a sign they’re confident they can land something better — has fallen from the record heights of 2021 and 2022 and is now weaker than before the pandemic.\nDrees Homes, a homebuilder based outside Cincinnati in Fort Mitchell, Kentucky, has hired about 50 people over the past year, bringing its workforce to around 950. Pamela Rader, Drees’ vice president for human resources, it’s “gotten a little bit easier’’ to find workers.\nA couple of years ago, Rader said jobseekers were focused on getting more pay. Now, she said, they emphasize stable employment, a better work-life balance, and prospects for advancement."
    }
  ],
  "argos_summary": "President Trump signed an executive order to pause potential tariff increases on Chinese imports, allowing for further trade negotiations and avoiding immediate retaliatory measures from Beijing. This extension, however, prolongs uncertainty for businesses amid ongoing inflation concerns, as U.S. inflation rates are expected to rise slightly. The Federal Reserve is under pressure to cut interest rates, but officials are cautious about the impact of tariffs on inflation and the job market, with recent employment data showing a significant slowdown in hiring.",
  "argos_id": "17P3WSCD2"
}