{
  "url": "https://finance.yahoo.com/news/hoxton-planning-boosts-meta-holdings-004848288.html",
  "authorsByline": "Rameen Kasana",
  "articleId": "1ae95e9781ff40baaebec4df50c62f1d",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/insidermonkey.com/3bb8ee25366b0d99cae297f8032c1254",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T00:48:48+00:00",
  "addDate": "2025-08-12T00:57:07.791430+00:00",
  "refreshDate": "2025-08-12T00:57:07.791431+00:00",
  "score": 1.0,
  "title": "Hoxton Planning Boosts Meta Holdings to Nearly $1.9M",
  "description": "Meta Platforms, Inc. (NASDAQ:META) is among the best holding company stocks to invest in. Hoxton Planning & Management LLC, a leading investment advisor, has increased its stake in Meta Platforms, Inc. (NASDAQ:META) in the first quarter, as per the company’s recent disclosure with the Securities and Exchange Commission (SEC). With an ownership of about 0.7% […]",
  "content": "Meta Platforms, Inc. (NASDAQ:META) is among the best holding company stocks to invest in. Hoxton Planning & Management LLC, a leading investment advisor, has increased its stake in Meta Platforms, Inc. (NASDAQ:META) in the first quarter, as per the company’s recent disclosure with the Securities and Exchange Commission (SEC). With an ownership of about 0.7% of the company’s stock, the fund has acquired 3,281 shares worth $1,891,000.\n\nWe have seen how Meta Platforms, Inc. (NASDAQ:META) is intensifying its AI investments that have already started to deliver strong returns. Greater platform usage, together with elevated ad pricing, makes it a better alternative to a business like Google. As management recently revealed, the cost discipline and capex investments have started to pay off.\n\nWith such optimism in the market, Loop Capital has reiterated its “Buy” rating on Meta Platforms, Inc. (NASDAQ:META), while increasing its price target to $980.00 from $888.00, signaling an upside of nearly 28.36%. This surge stems from what the research firm cites as “meaningful revenue growth acceleration and strong outlook.”\n\nMeta Platforms, Inc. (NASDAQ:META) is a California-based company that develops products enabling people to connect and share via mobile devices, personal computers, reality headsets, and wearables. Incorporated in 2004, the company operates through two segments: Family of Apps (FoA) and Reality Labs (RL).\n\nWhile we acknowledge the potential of META as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock.\n\nREAD NEXT: The Best and Worst Dow Stocks for the Next 12 Months and 10 Unstoppable Stocks That Could Double Your Money.",
  "medium": "Article",
  "links": [
    "https://finance.yahoo.com/quote/META",
    "https://www.insidermonkey.com/blog/the-best-and-worst-dow-stocks-for-the-next-12-months-1520028/?singlepage=1",
    "https://www.insidermonkey.com/blog/9-best-holding-company-stocks-to-invest-in-1584087/",
    "https://www.insidermonkey.com/blog/10-unstoppable-stocks-that-could-double-your-money-1500171/?singlepage=1",
    "https://www.insidermonkey.com/blog/three-megatrends-one-overlooked-stock-massive-upside-1548959/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "certain AI stocks",
      "weight": 0.10143345
    },
    {
      "name": "Meta Platforms",
      "weight": 0.08989466
    },
    {
      "name": "META",
      "weight": 0.08052593
    },
    {
      "name": "capex investments",
      "weight": 0.07766305
    },
    {
      "name": "NASDAQ",
      "weight": 0.07245321
    },
    {
      "name": "Meta Holdings",
      "weight": 0.07108262
    },
    {
      "name": "greater upside potential",
      "weight": 0.07068269
    },
    {
      "name": "the best holding company stocks",
      "weight": 0.07004041
    },
    {
      "name": "meaningful revenue growth acceleration",
      "weight": 0.06991803
    },
    {
      "name": "Meta",
      "weight": 0.069286585
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Finance"
    },
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.98828125
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.98388671875
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.98291015625
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.54541015625
    }
  ],
  "sentiment": {
    "positive": 0.86999923,
    "negative": 0.015826035,
    "neutral": 0.11417479
  },
  "summary": "Investment advisor, Hoxton Planning & Management LLC, has increased its stake in Meta Platforms, Inc. (NASDAQ:META) to nearly $1.9M. The fund has acquired 3,281 shares worth $1,891,000. The company is focusing on its AI investments, which have already yielded strong returns. With this success, Loop Capital has reiterated its Buy-and-chef rating and increased its price target to $980.00 from $888.00, indicating an upside of nearly 28.36%. The company's revenue growth acceleration and outlook are cited as reasons for its strong growth.",
  "shortSummary": "Hoxton Planning & Management LLC increased its stake in Meta Platforms, Inc. to nearly $1.9m, citing strong revenue growth and AI investments.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "82cd8c16491b4f13b000947f66b321e5",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://finance.yahoo.com/quote/META",
      "text": "Meta Platforms, Inc. (META)\n- Previous Close\n769.30 - Open\n770.08 - Bid 731.02 x 100\n- Ask 809.43 x 100\n- Day's Range\n764.70 - 773.46 - 52 Week Range\n479.80 - 784.75 - Volume\n7,495,847 - Avg. Volume\n12,488,306 - Market Cap (intraday)\n1.924T - Beta (5Y Monthly) 1.27\n- PE Ratio (TTM)\n27.81 - EPS (TTM)\n27.54 - Earnings Date Oct 29, 2025\n- Forward Dividend & Yield 2.10 (0.27%)\n- Ex-Dividend Date Jun 16, 2025\n- 1y Target Est\n861.06\nMeta Platforms, Inc. engages in the development of products that enable people to connect and share with friends and family through mobile devices, personal computers, virtual reality and mixed reality headsets, augmented reality, and wearables worldwide. It operates through two segments, Family of Apps (FoA) and Reality Labs (RL). The FoA segment offers Facebook, which enables people to build community through feed, reels, stories, groups, marketplace, and other; Instagram that brings people closer through instagram feed, stories, reels, live, and messaging; Messenger, a messaging application for people to connect with friends, family, communities, and businesses across platforms and devices through text, audio, and video calls; Threads, an application for text-based updates and public conversations; and WhatsApp, a messaging application that is used by people and businesses to communicate and transact in a private way. The RL segment provides virtual, augmented, and mixed reality related products comprising consumer hardware, software, and content that help people feel connected, anytime, and anywhere. The company was formerly known as Facebook, Inc. and changed its name to Meta Platforms, Inc. in October 2021. The company was incorporated in 2004 and is headquartered in Menlo Park, California.\ninvestor.atmeta.com75,945\nFull Time Employees\nDecember 31\nFiscal Year Ends\nSector\nInternet Content & Information\nIndustry\nRecent News: META\nView MorePerformance Overview: META\nTrailing total returns as of 8/11/2025, which may include dividends or other distributions. Benchmark is S&P 500 (^GSPC) .\nYTD Return\n1-Year Return\n3-Year Return\n5-Year Return\nCompare To: META\nSelect to analyze similar companies using key performance metrics; select up to 4 stocks.\nStatistics: META\nView MoreValuation Measures\nMarket Cap\n1.93T\nEnterprise Value\n1.94T\nTrailing P/E\n27.91\nForward P/E\n29.07\nPEG Ratio (5yr expected)\n2.42\nPrice/Sales (ttm)\n11.16\nPrice/Book (mrq)\n9.91\nEnterprise Value/Revenue\n10.82\nEnterprise Value/EBITDA\n19.75\nFinancial Highlights\nProfitability and Income Statement\nProfit Margin\n39.99%\nReturn on Assets (ttm)\n18.47%\nReturn on Equity (ttm)\n40.65%\nRevenue (ttm)\n178.8B\nNet Income Avi to Common (ttm)\n71.51B\nDiluted EPS (ttm)\n27.54\nBalance Sheet and Cash Flow\nTotal Cash (mrq)\n47.07B\nTotal Debt/Equity (mrq)\n25.41%\nLevered Free Cash Flow (ttm)\n31.99B\nResearch Analysis: META\nView MoreResearch Reports: META\nView MoreThe bears had a chance to turn at least the short-term trend to the downside, but the bulls fought back and the uptrend off the April bottom appears to be on track.\nThe bears had a chance to turn at least the short-term trend to the downside, but the bulls fought back and the uptrend off the April bottom appears to be on track. We saw some minor sell signals on August 1, but they have been erased. The major indices rallied last week, albeit in choppy fashion, with up days on Monday, Wednesday, and Friday, and down days on Tuesday and Thursday. The sell signals and warnings that we had on August 1 included a bearish crossover of the five-day- and 13-day exponential moving averages (EMAs), a break of the 21-day EMA, and the cycling of the Vortex indicator into negative territory. In addition, price volatility picked up following the July 31 bearish reversal, and that can be a bad sign after a big advance. The 21-day rate of change (ROC) got very close to cycling into negative territory before popping last week. We still have two bearish divergences on the daily moving-average convergence/divergence (MACD) after cycling into extreme overbought territory -- a warning, but not a sell signal. For now, it looks like the major indices could be at the start of another leg higher, with the S&P 500 (SPX) just missing a closing all-time high on Friday and the Nasdaq and Nasdaq 100 reaching closing highs. The Commitment of Traders (COT) data for the SPX remains bullish, but is bearish for the Nasdaq 100. The data for the volatility index (VIX) is bullish, suggesting we could see another move higher and then an eventual pullback in the stock market. Over the weekend, Ethereum broke out of a base going back to March 2024 and is close to all-time highs, while Bitcoin broke out of a flag on Sunday and also is near to all-time highs. (Mark Arbeter, CMT)\nRaising target price to $850\nMeta Platforms operates the world's largest family of social networking websites, including the flagship Facebook site, Instagram, Facebook Messenger, WhatsApp, Reels, and Threads. The sites enable users to communicate with friends and family by posting to the site; to comment on others' posts; to share photographs, website links, and videos; to message; and to play games. The company also partners with application developers to add functionality to the sites, and allows users to pay for virtual goods and services through its Payments function. Meta derives about 55% of its revenue from outside the U.S. and Canada.\nRatingPrice TargetStocks are higher at Monday midday. The dot plot thickens (pun intended).\nStocks are higher at Monday midday. The dot plot thickens (pun intended). The odds of a Fed rate cut in September are now 85%, a big reversal from Friday morning before the release of the Jobs report. That data has economists rethinking the strength of the labor market. The yield on the 10-year Treasury note is 4.22%, a big drop from last week. Crude oil is at $66 per barrel.\nMeta Earnings: Ad Engine Firing on All Cylinders Even as AI Costs Mount; FVE up to $850 From $770\nMeta is the largest social media company in the world, boasting close to 4 billion monthly active users worldwide. The firm's \"Family of Apps,\" its core business, consists of Facebook, Instagram, Messenger, and WhatsApp. End users can leverage these applications for a variety of different purposes, from keeping in touch with friends to following celebrities and running digital businesses for free. Meta packages customer data, gleaned from its application ecosystem and sells ads to digital advertisers. While the firm has been investing heavily in its Reality Labs business, it remains a very small part of Meta’s overall sales.\nRatingPrice Target\nTop Analysts: META\nView MoreOverall Score\nDiscover which analysts rank highest for META overall weighted by direction, price target, and price movement.\nLearn MoreDirection Score\nDiscover which analysts rank highest on predicting the directional movement of META.\nLearn MorePrice Score\nDiscover which analysts rank highest on predicting the price target of META.\nLearn More"
    },
    {
      "url": "https://www.insidermonkey.com/blog/9-best-holding-company-stocks-to-invest-in-1584087/",
      "text": "In this article, we will take a look at some of the best holding company stocks to invest in.\nWhat if you could invest in multiple businesses, ranging across various sectors and industries, all through one stock? That’s the power of a holding company. The enterprise, operating as the parent company, owns and controls the interests of other businesses, known as the subsidiaries.\nIn these times of market uncertainty, it’s important to keep stocks that are safe yet valuable, and this is exactly why you should have a stock of a holding company on your radar. From minimal risk to property and tax advantages, the list in favor of investing in such companies goes on.\nOf particular importance is the research conducted by David Ficbauer and Maria Reznakova on “Holding company and its performance,” highlighting that the ownership of such stocks translates to improved cash flow management, less need for the capital invested and bank loans, and a better negotiating position with business partners. Given this, we will take a look at some of the best company holding stocks to invest in.\nOur Methodology\nIn selecting the 9 best holding company stocks to invest in, we have only considered those stocks that have positive one-year price targets, as per the analysts at Yahoo Finance. These stocks are then ranked according to the number of hedge fund holdings, extracted from Insider Monkey’s first-quarter database.\nWhy are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 373.4% since May 2014, beating its benchmark by 218 percentage points (see more details here).\n9. James River Group Holdings, Ltd. (NASDAQ:JRVR)\nNumber of hedge fund holdings: 14\nThe U.S. District Court, Southern District of New York, has dismissed a lawsuit against James River Group Holdings, Ltd. (NASDAQ:JRVR) filed by Fleming Intermediate Holdings LLC. The lawsuit, initiated on July 15, 2024, accused James River Group of securities fraud and violation of contract involving Fleming’s purchase of JRG Reinsurance Company Ltd.\nAs per the company’s statement, Valdean Langenburg is now the Group Chief Information Officer at James River Group Holdings, Ltd. (NASDAQ:JRVR), with Justin Zaharris promoted to Group Chief Claims Officer. Langenburg takes over the role following the retirement of Thomas Peach on July 4, marking the end of over four decades in the information technology sector, including six impressive years as the CIO of James River Group Holdings, Ltd. (NASDAQ:JRVR).\nOn the other hand, Zaharris previously served as the Vice President, managing claims for the company’s Excess & Surplus Lines segment. With over 20 years of legal, technical, and operational claims expertise in property and casualty, we have good reason to believe that James River Group Holdings, Ltd. (NASDAQ:JRVR) is set to lead the way, powered by its workforce.\nJames River Group Holdings, Ltd. (NASDAQ:JRVR), headquartered in Bermuda, is a specialty insurance service provider. With two main segments: Excess and Surplus Lines, and Specialty Admitted Insurance, the company is committed to producing strong returns on tangible equity.\n8. Yum China Holdings, Inc. (NYSE:YUMC)\nNumber of hedge fund holdings: 31\nAs per the company’s announcement on Tuesday, Mr. Zhe (David) Wei has been appointed to the Board of Directors, increasing the Board to 13 directors, out of which 11 are independent. This appointment, effective August 6, 2025, comes as the company plans to expand through 1,600 to 1,800 net new store openings in 2025.\nAs the Chairman at Yum China Holdings, Inc. (NYSE:YUMC), Fred Hu, states,\n“David brings deep insights in the global and China consumer sectors and significant leadership experience in digital and e-commerce.”\nIn its recent earnings, management pointed to a brighter future, one that is expected to deliver $3 billion to shareholders between 2025 and 2026, in addition to the $1.5 billion it returned to shareholders throughout 2024. Additionally, Yum China Holdings, Inc. (NYSE:YUMC) is dedicated to strategically increasing the mix at a guided range in the years ahead. It’s no secret that the giant has placed “accelerating growths” on top of its menu.\nYum China Holdings, Inc. (NYSE:YUMC) is a Chinese food powerhouse that owns, manages, and franchises restaurants. Incorporated in 1987, the company operates through two segments: KFC and Pizza Hut."
    },
    {
      "url": "https://www.insidermonkey.com/blog/10-unstoppable-stocks-that-could-double-your-money-1500171/?singlepage=1",
      "text": "Generating significant returns and multiplying their money in the stock market remains a primary goal for most investors. However, high excess returns (alpha) are challenging to generate, let alone doubling money. For example, if someone took a bet on the overall economy and bought the broader market index, it would have taken around five to seven years for them to double the investments, as these indices usually take that much time, depending on the economic cycle and market trends. Such gains are never easy to replicate, but certain companies and sectors are better positioned for high growth due to strong fundamentals, innovation, or macroeconomic trends. Investors who can identify these stocks through research and understanding market cycles can generate extra returns. Moreover, specific stocks’ valuation and growth trajectory over the next few years must be precisely analysed to make good returns.\nOver the last five years, the stock market has been highly dynamic, reflecting broader economic shifts, interest rate cycles, and technological advancements. While 2023 and 2024 were volatile because of concerns over inflation, the Federal Reserve policy, and geopolitical tensions, 2025 has been equally volatile, with the S&P 500 down 3% and the Nasdaq down around 8% (as of March 27). This volatility makes higher returns riskier.\nNevertheless, market analysts are still optimistic about gains in 2025. In an interview with CNBC on April 1, Chris Hyzy, Merrill and BofA Private Bank CIO, said he would use recent market weakness to increase positions and favour broad market exposure through equal-weighted S&P positions. He identifies financials and consumer discretionary stocks as particularly oversold and attractive. He also believes that certain areas, like software and cybersecurity, could lead the technology sector in share market gains in the coming months. Chris also suggested that while uncertainty may persist into the summer, markets will likely begin pricing in anticipated improvements in economic conditions and corporate earnings later in the year. According to his assessment, the job market remains stable and strong, which would mean a sharp economic downturn is unlikely. He expects the market to experience a “sawtooth bottom” rather than a sharp V-shaped recovery, suggesting that long-term opportunities remain despite persisting volatility.\nFundstrat’s head of research, Tom Lee, stated to CNBC on March 31 that market conditions indicate oversold status and potential bottom formation regardless of ongoing downward trends. Investors maintain their focus on government policies and tariff situations, and their economic impact. According to his estimates, the April 2 tariff updates should also clarify the future of policies and could potentially reduce selling pressure in the market. He also believes that as and when the Federal Reserve communicates further on interest rates, inflation, and other policies, it should provide more direction to investors.\nIn essence, opportunities could emerge in the near term, and investors should look for better entry points to create positions to generate more substantial returns. But stock selection also remains key. According to Goldman Sachs Asset Management’s March 24 report, Embracing a Broader Equity Landscape, while the technology sector remains a key driver of growth in 2025, the dominance of a few large U.S. tech companies appears to be waning. The authors highlighted that capital is beginning to diversify beyond the Magnificent 7, and many of today’s market leaders may not sustain their positions at the top. This evolving market dynamic presents new opportunities for active investors, particularly in smaller-cap equities, high-quality businesses outside the U.S., and differentiated long-term investment themes. As leadership broadens, they believe this shift could mark the beginning of a more favorable environment for stock selection across the global equity landscape.\nIn recent months, many analysts and fund managers have favored diversifying towards small- and mid-cap stocks; thus, this space should remain on investors’ radars. At the same time, investors should be aware of the risks involved in high-performing equities.\nWith those insights, let’s explore the 10 unstoppable stocks that could double your money.\nOur Methodology\nTo identify the unstoppable stocks that could double investors’ money, we used online screeners to compile a list of U.S.-listed companies with a market capitalization exceeding $2 billion and with a greater than 20% return in the last one year. We then applied an additional criterion, considering only those stocks with an expected upside of around 100% or more. From the refined list, we took the top 10 stocks with the highest upside potential and ranked them in ascending order of respective upsides. Additionally, we provided insights into hedge fund sentiment surrounding these stocks, using data from Insider Monkey’s Q4 2024 database.\nNote: All pricing data is as of market close on March 27, 2025. 1-year returns are calculated from March 27, 2024.\nWhy are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 373.4% since May 2014, beating its benchmark by 218 percentage points (see more details here).\n10 Unstoppable Stocks That Could Double Your Money\n10. Oklo Inc. (NYSE:OKLO)\n1-Year Return: 114%\nUpside Potential: 99%\nNumber of Hedge Fund Holders: 27\nOklo Inc. (NYSE:OKLO) is an advanced nuclear reactor company that commercialises small modular reactors (SMRs) for clean and reliable power generation. Company’s flagship product, the Aurora Powerhouse, is a compact fission power system designed to provide carbon-free, baseload energy for industrial, commercial, and microgrid applications.\nOklo is positioned to address power demand needs across multiple end markets, the largest being the data center, which is expected to constitute 30% of total demand growth between 2022 and 2030. The company signed some significant deals in 2024, the largest one was the corporate power agreement with Switch, a pure-play data center company, for 12 gigawatts (GW) of Aurora powerhouse projects through 2044, which brought customer backlog to over 14GW. It also signed an agreement for 500 MW of power with Equinix, another data center company. These deals highlight the company’s long-life reactors and nuclear waste recycling capabilities, positioning it firmly to capitalise on the growing global demand for sustainable and secure energy sources.\nFollowing Oklo Inc.’s (NASDAQ:OKLO) Q4 results, a Craig-Hallum analyst reduced the price target slightly to $43 from $44 while keeping a Buy rating on the stock. The analyst noted that the company is building momentum in 2025. He also believes that progress is expected to increase as the company advances toward deploying its first Aurora Powerhouse at Idaho National Labs and expands its efforts in powering data centers.\nOklo Inc. (NASDAQ:OKLO) shares have risen around 114% over the last year.\n9. Avidity Biosciences Inc. (NASDAQ:RNA)\n1-Year Return: 32%\nUpside Potential: 107%\nNumber of Hedge Fund Holders: 41\nAvidity Biosciences Inc. (NASDAQ:RNA) is a clinical-stage biotech company developing a new type of RNA-based medicines called Antibody Oligonucleotide Conjugates (AOCs). These medicines are designed to deliver genetic treatments directly to the tissues affected by disease, helping target rare genetic conditions that currently have no effective treatments.\nThe company is trying to revolutionise the delivery of RNA therapeutics, and several of its therapies are under clinical trials. Leerink Partners analyst Joseph Schwartz recently reiterated a Buy rating on Avidity Biosciences Inc. (NASDAQ:RNA) with a $60 price target, citing promising clinical data from the company’s exon skipper candidate, del-zota, for Duchenne muscular dystrophy (DMD). The analyst pointed to encouraging results and believes these improvements could provide meaningful patient clinical benefits.\nHe also highlighted that Avidity is on track to submit a Biologics License Application (BLA) by the end of 2025, without requiring additional biopsies for new patients. The analyst stated that Avidity’s upcoming program represents their initial commercial entry, while internal activities like manufacturing, along with patient services and market access teams’ development, are already in motion. The small commercial potential of DMD for Avidity does not deter the analyst from seeing this program as essential groundwork for expanding the company’s muscular dystrophy medication development.\n8. Applovin Corp. (NASDAQ:APP)\n1-Year Return: 280%\nUpside Potential: 110%\nNumber of Hedge Fund Holders: 95\nAppLovin Corp. (NASDAQ:APP) operates a software platform that helps mobile app developers increase their business reach using innovative marketing tools, analytics, and monetization components. The company provides services that cover user acquisition initiatives, as well as monetisation features, performance evaluation options, and optimization capabilities. Additionally, the company operates a portfolio of mobile games under its Lion Studios brand.\nOn March 27, AppLovin’s stock plummeted by 20% following a report by short-seller Muddy Waters. The report accused the company’s e-commerce operations of heavy reliance on retargeting, delivering limited incremental value, as well as violating the terms of service of major digital advertising platforms. The main allegation accused AppLovin of achieving 52% e-commerce conversions from retargeted users when their actual valid sales reached 25% to 35% of the total. AppLovin disputed all accusations by calling them false and misleading information that was targeted to damage their business reputation.\nAnalysis from Wells Fargo analyst Alec Bonello also confirmed that AppLovin demonstrates excellent e-commerce incrementality according to their data. The research reveals that between 55% and 60% of e-commerce customers make their first purchase at the brand, which opposes claims about targeting existing customers with more than half of the ads. The report also criticised Muddy Waters’ reliance on data from only five customers, arguing that the churn observed is typical of an e-commerce business still in its early stages. The analyst reiterated an Overweight rating on the shares, with a price target set at $538.\nApplovin has delivered a remarkable 280% share price return over the past year.\n7. Solaris Energy Infrastructure Inc. (NYSE:SEI)\n1-Year Return: 170%\nUpside Potential: 111%\nNumber of Hedge Fund Holders: 26\nSolaris Energy Infrastructure Inc. (NYSE:SEI) is an energy infrastructure company that provides proppant logistics and last-mile delivery solutions to the North American oil and gas industry. Its integrated systems automate and optimise the supply chain of frac sand, a key material used in hydraulic fracturing.\nOn February 25, an analyst from Janney Montgomery Scott (JMS) initiated coverage on Solaris Energy Infrastructure Inc. (NYSE:SEI) with a Buy rating and a $57 price target. The analyst noted that following its mid-2024 acquisition of Mobile Energy Rentals LLC, the company now operates a mobile natural gas-fired turbine fleet and is actively expanding to meet growing energy demand. In addition to its Q4 earnings result, Solaris announced its plans to develop a joint venture partnership with its key data center client. Through this collaborative venture Solaris will lease 500 MW of power capacity to support a major data center project. Complete details of the agreement remain undisclosed, but analysts point out that Solaris can gain multiple strategic advantages.\nA day before JMS analyst, a Stifel analyst increased his price target to $48 from $42 while maintaining a Buy rating, citing the company’s solid Q4 results. The analyst pointed out that the company has secured significant new orders for its Power Generation assets and signed a long-term contract that exceeds six years, to supply at least 500MW of power to a big data center customer. The analyst remains optimistic about Solaris’ growth potential in the Power segment and has raised estimates accordingly.\nSolaris Energy shares have rallied a solid 170% over the last year.\n6. Edgewise Therapeutics Inc. (NASDAQ:EWTX)\n1-Year Return: 31%\nUpside Potential: 113%\nNumber of Hedge Fund Holders: 49\nEdgewise Therapeutics Inc. operates (NASDAQ:EWTX) as a clinical-stage biotech company that creates precise therapeutic solutions for uncommon and critical muscular disorders. The company currently focuses on EDG-5506 as its primary drug candidate because it aims to stop skeletal muscle damage in patients with DMD and BMD.\nIn addition to EDG-5506, the company is advancing EDG-7500, a cardiovascular candidate for obstructive and non-obstructive hypertrophic cardiomyopathy (HCM), expanding its pipeline into another area of significant unmet medical need. Edgewise is committed to discovering and commercialising innovative treatments for muscle-related diseases with limited current options. The company maintains a strong financial position as of Q4 2024, having $470 million in cash while being debt-free, which provides ample funding for its active clinical research programs.\nA Scotiabank analyst recently initiated coverage on Edgewise with a price target of $50 along with an Outperform rating because they see promising opportunities ahead in the company’s pipeline. The analyst highlighted promising early clinical data from sevasemten, which is being studied for both Becker and Duchenne muscular dystrophy, and EDG-7500 for cardiomyopathy. He views both programs as potential multi-billion-dollar opportunities and expects positive pipeline momentum to continue as the company progresses towards commercialisation in the near term.\n5. ARS Pharmaceuticals Inc. (NASDAQ:SPRY)\n1-Year Return: 27%\nUpside Potential: 138%\nNumber of Hedge Fund Holders: 28\nARS Pharmaceuticals Inc. (NASDAQ:SPRY) is a biopharmaceutical company focused on developing neffy, a needle-free epinephrine nasal spray designed to treat severe allergic reactions, including anaphylaxis which is known as a fatal condition. Neffy is intended to offer a quick, effective, and user-friendly alternative to traditional epinephrine auto-injectors.\nCurrently, except for neffy, epinephrine is the only approved in injectable form for the emergency treatment of Type I allergic reactions. With more launches planned, neffy is positioned to be the first needle-free, easy-to-use epinephrine rescue option, giving patients a new, more convenient choice. The company sees a significant market opportunity, with management estimating a potential multi-billion-dollar market ($3 billion prescription segment and up to a $7 billion expansion segment), driven by healthcare providers and patient preference.\nOn March 7, William Blair analyst Lachlan Hanbury Brown reaffirmed a Buy rating on ARS Pharmaceuticals, noting positive early indicators following neffy’s launch. The company slightly exceeded revenue expectations, reflecting solid initial demand. The analyst also noted progress with healthcare providers, as many have already prescribed neffy and shared encouraging feedback through the neffy experience program. The company also secured favourable insurance coverage with key players like Express Scripts and Cigna, which is expected to accelerate market access faster than planned.\n4. Hut 8 Corp. (NASDAQ:HUT)\n1-Year Return: 26%\nUpside Potential: 141%\nNumber of Hedge Fund Holders: 34\nHut 8 Corp. (NASDAQ:HUT) is a leading digital asset mining and high-performance computing (HPC) infrastructure company. The company operates large-scale data centers primarily focused on Bitcoin mining and offers cloud and colocation services.\nHut 8 Corp. (NASDAQ:HUT) holds a consensus Buy opinion with a price target of $30, indicating a substantial upside potential of 140%. In line with the rating and reflecting continued confidence in the company’s growth prospects, Canaccord Genuity analyst Joseph Vafi reaffirmed a Buy rating on Hut 8 Corp. (NASDAQ:HUT) in a report dated March 6. The analyst pointed out that Hut 8 has made meaningful progress in expanding its power development pipeline, especially with the recently announced 300MW River Bend data center project.\nThe analyst also added his view on the recently signed agreement with Bitmain Technologies (a manufacturer of mining servers), which includes an option to purchase ASIC miners. The analyst emphasized that this deal could benefit the company as it not only helps its financial position but will also help it expand its business. Additionally, Hut 8’s substantial Bitcoin holdings provide a strong balance sheet and position the company well to attract future key high-performance computing (HPC) hosting clients.\n3. Core Scientific Inc. (NASDAQ:CORZ)\n1-Year Return: 134%\nUpside Potential: 141%\nNumber of Hedge Fund Holders: 66\nCore Scientific Inc. (NASDAQ:CORZ) operates large-scale, purpose-built facilities for digital asset mining and plays a pivotal role in blockchain infrastructure, software solutions, and related services. The company utilises its extensive fleet of mining machines to generate bitcoin for its portfolio while also providing hosting services for major bitcoin mining clients. Core Scientific’s share price has surged 134% over the past 12 months, marking an impressive performance.\nCanaccord Genuity analyst Joseph Vafi reiterated a Buy rating and $17 price target on Core Scientific Inc. (NASDAQ:CORZ) in a March 12 report. The analyst highlighted the positive impact of CoreWeave’s recent $12 billion deal with OpenAI, reinforcing strong demand for AI cloud services. Given CoreWeave is Core Scientific’s largest customer, the partnership is expected to directly support its revenue base. Despite market concerns about potential cuts in Microsoft Corp.’s (NASDAQ:MSFT) data center spending, CoreWeave reported no decline in demand from Microsoft, its key client. Microsoft’s commitment to an $80 billion annual data center budget and CoreWeave’s IPO filing further underpin Core Scientific’s growth prospects.\nCore Scientific Inc.’s (NASDAQ:CORZ) stock is down 44% year-to-date, driven by overall market volatility, weaker Q4 results, and changing dynamics in the crypto market. However, the stock still holds a consensus Buy opinion with a 1-year median price target of $19, reflecting a solid 140% upside.\n2. Zeta Global Holdings Corp. (NYSE:ZETA)\n1-Year Return: 31%\nUpside Potential: 157%\nNumber of Hedge Fund Holders: 39\nZeta Global Holdings Corp. (NYSE:ZETA) operates an omnichannel data-driven cloud platform that provides enterprises with consumer intelligence and marketing automation software. This approach allows the company to deliver personalized marketing across all addressable channels, including email, social media, web, chat, Connected TV, and video.\nIn late February, Zeta reported a strong set of Q4 2024 results with revenue and EPS coming ahead of expectations. Revenue for the quarter came in at $315 million, up 50% year-over-year, and FY 2024 revenue crossed $1.0 billion, rising 38%. The company is investing in AI and first-party data, which it expects to help it achieve $2 billion in annual revenue by 2028, per its recently announced Zeta 2028 plan. For FY 2025, revenue is expected to be between $1.24-$1.25 billion, reflecting a strong 23%-24% growth.\nBank of America Securities analyst Koji Ikeda recently reaffirmed a Buy rating on Zeta Global Holdings Corp (ZETA) with a price target of $32, citing the stock’s recent pullback as a good opportunity. After meeting the company’s CFO recently, the analyst became more confident about Zeta’s ability to carry out its strategic plans. He highlighted the company’s cautious 2025 guidance and path to meet longer-term 2028 goals. Zeta plans to grow by boosting the adoption of its integrated solutions, broadening its partner network, and encouraging clients to use more of its products across different channels. The analyst also sees Zeta’s capital deployment, through acquisitions and a share repurchase program, as a strong signal of management’s confidence.\n1. Novavax Inc. (NASDAQ:NVAX)\n1-Year Return: 50%\nUpside Potential: 162%\nNumber of Hedge Fund Holders: 24\nNovavax Inc. (NASDAQ:NVAX) is a clinical-stage biotechnology company. It creates novel vaccines to address various infectious diseases worldwide and employs recombinant protein nanoparticle technology and its proprietary Matrix-M adjuvant to enhance immune responses.\nH.C. Wainwright analyst Vernon Bernardino reaffirmed a Buy rating on Novavax (NASDAQ: NVAX) with a price target of $19, highlighting the company’s strategic shift from COVID-19 vaccine commercialisation to advancing its pipeline. The analyst emphasized Matrix-M adjuvant technology as the primary vital factor because Novavax uses this platform to negotiate lucrative agreements including its recent Sanofi joint venture that may generate $1.2 billion.\nThe analyst also highlighted the Phase 3 trials of the COVID-19 and influenza combination vaccine that exists within the pipeline alongside early-stage candidates focusing on RSV combinations and shingles. Operations at Novavax are expected to become profitable by 2027, and its existing cash reserves should be able to support business operations for two years. Novavax Inc. (NASDAQ:NVAX) shares have surged around 50% over the past one-year.\nWhile we acknowledge the potential of NVAX to grow, our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns and doing so within a shorter time frame. There is an AI stock that went up since the beginning of 2025, while popular AI stocks lost around 25%. If you are looking for an AI stock that is more promising than NVAX but that trades at less than 5 times its earnings, check out our report about this cheapest AI stock.\nREAD NEXT: 20 Best AI Stocks To Buy Now and 30 Best Stocks to Buy Now According to Billionaires.\nDisclosure: None. Insider Monkey focuses on uncovering the best investment ideas of hedge funds and insiders. Please subscribe to our free daily e-newsletter to get the latest investment ideas from hedge funds’ investor letters by entering your email address below."
    },
    {
      "url": "https://www.insidermonkey.com/blog/three-megatrends-one-overlooked-stock-massive-upside-1548959/",
      "text": "There’s a once-in-a-generation convergence happening right now. Three unstoppable megatrends are reshaping the global economy—and one under-the-radar stock is perfectly positioned to profit from all of them.\nThis isn’t a flashy AI stock or a speculative play. It’s the infrastructure backbone of the future—and it’s trading at a bargain.\nLet me explain.\nTrend #1: The AI Arms Race\nArtificial intelligence is the most transformational force since the steam engine—and it’s just getting started.\nBut behind every ChatGPT prompt and robotic breakthrough is something few investors are thinking about:\nPower. Lots of it.\nWall Street is pouring hundreds of billions into artificial intelligence—training smarter chatbots, automating industries, and building the digital future. But there’s one urgent question few are asking:\nWhere will all of that energy come from?\nEven Sam Altman, the founder of OpenAI, issued a stark warning: “AI depends on an energy breakthrough.”\nElon Musk was even more blunt:\n“AI will run out of electricity by next year.”\nAs the world chases faster, smarter machines, a hidden crisis is emerging behind the scenes. Power grids are strained. Electricity prices are rising. Utilities are scrambling to expand capacity.\nAnd that’s where the real opportunity lies…\nOne little-known company—almost entirely overlooked by most AI investors—could be the ultimate backdoor play. It’s not a chipmaker. It’s not a cloud platform. But it might be the most important AI stock in the US.\nAs demand from AI data centers explodes, this company is gearing up to profit from the most valuable commodity in the digital age: electricity.\nThe “Toll Booth” Operator of the AI Energy Boom\n- It owns critical nuclear energy infrastructure assets, positioning it at the heart of America’s next-generation power strategy.\n- It’s one of the only global companies capable of executing large-scale, complex EPC (engineering, procurement, and construction) projects across oil, gas, renewable fuels, and industrial infrastructure.\n- It plays a pivotal role in U.S. LNG exportation—a sector about to explode under President Trump’s renewed “America First” energy doctrine.\nWhile investors pile into chip stocks with sky-high valuations, this company is quietly supplying the electricity that makes AI possible. No matter who wins the AI race—Microsoft, Google, Amazon, Meta—this company gets paid.\n>>>> SEE ALSO MY #1 AI STOCK PICK with 10,000% UPSIDE POTENTIAL <<<<<<\nTrend #2: Trump’s Tariff Strategy Could Trigger a U.S. LNG Export Boom\nDonald Trump has made one thing clear: he’s coming back to renegotiate global trade—on America’s terms.\nHis top priority? Narrowing the U.S. trade deficit. And this time, he’s not just targeting Chinese imports—he’s taking aim at every trade partner who’s been running a surplus at America’s expense.\nTrump’s team is already working behind the scenes to revise trade deals with Japan, Europe, and South Korea. And while the media focuses on tariffs and quotas, savvy investors are watching where the real money will flow:\nInto American LNG.\nHere’s why: The U.S. is sitting on a massive glut of natural gas—thanks to the shale boom. Domestic prices are near historic lows, while Europe and parts of Asia are paying 3–5x more for the same fuel. It’s the perfect imbalance.\nAnd Trump knows it.\nThat’s why he’s pressuring our trading partners to buy American energy as part of future trade agreements. It’s a simple way to cut the trade deficit without slapping tariffs on U.S. consumers.\nThat sets the stage for a massive wave of U.S. LNG exports, backed by political momentum and international demand.\nNow here’s where our stock comes in…\nOur stock is a tollbooth operator in this booming sector. This company builds the infrastructure that makes LNG exports possible—the pipelines, terminals, and systems that physically move U.S. gas to global buyers.\nIf Trump succeeds in tying LNG purchases to trade deals—and all signs suggest he will—this company will be printing money on every contract signed. The more the world buys American gas, the more this company earns.\nAnd this isn’t some hypothetical “if.” The groundwork is already being laid:\n- Europe is scrambling to replace Russian gas permanently.\n- Japan is actively sourcing non-Chinese, non-Russian LNG.\n- India and South Korea are deepening energy ties with the U.S.\n- New terminals are being planned and permitted in anticipation of the coming surge.\nTrump’s tariff threats may dominate the headlines—but his behind-the-scenes LNG diplomacy could be the real financial windfall for U.S. energy companies.\nAnd our pick is sitting in the perfect spot to benefit.\n>>>> SEE ALSO MY #1 AI STOCK PICK with 10,000% UPSIDE POTENTIAL <<<<<<\nTrend #3: The Great Onshoring Boom—And the $9 Billion Clue in Indiana\nFor decades, America offshored its industrial base. Now, that trend is reversing—and fast.\nFrom semiconductors to pharmaceuticals, manufacturing is coming back to U.S. soil. Rising geopolitical tensions, Trump-era tariffs, and global supply chain shocks have forced companies to rethink their entire operating models. The result? A tidal wave of onshoring—and our stock is riding it like a pro.\nJust look at what’s happening in Lebanon, Indiana.\nPharma giant Eli Lilly is investing $9 billion into two state-of-the-art manufacturing facilities at the LEAP Lebanon Innovation and Research District. This is one of the largest life sciences manufacturing investments in U.S. history—and it’s not a one-off.\nOur company—a global leader in engineering, procurement, and construction management (EPCM)—has already been awarded a $3.2 billion contract for this project. That’s not a preliminary deal. This is full notice to proceed. Shovels are in the ground. Steel is going up. Money is already flowing.\nAnd this is just the beginning.\nThe Lilly project is a bellwether for what’s coming: dozens of similar large-scale facilities across the country, spanning sectors from biotech to clean energy to advanced manufacturing. Each one will require complex infrastructure, deep engineering know-how, and flawless execution.\nThat’s exactly what our company delivers.\nThis isn’t speculative future revenue. This is high-margin, long-duration, politically supported work—backed by blue-chip clients and megatrends. And as more companies race to bring operations home, our stock is in the pole position to win contract after contract.\nn fact, you can think of it this way:\nWherever America rebuilds its industrial backbone, this company gets paid.\nIt’s not just an AI play. It’s not just an energy play. It’s also the ultimate onshoring pick-and-shovel stock—a contractor to the next American manufacturing supercycle.\nAnd while Wall Street focuses on headlines, smart investors are loading up on the company quietly collecting billion-dollar checks behind the scenes.\n>>>> SEE ALSO MY #1 AI STOCK PICK with 10,000% UPSIDE POTENTIAL <<<<<<\nBuilt for the Future: Zero Debt, Cash to Deploy, and AI in Its Sights\nWhile most energy and utility firms are buried under mountains of debt and coughing up hefty interest payments just to appease bondholders…\nThis company is completely debt-free.\nIn fact, it’s sitting on a war chest of cash—equal to nearly one-third of its entire market cap.\nIt also owns a huge equity stake in another red-hot AI play, giving investors indirect exposure to multiple AI growth engines without paying a premium.\nAnd here’s what the smart money has started whispering…\nThe Hedge Fund Secret That’s Starting to Leak Out\nThis stock is so off-the-radar, so absurdly undervalued, that some of the most secretive hedge fund managers in the world have begun pitching it at closed-door investment summits.\nThey’re sharing it quietly, away from the cameras, to rooms full of ultra-wealthy clients.\nWhy? Because excluding cash and investments, this company is trading at less than 7 times earnings.\nAnd that’s for a business tied to:\n- The AI infrastructure supercycle\n- The onshoring boom driven by Trump-era tariffs\n- A surge in U.S. LNG exports\n- And a unique footprint in nuclear energy—the future of clean, reliable power\nYou simply won’t find another AI and energy stock this cheap… with this much upside.\nThis isn’t a hype stock. It’s not riding on hope.\nIt’s delivering real cash flows, owns critical infrastructure, and holds stakes in other major growth stories.\nThis is your chance to get in before the rockets take off!\nThe Reveal: Our Top Short-Term Stock Pick for 2025\nThis is the moment when most newsletters put up a paywall and ask you to spend $99.99 to find out the name of the stock.\nBut we’re not doing that today.\n>>>> SEE ALSO MY #1 AI STOCK PICK with 10,000% UPSIDE POTENTIAL <<<<<<\nAt Insider Monkey, we believe in earning your trust first—by delivering real value, upfront. We’re confident that once you see the quality of our research and the strength of our ideas, you’ll want to subscribe on your own terms.\nSo here it is—our top short-term stock pick of 2025:\n👉 Fluor Corporation (Ticker: FLR)\nWhen we published our premium report at the end of April, FLR was trading around $35 per share. Based on everything we’ve laid out—from the AI infrastructure boom to the LNG export surge and the American manufacturing revival—we believe FLR is poised to double over the next 12 to 24 months.\nAnd this isn’t just a recommendation—it’s a conviction.\nI personally took a double-sized position in my own portfolio. That’s how strongly I believe in Fluor’s upside.\nThis is our free gift to you.\nWe want you to profit from it—and see firsthand the power of aligning your investments with long-term megatrends.\nIf you’re interested in going even deeper…\nIf you’d like to access our #1 long-term AI stock pick—one that we believe has 10,000% upside potential over the next decade—click here to learn more.\nWe’ve shown you what we can do.\nNow imagine what you’ll unlock as a premium subscriber."
    },
    {
      "url": "https://www.insidermonkey.com/blog/the-best-and-worst-dow-stocks-for-the-next-12-months-1520028/?singlepage=1",
      "text": "The Dow Jones Industrial Average (DJIA), or the Dow, is a price-weighted index that has long been seen as a barometer of the health of the U.S. economy. After touching all-time highs in late November 2024, the index has corrected nearly 7% in 2025 (as of April 23) and is down 12% from its highs. Rightly so, the correction reflects several unfavourable developments, including economic uncertainties and geopolitical tensions weighing on economic growth. The market is expected to remain volatile as the trade and other aspects of the US administration’s policy agenda play out.\nAmid this volatility, based on the potential for share price appreciation in the next 12 months, we have created a selection of the best and worst Dow stocks from the 30 Dow constituent stocks.\nHas This Been the Most Volatile Period for The Dow?\nIf we analyse its trackable history from 1899, the Dow has fallen 7% or more on a single day twenty times. Of those, only seven occurred after the year 2000, and the 5.5% decline on April 5, 2025, doesn’t count as one of those seven, or not even in the historical top twenty. So, technically, this correction was not as severe as earlier. From corrections post 2000, the sharp declines when Covid-19 struck were the most noticeable – Dow fell 7.8%, 10%, and 12% on 9, 12, and 16th March, respectively, and saw further significant declines in that year.\nThat said, the current period remains one of the most confusing times for market participants, even for the larger players in the equity market, who remain uncertain about their estimates for the broader markets, such as the Dow.\nIs Volatility Expected to Continue?\nIn a recent interview, Lauren Goodwin, Chief Market Strategist at New York Life Investments, emphasized that the fundamental picture remains cloudy and investors are still looking for clarity in macroeconomic fundamentals. Despite some positive economic data recently, policy uncertainty is limiting visibility. As more data is released, she believes markets are entering a sustained period of elevated volatility across equities and fixed income.\nWhat is The Best Way Forward for Investors?\nIn these testing times, investors should examine fundamentals more critically, preferring Dow stocks with earnings resilience, clear competitive advantages, and exposure to long-term, secular growth themes. On April 28, Stephanie Link, Hightower Advisors’ chief investment strategist, shared her positive outlook on the stock market in an interview on CNBC. With major tech companies, consumer, and financial companies set to announce results, she believes that if corporate earnings remain strong, the recent market rebound could continue. Since early April, the market has recovered significantly, and she attributed the rally to better-than-expected profit margins and steady corporate performance. Although the prominent tech names aren’t cheap in terms of valuation, she views the recent declines as long-term buying opportunities.\nWhile markets may remain volatile in the coming months, the best opportunities in the Dow over the next 12 months should come from stocks with strong pricing power and earnings momentum. Investors should stick to stocks with strong brands, recurring revenue models, and competitive moats, which enable them to navigate macro uncertainty. Since the Dow comprises large-cap companies across various industries, these stocks might perform better during sell-offs.\nWith these insights, let’s look at the best and worst Dow stocks for the next 12 months.\nOur Methodology\nTo identify the best and worst Dow stocks, we began with the 30 constituent stocks of the DJIA Index. We then ranked these stocks in ascending order based on the consensus 1-year median potential upside. Additionally, we also include data on hedge funds holding stakes in these stocks, utilizing Insider Monkey’s Q4 2024 hedge fund database to provide deeper insights into institutional investor trends.\nIt is important to note here that the terms “best” and “worst” refer strictly to the relative upside potential and do not imply any fundamental strengths or weaknesses of the underlying companies.\nNote: All pricing data is as of market close on April 23.\nWhy are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 363.5% since May 2014, beating its benchmark by 208 percentage points (see more details here).\n30. The Coca-Cola Company (NYSE:KO)\nUpside Potential: 6.4%\nMarket Cap: $315 billion\nNumber of Hedge Fund Holders: 81\nThe Coca-Cola Company (NYSE:KO) is the first stock on our Best and Worst Dow Stocks list, and consequently, it is also the best-performing stock YTD in the DJIA, as of the close of April 23. It is a global beverage company with a portfolio of over 200 brands, including Coca-Cola, Sprite, Fanta, and Minute Maid. The company has a strong distribution network spanning over 200 countries, with which it generates consistent revenue from its diverse range of carbonated soft drinks, juices, and bottled water. It is consistently ranked among the most valuable brands worldwide.\nThe Coca-Cola Company (NYSE:KO) continues to benefit from its focus on product innovation and marketing campaigns, which have bolstered its volume growth in its beverage portfolio, robust organic revenue growth, and margin expansion. This has helped the company maintain its market share lead. For FY 2024, organic revenue grew a solid 12% year-over-year, which was driven by 11% growth in price/mix and 2% growth in concentrate sales. Adjusted operating margin for the full year improved by 90 basis points to 30%, and adjusted free cash flow increased by over 10% to $10.8 billion.\nLarger beverage companies have recently been discussed heavily regarding the impact of tariffs. The Wall Street Journal recently reported that The Coca-Cola Company (NYSE:KO) may have an edge over its competitor, PepsiCo Inc. (NASDAQ:PEP), as it manufactures most of its soda concentrate in U.S. territories, versus competitors’ manufacturing exposure to Ireland (which is now subject to higher tariffs).\nIn street activity, UBS analyst Peter Grom recently reiterated his Buy rating on KO and increased the price target on the shares to $84 from $78. Despite a weaker macro environment, the analyst sees the company as better positioned for the upcoming earnings season and has better fundamental visibility, supporting his optimistic view.\n29. American Express Company (NYSE:AXP)\nUpside Potential: 6.5%\nMarket Cap: $182 billion\nNumber of Hedge Fund Holders: 71\nAmerican Express Company (NYSE:AXP) is a payments company with operations worldwide. It offers products and services in areas including card networks, merchant acquisition and processing, card issuance, expense management, and travel and lifestyle services. It serves a wide range of customers, including consumers, small and mid-sized companies, and large corporations.\nAmerican Express Company (NYSE:AXP) is among the DJIA’s laggards regarding share price performance YTD. Its share has slid over 12% in 2025, a sharp contrast from a substantial 58% increase in 2024.\nFor Q1 2025, the company reported revenue of $17 billion, which was in line with street expectations and represented a 7% year-over-year growth. That said, EPS of $3.64 exceeded estimates by around 5%. In addition, the company maintained its full-year guidance of 8%-10% revenue growth and EPS range of $15.0 and $15.5. However, the results and the beat on the bottom line were not enough to support substantial upward momentum in the share price.\nFollowing the results, William Blair analyst Christopher Kennedy reiterated his Buy rating on the stock. He believes the shares are trading at a valuation discount despite their better-than-average revenue and earnings growth trajectory. He highlighted American Express Company’s (NYSE:AXP) strategic focus on premium consumers and strong financial positioning, which should help it weather the ongoing economic challenges. As a result, the analyst finds the stock attractive given his expectation of a mid-teens EPS growth driven by cost discipline and multiple growth opportunities.\n28. McDonald’s Corp. (NYSE:MCD)\nUpside Potential: 6.8%\nMarket Cap: $228 billion\nNumber of Hedge Fund Holders: 67\nIt is difficult to imagine someone not knowing McDonald’s Corp. (NYSE:MCD) and the celebrated golden arches. The company franchises, owns, and operates McDonald’s restaurants across over 100 countries, serving a locally relevant menu of food and beverages. Best known for serving hamburgers, cheeseburgers, and French fries, the company had 43,477 restaurants as of end-2024, with around 95% franchised.\nAs visible from its share price outperformance year-to-date (+10%), the company’s business remains resilient amid inflationary pressures, helped by its global brand, franchise model, and strong operational efficiency. Over the last few years, the company has benefited from its ‘Accelerating the Arches’ strategy, which focuses on growing market share, expansion of digital platforms, and menu innovations.\nCorroborating its investment case, an analyst at Erste Group upgraded the stock’s rating to a Buy from Hold on March 17. The analyst based his upgrade on the company’s high and stable operating margin and business stability. With a 2025 gross profit margin and revenue growth estimate of 57% and 2% year-over-year, he expects MCD’s international segment to grow faster than the domestic business, which should support earnings and share price momentum.\nIn mid-April, Morgan Stanley analyst Brian Harbour reaffirmed his confidence in the stock with a Buy rating and a price target of $330.\n27. JPMorgan Chase & Co. (NYSE:JPM)\nUpside Potential: 7.5%\nMarket Cap: $670 billion\nNumber of Hedge Fund Holders: 123\nJPMorgan Chase & Co. (NYSE:JPM) is a financial services company and the largest U.S. bank by assets ($4.0 trillion as of December 2024). The company is a market leader in investment banking, commercial lending, and asset management.\nIn a report on April 14, Phillip Securities analyst Glenn Thum reaffirmed his Buy rating on JPMorgan Chase & Co. (NYSE:JPM) with a price target of $252. The analyst highlighted strong growth in the bank’s trading, asset management, and investment banking operations, which drove a 17% year-over-year growth in non-interest income. The key drivers for this growth include healthy activity in equity markets and higher asset management fees supported by net inflows and favourable market conditions.\nWhile the company is witnessing challenges like lower net interest income and increasing expenses, the analyst is encouraged by the overall growth resilience across divisions. He believes that this resilience should help the company sustain earnings momentum. Additionally, dividend increases and share repurchases contribute to the analyst’s optimistic view of the stock.\n26. International Business Machines Corp. (NYSE:IBM)\nUpside Potential: 9.0%\nMarket Cap: $228 billion\nNumber of Hedge Fund Holders: 60\nInternational Business Machines Corp. (NYSE:IBM) is a technology company that provides integrated consulting, software, and infrastructure solutions by leveraging hybrid cloud and artificial intelligence.\nOver the last few years, IBM has tried to refocus its strategic growth in areas such as automation, cybersecurity, and quantum computing. The company is particularly encouraged about hybrid cloud, where it sees as much as a $1.7 trillion global opportunity. It is also making robust progress in quantum computing and currently boasts of deploying more quantum systems than the rest of the world combined. In February, the company gave a long-term revenue growth guidance of 5%, including 10% software revenue growth, which supported the share price performance.\nWamsi Mohan, an analyst at Bank of America Securities, recently corroborated these growth prospects. Despite the macroeconomic challenges, Wamsi reiterated his Buy rating on IBM with a price target of $270 in a report published around April 20. He lauded the company’s strong YTD share price performance and attributed it to its recurring revenue streams and the mission-critical nature of its offerings. Among other drivers for his optimism, he counted strong growth in the software business, strategic acquisitions like HashiCorp, a healthy dividend yield, and the benefits from the Mainframe refresh cycle.\n25. Johnson & Johnson (NYSE:JNJ)\nUpside Potential: 9.2%\nMarket Cap: $374 billion\nNumber of Hedge Fund Holders: 98\nJohnson & Johnson (NYSE:JNJ) is a healthcare company that develops therapeutics, medical devices, and consumer health products. The company is known for its innovation capabilities and thus focuses on high-growth, scientific research-driven healthcare segments.\nJohnson & Johnson (NYSE:JNJ) recently announced that it will spend around $55 billion in the US over the next four years. The pharmaceutical industry is broadly insulated from tariffs so far, but things might change in the coming months. Despite potential tariffs, the company maintained its FY 2025 EPS guidance and modestly increased its revenue guidance, as announced with its Q1 2025 results on April 15.\nAn analyst from Raymond James noted that Q1 results were strong, with better performance in the pharmaceutical segment, which has driven upward revisions in revenue and EPS estimates. Despite the impact of the loss of exclusivity (LoE) from Stelera, the company should still witness healthier, low single-digit growth. The analyst also believes the new guidance is conservative and achievable, but potential tariffs remain a risk for the pharmaceutical business. He increased the share price target to $164 from $162, keeping his Outperform rating intact.\n24. The Goldman Sachs Group Inc. (NYSE:GS)\nUpside Potential: 9.6%\nMarket Cap: $165 billion\nNumber of Hedge Fund Holders: 81\nThe Goldman Sachs Group Inc. (NYSE:GS) is a prominent global financial services firm that provides investment banking, securities, and asset management services.\nGoldman Sachs Group Inc. (NYSE:GS) reported strong Q1 2025 results. Revenue of $15.1 billion was ahead of the street’s expectation of $14.8 billion. Surprisingly, EPS of $14.1 was substantially ahead of the expectation of $12.3. As a result, the quarter’s return on equity of 16.9% exceeded street estimates.\nBuoyed by the stronger results, Bank of America Securities analyst Ebrahim Poonawala reiterated his Buy rating on The Goldman Sachs Group Inc. (NYSE:GS) with a price target of $700, close to the consensus high of $720. He estimates that the stock is undervalued with relatively low price-to-earnings and tangible book value ratios. This provides an attractive entry opportunity for the investors.\nEbrahim also believes that further upside to the share price is underpinned by revenue growth in investment banking, asset, and wealth management businesses, as well as opportunities for better capital allocation after recent stress tests. Share repurchases are also expected to bolster EPS and limit downside risks. These factors reinforce the analysts’ optimism overall.\nIn another recent report, Jefferies analyst Daniel Fannon maintained his Buy rating on the shares, citing the company’s strong performance amid market volatility.\n23. Verizon Communications Inc. (NYSE:VZ)\nUpside Potential: 10.1%\nMarket Cap: $180 billion\nNumber of Hedge Fund Holders: 74\nVerizon Communications Inc. (NYSE:VZ) is a telecommunications company that provides wireless and wireline communications services and products to consumers and businesses.\nVerizon Communications Inc. (NYSE:VZ) commands around 37%- 38% of the market share in the US telecom industry, which is generally known for slow growth but strong cash flow generation. Despite this industry dynamic, VZ is trying to support user and average revenue per user (ARPU) growth through innovative offerings, including pricing and service bundles. Wireless service revenue, which constitutes around 56%-60% of its total revenue, grew 3.1% year-over-year in Q4 2024, and is expected to register a 2.0%-2.8% growth in FY 2025 as well.\nThe company operates on an EBITDA margin of around 34% and generated a robust free cash flow (FCF) of $19.8 billion in FY 2024, up from $18.7 billion in 2023. The momentum will continue in 2025 as the company expects to generate an FCF of $17.5-$18.5 billion, which should eventually help it maintain an already strong over 6% dividend yield. VZ’s financial position is strong, with net debt to EBITDA of 2.3 times, which is considered comfortable relative to the industry.\nAs per Mordor Intelligence, the US Telecom market size is expected to grow to USD 550 billion by 2030, from USD 459 billion in 2025 (CAGR of 3.67%). In its recently published 2025 global telecommunications outlook, Deloitte highlighted that telecom companies continuously seek innovative ways to diversify their revenue base. Thus, they could capitalize on opportunities like monetizing the GenAI demand, mergers and acquisitions, and profitable strategies to launch 6G. As the leading player, Verizon Communications Inc. (NYSE:VZ) should benefit from these opportunities and ensuing growth.\n22. The Procter & Gamble Company (NYSE:PG)\nUpside Potential: 11.6%\nMarket Cap: $389 billion\nNumber of Hedge Fund Holders: 79\nThe Procter & Gamble Company (NYSE:PG) is a global consumer goods leader with a vast portfolio of brands, including Tide, Pampers, Gillette, and Head & Shoulders, which are well-known and trusted by millions of households worldwide. It operates in over 180 countries and benefits from strong brand recognition and consumer loyalty.\nDuring the second week of April, JP Morgan analysts reviewed the ratings of their beverage, household & personal care products group companies. For the sector, they highlighted the slowdown in consumption in developed markets, particularly in the US and Western Europe. While the industry is relatively more defensive concerning the effects of tariffs, they believe stocks exposed to China will be adversely affected. In their view, forward guidance and commentary from management will be far more critical than the upcoming quarterly earnings results. Nevertheless, the analyst responsible for The Procter & Gamble Company (NYSE:PG) reiterated his Overweight rating for the company but lowered his price target to $172 from $181.\nAround the same time, Morgan Stanley analyst Dara Mohsenian reaffirmed his Buy rating on the shares with a price target of $191. This target is closer to the consensus high of $200 and indicates an upside potential of over 15%.\n21. The Travelers Companies Inc. (NYSE:TRV)\nUpside Potential: 11.9%\nMarket Cap: $59 billion\nNumber of Hedge Fund Holders: 52\nThe Travelers Companies Inc. (NYSE:TRV) provides commercial and personal property and casualty insurance products and services to businesses, government units, associations, and individuals. The majority of its revenue comes from the domestic market.\nThe company reported pretax catastrophe losses of $2.3 billion from the January California wildfires, which hurt its Q1 2025 results announced on April 16. This was higher than the $1.7 billion estimate the company had given in February. Despite this impact, quarterly financial performance was strong, with underlying underwriting income rising 32%, driven by strong net earned premiums of $10.7 billion. Core income of $443 million came in better than expectations.\nStreet analysts were broadly optimistic after the company’s strong results and long-term outlook, although some analysts highlighted concerns in the near term. William Blair analyst Adam Klauber maintained his Neutral rating on the stock as he sees reduced potential for earnings growth in 2025, but stabilization and better growth in 2026. On the other side, Keefe Bruyette analyst Meyer Shields increased his price target to $290 from $274, and maintained an Outperform rating. Analysts from Evercore ISI and Roth MKM also reiterated their confidence in the stock and maintained their Buy ratings.\n20. Amgen Inc. (NASDAQ:AMGN)\nUpside Potential: 12.3%\nMarket Cap: $149 billion\nNumber of Hedge Fund Holders: 72\nAmgen Inc. (NASDAQ:AMGN) is a pioneer in the biotechnology industry. It develops, manufactures, and sells innovative medicines for some of the most serious diseases, including cancer, heart disease, and osteoporosis. Close to ten of Amgen Inc.’s (NASDAQ:AMGN) products delivered at least double-digit sales growth, which helped the company’s 2024 revenue climb 19% YoY to $33.4 billion. It expects to report revenue in the $34.3-35.7 billion range in 2025.\nIn 2024, the company spent around $6 billion on R&D, up 25% year over year and equating to around 18.5% of total revenue. With that kind of R&D focus, the company has a strong pipeline of potentially best-in-class medicines across many therapeutic areas. The U.S. Food and Drug Administration (FDA) approved UPLIZNA as the first and only treatment for Immunoglobulin G4-related disease (IgG4-RD) in early March. This immune-mediated inflammatory condition can affect multiple organs.\nIn their latest updates in the last two weeks, analysts from Bernstein, Piper Sandler, and Jefferies have reiterated their Buy rating on the stock.\n19. 3M Company (NYSE:MMM)\nUpside Potential: 12.5%\nMarket Cap: $73 billion\nNumber of Hedge Fund Holders: 79\n3M Company (NYSE:MMM) is a diversified global conglomerate that manufactures various products across industrial, safety, transportation, electronics, and consumer markets.\nOn April 22, the company reported healthy Q1 2025 earnings results. Adjusted revenue for the quarter stood at $5.8 billion, up 1.5% organically, and modestly ahead of street estimates. The EPS of $1.88 was up 10% year-over-year and came substantially ahead of street expectations of $1.77.\nFor FY 2025, the company reaffirmed its EPS guidance of $7.6 to $7.9 (in line with consensus at mid-point), including a $0.2-$0.4 impact from tariffs. The company is considering several measures to offset the effects of tariffs, including shifting its production bases, pricing actions, and optimizing networks.\nFollowing the results, an analyst at UBS published a report highlighting that the stock remains one of the Top Picks across the UBS coverage universe. Despite the company reiterating its guidance, the analyst increased his EPS estimates for FY 2025. He believes the guidance appears conservative, and there could be further upside to the company’s estimates. Supported by the order trends and better organic growth, the analyst also estimates that the company would win back more market share in the coming years. He, therefore, reiterated a Buy rating with a price target of $184.\n18. Honeywell International Inc. (NASDAQ:HON)\nUpside Potential: 13.0%\nMarket Cap: $127 billion\nNumber of Hedge Fund Holders: 67\nHoneywell International Inc. (NASDAQ:HON) is a diversified technology and manufacturing company that serves sectors including aerospace, building technologies, performance materials, and industrial automation.\nWhile the company recently gave a lacklustre outlook for FY 2025, investors are currently focusing on the corporate split announced in early February. By the second half of 2026, the company aims to separate into three listed companies: Honeywell Automation, Honeywell Aerospace, and Advanced Materials. The separation is said to have resulted from the push from activist investor Elliott Management, which revealed a $5 billion stake in the company around mid-November.\nAccording to a CNBC report, Tony Bancroft, a portfolio manager at Gabelli Funds, valued the aerospace and automation businesses at $104 billion and $94 billion, respectively. However, he also advised that the full value might be realized in a longer time frame rather than in the near term.\nAccording to the same report, an analyst from RBC Capital also saw limited potential upside in the near term but indicated substantial value generation in the year after several similar spin-offs.\n17. Walmart Inc. (NYSE:WMT)\nUpside Potential: 13.8%\nMarket Cap: $761 billion\nNumber of Hedge Fund Holders: 116\nWalmart Inc. (NYSE:WMT) is the world’s largest retailer by revenue. It operates a global network of hypermarkets, discount stores, and e-commerce platforms. The company focuses on improving customer experience by integrating e-commerce and retail stores with technology.\nWalmart operates in the defensive consumer staples space and, rightly so, has had a very stable share price performance so far in the year. The company generated around $675 billion in revenue in FY 2025, and even at that scale, it continues to expect revenue to grow around 3%-4% in FY 2026, which reflects the strength of its business model.\nMizuho analyst David Bellinger recently initiated coverage on Walmart Inc. (NYSE:WMT) with an Outperform rating and assigned a $105 price target. The analyst views the stock as a dominant name in the consumer space and advises it as a must-own name in the current market and economic volatility. He also believes that the company’s shift from a legacy retail model to a tech-oriented one has reached a crucial juncture where its delivery and convenience rival any other player in the industry. The company’s resilient growth and high-margin profile also underpin his favourable opinion.\n16. The Boeing Company (NYSE:BA)\nUpside Potential: 16.1%\nMarket Cap: $130 billion\nNumber of Hedge Fund Holders: 103\nThe Boeing Company (NYSE:BA) is an aerospace company that manufactures and sells commercial jet aircraft, defense products, and security and space systems to customers in more than 150 countries.\nThe company had a pretty difficult 2024 as it faced issues regarding quality and safety in its aircraft, management churn, and employee strikes. Its share price tanked around 32% last year. In 2025, the company tried to shore up its operations, and the most crucial decision it took was to sell portions of its Digital Aviation Solutions business, including its Jeppesen, ForeFlight, AerData, and OzRunways assets, to the investment firm Thoma Bravo. The deal, announced on April 22, is valued at $10.6 billion. It not only gives The Boeing Company (NYSE:BA) financial leeway but is also expected to strengthen its focus on core business.\nThe company also reported its Q1 2025 results on April 23. The main takeaway was the operational improvement underway. Revenue for the quarter grew 18% year-over-year to $19.5 billion, primarily driven by 130 commercial deliveries. Adjusted core operating profit came in at $199 million, a substantial improvement over an operating loss of $388 million in the prior year. Free cash flow burn (i.e., cash usage) also improved to $2.3 billion versus $3.9 billion for the previous year’s quarter.\nAnalysts have been broadly optimistic about the company’s operational improvements and outlook. Consensus 1-year median price target currently stands at $200, which implies over 16% upside potential.\n15. Visa Inc. (NYSE:V)\nUpside Potential: 16.7%\nMarket Cap: $653 billion\nNumber of Hedge Fund Holders: 181\nVisa Inc. (NYSE:V) is a well-known payments network. It provides digital payments and facilitates electronic funds transfers between consumers, merchants, and financial institutions. Notably, the company is not a financial institution and doesn’t issue cards or extend credit. Through its innovative technologies, it earns revenue by facilitating money movement across more than 200 countries and territories among the customers mentioned above.\nFor the last eight years, Visa Inc. (NYSE:V) has grown its revenues by a CAGR of 11% and EPS by 17%, generating strong free cash flows over those years. As per its latest investor day commentary, the company still sees an enormous opportunity across its businesses, targeting an estimated addressable consumer spend of $41 trillion, a $200 trillion payments volume opportunity in New Flows (Commercial & Money Movement Solutions), and $520 billion in value-added services.\nRecent analyst opinions have been broadly positive on the stock. In early April, a Goldman Sachs analyst increased his price target on Visa to $392 from $384 earlier, reaffirming a Buy rating. An analyst from Evercore ISI called companies like Visa and MasterCard Inc. (NYSE:MA) the best defensive plays in a down market.\n14. The Sherwin-Williams Company (NYSE:SHW)\nUpside Potential: 19.3%\nMarket Cap: $83 billion\nNumber of Hedge Fund Holders: 74\nThe Sherwin-Williams Company (NYSE:SHW) is a specialty chemicals company. It manufactures and sells paints, coatings, and related products to professional, industrial, commercial, and retail customers. The company generates 80% of its revenue from the domestic market and the rest from its foreign subsidiaries.\nMorgan Stanley analyst Vincent Andrews maintained a Buy rating on The Sherwin-Williams Company (NYSE:SHW) on April 22, setting a price target of $385. He highlighted the company’s ability to deliver strong earnings in a weaker housing market, as he believes its solid pricing power enables it to withstand raw material cost changes and economic shifts. Sherwin-Williams is well-positioned for meaningful market share growth. Compared to his conservative view earlier, the analyst believes the company’s outlook is favourable as its guidance now seems achievable. Additionally, with falling interest rates and improving housing market conditions, Sherwin-Williams is expected to benefit further, potentially boosting its earnings multiple as it captures a greater market share.\n13. Apple Inc. (NASDAQ:AAPL)\nUpside Potential: 19.8%\nMarket Cap: $3.07 trillion\nNumber of Hedge Fund Holders: 166\nApple Inc. (NASDAQ:AAPL) designs, manufactures, and markets innovative consumer products, including the iPhone, iPad, Mac computers, Apple Watch, and Apple TV. The company also offers a range of software and services, such as the iOS and macOS operating systems, iCloud, advertising, payment services, Apple Music, and the App Store.\nApple Inc. (NASDAQ:AAPL) stock has fallen around 18% this year (as of the close of April 23) due to headwinds from tariffs and the overall escalation of trade issues with China. Additionally, the company faced pressure following reports of delays in introducing key features to its Siri virtual assistant. A weaker-than-competition version of AI in its smartphone would typically hint at lower-than-expected sales, raising investor concerns.\nWhile tariff issues have temporarily subsided after the 90-day pause and ongoing renegotiations with China, investors remain uncertain. Recently, research firm MoffettNathanson flagged risks of a sharp correction in Apple stock due to geopolitical issues, costs hit by tariffs, and growing recession risks.\nHowever, an analyst from Goldman Sachs reiterated his confidence in the stock in a report published around April 23. The analyst believes the company should report better Q2 2025 results (FY ends in September), driven by new products and refresh cycles. He also noted that concerns about price hikes due to tariffs might also lead customers to buy earlier than usual. Additionally, increased competition among U.S. carriers and steady growth in Apple’s Services, like iCloud and App Store, will contribute to better earnings. He therefore reaffirmed his Buy rating with a price target of $256 (down from $259 earlier).\n12. Caterpillar Inc. (NYSE:CAT)\nUpside Potential: 20.0%\nMarket Cap: $141 billion\nNumber of Hedge Fund Holders: 62\nCaterpillar Inc. (NYSE:CAT) manufactures construction and mining equipment, diesel and natural gas engines, industrial turbines, and diesel-electric locomotives.\nThe outlook for Caterpillar Inc. (NYSE:CAT) has been mixed recently, and the stock has thus been seeing lower levels since the start of the year. Although precise exposure to China is not clear, the company derives 18% to 19% of its revenue from the Asia Pacific region, and thus, it has substantial exposure to China. Higher tariffs would result in steeper import costs for Chinese companies and, therefore, could lead to deal cancellations or project postponements.\nDespite the macroeconomic pressures, consensus still sees a 20% upside potential with a 1-year median price target of $355. An analyst at BofA Securities recently lowered his share price target to $335 from $414 but maintained his Buy rating. He holds a cautious view on the Machinery, E&C, and Waste sector and expects a challenging earnings season for companies in the industry.\nSimilarly, JP Morgan analyst Tami Zakaria reiterated his Overweight rating on the shares but reduced the price target to $380 from $490 earlier. The analyst believes that a higher recession probability may weigh on the industry outlook and the near-term guidance of construction equipment group companies. On a slightly worrying note, the analyst also said that the earlier expected second-half acceleration might not materialize.\n11. The Home Depot Inc. (NYSE:HD)\nUpside Potential: 23.5%\nMarket Cap: $354 billion\nNumber of Hedge Fund Holders: 88\nThe Home Depot Inc. (NYSE:HD) is the world’s largest home improvement retailer with around 2,300 stores across North America. It offers a wide selection of building materials, appliances, tools, and home improvement products.\nHome Depot Inc. (NYSE:HD) released its Q4 2024 results on February 22, reporting 14.1% year-over-year growth in quarterly revenue of $39.7 billion. However, comparable basis sales rose 0.8%, exceeding street expectations. Notably, this was the first positive growth reported after eight quarters of decline. For the full year, comparable sales declined 1.8%, and adjusted EPS stood at $15.24, flat year-over-year.\nHowever, the company’s guidance for FY 2025 was softer-than-expected. It guided for total sales growth of 2.8% and comparable sales growth of around 1%, which was lower than the consensus of around 1.65%. Kate McShane, analyst at Goldman Sachs, called the guidance conservative considering the muted housing environment amid persistently higher mortgage rates.\nWhile the housing market softness persists, the company is well-positioned to benefit from a rebound in housing activity and big-ticket projects. On March 11, Morgan Stanley analyst Simeon Gutman reiterated his Buy rating on the stock with a price target of $450. The analyst believes that the company’s expansion of its Pro customer segment through new capabilities and systems should strongly support revenue growth. As per him, the enhanced supply chain and faster delivery times should improve customer engagement and position the company well for the next housing market cycle.\n10. Cisco Systems Inc. (NASDAQ:CSCO)\nUpside Potential: 25.8%\nMarket Cap: $221 billion\nNumber of Hedge Fund Holders: 84\nCisco Systems Inc. (NASDAQ:CSCO) designs, manufactures, and sells networking hardware, software, telecommunications equipment, and other high-technology services and products. The company’s offerings include routers, switches, cybersecurity solutions, and collaboration tools, serving various industries and customers globally.\nOn March 12, Bank of America Securities analyst Tal Liani reiterated a Buy rating for Cisco Systems Inc. (NASDAQ:CSCO) with a price target of $76. He highlighted positive insights from the company’s CFO and Chief Strategy Officer, which implied growth opportunities in Campus switching and AI infrastructure. According to him, the company’s strong product portfolio positions it well to capitalize on the demand for AI infrastructure build-out. He also noted that the company has already received substantial AI-related orders, which could help it generate higher revenue. Incrementally, Cisco’s recent partnership with Nvidia boosts its opportunities in the expanding AI market.\n9. Chevron Corp. (NYSE:CVX)\nUpside Potential: 25.8%\nMarket Cap: $239 billion\nNumber of Hedge Fund Holders: 81\nChevron Corp. (NYSE:CVX) is an integrated energy company involved in upstream oil and gas exploration, midstream transport, and downstream refining and marketing.\nChevron Corp. (NYSE:CVX) reported a mixed set of Q4 2024 earnings results with revenue of $52.2 billion exceeding expectations, but EPS of $2.06 modestly below estimates. Per guidance in the latest investor communications, the production outlook for 2025 and 2026 remains healthy. The company has guided for 6% annual production growth through 2026, which implies 6%-8% growth in 2025 and 3%-6% in 2026.\nIt also guided for a significant increase in free cash flow (FCF), estimating $10 billion in additional FCF by 2026. The company also guided for capex of between $15 billion for 2025 and $14-$16 billion in 2026. Management expects capex intensity to moderate in the coming years, supporting higher FCF. Share repurchases will also continue to help the share price, as the company expects to maintain annual buybacks of $10-$20 billion.\nOn April 21, the company announced the start of oil and natural gas production from the Ballymore project in the Gulf of America, accelerating its production targets for 2026.\n8. Microsoft Corp. (NASDAQ:MSFT)\nUpside Potential: 28.2%\nMarket Cap: $2.78 trillion\nNumber of Hedge Fund Holders: 317\nMicrosoft Corp. (NASDAQ:MSFT) develops and markets software, hardware, and cloud services. Its flagship products include the Windows operating system, the Microsoft Office suite, and the Azure cloud platform. Additionally, Microsoft owns LinkedIn, GitHub, and Xbox, extending its influence across various industries.\nThe Magnificent Seven stocks, the top 7 mega-cap companies, have been under severe scrutiny amid market volatility, tariff and recessionary pressures, and sanity checks on the eye-popping share price rally based on their AI dominance. All of them have corrected significantly YTD, but Microsoft Corp. (NASDAQ:MSFT) has relatively been doing better with its share price down around 8%.\nMost investors worry about Microsoft’s slow growth in its cloud business, specifically Azure. In its Q2 2025 results, Azure grew 31% year-over-year, and the company also guided for 31%-32% growth in Q3. However, these numbers came in below expectations, leading to concerns about long-term growth. The company has also lowered its capex on cloud infrastructure, leading investors to believe that a growth reset is around the corner.\nDespite these concerns, Microsoft is still delivering solid growth, which is commendable for a company of its size. It remains a consensus Buy with a 1-year median price target of $475, implying a 28% potential upside.\nPiper Sandler analyst Brent Bracelin recently revised his earnings estimates lower for the cloud applications and analytics sector, driven by ongoing macro issues. He also believes that investor confidence in application software names has come down and is hurt because of the slowdown in growth. While he lowered his price target for Microsoft to $435 from $520, he maintained his Overweight rating as he believed that valuation multiples appeared attractive, at their lowest in seven years, despite the relatively lower impact of tariffs on the software industry.\nThe stock was also the best stock among our list of 10 Best Software Stocks to Buy According to Billionaires.\n7. NIKE Inc. (NYSE:NKE)\nUpside Potential: 28.9%\nMarket Cap: $85 billion\nNumber of Hedge Fund Holders: 73\nNIKE Inc. (NYSE:NKE) is the world’s most extensive athletic footwear and apparel seller. Apart from athletic footwear and clothing, it sells equipment, accessories, and services worldwide through its owned retail stores and digital platforms, distributors, and licensees.\nNIKE Inc. (NYSE:NKE) has underperformed this year, with its share price down around 24% YTD. However, in a note published around April 25, Bank of America Securities analyst Lorraine Hutchinson highlights this underperformance as an opportunity because she believes that the stock now fairly factors in all the challenges, such as tariffs and weakening demand in China. Moreover, despite the decline in China sales, she notes that the recent decline in share prices appears to be overdone.\nThe analyst also believes that the company’s strong supply chain would ensure it can offset the tariff pressures by selectively increasing prices across global markets. Lorraine also noted that the company is burning its existing inventory, which should help it focus on further product innovation and increase sales growth. As a result, the analyst reiterated a Buy rating on NIKE Inc. (NYSE:NKE), although with a decreased price target of $80, down from $90 earlier.\nOn April 23, DBS analyst Alison Fok upgraded the stock to a Buy with a price target of $115, substantially above the consensus of $74.\n6. UnitedHealth Group Inc. (NYSE:UNH)\nUpside Potential: 31.2%\nMarket Cap: $391 billion\nNumber of Hedge Fund Holders: 150\nUnitedHealth Group Inc. (NYSE:UNH) is one of the largest health care companies in the world. It provides health insurance and healthcare solutions in the U.S. and globally under the UnitedHealthcare and Optum brands.\nThe company’s Q1 2025 results were modestly weaker, but the outlook was disappointing, which led to substantial turmoil in its share prices (-22% on April 17). Q1 revenue of $109.6 billion came in 2% below expectations, and EPS of $7.2 was around 1.5% below. However, the main negative surprise was the outlook, where the company slashed the adjusted EPS guidance by around 12% to $26.0-26.5, from its earlier guidance of $29.5-$30.0. Investors were quite disappointed by the rare guidance cut as the company has historically guided very conservatively.\nDespite the weaker guidance, Whit Mayo, an analyst from Leerink Partners, corroborated his confidence in the company by maintaining a Buy rating with a price target of $520 in a report published around April 23. As the company’s management is working to adjust its plans according to the rising medical costs, the analyst believes that the company’s long-term prospects are intact and sees a solid potential for recovery in 2026. He also believes that earnings will be supported by Medicare Advantage margin improvement next year. In addition, the analyst saw the current valuation as attractive and thus maintained his Buy rating.\n5. Merck & Co. Inc. (NYSE:MRK)\nUpside Potential: 34.7%\nMarket Cap: $198 billion\nNumber of Hedge Fund Holders: 91\nMerck & Co. Inc. (NYSE:MRK) is a global pharmaceutical company known for its innovations in vaccines, oncology, infectious diseases, and animal health products. The company’s blockbuster drugs, including Keytruda and Gardasil, contribute significantly to its revenue growth.\nIn its Q1 2025 earnings results on April 24, the company reported quarterly revenue of $15.5 billion and adjusted EPS of 2.22, which came in 2%-4% ahead of street expectations. Revenue for its GARDASIL product decreased 41% due to lower demand from China, which led to total revenue falling 2% year over year. The company maintained its 2025 revenue guidance of $64.1-$65.6 billion and guided the adjusted EPS to be between $8.82 and $8.97.\nWhile there are near-term challenges, analysts see it as a fundamentally stronger company, and the consensus opinion on the stock remains broadly positive with substantial upside potential. As evidence, Leerink Partners analyst Daina Graybosch reiterated a Buy rating on the stock on April 25. The analyst was encouraged by the company’s efforts to localize its manufacturing and focus on inventory buildup to offset pressures from potential tariffs. Merck & Co. Inc.’s (NYSE:MRK) strong pipeline and success in recent trials should keep investors positive, despite concerns over the Keytruda 2028 loss-of-exclusivity. Therefore, the analyst maintained his optimistic view.\n4. Amazon.com Inc. (NASDAQ:AMZN)\nUpside Potential: 38.4%\nMarket Cap: $1.92 trillion\nNumber of Hedge Fund Holders: 339\nAmazon.com Inc. (NASDAQ:AMZN) is involved in retail e-commerce, content subscription services (Prime Video), advertising, and cloud computing. The company’s product offerings through its online and offline stores include merchandise and media content acquired for resale and products from third-party sellers. Additionally, Amazon.com Inc. (NASDAQ:AMZN) operates one of the largest data center networks globally through its Amazon Web Services (AWS) division. AWS provides a comprehensive suite of cloud services, including computing power, storage options, and networking capabilities, catering to a diverse range of customers from startups to large enterprises.\nDespite the correction in the Magnificent Seven stocks, Amazon remains a consensus Buy. Analysts still expect the stock to reach $250 in one year, implying over 38% upside potential. In their “Alger Spectra Fund” Q1 2025 investor letter, portfolio managers at investment management company Fred Alger Management highlighted the underperformance of Amazon in Q1 because of tariff concerns and subsequent increase in operational costs and impact on consumer spending. They also highlighted softer Q1 sales guidance and high cloud and AI capex impact on profitability as the reason for the underperformance.\nDespite this, the portfolio managers maintained their confidence in Amazon.com Inc. (NASDAQ:AMZN), driven by its strong fundamentals. The company continues to derive strength from its diversified business model and product and service innovation. They also highlighted the company’s dominant position in high-growth areas like e-commerce and cloud computing as the reason for their optimistic view.\nOn April 25, William Blair analyst Dylan Carden reaffirmed his Buy rating on the company as he believes Amazon.com Inc. (NASDAQ:AMZN) is better positioned to handle the ongoing challenges.\n3. The Walt Disney Company (NYSE:DIS)\nUpside Potential: 42.6%\nMarket Cap: $158 billion\nNumber of Hedge Fund Holders: 108\nThe Walt Disney Company (NYSE:DIS) is a diversified global entertainment company that operates media networks, streaming platforms, parks and experiences, and entertainment studios. The company owns several well-known brands, such as ESPN, Marvel, Pixar, Lucasfilm, and Disney+.\nIn early April, ClearBridge Investments revealed a new position in Disney, per its “ClearBridge Value Strategy” Q1 2025 investor letter. The fund believes the company is progressing well with its streaming service, which could lead to better-than-expected profit margins and earnings. They also highlighted the company’s shift in strategy. As per this change, instead of focusing on aggressive market share gains, the company is now working on improving prices, which should boost profitability.\nIn another vote of confidence for the stock, an analyst at Wolfe Research upgraded Disney to Outperform with a price target of $112 (~23% upside). The analyst highlighted the strength of Disney’s business model amid increasing risks of recession, and that the stock is already factoring in a downturn. He believes the company has a strong positioning in parks, cruises, and streaming businesses, which could support EPS to rise to $7. He also sees the current valuation as compelling because the company trades at a significant discount to the S&P 500.\n2. Salesforce Inc. (NYSE:CRM)\nUpside Potential: 51.7%\nMarket Cap: $241 billion\nNumber of Hedge Fund Holders: 162\nSalesforce Inc. (NYSE:CRM) is a global leader in customer relationship management (CRM) software. Its cloud-based platform provides sales, service, marketing, and commerce solutions, enabling businesses to build stronger customer connections using data and AI. Salesforce’s AI-driven tools, including Einstein, offer predictive insights and automation to boost productivity.\nSalesforce Inc. (NYSE:CRM) is the worst performer in the Dow Jones Index on a YTD basis (-25% as of the close of April 23). Besides the volatility in the technology sector, the underperformance was mainly linked to a softer outlook for next year. For FY 2026, the company guided revenue to be $40.5-$40.9 billion compared to the consensus estimate of $41.5 billion. This was seen as an indication of a slowdown and thus weighed on the share price performance.\nDue to the weaker macro environment, technology stocks, particularly cloud computing stocks, have seen downward revisions in their earnings estimates. For example, Piper Sandler analyst had lowered his estimates and price targets across the cloud applications and analytics sector in a report published around April 23. As part of this exercise, he reduced the price target for Salesforce Inc. (NYSE:CRM) to $315 from $400 but maintained his Overweight rating. At the end of March, analysts from Jefferies had also reduced the price targets across their software coverage to account for compressed valuation multiples. With a Buy rating, he lowered Salesforce’s price target to $375 from $425.\nThe consensus opinion remains bullish on the stock with a 1-year median price target of $375. The company is currently focusing on scaling and expanding its Agentforce tools, which are expected to take time to grow. The company has already reported closing thousands of Agentforce deals and expects a significant revenue contribution next year.\n1. NVIDIA Corp. (NASDAQ:NVDA)\nUpside Potential: 56.8%\nMarket Cap: $2.51 trillion\nNumber of Hedge Fund Holders: 223\nNVIDIA Corp. (NASDAQ:NVDA) is a leading innovator in the design and production of graphics processing units (GPUs), system-on-a-chip (SoC) solutions, and AI-driven hardware and software. The company’s GPUs are essential to high-performance computing, AI training, and inference and serve as the backbone of data center infrastructure worldwide.\nAfter the emergence of China’s DeepSeek, concerns over the efficiency of the huge AI investments, along with market volatility and macroeconomic uncertainty, have kept some investors cautious. However, there is a strong belief that NVIDIA Corp. (NASDAQ:NVDA)‘s long-term investment case remains robust. Its cutting-edge technology drives advancements in artificial intelligence, deep learning, and data analytics, reinforcing the company’s pivotal role in shaping next-generation computing.\nIn their “Alger Spectra Fund” Q1 2025 investor letter, portfolio managers at investment management company Fred Alger Management highlighted the company’s strong prospects based on rising demand for NVIDIA products due to the increasing need for computing power. They stated:\n“We believe Nvidia’s leadership in scaling AI infrastructure, including advancements in inference and reasoning during inference, continues to drive adoption among enterprises and startups, ensuring sustained demand for its high-performance chips and software solutions. As older-generation chips are repurposed and new clusters deployed, we see Nvidia as well-positioned to capitalize on rising computational needs across AI applications.”\nOn April 25, Morgan Stanley analyst Joseph Moore remained highly optimistic on NVIDIA, driven by demand for inference chips. His analysis suggests that this demand is further fuelled by the shortage of inference chips across regions and faster growth in token generation. Such growth bodes well for the company as organizations must invest more into the infrastructure required for such workloads. Despite near-term supply chain and macro issues, the analyst believes the company’s strong positioning in the AI cycle and production capabilities support his optimistic view. He maintained a Buy rating with a price target of $160.\nOverall, NVDA ranks first on our list of the best and worst Dow stocks for the next 12 months. While we acknowledge the potential of Dow stocks, our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns and doing so within a shorter time frame. There is an AI stock that went up since the beginning of 2025, while popular AI stocks lost around 25%. If you are looking for an AI stock that is more promising than NVDA but that trades at less than 5 times its earnings, check out our report about this cheapest AI stock.\nREAD NEXT: 20 Best AI Stocks To Buy Now and 30 Best Stocks to Buy Now According to Billionaires.\nDisclosure: None. Insider Monkey focuses on uncovering the best investment ideas of hedge funds and insiders. Please subscribe to our free daily e-newsletter to get the latest investment ideas from hedge funds’ investor letters by entering your email address below."
    }
  ],
  "argos_summary": "Meta Platforms, Inc. (NASDAQ:META) is gaining attention as a strong investment option, with Hoxton Planning & Management LLC increasing its stake in the company. Loop Capital has reiterated a 'Buy' rating and raised its price target to $980, citing significant revenue growth and a positive outlook driven by AI investments and disciplined cost management. Despite this optimism, some analysts suggest that other AI stocks may offer greater upside potential with less risk.",
  "argos_id": "2247UOOAG"
}