{
  "url": "https://www.usnews.com/news/world/articles/2025-08-12/new-zealand-politician-removed-from-parliament-following-comments-in-palestinian-debate",
  "authorsByline": "Reuters",
  "articleId": "7bc65240336e4b279a69c95aa4483a28",
  "source": {
    "domain": "usnews.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "DC",
      "city": "Washington",
      "coordinates": {
        "lat": 38.8949924,
        "lon": -77.0365581
      }
    }
  },
  "imageUrl": "https://www.usnews.com/dims4/USNEWS/9c24a2c/2147483647/thumbnail/970x647/quality/85/?url=https%3A%2F%2Fwww.usnews.com%2Fcmsmedia%2Fbf%2Fe8d4d015ae0391dc8fe17622ee651f%2Ftag%3Areuters.com%2C2025%3Anewsml_LYNXMPEL7B064%3A12025-08-12T054011Z_1_LYNXMPEL7B064_RTROPTP_3_NEWZEALAND-SAMOA.JPG",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T01:40:00-04:00",
  "addDate": "2025-08-12T05:51:56.369756+00:00",
  "refreshDate": "2025-08-12T05:51:56.369757+00:00",
  "score": 1.0,
  "title": "New Zealand Politician Removed From Parliament Following Comments in Palestinian Debate",
  "description": "US News is a recognized leader in college, grad school, hospital, mutual fund, and car rankings. Track elected officials, research health conditions, and find news you can use in politics, business, health, and education.",
  "content": "WELLINGTON (Reuters) -New Zealand parliamentarian Chloe Swarbrick was ordered to leave parliament on Tuesday during a heated debate over the government's response to Palestine.\n\nAn urgent debate was called after the centre-right government said on Monday it was weighing up its position on whether to recognise a Palestinian state.\n\nClose ally Australia on Monday joined Canada, the UK and France in announcing it would recognise a Palestinian state at a U.N. conference in September.\n\nSwarbrick, who is co-leader of the Green Party, said New Zealand was a “laggard” and an “outlier” and the lack of decision was appalling before calling on some government members to support a bill to “sanction Israel for its war crimes.\" The bill was proposed by her party in March and is supported by all opposition parties.\n\n“If we find six of 68 Government MPs with a spine, we can stand on the right side of history,\" said Swarbrick.\n\nSpeaker Gerry Brownlee said that statement was “completely unacceptable” and she had to withdraw it and apologise. When she refused, Swarbrick was ordered to leave parliament.\n\nBrownlee later clarified Swarbrick could return on Wednesday but if she still refused to apologise she would again be removed from parliament.\n\nNew Zealand has said it will make a decision in September about whether it would recognise Palestine as a state.\n\nForeign Minister Winston Peters told parliament that over the next month the government would gather information and talk to partners, which would inform cabinet’s decision.\n\nLabour parliamentarian Peeni Henare said New Zealand had a history of standing strong on its principles and values and in this case “was being left behind.”",
  "medium": "Article",
  "links": [
    "https://www.usnews.com/news/best-countries/articles/places-the-us-government-warns-not-to-travel-right-now"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "New Zealand",
      "weight": 0.09894172
    },
    {
      "name": "New Zealand Politician",
      "weight": 0.09731788
    },
    {
      "name": "Palestinian Debate",
      "weight": 0.08640241
    },
    {
      "name": "Chloe Swarbrick",
      "weight": 0.08258998
    },
    {
      "name": "Parliament",
      "weight": 0.08244612
    },
    {
      "name": "parliament",
      "weight": 0.08244612
    },
    {
      "name": "Swarbrick",
      "weight": 0.07574805
    },
    {
      "name": "Labour parliamentarian Peeni Henare",
      "weight": 0.07234312
    },
    {
      "name": "Foreign Minister Winston Peters",
      "weight": 0.06973909
    },
    {
      "name": "Palestinian",
      "weight": 0.067488335
    }
  ],
  "topics": [
    {
      "name": "Middle East"
    }
  ],
  "categories": [
    {
      "name": "World"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.9970703125
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.9716796875
    },
    {
      "name": "/Law & Government/Government/Legislative Branch",
      "score": 0.75537109375
    },
    {
      "name": "/Sensitive Subjects/War & Conflict",
      "score": 0.4951171875
    }
  ],
  "sentiment": {
    "positive": 0.043598607,
    "negative": 0.7549018,
    "neutral": 0.20149949
  },
  "summary": "New Zealand parliamentarian Chloe Swarbrick was removed from parliament during a heated debate over the government's response to Palestine. She accused the government of being a \"laggard\" and \"outlier\", while calling for support for a bill to \"sanction Israel for its war crimes\". The debate followed Australia announcing it would recognise a Palestinian state at a U.N. conference in September.",
  "shortSummary": "New Zealand parliamentarian Chloe Swarbrick was removed from parliament for refusing to apologize for her remarks on the Palestinian issue.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "916e8d9a55f64ac28786b84f1dc510bd",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "New Zealand parliamentarian Chloe Swarbrick was expelled from parliament during a debate regarding the government's stance on recognizing a Palestinian state. This debate was prompted by the government's consideration of recognition, following similar announcements from allies like Australia, Canada, the UK, and France. Swarbrick criticized the government for its inaction, calling it a 'laggard' and urging support for a bill to sanction Israel for alleged war crimes, which led to her removal when she refused to apologize for her remarks. The government plans to make a decision on recognizing Palestine in September.",
  "argos_id": "32ZQTH4JD"
}