{
  "url": "https://www.foxnews.com/us/pilot-3-passengers-walk-away-from-fiery-plane-crash-montana-video",
  "authorsByline": "Greg Wehner",
  "articleId": "aa6ab8d564b348c3a1849fe49b45a167",
  "source": {
    "domain": "foxnews.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://static.foxnews.com/foxnews.com/content/uploads/2025/08/montana-plane-crash-pilot-passengers-survive-montana-plane-crash-pilot-passengers-survive-fox-news-001.gif",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T21:59:36-04:00",
  "addDate": "2025-08-12T02:09:46.809801+00:00",
  "refreshDate": "2025-08-12T02:09:46.809803+00:00",
  "score": 1.0,
  "title": "Pilot, 3 passengers walk away from fiery plane crash in Montana: Video",
  "description": "A small plane crashed during landing at Kalispell City Airport in Montana, sliding into a stationary aircraft and destroying both planes in flames Monday afternoon.",
  "content": "Video captured the aftermath of a plane crash at Kalispell City Airport in Montana on Monday, and remarkably, the pilot and three passengers escaped serious injury.\n\nKalispell Fire Department Chief Jay Hagen told Fox News Digital that emergency crews were dispatched shortly after 2 p.m. following reports of the crash.\n\nAn investigation into the crash found that a small plane came in for landing when it crashed and slid into another small plane, causing them to burst into flames.\n\nHagen said the three passengers and pilot on board the plane that crashed were able to get out of the aircraft with minor injuries.\n\nThe chief also said nobody was on the stationary aircraft that the plane crashed into.\n\nIn fact, all the victims were treated on the scene and released.\n\nBoth planes involved were lost completely, he added.\n\nTWO PEOPLE KILLED AFTER HELICOPTER HITS POWER LINE AND CRASHES INTO BARGE ON MISSISSIPPI RIVER\n\nCellphone video taken by witnesses shows the taxiway engulfed in flames and thick black smoke billowing into the air.\n\nIn one clip, a bystander remarks that the plane \"hit the ground and bounced up.\"\n\nLater footage shows the fire nearly extinguished, though the pavement remains coated in soot.\n\nFirefighters from Evergreen, Smith Valley and Whitefish assisted Kalispell crews in dousing flames that spread to adjacent grass.\n\nAccording to Hagen, the quick mutual‑aid response allowed firefighters to smother the blaze with foam within minutes.\n\nBy 4:30 p.m., all crew members had left the scene, he added.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nThe cause of the crash is currently under investigation.",
  "medium": "Article",
  "links": [
    "https://www.foxnews.com/apps-products?pid=AppArticleLink",
    "https://www.foxnews.com/us/small-aircraft-plunges-georgia-neighborhood-leaves-injured",
    "https://www.foxnews.com/category/disasters",
    "https://www.foxnews.com/us/two-people-killed-after-helicopter-hits-power-line-crashes-barge-mississippi-river",
    "https://www.foxnews.com/category/us/us-regions/west/montana",
    "https://www.foxnews.com/category/fires",
    "https://www.foxnews.com/us/plane-crash-off-california-coast-kills-3",
    "https://www.foxnews.com/video/6376811080112"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "fiery plane crash",
      "weight": 0.114264406
    },
    {
      "name": "Kalispell crews",
      "weight": 0.08926086
    },
    {
      "name": "Kalispell Fire Department Chief Jay Hagen",
      "weight": 0.087015465
    },
    {
      "name": "Kalispell City Airport",
      "weight": 0.077014394
    },
    {
      "name": "emergency crews",
      "weight": 0.076728135
    },
    {
      "name": "Kalispell Fire Department",
      "weight": 0.07481204
    },
    {
      "name": "Jay Hagen",
      "weight": 0.07305918
    },
    {
      "name": "thick black smoke",
      "weight": 0.06901637
    },
    {
      "name": "flames",
      "weight": 0.06854695
    },
    {
      "name": "Cellphone video",
      "weight": 0.06791429
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "General"
    }
  ],
  "taxonomies": [
    {
      "name": "/Sensitive Subjects/Accidents & Disasters",
      "score": 0.96533203125
    },
    {
      "name": "/News/Local News",
      "score": 0.873046875
    },
    {
      "name": "/News/Other",
      "score": 0.8408203125
    },
    {
      "name": "/Sensitive Subjects/Death & Tragedy",
      "score": 0.69287109375
    },
    {
      "name": "/Arts & Entertainment/TV & Video/Online Video",
      "score": 0.46630859375
    }
  ],
  "sentiment": {
    "positive": 0.06541313,
    "negative": 0.7005157,
    "neutral": 0.23407121
  },
  "summary": "A plane crash at Kalispell City Airport in Montana left a fiery scene, with the pilot and three passengers walking away with minor injuries. The cause of the crash is currently under investigation. The small plane came in for landing when it crashed and slid into another small plane, causing them to burst into flames. All three passengers and the pilot were treated on the scene and released. Firefighters from Evergreen, Smith Valley and Whitefish assisted in dousing the flames, which were extinguished within minutes.",
  "shortSummary": "A plane crash at Kalispell City Airport in Montana resulted in a fatal collision involving two small planes, with the pilot and three passengers escape serious injuries.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "5a9c3c468f8f4ec390186d4c382e68d7",
  "places": [
    {
      "osmId": "499570785",
      "road": "5th Avenue East",
      "city": "Kalispell",
      "county": "Flathead County",
      "state": "Montana",
      "postcode": "59901",
      "country": "United States",
      "countryCode": "us",
      "coordinates": {
        "lat": 48.1771898,
        "lon": -114.30538613555849
      }
    }
  ],
  "scraped_sources": [
    {
      "url": "https://www.foxnews.com/apps-products?pid=AppArticleLink",
      "text": "Fox News is Everywhere.\nWatch Fox News Channel on all of your devices to keep up to date with the latest in news, politics, entertainment and more. On phones, tablets, wearables and TV, it's easy to stay connected anywhere.\niOS Devices\nAndroid Devices\nApple TV\nRoku\nChromecast\nAndroid TV\nAmazon Fire\nFubo TV\nApple Watch\nAmazon Echo\nGoogle Home\nFox News Go\nApple News\nAT&T TV Now\nYouTube TV\nHulu\nFacebook\nInstagram\nSamsung Devices\nSling TV\nVidgo\nSpotify\niHeartRadio\nFlipboard\nLinkedIn\nGoogle Newsstand\nNewsletters\nYouTube\nFAQ\nHow much data does Fox News Go use?\nFox News Go uses about 2GB per hour of SD viewing and 4GB per hour of HD viewing. This can vary depending on your device and internet connection. If you are concerned about your data usage we recommend not streaming over a cellular network and contacting your Internet or Cellular Service Provider.\nWhat broadcast quality will I get while streaming on my device?\nFox News will stream at the highest quality possible based on your device and internet connection quality. For the best quality we recommend streaming via Wi-Fi or 4G.\nWhat channels are available on Fox News Go?\nYou can Watch Fox News Channel on Fox News Go and Fox Business Channel on Fox Business Go"
    },
    {
      "url": "https://www.foxnews.com/category/fires",
      "text": "Montana 1 hour ago Pilot, 3 passengers walk away from fiery plane crash in Montana: Video A small plane crashed during landing at Kalispell City Airport in Montana, sliding into a stationary aircraft and destroying both planes in flames Monday afternoon.\nVIDEO 3 days ago Tulsi Gabbard gets choked up watching Hawaiian community rebuild 2 years after Lahaina fires National Intelligence Director Tulsi Gabbard commends President Donald Trump's latest peace deal and discusses the people of Hawaii's rebuilding efforts two years after the Lahaina fires on 'The Will Cain Show.'\nWildfire 4 days ago Southern California wildfire grows from 50 acres to over 1,000 acres in just hours Canyon Fire becomes one of four wildfires burning across Southern California on Thursday, forcing evacuations east of Lake Piru as crews battle flames.\nPolice and Law Enforcement 4 days ago Two people killed after helicopter hits power line and crashes into barge on Mississippi River Helicopter crashes into power line and plummets onto Mississippi River barge near Missouri-Illinois border, killing at least two people and sparking a fire.\nNew Jersey August 4 Fire under NJ train sends passengers fleeing; multiple treated for smoke inhalation Several people were treated for smoke inhalation after a fire erupted under an eastbound PATH train at Newport station, suspending Hoboken and JSQ lines.\nVIDEO August 4 NJ train passengers evacuate smoke-filled car PATH train riders in Newport, New Jersey, evacuated as a fire burned under a train car Monday, Aug. 4, 2025. (Joseph Nikhil Reddy via Storyful)\nUS Fires August 3 New Jersey man missing in Grand Canyon 'mega-fire' as search efforts continue week later Thomas Daniel Gibbs, 35, of New Jersey, went missing in the Grand Canyon days before a mega-fire was declared, remaining unaccounted for roughly a week.\nNebraska July 30 Midwest biofuels plant explosion, building collapse leaves 3 dead, including 2 children Three people — a man and his two young daughters — were killed in an explosion at a Nebraska biofuels plant in Fremont, prompting a massive emergency response.\nVirginia July 30 Virginia city councilman doused with gasoline and set on fire in horrific workplace attack, suspect arrested Danville City Council member Lee Vogler hospitalized with burns after gasoline attack at Showcase Magazine office, suspect identified and in police custody.\nVIDEO July 27 'FireFraud!': Palisades resident rips benefit concert organizers for missing relief funds Pacific Palisades resident Rachel Darvish criticizes FireAid for their handling of benefit concert funds after victims have yet to receive aid."
    },
    {
      "url": "https://www.foxnews.com/us/plane-crash-off-california-coast-kills-3",
      "text": "Three people aboard a small airplane were killed over the weekend when the aircraft crashed in the Pacific Ocean off the central California coast, authorities said.\nEmergency crews responded just before 11 p.m. Saturday to reports of a twin-engine Beechcraft carrying three people that went down about 300 yards off Point Pinos in Monterey County, the U.S. Coast Guard (USCG) said.\nThe Monterey County Sheriff’s Office Coroner Unit identified the occupants as Steve Eugene Clatterbuck, 60, of Salinas, James Vincent, 36, of Monterey, and Jamie Lee Tabscott, 44, of Monterey.\nThe Beechcraft B-95-B55 aircraft had taken off from the San Carlos airport at 10:11 p.m. and was last seen at 10:36 p.m. near Monterey, according to flight tracking data from FlightAware.com.\nA witness told AIO Filmz that he heard the plane circling at a low altitude for about 30 seconds before hearing a \"thump.\" Video footage from the scene shows debris from the aircraft scattered along the shoreline.\nCoast Guard boat and helicopter crews, local law enforcement and fire agencies launched a search for the victims. The operation lasted for a combined 13 hours, covering 346 miles of trackline over an area of approximately 100 square miles, USCG said.\nPLANE CRASH IN RUSSIA'S FAR EAST LEAVES 48 DEAD\nA fire boat crew recovered the first body just after 3 a.m. Sunday. Divers found the two other victims inside the fuselage of the aircraft between 6:30 a.m. and 9:10 a.m.\nThe National Transportation Safety Board is investigating the cause of the crash.\nThe Monterey County Sheriff’s Office said the victims’ families have asked for privacy during this time.\nCLICK HERE TO GET THE FOX NEWS APP\n\"The family and friends of the deceased have expressed that they wish to extend their gratitude for the outpouring of support from the community,\" the sheriff’s office said."
    },
    {
      "url": "https://www.foxnews.com/category/disasters",
      "text": "VIDEO 3 hours ago Video shows the aftermath of a fiery plane crash in Kalispell, Montana A pilot and three passengers walked away from a plane crash in Kalispell, Montana that resulted in a fiery scene on Aug. 11, 2025. (Credit: Scott Carpenter/TMX)\nVIDEO 3 hours ago Survivors pulled from rubble after deadly blast rips through steel plant Fox News correspondent Nate Foy reports on an explosion at a Pennsylvania steel plant on 'Special Report.'\nVIDEO 7 hours ago Video shows moment Pennsylvania US Steel plant explodes A video shows the moment the US Steel plant near Pittsburgh exploded on Aug. 11, 2025. (Credit: CREATE Lab/Breathe Project via Storyful)\nVIDEO 14 hours ago Plane wreckage lodged in tree after aircraft crashes into front yard A small plane crashed into the yard of a home outside Atlanta, Georgia, over the weekend. All three passengers onboard were transported to a trauma center. (WANF)\nVIDEO 2 days ago Several passengers plummet after chairlift suddenly collapses in remote Russian resort Several terrified passengers were caught on video plunging into trees and a lake on Friday after chairlift cables suddenly snapped in the foothills of Russia’s Caucasus Mountains. (East2West)\nVIDEO August 3 Boat collides with 20-foot whale off the Jersey Shore A boat collided with a whale off the Jersey Shore on Saturday, killing the 20-foot animal and throwing one passenger overboard. (Credit: Kim Mancini)\nVIDEO August 3 Russian volcano Krasheninnikov spews ash miles into the sky Russian volcano Krasheninnikov erupted for the first time in centuries, sending hot ash miles into the sky. (Credit: Artem Sheldr via AP)\nVIDEO July 31 'Strait to the Heart' organizer touts 'over $5 million' raised for Texas flood victims Concert organizer Tom Cusick joins 'Fox Report Weekend' to share his experience helping Texas flood victims by creating a benefit concert with legendary country artist George Strait.\nVIDEO July 30 Nebraska mayor discusses deadly biofuel plant blast Fremont Mayor Joey Spellerberg confirmed an employee and his two young daughters were killed in an explosion Tuesday at Horizon Biofuels.\nVIDEO July 30 'This should have never happened': DC crash victim's brother speaks out ahead of NTSB hearings Brother of DC plane crash victim Dailey Crafton joins 'Fox & Friends First' to discuss the loss of his brother Casey ahead of the National Transportation Safety Board hearings for the mid-air collision that killed 67."
    },
    {
      "url": "https://www.foxnews.com/category/us/us-regions/west/montana",
      "text": "Montana 43 mins ago Pilot, 3 passengers walk away from fiery plane crash in Montana: Video A small plane crashed during landing at Kalispell City Airport in Montana, sliding into a stationary aircraft and destroying both planes in flames Monday afternoon.\nManhunt 14 hours ago Special Forces vet exposes tactics of Montana, Washington state survivalists: 'Can't stay hidden forever' Former soldier Michael Brown was on the run while Travis Decker evades a massive manhunt following Montana bar shooting and Washington child murders as authorities deploy.\nCrime 1 day ago Rural Montana residents predicted bar massacre suspect's violent outburst: 'He will kill you' Michael Paul Brown was on the run after allegedly shooting four people at The Owl Bar in Anaconda, Montana, with police searching rugged mountain terrain\nCrime 2 days ago A timeline of the manhunt for rural Montana bar massacre suspect as a small town hopes for closure Massive manhunt ended Friday for Michael Paul Brown, suspected in a bar massacre that claimed four lives in the western Montana town of Anaconda over a week ago\nCrime 2 days ago Mugshot of rural Montana bar massacre suspect released after week-long manhunt Montana authorities capture quadruple homicide suspect Michael Brown just miles from The Owl Bar crime scene where four victims died in small town attack\nHomicide 3 days ago Army veteran arrested after week-long manhunt following deadly Montana bar massacre that killed 4 people The suspect wanted in a Montana mass shooting last week has been arrested.\nCrime 6 days ago Montana fugitive's brother serving life sentence for separate murder conviction in same town Montana fugitive Michael Paul Brown, wanted for alleged killing of four bar patrons, has a brother William Brown currently serving life in prison for murder in Arizona\nManhunt August 4 Montana manhunt expands for ex-soldier suspect seen with stolen survival gear after bar massacre Montana authorities expand manhunt for Michael Paul Brown, 45, accused of killing four people at Owl Bar Friday night, with suspect still at large Monday.\nMontana August 4 Montana bar shooting suspect could return to town, state AG says, citing 'concern for the public' Fugitive Army veteran Michael Brown remains at large after allegedly shooting four people at The Owl Bar in Anaconda, Montana, prompting a massive manhunt.\nMontana August 3 Victims of Montana bar shooting identified as manhunt for military veteran suspect continues Manhunt continues for Michael Brown after fatal shooting at Anaconda bar left four residents dead. The suspect was last seen barefoot and shirtless.\nMontana August 2 Manhunt intensifies for Army veteran suspected of killing 4 in bar shooting after truck found abandoned Police searched mountains near Anaconda for armed suspect Michael Paul Brown after a deadly shooting at a bar left four victims dead Friday.\nMontana August 1 Gunman shoots at least 4 people dead at Montana bar, authorities launch intensive manhunt FBI assists Montana police in search for shooting suspect Michael Paul Brown who remains at large after attacking multiple people at local business.\nUS July 11 Tragedy strikes at popular national park as climber meets fatal end on mountain National Park Service officials confirmed a fatal climbing accident at Glacier National Park where a 42-year-old man fell while descending a steep, off-trail route.\nMontana May 6 Red-state governor shoots down bill banning this common hospitality industry item Montana Gov. Greg Gianforte vetoes legislation that would largely ban Styrofoam containers, dubbing it “textbook government overreach.\"\nPolitics April 25 REAL ID sees nationwide state government compliance ahead of deadline, but it wasn't always that way Several states originally objected to REAL ID requirements, but all have since come into compliance ahead of the deadline, according to federal officials.\nSecond Amendment April 23 WATCH: Red state gov urges firearms makers to ditch Colorado amid its anti-gun push Republican Gov. Greg Gianforte is inviting gun manufacturers and sellers to move to Montana from Colorado after Democrats there passed one of the nation's most restrictive gun laws.\nTaxes March 31 GOP governor rallies around historic proposal to slash state's income tax: 'I am optimistic' Montana is considering making cuts to its individual income tax rate as a growing number of states have completely transitioned to eliminating the tax altogether.\nPolitics March 26 Cutting the 'green tape': Conservation group offers top 10 ways for Dept of Interior to streamline PERC, a market-solutions based conservation group, is recommending 10 top initiatives for the Interior Department to cut \"green tape.\"\nPolitics March 17 VA Sec claps back at ‘fake news’ critics, defends DOGE: Unveils 4th new healthcare facility Veterans Affairs Secretary Doug Collins, a colonel in the USAF reserves, said critics of the administration and its cuts to the federal workforce are wrong, pointing to a new facility in Virginia.\nMontana March 8 Former Democrat Senator Jon Tester admits 'men shouldn't play in women's sports' after losing re-election Former Montana Senator Jon Tester said he agreed with Gavin Newsom's recent comments that allowing trans athletes in women's and girls' sports is 'deeply unfair.'\nPolitics January 10 Montana AG asks Supreme Court to uphold law requiring parental consent for a minor's abortion Montana AG Austin Knudsen petitioned the U.S. Supreme Court to uphold a parental consent law for minors' abortions that his state's high court struck down last year.\nMontana December 18 Montana judge temporarily blocks rules banning transgender people from changing sex on state documents A state judge in Montana temporarily blocked a state rule that prevents transgender people from changing the sex designation on their birth certificates and driver’s licenses.\nOpinion December 17 Here's how DOGE can help save lives, money from wildfires As an aerial firefighter myself, I know firsthand the devastation wildfires cause and have a unique perspective on how the federal government has failed on this issue.\nMontana December 13 Montana Supreme Court blocks ban on transgender surgeries, prompting outcry from GOP lawmaker, supporters A Montana Republican lawmaker is criticizing a state Supreme Court's decision to continue blocking a ban on transgender surgeries for minors.\nPolitics December 6 Incoming GOP senator reveals how he will 'strap rocket-boosters' to Trump's agenda in new Congress GOP Sen.-elect Tim Sheehy spoke to Fox News Digital about the issues he plans to prioritize when he is sworn in as a member of the Senate next month.\nSenate December 3 Recently ousted Dem senator said he's 'getting the f--- out of here' when asked about presidential pardon Recently ousted Sen. Jon Tester delivered an eyebrow raising response to reporters when asked about the president's controversial pardon of his son, Hunter Biden.\nEnvironment December 2 Biden blocks new mining in region that produces about 40% of nation's coal: 'It's a disaster' The Biden administration is blocking mining in a key region that produces nearly half of the nation's coal over alleged \"climate change\" concerns.\nTrue Crime November 29 Suspect accused in dad's camping murder 'cut off' from self-defense claim after backtracking on confession The suspect in the murder of a Montana dad and avid outdoorsman pleaded not guilty Tuesday after allegedly claiming self-defense in his confession to police.\nTravel November 25 Tranquil hot springs around the US you can visit this winter to find warmth even on the coldest days There are hot springs all around the United States that provide full relaxation and beautiful views. This winter, escape the cold by planning a trip to one of these destinations.\nPolitics November 21 Transgender women are 'every bit as 'biologically female' as cis women,' bisexual, trans state lawmaker claims Montana state Rep. Zooey Zephyr claims transgender women are just as much \"'biologically female' as cis women.\""
    },
    {
      "url": "https://www.foxnews.com/us/small-aircraft-plunges-georgia-neighborhood-leaves-injured",
      "text": "A late-night training flight ended in chaos when a small plane plummeted into the front yard of a suburban residence near Atlanta over the weekend.\nThe incident in Brookhaven, Georgia, sent all three passengers onboard to the hospital shortly after midnight on Saturday, according to officials.\nPhotos of the incident show the mangled wreckage lodged in a tree, with fragments dangling in branches and electrical cables.\nPower briefly went out in the neighborhood, FOX 5 Atlanta reported. However, no homes were damaged and no one on the ground was hurt, police told Fox News Digital on Sunday.\nFLORIDA SMALL PLANE CRASH CAPTURED ON DRAMATIC HOME SECURITY VIDEO\n\"Officers quickly removed all three occupants from the aircraft and began providing first aid,\" Brookhaven police said. \"There were no injuries to anyone on the ground.\"\nThe conditions of the three passengers have not been released. Police told FOX 5 that they were conscious, alert and breathing when they were transported to a local trauma center.\nDELTA PLANE WING FLAP LANDS IN HOMEOWNER'S DRIVEWAY\nOfficials said the plane, registered to a local flight school, departed from Peachtree-DeKalb Airport late Friday. It flew 70 miles and returned to perform several \"touch-and-go\" landings, a standard practice for flight training, the local station reported.\nThe plane, however, struck several trees and electrical wiring before crashing onto a road, the National Transportation Safety Board told Fox News Digital on Sunday.\nTENNESSEE SKYDIVING PLANE CRASHES MOMENTS AFTER TAKEOFF, LEAVING MULTIPLE PASSENGERS INJURED\nDeKalb County Fire Department and the DeKalb American Medical Response team also responded to the scene, according to the police.\nCLICK HERE TO GET THE FOX NEWS APP\nThe NTSB will be coordinating with the Federal Aviation Administration to conduct an investigation into the crash.\nThe plane and all the debris were removed from the yard by early Saturday afternoon, police said."
    }
  ],
  "argos_summary": "A small plane crashed during landing at Kalispell City Airport in Montana, colliding with a stationary aircraft and causing both to catch fire. Fortunately, the pilot and three passengers on board escaped with minor injuries, while no one was injured on the stationary plane. Emergency crews quickly extinguished the flames, and an investigation into the cause of the crash is underway.",
  "argos_id": "3Y57OGYWI"
}