{
  "url": "https://www.usmagazine.com/celebrity-moms/news/emma-stone-praises-daughter-louise-jean-in-candid-motherhood-update/",
  "authorsByline": "Johnni Macke",
  "articleId": "95f24fe00881444dbb5ea9a61d87029f",
  "source": {
    "domain": "usmagazine.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://www.usmagazine.com/wp-content/uploads/2025/08/Emma-Stone-Gives-Rare-Update-on-Motherhood-Theres-Nothing-I-Feel-Luckier-About-GettyImages-2222365990.jpg?crop=0px%2C123px%2C2000px%2C1051px&resize=1200%2C630&quality=86&strip=all",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T20:11:06-04:00",
  "addDate": "2025-08-12T00:18:48.692300+00:00",
  "refreshDate": "2025-08-12T00:18:48.692304+00:00",
  "score": 1.0,
  "title": "Emma Stone Praises Daughter Louise Jean in Candid Motherhood Update",
  "description": "Emma Stone shared a rare update about raising daughter Louise Jean and how motherhood has changed her life and acting career",
  "content": "Emma Stone is an Oscar-winning actress, but her role as mom to daughter Louise Jean is her favorite gig yet.\n\n“There’s nothing I feel luckier about,” Stone, 36, told Vogue in an interview published on Monday, August 11, of raising her 4-year-old daughter. “She’s the greatest gift of my life, for sure.”\n\nThe Bugonia actress explained that after welcoming her little girl with husband Dave McCary in March 2021, her approach to acting has changed.\n\n“It’s streamlined everything,” Stone said, noting that she now has to weigh whether a job will take her away from Louise Jean for a prolonged timeframe. “It’s a clichéd thing to say, but it changes everything. And simplifies everything.”\n\nThe La La Land actress also got real about how motherhood has strengthened her skills on camera — if at all.\n\n“I do think it unlocks different things,” she shared. “I don’t know if it’s specifically that, but I feel everything I could possibly feel, because everything has exploded.”\n\nStone and McCary, 40, have kept much of their relationship private since they were first linked in 2017 after working together on Saturday Night Live one year prior. The pair’s paths crossed in December 2016 when the actress hosted SNL for the third time and McCary directed one of her sketches.\n\nThe Easy A actress announced their engagement in December 2019, sharing a sweet selfie that highlighted her ring.\n\nLess than one year later, Stone and McCary sparked speculation that they secretly tied the knot earlier in 2020 after they were both seen wearing rings on their left hand.\n\nAs the couple remained quiet about their marital status, Us Weekly confirmed in January 2021 that they were expecting their first baby.\n\n“She seems very happy and very excited about becoming a mother — she’s constantly oohing and cooing,” a source exclusively told Us of Stone at the time. “She looks great, she looks healthy, she’s glowing. She’s been keeping up with friends and work lately, she’s always staying active and gets her daily exercise in.”\n\nNews broke in March 2021 that Stone and McCary had welcomed their little girl, but the pair continued to keep their home life out of the limelight.\n\nHowever, when Stone won her second Oscar for Best Actress in a Leading Role in 2024 for her part in Poor Things, she gave a shout-out to her daughter.\n\n“I know I have to wrap up, but I really just want to thank my family,” Stone said in March 2024. “My mom, my brother Spencer, my dad, my husband, Dave, I love you so much. And most importantly, my daughter who is going to be 3 in three days and has turned our lives technicolor. I love you bigger than the whole sky, my girl.”",
  "medium": "Article",
  "links": [
    "https://www.usmagazine.com/celebrities/emma-stone/",
    "https://www.usmagazine.com/celebrity-moms/news/emma-stone-gives-birth-welcomes-1st-child-with-husband-dave-mccary/",
    "https://www.usmagazine.com/shows/saturday-night-live/",
    "https://www.usmagazine.com/entertainment/pictures/emma-stone-through-the-years/",
    "https://www.usmagazine.com/celebrity-news/news/inside-brandon-blackstocks-final-months-at-his-montana-ranch/",
    "https://www.usmagazine.com/celebrity-moms/news/emma-stone-is-pregnant-expecting-1st-child-with-dave-mccary/",
    "https://www.vogue.com/article/emma-stone-september-cover-2025-interview",
    "https://www.usmagazine.com/entertainment/news/emma-stone-wins-best-actress-thanks-daughter-at-2024-oscars/",
    "https://www.usmagazine.com/celebrity-news/news/brandon-blackstock-cause-of-death-revealed-after-cancer-battle/",
    "https://www.usmagazine.com/entertainment/news/emma-stone-husband-dave-mccary-attend-snl-50-anniversary-special/",
    "https://apple.news/TdBoH5or6Q0afHo2MxaGA6A",
    "https://www.usmagazine.com/celebrity-news/pictures/emma-stone-husband-dave-mccarys-relationship-timeline/",
    "https://www.amazon.com/MEROKEETY-Womens-Summer-Striped-Pockets/dp/B085WKKJ9V?&linkCode=sl1&tag=dotd-merokeety-striped-shirt-dress-sale-8-11-25-20&linkId=f7feced7a5edeb9678c4a84f1b3dacde&language=en_US&ref_=as_li_ss_tl",
    "https://www.usmagazine.com/celebrity-news/news/emma-stone-is-secretly-married-to-fiance-dave-mccary/",
    "https://www.usmagazine.com/entertainment/news/billy-joels-ex-wife-elizabeth-weber-on-their-relationship-now/",
    "https://www.usmagazine.com/celebrity-news/news/emma-stone-used-oxygen-tank-during-sex-scenes-in-easy-a-20101412/",
    "https://news.google.com/publications/CAAqBwgKMM7UwQEwjJAU?hl=en-US&gl=US&ceid=US%3Aen",
    "https://www.usmagazine.com/entertainment/news/is-prime-videos-upcoming-period-drama-the-next-game-of-thrones/",
    "https://www.usmagazine.com/celebrity-news/news/emilie-kiser-son-triggs-death-redacted-police-report-details/",
    "https://www.usmagazine.com/celebrity-moms/news/why-emma-stone-went-back-to-work-after-welcoming-daughter/"
  ],
  "labels": [
    {
      "name": "Pop Culture"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Daughter Louise Jean",
      "weight": 0.09128081
    },
    {
      "name": "daughter Louise Jean",
      "weight": 0.09128081
    },
    {
      "name": "Emma Stone",
      "weight": 0.089897625
    },
    {
      "name": "Stone",
      "weight": 0.08870113
    },
    {
      "name": "husband Dave McCary",
      "weight": 0.081644416
    },
    {
      "name": "Louise Jean",
      "weight": 0.07849811
    },
    {
      "name": "Dave McCary",
      "weight": 0.07726117
    },
    {
      "name": "McCary",
      "weight": 0.06870441
    },
    {
      "name": "Poor Things",
      "weight": 0.062218126
    },
    {
      "name": "different things",
      "weight": 0.060269024
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.9970703125
    },
    {
      "name": "/News/Gossip & Tabloid News/Other",
      "score": 0.9013671875
    },
    {
      "name": "/Arts & Entertainment/Movies/Other",
      "score": 0.76318359375
    },
    {
      "name": "/People & Society/Family & Relationships/Family/Other",
      "score": 0.66259765625
    },
    {
      "name": "/Arts & Entertainment/TV & Video/TV Shows & Programs",
      "score": 0.385498046875
    }
  ],
  "sentiment": {
    "positive": 0.32568082,
    "negative": 0.28233537,
    "neutral": 0.39198384
  },
  "summary": "Oscar-winning actress Emma Stone has praised her daughter, Louise Jean, in an interview with Vogue. She explained that her approach to acting has changed after giving birth to her daughter in March 2021. Stone and husband Dave McCary have kept their relationship private since their first relationship in 2017. The couple announced their engagement in December 2019 and later secretly tied the knot in 2020. The actress also shared her thoughts about motherhood and her future in acting.",
  "shortSummary": "Emma Stone praised her 4-year-old daughter Louise Jean as a \"great gift\" and discussed how motherhood has transformed her life, balancing work, family, and personal life.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "0d16fb302bf2444db1593620eb26f9c6",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.usmagazine.com/celebrity-news/news/emma-stone-is-secretly-married-to-fiance-dave-mccary/",
      "text": "A pandemic couldn’t stop them from solidifying their love! Emma Stone and her fiancé, Dave McCary, reportedly tied the knot, according to People.\nThe couple were initially set to exchange vows earlier this year. However, the coronavirus pandemic forced them to postpone their nuptials.\nStone, 31, prompted wedding speculation in May when she made a virtual appearance on Reese Witherspoon’s Hello Sunshine series. In addition to wearing a gold band on her left hand, she gave an interesting reply after her fellow guest, psychiatrist Dr. Harold Koplewicz, mentioned what it is like to “marry an anxious man.” She responded, “Thankfully, I didn’t do that.”\nEarlier this month, the twosome were spotted wearing gold wedding bands while out for a walk in Los Angeles.\nStone and McCary, 35, announced their engagement in December 2019. The former Saturday Night Live writer shared the happy news by posting an Instagram photo of himself and the Oscar winner showing off her engagement ring. He captioned the shot with a simple pink heart emoji.\nThe couple celebrated their relationship milestone with Amy Schumer, her husband, Chris Fischer, and more friends in New York City in December 2019. “These people love Times Square year round,” the Trainwreck star, 39, wrote of the group pic, in which the newly engaged pair beamed.\nStone and McCary were first linked in June 2017. Their romance was confirmed by Page Six in October 2017.\nThe Easy A star and the director have kept their relationship relatively private for three years. However, a few instances of PDA cropped up during their outings together.\nThe duo were “attached at the hip” while attending a roller-skating party in Los Angeles in December 2018, according to a source. “They stood right next to the stage in their skates for all of Haim’s set, dancing together and singing along,” an eyewitness told Us at the time. “At one point, they slow-danced to a somewhat upbeat song. He initiated and she excitedly followed. They held hands [with] his other hand around her waist and hers around his shoulders.”\nMcCary and the Crazy, Stupid, Love actress were just as flirty while sharing a table with her pal Taylor Swift and the 30-year-old singer’s boyfriend, Joe Alwyn, at a Golden Globes afterparty in January 2019. “Emma and Dave were super touchy-feely and affectionate, which seemed to make Taylor more comfortable doing the same with Joe,” an onlooker revealed. “It seemed like a very fun and light-hearted date night.”\nStone previously dated her Amazing Spider-Man costar Andrew Garfield on and off from 2011 to 2015. The exes have remained friends since their split."
    },
    {
      "url": "https://www.usmagazine.com/entertainment/news/billy-joels-ex-wife-elizabeth-weber-on-their-relationship-now/",
      "text": "Billy Joel’s ex-wife Elizabeth Weber is opening up about where she stands with the famed singer after their infamous affair and nearly decade-long marriage.\n“If I wanna talk to him or if I have something to say, I am able to contact him whenever I want to,” Weber exclusively told Us Weekly on Friday, August 8. “But he has a wife and he has children and right now, he’s struggling with something that’s… that’s a big thing.”\nIn May, Joel, 76, canceled the remaining dates of his 2025 tour after revealing he had been diagnosed with normal pressure hydrocephalus, a brain condition in which an abnormal amount of cerebrospinal fluid builds up, causing walking, memory, balance and bladder control problems.\n“So, [our relationship] is as close as it needs to be for two people who decided to divorce 40 years ago,” Weber continued, adding that “of course” she reaches out to her ex amid his health diagnosis.\nWeber first met Joel when she was married to his best friend and former bandmate, Jon Small. The pair engaged in a subsequent affair, which led to the band breaking up and Joel battling a severe depression that included two suicide attempts. (The affair and its aftermath were discussed in the two-part HBO documentary Billy Joel: And So It Goes, which premiered in July.)\nThe pair later reconnected after Weber’s divorce and married in 1973, going on to spend nearly 10 years together before ending their marriage in 1982. Joel went on to marry Christie Brinkley in 1985, welcoming daughter Alexa Ray Joel before calling it quits in 1994. Joel then married cookbook author Katie Lee in 2004 — the pair divorced five years later in 2009. In 2015, Joel married Alex Roderick. The pair share two children, Della Rose Joel and Remy Anne Joel.\nWeber, for her part, shares a son, Sean Weber-Small, with her first husband.\nWhile speaking with Us, Weber said that her son and her grandchildren also know and are even somewhat close to Joel.\n“I have my grandchildren that he knows and they know him,” she explained. “My granddaughter Ella taught Bill what TikTok was and showed him what was happening. And his relationship with Sean is important to both of them.”\nShe added, “So, we’re not distant but we’re, you know, and he lives in Florida and I live in California. But it’s all good. “\nWeber said that her son Sean and Joel “were very close,” adding that during their marriage the three “lived on top of the mountain.”\n“We entertained each other,” she explained. “Bill and I worked all day long and the whole writing process was never done — in the years that Bill and I were together — was never done remotely or in [a] studio. It happened in our living room, and Sean was an integral part.”\nIf you or someone you know is struggling or in crisis, help is available. Call or text 988 or chat at 988lifeline.org."
    },
    {
      "url": "https://www.usmagazine.com/entertainment/news/is-prime-videos-upcoming-period-drama-the-next-game-of-thrones/",
      "text": "Game of Thrones wrapped up its eight-season run in 2019, and there have been a few contenders to be the next GoT, including the prequel series House of the Dragon.\nHowever, Amazon Prime Video‘s upcoming miniseries King & Conqueror is giving off some serious Game of Thrones vibes, and there isn’t a dragon in sight.\nThis story is based on the conflict between Harold Godwinson and William the Conqueror in 1066 for the throne of England.\nWhile only a few previews have been released so far, Watch With Us is sharing three reasons to watch King & Conqueror when it debuts on Prime Video later this year.\nThe ‘Game of Thrones’ Connection\nIf you thought William the Conqueror looked familiar in the trailer, you’re not wrong. Game of Thrones‘ Nikolaj Coster-Waldau — who portrayed Jaime Lannister on the series — is playing William on this show. William is a vastly different character from the one that Coster-Waldau played for eight seasons, but the actor just seems to fit in well within a medieval setting.\nJames Norton is also leading the cast as William’s rival, Harold Godwinson. The rest of the performers include several veteran British actors, including Clémence Poésy, Emily Beecham, Luther Ford and Eddie Marsan. They may not be household names in America, but that’s a solid cast by any standard.\n‘King & Conqueror’ Looks Like It Has High Production Values\nAdmittedly, we haven’t seen a lot of trailers from King & Conqueror yet, so our impressions may change. But even from the early look at the show, it looks like a big budget was spent to bring this show to life in a convincing way.\nEverything from the costumes to the battle scenes suggests that King & Conqueror is going all-out with its production. It may not hit on the same level as last year’s incredible Shogun adaptation, but it seems very promising for now.\nThe Series Will Tackle One of the Most Famous Battles in History\nUnless you’re a student of history, you may not be familiar with the Battle of Hastings. Nearly a thousand years later, that battle is still considered to be one of the bloodiest encounters in English history. William and Harold’s forces met on the battlefield, and the winner went on to rule the country and consolidate their power.\nHistorical details about what happened at the Battle of Hastings are incomplete, and there are also conflicting accounts. So there will probably be some creative liberties taken with it. But we do know how it ends, and it should be entertaining to see this fight play out.\nKing & Conqueror will premiere on Prime Video later this year."
    },
    {
      "url": "https://www.usmagazine.com/celebrity-moms/news/emma-stone-is-pregnant-expecting-1st-child-with-dave-mccary/",
      "text": "Emma Stone has a bun in the oven! The actress is pregnant with her and Dave McCary’s first child, Us Weekly can exclusively confirm.\n“She seems very happy and very excited about becoming a mother — she’s constantly oohing and cooing. She looks great, she looks healthy, she’s glowing,” a source tells Us. “She’s been keeping up with friends and work lately, she’s always staying active and gets her daily exercise in.”\nIn photos obtained by the DailyMail, Stone was spotted cradling her growing baby bump on a walk with a friend in Los Angeles on December 30. She sported all black and a white mask during the outing.\nThe La La Land star, 31, started dating the Saturday Night Live writer and segment director, 35, in October 2017. The couple got engaged two years later.\nMcCary announced the news with an Instagram selfie in December 2019. In the social media upload, the Oscar winner grinned showing off her engagement ring.\nThe couple sparked speculation in May that they had tied the knot when the Arizona native swapped her diamond out for a gold band during an appearance on Reese Witherspoon’s Hello Sunshine series. Four months later, she and McCary were spotted out in L.A. both wearing matching bands. They reportedly tied the knot in September.\nIn August 2018, Stone spoke to Elle about her and the California native’s future family plans. “My perspective about kids has changed as I’ve gotten older,” the Golden Globe winner told Jennifer Lawrence at the time. “I never babysat or anything. As a teenager, I was, like, ‘I’m never getting married, I’m never having kids.’ And then I got older and I was, like, ‘I really want to get married, I really want to have kids.’”\nThe Battle of the Sexes star explained that she changed her mind because of her age, noting, “It’s the turning 30 thing where you’re, like, ‘I’m not that young. I’m young, but I’m not that young.’”\nBefore her relationship with McCary, Stone dated her Amazing Spider-Man costar Adam Garfield. The former couple were together from 2010 to 2015.\nThe actor, 37, told Vanity Fair in 2016 that he and his ex-girlfriend still “care[d] about each other.” The Los Angeles native explained, “That’s given, that’s kind of an unconditional thing. There’s so much love between us and so much respect. I’m her biggest fan as an artist. So for me, it’s been bliss to be able to watch her success and watch her bloom into the actress that she is. And it’s been wonderful to have that kind of support for each other. It’s nothing but a beautiful thing.”\nHear the Us Weekly editors break down the most surprising celebrity births during the pandemic in under 2 minutes!"
    },
    {
      "url": "https://www.usmagazine.com/shows/saturday-night-live/",
      "text": "Saturday Night Live\nSaturday Night Live (SNL) premiered on NBC in October 1975 and was created by Lorne Michaels. The late-night comedy sketch show is broadcasted live from New York and has introduced iconic catchphrases and characters to pop culture — from Billy Crystal’s “You look mahvelous” to Rachel Dratch’s “Debbie Downer.”\nEvery episode has a celebrity host and a musical guest, with Harry Styles, Britney Spears, Taylor Swift, Sir Elton John among those who have graced the NYC studio’s stage through the years. The show usually consists of comedy sketches, the satirical “Weekend Update” segment covering current events, commercial spoofs, digital shorts and more.\nSNL has helped launch the careers of many cast members, including Bill Murray, Eddie Murphy, Chris Rock, Mike Myers, Adam Sandler, Chris Farley, David Spade, Pete Davidson, Tina Fey, Amy Poehler and Kristen Wiig. Certain sketches have even been turned into feature films, such as 1980’s The Blues Brothers and 1992’s Wayne’s World.\nSince its inception, SNL has won 93 Primetime Emmy Awards, six Writers Guild of America Awards and three Peabody Awards. In 2000, the show was inducted into the National Association of Broadcasters Hall of Fame. Seven years later, it was listed as one of Time’s “100 Best TV Shows of All-TIME.”"
    },
    {
      "url": "https://www.usmagazine.com/celebrity-moms/news/why-emma-stone-went-back-to-work-after-welcoming-daughter/",
      "text": "Life has been a juggling act for Emma Stone since welcoming daughter Louise with husband Dave McCary in March 2021.\nBut the Oscar winner — who’s been busy filming multiple projects since becoming a mom, including the upcoming black comedy Poor Things — has managed to handle it seamlessly.\n“For Emma, quitting acting and being a stay-at-home mom would be like cutting off one of her limbs. That’s just not her,” a source exclusively shares in the new issue of Us Weekly, on newsstands now. “Acting is as vital to her as breathing, it’s a part of who she is — and Dave’s 100 percent behind her.”\nStone, 34, and McCary, 38, met in December 2016 during her stint as a host on Saturday Night Live. (The Easy A actress starred in a sketch that the comedian wrote). They got engaged three years later and secretly tied the knot in 2020.\nLater that year, Stone opened up to Entertainment Tonight about creating a family with McCary. “I feel pretty good about starting my own pack. Although I don’t think that my pack would be quite as physically capable as the Croods are,” she said, referring to her animated movie Croods. “They’re pretty rough and tumble and I don’t know if my pack would be as rough and tumble.”\nAfter Stone gave birth months later, an insider told Us exclusively that having a baby “brought them closer in a way they never expected.” The insider added that McCary was very “hands-on and helping with their daughter.”\nNow that Stone’s gone back to work, “she and Dave are happy as a couple and one of the reasons why is they respect each other as artists,” the source tells Us, noting that while being a working mom does have its challenges, Stone has got “a great set-up.”\n“She’s able to bring Louise to the set with her and that makes a huge difference,” the source continues. Plus, “there is no shortage of people in her circle willing to help with Louise — and Emma is grateful to them.”\nMost importantly, she’s got McCary. “They love their little family. Louise has brought them so much joy and they’re growing and learning every day,” shares the source. “They’re in this together. Emma still has the Hollywood ambition and drive and determination to do her best work and it keeps her going, and she believes doing what she loves will also make her a better mom.”"
    },
    {
      "url": "https://www.usmagazine.com/celebrity-news/news/emilie-kiser-son-triggs-death-redacted-police-report-details/",
      "text": "New details surrounding the drowning death of Emilie and Brady Kiser’s son Trigg, 3, have emerged following the release of the redacted police report.\nThe documents, obtained by Us Weekly on Friday, August 8, detail the events that led up to Trigg’s death on May 18 after he was pulled unconscious from a pool at the influencer’s home in Arizona.\nAlthough details of the security footage were redacted, the Chandler Police Report noted there were discrepancies between what the footage showed and Brady’s initial recollection of events. The report also noted that the pool was unsecured at the time of the incident and that the toddler was not adequately supervised while outside playing near the uncovered pool and did not know how to swim.\nThe police report noted that Trigg had exited the home without being accompanied by a supervising adult and Brady was “aware” that his son was playing outside alone.\nAccording to the report, Brady, 28, told officers at the scene who arrived after he called 911 that Trigg had been out of his sight for around “three minutes” or “five minutes” before he saw him in the pool and immediately jumped in to pull him out.\nPer Brady’s statement, he told an officer, “I didn’t have a clock, obviously, I don’t know the exact time, but it was moments, it wasn’t minutes, it was moments, it wasn’t that he’d been out of sight for long.”\nHowever, the police report also noted that the security footage did not appear to line up with Brady’s versions of events. Discrepancies included how long Trigg was outside before Brady checked on him and Brady reporting instances that did not occur on the surveillance camera such as saying he saw Trigg “playing on the grass.” Due to this, a second interview with Brady was undertaken.\nFollowing the second interview with Brady, the report concluded, “This tragic incident was the result of [Trigg] being in the backyard unsupervised while playing around the unsecured pool and unable to swim. It is clear from the video that he did not go into the water intentionally, rather he tripped and fell in while playing with an inflatable chair.”\nThe Chandler Police Department conclusion continued: “[Redacted] was in the backyard from 18:29:42 hours until Brady found him in the pool at 18:39:00 hours. He was in the water from 18:32:15 until 18:39:07. It is clear Brady’s attention was divided, and he was not watching at all during the critical times mentioned. During two interviews he did not know what was doing before he fell in and did not see [redacted] struggling to swim.”\nIn other statements to the Chandler Police Department, both Brady and Emilie, 26, noted that Trigg had limited swimming skills.\nBrady told police that Trigg had taken some lessons and “knows how to kick his feet and swing his arms…but he’s not proficient.” He added that his son “knows not to go in the water without us.”\nMeanwhile, Emilie also confirmed Trigg had taken some lessons but “didn’t fully know how to swim.” She added he knew “how to swim to us and he knew how to climb the wall, but where he fell in there was no wall.”\nThe documents also noted that there was no cover securing the pool at the time of the incident. Brady and Emilie both noted they usually use a “Katchakid” safety net, but this was not in place at the time of the incident. In addition, the documents noted there were four access doors to the backyard and the alarm systems did not sound on any of them, none were self-closing and one appeared to be malfunctioning.\nThe Chandler Police Department also included its reasons for submitting the case to Maricopa County Attorney’s Office for a review into child abuse with criminal negligence claims.\n“This conclusion is based on several factors. Brady knew the pool net was not on the pool. He knew [redacted] was in the backyard and didn’t know how to swim. According to video evidence, [redacted] was in the backyard unsupervised for more than nine minutes, and in the water for about seven of those minutes,” the report read. “Brady’s statements do not match what is seen on the video; he did not accurately describe one thing did after he went outside. This leads to the conclusion that Brady was not aware of what was doing and was not watching him. The combination of these factors led to drowning, and a remedy to any of the contributing circumstances could have prevented the outcome.”\nThe Maricopa County Attorney’s Office released a statement on July 25, announcing Brady will not face child abuse charges due to there being “no likelihood of conviction” following review of the evidence.\n“Every case submitted to the Maricopa County Attorney’s Office is evaluated using the same standard: whether there is a ‘reasonable likelihood of conviction,’” the statement continued. “After careful review of the evidence submitted by Chandler PD, it was determined this case does not meet that standard. MCAO’s review of the case involved the attorneys assigned to it, along with highly experienced senior attorneys and the County Attorney herself.”\nBrady’s attorney Flynn Carey responded to the update in the case via a statement shared with multiple outlets at the time.\n“We are grateful to law enforcement and the county attorney for conducting a thorough investigation and confirming that this was a tragic accident,” the statement read.“Brady remains in the midst of the grieving process and is thankful to be with his family as they heal together. We appreciate the compassion and support shown during this difficult time.”"
    },
    {
      "url": "https://www.usmagazine.com/entertainment/pictures/emma-stone-through-the-years/",
      "text": "Emma Stone was determined to make her dreams come true from a young age.\nShe started her acting career as a child, starring in a theater production of The Wind in the Willows in 2000. When she was a teen, Stone created a PowerPoint presentation that convinced her parents to let her move to Hollywood.\nStone got her first break when she won VH1’s In Search of the Partridge Family in 2004, earning the part of Laurie Partridge for a series titled The New Partridge Family. However, only the pilot episode of the show was produced.\nStone’s film career took off with roles in Superbad (2007) and House Bunny (2008) before she starred as Olive Penderghast in Easy A (2010). Since her big screen breakthrough, Stone has been nominated for three Academy Awards, winning one for her work in La La Land (2016).\nStone played an aspiring actress in the Damien Chazelle film, previously telling Us Weekly that she could relate to her character’s struggles to reach success.\n“When I was lucky, there were, like, five auditions a week — that’s when you’re really lucky,” she recalled in 2017. “I think the worst part is when I wasn’t getting any auditions because that sort of ignorable feeling is somehow more brutal than being rejected.”\nKeep scrolling to see the highlights of Stone’s career so far, from comedy star to established actress:"
    },
    {
      "url": "https://news.google.com/publications/CAAqBwgKMM7UwQEwjJAU?hl=en-US&gl=US&ceid=US%3Aen",
      "text": "- EnglishUnited States\n- Deutsch\n- English\n- Español\n- Français\n- Italiano\n- Svenska\n- All languages\n- Afrikaans\n- azərbaycan\n- bosanski\n- català\n- Čeština\n- Cymraeg\n- Dansk\n- Deutsch\n- eesti\n- EnglishUnited Kingdom\n- EspañolEspaña\n- EspañolLatinoamérica\n- euskara\n- Filipino\n- FrançaisCanada\n- FrançaisFrance\n- Gaeilge\n- galego\n- Hrvatski\n- Indonesia\n- isiZulu\n- íslenska\n- Italiano\n- Kiswahili\n- latviešu\n- lietuvių\n- magyar\n- Melayu\n- Nederlands\n- norsk\n- o‘zbek\n- polski\n- PortuguêsBrasil\n- PortuguêsPortugal\n- română\n- shqip\n- Slovenčina\n- slovenščina\n- srpski (latinica)\n- Suomi\n- Svenska\n- Tiếng Việt\n- Türkçe\n- Ελληνικά\n- беларуская\n- български\n- кыргызча\n- қазақ тілі\n- македонски\n- монгол\n- Русский\n- српски\n- Українська\n- ქართული\n- հայերեն\n- עברית\n- اردو\n- العربية\n- فارسی\n- አማርኛ\n- नेपाली\n- मराठी\n- हिन्दी\n- অসমীয়া\n- বাংলা\n- ਪੰਜਾਬੀ\n- ગુજરાતી\n- ଓଡ଼ିଆ\n- தமிழ்\n- తెలుగు\n- ಕನ್ನಡ\n- മലയാളം\n- සිංහල\n- ไทย\n- ລາວ\n- မြန်မာ\n- ខ្មែរ\n- 한국어\n- 日本語\n- 简体中文\n- 繁體中文\n- 繁體中文香港\n- EnglishUnited States\n- Deutsch\n- English\n- Español\n- Français\n- Italiano\n- Svenska\n- All languages\n- Afrikaans\n- azərbaycan\n- bosanski\n- català\n- Čeština\n- Cymraeg\n- Dansk\n- Deutsch\n- eesti\n- EnglishUnited Kingdom\n- EspañolEspaña\n- EspañolLatinoamérica\n- euskara\n- Filipino\n- FrançaisCanada\n- FrançaisFrance\n- Gaeilge\n- galego\n- Hrvatski\n- Indonesia\n- isiZulu\n- íslenska\n- Italiano\n- Kiswahili\n- latviešu\n- lietuvių\n- magyar\n- Melayu\n- Nederlands\n- norsk\n- o‘zbek\n- polski\n- PortuguêsBrasil\n- PortuguêsPortugal\n- română\n- shqip\n- Slovenčina\n- slovenščina\n- srpski (latinica)\n- Suomi\n- Svenska\n- Tiếng Việt\n- Türkçe\n- Ελληνικά\n- беларуская\n- български\n- кыргызча\n- қазақ тілі\n- македонски\n- монгол\n- Русский\n- српски\n- Українська\n- ქართული\n- հայերեն\n- עברית\n- اردو\n- العربية\n- فارسی\n- አማርኛ\n- नेपाली\n- मराठी\n- हिन्दी\n- অসমীয়া\n- বাংলা\n- ਪੰਜਾਬੀ\n- ગુજરાતી\n- ଓଡ଼ିଆ\n- தமிழ்\n- తెలుగు\n- ಕನ್ನಡ\n- മലയാളം\n- සිංහල\n- ไทย\n- ລາວ\n- မြန်မာ\n- ខ្មែរ\n- 한국어\n- 日本語\n- 简体中文\n- 繁體中文\n- 繁體中文香港\nBefore you continue to Google\nWe use cookies and data to\n- Deliver and maintain Google services\n- Track outages and protect against spam, fraud, and abuse\n- Measure audience engagement and site statistics to understand how our services are used and enhance the quality of those services\nIf you choose to “Accept all,” we will also use cookies and data to\n- Develop and improve new services\n- Deliver and measure the effectiveness of ads\n- Show personalized content, depending on your settings\n- Show personalized ads, depending on your settings\nIf you choose to “Reject all,” we will not use cookies for these additional purposes.\nNon-personalized content is influenced by things like the content you’re currently viewing, activity in your active Search session, and your location. Non-personalized ads are influenced by the content you’re currently viewing and your general location. Personalized content and ads can also include more relevant results, recommendations, and tailored ads based on past activity from this browser, like previous Google searches. We also use cookies and data to tailor the experience to be age-appropriate, if relevant.\nSelect “More options” to see additional information, including details about managing your privacy settings. You can also visit g.co/privacytools at any time."
    },
    {
      "url": "https://www.usmagazine.com/celebrity-news/pictures/emma-stone-husband-dave-mccarys-relationship-timeline/",
      "text": "Emma Stone and husband Dave McCary kept their romance relatively under wraps before welcoming their first child in March 2021.\nStone previously dated Andrew Garfield, with whom she appeared in The Amazing Spider-Man (2012) and its 2014 sequel. The costars were together for four years until Us Weekly confirmed in October 2015 that they had called it quits.\nThe next year, Stone hosted Saturday Night Live for the third time. At that point, McCary had been working behind-the-scenes at the NBC sketch comedy series for three seasons, having joined as a segment producer in 2013 alongside buddies Kyle Mooney and Beck Bennett. The California native directed the Maniac actress in a digital short titled “Wells for Boys.”\nSparks seemingly flew between the two, but it wasn’t until October 2017 that their relationship was confirmed. Four months earlier, they were spotted leaving the premiere of Brigsby Bear, a comedy-drama directed by McCary and produced by Andy Samberg‘s The Lonely Island.\nBy December 2019, the pair were engaged. Us broke the news in January 2021 that Stone was pregnant, several months after the couple quietly tied the knot.\nA source exclusively told Us that McCary gave his wife “all his energy and love” throughout her pregnancy, adding, “He caters to her left and right and treats her like a true queen, which she deserves.”\nScroll down to relive the couple’s whirlwind romance:"
    },
    {
      "url": "https://www.vogue.com/article/emma-stone-september-cover-2025-interview",
      "text": "On a gray New York City morning, Emma Stone steps inside a quiet breakfast spot downtown, and you can feel the ions in the room begin to stir. Service, heretofore professional, notches up a tick. The manager and someone who appears to be the manager’s manager stop at our table—How are you, good to see you, what can I get you, okay, perfect, of course, right away. Everything comes right away, because it’s Emma Stone, and you or I would do the same.\nWho doesn’t adore or at least admire Stone? In an acrimonious era during which it’s near impossible to achieve critical unity on any being or concept—even Stevie Wonder and sunny afternoons have their antagonists—the 36-year-old actress and producer has reached a rare altitude of public goodwill.\nMaybe it’s because Stone’s really good at what she does for a living, like double-Oscar good. Maybe it’s because she keeps taking devilish risks with outré collaborators like auteur Yorgos Lanthimos and pilot Nathan Fielder. Maybe it’s because, despite all of her plaudits, Stone remains Emily—a self-deprecating, anxious girl from the Arizona suburbs who regularly worries the whole thing’s about to fall apart, and would never use the word plaudits.\nStone settles into our table wearing a Silk Laundry vest over a white T-shirt, Agolde jeans with Common Projects sneakers, and if you think I had to ask her to tell me all those things, bingo. (She offers a cheeky rundown: “For the record, they’re long black jeans, kind of a wide leg….”)\nHer red hair is short and still growing out—“Pretty slowly for how long it’s been,” she says—from a film for which she dramatically shaved her head. (More on that in a sec.) She orders a croissant and what appears to be a bottomless cup of coffee and congratulates me when I turn down a refill.\n“I’m so impressed,” she says. “I’m such a caffeine freak.”\nI’ve known Stone for a little while. The first time I wrote about her for this magazine was in 2014, when we went to an LA mall and visited two iconic Vogue haunts, Build-a-Bear and Hot Dog on a Stick. The second time was in 2016, just before La La Land, which would go on to win the Academy Award for best picture for approximately two minutes. Stone, of course, won best actress—and got to keep that one.\nStone’s acting career has only flourished further since. There was Battle of the Sexes, in which Stone played Billie Jean King and attained a respectable volley. There was The Favourite, the first of four films so far with Lanthimos, the absurdist Greek director who would conspire with Stone on her most daring role, the randy, reanimated Bella Baxter of 2023’s Poor Things, for which she won a second Oscar. Stone and Lanthimos’s next film, the rivetingly unhinged Bugonia, arrives in October.\nAlong the way was a Zombieland sequel, a TV drama called Maniac with old pal Jonah Hill, a wild Lanthimos triptych called Kinds of Kindness, the meta series The Curse with Fielder, and Cruella, the finest 101 Dalmatians–inspired fashion saga ever made—and if you disagree, my daughter and I will chase you with sticks.\nMeanwhile there have been bright developments in Stone’s personal life. A lifelong Saturday Night Live obsessive and a five-time host, Stone would meet and begin dating Dave McCary, an SNL writer-director. The pair, who are now producing partners, would confirm their engagement in 2019. The following year, Stone would marry into the Studio 8H mafia, wearing a dress designed by her close friend (and Louis Vuitton women’s artistic director) Nicolas Ghesquière—plus a black eye she gave herself after yanking a handle off a refrigerator door.\n“Truly a cosmic joke,” Stone says. “Whose refrigerator handle breaks off while opening it?”\nMost profoundly: In March 2021, Stone and McCary welcomed a child, Louise Jean, her middle name shared with her mother. Three years later Stone would memorably thank her daughter from the Academy Awards stage for turning her parents’ lives “Technicolor.”\nMotherhood, marriage, movies, two Oscars, Saturday Night Live, producing, a self-inflicted black eye from a fridge handle—it’s been an audacious stretch.\nWhere does one begin?\nI agree completely. Let’s talk about Emma Stone’s shaved head.\n“I really didn’t want her to shave her head,” Stone’s longtime close friend Jennifer Lawrence writes by email. “I had already lived through the Billie Jean King haircut.”\nHere’s our scenario, and I promise I’m not spoiling anything: In Bugonia, Stone’s character is a pharmaceutical CEO who’s kidnapped by a pair of conspiracy theorists played by Jesse Plemons and newcomer Aidan Delbis. The two men believe their hostage’s hair must go, and so they shave her head, with an electric clipper, in the back seat of a stolen Range Rover. This is all done on film, with zero CGI—those are Stone’s actual locks, spilling onto the leather interior.\nStone is not the first high-profile actress to go head-shaven for a part, of course. Natalie Portman did it for V for Vendetta; Charlize Theron for Mad Max: Fury Road; and please don’t make me explain what a big deal it was when Demi Moore buzzed for G.I. Jane.\nStill, it’s a massive show of commitment, which was not lost on Plemons and the Bugonia gang when the moment arrived. “It was like, ‘Here we go—Emily has shaved her head,’ ” Plemons says. “We better make this good!”\nStone loved it. “No better feeling in the world,” she says of the cut, which, in case you’re mulling it, deployed a 1.5-millimeter blade. (“The first shower when you’ve shaved your head? Oh my God, it’s amazing,” she says, sounding like Laird Hamilton raving about the curls at Teahupo‘o.) Stone had no hesitation—and she did get to shave Lanthimos’s head first—but admits that, right before, she burst into tears in her trailer. Years ago, Stone’s mother, Krista, lost her hair during treatment for breast cancer. “She actually did something brave,” she remembers thinking. “I’m just shaving my head.”\nTurns out Krista Stone was envious. “My mom was like, ‘I’m so jealous. I want to shave my head again.’ ”\nBugonia—based on a 2003 South Korean film called Save the Green Planet!—is an intense movie shot within tightly confined spaces, one of which is the basement of a rural house. For long stretches, Lanthimos, working with Poor Things cinematographer Robbie Ryan, trains the camera directly on Stone’s face and shorn scalp. The effect is mesmerizing, almost feral.\n“Honestly, she looked beautiful,” writes Lawrence. “She pulled it off.”\nDuring filming, Stone wore hats in public and turned up at the New York Film Festival in a wig. Her shorter mane was praised as a style move at awards season—“Emma Stone Debuts Pixie Cut at Golden Globes,” read one headline. The secret came out when a Bugonia teaser arrived with a shot of clippers digging into Stone’s scalp.\nStone misses it, honestly. “I was bummed I wasn’t going out with it,” she says. “Just straight-up bald. I think that would have been fun.”\nAlright. Enough about the hair.\nThen again, cutting off all her hair is emblematic of what Stone’s done with acting: See the sharpest turn and swerve right into it.\nThere’s a version of Stone’s career in which, year after year, she signs up for action capers and romantic comedies in which she plays, I don’t know, a narcoleptic lawyer who can’t get a second date.\nInstead, she’s taken a riskier path. This is most evident in her extended partnership with Lanthimos, a 51-year-old filmmaker pathologically averse to standard Hollywood fare. In Stone, he’s found a kindred spirit. “I don’t think she can be any other way,” Lanthimos says. “She wants to be excited by the stuff that she does, to try different things. It’s more about the experience for her.”\nNowhere was this clearer than in Poor Things, the Mary Shelley–inspired Victorian romp in which Stone played a dead-by-suicide pregnant woman reanimated with the brain of her own baby, and gang, that’s just the half of it. Stone’s performance—Bella wobbling like a toddler, then voyaging into adult independence, self-discovery, and a libertine sexual awakening—was unlike anything she’d done.\n“When it was going out into the world, I was like, I have no idea what people are going to say about this,” Stone recalls. “I started to get scared, but then I was like: There’s nothing you can do. Yorgos and I have talked a lot about this. There’s no reason to be prescriptive to an audience about what it should like and not like. If you don’t like it, that’s fine. If it’s not for you, that’s okay.”\nAudiences went amok for Poor Things—the film grossed $117 million worldwide, making it Lanthimos’s biggest hit and a crazy uncle in the cookie-cutter multiplex. Plotwise, Bugonia is a 180 pivot, but it’s just as provocative, a meaty rumination on modern conspiracy theorizing, medical-industry corruption, and obsessions like extraterrestrials, and again gang, that’s just the half of it.\n“The more challenging it gets, the more I like it,” says Stone, who also appeared this summer in Eddington, writer-director Ari Aster’s bonkers riff on COVID-era American paranoia. “If you’re not growing or pushing yourself to different places—and I feel it’s the same for most people in almost any job—you get stagnant.”\nIt’s all a long way from making tiramisu with Jonah Hill in home-economics class. Stone often credits legendary casting director Allison Jones for her breakthrough as Hill’s sharp-witted Superbad crush, Jules. Jones remembers Stone well: She first encountered Stone as a teenager, when she and Lawrence (brought in by another casting director) tested for the same part in a comedy pilot. Stone and Lawrence were often up for the same things; neither got this one, and the sitcom never went to series.\n“She was a young Shirley MacLaine, even as a teenager,” Jones emails, recalling Stone’s “raspy voice and her ability to ‘get the joke,’ ” which made an impression at a Superbad table read.\nJesse Plemons, who first worked with Stone on Kinds of Kindness, says Stone was an invaluable guide to Yorgos World, where extensive rehearsals and acting exercises are part of the cast’s bonding process. “Seeing her throw herself into these exercises and games gives you more confidence to do the same,” Plemons says. “She takes the work seriously—but not herself too seriously.”\nLawrence believes two Oscars make Stone “undeniable”—even if Stone doesn’t see it that way. A winner herself, Lawrence was onstage at the Dolby Theatre for Stone’s second triumph, when co-presenter Michelle Yeoh gracefully passed the statue over so the two friends could have a moment.\n“In true Emily form, as soon as we got offstage and ran into the bathroom to scream and cry,” Lawrence writes, “I whispered, Two-time best-actress winner, and she replied, ‘I feel like that’s bad, though.’ ”\nThis is the Stone her close friends know and love—even in exultant moments, always worrying that the other shoe is going to drop. “Always, always, always,” Stone says. Such anxiety might encourage career caution, but Stone has prioritized a more radical path, pursuing partnerships where trust and familiarity allow her to take chances. “When you find people you really have a shorthand with,” she says, “to me, that’s the dream.”\nSimilarly adventurous is Stone’s almost decade-long professional collaboration with Ghesquière and Louis Vuitton. Stone and Ghesquière met at the Met Gala in 2012, introduced by the late Lanvin designer Alber Elbaz, who made Stone a red minidress embroidered with crystal flowers.\n“It was the best introduction possible—she was so sweet, so charismatic,” says Ghesquière, who designed all the fashion for the images accompanying this story, which were photographed at the Palais des Papes in Avignon. Here, for Stone and Vogue, the acclaimed designer has ventured into the exacting discipline of handmade fashion—akin to French couture.\n“Couture is about experimentation, which she loves,” Ghesquière says. He calls it “a story in my head, a movie that doesn’t exist in which she is the lead character.”\nGhesquière and Stone have proven to be an auspicious match—he arrived at Vuitton just as Stone ascended to the Hollywood mountaintop. A dedicated movie fan (he has a soft spot for Stone’s early Crazy, Stupid, Love), Ghesquière has been inspired by her onscreen performances. For Stone’s public appearances around Poor Things, he drew on costume designer Holly Waddington’s Oscar-winning creations, in one instance pairing a blue midi-dress with a scrunchy robe that mimicked Bella Baxter’s exaggerated shoulder lines.\n“She’s not a fashion addict,” Ghesquière says of Stone. At the same time, “She loves the quality of the clothes, the fabric, the craftsmanship. She’s curious about the way things are done. It’s a very inspiring exchange—like a tennis match where we keep sending things to each other.”\n“Nicolas is just somebody you can sit, have dinner with, talk about life and everything going on,” Stone says. “The only relationship I had like that with a designer was with Alber, who I miss terribly. He was so human and loving. Nicolas has that kind of humanity to him.”\nStone points out that she and Ghesquière both have partners from San Diego—McCary grew up there, as did Ghesquière’s partner, Drew Kuhse—and also share a sense of humor. This helped at the 2024 Oscars, when Stone realized on her way to accepting her statue for Poor Things that her strapless tulip-shaped Vuitton dress had broken a zipper.\nGhesquière, watching on TV, was aghast. But Stone joked onstage—“I think it happened during ‘I’m Just Ken,’ ” she said, referring to old pal Ryan Gosling’s Barbie musical performance—and turned the mishap into self-effacing magic. “It was human,” Ghesquière says. “The whole thing for me, that accident, was quite beautiful,” he continues, before adding: “Now we make sure we make solid zippers.”\nFor Stone and McCary’s small outdoor wedding in 2020, Ghesquière created both Stone’s wedding dress and a feathered reception minidress, the latter of which she didn’t wear because social-distance rules precluded a real party. She decided to give it an encore at the 2022 Met Gala.\n“That dress was a lifetime memory,” Ghesquière says. “I’m proud to have a friend like that.”\nStone-McCary is a union born of Saturday Night Live—in 2016, McCary, then a staff writer, directed her in a satirical commercial called “Wells for Boys,” in which Stone played the doting mother of a comically sensitive son. Their relationship went public with a courtside appearance at an LA Clippers game in early 2019. The couple remain devoted sports fans, Stone converting McCary into a supporter of her beloved Phoenix Suns; McCary turning Stone into a die-hard for the San Diego Padres.\nSNL remains a through line. Stone describes herself as an SNL “WAG,” and has been part of the show for a long time, says its creator, Lorne Michaels. “So when you see her at the studio, you’re not surprised. She’s completely comfortable.”\n“All my heroes growing up were SNL people,” says Stone. “Of course, I’m not ‘cast member’ material.” (Michaels disagrees: “Oh yeah—she’s a star. That was evident early.”)\nFor SNL’s 50th anniversary in February, Stone did a jump-kick onstage with Molly Shannon’s quinquagenarian Sally O’Malley, and her dress, designed by Ghesquière, had hip-side popcorn buckets as an homage to the kernel-loving Michaels.\nToday, Stone and McCary have a joint production company, Fruit Tree. Like Stone’s acting choices, Fruit Tree’s slate is impossible to pigeonhole: three films from longtime Stone friend Jesse Eisenberg, who refers to Stone as his “fairy godmother”; comedies with Julio Torres; a raw documentary called The Yogurt Shop Murders. The company also coproduced The Curse, which brought Stone together with Fielder (who wrote the series with Benny Safdie). She’s a massive fan of Fielder’s other series The Rehearsal. “I want him to win a Nobel,” she says.\n“I’m drawn to material that asks more questions than gives you answers,” Stone says. “I think critical thinking is the most valuable resource that a person can have, and I like that feeling of being asked to answer things for myself.” At Eisenberg’s urging, Stone recently dove into When We Cease to Understand the World, Benjamín Labatut’s 2020 book on morality and science. When we speak, she’s halfway through Edith Wharton’s The Custom of the Country.\nStone and McCary, who are based in New York City, turn up at red carpets now and then, and there’s a 300 percent chance of finding them at the ballpark when the Padres are in town—but otherwise, they lead a low-key city life. Stone, who made her Broadway debut as Sally Bowles in Cabaret in 2014, raves over Cole Escola’s Tony-winning Oh, Mary! about Mary Todd Lincoln, and is very open to theater again. (A role she covets down the road: Martha in Who’s Afraid of Virginia Woolf?)\nShe famously avoids posting on social media—you won’t find her chugging out TikToks—and is far more likely to be making pumpkin oatmeal cookies or watching Bluey with Louise Jean, who’s now four. “There’s nothing I feel luckier about,” she says of her daughter. “She’s the greatest gift of my life, for sure.” (As for Bluey, she champions the canonical second-season episode “Sleepytime.”)\n“Motherhood can be so difficult, and she’s handling it with grace,” says Martha MacIsaac, the actress who played Becca, friend to Stone’s Jules in Superbad. MacIsaac has two children, and she and Stone have stayed close: “I FaceTimed her during both of my labors. Her medical advice is very sound.”\nMotherhood now impacts Stone’s creative choices. “It’s streamlined everything,” she says. She now asks herself if a job is worth it—spending months away, not seeing her daughter for long stretches on set. “It’s a clichéd thing to say, but it changes everything. And simplifies everything.”\nHas being a parent made her better at what she does—has it opened deeper emotional registers as an actor?\nShe pauses for a moment.\n“I do think it unlocks different things,” Emma Stone says. “I don’t know if it’s specifically that, but I feel everything I could possibly feel, because everything has exploded.”\nIn this story: hair, Mara Roszak using RŌZ hair; makeup, Pat McGrath; tailors, Francesca Camugli and Michael Morgado; manicurist, Emi Kudo. Produced by Farago Projects.\nThe September issue is here featuring Emma Stone. Subscribe to Vogue."
    },
    {
      "url": "https://www.usmagazine.com/celebrity-news/news/brandon-blackstock-cause-of-death-revealed-after-cancer-battle/",
      "text": "The official cause of death for Kelly Clarkson’s ex-husband, Brandon Blackstock, has been confirmed.\nSilver Bow County Coroner Dan Hollis told Us Weekly on Monday, August 11, that Blackstock’s cause of death was melanoma, a form of skin cancer, and the manner of his death was natural causes. “Brandon Blackstock passed away peacefully at his home in Butte, Montana on August 7th under hospice care surrounded by his family,” Hollis said in a statement.\nBlackstock died on August 7 after privately battling cancer for three years. He was 48.\n“It is with great sadness that we share the news that Brandon Blackstock has passed away. Brandon bravely battled cancer for more than three years. He passed away peacefully and was surrounded by family,” a family rep told Us in a statement. “We thank you for your thoughts and prayers and ask everyone to respect the family’s privacy during this very difficult time.”\nOne day earlier, Clarkson, 43, alerted fans to Blackstock’s illness when she put her Las Vegas residency on pause, though she didn’t reveal the nature of his condition at the time.\n“Unfortunately, I need to postpone the remainder of the August Studio Session dates in Las Vegas,” she announced via Instagram on August 6. “While I normally keep my personal life private, this past year, my children’s father has been ill and at this moment, I need to be fully present for them. I am sincerely sorry to everyone who bought tickets to the shows and I so appreciate your grace, kindness and understanding.”\nClarkson and Blackstock wed in October 2013 and went on to welcome daughter River, 11, and son Remington, 9. During their marriage, Blackstock worked as the singer’s manager. Clarkson ultimately filed for divorce in June 2020 after nearly seven years. The pair finalized the proceedings in March 2022 following a messy legal battle.\nPrior to his relationship with Clarkson, Blackstock was married to Melissa Ashworth from 2001 to 2012. The exes shared daughter Savannah, 23, and son Seth, 18.\nIn January 2022, Blackstock became a first-time grandfather when Savannah gave birth to her and now-husband Quentin Lee’s son, Lake. Savannah announced in July that the couple are expecting their second baby.\nOutside of his marriage to Clarkson, Brandon had another Hollywood connection via his father, Narvel Blackstock, who was Clarkson’s manager earlier in her career. Narvel was previously married to Reba McEntire from 1989 to 2015, during which time she was stepmom to Brandon and his two sisters, Chassidy and Shawna. Narvel and McEntire’s son, Shelby, who was born in 1990, was Brandon’s half-brother."
    },
    {
      "url": "https://www.usmagazine.com/entertainment/news/emma-stone-wins-best-actress-thanks-daughter-at-2024-oscars/",
      "text": "Emma Stone was crowned the Best Actress in a Leading Role winner at the 2024 Oscars for her performance in Poor Things, and she gave a special shout-out to her family.\n“I know I have to wrap up, but I really just want to thank my family,” Stone, 35, said toward the end of her acceptance speech on Sunday, March 10. “My mom, my brother Spencer, my dad, my husband, Dave [McCary], I love you so much. And most importantly, my daughter who is going to be 3 in three days and has turned our lives technicolor. I love you bigger than the whole sky, my girl.”\nStone was nominated alongside Nyad’s Annette Bening, Killers of the Flower Moon’s Lily Gladstone, Anatomy of a Fall’s Sandra Hüller and Maestro’s Carey Mulligan at the awards show, which was held at the Dolby Theatre in Los Angeles on Sunday.\n“This is really overwhelming,” the winner said as she initially took the stage. “Sorry, I’m — OK, my voice is also a little gone. Whatever. The women on the stage, you are all incredible, and the women in this category, Sandra, Annette, Carey, Lily, I share this with you. I’m in awe of you. It’s been such an honor to do all of this together, I hope we get to keep doing more together. I don’t know what I’m saying.”\nStone found her words while thinking about Poor Things director Yorgos Lanthimos‘ advice.\n“The other night, I was panicking — as you can kind of see, happens a lot — that maybe something like this could happen and Yorgos said to me, ‘Please take yourself out of it.’ And he was right, because it’s not about me. It’s about a team that came together to make something greater than the sum of its parts.”\nShe went on to thank her cast, crew and director. “Yorgos, thank you for the gift of a lifetime in Bella Baxter,” she gushed. “I’m forever thankful for you. Thank you for inviting all of us to be members of this team. Thank you.”\nAhead of the ceremony, Stone was the only previous Academy Award winner in the category after earning Best Actress for La La Land in 2017. Her other past nominations include Best Actress in a Supporting Role for Birdman in 2015 and The Favourite in 2019, while she was also up for Best Picture this year for her work as a producer on Poor Things.\nBening, 65, has been nominated for Best Actress in a Leading Role on three other occasions: for American Beauty in 2000, Being Julia in 2005 and The Kids Are All Right in 2011. She also received a nod for Best Actress in a Supporting Role for The Grifters in 1991. Mulligan, 38, similarly earned nominations for Best Actress in a Leading Role for An Education in 2010 and Promising Young Woman in 2021.\nFor Gladstone, 37, and Hüller, 45, this marked their first-ever Oscar nods.\nGladstone has been a 2024 awards-season favorite. In January, she won Best Performance by a Female Actor in a Motion Picture – Drama at the 2024 Golden Globe Awards, defeating Bening, Mulligan, Hüller, Priscilla’s Cailee Spaeny and Past Lives’ Greta Lee. The following month, she bested Stone, Bening, Mulligan and Barbie’s Margot Robbie in the Outstanding Performance by a Female Actor in a Leading Role category at the 2024 Screen Actors Guild Awards.\n“It’s so easy to distance ourselves. It’s so easy to close off, to stop feeling, and we all bravely keep feeling, and that humanizes people. That brings people out of the shadows; it brings visibility,” Gladstone said in her SAG acceptance speech. “Thank you for all of the compassionate souls in this room and all of the storytellers here tonight. Keep speaking your truths, and keep speaking up for each other.”\nAlthough Gladstone beat Stone at the SAG Awards, Stone was not without a victory of her own, winning Best Performance by a Female Actor in a Motion Picture – Musical or Comedy against Robbie, Fallen Leaves’ Alma Pöysti, The Color Purple’s Fantasia Barrino, No Hard Feelings’ Jennifer Lawrence and May December’s Natalie Portman at the Golden Globes.\nStone noted in her acceptance speech that she views Poor Things as a romantic comedy, “in the sense of Bella falls in love with life itself, rather than a person. She accepts the good and the bad in equal measure, and that really made me look at life differently. All of it counts, and all of it is important.”"
    },
    {
      "url": "https://www.usmagazine.com/celebrity-moms/news/emma-stone-gives-birth-welcomes-1st-child-with-husband-dave-mccary/",
      "text": "Emma Stone is a mom! The actress has given birth to her and Dave McCary’s first child, according to TMZ.\nNews broke on Thursday, March 25, that the couple welcomed their little one on March 13 in Los Angeles.\nUs Weekly exclusively confirmed in January that the Battle of the Sexes star, 32, was pregnant. “She seems very happy and very excited about becoming a mother — she’s constantly oohing and cooing,” a source told Us at the time. “She looks great, she looks healthy, she’s glowing. She’s been keeping up with friends and work lately, she’s always staying active and gets her daily exercise in.”\nThe Arizona native was spotted cradling her baby bump in a black top on a Los Angeles walk with a friend that same week.\nThe Oscar winner previously spoke to Jennifer Lawrence about her desire to start a family in an August 2018 Elle interview.\n“My perspective about kids has changed as I’ve gotten older,” Stone explained to the Hunger Games star, 30, at the time. “I never babysat or anything. As a teenager, I was, like, ‘I’m never getting married, I’m never having kids.’ And then I got older and I was, like, ‘I really want to get married, I really want to have kids.’”\nTurning 30 changed the Maniac alum’s mind, she added. “You’re, like, ‘I’m not that young. I’m young, but I’m not that young.’”\nShe and McCary, 35, started dating in 2017. The Saturday Night Live writer proposed to Stone two years later.\nNews broke in September 2020 that the pair had tied the knot after they were spotted wearing matching bands. Their nuptials made headlines four months after the Golden Globe winner sparked speculation by swapping her diamond ring for a gold one during an interview with Reese Witherspoon.\nBefore dating the California native, the Birdman star was in a relationship with her Amazing Spider-Man costar Andrew Garfield from 2010 to 2015.\nThe former couple still “care[d] about each other” after their split, the actor, 37, told Vanity Fair in 2016. “There’s so much love between us and so much respect,” Garfield gushed at the time. “I’m her biggest fan as an artist. So for me, it’s been bliss to be able to watch her success and watch her bloom into the actress that she is. And it’s been wonderful to have that kind of support for each other.”"
    },
    {
      "url": "https://www.usmagazine.com/entertainment/news/emma-stone-husband-dave-mccary-attend-snl-50-anniversary-special/",
      "text": "Emma Stone and her husband, Dave McCary, went back to their roots for the SNL 50: The Anniversary Special.\nStone, 36, and former show writer McCary, 39, enjoyed a rare red carpet date night during the Sunday, February 16, live broadcast. While McCary sported a classic black tuxedo, the actress stunned in a red-hot crimson Louis Vuitton gown with her newly cut pixie ‘do. Stone’s custom frock had pockets to hold a popcorn snack.\nSunday is the star-studded celebration of SNL’s milestone 50th anniversary. Stone and McCary famously met when she hosted a 2016 episode of SNL.\n“I have made so many memories here and so many friends and I even met my husband here at SNL,” she recalled in her December 2023 opening monologue. “I know he’s pretty camera-shy, he’s not a performer, but it’s such a special night for us.”\nDuring Stone’s SNL debut, McCary directed her sketch “Wells for Boys” — and they were romantically linked several months later. McCary then proposed in December 2019 before the pair tied the knot the following year.\n“I met him there [on SNL], yeah, but we had a bunch of mutual friends,” Stone later said on the “SmartLess” podcast in December 2023 before detailing their unexpected wedding highlights. “The week that I got married, I did open a refrigerator and the handle broke off and I got a black eye.”\nUs Weekly broke the news in January 2021 that Stone and McCary were expecting their first baby. Their daughter, Louise, was born in March 2021.\nBecoming a parent has since shifted Stone’s entire worldview.\n“I know I have to wrap up, but I really just want to thank my family,” Stone said in March 2024 during her Oscars acceptance speech. “My mom, my brother Spencer, my dad, my husband, Dave I love you so much.”\nShe added, “And most importantly, my daughter who is going to be 3 in three days and has turned our lives technicolor. I love you bigger than the whole sky, my girl.”\nA source told Us one year earlier that Stone was “grateful” to be a working mother.\n“For Emma, quitting acting and being a stay-at-home mom would be like cutting off one of her limbs. That’s just not her,” the insider exclusively said in September 2023. “Acting is as vital to her as breathing, it’s a part of who she is — and Dave’s 100 percent behind her.”\nAccording to the insider, Stone also enjoys bringing her daughter to work.\n“She’s able to bring Louise to the set with her and that makes a huge difference,” the source added. “There is no shortage of people in her circle willing to help with Louise — and Emma is grateful to them.”"
    },
    {
      "url": "https://www.usmagazine.com/celebrity-news/news/emma-stone-used-oxygen-tank-during-sex-scenes-in-easy-a-20101412/",
      "text": "— Emma Stone really knows how to fake it! The 22-year-old actress earned a Golden Globe nomination for her role in Easy A, but filming faux love scenes didn't come easily. \"Simulation of sex is a real workout. We must have done a hundred takes,\" Stone tells the January issue of W. \"There was an oxygen tank at one point!\" [Just Jared]\n— Mila Kunis feared the worst when her phone rang in the wee hours of the morning Tuesday. \"When you're half-asleep and the phone rings and it's pitch black outside, you think the worst. I automatically assumed somebody got hurt,\" the 27-year-old Black Swan actress — and Golden Globe nominee — says. \"The fact that the movie is being recognized in this capacity is something I don't think anyone ever expected.\" [Wonder Wall]\n— Kathy Griffin will help CNN's Anderson Cooper ring in the new year in Times Square for the fourth time on January 31. \"The Most Trusted Name in News just got a whole lot more trusting,\" Griffin, 50, said. Added Cooper, 43: \"Once again, I'm terrified to be co-hosting…with Kathy Griffin. It's often bitterly cold, and yet after being with her for a few minutes on live television, I find myself drenched in sweat.\" [Perez Hilton]\n— After an eight-year film hiatus, Eminem is making his big screen comeback in the gritty boxing movie SouthPaw. The 38-year-old rapper will play a welterweight boxer who rises from humble beginnings to win the title before falling losing it all. [Huffington Post]\n— Despite repeated claims that he'll no longer speak about his family, Michael Lohan recently opened up about his daughter, Lindsay. \"I only pray that after all Lindsay's hard work, this nonsense will stop so that she has a real chance,\" Michael, 50, says. \"And while I am very proud and hopeful of Lindsay, quite honestly, I worry for her, if this behavior doesn't stop.\" [Pop Eater]"
    }
  ],
  "argos_summary": "Emma Stone, an Oscar-winning actress, cherishes her role as a mother to her daughter Louise Jean, born in March 2021. In a recent interview, she expressed how motherhood has transformed her perspective on acting, making her more selective about her projects to prioritize time with her daughter. Stone's relationship with husband Dave McCary remains strong, and she continues to balance her career with family life, recently winning her second Oscar for her performance in 'Poor Things'.",
  "argos_id": "40644ESQP"
}