{
  "url": "https://www.cnbc.com/2025/08/11/cramer-nothing-novel-trumps-deal-with-nvidia-amd.html",
  "authorsByline": "Julie Coleman",
  "articleId": "65d0072b693e49bf926a83fd96e7ce7b",
  "source": {
    "domain": "cnbc.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NJ",
      "county": "Bergen County",
      "city": "Englewood Cliffs",
      "coordinates": {
        "lat": 40.8853773,
        "lon": -73.9523597
      }
    }
  },
  "imageUrl": "https://image.cnbcfm.com/api/v1/image/105867570-1556056698379img_0360r.jpg?v=1691108116&w=1920&h=1080",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T23:16:28+00:00",
  "addDate": "2025-08-11T23:24:13.661243+00:00",
  "refreshDate": "2025-08-11T23:24:13.661245+00:00",
  "score": 1.0,
  "title": "'There's nothing novel' about Trump's deal with Nvidia and AMD, Jim Cramer says",
  "description": "CNBC's Jim Cramer gave his take on President Donald Trump's deal with Nvidia and AMD.",
  "content": "CNBC's Jim Cramer argued that President Donald Trump's deal with semiconductor giants Nvidia and AMD isn't necessarily unprecedented.\n\n\"There's nothing novel at all about taking a 15% cut. It's not like Trump's collecting this money personally…that 15% goes straight to the Treasury,\" he said. \"To take a 15% cut on their Chinese sales is basically just another form of tariff, and we've gotten a ton of those lately, so why not this?\"\n\nThe White House confirmed Monday that Nvidia and AMD agreed to give the U.S. government 15% of their revenue from sales to China. In return, the companies will receive licenses to sell certain chips in China, the Financial Times reported. The government had previously tried to hinder these exports, and Nvidia CEO Jensen Huang warned that the chip restrictions could lead the U.S. to miss out on a $50 billion AI market in China.\n\nThis arrangement comes as the Trump administration continues to upend global trade policy for Big Tech and the corporate world broadly. Last week, the president slapped a 100% tariff on semiconductors and chips — except for companies that are \"building in the United States.\"\n\nCramer said he doesn't think the government's policy is perfect, saying there's \"an element of pay-to-play here that's definitely debatable.\" However, he suggested that the move is one of the more \"benign\" ways that the federal government has become involved in business.\n\nCramer reflected on occasions when the government took stakes in companies. He mentioned the 1979 investment in Chrysler as the company was about to go bankrupt, as well as its move to bail out major banks during the Great Recession. In both situations, the federal government earned a profit.\n\nThe Trump Administration \"intervened where it shouldn't have, and then it changed course to do the right thing,\" Cramer said. To him, the government's decision to allow chip sales to China matters more than its mandate to receive 15% of the revenue.\n\n\"Wring your hands all you want, but this chip deal is good for the taxpayer and good for Nvidia and AMD,\" he said. \"If the chipmakers aren't complaining, why should we?\"",
  "medium": "Article",
  "links": [
    "https://www.cnbc.com/2025/08/06/trump-tariffs-chips-companies.html",
    "https://www.cnbc.com/2025/08/11/trump-nvidia-amd-china-chip-revenue-deal-implications.html",
    "https://www.cnbc.com/donald-trump/",
    "https://www.cnbc.com/2025/05/06/nvidia-ceo-says-missing-china-ai-market-would-be-tremendous-loss-.html",
    "https://www.cnbc.com/jim-cramer-bio/",
    "https://www.ft.com/content/cd1a0729-a8ab-41e1-a4d2-8907f4c01cac",
    "https://www.cnbc.com/quotes/AMD/",
    "https://www.cnbc.com/quotes/NVDA/"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "chip sales",
      "weight": 0.09779538
    },
    {
      "name": "certain chips",
      "weight": 0.08769092
    },
    {
      "name": "Nvidia CEO Jensen Huang",
      "weight": 0.0843821
    },
    {
      "name": "chips",
      "weight": 0.08389355
    },
    {
      "name": "Nvidia",
      "weight": 0.0792992
    },
    {
      "name": "Donald Trump",
      "weight": 0.07799354
    },
    {
      "name": "Jim Cramer",
      "weight": 0.07647114
    },
    {
      "name": "Trump",
      "weight": 0.07292397
    },
    {
      "name": "global trade policy",
      "weight": 0.07075866
    },
    {
      "name": "companies",
      "weight": 0.06991946
    }
  ],
  "topics": [
    {
      "name": "AI"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Technology News",
      "score": 0.96875
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.92431640625
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.7724609375
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.55810546875
    },
    {
      "name": "/Computers & Electronics/Computer Hardware/Computer Components",
      "score": 0.44921875
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.333251953125
    }
  ],
  "sentiment": {
    "positive": 0.11577745,
    "negative": 0.5550469,
    "neutral": 0.32917568
  },
  "summary": "CNBC's Jim Cramer has defended President Donald Trump's deal with semiconductor giants Nvidia and AMD, stating that it is not unusual for the government to take a 15% cut on their Chinese sales and give the government 15% of their revenue from sales to China. In exchange, the companies will receive licenses to sell certain chips in China. This comes as the Trump administration continues to disrupt global trade policy, with a 100% tariff on semiconductors and chips for companies that are \"building in the United States\". Cramer argued that the government's decision to allow chip sales in China matters more than its mandate to receive 15% revenue.",
  "shortSummary": "CNBC's Jim Cramer defends President Donald Trump's deal with Nvidia and AMD, which includes a 15% cut in revenue from Chinese chip sales, amid ongoing regulatory concerns.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "1f2f87cfe3cf49089e2992ad11272397",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.cnbc.com/2025/08/11/trump-nvidia-amd-china-chip-revenue-deal-implications.html",
      "text": "Nvidia and AMD have agreed to share 15% of their revenue from sales to China with the U.S. government, the White House confirmed Monday, sparking debate about whether the move could impact the chip giants' business and whether Washington might seek out similar deals.\nIn exchange for the revenue cut, the two semiconductor companies will receive export licenses to sell Nvidia's H20 and AMD's MI308 chips in China, according to the Financial Times.\n\"We follow rules the U.S. government sets for our participation in worldwide markets. While we haven't shipped H20 to China for months, we hope export control rules will let America compete in China and worldwide,\" Nvidia said in a statement to NBC News. \"America cannot repeat 5G and lose telecommunication leadership. America's AI tech stack can be the world's standard if we race.\"\nAMD said in a statement that its initial license applications to export MI308 chips to China have been approved.\nThe arrangement crafted by U.S. President Donald Trump's administration is \"unusual\", analysts told CNBC, but underscores the transactional nature of the current White House leader. Meanwhile, investors see the move as broadly positive for both Nvidia and AMD, which once more secure access to the Chinese market.\nWhat it means for Nvidia and AMD\nNvidia's H20 is a chip that has been specifically created to meet export requirements to China. It was previously banned under export curbs but the company last month said it expected to receive licenses to send the product to China.\nAlso in July, AMD said it would resume exports of its MI308 chips.\nAt the time, there was no suggestion that the resumption of sales to China would come with conditions or any kind of revenue forfeiture, and the step was celebrated by markets because of the billions of dollars worth of potential sales to China that were back on the table.\nShares of both companies closed moderately lower Monday.\n\"From an investor perspective, it's still a net positive, 85% of the revenue is better than zero,\" Ben Barringer, global technology analyst at Quilter Cheviot, told CNBC.\n\"The question will be whether Nvidia and AMD adjust their prices by 15% to account for the levy, but ultimately it's better that they can sell into the market rather than hand the market over entirely to Huawei.\"\nHuawei is Nvidia and AMD's closest Chinese rival.\nUncertainty nevertheless still looms for both U.S. companies over the longer term.\n\"In the short term, the deal gives both companies some certainties for their exports to China. For the long term, we don't know if the U.S. government may want to take a bigger cut from their China business especially if their sales to China keep growing,\" George Chen, partner and co-chair of the digital practice at The Asia Group, told CNBC.\nTrump unlikely to strike similar deals\nMultiple analysts told CNBC that the deal is \"unusual,\" but almost par for the course for Trump.\n\"It's a good development, albeit a strange one, and feels like the sort of arrangement you might expect from President Trump, who is a deal-maker at heart. He's willing to yield, but only if he gets something in return, and this certainly sets an unusual precedent,\" Barringer said.\nNeil Shah, partner at Counterpoint Research, said the revenue cut is equivalent to an \"indirect tariff at source.\"\nDaniel Newman, CEO of The Futurum Group, also posted Sunday on X that the move is a \"sort of 'tax' for doing business in China.\"\nBut such deals are unlikely to be cut for other companies.\n\"I don't anticipate it extending to other sectors that are just as important to the U.S. economy like software and services,\" Nick Patience, practice lead for AI at The Futurum Group, told CNBC.\nThe U.S. sees semiconductors as a strategic technology, given they underpin so many other tools like artificial intelligence, consumer electronics and even military applications. Washington has therefore put chips under an export control regime unlike that of any other product.\n\"Semiconductor is a very unique business and the pay-to-play tactic may work for Nvidia and AMD because it's very much about getting export approval from the U.S. gov,\" The Asia Group's Chen said.\n\"Other business like Apple and Meta can be more complicated when it comes to their business models and services for China.\"\nHow China could react\nSemiconductors have become a highly sensitive geopolitical topic. Over the last two weeks, China has raised concerns about the security of Nvidia's chips.\nLate last month, Chinese regulators asked Nvidia to \"clarify\" reports about potential security vulnerabilities and \"backdoors.\" Nvidia rejected the possibility that its chips have any \"backdoors\" that would allow anyone to access or control them. On Sunday, Nvidia again denied that its H20 semiconductors have backdoors after accusations from a social media account affiliated with Chinese state media.\nChina's state-run newspaper Global Times slammed Washington's tactics, citing an expert.\n\"This approach means that the US government has repudiated its original security justification to pressure US chip makers to secure export licenses to China through economic leverage,\" the Global Times article said.\nThe Chinese government is yet to comment on the reported revenue agreement.\nTrump's deal with Nvidia and AMD will likely stir mixed feelings in China. On the one hand, China will be unhappy with the arrangement. On the other hand, Chinese firms will likely want to get their hands on these chips in order to continue to advance their own AI capabilities.\n\"For China, it is a conundrum as they need those chips to advance their AI ambitions but also the fee to the US government could make it costlier and there is a doubt of US \"backdoors\" considering US has agreed for chipmakers to supply,\" Counterpoint Research's Shah said.\n— CNBC's Erin Doherty contributed to this report."
    },
    {
      "url": "https://www.cnbc.com/quotes/NVDA/",
      "text": "NVIDIA Corp NVDA:NASDAQ\nRT Quote | Last NYSE Arca, VOL From CTA | USD\nAfter Hours: Last | 7:59 PM EDT\n182.08+0.02 (+0.01%)\nVolume\n6,236,418\nClose\n182.06-0.64 (-0.35%)\nVolume\n125,905,757\n52 week range\n86.62 - 183.88\n- Open182.05\n- Day High183.84\n- Day Low180.25\n- Prev Close182.70\n- 52 Week High183.88\n- 52 Week High Date08/07/25\n- 52 Week Low86.62\n- 52 Week Low Date04/07/25\nLatest On NVIDIA Corp\nKey Stats\n- Market Cap4.442T\n- Shares Out24.40B\n- 10 Day Average Volume161.17M\n- Dividend0.04\n- Dividend Yield0.02%\n- Beta2.11\n- YTD % Change35.57\nLatest On NVIDIA Corp\nKEY STATS\n- Open182.05\n- Day High183.84\n- Day Low180.25\n- Prev Close182.70\n- 52 Week High183.88\n- 52 Week High Date08/07/25\n- 52 Week Low86.62\n- 52 Week Low Date04/07/25\n- Market Cap4.442T\n- Shares Out24.40B\n- 10 Day Average Volume161.17M\n- Dividend0.04\n- Dividend Yield0.02%\n- Beta2.11\n- YTD % Change35.57\nRATIOS/PROFITABILITY\n- EPS (TTM)3.10\n- P/E (TTM)58.64\n- Fwd P/E (NTM)36.93\n- EBITDA (TTM)88.868B\n- ROE (TTM)115.46%\n- Revenue (TTM)148.515B\n- Gross Margin (TTM)70.53%\n- Net Margin (TTM)51.69%\n- Debt To Equity (MRQ)10.10%\nEVENTS\n- Earnings Date08/27/2025\n- Ex Div Date06/11/2025\n- Div Amount0.01\n- Split Date-\n- Split Factor-"
    },
    {
      "url": "https://www.cnbc.com/2025/08/06/trump-tariffs-chips-companies.html",
      "text": "President Donald Trump said Wednesday he will impose a 100% tariff on imports of semiconductors and chips, but not for companies that are \"building in the United States.\"\nThe announcement of new sector-specific tariffs shows Trump ratcheting up his efforts to pressure businesses to manufacture their products in the U.S.\nBut specifics about the plan, such as how much U.S. manufacturing a company needs to do in order to qualify for the tariff exemption, were not immediately clear.\n\"We're going to be putting a very large tariff on chips and semiconductors,\" Trump said in the Oval Office on Wednesday afternoon.\n\"But the good news for companies like Apple is if you're building in the United States or have committed to build, without question, committed to build in the United States, there will be no charge,\" he said.\n\"So in other words, we'll be putting a tariff on of approximately 100% on chips and semiconductors. But if you're building in the United States of America, there's no charge.\"\nTrump had previously signaled that the duties on chips and semiconductors, which have become key components in virtually every industry, could come as soon as next week.\nThe remarks came after Trump touted a commitment by Apple to invest another $100 billion in the U.S. over the next four years, on top of the $500 billion the tech giant has previously pledged.\nSeveral top chipmakers, including Taiwan Semiconductor, Nvidia and GlobalFoundries, have already pledged to manufacture some of their products in the U.S.\nThey're not alone: More than 130 projects in the U.S. totaling $600 billion dollars have been announced since 2020, according to the Semiconductor Industry Association.\nTSMC, the world's largest contract chip company, has pledged to invest a total of $165 billion in U.S. manufacturing.\nNvidia, the world's most valuable company, said in April that it plans to spend $500 billion on AI infrastructure in the U.S. over the next four years.\nGlobalFoundries pledged $16 billion in June to expand its semiconductor manufacturing at facilities in New York and Vermont.\nAlso in June, Texas Instruments announced a $60 billion boost to seven chip fabs in the U.S. The company counts Apple, Ford, Medtronic, Nvidia and SpaceX as customers."
    },
    {
      "url": "https://www.cnbc.com/2025/05/06/nvidia-ceo-says-missing-china-ai-market-would-be-tremendous-loss-.html",
      "text": "Nvidia CEO Jensen Huang said on Tuesday that China's artificial intelligence market will likely reach about $50 billion in the next two to three years, and that missing out on it would be a \"tremendous loss.\"\nHuang said being able to sell into China would bring back revenue, taxes, and \"create lots of jobs here in the United States.\"\n\"We just have to stay agile,\" Huang told CNBC's Jon Fortt, in an interview alongside ServiceNow CEO Bill McDermott. The tech execs were in Las Vegas for ServiceNow's Knowledge 2025 conference. \"Whatever the policies are of the government, whatever is in the best interest of our country, we'll support,\" Huang said.\nNvidia is the leading provider of graphics processing units (GPUs), which have powered the AI boom and lifted the company's market cap to almost $3 trillion. Last month, the Trump administration restricted the shipment of Nvidia's H20 chips to China without a license. That technology, which is related to the Hopper chips used in the rest of the world, was developed to comply with previous U.S. export restrictions.\nNvidia said it would take a $5.5 billion quarterly charge due to the restriction, the strongest sign so far that the company's historic growth could be slowed because of U.S.-China trade tensions. Later in April, Huang said at a tech conference in Washington, D.C., that China is \"not behind\" in AI, and that Huawei is \"one of the most formidable technology companies in the world.\"\nShares of Nvidia are down about 15% so far this year after almost tripling in 2023. The company is set to report earnings on May 28. Analysts expect to see revenue growth of 65% from a year earlier to $43.1 billion, according to LSEG. While Nvidia is still expanding much faster than its megacap peers, growth is slowing, as the company reported a revenue increase of more than 260% a year ago.\n\"The world is right now hungry, anxious to engage AI,\" Huang said on Tuesday. \"Let us get the American AI out in front of everybody right now.\""
    },
    {
      "url": "https://www.cnbc.com/jim-cramer-bio/",
      "text": "Jim Cramer\n\"Mad Money w/ Jim Cramer\" Host, \"Squawk on the Street\" Co-Anchor and CNBC Investing Club with Jim CramerJim Cramer believes there is always a bull market somewhere, and he wants to help you find it. He is host of CNBC's \"Mad Money,\" (M-F, 6PM ET) and co-anchor of the 9 a.m. ET hour of CNBC's \"Squawk on the Street\" (M-F, 9AM-12PM ET). Cramer also runs the CNBC Investing Club with Jim Cramer, a subscription product aimed at helping all investors build long-term wealth in the stock market.\nHe is also the founder of TheStreet.\nCramer is a former hedge fund manager and founder/owner and senior partner of Cramer Berkowitz. His compounded rate of return was 24 percent after all fees for 14 years at Cramer Berkowitz. He retired from his hedge fund in 2001, where he finished with one of the best records in the business, including having 36 percent-plus year in 2000.\nHe graduated from Harvard College where he was president and editor-in-chief of the prestigious daily, The Harvard Crimson. After graduation, he became a reporter for the Tallahassee Democrat and later for the Los Angeles Herald Examiner, where he covered stories ranging from homicides to sporting events. He helped Steve Brill launch American Lawyer magazine before attending Harvard Law School and earning a law degree. Upon graduating and passing the New York State Bar Examination and being admitted to the N.Y. State Bar, Cramer joined Goldman Sachs in sales and trading. While at Goldman, Cramer wrote for The New Republic about stock market issues.\nCramer is the best-selling author of \"Jim Cramer's Get Rich Carefully,\" \"Jim Cramer's Getting Back to Even,\" \"Stay Mad for Life: Get Rich, Stay Rich,\" \"Mad Money: Watch TV, Get Rich,\" \"Jim Cramer's RealMoney\" and \"Confessions of a Street Addict.\"\nFollow Jim Cramer on X @jimcramer."
    },
    {
      "url": "https://www.cnbc.com/quotes/AMD/",
      "text": "Advanced Micro Devices Inc AMD:NASDAQ\nRT Quote | Last NYSE Arca, VOL From CTA | USD\nAfter Hours: Last | 7:59 PM EDT\n172.71+0.43 (+0.25%)\nVolume\n1,538,870\nClose\n172.28-0.48 (-0.28%)\nVolume\n66,963,909\n52 week range\n76.48 - 182.50\n- Open170.04\n- Day High178.82\n- Day Low169.38\n- Prev Close172.76\n- 52 Week High182.50\n- 52 Week High Date07/31/25\n- 52 Week Low76.48\n- 52 Week Low Date04/08/25\nLatest On Advanced Micro Devices Inc\nKey Stats\n- Market Cap279.584B\n- Shares Out1.62B\n- 10 Day Average Volume82.81M\n- Dividend-\n- Dividend Yield-\n- Beta1.92\n- YTD % Change42.63\nLatest On Advanced Micro Devices Inc\nKEY STATS\n- Open170.04\n- Day High178.82\n- Day Low169.38\n- Prev Close172.76\n- 52 Week High182.50\n- 52 Week High Date07/31/25\n- 52 Week Low76.48\n- 52 Week Low Date04/08/25\n- Market Cap279.584B\n- Shares Out1.62B\n- 10 Day Average Volume82.81M\n- Dividend-\n- Dividend Yield-\n- Beta1.92\n- YTD % Change42.63\nRATIOS/PROFITABILITY\n- EPS (TTM)1.67\n- P/E (TTM)102.95\n- Fwd P/E (NTM)34.33\n- EBITDA (TTM)5.75B\n- ROE (TTM)4.70%\n- Revenue (TTM)29.60B\n- Gross Margin (TTM)47.62%\n- Net Margin (TTM)9.11%\n- Debt To Equity (MRQ)5.39%\nEVENTS\n- Earnings Date10/27/2025(est)\n- Ex Div Date-\n- Div Amount-\n- Split Date-\n- Split Factor-"
    }
  ],
  "argos_summary": "President Trump's administration has secured a deal with Nvidia and AMD, requiring them to share 15% of their revenue from sales to China in exchange for export licenses for certain chips. This arrangement, described by analysts as unusual but beneficial for the companies, allows them to access the Chinese market while also generating revenue for the U.S. Treasury. Despite concerns about the implications of such a deal and its potential to set a precedent, both companies view it positively, as it enables them to compete in a significant market.",
  "argos_id": "4F391QCEJ"
}