{
  "url": "https://www.washingtonpost.com/business/2025/08/12/bolivia-election-mas-socialism-morales/97c3427c-7731-11f0-a013-3892e10b2f53_story.html",
  "authorsByline": "Isabel Debre and Paola Flores | AP",
  "articleId": "ce3ea119b2b74f81baa99bdcc878fa83",
  "source": {
    "domain": "washingtonpost.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "DC",
      "city": "Washington",
      "coordinates": {
        "lat": 38.8949924,
        "lon": -77.0365581
      }
    }
  },
  "imageUrl": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/SQ6QWYDXGEI7BIATHCJOCCZPKM_size-normalized.jpg&w=1440",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T04:05:33+00:00",
  "addDate": "2025-08-12T05:03:24.875781+00:00",
  "refreshDate": "2025-08-12T05:03:24.875783+00:00",
  "score": 1.0,
  "title": "Bolivia's election may spell the end of its long-ruling left. Here's what to know",
  "description": "Bolivia’s governing Movement Toward Socialism party won’t have a big-name presidential candidate on the ballot for the first time in two decades",
  "content": "But when Aliaga goes to the polls on Sunday to vote for Bolivia’s next president, he won’t see Morales' name on the ballot after electoral authorities excluded him.\n\nIn fact, for the first time in two decades, Aliaga won’t see any big name from the governing Movement Toward Socialism, or MAS, party that Morales founded — not even President Luis Arce , Morales’ protege-turned-rival, who withdrew from the race over his failure to halt an economic tailspin .\n\n“The right wing had its chance, and it was a disaster,” he said, recalling the hardship of the 1990s, when Bolivia became a poster child for free-market economics and the two right-wing front-runners — businessman Samuel Doria Medina and ex-President Jorge “Tuto” Quiroga — built their careers.\n\n“But the left wing has proven to be the same, or worse,” Aliaga said, referring to how the MAS strategy of nationalizing resources and redistributing tax receipts sputtered out with the end of the commodities boom.\n\nTensions within MAS can be traced to Morales’ disputed 2019 reelection . Protests erupted and the leftist leader resigned under pressure from the military. He fled into exile and right-wing Senator Jeanine Áñez took office in what many view as a coup.\n\nBut their competing ambitions collided when Morales announced his intention to return to politics. Lawmakers loyal to Morales deprived Arce’s government of its majority. Judges answering to Arce ordered Morales’ arrest over his sexual relationship with a 15-year-old girl and barred his 2025 presidential candidacy on account of his past terms.\n\nEver since, Quiroga has yearned for a term of his own. He ran three times — twice against Morales in 2005 and 2014. Now 65, he’s hoping the fourth time’s the charm.\n\nNow once-routine errands have turned into nightmares as Bolivians wait in fuel lines that wrap around city blocks, run from pharmacy to pharmacy in search of medicines and queue for subsidized bread that has shrunk to almost half its normal size.\n\n“Null votes signal that these elections are not legitimate and the next government of Bolivia won’t be legitimate,” said Chris Velasco, an organizer close to Morales. “That will mean political instability, social instability.”",
  "medium": "Article",
  "links": [
    "https://apnews.com/article/bolivia-protests-police-elections-evo-morales-2b1e1368ea336ecfe330aad9bf0a275e",
    "https://apnews.com/article/bolivia-elections-morales-arce-race-campaign-polls-leftwing-9296923408ddcfa429aff4cf9e3e7626",
    "https://apnews.com/article/bolivia-lithium-resources-15e170b6f2f42079b750d262da9c258a",
    "https://apnews.com/general-news-f9418618222e4531bee5d505ab5869ae",
    "https://apnews.com/article/bolivia-indigenous-morales-andean-aymara-fashion-a1d8b5bfa1414bd54fa2ef1ae181cf65",
    "https://apnews.com/article/bolivia-elections-evo-morales-president-arce-courts-516b20a0f5fbcfb48aedd1a1f68b1e27",
    "https://apnews.com/article/bolivia-president-samuel-doria-medina-morales-elections-trump-49faa8947c89a6f363b907a70915abc6",
    "https://apnews.com/general-news-8796ffbee9ca414b9188ed0e4fc1709b",
    "https://apnews.com/general-news-80df3152c79f4ca8997a2e23644bbfe8",
    "https://apnews.com/article/bolivia-natural-gas-arce-coup-military-south-america-oil-energy-export-economy-6ded7bf1340563e8a46de8265533ea8a",
    "https://apnews.com/article/bolivia-evo-morales-president-arce-campaign-f60ff6a58041d01fe910c65f409d0b05",
    "https://apnews.com/article/bolivia-fuel-crisis-economy-arce-president-gas-b43cff9dcfebdca40d35aad6911f055f",
    "https://apnews.com/hub/evo-morales",
    "https://apnews.com/article/bolivia-morales-arce-political-economic-crisis-d38051e051a2e6473a18133e4a9c6120",
    "https://apnews.com/article/4ab62e17d35d4b5c89380235e01f0689",
    "https://apnews.com/article/virus-outbreak-evo-morales-la-paz-elections-voting-fraud-and-irregularities-d5676d406b4baa4d35276975b31b0656",
    "https://apnews.com/article/bolivia-president-arce-economic-crisis-fuel-subsidies-morales-04255009f9201cd8757959b8d71ccd05",
    "https://apnews.com/article/f8e640b49c9b4a0896ac642620c15fe1",
    "https://apnews.com/article/e4e1977c3e48426f927ce900d2818b4f",
    "https://apnews.com/hub/luis-arce",
    "https://apnews.com/article/bolivia-elections-president-morales-bread-socialism-mas-subsidies-protests-fd1f696aa8036647f7d023a79c272c8a",
    "https://apnews.com/article/caribbean-ap-top-news-international-news-la-paz-latin-america-3fdae407d6dd480cb1a9f59936040551",
    "https://apnews.com/general-news-72d8d8cdda06431bae254a2b35122aab",
    "https://apnews.com/article/bolivia-elections-morales-socialism-rightwing-president-arce-economic-crisis-8fa148f61cadaf4b59a5e9bbd91b1349",
    "https://apnews.com/article/china-latin-trade-tariffs-us-jinping-de2a3faa01ce6e98617cbecd74658c34",
    "https://apnews.com/article/bolivia-judicial-elections-morales-mexico-overhaul-constitution-beba1908c766b982dd90532723062e38",
    "https://apnews.com/article/bolivia-economy-us-dollar-42f815800dd18eb0952590bb8b968cfd"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Morales",
      "weight": 0.09088357
    },
    {
      "name": "Bolivia",
      "weight": 0.060535673
    },
    {
      "name": "Luis Arce",
      "weight": 0.06047838
    },
    {
      "name": "businessman Samuel Doria Medina",
      "weight": 0.059056595
    },
    {
      "name": "MAS",
      "weight": 0.056424785
    },
    {
      "name": "Samuel Doria Medina",
      "weight": 0.05550475
    },
    {
      "name": "political instability",
      "weight": 0.0551677
    },
    {
      "name": "right-wing Senator Jeanine Áñez",
      "weight": 0.055121724
    },
    {
      "name": "Arce",
      "weight": 0.054559194
    },
    {
      "name": "Aliaga",
      "weight": 0.0540768
    }
  ],
  "topics": [
    {
      "name": "US Politics"
    }
  ],
  "categories": [
    {
      "name": "Business"
    },
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.990234375
    },
    {
      "name": "/News/Politics/Campaigns & Elections",
      "score": 0.96533203125
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.95361328125
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.81591796875
    }
  ],
  "sentiment": {
    "positive": 0.038746934,
    "negative": 0.8057067,
    "neutral": 0.15554644
  },
  "summary": "The election of Bolivia's president, President Luis Arce, may end the long-ruling left, with no major figures from the governing Movement Toward Socialism (MAS), or MAS, party founded by Carlos Morales. This is the first time in two decades that no major party has been excluded from the ballot for the election. This comes amid tensions within MAS over Morales' disputed 2019 reelection and his subsequent resignation from MAS. The MAS strategy of nationalizing resources and redistributing tax receipts has since failed, leading to political instability and widespread shortages of food and medicine.",
  "shortSummary": "Bolivian President Evo Morales' exclusion from the presidential race signals the end of the left-wing dominance of Bolivia, amid economic struggles and political instability.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "31e713431370499f96388938631353d4",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://apnews.com/article/bolivia-lithium-resources-15e170b6f2f42079b750d262da9c258a",
      "text": "Bolivia boosts lithium resources estimate, cementing spot as global leader\nLA PAZ, Bolivia (AP) — The total of Bolivia’s confirmed lithium resources has increased 2 million tons to 23 million tons, the Andean country’s president said Thursday.\nThe new estimate further cements Bolivia’s position as the country with the world’s biggest known deposits of lithium, which is in high demand for use in batteries.\n“We are the largest lithium reserve in the world, and we have to know how to manage it intelligently to exploit and transform this resource,” President Luis Arce said at the Coipasa salt flat, around 280 kilometers (175 miles) south of the capital of La Paz.\nBolivia has stepped up its search for international partners to help develop its lithium reserves at a time when demand for the metal is soaring amid the transition to renewable energy around the world and the growth in electric vehicles powered by lithium batteries.\nThe increase in the estimate of Bolivia’s reserves came after further geological studies in the Coipasa and Pasto Grandes salt flats, Raul Mayta, vice minister of exploration and exploitation of energy resources, told the state television channel, Bolivia TV.\nArce is pushing to boost Bolivia’s role in the international lithium market after 14 years of little progress that left it lagging behind neighboring Chile and Argentina. The three countries are home to an area that contains a large share of the world’s proven reserves of lithium.\nLast month, Arce’s government signed an agreement with China’s Citic Guoan and Russia’s Uranium One Group to exploit Bolivia’s lithium deposits. Together, they promised to invest $1.4 billion for the construction of two plants for the production and export of 50,000 tons of lithium annually starting in 2025 in the Pastos Grandes salt flats.\nA similar amount of investment was reported when the government signed an agreement in January with Contemporary Amperex Technology of China.\nArgentina has the world’s second-largest lithium reserves, at 20 million tons, followed by the United States with 12 million tons and Chile with 11 million tons, according to the U.S. Geological Survey. The world’s top lithium producer is Australia, followed by Chile and China in third place, according to the U.S. agency."
    },
    {
      "url": "https://apnews.com/article/bolivia-indigenous-morales-andean-aymara-fashion-a1d8b5bfa1414bd54fa2ef1ae181cf65",
      "text": "In Bolivia’s scrappy highlands, proud Indigenous Cholas take the runway by storm\nIn Bolivia’s scrappy highlands, proud Indigenous Cholas take the runway by storm\nVIACHA, Bolivia (AP) — In the huddled markets, sprawling farms and pulsing parties of Viacha, a town southeast of Bolivia’s capital, it’s typical for women to sport bowler hats, tiered skirts and fringed shawls.\nWhat’s less typical is for the fashion spotlight to turn to these outfits — worn by “Cholas,” Indigenous women from the highland Altiplano.\nBut late Friday in Viacha, some 22 kilometers (13 miles) from Bolivia’s capital of La Paz — over 12,000 feet (3,650 meters) above sea level — awe-struck teenage boys and proud mothers throbbed the main square as the town’s dirt roadway was briefly transformed into a runway.\nOne by one, the girls from Viacha — mostly students between 15-25 years old — strutted down the catwalk to a surprising soundtrack of early 2000s American pop music. Street vendors hawked hot dogs and empanadas. Supporters cheered in Spanish and the Indigenous Aymaran language.\nWearing glittering shoes and brightly colored, bunched-out skirts called “polleras,” the amateur models of all heights and sizes twirled, tipped their hats and threw sultry glances at the crowd.\n“Years ago, people would associate these skirts with the fields, they’d look down on us as rural peasants,” said Rogelia Canaviri, 42, who couldn’t stop smiling as she watched her daughter, Carolina, stride down the runway in dangling pearl earrings, the sequins on her layer-cake red skirt catching the stage lights.\n“It’s something I’m proud of, to see my daughter and her friends enjoy what I’ve worn for work my whole life,” she said, pointing to the wool shawl, velvet hat and lower-key beige pollera she had on — the same clothes, she said, she still wears to milk her cows and sell her cheese at open-air markets. Her own mother did the same.\nGenerations ago, the Aymara were subject to waves of conquest and dispossession, first by the Inca, then by the Spanish, who forced the Indigenous communities to abandon their traditional way of dressing and adopt the style then-popular in the court of Seville.\nLegend has it that the jaunty felt bowler hat became critical to the get-up after being introduced by British railway workers in the 1920s.\nBolivia’s whiter, more affluent population has used “Chola” — and its diminutive, “Cholita” — as dismissive racial epithets. But in recent decades that stigma has dissipated, with Indigenous Aymara proudly reclaiming the word and younger Bolivians rediscovering the charm of their mothers’ and grandmothers’ vibrant garments.\n“I think the ‘Cholita’ has become something very interesting, very exciting in our current context,” said Brittany Cantuta Valeria, 21, a first-time model, her hat brimmed upward and cheeks flushed a reddish gold.\n“We’re now at the point of being respected because of everything that’s been implemented, so I wear this to have fun, to show off, to go to parties and dances. I have nothing to do with working the fields.”\nMost of the girls parading onstage Friday, in the show organized by the Viacha municipality, grew up during the tenure of former leftist President Evo Morales (2006-2019), the country’s first-ever Indigenous president whose championing of Bolivia’s Indigenous majority earned him fervent support across the cinderblock and adobe homes of the Altiplano.\nMorales instituted a new constitution, which, among other things, expanded recognition for Bolivia’s 36 ethnic groups. He promoted the teaching of Indigenous languages and boosted state funding for folkloric arts. More Chola runway shows and beauty contests cropped up, widening the reach of Bolivia’s native highland culture.\nBut fashion fanfare was largely limited to La Paz, the seat of the government. Before Friday, the town of Viacha, like most of the other villages across these austere mountain-rimmed plains, had never taken its turn on the runway.\n“I was really nervous but I realized this is the first time for all of us,” said 15-year-old Tomasa Ramirez. “I feel so pretty. Now I know it’s my dream to be a Cholita model.”\nWith Bolivia’s economic crisis closing like a vise on families whose money has diminished in value while the cost of food has doubled, many girls said walking the show was no easy feat.\nTop-notch velvet hats and shawls made from vicuña wool with silk fringes can fetch thousands of dollars. Polleras cost a few hundred dollars. Then there’s the jewelry — ideally made of real gold, pearls and diamonds when worn to these kinds of formal events.\n“This year there was no way I could have real ones,” said Julieta Mamani, 16, pointing to her gold-colored earrings. “I hope things will be different next year.”\nWatching her 24-year-old daughter pose for selfies in her elaborate skirt, Canaviri, the dairy farmer, has another hope.\n“I hope she doesn’t like wearing pants,” she said of her daughter. “I tried on pants once in my life, and I felt naked. Never again.”"
    },
    {
      "url": "https://apnews.com/article/bolivia-fuel-crisis-economy-arce-president-gas-b43cff9dcfebdca40d35aad6911f055f",
      "text": "‘Everything is expensive!’ Bolivia faces a shocking economic collapse\n‘Everything is expensive!’ Bolivia faces a shocking economic collapse\nEL ALTO, Bolivia (AP) — Fuel is rapidly becoming one of Bolivia’s scarcest commodities.\nLong lines of vehicles snake for several kilometers outside gas stations all over Bolivia, once South America’s second-largest producer of natural gas. Some of the queues don’t budge for days.\nWhile frustration builds, drivers like Victor García now eat, sleep and socialize around their stationary trucks, waiting to buy just a few gallons of diesel — unless the station runs dry.\n“We don’t know what’s going to happen, but we’re going to be worse off,” said García, 66, who inched closer to the pump Tuesday as the hours ticked by in El Alto, a bare-bones sprawl beside Bolivia’s capital in the Andean altiplano.\nBolivia’s monthslong fuel crunch comes as the nation’s foreign currency reserves plummet, leaving Bolivians unable to find U.S. dollars at banks and exchange houses. Imported goods that were once commonplace have become scarce.\nThe fuel crisis has created a sense that the country is coming undone, disrupting economic activity and everyday life for millions of people, hurting commerce and farm production and sending food prices soaring.\nMounting public anger has driven crowds into the streets in recent weeks, piling pressure on leftist President Luis Arce to ease the suffering ahead of a tense election next year.\n“We want effective solutions to the shortage of fuel, dollars and the increase in food prices,” said Reinerio Vargas, the vice rector of Gabriel René Moreno Autonomous University in the eastern province of Santa Cruz, where hundreds of desperate truckers and residents flooded main squares Tuesday to vent their anger at Arce’s inaction and demand early elections.\nIn a similar eruption of discontent, protesters shouting “Everything is expensive!” marched through the streets of the capital, La Paz, last week.\nBolivians say Arce’s image has suffered not only because of the crisis but also because his government insists that it doesn’t exist.\n“Diesel sales are in the process of returning to normal,” Economy Minister Marcelo Montenegro said Tuesday.\nArce has repeatedly vowed that his government will end the fuel shortages and lower the prices of basic goods by arbitrary deadlines. On Nov. 10, he again promised he would “resolve this issue” in 10 days.\nAs the deadlines come and go, the black market currency exchange rate has risen to nearly 40% more than the official rate.\nArce’s office did not respond to interview requests.\n“The queues are getting longer and longer,” said 38-year-old driver Ramiro Morales, who needed a bathroom after four hours in line Tuesday but feared losing his place if he went searching for one. “People are exhausted.”\nIt’s a shocking turnaround for the landlocked nation of 12 million people that was a South American economic success story in the 2000s, when the commodities bonanza generated tens of billions of dollars under the nation’s first Indigenous president, former President Evo Morales.\nMorales, Arce’s one-time mentor, is his present-day rival in the fight to be the ruling party’s candidate next year.\nBut when the commodities boom ended, prices slumped and gas production dwindled. Now, Bolivia spends an estimated $56 million a week to import most of its gasoline and diesel from Argentina, Paraguay and Russia.\nEconomy Minister Montenegro on Tuesday pledged that the government would continue providing fuel subsidies that critics say it can’t afford.\nBanners from two years ago boasting that Bolivia’s inflation is the lowest in South America still greet tourists arriving at El Alto International Airport. Now, inflation is among the highest in the region.\nFuel shortages prevent farmers from getting their produce to distribution centers and markets, triggering a sharp price hike for food staples.\nLast week in La Paz and neighboring El Alto, hungry Bolivians jostled in long lines to buy rice after much-delayed shipments finally arrived from Santa Cruz, the country’s economic engine some 850 kilometers (528 miles) away.\nWith the diesel shortage affecting everything from the operation of tractors to the sourcing of machinery parts, the shortage is also hurting farmers during the crucial planting season.\n“Without diesel, there is no food for 2025,” said Klaus Frerking, the vice president of the Eastern Agricultural Chamber of Bolivia.\nThe prices of potatoes, onions and milk have doubled in El Alto’s main wholesale food market in the past month, vendors said, overshooting the country’s nearly 8% inflation rate.\nNervous Bolivians are cutting back on their consumption.\n“You have to search a lot to find the cheapest food,” said 67-year-old Angela Mamani, struggling to pull together meals for her six grandchildren at El Alto’s open-air market Tuesday. She planned to buy vegetables but didn’t have enough cash and went home empty-handed.\nThis week, Arce’s government presented a 2025 budget — with a 12% increase in spending — that drew backlash from lawmakers and business leaders who said it would lead to more debt and more inflation.\nWhile the governing Movement Toward Socialism party tears itself apart in the power struggle between Arce and Morales, both politicians have seen the economic morass as a way to strengthen their positions ahead of 2025 elections.\n“They deny there are problems. They blame external contexts and conflicts,” said Bolivian economic analyst Gonzalo Chávez.\nMorales’ supporters last month launched 24-day protest partly targeting Arce’s handling of the economy that blocked main roads and stranded commercial shipments, costing the government billions of dollars.\nSecurity forces broke up the rallies almost a month ago. But on Tuesday, Arce’s government continued to blame Morales’ blockades for spawning the ubiquitous fuel lines.\n“We need change,” said Geanina García, a 31-year-old architect scouring the grocery hub of El Alto for cheap deals — a once-routine errand that she said had turned into a nightmare.\n“People don’t live off politics, they live day to day, off of what they produce and what they earn.”\n____\nFollow AP’s coverage of Latin America and the Caribbean at https://apnews.com/hub/latin-america"
    },
    {
      "url": "https://apnews.com/article/bolivia-morales-arce-political-economic-crisis-d38051e051a2e6473a18133e4a9c6120",
      "text": "Bitter political fight in Bolivia is paralyzing the government as unrest boils over economic crisis\nBitter political fight in Bolivia is paralyzing the government as unrest boils over economic crisis\nLA PAZ, Bolivia (AP) — Protesters streamed into Bolivia’s capital, throats hoarse from chanting and feet blistered from a week of walking along the national highway.\nThe throngs of street vendors in the South American country’s vast informal work force ended their nearly 100-kilometer (60-mile) march from Bolivia’s mountain-rimmed plains with a call that summoned years of growing anger over the nation’s dangerously depleting foreign-exchange reserves: “We want dollars!”\nWith prices surging, dollars scarce and lines snaking away from fuel-strapped gas stations, protests in Bolivia have intensified over the economy’s precipitous decline from one of the continent’s fastest-growing two decades ago to one of its most crisis-stricken today.\n“We can change the country because we are the engine of production,” Roberto Ríos Ibáñez, secretary-general of Bolivia’s Confederation of Merchants, said as weary protesters broke for lunch around him in the capital’s traffic-snarled center. “The government doesn’t listen. That’s why we’re in the streets.”\nBolivia’s financial quagmire stems, at least in part, from an unprecedented rift at the highest levels of the governing party.\nPresident Luis Arce and his one-time ally, leftist icon and former President Evo Morales, are battling for the future of Bolivia’s splintering Movement for Socialism, known by its Spanish acronym MAS, ahead of elections in 2025.\nThe political fight has paralyzed the government’s efforts to deal with the deepening economic despair and analysts warn that the social unrest could explode in the historically turbulent nation of 12 million people.\nCracks in the governing party opened in 2019, when Morales, then Bolivia’s first Indigenous president, ran for an unconstitutional third term. He won a contested vote plagued by allegations of fraud, setting off mass protests that caused 36 deaths and prompted Morales to resign and flee the country.\nAfter an interim government took control in what MAS called a coup, Morales’ chosen successor, Arce, won election on a campaign promise to restore prosperity to Bolivia, once Latin America’s mainstay source of natural gas.\nArce had been Morales’ finance minister who oversaw years of strong growth and low inflation, but assuming the presidency in 2020, he encountered a bleak economic reckoning from the coronavirus pandemic. Diminished gas production sealed the end of Bolivia’s budget-busting economic model.\nStill hugely popular among Bolivia’s Indigenous communities, coca growers and union workers, Morales saw an opportunity. After returning from exile, the charismatic populist announced plans last year to run in the 2025 vote — setting himself on a collision course with Arce, who is expected to seek re-election.\n“Bolivia has an Indigenous majority and people will instinctively support someone like Morales based on what he represents,” said Diego von Vacano, an expert in Bolivian politics at Texas A&M University and former informal adviser to Arce. “Now they have the push factor, the lack of success of the Arce administration.”\nEarlier this month, Morales drew tens of thousands of loyalists to Cochabamba southeast of La Paz, galvanizing his rural stronghold.\n“We’re going to win the elections and we’re going to save Bolivia,” a triumphant Morales bellowed in a stadium filled with cheering supporters waving wiphalas, the checkerboards of bright colors to represent Bolivia’s many peoples.\nArce disputes the legitimacy of Morales’ campaign, arguing a 2023 constitutional court ruling bars him from running.\nLegal experts say it’s not so clear-cut.\n“We’ve seen both the politicians manipulate the courts to decide political issues that have major bearing on the constitution,” said Eduardo Rodríguez Veltzé, a Bolivian judge who served as president in 2005-2006.\nMorales, who proclaimed in his speech that “we have complied with the rules,” has threatened to unleash mass unrest if he is disqualified from running.\nMeanwhile, with the cash crunch denying access to dollars to pay suppliers abroad, Bolivian merchants have produced extraordinary scenes on the border with Brazil and Peru by clamoring to buy the U.S. currency at inflated prices in the neighboring countries.\nWhen exchange shops in La Paz ran dry last year, Bolivians waited in line all night outside the Central Bank to get hard currency.\nIt’s a striking contrast to Bolivia’s boom at the turn of the 21st century. Buoyed by a windfall of export revenue, Morales’ government pulled the poverty rate down to 15%, expanded the middle class and built up sprawling cities and roads.\nTrouble began in 2014 when commodity prices plunged and the government dipped into its currency reserves to sustain spending. Then it drew on its gold reserves and even sold its dollar bonds locally.\n“We ate up the savings and now we are scraping the pot,” said Gonzalo Chávez, economics professor at Bolivia’s Catholic University.\nWith the government forking out $2 billion a year to import heavily subsidized gasoline in an effort to quell public discontent, the squeeze has tightened. The Fitch rating agency in February downgraded Bolivia’s debt deeper into junk territory, assigning it a CCC rating.\nAnd the fight over MAS is exacerbating economic woes.\nMorales’ allies in Bolivia’s Congress have consistently thwarted Arce’s attempts to take on debt that would relieve the pressure. Bolivia sits on a treasure trove of lithium, but lawmakers won’t give Arce approval to let foreign companies extract it.\nArce calls the gridlock an “economic boycott” aimed at subverting his presidency.\nSeeking to ease investor fears, Finance Minister Marcelo Montenegro denies there is any crisis. But the long lines of frustrated motorists outside gas stations suggest otherwise. In recent days, angry truckers have blocked roads and burned tires.\n“Arce has dismantled our social organizations while abandoning his management of the economy,” said Jorge Cucho, an Indigenous leader and activist. “Prices have increased by 70%. Our salaries are no longer enough to go to the market.”\nThe tensions tearing at MAS offer Bolivia’s opposition its first real shot at power since Morales won an unprecedented electoral majority in 2005. Centrist and conservative politicians have jumped into the field. But the opposition is fractured and its legitimacy is in question, with dozens of its politicians behind bars.\n“The opposition has far more opportunities now due to the division,” said Fernando Mayorga, a sociologist at Bolivia’s public university in Cochabamba. “So far, we’ve seen no signs that it can act on them.”\nBolivians who are incensed by Morales but disappointed by Arce say the country stands at a perilous crossroads.\n“The people are asleep,” said Ibáñez, the union leader. “Soon they’ll begin to rise up.”\n___\nDeBre reported from Buenos Aires, Argentina."
    },
    {
      "url": "https://apnews.com/article/china-latin-trade-tariffs-us-jinping-de2a3faa01ce6e98617cbecd74658c34",
      "text": "China seeks a united front with Latin America in countering Trump’s trade war\nChina seeks a united front with Latin America in countering Trump’s trade war\nTAIPEI, Taiwan (AP) — China is moving to strengthen its alliances with other countries as a counterweight to President Donald Trump’s trade war, presenting a united front with Latin American leaders a day after China and the U.S. agreed to a 90-day truce in their tariffs stalemate.\nChina’s leaders have positioned the world’s second-largest economy as a reliable trade and development partner, in contrast to the uncertainty and instability from Trump’s tariff hikes and other policies.\nOn Monday, Beijing and Washington announced their breakthrough on tariffs after weekend talks in Geneva, Switzerland, where they agreed to cut sky-high import duties on both sides for 90 days to allow for negotiations.\nStill, Beijing’s ire over the trade war remains apparent. Speaking to officials from China and Latin America on Tuesday, Chinese leader Xi Jinping reiterated Beijing’s stance that nobody wins a trade war and that “bullying or hegemonism only leads to self-isolation.”\nHaving moved to defuse antagonisms with the U.S., Xi said China stands ready to “join hands” with Latin countries “in the face of seething undercurrents of pure political and bloc confrontation and the surging tide of unilateralism and protectionism.”\n“There are no winners in tariff wars or trade wars,” Xi said, reiterating a phrase China has used repeatedly when referring to Trump’s policies.\nWhen Trump began raising tariffs on Chinese products during his first term in office, China retaliated by diversifying its purchases of key farm products, such as soybeans and beef, away from U.S. suppliers. Brazil and other Latin American countries have benefited from that strategy.\nAlso Tuesday, the head of the World Trade Organization appealed to Japan to fight disruptions to world commerce from Trump’s fast-changing tariffs and other policies.\n“Trade is facing very challenging times right now and it is quite difficult,” Ngozi Okonjo-Iweala, director-general of the Geneva-based WTO, told Japanese Prime Minister Shigeru Ishiba while on a visit to Tokyo.\nJapan, as “a champion of the multilateral trading system” must help maintain, strengthen and reform the WTO, the Japanese Foreign Ministry cited her as saying.\nJapan is among many countries yet to reach a deal with the Trump administration on hikes to U.S. tariffs, including those on autos, steel and aluminum.\nThe WTO played a pivotal role in past decades as the U.S. and other major economies crusaded for the more open markets that facilitated the growth of global supply chains, many of which are anchored in China.\nBy dismantling many protectionist barriers to trade, it has aided the ascent of Japan and China, and many other countries, as export manufacturing hubs.\nSince taking office for a second time, Trump has prioritized higher tariffs to try to reduce U.S. imports and compel companies to locate factories in the United States, doubling down on a trade war that he launched during his first term.\nThe realities of Trump’s global trade offensive overshadowed an initial burst of optimism over the China-U.S. deal among investors, as rallies in stocks and oil prices faded on Tuesday.\nSpeaking to the China-CELAC, or Community of Latin American and Caribbean States, Forum, Xi, the Chinese leader, announced plans to build closer ties with Latin America through political, economic, academic and security exchanges.\nHe promised to boost imports from the region, to encourage Chinese companies to increase their investments, and said Beijing plans to expand cooperation in clean energy, 5G telecommunications and artificial intelligence. He also announced a new 66 billion yuan ($9.2 billion) credit line to support Latin American and Caribbean financing.\nChina’s trade with the region has been growing rapidly, exceeding $500 billion for the first time last year, as it imported more farm products such as soybeans and beef, energy resources such as crude oil, iron ore, and critical minerals.\nBeijing’s investments in the region through Xi’s Belt and Road Initiative, or BRI, have included installing 5G networks and building ports and hydropower plants.\nColombian President Gustavo Petro announced Monday that his country would formally join the BRI – in a vote of confidence after several Chinese projects in Latin America hit snags in recent months.\nIn other pledges, Beijing plans to invite 300 members from Latin American political parties to China annually for the next three years and facilitate 3,500 government scholarships and various other types of exchanges.\nFive Latin American countries will receive visa exemptions for travel to China, with more to follow, Xi said. It was not immediately clear which countries would become visa exempt.\n___\nAssociated Press writer Mari Yamaguchi contributed from Tokyo."
    },
    {
      "url": "https://apnews.com/general-news-8796ffbee9ca414b9188ed0e4fc1709b",
      "text": "A look at the Operation Condor conspiracy in South America\nBUENOS AIRES, Argentina (AP) — Argentina’s last dictator and 14 other former military officials were sentenced to prison Friday for human rights crimes committed during the Operation Condor conspiracy. Here is a look at the clandestine program’s main features:\nWHAT WAS OPERATION CONDOR?\nIt was a coordinated effort by the military dictatorships in Argentina, Chile, Paraguay, Bolivia, Uruguay and Brazil to hunt down and eliminate opponents and leftists across the continent and beyond. It operated from the mid-1970s to the early 1980s.\nHOW DID IT WORK?\nOperation Condor officially began in 1975, when South America’s dictatorships agreed to exchange information on political dissidents, trade unionists, students and anyone suspected of being a leftist, especially those who had sought refuge in other countries. According to declassified documents, various U.S. government agencies were aware of the plan.\nThe covert program involved the deployment of special transnational teams to kidnap subversive “targets,” who were then interrogated and tortured in seven clandestine prisons located on military or police bases in Argentina, Paraguay, Uruguay and Chile. The dissidents were sometimes returned to their country of origin and disappeared.\nCondor’s agents also assassinated political leaders seen as influencing public opinion against the military regimes. Some of their targets were in the United States and Europe. The September 1976 assassination of Orlando Letelier, the foreign minister under Chile’s socialist President Salvador Allende, was the best-known case. Letelier and U.S. citizen Ronni Moffitt were killed by a bomb placed in his car in Washington D.C. Investigators found that the Chilean dictatorship’s spy agency, known as DINA, and an anti-Castro group, many of whose members had been trained by the CIA, were behind the assassination.\nWHO WERE CONDOR’S MASTERMINDS?\nChilean dictator Augusto Pinochet, Paraguayan strongman Alfredo Stroessner, Bolivia’s Hugo Banzer, Argentine dictator Jorge Videla and Juan Maria Bordaberry of Uruguay. While no representative of Brazil signed the operation’s charter, its government cooperated with the program and dissidents were killed and kidnapped in Brazilian territory.\nHOW MANY VICTIMS?\nAccording to a 2015 report by UNESCO’s International Center for the Promotion of Human Rights, Operation Condor had 376 victims: 177 Uruguayans, 72 Argentines, 64 Chileans, 25 Paraguayans, 15 Peruvians, 12 Bolivians, five Brazilians, three Cubans, two Americans and a Spaniard.\n___\nThis story has been corrected to reflect that Ronni Moffitt was not an aide to the former ambassador."
    },
    {
      "url": "https://apnews.com/article/bolivia-elections-evo-morales-president-arce-courts-516b20a0f5fbcfb48aedd1a1f68b1e27",
      "text": "Bolivia’s electoral tribunal bans ex-leader Morales and suspends a key candidate, drawing backlash\nBolivia’s electoral tribunal bans ex-leader Morales and suspends a key candidate, drawing backlash\nLA PAZ, Bolivia (AP) — Bolivia’s top electoral tribunal on Tuesday disqualified former President Evo Morales from running in the August presidential vote and suspended the candidacy of the other main leftist contender, immediately vaulting President Luis Arce’s governing socialist party into the ranks of front-runners despite its unpopularity.\nThe moves targeted the two strongest leftist challengers to Arce’s nominee: Morales, Bolivia’s first Indigenous president who governed the country from 2006 until his ouster in 2019, and Andrónico Rodríguez, the young Senate president who hails from Morales’ rural coca-growing bastion.\nBoth Morales and Rodríguez vowed to fight the decisions and condemned them as a blow to the Andean nation’s fragile democracy.\n“The parties that want to support me have been persecuted,” Morales, who still commands fervent support in his tropical highland stronghold, told a local radio show. “The battle is not lost. We will wage a social and legal battle.”\nOn social media, he voiced alarm over “the grave threat facing democracy today.”\nMorales has repeatedly promised that Bolivia would “convulse” if the electoral tribunal bars him from the race, heightening a sense of crisis in the run-up to the deeply polarized vote scheduled for Aug. 17.\nPresident Arce dismissed their criticism, asking only that “the electoral dispute not generate political and economic instability.”\nRodríguez — a fresh-faced 36-year-old candidate who generated excitement among voters disillusioned with Morales’ fifth presidential bid and outraged with Arce’s handling of Bolivia’s worst economic crisis in 40 years — also called for protests against what he called “a political decision” to suspend his candidacy.\n“No ruling or judicial decision driven by political interests can overrule the sovereign will of the people,” he wrote on X.\nThe Supreme Electoral Tribunal gave narrow, technical reasons for the decisions as the window closed for candidates to register their political parties.\nA power struggle between Morales and his former ally and finance minister, President Arce, has fractured their dominant Movement Toward Socialism party, or MAS, forcing Morales to break off and create his own political party.\nArce, whose popularity has plunged as inflation surges and fuel shortages paralyze the country, dropped out of the race last week and nominated his senior minister, Eduardo del Castillo, as the MAS party candidate.\nA stern-faced lawyer and loyalist of Arce who oversaw police crackdowns on anti-government protests over the last year, Del Castillo has struggled to summon the kind of support enjoyed by Morales and Rodríguez.\nDivisions are also splitting the vote on the right, which has left the anti-MAS movement without a clear front-runner to seize on what could otherwise be the opposition’s first real shot at victory after almost two decades of left-wing rule.\nAccording to the list published Tuesday by the Supreme Electoral Tribunal, the successfully registered opposition candidates include Samuel Doria Medina, 66, a former cement tycoon notorious for his multiple unsuccessful presidential bids.\nThere’s also Jorge “Tuto” Quiroga, who promoted market-friendly reforms as president from 2001-2002 after serving as vice president to the late military dictator, Hugo Banzer, in a government accused of widespread human rights abuses.\n“Morales is out of the race,” Tahuichi Tahuichi, a member of the board, declared on Tuesday.\nMorales’ disqualification, though controversial, had been expected. His recently formed political faction, “Evo Pueblo,” lacks official party status, the electoral tribunal said, while an allied party that planned to host his candidacy failed to meet other legal requirements.\nEven as Morales continued to insist on the legitimacy of his candidacy, a divisive ruling by the Constitutional Tribunal that bans citizens from running for more than two presidential terms also complicates his path back to the presidency.\nSome analysts see that ruling — made by Arce-allied judges that interfered in judicial elections to extend their own terms — as emblematic of how the judiciary in Bolivia has been undermined by political wrangling.\n“Arce benefited from the rapid deterioration of the already weak justice system, failed to enact desperately needed reforms and manipulated the courts to his advantage,” said Kathryn Ledebur, director of the Andean Information Network, a Bolivian research group.\n“This lack of due process and rule of law make the upcoming elections a free-for-all with an unpredictable, unsustainable outcome.”\nMore surprising was the tribunal’s decision to suspend Rodríguez’s candidacy pending a hearing on the legality of his political alliance. Judges accepted his appeal and set a first tribunal session for Wednesday.\nThe new constraints on the candidates also drew criticism even from officials within the Supreme Electoral Tribunal.\n“The democratic system is at risk by legal actions affecting the normal development of elections,” wrote Francisco Vargas, a member of the electoral body. “I am alerting the country and the international community.”\n___\nDeBre reported from Buenos Aires, Argentina.\n____\nFollow AP’s coverage of Latin America and the Caribbean at https://apnews.com/hub/latin-america"
    },
    {
      "url": "https://apnews.com/article/bolivia-evo-morales-president-arce-campaign-f60ff6a58041d01fe910c65f409d0b05",
      "text": "Bolivia’s former leader Evo Morales seeks a political comeback from his stronghold in the tropics\nBolivia’s former leader Evo Morales seeks a political comeback from his stronghold in the tropics\nLAUCA Ñ, Bolivia (AP) — Bolivia’s former leader Evo Morales has a campaign pitch for 2025 that has worked elsewhere: Other politicians of recent years have brought you nothing but misery. It’s time for a return to the past.\nHis supporters are looking to Morales for a rescue from the five tumultuous years since his 2019 resignation. The country’s first Indigenous president, Morales is credited with spreading the wealth of a commodities boom and ushering in a rare stretch of social and economic stability during his nearly 14 years in office.\nHis detractors say Morales — who built an economy uncomfortably dependent on natural gas reserves and sought to stay in power longer than Bolivia’s constitution allows — bears responsibility for much of the turmoil that followed his tenure.\nAn ally turned rival\nA bitter political battle is looming between Morales, 65, and his former economy minister and once-protégé, President Luis Arce, over who will lead their long-dominant leftist Movement Toward Socialism, or MAS, into the August 2025 election.\nArce has unleashed allies in the judiciary against Morales, with the Constitutional Court disqualifying Morales’ candidacy and ousting him from the leadership of MAS, a party he helped found in the 1990s.\nProsecutors in mid-December charged Morales with statutory rape for fathering a child with a 15-year-old girl when he was 56 and president. Morales didn’t deny the relationship but accused Arce of deploying a “dirty, odious” campaign to undermine him.\nFighting from the tropics\nSince talk of his arrest warrant surfaced in September, Morales has been holed up in Bolivia’s coca-growing region of Chapare, ringed by loyal supporters.\nHere, the former coca farmer and fiery union leader — long considered one of the last of the so-called “pink wave” of leftist leaders who once dominated Latin American politics — is planning his comeback.\nFew outsiders are allowed inside his stronghold in Bolivia’s steamy lowlands, but The Associated Press was invited last month for a look from behind the barricades.\n“They don’t want me to be the candidate because they know I’ll win,” Morales told the AP. “We’re in a state of total siege, morally, legally and politically.”\nThe four-hour drive to Chapare from Bolivia’s third-biggest city of Cochabamba is steep and slick with mist.\nA narcotics checkpoint from the U.S.-financed war on drugs that wreaked havoc across this jungle is far less intimidating than the makeshift checkpoints manned by Morales’ followers.\nIn the ‘Land of Evo’\nAs the van rumbled on, Pedro Cepita, a guide tasked with accompanying the AP, pointed out Morales’ accomplishments in the long-stigmatized Chapare — university buildings, cell towers, an airport, a 25,000-seat soccer stadium.\nMorales’ face adorns murals alongside cult heroes like Che Guevara and Fidel Castro. “Evo 2025-2030” slogans blanket brick houses.\n“We’re in la Tierra de Evo,” Cepita said — the Land of Evo.\nAt sandbagged checkpoints, Morales’ supporters — some with batons on their belts — waved the van through only after recognizing Cepita.\nSecurity forces, chased out by Morales’ followers, rarely venture here. Door-knocking census workers — even emergency rescuers responding to a deadly landslide last month — said they were harassed and kicked out by Morales’ coca union activists.\nEarlier this month and after 40 days of negotiations, police began trickling back.\nAlmost divine reverence\nCoca farmers drying their leaves proudly recount how Morales kicked out U.S. anti-drug agents almost in the same breath as they extoll the benefits of the coca plant, cherished by Indigenous communities and maligned by the West as the raw material for cocaine.\n“Brother Evo was in these fields with us,” said Jose Luis Calicho, 39, nodding toward Morales’ own plot of land. “He knows we’re not criminals, we’re not narco-traffickers.”\nSince October, when gunmen opened fire at his convoy, Morales, who was unharmed, has slept inside the fortress-like compound of his coca-growing union. He says the shooting was an assassination attempt and blames Arce’s government, which denies involvement.\nOutside the high walls, dozens of his followers lounge on tarps blocking the street. Some rest after all-night security shifts, others keep watch, their cheeks bulging with wads of coca — a mild stimulant.\n“It’s our responsibility to Evo, we can’t take chances,” said Reyna Peñaloza, 44. “With us, he’ll return to power.”\nA stark disconnect\nThose who believe Morales’ comeback can close the door on years of political and economic paralysis are less clear about the kind of future he could bring.\n“When I came to power in 2005, the nation was suffering, and I transformed it,” Morales said. “Now our crisis is even worse. We don’t have fuel, we don’t have dollars.”\nMost Bolivians, stinging from surging inflation and waiting in long lines to fill their tanks, agree on that.\nBut attitudes toward Morales are starkly different in his remote redoubt in Chapare and the rest of the country of 12 million — especially when it comes to the 2016 statutory rape case that indelibly tarnished his reputation.\nIn the upscale districts of La Paz, the capital, residents say they’re repulsed by his actions. Freshly painted graffiti asks: “Would you vote for a pedophile?”\n“The political damage to Evo’s good image is devastating,” said Romer Alejo, a criminal lawyer in La Paz.\nInformal efforts to gauge public opinion in La Paz suggests that two or three out of every 10 Bolivians would vote for him.\nHis critics condemn Morales’ constitution-bending efforts to hold onto power longer than any leader in Bolivia’s modern history.\n“We’re at a breaking point,” said Martín Sivak, the author of a biography on Morales. “There’s a verdict from Bolivians on this idea of staying in power for too long.”\nA long way to go\nLegal troubles aside, whether Morales can reclaim his party and the country’s top job is unclear. His supporters say he’ll find a way around the court ban — perhaps by launching a new party.\nBut the packed crowds of 2014 are no longer there.\nA recent MAS congress in Chapare declared Morales was the party’s “only legitimate candidate,” but a “Viva, Evo!” chant faded quickly in the half-full auditorium.\nStill, Bolivia’s right-wing opposition is fractured. Protests are mounting over Arce’s failure to halt a currency collapse. Morales’ supporters threaten to convulse the country if he’s not on the ballot.\n“We’ll win through our struggle,” Morales loyalist and lawmaker Alina Canaviri Sullcani said. “There’s no alternative.”\nEven if Morales has become too divisive, without him, many fear the long unstable Andean nation could veer back toward chaos.\nMorales’ 2019 ouster elevated a right-wing interim president, Jeanine Áñez, who cracked down on her political opponents and sought to purge Morales’ legacy.\nOn a hot, sticky morning last month, Morales emerged from his hideout with heavy security, to check on his fields. As he hunched over to cut weeds, his aides pulled out their smartphones to film him — a throwback to the early 2000s, when videos of the son of llama famers in his humble alpaca sweater were a magnet for foreign media.\nBut Morales didn’t seem to notice. When everyone had gone, he kept on working. He said he wasn’t close to finishing."
    },
    {
      "url": "https://apnews.com/article/4ab62e17d35d4b5c89380235e01f0689",
      "text": "Morales declares victory in Bolivia as foes keep protesting\nMorales declares victory in Bolivia as foes keep protesting\nLA PAZ, Bolivia (AP) — President Evo Morales on Thursday declared himself victor of the weekend election, stirring more anger among his opponents who have protested for days claiming fraud in the vote count, while the U.S., Brazil, Argentina and Colombia joined in calling for Bolivia to hold a runoff between the incumbent and his top challenger.\nElectoral authorities, meanwhile, announced late in the day that voting would have to be held again in five spots in the Amazonian Beni region because of irregularities in Sunday’s vote. They said the re-votes to be held Nov. 3 wouldn’t change the outcome, but the development still added to the unrest over a long, contentious tally of ballots.\nWith 99.99% of votes counted, Morales had 47.07% to 36.51% for former President Carlos Mesa, who finished second in the nine-candidate field. That gave Morales a 10.56-point lead, a little more than a half point over the threshold he needed to win an outright victory and avoid a second-round ballot in December probably against a united opposition.\n“We won in the first round,” Morales declared at news conference early in the day, after he first edged over the threshold during the night. The president, the region’s longest-serving leader who is seeking a fourth consecutive term, said he was bolstered by the rural vote.\nMorales later backtracked a bit, saying he would be open to a runoff if he fell short of the 10-point lead when official totals were announced.\nA communique issued by Colombia’s foreign ministry on behalf of the U.S., Brazil and Argentina said the governments of the four nations “will only recognize results that reflect the will of the Bolivian people.”\nThe European Union took a similar stand, saying it backed a call by the Organization of American States for a second-round election that could help Bolivia regain its footing after days of sometimes violent protests by opposition supporters angered by the slow vote count and an unexplained 24-hour halt in the release of results.\n“The European Union shares the OAS’ assessment that the best option would be to make a runoff to restore trust and ensure full respect for the democratic elections of the Bolivian people,” the EU said in a statement that also called for the parties to refrain from further violence.\nThere was no comment from Morales about the outsiders’ questions on the fairness of the election’s opening round.\nOpposition leaders were united in rejecting Morales’ victory claim as the president’s supporters were out celebrating. Analysts have said a united opposition might stand a chance in a second round of defeating Morales, a leftist former coca-growers union leader who has governed the Andean nation for 14 years.\nFlanked by other opposition leaders, Mesa read a statement calling for “citizens and social groups to remain peacefully mobilized until they obtain respect for the will of the people.”\nMorales, in turn, urged his supporters to defend his win and denied electoral fraud, demanding his detractors show proof.\n“We are at the start of a crisis that could affect the social, political and economic stability of the country,” said political analyst Jorge Dulón at Bolivian Catholic University.\nThe Andean nation has been on a knife-edge since the bitterly disputed vote.\nOpposition backers have stage rowdy protests since Monday and burned Supreme Electoral Tribunal offices in three cities. The opposition bastion of Santa Cruz has seen two days of a partial strike “in defense of the vote and democracy.”\nOn Thursday, Morales supporters announced marches in the coca-growing region of Chapare, a bastion of support for the president.\nInternational vote monitors have questioned the early daylong gap in reporting results before a sudden spurt in Morales’ vote percentage. An OAS observer mission released a statement expressing its “concern and surprise over the drastic change and difficult to justify tendency in the preliminary results.”\nMorales had repeatedly said since late Sunday that he won the vote outright and that his opponents are conspiring to oust him.\nSuspicions of electoral fraud rose when officials abruptly stopped releasing results from the quick count of votes hours after the polls closed Sunday. Morales was leading at the time, but also falling several percentage points short of the 10-ppoint edge he needed to avoid being forced into a runoff for the first time in his four election contests.\nTwenty-four hours later, the electoral body suddenly released an updated figure, with 95% of votes counted, showing Morales just 0.7 percentage point short of the 10-point advantage. Since then, results have slowly been updated.\nMorales, 59, a native Aymara from Bolivia’s highlands, became the country’ first indigenous president in 2006 and easily won the two following elections amid more than a decade of a commodities-fed economic boom in South America’s poorest country. He paved roads, sent Bolivia’s first satellite to space and curbed inflation.\nBut he has faced growing dissatisfaction, especially over his refusal to accept the results of a 2016 referendum to keep limits on presidential terms. The country’s top court, considered by critics as friendly to the president, ruled that limits would violate Morales’ political rights as a citizen."
    },
    {
      "url": "https://apnews.com/article/f8e640b49c9b4a0896ac642620c15fe1",
      "text": "Violent clashes escalate in Bolivia over election dispute\nViolent clashes escalate in Bolivia over election dispute\nLA PAZ, Bolivia (AP) — Bus drivers armed with sticks and rocks tried to break through street blockades Tuesday in a second week of protests against Bolivian President Evo Morales triggered by a dispute over election results.\nDemonstrators supporting Morales and backers of opposition leader Carlos Mesa also clashed in downtown La Paz, while police fired tear gas to disperse both sides.\nViolent clashes a day earlier left 40 people injured in the cities of Cochabamba and Santa Cruz. Police said 20 people were detained.\nSanta Cruz, an eastern city that is a stronghold of opposition sentiment, has been paralyzed by protests.\nSupporters of Mesa say results from the Oct. 20 election were rigged to give Morales enough votes to avoid a second round that he might lose to a unified opposition. Mesa is demanding new elections or a runoff vote.\nSpeaking to a large crowd of supporters in the city of El Alto on Monday, Morales proclaimed victory.\n“Show us where there was fraud,” said Morales, who denies irregularities and says he welcomes an international audit of the election. The leftist leader accused “the right” of trying to orchestrate a coup d’état.\nConservatives have always distrusted the leader of the Movement Toward Socialism party who has been in power for nearly 14 years. Many were also angered by his decision earlier to seek another re-election despite a popular referendum that upheld term limits. A Supreme Court ruling made it possible for Morales to run, in the end.\n“The critical factor is whether the historic citizen mobilizations in Bolivia today can be sustained over time, which would render the country virtually ungovernable,” said Michael Shifter, president of the Inter-American Dialogue and professor of Latin American politics at Georgetown University.\n“The country’s social and economic progress under three Morales administrations is undeniable, but does not mean, as he seems to believe, that the positive record entitles him to another term, no matter what the constitution says or what the citizens decide.”"
    },
    {
      "url": "https://apnews.com/article/bolivia-judicial-elections-morales-mexico-overhaul-constitution-beba1908c766b982dd90532723062e38",
      "text": "Bolivia’s divisive popular vote for senior judges offers lessons for Mexico\nBolivia’s divisive popular vote for senior judges offers lessons for Mexico\nLA PAZ, Bolivia (AP) — Campaigning in Bolivia for Sunday’s judicial election may be strictly forbidden, but look closer on the streets of the capital La Paz and you’ll find that some candidates have sneakily plastered their faces on packs of corn puffs and others have slipped subtle slogans into official voting manuals.\nAfter all, it’s a popular vote, and even a bit of PR can work wonders when voters know nothing about the dozens of names on their sprawling ballot papers.\nBolivia is the only country in the world that holds elections for top judicial posts. Soon Mexico will, too, after former President Andrés Manuel López Obrador pushed through a highly contentious overhaul of the justice system in the face of mass protests.\nAs Bolivia’s ex-President Evo Morales did when remaking the judiciary in 2009, López Obrador has championed the overhaul as a way to purge the corrupt elite and boost democracy.\nBolivia’s current President Luis Arce on Sunday hailed the elections as a “milestone in democracy” as he cast his ballot in La Paz.\nBut apathetic Bolivian voters say the elections have so far had the opposite effect, turning their courts from neutral arbiters into political prizes.\n“I’ll flip a coin,” said 25-year-old architecture student Marisol Nogales when asked how she would vote.\nVoting is mandatory in Bolivia, and long lines snaking from polling stations across the country exacerbated public frustration over the election.\n“Most of us who came to vote don’t know the candidates,” said Franz Condori, queuing under the bright sun in the western highland town of Jesus de Machaca. ”This has to change.”\nIt’s never easy to find supporters of Bolivia’s system of electing judges, which, over a decade ago, replaced a nomination system rooted in qualifications and training.\nAcross the world, academics, investors and judges have warned that judicial elections can cement the dominance of the ruling party and gut checks and balances. Across Latin America, from El Salvador to Honduras, experts have characterized politicized judiciaries as profound threats to democracy.\nOver 50 countries go to the polls in 2024\n- The year will test even the most robust democracies. Read more on what’s to come here.\n- Take a look at the 25 places where a change in leadership could resonate around the world.\n- Keep track of the latest AP elections coverage from around the world here.\nIn Bolivia, even senior judicial officials struggle to defend the election.\n“Citizens don’t like this system of electing judges, but it’s what we have,” said Oscar Hssenteufel, president of the Supreme Electoral Tribunal, as he kicked off Sunday’s vote.\nFrancisco Vargas, the tribunal’s vice president, strained to sound positive.\n“It should be a calm, easy and simple process,” he told The Associated Press. “It has become very litigious, very controversial.”\nSunday’s vote was supposed to take place in late 2023, but as that deadline approached the Constitutional Court — packed with allies of Arce — suddenly intervened to push it back a year, escalating his power struggle with his former mentor and current rival, Morales, over who will lead their long-dominant leftist party into Bolivia’s 2025 presidential election.\nBoth understand that whoever wins over the Constitutional Court ensures their own political survival.\nArce cited the paralysis of their divided party in justifying the vote’s delay. Morales’ loyalists, who hold a majority in Congress and could have determined the shortlist of judicial candidates, accused Arce of illegally extending the mandates of friendly judges for fear of losing influence over the courts.\n“What happened was disorder, the kind that can lead us to a greater conflict,” said Iván Lima, a former minister of justice.\nWith voting underway, results are expected within a week. But there’s a wrinkle: it’s a partial election. Only four out of nine seats on the powerful Constitutional Court are up for grabs. The other five — the majority of sitting judges, as it happens — will stay in their posts.\n“The judges have turned the Constitutional Court into a sort of super power,” said Bolivian political analyst Paul Coca.\nSunday marks the third time that Bolivia has held judicial elections. If the past two rounds under then-President Morales, in 2011 and 2017, are any indication, turnout will be low. Both times, the majority of Bolivians, outraged or simply baffled by the notion of endorsing unknown judges pre-selected by Morales’ allies with little transparency, voted null.\nCritics questioned the legitimacy of the elected judges. But they nonetheless shaped the course of Bolivian democracy.\nIn 2016, Morales asked Bolivians in a legally binding referendum to decide whether to let him run for a fourth term, in defiance of a two-term limit established in the 2009 Constitution he had backed.\nWhen he didn’t get the answer he wanted — a majority voted “no” — his party found a workaround through the Constitutional Court, where pliant judges ruled that denying Morales another term as president would violate his human rights.\n“This was his major mistake,” said Eduardo Rodríguez Veltzé, a former chief justice of the Supreme Court.\nIt was Morales’ decision to run again in 2019 that brought a precipitous end to his remarkable 14-year tenure and ushered in a surreal parade of crises. As allegations of electoral fraud sent angry crowds into the streets, Morales resigned under pressure from the military and went into exile.\nFive years after coming under fire for allegedly manipulating the courts, Morales now finds himself on the receiving end of the judiciary he overhauled.\n“First Evo’s party used the court to challenge the referendum’s results to promote another candidacy. Then Arce’s administration colluded with the same Constitutional Court to delay and reduce judicial elections to favor the self-prorogated judges running politics through judicial review,” Veltzé said.\nThe court endorsed a controversial ruling last year that Arce insists blocks Morales from running for president in 2025. Prosecutors issued an arrest warrant for Morales in October 2023 after reviving a 2016 statutory rape case against him.\nAnd earlier this week, the country’s top criminal court swiftly extradited Morales’ former anti-drug chief to stand trial in the United States on charges of cocaine trafficking, despite criticism from legal experts unsatisfied by the court’s review of evidence.\n“They’ve been trying to destroy me morally, legally and politically,” Morales told the AP.\nVargas is quick to insist that Bolivia is not some kind of strange outlier for electing judges. The U.S., Switzerland and Japan also hold judicial elections. But, he conceded, not in such a sweeping way as Bolivia does, or as Mexico will.\nMexico’s new president, Claudia Sheinbaum, bracing for fallout from the overhaul she inherited, is keen to see how Bolivia’s vote plays out. The National Electoral Institute, the Mexican voting authority, sent a delegation to observe the process in La Paz this weekend, Vargas said.\nWhen asked whether he would recommend that Mexico follow Bolivia’s example, Vargas let out a sharp laugh.\n“If you want me to tell you my personal opinion,” he said, “it might cause me some problems.”\n___\nAssociated Press writer Carlos Valdez in La Paz, Bolivia, contributed to this report."
    },
    {
      "url": "https://apnews.com/general-news-f9418618222e4531bee5d505ab5869ae",
      "text": "Bolivia’s Morales coasts to 3rd term as president\nLA PAZ, Bolivia (AP) — Evo Morales easily won an unprecedented third term as Bolivia’s president Sunday on the strength of the economic and political stability the coca growers’ union leader has brought to the South American country.\nMorales, a native Aymara from Bolivia’s poor, wind-swept Andean plateau, received 60 percent of the vote against 25 percent for cement magnate Samuel Doria Medina, the top vote-getter among four challengers, according to a quick count of 97 percent of the voting stations by the Ipsos firm for ATB television.\nDoria Medina conceded defeat late Sunday promising to “keep working to make a better country.”\nMorales’ supporters ran out into the streets to celebrate the win. In a victory speech from the balcony of the presidential palace in La Paz, Morales dedicated his victory to Cuba’s Fidel Castro and the late Venezuelan president, Hugo Chavez.\n“It is triumph of the anti-colonialists and anti-imperialists,” Morales said in a booming voice. “We are going to keep growing and we are going to continue the process of economic liberation.”\nMorales won eight of Bolivia’s nine states, including the former opposition stronghold of Santa Cruz, an agribusiness center in the eastern lowlands where he polled 51 percent, according to Ipsos.\nMorales will now eclipse as Bolivia’s longest-serving leader consecutively in office the 19th century Marshal Andres de Santa Cruz, a founder of the republic in power from 1829-1839.\nWhile known internationally for his anti-imperialist and socialist rhetoric, the 55-year-old coca growers’ union leader is widely popular at home for a pragmatic economic stewardship that spread Bolivia’s natural gas and mineral wealth among the masses.\nA boom in commodities prices increased export revenues nine-fold and the country has accumulated $15.5 billion in international reserves. Economic growth has averaged 5 percent annually, well above the regional average. A half a million people have put poverty behind them since Bolivia’s first indigenous president first took office in 2006.\nPublic works projects abound, including a satellite designed to deliver Internet to rural schools, a fertilizer plant and La Paz’s gleaming new cable car system. His newest promise: to light up La Paz with nuclear power.\n“I voted for Evo Morales because he doesn’t forget the elderly,” said Maria Virginia Velasquez, a 70-year-old widow. Universal old-age pensions — Velasquez gets $36 a month — are among the benefits instituted by Morales that have boosted his popularity.\nMorales had sought Sunday to improve on his previous best showing — 64 percent in 2009 — and to maintain a two-thirds control of Bolivia’s Senate and assembly. That would let him change the constitution, which restricts presidents to two 5-year terms, so he can run again.\nHe has not said whether he would seek a fourth term, only that he would “respect the constitution.” He did say in a TV interview last week, however, that he didn’t believe people over the age of 60 should be president.\nA court ruled last year that Morales could run for a third term because his first preceded a constitutional rewrite. All seats were up for grabs in the 36-member Senate and 130-member lower house. Results were not immediately available.\nMorales’ critics say he spent tens of millions in government money on his campaign, giving him an unfair advantage. And press freedom advocates accuse him of gradually silencing critical media by letting government allies buy them out. Morales didn’t attend the campaign’s lone presidential debate and state TV didn’t broadcast it.\n“There is no functional opposition, left, right or otherwise,” said Jim Shultz, executive director of the left-leaning Democracy Center based in Bolivia and San Francisco.\nMorales has capitalized on his everyman image while his Movement Toward Socialism party has consolidated control over state institutions. He long ago crushed and splintered the opposition, nationalized key utilities and renegotiating natural gas contracts to give the government a bigger share of profits.\nHis image-makers built a cult of personality around him. Stadiums, markets, schools, state enterprises and even a village bear Morales’ name. In the center of the capital, crews are building a second presidential palace, a 20-story center complete with a heliport.\nYet Morales has alienated environmentalists and many former indigenous allies by promoting mining and a planned jungle highway through an indigenous reserve.\nAnd despite Bolivia’s economic advancements, it is still among South America’s poorest countries. Nearly one in five Bolivians lives on less than a dollar a day.\nMany analysts think Bolivia depends too much on natural resources and is especially susceptible to the current easing in commodities demand from China.\n“Evo’s balancing act will be increasingly tough to maintain,” said Michael Shifter, president of the Washington-based Inter-American Dialogue think tank. “Although Evo has proven to be a resourceful and resilient politician, who knows his country well, it would be surprising if the next five years go as swimmingly as the last five.”\nMorales’ dreams of converting its lithium reserves into battery factories have yet to be realized, as are plans to create a major iron foundry.\nThe underground cocaine economy gets credit for part of the economic boom. Peru’s former drug czar, Ricardo Soberon, estimates its annual revenues at $2.3 billion, equal to about 7 percent of gross domestic product.\nMorales promotes coca’s traditional uses and claims zero tolerance for cocaine.\nThe United States deems Bolivia uncooperative in the war on drugs and has halted trade preferences and cut all counter-narcotics aid. Morales expelled the U.S. ambassador and Drug Enforcement Administration in 2008, accusing them of inciting the opposition.\nLast year he threw out the U.S. Agency for International Development.\nRonald Velasquez, a 38-year-old computer specialist, said he voted for Morales because he didn’t trust any of the other candidates. He said he trusts Morales but the president “is surrounded by bad associates.”\n“He has had a lot of problems in his government with corruption and influence-peddling,” Velasquez said.\nMacario Chambi, a 54-year-old street vendor, said he would not vote for Morales, whose ruling clique he believes is getting rich off the economic bonanza without instituting the type of reforms that will actually create wealth.\n“He thinks we’re all sheep, that we don’t realize that they want to buy us with cheap sweets.”\n___\nAssociated Press writers Paola Flores contributed from La Paz and Frank Bajak from Lima, Peru."
    },
    {
      "url": "https://apnews.com/article/bolivia-natural-gas-arce-coup-military-south-america-oil-energy-export-economy-6ded7bf1340563e8a46de8265533ea8a",
      "text": "Bolivia’s beleaguered president announces natural gas discovery, promising a boon for the country\nLA PAZ, Bolivia (AP) — Bolivia’s embattled president on Monday announced the discovery of vast natural gas reserves, describing it as the biggest find in nearly two decades that could help the cash-strapped country reverse its falling production.\nPresident Luis Arce called the trove just north of the capital a “mega field,” saying it has some 1.7 trillion cubic meters of gas at a likely market value of $6.8 billion.\nHe said the field — named Mayaya X-1 — is way to revive the gas industry. That was the engine of robust growth in the early 2000s, a period of booming exports and declining poverty that experts have termed Bolivia’s “economic miracle.”\n“This marks the beginning of a new chapter for the northern sub-Andean region, offering hope of maintaining our country as an important gas exporter,” said Arce, who is the alleged target of a military coup attempt last month and the main focus of anger among Bolivians over shortages of fuel and foreign currency. “It’s the most important discovery since 2005.”\nIn more recent years, investment in exploration projects by Bolivia’s state-owned energy company has dwindled and natural gas extraction has faded fast.\nBolivian politicians spent much of the gas windfall on lavishly subsidized fuel. The economic model pioneered by then President Evo Morales, Arce’s bitter political rival, quickly became unsustainable when commodity prices fell.\nIn a warning for the government, the Bolivian Institute of Foreign Trade reported last year that the country — once among the world’s top 10 natural gas producers — had become a net importer of hydrocarbons, spending $2.9 billion on diesel imports while earning only $2 billion from natural gas exports.\nLast month, Arce described production as having “hit rock bottom.”\nBolivia’s state-controlled energy company, Yacimientos Petrolíferos Fiscales Bolivianos, or YPFB, said Monday that the newly announced natural gas field was discovered thanks to a $50 million investment.\nThe field, it said, covers several regions north of La Paz, the administrative capital, and will add to Bolivia’s existing gas reserves, which stood at 8.7 trillion cubic meters in 2019. There has been no publicly available data since.\n“It’s a new exploratory frontier,” said Armin Dorgathen, YPFB president."
    },
    {
      "url": "https://apnews.com/article/bolivia-elections-morales-socialism-rightwing-president-arce-economic-crisis-8fa148f61cadaf4b59a5e9bbd91b1349",
      "text": "Bolivia reinstates a leftist challenger but keeps former leader Morales off the ballot\nLA PAZ, Bolivia (AP) — Bolivia’s electoral tribunal on Friday included leftist Senate leader Andrónico Rodríguez on the list of presidential candidates approved for the ballot but excluded the powerful former socialist leader Evo Morales — the other major thorn in the president’s side.\nAs tensions escalate in the run-up to Bolivia’s Aug. 17 elections, the Supreme Electoral Tribunal reinstated Rodríguez, a 36-year-old political upstart with close ties to Morales and roots in the ex-president’s rural coca-growing stronghold, weeks after suspending his candidacy on technical grounds in a decision that shocked many Bolivians.\n“We are the candidate of the people,” Rodríguez said in a speech welcoming the revival of his campaign. “Our primary concern has been to wage the legal battle, and in the end, the power of the people had to prevail.”\nWith the ruling Movement Toward Socialism party, or MAS, riven by dysfunction and division over President Luis Arce’s power struggle with his former mentor, Morales, supporters of the senate leader see him as the only chance for MAS to beat the right-wing opposition and salvage its decades-long political dominance.\nPresident Arce, widely blamed for accelerating Bolivia’s worst economic crisis in 40 years, dropped out of the race last month. Opinion polls show that his pick for the presidency, senior minister Eduardo del Castillo, has inherited the president’s unpopularity.\nArce’s government insists that its main rival, Morales, is constitutionally barred from running. Morales accuses Arce of waging a “judicial war” against him.\nIn leaving out Morales, the tribunal opened the potential for further turmoil: Morales has called on his supporters to take to the streets to demand his eligibility. Over the last week his followers have blockaded some of the main roads around the country, adding to a sense of crisis as merchants and truckers rise up in outrage over surging food prices and severe fuel shortages.\nMorales, who governed Bolivia from 2006 to 2019, has been holed up in the country’s tropics for months, surrounded by fiercely loyal coca-farmers, as Arce’s government seeks his arrest on charges relating to his sexual relationship with a 15-year-old girl.\nA constitutional court filled with judges beholden to Arce has disputed the legality of Morales’ fourth candidacy and barred him from the contest.\n“The constitutional court acts like a sniper ... restricting and enabling electoral participation upon request,” he said in response to his disqualification. “The order is clear: Hand over the government to the right and legitimize the election with negotiated candidates who will protect their backs.”\nMorales, whose own loyalists packed the same court when he was president, points to an earlier court ruling that paved the way for his 2019 presidential campaign, that said it would violate his human rights to stop him running. Morales’ bid that year for an unprecedented fourth term ultimately sparked mass protests and led to his resignation and brief self-exile.\nThe conservative opposition to MAS is also fractured, with at least three right-of-center candidates vying for the presidency and no clear frontrunner.\nAll of them are little-known abroad but well-known within Bolivia, where they have run for president or served in government in the past: Jorge “Tuto” Quiroga, former president from 2001-2002, Samuel Doria Medina, a former cement tycoon and planning minister, and Manfred Reyes Villa, the mayor of Bolivia’s major central city of Cochabamba.\nQuiroga and Doria Medina promoted privatizations of state-run companies in the 1990s before MAS took over."
    },
    {
      "url": "https://apnews.com/general-news-80df3152c79f4ca8997a2e23644bbfe8",
      "text": "AP Explains: The extraordinary rise and fall of Evo Morales\nBOGOTA, Colombia (AP) — The surprise resignation of Evo Morales as Bolivia’s president can perhaps be matched only by his equally extraordinary rise to power. The country’s first indigenous chief of state upended politics in a nation long ruled by light-skinned descendants of Europeans and he vowed to reverse centuries of inequality. He succeeded on many fronts but was ultimately compelled to step down after both the military and even one-time supporters turned against him.\n___\nWHY WAS HIS PRESIDENCY SO NOTABLE?\nWhen Morales, the son of a llama herder, won Bolivia’s highest office in a landslide 2006 election, it was hailed as a milestone achievement for the nation’s sizeable indigenous population that had not gained the right to vote until 1952.\nAt the time, Bolivia’s 36 indigenous groups represented 60% of its 8.5 million citizens. A native Aymara, Morales was the first leader for many Bolivians who looked and thought like they did.\nLike many Bolivians, Morales grew up in extreme poverty. Four of his six siblings died in childhood. On the campaign trail, he ditched the traditional politico’s suit and tie, preferring casual short-sleeved shirts and even a leather jacket, while affectionately calling women “sister” and men “boss.”\nHe earned a spot in the political limelight as the leader of a coca growers union who played an important role in protests that unseated two governments and vowed to reverse centuries of inequities against the disenfranchised.\n“The time has come to change this terrible history of looting our natural resources, of discrimination, of hate, of despise,” he said after his triumph.\n___\nHOW DID HE CHANGE THE SOUTH AMERICAN NATION?\nUnder Morales’ tenure, more than a half-million Bolivians climbed out of poverty, while schoolchildren, the elderly and mothers benefited from new subsidies. The economy grew strongly thanks to high prices for its commodities.\nAccording to the World Bank, moderate poverty stood at 59% of Bolivia’s people two years before Morales became president and had fallen to 39% by 2014.\nHe ushered through a new constitution that created a new Congress with seats reserved for Bolivia’s smaller indigenous groups and recognized the Andean earth deity Pachamama instead of the Roman Catholic Church. The charter also “refounded” Bolivia as a “plurinational” state, allowing self-rule for the nation’s indigenous peoples.\nHowever, despite fears of some that Morales would oversee a stark turn to the left economically, he kept the nation dependent on extractive industries while negotiating more favorable terms that allowed greater distribution of gas and mineral wealth.\n___\nWHAT WAS HIS DOWNFALL?\nThere is no one easy moment to identify, but rather a series of missteps that led to his exit.\nThe same indigenous organizers who propelled Morales to power grew increasingly disenchanted with a president they felt betrayed promises to protect the environment and move away from reliance on big industries like mining. Thousands took to the streets in 2011 when he proceeded with plans for a highway across a protected Amazon reserve.\nAnd despite improving economic indicators, a substantial part of the new middle class found job opportunities hadn’t expanded sufficiently and also grew fed up with corruption many felt the president did not combat.\nWhen Morales held a 2016 referendum on removing term limits, voters turned him down. He then upset many people by getting Bolivia’s top court to throw out the limits, allowing him to seek a fourth term in this year’s election.\nHe claimed victory in the Oct. 20 ballot, but unexplained lapses in reporting results drew allegations of vote fraud and set off weeks of protests by his opponents. His support weakened, and finally a push by the chief of the Bolivian military led him to resign.\n“If he had tried not to force the issue of running again, he probably would have been remembered fairly positively,” said Alissandra Stoyan, a professor of political science at Kansas State University.\n___\nWHAT MIGHT BE THE RIPPLE EFFECT OF HIS DEPARTURE?\nHis resignation comes at a time of social upheaval around Latin America coinciding with what those on the left hoped might be a comeback.\nFrustrated citizens have staged mass protests against right-wing leaders in Honduras and Chile and voters in Argentina thrust the Peronist party back into power in a rejection of an incumbent backing free market reforms.\nBut Morales’ party, the Movement for Socialism, now will likely face an uphill battle against an empowered opposition in a new presidential election.\n“It seems Latin America is getting more complex over the last few years and we can’t talk about ‘tides’ like we used to,” said Jorge Derpic, a University of Georgia sociology professor focused on Latin American social movements.\n___\nIS BOLIVIA’S DEMOCRACY AT RISK?\nSome people are concerned Bolivia could be turning back a page to a turbulent time in its long history of political volatility, after nearly 14 years of relative stability under Morales.\nBy one count, Bolivia has had more than 190 coup attempts and revolutions since its 1825 independence in a repetitive cycle of conflict between political elites in urban areas and disenfranchised by mobilized rural sectors.\nThere is uncertainty over who will step in to fill the power vacuum before elections can be held. An opposition leader in the Senate proclaimed herself interim president Tuesday, though it isn’t clear how much support she has.\nNancy Postero, an anthropology professor at the University of California, San Diego, is optimistic Bolivia’s young and educated middle class will find a way out, recalling how over a decade ago Morales himself charted a path toward stability after the wave of upheaval the preceded him.\n“The Bolivian people wrote a new constitution, remade society and came up with a completely different way of thinking about the state,” she said. “I have no doubt that is going to happen again.”"
    },
    {
      "url": "https://apnews.com/article/bolivia-elections-president-morales-bread-socialism-mas-subsidies-protests-fd1f696aa8036647f7d023a79c272c8a",
      "text": "How a shrunken piece of bread explains Bolivia’s economic catastrophe ahead of elections\nHow a shrunken piece of bread explains Bolivia’s economic catastrophe ahead of elections\nLA PAZ, Bolivia (AP) — Juan de Dios Castillo, covered in flour and sweat, pulled a crisp roll from the cooling rack and weighed it on an old metal scale: 60 grams (2 ounces).\nThat’s barely half what it would have been two years ago. Unlike American or European shoppers scrutinizing suspiciously capacious chip bags, Bolivians have no doubt that they’re paying the same government-fixed price for a much smaller, lower-quality loaf.\nFor years, you could walk into a government-subsidized bakery like Castillo’s anywhere in Bolivia and get a 100-gram (3.5 ounce) roll for 50 centavos (7 U.S. cents), but as a cash crunch cripples flour imports and inflation squeezes budgets, bakers have almost halved the size of their staple bread. Early last year, rolls shrank to 80 grams, then 70, now 60.\n“It’s like eating a bit of air, a Communion wafer, it doesn’t fill you up anymore,” said Rosario Manuelo Chura, 40, dipping some crust into her morning coffee in Bolivia’s administrative capital of La Paz.\nCastillo isn’t particularly pleased about it either. Forced to sell his bread far below market price, he’s barely breaking even. “This situation is not sustainable,” he said, slamming the oven door open.\nBolivia’s many harbingers of havoc ahead of its presidential election on Sunday seem to converge in this shrunken piece of subsidized bread that La Paz residents call “pan de batalla” — “battle bread.”\nThe hallowed staple speaks to a state stuck in the past after 20 years under the state-directed economic model of ex-leader Evo Morales, and now struggling to pull itself out of its worst economic crisis in four decades.\nThe right-wing frontrunners, businessman Samuel Doria Medina and former President Jorge “Tuto” Quiroga, have proposed eliminating the politically combustible subsidies that underwrite Bolivia’s social safety net.\n“I say this openly, I’ll remove subsidies because they’re the greatest absurdity,” Doria Medina told The Associated Press this month, referring to the fuel that Bolivia subsidizes to the tune of billions of dollars a year.\nShort on dough, literally\nLegend has it that the battle bread earned its nickname from troop rations in the country’s Chaco War against Paraguay in the 1930s.\nToday, a battle over bread rages within Bolivia, which is running out of hard currency to import wheat because the country grows less than 25% of what it consumes.\nStruggling to clear a backlog of imports, the government has slowed or in some cases suspended subsidized flour deliveries. Loaves have vanished from shelves and bread lines have started to appear across La Paz.\nThe scarcity of U.S. dollars has also hampered diesel fuel imports, leading to fuel shortages and raising questions about the ability of import-dependent Bolivia to keep subsidizing its staples.\nNot only do farmers use diesel fuel to power machinery for irrigation, but diesel fuel also contributes to the price of imported foodstuffs.\nPrices rise and loaves shrink\nSome two years ago Bolivia had a lower annual inflation rate than Germany. Today it has among the region’s highest, with the government reporting consumer prices rose 25% in July from a year earlier.\nBut the price of bread hasn’t changed in 17 years.\nBolivia imports most of its wheat from Argentina, where prices have increased — along with the value of the Argentine peso — under libertarian President Javier Milei.\nBolivia’s grain agency, EMAPA, distributes the subsidized flour to bakers at a fixed price while requiring them to sell battle bread for 50 centavos a loaf — about a fifth of what it would cost to bake the same loaf with ingredients bought at retail prices.\nAs the prices of other ingredients climb, many government-subsidized bakeries warn that they are facing bankruptcy. Scores of bakers last month staged a 24-hour strike demanding to sell their bread at market prices.\nBut a quick scan of history from the 1789 French Revolution to 1989 Venezuelan riots underscores why Morales’ Movement Toward Socialism party, or MAS, hasn’t dared tinker with the agreement.\n“When the price of battle bread goes up, that’s the day everything collapses,” said Jacobo Choque, 40, an accountant waiting to buy bread rich in butter from a non-subsidized bakery. The line of Bolivians keen to shell out an extra 20 centavos for better-tasting, thicker rolls stretched almost two city blocks.\nNearby, cash-strapped customers scoured an open-air market, swarming around one of the few stalls selling battle bread.\n“We used to have breakfast with one roll, but now we need two to feel full,” said Carmen Muñoz, 65, fuming as she queued. “Let’s not forget that socialism brought us here.”\nA subsidy system gone bust\nWhen commodity prices surged in 2007, Morales, a coca-farming union leader elected the year before to his first of what would be three terms, harnessed revenues from booming natural gas exports to bankroll subsidies for bread and other essentials.\nBut as gas production plummeted about a decade later, MAS dipped into foreign reserves to keep spending. The model became ruinously costly — last year’s food and fuel subsidies made up over 4.2% of gross domestic product.\nWith the government unable to pay suppliers on time and trucks trapped in fuel lines, EMAPA’s monthly deliveries of milled wheat have hit snags, leaving subsidized bakeries suddenly without flour. Even as bakers eat into their savings to buy other ingredients, the subsidy agreement bars them from sourcing their own flour.\n“Rather than helping, subsidies are hurting us,” Castillo said.\nSome bakers say that EMAPA — long accused of favoring MAS party members — has stopped supplying altogether.\nEMAPA denies cronyism, saying it has ramped up investigations into reports of bakers reselling subsidized flour at inflated prices on the black market, or trying to pass off rolls baked with low-cost additives like cassava starch.\n“In all my 30 years at this market, this is the most stressful,” said Raquel de Quino, a 60-year-old bread vendor who now spends her mornings confronting customers outraged over the shrinkflation and shortages.\nOn Saturday, she asked one angry woman to take her rant to the government — at least for its final week in power.\n“I’m just the middleman,” said De Quino, throwing up her hands in exasperation. “Let’s pray to God that under the next government, there will bread for our children.”\n____\nFollow AP’s coverage of Latin America and the Caribbean at https://apnews.com/hub/latin-america"
    },
    {
      "url": "https://apnews.com/article/virus-outbreak-evo-morales-la-paz-elections-voting-fraud-and-irregularities-d5676d406b4baa4d35276975b31b0656",
      "text": "He’s not running, but Morales looms large in Bolivia vote\nHe’s not running, but Morales looms large in Bolivia vote\nLA PAZ, Bolivia (AP) — Even in exile, Evo Morales looms over Bolivia’s election next month.\nNational rifts that contributed to chaos in Bolivia in 2019 threaten to destabilize the Oct. 18 vote and its aftermath nearly one year after Morales, Bolivia’s first Indigenous president from the Aymara group, was forced to resign following disputed vote results, protests, violence and a military call for him to go.\nThe country is divided mainly along ethnic, regional and socioeconomic lines, and between those who applaud Morales as a voice for the historically poor and disenfranchised and those who say he became increasingly corrupt and authoritarian during 14 years in power. The interim government that replaced him has also been accused of undermining Bolivia’s democratic institutions, including the judiciary.\nThe feud has reverberated outside the landlocked country of 12 million people, echoing ideological divisions from an era when the political left and right in Latin America were more clearly defined.\nIn a speech to the virtual U.N. General Assembly on Wednesday, interim President Jeanine Áñez accused neighboring Argentina, where Morales is in self-exile, of ″systematic and abusive harassment″ of Bolivia’s institutions and supporting a “violent conspiracy” led by the former president.\nArgentina’s Foreign Ministry said it was regrettable that Áñez, who has withdrawn from the Bolivian election race, would try to involve Argentina in her country’s internal politics and urged her to focus energy on ensuring ″free and transparent″ elections.\nIn a letter Tuesday to U.S. Secretary of State Mike Pompeo, Sen. Bernie Sanders and 27 other members of the U.S. Congress expressed concern that the Organization of American States, based in Washington, had been invited to monitor the Bolivian election. The letter alleged a “lack of accountability and transparency” in an OAS audit that found evidence of fraud and other irregularities in 2019 election results indicating Morales had won.\nMorales, a 60-year-old former coca farmer and union leader, faces terrorism and other charges in Bolivia and is not an election candidate this year. Some human rights advocates believe the charges amount to political persecution of Morales, who is basically in campaign mode, talking up his past administration’s achievements.\nThe party that he founded, Movement for Socialism, also known by its Spanish acronym MAS, controls the congress and is a powerful election contender. Its presidential candidate, Luis Arce, is a former economy minister who oversaw a nationalization program when Morales was president.\nThe other main candidates draw much of their support from Bolivia’s urban, more affluent population and should benefit from Áñez’s withdrawal from the race. Carlos Mesa is a former president who ran in last year’s election against Morales, and Luis Fernando Camacho led protests against Morales and is strong in Santa Cruz, an eastern region that is Bolivia’s economic engine and a counterweight to the political dominance of La Paz, in the west.\nSeveral polls indicate the Movement for Socialism would lead in the round of voting next month, but struggle for the support needed to avoid a runoff pitting the top two candidates against each other. If there should be a runoff, MAS would come under more pressure if its opponents united.\nThere is a high number of undecided voters, said María Teresa Zegada, a sociology professor at the Universidad Mayor de San Simón, a Bolivian university.\nMorales’ detractors fear a MAS election victory could open the way to the former president’s return to Bolivia and his political rehabilitation.\nWhatever happens, Bolivians could face more weak governance, political volatility and economic hardship at a time when the coronavirus pandemic and lockdown measures are undoing years of progress toward alleviating poverty.\nIn a joint statement last weekend, Bolivian church leaders, the European Union and the United Nations welcomed ‘’the most active phase of the electoral process’’ in Bolivia and appealed for people to refrain from violence or intimidation.\nMany Bolivians are apprehensive.\n“We are not excited about the elections. We are interested in generating economic reactivation policies,” said Héctor Delgado, a carpenter and union leader in El Alto, a city next to La Paz that suffers high unemployment and a lack of basic services.\nThis week, Moody’s Investors Service issued a ratings downgrade for Bolivia, noting the pandemic and weaker foreign exchange earnings because of lower demand for Bolivian oil and gas. Bolivia has a favorable debt structure and the outlook is stable, even as the country endures its first recession since the 1980s, the credit ratings agency said.\n“Given Bolivia’s weak institutional and governance framework, a highly polarized society, and fragile social fabric, Moody’s expects a prolonged period of political instability and policy uncertainty, even after the upcoming October election is held,″ the agency said.\n___\nAssociated Press writer Carlos Valdez reported this story in La Paz, Bolivia, and AP writer Christopher Torchia reported from Mexico City."
    },
    {
      "url": "https://apnews.com/article/bolivia-economy-us-dollar-42f815800dd18eb0952590bb8b968cfd",
      "text": "US dollar scarcity threatens Bolivia’s ‘economic miracle’\nUS dollar scarcity threatens Bolivia’s ‘economic miracle’\nLA PAZ, Bolivia (AP) — Sofia Andrade, a lawyer, chose over the past month to withdraw all her dollar savings from the bank as the US currency became scarce on the streets of Bolivia.\n“I prefer to have them at home,” she said. “I fear they won’t let me withdraw them later.”\nLike her, many Bolivians are withdrawing their dollar deposits or rushing to buy the US currency amid increased concern about Bolivia’s economic fragility, a marked change for a country that for more than a decade experienced what many called an “economic miracle” amid strong growth, record exports, low inflation, a fixed exchange rate and subsidized gasoline.\nThe scarcity of the greenback, which opposition politicians attribute to the Central Bank running out of hard currency reserves and the government blames on speculation, means that for the first time since 2011, a parallel market for the U.S. dollar has emerged that charges slightly more than the official price.\nWhen the shortage began earlier this year, hundreds spent the night outside the Central Bank to buy dollars at the official exchange rate. A new system has now been established to buy the currency online. The physical lines have disappeared, but the problem remains and is reminding Bolivians of past economic woes.\nAlicia Meneses, 40, said she had converted her savings into dollars earlier this year, “because I was afraid of getting stuck with the bolivianos like what happened to my dad in the ’80s.”\nShe needed some local currency this week and so she changed a bit of her savings back to bolivians on the black market in downtown La Paz, where she received 7 bolivianos per dollar, slightly more than the official rate of 6.96.\n“I’ve come to change a few dollars because of an emergency,” Meneses said.\nLeftist President Luis Arce, who was economy minister from 2006 to 2017 during Bolivia’s period of bonanza, has tried to calm the waters, insisting there will be no change to the country’s managed exchange rate system in which the Central Bank has intervened to keep the local currency’s value stable to the U.S. dollar over the past 12 years.\n“There will be no devaluation,” Arce said this week in what was his first interview with a private television station since taking office in late 2020. “There is no need for it when we have a solid economy that is growing.”\nThe president dismissed speculation he would do away with expensive fuel subsidies that mean Bolivians pay around half of international prices for gasoline — at the cost of draining the country’s international reserves. And Arce painted an optimistic picture: “We’re growing and have the lowest inflation in the region.”\nBolivia’s annual inflation of 2.5% in March marks a decline from late last year when it crossed the 3% mark and is far lower than its neighbors. The government insists Bolivia will grow 4.8% this year, a sharp contrast to the International Monetary Fund’s prediction of 1.8%.\n“I’ll disappoint international projections again,” Arce quipped.\nBolivia, an exporter of natural gas for the region, enjoyed a huge economic bonanza over the last decade on the back of high commodity prices, a trend that followed the arrival in power in 2006 of Evo Morales, the country’s first Indigenous president. The landlocked South American country also exports minerals and agricultural products, including soybeans, and has recently seen a surge in gold sales abroad.\nMorales used the huge flow of money to reduce poverty, expand the middle class, and build roads. Buildings multiplied in cities, and cars ceased to be a luxury. But that came accompanied with lots of waste and corruption, according to his detractors.\nThe country’s revenues tripled with the nationalization of hydrocarbon resources in 2006, but the sector stagnated due to a lack of investment, and the country went from being an exporter to an importer of hydrocarbons in 2022, according to the National Statistics Institute.\n“They have squandered the money. Now there’s a lack of liquidity,” said Rodrigo Paz, a senator with the center-right Comunidad Ciudadana party. “People are buying dollars due to uncertainty, but those dollars don’t return to the market, they stay under the mattress.”\nThe commodity price boom ended in 2014, and Bolivia managed to stretch its savings for several years but now, in part due to the COVID-19 pandemic, the country is almost out of reserves.\nThe government is optimistic it will be able to make up some of the shortfall with the growth in gold mining, but tax revenue from that sector is scant. Of the $3 billion in gold exports last year, public coffers received only $75 million in taxes, according to official data.\n“We’re scraping the barrel,” said analyst Gonzalo Chávez, who is an economics professor at Catholic University of Bolivia.\nBolivia can no longer rely on commodities to carry the economy, La Paz-based economic consultant Jaime Dunn said.\n“It’s an exhausted economic model that based its success on capturing the surplus generated by natural resources, not on generating wealth. It worked when raw materials fetched high prices,” Dunn said. “The only way to keep it alive is by burning more currency and increasing debt, which already stands at around 70% of GDP.”\nDunn says the government should do more to promote the agricultural sector that has been silently growing its exports. But he says the government is not eager to promote an industry that is concentrated in the eastern region of Santa Cruz, led by an administration that is in opposition to the central government.\nEconomy Minister Marcelo Montengro has pushed back against criticism, saying the current economic model of subsidies and a fixed exchange rate have contributed to “a robust productive apparatus with price stability and low inflation.”\nSocial protests, though, are on the rise. Public school teachers, for example, have been taking to the streets for six weeks, demanding more funding. The government has said it can’t meet the demands at a time when it’s facing lots of friendly fire amid public criticisms of Arce’s management by his political mentor, former President Morales, who is also the head of the ruling Movement for Socialism.\n“We were coming out of the pandemic that plunged us into crisis, and I feel like we’re sinking again just as the economy was recovering,” said Sofia Godínez, a 54-year-old homemaker.\n———————\nAssociated Press journalist Daniel Politi contributed from Buenos Aires, Argentina."
    },
    {
      "url": "https://apnews.com/article/bolivia-president-samuel-doria-medina-morales-elections-trump-49faa8947c89a6f363b907a70915abc6",
      "text": "Meet the multimillionaire who wants to be Bolivia’s first right-wing president elected in 20 years\nMeet the multimillionaire who wants to be Bolivia’s first right-wing president elected in 20 years\nLA PAZ, Bolivia (AP) — It’s no surprise that Samuel Doria Medina is running for president of Bolivia: The 66-year-old multimillionaire ran as a center-right candidate in the elections of 2005, 2009 and 2014. He failed each time as Bolivia’s leftist ruling party, founded by former President Evo Morales, maintained a tight grip over politics.\nWhat’s unexpected is that next month, after almost two decades of the Movement Toward Socialism (MAS) party in power, the candidate who promises to arrest Morales and cozy up to U.S. President Donald Trump stands a real chance of victory.\nPolls show Doria Medina, owner of hotel chains and Bolivia’s Burger King restaurants, as a front-runner in the Aug. 17 election.\n“Not only are we going to change the president, but the political cycle,” Doria Medina, a former cement magnate, told The Associated Press Wednesday from his sleek office on the 20th floor of one of Bolivia’s tallest towers that he helped build. “Part of that change will be the emergence of new figures.”\nLuring voters desperate for change\nDoria Medina, a successful businessman and entrepreneur, is tapping public outrage over Bolivia’s worst economic crisis since 1991.\nHe promises unity to voters frustrated by the fracturing of the MAS party between current President Luis Arce and his erstwhile ally, the larger-than-life Morales, who oversaw a so-called economic miracle of rising growth and falling poverty for much of his tenure from 2006-2019.\nBut Morales’ statist economic model, built on natural gas exports, has gone bust. Now the landlocked nation of 12 million is approaching a watershed moment as crippling dollar shortages, mass unrest and fuel scarcity threaten the once-unquestioned dominance of the MAS party founded in the 1990s.\n“We have a population that wants the economic conflict and lack of fuel to be solved,” Doria Medina said.\nMuch remains uncertain in the run-up to the highly anticipated vote, with Morales’ large base of loyalists vowing to leave their ballots blank on account of the former president’s contentious exclusion from the race — in part a result of his bitter political fight with Arce.\nFacing a humiliating defeat, Arce dropped out of the race.\nThe only leftist candidate leading polls is Andrónico Rodríguez, the 36-year-old president of the senate and vice president of Morales’ coca-farming union. Rodríguez would be considered the political heir of Morales’ MAS if it weren’t for Morales branding him a traitor for running against him.\nWith other opposition candidates further to the right, analysts see the moderate Doria Medina as best-positioned to win over traditional MAS party supporters as he promises to put the brakes on the foreign exchange rate and resolve fuel shortages within his first 100 days.\nThe value of a boliviano on the black market is now around half the official exchange rate.\n“This type of crisis has to be resolved very quickly,” Doria Medina said, citing as a model the shock adjustment of radical libertarian President Javier Milei that drove down Argentina’s double-digit inflation.\nPromising a ‘shock’ fiscal adjustment\nTo achieve such a swift transformation, Doria Medina told AP he would first scrap fuel subsidies, which have long been a politically sensitive pillar of the MAS party’s economic policy. When Morales tried to eliminate the generous subsidies in 2010, mass nationwide riots forced him to backtrack.\n“It’s the biggest absurdity that in Bolivia it’s $0.30 per liter of gasoline and in all neighboring countries it’s $1,” Doria Medina said, dismissing possible fallout from the move. Bolivia hemorrhaged $3 billion subsidizing gasoline and fuel last year.\nDoria Medina said his overhaul of subsidies and state-owned companies would accompany a major foreign policy shift after years of Bolivia aligning itself with China, Iran and Russia.\n“Of course we’re going to seek rapprochement with the United States,” he said. “We’re obviously going to try to have an agreement so that Bolivian products can reach the largest market in the world.”\nArguably the biggest potential prize for the U.S. is Bolivia’s large stockpiles of strategic minerals, including lithium, a key component of renewable batteries. Chinese and Russian companies have sought stakes in Bolivian lithium mines that remain largely undeveloped despite Morales’ attempts and Arce’s ambitions.\nThe end of an era for Morales\nAfter being run out of the presidential election and hit with an arrest warrant on charges related to his sexual relationship with a 15-year-old girl, Morales remains holed up in his tropical stronghold. He says the allegations are politically motivated.\nDoria Medina was blunt when asked about the fate of Morales if he were to be elected.\n“One must comply with the law,” he said. “There is an award for his arrest. I’m going to comply with the law.”\nPressed on whether this meant prison time for Morales, he said yes, adding that he wouldn’t be surprised if Morales fled the country first — as he did in 2019, after resigning under military pressure in the wake of protests over his disputed reelection to an unprecedented fourth term.\nDoria Medina dismissed concerns over Morales’ threats to “convulse the country” in protest over the elections.\n“Evo Morales no longer has that political strength. If he did, it would be something else,” he said.\n“I travel all over the country and people are upset. They’re telling me they will vote to punish him.”\n___\nDeBre reported from Buenos Aires, Argentina.\n____\nFollow AP’s coverage of Latin America and the Caribbean at https://apnews.com/hub/latin-america"
    },
    {
      "url": "https://apnews.com/article/caribbean-ap-top-news-international-news-la-paz-latin-america-3fdae407d6dd480cb1a9f59936040551",
      "text": "Clashes rock Bolivia as new interim leader challenged\nClashes rock Bolivia as new interim leader challenged\nBolivia’s interim President Jeanine Anez leaves the government palace in La Paz, Bolivia, Wednesday, Nov. 13, 2019. The new interim president faces the challenge of stabilizing the nation and organizing national elections within three months at a time of political disputes that pushed former President Evo Morales to fly off to self-exile in Mexico after 14 years in power. (AP Photo/Juan Karita)\nA backer of former President Evo Morales returns a tear gas canister to police during clashes in La Paz, Bolivia, Wednesday, Nov. 13, 2019. Bolivia’s new interim president Jeanine Anez faces the challenge of stabilizing the nation and organizing national elections within three months at a time of political disputes that pushed Morales to fly off to self-exile in Mexico after 14 years in power. (AP Photo/Natacha Pisarenko)\nBolivia’s interim President Jeanine Anez speaks to police in front of the presidential palace, in La Paz, Bolivia, Wednesday, Nov. 13, 2019. The new interim president faces the challenge of stabilizing the nation and organizing national elections within three months at a time of political disputes that pushed former President Evo Morales to fly off to self-exile in Mexico after 14 years in power. (AP Photo/Juan Karita)\nA supporter of former President Evo Morales holds a Bolivian flag during clashes with police in La Paz, Bolivia, Wednesday, Nov. 13, 2019. Bolivia’s new interim president Jeanine Anez faces the challenge of stabilizing the nation and organizing national elections within three months at a time of political disputes that pushed Morales to fly off to self-exile in Mexico after 14 years in power. (AP Photo/Natacha Pisarenko)\nBolivia’s interim President Jeanine Anez speaks during a press conference at the presidential palace, in La Paz, Bolivia, Wednesday, Nov. 13, 2019. The new interim president faces the challenge of stabilizing the nation and organizing national elections within three months at a time of political disputes that pushed former President Evo Morales to fly off to self-exile in Mexico after 14 years in power. (AP Photo/Juan Karita)\nBackers of former President Evo Morales march in La Paz, Bolivia, Wednesday, Nov. 13, 2019. Bolivia’s new interim president Jeanine Anez faces the challenge of stabilizing the nation and organizing national elections within three months at a time of political disputes that pushed Morales to fly off to self-exile in Mexico after 14 years in power. (AP Photo/Natacha Pisarenko)\nA Bolivian police officer hurls tear gas at backers of former President Evo Morales during clashes, in La Paz, Bolivia, Wednesday, Nov. 13, 2019. Bolivia’s new interim president Jeanine Anez faces the challenge of stabilizing the nation and organizing national elections within three months at a time of political disputes that pushed Morales to fly off to self-exile in Mexico after 14 years in power. (AP Photo/Natacha Pisarenko)\nPolice fires tear gas during clashes with backers of former President Evo Morales in La Paz, Bolivia, Wednesday, Nov. 13, 2019. Bolivia’s new interim president Jeanine Anez faces the challenge of stabilizing the nation and organizing national elections within three months at a time of political disputes that pushed Morales to fly off to self-exile in Mexico after 14 years in power. (AP Photo/Natacha Pisarenko)\nBackers of former President Evo Morales march in La Paz, Bolivia, Wednesday, Nov. 13, 2019. Morales flew to Mexico Tuesday after resigning on Nov. 10, following weeks of violent protests fed by allegations of electoral fraud in a presidential election which he claimed to have won. (AP Photo/Natacha Pisarenko)\nPolice deploy during clashes with backers of former President Evo Morales in La Paz, Bolivia, Wednesday, Nov. 13, 2019. Bolivia’s new interim president Jeanine Anez faces the challenge of stabilizing the nation and organizing national elections within three months at a time of political disputes that pushed Morales to fly off to self-exile in Mexico after 14 years in power. (AP Photo/Natacha Pisarenko)\nBolivia’s former President Evo Morales waves upon arrival to meet Claudia Sheinbaum, mayor of Mexico City, in Mexico City, Wednesday, Nov. 13, 2019. Mexico has granted asylum to Morales, who resigned on Nov. 10th under mounting pressure from the military and the public after his re-election victory triggered weeks of fraud allegations and deadly protests. (AP Photo/Marco Ugarte)\nPolice fire tear gas at backers of former President Evo Morales marching in La Paz, Bolivia, Wednesday, Nov. 13, 2019. Bolivia’s new interim president Jeanine Anez faces the challenge of stabilizing the nation and organizing national elections within three months at a time of political disputes that pushed Morales to fly off to self-exile in Mexico after 14 years in power. (AP Photo/Natacha Pisarenko)\nBackers of former President Evo Morales march in La Paz, Bolivia, Wednesday, Nov. 13, 2019. Bolivia’s new interim president Jeanine Anez faces the challenge of stabilizing the nation and organizing national elections within three months at a time of political disputes that pushed Morales to fly off to self-exile in Mexico after 14 years in power. (AP Photo/Natacha Pisarenko)\nBackers of former President Evo Morales clash with police in La Paz, Bolivia, Wednesday, Nov. 13, 2019. Bolivia’s new interim President Jeanine Anez faces the challenge of stabilizing the nation and organizing national elections within three months at a time of political disputes that pushed Morales to fly off to self-exile in Mexico after 14 years in power. (AP Photo/Natacha Pisarenko)\nBackers of former President Evo Morales clash with police in La Paz, Bolivia, Wednesday, Nov. 13, 2019. Bolivia’s new interim president Jeanine Anez faces the challenge of stabilizing the nation and organizing national elections within three months at a time of political disputes that pushed Morales to fly off to self-exile in Mexico after 14 years in power. (AP Photo/Natacha Pisarenko)\nBolivia’s former President Evo Morales speaks during a press conference at the Museum of Mexico City, Wednesday, Nov. 13, 2019. Mexico has granted asylum to Morales, who resigned on Nov. 10th under mounting pressure from the military and the public after his re-election victory triggered weeks of fraud allegations and deadly protests. (AP Photo/Marco Ugarte)\nBolivia’s former President Evo Morales takes part in a press conference at the Museum of Mexico City, Wednesday, Nov. 13, 2019. Mexico has granted asylum to Morales, who resigned on Nov. 10th under mounting pressure from the military and the public after his re-election victory triggered weeks of fraud allegations and deadly protests. (AP Photo/Marco Ugarte)\nPolice block the way to the presidential palace during a march of backers of former President Evo Morales in La Paz, Bolivia, Wednesday, Nov. 13, 2019. Bolivia’s new interim president Jeanine Anez faces the challenge of stabilizing the nation and organizing national elections within three months at a time of political disputes that pushed Morales to fly off to self-exile in Mexico after 14 years in power. (AP Photo/Natacha Pisarenko)\nBolivia’s former President Evo Morales waves to reporters as he arrives for a press conference at the Museum of Mexico City, Wednesday, Nov. 13, 2019. Mexico has granted asylum to Morales, who resigned on Nov. 10th under mounting pressure from the military and the public after his re-election victory triggered weeks of fraud allegations and deadly protests. (AP Photo/Marco Ugarte)\nBolivia’s interim President Jeanine Anez leaves the government palace in La Paz, Bolivia, Wednesday, Nov. 13, 2019. The new interim president faces the challenge of stabilizing the nation and organizing national elections within three months at a time of political disputes that pushed former President Evo Morales to fly off to self-exile in Mexico after 14 years in power. (AP Photo/Juan Karita)\nBolivia’s interim President Jeanine Anez leaves the government palace in La Paz, Bolivia, Wednesday, Nov. 13, 2019. The new interim president faces the challenge of stabilizing the nation and organizing national elections within three months at a time of political disputes that pushed former President Evo Morales to fly off to self-exile in Mexico after 14 years in power. (AP Photo/Juan Karita)\nA backer of former President Evo Morales returns a tear gas canister to police during clashes in La Paz, Bolivia, Wednesday, Nov. 13, 2019. Bolivia’s new interim president Jeanine Anez faces the challenge of stabilizing the nation and organizing national elections within three months at a time of political disputes that pushed Morales to fly off to self-exile in Mexico after 14 years in power. (AP Photo/Natacha Pisarenko)\nA backer of former President Evo Morales returns a tear gas canister to police during clashes in La Paz, Bolivia, Wednesday, Nov. 13, 2019. Bolivia’s new interim president Jeanine Anez faces the challenge of stabilizing the nation and organizing national elections within three months at a time of political disputes that pushed Morales to fly off to self-exile in Mexico after 14 years in power. (AP Photo/Natacha Pisarenko)\nBolivia’s interim President Jeanine Anez speaks to police in front of the presidential palace, in La Paz, Bolivia, Wednesday, Nov. 13, 2019. The new interim president faces the challenge of stabilizing the nation and organizing national elections within three months at a time of political disputes that pushed former President Evo Morales to fly off to self-exile in Mexico after 14 years in power. (AP Photo/Juan Karita)\nBolivia’s interim President Jeanine Anez speaks to police in front of the presidential palace, in La Paz, Bolivia, Wednesday, Nov. 13, 2019. The new interim president faces the challenge of stabilizing the nation and organizing national elections within three months at a time of political disputes that pushed former President Evo Morales to fly off to self-exile in Mexico after 14 years in power. (AP Photo/Juan Karita)\nA supporter of former President Evo Morales holds a Bolivian flag during clashes with police in La Paz, Bolivia, Wednesday, Nov. 13, 2019. Bolivia’s new interim president Jeanine Anez faces the challenge of stabilizing the nation and organizing national elections within three months at a time of political disputes that pushed Morales to fly off to self-exile in Mexico after 14 years in power. (AP Photo/Natacha Pisarenko)\nA supporter of former President Evo Morales holds a Bolivian flag during clashes with police in La Paz, Bolivia, Wednesday, Nov. 13, 2019. Bolivia’s new interim president Jeanine Anez faces the challenge of stabilizing the nation and organizing national elections within three months at a time of political disputes that pushed Morales to fly off to self-exile in Mexico after 14 years in power. (AP Photo/Natacha Pisarenko)\nBolivia’s interim President Jeanine Anez speaks during a press conference at the presidential palace, in La Paz, Bolivia, Wednesday, Nov. 13, 2019. The new interim president faces the challenge of stabilizing the nation and organizing national elections within three months at a time of political disputes that pushed former President Evo Morales to fly off to self-exile in Mexico after 14 years in power. (AP Photo/Juan Karita)\nBolivia’s interim President Jeanine Anez speaks during a press conference at the presidential palace, in La Paz, Bolivia, Wednesday, Nov. 13, 2019. The new interim president faces the challenge of stabilizing the nation and organizing national elections within three months at a time of political disputes that pushed former President Evo Morales to fly off to self-exile in Mexico after 14 years in power. (AP Photo/Juan Karita)\nBackers of former President Evo Morales march in La Paz, Bolivia, Wednesday, Nov. 13, 2019. Bolivia’s new interim president Jeanine Anez faces the challenge of stabilizing the nation and organizing national elections within three months at a time of political disputes that pushed Morales to fly off to self-exile in Mexico after 14 years in power. (AP Photo/Natacha Pisarenko)\nBackers of former President Evo Morales march in La Paz, Bolivia, Wednesday, Nov. 13, 2019. Bolivia’s new interim president Jeanine Anez faces the challenge of stabilizing the nation and organizing national elections within three months at a time of political disputes that pushed Morales to fly off to self-exile in Mexico after 14 years in power. (AP Photo/Natacha Pisarenko)\nA Bolivian police officer hurls tear gas at backers of former President Evo Morales during clashes, in La Paz, Bolivia, Wednesday, Nov. 13, 2019. Bolivia’s new interim president Jeanine Anez faces the challenge of stabilizing the nation and organizing national elections within three months at a time of political disputes that pushed Morales to fly off to self-exile in Mexico after 14 years in power. (AP Photo/Natacha Pisarenko)\nA Bolivian police officer hurls tear gas at backers of former President Evo Morales during clashes, in La Paz, Bolivia, Wednesday, Nov. 13, 2019. Bolivia’s new interim president Jeanine Anez faces the challenge of stabilizing the nation and organizing national elections within three months at a time of political disputes that pushed Morales to fly off to self-exile in Mexico after 14 years in power. (AP Photo/Natacha Pisarenko)\nPolice fires tear gas during clashes with backers of former President Evo Morales in La Paz, Bolivia, Wednesday, Nov. 13, 2019. Bolivia’s new interim president Jeanine Anez faces the challenge of stabilizing the nation and organizing national elections within three months at a time of political disputes that pushed Morales to fly off to self-exile in Mexico after 14 years in power. (AP Photo/Natacha Pisarenko)\nPolice fires tear gas during clashes with backers of former President Evo Morales in La Paz, Bolivia, Wednesday, Nov. 13, 2019. Bolivia’s new interim president Jeanine Anez faces the challenge of stabilizing the nation and organizing national elections within three months at a time of political disputes that pushed Morales to fly off to self-exile in Mexico after 14 years in power. (AP Photo/Natacha Pisarenko)\nBackers of former President Evo Morales march in La Paz, Bolivia, Wednesday, Nov. 13, 2019. Morales flew to Mexico Tuesday after resigning on Nov. 10, following weeks of violent protests fed by allegations of electoral fraud in a presidential election which he claimed to have won. (AP Photo/Natacha Pisarenko)\nBackers of former President Evo Morales march in La Paz, Bolivia, Wednesday, Nov. 13, 2019. Morales flew to Mexico Tuesday after resigning on Nov. 10, following weeks of violent protests fed by allegations of electoral fraud in a presidential election which he claimed to have won. (AP Photo/Natacha Pisarenko)\nPolice deploy during clashes with backers of former President Evo Morales in La Paz, Bolivia, Wednesday, Nov. 13, 2019. Bolivia’s new interim president Jeanine Anez faces the challenge of stabilizing the nation and organizing national elections within three months at a time of political disputes that pushed Morales to fly off to self-exile in Mexico after 14 years in power. (AP Photo/Natacha Pisarenko)\nPolice deploy during clashes with backers of former President Evo Morales in La Paz, Bolivia, Wednesday, Nov. 13, 2019. Bolivia’s new interim president Jeanine Anez faces the challenge of stabilizing the nation and organizing national elections within three months at a time of political disputes that pushed Morales to fly off to self-exile in Mexico after 14 years in power. (AP Photo/Natacha Pisarenko)\nBolivia’s former President Evo Morales waves upon arrival to meet Claudia Sheinbaum, mayor of Mexico City, in Mexico City, Wednesday, Nov. 13, 2019. Mexico has granted asylum to Morales, who resigned on Nov. 10th under mounting pressure from the military and the public after his re-election victory triggered weeks of fraud allegations and deadly protests. (AP Photo/Marco Ugarte)\nBolivia’s former President Evo Morales waves upon arrival to meet Claudia Sheinbaum, mayor of Mexico City, in Mexico City, Wednesday, Nov. 13, 2019. Mexico has granted asylum to Morales, who resigned on Nov. 10th under mounting pressure from the military and the public after his re-election victory triggered weeks of fraud allegations and deadly protests. (AP Photo/Marco Ugarte)\nPolice fire tear gas at backers of former President Evo Morales marching in La Paz, Bolivia, Wednesday, Nov. 13, 2019. Bolivia’s new interim president Jeanine Anez faces the challenge of stabilizing the nation and organizing national elections within three months at a time of political disputes that pushed Morales to fly off to self-exile in Mexico after 14 years in power. (AP Photo/Natacha Pisarenko)\nPolice fire tear gas at backers of former President Evo Morales marching in La Paz, Bolivia, Wednesday, Nov. 13, 2019. Bolivia’s new interim president Jeanine Anez faces the challenge of stabilizing the nation and organizing national elections within three months at a time of political disputes that pushed Morales to fly off to self-exile in Mexico after 14 years in power. (AP Photo/Natacha Pisarenko)\nBackers of former President Evo Morales march in La Paz, Bolivia, Wednesday, Nov. 13, 2019. Bolivia’s new interim president Jeanine Anez faces the challenge of stabilizing the nation and organizing national elections within three months at a time of political disputes that pushed Morales to fly off to self-exile in Mexico after 14 years in power. (AP Photo/Natacha Pisarenko)\nBackers of former President Evo Morales march in La Paz, Bolivia, Wednesday, Nov. 13, 2019. Bolivia’s new interim president Jeanine Anez faces the challenge of stabilizing the nation and organizing national elections within three months at a time of political disputes that pushed Morales to fly off to self-exile in Mexico after 14 years in power. (AP Photo/Natacha Pisarenko)\nBackers of former President Evo Morales clash with police in La Paz, Bolivia, Wednesday, Nov. 13, 2019. Bolivia’s new interim President Jeanine Anez faces the challenge of stabilizing the nation and organizing national elections within three months at a time of political disputes that pushed Morales to fly off to self-exile in Mexico after 14 years in power. (AP Photo/Natacha Pisarenko)\nBackers of former President Evo Morales clash with police in La Paz, Bolivia, Wednesday, Nov. 13, 2019. Bolivia’s new interim President Jeanine Anez faces the challenge of stabilizing the nation and organizing national elections within three months at a time of political disputes that pushed Morales to fly off to self-exile in Mexico after 14 years in power. (AP Photo/Natacha Pisarenko)\nBackers of former President Evo Morales clash with police in La Paz, Bolivia, Wednesday, Nov. 13, 2019. Bolivia’s new interim president Jeanine Anez faces the challenge of stabilizing the nation and organizing national elections within three months at a time of political disputes that pushed Morales to fly off to self-exile in Mexico after 14 years in power. (AP Photo/Natacha Pisarenko)\nBackers of former President Evo Morales clash with police in La Paz, Bolivia, Wednesday, Nov. 13, 2019. Bolivia’s new interim president Jeanine Anez faces the challenge of stabilizing the nation and organizing national elections within three months at a time of political disputes that pushed Morales to fly off to self-exile in Mexico after 14 years in power. (AP Photo/Natacha Pisarenko)\nBolivia’s former President Evo Morales speaks during a press conference at the Museum of Mexico City, Wednesday, Nov. 13, 2019. Mexico has granted asylum to Morales, who resigned on Nov. 10th under mounting pressure from the military and the public after his re-election victory triggered weeks of fraud allegations and deadly protests. (AP Photo/Marco Ugarte)\nBolivia’s former President Evo Morales speaks during a press conference at the Museum of Mexico City, Wednesday, Nov. 13, 2019. Mexico has granted asylum to Morales, who resigned on Nov. 10th under mounting pressure from the military and the public after his re-election victory triggered weeks of fraud allegations and deadly protests. (AP Photo/Marco Ugarte)\nBolivia’s former President Evo Morales takes part in a press conference at the Museum of Mexico City, Wednesday, Nov. 13, 2019. Mexico has granted asylum to Morales, who resigned on Nov. 10th under mounting pressure from the military and the public after his re-election victory triggered weeks of fraud allegations and deadly protests. (AP Photo/Marco Ugarte)\nBolivia’s former President Evo Morales takes part in a press conference at the Museum of Mexico City, Wednesday, Nov. 13, 2019. Mexico has granted asylum to Morales, who resigned on Nov. 10th under mounting pressure from the military and the public after his re-election victory triggered weeks of fraud allegations and deadly protests. (AP Photo/Marco Ugarte)\nPolice block the way to the presidential palace during a march of backers of former President Evo Morales in La Paz, Bolivia, Wednesday, Nov. 13, 2019. Bolivia’s new interim president Jeanine Anez faces the challenge of stabilizing the nation and organizing national elections within three months at a time of political disputes that pushed Morales to fly off to self-exile in Mexico after 14 years in power. (AP Photo/Natacha Pisarenko)\nPolice block the way to the presidential palace during a march of backers of former President Evo Morales in La Paz, Bolivia, Wednesday, Nov. 13, 2019. Bolivia’s new interim president Jeanine Anez faces the challenge of stabilizing the nation and organizing national elections within three months at a time of political disputes that pushed Morales to fly off to self-exile in Mexico after 14 years in power. (AP Photo/Natacha Pisarenko)\nBolivia’s former President Evo Morales waves to reporters as he arrives for a press conference at the Museum of Mexico City, Wednesday, Nov. 13, 2019. Mexico has granted asylum to Morales, who resigned on Nov. 10th under mounting pressure from the military and the public after his re-election victory triggered weeks of fraud allegations and deadly protests. (AP Photo/Marco Ugarte)\nBolivia’s former President Evo Morales waves to reporters as he arrives for a press conference at the Museum of Mexico City, Wednesday, Nov. 13, 2019. Mexico has granted asylum to Morales, who resigned on Nov. 10th under mounting pressure from the military and the public after his re-election victory triggered weeks of fraud allegations and deadly protests. (AP Photo/Marco Ugarte)\nLA PAZ, Bolivia (AP) — Renewed clashes rocked Bolivia’s capital Wednesday as the woman who claimed the presidency, a second-tier lawmaker thrust into the post because of a power vacuum, faced challenges to her leadership from supporters of the ousted Evo Morales.\nA day after Jeanine Añez assumed power, violent clashes broke out between rock-throwing Morales’ backers and police in riot gear, who fired volleys of tear gas to disperse the large crowd of protesters as fighter jets flew low overhead in a show of force.\nOpposition was also building in Congress, where lawmakers loyal to Morales were mounting a challenge to Añez’s legitimacy by trying to hold new sessions that would undermine her claim to the presidency. The sessions — dismissed as invalid by Añez’s faction — added to the political uncertainty following the resignation of Morales, the nation’s first indigenous leader, after nearly 14 years in power.\nIn the streets, angry demonstrators tore off corrugated sheets of metal and wooden planks from construction sites to use as weapons, and some set off sticks of dynamite. Many along flooded the streets of the capital and its sister city of El Alto, a Morales stronghold, waving the multicolored indigenous flag and chanting, “Now, civil war!”\n“We don’t want any dictators. This lady has stepped on us — that’s why we’re so mad,” said Paulina Luchampe. “We’re going to fight with our brothers and sisters until Evo Morales is back. We ask for his return. He needs to put the house in order.”\nThe 60-year-old Morales, who arrived in Mexico on Tuesday under a grant of asylum, has vowed to remain active in politics and said he would be willing to go back home. “If the people ask me, we are willing to return,” he said at news conference Wednesday in Mexico City.\nAccording to the constitution, an interim president has 90 days to organize an election, and the disputed accession of Añez, who until Tuesday was second vice president of the Senate, was an example of the long list of obstacles she faces. Morales’ backers, who hold a two-thirds majority in Congress, boycotted the session she called Tuesday night to formalize her claim to the presidency, preventing a quorum.\nShe claimed power anyway, saying the constitution did not specifically require congressional approval. “My commitment is to return democracy and tranquility to the country,” she said. “They can never again steal our vote.”\nBolivia’s top constitutional court issued a statement late Tuesday laying out the legal justification for Añez taking the presidency — without mentioning her by name.\nBut other legal experts challenged the legal technicalities that led to her claim, saying at least some of the steps required Congress to meet.\nThe lingering questions could affect her ability to govern.\nEduardo Gamarra, a Bolivian political scientist at Florida International University, said the constitution clearly states that Añez didn’t need a congressional vote to assume the presidency. Even so, “the next two months are going to be extraordinarily difficult for President Añez,” he said.\n“It doesn’t seem likely” that Morales’ party will accept Añez as president, said Jennifer Cyr, an associate professor of political science and Latin American studies at the University of Arizona. “So the question of what happens next remains — still quite unclear and extremely worrying.”\nShe will need to form a new electoral court, find non-partisan staff for the electoral tribunal and get Congress, which is controlled by Morales’ Movement for Socialism Party, to vote on a new election.\nMorales resigned Sunday following weeks of violent protests fed by allegations of electoral fraud in the Oct. 20 election, which he claimed to have won. An Organization of American States audit reported widespread irregularities in the vote count and called for a new election.\nBut his resignation came only after Gen. Williams Kaliman, the armed forces commander, urged him to step down “for the good of Bolivia” — a move that Morales and his backers have branded a coup d’etat.\nTen people have died since the protests began, Bolivia’s prosecutor office said Wednesday.\nAñez swore in a new Cabinet as well as new commanders-in-chief for all branches of the military Wednesday, replacing Kaliman, who had been a Morales loyalist, with Gen. Carlos Orellana. The move was seen as an effort to build an alliance with the military, although it was uncertain how much support she could count on from other Bolivian power centers.\nStill, she received a boost of international support Wednesday.\nMichael G. Kozak of the U.S. State Department’s Bureau of Western Hemisphere Affairs welcomed her as “interim constitutional president,” saying on Twitter: “We look forward to working with her & Bolivia’s other civilian authorities as they arrange free & fair elections as soon as possible, in accordance w/ Bolivia’s constitution.”\nBrazil, which is one of Bolivia’s top trading partners, also congratulated her on her “constitutional” assumption of the presidency and her determination to work for peace and hold elections soon. Colombia and Guatemala also recognized her as interim president.\nWhile Argentine President Mauricio Macri had not commented on the issue, Argentine lawmakers in both houses of Congress condemned what they called a coup.\nAñez said on Twitter that she has also reached out to Venezuelan opposition leader Juan Guaidó and asked him to send an ambassador to La Paz. The current ambassador reports to President Nicolás Maduro, who has rejected her claim to the presidency saying it lacked the necessary quorum.\nFrom the start, Añez has tried to set herself apart from Morales. Wearing the presidential sash of office, she greeted supporters at an old presidential palace Tuesday night instead of the modern 26-story presidential office with a heliport that was built by Morales — a project his foes called one of his excesses.\nShe also carried a Bible, which had been banned by Morales from the presidential palace after he reformed the constitution and recognized the Andean earth deity Pachamama instead of the Roman Catholic Church.\nMorales, a one-time llama shepherd from the Bolivian highlands and former coca growers’ union leader, helped lift millions out poverty as president, increasing social rights and presiding over stability and high economic growth in South America’s poorest country.\nBut even many supporters eventually grew weary of his long tenure in power — as well as his insistence on running for a fourth term despite a public referendum that upheld term limits. Bolivia’s high court, which critics contend was stacked in his favor, threw out the limits. Añez said Wednesday she would seek to have the 2016 court ruling overturned to keep Morales from running in the next election.\n___\nAssociated Press writers Carlos Valdez and Natacha Pisarenko in La Paz, Debora Rey in Buenos Aires, Argentina, and Mark Stevenson in Mexico City contributed to this report."
    },
    {
      "url": "https://apnews.com/article/bolivia-protests-police-elections-evo-morales-2b1e1368ea336ecfe330aad9bf0a275e",
      "text": "Supporters of Bolivia’s ex-leader Morales clash with police in push to secure his candidacy\nSupporters of Bolivia’s ex-leader Morales clash with police in push to secure his candidacy\nLA PAZ, BOLIVIA (AP) — Hundreds of supporters of ex-President Evo Morales marched toward Bolivia’s top electoral court on Friday to push for their leftist leader’s candidacy in presidential elections later this year, a rally that descended into street clashes as police tried to clear out a group of demonstrators.\nThe confrontations come in response to a ruling by Bolivia’s Constitutional Court that blocks Morales, the nation’s first Indigenous president who governed from 2006 until his ouster in 2019, from running again in Aug. 17 elections.\nThe turmoil escalates political tensions as Bolivia undergoes its worst economic crisis in four decades.\nAs the march arrived in Bolivia’s capital of La Paz, protesters seeking to register Morales’ candidacy surged toward the Supreme Electoral Tribunal, chanting, “Comrades, what do we want? For Evo to come back!”\nSecurity forces barricading a road to the court held them back. Police reported that the clashes between rock-throwing protesters and tear gas-lobbing police forces injured two officers, a journalist and a local merchant.\n“They’re using firecrackers and rocks that are hurting our forces,” said police Commander Juan Russo. “This is not a peaceful march.”\nThe authorities did not report on any injuries among the protesters, who were seen being pushed onto the ground, shoved into police cars and blasted with tear gas. Morales had promised to attend the march Friday but did not show up.\nThe court’s unanimous decision Wednesday upheld an earlier ruling that bans presidents from serving more than two terms. Morales has already served three, and, in 2019, resigned under pressure from the military and went into exile as protests erupted over his bid for an unprecedented fourth term.\nMorales returned to Bolivia a year later as the 2020 elections vaulted to power his preferred candidate, President Luis Arce, from his long-dominant Movement Toward Socialism, or MAS, party.\nArce, who announced earlier this week that he would not seek re-election, insisted that the Constitutional Court had disqualified Morales, his mentor-turned-rival, from running in 2025.\nBut many experts doubt the legitimacy of that decision in a country where political conflicts undermine the courts and presidents have maneuvered to get their allies on the bench.\n“The Constitutional Court issues unconstitutional arbitrary rulings at the whim of those in power,” said Morales, who himself reaped the benefits of favorable judges while seeking to run for a fourth consecutive term in 2017.\nAfter Morales lost a referendum seeking to do away with term limits while still in power, the Constitutional Court ruled it would be against Morales’ human rights to stop him from running for another term.\nThat 2017 ruling allows Morales to register his candidacy, said Oscar Hassentoufel, the president of the Supreme Electoral Tribunal. “Then the tribunal will decide whether he’s eligible or not.”\nIn defiance of the latest court ruling, Morales called a mass march that marshaled his loyal supporters in the rural tropics. They long have championed the Indigenous coca-grower for transforming the country during his tenure — redistributing Bolivia’s natural gas wealth and seeking greater inclusion for its Indigenous majority.\nAlthough he had earlier promised to participate, it appeared that Morales remained holed up in his stronghold for fear of arrest on human trafficking charges that he claims are politically motivated.\nThe government confirmed that fear Friday. “We ask Mr. Morales to surrender voluntarily,” said Eduardo del Castillo, a key minister in Arce’s government whom the MAS party endorsed for president later Friday in place of Arce. “If we find him walking the streets, we will arrest him.”\nInstead, scores of his supporters walked the capital’s streets on Friday wearing masks of Morales’ face.\n“Evo Morales is each and every one of us. If they want to detain Evo Morales they would need to take every one of us, too,” said David Ochoa, a representative of the marchers."
    },
    {
      "url": "https://apnews.com/article/e4e1977c3e48426f927ce900d2818b4f",
      "text": "Bolivia’s president resigns amid election-fraud allegations\nBolivia’s president resigns amid election-fraud allegations\nLA PAZ, Bolivia (AP) — President Evo Morales resigned Sunday under mounting pressure from Bolivia’s military and the public after his re-election victory triggered weeks of fraud allegations and deadly protests.\nThe decision came after a day of fast-moving developments, including an offer from Morales to hold a new election. The crisis deepened dramatically when the country’s military chief went on national television to call on the president to step down.\n“I am sending my resignation letter to the Legislative Assembly of Bolivia,” the 60-year-old socialist leader said, portraying his departure as the culmination of a “coup d’etat.”\nHe added: “I ask you to stop attacking the brothers and sisters, stop burning and attacking.”\nBefore Morales had even finished his statement, people began honking their car horns in La Paz and other cities and took to the streets to celebrate, waving Bolivian flags and setting off fireworks.\n“This is not Cuba, nor Venezuela. This is Bolivia, and Bolivia is respected,” a crowd in the capital shouted.\nLarge crowds formed in the main squares in the capital, with many people rejoicing and some crying tears of joy. Protesters lay down in front of the presidential palace and set a coffin on fire to symbolize the death of the Morales government.\n“We are celebrating that Bolivia is free,” said one demonstrator near the presidential palace.\nIt was not immediately clear who would succeed Morales. His vice president also resigned as did the Senate president, who was next in line. The only other official listed by the constitution as a successor, the head of the lower house, already had resigned.\nMorales was the first member of Bolivia’s indigenous population to become president and was in power for 13 years and nine months, the longest span in the country’s history.\nBut his claim to have won a fourth term last month set off unrest that left three people dead and over 100 injured in clashes between his supporters and opponents.\nAfter nightfall, there were reports of tensions in La Paz and the neighboring city of El Alto, with reports of looting and burning of public property and some houses.\nEarlier Sunday, the Organization of American States said in a preliminary report that it had found a “heap of observed irregularities” in the Oct. 20 election and that a new vote should be held.\nMorales agreed to that. But within hours, the military chief, Gen. Williams Kaliman, made it clear that would not be sufficient.\n“After analyzing the situation of internal conflict, we ask the president to resign, allowing peace to be restored and stability to be maintained for the good of our Bolivia,” Kaliman said.\nThe leadership crisis escalated in the hours leading up Morales’ resignation. Two government ministers in charge of mines and hydrocarbons, the Chamber of Deputies president and three other pro-government legislators announced their resignations. Some said opposition supporters had threatened their families.\nIn addition, the head of Bolivia’s Supreme Electoral Tribunal, Maria Eugenia Choque, stepped down after the release of the OAS findings. The attorney general’s office said it would investigate the tribunal’s judges for possible fraud, and police later said Choque had been detained along with 37 other officials on suspicion of electoral crimes.\nMorales, whose whereabouts were unknown, went on Twitter late Sunday to claim authorities were seeking to arrest him, but police Gen. Yuri Calderon denied any apprehension order had been issued for the resigned leader. He called such rumors “fake news.”\nIn his tweet, Morales said: “I report to the world and Bolivian people that a police officer publicly announced that he has instructions to execute an unlawful apprehension order against me; in addition, violent groups also stormed my home.”\nArmed intruders did break into Morales’ home in Cochabamba.\nMexico’s government reported Sunday night that 20 members of Bolivia’s executive and legislative branches were at the official Mexican residence in the capital seeking asylum.\nMexican Foreign Secretary Marcelo Ebrard also said on Twitter that Mexico would offer asylum to Morales if should ask for it. There was no indication that Morales had done that.\nEarlier, Ebrard criticized the involvement of the Bolivian military in the day’s events crisis, saying that “we reject it.”\nIn a tweet, Ebrard said: “Mexico will maintain its position of respect for democracy and institutions. Coup no.”\nJennifer Cyr, an associate professor of political science and Latin American studies at the University of Arizona, also voiced concern about the military commander calling on Morales to resign, calling it “extremely troubling” and “sad.”\nThe OAS report and Morales’ acceptance of a new election were positive steps that could have calmed Bolivia’s divisions, she said. “Now I am not sure what will happen.”\nMorales was first elected in 2006 and went on to preside over a commodities-fed economic boom in South America’s poorest country. The combative former leader of a coca growers union, he paved roads, sent Bolivia’s first satellite into space and curbed inflation.\nBut many who were once excited by his fairy-tale rise grew wary of his reluctance to leave power.\nHe ran for a fourth term after refusing to abide by the results of a referendum that upheld term limits for the president. He was able to run because Bolivia’s constitutional court disallowed such limits.\nAfter the Oct. 20 vote, Morales declared himself the outright winner even before official results indicated he obtained just enough support to avoid a runoff with opposition leader and former President Carlos Mesa. A 24-hour lapse in releasing results fueled suspicions of vote-rigging.\nThe OAS sent a team to look into the election. It called for a new contest with a new electoral tribunal.\n“Mindful of the heap of observed irregularities, it’s not possible to guarantee the integrity of the numbers and give certainty of the results,” the OAS said in a statement.\nThe U.S. State Department issued a statement calling for the OAS to send a mission to Bolivia to oversee the electoral process. “The Bolivian people deserve free and fair elections,” it said.\nDuring the unrest, protesters torched the headquarters of local electoral tribunal offices and set up roadblocks that paralyzed parts of Bolivia.\nThe pressure on Morales had increased ominously Saturday when police on guard outside the presidential palace abandoned their posts, and police officers retreated to their barracks in at least three cities.\nThe state news agency ABI said Morales announced his resignation from Chapare province, where he began his career as a union leader. At the end of his speech, he said he was returning to Chapare.\n“I return to my people who never left me. The fight goes on,” he said.\n___\nAssociated Press writer Luis Andres Henao in Buenos Aires, Argentina, contributed to this report."
    },
    {
      "url": "https://apnews.com/article/bolivia-president-arce-economic-crisis-fuel-subsidies-morales-04255009f9201cd8757959b8d71ccd05",
      "text": "Bolivia’s president promises public votes on fuel subsidies and constitutionality of reelection\nLA PAZ, Bolivia (AP) — Bolivia’s socialist President Luis Arce said Tuesday national referenda would be held soon on the removal of politically combustible fuel subsidies and on the constitutionality of presidential reelections, offering for the first time a concrete path out of the country’s economic morass and political limbo.\nArce did not give a date for the votes in his speech from Sucre, the southern historical capital, as Bolivia marked the 199th anniversary of its independence. He defended the referenda proposal as a way to dispel some of the uncertainty Bolivians have endured for months, promising that the populist gesture wasn’t about “electoral calculations or personal ambitions.”\n“It’s time for the people, together with their government, to choose the path we wish to follow in view of the bicentennial,” Arce said.\nA plan to vote on the elimination of fuel subsidies comes as incensed truckers and other protesters have blockaded roads leading to Bolivian cities in recent weeks over the scarcity of diesel, which is more than 80% imported. Fuel shipments from Bolivia’s key ally Russia were stranded by a rainstorm last week at a Chilean port, adding to pressures on Arce’s administration.\nThe government has nearly gone bankrupt importing and heavily subsidizing fuel. Bolivia would need $10 million a day to keep importing gasoline at international prices, selling it at half the price and remaining solvent, energy analyst Raul Velasquez said.\nWithout exporting natural gas anymore — once the mainstay of its booming economy — Bolivia is burning through its foreign currency reserves.\nBut curtailing the long-established subsidies risks triggering catastrophic price shocks — and further inflaming outrage among Bolivians already beset with economic woes.\nThe official exchange rate between the boliviano and the U.S. dollar has effectively collapsed. The black market rate has surged 50% above the official one. In his speech, Arce also said he would convene business leaders for discussions on whether to devalue the local currency.\nArce also announced a referendum on whether and how former presidents may seek reelection, an apparent attempt to resolve a dispute with powerful former President Evo Morales.\nArce’s erstwhile mentor and ally, Morales has declared his intent to run against Arce in 2025 presidential elections — which Arce insists is unconstitutional.\nStanding for more than two consecutive terms is prohibited under Bolivian law. But Morales managed to serve three terms as president, from 2006-2019, because of a legal loophole.\nMorales’ bid for a fourth term — which the constitutional court actually allowed at the time even though he lost a referendum on extending term limits — prompted allegations of fraud and unleashed mass unrest that compelled the leftist leader to resign and flee the country in 2019.\nMorales’ power struggle with Arce since returning home to Bolivia and launching a comeback has created a rolling political crisis that has paralyzed the country’s Congress, sunk plans to lure foreign investors to tap Bolivia’s vast lithium reserves and blocked the government from taking on foreign debt that would alleviate the cash crunch.\n“To ensure that political actors do not once again affect the stability and economy of Bolivian families, it’s important to clarify the nature of reelection,” Arce said, without giving further details about the public vote. It wasn’t clear whether the referendum would involve changing the constitution ahead of next year’s elections.\nAlthough Independence Day speeches may typically offer leaders a chance to reflect on the year’s political accomplishments, President Arce took the occasion to detail his many woes: Bolivia’s fall in natural gas production, legislative gridlock, foreign currency shortage — even, he said, “the climate crisis.”\nHis critics showed little pity.\n“The president again blames Congress for the country’s crisis and avoids assuming responsibilities,” opposition lawmaker Jairo Quinteros said.\nBolivia’s anniversary comes just over 40 days after an alleged botched military coup brought the country to a standstill.\nIt remains unclear what exactly transpired on June 26 when General Juan José Zúñiga stormed the government headquarters surrounded by military vehicles and briefly faced down Arce before being dismissed and arrested, his alleged overthrow plot vanquished.\nArce — who has denied an eruption of allegations that he masterminded the coup to boost his own political fortunes — shed no more light on the matter Tuesday.\nWhat has become clearer, analysts say, is that Bolivia’s economic and political crisis has only worsened.\nThe sight of tanks ramming into the presidential palace last month didn’t quite help restore investor confidence. And amid the Independence Day festivities, trucks and buses idled for hours outside gas stations as the much-anticipated Russian fuel delivered last week failed to relieve the dire shortages.\nFew expect the promise of a referendum to solve the country’s problems.\n“Arce has opted to get rid of his problems, to pass the hot potato onto others by asking the people to find the solution,” prominent Bolivian political analyst José Luis Bedregal said. “A new scenario has opened that will further complicate the political debate.”\n___\nFollow AP’s regional coverage at https://apnews.com/hub/latin-america"
    },
    {
      "url": "https://apnews.com/article/bolivia-elections-morales-arce-race-campaign-polls-leftwing-9296923408ddcfa429aff4cf9e3e7626",
      "text": "Bolivia’s President Arce, polls slipping, quits 2025 presidential race\nLA PAZ, Bolivia (AP) — Facing the prospect of a humiliating defeat in Bolivia’s presidential election in August, President Luis Arce, who assumed office in 2020 and was expected to seek a second term, said Tuesday he would withdraw from the race.\nThe decision, announced in a lengthy late-night televised address, comes as a rift deepens at the top of Bolivia’s governing party, where Arce and his erstwhile ally, former President Evo Morales, struggle for control of their leftist bloc.\n“I will not be a factor in dividing the popular vote,” Arce said in his speech, warning that a fragmented base would give Bolivia’s right-wing and centrist parties a shot at power after nearly two decades of socialist rule. “Much less will I facilitate the realization of a fascist right-wing project ... that seeks to destroy the productive social economic model.”\nThe yearslong rivalry between Arce and Morales has been accelerating a slow-burning economic crisis that has working-class voters, who are the core constituency of MAS, up in arms.\nBolivia has gone from exporting natural gas to importing fuel and from boasting one of the region’s lowest inflation rates to struggling with one of its highest. The value of Bolivia’s local currency on the black market is now half the official exchange rate. Fuel shortages paralyze the country. The central bank has effectively run out of dollars.\nMany of these problems took root under Arce’s iconic predecessor, Morales, but the majority of voters blame Arce for the economic chaos. Polls indicate that the embattled president has been falling further and further behind his left-wing rivals — Morales and Senate President Andronico Rodríguez.\nWith the MAS under Arce’s control, Morales was forced to break away and create his own party to host his candidacy.\nIt’s still unclear whether Rodríguez, a politically savvy 36-year-old from Morales’ rural coca-growing stronghold, will join the MAS ticket or register with another party. The registration deadline is May 19.\nArce’s decision to drop out Tuesday was also seen as a new chapter in his increasingly bitter enmity with Morales, whose renewed campaign pitch plays on nostalgia for the commodities-fueled public investment and falling poverty that characterized much of his almost 14-year tenure, from 2006 to 2019.\n“I challenge former President Evo Morales not to insist on running,” Arce said, “because constitutionally he cannot do so and because the dispersion and fragmentation of the vote would favor the right.”\nMorales, Bolivia’s first Indigenous president, faces numerous obstacles on the road back to his country’s highest office, six years after his bid for an unconstitutional fourth term led to mass protests and self-exile under pressure from the military.\nArce’s government insists that a 2023 constitutional court ruling bars Morales from seeking another term. Ever since a judge ordered Morales’ arrest on charges linked to a sexual relationship with a 15-year-old girl — allegations that he says are politically motivated — the ex-leader has been hunkered down in a remote tropical corner of Bolivia, protected by legions of fiercely loyal supporters.\nArce appealed to Rodríguez to rally their fractured socialist base against the opposition, leading some analysts to suggest the young, previously little-known politician may emerge as the most likely left-wing candidate.\n“The biggest winner is Rodríguez if Morales accepts Arce’s challenge to abandon his aspirations,” said Bolivian political analyst Marcelo Arequipa. “The (MAS party’s) decision is between losing power or remaining in power. Which do they prefer?”\nThere are at least four opposition candidates but no clear front-runner, paving the way for a tumultuous campaign season ahead of the August 17 election."
    }
  ],
  "argos_summary": "Bolivia is facing a significant political and economic crisis as it approaches the presidential elections, with former President Evo Morales excluded from the ballot and President Luis Arce withdrawing from the race amid declining popularity. The country is grappling with severe fuel shortages, rising inflation, and public discontent, leading to protests and calls for change. Morales' supporters are rallying for his candidacy despite legal barriers, while the ruling party, MAS, is divided between Arce and Morales, complicating the political landscape ahead of the elections.",
  "argos_id": "4ICW1H3HR"
}