{
  "url": "https://www.usatoday.com/story/news/nation/2025/08/11/blue-whales-silent-study/85608755007/",
  "authorsByline": "Michelle Del Rey",
  "articleId": "831a65d57271441caba932f11891e580",
  "source": {
    "domain": "usatoday.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "VA",
      "county": "Fairfax County",
      "city": "McLean",
      "coordinates": {
        "lat": 38.9342888,
        "lon": -77.1776327
      }
    }
  },
  "imageUrl": "https://www.usatoday.com/gcdn/authoring/authoring-images/2025/08/11/USAT/85610409007-usatsi-26127063.jpg?crop=3182,1791,x0,y58&width=3182&height=1791&format=pjpg&auto=webp",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T17:30:37+00:00",
  "addDate": "2025-08-11T20:09:37.576268+00:00",
  "refreshDate": "2025-08-11T20:09:37.576269+00:00",
  "score": 1.0,
  "title": "Scientists find blue whales suddenly going silent. Why they think it's happening.",
  "description": "Changing ocean conditions making whale prey scarce are causing the mammals to stop singing, a recent study has found.",
  "content": "Changing ocean conditions making whale prey scarce are causing the mammals to stop singing, a recent study has found.\n\nResearchers at the Monterey Bay Aquarium Research Institute, Cascadia Research Collective and other national institutions spent six years monitoring the acoustic sounds of blue, fin and humpback whales off the California coast from July 2015 to June 2021, according to a study published in February.\n\nResearchers set out to determine whether the frequency of whale songs changed seasonally and whether that frequency was indicative of changes within marine ecosystems.\n\nAs a result, scientists found the levels of whale songs among different species correlated with their ability to locate and consume prey.\n\nMarine biologists began the research in 2015, when a marine heatwave dubbed \"The Blob\" caused a large percentage of krill — teeny, shrimp-like creatures — to disappear. Humpback, blue and fin whales largely depend on krill as a primary food source.\n\nThe heatwave disrupted ocean circulation patterns, which impacted the number of cold, nutrient-rich waters that support the small crustaceans, according to the National Oceanic and Atmospheric Administration (NOAA).\n\nThis led to a scarcity of food supplies for fish, seals, penguins and whales.\n\nAdditionally, increasing temperatures contributed to the spreading of a toxic algae bloom between 2015 and 2016 in the northeastern Pacific, leading to the most widespread poisoning of marine mammals ever documented. In 2015, NOAA confirmed a then-record 53 instances involving whales getting caught in fishing gear.\n\nThe following year, the agency found 55 instances in which whales became entangled.\n\nAs humpback whales can switch between feeding on krill and fish, like sardines and anchovies, they experienced the most positive song detection trend throughout the six-year study.\n\nHowever, blue and fin whales, which are larger than humpback whales, did not exhibit the same positive trend. The two species are more specialized in foraging for krill. With the declining prey population, they were forced to spend more time hunting, leaving little time for singing, researchers found.\n\nThere is concern for similar patterns to continue as ocean temperatures continue to increase over time. Marine heatwaves also occurred in 2018 and 2019 during the summer months, when whales fatten up on krill to prepare for the rest of the year, according to NOAA.\n\nIn a report issued in June, the agency revealed a steep decline in Pacific gray whales. A new count suggests there are about 13,000 gray whales, the lowest number since the 1970s. In 2019, there were about 20,500 gray whales.\n\nFrom 2019 to 2023, the species suffered from an Unusual Mortality Event that scientists say stemmed from localized ecosystem changes in Subarctic and Arctic feeding grounds. Gray whales rely on prey in the area but changes in the ecosystem caused widespread malnutrition, reduced birth rates and increased mortality.\n\nIn other parts of the United States, there are signs that similar issues might be occurring.\n\nEarlier this month, a boat in Barnegat Bay, New Jersey, struck a 26-foot-long minke whale that ventured into shallow waters. Preliminary necropsy findings indicated the mammal was thin with an empty gastro-instestinal tract and little digestive material present, the Marine Mammal Stranding Center, the organization that conducted the testing, found.\n\nMichelle Del Rey is a trending news reporter for USA TODAY. Reach her at mdelrey@usatoday.com.",
  "medium": "Article",
  "links": [
    "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0318624#pone-0318624-g007",
    "https://www.facebook.com/search/top/?q=The%20Marine%20Mammal%20Stranding%20Center",
    "https://www.usatoday.com/story/news/world/2025/08/04/denmarks-aalborg-zoo-pet-donation-feed-predators/85507728007/",
    "https://www.usatoday.com/story/news/nation/2025/08/05/whale-dies-boat-new-jersey-video/85527096007/",
    "https://www.usatoday.com/story/sports/nhl/2025/08/01/seattle-kraken-buoy-john-hayden-bear/85478143007/",
    "https://www.usatoday.com/story/news/2025/04/25/right-whale-pair-florida-gulf-trip/83143963007/",
    "https://www.usatoday.com/story/news/nation/2025/08/06/man-provokes-bison-reaction-yellowstone-watch-video/85541845007/",
    "https://www.usatoday.com/story/news/world/2025/07/31/stick-insect-australia-discovery-video/85458253007/",
    "https://www.fisheries.noaa.gov/feature-story/eastern-north-pacific-gray-whales-continue-decline-after-downturn-during-unusual#:~:text=However%2C%20the%20most%20recent%20count,the%20Arctic%20earlier%20this%20year.",
    "https://app.adjust.com/1el9h6z4",
    "https://www.fisheries.noaa.gov/national/marine-life-distress/2019-2023-eastern-north-pacific-gray-whale-ume-closed",
    "https://www.fisheries.noaa.gov/feature-story/blob-research-reveals-environmental-effects-shut-down-fishing-and-hiked-whale#:~:text=%E2%80%9CThe%20more%20we%20understand%20the,tightly%20species%20are%20coalescing%20there.",
    "https://www.usatoday.com/picture-gallery/news/nation/2024/10/21/north-atlantic-right-whales-of-the-2024-calving-season/73704604007/",
    "https://www.usatoday.com/story/tech/science/2024/03/19/do-sharks-lay-eggs/72793634007/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "whale prey",
      "weight": 0.10705805
    },
    {
      "name": "whale songs",
      "weight": 0.10555953
    },
    {
      "name": "blue whales",
      "weight": 0.10529437
    },
    {
      "name": "Gray whales",
      "weight": 0.104652986
    },
    {
      "name": "humpback whales",
      "weight": 0.102408476
    },
    {
      "name": "Pacific gray whales",
      "weight": 0.10196681
    },
    {
      "name": "whales",
      "weight": 0.10170971
    },
    {
      "name": "marine mammals",
      "weight": 0.06528484
    },
    {
      "name": "Marine heatwaves",
      "weight": 0.061602436
    },
    {
      "name": "marine ecosystems",
      "weight": 0.061586604
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Science"
    }
  ],
  "taxonomies": [
    {
      "name": "/Pets & Animals/Wildlife",
      "score": 0.8701171875
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Green Living & Environmental Issues",
      "score": 0.78173828125
    },
    {
      "name": "/Science/Ecology & Environment/Other",
      "score": 0.73681640625
    },
    {
      "name": "/Science/Biological Sciences/Other",
      "score": 0.669921875
    },
    {
      "name": "/Science/Earth Sciences/Other",
      "score": 0.62890625
    }
  ],
  "sentiment": {
    "positive": 0.051613998,
    "negative": 0.71181375,
    "neutral": 0.23657228
  },
  "summary": "Researchers from the Monterey Bay Aquarium Research Institute, Cascadia Research Collective and other national institutions have found that changing ocean conditions are causing the animals to stop singing. The study was conducted after a marine heatwave in 2015 caused a large percentage of krill to disappear, leading to a scarcity of food supplies for fish, seals, penguins and whales. Humpback, blue and fin whales, which largely depend on krill as a primary food source, experienced the most positive song detection trend throughout the six-year study. However, larger than humpback whales did not exhibit the same positive trend due to their preference for krill. There is concern for similar patterns as ocean temperatures continue to increase over time.",
  "shortSummary": "Changing ocean conditions are causing blue whales to stop singing, while humpback and fin whales face fewer opportunities to hunt.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "740f30749cad47afa7c1d15af5dc2872",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.fisheries.noaa.gov/feature-story/eastern-north-pacific-gray-whales-continue-decline-after-downturn-during-unusual#:~:text=However%2C%20the%20most%20recent%20count,the%20Arctic%20earlier%20this%20year.",
      "text": "The eastern North Pacific population of gray whales that migrates along the West Coast of the United States has continued to decline, with reproduction remaining very low. Two new Technical Memorandums from NOAA Fisheries’ Southwest Fisheries Science Center report the estimated population size and calf productivity in 2025.\nThe initial population estimate of gray whales, following an Unusual Mortality Event that ended in late 2023, suggested that their numbers may have begun to rebound last year. However, the most recent count from winter 2025 instead reveals a continuing decline. The new count estimates an abundance of about 13,000 gray whales, the lowest since the 1970s.\nOnly about 85 gray whale calves migrated past Central California on their way to feeding grounds in the Arctic earlier this year. That’s the lowest number since records began in 1994. Low calf numbers since 2019 indicate that reproduction has remained too low for the population to rebound.\nThe estimates are based on models that combine visual sightings from NOAA Fisheries research posts in Central California with assumptions about how the whales migrate. The assumptions create some margin for error, but the models indicate that in 2025 the population is most likely between 11,700 and 14,500. They indicate the number of calves produced was between 56 and 294.\nThe annual estimates are most valuable in revealing population trends over time rather than pinpointing the number of whales or calves in a given year, scientists said.\nPast Resilience Wanes\nScientists attributed the Unusual Mortality Event from 2019 to 2023 to localized ecosystem changes that affected the Subarctic and Arctic feeding grounds. Most gray whales rely on prey in this region for energy to complete their 10,000-mile round-trip migration each year. The changes contributed to malnutrition, reduced birth rates, and increased mortality. Related research has linked fluctuations in the gray whale population to the availability of prey in its summer feeding grounds in the Arctic.\nThe gray whale population has proved resilient in the past, often rebounding quickly from downturns such as an earlier UME from 1999 to 2000. That makes the ongoing decline in abundance and reproduction following the more recent UME stand out, said Dr. David Weller, director of the Marine Mammal and Turtle Division at the Science Center and an authority on gray whales.\n“These whales depend, over the course of their lives, on a complex marine environment that is highly dynamic, and we expect the population to be resilient to that over time,” he said. “The most recent Unusual Mortality Event was much longer than the previous one from 1999 to 2000. The environment may now be changing at a pace or in ways that is testing the time-honored ability of the population to rapidly rebound while it adjusts to a new ecological regime.”\nResearchers in Mexico reported numerous dead gray whales early this year in and around coastal lagoons. Females nurse their calves in these lagoons in winter before beginning their migration north to the Arctic each spring. They also reported few gray whale calves, suggesting that many female whales may not be finding enough food in the Arctic to reproduce.\nSo far this year, 47 gray whales have stranded dead on the U.S. West Coast, up from 31 last year and 44 in 2023, the last year of the UME. While some of the stranded whales appeared skinny or emaciated, others did not.\nTracking Reveals Change\nThe reduced abundance and calf count underscore the value of long-term monitoring in detecting trends, said Dr. Aimée Lang, a research scientist who helps lead the gray whale counts. A decade ago the eastern North Pacific gray whale population was a conservation success story, having recovered from commercial whaling and nearing all-time highs of 27,000 whales. NOAA Fisheries determined in 1994 that the species had fully recovered and no longer needed protection under the Endangered Species Act.\nToday, however, the ongoing decline has scientists both puzzled and concerned. Ecosystem changes in the Arctic feeding areas the whales depend on to put on weight and maintain fitness are likely the root cause, Weller said.\nThe gray whale migration between Mexico and the Arctic crosses the California Current ecosystem and Arctic ecosystem. These areas have both experienced unpredictable changes in recent decades. “Certainly the whales are feeling that too, but may not be able to respond in ways that resemble those of the past,” Weller said."
    },
    {
      "url": "https://www.usatoday.com/story/news/nation/2025/08/06/man-provokes-bison-reaction-yellowstone-watch-video/85541845007/",
      "text": "Man tries to provoke bison into giving reaction at Yellowstone National Park\nA man was caught on camera taunting a full-sized bison at Yellowstone National Park in the hopes of getting its reaction.\nOn July 24, park visitor Brittney Matthews shared a video on social media featuring an unidentified man trying to get the attention of a bison, the largest land-dwelling mammal in North America. At first, the bison ignores him, but eventually approaches the man, who quickly backs away to keep a safe distance.\n“When he did not receive the response he wanted from the bison, he walked back up the hill,” Matthews said. “He decided to try again and went back down, this time getting closer to it.”\n“I was nervous for him, and sad for the bison,” Matthews said. “We were anticipating him being thrown into the river, and to be honest, I wouldn’t have blamed the bison.”\nWatch: Man tries to provoke bison at Yellowstone National Park\nBisons in Yellowstone\nLocated in northwest Wyoming, with small portions extending into Montana and Idaho, the first national park in the U.S. is the only place in the country where bison have lived continuously since prehistoric times.\nWith a population of 5,400 in 2024, according to the National Park Service, bison are described as agile, potentially aggressive and capable of running up to 30 mph. Males (bulls) can weigh up to 2,000 pounds, while females (cows) can weigh up to 1,000 pounds.\nIt is illegal to willfully remain near or approach wildlife, including birds, within any distance that disturbs or displaces the animal, NPS says, adding “if you cause an animal to move, you’re too close.\nNPS spokesperson Linda Veress stated in an email to USA TODAY on Aug. 7 that, while she \"cannot confirm this video,\" it has been \"forwarded to rangers for investigation.\"\nInteracting with wildlife at Yellowstone National Park\nYellowstone National Park has a list of guidelines that visitors are encouraged to follow when visiting the park and interacting with wildlife, including:\n- Stay at least 100 yards from bears or wolves, and at least 25 yards from all other wildlife.\n- If an animal moves closer to you, back away to maintain a safe distance.\n- If you cause an animal to move, you’re too close. It’s illegal to willfully remain near or approach wildlife, including birds, within any distance that disturbs or displaces the animal.\n- Park in roadside pullouts when watching/photographing animals: do not block traffic.\n- Never approach or pursue an animal to take its picture: use binoculars or telephoto lenses to get a better view.\n- Stay in or next to your car when watching bears. If a bear approaches or touches your car, horn and drive away to discourage this behavior.\n- Do not feed wildlife or leave food where they can get it, especially for bears.\n- Report conflicts. If you’re involved in a conflict with an animal, regardless of how minor, contact us or report it to a park ranger as soon as possible.\n“Wild animals are unpredictable and dangerous,” NPS says. “Every year, people are injured when they approach animals too closely. Animals that attack people may need to be killed.”\nThis story has been updated to include additional information.\nSaman Shafiq is a trending news reporter for USA TODAY. Reach her at sshafiq@gannett.com and follow her on X and Instagram @saman_shafiq7."
    },
    {
      "url": "https://www.usatoday.com/story/tech/science/2024/03/19/do-sharks-lay-eggs/72793634007/",
      "text": "Do sharks lay eggs? Here's how the fish gives birth and what some eggs look like.\nMaybe you've seen a \"mermaid's purse\" while walking on the beach. Not actually an accessory for the mythical creature, these small casings are the eggs of sharks and their relatives.\nFor around 455 million years, scientists believe sharks have been swimming the ocean's depths. Today, there are over 500 species.\nEach has its own unique habitats, behaviors and characteristics. While some share similarities, others may be vastly different. This also holds true for how sharks reproduce.\nDo sharks lay eggs?\nYes, and no. It depends on the species. Some sharks give birth by laying eggs, while others give birth to live young, Save Our Seas Foundation reports.\nSharks that give birth to live young are viviparous, like humans. Viviparous sharks are either placental or aplacental, according to the Florida Museum of Natural History.\nPlacental sharks develop a placental connection to their babies, similar to a mammal's umbilical cord. This leaves some sharks with \"belly buttons\" after they are born. Aplacental sharks do not have a placenta and their embryos rely on a yolk sac or unfertilized egg capsules for nutrition, the Florida Museum of Natural History reports.\nLemon sharks, bull sharks, mako sharks and blue sharks are among those that give birth to live young.\nThe remainder of sharks are oviparous, meaning they lay eggs. Oviparous sharks will lay eggs and leave them to develop and grow on their own. The eggs will hatch outside of a shark's body and the mother will not take care of her offspring, according to the Florida Museum of Natural History.\nApproximately 40% of shark species lay eggs, according to the MarAlliance, a conservation nonprofit. This includes wobbegongs, horn sharks and some cat sharks.\nWhat do shark eggs look like?\nMost shark eggs will look like a \"mermaid's purse.\" The casings will have long tendrils to attach to seaweed or debris, according to the Shark Research Institute. This prevents the eggs from being washed away by currents, the U.K.'s Natural History Museum reports.\nOther species, including the bullhead shark, will produce spiral-shaped eggs.\nJust Curious for more? We've got you covered\nUSA TODAY is exploring the questions you and others ask every day. From \"Do sharks have bones?\" to \"How long do orcas live?\" to \"What is the largest ocean?\" − we're striving to find answers to the most common questions you ask every day. Head to our Just Curious section to see what else we can answer."
    },
    {
      "url": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0318624#pone-0318624-g007",
      "text": "Figures\nAbstract\nAmong tremendous biodiversity within the California Current Ecosystem (CCE) are gigantic mysticetes (baleen whales) that produce structured sequences of sound described as song. From six years of passive acoustic monitoring within the central CCE we measured seasonal and interannual variations in the occurrence of blue (Balaenoptera musculus), fin (Balaenoptera physalus), and humpback (Megaptera novaeangliae) whale song. Song detection during 11 months of the year defines its prevalence in this foraging habitat and its potential use in behavioral ecology research. Large interannual changes in song occurrence within and between species motivates examination of causality. Humpback whales uniquely exhibited continuous interannual increases, rising from 34% to 76% of days over six years, and we examine multiple hypotheses to explain this exceptional trend. Potential influences of physical factors on detectability – including masking and acoustic propagation – were not supported by analysis of wind data or modeling of acoustic transmission loss. Potential influences of changes in local population abundance, site fidelity, or migration timing were supported for two of the interannual increases in song detection, based on extensive local photo ID data (17,356 IDs of 2,407 individuals). Potential influences of changes in foraging ecology and efficiency were supported across all years by analyses of the abundance and composition of forage species. Following detrimental food web impacts of a major marine heatwave that peaked during the first year of the study, foraging conditions consistently improved for humpback whales in the context of their exceptional prey-switching capacity. Stable isotope data from humpback and blue whale biopsy samples are consistent with observed interannual variations in the regional abundance and composition of forage species. This study thus indicates that major interannual changes in detection of baleen whale song may reflect underlying variations in forage species availability driven by energetic variations in ecosystem state.\nCitation: Ryan JP, Oestreich WK, Benoit-Bird KJ, Waluk CM, Rueda CA, Cline DE, et al. (2025) Audible changes in marine trophic ecology: Baleen whale song tracks foraging conditions in the eastern North Pacific. PLoS ONE 20(2): e0318624. https://doi.org/10.1371/journal.pone.0318624\nEditor: William David Halliday, Wildlife Conservation Society Canada, CANADA\nReceived: March 8, 2024; Accepted: January 18, 2025; Published: February 26, 2025\nThis is an open access article, free of all copyright, and may be freely reproduced, distributed, transmitted, modified, built upon, or otherwise used by anyone for any lawful purpose. The work is made available under the Creative Commons CC0 public domain dedication.\nData Availability: All data underlying this study, together with analysis code, are accessible at https://doi.org/10.6084/m9.figshare.24977925.v1.\nFunding: The work of JPR, WKO, KJBB, CMW, CAR, DEC and YZ was funded by The David and Lucile Packard Foundation, through an annual grant to the Monterey Bay Aquarium Research Institute. The U.S. National Science Foundation funded installation and maintenance of the MARS cabled observatory through awards 0739828 and 1114794. The funders had no role in study design, data collection and analysis, decision to publish, or preparation of the manuscript.\nCompeting interests: The authors have declared that no competing interests exist.\nIntroduction\nMonitoring dynamic marine ecosystems for improved ecological understanding and better-informed resource management is a globally important challenge. In recent decades, major advances in remote sensing technologies – including satellites [1], coastal radar stations [2], autonomous platforms [3–5], and uncrewed aerial systems [6] – have contributed to the ability to observe physical, chemical, and biological processes in marine ecosystems with increasing precision and detail. Despite these advances, monitoring species of higher trophic levels at ecosystem scales remains a significant challenge. Remote sensing via passive acoustic monitoring (PAM) is essential for filling this gap for several reasons. Most notably, the aquatic medium and limited visibility in marine ecosystems has led to the evolution of long-distance acoustic communication in marine animals [7], allowing for wide-ranging detection of soniferous species and their behavior using hydrophones [8]. In this study, we examine how variations in detection of song from three baleen whale (Mysticeti) species with distinct foraging strategies inhabiting the central California Current Ecosystem (CCE) – blue whales (B. m. musculus musculus), fin whales (B. p. physalus), and humpback whales (M. n. novaeangliae) – track variations in ecosystem state and forage species abundance and composition.\nBlue, fin, and humpback whale populations all exploit the tremendous seasonal biological productivity of the CCE to support their large body size and long-distance movements [9,10]. This eastern boundary upwelling ecosystem also supports diverse and abundant populations of other ecologically, economically, and culturally significant organisms. Upwelling of deep, nutrient-rich water in the CCE (Fig 1) results from seasonal equatorward wind forcing and supports the growth of phytoplankton [11,12]. This primary productivity propagates to higher trophic levels, sustaining seasonally abundant forage species on which numerous and diverse predators depend [13]. In addition to strong seasonality in physical and biological oceanographic conditions, this upwelling system is marked by significant interannual variability in upwelling magnitude and phenology, levels of primary productivity, and relative abundance of distinct forage species [14–19]. For example, a persistent marine heatwave during 2014–2016 changed regional upwelling dynamics and phytoplankton ecology, in turn impacting the behavior and population health of invertebrate and vertebrate animal species [20–24]. At decadal time scales, large-scale physical oscillations that drive changes in forage species abundance and composition are evident in the diets of humpback whales, as revealed by stable isotope analysis [25,26]. These impacts at higher trophic levels suggest that top predator populations could act as ecosystem sentinels [27]. Some predator populations have recently been assessed in this context, e.g., seabirds [28], humpback whales [29] and blue whales [30], each providing insights into marine heatwave impacts on forage species and predator ecology.\n(a) The passive acoustic monitoring site is in Monterey Bay National Marine Sanctuary (MBNMS) along the eastern margin of the North Pacific. Hydrophones are operated through the Monterey Accelerated Research System (MARS) cabled observatory (main node at 36.713°N, 122.186°W, 891 m depth). The ocean base map is the intellectual property of Esri and is used herein under license. Copyright © Esri. All rights reserved. (b) A sea surface temperature (SST) image acquired on 13 October 2020 shows the process that fuels primary productivity, upwelling of deep nutrient-rich water. Upwelling is illustrated by filamentous cool SST plumes that are coldest where they originate along the coast, which tends to be around Point Año Nuevo and Point Sur in the Monterey Bay region [31]. (c) Annual biologically effective upwelling transport index (BEUTI) at 37°N represents the vertical flux of nitrate into the surface mixed layer per meter of coastline [17]. To emphasize interannual variation, BEUTI is presented as annual differences from the long term mean of annual totals (174 kmol/ m). The shaded period identifies the years for which acoustic detection of baleen whale species is examined.\nBlue, fin, and humpback whales exhibit different foraging strategies and seasonality of presence in this ecosystem. Eastern North Pacific blue whales are obligate euphausiid (krill) predators which typically forage along the shelf break off western North America during the summer and fall before migrating southward to lower-latitude breeding grounds [32,33]. The timing of blue whale arrival and departure from CCE foraging habitat can vary by several months interannually in association with changes in the phenology of physical and biological oceanographic processes which drive krill abundance, density, and distribution [19,34]. Fin whales in the eastern North Pacific also prey primarily on euphausiids, although copepods may contribute substantially to their diet in some years [35]. Studies employing biotelemetry [36] and PAM [37] suggest that fin whales occupy the CCE year-round. Tag deployments on fin whales in the Southern California Bight indicated two seasonal patterns: (1) migration of part of the population to lower latitudes in winter, and (2) preferential habitat occupancy nearshore during fall and winter and offshore during spring and summer [36]. Relatively little is known about the habitat preferences and seasonality of fin whales in the central CCE. Humpback whales that forage in the central CCE belong almost exclusively to two of the distinct population segments in the northeastern Pacific, migrating between foraging grounds off the western United States and breeding grounds off Mexico and Central America [38–41]. While migration between foraging grounds and lower latitude breeding grounds is well documented, visual sighting and PAM data indicate nearly year-round presence of humpback whales in the central CCE [29]. During their time in foraging habitat off western North America, humpback whales target both krill and forage fish (anchovy and sardine), flexibly switching between dominant prey sources depending on oceanographic conditions [26].\nSinging behavior of blue, fin and humpback whales, involving production of sound sequences that are rhythmic and structured, is thought to be limited to mature males [42–45]. While song is often associated with reproductive behavior [42,45,46], song detection has also been used to derive insights into foraging dynamics [30,47,48], migration timing [19,49], cultural transmission of behavior [50], trends in relative abundance and patterns of spatial distribution [51,52]. This information-rich acoustic signal (Fig 2) can be detected by a single hydrophone over an area covering thousands of km2 [29,49], and it can dominate marine soundscape spectra [53–56], making acoustic monitoring of baleen whale song an effective remote sensing tool of large marine ecosystems [57,58].\nThe spectrogram shows simultaneous song (structured sound sequences) from three baleen whale species — blue, fin and humpback — recorded through the MARS cabled observatory (Fig 1) on 1 January 2018. The approximate frequency range used by each species is indicated at the right. One blue whale A and B call each is labeled immediately before an example; the B call is labeled at the third and most energetic harmonic. Spectrogram parameters: sample frequency fs = 16 kHz, length of fast Fourier transform (FFT) for each segment nfft = 16,000, Hanning window, 50% overlap between segments. The frequency dependent first percentile of spectrum levels was subtracted to emphasize song signal above a frequency-dependent background. Whale artist: Larry Foster.\nCentral to the context of this study is that singing occurs extensively within foraging habitat of the central CCE. Previous studies in this region have detected song from blue whales 7 months of the year and from humpback whales 9 months of the year [29,49]. Song detection in both species can begin months before the winter breeding migration. Humpback whale song can persist for months following the breeding season, after whales return to foraging habitat in spring, a pattern also observed in foraging habitat of the western North Atlantic [59]. In Antarctic foraging habitat, humpback whale song can have the level of complexity found in breeding habitat, and it has been detected to occur during foraging dives [60]. A growing body of literature is recognizing the prevalence of this behavior within foraging habitat, in addition to migratory [61–63] and breeding habitat [51,52].\nDetection of both song (Fig 2) and foraging-associated calls can contribute to ecological research. Foraging-associated calls are produced by blue and fin whales [44,64,65], however they are much less prevalent than song in our study region. Blue whale tag data from the eastern North Pacific show that rates of song calls can exceed those of foraging-associated calls by an order of magnitude [44]. PAM data for fin whales off Southern California show a greater proportion of hours per week and a greater proportion of the year during which song calls (20 Hz pulses) were detected compared to foraging-associated calls (40 Hz pulses) [64]. No studies have identified foraging-specific humpback whale calls in our study region. The lesser occurrence of foraging associated calls and the inability to consistently examine their occurrence across all three whale species motivate the focus of the present study on detection of song, which is a more abundant signal that can be described across all three whale species.\nHere we combine measured detection of blue, fin, and humpback whale song with concurrent data on whale photo ID, forage species abundance and behavior, isotope-based diet analysis from whale skin biopsy samples, oceanographic and meteorological conditions, and modeling of acoustic propagation to derive insights into the presence and foraging ecology of these sympatric mysticetes. We apply these methods within a six-year study period, July 2015 through June 2021, in the central CCE to address two questions: (1) How does song detection vary seasonally and interannually? (2) Are interannual variations in detection of song indicative of ecosystem state and availability of key forage species? In answering these questions, we show how the songs produced by these gigantic vertebrates can reveal complex dimensions of their ecology in a vast and highly variable ecosystem.\nMaterials and methods\nAcoustic recordings\nAcoustic recordings were acquired through the Monterey Accelerated Research System (MARS) cabled observatory, located on the continental slope outside Monterey Bay, California (Fig 1a). Since July 2015, MARS has supported nearly continuous recording at a sample rate of 256 kHz using an Ocean Sonics icListen HF, an omnidirectional hydrophone with a bandwidth of 10 Hz to 200 kHz. The data are streamed to a computer on shore and stored in 10-minute wav files. Two derived data products supported analyses: (1) daily files of original audio decimated to a 16 kHz sample rate [66], which enabled humpback whale song detection, and (2) daily files of power spectra with temporal and frequency resolutions of 5 seconds and 1 Hz, respectively, which enabled blue and fin whale song detection. Daily acoustic metrics, described below, were the basis for examination of seasonal and interannual patterns. Only days with at least 75% recording coverage were included in analyses. Of 2192 days within the 6-year period, 96% (2111) were sampled, 97% of sampled days (2051) had coverage of 75% or greater, and 92% of sampled days (1948) had complete coverage.\nDetecting whale song and quantifying its variations\nDetection of humpback whale song (Fig 2) employed a deep convolutional neural network (CNN) that was previously trained based on recordings of North Pacific humpback whale song and proven to generalize well across a range of recording and noise conditions [67]. The model frames input audio into analysis windows and produces a corresponding sequence of logistic units as scoring of humpback whale song detection, ranging between 0 and 1. We resampled input data to 10 kHz, as used in the original model development, and applied the CNN model to obtain scores at 1-second resolution over the 6-year study period. To validate model application to MARS recordings, we manually examined two years of results by directly comparing CNN scores with temporally aligned high-resolution spectrograms [58]. This comparison confirmed reliable and consistent detection of humpback whale song, even amid substantial background noise, and it was used to establish the threshold score used for classification. Because two other biological sound sources, gray whales and dolphins, at times produced moderately elevated scores (~0.3 to 0.6), we applied a minimum score threshold of 0.7 to reliably detect humpback whale song and distinguish it from other signals. For each day we quantified the percent of recording time during which the score exceeded this threshold. A minimum daily value of 3% of recording time with a score exceeding 0.7 was applied to define daily presence of song. Performance metrics based on these criteria are summarized in the results.\nDetection of blue and fin whale song (Fig 2) used energy detection methods that focus on the most prevalent calls produced by these species in the study region: the fin whale 20 Hz call and the blue whale B call. This prevalence is indicated by previous studies in the CCE [44,64] as well as visual examination of high-resolution spectrograms from our monitoring site across all years of the study [68]. For each species we computed a call index (CI; [37,49,69]) as the ratio of the peak spectrum level within the frequency band of the call to the average spectrum level in adjacent frequency bands that are uninfluenced by low-frequency baleen whale vocalizations. CI was calculated at daily resolution using daily mean calibrated power spectra. This method has two advantages: (1) it quantifies the integrated energy of calling, regardless of whether or not chorusing occurs, and (2) it minimizes potential bias from ephemeral noise sources affecting background spectrum levels. The biophonic signal underlying this method is represented by mean spectrum levels across the frequency range spanning both call types (Fig 3a) and the statistical distributions of daily mean spectrum levels in peak and background bands (Fig 3b). The ability to quantify sound energy of targeted whale calls using this method is illustrated by the relative stability in background frequency bands compared to strong seasonal elevation of spectrum levels in the frequency range of the fin whale 20 Hz call (peak 20–21 Hz) and the third harmonic of the blue whale B call (peak 42–43 Hz). For both blue and fin whales, a minimum CI value of 1.01 was applied to define song presence. Considering that CI = 1.0 represents no signal and maximum daily CI values are approximately 1.2 for both species, the minimum threshold of 1.01 represents a signal approximately 5% above the floor of the dynamic range.\n(a) The long-term median of daily mean spectrum levels measured at MARS (Fig 1) for the months of August through December shows peaks caused by fin whale 20 Hz pulses and the third harmonic of blue whale B calls (Fig 2). The frequencies at which spectrum levels were used to compute the call index are indicated: peak call energy (solid gray circles) and adjacent background (open circles, one 1-Hz band above and below each peak). (b) Monthly boxplot of daily mean spectrum levels, based on the full time-series, illustrate seasonal changes at the peak frequencies of blue and fin whale calls relative to background. Shown are the interquartile range (IQR, box), median (thick horizontal line), minimum (lower limit of vertical line), and the third quartile + 1.5 × IQR (upper limit of vertical line).\nTo qualify the daily blue and fin whale energy detection metrics as representative of song, additional analyses were conducted. For blue whales we examined occurrence of a different call produced in songs: the A call [70]. In the blue whale song represented in Fig 2, two A calls are represented (label A next to the first). Each A call was followed by a series of B calls (label B next to the third harmonic of one B call; 14 and 15 repetitions, respectively). Considering the core daily detection metric for B calls, we manually examined high-resolution spectrograms for every day within the 6-year study period for which the B-call metric exceeded the minimum threshold, and we quantified cooccurrence of A and B calls. For fin whales we also examined high-resolution spectrograms throughout the time-series to determine whether fin whale 20 Hz calls consistently occurred in series with regular interpulse intervals that are characteristic of song [71].\nDaily time-series of metrics for all species were smoothed with a 5-day running mean to clarify temporal boundaries of persistent song presence/ absence while retaining clear description of variations within the annual period of song occurrence. The smoothed, quality-controlled daily time-series comprised the basis for examination of both seasonal and interannual patterns in acoustic detection. Considering the different methods of detecting and quantifying song occurrence across species, it is essential to apply a single consistent metric of seasonal and interannual detection levels. The metric we apply is the percent of recorded days during which detection metrics exceeded their minimum thresholds. For the seasonal time scale, we combined data from all years to define a monthly climatology of the percent of days with detection. For the interannual time scale, we computed the percent of days with detection in each year. Because of the seasonal pattern of baleen whale song, which arises in all three species between July (blue) and August (fin, humpback), each analysis year spanned July 1 of a calendar year through June 30 of the following calendar year.\nPrevious studies of blue whale song demonstrated that the trend in the day:night ratio of song detection during fall-winter can reveal the timing of the southward breeding migration, which covaried with upwelling and differed by as long as 4 months among the years studied [19,49]. This metric is thus included in our study as a potential indicator of behavioral ecology across all whale species examined. It is computed from the full-resolution song metrics (1 second for humpback whale song scores, 5 seconds for blue and fin whale call indices) binned into solar elevation (SE) ranges that define day (SE > 0°) and night (SE < −12°).\nExamining causality of interannual variations in song detection\nUsing interdisciplinary observations and modeling, we consider multiple hypotheses to explain causality of the major patterns of interannual variation in detection of whale song. These hypotheses involve ecological variables that affect the source signal within the domain of acoustic reception, and environmental variables that affect signal transmission to the receiver and signal distinction within the greater soundscape. Behavioral ecology variables include whale local abundance, proximity to MARS, site fidelity, migration timing, and the acoustic behavior of mature male (singing) individuals. Environmental variables include physical conditions that determine acoustic propagation, and noise sources that can mask song signal and inhibit detection. Hypotheses are not mutually exclusive, they cannot be completely examined for any of the whale species, and they cannot all be directly examined from available data. However, hypotheses can be most fully considered for humpback whales because extensive photo ID data are uniquely available for this species. These data enable quantitative metrics of local abundance, site fidelity, and migration timing. Below we summarize the ancillary data and modeling resources applied.\nWhale sightings and photo identification.\nTo examine seasonal and interannual variation in visual detection in relation to acoustic detection, we utilized identifications of individual whales collected by researchers, naturalists, and citizen scientists aided by a convolutional neural network-based photo ID algorithm [72]. Of the three whale species studied, only humpback whales persistently occupy habitat within the typical domain of whale-watch tours and associated photographic sampling, and CNN application to humpback fluke photos (Fig 4a) is fully developed, so application is constrained to this species. The photo archive came from photographs contributed through a web-based marine mammal photo ID collaboration system, Happywhale, from which we examined a subset of a North Pacific-wide dataset [73]. Compared to simple encounter counts from sighting data, using photo ID to quantify the number of unique individuals and their persistence in the recording area enhances comparison with acoustic detection metrics. For our 6-year study period of July 2015 through June 2021, 17,356 identifications (Fig 4b) of 2407 unique individuals were used to compute a base statistic: the number of unique individuals identified each day (UID/day). The value of frequent sampling is evident in the percentage of days that have photographic ID data (Fig 4c).\n(a) Example photo of a humpback whale fluke from which identification of individuals is enabled through distinction of fluke shape and coloration. This photo by T. Cheeseman is of the individual most frequently identified in the Monterey Bay region during the study period, Fran, who was killed by a ship strike in August 2022. (b) Spatial distribution of Happywhale photo ID data over the 6-year study period (n = 17,356); ID counts were summed within equal area grid cells of 10.7 km2 using the R package dggridR. Photos from Monterey Bay without position metadata (5.8% of records) were assigned to 36.8°N, 122°W (marked by asterisk). (c) Monthly summary for the six-year study period: percent of days having photo ID data (left axis) and a boxplot of the base visual detection metric, the number of unique individuals identified per day (right axis). Shown are the interquartile range (IQR, box), median (thick horizontal line), minimum (lower limit of vertical line), the third quartile + 1.5 × IQR (upper limit of vertical line), and outliers (gray circles).\nFrom the daily UID time-series we computed three visual detection metrics that are relevant to acoustic detection. The first metric, local population abundance, is based on analysis of UID/day at seasonal and interannual time scales. Seasonal variation was examined at monthly resolution within individual years and climatologically (pooling UID/day data monthly across all years), and interannual variation was examined from UID/day data pooled within each study year. Comparisons applied graphical (boxplot) representation and evaluation of significant differences using paired Wilcoxon rank sum tests. The second metric, migration timing, is based on the temporal progression of UID/day. Monthly binning provided a statistical framework within which significant changes and threshold crossings were identified. A threshold was defined at the 33rd percentile of 1568 daily measurements of UID/day made across all years, effectively describing separation of the lower third from the upper two thirds of the statistical distribution of values. To consider the timing of northward spring migration, returning from distant breeding habitat to local foraging habitat, we identified the first month in which monthly median UID/day rose and remained above the threshold. To consider the timing of southward winter migration, away from local foraging habitat to distant breeding habitat, we identified the first month in which monthly median UID/day fell and remained below the threshold. The third metric, site fidelity, was based on the number of days within each year that each individual was identified in the study area. This individual-based statistic was examined at the interannual time scale via nonparametric boxplots and evaluation of significant differences using Wilcoxon rank sum tests. Sensitivity of statistical comparison was tested by screening individuals included in the analysis at a range of minimum thresholds for the number of days that each individual was identified within each year being compared: from 1 to 4 days.\nTo complement the analysis of all available photo-ID data (Fig 4), we also examined sightings and photo-ID data acquired during regional scientific surveys [74]. This analysis examined fall 2017 versus fall 2019 within study years 3 and 5, which were marked by strong contrasts in acoustic detection of humpback whales and in the abundance and composition of forage species populations. Scientific visual surveys were conducted between August and November in 2017 during 19 days of effort along 1979 km, and between July and December in 2019 during 21 days of effort along 2634 km (Fig 5). Survey temporal coverage spans the annual period when humpback whale acoustic detection rises to its annual peak in the Monterey Bay region [29].\nSurvey tracks (gray) are represented for years that strongly contrasted in both humpback whale acoustic detection and forage species abundance and composition (see Results). Total survey distance and time for each year are summarized in the map annotations. Blue and red symbols show the locations of whale biopsy samples.\nRegional and local forage species abundance and aggregation.\nStandardized abundance data for forage species in the central CCE, based on annual midwater trawl surveys conducted between late April and mid June, were acquired through the Rockfish Recruitment and Ecosystem Assessment Survey (RREAS). For over 40 years the RREAS has sampled fixed stations and conducted trawls at night (when forage species are relatively shallow) with a target depth range of 30–40 m. These data have been applied to study variation in forage species in relation to ecosystem conditions and associated consequences for foraging ecology and ecosystem-based management [16,25,26,29,75–77]. The RREAS forage species categories that we focus on are krill (total species abundance), adult anchovies and adult sardines. Regional indices are derived from model-based estimates that account for sampling effort and distribution [78] and are provided to the California Current Integrated Ecosystem Assessment [79]. Observations of forage species upon which whales were feeding were also part of the scientific surveys described for humpback whale photo ID; these data are examined in relation to focal individuals for whom biopsy samples were collected (Fig 5; see section on dietary inference below).\nComplementary to the strength of the annual spring-summer characterization of regional forage species by RREAS, moored echosounder data can provide continuous characterization locally to more fully assess the quality of the forage preyscape utilized by whales. During the last two years of the study period, observations of forage species were made nearly continuously with a 38 kHz upward-looking scientific echosounder at MARS, collocated with the hydrophone (Fig 1). This instrument could detect macrozooplankton, micronekton, and larger animals from its seafloor position at 890 m depth nearly to the sea surface. However, this echosounder is more sensitive to fish than krill and is therefore most appropriate to considering the foraging ecology of humpback whales. The modified Simrad EK60 echosounder transmitted a 2.048 ms ping upward in a 7-degree beam every 2.5 s using an output power of 400 W [80]. Data were processed using Echoview software to remove ambient noise and spikes along with other invalid data including the ocean surface before additional analyses that used a combination of Echoview and custom scripts in LabVIEW. Aggregations, contiguous areas of scattering that were significantly higher in intensity than their surroundings, were detected following [81]. Humpback whales in the CCE typically forage within the upper 200 m [82], therefore the total area scattering (sA, m2/nmi2) and the area scattering within aggregations in the upper 200 m were calculated for each day.\nDietary inference.\nTo consider changes in whale diet that may have resulted from interannual changes in forage species abundance and composition, we conducted a limited examination of stable carbon (δ13C) and nitrogen (δ15N) isotope values from biopsy samples. In this exploratory analysis we focused on humpback and blue whales because more biopsy samples exist for these species, and they are the most divergent in foraging behavior – with stenophagous blue whales contrasting the foraging flexibility of humpback whales. Our sample data set comprised five skin samples from each whale species for each of two years that strongly contrasted in forage species abundance and composition: 2017 versus 2019. Biopsy samples, including skin and a thin layer of blubber, were collected between July and September in the Monterey Bay region (Fig 5) by Cascadia Research Collective from small boats using a modified crossbow fitted with a hollow-tipped dart [83]. Samples were frozen at −80°C and stored at the Southwest Fisheries Science Center until processing. Prior to stable isotope analysis (SIA), 5 mg of skin from each sample was split, lyophilized (in a Virtis benchtop lyophilizer) and lipid extracted using a Dionex Accelerated Solvent Extractor (ASE using 100% petroleum at three 5-min cycles at 1500 psi and 100 °C) and homogenized before weighing out approximately 1 mg into a tin capsule for SIA. Sample analysis for δ13C and δ15N was conducted at the University of Florida Gainesville Stable Isotope Laboratory and used a Thermo Electron DeltaV Advantage isotope ratio mass spectrometer coupled with a ConFlo II interface linked to a Carlo Erba NA 1500 CNHS Elemental Analyzer. All carbon isotopic results are expressed in standard delta notation relative to VPDB. All nitrogen isotopic results are expressed in standard delta notation relative to AIR. Resulting isotopic signatures were compared using the Stable Isotope Bayesian Ellipses in R (SIBER) package [84] to examine differences between years and species. Isotopic niche widths of blue and humpback whales were calculated based on the standardized ellipse of the δ13C and δ15N data and an ellipse corrected for small sample size (SEAc).\nEthics statement: Whale biopsy sampling and scientific surveys by Cascadia Research were conducted under NOAA National Marine Fisheries Service scientific research permit 21678 issued to JC.\nUpwelling intensity.\nTo consider how upwelling drives interannual variation in nutrient supply and primary productivity, we examined the biologically effective upwelling transport index (BEUTI; [17]) computed for 37°N, immediately north of Monterey Bay (Fig 1). After smoothing the daily time-series with a 5-day running mean, cumulative upwelling for each year was computed as the sum of positive daily values. Persistent periods of downwelling (negative BEUTI) are associated with winter storms, during the annual period when primary productivity is light limited. The sum of positive BEUTI values thus effectively focuses on conditions following the annual spring transition to upwelling, when primary production rises with increasing nutrient supply and insolation [12], thereby fueling ecosystem productivity. A similar approach to characterization of annual BEUTI has been applied to examining interannual variations in the timing of blue whale migration in relation to upwelling phenology [19].\nCoastal upwelling also affects baleen whale foraging ecology more directly through relationships to upwelling intensity. On the time scale of individual oscillations in upwelling intensity (days to weeks), blue whales in the Monterey Bay region have been observed to track the cool upwelling plumes within which krill aggregate [48,85]. We are not aware of studies that examine this association in fin whale populations. Over longer time scales, humpback whale habitat occupancy in the eastern North Pacific has been observed to respond strongly to marine heatwave conditions that compress cool upwelling-influenced habitat close to the coast, in turn exacerbating entanglement of whales in nearshore fishing gear [76,86]. We examine the areal extent of upwelling habitat to address a specific question: Was compression of cool (upwelling) habitat evident, and thus potentially influential, across two focal study years in which visual and acoustic detection metrics for humpback whales diverged significantly? Using sea surface temperature data from the monthly Multi-scale Ultra-high Resolution (MUR) SST Analysis fv04.1, acquired via the NOAA ERDDAP server, we compare the area off central California having SST below a threshold indicative of upwelling during spring (12.5°C). This isotherm was previously defined for computing the Habitat Compression Index (HCI) across seasons and regions of the CCE [86].\nEnvironmental factors in relation to acoustic detection.\nTo examine how environmental factors may have influenced acoustic detection of whale song, we considered both acoustic masking and acoustic propagation. Noise levels in the background frequency bands of blue and fin whale call indices (Fig 3) were examined with graphical and statistical summaries (box plots and Wilcoxon rank sum tests) of daily mean power spectral density at seasonal and interannual time scales. Because humpback whale song extends across a frequency band impacted by wind noise [87,88], we also examined local wind speed data graphically and statistically. This analysis was constrained to the focal interannual comparison (Year 3 versus Year 5) for which the most comprehensive data (acoustic and visual detection metrics, stable isotope measurements from whale biopsy samples, environmental and ecosystem conditions) were examined to assess hypotheses.\nFor the focal interannual comparison of humpback whale song detection (Year 3 versus Year 5), we also modeled how interannual changes in oceanographic conditions may have influenced acoustic detection through changes in sound speed profiles and associated changes in acoustic transmission loss. After identifying that the interannual difference was driven by song detection during spring (March – May), we modeled acoustic transmission loss of humpback whale song calls at daily resolution during these months of both years. The acoustic model has been previously described and applied to characterize the spatial domain over which humpback whale song is received at MARS during the season of peak song occurrence [29], and the reader is referred to this prior study for model details and specification of sound source attributes. In the present study, we first confirmed the ability of the HYCOM model, upon which the acoustic propagation model relies, to represent observed interannual differences in environmental conditions. This involved comparing HYCOM model SST with MUR SST satellite remote sensing data. After confirming HYCOM’s accurate representation of interannual changes, we modeled acoustic transmission loss profiles daily at 100 m horizontal resolution along a 110 km section extending both inshore and offshore of the MARS observatory. The distributions of acoustic transmission loss between MARS and a humpback whale singing at 20 m depth (consistent with observations [87]) were examined graphically and statistically tested for differences (boxplot and Wilcoxon rank sum tests).\nResults\nThe measured acoustic signals represent song\nInterpretation of measured acoustic signals as song is supported by different analyses for each species. Validation of daily presence/ absence of humpback whale song from CNN results, based on examination of two years of high-resolution spectrograms (November 2018 through October 2020), yielded performance metrics of 100% precision and 97% recall. Blue whale A call occurrence was confirmed for 96% of all days for which the daily B-call metric defined song presence, and A and B call cooccurrence within song sessions was consistently apparent in the high-resolution spectrograms. For some of the remaining 4% of days, faintness of the song signal and presence of background noise, in addition to the relatively weak energy of A calls compared to B calls (Fig 2), may underlie the inability to confirm A call cooccurrence. Examination of high-resolution spectrograms also showed that from the time fin whale song is first detected in fall through the time it is last detected in spring, these low-frequency pulses consistently occur in series having a regular interpulse interval that defines song [71]. These analyses thus support the interpretation of quantified acoustic signals from all three whale species as song.\nSeasonal patterns\nMonthly statistics derived from all years of data (Fig 6) show differences in song phenology among species, with blue whale song offset earlier (July - February) and detectable for a shorter period (8 months) compared to fin whale song (August - May, 10 months) and humpback whale song (August - June, 11 months). Also examined at climatological monthly resolution, photo ID data for humpback whales (Fig 4) allow comparison of seasonal visual and acoustic detection metrics (Fig 6b). While mean rates of humpback visual detection are highest during July through September, song detection rises steeply from 0% to 68% of days, indicating emergence of this acoustic behavior within the regional foraging population. Visual detection declines steadily during October through February, with the mean dropping from 11 to 2 UID/day as part of the population migrates away from local foraging habitat to distant breeding habitat. Concurrently, song detection rises to an annual peak at 100% of recording days during November before declining to 54% of recording days by February. Visual detection rates increase from the annual minimum of 2 UID/day in February to 10 UID/day in May as whales return to foraging habitat, while song detection rates remain at intermediate levels: 54% in March, 55% in April, and 30% in May. Disappearance of song detection during June–July occurs amid stable and high levels of visual detection, indicating cessation of this acoustic behavior.\n(a) Daily values of song detection metrics are the percent of recording time during which a deep convolutional neural network [67] detected humpback whale song and the call index (CI) for blue and fin whales (Fig 3). Points shown are above the minimum threshold of the full time-series: more than 3% of daily recording time with a model score exceeding 0.7 for humpback whales, or CI > 1.01 for blue and fin whales. (b) A climatology of seasonal variation in song detection derived from the data in (a), pooled by month across years. Bars represent the percent of recorded days within each month during which song detection exceeded minimum thresholds. For humpback whales, circles (right axis) represent the monthly mean number of unique photo IDs per day, derived from data spanning the full study period (Fig 4).\nInterannual patterns\nInterannual variation in song detection was pronounced (Fig 7a). During years 1–3, the annual metrics show that all three whale species exhibited a positive trend in acoustic detection, increasing by factors of 1.4 (humpback),1.5 (blue) and 1.8 (fin). Blue and fin whales exhibited correspondence between the magnitude of interannual increase and the nature of the underlying daily metrics. The years showing the highest daily CI for the longest duration (Fig 6a, year 2 for fin whales; year 3 for blue whales) were the same years that exhibited the greatest increase in the percent of days having acoustic detection (Fig 7a). During years 4–6, humpback whale acoustic detection uniquely continued to increase each year, reaching levels higher by a factor of 2.2 during year 6 than year 1. This distinction of humpback whale song was uniquely paralleled by a positive trend in the day:night ratio of song activity, increasing by a factor of 1.9 during the study period (Fig 7a). Neither blue nor fin whales exhibited a continuous positive trend in song detection, instead showing decreases across two of three interannual changes following year 3. They also exhibited no significant changes in annual day:night ratios of song activity (Fig 7a).\n(a) Annual metrics of acoustic detection (solid lines, left axis) and its day:night ratio (dashed lines, right axis) for each whale species. (b) Boxplot of the daily number of unique humpback whale photo IDs from data in the Monterey Bay region (Fig 4), pooled by year (beginning July 1, as in Fig 6a). Shown are the interquartile range (IQR, box), median (thick horizontal line), minimum (lower limit of vertical line), the third quartile + 1.5 × IQR (upper limit of vertical line), and outliers (gray circles). Solid black triangles along the bottom indicate significant increase (years 3,4) or decrease (year 5) in daily unique humpback whale IDs relative to the previous year (p < 0.05; one-sided Wilcoxon rank sum tests). Scientific visual survey data in the Monterey Bay region during summer-fall of years 3 and 5 (Fig 5) show the number of unique individuals encountered per day (white diamonds) and per 50 km of survey track (white circles). (c) Forage species abundances off central California [79] represent spring-summer forage conditions leading into the start of each annual song period (Fig 6a). Years 3 and 5 are highlighted because of their strongly contrasting relative abundances of krill versus forage fish, which are considered with regard to acoustic and visual detection of humpback whales (Figs 7a, 7b, 8) and dietary inference from stable isotope analysis of biopsy samples (Fig 9).\nHumpback whale photo ID data allowed consideration of local population abundance, site fidelity and migration timing as potential factors in acoustic detection. The metric for local population abundance indicated significant interannual increases in two sequential year-to-year comparisons: years 2–3 and 3–4 (Fig 7b), consistent with increasing acoustic detection (Fig 7a). This visual metric subsequently decreased between years 4 and 5 and did not change between years 5 and 6 (Fig 7b), inconsistent with continuing increases in acoustic detection of song and its daytime proportion (Fig 7a). The metric for site fidelity showed a significant increase in one year-to-year comparison, between years 2 and 3 (p < 0.01). In all other comparisons, p-values for Wilcoxon rank sum tests exceeded 0.45 regardless of the screening of individuals included in the analysis (based on a minimum number of days of identification within each year).\nThe metric for migration timing indicated that interannual variation in the months during which humpback whales maintain substantial levels of presence within Monterey Bay depends more upon the timing of the northward migration into local foraging habitat in spring than the timing of the southward migration out of local foraging habitat in winter. A key reference point is the month during which median UID/day reached an annual minimum, presumably representing when the largest proportion of the regional population was away from foraging habitat due to the breeding migration; this month was February in all years. Considering the winter migration period, monthly median values of the daily metric fell and remained below the threshold of 4 UID/day in December of all years, except year 2 when this transition occurred one month later. Considering the spring migration period, monthly median values of the daily metric rose and remained above the threshold of 4 UID/day beginning within the 3-month period of March through May in the following sequence for years 1–6: April, May, March, March, April, May. This interannual variation exhibited no trend toward earlier return to foraging habitat in a way that could have determined the positive trend in acoustic detection. Taken together, these metrics of migration timing can quantify the number of months within each year that median UID/day was above the 33rd percentile threshold: 8, 8, 11, 9, 9, and 7 months, respectively. Increased duration of UID/day above the threshold is indicated for only one year-to-year comparison: years 2–3. Further, the year with the fewest months of sightings above the threshold, year 6, had the highest level of song detection (Fig 7a).\nForaging ecology\nLarge interannual variations in forage species abundance and composition are indicated by annual spring-summer sampling off central California during the study period. During the first three years, abundance indices of forage fish (anchovy and sardine) were persistently low while krill stocks steadily increased from negative, to near-neutral, to positive anomalies (Fig 7c). This trend in krill abundance paralleled increases in biologically effective upwelling (Fig 1c) and primary productivity during regional emergence from a multi-year marine heatwave [29]. All three whale species consume krill, and song detection for all three whale species increased during these years. During the latter three years of the study period, krill abundance transitioned to strongly negative anomalies while at least one forage fish species exhibited strong positive anomalies (Fig 7c). Of these two fish species, anchovy populations were much more abundant in absolute terms, and positive anomalies in their abundance persisted throughout all three years. During this period humpback whales uniquely showed a continuing positive trend in both song detection and the proportion of daytime song (Fig 7a). In contrast, blue and fin whales showed decreases in song detection in two of three interannual comparisons.\nYears 3 and 5 show particularly strong contrasts that are considered in greater detail for humpback whales, the species for which we have the most substantial data resources. Year 5 showed significantly lower visual detection overall (Fig 7b, p < 0.01), two fewer months with UID/day above the threshold defined for migration timing, and no photo-ID evidence of increased site fidelity (p < 0.01). The decrease in visual detection is indicated by not only persistent observations concentrated within Monterey Bay – owing to the spatial footprint of ecotourism (Fig 4b, boxplot in Fig 7b), but also by scientific surveys in the broader Monterey Bay region (Fig 5, open symbols in Fig 7b). Despite these consistent visual metrics, acoustic detection increased significantly (p < 0.01) by a factor of 1.4, from 47% of days in year 3 to 66% of days in year 5 (Fig 7a). This pattern of humpback whales being seen less but heard more in year 5 versus year 3 was evident in multiple ways (Fig 8). During year 5, song was detected more during both fall (August) and spring (March–May) and with greater daily levels of intensity in most months (Fig 8a, 8b), in strong contrast to persistently lower levels of visual detection (Fig 8c). The greatest divergence between detection methods occurred during March–May, when acoustic detection increased from 6% of days in year 3 to 75% of days in year 5 (Fig 8a) while visual detection decreased significantly (Fig 8c, p < 0.01). SST < 12.5 °C was not observed within the study region during March–May of year 5, a condition indicative of habitat compression [76,86]. This would tend to shift humpback whale foraging habitat toward the coast, which in turn would presumably elevate sightings within the bay where our photo-ID data are concentrated (Fig 4). However we observed the opposite, lower levels of sighting in the bay during the habitat compression of year 5. Thus the potential role of habitat compression on the divergence of visual and acoustic detection metrics is not supported.\nComparison of acoustic and visual metrics of humpback whale detection during years of contrasting forage species composition and abundance (Fig 7c), years 3 and 5. The acoustic summaries (a, b) were derived from the data shown in Fig 6a; the visual summary (c) was derived from the data shown in Fig 4. (d) Average regional sea surface temperature (SST) for March through May of years 3 and 5, from satellite remote sensing; the gray contour is the 12.5°C isotherm. The black transect line represents the vertical section along which acoustic transmission loss was modeled. (e) March–May average HYCOM SST along the transect shown in (d). (f) Boxplot of acoustic transmission loss between a humpback whale calling at 20 m depth along the transect shown in (d) and the MARS observatory. (g) Boxplot of hourly wind speeds measured at NDBC Station 46042 (location shown by the diamond in (d)). Boxplots (b,c,f,g) show the interquartile range (IQR, box), median (thick horizontal line), minimum (lower limit of vertical line), and third quartile + 1.5 × IQR (upper limit of vertical line).\nThe HYCOM model accurately represented interannual changes in springtime SST distributions (Fig 8d, 8e), however modeling of acoustic transmission loss showed no significant interannual difference (Fig 8f). Observed wind speeds during these two spring periods also showed no significant difference (Fig 8g). The inability to explain increased acoustic detection during year 5 based on physical factors (propagation, masking) or independent visual metrics (local abundance, site fidelity or migration timing) motivates consideration of changes in the acoustic behavior of humpback whales, which may follow from large changes in foraging ecology (Fig 7c).\nIsotopic signatures measured from whale biopsy samples inform understanding of their foraging ecology. Overall, observed differences between blue and humpback whales are consistent with species-dependent differences in diet. Blue whale isotopic signatures exhibited lower δ15N and δ13C compared to humpback whales (Fig 9a, Table 1), reflective of the strict krill-based diet of blue whales compared to the krill and fish diet of humpback whales. Interannual changes in isotopic signatures followed variations in forage species. Widening of the blue whale isotopic niche between years 3 and 5 (Fig 9a) suggests foraging over a relatively larger region when krill abundances were low in year 5 (Fig 7c), as δ13C varies across geographic gradients [89,90]. Slight overlap between isotopic niches of blue and humpback whales during year 3 (Fig 9a, 95% ellipses show 3% overlap of the total isotopic space) mirrored direct spatiotemporal overlap of sampled animals. Proximity of humpback and blue whales sampled in the outer bay during year 3 was close both spatially (Fig 9a) and temporally (humpback whales were sampled on 15 August; blue whales were sampled during 13–16 August). The wider isotopic niche of humpback whales in year 3 versus year 5 (Fig 9a) is consistent with foraging on both krill and fish when + krill | –fish anomalies were observed (Fig 7c). Visual observations in year 3 showed that humpback whales were foraging on fish where they were sampled within inner Monterey Bay, and on krill where they were sampled in the outer bay near blue whales (Fig 9a, Table 2). The much narrower isotopic niche indicated for humpback whales in year 5 (Fig 9a) is consistent with a fish dominated diet when –krill | + fish anomalies were observed (Fig 7c). Of the year-5 biopsy samples, three were from the same individual – Fran (Fig 4a). Sampled across 74 days in year 5, Fran (CRD-ID 12049 in Fig 9b) exhibited a stable isotopic composition indicating a fish-dominated diet (Fig 9a).\n(a) 40% and 95% ellipses of the δ13C and δ15N data represent isotopic niches of blue and humpback whales sampled in year 3 (fall 2017) and year 5 (fall 2019). Adjacent maps show the locations of sampled whales, five samples from each species in each year; darker symbols indicate overlapping location markers. (b) Local sighting histories of humpback whales sampled for biopsy during study years 3 and 5 (Table 2).\nContinuous echosounder data from the final two years of this study reveal changes in prey that are particularly relevant to humpback whales. This echosounder is more sensitive to fish than krill, and the dominant forage fish, anchovy, were abundant during both years (Fig 7c). The echosounder data show increased daily total scattering in the upper 200 m (1.7× median difference), indicating increased total prey abundance. They also show increased total scattering in aggregations (4.4× median difference), representing increased occurrence of dense prey patches. Aggregative swarming of krill and forage fish in response to strengthening of coastal upwelling has been documented in this region [85]. Swarming that increases prey density within patches can, in turn, increase the efficiency of trophic transfer between prey and the predators that consume them. The intensification of upwelling between years 5 and 6 (Fig 1c) thus indicates that changes in forage species behavior (aggregation), not just abundance and composition, may have been influential across these years in which acoustic detection of humpback whales increased significantly (Fig 7a, p < 0.01) without a change in visual detection (Fig 7b, p < 0.01).\nDiscussion\nConsidering the vast oceanic areas inhabited by mysticetes and the efficient transmission of sound in the sea, passive acoustic monitoring is naturally an effective tool for detecting Earth’s largest soniferous animals. Baleen whale song is a prevalent acoustic behavior off central California, detectable during any month of the year for at least one of the three species examined in this study – blue, fin, and humpback. The prevalence of song makes this particular acoustic behavior an effective focus of biological remote sensing. However, understanding the complex ecology that underlies the presence and behavior of whales is challenging and requires integration of diverse methods of sensing the animals and their dynamic ecosystem. The Monterey Bay region is an important foraging habitat for mysticetes that inhabit the eastern North Pacific [10,91], and previous studies in the Monterey Bay region have shown how passive acoustic monitoring can reveal underlying influences of foraging ecology on the acoustic behavior and acoustic detection of baleen whale species. These studies have examined the role of krill aggregation dynamics in the foraging strategies and movement ecology of blue whales [48,92,93], the consequences of large interannual changes in productivity and foraging ecology for the timing of blue whale migration [19,49], and the behavioral ecology of humpback whales amid extreme ecosystem variations [29]. In the present study we applied interdisciplinary observations to expand, temporally and taxonomically, examination of the behavioral ecology of three sympatric mysticete species with overlapping niches in regional foraging ecology.\nSeasonal patterns\nSong detection in all three whale species begins annually during the late summer/ early fall (Fig 6). The rise of humpback whale song detection beginning in August follows high levels of visual detection during April–July, indicating that the annual rise of song represents emergence of this acoustic behavior from an actively foraging population (Fig 6b). Blue whales are also present in the CCE during summer, acoustically detected by their foraging-associated D calls typically by May in the Southern California Bight [34] and the Monterey Bay region [68]. The rise of song in blue whales during July thus similarly suggests a change in acoustic behavior, specifically males beginning to sing. However, visual data indicate primary months of blue whale sighting in the Monterey Bay region during July through October [32,91], and the rise of blue whale song in July may be influenced by both increased local population abundance and seasonal change in acoustic behavior. Fin whale sighting data off central California is limited, however a five-year study within a large region off southern California showed that fin whales were visually detected frequently beginning in July, similar to blue whales [94]. In this context, the emergence of fin whale song during August in the Southern California Bight [37] and central CCE (this study) may similarly be driven by change in acoustic behavior and not simply increased local abundance.\nConsistent with a life history strategy of capital breeding, the annual winter decline of song detection in this foraging habitat reflects migration to distant low-latitude breeding habitat [19,33,38,39,49]. While blue and fin whales show a single decline in acoustic detection of song each year, humpback whales uniquely exhibit a bimodal pattern with secondary peaks in song detection during spring (March–May) that are lower than the fall peak and variable from year to year with regard to occurrence, timing, duration, and intensity (Fig 6a). Humpback visual sightings consistently reached their annual minimum in February of every year in the study period, and we speculate that these variable secondary peaks in song detection during March–May represent whales returning to foraging habitat in the spring, continuing their singing behavior that peaks in the breeding season. This interpretation is consistent with continual singing of humpback whales into late spring that has been documented for foraging habitat in the northwest Atlantic [95] as well as singing during migration from breeding to foraging habitat in the eastern North Pacific [61].\nThe longer annual duration of song detection from fin (10 months) and humpback (11 months) whales (Fig 6b) compared to blue whales (8 months) is consistent with visual sighting data off southern California, which showed absence of blue whales in winter and spring, in contrast to humpback sightings in spring through fall and year-round sightings of fin whales [94]. More persistent acoustic detection of fin whales compared to blue whales has been observed in the northeast Pacific [96] and associated with year-round presence in the Southern California Bight [36,37]. Regardless of these differences, all three species demonstrate prevalent and persistent singing in foraging habitat, and this prevalence enables accurate detection of song to be an effective data resource for ecological research in foraging habitat.\nInterannual patterns\nInterannual variability in song detection during the study period was large, varying by factors of 2.2 (humpback), 1.6 (blue) and 1.9 (fin). The primary difference across species was multifaceted distinction of humpback whales, which showed the largest range in song detection, the only continuously positive trend in song detection, and the only positive trend in the proportion of song occurring during the day. The primary similarity across species was increased song detection during the first three years, rising out of the first-year minimum. Acoustic recording began near the peak of a multi-year marine heatwave [20,97], which was associated with low levels of primary productivity and major food web consequences [21,24,29]. Beyond changes is trophic energy transfer, high levels of food web toxicity during an extreme harmful algal bloom (HAB) in the northeastern Pacific during 2015 caused the most widespread poisoning of marine mammals ever documented, including whales [22]. As observed in our study region, this HAB and its underlying physical, chemical and biological anomalies were extreme [23].\nInitiation of this time series during the height of extremely anomalous ecosystem conditions suggests that the common rise of song among all three whale species during years 1–3 represents recovery from exceptional conditions to more typical conditions. Key ecosystem factors considered in a prior study examining only humpback whale song were increases in primary productivity and krill abundance, in parallel with decreases in food web toxicity driven by phytoplankton ecology [29]. In this context, one discovery of the present study – that acoustic detection of blue and fin whales increased in parallel with that of humpback whales during three years of emergence from a heatwave – is consistent with ecosystem-wide impacts of this major environmental perturbation. Marine heatwave influence on the acoustic behavior of blue whales has been inferred from PAM and environmental observations in the South Taranaki Bight region of Aotearoa New Zealand, where whales exhibited reduced foraging and reproductive effort during a heatwave [30].\nPossible factors influencing interannual variation in acoustic detection at a fixed location are diverse and may be interrelated. These factors include local population abundance, local site fidelity, duration of annual residence in foraging habitat (migration timing), proximity of calling whales to the acoustic receiver, demographic composition of the local population (proportion that are mature males), acoustic behavior of mature male whales, and the extent of attenuation or masking by environmental conditions. Data resources, and hence the ability to examine hypotheses about causal factors, differ among the whale species in this study. We consider each of these species in turn, starting with the species for which we have the greatest data resources – humpback whales.\nHumpback whales.\nThe relatively greater potential to consider factors driving interannual variations in humpback whale song detection is largely due to extensive photo ID data that were uniquely available for this species from the full study period. These data leverage extensive sampling from ecotourism and research activities and were acquired from within MARS’ acoustic detection range [29]. The data do not comprehensively define age and sex of all identified whales, as would be required to estimate abundance of the local adult male population that presumably would be the primary source of song signal [43]. However, knowledge of individual identity from photo ID enables quantification of the number of unique individuals and how this metric changes through time. Compared to simply the number of sightings of a species, the ID-based metric more accurately represents local animal abundance and is more directly comparable to acoustic detection. This photo ID data informed examination of three potential factors for all sequential year-to-year changes in song detection: local population abundance, site fidelity, and migration timing (Table 3).\nThe potential influences of local site fidelity or migration timing on the continuous positive trend in humpback whale song detection are indicated to be minimal. There was only one interannual increase in the metrics representing these factors, years 2–3 (Table 3). The potential influence of local population abundance on the continuous positive trend in humpback whale song (Fig 7a) is supported to a moderate extent, for two of the five sequential interannual comparisons: years 2–3 and 3–4 (Table 3, Fig 7b). However, comparison of visual and acoustic detection metrics also illustrates how they can diverge significantly. The large increase in acoustic detection across the focal comparison of year 3 versus year 5 coincided with decreases in local visual detection metrics derived from both the greater aggregated photo-ID dataset and regional scientific surveys (Fig 7a, 7b). Throughout the annual cycle of song occurrence in these years, humpback whales were persistently heard more but seen less during year 5 (Fig 8a–8c), and the period when these metrics were most divergent across years was during the spring (March–May). Despite habitat compression that was evident during year 5 (Fig 8d), which would cause humpback whales to forage closer to the coast [76,86] and could have elevated sighting levels in the bay (Fig 4), we observed the opposite – lower sighting levels during year 5 (Figs 7b, 8c). Therefore, comparison of acoustic and visual detection metrics (Fig 8a–8c) was unlikely to have been biased by environmental forcing of habitat compression. Instead, the degree to which humpback whales were seen less but heard more during year 5 may be underestimated in this comparison. Also for this focal comparison of years 3 and 5, we found no indication of influence from changes in acoustic propagation or masking by wind noise (Fig 8f, 8g). This integrative examination thus points to considering changes in acoustic behavior. Foraging is the most essential life activity in this habitat, and changes in foraging ecology have diverse consequences for whale behavior.\nChanges in foraging efficiency, driven by major changes in forage species populations, may influence prey search effort, habitat occupancy, health, energy storage on short to cumulative long-term time scales, and allocation of time to different behaviors. Changes in acoustic behavior can be indicated by divergence of acoustic and visual detection metrics, and such divergence was evident in three of the five sequential year-to-year changes: years 1–2, 4–5, and 5–6 (Fig 7a, 7b). Increases in acoustic detection relative to visual detection may indicate increased time allocation to singing behavior. Variability in forage species abundance and composition in the central CCE was consistent with increasing foraging efficiency and potential consequences for acoustic behavior across all sequential year-to-year comparisons (Table 3). Increases in krill abundance during the first three years may have increased foraging efficiency amid persistent negative anomalies in forage fish abundance (Fig 7c). Increases in forage fish abundance and aggregation during the latter three years may have increased foraging efficiency for humpback whales particularly, because they are known to readily switch between available prey [26], and a fish-dominated diet would presumably be more energy rich. Measured wet caloric densities of prey sampled in the study region were 2–3 times greater for anchovies and sardines compared to krill [98]. Measurements of forage species sampled in the California Current Ecosystem have shown that Northern anchovy (Engraulis mordax) is the most energy dense and nearly twice that of the dominant krill species, Euphausia pacifica and Thysanoessa spinifera [99].\nA shift toward a more fish-dominated diet in local humpback whales is indicated by the isotopic compositions of biopsy samples across the strongly contrasting years of forage abundance and composition: year 3 versus year 5 (Fig 9). Further, an individual sampled three times across 74 days of the foraging season in year 5 exhibited isotopic compositions indicative of a strongly and persistently fish-dominated diet (Fig 9, CRC-ID 12049), suggestive of preference for fish when forage abundance anomalies were –krill | + fish. The single largest increase in humpback whale acoustic detection, by a factor of 1.35, occurred between years 3 and 4. Although increased local population abundance may partially explain this increase (Fig 7b, Table 3), this was the only interannual change involving coincident occurrence of positive anomalies in the abundance of krill and both forage fish species. Humpback whales would presumably benefit uniquely from this scenario, as they can readily consume all of these prey.\nUnique data resources for the final two years of the study period allow further consideration of the potential influence of foraging efficiency on humpback whale behavior and acoustic detection. Active acoustic sensing showed that increases in the local abundance (1.7×) and aggregation (4.4×) of forage fish, both of which would presumably enhance foraging efficiency, coincided with large increases in humpback whale song detection and its daytime proportion (Fig 7a). This occurred despite no indications from visual detection of increased humpback whale local population abundance, site fidelity, or persistence in foraging habitat between migration periods (Table 3). A physical basis for greater abundance and aggregation of forage fish is evident in the regional upwelling index, which increased significantly between these years (Fig 1c). While enhanced primary productivity from greater upwelling nutrient supply may support a larger population of forage fish, behavioral response of forage fish to upwelling – forming dense aggregations [85] – may increase the efficiency of prey capture and energy gain by whales.\nThe uniquely increasing proportion of song detection during the day for humpback whales, nearly doubling over the six-year period, was driven by two large interannual changes: between years 2 and 3 and years 5 and 6 (Fig 7a). Unlike the primary annual acoustic metric that emphasizes prevalence of detection within a year, the day:night metric indicates changes in diel patterns of acoustic behavior. An increased proportion of song detection during the day could represent changes in time allocation to primary behaviors, with more efficient daily foraging effort allowing more daily time allocation to singing behavior. The depths at which humpback whales lunge feed in the study region, measured using animal-borne tags, show a dominant peak deeper than 100 m [82]. This is consistent with the diel vertical migration of krill and other prey species that reside at depth during the day to avoid visual predators and thus is consistent with extensive foraging effort by humpback whales at depth during the day. The apparent importance of daytime foraging makes an increasing proportion of song detection during the day meaningful with regard to humpback whale behavioral ecology and relationships between foraging and singing behaviors.\nEnhancement of foraging efficiency and energy storage, particularly early in the foraging season before singing behavior begins, may cumulatively increase the potential for time and energy allocation to song after this behavior emerges. This hypothesis can be most carefully considered for the interannual comparison having the greatest data resources: years 5 and 6. Increases in forage fish abundance and aggregation between years 5 and 6, detected from nearly continuous active acoustic sensing, are consistent with this hypothesis. Proportionally greater detection of song during the day may follow proportionally lesser foraging effort during the day. Evidence of seasonally diminishing daytime foraging rates has been found using deployment of biologging tags on humpback whales along the Western Antarctic Peninsula [100]. This study showed a seasonal progression toward feeding less often, at lower rates, and at deeper depths. These changes were interpreted to result from intensive foraging required to meet energetic needs when first transitioning from fasting to foraging, and from seasonal changes in krill availability as prey depth increases seasonally, however the potential role of intrinsic factors like satiation were considered.\nOver longer time scales, fish-rich years may also allow whales to accumulate greater energy stores that support their long-distance breeding migration. In this context, greater secondary spring peaks in song detection during fish-enriched years in the CCE could reflect relatively greater energy stores, such that adult male whales returning from breeding habitat had healthier body conditions and more energy available for a full behavioral spectrum. Viewed from the other end of the range of environmental conditions, extremely poor foraging conditions – as observed early in our study period – would demand much greater foraging effort. This, in turn, would likely reduce energy gain, energy storage, and energy and time dedicated to behaviors other than foraging. Multiple hypotheses were considered with regard to the causality of large decreases in detection of humpback whale song within breeding habitat around Hawaii during a period when a marine heatwave strongly affected their foraging habitat in the northeastern Pacific [51]. These include decreased population size, shifts in the distribution of the population, altered migration patterns, and behavioral changes in (singing) males. Our study began during the same marine heatwave, and our observations within foraging habitat of the northeastern Pacific substantially support the role of changes in the behavior of male humpback whales.\nBlue whales.\nInterannual variation in blue whale song spanned a smaller range than that of fin and humpback whales (Fig 7a), consistent with their shorter annual period of song detection (Fig 6b). Within the full study period the greatest increase in annual blue whale song detection occurred between years 2 and 3 (Fig 7a). This largest increase occurred in the year marked by the greatest and most persistent elevation of daily CI (Fig 6a, year 3). These patterns suggest relatively high local population abundance and site fidelity, and this interpretation is supported by observations of dense aggregations of foraging blue whales within the study area during year 3 [92,93]. Potential influence of the timing of blue whale migration is suggested by results of a prior study for the same period, which showed interannual differences of up to four months in the timing of blue whale southward migration [19]. During the first three years, blue whale migration from local foraging habitat to breeding habitat occurred later each year, consistent with our finding that blue whale acoustic detection in local foraging habitat trended upward during these years (Fig 7a). However, during the subsequent three years, southward migration by blue whales occurred later in the year than during all of the first three years [19], inconsistent with decreases in blue whale acoustic detection during two of the three years (Fig 7a). Migration timing is thus not consistently supported in explaining interannual variation in acoustic detection of blue whales.\nThe role of changes in foraging ecology, and its potential modulation of whale acoustic behavior, is indicated by regional forage species data and stable isotope data from blue whale biopsy samples. As for both other whale species, the rise in blue whale song detection during the first three years paralleled emergence from the marine heatwave and recovery of krill populations. Consistent with being obligate krill predators, unlike humpback whales, blue whales exhibited a somewhat closer coupling to the interannual variations in krill abundance. The initial peak in song occurrence coincided with the initial peak in krill abundance during year 3, and a minimum in song occurrence during the remainder of the time series coincided with the return of strongly negative anomalies in krill abundance during year 5 (Fig 7a, 7c). The comparison of years 3 and 5 shows the largest difference in krill abundances, from the highest level of the study period during year 3 to the lowest during year 5 (Fig 7c). The parallel decrease in blue whale song detection may simply reflect lower local whale population abundance during the krill-impoverished year. However, isotopic compositions of blue whale biopsy samples were consistent with interannual changes in foraging ecology that could affect the behavioral spectrum of blue whales. Specifically, the broader range of variation in δ13C during year 5 (Fig 9a) is consistent with foraging over a relatively larger geographic domain when krill abundances were low, as δ13C varies across geographic gradients [89,90], and it coincided with lower levels of local acoustic detection. If relatively unfavorable foraging conditions in year 5 required blue whales to forage over larger spatial scales, this could have reduced acoustic detection in at least two ways: (1) more time and energy allocated to prey search could have made less time and energy available for singing behavior, and/or (2) more ephemeral habitat occupancy could have reduced the total time that whales were within the range of acoustic detection from the fixed monitoring location.\nFin whales.\nThe dominant interannual pattern of fin whale song detection was a steep rise, from 38% to 70% of days, during the first three years. Subsequently, the level of detection varied by less than 10% around the level reached in year 3. This dominant acoustic signal during the first three years is consistent with the dominant environmental variation of the study period, emergence from a marine heatwave (Fig 1c). Emergence from the heatwave was accompanied by recovery of krill populations from strongly negative anomalies to strongly positive anomalies (Fig 7c). Increased regional abundances of krill, a primary prey resource of fin whales [35], could have influenced acoustic detection through any of the factors listed at the start of the Discussion section, however none of these factors can be examined from available data resources.\nTrophic niches and evolutionary considerations\nComparison of blue and humpback whale trophic niche characteristics across a major food web transition indicate unique adaptations of these predators to interannual variations, as well as consideration of evolutionary pressures shaping their behavioral ecology. In year 3 humpback whales had a broader trophic niche that partially overlapped with krill-specialist blue whales (Fig 9a). The humpback whales observed to be foraging on krill in year 3 were sampled in close proximity to blue whales that aggregated in exceptionally dense groups at a krill foraging hotspot [92,93]. In year 5 humpback whales had a narrow trophic niche that did not overlap with blue whales, despite the fact that the blue whale isotopic niche area expanded between these years (Fig 9a). These changes in trophic niche overlap emphasize the advantage of prey switching [26], which allows humpback whales to more readily adapt to changes in the abundance and composition of forage species. Responding only to changes in the abundance and distribution of krill, blue whales can adapt to major interannual changes only through prey search effort, not prey switching. In this regard the potential for blue whales to increase efficiency through social foraging, using acoustic communication in collective regional prey searching [93], may represent an essential strategy and an evolutionary adaptation accompanying prey specialization. The efficacy of long-distance acoustic communication interpreted for blue whale social foraging may also represent an evolutionary opportunity for humpback whales, if they can recognize heightened foraging call activity of blue whales and respond to take advantage of ephemeral krill hotspots identified and acoustically signaled by a sympatric mysticete species. Because humpback whales produce sounds in the frequency range of blue whale foraging calls, it is probable that they could hear such heightened call activity from blue whales.\nEnergetic variations in ecosystem state\nInterannual variations in forage stocks strongly depend on large-scale, highly energetic ocean climatic fluctuations [16,26,77]. Very large interannual variations in forage species occurred during our study period (Fig 7c). Longer records from the central CCE, spanning 23 years, show that krill reached their lowest abundances during year 4 of our study while anchovy rose to their highest abundances during years 4–6 [79]. Such large variations in forage species abundance and composition would naturally affect the behavioral ecology of whales within this essential foraging habitat of the northeastern Pacific. Yet understanding the complex behavioral ecology of such far-ranging predators is difficult, and the powerful propagation of sound produced by highly soniferous species confers a distinct advantage to the use of passive acoustic monitoring. We considered multiple hypotheses to explain the large interannual variations in acoustic detection by integrating diverse methods of sensing whales and their ecosystem. This data intensive effort identifies the consequences of foraging ecology as a significant and persistent driver of interannual variations in the acoustic detection of these whale species. Recognition of this complex relationship, in turn, has important implications for how we interpret passive acoustic monitoring data for scientific and management purposes.\nAcknowledgments\nPassive acoustic monitoring through the MARS cabled observatory was made possible by Craig Dawe, David French, Paul McGill, Knute Brekke, Bryan Touryan-Schaefer and the crew of the R/V Rachel Carson. We thank the 491 researchers, naturalists and citizen scientists who contributed photographs of humpback whales to the Happywhale database used in this study, especially Monterey Bay Whale Watch, Blue Ocean Whale Watch and Marine Life Studies, whose contributors have been extensive and sustained. Biopsy sampling and scientific surveys by Cascadia Research Collective were conducted under scientific research permit 21678 issued to John Calambokidis. Kiirsten Flynn and others assisted in the scientific surveys and collections for Cascadia Research Collective and Kiirsten Flynn, Jessie Huggins, Alex Vanderzee, Elana Dobson and others conducted data and photo processing. Kelly Robertson and Alaina Harmon of Southwest Fisheries Science Center supported sample preparation for stable isotope analyses; Jason Curtis of the University of Florida Gainesville Stable Isotope Lab analyzed these samples. Silhouettes of primary forage species in Fig 9a were acquired and plotted using the R package rphylopic [101], using images contributed by Steven Haddock (krill) and Juan Jeri Vidal (anchovy).\nReferences\n- 1. Polovina JJ, Howell EA. Ecosystem indicators derived from satellite remotely sensed oceanographic data for the North Pacific. ICES J Mar Sci. 2005;62(3):319–27.\n- 2. Paduan JD, Washburn L. High-Frequency radar observations of ocean surface currents. Annu Rev Mar Sci. 2013;5:115–36.\n- 3. Chai F, Johnson KS, Claustre H, Xing X, Wang Y, Boss E, et al. Monitoring ocean biogeochemistry with autonomous platforms. Nat Rev Earth Environ. 2020;1(6):315–26.\n- 4. Benoit‐Bird KJ, Patrick Welch T, Waluk CM, Barth JA, Wangen I, McGill P, et al. Equipping an underwater glider with a new echosounder to explore ocean ecosystems. Limnol Oceanogr Methods. 2018;16(11):734–49.\n- 5. Zhang Y, Ryan JP, Hobson BW, Kieft B, Romano A, Barone B, et al. A system of coordinated autonomous robots for Lagrangian studies of microbes in the oceanic deep chlorophyll maximum. Sci Robot. 2021;6(50):eabb9138. pmid:34043577\n- 6. Johnston DW. Unoccupied aircraft systems in marine science and conservation. Annu Rev Mar Sci. 2019;11:439–63.\n- 7.\nAu WWL, Hastings MC. Principles of marine bioacoustics. New York: Springer; 2008.\n- 8. Oestreich WK, Oliver RY, Chapman MS, Go MC, McKenna MF. Listening to animal behavior to understand changing ecosystems. Trends Ecol Evol. 2024;39(10):961–73. pmid:38972787\n- 9. Goldbogen JA, Cade DE, Wisniewska DM, Potvin J, Segre PS, Savoca MS, et al. Why whales are big but not bigger: Physiological drivers and ecological limits in the age of ocean giants. Science. 2019;366(6471):1367–72. pmid:31831666\n- 10. Calambokidis J, Kratofil MA, Palacios DM, Lagerquist BA, Schorr GS, Hanson MB, et al. Biologically important areas II for cetaceans within U.S. and adjacent waters - West Coast Region. Front Mar Sci. 2024;11:1283231.\n- 11. Huyer A. Coastal upwelling in the California current system. Prog Oceanogr. 1983;12(3):259–84.\n- 12. Timothy Pennington J, Chavez FP. Seasonal fluctuations of temperature, salinity, nitrate, chlorophyll and primary production at station H3/M1 over 1989–1996 in Monterey Bay, California. Deep Sea Res Part II Top Stud Oceanogr. 2000;47(5-6):947–73.\n- 13. Szoboszlai AI, Thayer JA, Wood SA, Sydeman WJ, Koehn LE. Forage species in predator diets: Synthesis of data from the California Current. Ecol Inf. 2015;29:45–56.\n- 14. Bograd SJ, Schroeder I, Sarkar N, Qiu X, Sydeman WJ, Schwing FB. Phenology of coastal upwelling in the California Current. Geophys Res Lett. 2009;36(1):2008GL035933.\n- 15. Chavez FP, Ryan J, Lluch-Cota SE, Ñiquen CM. From anchovies to sardines and back: Multidecadal change in the Pacific Ocean. Science. 2003;299:217–21.\n- 16. Santora J, Hazen E, Schroeder I, Bograd S, Sakuma K, Field J. Impacts of ocean climate variability on biodiversity of pelagic forage species in an upwelling ecosystem. Mar Ecol Prog Ser. 2017;580:205–20.\n- 17. Jacox MG, Edwards CA, Hazen EL, Bograd SJ. Coastal upwelling revisited: Ekman, Bakun, and improved upwelling indices for the U.S. West Coast. J Geophys Res Oceans. 2018;123(10):7332–50.\n- 18. Thompson AR, Harvey CJ, Sydeman WJ, Barceló C, Bograd SJ, Brodeur RD, et al. Indicators of pelagic forage community shifts in the California Current Large Marine Ecosystem, 1998–2016. Ecol Indic. 2019;105:215–28.\n- 19. Oestreich WK, Abrahms B, McKenna MF, Goldbogen JA, Crowder LB, Ryan JP. Acoustic signature reveals blue whales tune life‐history transitions to oceanographic conditions. Funct Ecol. 2022;36(4):882–95.\n- 20. Di Lorenzo E, Mantua N. Multi-year persistence of the 2014/15 North Pacific marine heatwave. Nat Clim Change. 2016;6(11):1042–7.\n- 21. Cavole L, Demko A, Diner R, Giddings A, Koester I, Pagniello C, et al. Biological impacts of the 2013–2015 warm-water anomaly in the Northeast Pacific: winners, losers, and the future. Oceanography. 2016;29:273–85.\n- 22. McCabe RM, Hickey BM, Kudela RM, Lefebvre KA, Adams NG, Bill BD, et al. An unprecedented coastwide toxic algal bloom linked to anomalous ocean conditions. Geophys Res Lett. 2016;43(19):10366–76. pmid:27917011\n- 23. Ryan JP, Kudela RM, Birch JM, Blum M, Bowers HA, Chavez FP, et al. Causality of an extreme harmful algal bloom in Monterey Bay, California, during the 2014–2016 northeast Pacific warm anomaly. Geophys Res Lett. 2017;44(11):5571–9.\n- 24. Sanford E, Sones JL, García-Reyes M, Goddard JHR, Largier JL. Widespread shifts in the coastal biota of northern California during the 2014–2016 marine heatwaves. Sci Rep. 2019;9(1):4216. pmid:30862867\n- 25. Santora JA, Schroeder ID, Field JC, Wells BK, Sydeman WJ. Spatio‐temporal dynamics of ocean conditions and forage taxa reveal regional structuring of seabird–prey relationships. Ecol Appl. 2014;24(7):1730–47. pmid:29210234\n- 26. Fleming AH, Clark CT, Calambokidis J, Barlow J. Humpback whale diets respond to variance in ocean climate and ecosystem conditions in the California Current. Glob Change Biol. 2016;22:1214–24.\n- 27. Hazen EL, Abrahms B, Brodie S, Carroll G, Jacox MG, Savoca MS, et al. Marine top predators as climate and ecosystem sentinels. Front Ecol Environ. 2019;17(10):565–74.\n- 28. Piatt JF, Parrish JK, Renner HM, Schoen SK, Jones TT, Arimitsu ML, et al. Extreme mortality and reproductive failure of common murres resulting from the northeast Pacific marine heatwave of 2014-2016. Hyrenbach D, editor. PLoS One. 2020;15(1):e0226087. pmid:31940310\n- 29. Ryan JP, Cline DE, Joseph JE, Margolina T, Santora JA, Kudela RM, et al. Humpback whale song occurrence reflects ecosystem variability in feeding and migratory habitat of the northeast Pacific. Ummenhofer C, editor. PLoS One. 2019;14(9):e0222456. pmid:31525231\n- 30. Barlow DR, Klinck H, Ponirakis D, Branch TA, Torres LG. Environmental conditions and marine heatwaves influence blue whale foraging and reproductive effort. Ecol Evol. 2023;13(2):e9770. pmid:36861024\n- 31. Rosenfeld LK, Schwing FB, Garfield N, Tracy DE. Bifurcated flow from an upwelling center: a cold water source for Monterey Bay. Cont Shelf Res. 1994;14(9):931–64.\n- 32. Croll D, Marinovic B, Benson S, Chavez F, Black N, Ternullo R, et al. From wind to whales: trophic links in a coastal upwelling system. Mar Ecol Prog Ser. 2005;289:117–30.\n- 33. Bailey H, Mate B, Palacios D, Irvine L, Bograd S, Costa D. Behavioural estimation of blue whale movements in the Northeast Pacific from state-space model analysis of satellite tracks. Endanger Spec Res. 2009;10:93–106.\n- 34. Szesciorka AR, Ballance LT, Širović A, Rice A, Ohman MD, Hildebrand JA, et al. Timing is everything: Drivers of interannual variability in blue whale migration. Sci Rep. 2020;10(1):7710. pmid:32382054\n- 35. Flinn RD, Trites AW, Gregr EJ, Perry RI. Diets of fin, sei, and sperm whales in British Columbia: an analysis of commercial whaling records, 1963–1967. Mar Mamm Sci. 2002;18(3):663–79.\n- 36. Scales KL, Schorr GS, Hazen EL, Bograd SJ, Miller PI, Andrews RD, et al. Should I stay or should I go? Modelling year‐round habitat suitability and drivers of residency for fin whales in the California Current. VanDerWal J, editor. Divers Distrib. 2017;23(10):1204–15.\n- 37. Širovic A, Rice A, Chou E, Hildebrand J, Wiggins S, Roch M. Seven years of blue and fin whale call abundance in the Southern California Bight. Endanger Spec Res. 2015;28(1):61–76.\n- 38. Calambokidis J, Steiger G, Rasmussen K, Urbán R, Balcomb K, Ladrón De Guevara P, et al. Migratory destinations of humpback whales that feed off California, Oregon and Washington. Mar Ecol Prog Ser. 2000;192:295–304.\n- 39. Calambokidis J, Steiger GH, Straley JM, Herman LM, Cerchio S, Salden DR, et al. Movements and population structure of humpback whales in the North Pacific. Mar Mammal Sci. 2001;17:769–94.\n- 40. Curtis KA. Abundance of humpback whales (Megaptera novaeangliae) wintering in Central America and southern Mexico from a one-dimensional spatial capture-recapture model. 2022 [cited 2024 Feb 28. ].\n- 41.\nFleming A, Jackson J. Global review of humpback whales (Megaptera novaeangliae). Southwest Fisheries Science Center (U.S.); 2011. p. 206. Report No.: NOAA-TM-NMFS-SWFSC; 474. Available from: https://repository.library.noaa.gov/view/noaa/4489\n- 42. Croll DA, Clark CW, Acevedo A, Tershy B, Flores S, Gedamke J, et al. Only male fin whales sing loud songs. Nature. 2002;417(6891):809–809. pmid:12075339\n- 43. Herman LM, Pack AA, Spitz SS, Herman EYK, Rose K, Hakala S, et al. Humpback whale song: who sings? Behav Ecol Sociobiol. 2013;67(10):1653–63.\n- 44. Oleson E, Calambokidis J, Burgess W, McDonald M, LeDuc C, Hildebrand J. Behavioral context of call production by eastern North Pacific blue whales. Mar Ecol Prog Ser. 2007;330:269–84.\n- 45. Janik VM. Whale song. Curr Biol. 2009;19(3):R109–11. pmid:19211045\n- 46. Oleson EM, Širović A, Bayless AR, Hildebrand JA. Synchronous seasonal change in fin Whale song in the North Pacific. Deng ZD, editor. PLoS One. 2014;9(12):e115678. pmid:25521493\n- 47. Simon M, Stafford KM, Beedholm K, Lee CM, Madsen PT. Singing behavior of fin whales in the Davis Strait with implications for mating, migration and foraging. J Acoust Soc Am. 2010;128(5):3200–10. pmid:21110615\n- 48. Ryan JP, Benoit‐Bird KJ, Oestreich WK, Leary P, Smith KB, Waluk CM, et al. Oceanic giants dance to atmospheric rhythms: Ephemeral wind‐driven resource tracking by blue whales. Ecology Lett. 2022;25(11):2435–47.\n- 49. Oestreich WK, Fahlbusch JA, Cade DE, Calambokidis J, Margolina T, Joseph J, et al. Animal-borne metrics enable acoustic detection of Blue Whale migration. Curr Biol. 2020;30(23):4773–9.e3. pmid:33007246\n- 50. Garland EC, Goldizen AW, Rekdahl ML, Constantine R, Garrigue C, Hauser ND, et al. Dynamic horizontal cultural transmission of Humpback Whale song at the Ocean Basin Scale. Curr Biol. 2011;21(8):687–91. pmid:21497089\n- 51. Kügler A, Lammers M, Zang E, Kaplan M, Mooney T. Fluctuations in Hawaii’s humpback whale Megaptera novaeangliae population inferred from male song chorusing off Maui. Endanger Spec Res. 2020;43:421–34.\n- 52. Lammers MO, Goodwin B, Kügler A, Zang EJ, Harvey M, Margolina T, et al. The occurrence of humpback whales across the Hawaiian archipelago revealed by fixed and mobile acoustic monitoring. Front Mar Sci. 2023;10:1083583.\n- 53. Haver SM, Rand Z, Hatch LT, Lipski D, Dziak RP, Gedamke J, et al. Seasonal trends and primary contributors to the low-frequency soundscape of the Cordell Bank National Marine Sanctuary. J Acoust Soc Am. 2020;148(2):845–58. pmid:32873009\n- 54. McKenna MF, Baumann-Pickering S, Kok ACM, Oestreich WK, Adams JD, Barkowski J, et al. Advancing the interpretation of shallow water marine soundscapes. Front Mar Sci. 2021;8:719258.\n- 55.\nRyan J, Cline D, Dawe C, McGill P, Zhang Y, Joseph J, et al. New passive acoustic monitoring in Monterey Bay National Marine Sanctuary. OCEANS 2016 MTS/IEEE Monterey. Monterey, CA, USA: IEEE; 2016. p. 1–8. https://doi.org/10.1109/OCEANS.2016.7761363\n- 56. Duarte CM, Chapuis L, Collin SP, Costa DP, Devassy RP, Eguiluz VM, et al. The soundscape of the Anthropocene ocean. Science. 2021;371(6529):eaba4658. pmid:33542110\n- 57. Van Parijs S, Clark C, Sousa-Lima R, Parks S, Rankin S, Risch D, et al. Management and research applications of real-time and archival passive acoustic sensors over varying temporal and spatial scales. Mar Ecol Prog Ser. 2009;395:21–36.\n- 58. DeAngelis AI, Van Parijs SM, Barkowski J, Baumann-Pickering S, Burger K, Davis GE, et al. Exploring marine mammal presence across seven US national marine sanctuaries. Front Remote Sens. 2022;3:970401.\n- 59. Vu E, Risch D, Clark C, Gaylord S, Hatch L, Thompson M, et al. Humpback whale song occurs extensively on feeding grounds in the western North Atlantic Ocean. Aquat Biol. 2012;14(2):175–83.\n- 60. Stimpert AK, Peavey LE, Friedlaender AS, Nowacek DP. Humpback Whale Song and foraging behavior on an Antarctic feeding ground. Bolhuis JJ, editor. PLoS One. 2012;7(12):e51214. pmid:23284666\n- 61. Norris TF, Mc Donald M, Barlow J. Acoustic detections of singing humpback whales (Megaptera novaeangliae) in the eastern North Pacific during their northbound migration. J Acoust Soc Am. 1999;106(1):506–14.\n- 62. Owen C, Rendell L, Constantine R, Noad MJ, Allen J, Andrews O, et al. Migratory convergence facilitates cultural transmission of humpback whale song. R Soc Open Sci. 2019;6(9):190337. pmid:31598287\n- 63. Warren VE, Constantine R, Noad M, Garrigue C, Garland EC. Migratory insights from singing humpback whales recorded around central New Zealand. R Soc Open Sci. 2020;7(11):201084. pmid:33391798\n- 64. Širović A, Williams LN, Kerosky SM, Wiggins SM, Hildebrand JA. Temporal separation of two fin whale call types across the eastern North Pacific. Mar Biol. 2013;160(1):47–57. pmid:24391281\n- 65. Romagosa M, Pérez-Jorge S, Cascão I, Mouriño H, Lehodey P, Pereira A, et al. Food talk: 40-Hz fin whale calls are associated with prey biomass. Proc Biol Sci. 2021;288(1954):20211156. pmid:34229495\n- 66. Zhang Y, McGill PR, Ryan JP. Optimized design of windowed-sinc anti-aliasing filters for phase-preserving decimation of hydrophone data. J Acoust Soc Am. 2022;151(3):2077–84. pmid:35364936\n- 67. Allen AN, Harvey M, Harrell L, Jansen A, Merkens KP, Wall CC, et al. A convolutional neural network for automated detection of Humpback Whale song in a diverse, long-term passive acoustic dataset. Front Mar Sci. 2021;8:607321.\n- 68. Ryan J, Gomes K. MBARI soundscape visual browser. 2024. Available from: https://www.mbari.org/data/soundscape-visual-browser/\n- 69. Širović A, Hildebrand JA, Wiggins SM, Thiele D. Blue and fin whale acoustic presence around Antarctica during 2003 and 2004. Mar Mamm Sci. 2009;25(1):125–36.\n- 70. Lewis LA, Calambokidis J, Stimpert AK, Fahlbusch J, Friedlaender AS, McKenna MF, et al. Context-dependent variability in blue whale acoustic behaviour. R Soc Open Sci. 2018;5(8):180241. pmid:30225013\n- 71. Širović A, Oleson EM, Buccowich J, Rice A, Bayless AR. Fin whale song variability in southern California and the Gulf of California. Sci Rep. 2017;7(1):10126. pmid:28860617\n- 72. Cheeseman T, Southerland K, Park J, Olio M, Flynn K, Calambokidis J, et al. Advanced image recognition: a fully automated, high-accuracy photo-identification matching system for humpback whales. Mamm Biol. 2022;102(3):915–29.\n- 73. Cheeseman T, Southerland K, Acebes JM, Audley K, Barlow J, Bejder L, et al. A collaborative and near-comprehensive North Pacific humpback whale photo-ID dataset. Sci Rep. 2023;13(1):10237. pmid:37353581\n- 74.\nCalambokidis J, Barlow J. Abundance estimates for blue and humpback whales along the U.S. West Coast using data through 2018. U.S. Department of Commerce, NOAA; 2020. Report No.: NMFS-SWFSC-634.\n- 75. Santora JA, Field JC, Schroeder ID, Sakuma KM, Wells BK, Sydeman WJ. Spatial ecology of krill, micronekton and top predators in the central California Current: Implications for defining ecologically important areas. Prog Oceanogr. 2012;106:154–74.\n- 76. Santora JA, Mantua NJ, Schroeder ID, Field JC, Hazen EL, Bograd SJ, et al. Habitat compression and ecosystem shifts as potential links between marine heatwave and record whale entanglements. Nat Commun. 2020;11(1):536. pmid:31988285\n- 77. Ralston S, Field JC, Sakuma KM. Long-term variation in a central California pelagic forage assemblage. J Mar Syst. 2015;146:26–37.\n- 78. Santora JA, Rogers TL, Cimino MA, Sakuma KM, Hanson KD, Dick EJ, et al. Diverse integrated ecosystem approach overcomes pandemic-related fisheries monitoring challenges. Nat Commun. 2021;12(1):6492. pmid:34764244\n- 79. NOAA P. California current integrated ecosystem assessment data access. Available from: https://oceanview.pfeg.noaa.gov/cciea-plotting/.\n- 80. Urmy SS, Benoit-Bird KJ. Fear dynamically structures the ocean’s pelagic zone. Curr Biol. 2021;31(22):5086–92.e3. pmid:34562382\n- 81. Benoit-Bird KJ, Waluk CM. Remote acoustic detection and characterization of fish schooling behavior. J Acoust Soc Am. 2021;150(6):4329–42. pmid:34972277\n- 82. Kahane-Rapport SR, Czapanskiy MF, Fahlbusch JA, Friedlaender AS, Calambokidis J, Hazen EL, et al. Field measurements reveal exposure risk to microplastic ingestion by filter-feeding megafauna. Nat Commun. 2022;13(1):6327. pmid:36319629\n- 83. Baker C, Steel D, Calambokidis J, Falcone E, González-Peral U, Barlow J, et al. Strong maternal fidelity and natal philopatry shape genetic structure in North Pacific humpback whales. Mar Ecol Prog Ser. 2013;494:291–306.\n- 84. Jackson AL, Inger R, Parnell AC, Bearhop S. Comparing isotopic niche widths among and within communities: SIBER - Stable Isotope Bayesian Ellipses in R: Bayesian isotopic niche metrics. J Anim Ecol. 2011;80(3):595–602. pmid:21401589\n- 85. Benoit‐Bird KJ, Waluk CM, Ryan JP. Forage species swarm in response to coastal upwelling. Geophys Res Lett. 2019;46:1537–46.\n- 86. Schroeder ID, Santora JA, Mantua N, Field JC, Wells BK, Hazen EL, et al. Habitat compression indices for monitoring ocean conditions and ecosystem impacts within coastal upwelling systems. Ecol Indic. 2022;144:109520.\n- 87. Au WWL, Pack AA, Lammers MO, Herman LM, Deakos MH, Andrews K. Acoustic properties of humpback whale songs. J Acoust Soc Am. 2006;120(2):1103–10. pmid:16938996\n- 88. Wenz GM. Acoustic Ambient noise in the ocean: spectra and sources. J Acoust Soc Am. 1962;34(12):1936–56.\n- 89. McMahon KW, Hamady LL, Thorrold SR. A review of ecogeochemistry approaches to estimating movements of marine animals. Limnol Oceanogr. 2013;58(2):697–714.\n- 90. Kurle C, McWhorter J. Spatial and temporal variability within marine isoscapes: implications for interpreting stable isotope data from marine systems. Mar Ecol Prog Ser. 2017;568:31–45.\n- 91. Calambokidis J, Steiger GH, Curtice C, Harrison J, Ferguson MC, Becker E, et al. 4. biologically important areas for selected cetaceans within U.S. Waters – West Coast region. Aquat Mamm. 2015;41(1):39–53.\n- 92. Cade DE, Seakamela SM, Findlay KP, Fukunaga J, Kahane‐Rapport SR, Warren JD, et al. Predator‐scale spatial analysis of intra‐patch prey distribution reveals the energetic drivers of rorqual whale super‐group formation. Crocker D, editor. Funct Ecol. 2021;35(4):894–908.\n- 93. Cade DE, Fahlbusch JA, Oestreich WK, Ryan J, Calambokidis J, Findlay KP, et al. Social exploitation of extensive, ephemeral, environmentally controlled prey patches by supergroups of rorqual whales. Anim Behav. 2021;182:251–66.\n- 94. Munger L, Camacho D, Havron A, Campbell G, Calambokidis J, Douglas A, et al. Baleen whale distribution relative to surface temperature and zooplankton abundance off Southern California, 2004–2008. 2009. p. 155–68. Report No.: 50. Available from: https://www.cetus.ucsd.edu/docs/publications/MungerCALCOFI2009.pdf\n- 95. Clark CW, Clapham PJ. Acoustic monitoring on a humpback whale (Megaptera novaeangliae) feeding ground shows continual singing into late spring. Proc Biol Sci. 2004;271(1543):1051–7. pmid:15293859\n- 96. Watkins W, Daher MA, Reppucci G, George J, Martin D, DiMarzio N, et al. Seasonality and distribution of Whale calls in the North Pacific. Oceanography. 2000;13:62–7.\n- 97. Gentemann CL, Fewings MR, García‐Reyes M. Satellite sea surface temperatures along the West Coast of the United States during the 2014–2016 northeast Pacific marine heat wave. Geophys Res Lett. 2017;44(1):312–9.\n- 98. Becker B, Peery M, Beissinger S. Ocean climate and prey availability affect the trophic level and reproductive success of the marbled murrelet, an endangered seabird. Mar Ecol Prog Ser. 2007;329:267–79.\n- 99. Price SE, Savoca MS, Kumar M, Czapanskiy MF, McDermott D, Litvin SY, et al. Energy densities of key prey species in the California Current Ecosystem. Front Mar Sci. 2024;10:1345525.\n- 100. Nichols RC, Cade DE, Kahane-Rapport S, Goldbogen J, Stimpert A, Nowacek D, et al. Intra-seasonal variation in feeding rates and diel foraging behaviour in a seasonally fasting mammal, the humpback whale. R Soc Open Sci. 2022;9(7):211674. pmid:35814912\n- 101. Gearty W, Jones LA. rphylopic: An R package for fetching, transforming, and visualising PhyloPic silhouettes. Evol Biol. 2023 Jun;"
    },
    {
      "url": "https://www.usatoday.com/story/sports/nhl/2025/08/01/seattle-kraken-buoy-john-hayden-bear/85478143007/",
      "text": "Seattle Kraken mascot, player interrupted by bear during filming\nSeattle Kraken forward John Hayden and team mascot Buoy were being filmed in nature during an annual event in Alaska when nature decided to interrupt.\nVideo posted on the social media feed of Buoy, a troll, showed that a large bear appeared on the shoreline near Brooks Falls in Katmai National Park and began approaching, causing everyone to scatter.\nThe bear can be heard growling, and at one point charges toward the mascot before turning around. Bears are known sometimes to make bluff charges.\nTrue to the mascot code, Buoy makes no sound while wading quickly away from the animal.\n\"I want to blame it on Buoy,\" said Hayden, who re-signed for two years with the Kraken in May. \"They were pretty interested in his whole look. We got out of it OK, but it was a close call.\"\nHayden was fly fishing as part of an annual Bristol Bay Native Corp partnership trip with the Kraken. It includes “Kraken Week” at a hockey camp hosted by Anchorage Hockey Academy, an outdoor excursion (where the bear encounter occurred) and a community event, a \"Skate with Buoy\" at a local mall rink.\nThis story has been updated to add new information.\nThe USA TODAY app gets you to the heart of the news — fast. Download for award-winning coverage, crosswords, audio storytelling, the eNewspaper and more."
    },
    {
      "url": "https://www.usatoday.com/story/news/nation/2025/08/05/whale-dies-boat-new-jersey-video/85527096007/",
      "text": "Minke whale dies after hitting, nearly capsizing boat\nA 20-foot minke whale died Aug. 2 in Barnegat Bay, New Jersey, after being struck by a boat, which nearly capsized and forced a passenger overboard, according to officials.\nThe whale was first spotted at the bay inlet at 2:45 p.m. local time, according to the Marine Mammal Stranding Center (MMSC), which received a call from New Jersey State Police.\nRescue crews responded with the U.S. Coast Guard seeking a way to guide the whale out of the bay, MMSC wrote on social media.\nBut before they could, the whale was struck by a vessel at 3:40 p.m. and was reported dead by officials hours later.\nVideo shows moment boat strikes whale in New Jersey\nThe Marine Mammal Stranding Center conducted a necropsy – an animal autopsy – and found that the whale was in thin body condition. According to the center's Instagram post, the whale had external superficial cuts, with bruising present in the blubber and muscle in the areas of trauma on the dorsal side.\n\"Various biological samples were collected during the necropsy examination and will be sent to a pathologist for further analysis,\" according to the statement. The results of the examination will be shared on the MMSC’s website.\nAre whale deaths on the rise?\nUSA TODAY previously reported on multiple whale deaths on both the Atlantic coast and in the San Francisco Bay.\nTwo dozen whales have died in the Greater San Francisco Bay Area this year, according to the California Academy of Sciences. Eight of those deaths were caused by a probable or suspected vessel strike. Of the whale deaths, 21 were gray whales, two were unidentified baleen whales, and one was a minke whale.\nThe National Oceanic and Atmospheric Administration reported that since January 2016, there has been an increase in humpback whale mortalities along the Atlantic coast, from Maine through Florida. Of the whales examined through necropsies, about 40% had evidence of human interaction, either by ship strike or entanglement."
    },
    {
      "url": "https://app.adjust.com/1el9h6z4",
      "text": "The USA TODAY news app gets you to the heart of the matter — fast. Whether it's money, sports, entertainment, or breaking news, get succinct, personalized coverage along with award-winning videos, captivating photography, and interactive user features. The point is — get major news coverage all in a compact device that fits right in the palm of your hand.\nAPP FEATURES\n• National and breaking news, including access to 200+ local publications.\n• News to the point: Easily keep up with news, sports, money, entertainment, health, and more with quick reads.\n• A personalized feed: Pick your favorite subjects in My Topics and receive a curated feed on the For You page.\n• eNewspaper: Just like our print edition but accessible on your mobile devices. And access to 200+ local eNewspapers.\n• Puzzles: Play Crossword, QuickCross, and Sudoku (tablet only) to keep your mind sharp.\n• Award-winning podcasts: Listen to your favorite USA TODAY NETWORK podcasts on demand.\n• Stay up-to-date with election news, analysis, and results.\nSubscription Information:\n• The USA TODAY app is free to download and all users can access a sampling of free articles every month.\n• Subscriptions are charged to your account at confirmation of purchase and automatically renew each month or year, unless turned off in your account settings at least 24 hours before the end of the current period. See \"Subscription Support\" in the app's Settings for more details and customer service contact information.\nMore Information:\n• Privacy Policy: https://cm.usatoday.com/privacy/\n• Terms of Service: https://cm.usatoday.com/terms/\n• Questions or comments? Visit http://www.usatoday.com/mobile-apps or email: mobilesupport@gannett.com"
    },
    {
      "url": "https://www.usatoday.com/story/news/2025/04/25/right-whale-pair-florida-gulf-trip/83143963007/",
      "text": "A wayward pair of female right whales took a 2,000-mile journey around Florida\nA pair of North Atlantic right whales seen off Florida in the Gulf may be headed back north after being seen in Bimini in the Bahamas.\nAfter a 3-month-long girls trip along Florida’s Gulf Coast, a wayward pair of endangered North Atlantic right whales known as Curlew and Koala have finally wandered back to the Atlantic Ocean.\nA group on a dolphin-watching trip from Neal Watson’s Bimini Scuba Center saw the gal pals along the eastern edge of the Gulf Stream near Bimini, making the pair the first documented right whales ever seen in the Bahamas.\n“That moment for me was breathtaking, and I couldn’t fully gather myself,\" said Captain Isaac Ellis, who led the tour. \"Once in a lifetime moment for sure.”\nEach winter a contingent of whales, including pregnant females, juvenile whales and random male and female adult whales make their way south for calving season, migrating in the Atlantic from the waters off Nova Scotia and New England to the waters off Georgia and Florida.\nThis pair took a round trip adventure of about 2,000 miles, based on the reported sightings.\nResearcher track sightings, monitor by air\nBecause North Atlantic right whales are critically endangered with only around 370 remaining, researchers track sightings and fly aerial monitoring surveys to document their locations.\nPhotographs are kept in a detailed photo catalog maintained by the New England Aquarium in a collaborative partnership with other organizations and agencies. Curlew and Koala, both about 40-feet long, have been tracked since their births in 2009 and 2011.\nThe pair were spotted last fall off the South Carolina coast, by the Clearwater Marine Aquarium Research Institute on Nov. 24, according to the National Oceanic and Atmospheric Administration.\nThey were seen again along the Southeast coast of Florida on Jan. 13, but then didn't pop up in sightings again until Feb. 2, when they were seen in the Gulf near the Florida-Alabama border.\nIt was only the fifth time since 2000 that right whales have been documented in the Gulf, according to the New England Aquarium.\nAfter several scattered sightings along the Florida Panhandle over about nine days in early February, the wayward whales next turned up in sightings off St. Petersburg Beach. Researchers hoped the whales were heading southward to round Florida back into the Atlantic. However, they turned up along the Panhandle again in early April, near Seaside.\nOther right whales with their recently born calves already were being seen on feeding grounds off Cape Cod, Massachusetts.\nOn April 5, Curlew and Koala were seen as far west in the Gulf as Navarre Beach. Then less than a week later, they were seen roughly 300 miles to the southeast off St. Petersburg Beach on April 11.\nTraveling faster than a boat\nDaniel Mosley and his wife LaShay were out with a friend in their boat about a half-mile from shore near Pass-a-Grille Beach when they spotted the pair.\n\"We were just shocked,\" Mosley said. \"We were like no way those are whales right there.\" They were in water only about 20-25 feet deep, Mosley said, according to his depth chart. The large animals were stirring up sand off the bottom leaving a little trail behind them as they swam.\nJust as astounding to Mosley was how fast the whales turned up in Bimini, a distance of more than 400 miles depending on their route.\n\"It really surprised me that four days after we saw them, they were in Bimini,\" he said. \"I couldn’t get around the peninsula of Florida in a boat that quick.\"\nInspiration for journey 'will likely remain a mystery'\nThe whales, which typically swim an average of 1-3 mph, likely moved in the Florida current, which pulls warmer waters from the Gulf through the Straits of Florida and into the Gulf Stream.\n“These two are really on quite the swim-about!” said Philip Hamilton, senior scientist in the New England Aquarium’s Anderson Cabot Center. \"What inspired them to make this journey will likely remain a mystery.\"\n“Besides the unusual locations, it is also rare for two right whales to remain together for more than a few days unless it is a mother with her calf. Everything about this sighting is remarkable and exciting,” Hamilton said.\nAfter Ellis and his passengers saw the whales off Bimini, they shared the videos with the Bahamas Marine Mammal Research Organization, which then conferred with the Aquarium to confirm the identities of the two whales. Over 30 years, the Bahamas research group had documented 26 different marine mammal species, according to Executive Director Diane Claridge. She had always hoped they'd see a right whale one day, since they are as close as 50 miles to Florida.\n\"As their numbers declined, I had given up hope, but these two surprised us all!” Claridge said. “As much as we enjoyed their visit to The Bahamas, I hope Koala and Curlew make their way back north safely.\"\nWhaleMap, an online resource managed by the Aquarium, allows the public to monitor whale sightings. Anyone who sees a whale, is asked to report it to 877-WHALE-HELP, stay at least 500 yards away and go no faster than 10 knots when the whales are nearby.\nOnly 11 right whale mother and calf pairs were documented during the winter birthing season that just wrapped up. The Center for Coastal Studies, in Provincetown, Massachusetts just documented the 11th pair, Monarch and her calf, off Barnstable, Massachusetts.\nThe number of calves born this season is well short of the 20 that scientists say is needed for a productive season, and far below the 50 calves per season needed to rebuild the population, according to the International Fund for Animal Welfare. The whales face a number of human-related threats including warmer oceans, entanglements in rope and fishing gear and collisions with boats.\nDinah Voyles Pulver covers climate change, wildlife and the environment for USA TODAY. Reach her at dpulver@usatoday.com or @dinahvp on Bluesky or X or dinahvp.77 on Signal."
    },
    {
      "url": "https://www.usatoday.com/story/news/world/2025/08/04/denmarks-aalborg-zoo-pet-donation-feed-predators/85507728007/",
      "text": "Zoo makes unique request: Donate your pets to feed our predators\nA Denmark zoo is requesting donations of healthy horses and other small pets to feed their captive predatory animals.\nThe Aalborg Zoo said it accepts live horses, chickens, rabbits and guinea pigs to give to carnivorous animals in its care, calling them an important part of their predators' diets.\nThe zoo, located in Denmark's North Jutland region, argued it has a responsibility to mimic the natural food chain among animals. Donated animals are \"gently euthanized\" by its staff before being served as fodder.\nThe zoo discussed the feeding donation program in a Facebook post on July 31, garnering dozens of reactions, including many who pushed back on the initiative.\nZoo shares rules for animal donations\nThe zoo accepts guinea pigs, chickens, and rabbits on weekdays. Donors are allowed to give four at a time.\nOn its website, the Aalborg Zoo explained that there are specific requirements for those who want to donate horses:\n◾The horse must have a passport and be considered in a \"safe condition\" for transportation.\n◾The animal must be a maximum of roughly 58 inches.\n◾The horse could not have been treated for an illness within the last 30 days, at least.\nTaylor Ardrey is a news reporter for USA TODAY. You can reach her at tardrey@gannett.com."
    },
    {
      "url": "https://www.fisheries.noaa.gov/national/marine-life-distress/2019-2023-eastern-north-pacific-gray-whale-ume-closed",
      "text": "2019-2023 Eastern North Pacific Gray Whale UME (CLOSED)\nThe Unusual Mortality Event involving stranded eastern North Pacific gray whales along the western coast of North America has ended.\nThe Unusual Mortality Event (UME) involving stranded eastern North Pacific gray whales along the western coast of North America has ended. It occurred from December 17, 2018 through November 9, 2023, with peak strandings occurring between December 17, 2018, and December 31, 2020. NOAA Fisheries and partners investigated the event.\nThe UME involved 690 gray whale strandings, including 347 in the United States, 316 in Mexico, and 27 in Canada. Strandings occurred from Alaska to Mexico along the west coast of North America, including in the whale’s wintering, migratory, and feeding areas. The Investigative Team concluded that the preliminary cause of the UME was localized ecosystem changes in the whale's Subarctic and Arctic feeding areas that led to changes in food, malnutrition, decreased birth rates, and increased mortality all documented during the UME.\nFindings in Whales\nNecropsy findings from a subset of dead gray whales found malnutrition as a common cause of death and did not identify underlying disease. Killer whale predation, entanglement, and vessel strike also caused deaths, and biotoxins were found in some carcasses as in non-UME years. The nutritional condition of live gray whales in Mexico was lower leading into and during the UME compared to the years before the UME.\nGray Whale Abundance and Distribution\nAbundance estimates of the eastern North Pacific gray whale population show that it declined during the UME, from 20,500 whales in 2019 to 14,526 whales in 2023. Total calf production also declined from around 950 calves in 2018 to an estimated 217 calves in 2022. In 2023, calf production increased slightly to 412.\nThere have been recent changes in gray whale distribution and feeding behaviors as well as changes in gray whale prey associated with ecosystem changes in sub-Arctic and Arctic feeding areas. Gray whale population modeling, which focused on localized feeding areas in northern Bering and Chukchi seas, linked the 1999–2000 UME and the 2019–2023 UME to changes in sea ice cover and in the amount of gray whale prey. These impacts to prey likely led to malnutrition, decreased birth rates, and the increased mortality documented in the elevated strandings observed during the UME.\nGray Whale Strandings 2019–2023\n| U.S. State | 2019 | 2020 | 2021 | 2022 | 2023 |\n|---|---|---|---|---|---|\n| Alaska | 48 | 45 | 24 | 18 | 11 |\n| Washington | 34 | 13 | 9 | 15 | 13 |\n| Oregon | 6 | 3 | 3 | 4 | 6 |\n| California | 34 | 18 | 19 | 10 | 14 |\n| Total | 122 | 79 | 55 | 47 | 44 |\n| Country | 2019 | 2020 | 2021 | 2022 | 2023 | Total |\n|---|---|---|---|---|---|---|\n| Canada | 11 | 5 | 5 | 4 | 2 | 27 |\n| U.S. | 122 | 79 | 55 | 47 | 44 | 347 |\n| Mexico | 83 | 88 | 55 | 54 | 36 | 316 |\n| Total | 216 | 172 | 115 | 105 | 82 | 690 |\nInteractive Map\n2019-2023 Gray Whale Unusual Mortality Event Dead Animal Locations Mapping Application\nMore Information\nMore Information\n- Frequent Questions: West Coast Gray Whale Unusual Mortality Event\n- Closure of 2019-2023 Eastern North Pacific Gray Whale Unusual Mortality Event\n- New Gray Whale Count Shows Further Decline, with Hints of a Turnaround\n- 2024 Gray Whale Calf Count Survey\n- 2023 Gray Whale Calf Count Survey\n- Gray Whales in the Eastern North Pacific\n- Gray Whale Research in Mexico (formerly the Laguna San Ignacio Ecosystem Science Program)\n- National Marine Mammal Stranding Network"
    },
    {
      "url": "https://www.fisheries.noaa.gov/feature-story/blob-research-reveals-environmental-effects-shut-down-fishing-and-hiked-whale#:~:text=%E2%80%9CThe%20more%20we%20understand%20the,tightly%20species%20are%20coalescing%20there.",
      "text": "An ecological pileup of unprecedented changes in the ocean off the West Coast beginning about 2014 led to record entanglements of humpback and other whales. This put the region’s most valuable commercial fishery at risk, new research shows.\nThe findings reflect a new management challenge brought about by a changing climate, recovering whale populations, and fishing pressure, according to the new research published in Nature Communications. The situation calls for new measures that alert fishermen to the risk of entanglements and help managers adjust to more rapid and frequent changes in the marine environment.\n“We need to put information in the hands of those who can use it, at a time when it can make a difference,” said Jarrod Santora, a research scientist at NOAA Fisheries’ Southwest Fisheries Science Center (SWFSC) in Santa Cruz, California, and lead author of the research “We are seeing changes coming at us in ways they never have before.”\nSantora and his colleagues are developing a website that will use oceanographic data to forecast the areas where whales are most likely to be feeding off the West Coast. Crab fishermen could then use the information to help decide where—and where not—to set their traps. It may also help managers decide where and when to open—or close—fishing.\nThe new research teases out the ecological causes and effects that contributed to the spike in reported whale entanglements. Many involved traps set for Dungeness crab, said Nathan Mantua, a research scientist at the SWFSC and co-author of the research. Reported entanglements have since dropped off but remain higher than before the increase.\n“We had all these things that weren’t part of anyone’s experience come together in this remarkable three-year period,” he said.\nConflict Prompts Improved Communication\nThe entanglements have also prompted environmental lawsuits that threaten to restrict crab fishing. At the same time, though, the focus on entanglements has led to better communication and conversation between fishermen, environmental groups, and managers. This is in due to working groups that have also developed tools to better anticipate and avoid entanglement risk.\n“If the working group knew then what we know now, it wouldn’t have happened,” said John Mellor, a crab fisherman from San Francisco, referencing the increased entanglements. “The more we understand the whole picture, the better chance we have to mitigate the impacts.”\nThe driver behind many of the environmental changes was an unprecedented marine heatwave that took hold in 2014. It became known as “the warm Blob,” because of the large expanse of unusually high temperatures that dominated waters off the West Coast. The warm temperatures attracted subtropical species rarely seen in the region. The krill that humpback whales typically feed on grew scarce.\nThe whales switched to feed instead on high concentrations of anchovy that the warm, less productive waters had squeezed into a narrow band near the coast.\nAt the same time, the higher temperatures fueled a record bloom of toxic algae. It shut down crabbing on the West Coast from November 2015 through March 2016. When toxin levels eased and the Dungeness season finally opened, fishermen set multitudes of crab traps in that same narrow band where many whales were feeding.\nNOAA Fisheries’ West Coast Region confirmed a then-record 53 whale entanglements in 2015 and 55 in 2016.\nThe scientists developed a new measure for ocean conditions called the Habitat Compression Index. It tracks the width of the productive band and how tightly species are coalescing there.\nWhale Numbers Reflect Unprecedented Change\nResearch Biologist Karin Forney, also from the SWFSC and a coauthor of the research, lives in Moss Landing, California. She has a view of Monterey Bay and has long seen occasional humpback whales feeding just offshore. During the “the Blob” years, she would regularly see 30 to 40 whales from her front windows. Local whale watch boats made two to three trips a day to keep up with the demand.\nSome 300 whales were counted at once in Monterey Bay.\n“In our lifetimes living here, that was unprecedented,” she said. “We knew something dramatically different was pulling these whales closer to shore.”\nShe is also part of a NOAA team trained to free entangled whales.\n“We were on call every day for weeks, with simultaneous reports of two or three entangled whales, so we could respond if they were sighted again,” she said. The team disentangled a few, while others were never seen again.\nThe lesson of the research, Forney said, is that scientists and fishermen must share information. They can help each other understand how complex environmental connections affect marine species and fisheries. Communication may be one of their most important tools as environmental changes come ever faster.\n“Things are dynamic, and things are changing,” she said. “That is not going away.”"
    },
    {
      "url": "https://www.usatoday.com/story/news/world/2025/07/31/stick-insect-australia-discovery-video/85458253007/",
      "text": "See video of the heaviest stick insect ever discovered in Australia\nThe new Acrophylla alta species weighs about the same as a golf ball, according to scientists.\nScientists in Australia have discovered a new species of stick insect believed to be the heaviest in the country, weighing the same as a golf ball.\nThe remote rainforest in Far North Queensland, Australia, is home to spiders, deadly snakes and the newly found 15.75-inch-long stick insects.\nAngus Emmott, a researcher and professor at James Cook University, helped identify the new Acrophylla alta species, Reuters reported. Emmott said the creature's large size could be an evolutionary response to its cool, wet habitat.\nVideo shows newly found giant stick bug\nEmmott said in a July 31 news release that the insects' \"body mass likely helps them survive the colder conditions, and that's why they've developed into this large insect over millions of years.\"\n\"From what we know to date, this is Australia's heaviest insect,\" Emmott said.\nEmmott added that every species of stick insect has its own distinct egg style, including different textures, pittings, surfaces and even shapes.\nWhy did the insect previously go undiscovered?\nLocated in the Wet Tropics region of Far North Queensland, the insect stayed undiscovered for so long because of its remote habitat, Emmott said\n\"It's restricted to a small area of high-altitude rainforest, and it lives high in the canopy. So, unless you get a cyclone or a bird bringing one down, very few people get to see them,\" he added.\nTwo specimens of the Acrophylla alta were added to the Queensland Museum’s collection to aid future research, according to Reuters.\n\"To conserve any ecosystem, we actually need to know what's there and what makes it tick before we can think about the best ways to conserve it,\" Emmott said.\nContributing: Reuters"
    }
  ],
  "argos_summary": "A recent study has found that changing ocean conditions are causing whale prey to become scarce, leading to a decrease in singing among blue, fin, and humpback whales off the California coast. Researchers monitored whale songs over six years and discovered that the frequency of songs correlated with the whales' ability to find food, particularly krill, which has been affected by marine heatwaves and toxic algae blooms. The study highlights the impact of environmental changes on whale behavior and raises concerns about the future of these species as ocean temperatures continue to rise.",
  "argos_id": "4LHKZHQX0"
}