{
  "url": "https://techcrunch.com/2025/08/11/seoul-based-datumo-raises-15-5m-to-expand-llm-evaluation-challenging-scale-ai/",
  "authorsByline": "Kate Park",
  "articleId": "4c504a16596b497a8bee123a9996a7a5",
  "source": {
    "domain": "techcrunch.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "San Francisco",
      "city": "San Francisco",
      "coordinates": {
        "lat": 37.7790262,
        "lon": -122.419906
      }
    }
  },
  "imageUrl": "https://techcrunch.com/wp-content/uploads/2023/10/GettyImages-1486380350.jpg?resize=1200,900",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T23:00:00+00:00",
  "addDate": "2025-08-11T23:06:48.440993+00:00",
  "refreshDate": "2025-08-11T23:06:48.440995+00:00",
  "score": 1.0,
  "title": "Seoul-based Datumo raises $15.5M to take on Scale AI, backed by Salesforce",
  "description": "Most organizations say they aren’t fully prepared to use generative AI in a safe and responsible way, according to a recent McKinsey report. One concern",
  "content": "Most organizations say they aren’t fully prepared to use generative AI in a safe and responsible way, according to a recent McKinsey report. One concern is explainability – understanding how and why AI makes certain decisions. While 40% of respondents view it as a significant risk, only 17% are actively addressing it, per the report.\n\nSeoul-based Datumo began as an AI data labeling company and now wants to help businesses build safer AI with tools and data that enable testing, monitoring, and improving their models—without requiring technical expertise. On Monday the startup raised $15.5 million, which brings its total raised to approximately $28 million, from investors including Salesforce Ventures, KB Investment, and SBI Investment, among others.\n\nDavid Kim, CEO of Datumo and a former AI researcher at Korea’s Agency for Defence Development, was frustrated by the time-consuming nature of data labeling so he came up with a new idea: a reward-based app that lets anyone label data in their spare time and earn money. The startup validated the idea at a startup competition at KAIST (Korea Advanced Institute of Science and Technology). Kim co-founded Datumo, formerly known as SelectStar, alongside five KAIST alumni in 2018.\n\nEven before the app was fully built, Datumo secured tens of thousands of dollars in pre-contract sales during the customer discovery phase of the competition, mostly from KAIST alumni-led businesses and startups.\n\nIn its first year, the startup surpassed $1 million in revenue and secured several key contracts. Today, the startup counts major Korean companies like Samsung, Samsung SDS, LG Electronics, LG CNS, Hyundai, Naver, and Seoul-based telecom giant SK Telecom among its clients. Several years ago, however, clients began asking the company to go beyond simple data labeling. The seven-year-old startup now has more than 300 clients in South Korea and generated about $6 million in revenue in 2024.\n\n“They wanted us to score their AI model outputs or compare them to other outputs,” Michael Hwang, co-founder of Datumo, told TechCrunch. “That’s when we realized: we were already doing AI model evaluation — without even knowing it.” Datumo doubled down on this area and released Korea’s first benchmark dataset focused on AI trust and safety, Hwang added.\n\n“We started in data annotation, then expanded into pretraining datasets and evaluation as the LLM ecosystem matured,” Kim told TechCrunch.\n\nMeta’s recent $14.3 billion acquisition-like investment in data-labeling company Scale AI highlights the importance of this market. Shortly after that deal, AI model maker and Meta competitor OpenAI stopped using Scale AI’s services. The Meta deal also signals that competition for AI training data is intensifying.\n\nDatumo shares some similarities with companies like Scale AI in pretraining dataset provisioning, and with Galileo and Arize AI in AI evaluation and monitoring. However, it differentiates itself through its licensed datasets, particularly data crawled from published books, which the company says offers rich structured human reasoning but is notoriously difficult to clean, according to CEO Kim.\n\nUnlike its peers, Datumo also offers a full-stack evaluation platform called Datumo Eval, which automatically generates test data and evaluations to check for unsafe, biased or incorrect responses without the need for manual scripting, Kim added. The signature product is a no-code evaluation tool designed for non-developers like those on policy, trust and safety, and compliance teams.\n\nWhen asked about attracting investors like Salesforce Ventures, Kim explained that the startup had previously hosted a fireside chat with Andrew Ng, founder of DeepLearning.AI, at an event in South Korea. After the event, Kim shared the session on LinkedIn, which caught the attention of Salesforce Ventures. Following several meetings and Zoom calls, the investors extended a soft commitment. The entire funding process took about eight months, Hwang said.\n\nThe new funding will be used to accelerate R&D efforts, particularly in developing automated evaluation tools for enterprise AI, and to scale global go-to-market operations across South Korea, Japan, and the U.S. The startup, which has 150 employees in Seoul, also established a presence in Silicon Valley in March.",
  "medium": "Article",
  "links": [
    "https://techcrunch.com/events/tc-disrupt-2025/?utm_source=tc&utm_medium=ad&utm_campaign=disrupt2025&utm_content=ticketsales&promo=tc_inline_rb&display=",
    "https://techcrunch.com/2025/06/13/scale-ai-confirms-significant-investment-from-meta-says-ceo-alexandr-wang-is-leaving/",
    "https://techcrunch.com/2025/06/18/openai-drops-scale-ai-as-a-data-provider-following-meta-deal/",
    "https://open.datumo.com/en/",
    "https://techcrunch.com/2022/11/01/mlops-platform-galileo-lands-18m-to-launch-a-free-service/",
    "https://datumo.com/en/",
    "https://techcrunch.com/2025/02/20/arize-ai-hopes-it-has-first-mover-advantage-in-ai-observability/",
    "https://www.mckinsey.com/capabilities/quantumblack/our-insights/building-ai-trust-the-key-role-of-explainability?utm_source=chatgpt.com"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "AI evaluation",
      "weight": 0.09484386
    },
    {
      "name": "AI training data",
      "weight": 0.09015259
    },
    {
      "name": "Scale AI",
      "weight": 0.08713984
    },
    {
      "name": "AI model evaluation",
      "weight": 0.083344005
    },
    {
      "name": "AI trust",
      "weight": 0.082672484
    },
    {
      "name": "AI",
      "weight": 0.079666026
    },
    {
      "name": "generative AI",
      "weight": 0.07912199
    },
    {
      "name": "Arize AI",
      "weight": 0.07893443
    },
    {
      "name": "data labeling",
      "weight": 0.07189799
    },
    {
      "name": "Datumo Eval",
      "weight": 0.06898265
    }
  ],
  "topics": [
    {
      "name": "AI"
    },
    {
      "name": "Startups"
    },
    {
      "name": "Venture Capital"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.986328125
    },
    {
      "name": "/Science/Computer Science/Machine Learning & Artificial Intelligence",
      "score": 0.861328125
    },
    {
      "name": "/News/Technology News",
      "score": 0.8203125
    },
    {
      "name": "/Computers & Electronics/Software/Business & Productivity Software",
      "score": 0.75146484375
    },
    {
      "name": "/Computers & Electronics/Enterprise Technology/Other",
      "score": 0.6611328125
    },
    {
      "name": "/Business & Industrial/Business Finance/Venture Capital",
      "score": 0.43505859375
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.42529296875
    },
    {
      "name": "/Business & Industrial/Business Operations/Management",
      "score": 0.366455078125
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.362548828125
    },
    {
      "name": "/Computers & Electronics/Enterprise Technology/Data Management",
      "score": 0.31787109375
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.316162109375
    }
  ],
  "sentiment": {
    "positive": 0.2986666,
    "negative": 0.2948449,
    "neutral": 0.40648845
  },
  "summary": "Seoul-based Datumo, a startup that provides AI data labeling, has raised $15.5 million to compete with Scale AI, backed by Salesforce. The funding will be used to accelerate R&D efforts in developing AI tools for enterprise and global operations across South Korea. The company, formerly known as SelectStar, now aims to help businesses build safer AI without requiring technical expertise. The seven-year-old startup now has over 300 clients in South Korea and generates about $6 million in revenue in 2024. Its CEO, David Kim, was frustrated by the time-consuming nature of data labeling and came up with a reward-based app that allows anyone to label data in their spare time.",
  "shortSummary": "Datumo raises $15.5 million to support businesses in developing safe and effective AI models using commercially available data, following Salesforce's $14.3 billion investment in Scale AI.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "9d253a3da680411dae7d34c7286b6a56",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://techcrunch.com/2025/02/20/arize-ai-hopes-it-has-first-mover-advantage-in-ai-observability/",
      "text": "There are numerous observability platforms that monitor and evaluate cloud software, like Dynatrace and ServiceNow, which flag potential code errors or failures so engineers can find and fix them. Arize AI says it is bringing that same approach to AI models and applications.\nArize is an AI observability platform that helps companies evaluate their AI products as they are building them and then monitor those products for errors and issues once they are up and running. Arize’s platform works with a variety of AI applications, from machine learning and computer vision to generative AI.\nJason Lopatecki, Arize co-founder and CEO (pictured above, left), told TechCrunch that Arize uses a “council of judges” approach to monitor and evaluate AI. This approach includes evaluating AI with different AI models — which Lopatecki joked is, yes, very meta — in addition to having humans in the loop.\nThe idea behind Arize came from Lopatecki’s previous company, TubeMogul, a brand advertising company, which was acquired by Adobe for over $500 million in 2016.\nEverything at TubeMogul ran on AI, Lopatecki said, and when it would break it would be a “big deal” since the technology was so complicated. Aparna Dhinakaran, a co-founder and CPO at Arize (pictured above, right), who met Lopatecki through TubeMogul, had run into similar issues developing language models without having the proper tools to test and evaluate as she built.\n“We both saw the problem space and really had that idea that AI is going to be high stakes in more and more organizations everywhere,” Lopatecki said. “It’s so complicated, it’s really hard to tell what it’s doing, when it’s broken and how to fix it.”\nThe pair launched Arize in 2020 with an initial focus on the AI trend of the day: predictive machine learning. Lopatecki said that when Arize got started, it was really just an idea. Today, five years later, the market gets the problem and Arize’s platform works with everything from AI agents to generative AI.\nTech and VC heavyweights join the Disrupt 2025 agenda\nNetflix, ElevenLabs, Wayve, Sequoia Capital, Elad Gil — just a few of the heavy hitters joining the Disrupt 2025 agenda. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $600+ before prices rise.\nTech and VC heavyweights join the Disrupt 2025 agenda\nNetflix, ElevenLabs, Wayve, Sequoia Capital — just a few of the heavy hitters joining the Disrupt 2025 agenda. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise.\n“So the last two years have been, I would say, explosive, explosive in growth,” Lopatecki said. “Simply because [AI] is more accessible. Everyone’s a prompt engineer. Every engineer is a prompt engineer. Everyone is integrating [AI] products into their product lines.”\nArize now works with enterprises including Uber, Klaviyo, and Tripadvisor, among others. The company also has an open source offering, Arize Phoenix, which has more than two million monthly downloads.\nThe Berkeley, California-based company recently raised a $70 million Series C round led by Adams Street Partners with participation from M12, SineWave Ventures, and OMERS Ventures, among other investors, in addition to strategic backers including Datadog and PagerDuty. This brings the company’s total funding to more than $130 million to date.\nThe company plans to put its latest round of funding toward improving its main product and doubling down on growing AI segments, including voice and AI agents. Dhinakaran joked that while their open source product may be their biggest competitor, the company plans to put more money into developing that product, too.\n“Our open source Phoenix has just been growing, it’s been growing massively, and so I think we love that. We love open source,” Dhinakaran said.\nThe AI observability and evaluation space is becoming increasingly crowded. Dhinakaran said that they think that Arize offers both pre- and post-launch evaluations, and can be used across a variety of different AI applications, which helps the company stand out; although, there are companies with very similar offerings, like Galileo, which has raised $68 million in venture funding, and Patronus AI, which has raised $20 million in funding.\n“It’s so hard to build the [infrastructure] to do this, right?” Lopatecki said. “It’s kind of why I think the Microsofts and Datadogs are investing in us, or making a bet on us. I think people also now see how big this market can be. You’re going to have a lot of little guys. You’re gonna have big people jumping in it, and I expect it to be a fast, growing, large market.”\nThis piece has been updated to better reflect when Arize was founded."
    },
    {
      "url": "https://techcrunch.com/events/tc-disrupt-2025/?utm_source=tc&utm_medium=ad&utm_campaign=disrupt2025&utm_content=ticketsales&promo=tc_inline_rb&display=",
      "text": "TechCrunch Disrupt 2025\nTechCrunch Disrupt is where you’ll find innovation for every stage of your startup journey. Whether you’re a budding founder with a revolutionary idea, a seasoned startup looking to scale, or an investor seeking the next big thing, Disrupt offers unparalleled resources, connections, and expert insights to propel your venture forward.\nFind innovation for every stage at Disrupt 2025\nFrom idea to IPO, Disrupt 2025 will map out the path for startups to achieve their next major milestone.\nJoin 10,000 startup and VC leaders\nLooking to meet founders, connect with investors, seek advice, or land your next big role? Disrupt is the must-attend event to make it all happen in person.\nBuild and scale your business faster\nDisrupt is more than a startup launchpad — it’s a growth accelerator. Dive into sessions on scaling, sales, and leadership, and connect with the investors and tech experts who can help take your business to the next level.\nGain insights from today’s tech giants\nTap into the wisdom of founders and tech titans at Disrupt. From actionable tips to hard-won lessons, they’ll share what works (and what doesn’t) to guide you as you build your own path forward.\nDisrupt 2025 speakers\nPartner Sequoia Capital\nChief Technology Officer US Dept of Navy\nCEO and Co-Founder Writer\nChief Product Officer Netflix\nCEO Wayve\nCo-Founder & CEO Box\nFounder and CEO Pinecone\nCo-CEO Waymo\nCo-Founder ElevenLabs\nCaptain of Moonshots X, The Moonshot Factory\nI’ve always thought, “What can I do that opens up possibilities?” I grew up in South Africa and went to an Afrikaans high school, and we didn’t speak English at home. But I pushed myself to go to an English-speaking university, and that opened up a door. Then I chose to work for McKinsey, because I thought it would open another door and maybe I’d get a chance to work overseas. I was reading about what was happening in Silicon Valley in the mid 90s, before I came to the U.S. Already, I’m starting to see the beginnings of the internet. Did I fathom how big it would be? Absolutely not. I didn’t know what venture capital was. I didn’t know that I would join a startup. I just had an intuition that I needed to be here. A friend of mine introduced me to Elon in 1999 and I joined PayPal. Then when Mike Moritz asked me to come interview at Sequoia, that was just another door opening. Where might this one lead? Whenever I interview people, I ask about those key moments in somebody’s life where they’ve made career decisions. And I think about companies in the same way—there are these crucible moments that have an enormous bearing on ultimate outcomes.\nRoelof's Sessions\nWhat Sequoia Sees Coming Next\nAs one of the most influential VCs of the modern era, Roelof Botha has seen it all; booms, busts, and billion-dollar breakout bets. In this fireside chat, the Sequoia Capital managing partner opens up about how today’s most ambitious founders are navigating AI, geopolitics, and a shifting capital landscape.\nJustin Fanelli is the Chief Technology Officer for the Department of the Navy and Technical Director of PEO Digital, driving measurable technology improvements and secure, high-performance digital transformation. He champions private-public collaboration to deliver innovation with unprecedented value. Fanelli advises numerous national science and technology boards and has held key roles including Chief Architect for Defense Health, DARPA Service Chiefs Fellow, and Chief Systems Engineer for Joint Command and Control. He teaches at Georgetown and has lectured all over the country at CMU, MIT, Stanford and others. He recently gave a TED Talk on innovation adoption and the Innovation Adoption Kit covered by TechCrunch, Forbes, CSIS and others. Fanelli holds engineering degrees from Penn State and the University of Pennsylvania and is a Senior Executive Fellow at Harvard Kennedy School. He’s been an angel investor, VC and has been privileged to serve on public and private boards. His work has earned national awards including the Etter Award, Fed100, Defense50, and CMMI Project of the Year. He lives in Arlington, VA and enjoys book recommendations.\nJustin's Sessions\nAI and National Security in the High-Stakes Race to Innovate\nFrom defense labs to Wall Street and naval operations, AI is reshaping how countries protect themselves and project power. DARPA’s Kathleen Fisher, Point72’s Sri Chandrasekar, and Navy CTO Justin Fanelli dive into the cutting-edge AI breakthroughs driving security innovation. They’ll discuss what it means for entrepreneurs, investors, and the future of global stability.\nMay Habib is the CEO and co-founder of Writer, a leader and pioneer in enterprise AI. With Writer’s end-to-end AI agent platform, hundreds of companies like Accenture, Mars, Uber, and Vanguard are building and scaling AI agents that are grounded in their company’s data and fueled by Writer’s enterprise-grade LLMs. From faster product launches to deeper financial research to better clinical trials, companies are quickly transforming their most important business processes for the AI era in partnership with Writer. Writer houses the world’s only enterprise-specific AI research lab. Its family of enterprise-grade Palmyra LLMs includes state-of-the-art frontier models, as well as self-evolving, open-source, and domain-specific models. Palmyra models define industry-leading standards for enterprise-grade transparency, reliability, safety, efficiency, and observability. May is an expert in natural language processing and AI-driven language generation. She has led Writer to become one of the world’s fastest-growing generative AI companies, securing its position as a Forbes 50 AI company and inclusion in the World Economic Forum’s Unicorn Community. Founded in 2020 with its headquarters in San Francisco and offices around the globe, Writer is backed by world-leading investors, including Premji Invest, Radical Ventures, ICONIQ Growth, Insight Partners, Balderton, B Capital, Salesforce Ventures, Adobe Ventures, Citi Ventures, IBM Ventures, and others. May and the Writer team have raised over $326M in funding at a valuation of $1.9B. May graduated with high honors in Economics from Harvard University. She is a World Economic Forum Young Global Leader, a Fellow of the Aspen Global Leadership Network, a recipient of Inc.’s Female Founder Award, and one of Worth’s Groundbreaking Women for 2025.\nMay's Sessions\nWriting the Future with AI?\nWhat happens when AI learns to write with purpose, personality, and persuasion? Writer CEO May Habib joins us to talk about the evolving relationship between language and machines and what the rise of generative content means for the future of brand, business, and beyond.\nEunice Kim was named Chief Product Officer in October 2023. She previously led the company’s global Consumer Product Innovation team. Eunice joined Netflix in early 2021 after having spent 10 years in product leadership roles at Google Play and YouTube. Prior to Google, she worked at several tech startups as well as PepsiCo and Adobe Systems. Eunice holds a B.A. from Columbia University and an M.B.A. from the University of Chicago Booth School of Business. She serves on the Board of Directors for Cure CMD.\nEunice's Sessions\nWhat's Next for Netflix and for Streaming Itself\nAs CPO of Netflix, Eunice Kim is steering the future of entertainment for hundreds of millions of users. In this fireside chat, Kim will break down how Netflix is evolving its product strategy—from personalized discovery to global growth, from ad tiers to gaming. We’ll explore how Netflix is adapting to a shifting content landscape, what it means to innovate at massive scale, and what design surprises Netflix has up its sleeve. For anyone building consumer experiences, this will be a masterclass.\nAlex co-founded Wayve in 2017 to reimagine autonomous mobility through embodied intelligence. From his award-winning research at the University of Cambridge, he seized the opportunity to use deep learning to pioneer an entirely new way to solve self-driving. He showed for the first time that it was possible to teach a machine to understand where it is and what’s around it and then give it the “intelligence” to make its own decisions based on what it sees with computer vision. As CEO, Alex is responsible for the company’s overall strategy, primarily focusing on establishing all necessary ingredients to develop and deploy AV2.0 globally. He also works closely with our partners and investors to ensure that our technology is commercially viable and can be widely adopted. Under Alex’s leadership, Wayve is fast becoming one of the most exciting companies in the autonomous vehicle industry. Before founding Wayve, Alex’s passion for autonomous vehicles began as a research fellow at the University of Cambridge, where he earned his PhD in Computer Vision and Robotics. His research has received numerous awards for scientific impact and made significant contributions to the field of computer vision and AI. He was selected on the Royal Academy of Engineering’s SME Leaders Programme and named on the Forbes 30 Under 30 innovators list.\nAlex's Sessions\nDriving Intelligence\nFrom self-driving cars to self-learning systems, Alex Kendall is rethinking how machines perceive and act in the world. The Wayve CEO joins us to explore how real-world autonomy is shaping the next chapter of AI, and why breakthroughs on the road may unlock progress far beyond it.\nAaron Levie is Chief Executive Officer, Cofounder at Box, which he launched in 2005 with CFO and cofounder Dylan Smith. He is the visionary behind the Box product and platform strategy, incorporating the best of secure content collaboration with an intuitive user experience suited to the way people work today. Aaron leads the company in its mission to transform the way people and businesses work so they can achieve their greatest ambitions. He has served on the Board of Directors since April 2005. Aaron attended the University of Southern California from 2003 to 2005 before leaving to found Box.\nAaron's Sessions\nSurvive, Scale, Reinvent: Lessons from a Cloud OG\nAaron Levie built Box before cloud was cool and he’s still standing while competitors have come and gone. Known for his sharp takes and startup instincts, Levie joins us to unpack how to keep innovating inside a public company, what AI really changes for enterprise software, and why reinvention is the name of the game in tech right now. Expect real talk and a playbook for building companies that last.\nEdo Liberty is the founder and CEO of Pinecone whose mission is to make AI knowledgeable. Pinecone is the leading vector database for building accurate and performant AI applications at scale in production. Prior to founding Pinecone, Edo was a Director of Research at AWS and Head of Amazon AI Labs where his team worked on data systems and services including SageMaker and OpenSearch. Before AWS, Edo was a Senior Research Director at Yahoo and Head of Yahoo’s Research Lab in New York. As an adjunct professor at Princeton and Tel Aviv University, Edo taught long-term memory in AI and data mining. His academic work focuses on numerical linear algebra, streaming algorithms, data mining, and mathematical foundations of machine learning. Edo holds a B.Sc in physics and computer science from Tel Aviv University, and a Ph.D. in computer science from Yale. He has authored more than 75 academic papers and patents.\nEdo's Sessions\nWhy the Next Frontier Is Search\nIn a world overflowing with data, finding what matters is everything. Pinecone founder Edo Liberty unpacks why infrastructure, not algorithms, might be the biggest unlock in AI, and what’s coming next in the race to power smarter applications at scale.\nTekedra N. Mawakana is the co-CEO of Waymo, an autonomous driving technology company. As co-CEO, Tekedra oversees the company’s strategy for the wide adoption of the Waymo Driver. She boasts 20+ years of experience advising consumer technology companies to advance their business interests globally. Tekedra currently serves on the Board of Directors for Intuit and the Advisory Council for Boom Technology. She is a social impact-focused angel investor and an Advisor and LP with the Operator Collective.\nTekedra's Sessions\nThe Self-Driving Reality Check\nAutonomous vehicles have been “just around the corner” for years—until now. Tekedra Mawakana, Co-CEO of Waymo, takes the Disrupt Stage to talk about where AVs actually stand, what it’s taken to get to real deployments, and why the race isn’t just about tech, it’s about trust. From regulation to rider experience to competition with Tesla and Tesla-adjacent hype, this conversation gets real about what’s next in mobility.\nMati Staniszewski is the co-founder and CEO of ElevenLabs, a research company building audio AI tools to solve audio intelligence and make digital interactions feel more human — with voice as the most direct path to that. Before founding ElevenLabs, Mati worked at Palantir as a Deployment Strategist, managing large-scale implementations across public and private sectors, and at BlackRock, where he helped launch the Aladdin Wealth platform.\nMati's Sessions\nSynthetic Voices and Real Impact\nFrom audiobooks to avatars, synthetic speech is having a moment. ElevenLabs is helping lead the charge. CEO Mati Staniszewski joins us to explore what it takes to build AI that speaks like us and how voice technology is reshaping the creative industries, accessibility, and entertainment.\nDr. Astro Teller currently oversees X, Alphabet’s moonshot factory for building breakthrough technologies and businesses designed to help tackle huge problems in the world. Before joining Google / Alphabet, Astro was the co-founding CEO of Cerebellum Capital, Inc, an investment management firm whose investments are continuously designed, executed, and improved by a software system based on techniques from statistical machine learning. Before his tenure as a business executive, Dr. Teller taught at Stanford University and was an engineer and researcher for Phoenix Laser Technologies, Stanford’s Center for Integrated Systems, and The Carnegie Group Incorporated. Dr. Teller holds a Bachelor of Science in computer science from Stanford University, Masters of Science in symbolic and heuristic computation, also from Stanford University, and a Ph.D. in artificial intelligence from Carnegie Mellon University, where he was a recipient of the Hertz fellowship.\nAstro's Sessions\nMoonshots, AI, and the Future of Alphabet\nFrom self-driving cars to internet balloons to AI-fueled breakthroughs, Astro Teller leads the lab where Alphabet incubates the nearly impossible. In this rare Disrupt stage appearance, he shares what’s actually working inside X, why “failing fast” isn’t just a mantra, and how moonshots may evolve in the AI age. If you think your startup is ambitious, wait until you hear what he’s launching next.\nMore reasons to attend Disrupt\nFind Your Ticket Type\nFind the ticket type that fits you best with up to $600+ savings. Groups can save up to 30%.\nLatest TechCrunch Disrupt 2025 news\nPress/Media Passes\nEvery year, hundreds of top media outlets cover TechCrunch Disrupt — from independent reporters to veteran TC hosts. It’s where the brightest voices in tech gather. Follow the steps below to apply for your free media pass.\nPartner with TechCrunch\nTechCrunch offers many ways for partners to engage directly with our attendees before, during, and after the event. Get in touch with us to learn more.\nLocation\nPartner with TechCrunch\nTechCrunch offers many ways for partners to engage directly with our attendees before, during, and after the event. Get in touch with us to learn more.\nLocation\nUpcoming TechCrunch events\n-\nGet on waitlist to get exclusive early access to limited tickets!\nTechCrunch Disrupt 2025 is innovation for every stage\n10,000+ tech leaders. 250+ sessions. 200+ speakers. 3 days. 6 stages. One epic experience of insights, strategy, and connections. Save up to $600+ before rates increase.\nSubscribe\nEvent Updates\nGet the latest event announcements, special discounts and other event offers.\nPartner with TechCrunch\nTechCrunch offers many ways for partners to engage directly with our attendees before, during, and after the event. Get in touch with us to learn more."
    },
    {
      "url": "https://techcrunch.com/2022/11/01/mlops-platform-galileo-lands-18m-to-launch-a-free-service/",
      "text": "Galileo, a startup launching a platform for AI model development, today announced that it raised $18 million in a Series A round led by Battery Ventures with participation from The Factory, Walden Catalyst, FPV Ventures, Kaggle co-founder Anthony Goldbloom and other angel investors. The new cash brings the company’s total raised to $23.1 million and will be put toward growing Galileo’s engineering and go-to-market teams and expanding the core platform to support new data modalities, CEO Vikram Chatterji told TechCrunch via email.\nAs the use of AI becomes more common throughout the enterprise, the demand for products that make it easier to inspect, discover and fix critical AI errors is increasing. According to one recent survey (from MLOps Community), 84.3% of data scientists and machine learning engineers say that the time required to detect and diagnose problems with a model is a problem for their teams, while over one in four (26.2%) admit that it takes them a week or more to detect and fix issues.\nSome of those issues include mislabeled data, where the labels used to train an AI system contain errors, like a picture of a tree mistakenly labeled “houseplant.” Others pertain to data drift or data imbalance, which happens when data evolves to make an AI system less accurate (think a stock market model trained on pre-pandemic data) or the data isn’t sufficiently representative of a domain (e.g., a data set of headshots has more light-skinned people than dark-skinned).\nGalileo’s platform aims to systematize AI development pipelines across teams using “auto-loggers” and algorithms that spotlight system-breaking issues. Built to be deployable in an on-premises environment, Galileo scales across the AI workflow — from predevelopment to postproduction — as well as unstructured data modalities like text, speech and vision.\nIn data science, “unstructured” data usually refers to data that’s not arranged according to a preset data model or schema, like invoices or sensor data. Atindriyo Sanyal — Galileo’s second co-founder — makes the case that the Excel- and Python script–based processes to ensure quality data is being fed into models are manual, error-prone and costly.\n“When inspecting their data with Galileo, users instantly uncover the long tail of data errors such as mislabeled data, underrepresented languages [and] garbage data that they can immediately take action upon within Galileo by removing, re-labeling or by adding additional similar data from production,” Sanyal told TechCrunch in an email interview. “It has been critical for teams that Galileo supports machine learning data workflows end to end — even when a model is in production, Galileo automatically lets teams know of data drifts, and surfaces the highest-value data to train with next.”\nThe co-founding team at Galileo spent more than a decade building machine learning products, where they say they faced the challenges of developing AI systems firsthand. Chatterji led product management at Google AI, while Sanyal spearheaded engineering at Uber’s AI division and was an early member of the Siri team at Apple. Third Galileo co-founder Yash Sheth is another Google veteran, having previously led the company’s speech recognition platform team.\nTech and VC heavyweights join the Disrupt 2025 agenda\nNetflix, ElevenLabs, Wayve, Sequoia Capital, Elad Gil — just a few of the heavy hitters joining the Disrupt 2025 agenda. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $600+ before prices rise.\nTech and VC heavyweights join the Disrupt 2025 agenda\nNetflix, ElevenLabs, Wayve, Sequoia Capital — just a few of the heavy hitters joining the Disrupt 2025 agenda. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise.\nGalileo’s platform falls into the burgeoning category of software known as MLOps, a set of tools to deploy and maintain machine learning models in production. It’s in serious demand. By one estimation, the market for MLOps could reach $4 billion by 2025.\nThere’s no shortage of startups going after the space, like Comet, which raised $50 million last November. Other vendors with VC backing include Arize, Tecton, Diveplane, Iterative and Taiwan-based InfuseAI.\nBut despite having launched just a few months ago, Galileo has paying customers from “high-growth” startups to Fortune 500 companies, Sanyal claims. “Our customers are using Galileo while building machine learning applications such as hate speech detection, caller intent detection at contact centers and customer experience augmentation with conversational AI,” he added.\nSanyal expects the launch of Galileo’s free offering — Galileo Community Edition — will boost sign-ups further. The Community Edition enables data scientists working on natural language processing to build machine learning models using some of the tools included in the paid version, Sanyal said.\n“With Galileo Community Edition, anyone can sign up for free, add a few lines of code while training their model with labeled data or during an inference run with unlabeled data to instantly inspect, find and fix data errors, or select the right data to label next using the powerful Galileo UI,” he added.\nSanyal declined to share revenue figures when asked. But he noted that San Francisco–based Galileo’s headcount has grown in size from 14 people in May to “more than” 20 people as of today."
    },
    {
      "url": "https://datumo.com/en/",
      "text": "Automatically generate golden question sets using high-quality default or custom metrics. Evaluate and enhance your LLM models and LLM-powered services with Datumo Eval.\nEvaluating your LLM model starts with building a high-quality LLM evaluation question dataset. With Datumo’s advanced agentic flow, simply upload your source document, and we’ll generate industry-specific high-quality datasets tailored to your needs.\nEvaluate and Revise Datasets\nSet default and custom metrics for your LLM evaluation question datasets. Datumo Eval automatically assesses question quality and delivers domain-specific, intent-aligned results using our advanced agentic flow.\nAgentic Flow & Human Alignment\nMultiple LLM Agents collaborate in question generation and evaluation to deliver more accurate and high-quality results. Experience Human Alignment that minimizes gaps between evaluation intent and automated outcomes.\nWhy Datumo?\nAsia's First & Largest Red Team Challenge\nIn partnership with the Korean government, Datumo hosted the 2024 AI Safety Conference with speakers from Cohere, Stability AI, and others. The event featured Asia's first Red Team Challenge\nWorld's First Methodology\nKorNAT*: The first LLM evaluation dataset on Korean social values and common knowledge, using a pioneering methodology. The paper, with Datumo as the 1st & 3rd authors, was published at ACL 2024.\n*LLM Alignment Benchmark for Korean Social Values and Common Knowledge\nTechnology Patent\nWith expertise in LLM technology, Datumo has filed 47 patent applications in total and registered 16 patents as of 2024.\nFor Your Industry\nE-commerce\nEvaluate the customization accuracy of product recommendation LLMs to increase customer conversion rates\nFinance\nVerify the accuracy and reliability of customer inquiry response LLMs to enhance the quality of financial services\nEducation\nValidate the response quality of personalized learning support LLMs to improve learning efficiency\nLegal\nAssess the accuracy and reliability of legal advisory LLMs to minimize legal risks\nHealthcare\nEvaluate the safety and accuracy of healthcare advisory LLMs to enhance patient trust\nCustomer Service\nTest customer service LLMs for consistency and reliability to improve experience\nEnhance the performance of your LLM-based services with Datumo Eval. Create questions tailored to your industry and intent, and systematically analyze model performance using custom metrics."
    },
    {
      "url": "https://open.datumo.com/en/",
      "text": "Open Datasets for Data-Centric AI The Data for Smarter AI See more Use cases > Shape Upstage KLUEKorean Language Understanding Evaluation Benchmark View Project Cochl. Background noise datasetCreating ears for artificial intelligence View Project POSTECH InstaOrderApproximately 1.45 million combinations of positions of two objects View Project Wesee Datasets for crosswalks and currencyAI algorithm development based on video recognition View Project Fitogether Soccer field images datasetSports IT solution based on GPS View Project Designers’ private study group Mobbin DatasetAI tools for designers View Project Marqvision Merchandise images datasetsCollection and bounding-box annotation of images of items according to ten categories View Project GIST Gesture datasetGestures of Korean gestures, a means of communication for supplementing the disabled View Project Actionpower Voice verification datasetCollect and process 1,196 sets of voice data to be used in voice text and artificial intelligence dictation solution 'Daglo' View Project Dingbro Domestic waste object detection datasetSolution that provides the basis for automated waste disposal and classification View Project HUMANE Lab Korean hate speech analysis datasetA Korean offensive language dataset that classifies ethically problematic hate speech to determine the ethicality of sentences. View Project TILDE Digital numeric datasetBiometric information display labeling and transcription View Project Computer Vision Lab Food image datasetA food image dataset with labeled ingredient information View Project RebuilderAI Real-world datasetA real-world dataset for object material recognition View Project magentarobotics Posterior body image datasetAn image dataset of the posterior side of the human body is essential for the development of a massage robot platform View Project Shape"
    },
    {
      "url": "https://techcrunch.com/2025/06/18/openai-drops-scale-ai-as-a-data-provider-following-meta-deal/",
      "text": "OpenAI is phasing out its work with Scale AI and cutting ties with the data provider following Meta’s deal with the startup, an OpenAI spokesperson told Bloomberg on Wednesday.\nSarah Friar, the chief financial officer of OpenAI, previously suggested the company would continue its work with Scale AI. Now, it appears OpenAI has changed its tone.\nOpenAI said it was already winding down its work with Scale AI ahead of Meta’s announcement last week that it was investing billions of dollars in the startup and bringing on CEO Alexandr Wang. An OpenAI spokesperson told Bloomberg that OpenAI had been seeking other providers for more specialized data to develop increasingly advanced AI models.\nOpenAI’s decision to cut ties raises questions about Scale AI’s core data labeling business. Last week, Reuters reported that Google was discussing plans to drop Scale AI as a data provider as well.\nAs rumors swirled about Meta’s deal with Wang, some of Scale AI’s competitors said they received an influx of interest from AI model providers looking for “neutral” partners.\nIn a blog post published Wednesday, Scale AI’s general counsel tried to squash the idea that Meta would receive preferential treatment following this deal. Scale AI’s executives said it would not share confidential information from other customers with Meta, and that Wang would not be involved in day-to-day operations.\nDespite those claims, it seems that Scale AI’s biggest customers are already pivoting away from the data provider — meaning the startup may have no choice but to change up its business.\nTech and VC heavyweights join the Disrupt 2025 agenda\nNetflix, ElevenLabs, Wayve, Sequoia Capital, Elad Gil — just a few of the heavy hitters joining the Disrupt 2025 agenda. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $600+ before prices rise.\nTech and VC heavyweights join the Disrupt 2025 agenda\nNetflix, ElevenLabs, Wayve, Sequoia Capital — just a few of the heavy hitters joining the Disrupt 2025 agenda. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise.\nIn a separate blog post published on Wednesday, Scale AI’s interim CEO Jason Droege said the company would “double down” on its applications business, which involves building custom AI applications for governments and enterprises."
    },
    {
      "url": "https://techcrunch.com/2025/06/13/scale-ai-confirms-significant-investment-from-meta-says-ceo-alexandr-wang-is-leaving/",
      "text": "Data-labeling company Scale AI confirmed on Friday that it has received a “significant” investment from Meta that values the startup at $29 billion. The startup also said its co-founder and CEO Alexandr Wang is stepping down from his role to join Meta and help the bigger company with its AI work.\nReports indicate that Meta invested about $14.3 billion for a 49% stake in the startup, which produces and labels data that’s used to train the large language models that underpin a significant portion of generative AI development.\nMeta confirmed the investment. “Meta has finalized our strategic partnership and investment in Scale AI. As part of this, we will deepen the work we do together producing data for AI models and Alexandr Wang will join Meta to work on our superintelligence efforts. We will share more about this effort and the great people joining this team in the coming weeks,” a spokesperson for Meta told TechCrunch.\nJason Droege, Scale’s current chief strategy officer, will hop in as interim CEO. Scale AI noted that Meta’s investment will be used to pay investors and shareholders, as well as to fuel growth. The company emphasized that it remains an independent entity. Wang will continue at the data-labeling firm as a director on its board.\nAs my colleague Max Zeff wrote on Wednesday, this investment is a way for Meta to improve its AI efforts as its rivals Google, OpenAI, and Anthropic rush ahead, and the social media company’s own AI model releases trail the competition. Plus, according to data by SingalFire, the company lost 4.3% of its top talent to other AI labs last year.\nFor the last several years, leading AI labs such as OpenAI have relied on Scale AI to produce and label data that’s used to train models. In recent months, Scale AI and its data annotation competitors have started hiring highly skilled people, such as PhD scientists and senior software engineers, to generate high-quality data for frontier AI labs.\nScale AI raised $1 billion last year from investors including Amazon and Meta at a valuation of $13.8 billion."
    }
  ],
  "argos_summary": "A recent McKinsey report reveals that many organizations feel unprepared to safely utilize generative AI, with concerns about explainability being a significant issue. In response, South Korean startup Datumo has raised $15.5 million to enhance AI safety through tools that facilitate model testing and monitoring. Meanwhile, the AI observability market is heating up, with companies like Arize AI and Galileo also securing funding to improve AI model evaluation and error detection, highlighting the growing demand for reliable AI solutions.",
  "argos_id": "4ZDTW2M1I"
}