{
  "url": "https://www.businessinsider.com/guides/tickets/where-to-buy-twice-tickets-concert-tour",
  "authorsByline": "Mariska Armijo",
  "articleId": "881cd7d3075e466c9b563cfe80f913a1",
  "source": {
    "domain": "businessinsider.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://i.insider.com/689a3f04a17a8c5b4052a835?width=1200&format=jpeg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T19:15:30+00:00",
  "addDate": "2025-08-11T20:57:19.258247+00:00",
  "refreshDate": "2025-08-11T20:57:19.258248+00:00",
  "score": 1.0,
  "title": "Twice's 6th world tour kicked off last month — Here's where to find tickets",
  "description": "After announcing the This Is For world tour, tickets have been in high demand for the K-pop girl group, Twice. Here's where to find them.",
  "content": "Twice fans, known as Once, are overjoyed as Twice has started their 6th world tour. The group announced the first part of the This Is For world tour, which will bring the girl group to major cities across Asia and Australia. Fans in other parts of the globe don’t need to worry, however, as more dates and locations will be added to the tour for 2026 when they announce part two. I’ve gathered everything we know about how to get Twice tickets below, and be sure to keep tabs on this story for updated details as they go live.The This Is For world tour is in support of their newest album of the same name. This Is For album is Twice’s fourth studio album and was released on May 19, 2025. The album contains 14 songs, five of which are sub-unit tracks, songs performed by only a few of the girls as opposed to the entire group.Twice is a South Korean girl group formed by JYP Entertainment. It debuted in October 2015 after the group was formed on the reality survival show Sixteen. The girl group has nine members: Jihyo, Nayeon, Jeongyeon, Momo, Sana, Mina, Dahyun, Chaeyoung, and Tzuyu.If you’re looking for how to get tickets to Twice’s 2025 tour, then we’ve got you covered. Here’s our breakdown of the 2025 This Is For World Tour schedule, purchasing details, and price comparisons between resale and original tickets. You can also browse concert and ticket specifics at your convenience on StubHub and Vivid Seats.The This Is For world tour started in Korea, and the next concert is scheduled for August 23 in Aichi, Japan. The tour will see Twice in major cities across Asia through the end of summer and start of fall, with four shows scheduled in Australia in early November before the girls return to Asia for the rest of the year. The last known concert date for the tour is December 14 in Bangkok; however, part two of the tour has not been announced yet, so we don’t currently know when or where the tour will come to a close.You can buy standard original tickets for Twice’s This IS For world tour on Live Nation. For each concert date, ticket presale goes live the day before that can be registered for a day in advance.Original tickets have sold out for each concert date so far, which is a trend we expect to continue, so it is recommended to sign up for presale if you’re looking to nab original tickets.Tickets to Twice’s 2025 concert tour can also be purchased through verified resale ticket vendors like StubHub and Vivid Seats. Given how quickly original tickets have been selling, you may find better luck with seating variety and availability on these sites after the seats go live.Original ticket sales have not gone live for all ticket dates, so not all dates are available on StubHub yet. It’s also important to note that resale tickets for Twice's 2025 shows in Asia and Australia aren’t available to purchase on Vivid Seats.Ticket prices for the original This Is For world tour aren’t available to check before ticket sales start at each location; however, on average, tickets to see Twice perform live have historically ranged anywhere between $200 and $300 or $500 to $600, depending on date and location.Of the tickets available on StubHub as of writing, the lowest-cost tickets to Twice’s Japan shows range from $294 for the August 23 show in Aichi to $459 for the Fukuoka show on August 30.Twice does not have any opening acts for its This Is For world tour, which is standard for K-pop concerts. When the show time begins, the girls of Twice will appear onstage.All of the concert dates announced so far for the This Is For world tour are international concerts. For part one of the tour, there are 15 more shows in major cities across Asia and four shows scheduled for major cities in Australia. We don’t know yet what additional countries will be added to the tour for part two, but we will provide more information once it becomes available.Twice consists of nine members who have been with the group since it formed in 2015 through the TV survival program Sixteen. The members include:",
  "medium": "Article",
  "links": [],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Twice tickets",
      "weight": 0.121585056
    },
    {
      "name": "Original tickets",
      "weight": 0.10134055
    },
    {
      "name": "original tickets",
      "weight": 0.10134055
    },
    {
      "name": "standard original tickets",
      "weight": 0.098735906
    },
    {
      "name": "resale tickets",
      "weight": 0.09864913
    },
    {
      "name": "Original ticket sales",
      "weight": 0.098073415
    },
    {
      "name": "ticket presale",
      "weight": 0.096240215
    },
    {
      "name": "Ticket prices",
      "weight": 0.09477189
    },
    {
      "name": "ticket sales",
      "weight": 0.09376699
    },
    {
      "name": "Tickets",
      "weight": 0.0928461
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.97314453125
    },
    {
      "name": "/Arts & Entertainment/Events & Listings/Concerts & Music Festivals",
      "score": 0.8505859375
    },
    {
      "name": "/Arts & Entertainment/Music & Audio/Pop Music",
      "score": 0.7998046875
    },
    {
      "name": "/Arts & Entertainment/Music & Audio/World Music",
      "score": 0.37255859375
    },
    {
      "name": "/Arts & Entertainment/Music & Audio/Urban & Hip-Hop",
      "score": 0.327880859375
    }
  ],
  "sentiment": {
    "positive": 0.2375992,
    "negative": 0.13632675,
    "neutral": 0.6260741
  },
  "summary": "South Korean girl group, Twice, has begun their 6th world tour, This Is For, which will take place across Asia and Australia. The first part of the tour will be in support of their latest album, which was released on May 19, 2025. Additional dates and locations will be added to the tour for 2026 when they announce part two. Tickets for the 2025 tour can be purchased through verified resale ticket vendors like StubHub and Vivid Seats. The last known concert date for the tour is December 14 in Bangkok. However, the tour's end date has not yet been announced.",
  "shortSummary": "Twice’s 6th world tour, This Is For, has begun in Korea, with multiple cities across Asia and Australia, and ticket prices can vary depending on location.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "0ab329554d574eaea332a5024a6b63cc",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Twice fans, known as Once, are excited as the group embarks on their 6th world tour, 'This Is For', supporting their latest album released on May 19, 2025. The tour will cover major cities in Asia and Australia, with additional dates expected for 2026. Ticket sales have been competitive, with original tickets selling out quickly, prompting fans to consider verified resale options. The tour features 15 shows in Asia and four in Australia, with the final known concert scheduled for December 14 in Bangkok.",
  "argos_id": "50VCT1AQ8"
}