{
  "url": "https://www.latimes.com/business/story/2025-08-11/us-will-get-a-15-cut-of-nvidia-and-amd-chip-sales-to-china-under-a-new-unusual-agreement",
  "authorsByline": "the Associated Press",
  "articleId": "6dacca59dd354722ae7d6844c73da37c",
  "source": {
    "domain": "latimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "CA",
      "city": "Los Angeles",
      "coordinates": {
        "lat": 34.0536909,
        "lon": -118.242766
      }
    }
  },
  "imageUrl": "https://ca-times.brightspotcdn.com/dims4/default/90b799b/2147483647/strip/true/crop/4432x2327+0+314/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F8f%2F4b%2F80880e8c66f9512988584f771c97%2F08c6f9e5bca64854a2ee767caedbbae8",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T18:59:07.255000+00:00",
  "addDate": "2025-08-11T20:49:14.947005+00:00",
  "refreshDate": "2025-08-11T20:49:14.947008+00:00",
  "score": 1.0,
  "title": "U.S. will get a 15% cut of Nvidia and AMD chip sales to China under a new, unusual agreement",
  "description": "Nvidia and AMD agreed to share 15% of their revenues from chip sales to China with the U.S. government, President Donald Trump confirmed at a press conference on Monday",
  "content": "Nvidia CEO Jensen Huang poses for a photo before President Donald Trump speaks during an AI summit at the Andrew W. Mellon Auditorium, Wednesday, July 23, 2025, in Washington.\n\nNvidia and AMD have agreed to share 15% of their revenues from chip sales to China with the U.S. government, as part of a deal to secure export licenses for the semiconductors.\n\nThe Trump administration halted the sale of advanced computer chips to China in April over national security concerns, but Nvidia and AMD revealed in July that Washington would allow them to resume sales of the H20 and MI308 chips, which are used in artificial intelligence development.\n\nPresident Trump confirmed the terms of the unusual arrangement in a Monday press conference while noting that he originally wanted 20% of the sales revenue when Nvidia asked to sell the “obsolete” H20 chip to China. The president credited Nvidia CEO Jensen Huang for negotiating him down to 15%.\n\n“So we negotiated a little deal. So he’s selling a essentially old chip,” Trump said.\n\nNvidia did not comment about the specific details of the agreement or its quid pro quo nature, but said they would adhere to the export rules laid out by the administration.\n\n“We follow rules the U.S. government sets for our participation in worldwide markets. While we haven’t shipped H20 to China for months, we hope export control rules will let America compete in China and worldwide,” Nvidia wrote in a statement to the AP. “America cannot repeat 5G and lose telecommunication leadership. America’s AI tech stack can be the world’s standard if we race.”\n\nAMD did not immediately reply to a request for comment.\n\nThe top Democrat on a House panel focusing on competition with China raised concerns over the reported agreement, calling it “a dangerous misuse of export controls that undermines our national security.”\n\nRep. Raja Krishnamoorthi, the ranking member of the House Select Committee on China, said he would seek answers about the legal basis for this arrangement and demand full transparency from the administration.\n\n“Our export control regime must be based on genuine security considerations, not creative taxation schemes disguised as national security policy,” he said. “Chip export controls aren’t bargaining chips, and they’re not casino chips either. We shouldn’t be gambling with our national security to raise revenue.”\n\nDerek Scissors, senior fellow and China expert at the conservative American Enterprise Institute, questioned the constitutionality of the deal and also warned against risking national security for revenue.\n\n“There’s no precedent for this, probably because export taxes are unconstitutional, ” said Derek Scissors, senior fellow and China expert at the conservative American Enterprise Institute. “They call it a fee, but 15% of sales revenue is about a standard a tax as it comes. For this reason, I don’t think the ‘arrangement’ is at all durable. ‘’\n\n“If it were to last, it has two possible implications. First, there’s a possible export tax that high-profile companies and goods must consider. Or the tax only applies in exceptional situations, such as changing export controls. Then we’d risk national security for the sake of tax revenue, which is effectively the same as cutting the defense budget,” Scissors said.\n\nBack in July, Nvidia argued that tight export controls around their chip sales would cost the company an extra $5.5 billion. They’ve argued that such limits hinder U.S. competition in a sector in one of the world’s largest markets for technology, and have also warned that U.S. export controls could end up pushing other countries toward China’s AI technology.\n\nCommerce Secretary Howard Lutnick told CNBC in July that the renewed sale of Nvidia’s chips in China was linked to a trade agreement made between the two countries on rare earth magnets.\n\nRestrictions on sales of advanced chips to China have been central to the AI race between the world’s two largest economic powers, but such controls are also controversial. Proponents argue that these restrictions are necessary to slow China down enough to allow U.S. companies to keep their lead. Meanwhile, opponents say the export controls have loopholes — and could still spur innovation. The emergence of China’s DeepSeek AI chatbot in January particularly renewed concerns over how China might use advanced chips to help develop its own AI capabilities.\n\nAssociated Press writers Josh Boak, Shawn Chen, Didi Tang and Paul Wiseman contributed to the reporting.",
  "medium": "Article",
  "links": [
    "https://constitution.congress.gov/browse/essay/artI-S9-C5-1/ALDE_00013596/#:~:text=Article%20I%2C%20Section%209%2C%20Clause,Articles%20exported%20from%20any%20State",
    "https://www.latimes.com/business/story/2025-08-07/what-to-know-about-trumps-newest-and-most-sweeping-tariffs",
    "https://www.latimes.com/world-nation/story/2025-07-30/trump-announces-25-tariff-on-india-and-unspecified-penalties-for-buying-russian-oil",
    "https://www.latimes.com/world-nation/story/2025-07-30/trump-reaches-trade-agreement-with-south-korea",
    "https://www.cnbc.com/2025/07/15/howard-lutnick-says-china-is-only-getting-nvidias-4th-best-ai-chip.html"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Chip export controls",
      "weight": 0.10732284
    },
    {
      "name": "U.S. export controls",
      "weight": 0.10084003
    },
    {
      "name": "export controls",
      "weight": 0.09585936
    },
    {
      "name": "export control rules",
      "weight": 0.09462065
    },
    {
      "name": "chip sales",
      "weight": 0.09177294
    },
    {
      "name": "tight export controls",
      "weight": 0.09085235
    },
    {
      "name": "China expert",
      "weight": 0.08792581
    },
    {
      "name": "China",
      "weight": 0.08695083
    },
    {
      "name": "sales revenue",
      "weight": 0.0797269
    },
    {
      "name": "national security concerns",
      "weight": 0.07810213
    }
  ],
  "topics": [
    {
      "name": "AI"
    }
  ],
  "categories": [
    {
      "name": "Business"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Technology News",
      "score": 0.98095703125
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.92578125
    },
    {
      "name": "/Computers & Electronics/Computer Hardware/Computer Components",
      "score": 0.66796875
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.46630859375
    }
  ],
  "sentiment": {
    "positive": 0.070237726,
    "negative": 0.6049863,
    "neutral": 0.32477593
  },
  "summary": "Nvidia and AMD have agreed to share 15% of their revenues from chip sales to China with the U.S. government as part of a deal to secure export licenses for the semiconductors. The agreement was confirmed by President Donald Trump, who initially wanted 20% of the sales revenue when Nvidia asked to sell the \"obsolete\" H20 chip to China. The sale of advanced computer chips to China was halted in April due to national security concerns. However, Nvidia and AMD were allowed to resume sales of the H20 and MI308 chips, which are used in artificial intelligence development. Critics argue that these restrictions are necessary to slow down China's lead in the AI race, but opponents argue that they could still lead to innovation and push other countries towards China's AI technology.",
  "shortSummary": "Nvidia and AMD agreed to share 15% of chip sales revenue with the U.S. government, amid controversy over national security and export controls.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "fded48aebbf54136a671c0b9ced3900d",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.cnbc.com/2025/07/15/howard-lutnick-says-china-is-only-getting-nvidias-4th-best-ai-chip.html",
      "text": "Commerce Secretary Howard Lutnick on Tuesday said the Trump administration reversed course on allowing Nvidia to sell its AI chips to China because the U.S. company will not be giving over its best technology.\nLutnick made the remark speaking with CNBC's Brian Sullivan, saying that Nvidia wants to sell China its \"fourth best\" chip, which is slower than the fastest chips that U.S. companies use.\n\"We don't sell them our best stuff, not our second best stuff, not even our third best,\" Lutnick said.\nNvidia said Monday night that it would soon resume sales of the H20 chip to China after the Trump administration signaled that it would grant the chipmaker necessary export licenses.\nLutnick said that the administration said that the renewed sale of H20 chips to China was linked to a rare earths magnet deal. He said it was in U.S. interests to have Chinese companies using American technology so they continue to use an American \"tech stack.\"\n\"The fourth one down, we want to keep China using it,\" Lutnick said. \"We want to keep having the Chinese use the American technology stack, because they still rely upon it.\"\nSimilarly, Nvidia CEO Jensen Huang has said in recent weeks that the U.S. should continue selling his chips to China so Chinese companies don't invest in homegrown infrastructure. Huang on Sunday also said that the Chinese military wouldn't use Nvidia chips anyway, and previously signaled that China's Huawei is a legitimate competitor.\n\"The idea is the Chinese are more than capable of building their own,\" Lutnick said. \"You want to keep one step ahead of what they can build, so they keep buying our chips.\"\nThe reversal is a major win for Nvidia. Huang had previously said the Trump administration's decision to require a license for the H20 chip in April \"effectively closed\" the China market. Nvidia said it could have sold $8 billion in H20 chips in the current quarter before sales were stopped.\nThe administration reversed its decision after President Donald Trump met with Huang in Washington last week.\n\"You want to sell the Chinese enough that their developers get addicted to the American technology stack,\" Lutnick said. \"That's the thinking.\"\nThe H20 chip was introduced in 2022 in response to Biden administration export controls. It's based on the same underlying technology as Nvidia's Hopper-generation chips, which are sold in the U.S. as finished systems using H100 or H200 chips.\nThe U.S. chipmaker took some features out of the H20 in order to sell it to China, including fewer graphics processing unit cores and lower bandwidth connecting separate parts of the chip. But the success of the DeepSeek R1 model suggested that there were many Chinese companies that were just fine with the slowed-down chips. The China-specific H20 is behind Nvidia's Blackwell chips, the H100 and the H200, Lutnick said.\nNvidia says that it releases new artificial intelligence chips every year and that serious AI developers should always try to get the latest and greatest versions because the technology is improving so quickly.\nThe best AI chips broadly available from clouds and system makers today are called Blackwell, and come as a GB200 chip with a paired central processing unit as well as B100 and B200 versions. Nvidia also makes a range of Blackwell-based chips for gaming and graphics that can be used for AI, but they're generally weaker than the biggest chips designed for data centers.\nA successor, called Blackwell Ultra, is only now starting to be installed in data centers, and it's expected to ramp in volume over the next year. In 2027, Nvidia will release \"Vera Rubin\" chips."
    },
    {
      "url": "https://www.latimes.com/world-nation/story/2025-07-30/trump-announces-25-tariff-on-india-and-unspecified-penalties-for-buying-russian-oil",
      "text": "Trump announces 25% tariff on India and unspecified penalties for buying Russian oil\n- Share via\nWASHINGTON — President Trump said Wednesday that he will impose a 25% tariff on goods from India, plus an additional import tax because of India’s purchasing of Russian oil.\nIndia “is our friend,” Trump said on his Truth Social platform, but its tariffs “are far too high” on U.S. products.\nThe Republican president added that India buys military equipment and oil from Russia, which he said has enabled the war in Ukraine. As a result, he intends to charge an additional “penalty” starting on Friday as part of the launch of his administration’s revised tariffs on multiple countries.\nThe new tariffs could put India at a disadvantage in the U.S. market relative to Vietnam, Bangladesh and, possibly, China, said Ajay Sahai, director general of the Federation of Indian Export Organisations.\n“We are back to square one as Trump hasn’t spelled out what the penalties would be in addition to the tariff,” Sahai said. “The demand for Indian goods is bound to be hit.”\nThe announcement comes after a slew of negotiated trade frameworks with the European Union, Japan, the Philippines and Indonesia — all of which Trump said would open markets for American goods while enabling the U.S. to raise tax rates on imports. The president views tariff revenues as a way to help offset the budget deficit increases tied to his recent income tax cuts and generate more domestic factory jobs.\nWhile Trump has effectively wielded tariffs as a cudgel to reset the terms of trade, the economic impact is uncertain as most economists expect a slowdown in U.S. growth and greater inflationary pressures as some of the costs of the taxes are passed along to domestic businesses and consumers.\nThere is also the possibility of more tariffs coming on trade partners with Russia as well as on pharmaceutical drugs and computer chips.\nKevin Hassett, director of the White House National Economic Council, told reporter Wednesday that Trump and U.S. Trade Representative Jamieson Greer would announce the Russia-related tariff rates on India at a later date.\nTrump’s approach of putting a 15% tariff on America’s long-standing allies in the EU is also generating pushback, possibly causing European partners as well as Canada to seek alternatives to U.S. leadership on the world stage.\nFrench President Emmanuel Macron said Wednesday in the aftermath of the trade framework that Europe “does not see itself sufficiently” as a global power, saying in a Cabinet meeting that negotiations with the U.S. will continue as the agreement gets formalized.\n“To be free, you have to be feared,” Macron said. “We have not been feared enough. There is a greater urgency than ever to accelerate the European agenda for sovereignty and competitiveness.”\nWashington has long sought to develop a deeper partnership with New Delhi, which is seen as a bulwark against China. Indian Prime Minister Narendra Modi has established a good working relationship with Trump, and the two leaders are likely to further boost cooperation between their countries.\nThe Census Bureau reported that the U.S. ran a $45.8-billion trade imbalance in goods with India last year, meaning it imported more than it exported.\nAt a population exceeding 1.4 billion people, India is the world’s largest country and a possible geopolitical counterbalance to China. India and Russia have close relations, and New Delhi has not supported Western sanctions on Moscow over its war in Ukraine.\nThe new tariffs on India could complicate its goal of doubling bilateral trade with the U.S. to $500 billion by 2030. The two countries have had five rounds of negotiations for a bilateral trade agreement. While U.S. has been seeking greater market access and zero tariff on almost all its exports, India has expressed reservations on throwing open sectors such as agriculture and dairy, which employ a bulk of the country’s population for livelihood, Indian officials said.\nWhen Trump in February met with Modi, the U.S. president said that India would start buying American oil and natural gas.\nTrump discussed his policies on trade and tariffs with reporters accompanying him Tuesday on the flight home following a five-day visit to Scotland. He declined to comment then when asked about reports that India was bracing for a U.S. tariff rate of at least 25%, saying, “We’re going to see.”\nTrump also said the outlines of a trade framework with India had not yet been finalized. Once back at the White House on Tuesday, Trump indicated that there were no plans to announce new tariff rates on Wednesday, a claim that turned out to be inaccurate.\nBoak and Roy write for the Associated Press. Roy reported from New Delhi. AP writers Samuel Petrequin in Paris and Darlene Superville contributed to this report."
    },
    {
      "url": "https://www.latimes.com/business/story/2025-08-07/what-to-know-about-trumps-newest-and-most-sweeping-tariffs",
      "text": "What to know about Trump’s newest and most sweeping tariffs\n- Share via\nBANGKOK — President Trump on Thursday imposed once unthinkably high U.S. taxes on imports from dozens of countries, part of his campaign to turn one of the world’s most open economies into a fortress bristling with barriers to trade.\nThe taxes — tariffs — that took effect at midnight apply to products from 66 countries, the European Union, Taiwan and the Falkland Islands.\nTrump believes the tariffs will protect U.S. industry from foreign competition, encourage companies to build factories and hire workers in the United States and raise revenue to pay for the massive tax cuts he signed into law July 4.\n“Growth is going to be unprecedented,” Trump said Wednesday.\nBut mainstream economists and policy analysts warn that tariffs are paid by importers in the United States who will try to pass along the cost through higher prices to their customers, businesses and consumers alike; make the economy less efficient and innovative by shielding domestic companies from foreign competition; and threaten U.S. relationships with longstanding allies and trading partners.\nIndeed, the economic damage is already starting show.\nHere’s what to know:\nMany tariffs could have been higher\nThe levies that took effect Thursday are a revised version of what Trump called ” reciprocal tariffs ” announced on April 2. Those earlier threats included import taxes of up to 50% on goods from countries that have a trade surplus with the United States, along with 10% “baseline’’ taxes on almost everyone else. The move triggered sell-offs in financial markets, and Trump backtracked to give countries a chance to negotiate.\nSome of them did, caving in to Trump’s demands to accept high tariffs to ward off even higher ones. The United Kingdom agreed to 10% tariffs and the European Union, South Korea and Japan accepted U.S. tariffs of 15%. Those are well above the low single-digit rates they paid last year, but down from the 30% Trump had ordered for the EU and the 25% he ordered for Japan in April.\nThailand, Pakistan, South Korea, Vietnam, Indonesia and the Philippines cut deals with Trump, settling for rates of about 20%.\nIndonesia views its 19% tariff deal as a leg up against exporters in other countries that will have to pay slightly more, said Fithra Faisal Hastiadi, a spokesperson in the Indonesian president’s office. “We were competing against Vietnam, India, Bangladesh, Sri Lanka and China ... and they are all subject to higher reciprocal tariffs,” Hastiadi said. “We believe we will stay competitive.”\nTrump dictated terms to countries\nFor countries that didn’t or couldn’t reach a deal, Trump dictated terms himself, plastering tariffs ranging from 10% on the Falkland Islands to 41% on Syria. Countries in Africa and Asia are mostly facing lower rates than the ones Trump decreed in April. Tiny Lesotho in southern Africa, for instance, ended up with a 15% tariff instead of the 50% Trump originally announced.\nIndia also has no broad trade agreement with Trump. On Wednesday, Trump he signed an executive order placing an extra 25% tariff for its purchases of Russian oil, bringing combined U.S. tariffs to 50%. India has stood firm, saying it began importing oil from Russia because traditional supplies were diverted to Europe after the outbreak of the Ukraine conflict.\nImpoverished Laos and war-torn Myanmar face 40% rates. Trump whacked Brazil with a 50% import tax largely because he’s unhappy with its treatment of former Brazilian President Jair Bolsonaro. South Africa said the steep 30% rate Trump has ordered on the exporter of precious gems and metals has put 30,000 jobs at risk and left the country scrambling to find new markets outside the United States.\nEven wealthy Switzerland is under the gun. Swiss officials were visiting Washington this week to try to stave off a whopping 39% tariff on U.S. imports of its chocolate, watches and other products.\nOverall, the average U.S. tariff rate has risen from around 2.5% before Trump returned to the White House to 18.6% — the highest since 1933 — the Budget Lab at Yale University reported Thursday.\nCanada, Mexico have own arrangements\nGoods that comply with the 2020 United States-Mexico-Canada Agreement that Trump negotiated during his first term are excluded from the tariffs.\nSo, even though U.S. neighbor and ally Canada was hit by a 35% tariff after it defied Trump — a staunch supporter of Israeli Prime Minister Benjamin Netanyahu — by saying it would recognize a Palestinian state, most of its exports to the U.S. remain duty free.\nCanada’s central bank says 100% of energy exports and 95% of other exports are compliant with the agreement since regional rules mean Canadian and Mexico companies can claim preferential treatment.\nThe slice of Mexican exports not covered by the USMCA is subject to a 25% tariff, down from an earlier rate of 30%, during a 90-day negotiating period that began last week.\nMeanwhile, Trump has yet to announce whether he will extend an Aug. 12 deadline for reaching a trade agreement with China that would forestall earlier threats of tariffs of up to 245%.\nTreasury Secretary Scott Bessent said the president is deciding about another 90-day delay to allow time to work out details of an agreement setting tariffs on most products at 50%, including extra import duties related to illicit trade in fentanyl.\nHigher import taxes on small parcels from China have hurt smaller factories and layoffs have accelerated, leaving some 200 million workers reliant on “flexible work” — the gig economy — for their livelihoods, the government estimates.\nStill, China has shown that it has leverage to resist Trump’s threats: It can withhold exports of rare earth minerals that companies need for everything from wind turbines to electric vehicle batteries.\nConsiderable uncertainty remains\nDetails of the deals reached in a frenzy of negotiations leading up to Trump’s August deadline have not been published — and are already subject to disagreement.\nJapanese Prime Minister Shigeru Ishiba, for instance, told reporters that Japan is asking the U.S. government to immediately correct tariffs that are not consistent with their agreement.\n“The uncertainty about whether Trump was bluffing with his tariff threats and simply using those threats as a negotiating tool has been resolved,” said Eswar Prasad, professor of trade policy and economics at Cornell University. “But the uncertainty about the tariffs themselves, including the rates and what countries and products will be covered, is still unresolved in any durable way and remains subject to Trump’s whims.\n“Even the deals that have ostensibly been negotiated lack clarity about their details and are far from settled.”\nTrump also is threatening new tariffs — including levies of 200% or more on pharmaceuticals and 100% on computer chips.\nTrump’s trade agenda also is under attack in court, adding to the uncertainty.\nA specialized trade court in New York ruled in May that Trump overstepped his authority in imposing April 2 tariffs and earlier ones on Canada, China and Mexico. An appeals court, which allowed the government to continue collecting tariffs while the case moves through the judicial system, now has the case, which is expected to eventually go to the Supreme Court.\nIn a hearing last week, the judges sounded skeptical about the Trump administration’s authority to declare a national emergency to justify the tariffs.\nKurtenbach and Wiseman write for the Associated Press. Wiseman reported from Washington. The AP’s Niniek Karmini in Jakarta and Aniruddha Ghosal in Hanoi contributed."
    }
  ],
  "argos_summary": "Nvidia and AMD have agreed to share 15% of their revenues from chip sales to China with the U.S. government to secure export licenses for their semiconductors, following a halt on advanced chip sales due to national security concerns. President Trump confirmed the arrangement, which has raised concerns among lawmakers about its implications for national security and the legality of using export controls as a revenue mechanism. Critics argue that this deal could undermine U.S. export control policies and potentially jeopardize national security.",
  "argos_id": "5LXJQX4FN"
}