{
  "url": "https://www.nytimes.com/athletic/6542720/2025/08/12/leeds-united-breakthrough-player-harry-gray/",
  "authorsByline": "Beren Cross",
  "articleId": "2eb42f2a34fa4a7f926978b50fa42aed",
  "source": {
    "domain": "nytimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "AZ",
      "county": "Pima County",
      "city": "Tucson",
      "coordinates": {
        "lat": 32.1988848,
        "lon": -110.8218543
      }
    }
  },
  "imageUrl": "https://static01.nyt.com/athletic/uploads/wp/2025/08/11125542/Harry-Gray-Leeds-United-player-to-watch-scaled.jpg?width=1200&height=630&fit=cover",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T04:23:59+00:00",
  "addDate": "2025-08-12T04:32:39.647070+00:00",
  "refreshDate": "2025-08-12T04:32:39.647073+00:00",
  "score": 1.0,
  "title": "Picking Leeds United’s 2025-26 breakout player: Harry Gray",
  "description": "Harry Gray is likely to be fourth-choice striker for Leeds United this season, but he's ready to take his chance when it comes...",
  "content": "It’s a tale people will be bored of hearing when they speak to me about Harry Gray. If you read The Athletic’s March feature on the teenager, you will know this one, too, but the context it provides is important.\n\nDarren Arnott, a former youth coach at Leeds United, told me about one occasion he was speaking with Aaron Lennon in 2024 at Thorp Arch, the club’s training ground. Lennon, who was coaching the under-18s at the time, played with the likes of Jermain Defoe, Robbie Keane, Gareth Bale and Dimitar Berbatov during his career.\n\nBear those names in mind when Arnott said: “I remember Aaron coming in from doing some finishing with him (Gray) and he was just shaking his head, laughing, saying, ‘He finishes off his left foot as good as any senior pro I’ve seen’.”\n\nIt’s a neat story that summarises the kind of comments that have followed Gray since he first started playing in United’s academy. Despite the best efforts of everyone around him to manage the public narrative about his rise, there is only so much they can do once he’s in the first-team spotlight.\n\nPeople are always going to talk about exciting and talented young footballers, especially when they come from the most successful and beloved family in Leeds United history. Gray turns 17 in October and will undoubtedly play in the Premier League next season.\n\nThe striker and his family will know there is no stopping the buzz on the biggest domestic stage in world football. If Gray dazzles in a cameo, scores or assists, the media attention will be immense. That will not be a surprise to father Andy, grandfather Frank, great uncle Eddie, or brother Archie.\n\nSources at Leeds, speaking anonymously to protect relationships, as well as coaches like Arnott, have underlined Gray’s confidence. If he gets chances under Daniel Farke next season, he will back himself to make a difference on the pitch.\n\nFarke himself commented on Gray’s keenness to be at the front of May’s title celebrations, despite having contributed only five minutes on the pitch for the senior side.\n\nIf he is set to be one of England’s best strikers over the next 15 years, goals at 17 years old in the top flight may not be out of the question. Everyone develops at different rates.\n\nHarry Kane, England’s record goalscorer, did not make his Premier League debut until he was 19 and did not score until he was 20. Wayne Rooney, an extreme example as one of the country’s finest footballers of all time, made his debut in August 2002 and scored that free kick against Arsenal two months later, before he turned 17.\n\nMichael Owen was 17 when he scored on his Premier League debut for Liverpool in May 1997. Alan Shearer made his top-flight debut at 17 before scoring a hat-trick two weeks later against Arsenal in 1988.\n\nClearly, those are four of the greatest English centre-forwards to play the game. It’s a high bar and their feats should not mean Gray will mimic them, but it’s laid out as an example of why it’s feasible this coming season could be his breakthrough.\n\nThe fact is, going into the new season, for all of the hype, Gray has very little experience in the first team. Earlier introductions from the bench will be the next step for him.\n\nJoel Piroe and Lukas Nmecha are ahead of him in the pecking order, but it is no secret Leeds want another addition good enough to start regularly at the tip of their attack. The loan exit of Mateo Joseph and the exclusion of Patrick Bamford will only aid Gray’s hopes of getting on the field.\n\nIf we assume he is going to be the fourth-choice striker in a one-striker system, it does manage expectations. Injuries and poor form will be needed from the three ahead of Gray to give him that chance, but if he impresses on the field, he will ask that question of Farke.\n\nMost likely, Gray will play the majority of his football with the under-21s in Premier League 2 next term. First-team minutes in the cups could be where he catches the eye.\n\nIt could be that 2026-27, when Gray turns 18, proves to be the striker’s real push for senior minutes. Farke, evidently, wants to aid that process. He took Gray to Germany for 2024’s pre-season camp, where a back injury halted his progress for several months.\n\nHe went with the team to Sweden and Germany again this summer. He already has a tall frame, which will probably grow another inch or two before he starts to bulk out properly. His versatility as a No 9 or No 10 will help him, too, though the former is his more natural role.\n\nHe has scored all kinds of goals in the youth ranks, where the only challenge coaches could find was pitting him against opponents two or three years older.\n\nYou will not catch Farke pumping Gray’s tyres up publicly, but he knows what kind of talent he has on his hands. He has to manage him carefully and unleash him at the right moment.",
  "medium": "Article",
  "links": [
    "https://www.nytimes.com/athletic/6540281/2025/08/07/mateo-joseph-leeds-mallorca-transfer/",
    "https://www.nytimes.com/athletic/6503770/2025/07/19/patrick-bamford-leeds-future/",
    "https://www.nytimes.com/athletic/6180426/2025/03/07/harry-gray-leeds-archie-gray/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Harry Gray",
      "weight": 0.087523796
    },
    {
      "name": "Gray",
      "weight": 0.08611312
    },
    {
      "name": "next season",
      "weight": 0.067717865
    },
    {
      "name": "Leeds United",
      "weight": 0.064519264
    },
    {
      "name": "Leeds United history",
      "weight": 0.061789617
    },
    {
      "name": "Premier League",
      "weight": 0.061657447
    },
    {
      "name": "Leeds",
      "weight": 0.05183769
    },
    {
      "name": "senior minutes",
      "weight": 0.051379327
    },
    {
      "name": "great uncle Eddie",
      "weight": 0.049539153
    },
    {
      "name": "Daniel Farke",
      "weight": 0.04820658
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.990234375
    },
    {
      "name": "/Sports/Team Sports/Soccer",
      "score": 0.98193359375
    }
  ],
  "sentiment": {
    "positive": 0.17006582,
    "negative": 0.37386894,
    "neutral": 0.4560652
  },
  "summary": "Harry Gray, a 17-year-old striker from Leeds United, is being considered the future breakout player for the club. Darren Arnott, a former youth coach at Leeds, recalls a conversation with Aaron Lennon about Gray's potential as a future senior pro. Gray, who turns 17 in October, is expected to play in the Premier League next season and has little first-team experience yet. Despite this, sources at Leeds have indicated Gray's confidence and he will welcome more opportunities under Daniel Farke next season. Gray has also been linked with a move to Germany for 2024.",
  "shortSummary": "Harry Gray, a promising young striker from Leeds United’s academy, faces challenges in his first season in the Premier League due to injuries and competition.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "b6fbf7b666a949738b3a9ddf37374ae9",
  "places": [
    {
      "osmId": "4781583",
      "city": "Leeds",
      "stateDistrict": "West Yorkshire",
      "state": "England",
      "country": "United Kingdom",
      "countryCode": "gb",
      "coordinates": {
        "lat": 53.9087462,
        "lon": -1.3381961
      }
    }
  ],
  "scraped_sources": [
    {
      "url": "https://www.nytimes.com/athletic/6180426/2025/03/07/harry-gray-leeds-archie-gray/",
      "text": "“You’re Harry’s brother, aren’t you?”\nWhen you ask people who have watched Harry Gray’s development at Leeds United’s training ground over the years, an anecdote keeps cropping up — one given weight by his elder brother Archie’s meteoric rise.\nMultiple sources, who like others in this article spoke under the condition of anonymity to protect relationships, said Archie, as good as he was, would be described as “Harry’s brother” as he rose through the age groups at Leeds, despite being the older sibling. Furthermore, people meeting Archie for the first time would sometimes ask him if he was Harry’s brother.\nAdvertisement\nWhen you now consider Archie, 18, is about to complete a maiden Premier League campaign with Tottenham Hotspur after a £40million move from Leeds last summer, it says a lot about Harry’s reputation.\nHarry, 16, is making waves with Leeds’ under-21 side while he trains with a first-team squad currently leading the race for automatic promotion from the Championship.\nHe’s a talent who might not be a secret for much longer.\nLast summer, Leeds fans suffered a devastating loss when Archie Gray moved on.\nThe Grays are synonymous with the club, with several members of the family having played for them since the 1960s, but the blow of that transfer to Spurs was softened by the emergence of his younger brother in pre-season.\nHarry Gray, then 15, made a non-competitive senior debut in a July friendly at Yorkshire neighbours Harrogate Town and was one of five outfield youngsters chosen by manager Daniel Farke to be part of a subsequent pre-season training camp in Germany.\nWhispers about Gray had been leaking from Leeds’ training ground Thorp Arch for years, about mythical 10-goals-a-game splurges, but his inclusion in the party travelling to Germany was the first public admission of the quality of player Leeds had on their hands.\nGray returned from that trip with a back problem caused by his age and growing. It was nothing major and he was managed through the subsequent months before returning to match action in Premier League 2 in mid-January. Regular minutes with the under-21s in that competition are expected over the rest of the season, but all eyes will be on when Farke gives him that senior debut.\nAndy Wright was in the Leeds squad that won the 1996-97 FA Youth Cup and is now lead coach with the Yorkshire-based i2i International Soccer Academy. His professional coaching experience stretches to 12 years, but he spent six of them at the heart of Leeds’ academy. He first came across Gray in the under-10s at Thorp Arch, then watched his development more closely from under-12s to under-14s.\nAdvertisement\nOf all the young talents Wright has worked with, he was asked what makes Gray stand out: “It’s his mentality. His desire to win certainly set him apart. The standards he expected for himself were always absolutely above and beyond anything else.\n“How could I describe him as a player? He was just doing things you wouldn’t expect. He could win a match on his own when you probably wouldn’t expect him to do that. He would do things you’d just think, ‘Wow’. His finishing stood out, with both feet. He could beat you one-on-one, he could hold up the ball, back to goal, spin you and chip the goalkeeper. He could run in behind.\n“As a coach, you try not to get too excited, you’re wondering where they’re going to end up, but this kid’s really, really special. That’s the only way I could describe him.”\nDarren Arnott is currently head coach of Hong Kong’s under-20 and under-23 teams, having previously had three spells working in Leeds’ academy. Most recently, he was there from January 2023 until May last year, coaching across the under-15, under-16 and under-18 sides. He was part of the coaching staff for last season’s run to the FA Youth Cup final.\nThe comparison of Gray with his older brother was a natural starting point.\nArnott says: “I was fortunate to work a little bit in the past with Archie when he was younger. The boys have a very similar kind of mindset. They’re really good problem-solvers.\n“(Harry) is hyper in everything. His learning style is interesting because he would be the one at the back of the group juggling a football while you make a group intervention. It could be perceived as lacking focus, but you ask him what you’ve said and he could recite it with his eyes closed. He’s hyper-intelligent. His thinking frequency is buzzing at a much higher level. He just loves challenges.”\nAdvertisement\nThe Gray name could be a burden for weaker minds.\nFor those who aren’t aware, Gray’s great-uncle, Eddie, is a Leeds United legend, having made 579 appearances and helped win numerous trophies in the 1960s and 1970s, including two domestic titles and an FA Cup. His grandfather, Frank, was a part of the club’s 1970s successes, too, playing 396 times across two spells. Harry’s father, Andy, clocked up 38 Leeds games, also in two stints. Archie got to 52 before that switch to Tottenham.\nWright says: “Even though he’ll have the pressure of the family name, that never bothers Harry. I’ve never seen a kid play with such belief and absolutely no fear. I still speak with people at the club, so I know he’s training with the first team. That won’t phase him one bit. He’ll embrace it, he’ll enjoy the challenge and he’ll really back himself as well. That self-belief is really big in Harry.”\nGray has been surrounded by football his whole life but does not seem to shy away from that.\nArnott tells an insightful story about one analysis session at Thorp Arch last season: “I remember one time he came in early for the analysis session and the analyst put the TV on to try to set the laptop up and there’s a Scottish Premiership game on.\n“As the analyst was about to change the input to the HDMI, Harry went, ‘Oh, wait, they’ll score in a second. Wait, wait, wait’. They scored. I went, ‘How did you know that?’. He said, ‘I watched it seven days ago. He scores, then he gets a free kick, puts it here and he does this, does that’. It’s like an encyclopedia of football in his brain. He has a pure love for the game.”\nGray needs a challenge, his former coaches say. Not only was he pushed up the age groups to play against older opponents, but coaches had to delve deeper into their toolboxes to tap into his potential.\nAdvertisement\nBespoke training programmes were devised for him that utilised him in different ways across the under-15, under-16 and under-18 teams. With the under-18s, for example, Gray would be deployed as a single striker and asked to play off the shoulder — see less of the ball but score a hatful of goals.\nWith the under-15s, he may have been playing against his own age group, but the coaches wanted to make it harder for him. In last season’s Under-15 Premier League Floodlit Super Cup final, Gray was given the responsibility of the captaincy and asked to play as a No 10, dictating play as the heartbeat of the team. He was described as “exceptional” in the game by one source, though Leeds lost 5-3 to Chelsea.\n“He’s not someone you would show a specific technique to,” Arnott says. “You wouldn’t try to teach him that way.\n“You would challenge him by saying, ‘Hey, Harry. I saw the other day a player did this on this angle and lifted it over the ’keeper, or put it through his legs from this tight angle, or put it in the near top corner with his weak foot. That’s a great finish’.\n“In half an hour, he’s trying to work it out and figure it out for himself. He does it quickly. He adapts.\n“When you move him from under-15s and up, he adapts super-fast. You put him with the under-18s, he scores goals, but maybe his overall game isn’t brilliant in the first phase. Then, after a couple of games, he understands the game and it’s easy for him. You put him with the under-21s, the same thing happens. You put him in the first team, I hope and pray, the same thing happens and I imagine it will.”\nThe Leeds first team is where this is all ultimately leading.\nGray and his family understand the talk around him is just hype unless he delivers. His drive to succeed is evident and Thorp Arch sources say he has always been conscious of his brother Archie’s benchmarks and wants to surpass them.\nThe family dynamic is central to all of this. Those spoken to about the brothers can only wax lyrical about them as human beings. They have had their feet kept on the ground.\nOf the boys’ father, Wright says: “How he supports them, supports their development, as a dad, that really helped the pair of them. The family behind them as well, supporting them on the journey. Andy was brilliant for them.”\nHe adds: “Andy’s kept them grounded and (made them) good people. Harry has some brilliant traits as a person and as a player. It was great to get to know him, but Andy really kept their feet on the ground and when they did get a little bit ahead of themselves, he would knock them down a peg or two. I’ve certainly seen that, first-hand. The family’s got to take a lot of praise. It’s the whole Gray family, but they’ve been there and done it, really good people.”\nAdvertisement\nThere is a natural inclination, across youth football, to manage expectations. Experienced coaches know they are talking about impressionable teenagers. And yet, those who have worked with Gray felt it would have done the young striker a disservice to not describe him as they have done in this article. They know he’d brush off any praise.\nThe former Leeds, Spurs and England winger Aaron Lennon was a part of the club’s under-18 coaching staff last season. In October, Lennon told UK radio station talkSPORT of Gray: “He is ridiculous. He’s frightening. He’s a No 10, No 9. I don’t want to talk about him too much because I think everyone will want him, he’s that good. He’s probably the best I’ve seen in years.”\nLennon has played with the likes of Jermain Defoe, Robbie Keane, Gareth Bale and Dimitar Berbatov, yet Arnott recalls: “I remember Aaron coming in from doing some finishing with him and he was just shaking his head, laughing, saying, ‘He finishes off his left foot as good as any senior pro I’ve seen’.”\nDuring his aforementioned FA Youth Cup win in 1997, Wright played with and against the best young footballers in the country. He thinks Gray is on a par with those talents. “It’s the finishing that wasn’t normal for me,” he said. “His right foot’s unbelievable, but you put him on his left and he hits the ball so cleanly and it’s gone; it’s like a bullet and it’s in the back of the net.\n“When I was a younger player, I played with some very, very good players. He’s better than them. The Michael Owens I’ve played with. For finishing, he’s as good as I’ve ever seen.”\n(Top photo: Richard Sellers/PA Images via Getty Images)"
    },
    {
      "url": "https://www.nytimes.com/athletic/6503770/2025/07/19/patrick-bamford-leeds-future/",
      "text": "Patrick Bamford has been told by Daniel Farke he will not be a part of his Leeds United plans next season.\nThe England international was absent from Saturday’s friendly against Manchester United in Stockholm and Farke revealed his decision post-match.\nThe striker arrived seven years ago from Middlesbrough and has played 205 times for Leeds since, scoring 60 goals. However, injuries have hindered his ability to string starts together since September 2021.\nAdvertisement\nThat injury record ultimately proved to be too much for Farke to gamble on as he takes the team back to the top flight.\n“With Patrick, I had a really open and honest conversation,” he said. “I would have preferred a completely fit Patrick Bamford in the last two seasons.\n“He knows how much I rate him as a person. It was the second day of pre-season when I told him in my office he wasn’t part of my plans for the upcoming Premier League season, due to the fact he’s had really difficult years over the past years.”\nBamford has one year remaining on the contract he signed four years ago, after scoring 17 goals in United’s run to ninth in the top flight, and he is understood to be one of the highest earners at Elland Road.\nFarke believes the 31-year-old has done too much in his career to now be a back-up option at Elland Road and he expects him to flourish as a first-choice striker elsewhere.\n“For me, Patrick is someone who needs to be the main man,” he said. “If he gets this, he will score goals at every level because he’s a top player, but after the last few seasons, I wasn’t willing to do this and say he was our main man at Premier League level.\n“With the CV he’s had at Leeds United, he shouldn’t be a back-up option. This is not what you should be when you are the main man for so many years.\n“He has trained really professionally and his reaction was top class, as expected. He liked the openness and honesty.\n“Patrick has done so much for this club over the last seven years, winning two promotions. He trained with us over the first two weeks, but I told him, once we go to the training camp, I will reduce the striker group, so that’s why I made this cut right now.”\nLeeds travel to Germany now for a one-week training camp. Brenden Aaronson will join the team there to begin his pre-season, which was delayed by his USMNT commitments this summer.\nAdvertisement\nJack Harrison made his first Leeds appearance since May 2023 in Saturday’s draw with Manchester United. Farke has said the winger’s future will depend on how he grasps the opportunity which has been given to him, citing the way Junior Firpo and Aaronson managed to turn the tide of public opinion with hard work and consistency.\nMateo Joseph was another striker missing from Saturday’s squad. Farke said the forward did not feel ready to play after a slightly delayed start to pre-season following Spain under-21 duty.\nThe manager did not guarantee Joseph would still be with the squad for the start of next season, but made it clear how highly he rated the youngster and wanted to retain the club’s best players this summer.\n(Ryan Hiscott/Getty Images)"
    }
  ],
  "argos_summary": "Harry Gray, a promising 16-year-old striker at Leeds United, is generating significant buzz as he prepares for potential first-team opportunities next season. Coaches and former players have praised his exceptional finishing ability and confidence, comparing him to some of England's best strikers. Despite limited first-team experience, Gray's family legacy at Leeds and his impressive youth performances suggest he could make a notable impact in the Premier League.",
  "argos_id": "60KCHHJP6"
}