{
  "url": "https://www.foxnews.com/us/american-tourist-shot-killed-caribbean-vacation-hotspot-left-unfillable-void-our-lives",
  "authorsByline": "Adam Sabes",
  "articleId": "4b8a3fd5dab642c595eb864722e4d28d",
  "source": {
    "domain": "foxnews.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/08/931/523/kevin-mares-001.jpg?ve=1&tl=1",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T19:02:50-04:00",
  "addDate": "2025-08-11T23:13:49.940319+00:00",
  "refreshDate": "2025-08-11T23:13:49.940321+00:00",
  "score": 1.0,
  "title": "American tourist shot and killed in Caribbean vacation hotspot: 'Left an unfillable void in our lives'",
  "description": "A New York man was shot and killed in Puerto Rico, where he was visiting to attend a Bad Bunny concert, police said.",
  "content": "A tourist from New York was killed while visiting Puerto Rico for a Bad Bunny concert, according to police.25-year-old Kevin Mares was shot in the left side of his abdomen early Sunday morning in the La Perla area of San Juan, Puerto Rico, which has a history of violence. The shooting took place in the early morning hours on Sunday at a night hangout spot called \"Refuge for Mistreated Men\" in the coastal community.Several people who were near Mares got into an argument, resulting in one person pulling out a gun and shooting at least three others, which included the New Yorker. Mares was taken to a local hospital but died, homicide detective Sgt. Arnaldo Ruiz said.Two other people, a brother and sister in their mid-40s, remain in the hospital.20 YEARS AFTER NATALEE HOLLOWAY VANISHED, SUSPECT’S CONFESSION STILL LEAVES QUESTIONS: PIRuiz said Mares was in San Juan to see Bad Bunny perform in concert, where his 30-show residency recently began.Officials don't have many details from the shooting and don't yet have a description of the suspect.\"We have very little information,\" Ruiz said.La Perla was once known as a major distribution hub for heroin, which brought high rates of violence to the area. In 2011, federal agents raided the shantytown and made dozens of arrests.POLICE INVESTIGATE VESSEL WITH 11 DECOMPOSED BODIES WASHED ASHORE IN CARIBBEANA GoFundMe raising money for Mares' funeral describes him as a \"deeply loved son, devoted friend, and a source of inspiration to everyone who knew him.\"\"His wholehearted kindness, adventurous spirit, and unwavering commitment to family made him a pillar of strength for his loved ones. Kevin had a bright future ahead, with plans to propose to his girlfriend of six years this fall, and he was always creating memories with those closest to him,\" Mares said. \"Family was at the center of everything he did, and his sudden passing has left an unfillable void in our lives.\"The Associated Press contributed to this report.",
  "medium": "Article",
  "links": [
    "https://www.foxnews.com/category/crime",
    "https://www.foxnews.com/world/police-investigate-vessel-11-decomposed-bodies-washed-ashore-caribbean",
    "https://www.foxnews.com/video/6360664094112",
    "https://www.foxnews.com/category/us/us-regions/us-puerto-rico",
    "https://www.foxnews.com/apps-products?pid=AppArticleLink",
    "https://www.foxnews.com/category/us/us-regions/northeast/new-york",
    "https://www.foxnews.com/us/twenty-years-after-natalee-holloway-vanished-suspects-confession-still-leaves-questions-pi"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Kevin Mares",
      "weight": 0.0842684
    },
    {
      "name": "Mares",
      "weight": 0.07759126
    },
    {
      "name": "early Sunday morning",
      "weight": 0.07365332
    },
    {
      "name": "homicide detective Sgt. Arnaldo Ruiz",
      "weight": 0.06736963
    },
    {
      "name": "Puerto Rico",
      "weight": 0.06541911
    },
    {
      "name": "Bad Bunny",
      "weight": 0.065382585
    },
    {
      "name": "San Juan",
      "weight": 0.06515519
    },
    {
      "name": "La Perla",
      "weight": 0.059615813
    },
    {
      "name": "Caribbean vacation hotspot",
      "weight": 0.055851843
    },
    {
      "name": "unwavering commitment",
      "weight": 0.055361904
    }
  ],
  "topics": [
    {
      "name": "Crime"
    }
  ],
  "categories": [
    {
      "name": "General"
    },
    {
      "name": "Travel"
    }
  ],
  "taxonomies": [
    {
      "name": "/Sensitive Subjects/Death & Tragedy",
      "score": 0.970703125
    },
    {
      "name": "/News/Local News",
      "score": 0.80615234375
    },
    {
      "name": "/News/Other",
      "score": 0.7001953125
    },
    {
      "name": "/Sensitive Subjects/Violence & Abuse",
      "score": 0.6708984375
    }
  ],
  "sentiment": {
    "positive": 0.096126266,
    "negative": 0.6578668,
    "neutral": 0.24600695
  },
  "summary": "A 25-year-old tourist from New York was shot and killed in the early hours of Sunday in the La Perla area of San Juan, Puerto Rico. The shooting occurred at a night hangout spot called \"Refuge for Mistreated Men\". The victim was taken to a local hospital but died. Two other people remain in the hospital. The area has a history of violence and was once a major distribution hub for heroin. The suspect is currently being sought out for questioning.",
  "shortSummary": "A New York tourist, 25-year-old Kevin Mares, was killed in a shooting in Puerto Rico's La Perla area while attending a Bad Bunny concert, leaving an unfillable void.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "be724b4a9dff440182fbbf52eea60099",
  "places": [
    {
      "osmId": "3729405285",
      "city": "San Juan",
      "state": "Puerto Rico",
      "postcode": "00901",
      "country": "United States",
      "countryCode": "us",
      "neighbourhood": "La Perla",
      "coordinates": {
        "lat": 18.4687401,
        "lon": -66.1153167
      }
    }
  ],
  "scraped_sources": [
    {
      "url": "https://www.foxnews.com/apps-products?pid=AppArticleLink",
      "text": "Fox News is Everywhere.\nWatch Fox News Channel on all of your devices to keep up to date with the latest in news, politics, entertainment and more. On phones, tablets, wearables and TV, it's easy to stay connected anywhere.\niOS Devices\nAndroid Devices\nApple TV\nRoku\nChromecast\nAndroid TV\nAmazon Fire\nFubo TV\nApple Watch\nAmazon Echo\nGoogle Home\nFox News Go\nApple News\nAT&T TV Now\nYouTube TV\nHulu\nFacebook\nInstagram\nSamsung Devices\nSling TV\nVidgo\nSpotify\niHeartRadio\nFlipboard\nLinkedIn\nGoogle Newsstand\nNewsletters\nYouTube\nFAQ\nHow much data does Fox News Go use?\nFox News Go uses about 2GB per hour of SD viewing and 4GB per hour of HD viewing. This can vary depending on your device and internet connection. If you are concerned about your data usage we recommend not streaming over a cellular network and contacting your Internet or Cellular Service Provider.\nWhat broadcast quality will I get while streaming on my device?\nFox News will stream at the highest quality possible based on your device and internet connection quality. For the best quality we recommend streaming via Wi-Fi or 4G.\nWhat channels are available on Fox News Go?\nYou can Watch Fox News Channel on Fox News Go and Fox Business Channel on Fox Business Go"
    },
    {
      "url": "https://www.foxnews.com/category/us/us-regions/northeast/new-york",
      "text": "VIDEO 3 hours ago Zohran Mamdani launches anti-Trump crusade National Review senior writer Noah Rothman and former Biden Press Office chief of staff Yemisi Egbewole discuss New York City mayoral candidate Zohran Mamdani's anti-Trump campaign strategy on 'The Story.'\nNew York 5 hours ago Irish bikini designer found dead on yacht months after divorce and prior legal dispute Martha Nolan-O'Slatarra discovered dead on 54-foot yacht in Montauk following recent divorce and amid ongoing legal disputes over business dealings.\nJustice Department 9 hours ago Epstein grand jury materials won't be released after federal judge denies DOJ request to unseal Judge rejects government motion to make public grand jury evidence from sex trafficking cases involving Jeffrey Epstein and convicted accomplice Ghislaine Maxwell\nGovernors 1 day ago Hochul, once Cuomo's second in command, identifies 'areas of alignment' with socialist Mamdani New York Gov. Kathy Hochul identifies areas of alignment with Democratic socialist mayoral candidate Zohran Mamdani despite political differences.\nNew York 1 day ago AOC campaign denies link to woman charged with 'terroristic threat' against school over Jewish students Iman Abdul, reportedly a former AOC campaign organizer, arrested for allegedly making terroristic threats against a Brooklyn high school.\nVIDEO 1 day ago Gov. Hochul vows to fight 'fire with fire' amid redistricting feud New York Gov. Kathy Hochul discusses the nationwide redistricting race before the 2026 midterm elections, New York mayoral candidate Zohran Mamdani’s policy proposals and more on ‘Fox News Sunday.’\nNew York 1 day ago Cuomo supporters look to wealthy enclave to take down Mamdani: report Andrew Cuomo supporters urge Hamptons residents to switch voter registration to NYC to vote against Democratic socialist mayoral candidate Zohran Mamdani.\nNew York 1 day ago Woman found dead on yacht sparks scrutiny of Montauk’s party scene and rising wealth The sudden death of a young fashion entrepreneur has shaken the idyllic coastal town of Montauk — and raised fresh concerns about how a once tranquil, tight-knit fishing community is being reshaped by wealth, influencers, and the seasonal arrival of the yacht-owning nouveau riche.\nNew York City 1 day ago Man pushed onto train tracks at Midtown subway station in New York City, police say A man in New York City was pushed onto the train tracks at a Midtown subway station Saturday night, although he was not struck by a train, according to police.\nAndrew Cuomo 1 day ago Cuomo calls out NYC mayoral candidate Mamdani over rent-stabilized apartment: 'Move out immediately' Former governor Andrew Cuomo has criticized mayoral rival Zohran Mamdani for allegedly living in a rent-stabilized apartment while earning a more than six-figure income.\nNew York 2 days ago Montauk yacht death: Timeline reveals bikini mogul’s final days in Hamptons before mysterious demise Martha Nolan-O'Slatarra, 33-year-old swimwear entrepreneur, was found dead on a yacht at the Montauk Yacht Club, and police are conducting a homicide investigation.\nNew York 2 days ago 3 shot in Times Square, 17-year-old suspect detained after late-night dispute Three people were shot during an early morning shooting at New York City’s iconic Times Square and police have detained the 17-year-old suspect.\nVIDEO 2 days ago Columbia student says Mamdani becoming NYC mayor would be ‘scary’ for Jewish students A student at Columbia told Fox that a Mamdani victory may ‘inspire others’ to do ‘terrible things’ as the campus grapples with antisemitism.\nVIDEO 3 days ago Justice Department launches grand jury probe into New York AG Letitia James Fox News correspondent David Spunt has the latest on the Justice Department’s grand jury investigation into New York Attorney General Letitia James on 'Special Report.'\nNew York 3 days ago DOJ opens grand jury investigation into Letitia James tied to Trump civil case The DOJ opened a grand jury investigation in New York into state Attorney General Letitia James tied to her lawsuit against President Donald Trump.\nVIDEO 3 days ago Ruling on 'Alligator Alcatraz' expansion is 'judicial overreach,' says ex-WH official A 'Fox News @ Night' panel weighs in on a potential Trump-Putin meeting, a judge pausing construction on 'Alligator Alcatraz' and California Governor Gavin Newsom's redistricting plan.\nVIDEO 3 days ago Katie Pavlich warns Mamdani could give the Left 'breath of life' Fox News contributor Katie Pavlich, Stagwell Inc. CEO Mark Penn and Hoover Institution senior fellow Victor Davis Hanson dissect the Democratic Party's 'radical' socialist movement on 'Hannity.'\nVIDEO 3 days ago Sean Hannity: Democrats are ‘nothing like the party they used to be’ Fox News host Sean Hannity exposes former House Speaker Nancy Pelosi’s, D-Calif., ‘dramatic shift’ and calls out Democrats’ old ‘tactics’ as they promote socialism on ‘Hannity.’\nVIDEO 3 days ago Newt Gingrich: Democrats are either 'rabid socialists' or 'totally negative' Former House Speaker Newt Gingrich analyzes how Democrats are 'going off the deep end' as so-called defenders of democracy on 'The Ingraham Angle.'\nVIDEO 3 days ago NYC mayoral candidates trade barbs as Trump reportedly weighs involvement Fox News' national correspondent Bryan Llenas reports on the latest on the New York mayoral race and President Donald Trump reportedly mulling involvement.\nVIDEO 4 days ago Mamdani's 'policies would take New York in the wrong direction,' says Lara Trump Fox News host Lara Trump weighs in on whether or not President Donald Trump will endorse any of the mayoral candidates for New York City on 'The Story.'\nTrue Crime 4 days ago Glam Hamptons shaken as bikini mogul dies on boat in latest Montauk mystery Violent crimes have occasionally shattered the tranquil Hamptons and Montauk, from Ted Ammon's 2001 murder to recent mysterious deaths at luxury marinas.\nNew York 4 days ago Cops sweep yacht after Irish bikini mogul dies in glamorous Hamptons harbor The family of Martha Nolan-O'Slatarra expressed shock after the bikini designer was found dead on a Montauk yacht that crime investigators were examining.\nNew York 4 days ago Anti-Israel activist confronts former IDF soldier on New York beach, gets questioned in return Viral video shows anti-Israel activist shouting at former Israeli soldier and friends on New York beach while they respond with composure and respect\nImmigration 4 days ago Lawmakers under fire for sharing ICE raid info, warning locals of immigration enforcement operations Democratic lawmakers including Alexandria Ocasio-Cortez face criticism for advising constituents on avoiding ICE operations as Trump administration ramps up immigration enforcement\nMedia 4 days ago Sen. Slotkin says Dem Socialist NYC candidate Mamdani represents 'new generation' of leaders young voters want Michigan Sen. Elissa Slotkin explained how cost of living issues and the desire for younger leadership drove Mamdani's surprising New York primary election victory.\nVIDEO 4 days ago Sean Hannity: 'Marxist' Mamdani is the 'heart and soul' of the Democratic Party Fox News host Sean Hannity sounds the alarm on Democrats' 'extremism' using their own words on 'Hannity.'\nHomicide 5 days ago Irish beauty who sold bikinis found dead on boat at yacht club, no foul play suspected Fashion entrepreneur Martha Nolan-O'Slatarra found dead on boat at Montauk Yacht Club as Suffolk County homicide detectives investigate the mysterious death.\nVIDEO 5 days ago Retired NYPD official reveals what 'says a lot' about Georgia's Fort Stewart military base Retired NYPD lieutenant Joe Cardinale commends the response of Fort Stewart's officials to an active shooter incident on 'America Reports.'\nImmigration 5 days ago Democrats attempting to visit Brooklyn ICE facility reportedly ‘trapped’ after being rebuffed by agents Reps. Espaillat, Velazquez and Goldman were refused access to Brooklyn MDC facility in the latest incident of lawmakers being rebuffed at federal detention centers"
    },
    {
      "url": "https://www.foxnews.com/category/crime",
      "text": "U.S. 42 mins ago American tourist shot and killed in Caribbean vacation hotspot: 'Left an unfillable void in our lives' A New York man was shot and killed in Puerto Rico, where he was visiting to attend a Bad Bunny concert, police said.\nCrime 1 hour ago 911 calls, police report details dark timeline to Arizona girl's tragic death New documents reveal 10-year-old Rebekah Baptiste made multiple escape attempts before her death in a rural Arizona area, leading to murder charges against father and his girlfriend.\nVIDEO 1 hour ago 911 calls released in death of 10-year-old Arizona girl Police have released the 911 calls in the case of 10-year-old Rebekah Baptiste, depicting a lack of emotion from the woman calling for help.\nPolitics 2 hours ago Top Democrats ripped on social media over 'bonkers' reactions to Trump's DC crime plan: 'Massive liar' Former secretary of state was one of several top Democrats to be slammed on social media for opposing President Trump's plan to combat crime in Washington, D.C.\nWashington DC 2 hours ago Inside the Washington, DC homeless hotspots Trump has vowed to clean up Crime is down, and many tents are gone — but much of Washington, D.C. remains on edge as Trump launches a sweeping federal response to lingering urban disorder.\nVIDEO 2 hours ago Gunman opens fire at Texas Target store Austin Police said at least two people were killed after a gunman opened fire at a Target store. Police also said the suspect was detained. (Credit: KTBC)\nAntisemitism Exposed 3 hours ago Antisemitic graffiti prompts hate crime probe at Israeli-American Council HQ in Los Angeles The Israeli-American Council headquarters in Los Angeles was vandalized with antisemitic graffiti over the weekend. The LAPD is investigating it as a possible hate crime.\nNew York 5 hours ago Irish bikini designer found dead on yacht months after divorce and prior legal dispute Martha Nolan-O'Slatarra discovered dead on 54-foot yacht in Montauk following recent divorce and amid ongoing legal disputes over business dealings.\nVIDEO 5 hours ago Trump's DC crime clean-up is not a partisan issue: Doug Burgum Fox News correspondent Alexandria Hoff has the details on President Donald Trump's public safety emergency. Interior Secretary Doug Burgum pushes back against Democrats' claim that crime is down in Washington, D.C.\nMedia 6 hours ago Washington Post source says DC is safe but stays anonymous over 'personal safety' concerns An anonymous resident told The Washington Post that D.C. has safety issues and declined to give their name due to personal safety concerns, as President Trump plans to intervene."
    },
    {
      "url": "https://www.foxnews.com/world/police-investigate-vessel-11-decomposed-bodies-washed-ashore-caribbean",
      "text": "Police have launched an investigation into a vessel that washed ashore on an Eastern Caribbean island that contained human remains of at least 11 people in an advanced state of decomposition.\nThe Royal St. Vincent and the Grenadines Police Force (RSVGPF) said it received a report at about 10:45 a.m. Monday that a suspicious vessel had been discovered along the coastline of the island of Canouan near Little Bay and Cherry Hill.\nOfficers from the Canouan police station responded and discovered the remains of 11 people on the boat.\nPolice said the boat measured 45 feet long, 12 feet wide and 6 feet deep, and it was found grounded in the area.\nFAMILY OF AMERICAN FOUND DEAD ON BAHAMAS BEACH FEARS ‘EVIDENCE WILL DISAPPEAR,’ PLEADS FOR HELP\nThe remains of the people onboard were in what police called an \"advanced state of decomposition,\" and some of the remains were not fully intact.\nInvestigators recovered several passports from the boat, which appear to be from the West African country of the Republic of Mali.\nWhile passports have been recovered, police have not officially identified any of the bodies, and the investigation remains ongoing.\nBAHAMAS OFFICIALS REVEAL AMERICAN MAN'S CAUSE OF DEATH AFTER BODY FOUND ON BEACH\nThe RSVGPF said it is working closely with regional and international partners to confirm the origins of the boat and the identities of those onboard.\nThe human remains have since been transported to the island of St. Vincent, where they are being held at the Kingstown mortuary for further forensic and investigative procedures.\n\"This incident is deeply concerning, and we understand the public’s interest in the matter,\" police said. \"We assure you that the RSVGPF is treating this investigation with the utmost seriousness and sensitivity.\"\nAMERICAN MAN ON BAHAMAS FAMILY VACATION FOUND DEAD AFTER LEAVING DINNER TO GET JACKET: REPORT\nThe department added that it is committed to pursuing every lead and ensuring all appropriate protocols are followed.\nThe U.S. State Department issued a Level 4 Do Not Travel advisory for the country of Mali in July 2023.\nThe State Department’s reasoning for not traveling to the country is due to crime, terrorism and kidnapping.\n\"Violent crime, such as kidnapping and armed robbery, is common in Mali. Violent crime is a particular concern during local holidays and seasonal events in Bamako, its suburbs, and Mali’s southern regions,\" the advisory states.\nCLICK HERE TO GET THE FOX NEWS APP\n\"Terrorist and armed groups continue plotting kidnappings and attacks in Mali,\" the advisory on Mali adds. \"They may attack with little or no warning, targeting nightclubs, hotels, restaurants, places of worship, international diplomatic missions, and other locations frequented by foreigners. Attacks may target Malian government offices and infrastructure, in addition to locations frequented by Westerners.\""
    },
    {
      "url": "https://www.foxnews.com/us/twenty-years-after-natalee-holloway-vanished-suspects-confession-still-leaves-questions-pi",
      "text": "Graphic content warning\nTwenty years have passed since 18-year-old Natalee Holloway of Alabama disappeared on May 30, 2005, during a senior trip to Aruba with her high school friends, but the Holloway family's private investigator says there are still many unanswered questions in the case.\nIn 2023, 36-year-old Dutch national Joran van der Sloot, the primary suspect in Holloway's disappearance and murder, confessed to bashing the teenager's head with a brick and dumping her body in the ocean after she refused his advances.\n\"I smash her head in with it completely,\" van der Sloot said in an Oct. 3, 2023, interview with federal authorities. \"Her face basically, you know, collapses in. Even though it's dark, I can see her face is collapsed in.\"\nTJ Ward, a private investigator hired by Holloway's family in 2005 and again in 2010, does not believe he acted alone.\nLESSONS LEARNED IN NATALEE HOLLOWAY DISAPPEARANCE APPLY TO SUDIKSHA KONANKI CASE: RETIRED FBI AGENT\n\"Twenty years, can you believe that?\" he told Fox News Digital in an interview this week, marking two decades since the 18-year-old graduate vanished from Carlos'n Charlie's, a restaurant and nightclub in Oranjestad, Aruba. \"She had a bright future. She got a scholarship to go to college for medical school – unbelievable.\"\nWard does work for a voice analysis company based in Israel, which paid the private investigator to travel to Aruba after Holloway disappeared. There, he met with her parents as well as the FBI and Aruba authorities. Ward said he used the voice analysis technology on van de Sloot's existing interviews at the time and determined that he was lying to authorities and to the public.\nBETH HOLLOWAY ADDRESSES MISSING AMERICAN COLLEGE STUDENT, URGES 'FULL CIRCLE' SAFETY PLAN\n\"We knew numerous times along the course of the investigation [and] over the last few years that Joran van der Sloot was not telling the truth,\" Ward said. \"Thereafter, we started locating witnesses and talking and finding information that was going on with the disappearance of Natalee Holloway, and we knew a lot of the information that Van der Sloot was communicating was not true.\"\nHolloway was last seen leaving Carlos'n Charlie's with van der Sloot and two other men, brothers Satish and Deepak Kalpoe, on the evening of May 30, two decades ago as of Friday. The three men were considered early suspects in the case.\nNEWS ANCHOR'S MYSTERIOUS DISAPPEARANCE WAS CRIME OF 'JEALOUSY': PRIVATE INVESTIGATOR\nPolice arrested van der Sloot but eventually released him due to a lack of evidence. Authorities eyed the same suspects again in 2007 after uncovering \"new facts\" but wound up releasing them once more.\nHolloway’s remains have never been found.\nTIMELINE OF ALABAMA TEEN NATALEE HOLLOWAY'S DEATH\nFive years to the day after Holloway's disappearance, van der Sloot killed 21-year-old Stephany Flores, a business student from a wealthy Peruvian family who crossed paths with the killer on May 30, 2010.\nVan der Sloot later confessed to killing her in a fit of anger after she learned about his connection to Holloway's disappearance. They had met earlier in her father's casino in Lima, and he beat her to death in his hotel room the following morning.\nJORAN VAN DER SLOOT HAS CONFESSED TO KILLING NATALEE HOLLOWAY\nIn June 2010, the U.S. Attorney's Office for the Northern District of Alabama announced an indictment on extortion and wire fraud charges against Van der Sloot for allegedly trying to sell information about the whereabouts of her body to her family.\n\"Joran contacted Natalie's mother and Natalie's attorney, John Q. Kelly, in New York and said that for $250,000 he would tell Beth exactly what happened to his daughter,\" Ward said. \"So John Q. Kelly, along with the FBI, arranged to set up a room in the Marriott with the Aruban authorities … and Joran van der Sloot came in and started telling Beth and John Q. Kelly that Natalie was buried under a house in the concrete. Well, they in turn gave him $25,000 cash, on film, and he then departed. He should have been arrested right then and there for the FBI for trying to extort Natalie's mother.\"\nPERU ALLOWS NATALEE HOLLOWAY'S KILLER MULTIPLE CONJUGAL VISITS FOR HIS MENTAL HEALTH, REHABILITATION\nHe then left the United States and later told Beth Holloway and Kelly that he lied.\nVan der Sloot is currently serving prison time in Peru for Flores' murder. He is expected to be released in 2036, at which point Peruvian authorities will extradite him back to the United States to serve his consecutive 20-year sentence for Holloway's murder.\nAUDIO: LISTEN TO JORAN VAN DER SLOOT'S CONFESSION\n\"You have brutally murdered, in separate incidents, years apart, two young women who refused your sexual advances,\" Judge Anna Manasco told van der Sloot in court in 2023, referencing Flores' murder.\nJORAN VAN DER SLOOT'S WHIRLWIND PLEA DEAL: 'HE WON THE GAME,' BUT FAMILY ACCEPTS CLOSURE\nManasco called the extortion and fraud charges \"heinous\" because the killer knew the information he was selling was a lie to make a profit. However, as part of the deal, she said federal prosecutors have agreed not to use his confession against him for any other purposes.\n\"After 18 years, Natalee’s case has been solved,\" Beth Holloway told reporters outside the courthouse immediately after van der Sloot's 2023 sentencing hearing in Holloway's death. \"Joran van der Sloot is the killer.\"\n\"You are a killer, and I want you to remember that every time that jail door slams.\"\nIn a victim-impact statement during the hearing, Holloway's mother tore into van der Sloot, saying he taunted her family and caused indescribable pain before turning to him and saying, \"You look like hell.\"\nWard told Fox News Digital this week that Beth Holloway feels \"kind of satisfied with the fact that he is in prison, and now he's gotten jail time in the United States, which he's going to have to do [consecutive] to the charges in Peru of the 20 years in the United States in the federal penitentiary. \"\nCLICK HERE FOR MORE TRUE CRIME FROM FOX NEWS\nThe private investigator added that he continues to stay in touch with Dave Holloway to this day and that they have not reached \"a finalization of what happened.\"\nCLICK HERE TO GET THE FOX NEWS APP\n\"Even though Joran van der Sloot confessed in 2023, we're not convinced that he was alone with what transpired with Natalee Halloway,\" Ward said. \"But again, our conclusion, as of today, Dave Holloway and I are still looking and trying to gather information, which we believe that there's other people involved with Joran van der Sloot when she was on the beach in May 30, 2005.\"\nWard said he does not believe van der Sloot acted alone, and he is still working to determine if others were involved.\nFox News' Michael Ruiz and Adam Sabes contributed to this report."
    },
    {
      "url": "https://www.foxnews.com/category/us/us-regions/us-puerto-rico",
      "text": "U.S. 1 hour ago American tourist shot and killed in Caribbean vacation hotspot: 'Left an unfillable void in our lives' A New York man was shot and killed in Puerto Rico, where he was visiting to attend a Bad Bunny concert, police said.\nCrime 4 days ago Border crisis shifts to Caribbean: Homeland Security fights silent war in Puerto Rico Homeland Security Investigations in Puerto Rico reports significant reduction in smuggling load, higher fentanyl presence following enhanced enforcement and new funding under Trump.\nNBA August 1 Ex-NBA star's wife bitten by shark in Puerto Rico The wife of former New York Knicks player Danilo Gallinari was taken to a hospital after she was bitten by a shark in Puerto Rico recently.\nCrime June 5 US Marshals track down family massacre suspect who allegedly fled to vacation hot spot Dominican fugitive Luis Francisco Soriano was captured in Punta Cana after fleeing from Puerto Rico after he allegedly killed a family of four in upstate New York.\nUS Energy April 29 Top energy group demands governor take swift action against radical 'extremists' crippling power grid A pro-energy group is calling on Puerto Rico's governor to act against what it calls climate lawfare that it warns could continue to cripple the grid in the U.S. territory.\nPuerto Rico April 18 Crews restore power to nearly all customers after island-wide blackout hit Puerto Rico Following an island-wide blackout that hit Puerto Rico earlier in the week after a transmission line failed, power was restored on Friday to more than 98% of customers.\nPuerto Rico April 17 Puerto Rico hit with massive island-wide blackout ahead of Easter weekend A massive island-wide blackout hit the U.S. territory of Puerto Rico midday Wednesday as residents were preparing for the Easter weekend.\nCrime April 4 CEO allegedly choked fellow cruise ship passenger over dance floor dispute: FBI First American Financial CEO Kenneth DeGiorgio is facing federal charges after allegedly choking another passenger while on a Virgin Voyages cruise, according to the FBI.\nInfectious Disease March 24 Dengue fever cases rising in popular spring break locations, CDC alerts As spring break continues, the CDC released a warning about rising dengue fever cases among U.S. travelers and in several destinations across the globe. Here's what to know.\nImmigration March 21 Puerto Rico no longer safe bet for illegal migrants as Trump crackdown expands to US territory The U.S. territory of Puerto Rico, once seen as a safe haven for illegal migrants, has seen ICE raids at an increasing pace since President Donald Trump took office.\nPuerto Rico January 15 Puerto Rico governor asks Trump to intervene after Venezuela's Maduro threatened to invade the US territory Puerto Rico Gov. Jenniffer González-Colón asked President-elect Trump to take action after Venezuela's Nicolás Maduro threatened an invasion.\nPuerto Rico December 31 Power outage leaves most of Puerto Rico in the dark on New Year's Eve The majority of Puerto Rico was left in the dark on Tuesday after a power outage put a damper on New Year's Eve festivities earlier in the day.\nPuerto Rico December 22 Christmas in Puerto Rico is a 45-day celebration with caroling, festive decorations, family feasts and more Christmas in Puerto Rico is spent with loved ones singing carols, sitting around the table for a meal and exchanging gifts. There celebrations last from Thanksgiving to mid-January.\nMedia November 16 CNN host says liberal media’s ‘constant browbeating’ about Trump is a top reason for his big win CNN host Michael Smerconish said in a recent interview he believes that the media's \"constant browbeating\" of Trump supporters was the top reason for the President-elect's victory.\nMedia November 12 Trump rally comedian doubles down on Puerto Rico joke after backlash: 'I apologize to absolutely nobody' The comedian, who delivered a crude joke about Puerto Rico at President-elect Trump's Madison Square Garden rally last month, said he wouldn't apologize for the joke.\nJoe Biden November 8 4 key times Biden undermined Harris' campaign against Trump President Biden made a series of mistakes and surprising comments while Vice President Kamala Harris worked to win the general election but ultimately failed.\nDonald Trump November 6 Trump makes gains with some Puerto Ricans this election despite controversial 'garbage' joke Donald Trump carried several Puerto Rican-heavy counties in Florida, despite controversial ‘floating garbage’ joke that critics expected would have a major impact on this demographic's support for Trump.\nAlexandria Ocasio-Cortez November 4 AOC slapped with community note after claiming massive Puerto Rican rally had to do with anti-Trump movement Rep. Alexandria Ocasio-Cortez was slapped with a community note on an X post Sunday, suggesting a rally in Puerto Rico was part of an anti-Trump movement.\nOpinion November 1 I’m Puerto Rican and Kamala Harris would continue Democrat destruction of the island Puerto Rico copes with legacy of mismanagement from Democrat presidents. Kamala Harris would be more of the same. Donald Trump delivered over $40 billion in aid to the island.\nPennsylvania October 30 Biden's 'garbage' remark being used by down-ballot GOP candidates in closing voter pitch Republicans in Senate races, like Dave McCormick, are highlighting President Biden trashing Trump supporters as \"garbage\" in the final days of the election cycle.\nPolitics October 29 Puerto Rico Shadow Senator endorses Trump at PA rally after 'Kill Tony' controversy at MSG Shadow Sen. Zoraida Buxo, R-PR, endorsed Donald Trump at a Pennsylvania rally only days after a comic at another event insulted Puerto Ricans.\nElections October 28 Trump camp responds to backlash over comedian's Puerto Rico joke at rally A joke about Puerto Rico made by comedian Tony Hinchcliffe during a Sunday Trump rally \"does not reflect\" the views of former President Donald Trump, a Trump campaign spokesperson said.\nAlexandria Ocasio-Cortez October 28 Pro-Trump comedian who told Puerto Rico joke at Madison Square Garden draws criticism from AOC, others Comedian Tony Hinchcliffe sparked bipartisan backlash for making a joke about Puerto Rico during remarks at the Trump rally in Madison Square Garden.\nMedia September 2 Puerto Rican musicians bring star power, endorse Trump: ‘Best president the world has seen’ Puerto Rican reggaeton stars Anuel AA and Justin Quiles went to former President Trump’s Pennsylvania rally in support of the GOP candidate.\nMedia August 16 American Airlines passengers stranded by ‘excruciating circumstances’ in Bahamas, called 'illegal immigrants' An American Airlines flight from Puerto Rico to Florida was diverted due to weather, stranding passengers at a Bahamas airport overnight and turning them into illegal immigrants.\nLIFESTYLE July 21, 2024 Meet the American who popularized Latin music, Tito Puente, World War II Navy veteran and kamikaze survivor Tito Puente was born in New York City to parents from Puerto Rico. After serving in the U.S. Navy during World War II, he popularized Latin music in the United States.\nPuerto Rico May 13, 2024 4 Dominicans are accused of smuggling wildlife and throwing 113 birds overboard to their deaths Four men have been indicted in Puerto Rico and have been charged with smuggling wildlife, after the U.S. Coast Guard spotted them throwing overboard cages holding birds.\nCruises April 17, 2024 Disney Cruise Line passenger rescued by US Coast Guard after emergency off Puerto Rico A 35-year-old pregnant woman was airlifted by the U.S. Coast Guard from the Disney Fantasy about 180 miles off shore from Puerto Rico on April 13.\nPuerto Rico April 3, 2024 Dredging of Puerto Rico's biggest port begins as environmentalists warn of threat to turtles, corals Amid opposition from environmentalists, a $62 million project to dredge the biggest seaport in Puerto Rico began Wednesday; crews will remove close to 3 million cubic yards of marine floor.\nPuerto Rico March 28, 2024 Marine goes missing while swimming in high surf off Puerto Rico coast The Coast Guard announced Thursday its search for Samuel Wanjiru, a 26-year-old Marine from Massachusetts who went missing while swimming in high surf off the Puerto Rican coast."
    }
  ],
  "argos_summary": "Kevin Mares, a 25-year-old tourist from New York, was fatally shot in San Juan, Puerto Rico, while attending a Bad Bunny concert. The incident occurred during an argument at a local hangout, resulting in Mares being shot in the abdomen and later dying in the hospital. Two other individuals were also injured in the shooting, and police are currently investigating the incident, which took place in an area known for its history of violence.",
  "argos_id": "64O6MOHBF"
}