{
  "url": "https://www.pymnts.com/news/ipo/2025/bullish-aims-bigger-ipo-target-990-million-dollars/",
  "authorsByline": "PYMNTS",
  "articleId": "bbee65b11b52448cb02885189bd3abc9",
  "source": {
    "domain": "pymnts.com",
    "location": {
      "country": "us",
      "state": "MA",
      "county": "Suffolk County",
      "city": "Boston",
      "coordinates": {
        "lat": 42.3602534,
        "lon": -71.0582912
      }
    }
  },
  "imageUrl": "https://www.pymnts.com/wp-content/uploads/2025/08/Bullish.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T17:09:13+00:00",
  "addDate": "2025-08-11T20:00:43.818092+00:00",
  "refreshDate": "2025-08-11T20:00:43.818093+00:00",
  "score": 1.0,
  "title": "Bullish Aims for Bigger IPO Target of $990 Million",
  "description": "Cryptocurrency exchange Bullish upped the size of its initial public offering (IPO). The company now plans to offer 30 million shares at a price range of",
  "content": "Cryptocurrency exchange Bullish upped the size of its initial public offering (IPO).\n\nBy completing this form, you agree to receive marketing communications from PYMNTS and to the sharing of your information with our sponsor, if applicable, in accordance with our Privacy Policy and Terms and Conditions .\n\nComplete the form to unlock this article and enjoy unlimited free access to all PYMNTS content — no additional logins required.\n\nThe company now plans to offer 30 million shares at a price range of $32 to $33 each, according to a Monday (Aug. 11) filing with the Securities and Exchange Commission. That puts the potential size of the IPO at $990 million.\n\nThe exchange, which also owns the crypto-focused news outlet CoinDesk, initially planned to sell 20.3 million shares for $28 to $31 each. The company was targeting a valuation of up to $4.23 billion, but this new price range would give it a market value of about $4.8 billion.\n\nBullish tried to go public in 2021 through a merger with special purpose acquisition company (SPAC) Far Peak. However, the two firms called off the plan in late 2022, citing a series of regulatory obstacles.\n\n“But that was under a different administration,” PYMNTS wrote in June. “With crypto-friendly President Donald Trump in office, investors have grown much more enthusiastic about cryptocurrency. The administration’s pro-crypto stance has helped bring the price of bitcoin to record levels and inspired other digital asset firms to seek public listings.”\n\nThose companies include Circle, which raised $1.1 billion with its IPO in June, more than twice the stablecoin creator’s expectations.\n\nAnother digital asset company, Figure Technology Solutions, announced last week that it is preparing to go public. The company, which uses blockchain technology for home loans and offers crypto-backed loans, said it filed confidentially for an IPO with the SEC.\n\nMeanwhile, the SEC’s Division of Corporation Finance decided last week that — under a specific set of facts — liquid staking arrangements, and the “staking receipt tokens” they generate, do not involve the offer or sale of securities.\n\nThis distinction matters as more than 154 public companies have committed $98.4 billion of their treasury dollars for crypto purchases just this year.\n\nHowever, the SEC’s allowance here applies to a strictly controlled set of assumptions. Beyond that, companies could be in regulatory gray areas.",
  "medium": "Article",
  "links": [
    "https://www.pymnts.com/cryptocurrency/2025/bullish-aims-to-take-crypto-exchange-public-following-circles-success/",
    "https://www.sec.gov/Archives/edgar/data/1872195/000110465925075896/tm2421409-23_f1a.htm",
    "https://www.circle.com/",
    "https://www.sec.gov/about/divisions-offices/division-corporation-finance",
    "https://www.pymnts.com/news/ipo/2025/bullish-begins-roadshow-take-crypto-platform-public/",
    "https://www.coindesk.com/",
    "https://www.figure.com/",
    "https://www.pymnts.com/cryptocurrency/2025/sec-says-caveat-liquid-staker-to-corporate-treasury-teams-buying-crypto/",
    "https://www.pymnts.com/cryptocurrency/2025/circle-is-americas-first-publicly-traded-stablecoin-issuer-now-what/",
    "https://www.pymnts.com/cryptocurrency/2022/crypto-company-bullish-and-spac-far-peak-end-proposed-deal/",
    "https://www.sec.gov/",
    "https://www.pymnts.com/news/ipo/2025/figure-plans-ipo-for-blockchain-based-lending-platform/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "companies",
      "weight": 0.08546566
    },
    {
      "name": "crypto-friendly President Donald Trump",
      "weight": 0.07366649
    },
    {
      "name": "public listings",
      "weight": 0.07209159
    },
    {
      "name": "other digital asset firms",
      "weight": 0.06939222
    },
    {
      "name": "last week",
      "weight": 0.0671737
    },
    {
      "name": "Bigger IPO Target",
      "weight": 0.06616636
    },
    {
      "name": "Cryptocurrency exchange Bullish",
      "weight": 0.06460989
    },
    {
      "name": "PYMNTS",
      "weight": 0.05886399
    },
    {
      "name": "liquid staking arrangements",
      "weight": 0.05828222
    },
    {
      "name": "unlimited free access",
      "weight": 0.056217507
    }
  ],
  "topics": [
    {
      "name": "Markets"
    },
    {
      "name": "IPO"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.97705078125
    },
    {
      "name": "/Finance/Investing/Currencies & Foreign Exchange",
      "score": 0.88525390625
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.4921875
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.418212890625
    }
  ],
  "sentiment": {
    "positive": 0.31314433,
    "negative": 0.08340149,
    "neutral": 0.6034542
  },
  "summary": "Cryptocurrency exchange Bullish has increased the size of its initial public offering (IPO), aiming to offer 30 million shares at a price range of $32 to $33 each. This makes the potential size of the IPO at $990 million. The company had initially planned to sell 20.3 million shares for $28 to $31 each, but this new price range would give it a market value of about $4.8 billion. The move comes as investors become more enthusiastic about cryptocurrency, following President Donald Trump's pro-crypto stance.",
  "shortSummary": "The crypto-currency exchange Bullish increased its IPO target to 30 million shares at $32 to $33 each, aiming for $990 million, up from $68m originally planned.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "6c80d1498915458db11abab4ba5bcb53",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.figure.com/",
      "text": "- $16Bin equity unlocked with Figure's platform\n- 201K+households served with Figure's platform\n- 100%online application\nprocess\nThe #1 non-bank home equity line of credit in the U.S.*: Navigates to bottom disclaimer\nApproval in as little as 5 minutes. Funding in as few as 5 days.2: Navigates to numbered disclaimer\nEasy online notary services in most locations with expert support. We've got you covered.\nEasier approvals, better terms, and lower rates.\nFigure's HELOC offers greater borrowing flexibility compared to personal loans.4: Navigates to numbered disclaimer\nBorrow up to $750,000.5: Navigates to numbered disclaimer\nLock in a lower rate than personal loans, with the option to redraw up to 100%.\nExplore more ways to use your HELOC\nWhether it's revitalizing your home, consolidating high-interest debts, investing in education, or fueling the growth of your business, a HELOC empowers you to turn aspirations into realities.\nConvenient loan, no hassle.\nConvenient loan, no hassle. Needed money for tuition, bills, etc and in 5 days I got the money. Thank you so much. You are a big help financially to my problem.\nWritten by customer— Flordeliza M.\nPainless way to borrow money\nWritten by customer— Laurence J.\nFigure was a breath of fresh air...\nWritten by customer— Steve M.\nQuick and painless HELOC\nWritten by customer— Margaret H.\n3452 Excellent Reviews on trust pilot\nTrustpilot reviews Opens in a new window.Discover our story & revolutionary technology\nThrough the integration of cutting-edge technology, Figure's platform fosters more transparent and efficient capital markets, bolstered by the growing pool of assets originated on its platform.\nAbout usGet started with a HELOC\nApply online in minutes, with funding in as few as 5 days.2: Navigates to numbered disclaimer Enjoy fixed rates,1: Navigates to numbered disclaimer skipping in-person appraisals to get the funds you need, fast.\nFind my rateJoin our partnership ecosystem\nOffer your customers a HELOC through our seamless partnership ecosystem, tailored to strengthen relationships and meet their needs with speed and efficiency.\nLearn moreStill have questions?\nEnhancing Lending Speed with AI\nWe were already a fast HELOC - now we're even faster. Powered by our partnerships with OpenAI's GPT and Google Gemini, this isn't just an upgrade; it's a game-changing evolution for the lending industry\nJoin the future of lending with FigureLower costs\nSlash processing costs.\nUnmatched efficiency\nOur AI lets your team focus on delivering exceptional customer experiences.\nLightning-fast transactions\nWe were already a fast HELOC - now we're even faster."
    },
    {
      "url": "https://www.pymnts.com/cryptocurrency/2025/circle-is-americas-first-publicly-traded-stablecoin-issuer-now-what/",
      "text": "On Thursday (June 5), Circle Internet Financial, the company behind the USDC stablecoin, debuted on the New York Stock Exchange (NYSE) under the ticker symbol “CRCL,” and did so with a bang, tripling in price by the day’s close and making its founder a paper billionaire.\nAfter pricing its initial public offering (IPO) at $31 per share, above the expected range, the stock opened at $69.50 and soared 168% during its first day of trading. Market interest caused the stock to surge so much that it was paused for volatility shortly after being listed. CRCL’s share price ultimately closed at $83.23, pushing the company’s value north of $18 billion.\nThe stablecoin issuer’s direct listing sees it join other firms such as Coinbase, Mara Holdings and Riot Platforms as one of the few pure-play crypto companies to list in the U.S.\nBut Circle’s debut represents more than a successful fundraising event. It marks a broader cultural and economic shift. For years, cryptocurrencies have lived at the margins of institutional finance, oscillating between hype cycles and regulatory crackdowns.\nWith Circle’s entry into the public market, a new chapter looks set to begin.\nWith blue-chip banks underwriting the deal and retail investors clamoring for shares, the traditional finance world appears more open than ever to embracing digital assets.\nOr, at least, the potentially regulated and transparent kind of digital assets.\nRead more: Circle’s IPO Goals Aimed at Becoming Digital Money’s Infrastructure Layer\nCircle and Future of Stablecoins\nCircle issues the world’s second-largest stablecoin, USDC (or USD Coin), which boasts a market capitalization of about $61 billion and plays second fiddle to the more embattled USDT stablecoin issued by Tether.\nOver $25 trillion in transaction volume has been processed using the token, according to the company. While USDC’s scale is still dwarfed by Tether’s USDT, USDC is widely regarded as the more transparent and regulation-friendly option. That reputation has helped Circle build deep relationships with both FinTech upstarts and legacy institutions.\n“Our transformation into being a public company is a significant and powerful milestone — the world is ready to start upgrading and moving to the internet financial system,” said Circle Co-Founder and CEO Jeremy Allaire.\n“From inception, we have been deeply focused on being trusted, transparent, compliant, ethical and well governed. Holding ourselves to the high standards of the NYSE and SEC rules and regulations further deepens those attributes.”\nThe company’s revenue model largely centers around interest earned on its reserve holdings. In 2024 alone, Circle reported $1.7 billion in revenue — a number driven by rising interest rates, increased adoption of USDC in global payments, and growing use among institutional clients.\nThe implications of Circle’s IPO are far-reaching. First, it lends unprecedented credibility to the stablecoin market. By successfully listing on the NYSE and attracting underwriters such as Goldman Sachs, JPMorgan and Citigroup, Circle has sent a strong signal to Wall Street: Stablecoins are not only here to stay, but they are also investable, scalable financial products with real-world utility.\nThis public listing offers increased transparency into Circle’s operations, governance and financials, which may set a new industry standard. Investors now have the ability to scrutinize Circle through quarterly reports, SEC filings and earnings calls — levels of visibility previously unavailable in the stablecoin space.\nRead more: Crypto Rulemaking Has FinTech Rushing in, TradFi Waiting to See\nInstitutional Confidence\nOne of the key advantages of going public is the enhanced regulatory clarity it affords. By becoming a publicly traded company, Circle must comply with a higher standard of regulatory oversight, including audits, disclosures, and governance practices. This alignment with U.S. financial norms could make Circle a preferred partner for banks, FinTechs and governments exploring stablecoin use cases.\nDespite the fanfare, Circle faces several challenges. First, the stablecoin market is becoming competitive. Those very same blue chip banks that helped take Circle public are themselves considering becoming stablecoin issuers. PYMNTS covered last month how JPMorgan Chase, Bank of America (BofA), Wells Fargo and Citigroup are exploring the launch of a jointly operated stablecoin.\nThat could be why Circle is hedging its bets by expanding its product offerings. Late last month, it was announced that the Circle Payments Network (CPN) is now live, enabling stablecoin-powered cross-border payments.\nAt the same time, the integration of stablecoins into the mainstream financial system is not without friction. Issues around consumer protection, systemic risk, and monetary policy remain unresolved.\nUltimately, however, Circle’s IPO is not just a financial milestone; it’s a statement of intent. It tells the world that stablecoins have graduated from the experimental phase and are ready to play a central role in the future of money."
    },
    {
      "url": "https://www.circle.com/",
      "text": "Make money movement your competitive edge\nJoin the thousands of visionary companies building with Circle for near-instant, low-cost, global stablecoin transactions.\nModern infrastructure for leading innovators\nCircle is building a new internet financial system, making money movement around the world as seamless as sending an email.\nPowered by USDC and EURC, and trusted by leading financial institutions since 2013, our platform connects traditional finance and digital assets to create a secure, always-on digital economy — unlocking opportunities for people and businesses globally.\nThe most licensed stablecoin company in the world\nUnited States\nMoney transmitter licenses (MTL) in 46 states, the District of Columbia, and Puerto Rico. BitLicense from the New York State Department of Financial Services (NYDFS). Registered as a “Money Services Business” with Financial Crimes Enforcement Network (FinCEN)\nEuropean Union\nFirst major global stablecoin issuer to achieve compliance with Markets in Crypto-Assets (MiCA). Electronic Money Institution license from the Autorité de Contrôle Prudentiel et de Résolution (ACPR). A Digital Asset Service Provider (DASP) registration from the Autorité des Marchés Financiers (AMF).\nUnited Kingdom\nElectronic Money Institution license from the Financial Conduct Authority (FCA).\nSingapore\nMajor Payment Institution (MPI) License from the Monetary Authority of Singapore (MAS).\nUnited Arab Emirates\nFirst stablecoins to be approved as recognized crypto tokens by the Dubai Financial Services Authority (DFSA).\nBermuda\nClass F Digital Asset Business license with Bermuda Monetary Authority (BMA).\nCanada\nFirst stablecoin issuer in compliance with the Ontario Securities Commission (OSC) and Canadian Securities Administrators’ (CSA) Value-Referenced Crypto Asset (VRCAs) requirements.\nJapan\nFirst foreign-issued fiat stablecoin permitted by Japan’s Financial Services Agency (JFSA) for local distribution by JFSA licensed intermediaries under the Payment Services Act.\nStay ahead of the curve with our comprehensive platform\nOur network is built around your success\nWe’re shaping what comes next\nMove money smarter\nPartner with Circle\nBuild with Circle\n- USDC and EURC are issued through regulated entities of Circle. A list of Circle’s regulatory authorizations can be found here.\n- Circle Mint supports international wires and domestic bank transfers in more than 185 countries. Circle Mint is currently only available to institutions.\n- USYC is issued by Circle International Bermuda Limited, regulated by Bermuda Monetary Authority (BMA), and represents an interest in a Cayman Islands mutual fund licensed by Cayman Islands Monetary Authority (CIMA). Information about USYC is directed only to entities who are not US Persons, as defined in Regulation S under the Securities Act of 1933.\n- Circle Technology Services, LLC (CTS) is the operator of Circle Payments Network (CPN) and offers products and services to financial institutions that participate in CPN to facilitate their CPN access and integration. CPN connects participating financial institutions around the world, with CTS serving as the technology service provider to participating financial institutions. While CTS does not hold funds or manage accounts on behalf of customers, we enable the global ecosystem of participating financial institutions to connect directly with each other, communicate securely, and settle directly with each other. CTS is not a party to transactions between participating financial institutions facilitated by CPN who use CPN to execute transactions at their own risk. Use of CPN is subject to the CPN Rules and the CPN Participation Agreement between CTS and a participating financial institution.\n- USYC is issued by Circle International Bermuda Limited, regulated by Bermuda Monetary Authority (BMA), and represents an interest in a Cayman Islands mutual fund licensed by Cayman Islands Monetary Authority (CIMA). Information about USYC is directed only to individuals and entities who are not US Persons, as defined in Regulation S under the Securities Act of 1933.\n- Circle Mint and money transmission services are provided by Circle Internet Financial, LLC. Circle Internet Financial, LLC, NMLS # 1201441, is a licensed provider of money transmission services. A full list of Circle’s licenses can be found here.\n- Circle Technology Services, LLC (“CTS”) is a software provider and does not provide regulated financial or advisory services. You are solely responsible for services you provide to users, including obtaining any necessary licenses or approvals and otherwise complying with applicable laws. For additional details, please click here to see the Circle Developer terms of service.\n- All-time volume represents the total amount of USDC onchain activity that took place between September 2018 and Apr 14, 2025 8:00 PM. This represents EVM token transfer volume on native and canonically bridged USDC on the following chains: Arbitrum, Avalanche, Base, Binance Smart Chain, Ethereum, Linea, Mantle, OP Mainnet, Polygon PoS, ZKSync.\n- As of April 2025."
    },
    {
      "url": "https://www.pymnts.com/cryptocurrency/2025/bullish-aims-to-take-crypto-exchange-public-following-circles-success/",
      "text": "The company has confidentiality filed paperwork for an initial public offering (IPO) with the U.S. Securities and Exchange Commission (SEC), according to a Wednesday (June 11) Financial Times (FT) report citing two sources familiar with the matter.\nPYMNTS has contacted Bullish for comment but has not yet gotten a reply.\nBullish tried to go public in 2021 via a merger with special purpose acquisition company (SPAC) Far Peak. However, the two firms called off the plan due to regulatory hurdles in late 2022.\nBut that was under a different administration. With crypto-friendly President Donald Trump in office, investors have grown much more enthusiastic about cryptocurrency. The administration’s pro-crypto stance has helped bring the price of bitcoin to record levels, and inspired other digital asset firms to seek public listings.\nThese include Circle, which raised $1.1 billion last week with its IPO, more than doubling expectations. The FT report notes that the company surged 168% on its market debut. That’s the largest-ever first day stock price increase for a billion-dollar U.S. listing, according to Renaissance Capital, which monitors. IPO issuance.\nThe report also points out that Circle’s success seems to have spurred other crypto companies to follow in its footsteps. Aside from Bullish, Gemini — the crypto exchange run by the Winklevoss brothers — confidentially filed for its IPO last week.\nWriting about Circle’s listing last week, PYMNTS noted that the company still faces numerous challenges despite the recent fanfare.\nFor one thing, the market around stablecoins has grown increasingly competitive. The big banks that helped take Circle public are also weighing the idea of issuing stablecoins of their own. As covered here in May, JPMorgan Chase, Bank of America, Wells Fargo and Citigroup are exploring the creation of a jointly operated stablecoin.\nThis might be why Circle is hedging its bets by expanding its product line-up. In late May, the company announced the launch of the Circle Payments Network (CPN) is now live, enabling stablecoin-powered cross-border payments.\nStill stablecoins’ integration into the mainstream financial system is not without friction, with issues around consumer protection, systemic risk and monetary policy still unresolved.\n“Ultimately, however, Circle’s IPO is not just a financial milestone; it’s a statement of intent,” the report added. “It tells the world that stablecoins have graduated from the experimental phase and are ready to play a central role in the future of money.”"
    },
    {
      "url": "https://www.pymnts.com/cryptocurrency/2025/sec-says-caveat-liquid-staker-to-corporate-treasury-teams-buying-crypto/",
      "text": "Opportunities and risks tend to present themselves in equal measure for CFOs and treasury teams — and that becomes infinitely more so when it relates to crypto.\nParticularly as the movement of cryptocurrency markets from fringe speculation, bordering on untouchable, to the present day landscape of widening corporate embrace is being hastened along by an unlikely ally: the U.S. Securities and Exchange Commission’s (SEC) corporate finance division.\nIn a recent detailed statement, the SEC’s Division of Corporation Finance concluded that under a very specific set of facts liquid staking arrangements, and the “staking receipt tokens” they produce, do not involve the offer or sale of securities. Securities classification triggers a host of registration, disclosure, and compliance obligations.\nUpwards of 154 public companies have committed $98.4 billion of their treasury dollars for crypto purchases just this year alone. For chief financial officers (CFOs) and treasury managers weighing whether, or how, to put idle crypto assets to work, that distinction over staking from the SEC matters.\n“It is the Division’s view that participants in Liquid Staking Activities do not need to register with the Commission transactions under the Securities Act, or fall within one of the Securities Act’s exemptions from registration in connection with these Liquid Staking Activities,” the SEC wrote.\nBut the catch is that the SEC’s green light applies only under a highly controlled set of assumptions. Step outside those parameters, and you may be in regulatory gray, or even red, territory.\nAfter all, for finance teams, and as SEC Commissioner Caroline Crenshaw wrote in a dissenting opinion, a truer reality may be “caveat liquid staker.”\nRead more: 4 Questions CFOs Need to Ask as Wall Street Embraces Stablecoins\nWhat the SEC Actually Said and Why It Matters to Finance Teams\nLiquid staking has exploded in popularity since Ethereum’s transition to proof-of-stake and the subsequent unlocking of staked ether in 2023. It offers token holders a way to participate in network staking rewards while maintaining liquidity. Instead of locking up assets for months, participants deposit their tokens with a “liquid staking provider” and receive a newly minted “staking receipt token” in return.\nThe SEC’s Aug. 5 statement defines two core models, protocol-based providers and third-party custodians or service providers.\nProtocol-based providers are ecosystems where smart contracts automatically handle custody, staking and receipt-token issuance, with no human intermediary; while third-party custodians or service providers represent entities that hold the assets, arrange for staking (directly or via a node operator) and issue the receipt tokens themselves.\nFrom a corporate perspective, the key takeaway is that under either model, if the provider’s role is strictly “administrative or ministerial” and not managerial, the arrangement likely falls outside the definition of a security.\nStill, for CFOs, that translates to heightened due diligence: you can’t just take a provider’s word that their service is “compliant with the SEC’s view.” You need independent verification of their operational model against the Division’s fact pattern. Risk-focused assessments, for example, can include things like code audit reviews, capital adequacy analysis, operational resilience, regulatory posture, custody model details, insurance layers (e.g., to cover loss from bugs or hacks) and historical uptime.\nUltimately, any highly interconnected financial infrastructure can carry compounding risks. Unlike traditional assets, crypto systems, once thought to be relatively siloed, are increasingly webbed via staking aggregators, synthetic token markets, cross-chain bridges and lending desks. A shock to one node could propagate across counterparties, protocols and liquidity pools, impacting treasury liquidity just as it might in legacy systems.\nSee also: Stablecoin Sandwiches? Here’s What CFOs Need to Know About Crypto Jargon\nSetting the Table for Strategic Experimentation\nAt its essence, liquid staking permits crypto holders to deposit their tokens (for example, Ethereum) with a staking provider. In return, they receive synthetic derivatives, often ERC-20 tokens, that represent a claim on the staked assets plus accrued rewards.\nUsers continue earning staking yields while retaining market exposure via the synthetic variant. In practical terms, liquid staking combines two traditionally opposed functions: earning staking rewards (normally requiring lockups) and maintaining liquidity for trading, lending or other corporate purposes.\nFor CFOs and treasurers, liquid staking need not be a leap of faith. It can be a calibrated experiment.\n“Ethereum isn’t a static asset. It’s programmable infrastructure,” Dave Merin, co-founder and CEO of The Ether Machine, told PYMNTS. “Ethereum is the largest proof-of-stake network by a wide margin. That scale means more yield opportunities, a broader security moat, and a stronger economic flywheel.”\n“We think we can generate 2x the yield of an ETF, conservatively,” Merin added. “And when you layer on things like restaking or engaging in DeFi, we think we can deliver a vastly superior product. Our team knows these protocols intimately. We’re not guessing, we’re building the infrastructure that others will later follow.”"
    },
    {
      "url": "https://www.pymnts.com/news/ipo/2025/figure-plans-ipo-for-blockchain-based-lending-platform/",
      "text": "The company, which employs blockchain technology for home loans and offers cryptocurrency-backed loans, announced Monday (Aug. 4) that it had filed confidentially for an initial public offering (IPO) with the Securities and Exchange Commission (SEC).\n“The number of shares to be offered and the price range for the proposed offering have not yet been determined. The offering is subject to market and other conditions, as well as the completion of the SEC’s review process,” the company said in a news release.\nBloomberg News had reported in 2023 that the company was preparing for an IPO after its lending division recorded a record $900 million in quarterly volume.\nThe company’s new IPO plans are happening amid a rebound in digital asset lending, as PYMNTS reported last month.\nA July 26 report on the topic by the Financial Times (FT) points to the example of San Francisco lender Divine Research, which had made roughly 30,000 unbacked short-term loans since December, teaming with OpenAI’s Sam Altman’s iris-scanning company World to identify borrowers.\n“We’re loaning to average folks like high school teachers, fruit vendors … basically anyone with access to the internet can get access to our funds,” Divine’s founder Diego Estevez said in an interview with the FT. “This is microfinance on steroids.”\nThat report added that Divine offers loans of under $1,000 worth of Circle’s stablecoin USDC to cash-strapped customers, most of whom are underserved by “traditional institutions,” as the company puts it.\nWriting about the crypto lending space early this summer, PYMNTS pointed to an April report from data center infrastructure and digital assets company Galaxy, which estimated that the crypto lending market, including crypto collateral debt, had reached $36.5 billion by the end of last year.\n“That’s down significantly from a peak of more than $64.4 billion in 2021, as several lenders had gone out of business,” PYMNTS wrote. “But in the current environment, where the runway is being built via legislation and regulatory rollbacks to bring cryptos more fully into banking, the lending activity is poised to accelerate.”\nThe Office of the Comptroller of the Currency (OCC) in March issued a letter that revoked earlier guidelines on crypto and paved a path for banks and lenders to permit digital holdings to be part of secured lending activity."
    },
    {
      "url": "https://www.pymnts.com/cryptocurrency/2022/crypto-company-bullish-and-spac-far-peak-end-proposed-deal/",
      "text": "The operator of the regulated cryptocurrency trading platform Bullish exchange and the special purpose acquisition company (SPAC) Far Peak Acquisition said in a Thursday (Dec. 22) press release that they have mutually agreed to terminate their proposed business combination.\n“Our quest to become a public company is taking longer than expected, but we respect the SEC’s [Securities and Exchange Commission’s] ongoing work to lay new digital asset frameworks and clarify industry-specific disclosure and accounting complexities,” Bullish Chairman and CEO Brendan Blumer said in the release.\nAfter 18 months of work since announcing their business combination agreement in July 2021, the firms determined that they would be unable to have Bullish’s registration statement on Form F-4 declared effective in time for Far Peak to have its shareholders vote on the proposed business combination before Dec. 31, the date on which they had agreed that both companies could terminate the agreement if it hadn’t been consummated, according to the press release.\n“We are disappointed that we were unable to present the Bullish transaction to our Far Peak shareholders,” Far Peak Chairman and CEO Thomas Farley said in the release. “Bullish’s accomplishments since its launch have lived up to our expectations, and their daily trading volumes highlight their remarkable growth.”\nBullish exchange is available in 50 jurisdictions, works within regulatory compliance frameworks and gives institutional and retail traders access to deep liquidity and low-cost transactions, according to the press release.\n“I’m proud of the dedicated team of Bullish employees and advisers who have devoted countless hours to ensure Bullish operates with the highest standards of transparency and responsibility,” Blumer said. “This work has formed the operating foundation required to service our customers in the best and safest possible way.”\nPYMNTS research has found that pace of SPAC deals involving FinTech companies has slowed to the low single digits in most verticals.\nAs PYMNTS reported Monday (Dec. 19), SPACs, facing increased regulatory scrutiny, are pressured to rein in optimistic forecasts that used to lure investors. Not only that, but increased scrutiny leads to higher operating costs, which leads to lower margins, and thus, lower returns for the investors."
    }
  ],
  "argos_summary": "Cryptocurrency exchange Bullish has increased its initial public offering (IPO) size, now planning to offer 30 million shares at $32 to $33 each, potentially raising $990 million and valuing the company at approximately $4.8 billion. This follows a previous attempt to go public via a merger with SPAC Far Peak, which was halted due to regulatory challenges. The IPO comes amid a growing interest in cryptocurrency, particularly after Circle's successful IPO, which raised $1.1 billion and significantly boosted the credibility of stablecoins in the financial market.",
  "argos_id": "6T4OQA3O9"
}