{
  "url": "https://www.dallasnews.com/sports/rangers/2025/08/11/texas-rangers-mlb-nathan-eovaldi-cy-young-comeback-arizona-diamondbacks/",
  "authorsByline": "Evan Grant",
  "articleId": "67716d4fcbb841cbb73a2e99977f5364",
  "source": {
    "domain": "dallasnews.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "TX",
      "county": "Dallas County",
      "city": "Dallas",
      "coordinates": {
        "lat": 32.7762719,
        "lon": -96.7968559
      }
    }
  },
  "imageUrl": "https://dmn-dallas-news-prod.cdn.arcpublishing.com/resizer/v2/LS4PNV2XBFFGBPNN37RYFCXLJ4.jpg?auth=b3dbcf6fbb8a8dd174e0fd3d916da79ada8a843a30e9d3e85186d9243f6f2230&quality=80&width=1200&height=630&smart=true",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T04:40:03.706000+00:00",
  "addDate": "2025-08-12T04:50:20.432473+00:00",
  "refreshDate": "2025-08-12T04:50:20.432475+00:00",
  "score": 1.0,
  "title": "Rangers fittingly bail out Nathan Eovaldi for a change in biggest comeback of season",
  "description": "“We won and that’s all that matters,” Eovaldi said after allowing five runs, including three homers in five innings of work Monday.",
  "content": "ARLINGTON - It was only fair.\n\nNathan Eovaldi has saved the Rangers time and time and time again in this uneven season of offensive unpredictability. The least they could do for him was bail him out for a change. The net deficit will still be insurmountable, but for a team trying to cling to playoff hopes through a stormy start to August, it will do just fine: Rangers 7, Arizona 6 in 10 innings.\n\n“We won and that’s all that matters,” Eovaldi said after allowing five runs, including three homers in five innings of work Monday due to an unexpectedly erratic splitter and some fastball location issues. “I’ll work on the side to go and figure out everything that I need to work on. But regardless of how well I do out there, it’s about us, about the team winning games, especially with where we are at this point of the season. That’s the only thing that matters.”\n\nThis, of course, may be put to the test. It’s possible Eovaldi sacrificed his burgeoning Cy Young candidacy, built mostly on a historic ERA pace. In return, the Rangers pulled off their biggest comeback win of the season, erasing a five-run deficit heading to the bottom of the sixth.\n\nAlong the way, Wyatt Langford broke out of a month-long power drought to get the Rangers back in the game. Bruce Bochy, sensing the importance or desperation of the moment, turned to his high-leverage relievers despite trailing; they responded by retiring 12 of the last 13 Diamondbacks. Rowdy Tellez imitated Corey Seager’s World Series trick with a game-tying homer in the bottom of the ninth. And Jake Burger, who has recently been reduced to platoon status, delivered a game-winning walkoff single off the left field wall, doing what he hasn’t done at all this year, getting out ahead of a pitch and pulling it in the air.\n\nIt all added up a win that stopped the Rangers four-game losing streak and kept them above .500. Even gained them a little ground on Cleveland, the team directly ahead of them in the wild card standings. The Guardians were off, but a half-game is still a half game.\n\nMost importantly, it perhaps pumped some plasma back into a team that looked as if it was teetering in the last week. Even Bochy acknowledged the importance/desperation of the moment, both with actions and words. The actions: After the Rangers got within a run on Langford’s three-run homer, his first in exactly one month, he turned to a procession of guys who typically pitch only with a lead: Danny Coulombe, Shawn Armstrong, Hoby Milner and Phil Maton.\n\nThe words: “I think it says one thing: That we need to win a ballgame. Normally, I probably wouldn’t do that but this is a game I thought would be really, really big for the club to win. They were fresh and they were good to go and did a really nice job. It was a game that I just felt like once we got so close and with how hard they fought, we needed to do what we can to keep it there. And give us a chance to win.”\n\nAll things considered, it still seemed a bit desperate. The Rangers have not been a team prone to comebacks this season. Until Monday, the biggest deficit they’d overcome to win a game was two runs. They’d done that twice.\n\nEovaldi’s struggles with his splitter led to three homers and two hit batsmen in five innings. It was the first time in his career, he allowed both multiple homers and hit batters in the same start. Entering the game, Eovaldi had allowed only five homers in 111 innings this season, a big reason why his ERA sat at 1.38. When it was all done, it rose to 1.71 for 116 innings. He still has the lowest ERA in the AL among pitchers with at least 100 innings, but his edge over Boston’s Garrett Crochet shrunk. Also: He still falls short of qualifying for the official league leaders.\n\nConsider that his ERA through 19 starts was the fifth-lowest in the 105 years of the “Live Ball Era.” Historic. After 20 starts, 1.71 is merely impressive. There have been 27 other such occurrences.\n\nBut the night wasn’t about what might have been lost individually. Or what might be gained long-term for an offense that has defied explanation all year long. Could it give the Rangers a boost of energy? Sure. Then again, it’s a question that’s been asked over and over after a win ended a stretch of inconsistency.\n\nNo, right now, it’s not about considering the future. It’s about considering the present. The Rangers needed to win a game Monday. They’ll need to win just as badly on Tuesday. And that is likely to be the case every night the rest of the way. What mattered was that they played a game on Monday and won.\n\n“We all needed this win as a group,” Tellez said, emphasizing “all.” “Sometimes it happens as a group. Sometimes it’s one guy that does it.”\n\nFor most of the season, when Eovaldi has started, it’s fallen on one guy: Him. On Monday, the group picked him up.\n\nFind more Rangers coverage from The Dallas Morning News here.",
  "medium": "Article",
  "links": [
    "https://www.dallasnews.com/topic/nathan-eovaldi/",
    "https://www.dallasnews.com/help/terms-of-service/",
    "https://www.dallasnews.com/sports/rangers/2025/08/11/texas-rangers-mlb-walk-off-win-arizona-diamondbacks/",
    "https://www.dallasnews.com/help/privacy-policy",
    "https://www.dallasnews.com/sports/stars/2025/08/11/stars-release-2025-26-promotional-schedule-featuring-mikko-rantanen-bobblehead-night/",
    "https://www.dallasnews.com/sports/rangers/2025/08/11/texas-rangers-mlb-first-base-platoon-jake-burger-rowdy-tellez/",
    "https://www.dallasnews.com/sports/rangers/",
    "https://www.dallasnews.com/sports/rangers/2025/08/11/texas-rangers-mlb-offense-chris-young-bruce-bochy/",
    "https://www.dallasnews.com/person/e0bf7fd3-00ec-c3a9-008a-1e575af2a56d/corey-seager/",
    "https://www.dallasnews.com/topic/texas-rangers/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "games",
      "weight": 0.07510796
    },
    {
      "name": "more Rangers coverage",
      "weight": 0.07257469
    },
    {
      "name": "Rangers",
      "weight": 0.07244856
    },
    {
      "name": "Nathan Eovaldi",
      "weight": 0.06463056
    },
    {
      "name": "biggest comeback",
      "weight": 0.06234428
    },
    {
      "name": "Eovaldi",
      "weight": 0.061766893
    },
    {
      "name": "season",
      "weight": 0.05696027
    },
    {
      "name": "Monday",
      "weight": 0.045583304
    },
    {
      "name": "Shawn Armstrong",
      "weight": 0.043891285
    },
    {
      "name": "Hoby Milner",
      "weight": 0.043536186
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.97900390625
    },
    {
      "name": "/Sports/Team Sports/Baseball",
      "score": 0.939453125
    }
  ],
  "sentiment": {
    "positive": 0.18746096,
    "negative": 0.55992836,
    "neutral": 0.25261068
  },
  "summary": "The Rangers overcame a five-run deficit to win their biggest comeback of the season against Arizona, erasing a deficit of five runs in 10 innings. Nathan Eovaldi was benched after allowing three home runs in five innings due to an erratic splitter and some fastball location issues. The win, which halted a four-game losing streak and kept the Rangers above.500, gained them ground on Cleveland in the wild card standings. The team's overall score is still half-game behind Cleveland, but it may have boosted the team's chances of reaching the playoffs. Eovaldo's performance may risk his Cy Young candidacy, but he insists that the team is the only thing that matters.",
  "shortSummary": "The Rangers' biggest comeback of the season, aided by Nathan Eovaldi's actions, secured a crucial win over Arizona, boosting their playoff hopes with their performance.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "68af7ecaffa542cd800fc3615be15069",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.dallasnews.com/sports/rangers/2025/08/11/texas-rangers-mlb-first-base-platoon-jake-burger-rowdy-tellez/",
      "text": "ARLINGTON — If it looks like a platoon and swings like a platoon, it is most likely a platoon.\nThat’s what the Rangers have at first base at the moment.\nAgainst right-hander Ryne Nelson on Monday, the Rangers started left-handed hitting Rowdy Tellez. It was the second straight game Tellez started at first. Right-handed hitting Jake Burger, who was activated Friday following a three-week stint on the injured list because of a quadriceps strain, started against lefties the first two nights back.\n“I haven’t said that [it’s a platoon],” manager Bruce Bochy said. “But that’s kind of how I’m doing it right now, especially with how Burger’s quad has been.”\nBurger’s performance against right-handed pitching this year has lagged. He’s hitting just .220/.248/.376/.624 against right-handed pitching in 226 plate appearances. The on-base percentage is particularly telling. It is the third lowest among 237 major leaguers with at least 200 plate appearances against right-handers this season. It underscores the all-or-nothing element that is the Rangers’ lineup.\nTellez hasn’t been significantly better at reaching base against right-handers, posting a .268 OBP in 192 plate appearances entering Monday, but he has slugged at a .469 clip to post a .737 OPS against right-handers.\nFind more Rangers coverage from The Dallas Morning News here."
    },
    {
      "url": "https://www.dallasnews.com/sports/rangers/2025/08/11/texas-rangers-mlb-offense-chris-young-bruce-bochy/",
      "text": "ARLINGTON - A Rangers official posed a question Monday: Have all the columns about the ineffectiveness of the offense been exhausted?\nOf topics, the Rangers’ offense has been a prolific producer. Of actual runs: Not so much.\nIt’s been established the Rangers offense struggles against lefties. Also: on the road. Add top-tier pitching, too. Much of that can be explained by pure physical deficiencies or something as easy as playing away from home. What may be most damning about an offense that has become accustomed to profanity is this: The team doesn’t seem to get better as the game progresses.\nWhat it suggests: Either a lack of feel or as president of baseball operations Chris Young once described it earlier this year a lack of “connectivity.”\nConsider the natural flow of the game. Some teams are hot starters, other are not. But according to league averages, teams see about a 4% increase in run production from the first three innings to the middle three. Pitchers have shown most or all of their repertoire the first time through the order. They may start to fatigue. The advantage moves towards the hitter. Then, when facing high-leverage relievers late in games, it drops off again.\nNot the Rangers. They start out OK enough, ranking 12th in the majors in run scored through the first three innings. Then, when other offenses are figuring things out, they go flat. They have a dropoff of 6% in scoring in innings 4-6 and their 119 total runs from the seventh through the ninth are last in baseball.\nThat sure appeared to be crystal clear over the weekend, when the Rangers scored in the first inning of all three games against Philadelphia, then scored a total of one run after that.\nIt’s what made Monday’s 7-6 comeback win over Arizona such a surprise. The Rangers didn’t start out well, but rallied for four runs in the sixth inning against starter Ryne Nelson to make a game of it. Then they tied it on Rowdy Tellez’s ninth-inning homer. It was the club’s third game-tying, ninth-inning homer this season. All have come in the last 30 days.\n“I know it’s there because I’ve seen it,” co-hitting instructor Bret Boone said Monday. “But why do we go in these extreme lows? Is it a lack of focus? No, these guys want to win. They want to do well. We do all get caught up in our individual numbers. I’d be lying to you if I always thought, ‘Oh, I’m not worried my number. Let’s just win.’ No, let’s just win. But I want my numbers too. You want to contribute.\n“The thing that really just grates on me is when we have a runner on third and less than two outs. Let’s get this runner in. I love it when we move the runner. The energy is unbelievable. And I can’t tell you the difference between scoring one run in an inning and two. It’s a world of difference. I can’t say they they’re not capable of making adjustments, but you have a fair point that we’ve gone through streaks during the season - and big streaks - where we tend to take the middle innings off, and now all of a sudden, it’s 2-2 in the eighth and we’re facing high leverage guys.”\nAbout that: Different ending, too. In the 10th, with Sam Haggerty on second and with Corey Seager issued an intentional walk, Marcus Semien drove a ball to deep enough center to advance the winning runner to third.\nMaybe the best way to measure guys ability to make adjustments from at-bat to at-bat is in on-base percentage. Getting on base moves the line and continues to build stress on the pitcher.\nThe Rangers OBP stays essentially flat innings 1-3 (.312) to innings 4-6 (.311), then drops precipitously in the late innings (.269). Among the biggest dropoffs from the first three to the middle three are Josh Smith (.402 to .308), Josh Jung (.360 to .224), Kyle Higashioka (.361 to .196) and Adolis García (.301 to .264).\nBoth Smith and Jung, each in their first three seasons, acknowledged that pitchers are gaining an advantage on them.\n“Maybe they are making a better adjustment off of me based on my first at-bat and I’m not properly adjusting to them,” Smith said. “I don’t think I change a lot from at-bat to at-bat. It could just be coincidence.”\nIt could. It could also be yet another telling sign that this offense simply doesn’t work as intended.\nEven manager Bruce Bochy, who does everything he can to find reasons to support his offense, had a hard time trying to dismiss it.\n“We talk about it, how important it is every inning,” Bochy said. “I wish I had a good answer for you. It shouldn’t happen.”\nYet it has. At least on Monday, the Rangers offered a different ending.\nFind more Rangers coverage from The Dallas Morning News here."
    },
    {
      "url": "https://www.dallasnews.com/sports/stars/2025/08/11/stars-release-2025-26-promotional-schedule-featuring-mikko-rantanen-bobblehead-night/",
      "text": "It’s never too early to start planning ahead, right?\nThe Dallas Stars released their promotional schedule for the 2025-26 season on Monday. It includes the team’s recognition nights, giveaways and theme nights.\nSome of the highlights include Pickleball Night, in which fans can get a limited edition Stars pickleball paddle, Mikko Rantanen bobblehead night, three different Retro Nights, Texas Rangers Night, Video Game Night and more.\nIn what will probably be the most popular promotion of the year, you should probably plan to get to the American Airlines Center early on November 4 when the Stars take on the Oilers if you want to land your own Rantanen bobblehead.\nSee the full schedule below.\nHome opener: Oct. 14 vs. Wild\nFans can score a magnet schedule at the Stars’ first home game of the year\nCollege nights\nThe Stars are partnering with 10 local colleges, and you can purchase a ticket through the Stars’ campaign to get a co-branded hat split between the Stars and that night’s college. Texas, Texas A&M, Texas Tech, UT-Dallas, North Texas, SMU, Oklahoma State, UT-Arlington and Baylor are each represented in the promotion.\nSee the dates for each college’s night here.\nPickleball Night: Oct. 23 vs. Kings\nEach discounted ticket purchased through the Stars’ offer will include a Dallas Stars Volair Pickleball Paddle.\nHalloween: Oct. 28 vs. Capitals\nEnjoy a spooky evening at the AAC in your favorite Halloween costume as Dallas faces Washington.\nMikko Bobblehead Night: Nov. 4 vs. Oilers\nGet there early if you want to land a Mikko bobblehead! Doors open at 5:30 p.m. and fans will probably be lining up well before then to get their bobblehead of the Moose.\nMilitary and Veterans Appreciation Night: Nov. 9 vs. Kraken\nA limited number of military-themed hats will be given out to early-arriving fans. Doors open at 4:30 p.m. and puck drops at 6 p.m.\nDallas Stars Hall of Fame Celebration Night: Nov. 15 vs. Flyers\nThe team is honoring Ralph Strangis and Joe Nieuwendyk for their induction into the Dallas Stars Hall of Fame. Fans can get a commemorative poster upon entry.\nDaryl “Razor” Reaugh Hockey HOF Celebration: Nov. 18 vs. Islanders\nThe Stars’ longtime color analyst is being inducted into the Hockey Hall of Fame and the team is celebrating his achievement with a night full of “Razor-isms”\nScout Night: Nov. 18 vs. Islanders\nTickets purchased through the Stars’ promotion will come with a custom Stars scout patch.\nRetro Nights: Nov. 28 vs. Mammoth, Nov. 30 vs. Senators, Jan. 23 vs. Blues\nThe Stars say that Retro Night will include “an entertaining show that blends nostalgic throwbacks with the sport of hockey.”\nHockey Fights Cancer Night: Dec. 5 vs. Sharks\nThe Stars will be fighting against cancer on Hockey Fights Cancer Night and “I Fight For” cards will be available for fans who would like to honor loved ones who have dealt with cancer.\nHoliday Games: Dec. 13 vs. Panthers, Dec. 15 vs. Kings, Dec. 21 vs. Maple Leafs\nThese three home games will be embracing the holiday season as the Stars get in the Christmas spirit.\nNew Year’s Eve Game: Dec. 31 vs. Sabres\nGo ring in the New Year at the AAC in a New Year’s Eve-themed night as the Stars face the Sabres.\nTeacher Appreciation Night: Jan. 4 vs. Canadiens\nThe Stars are giving away a teacher appreciation tote cooler bag to fans who purchase tickets through the team’s “Teacher Tickets” offer.\nKids Day: Jan. 18 vs. Lightning\nKids ages 13 and under will get a special giveaway upon entry while supplies last.\nTexas Rangers Night: Jan. 20 vs. Bruins\nAre you a baseball fan and a hockey fan? You can scratch both those itches on Rangers Night at the AAC when a limited number of tickets will be available through an offer that will include a co-branded Stars-Rangers baseball jersey.\nBlack History Night: Feb. 4 vs. Blues\nThe Stars are celebrating Black History Month and will be giving away a Black History Night poster at the door.\nCareer Fair: Feb. 25 vs. Kraken\nThe Stars are hosting a career fair in the afternoon at the AAC for anyone wanting to work in sports. Purchasing a ticket to the career fair includes access to the Stars’ game against the Kraken.\nCountry Western Night: Feb. 25 vs. Kraken\nCareer Fair Night will have a country twist to it, too! There will be an unspecified giveaway to early-arriving fans.\nVideo Game Night: March 6 vs. Avalanche\nThe Stars say that this theme night will have “an entertaining show that blends your favorite video game concepts with the sport of hockey.” Tickets bought through their theme night link will include an Optic Gaming co-branded jersey.\nNoche Mexicana: March 10 vs. Golden Knights\nEarly-arriving fans can enjoy some Mexican cuisine and more on the plaza, including a replica fútbol jersey upon entry to the AAC. The game will include performances by various Mexican-American artists.\nFirst Responders Night: March 16 vs. Mammoth\nAll tickets purchased through the Stars’ Responders Night promotional link will include a Stars-First Responders co-branded hat.\nPride Night: March 24 vs. Devils\nThe Stars will celebrate the LGBTQIA+ community during this game and early-arriving fans will receive Pride Night themed socks.\nAlumni Game: April 4 vs. Avalanche\nAfter the Stars face the Avalanche in a playoff rematch, some Dallas Stars Alumni will take the ice for the annual alumni game.\nFan Appreciation Night: April 11 vs. Rangers\nOn the final home game of the season, the Stars will be celebrating their fans with special giveaways and prizes throughout the evening."
    },
    {
      "url": "https://www.dallasnews.com/topic/nathan-eovaldi/",
      "text": "“We won and that’s all that matters,” Eovaldi said after allowing five runs, including three homers in five innings of work Monday.\nAfter a six-game win streak vaulted them squarely into wild card contention, a rocky stretch has changed the Rangers playoff outlook.\nEovaldi has risen into Cy Young contention and has a chance to become the first Texas Rangers pitcher to win the award.\nEovaldi has burst into contention with a historically low ERA and a knack for winning when Texas absolutely needs it.\nTexas’ 35-year-old ace has orchestrated one of the single best starts to a season in modern baseball history.\nEovaldi allowed just one hit in eight shutout innings for the Rangers, shutting down one of baseball’s best lineups.\nEovaldi finished last month with a 5-0 record and a 0.59 ERA in five starts.\nEovaldi stands to be the AL’s Pitcher of the Month, as well.\nChris Young believes that making the Rangers’ elite pitching staff even better was the best way to approach the deadline.\nTexas, Seattle and Houston each made aggressive plays at Thursday’s wild trade deadline, making the AL West even more intriguing.\nEovaldi delivered in a 6-3 victory over the Los Angeles Angels on Wednesday night.\nThere was some discussion that Texas could move Eovaldi’s start back from Wednesday so he could open the series vs. Seattle on Thursday.\nIn a shocking turn of events, the scorching-hot Rangers have positioned themselves to be buyers at the trade deadline.\nEven without his best stuff, Eovaldi shut down the Atlanta Braves as the Rangers won in his first start since July 13.\nThe Rangers entered Friday dead last in OBP, slugging and OPS against left-handed pitching, but Haggerty’s prowess showed in the opener against Atlanta.\nAfter four dismal seasons in Washington, Corbin has become a reliable piece of the Rangers’ league-best rotation.\nEovaldi’s status has been up in the air since he was scratched from Sunday’s start with back soreness.\nPlus, Texas is “targeting Wednesday” for right-handed pitcher Nathan Eovaldi to start after dealing with back soreness.\nBruce Bochy and the Rangers have options, even more so with Jon Gray set to return from injury as well."
    }
  ],
  "argos_summary": "The Texas Rangers achieved a dramatic 7-6 comeback victory over the Arizona Diamondbacks, overcoming a five-run deficit and ending a four-game losing streak. Nathan Eovaldi, despite struggling with his pitching, emphasized the importance of the team's win over individual performance, as the Rangers aim to maintain their playoff hopes. Wyatt Langford's three-run homer and Rowdy Tellez's game-tying shot in the ninth inning were pivotal, leading to Jake Burger's walk-off single in the tenth, showcasing the team's resilience amid a challenging season.",
  "argos_id": "6UUL4UVFI"
}