{
  "url": "https://www.pcmag.com/news/russian-romcom-hackers-exploit-winrar-flaw-via-phishing-emails",
  "authorsByline": "Michael Kan",
  "articleId": "d5029af062724161ae1944c7393ef4e1",
  "source": {
    "domain": "pcmag.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://i.pcmag.com/imagery/articles/043c8h0DLJiKq0HOhMV7yiS-1.fit_lim.size_1200x630.v1754924883.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T16:40:00+00:00",
  "addDate": "2025-08-11T19:43:49.628896+00:00",
  "refreshDate": "2025-08-11T19:43:49.628897+00:00",
  "score": 1.0,
  "title": "Russian 'RomCom' Hackers Exploit WinRAR Flaw Via Phishing Emails",
  "description": "ESET warns that at least two Russian hacking groups are using the zero-day flaw in WinRAR for cyberespionage purposes.",
  "content": "Russian hackers appear to be using a new flaw in WinRAR to try and spread malware to companies in Europe and Canada, according to security researchers.\n\nAntivirus provider ESET today provided more details about the WinRAR vulnerability, warning that a Russian hacking group called RomCom has been exploiting it for cyberespionage.\n\nThe bug, dubbed CVE-2025-8088, was quietly patched on July 30 with version 7.13 of WinRAR. But starting on Friday, the security community began sounding the alarm about the threat after ESET revealed RomCom had been abusing the flaw through phishing emails.\n\nThe flaw can be used to attack Windows PCs by letting a hacker create a malicious archive. Normally, WinRAR will extract files from an archive to a user-selected destination. But ESET researchers discovered the Russian hackers exploiting a bug in WinRAR, which can cause it to extract files to a hacker-selected destination on the PC.\n\nSpecifically, RomCom’s booby-trapped archives can extract hidden malicious files to the Windows startup directory, causing a PC to immediately run them upon startup. The installed backdoors can then be used to secretly steal data from an infected computer.\n\nTo convince recipients to open the booby-trapped archive, the phishing emails pretended to come from interested job applicants and contained an attached resume inside the malicious RAR archive. The phishing email campaign lasted from July 18-21, “targeting financial, manufacturing, defense, and logistics companies in Europe and Canada,” ESET says.\n\n“According to ESET telemetry, none of the targets were compromised. The attackers, however, had conducted reconnaissance beforehand, and the emails were highly targeted. Successful exploitation attempts delivered various backdoors used by the RomCom group – specifically, a SnipBot variant, RustyClaw, and the Mythic agent,” ESET added.\n\nThe vulnerability also affects 7.12 and earlier versions of WinRAR. ESET reported the threat to WinRAR on July 18, which led to its software developer rolling out a patch in version 7.13.\n\nHowever, WinRAR doesn’t have an auto-update mechanism. So, users will need to manually install the new version to protect themselves from the flaw.\n\nIn another disturbing find, ESET added: “We are aware that this vulnerability has also been exploited by another threat actor, and was independently discovered by the Russian cybersecurity company BI.ZONE. Notably, this second threat actor began exploiting CVE‑2025‑8088 a few days after RomCom started doing so.”\n\nBi.ZONE also reports the the hacking group \"Paper Werewolf\" abused the flaw in phishing emails that pretended to come from a Russian research institute.",
  "medium": "Article",
  "links": [
    "https://www.pcmag.com/news/this-chatgpt-flaw-could-have-let-hackers-steal-your-google-drive-data",
    "https://www.win-rar.com/download.html?&L=0",
    "https://www.pcmag.com/how-to/how-to-figure-out-if-your-phone-has-malware",
    "https://www.pcmag.com/news/openai-faces-backlash-for-retiring-older-models-with-gpt-5-launch",
    "https://twitter.com/ESETresearch/status/1954831147067658671",
    "https://www.pcmag.com/news/patch-now-new-winrar-flaw-used-to-deliver-malware",
    "https://www.linkedin.com/in/michael-kan-29603514",
    "https://www.pcmag.com/news/people-who-develop-strong-bonds-with-chatgpt-make-openai-ceo-uneasy",
    "https://www.pcmag.com/privacy",
    "https://bi.zone/expertise/blog/paper-werewolf-atakuet-rossiyu-s-ispolzovaniem-uyazvimosti-nulevogo-dnya-v-winrar/",
    "https://www.pcmag.com/authors/michael-kan",
    "https://www.pcmag.com/cdn-cgi/l/email-protection#2b464248434a4e4774404a456b5b48464a4c05484446",
    "https://www.pcmag.com/news/starlink-nabs-federal-broadband-funds-but-fiber-is-still-the-big-winner",
    "https://www.pcmag.com/picks/the-best-malware-removal-and-protection-software",
    "https://www.pcmag.com/news/black-hat-2025-hackers-take-over-security-cameras-easier-than-you-think",
    "https://www.welivesecurity.com/en/eset-research/update-winrar-tools-now-romcom-and-others-exploiting-zero-day-vulnerability/",
    "https://www.pcmag.com/explainers/how-to-spot-and-avoid-phishing-scams-5-tips-from-our-security-expert",
    "https://www.pcmag.com/terms",
    "https://www.pcmag.com/news/ham-radio-users-explain-why-theyre-worried-about-ast-spacemobiles-satellite",
    "https://twitter.com/Michael_Kan"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "WinRAR Flaw",
      "weight": 0.10053348
    },
    {
      "name": "Russian hackers",
      "weight": 0.09055764
    },
    {
      "name": "Phishing Emails",
      "weight": 0.08567844
    },
    {
      "name": "phishing emails",
      "weight": 0.08567844
    },
    {
      "name": "ESET researchers",
      "weight": 0.08512633
    },
    {
      "name": "ESET telemetry",
      "weight": 0.0838392
    },
    {
      "name": "WinRAR",
      "weight": 0.083759926
    },
    {
      "name": "Antivirus provider ESET",
      "weight": 0.08237239
    },
    {
      "name": "ESET",
      "weight": 0.079987414
    },
    {
      "name": "Russian",
      "weight": 0.07044345
    }
  ],
  "topics": [
    {
      "name": "Russia-Ukraine War"
    },
    {
      "name": "Cyber Crime"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Technology News",
      "score": 0.89208984375
    },
    {
      "name": "/Computers & Electronics/Computer Security/Network Security",
      "score": 0.88134765625
    },
    {
      "name": "/Computers & Electronics/Computer Security/Hacking & Cracking",
      "score": 0.673828125
    },
    {
      "name": "/Computers & Electronics/Computer Security/Other",
      "score": 0.423583984375
    }
  ],
  "sentiment": {
    "positive": 0.0604848,
    "negative": 0.62414116,
    "neutral": 0.31537405
  },
  "summary": "Russian hackers are exploiting a new flaw in WinRAR to spread malware to companies in Europe and Canada, according to security researchers. The flaw, named CVE-2025-8088, can be used to attack Windows PCs by creating a malicious archive and extracting hidden malicious files from the Windows startup directory, causing a PC to immediately run them. The Russian hackers exploited this through phishing emails pretending to be from interested job applicants and containing an attached resume inside the malicious RAR archive. The vulnerability also affects 7.12 and earlier versions of the software. However, users will need to manually update the new version to protect themselves.",
  "shortSummary": "Russian hackers, known as RomCom, exploited a WinRAR vulnerability to steal data from European and Canadian companies via phishing emails, despite being patched.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "c63aa38506da402c93e52bdc8e4efa4b",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.welivesecurity.com/en/eset-research/update-winrar-tools-now-romcom-and-others-exploiting-zero-day-vulnerability/",
      "text": "ESET researchers have discovered a previously unknown vulnerability in WinRAR, being exploited in the wild by Russia-aligned group RomCom. This is at least the third time that RomCom has been caught exploiting a significant zero-day vulnerability in the wild. Previous examples include the abuse of CVE-2023-36884 via Microsoft Word in June 2023, and the combined vulnerabilities assigned CVE‑2024‑9680 chained with another previously unknown vulnerability in Windows, CVE‑2024‑49039, targeting vulnerable versions of Firefox, Thunderbird, and the Tor Browser, leading to arbitrary code execution in the context of the logged-in user in October 2024.\nKey points of this blogpost:\n- If you use WinRAR or other affected components such as the Windows versions of its command line utilities, UnRAR.dll, or the portable UnRAR source code, upgrade immediately to the latest version.\n- On July 18th, 2025, ESET researchers discovered a previously unknown zero-day vulnerability in WinRAR being exploited in the wild.\n- Analysis of the exploit led to the discovery of the vulnerability, now assigned CVE-2025-8088: a path traversal vulnerability, made possible with the use of alternate data streams. After immediate notification, WinRAR released a patched version on July 30th, 2025.\n- The vulnerability allows hiding malicious files in an archive, which are silently deployed when extracting.\n- Successful exploitation attempts delivered various backdoors used by the RomCom group, specifically a SnipBot variant, RustyClaw, and Mythic agent.\n- This campaign targeted financial, manufacturing, defense, and logistics companies in Europe and Canada.\nRomCom profile\nRomCom (also known as Storm-0978, Tropical Scorpius, or UNC2596) is a Russia-aligned group that conducts both opportunistic campaigns against selected business verticals and targeted espionage operations. The group’s focus has shifted to include espionage operations collecting intelligence, in parallel with its more conventional cybercrime operations. The backdoor commonly used by the group is capable of executing commands and downloading additional modules to the victim’s machine.\nThe discovery of CVE-2025-8088\nOn July 18th, 2025, we observed a malicious DLL named msedge.dll in a RAR archive containing unusual paths that caught our attention. Upon further analysis, we found that the attackers were exploiting a previously unknown vulnerability affecting WinRAR, including the then-current version, 7.12. On July 24th, 2025, we contacted the developer of WinRAR, and on the same day, the vulnerability was fixed and WinRAR 7.13 beta 1 published. WinRAR 7.13 was published on July 30th, 2025. Users of WinRAR are advised to install the latest version as soon as possible to mitigate the risk. Note that software solutions relying on publicly available Windows versions of UnRAR.dll or its corresponding source code are affected as well, especially those that have not updated their dependencies.\nThe vulnerability, tracked as CVE-2025-8088, uses alternate data streams (ADSes) for path traversal. Note that a similar path traversal vulnerability (CVE‑2025‑6218) affecting WinRAR was disclosed on June 19th, 2025, approximately a month earlier.\nThe attackers specially crafted the archive to apparently contain only one benign file (see Figure 1), while it contains many malicious ADSes (there’s no indication of them from the user’s point of view).\nOnce a victim opens this seemingly benign file, WinRAR unpacks it along with all its ADSes. For example, for Eli_Rosenfeld_CV2 - Copy (10).rar, a malicious DLL is deployed into %TEMP%. Likewise, a malicious LNK file is deployed into the Windows startup directory, thereby achieving persistence via execution on user login.\nTo ensure higher success, the attackers provided multiple ADSes with increasing depths of parent directory relative path elements (..\\\\). However, this introduces nonexistent paths that WinRAR visibly warns about. Interestingly, the attackers added ADSes that contain dummy data and are expected to have invalid paths. We suspect that the attackers introduced them so that the victim does not notice the suspicious DLL and LNK paths (see Figure 2). Only when scrolling down in the WinRAR user interface are the suspicious paths revealed, as seen in Figure 3.\nCompromise chain\nAccording to ESET telemetry, such archives were used in spearphishing campaigns from the 18th to 21st July, 2025, targeting financial, manufacturing, defense, and logistics companies in Europe and Canada. Table 1 contains the spearphishing emails – sender, subject, and filename of the attachment – used in the campaigns, and Figure 4 shows the message we observed in an email. In all cases, the attackers sent a CV hoping that a curious target would open it. According to ESET telemetry, none of the targets were compromised.\nTable 1. Spearphishing emails observed in ESET telemetry\n| Sender | Subject | Attachment |\n| Simona <2constheatcomshirl@seznam.cz> | Experienced Web3 Developer вЂ“ CV Attached for Consideration | Eli_Rosenfeld_CV2 - Copy (100) - Copy - Copy - Copy - Copy - Copy - Copy.rar |\n| Eli_Rosenfeld_CV2 - Copy (100) - Copy - Copy - Copy - Copy - Copy.rar | ||\n| Eli_Rosenfeld_CV2 - Copy (100) - Copy - Copy - Copy - Copy.rar | ||\n| Eli_Rosenfeld_CV2 - Copy (10).rar | ||\n| Marshall Rico <geoshilovyf@gmx.com> | Motivated Applicant - Resume Enclosed | cv_submission.rar |\n| Simona <93leocarperpiyd@seznam.cz> | ||\n| Simona <93geoprobmenfuuu@seznam.cz> | ||\n| Simona <2constheatcomshirl@seznam.cz> | ||\n| Simona <3tiafratferpate@seznam.cz> | ||\n| Russell Martin <sampnestpihydbi@gmx.com> | Job Application | Datos adjuntos sin título 00170.dat |\n| Pepita Cordero <stefanmuribi@gmx.net> | Application for Job Openings - Pepita Cordero | JobDocs_July2025.rar |\n| Sacchetti Jami <patricklofiri@gmx.net> | Application for Job Openings - Sacchetti Jami | Recruitment_Dossier_July_2025.rar |\n| Jennifer Hunt <emponafinpu@gmx.com> | Applying for the Role | cv_submission.rar |\nThese RAR files always contain two malicious files: a LNK file, unpacked to the Windows startup directory, and a DLL or EXE, unpacked to either %TEMP% or %LOCALAPPDATA%. Some of the archives share the same malware. We have identified three execution chains.\nMythic agent execution chain\nIn the first execution chain, depicted in Figure 5, the malicious LNK file Updater.lnk adds the registry value HKCU\\SOFTWARE\\Classes\\CLSID\\{1299CF18-C4F5-4B6A-BB0F-2299F0398E27}\\InprocServer32 and sets it to %TEMP%\\msedge.dll. This is used to trigger execution of that DLL via COM hijacking. Specifically, the CLSID corresponds to the PSFactoryBuffer object present in npmproxy.dll. As a result, any executable trying to load it (e.g., Microsoft Edge) will trigger code execution of the malicious DLL. This DLL is responsible for decrypting embedded shellcode via AES and subsequently executing it. Interestingly, it retrieves the domain name for the current machine, which typically contains the company name, and compares it with a hardcoded value, exiting if the two values do not match. This means that the attackers had conducted reconnaissance beforehand, confirming that this email was highly targeted.\nThe loaded shellcode appears to be a dynamichttp C2 profile for the Mythic agent having the following C&C server: https://srlaptop[.]com/s/0.7.8/clarity.js.\nIt comes with a standard configuration for the dynamichttp C2 profile and a custom one, which is displayed in Figure 6. Just like in the previous stage, this configuration contains a hardcoded domain name of the target.\n{'disable_etw': '2', 'block_non_ms_dlls': '3', 'child_process': 'wmic.exe', 'use_winhttp': 1, 'inject_method': '1', 'dll_side': ['MsEdge', 'OneDrive'], 'domain': '[REDACTED]'}\nSnipBot variant execution chain\nIn the second execution chain, which is depicted in Figure 7, the malicious LNK file Display Settings.lnk runs %LOCALAPPDATA%\\ApbxHelper.exe. It is a modified version of PuTTY CAC, which is a fork of PuTTY, and is signed with an invalid code-signing certificate. The extra code uses the filename as a key for decrypting strings and the next stage, which is shellcode. The shellcode appears to be a variant of SnipBot, malware attributed to RomCom by UNIT 42. Execution of the shellcode only proceeds if a specific registry value (68 for this sample) is present in the HKCU\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Explorer\\RecentDocs\\ registry key (in other words, if at least 69 documents were recently opened); this is an anti-analysis technique to prevent execution in an empty virtual machine or sandbox. If at least 69 documents were recently opened, next-stage shellcode is decrypted using the registry key name (e.g., 68, but converted from string to integer), and executed, downloading yet another stage from https://campanole[.]com/TOfrPOseJKZ.\nWe also found an identical ApbxHelper.exe within Adverse_Effect_Medical_Records_2025.rar, uploaded to VirusTotal from Germany. This archive also exploits the CVE-2025-8088 vulnerability.\nMeltingClaw execution chain\nIn the third execution case, which is depicted in Figure 8, the malicious LNK file Settings.lnk runs %LOCALAPPDATA%\\Complaint.exe, which is RustyClaw – a downloader written in Rust previously analyzed by Talos. This sample is signed with an invalid code-signing certificate, which is different from the code-signing certificate used in the SnipBot variant. RustyClaw downloads and executes another payload, from https://melamorri[.]com/iEZGPctehTZ. This payload (SHA-1: 01D32FE88ECDEA2B934A00805E138034BF85BF83), with internal name install_module_x64.dll, partially matches the analysis of MeltingClaw by Proofpoint, a different downloader attributed to RomCom. The C&C server of the MeltingClaw sample that we observed is https://gohazeldale[.]com.\nAttribution\nWe attribute the observed activities to RomCom with high confidence based on the targeted region, TTPs, and malware used.\nThis is not the first time that RomCom has used exploits to compromise its victims. In June 2023, the group performed a spearphishing campaign targeting defense and governmental entities in Europe, with lures related to the Ukrainian World Congress. The Microsoft Word document attached to the email attempted to exploit the CVE‑2023‑36884 vulnerability, as documented by the BlackBerry Threat Research and Intelligence team.\nOn October 8th, 2024, the group exploited a then-unknown vulnerability in the Firefox browser. The exploit targeted a use-after-free vulnerability in Firefox Animation timelines, allowing an attacker to achieve code execution in a content process, with the objective of delivering the RomCom backdoor. The vulnerability identifier CVE‑2024‑9680 was assigned, as documented in our WeLiveSecurity blogpost.\nOther activities\nWe are aware that this vulnerability has also been exploited by another threat actor, and was independently discovered by the Russian cybersecurity company BI.ZONE. Notably, this second threat actor began exploiting CVE‑2025‑8088 a few days after RomCom started doing so.\nConclusion\nBy exploiting a previously unknown zero-day vulnerability in WinRAR, the RomCom group has shown that it is willing to invest serious effort and resources into its cyberoperations. This is at least the third time RomCom has used a zero-day vulnerability in the wild, highlighting its ongoing focus on acquiring and using exploits for targeted attacks. The discovered campaign targeted sectors that align with the typical interests of Russian-aligned APT groups, suggesting a geopolitical motivation behind the operation.\nWe would like to thank the WinRAR team for its cooperation and quick response, and recognize its effort in releasing a patch within just one day.\nThanks to Peter Košinár for his assistance in the analysis.\nFor any inquiries about our research published on WeLiveSecurity, please contact us at threatintel@eset.com.ESET Research offers private APT intelligence reports and data feeds. For any inquiries about this service, visit the ESET Threat Intelligence page.\nIoCs\nA comprehensive list of indicators of compromise (IoCs) and samples can be found in our GitHub repository.\nFiles\n| SHA-1 | Filename | Detection | Description |\n| 371A5B8BA86FBCAB80D4 |\nAdverse_Effect_Medi |\nLNK/Agent.AJN\nWin64/Agent.GPM\n|\nArchive exploiting CVE‑2025‑8088; found on VirusTotal. |\n| D43F49E6A586658B5422 |\ncv_submission.rar |\nLNK/Agent.AJN July\nWin64/Agent.GPM\n|\nArchive exploiting CVE‑2025‑8088. |\n| F77DBA76010A9988C9CE |\nEli_Rosenfeld_CV2 - |\nWin64/Agent.GMQ | Archive exploiting CVE‑2025‑8088. |\n| 676086860055F6591FED |\nDatos adjuntos sin |\nLNK/Agent.AJN\nWin64/Agent.GPM\n|\nArchive exploiting CVE‑2025‑8088. |\n| 1F25E062E8E9A4F1792C |\nJobDocs_July2025.rar |\nLNK/Agent.AJN\nWin64/TrojanDownlo\n|\nArchive exploiting CVE‑2025‑8088. |\n| C340625C779911165E39 |\ncv_submission.rar |\nLNK/Agent.AJN\nWin64/Agent.GPM\n|\nArchive exploiting CVE‑2025‑8088. |\n| C94A6BD6EC88385E4E83 |\nRecruitment_Dossier |\nLNK/Agent.AJN\nWin64/TrojanDownlo\n|\nArchive exploiting CVE‑2025‑8088. |\n| 01D32FE88ECDEA2B934A |\ninstall_module_x64 |\nWin64/Agent.GNV | MeltingClaw |\n| AE687BEF963CB30A3788 |\nmsedge.dll | Win64/Agent.GMQ | Mythic agent used by RomCom |\n| AB79081D0E26EA278D3D |\nComplaint.exe | Win64/TrojanDownlo |\nRustyClaw |\n| 1AEA26A2E2A7711F89D0 |\nApbxHelper.exe | Win64/Agent.GPM | SnipBot variant |\nNetwork\n| IP | Domain | Hosting provider | First seen | Details |\n| 162.19.175[.]44 | gohazeldale |\nOVH SAS | 2025‑06‑05 | MeltingClaw C&C server. |\n| 194.36.209[.]127 | srlaptop[.]com | CGI GLOBAL LIMITED | 2025‑07‑09 | C&C server of the Mythic agent used by RomCom. |\n| 85.158.108[.]62 | melamorri[.]com | HZ‑HOSTING‑LTD | 2025‑07‑07 | RustyClaw C&C server. |\n| 185.173.235[.]134 | campanole[.]com | FiberXpress BV | 2025‑07‑18 | C&C server of the SnipBot variant. |\nMITRE ATT&CK techniques\nThis table was built using version 17 of the MITRE ATT&CK framework.\n| Tactic | ID | Name | Description |\n| Resource Development | T1583 | Acquire Infrastructure | RomCom sets up VPSes and buys domain names. |\n| T1587.001 | Develop Capabilities: Malware | RomCom develops malware in multiple programming languages. | |\n| T1587.004 | Develop Capabilities: Exploits | RomCom may develop exploits used for initial compromise. | |\n| T1588.005 | Obtain Capabilities: Exploits | RomCom may acquire exploits used for initial compromise. | |\n| T1588.006 | Obtain Capabilities: Vulnerabilities | RomCom may obtain information about vulnerabilities that it uses for targeting victims. | |\n| T1608 | Stage Capabilities | RomCom stages malware on multiple delivery servers. | |\n| Initial Access | T1566.001 | Phishing: Spearphishing Attachment | RomCom compromises victims with a malicious RAR attachment sent via spearphishing. |\n| Execution | T1204.002 | User Execution: Malicious File | RomCom lures victims into opening a weaponized RAR archive containing an exploit. |\n| Persistence | T1547.001 | Boot or Logon Autostart Execution: Registry Run Keys / Startup Folder | For persistence, RomCom stores a LNK file in the Startup folder. |\n| T1546.015 | Event Triggered Execution: Component Object Model Hijacking | RomCom hijacks CLSIDs for persistence. | |\n| Defense Evasion | T1497 | Virtualization/Sandbox Evasion | RomCom detects virtual environments by checking for enough RecentDocs. |\n| T1480 | Execution Guardrails | RomCom stops execution if running in a virtual environment. It also checks for a hardcoded domain name before executing. | |\n| T1036.001 | Masquerading: Invalid Code Signature | RomCom tries to appear more legitimate to users and security tools that improperly handle digital signatures. | |\n| T1027.007 | Obfuscated Files or Information: Dynamic API Resolution | RomCom decrypts and resolves API dynamically. | |\n| T1027.013 | Obfuscated Files or Information: Encrypted/Encoded File | RomCom decrypts shellcode based on filename and machine artifacts. | |\n| Credential Access | T1555.003 | Credentials from Password Stores: Credentials from Web Browsers | The RomCom backdoor collects passwords, cookies, and sessions using a browser stealer module. |\n| T1552.001 | Unsecured Credentials: Credentials In Files | The RomCom backdoor collects passwords using a file reconnaissance module. | |\n| Discovery | T1087 | Account Discovery | The RomCom backdoor collects username, computer, and domain data. |\n| T1518 | Software Discovery | The RomCom backdoor collects information about installed software and versions. | |\n| Lateral Movement | T1021 | Remote Services | The RomCom backdoor creates SSH tunnels to move laterally within compromised networks. |\n| Collection | T1560 | Archive Collected Data | The RomCom backdoor stores data in a ZIP archive for exfiltration. |\n| T1185 | Man in the Browser | The RomCom backdoor steals browser cookies, history, and saved passwords. | |\n| T1005 | Data from Local System | The RomCom backdoor collects specific file types based on file extensions. | |\n| T1114.001 | Email Collection: Local Email Collection | The RomCom backdoor collects files with .msg, .eml, and .email extensions. | |\n| T1113 | Screen Capture | The RomCom backdoor takes screenshots of the victim’s computer. | |\n| Command and Control | T1071.001 | Application Layer Protocol: Web Protocols | The RomCom backdoor uses HTTP or HTTPS as a C&C protocol. |\n| T1573.002 | Encrypted Channel: Asymmetric Cryptography | The RomCom backdoor encrypts communication using SSL certificates. | |\n| Exfiltration | T1041 | Exfiltration Over C2 Channel | The RomCom backdoor exfiltrates data using the HTTPS C&C channel. |\n| Impact | T1657 | Financial Theft | RomCom compromises companies for financial interest. |"
    },
    {
      "url": "https://www.linkedin.com/in/michael-kan-29603514",
      "text": "“Michael was a tremendous asset to IDG News Service in his time covering China's technology industry for us. He developed good sources and did plenty of in-person \"shoe leather\" reporting to keep ahead of developments with major players such as Alibaba, and Xiaomi when it first started to break out. He travelled to manufacturing centers to do first-hand reporting on labor issues in the electronics supply chain, and proved to have a talent for both photography and video. Michael is also an unfailingly nice guy to work with, responsive to suggestions and feedback, and helpful to his colleagues as a collaborator. He offers any news organization seeking excellent coverage from China the triple qualifications of being a native English writer with excellent Mandarin skills and a good understanding of key technology topics.”\nAbout\nActivity\n-\n🎉 Today I’m not only celebrating my 1-𝐲𝐞𝐚𝐫 𝐎𝐝𝐨𝐨𝐯𝐞𝐫𝐬𝐚𝐫𝐲 — I’m also thrilled to announce that I’ve been 𝐩𝐫𝐨𝐦𝐨𝐭𝐞𝐝 𝐭𝐨…\n🎉 Today I’m not only celebrating my 1-𝐲𝐞𝐚𝐫 𝐎𝐝𝐨𝐨𝐯𝐞𝐫𝐬𝐚𝐫𝐲 — I’m also thrilled to announce that I’ve been 𝐩𝐫𝐨𝐦𝐨𝐭𝐞𝐝 𝐭𝐨…\nLiked by Michael Kan\n-\nThis week I reached my 10-year anniversary with ICR and to mark the occasion, I've updated my professional headshots for my work-related social media…\nThis week I reached my 10-year anniversary with ICR and to mark the occasion, I've updated my professional headshots for my work-related social media…\nLiked by Michael Kan\n-\nI can't believe VIDEO GAME OF THE YEAR has been out for two whole years. Writing this book and seeing the reception to it changed my life. It let me…\nI can't believe VIDEO GAME OF THE YEAR has been out for two whole years. Writing this book and seeing the reception to it changed my life. It let me…\nLiked by Michael Kan\nExperience & Education\nRecommendations received\n1 person has recommended Michael\nJoin now to viewMore activity by Michael\n-\nPersonal news! I’m happy to announce that I’m starting a new job as Lead Industry Analyst at Ookla. I’ll be working with smart people like Kerry…\nPersonal news! I’m happy to announce that I’m starting a new job as Lead Industry Analyst at Ookla. I’ll be working with smart people like Kerry…\nLiked by Michael Kan\n-\n💥 𝗛𝗮𝗿𝗱 𝘄𝗼𝗿𝗸 𝗽𝗮𝘆𝘀 𝗼𝗳𝗳 𝘄𝗵𝗲𝗻 𝘆𝗼𝘂 𝗴𝗶𝘃𝗲 𝗶𝘁 𝘆𝗼𝘂𝗿 𝗮𝗹𝗹. I’m incredibly proud to share that I’ve been recognized with the…\n💥 𝗛𝗮𝗿𝗱 𝘄𝗼𝗿𝗸 𝗽𝗮𝘆𝘀 𝗼𝗳𝗳 𝘄𝗵𝗲𝗻 𝘆𝗼𝘂 𝗴𝗶𝘃𝗲 𝗶𝘁 𝘆𝗼𝘂𝗿 𝗮𝗹𝗹. I’m incredibly proud to share that I’ve been recognized with the…\nLiked by Michael Kan\n-\nI was honored to receive the Media Excellence prize at the Black in Gaming Awards earlier this year, and the trophy just arrived. Loving this tribute…\nI was honored to receive the Media Excellence prize at the Black in Gaming Awards earlier this year, and the trophy just arrived. Loving this tribute…\nLiked by Michael Kan\n-\nI get to work with some of the best f💣ing people. Three months ago I took what felt like one of the wildest phone calls. Would the City of Belton…\nI get to work with some of the best f💣ing people. Three months ago I took what felt like one of the wildest phone calls. Would the City of Belton…\nLiked by Michael Kan\n-\nJust back from the Micro Center grand opening in Santa Clara, and sharing some of the media coverage from last week, like this great article from…\nJust back from the Micro Center grand opening in Santa Clara, and sharing some of the media coverage from last week, like this great article from…\nLiked by Michael Kan\n-\n🧑💼: “The Chair recognizes the orange cat from the Belton Educational Foundation.” 😺: “Meow.” Me: “I second” 🧑💼: “It has been moved and…\n🧑💼: “The Chair recognizes the orange cat from the Belton Educational Foundation.” 😺: “Meow.” Me: “I second” 🧑💼: “It has been moved and…\nLiked by Michael Kan\n-\n✨ Feeling grateful and proud to be part of Odoo! This month, I received the April Acknowledgment for my work on forecast planning, partner…\n✨ Feeling grateful and proud to be part of Odoo! This month, I received the April Acknowledgment for my work on forecast planning, partner…\nLiked by Michael Kan\n-\n#LocalGov Action Figures are cool and all, but do you have your own GovLife LEGO set? #ChatGPT\n#LocalGov Action Figures are cool and all, but do you have your own GovLife LEGO set? #ChatGPT\nLiked by Michael Kan\n-\nHi, all. I am looking for a full-time, preferably remote writing or editing position. For the past 14 years, I was Senior Features Writer at PCMag…\nHi, all. I am looking for a full-time, preferably remote writing or editing position. For the past 14 years, I was Senior Features Writer at PCMag…\nLiked by Michael Kan\nOther similar profiles\n-\nDave Eisenstadter\nState Editor at Masslive.com\nConnect -\nColin A. Young\nDeputy Editor at State House News Service\nConnect -\nMaxine Bernstein\nReporter at The Oregonian\nConnect -\nTim Schooley\nConnect -\nDawn Lim\nReporter, Bloomberg\nConnect -\nMary Divine\nReporter at St. Paul Pioneer Press\nConnect -\nLaura Krantz McNeill\nNews product + audience strategy + cross-functional leadership\nConnect -\nNorman Miller\nreporter at Community Newspaper Company\nConnect -\nLesley Clark\nReporter at E&E News/Politico\nConnect -\nPamela Wood\nPolitics reporter at The Baltimore Banner\nConnect\nExplore top content on LinkedIn\nFind curated posts and insights for relevant topics all in one place.\nView top contentOthers named Michael Kan in United States\n-\nMichael Kan\nSenior Executive | Vice President of Global Sales and Marketing | Driving extraordinary business growth for Fortune 500s and privately held companies.\n-\nMichael Kan\nAI Systems & GPU Architecture Leader | From Embedded Graphics to Scalable Deep Learning\n-\nMichael Kan\n-\nMichael Kan\nInspector | Compliance & Regulatory Affairs | Ops & Program Management | Continuous Improvement | Quality Management | Health Physicist | Chicago Booth MBA Candidate | Veteran\n-\nMichael Kan\nDesign Intern, Founder of Paper with Pen\n36 others named Michael Kan in United States are on LinkedIn\nSee others named Michael Kan"
    },
    {
      "url": "https://bi.zone/expertise/blog/paper-werewolf-atakuet-rossiyu-s-ispolzovaniem-uyazvimosti-nulevogo-dnya-v-winrar/",
      "text": "Paper Werewolf атакует Россию с использованием уязвимости нулевого дня в WinRAR\nВ июле специалисты BI.ZONE Threat Intelligence выявили серию атак группировки Paper Werewolf (GOFFEE), нацеленных на российские организации. Злоумышленники использовали directory traversal в архиваторе WinRAR: CVE-2025-6218 и аналогичную уязвимость нулевого дня, у которой на момент исследования отсутствовал идентификатор CVE.\n- Ориентированные на шпионаж злоумышленники продолжают демонстрировать высокий уровень подготовки, активно обновляя арсенал в том числе уязвимостями нулевого дня.\n- Использование архивов для доставки ВПО в целевые системы увеличивает вероятность преодоления фильтров электронной почты, поскольку подобные вложения часто встречаются в легитимной почтовой переписке.\n- Несмотря на высокий уровень подготовки, злоумышленники все еще используют большое количество легко обнаруживаемых тактик, техник и процедур, поэтому ключевым для организаций остается круглосуточный мониторинг событий кибербезопасности.\nСпециалисты BI.ZONE Threat Intelligence обнаружили в начале июля целевую фишинговую рассылку группировки Paper Werewolf. Злоумышленники представлялись сотрудником всероссийского научно-исследовательского института и прикрепляли письмо якобы от одного из министерств. Также стоит отметить, что атакующие использовали скомпрометированный почтовый адрес поставщика мебели.\nДля отслеживания факта открытия письма жертвой злоумышленники использовали в HTML‑коде фишингового письма ссылку на скрытую картинку размером 1×1 пиксель.\nВо вложении фишингового письма содержался RAR-архив minprom_04072025.rar\n, эксплуатирующий уязвимость CVE‑2025‑6218. Данная уязвимость в WinRAR позволяет вредоносному архиву при распаковке записывать файлы за пределами целевого каталога, включая автозагрузку, что может привести к выполнению кода при входе пользователя в систему.\nminprom_04072025.rar\nПосле распаковки пользователем RAR‑архива на компьютере жертвы создается вредоносный исполняемый файл в каталоге автозагрузки %APPDATA%\\Microsoft\\Windows\\Start Menu\\Programs\\Startup\\xpsrchvw74.exe\n. Также создается каталог %SYSTEMDRIVE%\\AppData\\Roaming\\Microsoft\\Windows\\Start Menu\\Programs\\Startup\n, содержащий идентичные исполняемые файлы: xpsrchvw71.exe\n, xpsrchvw72.exe\n, xpsrchvw73.exe\n.\nНиже представлено содержимое отвлекающих документов, находящихся в данном RAR‑архиве.\nписьмо на СМ_(файл отображения).pdf\nШаблон_запроса (7) (11).docx\nxpsrchvw74.exe\nИсполняемый файл xpsrchvw74.exe\nпредставляет собой измененное приложение XPS Viewer версии 6.1.7600.16385, предназначенное для просмотра XPS‑документов. Атакующие внедрили в исполняемый файл вредоносный шелл‑код, являющийся reverse shell, который соединяется с управляющим сервером 89.110.88[.]155:8090\nи предоставляет удаленный доступ к оболочке командной строки cmd.exe\nна компьютере жертвы. Также стоит отметить, что названия WinAPI-функций захешированы с помощью ROR 0×13.\nАтака от 22.07.2025\nВ другой атаке Paper Werewolf специалисты BI.ZONE Threat Intelligence обнаружили вредоносный RAR‑архив Запрос_Минпромторг_22.07.rar\n, эксплуатирующий уязвимость нулевого дня в WinRAR по типу directory traversal.\nУязвимость связана с тем, что при создании RAR‑архива можно включить в него файл с альтернативными потоками данных, имена которых содержат относительные пути. Эти потоки могут содержать произвольную нагрузку. При распаковке такого архива либо при открытии вложенного файла прямо из архива происходит запись данных из альтернативных потоков в произвольные каталоги на диске, что представляет собой атаку типа directory traversal. Уязвимость затрагивает версии WinRAR вплоть до 7.12 включительно. Начиная с версии 7.13, данная уязвимость больше не воспроизводится.\nЗапрос_Минпромторг_22.07.rar\nВ результате открытия отвлекающего документа запрос Минпромторга РФ.pdf\nлибо разархивирования содержимого RAR‑архива пользователем на компьютере жертвы создаются следующие файлы:\n%LOCALAPPDATA%\\WinRunApp.exe\n%APPDATA%\\Microsoft\\Windows\\Start Menu\\Programs\\Startup\\WinRunApp.lnk\nНиже представлено содержимое отвлекающего документа, хранящегося в архиве Запрос_Минпромторг_22.07.rar\n.\nзапрос Минпромторга РФ.pdf\nТакже отметим, что на одном из хакерских форумов ранее появилось объявление о продаже якобы рабочего эксплоита для уязвимости нулевого дня в WinRAR по цене 80 тысяч долларов. При этом речь шла не о CVE‑2025‑6218. Это позволяет предположить, что обнаруженная нами уязвимость может быть связана с этим эксплоитом. Возможно, группировка Paper Werewolf приобрела его и доработала для проведения своих атак.\nWinRunApp.exe\nИсполняемый файл WinRunApp.exe\nявляется вредоносным .NET‑приложением, написанным на C# и представляющим собой загрузчик, скачивающий с сервера по ссылке полезную нагрузку в виде .NET‑сборки и запускающий ее в памяти. На момент исследования полезная нагрузка была недоступна.\nПосле запуска загрузчик осуществляет попытку создания мьютекса. Если попытка не удалась, то загрузчик завершает свою работу. В данном случае мьютекс: Sfgjh824nf6sdfgsfwe6467jkgg3vvvv3q7657fj436jh54HGFa56\n.\nЗатем загрузчик пытается скачать полезную нагрузку по ссылке с сервера атакующих в бесконечном цикле. Если ответ сервера имеет не нулевую длину, то цикл завершается, иначе загрузчик спит определенное количество секунд, в данном случае 331, и повторяет попытку.\nЗагрузчик получает название компьютера и имя пользователя и отправляет их в сформированной ссылке на сервер для получения полезной нагрузки. Ссылка имеет вид:\nhxxps://IndoorVisions[.]org/patriarchal/furthering/creating/flared/censured?hostname=[название_компьютера]&username=[имя_пользователя]\nДля соединения с сервером загрузчик использует строку заголовка User‑Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/91.0.4472.124 Safari/537.36 Edg/91.0.864.59\n.\nПолезная нагрузка является .NET‑сборкой, которая загружается в память процесса с помощью метода Assembly.Load, а затем запускается с помощью метода Invoke. Для запуска загруженной нагрузки используются определенный класс и метод, которые заданы в конфигурационных данных загрузчика. В данном случае класс EatLanguageSubject.AnswerEndSight\n, метод PainGroupStep\n.\nАтаки от 31.07.2025 и 01.08.2025\nВ атаках от 31.07.2025 и 01.08.2025 злоумышленники также использовали вредоносные RAR-архивы с уязвимостью нулевого дня, которая была описана ранее. В этот раз были обнаружены архивы с названиями DON_AVIA_TRANS_RU.rar\nи DON_AVIA_TRANS_UZ.rar\n, содержащие следующие файлы: три PDF‑документа, один текстовый файл, замаскированный под PDF‑документ, а в альтернативных потоках данных — LNK‑файл и исполняемый файл C#‑загрузчика.\nDON_AVIA_TRANS_RU.rar\nDON_AVIA_TRANS_UZ.rar\nВ данном случае атакующие добавили альтернативные потоки данных к каждому файлу в архиве. Таким образом, если пользователь откроет любой из отвлекающих документов либо разархивирует содержимое архива, на компьютере жертвы создадутся аналогичные файлы, рассмотренные ранее в предыдущей атаке.\nПримеры содержимого отвлекающих документов Бриф компании.pdf\nи Hamkorlik bo‘yicha aniqlashtiruvchisavollarga javoblar.pdf\nпредставлены ниже.\nБриф компании.pdf\nHamkorlik bo‘yicha aniqlashtiruvchi savollarga javoblar.pdf\nТакже стоит отметить, что файлы Презентация.pdf\nи Presentation.pdf\nидентичны (совпали по хеш‑сумме) и содержат текстовые данные следующего вида.\nПрезентация.pdf\n(Presentation.pdf\n)\nWinRunApp.exe\nWinRunApp.exe\nпо функциональным возможностям практически идентичен предыдущей версии C#‑загрузчика, рассмотренного в атаке от 22.07.2025, за исключением добавленного кода, отвечающего за запуск файла, если он существует в системе. В конфигурационных данных анализируемого образца название такого файла отсутствует.\nКонфигурационные данные загрузчика:\n| Мьютекс |\nGlobal_22576733 |\n| Полезная нагрузка (класс) |\nHomeFunctionMarket.MomentSingKnow |\n| Полезная нагрузка (метод класса) |\nEffectTeacherLeave |\n| URL |\n|\n| User-Agent |\n|\n| Название файла в системе |\n\"\" |\n| Интервал сна, секунд |\n330 |\nminprom_04072025.rar\nMD5: 9a69b948e261363463da38bdbf828b14\nSHA1: 40e647d61a00fd7240e54dba45ce95c5d33cae43\nSHA256: fe2587dd8d9755b7b3a106b6e46519a1ce0a8191eb20821d2f957326dbf912e9\nxpsrchvw.exe\nMD5: 942220fc9382f44ae82061d1fc63f41e\nSHA1: 7ff3d32e78c5626135a73bba4a011058f714ae86\nSHA256: bf74820d40d281c28d5928b01e5b68d6caf85b5b9188bf4efb627765d708bcff\nhxxps://eliteheirs[.]org/checks/brandished/dyestuffs/abbess/interrelation?4eab27f5266393a1150e7d6453c1920db480c2f88ce96708cff593e38ae8ac30\nhxxps://eliteheirs[.]org/checks/brandished/dyestuffs/abbess/interrelation\nhxxps://eliteheirs[.]org/crossness/outpost/autocracies/decapitations/jetsetting?b115ef3ad9cb948213f7efc4876cf67747eac173b613b425abd05dba0e306ebd\nhxxps://eliteheirs[.]org/crossness/outpost/autocracies/decapitations/jetsetting\neliteheirs[.]org\n89.110.88[.]155:8090\n81.30.105[.]148\n213.171.4[.]200\nЗапрос_Минпромторг_22.07.rar\nMD5: 6b4d7a63aa2a8b2a5a3fbad6c8e6533e\nSHA1: d3820a1248bf54ce8a3d05bf688bcd97e1c41d8e\nSHA256: 28a2b98ae214376ccd549a8b0dccafad31c8b234d0b81a0e8817579566615567\nDON_AVIA_TRANS_UZ.rar\nMD5: eaba94b5237d2625fa38bc924e5347c4\nSHA1: 6c0e52b8ed746b5b8ebef1ef2226093260659ae8\nSHA256: d2c3fe8b9a4e0e5b7bcc087d52295ab30dc25b1410f50de35470383528c9d844\nDON_AVIA_TRANS_RU.rar\nMD5: d176b7b5040d7bb32bae4d5c3c3b6aaf\nSHA1: b610ff2ad9791d17203609d747c5dfe947304591\nSHA256: dfab2f25c9d870f30bbc4abb873d155cf4904ece536714fb9cd32b2e0126dfab\nWinRunApp.exe\nMD5: 1670035385c9031f79566c6f73fb9743\nSHA1: b7bba4a216f4910f5072019bb4a2022ccf098c75\nSHA256: 2446f97c1884f70f97d68c2f22e8fc1b9b00e1559cd3ca540e8254749a693106\nWinRunApp.exe\nMD5: 67daddd8fd8a59c8b3d40ea433efd6ff\nSHA1: 23708d1fdcd7ba65c2b2fc676cee707e746a2dd9\nSHA256: 236aba76d427111e8c140604ead9c4ab86264b1ae197fc26fadb33c46be94289\nhxxps://indoorvisions[.]org/patriarchal/furthering/creating/flared/censured?hostname=[hostname]&username=[username]\nhxxps://indoorvisions[.]org/patriarchal/furthering/creating/flared/censured\nhxxps://trailtastic[.]org/glowworms/diverted/calorie/britons/parabolas?hostname=[hostname]&username=[username]\nhxxps://trailtastic[.]org/glowworms/diverted/calorie/britons/parabolas\nindoorvisions[.]org\ntrailtastic[.]org\n89.110.98[.]26\n94.242.51[.]73\nМьютексы:\nSfgjh824nf6sdfgsfwe6467jkgg3vvvv3q7657fj436jh54HGFa56\nGlobal_22576733\n| Тактика | Техника | Процедура |\n|---|---|---|\n| Initial Access |\nPhishing: Spearphishing Attachment |\nPaper Werewolf использует вложения в фишинговые электронные письма для распространения ВПО |\n|\nPhishing for Information: Spearphishing Link |\nPaper Werewolf использует фишинговые электронные письма, содержащие такие элементы, как пиксели отслеживания, чтобы определить, взаимодействовали ли получатели с письмом |\n|\n| Execution |\nCommand and Scripting Interpreter: Windows Command Shell |\nPaper Werewolf использует reverse shell для удаленного выполнения команд в интерпретаторе |\n|\nExploitation for Client Execution |\nPaper Werewolf использует уязвимости в WinRAR (CVE-2025-6218 и незадокументированная уязвимость нулевого дня) для создания на компьютере жертвы вредоносных файлов и добавления их в каталог автозагрузки системы |\n|\n|\nUser Execution: Malicious File |\nЖертва должна распаковать вредоносный RAR-архив или запустить содержащийся в нем PDF-файл, чтобы инициировать процесс компрометации системы |\n|\n| Persistence |\nBoot or Logon Autostart Execution: Registry Run Keys / Startup Folder |\nPaper Werewolf использует уязвимости в WinRAR для создания в каталоге автозагрузки файлов |\n| Defense Evasion |\nHide Artifacts: Hidden Window |\nPaper Werewolf использует в C#‑загрузчике невидимое окно, чтобы скрыть активность, выполняемую в пользовательском интерфейсе |\n|\nObfuscated Files or Information: Dynamic API Resolution |\nPaper Werewolf использует ROR 13 для хеширования названий WinAPI-функций в reverse shell |\n|\n|\nObfuscated Files or Information: Embedded Payloads |\nPaper Werewolf использует измененное приложение XPS Viewer с внедренной нагрузкой — reverse shell |\n|\n| Discovery |\nSystem Information Discovery |\nPaper Werewolf использует C#‑загрузчик для получения имени компьютера жертвы и его отправки в сформированной ссылке на сервер для получения полезной нагрузки |\n|\nSystem Owner/User Discovery |\nPaper Werewolf использует C#‑загрузчик для получения имени пользователя и его отправки в сформированной ссылке на сервер для получения полезной нагрузки |\n|\n| Command and Control |\nApplication Layer Protocol: Web Protocols |\nPaper Werewolf использует в C#‑загрузчике протокол HTTPS для загрузки зашифрованного файла полезной нагрузки с сервера |\n|\nIngress Tool Transfer |\nPaper Werewolf использует C#‑загрузчик собственной разработки для скачивания вредоносной полезной нагрузки с сервера |\n|\n|\nNon-Application Layer Protocol |\nPaper Werewolf использует сокеты в reverse shell для коммуникации с управляющим сервером |\nЧтобы построить эффективную киберзащиту организации, важно знать, какие уязвимости эксплуатируют кластер Paper Werewolf и другие злоумышленники в реальных атаках. Поэтому мы рекомендуем использовать данные портала BI.ZONE Threat Intelligence. Он предоставляет подробную информацию об актуальных кибератаках, злоумышленниках, их тактиках, техниках, используемых инструментах и эксплуатируемых уязвимостях. Эти данные помогут проактивно защититься и быстро реагировать на возникающие инциденты кибербезопасности."
    }
  ],
  "argos_summary": "Russian hackers, specifically the group RomCom, are exploiting a newly discovered vulnerability in WinRAR, identified as CVE-2025-8088, to distribute malware through phishing emails targeting companies in Europe and Canada. The vulnerability allows attackers to create malicious archives that can extract files to a hacker-selected destination on a victim's PC, enabling the installation of backdoors for data theft. Although a patch was released for the vulnerability, users must manually update their WinRAR software to mitigate the risk, as the software lacks an auto-update feature.",
  "argos_id": "73V4CI449"
}