{
  "url": "https://www.macrumors.com/2025/08/11/live-translation-coming-to-airpods/",
  "authorsByline": "Juli Clover",
  "articleId": "4c80289c969e42c1bfe1e48e0c749fad",
  "source": {
    "domain": "macrumors.com",
    "paywall": false,
    "location": null
  },
  "imageUrl": "https://images.macrumors.com/t/GGlOsjnj_5hoETcp3-S0cMH9rhw=/1600x/article-new/2025/08/airpods-translate.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T15:04:34-07:00",
  "addDate": "2025-08-11T22:39:42.912632+00:00",
  "refreshDate": "2025-08-11T22:39:42.912635+00:00",
  "score": 1.0,
  "title": "Live Translation Coming to AirPods",
  "description": "An in-person Live Translation feature could soon be available on the AirPods, according to imagery found in iOS 26 beta 6.   There's a picture of...",
  "content": "An in-person Live Translation feature could soon be available on the AirPods, according to imagery found in iOS 26 beta 6.\n\n\n\nThere's a picture of the AirPods with Hello in several different languages, along with a suggestion that the feature will be activated with a double press. The file itself is named \"Translate,\" which certainly seems to imply that there will be a gesture to activate a Live Translation option.\n\n9to5Mac reported on the image first, but we can confirm that it is tucked away in the files for the Translate app in the latest beta.\n\nPrior to the launch of ‌iOS 26‌, Bloomberg's Mark Gurman said that the AirPods would get a translate feature for translating in-person conversations, and it looks like Apple is working on introducing it soon. Live Translation for AirPods could come either in the launch version of ‌iOS 26‌, or in an update to ‌iOS 26‌.\n\n‌iOS 26‌ already offers Live Translation for the Phone app, Messages app, and FaceTime, so an in-person option through the AirPods makes sense.\n\nBased on the images, the feature will work on the AirPods Pro 2 and the AirPods 4. Existing Live Translation features are linked to Apple Intelligence, which means the AirPods feature could also require an iPhone that supports ‌Apple Intelligence‌.",
  "medium": "Article",
  "links": [
    "https://www.macrumors.com/guide/mark-gurman/",
    "https://9to5mac.com/2025/08/11/ios-26-beta-hints-at-upcoming-airpods-live-translation-gesture/",
    "https://www.macrumors.com/roundup/airpods-pro/",
    "https://www.macrumors.com/guide/iphone/",
    "https://www.macrumors.com/guide/facetime/",
    "https://www.macrumors.com/roundup/airpods/",
    "https://buyersguide.macrumors.com/#AirPods-Pro",
    "https://www.macrumors.com/guide/apple-intelligence/",
    "https://buyersguide.macrumors.com/#AirPods",
    "https://www.macrumors.com/2025/03/13/airpods-live-translation-ios-19/",
    "https://www.macrumors.com/roundup/ios-26/",
    "https://forums.macrumors.com/forums/airpods.216"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Existing Live Translation features",
      "weight": 0.15405008
    },
    {
      "name": "Live Translation",
      "weight": 0.13795364
    },
    {
      "name": "AirPods",
      "weight": 0.13191068
    },
    {
      "name": "Messages app",
      "weight": 0.090691626
    },
    {
      "name": "the AirPods feature",
      "weight": 0.08863748
    },
    {
      "name": "several different languages",
      "weight": 0.08519034
    },
    {
      "name": "Apple Intelligence",
      "weight": 0.08274545
    },
    {
      "name": "a Live Translation option",
      "weight": 0.081804976
    },
    {
      "name": "person",
      "weight": 0.07902525
    },
    {
      "name": "Translate",
      "weight": 0.074446626
    }
  ],
  "topics": [
    {
      "name": "AirPods"
    },
    {
      "name": "Electronics"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Computers & Electronics/Software/Operating Systems",
      "score": 0.90380859375
    },
    {
      "name": "/News/Technology News",
      "score": 0.8759765625
    },
    {
      "name": "/Internet & Telecom/Mobile & Wireless/Mobile Phones",
      "score": 0.7734375
    },
    {
      "name": "/Internet & Telecom/Mobile & Wireless/Mobile Apps & Add-Ons",
      "score": 0.427490234375
    },
    {
      "name": "/Shopping/Consumer Resources/Product Reviews & Price Comparisons",
      "score": 0.4189453125
    }
  ],
  "sentiment": {
    "positive": 0.2957754,
    "negative": 0.10688764,
    "neutral": 0.59733695
  },
  "summary": "Apple is reportedly working on an in-person Live Translation feature for the AirPods, which could be available in iOS 26 beta 6. The feature will be activated with a double press, suggesting a gesture. It could be introduced either in the launch version of the current version of iOS 26 or in an update to the existing version. The AirPod feature will work on the AirPod Pro 2 and the Airpod 4.",
  "shortSummary": "Apple is preparing to release an in-person Live Translation feature on AirPods, allowing them to communicate with people in various languages.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "4278aff1a8994301a17f19edb6888cf2",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://buyersguide.macrumors.com/#AirPods",
      "text": "MacRumors\nBuyer's Guide\nWant to compare and contrast features between two different products?\nTry our intelligent assistant which can answer those questions based on the MacRumors knowledge base.\nThis page provides a product summary for each Apple model. The intent is to provide our best recommendations regarding current product cycles, and to provide a summary of currently available rumors for each model. This page is based on rumors and speculation and we provide no guarantee to its accuracy.\nCheck out our product buying guides and latest deals in the lists below, and keep scrolling down the page for detailed information on all of Apple's major products.\n- 2025 iPhone Buyer's Guide\n- 2025 iPad Buyer's Guide\n- 2025 Apple Watch Buyer's Guide\n- Best AirPods Deals\n- Best HomePod Deals\n- Best Apple TV 4K Deals\n- Best MacBook Pro and MacBook Air Deals\n- Best iMac Deals\n- Best iPad Deals\n- Best iPhone Deals\niPad\nThe \"iPad\" is Apple's mainstream iPad, updated as an 11th-generation model in March 2025 with an A16 chip and starting at 128GB of storage, double the previous model. Prices start at $349.\niPad Roundup\nBest iPad Deals\nRelated Guides\nRecent Articles\niPad Air\nApple updated the iPad Air in March 2025 with the M3 chip, but no other improvements. Prices start at $599 for the 11-inch and $799 for the 13-inch.\niPad Air Roundup\nBest iPad Deals\nRelated Guides\nRecent Articles\niPhone 16e\n- The iPhone 16e is Apple's new entry-level $599 iPhone with A18 chip, Face ID, USB-C, single-lens rear camera, and more.\niPhone 16e Roundup\nRelated Guides\nRecent Articles\niPad Mini\n- Seventh-generation iPad mini debuted in October 2024 with A17 Pro chip for Apple Intelligence, Apple Pencil Pro support, faster Wi-Fi and USB, and more.\niPad Mini Roundup\nBest iPad Deals\nRelated Guides\nRecent Articles\niPhone 16\n- New Action and Camera Control buttons, A18 chip, camera improvements, longer battery life, and more. Available now.\niPhone 16 Roundup\nBest iPhone Deals\nRelated Guides\nRecent Articles\niPhone 16 Pro\n- Larger displays, new Camera Control button, A18 Pro chip, longer battery life, and more. Available now!\niPhone 16 Pro Roundup\nBest iPhone Deals\nRelated Guides\nRecent Articles\niPad Pro\nThe iPad Pro was updated in May 2024 with an M4 chip, an Ultra Retina XDR tandem OLED display, and a redesign that makes it the thinnest Apple product ever. Prices start at $999 for the 11-inch model and $1,299 for the 13-inch model.\niPad Pro Roundup\nBest iPad Deals\nRelated Guides\nRecent Articles\n13\" MacBook Air\nNew M4 models with up to 18 hours of battery life, a 12MP Center Stage camera, and more available for pre-order now. Available in four colors including a new sky blue, and starts at a lower price of $999.\n13\" MacBook Air Roundup\nBest MacBook Pro and MacBook Air Deals\nRelated Guides\nRecent Articles\nMac Studio\nThe Mac Studio is a pro-oriented desktop Mac that's a hybrid between a Mac mini and a Mac Pro. M4 Max model starts at $1,999 and M3 Ultra model starts at $3,999.\nMac Studio Roundup\nRelated Guides\nRecent Articles\n15\" MacBook Air\nNew M4 models with up to 18 hours of battery life, a 12MP Center Stage camera, and more available for pre-order now. Available in four colors including a new sky blue, and starts at a lower price of $1,199.\n15\" MacBook Air Roundup\nBest MacBook Pro and MacBook Air Deals\nRelated Guides\nRecent Articles\nMacBook Pro\nNew 14\" and 16\" MacBook Pro models were introduced on October 30, 2024. The 14\" model is available with M4, M4 Pro, and M4 Max chip options starting at $1,599, while the 16\" model is available with M4 Pro and M4 Max options starting at $2,499.\nMacBook Pro Roundup\nRelated Guides\nRecent Articles\nMac Mini\nApple announced a redesigned Mac mini with M4 and M4 Pro chip options on October 29, 2024. The M4 model starts at $599, while the M4 Pro model starts at $1,399.\nMac Mini Roundup\nRelated Guides\nRecent Articles\niMac\nApple's 24-inch iMac with the M4 chip was announced on October 28, 2024. A model with an 8-core CPU and 8-core graphics starts at $1,299, with 10-core CPU and 10-core graphics available in higher-end models. Available in blue, purple, pink, orange, yellow, green, and silver.\niMac Roundup\nBest iMac Deals\nRelated Guides\nRecent Articles\nMac Pro\nThe Mac Pro is Apple highest-end Mac for professionals and in June 2023 it became the final Mac to transition from Intel processors to Apple silicon. It is based on a the M2 Ultra chip and starts at $6,999, so this machine is only for the most serious professional users.\nMac Pro Roundup\nRelated Guides\nRecent Articles\nAirPods\n- AirPods 4 are Apple's newest AirPods with improved sound and comfort. Two models available, including one with active noise cancellation and a wireless charging case.\nAirPods Roundup\nBest AirPods Deals\nRelated Guides\nRecent Articles\nAirPods Max\n- The AirPods Max are Apple-branded high-end over-ear headphones with active noise cancellation, spatial audio, and adaptive EQ, priced at $549. Updated in September 2024 with new colors and USB-C instead of Lightning, but no other changes.\nAirPods Max Roundup\nBest AirPods Deals\nRelated Guides\nRecent Articles\nAirPods Pro\nAt its September 2023 media event, Apple released second-generation AirPods Pro with a USB-C charging port on the case, replacing the previous Lightning port. While the new AirPods Pro are still referred to as second-generation, the earbuds themselves also seem to have some improvements including better dust resistance and exclusive support for Lossless Audio when paired with the upcoming Vision Pro headset.\nAirPods Pro Roundup\nBest AirPods Deals\nRelated Guides\nRecent Articles\nHomePod\nNearly two years after discontinuing the original HomePod, Apple in January 2023 introduced an updated model powered by an S7 chip and featuring a four-inch woofer, five tweeters, four microphones, a U1 chip for Ultra Wideband features like handing off music from an iPhone, and support for Spatial Audio with Dolby Atmos.\nHomePod Roundup\nBest HomePod Deals\nRelated Guides\nRecent Articles\nHomePod Mini\n- HomePod mini is a smaller, more affordable version of the original HomePod that has similar features but in a cheaper package. New blue, orange, and yellow color options were released in November 2021.\nHomePod Mini Roundup\nRelated Guides\nRecent Articles\nApple Watch\nThe Apple Watch Series 10 has received a design update with larger casings and displays but a thinner overall design, along with a new S10 chip, water temperature sensor, and more.\nApple Watch Roundup\nRecent Articles\nVision Pro\n- Apple Vision Pro is Apple's first wearable headset device, offering a mixed reality experience. Vision Pro is priced starting at $3,499, and it is available now.\nVision Pro Roundup\nRecent Articles\nApple Watch Ultra\nApple's most rugged Apple Watch with better GPS, a 49mm titanium casing, a more durable display, extra long battery life, a built-in Action button, and more. Now available in black in addition to the original natural color and with some new band options, but no internal upgrades since September 2023.\nApple Watch Ultra Roundup\nRelated Guides\nRecent Articles\nApple TV\nThe third-generation Apple TV 4K was introduced in October 2022 and is equipped with an A15 Bionic chip for improved performance and HDR10+ support for the best possible video quality, while the Siri Remote now charges via USB-C. A 64GB model is priced at $129, while a 128GB model at $149 adds Ethernet and Thread smart home networking.\nApple TV Roundup\nBest Apple TV 4K Deals\nRelated Guides\nRecent Articles\nApple Watch SE\nApple updated the Apple Watch SE in September 2022 with an S8 chip, a lighter, color-matched nylon composite material for the back, and new Crash Detection, international roaming, and Low Power Mode features. Pricing starts at $249 for GPS models and $299 for GPS+Cellular models. New bands and packaging launched in September 2023 as part of Apple's push toward carbon neutral products, but the watch hardware itself is unchanged.\nApple Watch SE Roundup"
    },
    {
      "url": "https://9to5mac.com/2025/08/11/ios-26-beta-hints-at-upcoming-airpods-live-translation-gesture/",
      "text": "When Apple announced Live Translation at WWDC25, it highlighted use cases like FaceTime, phone calls, and messages. But one major use case was missing: real-world conversations. As it turns out, that was in the works too.\nNew image hints at new AirPods gesture\nIn today’s iOS 26 developer beta 6, we spotted a new system asset that appears to depict a gesture triggered by pressing both AirPods stems at once.\nThe image displays text in English, Portuguese, French, and German, and it is associated with the Translate app. For now, we can confirm it’s associated specifically with the AirPods Pro (2nd generation) and AirPods (4th generation).\nReal-world live translation is right up the wearable wheelhouse\nWhile Apple didn’t mention real-world translation for AirPods during the WWDC25 keynote, Bloomberg had reported earlier in the year that this feature was in the works. This feels like a natural extension of the Live Translation features already announced for FaceTime, Messages, and Phone, and it is also a strong use case for wearables in general, something we’ve already seen with devices like the Meta Ray-Bans.\nAt this point, it’s unclear which iPhones will support the new gesture, as it is very unlikely that the feature will run entirely on the AirPods. But it’s reasonable to assume the cutoff will align with Apple’s official hardware requirements for other Live Translation features:\nLive Translation in Messages is available in Chinese (Simplified), English (UK, US), French (France), German, Italian, Japanese, Korean, Portuguese (Brazil) and Spanish (Spain) when Apple Intelligence is enabled on a compatible iPhone, iPad or Mac, as well as on Apple Watch Series 9 and later and Apple Watch Ultra 2 when paired with an Apple Intelligence–enabled iPhone.\nLive Translation in Phone and FaceTime is available for one-to-one calls in English (UK, US), French (France), German, Portuguese (Brazil) and Spanish (Spain) when Apple Intelligence is enabled on a compatible iPhone, iPad or Mac.\nBit of speculation\nGiven the need of an even lower latency for real-world interactons, it is possible that this feature may be exclusive to the iPhone 17 lineup, which could help explain why Apple has kept it under wraps until now.\nSpeculation aside, what we do know is that Apple appears to be prepping the release of a live translation feature associated with AirPods, and that’s exciting enough, especially for anyone living abroad or traveling somewhere the language is unfamiliar.\nCould you see yourself using AirPods for live translation? Let us know in the comments.\nAirPods deals on Amazon\n- AirPods Max, USB-C Charging: $479.99 ($549 off)\n- AirPods Pro 2, USB-C Charging: $169 ($80 off)\n- AirPods 4 USB-C Charging: $99 (was $129)\n- AirPods 4, USB-C and Wireless Charging: $148.99 (was $179)\nFTC: We use income earning auto affiliate links. More.\nComments"
    },
    {
      "url": "https://www.macrumors.com/roundup/ios-26/",
      "text": "iOS 26\nApple's next-generation operating system for the iPhone, coming in fall 2025.\niOS 26 - What's New\nContents\n- iOS 26 - What's New\n- iOS 18 to iOS 26\n- Design Changes\n- Home Screen and Lock Screen\n- Messages\n- Phone\n- Apple Music\n- Shortcuts\n- Other New App Features\n- CarPlay\n- Battery and Adaptive Power Mode\n- Apple Intelligence Updates\n- New AirPods Features\n- Smaller Changes\n- Accessibility\n- Compatibility\n- iOS 26 Launch Date\n- What's Next for iOS\n- iOS 26 Timeline\niOS 26 is the newest version of iOS, the operating system that runs on the iPhone, and it's coming this fall. If you were expecting iOS 19 after iOS 18, you might be a little surprised to see Apple jump to iOS 26, but the new number reflects the 2025-2026 release season for the software update. It also lets Apple use the same number across all of its updates, so there's no more confusion since you're no longer downloading iOS, macOS, visionOS, and watchOS all with different numbers.\niOS 26 brings the first new major design change that Apple has brought to iOS since iOS 7. Apple says that the new \"Liquid Glass\" look will be the basis of the next decade of iOS design. Liquid Glass reflects and refracts its surroundings, while putting more focus on content. Many interface elements are almost entirely translucent, and the design extends to controls, navigation, app icons, menus, buttons, and widgets.\nLiquid Glass is meant to transform depending on content or context, and it behaves like glass in the real world, so color is informed by its surroundings, and it is meant to adapt between light and dark elements. Liquid Glass uses real-time rendering and can dynamically react to movement to change the way that light reflects off of buttons, switches, sliders, side bars, tab bars, and more.\nYou'll see Liquid Glass throughout iOS 26, in all of Apple's apps, in notifications, on the Lock Screen, in Control Center, and on the Home Screen. Apple is also providing developers with tools to bring the new material to their own apps for a cohesive look. Liquid Glass also extends to iPadOS 26, macOS Tahoe, visionOS 26, tvOS 26, and watchOS 26.\nThe Liquid Glass design overhaul isn't just a glossy finish, it also brings updates to the design of controls, toolbars, and navigation throughout iOS 26. App windows, menu bars, and other interface elements have more rounded corners, and controls feature a distinct functional layer designed to sit above apps. These kinds of menus can dynamically morph to provide users with more options in an app.\nWhen scrolling, tab bars shrink down to bring attention to content, but scrolling up brings them right back for fluid navigation. When tab bars are active, they refract the content around them. There are major Liquid Glass design updates for Camera, Photos, Safari, FaceTime, Apple Music, and Apple Podcasts. On the Lock Screen, the Liquid Glass time expands and shrinks to fit behind the subject of a wallpaper, and on the Home Screen, app icons and widgets are made from multiple layers of Liquid Glass that gives the appearance of depth.\nThe Lock Screen features a spatial scene option for photo wallpapers, giving them a 3D look and a sense of movement. The Home Screen might look different with an option for translucent icons and widgets, but it is functionally the same.\nApple streamlined the Camera app layout with simpler navigation. It has Photo and Video toggles, with other options tucked away behind menus that expand out with a tap. You can swipe to get to more photo and video options. Apple also updated the Photos app to re-add separate tabs for the Library and Collections views. In Photos, you can also activate Spatial Scene for any image, getting a unique 3D view of the image.\nSafari has a whole new look, and Apple has updated navigation. By default, Safari adopts the more rounded Liquid Glass buttons and nixes the settings at the bottom of the app, but there's an option to bring them back with a floating tab bar if you prefer a more feature rich menu. Apple Music, News, and Podcasts all have a new tab bar that floats above the content in the app and dynamically shrinks when users are browsing, so the interface options take up less space on the display.\nAlong with a new design, Apple is expanding the Apple Intelligence features that are available on the iPhone. Messages, FaceTime, and Phone all support Live Translation for automatically translating conversations when you're conversing with someone who speaks another language.\nVisual Intelligence now understands what's on your screen, and can answer questions about what you're looking at using ChatGPT integration. The feature can help you find products, add events to your calendar, and more. Image Playground supports ChatGPT image generation so you can create images in more styles. Genmoji has a new feature for mixing multiple emoji characters to make a new one, and adding descriptions to create an all-new emoji character.\nIn the Wallet app, there's a new Apple Intelligence feature that can scan your emails to summarize order tracking details from merchants, even if you didn't make the purchase with Apple Pay. It lets you see all your purchases and their tracking info in one spot. Wallet also now supports paying with installments in stores and getting rewards on in-store purchases. Boarding passes in Wallet support Live Activities for real-time flight tracking, and include access to Maps and Find My.\nThe Shortcuts app supports intelligent actions that can summarize text, create images, or tap into Apple Intelligence models, making it easier than ever to create automations. Reminders is able to suggest tasks, grocery items and follow-ups based on emails, and it can automatically categorize related reminders into sections.\nFor developers, Apple is debuting a new Foundation Models framework that allows developers to tap into the AI model that's at the core of Apple Intelligence, so developers can add new AI features to their apps.\nThe Phone app has a whole slew of new features. There's a unified layout that combines Favorites, Recents, and Voicemails. A new Call Screening feature asks unknown callers for their name and reason for calling before sending the call to you, stopping unwanted calls. When you're stuck on hold, there's a Hold Assist option that stays on the line for you, so you don't have to listen to irritating hold music. It lets you know when a live agent is available.\nMessages can screen texts from unknown senders, sending them silently to a dedicated folder where users can ask for more information or delete them. Group texts now have typing indicators and support for sending and receiving Apple Cash, plus Messages adds customizable backgrounds for each conversation and polls.\nIn Apple Music, there's a Lyrics Translation feature that translates lyrics that aren't in your language, and Lyrics Pronunciation helps you pronounce those lyrics. A new AutoMix feature uses intelligence to transition from one song to another, using time stretching and beat matching for a seamless shift between songs.\nApple Maps supports Visited Places so you can remember where you've been, and on-device intelligence can understand your daily route, popping up your preferred routes and letting you know about potential delays and alternate route options.\nApple added a new Apple Games app that's an all-in-one destination for discovering and playing games. It supports recommendations, leaderboards, competitions with friends, and more.\nCarPlay is getting the same Liquid Glass design overhaul, along with widgets and Live Activities that sync from the iPhone. There are Tapback options, important conversations can be pinned, and Apple added a new compact view for incoming calls so directions aren't blocked.\nIn iOS 26, AirPods 4 and AirPods Pro 2 support studio-quality sound recording and improved sound for calls and videos. The AirPods can also be used to take a photo or record a video with a press on the stem. For battery management, there's a new Adaptive Power setting on the iPhone that intelligently determines when you're using more battery than normal and adjusts things like screen brightness to preserve battery life.\nNote: See an error in this roundup or want to offer feedback? Send us an email here.\niOS 18 to iOS 26\nIf you're wondering why Apple went from iOS 18 to iOS 26, it was to streamline operating system naming. Apple is numbering all of its operating systems with the year going forward, so the \"26\" in iOS 26 represents the release season between September 2025 and September 2026.\nEverything released this year uses the same number, so iPadOS 26, macOS 26, watchOS 26, and so on. It will help keep numbering more straightforward in the future, even if it seems strange to skip iOS 19 to iOS 26.\nDesign Changes\nThe biggest single change in iOS 26 is the design overhaul. Apple is using a new Liquid Glass material throughout the operating system, and it has transformed the look of the iPhone's software.\nLiquid Glass is translucent, and like real glass, it allows light and color to shine through to put the focus on the content that's on your iPhone's display. Apple designed Liquid Glass to behave like it does in the real world, so it can subtly reflect light when you move your iPhone. It uses real-time rendering to dynamically react to movement with reflective highlights.\nApp icons are meant to look like several layers of glass, which gives them a subtle depth. Liquid Glass works well for the standard color icons, but Apple also added a translucent app icon option that makes your iPhone look even more like a sheet of glass.\nThere are actually two main aspects to the iOS 26 redesign: the Liquid Glass look, and simplified navigation that highlights the Liquid Glass material. There are too many cosmetic changes in iOS 26 to go through each one, but there is an overarching design language that Apple adopted.\nIt is worth noting that while iOS 26 looks different, it still feels like prior versions of iOS. Apple wanted it to be familiar to iOS users despite the changes, so menus, bars, and buttons look different and do have some different functions, but they are functions that iPhone users are already familiar with.\nPop Out Menus\nIn several places, Apple streamlined navigation and moved extra settings into pop out menus. In the Camera app, for example, Apple shows just the two main modes: photo and video. But if you tap on one of the buttons, you'll see a pop out menu with a range of photo settings that you can activate.\nApple says it wanted controls, toolbars, and navigation to have a distinct functional layer that sits above apps, morphing and dynamically changing as users need more options.\nThis kind of menu is common in iOS 26, so if there's something that you can't find, tap on one of the small icons on the screen, because chances are the menu expands out with more options.\nDisappearing Navigation\nIn several places, navigation elements disappear when they're not needed, and appear when they are. An example of this is in Safari. When you scroll down, the tab bar will collapse down into a small bar that shows just the name of the website. Scrolling back up brings back the full Safari tab bar so you can use the interface buttons that you need.\nIn Photos and Apple Music, there's an expanding search bar. Tapping it unfurls into a full search menu and collapses the other navigation bar menu options. Tapping out of search and on one of the other icons collapses search again and the menu bar returns to how it was. This is similar to the pop out menus, with an emphasis on putting things you don't need out of sight until you want to use them.\nThere are other examples of this, too. In the Health app, you won't see Health categories anymore until you tap on the search icon. That swaps to the search and categories interface, and a swap back is done by tapping on the heart to get back to your pinned items.\nCorners and Spacing\nIn areas with a long list of options or categories, such as the Settings app, Apple has increased spacing and padding for a less cluttered look. You will need to scroll longer to get through settings now, but there's more space to tap and it can be more readable with the additional spacing.\nApple shrunk navigation bars at the bottom of apps, so they take up less display space. A good example of this is in the Photos app, where the editing options have been condensed down into a smaller bar.\nNavigation bars, side bars, card-style menus, notifications, buttons, toggles, search bars, and other interface elements have a more rounded look. Single buttons are entirely circular, such as those in Control Center, while navigation bars are pill-shaped with distinctly round corners. Toggles and notifications have an elongated pill-shape too, and cards are also more rounded in appearance at the corners. The keyboard has round edges at the top.\niOS 18 had more of a squircle (rounded square) shape for much of the interface, but almost everything in iOS 26 is round. An exception is app icons, which have not changed in shape.\nCross-Platform Cohesiveness\nLiquid Glass is not exclusive to iOS 26. The new design extends to all of Apple's operating systems, including iPadOS 26, macOS 26, tvOS 26, watchOS 26, and of course, visionOS 26, which is the OS that inspired the overhaul.\nWith the same design available across all of Apple's operating systems, everything feels more cohesive, which was one of Apple's main goals with Liquid Glass.\nDesign Summary\n- Everything looks different in iOS 26.\n- There's an emphasis on content, with Apple aiming to make everything else fade away.\n- Interface elements are made from Liquid Glass, which is translucent and designed to work like glass in the real world. Colors and content shine through, and everything has a more liquid feel.\n- Almost all interface elements are rounder.\n- Navigation elements and settings are meant to hide away when you don't need them. If you're missing a setting, it's likely you'll find it in a pop out menu when you tap on a single icon.\n- Liquid Glass is system wide. Apple's apps have been redesigned with it to varying degrees, and third-party apps will also adopt the design language.\nHome Screen and Lock Screen\nOn the Lock Screen, there are two key changes beyond design updates. The time can auto adjust to be larger when your wallpaper allows for more space, and there is an option to enable a 2D to 3D spatial photo effect that adds depth to your wallpaper images.\nThe size of the time adjusts automatically in some cases, but you can also drag the bar at the corner to resize it to make it bigger. Note that you need to use the first font in the font list, because it's the only one that can be resized.\nWhen choosing a photo for a wallpaper, there is an option to use a 2D image to generate a 3D \"Spatial Scene\" that uses depth information to separate the subject from the background. The Spatial Scene wallpaper will feature a little bit of motion when you move your iPhone, enhancing the 3D effect.\nMost of the Home Screen is the same, aside from the Liquid Glass design changes. You can tap into Edit > Customize to select a new \"Clear\" option that gives all of your app icons a translucent, Liquid Glass look.\nMessages\nThe Messages app features customized backgrounds, an option to create polls, and enhanced spam filtering and blocking features.\n- Customizable backgrounds - In an individual or group conversation, you can tap on the name at the top and then choose the \"Backgrounds\" option to set a custom background for each conversation. There are options like sky, water, and aurora, or you can choose a color. You can also select photos or generate a background with Image Playground. Backgrounds that you set are changed for every participant in the conversation, unless they toggle off the feature in Messages settings.\n- Polls - Tap on the \"+\" button to get to a new option to create a poll in any chat. You can add up to 12 different options, then send it to allow people to vote. Others can also add options to the list. On devices with Apple Intelligence, polls may come up as a suggestion.\n- Group chats - Group chats support typing indicators and sending and receiving Apple Cash. There's also an option to add someone in a group chat who isn't in your contacts to your Contacts app with a tap.\n- Natural language search - Messages supports natural language search.\n- Copy/paste - You can now select just part of a text message to copy. Long press and tap on the new \"Select\" option to do so.\n- Spam messages - Spam messages and Unknown Senders are two separate categories in iOS 26. There's a new Filter box at the top right of the Messages app, and Unknown Senders go in one category, while Spam goes in another. A badge lets you know if you have messages in these categories, but you won't get notifications for them.\n- Unknown Senders - Messages from Unknown Senders won't send notifications if the option to filter them is on, but you will get alerts if it is a time sensitive notification, such as a notification from a ride share app or a delivery person.\n- Live Translation - Messages that aren't in your language can be automatically translated as you receive them in iOS 26. Apple Intelligence is required for this feature.\nPhone\nThe Phone app includes multiple new features that are designed to cut down on unwanted calls and reduce the amount of time that you need to spend on the phone.\nCall Screening\nCall Screening is an extension of Live Voicemail. When you receive a call from an unknown number that is not in your list of contacts, your iPhone asks the caller for their name and reason for calling. The information is relayed to you so you can decide if you want to accept the call or ignore it.\nCall Screening can be enabled in the Phone section of the Settings app.\nHold Assist\nIf you make a phone call and you're stuck on hold waiting to speak to a person, you can activate Hold Assist. Your iPhone can wait for you while you do other things, and then let you know when a live agent is on the line. The agent is informed that you'll be on the call in just a moment.\nTo use Hold Assist, tap on the \"Hold\" button after placing a call.\nLive Translation\nWhen talking to someone that speaks another language, there is an option to turn on Live Translation to have the call automatically translated for each person on the line. Live Translation is an Apple Intelligence feature and requires an iPhone 15 Pro or later.\nOther Features\n- Unified Layout - The Phone app has an optional unified layout that combines Favorites, Recents, and Voicemails in one spot.\n- Spam calls - Calls identified as spam can be silenced and sent directly to voicemail.\n- Type to Siri - You can now use Type to Siri while on a phone call.\n- Call History - Tapping on the info button next to a call in the recents list or on a name or number in the unified view shows a call history that lists every time you've spoken with someone.\n- Flag spam voicemails - If you tap into a voicemail from a person not in your contact list, you'll see an option to report the voicemail as spam.\n- eSIM transfer - It's easier to transfer an eSIM to an Android device and vice versa with new integrated eSIM transfer capabilities.\n- Focus eSIM - There is a Focus mode for silencing a single eSIM, so you can disable a home number at work, or a work number at home.\n- Screen sharing - The Phone app supports screen sharing and SharePlay during phone calls.\nApple Music\nThere are several new Apple Music features, ranging from translation to new options for transitioning between songs.\nAutoMix\nApple Music includes AutoMix, a feature that transitions from one song to another as the song that's playing ends. It uses time stretching and beat mixing for a seamless shift, and Apple says that it's meant to work like a DJ.\nSongs transition at the \"perfect moment\" based on an analysis of the key and tempo of the music, with AutoMix serving as an alternative to Crossfade.\nOther New Features\n- Lyrics Translation - Songs that are in another language can be translated automatically with Lyrics Translation.\n- Lyrics Pronunciation - Lyrics Pronunciation helps you pronounce lyrics that are in another language.\n- Pinned playlists - Apple Music playlists can now be pinned to the top of the Music app, with pinned playlists available in a new Home Screen widget as well.\n- Playlist folders - Playlists can be organized into folders.\n- iPhone microphone - When using the Apple Music Sing karaoke feature on Apple TV, the iPhone can be used as a microphone.\n- Lock Screen - On the Lock Screen, the Now Playing widget now provides full screen album artwork. Album art animates based on what you're listening to.\nShortcuts\nThe Shortcuts app now features Apple Intelligence, and the option to use Apple's AI models when creating shortcuts. Apple Intelligence models can be used for summarizing PDFs, generating recipes, answering questions, and more. Writing Tools and Image Playground are available for spellchecking, image generation, rewriting, tone changes, and more.\nApple offers several pre-programmed Shortcuts in the Gallery that use Apple Intelligence, such as options for getting a morning summary of the coming day, generating a haiku, or summarizing a PDF.\nWhen creating a shortcut, there is an Apple Intelligence section that includes options for an on-device model, a cloud model that uses Private Cloud Compute, or ChatGPT. Some pre-set options are available, such as opening Visual Intelligence, generating an image with Image Playground, or using Writing Tools, along with the option to use a model.\nSelecting one of the AI models provides an open-ended prompt where you can write in what you want it to do. You need to work in the confines of the model that Apple provides, pairing it with other functionality in Shortcuts.\nOther New App Features\nSafari\n- Tab View - Safari has a new \"Compact\" view for the Tab bar that puts several settings out of sight. You can change back to the standard bottom bar or top bar in the Safari section of the Settings app.\n- Liquid Glass - When scrolling, the Tab bar collapses down. Scroll up to bring it back.\n- Tracking Prevention - Advanced fingerprinting protection extends to all browsing by default. Advanced fingerprinting protection prevents websites from tracking your device usage across websites. Previously, this was limited to private browsing unless explicitly enabled.\n- Web apps - Every website added to the Home Screen through Safari opens a web app, even if it is not configured that way. In earlier versions of iOS, websites added to the Home Screen that were not properly configured would open in Safari.\n- HDR images - Safari supports HDR images in iOS 26.\n- SVG icons - Safari supports the SVG file format for icons in the bookmark bar and start page.\nCamera\n- Design - The Camera app has a simplified design with just Photo and Video tabs. Swiping swaps to other photo modes, and tapping on one of the buttons expands the available settings.\n- Lens - If the Camera lens is dirty, your iPhone lets you know that it needs to be cleaned.\n- AirPods - The AirPods 4 or AirPods Pro 2 can be used to take a photo or start a video recording by pressing and holding on the stem.\nPhotos\n- Design - Apple reverted to a more pre-iOS 18 design for Photos, separating the Library and Collections into different tabs.\n- Search - Video thumbnails show up in search results.\n- Spatial Scenes - You can use a new 3D feature to turn 2D photos into 3D images, adding subtle depth and motion that separates the subject from the background.\nNotes\n- Markdown - The Notes app supports exporting in Markdown.\n- Math Notes - Three-variable equations can be used to create 3D graphs.\nReminders\n- Categorization - Apple Intelligence can categorize reminders into different sections.\n- Suggestions - Apple Intelligence can suggest adding tasks, grocery items, and more to Reminders based on what's on your iPhone.\nFaceTime\n- Live Translation - FaceTime supports Live Translation, displaying captions if you're talking to someone who speaks another language.\n- Call Screening - FaceTime has new screening features for unknown numbers. Calls from unknown numbers can be asked for more information like name and reason for calling, or they can be sent directly to voicemail. Missed calls from unknown numbers can be silenced and sent to an Unknown Callers list.\nPodcasts\n- Enhance Dialogue - An Enhance Dialogue option mutes background sounds to enhance speech.\n- Playback speed - There are more options for playback speeds, ranging from 0.5x to 3x.\nApple Maps\n- Preferred Routes - Apple Maps learns your frequent commutes and the Maps widget can let you know if there are any significant delays along your preferred route, offering an alternative if necessary.\n- Saved Places - Apple Maps can save the places that you visit and spend time in so you can look them up later.\n- Incidents - There are additional types of incidents to choose from when making a report in the Maps app.\nWallet\nThere is an option to add a passport to the Wallet app, which creates a \"Digital ID\" that can be used at select TSA checkpoints in the United States.\nA new \"Verify with Wallet on the Web\" option allows websites to use the license or ID you have stored in the Wallet app for age and identity verification purposes. The process involves scanning a QR code with the iPhone and then authenticating, so it works in Safari and all other web browsers, too. It also works on non-Apple devices.\n- Package tracking - Apple Intelligence can recognize order tracking details from emails, adding the information to the Wallet app. This works on all purchases, not just those that were made using Apple Pay.\n- Boarding Passes - Boarding passes in Wallet have been upgraded and now show relevant information below the boarding pass, like Apple Maps directions for the airport terminal, and a link to Find My for luggage tracking.\n- Live Activity - Boarding passes now show up as a Live Activity on iPhone, so you can keep track of relevant flight information without having to open the Wallet app. Flight Live Activities can be shared with friends and family.\n- AutoFill Credit Cards - You can add and remove credit cards and debit cards that work with AutoFill from the Wallet app.\n- Apple Pay - Apple Pay supports rewards and installments for in-store purchases.\nGames\niOS 26 includes a Games app that comes pre-installed on the iPhone. It has all of the games from the App Store, along with Apple Arcade titles.\nGames you have installed are shown in a Library section. A Play Together section lets you invite friends to \"Challenges,\" where you compete to win in a game-specific task like getting the highest score during a given week.\nPreview\nThe Mac Preview app is now available on the iPhone and the iPad. It can be used for creating, viewing, and annotating PDFs. There are also tools for cropping, flipping, rotating, resizing, and editing images.\nJournal\n- Multiple Journals - You can now create more than one journal if you want to separate your entries by topic.\n- Maps - Journal entries can be viewed on a map.\n- Images - There's support for adding images inline with text.\nCarPlay\nCarPlay has been updated with the same Liquid Glass design that Apple added to iOS 26. The look includes layered glass-like app icons and translucent user interface elements.\nNew Messages App Features\nStarting with iOS 26, you can respond to messages with standard Tapbacks like a heart, thumbs up, or exclamation marks directly through CarPlay.\nCarPlay also now displays pinned conversations in the Messages app.\nPhone Calls\nApple added a compact view for incoming phone calls, so that you can still see other information on the screen, such as turn-by-turn directions.\nLive Activities and Widgets\nCarPlay's Dashboard screen can now show Live Activities, letting you keep track of things like a flight's arrival time at a glance.\nThe regular version of CarPlay also now has a widgets screen, for things like calendar appointments and HomeKit accessory controls.\nOther New Features\n- Multi-Touch Maps - Starting with iOS 26, CarPlay users can interact with mapping apps using multi-touch gestures in supported vehicles. This allows users to zoom and pan on the map with their fingers, just like they can on an iPhone.\n- Watch Videos While Parked - iPhone users can wirelessly stream videos to the CarPlay screen using AirPlay, according to Apple. For safety reasons, video playback will only be available when the vehicle is parked, to prevent distracted driving. The connected iPhone will be able to detect when the vehicle is in motion and end playback. Automakers need to add support for this feature, so it might be limited to newer vehicles and take some time to roll out.\n- Smart Display Zoom - iOS 26 adds a new Smart Display Zoom setting to CarPlay. When the setting is enabled, CarPlay will be automatically resized to better fit the shape and size of your vehicle's dashboard screen, if possible.\nBattery and Adaptive Power Mode\nApple updated the Battery section of the Settings app to provide a more in-depth look at how iPhone usage impacts battery life, and how much battery apps are draining.\nThe Battery section now displays a weekly view of battery usage along with a comparison of how much battery you're currently using compared to your typical average. You can see if you're using more, the same, or less battery life than you do on most days, with a readout of which apps are using the most battery, and by how much.\nApp battery usage includes specific details, such as letting you know if an app ran in the background longer, was on your screen longer, or sent more notifications than normal. You'll also see how much battery you've used since your last charge.\nApple also added an Adaptive Power mode that detects when iPhone usage is higher than normal and makes small performance adjustments like lowering display brightness or allowing certain background activities to take longer to extend battery life. Adaptive Power Mode is only available on the iPhone 15 Pro models and newer because it uses Apple Intelligence.\nOn the Lock Screen and in the Battery section, you'll see information on how long it will take your iPhone to charge up to full when it's plugged in.\nApple Intelligence Updates\nThere are new Apple Intelligence features throughout iOS 26, such as the Live Translation options in Phone, Messages, and FaceTime, and the suggestions and sorting options in the Reminders app. Some existing Apple Intelligence features have also been updated.\nVisual Intelligence\nIn iOS 26, Visual Intelligence works with screenshots for the first time. You can capture a screenshot of what's on your screen and then use Visual Intelligence on it to identify what you're looking at, find images, and get more information through ChatGPT.\nThere's a Highlight to Search option that lets you conduct an image search for a specific object in a screenshot, even if there are multiple things in the picture. It works with the apps that you use most frequently, like Google Search, Etsy, and others, and the feature is useful for finding a product in an image.\nIf you don't need to isolate one object in your screenshot, you can simply tap on the Ask button to ask questions about what you're seeing. Questions will be relayed to ChatGPT, and ChatGPT will provide the information. The Search button queries Google Search for more information.\nAs with the standard Visual Search, if your screenshot includes dates, times, and related information for an event, it can be added directly to your calendar.\nVisual Intelligence also adds support for quick identification of new types of objects. It can now identify art, books, landmarks, natural landmarks, and sculptures, in addition to the animals and plants it was able to provide information on before.\nGenmoji\nGenmoji supports combining two or more emoji together to create a new character. You can also combine existing emoji with text-based descriptions to tweak them, which is a more convenient starting point for generating something new.\nImage Playground\nApple added support for ChatGPT image generation capabilities, which means you can use several ChatGPT image styles when generating images. Options include Anime, Oil Painting, Watercolor, Vector, and Print.\nThere's also an open-ended option where you can tell ChatGPT what style you want, and you can make realistic images with this option. The new ChatGPT styles join the existing Animation, Sketch, and Illustration styles.\nNote that generating images with ChatGPT is limited if you do not have a ChatGPT subscription, so you cannot freely use the ChatGPT styles.\nChatGPT\nWith iOS 26, the ChatGPT Siri integration will use OpenAI's new GPT-5 model rather than GPT-4.\nGPT-5 brings enhanced reasoning capabilities and coding tools, along with better voice interaction and video perception.\nNew AirPods Features\niOS 26 adds several new features to the AirPods Pro 2 and the AirPods 4 through an accompanying AirPods firmware update.\nImproved Call Quality\nThe studio-quality recording feature brings more natural vocal texture and clarity to iPhone calls, FaceTime calls, and all CallKit-enabled apps like Zoom.\nBoth studio-quality audio recording and improved call quality are available across iPhone, iPad, and Mac, and support the Camera app, Voice Memos, Messages dictation, third-party camera apps, and video conferencing apps.\nCamera Remote\nThe AirPods can be used as a camera remote with the Camera app and third-party camera apps on iPhone or iPad. Just press and hold on the AirPods stem to take a photo or start a video recording.\nWhen the recording is finished, a press and hold gesture will stop the recording. Apple says that users who like to capture themselves singing and dancing for social networks like TikTok will be able to easily perform in sync with a soundtrack while simultaneously recording video.\nSoftware Updates\nWith the latest software updates, Apple is finally adding a way to manually update the firmware on your AirPods. When your AirPods are connected, you can go to the Settings app to get to a new software update interface.\nPause for Sleep\nIf you're listening to music, a podcast, or a book while you're in bed and you're wearing AirPods, the AirPods will pause your audio when you fall asleep.\nRead More\nSmaller Changes\nThere are dozens if not hundreds of smaller changes in iOS 26, and we've highlighted some of the more notable ones below.\n- Custom Ringtones - You can set custom ringtones in iOS 26 without using GarageBand. Ringtones can be saved to the Files app and then set using the Share Sheet.\n- New ringtone - There is a new variation of the Reflection ringtone that's called \"Alt 1.\"\n- Screenshots - Apple tweaked the screenshots interface, rearranging some of the buttons and adding in the Visual Intelligence feature. CarPlay screenshots can also now be displayed in the Screen Capture section of the Settings app.\n- iCloud Drive - There is an option to turn off iCloud Drive syncing when on a cellular network.\n- Contacts - The Contacts app has new Monogram styles that you can set for people.\n- Blocked Contacts - When you block someone, Apple now suggests Safety Check as an option. You can also see a list of Blocked Contacts in the Settings app.\n- Passwords - The Passwords app supports password history so you can see your prior passwords.\n- Tips - The Tips app includes step-by-step walkthroughs on troubleshooting iPhone issues.\n- Alarms - In the Clock app, you can set a custom snooze duration of 1 to 15 minutes, so you are no longer limited to the default 9-minute snooze time.\n- Keep Audio in Headphones - Prevents audio from automatically switching to newly connected devices like Bluetooth speakers or car speakers when you're already listening to music through headphones.\n- Apple News - There's a new Emoji Game for Apple News+ subscribers.\n- Weather - Getting weather updates via satellite is an option if you are outside of Wi-Fi or cellular range.\n- Apple Fitness+ - Custom Plans in Apple Fitness+ automatically generate a personalized schedule based on your workout habits and meditation preferences. Top activities, durations, trainers, and music are included.\n- Parental Controls - Apple improved the process for creating a Child Account and app approvals. Apple also requires parental approval for contact requests from kids, and blurring sensitive content in FaceTime calls and Shared Albums.\n- Captive Wi-Fi - Captive Wi-Fi portal login information now syncs between all Apple devices, so you only have to log in on one.\n- Wi-Fi Aware - iOS 26 supports Wi-Fi Aware, a function that supports peer-to-peer connections between Wi-Fi devices without an internet connection. Third-party apps are able to offer new features for high-speed file transfers, media sharing, screen sharing, and more.\n- Dictation - Dictation supports spelling, so you can spell out names if necessary.\n- Cinematic mode - Third-party video recording apps have access to Cinematic mode video capture. Cinematic mode lets users record video with a shallow depth of field and focus shifts between subjects.\n- Audio Mix - Audio Mix, a feature in the Photos app that allows sound to be edited after a video is recorded, is available to third-party apps. Modes include standard, in-frame, studio, and cinematic.\nAccessibility\niOS 26 includes a long list of new Accessibility features.\nApp Store Labels\nApp Store product pages feature Accessibility Nutrition Labels that highlight accessibility features in apps and games. The labels let users know if features like VoiceOver, Voice Control, Captions, Reduced Motion, and other accessibility options are supported in apps.\nAccessibility Reader\nAccessibility Reader is a systemwide reading mode that makes text easier to read for users with a range of disabilities. It includes multiple text customization features with options for adjusting font, color, spacing, and more. Accessibility Reader can be launched from any app and is built into the Magnifier app.\nBraille Access\nBraille Access turns an iPhone or iPad into a braille note taking device integrated in the Apple ecosystem. Users can open any app with Braille Screen Input or a connected braille device, for quick note taking in braille format. Braille Ready Format files can be opened from Braille Access, and an integrated form of Live Captions is supported.\nOther Features\n- Background Sounds - There are new Background Sounds options, including Babble, Steam, Airplane, Boat, Bus, Train, Rain on Roof, and Quiet Night.\n- Personal Voice - The Personal Voice feature that lets users preserve their voice is faster, easier, and more powerful. It will be able to take advantage of advances in on-device machine learning to create a smoother, more natural-sounding voice in less than a minute. Apple is also adding support for Spanish.\n- Vehicle Motion Cues - Apple is adding new customization options for the animated onscreen dots used by Vehicle Motion Cues.\n- Eye Tracking - Eye Tracking will let users choose to use a switch or dwell for making selections. There's also a new keyboard dwell timer for typing and reduced steps when typing with switches.\n- Head Tracking - Users will be able to more easily control iPhone and iPad with head movements.\n- Brain Computer Interfaces - For users who have Brain Computer Interface devices, Apple is adding a protocol that supports Switch Control, a technology that will let users control their device without physical movement.\n- Assistive Access - This setting is getting a custom Apple TV app with a simplified media player.\n- Music Haptics - Music Haptics on iPhone include customization options so haptics can be enabled for a whole song, or just vocals, plus there are options to adjust the intensity of taps, textures, and vibrations.\n- Sound Recognition - Sound Recognition is gaining Name Recognition, so users who are deaf or hard of hearing will know when their name is being called.\n- Live Captions - For Live Captions, Apple is adding support for English (India, Australia, UK, Singapore), Mandarin Chinese (Mainland China), Cantonese (Mainland China, Hong Kong), Spanish (Latin America, Spain), French (France, Canada), Japanese, German (Germany), and Korean.\n- Sharing - A Share Accessibility Settings option will let users quickly and temporarily share their accessibility settings with another iPhone or iPad, which Apple says is useful for borrowing a friend's device.\nCompatibility\niOS 26 is not available on the iPhone XR, iPhone XS, or the iPhone XS Max, but it will run on all other iPhones that support iOS 18.\n- iPhone 16e\n- iPhone 16\n- iPhone 16 Plus\n- iPhone 16 Pro\n- iPhone 16 Pro Max\n- iPhone 15\n- iPhone 15 Plus\n- iPhone 15 Pro\n- iPhone 15 Pro Max\n- iPhone 14\n- iPhone 14 Plus\n- iPhone 14 Pro\n- iPhone 14 Pro Max\n- iPhone 13\n- iPhone 13 mini\n- iPhone 13 Pro\n- iPhone 13 Pro Max\n- iPhone 12\n- iPhone 12 mini\n- iPhone 12 Pro\n- iPhone 12 Pro Max\n- iPhone 11\n- iPhone 11 Pro\n- iPhone 11 Pro Max\nWhile these iPhones will support iOS 26, advanced features may be limited to newer iPhones with faster processors. Apple Intelligence in iOS 18, for example, only runs on the iPhone 15 Pro and the iPhone 16 models.\niOS 26 Launch Date\nApple previewed iOS 26 at the Worldwide Developers Conference in June 2025, and made it available to developers for testing purposes in June. A public beta came out in July.\nFollowing the beta testing period, iOS 26 will launch in September 2025 alongside new iPhones.\nWhat's Next for iOS\nApple is already working on iOS 27, and the update will prioritize features and software that are tailored for the foldable iPhone that's expected to launch in 2026."
    },
    {
      "url": "https://www.macrumors.com/roundup/airpods-pro/",
      "text": "Should You Buy AirPods Pro?\nThe AirPods Pro 2 are Apple's premium in-ear wireless earbuds, offering a range of features like Active Noise Cancellation, precision finding, touch volume controls, and more. Refreshed in September 2023 with a USB-C port, the AirPods Pro 2 are getting closer to the end of their product cycle and rumors suggest that we're going to get an update later in 2025. At this point, most people should wait to buy the AirPods Pro, though it's still a reasonable time to buy for those who don't care about having the newest bells and whistles.\nThe next-generation AirPods Pro are expected to feature a refreshed design, improved ANC and sound quality, and they may get health-related features like heart rate monitoring and temperature sensing.\nWith a $249 price tag, AirPods can be more expensive than some of their direct competitors, but it's important to note that the H2 chips inside the AirPods offer a seamless and fully integrated pairing and device-switching experience for iPhone, iPad, Mac, and Apple TV users, which competitors are unable to match. The H2 chips also enable features like Adaptive EQ and spatial audio with dynamic head tracking. This means that when used with Apple devices, AirPods seem to be the best option for earbuds when it comes to features.\nIf you are looking for AirPods without an in-ear design, there are the AirPods 4, which start at $129. For an even higher-fidelity AirPods experience and an over-ear design, there are the AirPods Max which start at $549. On the other hand, if you feel that the AirPods Pro are too expensive, but you would still like Apple's seamless pairing and device-switching experience, Beats headphones are also viable options, with prices starting from as little as $69 for Beats Flex.\nTo get MacRumors readers the best prices on the AirPods Pro, we have a dedicated AirPods deals guide that highlights the best sales each month.\nAirPods Pro 2\nContents\n- Should You Buy AirPods Pro?\n- AirPods Pro 2\n- How to Buy\n- Reviews\n- AirPods Pro Design\n- Active Noise Cancellation\n- Sound Quality\n- H2 Chip\n- Gesture Support\n- Hearing Health\n- Other AirPods Features\n- Features Coming in iOS 26\n- Battery Life\n- Find My\n- Firmware\n- AirPods Pro How Tos\n- Other AirPods\n- What's Next for the AirPods Pro\n- AirPods Pro Roundup Changelog\n- AirPods Pro Timeline\nApple in September 2023 refreshed the AirPods Pro, introducing a new version of the AirPods Pro 2 that initially came out in September 2022.\nApple did not introduce any design changes for the updated AirPods Pro 2, but they do have a USB-C port instead of a Lightning port. Apple also added support for Lossless Audio when the USB-C AirPods Pro 2 are paired with the upcoming Apple Vision Pro headset, and improved dust resistance. Aside from these features, the USB-C AirPods Pro 2 are identical to the AirPods Pro 2 with Lightning port that came out in 2022.\nThe AirPods Pro feature a rounded design with silicone ear tips and a short stem that harken back to the first AirPods. As with all in-ear AirPods, the AirPods Pro come only in white, with no other color options available.\nApple added an updated H2 chip that enables new capabilities, including Active Noise Cancellation that's twice as good. Noise-cancelling microphones and a rear vent detect sound coming in, countering it before it reaches the ear. Apple says the AirPods Pro 2 reduce noise by sampling incoming sound at 48,000 times per second.\nTransparency mode has been updated with an Adaptive Transparency feature that is designed to reduce loud environmental noise without blocking out all sound. It can cut down on the sound of a passing vehicle siren, construction tools, loud speakers at a concert, and more. This is done using on-device processing enabled by the H2 chip.\nAlong with an H2 chip, the AirPods Pro 2 are equipped with a low-distortion audio driver and a custom amplifier, which Apple says bring richer bass and crystal-clear sound across a wider range of frequencies.\nFor a more customized fit, AirPods Pro now have silicone ear tips in XS, S, M, and L sizes, with XS available as the new size option.\nPersonalized Spatial Audio is available for an optimized, immersive surround sound experience with dynamic head tracking, and Adaptive EQ customizes the sound so you hear songs as they were intended based on how the AirPods Pro fit in your ears.\nThe AirPods Pro 2 stems now include Touch control, adding physical media playback and volume adjustment options that can be accessed right on the earbuds. A swipe up or down on the AirPods Pro touch sensor enables volume adjustments, and a press can change the music or answer phone calls, plus \"Hey Siri\" support is included.\nAirPods Pro features like seamless switching between devices signed into the same iCloud account, quick one-tap setup, and audio sharing are all supported.\nBattery life is improved and the AirPods Pro 2 last for up to six hours on a single charge when Active Noise Cancellation is turned on. The included charging case provides a total of 30 hours of listening time, six hours more than the prior-generation model.\nThe AirPods Pro 2 MagSafe Charging Case can be charged using Qi, MagSafe, or the Apple Watch charging puck, a new feature. The case is IPX4 sweat and water resistant and it is now equipped with a lanyard loop so you can add an optional lanyard.\nThere's also a built-in speaker in the case so you can find your AirPods Pro charging case with Find My should it become lost, and with Precision Finding that uses the new U1 chip, the Find My app can direct you right to your lost AirPods Pro case.\nA new set of hearing health features for the AirPods Pro 2 can assist with protecting users from loud noise, conduct scientifically validated hearing tests to measure potential hearing loss, and serve as an over-the-counter clinical-grade hearing aid for those experiencing hearing loss.\nNote: See an error in this roundup or want to offer feedback? Send us an email here.\nHow to Buy\nThe AirPods Pro 2 can be ordered from the Apple online store or purchased in an Apple retail location. AirPods Pro are priced at $249, and can be customized with a Memoji, Animoji, or emoji engraving.\nApple's refurbished store sells the AirPods Pro 2 with Lightning case at a discounted price.\nReviews\nInitial reviews of the AirPods Pro 2 praised the device's improved audio quality, longer battery life, and up to 2x as much noise cancellation compared to the original AirPods Pro. They also discussed the swipe-based volume controls, skin-detect sensors that more accurately turn on or off audio playback, and the new XS ear tip option.\nThe Verge's Chris Welch said there are \"substantial\" improvements to active noise cancellation:\nBut Apple has made substantial gains with its active noise cancellation. The company says, on average, the new implementation is \"up to\" two times as effective as the original AirPods Pro. And while I lack any scientific measurement tools, that claim doesn't seem unrealistic. At our office, I recently moved desks and now sit near an air vent that emits a persistent whir. The original AirPods Pro leave a trace of that in noise-canceling mode, but it's completely hushed and imperceptible with the second-gen pair. I can still hear chatting co-workers if they walk directly next to my desk, but at most times, the AirPods Pro grant me plenty of serenity. I've also observed legitimate improvements when commuting on the subway, and less overall street noise makes its way through when traversing Brooklyn day to day.\nWelch also noticed improved sound quality overall:\nLet's dig right into sound quality. Apple completely redesigned the amplifier and driver in the AirPods Pro, and while those drivers are the same 11-millimeter size as what's in the third-gen AirPods, they sound superior and deliver the cleanest, most dynamic output of any AirPods to date.\nEngadget's Billy Steele achieved around six hours of battery life as advertised:\nDuring my tests, I managed six hours and fifteen minutes of use with a mix of noise cancellation, transparency mode and calls. That's more than the previous generation (4.5 hours) and it's on par with most of the competition these days. Sure, some companies offer 10-plus hours on a charge, but the average is around five to seven for the noise-canceling products I've tested. More battery life would always be nice, but the six or seven hours Apple musters is enough to get you through the workday if you take a short break.\nGizmodo's Andrew Liszewski said the new swipe-based volume control feature is a welcomed upgrade, but can be \"a little finicky\" on occasion:\nIt's a welcome upgrade, but unfortunately one that I found a little finicky to make work. It occasionally required a couple of swipes before anything happened. As someone who generally hates having to touch my earbuds while I'm wearing them (it inevitably dislodges them a little) I will probably continue to stick to using Siri voice commands for volume adjustments or track skipping (the one thing Siri does very well).\nMobileSyrup's Patrick O'Rourke said swipe-based volume control is his favorite new AirPods Pro feature, providing for a more convenient listening experience:\nIn my experience, the new AirPods Pro volume touch controls are extremely responsive and work with subtle changes. If you, for example, only want to lower or raise the volume by a notch or two, you can do that with a brief swipe. The controls are also marked with a slight clicking noise, indicating they're active and working. I didn't run into any accidental presses during my several days with the AirPods Pro (2nd-Gen), even while long-pressing on the stem to toggle Active Noise Cancellation on/off or double-pressing to jump between songs. On-device touch volume controls are by far my favourite new AirPods Pro feature. The convenience and ease of use of shifting volume levels directly on the AirPods Pro (2nd-Gen) without the need to take out my iPhone, really can't be understated.\nO'Rourke added that iOS 16's Personalized Spatial Audio feature is not very noticeable:\nIn theory, I like the idea of audio being tuned specifically to the shape of your ear, but in practice, it doesn't make much of a difference. It's also worth noting that while I really like Spatial Audio when watching movies or TV shows on platforms like Apple TV+, I find it hit or miss with music, especially when a track wasn't originally recorded with the technology in mind and has been remastered.\nWIRED's Parker Hall said the charging case's new built-in speaker \"rings quite loudly\" to assist with Find My location tracking, but he wishes the case had a USB-C port for wired charging instead of the usual Lightning connector:\nNeed to find the case via Apple's Find My app? Now you can, and it rings quite loudly. It also makes a little jingle when it starts charging. Speaking of, you can wireless charge as usual (the case supports MagSafe too), but it's a shame to see Apple still relying on the Lightning port instead of USB-C.\nAirPods Pro Design\nThe AirPods Pro 2 feature the same design as the original AirPods Pro, despite rumors that we could see some major changes. There were rumors of a stemless design, but that did not pan out, and Apple is continuing to use the same rounded in-ear bud with flexible silicone tips and a short stem.\nApple designed the silicone tips to confirm to the contours of each individual ear, ensuring a comfortable fit and a good seal, an important factor for noise cancellation. The AirPods Pro 2 tips come in extra small, small, medium, and large, and the tips click into place on the AirPods Pro for easy swapping.\nThe AirPods Pro measure in at 30.9mm tall and 21.8mm wide, identical to the original AirPods Pro. They weigh 5.3 grams.\nThere is a skin-detect sensor in the AirPods that is designed to better detect when the AirPods are removed from the ears in order to preserve battery life.\nThe AirPods Pro 2 continue to feature a vent system for pressure equalization when using Active Noise Cancellation. It is designed to minimize the discomfort that can happen with other earbud designs.\nMagSafe Charging Case\nApple is selling the AirPods Pro 2 with an updated MagSafe Charging Case that has a magnet inside for use with MagSafe charging accessories.\nThe case measures in at 60.6mm wide, 45.2mm tall, and 21.7mm thick, so despite the addition of a new charging feature, the case is identical to the first-generation AirPods Pro case, though it is slightly heavier. The AirPods Pro MagSafe Charging Case weighs 50.8 grams for a total weight of 56.1 grams with the AirPods Pro inside. The original AirPods Pro case weighed 45.6 grams.\nNew to the Charging Case is a lanyard loop for attaching third-party lanyards, and a speaker that can allow the case to play a sound when used with the Find My feature.\nThere is a U1 chip in the MagSafe Charging Case which allows it to work with Precision Finding in the Find My app with an iPhone that has an Ultra Wideband chip.\nWater Resistance\nApple says that the AirPods Pro and the MagSafe Charging Case are \"sweat and water resistant,\" offering IPX4 water resistance. IPX4 water resistance was also a feature of the original AirPods Pro, but the case is more water resistant now.\nIPX4 water resistance means the AirPods Pro and the case can hold up to sweat and light rain, but they should not be submerged and liquid exposure should be avoided when possible. Apple's warranty does not cover water or sweat damage.\nEar Tip Fit Test\nTo get the perfect fit and best audio experience, Apple offers an Ear Tip Fit Test for the AirPods Pro. After placing the AirPods Pro in each ear, Apple uses advanced algorithms and the microphones in each AirPod to measure the sound level in the ear and compare it to what's coming from the speaker driver.\nThe algorithm then detects whether the ear tip is the right size and has a good fit, or if it should be swapped out for another size to create a better seal. AirPods Pro silicone tips come in XS, S, M, and L, with XS offered as a new option.\nActive Noise Cancellation\nActive Noise Cancellation (ANC) has been notably improved, and the AirPods Pro 2 cancel up to twice as much noise as the prior-generation AirPods Pro.\nANC uses the microphones built into the AirPods Pro along with Apple's software algorithms to adapt sound to each person's ear. The outward-facing microphone detects external sound so the AirPods Pro can analyze environmental noise, while the inward-facing microphone listens to the sound coming toward the ear. ANC adapts the sound signal reaching the ears 48,000 times per second.\nThe AirPods Pro 2 are equipped with a new driver and improved acoustic algorithms to reduce more unwanted noise.\nAdaptive Transparency\nApple updated the AirPods Pro with a new Adaptive Transparency feature that builds on the Transparency mode introduced with the first-generation AirPods Pro.\nTransparency Mode is designed to allow AirPods Pro users to hear the world around them, listening for traffic, train announcements, and more while also not blocking out music, podcasts, and other audio content.\nApple's new Adaptive Transparency uses on-device processing to reduce loud environmental sounds to a more comfortable level. It can lower the volume of a passing vehicle siren, construction tools, or loud speakers at a concert.\nAdaptive Audio\nFor the AirPods Pro 2, an Adaptive Audio option blends the Transparency and Active Noise Cancellation modes into one, automatically tailoring noise control based on your environment and interactions throughout the day.\nAdaptive Audio is meant to drown out the environmental sounds that you don't want to hear like construction noise or the noise of an airplane, while letting you hear important announcements and conversations.\nPersonalized Volume adjusts the sound of what's playing based on your personal preferences and the sounds around you, with the iPhone learning more about the volume you like over time. With Conversation Awareness, when someone is speaking, media volume is lowered, background noise is reduced, and the voices in front of you are enhanced.\nSound Quality\nApple's AirPods Pro 2 are outfitted with an updated custom high-excursion low-distortion Apple driver and a custom high dynamic range amplifier, which Apple says brings richer, deeper bass and crystal-clear sound at all volume levels.\nMicrophones\nThere are two dual beamforming microphones and an inward-facing microphone for Active Noise Cancellation purposes.\nAdaptive EQ\nAdaptive EQ is designed to improve sound quality by taking into account the shape of the ear. The feature uses computational audio and an updated internal microphone pointed toward the ear to optimize sound for each person.\nSound is tuned in real time based on the fit of the AirPod in the user's ear, with the AirPods Pro adjusting and tuning the low and mid frequencies for consistent playback every time.\nApple says the new H2 chip uses new adaptation algorithms to process sound more quickly, tuning audio at the precise second that it is heard, for higher-fidelity sound. Phone calls also sound more natural thanks to voice enhancement algorithms.\nSpatial Audio\nApple introduced Spatial Audio in 2021, bringing a surround sound like experience to Apple Music, the Apple TV app, and more. With Dolby Atmos tracks in Apple Music, the AirPods Pro can provide a multi-dimensional audio experience that makes it so the sound comes from all around you.\nSpatial audio applies directional audio filters and subtly adjusts the frequencies that each ear receives to place sounds virtually anywhere in space for an immersive listening experience. The feature uses sensors in the AirPods Pro along with sensors in the iPhone or iPad to track the motion of a person's head as well as the position of their device, comparing the motion data and remapping the sound field so that it stays anchored to the device even as the head moves.\nDynamic head tracking works with spatial audio and on Group FaceTime calls so it sounds like the FaceTime participants are right in the room with you.\nThe AirPods Pro also support Personalized Spatial Audio, which is an iOS 16 feature. With Personalized Spatial Audio, you can use your TrueDepth camera to scan the area around you to create a custom sound experience.\nVoice Isolation\nVoice Isolation cuts down on background noise so your voice sounds clearer to the person you're speaking with on a phone call. The microphones on the AirPods Pro will avoid picking up ambient noise with Voice Isolation, prioritizing your voice.\nVision Pro Lossless Audio\nWhen paired with the Apple Vision Pro, the 2023 AirPods Pro with a USB-C port support 20-bit 48kHz lossless audio. Lossless audio with the Apple Vision Pro is limited to the newest version of the AirPods Pro 2, and this feature is not be available on the original AirPods Pro 2.\nH2 Chip\nThere is a new H2 chip inside the AirPods Pro 2, which is an improvement over the prior H1 chip. The H2 powers all of the features in the AirPods, including Active Noise Cancellation, Transparency Mode, and Adaptive EQ.\nThe H2 chip also continues to enable the features AirPods have come to be known for, including fast switching between Apple devices that are signed into the same iCloud account, \"Hey Siri\" support, instant pairing, and Audio Sharing, which allows more than one set of AirPods to be paired to a single device.\nBluetooth\nThe AirPods Pro support the latest Bluetooth 5.3 specification. Bluetooth 5.3 includes enhancements that can improve reliability and energy efficiency. The specification also includes LE Audio, but Apple does not yet appear to have implemented support for LE Audio.\nOther Sensors\nThere's a motion-detecting accelerometer and a speech detecting accelerometer in the AirPods Pro in addition to the skin-detect sensor. All of these sensors work together to power AirPods features like ear detection.\nGesture Support\n- Swipe up or down on the stem to adjust the volume\n- Press once to play/pause\n- Press once to answer an incoming phone call\n- Press twice to skip forward\n- Press three times to skip back\n- Press and hold to swap between ANC and Adaptive Transparency\n- Nod yes to accept calls, shake your head to decline. Also works for Siri responses\nHearing Health\nWith iOS 18.1, Apple introduced a new suite of hearing health features for the AirPods Pro 2 encompassing prevention, awareness, and assistance related to hearing loss. Hearing Protection, on by default across all listening modes, helps reduce loud sounds with a combination of passive noise reduction thanks to the silicone ear tips, while the H2 chip provides active reduction of louder, intermittent sounds.\nOn the awareness side, Apple introduced a scientifically validated Hearing Test features that lets users check their own hearing from the comfort of their homes, with results securely stored in the Health app and able to be shared with healthcare providers.\nAnd finally, AirPods Pro are becoming the first over-the-counter clinical-grade hearing aid device thanks to personalized audio adjustments created based Hearing Test results. The functionality is available in the United States, UK, Australia, and 100 other countries and regions.\nOther AirPods Features\n- Mute and Unmute - Press on the stem of the AirPods Pro (any model) or AirPods 3, or AirPods 4 to mute and unmute yourself on a call. On AirPods Max, press on the Digital Crown.\n- Automatic Device Switching - Automatic Switching between Apple devices is quicker and more reliable. This is limited to AirPods Pro 2 paired with an iPhone XR/iPhone XS or later.\n- Dark Mode - When connecting the AirPods to the iPhone, if your iPhone is in Dark Mode, the connection popup is also shown in Dark Mode.\nFeatures Coming in iOS 26\nThe upcoming iOS 26, iPadOS 26, and macOS Tahoe updates will add new features to the AirPods when paired with an upcoming AirPods firmware update that will come out alongside the new software.\nStudio Quality Recording\nThe AirPods 4 and the AirPods Pro 2 can be used to record studio-quality audio for interviews, podcasts, songs, videos, and more. Apple says that the feature can be used to record high-quality vocals while on the go.\nYou can record higher-quality audio when making videos or using your devices to do things like record a podcast.\nImproved Audio Quality\nThe studio-quality recording feature brings more natural vocal texture and clarity to iPhone calls, FaceTime calls, and all CallKit-enabled apps like Zoom.\nBoth studio-quality audio recording and improved call quality are available across iPhone, iPad, and Mac, and support the Camera app, Voice Memos, Messages dictation, third-party camera apps, and video conferencing apps.\nCamera Remote\nThe AirPods can be used as a camera remote with the Camera app and third-party camera apps on iPhone or iPad. Just press and hold on the AirPods stem to take a photo or start a video recording.\nWhen the recording is finished, a press and hold gesture will stop the recording. Apple says that users who like to capture themselves singing and dancing for social networks like TikTok will be able to easily perform in sync with a soundtrack while simultaneously recording video.\nUpdate Interface\nWith the latest software updates, Apple is finally adding a way to manually update the firmware on your AirPods. When your AirPods are connected, you can go to the Settings app to get to a new software update interface.\nPause Audio for Sleep\nIf you're listening to music, a podcast, or a book while you're in bed and you're wearing AirPods, the AirPods will pause your audio when you fall asleep.\nKeep Audio in Headphones\nWhen you use AirPods, you can opt to keep audio in your headphones when other playback devices like cars and speakers connect to the iPhone.\nBattery Life\nOn their own, the AirPods Pro 2 offer up to six hours of listening time, or 5.5 hours with Spatial Audio and Head Tracking enabled. When used for talking, the battery lasts for a total of 4.5 hours. The AirPods Pro 2 earbuds feature a battery capacity of 49.7 mAh, up 15 percent from 43.2 mAh capacity of the prior-generation AirPods Pro earbuds, which accounts for some of the difference in battery life.\nThe MagSafe Charging Case has a battery capacity of 523 mAh, up just 4 mAh over the prior-generation case. With the MagSafe Charging Case, the AirPods Pro 2 offer up to 30 hours of listening time and 24 hours of talk time before needing to be recharged. Charging can be done using a MagSafe charger, a Lightning cable, a Qi-based charger, or, new this year, the Apple Watch charger.\nApple says that five minutes in the charging case provides the AirPods Pro with one hour of listening time or one hour of talk time.\nFind My\nBoth the AirPods Pro 2 and the MagSafe Charging Case work with the Find My app, so if any component is lost, it can be located using another Apple device. The Charging Case has a U1 chip so it can be tracked down with Precision Finding on a compatible iPhone, and with the new built-in speakers, the case can play a sound so it's easier to find.\nFirmware\nApple regularly updates the software that runs on the AirPods Pro. The current firmware for the AirPods Pro 2 is version 7E93, released in March 2025. The 7E93 firmware added bug fixes and performance improvements. Firmware can be installed by connecting the AirPods Pro to an iPhone, iPad, or Mac, putting them in the case, and charging the case.\nAirPods Pro How Tos\nOther AirPods\nThe AirPods Pro 2 are available alongside the AirPods 4, priced starting at $129, and the over-ear AirPods Max, priced at $549.\nApple's AirPods 4 are similar to the AirPods Pro, but without silicone ear tips. The cheaper model priced at $129 does not offer Active Noise Cancellation (ANC) technology, but the $179 model includes ANC plus a wireless charging case that also includes a speaker for Find My support. The AirPods Max also feature ANC, but are larger over-ear headphones made from aluminum.\nWhat's Next for the AirPods Pro\nApple will introduce a redesigned version of the AirPods Pro in 2025, according to Bloomberg's Mark Gurman. Audio quality and design will be refined, with Apple also adding a faster chip. The next-generation AirPods Pro could include \"much better\" Active Noise Cancellation capabilities compared to the AirPods Pro 2, according to rumors. No information about how Apple will improve ANC is available at this time.\nIn February, Apple debuted the Powerbeats Pro 2 with a new heart rate monitoring feature that could eventually come to the AirPods Pro. The Powerbeats Pro 2 uses LED optical sensors that pulse more than 100 times per second to measure heart rate through blood flow. The heart rate monitoring feature works with popular fitness apps, syncing data to Apple Health.\nApple plans to bring this functionality to the AirPods Pro, perhaps in the AirPods Pro 3 that are expected in late 2025. Temperature sensing is also a possibility, and that would set the AirPods Pro apart from the Powerbeats Pro 2.\nThe AirPods Pro will get a refreshed design for both the earbuds and the case, but what the new design will look like remains a mystery. Apple slimmed down the case of the AirPods 4, so it's possible that'll happen with the AirPods Pro too.\nWith the AirPods 4, Apple also removed the setup button on the back of the case, opting instead for a concealed capacitive button. The included LED light is also subtler, and these are also changes we'll likely see for the AirPods Pro.\nThough several rumors suggest that new AirPods Pro will come in 2025, Analyst Jeff Pu says Apple won't launch a new model until 2026.\nFuture Updates\nBased on Apple's patent filings, a future version of the AirPods or AirPods Pro could include a built-in interactive touchscreen display that would let users control audio sources and interact with apps associated with the connected device, though there are no rumors of this technology coming in 2025.\nA future version of the AirPods will include integrated infrared camera modules to improve spatial experiences when paired with the Vision Pro headset. The cameras will work similarly to the Face ID system on the iPhone, scanning the area surrounding the user to better map the environment. The cameras could also provide data for more advanced AI capabilities.\nThe IR cameras will allow for a broader range of gestures that will improve user interaction and the syncing of audio to head movement. The cameras that will be added to the AirPods could also be used to scan the environment and describe objects, similar to the Visual Intelligence feature that's available on newer iPhones.\nApple analyst Ming-Chi Kuo believes we could see these new AirPods as soon as 2026, but it is not yet clear if the feature will be added to the standard AirPods or a version of the AirPods Pro. Bloomberg's Mark Gurman thinks we could get AirPods with cameras in 2027, so this is another feature not expected in the 2025 refresh.\nAirPods Pro Roundup Changelog\n- July 11 - General maintenance and reorganization.\n- June 27 - Added information on features coming in iOS 26.\n- June 17 - Updated with new rumors.\n- May 15 - Added new rumors about future AirPods Pro.\n- April 17 - Refreshed buyer's guide info.\n- March 31 - Updated with new firmware version.\n- March 25 - Updated hearing health info.\n- March 13 - Added info on future AirPods features, updated buyer's guide info.\n- February 24 - Updated to note Hearing Health is now in the UK."
    },
    {
      "url": "https://buyersguide.macrumors.com/#AirPods-Pro",
      "text": "MacRumors\nBuyer's Guide\nWant to compare and contrast features between two different products?\nTry our intelligent assistant which can answer those questions based on the MacRumors knowledge base.\nThis page provides a product summary for each Apple model. The intent is to provide our best recommendations regarding current product cycles, and to provide a summary of currently available rumors for each model. This page is based on rumors and speculation and we provide no guarantee to its accuracy.\nCheck out our product buying guides and latest deals in the lists below, and keep scrolling down the page for detailed information on all of Apple's major products.\n- 2025 iPhone Buyer's Guide\n- 2025 iPad Buyer's Guide\n- 2025 Apple Watch Buyer's Guide\n- Best AirPods Deals\n- Best HomePod Deals\n- Best Apple TV 4K Deals\n- Best MacBook Pro and MacBook Air Deals\n- Best iMac Deals\n- Best iPad Deals\n- Best iPhone Deals\niPad\nThe \"iPad\" is Apple's mainstream iPad, updated as an 11th-generation model in March 2025 with an A16 chip and starting at 128GB of storage, double the previous model. Prices start at $349.\niPad Roundup\nBest iPad Deals\nRelated Guides\nRecent Articles\niPad Air\nApple updated the iPad Air in March 2025 with the M3 chip, but no other improvements. Prices start at $599 for the 11-inch and $799 for the 13-inch.\niPad Air Roundup\nBest iPad Deals\nRelated Guides\nRecent Articles\niPhone 16e\n- The iPhone 16e is Apple's new entry-level $599 iPhone with A18 chip, Face ID, USB-C, single-lens rear camera, and more.\niPhone 16e Roundup\nRelated Guides\nRecent Articles\niPad Mini\n- Seventh-generation iPad mini debuted in October 2024 with A17 Pro chip for Apple Intelligence, Apple Pencil Pro support, faster Wi-Fi and USB, and more.\niPad Mini Roundup\nBest iPad Deals\nRelated Guides\nRecent Articles\niPhone 16\n- New Action and Camera Control buttons, A18 chip, camera improvements, longer battery life, and more. Available now.\niPhone 16 Roundup\nBest iPhone Deals\nRelated Guides\nRecent Articles\niPhone 16 Pro\n- Larger displays, new Camera Control button, A18 Pro chip, longer battery life, and more. Available now!\niPhone 16 Pro Roundup\nBest iPhone Deals\nRelated Guides\nRecent Articles\niPad Pro\nThe iPad Pro was updated in May 2024 with an M4 chip, an Ultra Retina XDR tandem OLED display, and a redesign that makes it the thinnest Apple product ever. Prices start at $999 for the 11-inch model and $1,299 for the 13-inch model.\niPad Pro Roundup\nBest iPad Deals\nRelated Guides\nRecent Articles\n13\" MacBook Air\nNew M4 models with up to 18 hours of battery life, a 12MP Center Stage camera, and more available for pre-order now. Available in four colors including a new sky blue, and starts at a lower price of $999.\n13\" MacBook Air Roundup\nBest MacBook Pro and MacBook Air Deals\nRelated Guides\nRecent Articles\nMac Studio\nThe Mac Studio is a pro-oriented desktop Mac that's a hybrid between a Mac mini and a Mac Pro. M4 Max model starts at $1,999 and M3 Ultra model starts at $3,999.\nMac Studio Roundup\nRelated Guides\nRecent Articles\n15\" MacBook Air\nNew M4 models with up to 18 hours of battery life, a 12MP Center Stage camera, and more available for pre-order now. Available in four colors including a new sky blue, and starts at a lower price of $1,199.\n15\" MacBook Air Roundup\nBest MacBook Pro and MacBook Air Deals\nRelated Guides\nRecent Articles\nMacBook Pro\nNew 14\" and 16\" MacBook Pro models were introduced on October 30, 2024. The 14\" model is available with M4, M4 Pro, and M4 Max chip options starting at $1,599, while the 16\" model is available with M4 Pro and M4 Max options starting at $2,499.\nMacBook Pro Roundup\nRelated Guides\nRecent Articles\nMac Mini\nApple announced a redesigned Mac mini with M4 and M4 Pro chip options on October 29, 2024. The M4 model starts at $599, while the M4 Pro model starts at $1,399.\nMac Mini Roundup\nRelated Guides\nRecent Articles\niMac\nApple's 24-inch iMac with the M4 chip was announced on October 28, 2024. A model with an 8-core CPU and 8-core graphics starts at $1,299, with 10-core CPU and 10-core graphics available in higher-end models. Available in blue, purple, pink, orange, yellow, green, and silver.\niMac Roundup\nBest iMac Deals\nRelated Guides\nRecent Articles\nMac Pro\nThe Mac Pro is Apple highest-end Mac for professionals and in June 2023 it became the final Mac to transition from Intel processors to Apple silicon. It is based on a the M2 Ultra chip and starts at $6,999, so this machine is only for the most serious professional users.\nMac Pro Roundup\nRelated Guides\nRecent Articles\nAirPods\n- AirPods 4 are Apple's newest AirPods with improved sound and comfort. Two models available, including one with active noise cancellation and a wireless charging case.\nAirPods Roundup\nBest AirPods Deals\nRelated Guides\nRecent Articles\nAirPods Max\n- The AirPods Max are Apple-branded high-end over-ear headphones with active noise cancellation, spatial audio, and adaptive EQ, priced at $549. Updated in September 2024 with new colors and USB-C instead of Lightning, but no other changes.\nAirPods Max Roundup\nBest AirPods Deals\nRelated Guides\nRecent Articles\nAirPods Pro\nAt its September 2023 media event, Apple released second-generation AirPods Pro with a USB-C charging port on the case, replacing the previous Lightning port. While the new AirPods Pro are still referred to as second-generation, the earbuds themselves also seem to have some improvements including better dust resistance and exclusive support for Lossless Audio when paired with the upcoming Vision Pro headset.\nAirPods Pro Roundup\nBest AirPods Deals\nRelated Guides\nRecent Articles\nHomePod\nNearly two years after discontinuing the original HomePod, Apple in January 2023 introduced an updated model powered by an S7 chip and featuring a four-inch woofer, five tweeters, four microphones, a U1 chip for Ultra Wideband features like handing off music from an iPhone, and support for Spatial Audio with Dolby Atmos.\nHomePod Roundup\nBest HomePod Deals\nRelated Guides\nRecent Articles\nHomePod Mini\n- HomePod mini is a smaller, more affordable version of the original HomePod that has similar features but in a cheaper package. New blue, orange, and yellow color options were released in November 2021.\nHomePod Mini Roundup\nRelated Guides\nRecent Articles\nApple Watch\nThe Apple Watch Series 10 has received a design update with larger casings and displays but a thinner overall design, along with a new S10 chip, water temperature sensor, and more.\nApple Watch Roundup\nRecent Articles\nVision Pro\n- Apple Vision Pro is Apple's first wearable headset device, offering a mixed reality experience. Vision Pro is priced starting at $3,499, and it is available now.\nVision Pro Roundup\nRecent Articles\nApple Watch Ultra\nApple's most rugged Apple Watch with better GPS, a 49mm titanium casing, a more durable display, extra long battery life, a built-in Action button, and more. Now available in black in addition to the original natural color and with some new band options, but no internal upgrades since September 2023.\nApple Watch Ultra Roundup\nRelated Guides\nRecent Articles\nApple TV\nThe third-generation Apple TV 4K was introduced in October 2022 and is equipped with an A15 Bionic chip for improved performance and HDR10+ support for the best possible video quality, while the Siri Remote now charges via USB-C. A 64GB model is priced at $129, while a 128GB model at $149 adds Ethernet and Thread smart home networking.\nApple TV Roundup\nBest Apple TV 4K Deals\nRelated Guides\nRecent Articles\nApple Watch SE\nApple updated the Apple Watch SE in September 2022 with an S8 chip, a lighter, color-matched nylon composite material for the back, and new Crash Detection, international roaming, and Low Power Mode features. Pricing starts at $249 for GPS models and $299 for GPS+Cellular models. New bands and packaging launched in September 2023 as part of Apple's push toward carbon neutral products, but the watch hardware itself is unchanged.\nApple Watch SE Roundup"
    },
    {
      "url": "https://www.macrumors.com/guide/apple-intelligence/",
      "text": "Apple Intelligence is what Apple calls its artificial intelligence feature set, previewed at WWDC in June 2024. The first Apple Intelligence features launched with iOS 18.1, iPadOS 18.1, and macOS Sequoia 15.1, and additional features came in iOS 18.2, iPadOS 18.2, and macOS Sequoia 15.2. There's still more to come, though, and the rest of the Apple Intelligence features are set to come later in 2025.\nWriting Tools\n- Proofread text checks for spelling and grammar errors, including word choice and sentence structure. You can accept all suggestions with a tap or go through them one by one with explanations.\n- Rewrite cleans up what you've written and shifts the tone without impacting your content. Options include Friendly, Professional, and Concise.\n- You can select text and get a summary of it with Apple Intelligence. You can choose to create a paragraph, pull out key points, make a list, or create a table. Summaries are available in Mail, Messages, and more.\n- There is an open-ended Writing Tools option that lets you describe a change you want to make to something you've written. You can choose any mood or writing style that you want, with varying degrees of success. If you want something to be more flowery or elaborate, Writing Tools can make it happen. You can also ask for your text to be converted into a different format, like a poem.\n- Writing Tools has a \"Compose\" feature that uses Siri ChatGPT integration. With this option, Siri can leverage ChatGPT to compose writing from scratch rather than just rewriting text.\nYou can select any text on your iPhone, iPad, or Mac and use Apple Intelligence to access Writing Tools for summaries and other features.\nSiri\n- There's a glow around the edges of the display when Siri is activated, applicable to iPhone, iPad, and CarPlay. On Mac, the Siri window can be placed anywhere. The glow animates responsively to the sound of your voice so you can tell when Siri is listening without interrupting other things you're doing.\n- A double tap at the bottom of the display brings up the Type to Siri interface so you can type requests instead of speaking them. On Mac, you need to press the Command key twice to bring up Type to Siri. Type to Siri includes suggested requests so you can get your questions answered faster.\n- Siri can maintain context between requests so you can ask a question and then reference it in a second reply. If you ask about the temperature in Raleigh, for example, and then follow up with \"what's the humidity?\" Siri should know you mean in Raleigh.\n- If you stumble over your words when speaking to Siri, or change what you're saying mid-sentence, Siri will follow along.\n- Siri has Apple's product knowledge and support base for answering questions about your device's features and settings, and can even find settings when you don't know the exact name by using natural language search.\n- There is a summarize button for summarizing any of your incoming emails, plus you will see a brief summary of an email in your inbox list rather than the first few lines of the email.\n- Mail surfaces time sensitive messages first when applicable, putting them at the top of your inbox so you see what's important right away.\n- Smart Reply provides quick-tap responses to emails that you've been sent, with contextual options based on what's in the email.\n- Multiple notifications from Mail will be summarized on your Lock Screen so you can see what's in an email without opening the app.\nMessages\n- Messages has Smart Reply options for incoming texts, which analyze the content of messages to offer suggestions of what you might want to say.\n- Multiple Messages notifications are summarized on your Lock Screen.\n- You can use all of the Writing Tools features in the Messages app for proofreading and refining what you're planning to send.\nPhotos\n- You can create a Memory Movie with just a description, such as \"My cat in 2024,\" or \"Orlando in the summer.\" The feature automatically picks relevant photos and chooses songs, but you can tweak through the Memory Mixes feature or choose a mood to guide the direction of the audio. You can also add in specific scenes and images you want to see throughout the memory when you're creating the prompt.\n- Natural language search is available in Photos, so you can just describe what you're looking for, such as \"Eric rollerskating while wearing green.\"\n- Search can also find specific moments in video clips.\n- Search offers up smart complete suggestions for narrowing down what you might want to find.\nClean Up\nThe Photos app also includes \"Clean Up,\" a feature that lets you remove unwanted objects from your photos. The Clean Up tool in the Photos app is able to automatically detect objects in an image that might not be wanted, but you can also tap, circle, or brush over an unwanted object to remove it.\nZooming in on an image can help with using a finger as a brush to remove smaller blemishes and issues with an image, and it is intelligent enough not to remove part of a person even if a person or main subject is selected.\nClean Up works on all images in the Photos library, including older images and images captured by other devices like a point and shoot camera or a DSLR.\nTranscription Summaries\nIn Notes and other apps, you can record audio and get a transcript along with a summary of your transcript, which is useful for recording lectures and other audio. Transcription isn't an Apple Intelligence feature, but summaries are.\nFocus Modes\nThere is a dedicated Reduce Interruptions Focus Mode that only shows you important notifications that need attention while filtering out everything else.\nWhen customizing an existing Focus mode or creating a new one, there is a new toggle to turn on Intelligent Breakthrough and Silencing. This option allows important notifications to interrupt you, while muting notifications that are not important, which is the same thing that the Reduce Notifications Focus does. You can override the notification settings for specific apps and people, which is how it worked prior to iOS 18.1.\nNotification Summaries\nYour incoming notifications are summarized so you can see what's new for each app at a glance.\nPhone\nSummaries of transcriptions generated from your phone calls are supported. You can record a phone call and get a transcription in iOS 18, which is not an Apple Intelligence feature. What does require Apple Intelligence, though, is getting a summary from that transcription without reading through the entire thing.\nNote that you can start a recording by tapping on the record button in the upper left corner of the display when on a phone call. All participants are notified that the call is being recorded before the recording starts.\nRecorded phone calls are stored in the Notes app, where you can tap in to view a transcript and get a summary generated from that transcript.\nSafari\nWhen reading an article in Reader Mode, there is an option to have Apple Intelligence summarize the article for you.\nImage Playground\nImage Playground can be used to generate images in cartoon-like styles using a text-based prompt. Apple has built-in suggestions and concepts that you can choose from, like costumes, locations, items, and themes.\nWhile Image Playground is a standalone app, it is also integrated into the Messages and Notes app. In these apps, Apple can use context from what you've typed for image generation suggestions.\nFor inspiration, you can upload or take a photo, and then get a cartoon AI version of it, and you can also use images of friends and family members pulled from the People album in the Photos app.\nYou can start with a base suggestion or photo and then continue to add to it until you get what you want. You can remove suggestions at any time, and save your favorite creations for use in other apps. Anytime you create something with Image Playground, you'll get multiple options so you can choose the best one.\nThere are only Animation and Illustration styles for Image Playground, so there is no option for creating photorealistic images.\nImage Wand\nImage Wand is basically the same thing as Image Playground, but in the Notes app. When you have notes that you've taken, you can circle an empty spot or some text and Image Wand will add a contextually relevant image.\nSo if you have notes on photosynthesis, you can add in an image of a plant under the sun. Image Wand isn't able to generate complex images, so if you want a picture of the internal structure of mitochondria, you're out of luck, but it can make a stylized image featuring the organelle.\nOn an iPad, you can draw a rough sketch of what you want to add to your notes with an Apple Pencil, and then use Image Wand to generate something more polished.\nGenmoji\nGenmoji are custom emoji characters that you can create using a text-based description. If there's an emoji you can't find but need, like a duck eating a sandwich or an alligator skateboarding, Genmoji can make it for you.\nGenmoji aren't too far off from Image Playground images, but the generation system tends to want to add a person for a lot of requests. You can choose yourself or a friend or family member, or just use a generic emoji character as your base.\nIn Messages and other apps, Genmoji behave like emoji, but they're not going to display properly for anyone running an operating system earlier than iOS 18.1, or on an Android device.\nTo create a Genmoji character, tap into the Emoji keyboard and tap on the Emoji with a \"+\" button next to the search bar. From there, you can type in your idea.\nSiri ChatGPT Integration\nSiri ChatGPT integration lets Siri hand requests over to OpenAI's ChatGPT. ChatGPT is off by default, but you can turn it on in the Apple Intelligence and Siri section of the Settings app.\nIf ChatGPT integration is enabled, Siri will consult ChatGPT for complex requests. Complex requests might include creating an image, generating text from scratch, making recipe ideas based on what's in your refrigerator, describing what's in a photo, and more.\nSiri analyzes each request to see if it's something that needs to be answered by ChatGPT, but you can also automatically invoke ChatGPT for a request by using a request like \"Ask ChatGPT to give me a chocolate chip cookie recipe.\"\nSiri asks your permission before querying ChatGPT, but there is an option to turn off that extra permission step by toggling off \"Confirm ChatGPT Requests\" in the ChatGPT section of Settings.\nYou don't need an account to use ChatGPT, and it is free, but if you have a paid account, you can sign in. If you're not signed in, OpenAI does not store any of your ChatGPT requests, nor is your information used for training ChatGPT. If you sign in, ChatGPT can save a copy of your queries. Apple does not store ChatGPT queries.\nChatGPT can be used with Siri, but it is also integrated into Writing Tools and Visual Intelligence. With Writing Tools, ChatGPT can generate text, and with Visual Intelligence, ChatGPT can answer questions about what the Camera sees.\nVisual Intelligence\nVisual Intelligence is an iPhone 16 feature that uses the Camera Control button. If you long press it, you can get into Visual Intelligence mode, where the Camera app can be used to identify what's around you.\nIf you point the camera at a store, for example, you can see ratings, hours, and other information. If you take a photo of an object, you can get more information about the object from ChatGPT, or use it with Google Search to find similar images. The Google Search feature is a good way to search for products that you want to find.\nOther Visual Intelligence features include reading text out loud, detecting phone numbers and addresses to add them to the Contacts app, copying text, and summarizing long passages of text.\nApple Intelligence Features Coming Later\nAdditional Languages\nApple Intelligence currently supports localized English in Australia, Canada, New Zealand, South Africa, Ireland, and the UK in addition to U.S. English, but additional languages are coming in an update that's slated to be released in April. Languages that will be added include French, German, Italian, Portuguese, Spanish, Japanese, Korean, and simplified Chinese.\nPriority Notifications\nPriority notifications will show up at the top of your notification stack, so you can get to what's most important first.\nSiri\nSome initial Siri updates are available now such as Siri's new glow that encompasses the edges of the display and ChatGPT integration, but more Siri capabilities will be added in an update later in 2025. Apple is working on onscreen awareness, personal context, and the ability to take more actions in and across apps.\nOnscreen awareness will let Siri take actions when you ask something about what's on your display. If you're looking at a photo and want to message it to your friend Eric, you'll be able to tell Siri to \"Send this picture to Eric,\" and Siri will understand and do it.\nPersonal context will let Siri do more with your personal data like emails and messages. This is an on-device feature, and it will let Siri learn more about you, who you're communicating with, and how you use your device. Personal context will let you do things like ask Siri to find a specific message, or remind you when you took a photo that you're looking for.\nThe Siri option to take more actions in and across apps will drastically improve what Siri is capable of. You'll be able to move files from one app to another and control app functions with Siri that you never could before. It'll work in third-party apps as well as Apple's own apps.\nWhen to Expect More Apple Intelligence Features\nAdditional Apple Intelligence features are set to come in future updates. Apple originally planned to add new Siri capabilities to iOS 18.4, but the functionality is not ready to go so we will be waiting a bit longer. Apple will likely hold the new Siri features until iOS 18.5.\nApple Intelligence Device Requirements\nApple Intelligence requires a device with one of Apple's newest chips and 8GB RAM. Eligible models are listed below.\n- All iPhone 16 models\n- iPhone 15 Pro and iPhone 15 Pro Max\n- All Apple silicon iPads\n- A17 Pro iPad mini\n- All Apple silicon Macs\nApple Intelligence Settings\nIn the Privacy and Security section of the Settings app you can access an Apple Intelligence Report that lets you export your Apple Intelligence data as part of Apple's promise for transparency around Apple Intelligence. Biometric authentication is required to access and export Apple Intelligence data.\nYou can also disable Apple Intelligence by toggling off the setting under the Apple Intelligence and Siri section in the Settings app.\nApple Intelligence Availability\nApple Intelligence is only available in U.S. English at this time, along with localized English in Australia, Canada, New Zealand, South Africa, and the UK is supported in addition to U.S. English.\nApple plans to add support for additional languages later in 2025, like Chinese, English (India), English (Singapore), French, German, Italian, Japanese, Korean, Portuguese, Spanish, and Vietnamese. Apple Intelligence will launch on the iPhone and the iPad in the European Union in April 2025."
    },
    {
      "url": "https://www.macrumors.com/guide/facetime/",
      "text": "FaceTime is Apple's video and audio chatting platform that lets iPhone users communicate with one another through the standard FaceTime video protocol or using the FaceTime audio feature.\nAs a key iPhone, iPad, and Mac feature, FaceTime is widely known, but if you're new to FaceTime, this guide will walk you through everything you need to know. Even established FaceTime users may learn a trick or two.\nSetting Up FaceTime\nIf you have an iPhone, FaceTime, much like iMessage, is activated automatically using your phone number, but you can also choose to use it with an email address instead. Getting FaceTime up and running happens automatically after your iPhone is activated with a SIM card, but if for some reason it's not working or it's been turned off, you can follow the steps in the how to below.\nWhen you use an iPhone with FaceTime, your other devices can also use your phone number to place FaceTime calls so long as you are signed into the same iCloud account on all of them.\nIf you don't have an iPhone, FaceTime can be set up on an iPad, iPod touch, or Mac through the FaceTime app using an email address.\n- How to Set Up FaceTime on an iPhone\n- How to Set up FaceTime on an iPad\n- How to Set Up FaceTime on a Mac\n- How to Turn Off FaceTime\nThere is no option to entirely remove a phone number from FaceTime, though if you have an iPhone with dual-SIM capabilities, you can choose between two different numbers. You can choose to use an email address with FaceTime instead of a phone number, and there are also options to change the email address that you're using.\n- How to Use FaceTime With an Email Address Instead of a Phone Number\n- How to Change Your FaceTime Email Address\nFaceTime Video vs. FaceTime Audio\nThere are two ways to use FaceTime. You can use FaceTime video, which is the standard way to use FaceTime with a two-way video connection (or more, with Group FaceTime), or you can use FaceTime Audio, which, as the name suggests, is an audio-only option.\nFaceTime video is great for when you want to see the person on the other end of the call, while FaceTime Audio is basically akin to a voice-based phone call. FaceTime Audio often offers better call quality than a regular phone call because it's a VoIP service similar to something like Skype.\n- How to Make a FaceTime Call\n- How to Make a FaceTime Audio Call\n- How to Make a FaceTime Call With Siri\n- How to Switch From FaceTime Video to FaceTime Audio\n- How to Switch From FaceTime Audio to FaceTime Video\n- How to Switch from a Regular Phone Call to FaceTime\n- How to Mirror a FaceTime Call to Apple TV or an AirPlay 2-Compatible Smart TV\n- How to Record a FaceTime Call on Your Mac\nDevices Compatible With FaceTime\nFaceTime is an app that's available across Apple devices. FaceTime Video and FaceTime Audio work on the iPhone, iPod touch, iPad, and Mac.\nYou can answer and place FaceTime Audio calls on the HomePod and the Apple Watch, but video calls do not work on these devices.\nMaking a FaceTime Video Call\nMaking a FaceTime video call is as simple as opening up the FaceTime app on your iPhone, iPad, or Mac, tapping the \"New FaceTime\" button, choosing a contact, and tapping on the \"FaceTime\" option for video, or the little phone icon for audio.\nFaceTime can also be initiated through the Contacts app by selecting a contact and choosing the FaceTime option, or through the Messages app by tapping on a person's name in an iMessage thread and then choosing the FaceTime option. You can also set up Favorites through the Contacts app and make a FaceTime call through the Phone app (iPhone) or through the Favorites widget in the Today section of the Notification Center (iPhone and iPad).\nNote that you can choose from FaceTime Audio or Video in the FaceTime app, but initiating FaceTime through Contacts or Messages initiates a video call right away.\nWhen you initiate a FaceTime call with someone, the front-facing camera on your Mac, iPad, or iPhone will activate so that the person on the other end can see you. Unlike with a phone call, FaceTime calls often reach the other person near instantaneously.\nAnswering an incoming FaceTime video call will also activate the front-facing camera on your iPhone, iPad, or Mac because FaceTime is primarily a video chatting platform.\nMaking a FaceTime Audio Call\nIf you want to initiate a call with someone but want to use voice chat instead of video, you can use FaceTime Audio. Unlike a traditional phone call, FaceTime Audio can be placed on the iPhone, iPad, or Mac, and it uses either a WiFi or cellular connection.\nFaceTime Audio can be preferable to a standard phone call because it's often higher quality because it uses a higher-quality codec that exceeds even HD voice services offered by carriers.\nA FaceTime Audio call is easiest to place in the FaceTime app by choosing a person to contact and then tapping the phone icon instead of the FaceTime option. The other option for FaceTime Audio is using Favorites set up in the Phone app or the Favorites Widget in the Notification Center.\nYou can also activate FaceTime Audio in Messages by tapping on a contact and then choosing the \"Audio\" option, or in the Contacts app by tapping on the phone icon under the FaceTime heading. FaceTime Audio is the only version of FaceTime that works on the Apple Watch.\nFaceTime on Android and PCs\nAs of iOS 15, FaceTime can be used across different platforms. Apple created FaceTime links because there's a new option to join FaceTime calls on the web, which means PC and Android users can participate in FaceTime for the first time.\nAn iPhone, Mac, or iPad user needs to create a FaceTime link, but once created, anyone can tap it to join. To join from the web, Chrome or Edge browsers are required. FaceTime from the web works on-on-one or in Group FaceTime calls.\nCreate a FaceTime Link\nApple changed how FaceTime works in iOS 15, so you can create something more akin to a Zoom link, but for FaceTime. You can make a FaceTime link that other people can tap to join your FaceTime call.\nLinks let you schedule FaceTime calls in advance and then share the links with others so everyone can join the meeting or group chat at the appropriate time. FaceTime integrates directly with the Apple Calendar app.\nTo create a link, just open up the FaceTime app and then tap the \"Create Link\" option next to \"New FaceTime.\" You can share the link in a text message, another messaging service, an email, or AirDrop it, and people can click it to join in.\nUsing FaceTime Over WiFi\nFaceTime works best when using WiFi, because a video connection between two parties can be data heavy. You're going to get the clearest picture when using a high-speed WiFi or cellular connection.\nFaceTime will use WiFi by default when connected to a WiFi network on iPhone, iPad, or Mac.\nIf your connection speeds aren't high enough, video will look pixelated and when connection speeds are very slow, the video feed will cut off entirely. FaceTime Audio requires less data than standard FaceTime, but with very poor connectivity, it can fail or sound distorted.\nUsing FaceTime Over LTE/5G\nOn devices with an LTE connection like an iPhone or iPad (or a Mac connected to a hotspot), FaceTime works over cellular as well.\nMost cellular phone plans no longer have limited minutes, but FaceTime Audio and the standard FaceTime video do not use up cell phone minutes. It's worth noting that FaceTime does eat up data, and how much data it uses will vary by device, connection quality, and other factors.\nYou can see how much data you've used in a FaceTime call by opening up the FaceTime app and tapping on the \"i\" next to a person in your recent call list. More detailed instructions are below:\nFaceTiming With Multiple People Using Group FaceTime\nWith Group FaceTime, you can video (or audio) chat with up to 32 people at one time.\nGroup FaceTime presents all of the participants in a tiled view, with the size of each person's tile varying based on the number of participants in the chat. The tile size for the person speaking at the moment will get larger to provide attention to that person, but you can also use Focus View to double tap on any participant that you want to see in the chat.\nNew people can be added to an existing Group FaceTime chat at any time, so you can start up a chat with a group of friends and then add other people as time goes on. Group FaceTime calls send a ringless notification to participants that can be tapped to join.\nYou can also set up a Group FaceTime call through the Messages app by tapping on the FaceTime option in a group chat.\nGroup FaceTime calls can be answered on iPhone, iPad, Mac, Apple Watch, or HomePod, but with the latter two options, users can only join chats with audio and no video.\nGroup FaceTime is available on all devices where FaceTime is available, but on older Apple devices, Group FaceTime is available in an audio-only capacity. This includes the iPhone 5s, iPhone 6 and iPhone 6 Plus, iPad mini 2, iPad mini 3, and iPad Air.\nAutomatic Prominence in Group FaceTime\nApple in iOS 13.5 added a feature for Group FaceTime that lets you toggle off Automatic Prominence, aka the feature that makes people's tiles change size depending on who happens to be speaking.\nWith Automatic Prominence turned off, people's tiles won't get bigger when they speak, and will instead be displayed in a grid view with equal sizes. There's also an option to enable Automatic Prominence when someone who uses sign language is detected so you can see what's being signed.\n- How to Turn Off Moving Faces in Group FaceTime on Mac\n- How to Turn off Moving Faces in Group FaceTime\nFaceTime Compact UI\nAs of iOS and iPadOS 14, an incoming FaceTime call no longer takes over the entire display of the iPhone or the iPad, with the call instead showing up as a small banner.\nThe banner is interactive and can be tapped to accept or decline a FaceTime call, with more information available in our guide to the iOS 14 interface.\nPicture in Picture\nWith iOS 14, you can do other things on your iPhone while chatting with a FaceTime window open thanks to the new Picture in Picture mode that's available.\nSwiping out of FaceTime will now open up a Picture in Picture window that can be resized, so you can use apps without having FaceTime paused. More info on Picture in Picture and how to use it can be found in our Picture in Picture guide.\nEye Contact\nIf you enable the \"Eye Contact\" feature in FaceTime's settings, it tweaks the FaceTime video to make it look like you're making eye contact with the person you're talking to while you're looking at the iPhone or iPad's screen.\nUsing Memoji and Animoji When in FaceTime\nWhen using FaceTime for a video chat, you can choose to overlay an Animoji or Memoji character over your head, which is a fun way to chat with kids or to add a bit of whimsy to a conversation.\nYou can choose any of the emoji-like Animoji characters or any of the Memoji that you've created for use in the Messages app. Animoji and Memoji use the TrueDepth camera system to track your head and mouth movements for a very realistic interactive experience.\nBecause TrueDepth is required, this feature is limited to devices that have a TrueDepth camera and it will not work on older devices. Animoji and Memoji also only work on the iPhone and the iPad, with no Mac option available.\nAdding a Memoji or Animoji to cover your face in FaceTime is as simple as tapping on your picture when you're on a FaceTime call, then tapping the star icon, aka the \"Effects\" icon. From there, tap on the \"Memoji\" icon (face in a square) on the left side.\nUsing Effects in FaceTime\nAlong with Animoji and Memoji, you can apply filters, stickers, animated shapes, Memoji and Animoji stickers, and text to your FaceTime video to spice it up.\nThere are a range of filters to choose from, ranging from those that simply tweak colors to those that add effects like watercolor, comic book, aged film, ink, and more.\nAs for stickers, there are some animated shapes available by default along with Memoji and Amimoji stickers that are emoji-like still versions of Animoji/Memoji, plus you can use any sticker pack purchased from the App Store or made available through an app you already have installed.\nCapturing a Live Photo With FaceTime\nWhen using FaceTime for a video call, you can capture a Live Photo of a moment during a chat. All you need to do to take a Live Photo is to tap on the display to bring up the camera button and then tap the camera button.\nTapping on the camera button lets you know that you took a Live Photo, and it lets the person on the other end of the call know that you took a Live Photo. That prevents people from taking Live Photos of you during a chat without your knowledge.\nTo use this feature, the participants in the video call need to have Live Photos in FaceTime enabled, which can be found by opening up Settings, choosing FaceTime, and then toggling on FaceTime Live Photos.\nIf you disable this by toggling it off, no one will be able to take FaceTime Live Photos when chatting with you.\nUsing SharePlay\nSharePlay is a major FaceTime feature that was introduced in iOS 15, and it's basically a way for you to do more on FaceTime calls with your friends and family. You can watch TV together, listen to music, and share your screen. SharePlay is was introduced in iOS 15.1, iPadOS 15.1, tvOS 15.1, and macOS Monterey 12.1 after being delayed from the initial launch versions of the software.\nSharePlay makes the FaceTime experience a whole lot better because it can be used for screen sharing, watching movies and TV together, or listening to music with Apple Music. Third-party app developers can also build SharePlay into their apps, so there are a whole range of new FaceTime games and experiences.\n- iOS 15: How to Share Your Screen on a FaceTime Call\n- iOS 15: How to Watch Movies Together Using FaceTime\nFor a full rundown on SharePlay and other features introduced in the iOS 15 update, we have a dedicated guide.\nBlocking Unwanted FaceTime Calls\nIf you're getting unwanted FaceTime video and audio calls, there is an option to put a stop to them through the built-in blocking feature in the Contacts app. You can tap on the little \"i\" button next to name or number in the list of recent FaceTime calls in the FaceTime app or the Phone app to bring up a little contact card.\nThe contact card will have a \"Block this Caller\" option at the bottom, and if you tap it, that person will no longer be able to contact you.\n- How to Block Unwanted FaceTime Calls\n- How to Check the FaceTime Numbers you Have Blocked\n- How to Unblock People on FaceTime\nCountries Where FaceTime is Available\nFaceTime is available in almost all countries around the world, with the exception of the United Arab Emirates. To use FaceTime in Saudi Arabia, an iPhone or iPad must be running iOS 11.3 or later, and to use FaceTime in Pakistan, devices must run iOS 12.4 or later.\nDevices purchased in certain Middle Eastern countries will also block FaceTime if a SIM card from a non Middle Eastern country is inserted. FaceTime Audio is not available in China. All iPhones and iPads sold in China are limited to the standard FaceTime with video feature.\nNote that if you purchase an iPhone or iPad in China or the United Arab Emirates and then attempt to use it in another country, the FaceTime features listed above will be disabled. Purchasing an iPhone from China or the Middle East is not recommended unless you live in those places.\nGuide Feedback\nHave questions about FaceTime, know of something we left out, or want to offer feedback on this guide? Send us an email here."
    },
    {
      "url": "https://www.macrumors.com/guide/iphone/",
      "text": "In 2007, Apple launched the original iPhone, kickstarting the modern smartphone era which is now dominated by iPhone and Android devices. We've had 18 generations of iPhones so far, with the latest models, the iPhone 16, iPhone 16 Plus, iPhone 16 Pro and iPhone 16 Pro Max, introduced in September 2024, and the iPhone 16e released in February 2025. Apple follows an annual update cycle, introducing new flagship models while discounting prior-year models and selling them at more affordable price points.\niPhone vs Android\nOver the years, Android and iPhone smartphones have evolved to the point where feature-wise, they're similar in function and capability. Android smartphones are made by multiple manufacturers, but the core operating system is provided by Google, which leads to a wider variety of phones and price points to choose from, but weaker integration between software and hardware.\nApple's control of both the iPhone and the operating system (iOS) provides a more consistent experience along with ongoing support. With iOS 18, Apple supports all iPhones that were introduced in the last four years, so the majority of active iPhone owners can and do upgrade to the newest version of iOS that Apple rolls out each year.\nAndroid updates are often more inconsistent and often don't make it to all Android-based smartphones because each manufacturer has to implement support on an individual basis. So while Google also does yearly Android updates, the reality is that a lot of older Android smartphones don't get the new software.\nWith Apple's control and curation of the iPhone experience, the iPhone is largely considered to be the more secure platform, and Apple has made it a point to focus heavily on privacy. Apple's iOS is less customizable than Android, though, so for individuals who prefer flexibility and customization options, the Android operating system may be worth looking at.\nHow Do iPhone Updates Work?\nHere are the basics you should know about how Apple updates the iPhone and the iOS operating system.\nEach fall, typically in September, Apple releases a new series of flagship smartphones. These often come at high prices and feature the latest technologies, with Apple offering high-end models and still high-end but more affordable models. Prior-year iPhones often stick around with lower price points as cheaper alternatives to the latest and greatest technology, and occasionally, Apple launches a lower-cost iPhone outside of the normal fall timeline.\nAt the current time, Apple's iPhone lineup includes the iPhone 15 (2023), iPhone 15 Plus (2023), iPhone 16 (2024), iPhone 16 Plus (2024), iPhone 16 Pro (2024), iPhone 16 Pro Max (2024), and iPhone 16e (2025).\nApple also debuts an updated version of iOS at the same time that new iPhones launch, but new versions of iOS are pre-introduced every year at Apple's annual Worldwide Developers Conference to give developers time to incorporate new features and technologies into their apps ahead of when the software becomes available to the public. The current iPhones run iOS 18.\nIn this guide, we go over all of the iPhones that are in the current Apple lineup, offer up some buying suggestions, and provide tips and resources for both new and existing iPhone owners.\niPhone 16 Pro and iPhone 16 Pro Max ($999+)\nThe iPhone 16 Pro and iPhone 16 Pro Max are Apple's current high-end flagship devices with all of the top-of-the-line features and the most bells and whistles. The Pro models are for those who want to get the most out of their iPhones with the latest feature set.\nPricing on the iPhone 16 Pro starts at $999, while pricing on the iPhone 16 Pro Max starts at $1,199. The two iPhones are nearly identical when it comes to feature set, and it's only display size and battery capacity that set the two devices apart.\nApple introduced larger screen sizes and slimmed down bezels for the Pro lineup in 2024, so the iPhone 16 Pro Max has a larger 6.9-inch display (up from 6.7 inches), and the iPhone 16 Pro has a 6.3 inch display (up from 6.1 inches). Both models feature the same design with a glass front and back, a lightweight but durable titanium frame, and squircle edges. Colors this year include natural titanium, white titanium, black titanium, and desert titanium, which is a shade of gold.\nThe iPhone 16 Pro and Pro Max feature edge-to-edge OLED displays with the slimmest bezels we've seen in an iPhone to date. There's a second-generation \"Ceramic Shield\" that offers superior scratch resistance, and a pill-shaped Dynamic Island continues to house the front-facing camera and hardware used for Face ID authentication.\nThe customizable Action button is still available, and it now does more thanks to Control Center integration. This year, Apple also added a Camera Control button that can be used to activate the camera with a press. Camera Control makes it quicker to capture photos and videos, and it is also pressure and touch sensitive so you can change controls and adjust settings without touching the screen.\nThe Dynamic Island has been incorporated into the iPhone's interface and it is able to show various notifications and app information for phone calls, timers, Face ID, Bluetooth connections, and more.\nApple added a new A18 Pro chip to the iPhone 16 Pro and Pro Max, with a 6-core CPU, a 6-core GPU, and a 16-core Neural Engine. It is up to 20 percent faster than the A17 Pro from the iPhone 15 Pro models, and it is the fastest iPhone for Apple Intelligence.\nThere continues to be a three-lens camera setup with a 48-megapixel Main camera that offers improved low-light performance, a 12-megapixel 5x Telephoto lens, and a new 48-megapixel Ultra Wide camera. The 5x Telephoto is available for both Pro models, which is new this year, and the 48-megapixel Ultra Wide camera takes improved wide-angle and macro shots when lighting is poor.\nCrash Detection is able to determine if you've been in a serious car accident, alerting emergency services, and there's also an Emergency SOS via satellite feature for getting help if you're out of range of Wi-Fi and cellular. With iOS 18, the satellite connectivity can be used to send messages too.\nBoth iPhone 16 Pro models offer improvements to battery life, and they have a USB-C port and support for up to 25W MagSafe charging.\nOther features include IP68 water resistance, 8GB RAM, ProMotion 120Hz refresh rate for the display, faster 5G, a second-generation Ultra Wideband chip, faster USB-C charging, and Wi-Fi 7.\nKey Features:\n- Highest end, highest price\n- Triple-lens camera: Main (Wide), Ultra Wide, and Telephoto (5x for the Max)\n- 48-megapixel Main lens with ProRAW support\n- 48-megapixel Ultra Wide lens with macro capability\n- Camera Control button\n- A18 Pro chip\n- Action button\n- Always-On Display\n- Titanium frame\nBottom Line: The iPhone 16 Pro and iPhone 16 Pro Max are the iPhones to choose if you want the absolute best camera capabilities that you can get in an iPhone, with the Pro Max being the top-of-the-line model due to its increased display size, and longer battery life. In terms of performance, there isn't much of a difference between the iPhone 16 Pro models and the standard iPhone 16 models, with screen size, display quality, and chassis material differentiating the two iPhone lines.\niPhone 16 and iPhone 16 Plus ($799+)\nSold alongside the iPhone 16 Pro and iPhone 16 Pro Max, the iPhone 16 and iPhone 16 Plus are Apple's more affordable flagship devices. The iPhone 16 and 16 Plus feature many of the same capabilities as the Pro models, but they are missing some of the higher-end features to keep the price lower. The 6.1-inch iPhone 16 is priced starting at $799, while the 6.7-inch iPhone 16 Plus is priced starting at $899.\nDespite the difference in screen size, the iPhone 16 and 16 Plus are essentially identical, featuring a flat-edged design with a glass body and an aluminum frame. They do not offer ProMotion display technology and thus do not support an always-on display, but they do have the same Dynamic Island, front-facing camera, and Face ID authentication functionality.\nApple brought the Action button to the iPhone 16 lineup this year, so that is no longer a Pro-only feature. The Action button replaces the Ring/Silent switch, and it is customizable, so you can set it to bring up whatever is most convenient for you. It can mute/unmute your iPhone, activate the flashlight, open a favorite app, activate a Control Center control, turn on a Focus mode, and more.\nLike the iPhone 16 Pro models, the iPhone 16 and iPhone 16 Plus have a new Camera Control button below the power button. Pressing the button activates the camera, and a double press snaps a photo, so it makes it much quicker to get the shot that you want. The button is capacitive and pressure sensitive, so it can be used for changing various camera settings and swapping between tools. It works much like a DSLR shutter for autofocus with a half press, and you can adjust exposure, style, zoom, aperture, and more without ever touching the iPhone's display.\nWhile the iPhone 16 Pro models have an A18 Pro chip, the iPhone 16 models have an almost-as-capable A18 chip that also works with Apple Intelligence. The A18 has the same 6-core CPU and 16-core Neural Engine, but it has a 5-core GPU instead of a 6-core GPU. The chip is built using the same 3-nanometer technology, and it enables support for ray tracing and console-quality games, a feature that was previously limited to the Pro models. Battery life has improved compared to the prior iPhone 15 models thanks to the new chip technology.\nThere is a dual camera system that features 12-megapixel Ultra Wide and 48-megapixel Fusion (Wide) lenses with no Telephoto lens. The primary camera can be cropped in to a 2x zoom, so 0.5, 1x, and 2x options are supported. Some of the same photography and videography capabilities that are in the Pro models are also in the standard iPhone 16 models, including the new Photographic Styles for customizing your images and Audio Mix for adjusting the sound in your videos, plus support for shooting spatial videos and images.\nCapturing video in 4K at 120 frames per second is a Pro-only feature, as is support for shooting in ProRAW and ProRes, so if those are capabilities you need, you'll want to look at the Pro models.\nThe iPhone 16 models have support for mmWave (U.S. only) and Sub-6GHz 5G, and they also have a USB-C port and offer MagSafe charging at up to 25W, a new, faster speed this year. Crash Detection, Emergency SOS via satellite, and Messages via satellite are available as well. Compared to the Pro models, the standard models lack the titanium chassis, the Telephoto camera lens, and the A18 Pro chip.\nKey Features:\n- Dual-lens camera: Fusion (Wide), Ultra Wide\n- Crash Detection\n- USB-C port\n- Action button\n- Camera Control\n- A18 chip\nBottom Line: The iPhone 16 and 16 Plus offer many of the same features as the iPhone 16 Pro and 16 Pro Max at a more affordable price, and these are the iPhones that we recommend for most people. The differences are limited primarily to the camera and the display, and may not be of interest for those who are not heavily invested in iPhone photography, making the $200+ savings worth it for most. Older iPhones are another option to save money, but be aware that only the four iPhone 16 models and the prior-generation iPhone 15 Pro and Pro Max support Apple Intelligence.\niPhone 16e ($599+)\nPriced starting at $599, the iPhone 16e is similar in design to the iPhone 16, but it is actually modeled after the iPhone 14. It has an all-display design with Face ID, but it has an older-style notch rather than a Dynamic Island.\nThe iPhone 16e has a 6.1-inch OLED display like the iPhone 16, and it has the same 8GB RAM and A18 chip that supports Apple Intelligence, though there is one less GPU core. It is the first iPhone with Apple's new C1 modem, which is more efficient than Qualcomm's comparable X71 modem in the iPhone 16. While there is no mmWave 5G support, there seems to be no compromise to the more widespread sub-6GHz Wi-Fi speeds.\nThere is a single-lens rear camera in the iPhone 16e, and it is the same as the 48-megapixel Wide camera in the iPhone 16. It can take 1x and 2x photos, but there is no 0.5x option and no 5x zoom as there is in the iPhone 16 Pro models.\nThe iPhone 16e has the longest battery life of any 6.1-inch iPhone, and the battery lasts for up to 26 hours when watching video. It charges via USB-C, but it does not support MagSafe and wireless charging is limited to 7.5W. Not being able to use MagSafe is one of the main downsides to the iPhone 16e.\nIt is also worth noting that there is no Ultra Wideband chip for Precision Finding in the Find My app, and it is limited to Wi-Fi 6, so it will not connect to the 6GHz networks available with Wi-Fi 6E and Wi-Fi 7 routers.\nOther features include Crash Detection, Emergency SOS via Satellite, and Messages via Satellite, but these are also features available with other iPhone 16 models.\nKey Features:\n- Face ID\n- A18 chip\n- Lower price\nBottom Line: The iPhone 16e is now Apple's lowest-price iPhone, and it is worthwhile if you can live without a dual-lens camera system, faster Wi-Fi connectivity, and MagSafe. It has many of the same features as the iPhone 16 at a $200 lower price point.\niPhone 15 and iPhone 15 Plus ($699+)\nThe iPhone 15 and iPhone 15 Plus are Apple's prior-generation flagship devices that are now being sold at a discount. They have older technology and are lacking some of the new features that Apple introduced with the iPhone 16 models, including the Camera Control button, the faster A-series chip, the Action button, and, most importantly, support for Apple Intelligence. The iPhone 15 and iPhone 15 Plus cannot run the new Apple Intelligence features in iOS 18, so only consider Apple's prior-generation iPhones if that is not important to you.\nThe iPhone 15 models don't look notably different from the iPhone 16 models, except for the color options. Apple did not make major design changes, but the iPhone 15 models do not have a Camera Control button and they have a Ring/Silent switch instead of an Action button. There's also a diagonal rear camera setup that does not offer some of the newer camera capabilities like Photographic Styles for customizing the look of your images or Audio Mix for tweaking the sound in your videos.\nWhile the iPhone 15 and 15 Plus don't support some of the newer software-based camera features, the hardware is largely the same. There's a Main (Wide) lens that supports 1x and 2x zoom, and an Ultra Wide lens. There is no dedicated Telephoto lens.\nThe iPhone 15 measures in at 6.1 inches, while the iPhone 15 Plus is 6.7 inches. The two devices are essentially identical, with a Dynamic Island for Face ID, aluminum frames, and OLED screen technology. The iPhone 15 and iPhone 15 Plus have an older A16 chip that is two generations behind the newer chips in the current flagship models.\nThe iPhone 15 models have support for mmWave (U.S. only) and Sub-6GHz 5G and use the X70 Qualcomm chip, one generation behind the Qualcomm chip in the new iPhones. Battery life is a little shorter, but the iPhone 15 models do support MagSafe and USB-C. There is no support for the faster 25W MagSafe charging, though, with the iPhone 15 models limited to 15W MagSafe charging.\nBetween the iPhone 15 and 15 Plus, the features are identical with the exception of screen size and battery, as the iPhone 15 Plus can accommodate a larger battery size.\nKey Features:\n- Diagonal dual-lens camera: Main (Wide), Ultra Wide\n- Crash Detection\n- USB-C port\n- Dynamic Island\n- 5G support\n- A16 chip\nBottom Line: The iPhone 15 and 15 Plus are solid devices that will perform well at an affordable price, but keep in mind that the iPhone 16 is such a notable upgrade that it may be worth paying $100 more for the iPhone 16 this year. The iPhone 15 models do not have an Action button or a Camera Control button, and they cannot run the Apple Intelligence features in iOS 18, so you'd be missing out on the more capable Siri, customizable emoji, Writing Tools, and other Apple Intelligence functions. A prior-generation iPhone is usually a good way to save money, but this year, we don't recommend it.\nFrequently Asked Questions\nThere's no one single iPhone that's best for everyone, and picking the right smartphone needs to take into account factors like budget, desired battery life, preferred feature set, and more.\nIf you want the absolute best photographic capabilities for example, you're going to want the iPhone 16 Pro or iPhone 16 Pro Max, and if you want something that has a solid feature set at a great price, the iPhone 16e is what you'll want to look at.\nBelow, we've outlined some of the best iPhone choices based on different scenarios or features that you might be looking for.\nWhich iPhone Has the Best Battery Life?\nWith the efficient A18 Pro chip, the iPhone 16 Pro Max has the longest battery life for any iPhone to date at up to 33 hours when watching videos. The iPhone 16 Pro and iPhone 16 Plus are second and will last up to 27 hours when watching videos. The iPhone 16e lasts for up to 26 hours when watching videos, and it is the smallest of the bunch at 6.1 inches.\nWhich iPhone Has the Best Camera?\nWith their updated triple-lens camera systems, 48-megapixel Fusion lens, 5x Telephoto lens, 48-megapixel Ultra Wide lens, and LiDAR Scanners, the iPhone 16 Pro and iPhone 16 Pro Max have the best iPhone cameras that you can get. Both of the new iPhones include a three-lens camera system with the same feature set. This year, the Ultra Wide lens has been upgraded to 48 megapixels, allowing for more detailed wide-angle and macro shots.\nThe Fusion lens supports 24-megapixel and 48-megapixel high-resolution photos through the Photonic Engine, and the Ultra Wide lens supports 12-megapixel images that have the detail from the combined pixels of the 48-megapixel resolution. Using computational photography, the Fusion camera can be set to 24mm, 28mm, and 35mm focal lengths to better mirror what's possible with DSLRs.\nAll four iPhone 16 models have a new Camera Control button that makes it easier to capture a photo or a video with just a couple of button presses, and the Camera Control button is also capacitive and pressure sensitive so it can be used for changing photography modes and adjusting settings, which makes your iPhone feel more like a camera.\nWhich iPhone Has Touch ID?\nUnfortunately, none of Apple's iPhones have Touch ID. It has been phased out, and Face ID is the only option.\nWhich iPhone is Best For One-Handed Use?\nThe iPhone 16 and the iPhone 16e both measure in at 6.1 inches, and they are the smallest iPhones that Apple makes. They won't work for one-handed use for everyone, but they are a better option than the 16 Plus and 16 Pro Max.\nWhich iPhone is the Best Value?\nWith Apple Intelligence support, a 48-megapixel camera, OLED display, and 5G connectivity for $599, the iPhone 16e is the best deal that Apple offers. If you need faster mmWave 5G speeds, Wi-Fi 7 connectivity, MagSafe, and an Ultra Wide camera, the $799 iPhone 16 is the upgrade option.\nIf you don't need the latest bells and whistles like Apple Intelligence and don't mind losing out on a bit of performance and battery life, the iPhone 15 and 15 Plus, which are $100 cheaper than than their iPhone 16 counterparts, could be worth considering.\nFor many people, the iPhone 16 and iPhone 16e are the iPhones to get this year with their lower price point and modern feature set.\nWhich iPhone Has the Most Features?\nIf you want the iPhone with the most bells and whistles, that's the iPhone 16 Pro and iPhone 16 Pro Max. These iPhones offer OLED displays, triple-lens cameras, glass bodies with titanium steel frames, larger maximum storage capacities, and longer battery life.\nCompared to the iPhone 16 models, the iPhone 16 Pro and Pro Max have better camera capabilities. The absolute best would be the iPhone 16 Pro Max because of its larger display and bigger battery.\nIn More Detail\nStill not sure? We have deeper dives comparing the iPhone 16 models to each other and to the prior-generation iPhone models, and the standard iPhone 16 to the Pro.\n- iPhone 16 vs. iPhone 16 Pro Buyer's Guide: All Differences Compared\n- iPhone 15 vs. iPhone 16 Buyer's Guide: 30+ Upgrades Compared\n- iPhone 15 Pro vs. iPhone 16 Pro Buyer's Guide: 45+ Upgrades Compared\n- iPhone 15 vs. iPhone 16e Buyer's Guide: 25+ Differences Compared\n- iPhone 16e vs. iPhone 16 Buyer's Guide: 25+ Differences Compared\nFor full details on each phone, explore our roundups:\nUpcoming iPhone Rumors\nApple is working on new iPhone 17 models that will come out in the fall of 2025. This lineup will do away with the \"Plus\" iPhone, with Apple instead planning to release an \"Air\" or \"Slim\" model that is thinner and more expensive. It will be sold alongside the standard iPhone 17, the iPhone 17 Pro, and the iPhone 17 Pro Max. For more information, check out our roundups:\nGuide Feedback\nHave questions about choosing an iPhone, notice something we left out, or want to offer feedback on this guide? Send us an email here."
    },
    {
      "url": "https://www.macrumors.com/2025/03/13/airpods-live-translation-ios-19/",
      "text": "AirPods Getting Live Translation Feature Later This Year\nApple is working on a feature that will let the AirPods translate in-person conversations from one language to another, reports Bloomberg. The functionality will be linked to iOS 19, and it will be introduced in an AirPods software update planned for later this year.\nThe AirPods will be able to provide a simpler translation process for people who are speaking different languages, though the process will rely on the Translate app on the iPhone.\nIf an English speaker with AirPods is talking to someone who is speaking Spanish, the iPhone will detect the audio, translate the speech, and relay it back in English to the person wearing AirPods. The person speaking English will then be able to respond and have their response translated to Spanish and spoken aloud by the iPhone. Apple's iPhone Translate app can already be used for conversations like this, but having the function included in the AirPods will streamline the exchange.\nTo go along with the new AirPods feature, Apple is also planning to improve the Translate app in iOS 19, though no details are available at this time. While Apple is working on new AirPods Pro 3 earbuds that are set to launch in 2025, it sounds like Apple might bring the iOS 19 Translate feature to existing models as well.\nApple has been tying AirPods updates to iOS updates in recent years. In iOS 18, for example, Apple added a suite of hearing health capabilities that test for hearing issues and allow the AirPods to be used as a hearing aid if problems are detected.\nPopular Stories\nWith iOS 26, Apple is bringing several new features to the AirPods, making them more useful than before. The added functionality will be available this fall when Apple releases iOS 26 and updated AirPods firmware, but you can test everything new right now.\nCamera Remote\nThe AirPods can be used as a camera remote for the Camera app or third-party iOS camera apps. You'll need to enable the...\nThe iPhone 17 series is now just weeks away. Apple's iPhone 17 event this year is rumored to be scheduled for Tuesday, September 9. If Apple follows the traditional pattern, iPhone 17 pre-orders would begin on the Friday, September 12. The new devices would then likely reach customers and retail stores the following Friday, September 19.\nIf you're in the market for a new iPhone this year, or ...\nThere's just about a month to go until Apple unveils the Apple Watch Series 11 models at its September event. Last year we got display upgrades, and this year, there could be new health features. We've recapped all of the current Apple Watch Series 11 rumors for a quick preview of what might be coming.\nFaster Chip\nApple is likely planning to introduce an updated S11 chip that offers a more...\nAs previously announced, this Saturday will be the final day of business for Apple Bristol in Bristol, England and Apple Parkland in Dalian, China.\nThe relocated Apple Touchwood Centre near Birmingham\nBoth of the stores will be permanently closing tomorrow, for landlord-related reasons. Apple Bristol is closing due to the landlord's redevelopment plans at the Cabot Circus Shopping Centre, and ...\nThe calendar has turned to August, and that means the iPhone 17 series is just one month away. Apple has yet to officially announce an event, but it has been rumored that the devices will be announced on Tuesday, September 9.\nSubscribe to the MacRumors YouTube channel for more videos.\nBelow is the August 2025 edition of our iPhone 17 Pro rumor recap, for an up-to-date overview of what to...\nApple's rumored new more affordable MacBook could have a starting price as low as $599 and launch as soon as this year, according to a new report out of Asia.\nWe first learned of Apple's low-cost MacBook plans in late June, when analyst Ming-Chi Kuo said the company was developing a \"more affordable\" 13-inch laptop that would compete with Chromebooks and drive MacBook purchases, though he...\nDespite being over two years old, Apple's AirPods Pro 2 still dominate the premium wireless‑earbud space, thanks to a potent mix of top‑tier audio, class‑leading noise cancellation, and Apple's habit of delivering major new features through software updates. Rumors suggest AirPods Pro 3 could arrive as soon as September 2025 alongside the iPhone 17 lineup, giving prospective AirPods...\nWhile the iPhone 18 Pro and iPhone 18 Pro Max are still a year away, there are already several early rumors about the devices.\nBelow, we recap some key iPhone 18 Pro rumors.\nUnder-Screen Face ID\nIn April 2023, display industry analyst Ross Young shared a roadmap showing that iPhone 17 Pro models would feature under-display Face ID. In May 2024, however, Young said he heard this change..."
    },
    {
      "url": "https://www.macrumors.com/roundup/airpods/",
      "text": "AirPods 4\nApple's fourth-generation AirPods, now with optional active noise cancellation.\nShould You Buy AirPods 4?\nThe AirPods 4 are Apple's latest flagship wireless earbuds, featuring an updated design, more comfortable fit, force sensors, Adaptive EQ, spatial audio with dynamic head tracking, Active Noise Cancellation for the higher-end model, and more. Introduced in September 2024, the AirPods 4 are early in their product cycle, which means now is a good time to buy. Apple does not typically refresh the AirPods annually, and often waits several years before updating.\nThe AirPods 4 and AirPods 4 with Active Noise Cancellation have the same design, but the version without ANC is priced at $129 and the version with ANC is priced $50 higher at $179. The higher price tag also includes a MagSafe Charging Case with Find My integration, but otherwise, the feature set is the same.\n$129 is a competitive price for earbuds, and $179 is the same price as the prior-generation AirPods 3. It is worth noting that the H2 chip inside the AirPods 4 provides a seamless and fully integrated pairing and device-switching experience for iPhone, iPad, Mac, and Apple TV users, which more affordable headphones from competing companies are unable to match. The H2 chip also enables features like Adaptive EQ and spatial audio with dynamic head tracking. This means that when used with Apple devices, AirPods seem to be the best option for earbuds when it comes to features.\nIf you are looking for AirPods with more to offer like in-ear silicone tips and better Active Noise Cancellation, there are the AirPods Pro which start at $249. For an even higher fidelity AirPods experience and an over-ear design, there are the AirPods Max which start at $549.\n- AirPods 4 vs. AirPods 4 With ANC Buyer's Guide: Which Should You Choose?\n- AirPods 4 With ANC vs. AirPods Pro 2\n- AirPods 4 vs. Previous Generations Buyer's Guide: All Upgrades Compared\nTo get MacRumors readers the best prices on the AirPods, we have a dedicated AirPods deals guide that highlights the best sales each month.\nThe 2024 AirPods 4\nContents\nApple overhauled its AirPods lineup in 2024, introducing the AirPods 4. There are two AirPods 4 models: the standard AirPods 4 and the AirPods 4 with Active Noise Cancellation.\nBoth models have the same design and are identical except for the ANC, though there are a couple of differences with the function of the charging case. Apple revamped the AirPods 4 entirely, introducing a design that is reminiscent of the AirPods Pro with shorter stems, though there are no silicone ear tips.\nAccording to Apple, the AirPods 4 \"set a new benchmark for fit and comfort\" and are the most advanced and comfortable headphones the company has made with an open-ear design. Apple scanned and mapped thousands of ear shapes and used over 50 million data points with 3D photogrammetry and laser topography to create a single shape that naturally fits most users. Apple says that the refined contour offers a natural and secure fit for more people than ever. There is a built-in vent system for pressure equalization.\nThe AirPods 4 have a new acoustic architecture for a massive improvement in sound quality. There's a low-distortion driver and high dynamic range amplifier, plus Personalized Spatial Audio with dynamic head tracking allows for an immersive media experience. Adaptive EQ tunes music to the user's ears with inward-facing microphones that detect the audio and then adjust low and midrange frequencies to provide rich detail in each song.\nApple used the same H2 chip that's in the AirPods Pro 2 for the AirPods 4. It enables features like Voice Isolation for clearer call quality and Siri Interactions in iOS 18 so you can shake your head no or nod your head yes to respond to Siri announcements. The AirPods 4 are also ideal for gaming, providing low wireless audio latency and good voice quality when chatting with other players.\nThe stem is equipped with a new force sensor that can be used to play or pause media and mute or end calls with a press, plus previous controls for skipping songs and activating Siri are available. An optical in-ear sensor and motion-detecting accelerometer pause music when the AirPods are removed from the ears.\nThe H2 chip, advanced computational audio, and upgraded microphones made the ANC version of the AirPods 4 possible. The AirPods 4 with ANC can reduce environmental noise like airplane engines and city traffic. Transparency Mode is available to keep users aware of their environment, and Adaptive Audio blends Transparency Mode and ANC intelligently based on the user's environment. Conversation Awareness lowers the volume automatically when the user is speaking to someone nearby.\nThe ANC in the AirPods 4 is not as good as the AirPods Pro 2 ANC because of the open-ear design. The AirPods Pro 2 have silicone tips that fit into the ears to shut out outside sound, while the AirPods 4 do not.\nThe AirPods 4 have IP54 dust, sweat, and water resistance so they can hold up to intense workouts and rain.\nApple made the Charging Case over 10 percent smaller in volume than the AirPods 3 case, so it's slimmer and more portable. The case and AirPods add up to a total of 30 hours of battery life without ANC, or 20 hours of battery life with ANC turned on. Talk time is up to 20 hours.\nThe AirPods themselves offer up to five hours of battery life on a single charge without ANC, or four hours with ANC. Five minutes in the charging case provides around one hour of listening time.\nFor both models, the Charging Case has a USB-C port for charging with a USB-C cable (that is not included), but the ANC version of the AirPods 4 case also supports wireless charging with MagSafe chargers, Apple Watch chargers, and Qi and Qi2 chargers. Apple says it is the smallest charging case in the industry that supports wireless charging capabilities.\nThe ANC AirPods 4 Charging Case also has a built-in speaker and support for Find My for keeping track of the AirPods and the case. Both models support Bluetooth 5.3 technology.\nThe AirPods 4 support all of the same \"magic\" setup and use features like one-touch pairing, quick device switching, and support for audio sharing.\nNote: See an error in this roundup or want to offer feedback? Send us an email here.\nHow to Buy\nThe standard AirPods 4 are priced at $129, while the version with ANC and wireless Charging Case is priced at $179.\nThe AirPods 4 launched on Friday, September 20, 2024, and can be ordered from the online Apple Store.\nReviews\nThe AirPods 4 reviews have been largely positive, with the standout feature being the optional Active Noise Cancellation (ANC) available for an extra $50. Reviewers note that ANC is a significant upgrade, bringing it closer to the level of the AirPods Pro. With the added bonus of improved Transparency Mode and Adaptive Audio, which adjusts sound based on surroundings, the AirPods 4 deliver a more immersive audio experience than previous generations.\nSound quality is another area where the AirPods 4 shine, with richer bass and clearer highs. The slightly longer battery life and improved fit have been praised, although some users may not find enough reasons to upgrade if they already own AirPods 3 or Pro models. For users of earlier models like the AirPods 2, however, the differences with ANC, fit, and sound performance are substantial.\nRead our AirPods 4 review roundup for more information.\nDesign\nWith the AirPods 4, Apple introduced a new design that's more like the AirPods Pro with a shorter stem and a new, more contoured earpiece. Apple says the AirPods 4 are the best headphones it has made with an open-ear design, setting a \"new benchmark for fit and comfort.\"\nThe updated design was built using advanced modeling tools and real ears. Apple used 3D photogrammetry and laser topography to map and analyze thousands of ear shapes, and it used more than 50 million individual data points in total. As a result, Apple believes the AirPods 4 can fit even more users, with one shape that's super comfortable.\nApple designed the AirPods 4 to be lightweight and to sit at an ideal angle in the ear for comfort and the best possible audio experience. Unlike the AirPods Pro, the AirPods 4 do not have silicone tips and are instead tipless with an open-ear design.\nApple says that the new shape provides a more natural and secure fit to keep the AirPods in the ears.\nThe short stem of the AirPods 4 gives them a subtle look in the ear, similar to the AirPods Pro. A mesh material covers the earpiece, and there's a mesh-covered vent at the back for breathability.\nAs with prior AirPods, the new model is made from a white plastic material with a small bit of silver at the base, along with L and R labeling.\nThe AirPods 4 measure in at 1.19 inches tall (0.2 inches smaller than the prior model), 0.72 inches wide (no change), and 0.71 inches deep (no change). They weigh 4.3 grams, which is essentially unchanged from the prior model.\nStem Gestures\nThe AirPods 4 have a force sensor in the stem that supports multiple gestures.\n- Single press - Play or pause media, answer a call, or mute or unmute.\n- Double press - Skip forward in a playlist or album or end a call.\n- Triple press - Skip back.\n- Press and hold - Activate Siri.\nWater Resistance\nThe AirPods 4 have an IP54 water resistance rating and are able to hold up to dust, sweat, and rain, but they should not be submerged or subjected to heavy amounts of liquid. The Charging Case has the same IP54 water resistance rating.\nApple's warranty does not cover liquid damage, so it's always best to use caution around water and other substances.\nH2 Chip\nThe AirPods 4 are equipped with the same H2 chip that Apple added in the AirPods Pro 2, and it powers all of the available features, including ANC in the more expensive model.\nThe H2 chip also enables the features AirPods have come to be known for, including fast switching between Apple devices that are signed into the same iCloud account, \"Hey Siri\" support, instant pairing, and Audio Sharing, which allows more than one set of AirPods to be paired to a single device.\nAudio\nApple created a new acoustic architecture for the AirPods 4 with a low-distortion driver powered by a custom high dynamic range amplifier. Apple says the AirPods 4 deliver exceptional audio with deeper bass and crystal-clear highs compared to the prior model.\nAdaptive EQ tunes music to your ears, using the inward-facing microphones to detect what you're hearing, then adjusting the low and midrange frequencies to provide rich detail in every song.\nSound Quality\nAccording to Apple, the AirPods 4 bring a massive improvement in sound quality compared to the prior-generation AirPods 3.\nWith low wireless audio latency and high-quality voice features, the AirPods 4 are ideal for gaming.\nCall Quality\nDual beamforming mesh-covered microphones cut down on the sound of the wind and ambient noise to ensure your voice sounds clear to the person on the other end of the call, and support for AAC-ELD offers full HD voice quality for FaceTime calls.\nThe AirPods 4 support Voice Isolation for minimizing background noise while clarifying the sound of your voice, making you easier to understand even when you're speaking in loud or windy conditions.\nPersonalized Spatial Audio\nThe AirPods 4 support personalized spatial audio featuring Dolby Atmos. Apple Music songs, TV shows, and movies can take advantage of spatial audio and it sounds like the audio is coming from all around you when the feature is enabled for an immersive, theater-like experience.\nDynamic head tracking is also available, which makes music, TV, and even Group FaceTime calls more engaging. Spatial audio algorithms and directional audio filters adjust the frequencies that each ear receives, allowing AirPods to produce sound all around the user.\nSpatial audio works with Apple Music and the Apple TV app, but it is also compatible with many third-party apps.\nActive Noise Cancellation\nOne of the two AirPods 4 models includes support for Active Noise Cancellation, and it is the first time that Apple has put it in headphones with an open-ear design. ANC is powered by the H2 chip and the upgraded microphones that are in the AirPods 4.\nWith ANC, the AirPods 4 can cut down on the noise of airplane engines, HVAC systems, city traffic, and more.\nThe ANC is not as good as the ANC in the AirPods Pro 2 because the AirPods Pro have silicone tips to shut out surrounding sound. All of the ANC features are included.\n- Transparency mode - Uses the microphones to relay sounds from the environment around you, so you can stay connected while on a call or listening to music.\n- Adaptive Audio - Blends Transparency and Active Noise Cancellation in real time, tailoring noise control to your environment as it changes.\n- Conversation Awareness - Senses when you're speaking to someone nearby and lowers the volume of what's playing. When you're done speaking, the volume increases.\nAirPods 4 Hardware\nBluetooth\nThe AirPods 4 support the latest Bluetooth 5.3 specification. Bluetooth 5.3 includes enhancements that can improve reliability and energy efficiency.\nSensors\nThere's a motion-detecting accelerometer and a speech detecting accelerometer in the AirPods 4 in addition to an optical in-ear sensor. All of these sensors work together to power AirPods features like ear detection.\nThe optical in-ear sensor is designed to determine whether the AirPods are in the ear versus in a pocket or on a table, with playback pausing when the AirPods are removed from the ear.\nCharging Case\nIn addition to redesigning the AirPods 4, Apple also updated the Charging Case. It's smaller than before, with a 10 percent volume reduction. The case is 1.97 inches wide, 1.82 inches tall, and 0.83 inches deep. The standard model weighs 1.14 ounces, while the ANC version weighs 1.22 ounces.\nApple removed the Setup button from the AirPods 4 case, and instead, there is a hidden capacitive button at the front that can be used for pairing the AirPods 4 and resetting them. The light on the case is also under the plastic and it does not show up unless the case is opened or the AirPods are charging.\nBoth AirPods fit snugly in the case, and an LED on the front lets you know when they're charging. If the light is orange, charging is ongoing, but if it is green, they're fully charged.\nWhen the AirPods are inside the case, the magnetic lid shuts, keeping them in place when the case is in a pocket or a bag. Opening the lid causes the AirPods to connect to an Apple device or initiate pairing.\nThere are two versions of the Charging Case, one for the entry-level AirPods 4 and one for the AirPods 4 with ANC. Both cases have a USB-C port for charging.\nThe case for the more expensive ANC AirPods 4 can charge wirelessly using a MagSafe charger, Qi/Qi2 charger, or an Apple Watch Charger. The ANC AirPods 4 case also has a built-in speaker so it can play a sound to make it easier to find with the Find My app.\nBattery Life\nWithout ANC, the AirPods 4 last for up to five hours on a single charge, or four hours with ANC enabled. One charge provides up to 4.5 hours of talk time.\nThe Charging Case brings total battery life to 30 hours of listening time without ANC, or 20 hours with ANC on. A five minute charge in the case provides around an hour of listening time or 45 minutes of talk time.\nSiri Support\nVolume, song changes, calls, and more can be done with Siri using a \"Hey Siri\" command, which is enabled through the H2 chip. Siri can also announce incoming notifications and let you know what text messages say when you receive them.\nSiri works like it does on any other device, and the voice assistant can answer all manner of questions and perform tasks like adjusting device volume. Some sample Siri commands are listed below.\n- Play some new music\n- Play my \"Favorites\" playlist\n- Skip to the next song\n- Turn down the volume\n- Turn up the volume\n- Call mom\n- Pause my music\n- What's the battery life of my AirPods?\n- What's the temperature outside?\n- What's the battery of my AirPods?\nSiri head gestures are supported, so you can nod your head yes or shake your head no to respond to Siri announcements like incoming notifications and calls.\nFind My\nThe AirPods 4 are part of the Find My network, which leverages hundreds of millions of iPhone, iPad, and Mac devices around the world to find lost items. If your AirPods become lost, you may be able to find them through the Find My network even if they're not close by.\nYou can also set up Separation Alerts that let you know right away if your AirPods are left behind.\nThe AirPods 4 with ANC support Find My alerts thanks to the speaker include in the Charging Case.\niOS 26 Features\nThe upcoming iOS 26, iPadOS 26, and macOS Tahoe updates will add new features to the AirPods when paired with an upcoming AirPods firmware update that will come out alongside the new software. Apple is beta testing the new firmware along with the software updates.\nStudio Quality Recording\nThe AirPods 4 and the AirPods Pro 2 can be used to record studio-quality audio for interviews, podcasts, songs, videos, and more. Apple says that the feature can be used to record high-quality vocals while on the go.\nYou can record higher-quality audio when making videos or using your devices to do things like record a podcast.\nImproved Audio Quality\nThe studio-quality recording feature brings more natural vocal texture and clarity to iPhone calls, FaceTime calls, and all CallKit-enabled apps like Zoom.\nBoth studio-quality audio recording and improved call quality are available across iPhone, iPad, and Mac, and support the Camera app, Voice Memos, Messages dictation, third-party camera apps, and video conferencing apps.\nCamera Remote\nThe AirPods can be used as a camera remote with the Camera app and third-party camera apps on iPhone or iPad. Just press and hold on the AirPods stem to take a photo or start a video recording.\nWhen the recording is finished, a press and hold gesture will stop the recording. Apple says that users who like to capture themselves singing and dancing for social networks like TikTok will be able to easily perform in sync with a soundtrack while simultaneously recording video.\nUpdate Interface\nWith the latest software updates, Apple is finally adding a way to manually update the firmware on your AirPods. When your AirPods are connected, you can go to the Settings app to get to a new software update interface.\nPause Audio for Sleep\nIf you're listening to music, a podcast, or a book while you're in bed and you're wearing AirPods, the AirPods will pause your audio when you fall asleep.\nKeep Audio in Headphones\nWhen you use AirPods, you can opt to keep audio in your headphones when other playback devices like cars and speakers connect to the iPhone.\nCurrent Firmware\nApple updates the firmware that runs on the AirPods 4 regularly. The current firmware version is 7E93, and it was released in March. Firmware can be installed on AirPods by connecting them to an Apple device, putting them in their charging case, and waiting for 30 minutes.\nAirPods Pro\nAs an alternative to the AirPods 4, Apple offers the AirPods Pro 2, which are higher-end earbuds with Active Noise Cancellation and silicone ear tips. The AirPods Pro are now on their second generation and are priced at $249, with more information available in our roundup.\nWhat's Next for the AirPods\nFuture AirPods could include multiple health sensors that would complement the Apple Watch. AirPods could include body temperature sensing and posture monitoring, according to The Wall Street Journal. Apple is said to be testing AirPods prototypes that are able to monitor a wearer's core body temperature from within the ear. AirPods could also eventually be used to monitor posture and alert the wearer of slouching using motion sensors.\nA future version of the AirPods will include integrated infrared camera modules to improve spatial experiences when paired with the Vision Pro headset. The cameras will work similarly to the Face ID system on the iPhone, scanning the area surrounding the user to better map the environment.\nThe IR cameras will allow for a broader range of gestures that will improve user interaction and the syncing of audio to head movement, plus the cameras could feed data to an AI feature. The cameras that will be added to the AirPods could also be used to scan the environment and describe objects, similar to the Visual Intelligence feature that's available on newer iPhones.\nApple analyst Ming-Chi Kuo believes we could see these new AirPods as soon as 2026, but it is not yet clear if the feature will be added to the standard AirPods or a version of the AirPods Pro. Bloomberg's Mark Gurman believes AirPods with cameras will be be released in 2027.\nApple wants to make advanced AR glasses that are based on the Vision Pro headset in the future, but the hardware technology does not exist for such a product as of yet. Apple has instead considered creating a pair of smart glasses that would compete with Meta's Ray-Ban Smart Glasses and Amazon's Echo Frames.\nThe glasses could perhaps serve as an AirPods replacement, featuring built-in speakers, cameras, health sensors, and AI capabilities. Apple is still working on the idea and it is not a product that will launch anytime soon.\nAirPods Roundup Changelog\n- July 11 - Revamped iOS 26 feature section.\n- June 27 - Updated with new features coming in iOS 26.\n- May 15 - Added rumors about future AirPods.\n- April 17 - Updated buyer's guide info.\n- March 31 - New firmware released.\n- March 13 - Added rumor about live translate coming to AirPods in iOS 19.\n- January 28 - Updated with rumors about future AirPods, and added firmware installation instructions.\n- November 15 - New firmware released.\n- October 2 - Added new buyer's guide.\n- September 30 - Added new video comparison with AirPods Pro 2.\n- September 27 - New firmware released.\n- September 19 - Updated with reviews and buyer's guide.\n- September 11 - Revamped with AirPods 4 launch info."
    }
  ],
  "argos_summary": "Apple is reportedly developing a Live Translation feature for AirPods, which will allow users to translate in-person conversations in real-time. This feature is expected to be linked to the upcoming iOS 26 and will utilize gestures to activate the translation function. The AirPods Pro 2 and AirPods 4 are confirmed to support this feature, enhancing their usability for multilingual interactions.",
  "argos_id": "78KKEUP4X"
}