{
  "url": "https://www.benzinga.com/markets/earnings/25/08/47046070/oklo-misses-q2-earnings-estimates-announces-strategic-collaboration-with-lightbridge-for-advanced-fuels",
  "authorsByline": "Adam Eckert",
  "articleId": "28c486af1f264ac0bb7040ad3a82cdc7",
  "source": {
    "domain": "benzinga.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "MI",
      "county": "Wayne County",
      "city": "Detroit",
      "coordinates": {
        "lat": 42.3315509,
        "lon": -83.0466403
      }
    }
  },
  "imageUrl": "https://cdn.benzinga.com/files/images/story/2025/08/11/Oklo-Inc-.jpeg?width=1200&height=800&fit=crop",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T17:08:23-04:00",
  "addDate": "2025-08-11T21:57:12.045151+00:00",
  "refreshDate": "2025-08-11T21:57:12.045153+00:00",
  "score": 1.0,
  "title": "Oklo Misses Q2, Partners With Lightbridge On Advanced Fuels - Oklo (NYSE:OKLO)",
  "description": "Oklo reports second-quarter financial results after the market close on Monday. Here's a look at the key details from the report.",
  "content": "Oklo Inc OKLO reported second-quarter financial results after the market close on Monday. Here’s a look at the key details from the report.\n\nWhat is OKLO’s current stock price? Find out here.\n\nQ2 Earnings: Nuclear startup Oklo reported a second-quarter loss of 18 cents per share, missing estimates for a loss of 12 cents per share, according to Benzinga Pro.\n\nOklo reported operating losses of $28 million in the second quarter, primarily driven by payroll, stock-based compensation and general business expenses. The company ended the quarter with $226.8 million of cash and cash equivalents and $456.2 million of marketable securities.\n\nOklo said it’s targeting submission of Phase 1 of its combined license application for its Aurora powerhouse early in the fourth quarter. Pre-construction activities are expected to begin in the third quarter. The company is targeting commercial operations for its first nuclear powerhouse in late 2027 or early 2028.\n\nOklo announced a strategic collaboration with Lightbridge Corp LTBR to explore a potential co-location of a Lightbridge fuel fabrication facility inside of Oklo’s planned advanced fuel manufacturing infrastructure. The site would also serve as a joint research and development hub for advanced fuel development.\n\n“We’re building the infrastructure to help fuel new nuclear development and deployment,” said Jacob DeWitte, co-founder and CEO of Oklo.\n\n“This collaboration supports our efforts to bolster near- and mid-term advanced reactor fuel supplies with legacy materials such as down-blended uranium and repurposed plutonium. It directly aligns with strong federal direction supporting domestic fuel independence.”\n\nOklo’s management team will further discuss the quarter on an earnings call with investors and analysts at 5 p.m. ET.\n\nOKLO Price Action: Oklo shares were down 0.097% in Monday's after-hours session at $71.79 at the time of publication, according to Benzinga Pro.",
  "medium": "Article",
  "links": [
    "http://benzinga.com/quote/oklo",
    "https://www.benzinga.com/quote/OKLO",
    "http://pro.benzinga.com/",
    "https://www.benzinga.com/pressreleases/25/08/b47044013/oklo-publishes-second-quarter-2025-financial-results-and-business-update",
    "https://www.benzinga.com/etfs/sector-etfs/25/08/46984630/trump-administrations-moon-reactor-plan-ignites-rally-in-nuclear-stocks-and-etfs"
  ],
  "labels": [
    {
      "name": "Roundup"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "advanced fuel development",
      "weight": 0.10261115
    },
    {
      "name": "Advanced Fuels",
      "weight": 0.09917317
    },
    {
      "name": "Oklo shares",
      "weight": 0.09772213
    },
    {
      "name": "Nuclear startup Oklo",
      "weight": 0.09699188
    },
    {
      "name": "Oklo Inc",
      "weight": 0.089089595
    },
    {
      "name": "Oklo",
      "weight": 0.0888305
    },
    {
      "name": "domestic fuel independence",
      "weight": 0.081123106
    },
    {
      "name": "new nuclear development",
      "weight": 0.07851949
    },
    {
      "name": "Oklo’s planned advanced fuel manufacturing infrastructure",
      "weight": 0.07572157
    },
    {
      "name": "Lightbridge Corp LTBR",
      "weight": 0.07215848
    }
  ],
  "topics": [
    {
      "name": "Markets"
    },
    {
      "name": "Stocks"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.98193359375
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.97412109375
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.955078125
    },
    {
      "name": "/Business & Industrial/Energy & Utilities/Oil & Gas",
      "score": 0.55322265625
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.3212890625
    }
  ],
  "sentiment": {
    "positive": 0.022776855,
    "negative": 0.8809654,
    "neutral": 0.09625771
  },
  "summary": "Nuclear startup Oklo Inc. reported a second-quarter loss of 18 cents per share, missing estimates of 12 cents. The company reported operating losses of $28 million, primarily due to payroll, stock-based compensation, and general business expenses. Oklo also announced a strategic collaboration with Lightbridge Corp. to explore a potential co-location of a Lightbridge fuel fabrication facility inside of Oklo’s planned advanced fuel manufacturing infrastructure. The collaboration aligns with strong federal direction supporting domestic fuel independence. The firm also plans to submit its combined license application for its Aurora powerhouse in the fourth quarter and is targeting commercial operations for its first nuclear powerhouse in late 2027 or early 2028.",
  "shortSummary": "Oklo reported a second-quarter loss of $28 million, partnering with Lightbridge to develop advanced fuel infrastructure for nuclear power plants.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "c5e4a34a523541f5b6d9949163804a2b",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.benzinga.com/pressreleases/25/08/b47044013/oklo-publishes-second-quarter-2025-financial-results-and-business-update",
      "text": "Oklo Inc. OKLO (\"Oklo\" or \"the Company\"), an advanced nuclear technology company, today published its financial results and business update for the quarter ended June 30, 2025.\nIn addition, the Company has posted an updated investor presentation on its investor relations website at oklo.com/investors.\nOklo will host a conference call today, August 11, 2025, at 2:00 p.m. Pacific Time / 5:00 p.m. Eastern Time. Jacob DeWitte, Co-Founder and Chief Executive Officer, and Craig Bealmear, Chief Financial Officer, will speak on the call. A webcast of the call can be accessed by visiting the Events & Presentations section of the Company's investor relations website.\nAn archive of the webcast will be available shortly after the conclusion of the event and will be available for 12 months.\nAbout Oklo Inc. : Oklo Inc. is developing fast fission power plants to deliver clean, reliable, and affordable energy at scale, establishing a domestic supply chain for critical radioisotopes, and advancing nuclear fuel recycling to convert nuclear waste into clean energy. Oklo was the first to receive a site use permit from the U.S. Department of Energy for a commercial advanced fission plant, was awarded fuel from Idaho National Laboratory, and submitted the first custom combined license application for an advanced reactor to the U.S. Nuclear Regulatory Commission. Oklo is also developing advanced fuel recycling technologies in collaboration with the U.S. Department of Energy and U.S. National Laboratories.\nForward-Looking Statements\nThis press release includes statements that express Oklo's opinions, expectations, objectives, beliefs, plans, intentions, strategies, assumptions, forecasts or projections regarding future events or future results and therefore are, or may be deemed to be, \"forward-looking statements.\" The words \"anticipate,\" \"believe,\" \"continue,\" \"could,\" \"estimate,\" \"expect,\" \"intends,\" \"may,\" \"might,\" \"plan,\" \"possible,\" \"potential,\" \"predict,\" \"project,\" \"should,\" \"would\" or, in each case, their negative or other variations or comparable terminology, and similar expressions may identify forward-looking statements, but the absence of these words does not mean that a statement is not forward-looking. These forward-looking statements include all matters that are not historical facts. They appear in a number of places throughout this press release and include statements regarding our intentions, beliefs or current expectations concerning, among other things, results of operations, financial condition, liquidity, prospects, growth, strategies and the markets in which Oklo operates. Such forward-looking statements are based on information available as of the date of this press release, and current expectations, forecasts and assumptions, and involve a number of judgments, risks and uncertainties.\nAs a result of a number of known and unknown risks and uncertainties, the actual results or performance of Oklo may be materially different from those expressed or implied by these forward-looking statements. The following important risk factors could affect Oklo's future results and cause those results or other outcomes to differ materially from those expressed or implied in the forward-looking statements: risks related to the deployment of Oklo's powerhouses; the risk that Oklo is pursuing an emerging market, with no commercial project operating, regulatory uncertainties; the potential need for financing to construct plants, market, financial, political and legal conditions; the effects of competition; risks related to the availability of fuel, including high-assay low-enriched uranium (\"HALEU\"), plutonium, and recycled fuels; changes in applicable laws or regulations; and the outcome of any government and regulatory proceedings and investigations and inquiries.\nThe foregoing list of factors is not exhaustive. You should carefully consider the foregoing factors and the other risks and uncertainties of the other documents filed by Oklo from time to time with the U.S. Securities and Exchange Commission. The forward-looking statements contained in this press release and in any document incorporated by reference are based on current expectations and beliefs concerning future developments and their potential effects on Oklo. There can be no assurance that future developments affecting Oklo will be those that Oklo has anticipated. Oklo undertakes no obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise, except as may be required under applicable securities laws.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20250811769618/en/\nMedia and Investor Contact for Oklo:\nBonita Chester, Head of Communications and Media at media@oklo.com\nInvestor Contact:\nSam Doane, Director of Investor Relations at investors@oklo.com\nEdge Rankings\nPrice Trend\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
      "url": "https://www.benzinga.com/etfs/sector-etfs/25/08/46984630/trump-administrations-moon-reactor-plan-ignites-rally-in-nuclear-stocks-and-etfs",
      "text": "- NASA's moon reactor plan and Trump's nuclear push have sparked a rally in stocks like OKLO and BWXT, boosting nuclear-themed ETFs.\n- Strong earnings from BWX Technologies and upcoming results from OKLO are drawing investor interest to ETFs with nuclear exposure.\n- The next 100%+ earnings move could hit this month. See how to find it live on Wednesday →\nThe Trump administration's directive to accelerate plans for a nuclear reactor on the moon has sparked renewed speculation and market interest in companies such as OKLO Inc. OKLO and BWX Technologies BWXT, highlighting the growing focus on a space-age energy race. Naturally, interest in nuclear-themed ETFs has taken the center stage.\n- Oklo is in focus after the Trump administration’s directive to pursue a lunar nuclear reactor. Track its prices live.\nOKLO shares soared to an all-time high on Tuesday after Transportation Secretary Sean Duffy, acting NASA administrator, announced the beginning of a process to solicit commercial proposals for designing a 100-kilowatt nuclear reactor for possible use on the moon. While no contractor has been selected, market speculation is focused on which companies could potentially benefit.\nBoth OKLO and NuScale Power Corp. SMR gained, buoyed by speculation that they could be contenders in the lunar energy program. BWX Technologies Inc BWXT, the primary U.S. Navy supplier of nuclear propulsion systems, experienced a rally that was not driven by moon dust alone.\nAfter the close on Monday, BWX Technologies announced second-quarter earnings that beat on both the top and bottom line. The company also raised its FY25 outlook.\nCEO Rex Geveden cited solid government performance and a faster-growing global demand for nuclear technology in the defense, clean energy, and medical spaces.\nBWX’s earnings and guidance were actual fundamentals to support the thematic tailwinds, a rare coincidence in hype-driven trades.\nThose wanting to ride the nuclear energy hype, but not put all their bet in a single stock, are investing in ETFs offering diversified exposure to uranium, nuclear technology, and energy infrastructure.\nTop Nuclear-Themed ETFs\nGlobal X Uranium ETF URA:\n- Theme: Uranium miners and nuclear technology\n- Top Holdings: Cameco Corp CCJ, NexGen Energy Inc NEE\n- Relevance: Indirect exposure to the uranium supply chain that may fuel future moon or space reactors.\nVanEck Uranium And Nuclear Energy ETF NLR\n- Focus: Utilities and firms along the nuclear power value chain\n- Top Holdings: Constellation Energy Corp CEG, BWX Technologies\n- Relevance: Includes BWXT, providing direct exposure to defense and space-oriented nuclear contracts.\niShares U.S. Infrastructure ETF IFRA\n- Focus: Infrastructure projects supported by the federal government\n- Relevance: Not specifically nuclear, but it could gain from more generalized U.S. investment in space, energy, and defense infrastructure.\nNext Up: OKLO Earnings\nETF investors will be watching OKLO’s Q2 earnings, due after market close on Aug. 11, to see if the lunar optimism is translating into real progress, contracts, or partnerships.\nThough its moon-related potential is conjectural, solid earnings or news-driven announcements may validate the excitement and trigger ETF flows.\nMacro Trend Meets Moon Mission\nThe Trump administration's endorsement of a lunar nuclear reactor marks a bold new chapter in the narrative of nuclear energy's potential as a space-faring strategic asset and national security tool.\nPaired with increasing global demand, favorable regulatory attitudes, and breakout profits from leaders, the industry is finally matching the hype.\nWhether or not this moonshot venture results in genuine commercial rewards or mere cosmic speculation, nuclear ETFs are on investors’ radar screens again.\nPhoto: Shutterstock\nEdge Rankings\nPrice Trend\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    }
  ],
  "argos_summary": "Oklo Inc. reported a second-quarter loss of 18 cents per share, missing estimates, with operating losses of $28 million primarily due to payroll and business expenses. The company has $226.8 million in cash and is targeting the submission of its combined license application for the Aurora powerhouse by early Q4, aiming for commercial operations by late 2027 or early 2028. Additionally, Oklo announced a collaboration with Lightbridge Corp to explore co-locating a fuel fabrication facility, aligning with federal initiatives for domestic fuel independence.",
  "argos_id": "7CCXC8E6T"
}