{
  "url": "https://www.latimes.com/california/story/2025-08-11/at-least-73-of-u-s-adults-experienced-an-online-scam-what-you-should-know",
  "authorsByline": "By Karen GarciaStaff Writer  Follow",
  "articleId": "2ae72f24f8b24542b5b433cb0b97f43d",
  "source": {
    "domain": "latimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "CA",
      "city": "Los Angeles",
      "coordinates": {
        "lat": 34.0536909,
        "lon": -118.242766
      }
    }
  },
  "imageUrl": "https://ca-times.brightspotcdn.com/dims4/default/772ead8/2147483647/strip/true/crop/5100x2678+0+382/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fbb%2Ffa%2F34fe62a84101be903d38631c57df%2Fgettyimages-1387670572.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T17:43:51.482000+00:00",
  "addDate": "2025-08-11T20:15:34.994365+00:00",
  "refreshDate": "2025-08-11T20:15:34.994366+00:00",
  "score": 1.0,
  "title": "At least 73% of U.S. adults have fallen for online scams. How you can avoid the latest con",
  "description": "A Pew Research Study found that 73% of adults have experienced one or more online scams. Experts provide tips on how to avoid them.",
  "content": "A recent survey found that approximately 73% of U.S. adults have experienced at least one or more online scams.\n\nOnline scammers continue to dupe a majority of American adults as they infiltrate virtual calendars and security systems meant to defend you against the poaching of personal information.\n\nA recent survey of more than 9,000 U.S. adults by the Pew Research Center found that approximately 73% experienced at least one or more online scams or attacks.\n\nThe most common virtual cons were credit card fraud, online shopping scams, and ransomware attacks — a type of malicious software that prevents you from accessing your computer files or system until a ransom is paid.\n\nAbout 24% of those surveyed said they had received a scam email, text message or call that tricked them into giving away personal information.\n\nAn estimated 32% of respondents said they were victims of a scam within the past year.\n\nIt’s often said that older adults are more vulnerable to online fraudsters. However, in 2021 the Federal Trade Commission reported that Gen X-ers, millennials and Gen Z adults, collectively between the ages of 18 to 59, were 34% more likely than adults who are 60 and older to report losing money to fraud.\n\nThese generational groups are getting tricked by online schemes that originate from a social media ad, an investment scam or fake job opportunities.\n\nThe latest phishing, or attempt to acquire sensitive data, attacks are happening through your online calendar, (Google or Outlook calendar), multi-factor authentication app and HTML attachments.\n\nEvading online scams is proving to be a challenge, but cybersecurity experts say there are steps you can take to protect yourself.\n\nScammers are constantly finding new ways to lure you into unknowingly giving up your personal information and the calendar connected to your email account is one of them, said Iskander Sanchez-Rola, director of artificial intelligence and innovation for Norton.\n\nUnlike traditional phishing scams such as an unwanted text or call that requires your engagement, this invitation automatically appears on your calendar without you approving or denying it.\n\nAnyone can easily be fooled by this because it can confuse you into thinking you accepted the invitation at some point, Sanchez-Rola said.\n\nThe scam happens when you click on the invite to get more information.\n\nA link in the invitation can lead you to a phishing webpage that is masquerading as a Zoom link, or it can prompt you to download malware that is disguised as a software update.\n\nThis con often targets work-related email accounts and corresponding calendar apps.\n\nThe warning signs of this scam include:\n• Misspellings in the link or sender address associated with the calendar appointment\n• The invite is associated with work, but you’re the only person to receive it.\n\nWhat you can do: Change the settings in your online calendar to prohibit automatic updates. Microsoft Outlook users can follow these online instructions to change their calendar settings; Google users can limit which invitations appear on their schedule by following these online instructions.\n\nIf you have any suspicions, don’t reply directly to the invite, said Derek Manky, Chief Security Strategist and Global Vice President of Threat Intelligence at Fortinet.\n\n“Instead, send an email to your trusted contact from that organization asking if they have confirmed the meeting and request further details,” Manky said.\n\nA multi-factor authentication app, also known as a “Two Step Verification,” is an application on your phone that provides you with a code or a “yes or no” prompt to verify that you’re accessing an account that’s linked to the authenticator.\n\n“Multi factor authentication (MFA) attacks have been happening for well over a decade, they just frequently take on new forms, or target new platforms such as the authenticator app,” Manky said.\n\nA scam occurs when you’re receiving multiple notifications from the authentication app even though you didn’t request verification.\n\n“This scam is all about wearing you down to the point of clicking an unknown notification and accidentally providing your personal information,” Sanchez-Rola said.\n\nThe warning signs of this scam include:\n• The authentication app is requesting verification or providing you with a verification code you did not request.\n• The authentication app is sending you several notifications in a row even though you did not prompt the app.\n\nWhat can you do: If you’re getting a string of authentication app notifications, pause before you click.\n\n“Because approving a login you didn’t request is like handing your keys to a stranger, you just don’t do it,” Sanchez-Rola said.\n\nA safer way to use an authentication app — such as 2FAS, Aegis Authenticator, Microsoft Authenticator, Stratum, or Google Authenticator — is to use one that provides you with a verification code. Don’t use an app that sends a notification because that’s how a scammer can pressure you into providing your login information.\n\nAnother step in protecting yourself is changing your passwords frequently, as it reduces the shelf-life for the ones that are stolen and sold, Manky said.\n\nAn email with an unknown HTML attachment can redirect you to a phishing webpage or prompt you to download malware.\n\nIt’s the oldest technique in the book but it’s still commonly used today, Manky said.\n\n“HTM/HTML files contain code that can be used in a variety of ways, including executing malicious scripts, for example Javascript, that could drop an information stealer on the system,” he said. “Likewise, they could be used to launch a phishing page to harvest credentials.\n\nFraudsters will try to use trusted names or services that are of daily use to you.\n\n“If an email is unsolicited, the end user should always question the identity of the emails being sent,” Manky said.\n\nThe warning signs of this scam include:\n• The sender of the email is an unknown contact.\n• The attachment within the email is unsolicited and looks suspicious.\n\nWhat can you do: Always exercise caution before opening any attachments in an email, Manky said.\n\nLook for typosquatting in the URL of the attachment. Typosquatting is when domain names on the URL have a small variation from the legitimate one, Manky said.",
  "medium": "Article",
  "links": [
    "https://www.fbi.gov/how-we-can-help-you/scams-and-safety/common-frauds-and-scams/ransomware",
    "https://support.microsoft.com/en-us/office/automatically-add-events-from-your-email-to-your-calendar-32e5cf0c-3e65-4870-9ff9-df3683d3fc97",
    "https://www.latimes.com/california/story/2025-08-10/prepare-to-say-farewell-to-los-angeles-palm-trees",
    "https://www.pewresearch.org/internet/2025/07/31/online-scams-and-attacks-in-america-today/",
    "https://www.fbi.gov/how-we-can-help-you/scams-and-safety/common-frauds-and-scams/elder-fraud",
    "https://www.latimes.com/california/story/2025-08-11/newsom-trump-ucla-grant-freezes-antisemitism",
    "https://www.latimes.com/california/story/2025-08-11/newsom-letter-warns-trump-congressional-redistricting",
    "https://www.ftc.gov/news-events/data-visualizations/data-spotlight/2022/12/who-experiences-scams-story-all-ages",
    "https://support.google.com/a/answer/10985109?hl=en"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "online scams",
      "weight": 0.092805
    },
    {
      "name": "online shopping scams",
      "weight": 0.0878856
    },
    {
      "name": "authentication app notifications",
      "weight": 0.08176848
    },
    {
      "name": "traditional phishing scams",
      "weight": 0.07708441
    },
    {
      "name": "corresponding calendar apps",
      "weight": 0.07568219
    },
    {
      "name": "multi-factor authentication app",
      "weight": 0.0736881
    },
    {
      "name": "Online scammers",
      "weight": 0.07109025
    },
    {
      "name": "online schemes",
      "weight": 0.067453645
    },
    {
      "name": "online fraudsters",
      "weight": 0.06706622
    },
    {
      "name": "virtual calendars",
      "weight": 0.062817745
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.77294921875
    },
    {
      "name": "/Shopping/Consumer Resources/Consumer Advocacy & Protection",
      "score": 0.72802734375
    },
    {
      "name": "/Shopping/Consumer Resources/Identity Theft Protection",
      "score": 0.54052734375
    }
  ],
  "sentiment": {
    "positive": 0.057359453,
    "negative": 0.6337671,
    "neutral": 0.30887344
  },
  "summary": "A recent survey by the Pew Research Center found that 73% of U.S. adults have experienced at least one or more online scams. The most common online cons include credit card fraud, online shopping scams, and ransomware attacks. About 24% of respondents said they had received a scam email, text message or call that tricked them into giving away personal information. The Federal Trade Commission reported that Gen X-ers, millennials and Gen Z adults were 34% more likely than adults who are 60 and older to report losing money to fraud. Cybersecurity experts suggest that there are several steps to protect yourself, including changing the settings in your online calendar to prevent automatic updates.",
  "shortSummary": "A Pew Research Center survey reveals that at least 73% of U.S. adults (73%) experience at least one or more online scams, particularly phishing and multi-factor authentication scams.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "0ebe769f30494c4cb06035d11f6de572",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.latimes.com/california/story/2025-08-11/newsom-letter-warns-trump-congressional-redistricting",
      "text": "Newsom warns Trump in heated letter he’s ‘playing with fire’ on redistricting\n- Share via\nWith Democrats lining up for a bare-knuckle match on redistricting, Gov. Gavin Newsom has offered President Trump a cease-fire proposal: No redrawing congressional maps in red states and California will stand down, he wrote in a letter sent to Trump on Monday morning.\n“If you will not stand down, I will be forced to lead an effort to redraw the maps in California to offset the rigging of maps in red states,” he said. “But if the other states call off their redistricting efforts, we will happily do the same. And American democracy will be better for it.”\nNewsom’s latest play comes as the drama around redistricting heightened over the weekend. Democratic leaders in other blue states argued on Sunday morning political shows that they were ready to battle head-to-head over the congressional district maps, which are normally tied to the census taken once a decade.\n“Donald Trump is a cheater. He cheats on his wives, he cheats at golf, and now he’s trying to cheat the American people out of their votes,” said Illinois Gov. JB Pritzker on “Meet the Press” Sunday.\nNewsom has been at center stage in this national political fight that could determine the outcome of the midterm elections and, by default, the strength of the president’s power. The Republican-led Congress handed Trump the “big beautiful bill” that will supercharge immigration enforcement — his signature issue. And it has been deferential to his whims, but the Republican Party losing control of the House and Senate would be a major blow to his agenda.\nThe national political fight is gearing up with much at stake for both parties. Last week, Newsom hosted Texas Democrats who — under threat of arrest and daily $500 fines — had left the state in a bid to prevent their Legislature from altering the congressional maps. And he vowed to “nullify” what happens in Texas.\n“You are playing with fire, risking the destabilization of our democracy, while knowing that California can neutralize any gains you hope to make,” he told Trump in the letter. “This attempt to rig congressional maps to hold onto power before a single vote is cast in the 2026 election is an affront to American democracy.”\nTrump has been pushing the Texas GOP to redraw congressional district maps, saying they are “entitled” to five seats. And he argued on CNBC last week that California was “gerrymandered,” pointing out the congressional delegation didn’t match the presidential vote results.\nBut, unlike some states, California has an independent redistricting committee.\nOn Friday, Trump spokesperson Steven Cheung called Newsom “a loser of the highest order” who would “never be president no matter how hard he prostitutes himself to the press.”\nThe California redistricting plan may be a risky gambit.\nThe plan calls for the state Legislature to approve a constitutional amendment establishing new congressional voting districts crafted to make GOP members vulnerable. The bill would create a Nov. 4 special election in which voters would decide whether to temporarily pause congressional boundaries created by an independent redistricting commission in 2021 and adopt new maps for the 2026, 2028 and 2030 elections.\nIf approved by voters, the measure would include a “trigger” specifying that it would take effect only if Texas or other Republican-led states followed through with redrawing their maps to boost GOP seats before the midterm election. California would revert to its existing redistricting law after the next census and before the 2032 election.\nTimes staff writers Taryn Luna and Seema Mehta contributed to this report."
    },
    {
      "url": "https://www.latimes.com/california/story/2025-08-10/prepare-to-say-farewell-to-los-angeles-palm-trees",
      "text": "- Share via\nCall forth the mourners from far and wide.\nAnd remind them to bring their chainsaws.\nWe gather to prepare ourselves to bid a frond farewell to Los Angeles’ palm trees.\nLos Angeles knows how to weather a crisis — or two or three. Angelenos are tapping into that resilience, striving to build a city for everyone.\nDon’t freak out. This isn’t an alert about any wholesale dying of palms. Not all of them, anyway, and not right away. But Ecclesiastes got it right about everything having a season, “a time to plant, and a time to pluck up that which is planted.”\nThe season — the long, long winning season — for so many of our palm trees is running its course. Our exotic, come-hither, haphazard forest is being slowly timed out.\nWe stand at an inflection point for L.A., after the fires, in the grip of climate change, recalibrating our future right down to the roots. Literally to the roots. Uncounted thousands of trees burned in the fires. Thousands more are getting thinned out by disease and drought and age. How do we replace our geriatric urban forest with more and better trees?\nOriginal L.A. was not the forest primeval. It was a landscape of scrubby shrubs and chaparral and grasses. What native trees there were grew alongside water, which flowed abundantly, if seasonally, until we took over the land and dried up the waterways.\nPalm trees came to town with the missionaries, for religious ceremonies, and then, decades later, with the great PR sales pitch of Southern California being the “American Mediterranean,” which demanded the right set dressing — palm trees.\nA veteran of the advertising business recalls a trick New Yorkers used to employ to get a trip to Los Angeles.\nThe City Beautiful movement of the 1910s and1920s and the glories of the 1932 Olympics stuck thousands of trees of all kinds into the ground to adorn public L.A. All they had to do was look good; to fret over drought or heat was treason.\nAngelenos’ faith that pretty much anything could grow here was usually right. The unlikeliest tree cuttings from the world over were carried here, adapted and came to elbow out the locals.\nThus, Los Angeles became a tree zoo.\nNow it’s time to make it a tree ark, and not every species should make it aboard.\nClimate change changes cities. We can no longer afford freeloader trees, however glamorous. Palms suck down water like camels, but give back barely enough leafiness to shade a Hula-Hoop. Falling fronds can deliver a mean whack, and during fires, palms light up like a flare.\nThe nonprofit TreePeople has been trying to prep us for this for years.\nBryan Vejar is a master arborist who directs community forestry for TreePeople, and, yes, in fact, he does have a few thoughts on the topic, and this is the moment we need to hear them, so take it away, Mr. Vejar:\n“Trees are not some cosmetic thing, some ornament. They’re also critical infrastructure, like traffic signs and traffic lights. They have tremendous value for the health and safety of the community.”\n“We should be planting trees that serve a greater range of ecological benefits. There’s not just one clear answer. The trees we plant now have to be climate-adaptive for weather forecasts for 50 and 60 years.”\n“Native trees also support local wildlife, specifically ones endemic to our geographical biome. Pollinators, nesting birds, migratory birds and other species rely on them.”\nCities are being urged to expand their urban tree canopy to mitigate the effects of climate change, but some are replacing mature shady trees with palms.\n“Not a lot of trees check every box. You want trees that are very durable and very resilient, that can endure many different soil types in any given community.”\nAll right, then. What’s in, and what’s out once we cart away old trees and/or plant new ones?\nOut: most palms. And don’t replace them with something like crape myrtle, which is pretty but doesn’t offer much shade for the space it takes up.\nMost eucalyptus, out. They’re invasive below ground and tiki torches above.\nSweet gums, out; They’re also invasive, triggering allergies, and dropping nasty, spiky balls like alien spoor. (Some trees appear on a city-approved list, but TreePeople gives them a “branches-down.”)\nI share Vejar’s loathing for the relentless “tree of heaven,” the deciduous plant that is sometimes called a stinking sumac. You see it everywhere; it not only crowds out natives, it also poisons the soil to kill off the competition and ruins biodiversity. Its leaves can also kill your dog. If you see one in your garden, kill it before it kills us.\nVejar’s “ins” include native oaks and some sycamores, black walnut trees, desert willows, drought-tolerant African sumac and Chinese pistache.\nFicus trees scrub away air pollution and cast vast shade, something vital when an urban forest can lower temperatures by 10 or 20 degrees. Ideal, right? Yet cities planted them unwisely alongside sidewalks, which their mature roots now crack and split.\n“The thing that makes it a workhorse for urban forests,” says Vejar, “is also what makes cities have to pay out millions in lawsuits from people tripping, ADA violations and such.”\nSo, suppose the palms do take their last bow? Which understudy is ready to step onstage as our new arboreal star? Oaks and sycamores are too generic. Orange trees? Memento mori.\nBut the jacaranda — now there’s beauty. Fast-growing, generous with shade, drought-tolerant and soil-forgiving. Bees and butterflies love them. And did I mention beautiful? That ultraviolet haze shimmering around a blossoming jacaranda delivers a moment of transcendent enchantment.\nSo what if the fallen petals are sticky? It’s a small toll paid to glory. Like a wad of gum dropped on the Hollywood Walk of Fame."
    },
    {
      "url": "https://www.latimes.com/california/story/2025-08-11/newsom-trump-ucla-grant-freezes-antisemitism",
      "text": "‘Uncharted territory’: Newsom and UC go to battle against Trump’s UCLA sanctions\n- Share via\n- Fearful of Trump actions, UCLA carefully avoided clashes with the president for months.\n- Conflict has come to a head after the Trump administration suspended $584 million in grants and has demanded a $1-billion settlement.\n- Newsom says the state will sue. UC Board of Regents will hold an emergency meeting Monday.\nTwo weeks ago, UCLA was optimistic.\nFor months, it had successfully avoided clashes with President Trump as university leaders declined to publicly criticize him by name over his battle to remake American higher education, first raging against several Ivy League schools.\nThe morning of July 29, UCLA announced it had settled a federal lawsuit with students who accused it of discrimination, paying more than $2 million to Jewish civil rights groups and millions more in legal fees. University leaders hailed the action as “real progress” to combat antisemitism. Privately, they pointed the Trump administration to the agreement, eager to convince federal officials they had made good with Jewish communities.\nThe high lasted just a few hours — and touched off an extraordinary 14 days of rapid-fire accusations, investigative findings and a massive federal freeze of UCLA’s research funding. It culminated Friday afternoon when Gov. Gavin Newsom unleashed furious comments in response to a federal demand that UC pay a $1-billion fine over a host of allegations against UCLA: antisemitism on campus, illegal use of race in admissions and policies that allow transgender athletes to compete according to their gender identity.\n“He has threatened us through extortion with a billion-dollar fine, unless we do his bidding,” Newsom said, adding that California would sue. “We will not be complicit in this kind of attack on academic freedom on this extraordinary public institution.”\nSpokespeople for the Justice Department did not respond Sunday to a question about Newsom’s comments and legal threat.\nThe escalating events lead up to decisive moments this week, starting with an emergency meeting of the UC Board of Regents on Monday afternoon. On Tuesday, a federal court hearing will unfold in a preexisting case that could result in some — but not all — UC grants being restored.\nThe Trump administration has proposed the University of California pay more than $1 billion to settle antisemitism charges and restore frozen grant funding at UCLA. Newsom says the state will sue.\nThe developments bring the fight over America’s higher education institutions — which has roiled elite private East Coast universities for months — to the nation’s most powerful and lauded public university system.\n“We are in uncharted territory,” said Ted Mitchell, president of the American Council on Education, which represents more than 1,700 colleges and universities. “We have seen the government come after Columbia, Brown, Harvard and others. But this, now, is a test. Will UCLA be the defender of public universities? Will it strike a deal? And what role will money — taxpayer money — play?”\nCalifornia is facing off against a president who has been relentless in his aims to rein in what he calls “Marxist” universities that in his view are bastions of liberalism that have done too little to protect Jewish students, have been too soft on pro-Palestinian protests, and rely too heavily on international student dollars.\nHis administration has accused a host of elite colleges nationwide — Harvard, Columbia, Brown, Stanford and three UC campuses — of illegally considering race in admissions and programming to the detriment of white and Asian American students. In response to pro-Palestinian protests, Trump has said colleges have enabled “jihadists,” saying demonstrators are “pro-Hamas” terrorists.\n“UCLA is not a random selection,” Mitchell said. “The administration has had issues with California, with the governor, for some time. This is part of a larger battle between the administration and the state of California.”\nWhat’s at stake\nSince July 30, when UCLA Chancellor Julio Frenk began receiving notices from the federal government announcing grant suspensions — totaling nearly half a billion dollars — UCLA leaders have scrambled to assess the effect on what they describe as life-saving, groundbreaking research. Deans and departments have been told to be prepared for layoffs if the cuts last.\nScience and medical professors, whose research labs would not exist without federal funding, have solicited private donations. Doctoral and postdoctoral students, whose tuition and living expenses are often funded by grants in exchange for lab work, are rushing to speed up their graduation plans before stipends become depleted.\nThe Trump administration has suspended $584 million in grants at UCLA over what the U.S. Department of Justice has described as the school’s ‘deliberate indifference’ to Jewish students’ civil rights.\n“The federal government claims antisemitism and bias as the reasons. This far-reaching penalty of defunding life-saving research does nothing to address any alleged discrimination,” Frenk said about the messages from the National Science Foundation, National Institutes of Health and Department of Energy.\nUC as a system and UCLA in particular have been under multiple federal investigations for months:\n- Alleged employment discrimination against Jewish employees and job applicants.\n- Civil rights complaints from Israeli and Jewish students.\n- The alleged consideration of race in admissions practices.\n- UCLA is also on a shortlist of 10 campuses, including UC Berkeley and USC — that a federal task force on combating antisemitism singled out in February.\nThe ongoing investigations were launched by the Education, Justice, and Health and Human Services departments.\nUCLA leaders thought they were being cooperative by sharing internal records over the months with government lawyers and making progress in quiet negotiations over the accusations, senior UC officials said.\nThey hoped the government took notice of efforts that could appease the president: a new campus initiative to combat antisemitism, the banning of Students for Justice in Palestine groups, a UC-wide ban on student government boycotts of Israel, quick shutdowns of pro-Palestinian campus protests, and strict discipline of pro-Palestinian students accused of time, place and manner violations during demonstrations.\nBut the federal government’s stance is now clear: It believes UCLA is guilty of all allegations.\nThe NSF letter said that UCLA “engages in racism, in the form of illegal affirmative action, UCLA fails to promote a research environment free of antisemitism and bias; UCLA discriminates against and endangers women by allowing men in women’s sports and private women-only spaces.”\nWhat Trump wants\nFederal lawyers want UC to pay the billion-dollar fine against UCLA in installments and contribute $172 million to a fund for Jewish students and other individuals affected by alleged civil rights violations.\nThe settlement demands include ending scholarships that focus on race or ethnicity, forcing UCLA to share more admissions data than it already publicly releases with the government and changes to campus protest rules such as a ban on overnight encampments.\nIn addition to the sticker-shock fine, some requests have puzzled UCLA leaders — as the UC system has already significantly overhauled many practices outlined by the federal government.\nIt has ended the use of “diversity statements” in hiring. Last fall, UCLA declared a “zero-tolerance” policy for encampments. The government wants transgender women off women’s sports teams. But as a member of the National Collegiate Athletics Assn., the university is already required to follow new association rules that bar transgender players from women’s teams.\n“It feels like a cut-and-paste job,” said a senior UC official about Trump’s proposal. The official was not authorized to speak publicly about negotiations. “It’s like they took a parts of letters to the Ivy Leagues, cobbled them together and added the words ‘UCLA.’ ”\nWhat comes next\nThe 24-member UC Board of Regents, which must approve of any settlement or payout to the federal government and would be involved in a suit, has called an emergency, closed-door meeting Monday afternoon. It’s unclear whether Newsom, who is an ex-officio member of the board, will attend.\nAnother pivotal moment comes Tuesday in San Francisco’s federal district court. There, Judge Rita F. Lin has ordered the Justice Department to explain why the UCLA cuts are not a violation of a June order in which she blocked certain science grant terminations for all of UC.\nThe case, filed by UC Berkeley and UC San Francisco researchers, is being argued by Erwin Chemerinsky, UC Berkeley law school dean and constitutional expert. If the judge rules in UC’s favor, it could apply to NSF cuts that account for about half of those in limbo at UCLA.\nIn an interview, Chemerinsky said actions against UCLA were “clearly illegal” because “the president lacks constitutional authority to refuse to spend money appropriated by Congress.”\nHe outlined what would likely be California’s argument in a suit: The government’s actions violate the Impoundment Control Act of 1974, which restricts the president’s ability to halt spending that Congress has authorized.\n“The cutoff of funds has been without the due process required by federal laws and the Constitution,” Chemerinsky said. “Agencies cutting off funds, like NIH and NSF, are violating the Administrative Procedures Act in that the actions are ‘arbitrary, capricious, and an abuse of discretion.’ Many of the cutoffs of funds violate the 1st Amendment for being based on viewpoint.”\nNegotiations still possible\nBut California faces a risk if it files a suit against the administration’s orders.\nWhen Harvard pushed back against billions in similar cuts earlier this year, the Trump administration hit the university with additional costly funding clawbacks and a termination of its ability to host foreign students, an issue it further sued over.\nCarl Tobias, a law professor at the University of Richmond, said time — and politics — is not on UCLA’s side.\n“At some point you have to be ready for fall classes and international students coming in and the campus trying to deal with the uncertainty and losing all your grants,” said Tobias. Litigation can take months, if not years, he said. California “might do well in the district courts and then in the 9th Circuit, but I don’t know what would happen in the Supreme Court.”\nAfter Newsom threatened a suit, UC Regents Chair Janet Reilly told The Times that negotiation is still on the table — but not on the current “unacceptable” terms.\n“The university remains willing to engage in a constructive and good-faith dialogue with the federal government but the University of California will always stand firm in protecting the integrity and values of our institution,” Reilly said.\nMark Yudof, a former UC president who led the system from 2008 to 2013, believed negotiations were still likely.\n“While litigation is certainly a possibility, my sense is that both sides will first try negotiating a settlement,” Yudof said. He said the settlement UCLA came to with Jewish students in late July is “likely to be the initial framework for those discussions. Hard to say where it goes from there. The fact that UC is a public university system adds to the complexities.”\nMitchell, the American Council on Education president and former top administrator of Occidental College, said a quick resolution would benefit both sides. He said a months-long process — as it’s been between Harvard and Trump — would have the potential for “great harm.”\n“These things, the longer they go on, the worse they get,” he said."
    },
    {
      "url": "https://www.pewresearch.org/internet/2025/07/31/online-scams-and-attacks-in-america-today/",
      "text": "Online scams and other internet crimes are skyrocketing, with a record $16.6 billion in losses reported to the FBI in 2024. The federal government, banks and companies are all sounding alarms. And the public is also wary, with many having firsthand experience:\n- Nearly all Americans view online scams and attacks as a national problem. More than nine-in-ten say online scams and attacks are a problem in the country, including 79% who describe them as a major problem.\n- Most U.S. adults have been a victim of an online scam or attack. We find that 73% of U.S. adults have ever experienced things like credit card fraud, ransomware or online shopping scams.\nWhile Americans see older adults as more vulnerable to these crimes, significant portions of both older and younger adults have been scammed and targeted online. These are some of the key findings from a Pew Research Center survey of 9,397 U.S. adults conducted from April 14 to 20, 2025.\nWe asked Americans if six different types of online scams or attacks had happened to them. Overall, about three-quarters (73%) say at least one has, with 32% saying it’s happened in the past year.1\nOf the six, Americans most commonly report that online hackers made fraudulent charges on their credit or debit card. About half of U.S. adults (48%) report this has happened to them.\nRoughly a quarter to a third report that three other types of scams happened to them:\n- 36% say they purchased an item online that never arrived or was counterfeit and it was not refunded.2\n- 29% say a personal online account was hacked, such as a social media, email or bank account.\n- 24% say they got a scam email, text message or call that led them to give away personal information.\nOne-in-ten or fewer say the remaining two scams and online attacks happened:\n- 10% say that ransomware blocked use of their computer until they paid money.\n- 7% say they gave money to a fake online investment opportunity, such as for real estate or stocks.\nMany Americans have had multiple types of online scams happen to them. About one-in-five (22%) say they’ve experienced two of six, and the same share say three or more.\nBy age\nLarge portions of both older and younger adults report that scams and online attacks have happened to them.\nAbout three-quarters of adults under 30, as well as those ages 30 to 49 and 50 to 64, report ever experiencing an online scam or attack. A slightly smaller share of those 65 and older (66%) report the same.\nAdditionally, experiencing multiple types of scams or attacks is roughly on par across age groups.\nBy race and ethnicity\nWhile there are no differences between racial and ethnic groups in experiencing at least one of the scams or attacks, Black, Hispanic and Asian adults are more likely than White adults to have had multiple forms of these frauds happen to them.\nFor example, about three-in-ten Black or Hispanic adults have faced three or more types of online scams or attacks, compared with 18% of White adults.\nBy income\nAmericans in households across income levels are about as likely to say they’ve ever experienced at least one of the online scams. But those in households with lower incomes are more likely to say at least three have happened.\nGo to the Appendix for a demographic breakdown of each of the six scams and online attacks.\nScam messages\nOnline scams target Americans in variety of ways, including phone calls, texts and emails. According to our survey, a majority of U.S. adults report getting scam phone calls (68%), emails (63%) or text messages (61%) at least weekly that attempt to get their personal information. One-third get these messages on social media at the same frequency.\nThese attempts to get personal information aren’t just a weekly occurrence; for some, they’re a daily reality.\n- 31% say they get scam phone calls at least daily, including 21% who say this happens several times a day.\n- 28% say they get daily scam emails.\n- 20% encounter this by text message on a daily basis.\n- Fewer (11%) say the same for social media.\nGo to the Appendix for the demographic breakdown of those who have experienced scam messages in each way.\nFinancial losses and impact on financial well-being\nMore money is being lost to online scams and cybercriminals than ever before, according to the FBI.\nIn our survey, roughly one-in-five U.S. adults (21%) say they have ever lost money because of an online scam or attack.\nBy age\nYounger Americans are slightly more likely than their older counterparts to say they have lost money because of an online scam or attack.\nAbout a quarter of 18- to 29-year-olds say they’ve lost money in this way, compared with 15% of those 65 and older.\nBy race and ethnicity\nThere are also differences by race and ethnicity. Black, Hispanic and Asian adults are more likely than White adults to say they have lost money because of an online scam or attack.\nBy household income\nThose with lower incomes (26%) are more likely than those in upper-income households (15%) to say they have lost money in this way. Those in middle-income households fall in between the two other groups (20%).\nFinancial impact\nFor some, losing money in an online scam was financially burdensome. Among those who’ve lost money because of an online scam or attack:\n- 30% say it hurt their personal finances a great deal (11%) or a fair amount (19%).\n- Another 27% said it hurt their finances to some extent.\n- But about four-in-ten said this had little (31%) to no harm (11%) on them financially.\nContacting law enforcement\nMost people who’ve been a financial victim to an online scam or attack never contacted the authorities.\nRoughly three-quarters of this group say they have not reported to law enforcement that they lost money from an online scam or attack. A minority of this group – 26% – say they have informed law enforcement.\nBy how much it hurt personal finances\nAmericans who have been significantly harmed financially by an online scam are far more likely to say they informed law enforcement:\n- 42% of those whose finances were hurt a great deal or fair amount reported it.\n- Fewer (24%) of those whose finances were hurt some say they did the same.\n- And just 16% of those whose finances were hurt a little or not at all say they reported it.\nVulnerability to online scams and attacks\nAmid debates about which age groups are most vulnerable to online scams, Americans show greater concern for older adults.\nA vast majority of Americans (84%) say adults 65 and older are extremely or very likely to fall victim to online scams and attacks.\nThis is far higher than the 22% who say this of adults 30 and under. An additional 48% say it is somewhat likely to happen to this age group.\nAmericans do not see education as a big factor in whether someone will fall for an online scam. But a somewhat greater share of U.S. adults say those with lower levels of formal education are vulnerable:\n- 29% say those without a four-year college degree are extremely or very likely to fall victim.\n- 18% say the same of those who have a four-year degree.\n- For both, Americans most commonly say this is somewhat likely to happen.\nBy age\nLarge shares of all age groups say older adults are vulnerable to online scams. About eight-in-ten adults under 30 (82%) – and the same share of those 65 and older – say those 65 and up are extremely or very likely to have this happen to them.\nOlder Americans are more likely than the youngest adults to say adults 30 and under are vulnerable. Just 15% of 18- to 29-year-olds say adults 30 and under are highly likely to fall for one. This is lower than the 27% of those 65 and older and 25% of those 50 to 64 who say this.\nKnowing how to avoid falling for an online scam\nWhen it comes to their own vulnerability, Americans overall feel they are quite knowledgeable in how to detect online scams and attacks.\nMost Americans (71%) say they know at least a fair amount about how to avoid falling for an online scam or attack. This includes 26% who say they know a great deal.\nVery few (10%) report knowing little to nothing, and about one-in-five say they know some.\nBy age\nMajorities across age groups say they know at least a fair amount about how to avoid falling for an online scam or attack, but older Americans are less likely to say this. For example, Americans ages 65 and older are less likely than 18- to 29-year-olds to say this (64% vs. 78%).\nBy race and ethnicity\nThree-quarters of White adults say they know a great deal or fair amount about how to avoid falling for one. This is higher than among Hispanic (59%), Black (66%) and Asian (66%) adults.\nAmericans’ concern about online scams\nNearly all Americans say online scams and attacks are a problem for people in the United States. This includes about eight-in-ten who say they are a major problem and 19% who say they are a minor problem.\nOnly 1% say online scams and attacks are not a problem for people in the U.S.\nBy age\nYounger adults are less likely to say online scams are a big issue, though majorities of all age groups say this. About two-thirds of those ages 18 to 29 (65%) say online scams are a major problem. This compares with nearly nine-in-ten of 50- to 64-year-olds and those 65 and older.\nOnline fraud spans many digital spaces, but the public sees some environments as more of an issue for fraud than others.\nWe asked Americans about eight different types of platforms. About six-in-ten or more say online scams are a major problem on text messages and phone calls, emails and social media. And about a quarter more also say each is a minor problem.\nAmericans are less likely to say online scams are a major problem on the other types of platforms asked about:\n- Between 46% and 50% say this of online shopping, banking and payment sites and apps.\n- About four-in-ten say this of dating or cryptocurrency platforms.\nGo to the Appendix for the demographic breakdown of views about whether online scams are a problem on each type of platform.\nThe role of artificial intelligence in online scams and attacks\nAmericans are becoming more familiar with artificial intelligence (AI) while also growing more concerned about its impact on daily life. When it comes to online scams and attacks, most Americans say AI will make them more frequent.\nIn fact, about seven-in-ten (68%) say the increased use of AI is going to make online scams and attacks more common. Very few say AI will make them less common (4%) or will make no difference (8%). The remaining 20% are unsure.\nGovernment and tech companies’ efforts in reducing online scams and attacks\nFrom awareness campaigns to legislation to AI, the federal government and technology companies use a number of tactics to combat online fraud.\nThe survey asked Americans to rate how each group is faring at reducing the number of online scams and attacks in the U.S. Americans on balance see both more negatively than positively – especially the government:\n- 68% say the federal government is doing a very or somewhat bad job; three-in-ten say it’s doing a good job.\n- 56% say technology companies are doing a bad job at this, versus 42% who express a favorable view of their efforts.\nBy party\nMajorities of both Republicans (66%) and Democrats (72%), including independents who lean to either party, say the federal government is doing a very or somewhat bad job at reducing the amount of online scams and attacks.\nRepublicans and Democrats also share similar views on the job that technology companies are doing. More than half in each group say these companies are not doing well in reducing online scams and attacks in this country. In both cases, Democrats are slightly more likely than Republicans to say this."
    },
    {
      "url": "https://support.microsoft.com/en-us/office/automatically-add-events-from-your-email-to-your-calendar-32e5cf0c-3e65-4870-9ff9-df3683d3fc97",
      "text": "Many different events in your day-to-day life flow through email. From airline tickets to car rental reservations and package delivery information, you receive a vast amount of information in Outlook that you might want to keep track of.\nOutlook automatically retrieves important events from your email for supported senders and adds the items to your calendar so you don't have to.\nImportant: This feature is only available in North America, Asia Pacific, Europe, Australia, UK, Switzerland, India, Japan, Korea, and Latin America.\nNotes:\n-\nEvents from email is available in Outlook, Outlook.com, and Outlook on the web. It can be used only with Microsoft accounts, such as an Outlook.com or Microsoft 365 account.\n-\nThis feature isn't available for accounts in Office 365 operated by 21Vianet, Office 365 Germany, or in Office 365 Government plans.\n-\nSome types of events won't be supported starting in mid-August 2020.\nWhat you'll see\nThe first time Outlook creates an event for you, you'll receive the following message, along with a list of the events being added.\nTips:\n-\nYou don't have to do anything to allow Outlook to add events from your email. If you want to turn off this feature, see changing your event settings.\n-\nPast events or events from unsupported providers won’t be added to your calendar automatically.\nSupported types of events\nOutlook can create events from email that contains the following information:\n-\nFlight reservations\n-\nHotel reservations\n-\nRental car reservations\n-\nPackage deliveries\n-\nBills (This type of event won't be supported starting mid-August)\n-\nDining reservations (This type of event won't be supported starting mid-August)\n-\nEvent reservations - music, sports, or others (This type of event won't be supported starting mid-August)\n-\nService reservations - doctor appointment, car maintenance, or others (This type of event won't be supported starting mid-August)\nFor a full list of supported providers, see Supported senders for events from email in Outlook.\nNotes:\n-\nFlight, car, and hotel reservations are automatically added to your calendar. You can have other events, such as bills and dining reservations, automatically added to your calendar by changing your event settings.\n-\nIf you've selected Bills, Outlook uses machine-learning algorithms to find upcoming bills. It doesn’t access your financial information or track your financial activity to find these events.\n-\nCurrently, the Bills event type is only supported in North America.\nChange your event settings\nYou can turn events from email on or off and choose which information is added automatically through your Outlook on the web or Outlook.com options. You can't change your events from email settings in Outlook for Windows, but a link to the Outlook on the web or Outlook.com options page is included in the email you receive the first time an event is created automatically.\nTip: To find your Outlook on the web address, choose File. On the Info tab under Account Settings, the address is shown under Access this account on the web.\nNote: If the instructions don't match what you see, you might be using an older version of Outlook on the web. Try the Instructions for classic Outlook on the web.\n-\nAt the top of the page, select Settings .\n-\nSelect Calendar > Events from email.\n-\nUnder each event type, select one of the following:\n-\nDon’t show event summaries in email or on my calendar: You won't see summary cards for these events in your inbox and events won't appear on your calendar.\n-\nOnly show event summaries in email: You'll see summary cards for these events in your inbox, but these events won't appear on your calendar.\n-\nShow event summaries in email and on my calendar: You'll see summary cards for these events in your inbox and these events will appear on your calendar.\n-\nBy default, events created from email are marked as private so their details are only visible to you. You can choose to make your events public by unchecking the Mark events as private so only I can see them box.\nRestore Events from email\nIf you notice that Outlook is no longer retrieving the events you've chosen to receive summaries for, Events from email might have been turned off for your account. You can turn them back on by following the steps below.\n-\nAt the top of the page, select Settings .\n-\nSelect Calendar > Events from email.\n-\nIf you see a message in that says \"Events from email aren't turned on for your account.\", select Turn on events from email to start receiving them again.\nNote: After you select Turn on events from email, events won't be created for past messages, nor will email summaries.\nInstructions for classic Outlook on the web\n-\nAt the top of the page, select Settings .\n-\nSelect Options or Mail.\n-\nOn the left sidebar, select Calendar > Events from email.\n-\nDo one of the following:\n-\nTo turn off events from email, choose Don't add events to my calendar from email.\n-\nTo control what events are added to your calendar, check or uncheck the boxes for Flights, Hotel reservations, Car rentals, Package delivery, Dining reservations, Events, or Bills.\nNote: If you're using a Microsoft 365 for business account or other commercial account with Outlook, package delivery information won't be added to your calendar automatically.\n-\nBy default, any events created from email are marked as private so their details are only visible to you. You can choose to make your events public by clearing the Mark events as private so only I can see them box."
    },
    {
      "url": "https://www.ftc.gov/news-events/data-visualizations/data-spotlight/2022/12/who-experiences-scams-story-all-ages",
      "text": "Many people think scams mostly affect older adults. But reports to the FTC’s Consumer Sentinel tell a different story: anyone can be scammed. In fact, reports suggest that many scams are harming younger people more than older adults. While there’s more to the story, the broad theme is that scams affect every age group, but differently.\nIn 2021, Gen Xers, Millennials, and Gen Z young adults (ages 18-59) were 34% more likely than older adults (ages 60 and over) to report losing money to fraud,[1] and some types of fraud stood out. Younger adults reported losses to online shopping fraud – which often started with an ad on social media – far more often than any other fraud type, and most said they simply did not get the items they ordered.[2] Younger adults were over four times more likely than older adults to report a loss on an investment scam.[3] Most of these were bogus cryptocurrency investment opportunities.[4] And this age group reported losing money on job scams at more than five times the rate of older adults. Many college students reported that they were scammed after getting a message at their student email address about a so-called job opportunity.[5] The median individual reported fraud loss by people 18-59 was $500 in 2021.\nWhile older adults were less likely to report losing money to fraud, those 70 and over reported much higher median individual losses. The median reported loss was $800 for people 70-79, and a whopping $1,500 for those 80 and over.[6] But older adults were also much more likely to report fraud they had spotted or encountered – but avoided losing any money to – than people 18-59.[7] And for older adults, different types of scams stood out. In 2021, they were about five times more likely to report losing money on tech support scams than younger adults. Tech support scammers impersonate companies like Apple and Microsoft to trick you into sending money to fix an “urgent” security problem that doesn’t exist. Older adults were also more than twice as likely to report losing money on a prize, sweepstakes, or lottery scam. Prize, sweepstakes, and lottery scams often impersonate a well-known business to trick people into sending money to claim nonexistent winnings. Reports point to these scams as especially costly to people 80 and over – about one out of every three dollars reported lost to fraud by this age group in 2021 was lost to a prize, sweepstakes, and lottery scam.[8]\nReports also point to generational differences in how scammers reach people. On social media, the differences are striking: in 2021, 31% of people 18-59 who reported losing money on a scam said it started on a social media platform; compare that to 15% of people 60 and older. For Gen Z young adults and younger Millennials (ages 18-29), reports suggest social media plays an even larger role – nearly 40% of 2021 fraud loss reports by this age group were to frauds originating on social media. Scams that start with a phone call also show big age differences: in 2021, 24% of older adults who reported losing money to a scam said it started with a phone call, compared to just 10% of younger consumers. The numbers are higher still for people 80 and over – more than 40% of their 2021 loss reports identified a phone call as the contact method.[9]\nThe lesson is clear: no matter your age, learning about scams is important for everyone. By sharing what you know, you can help protect others in your community from scams. To learn more, visit ftc.gov/PassitOn. And for a deeper dive into the FTC’s data on scams and age, read the FTC’s Protecting Older Consumers Report.\n[1] This comparison of older adults and younger adults is normalized against the population size of each age group. The analysis is based on U.S. Census Bureau data for population by age. See U.S. Census Bureau, Annual Estimates of the Resident Population for Selected Age Groups by Sex for the United States (June 2020), available at https://www.census.gov/data/tables/time-series/demo/popest/2010s-national-detail.html. Data provided by the Internet Crimes Complaint Center (IC3) are excluded here and throughout this Spotlight due to differences in the age ranges collected from consumers and differences in report categorization. About 46% of fraud reports filed in 2021 included consumer age information.\n[2] In 2021, 59% of online shopping loss reports by people 18-59 indicated that the order was never received. Excluding reports that did not specify a contact method, 38% of these consumers indicated that the fraud started with an ad, a post, or a message on social media.\n[3] Investment scams refer to fraud reports classified as investment seminars and advice, stocks and commodity futures trading, art, gems and rare coin investments, and miscellaneous investments.\n[4] In 2021, 62% of investment scams loss reports by people 18-59 indicated cryptocurrency as the payment method, compared to 37% of investment scam loss reports by people 60 and older. These figures exclude reports that did not indicate a payment method.\n[5] Job scams often use fake checks to trick people into sending money. People 18-59 were nearly twice as likely as older adults to report a loss on a fake check scam in 2021, and many of these reports were also classified as job scams.\n[6] People 60-69 reported a median individual loss of $520 in 2021.\n[7] In 2021, controlling for population size (see footnote 1), people 60 and older were 68% more likely than people 18-59 to file a fraud report indicating no money was lost. The largest share of 2021 no-loss reports by older adults were about phone scams, and these were most often calls from scammers impersonating businesses and government agencies.\n[8] In 2021, $47 million of the $151 million reported lost to fraud by people 80 and over was lost to prize, sweepstakes, and lottery scams, more than any other age group.\n[9] In 2021, excluding reports that did not indicate a contact method, 41% of loss reports by people 80 and over indicated phone as the contact method, compared to 22% of loss reports by people 60-79. Excluding reports that did not indicate a contact method, 53% of 2021 aggregate reported loss by adults 80 and over were on scams that started with a phone call, compared to 26% of aggregate reported losses by people 60-79."
    }
  ],
  "argos_summary": "A recent survey by the Pew Research Center revealed that about 73% of U.S. adults have fallen victim to online scams, with common types including credit card fraud, online shopping scams, and ransomware attacks. Younger adults, particularly those aged 18 to 59, are more likely to report losing money to fraud compared to older adults, with significant losses stemming from online shopping and investment scams. Cybersecurity experts emphasize the need for vigilance and protective measures, as scammers increasingly exploit online platforms, including calendar invites and multi-factor authentication apps, to deceive users.",
  "argos_id": "7D0WESEHD"
}