{
  "url": "https://www.pcworld.com/article/2874441/espn-and-fox-team-up-for-yet-another-sports-bundle.html",
  "authorsByline": "Ben Patterson",
  "articleId": "8bcb13ed909d41a1bb52ef6dc5a7e05c",
  "source": {
    "domain": "pcworld.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "San Francisco",
      "city": "San Francisco",
      "coordinates": {
        "lat": 37.7790262,
        "lon": -122.419906
      }
    }
  },
  "imageUrl": "https://www.pcworld.com/wp-content/uploads/2025/08/ESPN-Fox-bundle.jpg?quality=50&strip=all&w=1024",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T16:39:20+00:00",
  "addDate": "2025-08-11T19:43:09.180082+00:00",
  "refreshDate": "2025-08-11T19:43:09.180083+00:00",
  "score": 1.0,
  "title": "ESPN and Fox team up for yet another sports bundle",
  "description": "A just-announced package will bundle Fox’s new streaming service with the upcoming ESPN streamer for $40 a month. Ring any bells?",
  "content": "Both the long-awaited, standalone streaming version of ESPN and Fox’s new streaming service are launching on the same day later this month. Which one should you choose? You might not have to.\n\nThere’s long been chatter that ESPN and Fox could offer their new streaming wares in a bundle, and now it’s official: On October 2, you’ll be able to sign up for both the new streaming ESPN and Fox One together for $40 a month, a savings of $10/month versus getting them individually. The individual ESPN and Fox One services will each launch individually on August 21.\n\nThe bundle includes the “ultimate” tier of ESPN, which offers all of ESPN’s linear networks (ESPN, ESPN2, ESPNEWS, and so on) along with all EPSN broadcasts on ABC, ESPN+, ESPN3, SECN+, and ACCNX. On its own, ESPN Ultimate costs $30 a month.\n\nAlso in the package is Fox One, the new Fox streaming service that boasts all of Fox’s network brands, including a truckload of sports-oriented properties: Fox Sports, FS1, and FD2. Fox One is slated to cost $20 a month by itself.\n\nThe new ESPN/Fox bundle brings to mind another sports package, albeit one that never got off the ground: Venu Sports, a venture that would have seen ESPN-parent Disney, Warner Bros., and Fox join forces for a $40-a-month sports streaming service.\n\nVenu Sports got ensnared by a federal injunction following a lawsuit filed by competing streamer Fubo, and the three parties behind Venu chose to scuttle the bundle back in January rather than face the legal headaches involved in getting the bundle over regulatory hurdles.\n\nAs for the new ESPN/Fox bundle, the rival networks pitched it as a vehicle for “delivering premium experiences across platforms and meeting consumers where they are—anytime, anywhere.”\n\nOf course, the new bundle will offer more than just sports. Also in the package are such Fox networks as Fox News, Fox Business, Fox Weather, Fox Nation, Fox local stations, and the Fox Network.\n\nWhile ESPN plus Fox sports programming for $40 a month sounds a tad more enticing than $30 a month for ESPN on its lonesome, that’s still a stiff monthly tab, especially if you’re signed up for other streaming services on top of that.",
  "medium": "Article",
  "links": [
    "https://www.pcworld.com/article/2780496/espn-for-cord-cutters-is-finally-coming-heres-when-and-for-how-much.html",
    "https://www.pcworld.com/article/2574125/disney-warners-and-fox-drop-venu-sports-bundle.html",
    "https://go.skimresources.com?id=111346X1569483&xs=1&url=https://espnpressroom.com/us/press-releases/2025/08/espn-dtc-and-fox-one-to-launch-combined-bundle-offer&xcust=2-1-2874441-1-0-0-0-0&sref=https://www.pcworld.com/article/2874441/espn-and-fox-team-up-for-yet-another-sports-bundle.html"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Fox Sports",
      "weight": 0.13499534
    },
    {
      "name": "Fox sports programming",
      "weight": 0.13350135
    },
    {
      "name": "such Fox networks",
      "weight": 0.1298842
    },
    {
      "name": "Fox",
      "weight": 0.1292061
    },
    {
      "name": "Fox One",
      "weight": 0.12718093
    },
    {
      "name": "Fox Nation",
      "weight": 0.12671676
    },
    {
      "name": "Fox Weather",
      "weight": 0.12625921
    },
    {
      "name": "Fox Business",
      "weight": 0.12612268
    },
    {
      "name": "Fox News",
      "weight": 0.12593865
    },
    {
      "name": "Fox local stations",
      "weight": 0.12098638
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Sports"
    },
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.9150390625
    },
    {
      "name": "/Arts & Entertainment/TV & Video/Online Video",
      "score": 0.83447265625
    },
    {
      "name": "/Arts & Entertainment/TV & Video/TV Networks & Stations",
      "score": 0.83056640625
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.546875
    }
  ],
  "sentiment": {
    "positive": 0.33777618,
    "negative": 0.101641886,
    "neutral": 0.5605819
  },
  "summary": "ESPN and Fox are partnering to offer their new streaming services in a bundle, with the launch of both ESPN and Fox One on October 2 for $40 per month, a savings of $10 per month. The \"ultimate\" tier of ESPN will offer all of its linear networks, including ESPN Ultimate, along with all EPSN broadcasts on ABC, ESPN3, SECN+, and ACCNX. Fox One will also offer Fox Sports, FS1, and FD2. The new ESPN/Fox bundle will also include Fox News, Fox Business, Fox Weather, Fox Nation, and the Fox Network. The news follows a failed attempt to combine ESPN-parent Disney, Warner Bros., and Fox to create a sports streaming service called Venu.",
  "shortSummary": "ESPN and Fox will launch their new streaming services ESPN Ultimate and Fox One together for $40/month on October 2, offering comprehensive sports programming and other options for $10/month.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "f89ab0b338d0453e8b0cdf67f7cf2919",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.pcworld.com/article/2574125/disney-warners-and-fox-drop-venu-sports-bundle.html",
      "text": "Sacked in the endzone? Down for the count? Struck out swinging? Go ahead and pick your favorite sport metaphor, but the bottom line is that Venu Sports is done.\nIn a joint statement, Venu Sports backers Disney, Fox, and Warner Bros. Discovery announced they are dropping their plans for the ambitious streaming service, which would have bundled some of the most popular sports channels into a single—and somewhat pricey—package.\n“After careful consideration, we have collectively agreed to discontinue the Venu Sports joint venture and not launch the streaming service,” the statement says, as reported by Variety.\n“In an ever-changing marketplace, we determined that it was best to meet the evolving demands of sports fans by focusing on existing products and distribution channels. We are proud of the work that has been done on Venu to date and grateful to the Venu staff, whom we will support through this transition period.”\nThe move marks a sudden, decisive end to the Venu Sports saga, made all the more dramatic given that only days ago, it appeared Venu might launch after all.\nA joint venture between entertainment titans Disney, Fox, and Warner Bros. Discovery, Venu Sports was poised to shake up the streaming industry with a $42.99-a-month service that bundled the likes of ESPN, FS1, BTN, TNT, TBS, and other top sports offerings.\nThose plans came to a screeching halt last August when streaming service Fubo—a sports-focused live TV service that had a lot to lose if Venu jumped into the game—filed a lawsuit objecting to the deal and a federal judge followed up with an injunction against Venu’s impending launch.\nVenu Sports was looking on the ropes (sorry, the sports clichés are just too irresistible), but then a thunderbolt hit earlier this week: Fubo settled its Venu lawsuit after making a deal with Disney-owned Hulu to combine their live streaming TV services.\nThe end of Fubo’s lawsuit appear to pave the way for a possible Venu Sports revival, although in reality, several hurdles remained. The federal injunction was still in place, the Justice Department had filed an amicus brief in support of Fubo’s previous objections, and other big streaming players—such as DirectTV—made it clear they were still adamantly opposed to Venu opening its doors.\nIn the end, Disney, Fox, and Warners probably saw too many legal headaches in Venu’s future, and chose—you guessed it—to punt.\nSo, where does all this leave streaming sports fans? I’m sure our own Jared Newman will share his thoughts soon, but if you were hoping that a Venu Sports bundle would simplify the thicket of sports streaming options, that ain’t happening."
    },
    {
      "url": "https://www.pcworld.com/article/2780496/espn-for-cord-cutters-is-finally-coming-heres-when-and-for-how-much.html",
      "text": "After years of teases, hints, and vague promises, standalone streaming ESPN is finally, really coming, and now we have a launch date as well as pricing details.\nDisney said the new streaming service, called simply ESPN, will go live on August 21 — just in time for the 2025-26 NFL season.\nPricing for the new ESPN streamer were previously announced back in May, and the price points vary whether you get it on a standalone basis or as part of a bundle.\nTo stream an “ultimate” version of ESPN that includes all its linear networks as well as broadcasts on ABC, it will cost you $29.99 a month, or $299.99 a year. If that sounds steep, it is, and our own Jared Newman has already deemed streaming ESPN to be a “ripoff.” But hey, it’ll soon be here if you want it.\nYou’ll also be able to get ESPN in a bundle along with Disney+ and Hulu with ads for $35.99 a month, while an ESPN bundle with ad-free Disney+ and Hulu will run you $44.99 a month.\nAs part of a special introductory offer, Disney will serve up the with-ads version of the Disney+, Hulu, and ESPN bundle for $29.99 for the first 12 months.\nThe “ultimate” tier of the new ESPN streaming service will include—at last—everything ESPN, including all its linear networks (ESPN, ESPN2, ESPNU, SECN, ESPNEWS, and ESPN Deportes) along with all ESPN broadcasts on ABC, ESPN+, ESPN3, SECN+, and ACCNX.\nYou’ll also get such signature ESPN shows as SportsCenter, Get Up, First Take, NFL Live, The Pat McAfee Show, Pardon the Interruption, College GameDay, and NBA Today.\nThat’s a big change from the ESPN+ streaming service, which only ever offered a sliver of ESPN’s linear content. Indeed, plenty of ESPN+ signups have found themselves caught off guard when they learned that SportsCenter, Monday Night Football (save for occasional one-off games), and other key ESPN shows weren’t included.\nSpeaking of ESPN+, that service will morph into what Disney is calling “select” ESPN. The “select” tier will cost $11.99 a month, or $119.99 a year, while bundles go for $16.99 a month (with ad-supported Disney+ and Hulu) or $26.99/month (with the ad-free versions of the latter two streamers).\nThose who are still ESPN+ subscribers when the new ESPN streaming service arrives will automatically be moved over to the “select” version of the new service, meaning the old ESPN+ is effectively going away.\nNews of the ESPN’s launch date comes just a day after Fox announced a launch date and pricing for its own new streamer, Fox One. The upcoming Fox service will kick off on August 21–the same day as ESPN–and cost $20 a month.\nThe arrival of a standalone streaming ESPN has been years in the making, with Disney execs finally confirming the service last year.\nUp until now, the only way to get the full-on ESPN experience has been through a cable or live streaming TV service, neither of which come cheap. There was ESPN+, but as I mentioned earlier, it was a poor substitute for the real deal.\nUpdated on August 6 with a launch date for the new ESPN streaming service."
    }
  ],
  "argos_summary": "ESPN and Fox are launching their standalone streaming services on August 21, with a bundled option available starting October 2 for $40 a month, saving $10 compared to individual subscriptions. The bundle includes ESPN's ultimate tier, featuring all linear networks and broadcasts, and Fox One, which encompasses various Fox networks and sports properties. This new offering comes after the cancellation of the Venu Sports joint venture, which aimed to create a comprehensive sports streaming package but faced legal challenges.",
  "argos_id": "7RD0BE78G"
}