{
  "url": "https://www.cnbc.com/2025/08/11/tuesdays-big-stock-stories-whats-likely-to-move-the-market-in-the-next-trading-session.html",
  "authorsByline": "Jason Gewirtz",
  "articleId": "9b1b3e55ec2046d790cddf58bd6dd95f",
  "source": {
    "domain": "cnbc.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NJ",
      "county": "Bergen County",
      "city": "Englewood Cliffs",
      "coordinates": {
        "lat": 40.8853773,
        "lon": -73.9523597
      }
    }
  },
  "imageUrl": "https://image.cnbcfm.com/api/v1/image/108123222-1743203806909-gettyimages-2207351784-mms21291_ocxecovu.jpeg?v=1754952119&w=1920&h=1080",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T23:37:47+00:00",
  "addDate": "2025-08-11T23:41:51.149163+00:00",
  "refreshDate": "2025-08-11T23:41:51.149166+00:00",
  "score": 1.0,
  "title": "Tuesday's big stock stories: What’s likely to move the market in the next trading session",
  "description": "Despite positive news on the tariff front, stocks closed lower Monday. Traders are bracing for key U.S. inflation data on Tuesday.",
  "content": "Stocks @ Night is a daily newsletter delivered after hours, giving you a first look at tomorrow and last look at today. Sign up for free to receive it directly in your inbox. Here's what CNBC TV's producers were watching on Monday and what's on the radar for Tuesday's session. Circle The CEO joins \"Squawk Box\" in the 6 a.m. ET hour with Joe Kernen and Andrew Ross Sorkin. The digital and crypto fintech company had its IPO in early June. Circle Internet stock is up 420% since then. CRCL 1M mountain Circle Internet stock over the past month. Live with James Bullard St. Louis Federal Reserve President James Bullard has been mentioned as a possible candidate to chair the central bank. He'll join \"Squawk Box\" live in the 8 a.m. ET hour. Big data ahead We get a look at inflation with the consumer price index out at 8:30 a.m. ET Tuesday. The consensus calls for a 0.2% hike month-over-month and a 2.8% hike year over year. Going into the number, the 10-year Treasury is yielding 4.279%. The 2-year is at 3.766%. The 1-year is at 3.936%. The 6-month is yielding 4.121%. The 3-month is yielding 4.258%. The 1-month is at 4.346%. The Fidelity Corporate Bond ETF (FCOR) has a dividend yield of 4.43% tonight. The SPDR Bloomberg High Yield Bond ETF (JNK) is paying 6.6% as of tonight. CoreWeave reports Watch for CoreWeave 's numbers and the stock reaction on \"Closing Bell Overtime\" with Morgan Brennan and Jon Fortt. The stock is up 172% in three months. The IPO was March 28. Since then, the stock is up 250%. Boeing July orders and deliveries CNBC's Airline reporter Phil LeBeau will have Boeing 's July order and delivery numbers and reaction at 11a.m. ET. The stock is 7% from its July 29 high. Boeing is flat over the last month. BA BA YTD mountain Boeing shares year to date Cannabis Big highs across the board today. This after the Trump administration is reportedly considering big changes for the industry that could lead to more profits. CNBC Contributor and cannabis watcher Tim Seymour, who is the portfolio manager of the Amplify Seymour Cannabis ETF, said Monday on \"WorldWideExchange\" and again on \"Fast Money\" : \"This opens many doors.\" Tilray Brands was up 42% today. It's still 53% from last year's high. Trulieve was up 38% today; the stock 42% from the October high. Canopy Growth , up 26% today, is still 78% from last year's high. Seymour's ETF, CNBS, was up 28% today. It's 50% from its October high. China President Donald Trump delaying tariffs for another 90 days while trade talks continue. The iShares MSCI China ETF (MCHI) is up 5% in a month, 3.3% from the October high. The iShares China Large-Cap ETF (FXI) is up 7% in three months, 4.6% from last year's high. The Chinese tech-focused KraneShares CSI China Internet ETF (KWEB) is up 5% in a month. It is 10% from its October high. Gold Trump also said, no tariffs on gold . The VanEck Gold Miners ETF (GDX) was down slightly today but it is up 5% in a week. It hit a high last week. Since the announcement of the tariffs at the White House back on April 2, gold the commodity is up 7%. Live, local and late breaking Local TV ownership group Sinclair said this evening it is exploring strategic alternatives after news broke that Nexstar Media Group was in talks to buy Tegna . Sinclair is up 27% after hours. It is down 6% year to date. Tegna shot up 30% today. The stock is up 9% year to date. Nexstar was up 4% today. The stock is up 23% year to date. On the night beat, I'm Jason Gewirtz. Good night and good luck.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Circle Internet stock",
      "weight": 0.07230188
    },
    {
      "name": "last year",
      "weight": 0.068835154
    },
    {
      "name": "Big highs",
      "weight": 0.06760937
    },
    {
      "name": "China President Donald Trump",
      "weight": 0.06647287
    },
    {
      "name": "Boeing July orders",
      "weight": 0.060788162
    },
    {
      "name": "St. Louis Federal Reserve President James Bullard",
      "weight": 0.060091108
    },
    {
      "name": "last look",
      "weight": 0.059529684
    },
    {
      "name": "today",
      "weight": 0.057853375
    },
    {
      "name": "month",
      "weight": 0.057062488
    },
    {
      "name": "year",
      "weight": 0.056609318
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Business"
    },
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.9951171875
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.97802734375
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.40966796875
    }
  ],
  "sentiment": {
    "positive": 0.46053967,
    "negative": 0.06983732,
    "neutral": 0.469623
  },
  "summary": "CNBC's St. Louis Federal Reserve President James Bullard has been mentioned as a possible candidate to chair the central bank. Meanwhile, Circle Internet stock has risen 420% since its IPO in June. The consumer price index is expected to rise by 0.2% month-over-month and a 2.8% year over year. Boeing's July order and delivery numbers and reaction will be featured on \"Squawk Box\". Meanwhile, China's President Donald Trump delays tariffs for another 90 days while trade talks continue. The iShares MSCI China ETF (MCHI) is up 5% in a month, 3.3% from its October high. Local TV ownership group Sinclair is reportedly exploring strategic alternatives to buy Tegna.",
  "shortSummary": "Stocks @ Night features notable gains, with gains across sectors including Circle Internet, Sinclair, and Boeing, while inflation and gold prices remain volatile.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "1b497e95f2c142b79a7818c84dc17ac0",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Stocks @ Night is a daily newsletter summarizing market movements and key events. Circle Internet's stock has surged 420% since its IPO in June, while CoreWeave's stock is up 250% since its March IPO. Upcoming economic data includes the consumer price index, with expectations of a 0.2% monthly increase. Cannabis stocks saw significant gains following potential regulatory changes, and Sinclair is exploring strategic alternatives amid acquisition talks.",
  "argos_id": "82056NQM6"
}