{
  "url": "https://www.thestreet.com/restaurants/burger-king-makes-major-move-fans-will-love-after-franchise-bankruptcies",
  "authorsByline": "Fernanda Tronco",
  "articleId": "14c6241017ad4c5ba4bdef41fb60b3a4",
  "source": {
    "domain": "thestreet.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://www.thestreet.com/.image/ar_1.91%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_1200/MjEzNDM4MzUyNTMwMDg5NDIz/burger-king-2-lead.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T01:27:00+00:00",
  "addDate": "2025-08-12T01:31:37.895403+00:00",
  "refreshDate": "2025-08-12T01:31:37.895404+00:00",
  "score": 1.0,
  "title": "Burger King makes major move fans will love after franchise bankruptcies",
  "description": "After multiple closures, Burger King is making massive changes to win back customers.",
  "content": "After multiple closures, Burger King is making massive changes to win back customers.\n\nOver the last few years, Burger King has faced a series of Chapter 11 bankruptcy filings from several of its franchisees, reflecting the broader economic challenges and consumer slowdown that have disrupted the overall fast-food industry.\n\nIn response, Restaurant Brands International (RBI), Burger King's parent company, has made a bold move that its late-night fans have long been waiting for, creating a win-win situation for both the brand and its customers.\n\nThe fast-food chain's financial troubles continued into 2025, with Consolidated Burger Holdings, which operated 57 Burger King locations across Florida and Georgia, filing for bankruptcy in April.\n\nThese setbacks have led to mass restaurant closures, contributing to a 1.2% decline in the fast-food chain's net restaurant growth.\n\nHowever, RBI is no stranger to the ups and downs of the food industry. With over 70 years in business, the company is leaning into its experience by making strategic moves to revitalize Burger King and better position it for long-term growth.\n\nTo get Burger King back on track, RBI (QSR) completed a $1 billion all-cash deal to acquire all of Carrols Restaurant Group's shares in January 2024. Carrols was Burger King's largest U.S. franchisee, operating 1,022 restaurants across multiple states.\n\nThis acquisition is part of RBI's \"Reclaim to Flame\" program, first announced in September 2022, which aims to accelerate Burger King's growth in the U.S. through a $700 million investment by the end of 2028.\n\nThe initiative includes increasing advertising, digital enhancements, restaurant remodeling and relocations, kitchen equipment upgrades, and operational improvements.\n\nRBI claims that remodeling Carrols locations contributed to Burger King's same-store sales growth by nearly 3% in the second quarter of fiscal 2025.\n\n\"The outperformance is driven by high-level operations and significant investments in remodels, which have yielded good returns. Regarding refranchising, we started earlier than planned, aiming to place restaurants with excellent local operators. We intend to move at a reasonable pace while ensuring quality operators take over,\" said RBI CEO Joshua Kobza in an earnings call.\n\nAs part of this strategy, RBI plans to refranchise between 50 and 100 of the acquired Carrols units in 2025, further accelerating its transformation efforts.\n\nTo increase traffic and sales while meeting consumer demand, Burger King announced that it will extend operating hours at more than 1,200 restaurants nationwide.\n\nOver the past few months, the fast-food chain has gradually extended its hours at various locations where it has seen high demand during late-night hours. RBI noted that this move contributed to an increase in the fast-food chain's U.S. comparable sales by 1.5% during the second quarter of fiscal 2025.\n• Taco Bell expands value menu with new items under $3\n\nBurger King is not the only fast-food chain to make this shift; it appears to be part of a larger trend in the industry.\n\nCompetitors such as McDonald's (MCD) and White Castle have extended their hours to stay open until midnight or later at many locations nationwide, while other major chains like IHOP (DIN) , Denny's (DENN) , Jack in the Box (JACK) , and Whataburger have returned to 24/7 service.",
  "medium": "Article",
  "links": [
    "https://www.thestreet.com/investing/stocks/veteran-fund-manager-unveils-eye-popping-s-p-500-forecast",
    "https://www.thestreet.com/quote/DENN",
    "https://www.thestreet.com/restaurants/popular-breakfast-restaurant-chain-menu-adds-deal-amid-closures",
    "https://www.thestreet.com/dictionary/b/chapter-11-bankruptcy",
    "https://www.thestreet.com/newsletters?utm_source=article&utm_medium_top&utm_campaign=amazing_race",
    "https://www.thestreet.com/quote/JACK",
    "https://www.thestreet.com/retail/hershey-creates-first-ever-seasonal-new-candy-ahead-of-halloween",
    "https://www.thestreet.com/restaurants/mcdonalds-announces-major-store-change-to-win-back-customers",
    "https://www.thestreet.com/restaurants/burger-king-menu-adds-experimental-new-items-better-than-the-whopper",
    "https://www.thestreet.com/restaurants/applebees-hits-first-major-milestone-since-2023-after-sales-declines",
    "https://www.thestreet.com/retail/walmart-is-offering-free-burger-king-whoppers-to-rewards-members-",
    "https://www.thestreet.com/restaurants/popular-fast-food-burger-chain-aims-major-comeback-amid-closures",
    "https://www.thestreet.com/restaurants/popular-burger-chain-taps-mcdonalds-exec-to-destroy-rivals",
    "https://www.thestreet.com/quote/QSR",
    "https://www.thestreet.com/restaurants/burger-king-menu-brings-unexpected-international-collaboration-to-us",
    "https://www.thestreet.com/restaurants/taco-bell-expands-value-menu-with-new-items-under-3",
    "https://www.thestreet.com/restaurants/chick-fil-a-unveils-fall-menu-with-new-sandwich-drinks-and-more",
    "https://www.thestreet.com/quote/MCD",
    "https://www.thestreet.com/restaurants/iconic-fast-food-burger-chain-announces-late-night-hours-expansion",
    "https://www.thestreet.com/quote/DIN",
    "https://www.thestreet.com/dictionary/earnings-call",
    "https://www.thestreet.com/restaurants/mcdonalds-brings-back-nostalgia-with-new-menu-meal-and-shake"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Burger King",
      "weight": 0.11597325
    },
    {
      "name": "Consolidated Burger Holdings",
      "weight": 0.08306021
    },
    {
      "name": "RBI CEO Joshua Kobza",
      "weight": 0.0718732
    },
    {
      "name": "Burger Kings largest U.S. franchisee",
      "weight": 0.07159244
    },
    {
      "name": "Carrols locations",
      "weight": 0.07009531
    },
    {
      "name": "RBI",
      "weight": 0.069196865
    },
    {
      "name": "57 Burger King locations",
      "weight": 0.06830556
    },
    {
      "name": "mass restaurant closures",
      "weight": 0.06805778
    },
    {
      "name": "Burger Kings growth",
      "weight": 0.06733531
    },
    {
      "name": "restaurant remodeling",
      "weight": 0.067331225
    }
  ],
  "topics": [
    {
      "name": "Bankruptcy"
    }
  ],
  "categories": [
    {
      "name": "Business"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.9921875
    }
  ],
  "sentiment": {
    "positive": 0.69288516,
    "negative": 0.13797806,
    "neutral": 0.16913682
  },
  "summary": "Burger King is making significant changes to win back customers after a series of Chapter 11 bankruptcy filings from several of its franchisees over the past few years. The company, Restaurant Brands International (RBI), has made a bold move to revitalize the brand and position it for long-term growth. The move follows a $1 billion acquisition of all of Carrols Restaurant Group's shares, which was Burger King's largest U.S. franchisee, operating 1,022 restaurants across multiple states. The acquisition is part of RBI's \"Reclaim to Flame\" program, which aims to accelerate Burger King’s growth in the US. To increase sales and traffic, Burger King will extend operating hours at over 1,200 restaurants nationwide.",
  "shortSummary": "Burger King is making significant changes to attract customers and grow revenue, including extending operating hours and refranchising units, after multiple franchise bankruptcies.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "7004c350ace44db5817c25fc74641f89",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Burger King is implementing significant changes to recover from recent financial struggles, including multiple franchisee bankruptcies and restaurant closures. Its parent company, Restaurant Brands International, has acquired Carrols Restaurant Group for $1 billion and launched the \"Reclaim to Flame\" program, which includes a $700 million investment to enhance advertising, remodel restaurants, and improve operations. Additionally, Burger King is extending operating hours at over 1,200 locations to boost sales, contributing to a 1.5% increase in comparable sales in the second quarter of fiscal 2025.",
  "argos_id": "89NYBC2QY"
}