{
  "url": "https://www.yahoo.com/news/articles/hiker-traversing-around-antoine-peak-020400026.html",
  "authorsByline": "Mathew Callaghan, The Spokesman-Review, Spokane, Wash.",
  "articleId": "eed6ba7b3d034763a872f6660679e90d",
  "source": {
    "domain": "yahoo.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T02:04:00+00:00",
  "addDate": "2025-08-12T02:27:33.769459+00:00",
  "refreshDate": "2025-08-12T02:27:33.769462+00:00",
  "score": 1.0,
  "title": "Hiker traversing around Antoine Peak rescued by firefighters",
  "description": "Aug. 11—A hiker who sustained an ankle injury on Antoine Peak was rescued by Spokane Valley firefighters Saturday morning. The Spokane Valley Fire Department received a 911 call from the injured hiker about 11:40 a.m. and were able to ping their approximate location. The department coordinated with the Spokane Police Department to use a police drone to get an aerial view of where they thought ...",
  "content": "Aug. 11—A hiker who sustained an ankle injury on Antoine Peak was rescued by Spokane Valley firefighters Saturday morning.\n\nThe Spokane Valley Fire Department received a 911 call from the injured hiker about 11:40 a.m. and were able to ping their approximate location. The department coordinated with the Spokane Police Department to use a police drone to get an aerial view of where they thought the hiker could be.\n\nOnce crews got a more accurate sense of where the hiker was, they used a whistle to pinpoint their exact location. At 12:36 p.m., a little less than an hour after the initial 911 call, five firefighters arrived and carted the injured hiker out on a one-wheel stretcher designed for rugged terrain. The hiker's injury is not life-threatening.\n\nPatrick Erickson, the Spokane Valley Fire Department's spokesperson, said in addition to the five Valley firefighters, a crew from District 9 also assisted.\n\n\"This is a reminder that while we do have beautiful natural area all around us, it can always potentially be dangerous, so make sure you're prepared if you're going to be out, especially over the next couple of days with the weather like it is,\" Erickson said. \"Make sure you have plenty of water with you and a way to contact people if you are going to be out and about in areas where we might not be able to find you as quickly as if you were in town, or other areas where there's more folks around.\"",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Spokane Valley firefighters",
      "weight": 0.12353196
    },
    {
      "name": "Spokane Valley",
      "weight": 0.10927051
    },
    {
      "name": "Hiker",
      "weight": 0.106814824
    },
    {
      "name": "beautiful natural area",
      "weight": 0.09186494
    },
    {
      "name": "other areas",
      "weight": 0.08943896
    },
    {
      "name": "firefighters",
      "weight": 0.08315233
    },
    {
      "name": "Antoine Peak",
      "weight": 0.0829885
    },
    {
      "name": "areas",
      "weight": 0.0793033
    },
    {
      "name": "The Spokane Valley Fire Department",
      "weight": 0.077820964
    },
    {
      "name": "the injured hiker",
      "weight": 0.06288276
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Weather"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Local News",
      "score": 0.97265625
    },
    {
      "name": "/Law & Government/Public Safety/Emergency Services",
      "score": 0.86865234375
    },
    {
      "name": "/Sensitive Subjects/Accidents & Disasters",
      "score": 0.8271484375
    }
  ],
  "sentiment": {
    "positive": 0.12179184,
    "negative": 0.5549705,
    "neutral": 0.3232376
  },
  "summary": "A hiker who sustained an ankle injury on Antoine Peak was rescued by Spokane Valley firefighters. The department used a police drone to locate the hiker's location and transported him out on a one-wheeled stretcher. The injury is not life-threatening.",
  "shortSummary": "Sparking Valley firefighters rescued a hiker from the summit of Antoine Peak with a one-wheel stretcher, highlighting the dangers of heights like this.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "c2d634e7f6fe48f0a8df303855d3922d",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "A hiker with an ankle injury on Antoine Peak was rescued by Spokane Valley firefighters after a 911 call at 11:40 a.m. on Saturday. The rescue team utilized a police drone for aerial assistance and pinpointed the hiker's location using a whistle. The hiker was safely evacuated on a one-wheel stretcher, and their injury was reported as non-life-threatening. Fire department officials emphasized the importance of being prepared when hiking in natural areas.",
  "argos_id": "8GUN7484G"
}