{
  "url": "https://www.usatoday.com/story/entertainment/music/2025/08/12/taylor-swift-announces-12th-era-what-to-know-about-life-of-a-showgirl/71713227007/",
  "authorsByline": "Bryan West",
  "articleId": "9f7daa8ecefc4382b725f0fb497ea674",
  "source": {
    "domain": "usatoday.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "VA",
      "county": "Fairfax County",
      "city": "McLean",
      "coordinates": {
        "lat": 38.9342888,
        "lon": -77.1776327
      }
    }
  },
  "imageUrl": "https://www.usatoday.com/gcdn/authoring/images/smg/2024/12/09/SMGW/76869156007-99-178363.jpeg?crop=5694,3203,x0,y296&width=3200&height=1801&format=pjpg&auto=webp",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T04:13:16+00:00",
  "addDate": "2025-08-12T04:21:00.949260+00:00",
  "refreshDate": "2025-08-12T04:21:00.949262+00:00",
  "score": 1.0,
  "title": "Taylor Swift announces new album: What to know about 'The Life of a Showgirl'",
  "description": "Taylor Swift will appear on Travis Kelce's \"New Heights\" podcast Aug. 13 after she dropped the title of her 12th album.",
  "content": "• Taylor Swift teased a new project through various hints and appearances.\n• Swift will appear on the \"New Heights\" podcast with Travis Kelce, possibly revealing details about the project.\n• Rumors of a new Taylor Swift album have circulated among music industry insiders.\n\nAfter a drought of 555 days, a new dazzling Taylor Swift era has entered the chat. Introducing: \"The Life of a Showgirl.\"\n\nSwift confirmed the news on a \"New Heights\" podcast teaser released at 12:12 a.m. ET on Aug. 12. The singer pulled out a blurred out album cover for her new project.\n\n\"This is my brand-new album, 'The Life of a Showgirl,'\" Swift says.\n\nTravis adds, \"TS12,\" while Jason is heard screaming with excitement. The podcast will air Aug. 13 and likely provide details about her diamond dripping era.\n\nTucked on the shelf behind the couple is a jar of friendship bracelets and a new logo on an orange square with the yellow letters \"T.S.\"\n\nIn another promo video, Swift sits next to Travis and compliments his light blue sweater, \"Such a nice color on you.\"\n\n\"Yes, I know. It's the color of your eyes, sweetie,\" Travis replies. \"It's why we match so well.\"\n\n\"We're about to do a f***ing podcast,\" she says smiling.\n\nEarlier this morning, Taylor Nation, her in-house marketing team, posted like a canary in a coal mine, alerting the fandom to a 12th chapter. \"Thinking about when she said 'See you next era…' ❤️‍🔥,\" the account posted with a carousel of 12 photos included fellow singer Sabrina Carpenter.\n\nThe \"New Heights\" podcast shared a photo of Travis Kelce and Jason Kelce next to a silhouette of Swift. The glittery background orange is the same background seen on a countdown clock on her website three hours before the announcement and also on her letter to fans announcing the ownership of her masters.\n\n'See you next era'\n\nKnown for planting Easter eggs in everything from lyrics to fashion to concert graphics, Swift started teasing the new project in April 2024 when she debuted \"The Tortured Poets Department\" at her Paris concert. Eagle-eyed Swifties noticed her countdown turned orange before the opening sequence and her \"Karma\" door at the close of the show was orange. She debuted a fiery bodysuit seen on the first page of her official Eras Tour book next to a letter that read: \"See you next era...\"\n\nHer team placed the book in a glass case at the Country Music Hall of Fame and Museum in Nashville. Each year, the display inside the Taylor Swift Education Center gets a refresh. In April, curators cracked the book open to its first page — a seemingly deliberate choice, as the exhibit’s theme this year is \"Fearless.\" Many expected a page from that era, considering the display features her Roberto Cavalli \"silver noodle\" dress, Christian Louboutin boots and the Swarovski-crystal guitar her family bedazzled. In her letter, Swift writes: \"There’s nothing I hate more than doing what I’ve always done.\"\n\nFor the past four years, Swift has followed a steady formula: two rerecordings one year, one original album the next. Now, fans suspect the next chapter is about to break that cycle.\n\nHits Daily Double, a music insider publication that reports on industry rumors, got the Swiftie fandom buzzing when they published an article about Justin Bieber's album \"Swag.\"\n\nThe original text said: \"Justin’s new giant adds another rocket to the Lipmans' global arsenal, which already features monsters Drake, Morgan, Post and the left-field phenomenon KPop Demon Hunters at the top of the streaming charts. What's more, seismic rumblings of a new Taylor set keep the Republic team as aggressive as ever.\"\n\nThe article was quickly updated with the last line rephrased as: \"And there's always Taylor.\"\n\nFans, like Tiktok influencer Jake Deyton, took to social media to express their excitement. Deyton pointed out that Swift's usual cycle for an album announcement is a single in August or September, followed by an album release in October or November.\n\nA Swedish DJ may have sounded the alarm prematurely in April about an upcoming Swift project.\n\nThe Swedish branch of Swift's label Universal Music Group posted a quickly deleted clip of Jacob Criborn, part of the DJ team Nause, talking about the inspiration behind his \"Canelloni Macaroni\" remix. Criborn talked about working with Erik Arvinder, a Swedish composer and violinist.\n\n\"He did a string arrangement of 25. He got some brass guys playing trumpet, saxophone, trombone,\" he said in remarks translated from Swedish through Google Translate. \"And they were like, 'We're just going to finish Taylor Swift's record and then we'll jump on 'Canelloni.' No, but we really kind of pushed for this song because it deserves it.\"\n\nMore breadcrumbs to \"TS12\" include her Instagram tease in Miami for the Eras Tour, when she held her cat Meredith in Hard Rock Stadium's A12 section. In March, she praised Selena Gomez and Benny Blanco's new album, using 12 d's in a caption on her Instagram story: \"oh my godddddddddddd.\" In the letter announcing the ownership of her masters, she had 12 i's in \"thiiiiiiiiiiiis.\" The single numbers in the letter of 4, 6 and 2 add up to 12. The letterhead included a new \"TS\" diamond logo that would make Elizabeth Taylor proud.\n\nThe announcement also comes in perfect time for Kelce's 13th year playing football.\n\nDon't miss any Taylor Swift news; sign up for the free, weekly newsletter This Swift Beat.\n\nFollow Taylor Swift reporter Bryan West on Instagram, TikTok and X as @BryanWestTV.",
  "medium": "Article",
  "links": [
    "https://www.instagram.com/p/DBRLN_ROZab/",
    "https://www.usatoday.com/story/entertainment/music/2024/10/15/taylor-swift-book-target-announcement-easter-egg/75683487007/",
    "https://www.tiktok.com/@jakedeyton1/video/7527412910738378039",
    "https://www.instagram.com/p/DNNzLCmxb4f/",
    "https://www.youtube.com/watch?v=C0Cn5FGmk0Y&ab_channel=NauseVEVO",
    "https://www.usatoday.com/story/entertainment/music/2025/02/28/taylor-swift-chiefs-season-three/80307292007/",
    "https://www.instagram.com/bryanwesttv/",
    "https://click.e.usatoday.com/?qs=2642a44bf02e6ab33722544cb619c6afbb60105828bfbbf6f6fcbf8fda1f04f17a92f464312188395dc009a21b4591c6aa5a0f615e9cf3c18251aa61b6a24fb5",
    "https://www.usatoday.com/story/entertainment/music/2024/05/09/taylor-swift-paris-surprise-songs/73514618007/",
    "https://www.instagram.com/p/DNN0isCNpBb/",
    "https://www.usatoday.com/story/entertainment/music/2024/10/27/sabrina-carpenter-joins-taylor-swift-in-new-orleans-on-her-one-night-off/75820200007/",
    "https://www.usatoday.com/story/entertainment/music/2025/05/30/taylor-swift-announces-owns-first-six-albums-reputation/71695163007/",
    "https://www.youtube.com/@newheightshow",
    "https://www.usatoday.com/picture-gallery/entertainment/music/2025/04/18/taylor-swift-fearless-dress-country-music-hall-of-fame/83156572007/",
    "https://www.tiktok.com/@bryanwesttv",
    "https://www.usatoday.com/story/entertainment/music/2025/03/23/taylor-swift-endorses-selena-gomez-album/77696295007/",
    "https://www.usatoday.com/story/entertainment/music/2025/07/10/justin-bieber-album-swag/84540182007/",
    "https://www.usatoday.com/entertainment/music/taylor-swift/",
    "https://profile.tennessean.com/newsletters/this-swift-beat/",
    "https://twitter.com/bryanwesttv",
    "https://puzzles.usatoday.com/"
  ],
  "labels": [
    {
      "name": "Non-news"
    },
    {
      "name": "Pop Culture"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Taylor Swift",
      "weight": 0.09417599
    },
    {
      "name": "new album",
      "weight": 0.08208775
    },
    {
      "name": "Taylor Swift reporter Bryan West",
      "weight": 0.08070135
    },
    {
      "name": "Swift",
      "weight": 0.0793846
    },
    {
      "name": "a new Taylor Swift album",
      "weight": 0.06762037
    },
    {
      "name": "a new dazzling Taylor Swift era",
      "weight": 0.065865815
    },
    {
      "name": "Taylor Nation",
      "weight": 0.061021887
    },
    {
      "name": "Elizabeth Taylor",
      "weight": 0.060955357
    },
    {
      "name": "Taylor",
      "weight": 0.060628712
    },
    {
      "name": "next era",
      "weight": 0.058983304
    }
  ],
  "topics": [
    {
      "name": "Music"
    }
  ],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.990234375
    },
    {
      "name": "/Arts & Entertainment/Music & Audio/Pop Music",
      "score": 0.88427734375
    },
    {
      "name": "/News/Gossip & Tabloid News/Other",
      "score": 0.476318359375
    }
  ],
  "sentiment": {
    "positive": 0.2554861,
    "negative": 0.21201883,
    "neutral": 0.532495
  },
  "summary": "Taylor Swift has announced a new album, \"The Life of a Showgirl,\" after a period of speculation about the release. The announcement was made via a \"New Heights\" podcast teaser and a blurred out album cover. The podcast, likely featuring Travis Kelce and Jason Kelce, will air on Aug. 13 and likely provide details about Swift's new project. Rumors about the album have been circulating among music industry insiders. The album is expected to be released in October or November.",
  "shortSummary": "Taylor Swift announced her new album, \"The Life of a Showgirl,\" via hints and appearances, and will appear on the \"New Heights\" podcast with Travis Kelce.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "ddc235690f32456781cb146aaa99917e",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.usatoday.com/story/entertainment/music/2025/03/23/taylor-swift-endorses-selena-gomez-album/77696295007/",
      "text": "Taylor Swift endorses new music on Instagram: 'I LOVE THIS ALBUM SO MUCH'\nEvery once in a while, Taylor Swift makes a resounding endorsement on Instagram, and on Saturday, she applauded longtime friend Selena Gomez and her fiancé Benny Blanco.\nIn all capital letters, the Eras Tour singer posted an Instagram Story with a photo of Gomez and Blanco's new album, \"I Said I Loved You First,\" with the caption, “I LOVE THIS ALBUM SO MUCH OH MY GODDDDDDDDDDDD.”\nThe couple has been on an extensive media tour. In an episode of “Hot Ones,” Blanco told host Sean Evans that Gomez turned him into a Swiftie: \"Obviously, I was aware of Taylor Swift's music, but I wasn't a true Swiftie. Now we're in the car singing Taylor Swift's songs from like 10 years ago, and I feel free.\"\nLong live the Eras Tour with our enchanting book\nSwift has been in her lying-low era, skipping the iHeartRadioAwards, where she received “Tour of the Century” honors. She hasn’t posted to her Instagram timeline since her final tour performance in Vancouver last December, making it the longest social media suppression since she disappeared in 2016 prior to the release of her album “Reputation.”\nLast year, Swift threw support behind her “Fortnight” collaborator Post Malone’s album “F-1 Trillion” and Sabrina Carpenter’s “Short n’ Sweet” album. She also told her legion of fans to go see Ryan Reynolds' movie \"Deadpool & Wolverine\" and Zoë Kravitz's film \"Blink Twice.\"\nDon't miss any Taylor Swift news; sign up for the free, weekly newsletter This Swift Beat.\nFollow Bryan West, the USA TODAY Network's Taylor Swift reporter, on Instagram, TikTok and X as @BryanWestTV."
    },
    {
      "url": "https://www.youtube.com/@newheightshow",
      "text": "- Svenska\n- Deutsch\n- English\n- Español\n- Français\n- Italiano\n- Alla språk\n- Afrikaans\n- azərbaycan\n- bosanski\n- català\n- Čeština\n- Cymraeg\n- Dansk\n- Deutsch\n- eesti\n- EnglishUnited Kingdom\n- EnglishUnited States\n- EspañolEspaña\n- EspañolLatinoamérica\n- euskara\n- Filipino\n- FrançaisCanada\n- FrançaisFrance\n- Gaeilge\n- galego\n- Hrvatski\n- Indonesia\n- isiZulu\n- íslenska\n- Italiano\n- Kiswahili\n- latviešu\n- lietuvių\n- magyar\n- Melayu\n- Nederlands\n- norsk\n- o‘zbek\n- polski\n- PortuguêsBrasil\n- PortuguêsPortugal\n- română\n- shqip\n- Slovenčina\n- slovenščina\n- srpski (latinica)\n- Suomi\n- Tiếng Việt\n- Türkçe\n- Ελληνικά\n- беларуская\n- български\n- кыргызча\n- қазақ тілі\n- македонски\n- монгол\n- Русский\n- српски\n- Українська\n- ქართული\n- հայերեն\n- עברית\n- اردو\n- العربية\n- فارسی\n- አማርኛ\n- नेपाली\n- मराठी\n- हिन्दी\n- অসমীয়া\n- বাংলা\n- ਪੰਜਾਬੀ\n- ગુજરાતી\n- ଓଡ଼ିଆ\n- தமிழ்\n- తెలుగు\n- ಕನ್ನಡ\n- മലയാളം\n- සිංහල\n- ไทย\n- ລາວ\n- မြန်မာ\n- ខ្មែរ\n- 한국어\n- 日本語\n- 简体中文\n- 繁體中文\n- 繁體中文香港\n- Svenska\n- Deutsch\n- English\n- Español\n- Français\n- Italiano\n- Alla språk\n- Afrikaans\n- azərbaycan\n- bosanski\n- català\n- Čeština\n- Cymraeg\n- Dansk\n- Deutsch\n- eesti\n- EnglishUnited Kingdom\n- EnglishUnited States\n- EspañolEspaña\n- EspañolLatinoamérica\n- euskara\n- Filipino\n- FrançaisCanada\n- FrançaisFrance\n- Gaeilge\n- galego\n- Hrvatski\n- Indonesia\n- isiZulu\n- íslenska\n- Italiano\n- Kiswahili\n- latviešu\n- lietuvių\n- magyar\n- Melayu\n- Nederlands\n- norsk\n- o‘zbek\n- polski\n- PortuguêsBrasil\n- PortuguêsPortugal\n- română\n- shqip\n- Slovenčina\n- slovenščina\n- srpski (latinica)\n- Suomi\n- Tiếng Việt\n- Türkçe\n- Ελληνικά\n- беларуская\n- български\n- кыргызча\n- қазақ тілі\n- македонски\n- монгол\n- Русский\n- српски\n- Українська\n- ქართული\n- հայերեն\n- עברית\n- اردو\n- العربية\n- فارسی\n- አማርኛ\n- नेपाली\n- मराठी\n- हिन्दी\n- অসমীয়া\n- বাংলা\n- ਪੰਜਾਬੀ\n- ગુજરાતી\n- ଓଡ଼ିଆ\n- தமிழ்\n- తెలుగు\n- ಕನ್ನಡ\n- മലയാളം\n- සිංහල\n- ไทย\n- ລາວ\n- မြန်မာ\n- ខ្មែរ\n- 한국어\n- 日本語\n- 简体中文\n- 繁體中文\n- 繁體中文香港\nInnan du fortsätter till YouTube\nVi använder cookies och data för att\n- leverera och underhålla Googles tjänster\n- spåra avbrott och skydda mot spam, bedrägeri och otillåten användning\n- mäta målgruppsengagemang och webbplatsstatistik så att vi kan analysera hur våra tjänster används och förbättra tjänsternas kvalitet.\nOm du väljer knappen Godkänn alla använder vi även cookies och data för att\n- utveckla och förbättra nya tjänster\n- leverera annonser och mäta hur effektiva de är\n- visa anpassat innehåll utifrån dina inställningar\n- visa anpassade annonser utifrån dina inställningar\nOm du väljer knappen Avvisa alla använder vi inte cookies i dessa ytterligare syften.\nInnehåll och annonser utan anpassning påverkas bland annat av vad du tittar på för tillfället och din plats (annonser visas utifrån din ungefärliga plats). Innehåll och annonser med anpassning kan även omfatta sådant som videorekommendationer, en anpassad YouTube Hem-sida och anpassade annonser utifrån tidigare aktivitet, till exempel vad du tittar på och söker efter på YouTube. Vi använder även cookies och data för att anpassa upplevelsen efter lämplighet för din målgrupp, om tillämpligt.\nVälj knappen Fler alternativ för mer information, till exempel om hur du hanterar dina integritetsinställningar. Du kan även besöka g.co/privacytools när som helst."
    },
    {
      "url": "https://www.usatoday.com/story/entertainment/music/2025/07/10/justin-bieber-album-swag/84540182007/",
      "text": "Justin Bieber drops surprise album 'Swag' after global billboard tease\nJustin Bieber just dropped his first new album in four years.\nMere hours after the singer teased the album on billboards in cities from Reykjavík, Iceland, to New York City, Atlanta and Los Angeles with the album cover, \"Swag\" dropped on music streaming platforms early Friday, July 11. Listen here.\nThe R&B and rap-tinged pop album features 21 tracks, including collaborations with rappers Gunna, Cash Cobain, Sexyy Red and Lil B, as well as comedian Druski and gospel singer and pastor Marvin Winans.\nThe singer, whose last album was October 2021's \"Justice,\" shared a flurry of photos and videos promoting the album on the afternoon of July 10, including from a photoshoot with wife Hailey Bieber and their nearly 1-year-old son, Jack Blues Bieber, on his Instagram story. The 31-year-old posted images depicting the track list that includes titles like \"Go Baby,\" \"Swag,\" \"Zuma House,\" \"Forgiveness\" and \"Dadz Love.\" The album is his first since becoming a father.\nBieber confirmed the album by reposting an Instagram story from the Kid Laroi that read, \"If you don't listen to this album when it drops we can't be friends.\" The message was written above the monochrome \"Swag\" artwork. \"Love you broski,\" Bieber wrote in his re-post.\nHe also reposted an Instagram story from music industry pal Cole Bennett, who shared the \"Swag\" cover art alongside the message, \"It's almost here. Best jbeeeeeski album yet.\" Bennett added, \"I have no words, I really don't. I actually do but there's too many.\"\nJustin Bieber 'Swag' track list\nThe following titles are on \"Swag\":\n- \"All I Can Take\"\n- \"Daisies\"\n- \"Yukon\"\n- \"Go Baby\"\n- \"Things You Do\"\n- \"Butterflies\"\n- \"Way It Is\" featuring Gunna\n- \"First Place\"\n- \"Soulful\" featuring Druski\n- \"Walking Away\"\n- \"Glory Voice Memo\"\n- \"Devotion\" featuring Dijon\n- \"Dadz Love\" featuring Lil B\n- \"Therapy Session\" featuring Druski\n- \"Sweet Spot\" featuring Sexyy Red\n- \"Standing on Business\" featuring Druski\n- \"405\" featuring Cash Cobain and Eddie Benjamin\n- \"Swag\"\n- \"Zuma House\"\n- \"Too Long\"\n- \"Forgiveness\" by Marvin Winans\nJustin Bieber recently spoke up about 'anger issues'\nWhile the pop star has been quieter on the music front in recent years, he has been very active on social media. Bieber has raised eyebrows with numerous cryptic posts in recent months, including an Instagram story in March where he reflected on feeling unworthy of his success.\nIn June, Bieber posted white text on a purple background saying that \"people keep telling me to heal,\" but \"don't you think if I could have fixed myself I would have already?\"\n\"I know I'm broken,\" the post said. \"I know I have anger issues. I tried to do the work my whole life to be like the people who told me I needed to be fixed like them. And it just keeps making me more tired and more angry.\"\nHe continued: \"The harder I try to grow, the more focussed (sic) on myself I am. Jesus is the only person who keeps me wanting to make my life about others. Because honestly I'm exhausted with thinking about myself lately aren't you?\"\nContributing: Brendan Morrow and Taijuan Moorman, USA TODAY"
    },
    {
      "url": "https://www.usatoday.com/story/entertainment/music/2025/02/28/taylor-swift-chiefs-season-three/80307292007/",
      "text": "Travis Kelce to return to NFL, signaling Taylor Swift's third season supporting Chiefs\nLooks like the third season of Taylor Swift goes to Arrowhead is returning in September after the singer's boyfriend Travis Kelce announced another year with the Kansas City Chiefs.\nThe tight end told ESPN's Pat McAfee via text, \"I'm not (expletive) leaving. The show goes on.\"\nOn Thursday evening, the NFL also sent out a combined Instagram post with Kelce's podcast account \"New Heights.\" The photo of a smiling No. 87 has the text: \"From the desk of @tkelce: IT'S TIME FOR YEAR 13.\"\nThe schedule for the new season has not been released and typically doesn't come out until around May. With the exception of the Super Bowl, Swift only showed up to Arrowhead Stadium games last year where she is familiar with the staff and security (and fans don't boo her).\nA return of the Eras Tour singer means Swifties can get excited to see what her new year of NFL fashion will bring.\nA special edition about Swift and Kelce\n'Cause she's cheer captain'\nThe Chiefs' record over the past two seasons is 19-4 with the \"You Belong With Me\" singer in the crowd.\nLast year she attended 10 games with the red-and-gold going 9-1:\n- Feb. 9: Eagles beat the Chiefs at the Super Bowl 40-22\n- Jan. 26: Chiefs beat the Bills 32-29\n- Jan. 18: Chiefs beat the Texans 23-14\n- Dec. 21, 2024: Chiefs beat the Texans 27-19\n- Nov. 29, 2024: Chiefs beat the Raiders 19-17\n- Nov. 10, 2024: Chiefs beat the Broncos 16-14\n- Nov. 4, 2024: Chiefs beat the Buccaneers 30-24\n- Oct. 7, 2024: Chiefs beat the Saints 26-13\n- Sept. 15, 2024: Chiefs beat the Bengals 26-25\n- Sept. 5, 2024: Chiefs beat the Ravens 27-20\nAfter setting social media on fire by showing up to her first game on Sept. 24, 2023, Swift went to 13 games — the Chiefs won 10 and lost three matchups — for the 2023-2024 season.\n- Feb. 11, 2024: Chiefs beat the 49ers 25-22\n- Jan. 28, 2024: Chiefs beat the Ravens 17-10\n- Jan. 21, 2024: Chiefs beat the Bills 27-24\n- Jan. 13, 2024: Chiefs beat the Dolphins 26-7\n- Dec. 31, 2023: Chiefs beat the Bengals 25-17\n- Dec. 25, 2023: Raiders beat the Chiefs 20-14\n- Dec. 17, 2023: Chiefs beat the Patriots 27-17\n- Dec. 10, 2023: Bills beat the Chiefs 20-17\n- Dec. 3, 2023: Packers beat the Chiefs 27-19\n- Oct. 22, 2023: Chiefs beat the Chargers 31-17\n- Oct. 12, 2023: Chiefs beat the Broncos 19-8\n- Oct. 1, 2023: Chiefs beat the Jets 23-20\n- Sept. 24, 2023: Chiefs beat the Bears 41-10\nApex Marketing, a 10-year-old firm that provides sponsorship and brand analytics for entertainment and sports venue owners and commercial brands, found that Swift brought $992 million worth of publicity to the NFL over the past two years.\n\"This is just media buzz,\" Eric Smallwood, president of Apex, told USA TODAY. \"If you were a brand and you wanted to go and buy media for your product or service, you would have to spend this amount to garner this level of media exposure.\"\nDon't miss any Taylor Swift news; sign up for the free, weekly newsletter This Swift Beat.\nFollow Bryan West, the USA TODAY Network's Taylor Swift reporter, on Instagram, TikTok and X as @BryanWestTV."
    },
    {
      "url": "https://www.usatoday.com/story/entertainment/music/2024/10/27/sabrina-carpenter-joins-taylor-swift-in-new-orleans-on-her-one-night-off/75820200007/",
      "text": "Sabrina Carpenter joins Taylor Swift onstage in New Orleans on her one night off\nTaylor Swift's Saturday night show in New Orleans came with surprises. In an orange dress, the singer told the crowd she changed the rules of her surprise set. She was going to sing a song not in her discography, but in her friend Sabrina Carpenter's music catalog.\n\"I think tonight I'm going to do something completely different, which is that I'm going to sing a song that's not mine, but it's somebody that I really love,\" the singer said to the 65,000 people in attendance before strumming \"Espresso\" by Carpenter. She finished after a couple of lines and paused.\n\"So you really love that song as much as I do?\" Swift asked, smiling. \"I know I'm just going on a tangent because I love my friend and I'm just so proud of Sabrina and the year she's had.\"\nThe Eras Tour crowd erupted in the Caesars Superdome as Swift grabbed her phone from a stage hand and put Carpenter on speaker.\n\"I'm really somewhere really loud, I'm in New Orleans on the Eras Tour,\" Swift said into the phone. \"I just wanted to call and tell you that I sang a little bit of 'Espresso' and they said every word so loud. And I just wanted to say we all love you so much. What are you doing? Why aren't you here with us?\"\nOver the phone, Carpenter said, \"I'm somewhere where everyone is screaming so loud.\"\n\"I'm somewhere where people are screaming so loud,\" Swift answered. \"Can you come down to the stadium real quick? Ball park how long would that take you?\"\n\"It would probably take me five seconds,\" Carpenter responded. The crowd cheered and then held their breath until Carpenter appeared on the platform in the diamond part of the stage. She strutted down the catwalk in her white dress.\nSwift strummed an acoustic version of \"Espresso\" and sang harmony with Carpenter.\n\"Holy (expletive) New Orleans!\" Carpenter said after the first chorus.\n\"Can I do it?\" Swift asked in reference to the first line of the second verse, \"I'm working late, cause I'm a singer.” She then dove into part of her song \"Is It Over Now?\" from \"1989 (Taylor's Version)\" and then \"Please, Please, Please\" from Carpenter's new album.\n\"She had literally one day off,\" Swift said at the end of the triple mashup, \"She is on tour. This is crazy she came to perform for us. Will you please give it up for Sabrina Carpenter?\"\nCarpenter walked down the catwalk and disappeared into the stage.\nSwift moved to the piano to perform a mashup of \"Hits Different\" from \"Midnights\" and \"Welcome to New York\" from \"1989 (Taylor's Version).\"\nThe singer-songwriter has one more performance in New Orleans. The tour will wrap on Dec. 8 in Vancouver, Canada.\nDon't miss any Taylor Swift news; sign up for the free, weekly newsletter This Swift Beat.\nFollow Bryan West, the USA TODAY Network's Taylor Swift reporter, on Instagram, TikTok and X as @BryanWestTV."
    },
    {
      "url": "https://www.usatoday.com/story/entertainment/music/2024/10/15/taylor-swift-book-target-announcement-easter-egg/75683487007/",
      "text": "Taylor Swift's Eras book Target announcement had an Easter egg. Did you catch it?\n(Updated to correct details about the bonus materials included with the new physical versions of \"The Tortured Poets Department: The Anthology.\")\nTaylor Swift made a video announcement Tuesday morning that she is releasing a book and album exclusively at Target, and Swifties are slowing down the frames to see if any clues are hidden in the 30-second ad. And one era of the tour that the video highlights has fans excited.\n\"We'll be kicking off the final leg of The Eras Tour this week, which is hard to comprehend,\" she wrote on an Instagram post.\nThe video flips through the book's 256 pages (2+5+6 adds up to 13, a number associated with the Swift universe and how she's made announcements in the past). Her announcement day also adds up to 13 (10/15/24, 1+0+1+5+2+4=13). And yes, Swifties do this every time there is news from Miss Americana and why they were convinced Super Bowl 58 was the lucky one.\nThe coffee table read appears to go in chronological order of eras by the first version of the show, before she scrambled the set list and added the \"Tortured Poets\" section in Paris: \"Lover,\" \"Fearless,\" \"Evermore\" and \"Reputation.\"\nHigh resolution photos taken by her company TAS Management coat the pages along with song titles and lyrics in the order of the year one set list: \"Marjorie,\" \"Champagne Problems,\" \"You had a speech, you're speechless, love slipped beyond your reaches.\" The video slows down on \"Reputation,\" the album fans hope she'll announce a rerecord for during the final leg of the tour.\n\"reeaally loving that the page turning slows to a stop at the reputation era and it basically zooms in on the details …. this is a taylor swift easter egg if i’ve ever seen one,\" said @inthemotelbar13 on X, formerly Twitter.\n\"Did anyone else notice the only pictures from the book shown in this video are from Reputation? 🧐,\" @blessedswiftie shared on X.\nBook it to Target\nThe book is coming exclusively to Target, which has worked with the singer throughout her career and served as the go-to store for additional versions of albums. The store will have physical copies on Nov. 29th and offer online orders on Nov. 30.\n\"Excited to announce that The Official Eras Tour Book, filled with my own personal reflections, never-before-seen behind the scenes photos, all the magical memories you guys brought every single night,\" Swift wrote on Instagram.\nThe singer also announced she will release all 31 songs of \"The Tortured Poets Department: The Anthology\" on vinyl and CD. When her 11th era album was released on April 19, the singer separated the 31 tracks into two albums and she's only released physical copies of the first album, or 16 songs. This vinyl for $59.99 or CD for $17.99 will include a brand-new poster and four bonus acoustic songs.\nThese releases have similarities with The Beatles Anthology. From the fall of 1995 to the fall of 1996, the band created a multimedia project of three double albums, a book and an eight-episode television documentary series. Fans spotted film crews at the London shows in August and anticipate a documentary is next.\nHer three-hour show kicks off again Friday in Miami. She has 18 concerts left in five cities and will officially wrap on Dec. 8 in Vancouver, Canada.\nDon't miss any Taylor Swift news; sign up for the free, weekly newsletter This Swift Beat.\nFollow Bryan West, the USA TODAY Network's Taylor Swift reporter, on Instagram, TikTok and X as @BryanWestTV."
    },
    {
      "url": "https://www.usatoday.com/story/entertainment/music/2024/05/09/taylor-swift-paris-surprise-songs/73514618007/",
      "text": "Paris acoustic set: Taylor Swift sings songs from 'Tortured Poets' on Eras Tour\nPARIS, France — No need to draw a map on your bedroom ceiling of Taylor Swift's secret songs in Paris, France. After a two-month break, the singer continued her surprise, acoustic set inside La Défense Arena. The full list of surprise songs from Year 1 and the songs not included in any show are below.\nWith boyfriend Travis Kelce in the crowd on the final night in Paris, Taylor Swift did two mash-ups on her guitar and piano acoustic songs.\n\"Can you believe this is the 87th show?\" the singer asked punctuating the number that is also on the back of Kelce's jersey.\nDuring the surprise set, she fused \"The Alchemy\" from \"The Tortured Poets Department\" with \"Treacherous\" from \"Red (Taylor's Version).\" She blew him a kiss as he watched from his suite above La Défense Arena. She then did a mash-up of \"Begin Again\" from \"Red (Taylor's Version)\" and \"Paris\" from \"Midnights\" on the piano.\n'Hey Stephen,' did you catch night three's songs?\nSwift brought the crowd back to her second era for night three on the guitar.\n\"So I couldn't help but notice how loudly you guys were singing along to the songs from the 'Fearless' album so I thought maybe I would sing one of my favorite songs from the 'Fearless' album,\" she said before performing \"Hey Stephen\" from \"Fearless (Taylor's Version).\"\nShe then played \"Maroon\" from \"Midnights\" on the piano.\nPopular mash-up returns on night two\nOn night two, Swift strummed \"Is It Over Now?\" from \"1989 (Taylor's Version)\" on the guitar before mashing the bridge with \"Out of the Woods.\"\n\"There used to be rules for the acoustic section and now I've decided that I can do whatever I want,\" Swift said.\nAnd on the piano, she played, \"My Boy Only Breaks His Favorite Toys\" from \"The Tortured Poets Department.\"\nNight one surprise set in 'Paris'\n\"There's a song that I've been wanting to play in the acoustic set on the Eras Tour ever since I wrote it,\" Swift said to the crowd of 40,000 plus fans. \"I was only going to play for the very first time in one specific city.\"\nShe then strummed on the guitar and sang \"Paris\" from \"Midnights.\"\nHer piano song was the first secret song was \"loml\" from Swift's brand-new album, \"The Tortured Poets Department.\"\nLive from Paris: Taylor Swift's Eras Tour begins again in France\nYear 1 of Eras Tour surprise set songs\nSwift performed 17 international shows in 2024.\n- Singapore, Mar. 9: \"Tim McGraw\"/\"Cowboy Like Me\" and \"Mirrorball\"/\"Epiphany\"\n- Singapore, Mar. 8: \"Sparks Fly\"/\"Gold Rush\" and \"False God\"/\"Slut!\"\n- Singapore, Mar. 7: \"Death By A Thousand Cuts\"/\"Babe\" and \"Fifteen\"/\"You're On Your Own Kid\"\n- Singapore, Mar. 4: \"Foolish One\"/\"Tell Me Why\" and \"This Love\"/\"Call It What You Want\"\n- Singapore, Mar. 3: \"Long Story Short\"/\"The Story of Us\" and \"Clean\"/\"Evermore\"\n- Singapore, Mar. 2: \"Mine\"/\"Starlight\" and \"I Don't Wanna Live Forever\"/\"Dress\"\n- Sydney, Australia, Feb. 26: \"Would’ve, Could’ve, Should’ve\"/\"Ivy\" and \"Forever and Always\"/\"Maroon\"\n- Sydney, Australia, Feb. 25: \"Is It Over Now?\"/\"I Wish You Would\" and \"Haunted\"/\"Exile\"\n- Sydney, Australia, Feb. 24: \"Should’ve Said No\"/“You’re Not Sorry” and \"New Year’s Day\"/“Peace”\n- Sydney, Australia, Feb. 23: \"How You Get the Girl\" and \"White Horse\"/\"Coney Island\" ft. Sabrina Carpenter\n- Melbourne, Australia, Feb. 18: \"Come Back...Be Here\"/\"Daylight\" and \"Teardrops On My Guitar\"\n- Melbourne, Australia, Feb. 17: \"Getaway Car\"/\"August\"/\"The Other Side of the Door\" and \"This Is Me Trying\"\n- Melbourne, Australia, Feb. 16: \"Red” and \"You’re Losing Me\"\n- Tokyo, Feb. 10: “Come In With The Rain” and “You’re On You’re Own, Kid”\n- Tokyo, Feb. 9: \"Superman\" and \"The Outside\"\n- Tokyo, Feb. 8: \"Eyes Open\" and \"Electric Touch\"\n- Tokyo, Feb. 7: \"Dear Reader\" and \"Holy Ground\"\nSwift performed 66 shows in 2023:\n- São Paulo, Nov. 26: \"Say Don't Go\" and \"It's time to go\"\n- São Paulo, Nov. 25: \"Safe & Sound\" and \"Untouchable\"\n- São Paulo, Nov. 24: \"Now That We Don't Talk\" and \"Innocent\"\n- Rio de Janeiro, Nov. 20: \"ME!\" and \"So It Goes…\"\n- Rio de Janeiro, Nov. 19: \"Dancing With Our Hands Tied\" and \"Bigger Than the Whole Sky\"\n- Rio de Janeiro, Nov. 17: \"Stay Beautiful\" and \"Suburban Legends\"\n- Buenos Aires, Nov. 12: \"Better Than Revenge\" and \"Slut!\"\n- Buenos Aires, Nov. 11: \"Is It Over Now?\"/\"Out of the Woods\" and \"End Game\"\n- Buenos Aires, Nov. 9: \"The Very First Night\" and \"Labyrinth\"\n- Mexico City, Aug. 27: \"Afterglow\" and \"Maroon\"\n- Mexico City, Aug. 26: \"Cornelia Street\" and \"You're On Your Own, Kid\"\n- Mexico City, Aug. 25: \"Tell Me Why\" and \"Snow on the Beach\"\n- Mexico City, Aug. 24: \"I Forgot That You Existed\" and \"Sweet Nothing\"\n- Los Angeles, Aug. 9: \"New Romantics\" and \"New Year's Day\"\n- Los Angeles, Aug. 8: \"I Know Places\" and \"King of My Heart\"\n- Los Angeles, Aug. 7: \"Dress\" and \"Exile\"\n- Los Angeles, Aug. 5: \"Death By A Thousand Cuts\" and \"You're On Your Own, Kid\"\n- Los Angeles, Aug. 4: \"Our Song\" and \"You Are In Love\"\n- Los Angeles, Aug. 3: \"I Can See You\" and \"Maroon\"\n- Santa Clara, California, July 29: \"Stay Stay Stay\" and \"All of the Girls You've Loved Before\"\n- Santa Clara, California, July 28: \"Right Where You Left Me\" ft. Aaron Dessner and \"Castles Crumbling\"\n- Seattle, July 23: \"Message In A Bottle\" and \"Tied Together With A Smile\"\n- Seattle, July 22: \"This Is Why We Can't Have Nice Things\" and \"Everything Has Changed\"\n- Denver, July 15: \"Starlight\" and \"Back To December\"\n- Denver, July 14: \"Picture To Burn\" and \"Timeless\"\n- Kansas City, Missouri, July 8: \"Last Kiss\" and \"Dorothea\"\n- Kansas City, Missouri, July 7: \"Never Grow Up\" and \"When Emma Falls in Love\"\n- Cincinnati, July 1: \"Ivy\" ft. Aaron Dessner, \"I Miss You, I’m Sorry\" ft. Gracie Abrams and \"Call It What You Want\"\n- Cincinnati, June 30: \"I'm Only Me When I'm With You\" and \"Evermore\"\n- Minneapolis, June 24: \"Dear John\" and \"Daylight\"\n- Minneapolis, June 23: \"Paper Rings\" and \"If This Was A Movie\"\n- Pittsburgh, June 17: \"Seven\" ft. Aaron Dessner and \"The Story of Us\"\n- Pittsburgh, June 16: \"Mr. Perfectly Fine\" and \"The Last Time\"\n- Detroit, June 10: \"All You Had To Do Was Stay\" and \"Breathe\"\n- Detroit, June 9: \"Haunted\" and \"I Almost Do\"\n- Chicago, June 4: \"Hits Different\" and \"The Moment I Knew\"\n- Chicago, June 3: \"You All Over Me\" ft. Maren Morris and \"I Don't Wanna Live Forever\"\n- Chicago, June 2: \"I Wish You Would\" and \"The Lakes\"\n- East Rutherford, New Jersey, May 28: \"Welcome To New York\" and \"Clean\"\n- East Rutherford, New Jersey, May 27: \"Holy Ground\" and \"False God\"\n- East Rutherford, New Jersey, May 26: \"Getaway Car\" ft. Jack Antonoff and \"Maroon\"\n- Foxborough, Massachusetts, May 21: \"I Think He Knows\" and \"Red\"\n- Foxborough, Massachusetts, May 20: \"Question...?\" and \"Invisible\"\n- Foxborough, Massachusetts, May 19: \"Should've Said No\" and \"Better Man\"\n- Philadelphia, May 14: \"Hey Stephen\" and \"The Best Day\"\n- Philadelphia, May 13: \"Forever & Always\" and \"This Love\"\n- Philadelphia, May 12: \"Gold Rush\" and \"Come Back...Be Here\"\n- Nashville, Tennessee, May 7: \"Would've, Could've, Should've\" ft. Aaron Dessner and \"Mine\"\n- Nashville, Tennessee, May 6: \"Out of the Woods\" and \"Fifteen\"\n- Nashville, Tennessee, May 5: \"Sparks Fly\" and \"Teardrops On My Guitar\"\n- Atlanta, April 30: \"I Bet You Think About Me\" and \"How You Get The Girl\"\n- Atlanta, April 29: \"High Infidelity\" and \"Gorgeous\"\n- Atlanta, April 28: \"The Other Side of the Door\" and \"Coney Island\"\n- Houston, April 23: \"Begin Again\" and \"Cold as You\"\n- Houston, April 22: \"A Place In This World\" and \"Today Was A Fairytale\"\n- Houston, April 21: \"Wonderland\" and \"You're Not Sorry\"\n- Tampa, Florida, April 15: \"Mad Woman\" ft. Aaron Dessner and \"Mean\"\n- Tampa, Florida, April 14: \"The Great War\" ft. Aaron Dessner and \"You're On Your Own Kid\"\n- Tampa, Florida, April 13: \"Speak Now\" and \"Treacherous\"\n- Arlington, Texas, April 2: \"Jump Then Fall\" and \"The Lucky One\"\n- Arlington, Texas, April 1: \"Death By a Thousand Cuts\" and \"Clean\"\n- Arlington, Texas, March 31: \"Sad Beautiful Tragic\" and \"Ours\"\n- Las Vegas, March 25: \"Cowboy Like Me\" ft. Marcus Mumford and \"White Horse\"\n- Las Vegas, March 24: \"Our Song\" and \"Snow on the Beach\"\n- Glendale, Arizona, March 18: \"State of Grace\" and \"This Is Me Trying\"\n- Glendale, Arizona, March 17: \"Mirrorball\" and \"Tim McGraw\"\nSongs Swift has never performed on Eras Tour\n- \"Taylor Swift\" (debut album): \"Mary's Song\" and \"A Perfectly Good Heart\"\n- \"Fearless\": \"The Way I Loved You,\" \"Change,\" \"Superstar,\" \"We Were Happy,\" \"That's When,\" \"Don't You\" and \"Bye Bye Baby\"\n- \"Red\": \"Girl At Home,\" \"Ronan,\" \"Forever Winter\" and \"Run\"\n- \"1989\": \"Sweeter Than Fiction\"\n- \"Reputation\": \"I Did Something Bad\"\n- \"Lover\": \"London Boy,\" \"Soon You'll Get Better\" and \"It's Nice to Have a Friend\"\n- \"Folklore\": \"Hoax\"\n- \"Evermore\": \"Happiness\" and \"Closure\"\n- \"Midnights\": \"Glitch\"\n- \"The Tortured Poets Department\": \"The Tortured Poets Department,\" \"My Boy Only Breaks His Favorite Toys,\" \"So Long, London,\" \"Fresh Out The Slammer,\" \"Florida!!!\" \"Guilty as Sin?\" \"I Can Fix Him (No Really I Can),\" \"The Alchemy\" and \"Clara Bow\"\n- \"The Tortured Poets Department: The Anthology\": \"The Black Dog,\" \"imgonnagetyouback,\" \"The Albatross,\" \"Chloe or Sam or Sophia or Marcus,\" \"How Did It End?\" \"I Hate It Here,\" \"thanK you aIMee,\" \"I Look in People's Windows,\" \"The Prophecy,\" \"Cassandra,\" \"Peter,\" \"The Bolter,\" \"Robin,\" and \"The Manuscript.\"\nDon't miss any Taylor Swift news; sign up for the free, weekly newsletter This Swift Beat.\nFollow Taylor Swift reporter Bryan West on Instagram, TikTok and X as @BryanWestTV."
    }
  ],
  "argos_summary": "Taylor Swift has announced her new album titled 'The Life of a Showgirl,' confirmed during a teaser on the 'New Heights' podcast with Travis Kelce. The album marks a significant return after a 555-day hiatus, and fans are buzzing with excitement over its potential release. Swift's marketing team has been dropping hints about the project since April 2024, leading to speculation about a break from her usual album release cycle.",
  "argos_id": "8K8NZCQ8X"
}