{
  "url": "https://www.yahoo.com/news/articles/disabled-people-face-accessible-housing-053255325.html?_guc_consent_skip=1754978286",
  "authorsByline": "Kumail Jaffer - Local Democracy Reporting Service",
  "articleId": "2d1b9f0c7d9a4dc4bb5a54e86e37b7f7",
  "source": {
    "domain": "yahoo.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://edgecast-img.yahoo.net/mysterio/api/ff4a08eafb5320b4fde388b00aaf2a4f0b61a07cb2ac19ecbabff5b6f4d2c4a6/ynews/resizefill_w1200/https://media.zenfs.com/en/bbc_us_articles_995/b2875b01da19a1049629604b6dcf270a",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T05:32:55+00:00",
  "addDate": "2025-08-12T05:58:51.097259+00:00",
  "refreshDate": "2025-08-12T05:58:51.097260+00:00",
  "score": 1.0,
  "title": "Disabled people face 'accessible housing shortage'",
  "description": "The Mayor of London has been warned of \"deeply distressing\" conditions for those in need.",
  "content": "Disabled Londoners are being failed due to a \"chronic\" shortage of accessible housing, the Mayor of London has been warned.\n\nThe chair of the London Assembly Housing Committee, Zoë Garbett, has written to Sir Sadiq following their investigation into accessible housing.\n\nA lack of homes which are either built or adapted to enable people with access needs to live independently has led to \"deeply distressing\" conditions for those in need, according to Ms Garbett, a Green Party London Assembly member.\n\nA spokesperson for the Mayor of London said: \"The Mayor is committed to ensuring that all Londoners can afford a place to call home and providing genuine choice for London's diverse population.\"\n\nAccording to the Local Democracy Reporting Service (LDRS), Ms Garbett said the \"stark and compelling\" evidence heard from stakeholders included one resident left unable to wash themselves after being placed in temporary accommodation without an accessible bathroom.\n\nAnother had to wait for their partner to lift them two floors up because they could not take the stairs, she added.\n\nLaura Vicinanza, from disability charity Inclusion London, said: \"The number of people we spoke to who experience stress, anxiety, depression, who have had to be hospitalised - it is just outrageous.\"\n\nHallie Banish, from the independent living charity Ruils, said: \"This is a housing emergency.\n\n\"Everyone deserves safe, accessible, affordable housing and the Mayor needs to do his job in ensuring this bare minimum standard is met.\"\n\nMs Garbett wrote: \"The consequences of inaccessible housing are far-reaching.\n\n\"It often leaves people reliant on partners or carers to meet even their basic needs. It can take a profound physical, mental and emotional toll.\n\n\"We are clear that deaf and disabled Londoners deserve better; they deserve to live in homes that meet their needs, allowing them to live with dignity and independence.\"\n\nEven where accessible housing does exist, navigating the systems to find it are \"complex and difficult\", she added.\n\nMs Garbett said the \"obvious solution\" was building more accessible homes and retrofitting existing housing, but a lack of data, stemming from a failure to effectively monitor developer standards, meant taking effective action was \"almost impossible\".\n\nOther recommendations included ensuring a larger proportion of homes are delivered to the wheelchair accessible standard and holding developers to account for failing to do so.\n\nThe London Plan, set out in 2021, requires 90% of new build homes be built to be adaptable for residents with accessibility needs, but last year, 23% of new build completions were compliant with this, the LDRS said.\n\nA spokesperson for the Mayor of London said: \"Years of under-funding by the previous government, low economic growth, high interest rates and record construction costs have all held us back from building much-needed homes – and Londoners are suffering the consequences.\n\n\"The current London Plan requires 10% of new homes to be wheelchair accessible or adaptable, and a recent consultation to inform development of the next Plan invited comments on how to unlock more housing options for disabled Londoners.\"\n\nListen to the best of BBC Radio London on Sounds and follow BBC London on Facebook, X and Instagram. Send your story ideas to hello.bbclondon@bbc.co.uk\n• None Disabled man 'stuck' again in new inaccessible flat",
  "medium": "Article",
  "links": [
    "https://www.bbc.co.uk/news/articles/cm27p91j790o?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Blink%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "https://www.bbc.co.uk/lnp/ldrs?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Blink%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "https://www.bbc.co.uk/sounds/curation/p0cjdwm5?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Blink%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "https://www.facebook.com/BBCLondon",
    "https://www.london.gov.uk/who-we-are/what-london-assembly-does/london-assembly-committees/housing-committee",
    "https://www.bbc.co.uk/news/articles/c1jld6r5dz5o?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Blink%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "https://www.bbc.co.uk/news/articles/cw00yz5wz71o?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Blink%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "https://www.instagram.com/bbclondon/?hl=en",
    "https://twitter.com/BBCLondonNews"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "accessible housing",
      "weight": 0.10215938
    },
    {
      "name": "new build homes",
      "weight": 0.08486286
    },
    {
      "name": "new homes",
      "weight": 0.08477384
    },
    {
      "name": "BBC London",
      "weight": 0.08321878
    },
    {
      "name": "BBC Radio London",
      "weight": 0.08162177
    },
    {
      "name": "disability charity Inclusion London",
      "weight": 0.081177436
    },
    {
      "name": "Inclusion London",
      "weight": 0.08106984
    },
    {
      "name": "inaccessible housing",
      "weight": 0.08006167
    },
    {
      "name": "London",
      "weight": 0.07981622
    },
    {
      "name": "Green Party London Assembly",
      "weight": 0.078551956
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/News/Local News",
      "score": 0.8447265625
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Housing & Development",
      "score": 0.798828125
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.744140625
    },
    {
      "name": "/Law & Government/Social Services/Other",
      "score": 0.5927734375
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Other",
      "score": 0.5615234375
    },
    {
      "name": "/People & Society/Other",
      "score": 0.375732421875
    }
  ],
  "sentiment": {
    "positive": 0.039744407,
    "negative": 0.74190927,
    "neutral": 0.2183463
  },
  "summary": "Disabled Londoners are being failed due to a chronic shortage of accessible housing, according to the chair of the London Assembly Housing Committee, Zoë Garbett. This follows an investigation into accessible housing and has led to \"deeply distressing\" conditions for those in need. The lack of homes built or adapted to enable people with access needs to live independently has led many to experience stress, anxiety, depression, and hospitalisation. Garbett recommended building more accessible homes and retrofitting existing housing, but effective action was hampered by a lack of data. Other recommendations include ensuring a larger proportion of homes are delivered to the wheelchair accessible standard and holding developers accountable for failing to do so.",
  "shortSummary": "Disabled Londoners face severe and persistent issues with accessible housing due to a chronic shortage, prompting calls from stakeholders for urgent action.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "5806a51ac22a43c387ac2f64c2f63b86",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.bbc.co.uk/news/articles/c1jld6r5dz5o?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Blink%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
      "text": "Disabled man 'stuck' again in new inaccessible flat\n- Published\nA disabled man who had to be carried down the side of his flat block after the lift broke has said he is now \"stuck\" in his new council flat too, because it is not accessible.\nNathan Rollinson, 33, was rescued by emergency services and then treated in hospital when he fell out of his wheelchair after the lift broke in June.\nHe said Lambeth Council promised to adapt a new flat before he moved in last month but it still had not been done, meaning he cannot open the front or back doors or windows unaided, and cannot use his kitchen.\nLambeth Council said it had been \"working hard\" and further adjustments were \"in the process of being carried out\".\nMr Rollinson has been a wheelchair user since suffering brain and spinal injuries in a rugby accident last year.\nHe previously told the Local Democracy Reporting Service after he was treated in hospital, he had been staying in a hotel until Lambeth Council could find him a more accessible place to live.\nHe told BBC London the council eventually suggested a flat in a sheltered accommodation scheme Mr Rollinson said is aimed at over-60s, but he still accepted it and moved in on 29 July.\nHowever, Mr Rollinson said despite the council acknowledging it \"needed to install an electric door opener\" on his front door and windows this has not happened.\nHe said he currently \"can't get out of the front door - I have to call the scheme manager who is only here Monday to Friday, 9 to 5,\" which meant he was either \"stuck\" or reliant on help from friends outside of these times.\nMr Rollinson added London Fire Brigade advised him the front door was \"my only evacuation route\" due to a change in the floor level between the back door and patio outside, so he said he could not escape independently if there was a fire.\n\"They've passed it on to Lambeth again, who know this, and Lambeth are choosing to say 'oh we'll do it in 12 weeks',\" he said.\nMr Rollinson claimed the council was also \"supposed to fully adapt\" the kitchen too but this has not been done, so he \"can't cook\" or use the kitchen.\n\"If I was to try and use the oven I'd fall into the oven because it's low to the floor and the fridge isn't accessible... the countertops, nothing is accessible,\" he explained.\nHe continued by saying when he moved in there were even problems with his fuse box and key-operated utility meter, which were installed \"eight foot\" away from the floor.\nWhen he told Lambeth Council about this, he alleged a staff member replied, \"it's fine, you'll have to just reach for it\" and later suggested staff could top the meter up for him instead.\n\"I want to be able to be fully independent, which obviously I can't,\" he said.\n\"It's horrendous. Even the scheme manager said I shouldn't be here.\"\nMr Rollinson went on to say while he was previously in hospital doctors \"found a pulmonary embolism which they said was caused by the stress of the last property\", and he suffered \"further spine damage\" after the fall which meant he had not been able to work.\n\"I didn't want to be doing all this,\" Mr Rollinson said, adding he was \"angry\" with the situation.\n\"I've had to push since 2022 when I first got injured,\" he said.\nAdjustments 'being carried out'\nA Lambeth Council spokesperson said: \"We have been working hard to support our resident on an ongoing basis to meet his needs.\n\"We have secured ground floor sheltered accommodation for him to live in which is suitable for wheelchair access.\n\"The council had the flat assessed by an occupational therapist before he moved in, and again on the day of the move.\n\"Any further adjustments needed to make sure all his needs are met are in the process of being carried out.\"\nListen to the best of BBC Radio London on Sounds and follow BBC London on Facebook, external, X, external and Instagram, external. Send your story ideas to hello.bbclondon@bbc.co.uk, external\nSimilar stories\n- Published16 July 2024\n- Published27 June 2024\n- Published24 July 2024"
    },
    {
      "url": "https://www.london.gov.uk/who-we-are/what-london-assembly-does/london-assembly-committees/housing-committee",
      "text": "Housing Committee\nThe Housing Committee examines matters relating to housing in London and takes a lead on scrutiny of the Mayor's Housing Strategy.\nThe Committee has lead responsibility for the scrutiny of the Homes for Londoners Board, GLA Land and Property Company, Barking Riverside Limited and the Greenwich Peninsula Strategic Board.\nThe Committee is investigating the Mayor's delivery against affordable housing targets.\n- Wrote to the Mayor about the lack of accessible housing in London.\n- Responded to the Towards a new London Plan consultation.\n- Wrote a letter to the Mayor about the challenges of financing housing in London.\n- Published a report on the costs associated with leasehold in London\n- Published a report on women leaving prison - May 2025\n- Published a report on community land trusts and housing cooperatives - April 2025\n- Responded to the Mayor of London's Key Worker Living Rent consultation - March 2025\n- Responded to the Mayor of London's Plan of Action to end rough sleeping consultation - December 2024\n- Published the Affordable Housing Monitor 2024 -September 2024\n- Published a report on London's Temporary Accommodation emergency - March 2024\n- Published a report on young Londoners’ access to home ownership - March 2024\n- Housing starts figures reveal ‘scale of challenge’ in London after ‘perfect storm’ - Inside Housing, July 2025\n- Interactive map shows depth of London's affordable homes crisis - Standard, July 2025\n- Sadiq Khan urged to cap service charges as London leaseholders pay almost £4,000 per year - Standard, June 2025\n- London women leaving prison turning to crime for a roof over their head - MyLondon, May 2025\n- Not enough cash and too many barriers for community-led housing, Khan warned - Architects' Journal, April 2025\n- London Assembly Housing Committee calls for more support for community land trusts and housing cooperatives - Show House, April 2025\n- Report: How London can boost housebuilding - Property Week, April 2025\n- Why London's property market is broken — and what fixes can we expect in the spring statement? - Standard, March 2025\nIf you have a media enquiry about the Housing Committee, please contact:\nSenior Communications Officer: Josh Hunt, joshua[email protected]\nIf you have a general query about this Committee and its work please contact:\nSenior Policy Advisor: Sarah-Jane Gay, [email protected]\nCommittee Officer: Diane Richards, d[email protected]\nIf you have a query about the Mayor of London's housing work, please contact 020 7983 4000. You can also visit the Planning section of this site for more info.\nCommittee meetings\nBrowse meetings and agendas for this committee and to check out further information relating to the committee, including terms of reference.\nNeed a document on this page in an accessible format?\nIf you use assistive technology (such as a screen reader) and need a version of a PDF or other document on this page in a more accessible format, please get in touch via our online form and tell us which format you need.\nIt will also help us if you tell us which assistive technology you use. We’ll consider your request and get back to you in 5 working days."
    },
    {
      "url": "https://www.bbc.co.uk/news/articles/cm27p91j790o?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Blink%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
      "text": "Disabled people share experience of accessible homes\n- Published\nHousing in London remains unaffordable, unsafe and inaccessible for deaf and disabled people, a study has found.\nThe survey was carried out by Inclusion London, which represents deaf and disabled organisations.\nOne respondent, Abbi Brown, who uses a wheelchair, said although her current flat was largely accessible, her garden was hard to get into due to an \"enormous and very difficult step\".\nCity Hall said the Mayor of London Sir Sadiq Khan had allocated £100m to deliver more accessible homes for disabled Londoners.\nThe report found one in four respondents with accessibility needs could not safely and easily use basic facilities like kitchens, bathrooms and entryways.\nIt also discovered that only 3% of current new-build housing in London was visitable for a disabled person with a mobility impairment.\nNearly two in three respondents said they had made cutbacks on food and other essentials to be able to afford housing.\nMs Brown said the adaptations in her home, which range from making the doorways \"wide enough for me to get my wheelchair through\" to putting sockets higher up and light switches lower down, \"make a big difference to my day to day life\".\nBut even then she said her home was still not fully accessible, like many adapted flats, because she struggled to get in and out of her garden due to an \"enormous and very difficult step to get out into it\".\nMs Brown had to wait for a home like her current one to become available in the capital, meaning she previously had to live somewhere less suitable for her needs.\nShe said she was trapped in her previous Bethnal Green flat for days after one of the lifts broke down, and said she was \"made to feel it (was) my fault\".\n\"Housing is not an isolated issue. Housing needs to be considered in the context of transport and streetscapes and public infrastructure,\" she explained.\n\"I can't get into, I would say, 90% of the shops and restaurants in this area.\n\"If you can't easily get down the street, you can't access the Tube station, then it doesn't really matter that your house is accessible because it is essentially a beautiful prison.\"\nLocal and national decision makers are now being urged to work together to build more accessible homes, especially ones for social rent.\nTracey Lazard, chief executive officer at Inclusion London, said the low percentage of accessible new homes being built in the capital was \"shocking\" and was \"condemning disabled people now to live lives of, frankly, misery\".\nShe added: \"We talk a lot about future proofing and resilience and critical to that has to be about building homes that people can live in throughout their entire lives.\"\nA spokesperson for the Mayor of London said: \"The mayor is committed to meeting London's diverse housing needs and has allocated more than £100m in funding to deliver well-designed, supported housing to enable disabled Londoners to live independently and access appropriate care.\n\"The mayor also requires a minimum percentage of accessible and adaptable units in all new housing developments funded by his Affordable Homes Programme, helping to build a fairer and better London for everyone.\"\nListen to the best of BBC Radio London on Sounds and follow BBC London on Facebook, external, X, external and Instagram, external. Send your story ideas to hello.bbclondon@bbc.co.uk, external\nSimilar stories\n- Published27 June 2024\n- Published9 August 2024"
    },
    {
      "url": "https://www.bbc.co.uk/news/articles/cw00yz5wz71o?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Blink%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
      "text": "Wheelchair user 'trapped in flat' after lift breaks\n- Published\nA wheelchair user from east London says she has been trapped in her flat for days after one of the lifts broke and that she has been \"made to feel it is my fault\".\nAbbi Brown, 31, who lives in Bethnal Green, says property managers Crabtree refused to unlock a door in a corridor that would give her access to another working lift in the building.\nMs Brown, who often needs a wheelchair to get around, said on two occasions she has had to crawl back up the staircase to her flat and, another time, a Crabtree employee told her on the phone \"when you live in a block of flats you should expect that the lift will break sometimes\".\nCrabtree has been contacted for a response.\nMs Brown, who has lived in the property for several years, said the main lift stopped working on Thursday and, although engineers were sent to look at it over two days, it has since broken again.\nOn two occasions she said she was told the lift had been fixed so left her home, only to find the lift was broken on her return. She says she then had to crawl up the stairs back to her flat in pain, with her flatmate carrying her wheelchair up the stairs.\nDespite calling \"constantly\", Ms Brown said Crabtree had told her it would not unlock the door, stating it was a fire door and must remain locked, that its offices in central London were too far away from east London, and that the property manager was off sick.\nAdditionally, Ms Brown said when she called Crabtree and explained she was a wheelchair user and the situation was causing her great difficulty, the staff member told her “when you live in a block of flats you should expect that the lift will break sometimes”.\n\"It's victim blaming,\" she argued. \"It makes me feel like it's my fault. They have no idea what it's like looking for a property in London [as a wheelchair user].\"\nLondon Fire Brigade (LFB), when contacted by Ms Brown about whether a fire door should remain locked, told her there was no fire safety reason why this would be the case.\nThe LFB told the BBC it was in the process of arranging a visit to the building in question, and the fire safety team had \"spoken with the resident and, as a result, has made contact with the building’s managing agent\".\n- Published14 July 2023\n- Published5 February 2023\n\"It's caused a huge amount of anxiety,\" Ms Brown added.\n\"This is supposed to be the one place you feel safe but not being able to leave is making me wonder if I want to live here any more.\"\nMs Brown described the situation as like being in her “own personal lockdown”, saying she has been unable to go into her office job as usual, has relied on friends coming over to help bring her things, and is considering cancelling her doctor’s appointment on Friday because she does not think she will be able to leave the building.\nShe also said it had impacted her health because she had not been able to go swimming, which is an activity recommended by her medical team.\n\"I feel like I'm being fobbed off - it's been six days,\" she said.\n\"No reasonable adjustments have been made, there has been no suggestion of temporary accommodation, no apology. They just keep saying 'bear with us', which is fine to say if you're not stuck in your home.\"\nListen to the best of BBC Radio London on Sounds and follow BBC London on Facebook, external, X, external and Instagram, external. Send your story ideas to hello.bbclondon@bbc.co.uk, external"
    },
    {
      "url": "https://www.bbc.co.uk/lnp/ldrs?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Blink%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
      "text": "The journalists are funded by the BBC as part of its latest Charter commitment, but are employed by regional news organisations.\nA total of 165 reporters are allocated to news organisations in England, Scotland, Wales and Northern Ireland.\nThese organisations range from television and radio stations to online media companies and established regional newspaper groups.\nLocal Democracy Reporters cover top-tier local authorities, second-tier local authorities and other public service organisations.\nPrinciples of operation: Questions and answers\nStories written by the democracy reporters are shared with more than 1,100 media titles and outlets that have signed up to be part of the Local News Partnerships scheme.\nTo be awarded the democracy reporter contracts, the successful news organisations had to pass stringent criteria which included financial standing and a strong track record of relevant journalism in the area they were applying to cover.\nThe award decisions were made by senior editorial BBC figures.\nThe full list of organisations that were awarded contracts can be viewed here.\nLocal Democracy Reporter content can be downloaded via an online portal, accessed via a log-in code supplied to all qualifying news organisations.\nThe Local Democracy Reporting Service (LDRS) is a public service news agency: funded by the BBC, provided by the local news sector, and used by qualifying partners. It’s like a franchise: different companies with different approaches, but using common editorial standards and all publishing into the same system.\n- The core purpose of the LDRS is to provide impartial coverage of the regular business and workings of local authorities in the UK, and other relevant democratic institutions such as mayoralties, combined authority areas, P&CCs, quangos, etc.\n- The Local Democracy Reporters' (LDRs) brief is to report on the decision-making process: what decisions are made in the public's name and how they are arrived at, what evidence is presented to the council, etc.\n- The expectation is that LDRs shall endeavour to attend all meetings in person.\n- In two-tier council areas the LDRs should cover district council affairs sufficiently to ensure that significant decisions (eg planning) are reported.\n- LDRs may provide other stories which are focused on local democracy and which are in the public interest so long as that does not detract from the core purpose of the service.\n- All their work must be available to all qualifying partners.\n- National politics is out of scope, but election campaigns and constituency work of MPs, AMs, MSPs and MLAs that specifically relates to relevant local audiences may be covered so long as it does not detract from the core purpose of the LDRS.\nLDRs report to the contract holder, not to the BBC or any other partner.\nWith the guidance and support of the contract holder, LDRs work to the brief covering the stories of greatest public interest and they should not undertake commissions for any partner.\nDirect questions and clarifications relating to content are acceptable, but any suggestions or comments relating to the service should go through a LDR's manager.\nThe only difference between the BBC and others is that it has a right to request interviews or 2-ways for BBC Local Radio. Depending on workload and commitments it is up to each LDR to decide whether or not to agree.\nNo. While meeting the highest standards of accuracy and impartiality, written content may conform to an employer's normal style. BBC training will help create a common standard for media content production.\n- All content must be created for all qualifying partners.\n- Content should be published as soon as possible after a meeting or event.\n- All content must be published using the LDRS Authoring Tool so all partners see it simultaneously.\n- All content must be titled COUNCIL NAME: Story Name.\n- It must be tagged with at least one top-tier local authority, but can have as many tags as are relevant.\n- Images and media must have a descriptive label.\n- Images and media must be rights-free (LDRs should not use their employer’s picture library, or images supplied by agencies or freelance contributors).\n- LDRs should, where possible, assign a \"Feature Image\" to a story.\n- LDRs must provide an Advisory note in the publishing system before the end of every week indicating their diary for the next seven days (or longer).\n- LDRs should source their content. An explanatory Note to Editors at the end of a story regarding the source will reduce queries from partners, especially around whether qualified privilege applies to all or part of a story.\n- LDRs should not file a story based on a press release already in the public domain unless it has been significantly developed with new quotes or information.\n- Embargoed content must explain why publication should be delayed.\n- Posts should be via LDRs' personal accounts rather than contractors' branded accounts.\n- LDRs are encouraged to post an Advisory in the LDRS Authoring Tool to let partners know if they intend live-Tweeting from a meeting, for example.\n- Tagging #LDReporter will help the partnership collate relevant tweets.\n- LDRs should be credited as \"First Name, Last Name, Local Democracy Reporter\".\n- By-lines or references within copy are acceptable.\n- Broadcasters should acknowledge LDRs when they appear on air or when the format allows.\n- Shared credit with other reporters is acceptable if LDRs' content is copied, edited or incorporated into new pieces of work.\n- The LDRS logo can also be used in print, online or on TV, but is not compulsory.\n- LDRs should refer to themselves as \"Local Democracy Reporters\", not \"BBC Local Democracy Reporters\" in all forms of communication, including social media profiles.\n- Corrections and clarifications relating to previously published stories must be clearly highlighted and issued immediately.\n- The headline style should be as follows: 'COUNCIL NAME: Story Name - CORRECTION'.\n- The first paragraph of the body copy should be as follows: 'CORRECTION: An earlier version of this story incorrectly stated that…'."
    }
  ],
  "argos_summary": "Disabled Londoners are facing a severe shortage of accessible housing, leading to distressing living conditions, as highlighted by the London Assembly Housing Committee's chair, Zoë Garbett. The investigation revealed that many individuals with access needs are unable to live independently due to inadequate housing options, with only 23% of new builds meeting accessibility standards. Advocates are calling for increased construction of accessible homes and better monitoring of developer compliance to ensure that disabled residents can live with dignity and independence.",
  "argos_id": "8VQKNJPJP"
}