{
  "url": "https://www.pymnts.com/news/cfpb/2025/update-cfpb-opens-comments-on-nonbank-regulation/",
  "authorsByline": "PYMNTS",
  "articleId": "ec34a1b0869549b5977bfc7d9b80c0bd",
  "source": {
    "domain": "pymnts.com",
    "location": {
      "country": "us",
      "state": "MA",
      "county": "Suffolk County",
      "city": "Boston",
      "coordinates": {
        "lat": 42.3602534,
        "lon": -71.0582912
      }
    }
  },
  "imageUrl": "https://www.pymnts.com/wp-content/uploads/2025/08/CFPB.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T23:19:27+00:00",
  "addDate": "2025-08-11T23:30:28.715880+00:00",
  "refreshDate": "2025-08-11T23:30:28.715883+00:00",
  "score": 1.0,
  "title": "Update: CFPB Opens Comments on Nonbank Regulation",
  "description": "The Consumer Financial Protection Bureau (CFPB) has started the ball rolling on a process that would conceivably roll back supervision in key sectors of",
  "content": "The proposed rulemaking comes as funding for the agency is on track to be cut by nearly half by Congress and the agency is seeking to allocate its resources effectively.\n\nThe CFPB said it is concerned that the benefits of the current thresholds may not justify the compliance burdens for automobile lending, international money transfers, debt collection and consumer reporting.\n\nThe Consumer Financial Protection Bureau (CFPB) has started the ball rolling on a process that would conceivably roll back supervision in key sectors of payments and lending — to the point where only the largest players would fall under the oversight of the agency.\n\nBy completing this form, you agree to receive marketing communications from PYMNTS and to the sharing of your information with our sponsor, if applicable, in accordance with our Privacy Policy and Terms and Conditions .\n\nComplete the form to unlock this article and enjoy unlimited free access to all PYMNTS content — no additional logins required.\n\nOn Friday (Aug. 8), and as detailed in the Federal Register, the Bureau published four advance notices of proposed rulemaking that would apply to companies in the debt collection, international money, consumer reporting and automobile financing sectors.\n\nAt a high level, the four entries share a common goal and a common heading: “Defining the larger participants” of the markets. What’s up for debate, public comment and possibly significant change is whether the attributes used to define those participants should be revised.\n\nAs It Stands Now\n\nThe aforementioned attributes vary from market to market and have been dependent on volumes or revenues. The commentary periods stretch out toward the end of September.\n\nWe note that the rules defining the participants stretch back to 2012 and 2015, so it’s reasonable to expect that at least some of the comments will argue that rules formulated at least a decade ago could not have anticipated that ways in which FinTechs and other providers have evolved.\n\n“The Bureau is concerned that the benefits of the current threshold[s] may not justify the compliance burdens for many of the entities that are currently considered larger participants in this market, and that the current threshold[s] may be diverting limited Bureau resources to determine whom among the universe of providers may be subject to the Bureau’s supervisory authority and whether these providers should be examined in a particular year,” the CFPB stated in last week’s disclosures.\n\nThere’s a duality at play here, where the bureau noted the burden of its supervised firms and the burdens the supervisors themselves face. On this second point, as PYMNTS has reported, funding for the agency is on track to be cut by nearly half by Congress, where the monies would equate to about 6.5% of the Federal Reserve’s earnings, down from 12%.\n\nWithin the consumer debt collection sphere, the notice details that nonbank entities with over $10 million in annual receipts are “larger participants” and raises concerns that the rules do not reflect the realities that “some of the facts that were used to justify a threshold of $10 million have changed in the intervening years” since the threshold was established.\n\nBack then, the Small Business Administration (SBA) size definition for a ”small business concern,” has risen from $7 million in 2013 (measured in receipts) to a more recent $19.5 million.\n\n“There are thus a number of collection agencies that are small businesses according to the SBA, but are larger participants according to the Bureau,” the statement of proposed rulemaking noted. Feedback would discuss changes to the threshold, and per the CFPB, “the Bureau is particularly concerned that smaller businesses that currently qualify as larger participants are being disproportionately impacted by the current threshold.”\n\nThe advance notice seeking input also extends to auto financing, where thresholds were set in 2015. That threshold stood, and stands, at 10,000 in annual originations. But in raising the threshold to a hypothetical 1 million annual transactions, the CFPB disclosed, the tally of covered entities would be reduced from 63 entities — covering 94% of originations in the market — to five, which account for 42% of the market.\n\nProposed rulemaking governing consumer reporting would look for commentary delving into thresholds that had been established in 2012. Within that segment, entities with more than $7 million in annual receipts have fallen under the scope of the CFPB’s supervisory efforts.\n\nBut by using the SBA’s $41 million “small business” threshold in this industry, “the Bureau estimates that increasing the annual receipts threshold to match the SBA annual revenue threshold of $41 million would leave at least six larger participants in the market,” rather than the 30 that fall between the $7 million to $41 million range.\n\nFor international money transfers, the advance notice of proposed rulemaking would similarly introduce the process of examining whether the nonbank larger entity threshold — of at least 1 million annual transfers — should still hold.\n\nThe CFPB wrote: “The largest eight non-depository financial institutions by transfer volume conducted approximately 77% of estimated remittance transfers. This concentration supports the fact that a higher threshold might better balance the goals of protecting consumers while also not unnecessarily imposing costs on covered [entities].”",
  "medium": "Article",
  "links": [
    "https://www.federalregister.gov/documents/search?conditions%5Bagencies%5D%5B%5D=consumer-financial-protection-bureau&conditions%5Bpublication_date%5D%5Bgte%5D=08%2F08%2F2025&conditions%5Bpublication_date%5D%5Blte%5D=08%2F08%2F2025&conditions%5Bsearch_type_id%5D=6&conditions%5Bterm%5D=defining+larger+participants",
    "https://www.federalregister.gov/documents/2025/08/08/2025-15091/defining-larger-participants-of-the-consumer-debt-collection-market",
    "https://www.govinfo.gov/content/pkg/FR-2025-08-08/pdf/2025-15090.pdf",
    "https://www.govinfo.gov/content/pkg/FR-2025-08-08/pdf/2025-15088.pdf",
    "https://www.pymnts.com/news/cfpb/2025/cfpb-funding-cuts-get-ok-from-senate-parliamentarian/",
    "https://www.govinfo.gov/content/pkg/FR-2025-08-08/pdf/2025-15089.pdf"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "larger participants",
      "weight": 0.08609289
    },
    {
      "name": "thresholds",
      "weight": 0.0762133
    },
    {
      "name": "annual receipts",
      "weight": 0.069430366
    },
    {
      "name": "limited Bureau resources",
      "weight": 0.06683903
    },
    {
      "name": "CFPB",
      "weight": 0.06485608
    },
    {
      "name": "Bureau",
      "weight": 0.06445401
    },
    {
      "name": "proposed rulemaking",
      "weight": 0.06189393
    },
    {
      "name": "collection agencies",
      "weight": 0.061885063
    },
    {
      "name": "covered entities",
      "weight": 0.061472993
    },
    {
      "name": "small businesses",
      "weight": 0.061364684
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.96337890625
    },
    {
      "name": "/Finance/Banking/Other",
      "score": 0.69189453125
    },
    {
      "name": "/News/Business News/Fiscal Policy News",
      "score": 0.362548828125
    },
    {
      "name": "/Finance/Accounting & Auditing/Tax Preparation & Planning",
      "score": 0.35595703125
    }
  ],
  "sentiment": {
    "positive": 0.090290934,
    "negative": 0.46484727,
    "neutral": 0.4448618
  },
  "summary": "The Consumer Financial Protection Bureau (CFPB) has initiated a process that could potentially roll back supervision in key sectors of payments and lending. The CFPB is concerned that current thresholds may not justify compliance burdens for certain sectors such as automobile lending, international money transfers, debt collection and consumer reporting. This comes as funding for the agency is set to be cut by nearly half by Congress and the agency seeks to allocate resources effectively. The proposed rulemaking would apply to companies in the debt collection, international water, consumer reporting and automobile financing sectors. The agency is seeking public comment on whether these attributes should be revised.",
  "shortSummary": "The CFPB is considering reducing nonbank regulatory thresholds to reflect market expansion, amid funding cuts and concerns over compliance burdens.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "cb54ad71d71942e5a138da0b7741bbe3",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.federalregister.gov/documents/search?conditions%5Bagencies%5D%5B%5D=consumer-financial-protection-bureau&conditions%5Bpublication_date%5D%5Bgte%5D=08%2F08%2F2025&conditions%5Bpublication_date%5D%5Blte%5D=08%2F08%2F2025&conditions%5Bsearch_type_id%5D=6&conditions%5Bterm%5D=defining+larger+participants",
      "text": "This site displays a prototype of a “Web 2.0” version of the daily\nFederal Register. It is not an official legal edition of the Federal\nRegister, and does not replace the official print version or the official\nelectronic version on GPO’s govinfo.gov.\nThe documents posted on this site are XML renditions of published Federal\nRegister documents. Each document posted on the site includes a link to the\ncorresponding official PDF file on govinfo.gov. This prototype edition of the\ndaily Federal Register on FederalRegister.gov will remain an unofficial\ninformational resource until the Administrative Committee of the Federal\nRegister (ACFR) issues a regulation granting it official legal status.\nFor complete information about, and access to, our official publications\nand services, go to\nAbout the Federal Register\non NARA's archives.gov.\nThe OFR/GPO partnership is committed to presenting accurate and reliable\nregulatory information on FederalRegister.gov with the objective of\nestablishing the XML-based Federal Register as an ACFR-sanctioned\npublication in the future. While every effort has been made to ensure that\nthe material on FederalRegister.gov is accurately displayed, consistent with\nthe official SGML-based PDF version on govinfo.gov, those relying on it for\nlegal research should verify their results against an official edition of\nthe Federal Register. Until the ACFR grants it official status, the XML\nrendition of the daily Federal Register on FederalRegister.gov does not\nprovide legal notice to the public or judicial notice to the courts."
    },
    {
      "url": "https://www.federalregister.gov/documents/2025/08/08/2025-15091/defining-larger-participants-of-the-consumer-debt-collection-market",
      "text": "This site displays a prototype of a “Web 2.0” version of the daily\nFederal Register. It is not an official legal edition of the Federal\nRegister, and does not replace the official print version or the official\nelectronic version on GPO’s govinfo.gov.\nThe documents posted on this site are XML renditions of published Federal\nRegister documents. Each document posted on the site includes a link to the\ncorresponding official PDF file on govinfo.gov. This prototype edition of the\ndaily Federal Register on FederalRegister.gov will remain an unofficial\ninformational resource until the Administrative Committee of the Federal\nRegister (ACFR) issues a regulation granting it official legal status.\nFor complete information about, and access to, our official publications\nand services, go to\nAbout the Federal Register\non NARA's archives.gov.\nThe OFR/GPO partnership is committed to presenting accurate and reliable\nregulatory information on FederalRegister.gov with the objective of\nestablishing the XML-based Federal Register as an ACFR-sanctioned\npublication in the future. While every effort has been made to ensure that\nthe material on FederalRegister.gov is accurately displayed, consistent with\nthe official SGML-based PDF version on govinfo.gov, those relying on it for\nlegal research should verify their results against an official edition of\nthe Federal Register. Until the ACFR grants it official status, the XML\nrendition of the daily Federal Register on FederalRegister.gov does not\nprovide legal notice to the public or judicial notice to the courts.\nProposed Rule\nEnter a search term or FR citation e.g.\n88 FR 38230 FR 78782024-13208USDA09/05/24RULE0503-AA39SORN\nChoosing an item from\nfull text search results\nwill bring you to those results. Pressing enter in the search box\nwill also bring you to search results.\nChoosing an item from\nsuggestions\nwill bring you directly to the content.\nThank you for taking the time to create a comment. Your input is important.\nOnce you have filled in the required fields below you can preview and/or submit your comment to the Consumer Financial Protection Bureau for review. All comments are considered public and will be posted online once the Consumer Financial Protection Bureau has reviewed them.\nComments must be received on or before September 22, 2025.\nTable of Contents\nEnhanced Content - Table of Contents\nThis table of contents is a navigational tool, processed from the\nheadings within the legal text of Federal Register documents.\nThis repetition of headings to form internal navigation links\nhas no substantive legal effect.\nAgencies review all submissions and may choose to redact, or withhold,\ncertain submissions (or portions thereof). Submitted comments may not be\navailable to be read until the agency has approved them.\nDocket Title\nDocument ID\nComments\nDefining Larger Participants of the Consumer Debt Collection Market\nFederalRegister.gov retrieves relevant information about this document\nfrom Regulations.gov to provide users with additional context. This\ninformation is not part of the official Federal Register document.\nDefining Larger Participants of the Consumer Debt Collection Market\nDocument page views are updated periodically throughout the day and are\ncumulative counts for this document. Counts are subject to sampling,\nreprocessing and revision (up or down) throughout the day.\nPage views\n198\nas of\n08/11/2025 at 8:15 pm EDT\nOther Formats\nEnhanced Content - Other Formats\nThis document is also available in the following formats:\nThis PDF is the current\ndocument as it appeared on Public Inspection on\n08/07/2025 at 8:45 am.\nIt was viewed\n99\ntimes while on Public Inspection.\nIf you are using public inspection listings for legal research, you\nshould verify the contents of the documents against a final, official\nedition of the Federal Register. Only official editions of the\nFederal Register provide legal notice of publication to the public and judicial notice\nto the courts under 44 U.S.C. 1503 & 1507.\nLearn more here.\nPublished Document: 2025-15091 (90 FR 38418)\nThis document has been published in the Federal Register. Use the PDF linked in the document sidebar for the official electronic format.\nAGENCY:\nConsumer Financial Protection Bureau.\nACTION:\nAdvance notice of proposed rulemaking.\nSUMMARY:\nThe Consumer Financial Protection Bureau (CFPB or Bureau) is seeking information to assist it in considering whether to propose a rule to amend the test to define larger participants in the consumer debt collection market established by the Bureau's Defining Larger Participants of the Consumer Debt Collection Market Final Rule published on October 31, 2012 (Consumer Debt Collection Larger Participant Rule).\nDATES:\nComments must be received on or before September 22, 2025.\nADDRESSES:\nYou may submit responsive information and other comments, identified by Docket No. CFPB-2025-0030, by any of the following methods:\nMail/Hand Delivery/Courier:\nComment Intake—Defining Larger Participants of the Consumer Debt Collection Market 2025, c/o Legal Division Docket Manager, Consumer Financial Protection Bureau, 1700 G Street NW, Washington, DC 20552.\nInstructions:\nThe CFPB encourages the early submission of comments. All submissions should include the agency name and docket number. Additionally, where the Bureau has asked for specific comment on a topic, commenters should seek to highlight the topic to which their comment is applicable. Because paper mail is subject to delay, commenters are encouraged to submit comments electronically. In general, all comments received will be posted without change to\nhttps://www.regulations.gov.\nAll submissions, including attachments and other supporting materials, will become part of the public record and subject to public disclosure. Proprietary information or sensitive personal information, such as account numbers or Social Security numbers, or names of\n( printed page 38419)\nother individuals, should not be included. Submissions will not be edited to remove any identifying or contact information.\nFOR FURTHER INFORMATION CONTACT:\nDave Gettler, Paralegal, Office of Regulations, 202-435-7389. If you require this document in an alternative electronic format, please contact\nCFPB_Accessibility@cfpb.gov.\nSUPPLEMENTARY INFORMATION:\nThe Bureau is seeking information in order to consider whether to propose a rule to amend the test to define larger participants in the consumer debt collection market. Currently, a nonbank covered person is a larger participant of the consumer debt collection market if the person has more than $10 million in annual receipts resulting from consumer debt collection activities as those terms are defined in the Consumer Debt Collection Larger Participant Rule. The Bureau is concerned that the benefits of the current threshold may not justify the compliance burdens for many of the entities that are currently considered larger participants in this market, and that the current threshold may be diverting limited Bureau resources to determine whom among the universe of providers may be subject to the Bureau's supervisory authority and whether these providers should be examined in a particular year.\nI. Background\nSection 1024 of the CFPA,[1]\ncodified at 12 U.S.C. 5514, gives the Bureau supervisory authority over all nonbank covered persons [2]\noffering or providing three enumerated types of consumer financial products or services: (1) origination, brokerage, or servicing of consumer loans secured by real estate and related mortgage loan modification or foreclosure relief services; (2) private education loans; and (3) payday loans.[3]\nThe Bureau also has supervisory authority over “larger participant[s] of a market for other consumer financial products or services, as defined by rule[s]” the CFPB issues.[4]\nTo date, the Bureau has issued six rules defining larger participants of markets for consumer financial products and services for purposes of CFPA section 1024(a)(1)(B).[5]\nThe Bureau published the Consumer Debt Collection Larger Participant Rule on October 31, 2012.[6]\nThe final rule defined a market for consumer debt collection that covers debt collection resulting from certain activities that meet the definition of consumer debt collection and established that nonbank covered persons with more than $10 million in annual receipts resulting from consumer debt collection activities would be considered larger participants in this market.\nParticipants of the consumer debt collection market generally include different types of consumer debt collection entities such as third-party debt collectors, debt buyers, and collection attorneys.[7]\nThird-party debt collectors primarily collect debt on behalf of originating creditors or their assignees and typically are compensated through contingency fees calculated as a percentage of the debt they recover. Debt buying is another important component of the consumer debt collection market. Debt buyers purchase debt, either from the original creditors or from other debt buyers, usually for a fraction of the balance owed, and profit when their recoveries exceed the direct and indirect costs of collection. Debt buyers sometimes use third-party debt collectors or collection attorneys to collect their debts, but many also undertake their own collection efforts. Debt buyers also may decide to sell purchased debt to other debt buyers. Additionally, collection attorneys play a role in the consumer debt collection market. Collection attorneys undertake traditional collection efforts, such as contacting consumers by telephone or written communication. Attorneys also file lawsuits against consumers to collect debts or may buy debt and collect in their own names.\nDebt collection is a $15.1 billion industry with about 2,500 collection agencies in the United States.[8]\nDebt collection directly affects a large number of consumers. Nearly one in five people with a credit report, approximately 20 percent, have had at least one debt in collections identified on their credit report as of the first quarter of 2023.[9]\nConsumer debt collection plays a role in the functioning of the consumer credit market—debt collection can reduce creditors' losses from non-repayment and thereby help to keep credit accessible and more affordable to consumers.\nThe Consumer Debt Collection Larger Participant Rule defined a market for “consumer debt collection,” which is among the consumer financial products or services described in 12 U.S.C. 5481(5)(B) and (15)(A). Activities covered under these provisions of the CFPA include “collecting debt related to any consumer financial product or service.” Under 12 U.S.C. 5481(5)(B), such activity is a “consumer financial product or service” when “delivered, offered, or provided in connection with a consumer financial product or service.” The definition of “consumer debt collection” in the Consumer Debt Collection Larger Participant Rule was not meant to track these related provisions in the CFPA.[10]\nThe Consumer Debt Collection Larger Participant Rule definition has a different function. Rather than describing the scope of a certain consumer financial product or service, it\n( printed page 38420)\nidentifies a specific market for such a product or service.\nThe Bureau selected annual receipts as the criterion for determining larger participant status in the Consumer Debt Collection Larger Participant Rule because it believed annual receipts were a meaningful measure of the level of a consumer debt collector's participation in the consumer debt collection market and the consumer debt collector's corresponding impact on consumers. For example, third-party collectors, debt buyers, and collection law firms earn income from recovering consumer debt. Those recoveries are the result of market participation, either through traditional collection means or litigation. Thus, the level of a person's market participation, according to the Bureau, was reflected by the amount of that person's annual receipts.[11]\nThe Bureau set the threshold at $10 million in annual receipts because it believed that threshold would cover a sufficient number of market participants to enable the Bureau effectively to assess compliance and identify and assess risks to consumers, but at the same time cover only consumer debt collectors that can reasonably be considered “larger” participants in the market. Thus, although with a threshold of $10 million the Bureau's supervision program would cover only a small percentage of firms in the market (which the Bureau estimated to be about four percent of debt collectors, or about 175 out of 4,500 entities engaged in debt collection at the time of the Consumer Debt Collection Larger Participant Rule), the Bureau determined that it would have supervisory authority over nonbank entities interacting with a significant portion of consumers with debt under collection.\nSome of the facts that were used to justify a threshold of $10 million have changed in the intervening years. In 2013, the Small Business Administration (SBA) classified a debt collection agency as a small business concern if its annual receipts were less than $7 million. Thus, when the Bureau established the threshold of $10 million to define larger participants, it was choosing a definition that would exclude small business concerns and as well as smaller entities that are not small business concerns.[12]\nHowever, the SBA size standard for collections agencies has increased over time, most recently to $19.5 million, almost twice the Bureau's threshold.[13]\nThere are thus a number of collection agencies that are small businesses according to the SBA, but are larger participants according to the Bureau.\nIn addition, the potential data sources have evolved. When the Consumer Debt Collection Larger Participant Rule was issued in 2012, the Bureau analyzed Economic Census data. Since then, the U.S. Census Bureau in cooperation with the Small Business Administration Office of Advocacy has developed an additional potentially relevant data source called Statistics of U.S. Businesses (SUSB), described in more detail at\nhttps://www.census.gov/programs-surveys/susb/about.html.\nBelow, this notice describes data from both sources and solicits public input on the relevance of these data and sources, including analysis by commenters of the significance for this potential rulemaking of any differences in the data and sources.\nBoth sources indicate that the collections industry has consolidated significantly since the Consumer Debt Collection Larger Participant Rule was issued in 2012. As noted above, at the time, the Bureau estimated there were approximately 4,500 entities engaged in debt collection, based on data from the 2007 Economic Census, of which approximately 175, about four percent, had annual receipts exceeding $10 million. Based on the most recent available data from the 2022 Economic Census and the SUSB data, there are now about 2,500 to 3,000 entities engaged in debt collection, of which around 200 to 250, about seven to ten percent, have annual receipts exceeding $10 million. Of those firms with over $10 million in revenues, roughly half have annual receipts between $10 million and $25 million, most of which are likely small business concerns as defined by the SBA. Thus, increasing the annual receipts threshold to $25 million would result in roughly 100 to 125 larger participants who have between roughly 55 and 70 percent of the total revenues reported for NAICS code 561440. The Economic Census and the SUSB data are more divergent at potentially higher thresholds. For example, increasing the annual receipts threshold to $50 million would result in between roughly 60 (Economic Census) and 90 (SUSB) larger participants who have between roughly 41 percent (Economic Census) and 58 percent (SUSB) of the total revenues reported for NAICS code 561440. Increasing the annual receipts threshold to $100 million would result in between roughly 11 (Economic Census) and 64 (SUSB) larger participants who have between roughly 18 percent (Economic Census) and 51 percent (SUSB) of the total revenues.[14]\nThe Office of Information and Regulatory Affairs within the Office of Management and Budget (OMB) has determined that this action is a “significant regulatory action” under Executive Order 12866, as amended. Accordingly, OMB has reviewed this action.\nIII. Questions\nAs discussed above, the Bureau is concerned that the benefits of supervisory authority over nonbank covered persons with more than $10 million in annual receipts resulting from consumer debt collection activities may not justify the costs of increased compliance burdens for many entities that are considered larger participants under the current test.[15]\nThe Bureau is particularly concerned that smaller businesses that currently qualify as larger participants are being disproportionately impacted by the current threshold. The Bureau is also concerned that the pool of entities subject to supervision may be too broad and is potentially diverting limited Bureau resources to determine who is a larger participant and whether an entity should be examined in a particular year. Finally, the Bureau notes that it has not evaluated whether changes in the consumer debt collection market call for updating the test to define larger participants since it published the Consumer Debt Collection Larger\n( printed page 38421)\nParticipant Rule over twelve years ago. The Bureau therefore seeks comment on the topics and questions listed below in light of the Bureau's intent to propose amending the test to define larger participants in the consumer debt collection market.\n1. Is $10 million in annual receipts an appropriate threshold for determining which entities should be considered larger participants in the consumer debt collection market? If not, what annual receipts threshold or other criterion and associated threshold would be more appropriate and why?\n2. How would consumers be impacted by a potential increase in the threshold? Submissions of data related to the benefits or costs to consumers of the current rule and any particular change to the threshold are encouraged.\n3. How would changing the current threshold for larger participants alter the behavior of participants in the consumer debt collection market? How would these changes benefit or harm consumers and participants? Would those changes in behavior have impacts beyond this specific market?\n4. How would changing the current threshold for larger participants affect the Bureau's ability to address potential market failures in the consumer debt collection market and related areas?\n5. What are the costs to covered entities that are specific to the Bureau's supervisory authority for larger participants in the consumer debt collection market? Specific figures as to staffing, staff time, and other resources are encouraged. How often are these costs incurred for larger participants under the current rule who are close to the current threshold for being larger participants?\n6. What are the costs to covered persons that are not specific to the Bureau's supervisory authority, but are specific to being a larger participant in the consumer debt collection market? For instance, are there costs of monitoring status as a larger participant, or costs related to complying with relevant Federal statutes and regulations beyond what the firm would find reasonable absent the possibility of supervision?\n7. Are there costs to covered persons from the current larger participant rule that specifically apply to firms whose annual receipts are lower than, but close to, the threshold?\n8. Are there costs or benefits to consumers, including rural consumers, servicemembers, and veterans, of raising the larger participant threshold?\n9. Do small business concerns, as defined by the SBA, or other smaller- or mid-size entities qualify as larger participants under the current threshold in the consumer debt collection market? Do these entities incur costs of compliance with their larger participant status that are not in proportion to their size relative to other larger participants in the consumer debt collection market?\n10. Should the Bureau's test for defining larger participants in the consumer debt collection market account for the SBA's size standards? If so, how?\n11. Are there significant recordkeeping requirements that would be reduced by raising the larger participant threshold?\n12. What other specific costs or benefits, not mentioned above, would a change in the larger participant threshold have for consumers and covered persons?\n13. Should the Bureau rely upon Economic Census data, SUSB data, or other sources of data to inform estimates of the current size of the firms in the consumer debt collection market and the number of firms that qualify as larger participants? What additional sources of data, if any, can reliably inform such estimates?\n1.\nConsumer Financial Protection Act of 2010, title X of the Dodd-Frank Wall Street Reform and Consumer Protection Act, Public Law 111-203, 124 Stat. 1376, 1955 (2010) (hereinafter CFPA).\n2.\nThe provisions of 12 U.S.C. 5514 apply to certain categories of covered persons, described in section (a)(1), and expressly excludes from coverage persons described in 12 U.S.C. 5515(a) (very large insured depository institutions and credit unions and their affiliates) or 5516(a) (other insured depository institutions and credit unions). The term “covered person” means “(A) any person that engages in offering or providing a consumer financial product or service; and (B) any affiliate of a person described [in (A)] if such affiliate acts as a service provider to such person.” 12 U.S.C. 5481(6).\n5.\nThese six rules defined larger participants of markets for consumer reporting, 77 FR 42874 (July 20, 2012) (Consumer Reporting Rule); consumer debt collection, 77 FR 65775 (Oct. 31, 2012) (Consumer Debt Collection Rule); student loan servicing, 78 FR 73383 (Dec. 6, 2013) (Student Loan Servicing Rule); international money transfers, 79 FR 56631 (Sept. 23, 2014) (International Money Transfer Rule); automobile financing, 80 FR 37496 (June 30, 2015) (Automobile Financing Rule); and general-use digital consumer payment applications, 89 FR 99582 (Dec. 10, 2024) (General-Use Digital Payment Applications Rule). The Bureau is issuing advance notices of proposed rulemakings to reconsider the test for defining larger participants in the consumer reporting, consumer debt collection, international money transfer, and automobile financing markets. The Bureau will continue to assess whether it is appropriate to reconsider the test for the student loan servicing market. The General-Use Digital Payment Applications Rule was made ineffective by a joint resolution of disapproval by Congress under the Congressional Review Act. S.J.Res.28—119th Congress (2025-2026), Public Law 119-11;\nsee also5 U.S.C. 801et seq.\n7.\nThe NAICS code for collections agencies does not distinguish between different types of debt collectors (\ne.g.,\nlaw firms, other third-party agencies, and debt buyers who are engaged in debt collection activities). The Bureau lacks data with which to assess the relative prominence of these firm types in the overall group of larger participants at different values of the threshold.\n11.\nTo prevent the larger participant test from imposing the potential burden of assessing whether particular medical debts resulted from extensions of credit, receipts from medical debt collection do not count toward the threshold.\nSee 12 CFR 1090.105(a)(iii)(E) (definition of “annual receipts” excluding receipts from collection of debt originally owed to a medical provider); 77 FR 65775 at 65779-80 (explaining nature of such burden).\n12.\nSee 77 FR 65775 at 65789 (noting, for that reason, that “no businesses that qualify as small businesses for SBA purposes would ordinarily be classified as larger participants” under the $10 million annual receipts test).\n14.\nThe estimates are preliminary, are based on limited data, and do not include adjustments, for example, to account for the exclusion of receipts from collection of medical debts from the calculation of annual receipts for purposes of the larger participant test at 12 CFR 1090.105(a) (subparagraph (iii)(E) of definition of “annual receipts”). These estimates may change in any future rulemaking.\n15.\nFor a discussion of compliance burdens, see generally section IV.B of the Consumer Debt Collection Larger Participant Rule (describing costs of increased compliance, costs of supervisory activity, and costs of assessing larger participant status). 77 FR 65775 at 65791-94.\nThis document has a comment period that ends in 42 days. (09/22/2025) Submit a public comment"
    },
    {
      "url": "https://www.pymnts.com/news/cfpb/2025/cfpb-funding-cuts-get-ok-from-senate-parliamentarian/",
      "text": "That’s because Senate Republicans have gotten permission from the chamber’s parliamentarian to include a measure in President Donald Trump’s tax bill that slashes funds for the agency, Reuters reported Friday (June 27).\nThe measure would reduce the consumer watchdog agency’s funding by nearly half, the report said. If approved, it would add by the Republicans’ ongoing effort to curb the CFPB’s powers.\nAccording to Reuters, Sen. Tim Scott, R-S.C., who chairs the Senate Banking Committee, said Parliamentarian Elizabeth MacDonough would allow a measure lowering the legal cap on CFPB funding to be approved via simple majority vote.\nIf approved, the measure would limit the CFPB’s funding to 6.5% of the Federal Reserve’s earnings, down from 12%. As Reuters noted, this would mean the bureau would likely employ significantly fewer people and have a more limited scope.\nMacDonough had previously determined that a version of the measure that would have cut CFPB’s funding limit to 0% could not be included in the bill — dubbed the “One Big Beautiful Bill” — which is set for a vote in the Senate in the coming days.\nThe report quoted a statement from Scott, who said the cuts would reduce “waste and duplication in our federal government and save hardworking taxpayer dollars,” while also pointing out that the CFPB is funded by the Fed, and is thus not supported by taxpayers.\nThe CFPB has been a target of Republican attacks since its inception, with critics calling it a burden on free enterprise. Trump has gone as far to call for its elimination, and its pushing to lay off 90% of the agency’s staff.\nDemocrats have defended the CFPB for its work in protecting consumers. Among its proponents is Sen. Elizabeth Warren, D-Mass., who has said her party would introduce a measure to block the funding cut.\nMeanwhile, other entities have begun to step in as the future of the CFPB remains in doubt, PYMNTS reported earlier this month.\n“As the agency itself has been walking back, or outright canceling, its own rulemaking, there’s a flurry of activity at the state level where lawmakers and attorneys general are, in effect, stepping in for the bureau, levying lawsuits and legislation that treads ground typically covered by the consumer-focused watchdog,” that report said.\n“For the providers, the state-by-state level actions mean there’s an increasingly fragmented regulatory terrain to navigate.”"
    }
  ],
  "argos_summary": "The Consumer Financial Protection Bureau (CFPB) is initiating proposed rulemaking to potentially revise the thresholds that define larger participants in key sectors such as debt collection, automobile financing, and international money transfers. This move comes as the agency faces significant funding cuts, which could reduce its oversight capabilities, leading to concerns that the current thresholds may impose undue compliance burdens on smaller businesses. The CFPB is seeking public comment on whether the existing thresholds, established between 2012 and 2015, remain appropriate given the evolving market conditions.",
  "argos_id": "8X1A1EXM2"
}