{
  "url": "https://finance.yahoo.com/news/watch-many-factors-contributing-huge-221300199.html",
  "authorsByline": "Carleen Johnson",
  "articleId": "ebea4d3de2cd4520be4e13082c7dcd24",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://s.yimg.com/cv/apiv2/cv/apiv2/social/images/yahoo-finance-default-logo.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T22:13:00+00:00",
  "addDate": "2025-08-11T22:59:57.115759+00:00",
  "refreshDate": "2025-08-11T22:59:57.115760+00:00",
  "score": 1.0,
  "title": "Many factors contributing to huge hike in homeowners' insurance premiums",
  "description": "(The Center Square) – Imagine living in the same house for years, maintaining that house, and having no claims on your homeowners' insurance policy, and then seeing your premiums skyrocket. That’s reality for many Washingtonians.",
  "content": "(The Center Square) – Imagine living in the same house for years, maintaining that house, and having no claims on your homeowners' insurance policy, and then seeing your premiums skyrocket.\n\nThat’s reality for many Washingtonians. The sticker shock notices many homeowners are receiving are not the result of rate changes approved earlier this year by the Washington State Office of the Insurance Commissioner; they are dramatic rate hikes from 2023 and 2024 that are only now showing up on many policyholder rate change notices.\n\n“The notable figures here are in 2023; we saw a 16.6% rate increase. In 2024, it was 21.7%,” Aaron VanTuyl, with the agency’s Public Affairs division, told The Center Square.\n\nThat amounts to an average rate increase of more than 38% over two years.\n\n“The big driver was just the cost of claims went up,” VanTuyl explained. “Insurance companies were spending a lot more money to get things repaired and get things fixed. There were building materials shortages, then labor shortages, all kinds of stuff coming out of COVID.”\n\nInsurance premiums are calculated based on the overall risk and cost of replacing a home. Inflation, supply chain issues, and rising costs for construction materials and labor all contribute to increasing rates.\n\n“Over the last few years, inflation has gone up. It has started to slow down, but we haven't seen prices go down,” said Janet Ruiz, director of strategic communication with the Insurance Information Institute. “When you go to [The] Home Depot to buy wood, those prices have not gone down, and the only way we can pay claims is if we increase our prices.”\n\nRuiz said another big issue that drives increased costs is legal system abuse or lawsuit abuse.\n\n“Juries have decided to be extremely generous and give out some of these nuclear verdicts that are way above and beyond trying to make the person whole again,” Ruiz said, singling out Florida.\n\nAccording to Insurance.com, “the Florida home insurance crisis is the result of several factors, including hurricanes and litigation, that have caused home insurance companies to pull back, leave the state or even go out of business. As new legislation starts to impact rates and new companies enter the market, the crisis appears to be easing.”\n\nVanTuyl says that while homeowners are experiencing huge premium increases this year, it appears that, at least for now, things are leveling off.\n\n“So far in 2025, the average rate increase we've seen is 3.1%, which is much more in line with what we've seen over the last few decades than the last two years have been,” he noted.",
  "medium": "Video",
  "links": [
    "https://www.insurance.com/home-and-renters-insurance/home-insurers-leaving-florida#:~:text=Insurance%20companies%20that%20have%20left,agency%20based%20in%20Jacksonville%2C%20Florida.",
    "https://www.iii.org/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "many policyholder rate change notices",
      "weight": 0.09146893
    },
    {
      "name": "home insurance companies",
      "weight": 0.09122275
    },
    {
      "name": "increasing rates",
      "weight": 0.091165274
    },
    {
      "name": "dramatic rate hikes",
      "weight": 0.08750376
    },
    {
      "name": "rate changes",
      "weight": 0.087341204
    },
    {
      "name": "Insurance companies",
      "weight": 0.08502973
    },
    {
      "name": "Insurance premiums",
      "weight": 0.08499457
    },
    {
      "name": "rates",
      "weight": 0.0814577
    },
    {
      "name": "many homeowners",
      "weight": 0.08043081
    },
    {
      "name": "huge premium increases",
      "weight": 0.07967911
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Business"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Other",
      "score": 0.46875
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.40966796875
    }
  ],
  "sentiment": {
    "positive": 0.08789789,
    "negative": 0.7273859,
    "neutral": 0.18471628
  },
  "summary": "Several factors such as inflation, supply chain issues, and rising costs for construction materials and labor have contributed to a significant increase in homeowners' insurance premiums. The Washington State Office of the Insurance Commissioner reported that in 2023, the average rate increase from 2023 and 2024 was 16.6% and 21.7% respectively, resulting in a 38% increase over two years. The cost of claims has also increased, with insurers spending more on repairs and maintaining their homes. Legal system abuse or lawsuit abuse is another major factor driving increased costs, particularly in Florida, where several companies have reportedly withdrawn from the market due to hurricanes and litigation. However, it appears that the situation is improving.",
  "shortSummary": "A significant rise in homeowners' insurance premiums, driven by inflation, supply chain issues, and legal system abuse, have led to significant increases in many areas like Washington state.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "1504d81c6bea4eccad5f79cd4ade7e13",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.insurance.com/home-and-renters-insurance/home-insurers-leaving-florida#:~:text=Insurance%20companies%20that%20have%20left,agency%20based%20in%20Jacksonville%2C%20Florida.",
      "text": "- Why are insurance companies leaving Florida?\n- How the Florida insurance crisis affects homeowners\n- Is the Florida insurance market on its way to recovery in 2025?\n- Which companies are entering the Florida market in 2025?\n- Which insurance companies pulled out of Florida?\n- Which home insurance companies are still available in Florida?\n- What is the Florida government doing about home insurance rates?\n- What should you do if your home insurance company is leaving Florida?\n- Top tips to protect your home and insurance coverage\n- FAQ: Florida home insurance crisis\nWhy are insurance companies leaving Florida?\nThe big question is: Why are insurance companies pulling out of Florida? The reasons behind the home insurance crisis in Florida are complicated, but several key factors have a big impact.\n- Soaring litigation costs. The Insurance Information Institute (Triple-I) published a brief on the Florida insurance crisis. It noted that a 2017 State Supreme Court decision allows courts to award a plaintiff's attorneys two to two-and-a-half times their hourly billing rate when courts rule in favor of policyholders. The result is more lawsuits. Triple-I says Florida accounts for 79% of insurance lawsuits filed, with only 21% in the rest of the country.\n- An increasing number of reinsurers who have chosen to retreat from the state in the face of rising litigation. The Florida market is home to several smaller insurers who rely heavily on reinsurers and the booming housing market along coastal counties, which are more prone to flooding and hurricanes.\n- Severe weather. Those hurricanes are incredibly costly; Hurricane Ian caused $113 billion in damage and Hurricane Helene and Milton caused billions more.\nThe bottom line? Florida homeowners are projected to pay higher rates and find it more difficult to get coverage at all as Florida insurance companies in trouble look to reduce risk or leave altogether.\nPEOPLE ASK\nIs it hard to get homeowners insurance in Florida?\nIt depends on where in the state you live. Coastal areas are more difficult to insure than inland areas. The greater the risk of hurricane damage, the harder it may be to find coverage.\nHow the Florida insurance crisis affects homeowners\nThe home insurance crisis in Florida has had a big impact on homeowners, particularly in high-risk coastal areas. Insurance rates have risen dramatically and even become unaffordable for some.\nFurthermore, the ongoing Florida home insurance problems are affecting the housing market. Without insurance, a home sale can't be completed. That means both buyers and sellers are impacted when insurance is hard to find or unaffordable.\nRecently, Governor Ron DeSantis signed House Bill 5013. The bill cut funds to the Reinsurance to Assist Policyholders (RAP) program from $2 billion to $900 million. Reinsurance is insurance for insurance companies. It provides them with the funds to take on more policies and have access to the money needed to pay any possible claims. This program helped provide insurers the funds needed to pay for hurricane-related claims. For example, it reimbursed 48 insurers $740.1 million after Hurricane Ian.\nWithout RAP, insurers may need to turn to the private reinsurance market for funds. If the price for private reinsurance is higher than what was available from RAP, that increase in cost will likely be passed onto homeowners as higher homeowners insurance premiums.\nIs the Florida insurance market on its way to recovery in 2025?\nThe December 2024 Chamber of Commerce summit found that rates are starting to stabilize, believed to be the results of the new legislation. Legislation can take time to work, and rate stabilization appears to be finally happening.\nThe new partnership between Embark and Security First Insurance will help home builders and buyers by making insurance quoting a part of the homebuying process. The move is another sign of recovery in the market as insurers find new ways to help homebuyers.\nIn February of 2025, the governor announced that Citizens Insurance will reduce rates by 5.6% after years of increases. Additional new insurers are entering the market, offering more options.\nWhich companies are entering the Florida market in 2025?\nIn January of 2025, these new companies were approved to write home insurance in Florida:\n- ASI Select Insurance Corp.\n- Condo Owners Reciprocal Exchange\n- Mainsail Insurance Company\n- Manatee Insurance Exchange\n- Mangrove Property Insurance Company\n- Orange Insurance Exchange\n- Orion180 Insurance Company\n- Orion180 Select Insurance Company\n- Ovation Home Insurance Exchange\n- Tailrow Insurance Exchange\n- Trident Reciprocal Exchange\nWhich insurance companies pulled out of Florida?\nHere's a list of insurance companies leaving Florida, either by choice or due to insolvency. Many have already left.\n- Farmers\n- Southern Fidelity\n- Weston Property & Casualty\n- United Insurance Holdings\n- FedNat\n- Bankers\n- Lighthouse Property Insurance\n- Avatar Property & Casualty\n- Lexington\n- St. Johns\nFollowing several years of companies becoming insolvent or pulling out of Florida, Farmers was the last company to announce a pull-back in July of 2023. The national carrier no longer writes home insurance in Florida under the Farmers name, although subsidiaries like Foremost and Bristol West continue operations.\nWhich home insurance companies are still available in Florida?\nWhile the situation in Florida is alarming for homeowners, fortunately, many insurance carriers still provide coverage in the state. They include recognizable names like State Farm, Travelers, First Florida, and Nationwide.\nTo help Florida homeowners find insurance, Insurance.com provides a comprehensive look at the Florida home insurance market along with an analysis of insurance rates and top providers.\nCharles Nyce, a professor at the Florida State University College of Business specializing in catastrophic-risk financing and corporate-risk management, says that the measures introduced by State legislators in May could begin to ease the Florida insurance crisis. But it’s pretty likely to get worse before it gets better.\n“The difficulty is, there are no easy fixes,” says Nyce. “The measures (that the state introduced) are going to help, but it’s tough to turn the market around quickly.\"\nIn 2025, the market does appear to be stabilizing.\nPeople ask\nWhy are Florida homeowners insurance rates increasing?\nThe high cost of insurance claims in Florida due to severe weather, and the high risk of further storms, has greatly contributed to the rise in home insurance rates. Additionally, the state has a high rate of insurance litigation that makes coverage more costly.\nWhat is the Florida government doing about home insurance rates?\nSeveral legislative changes over the past few years have been passed in an effort to stabilize the Florida home insurance market and bring down rates. Among them:\n- At the end of 2022 and in the wake of Hurricane Ian, the Florida government passed new laws that include requirements for flood insurance and shore up reinsurance to prevent insolvency.\n- In 2023, a law was passed eliminating one-way attorney fees in certain insurance-related lawsuits, a law that is expected to reduce excess litigation.\n- In 2024, The My Safe Florida Home program was expanded to provide matching grants of up to $10,000 for Floridians to make hurricane readiness upgrades to their homes and earn discounts on their insurance rates. Additional budget for the program was approved.\n- In 2025, rate decreases for state-backed Citizens Insurance were announced.\nPeople ask\nHow is the Florida insurance crisis affecting homeowners?\nMany homeowners have lost their insurance and been forced to find coverage elsewhere, often with state-back Citizens Property Insurance. The insurance crisis has also affected the real estate market, with buyers finding it difficult to find the insurance required by the mortgage for closing, making it hard to buy or sell a home in some areas.\nWhat should you do if your home insurance company is leaving Florida?\nHere are some helpful steps to help you take action if you get a notice that your insurance policy is being canceled.\n- Call your insurance company. Speak to a representative or agent and find out the reason for the cancellation. Find out how long you have to get new coverage. A company going out of business vs. one pulling out of the state may have different timelines.\n- Start getting quotes. It’s important to start gathering new quotes right away. Many other Florida homeowners are in the same situation, all trying to get new coverage simultaneously. Start looking immediately to ensure you have time to choose the best policy.\n- Complete any repairs. Finding new coverage will be easier if your house is in good condition. Florida home insurance companies will also look at any weather-proofing work you have done.\n- Consider getting help. If you think you’re being treated unfairly or are struggling to get new coverage, contact the Florida Department of Insurance Regulation (FLOIR). They can also be of assistance in helping you find new coverage.\nAn insurance agent can help you find new coverage, but it's important to start right away.\n“We’ve never seen this number of insurance companies go out of business in such a short period of time,” Sands says. “And when one of the insurance providers goes insolvent, we only have 30 days to rewrite all the policies. Agents end up working around the clock to try to get it done.”\nFlorida's insurer of last resort, Citizens Insurance, is an option if insurance is hard to find or not affordable.\nFor more information on the steps you can take, see Insurance.com’s guide to what happens if your homeowners insurance gets canceled.\nPeople ask\nWhat happens if you don't have homeowners insurance in Florida?\nYou aren't required by law to have home insurance in Florida, but if you have a mortgage, your lender will require it. If you don't have a policy in place, your lender can purchase one at your expense. This type of force-placed insurance protects only the lender, and not you.\nTop tips to protect your home and insurance coverage\nThe best way to protect your home is to make sure you don't lose your insurance. And to do that, you can take steps to make your home more insurable, which means insurance companies find it an acceptable risk. Here are some things you can do:\n- Keep up on maintenance. Don't let your home get rundown, and don't put off necessary repairs. This is especially important when it comes to the roof.\n- Upgrade major surfaces. Newer siding and roofs can withstand wind and hail, and even more so if you choose hail-resistance surfaces.\n- Add weather-resistant features. Storm shutters and other features that make your home less likely to be damaged will make it more insurable.\n- Take down and trim trees. Have any trees that are diseased or dead removed, and have trees around your home trimmed back to remove limbs overhanging the roof.\nSources:\nInsurance Journal. \"Don't Touch Fla. reforms, Panelists Implore, but Maybe Tax Breaks for Elevated Homes.\" Accessed March 2025.\nFAQ: Florida home insurance crisis\nHow many insurance companies have left Florida?\nMore than a dozen insurers have either pulled out of Florida, reduced the number of policies in the state or gone out of business.\nDoes State Farm insure homes in Florida?\nYes. State Farm has stated that it intends to continue offering policies in Florida.\nIs Edison Insurance pulling out of Florida?\nNo. There is no indication that Edison Insurance plans to leave Florida.\n- Tesla insurance in Florida for 2025\n- Florida landlord insurance for 2025: What you need to know\n- Florida car insurance laws and requirements: What is changing in 2025\n- Florida DUI and insurance: How much does a DUI raise your insurance?\n- Speeding ticket calculator in Florida\n- SR-22 insurance in Florida\n- Non-owner car insurance in Florida: Best and cheapest companies\n- Florida gap insurance: Everything you need to know\n- Low-income car insurance in Florida: What you need to know\n- Florida car insurance coverage calculator"
    }
  ],
  "argos_summary": "Homeowners in Washington are facing significant increases in insurance premiums, with average hikes of over 38% due to rising costs of claims, inflation, and supply chain issues stemming from the COVID-19 pandemic. In Florida, the home insurance crisis is exacerbated by soaring litigation costs and severe weather, leading many insurers to exit the market, making coverage harder to obtain and more expensive. Recent legislative efforts in Florida aim to stabilize the insurance market, but challenges remain as homeowners struggle with affordability and availability of insurance.",
  "argos_id": "9698V1OGZ"
}