{
  "url": "https://www.cnet.com/tech/mobile/i-never-charge-my-iphone-to-100-heres-why-and-how-i-do-it/",
  "authorsByline": "Jason Chun",
  "articleId": "b94795372c504cc89289a5db89ba6ced",
  "source": {
    "domain": "cnet.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "San Francisco",
      "city": "San Francisco",
      "coordinates": {
        "lat": 37.7790262,
        "lon": -122.419906
      }
    }
  },
  "imageUrl": "https://www.cnet.com/a/img/resize/0bf663a6ad0eab38352ff7b64aff8190bccc350b/hub/2020/10/16/26d1281a-c183-4584-bd3c-024ca5584d4b/iphone-12-magsafe-charging.jpg?auto=webp&fit=crop&height=675&width=1200",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T21:30:02+00:00",
  "addDate": "2025-08-11T22:15:17.874457+00:00",
  "refreshDate": "2025-08-11T22:15:17.874458+00:00",
  "score": 1.0,
  "title": "I Never Charge My iPhone to 100%. Here's Why and How I Do It",
  "description": "Setting a Charge Limit will help me maximize my iPhone's battery lifespan for years to come.",
  "content": "You don't need the latest and greatest smartphone to get all-day battery life. These days, most midrange or budget options can get you through a full day on a single charge. Instead of prioritizing day-to-day battery life on my iPhone, I'm focusing on its battery lifespan, how long the battery remains in good condition over the course of my phone's life.\n\nOne way to improve your phone's battery lifespan is by minimizing the time it spends charging when the battery is 100%. A fully charged battery can experience stress, which reduces its health in the long term and causes it to degrade faster.\n\nIf you have an iPhone, it may already be learning your charging routine thanks to Optimized Battery Charging. With this feature enabled, you can keep your device plugged in overnight, and it won't charge to 100% until the next morning.\n\nIf you want even more control over your iPhone battery, you can use a feature called Charge Limit. By setting a Charge Limit, you can prevent your device from reaching its maximum capacity, which can help reduce strain on the battery.\n\nYou can enable Charge Limit on iPhone 15 or newer models by going to Settings > Battery > Charging. There, you can choose a percentage at 5% increments between 80% and 100%. (Note that Optimized Battery Charging can only be toggled on at 100%.)\n\nShould you ever charge your phone to 100%?\n\nAccording to Apple, a Charge Limit can improve your phone's battery lifespan and iOS might recommend it based on your use patterns. Even if you only limit your charge to 95%, the feature can have long-term benefits for your iPhone.\n\nHowever, you shouldn't lose sleep if your phone is still plugged in when the battery is full. \"There are so many different variables that affect battery age and longevity besides just filling it to 100%,\" says Patrick Holland, CNET editor and phone reviewer. \"Apple and other phone-makers use software to minimize those factors, and even give customers ways to take control of that if they like. But there's a balance and people shouldn't be afraid of topping off their phone completely.\"\n\nYou might occasionally still see your iPhone charge to 100% when you've enabled Charge Limit. \"If you have Charge Limit set to less than 100 percent, your iPhone will occasionally charge to 100 percent to maintain accurate battery state-of-charge estimates,\" according to Apple.\n\nFor more iPhone battery tips, check out the iOS settings that can drain your iPhone battery, and learn whether permanent Low Power Mode can make your old iPhone battery last longer.",
  "medium": "Article",
  "links": [
    "https://www.cnet.com/tech/mobile/best-iphone/",
    "https://www.cnet.com/tech/mobile/these-3-ios-settings-can-drain-your-iphone-battery/",
    "https://support.apple.com/en-us/108055",
    "https://www.cnet.com/tech/mobile/8-iphone-battery-hacks-to-make-sure-yours-lasts-all-day/",
    "https://www.cnet.com/tech/mobile/best-cheap-phone/",
    "https://www.cnet.com/tech/services-and-software/will-permanent-low-power-mode-make-your-old-iphone-battery-last-longer-maybe/",
    "https://www.cnet.com/tech-tips/",
    "https://www.cnet.com/tech/mobile/squeeze-more-life-out-of-your-old-iphones-battery-with-these-simple-tricks/",
    "https://www.cnet.com/tech/mobile/best-phone/"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "more iPhone battery tips",
      "weight": 0.13098715
    },
    {
      "name": "battery age",
      "weight": 0.11880488
    },
    {
      "name": "iPhone",
      "weight": 0.097192645
    },
    {
      "name": "phone reviewer",
      "weight": 0.086516835
    },
    {
      "name": "Charge Limit",
      "weight": 0.08137687
    },
    {
      "name": "your old iPhone battery",
      "weight": 0.08127514
    },
    {
      "name": "your iPhone battery",
      "weight": 0.07712423
    },
    {
      "name": "Optimized Battery Charging",
      "weight": 0.076379836
    },
    {
      "name": "day",
      "weight": 0.06767532
    },
    {
      "name": "its battery lifespan",
      "weight": 0.06626694
    }
  ],
  "topics": [
    {
      "name": "iPhone"
    },
    {
      "name": "Electronics"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Shopping/Consumer Resources/Product Reviews & Price Comparisons",
      "score": 0.6279296875
    },
    {
      "name": "/Computers & Electronics/Software/Operating Systems",
      "score": 0.607421875
    },
    {
      "name": "/Internet & Telecom/Mobile & Wireless/Mobile Phones",
      "score": 0.50146484375
    },
    {
      "name": "/News/Technology News",
      "score": 0.48388671875
    }
  ],
  "sentiment": {
    "positive": 0.23098871,
    "negative": 0.1888903,
    "neutral": 0.580121
  },
  "summary": "The article discusses the importance of improving the battery lifespan of your iPhone's battery over the course of its life, focusing on reducing the time it spends charging when the battery is 100%. This can occur when a fully charged battery experiences stress, which can cause it to degrade faster. Apple's Charge Limit feature allows users to limit their device from reaching its maximum capacity and reduce strain on the battery. However, users should not lose sleep if their phone is still plugged in when it is full. The article also discusses the benefits of using a Charge Limit on iPhone 15 or newer models, which Apple believes can significantly improve battery lifespan.",
  "shortSummary": "I've never charged my iPhone to 100% but I've learned how to reduce battery stress by using features like Charge Limit to improve its lifespan.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "3577da1ec9594f1eae7fc92430ac2c1f",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.cnet.com/tech/services-and-software/will-permanent-low-power-mode-make-your-old-iphone-battery-last-longer-maybe/",
      "text": "One of the biggest problems with older smartphones is keeping the battery charged. Conventional wisdom says that the lithium-ion batteries in iPhones will maintain 80% capacity up to 500 charges, or about two to three years. After that, you'll start to notice your iPhone needing to be charged more often.\nOptimized charging and setting a charge limit can extend the health of your iPhone battery, but what about Low Power Mode? That special iPhone setting can squeeze a little more iPhone usage after your battery hits the 20% mark, but what if you kept it on all the time? Could setting Low Power Mode to run permanently let you use your phone longer before the charge runs out?\nLearn exactly what Low Power Mode disables, how to turn it on and off, and how to keep it on permanently if you'd like to see how it affects your iPhone's battery's charge. We'll also explain how to check your battery health to learn if it's time for a replacement (or a new iPhone.)\nFor more, learn how to charge your iPhone charge faster, and three quick settings changes that could make your iPhone battery last longer.\nWhat is iPhone Low Power Mode?\nLow Power Mode is an iOS setting that disables some iPhone features to save battery charge when it is low. Your iPhone will ask you if you want to turn on Low Power Mode when your battery drops to 20%, and then again at 10%.\nApple says that Low Power Mode reduces the amount of power that your iPhone uses to make your battery last longer.\nYou can tell when you're in Low Power Mode because your battery icon will be yellow. Your iPhone automatically turns off Low Power Mode when your battery charge reaches 80%.\nWhat happens when iPhone Low Power Mode is enabled?\nAccording to Apple, Low Power Mode makes these changes to save your battery's charge:\n- Turns off 5G on most devices\n- Locks your iPhone screen after 30 seconds of inactivity\n- Reduces display brightness\n- Lowers display refresh rate for iPhones with ProMotion\n- Eliminates some visual effects\n- Pauses iCloud Photos sync\n- Suspends automatic downloads\n- Pauses email fetch\n- Stops background apps from refreshing\nHow do I turn on iPhone Low Power Mode?\nYou can turn it on manually by going to Settings > Battery and toggling on Low Power Mode. You can also turn on Low Power Mode manually with the iPhone Control Center or with Siri.\nHow do I keep iPhone Low Power Mode on permanently?\nThe manual way to keep Low Power Mode on all the time would be to simply put your iPhone into Low Power Mode after every time you charge it. But there's an easier, automated way to \"set it and forget it.\"\nTo automatically keep your iPhone in Low Power Mode at all times, you'll need to get a bit crafty and cerate your own Personal Automation using the Shortcuts app.\nThere are many methods of automatically setting Low Power Mode using Shortcuts, but for me, the easiest is to turn on Low Power Mode whenever the battery is less than 100%. That way, your iPhone is essentially in Low Power Mode all the time, but it can also create backups, complete downloads and receive updates when it's plugged in and charged at 100%.\nScroll to the right on your iPhone home screen to get to your App Library, then scroll down and tap Shortcuts (or search for it). Once the app is running, select Automation at the bottom of the screen, hit the blue \"+\" symbol in the upper right corner, then tap the blue Create Personal Automation button.\nOn the New Animation screen, scroll down and select Battery Level. Tap the bottom option, Falls Below, and then move the slider all the way to the right for 100%. Then click Next. You've set your condition for triggering an action.\nNow, create the action to set your iPhone to Low Power Mode. On the Actions screen, click the blue Add Action button. You can then type in \"Low\" in the search box and tap Set Low Power Mode, or tap Scripting and find it under Device.\nOnce you've selected Set Low Power Mode, it will show up on your Actions screen as \"Turn Low Power Mode On.\" Click Next. On the following New Automation screen, toggle Ask Before Running off to let Lower Power Mode be turned on automatically. If you want, you can request a notification come through every time the automation runs.\nConfirm \"Don't Ask,\" then tap Done to finish. You're all set. Every time your battery drops below 100%, your iPhone will automatically switch into Low Power Mode\nHow do you automatically turn on Low Power Mode at a specific battery charge, like 50%?\nOnce you've learned how to create a shortcut to turning on Low Power Mode permanently, it's easy to adjust that setting to automatically activate Low Power Mode at any specific percentage of battery charge.\nTo turn on Low Power Mode automatically when your iPhone battery hits 50%, edit that permanent shortcut to change the activation threshold from 100% to 50%. Go back into the Shortcuts app, tap the Automation tab in the middle of the bottom navigation, then tap on your \"When battery level falls below 100%\" automation to edit it.\nUnder \"When,\" tap the trigger \"When battery level falls below 100%\" and then move the resultant slider down from 100% to 50%. Then tap Back and hit Done. Now your iPhone will automatically shift into Low Power Mode when the battery drops below half charge.\nHow much battery charge can Low Power Mode save?\nYou're not going to get a definitive answer here. The value of Low Power Mode has been debated ever since it was introduced. While some estimates say battery charges will last about one and a half times longer using Low Power Mode, others show very little difference in battery usage.\nIf you're concerned with making your iPhone battery last longer, you'll simply need to try out Low Power Mode for yourself and see the difference.\nHow to turn Low Power Mode off again\nIf you find that Low Power Mode doesn't save your battery, you can turn off the automation by going into Shortcuts and toggling off Enable This Animation. To erase it completely, swipe left on your Low Power Mode automation on the main Automation screen, then tap the red Delete button.\nYou can also create your own custom version of Low Power Mode by tweaking your iPhone settings to take some of the measures that Low Power Mode does. For example, you can save significant battery by stopping background apps from refreshing or adjusting your brightness settings.\nCheck to make sure your battery is still healthy\nAlthough turning on Low Power Mode permanently is an experiment you might want to try, if you find that you need to keep Low Power Mode on all the time to get decent iPhone battery performance, it's very possible that your battery could be degraded or have other problems.\nTo check the health of your iPhone battery, go into Settings > Battery > Battery Health & Charging. You'll see your battery's maximum capacity, as well as options for setting Optimized Battery Charging and Clean Energy Charging. If your iPhone battery's maximum capacity has dipped to 80% or lower, you'll see an \"Important Battery Message\" warning. This means that your battery has degraded significantly and needs to be replaced or restored."
    },
    {
      "url": "https://www.cnet.com/tech/mobile/squeeze-more-life-out-of-your-old-iphones-battery-with-these-simple-tricks/",
      "text": "If you're an iPhone enthusiast who upgrades to the latest and greatest model every year, you're actually shielding yourself from one of the more obnoxious aspects of holding on to a phone for multiple years: a slowly decaying battery.\nOver time, the maximum charge a battery can hold is reduced. While this is completely normal, there are other things that can put a strain on your battery that makes this happen faster, leaving you with a shorter battery life per charge. Couple this with new software updates that may have features that are more power-hungry and you can quickly find yourself with an aging battery that struggles to keep up even under less demanding circumstances. However, there are a few things you can do to help your battery age a bit more gracefully.\nIf you aren't quite sure what to do to help prolong your iPhone battery's life span, who better to advise you than Apple? Below you'll find a few tips directly from the company that'll help keep you from having to replace your battery sooner rather than later.\nFor more, don't miss the top settings to change in iOS 18.3 to make your iPhone more personal.\nNow on to the battery tips...\nMake sure Optimized Battery Charging is enabled\nYou can't overcharge a battery, but you can put your battery under a bit of stress when you charge up to 100%. To help limit that strain, your iPhone has a setting that learns from your daily charging routine (say you always plug in your phone right before you go to bed and then unplug it in the morning). It then waits to finish charging past 80% until right before you need it, instead of just quickly charging the battery all the way to 100%.\nThis can help reduce battery aging, and although the setting should be enabled by default, it's still good to check if it's on. In Settings, go to Battery > Battery Health & Charging and make sure that Optimized Battery Charging is toggled on.\nDon't expose your iPhone to extreme temperatures\nThe life span of your iPhone battery can be affected by extreme temperatures. A higher temperature increases the speed of chemical reactions inside the battery, which forces the battery to work harder and faster, thus also causing it to degrade faster.\nAccording to Apple, it's important to avoid exposing your iPhone to temperatures higher than 95 degrees Fahrenheit (35 degrees Celsius) to avoid permanent damage. Fortunately, the fix is simple -- keep your iPhone out of hot temperatures. If you're at the beach, don't leave your iPhone on your towel in direct sunlight. Instead, toss it into a bag or put a shirt over it for protection. Also, don't leave your iPhone in the car for an extended period of time, especially if it's a hot day.\nApple does have a few settings to prevent overheating and damage, like disabling your phone or preventing further charging when your phone is too hot, but you don't want to rely on these features to save your phone's battery health. It's better to take preventative actions than wait for your iPhone to overheat.\nYour case may cause your iPhone to retain heat\nIf your iPhone gets hot any time you charge it, you may need to take off your case before doing so. Certain cases, especially the bulkier and more protective ones, can trap heat and make the iPhone overheat, affecting the battery's life span.\nApart from removing the case, consider avoiding processor-intensive apps, like games, when your phone is charging. Using these apps while charging could also cause your phone to overheat.\nTips to protect the batteries of iPhones in long-term storage\nMaybe you got a new phone and want to stash your old iPhone for a bit. If you want to maintain the battery's life span, you should do the following before putting it away:\n- Keep the charge at around 50%. You don't want your battery to be full or empty before you turn it off, or else it could stop holding a charge (if full) or lose capacity and have a shorter life span (if empty).\n- Turn your iPhone off. This prevents your phone from using up more battery.\n- Store your phone in a cool and moisture-free environment. Ideally, the temperature should be less than 90 degrees Fahrenheit (32 degrees Celsius).\n- If you're putting your iPhone away for longer than six months, turn it on and charge it to 50% every half a year.\nIf you store your iPhone for a long time, it may be in a low-battery state, which just means you may need to charge it for 20 minutes before it turns on.\nFor more, check out the top settings in iOS 18.3 to tweak and how to perform conversions with the iPhone calculator app."
    },
    {
      "url": "https://support.apple.com/en-us/108055",
      "text": "About Charge Limit and Optimized Battery Charging on iPhone\nTo improve the lifespan of your battery, your iPhone learns from your daily charging habits.\nHow your iPhone battery ages\nA battery’s lifespan is related to its chemical age, which is more than just the length of time since the battery was assembled. A battery's chemical age results from a complex combination of several factors, including temperature history and charging pattern. All rechargeable batteries are consumable components that become less effective as they chemically age. As lithium-ion batteries chemically age, the amount of charge they can hold diminishes, resulting in reduced battery life and reduced peak performance. Learn more about iPhone battery and performance and how to maximize battery performance and lifespan.\nImprove battery lifespan with Optimized Battery Charging\nOptimized Battery Charging is designed to reduce the wear on your battery and improve its lifespan by reducing the time your iPhone spends fully charged. It is available when Charge Limit is set to 100 percent. When the feature is enabled, your iPhone will delay charging past 80 percent in certain situations. Your iPhone uses on-device machine learning to learn your daily charging routine so that Optimized Battery Charging activates only when your iPhone predicts it will be connected to a charger for an extended period of time. The algorithm aims to ensure that your iPhone is still fully charged when unplugged.\nWhen Optimized Battery Charging is active, a notification on the Lock Screen says when your iPhone will be fully charged. If you need to have your iPhone fully charged sooner, touch and hold the notification and then tap Charge Now.\nChange your charging option\nOptimized Battery Charging is on by default when you set up your iPhone.\nTo change your charging option with iPhone 15 models and later:\nGo to Settings > Battery > Charging.\nChoose an option. You can choose a charge limit between 80 percent and 100 percent in 5 percent increments. When the charge limit is 100 percent, Optimized Battery Charging is available.\nTo change your charging option with iPhone 14 models and earlier:\nGo to Settings > Battery > Battery Health & Charging.\nTurn Optimized Battery Charging on or off. Turning off charging optimizations can increase wear on your battery and reduce its lifespan.\nImprove battery lifespan with Charge Limit\nWith iPhone 15 models and later, if the charge limit is 100 percent, you can also turn on Optimized Battery Charging. Your iPhone has these settings by default.\nYour iPhone will charge to within a few percentage points of your chosen limit and then stop charging. If the battery charge level drops more than 5 percent while connected to power, charging will resume, again charging to within a few points of your chosen limit.\nIf iOS determines that a charge limit will help preserve your battery's lifespan, you'll see a recommendation. For example, you might see \"Based on your iPhone habits, a charge limit of 95% is recommended to help preserve your battery.\"\nIf you have Charge Limit set to less than 100 percent, your iPhone will occasionally charge to 100 percent to maintain accurate battery state-of-charge estimates.\nLearn more\nLearn what to do if Optimized Battery Charging doesn't activate.\nLearn what to do if your device stops charging unexpectedly.\nLearn what to do if you think your battery is draining too quickly.\n* Optimized Battery Charging needs at least 14 days to learn your charging habits, so it won't engage before then. Also, your iPhone needs to experience at least 9 charges of 5 hours or more in a given location for Optimized Battery Charging to engage."
    },
    {
      "url": "https://www.cnet.com/tech/mobile/best-cheap-phone/",
      "text": "In 2025 affordable phones come brimming with features and options from companies like Motorola, Google, Samsung and Apple. After testing and reviewing dozens of cheap handsets, we found there are two pricing sweet spots: $300 and $450. Phones that cost $300 tend to have NFC (for Google Pay), wireless charging and good screen -- though cameras can be hit-or-miss, like the $300 Motorola Moto G Power (2024). In the $450 range are phones have solid cameras and features that rival pricier models like the $499 Google Pixel 8A, which won CNET's Editor's Choice Award. Out of everything we tested, here are our favorite cheap phones from both price ranges.\nOur Picks\nMOBILE DEALS OF THE WEEK\n- $449 (save $50)\n- $550 (save $50)\n- $300 (save $100)\nWhat is the best cheap phone?\nThe Google's $499 Pixel 8A is our favorite cheap phone. Google delivers all the big features that matter on the Pixel 8A, like top-of-the-line cameras, a peppy processor and years' worth of software support. And it even has Google's new Circle to Search tool, which is a fast and fun way to trigger a search just by circling what's on your screen. Google makes smart compromises to keep costs low making the Pixel 8A a phone that packs an incredible amount of value. We should note that Google announced the Pixel 9A which launches in April. We look forward to testing it and if you're considering a Pixel 8A and can wait, it might be worth going for the new Pixel 9A instead.\nBest cheap phones of 2025\nPros\n- Great camera\n- 7 years of software updates\n- Many of the same features as the Pixel 8\n- Good battery life\nCons\n- 256GB storage not available on all models\n- Zoomed and low light shots aren't as clear as the Pixel 8's\nThe Pixel 8A is so good and shares so much in common with its pricier siblings. From its selection of AI-powered features like Circle to Search to its cool aesthetic and powerful Tensor G3 processor, that it’s hard to see why anyone would not buy a Pixel 8A.\nThe Pixel 8 and 9 offer a marginally better camera system, a slightly larger screen and the ability to charge other phones and accessories wirelessly on the back of the device. But those features don’t feel significant enough to impact the buying decision for most people. As I wrote in my review, the Pixel 8A raises the bar for what a $500 phone should be. It also won a CNET Editor's Choice Award.\nPros\n- NFC/Google Pay\n- Good battery life\n- Wireless charging\n- Moto shortcuts\nCons\n- Short software support timeline\n- Screen is too dim in sunlight\n- Lacks IP rating for dust and water resistance\nThe Motorola Moto G Power 5G is the most versatile option in this roundup, offering wireless charging, a 120Hz high refresh rate screen, Google Pay for contactless payments and a fantastic vegan leather design. Combine that with a camera that takes decent photos in bright environments, and a processor that is capable for most daily tasks, and you have a phone that’s both fun to use without cramming itself with the extra bells and whistles we see in higher priced phones.\nEven though this phone does suffer from having a shorter software and security support timeline (1 year of major Android OS, three years of security updates) than Samsung’s Galaxy A25 5G, it is a more useful device. And it's this appeal that makes the Moto G Power 5G our top recommendation for a phone that costs $300 or less.\nPros\n- Main camera is good\n- Autofocus makes selfies look better\n- Improved repairability is welcomed\n- Action mode is smooth\nCons\n- Ultrawide photos are a step down in image quality\n- Videos recorded in low light look just OK\n- Needs more iOS features for the Plus' larger screen\nApple no longer sells the iPhone 14 and the new iPhone 16E replaces its $599 price point. But many shopping sites still sell the iPhone 14 for as low as $359. a great buy and solid upgrade, especially if you're using an 11 or older. There are two models the 6.1-inch iPhone 14 and the 6.7-inch iPhone 14 Plus that normally starts at $699. Both phones are identical and really the deciding factor comes down to screen and battery size as well as price. The iPhone 14 and 14 Plus have a long battery life, fast performance, great durability and wonderful cameras as well as safety features like Crash Detection and Emergency SOS via Satellite.\nBoth phones came out in September 2022 originally but are still solid options today. In terms of drawbacks, neither phone has a high refresh rate screen, and always-on display or the newer Action button found on the 15 Pro and iPhone 16 series. But at hundreds of dollars less, we think that the iPhone 14 and 14 Plus have the best value to the dollar that Apple currently sells. Read our full iPhone 14 review.\nPros\n- Big screen\n- Loud speakers\n- Long-lasting battery\n- Fast wired charging\nCons\n- No wireless charging\n- Mixed photography\nThe $600 OnePlus 13R is one of the most useful phones we've tested, even if it's playing second fiddle to the $900 OnePlus 13. Over his three-week testing period, CNET's Mike Sorrentino consistently got two full days of use from its 6,000mAh battery. The phone's big 6.78-inch screen and loud speakers are a joy to use when paired to my Xbox controller while gaming. Even though it runs on Qualcomm's year-old premium processor used in 2024's OnePlus 12 and the Galaxy S24, it's still a very capable chip ready for intensive tasks and AI features. All in all, the OnePlus 13R packs a lot for its lower price. At $600 it's a decent phone, but we included it on this list because you can often find it on sale for less. Read our OnePlus 13R review.\nPros\n- 3GB of RAM helps phone multitask\n- Blue color option\n- Includes fingerprint sensor\nCons\n- Very little onboard storage\n- Some noticeable lag\n- Indoor photos are challenging\nSamsung's Galaxy A03S at $160 (£126, roughly AU$244) includes great features and could be a fit for someone in need of a cheap phone that can handle essential tasks. The phone's 6.5-inch screen, capped at 720p resolution, is great for reading the news, watching videos and playing games. Despite some performance lag during our review, the phone is good at multitasking. The tiny 32GB of storage space could fill up fast, so if you're considering this phone, you might want to expand the storage with a microSD card.\nSamsung also plans to support this phone with at least four years of security updates, which in this price range is as good as it gets. On the software side, it's less clear how many Android versions are scheduled, but the phone initially ships with Android 11.\nPros\n- Vegan leather design\n- NFC for contactless payments\n- Decent cameras for the price\nCons\n- Slow performance\n- Dull-looking screen\n- Only one software update planned\nMotorola’s $200 Moto G 5G for 2024 arrived with a splash. The phone kept many highlights of the 2023 model like a 120Hz refresh rate screen and dual speakers while also getting a $50 price drop. The Moto G 5G also has an improved design and functionality with a new vegan leather look and NFC for contactless payments. And its cameras can take photos with decent color accuracy, despite soft details.\nBut performance and a short software update timeline both hurt the Moto G 5G. While the phone is capable of running all sorts of apps and games, multitasking on its small 4GB of RAM is challenging. Also Motorola has not budged from its policy of providing one major software update and three years of security updates to the Moto G line, which limits the number of years you can safely use the phone before needing to replace it.\nPros\n- Excellent camera for the price\n- Attractive design\n- Wireless charging, face unlock and high refresh rate\nCons\n- Screen is dim outdoors\n- Only three generations of Android OS updates\nEditor's note: Google released the Pixel 8A, also $500. You can read our Pixel 8A review here. If you're buying a Pixel 7A make sure it's on sale.\nGoogle's budget phone took a leap forward in 2023 with the Pixel 7A, which offers many of the same benefits as the Pixel 7 but at a cheaper price. Like the Pixel 7, the Pixel 7A runs on Google's Tensor G2 processor, meaning it has many of the same photo editing and language translation features as its pricier sibling. The Pixel 7A's 64-megapixel camera also takes excellent photos that rival the Pixel 7's in quality.\nWhile we still like the Pixel 7, the Pixel 7A's lower price makes it a better deal for most people. Otherwise, the main differences between the Pixel 7 and 7A come down to the former's more durable build, slightly faster charging and its ability to wirelessly charge compatible accessories. The Pixel 7 also has a larger camera sensor that's more sensitive to light, according to Google, but CNET's Lisa Eadicicco didn't notice much of a difference.\nPros\n- Great screen for $160\n- NFC support for Google Pay\n- Decent multitasking for the price\nCons\n- T-Mobile exclusivity\n- Battery drains fast\n- Weak cameras\nThe TCL 50 XL 5G includes an impressive amount of specs for $160. This is one of the cheapest phones I’ve seen so far that includes a 120Hz refresh rate display and NFC for Google Pay and contactless payments. It also includes 6GB of memory, which made the phone breeze through multitasking during my testing. But the TCL 50 XL 5G does show compromises from its low price in other ways.\nEven though it has a big 5,010-mAh battery, it drains quickly -- possibly because it’s powering a large 6.78-inch 1080p display with a low-end processor. Cameras struggle to take photos with clean, crisp details, in both well-lit and lowlight situations. It’s carrier-locked to T-Mobile as well, making it only useful when running on the magenta carrier or its Metro prepaid brand. And it’s also only set for one software update and three years of security updates, which matches what Motorola provides but is still low compared to Samsung. But if you're on T-Mobile, the TCL 50 XL 5G is a serious value for its $160, and helps excuse some of its faults. But you should still be aware of them.\nPros\n- Excellent software and security support\n- 25-watt wired charging\n- Eye-catching Light Blue color option\nCons\n- Slow performance\n- Single audio speaker\n- Mediocre photography\nEditor's Note: Samsung has also released the Galaxy A16.\nSamsung’s $200 Galaxy A15 5G is an easy choice for someone looking to buy a phone that will last for years. Samsung provides it with four years of software updates and five years of security support, which in this price range is unparalleled. Plus the phone supports 25W wired charging that in my testing was able to charge half of its big 5,000-mAh battery from empty in 30 minutes. I also like the eye-catching light blue option.\nA $200 phone has to have some compromises. The Galaxy A15 5G feels sluggish compared to competing phones like Motorola’s $200 Moto G 5G, and as an entertainment machine falls short with its single audio speaker that is blocked by accident when you hold the phone sideways for games and video. Photography, which is typically a weak point on phones in this price range, is similarly mixed with decent photography in outdoor environments while struggling to photograph lowlight spaces. Read our full Samsung Galaxy A15 5G review.\nWhy we like it\nThe Samsung Galaxy A15 5G is a stalwart, functional choice when all you want is a stable phone. The A15's photo processing is decent for a phone in this price range. The photos I took outdoors look vivid, with enough detail that I'd be happy to post them on social networks. In a good way, the battery drains slowly and recharges fairly quickly thanks to its 25-watt wired charging.\nWho's it best for\nIf you're looking for a low-cost phone that will be easy and safe to use for years, the A15 is an easy choice.\nWho shouldn’t get it\nIf you don't mind possibly needing a new phone in two or three years, the $200 Moto G 5G and the $160 TCL 50 XL have better-looking displays that look smoother at their 120Hz refresh rates\nPixel 9A specs vs. Moto G Power 5G, iPhone 14, OnePlus 13R, Galaxy A03S, Moto G 5G, Pixel 7A, TCL 50 XL 5G, Galaxy A15 5G\n| Product | Google Pixel 9A | Moto G Power 5G (2024) | Apple iPhone 14 | OnePlus 13R | Samsung Galaxy A03S | Moto G 5G (2024) | Google Pixel 7A | TCL 50 XL 5G | Samsung Galaxy A15 5G |\n|---|---|---|---|---|---|---|---|---|---|\n| Display size, tech, resolution, refresh rate | 6.3-inch OLED; 2,424x1,080 pixels; 60-120 Hz variable refresh rate | 6.7-inch LCD; 2,400 x 1,080 pixels; 60-120Hz refresh rate | 6.1-inch OLED; 2,532x1,170 pixels; 60Hz refresh rate | 6.78-inch AMOLED; 2,780x1,264 pixels; 1-120Hz adaptive refresh rate | 6.5-inch LCD; 720x1,600 pixels; 60Hz refresh rate | 6.6-inch LCD; 1,612 x 720 pixels, 120Hz refresh rate | 6.1-inch OLED; 2,400x1,080 pixels; 60 -90Hz variable refresh rate | 6.78-inch; 2,460 x 1,080 pixels; 120Hz refresh rate | 6.5-inch AMOLED; 2,340 x 1,080 pixels; 90Hz refresh rate |\n| Pixel density | 422 ppi | 391 ppi | 460 ppi | 450 ppi | 269 ppi | 269 ppi | 361 ppi | 396 ppi | 420 ppi |\n| Dimensions (inches) | 6.1 x 2.9 x 0.4 in. | 6.6 x 3 x 0.3 in. | 5.78 x 2.82 x 0.31 in. | 6.36 x 2.98 x 0.32 in. | 6.5 x 2.9 x 0.3 in. | 6.5 x 3 x 0.3 in. | 6.00 x 2.87 x 0.35 in. | 6.6 x 2.9 x 0.32 in. | 6.3 x 3.02 x 0.33 in. |\n| Dimensions (millimeters) | 154.7 x 73.3 x 8.9 mm | 167.2 x 76.4 x 8.5mm | 147 x 72 x 7.8 mm | 161.72 x 75.77 x 8.02 mm | 165.8 x 75.9 x 9.1 mm | 164.4 x 75 x 8.2 mm | 73 x 152 x 9.0 mm | 167.6 x 73.6 x 8.1mm | 160 x 76.7 x 8.4 mm |\n| Weight (grams, ounces) | 186 g (6.6 oz) | 201g (7.09 oz.) | 172 g (6.07 oz) | 206g (7.26 oz.) | 7.13 oz; 202g | 194g (6.84 oz.) | 193g (6.81 oz) | 195g (6.9 oz) | 201g (7.09 oz.) |\n| Mobile software | Android 15 | Android 14 | iOS 16 | Android 15 | Android 11 | Android 14 | Android 13 | Android 14 | Android 14 |\n| Camera | 48-megapixel (wide), 13-megapixel (ultrawide) | 50-megapixel (wide), 8-megapixel (ultrawide) | 12-megapixel (wide), 12-megapixel (ultrawide) | 50 megapixel (wide), 8 megapixel (ultrawide), 50 megapixel (2x telephoto) | 13-megapixel (wide), 2-megapixel (depth), 2-megapixel (macro) | 50-megapixel (wide), 2-megapixel (macro) | 64-megapixel (wide), 13-megapixel (ultrawide) | 50-megapixel (wide), 5-megapixel (ultrawide), 2-megapixel (depth) | 50-megapixel (wide), 5-megapixel (ultrawide), 2-megapixel (macro) |\n| Front-facing camera | 13-megapixel | 16-megapixel | 12-megapixel | 16 megapixel | 5-megapixel | 8-megapixel | 13-megapixel | 8-megapixel | 13-megapixel |\n| Video capture | 4K | 1,080p | 4K | 4K | FHD | 1,080p | 4K | 1,080p | 1,080p |\n| Processor | Google Tensor G4 | Mediatek Dimensity 7020 | Apple A15 Bionic | Qualcomm Snapdragon 8 Gen 3 | MediaTek MT6765 Helio P35 | Qualcomm Snapdragon 4 Gen 1 | Google Tensor G2 | MediaTek Dimensity 6100 Plus | Mediatek Dimensity 6100 Plus |\n| RAM + storage | 8GB + 128GB, 256GB | 8GB RAM + 128GB | RAM NA; 128GB, 256GB, 512GB | 12GB + 256GB | 3GB + 32GB | 4GB RAM + 128GB | 8GB + 128GB | 6GB RAM + 128GB | 4GB RAM + 128GB |\n| Expandable storage | None | Up to 1TB | None | None | Up to 1TB | microSD | None | Yes | Yes |\n| Battery | 5,100 mAh | 5,000 mAh | Undisclosed; Apple claims 20 hours of video playback | 6,000 mAh | 5,000mAh | 5,000 mAh | 4,385 mAh | 5,010 mAh | 5,000 mAh |\n| Fingerprint sensor | Under display | Side | None (Face ID) | Under display | Side | side | Side | Side | Side |\n| Connector | USB-C | USB-C | Lightning | USB-C | USB-C | USB-C | USB-C | USB-C | USB-C |\n| Headphone jack | None | Yes | None | None | Yes | Yes | None | Yes | Yes |\n| US starting price | $499 (128GB) | $300 (128GB) | $599 (128GB) | $600 (12GB + 256GB) | $160 | $200 (128GB) | $499, $549 (mmW) | $160 (128GB) | $200 (128GB) |\nRecent updates\nIn January 2025, we added the OnePlus 13R to our list. The new phones replace last year's OnePlus 12R and is a decent midrange Android phone that is best bought when on sale.\nFactors to consider when buying a cheap phone\nTry it before you buy it: It's one thing to ogle over a phone, but it's another to actually try it out in a store.\nDecide on Android or iPhone: Do you have a lot of iPhone apps and Apple subscriptions? Stick with an iPhone. Likewise, if you've invested in loads of Android apps, you'll want to stay on that side of the fence. Otherwise, it's simple enough to switch platforms.\nPick the most important feature: Is it screen size? Camera quality? Battery life? This will help narrow down your choices.\nHow we test phones\nEvery phone on this list has been thoroughly tested by CNET's expert reviews team. We use the phone, test the features, play games and take photos. We assess any marketing promises that a company makes about its phones. If we find something we don't like -- be it battery life or build quality -- we tell you about it.\nWe examine every aspect of a phone during testing:\n- Display\n- Design and feel\n- Processor performance\n- Battery life\n- Camera quality\n- Features\nWe test all the phone's cameras (both front and back) in a variety of conditions: from outdoors under sunlight to dimmer indoor locales and nighttime scenes (for any available night modes). We also compare our findings against similarly priced models. We have a series of real-world battery tests to see how long a phone lasts under everyday use.\nWe account for additional phone features like 5G, fingerprint and face readers, styluses, fast charging, foldable displays and other useful extras. We weigh all our experiences and testing against the price so you know whether a phone represents good value.\nRead more: How We Test Phones\nOther phones to consider\nAt $700, the iPhone 15 isn't necessarily considered cheap. Compared to the iPhone 16 and 16 Pro, it's much more affordable. In 2025, the iPhone 15 is still one of the best Apple phones you can buy. It has a 6.1-inch screen, great dual-rear cameras and an outstanding battery life. It's worth a look if you can work it into your budget.\nBest cheap phones FAQs\nCan you find cheap phones on sale?\nAre cheap phones available unlocked?\nAre cheap phones good for kids?\nWhat to look forward to in 2025?\nWe are in the middle of \"budget phone season\" with new affordable phones being released by Google, Motorola and Samsung. We look forward to testing them all once we can get our hands on them. Otherwise, later this summer we'll see the start of \"flagship phone season\" with major releases from Apple and Google."
    },
    {
      "url": "https://www.cnet.com/tech/mobile/8-iphone-battery-hacks-to-make-sure-yours-lasts-all-day/",
      "text": "A brand-new iPhone can easily last all day, but that wanes over time as parts age. Newer software takes its toll on battery life too, as the latest iOS 18 software and apps, including Apple Intelligence AI, can drain them quickly. Shooting photos and videos, playing games and watching shows and movies can deplete the battery, too. However, before you consider buying a new Apple phone, like the new iPhone 16 or the more affordable iPhone 16E, give these battery hacks a try to give your long-lived iPhone a bit more juice before needing to recharge it.\nSome of the causes of battery drain are easy to control, like features turned on by default that can be switched off. Others might require a lifestyle change as you switch up how you use your iPhone throughout the day, breaking habits and going without some minor perks. In all cases, it's helpful to keep a portable power bank in your pocket or bag just in case.\nHere are eight tips for diagnosing and extending your iPhone's battery life. For the latest news about the iPhone, be sure to check out everything Apple announced at WWDC 2025.\n1. Find what's draining your battery\nSome apps drain more of your iPhone's battery than others, and it's no surprise that the biggest offenders are those that track location, stream video or generate graphics (games, for example, especially fast-paced online ones). If it makes your phone heat up a bit, it's probably running down your battery faster than casual use.\nThere's a way to specifically check which apps are draining your battery the most. Head to Settings > Battery and scroll down to see which apps are the worst culprits for taking the biggest percentage of your screen time. Also, don't skip the Insights and Suggestions section, as it does all the analysis for you and shows you which apps and settings to change.\nNote that these are the biggest uses of your battery, but you'll have to parse through them to see which are big battery drainers, like YouTube or TikTok. In my case, Safari takes the biggest chunk of my use, which represents a lot of endless scrolling of sites and forums -- but YouTube is in second.\n2. Drop the battery-draining apps\nLet's face it -- whether it's Instagram, TikTok or something else, one or two apps are probably draining an outsized chunk of your battery every day. If you want longer battery life, remove the app by long-pressing its icon on the Home Screen and clicking the \"x\" in the corner.\nYes, you could try to limit your use before wiping these apps from your phone. If you believe in your willpower, you could just stick the offending app in a folder to keep it out of sight, out of mind.\nBut if you need some help from your iPhone itself, you can set a time limit for individual apps or whole categories. Go to Settings > Screen Time and tap App Limits. From there tap the Add Limit button to select by entire categories or specific apps.\n3: Turn down your screen brightness\nYou can save battery by turning down your iPhone screen's brightness. This one's pretty easy: tap-and-drag from the top-right corner to bring up the Control Panel and manually lower the brightness bar. Alternatively, you can find these controls in Settings > Display & Brightness or if you prefer to be verbose, you can ask Siri to reduce the brightness.\nWhile you're in the Display & Brightness sub-menu, tap Auto-Lock to set your phone to have a shorter time before locking itself. That way you won't be draining battery if you put your phone down and paying attention to something else.\n4: Turn on Low Power Mode\nWhenever you dip below 20% battery, your iPhone will ask if you want to extend your remaining battery life by turning on Low Power Mode. But you can also manually activate it at any time, either by opening up the Control Panel (if a shortcut has been set there) or by going to Settings > Battery and switching it on there.\nLow Power Mode is a catch-all setting that ekes out more battery life by reducing drain from several active and passive sources. It dials down background activity like downloads and mail fetching, lowers the screen brightness; as well as turns off the Always On Display.\n5: If your 5G signal is bad, switch to 4G LTE\nWhile carriers have built out their 5G networks over the years, some phone owners will struggle to get a strong signal in areas with poor coverage -- or in places 5G struggles to reach, like within buildings and underground. Your iPhone burns a lot of battery trying to stay connected, so if you don't have a great connection, it might be best to manually revert to 4G LTE.\nTo do so, head to Settings > Cellular, then tap on Cellular Data Options. If you don't see Cellular Data Options, select the SIM or eSIM that you're currently using. On the next screen, tap Voice & Data and select LTE. You'll only use 4G LTE to connect to mobile networks, which should be more widely available among carriers.\nYou should also be aware that downloading data drains battery, too, so manually restricting that could extend your battery life. To do so, head to Settings > Cellular, then tap on Cellular Data Options. If you don't see Cellular Data Options, tap on the SIM or eSIM that you're currently using. On the next screen, tap Data Mode then tap Low Data Mode, which will pause automatic updates and background tasks.\n6: Selectively disable location services\nTracking your location drains battery, so turning it off when possible is a good idea if you don't need it. Triangulating your position actually takes multiple sensors, so it's not an insignificant amount of battery saved -- your iPhone uses GPS, Bluetooth, and crowdsourced Wi-Fi to narrow down where you are.\nTo see which apps track your location, tap Settings > Privacy & Security > Location Services and tap through to tweak each individually. But you can also turn off Location Services entirely with the toggle at the top of the screen.\nIt's worth nothing that Location Services are required for Apple's Find My feature, so if you want to track down another object linked to your account, you'll need Location Services turned on. Likewise, you'll need it turned on if you ever lose the iPhone you're using, so make sure to reactivate it later.\n7: Turn off Always On Display\nIntroduced in the iPhone 14 Pro series in 2023 and only available on the newest Pro and Pro Max models, Always On Display does what it says: It keeps a dimmed version of your lock screen on. This allows you to check the time, on-screen widgets and how many notifications you have without needing to fully unlock your phone. But it also saps your battery by having that low-light version of your display constantly activated.\nIf you can live without having that quick info at a glance, go to Settings > Display & Brightness > Always On Display and turn it off. It may not be a huge power saver, but it's one of the features on the newer iPhone Pro models that seemingly counteracts any battery increase Apple ekes out of the phones. Under the Always On Display settings, you can also disable the Wallpaper and Notifications for a more minimal version that only shows the date and time against a black background.\n8: Install a new battery\nOver years of use, your iPhone's battery will degrade and it simply won't be able to hold as much juice as it could when brand-new. Thankfully Apple has made it easy to check how your battery is doing -- just go to Settings > Battery > Battery Health and you'll get an easy diagnosis, an estimate of its maximum capacity on a full charge and how many full recharge cycles it's gone through.\nApple generally recommends replacing your battery when it dips below 80% maximum capacity. Keep in mind that it's not just the maximum battery life that might suffer if you don't swap out for a new battery -- the quality might degrade so much that the battery itself could swell and warp enough to damage sensors and internal parts of the iPhone -- which is rare.\nApple offers in-store battery replacement for $99 for the newest iPhone 15 models, which drops down to a minimum of $69 for the oldest iPhone SE and iPhone 5 models the company still supports. Third-party phone repair shops may offer their own rates for replacing batteries, and iFixit has a guide if you want to boldly order a new battery and attempt the swap yourself -- just keep in mind that it may violate any AppleCare agreement if you go outside Apple's repair ecosystem."
    },
    {
      "url": "https://www.cnet.com/tech/mobile/best-phone/",
      "text": "We test dozens of phones each year, but we only consider a few to be truly great. The best phones in 2025 have a battery life that lasts a day or more, cameras that take stunning photos and vibrant displays, perfect for TikTok or watching The Gilded Age. 2025 has been an incredible year for smartphones. From Google's Pixel 9 series and Apple's iPhone 16 family to Samsung's Galaxy S25 series and foldable phones including the Motorola Razr Ultra and Galaxy Z Fold 7, these are the best phones you can buy. While tariffs and economic uncertainty have caused people to consider upgrading their phones sooner rather than later, companies like Apple, Samsung and Google have not raised their prices.\nOur Picks\nMOBILE DEALS OF THE WEEK\n- $449 (save $50)\n- $550 (save $50)\n- $300 (save $100)\nWhat is the best phone for most people?\nThe best phone for most people is the $799 iPhone 16. It comes in two sizes: a 6.1-inch regular iPhone 16 model or a larger 6.7-inch iPhone 16 Plus model that starts at $899. The phones have a new 12-megapixel ultrawide camera that performs better in low light and can now take macro photos, meaning you'll be able to focus close to take amazing food snaps. The iPhone 16 and 16 Plus have a handful of Apple Intelligence tools for writing, removing distractions from photos and doing summaries of messages and webpages. There's also adds a ChatGPT integration to Siri.\nThe phones also have an Action button that can be programed for different functions like turning on the flashlight, recording a voice memo, changing the focus mode and more. There's also a new Camera Control button that not only lets you take photos and quickly change things like zoom, Portrait mode aperture and Photographic Styles, but can also trigger a new feature called Visual Intelligence, which will add context to whatever the camera is pointed at, a bit like Google Lens. We think the iPhone 16 and 16 Plus are ideal for most people looking for a great phone that will last for years.\nBest phones of 2025\nPros\n- Camera Control is useful for switching camera settings\n- Photographic Styles makes photos pop\n- Ultrawide camera is better in low light\nCons\n- Apple Intelligence isn’t out yet\n- No always on display\n- No changes to wired charging speeds\n- No upgrades to the Action button\nWhen I tested the iPhone 16 and 16 Plus I was definitely impressed by the new photography features, the convenient Action button and the elegant build. I consider these phones to be top-notch choices for Apple fans. Parts of the iPhone 16’s key feature, Apple Intelligence, are now out, and the fact that these phones will support it means they’ll likely feel future-proofed for years to come. Aside from screen size (6.1 inches on the regular, 6.7 inches on the Plus), battery size and price, the iPhone 16 and 16 Plus are identical in every way.\nThe iPhone 16 isn’t perfect -- it’s missing an always-on display, and it feels like it’s been ages since Apple improved its wired charging speeds. But it checks all the important boxes and then some.\nWhy we like it\nThe iPhone 16 and 16 Plus rank so high in our testing because the phones appeal to both novice users and power players a like. They offer about 90% of the experience of Apple's Pro models but cost hundreds of dollars less. Not only is the iPhone 16 a wonderful phone out of the box, Apple has a long track record of updating its software and security patches for years.\nWho it's best for\nWhen you think about how the Camera Control key, the Action button and the Dynamic Island come together, along with the camera and battery improvements Apple has made over the last several years, the iPhone 16 is a compelling upgrade for someone coming from an older iPhone, especially if that person is on an iPhone 13 or older. For those who don’t need the Pro’s extra photography prowess and battery life, the iPhone 16 won’t disappoint.\nWho shouldn’t get it\nI wouldn't recommend buying the iPhone 16 just for the Camera Control button or the better ultrawide camera.\nPros\n- Camera consistently delivers good images\n- Impressive battery life\n- More AI features feel practical\nCons\n- Several gimmicky AI features\n- Not many changes over the S24\nThe Galaxy S25's biggest flex that I noticed while testing is it shares many of the same attributes as its pricier counterparts, the S25 Plus and S25 Ultra – but it does so for several hundred dollars less. You'll find features like the AI Select tool, Audio Eraser and deeper Gemini integration across all of Samsung's S25 devices, as well as a custom Snapdragon 8 Elite processor and 12GB RAM – making the smaller phone of the bunch still seem pretty mighty.\nAnd while the Galaxy S25 might look incredibly similar to the S24 and share many of the same specs, consistency isn't so bad when it means there's a consistently good camera and great battery life. Read our full Samsung Galaxy S25 review.\nWhy we like it\nHaving a baseline phone, like the Galaxy S25, that delivers many of the same perks as more expensive models, is a huge plus in my book. And given the remarkable processing power, standout camera and seamless AI integration in the Galaxy S25 lineup, it's great that I can get all those premium features for $800.\nWho it's best for\nIf you're someone who insists on buying a flagship device, the Galaxy S25 won't let you down. but if you have a device that's two years old or more, you might be enticed to tap into all the latest Galaxy AI and integrated Gemini features. Now, $800 isn't pocket change, and there are definitely other options for those who want to be more budget conscious, but if you're willing to spend a bit more, the baseline S25 can be a great all-around choice.\nWho shouldn’t get it\nYou probably don't need to upgrade if you're using last year's S24.\nPros\n- Robust design\n- Bright high resolution inner screen\n- Battery life should last you a day or more\n- It's so damn fun to use\nCons\n- Cameras take decent photos but suffer from motion blur\n- Only three years of major OS updates\n- Gets warm playing games and using the camera frequently\nThe Motorola Razr Ultra is a beefed-up version of last year's Razr Plus, which won a CNET Editor's Choice Award. It's as if the Razr Plus hired a trainer and nutritionist and then got absolutely ripped -- warranting its name: Ultra. After testing, I've come to adore the Razr Ultra. It does all the \"normal\" non-folding phone things I want, and offers me a truly unique experience thanks to its cover screen. I feel like the coolest kid in the coffee shop when Google Pay-ing for my cortado with my Razr Ultra closed.\nBut in taking nearly every aspect of the phone to the extreme, Motorola lost one of the most important parts of recent Razrs: the amazing value. The catch for all this ultra-ness: the Motorola Razr Ultra costs $1,300.\nWhy we like it\nThis is the best built foldable flip phone I've ever used. Motorola took the best parts of the Razr Plus and improved nearly everything else. The battery life is outstanding and easily lasts a day on a single charge and can get you mostly through a second day even. The displays are brighter. The main 7-inch foldable display is larger and has more resolution than the Razr Plus and the cameras are improved. The fabric backing is delightful.\nWho's it best for\nSomeone who wants a fun, unique an robust foldable phone. You're willing to pay top-dollar to get the best processor, battery, design and cameras Motorola has ever made.\nWho shouldn't get it\nIf you're unsure of foldables, this might not be the best fit. If you find yourself in places with sand, dirt and other fine particles, the Razr Ultra (like all foldable phones) isn't worth the risk. The Razr Ultra has the same class-leading IP-rating for dust and water resistance, but the dust resistance is only for particles 1-mm or larger.\nPros\n- Larger screens/thinner bezels\n- 4K slo-mo OMG\n- Audio Mix is brilliant\n- iOS 18\nCons\n- No Apple Intelligence out of the box\n- Camera Control placement not optimal for one-handed shooting\n- Elegant finishes aren't very colorful\n- Only 128GB of storage for $1,000\nThe iPhone 16 Pro and 16 Pro Max have everything I've come to expect in a year-over-year upgrade. The 6.3-inch iPhone 16 Pro and 6.9-inch iPhone 16 Pro Max have a slew of upgrades including one of the best batteries on any phone I've tested as well as. In our testing it will easily last a day on a single charge.\nThe phones also have larger displays, outstanding photo and video chops, high-resolution slo-mo, a new Camera Control button, iOS 18 goodies and a handful of Apple Intelligence tools. The negatives are as thin as the borders around the new screens: You only get 128GB of storage for $1,000; there are only drab color options, and a the new camera button is easy to tap accidentally. Read our full iPhone 16 Pro and 16 Pro Max review.\nWhy we like it\nThis year the 16 Pro and 16 Pro Max have the exact same cameras -- unlike the 15 Pro and 15 Pro Max, which had different telephoto options. Screen size, battery life and price should be the deciding factors when you're choosing between the two. The iPhone 16 Pro and Pro Max are excellent phones worthy of a spot in your pocket (and mine) if you can afford them.\nWho it's best for\nIf you have an iPhone 12 Pro or older, upgrading to the 16 Pro makes a lot of sense. If you're on a 13 Pro and still have a decent battery capacity, I'd say save your money. And if you're on a 14 Pro or 15 Pro, there's no need to upgrade. Also, I should note that the entry-level $999 iPhone 16 Pro only has 128GB of storage.\nWho shouldn't get it\nIf you are looking for a budget phone or don't need a phone with the latest features or tech.\nPros\n- Thin 4.2mm design\n- 200-megapixel main camera\n- Powerful Snapdragon 8 Elite processor\n- Durable build\nCons\n- Steep $2,000 price tag\n- Same 4,400-mAh battery as last year's Fold\n- 25-watt wired charging\nWith the Galaxy Z Fold 7, Samsung has finally addressed some of the key issues with its previous book-style foldables. The impressively thin build and wider, 6.5-inch cover screen makes this feel like a standard phone when closed, and that wider 8-inch inside display is great for multitasking, with the ability to run up to three apps simultaneously. Perhaps most notably, the camera gets a major upgrade with the addition of a 200-megapixel main camera, which takes shots on par with the top-of-the-line S25 Ultra.\nAltogether, it’s a great choice if you want a bigger, tablet-like display without the bulk or a compromise on camera quality.\nWhy we like it\nThe Z Fold 7 does a solid job combining what's great about standard slate phones and what's great about foldables. It feels wonderfully normal to hold when closed, thanks to its sleek design and lightweight build. It also packs great cameras and has an expansive main display that's 11 percent bigger than last year's Z Fold 6.\nThankfully, a slimmer build doesn't force the battery to take a hit; the Z Fold 7 maintains that same 4,400-mAh battery as last year's foldable. That pales in comparison to batteries from Chinese competitors, but at least it's not a downgrade. The Z Fold 7 also packs a Snapdragon 8 Elite processor to power the many AI features you'll get onboard, from Galaxy AI photo and audio editing tools to Google's Gemini Live and Circle to Search. The phone also supports seven years of software and security updates.\nWho it's best for\nIf you're bored of standard slate phones and want something that feels a little more exciting, the Galaxy Z Fold 7 is a great choice. The slim design and wider cover screen helps it to feel as normal as possible when closed, with the added perk of an expansive main display that's great for multitasking and watching videos. The cameras are also impressive for a foldable that's so thin.\nWho shouldn't get it\nThe Z Fold 7's $2,000 price tag is perhaps its biggest caveat. Also, if you don't need a bigger display, it may not be worth the splurge. Ironically, the cover screen is so practical that you’ll rarely need to open the phone -- unless you’re watching movies or multitasking, in which case a phone like the Galaxy S25 Ultra might be a better fit.\nPros\n- Best screen on any phone\n- Versatile cameras\n- Most powerful phone I've tested\n- Good battery life\nCons\n- $1,300 price\n- Design is almost too minimal\n- AI features are hit-or-miss\n- S25/S25 Plus have similar features and cost less\nSamsung's Galaxy S25 Ultra which has a lot of AI features, the best of which are interesting and the worst of which unreliable. Luckily, Samsung gets a lot of other things right on the S25 Ultra, which has a new Snapdragon 8 Elite processor, high-resolution ultrawide camera, and some sweet pro video tools that rival the iPhone 16 Pro. Samsung wisely kept all the best parts of last year's Galaxy S24 Ultra (basically the entire phone including that antireflective display) but some of its worst parts, too, like the $1,300 price tag.\nIf you want the best screen you can find on any phone, get the S25 Ultra. If you want the most versatile phone cameras, get the S25 Ultra. If you want a stylus, get the S25 Ultra. But if your needs scale back on any of those fronts, the more affordable S25 options, or even last year's S24 Ultra, may be worth considering. Read our full Samsung Galaxy S25 Ultra review.\nWhy we like it\nThe reason to get the Ultra over its S25 siblings is its screen, which is truly the best I've seen on any phone, and the cameras, which are a step above what the S25 and S25 Plus have. Added video features like ability to record in Log format gets the Ultra as close as it's ever been to the iPhone in terms of professional video capture.\nWho's it best for\nIf you have a Galaxy S22 Ultra or older, the S25 Ultra will seem like a significant upgrade. It's harder to make that case for S23 Ultra owners, who, unless their phone's battery is ailing or they can score an incredible discount, should otherwise sit this one out. And for you S24 Ultra owners, you don't need this phone. Save your money and treat yourself to a nice steak dinner and a movie.\nWho shouldn’t get it\nThe Galaxy S25 Ultra's appeal is muddied by its $1,300 price. The regular Galaxy S25 has the same functionality, power and longevity, and it costs $500 less. Want a bigger screen? Consider the Galaxy S25 Plus. For the majority of people, the regular Galaxy S25 and S25 Plus will be a better fit.\nPros\n- The screen is delightfully bright\n- Cameras are good for $499\n- Gemini Live Video AI has potential to be useful\n- Solid build\n- The under-$500 price\nCons\n- Battery life is just OK, will get through a day\n- Processor is serviceable (curious about longevity)\n- Lacks emergency SOS satellite texting\nFor $499, Google's Pixel 9A truly feels like you're getting more bang for your buck. It comes with several significant upgrades from last year's Pixel 8A: a fresh design, new display, larger battery, slightly more powerful chip, increased durability and upgraded software features.\nBut don't get me wrong -- it's not a perfect phone. There are places where Google had to compromise to keep the price under $500, like the lack of satellite connectivity for emergencies available on the $799 Pixel 9. Overall, though, I think the compromises Google made were smart and that the Pixel 9A is worth every penny. Read our Google Pixel 9A review.\nWhy we like it\nThe Pixel 9A is proof that you don't need to spend more than $500 to get a great phone. It can handle all you daily tasks from scrolling social media and news feeds and swiping through TikTok videos to taking a beautiful photo and lasting a day on a single charge.\nWho's it best for?\nIn theory: anybody. The Pixel 9A is for anyone who wants 95% of what a $1,000 phone can do at half the price.\nWho shouldn't get it\nAnyone who wants the absolute fastest processor or the most cutting edge cameras.\nPros\n- USB-C port is more convenient charging\n- Colorful matte design\n- Improved camera that can automatically take people and pet portraits\n- Dynamic Island brings better multitasking\nCons\n- No always-on display\n- Find My Friends feature only works with other iPhone 15 phones\n- Discounted iPhone 14 Pro may be a better value\n- Galaxy S24 offers a longer optical zoom\nWith the launch of the iPhone 16, the regular iPhone 15 is being sold at a discount -- $100 off. That means that the iPhone 15 now starts at $699. And you might be able to find steeper discounts throughout the coming weeks and months. With the Dynamic Island, a USB-C port for more convenient charging and a high resolution camera and a sharper digital zoom, I found the iPhone 15 to be a significant upgrade for those with older iPhones.\nThe iPhone 15 is available in two size options: the 6.1-inch iPhone 15 and the 6.7-inch iPhone 15 Plus. They run on the same chip as iPhone 14 Pro, the A16 Bionic, which should bring notable performance upgrades to those with an iPhone that's several years old. These phones also have Apple's second-generation ultra wideband chip, enabling a new feature that makes it easier to find friends or family members in a crowd which I found handy. Read our full iPhone 15 review.\nWhy we like it\nThe iPhone 15 and 15 Plus are heavily influenced by the iPhone 14 Pro. That includes the Dynamic Island, a dedicated area near the top of the screen for viewing time-sensitive data like your Uber's ETA, and the A16 Bionic processor. Overall, these changes come together to make the iPhone 15 feel like a big step forward for those upgrading from an aging iPhone.\nWho it's best for\nThe iPhone 15 is for someone coming from an iPhone 12 or older. In 2025, Apple sells it for $699. But I recommend looking for one that's discounted. If you're contemplating the iPhone 16E but really want an ultrawide camera (remember the 16E only has a single rear camera) and MagSafe charging, then grab an iPhone 15.\nWho shouldn't get it\nApple sells the $599 iPhone 16E which makes the iPhone 15 a curious value. If you can score a discounted iPhone 15 I'd go that way. But otherwise, the iPhone 16E might be a better buy.\nPros\n- Genuinely fun new AI skills\n- Sleek new design\n- Seven years of software updates\n- Cameras can take great daytime shots\nCons\n- Camera hardware hasn't improved much over Pixel 8 Pro\n- Gemini AI will eventually require a paid subscription\nThe Pixel 9 Pro and 9 Pro XL have a lot going for them, from their shiny new designs and long software support period. But it's the AI skills that really stand out, from the deep integration of the conversational Gemini Live, to the new Pixel Studio that creates weird and wonderful images from your text prompts.\nThe phones aren't perfect. While the cameras are good and can take excellent photos in bright light, they're just okay in low-light and in night mode. The best AI features will require a monthly subscription (though you get the first year for free) But if you're keen to experiment with AI on your phone then the new Pixel 9 Pro range is a superb way to experience it. Read our Google Pixel 9 Pro and 9 Pro XL review.\nWhy we like it\nGoogle's Pixel line of phones has gone from strength to strength and its latest model is unquestionably the best phone the company has ever made. It's not just the slick-looking design; the Pixel 9 Pro offers a superb camera system, a generous support period and a host of new AI skills making it one of the most accomplished Android phones around. The 9 Pro XL takes that further by accommodating a bright and vibrant 6.8-inch display.\nWho it's best for\nIt's a great phone for those of you looking for an elegant everyday Android phone. The interface is easy to navigate and the camera takes great photos with almost no effort on your part. If you feel overwhelmed by the plethora of settings and menus on other Android flagships, Google's Pixel 9 Pro is the way to go. If playing mobile games or watching videos on the go is a priority, opt for the larger Pixel 9 Pro XL.\nWho shouldn't get it\nIf you don't need the best cameras Google makes, consider the regular Pixel 9. I do like the fit and finish better on the 9 Pro, but it starts at $999.\nPros\n- The 6.9-inch screen is immersive, with lovely colors and contrast\n- The 4.1-inch screen looks incredible\n- It's durable and survived a drop onto concrete\n- One UI 8 (Android 16) runs wonderfully\n- $1,100 is still a lot, but Samsung gives the phone more value than the Flip 6\nCons\n- Gets warm when recording videos and playing games\n- Battery life is the same as the Flip 6 despite a bigger battery\n- Cover screen software has room to grow\nWhen I first got my hands on Samsung's new Galaxy Z Flip 7, I was delighted to discover that it has a smaller crease, larger cover screen, thinner design and bigger battery compared to last year's Galaxy Z Flip 6. But as I tested the new clamshell phone, I became enthralled by its inner screen. At 6.9 inches, this is the biggest screen on any Samsung phone aside from the Galaxy Z Fold 7, which has an 8-inch foldable display.\nThe Z Flip 7's large screen size makes content feel more immersive and colors look lovely and vivid. This led to epic TikTok and Instagram sessions, watching widescreen films such as A Working Man and Back to the Future, as well as jumping back and forth between two apps stacked vertically on the screen thanks to One UI 8's 90:10 split tool.\nEvery time I open the Flip 7, I'm consistently dumbfounded by how such a large display can unfurl from something about the size of a makeup compact. And when it's closed, there's a 4.1-inch cover screen that's fantastic in its own ways, with new clever animations for when you're recording a video, charging the phone or taking a selfie, all efficiently using the extra display real estate. In terms of functionality, though, the cover screen's software is about the same as the 3.4-inch one on the Flip 6.\nThe Flip 7 impressed me in nearly every way but one: its battery life. It has a larger battery than the Flip 6, but it doesn't last any longer in daily use. It did consistently get me through a day on a single charge, often having 15 to 20% left, but there were also a few days where it needed an early evening top-off.\nWhy we like it\nThe Galaxy Z Flip 7 is the most fully realized version of Samsung's ideal of a flip phone since the launch of the original Galaxy Z Flip in 2020. The Flip 7's appeal is simple: It's a thin phone with a big, bold screen that folds in half into a coaster-sized square. The larger cover screen and inner screen make content more immersive. It's design is thin (for a clamshell foldable) and comfortable to hold. Plus you get twice the storage this year compared to last.\nWho is it best for\nIf you've been tempted by a clamshell-style foldable, you should definitely consider the Flip 7. If you have a Galaxy Z Flip 4 or older, the Flip 7 will be an upgrade in every way. It's harder to make that same recommendation for Flip 5 owners unless your phone is showing its age. And if you have a Galaxy Z Flip 6, you can sit this one out unless you really want those larger screens.\nWho shouldn’t get it\nIf you spend a ton of time around dirt or sand, this phone isn't for you.\nPros\n- Lightning fast charging\n- Nice big screen\n- 7 years of OS and security upgrades\n- Great performance with games, movies and animations\nCons\n- Battery life is a day, similar to baseline S25\n- Similar specs as the S25 at a higher price\n- Rival phones at the same price have better cameras\nIf the baseline Galaxy S25 appeals to you but you'd rather have a bigger screen and higher battery capacity – without upgrading all the way to the Ultra – the S25 Plus may be the phone for you. The entire S25 lineup shares many features, from AI capabilities to processing power to memory, so the Plus may be a viable choice if you're looking for something right in the middle.\nThat said, the Plus' minimal upgrades over the baseline S25 may not justify the $200 price difference. But if a bigger phone just feels better to hold and you'd rather have a 4,900 mAh battery (over the S25's 4,000mAh one), then that $1,000 starting price might ultimately be worth every penny. Read CNET's full Samsung Galaxy S25 Plus review.\nWhy we like it\nWhile the baseline S25 checks all the key boxes, the S25 Plus can simply feel like a more comfortable device to use, especially if you're a fellow member of the bigger hands club. In addition to sharing many of the same features as the pricier S25 Ultra, the S25 Plus has a higher battery capacity than the baseline model -- though in CNET's tests, there weren't any major discrepancies in how the two batteries actually performed. Still, sometimes you just want to live a little larger, and this phone can be the perfect fit.\nWho it's best for\nIf you like having a larger screen to watch movies or play games on, the S25 Plus can be a great choice. While the S25 Ultra might be a top pick for someone who wants both a bigger phone and the most premium features, the S25 Plus can be that goldilocks device that meets you right in the middle -- without you having to spend $1,300 on the Ultra.\nWho shouldn’t get it\nIf you want the absolute best in terms of cameras, don't get the S25 Plus. For $1,000 phones like the Pixel 9 Pro or iPhone 16 Pro have better cameras. Or if you can afford to buy a $1,300 phone, check out the Galaxy S25 Ultra which has an amazing set of lenses\nPros\n- Beautiful design that feels durable\n- Fun and somewhat useful AI features\n- New ultrawide camera takes good photos\n- 7 years of software updates for longevity\nCons\n- More expensive that previous Pixels and competitors\n- Doesn't feel that different from Pixel 8\nThere’s a lot to like about the Pixel 9, from its respectable camera to its classy new design and lengthy 7-year timeline for software updates. But Google’s phones have always shined for their clean, slick software, and that once again applies to the Pixel 9 series. Pixels are also among the first to get new software updates, making them an ideal choice for those who want to get their hands on the latest version of Android first. Aside from Android updates, Google also brings new features to Pixel phones throughout the year through updates it calls Feature Drops.\nThe Pixel 9 comes with a few new AI tricks that you may find useful, like the ability to search for content in screenshots, generate images from scratch in the Pixel Studio app and add new objects in photos. These features aren’t must-haves, and they’re not without flaws. Plus, at a starting price of $799, the Pixel 9 has a higher bar to live up to. But the Pixel 9 feels like it belongs in that class of device. Read our full review for the Google Pixel 9.\nWhy we like it\nThe Pixel 9 and Google's Gemini assistant still feel like a first step toward what the company is hoping to achieve: Making phone software more intelligent so that we can spend less time swiping, tapping, scrolling and digging. In the meantime, the Pixel 9 shines for its great camera, elegant design and clean software, just like the less AI-centric Pixels of years past.\nWho it's best for\nIf you're a Pixel fan upgrading from an older phone, like the Pixel 6 or earlier, you'll find a lot to love about the Pixel 9. But keep in mind that for the same price, Samsung's Galaxy S25 has a brighter screen and a dedicated telephoto lens for taking zoomed photos.\nWho shouldn't get it\nIf you want the absolute best cameras that Google makes, including having a dedicated telephoto lens, I'd recommend the Pixel 9 Pro.\nBest phones compared\n| Product | Apple iPhone 16 | Apple iPhone 16 Pro | Apple iPhone 15 | Google Pixel 9 | Google Pixel 9 Pro | Google Pixel 9 Pro XL | Samsung Galaxy S25 | Samsung Galaxy S25 Plus | Samsung Galaxy S25 Ultra | Moto G Power 5G (2024) | Motorola Razr Plus (2024) |\n|---|---|---|---|---|---|---|---|---|---|---|---|\n| Display size, tech, resolution, refresh rate | 6.1-inch OLED; 2,556 x 1,179 pixel resolution; 60Hz refresh rate | 6.3-inch OLED; 2,622 x 1,206 pixel resolution; 1-120Hz adapative refresh rate | 6.1-inch OLED; 2,556x1,179 pixels; 60Hz refresh rate | 6.3-inch OLED; 2,424x1,080 pixels; 60-120 Hz variable refresh rate | 6.3-inch LTPO OLED; 2,856x1,280 pixels; 1-120Hz variable refresh rate | 6.8-inch LTPO OLED; 2,992x1,344 pixels; 1-120Hz variable refresh rate | 6.2-inch AMOLED; 2,340x1,080 pixels; 1-120Hz adaptive refresh rate | 6.7-inch AMOLED; 3,120x1,440 pixels; 1-120Hz adaptive refresh rate | 6.8-inch AMOLED; 3,120x1,440 pixels; 1-120Hz adaptive refresh rate | 6.7-inch LCD; 2,400 x 1,080 pixels, 60-120Hz refresh rate | 4-inch pOLED; 1,272 x 1,080 pixels; 1-165Hz variable refresh rate; 6.9-inch pOLED; 2,640 x 1,080 pixels, 1-165Hz variable refresh rate |\n| Pixel density | 460 ppi | 460 ppi | 460 ppi | 422 ppi | 495 ppi | 486 ppi | 416 ppi | 509 ppi | 501 ppi | 391 ppi | Cover: 417 ppi; Internal: 413 ppi |\n| Dimensions (inches) | 5.81 x 2.82 x 0.31 inches | 5.89 x 2.81 x 0.32 inches | 2.82x5.81x0.31 inches | 6x2.8x0.3 inches | 6x2.8x0.3 inches | 6.4x3x0.3 inches | 5.78 x 2.78 x 0.28 in. | 6.24 x 2.98 x 0.29 in. | 6.41 x 3.06 x 0.32 in. | 6.6 x 3 x 0.3 in. | Open: 6.75 x 2.91 x 0.28 in Closed: 3.47 x 2.91 x 0.6 in |\n| Dimensions (millimeters) | 147.6 x 71.6 x 7.8mm | 149.6 x 71.5 x 8.25mm | 71.6x147.6x7.8 mm | 152.8x72x8.5 mm | 152.8x72x8.5 mm | 162.8x76.6x8.5 mm | 146.9 x 70.5 x 7.2 mm | 158.4 x 75.8 x 7.3 mm | 162.8 x 77.6 x 8.2 mm | 167.2 x 76.4 x 8.5mm | Open: 171.42 x 74 x 7.09mm Closed: 88.09 x 74 x 15.32mm |\n| Weight (grams, ounces) | 170 g (6 oz.) | 199 g (7.03 oz.) | 171g (6.02 oz.) | 198g (7 oz.) | 199g (7 oz.) | 221g (7.8 oz) | 162g (5.71 oz.) | 190g (6.70 oz.) | 218g (7.69 oz.) | 201g (7.09 oz.) | 189g (6.67 oz) |\n| Mobile software | iOS 18 | iOS 18 | iOS 17 | Android 14 | Android 14 | Android 14 | Android 15 | Android 15 | Android 15 | Android 14 | Android 14 |\n| Camera | 48-megapixel (wide), 12-megapixel (ultrawide) | 48-megapixel (wide), 48-megapixel (ultrawide) 5x telephoto | 48-megapixel (wide), 12-megapixel (ultrawide) | 50-megapixel (wide), 48-megapixel (ultrawide) | 50-megapixel (wide), 48-megapixel (ultrawide), 48-megapixel (5x telephoto) | 50-megapixel (wide), 48-megapixel (ultrawide), 48-megapixel (5x telephoto) | 50-megapixel (wide), 12-megapixel (ultrawide), 10-megapixel (3x telephoto) | 50-megapixel (wide), 12-megapixel (ultrawide), 10-megapixel (3x telephoto) | 200-megapixel (wide), 50-megapixel (ultrawide), 10-megapixel (3x telephoto), 50-megapixel (5x telephoto) | 50-megapixel (wide), 8-megapixel (ultrawide) | 50-megapixel (wide) 50-megapixel (2x telephoto) |\n| Front-facing camera | 12-megapixel | 12-megapixel | 12-megapixel | 10.5-megapixel | 42-megapixel | 42-megapixel | 12-megapixel | 12-megapixel | 12-megapixel | 16-megapixel | 32-megapixel |\n| Video capture | 4K | 4K | 4K | 4K | 4K | 4K | 8K | 8K | 8K | 1,080p | 4K |\n| Processor | Apple A18 | Apple A18 Pro | Apple A16 Bionic | Google Tensor G4 | Google Tensor G4 | Google Tensor G4 | Qualcomm Snapdragon 8 Elite for Galaxy | Qualcomm Snapdragon 8 Elite for Galaxy | Qualcomm Snapdragon 8 Elite for Galaxy | Mediatek Dimensity 7020 | Snapdragon 8S Gen 3 |\n| RAM + storage | RAM N/A + 128GB, 256GB, 512GB | RAM N/A + 128GB, 256GB, 512GB, 1TB | RAM N/A + 128GB, 256GB, 512GB | 12GB RAM + 128GB, 256GB | 16GB + 128GB, 256GB, 512GB, 1TB | 16GB + 128GB, 256GB, 512GB, 1TB | 12GB RAM + 128GB, 256GB | 12GB RAM + 256GB, 512GB | 12GB RAM + 256GB, 512GB, 1TB | 8GB RAM + 128GB | 12GB + 256GB |\n| Expandable storage | None (Face ID) | None (Face ID) | None (Face ID) | None | None | None | None | None | None | Up to 1TB | None |\n| Battery | Up to 22 hours video playback; up to 18 hours video playback (streamed). 20W wired charging. MagSafe wireless charging up to 25W with 30W adapter or higher; Qi2 up to 15W | Up to 27 hours video playback; up to 22 hours video playback (streamed). 20W wired charging. MagSafe wireless charging up to 25W with 30W adapter or higher; Qi2 up to 15W | Undisclosed; Apple claims up to 20 hours of video playback (16 hours streamed) | 4,700 mAh | 4,700 mAh | 5,060 mAh | 4,000 mAh | 4,900 mAh | 5,000 mAh | 5,000 mAh | 4,000 mAh |\n| Fingerprint sensor | None (Face ID) | None (Face ID) | Face ID | Under display | Under display | Under display | Under display | Under display | Under display | Side | Side |\n| Connector | USB-C | USB-C | USB-C | USB-C | USB-C | USB-C | USB-C | USB-C | USB-C | USB-C | USB-C |\n| Headphone jack | None | None | None | None | None | None | None | None | None | Yes | None |\n| US starting price | $799 (128GB) | $999 (128GB) | $799 (128GB) | $799 (128GB) | $999 (128GB) | $1,099 (128GB) | $800 (128GB) | $1,000 (256GB) | $1,300 (256GB) | $300 (128GB) | $1,000 (256GB) |\n| UK starting price | £799 (128GB) | £999 (128GB) | £799 (128GB) | Converts to £640 (128GB) | Converts to £780 (128GB) | Converts to £860 (128GB) | £799 (128GB) | £999 (256GB) | £1,249 (256GB) | Converts to £234 (128GB) | Converts to £779 (256GB) |\n| Australia starting price | AU$1,399 (128GB) | AU$1,799 (128GB) | AU$1,499 (128GB) | Converts to AU$1,210 (128GB) | Converts to AU$1,510 (128GB) | Converts to AU$1,670 (128GB) | AU$1,399 (256GB) | AU$1,699 (256GB) | AU$2,149 (256GB) | Converts to AU$453 (128GB) | Converts to AU$1,483 (256GB) |\nRecent updates\nIn July 2025, we added the Samsung Galaxy Z Fold 7 and Galaxy Z Flip 7 to our list. The Fold 7 replaces last year's Fold 6 and comes with a completely new design that makes it thinner, lighter and feel more like a \"regular phone.\" The Flip 7 is the best-built foldable flip phone we tested from Samsung. The thinner design and bigger displays are the headline features.\nFactors to consider when buying a new phone\nPick the most important feature: Is it screen size? Camera quality? Battery life? This will help narrow down your choices. Phones like the iPhone 16 Pro Max or Galaxy S25 Ultra cost well over $1,000, for example, but pack large batteries that will last most people a day and a half to two days on a single charge.\nDon't dismiss $500 to $800 phones: You can get a great phone that does almost everything that a more expensive flagship model can do for a fraction of the price. Google's Pixel 9 (which starts at $799) packs a great camera, a bright screen and unique AI features, but the $499 Pixel 8A has most of the same key specs and comes at a lower price.\nShop Cyber Monday: Look for sales and deals close to holidays, especially Amazon's Prime Day and Cyber Monday.\nConsider last year's models: When a new phone gets launched, stores and carriers discount their older phones to sell off existing stock.\nSee the phone in person: It's worth going to a store and trying out a potential phone. You may love or hate the way it looks and feels.\nDecide on Android or iPhone: Do you have a lot of iPhone apps and Apple subscriptions? Stick with an iPhone. If you've invested in loads of Android apps, you may want to stay on that side of the fence. Otherwise, it's simple enough to switch platforms.\nBudget for a case and screen protector: Phones sold today are more durable than phones from even a few years ago, but it still might be a good idea to protect your phone with a case to keep it in tip-top shape.\nHow we test phones\nWe test every phone in real-world scenarios, focusing on its features, design, performance, cameras, battery life and overall value. We document our findings in an initial review that is periodically updated when there are new software updates, or to compare it against new phones from competitors such as Apple, Samsung, Google and OnePlus.\nPhotography\nPhotography is a major focus for most phones these days, so we take pictures and videos of various subjects in a variety of settings and lighting scenarios. We try out any new camera modes, such as 4K slow motion video that debuted with the iPhone 16 Pro and 16 Pro Max, or the new Magic Editor photo tools that launched with the Google Pixel 9 series.\nBattery life\nBattery testing is conducted in a variety of ways. We assess how long a phone lasts during a typical day of use and note how it performs during more focused sessions of video calls, media streaming and gaming. We also conduct a video playback test, as a simple, replicable measure of pure battery life, which isn't always included in the initial review but sometimes added later in an update.\nWe use benchmarking apps to measure each phone's performance, alongside our own anecdotal experiences using the phone for our review. Most noteworthy is how graphics and animations look. Are they smooth? Do they lag or stutter? We also look at how quickly the phone switches between horizontal and vertical orientations, and how fast the camera app opens and is ready to take a photo.\nWe perform processor-heavy tasks like editing photos, exporting videos and playing games. We evaluate whether a newer version of a particular phone includes enough features to make it worth upgrading from older models.\nPerformance measuring\nRead more: How We Test Phones\nOther phones we tested\nWhile Apple doesn't sell the iPhone 15 Pro, you can still find it at carriers and third-party retailers. The 15 Pro has a 6.1-inch adaptive-refresh rate screen that adjusts between 1-120Hz depending on what's on the screen. It has excellent cameras, a fast processor, an always-on display, supports iOS 18 and safety features like Crash Detection and Emergency SOS via Satellite. Driving all these upgrades is Apple's A17 Pro chip which in use feels peppy. The iPhone 15 Pro is still an excellent phone in 2025. Check out our iPhone 15 Pro review.\nPhone FAQs\nWhat is the best time to buy a phone?\nHow long should a phone battery last?\nHow much storage should I get on a phone?\nWhat are the best phone brands currently?\nWhat to look forward to in 2025\nGoogle is expected to launch the Pixel 10 series in August. There's also buzz for the next iPhone, likely called the iPhone 17 -- from a slimmer version of the upcoming device to a new screen with a higher refresh rate on baseline models. We've rounded up rumors, leaks and analysis on the iPhone 17 Air (one of several nicknames for Apple's next iPhone). Read CNET's iPhone 17 rumor roundup for more info."
    },
    {
      "url": "https://www.cnet.com/tech/mobile/these-3-ios-settings-can-drain-your-iphone-battery/",
      "text": "The longer you've had your iPhone, the more you'll notice that the battery doesn't last the way it did when it was fresh out of the box. Over time phone batteries gradually degrade, robbing them of their ability to hold a charge. That doesn't mean that you need to constantly charge your phone, or keep it in Low Power Mode though. By tweaking a few settings you can help your battery to last longer, even if it's a few years old.\nWhether you're using your phone to get directions, stream music or send that one last text, the last thing you want is for it to shut down at the worst possible moment. Instead of scrambling for a charger or switching on Low Power Mode every few hours, take a minute to check your iPhone settings. Turning off a few power-draining features could be the fix your battery desperately needs-and it only takes seconds to do.\nYou can also keep an eye on your Battery Health menu -- it'll tell you your battery health percentage (80% or higher is considered good), as well as show you how many times you've cycled your battery and whether or not your battery is \"normal.\"\nWe'll explain three iOS features that put a strain on your iPhone's battery to varying degrees, and show how you can turn them off to help preserve battery life. Here's what you need to know.\nTurn off widgets on your iPhone lock screen\nAll the widgets on your lock screen force your apps to automatically run in the background, constantly fetching data to update the information the widgets display, like sports scores or the weather. Because these apps are constantly running in the background due to your widgets, that means they continuously drain power.\nIf you want to help preserve some battery on iOS 18, the best thing to do is simply avoid widgets on your lock screen (and home screen). The easiest way to do this is to switch to another lock screen profile: Press your finger down on your existing lock screen and then swipe around to choose one that doesn't have any widgets.\nIf you want to just remove the widgets from your existing lock screen, press down on your lock screen, hit Customize, choose the Lock Screen option, tap on the widget box and then hit the \"—\" button on each widget to remove them.\nReduce the motion of your iPhone UI\nYour iPhone user interface has some fun, sleek animations. There's the fluid motion of opening and closing apps, and the burst of color that appears when you activate Siri with Apple Intelligence, just to name a couple. These visual tricks help bring the slab of metal and glass in your hand to life. Unfortunately, they can also reduce your phone's battery life.\nIf you want subtler animations across iOS, you can enable the Reduce Motion setting. To do this, go to Settings > Accessibility > Motion and toggle on Reduce Motion.\nSwitch off your iPhone's keyboard vibration\nSurprisingly, the keyboard on the iPhone has never had the ability to vibrate as you type, an addition called \"haptic feedback\" that was added to iPhones with iOS 16. Instead of just hearing click-clack sounds, haptic feedback gives each key a vibration, providing a more immersive experience as you type. According to Apple, the very same feature may also affect battery life.\nAccording to this Apple support page about the keyboard, haptic feedback \"might affect the battery life of your iPhone.\" No specifics are given as to how much battery life the keyboard feature drains, but if you want to conserve battery, it's best to keep this feature disabled.\nFortunately, it is not enabled by default. If you've enabled it yourself, go to Settings > Sounds & Haptics > Keyboard Feedback and toggle off Haptic to turn off haptic feedback for your keyboard.\nFor more tips on iOS, read about how to access your Control Center more easily and why you might want to only charge your iPhone to 95%."
    },
    {
      "url": "https://www.cnet.com/tech/mobile/best-iphone/",
      "text": "There are five models in Apple's current iPhone 16 lineup, and we tested and reviewed them all. Each has a different appeal, depending on your needs and budget. The $829 iPhone 16 gets you new buttons for shortcuts, an additional camera and MagSafe. Then there's the $999 iPhone 16 Pro, which has a new camera and a bigger screen. The $599 iPhone 16E is the most affordable. It has the same chip as the iPhone 16, along with a single rear camera, but it lacks Apple's most notable features, like MagSafe charging. Please note that we expect the iPhone 17 series to be revealed in September. So it might be best to hold off on buying any new iPhone until then.\nOur Picks\nMOBILE DEALS OF THE WEEK\n- $449 (save $50)\n- $550 (save $50)\n- $300 (save $100)\nWhat's the best iPhone right now?\nThe best iPhone for most people is the $799 iPhone 16. We think the iPhone 16 and 16 Plus are ideal for most people looking for a great phone that will last for years. It comes in two sizes: a 6.1-inch regular iPhone 16 model or a larger, 6.7-inch iPhone 16 Plus model that starts at $899. The phones have a new 12-megapixel ultrawide camera that performs better in low light and can now take macro photos, meaning you'll be able to focus close to take amazing food snaps.\nThe iPhone 16 and 16 Plus have a handful of Apple Intelligence tools for writing, removing distractions from photos and creating summaries of messages and web pages. There's also ChatGPT integration with Siri. The phones have an Action button, too, which can be programmed for different functions like turning on the flashlight, recording a voice memo, changing the focus mode and more. There's also a new Camera Control button that not only lets you take photos and quickly change things like zoom, Portrait mode aperture and Photographic Styles, but can also trigger a new feature called Visual Intelligence, which will add context to whatever the camera is pointed at.\nBest iPhones of 2025\nPros\n- Camera Control is useful for switching camera settings\n- Photographic Styles makes photos pop\n- Ultrawide camera is better in low light\nCons\n- Apple Intelligence isn’t out yet\n- No always on display\n- No changes to wired charging speeds\n- No upgrades to the Action button\nWhen I tested the iPhone 16 and 16 Plus I was definitely impressed by the new photography features, the convenient Action button and the elegant build. I consider these phones to be top-notch choices for Apple fans. Parts of the iPhone 16’s key feature, Apple Intelligence, are now out, and the fact that these phones will support it means they’ll likely feel future-proofed for years to come. Aside from screen size (6.1 inches on the regular, 6.7 inches on the Plus), battery size and price, the iPhone 16 and 16 Plus are identical in every way.\nThe iPhone 16 isn’t perfect -- it’s missing an always-on display, and it feels like it’s been ages since Apple improved its wired charging speeds. But it checks all the important boxes and then some.\nWhy we like it\nThe iPhone 16 and 16 Plus rank so high in our testing because the phones appeal to both novice users and power players a like. They offer about 90% of the experience of Apple's Pro models but cost hundreds of dollars less. Not only is the iPhone 16 a wonderful phone out of the box, Apple has a long track record of updating its software and security patches for years.\nWho it's best for\nWhen you think about how the Camera Control key, the Action button and the Dynamic Island come together, along with the camera and battery improvements Apple has made over the last several years, the iPhone 16 is a compelling upgrade for someone coming from an older iPhone, especially if that person is on an iPhone 13 or older. For those who don’t need the Pro’s extra photography prowess and battery life, the iPhone 16 won’t disappoint.\nWho shouldn’t get it\nI wouldn't recommend buying the iPhone 16 just for the Camera Control button or the better ultrawide camera.\nPros\n- Larger screens/thinner bezels\n- 4K slo-mo OMG\n- Audio Mix is brilliant\n- iOS 18\nCons\n- No Apple Intelligence out of the box\n- Camera Control placement not optimal for one-handed shooting\n- Elegant finishes aren't very colorful\n- Only 128GB of storage for $1,000\nThe iPhone 16 Pro and 16 Pro Max have everything I've come to expect in a year-over-year upgrade. The 6.3-inch iPhone 16 Pro and 6.9-inch iPhone 16 Pro Max have a slew of upgrades including one of the best batteries on any phone I've tested as well as. In our testing it will easily last a day on a single charge.\nThe phones also have larger displays, outstanding photo and video chops, high-resolution slo-mo, a new Camera Control button, iOS 18 goodies and a handful of Apple Intelligence tools. The negatives are as thin as the borders around the new screens: You only get 128GB of storage for $1,000; there are only drab color options, and a the new camera button is easy to tap accidentally. Read our full iPhone 16 Pro and 16 Pro Max review.\nWhy we like it\nThis year the 16 Pro and 16 Pro Max have the exact same cameras -- unlike the 15 Pro and 15 Pro Max, which had different telephoto options. Screen size, battery life and price should be the deciding factors when you're choosing between the two. The iPhone 16 Pro and Pro Max are excellent phones worthy of a spot in your pocket (and mine) if you can afford them.\nWho it's best for\nIf you have an iPhone 12 Pro or older, upgrading to the 16 Pro makes a lot of sense. If you're on a 13 Pro and still have a decent battery capacity, I'd say save your money. And if you're on a 14 Pro or 15 Pro, there's no need to upgrade. Also, I should note that the entry-level $999 iPhone 16 Pro only has 128GB of storage.\nWho shouldn't get it\nIf you are looking for a budget phone or don't need a phone with the latest features or tech.\nPros\n- Does most of the Apple stuff I want\n- Battery life is great\n- Matte finish back\n- The rear camera is good\n- A18 chip performance\nCons\n- $599 price isn't cheap\n- Odd value proposition\n- Lacks MagSafe\n- Screen is good, but wonder how it will age\nApple took a Taco Bell-like approach with the $599 iPhone 16E, mixing and matching parts and features from prior phones to create a \"new\" iPhone. Its design and screen are similar to the iPhone 14. Its A18 processor is the same as the one in the iPhone 16. In my testing, I found that this gives the iPhone 16E a weird value proposition. It's new, but it's old. It's affordable, but not cheap.\nIf you're rocking an iPhone SE, an iPhone 11 or older, the 16E will be a nice upgrade in every way, from the camera to the battery life -- though you might miss that ultrawide camera. I also think that this is a good phone for people using Android phones who want to switch and dip the proverbial toe into Apple's waters. I do recommend looking into carrier deals, discounts and trade-ins to drop that price a bit, unless you're set on doing an installment plan over a couple of years. Read our iPhone 16E review.\nWhy we like it\nAfter testing the iPhone 16E, I was most surprised by how wonderfully uneventful it was to use. Along with all the standard iOS 18 functions and goodies, like iMessage and FaceTime, I used Apple Intelligence, made calls on 5G, took a bunch of share-worthy photos and videos and played video games like Resident Evil 4. If this is all you want in an iPhone, look no further.\nWho it's best for\nIf you're rocking an iPhone SE, an iPhone 11 or older, the 16E will be a nice upgrade in every way, from the camera to the day plus battery life -- though you might miss that ultrawide camera. I also think that this is a good phone for people using Android phones who want to switch and dip the proverbial toe into Apple's waters.\nWho shouldn't get it\nChoosing between the $829 iPhone 16 and the $599 16E is a tough choice. If you have the budget, I'd go with the regular 16. You get a brighter screen, MagSafe, and an ultrawide camera that doubles as a macro lens -- great for taking close-up photos like of food since the main camera automatically switches to a cropped version of the ultrawide in order to nail focus.\nPros\n- USB-C port is more convenient charging\n- Colorful matte design\n- Improved camera that can automatically take people and pet portraits\n- Dynamic Island brings better multitasking\nCons\n- No always-on display\n- Find My Friends feature only works with other iPhone 15 phones\n- Discounted iPhone 14 Pro may be a better value\n- Galaxy S24 offers a longer optical zoom\nWith the launch of the iPhone 16, the regular iPhone 15 is being sold at a discount -- $100 off. That means that the iPhone 15 now starts at $699. And you might be able to find steeper discounts throughout the coming weeks and months. With the Dynamic Island, a USB-C port for more convenient charging and a high resolution camera and a sharper digital zoom, I found the iPhone 15 to be a significant upgrade for those with older iPhones.\nThe iPhone 15 is available in two size options: the 6.1-inch iPhone 15 and the 6.7-inch iPhone 15 Plus. They run on the same chip as iPhone 14 Pro, the A16 Bionic, which should bring notable performance upgrades to those with an iPhone that's several years old. These phones also have Apple's second-generation ultra wideband chip, enabling a new feature that makes it easier to find friends or family members in a crowd which I found handy. Read our full iPhone 15 review.\nWhy we like it\nThe iPhone 15 and 15 Plus are heavily influenced by the iPhone 14 Pro. That includes the Dynamic Island, a dedicated area near the top of the screen for viewing time-sensitive data like your Uber's ETA, and the A16 Bionic processor. Overall, these changes come together to make the iPhone 15 feel like a big step forward for those upgrading from an aging iPhone.\nWho it's best for\nThe iPhone 15 is for someone coming from an iPhone 12 or older. In 2025, Apple sells it for $699. But I recommend looking for one that's discounted. If you're contemplating the iPhone 16E but really want an ultrawide camera (remember the 16E only has a single rear camera) and MagSafe charging, then grab an iPhone 15.\nWho shouldn't get it\nApple sells the $599 iPhone 16E which makes the iPhone 15 a curious value. If you can score a discounted iPhone 15 I'd go that way. But otherwise, the iPhone 16E might be a better buy.\nThe iPhone 16 is the recipient of a CNET Editors' Choice award, and you can get one for free when you switch to T-Mobile. You just need to sign up for a qualified Experience Beyond Plan with up to four lines. There's no trade-in required, and T-Mobile will pay off your current eligible phone, up to $800, via a prepaid Mastercard. It’s never been easier to switch. (New line and port-in are required, and a $10 device activation charge applies.)\nBest iPhone models compared\n| Product | Apple iPhone 16 | Apple iPhone 16 Plus | Apple iPhone 16E | Apple iPhone 16 Pro | Apple iPhone 16 Pro Max | Apple iPhone 15 |\n|---|---|---|---|---|---|---|\n| Display size, tech, resolution, refresh rate | 6.1-inch OLED; 2,556 x 1,179 pixel resolution; 60Hz refresh rate | 6.7-inch OLED; 2,796 x 1,290 pixel resolution; 60Hz refresh rate | 6.1-inch OLED display; 2,532x1,170 pixels; 60Hz refresh rate | 6.3-inch OLED; 2,622 x 1,206 pixel resolution; 1-120Hz adapative refresh rate | 6.9-inch OLED; 2,868 x 1,320 pixel resolution; 1-120Hz adapative refresh rate | 6.1-inch OLED; 2,556x1,179 pixels; 60Hz refresh rate |\n| Pixel density | 460 ppi | 460 ppi | 460 ppi | 460 ppi | 460 ppi | 460 ppi |\n| Dimensions (inches) | 5.81 x 2.82 x 0.31 inches | 6.33 x 3.06 x 0.31 inches | 5.78 x 2.82 x 0.31 in. | 5.89 x 2.81 x 0.32 inches | 6.42 x 3.06 x 0.32 inches | 2.82x5.81x0.31 inches |\n| Dimensions (millimeters) | 147.6 x 71.6 x 7.8mm | 160.9 x 77.8 x 7.8mm | 146.7 x 71.5 x 7.8 mm | 149.6 x 71.5 x 8.25mm | 163 x 77.6 x 8.25mm | 71.6x147.6x7.8 mm |\n| Weight (grams, ounces) | 170 g (6 oz.) | 199 g (7.03 oz.) | 167g (5.88 oz.) | 199 g (7.03 oz.) | 227 g, (7.99 oz.) | 171g (6.02 oz.) |\n| Mobile software | iOS 18 | iOS 18 | iOS 18 | iOS 18 | iOS 18 | iOS 17 |\n| Camera | 48-megapixel (wide), 12-megapixel (ultrawide) | 48-megapixel (wide), 12-megapixel (ultrawide) | 48-megapixel (wide) | 48-megapixel (wide), 48-megapixel (ultrawide) 5x telephoto | 48-megapixel (wide), 48-megapixel (ultrawide) 5x telephoto | 48-megapixel (wide), 12-megapixel (ultrawide) |\n| Front-facing camera | 12-megapixel | 12-megapixel | 12-megapixel | 12-megapixel | 12-megapixel | 12-megapixel |\n| Video capture | 4K | 4K | 4K | 4K | 4K | 4K |\n| Processor | Apple A18 | Apple A18 | Apple A18 | Apple A18 Pro | Apple A18 Pro | Apple A16 Bionic |\n| RAM + storage | RAM N/A + 128GB, 256GB, 512GB | RAM N/A + 128GB, 256GB, 512GB | RAM unknown + 128GB, 256GB, 512GB | RAM N/A + 128GB, 256GB, 512GB, 1TB | RAM N/A + 256GB, 512GB, 1TB | RAM N/A + 128GB, 256GB, 512GB |\n| Expandable storage | None (Face ID) | None (Face ID) | None | None (Face ID) | None (Face ID) | None (Face ID) |\n| Battery | Up to 22 hours video playback; up to 18 hours video playback (streamed). 20W wired charging. MagSafe wireless charging up to 25W with 30W adapter or higher; Qi2 up to 15W | Up to 27 hours video playback; up to 24 hours video playback (streamed). 20W wired charging. MagSafe wireless charging up to 25W with 30W adapter or higher; Qi2 up to 15W | Up to 26 hours video playback, 21 hours streamed video playback, 90 hours of audio playback. 20W wired charging, 7.5W Qi wireless charging | Up to 27 hours video playback; up to 22 hours video playback (streamed). 20W wired charging. MagSafe wireless charging up to 25W with 30W adapter or higher; Qi2 up to 15W | Up to 33 hours video playback; up to 29 hours video playback (streamed). 20W wired charging. MagSafe wireless charging up to 25W with 30W adapter or higher; Qi2 up to 15W | Undisclosed; Apple claims up to 20 hours of video playback (16 hours streamed) |\n| Fingerprint sensor | None (Face ID) | None (Face ID) | None, Face ID | None (Face ID) | None (Face ID) | Face ID |\n| Connector | USB-C | USB-C | USB-C | USB-C | USB-C | USB-C |\n| Headphone jack | None | None | None | None | None | None |\n| US starting price | $799 (128GB) | $899 (128GB) | $599 (128GB) | $999 (128GB) | $1,199 (256GB) | $799 (128GB) |\n| UK starting price | £799 (128GB) | £899 (128GB) | £599 (128GB) | £999 (128GB) | £1,199 (256GB) | £799 (128GB) |\n| Australia starting price | AU$1,399 (128GB) | AU$1,599 (128GB) | AU$999 (128GB) | AU$1,799 (128GB) | AU$2,149 (256GB) | AU$1,499 (128GB) |\nRecent updates\nIn March 2025, we added the iPhone 16E to this list. The $599 price is more than Apple's previous cheap phone, the $429 iPhone SE, but it has a similar appeal especially for those currently on an older iPhone.\nFactors to consider when buying a new iPhone\nHold the iPhone first: You may love or hate the way it looks and feels in person.\nDon't discount the last year's model: Apple has a history of keeping recent iPhone models from previous years around at a lower price. You can get a great phone that does almost everything that a new iPhone 16 can do for a fraction of the price. The iPhone 15 packs a great camera and a big battery, but comes at a more reasonable price.\nBuy an iPhone case and screen protector: You'll protect your iPhone from costly damage, and will increase the phone's resale or trade-in value for when you're ready to move on.\nKnow what you care about most: Is it screen size? Camera quality? Battery life? Phones like the iPhone 15 Pro or Pro Max, for example, pack incredible cameras that almost rival the quality you'd get from a DSLR. If you're a photographer, then spending money here is a good idea.\nSeek out holiday discounts: Look for deep discounts and promo deals around major holidays, especially Amazon's Prime Day and Cyber Monday. And find out what your grace period is in case you need a quick return or exchange.\nHow we test iPhone models\nWe test every iPhone in real-world scenarios focusing on its features, design, performance, cameras, battery life and overall value. We document our findings in an initial review that is periodically updated when there are new iOS updates or to compare against new phones from competitors like Samsung, Google and OnePlus.\nPhotography\nPhotography is a major focus for the iPhone, so we take pictures and videos of various subjects in a variety of settings and lighting scenarios. We try out any new camera modes, such as 4K 120fps slow-mo video that debuted with the iPhone 16 Pro and 16 Pro Max.\nBattery life\nBattery testing is conducted in a variety of ways. We assess how long the iPhone lasts during a typical day of use, and note how it performs during more focused sessions of video calls, media streaming and gaming. We also conduct a video playback test and a 45-minute drain test starting with a full battery, which isn't always included in the initial review and added later in an update.\nPerformance measuring\nWe use benchmarking apps to measure the performance, alongside our own anecdotal experiences using the phone for our review. Of particular note are how graphics and animations look. Are they smooth? Or do they lag or stutter? We also look at how quickly the phone switches between horizontal and vertical orientations and how fast the camera app opens and is ready to take a photo.\nWe perform processor-heavy tasks like editing photos and videos, exporting videos and playing games. We evaluate whether a newer version of the iPhone includes enough features to make it worth upgrading from older models. Some of these tests are added later in updates after the initial review is published.\nRead more: How CNET Tests Phones\nOther iPhones we tested\nWhile Apple doesn't sell the iPhone 15 Pro, you can still find it at carriers and third-party retailers. The 15 Pro has a 6.1-inch adaptive-refresh rate screen that adjusts between 1-120Hz depending on what's on the screen. It has excellent cameras, a fast processor, an always-on display, supports iOS 18 and safety features like Crash Detection and Emergency SOS via Satellite. Driving all these upgrades is Apple's A17 Pro chip which in use feels peppy. The iPhone 15 Pro is still an excellent phone in 2025. Check out our iPhone 15 Pro review.\nKey terms\neSIM\nAn eSIM takes all of the important information about your phone account -- including its number, wireless carrier and subscription -- and stores it in software instead of on a physical SIM card.\nWith the iPhone 14, 15 and 16 series Apple removed the physical SIM card tray and embraced embedded SIM cards in the US. This means you can't just pluck your SIM card out of your current phone and put it into a new one. But this shouldn't affect your experience since all the major US carriers and a number of smaller operators work with eSIM.\nApple has long supported eSIM, dating back to 2018's iPhone XS, XS Max and XR. When setting up a new iPhone 14, 15 or 16, tthe device will guide you through transferring your current provider over to the new phone. A list of supported wireless networks can be found on Apple's website.\niOS 18\nApple's iOS 18 is the latest iPhone software version. It's on the iPhone 16 by default and is also available as an update for the iPhone XR and later. iOS 18 includes new features such as being able to move apps anywhere on your home screen, change an app icon's color and a size, add buttons to Control Center, use emoji and live photo stickers as Tapbacks in Messages, support for RCS in messages and eventually Apple Intelligence on some models.\niPhone FAQs\nWhen is the best time of year to buy a new iPhone?\niPhone or Android?\nShould I wait for the new iPhone model (iPhone 17)?\nHow reliable is an iPhone?\nHow long does an iPhone last?\nWhat to look forward to in 2025\nThere's already been plenty of buzz about what we could see with the next iPhone, likely called the iPhone 17 -- from a slimmer version of the upcoming device to a new screen with a higher refresh rate on baseline models. The camera module could also get a makeover, and reports suggest Apple will overhaul the look and feel of its software with the launch of iOS 19. Apple doesn't release details on future products, but to get an idea of what to expect, we rounded up rumors, leaks and analysis on the iPhone 17 Air (one of several nicknames for Apple's next iPhone). Read CNET's iPhone 17 rumor roundup for more info."
    },
    {
      "url": "https://www.cnet.com/tech-tips/",
      "text": "I Finally Cleared Out My Duplicate iPhone Photos. It Was Weirdly Therapeutic\n3 minutes ago\nI Never Charge My iPhone to 100%. Here's Why and How I Do It\n33 minutes ago\nNeed a Stronger Password? Generate Secure Options on Your iPhone in Moments With These Tricks\n4 hours ago\nIf Your Phone's Auto-Brightness Is Irritating You, Adjust These Settings Now\n5 hours ago\nOld Android Phone Feeling Sluggish? These Quick Fixes Will Revive It\n8 hours ago\nStill on the Fence About Getting a Password Manager? Here's Why You Need One and How to Set One Up\n8 hours ago\nThis iOS 26 Toggle 'Fixes' a Camera App Redesign Issue You Might Have Noticed\n12 hours ago\nThis Gmail Trick Saved My Overflowing Inbox, and It's Completely Free\n1 day ago\nThis Free Hack Turns Any Old Smartphone Into a Security Camera\n1 day ago\niPhone Users, Find Calls Faster With This Trick\n1 day ago\nYour Ultimate Google Maps Cheat Sheet for Easy Summer Travel\n2 days ago\nBinge Smarter: Use These Netflix Secret Codes to Find What You Really Want to Watch\n2 days ago\nYou Can Turn Your Pet Pictures Into Emoji on Your iPhone. Here's How\n2 days ago\nInstagram's New Map Feature Is Freaking People Out. But You Can Turn It Off\n3 days ago\nYou Don't Need iOS 26 to Get This Dreamy Wallpaper on Your iPhone Now\n3 days ago"
    }
  ],
  "argos_summary": "To extend the lifespan of your iPhone's battery, focus on features like Optimized Battery Charging and Charge Limit, which help reduce stress on the battery by preventing it from staying at 100% for too long. Additionally, utilizing Low Power Mode can conserve battery life, especially when the charge is low. Regularly checking battery health and adjusting settings such as screen brightness and location services can also help maintain battery performance over time.",
  "argos_id": "96LX8C478"
}