{
  "url": "https://www.thesun.co.uk/money/36248170/supermarket-launches-popular-discount-scheme/",
  "authorsByline": "Eliana Nunes",
  "articleId": "bf4559565ba949f8a29a90931d6771dc",
  "source": {
    "domain": "thesun.co.uk",
    "paywall": false,
    "location": {
      "country": "gb",
      "county": "West Yorkshire",
      "city": "Leeds",
      "coordinates": {
        "lat": 53.7440745,
        "lon": -1.5988598
      }
    }
  },
  "imageUrl": "https://www.thesun.co.uk/wp-content/uploads/2024/08/efdfc555-5c37-4d4a-bb31-d334c28ba3eb.jpg?strip=all&quality=100&w=1265&h=844&crop=1",
  "country": "gb",
  "language": "en",
  "pubDate": "2025-08-11T22:48:44+01:00",
  "addDate": "2025-08-11T22:29:37.650813+00:00",
  "refreshDate": "2025-08-11T22:29:37.650815+00:00",
  "score": 1.0,
  "title": "Supermarket giant launches popular discount scheme at its cafes nationwide",
  "description": "A MAJOR supermarket has launched an exclusive 10 per cent discount at its cafes nationwide. Morrisons is offering the discount to all Blue Light Card holders, and it’s available all day, every day …",
  "content": "A number of other brands are also participating in the discount scheme\n\nBAG A BARGAIN Supermarket giant launches popular discount scheme at its cafes nationwide – can you get 10% off?\n\nA MAJOR supermarket has launched an exclusive 10 per cent discount at its cafes nationwide.\n\nMorrisons is offering the discount to all Blue Light Card holders, and it’s available all day, every day with no minimum spend.\n\nBlue Light Card holders can grab Fish & Chips, Sausage & Mash and Morrisons’ Big Breakfast for 10 per cent less, according to a press release by the chain.\n\nMorrisons says it's the only major supermarket to roll out this change exclusively for Blue Light customers, pointing out that other supermarkets typically offer discounts on gift card purchases.\n\nEligible customers just need to show a valid Blue Light Card at the cafe till to get the discount.\n\nThe offer kicks off on August 11 and runs alongside Morrisons’ Kids Eat Free deal.\n\nFamilies can claim a free meal and drink for one child aged 16 or under when they buy an adult main meal costing £5 from The Breakfasts or The Classics.\n\nThe Birds Eye kids’ menu includes Chicken Dippers, Fish Fingers, Veggie Fingers, or Goodfella’s Mini 4 Cheese - all usually priced around £4.\n\nChildren must be under the age of 16 and with an adult to enjoy the offer.\n\nChris Strong, Senior Cafe Trader at Morrisons, said: “We’re proud to support the incredible individuals in the emergency services who go above and beyond every day by introducing a 10% Blue Light Card discount in our Cafés.\n\n\"Whether popping in for coffee, cake or one of our tasty meals, being able to offer our great value favourites for even less is our way of saying thank you.”\n\nThe deal is available at all 344 Morrisons cafés nationwide with a valid Blue Light Card.\n\nThe Blue Light Card scheme, launched in 2008, is designed to reward \"Blue Light\" and public sector workers with exclusive discounts from hundreds of retailers, including Apple, Asda and Domino’s.\n\nCardholders can save an average of over £800 a year, with discounts available on groceries, clothes, holidays, insurance, cars and thousands of restaurants, shops and venues - totalling around 15,000 deals.\n\nThe scheme is typically open to NHS staff, emergency services, social care workers and armed forces personnel.\n\nLast year, it was extended to include primary and secondary school teachers, along with staff at Sixth Form colleges and Special Schools.\n\nWhen the extension was announced, the website and app crashed due to \"unprecedented demand\" on the system.\n\nIf you’re eligible, you can get a free digital Blue Light Card or pay £4.99 for a physical one that lasts two years.\n\nYou can use the digital card by downloading the Blue Light Card app via Google Play or the App Store.\n\nBlue Light Card holders can also save big on holidays with discounts from Jet2, EasyJet and Expedia.",
  "medium": "Article",
  "links": [
    "https://www.thesun.co.uk/topic/police/",
    "https://www.thesun.co.uk/topic/schools/",
    "https://www.thesun.co.uk/topic/teachers/",
    "https://www.thesun.co.uk/topic/coffee/",
    "https://www.thesun.co.uk/money/18657038/blue-light-card-explained/",
    "https://www.thesun.co.uk/topic/easyjet/",
    "https://www.thesun.co.uk/topic/restaurants/",
    "https://www.thesun.co.uk/money/35457781/increase-chances-of-winning-scratchcards-lottery/",
    "https://www.thesun.co.uk/topic/nhs-crisis/",
    "https://www.thesun.co.uk/money/36240271/hobbycraft-closing-branches-southport-wigan-chichester/",
    "https://www.thesun.co.uk/topic/asda/",
    "https://www.thesun.co.uk/topic/prison/",
    "https://www.thesun.co.uk/money/36116651/jobs-qualify-blue-light-card-savings-asda-starbucks/",
    "https://www.thesun.co.uk/money/29019114/martin-lewis-money-saving-expert-blue-light-card-discounts/",
    "https://www.thesun.co.uk/money/36239356/households-have-days-left-to-apply-for-free-cash/",
    "https://www.thesun.co.uk/topic/cars/",
    "https://www.thesun.co.uk/topic/jet2/",
    "https://www.thesun.co.uk/money/36241869/urgent-warning-convincing-web-scams-shoppers-conned/",
    "https://www.thesun.co.uk/topic/nhs/",
    "https://www.thesun.co.uk/topic/google/",
    "https://www.thesun.co.uk/topic/morrisons/",
    "https://www.thesun.co.uk/topic/insurance/",
    "https://www.thesun.co.uk/topic/apple/",
    "https://www.thesun.co.uk/shopping/home-and-garden/36050841/amazon-tower-fan-heatwave-deal/",
    "https://www.thesun.co.uk/motors/36236479/blue-badge-holders-lose-discount/",
    "https://www.thesun.co.uk/topic/holidays/",
    "https://www.thesun.co.uk/money/29771918/blue-light-card-crashed-shoppers-discounts-teachers/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Blue Light Card",
      "weight": 0.12075669
    },
    {
      "name": "Blue Light Card holders",
      "weight": 0.118120044
    },
    {
      "name": "Blue Light",
      "weight": 0.11205412
    },
    {
      "name": "Blue Light customers",
      "weight": 0.108022004
    },
    {
      "name": "popular discount scheme",
      "weight": 0.09387752
    },
    {
      "name": "exclusive discounts",
      "weight": 0.08939358
    },
    {
      "name": "discounts",
      "weight": 0.0848871
    },
    {
      "name": "a free digital Blue Light Card",
      "weight": 0.07651373
    },
    {
      "name": "The Blue Light Card scheme",
      "weight": 0.07626251
    },
    {
      "name": "all Blue Light Card holders",
      "weight": 0.07534736
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.94287109375
    },
    {
      "name": "/Shopping/Mass Merchants & Department Stores",
      "score": 0.8828125
    },
    {
      "name": "/Food & Drink/Food & Grocery Retailers/Other",
      "score": 0.6875
    }
  ],
  "sentiment": {
    "positive": 0.27656284,
    "negative": 0.11030493,
    "neutral": 0.61313224
  },
  "summary": "Morrisons has launched an exclusive 10% discount at its cafes nationwide, offering to all Blue Light Card holders. The discount is available all day, every day, with no minimum spend. The offer, which began on August 11, includes a free meal and drink for one child aged 16 or under when they buy an adult main meal costing £5 from The Breakfasts or The Classics. Customers must be under the age of 16 and with an adult to enjoy the discount. The deal is available at all 344 Morrisons cafés nationwide. The scheme is typically open to NHS staff, emergency services, social care workers and armed forces personnel.",
  "shortSummary": "Morrisons has launched a 10% Blue Light Card discount at its cafes nationwide, offering discounts for Fish & Chips, with no minimum spend.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "03d175349dcd49cfad43b42ee4008469",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Morrisons has launched a 10% discount at its cafes nationwide for Blue Light Card holders, available all day with no minimum spend. This offer, which began on August 11, allows eligible customers to enjoy reduced prices on meals like Fish & Chips and Morrisons’ Big Breakfast. The Blue Light Card scheme rewards public sector workers, including NHS staff and emergency services, with various discounts across numerous retailers.",
  "argos_id": "9SDTD3OPO"
}