{
  "url": "https://www.forbes.com/sites/antoniopequenoiv/2025/08/11/texas-gov-will-push-for-controversial-redistricting-map-beyond-election-deadline-as-democrats-remain-out-of-state/",
  "authorsByline": "Antonio Pequeño IV, Forbes Staff",
  "articleId": "99c966bd67c14b4fb4e8d98d2e486eb5",
  "source": {
    "domain": "forbes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NJ",
      "county": "Hudson County",
      "city": "Jersey City",
      "coordinates": {
        "lat": 40.7215682,
        "lon": -74.047455
      }
    }
  },
  "imageUrl": "https://imageio.forbes.com/specials-images/imageserve/689a86e63039c2e94592a59a/0x0.jpg?width=960&precrop=922%2C615%2Cx0%2Cy0",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T20:13:11-04:00",
  "addDate": "2025-08-12T00:19:04.039064+00:00",
  "refreshDate": "2025-08-12T00:19:04.039067+00:00",
  "score": 1.0,
  "title": "Texas Gov. Will Go ‘Beyond’ Election Deadline To Pass Redistricting Map Opposed By Dems",
  "description": "The comment marks the latest show of support Texas Gov. Greg Abbott has made for a congressional redistricting map in the state that could net the GOP five additional seats in the U.S. House.",
  "content": "Texas Gov. Greg Abbott will continue pushing for a congressional redistricting map in the state “beyond” the candidate filing deadlines for the state’s upcoming primary election, doubling down on his open conflict with over 50 of Texas’ Democratic lawmakers who fled the state to block a vote on the map that could add five GOP seats in the U.S. House if it is adopted for the election. Abbott made the comments in an interview with CNN on Monday. (Photo by Brandon Bell/Getty Images)\n\nAbbott told CNN’s Jake Tapper in an interview Monday the Dec. 8 filing deadline for candidates participating in Texas’ primary election in March will not stop Republicans from redrawing the maps. Election officials have said they cannot move forward with March’s primary election without finalized maps, The Texas Tribune reported, meaning Democrats could continue blocking the vote on the redistricting map in hopes the upcoming election is conducted with the current map instead. However, Abbott appeared steadfast on not allowing the election to hinder the new map, saying if Democrats think they can wait things out until December, “they’re wrong, I’m going to do this for the next two years, and they're going to have to basically take up residency in Illinois,” one of a few states some of the Democrats have fled to. Abbott has also said he will repeatedly call for new special sessions needed to vote on the new map if he needs to, suggesting to NBC News on Aug. 8 that Democrats will not return to the state until “like 2027 or 2028, because I’m going to call special session after special session after special session with the same agenda items on there.”\n\nGet Forbes Breaking News Text Alerts: We’re launching text message alerts so you'll always know the biggest stories shaping the day’s headlines. Text “Alerts” to (201) 335-0739 or sign up here.\n\nCalifornia Gov. Gavin Newsom has threatened similar redistricting in his state if Texas goes through with its new congressional map, which could more than cancel out the potential five seats Texas may get from its own proposed map. In response, Abbott also told Tapper that Texas could remove 10 Democratic districts if California followed through on its own redistricting.\n\nWhat We Don’t Know\n\nWhen the Democrats will return to Texas. If they only intend to wait out the current special session for the vote on the redistricting map, they will need to stay out of the state until Aug. 20. The Democratic lawmakers like State Rep. Rafael Anchía have said they are open to returning to vote on other legislation, but will not return to “participate in an illegal act of violating the Voting Rights Act.”\n\nRedistricting in Texas has pushed back elections in the past. In 2012, the state’s primary election was delayed several months over disputes on a proposed congressional redistricting. A similar outcome could materialize this year, election officials told The Texas Tribune, expressing concern that a delay could end up in the loss of poll workers and locations already secured for April and March. In the meantime, Abbott and Texas attorney General Ken Paxton have filed petitions with the Texas Supreme Court to have 13 Democratic seats in the Texas House vacated, arguing some of the Democratic lawmakers have demonstrated “an intent to relinquish and abandon their offices” by leaving the state. However, the legal processes to vacate the seats could be lengthy and run into hurdles.\n\nTexas Gov. Wants Democrats Who Left State Kicked Out Of Office. Can He Legally Do It? (Forbes)\n\nTexas AG Ken Paxton Files Lawsuit To Vacate Seats Of 13 Democrats Who Fled State (Forbes)",
  "medium": "Article",
  "links": [
    "https://joinsubtext.com/forbes",
    "https://www.cnn.com/2025/08/11/politics/video/abbott-tapper-texas-redistricting-gene-wu-digvid",
    "https://www.forbes.com/sites/antoniopequenoiv/2025/08/08/texas-ag-ken-paxton-files-lawsuit-to-vacate-seats-of-13-democrats-who-fled-state/",
    "https://www.nbcnews.com/politics/elections/texas-gov-greg-abbott-moves-amp-pressure-democrats-fled-redistricting-rcna223581?utm_source=newsletter&utm_medium=email&utm_content=Click%20here&utm_campaign=Gov%20Abbott%20push%208.8.25",
    "https://www.forbes.com/sites/alisondurkee/2025/08/06/texas-gov-wants-democrats-who-left-state-kicked-out-of-office-can-he-legally-do-it/",
    "https://www.texastribune.org/2025/08/08/texas-redistricting-2026-election-primary/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Redistricting Map",
      "weight": 0.09970826
    },
    {
      "name": "Texas Gov. Greg Abbott",
      "weight": 0.09660718
    },
    {
      "name": "Texas Gov.",
      "weight": 0.096268296
    },
    {
      "name": "Texas",
      "weight": 0.09376469
    },
    {
      "name": "Texas AG Ken Paxton",
      "weight": 0.0899542
    },
    {
      "name": "Texas attorney General Ken Paxton",
      "weight": 0.087738246
    },
    {
      "name": "Election Deadline",
      "weight": 0.085139036
    },
    {
      "name": "finalized maps",
      "weight": 0.082081385
    },
    {
      "name": "Election officials",
      "weight": 0.081787184
    },
    {
      "name": "election officials",
      "weight": 0.081787184
    }
  ],
  "topics": [
    {
      "name": "US Politics"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.98193359375
    },
    {
      "name": "/News/Politics/Campaigns & Elections",
      "score": 0.96533203125
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.90625
    },
    {
      "name": "/Law & Government/Government/Legislative Branch",
      "score": 0.489990234375
    },
    {
      "name": "/News/Local News",
      "score": 0.4775390625
    }
  ],
  "sentiment": {
    "positive": 0.04909377,
    "negative": 0.68303406,
    "neutral": 0.2678721
  },
  "summary": "Texas Gov. Greg Abbott has stated that he will continue pushing for a congressional redistricting map in the state beyond the current Dec. 8 filing deadline for the upcoming primary election. This comes amid ongoing conflict with over 50 of Texas' Democratic lawmakers who have fled the state to block a vote on the map, which could add five GOP seats in the U.S. House if approved for the election. Election officials have stated that they cannot proceed with the primary election without finalized maps, which may result in a delay in poll workers and locations already secured for April and March. Abbott has also stated that Texas could remove 10 Democratic districts if California follows through with its own redistricting.",
  "shortSummary": "Texas Gov. Greg Abbott plans to push for a congressional redistricting map beyond the election deadline, facing opposition from Democratic lawmakers and potential legal challenges.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "77423ec301834eb8bedf739aab29d14f",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.nbcnews.com/politics/elections/texas-gov-greg-abbott-moves-amp-pressure-democrats-fled-redistricting-rcna223581?utm_source=newsletter&utm_medium=email&utm_content=Click%20here&utm_campaign=Gov%20Abbott%20push%208.8.25",
      "text": "AUSTIN, Texas — Texas Gov. Greg Abbott vowed to call “special session after special session after special session” in response to Democratic lawmakers who have fled the state to block redistricting legislation, saying they’ll have to stay out of Texas for years to prevent it becoming law.\n“We are in the process as we speak right now of searching for, preparing to arrest Democrats who may be in Texas, may be elsewhere,” Abbott, a Republican, told NBC News in an interview at the governor’s mansion Thursday evening.\n“But I’ll tell you this also, Democrats act like they’re not going to come back as long as this is an issue,” Abbott said. “That means they’re not going to come back until like 2027 or 2028, because I’m going to call special session after special session after special session with the same agenda items on there.”\nMore than 50 Democratic lawmakers fled the state earlier this week to block the state House from moving forward with the Republican majority’s proposed congressional map, designed to boost the number of GOP-held seats ahead of next year’s midterm elections.\nThe Republican-led state House has approved civil arrest warrants for the missing lawmakers, and Abbott has filed a lawsuit with the state Supreme Court seeking to remove the House Democratic leader from office for “an intentional abandonment of his constitutional duty.”\nAbbott said he has not spoken to President Donald Trump about the federal government’s potential role in ending the standoff. Trump said earlier this week that the FBI “may have to” get involved, though an administration official also told NBC News earlier this week that there were no plans to use federal agents to arrest Texas lawmakers who left the state.\n“I’m not going to disclose though all may or may not be involved,” Abbott said Thursday when asked if the FBI has a legitimate role to play. “All I can say is we’re going to use every tool that we can to make sure that these runaway Democrats are going to be held accountable.”\nAbbott said a redraw of the state’s congressional map was necessary because “both the law and facts have changed since we drew the lines back in 2021,” pointing to a federal appeals court last year that ruled that multiple minority groups could not form a coalition to challenge a political map as a racial gerrymander.\nBut Abbott also pointed to the results of the last election as political justification for mid-decade redistricting, instead of waiting until the next national census after 2030.\n“A lot of people who voted Republican, who voted for Donald Trump, were trapped into Democrat districts,” Abbott said. “And so when you look at the facts, when you look at the law, there is every reason to go ahead and draw the lines so that we can assure that every voter is going to have the opportunity to vote for their candidate of choice.”\nTrump won 56% of the vote in Texas in 2024. The proposed congressional map could lead to Republicans controlling 30 of the state’s congressional districts — nearly 80%. Republicans currently control 25 of the state’s 38 congressional districts.\nAbbott rejected the notion that the new map could give Republicans outsized representation, pointing to Illinois, with its 14-3 Democratic congressional delegation, and other states.\n“What has surfaced because of Texas doing redistricting is the way that all the blue states in the country have gerrymandered their states. Look at the disproportionate lack of Republican representation in Congress, in California, Illinois, Massachusetts — which has zero members of Congress who are Republican, New York,” Abbott said.\nSome of those blue-state governors have vowed to retaliate and push their own states to draw new congressional boundaries if Texas does so, although they could face significant hurdles due to the different redistricting processes in their states.\n“The governor doesn’t have unilateral authority in those states to take action,” Abbott said of that possible retaliation. “They have committees and commissions and things like that. But the fact is: Look at the map of Illinois. It’s drawn in such a way that they can’t even squeeze out another Republican. It’s a joke.”\nThe ongoing standoff has ground to a halt the special legislative session Abbott called in Texas, also blocking action on other priorities including relief for victims of devastating floods in central Texas last month. Republican state House leaders chose to move forward on the redistricting legislation first, but all bills in the legislature are now on pause without a quorum present.\n“There’s only one thing that’s denying our ability to get legislation passed. And it’s these Democrats who have fled the state, turned their backs on their fellow constituents,” Abbott said. “And those Democrats are going to lose their job in the upcoming election, if they don’t get kicked out before then, because they’re not stepping up helping out their constituents who are in desperate need.”\n“Any aid to their constituents who’ve been harmed by these floods is being delayed and denied by the derelict Democrats,” Abbott said.\nAll of that fed into Abbott’s argument to the state Supreme Court that state Rep. Gene Wu, the House Democratic Caucus chairman, has violated his oath of office and abandoned his seat by fleeing to Illinois.\n“If quorum breaking is allowed to succeed, then one-third of House Democrats will be able to dictate what the rule of law is for 100% of all Texans,” Abbott said of his lawsuit, adding that he believed the state Supreme Court would agree that Democrats do not have that power.\n“These Democrats, they’re the antithesis of what a Texan is,” Abbott said. “Oh, the going got tough. Let’s not fight, let’s flee. These are quitters. They are cowards, and their cowardice will cause them to get kicked out of office.”\nWu, in a statement Tuesday, responded to Abbott’s lawsuit by saying his “constitutional duty is to not be a willing participant” in the special session that includes the congressional map redraw.\n“Denying the governor a quorum was not an abandonment of my office; it was a fulfillment of my oath,” Wu said in the statement. “Unable to defend his corrupt agenda on its merits, Greg Abbott now desperately seeks to silence my dissent by removing a duly-elected official from office.”\nRyan Chandler reported from Austin and Bridget Bowman reported from Washington, D.C."
    },
    {
      "url": "https://www.forbes.com/sites/alisondurkee/2025/08/06/texas-gov-wants-democrats-who-left-state-kicked-out-of-office-can-he-legally-do-it/",
      "text": "Topline\nTexas Gov. Greg Abbott wants to oust from office the Democratic leader who fled the state to block Republican's attempt at redistricting — though it’s unclear if the latest move in the escalating battle over redistricting will actually work.\nKey Facts\nAbbott filed a lawsuit with the state Supreme Court Tuesday that asks the court to declare that state Rep. Gene Wu, chair of the House Democratic Caucus, has forfeited his office by leaving the state.\nWu and more than 50 of his Democratic colleagues left Texas on Sunday in order to block GOP lawmakers from changing the state’s congressional map to more heavily favor Republicans; their absence left the legislature short of the quorum that’s necessary in order to hold votes.\nAbbott argued the Supreme Court should expel Wu because the Democrat abdicated his position by leaving the state and refusing to show up for work, writing, “This Court should make clear that a legislator who does not wish to perform his duties will be stripped of them.”\nTexas law gives the state Supreme Court power to issue what’s called a “writ of quo warranto”—Latin for “by what warrant”—against state officials, which is a legal determination over whether the official has the right to hold office.\nPaxton also said he will take legal action against Democratic lawmakers if they don’t return to Texas by Friday, invoking a separate state law that gives attorneys general and district attorneys the power to file “quo warranto” petitions in court if a “public officer does an act or allows an act that by law causes a forfeiture of his office.”\nWu has remained defiant—saying in a statement that leaving the state “was not an abandonment of my office; it was a fulfillment of my oath”—and it’s unclear if Abbott and Paxton’s legal gambit will work, whether for Wu or as a broader effort to expel Democratic lawmakers.\nWhat To Watch For\nAbbott has asked the state Supreme Court to rule on whether Wu has forfeited his office by Thursday at 5 p.m. local time, though Paxton asked justices to hold off on making their decision until Friday, which is Texas House Speaker Dustin Burrows’ deadline for Democratic lawmakers to return to the state. Paxton has said he “intends to pursue all available judicial remedies” if Democrats don’t return by Friday, including through the “quo warranto” petition process. It remains to be seen if the attorney general will also take aim at Wu specifically, or if he could file more legal challenges against all of the absent Democrats.\nChief Critic\n“I took an oath to the Constitution, not to a politician’s agenda, and I will not be the one to break that oath,” Wu said in a statement Tuesday responding to Abbott’s lawsuit and allegations that the lawmaker has abdicated his duty as a legislator. “When a governor conspires with a disgraced president to ram through a racist gerrymandered map, my constitutional duty is to not be a willing participant … Unable to defend his corrupt agenda on its merits, Greg Abbott now desperately seeks to silence my dissent by removing a duly-elected official from office.”\nHow Would The Process To Remove Texas Lawmakers Work?\nIt will ultimately be up to the courts to determine whether or not lawmakers can be removed. The legal statute that Abbott invoked in his lawsuit doesn’t specify a legal process for the Supreme Court issuing a writ of quo warranto, and it remains to be seen if justices will draw out the process by asking for a hearing or additional court briefs to be filed. The separate statute giving Paxton and local district attorneys authority to ask courts to remove lawmakers says that if there’s “probable ground” to challenge a person’s office, local judges will ultimately decide the outcome of those requests. That suggests that any effort to remove lawmakers could take a while to play out, particularly if challenges are filed against multiple lawmakers in different courts. That would leave it up to each individual judge to determine when any rulings could come out, Politico notes, and Paxton told right-wing podcaster Benny Johnson that bringing “quo warranto” challenges won’t result in an “immediate answer” over whether lawmakers can be removed. “We’d have to go through the court process, and we’d have to file … in districts that are not friendly to Republicans,” Paxton told Johnson, noting “every, every district would be different.” “We’d have to go sue in every legislator’s home district to try to execute on that idea,” the attorney general said.\nWill The Texas Supreme Court Rule Lawmakers Should Be Expelled?\nIt’s still unclear how the Texas Supreme Court could rule on Abbott’s request to expel Wu. In a 2021 legal opinion, Paxton said lawmakers breaking a quorum could constitute an “abandonment of office” that justifies removing them, but that opinion is non-binding, and Paxton said the issue must ultimately be decided by the courts. The state’s Supreme Court is made up exclusively of Republicans, including multiple justices that Abbott appointed himself. Chief Justice Jimmy Blacklock is also Abbott’s former general counsel, and the governor said when he appointed the justice in 2018 that he “wanted to make sure that the person I appointed was going to make decisions that I know how they are going to decide.” That being said, Blackrock authored a 2021 opinion that said the Texas Constitution “does enable quorum breaking by a minority faction,” suggesting Democrats’ actions are lawful—though he also said the Constitution allows lawmakers to impose penalties in order to compel members’ attendance. Legal experts cited by the Texas Tribune argued it’s unlikely that taking action to break a quorum would be considered abdicating a lawmaker’s duty, as Abbott claims. “I am aware of absolutely no authority that says breaking quorum is the same as the intent to abandon a seat,” University of Missouri constitutional law expert Charles “Rocky” Rhodes told the Tribune, arguing that would be “inconsistent with the very text of the Texas Constitution.”\nHow Long Will Texas Democrats Stay Out Of State?\nDemocrats left the state in order to halt a special session of the legislature that’s slated to end in late August. They would have to stay out of state for even longer in order to actually block the redistricting process, however, as Abbott could simply call a new special session whenever they return. Lawmakers would have to stay out of Texas until at least November to successfully stop the new maps, Rice University political science professor Mark P. Jones told the Texas Tribune. That’s when filing opens for the 2026 midterms, meaning new congressional districts would have to be set by that point. It’s unclear if Democrats will successfully be able to stay out of state for that long, given lawmakers’ commitments at home and a $500 fine that accrues per lawmaker for each day they remain out of state.\nKey Background\nTexas Democrats’ decision to leave the state in order to block redistricting comes as the issue of changing states’ congressional maps outside the normal 10-year timeframe has become a national issue ahead of the 2026 midterms. Democrats are historically favored to fare better in the midterms as the minority party, prompting Republicans in states like Texas to try and manipulate congressional districts to their advantage and add GOP-leaning seats. In addition to Texas, Republican officials in states such as Missouri, Florida and Indiana have at least floated the idea of redistricting—prompting Democrats in states like California, New York and Maryland to also consider redrawing their maps in order to balance out any advantage Republicans give themselves. Texas has become the first flashpoint in the redistricting debate, with Democrats leaving the state Sunday afternoon—repeating a playbook that Texas Democrats have used before to stymie the legislature, most recently in 2021. Abbott’s lawsuit Tuesday came after the governor previously threatened over the weekend to take legal action against the lawmakers. The Texas House has separately issued arrest warrants for the missing lawmakers. Those warrants are ineffective while the lawmakers remain out of state, however, as Democratic lawmakers in the states where the legislators have relocated—primarily Illinois—have refused to extradite them to Texas to be prosecuted.\nFurther Reading"
    },
    {
      "url": "https://www.forbes.com/sites/antoniopequenoiv/2025/08/08/texas-ag-ken-paxton-files-lawsuit-to-vacate-seats-of-13-democrats-who-fled-state/",
      "text": "Topline\nTexas Attorney General Ken Paxton is seeking to vacate 13 Texas House seats belonging to Democrats who fled the state last weekend in protest of a controversial redistricting vote anticipated to benefit the GOP, filing a lawsuit that marks the latest attempt at pressuring the Democrats to return to Texas and resume a quorum.\nKey Facts\nPaxton, who filed the lawsuit with the Texas Supreme Court, called the Democrats “cowards” in a statement, alleging their absence from the Texas House “sabotaged the constitutional process and violated the oath they swore to uphold.”\nThe lawsuit argues Democrats’ decision to not attend the vote demonstrates “an intent to relinquish and abandon their offices.”\nWhile the lawsuit applies to 13 Texas House seats, over 50 Democrats have left the state to block Republican lawmakers from voting on the redistricting, which could provide the GOP with another five seats in the U.S. House, expanding on their slim majority in the chamber.\nPaxton’s lawsuit comes just a few days after Texas Gov. Greg Abbott filed a similar petition asking the Texas Supreme Court to declare that state Rep. Gene Wu, who chairs the House Democratic Caucus, has forfeited his office by leaving Texas.\nForbes has reached out to the Texas House Democratic Caucus for comment.\nGet Forbes Breaking News Text Alerts: We’re launching text message alerts so you'll always know the biggest stories shaping the day’s headlines. Text “Alerts” to (201) 335-0739 or sign up here.\nWill Paxton And Abbott’s Lawsuits Seeking To Remove Democrats Hold Up In Court?\nPossibly, though there are some hurdles. The Texas Supreme Court is fully lined with nine Republican judges, some of whom were appointed by Abbott. Chief Justice Jimmy Blacklock is Abbott’s former general counsel. However, the chief justice issued a 2021 opinion stating the Texas Constitution “does enable quorum breaking by a minority faction,” meaning Democrats’ actions to block the vote could be lawful, though Blacklock noted the Constitution allows lawmakers to penalize members to compel their attendance. It is unlikely Democrats’ breaking of the quorum amounts to the intent to abandon a seat, University of Missouri constitutional law expert Charles “Rocky” Rhodes, told The Texas Tribune.\nWhat To Watch For\nA statute allowing Paxton and local district attorneys to ask courts to remove lawmakers says as long as there is “probable ground” to challenge lawmakers’ offices, local judges will be the deciding factor in booting them out from a chamber. That means vacating their seats could turn into a lengthy process, with Paxton noting in a podcast appearance with right-wing podcaster Benny Johnson that, “We’d have to go through the court process, and we’d have to file … in districts that are not friendly to Republicans.”\nKey Background\nIn addition to the lawsuits, Texas officials have issued arrest warrants for the Democrats who left the state, though the warrants are largely symbolic as they only apply within state lines. Sen. John Cornyn, R-Texas, urged the FBI this week to assist in arresting or locating the Democratic lawmakers, claiming they “may be guilty of bribery or other public corruption offenses.” The Democrats are facing fines of $500 per day as they remain out of state, leading Republicans to suggest bribery charges for donations used to fund the fines or travel expenses. The allegations made by Republicans may not stick. Political attorney Andrew Cates told Forbes the “idea of a group supporting the Texas Democrats as a whole or individually, just supporting them with funds, is inherently not illegal.” Texas law also calls for “direct evidence” of a bribery agreement to prove the allegation. It also must be clear an official’s actions would not have been carried out if they did not receive a bribe. It is unclear when the Democrats will return to Texas. They will need to stay out of Texas until November to fully block the vote on the Congressional redistricting.\nFurther Reading\nTexas Gov. Wants Democrats Who Left State Kicked Out Of Office. Can He Legally Do It? (Forbes)"
    },
    {
      "url": "https://www.cnn.com/2025/08/11/politics/video/abbott-tapper-texas-redistricting-gene-wu-digvid",
      "text": "Video Ad Feedback\n'What gives you the right?': Tapper pushes back on Abbott over calls to remove Dem lawmaker\nCNN's Jake Tapper presses GOP Texas Gov. Greg Abbott over why he took the unusual step of calling for Democratic leader state Rep. Gene Wu to be removed from office amid the ongoing redistricting fight.\n03:52\n- Source:\nCNN\nPolitics of the Day\n18 videos\nVideo Ad Feedback\n'What gives you the right?': Tapper pushes back on Abbott over calls to remove Dem lawmaker\nVideo Ad Feedback\nJasmine Crockett: Democratic base wants to see a fight over redistricting\nVideo Ad Feedback\nSanders: US run by ‘extremely greedy people’ who ‘want it all’\nVideo Ad Feedback\nBorder Patrol chief asked why Home Depots are targeted during immigration raids\nVideo Ad Feedback\nTrump says he thinks 'we have a shot at' peace between Russia and Ukraine\nVideo Ad Feedback\nStalemate in Texas House continues. Here's how it ended previously\nVideo Ad Feedback\nThese young Democrats are trying to win over Gen Z voters, just like Charlie Kirk\nVideo Ad Feedback\nTrump says he's considering taking over DC police and bringing in National Guard\nVideo Ad Feedback\nNYT obtains previously undisclosed images of Epstein's home\nVideo Ad Feedback\n'Wrong, wrong, and wrong': CNN fact checks Trump's job report claims\nVideo Ad Feedback\nNebraska congressman met with boos and jeers at town hall\nVideo Ad Feedback\nDemocrat who fled Texas reacts to Abbott issuing arrest warrant for skipping special session\nVideo Ad Feedback\nKorean Purdue student and daughter of priest released by ICE after 48 hours\nVideo Ad Feedback\n'Racist, gerrymandered map': Texas Democrat blasts GOP-drawn congressional map\nVideo Ad Feedback\n'An extraordinary move': CNN reporter explains why Texas Democrats left the state\nVideo Ad Feedback\nSen. Booker was asked about Democrats’ credibility. Hear his response"
    },
    {
      "url": "https://www.texastribune.org/2025/08/08/texas-redistricting-2026-election-primary/",
      "text": "Texas redistricting standoff complicates preparations for March 2026 primary\nSign up for The Brief, The Texas Tribune’s daily newsletter that keeps readers up to speed on the most essential Texas news.\nThis coverage is made possible through Votebeat, a nonpartisan news organization covering local election administration and voting access. Sign up for Votebeat Texas’ free newsletters here.\nWith Texas legislators locked in a standoff over Republicans’ push to redraw the state’s congressional districts mid-decade, time is running out for election officials to prepare for next year’s primary without major disruption.\nPlanning for the March primary election is already underway, but election officials say they can’t move forward without finalized maps — and the first key deadline, mandated by the state, is coming Sept. 9.\nDemocratic lawmakers have pledged to remain out of the state in protest of the Republicans’ proposed congressional map, making an agreement unlikely by the end of the special session Aug. 19. The proposed map could still change, and if Gov. Greg Abbott calls another special session, the debate could extend well into the fall.\nWithout knowing where the boundaries will be drawn, election officials won’t be able to finalize decisions about polling locations or the number of election workers needed. Voters whose polling location changes will also need to be informed and candidates who want a spot on the primary ballot also need the new boundary lines well in advance in order to familiarize themselves with the district and campaign. Candidates have to be residents of the district they seek to represent.\nIn a typical redistricting cycle year, the process of adapting to new maps is labor-intensive for election officials and takes months.\n“Who knows if we’ll have enough time?” said Chris Davis, the voter registration director in Travis County. He said the Sept. 9 deadline is when county precinct chairs — who represent their political party in a precinct within their neighborhood — can begin filing to run in the primary. A new map could shift precinct boundaries entirely.\nCandidates “need to know now which precinct they’re filing for,” Davis said. “If we have to split a precinct into two, they may end up being the chair of a new precinct.”\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.\nAll other primary candidates can begin filing for a spot on the ballot Nov. 8. The filing deadline is one month later.\nElection officials across the state have for months been updating precinct boundary lines to account for population growth, as required by state law in odd-numbered years. But that work is now on hold due to the redistricting battle, multiple election officials told Votebeat.\nIf and when new maps get approved, they’ll have to start over.\nRedistricting in Texas has delayed elections in the past\nThe push to redraw Texas’ congressional maps outside the normal 10-year cycle follows a push by President Donald Trump’s advisers to help Republicans maintain control of the U.S. House in the 2026 midterms. Historically, the party in control loses seats in midterm elections, and Republicans currently have a slim majority.\nThe Republican-proposed map targets Democratic districts in the Austin, Dallas and Houston metro areas, as well as in South Texas.\nTexas election administrators have faced redistricting-related election delays before.\nIn 2012, the Texas primary election was delayed until the summer due to months of disagreement and litigation over the state’s congressional maps. The date was changed twice, filing periods for candidates were pushed back, and campaigns were left in limbo without maps.\nElection officials worry the same thing could happen now — and say they may lose access to polling locations and workers they’ve already secured for April and March, if delays persist.\n“We secure polling locations at least six months in advance,” said Jennifer Doinoff, Hays County elections administrator. “We are making sure workers have enough time to plan for the dates of the election. If the dates change, those workers may not show up. The work for us is going to have to start all over again.”\nDiffering impact for vote centers vs. precinct-based polling sites\nIn some counties, it’s more urgent now to know the exact number of polling locations they’ll need.\nNearly 100 of Texas’ 254 counties use vote centers, which allow voters to cast their ballot anywhere in their county on Election Day. Vote centers reduce the number of locations officials have to staff and equip on Election Day.\nThe rest of the state’s counties assign voters to specific precincts. The number of precincts determines how many polling locations they’ll be required to have and whether they’ll need more workers. The new maps are key to figuring out that step of the process.\nDenton County, in North Texas, has precinct-based voting, and must make sure voters know well ahead of Election Day which location they’re assigned to.\nFrank Phillips, the county’s elections administrator, said he needs the final map soon to assess whether voters need to be reassigned or if more polling sites are required. Without that information, both voters and candidates will be in the dark about their districts — and what races will appear on their ballots.\n“They may show up at the polls expecting to vote for District 33 and now they're voting for District 26,” he said. “That’ll create confusion like something’s not right on their ballot.”\nPhillips and other election officials are also watching key deadlines for sending absentee ballots to overseas and military voters, which has to be done more than a month ahead of the election. They must also program and test the voting equipment — a process that hinges on knowing which precincts and races are in play.\nNatalia Contreras is a reporter for Votebeat in partnership with the Texas Tribune. Contact Natalia at ncontreras@votebeat.org.\nThe lineup for The Texas Tribune Festival continues to grow! Be there when all-star leaders, innovators and newsmakers take the stage in downtown Austin, Nov. 13–15. The newest additions include comedian, actor and writer John Mulaney; Dallas mayor Eric Johnson; U.S. Sen. Amy Klobuchar, D-Minnesota; New York Media Editor-at-Large Kara Swisher; and U.S. Rep. Veronica Escobar, D-El Paso. Get your tickets today!\nTribFest 2025 is presented by JPMorganChase.\nInformation about the authors\nLearn about The Texas Tribune’s policies, including our partnership with The Trust Project to increase transparency in news."
    }
  ],
  "argos_summary": "Texas Governor Greg Abbott is determined to push for a new congressional redistricting map despite over 50 Democratic lawmakers fleeing the state to block the vote, which could potentially add five GOP seats in the U.S. House. Abbott has vowed to call multiple special sessions to address the redistricting issue, asserting that the absence of Democrats will not halt the process. Meanwhile, Texas Attorney General Ken Paxton has filed a lawsuit to vacate the seats of 13 Democratic lawmakers, claiming their departure constitutes an abandonment of their offices. The ongoing standoff complicates preparations for the upcoming primary elections, as election officials cannot finalize plans without the new maps.",
  "argos_id": "AMKPV4ISY"
}