{
  "url": "https://www.latimes.com/california/story/2025-08-11/carjackers-steal-3-vehicles-drive-big-rig-wrong-way-on-freeway",
  "authorsByline": "By Clara HarterStaff Writer  Follow",
  "articleId": "3480372a447745c4bf7ad2c9242a6490",
  "source": {
    "domain": "latimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "CA",
      "city": "Los Angeles",
      "coordinates": {
        "lat": 34.0536909,
        "lon": -118.242766
      }
    }
  },
  "imageUrl": "https://ca-times.brightspotcdn.com/dims4/default/08dd17d/2147483647/strip/true/crop/1339x703+0+1/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F06%2F5d%2Fd71076854069bdf36241bece5a04%2Fscreenshot-chase-02.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T01:47:18.061000+00:00",
  "addDate": "2025-08-12T01:53:36.017810+00:00",
  "refreshDate": "2025-08-12T01:53:36.017811+00:00",
  "score": 1.0,
  "title": "Wild L.A. pursuit: Carjackers steal 3 cars, drive big-rig wrong way on freeway, then escape",
  "description": "Two armed carjackers led authorities on a wild pursuit from Lancaster to downtown Los Angeles on Sunday night and are still at large.",
  "content": "A stolen big rig heads the wrong way in the westbound lanes of the 10 Freeway on Sunday night.\n\nTwo armed thieves led authorities on a wild pursuit from Lancaster to downtown L.A. on Sunday night, authorities said, stealing three vehicles, driving a big-rig truck in the wrong direction on the 10 Freeway — and still managing to escape.\n\nThe chase began with a carjacking in the city of Lancaster at 9:45 p.m., according to the L.A. County Sheriff’s Department. Two armed men stole a man’s white F-250 Ford pickup and fired gunshots at the victim as he attempted to pursue them.\n\nThe carjackers then fled southbound along State Route 14 toward Los Angeles. Sheriff’s deputies pursued the pickup for 26 miles, after which the California Highway Patrol took over.\n\nThe thieves then abandoned the pickup and carjacked a second vehicle, this time a massive big rig, according to the Sheriff’s Department.\n\nFootage captured by OnScene.TV shows the stolen big rig weaving through oncoming traffic as it hurtles in the wrong direction down the westbound lanes of the 10 Freeway. The carjackers ditched the big rig while exiting the 10 near Alameda Street in downtown L.A., authorities said.\n\nThey then carjacked their third vehicle, a white Chevrolet Silverado truck, and continued to lead the CHP in pursuit.\n\nThey drove just three miles farther before abandoning the Silverado on Mission Road under the 101 Freeway underpass, where they escaped around two hours after the initial F-250 Ford robbery took place.\n\nA loaded firearm was later recovered from the backseat of the F-250 Ford. Authorities believe additional suspects may have participated in the Lancaster robbery and also picked up the fleeing suspects after they got out of the Silverado.\n\nAnyone with further information on the incident is asked to contact Det. Casebolt at the Lancaster sheriff’s station at (661) 524-2171.",
  "medium": "Article",
  "links": [
    "https://www.latimes.com/california/story/2025-07-21/vandals-ransack-autozone-street-takeover-in-south-l-a",
    "https://www.latimes.com/california/story/2025-07-26/autozone-break-in",
    "https://www.latimes.com/california/story/2025-07-27/video-dramatic-crash-at-high-speeds-110-freeway"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "F-250 Ford",
      "weight": 0.08682052
    },
    {
      "name": "Wild L.A. pursuit",
      "weight": 0.086397596
    },
    {
      "name": "downtown L.A.",
      "weight": 0.08137645
    },
    {
      "name": "Lancaster",
      "weight": 0.078560084
    },
    {
      "name": "A stolen big rig",
      "weight": 0.072483405
    },
    {
      "name": "the stolen big rig",
      "weight": 0.072483405
    },
    {
      "name": "Det. Casebolt",
      "weight": 0.06956914
    },
    {
      "name": "L.A.",
      "weight": 0.06794007
    },
    {
      "name": "Authorities",
      "weight": 0.06650973
    },
    {
      "name": "authorities",
      "weight": 0.06650973
    }
  ],
  "topics": [
    {
      "name": "Traffic"
    }
  ],
  "categories": [
    {
      "name": "Auto"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Local News",
      "score": 0.986328125
    },
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.9853515625
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.97998046875
    },
    {
      "name": "/Sensitive Subjects/Violence & Abuse",
      "score": 0.794921875
    }
  ],
  "sentiment": {
    "positive": 0.06775367,
    "negative": 0.63533974,
    "neutral": 0.29690662
  },
  "summary": "Two armed carjackers led authorities on a wild pursuit from Lancaster to downtown L.A. on Sunday night, stealing three vehicles and driving a big-rig truck in the wrong direction on the 10 Freeway. The chase began with a carjacking in the city of Lancaster, California, and the California Highway Patrol took over. The thieves then fled southbound along State Route 14 toward Los Angeles, where they stole a white F-250 Ford pickup and fled with a second vehicle, a massive big rig. They then abandoned their third vehicle and fled, leading the CHP in pursuit for 26 miles before abandoning the vehicle. A loaded firearm was later recovered from the backseat of the F-350 Ford.",
  "shortSummary": "Arsonists stole three cars and drove the wrong way on the 10 Freeway, leading to a wild chase from Lancaster to downtown L.A.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "02020b3c690e482794b7c07bf823487b",
  "places": [
    {
      "osmId": "8971800",
      "road": "Alameda Street",
      "town": "Seward",
      "county": "Kenai Peninsula",
      "state": "Alaska",
      "postcode": "99664",
      "country": "United States",
      "countryCode": "us",
      "coordinates": {
        "lat": 60.1260724,
        "lon": -149.4331207
      }
    },
    {
      "osmId": "44867121",
      "road": "Antelope Valley Freeway",
      "city": "Lancaster",
      "state": "California",
      "postcode": "93534",
      "country": "United States",
      "countryCode": "us",
      "coordinates": {
        "lat": 34.6748065,
        "lon": -118.1573523
      }
    },
    {
      "osmId": "306526678",
      "road": "Hollywood Freeway",
      "city": "Los Angeles",
      "state": "California",
      "postcode": "91352",
      "country": "United States",
      "countryCode": "us",
      "coordinates": {
        "lat": 34.2159397,
        "lon": -118.4084984
      }
    }
  ],
  "scraped_sources": [
    {
      "url": "https://www.latimes.com/california/story/2025-07-27/video-dramatic-crash-at-high-speeds-110-freeway",
      "text": "Video shows dramatic crash on L.A. freeway as speeding motorists smash into cars\n- Share via\nThe aftermath of a crash on the 110 Freeway apparently caused by two speeding motorists was caught on video provided by OnScene.TV.\n- Share via\nTwo speeding motorists crashed dramatically on the northbound lanes of the 110 Freeway early Sunday morning, sending vehicles flying across the freeway.\nThe crash took place around 2:30 a.m. near Florence Avenue, according to the California Highway Patrol. The agency said the incident was being investigated as a hit and run. The CHP said no arrests were made, and it was unclear how many vehicles were involved.\nIn dramatic video from news gathering organization OnScene.TV, two cars weave wildly amid traffic, apparently racing each other and dangerously cutting off other cars headed north.\nFollowing the crash, nobody was transported from the scene to a hospital, according to the Los Angeles Fire Department.\nStreet racing and takeovers — when drivers take over roads and do dangerous car stunts, usually amid crowds of onlookers — peaked in 2020 with 912 reported incidents in Los Angeles. In 2019, there were 319 incidents, and in 2023, there were 482, police said at a public meeting last year.\nA woman was killed by street racers in February in Los Angeles as she walked near a crosswalk on Normandie Avenue at 66th Street."
    },
    {
      "url": "https://www.latimes.com/california/story/2025-07-21/vandals-ransack-autozone-street-takeover-in-south-l-a",
      "text": "Thieves ransack an AutoZone during possible street takeover in South L.A.\n- Share via\nAn AutoZone in South L.A. was ransacked during a possible street takeover on Monday morning, police said.\nAbout 1:15 a.m., police received reports of people breaking into a business near the intersection of South Main Street and Vernon Avenue, where a street takeover had been reported, authorities said.\nOfficers arrived around 1:30 a.m., approached the store with their guns drawn and shouted for anyone inside to come out and surrender, according to video footage from OnSceneTV. By that time, however, everyone was gone.\nVideo showed discarded merchandise boxes and broken glass strewn about the parking lot, with the front door and security gate pulled open.\nPolice did not say whether there was any surveillance video of the people who broke in.\nThis is not the first time an auto parts store being ransacked has coincided with a possible street takeover nearby.\nAbout a month ago, about 100 people ransacked another South L.A. AutoZone, KTLA reported.\nLast summer, nearly 50 people rushed into an AutoZone at Century Boulevard and Hoover Street, the same location that was broken into last month. The people covered their faces as they pulled on the security fence at the main entrance and pushed their way into the store, according to video shared on social media.\nA 24-year-old man was arrested in connection with that incident and charged with organized retail grand theft, one count of fleeing a pursuing officer’s vehicle while driving recklessly and second-degree burglary, Los Angeles County prosecutors said."
    },
    {
      "url": "https://www.latimes.com/california/story/2025-07-26/autozone-break-in",
      "text": "Another AutoZone broken into near South L.A. street takeover, police say\n- Share via\nAn AutoZone in South Los Angeles was broken into early Saturday morning near a reported street takeover, police said.\nThe incident follows two similar break-ins earlier this week and last month at South L.A. AutoZones, in which crowds ransacked the stores during possible street takeovers nearby.\nDuring the most recent incident, which occurred about 1:30 a.m. Saturday, police received calls stating that dozens of cars were in the intersection of Century Boulevard and Central Avenue doing burnouts while hundreds of people watched, said Jeff Lee, a\npublic information officer for the Los Angeles Police Department.\nAround the same time, calls came in reporting people breaking into an AutoZone near the intersection. Callers said that at least some of the men were wearing ski masks, that they came from the street takeover crowd and that as many as 50 people were inside the store taking items, Lee said.\nLee said police responded to the blocked intersection and AutoZone incidents, causing crowds to flee.\nThere have been no arrests for the AutoZone burglary, Lee said, and he had no information on damage to the store or what was taken. Lee said there also were no reports of arrests during the street takeover.\nHe said detectives are investigating the burglary and will look at surveillance and social media video."
    }
  ],
  "argos_summary": "Two armed thieves led police on a chase from Lancaster to downtown Los Angeles after carjacking three vehicles, including a big rig, on Sunday night. The pursuit began with the theft of a Ford pickup truck, followed by the carjackers abandoning it for a big rig, which they drove in the wrong direction on the 10 Freeway. After ditching the big rig, they stole a Chevrolet Silverado before escaping on foot. Authorities believe additional suspects may have assisted in the robbery.",
  "argos_id": "B2FB9CDET"
}