{
  "url": "https://www.washingtonpost.com/dc-md-va/2025/08/11/trump-dc-fbi-national-guard-deployment/",
  "authorsByline": "Erin Cox, Katie Tarrant, Kyle Swenson",
  "articleId": "bd49c804f1a54089a1fa0e9bb00c9f3f",
  "source": {
    "domain": "washingtonpost.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "DC",
      "city": "Washington",
      "coordinates": {
        "lat": 38.8949924,
        "lon": -77.0365581
      }
    }
  },
  "imageUrl": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/IVJWFPNYQKDLMYGHLUH5MB46KI_size-normalized.JPG&w=1440",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T00:01:36.569000+00:00",
  "addDate": "2025-08-12T00:07:05.463494+00:00",
  "refreshDate": "2025-08-12T00:07:05.463497+00:00",
  "score": 1.0,
  "title": "Signs of Trump’s takeover of D.C. policing are in view, with more to come",
  "description": "Federal officers have begun approaching homeless campsites and policing graffiti. Large shifts of National Guard troops were expected by the end of the week.",
  "content": "Trump promised much more to come. He said his initiative would inject “an overwhelming presence” into D.C., with seven federal agencies expanding their reach into city life. The Drug Enforcement Administration began sending agents to homeless campsites. U.S. Park Police was tasked with addressing graffiti in federal parks. National Guard troops were expected to staff intersections and work in shifts of 200 starting later this week. Trump said that more than 500 federal agents were deployed last week, and that the effort will eventually be supplemented by another 800 troops from the D.C. National Guard.\n\n“You’ll have more police and you’ll be so happy because you’ll be safe when you walk down the street,” Trump said at his Monday morning news conference. “You’re going to see police, or you’re going to see FBI agents — going to have a lot of agents on the street — and you’re going to have a lot of, essentially military.”\n\nTrump named Terry Cole, the head of the DEA, as his interim commissioner of the D.C. police. Cole told Police Chief Pamela A. Smith on Monday evening that the federal team is hoping for the Metro Police Department to lead the effort, according to a police official who spoke on the condition of anonymity because they were not authorized to speak publicly.\n\nCole described Trump’s takeover of the department as more of a collaboration and he stressed that they would continue to meet and work together to figure out where to deploy resources, the official said.\n\nWashington boasts more city officers per capita than any other large city in the country, according to the FBI’s latest figures. There are nearly five D.C. police officers per 1,000 residents, ahead of New York, Chicago, Detroit and Baltimore. The figure does not include the agencies deployed by Trump nor the droves of other officers with agencies that have some jurisdiction in the District, including the U.S. Capitol Police, Metro Transit Police, Supreme Court police, Amtrak police and numerous others.\n\nSmith said additional federal policing resources could be helpful to the District in executing warrants or deploying more officers to areas of the city where D.C. police patrol — including to U Street alongside the nightlife task force, to Drug Free Zones, to areas with juvenile curfews and to neighborhoods where violent crime is highest.\n\n“What you will see is an enhanced presence,” Smith said, adding that after Trump’s announced takeover Monday morning, she spent an hour on the phone with the U.S. Marshals discussing how federal resources will be deployed in the city. She said she had more meetings later Monday to further sketch out how to deploy resources.\n\n“People still have their constitutional rights. This is not suspending that,” Alicia Yass, supervising policy council for the ACLU of D.C., said in an interview. “So, if police or other law enforcement do approach people in a public place, they still have a right to remain silent.”\n\nAl, a 50-year-old man living on a discarded couch under Georgetown’s Whitehurst Freeway, said he was a burning citronella candle to keep away the mosquitos on Sunday when he was approached by DEA agents in flak jackets. Al, who declined to give his last name for privacy reasons, said he has lived on the street for decades and struggled with addiction, but was familiar with police activity in D.C. He has been removed from at least five encampments in as many years.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "D.C. police",
      "weight": 0.09705372
    },
    {
      "name": "more police",
      "weight": 0.09676198
    },
    {
      "name": "more city officers",
      "weight": 0.088667326
    },
    {
      "name": "more officers",
      "weight": 0.08192243
    },
    {
      "name": "Amtrak police",
      "weight": 0.07733817
    },
    {
      "name": "federal resources",
      "weight": 0.076416194
    },
    {
      "name": "Supreme Court police",
      "weight": 0.07632796
    },
    {
      "name": "police",
      "weight": 0.07626043
    },
    {
      "name": "police activity",
      "weight": 0.07608504
    },
    {
      "name": "additional federal policing resources",
      "weight": 0.07546122
    }
  ],
  "topics": [
    {
      "name": "Law Enforcement"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.958984375
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.9482421875
    },
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.93505859375
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.439208984375
    }
  ],
  "sentiment": {
    "positive": 0.23232459,
    "negative": 0.2227028,
    "neutral": 0.54497266
  },
  "summary": "The President Donald Trump has taken over D.C. police, promising to create an \"overwhelming presence\" in the city, with seven federal agencies expanding their reach into city life. The Drug Enforcement Administration has begun sending agents to homeless campsites and the U.S. Park Police is focusing on addressing graffiti in federal parks. The National Guard will also be adding 800 troops from the city. The DEA has named Terry Cole, the head of the agency, as his interim commissioner of the D.c. police. The move is seen as a step towards further federal policing efforts, with police Chief Pamela A. Smith suggesting that additional federal resources could be helpful in executing warrants or deploying more officers to areas of the city where police patrol. The ACLU has criticized the move, stating that people still have a right to remain silent if approached by law enforcement.",
  "shortSummary": "President Donald Trump's administration has significantly expanded federal policing in Washington, with additional troops and resources targeting homeless people and crime prone.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "d7c811248cef41deb8227df9455aa22c",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Trump announced a significant increase in federal law enforcement presence in Washington, D.C., involving seven federal agencies, including the DEA and National Guard, to address issues like homelessness and crime. He appointed Terry Cole, head of the DEA, as interim commissioner of the D.C. police, emphasizing collaboration with local police. The initiative aims to enhance safety and resource deployment in high-crime areas, while civil rights advocates remind that constitutional rights remain intact for individuals approached by law enforcement.",
  "argos_id": "BC93A47LH"
}