{
  "url": "https://www.inquirer.com/college-sports/penn/penn-football-preseason-ray-priore-quakers-ivy-league-20250812.html",
  "authorsByline": "Kerith Gabriel",
  "articleId": "d8ecdecd672b4bb3acb28052b5dd73d5",
  "source": {
    "domain": "inquirer.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "PA",
      "county": "Philadelphia County",
      "city": "Philadelphia",
      "coordinates": {
        "lat": 39.9527237,
        "lon": -75.1635262
      }
    }
  },
  "imageUrl": "https://www.inquirer.com/resizer/v2/LAVR7V4SJRATLNZQZAVSSEL4QE.jpg?auth=157797f7d7a719ca77af2a3f4896cf879c493c87b24fcccb960aa3e91aa87a2c&width=760&height=507&smart=true",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T18:37:03-04:00",
  "addDate": "2025-08-11T22:53:19.021215+00:00",
  "refreshDate": "2025-08-11T22:53:19.021217+00:00",
  "score": 1.0,
  "title": "Penn football is hoping for a better 2025 season after a rough finish to 2024",
  "description": "Penn head coach Ray Priore knows that it was the margins that downed the Quakers last season, but the last thing he plans to do heading into a promising 2025 is dwell on it.",
  "content": "It would have been easy for Penn head football coach Ray Priore to make an excuse.\n\nA close examination of last year’s 4-6 record is not an accurate reflection of just how close the Quakers in the games they found themselves on the losing end of. Among the six losses, only two were by a double-digit margin.\n\nIt’s what Priore hinted at when he, alongside quarterback Liam O’Brien, spoke during Monday’s Ivy League football media day. The losses showed what the group needed to tighten up, and the “discipline” they now need to display before opening the season in a little more than a month’s time against Stonehill (1 p.m., NEC Front Row).\n\n“It starts with the ball, we’ve got to possess it; we’ve got to keep it and we got to get it,” Priore said. “You can look at our plus minus [from last season] … this league is all about points. The [end] goal is not three [points], the goal is seven. We’ve lost too many games by a very, very small margin. And the word I’ve used often this past nine months has been discipline.”\n\n» READ MORE: Taylor Wray ready for ‘next step’ as Penn men’s lacrosse coach after parting ways with St. Joe’s\n\nPenn found out that the Ivy League also doesn’t care about margins after the Quakers were ranked No. 6 in conference preseason polls. Penn sits just above Cornell and Brown, but stares up at the remaining programs in the league, with a desire to prove that they’ve learned from their mistakes.\n\nThey’ll have to showcase just how much they’ve learned with O’Brien at the helm, who takes over for graduate Aidan Sayin, last year’s starter who threw for 1,108 yards and six touchdowns. However, it was O’Brien who stepped up after Sayin suffered a season-ending injury last season. O’Brien enters this season coming off a 1,000-yard passing season as well (1,018), in which he threw for 13 touchdowns and just two interceptions in four starts.\n\nPenn returns its entire starting offensive linemen. In just the short time since the end of spring ball and early stages of training camps, O’Brien says the O-line stands to bring not just the “foundation,” but the “experience” to right the ship.\n\nIt would be quite lift now that the Quakers have more to play for with the Ivy League now officially competing for an opportunity to be a part of the playoff picture in the Football Championship Subdivision.\n\n“We’re adjusting to new headsets, which is very exciting, but it’s going to take, you know, some time to just get used to the communication into my ears,” O’Brien said. “But on top of that everyone else still has to play. We have to communicate. We all have to be on the same page. It’s starts with we can’t give up the five yard penalties, no false starts. No jumping offsides. Um, you know, keep it simple and just be smart.”\n\n» READ MORE: Penn State has its highest preseason ranking in the James Franklin Era. Here’s how.\n\nIn addition to being smart, O’Brien also has a top target in Jared Richardson, the senior wide receiver who was named to the FCS Football Central preseason All-America team last month. Richardson, who led the team in touchdowns last year with seven, is 528 yards from ranking among the top 10 in program history in career receiving yards, and already ranks sixth in Penn history in touchdown catches.\n\nHowever, the Quakers do have deficiencies on both sides of the ball, and none greater than the loss of sophomore rusher Malachi Hosley, who transferred to Georgia Tech at the end of the season, after being the Ivy League’s offensive player of the year last season.\n\n“When you lose an Ivy League Offensive Player of the Year to the [NCAA transfer] portal and the NIL, that’s never, never good,” said Priore. But again, it’s got to be a next man up sort of mentality. We’ve done some internal things and we’re going to make some moves internally … Fortunately, as you’ve been around and you’ve watched people play, that’s probably the one position where early player who can play can tap in really early.”\n\nOne of those moves Priore admitted is a new role for wide receiver Julien Stokes. Stokes is contending to be the feature back behind O’Brien; the 5-foot-7, 180-pounder was second-team All-Ivy last season, coming off an injury that saw him finish with 37 receptions, 313 receiving yards, and two touchdowns.\n\nPriore also noted that he was pleased with what he’s seeing from Dante West, heading into his sophomore season, and Sean “Pup” Williams.\n\nThere’s still plenty of time to fine-tune things in practice and against nonleague competition before opening Ivy League play at Franklin Field against Dartmouth on Oct. 4 (1 p.m., ESPN+). The Big Green finished No. 2 in the Ivy polling, just behind top-ranked Harvard.\n\nNow, it’s getting back to the game of inches and worrying less about the margins.\n\n“Our journey started right after the season,” said Priore. “I think we came off a season that I think for the players we’re not satisfied, [so] we had to reach deep down and start that process … and our kids have started that progression and are very hungry and excited to get back.”",
  "medium": "Article",
  "links": [
    "https://ivyleague.com/news/2025/8/4/harvard-voted-preseason-ivy-football-favorite.aspx",
    "https://www.inquirer.com/college-sports/penn-state/penn-state-ap-poll-nittany-lions-recruits-2025-james-franklin-20250811.html",
    "https://www.inquirer.com/college-sports/penn-lacrosse-coach-taylor-wray-st-joes-hawks-20250807.html"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "last season",
      "weight": 0.08591472
    },
    {
      "name": "Ivy League",
      "weight": 0.08265433
    },
    {
      "name": "Ivy League play",
      "weight": 0.07935472
    },
    {
      "name": "Penn head football coach Ray Priore",
      "weight": 0.07116228
    },
    {
      "name": "Penn football",
      "weight": 0.067146
    },
    {
      "name": "last year",
      "weight": 0.066960156
    },
    {
      "name": "Ivy",
      "weight": 0.06552167
    },
    {
      "name": "Liam O’Brien",
      "weight": 0.064544395
    },
    {
      "name": "last month",
      "weight": 0.064215235
    },
    {
      "name": "quarterback Liam O’Brien",
      "weight": 0.06352266
    }
  ],
  "topics": [
    {
      "name": "Football"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.9873046875
    },
    {
      "name": "/Sports/College Sports",
      "score": 0.984375
    },
    {
      "name": "/Sports/Team Sports/American Football",
      "score": 0.95947265625
    },
    {
      "name": "/Jobs & Education/Education/Colleges & Universities",
      "score": 0.8291015625
    }
  ],
  "sentiment": {
    "positive": 0.11965166,
    "negative": 0.5569227,
    "neutral": 0.3234257
  },
  "summary": "Penn football is hoping for a better 2025 season after a disappointing 4-6 record last year. The team's head football coach, Ray Priore, emphasized the need for discipline and accountability during the Ivy League football media day. The Quakers lost six games by a double-digit margin last year, with the loss of sophomore rusher Malachi Hosley. Penn's quarterback, Liam O'Brien, is expected to perform well this season, coming off a 1,000-yard passing season and returning to the starting line-up. Despite being ranked No. 6 in the conference preseason polls, the team is eager to prove they have learned from their mistakes.",
  "shortSummary": "Penn's football team aims for better results this season, emphasizing discipline and improved communication, despite a challenging finish to their 4-6 Ivy League record last year.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "61143f1f73a848cbb5272b9660c00677",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://ivyleague.com/news/2025/8/4/harvard-voted-preseason-ivy-football-favorite.aspx",
      "text": "PRINCETON, N.J. – As the Ivy League prepares for its inaugural appearance in the FCS playoffs, the race for the 2025 Ivy League football title is expected to be as competitive as ever.\nAfter earning a share of the Ivy League crown in each of the past two seasons, Harvard has been selected as the preseason favorite in the 2025 Ivy League Football Preseason Poll. The poll was conducted among 16 media members who regularly cover Ivy League football.\nHarvard, one of three teams to share last season’s title, received 114 points and garnered nine first-place votes. Dartmouth, which also claimed a share of the title the last two seasons, edged out Yale for second place with 105 points and four first-place votes. Yale followed closely with 103 points and three first-place selections.\nColumbia, fresh off its first Ivy League title since 1961, was picked fourth with 72 points.\nRounding out the poll were Princeton (55), Penn (49), Cornell (42), and Brown (32).\nSix Ivy League football games will air on ESPN's linear networks this season. All other Ivy League home games outside of the six-game package will stream on ESPN+, with select contests also available via regional sports networks.\nThe 2025 Ivy League football season kicks off Friday, Sept. 19.\n2025 IVY LEAGUE PRESEASON POLL (First Place Votes)\n1. Harvard – 118 (9)\n2. Dartmouth – 105 (4)\n3. Yale – 103 (3)\n4. Columbia – 72\n5. Princeton – 55\n6. Penn – 49\n7. Cornell – 42\n8. Brown – 32"
    },
    {
      "url": "https://www.inquirer.com/college-sports/penn-state/penn-state-ap-poll-nittany-lions-recruits-2025-james-franklin-20250811.html",
      "text": "Penn State has its highest preseason ranking in the James Franklin Era. Here’s how.\nThe Nittany Lions have their 2022 recruiting class to thank for the program's highest AP preseason poll ranking in 12 seasons with Franklin as head coach\nPenn State’s long climb back to national relevance under James Franklin has been uneven at times. His regime started with consecutive 7-6 seasons, an unexpected Big Ten title run that came up just short of the four-team College Football Playoff at the time, and seven seasons thereafter of falling just short of getting over the hump.\nThen last season’s run happened.\nThe season felt gloomy after a Nov. 2 loss to Ohio State, which has become an annual occurrence since that 2016 season. But a light switched on and Penn State won four of its next five games, which included a hard-fought loss to Big Ten champion Oregon. If not for some late-game misfortune against Notre Dame in their CFP semifinal, the Nittany Lions could have been playing for a national title in what had seemed like a lost season two months earlier.\n» READ MORE: Nick Singleton among five Penn State players on The Athletic’s ‘Freaks List’\nEntering this season, Penn State is No. 2 in the Associated Press preseason poll, the highest ranking since 1997, when the Nittany Lions were preseason No. 1. Penn State was also ranked No. 3 in USA Today’s preseason coaches poll. It’s the first time in more than 40 years in which the Nittany Lions have been ranked in the preseason top 10 in three straight years after starting the 2023 season at No. 7 and 2024 at No. 8.\nAlthough Franklin and his players have largely downplayed the preseason hype around the program, there’s no denying this is the most anticipated season in the coach’s tenure.\nHow last year’s team, one that captured 13 wins, the most in program history, came to fruition dates back to the 2022 recruiting class.\nHeadlining the group, quarterback Drew Allar, was the Nittany Lions’ prized five-star recruit out of Medina, Ohio, and the third overall prospect in 247Sports’ 2022 recruiting class. Running back Nicholas Singleton of Shillington, Pa., and edge rusher Dani Dennis-Sutton of Owings Mills, Md., were the other five-star recruits who joined the Nittany Lions from that class.\nThose three make up the core of this iteration of Penn State football, one that has expectations of the program’s first outright national championship since 1986. Singleton recalls the group creating a group chat ahead of arriving to campus.\nBut there are many more beyond those three, like defensive tackle Zane Durant, offensive tackle Drew Shelton, interior offensive lineman Olaivavega Ioane, running back Kaytron Allen, and others who have developed into starters with NFL potential.\n“I think we had the best recruiting class ever, man,” Durant said during Penn State media day earlier this month. “It’s so surreal, bro. We came in on a visit, just seeing each other and moving in together, and seeing everybody develop and chase their goals is actually crazy to see, because we came in at different starting points, some guys ahead, some guys weren’t. We just stayed true to it, stayed true to the process, and just kept going.”\n» READ MORE: Penn State earns No. 2 ranking in AP preseason poll, its highest spot since 1997\nAdded Ioane: “That group embodied exactly what Penn State talks about, whether it’s [being] hardworking, being competitors. We came in here from Day 1, we started competing against each other, and that built everything up until now, just everybody working at it. We’re all really close off the field, too.”\nThe 29-player recruiting class, three of whom were transfers, already has five NFL players: Abdul Carter (2025 first-round pick), Chop Robinson (2024 first-round pick), Kevin Winston Jr. (2025 third-round pick), Hunter Nourzad (2024 fifth-round pick), and Mitchell Tinsley (undrafted free agent). Other significant contributors, like backup quarterback Beau Pribula (now at Missouri), wide receiver Omari Evans (Mississippi), and offensive lineman JB Nelson (Kansas State), have since moved on to other schools, but they played key roles in last season’s deep CFP run.\nJust 12 players remain from that original class, but the impact on the program has been obvious. Singleton and Allen have been three-year starters. Durant, Dennis-Sutton, and Ioane have been key contributors the last two seasons, and Shelton started last year for the first time.\n“There was obviously a lot of hype around us at the time [of our recruiting class],” Downingtown West grad Shelton said. “Obviously, that hype doesn’t really matter until you do something with it. But my freshman camp coming in, seeing a bunch of guys running with the ones and the twos and seeing what they’re doing, that was kind of when we knew that this class was going to be special.”\n» READ MORE: James Franklin embraces Penn State’s high expectations in 2025, but preseason hype ‘means nothing’ without results\nStacking up against recent champs\nPenn State doesn’t have to look far to see how its journey could turn out. The Big Ten has won back-to-back national titles, breaking a nine-year gap between championships, but looking deeper at Ohio State and Michigan’s rosters, the parallels to Penn State are stark.\nOn Michigan’s 2023 title team, it returned quarterback J.J. McCarthy, the running back tandem of Blake Corum and Donovan Edwards, four of the five starting offensive linemen, and nine of 12 players on defense who played 400 snaps or more in 2022.\nOhio State last season returned running back TreyVeon Henderson, four of five starting offensive linemen, nine of its 11 starting defensive players, and added quarterback Will Howard, running back Quinshon Judkins, and safety Caleb Downs in the transfer portal, all of whom played big roles in the Buckeyes’ title run.\nThe Nittany Lions return Allar, running backs Singleton and Allen, four of five starting offensive linemen, and just five starters defensively, although several backups played meaningful snaps throughout Penn State’s playoff run last year.\nMichigan made the CFP in 2021 and 2022, losing in the semifinal, before breaking through in 2023. Ohio State made the CFP in 2022, lost to Michigan in 2023, and returned to the playoff in 2024 (despite losing to the Wolverines again) before going on its title run.\nFor Penn State, last season was the program’s first in the CFP, but losses to Michigan and Ohio State in 2022 and a loss to the Buckeyes in 2023 prevented potential playoff berths. The expanded 12-team playoff certainly helped the Nittany Lions, but the core group has eclipsed 10 or more wins for the first time in a three-year stretch since 1980-82.\n» READ MORE: Big Ten commissioner Tony Petitti isn’t mincing words when it comes to College Football Playoff expansion\n“I think personally speaking, there was a lot of things I wanted to accomplish here, both individually and as a team, that, you know, I felt like that I didn’t accomplish through my first three years,” Allar said on his decision to return for his senior season. “I can’t speak for everybody that decided to come back, but there are probably some similarities to my decision. … Just urgently working as hard as I can and being as diligent as possible for me to become the player that I want to be.”\nThree new receivers are key\nAllar’s intention to return coincided with offensive coordinator Andy Kotelnicki, who was reportedly a finalist for the West Virginia head coaching job. Kotelnicki, who ran Kansas’ prolific offense and Buffalo’s before that, raised Allar’s floor as a player and maximized the skill sets of tight end Tyler Warren, Singleton, and Allen.\nThis season, Kotelnicki has transfers Trebor Peña, Devonte Ross, and Kyron Hudson in a revamped corps of receivers. Warren was the leading receiver last year by a large margin, while the team’s pass catchers were much maligned, led by Evans, Harrison Wallace, and Liam Clifford, who combined for zero catches in the CFP semifinal loss to Notre Dame. In fact, no receiver caught a pass in that 27-24 loss.\nAfter losing Wallace and Evans to the portal, Penn State sought receivers who were “veterans that have already produced in college football,” Franklin said. And those three wideouts will be counted on to change the narrative of the receiving corps, along with returners Tyseer Denmark, a Philly native, and Clifford.\n“I felt like they had a great team,” said Peña, who had 941 yards and nine receiving touchdowns last season at Syracuse. “They had a lot of guys returning, obviously, Drew’s returning. I felt like it just made the most sense for me. I can tell by the way our group works that everybody’s hungry, everybody’s ready to work, and nobody is complacent at all. We’ve got a great group of guys, and I’m happy I’m able to contribute to that.”\nAdded Hudson, who transferred from Southern Cal: “I think just coming here to a school like this made the opportunity even better. Having the receiver corps we have, the brotherhood that we have here … I feel like I made the greatest decision I ever made.”\n» READ MORE: James Franklin says Penn State is ‘that close’ to winning it all. A new baseline for success has been set.\nHudson, Ross, and Peña could be the missing pieces for Penn State’s offense, along with Allar’s ability to take the next step. Tight ends Khalil Dinkins, Luke Reynolds, and Andrew Rappleyea should also factor in as weapons for Kotelnicki’s offense as well.\nHow far Penn State goes in 2025 will rest on Allar’s shoulders, as the potential 2026 first-round pick has a 23-6 record as a starter. He could become the Nittany Lions’ highest-drafted quarterback since Kerry Collins went fifth overall to the Carolina Panthers in 1995.\n“I think the biggest thing is we need more playmaking at the wide receiver position for us to go where we want to go, in critical moments, in critical games,” Franklin said earlier this month. “Drew having more people around him making plays for him, I think will be really valuable.”\nTime will tell.\nStaff writer Greg Finberg contributed to this article."
    },
    {
      "url": "https://www.inquirer.com/college-sports/penn-lacrosse-coach-taylor-wray-st-joes-hawks-20250807.html",
      "text": "Taylor Wray ready for ‘next step’ as Penn men’s lacrosse coach after parting ways with St. Joe’s\nWray, a former Philadelphia Wings defender, leaves St. Joe’s as the winningest coach in program history. Now he’s looking forward to coaching in the Ivy League.\nTaylor Wray is joining his third Philadelphia-area lacrosse program as he takes over as Penn men’s lacrosse coach after 14 seasons at the helm at St. Joseph’s.\n“Philly is the best sports town in the world,” said Wray, a former defender for the Philadelphia Wings, a professional box lacrosse team. “If you can create a product that is exciting and represents the city and the toughness of the city and the grit of the city and the passion of the city, then people will support you.”\nWray was named Penn’s coach in on July 11. He said it was time for a change in his coaching career, and he wanted to experience coaching in the Ivy League, a top conference in college lacrosse, at a school known for pouring resources into its lacrosse programs.\n“This just feels like the next step in the progression of my coaching career,“ Wray said. ”There’s a lot of tradition and history at Penn that I need to get to know, but the infrastructure there is definitely in place to build something that can contend at the national level.”\nThe coaching change came late. Penn began its search for a replacement after parting ways with Mike Murphy, who led the team for 16 seasons, in late June. USA Lacrosse Magazine called the timing of the decision “peculiar.”\n“A change in leadership is needed to elevate the men’s lacrosse program to compete for Ivy and national championships,” Penn athletic director Alanna Wren wrote in a press release.\nScott Meehan, who has been involved with St. Joe’s program since 2019, will take over as head coach.\nLast season, Penn compiled a 4-10 record (1-5 Ivy), the program’s worst since 2012, while St. Joe’s, which competes in the Atlantic 10, finished 9-6 (2-3 A-10).\nUltimately, the Quakers found what they were looking for in Wray, who leaves St. Joe’s as the winningest coach in program history.\nWray, an Edmonton, Alberta, native, played at Duke before joining the Professional Lacrosse League from 2004 to 2011. He was drafted by the Calgary Roughnecks and was the National Lacrosse League Rookie of the Year in 2004.\n» READ MORE: Haverford College’s Harry Genth thought his baseball career was over. Now, he’s signed with Minnesota.\nHis last five seasons in the league were with the Wings, and he began coaching as an assistant at St. Joe’s during that stint.\n“I couldn’t say enough good things about my experience at St. Joe’s and how well positioned they are to continue to be successful in the sport of men’s lacrosse,” Wray said. “There were a lot of growing pains the first few years, but we started to kind of turn things around in the third year there and got things moving in the right direction.”\nWray acknowledged that Penn has had success before. The Quakers won the Ivy League and made NCAA quarterfinal appearances in 2019 and 2022, but he also knows what it takes to turn a program around.\n» READ MORE: Olin Chamberlain Jr. is grateful to play at Temple as a preferred walk-on: ‘Iron sharpens iron’\n“The Ivy League is as tough a conference from top to bottom as any conference in Division I lacrosse,” Wray said. “It’s definitely going to be a challenge to compete with the other teams in the Ivy, but not much different than the Atlantic 10, which is a very challenging league from top to bottom as well. The level of play in the Ivy might be slightly higher, and we’ll need to make sure that we’re prepared to compete with those guys.”\nWray is excited to join a program with a long heritage. St. Joe’s lacrosse is heading into its 33rd year as a varsity sport, whereas Penn has 125 seasons under its belt.\n“I learned a lot about recruiting [at St. Joe’s],” Wray said. “I learned a lot about how important it is to have the right people on board and to have the right culture established, and I think that those are going to be the biggest keys to bring to a more well-established program like Penn.”"
    }
  ],
  "argos_summary": "Penn head football coach Ray Priore reflects on last season's close losses and emphasizes the need for discipline as the team prepares for the upcoming season. With quarterback Liam O’Brien stepping in as the starter and a strong offensive line returning, the Quakers aim to improve on their 4-6 record. Meanwhile, the Ivy League has introduced a playoff system, adding stakes to the competition, with Penn ranked sixth in the preseason poll. In lacrosse, Taylor Wray has been appointed as the new head coach for Penn, aiming to revitalize the program after a disappointing season.",
  "argos_id": "BEJKPO497"
}