{
  "url": "https://www.bbc.co.uk/news/articles/c0kz3zlv6pjo",
  "authorsByline": "Rhiannon Yhnell, Maisie Lillywhite",
  "articleId": "16c0c77079484ad58b0f327f7c1cd5f8",
  "source": {
    "domain": "bbc.co.uk",
    "location": {
      "country": "gb",
      "state": "",
      "county": "",
      "city": "London",
      "coordinates": {
        "lat": 51.5073219,
        "lon": -0.1276474
      }
    }
  },
  "imageUrl": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/dbf6/live/2745a510-7440-11f0-bf4f-19fef6902ccb.jpg",
  "country": "gb",
  "language": "en",
  "pubDate": "2025-08-12T05:20:41.809000+00:00",
  "addDate": "2025-08-12T05:32:46.671987+00:00",
  "refreshDate": "2025-08-12T05:32:46.671989+00:00",
  "score": 1.0,
  "title": "Forest of Dean school uniform pop-up a 'godsend', mum says",
  "description": "Primary school uniforms cost parents, on average, more than £300 a year, government figures show.",
  "content": "A free pop-up school uniform shop has been described as a \"godsend\" by a mother-of-three. Chantal, from Coleford in Gloucestershire, said she would spend £200 a year buying uniform when all of her children were at school, but she now gets her daughter's uniform for free from the Salvation Army pop-up in Broadwell. Department for Education figures revealed the average cost of a full secondary school uniform and PE kit is more than £400, with some primary school uniforms costing £300. Lizzie Cox, of the Forest of Dean Salvation Army, said the hub was \"discreet\" and parents would not be judged.\n\nBoth new and pre-loved uniforms are offered to parents at the pop-up. Chantal said: \"My daughter is tall and I can't always get the clothes to fit her... [Salvation Army] cater for her and it's free, which is a bonus.\"\n\nAside from the cost of uniform, living in rural areas can make shopping difficult for parents. \"When we have to go to the uniform shop, that's in Gloucester, so I've got to spend to catch the bus because I don't drive. \"It's handy to come here because I live across the road so it saves a lot of time and energy,\" Chantal added. Ms Cox, from the Salvation Army, said the shop helped 20 families within days of opening.\n\n\"There's the historical assumption that it may just be for people who claim certain benefits [but] that's not true here,\" she said. \"This is open for everybody. There is no assessment criteria. \"We just really encourage our community who may be struggling, whatever their circumstances, to come and take what they need,\" Ms Cox added. A similar project has been helping parents for several years in Wiltshire, with the Chippenham Uniform Exchange saying it has supported more than 1,600 families.\n\n\"We have had families on the verge of tears just walking in the first time seeing how much uniform we've got,\" said founder of the scheme Jade Ugur. Pieces of uniform can be taken for free, although a voluntary donation is suggested - which can be as low as 50p for a generic item or £2 for items with logos from local schools. Ms Ugur added: \"People have come to us and said they were dreading how they were going to pay £300 for all that uniform. \"If that's not easy cash flow for you, it is going to put somebody in debt.\" The exchange has donation bins in Chippenham and is open for parents twice a week, with additional pop-up shops at schools. The Broadwell shop is open every Monday, Tuesday and Wednesday from 10:00 to 14:00 BST.",
  "medium": "Article",
  "links": [
    "https://www.bbc.co.uk/sounds/brand/p0914w0y",
    "https://www.bbc.co.uk/send/u180708183",
    "https://www.bbc.co.uk/news/topics/cjkm52r6605t",
    "https://www.bbc.co.uk/news/topics/czm9gyw6y4mt",
    "https://www.instagram.com/bbcradioglos/?hl=en",
    "https://www.bbc.co.uk/news/topics/cn1mzwglyz0t",
    "https://www.bbc.co.uk/news/articles/cpwy2g0ww85o",
    "https://www.salvationarmy.org.uk/forest-dean",
    "https://www.bbc.co.uk/news/uk-england-wiltshire-66361152",
    "https://www.bbc.co.uk/news/topics/cljev4jz3pjt",
    "https://twitter.com/BBCGlos",
    "https://bbc.in/47DEoQy",
    "https://www.bbc.co.uk/news/england/gloucestershire",
    "https://www.bbc.co.uk/news/topics/cdl7z4492rmt",
    "https://www.bbc.co.uk/news/articles/c5ye47gj4q4o",
    "https://www.facebook.com/bbcgloucestershire"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "uniform",
      "weight": 0.10335692
    },
    {
      "name": "Salvation Army",
      "weight": 0.0821894
    },
    {
      "name": "local schools",
      "weight": 0.074719645
    },
    {
      "name": "school",
      "weight": 0.07233996
    },
    {
      "name": "schools",
      "weight": 0.07233996
    },
    {
      "name": "parents",
      "weight": 0.07136593
    },
    {
      "name": "a full secondary school uniform",
      "weight": 0.070158966
    },
    {
      "name": "some primary school uniforms",
      "weight": 0.06730744
    },
    {
      "name": "Ms Cox",
      "weight": 0.06454328
    },
    {
      "name": "the uniform shop",
      "weight": 0.06273157
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/News/Local News",
      "score": 0.958984375
    },
    {
      "name": "/Jobs & Education/Education/Primary & Secondary Schooling (K-12)",
      "score": 0.93505859375
    },
    {
      "name": "/People & Society/Religion & Belief",
      "score": 0.489013671875
    }
  ],
  "sentiment": {
    "positive": 0.12061621,
    "negative": 0.44087273,
    "neutral": 0.4385111
  },
  "summary": "A free pop-up school uniform shop in the Forest of Dean, Gloucestershire, has been hailed as a \"godsend\" by a mother-of-three. She previously spent £200 a year buying uniform for her children, but now receives her daughter's uniform for free. The average cost of a full secondary school uniform and PE kit is over £400, with some primary school uniforms costing £300. Lizzie Cox from the Salvation Army said the shop helped 20 families within days of its opening. Both new and pre-loved uniforms are offered at the shop. The Chippenham Uniform Exchange in Wiltshire has supported over 1,600 families for several years.",
  "shortSummary": "A free pop-up school uniform shop in Broadwell, Gloucestershire, helps struggling parents with the cost and convenience of purchasing quality items.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "1bfbabff2ec748d7939022f5ea1e1eab",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.bbc.co.uk/news/articles/c5ye47gj4q4o",
      "text": "Struggling families 'need grants' for school uniforms\n- Published\nLow-income families in England struggling with the cost of school uniform should be offered grants as standard, one of the UK's largest debt advisers has said.\nIn Scotland, Wales and Northern Ireland, all families on certain benefits can claim between £93 to £200 per child for back-to-school clothing.\nBut Money Wellness found only a fifth of councils in England offer any support and has called on the UK government to introduce a statutory school clothing grant.\nThe Department for Education (DfE) said it was already changing the law to limit the number of branded items schools can insist on, saving some families over £50 on the back-to-school shop.\nHowever, the average cost of a school uniform is just over £340 for primary school children and around £454 for those in secondary education, according to DfE figures.\n\"For many low-income households, even with such savings, uniforms will remain unaffordable without proper support,\" said Adam Rolfe, policy and public affairs officer at Money Wellness.\nMoney Wellness says of 153 local education authorities in England, just 22 offer a dedicated uniform grant, while a further seven provide help but only in exceptional circumstances such as fire, flooding or being made homeless.\nIt said the data reveals a \"postcode lottery of support\".\nCouncils in places such as London, Yorkshire, and the north west offer help ranging between £30 to £170 per child.\nBut, it said: \"The vast majority offer nothing at all.\"\nMr Rolfe said: \"We urgently need a consistent, national approach to school uniform support to ensure no child is disadvantaged simply because of where they live.\"\nThe Local Government Association, the membership group for English councils, said: \"While some councils choose to help parents with the cost of school uniforms, funding pressures on council budgets make it increasingly difficult for them to continue these concessionary grants.\nWhile pupils in England are still out for the summer, the break finishes in around four weeks' time and the Children's Society charity said now is the time that school uniform banks are starting to get busier.\nFor Carrie, who was getting a uniform for her son Dillon for his new secondary school, places like the Green Uniform and Baby Bank in Cheshire are \"invaluable\".\n\"It's a real challenge to be able to afford a brand new school uniform,\" she told the BBC.\nCarrie said she had ordered £200 worth of new items, and she could \"now send some things back\" and even buy some spares.\n\"It's a real safety net,\" she said.\nBut Carrie said there were other costs too such as shoes and football boots. \"And Dillon will grow out of them so it is a continual issue really and with Christmas not far off, it is back-to-back for families with costs.\"\nWith household bills such as energy, water and council tax rising in April, Mr Rolfe said the costs of the start of the school year was an added financial burden.\nJason, who was at the Green Uniform and Baby Bank in Cheshire with his wife Julie and their children Amelia and Bobby, said it was not just low income families who were struggling with costs.\n\"You might earn a lot of money however, bills are going up, the cost of living is going up. We're in a sort of crisis where everyone's trying to save or penny-pinching wherever they can,\" he said.\nJosh, whose daughter Isabella was going into year seven, said the cost of school uniforms was \"very high\", but he received an email from the school telling him about the bank.\n\"It just helps places like this to support everyone, keep it a fair price,\" he said.\n\"It's great for everyone, there's no judgement on using secondhand clothes. There used to be a lot of stigma, it had to be branded but now there's no stigma on that, everyone's in the same boat struggling.\"\nAnd it is a sustainable way to shop, according to Jason: \"You're not having uniforms and clothes going to landfill sites\".\nMichelle Hawthorne, who helps run a school uniform bank in Winsford, Cheshire, said school uniform costs were an \"enourmous\" pressure for families.\n\"If you have multiple children across multiple schools, as a lot of our families do, you can see how the cost of that can become... unbearable.\"\nA Department for Education spokesperson said: \"Our Plan for Change is removing barriers to opportunity, with limits on branded items of school uniform just one of the steps we're taking to put money back into parents' pockets and break the link between background and success.\"\nGet in touch\nIf you are a parent, can you afford school uniforms? Do you have any money saving tips? Tell us.\nHow to save money on school uniform\nIf a council does not have a school uniform grant, families can apply for help through the Household Support Fund. Each council administers this differently, so check council websites for details\nCheck to see if the school organises second-hand uniform sales, or runs their own pre-loved uniform bank\nOther charities such as Turn2Us, external and The Fashion & Textile Children's Trust, external provide help\nCheck with retailers including major supermarkets for back-to-school deals on uniform basics\nSource: Money Wellness\nSign up for our Politics Essential newsletter to keep up with the inner workings of Westminster and beyond."
    },
    {
      "url": "https://www.bbc.co.uk/news/articles/cpwy2g0ww85o",
      "text": "Charity and M&S work to cut school uniform costs\n- Published\nA Jersey charity and a retailer have been working together to reduce school uniform costs.\nWhen parents donate used uniforms to Autism Jersey's boutique shop, they are given a 10% voucher for new uniforms at Marks & Spencer (M&S).\nIt comes as many families said they were struggling with the cost of living in the island and school uniforms were a serious pressure on some of them.\nParents have to buy up to five compulsory school uniform items in public and non-fee-paying schools, whereas, in the UK, the limit is three items, which puts greater pressures on families in the island.\nSonja Meacock is the manager of Autism Jersey's boutique shop and has two young children.\nShe said: \"Everyone is struggling at the moment... a lot of our customers are having to choose between feeding their children or buying school uniform.\"\n\"Uniform is a priority for our children – they need it so they feel comfortable in class – and it should a basic. But it costs me about £100 to £200 per child for those going to secondary school, so it's really expensive.\"\nJersey's Education Department was asked to comment on the concerns of the cost of school uniforms but has not responded.\nLesley Harrison, from Autism Jersey, helped set up the campaign with M&S.\nShe said: \"There is a lot of pressure on families trying to feed, clothe and house their children... We wanted to make sure we could create some support for them.\n\"We'd like to encourage other retailers to collaborate as well, so we hope this could be a regular fixture in our calendar because it is proving popular.\"\nThe current offer lasts until 27 September.\nFollow BBC Jersey on X, external and Facebook, external. Send your story ideas to channel.islands@bbc.co.uk, external.\nRelated topics\n- Published24 July\n- Published28 April 2023\n- Published19 February"
    },
    {
      "url": "https://www.bbc.co.uk/news/uk-england-wiltshire-66361152",
      "text": "Wiltshire parents using uniform exchange 'to save money and the planet'\n- Published\nA mum, who has set up a successful school uniform exchange, says more parents want to be sustainable.\nJade Ugur, from Chippenham, Wiltshire, created the exchange eight months ago.\nShe said: \"I've had feedback from families that they like the choice to buy reused items.\"\nCharities, like Eco-Schools, have also noticed an increase in parents getting pre-loved uniforms and retailers such as Marks & Spencer are looking to capitalise on the growing market.\n\"We have got summer dresses for all Chippenham's primary schools, and we have clothing for every single one of the secondary schools and special schools as well,\" Miss Ugur added.\n\"I think people really are making more conscious choices about the steps they can do to help the environment and help the planet.\n\"People are becoming more aware of just how much impact every item of clothing they purchase has on the environment.\"\nAnna Slade has been using the uniform exchange in Chippenham, external for a few months and said her children are happy to wear second-hand uniforms.\n\"They're up for it. They're quite aware of the impact that buying new uniforms and new clothing in general has on the environment,\" she said.\n\"Its important to reassure young people that by taking part in initiatives like this they are doing their bit to save the planet and live sustainably,\" she said.\n\"My children are quite anxious about the future of the planet.\n\"[But] I've been able to reassure them that all they can do is what it's in their power to control.\"\nToni Sutherland, a parent who attended one of the exchange's sales at Abbeyfield School in Chippenham, spoke about saving money but also raised the issue of sustainability.\nShe said: \"Lots of people just throw uniforms away at the end of a school year, which is very wasteful.\"\nAbbeyfield pupil Alex, who is moving from year seven to year eight, used the exchange sale to get another uniform.\n\"Second-hand things can really help out. It's better to recycle and reuse things [than throw them away],\" he said.\nA spokesperson for the climate charity Waste and Resources Action Programme (WRAP) says one new cotton shirt, a pair of trousers and a jumper has a carbon footprint of more than 13 kilos of carbon in their lifetime - and there are currently around 10m school children in the UK.\nSarah Gray, a lead analyst at WRAP, has noticed \"really good initiatives\" and \"steps forward\" in people being more sustainable around school uniforms.\nShe said: \"I think there's definitely a desire to improve.\n\"We do see action planning and we definitely see an increase in the use of more sustainable cottons, but there's an awful lot more still to do.\"\nMany big retailers are signed up to WRAP's textiles 2030 programme, which includes WRAP calculating their carbon footprints.\nEco-Schools - part of Keep Britain Tidy - said it had noticed an increase in pre-loved uniform sales, and among the 12,000 schools signed up in England there were more than 83,000 items of second-hand uniform redistributed in the past academic year.\nAlice Duggan, head of buying for Marks & Spencer childrenswear, said the brand is looking for more sustainable fabrics, like recycled polyester.\nShe added focus groups with parents and children pick up strong interest in sustainability.\n\"Even the quietest kid who hasn't said anything all day, you get on to sustainability and they just become animated.\n\"They're terribly passionate about recycling, about turning the lights off and if anything, they're kind of educating their parents.\n\"So we know this is something that really matters to our kids and something we are really keen to support.\"\nFollow BBC West on Facebook, external, Twitter, external and Instagram, external. Send your story ideas to: bristol@bbc.co.uk, external\n- Published1 September 2022\n- Published11 August 2023"
    },
    {
      "url": "https://www.bbc.co.uk/news/england/gloucestershire",
      "text": "Gloucestershire\nUpdates from your News topics will appear in My News and in a collection on the News homepage.\nFree uniform pop-up 'godsend', mum says\nPrimary school uniforms cost parents, on average, more than £300 a year, government figures show.\n- Attribution\n- Posted1 hour ago\n- Attribution\n- Posted1 hour ago\n- Attribution\n- Posted15 hours ago\n- Attribution\n- Posted12 hours ago\n- Attribution\n- Posted1 day ago\n- Attribution\n- Posted15 hours ago\n- Attribution\n- Posted18 hours ago\n- Attribution\n- Posted1 day ago\n- Attribution\n- Posted18 hours ago\n- Attribution\n- Posted1 day ago\n- Attribution\n- Posted1 day ago\n- Attribution\n- Posted2 days ago\n- Attribution\n- Posted2 days ago\n- Attribution\n- Posted2 days ago\n- Attribution\n- Posted3 days ago\n- Attribution\n- Posted3 days ago\n- Attribution\n- Posted3 days ago\nMore programmes to watch\n- AttributionBBC News\n- Available for 8 months\n- AttributionBBC News\n- Available for 4 months\n- AttributionBBC News\n- Available for 4 months\n- AttributionBBC News\n- Available for 4 months\n- AttributionBBC News\n- Available for 4 months\nSend us your story on WhatsApp\nSend us a message about your stories on 0800 313 4630 or tap below\nListen to audio from your BBC local radio station\n- AttributionBBC Radio Gloucestershire\n- Posted16 July\n- AttributionBBC Radio Gloucestershire\n- Posted31 July\n- AttributionBBC Radio Gloucestershire\n- Posted24 July\n- AttributionBBC Radio Gloucestershire\n- Posted24 July\nGloucestershire Sport\n- Attribution\n- Posted14 hours ago\n- Attribution\n- Posted15 hours ago\n- Attribution\n- Posted1 day ago\n- Attribution\n- Posted2 days ago\n- Comments\n- Attribution\n- Posted2 days ago\n- Comments\nGloucester Rugby\n- Attribution\n- Posted15 hours ago\n- Attribution\n- Posted2 August\n- Attribution\n- Posted1 August\n- Comments\n- Attribution\n- Posted25 July\n- Attribution\n- Posted23 July\nCheltenham Town\n- Attribution\n- Coverage starts at19:45 13 August\n- Attribution\n- Posted3 days ago\n- Attribution\n- Posted2 days ago\n- Comments\n- Attribution\n- Posted1 August\n- Attribution\n- Posted31 July\n- Comments\nForest Green Rovers\n- Attribution\n- Posted2 days ago\n- Comments\n- Attribution\n- Posted4 days ago\n- Attribution\n- Posted4 days ago\n- Attribution\n- Posted5 days ago\n- Attribution\n- Posted4 August\nWatch & listen\n- AttributionBBC One\n- AttributionBBC One\n- AttributionBBC One\n- AttributionBBC One\nLatest Updates\n- Attribution\n- Posted1 hour ago\n- Attribution\n- Posted1 hour ago\n- Attribution\n- Posted12 hours ago\n- Attribution\n- Posted15 hours ago\n- Attribution\n- Posted15 hours ago\n- Attribution\n- Posted18 hours ago\n- Attribution\n- Posted18 hours ago\n- Attribution\n- Posted1 day ago\n- Attribution\n- Posted1 day ago\n- Attribution\n- Posted1 day ago\n- Attribution\n- Posted1 day ago\n- Attribution\n- Posted2 days ago\n- Attribution\n- Posted2 days ago\n- Attribution\n- Posted2 days ago\n- Attribution\n- Posted3 days ago\n- Attribution\n- Posted3 days ago\n- Attribution\n- Posted3 days ago\n- Attribution\n- Posted3 days ago\n- Attribution\n- Posted3 days ago\n- Attribution\n- Posted4 days ago\n- Attribution\n- Posted4 days ago\n- Attribution\n- Posted4 days ago\n- Attribution\n- Posted4 days ago\n- Attribution\n- Posted4 days ago"
    }
  ],
  "argos_summary": "A free pop-up school uniform shop run by the Salvation Army in Broadwell, Gloucestershire, is providing essential support to families struggling with the high costs of school uniforms, which can exceed £400 for secondary students. Parents like Chantal have praised the initiative for its accessibility and the availability of both new and pre-loved uniforms. Similar projects, such as the Chippenham Uniform Exchange in Wiltshire, are also helping families save money and promote sustainability, while calls for government grants to support low-income families with uniform costs continue to grow.",
  "argos_id": "BZ8RYP3DF"
}