{
  "url": "https://finance.yahoo.com/news/why-kratos-defense-stock-topped-221100928.html",
  "authorsByline": "Eric Volkman, The Motley Fool",
  "articleId": "c38315352dbf46fdbab01f1d991b9705",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://s.yimg.com/ny/api/res/1.2/FD4Pq.9.larZlBbSJMx5xg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/motleyfool.com/927f6311a1f02f2f8da41a585374031f",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T22:11:00+00:00",
  "addDate": "2025-08-11T22:51:46.275123+00:00",
  "refreshDate": "2025-08-11T22:51:46.275125+00:00",
  "score": 1.0,
  "title": "Why Kratos Defense Stock Topped the Market on Monday",
  "description": "The good news kept coming for the defense company, which reported its latest quarterly figures late last week.",
  "content": "• This company sure didn't have a case of the Mondays, as several analysts made bullish adjustments to their existing takes.\n• Meanwhile, another pundit launched coverage of the stock with a buy rating.\n• 10 stocks we like better than Kratos Defense & Security Solutions ›\n\nThere's nothing like an estimates-beating quarter to bring a lingering bull stampede into a stock.\n\nBuoyed by good quarterly results it delivered last week and several analyst price-target boosts on Monday, Kratos Defense & Security Solutions (NASDAQ: KTOS) shares bumped higher again that session. They closed the day more than 2% higher in price, contrasting favorably with the 0.3% dip of the S&P 500 index.\n\nTime to go on offense with this defense stock\n\nThose bullish adjustments from pundits started flowing in on Friday, following Kratos' earnings release, and continued into the new week.\n\nMonday morning, both B. Riley and Noble Capital lifted their price targets on the defense stock and steadfastly maintained their equivalent of buy recommendations. The former's Mike Crawford now feels the stock is worth $72 per share, well up from his previous fair value assessment of $55. Joe Gomes from the latter company hiked his price target by 25% to $75 per share from $60.\n\nAs if to put an exclamation point on Kratos' solid second-quarter performance, one researcher even initiated coverage with its own buy rating. This was Cannacord Genuity's Austin Moeller. Essentially in line with his two peers, he believes the company's shares could reach a price of $74 apiece.\n\nWe can't really blame any investor or analyst for being optimistic about Kratos' future, given how satisfying some of those quarterly figures were. One that particularly stood out was the company's 17% year-over-year rise in sales, which is considerable for a company that's large and well established in its market.\n\nDo the experts think Kratos Defense & Security Solutions is a buy right now?\n\nThe Motley Fool’s expert analyst team, drawing on years of investing experience and deep analysis of thousands of stocks, leverages our proprietary Moneyball AI investing database to uncover top opportunities. They’ve just revealed their 10 best stocks to buy now — did Kratos Defense & Security Solutions make the list?\n\nWhen our Stock Advisor analyst team has a stock recommendation, it can pay to listen. After all, Stock Advisor’s total average return is up 1,060% vs. just 182% for the S&P — that is beating the market by 877.59%!*",
  "medium": "Article",
  "links": [
    "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=004e1e72-1a9c-4556-9f48-63e8303b249b&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-bbn-bn%3Faid%3D8867%26source%3Disaeditxt0001139%26ftm_cam%3Dsa-bbn-evergreen%26ftm_veh%3Darticle_pitch_feed_yahoo%26ftm_pit%3D18007&utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=2b8fe689-9d6c-48e2-b922-c9a3baea76f8",
    "https://www.fool.com/terms/p/price-target/?utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=2b8fe689-9d6c-48e2-b922-c9a3baea76f8",
    "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=5a5698c7-a5a8-444e-a398-3376925212eb&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-nonbbn-kp%3Faid%3D8867%26source%3Disaedikp0000053%26ftm_cam%3Dsa-bbn-evergreen%26ftm_veh%3Dkeypoints_pitch_feed_yahoo%26ftm_pit%3D17670",
    "https://www.fool.com/investing/2025/08/08/why-kratos-defense-stock-popped-today/?utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=2b8fe689-9d6c-48e2-b922-c9a3baea76f8"
  ],
  "labels": [
    {
      "name": "Opinion"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Kratos Defense Stock",
      "weight": 0.12775943
    },
    {
      "name": "Kratos Defense",
      "weight": 0.10466683
    },
    {
      "name": "stocks",
      "weight": 0.09715326
    },
    {
      "name": "Kratos",
      "weight": 0.08824647
    },
    {
      "name": "several analysts",
      "weight": 0.08308986
    },
    {
      "name": "Security Solutions",
      "weight": 0.07835629
    },
    {
      "name": "analyst",
      "weight": 0.07345813
    },
    {
      "name": "Kratos Defense & Security Solutions",
      "weight": 0.07076905
    },
    {
      "name": "price",
      "weight": 0.06985579
    },
    {
      "name": "several analyst price-target boosts",
      "weight": 0.06587267
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.98193359375
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.97900390625
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.9326171875
    },
    {
      "name": "/Business & Industrial/Aerospace & Defense/Other",
      "score": 0.52001953125
    }
  ],
  "sentiment": {
    "positive": 0.6891789,
    "negative": 0.05340389,
    "neutral": 0.2574173
  },
  "summary": "Kratos Defense & Security Solutions (NASDAQ: KTOS) saw a surge in shares following its strong Q2 performance, leading to several analyst price-target increases. The company closed the day more than 2% higher in price, outperforming the S&P 500 index. Two analysts, B. Riley and Noble Capital, increased their price targets on the defense stock and maintained their buy recommendations. Meanwhile, another analyst, Austin Moeller, initiated coverage with a buy rating. Kratos' 17% year-over-year rise in sales was particularly notable for a company that is well established in its market. The Motley Fool's expert analyst team has named the 10 best stocks to buy now.",
  "shortSummary": "Kratos Defense & Security Solutions surged 2% due to strong quarterly results and analyst upgrades, despite a broader market dip and market performance.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "ea1cb7d311c54340b7ddcc5372aa5e55",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.fool.com/investing/2025/08/08/why-kratos-defense-stock-popped-today/?utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=2b8fe689-9d6c-48e2-b922-c9a3baea76f8",
      "text": "Mid-cap defense stock and military drone specialist Kratos Defense & Security Solutions (KTOS 2.35%) soared 9.4% through 11:50 a.m. ET Friday after the company reported a substantial earnings beat last night.\nHeading into the report, analysts forecast Kratos would earn $0.09 per share on sales of $305.8 million, but Kratos reported an $0.11-per-share profit and sales of $351.5 million.\nKratos Defense Q2 earnings\nKratos' sales grew 17% in Q2, 15% of which was organic growth, a tremendous accomplishment -- although management said its book-to-bill ratio in Q2 was only 0.7, so business could be slowing down.\nNot all the news was good, however. On profits, it's worth noting that the $0.11 profit Kratos earned was a non-GAAP (adjusted) number, and that actual earnings as calculated according to generally accepted accounting principles (GAAP) amounted to only $0.02 per share -- down 60% year over year.\nFree cash flow in the quarter also ran negative, with Kratos burning through $31.1 million in Q2.\nIs Kratos stock a buy?\nAs implied by the weak book-to-bill ratio, Kratos guided below analyst estimates for Q3 revenue, just $315 million to $325 million. The Q2 revenue beat, however, more than makes up for that shortfall, and guidance for the full year is slightly ahead of Wall Street forecasts, with Kratos likely to generate sales of roughly $1.3 billion through the end of this year.\nThe company also expects to be profitable, at least on an operating basis, but also to continue burning cash through year end. Indeed, analysts who follow the company don't expect to see positive free cash flow before 2027.\nBetween the negative free cash flow and the lofty valuation -- more than 400 times this year's estimated earnings -- Kratos stock remains a sell for me."
    },
    {
      "url": "https://www.fool.com/terms/p/price-target/?utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=2b8fe689-9d6c-48e2-b922-c9a3baea76f8",
      "text": "If you're trying to figure out if a particular stock is worth buying, you might consider using the price target as a metric. It isn't a very precise method of evaluating stock values, but it can help you see how other analysts feel about the future of your favorite companies.\nDefinition\nWhat is a price target?\nA price target represents an analyst's estimate of the future price of a stock or other security. For stock analysts, the timeline is generally 12 to 18 months, but technical traders also use price targets.\nFor stock analysts, the purpose is to help advise investors as to where their stocks might be headed and to highlight stocks that could be very good values (or very bad ones) in the future. These analysts often work for large firms that may also give buying guidance.\nTechnical traders, on the other hand, may calculate price targets for any reason. Many times, they calculate price targets for buying and for selling, configuring their trading bots to buy at certain points and sell at others based on short-term pricing models that could be measured in as little as hours or days.\nWhat they tell you\nWhat do price targets tell you?\nPrice targets, like weather forecasts, are influenced by a lot of factors outside of anyone's control. So, if you're worried that a price target for a favored stock is lower than you expect, you may really be stressed for no reason.\nPrice targets are an attempt to predict future prices based on current information. That information is often incomplete since companies tend to keep anything they're not required to disclose close to their chests until it's time to show investors how well they're doing. And rightfully so -- the daily drama of the balance sheets might get to be too much if we had to hear about it more than once every few months.\nUltimately, the goal of price targets is to predict the future, but it's often through a foggy crystal ball. A 2006 study showed that share prices met or exceeded the price target at some point over the following year for just 53% of observations and only met or exceeded the price target in 30% of cases at the end of those same 12 months.\nHow to calculate\nHow do you calculate price targets?\nThere are many different ways to calculate a price target, but a common method involves using price-to-earnings ratios. If you divide the current P/E by the forward P/E and then multiply by the current price, you should have a reasonable prediction for the price target a year from now.\nThe current P/E gives you the earnings for the last 12 months as a ratio of the current market price to the average earnings of the prior 12 months. The forward P/E does the same but is calculated by dividing the market price by the average estimated earnings for the next 12 months. Using both balances the equation so that it's (theoretically) not relying too much on either ratio (although the forward P/E is calculated based on past performance to some extent).\nThe formula looks like this:\nCurrent Market Price x (Current P/E / Forward P/E) = Price Target\nRemember that this is only an estimate, and there are a lot of other factors that should be taken into consideration when you're trying to decide whether to buy, sell, or continue to hold any financial instrument in your portfolio.\nRelated investing topics\nWhy they matter\nWhy are price targets important to investors?\nNeither investors nor analysts are always at the forefront of everything all the time. That's why there are thousands of analysts who crunch piles of data to create price targets for companies. Even though price targets aren't always accurate, that doesn't mean they have zero value.\nA price target is good for telling you where analysts think that companies' stocks are going to be in a year or so. You'll always see a range of prices from them since analysts are hardly a hive mind. That should give you some idea of how to plan for the future, assuming nothing serious changes between now and the point where you plan to rebalance.\nIt's just one of many metrics you should be watching as a DIY investor, and if you have the time, calculating for yourself, if only to better understand how it really works."
    }
  ],
  "argos_summary": "Kratos Defense & Security Solutions (NASDAQ: KTOS) saw its stock rise over 2% following a strong quarterly earnings report that exceeded analyst expectations, with a 17% year-over-year sales increase. Analysts from B. Riley and Noble Capital raised their price targets significantly, reflecting optimism about the company's future, while Cannacord Genuity initiated coverage with a buy rating. Despite the positive quarterly results, concerns remain regarding negative free cash flow and a low book-to-bill ratio, leading some analysts to maintain a cautious outlook on the stock.",
  "argos_id": "CHXPSV32C"
}