{
  "url": "https://www.dailywire.com/news/why-congress-holds-the-key-to-extending-trumps-d-c-police-takeover",
  "authorsByline": "Daniel Chaitin",
  "articleId": "6d334c7ca70b4473a9ef863e2073ec90",
  "source": {
    "domain": "dailywire.com",
    "paywall": false,
    "location": null
  },
  "imageUrl": "https://dw-wp-production.imgix.net/2025/08/GettyImages-2225803312.jpg?ar=16%3A9&auto=compress&crop=faces&cs=origin&fit=crop&w=1200&h=800&ixlib=react-9.10.0",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T21:41:38+00:00",
  "addDate": "2025-08-11T22:33:39.808135+00:00",
  "refreshDate": "2025-08-11T22:33:39.808136+00:00",
  "score": 1.0,
  "title": "Why Congress Holds The Key To Extending Trump’s D.C. Police Takeover",
  "description": "Congress will have a significant role to play if President Donald Trump wants to extend his takeover of the police in Washington, D.C., to crack down on crime for more than a month.Trump invoked Section 740 of the District of Columbia Home Rule Act and declared a public emergency on Monday. Under the law, Trump is allowed to direct the D.C. mayor to deliver him control of the Metropolitan Police Department.However, the Home Rule Act says the president is allowed to initially use this power for up to 48 hours. If the president wants to extend that authority for 30 days, relevant committees in Congress must be notified with an explanation of the need and expected time duration.Indeed, Trump wrote a letter on Monday to the House Oversight Committee saying he needed to address violent crime in D.C. He noted the emergency would continue until he determined it was no longer needed or lasted for the “maximum period” allowed under Section 740.Any period beyond 30 days would require Congress to pass a joint resolution that authorizes the extension. Presently, Republicans control both chambers of Congress. The GOP leaders of the House and Senate have both expressed approval of Trump’s D.C. police takeover.“Every American should be able to visit and enjoy Washington, D.C. without fear. House Republicans support this effort to CLEAN UP Washington, END the crime wave, and RESTORE the beauty of the greatest capital in the world,” House Speaker Mike Johnson (R-LA) declared in a post on X.Senate Majority Leader John Thune (R-SD) said, “I’m grateful for [Trump’s] leadership and for this administration’s commitment to protecting communities large and small across America. Washington, D.C., should be a place where people can safely live, visit, work, and raise a family, and today’s announcement is a positive step in that direction.”Democrats have been heavily critical of the move and plan to push legislation that would give nation’s capital “full control” of its police force as well as the D.C. National Guard, which Trump previously said he was deploying to assist in the crime-fighting effort.“Violent crime in Washington, D.C. is at a thirty-year low. Donald Trump has no basis to take over the local police department. And zero credibility on the issue of law and order. Get lost,” House Minority Leader Hakeem Jeffries (D-NY) said in a post on X.Senate Minority Leader Chuck Schumer (D-NY) proclaimed, “For all the talk Republicans give about giving their localities their rights, where are they now? If this was anything other than a political ploy and attempted distraction from Trump’s other scandals, if he actually cared about the people of DC, he’d demand the House finally release the billion dollars of DC’s funding they’ve been sitting on for months.”",
  "content": "Congress will have a significant role to play if President Donald Trump wants to extend his takeover of the police in Washington, D.C., to crack down on crime for more than a month.\n\nTrump invoked Section 740 of the District of Columbia Home Rule Act and declared a public emergency on Monday. Under the law, Trump is allowed to direct the D.C. mayor to deliver him control of the Metropolitan Police Department.\n\nHowever, the Home Rule Act says the president is allowed to initially use this power for up to 48 hours. If the president wants to extend that authority for 30 days, relevant committees in Congress must be notified with an explanation of the need and expected time duration.\n\nIndeed, Trump wrote a letter on Monday to the House Oversight Committee saying he needed to address violent crime in D.C. He noted the emergency would continue until he determined it was no longer needed or lasted for the “maximum period” allowed under Section 740.\n\nAny period beyond 30 days would require Congress to pass a joint resolution that authorizes the extension. Presently, Republicans control both chambers of Congress. The GOP leaders of the House and Senate have both expressed approval of Trump’s D.C. police takeover.\n\n“Every American should be able to visit and enjoy Washington, D.C. without fear. House Republicans support this effort to CLEAN UP Washington, END the crime wave, and RESTORE the beauty of the greatest capital in the world,” House Speaker Mike Johnson (R-LA) declared in a post on X.\n\nSenate Majority Leader John Thune (R-SD) said, “I’m grateful for [Trump’s] leadership and for this administration’s commitment to protecting communities large and small across America. Washington, D.C., should be a place where people can safely live, visit, work, and raise a family, and today’s announcement is a positive step in that direction.”\n\nDemocrats have been heavily critical of the move and plan to push legislation that would give nation’s capital “full control” of its police force as well as the D.C. National Guard, which Trump previously said he was deploying to assist in the crime-fighting effort.\n\n“Violent crime in Washington, D.C. is at a thirty-year low. Donald Trump has no basis to take over the local police department. And zero credibility on the issue of law and order. Get lost,” House Minority Leader Hakeem Jeffries (D-NY) said in a post on X.\n\nSenate Minority Leader Chuck Schumer (D-NY) proclaimed, “For all the talk Republicans give about giving their localities their rights, where are they now? If this was anything other than a political ploy and attempted distraction from Trump’s other scandals, if he actually cared about the people of DC, he’d demand the House finally release the billion dollars of DC’s funding they’ve been sitting on for months.”",
  "medium": "Article",
  "links": [
    "https://www.dailywire.com/news/were-gonna-take-our-capital-back-heres-everything-trump-is-going-to-do-to-clean-up-d-c",
    "https://x.com/RepJeffries/status/1954926861882110385",
    "https://x.com/SenSchumer/status/1954975538348466192",
    "https://x.com/LeaderJohnThune/status/1954989497290285409",
    "https://x.com/SpeakerJohnson/status/1954951828338102476",
    "https://norton.house.gov/media/press-releases/norton-van-hollen-will-reintroduce-bills-grant-dc-full-control-over-its",
    "https://x.com/GOPoversight/status/1954985007002403074"
  ],
  "labels": [
    {
      "name": "Opinion"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Donald Trump",
      "weight": 0.08902634
    },
    {
      "name": "President Donald Trump",
      "weight": 0.086802125
    },
    {
      "name": "Trump",
      "weight": 0.08574693
    },
    {
      "name": "House Minority Leader Hakeem Jeffries",
      "weight": 0.0804935
    },
    {
      "name": "House Republicans",
      "weight": 0.080226064
    },
    {
      "name": "D.C. National Guard",
      "weight": 0.07620553
    },
    {
      "name": "D.C.",
      "weight": 0.07488988
    },
    {
      "name": "House Speaker Mike Johnson",
      "weight": 0.07278456
    },
    {
      "name": "Senate Minority Leader Chuck Schumer",
      "weight": 0.07148548
    },
    {
      "name": "House",
      "weight": 0.07018016
    }
  ],
  "topics": [
    {
      "name": "Congress"
    },
    {
      "name": "US Politics"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.9892578125
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.90771484375
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.7744140625
    },
    {
      "name": "/Law & Government/Government/Legislative Branch",
      "score": 0.7451171875
    },
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.71630859375
    }
  ],
  "sentiment": {
    "positive": 0.095387,
    "negative": 0.6153555,
    "neutral": 0.28925753
  },
  "summary": "President Donald Trump has been allowed to extend his control of the police in Washington, D.C., using Section 740 of the District of Columbia Home Rule Act to address violent crime. However, any extension beyond 30 days would require Congress to pass a joint resolution. Currently, Republicans control both chambers of Congress and have approved of the takeover. Democrats have criticized the move, calling for legislation giving Washington full control of its police force and the D.",
  "shortSummary": "Congress holds significant political significance as Congress considers extending President Donald Trump’s takeover of Washington, D.C, using Section 740 under the Home Rule Act to combat crime.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "8e86564ead5b46f8a8cf61a9936b4de3",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.dailywire.com/news/were-gonna-take-our-capital-back-heres-everything-trump-is-going-to-do-to-clean-up-d-c",
      "text": "President Donald Trump promised on Monday to clean up crime and vagrancy in the nation’s capital by shifting more responsibilities over the district to the federal government.\nTrump made the announcement during a press conference at the White House, where he laid out a number of executive actions he was taking to fight violent crime, decrease homelessness, and otherwise clean up Washington, D.C.\n“I’m announcing a historic action to rescue our nation’s capital from crime, bloodshed, bedlam, and squalor, and worse,” Trump said. “ This is Liberation Day in D.C., and we’re gonna take our capital back. We’re taking it back.”\nTrump on Monday invoked Section 740 of the District of Columbia Home Rule Act and declared a public emergency. This granted him to move the D.C. Police Department under the control of the Justice Department. DEA Administrator Terry Cole will head the department, per Trump’s orders.\nSecretary of Defense Pete Hegseth, Attorney General Pam Bondi, Interior Secretary Doug Burgum, and U.S. District Attorney for the District of Columbia Jeanine Pirro all appeared alongside Trump at the news conference.\nThe president also added that he was sending 800 National Guard troops to patrol the streets of D.C. Last week, the administration sent 500 federal agents into the district, including from the FBI, ATF, DEA, Park Police, the U.S. Marshal Service, the Secret Service, and the Department of Homeland Security.\n“The murder rate in Washington today is higher than that of Bogota, Colombia, Mexico City, some of the places that you hear about as being the worst places on earth,” Trump said, adding that “the only language” that criminals understand is when you “knock the hell out of them.”\nThe president added that he would like to see Republicans in Congress move to end cashless bail in the district, saying that the policy led to lawlessness in the streets. Trump added that he planned to improve infrastructure in the district and crack down on homeless encampments.\n“We’re going to replace the medians that are falling down all over the roads. We’re gonna replace the potholes,” he said.\nBurgum, who briefly spoke during the conference, said that Park Police had cleared over 70 homeless camps from D.C. since March 27.\n“We’re going to be removing homeless encampments from all over our parks, our beautiful, beautiful parks, which now a lot of people can’t walk on,” Trump said. “We’re moving the encampments away, trying to take care of people. Some of those people, we don’t know how they even got there.”"
    },
    {
      "url": "https://norton.house.gov/media/press-releases/norton-van-hollen-will-reintroduce-bills-grant-dc-full-control-over-its",
      "text": "Norton, Van Hollen Will Reintroduce Bills to Grant D.C. Full Control Over Its National Guard, Police as Trump Calls in D.C. National Guard and Federalizes D.C. Police\nWASHINGTON D.C. – Today, Congresswoman Eleanor Holmes Norton (D-DC) and U.S. Senator Chris Van Hollen (D-MD) announced that they will reintroduce their legislation to grant the District of Columbia full control over the D.C. National Guard and the Metropolitan Police Department when Congress reconvenes in September. These measures are needed more urgently than ever as President Donald Trump today assumed control of D.C.’s police department and announced plans to deploy the National Guard in the District. The Administration took these actions without consulting D.C. government officials and despite crime being at a 30-year low in 2024 and a decrease of 26% this year compared to the same time period last year.\n“President Trump's unprecedented federalization of the D.C. Police today and his activation of the D.C. National Guard without D.C.'s consent underscore the necessity of D.C. statehood,” Norton said. “Until we get the full protections that statehood would provide, our bills repealing the president's authority to federalize the local D.C. police department and to give D.C.'s mayor control over the D.C. National Guard, like governors of states have over their National Guards, places D.C. closer to having control over some of its most vital affairs. Thank you to Senator Van Hollen for being my determined partner on these bills in the Senate and a vigorous advocate for D.C. home rule.”\n“Trump’s raw authoritarian power grab in D.C. is part of a growing national crisis. He’s playing dictator in our nation’s capital as a dress rehearsal as he pushes democracy to the brink. While we continue to fight for statehood for D.C., Trump’s assault on D.C.’s autonomy makes it all the more critical that we give the District full control over its own National Guard and police department. This is not just about self-governance for D.C. – it’s also about preventing authoritarian overreach by a lawless president like we are witnessing today,” said Senator Van Hollen.\n“While the District of Columbia has seen violent crime decline over the past two years, there is still more progress to be made on making it safer for all. But if Trump actually cared about the people of D.C. and their safety, he wouldn’t have blocked the local government from spending over $1 billion of its own money to fund its own police department, schools, and more. Instead of commandeering the local police and deploying the military to the City’s streets, Donald Trump should give D.C. back its money and get the hell out of the District’s way,” Senator Van Hollen continued. The Senator introduced bipartisan legislation with Senator Susan Collins (R-Maine) to unlock the over $1 billion of D.C.’s own funds that Republicans unnecessarily froze through their funding bill in March. Their bill passed the Senate unanimously, but House Republicans have still not brought it up for a vote.\nThe District of Columbia Police Home Rule Act would repeal the provision in the Home Rule Act that gives the President the authority to federalize the Metropolitan Police Department. The Home Rule Act provides that, “whenever the President of the United States determines that special conditions of an emergency nature exist which require the use of the Metropolitan Police force for Federal purposes, he may direct the mayor to provide him, and the mayor shall provide, such services of the Metropolitan Police force as the President may deem necessary and appropriate.”\nThe District of Columbia National Guard Home Rule Act would name the Mayor of Washington, D.C. as Commander-in-Chief of the D.C. National Guard, giving the Mayor the same control over the D.C. National Guard that the governors of the states and the three territories with National Guards have over their respective National Guards. Under current law, the President is Commander-in-Chief of the D.C. National Guard.\n###"
    }
  ],
  "argos_summary": "President Trump declared a public emergency in Washington, D.C., invoking Section 740 of the Home Rule Act to take control of the Metropolitan Police Department and deploy National Guard troops to address crime and homelessness. While Trump argues that this action is necessary due to rising crime rates, Democrats criticize the move as an overreach of federal power, noting that crime is at a 30-year low. Congressional approval is required for any extension of Trump's authority beyond 48 hours, and Democrats plan to introduce legislation to restore local control over D.C.'s police and National Guard.",
  "argos_id": "D3YV39XV2"
}