{
  "url": "https://www.yahoo.com/news/articles/peaceful-garden-opens-critical-care-043237108.html",
  "authorsByline": "Shariqua Ahmed - BBC News, Peterborough",
  "articleId": "a4f5798a0a8c44a1a2ab52de89267bba",
  "source": {
    "domain": "yahoo.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://edgecast-img.yahoo.net/mysterio/api/39f02c73720d84db8e2a83eed6b871fb1d12ba407d7de7b86d72a2a65691ff6b/ynews/resizefill_w1200/https://media.zenfs.com/en/bbc_us_articles_995/001b47654004ec44aca6624b595595ad",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T04:32:37+00:00",
  "addDate": "2025-08-12T04:50:15.408297+00:00",
  "refreshDate": "2025-08-12T04:50:15.408301+00:00",
  "score": 1.0,
  "title": "'Peaceful' garden opens for critical care staff",
  "description": "Staff welcome the space, designed to give respite from frontline care, describing it as \"beautiful\".",
  "content": "A newly-opened garden at a city hospital is offering much-needed respite for critical care staff.\n\nThe calming space, at Peterborough City Hospital, was first proposed during the pandemic by sister Ros Rippon, who recognised the need for an outdoor area where staff could relax from the pressures of frontline care.\n\nIt was funded by the Friends of Peterborough Hospital and was delivered by the North West Anglia Hospitals' Charity, after construction work began earlier this year.\n\nStaff have described it as \"peaceful\" and \"beautiful\".\n\nMs Rippon added: \"We wanted to convert this under-used area into something that would be beneficial for our hard-working staff.\n\n\"We approached the Friends of the Hospital, who were in the process of handing over to the hospital charity, and they agreed that it would be a nice final project so kindly provided the funding - which was really touching.\n\n\"We're absolutely thrilled that it's all come together so well, and are so grateful to everyone involved.\"\n\nPhilip Fearn, charity project manager at North West Anglia NHS Foundation Trust (NWAFT), said: \"The garden is beautiful and we're thrilled to have been able to support the creation of a space which will truly enhance the experience of NWAFT staff.\"\n\nSenior staff nurse Mary Portugal said: \"The garden is so calming and peaceful.\n\n\"It's a fantastic place to catch your breath and have a short reprieve from the busy unit.\"\n\n\"Apparently, it's beautiful overnight with the solar lights on and it has been a big hit with the night staff during these warm nights,\" she said.",
  "medium": "Article",
  "links": [
    "https://www.bbc.co.uk/sounds/curation/p0cjd9zv?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Blink%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "https://www.nwangliaft.nhs.uk/north-west-anglia-hospitals-charity/",
    "https://www.nwangliaft.nhs.uk/",
    "https://www.bbc.co.uk/news/articles/cly8prpkzxno?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Blink%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
    "https://www.instagram.com/bbccambridgeshire",
    "https://www.facebook.com/bbccambridgeshire/",
    "https://x.com/BBCcambs"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "critical care staff",
      "weight": 0.108730435
    },
    {
      "name": "NWAFT staff",
      "weight": 0.104014486
    },
    {
      "name": "Senior staff nurse Mary Portugal",
      "weight": 0.09558949
    },
    {
      "name": "North West Anglia NHS Foundation Trust",
      "weight": 0.09481981
    },
    {
      "name": "staff",
      "weight": 0.094009236
    },
    {
      "name": "Peterborough City Hospital",
      "weight": 0.0917937
    },
    {
      "name": "Peterborough Hospital",
      "weight": 0.08969541
    },
    {
      "name": "charity project manager",
      "weight": 0.08805047
    },
    {
      "name": "sister Ros Rippon",
      "weight": 0.07932517
    },
    {
      "name": "Ros Rippon",
      "weight": 0.07366893
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Health"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Local News",
      "score": 0.97607421875
    },
    {
      "name": "/Health/Medical Facilities & Services/Hospitals & Treatment Centers",
      "score": 0.85595703125
    },
    {
      "name": "/Health/Medical Facilities & Services/Other",
      "score": 0.4228515625
    }
  ],
  "sentiment": {
    "positive": 0.7541743,
    "negative": 0.05223233,
    "neutral": 0.19359341
  },
  "summary": "A newly opened garden at Peterborough City Hospital has provided respite for critical care staff. The space was first proposed during the pandemic and was funded by the Friends of Peterborough Hospital and the North West Anglia Hospitals' Charity. Staff have described the garden as \"peaceful\" and \"beautiful\".",
  "shortSummary": "A new calming garden at Peterborough City Hospital, funded by the Friends of Peterborough Hospitals' Charity, provides respite for critical care staff amid high pressure and workloads.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "d9106470ec724e148f0f81bde7f32430",
  "places": [
    {
      "osmId": "663598990",
      "road": "Bretton Gate",
      "suburb": "Ravensthorpe",
      "city": "Peterborough",
      "county": "City of Peterborough",
      "stateDistrict": "Cambridgeshire and Peterborough",
      "state": "England",
      "postcode": "PE3 9GZ",
      "country": "United Kingdom",
      "countryCode": "gb",
      "amenity": "Peterborough City Hospital",
      "coordinates": {
        "lat": 52.58444735,
        "lon": -0.27852187231543496
      }
    }
  ],
  "scraped_sources": [
    {
      "url": "https://www.bbc.co.uk/news/articles/cly8prpkzxno?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Blink%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D",
      "text": "New garden unveiled for hospital staff\n- Published\nStaff from a hospital were left feeling \"very lucky\" after a reflective garden was unveiled.\nThe Staff Reflection Garden is an outdoor space situated in the heart of Peterborough City Hospital and has been funded by North West Anglia Hospitals' Charity.\nThe hospital was given £40,000 for the transformation of the area.\nChief executive officer Hannah Coffey said: \"We feel very lucky to have this area of tranquillity in the heart of our busy hospital and I am sure our staff feel the same.\"\nThere was a short ceremony to mark the opening of the new green space on Wednesday.\nThe garden includes all-weather seating, new planting and a specially commissioned sculpture by local metal artist Jeni Cairns to remember colleagues who have died.\nStaff will be able to hang handmade metal leaves onto the sculpture with their colleagues' names engraved in their memory.\nNorth West Anglia Hospitals' charity project manager Philip Fearn said: \"The garden is absolutely stunning, and we are thrilled that so many colleagues were able to join us for the official opening.\"\nGet in touch\nDo you have a story suggestion for Cambridgeshire?\nFollow Cambridgeshire news on BBC Sounds, Facebook, external, Instagram, external and X, external.\nRelated topics\n- Published18 November 2024\n- Published31 July 2024"
    }
  ],
  "argos_summary": "A new Staff Reflection Garden has been opened at Peterborough City Hospital, providing a tranquil space for critical care staff to relax. Proposed by sister Ros Rippon during the pandemic, the garden was funded by the Friends of Peterborough Hospital and features all-weather seating, new plantings, and a sculpture to honor deceased colleagues. Staff have praised the garden as a beautiful and calming retreat, enhancing their experience amidst the pressures of frontline care.",
  "argos_id": "D4R4ZBS99"
}