{
  "url": "https://finance.yahoo.com/news/trump-signs-90-day-extension-000257512.html",
  "authorsByline": "Caitlin Keith",
  "articleId": "f3721f058c70418da0ca3886149ae137",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/deseret_news_992/24dcb75103135317f76f02693efb655a",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T00:02:57+00:00",
  "addDate": "2025-08-12T00:23:32.425402+00:00",
  "refreshDate": "2025-08-12T00:23:32.425403+00:00",
  "score": 1.0,
  "title": "Trump signs 90-day extension on tariff truce with China",
  "description": "The triple-digits tariffs on Chinese imports were set to resume on Tuesday, but Trump signed an executive order with a 90-day extension on Monday.",
  "content": "President Donald Trump has extended a tariff truce between the U.S. and China, holding off the triple-digit tariffs that were originally announced in the spring.\n\nThe tariffs were set to resume on Tuesday, but Trump signed an executive order with a 90 day extension on Monday, per Newsweek. This extension sets a new deadline date of Nov. 9 at 12:01 a.m.\n\nAccording to Newsweek, when asked by reporters on Monday how he planned to extend the deadline Trump said “We’ll see what happens. They’ve been dealing quite nicely. The relationship is very good with President Xi and myself.”\n\nThe delay in the tariffs’ resumption was expected after the latest round of talks between U.S. and Chinese trade negotiators which took place in late July in Stockholm, Sweden, per CNBC.\n\nWithout the deadline extension, U.S. tariffs on China would have gone back up to where they stood in April when the tariff war between the world’s two biggest economies was at its peak.\n\nAt that time, Trump had set blanket 145% tariffs on Chinese imports and China retaliated with 125% tariffs on goods from the U.S., according to CNBC.\n\nThe two countries agreed to pause most of the tariffs in May, after negotiators met in Geneva. The U.S. lowered its tariffs to 30% and China dropped its tariffs down to 10%.\n\n“Monday’s extension is the latest example of how Trump’s on-again, off-again tariffs have shifted with little prior notice, a dynamic that has made U.S. trade policy unpredictable for many businesses,” according to CNBC.\n\nAccording to Reuters, the extension of the deadline into November gives crucial time for the autumn surge of imports for the end of year holiday season at lower tariff rates.\n\nChina is the United States’ third largest trading partner under Mexico and Canada, reported Newsweek. There are a variety of products that are regularly imported from China such as clothes, computer chips and household items.\n\nThis extension will give both countries more time for negotiations before implementing the higher tariffs.\n\n“The whole reason for the 90-day pause in the first place was to lay the groundwork for broader negotiations and there’s been a lot of noise about everything from soybeans to export controls to excess capacity over the weekend,” said Kelly Ann Shaw, a former senior White House trade official and now with law firm Akin Gump Strauss Hauer & Feld, per Reuters.",
  "medium": "Article",
  "links": [
    "https://www.cnbc.com/2025/08/11/trump-china-tariffs-deadline-extended.html",
    "https://www.newsweek.com/tariffs-china-donald-trump-trade-us-update-2111964",
    "https://www.reuters.com/world/china/trump-signs-order-extending-china-tariff-truce-by-90-days-white-house-says-2025-08-11/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "U.S. tariffs",
      "weight": 0.12279619
    },
    {
      "name": "tariff truce",
      "weight": 0.11038141
    },
    {
      "name": "lower tariff rates",
      "weight": 0.1021
    },
    {
      "name": "U.S. trade policy",
      "weight": 0.08713207
    },
    {
      "name": "President Donald Trump",
      "weight": 0.076374665
    },
    {
      "name": "China",
      "weight": 0.076279566
    },
    {
      "name": "Donald Trump",
      "weight": 0.07309762
    },
    {
      "name": "U.S.",
      "weight": 0.07167854
    },
    {
      "name": "Trump",
      "weight": 0.070878536
    },
    {
      "name": "law firm Akin Gump Strauss Hauer",
      "weight": 0.06664781
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.97265625
    },
    {
      "name": "/People & Society/Social Sciences/Political Science",
      "score": 0.94287109375
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.9150390625
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.73828125
    },
    {
      "name": "/Business & Industrial/Shipping & Logistics/Import & Export",
      "score": 0.55224609375
    },
    {
      "name": "/News/World News",
      "score": 0.387939453125
    }
  ],
  "sentiment": {
    "positive": 0.10554982,
    "negative": 0.52694345,
    "neutral": 0.36750674
  },
  "summary": "President Donald Trump has extended a tariff truce between the U.S. and China, effectively preventing the triple-digit tariffs that were originally announced in the spring. The extension sets a new deadline date of Nov. 9 at 12:01 a.m. without the extension, the tariffs would have returned to where they stood in April, when the tariff war was at its peak. The two countries agreed to suspend most of the tariffs in May after negotiators met in Geneva and the US lowered its tariffs to 30% and China dropped its tariffs down to 10%. The extension will give both countries more time for negotiations before implementing the higher tariffs.",
  "shortSummary": "President Donald Trump extended the tariff truce with China until November, allowing more time for trade negotiations and potential resumption of tariffs.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "1cfd25487a5140378ee12ad25c9864c6",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.newsweek.com/tariffs-china-donald-trump-trade-us-update-2111964",
      "text": "🎙️ Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump has signed an executive order granting a 90-day extension to the China tariff deadline, CNBC reported Monday, citing a White House official.\nBefore the extension was granted, the pause was expected to end on Tuesday.\nWhy It Matters\nIf action had not been taken to extend the deadline, tariffs on imports from China were expected to increase to where the rates stood in April.\nChina is the United States' third-largest trading partner after Mexico and Canada, according to year-to-date United States Census Bureau data from June. The U.S. imports a variety of products from China, including clothes, household items, computer chips and electric vehicle batteries.\nChina Tariff Extension: What We Know\nThe reported extension comes after U.S. and Chinese trade negotiators met in Stockholm, Sweden, late last month. U.S. and Chinese officials said they expected the deadline to be extended following the meeting.\nBoth sides first agreed to pause higher tariffs on each other's goods in May after a meeting in Geneva, Switzerland.\nPrior to the negotiations, Trump had threatened to impose tariffs of 245 percent on Chinese goods. China said it would raise its tariffs on U.S. goods to 125 percent.\nCurrently, Chinese imports are subject to a 10 percent baseline tariff and an additional 20 percent related to China's alleged failure to address illegal fentanyl trading.\nWhat is the New China Tariff Deadline?\nThe new agreement would now expire on November 9 at 12:01 a.m., CNBC Washington correspondent Megan Cassella said on X.\nWhat People Are Saying\nPresident Donald Trump, in comments to reporters on Monday when asked how he planned to extend the deadline: \"We'll see what happens. They've been dealing quite nicely. The relationship is very good with President Xi (Jinping) and myself.\"\nU.S. Trade Representative Jamieson Greer, talking about the possibility of an extension to the trade agreement between the U.S. and China at a press conference last month: \"We're going to head back to Washington and we're going to talk with the president if that's something he wants to do.\"\nChina's Vice Premier He Lifeng, in a statement from China's Ministry of Commerce last month: \"A stable, healthy and sustainable China-U.S. economic and trade relationship serves not only the two countries' respective development goals but also contributes to global economic growth and stability.\"\nThis article includes reporting by the Associated Press.\nDo you have a story that Newsweek should be covering? Do you have any questions about this story? Contact LiveNews@newsweek.com.\nAbout the writer\nJenna Sundel is a Newsweek reporter based in New Jersey. Her focus is reporting on breaking news. She has in-depth ... Read more"
    },
    {
      "url": "https://www.cnbc.com/2025/08/11/trump-china-tariffs-deadline-extended.html",
      "text": "President Donald Trump on Monday delayed high U.S. tariffs on Chinese goods from snapping back into place for another 90 days, a White House official told CNBC.\nThose tariffs were set to resume Tuesday. But Trump signed an executive order hours beforehand that extends the deadline until mid-November, according to the official.\nThe delay was the expected outcome from the latest round of talks between U.S. trade negotiators and their Chinese counterparts, which took place in Stockholm in late July.\nIf the deadline were not extended, then U.S. duties on China would have shot back up to where they stood in April, when the tariff war between the world's largest trading nations was at its peak.\nAt that time, Trump had cranked up blanket tariffs on Chinese imports to 145%, and China had retaliated with 125% duties on U.S. goods.\nBut the two sides agreed to pause most of those tariffs in May, after negotiators met for the first time in Geneva. The U.S. pared its tariffs back to 30%, and China dropped its levies to 10%.\nMonday's extension is the latest example of how Trump's on-again, off-again tariffs have shifted with little prior notice, a dynamic that has made U.S. trade policy unpredictable for many businesses.\nTrump has previously announced steep tariffs on countries or specific sectors, only to scale them back, tweak them or pause them days or weeks later.\nThe \"reciprocal tariffs\" he initially rolled out in early April, for instance, were quickly paused and then delayed multiple times before taking effect in an altered form last week.\nOn Sunday, Trump said he wanted China to \"quickly quadruple\" its orders of U.S. soybeans.\n\"This is also a way of substantially reducing China's Trade Deficit with the USA,\" Trump wrote in a Truth Social post.\nChicago soybean prices rose Monday. It was not immediately clear if China has agreed to step up its soybean purchases in response to Trump's post."
    }
  ],
  "argos_summary": "President Donald Trump has signed an executive order extending the deadline for U.S. tariffs on Chinese goods by 90 days, delaying the resumption of high tariffs that were set to take effect. This extension, which pushes the deadline to November 9, follows recent trade negotiations between U.S. and Chinese officials and aims to provide more time for discussions before implementing higher tariffs. The current tariffs on Chinese imports are significantly lower than those proposed earlier in the trade war, reflecting ongoing efforts to stabilize trade relations between the two countries.",
  "argos_id": "D99J8GASB"
}