{
  "url": "https://www.howtogeek.com/excel-has-a-new-way-of-explaining-formulas-to-you/",
  "authorsByline": "Arol Wright",
  "articleId": "9042ab72f81a4a33ba9dbf8ea876aa62",
  "source": {
    "domain": "howtogeek.com",
    "location": {
      "country": "us",
      "state": "VA",
      "county": "Fairfax County",
      "city": "McNair",
      "coordinates": {
        "lat": 38.9695316,
        "lon": -77.3859479
      }
    }
  },
  "imageUrl": "https://static1.howtogeekimages.com/wordpress/wp-content/uploads/2025/06/illust-2.PNG",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T23:03:43+00:00",
  "addDate": "2025-08-11T23:12:55.462322+00:00",
  "refreshDate": "2025-08-11T23:12:55.462323+00:00",
  "score": 1.0,
  "title": "Excel Has a New Way of Explaining Formulas To You",
  "description": "It just got a lot easier.",
  "content": "A lot of AI features are pretty unnecessary and sometimes invasive. But many can actually be genuinely useful. Many of Copilot's features are regarded by many as gimmicks, but one of the most useful ones just got a lot easier to access.\n\nExcel is rolling out a brand-new (or kind of new) feature called Explain Formula. This new feature embeds an AI-powered explanation tool directly into the Excel grid, which is always accessible via a right click. Previously, if you encountered a complicated or unfamiliar formula, you would need to either manually dissect it, consult external documentation, or use a separate help pane. Or, God forbid, Google it. The \"Explain Formula\" feature makes this easier by providing a step-by-step breakdown of what a formula does, right next to the selected cell.\n\nThis is pretty useful because the contextual nature of the explanations. It doesn't just give you a regular explanation of what a formula is doing or how it's working. Copilot, which is of course the chatbot that's powering this, analyzes the specific formula in its actual use case, referencing the cells and data ranges involved in the calculation. This way, you can see what the formula is doing using the data that's present in the sheet.\n\nWhen you select a cell containing a formula, all you need to do is right-click on the cell and choose the \"Explain this formula\" option. From there, a pop-up window will show up, analyzing the formula and giving you a rundown on what it's doing and how it's working. However, if the main Copilot chat pane is already open, the explanation will be rendered there instead to maintain a consistent user interface. For those who wish to explore the formula further or ask follow-up questions, an option to \"Chat with Copilot\" is available, which transitions the conversation to the more extensive side pane for a deeper dialogue.\n\nThis isn't exactly a new feature. By using the Copilot side pane, you could always ask it questions about the entire sheet, including explaining a formula if you wish to do so. This, however, makes it way easier, even if you don't frequently use said Copilot side panel—I personally always close it when I'm not using it, and if I need this feature, it's way easier to right click and select a button within a menu than opening the side panel up again and manually type out my request.\n\nIf you want to check this out, Microsoft says this is slowly rolling out to everyone, so keep an eye out for an update coming soon.",
  "medium": "Article",
  "links": [
    "https://techcommunity.microsoft.com/blog/excelblog/explain-formulas-with-copilot%E2%80%94now-on-the-grid/4424028"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Formulas",
      "weight": 0.110413745
    },
    {
      "name": "AI features",
      "weight": 0.09004026
    },
    {
      "name": "Copilot",
      "weight": 0.077326745
    },
    {
      "name": "the Copilot side pane",
      "weight": 0.064292826
    },
    {
      "name": "data ranges",
      "weight": 0.062218625
    },
    {
      "name": "said Copilot side panel",
      "weight": 0.05931542
    },
    {
      "name": "the specific formula",
      "weight": 0.058797516
    },
    {
      "name": "the main Copilot chat pane",
      "weight": 0.05874876
    },
    {
      "name": "Excel",
      "weight": 0.056493208
    },
    {
      "name": "Copilots features",
      "weight": 0.056317642
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Technology News",
      "score": 0.53271484375
    },
    {
      "name": "/Science/Computer Science/Machine Learning & Artificial Intelligence",
      "score": 0.49609375
    },
    {
      "name": "/Computers & Electronics/Programming/Other",
      "score": 0.481201171875
    },
    {
      "name": "/Reference/General Reference/How-To, DIY & Expert Content",
      "score": 0.4697265625
    },
    {
      "name": "/Computers & Electronics/Software/Business & Productivity Software",
      "score": 0.393310546875
    }
  ],
  "sentiment": {
    "positive": 0.13592945,
    "negative": 0.33129364,
    "neutral": 0.5327769
  },
  "summary": "Excel is launching a new feature called Explain Formula, which embeds an AI-powered explanation tool directly into the Excel grid. This feature provides a step-by-step breakdown of what a formula does and how it's working. If the main Copilot chat pane is already open, the explanation will be rendered there to maintain a consistent user interface. For those who wish to explore the formula further or ask follow-up questions, an option to \"amicually\" is available. The new feature is slowly being rolled out to all users, with an update expected soon.",
  "shortSummary": "Excel is launching an AI-powered \"Explain Formula\" feature, allowing users to quickly and effectively explain complex formulas using contextual information.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "2460c9e248084ffc818c3ff3667cc9f4",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://techcommunity.microsoft.com/blog/excelblog/explain-formulas-with-copilot%E2%80%94now-on-the-grid/4424028",
      "text": "Understanding complex formulas in Excel just got a lot easier. The new Explain Formula feature turns Copilot into your inline assistant, delivering clear, step-by-step breakdowns directly on the grid, right next to your data, no need to switch context or open the chat pane.\nWhat makes this especially powerful is that the explanations are contextual, grounded in your actual data and workbook, not generic descriptions.\nBy bringing the explanation to where you’re working, Copilot helps you stay in flow. It’s a seamless, in-the-moment experience that makes it easy to scan, understand, and act on formulas right where you need it most.\nHow It Works\nHere’s how to get an explanation in just a few clicks:\n- Select a cell with a valid formula\n- A Copilot icon appears next to the cell\n- Click “Explain this formula” from the dropdown\n- Copilot shows a step-by-step explanation directly on the grid\n- Need to dive deeper? Click “Chat with Copilot” to continue the conversation in the side pane\nNote: If the Copilot chat pane is already open, the explanation will be displayed there instead of on the grid.\nWhat It Does: Contextual Formula Explanations\nWhen you select a formula cell, Copilot can now explain what that formula does using a dedicated card shown in the grid. Helping you quickly understand what the formula does based on your actual data and context, not just a generic description.\nThis makes it easy to:\n✅ Understand the formula’s goal in your workbook\n✅ Learn how it works, function by function\n✅ Build confidence without ever leaving your sheet\nFor example, given this formula:\n=I4 * XLOOKUP(H4, $L$4:$L$7, $M$4:$M$7)\nWith just a click, Copilot will explain that:\nBecause the explanation is tailored to your actual data and scenario, it’s faster to grasp, easier to verify, and more relevant to your work. Copilot provides the clarity you need right where you need it.\nCopilot Can Explain Any Excel formula\nNo matter how simple or complex, Copilot can explain any Excel formula. Whether you're working with math, logic, references, arrays, or text manipulation, Copilot helps you understand what’s going on and why.\nAvailability\nThis feature is gradually rolling out to Excel for Windows and Excel for the web.\nFeedback\nWe’d love to hear how this new experience is working for you.\nLet us know:\n✔️ Was the explanation clear and easy to understand?\n✔️ Was it easy to access the explanation when you needed it?\n✔️ Did the overall experience feel intuitive and helpful?\nJust click the 👍 or 👎 at the bottom of the Copilot response to share your thoughts.\nYour feedback helps us refine the experience and prioritize what’s next."
    }
  ],
  "argos_summary": "Microsoft Excel has introduced a new feature called 'Explain Formula' that allows users to receive AI-powered, contextual explanations of formulas directly within the Excel grid. By right-clicking on a cell containing a formula, users can access a step-by-step breakdown of the formula's function, tailored to the specific data in their workbook. This feature aims to enhance user understanding and streamline the process of working with complex formulas, making it easier to learn and verify their functionality without needing to switch to a separate help pane.",
  "argos_id": "E410RW0X7"
}