{
  "url": "https://www.howtogeek.com/this-linux-workstation-laptop-has-an-rtx-5090-inside/",
  "authorsByline": "Jordan Gloor",
  "articleId": "eda85e4c236641be9d7a364dc562e9f0",
  "source": {
    "domain": "howtogeek.com",
    "location": {
      "country": "us",
      "state": "VA",
      "county": "Fairfax County",
      "city": "McNair",
      "coordinates": {
        "lat": 38.9695316,
        "lon": -77.3859479
      }
    }
  },
  "imageUrl": "https://static1.howtogeekimages.com/wordpress/wp-content/uploads/2025/08/the-kubuntu-focus-zr-gen-1-laptop.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T21:33:17+00:00",
  "addDate": "2025-08-11T22:22:08.426781+00:00",
  "refreshDate": "2025-08-11T22:22:08.426785+00:00",
  "score": 1.0,
  "title": "This Linux Workstation Laptop Has an RTX 5090 Inside",
  "description": "You also get Wi-Fi 7 and up to 192GB of RAM on this Kubuntu-powered laptop.",
  "content": "Kubuntu Focus, the manufacturer that makes Kubuntu Linux-only PCs, has announced a new workstation-level laptop, the Focus Zr Gen 1. The heavy-duty laptop is meant to be a desktop replacement with its dedicated GPU options.\n\nYou can now configure your order for the first Focus Zr laptop with its 18-inch WQXGA LCD panel that supports 2560x1600 resolution and Nvidia's G-Sync. In terms of processing power, the Kubuntu-powered laptop contains an Intel Ultra 9 275HX with 24 cores and a maximum clock speed of 5.4GHz. You get to choose the Nvidia Geforce RTX 5080 that comes with 16GB of video RAM, or an additional $800 you can upgrade to the 5090 and its whopping 24GB VRAM total.\n\nIn terms of storage and memory, the base configuration includes a 1TB internal SSD that uses the PCIe 5.0 standard. There are slots for three more storage disks, and you can configure the RAM from 32GB all the way up to 192GB of DDR5 memory. This isn't meant for your everyday LibreOffice-and-Firefox workloads.\n\nConnectivity-wise, you get the latest Wi-Fi 7 support and dual 2.5-gigabit Ethernet ports. It connects to other devices via Bluetooth 5.4, HDMI 2.1, and two Thunderbolt 5 USB Type-C ports. There's also a microSD card reader, two Gen 3.2 USB-A ports, and a good ol' 3.5mm audio jack with mic support.\n\nThe Focus Zr is a new product line for Kubuntu Focus. Until now, the Focus M2 Gen 6 was its most powerful offering. For those who don't want a laptop at all, the Focus Nx Gen 3 mini PC was just announced last month. I'm writing this article on a Focus Ir14, the smallest and most affordable laptop in the lineup. I wrote recently that I'm a year in with the Ir14 and pretty satisfied with the purchase. The Focus Zr though packs a punch much bigger than what I typically need, to be frank.\n\nThe announcement of the Focus Zr comes at a time when Windows laptop owners face a crossroads, with the final free update for Windows 10 is just a few short months away. On top of that, Windows has become even more bloated than before with Microsoft's Copilot push. Switching your computer's OS to Linux is possible, but that takes technical knowledge and confidence many don't have. A simpler option is to simply buy a computer with Linux pre-installed, like the Focus Zr.\n\nHead to the Focus Zr Gen 1 order page if you want to start configuring. Be prepared to open that wallet, though; its base configuration will run you just over four grand. Thankfully, shipping is free within the continental US and Canada, though the order page notes that the current tariff debacle introduces some cost uncertainty for Canadian customers.",
  "medium": "Article",
  "links": [
    "https://www.howtogeek.com/cant-upgrade-to-windows-11-2025-options/",
    "https://www.howtogeek.com/693588/how-to-install-linux/",
    "https://www.howtogeek.com/the-new-kubuntu-focus-m2-laptop-has-linux-and-an-rtx-5070-ti/",
    "https://www.howtogeek.com/782023/what-is-wi-fi-7/",
    "https://www.howtogeek.com/one-year-in-with-my-kubuntu-laptop-heres-what-i-learned/",
    "http://www.howtogeek.com/what-is-kubuntu-linux/",
    "https://kfocus.org/order/",
    "https://www.howtogeek.com/this-core-ultra-tiny-pc-is-built-for-kubuntu-linux/",
    "https://www.einpresswire.com/article/837806263/kubuntu-focus-announces-the-new-zr-gen-1-model"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Focus Zr",
      "weight": 0.10045065
    },
    {
      "name": "Kubuntu Focus",
      "weight": 0.09106485
    },
    {
      "name": "Windows laptop owners",
      "weight": 0.08868906
    },
    {
      "name": "the first Focus Zr laptop",
      "weight": 0.0696583
    },
    {
      "name": "the Focus Zr Gen",
      "weight": 0.063490085
    },
    {
      "name": "Linux",
      "weight": 0.060262177
    },
    {
      "name": "video RAM",
      "weight": 0.055594526
    },
    {
      "name": "the Focus M2 Gen",
      "weight": 0.055313397
    },
    {
      "name": "the Focus Zr Gen 1 order page",
      "weight": 0.05481788
    },
    {
      "name": "Windows",
      "weight": 0.05443053
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Technology News",
      "score": 0.771484375
    },
    {
      "name": "/Shopping/Consumer Resources/Product Reviews & Price Comparisons",
      "score": 0.625
    },
    {
      "name": "/Computers & Electronics/Software/Operating Systems",
      "score": 0.44287109375
    }
  ],
  "sentiment": {
    "positive": 0.49723336,
    "negative": 0.06716191,
    "neutral": 0.4356047
  },
  "summary": "Kubuntu Focus, the manufacturer that produces Kubuntu Linux-only PCs, has launched a new workstation-level laptop, the Focus Zr Gen 1. The laptop is designed to be a desktop replacement with its dedicated GPU options. It features an 18-inch WQXGA LCD panel with 2560x1600 resolution and Nvidia's G-Sync. The base configuration includes a 1TB internal SSD and a maximum clock speed of 5.4GHz. The price starts at four grand, with shipping free within the continental US and Canada. The announcement comes at a time when Windows laptop owners face a significant transition, with the final free update for Windows 10 expected soon.",
  "shortSummary": "Kubuntu Focus's new workstation-level laptop, the Focus Zr Gen 1, features dual graphics, dual-screened, and extensive storage, including a 1TB SSD.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "b36cb19d53f94d949c4b61acc3ebb59b",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.howtogeek.com/cant-upgrade-to-windows-11-2025-options/",
      "text": "Quick Links\nMicrosoft will stop supporting Windows 10 on October 14, 2025. This means the operating system will no longer receive updates, even for security. Windows 11 has strict hardware requirements, so you may find you can't upgrade to it. If that's the case, here are your options.\n1 Upgrade Your Hardware or Buy a New Computer\nIf your computer doesn't meet Windows 11's hardware requirements, you can use Microsoft’s PC Health Check tool to determine what parts need upgrading.\nTo use it, open the Start menu, search for PC Health Check, and select it from the results. Once it opens, click \"Check now.\"\nSince the processor isn't supported in the example above, the user will need to upgrade to an 8th-generation Intel processor or newer to meet Windows 11's minimum system requirements.\nIf you make hardware changes, you can use PC Health Check to see the updated eligibility status. Once you've upgraded your hardware to meet the requirements for running Windows 11, you can go install it as normal.\nUpgrading doesn’t have to be expensive. Memory and SSD upgrades are relatively affordable and can often be installed without professional help.\nThat said, if this sounds too daunting, or you just don’t have the time, you may just want to start fresh with a new machine, one that is Windows 11-ready. Many budget-friendly options will meet your needs and then some. Refurbished computers are also worth considering—they’re often cheaper and come with reliable warranties.\n2 Pay for Extended Support\nIf you want to stay on Windows 10 for a while longer, Microsoft’s Extended Security Update (ESU) program offers a lifeline. It’s a way to keep Windows 10 secure—for a price. For home users, you can pay $30 for security updates until 2026.\nESUs typically provide critical patches for vulnerabilities, ensuring that your machine remains safe from emerging threats even after general support ends.\nThis option might make sense for if you can’t upgrade to Windows 11, but still rely on your PC for sensitive tasks.\n3 Force the Upgrade\nTechnically, you can install Windows 11 on an unsupported machine. However, this is risky, and Microsoft does not recommend it. There’s no safety net if something breaks. Unsupported upgrades may lead to bugs, crashes, and a lack of critical updates—proceed at your own peril.\nMake sure to back up your data before experimenting with this.\n4 Embrace Linux as a Lightweight Alternative\nIf you think now is a good time to cut ties with Windows, Linux offers a refreshing change. Gone are the days of command line interfaces. Distributions like Ubuntu and Linux Mint provide sleek, user-friendly interfaces that are easy to use. There are plenty of Linux resources to help you get up and running.\nBut why Linux? One of the reasons why I like Linux is that you don't need a powerful computer to make it run smoothly. Many Linux distros can run smoothly on older machines (Linux Mint, in particular, is well-known for this, but there are more), which can make it a great alternative to Windows 11. Plus, since Linux is open-source, it's free for the everyday user and there are no licenses you have to worry about.\nLinux is generally considered more secure than Windows, as its architecture naturally fends off malware. For example, since Linux is open-source, its source code is publicly available, which allows security experts worldwide to review and improve the codebase. Linux security updates also rarely require system reboots, encouraging more users to apply security patches more promptly. No operating system is perfect though, so proper configuration and user behavior are essential.\n5 Repurpose Your PC for New Adventures\nIf you aren’t ready to give up on Windows just yet, why not repurpose your machine? There are multiple creative ways you can repurpose your device, which can be pretty fun. And it feels good to make something useful again.\nOne option is to set up a home theater with Kodi. Kodi is a free, powerful media center that can convert your old device into a home theater setup. It can upscale standard definition videos to 1080p, and you can stream all your favorite movies, shows, and music from one center. It also has the capability for live-streaming and recording, viewing picture slideshows, and you can stream content across devices on the same network.\nAs another option, consider turning your old PC into a retro gaming machine. Retro games can be very nostalgic and have some pros compared to modern games. I recommend RetroArch, a powerful free and open-source emulation platform. It can run on older PCs thanks to relatively low system requirements, and you get to relive classic games from your childhood.\nIf turning your old PC into an entertainment center isn’t right for you, consider donating it. Not only does donating help reduce e-waste, keeping it out of landfills, but your donation can provide access to technology for individuals and charities that need it. You can even donate them as parts which can be reused in refurbished machines.\n6 Ignore the Deadline (At Your Peril)\nThe appeal to stick with Windows 10 may be strong. After all, if it isn’t broken, why fix it? However, this approach comes with significant risks, and I don't recommend it. Without updates, your system’s defenses against cyberattacks crumble. Malware and ransomware exploit unpatched systems, turning your PC into a ticking time bomb.\nIf you choose this path, upgrade your defenses. Use strict security measures, limit online activity to secure websites, and avoid using the PC for sensitive tasks like online banking. A well-maintained system can survive, but the security risks from lack of security updates may not make it worth it.\nSo, there you have it—the end of Windows 10 support is coming, and it's time to consider your options. Whether you're upgrading hardware, diving into the Linux world, or turning your old PC into a retro gaming paradise, there’s a path forward. Microsoft might be nudging you toward their shiny new stuff, but a little change can be a good thing."
    },
    {
      "url": "https://www.howtogeek.com/782023/what-is-wi-fi-7/",
      "text": "Quick Links\nSummary\n- The Wi-Fi 7 specficaition offers speeds up to 46 Gbps, almost five times faster than Wi-Fi 6, with EHT technology.\n- Wi-Fi 7 utilizes the 6 GHz band for less interference, lower latency for cloud computing, and load balancing for overall improved performance.\n- Purchasing a Wi-Fi 7-enabled router will get you faster speeds, but an upgrade will likely only be worth it if your router is older than Wi-Fi 6.\nWhile some developments in some tech might seem to have slowed down in recent years, wireless connectivity is still seeing improvements by leaps and bounds. Wi-Fi 7 is here, sporting transfer speeds that might make Ethernet cables obsolete. Let's take a look at the proposed spec and what it promises.\nWhat Is Wi-Fi 7? How Fast Is It?\nWi-Fi 7 is a specification for Wi-Fi devices that officially debuted in January 2024, and it builds on the previous official specification Wi-Fi 6E. It's based on the draft 802.11be standard, published in May 2021.\nThe most show-stopping feature of Wi-Fi 7 is that it might make wired Ethernet connections obsolete for a certain class of both home users and professionals—the first live demonstration of the standard in early 2022 showcased some mind-blowing speeds.\nWi-Fi 7 can theoretically support bandwidth up to 46 gigabits per second (Gbps) per access point, which is just shy of five times as fast as the maximum 9.6 Gbps speed of Wi-Fi 6 (also known as 802.11ax). The draft authors call this \"Extremely High Throughput,\" or EHT.\nCurrently, commonly-available wired Ethernet technology maxes out at 10 Gbps (10GBASE-T), although it's basically non-existent in consumer devices at the moment. And although higher speeds (such as Terabit Ethernet) exist in specialist settings like data centers, its arrival in the home or small business setting—if it ever happens—is likely far off.\nSo for current users of both Gigabit and 10 Gigabit Ethernet, Wi-Fi 7 might be able to replace the need for wired connections under optimal conditions—though purists and power users will likely continue to use hard-wired connections for the foreseeable future.\nWhat Else Is Cool About Wi-Fi 7?\nAside from the theoretical potential of blazingly fast speeds of Wi-Fi 7, the Wi-Fi Alliance plans to include other notable improvements in the Wi-Fi standard.\nFull Utilization of the 6 GHz Band\nFull utilization of the new \"6 GHz Band\" (actually 5.925–7.125 GHz), was first supported in Wi-Fi 6E. The 6GHz band is currently only occupied by Wi-Fi applications (although that might change), and using it results in dramatically less interference than the 2.4 GHz or 5 GHz bands.\nEven Lower Latency\nThe Wi-Fi 7 spec aims at \"lower lateness and higher reliabilities\" for time-sensitive networking (TSN), which is essential for cloud computing (and cloud gaming). It's also a critical requirement for replacing wired Ethernet connections.\nWhile Wi-Fi 6 already offers significant improvements over Wi-Fi 5 in the latency department, the goal of Wi-Fi 7 is to provide consistent single-digit millisecond latency for all devices across the entire network—and not just for the devices in the optimal coverage area.\nLoad Balancing with Multi-Link Operation\nWi-Fi 7 offers Multi-Link Operation (MLO) with load balancing and aggregation that combines multiple channels on different frequencies to deliver better performance.\nThis means a Wi-Fi 7 router can utilize all bands and channels available dynamically to speed up connections or avoid bands with high interference. This improvement, along with the others listed here, is how Wi-Fi 7 can hit a theoretical maximum throughput three times higher than Wi-Fi 6.\nUpgrades to 802.11ax\nAccording to its specifications, Wi-Fi 7 offers direct enhancements of Wi-Fi 6 technologies, such as 320 MHz channel width (up from 160 MHz in Wi-Fi 6), which allows faster connections, and 4096 quadrature amplitude modulation (QAM) technology that allows more data crammed into each hertz.\nYour Wi-Fi 7 Questions Answered\nTalking about specs is fun, but for day-to-day use people have much more concrete questions. Let's take a look at the most frequent questions we get about Wi-Fi 7.\nIs It Backwards Compatible?\nThe Wi-Fi 7 spec spells out backward compatibility with legacy devices in the 2.4 GHz, 5 GHz, and 6 GHz bands, which means you don't need all-new devices or hardware to connect to a Wi-Fi 7-enabled router.\nJust like your Wi-Fi 5 devices work on a Wi-Fi 6 network (and, conversely, your Wi-Fi 6 devices work on a Wi-Fi 5 network), the Wi-Fi 7 standard continues the tradition of cross-generation compatibility. Naturally, however, you won't get all the benefits of Wi-Fi 7 unless you're using a Wi-Fi 7 device with your Wi-Fi 7 router.\nIs It Significantly Better Than Wi-Fi 6 and 6E?\nOn paper and in laboratory tests with compatible gear, yes, Wi-Fi 7 is significantly better than previous Wi-Fi standards.\nHowever, like with all previous Wi-Fi generations, you won't see the full benefit of Wi-Fi 7 until you pair it with Wi-Fi 7 hardware. That said, the Wi-Fi 6 optimizations we mentioned in the previous section will help Wi-Fi 7 routers provide an even better experience to Wi-Fi 6 devices on your network.\nIs Wi-Fi 7 More Secure?\nGiven the number of facts and figures you have to take in to compare Wi-Fi generations to each other (as well as the seemingly limitless number of routers out there) it's easy to get confused about security standards.\nThe Wi-Fi standard is separate from the security standard, Wireless Protected Acess (WPA) used by modern Wi-Fi hardware. Wi-Fi 5 supports WPA2, Wi-Fi 6 and 6E support WPA3, and Wi-Fi 7 ships with WPA3 support. (In theory, a WPA4 is on the distant horizon but as of now you'll find little more than a passing reference in the form of \"WPA4 (TBD)\" sprinkled here or there in technical documents.)\nIn short, when you purchase a new Wi-Fi 7 router it will have the most current Wi-Fi security available and will be as secure (or more secure) than your current router depending on the age of the replaced router model.\nDo I Need a Wi-Fi 7 Router?\nIf you're rocking an ancient Wi-Fi router, especially one struggling to meet your household's growing demands, you'd likely be well served to snap up a Wi-Fi 7 router.\nIf you recently bought a nice Wi-Fi 6 or Wi-Fi 6E router, however, there's no rush. While there are clear benefits to the Wi-Fi 7 standard even if you're a cutting-edge sort of user that adopts new technology as soon as it comes out, it'll be a while until you see tangible benefits from switching your home over to Wi-Fi 7 if you're already on Wi-Fi 6 or better.\nChasing performance benchmarks is fun, but in real-world applications, you only need so much bandwidth to watch YouTube videos on your phone or sit on a Zoom call at work.\nSo if you have a dusty old mid-tier router you bought off the shelf at Best Buy five or more years ago, consider upgrading. But if you're already rocking a current and premium setup, feel free to sit it out for a spell and wait for the Wi-Fi 7 prices to drop (and more end devices to support it).\nHow Does Wi-Fi 7 Compare to Wi-Fi 5, Wi-Fi 6, and Ethernet?\nWe've touched upon this in previous sections, but when it comes right down to it what most people care about is: how much better is the next generation of Wi-Fi compared to what I have right now? Not only is that a perfectly fair question but it's really the only question you should care about in the end, because upgrading with no benefit is a waste of money.\nWi-Fi 7 Compared to Wi-Fi 5 (What You're Probably Using)\nIf your router is reasonably new, it probably supports Wi-Fi 5, technically known as 802.11ac. Assuming your device is also Wi-Fi 5-enabled, you can expect to get a maximum transfer speed of 3.5 Gbps.\nHowever, that's the theoretical maximum speed for optimal conditions only. You probably won't actually achieve that speed. It's influenced and brought down by factors like your internet plan, your Wi-Fi router's location and surroundings, your device's location (as well as what Wi-Fi generation your device supports), and interference coming from nearby networks.\nWi-Fi 7 under optimal conditions rockets past 5 with a maximum speed of 46 Gbps—a more than 750% increase. Not only that, but it's also capable of utilizing bands that Wi-Fi 5 can't access. That wider spectrum gives your router more elbow room, so to speak. Nearby networks won't have to compete so rabidly for the same channels, allowing for reduced interference.\nOf course, it's unlikely you'll jump directly from Wi-Fi 5 to 7 unless you seriously procrastinate about upgrading your equipment. You'll probably switch to using Wi-Fi 6 or 6E before a Wi-Fi 7-enabled device ever gets in your hands.\nWi-Fi 7 vs. Wi-Fi 6 and 6E\nIf you're on the bleeding edge of wireless technology, you're probably using Wi-Fi 6, or less commonly, Wi-Fi 6E. If you were to upgrade to Wi-Fi 7's draft specs right now, the improvement in speed capabilities wouldn't be quite as dramatic as switching from Wi-Fi 5, but still impressive. Wi-Fi 6 and 6E, under optimal conditions, can achieve speeds of up to 9.6 Gbps, only a third of Wi-Fi 7's capability.\nWi-Fi 6E has access to the same 6 GHz band that Wi-Fi 7 does, avoiding the congestion problems of the 2.5 GHz and 5 GHz bands. What 6E doesn't have, though, is the Multi-Link Operation (MLO) we discussed above, which further enhances Wi-Fi 7's ability to avoid interference.\nThat means Wi-Fi 7 handles the same channels that 6E does, but more effectively. Other advantages over Wi-Fi 6 and 6E include higher quadrature amplitude modulation (QAM) and broader channel bandwidth.\nWi-Fi 7 vs. Ethernet\nRight now, a wired internet connection is almost always faster and more reliable than your home Wi-Fi connection. Some have speculated, though, that a Wi-Fi 7 connection will be better than wired. This is potentially true only if you're talking about Ethernet cables graded below Cat-8, which is a category of Ethernet cable that can be rated for speeds of up to 40Gbps. That said, Cat-8 is intended for data centers, not your home network. The cable that came with your router is most likely a Cat-5 or Cat-6 cable, rated no higher than 10Gbps.\nAs always, these comparisons are only valid if your network is set up in optimal conditions, which is difficult to achieve. Wi-Fi 7 does bring meaningful improvements to the battle against interference and latency, though, and, of course, Ethernet cables themselves are subject to slow-downs and issues. In fact, when we first tested a Wi-Fi 7 system, the Netgear Orbi 970 system, we found the speeds were quite comparable to our wired speeds.\nAll that said, there will always be people who prefer to use Ethernet and, as we've pointed out before, the surest way to remove congestion from your home network is to stop using Wi-Fi (and lean on Ethernet to do the heavy lifting).\nHow Do I Start Using Wi-Fi 7?\nWith all this information in hand, there's the final million-dollar question. How can I jump on board with the speedy future of wireless networking?\nFirst, you'll need a Wi-Fi 7-enabled router. Believe it or not, they've been around for a while now. TP-Link announced a line of Wi-Fi 7 routers in late 2022, and a few months later ASUS announced two premium Wi-Fi 7 routers at CES 2023. More are arriving on the scene regularly, including the Netgear Orbi 970 which we reviewed. To help you choose, we've also put together a list of the best Wi-Fi 7 routers available right now.\nTo actually get the most out of your Wi-Fi 7 router, though, you'll also need Wi-Fi 7-enabled computers and smartphones. Right now, there are a few laptops like the Acer Aspire Vero 16 that can take advantage of those speeds. As of mid-2024, only select premium smartphones like the Samsung Galaxy S24 Ultra support Wi-Fi 7 connectivity, so you'll be paying a pretty penny for those sweet, sweet next-gen specs.\nYou might notice the sizable price tag that comes with Wi-Fi 7 routers as well, so if you need to upgrade your network but aren't ready to commit to the bleeding edge, check out our overall top picks for routers on the market. You can also save a few bucks extra by considering our favorite budget routers. Whichever way you choose to go, it's clear these are exciting times for wireless networking."
    },
    {
      "url": "https://www.einpresswire.com/article/837806263/kubuntu-focus-announces-the-new-zr-gen-1-model",
      "text": "Kubuntu Focus Announces the New Zr GEN 1 Model\nThis new model includes the latest Intel and NVIDIA hardware.\nTRAVERSE CITY, MI, UNITED STATES, August 7, 2025 /EINPresswire.com/ -- The Kubuntu Focus Team announces the immediate availability of the 18.0\" Zr GEN 1 mobile workstation. This desktop replacement accommodates the performance-tuned RTX 5080 or RTX 5090 GPU, with the latest Intel Core Ultra 9 275HX CPU. The Focus team claims this system is the perfect mobile workstation for those who require the ultimate GPU and CPU performance in a laptop just over an inch thick.This new model provides the advanced capabilities that customers look for in powerful mobile workstations. Improvements from the prior 17.3” M2 GEN 5 model include:\n• Faster graphics with much more VRAM than the prior 40-series GPUs. Both the NVIDIA® GeForce® RTX 5080 and 5090 GPUs show around 20% performance improvements. The 5080 VRAM increases from 12 to 16GB, while the 5090 VRAM increases from 16 to 24 GB.\n• A larger, brighter, and taller 525-nit 18.0\" display. The WQXGA LCD features 2560×1600 resolution, G-Sync, and a 16:10 aspect ratio.\n• A primary disk with nearly double the disk performance, up to 14,800 MB/s over PCIe 5.0. Three additional PCIe 4.0 slots at 7450 MB/s allow for up to 16 TB of total storage.\n• Double the memory capacity, with up to 192 GB of quad-channel RAM.\n• Faster, cooler, and quieter CPU performance with the Intel Core Ultra 9 275HX. With 24 cores, it gains 5-15% performance yet is up to 40% more efficient.\nPorts include 2 x USB-C 3.2 with Thunderbolt 5 and DisplayPort (Power Delivery DC In on one port); 1 x HDMI 2.1b with DSC; 2 x USB-A 3.2; 2 x Intel Killer 2.5 Gigabit RJ-45 Ethernet; 1×2-in-1 Audio (headphone + microphone); 1 x Micro SD Push-Push Card Reader; 1×330 W DC Power-In; and Kensington Lock.\nThe base model now offers 32 GB of high-speed, dual-channel RAM and a 1 TB 990 Pro NVMe disk. Customers can increase these to a maximum of 192 GB of dual-channel RAM and 16 TB of disk with high-quality, brand-name components. A pre-configured Yubikey is available for additional security. Full-disk encryption is a no-cost option, and shipping is free in the US and Canada.\nAbout Kubuntu Focus\nKubuntu Focus was founded in 2019 to provide the best open, reliable, Linux-based alternative to proprietary computers. Its mission is to keep the privacy, freedom, and compatibility of Linux, while focused on providing the convenience, performance, and stability that users require.\n“... Kubuntu Focus isn’t just a system; it’s also quite a curation of tools and software and libraries for specific applications. What I like about this use-case approach is that it gives solid actual recommendations about how you can use the power of Linux and Open Source Software in the real world ...”\n- Video by InfinitelyGalactic about the Kubuntu Focus Project\nCompany Statements\n“We are enormously enthusiastic about the Zr GEN 1. I’ve found it to be a delightful daily driver, highly reliable, and extraordinarily fast for rendering, all kinds of development including ML, and compiling kernels. For me, it’s an incredibly powerful all-in-one desktop I can easily take on the road.\nWe’ve tested and optimized the kernel parameters, GPU driver settings, Focus tools, and other system configurations to meet hundreds of KPCs before this launch. We will continuously support and validate it on those same KPCs for all significant updates for a minimum of three years after the last sale. All our models receive this level of comprehensive support.”—Michael Mikowski, Technical Product Manager.\n“We ship an extremely well supported, official Ubuntu LTS flavor, and add HOWTOs specifically for the models we support. We avoid changing the core OS or desktop directly, instead working with KDE, Kubuntu, and Ubuntu to suggest and assist with feature changes. This results in greater expert scrutiny, ensures excellent compatibility with software and support documentation, and provides a better, more reliable product for everyone.”—Aaron Rainbolt, Lead Developer.\nAdditional Information\nQuestions? Please write sales@kfocus.org or call 844-536-2871.\nPress Images\nValidated Systems\nProduct Page\nKubuntu Focus is a contributor to the Kubuntu project and a KDE Corporate Patron.\nKubuntu Focus\nKubuntu Focus\n+1 844-536-2871\nemail us here\nLegal Disclaimer:\nEIN Presswire provides this news content \"as is\" without warranty of any kind. We do not accept any responsibility or liability for the accuracy, content, images, videos, licenses, completeness, legality, or reliability of the information contained in this article. If you have any complaints or copyright issues related to this article, kindly contact the author above."
    },
    {
      "url": "https://www.howtogeek.com/693588/how-to-install-linux/",
      "text": "Quick Links\nWant to install Linux? It's an easier process than you might think! You can even try Linux on your PC before you install it. If you don't like it, just reboot and you'll be back to Windows. Here's how to get started with Linux.\nChoose a Linux Distro and Download It\nFirst, you'll need to choose a Linux distribution you want to use. Linux distributions package up the Linux kernel and other software into a complete operating system you can use. Different Linux distributions have different system tools, desktop environments, included applications, and visual themes.\nUbuntu and Linux Mint are still some of the most popular Linux distributions. There are many, many other options—there's no wrong answer, although some Linux distributions are intended for more technical, experienced users. There are distros for programming and distros for gamers.\nOnce you've picked your Linux distribution of choice, visit its website and download its installer. You'll get an ISO file, which is a disc image file containing the Linux distribution's installation files.\nIf you have a particularly old system (manufactured over a decade ago), you may have to find a distribution that still supports 32-bit architectures. Most modern computers have 64-bit-capable CPUs, and many modern distributions have dropped support for 32-bit devices in response.\nCreate Bootable Installation Media\nTo boot, try, and install the Linux system you downloaded, you'll need to create bootable installation media from your ISO file.\nThere are several ways you can do this. If you have a writeable DVD and an optical drive, you can burn the ISO file to disc using the \"Burn disc image\" function in Windows. However, you'll probably want to use a USB drive instead—USB drives are faster than DVDs and will work on any computer with a USB port, no optical drive necessary.\nHere's what you'll need to create a bootable Linux USB drive on Windows:\n- The ISO file for your Linux distribution of choice.\n- The free Rufus software. Ubuntu's official instructions recommend Rufus, too.\n- A USB drive of at least 4 GB in size. Some Linux distributions may need larger drives if they have larger installers, but 4 GB should be fine for most Linux distributions, including Ubuntu.\nThe contents of the USB drive you use will be erased. Make sure you've backed up anything stored there that you care about.\nLaunch Rufus and insert your USB flash drive into your computer to get started. First, in the \"Device\" box, select your USB drive. Second, click the \"Select\" button and browse to the ISO file you downloaded. Third, click the \"Start\" button to create the USB drive.\nYou may see a few warnings. Accept the default options: Click \"Yes\" if you're prompted to download additional files, and click \"OK\" if you're prompted to write in ISO mode. Finally, you will be warned the Rufus will erase all files on your USB drive—ensure you've backed up any important files and click \"OK\" to continue.\nRufus will create your USB installer drive, and you'll see the progress bar at the bottom of the window fill up. When it's a full green bar reading \"Ready,\" you can click \"Close\" to finish the process.\nBoot Your Linux Installation Media\nIf you're booting the Linux system on the same computer you created installation media on, you don't even need to unplug your USB drive. You'll just have to reboot your PC and boot it from the Linux installation media.\nTo do so, select the \"Restart\" option in Windows. Your PC may automatically boot from the inserted USB drive and into Linux.\nIf your computer just boots back into Windows, you may have to press a certain key to access a boot device menu and select it during the installation process. Common keys you may have to press during the boot process include F12, Escape, F2, and F10. You may see this key displayed on screen during the boot process.\nYou may also have to access your BIOS or UEFI firmware settings screen and change the boot order. The exact process will depend on your model of PC. Check your PC's instructions for more information. (If you built your own PC, check the motherboard's instruction manual.)\nWhat About Secure Boot?\nModern PCs with UEFI firmware—generally, PCs that came with Windows 8 and later—have a feature called Secure Boot. They're designed not to boot unapproved operating systems, which should help protect you from rootkits and other malware.\nSome Linux distributions, like Ubuntu, are designed to work with Secure Boot and use a special Microsoft-signed bootloader, letting them run on your system. Other Linux distributions may require you to disable Secure Boot before they can boot.\nHowever, in many situations, your Linux distribution should just boot normally. If Linux boots, don't worry about Secure Boot. If you see a Secure Boot error message and Linux doesn't boot, check your Linux distribution's documentation for more information—and consider disabling Secure Boot on your PC.\nTry Linux\nWith Linux booted, you'll get a \"live\" Linux desktop you can use just as if Linux was installed on your PC. It isn't actually installed yet and hasn't modified your PC in any way. It's running entirely off the USB drive you created (or the disc you burned.)\nFor example, on Ubuntu, click \"Try Ubuntu\" instead of \"Install Ubuntu\" to try it out.\nYou can explore the Linux system and use it. Bear in mind that it will likely perform more quickly once it's installed to your PC's internal storage. If you just want to play with Linux for a bit and don't want to install it yet, that's fine—just reboot your PC and remove the USB drive to boot back into Windows.\nIf you'd like to try out multiple Linux distributions, you can repeat this process and try a bunch of them before choosing to install one.\n(Not all Linux distributions offer a live environment you can play with before you install them, but the vast majority do.)\nWarning: Back Up Before Continuing\nBefore you actually go through with installing Linux, we recommend backing up your important files. You should always have recent backups, especially when you're messing with your system like this.\nIt should be possible to install Linux in a dual-boot scenario and have the Linux installer seamlessly resize your Windows partition without affecting your files. However, mistakes can happen when resizing partitions. And it would be possible to accidentally click the wrong option and wipe your Windows partition.\nSo, before continuing, we encourage you to back up all your important data—just in case.\nInstall Linux\nIf you're happy with your Linux distribution and it works well on your PC, you can choose to install it. The Linux distribution will be installed on an internal system drive, just like Windows.\nThere are two ways to do this: You could install Linux in a \"dual-boot\" configuration, where it sits alongside your Windows operating system on your hard drive and lets you choose which operating system you want to run each time. However, we generally don't recommend dual-booting, especially for newcomers, as it's easy for technical issues to crop up. Alternatively, you can install Linux over Windows, removing the Windows operating system and replacing it with Linux. If you have two hard drives, you can even install Linux on one of the hard drives and use either in a safer dual-boot scenario. This would be ideal for giving yourself the option of which to use.\nIf you know you really don't want to use Windows and you want to reclaim some hard disk space, however, go ahead and remove Windows. Just bear in mind that you'll lose all your installed applications and any files you haven't backed up.\nTo perform the installation process, run the installer from the live Linux system. It should be easy to find—it's generally an icon placed on the default live desktop.\nThe installation wizard will guide you through the process. Go through the installer and choose the options you want to use. Read the options carefully to ensure you're installing Linux in the way you want to. In particular, you should careful not to erase your Windows system (unless you want to) or install Linux onto the wrong drive.\nWhen the installation process is done, you'll be asked to reboot your PC. Reboot and remove the USB drive or DVD you installed Linux from. Your computer will boot Linux instead of Windows—or, if you chose to install Linux in a dual-boot scenario, you'll see a menu that will let you choose between Linux and Windows every time you boot.\nIf you want to reinstall Windows later, you can always download Windows installation media from Microsoft and use it to reinstall Windows. Alternatively, you can buy a dedicated laptop for running Linux. We've reviewed multiple Linux laptops, including the Kubuntu Focus Ir16 and the System76 Gazelle (gaze18) laptop, and found them worth considering."
    },
    {
      "url": "https://www.howtogeek.com/this-core-ultra-tiny-pc-is-built-for-kubuntu-linux/",
      "text": "Kubuntu Focus, the company selling PCs built specifically for desktop Linux, has just released the NX Gen 3 PC. It’s a small desktop computer powered by Intel’s latest Core Ultra 7 hardware and Kubuntu Linux.\nThis PC is an updated version of the company’s Focus NX computer, which somewhat resembles an Apple Mac Mini or ASUS NUC PC. It’s a compact desktop measuring 4.6 x 4.4 x 15 inches (117 x 112 x 37 mm), with a metal body, plastic top, and the same heat sink design as Intel’s Cyber Canyon NUC computers.\nThe main upgrade here is the processor, which is now available in two options: an Intel Core Ultra 7 255H or an Intel Core Ultra 5 225H. Both CPUs are 15th-generation models with a 40W TDP, but the Ultra 7 has more cores/threads, better integrated graphics, and slightly faster clock speeds. Kubuntu Focus also uses dual-channel RAM for the best possible performance.\nThe rest of the hardware is impressive, too. You get two Thunderbolt 4 ports, several USB Type-A and USB Type-C connections, HDMI, Wi-Fi 7, 2.5G Ethernet LAN, Bluetooth 5.4, and two M.2 slots for drives. You can open the PC with one standard Phillips screw to replace or upgrade components—a far cry from Apple’s non-upgradable Mac Mini. You can connect up to four 4K monitors at one time, using the two DisplayPort 2.1 outputs over USB-C and two HDMI 2.1 ports simultaneously.\nAs with all the company’s computers, this ships with Kubuntu 24.04 LTS out of the box, paired with a few utilities for controlling the system and learning how to use desktop Linux. Any other modern Linux distribution should work just as well, though. Windows is not an officially-supported operating system, but it should work after hunting down any missing drivers. If you occasionally need to dual-boot Windows, it might be a good idea to use one of the M.2 drive slots just for a Windows SSD, and keep your regular Linux installation on the base drive.\nKubuntu Focus said in a press release, “Like prior generations, the third-generation NX is rated for constant operation and includes cable-routing and VESA-monitor-mount brackets. Every system is built to order, with the customer’s selection of CPU, RAM, disks, optional encryption, YubiKey, and warranty. Ground shipping is free within the continental US and Canada.”\nYou can buy the Kubuntu Focus NX Gen 3 today from the company’s online store, with a starting price of $895. That’s definitely more expensive than most Mac Mini configurations or NUC desktops, but you’re getting the best Linux support possible and high-end hardware.\nKubuntu Focus NX GEN 3\n- Brand\n- Kubuntu\n- Case\n- 4.6 inches\n- Operating System\n- Kubuntu 24.04 LTS\nLike all Kubuntu Focus Systems, the NX GEN 3 can save you time and hassle every day. It requires very little setup, is self-explanatory, and works well in no- and low-I.T. environments. It features validated updates for years after your purchase.\nSource: Kubuntu Focus"
    },
    {
      "url": "http://www.howtogeek.com/what-is-kubuntu-linux/",
      "text": "Ubuntu may get the limelight a lot in Linux circles, but it has several cousins. One of them is Kubuntu Linux, and it has some unique qualities that might lead you to make it your primary operating system.\nIf you have trouble keeping up with the names of all the different Linux distributions out there, you're forgiven. They number in the thousands, and sometimes, their differences seem only slight. Their names can be confusing too, like Kubuntu, which is distinct from Lubuntu and Xubuntu. In my experience, these distros have a lot more than just one letter's worth of differences, though. So let's explore what sets Kubuntu apart and who should use it.\nWhat Is Kubuntu?\n|\nYear of First Release |\n2005 |\n|---|---|\n|\nMinimum System Requirements |\n25GB storage, 4GB RAM, 2GHz dual-core processor (64-bit) |\n|\nSupported Desktop Environment(s) |\nKDE Plasma |\nKubuntu is a free and open source operating system for desktop PCs and laptops that's based on GNU/Linux. It's related to the better-known Ubuntu operating system. In fact, Kubuntu is essentially Ubuntu but with a different coat of paint. It has a different desktop experience and set of default applications, collectively known as KDE Plasma. That's where the \"K\" in Kubuntu's name comes from.\nAs a bit of background, Kubuntu was the first of many Ubuntu variants. It came about in the mid-aughts when Ubuntu developers recognized a need to provide multiple diverse user experiences instead of just one. Over the years, sponsorship of Kubuntu as a project shifted from Canonical to Blue Systems while still maintaining its original mission and continued collaboration with Canonical.\nWhile Ubuntu and Kubuntu both have the same core, Ubuntu's desktop edition (as opposed to the \"headless\" version used by server managers and tinkerers) comes with a desktop environment called GNOME. Speaking for myself and many others, not everyone likes the GNOME interface, even if they like the Ubuntu base. You, I'm sure, have your own opinions on the layout of your current PC's desktop, and maybe a wish list of changes for it. That's where Kubuntu comes in, offering a recognized and stable base but with an alternative interface.\nWhat Makes Kubuntu Different?\nKubuntu is for people who want a desktop computing experience that's reliable and \"just works,\" but that's also malleable enough to suit anyone's needs. Thanks to KDE Plasma, Kubuntu is powerful enough for power users without any major adjustments, but without the need (usually) to fool with config files. Kubuntu makes this possible by giving you a ton of settings menus and dialogs, to a point some people find annoying.\nThis is in contrast to regular Ubuntu, whose GNOME desktop comes with a far more minimalist settings manager. GNOME can be modified quite a bit, but not without installing additional software. Kubuntu also sets itself apart with its default configuration of Plasma which folks coming over from Windows 10 will find far more familiar than GNOME. More on that later.\nKeep in mind, though, that KDE Plasma's boons aren't limited to Kubuntu as a Linux distribution. Plasma is a very popular desktop environment, with many popular distros offering their own Plasma editions. For example, instead of Kubuntu you can grab the Plasma Fedora spin or Manjaro Plasma, if that floats your boat. They'll give you the essentially the same experience Kubuntu does but with a different base.\nIf you're not sure why you would want a different base, the most important thing to know is that Kubuntu's base, Ubuntu, is slower than others to get updates. Ubuntu prioritizes stability, so non-security updates get held back and tested rigorously before being passed to you. That means if you put two computers with Kubuntu and a more bleeding-edge distro like Plasma Fedora next to each other, they'd look and feel mostly the same. Except, you'd find some small desktop redesigns and gadgetry on the Fedora computer that are missing from the Kubuntu one.\nInstalling Kubuntu\nTo install Kubuntu, you'll first get an ISO image file from the Kubuntu download page. At the time of writing, you can choose between Kubuntu 22.04 and Kubuntu 24.04, which are both LTS (Long-Term Support) releases, or Kubuntu 24.10. If you're not sure which to pick, I would choose the newest LTS release, which in this case is version 24.04. You can always come back for another version if that one doesn't work for you.\nOnce you have the ISO file, you can either make a bootable thumb drive with it, or you can load it into a virtual machine (VM) which is what I'm doing for this demonstration.\nAfter booting in, you have the option to either try or install Kubuntu. If you've never used it before, click \"Try Kubuntu\" and see how it feels. There will be an \"Install Kubuntu\" shortcut on the desktop for when you feel ready to make it permanent.\nThe installation wizard is pretty self-explanatory. At the \"Installation Mode\" screen, I recommend leaving \"Normal Installation\" selected unless you know what you're doing. I also recommend checking the \"Download and Install Updates Following Installation\" box. Your wait time will be longer, but you'll also have a fully functional operating system from the get-go.\nIn the \"Partition\" section, make sure of two things. First, double check you have the correct drive at the top for Kubuntu to be installed on. Second, don't try installing Kubuntu alongside Windows on the same drive or manually partitioning unless you know what you're doing. Windows doesn't get along with Linux, and partitioning is best left to the pros. Erasing the disk is the simplest and most reliable setup.\nWith that said, double check again that the disk you're going to erase is the correct one. You should also confirm that you don't mind losing all the data on it. Follow the rest of the prompts and then wait.\nWhat Running Kubuntu Is Like\nAs I said earlier, some people find the Plasma desktop to be too busy, especially when it comes to the settings menus. A redeeming quality of Kubuntu is that the default settings are sane and will be familiar for anyone used to the Windows experience. Chances are good you simply won't care to make any serious tweaks. In the case you do, there is a lot of Kubuntu documentation to help you.\nAgain, folks coming over from Windows 10 will feel the most at home in the default Kubuntu setup. There's the taskbar at the bottom of your screen, with a \"system tray\" to the right holding time and date info along with several indicators and widgets to help you manage your computer and apps. To the left, alongside all of your pinned and running apps, is an app launcher button that mimics the Windows Start menu experience.\nMany of the same keyboard shortcuts on Windows work the same way on Plasma. Hitting the Windows key (called the \"Meta\" key in Kubuntu) will open the app launcher, and Alt+Tab will let you switch between application windows. Hitting Meta+L will lock your screen, or you can use Ctrl+Alt+Delete to get a menu for shutting down, restarting, or putting your PC to sleep.\nThere are a ton of features and widgets for productivity in Kubuntu that you can explore and play with. I won't get into them here, but I recommend looking into some of our favorite ways to make the most of KDE Plasma.\nKubuntu Has Its Own App Ecosystem\nKDE Plasma and Kubuntu itself are both part of a wider collection of related and interconnected projects called the KDE Community. There are tons of applications, toolkits, and frameworks developed as part of the project. Kubuntu relies on those frameworks and comes with many of those apps preinstalled as your default apps, such as your calculator (KCalc), your notepad (KWrite), and your file browser (Dolphin).\nThere are also a ton of other, more niche apps in the KDE collection that you might want. They're all available for free in Kubuntu's software manager \"Discover,\" and they include apps like Akregator the RSS reader, KMag the magnifying glass, and KMyMoney for managing finances. Take a long scroll on the complete KDE apps list for more, including a bunch of games for when you're bored.\nThat's just KDE's own set of apps. You can find even more in Discover. It includes popular apps you probably already use ,like Spotify, Slack, and VLC, plus a ton more open source apps you have never heard of but are free to download.\nShould You Use Kubuntu?\nBased on my experience using it daily for around eight months, I'd say Kubuntu is for anyone looking for an alternative operating system to Windows or macOS who wants a highly flexible environment to work in—without the need to make edits to cryptic configuration files. It's ideal if you also don't care about having the absolute latest version of every app and instead prefer stability above all else.\nIf you want to give Kubuntu a try, you have several options. Download the ISO from the official Kubuntu download page and you can install it on a thumb drive and trial it on just about any computer before fully installing the distro. Alternatively, you can use the ISO to launch it as a virtual machine inside of your current operating system using something like VirtualBox.\nIf you happen to be in the market for a new computer, you can also simply buy a Kubuntu laptop or mini PC from a store like Kubuntu Focus. I've reviewed Focus laptops before and found them worth giving a go.\nKubuntu Focus Ir16 (Gen2)\n- Operating System\n- Kubuntu\n- CPU\n- Intel Core i5-13500H\n- GPU\n- Intel Iris Xe (Integrated)\n- RAM\n- Up to 96GB\nThe Ir16 GEN 2 marries the enterprise-class hardware from Carbon Systems with the meticulous OS integration and Linux-first support from Kubuntu Focus."
    },
    {
      "url": "https://www.howtogeek.com/the-new-kubuntu-focus-m2-laptop-has-linux-and-an-rtx-5070-ti/",
      "text": "Kubuntu Focus has been selling Linux-powered laptops for a long time, and now the company has revealed a new high-end model. The Kubuntu Focus M2 Gen 6 is packed with features and performance, but it’s not cheap.\nThe Focus M2 has the form factor of a gaming laptop, with a large 16-inch 2560x1600 240Hz screen, a backlit keyboard with a number pad, and a whole lot of ports. One side of the laptop has two Thunderbolt 4 ports, a USB 3.2 Gen 2 Type-A connector, a microSD card reader, and a Kensington lock. The other side has another USB 3.2 Gen 2 Type-A port and a combo audio jack, and on the back, there’s an HDMI 2.0 port with HDPC and 2.5G Ethernet connector.\nPowering the laptop is an Intel Core Ultra 9 275HX processor, complete with eight performance cores and 16 efficient cores. For graphics, you get an NVIDIA GeForce RTX 5070 Ti graphics card, with the option to use the Intel integrated graphics when battery life matters more than performance. There are also two PCIe slots for NVMe drives, an 80 Wh battery, Wi-Fi 7, Bluetooth 5.4, and dual speakers.\nAs you might guess from the name, this laptop ships with Kubuntu 24.04 LTS Linux out of the box, with open-source utilities for configuring power and fan profiles. You can also install other modern desktop Linux distributions, though the NVIDIA drivers might require extra installation steps on some operating systems. The laptop should also work with Windows, but Kubuntu Focus hasn’t shared any details there.\nAll that power will cost you: the Focus M2 Gen 6 starts at $2,985. The multi-core CPU benchmarks in Geekbench 6 provided by Kubuntu Focus are roughly on par with a MacBook Pro using an M3 Max or M4 Pro chipset, the latter of which costs around $1,800 right now. The most direct competitor to the Focus M2 might be the System76 Serval WS laptop, which has the same Core Ultra 9 CPU and RTX 5070 Ti graphics card at a similar $2,999 price, and is also designed for running desktop Linux. System76 and Kubuntu Focus are both using modified Clevo laptop designs.\nYou can buy the Focus M2 Gen 6 from the official store, with a starting price of $2,895.\nSource: Kubuntu Focus, Liliputing"
    },
    {
      "url": "https://kfocus.org/order/",
      "text": "Kernels & Devices Desktop & Apps GPU & AI Drivers\n| MODEL Feature | Zr GEN 1 | NX GEN 3 | M2 GEN 6 | Ir16 GEN 2 | Ir14 GEN 2 |\n|---|---|---|---|---|---|\n| Display (in) | 18.0 | 16.0 | 16.0 | 14.0 | |\n| Resolution | 2560x1600 | 2560x1600 | 2560x1600 | 1920x1200 | |\n| NumPad | |||||\n| Dimensions (in) | 15.8 x 12.6 x 1.1 | 4.6 x 4.4 x 1.5 | 14.0 x 10.7 x 0.8 | 14.1 x 9.7 x 0.7 | 12.4 x 8.6 x 0.7 |\n| Battery (Wh) | 98 | 80 | 80 | 53 | |\n| Weight (lb) | 8.60 | 1.10 | 4.96 | 3.30 | 3.00 |\n| CPU | Ultra 9 275HX | Ultra 7 255H Ultra 5 225H | Ultra 9 275HX | i5-13500H | i5-13500H |\n| GPU | RTX 5090 RTX 5080 | Arc 140T Arc 130T | RTX 5070 Ti | Iris Xe | Iris Xe |\n| Max Disk (TB) | 16.0 | 6.0 | 12.0 | 8.0 | 8.0 |\n| RAM (MHz) | 5600 DDR5 | 5600 DDR5 | 5600 DDR5 | 5200 DDR5 | 5200 DDR5 |\n| Max RAM (GB) | 192 | 96 | 96 | 96 | 96 |\n| Ethernet RJ-45 Gigabit | 2.5 | 2.5 | 2.5 | ||\n| Intel® WI-FI | 7 BE200 | 7 BE201 | 7 BE201 | 6E AX201 | 6E AX201 |\n| Headphone Audio Jack | |||||\n| Built-In Microphones | |||||\n| HDMI | 1 x 2.1 | 2 x 2.1 | 1 x 2.1b | 1 x 2.1 | 1 x 2.1 |\n| USB-C with DisplayPort | 2 x 2.1 | 2 x 2.1 | 1 x 2.1b | 1 x 1.4 | 1 x 1.4 |\n| Bluetooth Version | 5.4 (Multi) | 5.4 (Multi) | 5.2 (Dual-Mode) | 5.2 (Dual-Mode) | |\n| Kensington Lock Mount | |||||\n| USB-A | 2 | 4 | 2 | 2 | 2 |\n| USB-C Total | 2 | 3 | 2 | 2 | 2 |\n| USB-C with Thunderbolt 5 | 2 | 0 | 0 | 0 | 0 |\n| USB-C with Thunderbolt 4 | 0 | 2 | 2 | 1 | 1 |\n| SD Card Reader | 1 x Micro SD | 1 x Micro SD | 1 x SDXC | 1 x SDXC |\nModel are validated for a minimum of 3 years after the last sale. This includes all updates for the OS (e.g. 22.04 to 24.04), and kernel updates. We also test all major graphics drivers updates, and major desktop updates. Click on a model name below to see the specification page.\n| Detail Year | Model Name | Kernel 6.11 | iGPU i915 | dGPU NV 535/570 | Desktop Plasma 5.27 | Apps Curated | Tested Thru† | |\n|---|---|---|---|---|---|---|---|---|\n| 2025 | Zr GEN 1 | TBD 2029 | ||||||\n| 2025 | NX GEN 3 | TBD 2029 | ||||||\n| 2025 | M2 GEN 6 | TBD 2029 | ||||||\n| 2024 | i9-14900HX M2 GEN 5 | JAN 2028 | ||||||\n| 2024 | Ir16 GEN 2 | TBD 2028 | ||||||\n| 2024 | Ir14 GEN 2 | TBD 2028 | ||||||\n| 2023 | i9-13900HX M2 GEN 5 | MAY 2027 | ||||||\n| 2023 | Ir14 GEN 1 | APR 2027 | ||||||\n| 2023 | NX GEN 2 | JUL 2028 | ||||||\n| 2023 | XE GEN 2 | MAR 2026 | ||||||\n| 2022 | M2 GEN 4 | MAR 2026 | ||||||\n| 2022 | NX GEN 1 | OCT 2026 | ||||||\n| 2021 | XE GEN 1 | JAN 2026 | ||||||\n| Beyond Support Date | ||||||||\n| 2021 | M2 GEN 3 | MAR 2025 | ||||||\n| 2021 | M2 GEN 2 | DEC 2024 | ||||||\n| 2020 | M2 GEN 1 | DEC 2024 | ||||||\n| 2020 | M1 GEN 1 | DEC 2024 |\n† The last planned validation date is shown in the Tested Thru column. As mentioned above, this is a minimum of 3 years past the last sale date for a model. We support and validate OSes per the Canonical support schedule. For example, we will validate Kubuntu 22.04 LTS through April 2025 and Kubuntu 24.04 LTS through April 2027.\nWhen the upstream proposes changes to the Kernel, Desktop, or Video Drivers, the Focus Team validates them on your hardware. Models are tested for a minimum of 3 years after last sale. If an issue is found, we work with KDE, Kubuntu, Ubuntu, Linux Kernel, and other teams to help fix it. We also pin \"known-good-version\" packages until the issue is resolved so you don’t see it.\nThe Focus Team performs validation testing in good faith to deliver better and more reliable software; however, this cannot change the Terms of Use of any software package. Please see the Terms and Conditions page to locate the terms for each package.\nThe Focus Team runs extensive automated and manual tests when the upstream proposes any kernel update. We test many external and internal devices, connectors, and usage scenarios.\nThe Focus Team runs extensive automated and manual tests when the upstream proposes major update to KDE Plasma or Frameworks.\nThe Focus Team runs extensive automated and manual tests when the upstream proposes a major update to GPU drivers. We also coordinate the integration of CUDA, ML, and AI libraries with the official Ubuntu GPU drivers.\n* Validation support extends for a minimum of 3 years after the last date of sale for each model.\nFREE SHIPPING: Applies to shipping to continental US and Canada. All orders are fully insured and signature verified. Shipping costs to other locations are reduced by an equivalent value which varies by model.\n5-DAY TURNAROUND: Unless otherwise noted, all units are stocked for timely builds, and are typically shipped within 3-5 business days. All RAM, NVMe drives, and SSD drives are name-brand components renowned for reliability and high performance. These are firmware-upgraded, stress-tested, and warrantied for your system.\nHAVE QUESTIONS?Call 844-536-2871 or write\nTellMeMore@kfocus.org | GET FOCUS MERCH"
    }
  ],
  "argos_summary": "Kubuntu Focus has launched the Focus Zr Gen 1, a powerful workstation-level laptop designed for demanding tasks, featuring an 18-inch WQXGA display, Intel Ultra 9 275HX CPU, and options for Nvidia RTX 5080 or 5090 GPUs. The laptop supports extensive configurations, including up to 192GB of RAM and 16TB of storage, and offers advanced connectivity options like Wi-Fi 7 and Thunderbolt 5. This model aims to provide a robust alternative for users considering a switch from Windows, especially as support for Windows 10 is set to end in 2025.",
  "argos_id": "EBC8ERZ2H"
}