{
  "url": "https://www.theguardian.com/us-news/2025/aug/11/texas-lawsuit-abortion-pill",
  "authorsByline": "Carter Sherman",
  "articleId": "b4459b3e48534d83bee55d86403bdd74",
  "source": {
    "domain": "theguardian.com",
    "paywall": false,
    "location": {
      "country": "gb",
      "city": "London",
      "coordinates": {
        "lat": 51.5073219,
        "lon": -0.1276474
      }
    }
  },
  "imageUrl": "https://i.guim.co.uk/img/media/2379bb7b7687b9f81c972de93c53ba299d0f2898/458_0_4884_3910/master/4884.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=bf9ecd80c76cce6161af3c05949d8aa5",
  "country": "gb",
  "language": "en",
  "pubDate": "2025-08-11T20:40:43+00:00",
  "addDate": "2025-08-11T21:40:01.805625+00:00",
  "refreshDate": "2025-08-11T21:40:01.805628+00:00",
  "score": 1.0,
  "title": "Texas woman files wrongful death suit saying she was dosed with abortion pills",
  "description": "Woman claims in lawsuit that man impregnated her and dissolved at least 10 shipped abortion pills into her drink",
  "content": "A Texas woman has sued a man she says dosed her with abortion pills against her will as well as the provider who she says supplied the pills.\n\nThe woman, Liana Davis, on Monday filed a federal wrongful death lawsuit against the telemedicine abortion service Aid Access and its founder, Dr Rebecca Gomperts, as well as a man named Christopher Cooprider, a US marine who Davis said impregnated her and subsequently dosed her with abortion pills.\n\nDavis is being represented in the lawsuit by Jonathan Mitchell, a lawyer who masterminded a Texas six-week abortion ban and has become one of the major architects of anti-abortion strategy in the post-Roe v Wade era. Mitchell has represented men in lawsuits who have sued abortion providers after accusing their female partners of undergoing abortions against their wishes, but this case is thought to be the first of its kind with a female plaintiff.\n\nAfter Davis revealed her pregnancy to Cooprider, he repeatedly pressured her to get an abortion and went so far as to order abortion pills online from Aid Access, a service that ships abortion pills to all 50 US states, according to Davis’s lawsuit, which includes extensive screenshots of texts between Cooprider and Davis.\n\nWhen Davis refused to take the pills, Cooprider allegedly browbeat her and suggested that he testify against Davis in her ongoing divorce proceeding against her ex-husband. Davis told Cooprider that her ex-husband had physically and emotionally abused both Davis and her three children, the lawsuit alleges.\n\nThen, in April 2025, Cooprider proposed that he come over to Davis’s house for a “trust building night”, according to the lawsuit. While Davis stepped outside to let her dog in, Cooprider allegedly dissolved at least 10 abortion pills into her hot chocolate.\n\nTypically, US abortions consist of two drugs, mifepristone and misoprostol. While mifepristone is usually swallowed, misoprostol is meant to dissolve slowly in the vagina, under the tongue or in someone’s cheeks.\n\nSoon afterward, Davis began cramping and bleeding, her lawsuit alleges. Cooprider said that he would pick up Davis’s mother, so that she could watch Davis’ children while they went to the emergency room. However, Cooprider did not return.\n\nDavis then allegedly discovered the box of abortion mifepristone that Cooprider had ordered from Aid Access, which Cooprider had left at her house. The box was empty. Davis also allegedly found an orange pill bottle containing both mifepristone and misoprostol pills.\n\nShe rushed to the ER but ended up miscarrying eight weeks into her pregnancy. There is no medical test that can determine whether abortion pills, if taken orally, caused the end of a pregnancy.\n\nThe lawsuit, which was previously reported by Autonomy News, is now seeking “nominal, compensatory, and punitive damages”. In addition to accusing Cooprider, Aid Access and Gomperts of violating multiple laws in Texas – where virtually all abortions are banned – it alleges that the trio also violated the federal Comstock Act, a 19th-century anti-vice law that outlaws the mailing of abortion-related materials.\n\nLegal experts long regarded the Comstock Act as a dead letter, since Roe v Wade kept its ban on abortion-related materials from taking effect for decades. However, since the US supreme court overturned Roe in 2022, anti-abortion advocates such as Mitchell say it can now be revived. They have repeatedly cited the Comstock Act in lawsuits, in the hope that courts will decide to let it take full effect.\n\nAid Access, Gomperts and the US marines did not respond to a request for comment.\n\nReached by phone, Cooprider said he had no comment on the lawsuit.\n\nTelemedicine groups including Aid Access are currently mailing abortion pills through the use of “shield laws”, which have been enacted in a handful of blue states since Roe fell. These laws, which aim to protect abortion providers from facing civil and criminal liability if they mail pills to people who live in states that ban abortion, have proven critical to post-Roe abortion provision, as abortion pills make up an increasing share of all US abortions. Between 2023 and 2024, Aid Access shipped almost 120,000 packs of abortion pills to US residents, according to a new study released on Monday.\n\nHowever, shield laws have not been tested in court. Recently, Texas sued a New York court official for refusing to fine a New York-based abortion provider, as the official had said that New York’s shield law blocked him from enforcing the fine.",
  "medium": "Article",
  "links": [
    "https://www.autonomynews.co/texas-wrongful-death-suit-abortion-pills-fetal-personhood/",
    "https://www.theguardian.com/world/abortion",
    "https://www.theguardian.com/us-news/texas",
    "https://www.theguardian.com/us-news/2025/aug/11/medication-abortions-performed-study",
    "https://www.theguardian.com/us-news/roe-v-wade",
    "https://www.theguardian.com/us-news/2025/jul/29/texas-new-york-lawsuit-abortion-provider",
    "https://www.theguardian.com/world/2025/jul/23/texas-man-sues-doctor-abortion-pills",
    "https://www.theguardian.com/us-news/2025/aug/08/ohio-planned-parenthood-medicaid-trump",
    "https://www.theguardian.com/us-news/2025/apr/26/abortion-clinic-pills-shield-laws"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "abortion pills",
      "weight": 0.12976348
    },
    {
      "name": "US abortions",
      "weight": 0.116417624
    },
    {
      "name": "abortion providers",
      "weight": 0.112874284
    },
    {
      "name": "abortion mifepristone",
      "weight": 0.111218415
    },
    {
      "name": "abortion",
      "weight": 0.10916533
    },
    {
      "name": "abortions",
      "weight": 0.10916533
    },
    {
      "name": "post-Roe abortion provision",
      "weight": 0.09870231
    },
    {
      "name": "Davis",
      "weight": 0.0845125
    },
    {
      "name": "pills",
      "weight": 0.0838231
    },
    {
      "name": "Liana Davis",
      "weight": 0.08367035
    }
  ],
  "topics": [
    {
      "name": "Social Issues"
    },
    {
      "name": "Abortion"
    }
  ],
  "categories": [
    {
      "name": "Health"
    }
  ],
  "taxonomies": [
    {
      "name": "/Law & Government/Legal/Other",
      "score": 0.75634765625
    },
    {
      "name": "/Sensitive Subjects/Other",
      "score": 0.7431640625
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Other",
      "score": 0.568359375
    },
    {
      "name": "/News/Other",
      "score": 0.4384765625
    },
    {
      "name": "/Health/Public Health/Health Policy",
      "score": 0.360595703125
    },
    {
      "name": "/Sensitive Subjects/Violence & Abuse",
      "score": 0.353515625
    },
    {
      "name": "/Health/Medical Facilities & Services/Other",
      "score": 0.315185546875
    }
  ],
  "sentiment": {
    "positive": 0.05825208,
    "negative": 0.664385,
    "neutral": 0.27736288
  },
  "summary": "A Texas woman, Liana Davis, has filed a federal wrongful death lawsuit against telemedicine abortion service Aid Access and its founder, Dr Rebecca Gomperts, alleging that she was dosed with abortion pills against her will. The lawsuit also names Christopher Cooprider, a US marine who allegedly impregnated Davis and then dosed her with the pills. Davis is represented by Jonathan Mitchell, a lawyer who masterminded a Texas six-week abortion ban and has become one of the major architects of anti-abortion strategy post-Roe v Wade. The suit alleges that Coooprider pressured Davis to have an abortion and even ordered the pills online from Aid Access, a service that ships abortion pills to all 50 US states. Davis also alleges that Aid Access violated multiple laws in Texas, where virtually all abortions are banned. The case is believed to be the first of its kind with a female plaintiff.",
  "shortSummary": "A Texas woman, Liana Davis, is suing Aid Access and US marine Christopher Cooprider for her wrongful death, alleging they dosed her with abortion pills.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "3febcc532c9349e1802d08b110a035f4",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.autonomynews.co/texas-wrongful-death-suit-abortion-pills-fetal-personhood/",
      "text": "Texas Woman Files Wrongful Death Suit, Alleges Man Slipped Abortion Pills in Her Drink\nJonathan Mitchell is representing a woman suing both her male partner and Aid Access founder Rebecca Gomperts. Mitchell associate Mark Lee Dickson said he learned of the incident from a crisis pregnancy center.\nA Texas woman filed a wrongful death lawsuit in federal court on Monday against a man who she alleges “secretly dissolv[ed] abortion pills” into a hot chocolate and tricked her into drinking it.\nThe woman is represented by former Texas Solicitor General Jonathan Mitchell, who was the architect of the Texas bounty hunter abortion ban, SB 8. Prominent anti-abortion activist Mark Lee Dickson—who has worked with Mitchell for years on an initiative to convince local governments to pass ordinances declaring themselves “Sanctuary Cities for the Unborn” —announced the case on social media. Autonomy News has chosen not to name the woman and man involved in the case.\nDickson wrote on multiple social platforms that he heard about the incident in May from the director of a local crisis pregnancy center while visiting Corpus Christi, Texas, to speak about his “sanctuary city” campaign and SB 2880, a bill that would have instituted a broad crackdown on abortion pills in Texas. (Most CPCs are not bound by medical privacy laws like HIPAA.) That bill failed to advance during the regular legislative session, but similar legislation has been introduced in the state’s dramatic special session, which made national news when Democratic legislators fled the state in a last-ditch attempt to stop Congressional redistricting. There are multiple proposed bills that would institute civil penalties of $100,000 or more for helping people access abortions. Dickson noted online that lawmakers were hearing one such proposal on Monday, Senate Bill 6. He connected the lawsuit to this bill: “I hope these stories drive us to see more protections pass.”\nThe suit also names Aid Access and its founder, physician Rebecca Gomperts, alleging that Aid Access was the source of the pills. (The woman alleges that the man showed her a receipt from Aid Access on his phone.) She is seeking damages from Aid Access, Gomperts, and her male partner for wrongful death.\nUnder Texas’ wrongful death and felony murder statutes, the definition of an individual “includes an unborn child at every stage of gestation from fertilization until birth.” In other words, fetal personhood is enshrined into Texas law. The suit also claims the defendants violated the Comstock Act, a dormant 1873 anti-vice law. Mitchell has been a leading voice within the anti-abortion movement in favor of enforcing Comstock in such a way that it would ban sending abortion pills by mail entirely.\nCurrently, clinicians working for services like Aid Access can mail abortion pills to residents of any state under so-called “shield laws” that protect them from civil and criminal action in states with bans. Mitchell and other conservatives are trying to undermine if not overturn those laws. Also on Monday, a research letter in JAMA found that Aid Access prescribed nearly 120,000 sets of abortion pills between July 2023 and August 2024. Almost 100,000 were sent to states that either ban the procedure or prohibit the mailing of pills.\nRecently, Mitchell has been representing aggrieved men to sue over their partners’ and ex-partners’ abortions. This is the first known case where he has represented a woman alleging she was given abortion-inducing medications without her consent.\nAccording to text messages included in the complaint, the man pressured the woman, who is his next door neighbor, to have an abortion after she told him she was pregnant. She repeatedly said she did not want to have an abortion, and told him not to order abortion pills. He also threatened to testify against her in an ongoing custody battle with her soon-to-be ex-husband, who the complaint alleges is physically and emotionally abusive toward the woman and her two children.\nAccording to the complaint, amid their ongoing conflict over the pregnancy, the man suggested a “trust building night” spent together in April 2025. She alleges that he slipped misoprostol into a hot chocolate that he made her, and that she began bleeding and cramping within 30 minutes. Misoprostol can either be used in combination with another medication, mifepristone, or on its own to induce abortion. However, misoprostol is typically dissolved in the cheek, under the tongue, or in the vagina rather than swallowed. Abortion patients are also told to take four pills at a time, and the dose is typically repeated several times depending on the gestational age of the pregnancy and the medications being used.\nAfter offering to drive her to the hospital and pick up her mother so she could care for the younger children, the woman alleges the man left her home, never returned, and stopped answering her calls. The complaint further alleges that she found a pill bottle and box left behind at her home with the man’s name listed on the prescription label, and that the man had mixed 10 of the 12 misoprostol pills he received into her hot chocolate.\nThe woman brought the pill bottle and box with her to the emergency room and turned them over to the police, according to the lawsuit. Medical staff told her she lost the eight-week pregnancy. There is currently no medical test that can confirm whether or not someone took misoprostol, or whether it caused a miscarriage.\nThe circumstances described in the lawsuit bear close resemblance to the case of a North Texas man who is facing capital murder charges for allegedly slipping mifepristone into his girlfriend’s food. A local sheriff’s office pressed those charges. Experts have also warned that that case represents a dangerous advance of the legal theory of fetal personhood.\nLate last month, Mitchell filed a wrongful death lawsuit against a California doctor for allegedly prescribing abortion pills to a Texas man’s girlfriend, who is reportedly pregnant again. In that case, Mitchell asked a judge to prevent the physician from prescribing more abortion pills, and to force the doctor to pay damages for wrongful death. Though Aid Access is mentioned in that complaint, the organization is not named as a defendant.\nThis is a developing story and will be updated.\nThis story was edited by Susan Rinkunas.\nComments ()"
    },
    {
      "url": "https://www.theguardian.com/us-news/2025/jul/29/texas-new-york-lawsuit-abortion-provider",
      "text": "Texas has sued a New York official for refusing to take action against an abortion provider, teeing up a state-versus-state battle that is widely expected to end up before the US supreme court.\nKen Paxton, Texas’s attorney general, has petitioned the New York state supreme court to order a county clerk to enforce a fine against Dr Margaret Carpenter, a New York doctor accused of mailing abortion pills across state lines.\nPaxton accused Carpenter last year of mailing abortion pills to a Texas woman in defiance of Texas’s ban on virtually all abortions. After Carpenter failed to show up in a Texas court, a judge ordered her to pay more than $100,000 in penalties.\nBut the acting Ulster county clerk, Taylor Bruck, in New York has twice rejected Paxton’s efforts to levy that fine. Under New York’s “shield law”, state law enforcement officials are blocked from complying with out-of-state prosecutions against abortion providers who ship pills to patients, even if those patients are located outside New York state.\n“No matter where they reside, pro-abortion extremists who send drugs designed to kill the unborn into Texas will face the full force of our state’s pro-life laws,” Paxton, a Republican, said in a statement announcing Monday’s filing.\nBruck, 34, said that he was just following New York state law.\n“I’m just proud to live in a state that has something like the shield law here to protect our healthcare providers from out-of-state proceedings like this,” Bruck said. “This has the potential of getting appealed up and up and up.”\nPaxton’s petition marks the latest escalation in the burgeoning clash between states that protect abortion rights and those that do not. In the three years since the supreme court overturned Roe v Wade, abortion opponents in red states have repeatedly tried to push for legislation and litigation that would curtail people’s ability to cross state lines for abortions or to receive abortion pills in the mail. Meanwhile, blue states, including New York, have enacted an array of shield laws to preserve people’s abortion access.\nThe US supreme court will probably be forced to step in to settle these debates between states, legal experts say.\n“Ultimately, it’s a states’ rights argument,” Bruck said, adding that he remains “still stunned by the whole thing”.\n“It’s not something I was really expecting, coming into this role,” Bruck said. “It’s really unprecedented for a clerk to be in this position.”"
    },
    {
      "url": "https://www.theguardian.com/us-news/2025/aug/11/medication-abortions-performed-study",
      "text": "An abortion provider shipped almost 120,000 packs of abortion pills to US residents between July 2023 and August 2024 – nearly 100,000 of whom lived in states that outlaw the procedure or have laws on the books that ban the mailing of abortion pills, according to a new study published in the prestigious medical journal Jama on Monday.\nTo the shock of experts, the number of abortions performed in the US rose in the three years since the US supreme court overturned Roe v Wade and paved the way for more than a dozen states to ban virtually all abortions. Much of that rise has been driven by the use of abortion pills, or medication abortion, and providers’ ability to supply the pills through telehealth.\nUS abortion providers performed 1.14m abortions in 2024 – the highest number on record in recent years, according to data from #WeCount, a Society of Family Planning project. By the end of the year, #WeCount found, a full quarter of all abortions were being facilitated through telehealth.\nThis study, which was led by a University of Texas at Austin professor and studied shipments from the telemedicine abortion service Aid Access, more fully fleshes out the portrait of US abortion access, as it is the first to examine abortion pill provision at the county level. The poorer a county was, the more likely its residents were to order abortion pills, researchers discovered.\nCounties where the poverty rates hovered between 10% and 20% had provision rates that were 1.63 times higher than counties where the poverty rate was lower than 5%. In counties where the poverty rate was above 20%, the provision rate was 1.93 times higher than in richer counties.\nAbortion pill provision rates were also more than three times higher in states that ban abortion compared with those that do not. In states that specifically ban telemedicine abortion, the provision rates were more than twice as high. Counties that were located farther from abortion clinics were also likely to see higher rates of abortion provision.\nAid Access ships to all 50 US states through the use of “shield laws”, which have been adopted by a handful of blue states in the years since the repeal of Roe. These laws aim to guard abortion providers from out-of-state prosecutions; if an abortion provider living in a state with a shield law ships pills across state lines, they are in theory protected from liability. But these laws have yet to be tested in court.\nLate last year, Texas sued a New York doctor over allegations that she had mailed abortion pills to a Texas woman. After the doctor, Margaret Carpenter, failed to show up for a court date, a judge ruled against her by default and ordered her pay a fine of more than $100,000. Citing New York’s shield law, a New York state clerk has repeatedly refused to enforce the fine. The Texas attorney general, Republican Ken Paxton, sued the clerk in July.\nExperts widely expect that the dispute, which tests the relationships between states that ban abortion and those that protect it, will eventually reach the US supreme court."
    },
    {
      "url": "https://www.theguardian.com/world/2025/jul/23/texas-man-sues-doctor-abortion-pills",
      "text": "A Texas man has filed a federal wrongful death lawsuit against a doctor who, he says, supplied abortion pills to his girlfriend.\nIn the lawsuit, which was filed in Texas on Sunday, Jerry Rodriguez alleges that the doctor, Remy Coeytaux, mailed the pills to Texas, where virtually all abortions are outlawed. Rodriguez’s girlfriend then allegedly used the pills to end two pregnancies.\nCoeytaux not only broke a series of Texas anti-abortion laws, the lawsuit alleges, but also a 19th-century federal anti-vice law known as the Comstock Act. That act bans the mailing of abortion-related materials, but has been unenforced for decades, its scope narrowed by laws and court rulings – including Roe v Wade, which has since been overturned – that came into effect in the 20th century.\n“Assisting a self-managed abortion in Texas is an act of murder,” the lawsuit alleges. Although Rodriguez’s girlfriend, the lawsuit continued, “cannot be charged with murder for her role in killing her unborn child, immunity does not shield Coeytaux from liability for aiding or abetting or directly participating in the murder”.\nRodriguez is seeking damages against Coeytaux as well as an injunction that would forbid Coeytaux from mailing abortion pills across state lines. Rodriguez wants that injunction, he said in his lawsuit, “on behalf of a class of all current and future fathers of unborn children in the United States”.\nRodriguez also claims the injunction is necessary because his girlfriend is allegedly pregnant again, and he fears her husband – from whom she is separated – may urge her to have another abortion. His girlfriend’s previous abortions were also at her estranged husband’s convincing, according to Rodriguez’s lawsuit.\nThis lawsuit marks the latest attempt by anti-abortion activists to target the mailing of abortion pills, which have become a major avenue of abortion access in the three years since the US supreme court overturned Roe, and to revive enforcement of the Comstock Act. In December, Texas sued Margaret Carpenter, a New York doctor, over allegations that she violated Texas law by mailing abortion pills to a Texas woman. In January, a Louisiana grand jury criminally indicted Carpenter over accusations that she mailed a pill to that state, too.\nAnti-abortion activists’ have been urging men who are angry about their female partners’ abortions to come forward and launch litigation.\nHowever, because the Carpenter lawsuit was ultimately filed by the office of Ken Paxton, the Texas Republican attorney general, experts believe it may be fatally hobbled by a quirk of US constitutional law. Mary Ziegler, a University of California, Davis, law school professor who studies the legal history of reproduction, has told the Guardian that while the US constitution forces states to recognize fines levied in lawsuits between people, it does not necessarily do the same for fines that result from lawsuits that have been brought by states.\nBecause Rodriguez is suing as an individual, his lawsuit may sidestep that hurdle.\nCoeytaux declined to comment on the litigation.\nAccording to his LinkedIn profile, Coeytaux is based in California, where abortion remains legal, and which has a “shield law” in place to protect abortion providers who mail abortion pills across state lines. They have never been put to the test in court.\nRodriguez is being represented in his lawsuit by Jonathan Mitchell, an attorney who masterminded a six-week abortion ban that went into effect in Texas in 2021. Although Roe was still the law of the land when the ban took effect, it withstood legal scrutiny because of its unique design: rather than being enforced by the state, it deputized people to sue one another over suspected illegal abortions."
    },
    {
      "url": "https://www.theguardian.com/us-news/2025/apr/26/abortion-clinic-pills-shield-laws",
      "text": "Seated around a circular table in a nondescript office building just outside Boston, the volunteers pack the abortion pills into envelopes with practiced efficiency.\nEach of the volunteers – five women and one man – have a unique role in the assembly line. One volunteer drops slim, orange boxes of mifepristone, the first drug typically used in a medication abortion, into the envelopes, while another volunteer adds green-capped bottles of the second drug, misoprostol. A few volunteers add brochures on topics such as how to use abortion pills or what to do if a woman suspects she has an ectopic pregnancy. Finally, one volunteer drops small purple cards into each envelope. They all bear the same handwritten message: “We wish you the best.” The cards are signed with a swooping heart and a nondescript name: “the Map”, or the Massachusetts Medication Abortion Access Project.\nBy the end of the day, dozens of these envelopes will have been dropped off at a US Postal Service office – many on their way to people who live in states that have banned abortion.\nThe Map is one of a handful of organizations operating under a controversial legal innovation known as a “shield law”. Enacted by eight states in the years since the US supreme court overturned Roe v Wade, shield laws are designed to protect abortion providers from red-state prosecutions and legal actions, even if the providers’ patients are located in states that ban abortion.\nProviders in shield law states routinely ship abortion pills across state lines: in spring 2024, they facilitated more than 7,700 monthly abortions in states with total or six-week abortion bans, according to #WeCount, a research project by the Society of Family Planning.\nBut shield laws are now being put to the test. In December, Texas sued Dr Margaret Carpenter, a New York doctor, over allegations that she violated Texas’s abortion bans by mailing abortion pills to a Texas woman. Then, in January, a Louisiana grand jury criminally indicted Carpenter.\nThe New York governor, Kathy Hochul, has refused to sign an extradition order for Carpenter. Citing the state’s shield law, a New York county clerk has also refused to enforce a $113,000 fine, levied by a Texas court, against her. Now, Texas is expected to sue New York over the shield law – a move that could ultimately land the case in front of the supreme court, dominated 6-3 by conservatives, and tip the balance of power between states that protect abortion rights and those that do not.\n“No one wanted this, but it’s not unexpected,” said Dr Angel Foster, the Map’s co-founder, of the state-on-state fight. “I think we were prepared for this to happen, and we’re waiting for the next shoe to drop.”\nThe legal battle has not slowed down demand at the Map. Before dropping their prices last year, the Map was mailing pills to about 500 patients a month. Now, it provides pills to roughly 2,500 per month.\n“Since the election, it’s felt even more urgent to have a tangible and literally hands-on impact. A package is going to somebody who needs it, in a place where they are being denied their rights,” one Map volunteer said as she sealed envelopes. She spread her palm out on a package as if she were placing a hand on a Bible. “It’s going to a real person.”\n‘War between the states’\nTo order pills from the Map, a patient must be within their first trimester of pregnancy and at least 16, the age of consent for an abortion under Massachusetts law. After they fill out an online intake form, a licensed clinician reviews their chart; if a patient has questions, someone from Map will take their call. Because the organization operates on a sliding scale, patients can receive pills for as little as $5.\nOn one recent Tuesday morning, Cheryl, a retired OB-GYN, sat in the Map’s tiny, dimly lit office and quietly clicked through patients’ charts, evaluating the answers to questions about the date of their last period and their past pregnancies. Patients shared why they wanted abortions, but Cheryl rarely lingered over their answers. One, however, struck her: a 25-year-old single mom who felt like another pregnancy would endanger her ability to take care of her child. It reminded Cheryl of the five years she spent providing abortions at Mississippi’s last abortion clinic, which shuttered shortly after the supreme court’s 2022 decision in Dobbs v Jackson Women’s Health Organization paved the way for state abortion bans to unfurl across the US.\n“That was a really common refrain: ‘I just want to do right by the kids I have,’” Cheryl recalled. About half of the Map’s patients, she said, already have children. They are also predominantly under 35 and people of color – similar to abortion patients writ large, at least before Roe fell.\nAfter Roe’s collapse forced the Mississippi clinic to close, Cheryl started providing abortions in North Carolina – until that state banned the procedure after 12 weeks and the clinic where she worked no longer needed her services. “I was sitting at home, being sad and useless and doing local advocacy stuff,” Cheryl said. She also grew increasingly angry and frustrated with what she saw as mass complacency with the post-Roe reality.\nThat’s when someone told her: “I have just the group for you.”\nWorking with the Map means assuming a certain level of risk. There is no way to guarantee that a staffer or volunteer won’t get drawn into a lawsuit – or worse.\nTo diffuse risk, the Map never mails anything that includes clinicians’ names. Foster no longer travels to or through states with abortion bans, and does not drive outside of Massachusetts; she doesn’t want to run the risk of getting pulled over for speeding and learning that another state has put out a warrant out for her arrest. This is also, in part, why the Map relies on an assembly line to put its packages together: there is no single person to point a finger at.\n“I’m feeling like the people that have the power to protect us really aren’t, so we just have to keep moving along and doing what we think is right,” Cheryl said. “It’s terrifying, but the whole world is terrifying. I feel like just walking down the street these days is terrifying. Someone’s going to whisk you off and accuse you of writing an op-ed or something.”\nShe asked to be identified only by her first name to protect her ability to travel in the US, although Cheryl has no plans to enter a state with an abortion ban.\nAs Cheryl worked, a US map dotted with silver stars glimmered on the wall above her head. Each star represented the location of a patient served in October 2023, the Map’s first month of operation. Although sky-blue areas like the coast of Oregon glinted with stars, most were clustered in the south-eastern US, which is now blanketed in abortion bans. Today, a third of the Map’s patients come from Texas, which outlaws virtually all abortions, while another third hail from Florida and Georgia, which both prohibit abortion past six weeks of pregnancy.\nThe map’s constellations illuminate a paradox of the post-Roe US: even though 26 million women of reproductive age live under a total or six-week abortion ban, many are still receiving abortion pills in the mail or crossing state lines to visit a brick-and-mortar clinic. In 2023 and 2024, the US saw more than 1m abortions – some of the highest numbers in a decade, according to the Guttmacher Institute.\nThe question is whether this paradox is sustainable. Anti-abortion activists consider this kind of interstate networking an existential threat. While Texas and Louisiana have gone after Carpenter, a number of states have attempted to criminalize people who help others cross state lines for abortions. Courts have frozen many of those efforts, but these legal battles are far from over.\nWith different US states now home to fundamentally contradictory reproductive regimes, both sides – whether they seek to punish out-of-state travel or offer banned healthcare – are scrambling traditional codes of conduct between states, creating new questions about what the constitution allows. These questions are sure to end up before the supreme court.\n“There isn’t really much of a precedent for anything like shield laws, and the courts are very conservative,” warned Mary Ziegler, a University of California, Davis School of Law professor who studies the legal history of reproduction.\nThe US constitution protects people’s right to travel, but also mandates that states honor court rulings from other states – such as the fine that Texas won against Carpenter (because she and her lawyer did not show up to a court date in the state). In addition, the constitution specifies that, if an individual commits a crime in one state and “shall flee from justice” to another state, that individual must be “delivered up” – or extradited – back to the scene of the crime.\nYet there’s no evidence that Carpenter and other shield law providers did “flee from justice”; rather, they’re practicing within and obeying the law of their own home states.\n“New York is going to say: ‘She’s not a fugitive. This is not the kind of scenario where a court should get involved,’” Ziegler said. “Precedent would say they don’t have to extradite her, and the question would become whether Louisiana can find a way around that.”\nZiegler also questioned whether Texas could convince a court to force New York to collect its $113,00 fine. The constitution, she said, forces states to recognize fines levied in lawsuits between individuals – not necessarily fines that result from a lawsuit by a state against an individual.\nBut Steven Aden, the chief legal officer and general counsel at the powerful anti-abortion group Americans United for Life, is bullish about Texas’s chances.\n“You can’t go to Reno and incur a gambling debt in a casino and then go back home and raise a defense in court, when the casino comes after you for that gambling debt, by saying: ‘We don’t have gambling in our state,’” Aden said.\nZiegler and Aden did agree on one thing, though: not only is the supreme court all but certain to take up Carpenter’s case in one form or another, but the high court will likely see a deluge of similar cases over the next several years.\n“These are the first shots fired in what we like to call – what we reluctantly, I guess, call – a coming war between the states,” Aden said.\nExperts have noted that the closest parallels are the pre-civil war battles over how to treat enslaved people who had escaped southern states (which permitted slavery) and fled to northern states (which did not). When these disputes reached the US supreme court, as in the case of Dred Scott v Sandford, the court repeatedly sided with enslavers and lent power to the federal government to enforce pro-slavery laws.\nThe modern-day dispute between states over abortion is dramatically different from the 19th-century interstate battle over slavery – but Abraham Lincoln’s famous warning still seems to resonate: “A house divided cannot stand.”\n‘Can I volunteer?’\nOther threats to abortion pills could soon imperil shield-law providers, too. The attorneys general of Idaho, Kansas and Missouri are now pursuing a lawsuit that could roll back providers’ ability to prescribe the pills through the mail. Anti-abortion activists are also trying to cajole the Trump administration to enforce the Comstock Act, a 19th-century anti-vice law that bans the mailing of abortion-related materials but went dormant under Roe.\nThe Map would close if the law no longer protected its work, Foster said. But that doesn’t necessarily mean she would give up.\n“We might, as a group of people, decide to pivot and do something that’s around civil disobedience, and create a different kind of entity doing different work,” she said.\nEven if anti-abortion forces prevail in court, there is likely no way to keep abortion pills out of US hands. The US Postal Service already fails, frequently, to detect the illicit drugs that swim through it. In addition to shield law abortion providers, there is a thriving online market for abortion pills that are sent straight from overseas pharmacies, allowing women to end their pregnancies without involving the formal US healthcare system. (Medical experts widely agree that it is safe to end your own pregnancy using pills in the first trimester of pregnancy.)\nFor now, the Map has no shortage of volunteers. As the volunteers stuffed abortion pills into envelopes, a woman working in another part of the office building, who had no connection to the group, walked by the conference room and asked Foster: “Can I volunteer?” Another bystander told them: “Thank you guys for what you’re doing.”\nIt took less than two hours for the volunteers to package some 200 envelopes. Soon after they departed, another pair of volunteers arrived to add shipping labels and drop off the packages, discretely packed into a bin, at a nearby post office. In January, the Map was mailing roughly 150 packages a day – in part, Map project manager Andrea suspects, due to fears surrounding Donald Trump’s inauguration – but that volume has slowed, to about 65 to 85 packages a day. (Andrea asked to be identified by her first name only.)\nA woman working at the post office once asked Andrea if she was running a jewelry business, given the number of shipments and the rattling sounds each package made. She had mistaken the pills for beads.\nAndrea smiled. She did not confirm or deny."
    },
    {
      "url": "https://www.theguardian.com/us-news/2025/aug/08/ohio-planned-parenthood-medicaid-trump",
      "text": "An Ohio affiliate of Planned Parenthood said it will not accept Medicaid insurance because of uncertainty around a judge’s ruling ordering the Trump administration to continue sending Medicaid reimbursements to all Planned Parenthood health centers.\nThe operator of four clinics said it was concerned the administration could try to claw those payments back if the ruling is overturned. A second group of a dozen health centers is not offering long-acting contraceptive devices for Medicaid patients for similar reasons.\nThe moves come after US district judge Indira Talwani blocked a provision of the sweeping tax bill that “defunds” abortion providers for one year if they received more than $800,000 in Medicaid reimbursements in 2023. (The payments would be for non-abortion services like birth control and STI testing, as federal law already prohibits the program from covering abortions outside a few exceptions.)\nThe order prevents the administration from enforcing the law against Planned Parenthood; an independent provider in Maine filed a separate suit and a hearing is scheduled for next week.\nThe Trump administration filed notice on Tuesday that it would appeal the ruling to the first circuit court of appeals; the case will almost certainly make it to the US supreme court. Roughly a dozen Planned Parenthood clinics have announced closures since the bill was signed into law, with the latest including the organization’s only two health centers in Louisiana.\nPlanned Parenthood Gulf Coast said its New Orleans and Baton Rouge clinics would close on 30 September.\nPlanned Parenthood Southwest Ohio (PPSWO), one of two affiliates in the state, said in a statement that, while it was “relieved” to see Talwani’s order, it would not resume accepting Medicaid, though it was seeing Medicaid patients who self-pay.\n“Unfortunately for many smaller affiliates, the risk of the federal government requesting back pay if the injunction expires is still too great,” a spokesperson said, citing legal filings in which the Trump justice department said it would seek to “claw back” payments if it ultimately wins the case.\n“We’re trying to mitigate that risk to preserve our capacity to offer the other critical services south-west Ohioans and hundreds of patients from the south come to us for,” a PPSWO spokesperson added, mentioning abortion and gender-affirming care.\nPPSWO closed two health centers at the end of July, leaving it with four clinics. The spokesperson said the judge’s injunction did not allow it to reopen the shuttered clinics in Springfield and Hamilton.\n“Across the country and even within a state we may see different strategic approaches to this devastating loss [for affiliates],” the affiliate said. “This course of action was ultimately the best option for us with long-term sustainability in mind.”\nThe other Ohio affiliate, Planned Parenthood of Greater Ohio (PPGOH), said that, while it was accepting Medicaid at its 12 clinics after the injunction, it would not provide intrauterine devices or birth control implants to Medicaid patients – unless they self-pay for the devices and the insertion appointments. These forms of long-acting reversible contraception are some of the most effective, but they are costly and can be hard for low-income patients to access.\nNearly all Planned Parenthood clinics offer same-day insertions of IUDs and implants, compared with 60 to 70% of other family-planning clinics and health departments, per the Guttmacher Institute.\nIn a statement to the Guardian, PPGOH said it would not offer IUDs or Nexplanon implants to patients with Medicaid over fears that the Trump administration will demand that money be repaid if it ultimately wins in court.\n“These are the most expensive services we provide and to protect the organization from the risk of extreme financial loss, we can’t risk providing these services now and then never having the claims paid,” a PPGOH spokesperson said.\nPlanned Parenthood Federation of America is the umbrella organization that oversees a network of nearly 50 independent regional affiliates, which run roughly 600 clinics across the US. The budget bill defines abortion clinics as “prohibited entities” for Medicaid if they hit the aforementioned reimbursement threshold and perform abortions as of 1 October.\nDuring negotiations for the bill, when the “defund” period was 10 years, PPFA’s accreditation board informed affiliates about new waivers to seek approval to cease providing abortions; doing so may allow them to remain in Medicaid. It’s not known if any affiliates have submitted such waivers after the one-year provision was signed into law, but some are changing their billing practices, such as in Ohio.\nOther affiliates, meanwhile, have said they are back to processing Medicaid insurance claims as they typically would following the preliminary injunction. Planned Parenthood of Wisconsin’s chief strategy officer, Michelle Velasquez, told NPR that the judge’s 28 July ruling “means that there is no doubt about whether or not we can provide that care” to patients with Medicaid.\nPlanned Parenthood of the Rocky Mountains and Planned Parenthood of Maryland confirmed to the Guardian that they had resumed billing the health insurance program.\nSome are proceeding with caution. As of Thursday, Planned Parenthood of Orange and San Bernardino Counties in California had a notice on its website saying that Planned Parenthood “has been blocked” from receiving Medicaid funds.\nWhen contacted for comment, a spokesperson said: “PPOSBC is in the process of carefully resuming its billing for California Medi-Cal services it has provided since the defunding provision was passed, tracking all legal and regulatory updates from the court and the state, and modifying its approach as changes occur to ensure ongoing compliance with currently applicable law.”"
    }
  ],
  "argos_summary": "Liana Davis, a Texas woman, has filed a federal wrongful death lawsuit against Christopher Cooprider, who allegedly slipped abortion pills into her drink without her consent, and the telemedicine service Aid Access, which provided the pills. The lawsuit claims Cooprider pressured Davis to abort after she revealed her pregnancy and violated multiple laws, including the federal Comstock Act. This case is notable as it marks the first instance of a woman suing over being administered abortion pills against her will, amidst a broader legal landscape where anti-abortion advocates are increasingly targeting abortion pill access.",
  "argos_id": "EDE2K95EW"
}