{
  "url": "https://www.cbsnews.com/minnesota/news/minneapolis-trans-equity-summit-2025/",
  "authorsByline": "By\n                        \n              \n                            \n          \n            \n                Nick  Lunemann\n            \n\n            \n              \n                \n                  \n                \n              \n\n              \n                                  \n                    \n                  \n                \n                \n                  Nick  Lunemann\n\n                                      Multi-Skilled Journalist\n                                  \n              \n\n                              \n                  Nick Lunemann is a multi-skilled journalist for WCCO-TV.\n                \n              \n              Read Full Bio\n            \n          \n\n          \n            Nick  Lunemann",
  "articleId": "62fa2b0996674881bbb5229bece41d04",
  "source": {
    "domain": "cbsnews.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/08/11/469b2d12-b3c2-40fc-afd8-100700484da3/thumbnail/620x350/493fb0c1e69aae6448f85b6c308e7bbd/5p-pkg-trans-equity-summit-wcco8h4f-00-01-0923.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T17:28:29-05:00",
  "addDate": "2025-08-11T22:50:39.502007+00:00",
  "refreshDate": "2025-08-11T22:50:39.502008+00:00",
  "score": 1.0,
  "title": "Minneapolis Trans Equity Summit provides \"safe space\" as rights rolled back, debated nationwide",
  "description": "Organizers said the summit is built with the communities it serves, with sessions on legal rights, health care access and ways to build supportive networks in Minnesota.",
  "content": "The City of Minneapolis hosted its annual Trans Equity Summit on Monday at the McNamara Alumni Center, bringing together transgender, nonbinary and gender expansive residents for a day of workshops, performances and a resource fair.\n\nOrganizers said the summit is built with the communities it serves, with sessions on legal rights, health care access and ways to build supportive networks in Minnesota.\n\n\"I feel like the Trans Equity Summit is important because it is things that are important to the trans community, done by the trans community,\" said Florence Addams, who goes by Flo.\n\nThe program also honored Minneapolis City Council Member Andrea Jenkins for her leadership. Performers took the stage during a midday celebration that organizers described as an expression of trans joy.\n\nAddams called the summit \"absolutely a safe space,\" adding that it shows what happens \"when you just allow trans people to exist.\"\n\n\"Our communities have really experienced a legacy of discrimination and violence,\" said Shor Salkas, the city's LGBTQIA+ equity manager. \"Equity is making sure our communities have what they need to thrive.\"\n\nSalkas said the broader goal is simple.\n\n\"We really love and care and support each other, and that is what we are going to keep doing, especially when it is hard,\" Salkas said.\n\nCity leaders said they aim to connect attendees with resources year-round",
  "medium": "Article",
  "links": [
    "https://www.cbsnews.com/team/Nick-Lunemann/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Minneapolis Trans Equity Summit",
      "weight": 0.10710159
    },
    {
      "name": "Trans Equity Summit",
      "weight": 0.10312528
    },
    {
      "name": "Minneapolis City Council Member Andrea Jenkins",
      "weight": 0.08836601
    },
    {
      "name": "Minneapolis City Council",
      "weight": 0.08352521
    },
    {
      "name": "safe space",
      "weight": 0.08235389
    },
    {
      "name": "trans people",
      "weight": 0.08161299
    },
    {
      "name": "trans joy",
      "weight": 0.077167474
    },
    {
      "name": "Shor Salkas",
      "weight": 0.07493992
    },
    {
      "name": "legal rights",
      "weight": 0.07224145
    },
    {
      "name": "health care access",
      "weight": 0.07086044
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "General"
    }
  ],
  "taxonomies": [
    {
      "name": "/People & Society/Other",
      "score": 0.96044921875
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Discrimination & Identity Relations",
      "score": 0.71923828125
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.6572265625
    },
    {
      "name": "/News/Local News",
      "score": 0.6220703125
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Other",
      "score": 0.53466796875
    }
  ],
  "sentiment": {
    "positive": 0.50558835,
    "negative": 0.13998611,
    "neutral": 0.35442552
  },
  "summary": "The City of Minneapolis hosted its annual Trans Equity Summit, which includes workshops, performances, and a resource fair. The summit is designed to provide a safe space for the trans, non-gender, and non-sexuality-based population. It also included a recognition of Minneapolis City Council Member Andrea Jenkins. The goal is to connect attendees with resources year-round.",
  "shortSummary": "The City of Minneapolis hosted its annual Trans Equity Summit, focusing on supporting transgender communities through workshops, performances, and resource fairs, highlighting ongoing support and collaboration efforts.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "1a8564d97ef34fc99fc003e120a2f824",
  "places": [
    {
      "osmId": "86133533",
      "road": "Southeast Oak Street",
      "city": "Minneapolis",
      "county": "Hennepin County",
      "state": "Minnesota",
      "postcode": "55455",
      "country": "United States",
      "countryCode": "us",
      "amenity": "McNamara Alumni Center",
      "neighbourhood": "Prospect Park - East River Road",
      "coordinates": {
        "lat": 44.97521905,
        "lon": -93.22787501329739
      }
    }
  ],
  "scraped_sources": [
    {
      "url": "https://www.cbsnews.com/team/Nick-Lunemann/",
      "text": "Minneapolis summit provides resources for trans community\nOrganizers said the summit is built with the communities it serves, with sessions on legal rights, health care access and ways to build supportive networks in Minnesota.\nBorn and raised on a ranch in Casper, Wyoming, Nick has always had a deep appreciation for the common man's story. He's often heard saying \"Everyone has a story, even the ones who don't know it.\" A student of Creative Writing at the University of Wyoming (Go Pokes), Nick began his career in broadcasting working for KCWY13 in Casper as a production assistant in his teens. During his time there, he worked his way up to being a News Photographer and eventually a Multimedia Journalist. A need for a change of scenery led him to Fort Myers, Florida at the CBS affiliate to expand his experience in his career amongst different cultures. Nick made his way to Minnesota to be closer to family who reside in central Minnesota. Since joining the WCCO team in 2017, Nick has felt right at home in the Twin Cities as well as the north woods of Minnesota. He enjoys Norse mythology, rodeos, movies and sports, mostly the Vikings (SKOL!). When not telling stories, Nick enjoys 3D printing, exploring small towns and traveling the world.\nOrganizers said the summit is built with the communities it serves, with sessions on legal rights, health care access and ways to build supportive networks in Minnesota.\nMendota Heights, Minnesota, is now part of a state pilot program using speed cameras. The goal? Get drivers to slow down without relying on traffic stops.\nOfficials say someone stole the bronze bust of Olympic gymnast Suni Lee last week from Phalen Regional Park in St. Paul, Minnesota. On Monday, police confirmed they had pulled the granite plaque from a nearby lake.\nIn Plymouth, a number of maple trees have already had leaves turn to the familiar yellow, orange and red colors associated with the autumn months.\nAfter Xcel Energy worked to restore power to a majority of customers who lost electricity during Sunday night's severe weather across Minnesota, Monday night's storms caused another spike in outages.\nThe Minneapolis Park and Recreation Board says beaches at Bde Maka Ska and Lake Hiawatha are among those affected.\nAfter 37 years in St. Paul's skyway system, Pino's Pizzeria was forced to shut its doors this spring when the building was condemned. But this week, the family-run business reopened just across the street, with a new space, a renewed energy and the same old soul.\nA combination of major road closures, rail maintenance and a high-attendance music festival is creating a perfect storm of traffic and transit delays in the Twin Cities.\nSydney Nelson, assistant manager at Blueberry Fields of Stillwater said recent weather extremes have made it harder for the bushes to produce as they typically do.\nGeorge Johnson discovered a century-old Gold Medal Flour ad hidden beneath layers of wood and weather.\nThe Minnesota Vikings are taking their show overseas this season, twice. The team has played in London before, but Ireland will be a first.\nA pair of Minnesota veterans graduated from a unique music program Monday afternoon, walking away with new skills and new guitars.\nThe University of Minnesota's Board of Regents on Wednesday approved next year's operating budget, which features tuition hikes of up to 7.5% and a 7% cut to academic programs.\nThe University of Minnesota is proposing tuition hikes of up to 7.5% and cuts to academic programs for the next fiscal year as it navigates what it calls \"unprecedented challenges facing higher education.\"\nIt's that time of year when cottonwood seeds begin floating through the air like summer snow, and HVAC professionals say they're more than just a seasonal nuisance."
    }
  ],
  "argos_summary": "The City of Minneapolis held its annual Trans Equity Summit, focusing on the needs of transgender, nonbinary, and gender expansive residents through workshops, performances, and a resource fair. The event emphasized community-driven sessions on legal rights and healthcare access, while honoring City Council Member Andrea Jenkins for her leadership. Organizers highlighted the importance of creating a safe space for the trans community and fostering supportive networks to combat discrimination and promote equity.",
  "argos_id": "EI7PP4XFM"
}