{
  "url": "https://nypost.com/2025/08/11/opinion/washington-dc-has-itself-to-blame-for-trumps-police-takeover/",
  "authorsByline": "Rich Lowry",
  "articleId": "61b54e059fe148bf8b88cbd3d7c27b0f",
  "source": {
    "domain": "nypost.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://nypost.com/wp-content/uploads/sites/2/2025/08/newspress-collage-ltuo2vw24-1754953662690.jpg?quality=75&strip=all&1754939433&w=1024",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T23:37:55+00:00",
  "addDate": "2025-08-11T23:39:46.994112+00:00",
  "refreshDate": "2025-08-11T23:39:46.994114+00:00",
  "score": 1.0,
  "title": "Washington, DC has only itself to blame for Trump’s law-and-order takeover",
  "description": "The bumbling local government’s failures means that Washington, DC, has never been a worthy seat for the world’s greatest and most powerful nation.",
  "content": "At its best, Washington, DC, is a city of grandeur, of iconic monuments and world-historical centers of power.\n\nAt its worst, it’s a harrowing place where a 14-year-old could steal your Hyundai.\n\nThe confluence of these two truths in the terrible early-morning beating of the DOGE employee Edward Coristine, known by his sobriquet “Big Balls,” has prompted President Donald Trump to federalize the DC police and deploy the National Guard.\n\nThe software engineer played a significant role in the frenetic push to reform the federal government that dominated the beginning of Trump’s second term and, by virtue of being in the wrong place at the wrong time (and protecting a young woman), was violently attacked by teenagers within two miles of the White House.\n\nThe metropolitan government of Washington has never been worthy of the seat of government of the greatest and most powerful nation that has ever existed.\n\nIt’s consistently been an embarrassment and, for decades now, has tolerated — and, worse, created the conditions for — disorderly and dangerous streets.\n\nThe late historian Fred Siegel wrote how “social license and economic restrictions,” what he calls “the two halves of sixties liberalism,” drained cities like Washington, DC, of their vitality.\n\nOver-regulated and inefficient, they were saddled by a “state-supported economy of social workers.”\n\nOn top of this, in the 1970s, DC experienced “black nationalism in power,” especially in the person of the catastrophic, long-time mayoralty of Marion Barry.\n\nThe federal government had to put a financial control board in charge in the 1990s to bring the District back from the brink of bankruptcy.\n\nIndeed, in the scheme of things, Trump’s intervention is more the norm than the exception in DC’s history.\n\nIn the 19th century, Congress governed the district via committees, before trying home rule in 1871 and quickly pulling back after the district was — yes — financially mismanaged.\n\nDC has had home rule since 1973, with the financial board exercising significant power from 1995 to 2001.\n\nThe district is better off now than in the bad old days of the 1990s, but remains beset by a soft-minded progressivism on matters of law and order that is an ongoing threat to public safety.\n\nAs usual, Trump is opting for the sledgehammer over the scalpel.\n\nStill, his indictment of DC for allowing lawless young people to blight the city is accurate.\n\nBut, the critics object, violent crime is falling in Washington!\n\nYes, it is, although from an unacceptably high level.\n\nAs of 2024, DC had the fourth-highest homicide rate of all major US cities and a higher homicide rate than all 50 states.\n\nAs Charles Lehman of the Manhattan Institute points out, its homicide rate for young black men has been above the national average for decades now.\n\nThe killings overwhelmingly involve young black men who have already been entangled in the criminal-justice system, with substantial rap sheets and often prison time.\n\nLehman cites a report by the National Institute for Criminal Justice Reform that found about “500 identifiable people” are in this category, and account for 60% to 70% of all the gun violence in the city.\n\nThe carjackings, meanwhile, tend to be carried out by minors.\n\nAccording to Lehman, DC needs more cops who are more active making stops and arrests, as well as more prosecutions.\n\nIt also should be targeting the relatively small group of people most prone to violence, and the city’s gangs.\n\nAll of this, coupled with cleaning up homeless encampments, could continue the recent favorable crime trends and make the city feel like a better, safer place.\n\nIt’s probably too much to ask Washington, DC’s government to meet the soaring, implicit standard of its most famous buildings.\n\nBut not having to fear roving bands of young thugs would be a step in the right direction.",
  "medium": "Article",
  "links": [
    "https://nypost.com/2025/08/05/opinion/dems-furious-at-texas-redistricting-need-to-look-in-the-mirror/",
    "https://nypost.com/2025/08/11/us-news/trump-federalizing-dc-police-deploying-national-guard-in-capital-crime-crackdown/",
    "https://nypost.com/privacy",
    "https://nypost.com/2025/08/11/us-news/us-military-preparing-to-surge-national-guard-troops-to-washington-dc-report/",
    "https://nypost.com/2025/08/01/opinion/80-years-ago-the-a-bomb-saved-countless-lives-but-now-we-must-to-defend-against-nukes/",
    "https://nypost.com/terms",
    "https://nypost.com/2025/08/07/us-news/trump-putting-more-feds-on-dc-streets-in-response-to-out-of-control-youth-violence/",
    "https://email.nypost.com/",
    "https://nypost.com/2025/08/05/us-news/trump-threatens-federal-takeover-of-dc-if-capital-doesnt-get-its-act-together/",
    "https://nypost.com/2025/08/06/opinion/dc-crime-is-out-of-control-a-federal-takeover-could-be-the-only-solution/",
    "https://nypost.com/2025/08/08/opinion/trumps-right-about-the-census-but-rushing-one-is-worse/",
    "https://nypost.com/2025/08/05/us-news/ex-doge-staffer-nicknamed-big-balls-left-bloodied-after-savage-dc-carjacking-attempt-by-10-juveniles/"
  ],
  "labels": [
    {
      "name": "Opinion"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "DC",
      "weight": 0.07783898
    },
    {
      "name": "young black men",
      "weight": 0.074735515
    },
    {
      "name": "lawless young people",
      "weight": 0.07145544
    },
    {
      "name": "young thugs",
      "weight": 0.06362604
    },
    {
      "name": "President Donald Trump",
      "weight": 0.063453496
    },
    {
      "name": "Donald Trump",
      "weight": 0.06310854
    },
    {
      "name": "cities",
      "weight": 0.06224773
    },
    {
      "name": "Trump",
      "weight": 0.060196113
    },
    {
      "name": "Washington",
      "weight": 0.054026864
    },
    {
      "name": "government",
      "weight": 0.05312946
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.9951171875
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.98291015625
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.416259765625
    },
    {
      "name": "/News/Politics/Campaigns & Elections",
      "score": 0.369384765625
    }
  ],
  "sentiment": {
    "positive": 0.047973644,
    "negative": 0.7822354,
    "neutral": 0.16979094
  },
  "summary": "The beating of DOGE employee Edward Coristine, known as \"Big Balls,\" has led President Donald Trump to federalize the DC police and deploy the National Guard. This move follows a trend of law-and-order infighting within Washington, DC. The city has been criticized for being overregulated and inefficient, leading to a disorderly and dangerous street. Critics argue that violent crime is falling, but DC still has the highest homicide rate of all major US cities and a higher homicide rate than all 50 states.",
  "shortSummary": "Washington, DC, is a city of grandeur but a dangerous place plagued by violent crime and under-regulation, prompting President Donald Trump's intervention to address it.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "8f2790de544248d8867f5eb43df1356b",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://nypost.com/2025/08/05/opinion/dems-furious-at-texas-redistricting-need-to-look-in-the-mirror/",
      "text": "Democrats howling at Texas redistrict push should take a look in the mirror\nLet’s take a tour of the 13th Congressional District in Illinois.\nIt starts in East St. Louis and then moves steadily north.\nBy the time it gets to Springfield, home of Abraham Lincoln, about 90 miles away, it takes a sharp turn to the east, reaching Decatur and finally Champaign, itself about 80 miles away from Springfield.\nIt’s a jagged, narrow strip of territory with no obvious rhyme or reason as it traverses six counties.\nIt’s less a congressional district than a road trip, and bears a resemblance to the original gerrymander, a long, salamander-like state Senate district in Massachusetts in 1812.\nThe only point of the new 13th District lines, fashioned in the redistricting after the 2020 Census, was to gather together far-flung Democrats to create another Democratic congressional district.\nMission accomplished: The 13th went from being a competitive district long held by a Republican to flipping to the Democrats in 2022.\nOverall, Illinois lost one district after the 2020 Census and managed to write lines that changed the congressional ratio from a 13-5 Democratic advantage to a 14-3 Democratic advantage.\nThe political analysis website 538 called the new map “the worst gerrymander in the country drawn by Democrats.”\nThis makes it especially inapt that a contingent of Texas Democrats fleeing the Lone Star State to try to stop what they consider unfair new congressional boundaries found a safe harbor in Illinois.\nNext time, their travel agent should do a hypocrisy check before booking a destination.\nIllinois Gov. JB Pritzker welcomed the self-exiling Democrats and hailed their courage.\nHe told them that he and other top Democrats in the state were pleased “to stand in solidarity with you and send a clear message to all Americans.”\nHis conscience showed no sign of being pricked by the fact that he signed into law the redistricting that saw Republicans in 2022 win nearly 44% of the popular vote in Illinois congressional races — and only 18% of the congressional seats.\nA special session of the Texas Legislature is considering new lines that could net Republicans another five House seats.\nGov. Greg Abbott has cited a Department of Justice letter saying that some of the current districts need to be redrawn because they represent unconstitutional racial gerrymandering. (The Biden Justice Department had been fighting Texas because, in its view, the current lines didn’t reflect enough racial gerrymandering.)\nThe Supreme Court is taking up a Louisiana case that should clarify the extent to which states can consider race in drawing so-called majority-minority districts.\nIn the meantime, the partisan effect of the new Texas lines before the 2026 midterms is unmistakable: If Republicans were likely to lose five seats from this redistricting, there’s no doubt that the state’s Republican governor and Republican legislature wouldn’t be undertaking it.\nDrawing district lines is an inherently political enterprise, and parties tend to give themselves the best of it.\nWhen Democrats controlled the Texas Legislature, they maintained congressional lines in their favor.\nIt wasn’t until 2002, when Republicans won the statehouse for the first time since Reconstruction, that the GOP could redraw the congressional map — and Republicans subsequently won a majority of Texas congressional seats in 2004, also for the first time since Reconstruction.\nSince Democrats gerrymander too, they have limited options for retaliating against Texas.\nPritzker says he may redraw his state’s lines, but this would require gerrymandering on top of his current gerrymander.\nGov. Gavin Newsom is making similar noises, but the California map is already tilted toward Democrats: Republicans won nearly 40% of the congressional vote in the Golden State in 2024, but only about 17% of the seats.\nIf the Texas plan goes through and all else remains equal, the Lone Star State will have about the same partisan skew as California.\nLess gerrymandering would be better than more, but Democrats like Pritzker, who blessed his state’s meandering 13th District, have no standing to make the case.\nTwitter: @RichLowry"
    },
    {
      "url": "https://nypost.com/2025/08/11/us-news/us-military-preparing-to-surge-national-guard-troops-to-washington-dc-report/",
      "text": "US military preparing to surge National Guard troops to Washington, DC, to fight local crime and youth violence: report\nThe US military is preparing to activate hundreds of National Guard troops to Washington, DC, as a part of President Trump’s sweeping federal crackdown on crime in the nation’s capital, according to authorities.\nTrump has yet to make a final decision about the activation of federal troops, but the National Guard is readying to deploy them, two US officials with knowledge of the operation confirmed to Reuters.\nThe preparation comes as 120 FBI agents from across the country have already begun patrolling DC streets overnight and backing up area cops at carjacking hot spots, despite many lacking local patrol work training, the Washington Post reported.\n“Be prepared! There will be no ‘MR. NICE GUY.’ We want our Capital BACK,” Trump wrote in a post Sunday on Truth Social ahead of a planned White House press conference Monday morning about the city’s cleanliness and general condition.\nThe possible order follows Trump’s “Making the District of Columbia Safe and Beautiful” executive order signed on March 28, which established a task force dedicated to fighting crime and reducing illegal immigration in the city.\n“The Homeless have to move out, IMMEDIATELY. We will give you places to stay, but FAR from the Capital. The Criminals, you don’t have to move out. We’re going to put you in jail where you belong,” Trump wrote in the social media post — comparing the action to his illegal immigration crackdown at the border.\n“The Mayor of D.C., Muriel Bowser, is a good person who has tried, but she has been given many chances, and the Crime Numbers get worse, and the City only gets dirtier and less attractive,” Trump said in a different post Sunday.\nBowser has since fought back on Trump’s characterization of the city.\n“If the priority is to show force in an American city, we know he can do that here,” Bowser said on MSNBC Sunday morning. “But it won’t be because there’s a spike in crime.”\nViolent crime is down 26% compared with this time in 2024, according to DC police data, and there have been roughly 20% fewer juvenile arrests this year, the Washington Post reported.\nHowever, the White House isn’t backing down — noting that the city’s “been plagued by petty and violent crime for far too long,” press secretary Karoline Leavitt said in a statement.\nUS Park Police arrested more than half a dozen perps in the capital on charges including possession of stolen firearms and illicit drugs as part of a federal crackdown launched by the Trump administration Thursday to clean up the nation’s capital.\nEight culprits were arrested in the surge and two handguns were confiscated from offenders with prior felony convictions, Park Police Fraternal Order of Police chairman Kenneth Spencer told The Post Friday.\nAt least 30 “fraudulent oxycodone pills” — which appeared to be fentanyl — were also seized, along with 210 grams of crack cocaine, 600 grams of marijuana, 64 grams of hashish oil and cash with a total value of $3,600, Spencer added.\nThe show of force was in part sparked by the beating of a 19-year-old former Department of Government Efficiency (DOGE) staffer who was bloodied by a mob of 10 minors last Sunday as he thwarted a carjacking attempt in the nation’s capital, according to DC police.\nEdward Coristine, whose LinkedIn handle earned him the nickname “Big Balls” at DOGE, was with a woman near downtown DC when he saw the group of juveniles approach their car and “make a comment about taking the vehicle.”\nTrump and Coristine’s former boss Elon Musk shared a photograph of the aftermath of the assault on Coristine early Tuesday afternoon, showing the former DOGE staffer sitting on the ground, bloodied and with his ripped shirt barely hanging on his body.\nCritics and residents have fired back at Trump’s sweeping crackdown and removal of the homeless as inhumane.\n“That money could be better spent getting folks housing and support,” Jesse Rabinowitz, campaign and communications director at the National Homelessness Law Center, told the Washington Post.\nIt is not yet clear what exactly federal troops would do, but they could be deployed to protect federal agents or even carry out administrative tasks to free up law enforcement, officials said.\nWith Post wires"
    },
    {
      "url": "https://nypost.com/2025/08/01/opinion/80-years-ago-the-a-bomb-saved-countless-lives-but-now-we-must-to-defend-against-nukes/",
      "text": "Eighty years ago, in one of the most consequential understatements of all time, Emperor Hirohito told the people of Japan that “the war situation has developed not necessarily to Japan’s advantage.”\nHe was originally going to say that “the war situation has deteriorated day by day,” but that was considered too strong — even after the United States had dropped the atom bomb on two Japanese cities.\nWhether it was justified to use the bomb constitutes one of the most controversial historical questions in American history, but it was clearly the right call.\nIt’s nice to think that Imperial Japan would have decided to surrender on the same timeline without Hiroshima and Nagasaki, but there is no evidence of it.\nThe Japanese had a strong strategic commitment to defeating or inflicting a severe blow against a prospective American invasion.\nThen, they’d have the leverage for a negotiated peace on favorable terms.\nThe A-bomb scuppered these plans.\nCritics of President Harry Truman’s decision have suggested it was the start of a Soviet invasion at the end that convinced Imperial Japan to capitulate.\nOr, if only we’d offered more temperate terms rather than demanding unconditional surrender, Tokyo would have been much more reasonable.\nIn his definitive account, “Downfall: The End of the Imperial Japanese Empire,” Richard Frank dismantles these notions, noting that nothing in the record supports them.\n“Not only has no relevant document been recovered from the wartime period, but none of them,” he writes of Japan’s top leaders, “even as they faced potential death sentences in war-crimes trials, testified that Japan would have surrendered earlier upon an offer of modified terms, coupled to Soviet intervention or some other combination of events, excluding the use of atomic bombs.”\nIn his message, Hirohito said that “the enemy has begun to employ a new and cruel bomb, causing immense and indiscriminate destruction, the extent of which is beyond all estimation.”\nThe Japanese prime minister at the end of the war, Kantarō Suzuki, recalled in December 1945 that the war cabinet didn’t believe the Americans could win the war based on air power alone.\nThen, the atomic bomb demonstrated that, to the contrary, the United States “need not land,” and “so at that point they decided that it would be best to sue for peace.”\nEven after Hiroshima and Nagasaki, there were divisions in the war cabinet about surrender, which is why the intervention of the emperor was necessary.\nThere was still resistance after he made his decision and a coup attempt.\nThe end of the war made unnecessary a US invasion that could have meant hundreds of thousands of American casualties; saved millions of Japanese lives that would have been lost in combat on the home islands and to starvation; cut short the brief Soviet invasion (that alone accounted for hundreds of thousands of Japanese deaths); and ended the agony that Imperial Japan brought to the region, especially a China that suffered perhaps 20 million casualties.\nBequeathed with untold power by the new weapon, it is telling that we used the bomb to bring an end to a terrible war and didn’t use it to dominate Europe, or for other cynical purposes.\nInstead, our nuclear umbrella became part of a security arrangement that endured for decades, defending the free world from the Soviets and preventing the re-occurrence of world war.\nNow, with further nuclear proliferation in prospect (although thankfully delayed in Iran) and the chances of great power conflict rising, it is becoming more likely that nuclear weapons will be used again.\nThis is why President Donald Trump’s vision of a Golden Dome to protect the U.S. from missile attack is so important, and why we need a robust nuclear force to deter our enemies.\nEighty years ago, the atom bomb was the peacemaker in a horrific conflict that killed millions.\nNext time, it could be an instrument in the hands of an irrational regime, or rival nation bent on the destruction of American power.\nBeware.\nTwitter: @RichLowry"
    },
    {
      "url": "https://nypost.com/2025/08/05/us-news/trump-threatens-federal-takeover-of-dc-if-capital-doesnt-get-its-act-together/",
      "text": "Trump threatens federal takeover of DC if capital ‘doesn’t get its act together’ after ex-DOGE staffer ‘Big Balls’ attacked by mob of minors\nWASHINGTON — President Trump again threatened Tuesday to bring the District of Columbia under federal control due to “out of control” crime in the nation’s capital.\n“Local ‘youths’ and gang members, some only 14, 15, and 16-years-old, are randomly attacking, mugging, maiming, and shooting innocent Citizens, at the same time knowing that they will be almost immediately released,” Trump posted in a lengthy statement on Truth Social.\nThe president urged city officials to begin charging minors as adults for violent crimes beginning at age 14 — and “lock them up for a long time”.\n“If D.C. doesn’t get its act together,” Trump wrote, “we will have no choice but to take Federal control of the City.”\nThe president included a picture of a young man sitting on the ground with blood streaming down his face after being apparently assaulted by teenagers.\nFormer Trump ally Elon Musk said on X that a Department of Government Efficiency (DOGE) employee had recently rushed to help a woman who was in danger of being assaulted in her car — only to be beaten up by the gang of teenagers himself.\nA Metropolitan Police Department incident report obtained by The Post identified the ex-DOGE worker as Edward Coristine, whose LinkedIn handle earned him the nickname “Big Balls.”\nCoristine and a woman were near downtown DC on Sunday morning when a group of juveniles approached them and made “a comment about taking the vehicle,” according to the report.\n“At that point, for her safety, [Coristine] pushed his significant other … into the vehicle and turned to deal with the suspects,” the dramatic report continues.\n“The suspects then began to assault [Coristine],” the ex-DOGE staffer told officers, who rolled up on the scene at the same time he was being attacked.\nDC police arrested two youths related to the assault.\nWashington’s juvenile arrest rate is nearly double the national average, with a mean of 2,235 such bookings per year between 2016 and 2022.\nLocals regularly report feeling unsafe, both on the metro and on the streets, watching for groups of teens who have been known to threaten passerby and engage in crime.\n“We see a surge of young people engaging in serious crime. We are seeing kids as young as nine and ten getting involved in carjackings,” District At-Large Councilmember Robert White Jr. said during a town hall discussion in February 2024.\nDC Mayor Muriel Bowser attempted to address the rising juvenile crime concerns by imposing an 11 p.m. curfew for those under 18 — with some areas imposing restrictions as early as 7 p.m.\nTrump initially threatened to regain control of DC back in February, telling reporters the feds were needed to help bring down crime and homelessness.\n“I think we should take over Washington, DC — make it safe,” he told reporters on Air Force One at the time.\nThe District was granted the power to elect a mayor and city council by the 1973 Home Rule Act, but Congress does still exercise considerable authority over the inhabitants.\nIn 2023, Congress passed — and then-President Joe Biden approved — a law blocking a revision to the DC criminal code that would have lowered maximum penalties for certain violent crimes, including carjacking and armed robbery.\nOn July 24, Trump signed an executive order urging states and cities to place homeless people suffering from drug addiction and mental illness into “treatment centers.”\nTrump has made similar threats against New York City should democratic socialist Zohran Mamdani win the November mayoral election.\n“If a communist gets elected to run New York, it can never be the same,” he told The Post during a cabinet meeting last month.\n“But we have tremendous power at the White House to run places where we have to.”"
    },
    {
      "url": "https://nypost.com/terms",
      "text": "Last Updated: January 7, 2025\nPlease read these TERMS OF USE (“Terms”) carefully. Your access to and/or use of the Services (as defined below) constitutes your legally binding agreement to be bound by these Terms.\nTHESE TERMS CONTAIN A MANDATORY ARBITRATION CLAUSE AND A WAIVER OF CLASS ACTION CLAUSE. PLEASE REFER TO AND READ SECTION 19 OF THESE TERMS.\nThese Terms govern your use of the websites, applications and software operated by NYP Holdings, Inc. (“Company”, “we”, “us” or “our”), publisher of the New York Post, to which these Terms are linked or referenced to, including all content, features and functionality, and related services such as emails, newsletters, sweepstakes and promotions (collectively, the “Services”). These Terms apply whether you are accessing the Services via a personal computer, wireless or mobile device, or any other technology or device (each, a “Device”). These Terms do not cover other services, websites or any corresponding content, features, and activities made available by any other company or third party, unless specifically stated. If you do not agree to these Terms, you may not access or use any portion of the Services.\nThese Terms apply to all users of the Services, whether or not you have registered for one or more of the Services, and by using the Services you agree to comply with these Terms and any additional terms and conditions that we provide to you in connection with your use of or access to same (“Additional Terms”). The Services may also provide rules of participation for certain activities within the Services, including, without limitation, contests, sweepstakes, membership programs, and other initiatives (“Rules”). The New York Post Privacy Notice (the “Privacy Notice”), the Additional Terms and the Rules together form a part of these Terms, and are incorporated herein by reference.\nWe reserve the right, at any time and from time to time, temporarily or permanently, in whole or in part, to modify, suspend or discontinue the Services; charge fees in connection with the Services; modify and/or waive any fees charged in connection with the Services; and/or make available opportunities to some or all users of the Services. You agree that neither we nor any of our affiliates shall be liable to you or to any other person for any modification, suspension or discontinuance of the Services or any component thereof.\nIf you are having any trouble accessing these Terms or the Services, please contact us at 800-552-7678 or refer to our support page at https://nypost.com/customer-service/ or send an email to help@nypost.com.\n1. Term. These Terms shall remain in full force and effect while you use the Services. You may terminate your use of or registration for the Services at any time, for any reason, and Company may terminate your use of or registration to the Services at any time, for any or no reason, with or without prior notice or explanation, and without liability or obligation to you or any third party. These Terms shall continue to apply to your previous access and/or use of the Services after any such termination.\n2. Modifications. We may modify these Terms from time to time and at any time in our sole discretion. Changes to these Terms of Use will be effective immediately or, if required by law, 30 days after notice to you, which may be given by posting the updated Terms of Use on our Service. Your use of the Services after these changes are made is subject to the Terms as modified thereby, and if you use the Services after they become effective it will signify your agreement to be bound by the changes. We recommend that you check back frequently and review these Terms regularly so you are aware of the most current rights and obligations that apply to you. The Last Updated legend at the top of this page indicates when these Terms was last revised. Customer service representatives are not authorized to modify these Terms of Use, either verbally or in writing, and any such modification shall have no effect.\n3. Eligibility; Compliance. Use of the Services is limited to users 16 years of age and older. By using the Services, you represent and warrant that (a) you are 16 years of age or older and (b) your use of the Services does not violate any applicable law, rule or regulation. Certain features of the Services may be subject to heightened age and/or other eligibility requirements. If you provide information that is untrue, inaccurate, not current or incomplete, or Company suspects that such information is untrue, inaccurate, not current or incomplete, Company has the right to suspend or terminate your registration (in whole or in part) and refuse any and all current or future use of the Services (or any portion thereof), in our sole discretion, with or without notice to you, and without liability or obligation to you. Company is based in the United States and the Services are provided from the United States. Company makes no representation or warranty that the Services or the Content (as defined herein) are appropriate or available for use in other locations. If you use the Services from a jurisdiction other than the United States, you agree to do so at your own risk, and you are responsible for complying with any and all local laws applicable to your use of the Services.\n4. Proprietary Rights.\n4.1 As between you and Company, Company owns, solely and exclusively, all right, title and interest in and to the Services and all content, data and information (including associated metadata) contained and/or made available through the Services (“Content”), and all such Content is protected, without limitation, under U.S. Federal and State, as well as applicable foreign laws, rules, regulations and treaties. The term “Content” includes, without limitation, all audio/visual content, artwork, photographs, illustrations, graphics, logos, copy, text, computer code, software, music (including the musical compositions therein), data, user interfaces, visual interfaces, information, materials, and all copyrightable or otherwise legally protectable elements of the Services, including, without limitation, the design, selection, sequence, look and feel, and arrangement of the Services, and any copyrights, trademarks, service marks, trade names, trade dress, patent rights, database rights and/or other intellectual property and/or proprietary rights therein (including with respect to any content contained and/or made available in any advertisements or information presented to you via the Services). Unless the context clearly requires otherwise or we explicitly set forth in writing, the term “Services” includes “Content” as well.\n4.2 The Services are to be used solely for your non-exclusive, non-assignable, non-transferable, non-commercial and limited personal use and for no other purposes. No other uses are permitted or authorized. You may not exceed the limited rights and access provided to you under these Terms. You must not alter, delete or conceal any copyright, trademark, service mark or other notices contained on the Services, including, without limitation, notices on any Content you transmit, download, display, print, stream or reproduce from the Services. All rights not expressly granted to you hereunder are reserved to us and our licensors.\n4.3 Except as expressly authorized by Company, you shall not, nor shall you allow any third party (whether or not for your benefit or otherwise) to, frame, scrape, reproduce, modify, create derivative works from, display, perform, publish, distribute, disseminate, broadcast or circulate to any third party (including, without limitation, on or via a third-party website or platform) any Content without the express, prior written consent of Company or its owner if Company is not the owner. You shall not nor shall you make it possible for others to – access, collect, text or data mine any Content from the Services by automated means or any other method, whether directly or through an intermediary, intended to circumvent the prohibitions set forth in this Section 4 (e.g., robot, spider, script, service, software or any manual or automatic device, tool or process). For the avoidance of doubt, you shall not use any Content for any machine learning or artificial intelligence (AI) purposes, including, but not limited to, developing, building, training, fine tuning, or grounding or otherwise utilizing in any large language models (LLMs), machine learning tools, or generative AI systems.\n4.4 Any unauthorized or prohibited use of any Content may subject you to civil liability, criminal prosecution, or both, under applicable federal, state, local laws, or applicable foreign laws, rules, regulations and treaties. We require users to respect our copyrights, trademarks, other intellectual property rights, and all other rights specified in these terms, and shall enforce same. We likewise respect the intellectual property of others. If you believe that the Services contain elements that infringe your copyrights in your work, please follow the procedures set forth in Section 10 below. You may not access parts of the Services to which you are not authorized, or attempt to circumvent any restrictions imposed on your use of or access to the Services. For clarity, your use of our Services and Content is only permitted as expressly set forth in these Terms and your rights are not expanded, nor are any prohibitions modified or limited, in any way by our use or configuration of exclusionary protocols (e.g., the Robots Exclusion Protocol as implemented through robots.txt files).\n4.5 Requests for permission to reprint individual articles or webpages can be made by submitting a request here.\n5. User Registration. In order to access and use certain content, features, or functionality of the Services, we may require that you register for the applicable Services and have a unique username and password combination (“User Credentials”) and provide certain additional information, which may include, without limitation, your email address, legal name, country of residence, zip code, etc., and, for fee-based transactions and purchases offered by us, your physical address, telephone number(s), and applicable payment data and information (collectively, a “User Account”). You represent and warrant that all registration and account information you submit is truthful and accurate and you shall maintain and promptly update the accuracy of such information. Further, if you elect to become a registered user of the Services, you are responsible for maintaining the confidentiality of your User Credentials, and you shall be responsible and liable for any access to or use of the Services by you or any person or entity using your User Credentials, whether or not such access or use has been authorized by you or on your behalf, and whether or not such person or entity is your employee or agent, including, without limitation, any fee-based transactions. It is therefore critical that you do not share your User Credentials with anyone. You agree to immediately notify Company of any unauthorized use of your User Credentials or User Account, or any other breach of security. It is your sole responsibility to (a) control the dissemination and use of your User Credentials and User Account, (b) update, maintain and control access to your User Credentials and User Account, and (c) cancel your User Account on the Services. We reserve the right to deny access, use and registration privileges to any user of the Services if we believe there is a question about the identity of the person trying to access any account or element of the Services. Company shall not be responsible or liable for any loss or damage arising from your failure to comply with this Section 5.\n6. Personal Information. We respect your privacy and the use and protection of your personal information. In the course of your use of the Services, you may be asked to provide certain personal information to us. Our information collection and use policies with respect to the privacy of such personal information are set forth in the Privacy Notice. We encourage you to read the Privacy Notice, and to use it to help make informed decisions. You acknowledge and agree that you are solely responsible for the accuracy and content of personal information. The Privacy Notice is available at https://nypost.com/privacy/.\n7. Payment, Pricing, and Related Terms. You must be 18 years of age or older to make any purchase (e.g., subscriptions, one-time purchases, etc.) of the Services, Content (as defined herein) or any other product or service offered through the Services by us. If you are less than 18 years of age, and want to make any such purchase, please ask your parent or guardian to complete the purchase on your behalf. You hereby agree to pay in full the prices and fees (including, without limitation, all applicable taxes) for any purchases that are made using your User Account(s) or other information you supply to us via an authorized payment method at the time of purchase. Company or its designees reserves the right to change any and all prices for any Services and Content, for any reason. Purchases may be governed by Additional Terms. Purchases may also be controlled, handled, processed and/or fulfilled by third parties not affiliated with Company (a “Third-Party Processor”). Where a Third-Party Processor is responsible for controlling, handling, processing or fulfilling a purchase, all payment and other obligations regarding such purchase may be governed by the terms of use/service and privacy notice(s) of the Third-Party Processor. Accordingly, you should familiarize yourself with the applicable terms and policies imposed by any Third-Party Processor. Company makes no warranty, and accepts no liability for loss or damage whatsoever, relating to purchases with a Third-Party Processor and you are solely responsible for any and all transactions utilizing your information (personal, financial or otherwise) with a Third-Party Processor, including, but not limited to any and all fees and charges. Moreover, you acknowledge and agree that in the event a Third-Party Processor experiences a data breach that affects your information (personal, financial or otherwise), Company will in no way be liable or responsible to you for such breach.\n8. User Conduct.\n8.1 You are solely responsible for your conduct in connection with the Services. We want to keep the Services enjoyable for everyone and the use of the Services for unlawful or harmful activities is not allowed. While using the Services, you will not:\n| (a) | engage in or encourage conduct that would violate any applicable law, rule, regulation, judicial or government order or give rise to civil liability or violate or infringe upon any intellectual property, proprietary, privacy, moral, publicity or other rights of ours or of any other person or entity; |\n| (b) | submit, post, email, display, transmit or otherwise make available through the Services any material or take any action that is or is likely to be unlawful, harmful, threatening, abusive, tortious, defamatory, libelous, deceptive, fraudulent, invasive of another’s privacy or publicity rights, harassing, profane, obscene, vulgar or that contains explicit or graphic imagery, descriptions or accounts of excessive violence or sexual acts (including, without limitation, sexual language of a violent or threatening nature directed at another individual or group of individuals), contains a link to an adult website or is patently offensive, promotes racism, bigotry, hatred or physical harm of any kind against any group or individual; |\n| (c) | submit, post, email, display, transmit or otherwise make available through the Services any material that you do not have a right to make available under any law, rule or regulation or under contractual or fiduciary relationships (such as inside information, proprietary or confidential information learned or disclosed as part of employment relationships or under nondisclosure agreements), or otherwise creates a security or privacy risk for any other person or entity; |\n| (d) | engage in or encourage conduct that affects adversely or reflect negatively on Company, its affiliates, or parent company, the Services, our goodwill, name or reputation or causes duress, distress or discomfort to us or anyone else, or discourage any person or entity from using all or any portion, features or functions of the Services, or from advertising or becoming a supplier to us in connection with the Services; |\n| (e) | submit, post, email, display, transmit or otherwise make available through the Services any material that contains a software virus, worm, spyware, Trojan horse or other computer code, file or program designed to interrupt, impair, destroy or limit the functionality of any computer software or hardware or telecommunications equipment; |\n| (f) | use the Services for commercial or business purposes, including, without limitation, engaging in barter arrangements, pyramid schemes, advertising, marketing or offering goods or services or exploiting information or material obtained on, through or in connection with the Services, whether or not for financial or any other form of compensation or through linking with another website or service; |\n| (g) | modify, disrupt, impair, alter or interfere with the use, features, function, operation or maintenance of the Services or the rights or use or enjoyment of the Services by any other user; |\n| (h) | impersonate any person or entity or falsely state or otherwise represent your affiliation with a person, or entity; |\n| (i) | forge headers or otherwise manipulate identifiers in order to disguise the origin of any content transmitted on, through or in connection with the Services; |\n| (j) | solicit passwords or personal identifying information for commercial or unlawful purposes from other users; |\n| (k) | engage in spamming, flooding, harvesting of email addresses, other personal information or content, “spidering”, “screen scraping”, “phishing”, “database scraping”, or any other activity designed to text and/or data mine with the purposes of collecting user data, other information or Content; or |\n| (l) | modify, reverse engineer, decompile or disassemble any part of the Services, whether in whole or in part, or create any derivative works from any part of the Services, or encourage, assist or authorize any other person to do so. |\nCompany assumes no responsibility for monitoring the Services for inappropriate content or conduct. If at any time Company chooses in its sole discretion to monitor the Services, Company nonetheless assumes no responsibility for User Postings (as defined herein), assumes no obligation to modify or remove any User Postings, and assumes no responsibility for the conduct of any user. Company reserves the right to investigate and take appropriate legal action against anyone who, in Company’s sole discretion, violates, or is suspected of violating, this Section 8, including, without limitation, reporting you to law enforcement authorities. Further, you acknowledge, consent and agree that Company may access, preserve and disclose your account and registration information and any other content or information if required to do so by law or if based on a good faith belief that such access, preservation or disclosure is reasonably necessary to (a) comply with the law or legal process; (b) enforce these Terms; (c) respond to claims that any content or information violates the rights of any third party; (d) respond to your requests for customer or technical service; or (e) protect the rights, property or personal safety of Company, users or any third parties including acting in urgent circumstances.\n8.2 We do not accept any unsolicited ideas via the Services or otherwise from outside the company including without limitation suggestions about advertising or promotions, or merchandising of any products, additions to our services, or changes in methods of doing business. We may already be working on or may in the future work on a similar idea. This policy eliminates concerns about ownership of such ideas. If, notwithstanding this policy, you submit an unsolicited idea via the Services or otherwise, you understand and acknowledge that such idea is not submitted in confidence and we assume no obligation, expressed or implied, by considering it. You hereby grant Company an irrevocable, perpetual, world-wide license to use the idea and any associated intellectual property in any manner, in any medium now known or hereafter developed, without compensation to you.\n9. User Postings and Events.\n9.1 The Services may provide you and other users with an opportunity to participate in blogs, forums and other message, comment and communication features and may provide you with the opportunity to submit, post, email, display, transmit or otherwise make available comments, reviews, links, materials, ideas, opinions, messages and other content and information via the Services (each, a “User Posting”, and collectively, “User Postings”). You understand, acknowledge and agree that all User Postings are the sole responsibility of the person from which such User Postings originated and that you are solely and entirely responsible for the consequences of all User Postings that you submit, upload, post, email, display, transmit or otherwise make available, including without limitation as set forth in Section 8. You may not submit a User Posting is or may be construed as violating these Terms, including, without limitation, Section 8 above, or is deemed to be unacceptable to Company, as determined in Company’s sole discretion.\n9.2 User Postings do not reflect the views of Company, its affiliates or parent company, and you understand that by using the Services, you may be exposed to other people’s User Postings that could be offensive, indecent or objectionable. Company has the right, but not the obligation, to review any User Posting and to delete, remove, move, edit or reject, without notice to you, for any reason or for no reason whatsoever, any User Postings. Under no circumstances shall Company be liable in any way for User Postings, including, without limitation, errors or omissions in any User Postings, or any loss or damage of any kind incurred as a result of any User Postings submitted, uploaded, posted, emailed, displayed, transmitted or otherwise made available, nor shall Company have any obligation or liability to you or any third party for not removing any User Posting.\n9.3 In connection with all User Postings you submit, post, email, display, transmit or otherwise make available, you grant to Company the unrestricted, worldwide, non-exclusive, irrevocable, perpetual, fully paid-up and royalty-free right and license, in any form or format, on or through any media or medium and with any technology or devices now known or hereafter developed, in whole or in part, to host, cache, store, maintain, use, reproduce, distribute, display, exhibit, perform, publish, broadcast, transmit, modify, prepare derivative works of, adapt, reformat, translate, and otherwise exploit all or any portion of your User Posting on the Services and any other websites, channels, services, and other distribution platforms, whether currently existing or developed in the future, for any purpose whatsoever (including, without limitation, for any promotional purposes) without accounting, notification, credit or other obligation to you, and the right to license and sub-license and authorize others to exercise any of the rights granted hereunder to Company, in our sole discretion. For the avoidance of doubt, the rights, licenses and privileges described in these Terms and granted to Company shall commence immediately upon submission of your User Posting and shall continue thereafter perpetually and indefinitely, regardless of whether you use the Services as a registered user or not.\n9.4 Company does not acquire any title or ownership rights in the User Postings that you submit and/or make available, and Company’s sole right to utilize the User Postings is set forth in Section 9.3, above. After you submit, post, email, display, transmit or otherwise make available any User Posting, you continue to retain any such rights that you may have in such User Posting, subject to the rights, licenses and privileges granted herein. You also represent, warrant and covenant that (a) you own the User Posting posted by you or otherwise have the right to grant the rights, licenses and privileges described in these Terms and to perform and comply with all of the requirements set forth herein; (b) your submission, uploading, posting, emailing, displaying, transmission and/or making available of User Postings does not violate these Terms, any rights of any other party or entity, any of your obligations, any law, rule or regulation or infringe upon, misappropriate or violate any intellectual property, proprietary, privacy, moral, publicity or other rights of any party or entity; (c) you have the legal right and capability to enter into these Terms and perform and comply with all of its terms and conditions; and (d) you hold and shall continue to hold all the ownership, license, proprietary and other rights necessary to enter into, authorize, grant rights and perform your obligations under these Terms and shall pay for all royalties, fees, and any other monies owing to any person or entity by reason of your User Postings.\n9.5 The Services may provide you and other users with an opportunity to appear or participate in in-person and virtual events. If you participate in such events, Company may record your voice, image (both video and static), appearance, name, likeness, biographical information, and any statements you make verbally or in writing (your “Likeness and Statements”). You hereby grant to Company, as well as any third parties that Company may designate from time to time, the fully-paid, royalty-free, sublicenseable, irrevocable license to copy, display, perform, reproduce, make derivative works from, and otherwise use separately, or together, your Likeness and Statements, in whole or in part, in any and all media now known or hereafter developed, throughout the world, in perpetuity, for any lawful purpose, including, without limitation, in connection with (i) the subsequent broadcast, display, or dissemination of the events; and/or (ii) the promotion or advertising of Company or any such third party.\n10. Digital Millennium Copyright Act. If you are a copyright owner or an agent thereof and believe that any content on the Services infringes upon your copyrights, you may submit a notification pursuant to the Digital Millennium Copyright Act (“DMCA”) by providing our Designated Agent (as set forth below) with the following information in writing (see 17 U.S.C. 512(c)(3) for further details):\n- A physical or electronic signature of a person authorized to act on behalf of the owner of an exclusive right that is allegedly infringed;\n- Identification of the copyrighted work claimed to have been infringed, or, if multiple copyrighted works on the Services are covered by a single notification, a representative list of such works on the Services;\n- Identification of the material that is claimed to be infringing or to be the subject of infringing activity and that is to be removed or access to which is to be disabled, and information reasonably sufficient to permit us to locate the material;\n- Information reasonably sufficient to permit us to contact you, such as an address, telephone number, and e-mail address;\n- A statement that you have a good faith belief that use of the material in the manner complained of is not authorized by the copyright owner, its agent or the law; and\n- A statement that the information in the notification is accurate, and under penalty of perjury, that you are authorized to act on behalf of the owner of an exclusive right that is allegedly infringed.\nWritten notification of claimed infringement must be submitted to the following Designated Agent:\nNYP Holdings, Inc.\nCopyright Agent\nAttn. Legal Department\n1211 Avenue of the Americas\nNew York, NY 10036\nEmail Address of Designated Agent: dmca@nypost.com\nFor clarity, only DMCA notices should be sent to the Designated Agent and any other feedback, comments, requests for technical support, and other communications should be directed to Company customer service by sending an email to help@nypost.com. The Company has a policy of terminating repeat infringers’ access to its Services in appropriate circumstances.\n11. Certain Services Terms and Requirements.\n11.1 Availability. You acknowledge that Company licenses some or all of the Content under agreement from third parties, and that Company may add, delete or disable Content, and/or add, delete, disable or modify some or all of the Services, at its sole election, and you acknowledge: (a) that you may no longer be able to use the Services to the same extent, or at all, as prior to such change or discontinuation, and (b) that Company shall have no obligation or liability to you in such case. In no event shall Company be liable for the removal of, or disabling of access to, any Content, the Services, materials or any features or portions of the Services. Company may also impose limits on the use of or access to certain features or portions of the Content or the Services, in any case and without notice or liability to you.\n11.2 Device Requirements and Terms. In order to access and use the Services and the Content, you may be required to use Device(s) and other technology meeting certain system, configuration and other requirements established by Company, its content partners, licensors and other third parties (e.g., storefront, network, website, platform and other operators, etc.) (collectively, “Operators”), and you are responsible for ensuring that your Device(s) and other technology meet all such requirements at all times and prior to any purchase or order on or in connection with the Services. Company is not responsible for any failure of the Services or your inability to access the Services as a result of your use of Device(s) that do not meet Company’s or its Operators’ system requirements. In addition, you are responsible for any data access, messaging and other service rates and charges you may incur in connection with your Device and/or use of the Services.\n11.3 Usage Rules. Certain Content and Services (in whole or in part) may be accompanied by technology and/or other restrictions (e.g., digital rights management technology) that protect digital information and content from unauthorized use and access and may limit and restrict your usage of such Content and Services in accordance with certain rules and restrictions established by Company and/or Operators (“Usage Rules”). You agree to comply with such Usage Rules at all times, and shall not violate or attempt to violate any security components thereof. You further acknowledge and agree that the Usage Rules may be controlled and monitored by Company and/or its designees for compliance purposes, and Company reserves the right to enforce the Usage Rules with or without notice to you.\n11.4 Software License Grant and Restrictions on Use. Any software available in connection with the Services is subject to United States export control laws. No such software may be downloaded or otherwise exported or re-exported in violation of United States export laws. Furthermore, any software is licensed, not sold, to users. Subject to these Terms, Company agrees to permit you, on a non-exclusive, revocable, non-transferable, non-sublicensable, limited basis, to install and/or use the software on a single Device that you own or control, provided that your installation and/or use of the software is solely (a) for your own personal use; and (b) in accordance with the restrictions and limitations set forth in these Terms. Without limiting the generality of the foregoing, you shall not: (a) rent, lease, timeshare, license, distribute, sublicense or otherwise transfer the software or any portion thereof; (b) make copies of the software or any portion thereof; (c) reverse engineer, decompile or disassemble any portion of the software; (d) create derivative works of or from the software or any portion thereof; (e) incorporate the software or any portion thereof, into any product or service; (f) use the software or any portion thereof for commercial purposes; and (g) remove, alter or obscure any copyright, trademark, trade name or other proprietary notices, legends, symbols or labels that appear in the software. All rights not expressly granted to you hereunder are reserved to us and our licensors.\n11.5 Objectionable Material. You understand that by using the Services, you may encounter Content that may be deemed offensive, indecent, or objectionable by some, which Content may or may not be identified as such. Nevertheless, you agree to use the Services at your sole risk and that Company shall have no liability to you for Content that may be found to be offensive, indecent, or objectionable.\n12. Customer Support. For assistance with technical issues or customer support inquiries, please refer to our support page at https://nypost.com/customer-service/or send an email to help@nypost.com.\n13. Third-Party Services and Content. The appearance, availability, or your use of (a) URLs or hyperlinks referenced or included anywhere in connection with the Services or any other form of link or re-direction of your connection to, with or through the Services, or (b) any third-party websites, content, data, information, applications, goods, services or materials (collectively, “Third-Party Services”) does not constitute an endorsement by, nor does it incur any obligation, responsibility or liability on the part of Company, its affiliates, or parent company, or any of their respective successors and assigns, directors, officers, employees, representatives, agents, licensors, Advertisers, suppliers, Operators or service providers. We do not verify, endorse, or have any responsibility for Third-Party Services and any third-party business practices (including, without limitation, their collection and use of personal and other information), whether the Services’ or Company’s logo and/or sponsorship identification is on the Third-Party Services as part of a co-branding or promotional arrangement or otherwise. Accordingly, we encourage you to be aware when you leave the Services and to read the terms and conditions and privacy notice of each Third-Party Service you use.\n14. Advertisements. Access to the Content available on the Services is made available to you in part due to the paid advertising that appears on the Services. You agree that that you will not, and will not permit any third party to, remove, obstruct, modify or otherwise interfere with the delivery or display of advertisements on the Services. We reserve the right to suspend your access to and/or re-insert advertisements in the event we detect any such interference with the delivery or display of advertisements on the Services. Moreover, from time to time, you may choose to communicate with, interact with, or obtain Third-Party Services from our advertisers, sponsors, or other promotional partners (collectively, “Advertisers”) found on or through the Services or via a hyperlinked website or platform. All such communication, interaction and participation is strictly and solely between you and such Advertisers and we shall not be responsible or liable to you in any way in connection with these activities or transactions (including, without limitation, any representations, warranties, covenants, contracts or other terms or conditions that may exist between you and the Advertisers or any goods or services you may purchase or obtain from any Advertiser).\n15. Promotions, Contests, and Sweepstakes. From time to time, Company, or the Services’ operational service providers, suppliers, Operators, and Advertisers may conduct promotions and other activities on, through or in connection with the Services, including, without limitation, contests and sweepstakes (collectively, “Promotions”). Each Promotion may have Additional Terms and/or Rules which shall be posted or otherwise made available to you in connection therewith, and your participation in such Promotions shall be subject to such Additional Terms and/or Rules.\n16. Assignment. These Terms, and any rights, licenses and privileges granted herein, may not be transferred or assigned by you, but may be assigned or transferred by Company without restriction, notice or other obligation to you.\n17. Indemnity. You agree to indemnify, defend and hold Company, its affiliates, and parent company, and their respective successors and assigns, directors, officers, employees, representatives, agents, licensors, Advertisers, Operators, suppliers and service providers harmless from any and all claims, liabilities, damages, losses, costs and expenses (including reasonable attorneys’ fees), arising in any way out of or in connection with (a) your use of the Services, (b) your breach or violation these Terms, (c) your User Postings, or (d) any violation by you of applicable law. Company reserves the right to assume the exclusive defense and control of any matter subject to indemnification by you and all negotiations for its settlement or compromise, and you agree to fully cooperate with us upon our request.\n18. DISCLAIMER AND LIMITATIONS OF LIABILITY. THE SERVICES, AND ALL CONTENT, PRODUCTS, SERVICES AND USER POSTINGS MADE AVAILABLE ON, THROUGH OR IN CONNECTION THEREWITH, ARE PROVIDED ON AN “AS IS” AND “AS AVAILABLE” BASIS, WITHOUT ANY REPRESENTATION OR WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, OR ANY GUARANTY OR ASSURANCE THE SERVICES WILL BE AVAILABLE FOR USE, OR THAT ANY PRODUCTS, FEATURES, FUNCTIONS, SERVICES OR OPERATIONS WILL BE AVAILABLE OR PERFORM AS DESCRIBED. ALL IMPLIED REPRESENTATIONS, WARRANTIES AND CONDITIONS RELATING TO THE SERVICES AND THIS SITE, INCLUDING WITHOUT LIMITATION THE IMPLIED WARRANTIES OF MERCHANTABILITY, TITLE, NON-INFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE, AND ALL CONTENT, PRODUCTS, SERVICES AND USER POSTINGS ARE HEREBY DISCLAIMED. COMPANY DOES NOT WARRANT THAT THE FUNCTIONS CONTAINED IN THE SERVICES OR ANY CONTENT, PRODUCTS, SERVICES AND USER POSTINGS MADE ON, THROUGH OR IN CONNECTION THEREWITH WILL BE UNINTERRUPTED OR ERROR FREE, THAT DEFECTS WILL BE CORRECTED, OR THAT THE SERVICES OR THE SERVER(S) THAT MAKES THEM AVAILABLE IS FREE OF VIRUSES OR OTHER HARMFUL COMPONENTS. TO THE FULLEST EXTENT PERMITTED BY LAW, COMPANY SHALL NOT BE LIABLE FOR THE USE OF THE WEBSITE, INCLUDING, WITHOUT LIMITATION, THE CONTENT AND ANY ERRORS CONTAINED THEREIN.\nWithout limiting the foregoing, we are not responsible or liable for any viruses, malicious code, delays, inaccuracies, errors, or omissions arising out of your use of the Services. You understand, acknowledge and agree that you are assuming the entire risk as to the quality, accuracy, performance, timeliness, adequacy, completeness, correctness, authenticity, security and validity of any and all features and functions of the Services, including, without limitation, User Postings and Content associated with your use of the Services.\nYOU UNDERSTAND AND AGREE THAT, TO THE FULLEST EXTENT PERMISSIBLE BY LAW, COMPANY, ITS AFFILIATES, SUCCESSORS AND ASSIGNS, AND EACH OF THEIR RESPECTIVE OFFICERS, DIRECTORS, EMPLOYEES, AGENTS, REPRESENTATIVES, LICENSORS, OPERATORS, SERVICE PROVIDERS, ADVERTISERS AND SUPPLIERS (THE “RELEASED PARTIES”, SHALL NOT BE LIABLE FOR ANY LOSS OR DAMAGE, OF ANY KIND, DIRECT OR INDIRECT, IN CONNECTION WITH OR ARISING FROM USE OF THE SERVICES OR FROM THESE TERMS, INCLUDING, WITHOUT LIMITATION, COMPENSATORY, CONSEQUENTIAL, INCIDENTAL, SPECIAL, EXEMPLARY OR PUNITIVE DAMAGES. IN NO EVENT SHALL THE RELEASED PARTIES’ TOTAL LIABILITY TO YOU FOR ALL DAMAGES, LOSSES, AND CAUSES OF ACTION, WHETHER BASED IN CONTRACT, TORT, STRICT LIABILITY OR OTHERWISE EXCEED THE LESSER OF THE TOTAL DOLLAR AMOUNT, IF ANY, PAID BY YOU TO COMPANY FOR USE OF THE SERVICES AND $100. Some jurisdictions do not allow for the exclusion of certain warranties or certain limitations on damages and remedies, accordingly some of the exclusions and limitations described in these Terms may not apply to you.\n19. DISPUTE RESOLUTION, AGREEMENT TO ARBITRATE, AND CLASS ACTION WAIVER\nPLEASE READ THE FOLLOWING ARBITRATION AGREEMENT IN THIS SECTION (“Arbitration Agreement”) CAREFULLY. THIS SECTION AFFECTS YOUR LEGAL RIGHTS, INCLUDING YOUR RIGHT TO BRING A LAWSUIT IN COURT.\n19.1 APPLICABILITY OF ARBITRATION AGREEMENT. You agree to the following dispute resolution provisions of this Section 19 with respect to any dispute, claim, or request for relief relating in any way to your access or use of the Services, to any Services sold or distributed through the Website, or to any aspect of your relationship with the Company (“Dispute”) and any lawsuit, arbitration or other proceeding that may\narise out of such Dispute (each, an “Action”).\nThe terms of Section 19 apply to all Disputes, even if the actions or relationship giving rise to such Disputes occurred prior to this version of the Terms (or such modification). However, these Dispute Resolution terms do not apply to any Dispute as to which you have personally initiated a lawsuit or arbitration prior to agreeing to these Terms.\nEach provision of this Section 19 applies to the maximum extent permitted by law.\nCovered Disputes. If you live in the United States, any Dispute between You and the Company (collectively, the “Parties”) is a Covered Dispute, with the following exceptions: (1) to the extent you have in any manner violated or threatened to violate our intellectual property rights, our suit to enforce such intellectual property rights including by injunction; or (2) any claim that involves an amount in controversy that is equal to or greater than $75,000.\nIf a Dispute is a Covered Dispute, the Mandatory Dispute Resolution Provisions for U.S. Users (as described in Sec 19.3 below) apply. If there is any dispute between the Parties as to whether a Dispute is a Covered Dispute, that dispute shall be resolved in the state or federal courts located in the County of New York.\n19.2 DISPUTE RESOLUTION PROVISIONS APPLICABLE TO ALL USERS\nCLASS ACTION AND JURY WAIVER. THE PARTIES WAIVE THE RIGHT TO TRIAL BY JURY OR TO PARTICIPATE IN A CLASS ACTION, MASS ACTION, GROUP ACTION, REPRESENTATIVE ACTION, AND/OR COLLECTIVE ACTION IN ANY DISPUTE. EACH PARTY MAY PROCEED AS TO ANY DISPUTE ONLY IN THAT PARTY’S INDIVIDUAL CAPACITY, AND NOT AS A PLAINTIFF OR CLASS MEMBER IN ANY PURPORTED CLASS ACTION, MASS ACTION, GROUP ACTION, REPRESENTATIVE ACTION, AND/OR COLLECTIVE ACTION.\nApplicable Law. These Terms and your use of the Services are governed by, construed and enforced in accordance with the internal substantive laws of the State of New York, United States, regardless of the State’s conflict of laws provisions. However, any question as to whether a Dispute is a Covered Dispute (as defined above) and/or whether a Dispute is subject to the Mandatory Dispute Resolution Provisions for U.S. Users is to be decided by applying the provisions of the Federal Arbitration Act, Title 9 of the U.S. Code (“FAA”).\nChoice of Venue. For any Action allowed to proceed in court (including but not limited to any claim that involves an amount in controversy that is equal to or greater than $75,000, any claim related to whether a Dispute is a Covered Dispute, or any suit to enforce our intellectual property rights including by injunction), or to enforce the terms of this Agreement, the Parties agree to exclusive personal jurisdiction and venue in the state or federal courts located in the County of New York.\nInformal Dispute Resolution Required. Before initiating an Arbitration (as defined below) or any other type of Action or adversary proceeding, the Parties agree to use commercially reasonable efforts to settle any Covered Dispute (as defined above) directly through consultation and good faith negotiations according to the following process (“Informal Dispute Resolution Process”), which shall be a precondition to either Party initiating an Arbitration.\n| i. | If you have a Covered Dispute with us, you must send an individualized, written notice describing the Covered Dispute to us to NYP Holdings, Inc., Attn: Legal Department, 1211 Avenue of the Americas, New York, NY 10036. If we have a Covered Dispute with you, we will send a written notice to you using the contact information we have for you. |\n| ii. | Promptly following receipt of such notice, we will personally meet, via telephone or videoconference, in a good-faith effort to confer with each other and try to resolve informally any Covered Dispute covered by this Agreement. |\n| iii. | If you are represented by counsel, your counsel may participate in the conference as well, but you agree to fully participate in the conference personally. Likewise, if we are represented by counsel, our counsel may participate in the conference as well, but we agree to have a company representative fully participate in the conference. |\n| iv. | The statute of limitations and any filing fee deadlines shall be tolled while the Parties engage in the Informal Dispute Resolution Process required by this paragraph. |\n| v. | If the Covered Dispute is not resolved within 60 days of the opposing Party receiving the notice, then either you or we may proceed in accordance with the below Mandatory Dispute Resolution Provisions. |\n| vi. | Failure to complete the Informal Dispute Resolution Process is grounds for dismissal of any Arbitration (as defined below) and the Party initiating such Action will be required to pay any reasonable costs and fees of the other Party. |\n19.3 MANDATORY DISPUTE RESOLUTION PROVISIONS FOR U.S. USERS\n| i. | Agreement to Arbitrate Covered Disputes. Any Covered Dispute that the parties cannot resolve through the Informal Dispute Resolution Process (as defined above) must be brought on an individual basis and will be resolved exclusively by final and binding arbitration (“Arbitration”) before an arbitrator mutually selected by the Parties (the “Arbitrator”). The Arbitrator must have experience with the subject matter of the Dispute, and be a former federal or state court judge. The Parties intend the FAA to apply to ensure enforcement of these Mandatory Dispute Resolution Provisions for U.S. Users. Your agreement to these Mandatory Dispute Resolution Provisions for U.S. Users is material to Company offering the Services, as Company could not offer the Services for free or at the price charged without the cost savings provided thereby |\n| ii. | Arbitrator Selection. The parties will meet and confer in good faith to select an arbitrator. For purposes of this Section, good-faith meet-and- confer efforts require that each party propose at least three arbitrators who meet the qualifications described in these Terms. If, after 60 days of good faith meet and confer efforts, the Parties are unable to agree on an arbitrator, either Party may petition the state or federal courts located in the County of New York to appoint an arbitrator meeting the requirements herein from the arbitrators proposed by the parties. |\n| iii. | Rules Selection. The Arbitration shall be administered pursuant to JAMS’ Streamlined Arbitration Rules and Procedures or other comparable rules to which the parties agree. The selection of JAMS rules does not mean that JAMS will administer the Arbitration or appoint the Arbitrator. |\n| iv. | Conduct of Arbitration. The Arbitration shall be conducted via electronic or telephonic means. If the Party seeking Arbitration fails to appear at the administrative conference regardless of whether such Party’s counsel attends, the Arbitrator will administratively close the Arbitration proceeding without prejudice, unless such Party shows good cause as to why they were not able to attend the conference. |\n| v. | Arbitration Costs. If the Arbitrator finds that the costs and fees of an Arbitration you initiate will be prohibitive for you as compared to the costs of litigation, we will pay as much of your filing, arbitrator, and hearing fees in the Arbitration as the Arbitrator deems necessary to prevent the Arbitration from being cost-prohibitive, regardless of the outcome of the Arbitration, unless the Arbitrator determines that your claim(s) were frivolous or asserted in bad faith. If we initiate an Arbitration against you, we will pay all costs associated with the Arbitration (other than your attorneys’ fees and expenses unless permitted to be recovered under the arbitration rules or applicable law). |\n| vi. | No Opt Out Rights. You do not have the right to opt out of the Dispute Resolution section. Rather, your sole remedy if you do not accept these Terms of Use (including this Dispute Resolution section) is to stop using the Services. |\n| vii. | Company Right To Terminate Mandatory Dispute Resolution Program. At any time, Company may terminate its agreement to Section 19.3. That termination will not affect any Action that has already been initiated. |\n| viii. | Arbitration Agreement Survival. This Arbitration Agreement will survive the termination of your relationship with Company. |\n20. Miscellaneous. These Terms contains the entire understanding and agreement between you and Company concerning the Services and supersedes any and all prior or inconsistent understandings relating to the Services and your use thereof. These Terms cannot be changed orally, nor may these Terms be modified except as expressly authorized in these Terms. If any provision of these Terms is held to be illegal, invalid or unenforceable, this shall not affect any other provisions and these Terms shall be deemed amended to the extent necessary to make it legal, valid and enforceable. Any provision that must survive in order to allow us to enforce its meaning shall survive the termination of these Terms. The failure of Company to exercise or enforce any right or provision of these Terms will not operate as a waiver of such right or provision.\n21. Terms Pertaining to Certain Third Party Content, Data and Information Providers and Mobile Application Platforms.\n21.1 AP Material. By accessing the Services, you specifically acknowledge and agree that (i) Associated Press text, photo, graphic, video and/or audio material shall not be published, broadcast, rewritten for broadcast or publication or redistributed directly or indirectly in any medium; (ii) No Associated Press materials nor any portion thereof may be stored in a computer except for personal and non-commercial use; (iii) The Associated Press will not be held liable for any delays, inaccuracies, errors or omissions therefrom or in the transmission or delivery of all or any part thereof or for any damages arising from any of the foregoing; (iv) The Associated Press is an intended third party beneficiary of these terms and conditions and it may exercise all rights and remedies available to it; and (v) The Associated Press reserves the right to audit possible unauthorized commercial use of AP materials or any portion thereof at any time.\n21.2 Mobile Applications. If you access the Services through a mobile application or other type of third party platform, the applicable End User License Agreement for the platform through which you downloaded the mobile application may apply in addition to these Terms and you agree that you are subject to such terms in addition to these Terms."
    },
    {
      "url": "https://nypost.com/privacy",
      "text": "Last Modified: January 7, 2025\nNYP Holdings, Inc. (“Company,” “we,” “us,” or “our”), publisher of the New York Post, understands and respects that you care about your personal data and how it is used. We respect your privacy, as further described in our full Privacy Notice. These highlights set out some points about how we treat your personal data.\nPlease review the full Privacy Notice to understand our privacy practices.\nPRIVACY NOTICE SCOPE\nCompany owns, operates, or provides access to print publications, websites, mobile applications and direct marketing programs (collectively, the “Services”). Our Privacy Notice applies to those Services and describes how we treat your personal data when you use the Services. Our Privacy Notice describes in detail what information we collect about you, why we collect it, what we do with it and how to contact us about our privacy practices.\nCOLLECTION OF INFORMATION\nWe collect personal data from a variety of sources, including:\n- Information you provide directly to the Services;\n- Information about you that our Company affiliates may also have;\n- Information about you from third party sources, including public and commercially available sources; business partners; third party social media networks;\n- Information about your device and browsing activities on the Services, including through cookies and other similar technologies.\nUSE OF INFORMATION\nOur use of the personal data we collect will depend on the way you interact with the Services. For example, we may use the information we collect to:\n- Provide our products and Services;\n- Improve your experience with our products and Services;\n- Understand your interests and tell you about products and Services we think you will value;\n- Communicate with you and respond to your requests or questions;\n- Otherwise, as we may notify you at the point of collection or with your consent.\nYOUR CHOICES AND RIGHTS\nAs described further in our Privacy Notice, you have certain choices and rights related to the information we collect about you, including:\n- You have the opportunity to access, update and correct contact information that you choose to share with us, subject to applicable law.\n- You can stop receiving commercial email messages from a Service by submitting a request to us as outlined in the Contact Us section or as outlined in the Your Choices section.\n- You have choices about the collection and use of your information by third parties to display\nrelevant advertisements, as described in our Cookie Notice.\nSHARING OF INFORMATION\nWe may share your information in certain situations, including:\n- Where we have obtained your consent, including video content and social networking services as described in our Video Services Notice and Social Networking Notice;\n- With our subsidiaries and affiliates https://newscorp.com/about/our-businesses/\n- With our third party service providers;\n- With our business partners, who sponsor a contest or promotion, or who jointly offer services with our Services;\n- With third parties for those parties’ own marketing or other commercial purposes;\n- If the Company or the Services is merged with or is sold to another company;\n- To comply with the law or to protect or defend the rights of the Company or our users.\nADDITIONAL INFORMATION\nWe maintain administrative, technical and physical safeguards to protect and secure your information, but no data transmission or storage, or use of the Internet, can be guaranteed to be 100% secure.\nFor more information about our privacy practices, please review the full Privacy Notice.\nCONTACT US\nIf you have questions, comments or concerns regarding our privacy practices or the Privacy Notice, or wish to update your information, please contact us at privacy@nypost.com.\nYou may also write to us using the postal address listed below:\nNYP Holdings, Inc.\nAttention: Privacy Lead\n1211 Avenue of the Americas\nNew York, NY 10036\nCALIFORNIA PRIVACY RIGHTS\nThe Californian Shine the Light Law, the California Consumer Privacy Protection Act (CCPA) and the California Privacy Rights Act (CPRA) provide certain rights to residents of California. For additional information for California residents, click here.\nOTHER US STATE PRIVACY RIGHTS\nThe laws of certain US States each provide certain rights to their respective residents. For additional information for those residents, click here.\nUK/EU/EEA PRIVACY RIGHTS\nThe GDPR provides certain rights to residents of the United Kingdom, European Union and European Economic Area. For additional information, click here.\nPlease click here to review the full Privacy Notice"
    },
    {
      "url": "https://nypost.com/2025/08/07/us-news/trump-putting-more-feds-on-dc-streets-in-response-to-out-of-control-youth-violence/",
      "text": "Trump putting more feds on DC streets in response to out-of-control youth violence\nWASHINGTON — President Trump is planning to deploy federal law enforcement on the streets of the nation’s capital as early as Friday to crack down on violence committed by gangs of roaming “youths,” the White House confirmed to The Post.\n“DC residents can expect to see an increase in federal enforcement starting as early as tomorrow,” an administration official said Thursday, adding that operational details were still being finalized.\nThe move comes after a well-known former Department of Government Efficiency (DOGE) staffer, Edward Coristine — also known as “Big Balls” — was attacked by teenagers as he intervened to thwart an attempted carjacking near Dupont Circle, about a mile north of the White House.\nCoristine, 19, was beaten up and bloodied by about 10 juveniles at approximately 3 a.m. on Sunday. A picture of the injured staffer was posted by Trump and Coristine’s former supervisor, Elon Musk, earlier this week.\nNational Guard vehicles were spotted outside the DC armory Thursday morning in apparent preparation for Trump’s announcement. The FBI and the Department of Homeland Security are also preparing to deploy personnel, according to CNN.\n“Washington, DC is an amazing city, but it has sadly been plagued by petty and violent crime for far too long,” White House press secretary Karoline Leavitt said in a statement. “President Trump is committed to making our Nation’s capital safer and even more beautiful for its residents, lawmakers, and visitors from all around the world.”\nThe expected order follows Trump’s “Making the District of Columbia Safe and Beautiful” executive order signed on March 28, which established a task force dedicated to fighting crime and reducing illegal immigration in the city.\nThe EO calls for the Trump task force to work with the Metropolitan Police Department in recruiting and retaining police officers, collaborate with local entities to reduce fare evasion on the DC metro and deploy more officers in select crime-ridden areas of the capital.\nMayor Muriel Bowser has attempted to curb youth crime by invoking curfews for those under 18 years of age.\nHowever, the apparent lack of progress led Trump to threaten Tuesday to federalize DC if Bowser doesn’t get crime under control.\n“Local ‘youths’ and gang members, some only 14, 15, and 16-years-old, are randomly attacking, mugging, maiming, and shooting innocent Citizens, at the same time knowing that they will be almost immediately released,” the president posted on Truth Social on Tuesday.\nTrump urged city officials to begin charging minors as adults for violent crimes beginning at age 14 — and “lock them up for a long time”."
    },
    {
      "url": "https://nypost.com/2025/08/06/opinion/dc-crime-is-out-of-control-a-federal-takeover-could-be-the-only-solution/",
      "text": "DC crime is out of control — a federal takeover could be the only solution\nLast year, I first proposed to my husband the idea of allowing our preteen daughter to ride the Washington, DC, Metro alone. She wants to take Irish dance classes in the city, and a weekly drive in from the Maryland suburbs is too much for the family schedule.\nThen came story after story of stabbings, gang violence, and even a shooting on the Metro.\nMy proposal went back on the shelf.\nWe moved to the DC suburbs because of its proximity to the best our nation’s capital has to offer. I frequently take our six kids into the city to explore the Smithsonian museums, attend performances at the Kennedy Center, and soak up the living civics lesson that is Washington, DC.\nBut in recent years, that promise has begun to unravel.\nThe Metro stations that once filled us with civic pride now fill us with unease. City streets feel less predictable, less policed.\nAnd worst of all, none of it feels like an accident.\nSince the pandemic and the 2020 protests, Washington, DC has been spiraling.\nPolice were demoralized. Prosecutions declined. Repeat offenders walked free.\nThe result? Growing lawlessness and a population that no longer feels protected.\nJust this week, a former DOGE employee risked his life to save a woman from being assaulted by a group of a dozen teens in the city. He was beaten so severely that he suffered a concussion, but he prevented what could have been a much more tragic outcome.\nElon Musk shared the story on X and added his own conclusion: “It is time to federalize DC.”\nHe’s not the only one who feels that way.\nPresident Donald Trump posted a blistering statement on Truth Social, declaring that “Crime in Washington, DC is totally out of control.”\nHe pointed to youth gangs, violent assaults and the lack of consequences for offenders.\n“If DC doesn’t get its act together, and quickly,” Trump warned, “we will have no choice but to take Federal control of the City . . . and put criminals on notice that they’re not going to get away with it anymore.”\nCritics will call this authoritarian.\nBut for parents like me, people trying to raise independent, confident children in this area, the idea is simply a relief.\nAnd this isn’t just about families and tourists.\nLeo Terrell, chair of the Justice Department’s task force to combat antisemitism, sent a letter to Mayor Muriel Bowser this week blasting the city’s failure to protect the Israel on Campus Coalition’s recent student conference.\nThe organizers had to spend over a quarter of a million dollars on private security to ensure the safety of Jewish attendees — what Terrell called a “Jewish tax” just to exist peacefully in public.\nIn May, a House staffer was the victim of an armed carjacking in Navy Yard.\nIn July, a congressional intern, 21-year-old Eric Tarpinian-Jachym, was killed in a drive-by shooting that also injured a 16-year-old boy and a woman.\nIf we want the best and brightest to visit our city and serve in government as staffers, civil servants or interns, we need to offer them a capital that is safe to live in.\nRight now, we can’t.\nIf staffers, students and commuters can’t move through this city without fear, what exactly are we doing?\nI’d love to hand my daughter a flip phone and a SmartTrip card and give her a taste of independence.\nBut I can’t.\nNot while Metro attacks happen weekly.\nNot while carjackings plague every neighborhood.\nNot while city leaders stand paralyzed, caught between ideology and inertia.\nWashington, DC, should be a national showcase — but unless someone restores order, the city will continue its descent into fear and frustration.\nThe message from parents, federal workers and even tech billionaires is the same: Enough is enough.\nWe want our kids to love this city. But more than that, we want them to be safe in it.\nAnd that shouldn’t be too much to ask.\nBethany Mandel writes and podcasts at The Mom Wars and is a homeschooling mother of six in greater Washington, DC."
    },
    {
      "url": "https://nypost.com/2025/08/05/us-news/ex-doge-staffer-nicknamed-big-balls-left-bloodied-after-savage-dc-carjacking-attempt-by-10-juveniles/",
      "text": "Ex-DOGE staffer nicknamed ‘Big Balls’ left bloodied after savage DC carjacking attempt by 10 juveniles\nA 19-year-old former Department of Government Efficiency (DOGE) staffer was beaten and bloodied by a mob of 10 minors early Sunday as he thwarted a carjacking attempt in the nation’s capital, according to DC police.\nEdward Coristine, whose LinkedIn handle earned him the nickname “Big Balls” at DOGE, was with a woman near downtown DC when he saw the group of juveniles approach their car and “make a comment about taking the vehicle,” according to a Metropolitan Police Department incident report obtained by The Post.\n“At that point, for her safety, [Coristine] pushed his significant other … into the vehicle and turned to deal with the suspects,” the dramatic report continues.\n“The suspects then began to assault [Coristine],” the ex-DOGE staffer told officers, who rolled up on the scene at the same time he was being attacked.\nOfficers patrolling the 1400 block of Swann Street NW — a popular area with several shops, bars and restaurants about a mile north of the White House — noticed “a group of approximately ten juveniles surrounding the complainants’ vehicle and assaulting [Coristine],” the report states.\n“The officers immediately exited their vehicle, and the juveniles began fleeing on foot,” police said.\nDC police were able to nab only two of the young suspects, who were later positively identified by Coristine as being among his attackers.\nA 15-year-old male and a 15-year-old female, both from nearby Hyattsville, Md., were arrested and charged with unarmed carjacking.\nCoristine was treated on scene by DC Fire and EMS for injuries sustained in the assault, according to DC police.\nHe is recovering from a broken nose, concussion and black eye, according to a source familiar with the matter.\nThe group of teenagers “shouted about taking the woman’s car, and then ran across the street,” just before they started to beat Coristine, a source said.\nCoristine then pushed his female companion into the driver’s seat and slammed the door.\n“The gang tried to open the closed doors and slammed [Coristine] against the car extremely loudly while attacking him,” the source added, noting that the woman called 911 from inside the vehicle while Coristine was being beaten.\nThe software whiz also had his iPhone 16, valued at $1,000, stolen during the attack.\nPresident Trump shared a photograph of the aftermath of the assault on Coristine early Tuesday afternoon, showing the former DOGE staffer sitting on the ground, bloodied and with his ripped shirt barely hanging on his body.\nTrump, 79, raged that “crime in Washington, D.C., is totally out of control” in the post, where he also threatened a federal takeover of the district.\nMarko Elez, a one-time colleague of Coristine’s at DOGE, claimed in a social media post that he snapped the photo of his friend shortly after the assault, and described his actions as heroic.\n“My friend Big Balls … is a hero,” Elez wrote on X. “I took this photo after Edward protected a young woman from an attempted carjacking by 8 thugs near Dupont Circle.”\n“Violence like this in the heart of DC is completely unacceptable.”\nFormer DOGE chief Elon Musk also posted about the incident on X, without naming Coristine as the victim.\nCoristine resigned from DOGE in June, according to Fox News, less than a month after Musk departed from the agency."
    },
    {
      "url": "https://nypost.com/2025/08/08/opinion/trumps-right-about-the-census-but-rushing-one-is-worse/",
      "text": "President Donald Trump wants a new census.\nIf by this he means a snap-census before the scheduled 2030 survey, he’s demanding that the federal government undertake a gargantuan task with minimal planning and no discernible source of funding.\nIn statistical terms, it’d be like launching D-Day with a month’s lead time.\nIf the White Queen believes six impossible things before breakfast, that the Census Bureau could pull this off would qualify as one of them.\nThe agency couldn’t even competently conduct the last, regularly scheduled census in 2020.\nGiven that conducting the census is a core function of the federal government — indeed, mandated by the Constitution — it is outrageous that the last survey missed so badly.\nIt undercounted Florida and other red states (as well as Illinois) and overcounted New York and a number of blue states (plus, Ohio and Utah).\nBecause the apportionment of congressional seats depends on population as determined by the census, these were highly consequential errors that can’t be allowed to happen again.\nThere’s no legal mechanism for fixing it, though. We just have to do better in 2030.\nTrump is also, understandably, chagrined that illegal immigrants are included in the census and declares that, going forward, they “WILL NOT BE COUNTED.”\nHere he’s going to run smack into the relevant legal texts.\nArticle I Section 2 of the Constitution refers to “the Whole Number of free Persons,” while the 14th Amendment includes “the whole number of persons in each State.”\nIn similar fashion, the US code calls for a “tabulation of total population by States.”\nSo it’s hard to see how illegal immigrants can be excluded from the count.\nAs it happens, illegal migrants — who make up just a small proportion of America’s total immigrant population — don’t seem to have much of an effect on the partisan breakdown of congressional seats one way or the other.\nAlthough the highest numbers of them live in blue California, they are spread around the country, with large numbers in Texas and Florida as well.\nA change that Trump wanted in the 2020 census was the inclusion, once again, of a citizenship question — highly relevant information that it’s entirely appropriate to ask.\nThere was a long period from the 19th century through 1950 when the census survey asked about citizenship. Later, it was relegated to the so-called “long form.”\nFinally the long form itself was axed after 2000 — and today it’s considered a scandal to even think about reviving it.\nTrump’s proposal to ask the question on the 2020 census encountered stiff resistance and the Supreme Court squashed it.\nBut in the big picture, non-citizens who are here legally do have a significant impact on congressional apportionment.\nRecent research by the Center for Immigration Studies found that all immigrants (naturalized citizens as well as all other immigrant categories) shifted 14 congressional seats to Democratic states on net in 2020.\nNon-citizens also distort the composition of congressional districts.\nThe CIS study found the same number of citizens in the 13 congressional districts with the highest share of non-citizens as in the nine districts with the lowest share of non-citizens.\nIn other words, the citizens in those nine low-immigration districts get four fewer representatives than did the citizens in the 13 high-immigration districts.\nIt’s one man, one vote — with an asterisk.\nTo take an example from Texas, the Democratic-held 33rd district, where non-citizens are nearly 30% of the population, has 208,000 fewer voting-age citizens than the Texas 21st district.\nThat means the citizens of the 33rd district have marginally more clout and representation, thanks to a population tilted toward those who can’t vote.\nUltimately, the way to diminish these effects is to reduce the level of immigration.\nEarly indications are showing a large exodus of illegal immigrants since Trump’s election, and that the United States will have net negative migration this year for the first time in a half-century.\nIf Trump wants to fully capture the changes he’s effecting in immigration policy, he should indeed want a new census — but let’s wait until 2030.\nTwitter: @RichLowry"
    },
    {
      "url": "https://nypost.com/2025/08/11/us-news/trump-federalizing-dc-police-deploying-national-guard-in-capital-crime-crackdown/",
      "text": "Trump takes control of DC police, deploying National Guard in historic capital crime crackdown — and warns NYC could be next\nWASHINGTON — President Trump announced a sweeping crime crackdown in DC on Monday, placing the city’s police department under federal control and deploying the National Guard to patrol the streets — while warning New York City could be next.\n“I’m announcing a historic action to rescue our nation’s capital from crime, bloodshed, bedlam and squalor — and worse. This is liberation day in DC and we’re going to take our capital back,” Trump told reporters at the White House.\n“Our capital city has been overtaken by violent gangs and bloodthirsty criminals, roving mobs of wild youth, drugged-out maniacs and homeless people. And we’re not going to let it happen anymore. We’re not going to take it.”\nTrump vowed to “clean it up real quick,” “like we did on the southern border” with illegal immigration.\nThe Home Rule Act, which granted DC self-governance in 1973, allows the president to assert emergency control of the Metropolitan Police Department (MPD) for 30 days. Congress can pass a joint resolution extending his control, which would require a bare majority in the Republican-held House and Senate.\nDocuments formalizing the takeover were transmitted to Congress Monday afternoon and DC police officials set up a meeting later in the day with White House officials to discuss the new arrangement.\nTerry Cole, the Senate-confirmed administrator of the Drug Enforcement Administration, will temporarily lead the 3,400-officer MPD under the supervision of Attorney General Pam Bondi, Trump said.\nIt was not immediately clear how the National Guard deployment will proceed — including numbers and neighborhoods where they will be sent — but members of that force historically assist law enforcement in a supporting role and do not have the ability to make arrests.\nJustifying his action Monday morning, the president displayed a chart showing that DC has more murders per capita than the capital cities of cocaine-exporting Columbia, cartel-plagued Mexico, and terrorist hub Iraq.\n“We doubled up on Baghdad,” Trump commented.\n“You people are victims of it too. You are reporters and I understand a lot of you tend to be on the liberal side. But you don’t want to get mugged and raped and shot and killed. And you all know people, friends of yours, where that’s happened.”\nTrump cited many high-profile recent crimes in the capital, including the Aug. 3 attack on former Department of Government Efficiency staffer Edward Coristine, 19, during an alleged attempted carjacking and the June 30 murder of congressional intern Eric Tarpinian-Jachym, 21, in a drive-by shooting.\nTrump also mentioned the 2023 carjacking of Rep. Henry Cuellar (D-Texas), the near-fatal stabbing of an aide to Sen. Rand Paul (R-Ky.) the same year by a “demented lunatic” and the shooting death of a three-year girl in July.\nThe president described criminals lawlessly cruising about town on unauthorized ATVs and motorbikes and said he planned to beautify the District by fixing road medians, broken marble and potholes.\n“We’re getting rid of the slums too…I know it’s not politically correct,” Trump said, teasing apparent plans to get rid of public housing in high-property-value DC.\n“We’re getting rid of the slums where they live.”\nHomeless encampments will also be removed from all public places, including in parks and underpasses, the president vowed, while the US Park Police — under the control of Interior Secretary Doug Burgum — will be responsible for the removal of graffiti.\nDC officials say they won’t resist\nDistrict Mayor Muriel Bowser, an elected Democrat, confirmed Monday afternoon that she would comply with the federal takeover.\n“I’m going to work every day to make sure it’s not a complete disaster, let me put it that way,” Bowser said at her own press conference, at which she called Trump’s move “unsettling and unprecedented.”\n“The main point is this: Everybody should follow the law, the police and the community. And that’s the case now, it was the case last week and it was the case the week before,” she said.\nThe mayor added that she was particularly concerned about making sure that “all law enforcement be identifiable by uniform, a badge, a jacket, so that people know that they are law enforcement.”\nTrump first ordered federal officials, including members of the FBI, DEA and Border Patrol, onto the streets of DC the night of Aug. 7-8. Photos circulating on social media and in the press showed those agents wearing clearly identifying uniforms.\nMPD Chief Pamela Smith confirmed she had a meeting set for later Monday with two federal officials, whom she did not name, about next steps.\nSmith added she was interested in receiving help to enforce outstanding warrants for criminal suspects, saying there are “things that the federal government is also very useful for.”\n“This will be an opportunity for us to come together and collaborate on being able to go out and execute warrants,” the police chief said.\nAhead of Trump’s announcement, Bowser told MSNBC on Sunday that “we do need the federal government’s help” and specifically requested assistance rebuilding the city jail.\nBowser recently invoked curfews in parts of the city in a bid to keep teens off the street as early as 7 p.m., but also has claimed crime rates are going down in the city, pointing to official data.\nTrump claimed Monday that the numbers were “phony” and promised that Bondi will be “looking into that.”\nThe president noted that DC police commander Michael Pulliam, whose district included the densely populated Adams Morgan and Columbia Heights neighborhoods, was suspended last month for allegedly falsifying crime data to make trends appear more positive.\nPulliam’s police union defended him and accused MPD leadership of ordering subordinates to falsify violent crime data.\nDC Police Union chairman Gregg Pemberton endorsed Trump’s takeover, saying in a Fox News interview: “We completely agree with the president that crime in the District of Columbia is out of control and something needs to be done with it.”\nNew York, Chicago, LA in crosshairs\nTrump announced at his press conference that other cities may be next, saying at one point that “I’m going to look at New York in a little while” — and also name-checking Chicago and Los Angeles.\n“You look at Chicago, how bad it is. You look at Los Angeles, how bad it is. We have other cities that are very bad. New York has a problem,” Trump said.\n“We’re starting very strongly with DC, and we’re going to clean it up real quick, very quickly as they say.”\nTrump additionally announced plans for federal legislation that would override state laws barring judges from applying cash bail requirements to criminal defendants.\nIf necessary, Trump added, ordinary military members could be deployed to join the National Guard and the local cops.\nThe president has direct control over DC’s National Guard, unlike every other unit, which is under the authority of state governors.\n“Washington, DC, should be one of the safest, cleanest and most beautiful cities anywhere in the world,” Trump summed up his plans, “and we’re going to make it that.”"
    }
  ],
  "argos_summary": "President Trump has announced a federal takeover of the Washington, DC police in response to rising youth violence and crime, particularly following the brutal beating of a former Department of Government Efficiency employee, Edward Coristine, by a group of minors during an attempted carjacking. The National Guard will be deployed to assist in patrolling the streets, and Trump has threatened similar actions in other cities like New York and Chicago if crime does not improve. Critics argue that this approach is heavy-handed, while supporters claim it is necessary to restore safety and order in the capital.",
  "argos_id": "EIUPGWFRV"
}