{
  "url": "https://finance.yahoo.com/news/xrp-traders-profit-taking-spree-230545144.html",
  "authorsByline": "Anushka Basu",
  "articleId": "ae4289d0373b4057983b9345fb043204",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/thestreet_881/97a6380388ed70ae08073fd106f3dd05",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T23:05:45+00:00",
  "addDate": "2025-08-11T23:30:06.967719+00:00",
  "refreshDate": "2025-08-11T23:30:06.967720+00:00",
  "score": 1.0,
  "title": "XRP traders go on a profit-taking spree as momentum loses heat",
  "description": "Profit-taking emerges as XRP steadies near $3.20 following a sharp rebound.",
  "content": "XRP traders go on a profit-taking spree as momentum loses heat originally appeared on TheStreet.\n\nXRP is trading at $3.20, has seen a 5.32% gain on the week, and has been mostly flat over the last 24 hours.\n\nHowever, the market cap of XRP has seen a 40.89% uptick in 24-hour trading volume showing increased market activity.\n\nThe recent price action shows a distinct V-shaped recovery starting on August 8, breaking the previous long-term resistance to the upside clearly defined in our example, touching $3.30 before retreating slightly to a more steady price action, as per crypto analyst Tom Tucker.\n\nA significant driver of XRP's recent V-shaped recovery and breakout above critical resistance was the announcement that Ripple's long-running litigation battle with the SEC has finally ended.\n\nThe resolution of the case, confirmed by SEC commissioners Hester Peirce and Chairman Paul Atkins, appears to have reignited bullish sentiment.\n\nWhen looking at the XRP volatility chart, the 1-week volatility has remained relatively low, indicating that the market is indeed calmer in the short term.\n\nLooking at all timeframes, the 1-month, 3-month, and 6-month volatility readings are also average, meaning that we are seeing steadier-than-average price action, both in the short term and medium term.\n\nOn-chain data shows XRP's latest surge past $3 has been accompanied by a spike in short-term holder activity, suggesting some long-term investors are taking profits after the SEC–Ripple settlement.\n\nCrypto analyst Ali Martinez also pointed out that about \"900 million XRP scooped up by whales in 48 hours!\"\n\nJoin the discussion with Scott Melker on Roundtable here.\n\nIn addition, a large portion of XRP remains in older age bands (1–3 years), indicating that a significant number of long-term holders are holding on despite the wider volatility. That mixture usually depicts a stage where early profit-taking is met with new inflows.\n\nXRP has recovered from the mid-August move lower beyond $3, and XRP is trying to clear a key rejection area around $3.30. The 9-period EMA is positioned around the $3.22 level, which has become a short-term pivot and rejection area. Price attempts to clear this level have resulted in rejection.",
  "medium": "Article",
  "links": [
    "https://coinmarketcap.com/community/profile/Orlando__pirate/",
    "https://www.thestreet.com",
    "https://finance.yahoo.com/news/ripple-sec-submit-joint-settlement-224810238.html",
    "http://roundtable.rtb.io/",
    "https://x.com/HesterPeirce/status/1954956232646857143",
    "https://twitter.com/x/status/1954930053760069656",
    "https://finance.yahoo.com/news/ripple-victory-lap-may-premature-185549924.html",
    "https://www.thestreet.com/crypto/markets/xrp-traders-go-on-a-profit-taking-spree"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "XRP traders",
      "weight": 0.10080305
    },
    {
      "name": "XRP",
      "weight": 0.09931417
    },
    {
      "name": "medium term",
      "weight": 0.08931409
    },
    {
      "name": "SEC commissioners",
      "weight": 0.06886372
    },
    {
      "name": "profits",
      "weight": 0.06833835
    },
    {
      "name": "short-term holder activity",
      "weight": 0.06455558
    },
    {
      "name": "Price attempts",
      "weight": 0.06392733
    },
    {
      "name": "increased market activity",
      "weight": 0.062520504
    },
    {
      "name": "Crypto analyst Ali Martinez",
      "weight": 0.061653193
    },
    {
      "name": "Chairman Paul Atkins",
      "weight": 0.060712144
    }
  ],
  "topics": [
    {
      "name": "Cryptocurrency"
    },
    {
      "name": "XRP"
    },
    {
      "name": "Altcoins"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Finance/Investing/Currencies & Foreign Exchange",
      "score": 0.9560546875
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.9375
    }
  ],
  "sentiment": {
    "positive": 0.21134505,
    "negative": 0.5015733,
    "neutral": 0.2870816
  },
  "summary": "XRP traders are taking a profit-taking spree as momentum in the crypto market loses steam. The market cap of XRP has seen a 40.89% increase in 24-hour trading volume, indicating increased market activity. The recent price action has been a V-shaped recovery since August 8, with XRP touching $3.30 before retreating slightly to a steady price action. The announcement of the end of Ripple's long-running litigation battle with the SEC has also contributed to this recovery. The 1-week volatility of the XRP is relatively low, indicating a calmer market in the short term, and the 1-month, 3-month and 6-month volatility readings are also average. XRP's surge past $3 has been accompanied by a spike in short-term holder activity, suggesting some long-term investors are taking profits after the SEC–Ripple settlement.",
  "shortSummary": "XRP traders are taking profits as momentum declines, despite a V-shaped recovery and increased market activity following the SEC's settlement.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "e6a802dc417f477b9eeaf68eb54f77a4",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://finance.yahoo.com/news/ripple-victory-lap-may-premature-185549924.html",
      "text": "Aug. 7, 2025 would be counted among the most glorious days in the history of the crypto industry as the years-long legal battle involving the crypto payments firm Ripple Labs and the Securities and Exchange Commission (SEC) finally came to an end.\nBoth the parties informed the Second Circuit Court of Appeals that they have dropped their appeals and cross-appeals of the landmark 2023 ruling in the case.\nXRP was trading at $3.32 at press time, up more than 8.5% in 24 hours.\nLet's unfold the iconic saga to get an overview of the most controversial legal case involving crypto assets.\nEnd of a saga\nIt was during the first presidential term of Donald Trump that the SEC, under the leadership of Chair Jay Clayton, sued Ripple and two of its top executives, Brad Garlinghouse and Chris Larsen, in December 2020.\nThe securities regulator alleged the crypto firm engaged in the sale of unregistered XRP securities to raise over $1.3 billion. Ripple argued XRP is a digital currency, not a security.\nThe case lingered for a few years until July 2023, when Judge Analisa Torres delivered a judgment that both parties claimed as a victory yet resented.\nThe judgment said that though Ripple's programmatic sale of XRP tokens to retail traders didn't constitute a sale of securities, the firm's sale of those tokens to institutional clients violated securities laws.\nThe SEC dropped its claims against Garlinghouse and Larsen in October 2023.\nNext, the court issued another major ruling in August 2024, slapping Ripple with a civil penalty of more than $125 million — the SEC had asked for a $2 billion penalty — and asking it to desist from further violations of securities laws.\nConsequently, both parties appealed the ruling — (i) Ripple hoping for a judgment that XRP is a digital currency, not a security at all, and even the institutional sale of XRP didn't violate any securities laws, and (ii) the SEC, now under Chair Gary Gensler, hoping for one that ruled the sale of XRP in both the scenarios to be violations of securities laws.\nThe above rulings were delivered during the Joe Biden administration.\nBut then, Trump returned to the White House in January 2025, and things began to take a 180 degree turn for Ripple and the broader crypto industry too.\nIn March, the SEC and Ripple dropped their appeals and filed a joint settlement in May. Both parties repeatedly requested Judge Torres to slash the penalty from more than $125 million to $50 million and vacate the injunction against further securities violations.\nJudge Torres has declined the request multiple times.\nIn conclusion, the 2023 ruling remains intact: (i) XRP isn't a security when sold to retail customer via programmatic sales, (ii) XRP is a security when sold to institutional clients to raise funds, and (iii) Ripple is still required to pay the penalty of over $125 million.\nRegulatory status of XRP\nAs discussed above, the programmatic sale of XRP to retail traders over crypto exchanges isn't a violation of securities laws. But an institutional sale can only go ahead after registration with the SEC under securities laws.\nThe status is in line with the SEC's view during the Trump administration that most crypto assets aren't securities. However, there is one lone Democrat voice at the SEC who has consistently voiced her opposition to such views.\nCommissioner Caroline Crenshaw has raised concerns over the SEC's evolving view of crypto's regulatory status. While the regulator is declaring all sorts of crypto assets aren't securities, yet there is no objection to the exchange-traded funds (ETFs) linked to crypto assets effectively asserting that these assets actually are securities, she asked.\nCrenshaw also objected to the settlement between the agency and Ripple for undermining the court order, the enforcement program, and the interests of the investors.\nWhat it cost\nCEO Brad Garlinghouse claimed in May 2023 that Ripple spent $200 million defending the case against the SEC. It's been more than two years since then, and the company must have spent much more by now.\nThe crypto firm also made political donations worth millions of dollars.\nRipple's chief legal officer Stuart Alderoty personally donated $300,000 in XRP to Trump's presidential campaign in June 2024.\nOn the other hand, co-founder Chris Larsen donated more than $11.8 million to PACs supporting the Democratic Party's presidential candidate Kamala Harris.\nOnce Trump won, Ripple Labs donated $5 million in XRP to his inaugural committee — one of the largest corporate donations to the fund.\nThe company also donated millions of dollars to the Fairshake PAC that supports pro-crypto candidates.\nIn fact, Garlinghouse admitted in an interview in December 2024 that if it weren't for the SEC's aggressive campaign against crypto, the PAC wouldn't even have existed in the first place.\nWhat now?\nOnce Trump began his second term, the SEC not only softened its stance in regard to Ripple but also to the entire crypto industry. The regulator dropped its similar lawsuits against exchanges such as Coinbase (Nasdaq: COIN), Kraken, etc.\nThe new SEC Chair Paul Atkins, appointed in April 2025, has vowed to enforce Trump's pro-crypto agenda. His view on most crypto assets not being securities isn't inconsistent with Judge Torres' 2023 ruling.\nBut what about the regulatory status of crypto assets during institutional sales?\nBut what about the regulatory status of crypto assets when they are tied to ETFs, as Commissioner Crenshaw pointed out?\nWe still can't say there is absolutely no ambiguity regarding the status of crypto assets in the U.S. We will closely observe the SEC's guidelines and the court rulings in the future, as Trump has vowed to turn the U.S. into the crypto capital of the world."
    },
    {
      "url": "https://finance.yahoo.com/news/ripple-sec-submit-joint-settlement-224810238.html",
      "text": "The U.S. Securities and Exchange Commission (SEC), Ripple Labs, co-founder Christian Larsen, and CEO Brad Garlinghouse filed a joint settlement agreement letter on May 8, lawyer James Filan shared on X.\nThe joint letter, submitted to Judge Analisa Torres at the U.S. District Court for the Southern District of New York, requests an indicative ruling to dissolve the injunction included in the Aug. 7, 2024 judgment.\nIt also requests to order that the escrow holding the civil penalty amount of $125 million be released, with $50 million paid to the SEC and the remainder paid to Ripple.\nIf Judge Torres issues the above ruling, both parties will move the U.S. Court of Appeals for the Second Circuit for a limited remand to seek relief, the letter mentions.\nNote that the joint settlement letter is the latest step in the direction toward the end of the years-long securities violations case against Ripple.\nIt was in December 2020 that the SEC sued Ripple for the alleged sale of unregistered XRP token securities worth $1.3 billion.\nIn July 2023, Judge Torres delivered a landmark summary judgment as per which, while the sale of tokens to institutional investors constituted a violation of securities laws, their sale to retail investors on public exchanges didn't constitute a securities violation.\nHowever, the case took a different turn once President Donald Trump assumed office for the second term in January 2025.\nIn March, Ripple and the SEC reached a historic settlement as per which both parties decided to drop their appeal and cross-appeal. The firm's penalty also got reduced from the original $125 million to $50 million.\nNote that Ripple's chief legal officer Stuart Alderoty personally donated $300,000 in XRP to Trump's presidential campaign in June 2024. Ripple Labs also donated $5 million in XRP to Trump’s inaugural committee.\nAs per Kraken's price feed, XRP was trading at $2.27 at press time, up 7.2% a day."
    }
  ],
  "argos_summary": "XRP is currently trading at $3.20, reflecting a 5.32% weekly gain, with increased market activity following the resolution of Ripple's long-standing litigation with the SEC. The case, which began in December 2020, concluded with a ruling that XRP is not a security when sold to retail investors but is classified as a security in institutional sales. Following the settlement, XRP's market volatility has stabilized, and profit-taking by long-term holders has been observed, while new investments from whales have surged.",
  "argos_id": "EKKIGID9P"
}