{
  "url": "https://www.dailymail.co.uk/news/article-14991049/View-aboard-Britains-leviathan-facing-war-Chinese-despot-DAVID-PATRIKARAKOS.html?ns_mchannel=rss&ns_campaign=1490&ito=1490",
  "authorsByline": "David Patrikarakos",
  "articleId": "b94a3292523145409059b8d25de39cd9",
  "source": {
    "domain": "dailymail.co.uk",
    "paywall": false,
    "location": {
      "country": "gb",
      "city": "London",
      "coordinates": {
        "lat": 51.5073219,
        "lon": -0.1276474
      }
    }
  },
  "imageUrl": "https://i.dailymail.co.uk/1s/2025/08/11/20/101121529-0-image-a-72_1754942284037.jpg",
  "country": "gb",
  "language": "en",
  "pubDate": "2025-08-11T23:36:50+01:00",
  "addDate": "2025-08-11T22:56:10.496588+00:00",
  "refreshDate": "2025-08-11T22:56:10.496590+00:00",
  "score": 1.0,
  "title": "My view aboard Britain's 65,000-ton ship facing down Chinese despot",
  "description": "When it comes to expressions of British military pride, nothing does the job quite like the HMS Prince of Wales.",
  "content": "When it comes to expressions of British military pride, nothing does the job quite like the HMS Prince of Wales.\n\nThe flight deck of the aircraft carrier that is the flagship of the Royal Navy stretches out before me. A vast slab of grey steel more than 900ft long.\n\nFrom my vantage point near the stern I can see a line of F-35 fighter jet noses fan out like a row of arrows ready to pierce the sky.\n\nThese supersonic, stealth combat aircraft, renowned for their 'short take-off and vertical landing' capabilities, accelerate to 170mph as they head for the elevated runway ramp that juts off the end of the carrier to generate sufficient lift to begin their climb.\n\nOnce airborne, they can take out targets on land or sea using an array of firepower that includes Sidewinder missiles for air-to-air combat and 100kg Spear bombs for ground attacks.\n\nThese masters of the air are housed on a 65,000-ton leviathan that carries a 1,600-strong crew. And today, I'm one of them.\n\nI'm aboard the Prince of Wales in the port of Darwin, northern Australia, having flown from London to meet Foreign Secretary David Lammy and Defence Secretary John Healey on the vessel.\n\nLammy and Healey are here because the carrier strike group – the Prince of Wales and its escort vessels – along with 3,000 British troops, are taking part in Exercise Talisman Sabre.\n\nWith more than 35,000 military personnel from 19 nations involved in the manoeuvres, it's the largest military exercise ever hosted by Australia. For the UK and our cousins Down Under, Talisman Sabre symbolises a deepening military partnership, designed for a world more dangerous and terrifying than for more than 80 years.\n\nThe day begins with an inspection of the troops. In the background, a band strikes up a military tune. Lammy and Healey make their way down a row of sailors dressed in white ceremonial uniform, making small talk.\n\nAustralia's Northern Territory is in the grip of a 30C heatwave made the more uncomfortable by 65 per cent humidity. Perspiration crosses my forehead. My eyes sting. My shirt becomes sticky.\n\n'It's hot, isn't it?' Lammy says to one sailor, who's also struggling. Later, the three of us meet inside the hangar. 'The UK's Modern Industrial Strategy: Defence', reads a sign behind us.\n\nHealey makes clear how important today's proceedings are. 'It's the first time a British aircraft carrier has come to Australia since 1997,' he says.\n\n'And it's a big day because of the global context. Where threats are increasing, allies are important, and reinforcing the deep alliance that we've had with Australia is more vital than ever.'\n\nLammy agrees: 'I spend a lot of time on the Europe-North America relationship, particularly within the context of Nato, and here in the Indo-Pacific – it's a critical theatre. With Australia, we have had the deepest of enduring relationships. We're here to renew that relationship.'\n\nLammy is right about the Indo-Pacific. If there is to be a major global war in the years ahead, the region will be a key battlefield.\n\nChina is already challenging the US for global hegemony and this means, first and foremost, dominating what it believes is its 'backyard'. Many believe that Chinese leader Xi Jinping will launch his much-vaunted invasion of Taiwan in 2027 to coincide with the 100th anniversary of the founding of the People's Liberation Army (PLA).\n\nIf that happens, the US is committed (albeit ambiguously) to Taiwan's defence. The UK and Australia will almost certainly follow suit.\n\nNeither Lammy nor Healey will comment on any possible war with China. But being in a state of readiness in this region is now clearly top of Britain's agenda.\n\nAnd when I speak to a senior government source, the message is clear. Britain 'challenges' China. It will continue to confront Beijing's dangerous and destabilising activity in the South China Sea: 'From the Red Sea to the South China Sea — the high seas are more dangerous than at any point in generations.'\n\nThe truth of these words is plain to see. Earlier this year, the Chinese navy conducted live-fire naval exercises in the Tasman Sea between Australia and New Zealand, in the first recorded operational engagement in the area. The People's Republic tested new landing barges on ships that would be used in any amphibious assault on Taiwan, as well as cable cutters that could cut off the island's internet.\n\nIt has been ratcheting up drills in the Taiwan Strait and targeting countries with which it has territorial disputes, such as the Philippines and Japan.\n\nOnly yesterday, the Daily Mail reported how two Chinese vessels collided in the South China Sea while chasing a Philippine patrol boat at high speeds – just the latest in an increasing number of incidents between the two countries.\n\nThe Australians have no choice but to be at the top of their game.\n\nAll of which explains the urgency and importance of cementing the Western alliance in these waters.\n\nOnce, Britain was at the heart of Australian security. But after the Second World War, the Aussies knew we were spent. In 1951 they signed the ANZUS Treaty with the United States, cutting Britain out of Australian defence – and leaving Churchill heartbroken.\n\nBut our historic alliance has now been revived, most significantly via the 2021 trilateral AUKUS agreement, under which Britain and the US agreed to share nuclear propulsion technology with Australia with a view to cooperating on the design and build of a new generation of nuclear-powered submarines. This was the first time that America and Britain had shared such sensitive technology with anyone else.\n\n'Today, the UK and Australia are two nations intertwined by shared goals, particularly in the Indo-Pacific,' a Foreign Office source told me. 'That means a level of integration unprecedented since the end of the British Empire.'\n\nBut modern defence means reckoning with new technology that enables Davids to attack Goliaths. I have been deeply wary of Britain spending colossal sums on huge carriers that could be vulnerable to the sort of drone tech that, as I have seen first-hand in Ukraine, enabled Kyiv to destroy Russia's Black Sea fleet without any real navy of their own. It even took out Moscow's colossal flagship, the Moskva, near Odesa.\n\nAnd let's not forget, the Houthis of Yemen, backed by the mullahs of Tehran, have succeeded in terrorising Western cargo ships passing through the Red Sea using a range of cheap drones.\n\nYet Healey assures me that the military fully understands these challenges. 'We learned from Ukraine how the accelerating development of technology is changing the nature of warfare,' he tells me.\n\n'For your war fighters to have an edge in the future, you've got to harness the power of that new tech, and we are. The aircraft carrier is increasingly hybrid, with traditional fixed-wing aircraft taking their place alongside the latest in drone technology, just as the Strategic Defence Review said it should.'\n\nThe proof of this is all around me. It's there as I sit in the captain's chair, surrounded byan array of winking interfaces, feeling as if I'm piloting the Starship Enterprise.\n\nBut most of all, it's in the ship's hanger where I see the drones. Black circles amid a grey patina on the front of one make it resemble a human face. It almost seems to stare at me. Another drone resembles a small plane.\n\nNearby are a couple of small D40s, Australian drones that can be launched manually or via a grenade-launcher. These so-called 'loitering' munitions buzz and swarm like lethal metallic wasps until they lock on to their target - and unload.\n\nIt's clear that the British goal is to further develop capabilities that are now key to the future of war: detecting and striking adversaries autonomously.\n\nBut does all this mean that the target of 5 per cent defence spending, demanded by both Donald Trump and Nato will, finally, be met?\n\nHealey cannot be clearer: 'Will we hit that target?' he replies. 'I'm absolutely confident we will. We signed up like the other 31 nations last month to that 5 per cent by 2035.'\n\nHealey is a serious man. But Britain, as we all know, is already facing financial disaster, and cannot possibly afford to put 5 per cent of GDP into defence without eye-watering sacrifices. And even if we somehow found the necessary cash, to hit the target only in a decade seems lethargic – at best. The threats we face are terrifying and imminent.\n\nNot least because Lammy correctly stresses the broader importance of this region in a global conflict. 'We see an indivisibility of security between the Indo-Pacific and the Euro-Atlantic,' he tells me. 'I have seen Iranian missiles shot into Kyiv. I've been in Beijing and challenged the Chinese about their dual-use technology [which can be used for both weapons and civilian purposes] that is shipped to Russia and fired at the Ukrainians.\n\n'I've seen satellite images of DPRK [North Korean] troops engaged in battle on behalf of Russia against Ukraine, and of course we know that shells are making their way to Russia also from the Indo-Pacific. So the indivisibility is plain to see on a day-to-day basis.'\n\nThis is spot on – as I know first-hand from my reporting across several continents. I've come under attack from Iranian technology in Kyiv, eastern Ukraine and Israel. I've seen up close the damage the Iranians have done in Baghdad and what the Russians have done in Syria.\n\nWe are in the midst of a battle with an axis of enemies whose influence spans the globe. That is why the HMS Prince of Wales's presence here is so important.\n\nIn a speech to the Washington think-tank The Hudson Institute last year, Lammy quoted former US National Security adviser Zbigniew Brzezinski, who warned that the West might one day face the danger of a 'grand coalition of China, Russia and perhaps Iran, an anti-hegemonic coalition united not by ideology but by complementary grievances'.\n\n'This I think risks coming upon us,' Lammy said.\n\nWell, that day has indeed arrived. And our response must be decisive and bold.\n\nWe must build a coalition of allies as resolute as the states ranged against us and it must straddle both the Indo-Pacific and the Atlantic.\n\nJapan, South Korea, Singapore, Australia — all these democracies want us there. The more alliances they have, the more strategic independence they maintain.\n\nLammy points not just to Nato but the 'Indo-Pacific Four' (IP4), the alliance of Nato partners in the region – Australia, Japan, New Zealand and South Korea.\n\nHe highlights the intelligence-sharing 'Five Eyes' group of Australia, Canada, New Zealand, the UK and the US and, of course, the G7 group of developed western nations.\n\n'Our economic and military alliances are so multilateral. Yes, this is a time of peace through strength,' he says. 'But also peace through deepening our allied partnerships with one another.'\n\nWhat I saw in Darwin was merely the latest iteration of something Britain has been doing for centuries: creating and managing alliances. When we fought with our Empire in the Second World War, we sat at the centre of a web of allies.\n\nIt's how we defeated not only Hitler, but the German Kaiser in 1918 and before that, Napoleon.\n\nYes, it's been a long time since Britannia ruled the waves.\n\nBut we still have global soft power, highly trained armed forces and vast geopolitical and military experience.\n\nIf the world is more dangerous than ever, hyper-accelerating technology is ensuring that it's also smaller than ever. To deal with it, alliances must be global – and no one forges them better than we do.\n\nThe HMS Prince of Wales is more than just a floating airbase and potent weapon. It is a movable hub: both the centre and the symbol of the type of global alliances that Britain will need in order to survive and thrive in the coming decades.\n\n'This is what you're seeing. Allies. Arming-up. Ambition. This is our strategy for the 21st century,' says my senior government source.\n\nAs I walk off the ship, slowly crossing the bridge connecting it to terra firma, I recall Lammy's words about the indivisible theatre of conflict we now face.\n\nThe threat is indeed global – and at its head is China. Only it has the size, strength and resources to reorder the world in its totalitarian image.\n\nIn 1962, former US Secretary of State Dean Acheson notoriously observed that 'Great Britain has lost an empire and has not yet found a role.'\n\nIn Darwin, perhaps I finally saw us taking on that role, and not before time.\n\nIn this age of mass conflict, our future depends upon it.",
  "medium": "Article",
  "links": [
    "https://www.dailymail.co.uk/news/article-6586129/Week-long-heatwave-sweep-entire-nation-state-set-bake-40C-temperatures.html",
    "https://www.dailymail.co.uk/debate/article-13138473/LORD-DANNATT-world-dangerous-place-fear-Britain-chance-saloon.html",
    "https://www.dailymail.co.uk/news/article-14901681/SAS-veteran-breaks-silence-44-years-ROBERT-HARDMAN.html",
    "https://www.dailymail.co.uk/news/article-12638709/Five-Eyes-intelligence-chiefs-pictured-time-MI5-boss-warns-Britain-seeing-sharp-rise-aggressive-attempts-hostile-states-like-China-steal-tech-secrets.html",
    "https://www.dailymail.co.uk/news/article-12762967/F35-Prince-Wales-drone-Mojave-warship-ospreys.html",
    "https://www.dailymail.co.uk/news/article-10665295/Suspected-arms-depot-western-Russia-destroyed-Ukrainian-missile.html",
    "https://www.dailymail.co.uk/news/article-12351291/Giving-Russians-taste-medicine-Ukraine-pounds-Putins-forces-rockets-Moscow-ally-North-Korea-missiles-bound-frontline-captured.html",
    "https://www.dailymail.co.uk/news/article-9761205/Japan-vows-defend-Taiwan-alongside-China-invades-island-next.html",
    "https://www.dailymail.co.uk/news/article-14634773/royal-navy-hms-prince-wales-deployment-far-east.html",
    "https://www.dailymail.co.uk/money/comment/article-10966455/ALEX-BRUMMER-Britains-strategic-muddle-defence-firm-takeovers.html",
    "https://www.dailymail.co.uk/columnists/article-6957177/In-hunger-Chinas-tech-billions-leaders-risk-leaving-Britain-exposed-warns-EDWARD-LUCAS.html",
    "https://www.dailymail.co.uk/news/article-5587003/Chinese-navy-carries-drills-aircraft-carrier-battle-groups-prepare-exercises.html",
    "https://www.dailymail.co.uk/news/article-13799965/Chinese-Filipino-coast-guard-ships-collide-disputed-waters.html",
    "https://www.dailymail.co.uk/news/article-10365857/AUKUS-Australias-submarine-deal-UK-set-big-alarm-China.html",
    "https://www.dailymail.co.uk/news/article-9347527/US-admiral-warns-China-aims-invade-Taiwan-6-years-global-leadership-role.html",
    "https://www.dailymail.co.uk/news/article-11087283/China-practises-INVADING-Taiwan-conducts-sea-air-exercises-Taiwan-Strait.html"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "global alliances",
      "weight": 0.052886873
    },
    {
      "name": "drone technology",
      "weight": 0.05145642
    },
    {
      "name": "new technology",
      "weight": 0.050713576
    },
    {
      "name": "Great Britain",
      "weight": 0.04907401
    },
    {
      "name": "Britain",
      "weight": 0.049036738
    },
    {
      "name": "Australia",
      "weight": 0.04834777
    },
    {
      "name": "northern Australia",
      "weight": 0.048233937
    },
    {
      "name": "hyper-accelerating technology",
      "weight": 0.046881862
    },
    {
      "name": "Foreign Secretary David Lammy",
      "weight": 0.045841467
    },
    {
      "name": "Iranian technology",
      "weight": 0.045246936
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/Law & Government/Military/Other",
      "score": 0.7890625
    },
    {
      "name": "/Business & Industrial/Aerospace & Defense/Other",
      "score": 0.69189453125
    },
    {
      "name": "/Sensitive Subjects/War & Conflict",
      "score": 0.5927734375
    },
    {
      "name": "/News/Other",
      "score": 0.48291015625
    }
  ],
  "sentiment": {
    "positive": 0.20053442,
    "negative": 0.38904914,
    "neutral": 0.41041645
  },
  "summary": "The HMS Prince of Wales, the flagship of the Royal Navy, is taking part in Exercise Talisman Sabre, the largest military exercise ever hosted by Australia. The UK and Australia are participating in the manoeuvres, with over 35,000 military personnel from 19 nations participating. This represents a deepening military partnership between the two countries designed for a more dangerous and terrifying future. The exercise is part of a wider effort to counter China's aggressive and destabilising activity in the South China Sea, where the high seas are dangerous. The region is expected to be a key battleground if there is a major global war, with China challenging the US for global hegemony and dominating what it believes is its 'backyard'.",
  "shortSummary": "The HMS Prince of Wales, home to F-35 fighter jets and 3,000 British troops, highlights Britain's military readiness in the Indo-Pacific amid rising tensions with China.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "3c0e008ba5c04557b55dbad051236112",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.dailymail.co.uk/news/article-12638709/Five-Eyes-intelligence-chiefs-pictured-time-MI5-boss-warns-Britain-seeing-sharp-rise-aggressive-attempts-hostile-states-like-China-steal-tech-secrets.html",
      "text": "Five Eyes intelligence chiefs are all pictured together for the first time ever - as MI5 boss warns Britain is seeing 'sharp rise in aggressive attempts' by hostile states like China to steal tech secrets\n- The alliance was formed in the wake of the Second World War\nBritain is seeing a 'sharp rise in aggressive attempts' by hostile states to steal technology secrets, the head of MI5 has warned.\nKen McCallum said countries like China could have the 'power to shape all our futures' if it is able to 'steal competitive advantage' in emerging technologies.\nThe Director General of MI5 was speaking out at the start of an unprecedented summit by the Five Eyes intelligence alliance to raise their concerns over the security threat to the West.\nThe alliance, comprising intelligence agencies from the UK, US, Canada, Australia and New Zealand, was formed in the wake of the Second World War to counter the threat posed by the Soviet Union.\nBut it has largely remained in the shadows and its joint leaders have until now never appeared jointly in public before.\nFive Eyes intelligence chiefs are all pictured together for the first time ever. From left to right, Australian Security Intelligence Organisation Director-General Mike Burgess; Canadian Security Intelligence Service Director David Vigneault; FBI Director Christopher Wray; New Zealand Security Intelligence Service Director-General of Security and Chief Executive Andrew Hampton; and MI5 Director General Ken McCallum\nKen McCallum (pictured) said countries like China could have the 'power to shape all our futures' if it is able to 'steal competitive advantage' in emerging technologies.\nToday the security leaders of the Five Eyes met at the heart of Silicon Valley at the invitation of FBI Director Christopher Wray to discuss how to combat the threat posed by hostile states seeking to infiltrate firms working in key areas such as artificial intelligence.\nMr McCallum said: 'The UK is seeing a sharp rise in aggressive attempts by other states to steal competitive advantage.\n'It's the same across all five of our countries.\n'The stakes are now incredibly high on emerging technologies; states which lead the way in areas like artificial intelligence, quantum computing and synthetic biology will have the power to shape all our futures.\n'We all need to be aware, and respond, before it's too late.'\nThe spy chiefs are due to discuss the threat to businesses and the collective security of the five nations.\nMr Wray said: 'Emerging technologies are essential to our economic and national security, and America's role as a leading economic power, but they also present new and evolving threats.\n'The FBI is committed to working with our Five Eyes and industry partners to continue to protect emerging technologies both from those who would steal them and those who would exploit them for malicious purposes.'\nAhead of the conference due to be attended by government officials, business leaders, entrepreneurs and academics, Australian Security Intelligence Organisation's Director-General Mike Burgess said: 'The Summit is an unprecedented response to an unprecedented threat.\n'The fact the Five Eyes security services are gathering in Silicon Valley speaks to the nature of the threat and our collective resolve to counter it.\n'This summit will raise awareness of the threat, and help the technology sector understand, identify and manage the risks.'\nThe Five Eyes' coalition was formed in 1946 to share intelligence and coordinate security efforts.\nThe alliance focuses on countering a range of threats, including terrorism, cybersecurity, weapons proliferation, organized crime, and state-backed espionage and interference.\nMost watched News videos\n- Moment passengers 'stop' man who pulled down trousers on tube\n- Moment Cycling Mikey pushes bike into a car after furious row\n- Shocking moment man is gored to death after charging at bull\n- Shocking moment woman strikes flight attendant before being removed\n- Kristen Welker calls out JB Pritzker over Gerrymandering\n- Family-friendly restaurant Cracker Barrel unveils bold new look\n- Chinese navy vessel collides with one of its own chasing Philippine boat\n- Chinese Navy ship collides with own vessel while chasing boat\n- Florida man knocks out kayakers while attempting a DAREDEVIL leap\n- Hawaii ferry is tossed by strong waves before being run aground\n- Biblical flooding hits Wisconsin leaving residents trapped in homes\n- Moment 'dine and dashers' run out on £200 bill at Indian restaurant"
    },
    {
      "url": "https://www.dailymail.co.uk/news/article-11087283/China-practises-INVADING-Taiwan-conducts-sea-air-exercises-Taiwan-Strait.html",
      "text": "China practises INVADING Taiwan as 14 of its warships and 20 aircraft conduct sea and air exercises around Taiwan Strait after Nancy Pelosi's visit to the self-ruled island\n- China simulated an attack on Taiwan today with dozens of jets and warships\n- Some 20 Chinese aircraft and 14 ships crossed the median line of Taiwan Strait\n- Comes days after US Speaker Nancy Pelosi's visit to Taipei that infuriated Beijing\n- China said it was 'testing capabilities' of its land strike and sea assault systems\nChina simulated an invasion of Taiwan today after dozens of jets and warships crossed the median line of the Taiwan Strait, according to the island's Ministry of Defence.\nThe highly aggressive display of intimidation featuring some 20 Chinese aircraft and 14 ships comes days after US House Speaker Nancy Pelosi's visit to Taipei that infuriated Beijing.\nTaiwan's armed forces issued an alert, dispatched air and naval patrols around the island, and activated land-based missile systems in response to the Chinese exercises, the ministry said.\nThe ministry said that zones declared by China as no-go areas during the exercises for other ships and aircraft had 'seriously damaged the peace' in what was effectively a blockade of the island - an act of war by international law.\nThe Taiwanese military, finding itself in a situation similar to Ukraine in February, emphasised that it did not wish to poke the dragon, but would defend itself if attacked.\nThe median line has been an unofficial border separating the two warring sides that was drawn by a US general in 1955\nChina's Ministry of Defence said in a statement Saturday that it had carried out military exercises as planned in the sea and airspaces to the north, southwest, and east of Taiwan, with a focus on 'testing the capabilities' of its land strike and sea assault systems.\nA French-built Mirage 2000 fighter jet takes off at an airbase in Hsinchu, Taiwan during military alerts as Chinese jets crossed the median line\nA Chinese military plane flew on training exercises with the Eastern Theatre Command of the Chinese People's Liberation Army (PLA), Friday\nA PLA serviceman looks through binoculars at Taiwanese frigate Lan Yang cruising the Straits of Taiwan amid a tense stand-off\nThe highly aggressive display of intimidation comes days after US House Speaker Nancy Pelosi's (pictured in the poster) visit to Taipei that infuriated Beijing\nChina's Ministry of Defence said in a statement Saturday that it had carried out military exercises as planned in the sea and airspaces to the north, southwest, and east of Taiwan, with a focus on 'testing the capabilities' of its land strike and sea assault systems. Some of the exercises clearly violated Taiwanese sovereign territory\nChina launched live-fire military drills following Pelosi's trip to Taiwan earlier this week, saying it violated the 'one-China' policy. China sees the island as a breakaway province to be annexed by force if necessary, and considers visits to Taiwan by foreign officials as recognizing its sovereignty.\nTaiwan's army also said it detected four unmanned aerial vehicles flying in the vicinity of the offshore county of Kinmen on Friday night and fired warning flares in response.\nThe four drones, which Taiwan believed were Chinese, were spotted over waters around the Kinmen island group and the nearby Lieyu Island and Beiding islet, according to Taiwan's Kinmen Defense Command.\nKinmen, also known as Quemoy, is a group of islands only 10 kilometres (6.2 miles) east of the Chinese coastal city of Xiamen in Fujian province in the Taiwan Strait, which divides the two sides that split amid civil war in 1949.\n'Our government & military are closely monitoring China's military exercises & information warfare operations, ready to respond as necessary,' Taiwan's President Tsai Ing-wen said in a tweet.\n'I call on the international community to support democratic Taiwan & halt any escalation of the regional security situation,' she added.\nThe deputy head of Taiwan defence ministry's research and development unit was found dead on Saturday morning in a hotel room. Pictured: Tien Kung II Missile Launcher Display at Hukou Camp Ground\nThe Rocket Force under the Eastern Theatre Command of China's People's Liberation Army (PLA) conducts conventional missile tests into the waters off the eastern coast of Taiwan, from an undisclosed location\nTaipei said multiple Chinese jets and warships (pictured) had today crossed the 'median line' - the unofficial maritime border between the two\nThe Chinese military exercises began Thursday and are expected to last until Sunday. So far, the drills have included missile strikes on targets in the seas north and south of the island in an echo of the last major Chinese military drills in 1995 and 1996 aimed at intimidating Taiwan's leaders and voters.\nTaiwan has put its military on alert and staged civil defence drills, while the U.S. has deployed numerous naval assets in the area.\nThe Biden administration and Pelosi have said the US remains committed to a 'one-China' policy, which recognises Beijing as the government of China but allows informal relations and defence ties with Taipei. The administration discouraged but did not prevent Pelosi from visiting.\nChina has also cut off defence and climate talks with the US and imposed sanctions on Pelosi in retaliation for the visit.\nPelosi said Friday in Tokyo, the last stop of her Asia tour, that China will not be able to isolate Taiwan by preventing US officials from travelling there.\nPelosi has been a long-time advocate of human rights in China. She, along with other lawmakers, visited Beijing's Tiananmen Square in 1991 to support democracy two years after a bloody military crackdown on protesters at the square.\nMeanwhile, cyberattacks aimed at bringing down the website of Taiwan's Ministry of Foreign Affairs had doubled between Thursday to Friday, compared to similar attacks ahead of Pelosi's visit, according to Taiwan's Central News Agency. The ministry did not specify the origin of the attack.\nA Taiwanese F-16 Fighting Falcon fighter jet is seen before landing at Hualien Air Force Base on Saturday\nTaiwanese F-5 fighter jets are seen after taking off from Chihhang Air Base on Saturday in response to highly aggressive Chinese drills violating Taiwanese territorial waters\nA Taiwanese vessel as seen from a Chinese vessel, indicating how close the rival military assets are from one another in a powder keg situation\nChinese warship Changchun, a Type 052 destroyer, is escorted by the Cheng Kung, a guided-missile frigate, as they sail in the Taiwan Strait\nOther ministries and government agencies, such as the Ministry of Interior, also faced similar attacks on their websites, according to the report.\nA distributed-denial-of-service attack is aimed at overloading a website with requests for information that eventually crashes it, making it inaccessible to other users.\nAlso Saturday, the Central News Agency reported that the deputy head of the Taiwan Defence Ministry's research and development unit, Ou Yang Li-hsing, was found dead in his hotel room after suffering a heart attack. He was 57, and had supervised several missile production projects.\nThe report said his hotel room in the southern county of Pingtung, where he was on a business trip, showed no signs of intrusion.\nTaiwanese overwhelmingly favour maintaining the status quo of the island's de facto independence and reject China's demands that the island unify with the mainland under Communist control.\nGlobally, most countries subscribe to the 'one-China' policy, which is a requirement to maintain diplomatic relations with Beijing.\nAny company that fails to recognise Taiwan as part of China faces swift backlash, often with Chinese consumers pledging to boycott its products.\nOn Friday, Mars Wrigley, the manufacturer of the Snickers candy bar, apologized after it released a video and materials featuring South Korean boy band BTS that had referred to Taiwan as a country, drawing swift criticism from Chinese users.\nIn a statement on its Weibo account, the company expressed 'deep apologies.'\n'Mars Wrigley respects China's national sovereignty and territorial integrity and conducts business operations in strict compliance with local Chinese laws and regulations,' the statement said.\nIn a separate post, the firm added that there is 'only one China' and said that 'Taiwan is an inalienable part of China's territory.'\nMost watched News videos\n- Moment passengers 'stop' man who pulled down trousers on tube\n- Moment Cycling Mikey pushes bike into a car after furious row\n- Shocking moment man is gored to death after charging at bull\n- Shocking moment woman strikes flight attendant before being removed\n- Kristen Welker calls out JB Pritzker over Gerrymandering\n- Family-friendly restaurant Cracker Barrel unveils bold new look\n- Chinese navy vessel collides with one of its own chasing Philippine boat\n- Chinese Navy ship collides with own vessel while chasing boat\n- Florida man knocks out kayakers while attempting a DAREDEVIL leap\n- Hawaii ferry is tossed by strong waves before being run aground\n- Biblical flooding hits Wisconsin leaving residents trapped in homes\n- Moment 'dine and dashers' run out on £200 bill at Indian restaurant"
    },
    {
      "url": "https://www.dailymail.co.uk/news/article-10665295/Suspected-arms-depot-western-Russia-destroyed-Ukrainian-missile.html",
      "text": "Is Kyiv taking the fight to Putin as his invasion stalls? Suspected arms depot in western Russia is destroyed 'by Ukrainian missile' sparking a blast seen from across the border\n- Footage emerged of a huge explosion in Russia, a mere 12 miles from Ukraine\n- The blast is thought to have destroyed an arms depot in a village near Belgorod\n- There are reports the suspected arms depot was hit by a Ukrainian missile\n- Ukrainian officials have not yet confirmed the strike - but this would represent just the second Ukrainian attack on Russian territory since the war began\nFootage has emerged of a huge explosion in Belgorod, western Russia, at the site of a suspected arms depot which is believed to have been hit by a Ukrainian missile.\nThe blast, which took place a mere 12 miles from the Russian-Ukrainian border near the village of Krasniy Oktyabr just outside the city of Belgorod, triggered a series of firework-like explosions which could be seen from Ukraine tonight.\nUkrainian journalist Yuriy Butusov claimed that the depot was destroyed by an OTR-21 Tochka-U ballistic missile fired by the Ukrainian 19th missile brigade, though this has not yet been confirmed by Ukrainian officials.\nIf the missile strike is confirmed by Ukraine's armed forces, it will be just the second Ukrainian strike on Russian territory since the start of the war after the Millerovo airbase was attacked in late February.\nFootage has emerged of a huge explosion in Belgorod, western Russia, at the site of a suspected arms depot which is believed to have been hit by a Ukrainian missile. The blast, which took place a mere 12 miles from the Russian-Ukrainian border near the village of Krasniy Oktyabr just outside the city of Belgorod, triggered a series of firework-like explosions which could be seen from Ukraine\nThe Governor of Belgorod Vyacheslav Gladkov confirmed reports of the explosion and said that no Russian citizens were hurt, but refused to shed any light on the reason for the blast.\n'Explosions were heard on the territory of Belgorod and the Belgorod region,' Gladkov said.\n'The incident took place near the village of Krasniy Oktyabr. The head of the village is in direct contact with me and has given me all the information. There are no casualties or injuries among the residents.'\n'I'll post the reason for this later,' he added.\nHowever, Russian news agency TASS reported that four Russian military personnel were injured and said preliminary reports suggested the explosion was caused by a Ukrainian missile.\n'The shell hit the territory of a temporary military camp in the Belgorod region. Four servicemen were injured,' an emergency services source told TASS.\nThe suspected Ukrainian shelling of the target in Belgorod comes the same day that Russia announced it would begin pulling back troops from Kyiv and Chernihiv following peace talks with Ukrainian delegates in Istanbul.\nUkraine's delegation at the conference laid out a framework under which the country would declare itself neutral and its security would be guaranteed by an array of other nations.\nMoscow's public reaction was positive, and the negotiations are expected to resume on Wednesday, five weeks into what has devolved into a bloody war of attrition, with thousands dead and almost 4 million Ukrainians fleeing the country.\nAmid the talks, Russian Deputy Defense Minister Alexander Fomin said Moscow has decided to 'fundamentally... cut back military activity in the direction of Kyiv and Chernihiv' to ''increase mutual trust and create conditions for further negotiations.''\nThe Kremlin's Deputy Defence Minister Alexander Fomin (L) said the change on the battlefield was meant to increase trust at peace talks, suggesting that the foundations of a ceasefire could be in play. His superior Sergey Shoigu (R) meanwhile said Russian forces will now concentrate on the 'liberation' of the eastern Donbass region rather than attacking major Ukrainian cities\nCol. Gen. Oleksandr Syrskyi, top military commander in charge of the defense of the Ukrainian capital, walks in a trench at a position north of the capital Kyiv, Ukraine, Tuesday, March 29, 2022. The first face-to-face talks in two weeks between Russia and Ukraine began Tuesday in Turkey, raising flickering hopes there could be progress toward ending a war that has ground into a bloody campaign of attrition\nHis superior Sergey Shoigu meanwhile said Russian forces will now concentrate on the 'liberation' of the eastern Donbass region rather than attacking major Ukrainian cities, which represents a major tactical shift in the face of bitter resistance.\nBut the announcement has been met with skepticism in Europe and the US, with British Prime Minister Boris Johnson today declaring Vladimir Putin could still seek to 'twist the knife' as the war enters a new phase.\nAnd Western officials have remained highly suspicious of Russia's true intentions, arguing that Russian attacks have continued despite the Kremlin's promise to scale back troops in major urban centres.\nOne official speaking on condition of anonymity said: 'Nothing that we have seen so far has demonstrated to us that President Putin and his colleagues are particularly serious about [scaling back]. It is more of a tactical exercise playing for time.\n'Even if they do do what they say they are going to do that is not in any shape or form a cessation of hostilities... I think we can continue to see continued death and destruction [in the Donbass].'\nMost watched News videos\n- Moment passengers 'stop' man who pulled down trousers on tube\n- Moment Cycling Mikey pushes bike into a car after furious row\n- Shocking moment man is gored to death after charging at bull\n- Shocking moment woman strikes flight attendant before being removed\n- Kristen Welker calls out JB Pritzker over Gerrymandering\n- Family-friendly restaurant Cracker Barrel unveils bold new look\n- Chinese navy vessel collides with one of its own chasing Philippine boat\n- Chinese Navy ship collides with own vessel while chasing boat\n- Florida man knocks out kayakers while attempting a DAREDEVIL leap\n- Hawaii ferry is tossed by strong waves before being run aground\n- Biblical flooding hits Wisconsin leaving residents trapped in homes\n- Moment 'dine and dashers' run out on £200 bill at Indian restaurant"
    },
    {
      "url": "https://www.dailymail.co.uk/columnists/article-6957177/In-hunger-Chinas-tech-billions-leaders-risk-leaving-Britain-exposed-warns-EDWARD-LUCAS.html",
      "text": "In their hunger for China's tech billions, our gullible leaders risk leaving Britain horribly exposed as they ignore the dangers of cosying up to the dragon, warns EDWARD LUCAS\nMost of my adult life has been spent in the Kremlin's shadow. As a young foreign correspondent reporting for British newspapers from behind the Iron Curtain, I was arrested, beaten up and deported.\nI stayed sceptical even when the Soviet Union collapsed in 1991. More than ten years ago I published The New Cold War — the first book sounding the alarm about the regime of ex-KGB agent turned president Vladimir Putin.\nToday, I am far more worried by something else — China. And I believe Britain is becoming a pushover when it comes to standing up to the bullies of Beijing.\nBritain is becoming a pushover when it comes to standing up to the bullies of Beijing, writes Edward Lucas (Theresa May pictured with Chinese President Xi Jinping in February 2018)\nTake, for example, Theresa May's controversial decision on Tuesday to over-rule Cabinet colleagues and accept technological input from the Chinese giant, Huawei, to build parts of our new 5G wireless communication system — the heart of the next industrial revolution.\nMrs May appeared to ignore warnings from five senior ministers and from U.S. intelligence experts that this poses a risk to national security because of Huawei's alleged ties to a regime that Defence Secretary Gavin Williamson has previously described as sometimes malign.\nBleak\nOf course, the PM faced a bleak choice. Without access to Chinese high technology, and to that country's vast markets and investment, we risk losing our competitiveness.\nYet an ever-closer economic partnership with China comes at a high cost — not only to our security, but also to our allies.\nIndeed, the rising tide of Chinese influence is endangering Britain's 'Special Relationship' with the U.S. — the foundation of our country's security, forged during World War II.\nTheresa May made the controversial decision on Tuesday to over-rule Cabinet colleagues and accept technological input from the Chinese giant, Huawei (CEO Richard YU pictured) to build parts of our new 5G wireless communication system\nThe Trump administration, alarmed by China's aggressive behaviour on many fronts, has warned that if we let Chinese technology into our core communications systems, it will stop sharing top-secret intelligence material.\nIt has banned Huawei from its own government networks and has demanded its partners (Britain, Australia, Canada and New Zealand) in the 'Five Eyes' intelligence alliance do the same. Australia and New Zealand have barred Huawei from supplying key elements of their telecommunications infrastructure, while Canada is reviewing its position.\nThe temptation to ignore the security concerns is huge.\nMrs May and Mr Jinping take part in tea ceremony at his official Diaoyutai State Guesthouse on February 1, 2018 in Beijing\nThe much-talked-about 'Internet of Things' — devices connected by superfast 5G next-generation technology — will transform our lives. Machines will communicate with each other in transport, work and the home.\nLife will — we are told — become easier, better and greener, the world is rushing headlong into this revolution — and Huawei technology is at the heart of it.\nThe company's founder served in the Chinese military and few doubt its close ties to the all-powerful Communist Party, despite Huawei's denials that it has any connection to the Chinese government.\nIn China's totalitarian system, every company — and, indeed, every citizen — must by law help the state security authorities on demand, in secret.\nThe Trump administration (US President pictured with Xi Jinping) warned that if we let Chinese technology into our core communications systems, it will stop sharing top-secret intelligence material\nSo should China's spymasters decide at some future date that they want to use technology sold to foreigners for espionage or sabotage, Huawei and other companies will have no choice but to comply.\nAnd if Britain's central nervous system runs on technology ultimately controlled by party bosses in Beijing, what price our privacy — and our safety?\nThe answer so far has been to set up a special unit staffed by experts from GCHQ, our electronic spy agency, to scrutinise Huawei software and hardware. Its verdict is that the risk can be 'mitigated'.\nIf the bits and bytes flowing across the networks are encrypted, then it hardly matters who makes the switches, radio masts, antennae and other 'non-core' hardware and infrastructure, which is what the Government has agreed to.\nThe boffins of GCHQ have not yet discovered any secret 'flaws' in Huawei products. In fact, their real worry is sloppiness.\nLike many other tech giants, Huawei has put innovation, low cost and convenience ahead of reliability. But this is not to say we should not be permanently vigilant.\nFor most cyber-security experts, Huawei is not the chief worry. Far greater concerns surround China's state-sponsored hackers, who can steal huge quantities of personal data from badly run commercial and government databases here and elsewhere.\nSabotage\nThe scope for sabotage attacks is also huge, and extends way beyond Huawei.\nDefence Secretary Gavin Williamson has previously described the Chinese regime as sometimes malign\nThe head of GCHQ, Jeremy Fleming, this week warned of the 'unprecedented' scale of cyber-threats that are threatening the British way of life.\nYes, we need to future-proof our telecommunications systems, but we also need to make our critical infrastructure — such as banking, energy, health, transport and retail systems —far more resilient, regardless of what technology is used.\nWe also need to show that we are willing to stand up to China on other issues, too: such as the regime's desire to curb all foreign criticism of its xenophobic and brutal system.\nWe have been scandalously silent over the inhuman treatment of Muslims in Western China, incarcerated in their millions in re-education camps.\nNo British government politician will meet the Tibetan spiritual leader, the Dalai Lama, for fear of offending Beijing.\nMinisters collude in the diplomatic boycott of Taiwan, a doughty democracy that faces constant, vindictive pressure from mainland China.\nThe shameful betrayal of the people of Hong Kong is another dark stain — and another sign of China's growing influence.\nThis week, the law professor Benny Tai was jailed for 16 months for demonstrating for democracy in the former British territory. Predictably, there was not a squeak of protest from our Government.\nInstead, Chancellor Philip Hammond will be one of many Western leaders in Beijing at a meeting of China's Belt and Road Initiative this week, a multi-trillion-pound scheme unveiled by Chinese President Xi Jinping in 2014 aimed at boosting transport and other connections between Africa, Europe and Asia.\nThe head of GCHQ, Jeremy Fleming, this week warned of the 'unprecedented' scale of cyber-threats that are threatening the British way of life\nIt covers more than 70 countries and the aim is to reshape the way the world trades and travels — and to create a system in which all the best roads, railways and shipping lanes lead to Beijing.\nGreed\nAll this is a stunning example of how, as the Russian state stagnates, China is becoming an economic, diplomatic and technological superpower.\nIt is a world leader in drone technology, in artificial intelligence, in the new space race (China shocked the world when it landed a probe on the Moon in January) and — as we now see — in computer hardware for the next industrial revolution.\nChina exploits the opportunities presented by open societies such as ours — China Global Television Network, the regime's propaganda outlet, operates freely from its offices in London — while keeping its system closed to outsiders.\nLike Russia, China plays games of divide and rule in the West and exploits the same vulnerabilities — our greed, complacency, gullibility and slipshod cyber-security.\nBut Russia's aim is only to sow chaos. The reach and clout of Beijing is far greater and its goals far more ambitious.\nThe Chinese leadership has a long-term plan, to win what it sees as the country's rightful place as the world's biggest and most powerful country.\nRussia is mostly a nuisance. China is a menace — and it's time to smell the dragon's breath."
    },
    {
      "url": "https://www.dailymail.co.uk/news/article-12762967/F35-Prince-Wales-drone-Mojave-warship-ospreys.html",
      "text": "F-35s in 'BEAST' mode, US Marine Ospreys on deck, and the maiden flight of one of the biggest drones ever to take off from a carrier: On board Britain's biggest warship - the $4billion behemoth training with American pilots as she prepares to tackle China\n- The H.M.S. Prince of Wales is training with American test pilots in the Atlantic\n- In 2025 she will sail to the Indo-Pacific region, scene of tension with China\n- The aircraft carrier is preparing by working with U.S. Ospreys\nThe gray outline of a Marine V-22 Osprey drops out of the sky to take up position beside the flight deck of Britain's biggest aircraft carrier.\nWith a spotter hanging from its open doorway, the American test pilot swings the tail of the aircraft around and lowers it vertically to a pin point landing in the rear corner of the H.M.S. Prince of Wales.\nThe flight deck already bears the scorch marks from dozens of landings by F-35 fighter jets from weeks of testing.\nA day earlier, a Mojave unmanned aircraft took off and landed — the largest drone ever to fly from a European ship.\nThis is the future of maritime warfare. Two allies with interchangeable hardware working together to extend their range and capabilities.\nH.M.S. Prince of Wales is the Royal Navy's newest aircraft carrier and its biggest warship. It has been off the eastern seaboard of the U.S. since September, training with American aircrews\nAn American MV-22 Osprey, from test squadron HX-21, comes into land on the flight deck with its unique tilt-rotor design. The testing is all part of extending the Royal Navy's capabilities\n'As we go and have a tilt towards the I.N.D.O.P.A.C.O.M. area where the geography and the range of those assets, you are talking about vast amount of space ... the utility of those airframes is immense,' Capt. Richard Hewitt told DailyMail.com, using an acronym for the Indo-Pacific command.\nFor two decades, the West's fighting forces were focused on battling insurgents on Afghan mountainsides or dotted through dusty villages in the Middle East.\nToday the center of attention is increasingly China and its muscular efforts to increase its influence in the Indian Ocean and western Pacific.\nThe Prince of Wales will soon be a key part of that geopolitical tussle.\nNext year she takes over from her sister ship, H.M.S. Queen Elizabeth, in the role of Britain's 'very high readiness' carrier. A year later, she is expected to lead a carrier strike deployment into the region.\nShe has been off the east coast of the U.S. since September, working with U.S. test pilots.\nSome of the most thrilling moments came with the F-35s operating in 'beast mode' - loaded up 22,000lb of destructive power, including air-to-air and air-to-ground missiles.\nThey carried out their first 'rolling' landings, approaching the flight deck slowly to land, instead of using their ability to hover alongside the ship before setting themselves down vertically.\nIt means they can return to the carrier more heavily laden, instead of jettisoning unused fuel or expensive munitions.\nCapt. Richard Hewitt said it was a tribute to the ship's company that it was working with U.S. forces in the North Atlantic so soon after leaving dry dock\nThe unique shape of the Osprey is easily recognisable. It can take off vertically like a helicopter, before tilting its rotors forward to fly like a fixed-wing aircraft\nA crewmember keeps an eye out as the Osprey approaches the flight deck\nH.M.S. Prince of Wales has two 'islands.' The flight control tower is aft, with the bridge and captain's quarters at the front. The aft island can command the ship if the bridge is damaged\n'We had it coming in sideways,' said Hewitt. 'We had it landing with full fuel.'\nThe Prince of Wales and her sister are Britain's biggest ever warships. At 920 ft in length (the crew of the Prince of Wales like to say that theirs is actually three feet longer than HMS Queen Elizabeth despite being built to the same design) and 230 ft in breadth, its central hangar can hold two of the Royal Navy's frigates.\nBut the path to exercises about 100 miles off the North Carolina has not been easy. For a decade, in the 2010s, what once the world's biggest navy had no aircraft carriers at all.\nAnd the decision to spend almost $8 billion on two Queen Elizabeth class vessels looked like a mistake last year. Five years after being launched the Prince of Wales broke down en route to exercises with the U.S. Navy.\nA problem with her right propeller shaft saw her in dry dock for almost a year, triggering inaccurate headlines that she was being mothballed.\nNow she is back and a key part of Royal Navy efforts to punch above its weight, one of two platforms that can work closely with NATO allies.\nHewitt said like the warplanes it is designed to carry, it is a fifth generation warship. Its upper decks are designed to get flight crews to aircraft as efficiently as possible, while lower decks are kitted out with automated and autonomous systems that can be operated with a slimmed down crew.\nThe flight deck is coated with paint that can withstand 2700F\nThe captain's collection of challenge coins. H.M.S. Prince of Wales arrived off the U.S. coast since September, working with American pilots\nThe ship's firefighters take part in a drill. Training never ends aboard the ship\nLt. James Holton is the ship's second navigator. He is pictured here on the bridge\nOn Wednesday she made a little bit of history with the launch of the biggest ever drone from a European warship.\nGeneral Atomics' Mojave is based on the Reaper drone. But it can land on a short runway in tricky conditions even with a 56-foot wingspan.\nRear Adm. James Parkin, who planned the test, said: 'The success of this trial heralds a new dawn in how we conduct maritime aviation and is another exciting step in the evolution of the Royal Navy’s carrier strike group into a mixed crewed and uncrewed fighting force.'\nFor the ship's crew, the chance to watch fully loaded F-35s coming and going in 'beast' mode was the highlight.\nOn the bridge Lt. James Holton, second navigator, said: 'I hate to say it but everyone was humming the tune to \"Top Gun.\" It really was a sight to behold.'\nIn front of him an electronic display showed a gentle wind coming from the port side. The quartermaster sat at the central control panel, making tiny adjustments to keep the 65,000-tonne ship on course to keep conditions constant for the Osprey coming in to land.\n'Check quarters,' came the call from the first officer of the watch, standing at his usual position at the center of the bridge.\n'Port clear,' comes the response from one side, mirrored by a lookout on the other.\nThe Osprey, with its two wings and unique tilt rotors directed up for maximum lift, touched down on deck soon after.\nIt is Cmdr. Richie Welsh's responsibility to make sure a U.S. Marine Corps Osprey can be moved around the hangar safely and efficiently, so that maintenance crews can do their work\nA Royal Navy Wildcat helicopter is maneuvered through the vast hangar, past a Merlin aircraft parker on the left hand side. The space is so big it could fit the length of two frigates\nThe final test was to come the following day: How to park it!\nIn the gloom of the cavernous hangar below, Cdr. Richie Welsh had done the table-top planning and the walk-throughs.\nThe final step would be to bring an Osprey down in the vast aircraft lift, and move it around to make sure that it actually fits where it needs to fit.\nIt changes the carrier from being a 'lily pad,' with aircraft simply hopping on and off, to serving as a base for American Osprey squadrons.\n'It will give us an opportunity of making sure it fits into all of the services needed to maintain them,' he said.\nMost watched News videos\n- Moment passengers 'stop' man who pulled down trousers on tube\n- Moment Cycling Mikey pushes bike into a car after furious row\n- Shocking moment man is gored to death after charging at bull\n- Shocking moment woman strikes flight attendant before being removed\n- Kristen Welker calls out JB Pritzker over Gerrymandering\n- Family-friendly restaurant Cracker Barrel unveils bold new look\n- Chinese navy vessel collides with one of its own chasing Philippine boat\n- Chinese Navy ship collides with own vessel while chasing boat\n- Florida man knocks out kayakers while attempting a DAREDEVIL leap\n- Hawaii ferry is tossed by strong waves before being run aground\n- Biblical flooding hits Wisconsin leaving residents trapped in homes\n- Moment 'dine and dashers' run out on £200 bill at Indian restaurant"
    },
    {
      "url": "https://www.dailymail.co.uk/news/article-9761205/Japan-vows-defend-Taiwan-alongside-China-invades-island-next.html",
      "text": "Japan vows to defend Taiwan alongside the US if China invades the island because 'Okinawa could be next'\n- Deputy prime minister Taro Aso reportedly said a 'major problem' in Taiwan could also pose a threat to the Japanese city of Okinawa\n- He made the comment on Monday at a fundraiser, Kyodo news agency reported\n- His remarks angered Beijing which considers Taiwan as its own territory\n- China said Aso's comments were 'harmful' to Sino-Japanese relations\n- On Tuesday, Aso said any issue over Taiwan should be resolved through dialogue\nJapan has vowed to join the U.S. in defending Taiwan if it is invaded by China because - it said - Japan could be next.\nDeputy prime minister Taro Aso said on Monday that such an event in Taiwan could pose a threat to the Japanese city of Okinawa, Kyodo news agency reported.\n'If a major problem took place in Taiwan, it would not be too much to say that it could relate to a survival-threatening situation [for Japan],' Aso said at a fundraising party by a fellow Liberal Democratic Party lawmaker.\n'We need to think hard that Okinawa could be the next,' Aso was quoted by Kyodo as saying.\nA 'survival-threatening situation' refers to a situation in which an armed attack against a foreign country that is in a close relationship with Japan occurs, which in turn poses a clear risk of threatening Japan's survival.\nSuch a situation is one of the conditions that need to be met for Japan to exercise its right of collective self-defence, or coming to the aid of an ally under attack.\nAso's comments have angered Beijing, which regards Taiwan as its own territory.\nJapan has vowed to join the U.S. in defending Taiwan if it is invaded by China because - it said - Japan could be next. Deputy prime minister Taro Aso (pictured) said on Monday that such an event in Taiwan could pose a threat to the Japanese city of Okinawa, Kyodo news agency reported [File photo]\nChina foreign ministry spokesperson Zhao Lijian said at a regular news conference on Tuesday that Aso's remarks 'harmed the political foundation of China-Japan relations', and that China 'resolutely opposed' them.\n'No one should underestimate the Chinese people's staunch resolve, firm will, and formidable ability to defend national sovereignty,' he said.\nChina claims a group of Japanese-controlled islets in the East China Sea. The tiny uninhabited isles, called the Senkaku in Japan and Diaoyu in China, are off Japan's southern island of Okinawa.\nAso, asked about Japan's stance on the cross-strait issue at a news conference on Tuesday, said any contingency over Taiwan should be resolved through dialogue.\n'We are closely monitoring the situation,' Aso, who doubles as finance minister, told reporters.\nChina foreign ministry spokesperson Zhao Lijian (pictured) said at a regular news conference on Tuesday that Aso's remarks 'harmed the political foundation of China-Japan relations', and that China 'resolutely opposed' them [File photo]\nChief Cabinet Secretary Katsunobu Kato, when asked if Aso's Monday comment was in line with the government's stance, declined to comment, saying he was not aware of the Aso comment in detail, but reiterated Japan's official policy on the matter.\n'Japan hopes the Taiwan issue will be resolved through direct dialogue between parties concerned in a peaceful manner. That has been our consistent stance,' the top government spokesman said.\nTaiwan is facing growing pressure from China, which claims the self-governing island off its east coast as its territory.\nThe U.S. does not have formal diplomatic ties with Taiwan under what is known as the one-China policy, but is legally bound by its own laws to ensure that Taiwan can defend itself, AP reported.\nJapan ceased to recognise Taiwan in 1972, but is a key U.S. ally in the Asia Pacific region. It firmly opposes Chinese advancement in the South China Sea.\nChina, which has been ruled single-handedly by the Communist Party since 1949, says Taiwan must eventually come under its control and reserves the right to use force if necessary, according to AP.\nMost watched News videos\n- Moment passengers 'stop' man who pulled down trousers on tube\n- Moment Cycling Mikey pushes bike into a car after furious row\n- Shocking moment man is gored to death after charging at bull\n- Shocking moment woman strikes flight attendant before being removed\n- Kristen Welker calls out JB Pritzker over Gerrymandering\n- Family-friendly restaurant Cracker Barrel unveils bold new look\n- Chinese navy vessel collides with one of its own chasing Philippine boat\n- Chinese Navy ship collides with own vessel while chasing boat\n- Florida man knocks out kayakers while attempting a DAREDEVIL leap\n- Hawaii ferry is tossed by strong waves before being run aground\n- Biblical flooding hits Wisconsin leaving residents trapped in homes\n- Moment 'dine and dashers' run out on £200 bill at Indian restaurant"
    },
    {
      "url": "https://www.dailymail.co.uk/debate/article-13138473/LORD-DANNATT-world-dangerous-place-fear-Britain-chance-saloon.html",
      "text": "LORD DANNATT: The world has become a dangerous place, and I fear Britain is now in the last-chance saloon\nDuring the Cold War years, the defence budget of the United Kingdom was around 5 per cent of GDP. This bought us a Royal Navy with three aircraft carriers, a surface fleet of around 50 frigates and destroyers and an effective submarine fleet.\nThe Royal Air Force contributed to Nato's 2nd Tactical Air Force from four bases in Germany while the Army could field four war-fighting divisions as part of 1st British Corps.\nThat level of defence expenditure produced a military capability that was a major component in the overall strength of Nato – a strength that played a significant role in the demise of the Soviet Union and the collapse of the Warsaw Pact.\nIn the hope of drawing Russia back into the family of European nations, that demise was not hailed as a victory but, without firing a single shot, the prospect of a lasting peace had been secured for Europe. The American political scientist, Francis Fukuyama, even went as far as to declare the fall of the Berlin Wall in 1989 to be the end of history. Successful deterrence had produced peace, but what a lot has changed in the last 35 years.\nToday, at less than 2.3 per cent of GDP, the UK's defence budget is far too small for our international obligations and defence commitments – too many peace dividends have been taken while the world has once again become a very dangerous place.\n'Today, at less than 2.3 per cent of GDP, the UK's defence budget is far too small for our international obligations and defence commitments' writes Lord Dannatt\nThe national flag of the United Kingdom is displayed as British troops and service personal remaining in Afghanistan are joined by International Security Assistance Force\nWe may feel a little smug that we exceed the Nato figure of 2 per cent of GDP to be spent on defence by member nations but that figure is a minimum, not a goal to be achieved (File Image)\nWe may feel a little smug that we exceed the Nato figure of 2 per cent of GDP to be spent on defence by member nations but that figure is a minimum, not a goal to be achieved. There is a legacy of under-funding defence across Europe and in this country, which represents an increasing level of security risk. The chickens look as if they are coming home to roost.\nA glance around the world illuminates the gravity of the present challenges to our security – a conflict between Israel and Hamas in Gaza that threatens a wider war in the Middle East, tension between the US and China over Taiwan and a brutal war between Ukraine and Russia to name but three.\nBut of those three, what really matters to us in the UK is the security of Europe, now once again threatened by Russia – a Russia not defined by a hostile ideology as before but in the grip of a demagogic dictator.\nFor now, Russia is being contained at great expense in blood and treasure by Ukraine, although even that is hanging in the balance. If Russia were not perceived as an existential threat, why would Sweden and Finland have bid to join Nato, and Poland be hugely boosting its defence capability and on its way to having the largest army in Europe?\nSome see parallels with the 1930s as an historical indulgence but there are urgent lessons to be learnt. In the face of Hitler's threats, we chose appeasement, did not re-arm and war was the consequence. To prevent war, you have to pay the price of deterrence. A bully exploits weakness but respects strength.\nAs we discovered during the Cold War years deterrence is expensive, but the lesson of history is that the cost of fighting a war is disastrous (File Image)\nJunior Soldiers carry out final checks of their uniforms before they graduate from the Army Foundation College\nTheodore Roosevelt, US president at the beginning of the 20th century, stated that successful international diplomacy was achieved when one spoke quietly but carried a big stick. At Munich, Neville Chamberlain spoke loudly but only carried an umbrella. Neither Britain nor France carried a big stick.\nHowever, as we discovered during the Cold War years deterrence is expensive, but the lesson of history is that the cost of fighting a war is disastrous. In 1935 while pursuing appeasement not deterrence, we spent less than 3 per cent on defence, but in 1939 after war had broken out the figure shot up to 18 per cent and in 1940 when we were fighting for our very survival, it was 46 per cent.\nToday, we spend less than 2.3 per cent. Are we doomed to let history repeat itself? Had we possessed a credible trained army corps of four to six divisions in the late 1930s and been prepared to deploy it to France when Hitler was threatening Czechoslovakia after reoccupying the Rhineland, it is conceivable that the Second World War could have been prevented and the Holocaust never have happened.\nThen, as now, our army is considered to be a utilitarian organisation, good at fighting small wars in faraway places and helping at home when floods, pandemics or strikes threaten – but not seen as a strategic asset that can exert major influence.\nToday, in the face of a resurgent and aggressive Russia, there is a growing case to significantly increase our defence expenditure and to rebuild our land war-fighting capability. In the 1930s, commentators agonised that we could not deploy a single corps (up to 45,000 men), today we cannot deploy a single division (up to 15,000).\nFor now, Russia is being contained at great expense in blood and treasure by Ukraine, although even that is hanging in the balance (File Image)\nMilitary vehicles including trucks and support vehicles, all belonging to the 7 Light Mechanised Brigade unit of the British Army\nWe are in an election year. It is commonly held that there are no votes in defence. At the forthcoming general election, it is just possible that it will get more than its customary cursory treatment.\nFor it is not only the usual suspects, of which I would consider myself one, who are arguing that the UK is not prepared for a war nor our Armed Forces capable of conducting high intensity operations for an extended period.\nSome of our closest allies and Nato partners have expressed their doubts about our readiness and capability, while the national media has given front page coverage to our inadequacies and the House of Commons defence committee has been explicit in its criticisms of the state of our Armed Forces.\nThis should not be a party-political issue but is fast becoming a national emergency. Of course, there are conflicting spending priorities for the current Government and whichever party wins the next election, but the first duty of any government to the people of this country is the proper provision for their security.\nThe immediate defence challenge is to boost our support to Ukraine and to bolster our own defence capabilities. We are proud to say that we have donated £5billion to Ukraine over the last two years but as the country fighting on the front line today for our security, that figure should be doubled at least.\nUkraine is buying us the time to rebuild our own Armed Forces. A bloody land war in Europe underlines the need for us to be able to field an army that can play a key role in the deterrence of future Russian aggression. The numeric trained strength of the Regular Army should return to nearer 100,000 soldiers for us to be able to sustain forward deployments in support of our allies on the Russian border.\nAs well as increased expenditure on the new ways of warfare, the bitter fighting in Ukraine shows that the day of the main battle tank is far from over. We should double our plans to upgrade our Challenger tank fleet to around 300 and look again at the decision not to upgrade our Warrior infantry fighting vehicles. And our industrial base must be incentivised to produce the ammunition and missiles that Ukraine needs today and we might need tomorrow.\nIt may be dramatic to say that we are in the last chance saloon, but if we are, I do not want to take my last drink there.\nMost watched News videos\n- Moment passengers 'stop' man who pulled down trousers on tube\n- Moment Cycling Mikey pushes bike into a car after furious row\n- Shocking moment man is gored to death after charging at bull\n- Shocking moment woman strikes flight attendant before being removed\n- Kristen Welker calls out JB Pritzker over Gerrymandering\n- Family-friendly restaurant Cracker Barrel unveils bold new look\n- Chinese navy vessel collides with one of its own chasing Philippine boat\n- Chinese Navy ship collides with own vessel while chasing boat\n- Florida man knocks out kayakers while attempting a DAREDEVIL leap\n- Hawaii ferry is tossed by strong waves before being run aground\n- Biblical flooding hits Wisconsin leaving residents trapped in homes\n- Moment 'dine and dashers' run out on £200 bill at Indian restaurant"
    },
    {
      "url": "https://www.dailymail.co.uk/news/article-14634773/royal-navy-hms-prince-wales-deployment-far-east.html",
      "text": "The Royal Navy's £3.5billion flagship has set sail on its eight-month mission to the Far East as part of a huge military show of force that could see it clashing with China.\nCrowds cheered as HMS Prince of Wales departed her home of Portsmouth to lead an international maritime strike group which aims to send a 'powerful message' that Britain 'means business'.\nThe 65,000-tonne aircraft carrier - the biggest vessel ever built for the Senior Service - will lead a coalition of British, Norwegian and Canadian warships on operations in the Mediterranean, Middle East, south-east Asia, Japan and Australia.\nWhile the Government has not confirmed the precise route of 'Operation Highmast' - the codename for the deployment - the Navy has not ruled out sailing through the contentious 110-mile wide Taiwan Strait.\nThe mission comes amid mounting fears that China is planning to launch a full-scale invasion of the island, with Beijing's military having already drilled huge D-Day style assaults of Taiwan using soldiers, marines, warships and its air force.\nAnd as tensions continue to intensify, the commander of the British-led carrier strike group has insisted the Royal Navy stands ready to defy China - and that it is prepared for any sort of military operation.\n'I will deliver whatever mission I am ordered to go and do – that's my role,' a defiant Commodore James Blackmore told the Telegraph ahead of the UK task group's deployment.\n'My part of the bargain is being ready for all eventualities from a combat capability, from a defence engagement capability, from a partners and allies capability, so I'm ready to exercise whatever the Government or the Ministry of Defence asks me to do.'\nHMS Prince of Wales departed Portsmouth as she sets sail on her eight-month odyssey to the Far East\nAhoy! One female sailor on HMS Prince of Wales breaks ranks to crack a cheeky smile as the ship left Portsmouth today\nThe ship's company on the aircraft carrier appeared in high spirits as they waved to the crowds gathered in Portsmouth\nCommodore James Blackmore is leading the UK Carrier Strike Group. He is pictured on the flight deck of HMS Prince of Wales\nThousands of families and well-wishers lined the harbour walls at Portsmouth to wave off the £3.5billion naval leviathan, which will be accompanied from the navy base by Type 45 destroyer HMS Dauntless.\nBanners and flags were waved by members of the public from the walls and beach of Portsmouth harbour with sailors aboard the 65,000-tonne warship waving back to cheers from the crowds as they passed.\nIn a tribute to the Pope Francis, HMS Prince of Wales's ensign flag on its flight deck was at half-mast as a 'sign of a respect' to the late pontiff, a navy spokesman confirmed.\nThe ships will then be joined by two Norwegian vessels - tanker HNoMS Maud and frigate HNoMS Roald Amundsen - as well as the UK and Canadian frigates HMS Richmond and HMCS Ville de Quebec, which are sailing from Plymouth.\nThe support vessel Royal Fleet Auxiliary tanker RFA Tidespring will make up the final ship in the Carrier Strike Group (CSG), which will involve other ships and nations during the deployment called Operation Highmast.\nA contingent of 18 UK F-35B jets will join the carrier in the days after departure, with that number increasing to 24 during the deployment.\nAlso joining will be Merlin Mk2 anti-submarine helicopters from RNAS Culdrose and Merlin Mk4 Commando and Wildcat helicopters from RNAS Yeovilton, as well as an undeclared number of T-150 Malloy and Puma drones.\nCdre Blackmore, 50, said the deployment would send a 'powerful message' to allies and potential adversaries about the UK's naval and air power.\nThe 65,000-tonne warship is spearheading the UK's carrier strike group to the Far East. It is pictured on Tuesday afternoon\nExcited sailors on the aircraft carrier all lined the deck as it departed Portsmouth - dubbed the home of the Royal Navy\nSailors were all smiles as they lined up on the aircraft carrier's vast four-acre flight deck to wave goodbye to loved ones\nSay cheese! A family poses for a selfie as HMS Prince of Wales exits Portsmouth's glittering harbour on Tuesday\nFurther west in Plymouth, and frigate HMS Richmond was waved off by families as it departed the city to join the carrier group\nWhile he could not divulge the exact route the fleet would take while in the Indo-Pacific, he added there was a clear motive for being there.\nHe said: 'It's about supporting key trade routes that exist from the Indo-Pacific region to the UK, and supporting partners and allies in the region, showing that we are there as a capable and credible force should it be required.\n'That in a time of crisis, we can come together and fight together and show that we have a capability that we mean business with.'\nHe added: 'Working closely with partners from across the globe, Operation Highmast will demonstrate credible deterrence and our support to Nato and the rules-based international order.\n'This will reaffirm that the UK is secure at home and strong abroad and reinforce the UK's commitment to the Indo-Pacific.'\nJust weeks ago, Admiral Sir Tony Radakin, head of Britain's armed forces, met with top members of China's military during a low-key trip to the Asian superpower.\nThe meeting, the first by a British Chief of the Defence Staff in a decade, led to speculation the Chinese had warned Adm Radakin to steer clear of the Taiwan Strait during the carrier strike group's mission to the Far East.\nChina insists it owns almost all of the South China Sea and that the Taiwan Straight falls into its territorial waters.\nHMS Prince of Wales will be travelling to the Mediterranean and Middle East, before then heading to the Indo-Pacific region\nGemma McConnell, 42, from Plymouth, Devon, with children Lachlan, seven, and Chloe, four, wait to wave off 38-year-old Surgeon Commander David McConnell as the aircraft carrier, HMS Prince of Wales, sets sails from Portsmouth Naval Base\nViv Pyatt (on crutches), 61, from Probus, near Truro, Cornwall, and family wait to wave off her son Able Seaman Harry Pyatt, 24, who is serving on the Portsmouth-based supercarrier\nTwo young boys proudly hold a White Ensign flag aloft as HMS Richmond departed its home in Plymouth on Tuesday\nHowever, Nato says the contested stretch of sea are international waters and that vessels have a right to freely navigate it.\nDespite this, the 2021 deployment of the UK Carrier Strike Group - spearheaded by HMS Prince of Wales's sister ship, HMS Queen Elizabeth - did not traverse the strait.\nIt led to accusations from Tory MPs that Britain was seeking to cosy up to Beijing. Should the strike group again avoid the territory, similar accusations could arise.\nA total of 2,500 military personnel - about 2,100 British, 400 from Norway, Canada and Spain - will initially deploy as part of the naval strike group, with the numbers rising to 4,500 for the major exercises in the Indo-Pacific region.\nCaptain Will Blackett, commanding officer of HMS Prince of Wales, said: 'We have been training very, very hard for over a year now, and we're good to go.\n'This ship is a fantastic machine, she's got amazing equipment - state of the art - and we're very proud to take her around the world.\nCaptain Will Blackett, Commanding Officer of HMS Prince of Wales on board the aircraft carrier's gigantic flight deck\nCaptain Will Blackett RN, commanding officer of HMS Prince of Wales, left, Commodore James Blackmore RN, commander Carrier Strike Group, centre, and Captain Colin McGannity RN, commander Air Group, right, onboard HMS Prince of Wales\nThousands of people lined Portsmouth's historic wall to celebrate the departure of the aircraft carrier on Tuesday afternoon\nThree sailors on HMS Prince of Wales' sister ship, HMS Queen Elizabeth, watch as the carrier prepares to leave the naval base\n'But it only works because of the magic that's brought to it by the people on board.'\nLeading Engineering Technician (LET) Josh Thompson, 29, from Barnstable, Devon, said: 'Personally, it's something to be pretty proud of, it's something that doesn't come round very often, seeing stops in places that most people don't see.\n'And then also being a part of the bigger picture hopefully for the future of the UK and the world.'\nET John Davis, 24, from Oxford, said: 'I'm really excited to be honest, I'm quite proud of the fact I'll be doing it.'\nGemma McConnell, 42, from Plymouth, Devon, was with children Lachlan, seven, and Chloe, four, to wave off 38-year-old Surgeon Commander David McConnell in Portsmouth.\nShe said: 'You've got to believe in the Navy to be a Navy wife, a proper part of it.\n'It doesn't ever make me sad when he goes away, because I think it's an adventure, he gets to see the world, he's getting to be with amazing people and it just gives me an enormous sense of pride.'\nViv Pyatt, 61, from Probus, near Truro, Cornwall, came to see son Able Seaman Harry Pyatt, 24, off.\nShe said it had been an emotional farewell and added: 'We all had a few tears, even my son, he had a few tears, but he's got a girlfriend on board, so I think they'll look after each other, so they'll be fine.'\nDefence Secretary John Healey was full of praise for all those taking part in the military deployment to the Indo-Pacific.\nFamilies cheer HMS Richmond as it left Plymouth on Tuesday afternoon, with the ship's crew lining the frigate's deck\nIn Portsmouth, huge crowds gathered across the coast of the Hampshire city to mark the major naval deployment\nFamilies, many carrying Union Flags or holding banners, cheered and waved as HMS Prince of Wales glided past them\nCrowds gathered along Portsmouth's Hot Walls - the traditional view point for naval families to watch their loved ones as they depart the city on deployments\n'I want to thank the thousands of our armed forces personnel involved in the delivery of this immensely complex operation, demonstrating the UK's world-leading capability to deploy a major military force around the world,' he said.\n'This is a unique opportunity for the UK to operate in close co-ordination with our partners and allies in a deployment that not only shows our commitment to security and stability, but also provides an opportunity to bolster our own economy and boost British trade and exports.\n'As one of only a handful of countries in the world able to lead a deployment of this scale, the Royal Navy is once again demonstrating its formidable capability while protecting British values and sending a powerful message of deterrence to any adversary.'\nMinister for the armed forces, Luke Pollard MP - who was in Portsmouth to watch Prince of Wales and HMS Dauntless depart - added: 'The deployment of the HMS Prince of Wales Carrier Strike Group not only projects UK military power, but it's also a platform for our exports, for our businesses, for promoting UK jobs and growth, as well as our influence.\n'And by having an international-by-design task group with our Norwegian, Canadian and Spanish friends alongside us for this initial phase of the deployment, we're working with our allies showing strength by coming together in these more uncertain times.'\nStephen Morgan, Portsmouth South MP and former shadow armed forces minister, said the deployment of the Royal Navy fleet was one of HMS Prince of Wales' 'biggest yet'.\nArmed forces minister Luke Pollard was among the spectators watching the departure of HMS Prince of Wales in Portsmouth\nCommodore Blackmore, Commander Carrier Strike Group, centre, speaks to assembled media as Captain Will Blackett watches on\nA total of 2,500 military personnel - about 2,100 British, 400 from Norway, Canada and Spain - will initially deploy as part of the CSG. Pictured are members of HMS Prince of Wales' ship's company on the aircraft carrier's deck\nHMS Prince of Wales will embark up to 24 of the F-35 stealth jets for its eight-month mission\nThe vessel will also be equipped with a number of drones for the first time. They will be used to transfer small pieces of kit between ships\nSpeaking to MailOnline, the Labour MP added: 'Our aircraft carriers show our nation’s naval might and I know Portsmouth people will be feeling proud today of the vital role our city plays in pursuing peace and stability both at home and abroad.\n'For some in our community, today will also be bittersweet as they say goodbye to their friends and loved ones who will be carrying out such courageous and important work on this deployment.'\nThe CSG's first task will be to join a Nato exercise off France testing aerial defences before the ships move on to the Mediterranean to work with an Italian-led carrier force and then heading east via the Red Sea.\nHere, the navy could face the threat of potential drone and missile attacks by the Iranian-backed Houthi rebels in Yemen.\nThe terror group has previously attacked vessels passing through the Red Sea, one of the world's busiest and most important shipping routes.\nEarlier this year, Type 45 destroyer HMS Diamond was scrambled into action to shoot down a ballistic missile fired toward a merchant vessel in the region by the Houthis.\nIn the run up to the eight-month CSG deployment, the navy has been running a series of intensive drills to fend off large-scale 'drone swarm' assaults.\nThe carrier strike group is expected to return to the UK before Christmas.\nAnd not a single foot of UK borders it will protec...\nby Kentborn 103"
    },
    {
      "url": "https://www.dailymail.co.uk/news/article-14901681/SAS-veteran-breaks-silence-44-years-ROBERT-HARDMAN.html",
      "text": "It was the SAS that saved the life of Irish republican Bernadette Devlin after a loyalist assassination attempt, veteran reveals to ROBERT HARDMAN after 44 years\nHe saw a lot of grim scenes in 20 years of active service all over the world, yet this one remains stuck in his mind more than 40 years later.\n'It was a nightmare inside there,' recalls a soldier whom we will call Andrew. 'There was the husband on the kitchen floor with blood spurting out of an arterial wound. The children were screaming and their mother was in the bedroom with at least six bullets in her.'\nFortunately, she was still alive – just.\nIt was January 1981 on a snowy Northern Irish dawn at the bottom of a dead-end track in rural County Tyrone. Andrew was in charge of a three-man military observation team who had only just disarmed the gunmen responsible for this carnage.\nIt was now very clearly a life-or-death situation. Andrew had to summon immediate medical aid, without which the parents of those screaming children would soon be dead. He also needed military back-up as soon as possible, in case the terrorists received reinforcements or twigged that they actually outnumbered their captors.\nThe gunmen had severed the telephone line to this remote bungalow and the soldiers' radio wasn't working. Having despatched one of his men to run off in search of the nearest house to ring for help, he was left with one other soldier to manage three angry terrorists, three hysterical children and two critically wounded civilians. Thanks to Andrew, however, those children would not become orphans that day.\nBernadette Devlin (nee McAliskey), MP for Mid Ulster\nHis swift actions also averted major civil unrest. For that young mother was Bernadette McAliskey, one of the most high-profile Republican sympathisers in Northern Ireland. Up until now, even she has not heard the full story – revealed today by the Mail.\nA few years earlier as Bernadette Devlin, she had been the youngest MP in the House of Commons. There, she went down in history for crossing the floor of the House to hit the Home Secretary in the face after stating that the Parachute Regiment had acted in self-defence when they killed 13 civilians on 'Bloody Sunday' in 1972. She had since married teacher Michael McAliskey and the couple had three children aged nine, five and two.\nHer would-be killers were a hit squad from the outlawed loyalist Protestant paramilitary, the Ulster Defence Association. As it was, the attack prompted vicious reprisals from the Catholic Irish Republican Army. Had she died, however, there would have been sectarian mayhem. This was the height of 'the Troubles' and inter-community tensions were already at boiling point.\nThere have been numerous conspiracy theories ever since, including a popular nationalist narrative that Bernadette was under observation from a unit of the hated Parachute Regiment who made no effort to save her from a loyalist death squad. Years later, in a 2002 interview with the Mail's Geoffrey Levy, she attributed the couple's survival to a passing patrol of the Argyll & Sutherland Highlanders. Today, however, the Mail can reveal what really happened that horrific morning.\nFor the men who saved Bernadette and her husband that day were from the one Army unit which Irish republicans hated even more than the Paras. They were from the Special Air Service.\nAnd now the man in charge of that operation – 'Andrew' - has decided to speak out. He has done so with heavy heart as he has spent more than 40 years keeping his memories to himself, according to the regimental code of honour.\nBut the current Left-wing rewriting of the history of the 'Troubles' in Northern Ireland, repainting the Special Forces as villains and besmirching the reputation of 'the Regiment', has goaded this taciturn 70-year-old soldier beyond endurance.\nHe is appalled by the prospect of publicly funded human rights lawyers dragging Army veterans into the dock in pursuit of compensation for convicted terrorists and their families.\nHe is furious that Sir Keir Starmer claims the current British law designed to protect veterans is 'unlawful' – as he did again last week – because it clashes with a European one. Emboldened by the Daily Mail's 'Stop The SAS Betrayal' campaign, he wants to show that, far from being some sort of rogue unit, the SAS were there to save lives – even those of the people who loathed them.\nAndrew was a 26-year-old corporal with six years in the SAS behind him when the call came through in January 1981 to mount an observation operation on the McAliskey home – overnight.\nBernadette Devlin with Gerry Adams at the Bloody Sunday rally\n'We were very busy in those days. This was what we called a 'fast ball' operation,' he says. 'I had spent the day protecting a Belfast councillor during his constituency surgery. Then this job came in for that night. There was information of a threat to a celebrity politician. I learned afterwards that she knew she was on a hit list.\n'There wasn't time to do a background study on the situation. We were just dropped off in the early hours of the morning and left to make an approach march to a grid reference where this bungalow was situated.' There was no question of walking up the lane. The three soldiers had to make their way in the dark for miles through driving snow around a peat bog.\nTheir orders were to establish an observation position as close to the bungalow as possible, staying out in the open, regardless of the weather, for up to a week (a standard operational procedure known as 'hard routine'). Each man was armed with an Armalite M16 rifle and a Browning 9mm semi-automatic handgun. The plan was to keep watch round the clock, taking turns to sleep. They had only just arrived at first light and were still doing their initial circuit of the property, known as a '360'. This had just become more problematic following the discovery that the couple were breeding greyhounds in an outbuilding and the dogs had started barking, at which point the three soldiers could see a Hillman Avenger driving up the lane towards the house.\nThe car was carrying three members of the UDA, Andrew Watson, Thomas Graham and Robert Smallwood, armed with a Smith & Wesson revolver and two 9mm Brownings. Leaving the engine running, they had jumped out. Two were smashing in the door to the bungalow with sledge hammers while a third set about tearing down the telephone line.\nInside, Michael McAliskey had already seen a man in a balaclava through a window and yelled at his wife to hide under the bed. He rushed to the door and was trying to hold it back but the gunmen prised it open. A pistol was thrust through the gap and bullets started flying. He was hit in the arm and the gang pushed on into the house, one shooting at Michael – now on the floor bleeding and pretending to be dead.\nAnother man went in search of Bernadette and found her in the bedroom. He fired at least six shots into her back, chest, legs and arms (some reports say as many as nine), leaving her for dead wedged in the gap between the bed and the wall where she had tried to hide. The children, unharmed, were in deep shock.The two gunmen ran for the car, just as the driver had managed to pull down the telephone cable with a rope. They were suddenly face to face with 'Andrew' and his two colleagues, their M16s raised and ready to fire.\n'We were seven or eight metres away and it was face on face like two charging bulls. We had every right to drop all three of them,' says 'Andrew'. 'But we had shock on our side and we were more assertive. We were all in Army camouflage shouting, 'Security forces. Put down your weapons'. They could see it was a case of comply or die – so they complied.' Andrew ran inside, saw Michael on the floor and three children 'running around, hysterical' before finding Bernadette.\nDespite suffering multiple bullet wounds and now being confronted (while naked) by a second armed stranger in the space of a minute, the famously forthright political campaigner was still defiant. 'I suppose you bastards are coming in to finish me off,' she groaned. 'I didn't say who we were. I couldn't help her with this great hole in her chest. I just told her help was on its way,' Andrew recalls. Then he turned his attention back to Michael. 'We didn't have any drips or tourniquets. I just told him to keep the pressure on his arm to stem the bleeding.'\nHome of Bernadette Devlin in Coalisland, County Tyrone, where in 1981 she was attacked by members of the Ulster Freedom Fighters\nThe immediate problem was communications. As they were running towards the house, Andrew had issued the signal: 'Contact! Wait out!' This was the all-important alert telling HQ that his unit was going into action, to clear the airwaves, to await his next update and to have reinforcements despatched immediately. 'But communications just ended with my transmission. I never got the confirmation back that they had heard us.' Did anyone even know they were there?\nWith no phone and no radio (standard-issue Army transmitters were notoriously unreliable in freezing weather), there had been no option but to send one of his two men to run off in search of a telephone.\n'Luckily, as it turned out, the unit had heard my 'Contact! Wait out!' and had already deployed a quick-reaction force from the resident unit in Dungannon,' says Andrew.\nA company from the Argyll & Sutherland Highlanders were on the ground inside 15 minutes, followed swiftly by a helicopter to take the McAliskeys to hospital. 'Then we handed over the scene,' says Andrew, 'and extracted ourselves.' Having had no sleep for more than 24 hours, he returned to barracks for a shower and the mandatory debrief with the police and the military legal team. Then it was on to the next task.\nA year later, 'Andrew' would be in the thick of the action in the Falklands War, shortly after the terrorists had received sentences (life for ringleader Watson, 20 years for Graham and 15 years for Smallwood, who was later murdered by the IRA). Andrew never heard from Bernadette, who would always maintain that he and his men were from the hated Paras, had no interest in saving her and had made no effort. 'Had it been left to the Paras, I would be dead,' she told the Mail in 2002, claiming that it was the Argylls who saved the day. 'Rob the medic saved our lives. He called a military helicopter and got the Paras to hand over their medical packs to stem our wounds.\n'The Paras were confused and paralysed. It was the Argylls who took control and we did not die.'\nShe also gave a crystal decanter to the military surgeon whose brilliant handiwork in hospital had saved both her and her husband (even though the doctor was a Para).\nOne can but wonder what Bernadette would say if she knew what really happened that day. The Mail has approached her for comment.\nIn such horrific circumstances, she can be forgiven for not knowing who was who. She showed commendable fortitude that day simply by keeping herself alive – and even cracking a joke. Having become disillusioned with politics and politicians, she would go on to devote her life to social projects in South Tyrone, as she still does. Despite her lifelong condemnation of the British state, this tenacious activist would never hesitate to attack Sinn Fein, the IRA and the Irish government, too, for letting down their own people.\nThe horrors of that day left their mark on all the family, including Bernadette's daughter, Roisin, who later spent some time in jail, while pregnant, fighting extradition to Germany following a 1996 IRA mortar attack on a British Army base (repeated extradition attempts by the Germans were ultimately denied by a British judge).\nThe attack on the McAliskeys also led to savage reprisals by the IRA. Days later, an eight-man unit murdered 86-year-old First World War hero and retired politician Sir Norman Stronge, 86, along with his only son, James, in the family home, Tynan Abbey. The murderers then torched the place to the ground.\nBut the aftermath could have been far worse had Andrew and his team not done what they did that January day in County Tyrone. While he is fiercely proud of the SAS, he plays down his own role. 'We just did our best in the circumstances. And it didn't matter which side the attackers were on. They were just terrorists as far as I was concerned.\n'We had every justification to shoot them but we showed constraint. If our actions had been different, then I might now find myself in the dock. But I've not said anything since.'\nSo why talk now? 'Because now is the time to talk.'"
    },
    {
      "url": "https://www.dailymail.co.uk/news/article-12351291/Giving-Russians-taste-medicine-Ukraine-pounds-Putins-forces-rockets-Moscow-ally-North-Korea-missiles-bound-frontline-captured.html",
      "text": "Giving the Russians a taste of their own medicine: Now Ukraine pounds Putin's forces with rockets made by Moscow ally North Korea after missiles bound for frontline are captured\n- Russia has accused Ukraine of a 'terror attack' after a missile attack near border\n- Ukrainian soldiers were seen using North Korean rockets 'seized' by an ally\nUkraine is understood to be targeting Russian President Vladimir Putin's forces using rockets made by the invader's ally North Korea.\nThe Russian Defense Ministry said it shot down a Ukrainian missile in the city of Taganrog, about 40 kilometers (about 24 miles) east of the border with Ukraine, and local officials reported 20 people were injured, identifying the epicenter as an art museum.\nDebris fell on the city, the ministry added, alleging the missile was part of a 'terror attack' by Ukraine.\nOleksiy Danilov, Ukraine's secretary of the National Security and Defense Council, blamed Russian air defense systems for the explosion.\nRussia's Defense Ministry said it downed a second Ukrainian missile near the city of Azov, which like Taganrog is in the Rostov region, and debris fell in an unpopulated location.\nEarlier in the day, a Ukrainian drone was shot down outside Moscow, the Defense Ministry said, in the third drone strike or attempt on the capital region this month. The ministry reported no injuries or damage in the latest incident, and it didn't give an exact location where the drone fell.\nUkraine is understood to be targeting Russian President Vladimir Putin's forces using rockets made by the invader's ally North Korea. (Pictured: Putin, right, and North Korean leader Kim Jong-Un)\nThe Russian Defense Ministry said it shot down a Ukrainian missile in the city of Taganrog, about 40 kilometers (about 24 miles) east of the border with Ukraine\nSince the war began, Russia has blamed Ukraine for drone, bomb and missile attacks on its territory far from the battlefield's front line. Ukrainian officials rarely confirm being behind the attacks, which have included drone strikes on the Kremlin that unsettled Russians.\nThe strikes have hit Russian ammunition and fuel depots, as well as bridges the Russian military uses to supply its forces, and military recruitment stations. The attacks have also included killings of Russian-appointed officials on occupied Ukrainian territory.\nIt comes as Ukrainian soldiers were observed using North Korean rockets that they said were seized by a 'friendly' country before being delivered to Ukraine, the Financial Times reported on Saturday.\nUkraine's defence ministry suggested the arms were captured from the Russians, the newspaper said.\nThe United States has accused North Korea of providing arms to Russia, including alleged shipments by sea, but has not offered proof and North Korean weapons have not been widely observed on the battlefields in Ukraine.\nNorth Korea and Russia deny conducting arms transactions.\nThe North Korean weapons were shown by Ukrainian troops operating Soviet-era Grad multiple-launch rocket systems near the destroyed eastern city of Bakhmut, site of lengthy brutal fighting, the report said.\nRussia's Defence Minister Sergei Shoigu made a rare visit to Pyongyang this week to celebrate the 70th anniversary of the end of the Korean War, the first visit by Moscow's top defence official since the 1991 break-up of the Soviet Union.\nDuring the visit, Shoigu was photographed viewing banned North Korean ballistic missiles with leader Kim Jong Un at a military expo in Pyongyang, signalling deeper ties between the two countries as they each face off with the United States.\nRussian forces on Friday struck the central Ukrainian city of Dnipro and pounded a key village in the southeast that Ukraine claimed to have recaptured in its grinding counteroffensive, while Moscow accused Kyiv of firing two missiles at southern Russia and wounding 20 people.\nA view of a house in Ukraine's eastern Donetsk region, destroyed by a recent Russian attack as the war continues to escalate\nNorth Korean leader Kim Jong Un, right, and Russian Defense Minister Sergei Shoigu, left, toast at a banquet hall of the ruling Workers' Party's headquarters in Pyongyang, July 27\nPresident Volodymyr Zelenskyy, meanwhile, marked Ukraine's Statehood Day by reaffirming the country's sovereignty - a rebuke to Russian President Vladimir Putin, who used his claim that Ukraine didn't exist as a nation to justify his invasion.\n'Now, like more than a thousand years ago, our civilizational choice is unity with the world,' Zelenskyy said in a speech on a square outside St. Michael's Monastery in Kyiv. 'To be a power in world history. To have the right to its national history - of its people, its land, its state. And of our children - all future generations of the Ukrainian people. We will definitely win!'\nHe also honored servicemen and handed out first passports to young citizens as part of ceremonies. The holiday coincides with commemorations of the adoption of Christianity on lands that later became Ukraine, Russia and Belarus.\nThree months ago, a Russian warplane accidentally dropped a bomb on Belgorod, injuring two people, in an incident where Ukraine was initially suspected.\nIn Dnipro, an apparent Russian missile attack wounded nine people in the area of a newly constructed and as yet unoccupied 12-story apartment building, as well as an unoccupied adjacent Security Service of Ukraine building. 'Russian missile terror again,' Zelenskyy wrote on social media.\nVideo showed the apartment building's upper floors in ruins, with gray smoke billowing from them, and flames raging in the night at ground level, where shattered concrete and glass littered a courtyard.\nRussia has often struck apartment buildings during the conflict, while denying it intentionally targets civilians.\nMeanwhile, the commander of Ukraine's armed forces, Col Gen Oleksandr Syrskyi, said his troops were pushing forward in parts of eastern Ukraine occupied by Russia and meeting stiff resistance as the war drags into its 18th month.\n'The enemy fiercely clings to every centimeter, conducting intense artillery and mortar fire,' he said in a statement.\nRecent fighting has taken place at multiple places along the more than 1,000-kilometer (more than 600-mile) front, where Ukraine deployed its recently acquired Western weapons to push out the Kremlin's forces. However, it is attacking without vital air support and faces a deeply entrenched foe.\nNorth Korea's leader Kim Jong Un (left) guides Russia's Defence Minister Sergei Shoigu (right) to the banquet hall during his visit to Pyongyang, with a large portrait of Russian leader Vladimir Putin hanging on the wall\nA Western official said Thursday that Ukraine had launched a major push in the southeast. Putin acknowledged that fighting has intensified there, but insisted Kyiv's push has failed.\nZelenskyy posted a video Thursday night in which Ukrainian soldiers said they had taken Staromaiorske in the Donetsk region. Russian military bloggers said artillery fire at the Ukrainian troops had effectively razed the village and reported more barrages Friday.\nCapturing the village, which in 2014 had a population of 682, would give Ukraine a platform to push deeper into Russian-held territory, the bloggers noted.\nThe area has been a focus of Ukraine's counteroffensive since June, and its troops have previously captured several other villages there as they slowly work their way across extensive Russian minefields.\nIt was not possible to verify either side's claims about what is happening in the war zone.\nSyrskyi said fighting that targets the enemy's artillery as well as its command and control structure is a priority as his troops probe Russian lines for weaknesses.\n'In these conditions, it is crucial to make timely management decisions in response to the situation at hand and take measures for maneuvering forces and resources, shifting units and troops to areas where success is evident, or withdrawing them from the enemy's fire,' he said.\nRussia is trying to hold on to the territory it controls in the four provinces it illegally annexed in September - Zaporizhzhia, Donetsk, Kherson and Luhansk.\nMost watched News videos\n- Moment passengers 'stop' man who pulled down trousers on tube\n- Moment Cycling Mikey pushes bike into a car after furious row\n- Shocking moment man is gored to death after charging at bull\n- Shocking moment woman strikes flight attendant before being removed\n- Kristen Welker calls out JB Pritzker over Gerrymandering\n- Family-friendly restaurant Cracker Barrel unveils bold new look\n- Chinese navy vessel collides with one of its own chasing Philippine boat\n- Chinese Navy ship collides with own vessel while chasing boat\n- Florida man knocks out kayakers while attempting a DAREDEVIL leap\n- Hawaii ferry is tossed by strong waves before being run aground\n- Biblical flooding hits Wisconsin leaving residents trapped in homes\n- Moment 'dine and dashers' run out on £200 bill at Indian restaurant"
    },
    {
      "url": "https://www.dailymail.co.uk/news/article-10365857/AUKUS-Australias-submarine-deal-UK-set-big-alarm-China.html",
      "text": "Why Australia's submarine deal with the US and UK has set off 'a very big alarm' in China\n- Australia has signed a security alliance with the US and the UK called AUKUS\n- Pact will give Australia the technology to build nuclear-powered submarines\n- China views the pact with suspicion and fears it aims to contain Beijing's navy\nThe AUKUS pact has set off a 'very big alarm' in China, according to a senior Taiwanese politician.\nThe security alliance between Australia, the US and UK, announced in September, includes plans to give Australia technology to build eight nuclear-powered submarines before 2040.\nTaiwanese MP Wang Ting-yu - who serves on his parliament's foreign affairs and national defence committee - has told The Australian that Beijing fears the allies aim to block China's navy in shallow seas and prevent it from projecting power into the blue waters of the Pacific.\nHMAS Rankin submarine conducts helicopter transfers in Cockburn Sound, Western Australia last month as part of Rankin's training assessments to ensure the boat is ready to deploy\nChinese President Xi Jinping delivers a speech at the New Year gathering on December 31\nHe said the Chinese government believes the AUKUS pact is more of a threat than the Quad alliance between the US, Australia, Japan and India.\n'We have information from inside China. They regard AUKUS more seriously than the Quad, especially the submarine [agreement],' Mr Wang told the newspaper.\n'That's a very big alarm to Beijing. They're facing historical challenges, or historical co-operation, to choke them inside of their near seas.'\nIn November Defence Minister Peter Dutton signed a formal agreement alongside the US and UK to allow the countries to share information on the nuclear-powered vessels.\nThe agreement was signed in a ceremony alongside US Chargé d'Affaires Michael Goldman and UK High Commissioner Victoria Treadell.\nChina's foreign ministry said the AUKUS deal 'escalates regional tensions'.\n'It stimulates [an] arms race, threatens regional peace and stability, and undermines international nuclear non-proliferation efforts,' Chinese foreign affairs spokesman Zhao Lijian said.\nChina's acting ambassador to Australia, Wang Xining, recently called Australia 'a naughty guy' over the AUKUS submarine deal, arguing it was helping the proliferation of nuclear weapons in south-east Asia.\nHe urged Australia to 'refrain from doing anything that's destructive to our relationship', after Mr Dutton had indicated Australia would support the US in any potential conflict over Taiwan.\nAustralia insists it has no plans to build or use nuclear weapons.\nA new arms race is developing in the Pacific between the US and China, which could also drag in Russia - which borders the ocean - and the UK, after it signed a new defence pact with America and Australia. This graphic compares the relative sizes of each country's current nuclear arsenals\nChina is expanding its military as its economy balloons to rival that of the US, having lagged behind for decades.\nIn addition to building new nuclear missiles and silos, it has constructed new aircraft carriers, tanks, fighter jets, spy and attack drones, along with new rifles for its troops.\nBeijing has used the new hardware to take a more aggressive stance in the Pacific: Imposing its rule on Hong Kong, menacing Taiwan, and laying claim to a number of uninhabited islands in the South China Sea which it has constructed military bases on top of.\nIt has also been pressing its claim to a number of other islands whose ownership is disputed, creating tensions with other regional powers such the Philippines, Vietnam, Malaysia and others. Similar disputes are underway in the East China Sea, around islands claimed by Japan.\nChina claims rights over the South China Sea in its entirety, which would hand Beijing control over hugely valuable international shipping lanes, fishing grounds which neighbouring countries rely on for food, and deposits of coal and oil which dot the seabed.\nThe US and its allies have been pushing back on these claims, and frequently conduct what they call 'freedom of navigation' operations through waters that China claims as its own in defiance of Beijing.\nA recent and high-profile mission was led by the UK's newest aircraft carrier - HMS Queen Elizabeth - and its strike group, which included American destroyers. It provoked and angry response from the Communist Party (CCP).\nChina is using its new military hardware and economic might to throw its weight around in the Pacific, most notably in the South China Sea which has caused disputes with neighbours including Vietnam, the Philippines and Malaysia\nWith the end of the war in Afghanistan and the signing of the new AUKUS pact, attention has shifted away from the Middle East and towards the Pacific as the threat of direct conflict between the US and China looming large.\nThe flashpoint is likely to be Taiwan - and island off the Chinese coast that houses the remnants of the People's Republic of China, which once ruled the country and was deposed by the CCP when it came to power.\nHistorically, the US has recognised the ROC as the legitimate government of China and the two have a long-standing alliance. Taiwan views itself as an independent state, while Beijing considers it a breakaway province.\nTensions have mounted in recent years after a 2019 speech by Xi Jinping in which he committed himself to 'reunifying' Taiwan with the mainland, saying he is willing to use force if necessary.\nThe US has a policy of 'strategic ambiguity' towards Taiwan, refusing to say how far it would go in defence of the island - though Joe Biden recently suggested any attack would prompt a war. Officials later said he had misspoke.\nWith the signing of the AUKUS pact, Australia and Britain could also find themselves on the frontlines of the conflict - with Australia defence minister Peter Dutton admitting as much last week.\nThe Chinese.. are very clear of their intent with regard to Taiwan [and] the United States has been very clear of their intention toward Taiwan,' he said. 'Nobody wants to see conflict but that really is a question for the Chinese.'\nPictured: Defence Minister Peter Dutton signing the Exchange of Naval Nuclear Propulsion Information Agreement with US chargé d'affaires Michael Goldman (second right) and British High Commissioner Victoria Treadell (right) at Parliament House in Canberra in November\nMost watched News videos\n- Moment passengers 'stop' man who pulled down trousers on tube\n- Moment Cycling Mikey pushes bike into a car after furious row\n- Shocking moment man is gored to death after charging at bull\n- Shocking moment woman strikes flight attendant before being removed\n- Kristen Welker calls out JB Pritzker over Gerrymandering\n- Family-friendly restaurant Cracker Barrel unveils bold new look\n- Chinese navy vessel collides with one of its own chasing Philippine boat\n- Chinese Navy ship collides with own vessel while chasing boat\n- Florida man knocks out kayakers while attempting a DAREDEVIL leap\n- Hawaii ferry is tossed by strong waves before being run aground\n- Biblical flooding hits Wisconsin leaving residents trapped in homes\n- Moment 'dine and dashers' run out on £200 bill at Indian restaurant"
    },
    {
      "url": "https://www.dailymail.co.uk/news/article-13799965/Chinese-Filipino-coast-guard-ships-collide-disputed-waters.html",
      "text": "This is the shocking moment Chinese and Filipino coast guard ships collide in the latest clash over disputed waters - as both countries blame each other for the ocean smash.\nThe Chinese coast guard blasted the Philippine ship as they claimed that they manoeuvred and 'deliberately collided' with their boat 'in an unprofessional and dangerous manner'.\nBut Philippine officials in Manila said it was their coast guard ship, the BRP Teresa Magbanua, that was rammed three times by the Chinese coast guard without any provocation, causing damage to the Philippine vessel.\nThe incident is the second confrontation in days near Sabina Shoal, about 85 miles west of the Philippine province of Palawan, in the internationally recognised exclusive economic zone of the Philippines.\nThe Philippine ship, the Magbanua, has been anchored in Sabina since mid-April after Manila suspected that China may construct a structure to seize the uninhabited island.\nThe Chinese coast guard slammed the Philippine ship as they claimed that they manoeuvred and 'deliberately collided' with their boat 'in an unprofessional and dangerous manner'\nPhilippine officials in Manila said it was their coast guard ship, the BRP Teresa Magbanua, that was rammed three times by the Chinese coast guard\nThe Philippine ship, the Magbanua, has been anchored in Sabina since mid-April after Manila suspected that China may construct a structure to seize the uninhabited atoll\nThe incident is the second confrontation in days near Sabina Shoal, about 85 miles west of the Philippine province of Palawan, in the internationally recognised exclusive economic zone of the Philippines\nChina claims nearly all the oil and resource-rich waters of the South China Sea and has ignored counter-claims from the Philippines, Vietnam, Taiwan, Brunei and Malaysia\nChina harboured the same suspicions and recently filed a diplomatic protest against the Philippines due to the ship's prolonged presence at the shoal.\nBeijing is rapidly expanding its military and has become increasingly assertive in pursuing its claim to virtually the entire South China Sea, which is crucial to international trade.\nThe tensions have led to more frequent confrontations, primarily with the Philippines, and could drag in with the United States, which is bound by a treaty to defend the Philippines.\nThe long-time territorial disputes also involve other claimants including Vietnam, Taiwan, Malaysia and Brunei.\nChina has rejected a ruling by a UN-backed arbitration panel that negated almost all of its historically based claims in the South China Sea.\nCommodore Jay Tarriela of the Philippine coast guard said in Manila that the Magbanua had dropped its anchor again and would not withdraw from Sabina Shoal 'despite the harassment, bullying activities and escalatory action of the Chinese coast guard'.\nVideo released by the Philippine coast guard appeared to show the Magbanua being rammed by a Chinese coast guard ship.\nThe US condemned 'the multiple dangerous violations of international law by the PRC (People's Republic of China), including today's intentional ramming of the BRP Teresa Magbanua while it was conducting lawful operations within the Philippines' Exclusive Economic Zone'.\n'We stand with the Philippines in upholding international law,' US ambassador to Manila MaryKay Carlson said on X.\nBeijing is rapidly expanding its military and has become increasingly assertive in pursuing its claim to virtually the entire South China Sea, which is crucial to international trade\nThe tensions have led to more frequent confrontations, primarily with the Philippines, and could drag in with the United States\nLong-time territorial disputes also involve other claimants including Vietnam, Taiwan, Malaysia and Brunei\nThe US has repeatedly warned that it is obligated to defend the Philippines if Filipino forces come under an armed attack in the South China Sea.\nOn Tuesday, Adm Samuel Paparo, the head of US Indo-Pacific Command, said the US military is open to consultations about escorting Philippine ships in the disputed waters.\nChina's coast guard, navy and accompanying ships regularly clash with Philippine vessels during attempts to resupply Filipino sailors stationed in parts of the South China Sea claimed by both countries.\nAs the confrontations become increasingly hostile, resulting in injuries to Filipino sailors and damage to their ships, the Philippine government has faced questions about invoking the treaty alliance with Washington.\nSabina Shoal is near Second Thomas Shoal, another flashpoint where China has hampered the resupply of Philippine forces.\nBoth countries reached an agreement last month to prevent further confrontations at the shoal.\nVideo released by the Philippine coast guard appeared to show the Magbanua being rammed by a Chinese coast guard ship\nThe US condemned 'the multiple dangerous violations of international law by the PRC (People's Republic of China)\nAlso on Saturday, Japan lodged a formal protest via China's embassy against what it called an incursion by a Chinese survey ship into its territorial waters.\nThe latest such incident fuelled unease among Japanese defence officials, already concerned about the growing military cooperation between the Chinese and Russian air forces.\nOn Monday, Tokyo also protested after a Chinese military aircraft briefly entering Japan's south-western airspace.\nChinese foreign ministry spokesperson Lin Jian said on Tuesday his country had 'no intention' to violate any country's airspace."
    },
    {
      "url": "https://www.dailymail.co.uk/news/article-9347527/US-admiral-warns-China-aims-invade-Taiwan-6-years-global-leadership-role.html",
      "text": "US Navy admiral issues warning that China plans to invade Taiwan in the next six years and will wrestle control of America's global leader status as Biden administration prepares to meet with officials in person next week\n- Top military leader tells Senate committee of fears China could take military action against the disputed breakaway island\n- Admiral says China positioning itself to take over the U.S. global leadership role by 2050\n- China warns America to stop sending arms to the island's democratic government\n- Secretary of State Blinken is scheduled to meet with Chinese officials in the U.S. next week\nA U.S. admiral has warned that China aims to invade Taiwan within the next six years ahead of the Biden administration first meeting with the country's officials in Alaska next week.\nU.S. Navy Admiral Philip S. Davidson, commander of the U.S. Indo-Pacific Command, also told the Senate Armed Services Committee of fears among the U.S. military that the Chinese government centered in Beijing could overtake America's global leadership role in the coming decades, NBC News reported.\n'Taiwan is clearly one of their ambitions,' Davidson told the committee on Tuesday. 'And I think the threat is manifest during this decade, in fact, in the next six years.'\nHe added: 'I worry that they're [China] accelerating their ambitions to supplant the United States and our leadership role in the rules-based international order. They've long said that they want to do that by 2050. I'm worried about them moving that target closer.'\nAdmiral Davidson's warning warning comes as U.S. Secretary of State Antony Blinken plans to meet with Chinese officials in person for the first time next week.\nBlinken plans to meet with Chinese officials for the first time next week in the U.S., Bloomberg News reported.\nAdmiral Philip S. Davidson, Commander of the U.S. Indo-Pacific Command, appears before a hearing of the Senate Committee on Armed Services Tuesday\nChina did not immediately react to Davidson's claims, but a Chinese Foreign Ministry spokesman said the U.S. should halt arms sales to Taiwan.\n'China's position on the Taiwan question is consistent and clear. There is but one China in the world, and Taiwan is an inalienable part of China's territory,' Zhao Lijian said in Beijing on Tuesday.\nChina considers the democratic government of Taiwan to be an illegitimate breakaway province. When the nation's civil war between the Communists and Nationalists ended in 1949, the defeated Nationalists set up a rival government in Taipei, Taiwan's capital.\nThe Chinese Communist Party has not ruled out using force to bring the island under its control.\nU.S. Secretary of State Antony Blinken delivers remarks from the State Department in Washington, D.C., on March 3\nTaiwan President Tsai Ing-wen speaks during a visit to a Naval base in Keelung on March 8. She thanked all naval personnel for their dedication in protecting Taiwan amid renewed threats from China and vowed not to loss 'any single inch' of territory\nPresident Tsai Ing-wen vowed during her visit not to lose 'any single inch' of territory to China\nThe U.S. has no official relations with Taiwan, but maintains extensive informal ties with the island off the southeastern coast of China. The CIA World Factbook said Taiwan is expected to have a population of about 23.57 million as of July 2021.\nChina recently increased its military activity near the island in response to what it called 'secessionist forces' and 'collusion' between Taipei and Washington.\nTaiwanese President Tsai Ing-wen was elected in a landslide vote last year on a promise to defend the island's democracy and hold off China.\nThe United States and China remain at odds over influence in the Indo-Pacific region, territorial claims in the South China Sea, human rights abuses against the Uygher population in Xinjiang and China's control of Hong Kong.\nHong Kong has been rocked by pro-democracy demonstrations since China began to clamp down on the former British colony after the UK's 99-year lease there ended in 1997. Hong Kong was granted a form of co-existence with China under the principle of 'one country, two systems' that provided significant autonomy.\nProtesters took to Hong Kong's streets beginning in June 2019 over plans, canceled in September, to allow extradition to the mainland from Hong Kong in what was perceived as a crackdown on democratic dissent. A proposed new security law believed to target democracy activists has further inflamed tensions in the major economic hub, which is a little over 435 miles from Taiwan.\nChinese troops march during a military parade in Beijing's Tiananmen Square on on Oct. 1, 2019, to mark the 70th anniversary of the founding of the Peoples Republic of China\nBlinken, America's new top diplomat who was confirmed by the Senate on January 26, said earlier this month that China represented America's 'biggest geopolitical test of the 21st century.'\nThe U.S. relationship with China will be 'competitive when it should be, collaborative when it can be, and adversarial when it must be,' Blinken said.\nAt China's massive annual political congress in Beijing, State Councilor Wang Yi struck a tough line on Taiwan Monday.\nThe top diplomat warned there was no room for compromise and the new U.S. government should drop the previous administration's 'dangerous acts of playing with fire.'\nThe U.S. Navy's Theodore Roosevelt Carrier Strike Group transits in formation with the Nimitz Carrier Strike Group in the South China Sea on Feb. 9. The Roosevelt and Nimitz groups conducted operations during their deployments to the 7th Fleet, the U.S. Navy's largest forward-deployed fleet\nTaiwan tank troops line up for photographs after a drill in Hsinchu military base ahead of the Chinese New Year holiday on Jan. 19, 2021\nFormer President Donald Trump angered Beijing by sending members of his cabinet to Taiwan in a show of support for the democracy.\nWhite House Press Secretary Jen Psaki on Monday said the U.S. remains 'rock solid' in its commitment to Taiwan.\n'Our position on Taiwan remains clear,' Psaki said. 'We will stand with friends and allies to advance our shared prosperity, security and values in the Indo-Pacific region.'\nTaiwan President Tsai Ing-wen gestures during a visit to the ROCS Lan Yang (FFG-935) frigate in Keelung, Taiwan, on March 8\nAircraft assigned to the U.S. Navy Carrier Air Wing 17 fly over the Theodore Roosevelt Carrier Strike Group and the Nimitz Carrier Strike Group in the South China Sea on Feb. 9\nMost watched News videos\n- Moment passengers 'stop' man who pulled down trousers on tube\n- Moment Cycling Mikey pushes bike into a car after furious row\n- Shocking moment man is gored to death after charging at bull\n- Shocking moment woman strikes flight attendant before being removed\n- Kristen Welker calls out JB Pritzker over Gerrymandering\n- Family-friendly restaurant Cracker Barrel unveils bold new look\n- Chinese navy vessel collides with one of its own chasing Philippine boat\n- Chinese Navy ship collides with own vessel while chasing boat\n- Florida man knocks out kayakers while attempting a DAREDEVIL leap\n- Hawaii ferry is tossed by strong waves before being run aground\n- Biblical flooding hits Wisconsin leaving residents trapped in homes\n- Moment 'dine and dashers' run out on £200 bill at Indian restaurant"
    },
    {
      "url": "https://www.dailymail.co.uk/money/comment/article-10966455/ALEX-BRUMMER-Britains-strategic-muddle-defence-firm-takeovers.html",
      "text": "UK's strategic muddle: Surrendering our defence firms to foreign predators as war rages in Europe is an act of self-harm, says ALEX BRUMMER\nMaking head or tail of the Government’s manufacturing strategy is quite hard. In a flurry of decision-making, it has come out fighting in defence of jobs, capacity and the public interest in the steel industry.\nBut at the same time it is giving the provisional green light to deals involving national security in the middle of a war against a ruthless enemy in Europe.\nPreviously neutral states, including Sweden and Finland, are knocking on the door of Nato, and defence budgets are being ratcheted up.\nGoing cheap: The government has given the green light to private equity ghouls Advent to take over Ultra Electronics and it is set to allow Meggitt to fall into the hands of Parker Hannifin\nSo what is the UK doing?\nIt has backed private equity ghoul Advent’s takeover of the masters of submarine detection, Ultra Electronics.\nAnd it is ready to allow aerospace engineer Meggitt to fall into the hands of US competitor Parker Hannifin.\nFor good measure, the UK’s world-leading satellite specialist Inmarsat is warming up to be swallowed by US rival Viasat.\nEven if the national security risks of these deals are put to one side, the commercial downside for Britain is manifold.\nIntellectual property will fall into overseas hands, the supply chain for the UK’s advanced defence industries weakened, the corporate tax base enfeebled and headquarters services undermined.\nThe London Stock Exchange’s status will be diminished. So what is the thought process guiding the Government?\nIn the case of steel, it is ready to intervene whatever the economic and political costs.\nBusiness Secretary Kwasi Kwarteng made no secret of his determination to support production in the UK – standing by to rescue companies within the Liberty Steel group should they fall into insolvency.\nAnd he has indicated that the Government will provide direct energy subsidies to steelmakers should the surging cost threaten their existence. International Trade Secretary Anne-Marie Trevelyan is gung-ho about keeping out cheap overseas imports which might undermine jobs in Yorkshire, Humberside and South Wales.\nSo much so, that the UK is willing to join the long list of World Trade Organisation sinners who run rings around global commerce rules. It was the retention of punitive tariffs which finally led ethics adviser Lord Geidt to resign from Downing Street, saying he had been put in an ‘odious’ position.\nThe contrast between the willingness to run roughshod over trade rules to preserve the steel industry and the pusillanimous approach to takeovers of firms vital to the UK’s security could not be starker.\nKwarteng is making the would-be buyers of Ultra, Meggitt and Inmarsat climb through many hoops. Rather than imposing detailed conditionality, simply blocking the deals would make more sense.\nHe may be determined to show Britain is open to business and foreign investment. But we know how well that worked out when Arm Holdings was sold to SoftBank.\nThe UK is engaged in an act of self-harm.\nBoycott foiled\nWho would have thought posh ice cream could become a hot geopolitical issue?\nThe attempt by the Vermont-based board of Ben & Jerry’s to ban sales of its product in Israel because of availability on the West Bank has been thwarted.\nUnilever has sold the brand in Israel to Avi Zinger, owner of American Quality Products, its locally-based licensee.\nThe product will remain the same but marketed under its Hebrew and Arabic names in Israel and the West Bank.\nNow that Unilever is no longer the owner of Ben & Jerry’s in the Holy Land, the Vermont board is deprived of a say.\nUnilever makes clear it has no truck with anti-Semitism or the Boycott, Divestment and Sanctions movement.\nIt will continue to work in Israel where it employs 2,000 people.\nAs it refocuses on healthier living, could this be a signal about the future place of its booming ice cream brands? Only asking.\nLucky winners\nSome 24 hours after Camelot sought to convince the world that it was robbed of the National Lottery by the Gambling Commission, the courts have come down firmly in favour of challenger Allwyn.\nThat paves the way for the Czech operator to begin the technological challenge of modernising or reconfiguring 44,000 terminals across the land as well as digital infrastructure.\nGood causes should not be made to wait.\nMost watched Money videos\n- Watch seven-year-old boy's viral card game 'Taco vs. Burrito'\n- Shocking car crashes and near-misses caught on dashcam\n- Nissan Leaf is BACK: Our sneak peek at new EV range\n- Bentley shows off enormous electric car EXP 15 with only three seats\n- Jaguar's polarising Type 00 concept makes UK debut at Goodwood\n- Mercedes unveils electric family supercar of tomorrow\n- 5 things you need to know about the new Omoda 9 SHS plug-in hybrid\n- Introducing Nissan's 'reborn' all-new Micra EV\n- Come Greenlaning with MailOnline as we explore Wales in a 4x4\n- Will MG's new IM series rival Tesla's popular top selling cars?\n- The sporty new Mercedes-Benz CLA\n- £700k house has 'trashy' £50 note bathroom wallpaper\n- Jaguar launches new PETROL model - but there's a huge...\n- Major British toy retailer announces huge shakeup set to...\n- New JLR boss stands firm against criticism of Jaguar's...\n- My sister made so little effort for my birthday present -...\n- One in five young people can't afford to break up\n- How 2.6 million can avoid paying tax on their savings\n- Gold prices soar to record highs after Trump tariffs\n- Used car sales surge as buyers avoid pricey new models...\n- Poundland to shut 49 stores across the UK\n- Jaguar launches new petrol model - but there's a catch\n- HMRC and banks should 'nudge' the self-employed into...\n- The council tax snoopers eyeing up your garden SHED - and...\n- ALEX BRUMMER: Pound's mixed blessing in a world with...\n- Trump tariffs give luxury brands £75bn headache\n- Raise retirement age to match life expectancy, say managers\n- Does Ed Miliband's new £3,750 grant make it worth buying...\n- Poundland to shut 49 stores across the UK with 10 closing...\n- The little-known trick to lock in a guaranteed 9% return..."
    },
    {
      "url": "https://www.dailymail.co.uk/news/article-5587003/Chinese-navy-carries-drills-aircraft-carrier-battle-groups-prepare-exercises.html",
      "text": "Chinese navy carries out live-fire drills with more than 40 warships in the South China Sea as three US aircraft carrier battle groups prepare for their own exercises\n- Chinese exercise is taking place in a disputed area of the South China Sea\n- The live-fire drills involve its Soviet-ear aircraft carrier Liaoning for the first time\n- US Navy will have three aircraft carrier groups in the region as trade war hots up\nThe Chinese navy has launched a navy drill in the South China Sea involving 40 ships to put on a show of strength as three U.S carrier battle groups pass by.\nAccording to its state media, are centred on the aircraft carrier Liaoning, with warships combining from the North, East and South Sea fleets.\nThe exercises for the first time also involve its only aircraft carrier, the refurbished Soviet era vessel Liaoning, taking part in live-fire drills.\nChina's first aircraft carrier, the Liaoning, pictured in Hong Kong harbour, will be taking part in the exercises\nThis handout satellite picture shows the Liaoning (centre right), sailing with other ships at sea, south of China's southern Hainan island\nThe aircraft carrier USS Theodore Roosevelt moored at Changi Naval Base in Singapore\nThey take place in seas that are the source of a dispute between China and several countries.\nA large part of South China Sea has been declared sovereign territory by Beijing under the so-called 'Nine Dash Line' which extends some 1240 miles from its mainland.\nMeanwhile the United States has also sent three aircraft carrier battle groups to the Asia-Pacific region.\nThe USS Theodore Roosevelt flotilla arrived in Singapore on Monday for a regular port call after a deployment in the Middle East.\nIt has been reported it will conduct drills with two US 7th Fleet carrier groups, centred on the USS Ronald Reagan and USS Carl Vinson, as they pass through the disputed waterways.\nThe military manoeuvres are being held as an Asian economic forum gets underway on the Chinese island of Hainan, which borders the disputed South China Sea.\nLi Jie, an expert on the Chinese navy, said it was the first time the Liaoning had taken part in live-fire drills.\n'This will test the Liaoning's real combat strength as well as joint-operations skills between the aircraft carrier and warships from other fleets,' Beijing-based Li told the South China Morning Post.\nAnother Beijing-based military analyst Zhou Chenming told the paper: 'China wants to show the outside world its determination to defend the fruits of its economic reforms over the past 40 years.\n'The increasing military presence in the South China Sea indicates that Washington sees Beijing as a serious competitor, not only economically, but also militarily.\n'But China realises that the military gap with the US is still very big, and all its military deployments in the South China Sea are basically defensive, including its DF-21D anti-ship ballistic missile.'\nThe exercises come as China has vowed to fight the U.S. 'at any cost' after President Donald Trump proposed slapping an additional $100 billion in tariffs on Chinese goods - escalating an already bitter trade war.\nTrump's surprise move on Thursday came a day after Beijing announced plans to tax $50 billion in American products, including soybeans and small aircraft.\nMost watched News videos\n- Moment passengers 'stop' man who pulled down trousers on tube\n- Moment Cycling Mikey pushes bike into a car after furious row\n- Shocking moment man is gored to death after charging at bull\n- Shocking moment woman strikes flight attendant before being removed\n- Kristen Welker calls out JB Pritzker over Gerrymandering\n- Family-friendly restaurant Cracker Barrel unveils bold new look\n- Chinese navy vessel collides with one of its own chasing Philippine boat\n- Chinese Navy ship collides with own vessel while chasing boat\n- Florida man knocks out kayakers while attempting a DAREDEVIL leap\n- Hawaii ferry is tossed by strong waves before being run aground\n- Biblical flooding hits Wisconsin leaving residents trapped in homes\n- Moment 'dine and dashers' run out on £200 bill at Indian restaurant"
    },
    {
      "url": "https://www.dailymail.co.uk/news/article-6586129/Week-long-heatwave-sweep-entire-nation-state-set-bake-40C-temperatures.html",
      "text": "Week-long heatwave to sweep the entire nation as every state is set to bake in 40C temperatures\n- Australia to swelter through blisteringly hot week with heatwaves in place\n- The intense weather is set to stay as a week-long heatwave is sweeping Australia\n- BOM said multiple days in a row of temperatures above 40C are quite unusual\n- Widespread low to medium intensity conditions will cover large parts of country\nThe blisteringly hot weather isn't set to go away anytime soon with heatwave conditions forecast Australia-wide for the week ahead.\nEvery state and territory will bake through an intense heatwave on Monday, with the abnormally high temperatures predicted to continue for up to five days.\nThe Bureau of Meteorology said hot days were expected in January but multiple days in a row of temperatures above 40C were unusual.\nThe blisteringly hot weather isn't set to go away anytime soon with heatwave conditions forecast Australia-wide for the week ahead\nEvery state and territory will bake through an intense heatwave on Monday, with up to five days of abnormally high temperatures\nThe Bureau of Meteorology said hot days were expected in January but multiple days in a row of temperatures above 40C were unusual\nBeginning Monday, widespread low intensity heatwave conditions will cover large parts of the country\nBeginning Monday, widespread low intensity heatwave conditions will cover large parts of the country from central Western Australia to southern parts of the Northern Territory , southwestern Queensland and over New South Wales, Victoria, Tasmania and South Australia.\nMeanwhile, severe heatwave conditions are extending from central parts of Western Australia to most parts of South Australia, New South Wales, Victoria and even Tasmania.\nBOM Meteorologist Dean Narramore said South Australia will cop it the most, with five days in a row of forecasts above 45C.\n'Normally they might only get five or 10 a year,' Mr Narramore said.\nTour Down Under officials have decided to shorten Wednesday's second stage of the race due to the forecasted heatwave.\nHolidaymakers and those getting back to Melbourne will see the start of the week with days in the mid to high 30s, while a sea breeze will shield Sydney city.\nSpectators at Melbourne Park, the home of the Australian Open, will have to endure a blistering 37C on Monday as the world's tennis stars take to the court.\nMeanwhile, severe heatwave conditions are extending from central parts of Western Australia to most parts of South Australia, New South Wales, Victoria and even Tasmania\nTour Down Under officials will toss up whether or not to shorten the first two stages of next week's race in Adelaide, amid forecasts for 40C plus temperatures\nThe Australian Open's new extreme heat policy will be put to the test, as concerns for players' and spectators' health arise - reminiscent of the 2014 edition of the Grand Slam, which saw multiple stars withdraw from heat-related hallucinations.\nThe new policy sees a mandatory 10-minute break put in place between the fourth and fifth set of a men's match, as well as a new 'heat stress scale' taking into account players' feedback.\nPlay will be suspended on outdoor courts and the roof closed on marquee courts when the heat scale reading is 5.0 or above.\nBrisbane will see sunny conditions and temperatures in the 30's for most of the week, as Darwin will see rain from Monday onwards.\nThe Bureau of Meteorology has forecast 41 degrees to hit the South Australian capital city on Tuesday\nCyclists will not be the only ones suffering through the intense heat, with tennis players set to swelter in the upcoming Australian Open\nBureau of Meteorology senior forecaster Rod Dickson told Daily Mail Australia there was a 'little bit of uncertainty' in just how severe the heatwave will be.\nThe relief won't save the city's western suburbs, as residents in Penrith and Richmond are due to swelter through four to five days above 40C.\nA tropical low may lurk off the Western Australian coast, creating stormy weather on Sunday and into Monday, but will then move further off the coast, he added.\nWeatherzone meteorologist Tom Hough previously told Daily Mail Australia temperatures are rapidly climbing around the entire country.\n'In terms of what's classified as a heatwave, it differs depending on where you are,' Mr Hough said.\n'So heatwave is defined as three or more days of higher maximum and minimum temperatures that are unusual for those locations.'\nForecasters fear a repeat of the 2014 Australian Open, which saw players collapse (pictured Frank Dancevic of Canada) and struggle through heat-related illnesses\nMost watched News videos\n- Moment passengers 'stop' man who pulled down trousers on tube\n- Moment Cycling Mikey pushes bike into a car after furious row\n- Shocking moment man is gored to death after charging at bull\n- Shocking moment woman strikes flight attendant before being removed\n- Kristen Welker calls out JB Pritzker over Gerrymandering\n- Family-friendly restaurant Cracker Barrel unveils bold new look\n- Chinese navy vessel collides with one of its own chasing Philippine boat\n- Chinese Navy ship collides with own vessel while chasing boat\n- Florida man knocks out kayakers while attempting a DAREDEVIL leap\n- Hawaii ferry is tossed by strong waves before being run aground\n- Biblical flooding hits Wisconsin leaving residents trapped in homes\n- Moment 'dine and dashers' run out on £200 bill at Indian restaurant"
    }
  ],
  "argos_summary": "The HMS Prince of Wales, the UK's largest aircraft carrier, is currently participating in Exercise Talisman Sabre in Australia, showcasing British military capabilities alongside 35,000 personnel from 19 nations. This exercise emphasizes the strengthening of military alliances in response to increasing global threats, particularly from China, which is seen as a potential aggressor in the Indo-Pacific region. British officials highlight the importance of readiness and collaboration with allies, as tensions rise over China's ambitions regarding Taiwan and its assertive military activities in the South China Sea.",
  "argos_id": "EOAKNGICS"
}