{
  "url": "https://www.cbsnews.com/news/magnet-nonprofit-manufacturing-jobs-ohio/",
  "authorsByline": "By\n                        \n              \n                            \n          \n            \n                Ian  Lee, \n            \n\n            \n              \n                \n                  \n                \n              \n\n              \n                                  \n                    \n                  \n                \n                \n                  Ian  Lee\n\n                                      Correspondent\n                                  \n              \n\n                              \n                  Ian Lee is a CBS News correspondent based in London, where he reports for CBS News, CBS Newspath and CBS News 24/7. Lee is a multi-award-winning journalist whose work covering major international stories has earned him some of journalism's top honors, including an Emmy, Peabody and the Investigative Reporters and Editors' Tom Renner award.\n                \n              \n              Read Full Bio\n            \n          \n\n          \n            Ian  Lee, \n          \n\n                                      \n              Alicia  Hastey",
  "articleId": "47d9555221184ec4b5fe5e903c67906d",
  "source": {
    "domain": "cbsnews.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/08/12/eca72095-6099-4da6-a969-e57103d9df0c/thumbnail/1200x630/6a930ce936f412235dd316d4515b7503/eoa2.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T20:23:52-04:00",
  "addDate": "2025-08-12T00:26:11.989027+00:00",
  "refreshDate": "2025-08-12T00:26:11.989030+00:00",
  "score": 1.0,
  "title": "How a nonprofit is helping the un- and underemployed fill open manufacturing jobs",
  "description": "The Ohio-based nonprofit Magnet helped 56-year-old Mary Lamar find work after serving a 3.5-year prison sentence.",
  "content": "For the first time in her life, Mary Lamar is driving a new car to a job she loves. But it was a rough journey getting to this point.\n\n\"I was in prison. I did three and a half years for something that I never saw coming,\" Lamar said.\n\nThe Cleveland native slipped into a life of crime at a young age, eventually serving time for robbery when she was 50 years old.\n\n\"I chose a different lifestyle and, uh, drugs and alcohol is in my story,\" she said.\n\nNow 56, Lamar is a first-time homeowner and a supervisor at her job, where she leads a team of machinists\n\n\"Your recovery is what matters, and you have to have that support,\" Lamar told CBS News.\n\nLamar found support at Magnet, an Ohio-based nonprofit that helped retool her life. Magnet's goal is to educate and engage people on the available careers in manufacturing, in part, to help fill the more than 400,000 open jobs in that sector. Magnet has filled 3,000 of those jobs in Ohio.\n\nMagnet offers year-round career classes for adults who are unemployed or underemployed. The three-week course offers soft skills and helps connect participants with jobs in the area. For students, it offers summer camps, field trips and apprenticeships, all free, thanks to grants and donations.\n\nMagnet CEO Ethan Karp wants to fill factory jobs by helping America's Rust Belt workers.\n\n\"We can't just say, 'Hey, pick yourself up by your bootstraps,'\" he told CBS News. \"You need the grit and determination to do that, full stop. But you also need some help.\"\n\nBut Magnet does more than just give folks a pair of bootstraps.\n\n\"If somebody doesn't have child care, if health care is an issue, if transportation is, if crime is — all of those things affect their ability to get a job. That's what we're trying to remove with access and give people the wraparound supports to do all of — to overcome all of those barriers,\" Karp said.\n\nOne of Magnet's workforce partners is Talan Products, where Lamar works at a facility that stamps specialty metal parts. The company said it's added 40 jobs in the last year.\n\n\"There's a lot more manufacturing that we would love to have here. It's gonna take a little time to build the workforce,\" Talan Products COO Adam Snyder said.\n\nFor Lamar, her advice to people: \"Be open, be fearless, take a chance, be honest. You can be successful at any stage of your life. I'm proof.\"\n\nSadly, shortly after CBS News met Lamar, her house burned down, killing her partner of 18 years. She was able to jump to safety, but was seriously hurt. Talan Products and Magnet helped set up a GoFundMe to assist with her recovery.",
  "medium": "Article",
  "links": [
    "https://www.cbsnews.com/news/ukraine-refugees-work-permits-not-renewed/?intcid=CNI-00-10aaa3a",
    "https://www.cbsnews.com/news/ai-chatbot-companionship-older-americans/?intcid=CNI-00-10aaa3a",
    "https://www.cbsnews.com/news/online-in-person-dating-apps-decline/?intcid=CNI-00-10aaa3a",
    "https://www.cbsnews.com/feature/eye-on-america/?intcid=CNI-00-10aaa3a",
    "https://www.cbsnews.com/news/los-angeles-home-burned-down-wildfires-palisades-couple-rv-america/?intcid=CNI-00-10aaa3a",
    "https://www.cbsnews.com/news/magnet-nonprofit-manufacturing-jobs-ohio/?intcid=CNI-00-10aaa3a",
    "https://www.cbsnews.com/team/ian-lee/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "open manufacturing jobs",
      "weight": 0.09734054
    },
    {
      "name": "factory jobs",
      "weight": 0.086624235
    },
    {
      "name": "jobs",
      "weight": 0.08463885
    },
    {
      "name": "Mary Lamar",
      "weight": 0.07967992
    },
    {
      "name": "Lamar",
      "weight": 0.07668482
    },
    {
      "name": "Magnet CEO Ethan Karp",
      "weight": 0.07615316
    },
    {
      "name": "Magnet",
      "weight": 0.07116505
    },
    {
      "name": "Talan Products",
      "weight": 0.069737904
    },
    {
      "name": "Talan Products COO Adam Snyder",
      "weight": 0.069645174
    },
    {
      "name": "time",
      "weight": 0.061883908
    }
  ],
  "topics": [
    {
      "name": "Nonprofits"
    }
  ],
  "categories": [
    {
      "name": "Business"
    }
  ],
  "taxonomies": [
    {
      "name": "/People & Society/Social Issues & Advocacy/Charity & Philanthropy",
      "score": 0.74951171875
    },
    {
      "name": "/News/Local News",
      "score": 0.69677734375
    },
    {
      "name": "/Business & Industrial/Business Operations/Human Resources",
      "score": 0.60791015625
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.488037109375
    },
    {
      "name": "/Jobs & Education/Jobs/Career Resources & Planning",
      "score": 0.398681640625
    },
    {
      "name": "/Jobs & Education/Jobs/Job Listings",
      "score": 0.367431640625
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Work & Labor Issues",
      "score": 0.366455078125
    }
  ],
  "sentiment": {
    "positive": 0.24841245,
    "negative": 0.3818944,
    "neutral": 0.3696932
  },
  "summary": "Mary Lamar, a former criminal, found support at Ohio-based nonprofit Magnet, which aims to educate and engage the unemployed and underemployed in manufacturing to fill open manufacturing jobs. The nonprofit has filled 3,000 of these positions in Ohio. It also provides year-round career classes for adults who are unemployed or underemed, connecting participants with jobs in the area and offering summer camps, field trips, and apprenticeships. However, Lamar's house burned down shortly after she met with Magnet, killing her partner of 18 years, causing serious injury.",
  "shortSummary": "Magnet, an Ohio nonprofit, helps the un and undereploy fill manufacturing jobs by providing educational and employment support, following a challenging journey.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "9e83abead0a74091bdde1b2360dfa3ea",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.cbsnews.com/news/ai-chatbot-companionship-older-americans/?intcid=CNI-00-10aaa3a",
      "text": "Older Americans turning to AI-powered chatbots for companionship\nJill Smola is a 75-year-old retiree who understands the power of human connection, having spent her working days as an aide taking care of the elderly.\n\"We would play games, put puzzles together,\" Smola told CBS News. She said human interaction was important, \"so that they had somebody to talk to. That they just weren't sitting in a chair doing nothing.\"\nBut these days, it's Smola sitting in a chair — a widow with a lung condition who lives alone. She says she doesn't get that human interaction anymore.\n\"I can go weeks on end\" without seeing someone, she said.\nSmola can't drive anymore and rarely leaves her Orlando home. But recently, she did gain a new companion: an AI-powered chatbot. She uses the chatbot, called ElliQ, to \"visit\" exotic places and play trivia.\nSmola talks to the chatbot up to five hours a day, and says the connection is truly meaningful. She said that people who might find the situation sad \"don't understand.\"\n\"I'd rather talk to a human being, but that's not possible for me, except if I get on the phone, so I enjoy her,\" Smola said, jokingly adding: \"I enjoy her better than my daughter.\"\nSeveral AI companions have recently hit the market, including ElliQ, which normally costs $59 a month to use. Smola received the chatbot for free with funding from a federal grant.\nThalia Porteny, an ethicist at Columbia University who studies seniors and AI used in the medical space, told CBS News that \"loneliness is rampant,\" with one in four older adults saying they feel isolated.\nBut Porteny also said she's concerned about the possibility that reliance on these chatbots could backfire and create even more isolation.\n\"This could really go the wrong way if it's not deployed in an ethical and responsible way,\" she said.\nBut for now, Smola said ElliQ is \"the best thing that happened to me, because I always have somebody around. Even though it may not be a human, it's good enough for me.\""
    },
    {
      "url": "https://www.cbsnews.com/feature/eye-on-america/?intcid=CNI-00-10aaa3a",
      "text": "Training people for manufacturing jobs\nAn Ohio-based nonprofit is working to educate and engage people on the available careers in manufacturing. In part, to help fill the more than 400,000 open jobs in that sector. Ian Lee reports.\nMonday through Thursday on CBS Evening News\nThe Ohio-based nonprofit Magnet helped 56-year-old Mary Lamar find work after serving a 3.5-year prison sentence.\nMillennials were the first to get on dating apps, and the first to get off of them. Gen Zers use the apps even less.\nAfter losing their home in the Palisades Fire, a couple hit the road in an RV. For more than 10 weeks, they have been crisscrossing the U.S. with their two dogs.\nJill Smola, a 75-year-old widow, says she spends up to five hours a day talking to a chatbot companion.\nRefugees whose work permits expire may not be forced to leave, but without a job, they can't afford to stay.\nRoughly 30% of American adults say they consult horoscopes, tarot cards or fortune tellers at least once a year.\nBy 2036, the United States is predicted to be short as many as 40,000 primary care physicians, in part because of an aging population.\nCuts to SNAP benefits may lead to a surge in demand at food banks that serve America's most food insecure communities.\nAs new homes rise by the thousands, the infrastructure to support them all can't expand fast enough.\nStanley Forman has been photographing Boston for 60 years, but the image he'll always remember is one he took of a fatal 1975 fire.\nJohn Dickerson goes inside the numbers on who actually pays when tariffs are levied against imports.\nThe share of working mothers between the ages of 25-44 has dropped 3% so far this year, according to a new report from the University of Kansas. Professor Misty Heggeness, who analyzed the data and is the author of the upcoming book, \"Swifty-Nomics: How Women Mastermind and Redefine our Economy,\" joins the \"CBS Evening News\" to discuss the report.\nAdam Yamaguchi takes us to a community in California that's struggling to survive as deportation raids increase.\nA gunman apparently targeted the headquarters of the CDC last Friday, firing at least 180 shots and hitting at least 150 windows and doors. One police officer was shot and killed. Dr. Céline Gounder spoke to four CDC employees about the incident.\nPresident Trump is invoking his executive authority to increase the federal law enforcement presence in Washington, D.C. CBS News legal contributor Jessica Levinson has more.\nPresident Trump's recipe for peace in Ukraine apparently involves giving parts of the country to Russia, but European leaders believe that would reward Vladimir Putin for his bloody attack. Holly Williams reports.\nAn Ohio-based nonprofit is working to educate and engage people on the available careers in manufacturing. In part, to help fill the more than 400,000 open jobs in that sector. Ian Lee reports.\nThe Trump administration has reached a deal with American chipmakers Nvidia and AMD to sell two semiconductors to China in exchange for a 15% cut of their revenue. Jo Ling Kent reports.\nPresident Trump and other officials now describe the upcoming face-to-face with Russian President Vladimir Putin as a \"feel out meeting\" to gauge how serious Putin is about making a peace deal with Ukraine. Ed O'Keefe has more.\nHuntington Park, California, is 95.6% Latino, and as many as 45% of the residents are undocumented, according to the city.\nThe mass shooting at Robb Elementary School in Uvalde, Texas, killed 19 students and two teachers. The slow law enforcement response has been widely condemned.\nThe Ohio-based nonprofit Magnet helped 56-year-old Mary Lamar find work after serving a 3.5-year prison sentence.\nPresident Trump says he expects to know quickly if a deal can be made with Russian leader Vladimir Putin to halt the war in Ukraine.\nPrince Harry and his wife, Meghan, announced Monday that their media company's partnership with Netflix has been extended with a multiyear, first-look deal.\nPresident Trump has extended a temporary truce in the U.S.-China trade war, preventing tariffs on China from leaping to at least 80%.\nPresident Trump announced E.J. Antoni as his nominee to lead the Bureau of Labor Statistics on Monday, after he fired the former commissioner and blamed her for a weaker-than-expected jobs report.\nFord unveiled a new assembly line on Monday, which CEO Jim Farley called the most radical change at Ford \"since the Model T.\"\nThe agreement between the chipmakers and the U.S. government will allow Nvidia and AMD to obtain export licenses to resume sales to China.\nParamount will become the new home to all UFC events in the U.S., while UFC's CEO says the White House may host a July 4 event broadcast on CBS.\nHuntington Park, California, is 95.6% Latino, and as many as 45% of the residents are undocumented, according to the city.\nPresident Trump has extended a temporary truce in the U.S.-China trade war, preventing tariffs on China from leaping to at least 80%.\nPresident Trump announced E.J. Antoni as his nominee to lead the Bureau of Labor Statistics on Monday, after he fired the former commissioner and blamed her for a weaker-than-expected jobs report.\nEducation Secretary Linda McMahon is touring the country to promote state-led education plans.\nPresident Trump says he expects to know quickly if a deal can be made with Russian leader Vladimir Putin to halt the war in Ukraine.\nFormer U.S. Surgeon General Jerome Adams — who served in President Trump's first term — tells \"Face the Nation with Margaret Brennan\" that \"people are going to die\" if the U.S. backs away from mRNA research, as Robert F. Kennedy Jr. calls off mRNA vaccine development projects. He also argues that RFK Jr. \"failed in his first major test\" after a deadly shooting at CDC headquarters.\nAdams, who served as surgeon general during the first Trump administration, said Kennedy's assertions about the efficacy of mRNA vaccines are \"simply not true.\"\nLogan Coleridge thought his long-lasting symptoms were from a concussion until an MRI found an alarming, unexpected abnormality.\nInstagram rolled out a new Map feature that lets users see their friends' locations in real time. Here's why privacy experts are concerned.\nA key indicator for tracking the spread of the COVID-19 virus has increased, according to the latest data from the Centers for Disease Control and Prevention.\nPresident Trump says he expects to know quickly if a deal can be made with Russian leader Vladimir Putin to halt the war in Ukraine.\nThe government of Niger has launched an investigation into what they call possible \"illicit international trafficking\" after a piece of Mars unearthed in the Sahara Desert was sold.\nA heat wave gripping parts of Europe sent temperatures over 109.4 degrees Fahrenheit — 40 degrees Celsius — in southern France and the Western Balkans on Monday.\nTropical Storm Erin was expected to become a hurricane later in the week.\nThe remains of Dennis \"Tink\" Bell, a British researcher who vanished in 1959 in Antarctica when he was 25 years old, were discovered near a receding glacier.\nPrince Harry and his wife, Meghan, announced Monday that their media company's partnership with Netflix has been extended with a multiyear, first-look deal.\nParamount will become the new home to all UFC events in the U.S., while UFC's CEO says the White House may host a July 4 event broadcast on CBS.\nChance the Rapper's \"Star Line\" album drops Friday, marking his first studio album in five years. The project's release comes ahead of his \"And We Back\" North American tour starting on Sept. 26. He joins \"CBS Mornings.\"\nActor Jessica Alba and entrepreneur Lizzy Mathis join \"CBS Mornings\" to talk about the new season of their show \"Honest Renovations\" where they transform homes with creative designs that solve real family challenges.\nKeyboardist and vocalist Bobby Whitlock, who co-founded Derek and the Dominos with Eric Clapton in 1970, died at his home in Texas. He was 77.\nSome experts say false narratives generated by artificial intelligence can pose a threat to global politics. Brett Benson, associate professor of political science at Vanderbilt University, joins \"The Takeout\" to explain why he believes the era of AI propaganda is here.\nAs the number of energy-intensive data centers needed to power Big Tech rises in the U.S., so are Americans' electricity bills. Ari Peskoe, director of the Electricity Law Initiative at Harvard Law School, joins \"The Takeout\" to discuss.\nFrom labor shortages to environmental impacts, farmers are looking to AI to help revolutionize the agriculture industry. One California startup, Farm-ng, is tapping into the power of AI and robotics to perform a wide range of tasks, including seeding, weeding and harvesting.\nFord unveiled a new assembly line on Monday, which CEO Jim Farley called the most radical change at Ford \"since the Model T.\"\nThe agreement between the chipmakers and the U.S. government will allow Nvidia and AMD to obtain export licenses to resume sales to China.\nASMR (or autonomous sensory meridian response) is the tingling sensation some people experience from certain sounds or visuals – a \"brain massage,\" in the words of Maria Viktorovna, who's been called the \"ASMR queen.\" Correspondent Faith Salie talks with Viktorovna about her wildly successful \"Gentle Whispering\" videos, and with physiology professor Craig Richard, who discusses ASMR's physical effects. Salie also visits Whisperwave, New York City's first ASMR spa. [Originally broadcast Dec. 8, 2024.]\nA new study finds that butterfly populations are rapidly declining in the Midwest. Elise Zipkin, one of the authors of the study, joins \"The Daily Report\" to discuss.\nThe Perseids meteor shower — considered one of the best shows in the sky — is set to peak this week.\nDiscovered last month by a telescope in Chile, the comet known as 3I-Atlas is only the third known interstellar object to pass our way.\nThe National Oceanic and Atmospheric Administration updated the 2025 Atlantic hurricane season forecast. CBS News' Jessica Burch reports.\nThree people are dead and a suspect is in custody after a shooting in the parking lot of an Austin, Texas, Target, police say. CBS News correspondent Omar Villafranca reports.\nPresident Trump on Monday announced drastic measures to crack down on crime in the nation's capital, but data shows crime in Washington, D.C., is declining. CBS News' Anna Schecter has the details.\nPolice say three people are dead and a suspect is in custody after a shooting in the parking lot of a Target in Austin, Texas. Omar Villafranca has more.\nViolent crime has dropped 26% from last year in Washington, D.C., but on Monday, President Trump took charge of the city's nearly 4,000-person police department, claiming the nation's capital is in crisis. Scott MacFarlane has more.\nCBS News has learned that the man who opened fire near the Centers for Disease Control and Prevention headquarters in Atlanta on Friday fired at least 180 shots and broke about 150 windows. Some staff members shared their accounts of the incident with CBS News medical contributor Dr. Céline Gounder.\nThe splashdown off San Diego closed out a 148-day mission for two NASA astronauts, a Japanese flier and a Russian cosmonaut.\nNASA astronaut Jim Lovell has died at the age of 97. Lovell was part of the crew of Apollo 8, the first mission to ever leave Earth's orbit and circle the moon. He also flew on the ill-fated Apollo 13 mission, which had to abort plans to land on the moon after an explosion in an oxygen tank.\nCrew 10 is the first NASA-sponsored crew that will land in the Pacific Ocean. All previous NASA Crew Dragon flights ended with splashdowns off the Florida Gulf coast or the Atlantic Ocean.\nAstronaut Jim Lovell circled the moon on Apollo 8 and helped bring Apollo 13 home safely despite a mishap far from Earth.\nNASA says it's a comet, but Harvard astrophysicist Avi Loeb believes the object known as 3I-Atlas may be something far more advanced and not natural. He joins \"CBS Mornings Plus\" to explain why.\nLive performances are in full swing this summer. Scroll through our concert gallery, featuring pictures by CBS News photojournalist Jake Barlow and photographers Ed Spinelli and Kirstine Walton.\nA look back at the esteemed personalities who've left us this year, who'd touched us with their innovation, creativity and humanity.\nCalling himself the \"Son of Sam\" in a letter left at one of the crime scenes, David Berkowitz claimed voices were ordering him to kill -- starting in the summer of 1976, he went on a 13-month spree of impulse killings in New York City that left six dead and seven injured\nBizarre clues and evidence in the investigation into the Colorado mother's disappearance include a spy pen, plastic needle cap, and a chipmunk alibi.\nA suspect was taken into custody after an attack on Pearl Street Mall in Boulder on June 1 in which there were 15 people and a dog who were victims. The suspect threw Molotov cocktails that burned some of the victims, who were part of a march for Israeli hostages.\nThree people are dead and a suspect is in custody after a shooting in the parking lot of an Austin, Texas, Target, police say. CBS News correspondent Omar Villafranca reports.\nPresident Trump announced Monday he's deploying National Guard members to Washington, D.C., in an effort to make the nation's capital safer. CBS News' Aaron Navarro and Eleanor Watson have the latest.\nJohn Dickerson goes inside the numbers on who actually pays when tariffs are levied against imports.\nThe share of working mothers between the ages of 25-44 has dropped 3% so far this year, according to a new report from the University of Kansas. Professor Misty Heggeness, who analyzed the data and is the author of the upcoming book, \"Swifty-Nomics: How Women Mastermind and Redefine our Economy,\" joins the \"CBS Evening News\" to discuss the report.\nAdam Yamaguchi takes us to a community in California that's struggling to survive as deportation raids increase."
    },
    {
      "url": "https://www.cbsnews.com/news/los-angeles-home-burned-down-wildfires-palisades-couple-rv-america/?intcid=CNI-00-10aaa3a",
      "text": "When the L.A. wildfires destroyed their home, they packed an RV and headed across America\nLos Angeles — David Israel's home in the Pacific Palisades neighborhood of Los Angeles burned down in January's devastating Palisades Fire.\n\"It was such a beautiful, beautiful curated house,\" Israel told CBS News back in January when he returned to the site of the scorched home with his son, Orly, to see what was left of it. \"...I loved this house. It was really a member of the family.\"\nThe Palisades and Eaton fires earlier this year killed at least 31 people and destroyed thousands of homes in L.A. County.\nIn May, David, a television writer, and his wife, Jacquie, packed up their remaining belongings into an RV and set out on the open road. Orly remained in L.A.\n\"When the fire took our house, took the community, we thought the universe is just saying: go on an adventure,\" David said.\nAdded Jacquie: \"There's just something really healing about just doing this and meeting people and seeing people.\"\nFor more than 10 weeks, the couple has been crisscrossing the U.S. with their two dogs. CBS News caught up with them when they reached New York.\n\"This is our baby, this is our home, this is our whole life right here,\" David said. \"...If I was by myself, I don't think I would've lasted to Nevada. But being that Jacquie is here next to me, I always feel like she's here. She's got me. And I've got her, and we can go forward together.\"\nAlong the way, they have visited old friends and made new ones.\n\"I remember thinking, it's horrendous what happened to our house and our community,\" David said. \"But we are good. We're healthy. And I felt strongly that we were going to be able to move forward and figure it out. We don't know if we're going to rebuild or not. We don't know if we're going to be back in the Palisades or not. But I know that we're going to make an informed decision whenever the time is right.\"\nFor now, the Israels say they are looking forward to staying on the move.\n\"We're meeting people, we're seeing beauty, incredible beauty. It's just like, this is what's filling us up right now,\" Jacquie said.\n\"Everything that's going on in the news, in our country, it's divisive, it's angry,\" David said. \"And we're seeing a whole different side of that. We're talking about…what connects us rather than what divides us.\"\nThey're discovering a lot on their journey, especially the healing power of the open road.\n\"Almost everybody we're meeting is kind and friendly, willing to help, willing to hear our story, willing to share their stories, willing to tell us where to go and what to do and how to plug your sewer line in your RV,\" David said. \"Now I have confidence that everywhere we go, we're going to find people who are going to be kind and open and friendly. And it really reminds me our country is filled with beautiful people.\""
    },
    {
      "url": "https://www.cbsnews.com/news/magnet-nonprofit-manufacturing-jobs-ohio/?intcid=CNI-00-10aaa3a",
      "text": "How a nonprofit is helping the un- and underemployed fill open manufacturing jobs\nFor the first time in her life, Mary Lamar is driving a new car to a job she loves. But it was a rough journey getting to this point.\n\"I was in prison. I did three and a half years for something that I never saw coming,\" Lamar said.\nThe Cleveland native slipped into a life of crime at a young age, eventually serving time for robbery when she was 50 years old.\n\"I chose a different lifestyle and, uh, drugs and alcohol is in my story,\" she said.\nNow 56, Lamar is a first-time homeowner and a supervisor at her job, where she leads a team of machinists\n\"Your recovery is what matters, and you have to have that support,\" Lamar told CBS News.\nLamar found support at Magnet, an Ohio-based nonprofit that helped retool her life. Magnet's goal is to educate and engage people on the available careers in manufacturing, in part, to help fill the more than 400,000 open jobs in that sector. Magnet has filled 3,000 of those jobs in Ohio.\nMagnet offers year-round career classes for adults who are unemployed or underemployed. The three-week course offers soft skills and helps connect participants with jobs in the area. For students, it offers summer camps, field trips and apprenticeships, all free, thanks to grants and donations.\nMagnet CEO Ethan Karp wants to fill factory jobs by helping America's Rust Belt workers.\n\"We can't just say, 'Hey, pick yourself up by your bootstraps,'\" he told CBS News. \"You need the grit and determination to do that, full stop. But you also need some help.\"\nBut Magnet does more than just give folks a pair of bootstraps.\n\"If somebody doesn't have child care, if health care is an issue, if transportation is, if crime is — all of those things affect their ability to get a job. That's what we're trying to remove with access and give people the wraparound supports to do all of — to overcome all of those barriers,\" Karp said.\nOne of Magnet's workforce partners is Talan Products, where Lamar works at a facility that stamps specialty metal parts. The company said it's added 40 jobs in the last year.\n\"There's a lot more manufacturing that we would love to have here. It's gonna take a little time to build the workforce,\" Talan Products COO Adam Snyder said.\nFor Lamar, her advice to people: \"Be open, be fearless, take a chance, be honest. You can be successful at any stage of your life. I'm proof.\"\nSadly, shortly after CBS News met Lamar, her house burned down, killing her partner of 18 years. She was able to jump to safety, but was seriously hurt. Talan Products and Magnet helped set up a GoFundMe to assist with her recovery."
    },
    {
      "url": "https://www.cbsnews.com/team/ian-lee/",
      "text": "Nonprofit helps the un- and underemployed fill open manufacturing jobs\nThe Ohio-based nonprofit Magnet helped 56-year-old Mary Lamar find work after serving a 3.5-year prison sentence.\nIan Lee is a CBS News correspondent based in London, where he reports for CBS News, CBS Newspath and CBS News 24/7. Lee, who joined CBS News in March 2019, is a multi-award-winning journalist whose work covering major international stories has earned him some of journalism's top honors, including an Emmy, Peabody and the Investigative Reporters and Editors' Tom Renner award.\nLee has reported extensively across the Middle East, Europe and East Asia. Prior to CBS, he was a correspondent for CNN based in Jerusalem. Lee joined CNN in 2011 while living in Egypt, where he covered the country's uprising and subsequent 2013 coup. He also reported on the civil wars in Syria and Libya, covering both sides of those conflicts. In 2011, he was injured as rebels battled for control of Sirte, the last stronghold of Libyan leader Muammar Al Gaddafi, when an RPG exploded next to him, killing a nearby paramedic.\nIn 2014, Lee covered the seven-week war in Gaza. He was the first foreign journalist to enter Turkey following the 2016 failed coup. His work has also taken him to cover the tensions on the Korean peninsula and terror attacks in London. In 2017, Lee relocated to Jerusalem for CNN to cover news in Israel and Palestinian territories. His work there included exclusive reports with the Israel Defense Forces (IDF), Palestinian Security Forces, and Palestinian Islamic Jihad (PIJ). He was the first journalist to receive access from the IDF to cross bordering Hezbollah tunnels, entering Israel from Lebanon. PIJ also gave Lee rare access to tunnels and weapons used to attack Israel.\nBefore joining CNN, he worked as a multimedia reporter for a local Egyptian newspaper \"The Daily News Egypt\" and covered the events leading up to the Arab Spring. During that time, he was also a freelance video journalist for Time magazine, and he also spent a year as a producer for Reuters. In 2008, he received a Fulbright Scholarship to Egypt where he researched local media and studied Arabic.\nLee is a 2007 graduate of the Walter Cronkite School of Journalism and Mass Communication at Arizona State University. He is also a proud Eagle Scout and Wyomingite.\nThe Ohio-based nonprofit Magnet helped 56-year-old Mary Lamar find work after serving a 3.5-year prison sentence.\nWhen an address is not legible, mail distribution centers capture images of the hard-to-read addresses and electronically send them to the USPS Remote Encoding Center in Salt Lake City.\nHenrik Svendsen said President Trump's trade war is making the furniture he sells unaffordable to import and unaffordable for customers.\nMiddleton High School in Wisconsin built a $90 million campus in 2022, putting its technical education program in the spotlight.\nKansas City's homeless prevention coordinator is working to direct churches, aid organizations and shelters to align their resources in an effort to get people a place to stay while supporting their needs.\nThe three children and one teenager killed when a car crashed into an after-school program in downstate Chatham, Illinois, have been identified. The driver has also been identified.\nA crew member tells CBS News \"a massive ship came from out of the blue\" and rammed a tanker apparently carrying jet fuel for the U.S. military.\nU.S. national forests are maintained by an army of Forest Service workers, but recent cuts could have the forests looking very different this summer.\nAs Ukraine pushes a shock incursion into Russia, a drone unit tasked with supporting the mission tells CBS News why the inexpensive weapons are so vital.\nA damning report, presented to New Zealand's Parliament on Wednesday, details decades of abuse affecting roughly 200,000 people in care facilities, including children, young people and vulnerable adults.\nRuss Cook says the scariest part of his run through Africa was \"on the back of a motorbike, thinking I was about to die.\"\nFrench Olympic diver Alexis Jandard suggests an embarrassing slip-up in front of his country's president hurt his ego more than his back.\nAt least 10 people were killed by the powerful earthquake that hit Taiwan, and more than 100 others were still missing.\nResearchers in London say there's a better way to help allergy sufferers predict and prevent pollen-borne punishment.\nResearchers in London are developing an AI tool to sort dogs into 5 categories, in a bid to match pooches with their perfect owners."
    },
    {
      "url": "https://www.cbsnews.com/news/ukraine-refugees-work-permits-not-renewed/?intcid=CNI-00-10aaa3a",
      "text": "Ukrainian refugees face uncertain future as U.S. work permits are set to expire\nLiana Avetisian and most of her family fled Ukraine in 2023 and have built a new life in the U.S., resettling in DeWitt, Iowa, which calls itself the Crossroads to Opportunity.\nThe town has been just that for more than 75 Ukrainians, welcomed by people like Angela Boelens, who has helped many of the refugees with housing and jobs, at first on her own and then through an organization she helped found called Iowa Nice.\n\"I get a phone call every week from employers saying, 'Do you have anybody from Ukraine who needs a job?' Because we have a workforce shortage in Iowa and our population is declining,\" Boelens told CBS News.\nBack in Kiev, Avetisian sold real estate. In the U.S., she took a job at a window replacement company, a field where she had no previous experience.\n\"To find people that want to work and take pride in their work to our standards is not easy,\" said Sam Heer, who hired Avetisian. \"I want more Ukrainians.\"\nHeer employed Avetisian, her husband and her cousin before their two-year work permits expired. As the war in Ukraine continues, most European countries are renewing work permits of Ukrainian refugees. The Trump administration has not, pausing all immigration applications filed by migrants from Latin America and Ukraine earlier this year.\nHeer told CBS News he voted for President Trump in the 2024 election. When asked what he would tell the president or his administration about the Ukrainian refugees, Heer said, \"These people are hard to come by. They've been through upheaval just to get here and then, all of a sudden, what they thought they were building toward is shaken. When people do the right things and follow the rules, they should be rewarded.\"\nBut for Avetisian and her teenage daughter, the opportunity in Dewitt could be slipping away.\n\"They were promised to stay until it's safe to return. It's not safe to return. It's not even close,\" Boelens said. \"And when we make a promise to people, I feel we keep it.\"\nBoelens says many more work permits are about to expire, leaving Ukrainian refugees in limbo. They may not be forced to leave. But without a job, they can't afford to stay.\n\"It's not safe to go back to Kiev,\" Avetisian said when asked if she would return home. \"Every day, every night, it's bombing,\" she said, noting that her mother, who is still in Ukraine, sends her videos of the attacks.\nAfter enduring the pain of leaving everything behind, refugees like Avetisian just hope to stay rooted in the American heartland they now call home."
    },
    {
      "url": "https://www.cbsnews.com/news/online-in-person-dating-apps-decline/?intcid=CNI-00-10aaa3a",
      "text": "Some love-seekers abandoning apps for an old-fashioned approach to dating\nCincinnati, Ohio — Ross Rohling and Carlee Berns are like any other couple in their 20s. But what is unusual is that they met in person.\n\"When we tell people that we met at a singles event, they're like, 'No way, they still have those?' I'm like, 'Oh yeah, you should go,'\" Berns told CBS News.\nThe couple, who have been together for about 18 months and recently got engaged, met at an event hosted by Date Cincy.\nIt was just the second event put on by Cincinnati natives and childhood friends Paige Brailey and Logan Moore. They launched a matchmaking event series for people who've grown sick of swiping for dates and are looking to connect in person.\n\"It seems like the millennials are the ones who kind of make up the bulk of our events,\" Brailey said.\nMillennials, those between the ages of about 29 and 45, were the first to get on dating apps, and the first to get off of them, according to Beresford Research. Gen Zers, the generation between the ages of 13 and 28, use the apps even less, Beresford Research found.\n\"So now there's this craving and this yearning for just, time like this, right, where we're just connecting face-to-face with other humans,\" Brailey said.\nAt Date Cincy's events, anywhere between 50 and 800 singles show up with a common goal and without the ability to hide who they really are, like some people do online.\n\"You meet them in person, and then it's like, oh, well, we actually have nothing in common, or you're not who I thought you were,\" Moore said.\nThe dating app Bumble has lost 90% of its value since going public four years ago. Dating and singles events are increasingly popular, with attendance rising by 42% from 2022 to 2023, according to the ticketing platform Eventbrite.\n\"It's probably going to be awkward, just acknowledge it will be awkward,\" Berns said of the in-person dating experience. \"And just go in with an open mind, and who knows, maybe you'll meet someone and go on a first date and it goes well.\"\nRohling and Berns are among the many Date Cincy couples that the group counts among their success stories of love at first sight.\n\"I knew within the first month that I was going to marry her,\" Rohling said.\nIt's a chemistry that can only happen face-to-face.\n\"It's just part of the human nature,\" Rohling said. \"You get filled with a passion, you get filled with excitement and energy because you feel that chemistry.\""
    }
  ],
  "argos_summary": "Mary Lamar, a 56-year-old former inmate, has transformed her life with the help of Magnet, an Ohio nonprofit focused on filling manufacturing jobs. After serving a 3.5-year prison sentence for robbery, she is now a homeowner and supervisor at Talan Products, which has added jobs to meet workforce demands. Magnet provides career training and support to help individuals overcome barriers to employment, emphasizing the importance of community support in recovery. Tragically, shortly after her success story was shared, Lamar's home burned down, leading to a GoFundMe campaign for her recovery.",
  "argos_id": "ERD8901I3"
}