{
  "url": "https://lifehacker.com/best-ticket-sites",
  "authorsByline": "Lindsey Ellefson",
  "articleId": "7d00dfb9d44b4ad784208cc052e98952",
  "source": {
    "domain": "lifehacker.com",
    "paywall": false,
    "location": null
  },
  "imageUrl": "https://lifehacker.com/imagery/articles/01HF2GZA1VXHYV0J95Y5C09JZD/hero-image.fill.size_1200x675.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T19:30:00+00:00",
  "addDate": "2025-08-11T21:09:01.103560+00:00",
  "refreshDate": "2025-08-11T21:09:01.103562+00:00",
  "score": 1.0,
  "title": "Here's Which Event Ticket Sites Have the Best Deals",
  "description": "Most ticket-buying sites have similar seats available—but they don't always have the same prices.",
  "content": "Think back to the experiences you've had buying event tickets in the past five years or so. Were they seamless? Likely not: After the COVID-19 lockdowns ended, ticket revenue went way up and it got so hard to get tickets that the government had to try to break up the Ticketmaster monopoly.\n\nGetting a ticket to a concert, sporting event, or other live show has never been more fraught (to say nothing of more expensive), but you do have some options. Most ticket sites sell roughly the same or similar seats, but they do so at different prices and with different levels of hoops to jump through. Here's how to find a good deal.\n\nYour best bet, according to Redditors, is to go to the box office at the arena or event space for a ticket, as fees are usually pretty low when you buy them in person. Of course, for events with waitlists or ones that you’re planning to travel for, that’s not always an option, although I had great luck two years ago when I called a box office, told the receptionist I was traveling for the show, and bought my tickets over the phone. She upgraded them out of pure niceness, saying she rarely gets to talk to patrons anymore since most ticket-buying takes place online. Still, buying your tickets online is so convenient, it might be worth a few extra bucks to you. Let’s just make sure you’re not spending too many extra bucks.\n\nOver the years I've been buying tickets to baseball games and concerts—and especially the last two years of reviewing ticket-sale marketplaces for Lifehacker—I've found that the reputations and service quality of each of the following platforms have changed wildly. Ticketmaster has always been considered expensive (spoiler alert: it still is), but has also been considered secure. TickPick used to be the only place to go for all-inclusive pricing with no checkout surprises. Now, a lot of these apps have upped their level of service, but there are still some differences to consider.\n\nLet’s do a real-world test of the major sites: Ticketmaster, StubHub, Vivid Seats, SeatGeek, and TickPick. There’s also a service called GameTime we’ll look at, plus a newer entrant called XP, but the first one is more for last-minute gets and the second one is still pretty new.\n\nFor transparency, I redo this test every year for Lifehacker, so if you visited this page last fall, you may have seen a price comparison of tickets to the Sept. 14 baseball game at Chase Field, which I actually attended. This year, I'll do ticket prices for this Wednesday's Twins vs. Yankees game, which I am also attending in just over 48 hours, so my comparisons are as realistic as possible.\n\nWednesday's game includes a bobblehead giveaway, so prices are higher and seats are slightly more scarce than they would be for any other midweek match; that'll give us a good idea of how these apps operate in real crunch times. My tickets are in the 230s and I paid $47 for each of them. For today's test, let's see what tickets in that area go for on each platform in question. (And I'll tell you where I ended up getting mine, too, since I shopped around.)\n\nFor this year's test, Ticketmaster shocked me. Typically, you can rely on the biggest name in the ticket sales game to have a ton of seats available. Not this time. For Wednesday's game, there are no tickets available in sections 228 to 234. To sit in the 200 level at all (which I never do unless forced or seeing a matchup I don't care about), you won't spend below $112 per ticket—and that's before fees. Ticketmaster has helpfully labeled these \"$112+,\" but will not reveal the total until you log in and enter your payment details. Dastardly. To pay around what I paid, in the $50 range, you'd have to sit in the 400s. May I recommend simply watching the game on TV?\n\nStubHub redeemed itself this year. Two years ago, StubHub was transparent with its pricing. Last year, it did a 180 and refused to divulge what \"fees\" I would be paying until I put in my card information. This year, I can see clearly, without even having to log in, that seats in my chosen section are going for $69 including fees. Transparent pricing is crucial, especially when ticket prices are so absurdly high these days. Still, our North Star here is what I paid last week: $47. With most major events, you can expect ticket prices to go down, not up, as the big day gets closer, as long as there are still plenty of seats available. There are hundreds of tickets to the game still available on StubHub, so this price-gauging is not ideal, bobblehead night or not.\n\nVivid Seats infuriated me last year and I have not patronized it since. I used to buy all my tickets on this platform, since they had a deal where you'd earn free tickets after every few purchases, but last July, as I was getting ready to leave for a game I had bought tickets to, I discovered my purchase had been revoked with no notification. I didn't get a push notification, an email, or anything, and worse, when I spoke to customer service, they claimed they couldn't verify my identity (despite me using the platform faithfully for years) and I was barred from purchasing replacement tickets.\n\nPrices and transparency are one thing, but pure functionality and access to the tickets themselves are just as important, if not more so, so I want to be clear about my prior experiences with this particular site. The rewards system is novel and I haven't found any other marketplaces that offer anything similar, so I actually mourn the free tickets I would earn on here, but I can't risk my tickets being revoked in the future, so generally speaking, Vivid Seats is a no for me.\n\nFor today's test, I will give credit where it's due: You can sit in the first row of the section for $71 per ticket, including fees. I am in the eighth row, for what it's worth, and would consider an extra $25 or so worth it to sit in front. (I really do hate sitting higher up!) Elsewhere in the section, you can sit for up to $100 per ticket. Moreover, Vivid Seats is following the lead of many of its competitors. This year, the price is clearly labeled to include fees.\n\nIn last year's comparison, SeatGeek also refused to show me the total price until I had entered my card information. This year, like nearly everyone else, they've improved transparency considerably. Seats in our chosen section are $57 each, the price quoted includes fees, and you can tap all the way to the final screen with the total due clearly visible. I'll admit I never use this one, not because I have something against it, but just because I'm not in the habit of it. Today's test results could cause me to change my behavior.\n\nLet me start by saying I am biased toward TickPick and always will be because this is the platform that saved the day last year when Vivid Seats arbitrarily revoked my tickets. Since then, I've used it consistently; it's the platform I used to buy tickets to tonight's game and Tuesday's game, too, but not Wednesday's game (more on that in a moment). TickPick was the pioneer in listing all-inclusive prices and though today's test has revealed that most of its competitors have now followed suit, I'll always respect it for being the first to bundle fees in with the quoted price.\n\nSelection here is lower than some of its competitors, though. While there are seats available in nearly all sections, there are simply fewer of them to choose from. In fact, there are no seats available in the section we're testing, but seats in the next section over in the same row as my tickets are going for $87 each. One more section over and you're looking at $44 each. All things considered, the best prices are here, even if the selection isn't as good.\n\nThe tickets available on GameTime are even more limited, as the site is designed for \"last-minute\" buys. In each section, you have maybe one or two options. In the section we're testing, you have one: Two tickets in the seventh row for $68 each, including fees. With GameTime, maybe even more than with other platforms, you can expect these to go down in price the closer to the event you get, since the app is all about last-minute deals.\n\nFinally, I will reveal where I got my beautiful $47 tickets to what is, apparently, a very in-demand match: a new app called XP. Why? I use a different app called Claim to get cash back on certain purchases and XP was the deal of the week, which meant I would get $25 back if I spent $50 there. I am a sucker for money-back apps, plus I wanted to test something new.\n\nNow, obviously, the tickets I bought are not available anymore, but front-row tickets in that section are going on XP for $70, including fees. That is $1 less than you'd pay at Vivid Seats for front-row tickets in the section. Mostly, though, selection here was limited, too. Overall, I found purchasing my XP tickets very easy, but like the other non-Ticketmaster platforms listed here, it's a resale app, so the seller has not yet transferred them to me and, still anxious from my Vivid Seats fiasco last year, that's making me nervous.\n\nThe app does seem to have decent customer service, however; in fact, it's their whole marketing schtick. I received a confirmation email, details on how to contact support, and a rough estimate that my tickets will be delivered no later than tomorrow.\n\nConclusions and things to keep in mind\n\nFor most of these options, you're paying between $57 and $112—forgive me, \"$112+\"—to sit in the general area of our test for a game that doesn't start for over 48 hours. That's a huge range, in my opinion, especially since the event is in two days and the seats aren't even the best. This year, the winners of our head-to-head are Vivid Seats and TickPick, though Vivid Seats can be stressful and TickPick has limited options.\n\nMost of these function largely as resale sites, although some (namely Ticketmaster and SeatGeek) are primary marketplaces, too. The price you pay may have less to do with the platform itself as the person who has possession of the tickets and happens to be selling them on there. I've known for months that I would be going to the games tonight, tomorrow, and Wednesday, but I waited until five days ago to buy all my tickets because I knew the sellers would drop their prices as the events got closer. Ultimately, for tonight's game, I saved $5 per ticket by doing that—enough to buy myself a hotdog at the stadium.\n\nAll of these platforms have improved significantly since I started doing this test two years ago. At no point today did I have to sign into an account or enter in my card details; even browsing as a guest, I was able to clearly see prices and click all the way through to the purchase page, which means you have more freedom to shop around. By far the biggest improvement, though, was that all of them except Ticketmaster showed the full price of tickets, including fees.\n\nTicketmaster had the highest prices by far here today, but its reach is also inescapable. On numerous occasions, I've purchased tickets through a platform listed here, only to have them come by email from Ticketmaster. I don't really understand why, as Ticketmaster doesn't own any of the other platforms, but you'll most likely need to have an account with that marketplace to access your tickets, even if you aren't using it for the actual buying part.",
  "medium": "Article",
  "links": [
    "https://zdcs.link/92xn3y?pageview_type=Standard&template=Explainers&module=content_body&element=offer&item=text-link&element_label=SeatGeek&short_url=92xn3y&u=https%3A%2F%2Flifehacker.com%2Fbest-ticket-sites&event_label=SeatGeek",
    "https://mashable.com/article/ticketmaster-lawsuit-live-nation",
    "https://zdcs.link/Q47oxA?pageview_type=Standard&template=Explainers&module=content_body&element=offer&item=text-link&element_label=GameTime&short_url=Q47oxA&u=https%3A%2F%2Flifehacker.com%2Fbest-ticket-sites&event_label=GameTime",
    "https://lifehacker.com/tech/the-best-apps-for-getting-free-stuff",
    "https://zdcs.link/98bplv?pageview_type=Standard&template=Explainers&module=content_body&element=offer&item=text-link&element_label=GameTime&short_url=98bplv&u=https%3A%2F%2Flifehacker.com%2Fbest-ticket-sites&event_label=GameTime",
    "https://zdcs.link/QxA5Lp?pageview_type=Standard&template=Explainers&module=content_body&element=offer&item=text-link&element_label=Ticketmaster&short_url=QxA5Lp&u=https%3A%2F%2Flifehacker.com%2Fbest-ticket-sites&event_label=Ticketmaster",
    "https://zdcs.link/z62r7Y?pageview_type=Standard&template=Explainers&module=content_body&element=offer&item=text-link&element_label=TickPick&short_url=z62r7Y&u=https%3A%2F%2Flifehacker.com%2Fbest-ticket-sites&event_label=TickPick",
    "https://zdcs.link/aAgvXb?pageview_type=Standard&template=Explainers&module=content_body&element=offer&item=text-link&element_label=XP&short_url=aAgvXb&u=https%3A%2F%2Flifehacker.com%2Fbest-ticket-sites&event_label=XP",
    "https://zdcs.link/9Ydwq4?pageview_type=Standard&template=Explainers&module=content_body&element=offer&item=text-link&element_label=TickPick&short_url=9Ydwq4&u=https%3A%2F%2Flifehacker.com%2Fbest-ticket-sites&event_label=TickPick",
    "https://www.reddit.com/r/caps/comments/cox6sv/comment/ewls4xg/?utm_source=reddit&utm_medium=web2x&context=3",
    "https://zdcs.link/9lwAqW?pageview_type=Standard&template=Explainers&module=content_body&element=offer&item=text-link&element_label=SeatGeek&short_url=9lwAqW&u=https%3A%2F%2Flifehacker.com%2Fbest-ticket-sites&event_label=SeatGeek",
    "https://zdcs.link/Qm2eqK?pageview_type=Standard&template=Explainers&module=content_body&element=offer&item=text-link&element_label=Ticketmaster&short_url=Qm2eqK&u=https%3A%2F%2Flifehacker.com%2Fbest-ticket-sites&event_label=Ticketmaster",
    "https://zdcs.link/9ZdD8Y?pageview_type=Standard&template=Explainers&module=content_body&element=offer&item=text-link&element_label=StubHub&short_url=9ZdD8Y&u=https%3A%2F%2Flifehacker.com%2Fbest-ticket-sites&event_label=StubHub",
    "https://www.hollywoodreporter.com/business/business-news/live-nation-revenue-soars-as-concert-ticket-sales-recover-1235141653/",
    "https://zdcs.link/z7Ompn?pageview_type=Standard&template=Explainers&module=content_body&element=offer&item=text-link&element_label=Vivid%20Seats&short_url=z7Ompn&u=https%3A%2F%2Flifehacker.com%2Fbest-ticket-sites&event_label=Vivid%20Seats",
    "https://zdcs.link/QGgJDx?pageview_type=Standard&template=Explainers&module=content_body&element=offer&item=text-link&element_label=StubHub&short_url=QGgJDx&u=https%3A%2F%2Flifehacker.com%2Fbest-ticket-sites&event_label=StubHub",
    "https://zdcs.link/QVD4kx?pageview_type=Standard&template=Explainers&module=content_body&element=offer&item=text-link&element_label=Vivid%20Seats&short_url=QVD4kx&u=https%3A%2F%2Flifehacker.com%2Fbest-ticket-sites&event_label=Vivid%20Seats"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "ticket prices",
      "weight": 0.11452706
    },
    {
      "name": "event tickets",
      "weight": 0.10400171
    },
    {
      "name": "ticket",
      "weight": 0.09999637
    },
    {
      "name": "tickets",
      "weight": 0.09999637
    },
    {
      "name": "free tickets",
      "weight": 0.097402476
    },
    {
      "name": "ticket revenue",
      "weight": 0.09634807
    },
    {
      "name": "replacement tickets",
      "weight": 0.09572246
    },
    {
      "name": "Most ticket sites",
      "weight": 0.09559764
    },
    {
      "name": "Last year",
      "weight": 0.07756553
    },
    {
      "name": "last year",
      "weight": 0.07756553
    }
  ],
  "topics": [
    {
      "name": "Shopping"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Events & Listings/Event Ticket Sales",
      "score": 0.65625
    },
    {
      "name": "/Arts & Entertainment/Events & Listings/Concerts & Music Festivals",
      "score": 0.414794921875
    }
  ],
  "sentiment": {
    "positive": 0.3071187,
    "negative": 0.2201587,
    "neutral": 0.4727226
  },
  "summary": "The article discusses how to find the best deals for event ticket tickets, with a real-world test of major ticket sites including Ticketmaster, StubHub, Vivid Seats, SeatGeek, and TickPick. The author reviews the reputations and service quality of these platforms for Lifehacker. The test also includes GameTime, XP, and XP, as well as new service XP. The article compares ticket prices for a baseball game in the 230s and $47 for each ticket purchased at each platform. It also notes that Ticketmaster has been considered expensive but also considered secure, with the site's reputation shifting from its all-inclusive pricing to more restrictive checkout surprises. The report also provides a price comparison of tickets to a Twins vs. Yankees game.",
  "shortSummary": "Despite the convenience of online event tickets, many sites offer significantly different prices and user experience, with different pricing patterns and service quality compared to previous purchases.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "41d0e6e8f66241a6954571e5040623d8",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://zdcs.link/Qm2eqK?pageview_type=Standard&template=Explainers&module=content_body&element=offer&item=text-link&element_label=Ticketmaster&short_url=Qm2eqK&u=https%3A%2F%2Flifehacker.com%2Fbest-ticket-sites&event_label=Ticketmaster",
      "text": "Ticketmaster United States\nHighlights\nPopular Near You\nConcerts\nSee AllSee All ConcertsSports\nSee AllSee All SportsArts, Theater & Comedy\nSee AllSee All Arts, Theater & ComedyFamily\nSee AllSee All FamilyEntertainment Guides\nNFL Tickets\nGet tickets to catch your favorite team live at the Official Ticket Marketplace of the NFL.\nMLS Tickets\nCatch every action-packed game this season and get tickets at the Official Ticket Marketplace of the MLS.\nMLB Tickets\nCatch every action-packed game this season and get tickets at the Official Ticket Marketplace of the MLB.\nSummer Events in LA\nLooking for things to do in Los Angeles?\nSummer Events in NYC\nLooking for things to do in New York City?\nNYC Broadway\nDon't miss your chance to catch the hottest shows live in NYC.\nDiscover More\n- Tips\nHow All In Prices Make Buying Tickets Easier\nWith All In Prices, you’ll see the cost of your ticket—including fees, before taxes—from the moment you start shopping.\nDiscover More - Music\nHow to Prepare for Ticket Sales\nHere are some tips to help you prepare for when tickets go on sale, so you have the best chance at making sure you’re there live.\nDiscover More - Tips\nGet Started on Ticketmaster\nEverything you need to know about buying tickets, navigating your account, finding out when tickets go on sale, and more.\nDiscover More - Arts & Theater\n8 Broadway Shows to See This Summer in NYC\nNeed ideas for family activities in NYC? Here's a guide to the best Broadway shows and musicals to see during the 2025 summer season.\nDiscover More - Music\nSign Up For What To See\nGet the Ticketmaster newsletter that covers what's happening in live music, from the biggest touring artists to the rising stars you need to know about.\nDiscover More - Sports\nBatter Up! A Guide to Taking Kids to an MLB Game\nReady for their first MLB game? Here's everything you need to know about kids and baseball games.\nDiscover More"
    },
    {
      "url": "https://lifehacker.com/tech/the-best-apps-for-getting-free-stuff",
      "text": "It's not hard to get me to download an app—if I see an ad for one, it's going right on my phone. I don't care at all if it's all a scheme to get my data. My data is out there, baby, and it's too late to care, so I might as well reap all the benefits these flash-in-the-pan, VC-bolstering programs can give me.\nSome of the time, I don't get much. But other times, I get free stuff! I love trading my data and my finite time on this earth for meager rewards. If you do too, here are eight apps I use all the time to get free stuff, from food to more tangible goods.\nThe best apps to get free food or drinks\nDunkin'\nAs I've noted before, the Dunkin' app is elite when it comes to rewarding customers for spending money on donuts and coffee. If you play it right, you can get all kinds of treats for free. Yes, you have to spend money to earn money, but if you're already going to Dunkin', that doesn't really matter. For every dollar you spend, you get 10 rewards points, but if you visit 12 times in a month and hit \"boosted\" status, each dollar you spend for the next three months earns you 12 points. Points add up quickly, and you don't need all that many to score something free: You can get an espresso shot for 150, a donut for 250, a hot or iced coffee of any size for 500, and so on.\nThere are also point-enhancing promotions going on all the time. Sometimes, you get bonus points for ordering a certain snack or visiting at a certain time. On Mondays, you get 100 points just for placing a mobile order. Soon enough, you'll be rolling in free Munchkins.\nMcDonald's\nIn the food and drink sphere, I have a membership and associated app at pretty much every restaurant chain. McDonald's is among the best. The app is fabulous because it's constantly running promotions where you can get a free something-or-other, usually for doing nothing but using the app to place your order. On days when I'm feeling frugal but not particularly health-conscious, you'll catch me mobile-ordering my way to a medium fry and a big Diet Coke—and the fries are free as long as I spend a minimum of $1, which is about what the drink costs. Don't mind if I do!\nRight now, the app is offering up a free double cheeseburger or six-piece McNuggets when you buy one. I also have enough points for two McChickens or a large iced coffee. Every dollar you spend earns you 100 points, but as with the Dunkin' app, you also get bonus points for fulfilling certain stipulations, like double points on breakfast orders. The first time you pay through the app with your linked card, you'll also get 1,500 points, which is enough for a cheeseburger.\n7-Eleven\n7-Eleven has a severely underrated rewards app. I usually get a dollar or so off my purchases every few visits, and since most of the goods available at this convenience store are themselves just a few dollars, that basically means I'm getting free Doritos or Vitamin Waters every two weeks. Every dollar you spend gets you 10 points (unless you're spending on age-restricted items or gas), plus you can earn extra points for daily promotions like buying two of a certain item. Once you get 1,000 points, you have $1 to spend. A dollar off for every $100 spent isn't great, but if you take advantage of those random weekly specials, you can score a lot of bonus points. I also maximize my points (and laziness) by getting household necessities on a one-by-one basis at 7 Eleven. Instead of waiting for my bi-monthly Target run to stock up on paper towels, garbage bags, and frozen pizzas, I just get them as I need them at the convenience chain. (I do not think Target Circle is a great app for free stuff, so you see how I operate here.)\nSeated\nFor a slightly different spin on getting free stuff from a food app, try Seated, which I've also evangelized for before. What sets it apart from other restaurant-affiliated apps is that the free things you get for using it don't come from the restaurants themselves. Instead, you get a percentage of your money back every time you use the app to make a reservation and eat a meal, which you can then spend on gift cards for businesses like Uber, Amazon, and TJMaxx—or just have it deposited back into your checking account as cash. Again, you're spending money to make money, but it's better than getting nothing if you're spending anyway. I have gotten hundreds of dollars back from Seated and turned that into hundreds of dollars worth of free stuff.\nThe referrals program is also top-notch. You get $10 any time someone you refer dines out with the app (and they get $10, too), but what's more, once you rack up five confirmed referrals, you get $1 any time one of your referrals dines out ever. I have made $185 in referrals alone.\nClaim\nLast month, I was served up an ad for Claim, an app with the tagline \"get paid to eat and shop.\" Buddy, you do not have to tell me twice. After linking a debit card and my Venmo account, I got to work figuring out how to earn my free stuff. The gist is that once per week, you can choose a restaurant or retail establishment from a pre-selected list and stake a \"claim\" on it. This means that if and when you spend money at that spot during that week using your linked card, you get a set amount sent back to your Venmo account. To test it out, I got a claim for Wingstop, which happens to be across the street from the post office where I ship out my Poshmark sales. I took a walk, dropped off my sales for the day, then ordered a six-piece wing box. By the time I got home and tucked into the chicken, $10 had appeared in my Venmo account. I would have had to stop and eat that day anyway, so this was free money. Since then, I've gotten money back for booking classes at Solidcore (something I was going to do already), buying tickets to a sporting event (again, something I was going to do regardless), and more.\nWhile you can only select and use one claim per week, you can earn additional claims by inviting friends to the app. You pick the establishment you want a claim for—right now, choices include Starbucks, Chipotle, Blue Bottle Coffee, Dunkin', and more—and the place you want your friend to get their free claim for. Once they use your referral and link a card to the app, you both get a bonus claim. As with Seated, I am now rolling in referral dough.\nThe best apps to get free stuff\nInfluenster\nI'm way into makeup and personal care items and I'm always looking for ways to get my hands on more. Years ago, I downloaded Influenster, an app that promised free samples in exchange for a little effort on my part in the form of reviewing products within the app. After earning up some cred within the app, I started getting free stuff sent to me, with the caveat that I would thoughtfully review it. There were other tasks I could complete, like creating public Instagram posts about products, but I declined—that's not my style. Even without completing those challenges, I have gotten a ton of free stuff. I even secured a few lipsticks from Revlon that I never would have bought on my own, but ended up liking so much that I've consistently repurchased them in the years since 2017. Great app.\nIris\nLately, I've gotten very into Iris, which is basically a new-gen spin on Influenster. You earn \"gems\" by reviewing products, posting in discussions, and generally interacting with the community, which is comprised of people interested in beauty and skincare. These gems can be used on \"drops,\" or limited-time offers of products you can get sent to you free, but which you must then review. The drops you're eligible for depend on your level within the app, with the quality scaling up as you climb the ladder.\nDrops are quite limited: One may only have a few pieces available, so you have to order it the second it hits your phone, unless you're saving your gems for something major. Right now, I'm entertaining the delusion that I'll earn 45,000 gems fast enough to snag the final remaining Dyson Airstraight, a hair tool that costs $500 in the real world. The nice thing about Iris is that you can't use real money to buy gems or expedite your progress. You really do have to do it all on your own, and you'll pay nothing out of pocket. Yes, you're still spending time and energy reviewing and photographing your goods, but you also get access to everyone else's reviews, which is helpful when making purchasing decisions. Everything in life is a trade-off.\nA few months ago, I used my gems on a travel-sized bottle of Glossier perfume, which saved me about $40. I didn't have to wait long, the package came straight from Glossier as if I'd ordered from the company directly, and all I had to do was write a review the next week. More recently, I got some Vacation aftersun gel, which only retails for $14, but which I wanted quite badly. I always use my FSA money to buy sunscreen and I love the Vacation product line, but I couldn't justify spending real money on it when I have used my \"free\" FSA money on the other products. My penny-pinching streak continues unmarred. May God strike me dead before I spend a real cent of my paycheck on a sun product.\nTYB\nThe latest entrant in my free-things app hoard is TYB, which is a third-party membership hub for a variety of brands. Basically, instead of having your loyalty membership run directly through the brand itself, these companies outsource the point-accruing to a standalone app. Some of the brands that use TYB include, but are not at all limited to, Glossier, Outdoor Voices, Poppi, Rare Beauty, Crocs, and Urban Outfitters. I joined it because I am a loyal (if not obsessed) customer of an activewear brand called SET Active, but once I was on the app, I saw how easy it was to join the loyalty programs of other TYB-affiliated companies I also patronize.\nEarning your \"coins,\" which translate directly into discount codes you can redeem at checkout when shopping the brands directly, is not only simple, but enjoyable: You participate in challenges that ask you for feedback. So, b.Tan may ask for suggestions on which stores you'd like to see their tanning products in or Wellah may ask for ideas for future creatine powder flavors. WeWoreWhat may ask where you typically wear their clothes. You get the idea. You can review past purchases, give detailed product feedback, and actually interact with the brands and the community of consumers who like them. It's unlike any loyalty membership I've ever been a part of—plus I am, as you would expect, absolutely flush with coins I am happily using for discounts at checkout. Across the 10 brands I joined, I currently have $542 to spend, but that doesn't include the over $100 I've already redeemed.\nAnd yes, I know nothing is really free\nWhat's that phrase?\"If it's free, you're the product?\" Well, yes. All of these apps require me to give companies access to my data, from my interests to my shopping habits. I'm also racking up time playing games, writing reviews, or even spending money to earn some of it back. I understand that, but in these instances, it's a trade I'm willing to make. If Big Brother wants to keep tabs on my McChicken consumption, I could not possibly care less at this point. I have accepted we already live under some degree of constant surveillance, so my goal is to thrive, not survive. Give me my free French fries.\nBy choosing apps that line up with the things you'd already be doing or spending money on—in my case: buying makeup, walking to Dunkin' twice a day, and wasting time on my phone—you can earn free rewards, and make the most of your routines and idle time. Life can be a downer, so I might as well find ways to turn a mundane task into free perfume."
    },
    {
      "url": "https://www.hollywoodreporter.com/business/business-news/live-nation-revenue-soars-as-concert-ticket-sales-recover-1235141653/",
      "text": "Live Nation said it experienced its “best first quarter ever,” driven by strong buying trends at Ticketmaster.\nIn the three months ended March 31, Ticketmaster recorded its second highest gross transaction volume, excluding refunds, in the company’s history, with an estimated 111,292 tickets sold. The segment added seven million net new tickets in the quarter.\nLive Nation recorded approximately 11 million fans attending shows in the first quarter, down from 15 million in the first quarter of 2019 (the most comparable quarter according to the company), as Live Nation had planned “limited concert activity” in the early months of the year in anticipation of greater demand later this year. “No-show rates” were back to pre-COVID-19 levels.\nRelated Stories\nNotably, executives said inflation does not appear to be impacting consumer demand or pricing on the ticket sales.\nSponsorship sales are up double-digits compared to this point in 2019. The company has already sold 90 percent of its planned sponsorship for the year.\nLive Nation recorded first quarter revenue of $1.8 billion, up from $290 million in the year-earlier quarter.\nThe company anticipates a strong year ahead, built on the ticketing momentum from the first quarter. More than 70 million tickets have now been sold for shows in 2022, up 36 percent from this point in 2019. Additionally, Live Nation has more than 60 tours under discussion for 2023.\nCOVID-19 is having less of an impact on planned events and the company only canceled about 1 percent of planned concerts in March.\n“Concert fans are showing no signs of slowing down – they are paying more for the best tickets, attending the shows, and spending more onsite as they create lifetime memories,” Michael Rapino, president and chief executive of Live Nation, wrote in the earnings release.\nTHR Newsletters\nSign up for THR news straight to your inbox every day"
    },
    {
      "url": "https://zdcs.link/QxA5Lp?pageview_type=Standard&template=Explainers&module=content_body&element=offer&item=text-link&element_label=Ticketmaster&short_url=QxA5Lp&u=https%3A%2F%2Flifehacker.com%2Fbest-ticket-sites&event_label=Ticketmaster",
      "text": "Ticketmaster United States\nHighlights\nPopular Near You\nConcerts\nSee AllSee All ConcertsSports\nSee AllSee All SportsArts, Theater & Comedy\nSee AllSee All Arts, Theater & ComedyFamily\nSee AllSee All FamilyEntertainment Guides\nNFL Tickets\nGet tickets to catch your favorite team live at the Official Ticket Marketplace of the NFL.\nMLS Tickets\nCatch every action-packed game this season and get tickets at the Official Ticket Marketplace of the MLS.\nMLB Tickets\nCatch every action-packed game this season and get tickets at the Official Ticket Marketplace of the MLB.\nSummer Events in LA\nLooking for things to do in Los Angeles?\nSummer Events in NYC\nLooking for things to do in New York City?\nNYC Broadway\nDon't miss your chance to catch the hottest shows live in NYC.\nDiscover More\n- Tips\nHow All In Prices Make Buying Tickets Easier\nWith All In Prices, you’ll see the cost of your ticket—including fees, before taxes—from the moment you start shopping.\nDiscover More - Music\nHow to Prepare for Ticket Sales\nHere are some tips to help you prepare for when tickets go on sale, so you have the best chance at making sure you’re there live.\nDiscover More - Tips\nGet Started on Ticketmaster\nEverything you need to know about buying tickets, navigating your account, finding out when tickets go on sale, and more.\nDiscover More - Arts & Theater\n8 Broadway Shows to See This Summer in NYC\nNeed ideas for family activities in NYC? Here's a guide to the best Broadway shows and musicals to see during the 2025 summer season.\nDiscover More - Music\nSign Up For What To See\nGet the Ticketmaster newsletter that covers what's happening in live music, from the biggest touring artists to the rising stars you need to know about.\nDiscover More - Sports\nBatter Up! A Guide to Taking Kids to an MLB Game\nReady for their first MLB game? Here's everything you need to know about kids and baseball games.\nDiscover More"
    },
    {
      "url": "https://mashable.com/article/ticketmaster-lawsuit-live-nation",
      "text": "U.S. Justice Department moves to break up Ticketmaster and Live Nation over antitrust violations\nGood news for anyone who's ever found themselves in the Ticketmaster trenches: The U.S. Justice Department seeks to break up Live Nation Entertainment, Ticketmaster's parent company, over antitrust law violations.\nThe lawsuit, filed this morning (May 23), alleges that the music giant illegally controls a monopoly in live entertainment by engaging in long-term exclusive contracts with venues and threatening financial retribution against venues and artists who use Ticketmaster. It argues that these practices violate antitrust laws and drive up ticket prices. According to The New York Times, the lawsuit aims to break up the monopoly.\n\"We allege that Live Nation relies on unlawful, anticompetitive conduct to exercise its monopolistic control over the live events industry in the United States at the cost of fans, artists, smaller promoters, and venue operators,\" Attorney General Merrick Garland said in a statement. \"The result is that fans pay more in fees, artists have fewer opportunities to play concerts, smaller promoters get squeezed out, and venues have fewer real choices for ticketing services. It is time to break up Live Nation-Ticketmaster.\"\nLive Nation denies that its practices violate antitrust laws.\nA spokesperson for Live Nation Entertainment provided the following statement to Mashable:\n\"The DOJ's lawsuit won't solve the issues fans care about relating to ticket prices, service fees, and access to in-demand shows. Calling Ticketmaster a monopoly may be a PR win for the DOJ in the short term, but it will lose in court because it ignores the basic economics of live entertainment, such as the fact that the bulk of service fees go to venues, and that competition has steadily eroded Ticketmaster’s market share and profit margin. Our growth comes from helping artists tour globally, creating lasting memories for millions of fans, and supporting local economies across the country by sustaining quality jobs. We will defend against these baseless allegations, use this opportunity to shed light on the industry, and continue to push for reforms that truly protect consumers and artists.\"\nTicketmaster, the largest ticket-selling company in the country, merged with Live Nation in 2010. At the time, Ticketmaster operated roughly 70 percent of the concert ticket market in the U.S., and Live Nation was the world's largest concert promoter.\nThe tides turned against Ticketmaster in 2022 when the site crashed during presale for Taylor Swift's wildly popular Eras Tour. The company said it was overwhelmed by unprecedented demand for tickets and bot attacks. But fans swiftly turned against the ticketing giant, which eventually led to the government getting involved.\nElena is a tech reporter and the resident Gen Z expert at Mashable. She covers TikTok and digital trends. She recently graduated from UC Berkeley with a BA in American History. Email her at [email protected] or follow her @ecaviar_."
    }
  ],
  "argos_summary": "The article discusses the challenges and options for purchasing event tickets in the current market, particularly after the COVID-19 pandemic. It highlights the difficulties faced with Ticketmaster, including high prices and a lack of transparency, while comparing various ticket-selling platforms like StubHub, Vivid Seats, SeatGeek, TickPick, GameTime, and a newer app called XP. The author emphasizes the importance of shopping around for the best deals and notes improvements in transparency across many platforms, although Ticketmaster remains a dominant player despite ongoing antitrust scrutiny from the U.S. Justice Department.",
  "argos_id": "EX5FDGP0F"
}