{
  "url": "https://www.seattletimes.com/nation-world/nation/trumps-washington-police-takeover-echoes-history-of-racist-narratives-about-urban-crime/",
  "authorsByline": "MATT BROWN",
  "articleId": "37d706645c2c49528656a3d5b0872846",
  "source": {
    "domain": "seattletimes.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "WA",
      "county": "King County",
      "city": "Seattle",
      "coordinates": {
        "lat": 47.6038321,
        "lon": -122.330062
      }
    }
  },
  "imageUrl": "https://images.seattletimes.com/wp-content/uploads/2025/08/urnpublicidap.org39388597bad7e70085079888fe7fb57bUS_Trump_DC_Takeover_Race_48494.jpg?d=1200x630",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T21:04:10-07:00",
  "addDate": "2025-08-12T04:12:56.926459+00:00",
  "refreshDate": "2025-08-12T04:12:56.926461+00:00",
  "score": 1.0,
  "title": "Trump’s Washington police takeover echoes history of racist narratives about urban crime",
  "description": "President Donald Trump has taken control of the District of Columbia’s law enforcement and ordered National Guard troops to deploy onto the streets of the nation’s capital.",
  "content": "WASHINGTON (AP) — President Donald Trump has taken control of the District of Columbia’s law enforcement and ordered National Guard troops to deploy onto the streets of the nation’s capital, arguing the extraordinary moves are in response to an urgent public safety crisis.\n\nEven as district officials questioned the claims underlying his emergency declaration, the president promised a “historic action to rescue our nation’s capital from crime, bloodshed, bedlam and squalor and worse.” His rhetoric echoed that used by conservative politicians going back decades who have denounced American cities, especially those with majority non-white populations or led by progressive politicians, as lawless or crime-ridden and in need of outside intervention.\n\n“This is liberation day in D.C., and we’re going to take our capital back,” Trump promised Monday.\n\nBut for many residents, the prospect of federal troops surging into the district’s neighborhoods represents an alarming violation of local agency. To some, it echoes uncomfortable historical chapters when politicians used language to paint historically or predominantly Black cities and neighborhoods with racist narratives to shape public opinion and justify aggressive police action.\n\nApril Goggans, a longtime Washington resident and grassroots organizer, said she was not surprised by Trump’s actions. Communities had been preparing for a potential federal crackdown in the district since the summer of 2020, when Trump deployed National Guard troops during racial justice protests after the murder of George Floyd.\n\n“We have to be vigilant,” said Goggans, who has coordinated protests and local civil liberties educational campaigns for nearly a decade. She worries about what a surge in law enforcement could mean for residents’ freedoms.\n\n“Regardless of where you fall on the political scale, understand that this could be you, your children, your grandmother, your co-worker who are brutalized or have certain rights violated,” she said.\n\nAccording to White House officials, National Guard troops will be deployed to protect federal assets in the district and facilitate a safe environment for law enforcement to make arrests. The administration believes the highly visible presence of law enforcement will deter violent crime.\n\nIt is unclear how the administration defines providing a safe environment for law enforcement to conduct arrests, raising alarm bells for some local advocates.\n\n“The president foreshadowed that if these heavy-handed tactics take root here, they will be rolled out to other majority-Black and Brown cities, like Chicago, Oakland and Baltimore, across the country,” said Monica Hopkins, executive director of the American Civil Liberties Union’s D.C. chapter.\n\n“We’ve seen before how federal control of the D.C. National Guard and police can lead to abuse, intimidation and civil rights violations — from military helicopters swooping over peaceful racial justice protesters in 2020 to the unchecked conduct of federal officers who remain shielded from full accountability,” Hopkins said.\n\nConservative lawmakers have for generations used denigrating language to describe the condition of major American cities and called for greater law enforcement, often in response to changing demographics in those cities driven by nonwhite populations relocating in search of work or safety from racial discrimination and state violence. Republicans have called for greater police crackdowns in cities since at least the 1965 Watts Riots in Los Angeles.\n\nPresident Richard Nixon won the White House in 1968 after campaigning on a “law and order” agenda to appeal to white voters in northern cities alongside overtures to white Southerners as part of his “Southern Strategy.” Ronald Reagan similarly won both his presidential elections after campaigning heavily on law and order politics. Politicians ranging from former New York Mayor Rudy Giuliani to former President Bill Clinton have cited the need to tamp down crime as a reason to seize power from cities like Washington for decades.\n\nDistrict of Columbia Mayor Muriel Bowser called Trump’s takeover of the local police force “unsettling” but not without precedent. The mayor kept a mostly measured tone during a Monday news conference following Trump’s announcement but decried the president’s reasoning as a “so-called emergency” and said the district’s residents “know that access to our democracy is tenuous.”\n\nTrump threatened to “take over” and “beautify” the nation’s capital on the campaign trail and claimed the district was “a nightmare of murder and crime.” He also argued the city was “horribly run” and said his team intended “to take it away from the mayor.” The president repeated comments he’d previously made about some of the nation’s largest cities during his news conference, including Baltimore, Chicago, Los Angeles, Oakland, California, and his hometown of New York City. All are currently run by Black mayors.\n\n“You look at Chicago, how bad it is. You look at Los Angeles, how bad it is. We have other cities in a very bad, New York is a problem. And then you have, of course, Baltimore and Oakland. We don’t even mention that anymore. They’re so far gone. We’re not going to let it happen,” he said.\n\nCivil rights advocates see the president’s rhetoric as part of a broader political strategy.\n\n“It’s a playbook he’s used in the past,” said Maya Wiley, CEO of the Leadership Conference on Civil and Human Rights.\n\nThe president’s rhetoric “paints a picture that crime is out of control, even when it is not true, then blames the policies of Democratic lawmakers that are reform- and public safety-minded, and then claims that you have to step in and violate people’s rights or demand that reforms be reversed,” Wiley said.\n\nShe added that the playbook has special potency in the capital because the district’s local law enforcement can be directly placed under federal control, a power Trump invoked in his announcement.\n\nTrump’s actions in Washington and comments about other major American cities sent shock waves across the country, as other cities prepare to respond to potential federal action.\n\nDemocratic Maryland Gov. Wes Moore said Trump’s plan “lacks seriousness and is deeply dangerous” in a statement and pointed to a 30-year-low crime rate in Baltimore as a reason the administration should consult local leaders rather than antagonize them. In Oakland, Mayor Barbara Lee called Trump’s characterization of the city “fearmongering.”\n\nThe administration already faced a major flashpoint between local control and federal power earlier in the summer, when Trump deployed National Guard troops to quell protests and support immigration enforcement operations in Los Angeles despite opposition from California Gov. Gavin Newsom and Los Angeles Mayor Karen Bass.\n\nCivil rights leaders have denounced Trump’s action in Washington as an unjustified distraction.\n\n“This president campaigned on ‘law and order,’ but he is the president of chaos and corruption,” said NAACP President Derrick Johnson. “There’s no emergency in D.C., so why would he deploy the National Guard? To distract us from his alleged inclusion in the Epstein files? To rid the city of unhoused people? D.C. has the right to govern itself. It doesn’t need this federal coup.”",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "law enforcement",
      "weight": 0.074990615
    },
    {
      "name": "other cities",
      "weight": 0.07342986
    },
    {
      "name": "other major American cities",
      "weight": 0.072740026
    },
    {
      "name": "greater law enforcement",
      "weight": 0.07234528
    },
    {
      "name": "American cities",
      "weight": 0.07192105
    },
    {
      "name": "major American cities",
      "weight": 0.071887046
    },
    {
      "name": "cities",
      "weight": 0.068475574
    },
    {
      "name": "northern cities",
      "weight": 0.06741005
    },
    {
      "name": "President Donald Trump",
      "weight": 0.0669314
    },
    {
      "name": "Trump",
      "weight": 0.0635545
    }
  ],
  "topics": [
    {
      "name": "Social Issues"
    },
    {
      "name": "Racial Injustice"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.95947265625
    },
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.90478515625
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.76416015625
    },
    {
      "name": "/Sensitive Subjects/Other",
      "score": 0.73486328125
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.59814453125
    },
    {
      "name": "/Sensitive Subjects/Violence & Abuse",
      "score": 0.486572265625
    }
  ],
  "sentiment": {
    "positive": 0.059722997,
    "negative": 0.7484747,
    "neutral": 0.19180231
  },
  "summary": "President Donald Trump has taken control of the District of Columbia's law enforcement and ordered National Guard troops to deploy onto the streets of the nation's capital, in response to an urgent public safety crisis. Despite questions from district officials, many residents believe this move represents an alarming violation of local agency. The move echoes historical statements by conservative politicians who have denigrated American cities as lawless or crime-ridden. The White House plans to use these troops to protect federal assets in the district and create a safe environment for law enforcement to make arrests, but it is unclear how this policy would be used. The American Civil Liberties Union warns that if successful, it could be extended to other majority-Black and Brown cities across the country.",
  "shortSummary": "President Donald Trump's takeover of Washington's police force amid a crime crisis has sparked concerns about racial and civil rights abuses.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "891d3371c5a0445aa1f3db5a8dc4287f",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "President Trump has ordered the deployment of National Guard troops in Washington, D.C., claiming it is necessary to address a public safety crisis, despite local officials questioning the legitimacy of this emergency declaration. His rhetoric has drawn parallels to historical narratives used to justify federal intervention in predominantly non-white cities, raising concerns among civil rights advocates about potential abuses of power and violations of local autonomy. Critics argue that Trump's actions and language reflect a broader political strategy aimed at undermining local governance and instilling fear in urban communities.",
  "argos_id": "F28C3WLSQ"
}