{
  "url": "https://www.latimes.com/sports/story/2025-08-11/ufc-champion-ilia-topuria-calls-out-canelo-alvarez-give-me-the-opportunity",
  "authorsByline": "By Jad El RedaColumnist, Staff Writer  Follow",
  "articleId": "a58afb1bd8894591aa7e60b479888a4c",
  "source": {
    "domain": "latimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "CA",
      "city": "Los Angeles",
      "coordinates": {
        "lat": 34.0536909,
        "lon": -118.242766
      }
    }
  },
  "imageUrl": "https://ca-times.brightspotcdn.com/dims4/default/2539ab2/2147483647/strip/true/crop/4665x2449+0+330/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F98%2F5d%2F928ee40748c3a453b7a7ae2ce597%2Fufc-317-mixed-martial-arts-36938.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T23:29:19.091000+00:00",
  "addDate": "2025-08-11T23:34:15.626764+00:00",
  "refreshDate": "2025-08-11T23:34:15.626766+00:00",
  "score": 1.0,
  "title": "UFC champion Ilia Topuria calls out Canelo Álvarez: Give me the opportunity.",
  "description": "The Spanish-Georgian wants to follow in the footsteps of Conor McGregor and box against his idol Canelo Álvarez, who will face Terence Crawford in September in Las Vegas.",
  "content": "Undefeated UFC lightweight champion Ilia Topuria once again expressed his desire to cross over to professional boxing and face the winner of the upcoming fight between Mexican superstar Saúl “Canelo” Álvarez and Terence Crawford.\n\nTopuria said his goal is to face Álvarez, whom he has considered a role model and idol for years. The Spanish-Georgian fighter hopes the UFC will allow him to follow in the footsteps of Conor McGregor, who fought and lost to Floyd Mayweather Jr. in August 2017 while under contract with the mixed martial arts promoter.\n\nTopuria said he feels ready to compete in the boxing ring and that this is the ideal opportunity to do so.\n\n“Why not me? I would love to box against the winner of Canelo and Crawford. But if I could choose, I want Canelo. He was my idol for many years and I feel I can do it,” Topuria told reporters. “Let’s do it, now is the best time.”\n\nTopuria, who knocked out Charles Oliveira in June to win his second UFC belt, is enjoying the best moment of his career. He has knocked out figures such as Max Holloway and Alexander Volkanovski, establishing himself as one of the biggest stars in mixed martial arts. However, he is now turning his attention to boxing and wants to prove that he can also excel in the ring.\n\nHis prediction for the fight between Álvarez and Crawford, which will take place on Sept. 13 in Las Vegas, is that the Mexican will win.\n\n“Canelo, obviously. He’s a role model for me. I want my chance against him,” Topuria said. “I feel like I can beat him. If I get the chance to fight him, why not? Come on, [Saudi Arabian promoter] Turki [Alalshikh], give me the chance to win the title.”\n\nFor his part, Canelo responded respectfully when asked about Topuria but did not commit to a fight.\n\n“I haven’t seen him fight a full fight, but I like him a lot, I respect him, and I admire him. We’ll see. First things first, right now I’m focused on what’s in front of me,”\n\nThis article first appeared in Spanish via L.A. Times en Español.",
  "medium": "Article",
  "links": [
    "https://www.latimes.com/espanol/deportes/articulo/2025-07-27/el-campeon-de-ufc-ilia-topuria-clama-enfrentar-a-canelo-alvarez-vamos-turki-dame-la-oportunidad",
    "https://twitter.com/HappyPunch/status/1948028303375217116?ref_src=twsrc%5Etfw",
    "https://t.co/B8rNsP1fZ9",
    "https://www.latimes.com/sports/soccer/story/2025-08-11/want-to-attend-2026-world-cup-games-for-free-fifa-needs-65000-volunteers",
    "https://www.latimes.com/sports/dodgers/story/2025-08-11/dodgers-bullpen-struggles-trade-deadline",
    "https://www.latimes.com/sports/dodgers/story/2025-08-10/dodgers-blue-jays-sunday"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "UFC champion Ilia Topuria",
      "weight": 0.108051315
    },
    {
      "name": "Undefeated UFC lightweight champion Ilia Topuria",
      "weight": 0.1006444
    },
    {
      "name": "Ilia Topuria",
      "weight": 0.09670777
    },
    {
      "name": "Canelo Álvarez",
      "weight": 0.09627088
    },
    {
      "name": "Topuria",
      "weight": 0.08805331
    },
    {
      "name": "mixed martial arts",
      "weight": 0.075216904
    },
    {
      "name": "professional boxing",
      "weight": 0.073702894
    },
    {
      "name": "Canelo",
      "weight": 0.07284429
    },
    {
      "name": "UFC",
      "weight": 0.07163761
    },
    {
      "name": "Álvarez",
      "weight": 0.071556285
    }
  ],
  "topics": [
    {
      "name": "UFC"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.95361328125
    },
    {
      "name": "/Sports/Combat Sports/Martial Arts",
      "score": 0.482177734375
    }
  ],
  "sentiment": {
    "positive": 0.47973084,
    "negative": 0.15951708,
    "neutral": 0.36075208
  },
  "summary": "UFC lightweight champion Ilia Topuria has expressed his desire to cross into professional boxing and compete against the winner of the upcoming fight between Mexican superstar Saúl \"Canelo\" Álvarez and Terence Crawford. Topuria, who has been a role model and idol for years, hopes the UFC will allow him to follow in the footsteps of Conor McGregor, who fought and lost to Floyd Mayweather Jr. while under contract with the mixed martial arts promoter. He believes that this is the ideal opportunity to compete in professional boxing. Canelo responded but did not commit to a fight.",
  "shortSummary": "Undefeated UFC lightweight champion Ilia Topuria has called out Canelo Álvarez for a boxing fight, aiming to emulate Conor McGregor and win the title.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "8514189493bc4cafa6e0f4d0777c9f79",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.latimes.com/sports/dodgers/story/2025-08-10/dodgers-blue-jays-sunday",
      "text": "- Share via\nThe Toronto Blue Jays did everything possible to hand the Dodgers a victory Sunday.\nTheir pitchers gave up 10 hits, including two home runs. They walked 13, a season-high for the Dodgers, twice loading the bases on free passes in the final two innings. At the plate, Toronto struck out 14 times.\nThe Dodgers, however, refused to accept the gift, giving up an eighth-inning lead in a 5-4 loss that dropped their lead over the San Diego Padres in the National League West to two games. The Padres trailed by six games less than three weeks ago.\n“This is frustrating because I just felt there’s no way we should lose this game today,” Dodgers manager Dave Roberts said. “We had them on the ropes numerous times. And for us not to win is so frustrating.”\nIn his second start after missing four months with a shoulder injury, the Dodgers’ Blake Snell dominated Toronto, striking out 10 in five scoreless innings of a 9-1 win.\nHow frustrating? The Dodgers were one for 10 with runners in scoring position. They left a season-high 16 men on base — six in the last two innings.\nEvery Dodgers starter reached base at least once. Yet they still lost.\nAfterward, third baseman Max Muncy insisted the black cloud had a silver lining, even if no one else could see it.\n“We were creating opportunities. So, you know, we were doing the first part of it,” he said. “We just weren’t cashing in today. The positive you take out of it is we found a way to create a lot of opportunities.\n“You just have to finish the job.”\nThat goes double for the Dodger relievers. Starter Tyler Glasnow was brilliant, striking out eight and allowing just two runs over 5⅔ innings, turning a 3-2 lead over to a bullpen that had to get 10 outs. Once again they couldn’t do it, with Blake Treinen and Alex Vesia giving up three solo home runs in the span of six batters.\n“You give good hitters pitches right down the middle, they’re going to do damage,” said Treinen, who came on in the eighth with a one-run lead and left five batters later trailing after back-to-back home runs by Vladimir Guerrero Jr. and Addison Barger.\n“Sometimes we get away with making bad locations turn into outs. They made me pay for it and it cost us a game.”\nHe’s not the only one who had to pay. Because after Freddie Freeman walked with the bases loaded for the second time to tie the game in the eighth, Vesia came on to start the ninth with the score even again. Ernie Clement unevened it on Vesia’s first pitch, driving an 85-mph slider over the wall in left field to put Toronto ahead. It was the 65th homer Dodgers relievers have allowed this season; only two bullpens in the majors have given up more.\nBut the Blue Jays’ generosity knew no end, so Toronto tried to give the win back when reliever Jeff Hoffman loaded the bases with one out for Shohei Ohtani.\nBut after fouling off two tough full-count pitches from Mason Fluharty, a left-hander with a 5.15 earned-run average and Toronto’s eighth pitcher of the day, Ohtani waved at a sweeper outside the zone to strike out.\n“The last thing I was thinking was he was going to strike out. ... We’ve got to come up with one right there,” Roberts said. “Chasing the ball down below is something we can’t have happen.”\nMookie Betts followed by grounding into a force out to end the game.\nThree innings earlier Ohtani, who had two hits, including his 41st homer of the season to run his hitting streak to a season-best nine games, was thrown out trying to steal third with two outs and Freeman at the plate, ending another Dodger threat.\n“That was his decision,” Roberts said. “Not a good baseball play.”\nClayton Kershaw gives up seven hits and one earned run over six innings and Mookie Betts hits a two-run home run in the Dodgers’ 5-1 win over Toronto.\nNow the Dodgers head to Anaheim for a three-game series with the Angels before returning home to face the Padres, likely with the division lead at stake.\nThe Dodgers have been faltering since July 1, going 15-18. San Diego has been on fire, going 21-13 over the same span. Among NL teams, only the Milwaukee Brewers have been better.\nWhile San Diego has the most saves (39) and the best bullpen ERA in baseball (3.04), Dodgers relievers rank 21st (4.24).\nAnd while the Padres got better at last month’s trade deadline, making five trades that netted them reliever Mason Miller and left-hander JP Sears from Oakland, first baseman/outfielder Ryan O’Hearn and left fielder Ramón Laureano from the Orioles and catcher Freddy Fermin from the Royals, the Dodgers barely tinkered around the edges. Their major acquisition, reliever Brock Stewart, has given up six hits and two runs in 3⅔ innings.\nThe Padres went all in. The Dodgers did not.\nTalk about frustrating."
    },
    {
      "url": "https://www.latimes.com/sports/soccer/story/2025-08-11/want-to-attend-2026-world-cup-games-for-free-fifa-needs-65000-volunteers",
      "text": "Want to attend 2026 World Cup games for free? FIFA needs 65,000 volunteers\n- Share via\nThe pay is nonexistent, but the perk could be viewing games in the U.S., Mexico and Canada for free during the FIFA World Cup next summer.\nFIFA launched the application process for the World Cup volunteers Monday. How many are needed? A staggering 65,000 across the 16 cities that will host the expanded 48-team format over 39 days beginning June 11, the largest volunteer program FIFA has ever attempted.\n“Volunteers are the heart, soul and smile of FIFA tournaments,” FIFA president Gianni Infantino said. “They get to show off their local pride, gain a behind-the-scenes view of the tournament and make memories and friendships that can last a lifetime, while supporting a historic event.\n“We hope interested individuals will join us as we welcome the world to North America in 2026.”\nIn addition to stadiums, volunteers will provide support across at training sites, airports and hotels.\nWednesday marks one year out from the start of the 2026 World Cup. A look at where preparations stand.\nFIFA estimates 6.5 million fans will attend the World Cup, with 3.7 million attending games in the U.S., 1.5 million in Mexico and 1.3 million in Canada. The 2022 final with Lionel Messi leading Argentina past Kylian Mbappé and France, drew a record 1.42 billion viewers, including 26 million in the U.S.\n“The Super Bowl, which is fantastic, has what, 120-130 million viewers? The World Cup has 6 billion,” Infantino told Fox Sports in April. “A World Cup is 104 Super Bowls in one month.”\nVolunteers in the past ranged from students to seniors. No experience is required but applicants must be at least 18 years old. Interested individuals can apply at fifaworldcup.com/volunteers.\nThose whose applications are accepted will be invited to attend the Volunteer Team Tryouts, which are expected to begin in October. Training will take place in March 2026.\n‘Volunteers are the heartbeat of FIFA events and champions of their host city — sharing their pride and passion with fans from all corners of the globe, welcoming visitors to experience the unique culture of their host city and supporting the extraordinary event that is a FIFA World Cup,” FIFA said in a statement.\nThe FIFA Club World Cup exposed some significant issues that could hamper the 2026 World Cup, with hot weather being among the top concerns.\nLos Angeles is one of 11 U.S. host cities, with eight games scheduled at SoFi Stadium, including the U.S. team’s opener June 12. After playing its second match in Seattle on June 19, the U.S. will conclude group play at SoFi on June 25.\nIncluded in the games to be played in Inglewood are two round-of-32 games and a quarterfinal. Only one venue — AT&T Stadium in Arlington, Texas — was awarded more games with nine.\n“We’re happy with with how it turned out,” U.S. coach Gregg Berhalter said. “We look forward to being in L.A. [and] probably one of the best stadiums in the world and to get to play there twice in the group stage.”\nOther U.S. hosts cities include Seattle, Houston, Kansas City, Atlanta, Boston, New York/New Jersey, Philadelphia, Miami and the San Francisco Bay area. Games in Mexico and Canada will be held in Mexico City, Monterrey, Guadalajara, Toronto and Vancouver.\n“FIFA changed my life,” longtime volunteer Craig Collins said on a video. “Why do I want to volunteer again? I can give back to an organization that has provided for me without knowing it.\nCollins became the one-millionth person to join the FIFA volunteer community in April 2025.\n“I’m excited to apply for the 2026 volunteer program and hope to show off my community to the world once more.”"
    },
    {
      "url": "https://www.latimes.com/sports/dodgers/story/2025-08-11/dodgers-bullpen-struggles-trade-deadline",
      "text": "- Share via\nA lazy, lovely afternoon at Chavez Ravine was startled awake Sunday by three blue-curdling screams.\nThe Dodger bullpen had struck again.\nEighth inning, one out, Dodgers leading the Toronto Blue Jays by a run, rusty Blake Treinen on the mound.\nVladimir Guerrero Jr., boom, nooooo!\nAddison Barger, boom, nooooo!\nNinth inning, game tied, Alex Vesia on the mound acting like a closer because the Dodgers don’t have a healthy closer.\nErnie Clement, boom, not again!\nBattered by three home runs in the last two innings Sunday, the Dodgers lost a game they should have won, blew a game they should have had, and planted an ominous message deep into the bowels of sweaty Dodger Stadium.\nBlake Treinen and Alex Vesia gave up three homers in the span of six batters and Shohei Ohtani strikes out at a critical moment in a 5-4 loss to Toronto.\nThis is a team trying to win a second consecutive championship without an adequate bullpen.\nThe 5-4 loss wasted a sterling start by Tyler Glasnow, frittered away 10 hits and 13 walks from a burgeoning offense, ruined a chance to sweep the team with the best record in the American League, and created a trivia question that will be bandied about the league until the last week in October.\nWhat standout reliever did the Dodgers acquire at the trade deadline?\nNobody.\nWhat standout reliever had their critics been begging them to acquire for weeks?\nAny of them.\nMaybe Andrew Friedman’s previous deadline brilliance convinced everyone into thinking he could pull something off again, and maybe the public pressure was less than usual because of the credits earned by the 2024 title, but here’s guessing much of Dodger nation woke up Monday morning after watching a reliever tagged with the loss in three of the last six games and thought...\nWhat just happened? Is it too late to fix?\nWhat happened was the Dodgers’ belief in the recovering health of their bullpen. And, um, yeah, unless you want to bring Bobby Miller up from Oklahoma City to close games (not a bad idea, eh?), it’s not getting fixed anytime soon.\nMichael Kopech, Tanner Scott and Kirby Yates should all be returning from the injured list, and the thought is that the Dodgers can find a closer somewhere in there, but you’ve seen them all and do you agree?\nThere is also the belief in this weird bit of Dodger closer history — the final inning in their last two championships was worked by a starter.\nThis is countered by the fact that the last two times Friedman didn’t make a significant pitching upgrade at the deadline they were eliminated in the first round.\nSo, yes, Friedman hasn’t lost any of his smarts and Dave Roberts hasn’t lost any of his savvy and they can probably piece this mess together for short periods in October.\nBut between now and then, you need someone to make the big pitch in the clutch situation and save the offense from itself.\nYou need a closer so you don’t have the eternal optimist Roberts looking oddly despondent late Sunday afternoon.\n“This is frustrating because I just felt there is no way we should lose this game today,” he said.\nHe wasn’t so upset with Vesia and Treinen — both guys have been put in tough spots, especially Treinen, who recently came off the injured list.\nHe was mostly upset with the Dodger offense that made the withering bullpen — which has recorded the most innings in baseball — so necessary.\nThe Dodgers had a 3-2 lead after six innings. The back-to-back dingers in the eighth cost them that lead.\nThe Dodgers came back to tie it on a bases-loaded walk to Freddie Freeman in the eighth.\nClement’s long ball grabbed the lead again for the Blue Jays in the ninth.\n“Yeah, it’s pretty frustrating,” Vesia said.\nBut equally frustrating was the 16 men the Dodgers left on base, including leaving the bases loaded three times, twice in the last two innings.\n“We had them on the ropes numerous times,” Roberts said. “And for us not to win is so frustrating.”\nIn his second start after missing four months with a shoulder injury, the Dodgers’ Blake Snell dominated Toronto, striking out 10 in five scoreless innings of a 9-1 win.\nHow disappointed was Roberts? When is the last time you’ve heard him criticize Shohei Ohtani’s play? Well, he did it Sunday, twice in a span of a minute.\nFirst, there was Ohtani ending the sixth inning by getting thrown out attempting to steal third base with Freeman at the plate.\n“Not a good baseball play,” Roberts said.\nThen there was Ohtani striking out with a wild swing on a low and outside full-count pitch from Mason Fluharty — he of the 5.15 ERA — with bases loaded in the ninth.\n“We’ve got to come up with one right there,” Roberts said. “Chasing the ball down below ... is something that we can’t have.”\nYou know what could have prevented all this angst? A deeper bullpen. A more rested bullpen. A fixed bullpen."
    },
    {
      "url": "https://www.latimes.com/espanol/deportes/articulo/2025-07-27/el-campeon-de-ufc-ilia-topuria-clama-enfrentar-a-canelo-alvarez-vamos-turki-dame-la-oportunidad",
      "text": "El campeón de UFC, Ilia Topuria, clama enfrentar a Canelo Álvarez: Vamos, Turki, dame la oportunidad\nEl hispano-georgiano quiere seguir los pasos de Conor McGregor y boxear contra su ídolo Canelo Álvarez, quien enfrentará a Terence Crawford en septiembre en Las Vegas.\n- Share via\nEl campeón invicto de peso ligero de UFC, Ilia Topuria, volvió a manifestar su deseo de cruzar al boxeo profesional y enfrentar al ganador de la próxima pelea entre la superestrella mexicana Saúl Álvarez y Terence Crawford.\nTopuria aseguró que su objetivo es medirse con Canelo, a quien considera una referencia y un ídolo desde hace años. El peleador hispano-georgiano desea que UFC le permita seguir los pasos de Conor McGregor, quien peleó y cayó contra Floyd Mayweather Jr. en agosto de 2017 mientras estaba bajo contrato con la promotora de artes marciales mixtas.\nTopuria declaró que se siente preparado para competir en el ring y que esta es la oportunidad ideal para hacerlo.\n“¿Por qué no conmigo? Me encantaría boxear contra el ganador de Canelo y Crawford. Pero si pudiera escoger, quiero a Canelo. Fue mi ídolo por muchos años y siento que puedo lograrlo”, dijo Topuria según varios reportes. “Vamos a hacerlo, ahora es el mejor momento”.\nTopuria, que recientemente noqueó a Charles Oliveira en junio para ganar su segundo cinturón de UFC, atraviesa el mejor momento de su carrera. Ha vencido por nocaut a figuras como Max Holloway y Alexander Volkanovski, lo que lo ha consolidado como una de las estrellas más grandes de las artes marciales mixtas. Sin embargo, ahora apunta al boxeo y quiere demostrar que también puede destacar sobre el cuadrilátero.\nSu pronóstico sobre el combate entre Canelo y Crawford, que se celebrará el 13 de septiembre en Las Vegas, ve como ganador al mexicano.\n“Canelo, obviamente. Él es una referencia para mí. Quiero mi oportunidad contra él”, comentó Topuria. “Siento que puedo vencerlo. Si tengo la oportunidad de pelear con él, ¿por qué no? Vamos, Turki [Alalshikh], dame la oportunidad de ganar el título”.\nEl georgiano español Ilia Topuria subió a peso ligero el sábado y venció a Charles Oliviera (35-11, 1 NC) para capturar el campeonato interino de esa división de UFC y lograr así su segundo cinturón en diferentes pesos en el T-Mobile Arena de Las Vegas, Nevada.\nPor su parte, Canelo respondió con respeto al ser consultado sobre Topuria. Aunque no se comprometió con una posible pelea, dejó clara su admiración por el campeón de UFC.\n“No lo he visto pelear una pelea completa, pero me cae muy bien, lo respeto y lo admiro. Vamos a ver. Primero lo primero, ahora estoy enfocado en lo que tengo enfrente”, dijo el boxeador en una de sus conferencias de promoción para su pelea contra Crawford."
    }
  ],
  "argos_summary": "UFC lightweight champion Ilia Topuria has expressed his ambition to transition to professional boxing, aiming to fight the winner of the upcoming match between Canelo Álvarez and Terence Crawford. Topuria, who considers Canelo his idol, feels ready to compete in the boxing ring and hopes to follow in the footsteps of Conor McGregor. He predicts Canelo will win the fight and is eager for the opportunity to challenge him, while Canelo has acknowledged Topuria's talent but remains focused on his current fight.",
  "argos_id": "FA7K1FSUK"
}