{
  "url": "https://www.newsweek.com/milwaukee-floods-wisconsin-rain-travel-warning-state-emergency-2111971",
  "authorsByline": "Anna Skinner",
  "articleId": "ade15e09b475467db6c4829bf900ed6b",
  "source": {
    "domain": "newsweek.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://d.newsweek.com/en/full/2700636/milwaukee-floods-state-emergency.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T17:48:45-04:00",
  "addDate": "2025-08-11T22:28:35.370136+00:00",
  "refreshDate": "2025-08-11T22:28:35.370138+00:00",
  "score": 1.0,
  "title": "Nearly 200,000 warned to avoid travel as emergency declared",
  "description": "Several rivers remain flooded in the Milwaukee area after heavy rain battered Wisconsin over the weekend.",
  "content": "Based on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nNearly 200,000 people on Monday remained under flood warnings in the aftermath of torrential rainfall that dropped more than a foot on Milwaukee and its environs, prompting officials to issue a state of emergency over the weekend and caution motorists against traveling.\n\nThe heavy rains in Wisconsin come as meteorologists have warned that climate change has contributed to the prevalence of 100-year and 1,000-year floods across the U.S. in recent years. As the atmosphere warms, it gains the ability to hold more moisture, which in turn can fuel heavy rains when storms roll into the area.\n\nThe floods in Wisconsin caused officials to cancel the last day of the Wisconsin State Fair. On Sunday, Milwaukee County declared a state of emergency and cautioned residents against driving or walking through flooded areas.\n\nWhat To Know\n\nAs of Monday afternoon, numerous rivers were still flooding, according to warnings issued across the Badger State by National Weather Service (NWS) meteorologists.\n\nThese include the following rivers:\n\nNone of the rivers had reached major flood levels, though the Fox River Lower at Waukesha was experiencing moderate flooding. The others saw minor issues.\n\nFlooding is the second deadliest weather hazard in the U.S. behind extreme heat. Most flood deaths occur in vehicles, prompting NWS officials to urge people against driving through flooded roadways.\n\n\"Turn around, don't drown when encountering flooded roads. Most flood\n\n deaths occur in vehicles,\" NWS Milwaukee said in one flood warning. \"Caution is urged when walking near riverbanks. Motorists should not attempt to drive around barricades or drive cars through flooded areas.\"\n\nMost of the rain has stopped, but NWS meteorologist JJ Wood told Newsweek there is a 40 percent to 50 percent chance for showers and storms overnight Monday, and a 30 percent to 40 percent chance of additional rain Tuesday afternoon.\n\n\"Any storms that do move through the area, we are expecting them to move through at a fairly decent rate,\" he said. \"We are not expecting big, flash flooding impacts like we've seen over the weekend.\"\n\nWhat People Are Saying\n\nMilwaukee County Executive David Crowley, in a news release: \"Flooding is still an active emergency situation across Milwaukee County, and we are expecting more rain today and into this evening. Our top priority is the life and safety of Milwaukee County residents. I strongly urge our residents to stay cautious, stay informed, and refrain from traveling. Check in on your neighbors and loved ones, especially older adults, and seek out emergency assistance if needed. I am thankful to our first responders, law enforcement partners, social services workers, and neighbors who are lending a helping hand during a challenging time. We will get through this together, Milwaukee.\"\n\nNWS Milwaukee, in a flood warning: \"Be especially cautious at night when it is harder to recognize the dangers of flooding.\"\n\nSome of the flood warnings are set to expire by early Wednesday afternoon, whereas others will remain in place until further notice, as it can take time for flooded river levels to recede. Wood said it will be dry for the next several days after Tuesday, which carries the chance of rain.",
  "medium": "Article",
  "links": [
    "https://www.newsweek.com/wisconsin-state-fair-canceled-floods-leave-thousands-without-power-2111517",
    "https://www.newsweek.com/100-year-flood-map-deadly-storms-global-warming-2103633",
    "https://www.newsweek.com/topic/fox",
    "https://www.newsweek.com/texas-flooding-harris-kerr-guadalupe-river-weather-warning-2094777"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "flood warnings",
      "weight": 0.08823154
    },
    {
      "name": "NWS Milwaukee",
      "weight": 0.085937425
    },
    {
      "name": "Milwaukee County residents",
      "weight": 0.08546944
    },
    {
      "name": "Milwaukee County",
      "weight": 0.08371115
    },
    {
      "name": "flooded river levels",
      "weight": 0.0797569
    },
    {
      "name": "major flood levels",
      "weight": 0.07798308
    },
    {
      "name": "Milwaukee County Executive David Crowley",
      "weight": 0.077761315
    },
    {
      "name": "Most flood deaths",
      "weight": 0.07682161
    },
    {
      "name": "Most flood",
      "weight": 0.076372854
    },
    {
      "name": "more rain",
      "weight": 0.07429134
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Weather"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Weather",
      "score": 0.98193359375
    },
    {
      "name": "/News/Local News",
      "score": 0.9716796875
    },
    {
      "name": "/Sensitive Subjects/Accidents & Disasters",
      "score": 0.96533203125
    }
  ],
  "sentiment": {
    "positive": 0.058681775,
    "negative": 0.7279233,
    "neutral": 0.21339498
  },
  "summary": "The National Weather Service (NWS) has issued flood warnings in Wisconsin following heavy rainfall that left more than a foot on Milwaukee and its surrounding areas. Nearly 200,000 people remained under flood warnings following the weekend's heavy rainfall, which led to the declaration of a state of emergency and the cancellation of the Wisconsin State Fair. Meteorologists have warned that climate change has contributed to the prevalence of 100-year and 1,000-year floods across the US. As of Monday afternoon, numerous rivers were still flooding, with no major major flood levels reported. The National Weather Services ( NWS) warned that motorists should not attempt to drive through flooded roadways or walk through flooded areas. Some flood warnings are set to expire by early Wednesday afternoon, but others will remain in place until further notice.",
  "shortSummary": "Nearly 200,000 people in Wisconsin remain under flood warnings after heavy rains caused a state of emergency, highlighting the dangers of driving through flooded areas.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "4a8e2abb8c964019be3a8df85f951971",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.newsweek.com/100-year-flood-map-deadly-storms-global-warming-2103633",
      "text": "🎙️ Voice is AI-generated. Inconsistencies may occur.\nThe term \"100-year flood\" implies that the event is a rare occurrence; however, dozens of such storms have inundated the United States over the past year alone, prompting concern that they are occurring more frequently as the Earth's climate continues to warm.\nWhy It Matters\nFlooding is the second-deadliest weather hazard in the U.S., next to extreme heat. Devastating flood events have made headlines numerous times this year, including a 1,000-year atmospheric river event that hit the Midwest and South in April and the deadly floods that inundated Central Texas over the July 4th weekend.\nThe frequency of such flooding rainstorms, which often go hand-in-hand with death and destruction, is alarming. What's even more concerning is that AccuWeather meteorologist Alex DaSilva told Newsweek that these events are happening more frequently.\nWhat To Know\nIn 2024, dozens of 100-year rainstorms struck the U.S. Each point is marked on the map below, created by Colorado State University. The points marking each event are widespread, with only a few states escaping unscathed.\nLast year wasn't a one-time occurrence, either. This year is also \"shaping up to be one of the most flood-impacted summers on record in the United States,\" AccuWeather reported.\nWhat Is a 100-Year Flood?\nThe United States Geological Service (USGS) describes the term \"100-year flood\" as an attempt \"to simplify the definition of a flood that statistically has a 1-percent chance of occurring in any given year.\"\nWhere Did 100-Year Rainstorms Hit in 2024?\nOn the CSU map, countless points pepper the Eastern Seaboard around North Carolina and South Carolina after Hurricane Helene struck in September. Others show the devastating impact of the summer monsoon season in New Mexico, which caused deserts to flood and cars to become stranded as water washed over a highway. Vermont faced catastrophic floods in late July.\nCentral Texas, known as Flash Flood Alley, experienced several 100-year rainstorms last year, as did Florida, with a scattershot of points dated as occurring during the Atlantic hurricane season.\nThere was also an onslaught of precipitation that hit South Dakota in June 2024, as well as a similar storm that measured as a 100-year event at several locations in Missouri in November, among others.\nOnly a few states emerged unscathed, including Iowa, Wisconsin, Oregon, Washington, and Massachusetts, but most of the U.S. experienced some form of severe flooding precipitation last year.\nWhy Are 100-Year Floods Occurring More Frequently?\nThe map's creator, Russ Schumacher, a professor of atmospheric sciences at CSU and a CSU climatologist, told Newsweek that improved technology, such as radar, provides better access to data, which can make it seem as if the flood events are happening more frequently. However, he also stressed the impact of climate change.\n\"The physics of climate change tells us that we should see these extreme events more frequently,\" he said.\nAs the atmosphere grows warmer through global warming, its ability to hold moisture increases, DaSilva told Newsweek.\n\"This is why in the wintertime, we typically don't see too much flash flooding in the wintertime,\" DaSilva said. \"It's too cold, and there's snow, of course, but it's hard to get the moisture content you need for heavy rain events in the wintertime because it's cooler out. In the summertime obviously the temperature is above freezing, but the atmosphere can hold more water content. There's more moisture to squeeze out.\"\nWhich States Have Increased Flood Risk?\nAs the atmosphere's ability to hold moisture increases, DaSilva told Newsweek that states in the Ohio and Tennessee valleys are becoming wetter, while areas like California are becoming drier.\nWhat People Are Saying\nAccuWeather meteorologist Alex DaSilva told Newsweek: \"When the atmosphere is getting warmer as a whole...essentially what it's doing is making summer warmer and the shoulder seasons warmer as well. What's happening is those seasons, especially in the summertime, the [atmosphere's] ability to hold more moisture is going up as well.\"\nDaSilva added: \"It doesn't guarantee we will see more rain over a certain area, but...when it rains, it's going to rain heavier.\"\nThe USGS in a webpage about 100-year flood events: \"In other words, over the course of 1 million years, these events would be expected to occur 10,000 times. But, just because it rained 10 inches in one day last year doesn't mean it can't rain 10 inches in one day again this year.\"\nWhat Happens Next\nAs the probability of heavy rain events increases, people are advised to have a flood plan in place before such an event occurs in their area. People should also never drive on a flooded roadway, as most flood-related deaths occur in vehicles.\nIs This Article Trustworthy?\nIs This Article Trustworthy?\nNewsweek is committed to journalism that is factual and fair\nWe value your input and encourage you to rate this article.\nNewsweek is committed to journalism that is factual and fair\nWe value your input and encourage you to rate this article.\nAbout the writer\nAnna Skinner is a Newsweek senior reporter based in Indianapolis. Her focus is reporting on the climate, environment and weather ... Read more"
    },
    {
      "url": "https://www.newsweek.com/texas-flooding-harris-kerr-guadalupe-river-weather-warning-2094777",
      "text": "🎙️ Voice is AI-generated. Inconsistencies may occur.\n\"Catastrophic\" flash flooding along the Guadalupe River in Texas from Hunt downstream to Comfort has caused at least 13 deaths, authorities said.\n\"Move to high ground immediately!\" warned Jeff Lindner, a meteorologist and director of Harris County Flood Control District flood operations and forecasting, in a post on X. \"This is a life threatening flash flood situation.\"\nEarlier in the day, Kerr County Sheriff's Office confirmed there had been fatalities but said it would not release more information until the next of kin are notified.\n\"Our Office is working with a wide variety of local and state agencies to respond to calls and rescues,\" the sheriff's office said in a statement on its Facebook page.\n\"The entire county is an extremely active scene. Residents are encouraged to shelter in place and not attempt travel. Those near creeks, streams, and the Guadalupe River should immediately move to higher ground.\"\nNewsweek reached out to the Kerr County Sheriff's Office by phone for comment.\nCamp Mystic Water Rescues\nCamp Mystic, a summer camp for girls, was included in the flood region and water rescues were necessary in the area. Twenty-three girls from the camp are still unaccounted for.\n\"BREAKING: 23 girls from Camp Mystic are unaccounted for after the Kerrville flooding, Texas Lt. Governor Dan Patrick said in a press conference,\" Keenan posted. \"We are praying they're found safe.\"\nRain To Continue on Friday\nA Friday morning forecast from the National Weather Service (NWS) attributed the excessive moisture to remnants of Tropical Storm Barry, which formed in the Gulf over the weekend.\n\"The heavy rain threat is forecast to largely diminish by later today,\" the forecast said.\nHowever, as much as 15 inches of rain was reported in some areas of Central Texas, NWS meteorologist James Wingenroth told Newsweek.\nIn San Angelo, official reports were more than 3.5 inches, which is three times the average amount for the entire month of July. Average rainfall throughout July in San Angelo is 1.1 inches.\nThis weather map from Windy.com shows the situation across the affected area.\n\"Heavy rainfall is pivoting south into Kerr and Gillespie Counties,\" said the NWS office for Austin/San Antonio.\n\"Another 2-4 inches of rain possible in these areas. Flash Flood EMERGENCIES are in effect for Kerr County. Avoid travel through this area. Elsewhere, light to moderate rainfall ongoing for portions I-35 corridor.\"\nGuadalupe River Flooding\nRiver water level data from the National Water Center shows that the Guadalupe River surged 25 feet in only 45 minutes this morning. Forecasts anticipate the levels will drop quickly and return to below action stage by the early morning hours on Saturday.\nThe San Saba River near San Saba, Texas, is nearing 18 feet, which is still below action stage, and still rising. Forecasts anticipate the river will keep rising until it peaks at more than 32 feet, which is considered major flood stage. The highest water levels are expected to occur on Saturday morning. The river will remain flooded throughout the weekend.\nEvacuations were ordered in some of the hardest-hit areas.\n\"MANDATORY EVACUATIONS underway for areas near the Guadalupe River in COMFORT, TEXAS in Kendall county,\" CBS Austin meteorologist Avery Tomasco posted on X. \"The destructive flooding in Kerrville is moving quickly downstream. Quickly rising waters likely over the next 4 hours in Comfort. Get to higher ground!\"\nOn Friday afternoon, Tomasco warned that the Llano River was also expected to reach moderate flood stage after the river rose 12 feet in 30 minutes.\nFamilies 'Swept Away'\nAn unidentified man who spoke to News 4 San Antonio said his brother's home was no longer there after the flooding, apparently swept away. He said his brother, sister-in-law, and their two children were all missing.\nFloodwaters \"swept away\" an RV park in Ingram, Texas, with families reportedly still in their RVs, according to a post on X from Tomasco.\n\"New info out of Ingram, TX is hard to stomach,\" Tomasco posted with the video. \"This is video from the back of Howdy's Bar and Chill restaurant. There is usually a large RV park here, closer to the Guadalupe River. It was all swept away with families reportedly still in their campers.\"\nUpdates 7/4/25, 11:20 a.m. and 1:58 p.m. and 4:41 p.m. ET: This article was updated with additional information.\nAbout the writer\nAnna Skinner is a Newsweek senior reporter based in Indianapolis. Her focus is reporting on the climate, environment and weather ... Read more"
    },
    {
      "url": "https://www.newsweek.com/topic/fox",
      "text": "Sixteen-foot python discovered in Los Angeles dumpster—\"Pure muscle\"\n\"This was definitely someone's pet animal, which makes a pretty tragic story,\" reptile handler Joseph Hart said.\nLos Angeles Labubu heist: What to know\nMasked thieves stole $7,000 worth of trendy Labubu collectible dolls from a Los Angeles-area toy store using a stolen vehicle.\nRacing\nHow to Watch General Tire 100 at The Glen: Live Stream ARCA Menards Series\nThe ARCA Menards Series heads to Watkins Glen Friday for the General Tire 100, with rookie Brenden Queen chasing his sixth win and extending his points lead.\nMarjorie Taylor Greene hits back after \"IQ of a snail\" jibe\nThe GOP congresswoman said Fox News host Mark Levin is \"Israel first\" rather than \"America first.\"\nFox News discusses Sydney Sweeney marrying Barron Trump\nHost Jesse Watters made a playful statement about the actress and President Donald Trump's son.\nSports\nHow to Watch Eberlein Drive vs AfterShocks: Live Stream TBT Championship\nThe Basketball Tournament 2025 wraps Sunday with Eberlein Drive vs. AfterShocks in a $1M championship showdown you won't want to miss.\nSenate confirms ex-Fox News host Jeanine Pirro as DC prosecutor\nThe Senate confirmed the former tv host 50-45 as D.C.'s top federal prosecutor after Trump withdrew his first pick.\nKamala Harris' new book gets brutal reception\nHarris announced that she is publishing a book amid speculation she could run for the presidency again in 2028.\nSports\nHow to Watch Eberlein Drive vs Sideline Cancer: Live Stream TBT\nEberlein Drive and Sideline Cancer meet in the TBT quarterfinals on Monday night, with a spot in The Basketball Tournament Final Four up for grabs.\nDonald Trump's approval rating with women reverses course\nThe proportion of women who approve of the President has declined.\nTrump gets silver lining in new poll as more voters approve of economy\nA Fox poll shows respondents disapprove of the job the president is doing and dislike his new budget law but ratings of the economy show signs of improvement.\nAnd Now It's The Wall Street Journal's Turn To Tango With Trump | Opinion\nThe Wall Street Journal had the effrontery to publish a piece painful to President Donald Trump—painful because the truth hurts.\nSports\nHow to Watch Blackburn Rovers vs Everton FC: Live Stream Men's Friendly\nBlackburn Rovers and Everton FC face off on Saturday in a men's international club friendly. Catch all the action live on FOX Deportes.\nSean Hannity praises Trump on air hours after the president sues his boss\nSean Hannity's effusive praise of Trump was outmatched by his deafening silence on the lawsuit Trump had just filed against Hannity's boss.\n'We've been played': MAGA faces its own disappointment with Trump\nFor years, Trump's base thrived on promises to expose secret government plots and powerful cabals of pedophiles. What happens when he fails to deliver?\nDonald Trump responds to Iran Mar-a-Lago assassination \"threat\"\nLarijani's remarks, even if intended as a joke, will add to speculation over possible retaliation by Iran for the U.S. attacks.\nLara Trump teases potential Senate run in 2026\nHer remarks come after Thom Tillis, who voted against advancing President Donald Trump's spending bill, said he wasn't running.\nTrump to announce \"wealthy\" TikTok buyer group in two weeks\nThe president announced on Sunday that a \"wealthy group\" wants to buy TikTok and promised to reveal their identity within two weeks.\nRacing\nHow to Watch Summit Racing Equipment Nationals: Live Stream NHRA, TV\nThe NHRA season will continue on Sunday when the world's top drag racers gather for the Summit Racing Equipment Nationals at Summit Motorsports Park.\nFox News reacts to Newsom's $787M lawsuit over Trump call coverage\nThe California Governor is taking legal action over its reporting of the phone call he had with President Donald Trump earlier this month.\nRFK Jr. says \"more cavities\" due to no fluoride in water is \"a balance\"\nFlorida is the latest state to restrict fluoride additives in public drinking water, after Gov. DeSantis signed the bill into law.\nPete Hegseth trashing former Fox News colleague sparks fury from critics\nSecretary of Defense Pete Hegseth has been called out by journalists and critics over his response to former Fox News colleague Jennifer Griffin.\nPete Hegseth trashes former Fox News colleague to her face during briefing\nHegseth chastised the media during his Pentagon briefing about the Iran strikes.\nIs Donald Trump considering tactical nukes against Iran? What we know\nThe U.S. hasn't ruled out using a tactical nuke against one of Iran's nuclear sites, according to Fox News.\nDonald Trump slams Fox News over his approval ratings—'Why MAGA HATES'\nThe president took to his social media platform, Truth Social, to react to an unfavorable Fox News poll.\nFox News poll spells bad news for Donald Trump's \"Big, Beautiful Bill\"\nLess than half of Republicans believe the legislation will benefit their families, according to the poll.\nMark Levin calls for regime change in Iran as MAGA Israel fissure grows\nFox News host Mark Levin calls for regime change as Israel strikes Iran, exposing deep foreign policy divide within Trump's MAGA circle.\nFox reporters in Tel Aviv capture missile strikes live: \"Everyone move now\"\nTrey Yingst and his colleagues ran for cover during a live broadcast from Israel.\nTucker Carlson blasts former Fox News colleague Sean Hannity: \"Warmongers\"\nCarlson blasted Hannity and other conservative hawks as \"warmongers\" for lauding Israel's attack of Iran.\nMan tries to film \"cute\" bunny video, horror at what he actually captured\nTikTok viewers saw the harsh reality of Mother Nature unfold."
    },
    {
      "url": "https://www.newsweek.com/wisconsin-state-fair-canceled-floods-leave-thousands-without-power-2111517",
      "text": "🎙️ Voice is AI-generated. Inconsistencies may occur.\nThe Wisconsin State Fair has been canceled for its final day as severe flooding devastated the Milwaukee area, leaving nearly 18,000 residents without power and forcing motorists to abandon their vehicles on flooded roadways.\nFair organizers announced Sunday they were scrapping the conclusion of the popular 11-day event after heavy rains flooded the fairgrounds in West Allis, just outside Milwaukee.\nWhy It Matters\nThe National Weather Service (NWS) issued flood watches and warnings across six Midwest states, including Kansas, Iowa, Nebraska, Missouri, Illinois, and Wisconsin. Milwaukee bore the brunt of the storm system, with some areas receiving up to 14 inches of rainfall by Sunday evening.\nThe flooding has created cascading impacts across transportation, utilities, and public safety systems.\nWhat To Know\nMilwaukee area emergency responders have been overwhelmed by the crisis. The Milwaukee Fire Department reported responding to over 600 calls, including gas leaks, flooded basements, electrical outages, and water rescues. We Energies confirmed nearly 18,000 customers remained without power late Sunday across southeast Wisconsin.\nThe flooding forced the cancellation of USA Triathlon's Sprint and Paratriathlon National Championships in Milwaukee, where thousands of athletes were expected to participate. Even the Milwaukee Brewers' game at American Family Field proceeded despite an inaccessible parking lot.\nRiver flooding has been reported in Milwaukee and Waukesha counties, with the Menomonee River overflowing and submerging a popular playground in suburban Wauwatosa. The Red Cross opened two emergency shelters for displaced residents.\nWeather forecasters predict continued challenges, with \"repeated rounds of heavy rain\" expected through Monday, along with potential hail, damaging winds, and isolated tornadoes.\nWhat People Are Saying\nWisconsin State Fair Organizers said in a statement: \"We are saddened we cannot deliver this final day of the Wisconsin State Fair but know that this is the best decision with current conditions and the forecast ahead.\"\nNational Weather Service Meteorologist Andrew Quigley told the Associated Press: \"Really unfortunately, it's just a really bad overlap of circumstances in terms of how all this rain fell but then fell over such a populated area.\"\nMilwaukee Fire Department Chief Aaron Lipski told reporters on Sunday: \"We're still in the middle of it. We're still catching up right now.\"\nWhat Happens Next?\nEmergency crews continue working to clear surface water and respond to ongoing rescue calls throughout southeastern Wisconsin. The NWS maintains flood warnings through Monday as additional rainfall is expected.\nFair organizers will assess damage to the West Allis fairgrounds to determine cleanup timelines and preparation for next year's event. Utility crews from We Energies are working to restore power to the thousands of affected customers, though restoration timelines remain unclear given ongoing weather conditions.\nCity officials continue urging residents to avoid driving or walking through standing water as conditions remain dangerous. The full extent of infrastructure damage and economic impact from the flooding will likely take days to assess as waters recede.\nReporting from the Associated Press contributed to this article.\nAbout the writer\nAdeola Adeosun is the Newsweek Weekend Night Editor based in Atlanta, Georgia. Her focus is reporting on U.S. national news, ... Read more"
    }
  ],
  "argos_summary": "Severe flooding in Milwaukee, Wisconsin, has left nearly 200,000 people under flood warnings and prompted a state of emergency, with over 18,000 residents without power. The torrential rains, attributed to climate change, have caused significant disruptions, including the cancellation of the final day of the Wisconsin State Fair and numerous emergency calls for rescues and utility issues. Meteorologists warn of continued rain and flooding risks, urging residents to avoid flooded areas as emergency crews work to manage the crisis.",
  "argos_id": "FSLYV61ZR"
}