{
  "url": "https://nypost.com/2025/08/11/lifestyle/worlds-ugliest-dog-2025-winner-is-a-bulldog-named-petunia/",
  "authorsByline": "Brooke Steinberg",
  "articleId": "1630f17259d1481898a8206ad46e24a1",
  "source": {
    "domain": "nypost.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://nypost.com/wp-content/uploads/sites/2/2025/08/109473890.jpg?quality=75&strip=all&w=1024",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T19:35:57+00:00",
  "addDate": "2025-08-11T21:03:51.261541+00:00",
  "refreshDate": "2025-08-11T21:03:51.261543+00:00",
  "score": 1.0,
  "title": "World’s ugliest dog crowned — see why a ‘gentle soul’ bulldog named Petunia was tops: ‘Unique beauty’",
  "description": "This dog is a little ruff around the edges.",
  "content": "This dog is a little ruff around the edges.\n\nA hairless English-French bulldog mix was crowned as the winner of the 2025 “World’s Ugliest Dog” contest.\n\nThe 2-year-old pup named Petunia and her owner, Shannon Nyman, walked away with the top prize at the Sonoma County Fair event in Santa Rosa, California, on Aug. 8.\n\nPetunia won the $5,000 grand prize, beating out 10 other unconventional canines, including an 8-year-old Chinese Crested named Little Prince Wonder and a 13-year-old chihuahua named Nezumi.\n\nIn addition to the cash prize, Petunia will also be featured on limited-edition cans of Mug Root Beer, one of the sponsors of the canine event, and will appear on the “TODAY” show on Aug. 11, the New York Times reported.\n\n“I think she’s feeling great,” Nyman said on TODAY. “She loves all the attention, she loves all the affection, all the humans petting her.”\n\nPetunia’s personality is described as a “gentle soul who adores other dogs, cats and people,” according to the Times.\n\nAnd her looks are described as “… a mix between Yoda, she’s a mix between a hippo, a bat — she’s got it all,” NBC News correspondent Gadi Schwartz said on TODAY.\n\nThe pooch was rescued from “the chaos of a backyard breeder and order” in Las Vegas before being moved to Oregon by Luvable Dog Rescue.\n\nOnce in Oregon, Petunia got the medical care she badly needed, including a spay and a surgery to correct an elongated palate, which makes breathing difficult and painful.\n\nPetunia sadly doesn’t have any hair because of her original breeder’s unethical practices.\n\nThe World’s Ugliest Dog Contest has been going on for nearly 50 years and “celebrates the imperfections that make all dogs special and unique,” according to the event’s website.\n\n“The annual World’s Ugliest Dog Contest is not about making fun of ‘ugly’ dogs, but having fun with some wonderful characters and showing the world that these dogs are really beautiful!” the site said.\n\nMany of the dogs entered in the contest have been rescued from shelters and puppy mills, the organizers said.\n\n“The contest speaks to the importance of advocating for the adoration of all animals and the benefits of adopting.”\n\nIn this competition, the unique features of some pups, such as wild fur, missing teeth, dangling tongues and wandering eyes are badges of honor to wear proudly.\n\nIn 2024, the top spot went to Wild Thang, an 8-year-old Pekingese with a dangling tongue, who had been competing for five years before running away with the crown.\n\nWild Thang survived distemper as a puppy and his teeth didn’t grow in properly, which caused his silly tongue — a feature he was known and loved for. One of his front legs also constantly paddles around.",
  "medium": "Article",
  "links": [
    "http://nytimes.com/2025/08/09/us/worlds-ugliest-dog-2025-winner.html",
    "https://nypost.com/2025/08/11/lifestyle/dear-abby-my-sister-blames-me-for-her-daughter-moving-away/",
    "https://nypost.com/2024/06/22/us-news/pekingese-dubbed-wild-thang-wins-worlds-ugliest-dog-contest/",
    "https://www.today.com/pets/petunia-worlds-ugliest-dog-contest-winner-rcna224239",
    "https://nypost.com/2025/08/11/lifestyle/preppers-reveal-15-essential-items-for-a-doomsday-bunker/",
    "https://www.sonoma-marinfair.org/worlds-ugliest-dog/",
    "https://nypost.com/2025/08/11/lifestyle/easyjet-pilot-suspended-after-going-on-nude-drunken-rampage/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "other dogs",
      "weight": 0.08263674
    },
    {
      "name": "Petunia",
      "weight": 0.06916664
    },
    {
      "name": "dangling tongues",
      "weight": 0.066418245
    },
    {
      "name": "Luvable Dog Rescue",
      "weight": 0.0583856
    },
    {
      "name": "NBC News correspondent Gadi Schwartz",
      "weight": 0.05637441
    },
    {
      "name": "missing teeth",
      "weight": 0.053229768
    },
    {
      "name": "puppy mills",
      "weight": 0.052969463
    },
    {
      "name": "Wild Thang",
      "weight": 0.052684177
    },
    {
      "name": "Mug Root Beer",
      "weight": 0.052495033
    },
    {
      "name": "Shannon Nyman",
      "weight": 0.05196178
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Lifestyle"
    }
  ],
  "taxonomies": [
    {
      "name": "/Hobbies & Leisure/Merit Prizes & Contests",
      "score": 0.69287109375
    },
    {
      "name": "/Pets & Animals/Pets/Dogs",
      "score": 0.489990234375
    },
    {
      "name": "/Pets & Animals/Animal Products & Services/Animal Welfare",
      "score": 0.35693359375
    },
    {
      "name": "/News/Local News",
      "score": 0.305908203125
    }
  ],
  "sentiment": {
    "positive": 0.28912547,
    "negative": 0.28607118,
    "neutral": 0.42480335
  },
  "summary": "A hairless English-French bulldog mix named Petunia was crowned the 2025 \"World's Ugliest Dog\" at the Sonoma County Fair event in Santa Rosa, California. Petunia won the $5,000 grand prize, beating out 10 other unconventional canines including an 8-year-old Chinese Crested named Little Prince Wonder and a 13-year old chihuahua named Nezumi. In addition to the cash prize, Petunia will be featured on limited-edition cans of Mug Root Beer and will appear on the “TODAY show on August 11. The World’s Ugliest Dogs Contest has been running for nearly 50 years and celebrates the imperfections that make all dogs special and unique.",
  "shortSummary": "A hairless bulldog, named Petunia, won the 2025 World's Ugliest Dog Contest, with a standout performance and featured in limited-edition cans.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "82de53f88c5e4d13a8415a18f41c7893",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://nypost.com/2025/08/11/lifestyle/dear-abby-my-sister-blames-me-for-her-daughter-moving-away/",
      "text": "DEAR ABBY: My sister, “Jenny,” and I have had a falling-out and no longer speak. She’s upset with me because she found out her adult daughter, “Paisley,” had moved without telling anyone.\nI discovered it when Paisley had some mail sent to my house and later revealed she had moved across the country. Jenny and Paisley were no-contact; they had a huge argument six months ago and haven’t spoken since. I was in contact with both. Paisley explicitly told me that she didn’t want to deal with her mother.\nWhen I found out Paisley had moved, I asked if she wanted me to tell her mom because Jenny had blocked her. She said no. Our mom found out because Paisley also had her mail sent to Mom’s home, and Mom thought she was still in town. Mom told Jenny, and Jenny erupted on me. I thought I was doing what everyone wanted. Was I the villain in the story? — CONFOUNDED IN KENTUCKY\nDEAR CONFOUNDED: You did nothing wrong. Your sister erupted on you because you were handy. It’s a shame your sister and her daughter couldn’t mend fences, but the fault doesn’t lie with you. Paisley moved to escape the dysfunction in the family, which may have been wise, because there appears to be plenty of it. You are not a villain, and you should not accept being labeled that way.\nDEAR ABBY: My spouse continuously scrolls through video posts on her cellphone while we are in the same room. I have asked her to please engage her earphones, but she seldom does. Now, I simply turn off the TV and wait sometimes for up to a couple of hours before she quits. I don’t dare tell her that this is annoying. I have tried going into other rooms but feel trapped in my own home with her scrolling nonsense. When I have tried to talk to her, she throws all my faults in my face to shut me down on this subject. Suggestions? — HEARING TOO MUCH IN OHIO\nDEAR HEARING: Yes, I suggest that while your spouse has every right to disappear down the rabbit hole of her cellphone if she wishes, to insist on inflicting the audio on you is inconsiderate. Asking her to engage her earphones isn’t rude — it’s a natural response to being forced to be an unwilling audience. I have pointed out in the past that “the best defense is a strong offense.” This is the tactic your spouse is employing so she won’t have to cooperate.\nSome sessions with a licensed family therapist might help you to become more assertive. If you can’t bring yourself to do that, then my last suggestion is this: Choose an activity that takes you away from the house and introduces you to friends with similar taste in entertainment to your own.\nDear Abby is written by Abigail Van Buren, also known as Jeanne Phillips, and was founded by her mother, Pauline Phillips. Contact Dear Abby at http://www.DearAbby.com or P.O. Box 69440, Los Angeles, CA 90069."
    },
    {
      "url": "https://www.sonoma-marinfair.org/worlds-ugliest-dog/",
      "text": "WORLD’S UGLIEST DOG® LOGO\nClick the image to download high-resolution .png file. For other artwork files please email [email protected].\nNEW LOCATION FOR 2025!\nFriday, August 8th – 6:00 pm @ the Sonoma County Fair in Santa Rosa, CA\nThe 4th DAA is excited to partner with the Sonoma County Fair to bring the World’s Ugliest Dog Contest to the masses!\nFor nearly 50 years, the World’s Ugliest Dog® Contest has been a testament that the pedigree does not define the pet. Dogs of all breeds and sizes have warmed our hearts and filled our lives with unconditional love. This world-renowned event celebrates the imperfections that make all dogs special and unique.\nThe day begins with pre-contest entertainment and information on pet care and adoption. Each pup and handler will bask in the limelight as they show off their unique beauty to the judges, media, host, and fans. It’s a wonderful show of pageantry and pride.\nAnd while fun and entertaining, the contest speaks to the importance of advocating for the adoration of all animals and the benefits of adopting. Many of the contestant dogs have been rescued from shelters and puppy mills, to find loving homes in the hands of those willing to adopt. Please join us in raising awareness and support for the pets yet to be placed in a loving home.\nPrior to arriving for the contest, all the dogs must provide a veterinarian’s paperwork asserting that they are healthy. The World’s Ugliest Dog® Contest follows up with a vet check on-site just prior to the contest. Animal rescue and adoption groups are also on site with information showcasing adoptable pets.\nThe annual World’s Ugliest Dog® Contest is not about making fun of “ugly” dogs, but having fun with some wonderful characters and showing the world that these dogs are really beautiful!\n2024 World's Ugliest Dog (First Place)\nWild Thang\nWild Thang is an 8 year old Pekingese, who is no stranger to the ugly dog contest. This will be his fifth time as a contestant. He was born and raised in Los Angeles and recently retired to North Bend, Oregon.\nWild Thang contracted distemper as a puppy from a rescue foster. Sadly, after thousands of dollars later, the other puppy did not make it, but Wild Thang did, barely. He survived, but not without permanent damage. His teeth did not grow in, causing his tongue to stay out and his right front leg paddles 24/7. Other than that, he is a healthy, happy Glugly (glamourous/ugly) guy.\nHe loves people, other dogs and especially his toys. His purpose in life is to promote the necessity of getting your pets vaccinated.\nWild Thang has an Instagram account (Wildthangofficial) which allows him to keep in touch with all his friends, as well as he has posted a gofundme account to help get his fellow Pekingese, in the war zone in the Ukraine, to safety. To date, 7 Pekingese have safely made it out of the Ukraine and are now living happily in their adoptive homes in Canada and the US.\nSecond Place & People's Choice Winner\nRome\nMeet Rome, a 14-year-old Pug hailing from the cozy confines of The Pug Hotel in Rohnert Park, California. Rome was brought to The Pug Hotel by his wonderful paw rent who was dealt some difficult circumstances and was unable to provide the level of care that she felt he deserved. Now Rome is living out his senior years amongst a happy grumble of other senior pugs at The Pug Hotel Senior Sanctuary, where he is a fan favorite due to his sweet personality and happy feet!\nRome is a sweet old man in a tiny pug body. He has serious FOMO – he refuses to close his eyes if he thinks he might miss a fun experience – and, despite his bowed legs, he loves to tippy tap dance with his feet to express his joy for life!\nThis year marks Rome’s debut in the World’s Ugliest Dog contest, following in the steps of his Pug Hotel sibling, Jinny Lu.\nBeyond the spotlight, Rome’s heart is as big as his presence, as he contributes to the community as a member of the 2023 Wheeling Pug Relay team, which raises money to purchase wheelchairs for differently-abled dogs.\nAdditionally, Rome spreads cheer by visiting hospice patients and educating children about the importance of adopting senior rescue pets, exemplifying the boundless love and positivity he brings to the world.\nThird Place\nDaisy Mae\nMeet Daisy Mae, 14-ish years old, the reigning queen of unconventional beauty in Lafayette, CA! Daisy boasts a face that only a mother could love, and even her own mom had to do a double take when they first met… But don’t let her unconventional looks fool you-this pup’s got a heart of pure gold.\nWhen Daisy isn’t busy soaking up the sun or engaging in some intense squirrel-chasing, you can find her indulging in her favorite pastime: snuggles. Oh, and let’s not forget about her beloved hobby of annoying her older (more traditionally attractive) sister, Harriet. It’s a tough job, but someone’s gotta do it!\nDaisy’s journey to stardom hasn’t been all squirrel-chasing and glamour. Rescued from the mean streets at the tender age of 2, she faced some rough times. Rumor has it she was once in cahoots with a cat gang! But thanks to her forever home, she’s transformed into the best version of herself. What she has lost over the years in hair, teeth, and vision, she has gained in friends, confidence, and so much spunk.\nIf Daisy were to snag the crown at the Ugliest Dog Contest (which, let’s be honest, she deserves), she’d use her newfound fame to shine a spotlight on rescue pups everywhere. Because every dog deserves the chance to blossom into their best, ugliest selves, right?\nMochi\nMeet Mochi, an adorable nine-month-old Chihuahua/Jack Russell Terrier mix from Lafayette, California. It’s Mochi’s first time entering into competition, and the excitement is palpable! Life, according to Mochi, is an exhilarating journey, filled with the joy of meeting friends, frolicking with cat siblings, and dashing through the grass.\nMochi shines brightest at puppy social class, where their effervescent personality helps shy newcomers come out of their shells, and makes everyone feel comfortable enough to release their inner race car. Running, to Mochi, is not just a pastime but a passion, with the grass serving as the ultimate racetrack.\nMochi’s mommy and daddy can attest to Mochi’s ability to bring immense joy into their lives with their endearing antics. Having experienced the loss of their childhood dogs, Mochi’s unexpected appearance on social media proved to be a serendipitous moment. Initially intended as a foster, Mochi swiftly won over their hearts, securing a permanent place in their home.\nNowadays, Mochi can be found lounging in the catio, perched atop the couch, or indulging in their newfound ability to stealthily sample bites from unsuspecting dinner plates during TV time. Their mischievous yet lovable demeanor never fails to elicit smiles from all who encounter them, making every day an adventure in the delightful world of Mochi.\nPoppy\nPoppy, a Chinese Crested/Gremlin mix, introduces herself as the runt of her litter, boasting a unique appearance as the only one of her littermates to be born with no hair. Apparently, this helps her to be a great swimmer because she’s hydrodynamic. Plus, this gives her great tan lines in the summer.\nBorn five years ago on a farm in Tbilisi, Georgia, Poppy was brought to the United States by another family. However, due to her one eye’s impaired vision, they worried about her care, leading Poppy’s current mom to step in.\nNow residing in Marin County with her loving family, Poppy thrives despite her distinctive look, thanks to the support of her mom and sister. With favorite hobbies like stick-finding, burrowing, and cuddling, showcasing her latest fashion choices, and singing along with her family in nightly howls, Poppy embraces her chupacabra-chic appearance, drawing inspiration from Andy Warhol’s hair and sporting a beard that would make Martin Van Buren blush.\nAs a first time contender in the World’s Most Unassuming Cuddliest Monster Contest, Poppy balances her playful antics with a more serious role as a psychiatric service dog, providing comfort and support to her mom and others. Despite initial inquiries about her unconventional appearance, Poppy charms everyone she meets, demonstrating that beauty transcends physical attributes. She may be a tiny hairless mutant with a wonky eye that wears diapers, but Poppy eagerly shares her affection with anyone willing to accept it, albeit with a playful warning: don’t feed her after midnight!\nOzzy\nOzzie is a sweet & happy 10-year-old terrier mix with a helicopter tail that never stops wagging! He has a hitch in his giddy-up, which probably happened during his life at a Mexico landfill being chased by seagulls & turned his hair prematurely gray. He started out as a foster dog and went with his caregiver on visits to the senior center, where he charmed everyone; some of the seniors thought he looked like a bat instead of a dog. Ozzie also helps take care of foster kittens, giving them baths and letting them play in his hair, which gives him “bed head.”. Ozzie would love to erase those landfill memories by representing all those dogs like him who don’t win beauty contests by winning the World’s Ugliest Dog Contest because he is Uniquely A-dorable!\nTwiggy\nMeet Tiny Twiggy, a first-time contestant with the biggest heart. This 14 or 15-year-old Chihuahua mix is all about cuddles, attention, rocking her sweaters, and enjoying leisurely walks around Sonoma, California.\nTwiggy’s story started when she was found wandering the streets of Napa one spring. Luckily, she ended up at Pets Lifeline in Sonoma, where they took one look at her and knew she needed their help. When she arrived, she was super skinny, almost bald, and had really bad eye problems. But thanks to the awesome foster parents and a talented eye doctor, Twiggy’s eyes are getting better every day.\nHer foster parents fell head over heels for her when they met her at the shelter. They knew she needed a loving home, so they stepped up to foster her. And let’s be real, they might just end up keeping her forever because they love her so much. In the meantime, they’re giving her all the love and care she needs. Twiggy’s putting on weight, her fur’s growing back, and she’s one happy pup.\nFreddie Mercury\nThis is Freddie Mercury, better known as Fred. Fred is a 14-year-old Brussels-Griffon/Pug mix named for his “Excess of Tooth.” This is his debut in the ‘World’s Ugliest Dog Contest”.\nFred started his life somewhere in the mean streets of Solano County and was adopted on May 5th, 2012, at Solano County Animal Care in Fairfield, CA.\nFred was given to his current human, Dan, by Dan’s favorite aunt after having suffered a broken heart. It was Aunt Stella who busted him out of the joint, but it was everyone in Dan’s life that would reap the benefits. With this dog was promised unconditional love… and Freddie has never failed in that regard. He has always been a good boy from the start!\nFred went to live with Dan, in Sacramento at the time, and they have been inseparable ever since. Ten years ago, in 2014, Fred and Dan moved to Sonoma County. First to Santa Rosa and then to Petaluma.\nFred began by helping Dan but since then has touched the lives of many. For the past 4 years, Freddie has been spending his days as Mascot for Petaluma’s local ice cream truck. He’s riding shotgun in the sun passing out smiles and greeting all the families of this town every day. With a face like a fork-lift and a bad case of cherry-eye that needs cleaning every day, many people have asked that he compete in this contest.\nFred goes to little league games, he goes to softball and youth soccer games. Fred helps to bring in crowds at school fundraisers and is often specifically requested for birthday parties. Everybody wants to see Fred and there are very few days where he is left at home. He’s a true working dog!\nFred is a rescue and not trained in any way as a service dog but his ongoing contribution to the community is apparent to anyone that comes in contact with him. Show some love for the locals, vote Freddie Mercury for “World’s Ugliest Dog”!"
    },
    {
      "url": "https://nypost.com/2025/08/11/lifestyle/preppers-reveal-15-essential-items-for-a-doomsday-bunker/",
      "text": "Peek inside a real doomsday bunker — with the 15 essential items preppers say will keep you alive for a year\nThey won’t be doomed.\nA couple from Montana has turned to full-scale “prepping” in response to rising global tensions, they say — stockpiling enough supplies to survive a year off-grid in case of war, natural disaster, or prolonged power outages.\nCarrie and Colton Smith, both in their mid-30s, began preparing for an uncertain future in early 2023 — after a Chinese surveillance balloon was seen flying over the U.S., triggering national concern before being shot down.\nThe event was a “wake-up call” for the couple, prompting them to take survival into their own hands.\n“I grew up in California, where there are earthquakes, so my family was always prepared for natural disasters — but the balloon took things to the next level for us,” Carrie, a housewife who now shares prepping tips to over one million followers under the handle @housewifeprepper, told SWNS.\n“I realized I needed to take matters into my own hands.”\nSince then, the Smiths have amassed a wide range of supplies, including four generators, three 55-gallon water drums, freeze-dried foods with a 25-year shelf life, and various forms of protection such as firearms and tasers.\nThey’ve also invested in solar panels, satellite phones, solar-crank radios, and even a life raft — an item she said once saved one of her followers’ lives during a flood.\nThe Smiths believe they could survive for a year off their supplies.\n“Every homemaker should factor it in,” Carrie said. “It’s an extension of caring for your family.”\nCarrie emphasized that prepping isn’t just for major catastrophes.\n“It isn’t just doomsday or World War 3; it could be a job loss, a natural disaster, anything,” she said.\nThe couple has built a comprehensive plan, including “bug-out bags” for themselves and their Goldendoodle, Sky, to grab and go.\nThey’ve spread their gear across several locations — including their home, cars, and even friends’ houses — forming a small support network they can count on in a crisis.\nTheir supplies cover five core categories: food, water, shelter, self-defense, and communication.\nThough some may view their lifestyle as extreme, the Smiths say it’s simply responsible.\n“Prepping is very expensive and you can’t do it overnight — but it’s an investment, like a form of insurance,” she said.\n“It’s about feeling confident in the supplies you have. It’s not extreme, it’s smart.”\nCarrie noted that food, water, shelter and power are most important, followed by self-defense items and then communication tools.\n15 essential doomsday bunker items for preppers:\n• Water filtration & purification (portable filter, purification tablets/drops)\n• Stored water supply (at least one gallon per person per day)\n• Emergency food supply (freeze-dried meals, canned goods, rations)\n• Fire-starting tools (ferro rod, waterproof matches, lighter, tinder)\n• First aid kit (trauma supplies, meds, antiseptics, bandages)\n• Emergency shelter (tarp, lightweight tent, mylar blanket)\n• Warm clothing & insulation (wool socks, thermals, waterproof layers, gloves)\n• Multi-tool or survival knife (fixed blade preferred)\n• Light sources (headlamp + flashlight with spare batteries or solar)\n• Navigation tools (compass, maps, GPS backup if possible)\n• Portable power source (solar charger, power bank, tri-fuel generator, solar generator)\n• Communication gear (emergency radio, whistle, backup phone, satellite phone)\n• Self-defense tools (pepper spray, firearm, where legal, or alternative)\n• Sanitation & hygiene items (soap, wipes, toilet paper, waste bags)\n• Important documents & cash (waterproof bag with ID, cash, emergency contacts)"
    },
    {
      "url": "https://www.today.com/pets/petunia-worlds-ugliest-dog-contest-winner-rcna224239",
      "text": "The 2025 winner of the World's Ugliest Dog Contest has bloomed into an adorably quirky champion after being rescued from living in a crate in a neglected situation.\nIt's only fitting her name is Petunia.\nThe 2-year-old hairless French bulldog mix appeared live on TODAY alongside handler Shannon Nyman on Aug. 11. She basked in her victory, three days after winning $5,000, a spot on limited-edition cans from sponsor Mug Root Beer and the coveted bragging rights for being selected as the World's Ugliest Dog.\n\"I think she's feeling great,\" Nyman said on TODAY. \"She loves all the attention, she loves all the affection, all the humans petting her.\"\nPetunia beat out nine other dogs at this year's contest on Aug. 8 at the Sonoma County Fair in Santa Rosa, California. A panel of four judges, including NBC News correspondent Gadi Schwartz, scrutinized the dogs based on looks, stage presence, backstory and how well they graced the red carpet.\n\"She's a mix between Yoda, she's a mix between a hippo, a bat — she's got it all,\" Schwartz said on TODAY.\n\"She's a total creature,\" Nyman told Schwartz about Petunia during the contest.\nThe contest, which has been celebrating imperfection for nearly 50 years, advocates for adopting dogs instead of buying them from breeders. Petunia and many of the other contestants are rescue dogs from shelters and puppy mills.\nPetunia is cared for by the Luvable Dog Rescue in Eugene, Oregon, where Nyman is a volunteer.\n\"Even a wonky dog deserves to be loved,\" Nyman said. \"And that's what we prefer to call them: not ugly, wonky.\"\nPetunia was rescued from a backyard breeder situation in Las Vegas where the owner was hoarding more than 50 dogs that were living in crates, according to Nyman. Petunia is hairless because of the unethical breeding practices she endured before she was rescued.\n\"Most of these bully breeds are being irresponsibly bred, unethically bred, so they have what's called BOAS — brachycephalic obstructive airway syndrome — so they need to get their soft palate reduced in order for them to breathe and function well,\" Nyman said.\nPetunia had BOAS after spending the first two years of her life in a crate. Rescued in May, she was given surgery to fix her breathing and is now happy and healthy.\nShe now gets daily coconut oil treatments after initially having a reddish hue that had the volunteers at Luvable Dog Rescue dubbing her Pinky Petunia. After basking in her victory, she will now be getting back to normal life.\n\"We're going to go back home to Oregon. She's going to go back to her friends, probably go for a long walk in the woods,\" Nyman said.\nNyman added that the rescue is going to launch Wonky Dog, a for-profit LLC of animal philanthropists raising money for rescue dogs."
    },
    {
      "url": "https://nypost.com/2025/08/11/lifestyle/easyjet-pilot-suspended-after-going-on-nude-drunken-rampage/",
      "text": "EasyJet pilot booted after marathon drinking binge at resort, ‘cavorting naked’ before flight: ‘Breathtakingly unprofessional’\nHe was “taking off” in a different way.\nAn EasyJet pilot has been suspended after he embarked on a drinking marathon that ended with him wandering around a hotel naked.\n“This was breathtakingly unprofessional behavior from the pilot,” an anonymous source told the Sun while recounting the booze cruiser’s drunken rampage. “It was the height of stupidity. His career with EasyJet is doomed.”\nThe incident occurred Aug. 9 after the veteran flyboy had reportedly just gotten done ferrying vacationers from the UK to Cape Verde, an idyllic island nation in West Africa.\nHe reportedly checked in at the five-star Meliá Dunas Beach Resort & Spa, whereupon he proceeded to embark on a post-flight booze binge.\nHis bender eventually spiraled out of control.\nAt around 2:30 a.m. Aug. 5, appalled guests reportedly witnessed the plastered pilot undress and wander into the reception area, before continuing on to the gym and spa in his birthday suit. He was reportedly in a “paralytic” state, sources said.\n“The pilot did not have a stitch on and reeked of alcohol,” another anonymous airline insider told the outlet.\nTo make matters worse, the flyboy was slated to make the 2,332-nautical-mile trip back to Gatwick in London on the afternoon of Aug. 6, the BBC reported.\nHowever, onlookers identified the boozy bozo and alerted the EasyJet brass, who took him off the plane and found a replacement.\n“As soon as we were made aware, the pilot was immediately stood down from duty, in line with our procedures,” an airline rep declared. “The safety of our passengers and crew is EasyJet’s highest priority.”\nThey have since launched a probe into the pilot’s naked antics.\nThe aforementioned source agreed with the decision on the grounds that “anyone who saw the pilot cavorting naked in the early hours on the day before a flight would not dream of getting on a plane with him at the controls.”\n“He was so drunk that you wouldn’t have put him in charge of a toy airplane, never mind the real thing with hundreds of passengers,” they said. “We all make mistakes but the level of stupidity on display here by a veteran captain beggars belief.”\nUnfortunately, this isn’t the first sky captain to get busted for hitting the sauce before a flight.\nEarlier this year, a Southwest Airlines pilot was arrested shortly before takeoff in Georgia after he allegedly showed up to work intoxicated, police say."
    }
  ],
  "argos_summary": "Petunia, a 2-year-old hairless English-French bulldog mix, won the 2025 World's Ugliest Dog contest held at the Sonoma County Fair in California, receiving a $5,000 prize and a feature on Mug Root Beer cans. Rescued from a neglectful breeding situation, Petunia is celebrated for her unique appearance and gentle personality. The contest, which has been running for nearly 50 years, aims to promote the beauty of all dogs, especially those rescued from shelters and puppy mills.",
  "argos_id": "GM6MLNP1X"
}