{
  "url": "https://www.forbes.com/sites/sindiswamabunda/2025/08/12/your-complete-guide-to-the-2025-fiba-mens-afrobasket/",
  "authorsByline": "Sindiswa Mabunda",
  "articleId": "9313a33d3e4547f59b3dc13ee9723eaa",
  "source": {
    "domain": "forbes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NJ",
      "county": "Hudson County",
      "city": "Jersey City",
      "coordinates": {
        "lat": 40.7215682,
        "lon": -74.047455
      }
    }
  },
  "imageUrl": "https://imageio.forbes.com/specials-images/imageserve/689a570d2524c605b7d854d9/0x0.jpg?format=jpg&crop=2112,1188,x0,y0,safe&height=900&width=1600&fit=bounds",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T05:00:00+00:00",
  "addDate": "2025-08-12T05:06:42.592207+00:00",
  "refreshDate": "2025-08-12T05:06:42.592209+00:00",
  "score": 1.0,
  "title": "Your Complete Guide To The 2025 FIBA Men’s AfroBasket",
  "description": "The 2025 FIBA AfroBasket 2025 will highlight Africa’s best basketball talent, top teams, rising stars, and fierce competition, a must-watch tournament for fans worldwide.",
  "content": "From August 12th to 24th, 2025, the eyes of the basketball world will turn to Angola as it hosts the FIBA Men’s AfroBasket: the continent’s most prestigious basketball tournament. Bringing together Africa’s best national teams and top talent, AfroBasket is a celebration of the sport’s remarkable growth, rising stars, and enduring rivalries across the continent. This edition promises to be one of the most competitive and exciting in recent memory, reflecting how African basketball has rapidly evolved on the global stage.\n\nAfroBasket in Context: The Rise of African Basketball\n\nOver the past decade, African basketball has undergone a transformation driven by several factors: the emergence of the Basketball Africa League (BAL), greater international exposure of African players through the NBA and EuroLeague, and expanded grassroots development programs. AfroBasket has evolved into a highly competitive tournament that not only crowns the continental champion but also serves as a key qualifier for the FIBA World Cup and the Olympic Games.\n\nTunisia enters this tournament as the reigning champions and will attempt to become the first nation since Angola to claim three consecutive AfroBasket titles. Meanwhile, Angola, a basketball powerhouse with 11 titles, is eager to reclaim the crown on home soil after a decade without winning the trophy. Other nations such as South Sudan, Senegal, Nigeria, Cameroon, and Côte d’Ivoire bring strong rosters featuring NBA and BAL stars, setting the stage for intense battles.\n\nTeams to Watch: African Basketball’s Best and Brightest\n\nTunisia, ranked fourth in Africa, is the team to beat. Their recent dominance, marked by titles in 2011, 2017, and 2021, reflects a balanced, disciplined squad with solid shooting and defensive intensity. Veterans like Omar Abada, the team’s leader in scoring and assists during qualifiers, are joined by new talent that continues to emerge. Under coach Mehdy Mary, Tunisia’s tactical discipline and efficient ball movement position them as strong favourites.\n\nAngola’s 11 AfroBasket titles make them Africa’s most decorated team, but their last victory came in 2013. Hosting the tournament offers both pressure and motivation. Led by NBA and EuroLeague player Bruno Fernando and domestic league stars Childe Dundao, Aboubakar Gakou, and Jilson Bango, Angola blends experienced rim protection with versatile scoring. Coach Josep Claros Canals has focused on improving perimeter shooting and reducing turnovers, which were challenges in qualifiers. The passionate home crowd will be a vital factor as Angola looks to add a 12th title.\n\nSouth Sudan has become a basketball Cinderella story in recent years, rising to become Africa’s top-ranked team in the FIBA Men’s World Ranking. Their aggressive and athletic style of play has garnered international attention, with standout players like 2023 BAL MVP Nuni Omot, Wenyen Gabriel, and versatile big man Jo Lual Acuil leading the way. The Bright Stars combine size, speed, and emerging NBA talent, including Kuany Atem Kuany, who is known for his exceptional three-point shooting. Their upcoming debut at the Paris 2024 Olympics has further boosted their confidence and experience as they aim to establish themselves as serious contenders on the continent.\n\nCameroon’s team features an exciting mix of youth and experience, spearheaded by Alfred Aboya’s coaching and NBA rookie Yves Missi. With strong rebounding, the best in their qualifying group, and balanced scoring from players like Jeremiah Hill and Williams Narace, the Indomitable Lions have steadily improved. If their shooting efficiency rises and turnovers decrease, Cameroon could challenge the established favourites for a quarterfinal spot.\n\nNigeria’s D’Tigers, champions in 2015, possess undeniable talent but face questions about preparation and offensive consistency. Led by NBA guard Josh Okogie and standout Devine Ike, Nigeria is known for aggressive defense and high steal rates, but has struggled with shooting efficiency and turnovers in qualifiers. Their potential to upset stronger teams remains high if they find cohesion early in the tournament.\n\nSenegal, a powerhouse with five AfroBasket gold medals, enters with renewed energy thanks to emerging talents like Jean-Jacques Boissy, Ousmane Ndiaye and Brancou Badio. Despite some shooting inconsistencies, their rebounding and defense remain among Africa’s best.\n\nCôte d’Ivoire, with a rich basketball history including two continental titles and a recent silver medal in 2021, dominated qualifiers with an undefeated record. Veteran leadership from Solo Diabate, combined with versatile scorers like Matt Costello, has given the Elephants a solid foundation to contend for a podium finish.\n\nCôte d’Ivoire stands as the favourite after a flawless qualifying campaign. DR Congo’s physicality and interior strength, anchored by Sakho, make them formidable challengers. Cape Verde brings elite rim protection with Walter Tavares and a physical defensive style. Rwanda, with a focus on defense and emerging players, aims to surprise.\n\nTunisia leads this group, seeking a third consecutive title. Cameroon’s rebounding and rising NBA talent gives them a real shot to join Tunisia in the knockout stage. Nigeria’s defense and star power create potential for surprises, while Madagascar, after a long hiatus, looks to make an impact with disciplined play.\n\nAngola enters as the favourite on home soil, backed by a passionate crowd and strong interior game. South Sudan’s size and athleticism pose a challenge for the top spot. Guinea and Libya bring tenacity and experience, with Libya’s Sam Vincent coaching bringing NBA insight.\n\nSenegal looks to build on their history with a dominant qualifying run. Mali’s defensive grit and size anchored by two-time BAL DPOY Aliou Diarra pose a threat to advancement. Egypt’s rich legacy and emerging talent under new coaching bring optimism. Uganda’s youthful Silverbacks aim to leverage athleticism and energy to upset higher-ranked foes.\n\nShowcase of Africa’s Finest Talent: AfroBasket 2025 brings together a stellar lineup of NBA, BAL and Euroleague stars alongside emerging African basketball phenoms, offering fans a unique opportunity to witness the continent’s best athletes competing at the highest level.\n\nA Global Launchpad for African Players: More than just a continental championship, AfroBasket acts as a critical springboard for African players aiming to make their mark on the global basketball stage. The tournament continues to elevate Africa’s profile within international basketball, drawing increased attention from scouts, media, and fans worldwide.\n\nRising Parity Fuels Unpredictable Drama: The gap between traditional powerhouses and rising nations is narrowing, making every game fiercely competitive. This growing parity ensures an electrifying tournament filled with unexpected twists, upsets, and edge-of-the-seat moments from the opening tip-off to the final buzzer.\n\nVibrant Cultural Celebration and Homegrown Passion: With Angola hosting, AfroBasket 2025 will be infused with rich cultural energy, spirited fanfare, and passionate home crowds, creating an electric atmosphere that celebrates not only basketball but African unity and pride.\n\nPrepare for fast-paced, physical basketball marked by tactical coaching, emerging stars, and fierce rivalries. The tournament is set to deliver unforgettable moments, surprise upsets, and the crowning of a new or returning African basketball king.",
  "medium": "Article",
  "links": [
    "https://www.forbes.com/sites/sindiswamabunda/2024/09/30/patrick-gardner-embracing-a-unique-offseason-and-exhibit-10-contract/",
    "https://www.forbes.com/sites/sindiswamabunda/2025/07/09/bal-stars-aliou-diarra-and-jean-jacques-boissy-selected-in-nba-g-league-international-draft-after-dominant-seasons/",
    "https://www.forbes.com/sites/sindiswamabunda/2024/07/31/south-sudans-rise-luol-deng-inspires-unity-through-basketball/",
    "https://www.forbes.com/sites/sindiswamabunda/2024/07/21/bright-stars-shine-as-south-sudan-nearly-upsets-team-usa/",
    "https://www.forbes.com/sites/sindiswamabunda/2025/06/09/the-story-behind-2024-bal-mvp-and-dpoy-jo-lual-acuil-jrs-return-to-bal/",
    "https://www.forbes.com/sites/sindiswamabunda/2025/06/14/inside-jean-jacques-boissys-path-back-to-the-bal-final/",
    "https://www.forbes.com/sites/sindiswamabunda/2025/06/11/nuni-omot-takes-olympic-lessons-into-the-2025-afrobasket/"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "emerging African basketball phenoms",
      "weight": 0.074952796
    },
    {
      "name": "African Basketball",
      "weight": 0.074795246
    },
    {
      "name": "African basketball",
      "weight": 0.074795246
    },
    {
      "name": "emerging NBA talent",
      "weight": 0.07430418
    },
    {
      "name": "rising NBA talent",
      "weight": 0.07292063
    },
    {
      "name": "international basketball",
      "weight": 0.0665124
    },
    {
      "name": "emerging talent",
      "weight": 0.063913435
    },
    {
      "name": "emerging talents",
      "weight": 0.063913435
    },
    {
      "name": "African Players",
      "weight": 0.06363878
    },
    {
      "name": "African players",
      "weight": 0.06363878
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.9912109375
    },
    {
      "name": "/Sports/Team Sports/Basketball",
      "score": 0.69287109375
    },
    {
      "name": "/Sports/International Sports Competitions/Other",
      "score": 0.50634765625
    }
  ],
  "sentiment": {
    "positive": 0.7368743,
    "negative": 0.055559598,
    "neutral": 0.20756604
  },
  "summary": "The 2025 FIBA Men’s AfroBasket will be held in Angola from August 12th to 24th, 2025, marking the opening day of the most competitive and exciting basketball tournament in recent memory. The tournament, which includes Africa's top national teams and top talent, will showcase the sport's remarkable growth, rising stars, and enduring rivalries across the continent. Tunisian, the reigning champions, is expected to be the first team since Angola to win three consecutive Afrobasket titles. Angola, a national team with 11 titles, is eager to reclaim its crown after a decade without winning the trophy. Other teams such as South Sudan, Senegal, Nigeria, Cameroon, and Côte d'Ivoire also bring strong rosters featuring NBA and BAL stars. The Tunisian team is tipped as the best team to beat, with Tunisian's recent dominance reflected by their solid shooting and defensive intensity. Angola's 11 Afrobasket titles make them Africa's most decorated team, but their last victory came in 2013.",
  "shortSummary": "The 2025 FIBA Men’s AfroBasket will feature top African teams, with Angola aiming for a 12th title and South Sudan's rise to international prominence.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "6780072a22fc47859f338e5702f3e12b",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.forbes.com/sites/sindiswamabunda/2025/06/14/inside-jean-jacques-boissys-path-back-to-the-bal-final/",
      "text": "“Are They Ready For Me?\" That’s the question Al Ahli Tripoli’s point guard Jean Jacques Boissy throws back, half-joke, full conviction when asked if he’s ready for the moment. It’s more than a clever line. It’s the energy of a player who’s been counted out, moved around, and quietly transformed into not only one of the BAL’s most reliable leaders but one of the young superstars of this league.\nFor Boissy, this year’s BAL Final isn’t just a shot at redemption it’s a return to the stage where it all started. From a breakout run with Senegal’s AS Douanes to a fresh challenge with Libya’s Al Ahli Tripoli, his path reflects not only personal growth but the maturing identity of a league where African basketball continues to rise.\nIn an interview with Forbes.com ahead of the Season 5 BAL Finals against Petro de Luanda in Pretoria, South Africa, Boissy shared more about the lessons learned from his three seasons in the BAL, the decision to join Tripoli for Season 5, his role on the team as well as how he hopes his journey can inspire others.\nEarly Days, Big Dreams\nHis BAL debut came with AS Douanes, and even then, he had a sense that something special was possible. “I think it’s been a great journey,” he shared. “My first year, I was still a local player with AS Douanes and we managed to make it to the finals. Our goal was just to reach the Playoffs, but we saw our chances, played hard and made it to the Final?”\nThey pushed, they played hard, they stayed together. But the dream ended in heartbreak against Al Ahly of Egypt. “It hurt me, but it was a great experience to make it to the finals in my first year,” he admits.\nThe following season, he returned to Douanes with unfinished business. “I went back trying to finish the job. But we didn’t make it to the semifinals. We lost against Petro. We were leading the whole game by 20. It was a bad, bad fourth quarter for us, but we lost it.”\nThat sting didn’t break him, it sharpened him. “You get better after every loss,” he says. “And I think that’s what really helped me to focus on this year and try to win it.”\nHow Choosing Al Ahli Was A Leap of Faith\nThis season marked a pivotal turning point. The team he played for during The Road to the BAL — Urunani, did not qualify, and his previous team — AS Douanes, where he spent his first two BAL seasons, also failed to qualify. As a result, an opportunity arose with Al Ahli Libya. However, the decision to leave home was not an easy one.\n“It was, first of all, a hard choice to make, leaving your country,” he explains. “Making this choice to go play for Al Ahli was really hard. Everybody in Senegal was like, ‘He just left Senegal to play for another team.’”\nThere was pressure. Doubts. Whispers about his role.\n“A lot of people were texting me saying; 'they signed a lot of point guards. I don’t think you’re going to have playing time and all that,’” he shares. “But I really trust myself. I prayed to God before I made the choice. Talked to my parents, my friends, and my agent. And here we are.”\nFor him, it came down to research and faith. “Life is about choices. You’ve got to study the team, study the market, study the value of the team. And I think this was a great fit for me.”\nDifferent Jerseys, Same Mentality\nHaving suited up for AS Douanes, Urunani in the Road to BAL, and now Tripoli, he’s navigated diverse systems and coaching philosophies, a process he’s embraced with humility.\n“It’s not a really big challenge going from team to team, as long as you stay the same,” he says. \"I’m really a coachable person. Wherever I go, as long as I’m still me: listening to the coaches, listening to the players, trying to get better every time, it’s easy for me to fit in.”\nThe consistency paid off. “I played with Urunani, and it was with the same coach who coached me at AS Douanes, Coach Pabi Gueye. He liked to play defense and to play hard. He’s a winner,\" Boissy reflects. \"I came here, Coach Fouad is just like my dad, that’s how he sees me and coming off the bench, he has always found a way to make me look good.”\nKigali: A Full-Circle Return\nThe season tipped off in Kigali, a place that holds emotional weight for him. Years ago, it was a proving ground during a rough period where he played with United Generation Basketball Club in the Rwandan League. Returning with Al Ahli was a reminder of how far he and the country had come.\n“When I was there, they didn’t have the stadium. They didn’t have a lot of things,” he recalls. “Some people didn’t recognise me until the game started. It was like, ‘Oh, that was the kid playing for UGB.’ So it was great for me. I had a lot of fans in Rwanda. I was really feeling like I was playing home in Rwanda.”\nThat energy pushed him forward. “It really helped me to boost my confidence. And to show them that I really grew up and I got better in my game.”\nEfficiency and Emotional Growth\nThis season, his performance has stood out averaging 19.7 points, 2 assists, 3.6 rebounds and 2.2 steals per game - all while coming off the bench. The box score reflects his influence, but his real impact and the growth of his basketball IQ is in how he controls the pace, makes the right reads, and leads by example.\n“I think it’s just like knowing the game better and growing up,” he says. “Because people used to view me as just a kid that’s hungry for more and I couldn’t control my emotions and was just really rushing everything.”\nNow, he sees the game differently. “I’ve really been working on making sure I know what the game needs me to do and doing it,\" shares Boissy. \"I am not just trying to score, if this game needs asks me to pass to the short roll or play good defense, I’m just going to be there for that.”\nIn previous BAL campaigns, he was the player asked to shut down opponents’ best scorers. This year, the role has changed from game to game and he’s responded each time and still maintained his edge, earning him a spot on the BAL-All Defensive first team.\nLeadership, Without Needing the Spotlight\n2025 BAL Coach Of the Year, Coach Fouad Chacra called him one of the greatest gifts to the team this season, a testament not only to his playmaking but to how seamlessly he’s fit into the locker room.\n“They really made me feel comfortable,” Boissy says. “At some point, it felt like I had been playing with them for a couple of years.”\nThat comfort translated into chemistry. “They have the same energy as me. They’re trying to win. I played in the BAL for two years before now, this was their first. So I was always there to help them to know.”\nBoissy’s leadership came into sharper focus after the team’s disappointing classification loss.\n“Some people were stressing about it. And I was just there to let them know that in the BAL, you’re going to have one game that’s going to hurt your feelings. And we’re just blessed to have it at the point where it’s not going to send us home.”\nHe helped keep the team grounded. “I was there to keep the team together and hopefully, that was the last loss we’re going to have in the whole tournament.”\nBut leadership wasn’t something new, it just took a new form. He’d captained teams before, but being a young foreign player made it harder to step up vocally at first.\n“I used to be a leader, like growing up and playing under-18 with Senegal, I was the captain but whenever I go somewhere and I see older people, I just give them their respect,” he explains.\nThat instinct to step back shifted this year.\n“They gave me the space and let me know that I could talk to them and I have seen my leadership skills grow. I am calm, poised, and learning more about controlling my emotions.”\nThe Final, and the Bigger Picture\nBoissy has reached the final once again but this time, the perspective is different.\n“I’m just thinking that it’s one game I’ve got to win. It’s just like 40 more minutes,\" shared Boissy. \"I’m not going to stress myself about it being a final I’m just taking it as a game.”\nMore than anything, he wants his journey to mean something, especially to the kids back home.\n“I’m really doing this for every African kid that didn’t go to college or to high school. To just know that you still can achieve big things as long as you stay on track. You keep working hard and believe in yourself.”\nHe knows the path isn’t easy. “Everybody is not going to have the opportunity to go overseas but you can’t give up. I wish everybody was going to have it. But it’s not going to be like that,\" shares Boissy.\n\"You’re going to go through some hard times. But you just got to keep working and believe in yourself.”\nWhether the trophy is in his hands or not when the final buzzer sounds at Sun Bet Arena, one thing is clear, his BAL journey has already left its mark."
    },
    {
      "url": "https://www.forbes.com/sites/sindiswamabunda/2024/07/31/south-sudans-rise-luol-deng-inspires-unity-through-basketball/",
      "text": "South Sudan's ascent in basketball underscores the transformative power of community, vision, leadership, and resilience. Central to this inspiring journey is Luol Deng, whose presidency of the South Sudan Basketball Federation has heralded a new era for the country's sports development. Deng's mission extends beyond building a competitive basketball program; he envisions using the sport as a catalyst for unity and national growth.\nAs Deng reflects, \"Our culture has been put second to everything where people don’t understand the kind of people that we are and what we strive for.\" Despite enduring a prolonged civil war, Deng emphasizes that most South Sudanese had little part in it, and their vibrant culture of mutual support and community has often been overlooked. His goal is to leverage basketball to highlight this positive cultural identity, with the hope that, given peace and time, South Sudan's talent and unity will gain global recognition.\nSouth Sudan's men's basketball team has emerged as one of the most compelling Cinderella stories of the Olympics, making significant strides with the backing of the South Sudanese government and Deng's strategic vision. In an interview with Forbes.com, Deng elaborates on the program’s rapid progress despite limited infrastructure and resources. His efforts have not only created a promising pipeline for future stars, both domestically and abroad but have also elevated South Sudan's standing on the international stage. Through relentless perseverance and collaboration, Deng and his team have inspired hope and unity among South Sudan’s people, setting a powerful example for the entire continent.\nElection And Initial Vision\nLuol Deng’s presidency of the South Sudan Basketball Federation marked the beginning of a transformative era for South Sudanese basketball. Reflecting on the start of the journey four years ago, Deng stated, “We had an election, I won and was elected as the president of the Basketball Federation and I just had to come up with a plan on how to be different in order for the federation to move forward.\" Deng’s vision was not just about immediate success but about laying the groundwork for a long-lasting impact on South Sudanese basketball.\nBest High-Yield Savings Accounts Of 2024\nBest 5% Interest Savings Accounts of 2024\nCentral to Deng’s vision was identifying and cultivating talent, a process that began with his experience running basketball camps since he got drafted in 2004. “I always kept an eye on South Sudanese and African players in general and I was able to do camps all over where we have a lot of diaspora and a lot of young kids who are playing basketball,” Deng explained.\n“Every time I went back home I was able to see the talent and the potential of it,” he added. Deng's professional career provided him with the knowledge and skills to build a team capable of competing at the highest level. His experience in camps enabled him to lay the groundwork for developing the next generation of talent, ensuring a steady pipeline of athletes.\nBuilding The Program\nBuilding a basketball program in South Sudan came with significant challenges, particularly in terms of infrastructure and resources. Deng reflected on the shared struggles across African federations: “I think that a lot of African countries and a lot of federations share the same kind of struggle, just across the continent in many countries you can see the lack of facilities but it is also the lack of belief and the lack of support.\" Despite these obstacles, Deng was determined to create a program that would inspire both players and supporters, demonstrating that basketball could be a catalyst for unity and development within the nation.\nA pivotal step in building this program was gaining the trust and commitment of players. Deng recognized the importance of creating an environment where players felt valued and supported. “I had guys from the beginning that committed right away, they understood what I was trying to tell them and they wanted that opportunity also to give something back and to have something to be proud of, and from our first tournament, I knew right away that this is bigger than basketball.” This tournament reinforced what they were building and was the bedrock of their vision, showcasing something greater than just the sport itself.\nTo cultivate a thriving basketball culture, Deng emphasized the importance of building a supportive environment that prioritized the players' well-being and development. He explained, “The players are the number one priority in our program in terms of listening to them and trying to fix any of the issues that we have had in the past.\" Along with cultivating a culture that values the players, Deng understood the need for buy-in from players, including those in the diaspora who had the option of playing for other countries.\nHe noted, “Players talk about how you treat athletes and how you treat everyone within your program from top to bottom. I think everybody in our federation knows where our heart is - there is no pretending within our federation, our main goal is to get this program to be successful, to unify us and also to put a message out there that we are for South Sudan and we are for the continent and that is what is in our mind.” This culture of openness and commitment helped foster a sense of responsibility among players. Deng noted that “players convince each other and also encourage each other and recruit each other and do it together, and once somebody is in our program they see it from the inside. The impact that it is making is beyond basketball and for us - we welcome those that come into our circle and have the same mindset.”\nAchieving Success on the International Stage\nDeng's commitment to building a successful program has started to yield impressive results on the international stage. Initially, he faced limited resources, but his persistence began to change perceptions. “In the beginning, we didn’t really know what direction we were going, but once we started showing the capability and the potential of it, our government has been very supportive,” Deng reflected. He praised the backing received from the South Sudanese government, stating, “I think that our government can be proud of what they have done so far, and also be an example hopefully to a lot of other African countries. Our government has supported us and our youth program, and I think in the future because of what we did, they will support a lot of other talent just across the board, not just in sports.”\nThis governmental support, coupled with the program’s success, has been instrumental in changing the narrative around African sports development and showcasing what can be achieved with dedication and hard work. Deng added, “What we have been able to do, I think a lot of people believe that it could be done across the board, a lot of people are motivated. I always encourage everyone to somehow start. A lot of times—and you see this a lot on the continent—people ask for support without really putting in the necessary work to show that the program or whatever they are trying to achieve can be successful and that by itself is challenging.”\nReflecting on the collective effort behind their achievements, Deng remarked, \"I would say I did commit to really making this happen, but there is no way that I could’ve kept going if the players and the staff and everyone hadn’t bought into it. With the success that we’ve had, we were able to gain more support, not only from sponsors but also from individuals who supported us and also the government and our President Salva Kiir Mayardit by supporting us. Now, today I can sit here and say that it has been a collective effort to get this far and we are very proud of that.”\nRoad to Paris and the Outpouring of Support\nThe journey of the South Sudan men's basketball team to the Paris 2024 Olympics has been characterized by extraordinary accomplishments and an overwhelming wave of support. Their near-upset against the USA, missing victory by a single point, demonstrated their ability to compete on the global stage\nThe team’s Olympic debut was highlighted by a historic win against Puerto Rico, which saw them overcome a slow start to secure a 90-79 victory. This win was not just a triumph on the court but another powerful statement of South Sudan's arrival at basketball’s highest level. As they prepare to face the USA once again, the team's focus remains sharp, despite the considerable media attention and praise they've received.\nDeng reflected on the feedback and growing recognition of African basketball, noting, “Just in general, the feedback—people believing in what we are doing, people really acknowledging African basketball and how far it's come—has been very positive. Growing up and watching the Dream Team take on Angola or other African countries, often winning by 50 points, it’s clear the game has evolved. The success of any African country is seen as a victory for the entire continent. For me, it’s crucial to remind my players to stay grounded amidst the praise. We must maintain the same hunger that brought us here, challenging and influencing each other to stay focused on our goals.”\nSouth Sudan will take on Team USA again tonight, with Deng acknowledging the challenge, saying, “We know that it is a difficult task but to come this far and to be respected and to play the best in the world, is a good place to be in and it is a good test to have. We are looking forward to playing as hard as we can again and we'll see how it goes”\nOutlook on the Remainder of the Games and Beyond\nAs South Sudan continues its Olympic journey, the team remains committed to changing the narrative about their country and showcasing their talent. Deng emphasized the importance of using their platform to inspire and educate, stating, “To be a role model, you don’t need to fake it. We are playing not only for South Sudan but also to change perceptions about our talent and potential. Our success is a responsibility we embrace, and we hope to see South Sudan excel in other areas as well. By continuing to shine, we encourage others and reinforce the progress we’ve made.”\nThe team’s focus is on taking each game as it comes and maintaining their momentum. Deng added, “We need to keep taking it step by step. Despite the negativity and scepticism we’ve faced, we see every challenge as an opportunity to educate and prove ourselves. We’re here to compete and make our people proud, but we’ve already achieved so much by raising awareness of our story. Now, we must continue to advance, game by game, and show the world what we’re capable of.”\nFuture Aspirations and Development\nDeng’s vision extends beyond immediate achievements, aiming to set a precedent for other African nations. He is optimistic that the success of the South Sudan Basketball Federation will encourage similar initiatives across the continent, emphasizing that substantial progress requires both vision and dedication. His commitment to excellence and the collective effort of all involved promises a bright future for South Sudanese basketball."
    },
    {
      "url": "https://www.forbes.com/sites/sindiswamabunda/2024/09/30/patrick-gardner-embracing-a-unique-offseason-and-exhibit-10-contract/",
      "text": "What does it take to remain competitive in the fast-paced world of professional basketball? While many NBA players enjoy a leisurely offseason filled with travel and relaxation, G League players like Patrick Gardner see this time as a vital opportunity to refine their skills and showcase their talent on a global stage.\nIn an interview with Forbes.com, Gardner shared insights into his unique off-season experiences, emphasizing his commitment to continuous improvement and the significance of representing his Egyptian heritage. As he prepares for the 2024-2025 season, his offseason has been anything but ordinary, marked by impressive performances in international competitions that highlight his dedication and ambition.\nAs he prepared for the 2024-2025 season, Gardner had a unique offseason filled with international basketball. He had a standout performance in the Basketball Africa League (BAL) and played a crucial role in Petro de Luanda's Intercontinental Cup campaign. Now, he's getting ready for his second Exhibit 10 contract with the Long Island Nets, an experience that is shaping the early stages of his professional career.\nWhat is an Exhibit 10 Contract?\nAn Exhibit 10 contract provides players with a valuable opportunity to remain in the NBA ecosystem while refining their skills in the G League. Players under this contract who are released by their NBA team and then join its G League affiliate for at least 60 days receive a financial bonus as part of the agreement.\nFor Gardner, this contract presents both a challenge and a stepping stone. \"This is my second Exhibit 10 contract, and I feel much more prepared this year than I did last year because I am entering year two,\" Gardner explains. \"I know what to expect, but at the same time, you have to be ready for anything. Now I’m working on being in the best shape of my life, fulfilling my role, and preparing for the highs and lows of a full season.\"\nBest High-Yield Savings Accounts Of 2024\nBest 5% Interest Savings Accounts of 2024\nGardner’s mindset reflects the uncertainty—and potential—of being on the verge of an NBA breakthrough. \"An Exhibit 10 means I’m under the Brooklyn Nets’ umbrella. I get a training camp opportunity and a bonus. After that, they’ll either release me or keep me, but I’ll most likely be with the G League team. It’s a chance to be called up to the NBA, and I’m just hoping for that opportunity.\"\nA Key Role for the Egyptian National Team\nDuring the journey in his first season on the Exhibit 10 contract, Gardner took the opportunity to represent the Egyptian national team in the Afrobasket qualifiers. Gardner averaged 14.3 points and 5.3 rebounds, further demonstrating his ability to stretch the floor as a 6'11\" center.\nReflecting on his role with the national team, Gardner said, \"Being Egyptian, I always wanted to play for the Egyptian national team, but growing up, I never thought that was possible. Once I started doing it, I realized that it was a dream come true. Playing for a country that represents me, my mom and my family is truly an honour.\"\nHe later participated in the Olympic Qualifying Tournament for Egypt, but their journey ended early. Nonetheless, Gardner's passion for representing his heritage continues to motivate him. \"It makes me want to compete more and play harder. I do everything I can to bring recognition to Egypt, and it gives me a lot of motivation.\"\nPlaying for Al Ahly in the BAL\nDuring the offseason, Gardner embraced yet another opportunity to represent his Egyptian heritage by competing in the Basketball Africa League (BAL), Africa’s premier men’s basketball competition co-organized by NBA Africa and the International Basketball Federation. Gardner suited up for Al Ahly, Egypt’s most iconic club and the reigning BAL champions at the time. \"Al Ahly was a club that I grew up knowing and rooting for, so to play for them was an honour, and I’m really glad I did it,\" he reflects.\nOver eight games in the BAL, Gardner averaged 10.5 points and 4.6 rebounds, shooting over 50% from the field. His ability to come off the bench and provide length, rebounding, and perimeter shooting proved invaluable. Reflecting on his time in the BAL, Gardner shares, “Playing in the BAL was a great experience. There were a lot of high-level players. It was great for me to play at this level.\"\nHe emphasizes that the intensity remained consistent throughout the tournament: \"There wasn’t much of a difference between group play and playoffs. Many of the teams we played were good, and if you don’t come ready to play, thenanything can happen.”\nSeason 4 of the BAL was one of the most exciting and competitive, culminating in Rwanda. The competition saw a noticeable increase in intensity, with Al Ahly, the reigning champions, being knocked out in the quarter-finals, showing just how high the stakes were. Despite this, Gardner remained proud of his efforts and growth throughout the tournament.\nPetro de Luanda and the Intercontinental Cup\nAfter the BAL, Gardner was recruited by Angola's Petro de Luanda to compete in the FIBA Intercontinental Cup. This prestigious tournament features the champions from each continent and one representative from the NBA G League. Formerly known as the FIBA World Cup for Champion Clubs, it unites the world’s top basketball clubs to crown the best team globally. Excited to join, Gardner said, \"I was excited that they wanted me. I wanted to help the team as much as I could for their training camp, to practice with them, and play in the games in Singapore.\"\nGardner's adaptability shone through during the tournament. In the final game against Argentina’s Quimsa, he recorded an 18-point, 10-rebound double-double, helping Petro de Luanda secure a win. He emphasized the importance of competing at this level, stating, \"With the Intercontinental Cup, it is one team from each continent, so each continent has different styles of play. To see that and adjust to that was a great opportunity.\" He added, \"I learnt a lot from how they played so in the future when we play those teams again we could be better prepared and match up with them. Because you’re one of the best teams in the whole world and you want to keep on reaching that level, to be the best so to play against them is how we’ve gotta get to the top.\"\nA Journey Marked by Growth and Perseverance\nGardner's dedication to being prepared for every opportunity has been crucial to his growth. Reflecting on his journey, he shares, \"I didn't have specific moments, but I approached each day as it came—learning from coaches, drawing from my experiences, and working hard. As a professional basketball player, you have to take everything seriously, whether it's practice, the weight room, or shooting on the side. I was able to put that together, and I think it translated well toward the end of the season, allowing me to play with confidence.\"\nAs he gets ready for the 2024-2025 season, Gardner remains focused on making the most of every opportunity. His journey, characterized by continuous growth, serves as inspiration. \"This is the whole reason why I play—to motivate others. If I can do it, I believe that others can too because they see my journey. My biggest advice is to never give up and seize every opportunity.\"\nFrom his time in Egypt to his experiences in the BAL and Intercontinental Cup, Gardner continues to develop as a player. \"In the next few weeks, I'm going to be training and getting my mind and body ready for the season—focusing on mobility, recovery, weightlifting, conditioning, and skills training.\"\nWhether playing for Egypt, representing the Long Island Nets, or competing in the BAL, Gardner is resolute in his pursuit of his dreams. While he acknowledges that there may not be singularly special moments, each step in his career has prepared him for the challenges ahead. With a second Exhibit 10 contract, he's ready to prove he belongs at the highest level."
    },
    {
      "url": "https://www.forbes.com/sites/sindiswamabunda/2025/07/09/bal-stars-aliou-diarra-and-jean-jacques-boissy-selected-in-nba-g-league-international-draft-after-dominant-seasons/",
      "text": "The Basketball Africa League (BAL) was established with a clear vision: to create a professional pathway for African talent to reach the world’s premier basketball stage. This vision is coming to life as two of its brightest stars, Aliou Diarra and Jean Jacques Boissy, take significant steps towards their NBA dreams.\nBoth players were recently selected in the NBA G-League International Draft, shortly after earning NBA Summer League opportunities. Their rise signals a pivotal moment not just for their careers, but for African basketball as a whole, proof that the BAL is emerging as a credible pipeline to the NBA’s global ecosystem.\nFrom BAL Dominance to G-League Prospects\nAliou Diarra | Texas Legends | Two-Time BAL Defensive Player of the Year, All-Defensive and All-BAL First Team Selection\nMalian forward Aliou Diarra was selected first overall in the G-League International Draft by the Texas Legends, the affiliate of the Dallas Mavericks. Known for his dominance on both ends of the floor, Diarra was named the Dikembe Mutombo Defensive Player of the Year for the second time in his BAL career.\nDiarra had a stellar 2025 campaign, helping Rwandan champions APR secure third place. He averaged 17.4 points, 11.6 rebounds, 3.4 blocks, and one steal per game over eight appearances, while maintaining a 55.6% field goal percentage and posting five double-doubles. His efficiency rating was among the highest in the league at 27 per game, underscoring his impact on both ends of the court.\nRemarkably, despite his physical defensive style and nearly 30 minutes per game, Diarra never fouled out. He also set a BAL record with eight blocks in APR’s narrow 77-74 win over Nairobi City Thunder, surpassing the previous record of seven set by Anas Mahmoud and Khaman Maluach in past seasons.\nIn his first season, winning the Defensive Player of the Year (DPOY) award in 2023, Diarra recorded eight double-doubles, leading Stade Malien to a third-place finish. He also earned a spot on the Milwaukee Bucks’ Summer League roster that year. Now, following his call-up to the NBA Summer League with the Dallas Mavericks, his selection by the Legends positions him to continue progressing in the NBA development system.\nJean Jacques Boissy | Memphis Hustle (traded to the Windy City Bulls)| Season 5 BAL MVP, Leading Scorer, All-BAL First Team and All-Defensive Selection\nSenegalese point guard Jean Jacques Boissy, the 2025 BAL Most Valuable Player and leading scorer, was drafted fifth overall by the Memphis Hustle and has since been traded to the Windy City Bulls which is the G-League affiliate of the Chicago Bulls. Boissy, who is also playing in the NBA Summer League with the Milwaukee Bucks, delivered his most impressive campaign to date with Al Ahli Tripoli of Libya.\nThis year, Boissy was visibly in the best physical condition of his career, armed with a different mental approach to the game that fuelled his MVP run. Coming off the bench, he averaged 18.9 points, 3.4 rebounds, 2.2 steals, and 1.9 assists per game, leading his team with consistency and versatility.\nIn previous BAL campaigns, Boissy was often tasked with shutting down opponents’ best scorers. This season, his role shifted from game to game, and he rose to each challenge, maintaining his defensive edge while expanding his offensive repertoire. His adaptability earned him spots on both the BAL All-Defensive First Team and the BAL All-First Team, cementing his reputation as one of Africa’s top two-way guards.\nFor the Windy City Bulls, Boissy’s mature playmaking, defensive tenacity, and scoring versatility could make him an immediate asset in their guard rotation, particularly as the G-League continues to prioritise developing dynamic playmakers for NBA systems.\nA Pivotal Year for BAL Players\nWhile BAL players have previously joined Summer League rosters, few have made a lasting impact due to limited minutes and adjustment periods. This year feels different. Diarra and Boissy arrive with major accolades, record-setting performances, and proven leadership in Africa’s premier basketball competition.\nTheir G-League draft selections, combined with NBA Summer League exposure, mark a significant milestone for the BAL as a credible pipeline for the NBA and its affiliates. It comes amid a year of growing global recognition for African basketball, following Khaman Maluach’s selection as the tenth overall pick in the NBA Draft and Rueben Chinyelu’s NCAA championship with the Florida Gators, both of whom spent time within NBA Academy Africa structures linked to the BAL ecosystem.\nWhat’s Next?\nFor Diarra and Boissy, their immediate focus will be on delivering strong Summer League performances to build momentum heading into their G-League seasons. Success there could open doors to training camp invites, two-way contracts, or full G-League deals that keep them firmly within NBA development pathways.\nAs Aliou Diarra and Jean Jacques Boissy take these next steps in their professional journeys, they carry with them not only personal dreams but the aspirations of African basketball. Their achievements are a testament to what is possible when investment, opportunity, and talent align – and proof that the bridge from the BAL to the NBA is becoming stronger with every season."
    },
    {
      "url": "https://www.forbes.com/sites/sindiswamabunda/2025/06/09/the-story-behind-2024-bal-mvp-and-dpoy-jo-lual-acuil-jrs-return-to-bal/",
      "text": "One of the familiar faces returning to the Basketball Africa League (BAL) Playoffs currently underway in Pretoria, South Africa, is Jo Lual-Acuil Jr. He didn’t have to come back; after all, what more was there to prove? In Season 4 of the BAL, Acuil swept the league’s top individual honours, including Most Valuable Player, Defensive Player of the Year, scoring champion, and selections to both the All-BAL First and All-Defensive Teams. His dominance was clear and unquestionable, yet those accolades were just the latest chapter in a career shaped by some of the world's toughest basketball environments.\nA seasoned professional with experience across Australia, Europe, the United States, and Asia, Acuil’s résumé also includes an NBL championship with Melbourne United in 2021. However, when the season ended and his team fell just short of a championship, something deeper lingered. In an interview with Forbes.com during the BAL Playoffs in Pretoria, Acuil shared that it wasn’t unfinished business in the usual sense that brought him back, it was a shared purpose, brotherhood, and a desire to play alongside family.\n“Yeah, this guy over here,” Acuil laughed, gesturing to Majok Deng, who was seated nearby during the interview. “Majok and I talked about it in Kigali after that last game. We just wanted to play together. Of course, you want to win the league, but more than anything, we wanted to have that experience of being on the same team.”\nThat desire to reconnect and pursue something meaningful together brought him back to the continent and to a league that continues to grow in intensity, talent, and international attention.\nWhy Al Ittihad Was the Only Call That Made Sense\nOn paper, Acuil had options. With pro stints in Turkey, China, and Australia, his résumé was already stamped with global success. But Al Ittihad offered something different. Something personal. When the Egyptian powerhouse came calling, Acuil listened. They had already signed Majok Deng, and the opportunity felt rare, more than a roster move, it was a reunion grounded in trust, chemistry, and an unfinished storyline.\n“I knew I wasn’t going to be able to make the first conference games in Rabat, and they were okay with it,” Acuil said. “Some teams were hesitant because I wasn’t going to be there for the conference games, but this was the one team that was fine with me coming in late.”\nAcuil wasn’t available for the early stages of the competition, missing the Kalahari Conference entirely, a stretch in which Al Ittihad went a flawless 6-0. With just one practice under his belt before suiting up, Acuil immediately sensed that the team was built on and was working towards one common goal, setting aside individual glory.\n“Everyone seems very one-track-minded. Everyone wants to win the League,” he observed. “No one’s really too worried about stats or individual accolades. Everyone kind of has one goal in mind… so yeah, it’s been kind of refreshing being around them.”\nAn added layer to this team dynamic is the opportunity to create lifetime memories to later reminisce on with Deng, who he once again has been able to suit up with.\n“Being able to be out there with somebody that you consider a brother, these are things that, when we get older, we can sit down and just talk trash to each other about.”\nNo Redemption Arc, Just Enjoying The BAL\nLast season, Acuil and Majok helped lead Al Ahly to the BAL final, only to fall short of the title. The sting of that loss was real, but so were the lessons it left behind.\n“My mindset stays the same, last year is last year. We lost. It is what it is,” Acuil said, steady and composed. “Obviously, it hurt in that moment, but over time, you heal and move on. If it’s meant to be, it’s meant to be.”\nThis year, he’s not chasing ghosts. There’s no weight of redemption, just a calm focus and a renewed sense of freedom.\n“I’m not putting too much pressure on winning,” he added. “I’m just trying to enjoy the League as much as I can.”\nAcuil has also seen how far the league has come, and where it’s headed.\n“Yes, 100%,” Acuil said when asked if the league is earning international respect. “The only thing that’s tough for the BAL is the timing of the tournament. But as far as the players, the calibre is getting better every year.”\nStill, he remains pragmatic about the league’s hurdles.\n“With players in Europe and other places, it’s hard to bring the best of the best here because of the scheduling,” he noted. “But it’s definitely growing.”\nStaying Grounded When The Stakes Are High\nDespite all the buzz and Al Ittihad’s unbeaten streak, Acuil remains remarkably unfazed by the idea of pressure.\n“Pressure has always felt like an illusion to me,” he said. “It’s something that comes from outside, from what people say. We just go out there and play basketball. If we win, we win. If we don’t, we don’t. It’s really that simple.”\nFor Acuil, pressure isn’t about buzzer-beaters or championship moments. It’s something far heavier, and far beyond the court.\n“Pressure is people out in the world who can’t feed their kids, or those battling illness, cancer, that’s real pressure. Basketball is a privilege.”\nThat perspective, forged through experience and gratitude, keeps him grounded when the stakes feel highest. He doesn’t just play to win, he plays to stay present.\n“You win the game, you lose the game, it doesn’t change who I am, or who the coach is. Pressure is nothing. This is not pressure.”\nThat same clarity has helped Acuil remain grounded and draw back from past experiences to help guide his team when it matters most, like in Al Ittihad’s overtime thriller against Morocco’s FUS de Rabat, a game riddled with tension, lead changes, and late-game chaos.\n“Personally, the growth comes from just being as present as possible,” Acuil reflected. “Shutting the noise out, figuring out the next play, finding ways to be effective.”\nEven after a mental lapse late in regulation which led to FUS Rabat’s Nisre Zouzoua scoring the equalising three-pointer that sent the game into overtime and the crowd into a frenzy, Acuil managed to reset.\n“At the end of the fourth, I had a mental lapse,” he admitted. “Going into overtime, it was just about reassuring our rules, making sure there were no more slip-ups.”\nThat accountability set the tone. With a narrow lead in OT, execution became everything for the team who secured a hard-fought 86-83 win.\n“Closing the game out, the coach did a good job communicating with us. We were up three, so we just wanted to play the foul game and kill the time that way.”\nThe Question Of What Is Next\nWhat began as a simple wish to share the floor one more time with his brother Majok Deng has turned into something much bigger. With Al Ittihad now through to the semi-finals and firmly in the title conversation, it’s natural to wonder, could this be Acuil’s final chapter?\nA championship would be a fitting sendoff. But Acuil isn’t thinking about endings just yet.\n“I don’t know,” he said with a smirk. “We’ll cross that bridge when we get there. But I don’t think it’s time to write me off. I’m here, so we’ll see what happens.”"
    },
    {
      "url": "https://www.forbes.com/sites/sindiswamabunda/2025/06/11/nuni-omot-takes-olympic-lessons-into-the-2025-afrobasket/",
      "text": "In an era where sports continue to transcend boundaries, South Sudan’s debut at the Paris Olympics stands out as a powerful testament to resilience, hope, and national pride. On the hardwood of Paris, the world’s youngest country did more than just compete, it announced its arrival. Among the trailblazers was Nuni Omot, a standout 6’9\" forward who averaged an impressive 16.7 points, 3.3 rebounds, and 2.7 assists during the Games. For Omot, the moment was far more than athletic achievement, it was the embodiment of identity, purpose, and belonging.\n“I had dreamed about moments like that but it’s different when you’re actually living it. When the flag is on your chest, and the world is watching,” Omot shared in an interview with Forbes.com during the BAL Playoffs, currently taking place in Pretoria, South Africa where he is currently competing with Rwanda’s APR.\nBorn in a refugee camp in Kenya and raised in Minnesota, Omot’s journey mirrors the broader story of South Sudan itself, defined by adversity, endurance, and an unwavering pursuit of recognition on the world stage. As the team stood shoulder to shoulder with global giants, their presence was a bold declaration: We are here. Not just present, but worthy. Not just surviving, but contending.\nOmot confirmed in the interview that he has committed to representing South Sudan at the upcoming AfroBasket tournament, a continuation of a journey that’s no longer just about basketball. It’s about building something lasting, inspiring a new generation, and showing the world that South Sudan’s rise is only just beginning.\nWe Deserved to Be There\nFor Omot, the Paris games were a culmination of years of sacrifice, grit, and belief, fuelled by a relentless pursuit of representation.\n“People don’t realise how special the Olympics is until you’re in it. You’re around the best athletes in the world, and you realise: we earned this. Some people never get that chance. For us, it was long overdue.”\nSouth Sudan’s journey to the Games wasn’t supposed to happen this fast. Just over a decade ago, the country didn’t have a pipeline, or a presence in global basketball. However, under the visionary leadership of Luol Deng, former NBA All-Star and current president of the South Sudan Basketball Federation, the program began to take shape.\n“That’s where it all started, with Luol,” Omot says firmly. “He had the vision. But more than that, he built something we could all believe in. It’s easy to have an idea, but when the whole team buys in? That’s when it becomes real.”\nThe team's meteoric rise has left many in the international basketball community stunned. However, Omot isn’t surprised. “We’re a team of competitors. We don’t care about how it looks on paper. We know who we are. We’ve been through a lot. And when you play for something bigger than yourself, it shows.”\nFrom Underdogs to Standard Bearers\nWith the Olympics behind them and the 2025 AfroBasket on the horizon, South Sudan now finds itself in an unfamiliar position: the hunted, not the hunters.\n“At the Olympics, people were cheering for us. They saw us as the Cinderella story,” Omot says. “Now, they’re coming for us. Everyone wants to beat the number one team in Africa.”\nIt’s a shift Omot doesn’t take lightly. While the support in Paris was overwhelming, from fans, media, and even other athletes, the next phase of the journey demands even greater focus.\n“We’ve got to stay grounded,” he says. “Remember what got us here. The unity, the discipline, the work.”\nThat humility is matched by a rising sense of responsibility. As one of the team’s veterans, Omot is preparing to take on more leadership, both vocally and by example.\nLessons Learned From Paris\nFor Omot, the Olympics weren’t just a historic milestone for South Sudan, they were a masterclass in what it takes to compete at the highest level. Now, as he looks ahead to AfroBasket, he’s bringing those lessons with him.\n“Just playing against the best basketball players in the world, NBA Hall of Famers, guys who will be first-ballot, it really puts things into perspective,” he says. “The game is global now. When you face that kind of talent, you see the standard. Their discipline, their professionalism, that’s what sets them apart.”\nOne of those moments came against his basketball idol, Kevin Durant.\n“To go up against him and see that level up close, it confirmed everything I believed,” Omot says. “There’s a reason he’s one of the greatest. Their names will live forever.”\nThe takeaways weren’t just about talent, they were mental. Omot knows the margin between winning and losing often comes down to mindset.\n“Regardless, if you make mistakes, you can’t ever let that deteriorate your mindset,” he shared. “Stepping on the floor, no matter who you play, you should always feel like you are the best player.”\nThat unshakable belief, the same one that carried South Sudan to the Olympics, will be central to their AfroBasket campaign. For Omot, it’s not just about bringing talent to the floor; it’s about bringing a championship mentality, shaped by the highest level of competition the game has to offer.\nBasketball, Africa, and the Power of Representation\nSouth Sudan’s Olympic debut is part of a broader narrative: the ascent of African basketball. The continent has long been rich in talent but starved for opportunity. That’s starting to change.\n“There’s so much talent here,” Omot says. “People are starting to notice. It’s not just about the NBA anymore. We’ve got guys playing in Europe, the G-League, Asia, and of course, the BAL.”\nOmot has played in all of those places, but it’s his recent return to the Basketball Africa League (BAL) with APR of Rwanda that speaks volumes about where his heart is.\n“People ask me why I came back to the BAL. I tell them: because I care about this place. This is home. I want to grow the game here.”\nIt’s not just patriotism, it’s a long-term view of impact.\n“Whether it’s Rwanda, Kenya, or South Sudan, it’s all Africa to me. And if I can help the game grow, if I can show kids that you don’t have to leave the continent to be successful, that matters.”\nChasing Another Title, This Time with APR\nHaving already won a BAL title, Omot knows what it takes to build a championship team. At APR, he’s been brought in not just for scoring and size, but for experience and leadership.\n“I joined APR because they were honest with me,” he says. “They told me how I could fit in and what they needed. I didn’t want to step on anybody's toes. I wanted to add value.”\nAPR headed into the BAL playoffs with momentum and ambition, and will compete for a podium finish come Friday. Omot has made an immediate impact, averaging 19.3 points, 2.3 assists and 5.3 rebounds per game.\n“Defense wins,” he says without hesitation. “Everyone talks about scoring, but it’s stops that win games. The teams that limit mistakes and control the boards, those are the teams that win.”\nWhat’s Next?\nFor Omot, the road ahead is as much about impact as it is about accolades. Beyond preparing for AfroBasket, he’s thinking generationally, about what it means to give back, to create pathways, to change lives.\n“There’s just so much untapped talent here in Africa. One day, I hope I can do something, maybe be that scout, because I see what’s possible.”\nIt’s no longer just about South Sudan being seen; it’s about Africa being believed in. For Omot, that belief is the foundation of legacy. And if Paris was South Sudan’s grand introduction to the world, then this next chapter is about building something that lasts, on the court, across the continent, and far beyond the final buzzer."
    },
    {
      "url": "https://imageio.forbes.com/specials-images/imageserve/689a570d2524c605b7d854d9/0x0.jpg?format=jpg&crop=2112,1188,x0,y0,safe&height=900&width=1600&fit=bounds",
      "text": "���� JFIF ��ICC_PROFILE lcms mntrRGB XYZ � ) 9acspAPPL �� �-lcms desc � ^cprt \\ wtpt h bkpt | rXYZ � gXYZ � bXYZ � rTRC � @gTRC � @bTRC � @desc c2 text FB XYZ �� �-XYZ 3 �XYZ o� 8� �XYZ b� �� �XYZ $� � ��curv ��c�k�?Q4!�)�2;�FQw]�kpz���|�i�}���0���� C %%!(!!(!;/))/;E:7:ESJJSici����� C %%!(!!(!;/))/;E:7:ESJJSici����� �@\" �� �� N !1AQa\"q�2���#B�Rbr��$3c���%Cst���45DSTd��&6U��� �� = !1AQaq\"23�#BRbr���$4�%5CScs���� ? �e ���� QB(+0���, �\"�(ht �`0) HC��� X@4C�*�H����` �>��HD�R)�!�h�P�@ �:h�H(iXIR�� e ��iP�C�:C��� �, ��|�@H��B�A@* e L(�i�2���aL� i�2� �� \"��t &�R( �AH�D�D�$ *Bh`�� 0 �P �t �40$ %U�@�����PA@&*ePQ! P�(@U F�a@� �}�HC% �% 0�@��$(� �(t���PF�LTXQ)E!A@@B�&��H�PP� B�T $EEE11t( �HB� �P�\"�@H�,D �0d�hE��\"�@N�(@!�PP� E����E �D�@1�) �c0�b�R 2���b : $ H��C#bQAAH `� : �t�tH �P� � �@2��!�!cR E��I �tEP� t *� �RhtP4�ER @MT: @� h(��4U!S c 0*���A@@A@M0�U ��\"� �T�EPPB.�����( �9�(�[i\"P����\\?B�.x��-�<���Xa9�>5ٽ���-v&R�V��֣�<[4ۄ�z$r��+��-^G~����ω:sV]������K�s_ڲ�lC��\\k�:̕�m���(��q|J*SSK�����M8��(Ko�n��І�^��hu��f���N��f0E ���aD �C�PQAD�\"�(ALci�1����B*�RGC��AEPP4��(MXQT��: �@TV*( T0hT] ��t�� ch($��� EE�R] �H ��H� ( �.�@C�@a@KB�� &�E B � C@�B H��PB*�HB(@HQT*hED� @* H��!�\"�@H�\"4 ��$2�%Xآ�C�B�CU �\"� R �$P H tC@PC@� 0 T4QF� :P ��E%���`=�ACPn��T2��!hE �0���C������ BE������ P� P�} ��0��C��QCh TB� ���ǸP ��$ ��$ ��_(r�W(� ������Q@Ш�'(�7&��Z0e͏\\�$���'�|a�������t��gθ���)˛,�O�Gd@�'�I)Cy$�������x��e��)z�Dy{w�)�ˑܥ'�vcj����]ڽ�ɥ[cgL�$�R}�+��q˒M:u���t5SL���A[��WNȎ�jd�vl�5�L���7�i��.�\\��J/�3�p���=Z��5� ��V����k��,]�W�ge{��gͦ��,�-wL���r�Xu�g�Ȼ|�[o�����a͋\"�i;N��JJ��C�A�*� T:*���l� ����t���{����} �������E|�� �c%��������B��EA� ��E�PL\"���@�AFM�@Eк >��.�PQtPQt�c��ڡnШ�b� FJ����7(�*DUX� *����(b��P�hU@G� \"�� \"�EЀ� (T� � &�P�\"��� ��$E=��D�- $CϢ�d�0bH`40��E\"AC[��\"c���C@�TE!\"� u( `0��0�`�4*�2@1�T�1� �@2=�����PF�=�@2����{��` ���� �C�D��t2�A@ *�@HQi���@�!�� *���.��� � ���`@A@ET�BhTX�� m��7�x��2Ł)�V����x�����Mm�)�ϗ�kx��1Kˆ����W�)f�����,2�R���k�b�iVIɴ�l�Z^�LzY�Kcv:4뚊M��'Ȼ�f_�d���j�C�_ ��^�Z1�ή����3>.��n��و����Jǳ���M��S�BTn�BR+����>�r�㋺t8� {�-�?TM+�s���7�֟�Uj��3+����?Uz+�y��9�M�����[��ZL�\n���G���K�*[�� #����˛M���7E��R�U�Q;>u�C41�r��e'�G��(�\\]�E���$����!4:+�M0�PAA(���(��T MM=�a^���� �, �, ��BPP�B(`@� �^��AElPQt:FJh�B�1Ш�\nA@@��X� ���(hEЀ�Qb(FAP���@@��@M��D�V0h�\"����b�4*)��;��I\"DP��*�CC@]F ��]@c��I�\n� (C�Ћ@`1БH��t0�@�\"�dh��c��p �CHt���0�B�t\n�CH�: �C��\n�C��@�)C���� PQT��(�$M�C����t��t0%!��t�S*����r�( � t] �1��\n(eP�td�PAL�w��@cf,�qე䢽X�憟�.�Y�_��Zܒç�X�u��>#�[�)i�sq�m9����YO,�Nݕ(����ͧ��~ߙY��13\n���uH�Caش�\"��r0��u�b!�4�k��� � �?96�1��ck���)�:Ev�J�%�a�L�Iц�͉C��ɹ;�f$��'�eQۡ\\�1�GL�E��\n�Le�E��E�IFm<��fsg��.�vv�+2Re��\nZ�0�qK����\\������\\�쯺F��F�.d�G�͆x��]�\"�aj�_�t��Z�ˉ�Y�|7þ%�p��ǒNZv�^�}�M�Ū���d�[�U�P�h�PP\"S��$�PQ����\n.���\n2PR��GE4_(���:.�PB��(�.�����( ���(�(A@MA@MA@M\n���#�\\�J\n(QtP��(U����B��FJ��FJ��Qm\n����2P� �\n�%��B�Ǹ��� T]\n�DQ��Q\"B� E�R(E�,b��B2@H�d�� H�B HP\"X�b�i�D �(�w41!��(H��@@� *�PC�E>���QK� Hi( ` >��\"�=�ZBO�C� tB;��d�PB E �:D ��@HE$\"�����!��T1��\nEP�AA%CH���C��DAEV��h�i��4] C(( �H�@��&�EP&��ht1��B��4P2DЋˣ��$�n�y#NN�Wvȑ�|]ƥ,�E�m$�:��|�g�r�j6���˓$���R�*� ج�1`����ut��f�c�UtGC\\R2���8�<����}]��f~�%�!u2$Fֈ�I��Z2��̔_r�i��w��]�S}���Vm��Nl�嗡�uTL�WK�&��k���ٱ(���b��{2��;�C`��3���_+��[ZhJ4���85i�]�U��G�m\ni*f9<�;܉Az�V��]t3�W��CVY�n/�5�zXe�u��.���Qi�Vѷ��9[M��<~ZML4����=��y�n' ���_�OuћD�\"\\��K��_2M>�ȑ��ЬY%yp��h����T:¥@��tH�`����AEК%T�QB ���� T:@PPr�(r�4U\n�\n����\n�P��\\�@H��M�@M�� &�XPB�%\n��4]@c�Q���&��B��(FJ&���EШ`d�PM(�ZD�,E *,�&�]E�PB.��ѐ@c�Q���1Q`P�� I,��@�)h��( Y% H��0���H�Pb) �B�0��H � 40c(b�@*@$1�C ���4=�H�GCP�tPCH��T:,(AEl:P�*��CH�t0&�\"�d�1�@!��t�QH`M�: MAL\n*�Q\"h(� &���\n���E�Q\n��g��[��Gx#+�(��-�>���GK�͕��`υ7�S�&d�S��IZ��ke�2F\nE�*�k2��PI]џ��]���e�a�/U�f�c�Iv1EFT��7i.T�9tV�ՙ%�\"�)2�\"B�6!��&g�Y^9y���l��-�-���0�m��+ܮ֍�Q�E���:i۪��m6�;'�W��dJ+�\"Q_�mɪ�N��-��KZP�n�!B�^��$��َ*2{2����~�I5FF��i�ZWwL$�3Zx�����t���މVb��S�#a�&��ԟ\n:\n2J\"��,�+�6�\n�e[��4��jq����K&�c�f��/tp�nR�/Y�f7�߆���o�;�I��{�0�\\q�]��&�=�f��xS�� Hp�2�s��^���c�ҡ�RC,��C���&�E�P6�AD��(!]�h(�\n(T�\nt�QTM M MAA�\n*�@�P�\nM�\n�\n�\nMA@E\n���Bh�B�\"���h[� (�(TX�+�h���TEєT4���(t*2Q4�4d�hBh�B�1�4ehM��EЀ�$�Bh�4X���� CDѐ�H�,@Add�&�,T�&J&��D���<��RB)\n��\n\"��H0`0C�E ACH�) $R��4(cC IT (�E`5� H��P�� Hc� P� E �� �,��*�TUt���h4�0(\"�* [�`*��� t:$*\n( ���T4�2�(�4]41��@: C�\n���H)���!�_�z~�GiN����t�Ӗ'.^Z���?���˧�]g��yXy���)��\"��]��+DnQ�x璂Q�[wե�iG�yi����L.r�S�U��=.�|R��mS2�tV�:7+��� S3�W]���ç�Gw�ާ'&E9Z�| ?��Re�F����*��I6ģ�3���Es-��6�\n)C��)4�ʬIo��2�+T�_2R�l>&�{�6zӾ���Iv�ՙ'.�\n�TUI����1�3�5#.V�[�TZ�otD�kD�']�C��>d�3$S���&'�S�ϦƄ���s~r�U���i��&�m��{ݛ>\\R%A��N��[w1�l�x���)D�wg=�Z+k�sݎ��C���'j� E�l�<|�I��ѥ��8��VG��j�;C��#][>��=�J95W-��\"x�%�v� ��T$⤝�ѵe�h�w�j���t��F��6CC`���&�� ���`�&�LvH��%B((��\n���eAC\n6�*����t* H�tJ�M�@��AD*��%B,M\nU<�\n�$(l�PPJ(T]PP@]`X���ɠ&�E b��@M ��|��%\n��B�!/��2\n���4e�41Qt6�2\n��*.�@A- `EFF�h�����К(L����H}\"��D�\"Ж�\n-�hhc����4P �\nH\"���@R $1��\"�\n$P\nt!��I�E P�K�� �đ`�$��C�ʡ�`R!�U J�Ht:$:0\n�H7) %n4�EPEPQT�U\nPQT #��t�P�t�TH{�@-��0&�0�\n�:\n�T��((� E� �aA]� ��*����2a�M���o�y�0�,p�)s�ʔ��R=�t�ɫ��UIɿJ5����\nx�cOg.�eii_0��:�IFQ��W��>�\n���࿙K�c���i��::��8�W�W3�C)t��ߗ=3S[�?�gP���g�ςQRWww�8�O����%��(��%^��ҷ[.�����ڂ|���5�_�\";�+���>]��"
    },
    {
      "url": "https://www.forbes.com/sites/sindiswamabunda/2024/07/21/bright-stars-shine-as-south-sudan-nearly-upsets-team-usa/",
      "text": "In a game that captivated basketball fans worldwide, South Sudan nearly pulled off a stunning upset against Team USA, revealing the shifting dynamics of international basketball. Featuring a roster filled with players displaced by civil war, South Sudan, known as the \"Bright Stars,\" showcased their resilience and talent, pushing a star-studded Team USA to the brink. What happened Saturday was a gentle reminder that no corners can be cut anymore, even with a star-studded roster. The teams the U.S. may face in the Olympics are dangerous enough to demand the Americans’ full attention.\nThe world got to know the Bright Stars, who were favoured to be beaten by 41.5 points. Despite dismissive remarks from former NBA star Paul Pierce on FS1's Undisputed, questioning their height and qualification for the Olympics, South Sudan proved their worth on the court. Their near-upset exemplified the growing prowess of international teams and hinted at a more competitive landscape for the upcoming 2024 Paris Olympics.\nIn their second-to-last preparation game for the 2024 Paris Olympics, South Sudan—the top team in Africa—nearly pulled off a stunning upset against Team USA. This game, featuring what many are calling the second coming of the \"Dream Team,\" was saved only by a LeBron James layup with 8 seconds left.\nFor two full quarters, South Sudan was the faster, more disciplined, and better-shooting team. They built a 16-point lead in the first half, going into halftime with a 58-44 advantage by holding the Americans to 1-of-12 shooting on 3-pointers while making seven treys themselves. South Sudan finished the game with 14-of-33 from 3-point range, which significantly contributed to putting the Americans in such a hole.\nBest High-Yield Savings Accounts Of 2024\nBest 5% Interest Savings Accounts of 2024\nThe Bright Stars led by 14 points at halftime, regained a one-point lead late in the fourth quarter and had a chance to win on the final possession. In the last few seconds, Carlik Jones missed a floater, Wenyen Gabriel missed a putback, and Anthony Edwards stripped the ball from Gabriel, allowing Team USA to hold on. Jones, the 2023 NBA G\nA highlight of the game, 17-year-old Khaman Maluach, a future Blue Devil who will play alongside Cooper Flagg in the fall, feinted to his right with a jab step to create space from Joel Embiid before burying a long mid-range shot over the Philadelphia 76ers star. Additionally, Nuni Omot had a moment to remember when he flew in to grab a rebound over Anthony Davis and threw down a monster dunk, posterizing the Lakers star.\nMuch of South Sudan's rise in international basketball can be credited to Luol Deng, a former NBA star and now the president of the South Sudan Basketball Federation. Deng has been instrumental in developing basketball in the country, investing his time, resources, and expertise to build a competitive team. His efforts have not only improved the skill level of the players but also brought international attention to South Sudan's basketball program. Supporting him is Royal Ivey, who played 11 seasons in the NBA and is a current assistant coach for the Houston Rockets, serving as the head coach for South Sudan.\nTeam USA barely overcame a significant three-point shooting disparity. In some previous U.S. defeats, opponent 3-point shooting played a significant role. When Nigeria surprised the U.S. in a friendly in 2021, the Nigerians made 20 3-pointers. Team USA's perimeter defense will need to be a focus, as demonstrated by South Sudan's impressive shooting performance.\nA seismic shift is underway in international basketball. The USA has not produced an MVP since the 2017-18 NBA season, and the top picks in the last two NBA drafts have hailed from France. Additionally, Germany’s victory in the 2023 FIBA World Cup added to the growing evidence of change. The recent nail-biting contest between Team USA and South Sudan wasn't just an exhilarating game; it marked a significant turning point in international basketball.\nThe close match was a subtle yet impactful wake-up call, suggesting that the dominance of traditional powerhouses may be on the decline. As anticipation builds for the upcoming rematch between Team USA and South Sudan on July 31st, the stage is set for an enthralling and revealing clash, adding further excitement as the Olympics draw near."
    }
  ],
  "argos_summary": "From August 12 to 24, 2025, Angola will host the FIBA Men’s AfroBasket, showcasing Africa's top basketball talent and marking the tournament's evolution as a key qualifier for the FIBA World Cup and Olympics. Reigning champions Tunisia aim for a third consecutive title, while Angola seeks to reclaim its former glory on home soil. The tournament reflects the rapid growth of African basketball, with teams like South Sudan emerging as serious contenders, highlighting the increasing competitiveness and cultural significance of the sport across the continent.",
  "argos_id": "H46EE3UTB"
}