{
  "url": "https://www.foxnews.com/media/defense-secretary-pete-hegseth-vows-force-multipliers-dc-police",
  "authorsByline": "Stephanie Samsel",
  "articleId": "9ea9c3ebea3a48d49ebadb2258c124c7",
  "source": {
    "domain": "foxnews.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://static.foxnews.com/foxnews.com/content/uploads/2025/03/donald-trump-pete-hegseth-diagonal-split.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T22:58:59-04:00",
  "addDate": "2025-08-12T03:12:24.153167+00:00",
  "refreshDate": "2025-08-12T03:12:24.153170+00:00",
  "score": 1.0,
  "title": "Defense Secretary Pete Hegseth vows to be 'force multipliers' of DC police",
  "description": "Defense Secretary Pete Hegseth explains what is ‘front and center’ in President Donald Trump’s quest to make Washington, D.C. safe on 'The Ingraham Angle.'",
  "content": "Defense Secretary Pete Hegseth elaborated on what President Donald Trump has \"got the guts\" to do, after they announced Monday Washington, D.C.'s police force will be federalized.\n\n\"We're going to work right alongside our law enforcement partners as force multipliers,\" Hegseth told \"The Ingraham Angle.\"\n\nAs part of the White House’s efforts to crack down on crime, Trump declared it was \"Liberation Day\" and officially placed the Washington D.C.’s Metropolitan Police Department under federal control. Hegseth also teased 800 National Guard troops will be deployed \"in the coming week.\"\n\nTRUMP'S PLAN TO DEPLOY NATIONAL GUARD IN DC SPARKS BACKLASH FROM RESIDENTS—BUT SOME WELCOME IT\n\nThis comes after recent acts of violence in the capital city made national headlines, including a former DOGE staffer being assaulted and a 21-year-old congressional intern being fatally caught in the crossfire of a drive-by shooting a mile away from the White House in June.\n\n\"If our capital city is a mess, if we can't control our capital city, then what does the rest of the country look like?\" Hegseth asked.\n\nWhen Fox News host Laura Ingraham asked how long the troops will be in the nation’s capital, Hegseth called their deployment \"conditions-based,\" emphasizing the administration will support all parts of law enforcement to \"make sure people who are arrested are actually locked up.\"\n\nTRUMP ACTIVATES NATIONAL GUARD TROOPS TO ADDRESS ‘TOTALLY OUT OF CONTROL’ CRIME IN WASHINGTON\n\n\"That's why the president's talking about cashless bail and sanctuary cities,\" Hegseth explained. \"If you're illegal here in D.C., that's going to be a problem. So all of these things that apply to law and order are front and center for us.\"\n\nThe National Guard could be deployed for weeks or months, but when they should pull out is ultimately the \"president’s call,\" Hegseth added.\n\nHegseth also responded to accusations the Trump administration is acting as \"authoritarians\" would, insisting these critiques are no different than what he heard when they \"quelled the protests of the attacks on ICE officers\" in Los Angeles in June.\n\nHEGSETH SPARS WITH SENATE DEMOCRATS OVER MARINE DEPLOYMENT TO LA ANTI-ICE RIOTS: 'NOT ABOUT LETHALITY'\n\n\"I was told, ‘Oh, you're going to lock up political opponents, you're going to go after Democrats,’ yada yada. It's the same stuff every time. Mischaracterizing our intentions,\" Hegseth argued.\n\nHe continued, \"The intentions of this president is to establish law and order using legal and lawful and constitutional means, which he completely has, and you know why they don't like him? He's got the guts to do it.\"\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nIn June, President Donald Trump had ordered 700 Marines and 4,000 National Guard troops to Los Angeles, despite Gov. Gavin Newsom’s, D-Calif, strong stance against it.",
  "medium": "Article",
  "links": [
    "https://www.foxnews.com/politics/trump-activates-national-guard-troops-address-totally-out-control-crime-washington",
    "https://www.foxnews.com/politics/hegseth-spars-senate-democrats-over-marine-deployment-la-anti-ice-riots-not-about-lethality",
    "https://www.foxnews.com/video/6376806416112",
    "https://www.foxnews.com/media",
    "https://www.foxnews.com/politics/trumps-plan-deploy-national-guard-dc-sparks-backlash-from-residents-but-some-welcome",
    "https://www.foxnews.com/apps-products?pid=AppArticleLink",
    "https://www.foxnews.com/video/6376809414112",
    "https://www.foxnews.com/category/us/military/national-guard",
    "https://www.foxnews.com/category/person/gavin-newsom",
    "https://www.foxnews.com/search-results/search#q=doge%20staffer",
    "https://www.foxnews.com/category/topic/sanctuary-cities",
    "https://www.foxnews.com/category/us/democratic-party"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Pete Hegseth",
      "weight": 0.08626277
    },
    {
      "name": "Defense Secretary Pete Hegseth",
      "weight": 0.08283127
    },
    {
      "name": "Hegseth",
      "weight": 0.08229847
    },
    {
      "name": "NATIONAL GUARD TROOPS",
      "weight": 0.079987556
    },
    {
      "name": "President Donald Trump",
      "weight": 0.074974544
    },
    {
      "name": "law enforcement",
      "weight": 0.07229547
    },
    {
      "name": "Donald Trump",
      "weight": 0.07058869
    },
    {
      "name": "NATIONAL GUARD",
      "weight": 0.06560418
    },
    {
      "name": "National Guard",
      "weight": 0.06343631
    },
    {
      "name": "law",
      "weight": 0.06271062
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.97265625
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.94140625
    },
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.91259765625
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.382080078125
    }
  ],
  "sentiment": {
    "positive": 0.04009428,
    "negative": 0.7797764,
    "neutral": 0.18012933
  },
  "summary": "Defense Secretary Pete Hegseth has defended President Donald Trump's decision to federalize Washington, D.C.'s police force, stating that they will work alongside law enforcement partners as force multipliers. This comes as part of the White House's efforts to crack down on crime. Hegsetsh also revealed that 800 National Guard troops will be deployed in the coming week. This follows criticism that the administration is acting like \"authoritarians\" in response to anti-immigration protests in Los Angeles.",
  "shortSummary": "Defence Secretary Pete Hegseth praised President Donald Trump's courage to federalize Washington D.C's police force, pledging to enhance law and order amid recent violence.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "47558517c6b84c6d903fd0ee68d3a80f",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.foxnews.com/apps-products?pid=AppArticleLink",
      "text": "Fox News is Everywhere.\nWatch Fox News Channel on all of your devices to keep up to date with the latest in news, politics, entertainment and more. On phones, tablets, wearables and TV, it's easy to stay connected anywhere.\niOS Devices\nAndroid Devices\nApple TV\nRoku\nChromecast\nAndroid TV\nAmazon Fire\nFubo TV\nApple Watch\nAmazon Echo\nGoogle Home\nFox News Go\nApple News\nAT&T TV Now\nYouTube TV\nHulu\nFacebook\nInstagram\nSamsung Devices\nSling TV\nVidgo\nSpotify\niHeartRadio\nFlipboard\nLinkedIn\nGoogle Newsstand\nNewsletters\nYouTube\nFAQ\nHow much data does Fox News Go use?\nFox News Go uses about 2GB per hour of SD viewing and 4GB per hour of HD viewing. This can vary depending on your device and internet connection. If you are concerned about your data usage we recommend not streaming over a cellular network and contacting your Internet or Cellular Service Provider.\nWhat broadcast quality will I get while streaming on my device?\nFox News will stream at the highest quality possible based on your device and internet connection quality. For the best quality we recommend streaming via Wi-Fi or 4G.\nWhat channels are available on Fox News Go?\nYou can Watch Fox News Channel on Fox News Go and Fox Business Channel on Fox Business Go"
    },
    {
      "url": "https://www.foxnews.com/category/us/democratic-party",
      "text": "Texas 3 hours ago Gov. Abbot still beat Newsom in disaster relief despite Texas Democrats stalling, hiding out Despite Democratic lawmakers fleeing and holding up vital relief efforts, Texas Governor Abbott’s flood relief was faster than California Governor Gavin Newsom’s response to the L.A. wildfires.\nZohran Mamdani 6 hours ago Cuomo proposes 'Zohran's law' to protect rent-stabilized housing from the wealthy A political feud erupted between former Gov. Andrew Cuomo and Zohran Mamdani over affordable housing policies and rent-stabilized apartments in NYC mayoral contest.\nOpinion 16 hours ago DC Democrats risk losing public trust by dodging youth crime crisis Trump is addressing Democrats must address D.C.'s rising juvenile crime honestly rather than avoiding the issue, as federal overreach from Donald Trump threatens local autonomy.\nMedia 1 day ago Bernie Sanders calls out Kamala Harris' campaign for being 'heavily influenced by wealthy people' Sen. Bernie Sanders called out Kamala Harris' campaign for being influenced by billionaires on Sunday and failing to address the concerns of working families.\nIsrael 1 day ago Dem, GOP reps defend Netanyahu Gaza plan following Israel trip Democratic and Republican representatives endorsed Israeli Prime Minister Benjamin Netanyahu's plan for Israeli forces to temporarily take over Gaza.\nFox News Flash 1 day ago JD Vance calls on Republicans to take 'decisive action' to counter Democratic gerrymandering JD Vance argues illegal immigrants in population counts give blue states unfair congressional representation, urging an aggressive Republican redistricting response.\nPolitics 1 day ago Abbott vows indefinite special sessions, says fleeing Dems could face arrest ‘for literally years’ Governor Greg Abbott warned Texas Democrats will face arrest upon returning amid the redistricting standoff, vows to order continuous special sessions.\nOpinion 1 day ago It's not just Democrats. Socialist Mamdani's plans should worry Republicans nationwide Democrats' embrace of NYC mayoral candidate who wants to 'seize means of production' signals alarming shift in party ideology. And it has implications for Republicans, too.\nTexas 1 day ago WATCH: Texas state senator argues redistricting showdown could decide balance of power in future US Congress Texas state GOP Sen. Mayes Middleton argues Republican redistricting efforts in his state could be pivotal for Republicans to maintain control in Congress during mid-terms.\nMedia 2 days ago Stephen A. Smith calls out Dems like AOC and Jasmine Crockett as bad look for face of the party Stephen A. Smith blasted progressive Democrats on Bill Maher's \"Real Time\" on Friday, arguing that Republicans are having a \"field day\" with all of the coverage these progressives receive.\nGavin Newsom 2 days ago California launches redistricting fight to ‘nullify’ Texas GOP plan, with Dems poised to gain 5 seats California Gov. Gavin Newsom announced Friday that the Golden State will move forward with a special election in early November to place its own redistricting plan on a ballot measure before voters.\nCulture Trends 2 days ago The fight over charter schools in some of America's rural states Rural Republican states like Idaho, Tennessee and Wyoming overcame GOP resistance to pass universal school choice legislation despite concerns about local schools.\nTexas 3 days ago Party of 'crazies': Dems comply with outrageous redistricting stunts due to primary threats, state rep says Texas Democrats continue exodus to liberal states over GOP redistricting as Republicans launch bribery investigations and President Donald Trump supports the redistricting push.\nMedia 3 days ago Carville doubles down after getting called out for predicting Trump admin collapse, says it’s happening ‘now' Democratic strategist James Carville maintained that the Trump administration is collapsing despite polling showing 44-45% approval ratings during a Dan Abrams podcast appearance.\nDonald Trump 3 days ago EXCLUSIVE: Duncan says Trump’s attacks justify his switch from GOP to Democratic Party: 'He's making my case for me' Former Georgia Republican Lt. Gov. Geoff Duncan considers 2026 gubernatorial run as a Democrat after switching parties and facing GOP expulsion.\nMedia 3 days ago Former Democratic advisor says party's rhetoric on redistricting is getting 'a little out of control' Former Democratic advisor Dan Turrentine warned that his party's dramatic redistricting language could hurt their chances of retaking the House in the 2026 midterm elections.\nPolitics 3 days ago Texas asks Illinois court to enforce arrest warrants for Democratic lawmakers Texas pursues legal action to enlist Illinois assistance in apprehending Texas state Democratic lawmakers hunkered down in the Prairie State.\nGeorgia 3 days ago Former Georgia Lt. Gov. Geoff Duncan floats possible run for office after switching to Democratic Party Former Georgia Lt. Gov. Geoff Duncan said he is considering a run for higher office as a Democrat after announcing he was leaving the Republican Party.\nMedia 4 days ago Carville claims Democrats don't want to associate with anyone from failed 2024 Harris campaign in 2028 Carville told Harris, Walz and other 2024 Democratic campaign associates the party wants to chart new course without them for 2028 presidential election.\nGreg Abbott 4 days ago Gov. Greg Abbott threatens to redistrict 8 seats for GOP if Dem lawmakers don't return to Texas In a preview clip of Friday's \"Ruthless\" podcast,\" Republican Texas Gov. Greg Abbott threatened to create up to eight new seats for his party if Democratic state lawmakers don't return.\nSanctuary Cities 4 days ago $30K in migrant housing aid has Dem gov on hot seat for 'revolving door' policy As Gov. Maura Healey, D-Mass., closes down her state's migrant shelters, she is facing criticism for simultaneously making migrants eligible for tens of thousands in housing aid.\nMedia 4 days ago Carville calls on Democrats to 'unilaterally' pack Supreme Court, create new blue states 'to save democracy' James Carville urged Democrats should open \"Pandora's Box\"with controversial power grabs including statehood for Puerto Rico and D.C. to \"save\" democracy.\nGeorgia 4 days ago Former Georgia Lt. Gov. Geoff Duncan abandons GOP to join Democratic Party Former Georgia Lt. Gov. Geoff Duncan announced he is leaving the GOP and joining the Democratic Party, a move he says has been a long time coming.\nBeto O'Rourke 5 days ago AWOL Dems’ flight from Texas may have been funded illegally by Beto O'Rourke nonprofit Texas Attorney General Ken Paxton launches investigation into Beto O'Rourke's nonprofit Powered by People for allegedly funding Democrats who fled state to block Republican redistricting effort.\nMedia 5 days ago Teamsters president reveals Bernie Sanders stopped talking to him after he spoke at RNC Sean O'Brien, the Teamsters president, revealed Sen. Bernie Sanders no longer speaks to him after he addressed the Republican National Convention in 2024.\nImmigration 5 days ago ICE raid tipoffs from Dem lawmaker could mean charges, says DHS rep: 'Looks like obstruction' A Democratic state lawmaker tipping off ICE operations in her community could be hit with obstruction-of-justice charges, a spokesperson for the Department of Homeland Security said.\nZohran Mamdani 5 days ago Zohran Mamdani spending big on private security despite earlier calls to defund police The leading mayoral candidate for New York City, Zohran Mamdani, is spending big on private security for his campaign and personal life despite previous calls to defund the police.\nTexas 5 days ago Obama labels Texas redistricting push 'a power grab that undermines our democracy' Former President Barack Obama accused Lone Star State Republicans of seeking to engage in gerrymandering in \"a power grab that undermines our democracy\"\nSenate Democrats 5 days ago Senate Democrats are feverishly recruiting top candidates to win back majority in 2026 midterms Senate Democrats pursue candidates like Roy Cooper and Sherrod Brown while facing competitive primaries in Michigan and Texas for 2026 midterm battle for the chamber's majority.\nTexas 5 days ago George Soros, Beto O'Rourke behind funding for Dems fleeing Texas over GOP congressional map Texas Democrats are get financial support from a Soros-backed group and Beto O'Rourke's organization after leaving state to prevent a redistricting vote."
    },
    {
      "url": "https://www.foxnews.com/category/topic/sanctuary-cities",
      "text": "Immigration 2 days ago ICE arrests illegal immigrant charged with child sex crimes after his release by local police despite detainer ICE arrested an illegal immigrant from Guatemala after Rhode Island police released him despite child sex crime charges and an active immigration detainer.\nSanctuary Cities 4 days ago $30K in migrant housing aid has Dem gov on hot seat for 'revolving door' policy As Gov. Maura Healey, D-Mass., closes down her state's migrant shelters, she is facing criticism for simultaneously making migrants eligible for tens of thousands in housing aid.\nFox News Flash 4 days ago Tom Homan puts sanctuary cities 'on notice' as Trump administration cracks down on immigration Border Czar Tom Homan put sanctuary cities on notice as the Justice Department ramps up its crackdown on jurisdictions that hinder immigration enforcement.\nMigrant Crime 5 days ago Two illegal immigrant suspects indicted on attempted murder charges in CBP officer shooting case in NYC Manhattan DA announces additional charges against two suspects with illegal immigration status who shot off-duty border patrol officer during armed robbery.\nVIDEO 5 days ago Tom Homan: We are putting sanctuary cities ‘on notice’ Border czar Tom Homan discusses sanctuary city policies and the ‘Speedway Slammer’ migrant detention facility on ‘The Faulkner Focus.’\nImmigration 6 days ago Bondi DOJ names and shames 35 sanctuary jurisdictions that ‘put American citizens at risk’ Department of Justice identifies nearly three dozen cities and states for allegedly protecting illegal immigrants, warns of legal action against jurisdictions\nVIDEO August 3 Democratic Party 'gets more status fighting ICE than criminals,' former official says Former Acting ICE Director Jonathan Fahey discusses ICE detaining an illegal immigrant accused of killing a New Jersey mom and child during a drunk driving incident and the Trump administration's legal efforts against sanctuary city policies.\nImmigration July 31 Democrats creating 'two-tiered' legal system that keeps Latinos down, says LA GOP leader A legal immigrant and chair of the Los Angeles County GOP is saying that pro-sanctuary Democrats are deliberately building a two-tiered justice system designed to trap Latinos and immigrants in a “permanent underclass.\"\nSanctuary Cities July 30 Newsom office dismisses crime fears, defends sanctuary policies amid surge in violence: 'Fake news' Gov. Gavin Newsom is denying experts' claims that sanctuary policies sheltering lawbreakers are directly responsible for a rising crime and violence in Democratic-run jurisdictions.\nSanctuary Cities July 28 Dems' sanctuary policies shield 'gangbangers,' harm Latino families, businesses, says Hispanic GOP lawmaker Hispanics living in Democratic-run jurisdictions are frustrated with sanctuary policies allowing criminal illegal aliens to prey on their communities, says a Latino GOP lawmaker.\nPortland July 28 Portland anti-ICE demonstrators confused when person in full-size Elmo costume shows up A person in Elmo costume trolls anti-ICE demonstrators on Friday at a Portland detention facility amid tensions at the controversial location.\nOpinion July 28 America’s crime drop isn’t a coincidence. Trump’s immigration policies are working Crime rates fall as immigration enforcement increases under Trump administration, with violent crime now lower than pre-pandemic 2019 levels according to new report\nChicago July 26 Federal judge tosses Trump DOJ lawsuit against sanctuary policies in Chicago A federal judge in Illinois has dismissed a Trump administration lawsuit that sought to disrupt limits Chicago imposes on cooperation between federal immigration agents and local police.\nJustice Department July 24 Trump DOJ sues New York City over long-standing sanctuary immigration policies New York City faces federal lawsuit from the Trump administration targeting sanctuary policies dating back to 1989 that prevent authorities from honoring ICE detainer requests.\nVIDEO July 24 New twist in Kilmar Abrego Garcia court battle: 'Judges will be checked' Former federal prosecutor and acting ICE Director Jonathan Fahey weighs in a judge pausing Kilmar Abrego Garcia's release and the rise in ICE detainers in New York City.\nDonald Trump July 23 ICE detainers in top sanctuary city have skyrocketed under Trump compared to Biden's 4-year term: DHS Data released by the Department of Homeland Security shows that the Trump administration has surged the number of ICE detainers in New York City compared to former President Joe Biden.\nVIDEO July 21 Tom Homan: The Left doesn't want to admit the truth Trump 'border czar' Tom Homan outlines why the crime rate is so high in New York and promises to 'flood the zone' on sanctuary cities on 'Hannity.'\nVIDEO July 21 Democrats' policies shield these 'monsters' from deportation: Stephen Miller White House deputy chief of staff for policy Stephen Miller fires back at Hunter Biden's f-bombs against deportations on 'The Ingraham Angle.'\nSanctuary Cities July 21 Eric Adams responds to Tom Homan pledge to ‘flood the zone’ with ICE agents after CBP shooting After Tom Homan vowed to “flood the zone\" with ICE agents in response to the shooting of a CBP agent in NYC, Mayor Eric Adams weighed in on whether he'll cooperate.\nVIDEO July 21 BREAKING: Noem, Homan sound alarm after 2nd illegal arrested in CBP shooting Retired Border Patrol Agent Chris Clem and former Homeland Security advisor Chuck Moreno join 'America's Newsroom' to weigh in on an illegal immigrant allegedly shooting and injuring an off-duty Border Patrol agent.\nImmigration July 18 Feds' California Home Depot raid nabs 11 illegal migrants, one with 67 prior jail bookings Border Patrol in Sacramento arrested 11 illegal migrants during a raid at a Home Depot parking lot — including one man with 67 prior bookings in California since 1986.\nImmigration July 17 Twice-deported migrant rapist freed as Dems face heat for sanctuary policies The release of a twice-deported rapist in Virginia is putting renewed focus on the dangers posed by Democrat-led sanctuary policies that limit cooperation with Immigration and Customs Enforcement (ICE).\nOregon July 16 Portland City Council considers how to boot ICE out of city facility Portland’s progressive-leaning city council is exploring ways to expel Immigration and Customs Enforcement (ICE) from a detention facility that has become a flashpoint for violent clashes between agents and radical agitators.\nImmigration July 10 Florida tourist hotspot nearly becomes sanctuary city before leaders reverse ICE policy Florida's Key West voted to reinstate its immigration agreement with ICE just one week after ending it, following threats of penalties from Governor DeSantis's administration.\nFlorida July 2 DeSantis administration threatens to punish island city that voted to end police agreement with ICE Florida officials threatened Key West commissioners with removal after they voted to end their immigration enforcement partnership with ICE.\nImmigration July 1 DOJ silent on whether NYC politician who allegedly assaulted ICE officer will face charges The DOJ is remaining silent on whether it will be pressing charges against NYC comptroller and then Democratic mayoral candidate Brad Lander after he allegedly assaulted a federal immigration officer.\nVIDEO June 25 GOP lawmaker cites ‘new Democratic Party policies’ for rising national security threats Rep. Brian Mast, R-Fla., discusses U.S. national security after the Trump administration bombed Iranian nuclear facilities on ‘The Story.’\nNational Guard June 24 GOP bill would grant Trump right to deploy National Guard for immigration enforcement The GUARD Act aims to authorize presidential deployment of National Guard for immigration enforcement when states refuse to cooperate, with harsh penalties for attackers.\nImmigration June 23 ICE arrests alleged gang member hiding from Mexican authorities in sanctuary city: 'Heinous murderer' ICE captures Orlando Diaz-Cebada, an illegal immigrant with alleged gang ties, in New Haven after fleeing Mexico where he's wanted for aggravated homicide of an officer.\nIran June 23 Hospitals in sanctuary cities could be most vulnerable to Iran terror attacks, warns expert Following reports that the Biden admin released 729 Iranian illegal immigrants into the country, experts are warning that sanctuary jurisdictions may be the most vulnerable targets for retaliation attacks."
    },
    {
      "url": "https://www.foxnews.com/politics/hegseth-spars-senate-democrats-over-marine-deployment-la-anti-ice-riots-not-about-lethality",
      "text": "Defense Secretary Pete Hegseth sparred with Democratic senators during a hearing Wednesday about the Trump administration's deployment of 700 Marines to Los Angeles amid the ongoing anti-Immigration and Customs Enforcement (ICE) riots.\nIn his opening statement before the Senate Appropriations Committee hearing, Hegseth reiterated how President Donald Trump charged him to focus on restoring \"warfighting, lethality, meritocracy, standards and readiness\" to the Department of Defense — a point Sen. Jack Reed, D-R.I., later honed in on during his line of questioning for the secretary.\nReed noted that the Trump administration federalized 4,000 California National Guard members and deployed 700 Marines to Los Angeles.\nReed said what is happening in Los Angeles comes in addition to the approximately 11,000 military personnel, including active duty soldiers and National Guard members, who have deployed to the southern border in support of U.S. Customs and Border Protection — a figure which Hegseth corrected. The defense secretary said some 13,000 military personnel have deployed to the southern border and that he has visited those troops several times.\nJOHNSON SAYS HEGSETH POSSIBLY SENDING MARINES TO ANTI-ICE RIOTS NOT HEAVY-HANDED: 'DETERRING EFFECT'\n\"People will say that mobilization hurts readiness. When you talk to them, it actually improves their readiness,\" Hegseth said.\nReed told Hegseth, \"Your whole ethic seems to be revolved on the lethality of the military force. How is this operation with Marines and National Guardsmen improving their lethality?\n\"Readiness and training and accountability is all about lethality,\" Hegseth said. \"The more ready you are, the more capable you are, the more accountable you are, the higher your standards are, it all makes you more lethal.\"\n\"The mission in Los Angeles, as you know well, sir, is not about lethality,\" the secretary continued. \"It's about maintaining law and order on behalf of law enforcement agents who deserve to do their job without being attacked by mobs of people. We are very proud that the National Guard and the Marines are on the streets defending the ICE agents, and they will continue.\"\nA Defense official told Fox News that the Marines who arrived in Los Angeles are an infantry unit and are still undergoing training, including in nonlethal weapons and use of force protocols in a domestic setting, at Seal Beach. They have not yet been tapped to respond to street demonstrations as of Wednesday morning.\nReed argued that \"law and order is a civil function under the Constitution,\" but Hegseth said that \"there is plenty of precedent for the U.S. supporting law enforcement officers.\"\n\"What your military is doing right now is laying concertina wire, guarding buildings, maintaining vehicles for other services,\" Reed said. \"This is not only, I think, illegal, but also a diminution of the readiness and the focus of the military.\"\nCalifornia Gov. Gavin Newsom sued the Trump administration for federalizing the National Guard to respond to the riots and for tapping the Marines. A federal judge on Tuesday night declined California's request for an immediate restraining order to block Trump's use of military personnel and scheduled a court hearing to further weigh the legality of the matter for Thursday.\nFEDERAL JUDGE REFUSES TO BLOCK TRUMP'S LA NATIONAL GUARD DEPLOYMENT ON NEWSOM'S TIMEFRAME\nIn a separate line of questioning at the Senate hearing on Wednesday, Hegseth said Newsom \"wants to play politics.\"\nSen. Brian Schatz, D-Hawaii, had asked another witness, Chairman of the Joint Chiefs of Staff, Air Force Gen. John D. Caine, if the U.S. had been \"invaded by a foreign nation\" or if \"there is a rebellion somewhere in the United States.\"\nCaine deferred to the Department of Homeland Security to answer border-related questions in terms of a potential invasion and added on the question of a rebellion that, \"there are certainly some frustrated folks out there.\"\n\"It’s quite easy to point out that there has been an invasion of 21 million illegals in our country under the previous administration, so this administration was elected to get a hold of that,\" Hegseth added. \"And when you have ICE officers being attacked with concrete blocks, they should be allowed to do their jobs.\"\nSchatz interjected, telling Hegseth he would \"really like not to create a viral moment.\"\nThe senator said he was trying to \"understand the scope of the order,\" which, he says, does not specify a location or which Marines or which Guard members would be mobilized.\n\"Did you just mobilize every guard everywhere and every service member everywhere? I mean, create the framework for that,\" Schatz said.\nCLICK HERE TO GET THE FOX NEWS APP\nHegseth said an initial order federalized 2,000 National Guard troops in California and there was a follow-up order for an additional 2,000 members because the situation there \"required more resources in order to support law enforcement.\"\n\"So part of it is getting ahead of a problem, so that if in other places, if there are other riots in places where law enforcement officers are threatened, we would have the capability to surge National Guard there if necessary,\" Hegseth said. \"And thankfully, in most of those states, you'd have a governor that recognizes the need for it, supports it, and mobilizes it, him or herself. In California, unfortunately, the governor wants to play politics with it.\"\nFox News' Liz Friden contributed to this report."
    },
    {
      "url": "https://www.foxnews.com/category/person/gavin-newsom",
      "text": "Gavin Newsom is a Democratic politician and the 40th governor of California, entering office in January 2019. With over 20 years of political experience in the Golden State, Newsom previously served as the lieutenant governor of California from 2011 to 2019 and was elected the mayor of San Francisco in 2004. As the leader of the biggest and most populated state, Newsom is considered one of the country's most influential Democrats.\nNewsom is a native of San Francisco, the son of William Newsom, an appeal judge for California Courts. Before he entered elected office, Newsom worked in the private sector, starting a winery funding he raised from investors, including billionaire Gordon Getty. Newsom eventually sold his winery shares in 2004 after being elected mayor of San Francisco.\nDuring the Covid-19 pandemic, Newsom faced widespread criticism after he was pictured breaking his own health guidelines while dining inside a luxurious restaurant in Napa Valley. The image showed Newsom dining maskless with a large group of close friends and political allies, including California lobbyists, while celebrating his birthday. The scandal helped grow support around the effort to recall the governor, gaining more than 2 million signatures to trigger a recall election.\nHowever, Newsom went on to defeat the recall attempt by over 3 million votes, defeating conservative talk show host Larry Elder, former San Diego Mayor Kevin Faulconer, and a dozen other candidates. He will face another election in November 2022, but has already won the state's Democratic nomination with 61% of the vote.\nUnder Newsom's administration, California has seen a large exodus of its urban and rural population to other states such as Texas and Florida. Many experts have blamed the depopulation partly due to the state's high living costs for gas and rent and Newsom's tax policy — the highest in the nation."
    },
    {
      "url": "https://www.foxnews.com/politics/trump-activates-national-guard-troops-address-totally-out-control-crime-washington",
      "text": "President Donald Trump announced Monday that he is activating approximately 800 National Guard troops and is taking over the Metropolitan Police Department to tackle crime in Washington, after beefing up federal law enforcement presence in the nation's capital Saturday.\n\"I'm deploying the National Guard to help reestablish law, order and public safety in Washington, DC,\" Trump told reporters at a Monday press conference. \"And they're going to be allowed to do their job properly.\"\nTrump also said that he would federalize the Metropolitan Police Department in Washington to respond to crime, placing it under the authority of Attorney General Pam Bondi.\nNational Guard troops are reserve forces that are mobilized in response to state and federal operations, including natural disasters, and are typically overseen by their respective state governments. However, Trump controversially deployed National Guard troops from California to respond to immigration riots in June, bypassing California Gov. Gavin Newsom to dispatch the troops.\nThe federal government oversees the District of Columbia National Guard.\nSecretary of Defense Pete Hegseth said that Secretary of the Army Dan Driscoll will operationalize the D.C. National Guard, and signaled that more National Guard troops could be roped into the deployment down the line.\n\"You will see them flowing into the streets of Washington in the coming week,\" Hegseth told reporters Monday. \"At your direction as well, sir, there are other units we are prepared to bring in. Other National Guard units, other specialized units. They will be strong, they will be tough, and they will stand with their law enforcement partners.\"\nTrump’s remarks come just after he promised Washington would be \"LIBERATED\" from \"Crime, Savagery, Filth, and Scum\" in a post on Truth Social Monday morning. He said in the post that the \"days of ruthlessly killing, or hurting, innocent people, are OVER!\"\nTrump floated the idea of taking over Washington’s Metropolitan Police Department and utilizing National Guard troops to manage crime in Washington Wednesday, following the assault of a former Department of Government Efficiency (DOGE) staffer on Aug. 3 in Washington’s Logan Circle.\nTRUMP THREATENS TO FEDERALIZE DC AFTER EX-DOGE EMPLOYEE 'BIG BALLS' VIOLENTLY BEATEN\n\"What a shame – rate of crime, the rate of muggings, killings and everything else, we’re not going to let it, and that includes bringing in the National Guard, maybe very quickly, too,\" Trump told reporters Wednesday at the White House.\nTrump also told reporters at the time he was open to taking over Washington’s Metropolitan Police Department because crime in the nation’s capital is \"ridiculous.\"\nWhile a temporary federal takeover of the Metropolitan Police Department is justified in cases of emergency, Trump's move will likely be challenged in court over whether the situation in Washington qualifies as an emergency.\nTrump has historically railed against violence in Washington, and said Tuesday that crime is \"totally out of control\" in the nation's capital.\nMeanwhile, crime in Washington is on the decline. Violent crime is down 26% this year, in comparison to the same timeframe in 2024, according to Washington’s Metropolitan Police Department. Likewise, assaults with a dangerous weapon are down 20%, and homicides are down by 12%.\nWATCH: TRUMP HINTS HE WILL FEDERALIZE DC SOON, BRING IN NATIONAL GUARD AFTER ‘BIG BALLS’ ATTACK\nWashington’s Mayor Muriel Bowser challenged Trump’s description of the city during an interview with MSNBC Sunday, and voiced concerns about the possibility of activating the National Guard to tackle the city’s crime.\n\"Any comparison to a war-torn country is hyperbolic and false,\" Bowser said.\nCLICK HERE TO GET THE FOX NEWS APP\n\"I’m concerned about them not being used efficiently, and I just think that’s not the most efficient use of our Guard,\" Bowser said.\nThe Associated Press contributed to this report.\nThis is a breaking news story and will be updated."
    },
    {
      "url": "https://www.foxnews.com/politics/trumps-plan-deploy-national-guard-dc-sparks-backlash-from-residents-but-some-welcome",
      "text": "President Donald Trump shared new details on Monday about his plan to take control of public safety in Washington, D.C., following a brutal attack on a former Department of Government Efficiency (DOGE) staffer, but D.C. residents aren't convinced.\nTrump announced on Monday that he is activating the District of Columbia National Guard and seizing control of the Metropolitan Police Department after floating the idea since last week's assault in Washington’s Logan Circle.\nSome Washington residents who spoke to Fox News Digital called it a \"terrible idea\" that \"doesn't make a lot of sense.\"\n\"I think D.C. politics should stay with D.C., and, unfortunately, the federal government is apparently overstepping their bounds right now, so I hope that D.C. is allowed to govern itself, as well as police itself,\" one Washington resident told Fox News Digital ahead of Trump's announcement.\nTRUMP IS THREATENING TO 'FEDERALIZE' DC WITH NATIONAL GUARD AND MORE. HERE'S HOW THAT COULD PLAY OUT\nTrump controversially federalized the California National Guard amid anti-ICE protests that delved into riots in Los Angeles in June. Protesters were rejecting the U.S. Immigration and Customs Enforcement (ICE) deportations and Trump's robust immigration crackdown.\nThe president bypassed Gov. Gavin Newsom's authority to deploy National Guard troops to support ICE deportation. It was the first time a president federalized the National Guard without the governor's request in more than 60 years.\nNow, the tension between local and federal powers is unfolding in the nation's capital. But just like in California, many Washington residents have concerns about seeing \"troops on our streets.\"\n\"We have laws for a reason,\" one resident told Fox News Digital.\n\"Privatizing security is a terrible idea, and I think anything that Trump does is garbage,\" another Washington resident added.\nDespite their apprehension about National Guard troops patrolling the nation's capital, many residents said something needs to be done to address crime in Washington, D.C.\nWhile the Department of Justice indicated a 30-year low in violent crime last year, concerns about the city's safety linger, with one resident telling Fox News Digital, \"The city is getting dangerous.\"\n\"I think it's a good idea,\" one resident said of Trump's new plan. \"It's something that needs to be done for the city to be safe. Right now, we're not safe. The kids and the teenagers are doing everything. So yeah, I think that's a great idea.\"\nAnd another Washington resident said, \"We need all the protection that we can get in the city, because the city is really getting dangerous,\" telling Fox News Digital that she has to \"make sure to come home before sundown\" and she is afraid of getting robbed when she gets off public transportation.\n\"Things do seem out of control and desperate, but I don't know what kind of numbers to take, what numbers to read. One minute they'll say crime is out of control. Next minute, they will say crime is down a certain percentage. It's kind of confusing, and I don't know who to believe in and which way to go, to be honest,\" a Washington resident said, articulating the dichotomy between the low crime statistics and the alarming crime stories.\nBut another D.C. resident said, \"There's no way he should be in control of anything,\" and Washington, D.C., \"should be a state,\" so the district has more power to make decisions for itself.\n\"I don't think it's necessary,\" another Washington resident added. \"I do think there needs to be some change within [the] Metropolitan [Police Department] because safety is an issue.\"\nCLICK HERE TO GET THE FOX NEWS APP\nShe added: \"It needs to be localized.\"\nFox News Digital's Diana Stacy contributed to this report."
    },
    {
      "url": "https://www.foxnews.com/category/us/military/national-guard",
      "text": "Fox News Flash 1 hour ago Defense Secretary Pete Hegseth vows to be 'force multipliers' of DC police Defense Secretary Pete Hegseth explains what is ‘front and center’ in President Donald Trump’s quest to make Washington, D.C. safe on 'The Ingraham Angle.'\nVIDEO 2 hours ago Trump goes out of the way to protect reporters who call him a 'dictator': Kilmeade Fox News' Brian Kilmeade discusses President Donald Trump's redecorating prowess in the White House, his moves to clean up crime in Washington, D.C. and the reaction from Democrats on 'Jesse Watters Primetime.'\nVIDEO 4 hours ago Trump’s ‘got the guts’ to do this: Pete Hegseth Defense Secretary Pete Hegseth reveals what’s ‘front and center’ of President Donald Trump’s quest to make Washington, D.C. safe and explains why he aims to bring back ‘shark attacks’ on ‘The Ingraham Angle.’\nVIDEO 5 hours ago How Trump is federalizing DC police and deploying National Guard Fox News correspondent Alexandria Hoff has the latest on how the Justice Department will run Washington, D.C.'s police force on 'Special Report.'\nGavin Newsom 10 hours ago Trump and Newsom fight over National Guard heads to trial in California A fight between President Donald Trump and Democratic Gov. Gavin Newsom over the National Guard's presence in California will come to a head in a three-day trial.\nPolitics 11 hours ago Trump's plan to deploy National Guard in DC sparks backlash from residents—but some welcome it Washington, D.C., residents had mixed reactions to President Trump's plan to federalize the nation's capital, as some called it a \"terrible idea\" and others said they support it.\nDonald Trump 14 hours ago Trump considers deploying National Guard troops to DC ahead of news conference, official says A White House news conference is scheduled for Monday after President Donald Trump warned about a federal takeover of Washington, D.C., over crime.\nVIDEO 5 days ago President Trump suggests its time to federalize DC, bring in National Guard after ‘Big Balls’ attack President Donald Trump suggested it is time to federalize law enforcement in the nation’s capital city and bring in the National Guard to stamp out rampant crime.\nCalifornia July 16 Pentagon scaling down National Guard deployment to LA The Pentagon pulled back about half of the National Guard troops deployed to Los Angeles, arguing lawlessness from anti-ICE demonstrations subsided.\nVIDEO July 2 Trump greenlights using National Guard as 'Alligator Alcatraz' judges Fox News correspondent Danamarie McNicholl has the latest on President Donald Trump's efforts to speed up deportations from Florida's detention site 'Alligator Alcatraz' on 'The Story.'\nLos Angeles July 1 Pentagon releases 150 National Guard troops from security mission deployment in LA as wildfire threats mount Defense Secretary Pete Hegseth approved the release of California National Guard troops from a federal mission in response to wildfire concerns.\nNational Guard June 24 GOP bill would grant Trump right to deploy National Guard for immigration enforcement The GUARD Act aims to authorize presidential deployment of National Guard for immigration enforcement when states refuse to cooperate, with harsh penalties for attackers.\nLos Angeles June 21 Los Angeles taxpayers to foot millions for 'peaceful' anti-ICE protests Anti-ICE protests in Los Angeles cost taxpayers $32 million for emergency services, cleanup and property damage. Over 500 arrests were made and multiple officers were injured.\nVIDEO June 21 Trump is ‘winning more than losing’ on immigration policy: Former acting DHS secretary Former Acting DHS Secretary Chad Wolf discusses President Donald Trump’s action on illegal immigration and the anti-I.C.E. riots in Los Angeles on ‘Fox Report.’\nVIDEO June 21 Court ruling on Trump’s use of California National Guard a ‘major victory on substance’: Jonathan Fahey Fox News contributor and former federal prosecutor Jonathan Fahey discusses President Donald Trump’s deployment of the National Guard in California amid anti-ICE riots on ‘Fox News Live.’\nVIDEO June 20 Trump scores major win to keep National Guard in LA: 'Great decision for our country' Fox News' Jeff Paul reports the latest on the ruling. Former Acting ICE Director Jonathan Fahey also weighs in on the legal battle during 'America's Newsroom' and why one convicted murder can't be deported back to El Salvador.\nDonald Trump June 20 California Governor Gavin Newsom claims 'Trump is not a king' after crucial National Guard control case California governor responds to court allowing Trump to control National Guard troops in Los Angeles, emphasizing the ruling rejects presidential immunity from review.\nFederal Courts June 19 Trump scores major win against Newsom in battle for National Guard control Federal appeals court allows Trump to retain command of National Guard in Los Angeles, ruling he likely exercised lawful authority despite failing to notify Gov. Gavin Newsom.\nOpinion June 19 I led National Guard and regular Army units. Using the military to intimidate Americans is 100% wrong Former Army and Guard leader criticizes president's deployment of military to American cities, arguing it undermines readiness and threatens constitutional freedoms\nPolice and Law Enforcement June 19 California police plead for help amid officer shortage as union boss warns of unprecedented riot ‘onslaught’ California law enforcement faces unprecedented violence during Los Angeles immigration raids, with officers working long shifts amid hundreds of arrests and multiple injuries\nCrime June 18 Trump admin deploys 2K more troops to blue city for anti-ICE riots Secretary of Defense Pete Hegseth has ordered 2,000 more National Guard troops into the field to protect ICE agents and federal property while Los Angeles faces civil unrest.\nVIDEO June 17 Federal court to hear arguments on legality of Trump deploying troops in Los Angeles Constitutional law attorney Jonathan Turley weighs in ahead of a court battle over President Donald Trump's deployment of the National Guard in Los Angeles and discusses the extended block on Trump's ban on foreign students at Harvard.\nOpinion June 17 GOV GAVIN NEWSOM: Trump is trying to destroy our democracy. Do not let him Our democracy is at risk as federal agents conduct mass deportations in California, with citizens detained and military forces deployed without state request.\nCalifornia June 14 Trump and Newsom on collision course as fight over National Guard intensifies in court The legal battle between President Donald Trump and California Gov. Gavin Newsom continues over National Guard troops in Los Angeles after an appeals court temporarily overturns a ruling against the president's deployment.\nDonald Trump June 13 Americans weigh in on Trump's deployment of troops to quell Los Angeles unrest A new poll shows a partisan split on President Donald Trump's troop deployment to quell Los Angeles protests, with 86% of Republicans supporting while Democrats strongly oppose it.\nOpinion June 13 GREGG JARRETT: Trump's deployment of National Guard is justified despite knee-jerk judicial roadblock We're in the middle of a legal power struggle between Trump and California Gov. Newsom as judge blocks deployment of National Guard troops sent to quell anti-ICE riots in Los Angeles.\nVeterans June 12 EXCLUSIVE: VA Dept says LA riots forced community center closures impacting more than 600 veterans Veterans Affairs Secretary Doug Collins criticizes California officials as anti-ICE riots force closure of LA veterans care center, impacting over 600 veteran appointments.\nAndrew Cuomo June 12 Cuomo boasts Trump never sent troops to NYC in 2020 because he told him not to While Trump sent federal troops to multiple cities during the George Floyd protests in 2020, Cuomo asserts he was the reason Trump kept the National Guard out of New York City.\nJudiciary June 12 Judge mulls Trump's authority over National Guard, warns US is not 'King George' monarchy A judge questioned the DOJ during a hearing Thursday about whether Trump followed the law when he activated the National Guard in response to recent anti-immigration enforcement protests and riots in Los Angeles.\nDonald Trump June 12 Marines to begin operations in Los Angeles Friday, ahead of nationwide anti-Trump protests Marines transition from training to operational support in Los Angeles despite legal challenges from Governor Gavin Newsom, as officials defend deployment to protect law enforcement during protests."
    }
  ],
  "argos_summary": "Defense Secretary Pete Hegseth announced the federalization of Washington D.C.'s Metropolitan Police Department and the deployment of 800 National Guard troops to combat rising crime, following violent incidents in the capital. President Trump emphasized the need for law and order, labeling the situation as 'out of control,' while some D.C. residents expressed mixed feelings about the federal intervention, with concerns over local governance and safety. The deployment is described as 'conditions-based,' with the administration aiming to support law enforcement and ensure that arrested individuals are held accountable.",
  "argos_id": "H5EECWFGS"
}