{
  "url": "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-nasdaq-futures-hold-steady-as-wall-street-braces-for-july-inflation-report-234425424.html?_guc_consent_skip=1754956065",
  "authorsByline": "Amalya Dubrovsky",
  "articleId": "f3642950054b4772b552f80377f035c4",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://s.yimg.com/ny/api/res/1.2/IkPHnFZLZqrEYB2PeLVWXw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04NTM7Y2Y9d2VicA--/https://s.yimg.com/os/creatr-uploaded-images/2025-07/26e13480-5cb3-11f0-a0fd-bdfc142f067e",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T23:44:25+00:00",
  "addDate": "2025-08-11T23:48:40.291296+00:00",
  "refreshDate": "2025-08-11T23:48:40.291301+00:00",
  "score": 1.0,
  "title": "Stock market today: Dow, S&P 500, Nasdaq futures hold steady as Wall Street braces for July inflation report",
  "description": "US stock futures wavered around the flatline as Wall Street braced for July's inflation report and President Trump revealed his pick to head the Bureau of Labor Statistics.",
  "content": "US stock futures wavered around the flatline as Wall Street braced for July's inflation report and President Trump revealed his pick to head the Bureau of Labor Statistics.\n\nFutures attached to the Dow Jones Industrial Average (YM=F), the benchmark S&P 500 (ES=F), and the tech-heavy Nasdaq 100 (NQ=F) held steady.\n\nAfter the bell on Monday, Trump announced that he nominated E.J. Antoni, chief economist at the conservative Heritage Foundation, to lead the BLS.\n\n\"E.J. will ensure that the Numbers released are HONEST and ACCURATE,\" the president said on Truth Social.\n\nTrump fired Erika McEntarfer as commissioner of the BLS earlier this month following the release of the July jobs report, which contained \"larger than normal\" revisions to data and revealed fewer jobs than previously thought had been added to the economy. Trump said, without providing evidence, that McEntarfer had been acting politically and her numbers \"were wrong.\"\n\nTrump also met with Intel CEO Lip-Bu Tan Monday evening, which boosted its stock in after-hours trading. Last week, the president called for Tan to resign, but after Monday's meeting he indicated his cabinet would continue discussions with the CEO, without specifying the topics under consideration.\n\nDuring day trading, stocks slumped even as Trump granted another 90-day pause on the most punishing tariffs on China as the two countries work toward a trade deal.\n\nRead more: The latest on Trump's tariffs\n\nWall Street is preparing for the release of July's Consumer Price Index (CPI) report on Tuesday morning. Analysts expect it to show that prices increased as Trump's tariffs kicked in. A hot inflation report could put the Federal Reserve in a tight spot as it navigates rising prices amid recent signs of a weakening labor market. In the background, anticipation over the possibility of a September interest rate cut continues to grow.\n\nInvestors will get two more pulse checks on the state of the economy later this week, with the release of the Producer Price Index on Thursday and retail sales data on Friday.",
  "medium": "Article",
  "links": [
    "https://finance.yahoo.com/news/intel-stock-jumps-after-trump-calls-meeting-with-ceo-lip-bu-tan-interesting-signals-more-talks-ahead-145853670.html",
    "https://finance.yahoo.com/news/trump-reportedly-signs-order-granting-another-90-day-extension-on-harshest-china-tariffs-190826748.html",
    "https://finance.yahoo.com/chart/YM%3DF",
    "https://finance.yahoo.com/news/a-gamechanger-economists-react-to-weak-july-jobs-report-as-rate-cut-bets-surge-161638670.html",
    "https://finance.yahoo.com/news/president-trump-fires-bls-commissioner-after-july-jobs-report-disappoints-182118823.html",
    "https://finance.yahoo.com/news/a-quirk-in-the-feds-calendar-puts-extra-pressure-on-the-september-meeting-100055498.html",
    "https://finance.yahoo.com/quote/NQ%3DF/",
    "https://finance.yahoo.com/news/july-cpi-report-expected-to-show-inflation-accelerated-amid-tariff-pressures-173606177.html",
    "https://truthsocial.com/@realDonaldTrump/posts/115012532470689820",
    "https://finance.yahoo.com/news/live/trump-tariffs-live-updates-white-house-confirms-25-steel-aluminum-tariffs-start-wednesday-191201861.html",
    "https://finance.yahoo.com/quote/YM%3DF/",
    "https://finance.yahoo.com/quote/ES%3DF/",
    "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-nasdaq-slump-with-key-inflation-report-on-deck-200041060.html"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "July inflation report",
      "weight": 0.08969989
    },
    {
      "name": "President Trump",
      "weight": 0.08679311
    },
    {
      "name": "Trump",
      "weight": 0.085307665
    },
    {
      "name": "Wall Street",
      "weight": 0.07332282
    },
    {
      "name": "US stock futures",
      "weight": 0.072317705
    },
    {
      "name": "Nasdaq futures",
      "weight": 0.066582516
    },
    {
      "name": "Stock market",
      "weight": 0.06376543
    },
    {
      "name": "July",
      "weight": 0.061766956
    },
    {
      "name": "rising prices",
      "weight": 0.061659135
    },
    {
      "name": "retail sales data",
      "weight": 0.05906632
    }
  ],
  "topics": [
    {
      "name": "Inflation"
    },
    {
      "name": "Stocks"
    },
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.986328125
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.9140625
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.54296875
    }
  ],
  "sentiment": {
    "positive": 0.06557604,
    "negative": 0.7571031,
    "neutral": 0.17732094
  },
  "summary": "US stock futures have remained steady as Wall Street prepares for the July inflation report. President Trump has nominated E.J. Antoni, chief economist at the conservative Heritage Foundation, to head the Bureau of Labor Statistics. This follows the dismissal of E. McEntarfer as BLS commissioner following the release of the July jobs report, which contained \"larger than normal\" revisions and revealed fewer jobs than previously thought had been added. The Consumer Price Index (CPI) report is expected to show that prices increased as Trump's tariffs kicked in. The Federal Reserve is facing a tough time dealing with rising prices amid signs of a weakening labor market.",
  "shortSummary": "US stock futures stagnate as investors await July's inflation report and President Trump's choice for the BLS.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "3b9aff11c0724a4bba7ef87a075e0606",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://finance.yahoo.com/news/trump-reportedly-signs-order-granting-another-90-day-extension-on-harshest-china-tariffs-190826748.html",
      "text": "In This Article:\nPresident Trump on Monday signed an executive order implementing another 90-day pause on additional tariffs on China that were set to take effect on Tuesday. The move again pushes off a deadline for imposing the harshest taxes on Chinese imports as the two sides continue negotiations on a deal.\nTrump posted on social media that he had signed the order around 8 p.m. ET. Around the same time, China also announced the extension of the tariff pause via official news agency Xinhua.\nRead more: The latest news and updates on Trump's tariffs\nThe extension means headline rates agreed to in May of 30% on Chinese imports and 10% on American goods will continue for the immediate future — until a new deadline on November 10 — and avoid a snap-back to previous triple-digit levels. Sector-specific tariffs on goods like steel and some medical supplies will keep the effective tariff rate between the two countries higher.\nThe extension also comes amid an increased focus from Trump in recent days on Russia and the war in Ukraine, with Trump putting an additional 25% tariff on imports from India over that nation’s consumption of Russian oil.\nThe new pause could also increase the odds for a meeting later this year between Presidents Trump and Xi Jinping. The two men’s teams have both floated the concept of a face-to-face meeting, perhaps as soon as the coming Asia-Pacific Economic Cooperation summit in South Korea at the end of October.\nMonday's announcement also came after three meetings of the two trade teams in recent months — gatherings that took place in Geneva in May, London in June, and Stockholm in July — resulted in signs of progress, though tensions remain between the two sides.\nHe Lifeng, China's vice premier for economic policy, has represented his country at all three meetings. A representative for He — Chinese trade negotiator Li Chenggang — said after the most recent round in Sweden that the two sides had “candid exchanges over their economic concerns,” according to a translation.\nCertain issues like semiconductors, including a plan to allow the resumption of Nvidia's (NVDA) AI chip exports to China, as well as Chinese exports of rare earth minerals, have been the focus of the talks so far, with a long list of issues between the two nations still to be discussed.\nOver the weekend, the Trump administration struck a deal with Nvidia and AMD to allow those chipmakers to sell some chips into the Chinese market in exchange for a 15% cut of the sales.\nClick here for the latest economic news and indicators to help inform your investing decisions\nRead the latest financial and business news from Yahoo Finance"
    },
    {
      "url": "https://finance.yahoo.com/news/president-trump-fires-bls-commissioner-after-july-jobs-report-disappoints-182118823.html",
      "text": "President Trump said in a social media post Friday afternoon that he directed members of his administration to fire Erika McEntarfer, commissioner of the Bureau of Labor Statistics, after the BLS on Friday published a July jobs report that contained what it called \"larger than normal\" revisions to data from May and June.\nThe July jobs report published Friday morning showed the US economy added 73,000 jobs last month, fewer than expected, while the unemployment rate rose to 4.2%.\nThe most notable numbers to emerge from the report, however, were downward revisions to job gains in May and June, which saw 258,000 jobs taken away from what had been initially reported.\nMay's job gains were revised down to 19,000 from 144,000, while June's additions were cut to just 14,000 from the 147,000 initially reported.\nLabor Secretary Lori Chavez-DeRemer appeared to confirm McEntarfer's firing in a post on X, saying Deputy Commissioner William Wiatrowski would serve as interim head of the BLS. McEntarfer was confirmed as BLS commissioner by an 86-8 Senate vote back in January.\nIn its release on Friday, the BLS said these revisions \"result from additional reports received from businesses and government agencies since the last published estimates and from the recalculation of seasonal factors.\"\nAs he left the White House for the weekend later Friday, President Trump repeated his charges, without providing evidence, that McEntarfer was acting politically and that her \"numbers were wrong.\"\nHe added that he would begin reviewing candidates for her permanent replacement soon and that he has three people in particular in mind without revealing their names.\nHe responded to the question of whether the candidates he is focused on have labor statistics experience by saying, \"I'll put someone in who's going to be honest.\"\nEconomists, meanwhile, on Friday were near-unanimous in their view that July's jobs data and the revisions to May and June reflect a labor market that is far weaker than had been suggested by recent data and characterizations by some officials, notably Federal Reserve Chair Jerome Powell.\n\"The 'solid' state of the labor market described by the FOMC earlier this week looks more questionable after the July employment report,\" Wells Fargo senior economist Sarah House wrote in a note Friday.\nJob gains over the last three months have now averaged just 35,000 after Friday's revisions.\nIn his post on Friday, Trump accused McEntarfer and the BLS of reporting \"faked\" jobs numbers in the run-up to last year's election, and noted February's benchmark revision to 2024 jobs data that showed payroll growth last year was overstated by some 818,000 jobs."
    },
    {
      "url": "https://finance.yahoo.com/news/a-quirk-in-the-feds-calendar-puts-extra-pressure-on-the-september-meeting-100055498.html",
      "text": "This is The Takeaway from today's Morning Brief, which you can sign up to receive in your inbox every morning along with:\n-\nThe Chart of the Day\n-\nWhat we're watching\n-\nWhat we're reading\n-\nEconomic data releases and earnings\nNobody really knows what the future will bring, but Wall Street likes to have a good idea, especially when it comes to the Federal Reserve's next move.\nWhat might have been a likely outcome for the central bank to cut rates in September now seems closer to a toss-up, based on the way the market is reacting to Fed Chair Jerome Powell's latest remarks.\nAt the end of the Fed's policy meeting on Wednesday, Powell didn't explicitly say the next move would be a cut, and reiterated that it's still early days in understanding how tariffs will impact inflation.\n(Markets flashed red following Powell's commentary, and the CME FedWatch tool showed the likelihood of a cut in September dropped from 65% on Tuesday to 45% at the end of the meeting.)\nRead more: How the Fed rate decision affects your bank accounts, loans, credit cards, and investments\nFed policymakers don't make rate decisions ahead of time, so Powell's response is typical. But a quirk in the Fed's calendar raises the stakes for the September meeting. As Morgan Stanley's chief US economist Michael Gapen has observed, the gap between the Fed's July and September huddles is the longest in the Fed's annual schedule.\nA lot can happen between now and then.\n\"A reasonable base case is that the effects on inflation could be short-lived, reflecting a one-time shift in the price level, but it is also possible that the inflationary effects could instead be more persistent, and that is a risk to be assessed and managed,\" Powell said during the press conference Wednesday.\nWe do have some level of certainty, however. Powell indicated that, to some extent, the Fed has already chosen to look through the inflationary effect of tariffs as a one-time event. The Fed, he reminded everyone in a not-so-comforting way, could have raised rates to counteract the pricing pressures of the new levies. But he and most of his colleagues think it best to wait for now.\nHowever, a long enough wait can result in a different outlook. As Powell himself acknowledged, “We’re going to be looking at a lot of data in the next cycle. It is one of the cycles where we have two employment and two inflation reports, and we’ll see where that takes us.” As the timeline stretches out, uncertainty can expand.\nOf the data ahead, Powell noted that he's especially keeping his eye on the unemployment rate, as both supply and demand for jobs have declined — deprioritizing the headline monthly job gains. But if the unemployment rate starts to rise, that's a good indicator that the central bank has kept up its slightly restrictive posture for too long. But he also suggested the fight to curb inflation \"is most of the way back.\" We already have two dissenters on the rate-setting committee who believe the Fed should already be cutting."
    },
    {
      "url": "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-nasdaq-slump-with-key-inflation-report-on-deck-200041060.html",
      "text": "In This Article:\nStocks slipped on Monday as President Trump reportedly granted another 90-day extension for steeper China tariffs and as traders eyed a key inflation reading on Tuesday.\nThe Dow Jones Industrial Average (^DJI) fell 0.5%. The S&P 500 (^GSPC) fell 0.2%, while the tech-heavy Nasdaq (^IXIC) erased earlier gains to drop 0.3%.\nStocks slipped further into negative territory following reports that Trump pushed back his China tariff deadline until Nov. 9 as the US and China continue to negotiate a firmer deal.\nRead more: The latest on Trump's tariffs\nIn another tariff-related twist, Trump confirmed on Monday that he would allow Nvidia to sell its H20 chip to China for a revenue cut in exchange.\n\"This [H20] is an old chip that China already has,\" Trump said on Monday, noting the agreement does not extend to Nvidia's next-generation Blackwell.\nThe Financial Times first reported on Sunday that both Nvidia and AMD agreed to give the US government 15% of the money they make from selling certain computer chips to China. Nvidia and AMD shares both closed down fractionally.\nTrump has claimed that his tariffs are having a \"huge positive impact on the stock market,\" though Wall Street is still navigating the twists and turns of sweeping duties on dozens of trade partners that went into effect last week.\nWall Street will soon get another glimpse into how those tariffs are affecting price pressures in the US. The Consumer Price Index (CPI) is set for release on Tuesday, followed by the Producer Price Index on Thursday and retail sales data on Friday. Inflation reaccelerated in June, and economists have warned that the tariffs will likely continue to seep into price data in the coming months.\nOn Monday, Trump clarified that gold (GC=F) will not be tariffed. The precious metal futures market whipsawed last week amid confusion about whether Swiss bars would be subject to levies.\nLIVE COVERAGE IS OVER 20 updates"
    },
    {
      "url": "https://finance.yahoo.com/news/live/trump-tariffs-live-updates-white-house-confirms-25-steel-aluminum-tariffs-start-wednesday-191201861.html",
      "text": "President Trump on Monday signed an executive order extending the tariff truce between the US and China for another 90 days, pushing trade negotiations out to the fall. China also announced the extension of the tariff pause on state media.\nAlso, Nvidia (NVDA) and AMD (AMD) agreed to pay the US 15% of the revenue for AI-related chip sales to China, adding a monetization layer to the Trump administration's tariff policy that has reoriented global trade relationships.\nThe New York Times reported that Nvidia CEO Jensen Huang agreed to the arrangement, which is \"essentially making the federal government a partner in Nvidia’s business in China,\" at a meeting with Trump last week.\n\"To call this unusual or unprecedented would be a staggering understatement,\" Stephen Olson, a former US trade negotiator, told Bloomberg. \"What we are seeing is in effect the monetization of US trade policy in which US companies must pay the US government for permission to export. If that’s the case, we’ve entered into a new and dangerous world.\"\nThe chips include Nvidia’s H20 AI accelerator and AMD’s MI308 chips, which the Trump administration had previously targeted with export controls.\nElsewhere on Monday, Trump said imports of gold (GC=F) to the US would not face a tariff.\n\"Gold will not be Tariffed!\" Trump wrote on social media.\nGold futures were little changed after Trump's post. Prices for the metal slid on Monday.\nThe White House had said last week that the administration would issue a new policy clarifying whether gold bars would be subject to duties after a US government agency said they would, prompting chaos and confusion in the market.\nMeanwhile, Trump's latest sweeping \"reciprocal\" tariffs hit dozens of US trade partners last week.\nPresident Trump posted on social media that gold will not be subject to tariffs after a surprise US Customs and Border Protection (CBP) ruling sparked confusion over whether the precious metal faced duties.\n\"A Statement from Donald J. Trump, President of the United States of America: Gold will not be Tariffed!\" Trump wrote on Truth Social on Monday afternoon.\nOn Friday, the Financial Times reported that CBP classified Swiss one-kilogram and 100-ounce bars of gold as subject to 39% tariffs recently imposed on Switzerland by the Trump administration.\nGold futures (GC=F) declined 2.5% early on Monday as investors awaited clarity from the White House over its trade position on the precious metal amid reports that imports of Swiss gold bars would not be exempt from tariffs.\nSmall US firms paying Trump tariffs face $202B annual hit\nSmall US businesses are struggling to comply with President Trump's new tariffs. These companies, which are the source of more than half of the country's job creation are also finding it hard to cope with the growing financial strain from higher import costs.\nPresident Trump said China has been \"dealing quite nicely\" with the US, a possible hint that his administration is preparing to extend the countries' trade truce past a deadline that expires Tuesday.\n\"We'll see what happens,\" he said during a White House press conference, adding, \"They've been dealing quite nicely.\"\nThe countries have held multiple rounds of trade talks during the 90-day suspension of sky-high tariffs on each other. Both sides have hailed progress in those talks.\nAn extension into the fall could potentially set up a Trump meeting with Chinese leader Xi Jinping, which Trump has suggested could happen before the end of the year.\nGrace O'Donnell\nSwiss government to meet pharma firms to discuss US tariffs\nThe Swiss government is due to meet this week with leaders from Swiss pharmaceutical companies Roche and Novartis, which have faced pressure from President Trump to lower their drug prices in the US.\nThe meeting comes as Switzerland aims to negotiate for a lower tariff rate than the 39% rate the Trump administration imposed last week. And should Trump follow through on pharmaceutical tariffs as well, Roche and Novartis are considered to be more exposed, as they have comparatively fewer US manufacturing sites.\nNew gold tariffs are in effect. Will Costco gold bars be affected?\nGold (GC=F) has been surging all year, and buying gold bars from Costco is just about the easiest way to get your hands on the precious metal — if you're lucky enough to find them in stock.\nHowever, the surprising announcement of additional tariffs on gold bars by US Customs and Border Protection (CBP) left many wondering if the duties applied to Costco's gold bars as well.\nGoldman Sachs GS) says that President Trump's tariffs are only beginning to raise prices for shoppers, adding more uncertainty to the Treasury market where investors are unsure about how quickly interest rates will be cut.\nNvidia, AMD to pay 15% on China AI chip sales in US deal\nNvidia (NVDA) and AMD (AMD) have agreed to give 15% of their revenue from AI chip sales in China to the US government. This deal helps them get export licenses but is an unusual step that might worry both companies and Beijing.\nNvidia will share 15% of earnings from its H20 AI accelerator in China, while AMD will do the same for its MI308 chip.\nWhy Trump's soybean ask of China is 'highly unlikely'\nChina is the world's largest soybean buyer, with nearly a quarter of those purchases coming from the US (and most of the rest coming from Brazil).\nPresident Trump's statement that he hopes \"China will quickly quadruple its soybean orders\" would require China to import the vast majority of its soybeans from the U.S.\n\"It's highly unlikely that China would ever buy four times its usual volume of soybeans from the US,\" Johnny Xiang, founder of Beijing-based AgRadar Consulting, told Reuters.\nUS gold futures fall as traders await clarification on tariffs\nUS gold futures (GC=F) in New York fell 2% as traders waited for the White House to clarify its tariff policy. Last week, the US Customs and Border agency surprised the market by ruling that 100oz and 1kg gold bars would face tariffs.\nCommentary: Tariffs are denting profits, and maybe soon your portfolio\nWith over two-thirds of companies having reported earnings, Yahoo Finance found more than four dozen large firms saying tariffs are impacting their businesses in some material way.\nA 240-year-old Swiss watchmaker's race to beat Trump's tariff deadline\nIt was a chaotic week for the 240-year-old Swiss watch manufacturer DuBois et fils, as the company rushed to ship watches before President Trump's surprise 39% tariff rate on Switzerland went into effect on Thursday.\nIt was a race against time for DuBois CEO Thomas Steinemann and his company to ship five high-end watches to the US before blocking orders on its US website. Overall, the US accounts for 17% of Switzerland's watch exports. As of April, goods from the country faced a much lower 10% tariff rate.\nPresident Trump has said he loves farmers, but his policies are starting to ripple across the agriculture industry. Trump's tariff policies, in particular, are beginning to raise the cost of machinery and fertilizers, weighing on profits.\nThe US has slapped a 39% tariff on Switzerland, leaving the country's leaders reeling\nBloomberg took a deep dive looking at how the tariff negotiations between the Trump administration and Switzerland began with promise, but eventually led to the US slapping a devastating 39% levy on the country:\nCarney is patching up ties with Mexico in face of Trump threats\nCanadian Prime Minister Mark Carney is working to repair relations with Mexico as both nations prepare for the fallout from US tariffs. Canrey recently met with Mexican President Claudia Sheinbaum and various corporate executives.\nSwiss plane maker Pilatus halts business jet deliveries to US over tariffs\nSwiss aircraft manufacturer Pilatus said it temporarily stopped deliveries of its PC-12 and PC-24 business jets to the US after President Trump imposed a punishing 39% tariff rate on imports from Switzerland.\n\"The new customs tariff imposed by the US authorities represents a significant competitive disadvantage for Pilatus,\" the privately held company said.\nChina defends buying Russian oil after Trump’s tariff threat\nChina defended its purchase of Russian oil on Friday, pushing back against President Trumps threat to impose higher tariffs on Beijing for buying energy from Moscow.\nTrump warned both China and India this week and said he would impose higher tariffs on the nations if they didn't stop buying oil from Russia. The US president followed through on his threat by slapping an additional 25% tariff on India, bringing the total to 50%."
    },
    {
      "url": "https://finance.yahoo.com/news/july-cpi-report-expected-to-show-inflation-accelerated-amid-tariff-pressures-173606177.html",
      "text": "July's Consumer Price Index (CPI) is expected to show prices rose at a faster clip annually compared to June. The report, due Tuesday at 8:30 a.m. ET, comes as investors stay alert to how much President Trump’s tariffs are starting to affect consumer costs.\nAccording to Bloomberg data, headline CPI is expected to have increased 2.8% year over year in July, up from a 2.7% rise in June. On a monthly basis, prices are forecast to increase 0.2%, a slight slowdown from June’s 0.3% gain, driven by lower gasoline prices and expectations of moderately softer food inflation.\nOn a \"core\" basis, which strips out volatile food and energy prices, the annual inflation rate for July is expected to tick up to 3.0% from June’s 2.9%, indicating that rising goods inflation is no longer being offset by easing services inflation.\nCore prices are also projected to climb 0.3% month over month, outpacing the previous 0.2% rise seen in June and marking the strongest gain in six months.\nIn June, signs of tariff-driven cost pressures emerged, with apparel prices up 0.4% on a monthly basis and footwear rising 0.7% after several months of declines. Furniture and bedding prices also gained 0.4%, reversing May’s 0.8% drop, another signal that these higher costs are starting to reach consumers.\nRead more: What Trump's tariffs mean for the economy and your wallet\n\"The July CPI will bring further signs of higher tariffs pushing up prices,\" Wells Fargo economist Sarah House wrote last week. \"It is still early in the price adjustment process to see how higher import taxes will ultimately be distributed between the end-customer, domestic sellers and foreign exporters.\"\n\"At the same time, growing consumer fatigue is making it more difficult to raise prices in general,\" House added. \"We continue to expect inflation to pick up, but not ratchet higher, over the second half of the year, with both the core CPI and core PCE deflator returning to around 3% in the fourth quarter.\"\nTuesday's report is set to arrive amid ongoing trade developments that could further alter the US effective tariff rate, now hovering near 18.6% — the highest since 1933, according to the latest Yale Budget Lab estimate.\nStill, markets are increasingly betting the central bank will lower interest rates at its September meeting, driven largely by concerns over the US labor market’s health after significant downward revisions, alongside persistent inflation.\n\"CPI could leave [the] Fed with dual headaches,\" Citi analyst Stuart Kaiser wrote in a preview of the report, adding investors will likely focus on updates to core goods prices."
    },
    {
      "url": "https://finance.yahoo.com/news/a-gamechanger-economists-react-to-weak-july-jobs-report-as-rate-cut-bets-surge-161638670.html",
      "text": "Wall Street strategists are sharply recalibrating their economic outlooks after Friday's July jobs report showed weaker-than-expected hiring and staggering downward revisions to prior months' data, suggesting the labor market may be losing steam at a quicker pace than previously thought.\nThe US economy added just 73,000 jobs in July, far below the 104,000 expected by economists. But the bigger surprise came from revisions to the May and June figures, which collectively erased 258,000 jobs. This marked the largest two-month downward revision since May 2020.\nSarah House, senior economist at Wells Fargo, called the July jobs report \"a dud\" in a client note titled \"July and the No Good, Very Bad Jobs Report.\"\n\"The 'solid' state of the labor market described by the FOMC earlier this week looks more questionable after the July employment report,\" she said, citing broad-based hiring weakness in cyclically sensitive sectors like manufacturing, retail, and professional services.\nDespite persistent strength in healthcare hiring, she added, \"the pace [of job growth] has lurched lower to just 35K\" over the past three months when factoring in revisions.\nSteve Sosnick, chief strategist at Interactive Brokers, bluntly told Yahoo Finance that the July numbers were simply \"not good. There's no way to sugarcoat that. The two-month revision is just staggering. It basically wipes out two months of what we thought were healthy job gains.\"\nCiti economist Veronica Clark agreed, telling Yahoo Finance, \"It's not so much this July number, but the massive downward revisions to the June number that we had last month. ... This definitely does look like a labor market that is weakening.\"\nMeanwhile, Heather Long, chief economist at Navy Federal Credit Union, called the report a \"gamechanger\" in a post on X, echoing others in saying \"the labor market now looks a lot weaker than expected.\"\nThe unemployment rate ticked up to 4.2% in July, in line with expectations and still near historic lows. But as Clark pointed out, \"that happened despite the labor force participation rate falling more,\" a shift some economists have linked to President Trump's immigration crackdown.\nAhead of the report, there were growing concerns that increased deportations were reducing labor supply and keeping the jobless rate artificially low.\nSeptember rate cut odds surge\nThe revised data has added urgency to calls for rate cuts from the Federal Reserve, with market pricing shifting notably in the aftermath.\n\"We still anticipate that the Fed starts to cut in September with consecutive cuts thereafter leading to about 100 basis points of cuts in total,\" said Leslie Falcone, head of taxable fixed income strategy at UBS Global Wealth Management.\nFalcone noted that while the Fed had already turned more cautious, the scale of the revisions surprised even the most dovish forecasters. \"Some of these revisions are much more than what people expected. ... I do think that this is a bit on the weaker side. And it does put cuts back on the table.\"\nTraders seem to agree. Following the report, the probability of a September rate cut surged to about 80%, up from just 38% the day prior, according to the CME FedWatch Tool.\nEarlier this week, Fed governors Michelle Bowman and Christopher Waller broke from the majority of FOMC officials, dissenting against the decision to hold interest rates steady after warning that the labor market was weaker than initial data had indicated.\nThat warning appeared prescient on Friday as markets tumbled following the report. The tech-heavy Nasdaq (^IXIC) fell over 2% by midmorning, the Dow (DOW) shed nearly 600 points, and the S&P 500 (^GSPC) dropped around 1.6%. Meanwhile, bond prices surged on increased rate cut bets, sending the yield on the 10-year Treasury (^TNX) down 11 basis points to around 4.2%.\nAdding to labor market concerns, escalating trade tensions were also top of mind for investors as Trump hiked tariff rates on several US trading partners, including a surprise 39% tariff on Switzerland.\n\"The market had sort of put tariffs in the rearview mirror and assumed that the labor market was okay,\" Sosnick said. \"Well, both of those assumptions have been overturned quite dramatically this morning.\"\nThe strategist warned markets appear to be entering a \"reckoning period,\" explaining, \"We're not seeing a lot of reflexive dip buying. ... That, to me, tells me that the psychology, at least as of this particular moment, is a bit more tenuous than it was.\"\nCorrection: A previous version of this article misspelled Steve Sosnick's name. We regret the error.\nAllie Canal is a Senior Reporter at Yahoo Finance. Follow her on X @allie_canal, LinkedIn, and email her at alexandra.canal@yahoofinance.com."
    },
    {
      "url": "https://finance.yahoo.com/news/intel-stock-jumps-after-trump-calls-meeting-with-ceo-lip-bu-tan-interesting-signals-more-talks-ahead-145853670.html",
      "text": "Intel stock jumps after Trump calls meeting with CEO Lip-Bu Tan 'interesting,' signals more talks ahead\nIn This Article:\nIntel (INTC) stock jumped Monday as CEO Lip-Bu Tan met with President Trump, who had called for Tan's resignation last week.\nAfter the meeting, Trump posted to Truth Social saying that he had met with Tan along with Secretary of Commerce Howard Lutnick and Secretary of the Treasury Scott Bessent. \"The meeting was a very interesting one,\" the president wrote, adding, \"His success and rise is an amazing story.\"\nTrump said Tan and his Cabinet will \"spend time together\" and \"bring suggestions\" to him in the next week, without specifying the topics to be discussed.\nIntel also released a statement acknowledging the two met and saying they had \"a candid and constructive discussion on Intel’s commitment to strengthening U.S. technology and manufacturing leadership.\"\nIntel stock rose 3.5% on Monday during the day as reports circulated about the meeting. After Trump's post landed Monday evening, Intel continued to rise about 2.8% in after-hours trading.\nCiting unnamed sources, the Wall Street Journal reported over the weekend that Tan was set to meet with Trump on Monday to explain his personal and professional background and to propose ways that Intel and the government can collaborate.\nLast week, Trump called for Tan's resignation in a Truth Social post minutes after Fox Business covered Republican Sen. Tom Cotton's recent criticism of the CEO over his ties with China. In a letter to Intel, Cotton expressed \"concern about the security and integrity of Intel's operations,\" given Tan’s investments in Chinese businesses through his venture capital firm, Walden International.\nTrump wrote in his post last Thursday, \"The CEO of INTEL is highly CONFLICTED and must resign, immediately.”\nTan responded by saying reports about his career contained \"misinformation.\"\n\"There has been a lot of misinformation circulating about my past roles ... I want to be absolutely clear: Over 40+ years in the industry, I’ve built relationships around the world and across our diverse ecosystem — and I have always operated within the highest legal and ethical standards,\" Tan wrote in a memo to employees.\nIntel also issued its own statement following Trump's comments, emphasizing its commitment to \"advancing US national and economic security interests\" and to making investments \"aligned with the President's America First agenda,\" including domestic semiconductor manufacturing.\nTan was named Intel's CEO in March, taking over after his predecessor Pat Gelsinger was ousted by the board last year. The company struggled to stem losses in its manufacturing business, regain market share in its legacy computer chip segment, and develop an AI strategy."
    }
  ],
  "argos_summary": "US stock futures remained stable as Wall Street anticipated July's inflation report and President Trump nominated E.J. Antoni to lead the Bureau of Labor Statistics, following the dismissal of Erika McEntarfer. Trump also extended a 90-day pause on tariffs against China while meeting with Intel CEO Lip-Bu Tan, which positively impacted Intel's stock. The upcoming Consumer Price Index report is expected to show rising prices due to tariffs, raising concerns about the Federal Reserve's potential interest rate cuts amid signs of a weakening labor market.",
  "argos_id": "H7U3LSYHT"
}