{
  "url": "https://nypost.com/2025/08/11/lifestyle/model-criticized-for-taking-extreme-measures-to-achieve-18-inch-waist/",
  "authorsByline": "Asia Grace",
  "articleId": "27cfc231fd054d369fdb25eb7888d17a",
  "source": {
    "domain": "nypost.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://nypost.com/wp-content/uploads/sites/2/2025/08/newspress-collage-79guiui1r-1754931750824.jpg?quality=75&strip=all&1754917414&w=1024",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T17:10:54+00:00",
  "addDate": "2025-08-11T19:57:44.929698+00:00",
  "refreshDate": "2025-08-11T19:57:44.929699+00:00",
  "score": 1.0,
  "title": "Model branded ‘stupid’ for bizarrely binding herself in a corset 23 hours a day to keep her 18-inch waist: ‘My body should be insured’",
  "description": "What a waist of money! A Miami model is being criticized for spending more than $1 million on cosmetic procedures to achieve one of the world’s smallest waistlines at 18 inches — which she pr…",
  "content": "A Miami model is being criticized for spending more than $1 million on cosmetic procedures to achieve one of the world’s smallest waistlines at 18 inches — which she protects by wearing a corset for an astonishing 23 hours a day.\n\nAleira Avendano, 33, has endured considerable backlash over her bizarre regimen — with trolls branding her body “stupid.”\n\n“It’s been a major investment — enhancements, treatments and healthy food,” Avendano, who only unbinds herself to shower, told NeedToKnow, calling her lengthy journey “A huge commitment. Honestly, my body should be insured.”\n\nTo complement her million-dollar middle, Avendano has spent an additional $638,000 on seven boob jobs, five nose jobs, butt implants and new teeth, over nearly two decades.\n\nBut the cost of her jaw-dropping figure hasn’t just taken a toll on her wallet.\n\n“This is not just the result of hard work – [it is] often physically painful,” Avendano confessed, admitting that constantly wearing corsets has caused her organs to “shift” and “adjust” to the snug squeeze.\n\nAnd then there’s the other major pain she faces — getting dressed.\n\n“I find it challenging when it comes to buying clothes, as nothing fits,” the yoga teacher groaned.\n\n“My sizes are unique, and I have naturally wide hips,” she continued. “So I have to have clothes custom-made for me.”\n\nAnd while she’s routinely pelted with hate for her controversial curves, Avendano shrugs it off. “I don’t miss my old figure at all,” she insisted.\n\n“People react in different ways,” said the content creator, with over 1.1 million Instagram subscribers. “Some follow me, some feel nervous, and others admire me or see my body as something crazy.”\n\n“Men can’t get enough of my exotic figure,” she bragged. “I love it. I am one-of-a-kind now.”\n\nBarely-there bellies are hotly en vogue thanks to VIP voluptuaries à la Beyoncé and Taylor Swift, leaders in the corset-fashion charge.\n\nBut the vixen encourages copycats to tread lightly. She suggests folks begin strapping into the shapewear for just six hours per day, slowly increasing the wear-time up to two hours each week.\n\nAvendano is poised to launch a line of corsets and shapewear so that “people all over the world can achieve a similar figure with time and discipline.”",
  "medium": "Article",
  "links": [
    "https://nypost.com/2025/03/21/lifestyle/corsets-are-back-in-style-thanks-to-taylor-swift-beyonce-more/",
    "https://nypost.com/2025/08/07/lifestyle/maxims-unsexiest-women-list-surfaces-with-surprising-first-place-winner/",
    "https://nypost.com/2025/08/11/lifestyle/easyjet-pilot-suspended-after-going-on-nude-drunken-rampage/",
    "https://www.instagram.com/p/DLTJx-tPxgR/?img_index=3&igsh=MWMwd25zY2llZ2I2cQ%3D%3D",
    "https://nypost.com/2025/08/11/lifestyle/preppers-reveal-15-essential-items-for-a-doomsday-bunker/",
    "https://nypost.com/2025/08/11/lifestyle/dear-abby-my-sister-blames-me-for-her-daughter-moving-away/"
  ],
  "labels": [
    {
      "name": "Opinion"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Aleira Avendano",
      "weight": 0.08221574
    },
    {
      "name": "Avendano",
      "weight": 0.08202185
    },
    {
      "name": "corsets",
      "weight": 0.07738138
    },
    {
      "name": "different ways",
      "weight": 0.05692347
    },
    {
      "name": "day",
      "weight": 0.05513007
    },
    {
      "name": "VIP voluptuaries",
      "weight": 0.053628985
    },
    {
      "name": "Taylor Swift",
      "weight": 0.053196892
    },
    {
      "name": "new teeth",
      "weight": 0.0523992
    },
    {
      "name": "clothes",
      "weight": 0.05197649
    },
    {
      "name": "considerable backlash",
      "weight": 0.051936638
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Lifestyle"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.92822265625
    },
    {
      "name": "/Beauty & Fitness/Fashion & Style/Other",
      "score": 0.85205078125
    },
    {
      "name": "/Arts & Entertainment/Online Media/Online Image Galleries",
      "score": 0.73681640625
    },
    {
      "name": "/News/Gossip & Tabloid News/Other",
      "score": 0.50732421875
    },
    {
      "name": "/People & Society/Other",
      "score": 0.37548828125
    }
  ],
  "sentiment": {
    "positive": 0.07416995,
    "negative": 0.6698426,
    "neutral": 0.2559875
  },
  "summary": "Model Aleira Avendano, 33, has been criticized for spending over $1 million on cosmetic procedures to achieve one of the world's smallest waistlines at 18 inches, which she protects by wearing a corset 23 hours a day. She has also spent an additional $638,000 on seven boob jobs, five nose jobs, butt implants, and new teeth over nearly two decades. Avenano, who only unbinds herself to shower when showering, calls her body a major investment in enhancements, treatments, and healthy food. Despite the backlash, she insists she doesn't miss her old figure and is one-of-a-kind now. She plans to launch a line of corsets and shapewear for people worldwide to achieve a similar figure.",
  "shortSummary": "Miami model Aleira Avendano, 33, is criticized for wearing a corset 23 hours a day to maintain her 18-inch waist, emphasizing the need for proper insurance.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "f708fa0d57914a0ab395a2c232aa1cea",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://nypost.com/2025/08/07/lifestyle/maxims-unsexiest-women-list-surfaces-with-surprising-first-place-winner/",
      "text": "Maxim condemned after ‘unsexiest women’ list surfaces with surprising first-place winner: ‘Ridiculously cruel’\nMore like “Unsexy and the City.”\nNetizens are ripping on a controversial 18-year-old Maxim article that listed the most “unattractive” women in showbiz — with “Sex and the City” star Sarah Jessica Parker topping the Mount Rushmore of alleged off-putting celebs. The unflattering ranking came to light via a Reddit post that raised eyebrows online.\n“In 2007, Maxim thought it was clever to publish a list of ‘Unsexiest Women Alive,'” the Reddit poster wrote. “Here are the 5 women they selected.”\nSJP was named the “unsexiest woman alive,” with the men’s mag describing her as the “least sexy woman in a group of very unsexy women,” per an article from the time on Today.com.\n“How the hell did this [racehorse] Barbaro-faced broad manage to … star on a show with ‘sex’ in the title?” it read, per news.com.au.\nComing in second in this not-hot 100 was Amy Winehouse. The “Rehab” singer, who died four years later of alcohol poisoning, was lambasted for her supposed “openly hemorrhaging translucent skin, rat’s nest mane and lashes that look more like surgically attached bats.”\n“Grey’s Anatomy” star Sandra Oh placed third on this famous person “face mash,” which the Maxim scribes attributed to her “cold bedside manner and boyish figure.”\n“Self-righteous bellyaching and rapid postnuptial deterioration” landed pop sensation Madonna in fourth place, with the mag comparing her to “Nosferatu” actor Willem Dafoe.\nBritney Spears, who was in the throes of her highly publicized meltdown at the time, rounded out the so-called cosmetically catastrophic quintet due to her perceived weight gain and turbulent personal life.\nMaxim derided the pop princess as “filling chicken-grease-stained sweatpants on the cover of every trashy tabloid and gossip blog on the Internet” and having “gained two kids, two useless ex-husbands, and about 23 pounds of Funyun pudge,” per Pajiba.com.\nThe body-shaming hit list came out as a veritable Razzie Awards to the mag’s Oscars, its Hot 100 list, which was released earlier that year.\nComing in first place on that list was Lindsay Lohan, followed by Jessica Alba, Scarlett Johansson and Christina Aguilera.\nThankfully, even the oft-merciless Redditors were horrified by the derogatory piece. “Excuse the f–k out of me?” sputtered one commenter, while another wrote, “Never understood the criticism for SJP’s looks.”\n“All these women are hot? Wtf,” exclaimed a third.\nSome chalked up the list to the ridiculous beauty standards of the aughts.\n“We don’t talk enough about how ridiculously cruel the 2000s were to women’s bodies,” said another. “Jessica Simpson could not dare to add half a pound without some low life tabloid turning it [into a] headline.”\n“So, two Jewish women with prominent noses, an Asian woman, a 49-year-old woman, and a woman who had recently aged out of her sexy-baby marketing,” rued one critic. “Let’s call it like it is, none of these women fit into the Eurocentric-blonde-hair-button-nose-big-boob-flat-tummy-‘good-genes’-barely-legal category, so sadly I’m not surprised.”\nOthers thought the article was especially hypocritical given how most of the writers behind said countdowns generally weren’t easy on the eyes themselves.\n“It should be mandatory for anyone who publishes articles like this to post a picture of themselves beside their work,” declared one appalled reader.\nPajiba writer Kayleigh Donaldson pointed out that the article was even reviled at the time, writing that many media outlets deemed it in “shockingly poor taste and stunningly sexist” despite celeb body-shaming being in vogue.\n“Everyone engaged in this circle of human bear-baiting, with this handful of women held up as the acceptable targets,” she wrote. “The word ‘trainwreck’ had never been more utilized in the media vernacular.”\nSarah Jessica Parker spoke out about how much the article upset her.\n“Am I really the unsexiest woman in the world?” the actress said in an interview with Grazia magazine, the Daily Mail reported. “Wow! It’s kind of shocking.”\nShe added, “It’s so brutal in a way, so filled with rage and anger.”"
    },
    {
      "url": "https://nypost.com/2025/03/21/lifestyle/corsets-are-back-in-style-thanks-to-taylor-swift-beyonce-more/",
      "text": "Shedding inches is a cinch — with a corset in hand.\nYes, those waist-erasing, hourglass figure-forming little numbers are suddenly seen tapering the torsos of Beyoncé, Taylor Swift and the Kardashians.\nThey’re slimming A-list and everyday fashionistas to extreme proportions — and giving trendy weight-loss drugs like Ozempic a real run for their money.\n“Corsets are incredibly flattering,” Jess Work, 26, a luxury stylist from the East Village, told The Post. “They snatch you in a little and enhance your curves in the best way possible.”\nIt’s slenderizing — sans shots.\nAs women everywhere, from the center stage to the catwalk to the concrete jungle, seek taut tummies — with VIPs like Jessica Simpson and Oprah Winfrey turning to anti-obesity jabs for help — corsets are rising to become one of today’s most trimming tops.\nBut the restrictive regalia is no stranger to fashion’s spotlight.\nThe contouring togs, originally constructed with stays made of whalebone, can be traced back to the 16th century, according to Vogue.\nHowever, it wasn’t until the 1800s that corsets skyrocketed to become mainstream, must-have girdles for Regency-era noblewomen (think “Bridgerton” bombshells).\nMuch later, style icons like Madonna revived interest in the binding undergarments as sexy shirts in the 1980s — opening the floodgates to the “underwear as outerwear” fashion frenzy.\nNow, still counted as shapewear in some circles, corsets — which now typically feature boning made of either metal or plastic — and their ilk are expected to reach an estimated $3.8 billion by 2031, per recent market data via Straits Research.\nBut to avoid becoming démodé, designers are shifting away from the term “shapewear.” They are instead referring it to as “sculptwear” — offered in “a range of sensual styles that feature flattering elements that women are eager to show off in public,” the industry-watching experts say.\nAnd showing off they are.\nKourtney Kardashian recently cut a slight silhouette in a denim corset for her 40th birthday celebration.\nThe Good American courtier looked so good in the diamond-decked piece, which virtually vanished her middle and boosted her bosom, that fans suspected she’d undergone plastic surgery.\n“You know a good corset will cinch your waist and give you tatas,” Kardashian raved of her sleek physique. “I’m living my double-D life that I’ve always wanted.”\nThe siren’s youngest sister, Kylie Jenner, turned heads in a sheer black lace corset dress from Ashi Studio at Vanity Fair’s Oscar Party this month.\nJenner, 27, boasted a barely-there center while draped over beau Timothée Chalamet, 29, during the star-studded soirée.\nShe also wowed in a plunging corset gown for Jean Paul Gaultier’s Paris fashion week show in January.\nSabrina Carpenter, 25, sizzled in corset-inspired attire by Dolce & Gabbana for the March 2025 cover of Vogue. The “Espresso” singing siren has, too, debuted a slew of sparkling corsets during her “Short n’ Sweet” tour stops.\nHer fellow songstress, Swift, 35, has been spotted sporting the rib-hugging garb for both formal and casual occasions.\nMusic’s “Anti-Hero” rocked a yellow, green and black zip-up corset via Christian Dior at the MTV Video Music Awards in September. She also wore a waist-withering Versace cinched Medusa denim bustier — while cheering on NFL boyfriend Travis Kelce from the sidelines last fall.\nBut it’s pop culture’s Queen Bey and her eldest daughter, Blue Ivy, 13, who’ve served as the “core” of the viral corset craze.\nThe “Cowboy Carter” chanteuse, 43, just stunned in a stylish white ‘set — similar to the one Pamela Anderson, 57, legendarily squeezed into for the 1999 VMAs.\nAnd to toast the forthcoming launch of her hair care line at Ulta Beauty shops, Beyoncé wowed signature corsetry from Vivienne Westwood in an Instagram announcement.\nThe Grammy winner’s preteen daughter slayed a custom crystal-covered corset for their side-by-side performance at the Houston Texans vs. Baltimore Ravens game on Christmas, proving that the fitted finery knows no age limits — nor does it take any days off from being haute.\nAnd despite the tightness of their grip, Work hails corsets as “liberating” gear for glamour gals across generations, from Gen Alphas to Baby Boomers.\n“Women, especially here in New York City, are free to wear whatever we want to express ourselves,” the fashion pro said. “The corset offers a really feminine silhouette, it accentuates curves and helps us embrace our natural bodies.”\n“It’s liberating.”"
    },
    {
      "url": "https://nypost.com/2025/08/11/lifestyle/preppers-reveal-15-essential-items-for-a-doomsday-bunker/",
      "text": "Peek inside a real doomsday bunker — with the 15 essential items preppers say will keep you alive for a year\nThey won’t be doomed.\nA couple from Montana has turned to full-scale “prepping” in response to rising global tensions, they say — stockpiling enough supplies to survive a year off-grid in case of war, natural disaster, or prolonged power outages.\nCarrie and Colton Smith, both in their mid-30s, began preparing for an uncertain future in early 2023 — after a Chinese surveillance balloon was seen flying over the U.S., triggering national concern before being shot down.\nThe event was a “wake-up call” for the couple, prompting them to take survival into their own hands.\n“I grew up in California, where there are earthquakes, so my family was always prepared for natural disasters — but the balloon took things to the next level for us,” Carrie, a housewife who now shares prepping tips to over one million followers under the handle @housewifeprepper, told SWNS.\n“I realized I needed to take matters into my own hands.”\nSince then, the Smiths have amassed a wide range of supplies, including four generators, three 55-gallon water drums, freeze-dried foods with a 25-year shelf life, and various forms of protection such as firearms and tasers.\nThey’ve also invested in solar panels, satellite phones, solar-crank radios, and even a life raft — an item she said once saved one of her followers’ lives during a flood.\nThe Smiths believe they could survive for a year off their supplies.\n“Every homemaker should factor it in,” Carrie said. “It’s an extension of caring for your family.”\nCarrie emphasized that prepping isn’t just for major catastrophes.\n“It isn’t just doomsday or World War 3; it could be a job loss, a natural disaster, anything,” she said.\nThe couple has built a comprehensive plan, including “bug-out bags” for themselves and their Goldendoodle, Sky, to grab and go.\nThey’ve spread their gear across several locations — including their home, cars, and even friends’ houses — forming a small support network they can count on in a crisis.\nTheir supplies cover five core categories: food, water, shelter, self-defense, and communication.\nThough some may view their lifestyle as extreme, the Smiths say it’s simply responsible.\n“Prepping is very expensive and you can’t do it overnight — but it’s an investment, like a form of insurance,” she said.\n“It’s about feeling confident in the supplies you have. It’s not extreme, it’s smart.”\nCarrie noted that food, water, shelter and power are most important, followed by self-defense items and then communication tools.\n15 essential doomsday bunker items for preppers:\n• Water filtration & purification (portable filter, purification tablets/drops)\n• Stored water supply (at least one gallon per person per day)\n• Emergency food supply (freeze-dried meals, canned goods, rations)\n• Fire-starting tools (ferro rod, waterproof matches, lighter, tinder)\n• First aid kit (trauma supplies, meds, antiseptics, bandages)\n• Emergency shelter (tarp, lightweight tent, mylar blanket)\n• Warm clothing & insulation (wool socks, thermals, waterproof layers, gloves)\n• Multi-tool or survival knife (fixed blade preferred)\n• Light sources (headlamp + flashlight with spare batteries or solar)\n• Navigation tools (compass, maps, GPS backup if possible)\n• Portable power source (solar charger, power bank, tri-fuel generator, solar generator)\n• Communication gear (emergency radio, whistle, backup phone, satellite phone)\n• Self-defense tools (pepper spray, firearm, where legal, or alternative)\n• Sanitation & hygiene items (soap, wipes, toilet paper, waste bags)\n• Important documents & cash (waterproof bag with ID, cash, emergency contacts)"
    },
    {
      "url": "https://nypost.com/2025/08/11/lifestyle/easyjet-pilot-suspended-after-going-on-nude-drunken-rampage/",
      "text": "EasyJet pilot booted after marathon drinking binge at resort, ‘cavorting naked’ before flight: ‘Breathtakingly unprofessional’\nHe was “taking off” in a different way.\nAn EasyJet pilot has been suspended after he embarked on a drinking marathon that ended with him wandering around a hotel naked.\n“This was breathtakingly unprofessional behavior from the pilot,” an anonymous source told the Sun while recounting the booze cruiser’s drunken rampage. “It was the height of stupidity. His career with EasyJet is doomed.”\nThe incident occurred August 9 after veteran flyboy had reportedly just gotten done ferrying vacationers from the UK to Cape Verde, an idyllic island nation in West Africa.\nHe reportedly checked in at the five-star Melia Dunas Beach Resort and Spa, whereupon he proceeded to embark on a post-flight booze binge.\nHis bender eventually spiraled out of control.\nAt around 2:30am August 5, appalled guests reportedly witnessed the plastered pilot undress and wander into the reception area, before continuing on to the gym and spa in his birthday suit. He was reportedly in a “paralytic” state, sources said.\n“The pilot did not have a stitch on and reeked of alcohol,” another anonymous airline insider told the outlet.\nTo make matters worse, the flyboy was slated to make the 2,332-nautical-mile trip back to Gatwick in London on the afternoon of August 6, the BBC reported.\nHowever, onlookers identified the boozy bozo and alerted the EasyJet brass, who took him off the plane and found a replacement.\n“As soon as we were made aware, the pilot was immediately stood down from duty, in line with our procedures,” an airline rep declared. “The safety of our passengers and crew is EasyJet’s highest priority.”\nThey have since launched a probe into the flyboy’s naked antics.\nThe aforementioned source agreed with the decision on the grounds that “anyone who saw the pilot cavorting naked in the early hours on the day before a flight would not dream of getting on a plane with him at the controls.”\n“He was so drunk that you wouldn’t have put him in charge of a toy airplane, never mind the real thing with hundreds of passengers,” they said. “We all make mistakes but the level of stupidity on display here by a veteran captain beggars belief.”\nUnfortunately, this isn’t the first sky captain to get busted for hitting the sauce before a flight.\nEarlier this year, a Southwest Airlines pilot was arrested shortly before takeoff on Wednesday in Georgia after he allegedly showed up to work intoxicated, police say."
    },
    {
      "url": "https://nypost.com/2025/08/11/lifestyle/dear-abby-my-sister-blames-me-for-her-daughter-moving-away/",
      "text": "DEAR ABBY: My sister, “Jenny,” and I have had a falling-out and no longer speak. She’s upset with me because she found out her adult daughter, “Paisley,” had moved without telling anyone.\nI discovered it when Paisley had some mail sent to my house and later revealed she had moved across the country. Jenny and Paisley were no-contact; they had a huge argument six months ago and haven’t spoken since. I was in contact with both. Paisley explicitly told me that she didn’t want to deal with her mother.\nWhen I found out Paisley had moved, I asked if she wanted me to tell her mom because Jenny had blocked her. She said no. Our mom found out because Paisley also had her mail sent to Mom’s home, and Mom thought she was still in town. Mom told Jenny, and Jenny erupted on me. I thought I was doing what everyone wanted. Was I the villain in the story? — CONFOUNDED IN KENTUCKY\nDEAR CONFOUNDED: You did nothing wrong. Your sister erupted on you because you were handy. It’s a shame your sister and her daughter couldn’t mend fences, but the fault doesn’t lie with you. Paisley moved to escape the dysfunction in the family, which may have been wise, because there appears to be plenty of it. You are not a villain, and you should not accept being labeled that way.\nDEAR ABBY: My spouse continuously scrolls through video posts on her cellphone while we are in the same room. I have asked her to please engage her earphones, but she seldom does. Now, I simply turn off the TV and wait sometimes for up to a couple of hours before she quits. I don’t dare tell her that this is annoying. I have tried going into other rooms but feel trapped in my own home with her scrolling nonsense. When I have tried to talk to her, she throws all my faults in my face to shut me down on this subject. Suggestions? — HEARING TOO MUCH IN OHIO\nDEAR HEARING: Yes, I suggest that while your spouse has every right to disappear down the rabbit hole of her cellphone if she wishes, to insist on inflicting the audio on you is inconsiderate. Asking her to engage her earphones isn’t rude — it’s a natural response to being forced to be an unwilling audience. I have pointed out in the past that “the best defense is a strong offense.” This is the tactic your spouse is employing so she won’t have to cooperate.\nSome sessions with a licensed family therapist might help you to become more assertive. If you can’t bring yourself to do that, then my last suggestion is this: Choose an activity that takes you away from the house and introduces you to friends with similar taste in entertainment to your own.\nDear Abby is written by Abigail Van Buren, also known as Jeanne Phillips, and was founded by her mother, Pauline Phillips. Contact Dear Abby at http://www.DearAbby.com or P.O. Box 69440, Los Angeles, CA 90069."
    }
  ],
  "argos_summary": "Miami model Aleira Avendano has faced criticism for spending over $1 million on cosmetic procedures to achieve an 18-inch waist, which she maintains by wearing a corset for 23 hours a day. Despite the backlash and physical discomfort from her regimen, she remains committed to her body transformation and plans to launch a line of corsets. Meanwhile, a resurfaced Maxim article from 2007 listing the 'unsexiest women' has sparked outrage, highlighting the cruel beauty standards of the past.",
  "argos_id": "HL2AK2U8S"
}