{
  "url": "https://www.forbes.com/sites/matissa/2025/08/11/how-many-max-contracts-should-the-nba-have-each-year/",
  "authorsByline": "Mat Issa",
  "articleId": "c15cfdc9390c482b84eb683c64fb0dd9",
  "source": {
    "domain": "forbes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NJ",
      "county": "Hudson County",
      "city": "Jersey City",
      "coordinates": {
        "lat": 40.7215682,
        "lon": -74.047455
      }
    }
  },
  "imageUrl": "https://imageio.forbes.com/specials-images/imageserve/689a2818ca6183ea42c4f669/0x0.jpg?format=jpg&crop=2591,1458,x0,y107,safe&height=900&width=1600&fit=bounds",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T18:04:14+00:00",
  "addDate": "2025-08-11T20:26:17.505540+00:00",
  "refreshDate": "2025-08-11T20:26:17.505543+00:00",
  "score": 1.0,
  "title": "How Many Max Contracts Should The NBA Have Each Year?",
  "description": "It feels like more max contracts are being handed out than ever. But how many players actually produce at a level that warrants this type of payday?",
  "content": "As frequent readers of my work are well aware, the financial side of the game is nearly as important as the actual product on the court. Time and time again, we see that the best teams are those that get the best value for their investment.\n\nRecently, in an article focused on examining De’Aaron Fox’s new extension, I discussed the “Flawed Star” dilemma that is killing teams around the league. By my definition, a flawed star is a player who is being paid maximum-level money but doesn’t necessarily produce at that level.\n\nThis got me thinking: How many players truly deserve a max contract?\n\nFor this exercise, we are going to reverse engineer the formula I normally use to estimate a player’s yearly monetary value (production*value of a win = estimated production value).\n\nFirst, we will take the maximum salary cap each team is allotted in a given season. For example, in 2024-25, that number was 140.6 million. Then, we divide that number by 41 (since the average team would theoretically go 41-41 in a given season). From there, quick math tells us that a win was worth 3.4 million dollars that season.\n\nAfter that, we take the 30% max salary for that season (42.2 million in 2024-25) and divide it by 3.4, which gives us 12.4. So, to be “worth” a max contract in 2024-25, you need to provide your team with at least 12.4 wins.\n\nAccording to the website Dunks & Threes, seven players eclipsed that threshold in 2024-25, yet 24 players were paid at least 30% of their team’s salary cap. We then rinsed and repeated this arithmetic for every season all the way back to 2012-13 (Spotrac’s leaguewide salary data only goes back to 2011-12, and that season was a lockout, so we cut our analysis off at 2012-13 to keep things nice and clean).\n\nNow, without further ado, here is what we found:\n\nThere are two interesting epochs at play here. From 2019 to 2025, we had an average of 17.7 players per year being paid max contracts, despite only 7.7 players providing enough value to warrant that type of payment.\n\nJuxtapose this with the data we gathered from 2012 to 2019, and during that period, only eight players per year were earning max money. However, based on our equation, 14.3 players deserved to be paid the highest dollar amount teams can offer.\n\nRight now, the league has something of a salary cap epidemic – there are more max contracts out there than there are max players; hence, the emergence of the flawed star category that gave rise to this entire article in the first place.\n\nBut it wasn’t always like this. For most of the 2010s, there weren’t enough max contracts for the number of max players in the league. So, what’s going on?\n\nThe league’s tendency to over-index on precedent has led to the current financial conundrum we are seeing teams face today. In negotiations, a player can cite a past player of similar caliber getting a max contract and demand that they receive the same. It doesn’t matter that said player wasn’t qualified for this illustrious designation. The fact that they got it is convincing enough.\n\nIn the future, a smart team would be wise to reject the status quo and not automatically give a very good player a contract they can’t meet the expectations of simply because that is the perceived going rate of a player in today’s financial landscape.\n\nNot only are there more max contracts out there than there were a half decade ago, but there are also fewer max-level performers. What’s causing this?\n\nUnfortunately, I don’t have as firm an answer to this riddle. My guess is it is some combination of an increase in load management causing players to miss more games/play fewer minutes (remember, contracts are handed out for regular season production, not the playoffs) and the growing injury crisis many fear is taking shape. Examining this subject matter further would be a great follow-up to this article.\n\nIn any event, one thing is clear after this experiment: there are too many max contracts circulating around the NBA world right now, and teams need to tighten up their spending.",
  "medium": "Article",
  "links": [
    "https://www.forbes.com/games/queens",
    "https://www.forbes.com/sites/matissa/2025/08/05/san-antonio-spurs-make-critical-error-in-deaaron-fox-extension/",
    "https://www.wsj.com/sports/basketball/nba-free-agency-trade-lillard-tatum-haliburton-22385428",
    "https://www.forbes.com/games/pinpoint",
    "https://www.forbes.com/frase/",
    "https://www.forbes.com/sites/matissa/2025/04/04/best-contracts-of-the-2024-25-nba-season/",
    "https://www.bovada.lv/",
    "https://www.forbes.com/games/crossclimb",
    "https://youtu.be/1hzuAWXUJrk?si=vGeJ3Qyc_ZYe13N8",
    "https://www.forbes.com/sites/matissa/2025/07/07/offseason-recap-which-teams-got-the-best-bang-for-their-buck-in-fa/"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "max players",
      "weight": 0.1216039
    },
    {
      "name": "players",
      "weight": 0.10433361
    },
    {
      "name": "max contracts",
      "weight": 0.10290035
    },
    {
      "name": "said player",
      "weight": 0.1021834
    },
    {
      "name": "more max contracts",
      "weight": 0.101958826
    },
    {
      "name": "enough max contracts",
      "weight": 0.10092633
    },
    {
      "name": "teams",
      "weight": 0.079984576
    },
    {
      "name": "contracts",
      "weight": 0.078495845
    },
    {
      "name": "max money",
      "weight": 0.07792888
    },
    {
      "name": "regular season production",
      "weight": 0.07073976
    }
  ],
  "topics": [
    {
      "name": "Basketball"
    },
    {
      "name": "NBA"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/Sports/Team Sports/Basketball",
      "score": 0.94140625
    },
    {
      "name": "/News/Sports News",
      "score": 0.81591796875
    }
  ],
  "sentiment": {
    "positive": 0.1238942,
    "negative": 0.48217863,
    "neutral": 0.3939272
  },
  "summary": "The article discusses the \"Flawed Star\" dilemma within the NBA, where players are paid maximum-level money but do not necessarily produce at their high level. The author suggests that the best teams are those that get the best value for their investment. Using a formula to estimate a player's yearly monetary value, we use the maximum salary cap each team is allotted in a given season to calculate a win being worth 3.4 million dollars. To be \"worth\" a max contract in 2024-25, the player must provide at least 12.4 wins. However, this formula is repeated for every season since 2012-13. From 2019 to 2025, we had an average of 17.7 players per year being paid max contracts, despite only 7.7 providing enough value to warrant that type of payment. The article suggests that this trend of over-indexing on precedent has led to the current financial conundrum, with teams facing increased scrutiny in negotiations.",
  "shortSummary": "The NBA faces a salary cap epidemic, with multiple max contracts and flawed stars, making teams less likely to succeed.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "79409b32f9834869afb7c0af4914d04e",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.forbes.com/sites/matissa/2025/07/07/offseason-recap-which-teams-got-the-best-bang-for-their-buck-in-fa/",
      "text": "As much as we love to ordain players as \"hoopers\" or marvel over how \"tuff\" their game is, basketball is – and always has been – a game of numbers. Scoring efficiently matters. Valuing possessions matters. And in the offseason, spending money wisely matters.\nThe best teams always get the most value for their dollar, and the worst ones tend to overspend on subpar production. Last season, the two best contracts belonged to the current defending champions (Shai Gilgeous-Alexander and Jalen Williams).\nTherefore, it is essential to assess how effectively money is being spent across the league. That is why, in this two-part mini-series, we are going to look at the best and worst contracts signed in free agency to this point (Monday, July 7). As the title of the article suggests, for this edition, we will be focusing on some of the best financial case studies of this offseason.\nMethod For Assessing Player Value\nAs a reminder, we are going to focus on a method inspired by Seth Partnow’s book, “The Midrange Theory.”\nIn his book, the former Director of Basketball Research for the Milwaukee Bucks discusses a formula that teams use to estimate a player’s monetary value. In its essence, the formula involves multiplying how many points a player is \"worth\" by the amount a win \"costs\" in a given season. Unfortunately, Real-Adjusted Plus-Minus (RAPM) — a major component in the formula — is no longer available. So, I've revised Partnow’s formula a bit.\nThe Website Dunks & Threes offers a metric called Estimated Wins (EW). As the name implies, this measure quite literally estimates how many wins a player earned for their team in a given season. Theoretically, by multiplying this number by the amount a win is worth in a given season (3.8 in 2025-26), we can get an idea of how much they should be making next season. From there, we can compare the average annual value of the contract they received to the amount this exercise produced to see the disparity in how much they got paid versus what they are actually worth.\nNow, there are some shortcomings to using such a simple method for calculating a player’s value. First, we are limited to the methodology used to compute EW. As is the case with any catch-all metric, EW can only tell you how many wins a player added in their specific role on their specific team.\nAnd second, this sort of method biases against players who struggle with injuries — since they aren’t on the court to help have an impact on winning. In some instances, like with players who are consistently injured, this can be helpful. But in one-off cases, where a player is uncharacteristically unhealthy for a year, this can make a player look far less valuable than they actually are (we’ll talk more about these specific examples in Part Two).\nNow, with all the necessary background context laid out, let’s take a look at the best contracts of the 2025 offseason up to this point.\n(Sidebar: We are only focusing on contracts signed by restricted/unrestricted free agents, not extensions signed by players with time still left on their current contract.)\nThe Best Contracts Of The 2025 Offseason\nOne last little teaser before we get into the top 10 contracts of the 2025 offseason. Much has been made about the problems posed by the new CBA and how difficult the first and second aprons have made life on teams. However, an underrated bright spot is that it is causing teams to make much smarter decisions with their money. Last season, when we did this exercise, only 29 of the 68 (42.6%) contracts we looked at were neutral/positive value deals based on this formula. This year, 33 of 61 contracts (54.1%) fit that description. Quick round of applause for all the front offices out there!\nAnyway, here are the top 10 contracts of the 2025 offseason:\nHonorable Mentions: Davion Mitchell, D’Angelo Russell, Sam Merrill, Kevon Looney, and Nicolas Batum.\nWhat an offseason for the Houston Rockets. Not only did they win the Kevin Durant sweepstakes, but they also were the only team to have two signings finish in the top 10 on our list. Even more incredible is that Fred VanVleet only played 60 games last season. If he had played 70 games (more in line with his three seasons prior to this one), he’d have a production value of 37.2 million dollars.\nBrook Lopez may have looked old and slow against the Indiana Pacers, but he’s still a starting-caliber regular-season center in this league. The fact that the Los Angeles Clippers got him for the price of a backup is insane value, and a huge reason why they own the best contract of this offseason.\nTy Jerome had one of the ten best non-rookie contracts of this past season. However, because of a poor showing in the second round (again, against the Pacers), the market cooled off on him. So, the Memphis Grizzlies were able to get him at a bargain price.\nFor the second straight year, the Milwaukee Bucks were able to sign Gary Trent Jr. for the veteran minimum, despite him performing like a high-level bench player on paper.\nOf these contracts, the one I am most excited about is the New York Knicks' signing of Guerschon Yabusele. After being one of the feel-good stories of last year, the Knicks were able to bring him in at a figure that was less than half his projected production value. Yabusele is basically a lite version of Karl-Anthony Towns (a very skilled offensive big who struggles on defense). He will provide a solid facsimile of Towns whenever the All-NBA big man is resting or in foul trouble.\nTo see Part Two of this mini-series (where we discuss the worst signings of the offseason), be sure to visit this link here."
    },
    {
      "url": "https://www.forbes.com/sites/matissa/2025/04/04/best-contracts-of-the-2024-25-nba-season/",
      "text": "The dialogue around salaries is often misguided, but contracts are a part of the game. In a game where each franchise’s resources are limited, the best teams are the ones who get the most bang for their buck.\nAnd while the reason we do all this is to see who the last team standing is, contracts are technically paid based on regular season production. So, with the end of the 2024-25 NBA regular season almost upon us, it feels like the right time to look back at which contracts flopped and which ones turned out to be money well-spent.\nIn Part One of this two-part mini-series, we highlight the best contracts from this past season.\nThe Methodology\nIn the past, we have used multiple methods to try and project how much a player should make on their next contract. Well, in this article, we are going to focus on a method inspired by Seth Partnow’s book, “The Midrange Theory.”\nIn his book, the former Director of Basketball Research for the Milwaukee Bucks discusses a formula that teams use to estimate a player’s monetary value. In its essence, the formula involves multiplying how many points a player is “worth” by the amount a win “costs” in a given season. Unfortunately, Real-Adjusted Plus-Minus (RAPM) — a major component in the formula — is no longer available. So, I've revised Partnow’s formula a bit.\nThe Website Dunks & Threes offers a metric called Estimated Wins (EW). As the name implies, this measure quite literally estimates how many wins a player earned for their team in a given season. Theoretically, by multiplying this number by the amount a win is worth in a given season (3.4 million in 2024-25), we can get an idea of how much they should be making next season. From there, we can compare the average annual value of the contract they received to the amount this exercise produced to see the disparity in how much they got paid versus what they are actually worth.\nThanks to the help of Data Scientist Fran Huzjan (@FHuzjan on Twitter), we were able to calculate the production value of every NBA player who played meaningful minutes and subtract that number from their actual salary this season – giving us the best/worst contracts of the year.\nNow, there are some shortcomings to using such a simple equation for calculating a player’s value. First, we are limited to the methodology used to compute EW. As is the case with any catch-all metric, EW can only tell you how many wins a player added in their specific role on their specific team.\nAnd second, this sort of method biases against players who struggle with injuries — since they aren’t on the court to help have an impact on winning. In some instances, like with players who are consistently injured, this can be helpful. But in one-off cases, where a player is uncharacteristically unhealthy for a year, this can make a player look far less valuable than they actually are (we’ll talk more about these specific examples in Part Two).\nTwo Types Of Great Contracts\nFor this part of the series, we separated the best contracts into two categories. The first one consists of all the rookie-scale deals. With the way the current CBA is structured, you can only pay young players a certain amount of money based on where they were selected in the draft. That is what makes hitting on draft picks so important. If you can evaluate talent properly, you can get a 30-million-dollar player for a third of the price.\nThe other group will be all the non-rookie contracts. It is much harder to get a massive disparity between production value and current salary, but when you can do it, you gain a massive strategic advantage over the field.\nThe Best Rookie Contracts\nNow that all the background context has been established, here are the ten best rookie-scale deals in the NBA this year:\nHonorable mentions: Jaylen Wells, Walker Kessler, Andrew Nembhard, Scottie Barnes, and Keegan Murray.\nWe told you great teams make the most of their resources. Five of the top six best rookie deals belong to players on top three teams in their respective conferences. Three of those six players are from the well-regarded 2021 Draft. There are four total 2021 guys in the top 10 when you add Cade Cunningham into the mix.\nIt is also insanely impressive that Victor Wembanyama managed to outplay his actual salary by 17.2 million dollars despite only playing in 46 games. If he had played 70 games, he’d have the best contract in the league (even including the non-rookie contracts).\nBy the way, a special shoutout to Toumani Camara, who continues to be the biggest steal of the 2023 Draft.\nThe Other Best Contracts\nNow, here are the other ten best contracts from this season:\nHonorable mentions: Luke Kornet, Jarrett Allen, Nikola Jokic, Tyus Jones, and Guerschon Yabusele.\nIt is yet another notch in the belt of what looks to be an MVP campaign for Shai Gilgeous-Alexander that, despite making almost 36 million dollars this year, he still has the greatest difference in production value/actual salary of any player in the association. For those wondering, his greatest competitor, three-time MVP Nikola Jokic, is outperforming his 51.4 million dollar salary by nearly 11 million dollars.\nThe two leading candidates for Sixth Man of the Year (Payton Pritchard and Malik Beasley) both made it into the top five, along with two of the most underrated role players in the league (Ivica Zubac and Derrick White).\nIt is also cool to see two undrafted guys (Scotty Pippen Jr. and Keon Ellis) and two guys who seemed to be on their way out of the league (Ty Jerome and Kris Dunn) become some of the most valuable assets in the sport by cracking the top 10.\nStay tuned for Part Two of this series to see the worst contracts of the 2024-25 season. All data is up to date as of April 3, 2025."
    },
    {
      "url": "https://www.forbes.com/sites/matissa/2025/08/05/san-antonio-spurs-make-critical-error-in-deaaron-fox-extension/",
      "text": "On Monday, it was announced that the San Antonio Spurs agreed to an extension that will keep their star starting point guard De’Aaron Fox under contract through the 2029-30 season.\nThe Spurs acquired Fox in a blockbuster three-team trade involving the Sacramento Kings and Chicago Bulls this past trade deadline. In 17 games with San Antonio (before being sidelined with a season-ending thumb surgery), Fox averaged 19.7 PPG, 6.8 APG, 4.3 RPG, and 1.5 SPG on 53.7% true shooting.\nConsidering the Spurs invested a good deal of draft capital to pair him with their franchise big man, they are probably happy to have gotten this deal done. However, I’m not super sure they should be thrilled by how this turned out.\nThe San Antonio Spurs Should Not Have Signed De’Aaron Fox To A Max Contract Extension\nI want to make one thing clear. I think Fox is an outstanding player, and on a personal level, I am always happy to see an athlete be rewarded for all their hard work. But at the end of the day, all NBA teams are bound by a salary cap and a finite number of resources. Therefore, it is of the utmost importance to ensure that each player receives payment as close to their actual production value as possible. And in this instance, I think the Spurs failed to do that, thereby limiting their financial flexibility moving forward.\nAs many of my readers are aware, I deploy a method for estimating player production value that is loosely based on the one used by Seth Partnow in his book, \"The Midrange Theory.\" To learn more about it, check out this article here, but the general gist of it is that you multiply a player’s production (measured by Dunks & Threes’ Estimated Wins metric) by the amount a win costs (next season, a win is worth roughly 3.8 million dollars) to get their overall production value.\nAnyway, if Fox plays at the level he played at last year next season, he will be worth about 23.6 million dollars, which is 13.5 million dollars less than he is slated to make (and his extension doesn’t even kick in until 2026-27). In 2026-27, that type of production would be worth 24.8 million (nearly half of what he’s expected to make).\nEven if we granted Fox a cleaner bill of health (he only played 62 games last year), he would still be well behind the lofty figures he’s getting paid. If Fox played 75 games at the rate he played at this past season, his production value would still only be 30 million in 2026-27 (the Spurs are on the hook for 49.6 million).\nOf course, injuries weren’t the only thing that hindered Fox in 2024-25. Fox clearly wanted out of Sacramento months before he was actually moved, and that likely hindered his performance. A more accurate way to conduct this type of analysis would be to assume he plays closer to his 2022-23 self (his lone All-Star appearance). Still, he doesn’t live up to his monster salary:\nDe’Aaron Fox Is A Flawed Star\nThis brings us to the \"Flawed Star\" concept I introduced nearly a year ago. Flawed stars are high usage players who sit in the league’s upper echelon, usually in the borderline All-Star/top 50 range, but for one reason or another, they have a weak point that keeps them from being a true top 15-20 player in the association.\nFor Fox, those variables are his jumper (career 33% 3-point shooter) and a good but not great passing profile relative to other primary ball handlers (83rd percentile Passer Rating, per Thinking Basketball).\nFlawed stars are incredibly valuable, but max contracts aren’t really intended for them. So, when you sign a flawed star to a max contract, you create serious roster-building limitations for yourself in the future.\nAs we’ve learned with the Phoenix Suns, the three-star model no longer works. So, the Spurs are going to have to hope that Fox and Victor Wembanyama (who will also command a max contract when the time comes) have enough firepower to be the two stars they can build their next contender around.\nThe Spurs will need to compile the perfect amalgamation of role players to flank their star tandem. This is far from a futile operation, but it would certainly be a lot less difficult had they not given Fox a maximum extension."
    }
  ],
  "argos_summary": "The article discusses the financial dynamics of NBA contracts, particularly focusing on the concept of 'flawed stars'—players who receive maximum-level salaries but do not consistently produce at that level. It highlights a disparity between the number of players receiving max contracts and those who actually warrant them, with data showing an increase in max contracts since 2019 despite fewer players meeting the production threshold. The author critiques the San Antonio Spurs' decision to extend De'Aaron Fox's contract, arguing that it limits their financial flexibility and roster-building potential due to Fox's inconsistent performance and injury history.",
  "argos_id": "HLQIULO76"
}