{
  "url": "https://www.yahoo.com/news/articles/international-group-accuses-major-nations-021500718.html",
  "authorsByline": "Alyssa Ochs",
  "articleId": "eb2f5de0652642f6a7d8d13945837803",
  "source": {
    "domain": "yahoo.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://s.yimg.com/ny/api/res/1.2/YVZmuz87nBEM1gGyUratgw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA7Y2Y9d2VicA--/https://media.zenfs.com/en/the_cool_down_737/5b26b880153f27139442de2efe7e3afc",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T02:15:00+00:00",
  "addDate": "2025-08-12T02:55:37.565966+00:00",
  "refreshDate": "2025-08-12T02:55:37.565969+00:00",
  "score": 1.0,
  "title": "International group accuses major nations of withholding more than $400 million in life-saving funds: 'Every delay means ... more lives lost'",
  "description": "\"This should not be part of any criteria.\"",
  "content": "Developing countries are calling out wealthy nations for not following through on their promises to deliver climate damage aid.\n\nAs Climate Home News reported, rich countries pledged $789 million to the Fund for Responding to Loss and Damage two years ago. However, they have collectively paid only $348 million so far, with no indication of when the remainder will be distributed.\n\nWhat is climate loss and damage funding?\n\nThe Fund for Responding to Loss and Damage addresses vulnerable communities' needs in developing nations that have been devastated by weather events fueled by the changing climate. The fund helps pay for initiatives to help these communities recover from extreme storms, rising sea levels, and other climate-related crises.\n\nA 26-member board oversees the fund, with 14 members serving from developing countries and 12 from wealthier nations.\n\nNations established the fund at the 2022 United Nations Climate Change Conference and operationalized it at the 2023 conference. The fund received initial pledges from 28 countries, 22 of which have signed contribution agreements.\n\nNations with the largest gaps between pledging money and delivering it include Italy, the United Arab Emirates, France, the United Kingdom, Australia, and Sweden.\n\nWhy is funding essential for victims of the changing climate?\n\nA 2024 study assessed that the changing climate causes approximately $395 billion in losses and damages annually. Developing countries bear the brunt of that financial burden because they lack the resources to rebuild after natural disasters.\n\nThere's no denying that addressing the effects of the changing climate is expensive. However, not addressing the devastating impacts as early as possible will result in greater costs in the long run.\n\nWith multiyear disbursement schedules rather than full upfront payments, the fund's board isn't able to spend the money effectively and where it's most needed.\n\nThere is a lack of predictability and transparency surrounding the delayed payments, too. The funds available aren't enough to complete proposed repair projects, leading the board to consider seeking private-sector financing.\n\nHowever, some board members, including Egypt's Mohamed Nasr, oppose leveraging private money because the fund's purpose is to help people suffering from the climate crisis — not provide investment opportunities.\n\n\"This should not be part of any criteria when we deal with loss and damage funding,\" Nasr said, per Climate Home News.\n\nPhilippines President Ferdinand Marcos emphasized the urgency of receiving these funds and said, \"Every delay means more families without shelter, more livelihood disrupted and worse — more lives lost.\"\n\nDespite the slow movement of funds, the board is still expecting to approve its first climate projects by early next year. There will be a call for proposals in October, and first approvals will be granted in February, according to Climate Home News.\n\nClimate aid is critical for poor communities because it helps them recover from disasters and boost their resiliency for subsequent storms. Climate projects in developing nations may focus on securing safe drinking water, relocating homeowners from flood-prone areas, and reviving economic growth.\n\nYou can support the needs of vulnerable communities in developing nations by contacting your elected officials and encouraging their support of climate action policies.\n\nYou can also learn more about the critical climate issues affecting people worldwide and reach out to organizations to offer donations or volunteer efforts.\n\nJoin our free newsletter for good news and useful tips, and don't miss this cool list of easy ways to help yourself while helping the planet.",
  "medium": "Article",
  "links": [
    "https://guide.thecooldown.com/recording-votes/should-the-ultra-wealthy-pay-a-tax-to-help-offset-their-environmental-impact/?answer=1&article=recP1g9q4M6q8vK0h",
    "https://unfccc.int/sites/default/files/resource/FRLD_B.6_5_Status_of_resources_report_of_the_Trustee_0.pdf",
    "https://guide.thecooldown.com/actions/vote-for-pro-climate-candidates/",
    "https://guide.thecooldown.com/recording-votes/should-the-ultra-wealthy-pay-a-tax-to-help-offset-their-environmental-impact/?answer=2&article=recP1g9q4M6q8vK0h",
    "https://rb.gy/ivhzmj",
    "https://guide.thecooldown.com/recording-votes/should-the-ultra-wealthy-pay-a-tax-to-help-offset-their-environmental-impact/?answer=3&article=recP1g9q4M6q8vK0h",
    "https://guide.thecooldown.com/recording-votes/should-the-ultra-wealthy-pay-a-tax-to-help-offset-their-environmental-impact/?answer=4&article=recP1g9q4M6q8vK0h",
    "https://www.frld.org/",
    "http://guide.thecooldown.com/actions/explore-critical-climate-issues/",
    "https://www.thecooldown.com/future-newsletter/?recP1g9q4M6q8vK0h",
    "https://www.frld.org/board",
    "https://www.climatechangenews.com/2025/07/11/wealthy-nations-accused-of-delaying-loss-and-damage-fund-with-slow-payments/",
    "https://cdn.prod.website-files.com/605869242b205050a0579e87/668486c0e3ef9db052cfd609_Tavoni%20et%20al%202024%20Economic%20quantification%20of%20Loss%20and%20Damage%20funding%20needs.pdf"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Climate projects",
      "weight": 0.088185705
    },
    {
      "name": "climate damage aid",
      "weight": 0.08777692
    },
    {
      "name": "developing nations",
      "weight": 0.0847449
    },
    {
      "name": "Climate aid",
      "weight": 0.082811184
    },
    {
      "name": "climate action policies",
      "weight": 0.079934314
    },
    {
      "name": "Developing countries",
      "weight": 0.07618301
    },
    {
      "name": "developing countries",
      "weight": 0.07618301
    },
    {
      "name": "funds",
      "weight": 0.075352535
    },
    {
      "name": "wealthier nations",
      "weight": 0.07251076
    },
    {
      "name": "wealthy nations",
      "weight": 0.07251076
    }
  ],
  "topics": [
    {
      "name": "Environment-ESG"
    }
  ],
  "categories": [
    {
      "name": "Environment"
    }
  ],
  "taxonomies": [
    {
      "name": "/People & Society/Social Issues & Advocacy/Green Living & Environmental Issues",
      "score": 0.91259765625
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.8583984375
    },
    {
      "name": "/Science/Ecology & Environment/Climate Change & Global Warming",
      "score": 0.626953125
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.53955078125
    },
    {
      "name": "/Sensitive Subjects/Accidents & Disasters",
      "score": 0.4736328125
    },
    {
      "name": "/People & Society/Social Sciences/Political Science",
      "score": 0.397705078125
    }
  ],
  "sentiment": {
    "positive": 0.108391,
    "negative": 0.50242,
    "neutral": 0.38918906
  },
  "summary": "Developing countries are accusing wealthy nations of withholding over $400 million in climate damage aid. The Fund for Responding to Loss and Damage, established at the 2022 United Nations Climate Change Conference and operationalized at the 2023 conference, has received pledges from 28 countries, with only $348 million so far distributed. The fund helps vulnerable communities recover from extreme storms, rising sea levels, and other climate-related crises. The countries with the largest gaps between pledging money and delivering it include Italy, the United Arab Emirates, France, the UK, Australia, and Sweden. The board is considering using private-sector financing to complete proposed repair projects, but some board members oppose this as the fund's purpose is to help people suffering from the climate crisis, not investment opportunities.",
  "shortSummary": "Developing countries criticize wealthy nations for delaying climate damage aid, highlighting significant financial gaps and advocating for private funding instead.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "ab45508cf54942bca3dbd6c64b9afdbc",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://rb.gy/ivhzmj",
      "text": "TCD\nMarketplace\nYour go-to resource for helping yourself while\nhelping the planet💡\nMarketplace Spotlight\n💡Connect with these trusted partners to save more, waste less, and upgrade your life\nAt The Cool Down, we're all about making it easy to help yourself while helping the planet.\nThe lifestyle solutions we've curated here feature partners we've vetted across a wide range of everyday activities — everything from the way you power your home to the way you buy your food to the way you get rid of your old stuff. Check out the list below, and don't miss the TCD Guide for a deep dive into all the smart choices you can make for yourself and your family.\nPS: We regularly add new partners to our marketplace, so be sure to sign up for alerts below, and please drop us a line at hello@thecooldown.com if you have specific problems you're trying to solve.\nJump to...\n🏠 Upgrade your home and lower your bills\n🍔 Eat better food and save money on groceries\n💸 Declutter your life and make money on your stuff\n🏠 Upgrade your home and lower your bills\nThanks to massive tax credits and rapid innovation, it's never been cheaper or easier to cut your utility bills by upgrading your home and using less energy. Here's how to get started:\n✅ Rewiring America can help you make sense of all the tax incentives available to you.\n✅ EnergySage makes it easy to save thousands on home solar by comparing quotes from trusted installers — and depending on where you live, they can help you save big on a heat pump or take advantage of community solar too.\n✅ Duxtop offers a sleek, affordable induction burner that lets you try the hottest, healthiest cooking technology without tearing out your old stove.\nMore from the TCD Guide\n🍔 Eat better food and save money on groceries\nGrocery bills are officially out of control these days, but there are more options than ever before to save money on delicious food and contribute to waste reduction along the way. These are our favorites:\n✅ Flashfood's free app makes it easy to browse for massive deals at local grocery stores on fresh food that's nearing its expiration date.\n✅ Too Good To Go's free app lets you pick up surprise bags of extra food from local restaurants at ridiculous discounts.\n✅ Martie and Misfits Market both give you ultra-convenient options for steep discounts on home deliveries.\nMore from the TCD Guide\n💸 Declutter your life and make money on your stuff\nIf you're like us, you probably have a closet (or closets) full of old stuff you need to get rid of but feel bad about trashing. Fortunately, the circular revolution means there are plenty of ways to give your stuff a second life and make money in the process:\n✅ GotSneakers will pay you cash every time you send in a free bag of your old shoes.\n✅ Trashie's convenient Take Back Bag can handle everything from clothes to shoes to towels to sheets — and earns you $30 in rewards every time you use it.\n✅ For that junk drawer full of old electronics, Walmart, Best Buy, Target, Costco, and Apple will all give you store credit when you bring in old devices."
    },
    {
      "url": "https://www.climatechangenews.com/2025/07/11/wealthy-nations-accused-of-delaying-loss-and-damage-fund-with-slow-payments/",
      "text": "Rich nations accused of delaying loss and damage fund with slow payments\nWealthy nations risk undermining the loss and damage fund’s plan to deliver $250 million in aid next year to climate-vulnerable countries hit by extreme weather, board members from developing nations said this week.\nWhile rich nations have pledged $789 million, they have only transferred $348 million so far to the Fund for Responding to Loss and Damage (FRLD), which all governments agreed to set up two years ago under the UN climate talks and is now in its start-up phase.\nSpeaking on behalf of developing-country board members, Honduras’s representative Elena Cristina Pereira Colindres expressed “concern” during a press briefing, adding that “transparency and predictability” on when the money would be paid is lacking.\nPereira did not name individual countries, but Italy, the European Union and Luxembourg are the three donors that have promised money but not said when it will be given.\nOther nations – like the United Arab Emirates, Australia and Sweden – are drip-feeding their promised pledges, only giving a part of them each year.\nPereira said that these “multi-year disbursement schedules” severely limit the ability of the fund’s board to determine how much money they can spend and reduces “overall confidence in our partners’ commitments to long-term capitalisation of the fund”.\n“Lemonade-stand money”\nWhile the fund’s board has agreed to spend $250 million next year, Pereira said this “must not be used or considered as an indication of the future scale of the fund” because the needs are in the “hundreds of billions”.\nA 2024 study in Nature found that climate change is causing $395 billion of loss and damage each year. Developing countries have called for developed nations to provide $100 billion in loss and damage finance per year by 2030.\nOn Wednesday, Daniel Lund, Fiji’s representative to the fund, told the FRLD board meeting in the Philippines that the amount the fund currently has is just “lemonade-stand money”, adding that is about a quarter of what it costs to build a coal-fired power plant.\nScientists hail rapid estimate of climate change’s role in heat deaths as a first\nThe fund’s board is drawing up a plan to get more money – known as a resource mobilisation strategy – due to be ready by the end of 2025. “It is of crucial importance to the constituency that this fund that was established for all developing countries serves their collective needs at the scale that is needed,” Pereira said.\nIn April, the fund approved a strategy for the initial $250 million start-up phase, in which it agreed to give out grants of between $5 million and $20 million to project proposals submitted by developing countries.\nPriority for private finance?\nWith funds scarce, the secretariat which runs the FRLD has proposed that projects that bring in extra sources like private-sector finance should be judged favourably by the board.\nBut some developing-country board members and climate campaigners pushed back at the board meeting against adding this practice, known as leveraging, into the mix.\nEgypt’s representative Mohamed Nasr said he had “a very strong concern” about the idea. “This should not be part of any criteria when we deal with loss and damage funding,” he said.\nThe head of Climate Action Network (CAN) International, Tasneem Essop, said she was worried that the fund’s secretariat was pursuing “typical World Bank approaches”. The World Bank was chosen to host the fund – at least on an interim basis – despite opposition from some large NGOs like CAN.\nNigeria’s push to cash in on lithium rush gets off to a rocky start\nEssop said she opposed leveraging and derisking of investments. It’s “as if what we are setting up here is an investment fund,” she said. “No, it’s not – this is a solidarity fund. This fund needs to benefit the people that are suffering from the climate crisis.”\nSpeaking after her, Nasr said he agreed. “A fund is not a bank. Solidarity is different to investment. Loss and damage is different to development,” he said.\nWhen will funds be given out?\nDespite funding constraints, board co-chair Richard Sherman said he expects the first projects to be approved by the FRLD early next year.\nSherman said he expects the fund to put out a call for proposals at the next board meeting in October and the first projects to be approved at the following meeting in February 2026.\nThe board is still working out the fund’s financial architecture, meaning how the money is banked and disbursed to countries, Sherman said. If done correctly, he added, a unique fund will be set up to deliver a “rapid disbursement in time of disaster or extreme event”.\n“We are working wholeheartedly to make sure that happens,” Sherman told a press briefing, adding that he is striving for the fund to “almost be a hotline for communities” facing loss and damage events.\nIn a statement read out by a minister before the board meeting, Philippine President Ferdinand Marcos called for urgency, saying that “every delay means more families without shelter, more livelihood disrupted and worse – more lives lost”."
    }
  ],
  "argos_summary": "Developing countries are criticizing wealthy nations for failing to fulfill their commitments to the Fund for Responding to Loss and Damage, which was established to aid communities affected by climate change. Although rich nations pledged $789 million, only $348 million has been disbursed, causing concerns about transparency and predictability in funding. The fund aims to address the significant financial losses caused by climate change, which amount to approximately $395 billion annually, but delays in payments hinder recovery efforts for vulnerable populations.",
  "argos_id": "HLYN0ODQW"
}