{
  "url": "https://www.reuters.com/sports/fever-coach-caitlin-clark-groin-not-ready-return-practice-2025-08-11/",
  "authorsByline": "Reuters",
  "articleId": "1571c93b6b8446eea914269b19b5fa9e",
  "source": {
    "domain": "reuters.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://www.reuters.com/resizer/v2/WW3HHFQ5JJLCDKALI77LD7WVQA.jpg?auth=a6831bc96d6cf24cd309c5cc7939ddfe3e4017c6b9b74370fe953c0d21555bb3&height=1005&width=1920&quality=80&smart=true",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T23:55:32.720000+00:00",
  "addDate": "2025-08-12T00:02:37.730803+00:00",
  "refreshDate": "2025-08-12T00:02:37.730804+00:00",
  "score": 1.0,
  "title": "Fever coach: Caitlin Clark (groin) not ready to return to practice",
  "description": "The Indiana Fever have yet to clear star guard Caitlin Clark to return to practice as she continues recovering from a right groin injury.",
  "content": "August 11 - The Indiana Fever have yet to clear star guard Caitlin Clark to return to practice as she continues recovering from a right groin injury.\n\nClark will miss her 11th straight game when she sits out Tuesday against Paige Bueckers and the Dallas Wings, and it's likely that she will be sidelined even longer according to coach Stephanie White's remarks to reporters Monday.\n\nClark only began running full court last week and has not yet added more to her workload.\n\n\"No return to practice, she's been able to get a little bit more of her full-court running with all of her body weight,\" White said following practice. \"It's really building up from doing minimal to then building some endurance to do longer periods of time. She's been able to do a little more on the court in terms of how she moves, but not into practice yet.\"\n\nThe former Iowa superstar and No. 1 overall draft pick of 2024 was hurt late in the Fever's game at the Connecticut Sun on July 15.\n\nShe has only played 13 of Indiana's 32 regular-season games due to multiple injuries to her quad and groins. Her injury-plagued season has also seen her sidelined for the WNBA Commissioner's Cup final and the All-Star Game, the latter held in Indianapolis.\n\nPrior to her run of tough injury luck, she did not miss a game due to injury throughout her college career or in her rookie WNBA season.\n\nThe two-time All-Star was averaging 16.5 points, 8.8 assists, 5.0 rebounds and 1.6 steals per game this season.\n\n--Field Level Media",
  "medium": "Article",
  "links": [
    "https://www.thomsonreuters.com/en/about-us/trust-principles.html",
    "https://www.reutersagency.com/en/licensereuterscontent/?utm_medium=rcom-article-media&utm_campaign=rcom-rcp-lead"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "game",
      "weight": 0.091069974
    },
    {
      "name": "star guard Caitlin Clark",
      "weight": 0.08836597
    },
    {
      "name": "Caitlin Clark",
      "weight": 0.08587187
    },
    {
      "name": "practice",
      "weight": 0.080116734
    },
    {
      "name": "Fever coach",
      "weight": 0.079791844
    },
    {
      "name": "tough injury luck",
      "weight": 0.07899995
    },
    {
      "name": "multiple injuries",
      "weight": 0.07844054
    },
    {
      "name": "Stephanie White",
      "weight": 0.07335718
    },
    {
      "name": "Clark",
      "weight": 0.07137905
    },
    {
      "name": "injury",
      "weight": 0.07022835
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.98828125
    },
    {
      "name": "/Sports/Team Sports/Basketball",
      "score": 0.97265625
    }
  ],
  "sentiment": {
    "positive": 0.17916563,
    "negative": 0.43763146,
    "neutral": 0.3832029
  },
  "summary": "The Indiana Fever has not cleared star guard Caitlin Clark to return to practice due to a groin injury. She will miss her 11th consecutive game and is expected to be sidelined even further. Clark, who began running full court last week, has only played 13 of the 32 regular-season games this season. Her injury has also affected her participation in the WNBA Commissioner's Cup final and the All-Star Game.",
  "shortSummary": "The Indiana Fever's Caitlin Clark is not yet ready to return to practice due to a right groin injury, impacting her 11th game this season.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "b2a485ded2c74502aedf5cb5c51d7b65",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.thomsonreuters.com/en/about-us/trust-principles.html",
      "text": "The Trust Principles\nThomson Reuters is dedicated to upholding the Trust Principles and to preserving its independence, integrity, and freedom from bias in the gathering and dissemination of information and news.\nTrust Principles – the history\nThe Trust Principles were created in 1941, in the midst of World War II, in agreement with The Newspaper Proprietors Association Limited and The Press Association Limited (being the Reuters shareholders at that time). The Trust Principles imposed obligations on Reuters and its employees to act at all times with integrity, independence, and freedom from bias.\nReuters Directors and shareholders were determined to protect and preserve the Trust Principles when Reuters became a publicly traded company on the London Stock Exchange and Nasdaq. A unique structure was put in place to achieve this. A new company was formed and given the name 'Reuters Founders Share Company Limited', its purpose being to hold a 'Founders Share' in Reuters.\nThe legal structure has evolved over time and the Founders Share and other contractual arrangements now confer a number of special rights upon the Thomson Reuters Founders Share Company. For example, (i) the Thomson Reuters Founders Share Company has enhanced voting rights in circumstances where someone is seeking to obtain a significant shareholding in, or acquire control of, Thomson Reuters and (ii) the prior consent of the Thomson Reuters Founders Share Company must be sought prior to undertaking any sale of, or other material transaction involving, the Reuters news business unit.\nThomson Reuters itself is obliged and committed to apply the Trust Principles to its operations. The charter documents of Thomson Reuters Corporation include provisions to safeguard the Trust Principles as they apply to the Thomson Reuters business and require Thomson Reuters Directors, in the performance of their duties, to have due regard to the Trust Principles, by the proper exercise of their powers and in accordance with their other duties as Directors.\nThe Trust Principles are:\n- That Reuters shall at no time pass into the hands of any one interest, group, or faction;\n- That the integrity, independence, and freedom from bias of Thomson Reuters shall at all times be fully preserved;\n- That Reuters shall supply unbiased and reliable news services to newspapers, news agencies, broadcasters, and other media subscribers and to businesses, governments, institutions, individuals, and others with whom Reuters has or may have contracts;\n- That Thomson Reuters shall pay due regard to the many interests which it serves in addition to those of the media; and\n- That no effort shall be spared to expand, develop, and adapt the news and other services and products of Thomson Reuters so as to maintain its leading position in the international news and information business\nThomson Reuters Founders Share Company was established in 1984 when Reuters became a public company. The directors of Thomson Reuters Founders Share Company (known as ‘Trustees’) have a duty to ensure, to the extent possible, that the Trust Principles are complied with.\nThe Trustees are experienced and eminent people from diverse arenas in politics, diplomacy, media, public service and business. The Trustees are selected by a nomination committee and proposed to the board of the Thomson Reuters Founders Share Company for appointment. The nomination committee assists in scrutinizing candidates’ suitability and its members include two persons appointed by the chairman after consultation with the European Court of Human Rights and representatives of certain press associations. The Thomson Reuters Corporation board has two representatives on the nomination committee. The Chairman and Deputy Chairman of the Thomson Reuters Founders Share Company Board are members of the nomination committee, and the Chairman appoints three other directors of the Thomson Reuters Founders Share Company as members of the nomination committee. The Chairman of the Thomson Reuters Founders Share Company acts as chairman of the nomination committee.\nThe number of Trustees has to be at least 14 and not more than 18. Trustees have a minimum of two meetings per year, and receive reports on our activities in the different fields in which we operate (including Reuters news). The Trustees meet with both the Thomson Reuters Board and representatives of senior management. Through Thomson Reuters Founders Share Company's Chairman, regular contact is maintained with our company. The relationship is one of trust and confidence.\nIndependence of Thomson Reuters\nCustomers across the world depend on us to provide them with reliable and objective news and information.\nThis means that we have a special need to safeguard our independence and integrity and avoid any bias which may stem from control by specific individuals or interests.\nThe Thomson Reuters Trust Principles were adopted in 1941 and include the preservation of integrity, reliability of news, development of the news business, and related principles.\nToday, the Trust Principles are fundamental to our entire business.\nMore information\nContact us\nBrian Moss\nFor inquiries pertaining to Reuters reporting standards and the Trust Principles please email: brian.moss@thomsonreuters.com."
    }
  ],
  "argos_summary": "Caitlin Clark, star guard for the Indiana Fever, remains sidelined due to a right groin injury and will miss her 11th consecutive game against the Dallas Wings. Coach Stephanie White indicated that while Clark has started running full court, she has not yet been cleared for practice and may be out longer. Clark, who was the No. 1 overall draft pick in 2024, has struggled with injuries this season, playing only 13 of 32 games.",
  "argos_id": "HMVFQW8D9"
}