{
  "url": "https://www.yahoo.com/news/articles/instagram-star-state-victim-p-221728460.html",
  "authorsByline": "Kellen McGovern Jones - Senior Investigative Reporter",
  "articleId": "c799bf66fa65455281310d392648b6e6",
  "source": {
    "domain": "yahoo.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://edgecast-img.yahoo.net/mysterio/api/80348678157fb79b967ace82d650212c99d8f7cf9fb43e7584c1e9251b81ef87/ynews/resizefill_w1200/https://media.zenfs.com/en/dallas_express_media_articles_743/8ff02a8977d8288389c58b6e6470ce1d",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T22:17:28+00:00",
  "addDate": "2025-08-11T23:14:42.535109+00:00",
  "refreshDate": "2025-08-11T23:14:42.535110+00:00",
  "score": 1.0,
  "title": "From Instagram Star To State Victim: P’Nut’s Owners Sue For $10M In Damages",
  "description": "The former owners of the P'Nut, the internationally famous TikTok squirrel, are suing the State of New York for killing their pet.",
  "content": "Yahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience.\n\nYahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience.\n\nYahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience. Generate Key Takeaways\n\nThe owners of an internet-famous squirrel say New York officials committed a “senseless act of violence” when they seized and killed the animal — and they now want $10 million in damages.\n\nMark Longo and Daniela Bittner filed a claim last week in the New York Court of Claims over the October 2024 deaths of P’Nut the squirrel and Fred the raccoon, both of whom had lived in the couple’s Pine City home. The suit names the state, the Department of Environmental Conservation (DEC), and the Department of Health (DOH) as defendants, accusing them of government abuse and wrongful killing of the animals. News of the lawsuit did not widely break until the weekend.\n\nState environmental officers and health officials raided the couple’s property on October 30, 2024, after allegedly receiving complaints about illegal possession of wild animals. Officials claimed P’Nut bit an agent through thick leather gloves during the seizure, prompting rabies testing, Newsweek reported. Both animals were euthanized and decapitated for testing, but the state later confirmed the results were negative.\n\n“It’s not due to a fear of rabies,” the couple’s court filing reportedly says, calling the killings an “obscene demonstration of government abuse,” per the New York Post.\n\nThis language was reportedly similar to the verbiage used by the couple in a separate lawsuit relating to the same matter, filed a few days earlier, that seeks an unspecified amount in damages.\n\nP’Nut had amassed hundreds of thousands of followers on Instagram, TikTok, and other platforms, appearing in videos wearing miniature costumes, eating waffles, and riding on Longo’s shoulder. His death, just days before the November 5, 2024, Presidential election, became one of the most-shared stories online that weekend, sparking widespread condemnation and memes that linked the incident to libertarian critiques of government overreach, The Dallas Express reported at the time.\n\nPETA later issued a statement criticizing the state’s handling of the seizure. “There is always a humane solution, and it’s a pity that New York officials didn’t find one here,” spokeswoman Catie Cryar said, adding that the group lamented the loss of the animals after years in a family environment, per DX.\n\nLongo has said he rescued P’Nut as an orphaned squirrel in New York City and was working to obtain licensing to keep the animal as an educational exhibit when the raid occurred. New York law generally prohibits keeping squirrels and raccoons as pets without permits.\n\nSquirrels rarely carry rabies and have never been known to transmit it to humans, according to the Wisconsin Department of Health Services.\n\nThe DOH and DEC declined to comment on the latest litigation, according to the New York Post.",
  "medium": "Article",
  "links": [
    "https://dallasexpress.com/national/exclusive-peta-calls-out-peanuts-killers/",
    "https://www.newsweek.com/pnut-squirrel-fred-racoon-lawsuit-owners-seek-10-million-dollars-new-york-2111657",
    "https://nypost.com/2025/08/09/us-news/pnut-the-squirrels-owners-want-10m-for-animals-execution-lawsuit/",
    "https://www.dhs.wisconsin.gov/rabies/algorithm/smallrodentsall.htm",
    "https://dallasexpress.com/national/pornstars-peanut-and-ron-paul-government-overreach/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "New York officials",
      "weight": 0.098218665
    },
    {
      "name": "New York",
      "weight": 0.0933783
    },
    {
      "name": "New York City",
      "weight": 0.092213556
    },
    {
      "name": "New York law",
      "weight": 0.089179486
    },
    {
      "name": "State Victim",
      "weight": 0.0674401
    },
    {
      "name": "wild animals",
      "weight": 0.06666477
    },
    {
      "name": "State environmental officers",
      "weight": 0.06536176
    },
    {
      "name": "rabies testing",
      "weight": 0.062710926
    },
    {
      "name": "P’Nut",
      "weight": 0.06218688
    },
    {
      "name": "government abuse",
      "weight": 0.061843794
    }
  ],
  "topics": [
    {
      "name": "Lawsuits"
    },
    {
      "name": "Social Media"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Sensitive Subjects/Death & Tragedy",
      "score": 0.9140625
    },
    {
      "name": "/News/Local News",
      "score": 0.80908203125
    },
    {
      "name": "/News/Other",
      "score": 0.80126953125
    },
    {
      "name": "/Sensitive Subjects/Violence & Abuse",
      "score": 0.7431640625
    },
    {
      "name": "/Arts & Entertainment/Offbeat/Other",
      "score": 0.63037109375
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.62353515625
    },
    {
      "name": "/Law & Government/Legal/Other",
      "score": 0.4775390625
    },
    {
      "name": "/Online Communities/Social Networks",
      "score": 0.440673828125
    },
    {
      "name": "/Pets & Animals/Wildlife",
      "score": 0.41552734375
    },
    {
      "name": "/Sensitive Subjects/Accidents & Disasters",
      "score": 0.368408203125
    }
  ],
  "sentiment": {
    "positive": 0.059572145,
    "negative": 0.71973807,
    "neutral": 0.22068988
  },
  "summary": "The owners of P'Nut the squirrel and Fred the raccoon, who had lived in their home in Pine City, New York, are suing for $10M in damages over the deaths of P’Nut and Fred in October 2024. The lawsuit accuses New York officials of committing a \"senseless act of violence\" when they seized and killed the animal. Mark Longo and Daniela Bittner have filed a claim in the New York Court of Claims accusing them of government abuse and wrongful killing. The state, the Department of Environmental Conservation (DEC), and Department of Health (DOH) were named as defendants in the lawsuit. PETA has criticized the state's handling of the seizure and subsequent death of the animals, which led to widespread condemnation.",
  "shortSummary": "The owners of P’Nut the squirrel are suing New York officials for $10 million, alleging government abuse and wrongful killing of their animals.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "593cf85bbf5d4813ab59ecf401992c77",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.newsweek.com/pnut-squirrel-fred-racoon-lawsuit-owners-seek-10-million-dollars-new-york-2111657",
      "text": "🎙️ Voice is AI-generated. Inconsistencies may occur.\nThe owners of P'Nut the Squirrel and a raccoon named Fred are suing the State of New York for $10 million in damages after the animals were euthanized last year.\nMark Longo and Daniela Bittner filed the lawsuit on Thursday in the New York Court of Claims, alleging constitutional violations and wrongful killing of their animals by state officials. The lawsuit names the state, the Department of Environmental Conservation (DEC), and the Department of Health (DOH) as defendants.\nNewsweek contacted Longo's Attorney Nora Constance Marino, the DEC, DOH and the State of New York for comment by email.\nWhy It Matters\nThe lawsuit alleges that the seizure and killing of P'Nut and Fred were not only a violation of New York's wildlife laws, but also an infringement of the owners' Fourth and Fourteenth Amendment rights. Whether such laws even apply is debatable—the plaintiffs maintain neither P'Nut nor Fred were \"wild animals\" under the law, but rather \"companion animals.\" If successful, the case could set precedent for how far state agencies can go in enforcing wildlife regulations, particularly when animals are domesticated and kept in private homes.\nThe incident unfolded just before the 2024 presidential election, sparking widespread online outrage, and even bomb threats against officials. It became a rallying point for critics of government overreach, drawing attention from public figures such as Elon Musk and Joe Rogan.\nWhat To Know\nLongo and Bittner describe P'Nut's personality and abilities as unique and irreplaceable. Fred's personality and abilities, while still developing, were showing signs he too would be unique and irreplaceable—though they intended to release him back into the wild.\nThe animals were both kept inside their home. New York law prohibits keeping squirrels and raccoons as pets because they are classified as wild animals.\nMany of P'Nut's fans knew about the couple's sanctuary because of his social media presence, and many donated because of his stardom. P'Nut's likeness, antics, and image were used for promotion, endorsements, sponsorships, and marketing by way of plaintiff D&M, including on Cameo and OnlyFans. Fred was beginning to build his own online following.\nThe couple are seeking compensatory and punitive damages, along with legal fees and costs, claiming \"severe emotional distress, humiliation, and damage to reputation.\"\nAccording to the lawsuit, a group of DEC and DOH agents, along with other law enforcement officers, arrived at the couple's Pine City property on October 30, 2024, to execute a search warrant. Both animals were seized during the raid and later killed by state officials.\nDEC officials said that P'Nut bit an agent through thick leather gloves during the raid, prompting both animals to be euthanized and decapitated for rabies testing. The state has since confirmed the tests were negative.\nThe complaint alleges the killings were \"not due to a fear of rabies,\" but were a \"senseless act of violence\" and \"obscene demonstration of government abuse.\"\nThe plaintiffs claim they were \"unlawfully detained without probable cause and subjected to an unreasonable search and seizure,\" and that \"despite having no evidence of criminal activity, Defendants proceeded to arrest Plaintiffs and initiate baseless charges.\"\nThe suit also alleges that the seizure exceeded the scope of the warrant and that requests for the animals' remains have gone unanswered.\n\"Defendants have engaged in a pattern of conduct that has deprived Plaintiffs of their constitutional rights under the Fourth and Fourteenth Amendments,\" the complaint states.\nIt adds: \"The acts and omissions of the Defendants were intentional, malicious, and taken with reckless disregard for the rights of the Plaintiffs.\"\nThe filing follows an earlier lawsuit in Chemung County Supreme Court targeting local and state officials over the same incident.\nWhat People Are Saying\nLongo told the New York Post: \"This is our opportunity to make change and seek justice for P'Nut and Fred.\"\nMarino, Longo's attorney, told the newspaper: \"I hope justice is done, not just for my clients, but for our civil rights, P'Nut and Fred, and all animals.\"\nThe October raid and subsequent animal killings drew national attention in the final days before the presidential election. Then Republican vice-presidential nominee JD Vance said at a rally in November: \"Don is fired up about P'Nut the squirrel.\"\nDonald Trump Jr. said at a rally: \"Justice for Peanut! Our government will let in 16,000 rapists, they will let in 13,000 murderers, they will let in 600,000 criminals across our border, but if someone has a pet squirrel without a permit, they will go in there and kill the squirrel.\"\nElon Musk wrote on X: \"Government overreach kidnapped an orphan squirrel and executed him.\"\nWhat Happens Next\nNo trial date has been set in either the Court of Claims case, or the related Chemung County action.\nAbout the writer\nRobert Charles Alexander is the Senior Crime and Court Reporter for Newsweek based in London. He formerly worked as a ... Read more"
    },
    {
      "url": "https://nypost.com/2025/08/09/us-news/pnut-the-squirrels-owners-want-10m-for-animals-execution-lawsuit/",
      "text": "NY could owe P’Nut the Squirrel’s owners $10M for execution of world’s most famous pet\nThe brutal seizure and execution of the world’s most famous squirrel threatens to cost the State of New York a staggering eight-figure settlement.\nMark Longo and Daniela Bittner, the grieving owners of P’Nut and his raccoon sidekick, Fred, are seeking $10 million in damages for the death of their pets at the hands of investigators, according to a lawsuit filed Thursday in New York Court of Claims.\nA swarm of cops and agents from the state Environmental Conservation and Health departments descended on the couple’s upstate Pine City animal sanctuary Oct. 30, where the animals were living inside Longo and Bittner’s home.\nIt is illegal to keep squirrels and raccoons as pets in New York, where they’re considered wild animals.\nDEC officials claimed that P’Nut bit an agent through thick leather gloves during the raid, which required both animals to be decapitated and tested for rabies.\nAlthough the state later admitted the rabies tests were both negative, it has never apologized nor returned the bodies of either animal.\nThe killing of P’Nut and Fred was “not due to a fear of rabies” – but a “senseless act of violence” and “obscene demonstration of government abuse,” charge the new court documents, which list the state, the DEC and DOH as defendants.\nThe allegations echo those outlined in a separate lawsuit filed by Longo and Bittner on June 27 in Chemung County Supreme Court, against the county, the City of Elmira and 36 individuals from every level of local and state government.\nThat suit sought unspecified damages to be determined by a jury trial.\nLawsuits filed in the state Court of Claims, like the one this week, require specific damages be listed.\nThe couple has suffered emotional trauma and financial losses since losing their star squirrel, who had become an Internet celebrity, appearing in social media posts, OnlyFans content, Cameos and other monetized media, according to both suits, filed by their lawyer, Nora Constance Marino.\nThe DOH and DEC declined comment on the litigation."
    }
  ],
  "argos_summary": "Mark Longo and Daniela Bittner are suing the State of New York for $10 million after their pet squirrel, P'Nut, and raccoon, Fred, were seized and euthanized by state officials in October 2024. The couple alleges wrongful killing and violations of their constitutional rights, claiming the animals were not wild but companion pets. The incident, which drew significant public outrage and attention, particularly before the 2024 presidential election, has raised questions about government overreach and wildlife regulations.",
  "argos_id": "HPSEK2S61"
}