{
  "url": "https://www.reuters.com/de/wirtschaft/dollarisierung-drckt-kubanischen-peso-auf-rekordtief-am-schwarzmarkt-2025-08-12/",
  "authorsByline": "Reuters",
  "articleId": "4e71989a125e4f02a6a31d7483723e4b",
  "source": {
    "domain": "reuters.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://www.reuters.com/resizer/v2/466BJJQ7PVGY5O53NZ3KL65MHM.png?auth=b9c3bf166c40a6778eb5672993fde7c30a15f48329026674eff92afd8da1d0ca&height=1005&width=1920&quality=80&smart=true",
  "country": "us",
  "language": "de",
  "pubDate": "2025-08-12T05:41:00.941000+00:00",
  "addDate": "2025-08-12T05:45:32.901176+00:00",
  "refreshDate": "2025-08-12T05:45:32.901178+00:00",
  "score": 1.0,
  "title": "Dollarisierung drückt kubanischen Peso auf Rekordtief am Schwarzmarkt",
  "description": "Der kubanische Peso ist am Montag auf dem Schwarzmarkt auf ein Rekordtief gefallen. Für einen Dollar mussten 400 Pesos gezahlt werden, wie aus Daten des in Miami ansässigen Online-Dienstes \"El Toque\" hervorging. Die meisten Kubaner nutzen diesen Dienst zur Ermittlung des tatsächlichen Werts des Peso. Hintergrund des Kursverfalls ist die zunehmende Teil-Dollarisierung der staatlich dominierten Wirtschaft des Landes. Zu Jahresbeginn lag der Kurs noch bei 305 Pesos für einen Dollar.",
  "content": "Havanna, 11. Aug (Reuters) - Der kubanische Peso ist am Montag auf dem Schwarzmarkt auf ein Rekordtief gefallen. Für einen Dollar mussten 400 Pesos gezahlt werden, wie aus Daten des in Miami ansässigen Online-Dienstes \"El Toque\" hervorging. Die meisten Kubaner nutzen diesen Dienst zur Ermittlung des tatsächlichen Werts des Peso. Hintergrund des Kursverfalls ist die zunehmende Teil-Dollarisierung der staatlich dominierten Wirtschaft des Landes. Zu Jahresbeginn lag der Kurs noch bei 305 Pesos für einen Dollar.\n\nDie Regierung in Havanna treibt die Dollarisierung selbst voran, um an Fremdwährungen zu gelangen. So wurden gut sortierte Einzelhandelsgeschäfte eröffnet, die nur Devisen in bar, ausländische Kreditkarten oder eine staatlich ausgegebene Dollar-Karte akzeptieren. Präsident Miguel Diaz-Canel räumte im vergangenen Monat vor der Nationalversammlung ein, dass dies die soziale Ungleichheit verschärfe. \"Dies kommt in gewisser Weise denjenigen zugute, die über bestimmte Kapitalressourcen verfügen oder Rücküberweisungen erhalten, was sich in einer unerwünschten Vergrößerung der ... sozialen Ungleichheit niederschlägt\", sagte er. Etwa 40 Prozent der Kubaner haben keinen Zugang zu Fremdwährungen.\n\nDer kommunistisch regierte Inselstaat leidet unter einer schweren Wirtschaftskrise, die sich in einer Knappheit bei Gütern des täglichen Bedarfs, rasanter Inflation und einer maroden Infrastruktur äußert. Seit 2019 ist die Wirtschaftsleistung um elf Prozent geschrumpft. Die Regierung macht dafür hauptsächlich die US-Sanktionen verantwortlich, während Kritiker schleppende Wirtschaftsreformen bemängeln. Offiziell hält die Regierung einen festen Wechselkurs von 24 Pesos zum Dollar und einen Sonderkurs von 120 Pesos aufrecht. Der wachsende Privatsektor orientiert sich bei der Preisgestaltung am Schwarzmarktkurs.",
  "medium": "Article",
  "links": [
    "https://www.reutersagency.com/en/licensereuterscontent/?utm_medium=rcom-article-media&utm_campaign=rcom-rcp-lead",
    "https://www.thomsonreuters.com/en/about-us/trust-principles.html"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Cuban peso",
      "weight": 0.09748029
    },
    {
      "name": "foreign credit cards",
      "weight": 0.08235384
    },
    {
      "name": "sluggish economic reforms",
      "weight": 0.07708874
    },
    {
      "name": "foreign currencies",
      "weight": 0.07606132
    },
    {
      "name": "Economic performance",
      "weight": 0.072897345
    },
    {
      "name": "social inequality",
      "weight": 0.07198068
    },
    {
      "name": "President Miguel Diaz Canel",
      "weight": 0.07115492
    },
    {
      "name": "certain capital resources",
      "weight": 0.07041733
    },
    {
      "name": "Miguel Diaz Canel",
      "weight": 0.06967488
    },
    {
      "name": "dollar",
      "weight": 0.06883342
    }
  ],
  "topics": [
    {
      "name": "Trafficking (Stolen Goods)"
    }
  ],
  "categories": [],
  "taxonomies": [
    {
      "name": "/Finance/Investing/Currencies & Foreign Exchange",
      "score": 0.9404296875
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.85888671875
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.8037109375
    }
  ],
  "sentiment": {
    "positive": 0.048413754,
    "negative": 0.7226383,
    "neutral": 0.22894797
  },
  "summary": "",
  "shortSummary": "",
  "translation": "Havana, Aug 11 (Reuters) - The Cuban peso fell for a record low on the black market on Monday. 400 pesos had to be paid for a dollar, as stated from data from the \"El Toque\" based in Miami. Most Cubans use this service to determine the actual value of the peso. The background of the drop in the course is the increasing partial dollarization of the state-dominated economy of the country. At the beginning of the year, the course was still at 305 pesos for a dollar.\n\nThe government in Havana is driving the dollarization itself to get foreign currencies. Well-sorted retail transactions were opened that only accept foreign credit cards or a state-sponsored dollar card in cash. President Miguel Diaz Canel admitted last month before the National Assembly that this tightened social inequality. \"In a way, this benefits those who have certain capital resources or receive reverissions, which is reflected in an undesirable enlargement of ... social inequality,\" he said. About 40 percent of Cubans have no access to foreign currencies.\n\nThe communistically ruled island state suffers from a severe economic crisis, which manifests itself in a scarcity of goods of daily needs, rapid inflation and a dilapidated infrastructure. Economic performance has shrunk by eleven percent since 2019. The government is mainly responsible for the US sanctions, while critics criticize sluggish economic reforms. Officially, the government maintains a fixed exchange rate of 24 pesos to the dollar and a special course of 120 pesos. The growing private sector is based on the pricing on the black market course.",
  "translatedTitle": "Dollarization presses Cuban peso on record low on the black market",
  "translatedDescription": "The Cuban peso fell for a record low on the black market on Monday. 400 pesos had to be paid for a dollar, as stated from data from the \"El Toque\" based in Miami. Most Cubans use this service to determine the actual value of the peso. The background of the drop in the course is the increasing partial dollarization of the state-dominated economy of the country. At the beginning of the year, the course was still at 305 pesos for a dollar.",
  "translatedSummary": "The Cuban peso fell to a record low on the black market, with 400 pesos needed to be paid for a dollar. This drop is attributed to the increasing dollarization in the state-dominated economy. The government is encouraging this trend, with well-established retail transactions only accepting foreign credit cards or a state-sponsored dollar card in cash. The drop has exacerbated social inequality within the country, with about 40 percent of Cubans having no access to foreign currencies.",
  "reprint": false,
  "reprintGroupId": "4e2f4ea9164541268d215875fa99da9e",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.thomsonreuters.com/en/about-us/trust-principles.html",
      "text": "The Trust Principles\nThomson Reuters is dedicated to upholding the Trust Principles and to preserving its independence, integrity, and freedom from bias in the gathering and dissemination of information and news.\nTrust Principles – the history\nThe Trust Principles were created in 1941, in the midst of World War II, in agreement with The Newspaper Proprietors Association Limited and The Press Association Limited (being the Reuters shareholders at that time). The Trust Principles imposed obligations on Reuters and its employees to act at all times with integrity, independence, and freedom from bias.\nReuters Directors and shareholders were determined to protect and preserve the Trust Principles when Reuters became a publicly traded company on the London Stock Exchange and Nasdaq. A unique structure was put in place to achieve this. A new company was formed and given the name 'Reuters Founders Share Company Limited', its purpose being to hold a 'Founders Share' in Reuters.\nThe legal structure has evolved over time and the Founders Share and other contractual arrangements now confer a number of special rights upon the Thomson Reuters Founders Share Company. For example, (i) the Thomson Reuters Founders Share Company has enhanced voting rights in circumstances where someone is seeking to obtain a significant shareholding in, or acquire control of, Thomson Reuters and (ii) the prior consent of the Thomson Reuters Founders Share Company must be sought prior to undertaking any sale of, or other material transaction involving, the Reuters news business unit.\nThomson Reuters itself is obliged and committed to apply the Trust Principles to its operations. The charter documents of Thomson Reuters Corporation include provisions to safeguard the Trust Principles as they apply to the Thomson Reuters business and require Thomson Reuters Directors, in the performance of their duties, to have due regard to the Trust Principles, by the proper exercise of their powers and in accordance with their other duties as Directors.\nThe Trust Principles are:\n- That Reuters shall at no time pass into the hands of any one interest, group, or faction;\n- That the integrity, independence, and freedom from bias of Thomson Reuters shall at all times be fully preserved;\n- That Reuters shall supply unbiased and reliable news services to newspapers, news agencies, broadcasters, and other media subscribers and to businesses, governments, institutions, individuals, and others with whom Reuters has or may have contracts;\n- That Thomson Reuters shall pay due regard to the many interests which it serves in addition to those of the media; and\n- That no effort shall be spared to expand, develop, and adapt the news and other services and products of Thomson Reuters so as to maintain its leading position in the international news and information business\nThomson Reuters Founders Share Company was established in 1984 when Reuters became a public company. The directors of Thomson Reuters Founders Share Company (known as ‘Trustees’) have a duty to ensure, to the extent possible, that the Trust Principles are complied with.\nThe Trustees are experienced and eminent people from diverse arenas in politics, diplomacy, media, public service and business. The Trustees are selected by a nomination committee and proposed to the board of the Thomson Reuters Founders Share Company for appointment. The nomination committee assists in scrutinizing candidates’ suitability and its members include two persons appointed by the chairman after consultation with the European Court of Human Rights and representatives of certain press associations. The Thomson Reuters Corporation board has two representatives on the nomination committee. The Chairman and Deputy Chairman of the Thomson Reuters Founders Share Company Board are members of the nomination committee, and the Chairman appoints three other directors of the Thomson Reuters Founders Share Company as members of the nomination committee. The Chairman of the Thomson Reuters Founders Share Company acts as chairman of the nomination committee.\nThe number of Trustees has to be at least 14 and not more than 18. Trustees have a minimum of two meetings per year, and receive reports on our activities in the different fields in which we operate (including Reuters news). The Trustees meet with both the Thomson Reuters Board and representatives of senior management. Through Thomson Reuters Founders Share Company's Chairman, regular contact is maintained with our company. The relationship is one of trust and confidence.\nIndependence of Thomson Reuters\nCustomers across the world depend on us to provide them with reliable and objective news and information.\nThis means that we have a special need to safeguard our independence and integrity and avoid any bias which may stem from control by specific individuals or interests.\nThe Thomson Reuters Trust Principles were adopted in 1941 and include the preservation of integrity, reliability of news, development of the news business, and related principles.\nToday, the Trust Principles are fundamental to our entire business.\nMore information\nContact us\nBrian Moss\nFor inquiries pertaining to Reuters reporting standards and the Trust Principles please email: brian.moss@thomsonreuters.com."
    }
  ],
  "argos_summary": "Der kubanische Peso hat am Schwarzmarkt ein Rekordtief von 400 Pesos pro Dollar erreicht, was auf eine zunehmende Teil-Dollarisierung der Wirtschaft zurückzuführen ist. Die Regierung fördert diese Dollarisierung, um Fremdwährungen zu erhalten, was jedoch die soziale Ungleichheit verstärkt, da etwa 40 Prozent der Kubaner keinen Zugang zu Devisen haben. Die Wirtschaft des Landes leidet unter einer schweren Krise, die sich in Inflation und einem Rückgang der Wirtschaftsleistung um elf Prozent seit 2019 äußert.",
  "argos_id": "HT0R8YEM9"
}