{
  "url": "https://www.bloomberg.com/news/videos/2025-08-12/china-urges-local-firms-not-to-use-nvidia-s-h20-chips-video",
  "authorsByline": "bn",
  "articleId": "7d220b94ab884444ab30378e7ff43897",
  "source": {
    "domain": "bloomberg.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/igVvzwchf52w/v3/-1x-1.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T05:36:21.149000+00:00",
  "addDate": "2025-08-12T05:49:31.699694+00:00",
  "refreshDate": "2025-08-12T05:49:31.699695+00:00",
  "score": 1.0,
  "title": "China Urges Local Firms Not to Use Nvidia’s H20 Chips",
  "description": "China Urges Local Firms Not to Use Nvidia’s H20 Chips",
  "content": "We're getting red lines crossing right now across the Bloomberg. This is a Bloomberg scoop that at the same time, or at least shortly after what we heard from President Trump, China has, in fact, been urging its own companies not to use Nvidia's H20 chips in new guidance. This, again, is according to bloomberg reporting. I've got more details on this. So China has put out notices to a number of state owned and private companies urging them to avoid using these h t H20 processors These were the ones, of course, initially banned by the president, President Trump and his administration before, again, we got the news yesterday that Nvidia could start selling them into the Chinese market if they get 15% of those revenues to the US Treasury. Over the past few weeks, according to Bloomberg reporting, Chinese authorities have sent notices to a range of firms discouraging the use of less advanced semiconductors. This, again, according to people familiar with the matter Minmin. This is a response from China. It firms up what we expected would have been signals from state media and state media affiliated blogs yesterday suggesting that China has concerns about national security risks that they claim are associated with some of these chips. They have suggested there are backdoors, for example, in some of these Nvidia chips. Certainly that has been a concern that's been flagged. And now we have confirmation that China has been sending out official notices. How significant is this? Yeah, definitely very significant timing as well. Very significant coming on the day when President Trump had announced the extension of the trade truce. And we know China had been pushing so hard for the rolling back of these tight curbs. And clearly China doesn't see the reversal of the decision to sell h-20 chips to China as a win or a concession at all. And this comes as US officials have been publicly calling for the installation of these location tracking capabilities in the chips that are being sold to China. You add to that H20 isn't even the most advanced chips that the US has. And so China had repeatedly through its state media, signaled that it's opposed to these sort of backdoor to the US government and also saying that the 820 chips are not the most efficient chips out there. It remains to be seen whether or not this the sale of the black well line of products because it's more at bonds. Whether that is enough to appease Beijing to put aside some of these security concerns because of course the US side and President Trump has shown a willingness to put aside national security concerns for a price if NVIDIA pays them. You know, 15% of the China sales revenue they had been open to sell those two to issue those export licenses for the H20 chips. Now, of course, the big question is, you know, is Chip still at the center of this trade tussle between the two sides? Will China still want any of the chips that US can offer? If this security concerns are not addressed? That's a big question. And, of course, China will likely continue to pour in more resources to double down on its self-reliance and self-sufficiency. Push.",
  "medium": "Video",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "China",
      "weight": 0.09653992
    },
    {
      "name": "President Trump",
      "weight": 0.08939981
    },
    {
      "name": "national security concerns",
      "weight": 0.08526457
    },
    {
      "name": "h-20 chips",
      "weight": 0.08519339
    },
    {
      "name": "national security risks",
      "weight": 0.073174566
    },
    {
      "name": "US officials",
      "weight": 0.072617725
    },
    {
      "name": "state media affiliated blogs",
      "weight": 0.07192539
    },
    {
      "name": "state media",
      "weight": 0.07069697
    },
    {
      "name": "US",
      "weight": 0.069117345
    },
    {
      "name": "h t H20",
      "weight": 0.068943955
    }
  ],
  "topics": [
    {
      "name": "AI"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Technology News",
      "score": 0.9716796875
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.822265625
    },
    {
      "name": "/Computers & Electronics/Computer Hardware/Computer Components",
      "score": 0.546875
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.53466796875
    }
  ],
  "sentiment": {
    "positive": 0.08459634,
    "negative": 0.5909543,
    "neutral": 0.3244493
  },
  "summary": "China has issued official notices to local firms warning them not to use Nvidia's H20 chips, which were initially banned by the US government. This comes shortly after President Trump announced that Nvidia could start selling them into the Chinese market if 15% of its revenues were donated to the US Treasury. China has raised concerns about national security risks associated with these chips, suggesting backdoors are in some of these chips. This follows calls from US officials for the installation of location tracking capabilities in the chips being sold to China. It is unclear whether this will be enough to appease Beijing if security concerns are not addressed.",
  "shortSummary": "China has urged local firms not to use Nvidia's H20 chips due to national security concerns, despite recent US-China trade truce.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "7a1d0b8efb774b129fbdd5be70bb2878",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "China is reportedly urging its companies to avoid using Nvidia's H20 chips, following President Trump's announcement regarding the sale of these chips to the Chinese market under certain conditions. This move is seen as a response to national security concerns raised by China, which claims there are potential backdoors in the chips. Despite the U.S. offering to allow sales in exchange for a portion of revenue, China's actions indicate ongoing tensions and a commitment to enhancing its own semiconductor capabilities.",
  "argos_id": "HXVER6C0S"
}