{
  "url": "https://www.cnn.com/2025/08/11/politics/food-stamps-work-requirements-trump-bill",
  "authorsByline": "Tami Luhby",
  "articleId": "acc54cf29d814b97965475684a32f74c",
  "source": {
    "domain": "cnn.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://media.cnn.com/api/v1/images/stellar/prod/c-gettyimages-1739540240.jpg?c=16x9&q=w_800,c_fill",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T22:57:13.944000+00:00",
  "addDate": "2025-08-11T23:12:16.142838+00:00",
  "refreshDate": "2025-08-11T23:12:16.142839+00:00",
  "score": 1.0,
  "title": "2.4 million people expected to lose food stamps after Trump agenda law broadened work requirements, CBO says",
  "description": "Some 2.4 million fewer Americans, including families with children, are forecast to receive food stamps benefits in an average month after Republican lawmakers expanded work requirements to some parents, older enrollees and others as part of President Donald Trump’s agenda law, according to a Congressional Budget Office analysis released Monday.",
  "content": "Some 2.4 million fewer Americans, including families with children, are forecast to receive food stamps benefits in an average month after Republican lawmakers expanded work requirements to some parents, older enrollees and others as part of President Donald Trump’s agenda law, according to a Congressional Budget Office analysis released Monday.\n\nAnd other recipients are expected to see their monthly assistance shrink – at a time when grocery prices remain high and food banks are trying to cope with increased demand.\n\nThe law requires parents of dependent children to work for their food stamp benefits for the first time. However, fewer people will lose nutrition assistance under the final version of the sweeping tax and spending cuts package that Trump signed into law last month, compared to the bill passed by the House earlier this year.\n\nThat version called for requiring parents of children ages 7 and older to work, which would have led to enrollment dropping by 3.2 million people in an average month, a CBO analysis of the House bill found.\n\nThe CBO released several reports that looked at the impact of different provisions of the law – which enacts the historic cuts to the nation’s safety net program, while providing trillions of dollars in tax relief – on those who receive food stamps, Medicaid and Affordable Care Act coverage through fiscal year 2034. It also examined how the package will affect Americans with different incomes, finding that the lowest-income households would see their incomes fall, while the richest would receive a notable bump.\n\nThe Supplemental Nutrition Assistance Program, or SNAP, as food stamps are formally known, has long required certain able-bodied adults to work to receive benefits for longer than three months. But the GOP’s “big, beautiful bill” broadened that mandate to parents of dependent children – requiring that those with kids ages 14 and older to work, volunteer or participate in job training at least 80 hours a month.\n\nAlso, the law requires that adults ages 55 to 64, veterans, people experiencing homelessness and former foster care youth to meet the mandate, though it exempts Native Americans. It also makes it harder for states to receive waivers during difficult economic times.\n\nAmong those losing coverage in an average month will be 300,000 adults who live with children ages 14 and older, CBO estimated.\n\nAnother controversial provision requires certain states to pick up the share of food stamp benefit costs for the first time. States with payment error rates of at least 6% will have to shoulder between 5% and 15% of the tab, starting in fiscal year 2028. This could prompt some states to cut back on benefits or eligibility or even leave the program, CBO found.\n\nThis measure is forecast to reduce or eliminate food stamp benefits for about 300,000 people in an average month. Also, about 96,000 children will receive smaller subsidies through child nutrition programs.\n\nUnder the House bill, by contrast, states would have had to pay a larger share of the costs, prompting them to reduce or eliminate benefits for about 1.3 million people in an average month and affecting about 420,000 children.\n\nOther provisions in the law, including changes to the formula that determines families’ monthly assistance, are projected to decrease benefits for certain households.\n\nMany food stamp enrollees are employed, but they may get caught up in red tape trying to report their work or hold jobs without consistent hours, said Gina Plata-Nino, interim SNAP director at the left-leaning Food Research & Action Center.\n\n“People are trying to make ends meet,” she said. “They will be hungrier, they will be sicker without that help.”\n\nThe elimination of this support will come at a time when more people will also lose their health insurance, she noted.\n\nThe law requires certain Medicaid enrollees – including parents of children ages 14 and older – to work for the first time. This measure will lead to 5.3 million more people being uninsured in 2034, according to the CBO analysis.\n\nOverall, the package’s Medicaid measures are forecast to lead to 7.5 million more Americans without insurance, while changes to the Affordable Care Act will lead to 2.1 million more people being insured. In total, 10 million more Americans will not have health insurance by 2034.\n\nWho comes out ahead\n\nWhile the law will boost incomes of Americans, on average, it will not benefit everyone, the CBO found. The cuts to the safety net will outweigh the tax reductions for the lowest-income households.\n\nThose at the bottom of the income ladder, who earn less than $24,000, on average, from wages and other income streams, will see their projected incomes drop by about $1,200 a year, or 3.1%, between 2026 and 2034 – mainly from reductions in benefits, including Medicaid and food stamps.\n\nMiddle-income Americans, who earn about $86,000, on average, will get an $800 bump, or about 0.8%, according to the analysis.\n\nBut the highest earners, with incomes of nearly $700,000, on average, will see a $13,600 jump in their incomes, or about 2.7%.\n\nThe wealthiest 10% will receive 63% of the “spoils” of the package, Justin Wolfers, an economics professor at the University of Michigan, posted on X. By contrast, the bottom 60% will receive 4%.",
  "medium": "Article",
  "links": [
    "https://www.cnn.com/politics/president-donald-trump-47",
    "https://x.com/JustinWolfers/status/1954988370326634832",
    "https://www.cnn.com/2025/05/23/politics/food-assistance-gop-big-beautiful-bill-cbo",
    "https://www.cnn.com/2025/03/22/politics/food-banks-usda-delivery-halt",
    "https://www.cnn.com/politics/trump-agenda-bill-provisions-timeline-vis",
    "https://www.cnn.com/2025/08/08/business/grocery-prices-trump-poll?iid=cnn_buildContentRecirc_end_recirc&recs_exp=up-next-article-end&tenant_id=related.en",
    "https://www.cnn.com/2025/07/21/politics/americans-losing-health-insurance-trump-bill",
    "https://www.cnn.com/follow",
    "https://www.cnn.com/2025/05/31/politics/medicaid-cuts-work-requirements-gop-bill"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "food stamp benefits",
      "weight": 0.094865784
    },
    {
      "name": "food stamps benefits",
      "weight": 0.094865784
    },
    {
      "name": "food stamp benefit costs",
      "weight": 0.09126548
    },
    {
      "name": "food stamps",
      "weight": 0.08551744
    },
    {
      "name": "Many food stamp enrollees",
      "weight": 0.08071159
    },
    {
      "name": "more people",
      "weight": 0.07287458
    },
    {
      "name": "Trump agenda law",
      "weight": 0.06927745
    },
    {
      "name": "food banks",
      "weight": 0.066961564
    },
    {
      "name": "different incomes",
      "weight": 0.065519065
    },
    {
      "name": "child nutrition programs",
      "weight": 0.06511926
    }
  ],
  "topics": [
    {
      "name": "Social Issues"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.9873046875
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.986328125
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.79541015625
    },
    {
      "name": "/Law & Government/Government/Legislative Branch",
      "score": 0.6748046875
    },
    {
      "name": "/Law & Government/Social Services/Welfare & Unemployment",
      "score": 0.419677734375
    },
    {
      "name": "/News/Business News/Fiscal Policy News",
      "score": 0.408935546875
    }
  ],
  "sentiment": {
    "positive": 0.04556809,
    "negative": 0.751403,
    "neutral": 0.20302892
  },
  "summary": "The Congressional Budget Office (CBO) has revealed that 2.4 million fewer Americans, including families with children, are expected to receive food stamps benefits in an average month due to the expanded work requirements by Republican lawmakers as part of President Donald Trump's agenda law. This comes as grocery prices remain high and food banks struggle to meet increased demand. However, fewer people will lose nutrition assistance under the final version of the sweeping tax and spending cuts package, compared to the House version. The law requires parents of dependent children to work for their food stamp benefits for the first time, exempts adults ages 55 to 64, veterans, people experiencing homelessness and former foster care youth. It also makes it harder for states to receive waivers during difficult economic times. The CBO also found that the lowest-income households would see their incomes fall, while the richest would receive a notable bump.",
  "shortSummary": "The Trump agenda law will result in 2.4 million fewer Americans receiving food stamps, while Medicaid benefits will decline, impacting lower incomes and health insurance.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "d9ad2326171b4060aac3f68f9a04e1bc",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.cnn.com/2025/05/31/politics/medicaid-cuts-work-requirements-gop-bill",
      "text": "Without Medicaid, Joanna Parker would have a much tougher time holding down a job.\nThe Garner, North Carolina, resident works for a local home goods store up to 20 hours a week, typically. But she also suffers from degenerative disc disease in her spine and relies on Medicaid to cover her doctor’s visits, physical therapy and medication that helps her manage the pain so she can get out of bed in the morning.\n“If I lose my insurance, I lose my ability to work,” said Parker, 40, who was uninsured for about a decade until North Carolina expanded Medicaid to low-income adults in December 2023.\nThat’s why Parker is so worried about the sweeping Republican tax and spending cuts package that the Senate narrowly approved on Tuesday. The bill, which passed the House by a slim margin in May, would impose the first-ever work requirement on Medicaid enrollees like her. Lawmakers hope to send the legislation, which aims to fulfill President Donald Trump’s agenda, to his desk before July 4th.\nThough she’s employed, Parker fears she could be stripped of her health insurance if she’s not able to work enough hours every month or gets tripped up in reporting her time on the job to the state – should the work mandate become law. She is now facing the potential need for a biopsy so she’s even more worried that she could be left without insurance.\n“I feel it will be so easy to lose your coverage if you do the reporting the wrong way and you can’t fix it,” said Parker, who has applied for full-time jobs over the past 18 months but said she hasn’t received responses.\nThe Senate GOP’s “big, beautiful bill” would mandate that many Medicaid expansion enrollees ages 19 to 64 work, volunteer, go to school or participate in a job training program at least 80 hours a month to obtain or maintain coverage. The requirement, which would go into effect by the end of 2026, would not apply to parents with children under age 14, pregnant women, medically frail individuals and those with substance-abuse disorders, among others. (The House version would exempt all parents with dependent children.)\nThe provision would help achieve Republicans’ longstanding goal of introducing work requirements into Medicaid. It’s part of an unprecedented set of cuts that GOP lawmakers would make to the nation’s safety net program.\nProponents say the mandate would prompt enrollees who could – and should, in supporters’ view – work to get jobs and, eventually, move off of Medicaid. Also, they argue, it would preserve the program for the most vulnerable Americans and reduce spending on the low-income adults who gained coverage through the Affordable Care Act’s expansion provision, a frequent target of congressional Republicans.\n“If you are an able-bodied adult and there’s no expectation of you to work or train or volunteer in any way, there’s going to be a large number who don’t,” said Jonathan Ingram, vice president of policy and research at the Foundation for Government Accountability, which promotes work requirements in government assistance programs.\nBut many Medicaid enrollees and their advocates fear millions of people would lose their coverage under the proposed measure, including many who already work or qualify for an exemption but would get stuck in red tape.\nAn estimated 5.2 million Medicaid recipients would lose their coverage over 10 years because of the work mandate, and few would have access to job-based insurance, according to a Congressional Budget Office analysis of the House bill. Overall, the legislation would leave nearly 11 million more people uninsured in 2034, according to CBO.\nCBO has not released a detailed breakdown of the impact of the bill passed by the Senate, but a preliminary estimate from Sunday found that it would result in nearly 12 million more people being uninsured in 2034. (The final version of the bill included a change that would likely reduce the number of uninsured by more than 1 million people.)\nOn Medicaid and working\nMany adults with Medicaid coverage have jobs, though the estimates vary.\nSome 38% of adult enrollees had full-time jobs in 2023, most of them for the full year, according to KFF, a nonpartisan health policy research group that looked at folks ages 19 to 64 without dependent children who did not receive disability benefits or have Medicare coverage, which insures people with disabilities. Just over 20% worked part time, up to 35 hours a week.\nAnother 31% reported that they did not work because they were caregivers or in school or had an illness or disability, all of which might qualify them for exemptions from the work requirements under the House bill.\nOnly 12% of the enrollees said they were not working because they couldn’t find jobs, had retired or reported another reason, according to the KFF analysis, which is based on US Census Bureau data.\n“Most people are doing the things that they’re expected to do in terms of qualifying activities or things that could qualify them for an exemption,” said Michael Karpman, principal research associate at the Urban Institute. “But people have a lot of difficulty navigating the process for reporting their exemptions, or if they’re not exempt, reporting their work activities.”\nHe pointed to Arkansas, the first state to temporarily implement work requirements during Trump’s first term before the effort was halted in federal court. More than 18,000 Medicaid enrollees lost their coverage over several months – even though the state automatically exempted about two-thirds of those subject to the mandate.\nMany beneficiaries in Arkansas did not understand the work requirements or did not realize it applied to them, a 2019 Urban Institute report found. Participants tend to move frequently so their contact information may have been outdated. Others had difficulty using the online reporting portal, especially if they did not have access to computers and internet service.\n“That population has all kinds of challenges with interacting with a system like that,” said Bill Kopsky, executive director of the Arkansas Public Policy Panel, a social and economic justice advocacy group. He noted that many enrollees didn’t receive mailed notifications from the state or didn’t realize they had to take action.\nWhat’s more, the mandate was not associated with an increase in employment, though the uninsured rate did rise among low-income residents in the affected age group, said Karpman, who analyzed Census data in a recent report. That finding is in line with a previous study from Harvard University researchers, which was based on telephone surveys.\nIngram, however, challenges the assertion that the effort did not spur Medicaid recipients to find work. He noted in a recent report that more than 9,000 enrollees found jobs during the time the work requirement was implemented. Some 99% of them were in the age group subject to the mandate, according to a prior foundation report that cited state data.\nCan’t afford to lose Medicaid again\nKatrina Falkner knows what it’s like to be stuck in a Medicaid paperwork morass. The Chicago resident, who cares for her elderly father and other family members with disabilities, said she was disenrolled from the program in 2023 after the state Department of Human Services lost the paperwork that she had spent days organizing.\nThe agency told her that it reinstated her, she said. But when she went to the hospital, she found out she was still uninsured. It took several visits to multiple agency offices before the issue was resolved the following year.\nThe department told CNN that such scenarios are “extremely rare” and it works to “ensure timely review and enrollment” for all applicants eligible for Medicaid.\nFalkner, 43, volunteers with several community organizing groups at least 20 hours a week and works every other Saturday as a Head Start ambassador for the Chicago Early Learning program. She also suffers from asthma, anemia, vertigo and other conditions, which can make it hard for her to work or volunteer at times. Being able to meet the reporting requirements concerns her, especially since her electricity and internet access are sometimes cut off.\n“If I lost my Medicaid, it would cause me a whole lot of struggles,” she said, noting that the program covers her nebulizer and other health care needs. “If they don’t have the right documents, I won’t be able to be in existence because I can’t breathe.”\nAlthough Dana Bango of Zionville, North Carolina, has dealt with state social service agencies for years, she still “sweats it every time.” There are many strict deadlines and hoops to jump through, so she has to remain vigilant, she said.\nThe potential work mandate fills her with “dread” since she’s worried that she could fall through the cracks and lose her Medicaid coverage – even though she works 20 hours a week at the North Carolina Christmas Tree Association and delivers for Door Dash 10 hours a week.\nA cancer survivor who still needs follow up care, Bango, 57, is concerned that she may not get the help she could need from state workers to log her hours if the mandate takes effect.\n“I’ve been uninsured before. I don’t want to go back there. It’s a scary thing,” she said. “This adds more stress, which will lead to more health issues. It’s not good for low-income working people like us.”\nThis story has been updated with additional developments."
    },
    {
      "url": "https://www.cnn.com/2025/03/22/politics/food-banks-usda-delivery-halt",
      "text": "In the coming weeks, the shelves at dozens of food pantries in California’s Fresno County will be a little emptier. Visitors won’t be able to take home as many groceries, and their bags will contain fewer nutritious items like chicken, eggs, milk and cheese.\nThat’s largely because the US Department of Agriculture has halted $500 million in deliveries to food banks nationwide, multiple food banks told CNN. The Biden administration had announced the additional funding last year.\nThe Central California Food Bank, which distributes food to 60 pantries in the county, recently learned that 13 truckloads of groceries – worth $850,000 – set to be delivered between April and July were canceled. It comes at a time when many residents are struggling to afford food since supermarket prices remain high, said Natalie Caples, the food bank’s co-CEO.\n“My food bank in Fresno can’t magically come up with $850,000 and 500,000 pounds of food to backfill that cancelation,” Caples said, noting that the nonprofit is already running at a deficit. “It means neighbors are getting less food when they show up at these distribution sites, and they’re getting a lesser variety of foods.”\nThe USDA confirmed to Feeding America, a nationwide network of more than 200 food banks and 60,000 meal programs, that the agency is reviewing the funding, said Vince Hall, chief government relations officer at the nonprofit.\n“It is our hope that that the review will conclude with a decision to continue investing CCC (Commodity Credit Corporation) dollars in food purchases,” Hall said, noting that food banks from coast to coast are in danger of not having enough items to meet the need. The problem is particularly acute in rural areas, where food banks rely even more on government-supplied groceries.\nThe $500 million in funding came from the USDA’s Commodity Credit Corporation, which at times provides additional resources to purchase food from American farmers and ranchers and send it to emergency food providers. The pause comes soon after the agency announced it is ending two Covid-19 era programs that provided money for food banks and schools to purchase food from local and regional farmers and ranchers, halting some $1 billion in funding.\nAsked for comment on the pause, the USDA said that the Biden administration created “unsustainable programming and expectations using the Commodity Credit Corporation.”\nThe agency noted that it continues to buy food for The Emergency Food Assistance Program, spending more than $166 million so far this fiscal year, which began October 1. Also, it has purchased more than $300 million in various poultry, fish, fruits, vegetables and tree nuts through another assistance program and recently approved an additional $261 million in purchases of more fruits, vegetables and tree nuts.\nPolitico first reported the halt in food deliveries.\nIn the Washington, DC, metro area, the Capital Area Food Bank is scrambling to replace $1.3 million in food deliveries that have been canceled, said Radha Muthiah, CEO of the nonprofit, which served 64 million meals through more than 400 partners agencies last year. Some 27 trucks containing the equivalent of 670,000 meals, including chicken, eggs, blueberries and other highly nutritious items, are now listed as “returned” in the USDA portal, she said.\nThe food bank is turning to its supporters – including food retailers and wholesalers, corporations, foundations, individual donors and others – to try to close at least part of the gap, although it will be hard to do in such a short period of time, Muthiah said.\n“We are really trying very hard not to reduce the amount of food that flows through our network because we know it is needed by folks right now and potentially needed by more individuals who might be affected by some of the cutbacks in the federal government workforce,” Muthiah said.\nBut not all food banks can turn to private and corporate donors to make up for loss of USDA-supplied food.\nFeeding Southwest Virginia, which serves 26 mostly rural counties, had 10 truckloads containing $513,000 worth of food paused. It doesn’t have the resources to buy food to replace those now-canceled deliveries, said Pamela Irvine, the nonprofit’s CEO.\n“We have to make some tough decisions, much like the families or neighbors that are struggling now,” Irvine said. “It could be that some of our agencies and programs will have to provide less food, or it could be that we provide food to less neighbors.”\nThis story has been updated with additional information."
    },
    {
      "url": "https://www.cnn.com/2025/05/23/politics/food-assistance-gop-big-beautiful-bill-cbo",
      "text": "Millions of low-income Americans, including families with children, could lose their food stamp benefits under House Republicans’ newly passed tax and spending cuts package, according to a Congressional Budget Office analysis released Thursday.\nOthers could see smaller monthly assistance.\nThe analysis is the latest to show the impact of the historic cuts to the nation’s safety net programs contained in the package, which aims to fulfill President Donald Trump’s agenda. The legislation would provide trillions of dollars in tax cuts while slashing federal support for food stamps and Medicaid to help offset the cost. The package, however, is expected to undergo multiple changes in the Senate, where some lawmakers have already expressed concerns about the safety net provisions.\nAs written, the bill would reduce federal spending on the Supplemental Nutrition Assistance Program, known as SNAP, the official name for food stamps, by roughly $286 billion over the next decade, according to the CBO analysis, which was requested by Sen. Amy Klobuchar and Rep. Angie Craig, ranking members of the Senate and House agriculture committees, respectively. House Republicans have said the measures are intended to “restore integrity” to the program, which provides aid to roughly 42 million Americans.\nAmong the most consequential and controversial provisions are expanding the program’s existing work requirements to many older Americans, and, for the first time, to many parents. Also, states would have less flexibility in waiving these requirements during tough economic times.\nThese measures would strip roughly 3.2 million people of their food stamp benefits in an average month over the next decade, CBO estimates. This includes 800,000 people who live with children ages 7 and older.\nStates would have to share in the cost of the benefits for the first time, shouldering between 5% and 25% of the cost depending on their payment error rate. State responses would vary, but some “would modify benefits or eligibility and possibly leave the program altogether because of the increased costs,” CBO projects.\nThe provision would lead states to reduce or eliminate food stamp benefits for about 1.3 million people in an average month over the decade, CBO estimates. Also, subsidies for child nutrition programs would decrease for about 420,000 children during that period.\nOther measures in the bill, including capping annual increases in benefits, would also reduce monthly assistance. And a provision tightening eligibility for noncitizens would leave between 120,000 and 250,000 people without aid.\nCBO noted that the coverage loss projections are for each set of provisions individually and do not account for overlap in the people who could be affected. Its analysis does not provide an overall figure for how many people would lose access to food stamps.\nThe House bill also calls for introducing the first-ever work requirement to Medicaid, which could leave millions of low-income Americans without health coverage, according to experts."
    },
    {
      "url": "https://www.cnn.com/politics/trump-agenda-bill-provisions-timeline-vis",
      "text": "President Donald Trump signed his landmark tax and spending cuts bill into law on July 4, notching the first major legislative achievement of his second term.\nCongressional Republicans approved the president’s sweeping agenda bill on an ambitious timeline over the blanket opposition of Democrats, as well as some consternation within the GOP over its impact to the federal deficit and certain government programs.\nAmong its myriad provisions, the package makes permanent the 2017 tax cuts that were set to expire at year’s end and beefs up funding for defense, border control and immigration enforcement. It also enacts a historic reshaping of the nation’s safety net, particularly imposing steep cuts to Medicaid and food stamps.\nSome of the measures take effect this year – for instance, the expiration of the electric vehicles tax credit and the temporary elimination of taxes on tips and overtime work. Other provisions don’t kick in for several years, notably, after the 2026 midterm elections.\nHere’s a timeline of when key provisions from the president’s “big, beautiful bill” take effect:\nSeveral student loan provisions in the bill will take effect next year. Additionally, one month before the midterm elections, a provision limiting Medicaid eligibility for immigrants will set in.\nKey parts of the bill — including new work requirements and increased eligibility checks for Medicaid — are set to kick in in the lead up to the 2028 presidential election.\nStill unclear is when two major changes to the food stamp program will take effect. The US Department of Agriculture said it will issue a memorandum to states about implementing the law, including expanding the work requirement to recipients ages 55 to 64 and to parents of children older than 13, as well as limiting the eligibility of certain legal immigrants.\nLearn more about the bill provisions in our searchable table:"
    },
    {
      "url": "https://www.cnn.com/politics/president-donald-trump-47",
      "text": "The top numbered articles will be viewable to readers when programmed onto a page. Make sure you have 30 or more cards added to the container for the machine learning (ML) feature to work. Your queued up articles, seen in the violet section, will use ML to surface up relevant content to the reader based on their individual interests and preferences.\nLatest headlines\nTrump’s DC police takeover was fueled by attack on former DOGE staffer and his own observations of homelessness, allies say\nPresident Donald Trump’s takeover of the Washington, DC, police set off a scramble across the city on Monday.\nFor summit with Putin, Trump should channel Reagan\nWhat might deliver a ceasefire? Not a performative meeting that allows Vladimir Putin to wriggle out of sanctions. Instead, Trump should study President Ronald Reagan at Reykjavik.\n2.4 million people expected to lose food stamps after Trump agenda law broadened work requirements, CBO says\nSome 2.4 million fewer Americans, including families with children, are forecast to receive food stamps benefits in an average month after Republican lawmakers expanded work requirements to some parents, older enrollees and others as part of President Donald Trump’s agenda law, according to a Congressional Budget Office analysis released Monday.\nTrump has federalized DC’s police force. Now what?\nThe Metropolitan Police along with federal agencies tasked with helping curb crime in the nation’s capital are scrambling to figure out roles and strategy following President Donald Trump’s decision to declare a crime emergency and federalize DC’s police force, multiple sources told CNN.\nCNN Poll of Polls: Trump approval rating over time\n35%\n40%\n45%\n50%\n55%\n60%\n65%\nFeb 19 2025\nMar 22\nApr 22\nMay 24\nJun 24\nJul 25 2025\nThe 08/07/25 Poll of Polls is an average of the following polls:\nPoll |\nDates | Approve | Disapprove | Change in Approval | Sample Size | Sample Type | Margin of Error |\n|---|---|---|---|---|---|---|---|\n| July 29 – August 3 | 46% | 51% | +2 | 1,000 | Adults | +/-3.1% pts. | |\n| July 25-30 | 38% | 58% | -6 | 1,000 | Adults | +/-3.5% pts. | |\n| July 25-27 | 40% | 56% | -1 | 1,023 | Adults | +/-3.3% pts. | |\n| July 14-16 | 42% | 57% | 0 | 1,500 | Adults | +/-2.7% pts. | |\n| July 16-18 | 42% | 58% | -3 | 2,343 | Adults | +/-2.5% pts. |\nGo deeper\nThe top numbered articles will be viewable to readers when programmed onto a page. Make sure you have 30 or more cards added to the container for the machine learning (ML) feature to work. Your queued up articles, seen in the violet section, will use ML to surface up relevant content to the reader based on their individual interests and preferences.\nThe top numbered articles will be viewable to readers when programmed onto a page. Make sure you have 30 or more cards added to the container for the machine learning (ML) feature to work. Your queued up articles, seen in the violet section, will use ML to surface up relevant content to the reader based on their individual interests and preferences.\nAnalysis\nThe top numbered articles will be viewable to readers when programmed onto a page. Make sure you have 30 or more cards added to the container for the machine learning (ML) feature to work. Your queued up articles, seen in the violet section, will use ML to surface up relevant content to the reader based on their individual interests and preferences.\nFacts First\nThe top numbered articles will be viewable to readers when programmed onto a page. Make sure you have 30 or more cards added to the container for the machine learning (ML) feature to work. Your queued up articles, seen in the violet section, will use ML to surface up relevant content to the reader based on their individual interests and preferences.\nTrump's Tariffs\nAd Feedback\nThe top numbered articles will be viewable to readers when programmed onto a page. Make sure you have 30 or more cards added to the container for the machine learning (ML) feature to work. Your queued up articles, seen in the violet section, will use ML to surface up relevant content to the reader based on their individual interests and preferences.\nLegal Actions\nThe top numbered articles will be viewable to readers when programmed onto a page. Make sure you have 30 or more cards added to the container for the machine learning (ML) feature to work. Your queued up articles, seen in the violet section, will use ML to surface up relevant content to the reader based on their individual interests and preferences.\nUS and the world\nThe top numbered articles will be viewable to readers when programmed onto a page. Make sure you have 30 or more cards added to the container for the machine learning (ML) feature to work. Your queued up articles, seen in the violet section, will use ML to surface up relevant content to the reader based on their individual interests and preferences.\nReforming the federal government\nAd Feedback\nCNN's White House team\nThe top numbered articles will be viewable to readers when programmed onto a page. Make sure you have 30 or more cards added to the container for the machine learning (ML) feature to work. Your queued up articles, seen in the violet section, will use ML to surface up relevant content to the reader based on their individual interests and preferences.\nThe top numbered articles will be viewable to readers when programmed onto a page. Make sure you have 30 or more cards added to the container for the machine learning (ML) feature to work. Your queued up articles, seen in the violet section, will use ML to surface up relevant content to the reader based on their individual interests and preferences.\nTrump's first 100 days: Reader questions\nCNN anchors and correspondents responded to reader questions submitted about President Donald Trump’s first 100 days of his second term.\nHow Trump won\nThe top numbered articles will be viewable to readers when programmed onto a page. Make sure you have 30 or more cards added to the container for the machine learning (ML) feature to work. Your queued up articles, seen in the violet section, will use ML to surface up relevant content to the reader based on their individual interests and preferences.\nThe top numbered articles will be viewable to readers when programmed onto a page. Make sure you have 30 or more cards added to the container for the machine learning (ML) feature to work. Your queued up articles, seen in the violet section, will use ML to surface up relevant content to the reader based on their individual interests and preferences.\nThe top numbered articles will be viewable to readers when programmed onto a page. Make sure you have 30 or more cards added to the container for the machine learning (ML) feature to work. Your queued up articles, seen in the violet section, will use ML to surface up relevant content to the reader based on their individual interests and preferences.\nMore news\nPam Bondi has a new probe into the handling of 2016 Russian meddling. John Durham already spent four years investigating it\nTrump says Qatari jet could be ready for use as Air Force One in 6 months. Experts are deeply skeptical"
    },
    {
      "url": "https://www.cnn.com/2025/07/21/politics/americans-losing-health-insurance-trump-bill",
      "text": "The sweeping tax and spending cuts package that President Donald Trump signed into law on July 4 is expected to leave 10 million more people without health insurance in 2034, according to a Congressional Budget Office estimate released Monday.\nThe projection reflects last-minute alterations to the Senate legislation that changed the CBO’s prior forecast that 11.8 million more people would be uninsured in a decade. (The Senate version of the “big, beautiful bill” ultimately became the law.)\nJust before it approved its version of the bill, the Senate yanked a provision that would have reduced federal Medicaid support for states that use their own funds to provide undocumented residents and others with health insurance similar to Medicaid. The CBO’s prior coverage loss estimate included 1.4 million people in such state programs.\nSeparately, the CBO has projected that an additional 5.1 million more people would be uninsured in 2034 due to the expiration of the enhanced Affordable Care Act premium subsidies that are set to lapse at year’s end, as well as a rule proposed by the Centers on Medicare and Medicaid Services governing Obamacare enrollment and eligibility. (The rule has since been changed and finalized, but CBO has yet to update that part of its estimate.)\nAlthough the CBO’s latest estimate did not break down the impact of different provisions in the law, it previously provided details of the House-passed version, which has some differences.\nThe Medicaid provisions are expected to drive the most loss in coverage by far. Some 7.8 million more people would be uninsured in 2034 due to the changes, with 4.8 million of them being affected by the addition of work requirements for many low-income adult enrollees who gained coverage under Medicaid expansion, according to the CBO’s review of the House bill.\n(The final law extends the requirement to work, volunteer, enroll in classes or attend job training for at least 80 hours a month to parents of children ages 14 and older. The House bill exempted parents of dependent children.)\nOther Medicaid provisions that are expected to result in coverage loss include requiring more frequent eligibility reviews of Medicaid expansion enrollees, delaying implementation of two Biden administration enrollment and eligibility rules, and barring states from levying new or increased taxes on health care providers, according to the CBO’s review of the House bill. (The final law also reduces the cap on provider taxes in expansion states.)\nThe CBO estimate released Monday reaffirmed its earlier forecast that the mega-package is expected to increase the deficit by $3.4 trillion over the next decade when compared with current law, under which the individual income tax provisions of the 2017 tax cuts law would have expired at year’s end."
    },
    {
      "url": "https://www.cnn.com/2025/08/08/business/grocery-prices-trump-poll?iid=cnn_buildContentRecirc_end_recirc&recs_exp=up-next-article-end&tenant_id=related.en",
      "text": "President Donald Trump campaigned on lowering grocery prices during the 2024 race and pledged that Americans are “going to be affording their groceries very soon.” But grocery prices have continued to tick higher after the election, and Americans are starting to change their shopping behavior as they grow more concerned about the economy.\nMore than half of Americans say they are stressed about food costs, according to poll from The Associated Press-NORC Center for Public Affairs Research released this week. Fifty-three percent of people said grocery costs were a “major” stress, while 33% said they were a “minor” stress, according to the poll. Only 14% said groceries were not a source of stress.\nThis was the first AP poll asking Americans about their stress over grocery prices, but other surveys in recent years have shown that Americans are frustrated with grocery costs. The poll shows that Americans remain anxious over the high cost of food and the state of the economy, despite slowing inflation on groceries.\nThey’re not just complaining to pollsters: Customers are making significant changes to what they buy at the grocery store and how they buy it.\nRising prices\nThe rate of inflation on groceries has come down significantly since a 9.4% peak in 2022, driven by supply chain bottlenecks. Grocery prices increased 2.4% for the last 12 months ending in June, according to the latest consumer price index reading.\nBut that doesn’t mean that grocery prices have come down. In some cases, such as eggs, beef, orange juice and other items, prices have even accelerated due to supply changes or extreme weather. There are signs that Trump’s tariffs are impacting prices on imported fruits, canned goods, coffee and other products.\nThe poll results reflect unmet expectations over Trump’s pledges on grocery prices and consumer uncertainty around the direction of the economy, said David Ortega, a food economist at Michigan State University.\nConsumers pay close attention to store prices and grocery bills shape their overall perceptions of the economy. “We’re coming out of an inflationary period. People’s budgets are strained. Everybody sees the price of food,” Ortega said.\nThe broader economy appears to be impacting consumer sentiment around groceries. Consumer confidence has wobbled in recent months over the Trump administration’s trade policies. Recent reports on jobs and consumer spending also showed the economy may be more fragile than previously believed, and Trump’s trade policy is playing a big part.\n“This is an environment with tremendous uncertainty around prices because of administration’s tariff and trade policy,” Ortega said.\nSince the beginning of the year, Americans have fretted over the possibility of higher inflation because of Trump’s trade war. But inflation has remained somewhat tame, with only a few categories seeing prices pick up. That’s because some businesses have chosen to absorb higher costs, and many are still stocked up with inventory they front-loaded in the beginning of the year, economists say.\nEconomists say it may just be a matter of time until inflation accelerates faster as inventories dry up and businesses feel the sting from tariffs. American businesses imported significantly less in June as higher tariffs kicked in, making it more expensive for them to buy foreign-produced goods, the Census Bureau reported Tuesday.\nEating more meals at home\nCompanies say consumers are strapped and adjusting their shopping patterns. They’re buying smaller sizes, using coupons and skipping discretionary items, purchasing only the essentials. They’re also eating more meals at home.\nEconomists say these changes are a troubling sign and part of an economic slowdown that is impacting the job market and companies’ growth plans.\n“Customers continue to spend cautiously in an uncertain economic environment,” Kroger interim CEO Ron Sargent said in June. “Both in high- and low-income levels, they’re navigating a significant uncertainty.”\nKroger is stepping up promotions and expanding its store brands, which are typically cheaper than name brands, to draw shoppers.\nMondelez, the owner of Oreo and Chips Ahoy, said consumers were buying fewer snacks, especially biscuits. The company’s sales in North America dropped 3.5% last quarter.\n“There’s a lot of consumer anxiety” and “frustration” with inflation, said CEO Dirk van De Put.\nCNN’s Bryan Mena contributed to this article."
    }
  ],
  "argos_summary": "A Congressional Budget Office analysis predicts that approximately 2.4 million fewer Americans, including families with children, will receive food stamp benefits monthly due to expanded work requirements under a new law signed by President Trump. The law mandates that parents of dependent children and certain other groups must work to qualify for food assistance, leading to reduced benefits for many, particularly low-income households. Additionally, the legislation is expected to increase the number of uninsured Americans by 10 million by 2034, as it imposes work requirements on Medicaid enrollees, further straining the safety net for vulnerable populations.",
  "argos_id": "I96712UH7"
}