{
  "url": "https://www.politico.com/newsletters/politico-influence/2025/08/11/bob-caseys-new-private-sector-gig-00504422",
  "authorsByline": "",
  "articleId": "3d0e5e368fbb40c19569fec05d027554",
  "source": {
    "domain": "politico.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "VA",
      "county": "Arlington County",
      "city": "Arlington",
      "coordinates": {
        "lat": 38.8903961,
        "lon": -77.0841585
      }
    }
  },
  "imageUrl": "https://static.politico.com/3d/ee/f4d549cf4e548af6712990ce5b9e/politico-cms-shared-graphic-1120x629.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T23:45:42+00:00",
  "addDate": "2025-08-11T23:53:09.777186+00:00",
  "refreshDate": "2025-08-11T23:53:09.777189+00:00",
  "score": 1.0,
  "title": "Bob Casey’s new private sector gig",
  "description": "Former Sen. Bob Casey is rejoining Dilworth Paxson — where he first worked as a paralegal — as of counsel in the corporate and business practice group.",
  "content": "With help from Daniel Lippman\n\nCASEY’S NEW GIG: Former Sen. Bob Casey (D-Pa.) is rejoining Dilworth Paxson — where he first worked as a paralegal — as of counsel in the corporate and business practice group. Casey left office earlier this year after 18 years following his narrow loss to Sen. David McCormick (R-Pa.) in the closest Senate race of the 2024 cycle.\n\n— Casey doesn’t plan on registering to lobby, even when his two-year ban on lobbying Congress lapses in 2027, but he wouldn’t rule out registering at the state level if the work required it. He said in an interview he plans on providing “advice and counsel and support to existing clients” on matters involving state or federal government policy as well as international issues, drawing from his experience in state and federal government.\n\n— Casey sat on some of the most prominent committees in the Senate, including Banking, Finance, HELP and Foreign Relations and Intel. He was also chair of the Aging Committee.\n\n— About a dozen former members of the 118th Congress have gone on to influence-adjacent gigs in the private sector since leaving office earlier this year. Among Casey’s former Senate colleagues, Michigan Democrat Debbie Stabenow is now working at Liberty Partners Group, California Democrat Laphonza Butler is now at the consulting firm Actum and Arizona Democrat-turned-independent Kyrsten Sinema is now at the law and lobbying firm Hogan Lovells.\n\nKKR LOBBIES UP: Private equity giant KKR went on a K Street hiring spree this spring, bringing on three new outside lobbying firms with ties to President Donald Trump. The firm retained Conway Capitol Consulting’s Molly Conway at the beginning of July to work on “expanding and protecting employment-based retirement savings options,” according to a disclosure filed last week.\n\n— Conway held a number of roles at the Labor Department during Trump’s first term, including chief of staff, and she more recently served as a sherpa during the confirmation of current Labor Secretary Lori Chavez-DeRemer.\n\n— KKR retained Michael Best Strategies — which is led by former White House chief of staff Reince Priebus — at the beginning of May to work on financial services and tax policy, the reconciliation bill and energy and infrastructure development, according to a June lobbying disclosure.\n\n— A month earlier, KKR hired a team of lobbyists at Squire Patton Boggs that includes former Trump aides Tommy Andrews and Everett Eissenstat to lobby on tax reform and the regulatory treatment of private equity, tariffs and trade, per an April disclosure.\n\n— This year’s hires were KKR’s first outside lobbying additions since 2007, according to a PI analysis of disclosure filings. That’s when the firm retained Akin Gump Strauss Hauer & Feld, which has continued to lobby for KKR over the last 18 years. Just before last year’s election, KKR brought on Brad Bailey, a former lobbyist for the American Investment Council who worked in the first Trump administration and for two GOP House speakers, as a managing director on its public policy team.\n\n— Trump handed private equity a big win last week, signing an executive order aimed at allowing retirement plans like 401(k)s to invest in so-called alternative assets like cryptocurrencies, real estate and private equity. Those investments provide less transparency and stability compared to ones in traditional stocks and bonds — but potentially offer much steeper returns.\n\n— Private equity also eked out several victories in the GOP megabill signed into law in July. The law includes language that would increase the tax deductibility of companies’ debt payments — a highly sought-after change worth billions to private equity firms, Bloomberg reported. At the same time, the industry managed to keep GOP tax writers from acquiescing to Trump’s demand to turn private equity’s prized treatment of carried interest into a pay-for.\n\nHappy Monday and welcome to PI. Send dispatches from Jackson Hole, Martha’s Vineyard or anywhere else you’re holing up for August recess fundraisers. Add me on Signal at caitlinoprysko.17 and email me at [email protected], and you can add Daniel on Signal at danielbarnes.13 and email Daniel at [email protected]. And follow us on X: @caitlinoprysko and @dnlbrns.\n\n\n\nCORNYN TAX AIDE JOINS HOLLAND & KNIGHT: Andrew Siracuse has left the Hill after 26 years to join Holland & Knight as a partner in its public policy and regulation group. Siracuse has spent nearly two decades working for Sen. John Cornyn (R-Texas), most recently as senior tax counsel for Cornyn, who sits on the tax writing Finance Committee and previously served as GOP whip.\n\n— His arrival will undoubtedly be a boost to Holland & Knight’s clients as K Street navigates the next phase of the GOP megabill, which will focus on implementation and the rulemaking process at the executive branch level.\n\n— Siracuse’s “deep understanding of tax policy, along with his vast network of legislative and executive contacts” will be an “invaluable” resource “to current and future clients during the rulemaking process and beyond,” Rich Gold, the leader of Holland & Knight’s lobbying practice, said in a statement.\n\n— In addition to Siracuse’s work on tax issues for Cornyn, he also served as Republican staff director for multiple Senate Finance subcommittees, including its international trade, customs and global competitiveness and its energy, natural resources and infrastructure panels.\n\nWELCOME TO THE TEAM(STERS): After opening its wallet for Republicans for the first time in decades last year, “Teamsters General President Sean O’Brien is signaling a more permanent realignment by donating to battleground Republicans in the upcoming midterms,” POLITICO’s Adam Wren writes.\n\n— “For the second year in a row, the labor union’s political arm donated to the Republicans’ House campaign arm after nearly two decades of mostly backing Democrats. The labor union’s D.R.I.V.E political action committee — Democrat, Republican, Independent Voter Education — gave the National Republican Congressional Committee $5,000 in the second quarter.”\n\n— “In addition to giving to the NRCC, Teamsters doled out a combined $62,000 in contributions to nearly two-dozen GOP congressional candidates, including in significant battleground districts,” as well as a handful of GOP senators, even though the union has still given more to Democrats. Its political arm also cut a $50,000 check to the Republican Attorneys General Association in June.\n\nGETTING HIGH: The Wall Street Journal’s Josh Dawsey reports that Trump “is considering reclassifying marijuana as a less dangerous drug … after pot companies have poured millions of dollars into Trump’s political groups.”\n\n— Trump reportedly expressed interest in the idea at a $1 million-a-plate fundraiser this month at his Bedminster Club in New Jersey at the urging of Trulieve CEO Kim Rivers. “The fundraiser conversation was part of a campaign by cannabis companies to persuade Trump to pick up where the Biden team left off and reclassify the drug.”\n\n— “The companies have contributed millions to the president’s political groups and hired some of the Washington’s top lobbyists and advisers to Trump. The companies went to Trump directly after failing to gain traction across other agencies in the government.”\n\n— Asked about it today, Trump said he was “looking at” reclassification of the drug — which he acknowledged was divisive among his base — and teased a decision on the matter in the coming weeks, per POLITICO’s Nicole Markus.\n\nBY THE NUMBERS: Trump and his family have banked $3.4 billion in profits through their various business ventures during Trump’s two presidencies, The New Yorker’s David Kirkpatrick argues in a new analysis that attempted to quantify their profiteering for the first time.\n\n— Kirkpatrick’s tally found the first family’s fortune lies overwhelmingly in crypto ventures, which represent around $2.4 billion in profits, while finance ventures like Jared Kushner’s private equity firm and Donald Trump Jr.’s venture capital firm added another $340 million — compared $125 million from properties like Trump’s Mar-A-Lago club.\n\nON DEFENSE: Trump defended the deal he struck with Nvidia CEO Jensen Huang “to waive national security concerns blocking the sale of certain semiconductor chips to China in exchange for the company giving the U.S. government 15 percent of the revenue,” POLITICO’s Doug Palmer and Ari Hawkins report.\n\n— “I said, ‘I want 20 percent if I’m going to approve this for you,’” Trump said at a news conference today, when asked about reports that Nvidia and chipmaker AMD agreed to pay the government a portion of their revenue from the chips in order for a license to do so. “For the country, for our country. I don’t want it myself. .... And he said, ‘Would you make it 15?’ So we negotiate a little deal.”\n\n— “Trump appeared to brush off concerns that he was weakening national security by approving the sale. He said the H20 chip manufactured by Nvidia is ‘obsolete,’ even though there is still a market for it in China and other places. To back up his point, Trump said he would not make a deal to allow Nvidia to export a more advanced chip known as Blackwell to China unless it was somehow altered ‘in a negative way.’”\n\n\n\n— The America First Policy Institute is launching a Minnesota state chapter led by Ryan Wilson as chair and Zach Freimark as executive director. Wilson is an attorney and former state auditor candidate and Freimak is a senior political strategist at Red Rock Strategies and a political adviser to House Majority Whip Tom Emmer.\n\n— Nisha Desai is joining Van Ness Creative Strategies as senior director of digital fundraising in its new D.C. office. She previously was digital fundraising director at the DCCC.\n\n— Dean Ball is joining the Foundation for American Innovation as a senior fellow. He previously was senior policy adviser for artificial intelligence and emerging technology in the White House Office of Science and Technology Policy.\n\n— Jake Jordan is now research director for the AFL-CIO. He previously was deputy research director for the Biden White House and is a Gretchen Whitmer alum.\n\n— Max Eden and James Paul are joining the America First Policy Institute. Eden will be director of federal education policy and previously was a director at the Domestic Policy Council and an alum of Manhattan Institute and AEI. Paul will be director of state education policy and previously was executive director of the West Virginia Professional Charter School Board.\n\n— Janis Bowdler and Felicia Escobar Carrillo are joining Equis Research as senior fellows. Bowdler will be a senior fellow on the economy and previously was the first counselor for racial equity at the Treasury Department. Escobar Carrillo will be a senior fellow on immigration and previously served as chief of staff at U.S. Citizenship and Immigration Services and is a White House Domestic Policy Council alum.\n\n— Remi Raphael has joined the Electric Power Research Institute as its new vice president of AI transformation and chief AI officer, per Morning Energy. He was most recently the head of digital technology at Origis Energy.\n\n— Michael Pape has been appointed chief of staff for USDA’s Rural Utilities Service, Morning Ag reports. He was most recently an associate at Capitol South and is a former district director for former Rep. Ed Whitfield (R-Ky.), political director for Kentucky’s Republican Party and former congressional candidate.\n\n— Anna Pilato will be chief of staff for USDA’s Office of Partnerships and Public Engagement Jason Allen will be senior adviser in the office, per MA. Pilato was previously director of federal public policy for the Christian Medical and Dental Associations and is an HHS alum, and Allen is president of Team Allen LLC and a former consultant for AFPI and is a USDA alum.\n\n\n\nRooted With The People (Rep. Rashida Tlaib, Donavan McKinney for Congress)\n\n\n\nHealthcare Institute of New Jersey (HINJ) Federal PAC Inc (PAC)\n\nCollective Strategies & Communications LLC (Formerly Collective Communications L: The Lumber Manufactory, Inc.\n\nAmbessa Solutions LLC: Guinean American League Of Friends For Freedom Incorporated (Inc)",
  "medium": "Article",
  "links": [
    "https://x.com/caitlinoprysko",
    "https://www.politico.com/news/2025/08/11/trump-marijuana-reclassification-decision-00503684",
    "https://www.politico.com/news/2025/08/11/another-megabill-senate-republicans-have-their-doubts-00499987",
    "https://www.politico.com/news/2025/08/10/surgeon-general-blasts-kennedy-response-cdc-shootings-00502310",
    "https://www.politico.com/staff/caitlin-oprysko",
    "https://www.politico.com/newsletters/politico-influence/2025/08/08/tariff-lobbying-shows-little-success-00500765",
    "https://www.bloomberg.com/news/articles/2025-03-24/private-equity-pushes-for-two-letter-tax-change-to-save-billions?sref=f7rH2jWS&embedded-checkout=true",
    "https://www.wsj.com/politics/policy/trump-marijuana-federal-drug-classification-01a73b8c?mod=hp_lead_pos3",
    "https://www.politico.com/newsletters/politico-influence/2025/08/11/bob-caseys-new-private-sector-gig-00504422",
    "https://subscriber.politicopro.com/article/2025/08/trump-to-sign-order-unlocking-private-markets-for-american-savers-00497104",
    "https://www.politico.com/cdn-cgi/l/email-protection#41252320332f243201312e2d283528222e6f222e2c",
    "https://www.politico.com/news/2025/08/09/appeals-court-rules-trump-clamp-down-on-spending-data-defies-congress-authority-00501348",
    "https://twitter.com/politico",
    "https://www.politico.com/newsletters/politico-influence/2025/08/07/an-olympics-sized-lobbying-initiative-00499144",
    "https://www.politico.com/news/2025/08/11/teamsters-donations-00502709",
    "https://www.politico.com/newsletters/politico-influence/2025/08/06/trump-doe-alum-signs-pg-e-00496516",
    "https://www.instagram.com/politico/?hl=en",
    "https://www.politico.com/cdn-cgi/l/email-protection#c8aba7b8bab1bba3a788b8a7a4a1bca1aba7e6aba7a5",
    "https://www.politico.com/newsletters/politico-influence/archive",
    "https://www.politico.com/news/2024/11/07/dave-mccormick-wins-pennsylvania-senate-00188197",
    "https://subscriber.politicopro.com/article/2024/12/chavez-deremer-begins-meeting-with-lawmakers-on-her-nod-for-labor-secretary-00195115",
    "https://www.politico.com/news/2025/08/11/trump-defends-deal-to-sell-nvidia-export-control-license-00503778",
    "https://signal.me/#eu/MS56gia4yyd665Im1goY1X65aPBg7TQANuJd5c4vb4VV1BJ_fY5LrZ38jKgx_sY-",
    "https://signal.me/#eu/vkdE3Fz4WChc9AfCrhQFhomUQnI16PzZxZCKpTju5lNe-3EYRqZB84AiZ4LGKocc",
    "https://x.com/dnlbrns",
    "https://www.politico.com/news/2025/08/11/dc-law-enforcement-national-guard-deployment-00502896",
    "https://www.facebook.com/politico",
    "https://www.politico.com/podcasts",
    "https://www.politico.com/newsletters/politico-influence/2025/08/05/bofa-hires-lanza-amid-trump-threat-00494785",
    "https://www.newyorker.com/magazine/2025/08/18/the-number",
    "https://www.politico.com/newsletters/politico-influence/2024/11/04/kkr-hires-former-private-equity-lobbyist-00187251",
    "https://jacobin.com/2025/06/wall-street-trump-tax-breaks"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "former Trump aides",
      "weight": 0.06633093
    },
    {
      "name": "private equity firms",
      "weight": 0.059992913
    },
    {
      "name": "Trump",
      "weight": 0.059554987
    },
    {
      "name": "Donald Trump",
      "weight": 0.059085056
    },
    {
      "name": "President Donald Trump",
      "weight": 0.05717394
    },
    {
      "name": "senior director",
      "weight": 0.056349173
    },
    {
      "name": "political director",
      "weight": 0.05596614
    },
    {
      "name": "Private equity",
      "weight": 0.054215267
    },
    {
      "name": "private equity",
      "weight": 0.054215267
    },
    {
      "name": "tax policy",
      "weight": 0.05375436
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.9912109375
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.97265625
    },
    {
      "name": "/Law & Government/Government/Legislative Branch",
      "score": 0.93408203125
    },
    {
      "name": "/News/Politics/Campaigns & Elections",
      "score": 0.431396484375
    }
  ],
  "sentiment": {
    "positive": 0.16724542,
    "negative": 0.20042022,
    "neutral": 0.63233435
  },
  "summary": "Former Sen. Bob Casey (D-Pa.) has joined Dilworth Paxson, where he first worked as a paralegal, as of counsel in the corporate and business practice group. Casey plans to provide advice and counsel to existing clients on matters involving state or federal government policy and international issues. He does not plan to register to lobby even when his two-year ban on lobbying Congress expires in 2027. Private equity giant KKR has hired three new outside lobbying firms with ties to President Donald Trump, including Conway Capitol Consulting’s Molly Conway and Michael Best Strategies. KKR also retained a team of lobbyists from Squire Patton Boggs, including former Trump aides Tommy Andrews and Everett Eissenstat, to lobby on tax reform and the regulatory treatment of private equity, tariffs and trade.",
  "shortSummary": "Former US Senator Bob Casey rejoins Dilworth Paxson as counsel for corporate counsel, focusing on advising on government policy, while KKR and other firms with ties to President Donald Trump's administration.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "bec65e262def4f07b5e04952469b1611",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://jacobin.com/2025/06/wall-street-trump-tax-breaks",
      "text": "Trump’s Budget May Give Private Equity a Giant Tax Break\nLawmakers have inserted a line into Donald Trump’s new budget bill that would reward Wall Street firms with billions of dollars in new tax breaks when they load up companies with debt and proceed with pay cuts, factory closures, and layoffs.\nCongressional lawmakers have inserted a line into President Donald Trump’s new tax bill that would reward Wall Street firms with billions of dollars of new tax breaks when they load up companies with debt and proceed with worker pay cuts, factory closures, and mass layoffs, according to bill text reviewed by the Lever.\nThe new bipartisan provision is the culmination of a multimillion-dollar lobbying campaign by private equity giants, whose executives have been among the biggest supporters of Trump and the lawmakers behind the legislation.\nThe provision, which uses the tax code to effectively subsidize Wall Street firms’ takeovers of small- and medium-sized businesses, follows a landmark study demonstrating that employment quickly shrinks at companies when they are purchased by private equity firms. It also follows new data showing a record number of private equity–owned companies are being driven into bankruptcy.\nThe arcane provision buried in Trump’s One Big Beautiful Bill Act moving through Congress would raise the business tax deduction that private equity–owned companies can claim on interest payments they make to pay back loans.\nPrivate equity firms primarily benefit from this deduction because they typically borrow money to acquire businesses, then load those companies up with more debt as they strip down the companies, often leading them into bankruptcy. Indeed, insurmountable levels of debt were at issue in recent corporate collapses like Toys “R” Us, Red Lobster, and Forever 21, as well as essential hospital networks and hundreds of small businesses.\nLawmakers have not broadcast the implications of the new language. The bill text summary released last week euphemistically says only that “this provision increases the cap on the deductibility of business interest expense.”\nThe move is clearly timed to bail out private equity firms at a time when they’re hungry for government support amid high interest rates, according to Eileen Appelbaum, codirector of the Center for Economic and Policy Research and author of Private Equity at Work: When Wall Street Manages Main Street.\n“Private equity sees this as a moment to increase the deduction for the interest they pay on the debt they pile onto the companies they own,” wrote Appelbaum. “They want to pull a fast one and slip this by a public not well-versed in business accounting principles.”\nWhen private equity companies load up their portfolio companies with debt, the larger interest deductions under the proposed tax language could flow back to them in the form of higher returns, as the international law firm Troutman Pepper Locke touted in its legal analysis of the tax bill provision. Through special tax-sharing agreements, private equity owners will sometimes even collect the tax write-off from their debt-ridden portfolio companies and transfer it onto their own books.\nCurrent tax law caps interest deductions at 30 percent of business income, which remains the same in the Senate reconciliation package. But an accounting maneuver included in the bill creates more lenient standards for calculating the deduction as a share of total taxable income, which could boost private equity firms’ tax savings by an estimated 15 percent, netting the companies billions of dollars.\nThis adjusted income calculation will lead to $200 billion in lost government revenues over the next ten years, according to the Committee for a Responsible Federal Budget.\nLobbying for a Stealth Bailout\nThis modification of the tax code, supported by both Congressional Republicans and Democrats, has been a top priority of the American Investment Council, the main lobbying group on behalf of private equity giants. Private equity interests are collectively among the top campaign contributors to Sen. Mike Crapo (R-ID) and Rep. Jason Smith (R-MO), the Senate and House committee chairmen overseeing the drafting of the legislation.\nPrivate equity lobbyists have attempted to spin this deduction as a boon for Main Street, helping to boost investment in American manufacturing and small businesses. But most businesses typically try to avoid massive borrowing costs, while private equity thrives on it.\nThe American Investment Council has spent more than $10 million in the past five years pushing for this policy as well as another carve-out in the bill protecting the carried interest loophole, which allows investment managers to avoid paying millions in taxes on their personal income each year.\nThe interest deduction provision, however, is even more integral to the operation of the financial sector’s debt-financing model. Expanding its scope is a huge gift to Wall Street because it comes at a time when private equity growth has dropped dramatically due to higher costs of borrowing under the Federal Reserve’s interest rates, among other market conditions.\nIn the first quarter of this year, private equity fundraising totals were down by 135 percent compared to this time last year, according to a report from industry publication PitchBook. It’s become harder to raise capital from investors because the returns from the industry have slumped.\nOne factor is that private equity managers have struggled to sell off their companies to new buyers and recoup their initial investment. Holding onto those companies for longer periods drives down the sale price. Debt payments are larger now, too, because of interest rates.\nUnder these dour circumstances, Wall Street turned to Congress to give the sector a lift.\nWhat’s Old Is New Again\nThe new rules for interest deduction are reverting back to a more laissez-faire tax code that fueled the heyday of “leveraged buyouts” in the 1980s.\nThose financial maneuvers typically involve a private equity firm putting down a small amount of their own money and then borrowing the rest, using the assets of the company it’s acquiring as collateral. The acquired company is then typically on the hook for paying off the debt heaped onto its books to finance its own purchase.\nFor example, Toys “R” Us’s bankruptcy in 2015 was in large part the result of a 2005 leveraged buyout by a collection of private equity investors led by KKR and Bain Capital, piling $6 billion in debt onto the toy store chain. Toys “R” Us ended up paying up to $500 million a year just in interest payments to service the debt.\nAfter acquiring its target, private equity managers then juice returns for their executives and investors. That often entails selling off more valuable parts of a company, such as real estate, slashing labor costs, and degrading the quality of service for consumers, in order to make the firm leaner and thus more profitable.\nAnother financial engineering trick by private equity owners is forcing businesses to take on even more debt by borrowing money to make lavish dividend payouts to their investors in what’s known as dividend recapitalizations. Dividend recapitalizations have exploded in recent years and have been extracted by private equity everywhere from shopping conglomerates to cash-strapped hospitals.\nSo far this year, 70 percent of corporate bankruptcies have been linked to private equity control.\nThe havoc wreaked on Main Street by financial firms is directly encouraged by the tax code. Interest payments on the borrowed money can be deducted, boosting the portfolio companies’ tax savings, which directly increase returns for private equity owners.\nUnder the old tax rules, Wall Street investors were afforded a “more generous standard” of deduction, according to Steven Rosenthal, a tax policy expert who worked as a legislative counsel to the Congressional Joint Committee on Taxation. That standard — known as EBITDA — allows businesses to spread their costs on the books for capital-intensive investments such as equipment, and factor in their more valuable assets such as patents or intellectual property.\nBut in 2017, the Trump Tax Cuts and Jobs Act adjusted this accounting standard in order to claw back some revenues to fund other massive tax breaks for the wealthy. It set a 30 percent cap on interest deduction and imposed a stricter accounting method, EBIT, which is just straightforward operating income not including the fluctuating value of other assets.\nThe discrepancy between the old rules and the current rules can be enormous, costing larger corporations millions of dollars in tax savings. In Toys “R” Us’ case, the old rules would have saved the company’s private equity owners an additional $90 million in taxes.\nOn average for most businesses, 85 percent of their debt payments were totally tax-deductible under the old rules. But after the new rules took effect in 2022, they could only write off about 75 percent.\nIn the years leading up to the phase-in of those new rules, private equity lobbied Congress aggressively to kill the stricter limit and return to the old rules.\nIn 2021, a bipartisan group of lawmakers introduced legislation called the “Permanently Preserving America’s Investment in Manufacturing Act,” which proposed an extension of the new interest deduction. The bill’s cosponsors included several Democrats such as former Arizona senator Kyrsten Sinema (I), who was a top recipient of campaign contributions from the private equity industry, totaling over $1 million just in her final year in office. She was joined on the bill by Republican senators James Lankford (OK) and Jerry Moran (KS), also major beneficiaries of private equity cash.\nThose bills didn’t pass, but identical language has now been included in the Senate’s reconciliation bill following the lead of the House’s version."
    }
  ],
  "argos_summary": "Former Senator Bob Casey has rejoined Dilworth Paxson as of counsel in its corporate and business practice group after losing his Senate seat earlier this year. Meanwhile, private equity firm KKR has expanded its lobbying efforts by hiring multiple firms with ties to former President Trump to influence financial services and tax policy. Additionally, the Teamsters union is shifting its political contributions towards Republicans, while Trump is considering reclassifying marijuana to appease cannabis companies that have financially supported him.",
  "argos_id": "I9OW6N57S"
}