{
  "url": "https://www.bloomberg.com/news/videos/2025-08-12/ex-trade-diplomat-on-us-china-tariff-truce-negotiations",
  "authorsByline": "bn",
  "articleId": "92dbe2e3d977421cbd4ba60cae1824bc",
  "source": {
    "domain": "bloomberg.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/izJa8ymV6pJg/v3/-1x-1.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T00:44:08.792000+00:00",
  "addDate": "2025-08-12T00:56:39.190209+00:00",
  "refreshDate": "2025-08-12T00:56:39.190212+00:00",
  "score": 1.0,
  "title": "Ex-Trade Diplomat on US-China Tariff Truce, Negotiations",
  "description": "Ex-Trade Diplomat on US-China Tariff Truce, Negotiations",
  "content": "Every other trade deal has been concluded very quickly. What is the pace of this one telling you? Well, there's not a lot of time for these negotiations to proceed. So I think it's extremely important that both sides have agreed to a tariff rollover. So now they can really put their energies and attention on the key outstanding issues, including export controls, critical minerals, excess capacity, you name it. There's lots of issues on the agenda and not a lot of time to come up with negotiated solutions. Let's talk about some of those export controls. You know, we've been discussing this today on the show. President Trump was looking at allowing Nvidia to sell scaled back Blackwell chips to China, considering that. But does that what does that tell you about national security? And is that now on the table is something that can be negotiated? Well, I have to say, during my career, negotiating with China, whether it be the Republican or Democrat administrations, our position was we're not negotiating on export controls there for national security reasons, not on the table. The Trump administration now is open the door and China is going to take advantage of that opening. And I'm sure top on its list is going to be not only a standstill on new export controls, but looking for rollbacks of the existing export controls. That's going to just really make these negotiations more difficult. Yes. So what are some of the risks that this opens up in your view? Well, it basically means that the United States is going to have to make a decision. Does it supply China the types of chips that it really wants and needs to bolster its own advanced A.I. and high tech industry? Or does it kind of double down and say, you know what? We're not going to supply these these chips and other high tech goods. So it's going to be difficult. And I think there are probably a lot of internal discussions going on in the administration because I don't think everyone's probably on the same page as the president on this one. Yeah, look, China obviously holding a lot more cards than a lot of other trading partners with the US, particularly when it comes to rare earths. So how do you see China using this to its best advantage and how is that going to inform the contours of an eventual deal? Well, exactly. I mean, China comes to this negotiation in a much stronger position than it did during the Phase one trade talks during Trump 1.0, and it is discovered and already exercised and used its leverage with respect to access to critical minerals and magnets. So it's going to use that card to basically try to achieve a more balanced deal with the United States and use it as leverage. If it doesn't like what the U.S. is offering to it Can you foresee a scenario where anything new gets put on the table during the next 90 days? Look, I think there's lots of emerging issues that could be put on the table, but again, not a lot of time. So what I'm hoping even a limited deal is reached in the president. That both presidents announce the deal that there is a process going forward to address other issues that weren't part of the initial deal. I think that's going to be critical if such an agreement is going to be credible and meaningful and durable, frankly.",
  "medium": "Video",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "new export controls",
      "weight": 0.09024628
    },
    {
      "name": "export controls",
      "weight": 0.08641187
    },
    {
      "name": "other issues",
      "weight": 0.08250613
    },
    {
      "name": "China",
      "weight": 0.08164543
    },
    {
      "name": "other high tech goods",
      "weight": 0.074685425
    },
    {
      "name": "lots",
      "weight": 0.07435248
    },
    {
      "name": "other trading partners",
      "weight": 0.06929317
    },
    {
      "name": "critical minerals",
      "weight": 0.06793699
    },
    {
      "name": "emerging issues",
      "weight": 0.06608367
    },
    {
      "name": "Ex-Trade Diplomat",
      "weight": 0.06210732
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Finance"
    },
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Economy News",
      "score": 0.94140625
    },
    {
      "name": "/People & Society/Social Sciences/Political Science",
      "score": 0.93115234375
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.90283203125
    },
    {
      "name": "/Business & Industrial/Shipping & Logistics/Import & Export",
      "score": 0.7880859375
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.7744140625
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.480224609375
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.472412109375
    },
    {
      "name": "/News/World News",
      "score": 0.358154296875
    }
  ],
  "sentiment": {
    "positive": 0.11546275,
    "negative": 0.50944555,
    "neutral": 0.37509173
  },
  "summary": "Ex-Trade Diplomat, Michael Schoen, has expressed concern that both sides have agreed to a tariff rollover, which allows them to focus on key issues such as export controls, critical minerals, excess capacity, and other outstanding issues. Schoen: The issue of export controls is a key concern for the US and China, particularly as they consider allowing Nvidia to sell scaled back Blackwell chips to China, which could potentially jeopardize national security. He predicts that China will use this advantage to secure a more balanced deal with the United States and use it as leverage if it doesn't like what the U.S. is offering to it, Schoen says. He also notes that China's position in this negotiation is a much stronger position than during the Phase one trade talks during \"Trump 1.0\". Schoen hopes that even a limited deal is reached, with both presidents announcing the deal, there will be a process to address other issues that weren't part of the initial deal.",
  "shortSummary": "Ex-Trade Diplomat discusses the challenging and potentially lengthy negotiations between the US and China over trade tariffs, with key issues like export controls and critical minerals on the agenda.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "43b70caf7afd450ab21b67b21f70d3bf",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "The ongoing trade negotiations between the U.S. and China are under pressure due to time constraints, with both sides agreeing to a tariff rollover to focus on key issues like export controls and critical minerals. The Trump administration's potential openness to negotiate on export controls raises national security concerns, complicating the talks. China is in a stronger position than during previous negotiations, leveraging its control over critical minerals to seek a more favorable deal, while the U.S. faces internal divisions on how to proceed.",
  "argos_id": "IBIY1J9L5"
}