{
  "url": "https://www.latimes.com/delos/story/2025-08-11/bad-bunny-new-york-fan-killed-in-puerto-rico-family-wants-justice",
  "authorsByline": "Carlos De Loera",
  "articleId": "cf0660b9a2364ffdaaaf2f62ddaa2733",
  "source": {
    "domain": "latimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "CA",
      "city": "Los Angeles",
      "coordinates": {
        "lat": 34.0536909,
        "lon": -118.242766
      }
    }
  },
  "imageUrl": "https://ca-times.brightspotcdn.com/dims4/default/4d34f2a/2147483647/strip/true/crop/3333x1750+0+1950/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Ff0%2Ff9%2F80c9d2b14992ac97d25f4c53f0ab%2Ftemp-pr-parents.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T00:51:35.987000+00:00",
  "addDate": "2025-08-12T00:55:22.124818+00:00",
  "refreshDate": "2025-08-12T00:55:22.124821+00:00",
  "score": 1.0,
  "title": "Parents of Bad Bunny fan killed in Puerto Rico seek answers: 'We want justice'",
  "description": "The parents of Kevin Mares, who was killed in the La Perla area of San Juan while on a trip to see a Bad Bunny concert, seek 'justice' on behalf of their slain family member.",
  "content": "New York City native Kevin Mares was killed Sunday in the La Perla neigborhood of San Juan, Puerto Rico. The 25-year-old was visiting the island to see a Bad Bunny concert.\n\nMares was fatally shot in the early morning hours, outside of a nightclub called Shelter for Mistreated Men. The shooting took place when several people near Mares began arguing and one pulled out a gun and shot at least three people, the Associated Press reported.\n\nHomicide detective Sgt. Arnaldo Ruiz told the AP that Mares was an innocent bystander in the situation and that a pair of siblings from La Perla remain hospitalized after being shot. No arrests have yet been made.\n\nMares was joined by his girlfriend and two friends in Puerto Rico. It was his partner who ended up delivering the news of his death to Mares’ parents.\n\n“I said, ‘What happened?’ She said, ‘I’m sorry. We lost him,’ ” Hector Mares, Kevin’s father, told CBS News New York.\n\n“Whoever did this, took from us a piece of us, you know?” Kevin’s mother, Sandra Mares, added.\n\nA longtime Bad Bunny fan, Mares and his friends were consistently in attendance of the “La Mudanza” singer’s concerts and had been prepping for their San Juan trip for months.\n\n“Every time Bad Bunny comes here, they go to most all of his concerts,” Sandra Mares said.\n\nMares — whose parents are originally from Mexico — was born and raised in the East Elmhurst neighborhood of Queens and was studying to be a veterinarian at LaGuardia Community College.\n\n“He got a lot of dreams. He was working as a vet technician. And at the same time he was studying,” his father told ABC 7 New York.\n\n“He was about to propose to [his girlfriend] this fall. Yeah. He wanted to do something special. He shared that with us,” his mother added. “He was a lovely son. He cared about all of us, his family, friends. He has a lot of friends who’s really going to miss him, too.”\n\nNow, the Mares family is asking for anyone with information about the shooter and more specifics about the incident to please step forward.\n\n“What we’re asking the people is, if anybody knows what happened, who did this, [to say something],” his mother told CBS. “We don’t know [anything]. We want justice.”\n\nThe family is currently making efforts toward having Mares’ body returned home, but it remains in Puerto Rico as the investigation into his death is still ongoing.\n\nKevin’s father started a GoFundMe to raise enough money — the campaign’s target is currently $50,000 — to plan Kevin’s funeral arrangements.\n\n“Kevin Mares was a deeply loved son, devoted friend, and a source of inspiration to everyone who knew him. His wholehearted kindness, adventurous spirit, and unwavering commitment to family made him a pillar of strength for his loved ones,” the GofundMe page states. “Family was at the center of everything he did, and his sudden passing has left an unfillable void in our lives. ... Your support will help us honor Kevin’s memory and give him the farewell he deserves.”",
  "medium": "Article",
  "links": [
    "https://www.latimes.com/world-nation/story/2025-08-10/a-us-tourist-who-flew-to-puerto-rico-for-a-bad-bunny-concert-was-fatally-shot-police-say",
    "https://abc7ny.com/post/kevin-mares-new-york-man-shot-killed-visiting-puerto-rico-bad-bunny-concert-police-say/17493503/",
    "https://www.gofundme.com/f/help-bring-kevin-mares-home",
    "https://www.latimes.com/california/story/2021-07-28/authorities-seek-killer-of-army-veteran-in-lancaster",
    "https://www.cbsnews.com/newyork/news/kevin-mares-killed-puerto-rico-shooting-queens-nyc/",
    "https://www.latimes.com/delos/newsletter/2025-08-08/bad-bunny-puerto-rico-residency-local-artists-exhibition",
    "https://www.latimes.com/delos",
    "https://www.latimes.com/california/story/2020-01-22/los-angeles-police-stun-gun-death-settlement",
    "https://www.latimes.com/delos/story/2025-08-07/eddie-palmieri-latin-jazz-innovator-pianist-dies-at-88",
    "https://www.latimes.com/california/story/2021-04-03/a-tight-knit-family-business-devastated-by-orange-mass-shooting",
    "https://www.latimes.com/world-nation"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Kevin Mares",
      "weight": 0.11671503
    },
    {
      "name": "Sandra Mares",
      "weight": 0.101219945
    },
    {
      "name": "New York City native Kevin Mares",
      "weight": 0.100846045
    },
    {
      "name": "Mares",
      "weight": 0.0987109
    },
    {
      "name": "Hector Mares",
      "weight": 0.09687208
    },
    {
      "name": "Bad Bunny fan",
      "weight": 0.07624549
    },
    {
      "name": "Kevin",
      "weight": 0.07470847
    },
    {
      "name": "Puerto Rico",
      "weight": 0.07299969
    },
    {
      "name": "Bad Bunny",
      "weight": 0.07245166
    },
    {
      "name": "devoted friend",
      "weight": 0.06629148
    }
  ],
  "topics": [
    {
      "name": "Organized Crime"
    }
  ],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Sensitive Subjects/Death & Tragedy",
      "score": 0.9716796875
    },
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.91015625
    },
    {
      "name": "/Sensitive Subjects/Violence & Abuse",
      "score": 0.87744140625
    },
    {
      "name": "/News/Local News",
      "score": 0.326904296875
    }
  ],
  "sentiment": {
    "positive": 0.06428073,
    "negative": 0.69074565,
    "neutral": 0.24497361
  },
  "summary": "New York City native Kevin Mares was killed in Puerto Rico on Sunday morning, while he was visiting the island to see a Bad Bunny concert. The shooting occurred when several people near Mares were arguing and one pulled out a gun and shot at least three people. No arrests have been made. The Mares family is seeking justice for their son's death and are raising funds for his funeral arrangements. Mares, whose parents are originally from Mexico, was born and raised in Queens and was studying to be a veterinarian at LaGuardia Community College.",
  "shortSummary": "The parents of 25-year-old Kevin Mares, a Bad Bunny fan killed in Puerto Rico, are seeking answers after a shooting incident involving several people.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "0f81aa44b2ee4ef0ad5ebe0924cd0a43",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.gofundme.com/f/help-bring-kevin-mares-home",
      "text": "Help Bring Kevin Mares Home\nDonation protected\nKevin Mares was a deeply loved son, devoted friend, and a source of inspiration to everyone who knew him. His wholehearted kindness, adventurous spirit, and unwavering commitment to family made him a pillar of strength for his loved ones. Kevin had a bright future ahead, with plans to propose to his girlfriend of six years this fall, and he was always creating memories with those closest to him. Family was at the center of everything he did, and his sudden passing has left an unfillable void in our lives.\nThis past weekend, while in Puerto Rico celebrating with friends and preparing to attend the Bad Bunny concert, Kevin was tragically caught in the crossfire of a shooting and lost his life instantly. We are now faced with the heartbreaking task of bringing Kevin home, with significant expenses to transfer his body from Puerto Rico to New York, as well as funeral and memorial costs at Frederick Funeral Home. These unexpected costs have placed a tremendous burden on our family during an already devastating time.\nYour support will help us honor Kevin’s memory and give him the farewell he deserves. Any contribution, no matter the size, will make a meaningful difference as we navigate this unimaginable loss. From the bottom of our hearts, thank you for standing with us and helping bring Kevin home.\nThis past weekend, while in Puerto Rico celebrating with friends and preparing to attend the Bad Bunny concert, Kevin was tragically caught in the crossfire of a shooting and lost his life instantly. We are now faced with the heartbreaking task of bringing Kevin home, with significant expenses to transfer his body from Puerto Rico to New York, as well as funeral and memorial costs at Frederick Funeral Home. These unexpected costs have placed a tremendous burden on our family during an already devastating time.\nYour support will help us honor Kevin’s memory and give him the farewell he deserves. Any contribution, no matter the size, will make a meaningful difference as we navigate this unimaginable loss. From the bottom of our hearts, thank you for standing with us and helping bring Kevin home.\nOrganizer\nHector Mares\nOrganizer\nEast Elmhurst, NY"
    },
    {
      "url": "https://www.latimes.com/california/story/2021-04-03/a-tight-knit-family-business-devastated-by-orange-mass-shooting",
      "text": "‘They were so innocent’: Orange mass shooting shattered a family business; victims remembered\n- Share via\nLuis Tovar lived for his family.\nAn avid outdoorsman, the 50-year-old frequently loaded them up in his fifth-wheel for camping trips to Arizona. He sat them on the back of his Harley-Davidson motorcycle to ride through the hills above Fullerton. They spent every Fourth of July, Easter, Thanksgiving and Christmas gathered at his home in northeast Anaheim.\nAnd when he launched Unified Homes in 2006 with the goal of helping people buy, sell and remodel their manufactured homes, it was only fitting that his family be part of that, too. But this week, a business he built from the ground up became the setting for tragedy.\nOn Wednesday, a gunman entered the office building on West Lincoln Avenue and opened fire, killing Tovar; his daughter Genevieve Raygoza, 28; longtime employee Leticia Solis Guzman, 58; and 9-year-old Matthew Farias, who was Genevieve’s half-brother.\nMatthew’s mother, Blanca Tamayo, who is also Genevieve’s mother, was wounded and remains in critical condition. She also worked at Unified Homes. When police arrived, they found Tamayo’s arms wrapped around her young son, according to the Tovar family.\nThe suspect, 44-year-old Aminadab Gaxiola Gonzalez, is facing multiple counts of murder and attempted murder, along with felony enhancements. Gonzalez had two children with a former employee of Unified Homes, the Tovar family said.\nOrange suspect faces four counts of murder and three counts of attempted murder.\nIn one day, Vania Tovar, 28, had her father, half-sister and members of her large, tight-knit extended family ripped away.\n“My dad was everything for us,” she said through tears Friday. “He was the kindest person. Whenever anyone needed something, even if he hadn’t seen them in years, he was willing to give them the shirt off his back. Our whole family is just so confused. They were so innocent in all of this.”\nLuis Tovar was an Orange County native. He was so well-liked at Anaheim High School that students crowned him prom king his senior year. He later earned a bachelor’s degree and a master’s degree in business administration and finance from Cal State Fullerton and had talked about pursuing a juris doctorate, according to his family.\nAs a father, Tovar had a strict set of rules for his five children. He expected them to eat well, get good grades and work hard. He was much softer with his six grandchildren.\n“Waffles and ice cream — that’s what he considered to be a good breakfast for his grandkids,” Vania Tovar said.\nKennedy Gonzalez, 21, said he felt a mixture of anger and sadness when he learned that one of the victims of the mass shooting was an old family friend — Luis Tovar.\n“He was a good man, a family man,” Gonzalez said. “He always took care of my family.”\nLuis Tovar was especially close to daughter Genevieve Raygoza, whom Vania Tovar described as being “sunshine on a cloudy day.”\nVirus restrictions are being lifted, but recent shootings in Orange County, Georgia and Colorado may spur anxiety about reentering public spaces. Here are some safety tips.\nFather and daughter shared a love for the outdoors and a passion for their business. She worked for him as a transaction manager at Unified Homes for a decade.\nHer husband, Armando Raygoza, works on the construction side of the business. But the couple’s story began long before they became colleagues. Friendship blossomed into love inside a calculus classroom at Fullerton College. Genevieve Raygoza captured Armando’s attention the moment she stepped into the classroom.\n“She was beautiful. I saw her and immediately knew I had to sit as close as I could to her,” he said. “She had it all — beauty and brains — and a huge heart.”\nWhen the instructor suggested classmates exchange information to work collaboratively on assignments, she surprised him by asking for his phone number before he could ask for hers. After two years of dating, they had their first child — a son they named Nathaniel. They married a few years later and then welcomed their second son, Andres.\nFor Armando, it’s the everyday moments — the bike rides to the park with their boys or the way she lay next to them reading bedtime stories night after night — that mean the most.\n“We were supposed to grow old together,” he said, his voice breaking with emotion. “Luis would always tell us to enjoy life because we don’t know how long we have together, but we didn’t think it would be this short.”\nLeticia Solis Guzman, who was among those killed in the violence, was a longtime sales executive at Unified Homes. In her profile picture on Facebook, Solis is standing next to Luis Tovar’s daughters in front of a giant Christmas tree in what appears to be the family’s living room. The top of Solis’ Facebook page reads in Spanish: “I’m a Leo, a warrior, cool, cheerful, I love dancing, I love my family and happiness.”\nPolice say suspect Aminadab Gaxiola Gonzalez had a “business and personal relationship” with the victims\nThe Solis family could not be reached for comment. Yolanda Torres, an acquaintance of Solis, said she hadn’t learned what happened to her until Friday.\n“Honestly, this was difficult to take in,” she said. “She was an excellent person that I had the luck of knowing. This was honestly difficult news, we’re living in such difficult times.”\nThe day of the shooting just happened to be one of the days that Matthew Farias, 9, accompanied his mom to work at Unified Homes instead of going to day care, his aunt Rosie Farias said Friday. Hoover Elementary School in Santa Ana, where Matthew was a third-grader, is doing distance learning because of the COVID-19 pandemic.\nFermin Leal, Santa Ana Unified School District’s chief communications officer, said in a statement that the district was “heartbroken by [the] senseless act of violence” that claimed Matthew’s life.\nThe victims of the Orange mass shooting were connected through a mobile home business where the violence occurred.\nMatthew’s death is like the loss of one of her own children, Rosie Farias said. She lives just two miles from Ralph Farias, her younger brother and Matthew’s father, in Santa Ana. Before the pandemic, their kids spent almost every other weekend together. Matthew cherished every moment he spent with his family, she said.\n“He sometimes didn’t want to leave, whether he was at my house, my husband, my sister, my brother. It didn’t matter, he just wanted to stay there longer. He just loved the family,” she said.\nAlthough the boy’s death has rocked their family, Rosie Farias says she’s mostly concerned about Ralph. Matthew was his only child. She said he seemed sad and lost — his eyes teary — but she didn’t think the reality had fully hit him. She suspects that will change once he goes to the coroner’s office.\n“I feel like that’s when it’s gonna all come down,” she said. “He’s going to be coming home — alone.”\nTimes librarian Cary Schneider contributed to this report."
    },
    {
      "url": "https://www.latimes.com/world-nation/story/2025-08-10/a-us-tourist-who-flew-to-puerto-rico-for-a-bad-bunny-concert-was-fatally-shot-police-say",
      "text": "Bad Bunny fan who visited Puerto Rico for concert is fatally shot, police say\n- Share via\nSAN JUAN, Puerto Rico — A Bad Bunny fan who was visiting Puerto Rico for the hip-hop star’s concert residency was fatally shot early Sunday in La Perla, a popular seaside shantytown in the capital, police said.\nThe victim was identified as Kevin Mares, a 25-year-old who lived in New York, according to a police statement.\nThe shooting happened in the predawn hours at a nightspot called Shelter for Mistreated Men in La Perla, a coastal community of San Juan that has struggled to shed its dark reputation.\nHomicide detective Sgt. Arnaldo Ruiz said in a phone interview that the shooting took place when several people near Mares began arguing and one pulled out a gun and shot at least three people, including Mares.\nA brother and a sister in their mid-40s who live in La Perla were injured and remain hospitalized.\nRuiz said Mares was an innocent bystander. He was with three other friends who told police they were in Puerto Rico for one of Bad Bunny’s 30 concerts, which have attracted tens of thousands of visitors to the U.S. territory, where the artist was born.\nMares was shot on the left side of his abdomen and was taken to Puerto Rico’s largest public hospital, where he died, authorities said.\nRuiz said police don’t yet know what the people were arguing about and don’t have a description of the shooter. “We have very little information,” he said.\nRuiz added that Mares’ three friends also were from New York. He didn’t know their hometowns.\nLa Perla is on the outskirts of Old San Juan, a historic district popular with tourists. A couple of hundred people live in the shantytown, which once served as Puerto Rico’s biggest distribution point for heroin and was known for its violence.\nPolice used to avoid the community, which used to have a sign proclaiming, “Not open to visitors. Do not enter.”\nBut violence eased when hundreds of federal agents raided the slum in 2011 and arrested dozens of people, including a well-known community leader who was later convicted.\nThe neighborhood became even safer and more welcoming after Puerto Rican singers Luis Fonsi and Daddy Yankee featured it in their hit “Despacito.”\nBut isolated violence persists.\nIn February 2023, three tourists were stabbed after police said a person told them to stop recording in the community.\nIn April last year, a 24-year-old tourist from Delaware was killed and his body set on fire, police said, after he and a friend were attacked after a drug purchase. Police said the victims were trying to take pictures of La Perla after being warned to not do so.\nThe island of 3.2 million people has reported 277 killings so far this year, compared with 325 killings in the same period last year.\nCoto writes for the Associated Press."
    },
    {
      "url": "https://www.latimes.com/delos",
      "text": "Keep Up\nJuly 9 marked the second anniversary of the launch of De Los, The Times’ vertical focusing on Latino culture and identity. It’s been quite the ride.\nTrump’s massive domestic policy bill ramps up mass deportations, at the expense of critical social benefits including Medicaid and SNAP.\nContrary to what’s being protrayed on cable news, Angelenos have proved to care deeply about their more vulnerable neighbors.\n˖ ݁𖥔 This Week 𖥔 ݁ ˖\nRemember This Banger\n-\nThirty years after the singer’s death, we look back on the song that encapsulated what could’ve been.\n-\n“Ahora Te Puedes Marchar” is Luis Miguel’s cover of Dusty Springfield’s “I Only Wanna Be With You,” Unlike the tender original, the track stings in its righteous resentment of a lover who let him down.\n-\nJuan Gabriel wrote the ‘80s pop ballad ‘Gracias a Dios.’ The track cemented Thalía’s Latin music star status — an innocent, sexy and cheeky coquette brand was born.\n-\nReleased on April 11, 2005, the hit song “La Tortura” marked Shakira’s glorious return to the Spanish-language music world.\nDon't Miss\n-\nAhead of her March 21 show at the Moroccan Lounge, Castillo talks new EP and London’s growing Latin scene.\n-\nThe Latin Grammy-nominated artist is using his Coachella set to critique AI automation in the arts\n-\nThe legendary band talks about the release of their latest single, ‘La Lotería,’ and playing at Folsom State Prison 50 years after Johnny Cash’s performance.\n-\nThe música Mexicana star’s psychedelic new album, “Leyenda,” features 19 innovative new songs\nBeyond Los Angeles\nLas Valentinas del Valle de Coachella are a group of middle and elementary schoolers who are taking on the sport of escaramuza — an essential component of Mexico’s national sport of charrería, or Mexican rodeo.\nFor over 180,000 Ecuadoreans in New York City, ecuavoley, a sport from their homeland, brings together identity, community and an opportunity for mutual aid.\nIn the Inland Empire, where local news has been severely diminished, Ahmed Bellozo’s “On the Tira” local news videos, inspired by Huell Howser, are resonating on social media."
    },
    {
      "url": "https://www.latimes.com/california/story/2020-01-22/los-angeles-police-stun-gun-death-settlement",
      "text": "City OKs $5.75-million settlement in death of Marine veteran stun-gunned by LAPD\n- Share via\nThe Los Angeles City Council on Wednesday unanimously approved a $5.75-million settlement with the parents of a Marine veteran who died after an LAPD officer stunned him six times with a Taser during a Christmas Eve altercation five years ago.\nMichael Frederick Mears, 39, went into cardiac arrest about an hour after he was detained on Dec. 24, 2014, and died two days later. A Los Angeles County coroner’s report determined Mears died from ventricular dysrhythmia because of an enlarged heart and noted that cocaine intoxication and police restraint by a Taser were contributing factors. His death was ruled a homicide by the coroner.\nA federal jury in November 2017 awarded Mears’ family $5.5 million after finding that officers used excessive and unreasonable force while seeking to restrain him.\n“It is very hard on the family members, all this time waiting for justice. The trial was ever so tough for them, but when the city appeals and drags it out for two years, it is particularly painful,” said Brian Dunn, one of the family’s attorneys.\nMears’ roommate called paramedics on Christmas Eve 2014 reporting that the military veteran was having a paranoid episode and complaining that someone was coming to get him. An LAPD sergeant and five officers responded to Mears’ South Los Angeles apartment and tried to physically restrain him before using pepper spray and batons, records show. During the confrontation, one of the officers — Jonathan Gan — discharged a Taser, striking Mears six times over the course of three minutes, according to court documents.\nLaw enforcement personnel can use Tasers in two ways: either by firing two electrified darts from several feet away, delivering a sharp shock that freezes a person’s muscles and temporarily incapacitates him, or in “drive-stun mode,” in which the device is pressed directly against a person’s skin and creates pain to gain compliance.\n“The death was ruled a homicide by the coroner because of the electronic restraint procedure,” Dunn said. “The officer with the Taser applied it for 32 seconds at one point.”\nThe time during which the stun gun was administered to Mears is more than twice the 15-second maximum recommended by the Police Executive Research Forum, which advises police departments across the country on policy.\nA year after Mears’ death, the Los Angeles Police Commission deemed the use of force in the encounter within department policy, but it did warrant a tactical debriefing.\nThe report described a violent struggle in which officers repeatedly tried to restrain Mears, who was described as weighing approximately 305 pounds and covered in blood, acting in a manner that made him unsafe to approach. Gan said he didn’t recall discharging the stun gun for such a long period of time and thought the weapon had an automatic turn-off after five seconds, according to the commission’s summary.\nAttorneys for the city declined to comment on the settlement Wednesday. During the jury trial, the city’s lawyers argued that Mears was responsible for his own death because of a rage fueled by cocaine and said officers were trying to stop him from harming himself and others.\nThe deadly encounter is still under review by the district attorney’s office, a spokesman said Wednesday.\nIn finding that officers used excessive and unreasonable force while restraining Mears, the jury said the Police Department had inadequate training when it came to less-lethal restraint methods.\nAn investigation by Reuters has examined records of more than 1,000 people who have died in the United States following encounters with police in which Tasers were used either on their own or, more often, as part of a larger use of force. According to the 2017 investigation, medical examiners cited the Taser as a cause or contributing factor in the death in at least 153 cases. A U.S. Department of Justice-funded study, however, found that 99.75% of field uses of stun guns resulted in no injuries.\nA Times investigation in 2016 found that of the 1,100 times an LAPD officer used his or her Taser, the weapon worked just 53% of the time.\nTimes staff writer Emily Alpert Reyes contributed to this report."
    },
    {
      "url": "https://www.latimes.com/delos/newsletter/2025-08-08/bad-bunny-puerto-rico-residency-local-artists-exhibition",
      "text": "Bad Bunny’s residency gives local artists the chance to tell Puerto Rico’s real history\n- Share via\nHello, this is De Los reporter Carlos De Loera. I will be taking over the Latinx Files for the next couple of months while Fidel is on parental leave. I hope I do him justice!\n“No me quiero ir de aquí.”\nIt’s more than just the name of Bad Bunny’s months-long Puerto Rico concert residency; it’s a radical declaration against colonialism and gentrification, as well as a defiant call for cultural preservation and celebration.\nThis week the U.S. federal government exercised another overreach of power over Puerto Rico, when the Trump administration dismissed five out of seven members of Puerto Rico’s federal control board that oversees the U.S. territory’s finances. All of the fired board members belonged to the Democratic Party; the remaining two members are Republicans.\nAs other parts of the Spanish-speaking world grapple with being priced out of their own communities, and a watering down of their long-standing cultures, artists in Puerto Rico are using their work to give visitors a not-so-gentle reminder: No one can kick them out of their own home.\nLast week, the Latinx advocacy group Mijente — alongside the art collective AgitArte — collaborated with local Puerto Rican artists and organizations to present a free art exhibition that highlights the everyday societal struggles of Boricuas. Located in the Santurce barrio of San Juan, the “De Aquí Nadie Nos Saca” exhibit is marketing itself as a spiritual companion piece to Bad Bunny’s album, “Debí Tirar Más Fotos,” by delving into the musical joy and ongoing resistance movements of the island.\nThe name of the exhibition itself is a play on the lyrics from Bad Bunny’s track “La Mudanza,” in which he sings, “De aquí nadie me saca” — “nobody can get me out of here.” But the space has more than just a thematic connection to the Grammy-winning artist.\nMembers of AgitArte and one of its affiliated community theater collectives, Papel Machete, contributed to the “La Mudanza” music video by providing a giant papier-mâché puppet named La Maestra Combativa. It can be seen in the last minute of the video, holding up a colorful sign that reads “De aquí nadie me saca.”\nThe momentum of Bad Bunny’s latest album and subsequent tour met Mijente’s mission at a serendipitous time that led to the creation of the new showcase.\n“The socio-cultural moment and the political moment needed different kinds of things, not just the normal playbook of social work,” said Mijente communications director Enrique Cárdenas Sifre. “We needed to experiment a little bit more.”\nAccording to Cárdenas Sifre, part of the hope for the exhibition is to combat a pervasive narrative that Latinx people are more conservative-leaning than they realize.\nBad Bunny’s sentiment of “todo el mundo quiere ser latino” — and the universal praise and online utilization of “Debí Tirar Más Fotos” — allowed for Mijente to reopen the conversation about the true values of Latinx people in Puerto Rico.\n“We can use the opportunity of a mainstream event to experiment with reoccupying and reutilizing all the cultural work for our causes,” he said. “For immigration causes, for liberation, decolonization, social, racial, gender equity and struggles ... especially in Puerto Rico. So all of that came together at the same time.”\nWith hundreds of thousands of tourists descending upon the island to watch the “Baile Inolvidable” singer perform, it seemed like the right time to challenge tourists to engage with some of the more difficult and harrowing experiences of Puerto Ricans.\n“No seas un turista más,” or “don’t be just another tourist,” is one of the main phrases used to advertise the exhibition, which asks people to confront colonialism, gender dynamics, environmental ruin, state violence and displacement.\n“If you only have a few moments to be in San Juan [for the tour], please come to the exposition and help us amplify, connect and support all the local organizations that are doing the work,” Cárdenas Sifre said. “No seas un turista más, conoce un poco de la historia real de Puerto Rico.”\nTelling the “real history” of the island are over 39 artists and organizations — with special help from AgitArte curator Dey Hernández — that make up “a piece” of the whole movement that Mijente is pushing for.\n“We always try to recognize that we need joy, we need perreo, we need our culture, we need our sazón, but at the same time, we keep fighting for the things that we want in our lives and in our future,” Cárdenas Sifre said. “We want to go a little bit deeper for tourists to understand that it’s generations of struggle. So you can come to the exposition and support by donating directly to an organization or artist that is presenting.”\nOpen from Wednesday through Sunday, the exhibition will continue showcasing its works through early October. After its opening weekend, organizers of the event are enthused by the intergenerational crowds and the litany of responses the art has elicited.\n“They see their fights, they see themselves in the exhibition,” Cárdenas Sifre said. “Some people have to go outside to cry for a minute, because there hadn’t been a place that hit on all these social battles and they recognize the years of work that went behind collecting it all. There’s also joy and celebration, it’s really run the gamut of every emotion.... Everyone tells us that this space was needed.”\nOne thing that Cárdenas Sifre wanted to make clear is that the exhibit is not affiliated with any electoral political alliance, but rather a “real new alliance of the folks doing the work on the ground every day.”\n“These organizations and artists don’t always have a space to come together to talk about the work that [they] are doing, talk about the struggles they are facing. [It’s about] generating a little space [to] conspire the next [steps for] the movement in Puerto Rico.”\nComic this Week: Drag, DACA, and Departure\nJulio Salgado is a visual artist based in Long Beach. His work has been displayed at the Oakland Museum, SFMOMA, and Smithsonian American Art Museum. (@juliosalgado83)\nStories we read this week that we think you should read\nUnless otherwise noted, all stories in this section are from the L.A. Times.\nImmigration and the border\n- Federal agents use Penske rental truck as ‘Trojan Horse’ to raid Los Angeles Home Depot\n- ICE arrests in L.A. plummeted in July, new data show\n- Trump officials are reopening old immigration cases, even for dead people. ‘They don’t do their homework,’ lawyers say\n- As immigration fears surge, LAUSD ‘compassion fund’ to support families amid return to school\n- Can the U.S. deport someone who’s lived here for 30 years without an immigration hearing?\n- Your guide for ICE in L.A.: Resources, explainers, legal rights and more\nPolitics\n- Powerful labor coalition backs redrawing California’s congressional map in fight with Texas and Trump\n- Will pro-Trump Latinos vote Republican in the 2026 midterms? A new poll casts doubts\n- Why Texas could face greater legal hurdles than California in redistricting fight\n- Millions of Californians may lose health coverage because of new Medicaid work requirements\nArts and Entertainment\n- Eddie Palmieri, a champion of Latin jazz, dies at 88\n- Mexican indie act Caloncho is performing at the Wiltern on Aug. 8\n- Tejano music legend Flaco Jiménez dies at 86\n- Cheech Marin to be honored by Hispanic Heritage Foundation for contributions to the arts\n- Fashion Faux Pas? Willy Chavarría’s Oaxaca-inspired huaraches stoke controversy\n- The ‘Hamilton’ musical movie is coming to theaters this September\n- August event series ‘Mexican Nights’ will bring traditional music and dance to the Ford\n- Bajo La Luna hopes music brings healing magic to L.A. on Aug. 31\nClimate\n- Living without documentation or a home in one of California’s hottest regions\n- L.A.’s fires reshaped the city. They may also have triggered changes in our bodies\n- Homeowners say the Army Corps and its contractors mishandled L.A. fire debris cleanup\nSoCal heat wave: When can you expect relief? Sadly, not anytime soon\nGripping Narrative\n- What a DNA test revealed about my long-lost abuela — and her secret life"
    },
    {
      "url": "https://abc7ny.com/post/kevin-mares-new-york-man-shot-killed-visiting-puerto-rico-bad-bunny-concert-police-say/17493503/",
      "text": "SAN JUAN, Puerto Rico (WABC) -- A mother and father in Queens are mourning the death of their 25-year-old son, who was shot and killed while he was visiting Puerto Rico during a trip to see Bad Bunny in concert.\nKevin Mares was fatally shot early Sunday morning at a nightspot in La Perla, an infamous settlement outside of Old San Juan's sea wall. Police say he was an innocent bystander.\nKevin shared video of a beautiful beach view and pool party at his hotel on Saturday night, but it was when he and some friends wandered off the resort grounds into La Perla that they were suddenly in danger.\n\"They were walking, and then across the street, it was like a bunch of bunch of people, arguing and they start fighting each other. So one of them, they took out a gun. So he starts shooting, like random,\" said his mother, Sandra Mares.\n\"And my son was across the street and he got shot in the abdomen,\" added his father, Hector Mares.\nKevin's parents are originally from Mexico but he was born and raised in Queens, with one younger brother.\nHe loved animals, like his dog, Jessie, and wanted to be a veterinarian. He was studying at LaGuardia Community College.\n\"He got a lot of dreams. He was working as a vet technician. And at the same time he was studying,\" added his father.\nHe had been dating his girlfriend for several years.\n\"He was about to propose to her, this fall. Yeah. He wants to do something special. He shared that with us,\" said his mother.\nHis girlfriend was in Puerto Rico with him, but stayed at the hotel after the party while he and her brother and a friend ventured out -- something his parents say they'd warned him not to do.\n\"We told him just stay in the hotel and that's in the resort,\" his father said.\n\"But they're young. When you're young, sometimes you don't think,\" added his mother.\nOn Sunday night the Mares family got support from loved ones, surrounded with photos of happy memories.\n\"He was a lovely son. He cared. He cared about all of us, his family, friends. He has a lot of friends who's really going to miss him, too,\" said his mother.\nThe Mares family is hoping for an arrest in the shooting that detectives told them also wounded a man and woman in their 40s.\nThey desperately want his body returned home to Queens as quickly as possible. Right now it's being held in Puerto Rico in the ongoing investigation.\n----------\n* Get Eyewitness News Delivered\n* Download the abc7NY app for breaking news alerts\nHave a breaking news tip or an idea for a story we should cover? Send it to Eyewitness News using the form below. If attaching a video or photo, terms of use apply."
    },
    {
      "url": "https://www.cbsnews.com/newyork/news/kevin-mares-killed-puerto-rico-shooting-queens-nyc/",
      "text": "Queens family wants justice after son killed in stray bullet shooting in Puerto Rico\nA New York City family is mourning the death of a beloved son and brother who was shot and killed in La Perla, Puerto Rico over the weekend.\nKevin Mares, 25, of Queens, was visiting the island with his girlfriend and two friends to attend a Bad Bunny concert.\nNo arrests in deadly Puerto Rico nightclub shooting\nMares' family says after the concert Saturday night, he and the group had an evening of activities that led them to venture outside of their resort in Old San Juan to a nightclub in La Perla, a coastal community with a history of crime.\n\"Across the street, there was a bunch of people, and then they started arguing, something, and some guy, he had a gun, took it out and start shooting,\" father Hector Mares said.\nAccording to local police, three people were shot, including Kevin Mares, who investigators say was an innocent bystander. He suffered a gunshot wound to the stomach and was transported to a local hospital, where he later died.\nPolice say the other two victims, both La Perla residents, remain hospitalized.\nAs of now, no arrests have been made.\nMayor Eric Adams said in a statement on social media he was heartbroken to learn that Mares' life was \"tragically ripped away due to gun violence in Puerto Rico\" and his \"condolences and prayers are with all of Kevin's loved ones grieving this unimaginable loss.\"\nQueens man had been looking forward to vacation for months, family says\nMares' parents received the devastating news in a call from his girlfriend early Sunday morning.\n\"I said, 'What happened?' She said, 'I'm sorry. We lost him,'\" Hector Mares said.\n\"Whoever did this, I mean, it's like he took from us a piece of us, you know?\" mother Sandra Mares said.\nMares was born and raised in Queens, and lived with his parents and his 15-year-old brother in East Elmhurst. He was studying to be a veterinarian, and his parents say when he wasn't studying, he was working two part-time jobs. He loved to cook and sing karaoke.\nMares' family says he was a big fan of Bad Bunny, and that he, his girlfriend and his friends had been looking forward to their trip to Puerto Rico for months.\n\"Every time Bad Bunny comes here, they go to most all of his concerts,\" Sandra Mares said.\nWith the gunman still at large, Mares' parents are asking anybody with information about the shooting to come forward.\n\"We want justice,\" Sandra Mares said.\nThe family is working with local authorities in Puerto Rico to bring Mares' body home to Queens so they can begin making funeral arrangements."
    },
    {
      "url": "https://www.latimes.com/california/story/2021-07-28/authorities-seek-killer-of-army-veteran-in-lancaster",
      "text": "After Army veteran is gunned down at party, authorities offer reward to find suspect\n- Share via\nDetectives from the Los Angeles County Sheriff’s Department are searching for a man suspected of shooting to death a U.S. Army veteran at a birthday party in December.\nThe night of Dec. 19, 2020, Ismael Zabala, 26, went to his aunt’s home in the 400 block of West Avenue J 12 in Lancaster to celebrate his cousin’s birthday.\nThe 26-year-old — the second of eight children — was accompanied by several of his brothers. He’d been looking forward to the party and bought a new shirt to wear, his father, Alex Zabala, said Tuesday.\n“He couldn’t wait for that day. He was inviting everyone he could.”\nOne of the guests Zabala had invited, a young woman, showed up with two men he didn’t know, his father said.\nAt some point that night, the two men were asked to leave the party, authorities said. Around 2 a.m., they got into an argument with their hosts on the doorstep that escalated into a physical struggle, according to Sheriff’s Lt. Derrick Alfred. Zabala intervened and was punched by one of the men, Alfred said.\nBoth of the party guests drew handguns, and one of the men — identified by sheriff’s officials as Oscar Palazuelos, 20 — fired a single shot into Zabala’s chest, Alfred said. His younger brother was shot in the thumb, according to Alex Zabala. The two armed men then fled.\nAlfred declined to name the man authorities said accompanied Palazuelos to the party, but sheriff’s officials identified him in a motion submitted to the Los Angeles County Board of Supervisors as Ervin Alvarez. Alvarez, 22, was arrested in February, pleaded no contest to one count of attempted murder and was sentenced in April to 19 years in state prison, according to court records.\nAs for Palazuelos, “the trail’s kind of run cold,” Alfred said Tuesday. He was known to stay in the Antelope Valley, but he also frequented the Highland Park area, where he boasted of being affiliated with a local gang, the lieutenant said. Palazuelos may have recently returned to the Antelope Valley, authorities said.\nThe Sheriff’s Department has offered a $20,000 reward, funded by the Board of Supervisors and the city of Lancaster, for information leading to Palazuelos’ arrest.\nAlex Zabala called it a sad but undeniable truth that a reward might close his son’s case.\n“Unfortunately, the way society is, money moves people,” he said.\nThe elder Zabala said he had tried to shield his children from the violence and gangs that encircled their onetime home in South Los Angeles. They moved, beginning when Ismael Zabala was young, to El Monte, West Covina, Victorville, Barstow and, eventually, Lancaster, where Ismael played football at nearby Littlerock High School.\nHe was known for his “big old Kool-Aid smile,” his father said. “Everyone who knew him, they’d tell you the same thing.”\nAfter falling behind on credits at Littlerock High, Zabala graduated from a charter school in the Lancaster area and worked various jobs at warehouses and a Family Dollar store before announcing in 2016 that he’d enlisted in the Army. He told his parents there was nothing they could do to change his mind, his father recalled.\nZabala went to boot camp in Georgia, then was stationed in Mississippi and eventually Texas, where he was training to work as a driver, his father said. But one day, after getting hurt in a training accident, Zabala was evaluated by a doctor and found to be medically unfit to continue serving in the military. He was honorably discharged in March 2020, his father said.\nDisappointed that his career had been cut short unexpectedly, Zabala returned to his family’s home in the Lancaster area.\nThe night he died, his younger brother stirred their father awake, saying Ismael had been shot. Alex Zabala got to his sister-in-law’s house in time to see paramedics trying to revive his son in the back of an ambulance. He was pronounced dead at a hospital an hour later.\nKnowing the man suspected of firing the fatal shot remains at large is like “having this wound and we can’t let it heal,” the elder Zabala said. “It’s like putting salt on it every day.”\nEspecially difficult was Christmas, five days after the young man’s death. “This guy, he’s out there, probably opening gifts with his family,” Zabala’s father said. “And we’re trying to find a funeral home.”\nThe Sheriff’s Department is asking anyone with information about Palazuelos’ whereabouts to call detectives at (323) 890-5500."
    },
    {
      "url": "https://www.latimes.com/delos/story/2025-08-07/eddie-palmieri-latin-jazz-innovator-pianist-dies-at-88",
      "text": "- Share via\nEddie Palmieri, the Grammy-winning Nuyorican pianist, bandleader and composer who helped innovate Afro-Caribbean music in the States and transform the New York salsa scene, died on Wednesday. He was 88.\nAccording to a post on his official Instagram, Palmieri passed away in his Hackensack, N.J., home. The New York Times confirmed via his youngest daughter, Gabriela Palmieri, that his death came after “an extended illness.”\nMultiple celebrities chimed in to pay their respects, including Spike Lee, Ramon Rodriguez and representatives from Fania Records, the pioneering New York salsa label, also released a statement.\n“[On Wednesday], Fania Records mourns the loss of the legendary Eddie Palmieri, one of the most innovative and unique artists in music history,” the statement said. Palmieri briefly recorded music with the label but also released music under Tico, Alegre, Concord Picante, RMM and Coco Records.\nOthers took to social media to mourn the loss, including David Sanchez, a Grammy-winning jazz tenor saxophonist from Puerto Rico, who uploaded a slideshow of photographs of the two. Sanchez recounted the time when his soprano saxophone was stolen — and Palmieri helped him pay for a new one. “Your being and your music will continue to live on in the hearts of many,” Sanchez wrote in the Instagram caption.\nPalmieri’s contemporary Chuchito Valdes, a Grammy-winning Cuban pianist and bandleader, also chimed in with an Instagram post lamenting the loss: “A sad day for music. One of the greatest of all time is gone, an innovator. The man who revolutionized salsa and Latin jazz. My great friend.”\nBorn on Dec. 15, 1936, in East Harlem to Puerto Rican parents from Ponce, Palmieri was the younger brother of Charlie Palmieri, the late piano legend known as the “Giant of the Keyboards.”\nThe family later moved to the South Bronx, where they opened up a luncheonette called “Mambo”: a name chosen by young Eddie, who was enthralled by the Cuban dance hall rhythms. He often controlled the jukebox with blissful Latin jazz tunes by Tito Puente, Tito Rodriguez and Machito.\nPalmieri was deeply influenced and inspired by his older brother, who was nine years his senior and introduced him to prominent big-band acts of the 1940s, like Tommy Dorsey, Glenn Miller and Woody Herman, all of whom seemed to dissolve by the end of World War II. Though Palmieri had an itch to lean into the timbales like Tito Puente, he would eventually follow in his brother’s footsteps and take piano lessons from Margaret Bonds, one of the most prominent African American concert pianists at the time.\nAlthough he briefly joined his uncle’s orchestra, Chino y sus Almas Tropicales, as a timbal player, Palmieri rose to fame as a pianist, playing with various bands including the Eddie Forrester Orchestra, Johnny Segui and His Orchestra, and eventually Tito Rodriguez and His Orchestra, which was a main act at the Palladium Ballroom between 1958 to 1960.\n“In the audience, you could have maybe a Marlon Brando, Kim Novak, all the Hollywood starlets because it was the height of the mambo,” said Palmieri in a 2013 interview with Jo Reed. “On Saturday, you had the blue-collar, mostly Puerto Rican. And then Sunday was black, Afro-American. It was intermingled or different nationalities that had nothing to do whether you were green, purple, white, we came to dance.”\nBut in 1961, Palmieri went on to start his own band, La Perfecta, an ironic title given its not-so-perfect setup. It formed as an eight-piece Cuban conjunto, which ditched the traditional jazzy saxophone. There were timbales, congas, bongos, bass, piano and vocals — but with a twist of its own kind: the inclusion of two trombones, played by Barry Rogers and Jose Rodriguez, instead of the costly four-set trumpets. Palmieri also added a whistling flute, played by George Castro, for a charanga edge (in the place of a traditional violin).\n“La Perfecta changed everything in the history of our genre, in my opinion. Certainly in New York,” said Palmieri. “And then influenced the world, because after that all the pawn shops got rid of their trombones.”\nHis group helped usher in the iconic salsa genre with their first album, “Eddie Palmieri and His Conjunto ‘La Perfecta,’” dubbing him the nickname “Madman of salsa.” However, he was not too fond of the emerging term, which seemed to cram different styles like mambo, charanga, rumba, guaracha and danzón into one single category.\n“Afro-Cuban is where we get the music,” explained Palmieri in a 2012 interview with the Smithsonian Oral History Project. “The influence of the Puerto Rican is the one [that] upheld the rhythmical patterns and the genre of Cuba. So then that becomes Afro-Caribbean.”\nLa Perfecta went on to release its most famed album, “Azúcar Pa’ Ti” in 1965. It included the song “Azúcar,” an eight-minute track that was later added to the National Recording Registry in 2009.\nIn 1976, Palmieri became the first to win a Grammy for the inaugural category of best Latin recording, for his album “Sun of Latin Music.” He holds a total of eight Grammy awards. In 2013, the National Endowment for the Arts honored him as a Jazz Master and the Latin Grammys granted him a Lifetime Achievement Award.\nBut Eddie Palmieri’s impact spanned beyond his own accomplishments. He was a mentor, a teacher and an advocate for Latin music and culture, which includes advocating twice for the inclusion of the Latin jazz album category in the Grammys — first in 1995, then again in 2012 after its removal.\nPalmieri was predeceased by his wife of 58 years, Iraida Palmieri, who passed away in 2014 — and who he often referred to as “Mi Luz Mayor.” He is survived by his four daughters, Renee, Eydie, Ileana and Gabriela; his son, Edward Palmieri II; and four grandchildren."
    }
  ],
  "argos_summary": "Kevin Mares, a 25-year-old from New York City, was fatally shot in San Juan, Puerto Rico, while visiting for a Bad Bunny concert. The incident occurred outside a nightclub during an argument that escalated into gunfire, with Mares being an innocent bystander. His family is devastated and seeking justice, as no arrests have been made, and they are working to bring his body back to New York for funeral arrangements.",
  "argos_id": "IUKAW829N"
}