{
  "url": "https://www.geekwire.com/2025/nasa-trip-redmond-artemis-aerojet-l3harris/",
  "authorsByline": "Alan Boyle",
  "articleId": "d1d1967865734f79a6255e7812249225",
  "source": {
    "domain": "geekwire.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "WA",
      "county": "King County",
      "city": "Seattle",
      "coordinates": {
        "lat": 47.6038321,
        "lon": -122.3300624
      }
    }
  },
  "imageUrl": "https://cdn.geekwire.com/wp-content/uploads/2025/08/250811-hoburg.jpeg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T02:54:09+00:00",
  "addDate": "2025-08-12T03:01:40.253814+00:00",
  "refreshDate": "2025-08-12T03:01:40.253815+00:00",
  "score": 1.0,
  "title": "NASA takes a trip to Seattle area to thank suppliers for work on the next moonshot",
  "description": "The first crewed flight around the moon since Apollo is still months away, but NASA is already thanking its suppliers for the trip.",
  "content": "REDMOND, Wash. — The first crewed flight around the moon in more than 50 years is still months away, but NASA is already saying thank you to L3Harris Technologies’ Aerojet Rocketdyne segment and other suppliers who are making the trip possible.\n\nToday, NASA’s road trip brought agency officials — plus astronaut Woody Hoburg — to the L3Harris facility in Redmond, which has contributed propulsion systems to NASA missions ranging from space shuttle flights to the Voyager probes’ journeys to the edge of the solar system.\n\nNow NASA is getting ready to launch four astronauts on a round-the-moon mission known as Artemis 2, powered in part by hardware built in Redmond. Hoburg, who spent six months on the International Space Station in 2023 and is awaiting his next crew assignment, told an audience of about 200 L3Harris employees and VIPs that the Artemis 2 crew is well aware of the company’s contribution.\n\n“They’re depending on you, and they know they can count on you,” he said. “Thank you for all the hard work you’re doing to make this amazing adventure possible.”\n\nThe Artemis 2 mission is currently targeted for launch in April, or perhaps even earlier, said Howard Hu, NASA’s program manager for the Orion crew vehicle. The mission after that, Artemis 3, is due to lift off no earlier than mid-2027 with the goal of landing astronauts on the lunar surface for the first time since Apollo 17 in 1972.\n\nL3Harris’ Aerojet Redmond team delivered the hardware for those two Artemis missions — including auxiliary engines for Orion’s European-built service module — years ago. Now the team is working on thrusters for missions as far out as Artemis 8, which is scheduled to go the moon no earlier than 2033.\n\nWith the advent of the Trump administration and new management at NASA, the long-term plan for crewed moon missions has been in flux.\n\nThe White House initially sought to cancel the Space Launch System and Orion programs after Artemis 3, and instead focus on a commercial alternative for Mars missions, such as SpaceX’s Starship launch system. But Congress voted to stay the course — and Don Mahr, director of program management at L3Harris’ Redmond facility, told GeekWire that NASA has told its suppliers to continue executing the current plan, at least for now.\n\nAmit Kshatriya, NASA’s deputy associate administrator for the Moon to Mars Program, said propulsion systems from L3Harris will continue to be essential components in NASA’s toolbox even if the long-term plan for Artemis changes.\n\n“It’s the wrong argument to think about picking one thing or another,” he said. “The right argument is, how do we stimulate and create missions and capability across the country in all sorts of different capability classes.”\n\nKshatriya said that NASA’s needs are almost certain to change “five years from now, 10 years from now, 15 years from now,” and that L3Harris has demonstrated it’ll be able to keep up.\n\n“A shop like this is the DNA that we need to keep going, which is why we’re so excited to be here,” he said.\n\nHoburg is excited as well. “We’re using the moon as a proving ground to figure out how to get to Mars, so it’s a really exciting time,” he said. “And the Artemis 2 crew that’s embarking on this mission, they’re the pathfinders that are starting a sequence of missions. … It’s going to be the next step in space.”\n\nDoes Hoburg want to go to the moon? His answer was diplomatic. “I want the United States of America to go to the moon,” he told GeekWire. “It is time to do it. I would love to get to fly one of those missions myself, but I’m proud of our country that we’re leading and executing these missions.”\n\nDuring today’s thank-you gathering in Redmond, four L3Harris Aerojet employees received awards from NASA for their contributions to the Artemis program. Brett Mendenhall and Richard Mirabella were given NASA’s Silver Snoopy Award, which must be pinned onto the winner’s lapel by an astronaut. “That was the part where I try not to draw any blood,” Hoburg quipped.\n\nCamille Samonte received the NASA Space Flight Awareness Trailblazer Award, and Cory Houck won the SFA Management Award.",
  "medium": "Article",
  "links": [
    "https://en.wikipedia.org/wiki/Silver_Snoopy_award",
    "https://www.nasa.gov/people/amit-kshatriya/",
    "https://www.linkedin.com/in/cory-houck-699ab712/",
    "https://www.l3harris.com/company/powering-defense-and-space-exploration",
    "https://www.geekwire.com/2023/aerojet-rocketdyne-orion-thrusters/",
    "https://www.redmond-reporter.com/news/redmonds-aerojet-receives-prestigious-space-flight-awareness-supplier-award/",
    "http://www.astronautix.com/m/mr-104.html",
    "https://www.astronomy.com/space-exploration/trumps-one-big-beautiful-bill-sets-the-stage-for-nasas-return-to-the-moon/",
    "https://www.nasa.gov/people/warren-hoburg/",
    "https://www.linkedin.com/in/brett-mendenhall-8480621/",
    "https://www.linkedin.com/in/richard-mirabella-06642219/",
    "https://www.linkedin.com/in/donald-mahr-b198952/",
    "https://www.linkedin.com/in/camillesamonte/",
    "https://www.nasa.gov/space-flight-awareness/trailblazer-award/",
    "https://www.nasa.gov/space-flight-awareness/management-award/",
    "https://www.nasa.gov/mission/artemis-ii/",
    "https://www.reuters.com/business/aerospace-defense/nasa-rocket-lunar-station-many-science-programs-face-cuts-trump-2026-budget-2025-05-02/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "NASA missions",
      "weight": 0.11690988
    },
    {
      "name": "crewed moon missions",
      "weight": 0.093567155
    },
    {
      "name": "Mars missions",
      "weight": 0.09150943
    },
    {
      "name": "NASA",
      "weight": 0.09050801
    },
    {
      "name": "missions",
      "weight": 0.08476267
    },
    {
      "name": "L3Harris Aerojet",
      "weight": 0.07431519
    },
    {
      "name": "Artemis",
      "weight": 0.07153606
    },
    {
      "name": "L3Harris",
      "weight": 0.06698965
    },
    {
      "name": "astronaut Woody Hoburg",
      "weight": 0.0651326
    },
    {
      "name": "the NASA Space Flight Awareness Trailblazer Award",
      "weight": 0.06133399
    }
  ],
  "topics": [
    {
      "name": "NASA"
    },
    {
      "name": "Space"
    }
  ],
  "categories": [
    {
      "name": "Science"
    },
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Other",
      "score": 0.83251953125
    },
    {
      "name": "/Business & Industrial/Aerospace & Defense/Space Technology",
      "score": 0.81982421875
    },
    {
      "name": "/Science/Astronomy",
      "score": 0.74658203125
    },
    {
      "name": "/News/Technology News",
      "score": 0.51513671875
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.349609375
    }
  ],
  "sentiment": {
    "positive": 0.23080885,
    "negative": 0.2564938,
    "neutral": 0.51269734
  },
  "summary": "NASA has taken a trip to the Seattle area to thank suppliers for their work on the next moonshot, Artemis 2, the first crewed flight around the moon in over 50 years. The trip included representatives from L3Harris Technologies’ Aerojet Rocketdyne segment and other suppliers. The company has contributed propulsion systems to NASA missions such as space shuttle flights and Voyager probes. The Artemis 2 mission is currently scheduled for launch in April or perhaps even earlier, with the mission after that, Artemis 3, set to lift off no earlier than mid-2027. Despite the changes in NASA's long-term plan for crewed moon missions, the company has told its suppliers to continue executing the current plan.",
  "shortSummary": "Nasa officials praised L3Harris Technologies’s contributions to the Artemis 2 and Artemis 3 moon missions, emphasizing the importance of maintaining momentum for future lunar missions.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "0224493d2b2345978e303aecf6a0c59a",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.nasa.gov/space-flight-awareness/management-award/",
      "text": "Management Award\nThis award is intended for recognition of mid-level managers who consistently demonstrate loyalty, empowerment, accountability, excellence, respect, sharing, honesty, and integrity, and are proactive.\nCRITERIA\nThe SFA Management Award recognizes outstanding leaders who exemplify the following characteristics necessary for flight safety and mission success;\n- Loyalty – Demonstrates consistence, fairness, trust, and truthfulness in interpersonal relationships\n- Empowerment – Provides the tools, authority, and trust which allow employees to do their job and fully employ their individual talents, creativity, and initiative\n- Accountability – Sets continuous improvement goals and measure performance against them.\n- Excellence – Performs in a superior manner. Continually looks for innovative ways to improve operations and produce outstanding results\n- Respect – Displays professional esteem and courtesy to all employees, no matter how difficult the circumstances.\n- Sharing – Actively shares responsibility, authority, effort, enthusiasm, information, vision, talent, and credit\n- Honesty – Maintains a fair, straightforward, honorable and open environment\n- Integrity- Sets the example by always dealing ethically in all business relationships and by maintaining the highest personal standards\n- Proactive – Always takes prompt, decisive action to avoid or resolve problems. Pursues opportunities and actively seeks innovative technology and methods to enhance program objectives\nEligibility and Nomination Process\nTo be eligible to receive the SFA Management award, the candidate must meet the criteria specified above and;\n- Function in a mid-level management position or higher\n- Not have previously received this award\nDownload Criteria: sfa-management-criteria-recognition.docx\nDownload SFA Awards Nomination Form: sfa_awards_nomination_form.pdf\nRECOGNITION\nThe award consists of:\n(1) Congratulatory letter from NASA senior management and, for SFA Contractor employees, from the SFA Contractor senior management; and\n(2) A special commemorative current spaceflight item"
    },
    {
      "url": "https://www.nasa.gov/mission/artemis-ii/",
      "text": "Artemis II\nFour astronauts will venture around the Moon on Artemis II, the first crewed mission on NASA's path to establishing a long-term presence at the Moon for science and exploration through Artemis. The 10-day flight will test NASA's foundational human deep space exploration capabilities, the SLS rocket, Orion spacecraft, for the first time with astronauts.\nMission Overview\nArtemis II\nFirst Artemis Flight With Crew Important Step on Long-term Return to the Moon, Missions to Mars\nAstronauts on their first flight aboard NASA’s Space Launch System (SLS) rocket and Orion spacecraft will venture around the Moon. Their mission will be to confirm all of the spacecraft’s systems operate as designed with crew aboard in the actual environment of deep space.\nLearn More about Artemis IIThe Crew\nThe commander, the pilot, and the mission specialists heading to the Moon on Artemis II.\nLearn More about The CrewThe Spaceport\nThe systems and facilities that assemble and launch rockets and spacecraft for NASA’s Artemis missions.\nLearn More about The SpaceportThe Launch: SLS Rocket\nThe Artemis II mission will launch the crew of four astronauts from NASA’s Kennedy Space Center in Florida on Block 1 configuration of the Space Launch System (SLS) rocket.\nLearn More about The Launch: SLS RocketThe Ride: Orion\nDuring the Artemis II mission, the crew will assess the performance of the life support systems necessary to generate breathable air and remove the carbon dioxide and water vapor produced when the astronauts breathe, talk, or exercise. The crew will also test the systems during exercise periods, where the crew’s metabolic rate is the highest, and a sleep period, where the crew’s metabolic rate is the lowest.\nLearn More about The Ride: Orion"
    },
    {
      "url": "https://www.nasa.gov/people/warren-hoburg/",
      "text": "Warren Hoburg\nNASA Astronaut\nFollow Warren\nSummary\nWarren “Woody” Hoburg was selected by NASA to join the 2017 Astronaut Candidate Class. He reported for duty in August 2017 and having completed the initial astronaut candidate training became eligible for a mission assignment. The Pennsylvania native earned a bachelor’s degree in Aeronautics and Astronautics from the Massachusetts Institute of Technology (MIT) and a Doctorate in Electrical Engineering and Computer Science from the University of California, Berkeley. He was assistant professor at MIT at the time of his selection. He is an instrument-rated commercial pilot in single-engine and multi-engine airplanes. Hoburg launched to the International Space Station as Pilot of NASA’s SpaceX Crew-6 mission aboard a SpaceX Crew Dragon spacecraft on March 2, 2023, and splashed down safely off the coast of Jacksonville, Florida on September 4, 2023. Woody Hoburg has logged a total of 186 days in space on his first flight. Hoburg conducted two EVAs in his career for a total of 11 hours, 38 minutes.\nPersonal\nHoburg was born and raised in Pittsburgh, Pennsylvania. He is an avid rock climber, pilot, and engineer.\nEducation\nGraduated from North Allegheny High School in Wexford, Pennsylvania. Earned a bachelor’s degree in Aeronautics and Astronautics from MIT. Earned a Doctorate in Electrical Engineering and Computer Science from UC Berkeley.\nExperience\nAt the time of his selection in June 2017, Hoburg was an assistant professor of Aeronautics and Astronautics at MIT, where he taught undergraduate courses on Dynamics and Flight Vehicle Engineering. Hoburg’s research focused on efficient methods for designing Aerospace vehicles. His group produced the open-source software tool GPkit, which is a Python package for geometric programming. His group’s tools were used to design a five-day endurance UAV for the US Air Force. Prior to MIT, he worked for Boeing Commercial Airplanes Product Development on software for composite manufacturing processes. From 2010-2013, he was a seasonal member of Yosemite Search and Rescue and an Operations Leader for the Bay Area Mountain Rescue Unit.\nNASA Experience\nHoburg reported for duty in August 2017 and completed two years of training as an Astronaut Candidate. From October 2020 to April 2021, he served as Increment Lead for ISS Expedition 64. Hoburg launched to the International Space Station as Pilot of NASA’s SpaceX Crew-6 mission aboard a SpaceX Crew Dragon spacecraft on March 2, 2023, and splashed down safely off the coast of Jacksonville, Florida on September 4, 2023. Woody Hoburg has logged a total of 186 days in space on his first flight. Hoburg conducted two EVAs in his career for a total of 11 hours, 38 minutes. In 2024, he served on NASA’s Independent Review Team of the Orion heatshield.\nAwards/Honors\nHe is a two-time recipient of the AIAA Aeronautics and Astronautics Teaching Award in recognition of outstanding teaching at MIT. From 2009-2013, he was a National Science Foundation graduate research fellow. Class of 2020 AIAA Associate Fellow."
    },
    {
      "url": "https://en.wikipedia.org/wiki/Silver_Snoopy_award",
      "text": "Silver Snoopy award\n| Silver Snoopy Award | |\n|---|---|\n| Awarded for | Outstanding achievements related to human flight safety or mission success. Presented personally by astronauts as their own recognition of excellence. |\n| Country | United States |\n| Presented by | NASA Astronauts |\n| First award | 1968 |\n| Website | Official website |\nThe Silver Snoopy award is a special honor awarded to NASA employees and contractors for outstanding achievements related to human flight safety or mission success.[1][2] The award certificate states that it is \"In Appreciation\" \"For professionalism, dedication and outstanding support that greatly enhanced space flight safety and mission success.\"[3] The award depicts Snoopy, a character from the Peanuts comic strip created by Charles M. Schulz.\nThe award is given personally by NASA astronauts as it represents the astronauts' own recognition of excellence.[1] It is presented at the workplace of the recipient with the recipient's coworkers present. The Silver Snoopy award is one of several awards overseen by the Space Flight Awareness (SFA) program at NASA.\nThe award consists of a sterling silver \"Silver Snoopy\" lapel pin flown during a NASA mission, a commendation letter (stating the mission the Silver Snoopy pin was flown on) and a signed, framed Silver Snoopy certificate. Snoopy decals and posters are also given to the recipient.\nHistory\n[edit]After the completion of the Mercury and Gemini projects, NASA wanted a way to promote greater awareness among its employees and contractors of the impact they had on flight safety, the flight crews and their missions.[4] NASA wanted to use a symbol for spaceflight that would be well known and accepted by the public, similar to the recognition received by the United States Forest Service's Smokey Bear.\nThe idea for the Silver Snoopy award came from Al Chop, who was director of the public affairs office for the Manned Spacecraft Center (now called the Lyndon B. Johnson Space Center). He wanted to create an award featuring Snoopy as an astronaut to be given by astronauts in recognition of outstanding contributions by employees.[5]\nCharles M. Schulz, who was an avid supporter of the U.S. space program, welcomed the idea of using Snoopy for the award. Schulz and United Feature Syndicate (the distributor of the Peanuts comic strip) agreed to let NASA use \"Snoopy the Astronaut\" at no cost.[4] Schulz himself drew the image the award pin was based on. He also drew promotional art for posters to promote the award program.[5]\nRequirements\n[edit]Employees of NASA or one of its contractors can be considered for a Silver Snoopy award if they have satisfied one or more of the following criteria:[1]\n- Significantly contributed beyond their normal work requirements to the development and implementation of human spaceflight programs while ensuring quality and safety.\n- Accomplished single specific achievements that have had significant impact on attainment of a particular human spaceflight program goal while ensuring quality and safety.\n- Contributed to a major cost saving or a series of lesser cost savings pertaining directly to human spaceflight programs.\n- Has been instrumental in developing modifications to human spaceflight mission hardware, software, or materials that increase reliability, efficiency, or performance.\n- Assisted in operational improvements that increase efficiency or performance.\n- Has been a key player in developing a beneficial process improvement of significant magnitude.\n- Contributed significantly beyond fundamental task accountabilities in support of the NASA programs.\n- Sustained quality performance over an extended period of time in support of human spaceflight programs.\nRecipients\n[edit]Since 1968, the program has awarded almost fifteen thousand people with a Silver Snoopy, as of January 2016[update].[6][7]\nSilver Snoopy awards are limited to no more than 1% of eligible recipients. An individual can only receive one Silver Snoopy Award in their lifetime. However, Michael Arrington, a journalist at the Marshall Space Flight Center, received two. The award is not given posthumously or as a recognition award for an individual's longevity, retirement, or separation from service. In the event that a pin is lost, it may be replaced with a non-flown pin at the SFA Panel's discretion. It is a high honor within NASA.[1]\nReferences\n[edit]- ^ a b c d \"Silver Snoopy Award\". Goddard Space Flight Center. NASA. Archived from the original on June 8, 2008.\n- ^ \"Silver Snoopy award application\" (PDF). Goddard Space Flight Center.\n- ^ \"A Silver Snoopy award given to NASA employee Matthew Benson\". Archived from the original on July 14, 2011.\n- ^ a b \"Silver Snoopy Award presented to Rodolfo Gonzalez\". MAES National Magazine – Minority Americans in Engineering and Science. Archived from the original on October 6, 2008.\n- ^ a b Marshall, Thom (January 7, 2000). \"No retirement for Snoopy at NASA\". Houston Chronicle – via collectSPACE.\n- ^ \"Silver Snoopy award recipients\". Archived from the original on July 21, 2011.\n- ^ \"Space Flight Awareness awards database\". NASA. Archived from the original on August 12, 2014. Retrieved April 24, 2013."
    },
    {
      "url": "https://www.nasa.gov/people/amit-kshatriya/",
      "text": "Amit Kshatriya\nDeputy Associate Administrator, Moon to Mars Program\nAmit Kshatriya is the deputy associate administrator for the Moon to Mars Program in the Exploration Systems Development Mission Directorate (ESDMD) at NASA Headquarters. In this role, Kshatriya is responsible for program planning and implementation for human missions to the Moon and Mars. He directs and leads the programs to ensure Artemis and Mars planning, development, and operations are consistent with ESDMD requirements, and serves as the single point of focus for risk management. Previously, Kshatriya served as the acting deputy associate administrator for the Common Exploration Systems Development Division. In this role, Mr. Kshatriya directed and provided leadership and integration for the Space Launch System, Orion, and Exploration Ground Systems programs, as well as associated Artemis Campaign Development Division initiatives linking the agency’s Moon to Mars objectives.\nKshatriya began his career in the space program in 2003, working as a software engineer, robotics engineer, and spacecraft operator primarily focused on the robotic assembly of the International Space Station. From 2014 to 2017, he served as a space station flight director, where he led global teams in the operations and execution of the space station during all phases of flight. From 2017 to 2021, he became deputy, and then acting manager, of the ISS Vehicle Office, where he was responsible for sustaining engineering, logistics, and hardware program management. In 2021, he was assigned to NASA Headquarters in the Exploration Systems Development Mission Directorate as an assistant deputy associate administrator, where he was an integral part of the team that returned a spacecraft designed to carry humans to the Moon during the Artemis I mission.\nKshatriya holds a Bachelor of Science in Mathematics from the California Institute of Technology in Pasadena, California, and a Master of Arts in Mathematics from The University of Texas at Austin. He was born in Brookfield, Wisconsin, but considers Katy, Texas, to be his hometown. He and his wife are the proud parents of three children, and he is also the proud son of first-generation Indian immigrants to the United States.\nHe has been decorated with the NASA Outstanding Leadership Medal for actions as the lead flight director for the 50th expedition to the space station, as well as the Silver Snoopy — an award that astronauts bestow for outstanding performance contributing to flight safety — for his actions as lead robotics officer for the Commercial Orbital Transportation Services Dragon demonstration mission to the orbiting laboratory."
    }
  ],
  "argos_summary": "NASA is preparing for the Artemis 2 mission, the first crewed flight around the moon in over 50 years, scheduled for launch in April 2024. During a visit to L3Harris Technologies in Redmond, astronaut Woody Hoburg expressed gratitude for the contributions of the company's propulsion systems to the mission. The Artemis program aims to establish a long-term presence on the moon and eventually facilitate missions to Mars, with L3Harris continuing to support future Artemis missions, including Artemis 3 in 2027 and beyond.",
  "argos_id": "IW1CDB0V6"
}