{
  "url": "https://www.nytimes.com/athletic/6542004/2025/08/12/real-madrid-arda-guler-breakout-star/",
  "authorsByline": "Mario Cortegana",
  "articleId": "cee52a0b150449b99ddde6c96f8daf0a",
  "source": {
    "domain": "nytimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "AZ",
      "county": "Pima County",
      "city": "Tucson",
      "coordinates": {
        "lat": 32.1988848,
        "lon": -110.8218543
      }
    }
  },
  "imageUrl": "https://static01.nyt.com/athletic/uploads/wp/2025/08/08042249/GettyImages-2220804946-scaled.jpg?width=1200&height=630&fit=cover",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T04:12:19+00:00",
  "addDate": "2025-08-12T04:21:00.925546+00:00",
  "refreshDate": "2025-08-12T04:21:00.925548+00:00",
  "score": 1.0,
  "title": "Real Madrid’s breakout star for 2025-26: Arda Guler ready to deliver on his promise",
  "description": "After a stop-start first two years at the Bernabeu, everything is in place for the Turkish youngster to shine under new coach Xabi Alonso",
  "content": "The final image of Arda Guler before the players’ summer break was a symbolic one for Real Madrid’s young playmaker.\n\nAfter landing at Madrid’s Barajas airport following their Club World Cup semi-final exit, the cameras captured the Turkish midfielder and Luka Modric saying an affectionate goodbye. With Modric set to leave at the end of his contract following that tournament after 13 seasons at the Bernabeu, the 39-year-old gave Guler, 19 years his junior, his No 10 shirt as a gift.\n\nThat gesture would have been even more significant if Guler had actually inherited Modric’s squad number, as was his intention, according to those close to him. Instead, the club decided that iconic shirt will now go to Kylian Mbappe, who already wears No 10 for France’s national team. That was despite Guler having been at the club a year longer than the Frenchman, which is usually a factor in deciding who gets which jersey at Madrid.\n\nIn any case, with Modric now having joined Milan as a free agent after winning 28 titles with Madrid — more than any other player in the club’s history — Guler wants to follow a similar path in what will be this third season at the club.\n\n“Arda is delighted with Xabi (Alonso, Carlo Ancelotti’s replacement as head coach),” people close to the player — who, like all those cited in this article, asked to remain anonymous to protect relationships — told The Athletic during the Club World Cup. And it is precisely that connection with Madrid’s new coach that could lead to Guler’s breakout campaign with the Spanish side.\n\nIt has been a stop-start first two years for Guler since joining from Fenerbahce in July 2023 for €20million ($23m; £17m at current exchange rates) plus potential add-ons worth up to another €10m. The club spoke highly of him after his first training sessions, while internal sources were impressed by his quality, in particular his ability with his left foot.\n\nThat bright start was cut short when he had to return from Madrid’s pre-season tour to the United States that summer due to a knee problem that resulted in surgery. He was sidelined for 148 days, missing 29 games for club and country due to that issue and two further muscle injuries.\n\nGuler ended up playing only 440 minutes across 12 appearances in that debut campaign, scoring six goals. Five of those came in the final month of the league season, when Ancelotti gave him five starts with the Spanish title already wrapped up. A bright Euro 2024 with Turkey followed, leading many to believe that last season could be his moment, but it proved another false dawn.\n\nGuler was the 17th-most used player in the Madrid squad, with 1,948 minutes across 43 matches. He scored five times and provided nine assists, but was rarely trusted by Ancelotti in important games. He did not participate at all in the Champions League play-off against Manchester City, the subsequent round of 16 tie derby games with Atletico Madrid, or the quarter-final loss to Arsenal. He was not used in the semis or final of the Supercopa de Espana either, having played just two minutes in each of the UEFA Super Cup and the final of the annual version of the Club World Cup, now rebranded as the Intercontinental Cup.\n\nThese regular absences did not go down well within the club or among the fanbase, with the press regularly asking Ancelotti about the situation. The manager became tense when facing those questions, even suggesting that Guler was being badly advised by those around him.\n\n“I spend a little part of the time with him, and then he spends a lot of time with other people,” said Ancelotti in February. “I don’t know if these other people have the same idea as me about what I think is the best for him to learn, improve and soon be able to play for Real Madrid. It’s a lack of communication.”\n\nThat sort of talk disappointed people close to Guler. Reports suggested his family had complained to the club, although this was denied by those close to him, who said his father only speaks Turkish.\n\nMeanwhile, Guler did get to play more towards the end of the season, and caused Ancelotti to change his tune. He showed fine control before scoring from outside the box to give Madrid a 1-0 win against Getafe in April, while playing as a midfielder. A week later, he scored and provided an assist to help his side to a 3-2 defeat of Celta Vigo, which he started. “Two months ago, I threw a stick at those around him, and now I have to congratulate them,” Ancelotti said after the latter game.\n\nThe early-summer arrival of Alonso, who sounded out the possibility of signing Guler when he was in his previous job as manager of Germany’s Bayer Leverkusen, has opened up new horizons for the Turkish youngster.\n\nIn June, Madrid signed promising winger Franco Mastantuono from River Plate of Argentina for a total fee of €63.2million, which could have been seen as a threat, given they play in similar positions. But Guler had already been informed he would begin the 2025-26 season playing further back in midfield, as he did for Alonso at the Club World Cup. He started five of Madrid’s six matches during that tournament, all except the group-stage opener against Al Hilal, and was their ninth-most-used player, with 423 minutes, scoring a goal and providing two assists to get fans enthused about his performances.\n\nGuler himself seemed happy, too. “The coach is trying to make us have more control of the game, and that’s better for me,” he said. “I’m happier because I play and play in the middle.”\n\nAlonso, meanwhile, sent out a statement of intent as he spoke about his management of young talent. “It’s time to invest in Arda’s progress and development,” he said, “and let him know that he can make mistakes.”\n\nWith the injuries apparently behind him and plenty of confidence flowing his way from Alonso, many inside and outside the club are hoping this could finally be Guler’s season.\n\nNow it’s up to him to live up to those expectations.",
  "medium": "Article",
  "links": [
    "https://www.nytimes.com/athletic/5573923/2024/06/18/arda-guler-ancelotti-turkey/",
    "https://www.nytimes.com/athletic/6510505/2025/07/24/mbappe-10-shirt-number-real-madrid/",
    "https://www.nytimes.com/athletic/6476712/2025/07/08/arda-guler-real-madrid-xabi-alonso/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Arda Guler",
      "weight": 0.082785174
    },
    {
      "name": "Guler",
      "weight": 0.0771743
    },
    {
      "name": "Real Madrid",
      "weight": 0.07384503
    },
    {
      "name": "Madrid",
      "weight": 0.070562564
    },
    {
      "name": "Atletico Madrid",
      "weight": 0.0705531
    },
    {
      "name": "Club World Cup",
      "weight": 0.0626653
    },
    {
      "name": "last season",
      "weight": 0.060015023
    },
    {
      "name": "club",
      "weight": 0.059839662
    },
    {
      "name": "season",
      "weight": 0.05856075
    },
    {
      "name": "Ancelotti",
      "weight": 0.054575518
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Sports"
    },
    {
      "name": "Travel"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.986328125
    },
    {
      "name": "/Sports/Team Sports/Soccer",
      "score": 0.984375
    }
  ],
  "sentiment": {
    "positive": 0.16913714,
    "negative": 0.31827378,
    "neutral": 0.5125891
  },
  "summary": "Arda Guler, Real Madrid's young playmaker, is poised to become the club's key player for 2025-26. Guler joined from Fenerbahce from Madrid in 2023 for €20m ($23m; £17m) and potential add-ons worth up to another €10m. Despite being the 17th-most used player in the Madrid squad, Guler was rarely trusted by manager Carlo Ancelotti in crucial games. His performance in the Champions League play-off against Manchester City, the subsequent round of 16 tie games with Atletico Madrid, or the quarter-final loss to Arsenal, led to speculation that Guler might be the future breakout player for the Spanish club.",
  "shortSummary": "Arda Guler, 24, is poised to become Real Madrid’s star in the future after a challenging two years and a close relationship with new coach Carlo Ancelotti.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "d628dc3b98174133980b466d73dfa5bd",
  "places": [
    {
      "osmId": "167025457",
      "suburb": "Barajas",
      "city": "Madrid",
      "state": "Community of Madrid",
      "postcode": "28042",
      "country": "Spain",
      "countryCode": "es",
      "coordinates": {
        "lat": 40.4952269,
        "lon": -3.573372944738505
      }
    }
  ],
  "scraped_sources": [
    {
      "url": "https://www.nytimes.com/athletic/6510505/2025/07/24/mbappe-10-shirt-number-real-madrid/",
      "text": "Kylian Mbappe will wear the No 10 shirt for Real Madrid next season after choosing to switch from the No 9 he wore in his debut campaign.\nMbappe all but confirmed the change on social media on Wednesday, tweeting simply: ’10’.\nMadrid’s No 10 shirt is vacant for the first time since 2017 following Luka Modric’s departure from the club earlier this summer.\nAdvertisement\nSources close to the situation, speaking on the condition of anonymity to protect relationships, said the La Liga side had a policy of giving players preference for squad numbers based on their experience with the club.\nThe club, though, has the final say, and Mbappe has been given the No. 10, despite interest from team-mates who have been with Madrid longer, because of his significance as a player.\n10\n— Kylian Mbappé (@KMbappe) July 23, 2025\nMbappe also wears the No 10 shirt for France, having worn No 29 – for Monaco and in his first season at Paris Saint-Germain – and the No 7 at PSG from 2018 onwards.\nFormer Real Madrid No 10s include James Rodriguez, Mesut Ozil, Wesley Sneijder, Luis Figo and Clarence Seedorf.\nCristiano Ronaldo also changed his shirt number early into his Madrid career. Like Mbappe, the Portugal international wore the No 9 after joining the club from Manchester United in the summer of 2009. He inherited Raul’s No 7 shirt from the 2010/11 season onwards.\nIn his debut season at the Santiago Bernabeu, Mbappe scored 44 goals and provided five assists in 59 games.\nReal Madrid’s first game of the 2025/26 La Liga season is against Osasuna on August 19.\nAnalysis\nBy Guillermo Rai\nThere are plenty of iconic shirt numbers at Real Madrid, some more than others.\nThe most prestigious one is probably No 7, as it has been worn by club legends including Emilio Butragueno, Raul and Cristiano Ronaldo – Mbappe’s childhood idol.\nBut after that, the No 10 holds special significance, having been worn for the past seven seasons by Luka Modric. Apart from the Croatia midfielder, some of the illustrious names to have worn that number in the past include Luis Figo, Clarence Seedorf, Mesut Ozil, Michael Laudrup and Ferenc Puskas.\nMbappe has a personal story with it too. In the comic book he released about his life, one scene showed the Frenchman as a child unboxing a Real Madrid shirt for Christmas with the No 10 on the back.\nAdvertisement\nWith the No 7 occupied by Vinicius Junior, Mbappe will wear the same number he does for the French national team.\n“A special number is offered to a very special player,” is how club sources have described the move.\nIt also follows the announcement a week ago that Lamine Yamal would take the No 10 shirt so closely associated with Lionel Messi for Barcelona. Senior sources at Madrid expect Mbappe’s change of shirt to have a positive commercial impact.\n(Photo: Buda Mendes/Getty Images)"
    },
    {
      "url": "https://www.nytimes.com/athletic/6476712/2025/07/08/arda-guler-real-madrid-xabi-alonso/",
      "text": "When it comes to Xabi Alonso’s Real Madrid, nothing seems to be a coincidence, and that applies to the emergence of Arda Guler.\nMadrid’s new coach has been taking care of every detail since he took over in May, with the 20-year-old Turkey playmaker one of the main beneficiaries of his arrival.\nAfter their win against Borussia Dortmund in the Club World Cup quarter-finals, the coach and the player were seen heading to the team bus together as they left the MetLife Stadium.\nAdvertisement\nGuler had just delivered two brilliant assists to help Madrid progress to the semi-finals, where they will face Paris Saint-Germain on Wednesday.\n“Assist maker!” Luka Modric wrote alongside a fire emoji on Guler’s Instagram post. “I’m trying to learn from him every day,” Guler had answered when asked by The Athletic whether he can replace the veteran Croatia midfielder.\nView this post on Instagram\nFormer Madrid head coach Carlo Ancelotti had suggested to Guler that he could be the player to take the mantle of Modric and Toni Kroos, who retired last summer.\nThe youngster has become a key figure in the U.S., playing the ninth-most minutes in the squad (340), having finished 17th in that metric last season when Ancelotti was still in charge.\nGuler travelled to the U.S. this summer ready to make the step up to become a regular starter, and he is succeeding.\nAfter signing from Fenerbahce in the summer of 2023 for an initial €20million ($21.7m; £17.1m), Guler’s first season was beset by injuries. But in the final campaign with Ancelotti, his issue was a lack of opportunity. This caused unease within the club and among the fans and that hit a nerve with Ancelotti in press conferences.\nThe coach, who has since left to take charge of Brazil, justified himself by saying that, at Madrid, youngsters have to “suck it up on the bench (chupar banquillo)” before becoming undisputed starters.\nAlonso has taken a different view. “Arda is delighted with Xabi,” sources close to Guler, speaking on condition of anonymity to protect relationships, told The Athletic.\nAlonso wanted to sign him when he was in charge of Bayer Leverkusen and in this new chapter, he is showing why. At the same time, the club have shown confidence in Guler.\nWhen Madrid executives and the coach were pushing to finalise the signing of Franco Mastantuono from River Plate, Guler knew he would be playing as a midfielder this season. He was told that the arrival of the Argentine, who plays on the right wing, would not pose a threat to his playing time.\nAdvertisement\nGuler started the Club World Cup as a substitute, but Alonso sent him to warm up in the 10th minute of Madrid’s opener against Al Hilal and brought him on in the 46th minute. Despite the 1-1 draw, Guler convinced everyone and has been key since.\nHe scored in the 3-1 win against Pachuca, making him the youngest player (at 20 years and 57 days) to score 10 goals for Madrid in a season across all competitions since at least the 2009-2010 campaign, when Opta began recording this stat, surpassing Vinicius Junior’s record (20 years and 80 days), which was set in 2020.\nGuler’s prominence has grown in front of the media, too. He has been chosen by the club to speak on three occasions during the competition, despite not speaking much Spanish and not being particularly fluent in English.\nWhen asked about the differences between Ancelotti and Alonso, Guler explained that “the coach is trying to make us have more control of the game, that’s better for me”. He added: “I’m happier because I play and play in the middle.”\nHe reaffirmed the view before the Dortmund game. “All is good because I have started all the last three games, I played very good, the coach is happy and the team is happy with me.”\nMinutes later, Alonso backed him when answering whether Guler could be stronger defensively. “It’s a time to invest in Arda’s progress and development,” he said. “Let him know that he can make mistakes.”\nGuler promptly delivered his most complete game of the tournament. He immediately showed his evolution into a more versatile player, first recovering a ball and then a minute later controlling with the sole of his boot before masterfully setting up Gonzalo Garcia’s 10th-minute opener.\n“We talked about it before the game,” Garcia said. “He had told me that if he had space he would put it to me, (he asked me) to be there. I was just there, the pass was sweet, like the other day with Trent (Alexander-Arnold), and all I had to do was push it in.”\nGuler showed his versatility. He started as an organising midfielder and ended up as a playmaker and even out wide, too. From there, he linked up with Kylian Mbappe, who made it 3-1.\nAdvertisement\nMadrid fended off interest from other clubs, including Barcelona, to sign him in 2023.\nAt that time, he did not have a natural place in the squad but was seen as an outstanding talent whom they just had to sign. Under Alonso’s guidance, Guler is silencing any doubts.\n(Top photo: Mostafa Bassim/Anadolu via Getty Images)"
    },
    {
      "url": "https://www.nytimes.com/athletic/5573923/2024/06/18/arda-guler-ancelotti-turkey/",
      "text": "Giorgi Mamardashvili pawed the free kick away. As he did, his Georgian team-mates ran over to celebrate as if he had scored. His compatriots in the press tribune in the Westfalenstadion turned to their colleagues, grasped their arms and said: “The best in the world. The best goalkeeper in the world.”\nAdvertisement\nMamardashvili was the hero when Georgia qualified for a European Championship for the first time since gaining independence from the Soviet Union in 1991. When the 23-year-old goalkeeper flew to his left and saved Tasos Bakasetas’ penalty in the play-off against Greece, he flew his nation to Dortmund too.\nThe stop he made on Hakan Calhanoglu was no ordinary one, either. Turkey’s captain made a name for himself a decade ago by slamming a free kick past Borussia Dortmund for Hamburg from all of 40 yards.\nOn Tuesday, Mamardashvili denied Calhanoglu to keep the score at 1-1. Only special strikes eluded the Valencia No 1. Mert Muldur’s supernatural opener deserved an X-File of its own. When Mamardashvili’s goalkeeper coach Davit Gvaramadze studies the tape, he will no doubt classify it under unexplained phenomena; a once-in-a-lifetime sighting of a Fenerbahce full-back, renowned more for his speed than the sonic boom unleashed in Dortmund.\nTurkish delight in Dortmund! ⚽️#BBCEuros #Euro2024 #TURGEO pic.twitter.com/ENbdVJPr8I\n— BBC Sport (@BBCSport) June 18, 2024\nAbsolute class. 👏\nIs this the goal of the tournament so far from Mert Müldür and Turkey? 🚀🇹🇷 pic.twitter.com/DLNUpkIMiO\n— FOX Soccer (@FOXSoccer) June 18, 2024\nUnfortunately for Mamardashvili, half an hour from Georgia’s first point in this competition, another alien appeared. Arda Guler looked like a kid who had come to watch the game in full kit. His waif-like physique and choir-boy looks contrasted with the grown men around him. But his presence in the game was disproportionate for his size and 19 years of age.\nNominally on the right side of Turkey’s attack, Guler played in the half-spaces. He let Muldur or the very eager Baris Yilmaz provide the width on that flank. He came short and showed for the ball, taking playmaking responsibilities off Calhanoglu, his skipper. Some of Turkey’s earliest chances arrived from his corner kicks. Kenan Yildiz’s disallowed goal was a tap-in at the far post from one of his pullbacks. Pushed off the ball only once, the dribbler Guler even tracked back midway through the first half to stop the dribbler Khvicha Kvaratskhelia.\nAdvertisement\nCreditably, he upstaged last season’s Serie A MVP. He upshot Mamardashvili, too.\nGuler has drawn comparisons with Mesut Ozil for the elegance he shows on the ball. He clearly hasn’t joined him in the weight room where Ozil is spending much of his retirement, but behind his dainty figure is a shot power Ozil never possessed — an attribute he demonstrated when he piledrived Turkey’s go-ahead goal past Mamardashvili from 30 yards.\nThe goal made Guler the first teenager to score at a European Championship since Cristiano Ronaldo 20 years ago. “I don’t care about personal achievements,” Guler said, as he sat next to Vincenzo Montella in the post-match press conference, looking every bit like the teacher’s pet. Montella, his raven black hair slicked back in the style of Pier Paolo Pasolini, had withdrawn Guler 10 minutes from time and embraced him as he received a standing ovation from a vociferous crowd. It felt like all of the 23,000 Turkish residents in Dortmund were singing his name.\nJose Mourinho must wish Guler were still a Fenerbahce player. Instead, the coach texting him after the game, Guler revealed, was Carlo Ancelotti.\n“Mister Ancelotti is motivating me a lot,” he said. The Real Madrid head coach also tried to bring the timid-looking Guler out of his shell. “I want to introduce you to a ‘chico muy interesante’,” Ancelotti addressed the crowd during Real Madrid’s Champions League celebrations. He passed the microphone to Guler, who, after some encouragement, came forward and adorably said, “Hola Madridistas. We are family. Gracias por todos!”\nUp until then, they had not seen much of him. No sooner had he arrived from Istanbul than he underwent arthroscopic surgery on his right knee.\n“He started the season with an injury that dragged on,” Montella said. “He played little until the end of March.” But once he did… Guler finished the season with six La Liga goals in 10 appearances as Madrid also clinched the league title. He hit the woodwork from just inside the Osasuna half in one of his first games back from injury.\nGuler’s relative ability to hit the ground running validated his decision not to go out on loan straight after joining Madrid. Instead of taking an intermediary step, like Takefusa Kubo and Martin Odegaard had done in the past with Real Sociedad, he already felt ready to compete with Vinicius Junior, Rodrygo, Jude Bellingham, Brahim Diaz and Luka Modric.\n| Group F | MP | W | D | L | GD | PTS |\n|---|---|---|---|---|---|---|\nPortugal | 2 | 2 | 0 | 0 | 4 | 6 |\nTurkey | 2 | 1 | 0 | 1 | -1 | 3 |\nCzech Republic | 2 | 0 | 1 | 1 | -1 | 1 |\nGeorgia | 2 | 0 | 1 | 1 | -2 | 1 |\n“The Euros are an opportunity for him to show his worth,” Montella said. “He goes into it in the best possible mental condition after winning the Champions League and La Liga.”\nMatchday in Dortmund also happened to be the coach’s 50th birthday. “I already received a beautiful gift,” Montella gushed, gesturing to Guler. “The perfect present, the best I could get.” If the Italian manages to unwrap more of Guler’s potential this summer, Turkey could go far.\n(Top photo: Sebastian Frej/MB Media/Getty Images)"
    }
  ],
  "argos_summary": "Arda Guler, Real Madrid's young Turkish playmaker, is poised for a breakout season under new coach Xabi Alonso after a challenging start marred by injuries and limited playing time. Following Luka Modric's departure, Guler was initially set to inherit the iconic No. 10 shirt, but it will now be worn by Kylian Mbappe. Guler's recent performances in the Club World Cup have generated excitement, as he adapts to a more central midfield role, showcasing his potential to become a key player for Madrid.",
  "argos_id": "JAPFCPIGW"
}