{
  "url": "https://www.usatoday.com/story/money/2025/08/12/packing-school-lunch-costs-rising/85602684007/",
  "authorsByline": "Betty Lin-Fisher",
  "articleId": "8407b521bfaa4785b2356fec5e272253",
  "source": {
    "domain": "usatoday.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "VA",
      "county": "Fairfax County",
      "city": "McLean",
      "coordinates": {
        "lat": 38.9342888,
        "lon": -77.1776327
      }
    }
  },
  "imageUrl": "https://www.usatoday.com/gcdn/authoring/authoring-images/2025/08/11/USAT/85616189007-usatsi-23988812.jpg?crop=7007,3942,x0,y0&width=3200&height=1801&format=pjpg&auto=webp",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T04:01:11+00:00",
  "addDate": "2025-08-12T04:08:20.116439+00:00",
  "refreshDate": "2025-08-12T04:08:20.116441+00:00",
  "score": 1.0,
  "title": "Will higher prices steal your kid's lunch money? Why more parents are willing to pack.",
  "description": "Here is why parents are willing to spend more to pack school lunches, even though costs are rising",
  "content": "Perla Lozano's two kids are about to start school on Thursday. They'll be taking a lunch that their mom packs for them every day, even though the cost of brown-bagging is likely more expensive than buying a lunch at school — and the costs are going up.\n\nThe rising price tags for food and other goods due to inflation and tariffs are also affecting the cost of home-packed school lunches. But parents like Lozano say they're willing to make cuts elsewhere in their budget to ensure their kids are eating a healthy meal.\n\nIn its latest survey of 1,203 caregivers of school-aged children, the 2025 Deloitte Back to School survey found that almost half (48%) of parents and caregivers said the cost of lunch on school days will likely be higher than last year. But 42% of the respondents said they would continue to pack their student's mid-day meal.\n\nAccording to an analysis by Deloitte examining three years of lunch-related food prices, this year's average daily cost across brown-bag school lunch options the company studied is $6.15. Compared to the start of school last year, Deloitte said packing a lunch is expected to cost 3% more on average, or slightly higher than food-at-home inflation overall.\n\nThe company looked at a variety of packed lunches for the index, including the classic peanut butter and jelly sandwich, a more contemporary lunch featuring a chicken and avocado quesadilla, a health and wellness lunch centered on a salad, and a \"convenience\" lunch built around a prepacked meat, cheese and crackers kit.\n\nBut the rise in costs is still lower than the uptick two years ago. The cost of the average index lunch at the start of the 2023 school year was up 6% from the previous year.\n\nClassic peanut butter and jelly lunch is more expensive\n\nAlthough the classic peanut butter and jelly lunch with the sandwich, baby carrots, apples, cookies and milk still is the cheapest of the four options reviewed by Deloitte at $4.84, it also had the steepest rise in cost in 2025 (6% year over year). That is driven by higher retail prices for apples, jelly and single-serve milk cartons, Deloitte said.\n\nThe \"contemporary day\" packed lunch of a chicken and avocado quesadilla, dipping salsa, mango, a brownie and juice will cost $7.30, according to Deloitte. That's up 2% from the previous year.\n\nA \"health and wellness day\" lunch of a bagged salad kit, hummus, pretzels, mandarin orange, yogurt and seltzer water will cost $6.54, up 1%. A \"convenience day\" lunch of a meat, cheese and crackers lunch kit, fruit cup, pudding cup and a can of soda will cost $5.92, up 2.2% from last year.\n\nIn comparison, Deloitte said the average cost for lunch obtained at school is $2.99, and is sometimes free if the student qualifies. Just over half of respondents said their school offers free lunch to all students, regardless of income.\n\n\"No one knows exactly where prices are headed next, but following a drop in February, prices for all four lunches are on an upward trend, rising an average of 5.5%,\" Deloitte said in it's study \"Will higher prices steal your kid's lunch money?\"\n\nParents say packing a lunch is better value and variety\n\nAlthough school-provided lunches are almost always cheaper or free compared to brown-bagging or packing a lunch at home, four in 10 respondents to Deloitte's survey (42%) said they make their kids' lunch. Most respondents said they think they get better value from bringing a lunch (63%) and more variety (52%). A majority, or 69%, of respondents with children who take their lunch from home rated those meals higher for superior taste relative to cafeteria food.\n\n“Parents are packing lunches with both wallets and wellness in mind,\" Natalie Martini, vice chair and U.S. Retail & Consumer Products sector leader for Deloitte, told USA TODAY.\n\n\"Parents and caregivers want to ensure their kids are eating healthy, quality lunches during the school day, and they believe bringing lunch from home is the way to do that,\" she said.\n\nParents are also seeking value everywhere they can, even with their kids’ school lunches, Martini said. \"However, they don’t want this to come at the expense of the nutritional value of the lunch. As a mom of two middle-schoolers, I know my kids do better in school when they’re eating a healthy and nutritious lunch.\"\n\n\"Parents may look to swap name-brand snacks for private labels or opt for cheaper main entrees to make a healthy lunchbox on a budget,\" Martini said. Thirty-one percent might opt for the private labels, while 24% might aim for less expensive entrees. Another 27% said they would substitute a cheaper main lunch item.\n\nLozano, of Sylmar, California, said she will continue to pack a home-made lunch for her two children, even though the family of four has had to cut back on other parts of their monthly budget to account for rising food costs.\n\nLozano packs lunches for Aleny, 13, and Adrian, 9, each morning. Their lunches are usually hot meals and leftovers from a healthy meal Lozano cooked for dinner the night before. Often, it will be something like meat with vegetables or fried rice. The mid-day meal always includes vegetables and fruit and a protein.\n\nOn Fridays, Lozano will do sandwiches, but even those will be home-made, without a crust, instead of store-bought. Lozano said it not only keeps the cost down to make the sandwiches herself, but she knows the ingredients are healthy and without added preservatives or other ingredients she is trying to avoid.\n\nStill, \"it's gotten really pricey because it's getting harder to put together healthy lunches like fruits and vegetables as opposed to the junk,\" Lozano told USA TODAY.\n\nShe and her husband Adrian are willing to make sacrifices in other parts of their family's budget to provide healthy food for their family throughout the day. They've cut back on violin lessons for the kids, going from weekly to bi-weekly. And they've cut down to just one streaming service.\n\n\"We've cut back on everything else so we can afford good food for our kids,\" she said.\n\nHere's some other highlights from Deloitte's study:\n• 3 in 4 caregivers think there should be more fresh food in school-provided lunches.\n• 57% of respondents would like more locally-sourced cafeteria food and they’re willing to pay more for it.\n• Overall, most (82%) parents and caregivers would like their kids to eat healthier during the school day.\n• Changes made to food budgets or shopping choices can differ by generation: half of Gen Z caregivers (56%), more than three times higher than any other generation, said they would switch to more school-provided lunches, while millennials were the most willing to cut back on buying fresh food to reduce the cost of perishable food waste (29%).\n\nBetty Lin-Fisher is a consumer reporter for USA TODAY. Reach her at blinfisher@USATODAY.com or follow her on X, Facebook or Instagram @blinfisher and @blinfisher.bsky.social on Bluesky. Sign up for our free The Daily Money newsletter, which will include consumer news on Fridays, here.",
  "medium": "Article",
  "links": [
    "https://www.usatoday.com/news/politics/tariffs/",
    "https://profile.usatoday.com/newsletters/the-daily-money/?for-guid=ad4a9a18-a205-4c95-b25b-7511a2fe34ae&utm_source=usatoday-TheDailyMoney&utm_medium=email&utm_campaign=baseline_greeting&utm_term=newsletter_greeting&utm_content=USAT-8872UT-E-NLETTER04",
    "https://puzzles.usatoday.com/",
    "https://www.usatoday.com/story/money/2025/08/05/2025-sales-tax-holiday-back-to-school/85528078007/",
    "https://www.usatoday.com/picture-gallery/news/nation/2025/05/29/students-test-school-lunch-menus-photos/83930046007/",
    "https://www.usatoday.com/story/money/2025/08/08/buy-nothing-free-community-groups-save-money-environment/85259588007/",
    "https://www.usatoday.com/story/money/2025/07/22/beef-prices-record-highs/85325298007/",
    "https://www.usatoday.com/story/money/2025/07/23/back-to-school-shopping-tariff-spending/85198184007/"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "packed lunches",
      "weight": 0.11463247
    },
    {
      "name": "healthy lunches",
      "weight": 0.112502314
    },
    {
      "name": "free lunch",
      "weight": 0.10652893
    },
    {
      "name": "lunch",
      "weight": 0.106191926
    },
    {
      "name": "lunches",
      "weight": 0.106191926
    },
    {
      "name": "school days",
      "weight": 0.080465056
    },
    {
      "name": "rising food costs",
      "weight": 0.07805338
    },
    {
      "name": "home-packed school lunches",
      "weight": 0.07595247
    },
    {
      "name": "healthy food",
      "weight": 0.07565446
    },
    {
      "name": "more school-provided lunches",
      "weight": 0.07245487
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/Jobs & Education/Education/Primary & Secondary Schooling (K-12)",
      "score": 0.6904296875
    },
    {
      "name": "/People & Society/Family & Relationships/Family/Other",
      "score": 0.6552734375
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.4580078125
    }
  ],
  "sentiment": {
    "positive": 0.66187364,
    "negative": 0.085222885,
    "neutral": 0.2529035
  },
  "summary": "The cost of home-packed school lunches is increasing due to inflation and tariffs, according to Deloitte. The company's survey of 1,203 caregivers of school-aged children revealed that nearly half of parents and caregivers predicted that the cost of lunch on school days will likely increase, but 42% said they would continue to pack their student's mid-day meal. The study also revealed that this year's average daily cost across brown-bag school lunch options is $6.15, compared to the previous year. The cost of the average index lunch at the start of the 2023 school year was up 6% year over year. However, the rise in costs is still lower than the two years ago. Parents believe that bringing a lunch from home is a better value and variety, and 69% of respondents with children who take their lunch home rated their meals higher for superior taste and nutritional value.",
  "shortSummary": "Rising food prices and tariffs are driving more parents to pack school lunches, though many choose home-based options for healthier options.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "7447ed56850e4078a84ab002ae6d3e86",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.usatoday.com/story/money/2025/07/22/beef-prices-record-highs/85325298007/",
      "text": "Beef prices at all-time high: Why summer grilling costs a lot more this year\nSupply constraints and high demand have driven up beef prices. Experts warn that it could take years to rein prices back in.\nThis year’s Labor Day barbecue won’t be cheap.\nSupply constraints and high demand have driven up the cost of beef, with 100% ground beef prices in June surpassing $6 per pound for the first time since data collection started in the 1980s, according to the Labor Department.\nWhile costs may dip slightly once grilling season ends, experts say significant price relief could be years away.\n“If we’re thinking about seeing prices lower than we saw last year or going back to prices 5 or 6 years ago, that’s not very likely,” said David Anderson, a professor and extension economist for livestock and food product marketing at Texas A&M. “But I do think there is a chance for some relief from this (summer) spike in prices.”\nWhy are beef prices higher?\nA variety of factors have crunched the nation's cattle supply over the years, including recent drought conditions that raised the cost of cattle feed and pushed ranchers to send more cows to slaughter. The national beef cow herd is at its lowest point since 1961, according to a January report from the United States Department of Agriculture.\nThe USDA in May also halted live cattle imports from Mexico due to the spread of New World Screwworm, further limiting the U.S.'s supply and fueling price increases. The fly's parasitic larvae can cause \"serious, often deadly\" damage to animals, according to the USDA.\nDespite rising prices, there's still plenty of demand for beef. The USDA estimates consumption this year will be up slightly from 2024.\nThe U.S. has increasingly turned to imports to meet that demand, especially for lean beef trimmings used in ground beef. Roughly 20% to 30% of ground beef is brought in from countries like Australia and Brazil, according to the Iowa Farm Bureau.\nTariff threats from the Trump administration could drive up prices even further. Brazil, for instance, is facing a 50% tariff starting Aug. 1. Currently, Brazilian beef is subject to a 10% to 36.4% tariff, depending on the size of the import, according to Reuters.\n\"It adds a lot of uncertainty to the market,” Anderson said of looming tariffs.\nWhen will beef prices drop?\nLower demand tends to spur lower prices, which means shoppers may find some modest relief once the weather cools.\n“Typically after midyear, beef prices tend to decline,” Anderson said, adding shoppers are more likely to swap steaks for cheaper roasts later in the year. “Seasonally, I think there’s a chance we see lower prices than where we have been in the last few weeks.”\nStill, Anderson said prices are unlikely to drop back to the $3 to $5 range shoppers paid in recent years.\nPart of that is because it will take time for ranchers to build up their herds. If a rancher decides to keep a calf born this spring, for instance, they will need to wait years before it's big enough to send to market, Anderson said.\n“That takes us to 2029 for increasing beef production,” he said. “It’s just biology and time.”\nThe timing also hinges on continued demand for beef, according to Michael Swanson, chief agricultural economist at the Wells Fargo Agri-Food Institute. Higher beef prices are giving ranchers money to build up their herds; if demand wanes and cattle prices drop, recovery could take longer.\nAlready, cattle farmers and ranchers face \"razor thin profit margins,” according to a May report from American Farm Bureau Federation economist Bernt Nelson.\n“It’s a very, very nervous supply chain right now because of the record amount of money they have on the table doing what they do,” Swanson said.\nHow to save money on beef\nSwanson’s advice for shoppers looking to save money? Be open to different cuts of meat.\nAccording to June figures from the Labor Department:\n- All uncooked ground beef costs $6.34 per pound, up 11% from a year ago\n- Chuck roast costs $8.20 per pound, up 7.2%\n- Round roast costs $7.76 per pound, up 12.8%\n- Sirloin steak costs $12.92 per pound, up 12.7%\n- Beef for stew costs $8.02 per pound, up 10.7%\n“Everybody likes to buy filet mignon, but there are plenty of cuts that you can get a better value for your money,” Swanson said. “There are cuts that some people don’t want that have delicious flavor if you’re willing to cook them slow.”"
    },
    {
      "url": "https://www.usatoday.com/story/money/2025/08/08/buy-nothing-free-community-groups-save-money-environment/85259588007/",
      "text": "Why are these Facebook users gifting things to each other for free?\nNaomi Serviss scored a bookshelf and a guitar stand.\nMichelle Wolf got three spin bikes ‒ two for a teacher friend's classroom and one for herself.\nJoni Holderman got a gently used rug that retails for $1,000.\nThey're part of a growing trend of consumers giving and getting things ‒ for free ‒ via local community groups that are often titled \"No Buy,\" \"Buy Nothing,\" or tagged with the words \"Free in\" and a community name, on Facebook or other web platforms.\nThese groups provide a connection among community members and neighbors who want to give things away for free, or people who are looking for items. It also helps the environment by keeping unwanted belongings out of the trash or landfill.\nIt is a super-local gifting economy, said Serviss of North Kingstown, Rhode Island. She has received and given away countless items in Buy Nothing groups both in her hometown and New York City.\nGiving away and receiving \"eclectic treasures\"\nServiss is a long-time thrifter. But getting something for free is even better.\nWhen Serviss lived on Manhattan's Upper West Side, she scored what she calls free \"eclectic treasures.\"\nAmong them were African masks, soft sculpture art, decorative sofa pillows and even a runner rug that fit her hallway, she said.\n\"I happily gave away brand-name raincoats, sporty hats and a wedding guest formal gown worn once to my nephew's Albany wedding eight years ago,\" she told USA TODAY.\nOne of her favorite \"gets\" was a \"stunning\" red embroidered kimono, Serviss said. She mounted it on the wall of her one-bedroom apartment.\n\"It was a thing of beauty and when it was time to relinquish it, I joyfully passed it on to an interested neighbor,\" she said.\nWhen Serviss and her husband moved to Rhode Island, she found a new local Buy Nothing group.\nServiss gifted a new set of turquoise Ikea stoneware to a person who had posted an \"ISO\" or \"in search of\" message for kitchen supplies for her grandson's new apartment.\n\"Coincidentally, that same member was offering a striking antique African doll,\" Serviss said. \"When she responded to my interest, she mentioned how much her grandson loves the dishes and wanted me to have the doll!\"\nHow does a Buy Nothing or No Buy group work?\nThe largest network of Buy Nothing groups on Facebook and via a web portal is through the Buy Nothing Project, which was founded in 2013 by two friends, Liesl Clark and Rebecca Rockefeller, in the Pacific Northwest, when they saw a beach full of washed-up plastics of every shape, color and size.\nThere were three reasons the ladies started the first group, Clark told USA TODAY in an interview: to help save the environment, to create a gifting economy to share items, and to help people connect socially with each other.\n\"We all need each other and we can create a circular economy within our community and keep sharing our stuff, especially kids stuff and clothes,\" she said.\nThe women had met on Freecycle, a longstanding web platform where people can post things they are giving away.\nThe friends launched their own concept on Facebook, creating their first Buy Nothing Group in Bainbridge Island, Washington.\nWithin hours, it went from the two ladies to hundreds of people.\nThe idea has now become a worldwide social movement, with 12.85 million users in groups on Facebook and 1.5 million people participating in the BuyNothing App, which can also be accessed online at https://buynothingproject.org. People from 44 nations have registered Buy Nothing groups on Facebook and downloads of the app come from about 193 countries, Clark said.\n\"We never intended to grow a social movement,\" she said. \"We intended to just solve a problem in our own community, which was the amount of plastics washing ashore.\"\nHow to participate in a Buy Nothing group\nIt costs nothing for people to participate in a Buy Nothing group. If someone wants to create a new Buy Nothing group on Facebook, it costs $10 for a license. The project then sets up the group and loads the general rules to get the group started, Clark said.\nClark said there are groups on Facebook that use the Buy Nothing name and don't register, which is a violation of the trademark, but her group is not big enough to \"police\" it. There are also groups formed on Facebook that have similar concepts of offering free items within a community, or people who give things away on Facebook Marketplace and are not affiliated, she said.\nThe Buy Nothing Project has also developed a mobile app and website, https://buynothingproject.org, which is available for people who don't want to be on Facebook. People can find local groups or participate in a global group online or on the app, paying a minimal shipping fee for their free item. That helps open up the concept to people in communities that might be too small for their own group, Clark said.\nWhat are the rules of a Buy Nothing or free group?\nThe Buy Nothing groups all agree to some general rules, including that money can't be involved and no illegal activity is allowed. But then, each group has its own rules.\nMichelle Wolf's group near Pleasantville, New York, asks the gifter to wait six hours before they pick a \"winner.\" Wolf said when she's gifting something, sometimes she picks someone based on their \"story\" and sometimes she uses an app to pick someone randomly.\nWolf \"won\" a spin bike when she explained that her friend, a teacher for students with disabilities, had a classroom spin bike that broke.\nThe kids in the classroom were thrilled, and so was the gifter, Wolf said. She also got a second bike for the friend's classroom and then one for herself.\nHolderman said she loves the Buy Nothing group because \"it transforms our mindset from one of scarcity and struggle to one of abundance and sharing.\"\nA $1,000 \"free\" rug\nThe best thing Joni Holderman of Myrtle Beach, South Carolina, has received in her group was an 8-by-10-foot rug from West Elm that, when she looked up the retail value, turned out to be worth $1,000.\n\"I know it was lightly used, but it's wonderful,\" she said.\nHolderman has given away a large beach-themed dresser and a sofa, among other things. While she still donates to charities, for something like a sofa, she'd have to haul it there. Instead, someone came and got it.\nHolderman said she'd also rather give things away to someone grateful instead of getting some money for selling them on Facebook Marketplace. \"There's that whole haggling over the price. It's almost an adversarial relationship.\"\nFree groups help people struggling in this economy\nThe Buy Nothing community and similar groups are especially helpful in today's economy, Clark said.\n\"Every day, people are struggling and our economy is kind of questionable where it's going to go and we want to be that safety net,\" Clark said.\nThe groups connect people.\n\"They come for the stuff,\" Clark said, \"and they stay for the community.\"\nBetty Lin-Fisher is a consumer reporter for USA TODAY. Reach her at blinfisher@USATODAY.com or follow her on X, Facebook, or Instagram @blinfisher and @blinfisher.bsky.social on Bluesky. Sign up for our free The Daily Money newsletter, which will include consumer news on Fridays, here."
    }
  ],
  "argos_summary": "As school begins, many parents, like Perla Lozano, are opting to pack lunches for their children despite rising costs due to inflation, with nearly half of surveyed caregivers expecting lunch expenses to increase. The average cost of a home-packed lunch is now $6.15, a 3% rise from last year, while school lunches average $2.99. Parents prioritize health and variety in their children's meals, often making budget cuts elsewhere to afford nutritious options.",
  "argos_id": "JSSPEHNRS"
}