{
  "url": "https://thehill.com/homenews/administration/5447217-five-takeaways-as-trump-seizes-control-of-dc-police-deploys-national-guard/",
  "authorsByline": "Ian Swanson",
  "articleId": "8faf849a8afb4b4cad10b6424a1a502e",
  "source": {
    "domain": "thehill.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "DC",
      "city": "Washington",
      "coordinates": {
        "lat": 38.8949924,
        "lon": -77.0365581
      }
    }
  },
  "imageUrl": "https://thehill.com/wp-content/uploads/sites/2/2025/08/2__1087.jpeg?w=1280",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T22:24:45+00:00",
  "addDate": "2025-08-11T22:46:22.415425+00:00",
  "refreshDate": "2025-08-11T22:46:22.415428+00:00",
  "score": 1.0,
  "title": "Five takeaways as Trump seizes control of DC police, deploys National Guard",
  "description": "President Trump announced on Monday that he was taking control of the District of Columbia’s police and deploying the National Guard. Trump portrayed the moves, which will involve around 800 Nation…",
  "content": "President Trump announced on Monday that he was taking control of the District of Columbia’s police and deploying the National Guard.\n\nTrump portrayed the moves, which will involve around 800 National Guard troops, as a response to high crime rates in the nation’s capital.\n\nHe said it was an attempt to “rescue” the District from “bloodshed, bedlam and squalor.”\n\nReporters in a packed White House briefing room received handouts just before the president spoke where the District’s murder rate was shown as higher than those of other international cities including Bogota, Delhi and London.\n\nPolice statistics, however, show that crime rates in the District have fallen sharply over the past two years. Violent crime is down 26 percent when compared year-to-date against 2024. Last year, in turn, saw a 32 percent drop in homicides and a 35 percent drop in overall violent crime compared to 2023.\n\nThat being said, the total number of homicides last year, 187, was still above the years that immediately preceded 2020’s COVID-19 pandemic.\n\nHere are the main takeaways from Trump’s announcement.\n\nThe decision from Trump was more expansive than many people expected.\n\nA deployment of National Guard troops had been predicted, in part because the District’s status — short of full statehood — gives the president clear control of when the Guard is deployed.\n\nThe decision to wrest control of Washington’s police — the Metropolitan Police Department (MPD) — was a significantly larger step.\n\nThe fact that it came amid falling crime rates makes it even more controversial.\n\nSo too does the politics of the District. Voters who gave then-Vice President Harris more than 90 percent of their votes last November will have their police force taken over by a notably divisive Republican president. Trump secured fewer than seven percent of the vote in D.C.\n\nThe Home Rule Act of 1973, which gives the District its current measure of autonomy, provides for a president taking emergency control of the D.C. police for 48 hours.\n\nDuring that period, a president who wishes to extend control is supposed to provide the reasons for that decision to the chairpersons and ranking members of House and Senate committees with responsibilities for the District.\n\nDoing this enables presidential control for 30 days. Any extension beyond that, the statute says, can only come if “the Senate and the House of Representatives enact into law a joint resolution authorizing such an extension.”\n\nWhether Trump accedes to those requirements remains to be seen.\n\nDistrict of Columbia Mayor Muriel Bowser (D) was critical of Trump’s decision without intensifying her rhetoric as much as she could have.\n\nBowser called the president’s move “unsettling and unprecedented” in a news conference.\n\nShe also used the move to reiterate her belief that D.C. should be granted full statehood — a long-standing aim for many of the District’s voters.\n\nIn relation to a question about the prospect of military troops being deployed, Bowser said: “I think I speak for all Americans: We don’t believe it is legal to use the American military against American citizens on American soil.”\n\nBut Bowser struck a fairly restrained tone throughout — including on social media where she wrote: “Here’s where we stand after today’s announcement: we will follow the law, work with federal officials, and continue the work we do every single day to keep D.C. safe, beautiful, and the best city in the world.”\n\nNot everyone in city government was quite so measured.\n\nThe District’s attorney general, Brian Schwalb (D), said that Trump’s move was “unlawful” and asserted that “there is no crime emergency in the District of Columbia.”\n\nBeyond the D.C. government, Democrats, liberals and civil rights groups expressed angst over what they see as Trump’s penchant for gratuitous militarization.\n\nSen. Jack Reed (D-R.I.) said in a statement that Trump’s “ever-expanding use of the military for domestic matters is beyond alarming.”\n\nReed cited as a precursor Trump’s deployment of the National Guard and Marines in Los Angeles earlier this year — against the wishes of California Gov. Gavin Newsom (D) — saying that this showed a willingness “to deploy U.S. military forces on American streets for inflammatory and political reasons.”\n\nSen. Patty Murray (D-Wash.) accused Trump of being “an incoherent wannabe dictator who is trying to turn D.C. into his personal police state.”\n\nSen. Cory Booker (D-N.J.) contended that “using U.S. military forces to enforce a policy agenda on American soil is a gross abuse of power that reeks of authoritarianism.”\n\nAmong the broader criticism, Monica Hopkins, the executive director of the D.C. chapter of the American Civil Liberties Union (ACLU) called Trump’s move, “political theater and a blatantly phony justification for abuse of emergency powers.”\n\nIt’s unclear where things go from here\n\nEven amid all the words on both sides, there is a lot of uncertainty.\n\nOne obvious question is whether Trump will fulfill the demands of the Home Rule Act, in terms of informing Congress about the reasons for his decision to take control of the police, and in ceding back control of the MPD after no more than 30 days.\n\nAnother issue is where exactly the National Guard or other federally-commanded troops will be deployed.\n\nTrump has focused on tourist-friendly areas being besmirched by crime. But in fact Washington’s worst crime rates by far are found in the economically deprived neighborhoods east of the Anacostia River, far from the epicenter of tourism.\n\nAnother uncertainty hangs over what the president would characterize as success. In a social media post, he insisted that crime — as well as “Savagery, Filth and Scum” — would “DISAPPEAR” from D.C.\n\nPresumably he doesn’t consider literally zero crime to be an achievable goal. Does any crime at all amount in his mind to justification for maintaining federal control?\n\nThe news conference wasn’t all about D.C.\n\nDuring Monday’s news conference, Trump took questions on other topics.\n\nThe most interesting moments came when he discussed his upcoming meeting with Russian President Vladimir Putin, scheduled for Friday in Alaska.\n\nTrump’s tone suggested a new turn against Ukrainian President Volodymyr Zelensky. Trump and Vice President Vance berated Zelensky during an Oval Office meeting in late February but more recently the president had seemed to be putting pressure on Putin.\n\nThat changed back Monday, when Trump once again appeared to blame Zelensky for the war, which was in fact started by Russia’s 2022 invasion.\n\n“I get along with Zelensky but, you know, I disagree with what he’s done — very severely disagree,” Trump said. “This is a war that should have never happened.”\n\nA deadline Trump had set for new sanctions on Russia expired on Friday without action being taken.\n\nAll in all, Trump’s latest shift will please Moscow and discomfort Kyiv.",
  "medium": "Article",
  "links": [
    "https://dccouncil.gov/wp-content/uploads/2018/11/Home-Rule-Act-2018-for-printing-9-13-182.pdf"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "President Trump",
      "weight": 0.08923806
    },
    {
      "name": "Trump",
      "weight": 0.08510054
    },
    {
      "name": "crime rates",
      "weight": 0.07128926
    },
    {
      "name": "high crime rates",
      "weight": 0.06996401
    },
    {
      "name": "falling crime rates",
      "weight": 0.06896802
    },
    {
      "name": "National Guard troops",
      "weight": 0.063900374
    },
    {
      "name": "Violent crime",
      "weight": 0.06317061
    },
    {
      "name": "crime",
      "weight": 0.06239852
    },
    {
      "name": "District",
      "weight": 0.06193089
    },
    {
      "name": "emergency control",
      "weight": 0.06112925
    }
  ],
  "topics": [
    {
      "name": "Administration"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.970703125
    },
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.9462890625
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.90771484375
    },
    {
      "name": "/News/Other",
      "score": 0.40625
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.373291015625
    },
    {
      "name": "/Law & Government/Military/Other",
      "score": 0.3037109375
    }
  ],
  "sentiment": {
    "positive": 0.036105026,
    "negative": 0.7825861,
    "neutral": 0.18130879
  },
  "summary": "President Trump has announced that he will take control of the District of Columbia's police and deploys the National Guard due to high crime rates in the city. The move was more expansive than many people expected due to the District's status as short of full statehood giving the president clear control of when the Guard is deployed. The Home Rule Act of 1973 allows for a president to take emergency control of D.C. police for 48 hours, but any extension beyond this can only be granted if the Senate and House of Representatives approve a joint resolution authorizing such an extension. Critics, including Democrats, Democrats, and civil rights groups, expressed concern over the potential use of military forces on American soil. The District's attorney general, Brian Schwalb, called the move \"unlawful\" and stated that there is no crime emergency in the district.",
  "shortSummary": "President Trump's decision to take control of DC police and deploy the National Guard amid high crime rates raises concerns about civil liberties and full statehood.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "8958667c46af40d58ecc1b059b197f3e",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "President Trump announced he would take control of the D.C. police and deploy around 800 National Guard troops, citing high crime rates in the capital. However, police statistics indicate that crime has significantly decreased in recent years, making Trump's actions controversial, particularly given the political dynamics in D.C. Mayor Muriel Bowser criticized the decision as \"unsettling and unprecedented,\" while other officials and civil rights groups condemned it as an unlawful militarization of domestic affairs. The future of Trump's control over the police and the National Guard's deployment remains uncertain.",
  "argos_id": "KKM7J3F6D"
}