{
  "url": "https://www.theguardian.com/world/2025/aug/11/palestinian-reporters-killed-and-foreigners-barred-in-israels-battle-for-gaza-narrative",
  "authorsByline": "Emma Graham-Harrison",
  "articleId": "dd3b8ee89d2141559e4b249525509d3d",
  "source": {
    "domain": "theguardian.com",
    "paywall": false,
    "location": {
      "country": "gb",
      "city": "London",
      "coordinates": {
        "lat": 51.5073219,
        "lon": -0.1276474
      }
    }
  },
  "imageUrl": "https://i.guim.co.uk/img/media/d23f1fb683424c0d9cb80073c77d7ec13949658a/0_0_4856_3885/master/4856.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=7d26918c7baa3c4ff98d4440e87f9290",
  "country": "gb",
  "language": "en",
  "pubDate": "2025-08-11T20:56:32+00:00",
  "addDate": "2025-08-11T21:50:47.117335+00:00",
  "refreshDate": "2025-08-11T21:50:47.117336+00:00",
  "score": 1.0,
  "title": "Palestinian reporters killed and foreigners barred in Israel’s battle for Gaza narrative",
  "description": "Reporters and influencers covering devastation are being silenced despite protection under international law",
  "content": "Israel is running two Gaza campaigns: one for military control of the strip; another for narrative control of how the world understands what happens there.\n\nIn theory, Palestinian journalists and social media influencers documenting starvation, mass killing and other Israeli war crimes in Gaza are protected civilians under international law.\n\nBut those paper protections have meant little on the ground in Gaza, by far the most dangerous place in the world to be a reporter, where more than 180 Palestinian journalists were killed in 22 months of war, according to the Committee to Protect Journalists.\n\nEven though it is illegal to target journalists, the CPJ said that over the same period 26 reporters were victims of targeted killings, which it described as murders. The most recent was the 28-year-old Al Jazeera correspondent Anas al-Sharif, killed on Sunday in his makeshift newsroom outside a hospital, along with four colleagues.\n\nPress freedom groups and journalists say those killings are part of a campaign of intimidation to shut down vital reporting, which Israel has justified internationally with smears and false claims that the targets were undercover Hamas fighters.\n\nWith international reporters barred from independent reporting in Gaza – a handful have been allowed in under Israeli military escort, but they are not allowed to move freely or speak to Palestinians – the work done by journalists in Gaza is critical.\n\n“I have no doubt that the prevention of international access, the killings of journalists, the targeting of media facilities, the punishment of [Israeli] outlets like Haaretz is part of a deliberate strategy on the part of Israel to conceal what is happening inside Gaza,” said the CPJ chief executive, Jodie Ginsberg.\n\nShe pointed to a recent incident when a BBC crew reported from a Jordanian military plane dropping humanitarian aid into Gaza – but was barred by Israel from filming the devastation below.\n\n“We had the example of the international news crews being allowed to film the airdrops but not the devastation when the doors opened.”\n\nIn July, al-Sharif, one of the most prominent journalists still working in Gaza, went viral on social media when he broke down on air covering starvation. Passersby urged him to keep going because he gave Gaza a voice.\n\nSoon after, an Israeli military spokesperson revived allegations – first aired in 2024 – that he was a militant, including accusing him of faking mass hunger in a “false Hamas campaign on starvation”.\n\nThe CPJ issued a stark warning that those Israeli claims were a death threat.\n\n“These latest unfounded accusations represent an effort to manufacture consent to kill al-Sharif,” CPJ regional director Sara Qudah said at the time. “This is not the first time al-Sharif has been targeted by the Israeli military, but the danger to his life is now acute.”\n\nAl-Sharif had also anticipated his own death and described it as retaliation for his reporting in a statement released on social media. “If these words reach you, know that Israel has succeeded in killing me and silencing my voice,” he wrote.\n\nIsrael has published a dossier of documents it says were recovered from Gaza and link al-Sharif to Hamas. They end in 2021, two years before the war began, and do not even attempt to address his regular appearances live on camera.\n\nA role as one of the most prominent journalists in one of the most closely surveilled places on Earth would be strikingly difficult to combine with command of a Hamas unit during an all-out war.\n\nDocuments Israel published after killing another Al Jazeera journalist last year claimed Ismail al-Ghoul was given a military rank when he was 10 years old.\n\nWhile they marshalled contradictory and unconvincing evidence, the existence of those files reflected Israeli concerns about pressure from western allies, and the need for at least the appearance of compliance with international law.\n\nDespite international pressure, Israel has not offered any explanation for the deaths of al-Sharif’s four colleagues, protected civilians killed in their workplace. Ginsberg said she feared that was a warning that already unimaginable risks had escalated further.\n\n“What’s astonishing to me is they’ve not even attempted to justify the other killings,” she said. “So they’re admitting to murdering those journalists, knowing they were journalists.\n\n“I think this is deliberately intended to have a chilling effect to show that Israel can do what it likes, and nobody will take any action.\n\n“If we are now at a stage where Israel can so brazenly target an entire news crew, what does that mean for the safety of any of the other journalists who are operating there. Who is next?”\n\nFrench historian Jean-Pierre Filiu, given rare permission to enter Gaza for academic research during the conflict, said a month researching there had also convinced him that Israel is trying to silence reporting from Gaza.\n\n“Now I understand why Israel is denying the international press access to such an appalling scene,” he said in an interview with Haaretz after the trip. “Even though I have been in a number of war zones in the past, from Ukraine to Afghanistan, via Syria, Iraq and Somalia, I have never, but never, experienced anything like this.”",
  "medium": "Article",
  "links": [
    "https://pressgazette.co.uk/news/robert-peston-leads-jewish-journalists-call-for-media-access-into-gaza/#:~:text=The%20new%20open%20letter%2C%20shared,and%20listeners%20accurately%20and%20impartially%E2%80%9D.https://pressgazette.co.uk/news/robert-peston-leads-jewish-journalists-call-for-media-access-into-gaza/%23:~:text=The%20new%20open%20letter%2C%20shared,and%20listeners%20accurately%20and%20impartially%E2%80%9D.",
    "https://cpj.org/2025/07/cpj-calls-for-anas-al-sharifs-protection-in-face-of-israeli-smears/https://cpj.org/2025/07/cpj-calls-for-anas-al-sharifs-protection-in-face-of-israeli-smears/",
    "https://www.bbc.com/news/videos/clyj4gnzxgno",
    "https://www.haaretz.com/israel-news/2025-07-05/ty-article-magazine/.highlight/now-i-understand-why-israel-is-denying-journalists-access-to-the-appalling-scene-in-gaza/00000197-d952-da1d-a5ff-f95612dd0000",
    "https://cpj.org/2023/10/journalist-casualties-in-the-israel-gaza-conflict/https://cpj.org/2023/10/journalist-casualties-in-the-israel-gaza-conflict/",
    "https://rsf.org/en/ismail-al-ghouls-killing-targeted-and-discredited-palestinian-journalists-suffer-double-punishment",
    "https://www.theguardian.com/world/2023/dec/12/hugely-frustrating-international-media-seek-to-overcome-gaza-banhttps://www.theguardian.com/world/2023/dec/12/hugely-frustrating-international-media-seek-to-overcome-gaza-ban",
    "https://www.theguardian.com/world/2025/aug/10/prominent-al-jazeera-journalist-killed-in-israeli-airstrike-on-gaza",
    "https://foreignpressassociation.online/2024/01/10/statement-by-the-foreign-press-association-regarding-supreme-court-decision-january-9-2024/https://foreignpressassociation.online/2024/01/10/statement-by-the-foreign-press-association-regarding-supreme-court-decision-january-9-2024/",
    "https://www.theguardian.com/world/gaza",
    "https://cpj.org/2024/07/media-organizations-urge-israel-to-open-access-to-gaza/https://cpj.org/2024/07/media-organizations-urge-israel-to-open-access-to-gaza/",
    "https://www.theguardian.com/world/2025/aug/11/funeral-held-for-anas-al-sharif-and-other-journalists-killed-in-israeli-strike"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Palestinian journalists",
      "weight": 0.07635374
    },
    {
      "name": "Gaza narrative",
      "weight": 0.075628534
    },
    {
      "name": "Gaza",
      "weight": 0.07486193
    },
    {
      "name": "Israel",
      "weight": 0.073796056
    },
    {
      "name": "other Israeli war crimes",
      "weight": 0.073741
    },
    {
      "name": "journalists",
      "weight": 0.073381536
    },
    {
      "name": "Israeli military escort",
      "weight": 0.072377905
    },
    {
      "name": "international reporters",
      "weight": 0.064259596
    },
    {
      "name": "Israeli concerns",
      "weight": 0.0631334
    },
    {
      "name": "targeted killings",
      "weight": 0.06212582
    }
  ],
  "topics": [
    {
      "name": "Middle East"
    }
  ],
  "categories": [
    {
      "name": "World"
    }
  ],
  "taxonomies": [
    {
      "name": "/Sensitive Subjects/War & Conflict",
      "score": 0.95166015625
    },
    {
      "name": "/News/Other",
      "score": 0.94189453125
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.794921875
    },
    {
      "name": "/News/World News",
      "score": 0.7841796875
    },
    {
      "name": "/Sensitive Subjects/Death & Tragedy",
      "score": 0.74951171875
    }
  ],
  "sentiment": {
    "positive": 0.051093265,
    "negative": 0.725227,
    "neutral": 0.22367972
  },
  "summary": "Israel is running two campaigns in Gaza, one for military control and another for narrative control. The Committee to Protect Journalists (CPJ) has reported that over the past 22 months, 26 journalists were targeted in targeted killings, which they describe as murders. The most recent victim was Al Jazeera correspondent Anas al-Sharif, who was killed along with four colleagues. Press freedom groups and journalists argue these killings are part of a campaign of intimidation to shut down vital reporting. With international reporters barred from independent reporting in Gaza being allowed in under Israeli military escort, some have been allowed to move freely or speak to Palestinians. The CPJ's chief executive, Jodie Ginsberg, highlighted incidents such as a BBC crew being barred from filming the devastation below by Israel.",
  "shortSummary": "Israel's Gaza campaign has led to numerous killings of Palestinian journalists, using intimidation to conceal the truth and manipulate global media.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "68a20894531c4c9096a66e73e95d3026",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://cpj.org/2025/07/cpj-calls-for-anas-al-sharifs-protection-in-face-of-israeli-smears/https://cpj.org/2025/07/cpj-calls-for-anas-al-sharifs-protection-in-face-of-israeli-smears/",
      "text": "New York, July 24, 2025—The Committee to Protect Journalists is gravely worried about the safety of Al Jazeera Arabic’s Gaza correspondent Anas al-Sharif, who is being targeted by an Israeli military smear campaign, which he believes is a precursor to his assassination.\nThe Israel Defense Forces (IDF) Arabic spokesperson Avichay Adraee has stepped up his online attacks on al-Sharif, by falsely alleging that he is a Hamas terrorist, since the journalist cried on air while reporting on starvation in Gaza. The 28-year-old journalist has been a key source of news from Gaza for international audiences since the war began more than 650 days ago.\n“We are deeply alarmed by the repeated threats made by Israeli army spokesperson Avichay Adraee against Al Jazeera’s Gaza correspondent Anas al-Sharif and call on the international community to protect him,” said CPJ Regional Director Sara Qudah. “This is not the first time Al-Sharif has been targeted by the Israeli military, but the danger to his life is now acute. Israel has killed at least six Al Jazeera journalists in Gaza during this war. These latest unfounded accusations represent an effort to manufacture consent to kill Al-Sharif.”\nThe IDF have made unsubstantiated claims that many of the journalists they deliberately killed in Gaza were terrorists, including four Al Jazeera staff — Hamza Al Dahdouh, Ismail Al Ghoul, Rami Al Refee, and Hossam Shabat. CPJ classifies such cases as murder.\nAl-Sharif was one of six Al Jazeera journalists that the IDF accused in October 2024 of involvement with Hamas or Islamic Jihad militant groups, a claim that the Qatari-based channel rejected as “baseless.” Shabat was later killed and Talal Al Arrouqi was injured.\nTwo other Al Jazeera staff journalists – Samer Abu Daqqa and Ahmed Al-Louh — have been killed during the Israel-Gaza war, as well as eight journalists who freelanced for the channel, according to CPJ data.\n‘Real-life threat’\n“Adraee’s campaign is not only a media threat or an image destruction; it is a real-life threat,” al-Sharif told CPJ. “All of this is happening because my coverage of the crimes of the Israeli occupation in the Gaza Strip harms them and damages their image in the world. They accuse me of being a terrorist because the occupation wants to assassinate me morally.”\nIsrael is coming under increasing pressure to stop shooting Palestinians at aid distribution points and allow more food in, amid global alarm over reports of deaths from hunger and images of emaciated children.\nIn a July 24 video, Adraee accused al-Sharif of being a member of Hamas’ military wing, Al-Qassam, since 2013 and moving during the war “to work for the most criminal and offensive channel.”\nIn a July 23 video, Adraee described Al Jazeera’s reporting on starving Palestinians as “a fabricated drama starring Anas al-Sharif, who sheds crocodile tears,” while playing a clip of the journalist crying while reporting on July 20.\nIn a July 20 video, Adraee played the same footage of al-Sharif crying and accused him of “propaganda” and being part of a “false Hamas campaign on starvation.”\nOn July 12, responding to al-Sharif’s post calling for a ceasefire, Adraee described the journalist as “a mouthpiece for intellectual terrorism.”\n‘My family is also in danger’\n“I live with the feeling that I could be bombed and martyred at any moment. My family is also in danger, and I have already paid the price before,” al-Sharif told CPJ.\nIn December 2023, al-Sharif’s 90-year-old father was killed by an Israeli airstrike on their family home, weeks after the journalist received multiple telephone threats from Israeli army officers instructing him to cease coverage and leave northern Gaza.\nIn August 2024, Adraee accused al-Sharif of “presenting a lie” in his coverage of an Israeli airstrike on a school that killed dozens of displaced Palestinians.\n“This feeling is difficult and painful, but it does not push me back. Rather, it motivates me to continue fulfilling my duty and conveying the suffering of our people, even if it costs me my life,” said al-Sharif.\nIsrael has banned Al Jazeera from operating inside the country and in the West Bank.\n“These threats constitute clear incitement and an attempt to assassinate my voice, either through bombing or moral distortion. However, I will not stop conveying the truth,” al-Sharif said.\nIn response to CPJ’s email query, the IDF’s North America Media desk referred CPJ to Adraee’s July 24 video.\nEditor’s note: This text was updated in the sixth paragraph on August 11, 2025, to correctly identify all of the eight Al Jazeera freelancers killed as journalists."
    },
    {
      "url": "https://www.theguardian.com/world/2025/aug/10/prominent-al-jazeera-journalist-killed-in-israeli-airstrike-on-gaza",
      "text": "A prominent Al Jazeera journalist who had previously been threatened by Israel has been killed along with four colleagues in an Israeli airstrike.\nAnas al-Sharif, who was one of Al Jazeera’s most recognisable faces in Gaza, was killed while inside a tent for journalists outside al-Shifa hospital in Gaza City on Sunday night. His funeral was held on Monday morning.\nSeven people in total were killed in the attack, including al-Sharif, Al Jazeera correspondent Mohammed Qreiqeh and camera operators Ibrahim Zaher, Mohammed Noufal and Moamen Aliwa, according to the Qatar-based broadcaster.\nThe Israel Defense Force admitted the strike, claiming the reporter had “served as the head of a terrorist cell in the Hamas terrorist organisation and was responsible for advancing rocket attacks against Israeli civilians and IDF forces”.\nIt claimed it had intelligence and documents found in Gaza as proof but rights advocates said he had been targeted for his frontline reporting on the Gaza war and that Israel’s claim lacked evidence.\nCalling al-Sharif “one of Gaza’s bravest journalists,” Al Jazeera said the attack was “a desperate attempt to silence voices in anticipation of the occupation of Gaza.”\nLast month Israeli IDF spokesperson Avichai Adraee shared a video of al-Sharif on X and accused him of being a member of Hamas’ military wing. At the time the UN special rapporteur on freedom of expression, Irene Khan, called it “an unsubstantiated claim” and a “blatant assault on journalists”.\nIn July, al-Sharif told the Committee to Protect Journalists (CPJ) that he lived with the “feeling that I could be bombed and martyred at any moment”.\nAfter the attack, the CPJ said it was “appalled” to learn of the journalists’ deaths.\n“Israel’s pattern of labelling journalists as militants without providing credible evidence raises serious questions about its intent and respect for press freedom,” said CPJ regional director Sara Qudah.\n“Journalists are civilians and must never be targeted. Those responsible for these killings must be held accountable.”\nThe Palestinian Journalists’ Syndicate condemned what it described as a “bloody crime” of assassination.\nIn January this year, after a ceasefire between Hamas and Israel, al-Sharif drew widespread attention when, during a live broadcast, he removed his body armour while surrounded by dozens of Gaza residents celebrating the temporary halt in hostilities.\nA few minutes before his death, al-Sharif posted on X: “Breaking: Intense, concentrated Israeli bombardment using ‘fire belts’ is hitting the eastern and southern areas of Gaza City.”\nIn a final message, which Al Jazeera said had been written on 6 April and which was posted to al-Sharif’s X account after his death, the reporter said that he had “lived through pain in all its details, tasted suffering and loss many times, yet I never once hesitated to convey the truth as it is, without distortion or falsification.”\n“Allah may bear witness against those who stayed silent, those who accepted our killing, those who choked our breath, and whose hearts were unmoved by the scattered remains of our children and women, doing nothing to stop the massacre that our people have faced for more than a year and a half,” he continued.\nThe 28-year-old leaves behind a wife and two small children. His father was killed by an Israeli strike on the family home in Jabalia refugee camp in Gaza City in December 2023. At the time al-Sharif said he would continue to report and refused to leave northern Gaza.\nAnother Al Jazeera journalist in Gaza, Hani Mahmoud, said: “This is perhaps the hardest thing I’m reporting about the past 22 months. I’m not far from al-Shifa hospital, just one block away, and I could hear the massive explosion that took place in the past half an hour or so, near al-Shifa hospital.\n“I could see it when it lit up the sky and, within moments, the news circulated that it was the journalist camp at the main gate of the al-Shifa hospital.”\nAl-Sharif and his colleagues have been reporting from Gaza since the beginning of the conflict.\n“It’s important to highlight that this attack is just a week after an Israeli military official directly accused Anas and directly ran a campaign of incitement on Al Jazeera and correspondents on the ground because of their work, because of their relentless reporting on the starvation and the famine and the malnutrition,” Mahmoud added.\nIsrael has killed multiple Al Jazeera journalists and members of their families, including Hossam Shabat, who was killed in March, and Ismail al-Ghoul and his cameraman Rami al-Rifi, who were killed in August.\nChief correspondent Wael al Dahdouh’s wife, son, daughter and grandson were killed in October 2023 and he himself was injured in an attack weeks later that killed Al Jazeera cameraman Samer Abu Daqqa.\nIsrael, which does not allow foreign journalists into Gaza and which has targeted local reporters, has killed 237 journalists since the war started on 7 October 2023, according to Gaza’s government media office. The Committee to Protect Journalists said at least 186 journalists have been killed in the Gaza conflict. Israel denies deliberately targeting journalists.\nWith Reuters and Agence France-Presse"
    },
    {
      "url": "https://rsf.org/en/ismail-al-ghouls-killing-targeted-and-discredited-palestinian-journalists-suffer-double-punishment",
      "text": "Ismail al-Ghoul's killing: targeted and discredited, Palestinian journalists suffer double punishment in Gaza\nOn 31 July, Al Jazeera journalists Ismail al-Ghoul and Rami al-Rifi were killed while reporting in Gaza. The next day, the Israeli army claimed that al-Ghoul was part of the military wing of Hamas, with whom the IDF is at war. This is not the first time the Israel Defence Forces (IDF) have used this accusation to justify attacks against journalists without providing any substantial evidence. Reporters Without Borders (RSF) calls for an independent investigation of these killings and for Israel to stop targeting journalists. More than 130 media professionals have been killed in Gaza by the Israeli army since 7 October, including at least 31 while doing their job.\nWhen questioned about targeting journalists, the Israeli army usually replies that these accusations “are false,” despite mounting evidence to the contrary. Yet the day after their attack on Ismail al-Ghoul’s car, the army took responsibility for killing the 27-year-old, stating on X (formerly Twitter) that it had eliminated a “terrorist” and “journalist.” Since then, the IDF’s official position has consisted of accusations discrediting al-Ghoul – without mentioning his cameraman Rami al-Rifi, who was also killed in the attack – based on insufficient, questionable evidence, according to RSF’s analysis.\nThe IDF identified al-Ghoul as a member of the military wing of Hamas, the militant Palestinian group governing the Gaza strip, claiming he was a “terrorist” working for Nukhba, Hamas’ elite unit. The IDF alleges that took part in Hamas’ attack on Israel on 7 October 2023. To back up these claims, the IDF publicly released a screenshot of a list of names that dates to 2021 and was “found on Hamas computers seized in the Gaza Strip,” according to their official statement. The IDF claims this document shows that, in 2021, “Mr. al-Ghoul was an engineer in the Hamas Gaza brigade.” When RSF asked for more details on the origins of this document, the IDF merely reiterated that the computer had been found in the Gaza Strip. When asked about al-Ghoul's role in “disseminating attacks against Tsahal [IDF] troops,” the IDF replied that this was intelligence information. Nonetheless, the IDF continued to accuse al-Ghoul of participating in the attack on 7 October without providing any proof, merely stating that if someone is a member of Hamas’ military wing, they are a legitimate target even if they are also a journalist for Al Jazeera.\nWithout sufficient evidence for these accusations, the deliberate strike on al-Ghoul’s car is “an obvious war crime,” according to Rafaëlle Maison, a law professor at the University of Paris XI who specialises in international criminal justice. \"Even if this journalist had been an engineer for Hamas in 2021, it does not justify targeting him three years later. This document is clearly insufficient evidence for targeting him, as he was sporting the gear designed to protect journalists and was clearly engaged in journalistic activity,\" she explained. According to the Geneva Convention, al-Ghoul would have lost his rights to protection as a civilian and, more specifically, as a journalist, if he “took a direct part in hostilities during that period, which is clearly not the case,” said Maison.\n“The targeted killing of Al Jazeera correspondent Ismail al-Ghoul is one of the most shocking examples of impunity we have witnessed in the war in Gaza. Israeli forces have acknowledged directly targeting a journalist - an act that constitutes a war crime - and justified this attack by accusing al-Ghoul of terrorism, without legitimate evidence. No acknowledgement or explanation has been given for the killing of cameraman Rami al-Rifi alongside al-Ghoul. This outrageous act brings the tally of journalists killed in Gaza even higher, and leaves even fewer able to continue doing their jobs reporting on the war. There must be accountability for these heinous crimes, and the endless slaughter of journalists must stop without delay.\nIsmail al-Ghoul, Palestinian correspondent for the Qatari channel Al Jazeera since November 2023, was one of the few journalists still present in the north of the Gaza Strip, which is inaccessible to foreign journalists. On 31 July, al-Ghoul had just finished a live report from outside the house of Ismail Haniyeh, a Hamas leader assassinated earlier that day in Tehran, when he contacted Al Jazeera’s editorial team to inform them that he and al-Rifi were evacuating the area as they’d heard a bombardment nearby, according to Raed Fakih, manager of input for Al Jazeera’s news directorate. After several minutes without any news, the channel tried to contact al-Ghoul without success. “Our other correspondent, Anas al-Sharif, reported that there were rumours Ismail had been targeted,” Fakih told RSF.\nIn a video of the strike posted on social media, the panicked cries of freelance journalist Osama al-Ashi can be heard echoing down the street. Al-Ashi runs towards a smoking car where people begin to gather. \"I knew it was Ismail. I know his jacket and car by heart,” al-Ashi told RSF. The camera then shows the inside of the vehicle, where the bodies of Ismail al-Ghoul and Rami al-Rifi are unrecognisable, decapitated by the force of the impact. Yet al-Ghoul’s blue jacket bearing the word “press” is clearly visible.\nNumerous inconsistencies\nA number of inconsistencies in the IDF’s allegations, made the day following the attack, were quickly pointed out. Firstly, Fakih notes that al-Ghoul was held and interrogated for 12 hours in March 2024. Al-Ghoul reported that his arresting officer called him by name, “making it clear that they knew they had arrested Ismail al-Ghoul,” argued Fakih. “If he were indeed a terrorist, as they claim, why would they release him?” When questioned about these events, the Israeli army denied the facts and stated that al-Ghoul had never been arrested.\nWhat’s more, according to the IDF’s screenshot of the list of names, al-Ghoul received a military rank on 1 July 2007, when he was 10 years old. Strangely, another column on the list shows that he was recruited in 2014. When asked about this, the Israeli army said it was not responsible for the inconsistencies in a Hamas document. According to Fakih, “The document also contradicts the initial claim that he was part of an elite force and states that he was part of the engineering group. A minor who is an engineer? But, anyway, was he a member of the elite force or an engineer at the age of 16-17?\"\nTwo political and academic experts on Hamas – who wish to remain anonymous – stressed to RSF that it seems unlikely for Ismail al-Ghoul to have been recruited at such a young age, even if he had joined the group in 2014. One expert explained that, while the movement created summer camps in the past, “I don't believe that is a kind of recruitment or that you would become a member of Hamas.” Joining an elite unit like the Nukhba involves several years of training and tests, and recruitment usually takes place around the age of 20, the two experts added.\nAs for the document's authenticity, one of the experts stated they had never seen a similar list in the history of their research on Hamas. This does not mean that no such documents exist, yet all the experts interviewed by RSF for this article shared the same conclusion: the document could be genuine but, without further details or contextual elements, these accusations are highly uncertain. “When such documents are released with claims of membership in Hamas, Palestinian Islamic Jihad, etc., we seldom receive the entire document [...] or other types of documentation to corroborate and so on. In other words, we have to chose taking Israeli claims and alleged evidence at face value,” one expert explained.\nIrene Khan, the United Nations Special Rapporteur on the promotion and protection of the right to freedom of opinion and expression, strongly condemned the attack and the charge brought against al-Ghoul. “The Israeli military seems to be making accusations without any substantive evidence as a licence to kill journalists, which is in total contravention of international humanitarian law,” she said in a statement published on 6 August.\nRecurring accusations\nThis is not the first time Israel has published poorly substantiated documents to justify the targeted killings of journalists. In January 2024, after the deaths of Hamza al-Dahdouh and Mustafa Thuraya – journalists for Al Jazeera who were killed when a drone attack targeted their vehicle while they were working in Rafah – the Israeli army claimed the reporters were affiliated with the Palestinian Islamic Jihad (PIF) and Hamas, respectively.\nAs in the case of al-Ghoul, Israel did not provide any further details about the document incriminating al-Dahdouh, and did not release the document incriminating Thuraya. “It's a pattern with the Israelis that, after targeting our journalists, they release conflicting accounts and make baseless accusations to justify their unjustifiable actions — killing journalists who are working to cover the realities on the ground. This was the case with Shireen Abu Akleh, Samer Abu Daqqa and Hamza al-Dahdouh,” said Fakih.\nMore recently, Anas al-Sharif, another Al Jazeera correspondent who was close to al-Ghoul, - was condemned by an IDF spokesperson, who used the familiar claim that the Al Jazeera reporter was both a “journalist” and a “terrorist.” On 10 August, on X, in the wake of the strike against the Tabi'een school in central Gaza that killed at least 80 people, the spokesperson accused al-Sharif of “covering up the crimes of Hamas and jihad terrorists hiding in schools,” and that al-Sharif “probably knew many of the people killed in this school.” Al Jazeera strongly condemned these accusations against its journalists.\nAl Jazeera has brought these cases to international courts, and hopes “to obtain justice, reveal the truth, and ensure protection,” according to Fakih. As no international media can access Gaza to cover the war, Al Jazeera is all the more determined to demand justice for the journalists who live and work there but cannot leave. “At this point, we can only strive to push Israel to adhere to its moral and legal obligations regarding the principle of press freedom and the protection of journalists,” said Fakih.\nRSF has filed three complaints with the International Criminal Court (ICC) calling for investigations into crimes committed against Palestinian journalists. In a statement to RSF dated 5 January 2024, the ICC Prosecutor's Office assured RSF that \"crimes against journalists are being examined by the Prosecutor's Office, among other potential crimes, as part of the ongoing investigation into the situation in the State of Palestine, and RSF's objectives and actions must be supported and are of crucial importance in Gaza and elsewhere. Journalists are protected by international humanitarian law and the Rome Statute and must not under any circumstances be targeted in the exercise of their important mission.”\nTo date, more than 130 media professionals have been killed by the Israeli army in Gaza since 7 October; at least 31 were killed while doing their job."
    },
    {
      "url": "https://cpj.org/2024/07/media-organizations-urge-israel-to-open-access-to-gaza/https://cpj.org/2024/07/media-organizations-urge-israel-to-open-access-to-gaza/",
      "text": "New York, July 11, 2024—More than 70 media and civil society organizations have signed an open letter urging Israel to give journalists independent access to Gaza.\nThe organizations—which include the Associated Press, Agence France-Presse, BBC, CNN, The Guardian, The New York Times, and The Washington Post—point out that no independent media access to Gaza has been permitted since the start of the war, increasing the pressure on domestic journalists, and creating a space for mis- and disinformation to flourish.\n“More than 100 journalists have been killed since the start of the war and those who remain are working in conditions of extreme deprivation. The result is that information from Gaza is becoming harder and harder to obtain and that the reporting which does get through is subject to repeated questions over its veracity,” the organizations say in the letter, which was coordinated by the Committee to Protect Journalists.\nThe letter comes ahead of a planned visit by Israeli Prime Minister Benjamin Netanyahu to the United States, where he is set to meet with U.S. President Joe Biden and address the U.S. Congress on July 24.\nCPJ CEO Jodie Ginsberg noted: “President Netanyahu describes Israel as a democracy. His actions with regard to the media tell a different story. International, Israeli, and Palestinian journalists from outside Gaza should be given independent access to Gaza so they can judge for themselves what is happening in this war—rather than being spoon-fed with a handful of organized tours by the Israeli military.”\nIn addition to news outlets, the signatories—who span more than 27 countries—include professional groups and organizations dedicated to defending press freedom.\nAbout the Committee to Protect Journalists\nThe Committee to Protect Journalists is an independent, nonprofit organization that promotes press freedom worldwide. We defend the right of journalists to report the news safely and without fear of reprisal.\nRead the full letter below\nWe, the undersigned, request that Israeli authorities end immediately the restrictions on foreign media entering Gaza and grant independent access to international news organizations seeking to access the territory.\nNine months into the war, international reporters are still being denied access to Gaza except for rare and escorted trips arranged by the Israeli military. This effective ban on foreign reporting has placed an impossible and unreasonable burden on local reporters to document a war through which they are living. More than 100 journalists have been killed since the start of the war and those who remain are working in conditions of extreme deprivation. The result is that information from Gaza is becoming harder and harder to obtain and that the reporting which does get through is subject to repeated questions over its veracity.\nWe fully understand the inherent risks in reporting from war zones. These are risks that many of our organizations have taken over decades in order to investigate, document developments as they occur, and understand the impacts of wars the world over.\nA free and independent press is the cornerstone of democracy. We ask that Israel uphold its commitments to press freedom by providing foreign media with immediate, independent access to Gaza, and that Israel abides by its international obligations to protect journalists as civilians.\nSignatories\n- ABC News, United States\n- Agence France-Presse, France\n- Al-Araby Al-Jadeed\n- Alternative Press Syndicate, Lebanon\n- Arab Reporters for Investigative Journalism\n- Asian American Journalists Association, United States\n- Associated Press, United States\n- Association for International Broadcasting, United Kingdom\n- Association of Foreign Press Correspondents, United States\n- Bangladeshi Journalists in International Media, Bangladesh\n- BBC News, United Kingdom\n- Bianet, Turkey\n- Bloomberg News, United States\n- CBS News, United States\n- CNN Worldwide, United States\n- CONNECTAS\n- Community Media Forum Europe, Belgium\n- CTV News, Canada\n- Daily Maverick, South Africa\n- Daraj, Lebanon\n- Denik Referendum, Czech Republic\n- European Broadcasting Union, Switzerland\n- European Federation of Journalists\n- Financial Times, United Kingdom\n- Forbidden Stories, France\n- fotosintesi.info, Italy\n- Free Press Unlimited, The Netherlands\n- Global Investigative Journalism Network\n- Global Reporting Centre, Canada\n- International Association of Women in Radio and Television\n- International Center for Journalists, United States\n- International Fund for Public Interest Media\n- International Media Support, Denmark\n- International News Safety Institute, United Kingdom\n- International Women’s Media Foundation, United States\n- ITN, United Kingdom\n- Le Mauricien, Mauritius\n- McLatchy, United States\n- Media Development Center, Tunisia\n- Media Diversity Institute, United Kingdom\n- Middle East Eye\n- National Association of Hispanic Journalists, United States\n- National Press Club, United States\n- National Union of Journalists of the Philippines, The Philippines\n- NBC News, United States\n- Nieman Foundation for Journalism, Harvard University, United States\n- NPR, United States\n- Organized Crime and Corruption Reporting Project\n- Premium Times, Nigeria\n- Prospect Magazine, United Kingdom\n- Public Media Alliance\n- Pulitzer Center on Crisis Reporting, United States\n- Rory Peck Trust, United Kingdom\n- RTÉ News & Current Affairs, Ireland\n- Rural Media Network, Pakistan\n- Sky News, United Kingdom\n- SMN24Media, Sri Lanka\n- Somali Media Women Association, Somalia\n- Sveriges Radio, Sweden\n- The Bureau of Investigative Journalism, United Kingdom\n- The Foreign Press Association, Israel and the Palestinian Territories\n- The Guardian, United Kingdom\n- The Irish Times, Ireland\n- The New Arab\n- The New York Times, United States\n- The Washington Post, United States\n- Twala, Algeria\n- Vocento, Spain\n- VRT News, Belgium\n- Wattan Media Network, Palestine\n- World Association for Christian Communication\n- World Association of News Publishers (WAN-IFRA), Germany\n- Yle News and Current Affairs, Finland"
    },
    {
      "url": "https://www.theguardian.com/world/2025/aug/11/funeral-held-for-anas-al-sharif-and-other-journalists-killed-in-israeli-strike",
      "text": "The death of the prominent Al Jazeera journalist Anas al-Sharif, killed along with four colleagues in an Israeli airstrike on Sunday, prompted condemnation from around the world, as hundreds of mourners carried their bodies through the streets of Gaza City.\nSharif, one of Al Jazeera’s most recognisable faces in Gaza, was killed while inside a tent for journalists outside al-Shifa hospital in Gaza City on Sunday night. Seven people were killed in the attack, including the Al Jazeera correspondent Mohammed Qreiqeh and the camera operators Ibrahim Zaher, Mohammed Noufal and Moamen Aliwa, according to the Qatar-based broadcaster.\nOn Monday, the Guardian visited the site where the journalists were killed. Wadi Abu al-Saud, a Palestinian journalist who was near the tent when the Israeli strike occurred on Sunday, said the attack happened at 11.22pm, just after he had finished filming his latest news bulletin.\n“I entered the tent opposite theirs, raised my phone to make a call, and then the explosion occurred, Saud said. “A piece of shrapnel hit my phone. I looked back and saw people burning in flames. I tried to extinguish them. Anas and the others had died instantly from the strike.”\nIn two videos of the aftermath of the strike, Saud can be seen carrying the bodies of those killed. “From now on, I will not continue the coverage,” he said. “I will return to my life as a citizen. The truth has died and the coverage has ended.”\nThe Israel Defense Forces (IDF) admitted carrying out the attack, claiming Sharif was the leader of a Hamas cell responsible for rocket attacks against Israel – an allegation that Al Jazeera and Sharif had previously dismissed as baseless.\nIt was the first time during the war that Israel’s military has swiftly claimed responsibility after a journalist was killed in a strike.\nPro-Israel advocates on social media hailed the killing of Sharif and posted photos handed out by the IDF of photos the journalist took with the former Hamas leader Yahya Sinwar, taken before Hamas’s attack on 7 October.\nSara Qudah, the Middle East and north Africa director at the Committee to Protect Journalists (CPJ), said: “Israel’s pattern of labelling journalists as militants without providing credible evidence raises serious questions about its intent and respect for press freedom.”\nIn July, Sharif told CPJ that he lived with the “feeling that I could be bombed and martyred at any moment”.\nReporters Without Borders condemned the “acknowledged murder by the Israeli army” of Sharif in Gaza and called on the international community to intervene.\nKeir Starmer’s spokesperson said: “We are gravely concerned by the repeated targeting of journalists in Gaza. Reporters covering conflicts are afforded protection under international humanitarian law and journalists must be able to report independently without fear, and Israel must ensure journalists can carry out their work safely.”\nThe UN human rights office condemned the targeting of the journalists’ tent, saying it was “in grave breach of international humanitarian law”.\nAl Jazeera said the attack was “a desperate attempt to silence voices in anticipation of the occupation of Gaza” and called Sharif “one of Gaza’s bravest journalists”.\nPeople gathered at Sheikh Radwan cemetery in the heart of the Gaza Strip to mourn the journalists, whose bodies lay wrapped in white sheets at al-Shifa hospital before their burial. Friends, colleagues and relatives embraced and consoled one another.\nThe area where the attack took place was crowded with media workers on Monday, some speaking to cameras or mobile phones, others taking photos.\nIslam al-Za’anoun, a news correspondent for Palestine TV and several Arab channels who participated in the funeral, said Sunday’s attack was “a turning point in the world of journalism”.\nShe said: “Despite all the threats he received and the Israeli media’s incitement against him, al-Sharif continued reporting. Now one question haunts me: Who will be next on the list? Will it be me?”\nBilal Abu Khalifa, a presenter at Al Jazeera, said he had met Sharif four days ago. “He told me he was in danger,” Abu Khalifa said. “I asked him not to go out or appear publicly too often. He gave me a very simple answer: Bilal, I will not leave Gaza except to the sky! I will not leave Gaza even if I am killed. I know I am on the assassination list, but I will continue to expose the crimes of the Israeli army against my people and show the world, and everyone who stands by them, the truth.”\nIn a final message, which Al Jazeera said had been written on 6 April and which was posted to Sharif’s X account after his death, the reporter said he had “lived through pain in all its details, tasted suffering and loss many times, yet I never once hesitated to convey the truth as it is, without distortion or falsification.”\nHe continued: “Allah may bear witness against those who stayed silent, those who accepted our killing, those who choked our breath, and whose hearts were unmoved by the scattered remains of our children and women, doing nothing to stop the massacre that our people have faced for more than a year and a half.”\nAfter the Hamas attacks on 7 October 2023, Israel barred international journalists from entering Gaza – one of the rare moments when international reporters have been denied access to an active war zone. Since then, the task of documenting the war has fallen heavily on Palestinian journalists, often at the cost of their lives – themselves caught in its devastation, displaced multiple times, their homes reduced to rubble, friends and relatives killed, and at times queueing for food at perilous distribution points.\nAccording to Gaza’s government media office, 238 journalists have been killed by Israel since the war started. CPJ said at least 186 journalists had been killed in the Gaza conflict. Israel denies deliberately targeting journalists.\nIn a report released this year, the Watson School of International and Public Affairs’ costs of war project said more journalists had been killed in Gaza than in both world wars, the Vietnam war, the wars in Yugoslavia and the US war in Afghanistan combined."
    },
    {
      "url": "https://cpj.org/2023/10/journalist-casualties-in-the-israel-gaza-conflict/https://cpj.org/2023/10/journalist-casualties-in-the-israel-gaza-conflict/",
      "text": "The Israel-Gaza war has taken a catastrophic toll on Gazan journalists since Israel declared war on Hamas following its attack on Israel on October 7, 2023.\nAs of August 11, 2025, CPJ’s preliminary investigations showed at least 192 journalists and media workers were among the more than tens of thousands killed in Gaza, the West Bank, Israel, and Lebanon since the war began, making it the deadliest period for journalists since CPJ began gathering data in 1992.\nCPJ is investigating more than 130 additional cases of potential journalists killings, arrests, and injuries, and damage to media offices and homes, cases that remain difficult to document and verify amid these harsh conditions and devastation.\nJournalists in Gaza face extreme, often fatal, risks as they try to cover the war, including relentless Israeli airstrikes, the destruction of most of the territory’s infrastructure, the forced displacement of 90% of Gaza’s population, trauma, and widespread famine.\n“Since October 7, 2023, Palestinian journalists have been slaughtered with impunity, while the world watches. This is a direct, unprecedented assault on press freedom,” said CPJ Regional Director Sara Qudah. “Journalists cannot carry out their work — let alone survive — while being deliberately starved and denied life-saving aid. Israel must allow humanitarians, international media, and human rights investigators into Gaza at once.”\nAs of August 11:\n- 192 journalists and media workers were confirmed killed: 184 Palestinian, two Israeli, and six Lebanese.\n- 129 journalists were reported injured.\n- 2 journalists were reported missing.\n- 90 journalists were reported arrested.\n- Multiple assaults, threats, cyberattacks, censorship, and killings of family members.\nMost Palestinian journalist killings — two-thirds — were caused by Israeli airstrikes. The second most frequent cause of death was by drone strike, with more than two dozen press members killed.\nIn the days surrounding the war’s one-year anniversary on October 7, 2024, two journalists in Gaza were killed and three were injured, prompting CPJ to renew its call for an end to impunity in Israel’s attacks on journalists.\nTargeted murder of journalists\nJournalists are civilians and protected by international law. Deliberately targeting civilians constitutes a war crime.\nTo date, CPJ has determined that a total of 26 journalists and media workers were directly targeted and killed by Israeli forces, cases that CPJ classifies as murders.\nThe 24 journalists murdered are: Ahmad Qalaja, Ahmed Mansour, Anas al-Sharif, Ayman Al Gedi, Fadi Hassouna, Faisal Abu Al Qumsan, Ghassan Najjar, Hamza Al Dahdouh, Hilmi al-Faqaawi, Hossam Shabat, Ismail Al Ghoul, Ismail Baddah, Issam Abdallah, Mahmoud Islim Al-Basos, Moamen Aliwa, Mohammad al-Khaldi, Mohammed Al-Ladaa, Mohammed Noufal, Mohammed Qreiqeh, Mustafa Thuraya, Rami Al Refee, Suleiman Hajjaj, and Wissam Kassem. The two media workers are Ibrahim Sheikh Ali and Mohammed Reda Ibrahim.\nCPJ continues to investigate at least 20 other cases that show signs of possible targeting.\nIsrael Defense Forces (IDF) officials have repeatedly told media outlets that the army does not deliberately target journalists. Shortly after the war started, the IDF also told news agencies that it could not guarantee the safety of journalists operating in Gaza. CPJ has called for an end to the longstanding pattern of impunity in cases of journalists killed by the IDF.\nThe list of killed journalists documented in our database includes names based on information obtained from CPJ’s sources in the region and media reports. It includes all journalists* involved in news-gathering activity. It is not always immediately clear whether all of these journalists were covering the conflict at the time of their deaths, but CPJ has included them in its count as it investigates their circumstances.\nThe list is being updated on a regular basis, with names being removed if CPJ confirms that those members of the media were not working journalists at the time they were killed, injured, or went missing.\nThe lists below detail those injured and missing in the Israel-Gaza war:\nINJURED\nCPJ is aware that many Palestinian journalists have been injured during the war. CPJ counts the journalists’ cases it has been able to document and continues to investigate others.\nJuly 27, 2025\nIsraeli forces shot and injured Abdul Hadi Farhat, a 27-year-old correspondent for the television channel Yemen Today, in the left thigh while he covered the entry of humanitarian aid in northern Gaza.“\nI heard that Israeli forces had opened a humanitarian corridor to allow aid into the Al-Sudaniya area northwest of Gaza City. I went to document the scene, where thousands of starving Palestinians had gathered,” Farhat told CPJ. “I filmed the first aid truck arriving, and as the second came through – around 11 a.m. – soldiers opened fire and launched shells at us.”\nFarhat, a father of two, told CPJ that he bled for a long time and had to administer first aid to himself before reaching Hamad Hospital in Al-Sudaniya. From there, he was transferred to Al-Shifa hospital in western Gaza City, where he waited for two hours without treatment due to overcrowding and shortages of medical supplies. Eventually, he went to Al-Sahaba Medical Complex, where the bullet was removed and the wound stitched. He has returned home to recover.\nOn November 9, 2024, Farhat was also wounded when Israeli airstrikes hit the courtyard of Al-Aqsa Martyrs Hospital in Deir al-Balah.\nJuly 24, 2025\nAhmad Hamdan, a 26-year-old freelance photojournalist who has worked with Agence France-Presse news agency, Qatari-funded media outlets Al-Araby TV, Al Jazeera, and AJ+, and Turkish state-owned Anadolu Agency, was injured in the leg and head after an Israeli drone struck his family’s tent in western Gaza City. Several members of his family were also injured, and at least three – his uncle and two children – were killed.\nHis colleague Anas Al-Sharif, a reporter for Al Jazeera, told CPJ that Hamdan is originally from Beit Hanoun in northern Gaza and had been documenting life in the north, where few other journalists remained.\nFollowing the Israeli forces’ destruction of his Beit Hanoun home, Hamdan and his family were displaced to a tented area near the Legislative Council building in western Gaza City, where the drone strike occurred. He was transferred to the city’s Al-Shifa hospital for treatment.\nJuly 23, 2025\nGevara Safadi, a 38-year-old photographer, was injured by shrapnel from an Israeli airstrike in Gaza City’s Sheikh Radwan neighborhood. He was at home when an Israeli warplane struck a neighboring house around 6 p.m., according to his wife, Sanaa Al-Safadi.\nSafadi, who works for the satellite broadcaster Al-Kofiya TV, affiliated with the Democratic Reform Current within the Fatah Movement, also contributes to the Turkish state-owned Anadolu Agency and is the father of three daughters.\n“Our home was partially damaged, and Gevara was hit by shrapnel all over his body — most seriously in his right side,” his wife told CPJ, adding that he was taken to a neighborhood clinic for treatment and discharged an hour later to recover at home.\nJuly 22, 2025\nOsayd Mdoukh\nOsayd Mdoukh, a 38-year-old camera operator for the satellite broadcaster Al-Kofiya TV, which is affiliated with the Democratic Reform Current within the Fatah Movement, told CPJ he was injured after being run over by an aid truck entering northern Gaza.\nMdoukh, a father of three, told CPJ he had not received his $400 salary for three months due to soaring commission fees charged by money changers – sometimes as high as 50%.\n“I couldn’t feed my wife and children for nearly a month,” Mdoukh said, explaining why he went to Zikim, near the border, where limited aid convoys were entering.\n“Around noon, the trucks came in. As I reached them along with the crowds, I was run over. The truck drove over me, causing internal bleeding, fractures throughout my body, and a severe hematoma in my left thigh,” Mdoukh said.\nHe was taken to the Palestinian Red Crescent’s field hospital in central Gaza City and remained there in late July, without access to necessary treatment.\nJuly 17, 2025\nZahar Saleh, a 22-year-old Palestinian freelance photojournalist who contributes to Britain’s Channel 4 News broadcaster, was injured by Israeli drone fire in central Gaza City.\nHe had been reporting on Israel’s bombing of a church in Gaza’s Old City that morning, the journalist’s brother, Abdel Hakim Saleh, told CPJ.\n“Zaher went to document the aftermath,” he said. “After finishing his documentation, he went to a central Gaza location that offers internet access to send out his footage. Around noon, an Israeli drone fired on him, hitting him in the left thigh.”\nSaleh was transported to Jerusalem Hospital in Gaza City’s Tel al-Hawa neighborhood. He was treated for three hours and was scheduled to undergo surgery this following week, his brother told CPJ on July 17.\nJuly 15, 2025\nAkram Dalloul, a 40-year-old correspondent for the Lebanon-based broadcaster Al-Mayadeen, was injured by shrapnel from Israeli missile fire in Gaza City’s eastern neighborhood Al-Zeitoun.\nDalloul, a father of four, had just finished filming a televised report in his neighborhood around 10:30 a.m. when the area came under fire, according to his colleague, Al-Mayadeen camera operator Wissam Baalusha.\n“I went with Akram and our fellow cameraman Abdulaziz Al-Afifi to film a report for Al-Mayadeen in Al-Zaytoun, where Akram lives,” Baalusha told CPJ. “After finishing, Abdulaziz and I got into the car to leave, and Akram started walking toward his house. Moments later, Israeli artillery fired a shell. We rushed back and found Akram had been hit by shrapnel on the left side of his head. There were also multiple casualties in the area.”\nDalloul was taken to Al-Ahli Baptist Hospital in central Gaza City, where he remained as of late July.\nOn July 23, Dalloul wrote on Facebook that, despite several days of treatment, there had been no improvement in vision in his left eye, which continued to bleed; while doctors had offered some reassurances, he said, prayers remained important and he thanked God “in all circumstances.”\nJuly 7, 2025\nFadi Turban, a 27-year-old Palestinian freelance photojournalist contributing to Jordan’s Roya TV and privately owned, Qatari-based broadcaster Al Jazeera, was injured by an Israeli drone strike in Gaza’s Nuseirat refugee camp.\n“I was walking through the camp at around 11:15 p.m. when an Israeli drone struck a group of civilians,” Turban told CPJ.\nShrapnel struck his right eye, where it remains lodged, and another fragment hit his left ear and exited. He was taken to Al-Awda Hospital and Deir al-Balah’s Al-Aqsa Martyrs Hospital and Yaffa Hospital and discharged to await surgery to remove the shrapnel.\nJuly 3, 2025\nIslam Al Zaanoun, a 35-year-old Palestinian freelance journalist who contributes to multiple outlets, including Morocco’s Medi1TV and the Palestinian Authority-run Palestine TV, was shot by an Israeli drone minutes after completing a live broadcast in central Gaza City.\nAl Zaanoun, who is a mother of three, was covering Israeli operations near a camp for displaced people at the Dabait intersection in Gaza City when she was injured. “After finishing the broadcast,” she told CPJ, “I walked with the camerawoman, and after about 150 meters (164 yards), at 3:15 p.m., an Israeli drone fired directly at me and hit my right shoulder.”\nThe bullet is still lodged there, she said.\nAl Zaanoun was initially taken to Al-Shifa medical complex in western Gaza, where she was treated before being transferred to Al-Quds Hospital in Tel al-Hawa for imaging scans. She was later sent home, where she awaits surgery.\nJuly 1, 2025\nYoussef Al-Saudi\nYoussef Al-Saudi, a 23-year-old Palestinian freelance photojournalist contributing to Algeria’s state-owned broadcaster EPTV was injured by an Israeli airstrike in Gaza City’s Al-Zaytoun neighborhood.\n“I was in Al-Zaytoun covering the aftermath of an Israeli airstrike on a house at around 5 p.m., when another missile struck a nearby location. Stones and shrapnel hit my head and left foot,” he told CPJ, adding that he was treated briefly at the Al-Ahli Baptist Hospital. “I left the hospital quickly to resume my work.”\nAl-Saudi was previously wounded in an Israeli airstrike on the Al-Shuja’iya neighborhood in eastern Gaza City on January 3, 2025.\nAbu Al-Saud, a 33-year-old correspondent for Houthi-controlled Yemen TV and a father of four, was injured by an Israeli airstrike near a mobile phone charging station in western Gaza City.\n“The Israeli army had threatened to strike a nearby residential building. While heading there, they struck the charging point,” Abu Al-Saud told CPJ. “A piece of shrapnel hit my left hand.”\nHe was treated at Al-Shifa Hospital without anesthesia due to lack of supplies and discharged two hours later.\nAbu Al-Saud was previously injured on August 15, 2024.\nJune 30, 2025\nFreelance journalist Bayan Abusultan was injured in an Israeli airstrike that targeted Al-Baqa Café, a popular beachfront location in western Gaza City known to host local journalists and residents. The strike, which occurred around 2:50 p.m., killed more than 20 civilians, including Palestinian filmmaker and photojournalist Ismail Abu Hatab, according to photographer Majdi Fathi, who was nearby at the time and spoke to CPJ.\nAbusultan, who is widely known for posting news from Gaza on her social media accounts, was hit by shrapnel in her chest and head, Fathi said. Photos from the scene show Abusultan visibly wounded, walking through the aftermath of the blast.\nCPJ contacted Abusultan for comment following the attack, but she declined to speak. She later published a detailed personal account on her Facebook page describing the moments leading up to and following the strike. She said she had been “sitting at a table next to journalist Ismail Abu Hatab shortly before the airstrike.” Abusultan described crawling under a table for cover while a friend shielded her from shrapnel.\n“I turned my head and saw a leg without a body,” she wrote. “A girl next to me was trying to speak, but she died before saying anything.”\nWhen she stood up, Abusultan saw that Abu Hatab and artist Frances Salmi had been killed. She said that she only realized she was injured when she tried to lift her bag and felt a sharp pain in her shoulder.\nMohammed Nabil Rafiq Skaik\nMohammed Skaik, a 40-year-old Palestinian freelance camera operator and video editor who works with the privately owned, Qatari-based broadcaster Al Jazeera English and Nawa Network, a news site published by the Palestinian NGO Filastiniyat, was injured by shrapnel from an Israeli strike in Deir al-Balah.\nSkaik told CPJ he was sitting inside a journalists’ tent at Al-Aqsa Martyrs Hospital around 11:30 a.m. when an Israeli drone hit a nearby displaced persons’ tent.\n“I stood up to film, felt pain, and a colleague found shrapnel lodged near my spine,” he said, adding that he was treated briefly at Al-Aqsa and Yaffa hospitals.\nJune 27, 2025\nAlhesi, 32, a correspondent for the privately owned, Qatari-based broadcaster Al Jazeera Mubasher, was injured by Israeli airstrikes on a residential building in western Gaza City, along with two other journalists.\nAlhesi, a father of two, told CPJ that he had parked his car and was about to get out when the missiles struck. Video showed him sitting behind the wheel, looking dazed.\n“Shrapnel struck the entire left side of my bodyーmy hand, back, and leg,” he told CPJ, adding that he spent five hours receiving treatment at the city’s Al-Shifa Hospital.\nMohammed Hammo\nMohammed Hammo, a 37-year-old correspondent for the Saudi news channels Al Arabiya and Al Hadath and a father of three, was inside a café about 50 meters from the residential building that was hit.\n“The area was considered safe by the occupation [Israel],” he told CPJ, referring to part of Gaza designated by the Israeli military as a safe zone, which has shrunk to about one-tenth of the territory.\nHammo sustained shrapnel wounds to his left leg and received on-site medical treatment.\nMamdoh Al Sayed\nMamdoh Al Sayed, a 42-year-old camera operator for Al Arabiya and Al Hadath and a father of three, was struck by shrapnel in the back while inside the same café. He received field treatment.\nThe team’s driver, Mohammed Abu Hajar, also sustained bruises across his body.\nAbu Alshaar, a 42-year-old Palestinian freelance journalist for the privately owned, Qatari-based broadcaster Al Jazeera Mubasher and Britain’s BBC, was injured by shrapnel from an Israeli strike near Al-Ahli Baptist Hospital in central Gaza.\n“I was walking outside the hospital at 5:30 p.m. when the drone targeted a group nearby,” he told CPJ. “I continued filming, then felt pain, and discovered a piece of shrapnel lodged in my thigh.”\nHe was treated and discharged after three hours.\nAbu Alshaar was previously injured on January 14, 2025, when an Israeli airstrike hit his family home in the Al-Daraj neighborhood of central Gaza City around 9 a.m.\n“Without warning, warplanes bombed our house. I was hit in the head by flying debris, my baby was wounded, and my mother too. Six of my nieces and nephews were killed, along with my brother-in-law who had been sheltering with us,” he told CPJ, adding that he was treated at Al-Ahli Baptist Hospital and discharged the same day.\nJune 9, 2025\nAbu Armana, a 38-year-old freelance photographer and a father of two who works with the privately owned Qatari-based broadcaster Al Jazeera Mubasher, was injured by an Israeli strike in Al-Mawasi, west of Khan Yunis.\n“I was in what the Israeli army calls a safe zone, when a drone hit a displaced person’s tent around noon,” Abu Armana told CPJ. “I sustained shrapnel injuries to my left hand, shattering the joint and damaging nerves.”\nHe was treated at a Red Cross field hospital and transferred to Nasser Hospital, where he received X-rays and was discharged four hours later.\nHe was previously injured on October 14, 2024.\nJune 5, 2025\nRamadan Abu Sakran, a 32-year-old freelance journalist and photographer for Al Araby TV and Al Jazeera Mubasher, was injured when an Israeli drone strike hit a group of journalists at Al-Ahli Baptist Hospital in central Gaza City.\n“The Israeli drone targeted a table where several journalists were sitting in the courtyard of Al-Ahli Baptist Hospital,” Abu Sakran, a father of three, told CPJ. “I suffered a minor injury to my hand, received treatment at the hospital, and was discharged shortly after.”\nHe was previously injured:\n- On January 28, 2024, by Israeli forces shelling the United Nations Development Programme shelter center in western Gaza City, where he had taken refuge overnight. Abu Skran told CPJ he sustained shrapnel wounds to the intestines and colon, and a gunshot wound to his left shoulder that resulted in partial loss of the shoulder and nerve damage. He said he received initial assistance from family and friends at the shelter until 6 a.m., when he was transferred to Al-Shifa hospital and then to Al-Ahli Baptist Hospital.\n- On October 7, 2023, by Israeli shelling outside his home in Gaza City. Abu Sakran said he was wounded in the head and his brother was killed. Due to the high number of casualties at the time, he was treated on-site.\nCPJ reviewed medical reports related to all three injuries.\nEmad Dalloul\nDalloul, a 29-year-old correspondent for pro-Palestinian Islamic Jihad broadcaster Palestine Today TV, was one of three journalists injured in an Israeli drone strike on the courtyard of Al-Ahli Baptist Hospital around 10 a.m. in Gaza City.\n“I was sitting with several journalists at a table,” Dalloul told CPJ. “I survived by a miracle, even though I was right next to the colleagues who were killed.”\nThe strike killed three journalists. Editor Suleiman Hajjaj and camera operator Ismail Baddah of Palestine Today TV, a channel affiliated with the Islamic Jihad militant group, died at the scene. Ahmed Qalaja, a camera operator with Qatari-funded Al-Araby TV, later died from his injuries on June 6.\nDalloul told CPJ he received emergency surgery and treatment for multiple shrapnel wounds across his body, including in both legs, his right shoulder, left hand, neck, and stomach. He remained in Al-Ahli Baptist Hospital for four days before being discharged due to overcrowding.\n“One of the [shrapnel] fragments had lodged between my skin and intestines, something doctors said rarely happens,” Dalloul told CPJ.\nIslam Badr\nBadr, a 36-year-old Palestinian reporter with Qatari-funded Al-Araby TV, was one of three journalists injured in an Israeli drone strike on the courtyard of Al-Ahli Baptist Hospital around 10 a.m. in Gaza City. Badr is the older brother of Imam Badr, who was injured in the same strike.\n“I was inside the hospital on Thursday morning when an Israeli drone targeted a table where journalists were seated in the courtyard with a single missile,” Bard told CPJ. “Several journalists, doctors, and patients were killed. I suffered bruises in my right leg due to the blast shockwave, as I was only a few meters from the strike.”\nThe strike killed three journalists. Editor Suleiman Hajjaj and camera operator Ismail Baddah of Palestine Today TV, a channel affiliated with the Islamic Jihad militant group, died at the scene. Ahmed Qalaja, a camera operator with Qatari-funded Al-Araby TV, later died from his injuries on June 6.\nBadr told CPJ he’d been previously injured with shrapnel wounds to his right shoulder and hip during an Israeli airstrike on the Jabalia refugee camp in northern Gaza. He’d been working for Hamas-owned Al-Aqsa TV and contributing to Al-Araby TV.\nImam Badr\nBadr, a 20-year-old Palestinian freelance camera operator with Qatari-funded Al-Araby TV, was one of three journalists injured in an Israeli drone strike on the courtyard of Al-Ahli Baptist Hospital around 10 a.m. in Gaza City. Badr is the younger brother of Islam Badr, who was injured in the same strike.\nThe strike killed three journalists. Editor Suleiman Hajjaj and camera operator Ismail Baddah of Palestine Today TV, a channel affiliated with the Islamic Jihad militant group, died at the scene. Ahmed Qalaja, a camera operator with Qatari-funded Al-Araby TV, later died from his injuries on June 6.\nBadr sustained multiple shrapnel injuries and was briefly admitted to Al-Shifa Medical Complex four days later, where he was diagnosed with an infected wound and internal inflammation, according to a medical report reviewed by CPJ.\nMay 29, 2025\nMahmoud Al-Louh, a 36-year-old correspondent with privately owned Al-Ghad TV and a father of three, was injured by Israeli tear gas and smoke canisters while covering aid distribution in central Gaza.\n“All I had done was report on the arrival of citizens seeking food aid,” he told CPJ. “Minutes after my live report, Israeli soldiers targeted me with multiple canisters. One hit my right leg, causing burns. I also suffered from gas inhalation.”\nHe was treated at Al-Awda Hospital in Nuseirat refugee camp and discharged after an hour.\nMahmoud Al-Louh was previously injured on October 31, 2024, when he sustained bruises after being thrown into the air by the force of an Israeli airstrike on Nuseirat refugee camp.\nOn December 26, 2023, he also lost consciousness after inhaling smoke from weapons fired into the camp by Israeli forces and received intensive care treatment for acute respiratory issues. Mahmoud Al-Louh said he believed he had inhaled gas from white phosphorus, which ignites upon contact with oxygen.\nCPJ was unable to independently verify his claim, and the Israel Defense Forces has rejected such allegations.\nWitnesses and videos examined by human rights groups suggest that Israel has used white phosphorus during its military operations in Gaza. It is illegal to use white phosphorus against humans in a civilian setting.\nMay 27, 2025\nIssam Rimawi\nA group of Israeli settlers attacked and injured Rimawi, a 42-year-old Palestinian freelance photojournalist and contributor to several international media outlets, in an agricultural area east of Ramallah in the West Bank, he told CPJ.\nRimawi told CPJ he had been documenting Palestinian farmers harvesting wheat after Israeli settlers reportedly set fire to crops in the same region a few days before.\n“As settlers descended from the outpost toward the farmers, I put on my press vest and helmet and moved more than 700 meters away to film the unfolding events,” Rimawi told CPJ. “The settlers launched three separate attacks on the villagers.”\nAfter he was finished, Rimawi began walking back to his vehicle, which he deliberately parked two kilometers away to avoid it being targeted — something that often happens during such reporting, he told CPJ. En route, he was intercepted by six settlers who attacked him with sticks and stones.\n“They aimed for my face. I raised my hands to protect myself, which led to them breaking my wrists,” Rimawi told CPJ. “I tried to show them I was a journalist, speaking in several languages, and used by cameras to shield myself. But they intensified the attack.”\nEyewitnesses later told Rimawi that the settlers continued assaulting him, even after he lost consciousness and, believing he was dead, stole one camera and destroyed the other before fleeing the scene.\nRimawi, a father of four, was treated for several injuries, including a concussion, deep facial wounds, two broken wrists, multiple broken fingers, and further trauma to his shoulders, neck, and skull, he told CPJ. As of June 4, he remained under medical supervision at the Palestine Medical Complex in Ramallah due to the risk of internal bleeding and head trauma.\nMay 25, 2025\nOsama Sohaib Hosny Al Ashi\nAn Israeli airstrike injured Al Ashi, a 29-year-old Palestinian freelance camera operator and television producer and contributor to Qatari-funded Al-Araby TV, China’s state-run CCTV, and BBC Arabic, around 11 p.m., in Gaza City. The missile struck a residential building near where he was sheltering alongside his family.\n“I was sitting with my wife and child in our room at my parents’ apartment…[when] a sudden and powerful blast shook the building. As I moved toward the balcony, shrapnel and debris — stones, shattered windows, and glass — burst into the room,” Ali Ashi told CPJ.\nAli Ashi told CPJ he was treated at Al-Shifa Medical Complex for shrapnel injuries to his right hand and bruises on his body. He was discharged after receiving stitches to his hand.\nMay 13, 2025\nAmr Tabash\nTabash, a 27-year-old Palestinian freelance photojournalist who contributes to multiple outlets including Britain’s BBC, was one of four journalists injured by Israeli strikes on the European Gaza Hospital in southern Khan Yunis.\nTabash told CPJ he was conducting a video interview in the hospital courtyard when it was bombed.\n“The force of the explosions hurled me several meters, causing bruises to my shoulder and other parts of my body. I was briefly admitted to Nasser Hospital and then discharged,” he told CPJ.\nAbed Shaat\nShaat, who was previously injured on April 7, 2025, was another casualty of Israel’s strikes around the European Gaza Hospital.\nThe photographer told CPJ that he was accompanying ambulances and civil defense workers who were rescuing people hit by the bombings in the hospital courtyards and surrounding areas.\n“We found numerous bodies of civilians and patients lying on the ground. Then, I accompanied civil defense personnel to a residential building near the hospital that had also been bombed by Israeli forces,” he told CPJ.\n“While we were at the building, the area was bombed again. I was hit by shrapnel below my right eye,” he said, adding that he was taken to Nasser Hospital, several kilometers north, but only stayed for a few minutes “due to the overwhelming number of injuries.”\nMohammad Al-Amour\nAl-Amour, a 23-year-old freelance photographer who contributes to the privately owned Quds News Network and regularly reports from the European Gaza Hospital, was the third journalist injured during the strikes.\n“The Israeli airstrikes targeted the hospital’s outer courtyards with multiple raids. I was injured by shrapnel in my right hand. Due to the large number of casualties, I had to bandage my wounds myself,” he told CPJ.\nHussein Abu Khreis\nAbu Khreis, a 27-year-old freelancer who contributes to the Saudi state-owned broadcaster Al-Hadath and Qatari-owned Al Jazeera, was the fourth journalist injured at the European Gaza Hospital.\nAbu Khreis told CPJ that his right leg was wounded but he treated it himself as medical staff were overwhelmed with casualties from the strikes.\nApril 8, 2025\nSalma Al Qaddoumi\nAl Qaddoumi, a 34-year-old Palestinian freelance photojournalist, sustained minor injuries during an Israeli airstrike on April 8, 2025, in central Gaza’s Deir al-Balah city. Al Qaddoumi contributes to several international outlets, including Al Jazeera, the BBC, Reuters, AFP, and Turkish state-owned Anadolu Agency.\nAl Qaddoumi told CPJ she was standing at a taxi station around 7:30 p.m. when flying debris — a rock and a piece of metal —from the nearby explosion struck her. She was treated at the Al-Aqsa Martyrs Hospital for bruising to her left hand.\nIt is the second time Al Qaddoumi has been injured during the war. In the first incident, an Israeli tank fired toward a group of journalists on August 18, 2024, killing Ibrahim Muhareb.\nApril 7, 2025\nAbed Shaat\nShaat, a freelance photographer who contributes to Agence France-Presse news agency, was injured in a targeted Israeli airstrike on a journalists’ tent in southern Gaza’s Khan Yunis, which also killed journalists Hilmy al-Faqaawi and Ahmed Mansour.\n“I woke up to the sound of a huge explosion nearby,” Shaat told Al Jazeera, describing how he and his colleagues rushed out of their tent and he started filming the fire in the neighboring tent, which belonged to the pro-Palestinian Islamic Jihad broadcaster Palestine Today TV. Shaat stopped filming when he saw a journalist on fire inside the tent.\n“I don’t even know how I summoned the courage to approach the flames and try to pull the burning person out. The fire was intense. There was a gas canister that had exploded, and another one that was burning. I tried to pull him out by his leg, but his pants tore off in my hand. I tried from another angle, but I couldn’t. The fire grew so strong, I fell back, I couldn’t bear it any longer,” said Shaat, who said he then lost consciousness and was taken to Nasser Hospital.\nShaat’s right hand was burned while trying to save Mansour, who died hours later.\nAhmed Al-Agha\nAl-Agha, a BBC Arabic contributor, was injured in the same Khan Yunis airstrike. “Al-Agha suffered shrapnel wounds to his legs,” Al-Ghad TV camera operator Mazen al-Brim, who was in his channel’s tent 50 meters away when the strike hit and helped with rescue efforts, told CPJ on April 7.\nAbdullah Al-Attar\nAl-Attar, a freelance photographer for Turkish state-owned Anadolu Agency, was injured in the same Khan Yunis airstrike. “Al-Attar suffered shrapnel wounds to his stomach and minor injuries to his legs,” Al-Ghad TV’s Mazen al-Brim told CPJ.\nIhab Al-Bardini\nAl-Bardini, a freelance camera operator, was injured in the same Khan Yunis airstrike. “Al-Bardini suffered shrapnel wounds to his head and is in critical condition,” Al-Ghad TV’s Mazen al-Brim told CPJ.\nMahmoud Awad\nAwad, a camera operator for the Qatari-based broadcaster Al Jazeera, was injured in the same Khan Yunis airstrike. “Awad suffered shrapnel wounds to his head,” Al-Ghad TV’s Mazen al-Brim told CPJ.\nAli Eslayeh\nEslayeh, a photographer for West Bank-based site Alam24, was injured in the same Khan Yunis airstrike. “Eslayeh suffered minor injuries to his legs,” Al-Ghad TV’s Mazen al-Brim told CPJ.\nMohammed Fayeq\nFayeq, freelance photojournalist and drone operator, was injured in the same Khan Yunis airstrike. “Fayeq suffered shrapnel wounds to his right leg and left thigh,” Al-Ghad TV’s Mazen al-Brim told CPJ.\nMajed Qudaih\nQudaih, a Radio Algerie correspondent, was injured in the same Khan Yunis airstrike. “Qudaih suffered shrapnel wounds to his back,” Al-Ghad TV’s Mazen al-Brim told CPJ.\nMarch 18, 2025\nEsraa AlAreer\nAlAreer, a 33-year-old Palestinian freelance journalist, was injured at 2:30 a.m. on March 18, 2025, in an Israeli airstrike that targeted an apartment adjacent to her rented unit in Khan Yunis in southern Gaza. AlAreer told CPJ her home was completely destroyed, “after Israeli forces had already destroyed all the homes and apartments my family owned.”\nAlAreer contributes to the BBC and local media organizations, including Filastiniyat, which advocates for women’s and youth’s participation in media, and Radio Alam, a station affiliated with Hebron University.\n“We survived by a miracle and made it out from under the rubble,” said AlAreer, a mother of one who lost her husband during the war. AlAreer told CPJ she was treated at Nasser Hospital for torn ligaments and bruises to her left leg.\nDecember 4, 2024\nMohammed Awad\nAwad, a 25-year-old Palestinian freelance photographer, who works for Turkish state-owned Anadolu Agency, was shot while covering people fleeing the town of Beit Lahia in northern Gaza, according to the Beirut-based press freedom group SKeyes and the journalist, who spoke to CPJ.\n“I work primarily as a nurse, but during the war I began documenting Israeli violations,” Awad told CPJ. “I went to the outskirts of the town on Wednesday to document the situation. While I was there filming scenes of displacement, at 2:15 p.m. I was hit by Israeli bullets. I don’t know if it was a sniper or a drone.”\n“The bullet entered the tip of my neck and exited and entered and exited my right hand. The tendons in my fingers were severed. I was transferred to the Ahli-Baptist Hospital in Gaza City and I am still receiving treatment,” he said.\nAwad shared with CPJ an image of his injury to his right hand and a medical report which said he needed to be evacuated to receive medical treatment outside Gaza.\nDecember 2, 2024\nWael AbuZaina\nAbuZaina, a 35-year-old Palestinian freelance journalist, told CPJ that he and his father were injured when Israeli airstrikes hit their home in Jabalia in northern Gaza.\nAbduZaina said he worked for two local radio stations, Amwaj Sport and Namaa Radio, making short films for digital media, until they stopped broadcasting during the war.\n“I was determined that my message should not stop, so I was filming videos about events in the northern Gaza Strip on a voluntary basis and publishing them on my social media accounts, and a number of them were published on the Al Jazeera and Al Arabiya satellite channels.”\nAbuZaina’s pregnant wife, son, and several family members died in Israeli bombing in December 2023 and the remainder of the family fled to Al-Shati refugee camp, closer to Gaza City.\nA year later, AbuZaina and his father returned home to Jabalia to collect some of their possessions.\n“We arrived, and minutes later, specifically at 11:45 am on Monday morning, the Israeli warplanes bombed the house with a single missile, and its four floors collapsed on us. And the displaced people who were near the area took us out after an hour and a half,” he said.\n“I miraculously survived and was transferred to the Ahli-Baptist Hospital in Gaza City. I sustained bruises and shrapnel wounds all over my body, burns to my face, and an injury to my left eye, which requires surgery outside the Gaza Strip. I am still in the hospital,” he said in February 2025.\nAbuZaina shared with CPJ medical reports showing that he had surgery to remove shrapnel from his left eye 11 days after he was injured. As of March 2025, he had no sight in this eye.\nAbuZaina said he also lost mobility in his right hand, which was broken and healed incorrectly.\nNovember 28, 2024\nTalal Al Arrouqi\nAl Arrouqi, a 31-year-old Palestinian correspondent for the privately owned Qatari-based broadcaster Al Jazeera Mubasher, was injured by Israeli airstrikes on Nuseirat refugee camp in central Gaza while reporting on ambulances rescuing injured people, according to the Beirut-based press freedom group SKeyes and the journalist, who spoke to CPJ.\n“At around 11:00 a.m. on Thursday, the ambulance service received a report that there were a number of residents trapped in an area north of the Nuseirat camp due to Israeli gunfire and shelling of their homes,” he said, adding that he headed out with the ambulances once the shelling subsided.\n“When we arrived at the location, we were directly shot at by Israeli drones, as well as shells from Israeli tanks, several times. I took cover at the entrance to a house, and the shooting continued several times. We changed our hiding place every time, until the Israeli tanks fired a shell at us that fell around us,” he said.\n“I flew 2 meters [2.2 yards] away from my hiding place because of its force. I was injured in my right hand and leg by shrapnel from the shell, as well as my head,” he said.\nAl Arrouqi said several paramedics were injured but a wounded ambulance driver took him to the camp’s Al-Awda Hospital.\n“I lost consciousness due to the injury, and I woke up in the hospital’s emergency department. I am still receiving treatment,” he said.\nAl Arrouqi is one of six Al Jazeera journalists accused by the IDF of being members of militant groups. Al Jazeera and CPJ condemned the allegations as unfounded.\nAl Arrouqi denied the allegations, adding, “The occupation fights anyone who carries a camera and covers the image of the bombing. They noticed the presence of journalists in the area, so they opened fire and shelled directly [on us].”\nAl Arrouqi was also injured on October 31, 2024.\nNovember 19, 2024\nHossam Shabat\nShabat, a 23-year-old Palestinian reporter and photographer for Qatari-based Al Jazeera Mubasher, was injured on the evening of November 19, 2024, when an Israeli airstrike hit a house in the Al-Basra neighborhood in southern Gaza, according to footage and reports by his outlet and Shabat, who spoke to CPJ.\nShabat told CPJ he was on his way to report about a house, which Israeli forces had previously bombed, with Mohamed Al-Masry, one of the channel’s camera operators. Shabat said both journalists were wearing “Press” vests and traveled in a car marked with press insignia.\n“We drove our car behind the civil defense vehicle to the site of the bombing. When we arrived and entered the house, we were surprised that it was targeted again and bombed by Israeli warplanes,” Shabat told CPJ, adding that the strike killed one of the civil defense workers.\nShortly after the attack, Shabat posted details on social media, saying he was “deliberately targeted by Israeli forces.” Shabat told CPJ he believed the bombing could have been intentional and linked to accusations made by Israel Defense Forces (IDF).\nOn October 23, the IDF accused Shabat and five other Palestinian journalists working with Al Jazeera in Gaza of being members of the militant groups Hamas and Islamic Jihad.\nCPJ has denounced and called for a halt to Israel’s practice of making unsubstantiated allegations as a means of justifying its killing and wider mistreatment of journalists and media workers.\nShabat and Al-Masry were treated for bruising on their backs at a hospital but were discharged due to the high number of injured people.\nMohamed Al-Masry\nAl-Masry, a 20-year-old Palestinian camera operator for Qatari-based Al Jazeera Mubasher, was injured on the evening of November 19, 2024, when an Israeli airstrike hit a local house in the Al-Basra neighborhood in southern Gaza, according to footage and reports by his outlet and Hosaam Shabat, a reporter and photographer for the outlet, who spoke to CPJ.\nShabat told CPJ that the pair were on their way to report about a house that Israeli forces had previously bombed. Shabat said both journalists were wearing “Press” vests and traveled in a car marked with press insignia.\n“We drove our car behind the civil defense vehicle to the site of the bombing. When we arrived and entered the house, we were surprised that it was targeted again and bombed by Israeli warplanes,” Shabat told CPJ, adding that the strike killed one of the civil defense workers.\nShortly after the attack, Shabat posted details on social media and said he was “deliberately targeted by Israeli forces.” Shabat told CPJ he believed the bombing could have been intentional and linked to accusations made by Israel Defense Forces (IDF).\nOn October 23, the IDF accused Shabat and five other Palestinian journalists working with Al Jazeera in Gaza of being members of the militant groups Hamas and Islamic Jihad.\nCPJ has denounced and called for a halt to Israel’s practice of making unsubstantiated allegations as a means of justifying its killing and wider mistreatment of journalists and media workers.\nShabat and Al-Masry were treated for bruising on their backs at a hospital but were discharged due to the high number of injured people.\nNovember 9, 2024\nSamer Zaneen\nZaneen, a 34-year-old Palestinian freelance journalist, who works for the U.K.’s BBC radio and television, and Yemen Today’s Abdul Hadi Farhat were both injured by Israeli bombing of tents in the compound of Al-Aqsa Martyrs Hospital in Deir al-Balah, central Gaza, according to the Beirut-based press freedom group SKeyes, the Palestinian press freedom group MADA, and the journalists, who spoke to CPJ.\nZaneen told CPJ that he was displaced at the beginning of the war from his home in the northern town of Beit Hanoun to Deir al-Balah.\n“At around 1:45 pm on Saturday afternoon, Israeli aircraft suddenly targeted a tent for displaced people inside Al-Aqsa Martyrs Hospital… We [journalists] work in a tent next to it. We heard the sound of an explosion and fire,” Zaneen said.\n“The fire entered our tent and devoured it. I was in the tent with my colleague Abdul Hadi Farhat and a number of journalists at the time,” he said.\n“I was injured by the shelling, with some bruises and shrapnel in one of my feet. I was admitted to Al-Aqsa Martyrs Hospital after the injury, received treatment and was discharged the same day,” Zaneen said.\nAbdul Hadi Farhat\nFarhat, a 28-year-old Palestinian correspondent for Yemen Today television channel, was injured along with the BBC’s Samer Zaneen by Israeli bombing of tents in the compound of Al-Aqsa Martyrs Hospital in Deir al-Balah, central Gaza, according to the Beirut-based press freedom group SKeyes, the Palestinian press freedom group MADA, and the journalists, who spoke to CPJ.\nFarhat said he moved to the hospital compound after fleeing his home in Jabalia camp in northern Gaza at the start of the war.\n“There were no less than six journalists with us in the tent… when the shelling occurred. We found shrapnel flying at us as the tent was torn apart and the fire engulfed it, while the remains of the martyrs and wounded were scattered on our bodies,” Farhat told CPJ.\n“We miraculously survived the shelling, and I suffered severe bruises on my feet as a result of the force of the missile and the falling remains and shrapnel,” he said, adding that he was treated at the hospital and discharged later that day.\nNovember 5, 2024\nRabie Al-Munir\nAl-Munir, a Palestinian camera operator for the Qatari-funded Al-Araby TV, was shot in the abdomen while reporting on an Israeli military operation in Qabatiya, south of the West Bank city of Jenin, according to media reports. Video footage showed Al-Munir being treated in Jenin’s Ibn Sina hospital.\nAl-Araby TV reporter and witness Ameed Shehade told the local online outlet Al-Jarmaq News that the journalists were visible to the nearby Israeli soldiers who “fired directly at us.” Al-Munir was wearing his “Press” vest, which reduced the severity of the injury, and his condition was stable, he added.\nPreviously, on May 6, Shehade and Al-Munir were shot at by Israeli soldiers while covering an operation in the West Bank city of Tulkarem.\nOctober 31, 2024\nTalal Al Arrouqi\nAl Arrouqi, a 31-year-old Palestinian correspondent for the privately owned Qatari-based broadcaster Al Jazeera Mubasher, was injured by an Israeli airstrike on Nuseirat refugee camp in central Gaza, according to the Beirut-based press freedom group SKeyes and the journalist, who spoke to CPJ. The privately owned Al-Ghad TV correspondent Mahmoud Al Louh was injured in the same strike.\nAl Arrouqi told CPJ that “at around 8:30 p.m. on Thursday, Israeli airstrikes targeted three homes in the area north of Nuseirat camp in central Gaza … I went with the ambulance to cover the incident with my colleague Mahmoud Al Louh.\n“When we arrived at the site, the situation was difficult due to the bombing and the lack of electricity. Residents were pulling out the dead and wounded. Minutes later, Israeli airstrikes targeted another home next to the three targeted homes, which resulted in the injury of my right foot, as a result of flying stones and shattered glass, as well as bruises all over my body because the force of the explosion threw me to another place.”\nAl Arrouqi said that after about 15 minutes of being trapped under the debris, he was transferred to al-Awda Hospital but soon left because it was overwhelmed by an influx of dozens of dead and injured patients. He did not seek further medical treatment.\nAl Arrouqi is one of six Al Jazeera journalists accused by the IDF of being members of militant groups. Al Jazeera and CPJ condemned the allegations as unfounded.\nMahmoud Al Louh\nAl Louh, a 34-year-old Palestinian correspondent with privately owned Al-Ghad TV was injured by an Israeli airstrike on Nuseirat refugee camp in central Gaza, according to the Beirut-based press freedom group SKeyes and the journalist who spoke to CPJ. Talal Al Arrouqi, correspondent for the privately owned Qatari-based broadcaster Al Jazeera Mubasher, was injured in the same strike.\n“I was injured as a result of the shelling that occurred while I was reporting, with bruises all over my body,” Al Louh told CPJ, adding that he sought treatment at Al-Awda Hospital but quickly left as it was full of casualties from the strike.\nOctober 25, 2024\nHassan Hoteit\nHoteit, a Lebanese camera operator for the media production company Isol, told CPJ that his hip was broken when an Israeli airstrike hit a compound housing 18 journalists in south Lebanon’s Hasbaya area. Two other journalists were injured and three were killed in the attack, which Lebanon described as a “war crime.”\nHoteit told CPJ that he received surgery in the capital Beirut, was hospitalized for a week, and required bed rest for a month.\nZakaria Fadel\nFadel, a Lebanese assistant camera operator for the media production company Isol, told CPJ that he was injured, without providing further details, when an Israeli airstrike hit a compound housing 18 journalists in south Lebanon’s Hasbaya area. Two other journalists were injured and three were killed in the attack, which Lebanon described as a “war crime.”\nAli Mortada\nMortada, a Lebanese camera operator for the Qatari-owned broadcaster Al Jazeera, told CPJ that his shoulder was broken when an Israeli airstrike hit a compound housing 18 journalists in south Lebanon’s Hasbaya area. Two other journalists were injured and three were killed in the attack, which Lebanon described as a “war crime.”\nOctober 14, 2024\nMohammed Abu Armana\nAbu Armana, a 37-year-old Palestinian journalist, was injured in an Israeli airstrike on Al-Mawasi, west of Rafah city in southern Gaza, according to the Beirut-based press freedom group SKeyes and the journalist, who spoke to CPJ.\n“A number of displaced citizens in the Mawasi area, west of Rafah city, called the ambulance and told them that there was a martyr [fatality] and injuries in the area. And based on that, they headed there and I was with them to document the event,” Abu Armana told CPJ.\n“When we arrived at the scene, we were surprised by a new Israeli target [strike] next to us, with a missile from an Israeli drone and four shells from a tank. And I sustained a minor injury to my left hand, as did three paramedics,” he said.\nSafenaz Al-Louh\nAl-Louh, a 33-year-old Palestinian journalist who freelances with multiple outlets including the Gaza-based Al-Elamya News and the Qatari-owned broadcaster Al Jazeera Mubasher, was injured when Israeli airstrikes hit tents for displaced people in the Al-Aqsa Martyrs Hospital, in Deir al-Balah in central Gaza. The airstrike caused a huge fire, killing at least four people.\n“At around 2 a.m., we were surprised by Israeli warplanes bombing the tents of displaced people inside the Al-Aqsa Martyrs Hospital,” Al-Louh told CPJ. “As a result of the presence of cooking gas cylinders used by the displaced inside their tents, the bombing led to their explosion and the flames engulfed more than 30 tents.”\n“I suffered burns to my left hand and foot while I was filming the event as the gas cylinders exploded,” said Al-Louh, who received treatment at the hospital.\nDespite her injury, Al-Louhh has continued to report from Gaza with her left hand in a bandage.\nShe has given numerous interviews from Gaza during the war, including for Egyptian public broadcaster ETC TV and Ramallah-based Basma Radio.\nOctober 9, 2024\nTamer Lubbad\nLubbad, a 37-year-old Palestinian correspondent for the Hamas-owned Al-Aqsa TV, was injured when an Israeli drone strike landed near him and his colleague Mohammed Al-Tanani as they were covering an Israeli siege on Jabalia refugee camp in northern Gaza. Camera operator Al-Tanani was killed.\nBoth men were wearing “Press” vests and helmets and were clearly identifiable as journalists, according to video footage and Lubbad, who spoke to CPJ.\n“We went to monitor and cover the situation after we learned that the Israeli occupation forces are besieging the Jabalia camp and its residents,” Lubbad told CPJ via messaging app. “We reached the closest area to the camp — and the area was not dangerous — where we did a report. After finishing it and as we were leaving the area at about 4:30 p.m., a drone fired missiles that hit Mohammed directly, which immediately killed him.”\n“The missile cut through his lower half and I was hit by shrapnel behind my left shoulder and shrapnel next to my colon,” he said, adding that it took two hours for the ambulance to arrive because of “repeated and deliberate” gunfire from Israeli forces.\n“I received first aid in the ambulance. And at the General Service Hospital in Gaza City, an operation was performed to extract the shrapnel and I am staying there to complete the treatment,” he said.\nFadi Al Wahidi\nAl Wahidi, a Palestinian camera operator for the Qatari-owned broadcaster Al Jazeera was critically injured in the neck by a bullet fired from an Israeli reconnaissance aircraft while Al Wahidi and correspondent Anas Al-Sharif were covering an Israeli siege on northern Gaza’s Jabalia refugee camp. Both men were wearing “Press” vests and clearly identifiable as journalists.\n“I was with my colleague, cameraman Fadi al-Wahidi, at the end of al-Jalaa Street, north of Gaza City, where we were in an area completely far from the areas of operations of the Israeli occupation forces. We had with us the external live broadcast vehicle to transmit the news,” Al-Sharif told CPJ via phone from Gaza City.\n“The place was originally full of residents. Suddenly, while we were filming the events and after we had also finished a live segment on the channel, an Israeli reconnaissance drone fired at us.”\n“After the shooting, we tried to move to another safer place and hide from any danger, but a bullet from the plane hit our colleague Fadi Al-Wahidi in the neck, which led to his complete paralysis. He is now lying in the Al-Ahli Hospital in a very critical condition, and in urgent need of travel for treatment outside the Gaza Strip to receive medical care.”\n“This incident marks yet another grave violation against journalists in Gaza, where Israeli forces have been increasingly hostile toward media workers,” Al Jazeera said. “The deliberate targeting of journalists is a flagrant violation of international laws protecting the press and humanitarian workers in war zones.”\nOctober 7, 2024\nAli Al-Attar\nAl-Attar, a 27-year-old Palestinian journalist and Al Jazeera Arabic camera operator, was severely injured when an Israeli airstrike hit a tent for displaced people in front of Al-Aqsa Martyrs Hospital in Deir al-Balah in central Gaza, according to Al Jazeera and Al-Attar’s cousin Ahmed Maqat, who spoke to CPJ.\nAl Jazeera posted a video showing Al-Attar being helped up from his bed and given first aid after some of the shrapnel from the 3 a.m. strike landed on a tent for Al Jazeera reporters.\n“Ali was immediately admitted to the Al-Aqsa Martyrs Hospital, and then transferred to the intensive care unit at the Gaza European Hospital south of Khan Yunis. He did not undergo any surgery because he is suffering from internal bleeding and he is still in a semi-coma,” Maqat told CPJ.\nAl Jazeera said on Wednesday that pieces of shrapnel pierced Al-Attar’s skull, causing bleeding that resulted in a coma, and that his condition was deteriorating. Medics in Gaza were unable to treat him due to the lack of medical resources amid the ongoing war.\nAl-Attar’s colleagues have called on the international community to facilitate his evacuation in order to save his life.\nOctober 1, 2024\nAhmed Al-Zard\nAl-Zard, a 33-year-old Palestinian camera operator and producer for the local Al-Kofiya TV, was injured and four family members were killed when Israeli aircraft bombed the house where they were staying in the village of Ma’an, east of Khan Yunis, the journalist told CPJ.\n“At around 9 p.m., we began hearing very intense and rapid sounds of bombing. Minutes later, the house was bombed over our heads by Israeli warplanes without any warning. It turned out that the occupation had stormed the area and besieged it,” Al-Zard told CPJ.\n“We were 13 people in the house. I was immediately injured, along with eight others. My brother, my uncle, his wife, and their daughter were martyred. We remained trapped until the Israeli occupation withdrew at 4:30 a.m.,” he added.\n“I was hit by shrapnel all over my body, in my back, spleen, stomach, knees, hands, and head. I am currently suffering from internal bleeding. I am being treated at the European Gaza Hospital, southeast of Khan Yunis, with ongoing tests to determine what surgeries I need,” he said.\nAhmed said he fled his home in Gaza City at the beginning of the war and reported from southern Gaza. His family joined him in July but his father, who had cancer, died on the journey.\nSeptember 12, 2024\nMahmoud Issa Abu Shirby\nShirby, a 33-year-old Palestinian journalist for the Qatari-funded broadcaster Al-Araby TV and Palestine Today, was severely injured when Israeli airstrikes bombed his aunt’s house in Gaza City’s Zeitoun neighborhood, according to the Beirut-based press freedom group SKeyes and the journalist, who spoke to CPJ.\n“All of my family were forced to flee to areas in the southern Gaza Strip after Israeli threats at the beginning of the war. Only my cousin and I remained in Gaza City,” he told CPJ.\n“On Thursday, Israeli warplanes targeted it with a direct missile, killing my aunt’s husband, his brother, and his brother’s children. I was also injured. I saw myself burning in the rubble and shrapnel from the missile eating away at my body.”\n“I was critically injured by the bombing. My left foot was amputated, and I suffer from wounds, abrasions, and laceration in my right foot … in addition to severe burns on my chest, abdomen, and hands. I lost all sight in my left eye and 60% in my right eye,” he said.\nShirby told CPJ in February 2025 that he was admitted to Gaza City’s Al-Ahli Baptist Hospital where he was still receiving treatment, more than four months later. The journalist said it was the twelfth time that he had been injured during the war but the first time that the seriousness of his injuries had stopped him from working.\nSeptember 3, 2024\nAhmed Al-Nakhala\nAl-Nakhala, a Palestinian camera operator for the local Al-Kofiya TV, was injured by an Israeli airstrike while he was preparing to shoot a story at Nama College in Gaza City’s northern Sheikh Radwan neighborhood, where hundreds of displaced people were sheltering.\n“The bombing was a surprise and the Israeli warplanes fired a large number of missiles. So I suffered bruises and shrapnel [embedded] in my left hand and a fracture in my left foot,” he told CPJ, adding that his filming equipment was destroyed, including his cell phone and SIM cards.\nHe was treated at Sheikh Radwan neighborhood clinic and then admitted to Al-Ahli Baptist Hospital in Gaza City until October 15. In February 2025, he was evacuated to receive treatment in Egypt.\nMohammad Mansour and Ayman al-Nubani\nMohammad Mansour, a Palestinian photographer with the Palestinian Authority’s official news agency WAFA, was shot in the left arm while covering an Israeli military operation in the Palestinian village of Kafr Dan, about 8 kilometers (5 miles) northwest of the West Bank city of Jenin. Video footage of the incident shows that Mansour was driving a car marked “Press” and wearing a protective vest marked “Press.”\nAyman Al-Nubani, a WAFA photographer, was hit by shrapnel in his left arm in the same incident. He told the Palestinian Journalists’ Syndicate that Israeli forces used live gunfire against seven journalists in “Press” vests riding in three “Press” cars.\n“We narrowly escaped death. Had we not sped up a little, they would have killed us. It was a direct assassination attempt,” he was quoted as saying, adding that the Israeli soldiers “started shooting at us directly.”\nAl-Nubani said that Israeli forces obstructed the ambulances that were taking the injured to Jenin’s Ibn Sina Hospital and forces surrounding the hospital questioned them.\nAugust 26, 2024\nMohammed Al-Za’anin\nAl-Za’anin, a 40-year-old Palestinian journalist who works as a camera operator for the Turkish-owned TRT Arabic broadcaster, was injured by shrapnel in his left eye after an Israeli missile struck a house next to TRT’s temporary office in Khan Yunis, in southern Gaza, according to multiple media reports and the journalist, who spoke to CPJ. His assistant, Mohammed Karajah, was also injured.\nThe office is in a warehouse facing Nasser Hospital.\nAl-Za’anin has been a camera operator and a photographer for 19 years. He was on assignment in southern Gaza in the early days of the war and remained there as a displaced person.\n“We were near Nasser Hospital when an Israeli warplane struck near us,” Al-Za’nin told CPJ. “I was injured by shrapnel that penetrated my left eye and has not yet come out.”\nAl-Za’anin said that he walked after his injury to Nasser Hospital because of its proximity to the office, and that he was still being treated there after undergoing surgery. He told CPJ that he needs an operation outside Gaza to extract the shrapnel due to the lack of capacity in the strip.\nThe Turkish foreign ministry posted on X about the incident, saying “the attacks on TRT members in Gaza are an Israeli effort to cover up the truth, with its hands stained with blood. We stand with all members of the press who are working with all their might to make Israel’s cruelty known to the world. We extend our best wishes to the TRT members and the TRT family who were injured in the latest attack.”\nMohammed Karajah\nKarajah, a 32-year-old Palestinian assistant photographer for the Turkish-owned TRT Arabic broadcaster was injured in the same Israeli airstrike on a house near TRT’s temporary office.\n“My assistant, Mohammed Karajah, was injured by shrapnel in his left leg. The doctors were able to remove it and he left the hospital,” his colleague Al-Za’nin told CPJ.\nKarajah was displaced from Bureij Palestinian refugee camp, east of central Gaza, to the neighboring city of Deir al-Balah.\nAugust 18, 2024\nSalma Al Qaddoumi\nAl Qaddoumi, a freelance Palestinian journalist, who works with multiple outlets including the Turkish state-owned Anadolu Agency, Al Jazeera, and AFP news agency, was injured when an Israeli tank fired towards a group of journalists reporting in the Hamad city area, northwest of Khan Yunis in southern Gaza, according to news reports. Freelance journalist Ibrahim Muhareb was also killed in the incident.\nThe Palestinian Journalists’ Syndicate posted a description by journalist Rasha Ahmed of the incident. Ahmed said she was one of five journalists on assignment together when a military tank suddenly advanced from the Al-Hawz area in the northwestern part of Hamad city and opened heavy fire on them. Some reporters lay on the ground for more than five minutes due to the intense gunfire, until they were “miraculously” able to get out. Al-Qaddoumi also tried to run, unaware that her back was injured, but fell to the ground. Ahmed and another journalist Saeed Al-Lulu rescued Al-Qaddoumi and found a cart and then a car to transport her to hospital, the PJS report said.\nOn August 19, Al-Qaddoumi told CPJ by phone that the group of journalists reported from “a place far from the presence of tanks” but “a number of tanks suddenly appeared in the area after filming had ended.”\n“The tanks fired shells and bullets at us, and Ibrahim was hit directly. He asked me to help him leave the place, and I went with one of the displaced people in the area to rescue him, but the tanks fired more shells and bullets at us. At that moment, I was hit in the back by two (pieces of) shrapnel, either from the shells or the bullets. I then lost consciousness and found myself in the hospital,” she told CPJ.\nSami Barhoom\nBarhoom, a Palestinian correspondent for the Turkish state-owned broadcaster TRT Arabic was injured by shrapnel from Israeli sniper bullets when he and a colleague were reporting in southern Gaza, according to news reports and the Palestinian Journalists’ Syndicate.\n“I was on a field mission to prepare a report with camera operator Hazem al-Baz about the cemeteries being full and the lack of graves to accommodate the martyrs in the Austrian neighborhood northwest of Khan Yunis,” Barhoom told CPJ by phone. “We finished and headed to another mission near Hamad city, west of Khan Yunis, at exactly 2:00 p.m.”\n“Although the car was marked “Press” and “TV” and we were (both) wearing a “Press” jacket and helmet, we were surprised by direct fire on our car … The first shot hit the right door of the car, so I knew it was a targeted attack because the gunfire was hitting the sand very heavily,” he said, referring to the desert sand they were driving over.\n“We tried to get out of the car to hide, but as soon as we tried to get out of it, the bullets hit the front window of the car at the level of our heads, and it was clear that the target was to kill,” he said.\nMusa, a 20-year-old Palestinian volunteer reporter for the local social media-based Watan Media Agency, was injured by Israeli airstrikes in southern Gaza’s Khan Yunis, according to the Beirut-based press freedom group SKeyes and the journalist, who spoke to CPJ.\nBarhoom said the pair managed to get out of the car, which was hit by five bullets, and took cover in a nearby shelter for an hour until it was safe to leave. In April, Barhoom was one of four journalists injured by Israeli shelling while reporting in Nuseirat refugee camp in central Gaza. His TRT Arabic colleague Sami Shehadeh lost a leg in the incident.\nAugust 15, 2024\nWadeaa Abu Al-Saud\nAbu Al-Saud, a 32-year-old Palestinian correspondent for Houthi-controlled Yemen TV, told CPJ that he was injured in an Israeli airstrike on a civilian target in Gaza City’s Al-Rimal neighborhood, according to the Beirut-based press freedom group SKeyes and the journalist, who spoke to CPJ.\n“I went to cover an Israeli bombing of a residential building in the northern Al-Rimal neighborhood, west of Gaza City. While I was there, the Israeli Air Force bombed,” he told CPJ, adding that it was about the fifth time that he had been bombed, including twice while he was at home.\n“I was slightly injured by stones that were thrown at us as a result of the bombing. Shrapnel also penetrated my ‘Press’ vest without causing any physical harm. I was transferred to the Ahli-Baptist Hospital in central Gaza City, but I only stayed there for an hour,” he said.\nAugust 9, 2024\nMohammed Abu Musa\n“A house in the village of Ma’in in Khan Yunis was targeted by Israeli airstrikes, so I went to cover [it],” he said. “The targeting was repeated again, which resulted in me being injured by shrapnel in my right foot.”\nJuly 27, 2024\nYoussef al-Firani\nMusa said he was admitted to Nasser Hospital for treatment for nine days.\nAl-Firani, a 23-year-old correspondent and director of the local social media-based outlets Watan Media Agency and Al-Quds News Network, was injured by Israeli airstrikes on a school housing displaced people in central Gaza’s Deir al-Balah city, according to the Beirut-based press freedom group SKeyes and the journalist, who spoke to CPJ.\n“The Israeli air force bombed the school gate with four missiles. The intensity of the bombing caused me to fly a distance from where I was standing. I was injured in the head, and I suffered several shrapnel wounds and bruises all over my body, including my back, pelvis, and left knee,” al-Firani told CPJ, adding that he was treated at the city’s Al-Aqsa Martyrs Hospital and discharged later that day.\nJuly 22, 2024\nMohammed Al Zanin\nAl Zanin, a 44-year-old camera operator for the local Palestine Media Production company, was injured by Israeli airstrikes while covering the displacement of people near the southern city of Khan Yunis, according to the Beirut-based press freedom group SKeyes and the journalist, who spoke to CPJ.\n“I went to cover areas east of Khan Yunis when the Israeli occupation asked its residents to evacuate. At 10:30 a.m., the Israeli Air Force bombed one of the residents’ homes near the Bani Suhaila roundabout while I was covering the displacement operations, which resulted in injury to both my feet,” said Al Zanin, who was himself displaced from northern Gaza’s Beit Hanoun earlier in the war.\n“The injury was shrapnel in the right and left feet. I was transferred to Nasser Medical Complex, west of the city, where I received treatment. After 28 days, I was treated again and underwent a cleaning operation on my right foot to remove shrapnel. I am still taking painkillers and antibiotics,” he told CPJ on October 15, 2024.\nJuly 20, 2024\nMahmoud Akki\nAkki, a 34-year-old Palestinian camera operator for the Qatari-based broadcaster Al Jazeera Mubasher, sustained shrapnel injuries in his right arm during an Israeli strike on central Gaza’s Nuseirat refugee camp, according to the Beirut-based press freedom group SKeyes and the journalist, who spoke to CPJ.\n“After I learned that the Israeli occupation threatened to bomb one of the Ain Jalut Towers in the Nuseirat camp in central Gaza on Saturday, I went to the place to cover the shooting. I arrived and set up the camera away from the tower. I had just finished and retreated a little when the Israeli warplanes suddenly bombed the tower,” he told CPJ.\n“The shrapnel penetrated my hand and lodged in it, damaging the ligaments and nerves. I am still suffering from it and I am experiencing severe pain,” he told CPJ on October 9, 2024.\nAkki said he sought treatment at the Al-Aqsa Martyrs Hospital in the city of Deir al-Balah.\n“I stayed there for only one day because there was no treatment available and there were not enough beds. In addition, I was supposed to receive physical therapy and painkillers, but I did not receive any because they were not available in the Strip as a result of the war,” he said.\nJuly 13, 2024\nFiras Abu Sharkh\nSharkh, a 25-year-old Palestinian freelance photographer and camera operator for the Qatari-based broadcaster Al Jazeera, the Saudi news channel Al Arabiya, Turkish state-owned Anadolu Agency, and Reuters news agency, told CPJ that he was injured by Israeli airstrikes on the Al Mawasi area west of Khan Yunis, which killed 90 people.\n“The Israeli warplanes launched a major bombing campaign on Saturday in the Al Mawasi area of Khan Yunis, targeting the tents of displaced people there. I went to cover the incident, and because the occupation had set up a fire belt [intensive airstrikes], I was injured by several pieces of shrapnel in my left hand.”\nHe added: “I was transferred to the Kuwait Specialized Field Hospital in the Mawasi area for treatment. I stayed there for a whole month and I am still receiving treatment,” he said on October 15, 2024.\nCPJ reviewed medical reports and photos showing Abu Sharkh’s legs were wounded and his left hand was broken and the nerves damaged. As of late 2024, the journalist was still undergoing treatment and could not walk properly.\nJune 29, 2024\nSoliman Hijjy\nHijjy, a Palestinian freelance photographer who contributes to The New York Times, was injured by shrapnel from Israeli tanks in an area that had been declared a safe zone near the southern city of Rafah, according to the Beirut-based press freedom group SKeyes and the journalist, who spoke to CPJ.\n“The Israeli occupation tanks retreated from the areas they had penetrated, northwest of Rafah. We went to cover the situation there, but we were surprised by a new incursion by tanks, starting from an area west of Rafah and reaching an area southwest of Khan Yunis,” Al-Kuaifi told CPJ.\n“I was taking all professional safety precautions and wearing a helmet and shield for journalists. But the Israeli tanks fired shells at me, so I was injured in my head, both hands, and left leg. I remained trapped in the area for three hours, and then I was able to get out,” Hijjy said, adding that his injuries were treated at the Kuwaiti hospital.\nJune 5, 2024\nMohammed Fayq\nFayq, a 28-year-old Palestinian photographer and drone specialist, who freelances for Reuters and Agence France-Presse news agencies, Turkish state-owned Anadolu Agency, the Qatari-based broadcaster Al Jazeera, and Jordan’s Roya TV, was injured in an Israeli airstrike on central Gaza, according to the Beirut-based press freedom group SKeyes and the journalist, who spoke to CPJ.\n“I accompanied ambulances and civil defense vehicles to the site of an Israeli attack on several homes in an area between the Bureij and Maghazi refugee camps in central Gaza. When we arrived at the site, the Israeli air force bombed it again,” he told CPJ.\n“I was injured by a large amount of shrapnel in my hands, right shoulder, feet, and other parts of my body, along with a number of paramedics, in the same attack. We were transferred to the Al-Aqsa Martyrs Hospital in Deir al-Balah, central Gaza, about 20 minutes after the injury. I had to walk a long distance to reach the ambulances, because the ambulances that were present at the site had withdrawn due to the bombing,” he said.\n“I underwent surgery about two weeks later to remove shrapnel from my hand, and to this moment I am still receiving treatment, as there is still shrapnel in my right hand and shoulder and I need very delicate operations outside the Gaza Strip,” Fayq told CPJ in February 2025.\nMay 28, 2024\nMahmoud Bassam Al Jamal\nAl Jamal, a 30-year-old Palestinian freelance photographer, who works for the Qatari-based broadcaster Al Jazeera Mubasher and Turkish state-owned Anadolu Agency, was shot in southern Gaza’s Rafah city, according to the Beirut-based press freedom group SKeyes and the journalist, who spoke to CPJ.\n“I was shot while covering the Israeli occupation forces’ invasion of the western areas of Rafah on Tuesday, while I was leaving the Emirati Crescent Hospital after it was put out of service. I was shot in the left hand by an Israeli drone, which caused some problems in my tendons,” Al Jamal told CPJ.\nHe continued: “I was transferred to the American hospital in Khan Yunis, and then I was transferred to the Red Cross Hospital in the Al-Mawasi area, west of Rafah, where I stayed for only one day. After that, my treatment continued for a month and a half, and I am still waiting to undergo surgery, but there are currently no possibilities to perform it.”\nAl Jamal’s brother, Mohammed Bassam Al Jamal, who was also a journalist, was killed on April 25, 2024.\nMay 24, 2024\nMahmoud Abu Salama\nAbu Salama, a 35-year-old Palestinian correspondent for the privately owned Al-Ghad TV, was injured on May 15 and 24, 2024, by Israeli airstrikes on the Jabalia refugee camp in northern Gaza, according to the Beirut-based press freedom group SKeyes and the journalist, who spoke to CPJ.\nAbu Salama told CPJ: “On both occasions, on Wednesday and Friday, I was targeted by Israeli fire belts [intensive airstrikes] in the Jabalia camp in the northern Gaza Strip. I was heading directly to cover the bombing, and we were surprised by new, intense bombing and fire belts. Because of the pressure of the bombing and some stones falling on me, I was bleeding from several areas of my body and was transferred to the Indonesian hospital because it was close to the target, and I was discharged the same day.”\nMay 21, 2024\nAmro Manasrah\nManasrah, a freelance photographer working with the local Palestine Post outlet and the regional Hezbollah-affiliated Al-Mayadeen broadcaster, was hit in the back by an Israeli bullet that ricocheted off the wall next to him as he and other journalists were reporting on an Israeli operation in the West Bank city of Jenin, according to Palestine Post, Al Jazeera, and the journalist, who spoke to CPJ.\nManasrah, who was wearing a press vest, told CPJ via phone call after he was hospitalized, that the bullet hit a wall next to him and ricocheted, hitting him in the back. Manasrah said that only journalists were in the area and were visible to IDF soldiers. Manasrah was later released from the hospital on the same day.\nJournalist Obada Tahayneh, a freelance reporter for Qatari-owned Al Jazeera Mubasher who was at the scene, told CPJ over the phone that “there were approximately 20 journalists present at the scene, only 150 meters away from IDF soldiers. Seven of us moved towards the nearby hospital, when we heard shots fired. We ran and hid next to a wall, and shortly after I saw Manasrah on the ground.” Tahayneh added that he is still “in shock” from being so close to the shooting and witnessing Manasrah’s injury.\nApril 22, 2024\nRami AlShrafi\nThe general manager of Gaza City-based Zaman FM, AlShrafi, 45, and several family members were injured when an Israeli airstrike hit the house next to them in central Gaza’s Deir al-Balah, according to the Beirut-based press freedom group SKeyes and the journalist, who spoke to CPJ.\nAlShrafi told CPJ that the family moved to the Al-Brouk area of Deir al-Balah after their home in northern Gaza’s Jabalia refugee camp was destroyed on October 7, 2023.\n“We were surprised, without warning, in the early hours of Monday morning, by the Israeli air force targeting the house adjacent to the house we had been displaced to,” he said.\n“Thank God, we miraculously survived. I, my son, my father, my two nephews, and my sister were slightly injured all over our bodies as a result of shrapnel and flying window glass.”\nHe said they were treated at Al-Awda Hospital in Al-Nuseirat camp and discharged later that day.\nLike other local radio stations, Zaman FM stopped broadcasting during the war but continued to publish news via its website and social media.\nApril 12, 2024\nSami Shehadeh, cameraman, TRT Arabic injured by an Israeli shell while reporting in the Nuseirat refugee camp in central Gaza, which led to the loss of his right leg.\nSami Barhoom, TRT Arabic reporter, injured by an Israeli shell while reporting in the Nuseirat refugee camp in central Gaza.\nAhmad Harb was on duty for Al Arabiya TV at the time of the incident and was injured by the Israeli shell.\nCNN stringer Mohammad Al-Sawalhi was struck by shrapnel, resulting in a slight injury to his right hand and bruising on his left leg.\nMarch 31, 2024\nFreelance photojournalist Ali Hamad, whose back was hit with missile shrapnel in an attack on Al-Aqsa hospital.\nFreelance photojournalist Saeed Jars, whose knee was hit by shrapnel in an attack on Al-Aqsa hospital.\nFreelance photojournalist Naaman Shteiwi suffered minor facial injuries in an attack on Al-Aqsa hospital.\nZain Media cameraperson Mohammed Abu Dahrouj was seriously injured in the leg in an attack on Al-Aqsa hospital.\nFreelance photojournalist Nafez Abu Labda suffered a leg injury in an attack on Al-Aqsa hospital.\nAl-Aqsa photographer Ibrahim Labad suffered leg injuries in an attack on Al-Aqsa hospital.\nAl Jazeera photographer Hazem Mazeed, who suffered leg injuries in an attack on Al-Aqsa hospital.\nFreelance photojournalist Magdi Qaraqea was also injured in the attack in an attack on Al-Aqsa hospital, according to CPJ sources. Those sources did not specify his injuries.\nMarch 26, 2024\nAli Abu Harbid\nAbu Harbid, a 35-year-old Palestinian freelance photographer and camera operator, who works for the Qatari-based broadcaster Al Jazeera, was injured in an Israeli airstrike next to a school where he had been staying along with other displaced people in northern Gaza’s Jabalia refugee camp, according to the Beirut-based press freedom group SKeyes and the journalist, who spoke to CPJ.\n“This resulted in me sustaining a large number of shrapnel wounds to my body, and I was subsequently transferred to a hospital,” Abu Harbid told CPJ.\nHe was also injured on October 19, 2024, while covering the bombing of a house in northern Gaza’s Jabalia Al-Nazla area for the Palestinian Red Crescent Society, which he volunteers for.\n“We were surprised by new bombing of the place, and I was injured by shrapnel in my thigh,” he said, adding that he was admitted to Gaza City’s Al-Ahli Baptist Hospital for two days.\nMarch 2, 2024\nMahmoud Haniyeh\nHaniyeh, a 35-year-old Palestinian reporter for the pro-Hamas Al-Risala newspaper, was injured, along with his colleague Khaled Banat, when a missile from an Israeli warplane hit a journalists’ tent opposite the Emirati hospital, west of Rafah, according to the Beirut-based press freedom group SKeyes and the journalists, who spoke to CPJ.\n“We were working in the tent, which resulted in shrapnel hitting me in the back of my body. I received treatment at the American field hospital,” Haniyeh told CPJ.\nKhaled Banat\nBanat, a 59-year-old Palestinian editor for the pro-Hamas Al-Risala newspaper, was injured, along his colleague Mahmoud Haniyeh, when a missile from an Israeli warplane hit a journalists’ tent opposite the Emirati hospital, west of Rafah, according to the Beirut-based press freedom group SKeyes and the journalists, who spoke to CPJ.\n“I was injured in the same bombing and targeting of the journalists’ tent in front of the Emirati hospital, in my right hand, an entry and exit injury,” Khaled Banat told CPJ, adding that he was treated in the American hospital and received three weeks’ additional treatment.\nFebruary 13, 2024\nAl Jazeera Arabic reporter Ismail Abu Omar and freelance camera operator and photojournalist Ahmed Matar were traveling by motorcycle in Miraj, north of Rafah, on February 13, 2024, while reporting on displaced Palestinians in the area, when an Israeli drone strike hit them. Both journalists were wearing protective vests clearly marked “Press” and carrying their equipment, Al Jazeera reported.\nAl Jazeera reported that the journalists received emergency surgery at the European Hospital in Rafah. Abu Omar’s right foot and some fingers on his right hand were amputated, his left leg was severely injured, and pieces of shrapnel remained in his head and chest, the channel said. A photograph shared with CPJ via messaging app showed Matar in the hospital with injuries to his face.\nAbu Omar was later evacuated to Qatar where he is receiving treatment; Matar told CPJ he remains in Gaza.\nA video posted by Al Jazeera Arabic, reviewed by CPJ, appeared to show Abu Omar soon after the attack, wearing a blue press vest and lying on the ground with severe leg injuries as people rushed to provide aid. CPJ also reviewed photographs of the damaged motorcycle that were shared by the Palestinian newspaper Al-Hadath in a messaging app.\nAl Jazeera said in a statement the reporters were deliberately targeted, describing the incident as “a full-fledged crime added to Israel’s crimes against journalists, and a new part in the series of the deliberate targeting of Al Jazeera’s journalists and correspondents in Palestine.”\nIn an online response to CPJ’s February 2025 report about journalist killings, the IDF said, without citing evidence, that “Abu Omar…is a deputy company commander in Hamas’ Eastern Battalion of Khan Yunis. Abu Omar even filmed himself in Kibbutz Nir Oz during the October 7th massacre and published it on social media platforms.”\nAl Jazeera condemned these accusations in a statement, adding that it “recalls Israel’s long record of lies and fabrication of evidence through which it seeks to hide its heinous crimes.”\nAl Jazeera Arabic reporter Ismail Abu Omar and freelance camera operator and photojournalist Ahmed Matar were traveling by motorcycle in Miraj, north of Rafah, on February 13, 2024, while reporting on displaced Palestinians in the area, when an Israeli drone strike hit them. Both journalists were wearing protective vests clearly marked “Press” and carrying their equipment, Al Jazeera reported.\nAl Jazeera reported that the journalists received emergency surgery at the European Hospital in Rafah. Abu Omar’s right foot and some fingers on his right hand were amputated, his left leg was severely injured, and pieces of shrapnel remained in his head and chest, the channel said. A photograph shared with CPJ via messaging app showed Matar in the hospital with injuries to his face.\nAbu Omar was later evacuated to Qatar where he is receiving treatment; Matar told CPJ he remains in Gaza.\nA video posted by Al Jazeera Arabic, reviewed by CPJ, appeared to show Abu Omar soon after the attack, wearing a blue press vest and lying on the ground with severe leg injuries as people rushed to provide aid. CPJ also reviewed photographs of the damaged motorcycle that were shared by the Palestinian newspaper Al-Hadath in a messaging app.\nAl Jazeera said in a statement the reporters were deliberately targeted, describing the incident as “a full-fledged crime added to Israel’s crimes against journalists, and a new part in the series of the deliberate targeting of Al Jazeera’s journalists and correspondents in Palestine.”\nCPJ’s email to the North America Desk of the IDF seeking comment did not immediately receive a reply.\nJanuary 19, 2024\nEmad Ghaboun\nGhaboun, a 29-year-old Palestinian freelance journalist, was injured in an Israeli drone strike while trying to transmit reporting in northern Gaza around 2 p.m. on January 19, 2024.\n“I was…accompanied by fellow journalists. We were preparing a report for Al Jazeera on the worsening food crisis in the region,” Ghaboun told CPJ. His mobile phone, which he had been using to send material to the outlets, was destroyed in the blast.\nGhaboun contributes to several international news organizations, including Al Jazeera, Reuters, and Turkish state-owned Anadolu Agency. He was treated for shrapnel wounds to his chest and body at Al-Awda Hospital for several days, he told CPJ.\nJanuary 18, 2024\nAbdul Rahman Lubbad\nLubbad, a volunteer reporter for the local social media-based Watan Media Agency, was shot while reporting on the bombardment of a civilian target in southern Gaza’s Khan Yunis, according to the Beirut-based press freedom group SKeyes and the journalist, who spoke to CPJ.\n“I was shot in the right shoulder by an Israeli quadcopter drone,” said Lubbad, who moved to Khan Yunis after being displaced from his home near Gaza City at the start of the war.\nHe was taken to Nasser hospital where doctors extracted the bullet from his shoulder.\nJanuary 7, 2024\nHazem Rajab\nRajab, a Palestinian freelance journalist, was injured in an Israeli airstrike while traveling to cover a story in Rafah city in the southern Gaza Strip on January 7, 2024.\nThe same strike killed two journalists: Al-Jazeera journalist Hamza Al Dahdouh, who is the son of Al-Jazeera Gaza bureau chief Wael Al Dahdouh, and freelance journalist Mustafa Thuraya.\nRajab told CPJ he was injured in multiple parts of his body, including his right hand, right eye, and both ears. Due to the difficult conditions in Gaza, Rajab was unable to access adequate medical treatment following the injuries, as local hospitals lacked the capacity to address his complex injuries, Rajab said. Attempts to secure support through local organizations and medical providers were unsuccessful.\nFour months later, on April 9, 2024, Rajab successfully arranged his own medical evacuation and crossed into Egypt, where he is currently pursuing advanced medical treatment, he told CPJ.\nAmer Abu Amr\nAbu Amr was injured in an Israeli strike, minutes before the one that killed Thuraya and Al Dahdouh.\nAhmed al-Bursh\nAl-Bursh was injured in an Israeli strike, minutes before the one that killed Thuraya and Al Dahdouh.\nMohamed al-Qahwaji\nFreelance photographer al-Qahwaji, who works for the privately owned Media Town and White Media, was returning from an assignment in Nasr village, northeast of Rafah in southern Gaza, in a convoy with journalists from Al Jazeera when the other car was hit by an Israeli drone strike, killing Al Jazeera’s Mustafa Thuraya and Hamza al-Dahdouh and injuring Hazem Rajab.\n“A drone fired a missile that landed next to us. The driver moved quickly after the bombing, and we did not expect that we would be the target,” al-Qahwaji told CPJ.\n“After we traveled about 2 kilometers [1.2 miles], the Israeli drone targeted our car again, which led to the martyrdom of my colleagues al-Dahdouh and Thuraya … I sustained serious injuries that left me in the hospital for more than three months,” he said.\nThe IDF later said that Thuraya and al-Dahdouh were targeted because they were terrorists, a charge that has been rejected by their families and Al Jazeera.\nAl-Qahouji said the paramedics initially thought that he had died from his injuries and removed him from the ambulance.\n“They got me out and put me on the side of the road. So I moved to tell them that I was still alive,” said al-Qahwaji.\nHe sustained a wound on the left side of his face, a fractured lower jaw, the loss of 80% of his teeth, and a fractured bone below his left eye, a burst eardrum, and shrapnel wounds all over his body. In addition, his middle finger was amputated, he lost a thumb joint, and his right hand was unable to move properly due to nerve damage.\nAl-Qahouji underwent 45 surgeries to his face over four months, spending much of his time in the intensive care unit.\nDecember 23, 2023\nKhader Marquez\nMarquez, a cameraman for Lebanon’s Hezbollah-owned TV channel Al-Manar was injured after shrapnel from an Israeli missile hit his car on the Khardali road of south Lebanon, injuring his left eye, according to Al-Manar correspondent Ali Shoeib, who was with Marquez, posted about the incident on social media, and spoke to the privately-owned Beirut-based Al-Jadeed TV. The incident also was reported by the privately owned Lebanese Annahar newspaper, the Beirut-based press freedom group SKeyes, the National News Agency, and multiple news reports.\nDecember 22, 2023\nHamza Hammad\nHammad, a 30-year-old Palestinian correspondent for the privately owned Al-Ghad TV sustained severe burns on his face, neck, hands, feet, and back when Israeli warplanes bombed the house where his family were staying in Gaza City, after being displaced from northern Gaza, according to the Beirut-based press freedom group SKeyes and the journalist, who spoke to CPJ.\nHammad said that several family members were killed, while he was admitted to Kamal Adwan Hospital for more than a month. He shared a photograph with CPJ of his swollen burnt face and wrists.\n“I am currently waiting for the war to end so that I can complete my treatment outside the Gaza Strip,” he told CPJ in February 2025, adding that he had already resumed work.\nDecember 20, 2023\nMuath Mohsen\nMohsen, a broadcast engineer at Al-Manara TV Production Company, which provides broadcast services, was injured by shrapnel in the head and neck when an Israeli airstrike hit a house and mosque near the Kuwaiti hospital in Gaza’s southern city of Rafah, according to the Beirut-based press freedom group SKeyes, Palestinian Journalists’ Syndicate, and the journalist, who spoke to CPJ.\nMohsen was treated at the Kuwaiti hospital and then at Deir al-Balah’s Al-Aqsa Martyrs Hospital for two days, followed by a month of outpatient treatment.\n“I underwent surgery on my head, and the shrapnel is still inside my head and neck,” he told CPJ.\nDecember 19, 2023\nIslam Bader\nBader, a Palestinian reporter and presenter for the Hamas-funded Al-Aqsa TV channel, and a contributor to multiple media outlets including the Qatari-funded Al-Araby TV, was injured in the right shoulder and hip in an Israeli airstrike on Block 2 of the Jabalia refugee camp, northern Gaza, on December 19, according to the London-based pan-Arab newspaper Asharq Al-Awsat, Al-Araby TV, and Palestine TV. His colleague Mohamed Ahmed was injured in the same strike. A video posted by Al Jazeera shows the two journalists being treated in Jabalia medical center after the attack. Another video posted by the local Palestine Post website shows Bader and Ahmed lying on the floor of the medical center frowning in pain.\nBader told Al-Araby TV that he was injured by three pieces of shrapnel in his shoulder, and hip.\nBader and Ahmed are among the few journalists still reporting from northern Gaza.\nMohamed Ahmed\nAhmed, a Palestinian reporter for the pro-Hamas Shehab agency and photographer for the Hamas-funded Al-Aqsa TV channel, was injured in the left thigh in an Israeli airstrike on Block 2 of Jabalia refugee camp, northern Gaza, on December 19, according to the London-based pan-Arab newspaper Asharq Al-Awsat, Al-Araby TV, and Palestine TV. His colleague Islam Bader was injured in the same strike. A video posted by Al Jazeera shows the two journalists being treated in Jabalia medical center right after their injury. Another video posted by the local Palestine Post website shows Bader and Ahmed lying on the floor of the medical center frowning in pain.\nDecember 18, 2023\nAshraf Ramadan\nRamadan, a 31-year-old Palestinian photographer who freelances for Britain’s publicly funded BBC and the privately owned Al-Ghad TV, was injured when shrapnel from a missile fired by an Israeli warplane hit his neighbor’s house and damaged his own home in Gaza’s southern city of Rafah, according to the Beirut-based press freedom group SKeyes and the journalist, who spoke to CPJ.\n“I was injured by several pieces of shrapnel in my back, abdomen, right hand, and right leg,” he told CPJ, adding that he was admitted to the city’s Kuwaiti hospital for one day.\nDecember 16, 2023\nAshraf Harara\nHarara, the 46-year-old director of the Palestinian Authority-run Palestine TV channel, and his wife and children were injured by shrapnel when a shell fired by an Israeli tank hit their apartment in central Gaza’s Nuseirat refugee camp, according to the Beirut-based press freedom group SKeyes and the journalist, who spoke to CPJ.\nHarara, a father of four, had been displaced multiple times after his home in the Shuja’iyya neighborhood, east of Gaza City, was bombed.\n“I was exposed to direct tank shell fire without prior warning … I suffered a compound fracture, a cut, and a tear in my right hand, which prevented me from moving it,” he told CPJ, adding that he was admitted to Deir al-Balah’s Al-Aqsa Martyrs Hospital for two weeks and a platinum rod was inserted in his right arm.\n“My wife’s thumb was amputated,” Harara said.\nMohamed Balousha\nBalousha, a reporter for the Emirati-owned Dubai-based Al Mashhad TV, was shot in the thigh while reporting on the war from northern Gaza. According to his outlet Al Mashhad, Al Jazeera, and the Palestinian Journalists’ Syndicate, the bullet was fired by an Israeli sniper. Balousha said in a video that he lost consciousness for about 30 minutes after “six hours of agony” and was roused by the nuzzling of cats he was feeding before the shooting. Al Mashhad said that Israeli forces intercepted the ambulances sent to evacuate Balousha, delaying his transfer to a hospital for treatment.\nIn late November, Balousha broke a story that four premature babies left behind at al-Nasr Children’s Hospital died and their bodies had decomposed after Israel forced the staff to evacuate without ambulances. Balousha accused Israel of directly targeting him.\n“I was wearing everything to prove that I was a journalist, but they deliberately targeted me, and now I am struggling to get the treatment necessary to preserve my life,” he told The Washington Post.\nDecember 15, 2023\nWael Al Dahdouh\nAl Jazeera’s Gaza bureau chief Al Dahdouh was injured by a drone strike while covering the aftermath of nightly Israeli strikes on a UN school sheltering displaced people in the center of Khan Yunis, southern Gaza, according to reports by their Al Jazeera, Middle East Eye, and Reuters. Al Dahdouh was hit with shrapnel in his hand and waist and treated at Nasser Hospital in Khan Yunis. His colleague, camera operator Samer Abu Daqqa, was killed in the same strike.\nMustafa Alkharouf\nAlkharouf, a photographer with the Turkish state-owned Anadolu Agency, was covering Friday prayers near Al-Aqsa Mosque in East Jerusalem when a group of Israeli police and soldiers attacked him, according to Anadolu Agency, footage shared by The Union of Journalists in Israel, and the Palestinian Authority’s official news agency WAFA. Soldiers initially brandished their weapons at Alkharouf, punched him, and then threw him to the ground, kicking him. Alkharouf sustained severe blows, resulting in injuries to his face and body, and was transported by ambulance and treated at Makassed Hospital in East Jerusalem.\nDecember 12, 2023\nMohammad Farhat\nFarhat, a 27-year-old Palestinian volunteer correspondent for the local social media-based outlet Watan Media Agency, was injured while walking past his neighbor’s home when it was hit by an Israeli airstrike in central Gaza’s Nuseirat refugee camp, according to the Beirut-based press freedom group SKeyes and the journalist, who spoke to CPJ.\n“I was seriously injured in my leg,” said Farhat, who was taken to the camp’s Al-Awda Hospital and then to Al-Aqsa Martyrs Hospital in Deir al-Balah. “I stayed there for 12 days, and a platinum rod was inserted in my leg. I am still undergoing surgeries,” he said.\nNovember 23, 2023\nSamed Wajjeh Abu Zarefa\nWajjeh, a 32-year-old Palestinian freelance photojournalist and producer working with NBC News and British daily The Times, was among seven journalists and photographers injured while covering the aftermath of an Israeli airstrike on a house in Khan Yunis, south of the Gaza Strip, according to four journalists who spoke to CPJ.\nThe others injured were: Mohammed Al-Haddad, Haitham Nour Al-Din, Fadi Shana, Fatima Shbair, Amer Sultan, and Amr Tabash.\nWajjeh was treated at Nasser Hospital for bruises to his hand, leg, and body, he told CPJ, adding that “Wearing a helmet and protective vest significantly reduced the severity of my injuries.”\nHaitham Nour Al-Din\nNour Al-Din, a 28-year-old Palestinian freelance photojournalist working with the Frankfurt-based European Pressphoto Agency, was among seven journalists and photographers injured while covering the aftermath of an Israeli airstrike on a house in Khan Yunis, south of the Gaza Strip, according to four journalists who spoke to CPJ.\nThe others injured were: Samed Wajjeh Abu Zarefa, Mohammed Al-Haddad, Fadi Shana, Fatima Shbair, Amr Tabash, and Amer Sultan.\nThe journalist was trapped beneath the rubble for 30 minutes before being rescued by civil defense teams. Nour Al-Din told CPJ he was treated for two days at Nasser Hospital for injuries and bruises to his legs, which made it difficult to walk for a month.\nBefore the war, in 2019, Nour Al-Din won first place in the Photo Portfolio category at the Hamdan International Photography Awards (HIPA) for pictures he took of the Palestinian people.\nFatima Shbair\nShbair, a 28-year-old Palestinian photojournalist for the AP, was among seven journalists and photographers injured while covering the aftermath of an Israeli airstrike on a house in Khan Yunis, south of the Gaza Strip, according to four journalists who spoke to CPJ.\nThe others injured were: Samed Wajjeh Abu Zarefa, Mohammed Al-Haddad, Haitham Nour Al-Din, Fadi Shana, Amer Sultan, and Amr Tabash.\nBefore the war, Shbair received international acclaim for her work documenting life in the Gaza Strip. In 2022, she was recognized in the World Press Photo Contest for her images of Palestinian children. In 2021, she received the Anja Niedringhaus Courage in Photojournalism award by the International Media Foundation, becoming the youngest recipient of the award at 24, since its establishment in 2015.\nFadi Shana\nShana, a 41-year-old Palestinian photojournalist for Reuters, was among seven journalists and photographers injured while covering the aftermath of an Israeli airstrike on a house in Khan Yunis, south of the Gaza Strip, according to four journalists who spoke to CPJ. Images of Shana receiving assistance after being wounded were widely circulated by media outlets and on social media.\nThe others injured were: Samed Wajjeh Abu Zarefa, Mohammed Al-Haddad, Haitham Nour Al-Din, Fatima Shbair, Amer Sultan, and Amr Tabash.\nShana has worked for Reuters for over two decades, covering the Gaza Strip. In February 2024, Shana received the Royal Television Society’s Camera Operator of the Year award for his compelling work documenting life in Gaza before the war.\nShana is the cousin of Fadel Shana, a Reuters photographer who was killed by Israeli forces in 2008.\nAmer Sultan\nSultan, a 30-year-old Palestinian freelance photographer and contributor to BBC Arabic and Emirati-owned Dubai-based Al Mashhad TV, was among seven journalists and photographers injured while covering the aftermath of an Israeli airstrike on a house in Khan Yunis, south of the Gaza Strip, according to four journalists who spoke to CPJ.\nThe others injured were: Samed Wajjeh Abu Zarefa, Mohammed Al-Haddad, Haitham Nour Al-Din, Fadi Shana, Fatima Shbair, and Amr Tabash.\nSultan told CPJ he was treated at Nasser Hospital for bruising.\nAmr Tabash\nTabash, a 27-year-old Palestinian freelance photojournalist and contributor to several outlets, including the BBC and local pro-Fatah Al-Kofiya TV, was among seven journalists and photographers injured while covering the aftermath of an Israeli airstrike on a house in Khan Yunis, south of the Gaza Strip, according to four journalists who spoke to CPJ.\nThe others injured were: Samed Wajjeh Abu Zarefa, Mohammed Al-Haddad, Haitham Nour Al-Din, Fadi Shana, Fatima Shbair, and Amer Sultan.\n“We arrived at the site alongside civil defense and ambulance crews,” Tabash told CPJ in a statement. “As we were filming the destruction, rescue workers were still searching through the rubble for survivors.”\nWhile the reporters were on the ground floor of the damaged building, a nearby explosion caused part of the structure to collapse, Tabash told CPJ.\n“I was trapped under debris and nearly lost my life, as I was at the heart of the collapse,” he told CPJ, adding that he was briefly treated at Nasser Hospital for injuries to his head and body. “Thankfully, my helmet and protective [press] vest helped reduce the severity.”\nMohammed Al-Haddad\nAl-Haddad, a 41-year-old Palestinian freelance photojournalist working with privately-owned Iraqi IA News, was among seven journalists and photographers injured while covering the aftermath of an Israeli airstrike on a house in Khan Yunis, south of the Gaza Strip, according to four journalists who spoke to CPJ. He was injured in multiple places, including a fracture to his left hand, he told CPJ.\nThe others injured were: Samed Wajjeh Abu Zarefa, Haitham Nour Al-Din, Fadi Shana, Fatima Shbair, Amer Sultan, and Amr Tabash.\nNovember 18, 2023\nMohamed Al Sawaf\nMohamed Al Sawaf, an award-winning Palestinian film producer and director who founded the Gaza-based Alef Multimedia production company, was injured in an Israeli airstrike on his home in Shawa Square in Gaza City. The airstrike killed 30 members of his family, including his mother and his father, Mostafa Al Sawaf, who was also a journalist, according to the Palestinian Journalists’ Syndicate, Anadolu Agency, and TRT Arabic.\nMontaser Al Sawaf\nMontaser Al Sawaf, a Palestinian freelance photographer contributing to Anadolu Agency, was injured in the same Israeli airstrike that injured his brother, Mohamed Al Sawaf and killed their parents and 28 other family members, according to the Anadolu Agency, the Palestinian Journalists’ Syndicate, and TRT Arabic.\nNovember 13, 2023\nIssam Mawassi\nAl Jazeera videographer Mawassi was injured after two Israeli missiles struck near journalists in Yaroun in southern Lebanon covering clashes, which also resulted in damage to the journalists’ cars in the area, according to multiple media reports, some of which show the journalists live on air the minute the second missile hit the area. CPJ reached out to Mawassi via a messaging app but didn’t receive any response.\nNovember 9, 2023\nSaid Al-Majdalawi\nAl-Majdalawi, a 33-year-old Palestinian camera operator and video editor working with privately owned Al-Ghad TV, was injured in an Israeli airstrike in Gaza’s southern city of Rafah on November 9, 2023.\n“Israeli warplanes struck a grocery store located beneath residential buildings in Rafah,” Al-Majdalawi told CPJ. “I was documenting the aftermath of the strike when I suddenly realized I had been hit.”\nHe was treated at Kuwaiti Hospital for shrapnel injuries to his hands and legs.\nNovember 8, 2023\nKhaled Abu Sultan\nAbu Sultan, a 31-year-old camera operator for Britain’s privately owned broadcaster ITN Network, was severely injured while preparing to interview two members of a family who had survived a bombing attack on their home in Gaza City, according to the Beirut-based press freedom group SKeyes and the journalist, who spoke to CPJ.\nA missile from an Israeli drone hit the group, killing the two interviewees and a civil defense worker who was recovering bodies from the previous bombing.\n“I was the only survivor,” Abu Sultan told CPJ. “I suffered hearing loss in my left ear … bone loss in my right hand, and shrapnel in my left leg that required the implantation of platinum plates.”\nAbu Sultan was treated at two Gaza hospitals and then flown to the Egyptian capital Cairo, where he was admitted at the Nasser Institute Hospital.\n“My transfer experience was full of risks. I remained in the Institute for treatment for about 15 days, and I am still receiving treatment,” he told CPJ from the house where he was staying in Cairo in February 2025.\nAbu Sultan said his photographic shop and home in Gaza were both destroyed by Israeli bombing in November 2023.\nNovember 2, 2023\nIsmail Abu Hatab\nAbu Hatab, a 32-year-old Palestinian filmmaker and owner of Clight TV production company, was injured by an Israeli airstrike while in his office on the 16th floor of Gaza City’s Al-Ghifari Tower, according to the Beirut-based press freedom group SKeyes and the journalist, who spoke to CPJ.\nAnother strike hit the neighboring Hajji Tower, where an unmanned video camera was broadcasting live feeds of the city from Agence France-Presse news agency’s abandoned office.\n“I was seriously injured in my left leg, as well as some shrapnel in my head, shoulder, back, and mouth,” said Abu Hatab, who was taken to the city’s Al-Shifa Medical Complex, where he had surgery on his leg, and to Al-Quds Hospital, a few kilometers away.\n“On the way, the Israeli occupation forces opened fire on the ambulance, and we miraculously survived,” Abu Hatab said.\nHe was trapped inside Al-Quds Hospital for several months, one of numerous medical facilities targeted by Israeli forces, who said that Hamas operatives were based inside — a charge Hamas denied.\n“The Israeli occupation army besieged us until mid-February in Al-Quds Hospital, and then we were evacuated to the south. But the occupation stopped us at the Netzarim checkpoint for several hours and searched us, and forced me to walk on my injured leg, which led to a crooked leg,” Abu Hatab said.\nAbu Hatab said he was evacuated to Al-Amal Hospital in the southern city of Khan Yunis, which was also under siege, and had to move further south to Rafah.\n“There was no good care due to the overcrowding of the displaced, and I was forced to flee from the city of Rafah again in May 2024 after the occupation stormed it,” Abu Hatab told CPJ in February 2025 from central Gaza’s Deir al-Balah, where he was paying for ongoing treatment although his injury prevented him from working.\nOctober 13, 2023\nThaer Al-Sudani\nAl-Sudani, a journalist for Reuters news agency, was injured in an attack that killed Reuters’ Issam Abdallah near the border in southern Lebanon.\nMaher Nazeh\nNazeh, a journalist for Reuters news agency, was also injured in the same southern Lebanon attack.\nElie Brakhya\nBrakhya, an Al Jazeera TV staff member, was injured as well in the southern Lebanon attack.\nCarmen Joukhadar\nJoukhadar, an Al Jazeera TV reporter, was also wounded in the southern Lebanon attack.\nChristina Assi\nAssi, a photographer for the French news agency Agence France-Pressse, was injured in the southern Lebanon attack.\nDylan Collins\nDylan Collins, a video journalist for AFP, was also injured in the southern Lebanon attack.\nOctober 8, 2023\nSaleh al-Masry\nAl-Masry, the 49-year-old editor-in-chief of the pro-Islamic Jihad news agency Palestine Today, and his wife were injured by a dawn airstrike which destroyed the building next to their home in Gaza City, according to the International Federation of Journalists and al-Masry, who spoke with CPJ.\n“I was injured in my arm and head, and I was admitted to the emergency room at Al-Shifa Medical Complex. My condition did not require me to stay overnight, but my wife was injured by shrapnel, which required her to undergo a number of surgeries,” he told CPJ.\nOctober 7, 2023\nMoath al-Hams\nAl-Hams, a 28-year-old Palestinian journalist, who freelances for several media outlets, including the Qatari-based broadcasters Al Jazeera and Al Jazeera Mubasher and Reuters news agency, was injured in his right hand in an Israeli airstrike on the city of Rafah while covering the aftermath of strikes, according to the journalist, who spoke to CPJ.\n“I sustained a moderate injury to my leg and was admitted to Abu Yousef al-Najjar Hospital east of Rafah for five hours, before being discharged to complete my treatment at home,” al-Hams told CPJ.\nThe Palestinian Authority’s official news agency WAFA and the Palestinian press freedom group MADA said al-Hams’ house in Rafah was bombed on June 8, 2024, which led to its total destruction.\nIbrahim Qanan\nQanan, a correspondent for Al-Ghad channel, was injured by shrapnel in the city of Khan Yunis in southern Gaza.\nCPJ safety advisories\nAs we continue to monitor the war in Israel/Gaza, journalists who have questions about their safety and security can contact us [email protected].\nFor more information, read:\n- Physical Safety: War Reporting\n- Physical and digital safety: Civil Disorder\n- Psychological Safety\n- Physical and digital safety: Arrest and detention\nThese are available in multiple languages, including Arabic.\nMISSING\nOctober 7, 2023\nNidal Al-Wahidi\nNidal Al-Wahidi, a cameraman and photographer in Gaza for the Nablus-based Palestinian broadcaster An-Najah Nbc Channel, went missing near the Erez crossing, known in Gaza as the Beit Hanoun crossing, while reporting on Hamas’ attack on Israel on October 7, 2023 according to news reports, the Palestinian press freedom organization MADA, and a video interview with his father, Suhail Al-Wahidi, on Qatari-owned broadcaster Al Jazeera Mubasher.\nOn assignment? Yes\nHaitham Abdelwahid\nHaitham Abdelwahid, a cameraman and video editor for Ain Media, a Gaza production company, went missing near the Erez crossing, known locally as the Beit Hanoun crossing, while reporting on Hamas’ attack on Israel on October 7, 2023, according to news reports, his employer, and the Palestinian press freedom organization MADA.\nOn assignment? Yes\nClarifications and corrections:\n*Definition of a journalist: CPJ’s research and documentation covers all journalists, defined as individuals involved in news-gathering activity. This definition covers those working for a broad range of publicly and privately funded news outlets, as well as freelancers. In the cases CPJ has documented, multiple sources have found no evidence to date that any journalist was engaged in militant activity.\nCPJ’s global database of killed journalists and media workers includes only those confirmed to have been killed in connection with their work or where it is unclear whether their death was work-related (motive unconfirmed.) Our research is ongoing and we remove names from our list if we determine that a person either was incorrectly identified as a journalist or could not have been working at the time of their death.\nCPJ has removed a Palestinian man, Mohamed Khaireddine, from its database. Khaireddine was previously identified as a journalist, but his family later clarified that he was neither a journalist nor a media support worker.\nCPJ has removed six other Palestinian journalists from its database that were found not to be journalists or media workers: Bahaa Okasha, Salma Mkhaimar, Ahmed Fatima, Mohamed Al Jaja, Assaad Shamallakh, and Mohamed Fayez Abu Matar.\nCPJ has removed two Israeli journalists, Shai Regev and Ayelet Arnin, from its database after their outlets confirmed that the journalists were not on assignment to cover the music festival, nor were they in a position to begin reporting on the attack by Hamas militants that killed them on October 7. CPJ’s global database of killed journalists includes only those who have been killed in connection with their work or where there is still some doubt that their death was work-related.\nAfter receiving reports that Palestinian journalist and presenter Alaa Taher Al-Hassanat may have survived the attack thought to have killed her, CPJ has removed her name from its database pending further investigation.\nOn February 6, 2024, Canadian-Palestinian journalist Mansour Shouman was found alive after being reported missing more than two weeks before. We have removed him from our list of missing journalists.\nAccording to CPJ’s research, Israeli journalist Oded Lifschitz wasn’t working when he was taken as a hostage by Hamas on October 7, 2023. CPJ removed his name from the list of missing journalists after contacting the family.\nThis text has been updated to add detail about the funding of Al-Aqsa TV channel and the editorial stance of Shehab agency.\nOn March 13, 2024, the database numbers were updated to subtract a casualty that did not occur in Israel and the Occupied Palestinian Territory.\nOn April 9, 2025, this page was updated to correct the job description of Ihab Al-Bardini."
    }
  ],
  "argos_summary": "The article discusses the perilous situation for journalists in Gaza amidst the ongoing conflict, highlighting the targeted killings of reporters by Israeli forces, including the recent death of prominent Al Jazeera journalist Anas al-Sharif and four colleagues in an airstrike. Despite international laws protecting journalists, over 180 Palestinian journalists have been killed since the conflict escalated, with many being labeled as militants by the Israeli military without credible evidence. The Committee to Protect Journalists (CPJ) and other press freedom organizations express grave concerns over the systematic targeting of media personnel, which they argue is part of a broader strategy to control the narrative surrounding the war.",
  "argos_id": "KL4FT0V7A"
}