{
  "url": "https://www.yahoo.com/news/articles/trump-admin-considering-softening-laws-200642784.html",
  "authorsByline": "Solcyré Burga",
  "articleId": "fe2604b848944c86bafafd76423e62f4",
  "source": {
    "domain": "yahoo.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://edgecast-img.yahoo.net/mysterio/api/3709e83a51988b828eef007f2fb33404c48901eeea6de0e5cb00dbb75aa12689/ynews/resizefill_w1200/https://media.zenfs.com/en/time_72/8393b8472a17309db9a4fcdb7836cf3f",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T20:06:42+00:00",
  "addDate": "2025-08-11T21:36:04.756030+00:00",
  "refreshDate": "2025-08-11T21:36:04.756032+00:00",
  "score": 1.0,
  "title": "Is the Trump Admin Considering Softening Laws on Cannabis?",
  "description": "\"We’re looking at reclassification, and we’ll make a determination over, I’d say, the next few weeks,\" the President said Monday.",
  "content": "A cannabis flower is seen on November 16, 2023. Credit - Cecilia Sanchez—AFP/Getty\n\nPresident Donald Trump is considering softening federal laws on cannabis, potentially following through on his campaign promise to reclassify the drug and increase access to medical marijuana.\n\n“We’re looking at reclassification, and we’ll make a determination over, I’d say, the next few weeks,” the President said at a Monday press conference.\n\nHis remarks follow a report in the Wall Street Journal that Trump told donors he is weighing reclassifying marijuana as a less dangerous drug.\n\nThe possession and use of marijuana is illegal at the federal level. The substance is classified as a Schedule I drug, meaning it has a “high potential for abuse” and can cause serious psychological or physical dependence. Possession of the drug can result in up to one year in prison and a fine of at least $1,000 under federal law, though penalties vary.\n\nThe Biden Administration moved to reclassify marijuana as a Schedule III drug—a ranking that would lower criminal penalties for it—though officials did not finalize their plans before leaving office. The change in status would also allow marijuana companies to benefit from some tax breaks.\n\nAround 40 states have legalized medical marijuana, though far fewer allow for its recreational use.\n\nTrump’s position is a departure from the view of traditional conservative politicians, but he expressed curiosity in the idea of decriminalization and has shown support for medical marijuana, in particular.\n\n“As President, we will continue to focus on research to unlock the medical uses of marijuana to a Schedule 3 drug, and work with Congress to pass common sense laws, including safe banking for state-authorized companies, and supporting states' rights to pass marijuana laws,” Trump wrote on Truth Social last September.\n\nThe move could prove popular: Nearly nine in ten adults believe that marijuana should be legal for either medical or recreational use, according to a 2025 Pew Research Center report.\n\nBut the President has been somewhat inconsistent in his stance. Earlier this year, the Administration included a budget bill provision that would repeal existing protections for medical cannabis patients.\n\nHere’s what Trump has said regarding cannabis legalization.\n\nBefore the launch of his political career, Trump signaled his support for the legalization of drugs to better combat the ongoing drug crisis in the country. \"We're losing badly the war on drugs,\" Trump said in an April 1990 article in the Sarasota Herald-Tribune. “You have to legalize drugs to win that war. You have to take the profit away from these drug czars.” His stance, however, has slightly shifted as he has grown more prominent in the national eye.\n\nTrump told Nevada rallygoers in November 2015 that he believed marijuana legalization should be left to the states, while also calling for greater research into areas that do allow for its recreational use, such as Colorado. The state legalized the drug recreationally via a 2012 state constitutional amendment, becoming the second state to do so at the time.\n\nIn a February 2016 interview with Fox News, the President cited some concerns about marijuana dealers and the industry as a whole while simultaneously stating his support. “In some ways I think it’s good and in other ways it’s bad. I do want to see what the medical effects are. I have to see what the medical effects are and, by the way — medical marijuana, medical? I’m in favor of it a hundred percent,” Trump said at the time.\n\nDuring his first presidential term\n\nStill, the President failed to take action on the matter during his first term.\n\nIn 2018, the Trump Administration lifted a policy enacted under the Obama Administration that directed federal authorities not to pursue marijuana prosecutions in states where the drug is legal.\n\nThe President also proposed terminating a policy that bars the Justice Department from using funds to stop state-level medical marijuana programs numerous times under his first term, but legislators kept such protections in the spending bills.\n\nTrump has been more pointed in his promises to voters regarding the reclassification of marijuana as a Schedule III drug.\n\nThe President revealed in September 2024 that he would be voting in favor of Florida’s Amendment 3, a constitutional amendment that would have legalized the possession, sale, and recreational use of marijuana. “As I have previously stated, I believe it is time to end needless arrests and incarcerations of adults for small amounts of marijuana for personal use. We must also implement smart regulations, while providing access for adults to safe, tested product[s],” Trump said on Truth Social at the time.\n\nAlthough a majority of voters were in favor of the amendment, the measure was ultimately defeated as it failed to reach the 60% threshold necessary to pass.\n\nThe President has recently signaled that changes regarding the federal restrictions on marijuana could be reduced.\n\nTrulieve, a marijuana dispensary company, and the U.S. Cannabis Council gave a combined $1 million to Trump’s presidential inauguration in 2024. A chief executive of the cannabis company was reportedly present at the New Jersey fundraiser where Trump reportedly said that he was considering revisiting existing federal marijuana policies. \n\nScotts Miracle-Gro CEO James Hagedorn told Fox News that Trump had informed him and others that he would follow through on his statement. “This is a promise he made during the campaign and promises made are promises kept,” Hagedorn said.",
  "medium": "Article",
  "links": [
    "https://news.google.com/newspapers?nid=1755&dat=19900414&id=eUoeAAAAIBAJ&sjid=EHoEAAAAIBAJ&pg=4675,4533445&hl=en",
    "https://www.npr.org/2016/09/08/493157980/platform-check-presidential-candidates-on-legalizing-marijuana",
    "https://www.youtube.com/watch?v=xkA5xmk74TQ",
    "https://www.washingtonpost.com/news/post-politics/wp/2015/10/29/trump-wants-marijuana-legalization-decided-at-the-state-level/?wpmm=1&wpisrc=nl_daily202",
    "https://floridaphoenix.com/2024/11/05/amendment-3-comes-up-short-of-the-60-required-for-passage/",
    "https://www.wsj.com/politics/policy/trump-marijuana-federal-drug-classification-01a73b8c?gaa_at=eafs&gaa_n=ASWzDAjKySX-CTBL8eYuymi6OsSUJSxipL120E52rlYus1sp3_KYGoIsb7gXOgHiQQc%3D&gaa_ts=689a4768&gaa_sig=W5MUtZp4_-5uFtbh1NG9FeA1xMKlbSoVQYh8G3BW1kjjyTozH5CCdX0rCZmj1ROrg1xMfv5qQMzjCSoojMCzWA%3D%3D",
    "https://truthsocial.com/@realDonaldTrump/posts/113105431683796730",
    "https://norml.org/blog/2025/06/04/trump-budget-proposal-rescinds-long-standing-federal-protections-for-medical-cannabis-patients/",
    "https://www.pewresearch.org/short-reads/2025/07/08/facts-about-marijuana/",
    "https://cannabis.colorado.gov/legal-cannabis-use-in-colorado",
    "https://www.marijuanamoment.net/trump-budget-proposes-ending-state-medical-marijuana-protections-and-blocking-dc-from-legalizing/",
    "https://apnews.com/article/health-biden-cabinet-united-states-government-19f6bfec15a74733b40eaf0ff9162bfa",
    "https://uscode.house.gov/view.xhtml?req=granuleid:USC-prelim-title21-section844&num=0&edition=prelim"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "medical marijuana",
      "weight": 0.0996269
    },
    {
      "name": "marijuana laws",
      "weight": 0.09378903
    },
    {
      "name": "marijuana companies",
      "weight": 0.093511865
    },
    {
      "name": "President Donald Trump",
      "weight": 0.09142633
    },
    {
      "name": "existing federal marijuana policies",
      "weight": 0.0890046
    },
    {
      "name": "marijuana legalization",
      "weight": 0.088947475
    },
    {
      "name": "marijuana",
      "weight": 0.08663074
    },
    {
      "name": "marijuana dealers",
      "weight": 0.08530598
    },
    {
      "name": "marijuana prosecutions",
      "weight": 0.084986866
    },
    {
      "name": "Trump",
      "weight": 0.082400724
    }
  ],
  "topics": [
    {
      "name": "Cannabis"
    },
    {
      "name": "Social Issues"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    },
    {
      "name": "Health"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.85888671875
    },
    {
      "name": "/Sensitive Subjects/Recreational Drugs",
      "score": 0.76318359375
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.591796875
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.55810546875
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Drug Laws & Policy",
      "score": 0.4931640625
    },
    {
      "name": "/Law & Government/Legal/Other",
      "score": 0.38916015625
    }
  ],
  "sentiment": {
    "positive": 0.16457097,
    "negative": 0.42801252,
    "neutral": 0.40741652
  },
  "summary": "President Donald Trump is considering softening federal laws on cannabis, potentially following his promise to reclassify the drug and increase access to medical marijuana. This move follows a report that Trump told donors that he is considering reclassifying marijuana as a less dangerous drug. The change in status would allow marijuana companies to benefit from some tax breaks. The move could be popular with nearly 90% of adults believe that marijuana should be legal for either medical or recreational use, according to a 2025 Pew Research Center report. However, the President has been inconsistent in his stance regarding cannabis legalization. He has previously stated his support for decriminalization and suggested that marijuana legalization should be left to the states, while he has called for greater research into areas that allow for its recreational use.",
  "shortSummary": "President Donald Trump is considering reclassifying marijuana as a less dangerous drug, potentially benefiting medical marijuana and boosting tax benefits for marijuana companies.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "96f3f422594b479eb02ed800c4239e1d",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://apnews.com/article/health-biden-cabinet-united-states-government-19f6bfec15a74733b40eaf0ff9162bfa",
      "text": "Sessions terminates US policy that let legal pot flourish\nSessions terminates US policy that let legal pot flourish\nWASHINGTON (AP) — The Trump administration threw the burgeoning movement to legalize marijuana into uncertainty Thursday as it lifted an Obama-era policy that kept federal authorities from cracking down on the pot trade in states where the drug is legal. Attorney General Jeff Sessions will now leave it up to federal prosecutors to decide what to do when state rules collide with federal drug law.\nSessions’ action, just three days after a legalization law went into effect in California, threatened the future of the young industry, created confusion in states where the drug is legal and outraged both marijuana advocates and some members of Congress, including Sessions’ fellow Republicans. Many conservatives are wary of what they see as federal intrusion in areas they believe must be left to the states.\nRepublican Sen. Cory Gardner, who represents Colorado, one of eight states that have legalized marijuana for recreational use, said the change contradicts a pledge Sessions made to him before being confirmed as attorney general. Gardner promised to push legislation to protect marijuana sales, saying he was prepared “to take all steps necessary” to fight the change, including holding up the confirmation of Justice Department nominees. Another Republican senator, Lisa Murkowski of Alaska, called the announcement “disruptive” and “regrettable.”\nColorado’s U.S. attorney, Bob Troyer, said his office won’t change its approach to prosecution, despite Sessions’ guidance. Prosecutors there have always focused on marijuana crimes that “create the greatest safety threats” and will continue to be guided by that, Troyer said.\nThe largely hands-off approach to marijuana enforcement set forth by Barack Obama’s Justice Department allowed the pot business to flourish into a sophisticated, multimillion-dollar industry that helps fund some state government programs. What happens now is in doubt.\n“In deciding which marijuana activities to prosecute under these laws with the Department’s finite resources, prosecutors should follow the well-established principles that govern all federal prosecutions,” considering the seriousness of a crime and its impact on the community, Sessions told prosecutors in a one-page memo.\nWhile Sessions, a longtime marijuana foe, has been carrying out a Justice Department agenda that follows Trump’s top priorities on such issues as immigration and opioids, this change reflects his own concerns. He railed against marijuana as an Alabama senator and has assailed it as comparable to heroin.\nTrump, as a candidate, said pot should be left up to the states, but his personal views on marijuana remain largely unknown.\nIt is not clear how the change might affect states where marijuana is legal for medical purposes. A congressional amendment blocks the Justice Department from interfering with medical marijuana programs in states where it is allowed. Justice officials said they would follow the law, but would not preclude the possibility of medical-marijuana related prosecutions.\nOfficials wouldn’t say whether federal prosecutors would target marijuana shops and legal growers, nor would they speculate on whether pot prosecutions would increase.\nThey denied the timing was connected to the opening of California sales, which are projected to bring in $1 billion annually in tax revenue within several years. And, the officials said, Thursday’s action might not be the only step toward greater marijuana enforcement. The department has the authority to sue states on the grounds that state laws regulating pot are unconstitutional, pre-empted by federal law.\nAsked about the change, White House spokeswoman Sarah Sanders said only that Trump’s top priority is enforcing federal law “and that is regardless of what the topic is, whether it’s marijuana or whether it’s immigration.”\nThe Obama administration in 2013 announced it would not stand in the way of states that legalize marijuana, so long as officials acted to keep it from migrating to places where it remained outlawed and keep it out of the hands of criminal gangs and children. That memo, written by then-Deputy Attorney General James M. Cole, had cleared up some of the uncertainty about how the federal government would respond as states began allowing sales for recreational and medical purposes.\nBut the Sessions Justice Department believed the Cole memo created a “safe harbor” for marijuana by allowing states to flout federal law, Justice Department officials said. Sessions, in his memo, called the Obama guidance “unnecessary.”\nHe and some law enforcement officials in states such as Colorado blame legalization for a number of problems, including drug traffickers who have taken advantage to illegally grow and ship the drug across state lines, where it can sell for much more.\nMarijuana advocates argue those concerns are overblown and contend legalizing the drug reduces crime by eliminating the need for a black market. They quickly condemned Sessions’ move as a return to outdated drug-war policies that unduly affected minorities.\nSessions “wants to maintain a system that has led to tremendous injustice ... and that has wasted federal resources on a huge scale,” said Maria McFarland Sanchez-Moreno, executive director of the Drug Policy Alliance. “If Sessions thinks that makes sense in terms of prosecutorial priorities, he is in a very bizarre ideological state, or a deeply problematic one.”\nBut the decision was a win for marijuana opponents who had been urging Sessions to take action.\n“There is no more safe haven with regard to the federal government and marijuana, but it’s also the beginning of the story and not the end,” said Kevin Sabet, president and CEO of Smart Approaches to Marijuana, who was among several anti-marijuana advocates who met with Sessions last month. “This is a victory. It’s going to dry up a lot of the institutional investment that has gone toward marijuana in the last five years.”\nYet confusion remains.\nJane Stinson, part-owner of the retail marijuana shop Enlighten Alaska in Anchorage, called Thursday’s action confusing and worried that it could harm her business. The change, she said, “can have so many ripple effects we just don’t know.”\nThe change reflects yet another way in which Sessions, who served as a federal prosecutor at the height of the drug war in Mobile, Alabama, has reversed more lenient Obama-era criminal justice policies. While his Democratic predecessor Eric Holder told federal prosecutors to avoid seeking long mandatory minimum sentences when charging certain lower-level drug offenders, for example, Sessions issued an order demanding the opposite, telling them to pursue the most serious charges possible against most suspects.\nA task force Sessions convened to study pot policy made no recommendations for upending the legal industry but instead encouraged Justice officials to keep reviewing the Obama administration’s more hands-off approach, something Sessions promised to do.\n___\nAssociated Press writers Nicholas Riccardi and Kathleen Foody contributed from Denver."
    },
    {
      "url": "https://www.marijuanamoment.net/trump-budget-proposes-ending-state-medical-marijuana-protections-and-blocking-dc-from-legalizing/",
      "text": "Politics\nTrump Budget Proposes Ending State Medical Marijuana Protections And Blocking DC From Legalizing\nPresident Trump proposed ending an existing policy that protects state medical marijuana programs from Justice Department interference as part of his fiscal year 2021 budget plan released on Monday.\nThe rider, which has been renewed in appropriations legislation every year since 2014, stipulates the the Justice Department can’t use its funds to prevent states or territories “from implementing their own laws that authorize the use, distribution, possession, or cultivation of medical marijuana.”\nThis isn’t the first time that an administration has requested that the rider be stricken. Trump’s last two budgets omitted the medical cannabis protections language, and President Obama similarly asked for the policy to be removed. In all cases, Congress has ignored those requests and renewed the protections in spending bills.\nDuring last year’s appropriations season, the House approved an even more expansive amendment that would have provided protections for all state and territory marijuana programs, rather than just medical cannabis systems. But the Senate did not follow suit and the provision was not included in final fiscal year 2020 legislation sent to Trump’s desk.\nWhen Trump signed that large-scale spending legislation in December, he attached a statement that said he is empowered to ignore the congressionally approved medical cannabis rider, stating that the administration “will treat this provision consistent with the President’s constitutional responsibility to faithfully execute the laws of the United States.”\nCannabis is also mentioned in several other places in Trump’s new budget proposal for next year. For example, it contains another long-standing rider that blocks Washington, D.C. from using local tax dollars to legalize marijuana sales.\nSeparately, the plan requests that funds be set aside to help the Food and Drug Administration (FDA) invest “in priority activities,” including the “regulation of cannabis and cannabis derivatives.” FDA is actively developing regulations for CBD since hemp and its derivatives were federally legalized under the 2018 Farm Bill.\n“FDA recognizes the potential opportunities that cannabis or cannabis-derived compounds may offer, and acknowledges the significant interest in these possibilities,” the agency said in a summary. “FDA is aware that companies market products containing cannabis and cannabis-derived compounds in ways that violate the law and may put consumer health and safety at risk.”\n“Questions remain regarding the safety of these compounds,” it continued. “FDA is committed to protecting the public health and improving regulatory pathways for the lawful marketing of cannabis and cannabis-derived products within the agency’s jurisdiction.”\nFDA said it was important to fund these regulatory efforts because it’s an example of an issue with “rising public health needs as growing\nmarkets outpace increases to Agency resources.”\nThe agency requested $5 million to “continue enforcing the law to protect patients and the public while also providing potential regulatory pathways, to the extent permitted by law, for products containing cannabis and cannabis-derived compounds.”\n“FDA is seeing a significant increase in activity relating to the marketing of unlawful cannabis-derived products, especially those containing cannabidiol (CBD), since the Farm Bill passed. In many cases, product developers make unproven claims to treat serious or life-threatening diseases, and patients may be misled to forgo otherwise effective, available therapy and opt instead for a product that has no proven value or may cause them serious harm.”\nIt also outlined how it intends to use the funds across four different branches within FDA.\nAbout $4 million will be allocated to an initiative designed to “better regulate the usage of cannabis-derived substances, such as cannabidiol (CBD), in FDA-regulated products such as dietary supplements and when used as unapproved food additives.”\nIt will also “support regulatory activities, including developing policies and continue to perform its existing regulatory responsibilities including review of product applications, inspections, enforcement, and targeted research.”\nHalf a million dollars will go toward FDA’s Animal Drugs and Feeds Program in order to “strengthen its capacity to evaluate scientific data related to the safe use of cannabis and cannabis derivatives in animal products.”\nFDA’s Office of Regulatory Affairs would receive $2 million to help “regulate and inspect establishments manufacturing FDA regulated products containing cannabis and cannabis-derived compounds.”\n“The initiative will support regulatory activities, including developing policies and continue to perform its existing regulatory responsibilities including review of product applications, inspections, enforcement, and targeted research,” the agency said. “FDA must support oversight of increasing numbers of marketed FDA-regulated products containing cannabis-derived substances that may put the public at risk.”\nAnother “priority component” of the budget is to fund cleanup efforts for illicit marijuana grows on federal public lands.\nThe Office of National Drug Control Policy (ONDCP) would also take a serious budget hit under the president’s proposal. If enacted, ONDCP’s funding would go from the $425 million it was allotted for 2020 to just $29 million for 2021—an approximately 90 percent cut. Trump included a similar request in prior budgets, but Congress rejected the cuts\nSome of those dollars for ONCDP would be transferred to the Drug Enforcement Administration (DEA) to “improve coordination of drug enforcement efforts among Federal, State, and local law enforcement agencies in the U.S.” through the High Intensity Drug Trafficking Area program, the document states. Other dollars for grants to local anti-drug groups would be moved to the Department of Health and Human Services.\nONDCP, which is an office within the White House, applauded Trump’s request for $35.7 billion to fund “counter-drug efforts” in a press release. Jim Carroll, the offices’s director, said “President Trump has brought a relentless, whole-of-government approach to combating the crisis of addiction in our country.”\n“The FY 2021 budget request sends a strong message that, although we’ve seen signs of real progress, the Trump Administration will not let up in our efforts to save American lives,” he said. “Whether it is going after drug traffickers, getting people struggling with addiction the help they need, or stopping drug misuse before it starts, this budget request ensures our partners will have the resources needed to create safer and healthier communities across the Nation.”\nThe budget also prioritizes funding for the implementation of a domestic hemp program since the crop was legalized. It calls for $17 million for 2021 for the program, which “provides a national regulatory framework for commercial production of industrial hemp production in the U.S. through regulations and guidance.”\n“In addition to those regulated under USDA plans, USDA approves state and Tribal nation plans to provide licensing services, technical assistance, compliance, and program management support,” the budget states. “In 2021, USDA will administratively implement fees to cover the Government’s full cost for providing services to beneficiaries of this program.”\nAnother current rider that prohibits the Justice Department from contravening an industrial hemp research program was proposed to be removed. However, that provision is essentially redundant under the new agriculture law, which transferred jurisdiction of the crop from DEA to the U.S. Department of Agriculture.\nThis story has been updated to include additional information about cannabis-related funding for FDA.\nPhoto courtesy of Philip Steffan."
    },
    {
      "url": "https://www.npr.org/2016/09/08/493157980/platform-check-presidential-candidates-on-legalizing-marijuana",
      "text": "Platform Check: Presidential Candidates On Legalizing Marijuana\nPlatform Check: Presidential Candidates On Legalizing Marijuana\nSeveral states are voting on legalizing marijuana in November. NPR takes a look at where the presidential candidates stand on the issue of legal pot.\nAUDIE CORNISH, HOST:\nNow for an issue that doesn't get a lot of time on the campaign trail but will be something the next president has to deal with - what to do about the nation's growing patchwork of marijuana laws. That's our topic on this week's Platform Check, where we examine what the candidates would do if they were president. NPR's justice correspondent Carrie Johnson is in the studio with us. Welcome back, Carrie.\nCARRIE JOHNSON, BYLINE: Hey, Audie.\nCORNISH: So nine states will vote on marijuana-related ballot measures this fall. Five would legalize the drug for recreational use, four for medical use. But under federal law right now, it's still illegal to possess or sell marijuana, right?\nJOHNSON: Absolutely. Marijuana is tightly restricted under the Controlled Substances Act. Authorities believe it has a high potential for abuse, and there's no federal currently accepted medical use. Under the law, it gets the same treatment as heroin and LSD.\nAnd just last month, the Drug Enforcement Administration rejected attempts to loosen some of those restrictions on marijuana - what's called rescheduling the drug. Here's what the DEA leader, Chuck Rosenberg, told me about that.\nCHUCK ROSENBERG: Well, marijuana is not as dangerous as heroin, for instance - clearly not as dangerous. But this decision isn't based on danger. This decision is based on whether or not marijuana, as determined by the FDA, is a safe and effective medicine. And it's not.\nJOHNSON: The DEA did open up a way for more universities and institutions to grow marijuana for federal research purposes, and the Obama administration says it does support a lot more study of whether some component part of marijuana could be useful for medical patients.\nCORNISH: All right, so that's where things stand right now at this White House. And we're going to dig into what the presidential candidates have been saying, starting with Hillary Clinton.\nJOHNSON: Clinton says she wants to reschedule marijuana to loosen some of those restrictions on it. She talked about her thinking on a town hall on ABC this year.\n(SOUNDBITE OF ARCHIVED RECORDING)\nHILLARY CLINTON: And we need to be doing research on it because I am a hundred percent in favor of medical uses for marijuana. But I want to know what the evidence is.\nI'm also someone who believes that the states can be those laboratories of democracy. So I'm watching carefully what's happening in the states that have legalized it.\nJOHNSON: In other words, Hillary Clinton wants more science and to leave things to the states.\nCORNISH: Now, what has Donald Trump said about all this?\nJOHNSON: Audie, it's been a little bit difficult to pin Donald Trump down. The campaign didn't respond to my request for detailed information. Twenty-five years ago, long before Donald Trump became a national political figure, he said he backed legalization of marijuana, at least for adults. But Bill O'Reilly, the Fox News host, asked Trump about his position on this issue back in February.\n(SOUNDBITE OF ARCHIVED RECORDING)\nDONALD TRUMP: I would really want to think about that one, Bill...\nBILL O'REILLY: All right.\nTRUMP: ...Because in some ways, I think it's good, and in other ways, it's bad. I do want to see what the medical effects are.\nJOHNSON: Audie, Trump went on to say he's a hundred percent in favor of medical marijuana. I talked today with Michael Collins of the Drug Policy Alliance, which supports legalizing the drug, and Collins told me that close aides to Donald Trump, people like New Jersey Governor Chris Christie and Alabama Senator Jeff Sessions, have taken a hard line against marijuana legalization.\nCORNISH: Now, what about the third party candidates Jill Stein and Gary Johnson? I know this issue does come up quite a bit for them.\nJOHNSON: Yeah, Gary Johnson actually worked as CEO of a marijuana business, a job that he left to run as the Libertarian candidate for the White House. He has openly talked about his use of medical marijuana, though he says he's stopped doing that when he began the run for the White House. He's endorsed by the Marijuana Policy Project, which has given him an A-plus on the issue. They gave Jill Stein of the Green Party an A-plus as well.\nCORNISH: That's NPR's justice correspondent Carrie Johnson. Carrie, thanks so much.\nJOHNSON: You're welcome.\nCopyright © 2016 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nAccuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record."
    },
    {
      "url": "https://www.pewresearch.org/short-reads/2025/07/08/facts-about-marijuana/",
      "text": "The use and possession of marijuana is illegal under U.S. federal law, but most states allow people to access the drug in some form, either for medical or recreational purposes. The changing policy landscape has coincided with a decades-long rise in public support for legalization, which a majority of Americans now favor.\nHere are nine facts about Americans’ views of and experiences with marijuana, based on Pew Research Center surveys and other sources.\nThe vast majority of Americans support legalizing marijuana in some way, according to a January-February 2025 Center survey. Around nine-in-ten U.S. adults say either that marijuana should be legal for medical and recreational use (54%) or that it should be legal for medical use only (33%). Another 12% say the drug should not be legal at all. These views have held relatively steady over the past six years.\nViews on marijuana legalization differ by age, political party and other factors, according to the January survey. While small shares across demographic groups say marijuana should not be legal at all, those least likely to support legalization for both medical and recreational use include:\n- Older adults: 31% of Americans ages 75 and older favor legalizing marijuana for both uses, as do 49% of those ages 65 to 74. By contrast, 65% of adults under 30 support legalization for both uses.\n- Republicans: 43% of Republicans and GOP-leaning independents favor legalization for both uses, compared with 66% of Democrats and Democratic leaners. Notably, moderate and liberal Republicans (56%) and conservative and moderate Democrats (57%) express similar levels of support.\n- Hispanic and Asian Americans: About four-in-ten Hispanic (42%) and Asian (39%) adults support legalizing marijuana for both uses. That compares with more than half of White (58%) and Black (57%) adults.\nSupport for marijuana legalization has increased dramatically in recent decades. In addition to asking specifically about medical and recreational use, both Pew Research Center and Gallup have asked Americans about legalizing marijuana use in a general way. (“Do you think the use of marijuana should be legal, or not?”) Gallup asked this question most recently, in 2023. That year, 70% of adults expressed support for legalization, more than double the share who favored this in 2000.\nRelated: How U.S. Public Opinion Has Changed in 20 Years of Our Surveys\nAbout half of U.S. adults (51%) say they have ever used marijuana, according to the 2023 National Survey on Drug Use and Health. That’s less than the 85% who say they have ever consumed alcohol and the 65% who have ever used tobacco products or nicotine vaping devices.\nThough a large share of Americans say they’ve used marijuana in their lifetime, far fewer are current users, according to the same survey. In 2023, 23% of adults said they had used marijuana in the prior year, while 16% had used it in the prior month.\nWhile many Americans say legalizing recreational marijuana has economic and criminal justice benefits, views on these and other impacts vary, according to a 2024 Center survey.\n- 52% of U.S. adults say legalizing marijuana for recreational use is good for local economies, while 17% say it is bad.\n- 42% say legalization makes the criminal justice system fairer, compared with 18% who say it makes the system less fair.\n- 27% say legalizing recreational marijuana decreases the use of other drugs like heroin, fentanyl and cocaine, while 29% say it increases use.\n- 21% say legalization makes communities safer; 34% say it makes them less safe.\nStill, sizable shares say legalization has no impact on each of these aspects.\nDemocrats and adults under 50 are more likely than Republicans and older people to say legalizing marijuana has a positive impact in each of these areas.\nMost Americans support easing penalties for people with marijuana convictions, a 2021 Center survey found. Two-thirds of U.S. adults favored releasing people from prison who are being held for marijuana-related offenses only, including 41% who strongly favored this. And 61% supported removing or expunging marijuana-related offenses from people’s criminal records.\nYounger adults, Democrats and Black Americans were especially likely to support these changes. For instance, 74% of Black adults favored releasing people from prison who are being held only for marijuana-related offenses, and an identical share favored removing or expunging marijuana-related offenses from criminal records.\nTwenty-four states and the District of Columbia allow small amounts of marijuana for both recreational and medical use, according to the National Conference of State Legislatures.\nAnother 24 states do not permit recreational use but have some type of medical marijuana access program, though the products that doctors can prescribe and the types of patients who are eligible vary from place to place. Eight of these states only allow for the use of certain products that are low in THC – the main psychoactive substance in cannabis.\nTexas Gov. Greg Abbott recently signed off on a major expansion of the state’s medical marijuana program, but the changes haven’t taken effect yet. In Nebraska, voters approved an initiative in 2024 that legalized medical marijuana, but the state has not yet issued the necessary licenses permitting businesses to handle the drug. (Both states are included in the count of 24 states that allow medical use.)\nThe two remaining states – Idaho and Kansas – do not have any type of access program for cannabis products.\nAs of 2024, more than half of Americans (54%) lived in a state where recreational marijuana use is legal, according to a Center analysis of data from the U.S. Census Bureau and other sources. This analysis looked at state-level legislation in all 50 states and D.C.\nColorado and Washington in 2012 became the first states to pass legislation legalizing recreational marijuana use. Delaware, Minnesota and Ohio legalized recreational use most recently, all in 2023. But efforts to legalize the drug for recreational use failed at the ballot box in all three states that were considering the issue in 2024: Florida, North Dakota and South Dakota.\nAbout eight-in-ten Americans (79%) live in a county with at least one cannabis dispensary, according to the 2024 analysis. At the time of this study, there were nearly 15,000 marijuana dispensaries nationwide, with 76% in states where recreational use is legal (including D.C.).\nCalifornia, Oklahoma, Florida, Colorado and Michigan were among the states with the largest number of dispensaries.\nNote: Here is the question used in the January-February 2025 survey, the topline and the survey methodology. This is an update of a post originally published April 26, 2021."
    }
  ],
  "argos_summary": "President Donald Trump is contemplating reclassifying cannabis to increase access to medical marijuana, a move that aligns with his campaign promise. He indicated that a decision on reclassification could be made in the coming weeks, following a report that he views marijuana as less dangerous than previously classified. While the Biden Administration had aimed to reclassify marijuana as a Schedule III drug, Trump's potential shift reflects a growing public support for legalization, with nearly 90% of adults favoring legal access for medical or recreational use.",
  "argos_id": "KMM1Q3RHY"
}