{
  "url": "https://gizmodo.com/nvidias-six-word-response-to-china-2000641571",
  "authorsByline": "Luc Olinga",
  "articleId": "1f512a74d084468a98726f8152b77d0c",
  "source": {
    "domain": "gizmodo.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://gizmodo.com/app/uploads/2025/01/Nvidia-CEO-Jensen-Huang-RTX-50-Series-GPU-1-1200x675.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T20:16:50+00:00",
  "addDate": "2025-08-11T21:22:26.167624+00:00",
  "refreshDate": "2025-08-11T21:22:26.167626+00:00",
  "score": 1.0,
  "title": "Nvidia’s Six-Word Response to China",
  "description": "Just days after securing a controversial deal to re-enter the Chinese market, the AI giant is on the defensive, forcefully denying accusations from Beijing that its chips are a tool for espionage.",
  "content": "Nvidia is on the defensive. Just as the AI giant secured a fragile, high-stakes deal to resume selling its specialized chips to China, the company is now being forced to fight back against accusations from Chinese state media that its products are a national security threat.\n\nThe attack, which came just hours after the deal with the Trump administration was reported, puts Nvidia in a geopolitical vise, caught between a skeptical Washington and a newly hostile Beijing.\n\nAccording to Reuters, a social media account affiliated with state broadcaster CCTV accused the specialized H2O chips, which Nvidia designed for the Chinese market, of having a supposed “backdoor access” that could allow for remote control. The post also claimed the chips were neither technologically advanced nor environmentally friendly.\n\n“NVIDIA does not have ‘backdoors’ in our chips that would give anyone a remote way to access or control them,” a spokesperson said in a statement.\n\nThe company elaborated on its position in a recent blog post, arguing that calls from some policymakers to build “kill switches” into its hardware are fundamentally misguided.\n\n“Embedding backdoors and kill switches into chips would be a gift to hackers and hostile actors,” the company wrote. “It would undermine global digital infrastructure and fracture trust in U.S. technology.” Nvidia stressed the crucial role its chips already play in trusted systems worldwide, from medical scanners to air-traffic control.\n\nThe Deal That Sparked the Fire\n\nThis new firestorm in Beijing was ignited by the unconventional deal Nvidia just struck with Washington. To return to China after months of a federal ban, the company agreed to pay the Trump administration 15% of the revenue generated by its H2O chip sales there.\n\nThe deal was personally negotiated, and in a press conference on Monday, President Donald Trump offered a stunningly blunt assessment of the very technology he had just approved for export. He claimed he had initially asked for a 20% cut but that Nvidia CEO Jensen Huang negotiated it down. Trump then dismissed the H2O chips as “obsolete” and “an old chip that China already has.”\n\nThe president’s comments perfectly capture the absurd tightrope Nvidia is now forced to walk. To satisfy Washington, the company had to create a chip weak enough to be deemed “obsolete.” But to satisfy Beijing, it must sell a chip that is powerful enough to be worth buying and trustworthy enough not to be seen as a tool for American espionage.\n\nNow, both sides are publicly questioning the product. The U.S. President is calling it old news, while Chinese state media is calling it a security risk. For Nvidia, the stakes are astronomical, and navigating the treacherous waters between these two global superpowers may prove to be the toughest deal of all.",
  "medium": "Article",
  "links": [
    "https://blogs.nvidia.com/blog/no-backdoors-no-kill-switches-no-spyware/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "chips",
      "weight": 0.09621382
    },
    {
      "name": "Nvidia",
      "weight": 0.08368598
    },
    {
      "name": "Chinese state media",
      "weight": 0.082264975
    },
    {
      "name": "Nvidia CEO Jensen Huang",
      "weight": 0.0811925
    },
    {
      "name": "President Donald Trump",
      "weight": 0.07233524
    },
    {
      "name": "Donald Trump",
      "weight": 0.06696967
    },
    {
      "name": "state broadcaster CCTV",
      "weight": 0.06326789
    },
    {
      "name": "Trump",
      "weight": 0.06154238
    },
    {
      "name": "global digital infrastructure",
      "weight": 0.060461316
    },
    {
      "name": "kill switches",
      "weight": 0.060184207
    }
  ],
  "topics": [
    {
      "name": "AI"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Technology News",
      "score": 0.9873046875
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.921875
    },
    {
      "name": "/Computers & Electronics/Computer Hardware/Computer Components",
      "score": 0.5732421875
    }
  ],
  "sentiment": {
    "positive": 0.05434434,
    "negative": 0.7483711,
    "neutral": 0.19728453
  },
  "summary": "Nigments from Chinese state media have accused the AI company, Nvidia, of posing a national security threat to its specialized chips for the Chinese market. The accusations were made shortly after Nvidia secured a deal to resume selling its H2O chips to China, following which the company agreed to pay the Trump administration 15% of the revenue generated by its sales there. The company responded by stating that its chips already play a vital role in trusted systems worldwide and that it does not have any \"backdoor access\" in them. The incident comes after President Donald Trump dismissed the H2Os as \"obsolete\" and \"an old chip that China already has\".",
  "shortSummary": "Nvidia faces criticism from Chinese state media for its H2O chips, despite a recent deal with the Trump administration to resume sales.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "1e08b1761b9a414f986e26ed31756bc5",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://blogs.nvidia.com/blog/no-backdoors-no-kill-switches-no-spyware/",
      "text": "NVIDIA GPUs are at the heart of modern computing. They’re used across industries — from healthcare and finance to scientific research, autonomous systems and AI infrastructure. NVIDIA GPUs are embedded into CT scanners and MRI machines, DNA sequencers, air-traffic radar tracking systems, city traffic-management systems, self-driving cars, supercomputers, TV broadcasting systems, casino machines and game consoles.\nTo mitigate the risk of misuse, some pundits and policymakers propose requiring hardware “kill switches” or built-in controls that can remotely disable GPUs without user knowledge and consent. Some suspect they might already exist.\nNVIDIA GPUs do not and should not have kill switches and backdoors.\nHard-Coded, Single-Point Controls Are Always a Bad Idea\nNVIDIA has been designing processors for over 30 years. Embedding backdoors and kill switches into chips would be a gift to hackers and hostile actors. It would undermine global digital infrastructure and fracture trust in U.S. technology. Established law wisely requires companies to fix vulnerabilities — not create them.\nUntil recently, that policy was universally held and beyond question. When security researchers discovered vulnerabilities such as “Spectre” and “Meltdown” for CPUs, governments and industry responded with speed and unity to eliminate the risk.\nThat principle still holds. There is no such thing as a “good” secret backdoor — only dangerous vulnerabilities that need to be eliminated. Product security must always be done the right way: through rigorous internal testing, independent validation and full compliance with global cybersecurity standards. Robust security is built on the principle of “defense in depth”: layering multiple safeguards so that no single-point vulnerability can compromise or shut down a system. For decades, that’s how NVIDIA and American industry have promoted innovation while protecting users and growing the economy. This is no time to depart from that winning formula.\nHistorical Lessons: The Clipper Chip Debacle — a Policy and Technical Failure\nThe cybersecurity community learned these lessons the hard way during the 1990s with the NSA’s Clipper Chip initiative. Introduced in 1993, the Clipper Chip was designed to provide strong encryption while maintaining government backdoor access through a key escrow system.\nThe Clipper Chip represented everything wrong with built-in backdoors. Security researchers discovered fundamental flaws in the system that could allow malicious parties to tamper with the software. It created centralized vulnerabilities that could be exploited by adversaries. The mere existence of government backdoors undermined user confidence in the security of systems.\nKill switches and built-in backdoors create single points of failure and violate the fundamental principles of cybersecurity.\nPromote Smart Software Tools, Not Dangerous Hardware Traps\nSome point to smartphone features like “find my phone” or “remote wipe” as models for a GPU kill switch. That comparison doesn’t hold water — optional software features, controlled by the user, are not hardware backdoors.\nNVIDIA has always supported open, transparent software that helps customers get the most from their GPU-powered systems — diagnostics, performance monitoring, bug reporting and timely patching — with the user’s knowledge and consent. That’s responsible, secure computing. It helps our customers excel, and industry stay ahead.\nHardwiring a kill switch into a chip is something entirely different: a permanent flaw beyond user control, and an open invitation for disaster. It’s like buying a car where the dealership keeps a remote control for the parking brake — just in case they decide you shouldn’t be driving. That’s not sound policy. It’s an overreaction that would irreparably harm America’s economic and national security interests.\nHardware Integrity Should Be Nonpartisan and Nonnegotiable\nFor decades, policymakers have championed industry’s efforts to create secure, trustworthy hardware. Governments have many tools to protect nations, consumers and the economy. Deliberately weakening critical infrastructure should never be one of them.\nThere are no back doors in NVIDIA chips. No kill switches. No spyware. That’s not how trustworthy systems are built — and never will be."
    }
  ],
  "argos_summary": "Nvidia is facing backlash from Chinese state media, which has accused its H2O chips of being a national security threat due to alleged backdoor access. This controversy arises shortly after Nvidia negotiated a deal with the Trump administration to resume chip sales to China, agreeing to pay a 15% revenue cut. The company firmly denies the existence of backdoors or kill switches in its products, arguing that such features would compromise security and trust in technology.",
  "argos_id": "KN641QR6B"
}