{
  "url": "https://nypost.com/2025/08/11/sports/cam-heyward-hints-at-potential-holdout-in-rising-steelers-contract-drama/",
  "authorsByline": "Christian Arnold",
  "articleId": "0f8527059cbd441196fcc131ce619f1b",
  "source": {
    "domain": "nypost.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://nypost.com/wp-content/uploads/sites/2/2025/08/newspress-collage-u3gnw8zcy-1754962171825.jpg?quality=75&strip=all&1754947805&w=1024",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T01:30:20+00:00",
  "addDate": "2025-08-12T01:32:38.674365+00:00",
  "refreshDate": "2025-08-12T01:32:38.674366+00:00",
  "score": 1.0,
  "title": "Cam Heyward hints at potential holdout in rising Steelers contract drama",
  "description": "Cam Heyward is currently at Steelers training camp, but the defensive lineman isn’t ruling out the idea regular season missing games.",
  "content": "Cam Heyward is currently at Steelers training camp, but the defensive lineman isn’t ruling out a holdout if he and the team can’t renegotiate a contract extension he signed last year.\n\nThe Steelers defender told reporters on Monday that his camp approached the Steelers about his contract during the scouting combine in February and indicated that the organization asked him to take a pay cut in 2023 after he had a season riddled with injuries.\n\nNews of Heyward’s contract request and hold-in first came to light last week.\n\n“There are definitely options out there that could reflect that,” he said, according to the Pittsburgh Post-Gazette.\n\nHeyward signed a three-year, $45 million extension last year, but had told the front office to be ready to return to the bargaining table if he had a strong 2024.\n\n“I understand I signed a contract last year, but to be completely honest with you, when I signed that, I told them, ‘When I have an All-Pro year, expect me to come back [to the bargaining table],”‘ Heyward said. “I think everybody kind of giggled a little bit. I used it as motivation.”\n\nHeyward went on to record 71 tackles, 12 tackles for loss and earned All-Pro honors while also being named to the Pro Bowl.\n\n“Honestly, I’m looking to be valued,” Heyward said. “In my eyes, when I look around at my position, I think I’m 22nd [in compensation] as a defensive tackle, I’m 32nd as a defensive lineman. I know what I bring to this team and what I’m capable of on and off the field. It’s hard for me, after the year I had, to justify playing at the number I’m playing at.”\n\nHeyward has been at camp, attending meetings and practices and expressed that his goal was “to be out here” while adding that he didn’t “know what’s going to happen.”",
  "medium": "Article",
  "links": [
    "https://www.post-gazette.com/sports/steelers/2025/08/11/nfl-preseason-training-camp-steelers-cam-heyward/stories/202508050131",
    "https://nypost.com/2025/08/10/sports/michael-jordans-boat-wins-400k-prize-for-71-pound-fish-in-white-marlin-open/",
    "https://nypost.com/2025/08/07/sports/steelers-in-contract-drama-with-cameron-heyward/",
    "https://nypost.com/2025/08/11/sports/jen-pawols-ump-scorecard-for-mlb-home-plate-debut-revealed/",
    "https://nypost.com/2025/08/11/sports/cristiano-ronaldo-engaged-to-georgina-rodriguez-after-8-years-of-dating/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "rising Steelers contract drama",
      "weight": 0.099851176
    },
    {
      "name": "Cam Heyward",
      "weight": 0.09588079
    },
    {
      "name": "last year",
      "weight": 0.09281448
    },
    {
      "name": "Steelers training camp",
      "weight": 0.09198433
    },
    {
      "name": "Heyward",
      "weight": 0.09186269
    },
    {
      "name": "Steelers",
      "weight": 0.071535654
    },
    {
      "name": "potential holdout",
      "weight": 0.0690815
    },
    {
      "name": "Heyward’s contract request",
      "weight": 0.06806472
    },
    {
      "name": "last week",
      "weight": 0.06711313
    },
    {
      "name": "camp",
      "weight": 0.0655442
    }
  ],
  "topics": [
    {
      "name": "Football"
    },
    {
      "name": "NFL"
    },
    {
      "name": "Pittsburgh Steelers"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.97314453125
    },
    {
      "name": "/Sports/Team Sports/American Football",
      "score": 0.95703125
    }
  ],
  "sentiment": {
    "positive": 0.10998647,
    "negative": 0.5873673,
    "neutral": 0.3026462
  },
  "summary": "Pittsburgh Steelers defensive lineman Cam Heyward is currently at training camp but may not rule out a holdout if he and the team cannot renegotiate a contract extension he signed last year. Heyward's camp informed the team about his contract extension during the scouting combine and indicated that the team had asked him to take a pay cut in 2023 after a season plagued with injuries. He signed a three-year, $45 million extension last year, but had previously told the front office he would return to the bargaining table if he had a strong 2024.",
  "shortSummary": "Cam Heyward hints at a potential holdout from the Steelers over a contract extension he signed last year, citing injuries and a desire to increase his value.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "15aa784d6a6d433dbcdc8557082ae90b",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://nypost.com/2025/08/07/sports/steelers-in-contract-drama-with-cameron-heyward/",
      "text": "The Steelers have some more demands to handle.\nAfter reaching a record-breaking agreement with T.J. Watt, Pittsburgh has another All-Pro defensive lineman to try and keep happy with Cameron Heyward seeking a restructured deal.\nIn a defensive market that has skyrocketed, with Watt being a $123 million piece of that boom, Heyward is reportedly seeking a raise to fit the market reset, but he has not been fully participating in training camp while he negotiates, according to ESPN.\nThe 36-year-old has two years left on his current deal, a three-year extension he signed just last September that will pay him $14.75 million this season and $14.5 million the next.\nUnder his current contract, he enters the season as the 36th-highest-paid defensive lineman and the 18th-highest-paid defensive tackle.\nWhile he’s nearing 40 years old, Heyward has still been one of the NFL’s top interior defensive linemen, and he nabbed a First Team All-Pro selection this past season to show for it.\nHeyward racked up 71 total tackles and eight sacks in the 2024-25 season, and his All-Pro nod made him the first defensive lineman older than 35 to be voted for the honor since Bruce Smith in 1998.\nEntering his 15th season with Pittsburgh, Heyward and the team have reportedly discussed his wishes privately, but have not made any progress on a restructured deal as he continues to not be a full participant at camp.\nPittsburgh has been a big spender this offseason, as Watt’s three-year, $123 million contract has him as the highest-paid non-quarterback in NFL history.\nThe Steelers also gave newly acquired wide receiver DK Metcalf four years, $132 million.\nThey will also pay newcomers Aaron Rodgers ($13 million), Jalen Ramsey ($26.6 million) and Jonnu Smith ($12 million).\nHeyward isn’t the only All-Pro Steeler looking for a raise either, as kicker Chris Boswell has also been privately seeking a new contract.\nBoswell was First Team All-Pro last season but was the lowest-paid kicker in the AFC North."
    },
    {
      "url": "https://nypost.com/2025/08/11/sports/jen-pawols-ump-scorecard-for-mlb-home-plate-debut-revealed/",
      "text": "Umpire Jen Pawol’s first MLB game behind the plate went about as expected for a rookie.\nThe major leagues’ first female umpire, who made her debut on the bases during Saturday’s Braves-Marlins doubleheader, called 92.72 percent of balls and strikes accurately during Sunday’s series finale, getting 140 of the 151 taken pitches accurate, according to UmpScorecards.\nThe umpire average for the 2025 season is 94.23 percent, per UmpScorecard data.\nPawol’s called ball accuracy was 95 percent, with five of 104 balls called inaccurately; the average is 97 percent, per UmpScorecards.\nHer called strike accuracy was 88 percent, with six of 47 strikes called inaccurately; the average is 88 percent.\n“I think Jen did a really nice job,” Marlins manager Clayton McCullough said after his team’s 7-1 loss on Sunday.\n“I think she’s very composed back there. She handled and managed the game very well. And big day for her. Big day for Major League Baseball. I congratulated her again on that because it’s quite the accomplishment.”\nPawol, 48, is a West Milford, N.J., native who played softball at Hofstra. She has more than 1,200 minor league games on her résumé across the last 10 seasons.\nShe received support from Braves fans in Atlanta when she made history on Saturday.\n“It was amazing when we took the field,” Pawol said. “It seemed like quite a few people were clapping and calling my name. That was pretty intense and emotional.”\nPawol worked first base during the first game of Saturday’s doubleheader and third base for the second game.\n“She did a good job,” Braves manager Brian Snitker said Saturday. “You can tell she knows what she does.”\nPawol is a rover called up from the minors, so her next MLB assignment is unclear."
    },
    {
      "url": "https://nypost.com/2025/08/10/sports/michael-jordans-boat-wins-400k-prize-for-71-pound-fish-in-white-marlin-open/",
      "text": "A boat, whose crew included one of the greatest basketball players of all time, finished in second place in the prestigious White Marlin Open held in Ocean City, Maryland.\nMichael Jordan was aboard the “Catch 23” when angler Trey “Cricket” McMillan reeled in a 71-pound white Marlin on the sixth day of the 52-year-old deep-sea fishing tournament that is dubbed as one of the world’s largest and richest of its kind.\nThe boat pulled back into the harbor in Ocean City with the song “Sirus” – synonymous with Jordan as the team’s entrance music when he played for the Bulls – playing over the event sound system as the six-time NBA champion could be seen standing alongside other crew members.\nThe boat erupted in celebration when the weigh-in revealed they had moved into second place in the tournament.\nSecond place takes home a prize of $400,000. Angler Dan Gough of the Billfisher won the estimated $4.27 million first prize with a 72-pound Marlin.\nSocial media showed other images of Jordan from the tournament.\nOne image shared showed him posing alongside the rest of the crew with the fish after they returned to shore.\nAnother showed him sitting on the boat and the reflection in the window behind Jordan showed the large group of people who gathered to try and get a glimpse of the NBA legend.\nThe weather had forced tournament organizers to open up Saturday and Sunday to fishing and 211 of the 282 boats entered took advantage of the chance on Sunday, according to COAST TV.\nCompetitor Jimmy David equated the tournament to the likes of the Super Bowl, for fishing, especially with a star like Jordan there.\n“The biggest tournament, people come from all over,” David said to COAST TV. “Michael Jordan, all kinds of people. I heard they have the Secretary of the Navy over there and all kinds of celebrities. And the best of the best fishing. That’s for sure — the Super Bowl.”"
    },
    {
      "url": "https://nypost.com/2025/08/11/sports/cristiano-ronaldo-engaged-to-georgina-rodriguez-after-8-years-of-dating/",
      "text": "Cristiano Ronaldo put a ring on it.\nThe Portuguese soccer star, 40, and his girlfriend, Georgina Rodriguez, are engaged after eight years of together, the model shared on Instagram Monday.\n“Yes I do. In this and in all my lives,” Rodriguez, 31, wrote in Spanish, including a snapshot of her oval-shaped diamond engagement ring.\nThe couple first stepped out together at Best FIFA Football Awards in Zurich in January 2017, and later made things Instagram official in May of that year.\nRonaldo and Rodriguez share five children: 8-year-old twins Eva Maria and Mateo, daughters Alana, 7, and Bella, 3, and his 15-year-old son Cristiano Jr., from a previous relationship.\nThey announced the death of Bella’s newborn twin brother, Ángel, in April 2022.\nAlthough Rodriguez has been spotted with a ring on her ring finger, this is the first time she shared engagement news.\nThe couple discussed taking the next step in their relationship in the Netflix docuseries, “I Am Georgina” — an emotional in-depth portrait of the influencer’s daily life.\n“They’re always joking about the wedding, ‘When is the wedding?'” Rodriguez said of her friends in the March 2025 episode. “Since Jennifer Lopez’s song “The Ring Or When” came out, they started singing it to me. And well, this is not up to me.'”\n“I always tell her, when we get that click,” Ronaldo said, snapping his fingers. “Like everything with our life, and I know she knows what I’m talking about. It could be in a year, or it could be in six months or it could be in a month. I’m 1,000 percent sure that it’ll happen.”\nThe couple’s engagement comes more than three years after a federal civil case accusing Ronaldo of raping a 25-year-old woman in a Las Vegas hotel in 2009 was dismissed.\nKathryn Mayorga, a former school teacher, claimed Ronaldo, who was 24 at the time, raped her at the Palms Place in 2009. The allegations were first reported in 2017 by German magazine Der Spiegel.\nUS District Judge Jennifer Dorsey dismissed the case with prejudice, due to misconduct by Mayorga’s attorney, Leslie Mark Stovall, who used “purloined” confidential documents.\nStovall was ordered to pay a proportion of Ronaldo’s legal costs."
    }
  ],
  "argos_summary": "Cam Heyward, a defensive lineman for the Steelers, is considering a holdout if his contract is not renegotiated after a strong performance last season. Despite signing a three-year, $45 million extension last year, Heyward feels undervalued as he ranks low in compensation among defensive tackles. Meanwhile, in other sports news, Michael Jordan's fishing team finished second in the White Marlin Open, and Cristiano Ronaldo and Georgina Rodriguez announced their engagement after eight years together.",
  "argos_id": "KQP26X1KQ"
}