{
  "url": "https://www.businessinsider.com/gen-z-friends-co-buying-to-afford-homeownership-2025-8",
  "authorsByline": "Alcynna Lloyd",
  "articleId": "2399fe8696cd414aaaa9b1d754f11e91",
  "source": {
    "domain": "businessinsider.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://i.insider.com/6894c917f748d8c055f710ad?width=1200&format=jpeg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T21:42:30+00:00",
  "addDate": "2025-08-11T22:22:02.111077+00:00",
  "refreshDate": "2025-08-11T22:22:02.111078+00:00",
  "score": 1.0,
  "title": "Three friends, one mortgage: How a group of Gen Zers bought a home together before turning 25",
  "description": "Three Gen Z friends who work in finance said buying with friends makes homeownership attainable for young people. They bought a condo in Tampa, Florida.",
  "content": "This as-told-to essay is based on a conversation with Cole Flynn, 26, and Stefan Gollisz, 25, who co-bought a home in Tampa, Florida, with their friend Scott McKinnon, 25, in 2023. The conversations have been edited for length and clarity.Cole Flynn: Stefan, Scott, and I went to the same high school. Scott was a year younger, but we played sports with him, and after graduating, we stayed close throughout college.Stefan Gollisz: We all studied economics and finance in college and have a pretty good understanding of the stock market.Flynn: Scott is a consultant at Deloitte. Stefan and I work at a wealth management firm in Long Island, New York. We mainly advise clients on asset allocation, portfolio management, and financial planning. Sometimes I work with clients who are too heavily concentrated in certain assets, which isn't ideal from a risk management perspective. Many of them will end up diversifying their assets by investing in various types of real estate.Gollisz: We each had some money in the stock market, but also decided we wanted to get into real estate. However, individually, none of us had the money to purchase a property on our own. That's why the idea of co-purchasing a home looked appealing to us.Flynn: We knew we were a strong group of friends and worked well as a team. So we figured that if we bought a property and committed to doing what was needed, over the next 15 to 30 years, we could eventually walk away with a highly appreciated asset.Flynn: We closed on a home in Tampa for $357,500 in August 2023, with a mortgage rate of 7.625% and a monthly payment — including principal and interest — of $1,898.We formed an LLC to make the purchase since securing a traditional loan as co-buyers is more difficult. During the process, a lender advised us to make a 25% down payment. We split it three ways, which came out to about $30,000 each.At the time of purchase, I was 24 and Stefan and Scott were 23.Gollisz: After college, we worked for about two years and lived at home, which helped us afford the down payment. We also had investments in the stock market.Flynn: Still, we each didn't have $90,000 lying around, so splitting the down payment made it possible. It's the kind of thing you can really only do when co-buying.Going into this, we didn't understand the homebuying process. I didn't know how to find a lender, form an LLC, or find an agent in an area so far away, like Tampa.We ended up working with Nestment. We used their software to research up-and-coming real estate markets throughout the country. Once we zoned in on Tampa, they introduced us to the agent who showed us properties over FaceTime. They also helped us form an LLC and connected us with lenders.Flynn: The home is a three-bedroom, three-bathroom condominium located in a private gated community with shared amenities like a gym and pool, near the University of South Florida campus.The location gives us dual exposure; it's close to the city and near a college campus. If the real estate market in Tampa tightens, renting to college students could be a reliable fallback.Gollisz: We all have full-time jobs and don't want the hassle of managing an Airbnb every weekend or hiring a property manager. So, we decided that long-term rentals were better suited for the home.Flynn: While Stefan and I still live in an apartment in Long Island, Scott is temporarily living in the house. He got married in 2024, and he and his wife are paying rent as they wait to buy their own home. After they move out, we will continue to manage and rent out to tenants.Gollisz: Between November 2023 and November 2024, a group of military-affiliated students rented the entire home, paying $2,100 a month.Flynn: Some months, rent was about $200 short, so the three of us had to chip in a few hundred dollars over the year. Operating at a slight loss has had its tax benefits, so it hasn't been a complete setback. Plus, we expect to see appreciation in the Tampa market.Once interest rates come down, the plan is to refinance. That should help us have a positive monthly cash flow.Overall, we're optimistic and confident. Real estate is a long-term commitment — we have a 30-year mortgage, so we're staying focused on the big picture.Flynn: We have a separate bank account under the LLC, which is linked in our apps. This keeps things organized and allows us to monitor the business whenever we need to.We've also divided up all the responsibilities for the property. Scott handles the tenant relationships, which include dealing with complaints and rental payments. Stefan is in charge of paying the mortgage to the lender. My job is managing maintenance.We track all home-related expenses in a spreadsheet and settle payments every few months.For example, if I put down a couple of hundred bucks for fixing the faucet, or Scott — especially since he's living there — does a home project, or Stefan pays for the internet for the quarter, we'll say, \"Hey, I paid or am owed a couple of hundred dollars\" and we'll make ends meet with everybody.Gollisz: So far, our biggest expense for the home has been installing an entirely new air conditioning system, which cost about $7,000. We split the cost evenly.Flynn: I think the goal for all of us going in, and it still remains, is for this to be a side business that can help supplement our income and build up our net worth outside our 9-to-5 jobs.We all understood that this is going to be a long-term relationship, and there has to be constant communication. We all trust each other to put our heads down and do the work when needed.Gollisz: I do recommend co-buying with friends. Buying alone can be very daunting, especially when you're young, but it definitely feels less scary and more achievable with friends.I think our friendship actually grew more by being business partners. Even though Scott moved down South and we don't see him as much, we keep in touch by talking about the property. And when he comes back to New York every couple of months, we get together and rehash.We're very excited about the property's future. We're continuing to build equity in it each month. The idea is to roll over equity from the home into another investment property — hopefully, we can do this together.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "home",
      "weight": 0.07363189
    },
    {
      "name": "Scott",
      "weight": 0.05790691
    },
    {
      "name": "Scott McKinnon",
      "weight": 0.057641078
    },
    {
      "name": "Real estate",
      "weight": 0.056421705
    },
    {
      "name": "real estate",
      "weight": 0.056421705
    },
    {
      "name": "Stefan Gollisz",
      "weight": 0.05584712
    },
    {
      "name": "properties",
      "weight": 0.055434898
    },
    {
      "name": "college students",
      "weight": 0.054042913
    },
    {
      "name": "Stefan",
      "weight": 0.052564047
    },
    {
      "name": "asset allocation",
      "weight": 0.050238114
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/Finance/Credit & Lending/Loans",
      "score": 0.77099609375
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.7158203125
    },
    {
      "name": "/Real Estate/Other",
      "score": 0.5927734375
    },
    {
      "name": "/Finance/Financial Planning & Management/Other",
      "score": 0.44140625
    }
  ],
  "sentiment": {
    "positive": 0.22022516,
    "negative": 0.21816485,
    "neutral": 0.56161
  },
  "summary": "Cole Flynn, Stefan Gollisz, and Scott McKinnon, two friends, who co-bought a home in Tampa, Florida with their friend in 2023, with a mortgage rate of 7.625% and a monthly payment of $1,898. They formed an LLC to make the purchase, since securing a traditional loan as co-buyers is more difficult. The home is a three-bedroom, three-bathroom condominium located in a private gated community near the University of South Florida campus. Despite the financial constraints, they plan to refinance the home once interest rates come down. They also plan to rent out the entire home between November 2023 and 2025.",
  "shortSummary": "A group of Gen Zers, including Cole Flynn and Stefan Gollisz, co-bought a home in Tampa, Florida, with a 25% down payment, emphasizing long-term real estate investments.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "990ac65320bf4ef79f471f362b7d471f",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Cole Flynn, Stefan Gollisz, and Scott McKinnon, friends from high school, co-purchased a home in Tampa, Florida, in 2023 for $357,500, using an LLC to facilitate the purchase and splitting the down payment. They plan to rent the property long-term, managing responsibilities among themselves while tracking expenses and maintaining communication. Despite some financial challenges, they remain optimistic about the property's appreciation and aim to use the equity for future investments.",
  "argos_id": "KZQ6DIC54"
}