{
  "url": "https://nypost.com/2025/08/11/entertainment/backstreet-boys-behind-the-scenes-sphere-vegas-residency-rituals/",
  "authorsByline": "Whitney Vasquez",
  "articleId": "33976e92e16d4084969680a8c7ba727e",
  "source": {
    "domain": "nypost.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://nypost.com/wp-content/uploads/sites/2/2025/08/newspress-collage-m0j8afsqb-1754339602356.jpg?quality=75&strip=all&1754325255&w=1024",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T19:43:45+00:00",
  "addDate": "2025-08-11T21:06:12.424210+00:00",
  "refreshDate": "2025-08-11T21:06:12.424211+00:00",
  "score": 1.0,
  "title": "Backstreet Boys’ behind-the-scenes Vegas Sphere residency rituals revealed",
  "description": "Each member has their own unique traditions before hitting the stage.",
  "content": "Backstreet Boys may have been a band for over 30 years, but each member has their own unique routine before hitting the stage.\n\nNick Carter, Howie Dorough, AJ McLean, Brian Littrell and Kevin Richardson became what would later be known as the best-selling boy band of all time in 1993 but their debut single “We’ve Got It Goin’ On” and hit ballad “I’ll Never Break Your Heart” put them on the map in 1995 and 1996, respectively.\n\nThose two singles, along with several of their chart-topping smashes, are woven into the Backstreet Boys’ highly talked-about “Into The Millennium” residency at the Sphere in Las Vegas.\n\nWhile the boys are all older, ranging from 45 to 53, some of their backstage habits remain the same, according to their longtime choreographers and creative directors, Rich and Tone Talauega (better known simply as Rich + Tone), who spilled each member’s pre-show ritual in an exclusive interview with The Post.\n\nAdmitting that the vibe before the show is “very relaxed,” Rich broke down Nick, Howie, AJ, Brian and Kevin’s individual methods while also sharing the one thing the boys do together before performing to about 20,000 adoring fans at their cutting-edge summer residency.\n\nRich + Tone know best, considering the pair has worked with the Backstreet Boys since 1998, first as dancers before becoming the creative directors and choreographers for several of the group’s tours between 2008 and 2020, and now, the “Into The Millennium” Sin City residency.\n\nKeep scrolling to discover each Backstreet Boys’ unique backstage habits.\n\nNick, 45, “does this routine where he stretches, like every performer should. But he does a lot of sports stretches to get his body warmed up,” the renowned pair, who have worked with Madonna, Jennifer Lopez, Usher, Chris Brown, and more, told The Post.\n\n“He likes to sweat a little bit before he starts to get dressed,” Rich added.\n\nRich + Tone say that Kevin, 53, is “more relaxed” than the other guys backstage.\n\n“He tries not to do too, too much before the show,” Rich shared, emphasizing again that “Kevin is just more relaxed” when they come into his room to check in and give him “extra little pep talks,” as they do with his other bandmates, before their performance.\n\nWhen asked if AJ, 47, has any funny pre-show quirks, Rich laughed.\n\n“He likes to talk a lot,” he responded while noting that AJ “doesn’t like to think” about their performance before hitting the stage.\n\n“He likes to have conversations with people about everything else except the show,” the famed choreographer quipped.\n\nHowie, 51, is the most thorough, according to Rich.\n\n“He does his vocal warm-ups. He likes to warm up his vocals before he starts stretching a little bit,” he revealed about the singer.\n\nHe also enjoys going over notes to learn what he can do better.\n\n“We like to give him notes about his performance,” Rich said, sharing that the feedback could be about anything from staging to hitting his marks.\n\n“He says, it’s like his food. Cause it keeps his mind spinning. Because he likes to be sharp,” he explained.\n\n“And no other way to be sharp is to give him notes. And on the smallest things, too, as well, ‘Where should I look? Should I look onstage left or should I look straight to the right?'” Rich added, saying his biggest note for Howie is “‘just be you. Just be free.'”\n\nRich shared that Brian, 50, is like Nick.\n\n“He likes to warm up. He’s like an athlete. I like to say, I like to treat them all like athletes,” Rich noted.\n\nTo do that, Rich + Tone ensure that “they’re always doing stretching, whether it’s vocal warm-ups or going over notes.”\n\nWhen it comes to the five band members, Rich stated Brian is “more like Nick,” sharing that they warm up similarly before a show.\n\nWhile Nick, Kevin, AJ, Howie and Brian have individual routines, they also take a moment together backstage before kicking off each residency concert.\n\nRich said the “one thing that I love to see them do” is their prayer prior to coming out on the stage, revealing that all five of the boys take turns leading the message.\n\n“That’s great because it brings the morale together,” he stated.\n\nAccording to Rich, they all hug afterward, and both he and Tone remind them they aren’t just Backstreet Boys; they are “icon boys.”\n\nHow long will the Backstreet Boys’ residency run?\n\nThe Backstreet Boys’ summer residency in Sin City kicked off on July 11.\n\nWith larger-than-life visuals — like giant dancing robots projected on the 160,000-square-foot interior screen and a futuristic platform levitating each member of the group about 80 feet in the air — and a 1,600 speaker sound system, Rich confessed that the team faced some “challenges” to make the residency come to life.\n\nThe Backstreet Boys are the first pop group at the Sphere, which opened near the Vegas strip on September 29, 2023.\n\nDue to their overwhelming popularity, they added three additional shows to their lineup.\n\nThe residency is scheduled to end later this month, with the final show set for August 24.\n\nWhile many fans have hope that the Backstreet Boys will extend their residency dates, no official announcement has been made.",
  "medium": "Article",
  "links": [
    "https://www.sphereentertainmentco.com/the-backstreet-boys-add-final-three-shows-to-sphere-summer-2025-residency-into-the-millennium/",
    "https://nypost.com/2025/08/01/entertainment/backstreet-boys-vegas-sphere-residency-challenges-revealed/",
    "https://nypost.com/2025/08/11/entertainment/kelly-clarksons-ex-husband-brandon-blackstocks-cause-of-death-revealed/",
    "https://nypost.com/2025/08/05/entertainment/jamie-lee-curtis-reacts-to-pamela-anderson-liam-neeson-romance/",
    "https://nypost.com/2025/07/14/entertainment/backstreet-boys-kick-off-cutting-edge-las-vegas-sphere-summer-residency-photos/",
    "https://nypost.com/2025/08/11/entertainment/rapper-maluma-stops-concert-to-scold-mom-for-irresponsible-act-with-her-baby/",
    "https://www.richandtoneproductions.com/",
    "https://nypost.com/2025/08/01/entertainment/backstreet-boys-vegas-sphere-residency-challenges-revealed/#"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Backstreet Boys",
      "weight": 0.091276586
    },
    {
      "name": "Rich",
      "weight": 0.08581157
    },
    {
      "name": "AJ McLean",
      "weight": 0.053277776
    },
    {
      "name": "Kevin Richardson",
      "weight": 0.05301414
    },
    {
      "name": "Vegas Sphere",
      "weight": 0.052483816
    },
    {
      "name": "extra little pep talks",
      "weight": 0.052368015
    },
    {
      "name": "icon boys",
      "weight": 0.05217469
    },
    {
      "name": "Rich and Tone Talauega",
      "weight": 0.051575303
    },
    {
      "name": "Brian Littrell",
      "weight": 0.050746504
    },
    {
      "name": "Tone Talauega",
      "weight": 0.050059814
    }
  ],
  "topics": [
    {
      "name": "Music"
    }
  ],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.98193359375
    },
    {
      "name": "/Arts & Entertainment/Music & Audio/Pop Music",
      "score": 0.81201171875
    },
    {
      "name": "/Arts & Entertainment/Music & Audio/Urban & Hip-Hop",
      "score": 0.4609375
    },
    {
      "name": "/Arts & Entertainment/Events & Listings/Concerts & Music Festivals",
      "score": 0.413818359375
    }
  ],
  "sentiment": {
    "positive": 0.16588955,
    "negative": 0.39528552,
    "neutral": 0.43882492
  },
  "summary": "Backstreet Boys, known as the best-selling boy band of all time, have been together for over 30 years and each member has a unique routine before performing. The band, consisting of Nick Carter, Howie Dorough, AJ McLean, Brian Littrell and Kevin Richardson, are part of the \"Into The Millennium\" residency at the Sphere in Las Vegas. Longtime choreographers and creative directors Rich and Tone Talauega revealed their backstage habits in an exclusive interview with The Post. They highlighted Nick's routine, which includes stretching, and a few sports stretches to get his body warmed up, and noted that Kevin is more relaxed backstage. They also shared their one thing the boys do together before performing at their summer residency.",
  "shortSummary": "The Backstreet Boys have a unique pre-show routine, led by Nick Carter, Howie Dorough, and Kevin Richardson, and feature prominently in their new Las Vegas residency.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "1f67472b19514c13b1cb354489e08192",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://nypost.com/2025/08/01/entertainment/backstreet-boys-vegas-sphere-residency-challenges-revealed/#",
      "text": "Backstreet Boys’ Vegas Sphere residency ‘challenges’ revealed — and what left them ‘in a mad dash’ on opening night\nBackstreet’s Back alright!\nBackstreet Boys Nick Carter, Howie Dorough, AJ McLean, Brian Littrell and Kevin Richardson delighted fans when they announced “Into the Millennium,” their summer residency at the Sphere in Las Vegas, which started on July 11.\nNow, their longtime choreographers and creative directors, Rich and Tone Talauega (better known simply as Rich + Tone), are spilling all about the ups and downs of putting on the spectacular one-of-a-kind show — and what left the team “in a mad dash” up until the debut.\n“I mean, it was a long road to get there,” Rich exclusively confessed to The Post following the group’s opening weekend in Sin City. “We started developing this at the end of last year, going into the new year.”\nThe renowned choreography duo has worked with every major artist from Michael Jackson and Jennifer Lopez to Madonna and Usher.\nRich + Tone have collaborated with the Backstreet Boys for decades, first as dancers for the group at the 1998 Billboard Music Awards before becoming creative directors and choreographers for several of their tours between 2008 and 2020, and finally, their Sphere residency.\nThey explained that this “amazing” experience was unlike any other.\n“Just the venue itself was exciting. To know that we were gonna work with the Boys and actually put the first pop boy band in the Sphere for the very first time. So from so many different perspectives and angles, man, it was really, really exciting to see it open,” Rich reflected.\nThe Sphere, which opened near the Vegas strip on Sept. 29, 2023, has held several bands — but the Backstreet Boys are the first pop group, as noted above, and have quickly sold out the majority of their shows despite the dome-like theater holding up to 20,000 people. Due to the high demand, they even added three additional shows to their August lineup.\n“And obviously, us being perfectionists, there were a couple of things, challenges, that were in our way,” Rich shared.\nNoting their residency team, which includes global phenomenon Baz Halpin, whose production company, Silent House, is the show’s design studio, Rich continued, “[We just felt] we had to put everything from experience from 30 years of working in the industry” into the residency.\n“We had to make sure that we’d come off on top in terms of this incredible venue, but opportunity, too,” he explained. “And the boys were excited.”\nAll their hard work paid off, especially when Nick, 45, Howie, 51, AJ, 47, Brian, 50, and Kevin, 53, were finally able to perform in front of fans at their sold-out opening weekend concerts.\n“The energy from the fans was the last missing piece for us,” Rich told The Post. “Everybody was just excited and thrilled to finally break that venue wide open.”\nHe also revealed that the show didn’t fully come together until opening night of the residency “cause the last piece of the puzzle was seeing the actual content in 16K high res, [the] highest resolution.”\n“Obviously, the content took the longest to develop and tweak to get it just right for the actual opening. And I can tell you right now, probably, it was 90% done when we were on our first day in the Sphere, and it wasn’t until 100% done until July 11,” Rich admitted.\n“No one got to see 100% what the visual content was going to look like until the day of the show,” he went on, noting how “anxious” they were to see the different aspects of the 90-minute performance “mesh as one for the very first time.”\nThe choreographer said it was his first time working on a project of this magnitude in which everything was still coming together at the eleventh hour.\nBesides the iconic vocals of the best-selling boy band of all time (a record they still hold, per Billboard), there are incredible visuals in the show, including life-size dancing robots projected on the 160,000-square-foot interior screen and a gigantic futuristic platform that levitates each member of the group about 80 feet in the air.\nWhile he noted that the untrained eye might not have noticed, Rich stated there were “a couple of hiccups here and there” during opening weekend with the vocals.\n“I want to say the venue holds 140,000-plus speakers. So that was the first time ever we dealt with that many speakers. We were in a mad dash to get it all mixed, ready and balanced and leveled for the actual show,” he said. “But on the day of the show, there was a couple accents missing.\nRich shared that at times, the bass was “a little too low” and the vocals were “very high” in terms of music. “And so it wasn’t really balanced per se for the venue. So, we almost needed a couple more days,” Rich explained before giving kudos to the music team.\n“They were working around the clock,” he shared while revealing the team didn’t sleep for the last couple of days leading up to the residency, “because there were so many notes coming in from us, from the boys in terms of how it should sound and how the levels were, like, kind of uneven.”\n“That was probably the most hiccups that we had in any department. But nonetheless, they made it work,” he added, admitting the difference between Show 1 and 2 was “night and day.”\nWhen asked if anything was scrapped from the Backstreet Boys’ “Into the Millennium” residency, Rich + Tone told The Post the one thing that didn’t make the final cut.\n“I wanted to see the boys do a song that was a cappella from beginning to end in that particular venue,” Rich said while sharing that they’re “very happy” with the flow of the show.\n“I just feel like there was one song that could have been on there. The whole entire show in a whole ‘nother stratosphere, but we didn’t end up doing it. It got voted off the list,” he added.\nRich + Tone previously told Billboard that this is “probably the most ambitious” show that’s been done at Sphere yet, alluding to the pre-shot visuals that are woven into the Backstreet Boys’ live action performance.\n“If I was a ticket-buying fan, I would want to buy three tickets to see it from three different places,” Rich said, describing the show as “50% a movie experience, 50% a concert experience, and the blend of those two elements is key.”\nThe theme of the concert pays homage to the band’s Millennium era, which was the name of their third studio album released in 1999.\nTone told the outlet that the show’s visuals offer “a historical sort of layout of the Boys’ entire career,” blending “something new” with “something nostalgic and familiar.”\nCalling it “very, very fresh, very modern,” Rich added, “Working with these guys, we’re reminded they’re icons. Tone and I always love to bring that iconic energy to them and remind them that they are who they are.”\nThe Backstreet Boys broke records with their Grammy-nominated “Millennium” album, landing at No. 1 on the Billboard 200 albums chart just over one month after its release and selling 1,134,000 copies in the first week, according to Guinness World Records.\nAt the time, their accomplishment shattered Nielsen’s SoundScan record for first-week sales, which was previously held by country superstar Garth Brooks.\nThe album has reportedly sold 40 million copies worldwide, making “Millennium” one of the best-selling records of all time, and with their summer residency, its sales have soared to nearly 12,000%, Forbes reported on July 26.\n“Millennium” also earned the boys five Grammy nominations, including Album of the Year.\nFor those who haven’t gotten their tickets to the Backstreet Boys’ Vegas residency, there’s still time, but dates are limited.\nThe last show is slated for August 24, marking a total of 21 performances over seven weeks."
    },
    {
      "url": "https://nypost.com/2025/08/01/entertainment/backstreet-boys-vegas-sphere-residency-challenges-revealed/",
      "text": "Backstreet Boys’ Vegas Sphere residency ‘challenges’ revealed — and what left them ‘in a mad dash’ on opening night\nBackstreet’s Back alright!\nBackstreet Boys Nick Carter, Howie Dorough, AJ McLean, Brian Littrell and Kevin Richardson delighted fans when they announced “Into the Millennium,” their summer residency at the Sphere in Las Vegas, which started on July 11.\nNow, their longtime choreographers and creative directors, Rich and Tone Talauega (better known simply as Rich + Tone), are spilling all about the ups and downs of putting on the spectacular one-of-a-kind show — and what left the team “in a mad dash” up until the debut.\n“I mean, it was a long road to get there,” Rich exclusively confessed to The Post following the group’s opening weekend in Sin City. “We started developing this at the end of last year, going into the new year.”\nThe renowned choreography duo has worked with every major artist from Michael Jackson and Jennifer Lopez to Madonna and Usher.\nRich + Tone have collaborated with the Backstreet Boys for decades, first as dancers for the group at the 1998 Billboard Music Awards before becoming creative directors and choreographers for several of their tours between 2008 and 2020, and finally, their Sphere residency.\nThey explained that this “amazing” experience was unlike any other.\n“Just the venue itself was exciting. To know that we were gonna work with the Boys and actually put the first pop boy band in the Sphere for the very first time. So from so many different perspectives and angles, man, it was really, really exciting to see it open,” Rich reflected.\nThe Sphere, which opened near the Vegas strip on Sept. 29, 2023, has held several bands — but the Backstreet Boys are the first pop group, as noted above, and have quickly sold out the majority of their shows despite the dome-like theater holding up to 20,000 people. Due to the high demand, they even added three additional shows to their August lineup.\n“And obviously, us being perfectionists, there were a couple of things, challenges, that were in our way,” Rich shared.\nNoting their residency team, which includes global phenomenon Baz Halpin, whose production company, Silent House, is the show’s design studio, Rich continued, “[We just felt] we had to put everything from experience from 30 years of working in the industry” into the residency.\n“We had to make sure that we’d come off on top in terms of this incredible venue, but opportunity, too,” he explained. “And the boys were excited.”\nAll their hard work paid off, especially when Nick, 45, Howie, 51, AJ, 47, Brian, 50, and Kevin, 53, were finally able to perform in front of fans at their sold-out opening weekend concerts.\n“The energy from the fans was the last missing piece for us,” Rich told The Post. “Everybody was just excited and thrilled to finally break that venue wide open.”\nHe also revealed that the show didn’t fully come together until opening night of the residency “cause the last piece of the puzzle was seeing the actual content in 16K high res, [the] highest resolution.”\n“Obviously, the content took the longest to develop and tweak to get it just right for the actual opening. And I can tell you right now, probably, it was 90% done when we were on our first day in the Sphere, and it wasn’t until 100% done until July 11,” Rich admitted.\n“No one got to see 100% what the visual content was going to look like until the day of the show,” he went on, noting how “anxious” they were to see the different aspects of the 90-minute performance “mesh as one for the very first time.”\nThe choreographer said it was his first time working on a project of this magnitude in which everything was still coming together at the eleventh hour.\nBesides the iconic vocals of the best-selling boy band of all time (a record they still hold, per Billboard), there are incredible visuals in the show, including life-size dancing robots projected on the 160,000-square-foot interior screen and a gigantic futuristic platform that levitates each member of the group about 80 feet in the air.\nWhile he noted that the untrained eye might not have noticed, Rich stated there were “a couple of hiccups here and there” during opening weekend with the vocals.\n“I want to say the venue holds 140,000-plus speakers. So that was the first time ever we dealt with that many speakers. We were in a mad dash to get it all mixed, ready and balanced and leveled for the actual show,” he said. “But on the day of the show, there was a couple accents missing.\nRich shared that at times, the bass was “a little too low” and the vocals were “very high” in terms of music. “And so it wasn’t really balanced per se for the venue. So, we almost needed a couple more days,” Rich explained before giving kudos to the music team.\n“They were working around the clock,” he shared while revealing the team didn’t sleep for the last couple of days leading up to the residency, “because there were so many notes coming in from us, from the boys in terms of how it should sound and how the levels were, like, kind of uneven.”\n“That was probably the most hiccups that we had in any department. But nonetheless, they made it work,” he added, admitting the difference between Show 1 and 2 was “night and day.”\nWhen asked if anything was scrapped from the Backstreet Boys’ “Into the Millennium” residency, Rich + Tone told The Post the one thing that didn’t make the final cut.\n“I wanted to see the boys do a song that was a cappella from beginning to end in that particular venue,” Rich said while sharing that they’re “very happy” with the flow of the show.\n“I just feel like there was one song that could have been on there. The whole entire show in a whole ‘nother stratosphere, but we didn’t end up doing it. It got voted off the list,” he added.\nRich + Tone previously told Billboard that this is “probably the most ambitious” show that’s been done at Sphere yet, alluding to the pre-shot visuals that are woven into the Backstreet Boys’ live action performance.\n“If I was a ticket-buying fan, I would want to buy three tickets to see it from three different places,” Rich said, describing the show as “50% a movie experience, 50% a concert experience, and the blend of those two elements is key.”\nThe theme of the concert pays homage to the band’s Millennium era, which was the name of their third studio album released in 1999.\nTone told the outlet that the show’s visuals offer “a historical sort of layout of the Boys’ entire career,” blending “something new” with “something nostalgic and familiar.”\nCalling it “very, very fresh, very modern,” Rich added, “Working with these guys, we’re reminded they’re icons. Tone and I always love to bring that iconic energy to them and remind them that they are who they are.”\nThe Backstreet Boys broke records with their Grammy-nominated “Millennium” album, landing at No. 1 on the Billboard 200 albums chart just over one month after its release and selling 1,134,000 copies in the first week, according to Guinness World Records.\nAt the time, their accomplishment shattered Nielsen’s SoundScan record for first-week sales, which was previously held by country superstar Garth Brooks.\nThe album has reportedly sold 40 million copies worldwide, making “Millennium” one of the best-selling records of all time, and with their summer residency, its sales have soared to nearly 12,000%, Forbes reported on July 26.\n“Millennium” also earned the boys five Grammy nominations, including Album of the Year.\nFor those who haven’t gotten their tickets to the Backstreet Boys’ Vegas residency, there’s still time, but dates are limited.\nThe last show is slated for August 24, marking a total of 21 performances over seven weeks."
    },
    {
      "url": "https://nypost.com/2025/07/14/entertainment/backstreet-boys-kick-off-cutting-edge-las-vegas-sphere-summer-residency-photos/",
      "text": "The Backstreet Boys kicked off their “Into The Millennium” summer residency at Las Vegas’ Sphere this weekend, becoming the first pop act to play the cutting-edge venue.\nProduced by Live Nation, the sold-out shows featured hits like “I Want It That Way” and “Larger Than Life,” amplified by the Sphere’s 160,000-square-foot LED dome, the world’s highest-resolution screen.\nThe Backstreet Boys, AJ McLean, Howie Dorough, Nick Carter, Kevin Richardson and Brian Littrell, have been performing together for over 30 years. Rich Fury/Sphere Entertainment\nBrian Littrell and The Backstreet Boys perform at the Las Vegas Sphere. @flybychicago & @jaybyrdfilms\nThe Backstreet Boys perform at the Las Vegas Sphere. Justin Segura/Sphere Entertainment\nThe Backstreet Boys perform at the Las Vegas Sphere. Rich Fury/Sphere Entertainment\nThe Backstreet Boys perform at the Las Vegas Sphere. Rich Fury/Sphere Entertainment\nThe Backstreet Boys perform at the Las Vegas Sphere. Rich Fury/Sphere Entertainment\nThe Backstreet Boys perform at the Las Vegas Sphere. Justin Segura/Sphere Entertainment\nNick Carter and The Backstreet Boys perform at the Las Vegas Sphere. @flybychicago & @jaybyrdfilms\nThe Backstreet Boys perform at the Las Vegas Sphere. Justin Segura/Sphere Entertainment\nThe Backstreet Boys perform at the Las Vegas Sphere. Justin Segura/Sphere Entertainment\nThe Backstreet Boys perform at the Las Vegas Sphere. Justin Segura/Sphere Entertainment\nThe Backstreet Boys perform at the Las Vegas Sphere. Justin Segura/Sphere Entertainment\nThe Backstreet Boys perform at the Las Vegas Sphere. Justin Segura/Sphere Entertainment\nThe Backstreet Boys perform at the Las Vegas Sphere. Justin Segura/Sphere Entertainment\nThe Backstreet Boys perform at the Las Vegas Sphere. @flybychicago & @jaybyrdfilms"
    },
    {
      "url": "https://nypost.com/2025/08/11/entertainment/rapper-maluma-stops-concert-to-scold-mom-for-irresponsible-act-with-her-baby/",
      "text": "Rapper Maluma stops concert to scold mom for ‘irresponsible’ act with her baby\nRapper Maluma abruptly stopped his Mexico City concert over the weekend to call out a mother who had brought her baby without any ear protection into the 26,000-strong crowd.\nThe Colombian musician, 31, was in the middle of a song when he noticed the tot in the audience — prompting him to scold the child’s mother over the “irresponsible” act.\nIn a now-viral video of the moment, the “Farandulera” singer asked for the baby’s age before putting the mom on the spot.\n“Do you think it’s a good idea to bring a 1-year-old baby to a concert where the decibels are this f–king high?” he asked. “That baby doesn’t even know what it’s doing here.”\n“Next time, protect their ears or something,” he continued. “For real. It’s heavy. It’s your responsibility.”\nMaluma, who has a 1-year-old daughter, Paris, doubled down by saying he would never do that as a father.\n“You’re waving them around like they’re a toy,” he continued. “That baby doesn’t want to be there, for real. I’m telling you with all love and respect, now that I’m a father… would never bring them to a concert. For the next time, be a bit more aware.”\nWhile the crowd cheered in support of Maluma’s remarks, some critics rushed to social media to slam the singer for making the ordeal a public spectacle.\n“Every mother knows what she has to do with her child. If not, they should limit the capacity to a certain age. What’s the point in putting her through that in front of so many people?” one person wrote on TikTok.\nAnother added, “Was it necessary to embarrass her while he was receiving applause?”\n“Even if you’re right about what you’re saying, I don’t think it’s right to shame a parent in front of thousands of people,” a third wrote.\nHowever, other fans applauded the singer, whose real name is Juan Luis Londoño Arias, for voicing his concerns mid-show.\n“Who would even think of taking a baby? If you have a baby and no one to leave it with, then you don’t go. I totally agree with him,” one fan wrote.\nAnother added, “Maluma is right, it’s not a place for a baby. The organizers and security are the ones really responsible. They shouldn’t have let a baby in.”\nThe singer is currently on his “+Pretty +Dirty World Tour,” which continues on across Latin America, the US and Europe.\nMaluma became a dad in March 2024 after welcoming a daughter with his girlfriend, Susana Gómez.\nSpeaking to Allure about fatherhood, the “Borró Cassette” hitmaker admitted that “everything changed” once he became a dad.\n“I love it. Now, I wake up every day with the desire to conquer the world. I know I have to f–king kill it,” he said.\n“For Paris, nothing is impossible. You have to lead by example. I go to bed every night that I can at 9 and wake up at 5:30 to hit the gym because I want to be healthy. You want to live forever for your kids. I want to make her proud.”"
    },
    {
      "url": "https://nypost.com/2025/08/11/entertainment/kelly-clarksons-ex-husband-brandon-blackstocks-cause-of-death-revealed/",
      "text": "Kelly Clarkson’s ex-husband Brandon Blackstock’s cause of death revealed\nKelly Clarkson’s ex-husband Brandon Blackstock’s cause of death has been revealed.\nBlackstock died at age 48 on Aug. 7 of melanoma, a form of skin cancer, Silver Bow County Coroner Dan Hollis told People on Monday.\nThe manner of death was natural causes, Hollis confirmed.\n“Brandon Blackstock passed away peacefully at his home in Butte, Montana on August 7th under hospice care surrounded by his family,” Hollis told the outlet.\nA rep for Blackstock’s family revealed his death last week.\n“It is with great sadness that we share the news that Brandon Blackstock has passed away. Brandon bravely battled cancer for more than three years,” they said in a statement obtained by The Post on Thursday.\n“He passed away peacefully and was surrounded by family. We thank you for your thoughts and prayers and ask everyone to respect the family’s privacy during this very difficult time,” they added.\nThe day before Blackstock’s death, Clarkson abruptly postponed the remaining August shows of her Las Vegas residency.\n“While I normally keep my personal life private, this past year, my children’s father has been ill, and at this moment, I need to be fully present for them,” she said in an Instagram post.\nClarkson added, “I am sincerely sorry to everyone who bought tickets to the shows, and I so appreciate your grace, kindness and understanding.”\nClarkson married Blackstock, her former talent manager, in 2013. She filed for divorce in 2020, with the exes fighting over custody of their two children, daughter River, 11, and son Remington, 9.\nThe divorce was settled in 2022, with Clarkson getting primary custody of their kids and Blackstock walking away with $115,000 per month in spousal support until January 2024 and a monthly amount of $45,600 in child support.\nBlackstock, who was Reba McEntire’s former stepson, was also dad to daughter Savannah, 23, and son Seth, 18, from his marriage to his first wife, Melissa Ashworth. He became a grandpa in 2022 when Savannah welcomed her son, Lake.\nFollowing Blackstock’s death, a source told People that Clarkson is “devastated” for her children.\n“When she found out that he was sick, she remained protective of him for their sake,” the insider said. “Kelly has always tried to keep things classy. It became clear earlier this year that Brandon was not doing well. She’s been devastated for the kids.”\nClarkson missed 10 episodes of her NBC talk show earlier this year while Blackstock’s health was worsening.\n“The Kelly Clarkson Show” is set to return for its seventh season this fall, while Clarkson’s residency is slated to resume in November."
    },
    {
      "url": "https://nypost.com/2025/08/05/entertainment/jamie-lee-curtis-reacts-to-pamela-anderson-liam-neeson-romance/",
      "text": "Jamie Lee Curtis gives blunt response to Pamela Anderson and Liam Neeson’s romance\nJamie Lee Curtis is defending Pamela Anderson and Liam Neeson’s love story.\nThe “Freakier Friday” star, 66, shared a blunt message to the public about the “Naked Gun” actors’ rumored romance in a new interview with “VT.”\n“With all due respect to pop culture, if love has found its way into that relationship, God bless them both,” Curtis said, adding, “Leave them the f–k alone. And let them like each other.”\n“Both of them have had hardship, and they’re both beautiful human beings,” Curtis continued of the stars as she got choked up. “If they actually have found an intimate love with each other, we should all go to bed tonight feeling better.”\nCurtis also called Anderson, 58, “a beautiful person” and noted that the “Baywatch” alum “was fantastic” in their 2024 film “The Last Showgirl.”\n“And he also suffered an unimaginable loss so young, and has had a really hard go of it,” Curtis added of Neeson, 73, who became a widower in 2009 after his wife Natasha Richardson died in a ski accident.\n“So if, in fact, these people have hard launched, then wish them the best and leave them alone,” Curtis concluded.\nNeeson and Anderson struck up chemistry while filming “The Naked Gun” reboot.\n“It’s a budding romance in the early stages,” a source told People last week. “It’s sincere, and it’s clear they’re smitten with each other.”\nWhile Neeson and Anderson haven’t outright confirmed they’re dating, they have gushed over each other during the film’s press tour.\n“I think I have a friend forever in Liam. And we definitely have a connection that is very sincere, very loving and he’s a good guy,” Anderson told Entertainment Weekly earlier this month.\nNeeson told People in October that he was “madly in love” with Anderson.\n“I can’t compliment her enough, I’ll be honest with you,” the “Taken” actor said. “No huge ego. She just comes in to do the work. She’s funny and so easy to work with.”\nThe stars have also packed on the PDA in recent weeks.\nAnderson planted a kiss on Neeson’s cheek at the London premiere of “The Naked Gun” last month, and then they pretended to make out during an appearance on “Today” later in July.\nNeeson was previously married to Richardson from 1994 until her death in 2009. They welcomed two sons together, Micheál, 30, and Daniel, 28, the latter of whom showed approval of his dad’s new romance on a recent episode of “Watch What Happens Live with Andy Cohen.”\nAnderson, for her part, has had five marriages with four different men, including Mötley Crüe rocker Tommy Lee, who is the father of her sons Brandon Thomas Lee, 29, and Dylan Jagger Lee, 27."
    },
    {
      "url": "https://www.richandtoneproductions.com/",
      "text": "Rich+Tone are one of the most sought after creative teams in Hollywood and a driving force behind top live shows, major tours, primetime television and acclaimed films.\nRich+Tone Are Proud To Be Part Of The Tony Award Winning Show MJ The Musical\nMadonna - Superbowl Performance\nCredits\nAbout Rich + Tone\nEvolving from Dancers, to Choreographers and then to Creative Directors, Producers, and now as Directors, Rich + Tone are proprietors of Rich+Tone Productions, which creates, produces and collaborates on the making of television, film, live events, stage shows and tours.\nMichael Jackson - Billboard Music Awards\nRich + Tone Talauega’s talents encompass wide-ranging success as music video directors, creative directors, musicians, producers, and performers who are at the forefront of today's pop culture movement. As multi-faceted artists, they are able to achieve truly unique results in their work as a creative force across all disciplines of entertainment, which continue to make them highly sought after by the top names in the industry.\nAs teenagers, Rich + Tone were discovered by Michael Jackson's choreographer while free-styling at a club in Oakland, CA. Within a year, Rich + Tone were on their way to becoming legendary dancers and choreographers, having toured with both Diana Ross and Michael Jackson within months of moving to Los Angeles.\n|\nRich + Tone's dedication, unique style, and creative abilities have translated into work in a range of artistic mediums. Their highly visible projects include work for iPod, Coca-Cola, X-Box, Pepsi, Gap, Mitsubishi, Old Navy, Kia, as well as the feature films “Step Up 3D”, “Battle of the Year: The Dream Team,” “StreetDance 2,\" and \"Save The Last Dance.\" In 2008 they served as Artistic Directors and Choreographers for what was “the biggest performance ever created for ‘Dancing With the Stars” – a piece celebrating Macy’s 150th Anniversary, in which they took viewers on a journey – “Dancing through the Decades” – the 1930′s, 1960′s, 1980′s, and the Future. Rich + Tone returned to their roots, choreographing multiple numbers in the critically acclaimed “Michael Jackson The Immortal World Tour” and Cirque du Soleil's newest show \"Michael Jackson ONE\" at the Mandalay Bay Resort and Casino in Las Vegas.\nThe list of artists seeking their collaboration includes Madonna, Miley Cyrus, Jennifer Lopez, Usher, Chris Brown, Robin Thicke, Gwen Stefani, Christina Aguilera, Kylie Minogue, Missy Elliott, Black Eyed Peas, The Backstreet Boys, Monica, Pink, and Dirty Vegas. Rich + Tone creative directed Madonna's MDNA Tour, the highest grossing tour of 2012, as well as her Super Bowl XLVI Half Time Show performance, which was the second most-watched live televised event in US history only behind Michael Jackson, the King of Pop’s halftime performance. 2012 turned out to be a landmark year for Rich + Tone, as both the MJ Immortal World Tour and MDNA were the top two highest grossing tours of the year. They were also the associate directors and choreographers of Miley Cyrus’s 2014 Bangerz Tour, which received rave reviews.\n|\nRich + Tone have been nominated for numerous MTV Video Music Awards for videos such as Chris Brown’s “Fine China,” Jennifer Lopez's \"Get Right,\" Madonna's \"Sorry\" and \"4 Minutes,\" as well as Chris Brown's \"Wall to Wall\" and \"Forever”. They also received an Emmy Nomination for their work on the 2005 NAACP Image Awards.\nRenowned photographer and director, David LaChappelle has often sought out the talents of Rich + Tone, working with them on several video and commercial projects. Rich + Tone collaborated with LaChappelle on the critically acclaimed film “Rize” for which they served as producers of the film, choreography coordinators, and producers of the soundtrack. The film was released in June of 2005 by Lions Gate, and Peter Travers of Rolling Stone described the film as \"A knockout! A visual miracle!\"\nBiography\nChris Brown - Video Music Awards\nProcess\nRich + Tone are sought after to bring their unique creative vision to a production and then work collaboratively with producers `to bring the vision to life.\nWorking from inception and on through to casting, Music, set design, lighting, costume, choreography and many other creative elements, Rich + Tone help bring a special creative edge to any production.\nParty Rock\nReel\nRich + Tone have worked with some of the biggest names in the business, including Michael Jackson, Madonna, Chris Brown, Usher, Justin Timberlake, No Doubt and many others.\nThe brothers created and produced a string of iconic televison performances for the Grammies and the MTV Video Music Awards. while also making Michael Jackson's posthumous performance at the Billboard Music Awards come alive.\nTheir producing of the acclaimed film \"Rize\" from Lions Gate, proved their abilities even further, garnering many acclaimed reviews and awards."
    },
    {
      "url": "https://www.sphereentertainmentco.com/the-backstreet-boys-add-final-three-shows-to-sphere-summer-2025-residency-into-the-millennium/",
      "text": "The Backstreet Boys Add Final Three Shows To Sphere Summer 2025 Residency “Into The Millennium”\nGENERAL ONSALE FOR THE NEWLY ADDED DATES BEGINS\nFRIDAY, MAY 16 AT 10 AM PT AT BACKSTREETBOYS.COM\n(New York, NY – May 7, 2025) – Due to overwhelming demand, the Backstreet Boys are adding a final three shows to their highly anticipated summer residency, “Into The Millennium” at Sphere in Las Vegas on August 22, 23 and 24, bringing the total number of shows to 21, and marking their final shows of 2025. Produced by Live Nation, the Backstreet Boys are the first pop act to perform at Sphere and will bring their legendary Millennium album to life, alongside a selection of their greatest hits, for incredible performances July 11, 12, 13, 18, 19, 20, 25, 26 and 27, and August 1, 2, 3, 8, 9, 10,15, 16, 17, 22, 23, and 24, 2025.\nThis announcement comes on the heels of their performance at Stagecoach and ahead of their appearance at the 60th Academy of Country Music Awards tomorrow, where they will debut their duet with Rascal Flatts on the reimagined version of “What Hurts the Most,” turning the epic country ballad into a vocal-driven masterclass of emotive, pop-country magic. Listen to the collaboration HERE.\nTICKETS: Tickets for the newly added dates will first be available via the Backstreet Boys Fan Club Presale beginning Monday, May 12 at 12pm PT. The Artist Presale will follow, beginning Tuesday, May 13 at 10am PT. Fans can sign up for the Artist Presale HERE now until Sunday, May 11 at 10pm PT. The general on sale will begin Friday, May 16th at 10 AM PT at backstreetboys.com.\nVibee, the music-led destination experience company, is the official Concert & VIP Hotel Experience Package partner for Backstreet Boys at Sphere, allowing the band’s biggest fans to get their hands on tickets ahead of the general public on-sale. All Vibee packages include a choice of GA floor or reserved seating at Sphere, a two-night stay at The Venetian Resort Las Vegas or Virgin Hotels Las Vegas, access to the Backstreet Boys Experience pop-up, and a collectible BSB laminate and lanyard. The VIP edition of Vibee’s packages provides additional perks including premium reserved seating and priority entry into Sphere, luxury motorcoach transport to and from the airport, an exclusive BSB curated gifting kit, and more exclusive benefits. For more information and access to tickets through Vibee’s packages on-sale Thursday, May 8 at 10am PT, please visit backstreetboys.vibee.com.\n*Meet and greet is not part of the Vibee package\nEarlier this year the Backstreet Boys announced that they are releasing Millennium 2.0 via Sony Legacy on July 11th, to celebrate the 25th anniversary of their chart-topping, 5-time GRAMMY- nominated album, Millennium. This deluxe re-issue will feature 25 tracks, including all 12 remastered originals, live recordings, demos, including “I Want It That Way” and B-sides, including the alternate version of “I Want It That Way.” Fans will also get to hear their brand new single, “HEY,” when they pre-save Millennium 2.0 now at backstreetboys.com.\nTickets for the July 11, 12, 13, 18, 19, 20, 25, 26, 27 and August 1, 2, 3, 8, 9, 10, 15, 16, 17 are on sale now with limited availability at backstreetboys.com\nSphere’s next-generation technologies include the world’s highest resolution LED display that wraps up, over, and around the audience creating a fully immersive visual environment. The venue also features the world’s most advanced concert-grade audio system, Sphere Immersive Sound, which delivers audio with unmatched clarity and precision to every guest.\nTHE BACKSTREET BOYS AT SPHERE\nFriday, July 11, 2025\nSaturday, July 12, 2025\nSunday, July 13, 2025\nFriday, July 18, 2025\nSaturday, July 19, 2025\nSunday, July 20, 2025\nFriday, July 25, 2025\nSaturday, July 26, 2025\nSunday, July 27, 2025\nFriday, August 1, 2025\nSaturday, August 2, 2025\nSunday, August 3, 2025\nFriday, August 8, 2025\nSaturday, August 9, 2025\nSunday August 10, 2025\nFriday, August 15, 2025\nSaturday, August 16, 2025\nSunday, August 17, 2025\nFriday, August 22, 2025\nSaturday, August 23, 2025\nSunday, August 24, 2025\nABOUT BACKSTREET BOYS\nFor more than 30 years the Backstreet Boys have delivered the finest pop music one has to offer, making them one of pop’s most influential performers. With countless #1s, record-setting tours, numerous awards and worldwide sales in excess of 130 million, BSB has been recognized as the best-selling boy band in history.\nIn early 2019, BSB released their GRAMMY nominated 10th studio album “DNA” on RCA Records. The album debuted at #1 and features the Top 10 hit “Don’t Go Breaking My Heart.” The critically acclaimed and chart topping single was nominated for “Best Pop Duo / Group Performance” at the 2019 GRAMMY Awards, and was BSB’s first hit on the Billboard Hot 100 in 10 years. Upon its release, the single went straight to #1 on iTunes Top Songs and Global charts and charted in over 22 countries.\nIn May 2019 the Backstreet Boys kicked off “The DNA World Tour” – the group’s biggest arena tour in 18 years thanks to the global success of their #1 new album. With over 3 million tickets sold worldwide, the DNA World Tour has seen the group sell out arenas all over North America, Europe, Asia and South America.\nIn the fall of 2023, the Backstreet Boys released their first ever and highly anticipated Christmas album, ‘A Very Backstreet Christmas.’ The album features timeless holiday classics such as “White Christmas”, “Silent Night”, and “Have Yourself A Merry Little Christmas” plus three all new original holiday songs “Christmas In New York,” “Together,” and “Happy Days.” The album debuted at No. 1 on Billboard’s Top Holiday Albums chart and Top 20 on the Billboard 200 upon release.\nOver the years, the Backstreet Boys have repeatedly captivated millions of people with their impressive catalog of hit songs and creative partnerships and continue to be larger than life.\nMEDIA CONTACTS:\nThe Lede Company\nCara Hutchison\nChris Iacullo\nLive Nation Concerts:\nMaya Sarin | [email protected]\nSphere:"
    }
  ],
  "argos_summary": "The Backstreet Boys have launched their 'Into The Millennium' residency at the Sphere in Las Vegas, marking their first performances in this cutting-edge venue. Each member has unique pre-show rituals, with a collective moment of prayer before taking the stage. The residency features high-tech visuals and has been met with overwhelming demand, leading to additional shows being added. The group, which has been performing for over 30 years, continues to captivate audiences with their iconic hits and innovative performances.",
  "argos_id": "L8P0XWAAI"
}