{
  "url": "https://gizmodo.com/whats-going-on-at-tesla-a-wave-of-executives-is-heading-for-the-exits-2000641630",
  "authorsByline": "Luc Olinga",
  "articleId": "ddb0bc8abd8c448b98693624b79814f3",
  "source": {
    "domain": "gizmodo.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://gizmodo.com/app/uploads/2023/03/c42efb8da131a90f99e696c964c849d8.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T22:25:49+00:00",
  "addDate": "2025-08-11T22:46:22.400953+00:00",
  "refreshDate": "2025-08-11T22:46:22.400955+00:00",
  "score": 1.0,
  "title": "What’s Going On at Tesla? A Wave of Executives Is Heading for the Exits",
  "description": "Tesla, already battling slowing sales and a shifting market, is now facing a quieter but potentially more damaging crisis: a mass exodus from its leadership ranks.",
  "content": "What’s going on at Tesla? The electric vehicle manufacturer, navigating a challenging business landscape marked by increased competition and evolving consumer sentiment, also appears to be facing a significant internal crisis: a rapid exodus of top talent.\n\nElon Musk’s group has now lost its 10th executive this year. The latest departure is Piero Landolfi, who announced his exit on LinkedIn after nearly nine years with the company.\n\n“After 8 3/4 years I have made the difficult decision to leave Tesla,” Landolfi posted. “It was hard because of the incredibly talented and passionate people that I had the privilege to work, sweat and laugh with as we were accelerating the world to sustainable energy, against all odds and in spite of what used to be the general beliefs about electric cars.”\n\nHe continued: “It was hard because of the amazing products we build, the first principle thinking and the getting stuff done mentality that makes Tesla such an exciting place to work at.\n\nThe post has garnered significant attention, with over 834 likes and nearly 250 comments, largely from individuals who collaborated with him during his tenure at Tesla or in his leadership role.\n\nLandolfi cited the familiar desire for a “new and different adventure” as his reason for leaving. “However, it is now time for my next adventure. This is the way,” he concluded, echoing a popular phrase from the Star Wars franchise.\n\nHis next move is to Nimble, an AI robotics and autonomous e-commerce fulfillment technology company, where he has taken on the role of Senior VP of Operations. Notably, Nimble already counts former Tesla veterans among its ranks, suggesting a potential trend of talent migrating from the EV maker to the burgeoning AI and robotics sectors.\n\nLandolfi’s journey at Tesla began in October 2016 when he joined as Director of Services, Technical Operations. His contributions led to a promotion nearly four years later to Director of Services, North America, a position he held until his departure this month.\n\nHis exit marks the tenth executive departure from Tesla this year, a cascade of departures that has hit nearly every critical division of the company. The exodus began in February with the exit of David Imai. April saw the departures of David Lau and Mark Westfall. The pace accelerated in May with the loss of Prashant Menon and Vineet Mehta. June witnessed the exits of Omead Afshar, Milan Kovac (Head of Optimus Humanoid Robot Team), and Jenna Ferrua (Director of HR). Last month, Troy Jones, the VP of Sales, Service, and Delivery in North America, left. This month, in addition to Landolfi, Pete Bannon, the VP of Hardware Engineering (Chip Tech and Dojo Supercomputer), also announced his departure.\n\nThese latest two departures coincide with a period of significant upheaval within Tesla’s ambitious AI initiatives, particularly the winding down of Dojo, Tesla’s custom-built supercomputer designed to train the neural networks for Full Self-Driving (FSD) and Tesla’s humanoid robot, Optimus. The Dojo project, an expensive and technically risky strategy aimed at reducing reliance on Nvidia’s GPUs, had already faced internal turbulence and questions about its long-term viability in a market dominated by established chip giants.\n\n“Once it became clear that all paths converged to AI6, I had to shut down Dojo and make some tough personnel choices, as Dojo 2 was now an evolutionary dead end,” Musk explained in an August 10 post on X (formerly Twitter).\n\nFor any company, losing this many senior leaders in such a short time is a major red flag. It signals potential internal turmoil, a loss of crucial institutional knowledge, and raises serious questions about the company’s future direction and the stability of its leadership culture under Musk.\n\nNot long ago, Tesla, having successfully scaled mass production of electric vehicles with the Model 3 and Model Y, was considered a magnet for top talent. This year’s brain drain suggests the company may have lost some of its allure, potentially exacerbated by its CEO’s increasingly vocal and often polarizing political stances, which have alienated some segments of the market and workforce.\n\nIt’s clear now that, in addition to challenges in sustaining its once-unstoppable sales growth in an increasingly competitive EV market, Tesla is facing another significant hurdle: retaining its top leadership. The short-term sales boost anticipated from consumers seeking to take advantage of the $7,500 federal tax credit on new EV purchases before it expires on September 30 may offer a temporary reprieve, but it can’t mask the deeper issue.\n\nTesla’s biggest challenge is no longer just selling cars; it’s convincing its own top talent to stay for the ride.",
  "medium": "Article",
  "links": [
    "https://www.linkedin.com/feed/update/urn:li:activity:7360051295661019136/",
    "https://twitter.com/elonmusk/status/1954569832956830066?ref_src=twsrc%5Etfw"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Tesla",
      "weight": 0.07663193
    },
    {
      "name": "former Tesla veterans",
      "weight": 0.07313316
    },
    {
      "name": "top talent",
      "weight": 0.05508567
    },
    {
      "name": "new EV purchases",
      "weight": 0.05368392
    },
    {
      "name": "departures",
      "weight": 0.052537713
    },
    {
      "name": "Dojo Supercomputer",
      "weight": 0.052264705
    },
    {
      "name": "potential internal turmoil",
      "weight": 0.050642107
    },
    {
      "name": "Dojo",
      "weight": 0.050077982
    },
    {
      "name": "significant attention",
      "weight": 0.049948663
    },
    {
      "name": "significant upheaval",
      "weight": 0.049503345
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Auto"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.94970703125
    },
    {
      "name": "/News/Technology News",
      "score": 0.62841796875
    },
    {
      "name": "/Autos & Vehicles/Motor Vehicles (By Type)/Hybrid & Alternative Vehicles",
      "score": 0.57470703125
    },
    {
      "name": "/Autos & Vehicles/Motor Vehicles (By Brand)/Tesla Motors",
      "score": 0.55224609375
    },
    {
      "name": "/Business & Industrial/Automotive Industry",
      "score": 0.42919921875
    }
  ],
  "sentiment": {
    "positive": 0.065406725,
    "negative": 0.62604,
    "neutral": 0.30855334
  },
  "summary": "Tesla is experiencing a significant internal crisis, with the company losing its 10th executive this year. Piero Landolfi, who had been with Tesla for nearly nine years, announced his departure on LinkedIn. His next move is to Nimble, an AI robotics and autonomous e-commerce fulfillment technology company, where he will take on the role of Senior VP of Operations. This departure marks the tenth executive departure from Tesla this year, affecting nearly every critical division. The departures coincide with significant upheaval within Tesla's AI initiatives, particularly the winding down of Dojo, a supercomputer designed to train the neural networks for Full Self-Driving (FSD) and Tesla's humanoid robot, Optimus. The company may also face challenges in sustaining its ability to grow in an increasingly competitive market.",
  "shortSummary": "Tesla faces a rapid exodus of top executives, leading to internal turmoil and potential leadership changes, highlighting ongoing challenges and potential challenges in its business and workforce.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "26284fc6ce644da1b4f8048f7aeef4fb",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.linkedin.com/feed/update/urn:li:activity:7360051295661019136/",
      "text": "After 8 3/4 years I have made the difficult decision to leave Tesla. It was hard because of the incredibly talented and passionate people that I had the privilege to work, sweat and laugh with as we were accelerating the world to sustainable energy, against all odds and in spite of what used to be the general beliefs about electric cars. It was hard because of the amazing products we build, the first principle thinking and the getting stuff done mentality that makes Tesla such an exciting place to work at. However, it is now time for my next adventure. This is the way.\nNo! I reject this. Gosh Piero I’m sad to see you leave. I value your confident, steady, customer-first leadership, and your ability to break an issue down to what really matters, silencing the noise. Best wishes on what’s next for you!\nI like how to choose your path and make decisions on your own terms. I am sure the new fork in the road will be a rewarding one. Stay healthy and happy along with a good sense of humor along the way. Miss you. Take Care!\nYou deserve nothing but the best Piero! Even though all the craziness you were always level headed, focused and, most importantly, fun to be around. It was a blast working with you. Keep it up\nA legend. Congrats!\nThanks for all you did, Piero! It was always a pleasure working with you.\nAll the best Piero! You’ll be missed! 🦾⚡️🖤\nWhat an imprint you made on Tesla service. And this was at a time we needed to scale massively as we went from servicing thousands to millions. The thing I most respected from you was your curiosity. Which feed your tendency to say “maybe” and be curious, and thus uncovered so many truths. Great job Piero!\nCongrats, Piero! Most likely, we'll see each other in the Bay. Exciting times ahead with your new role!\nNorth America Sales & Delivery Operations\n2dBest of luck Piero! You are beyond loved and your imprint on Tesla service is foundational. Cheering you on 🌟"
    }
  ],
  "argos_summary": "Tesla is experiencing a significant internal crisis marked by the departure of its tenth executive this year, Piero Landolfi, who has joined AI robotics company Nimble. This trend of executive exits raises concerns about internal turmoil and the company's leadership stability under Elon Musk, especially as Tesla faces increased competition in the electric vehicle market. The recent departures coincide with challenges in Tesla's ambitious AI initiatives, particularly the winding down of the Dojo supercomputer project, indicating deeper issues beyond just sales performance.",
  "argos_id": "LB5V0WC7S"
}