{
  "url": "https://www.nytimes.com/live/2025/08/11/us/trump-news/trump-says-he-will-clear-out-washingtons-homeless-population-but-offers-few-details",
  "authorsByline": "Anushka Patil",
  "articleId": "26d3499ed8c4499f85b25a1aa30d03f5",
  "source": {
    "domain": "nytimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "AZ",
      "county": "Pima County",
      "city": "Tucson",
      "coordinates": {
        "lat": 32.1988848,
        "lon": -110.8218543
      }
    }
  },
  "imageUrl": "https://static01.nyt.com/images/2025/08/11/multimedia/11trump-news-homeless-top-pvkj/11trump-news-homeless-top-pvkj-mediumSquareAt3X.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T12:06:17+00:00",
  "addDate": "2025-08-12T00:54:34.854393+00:00",
  "refreshDate": "2025-08-12T00:54:34.854395+00:00",
  "score": 1.0,
  "title": "Trump says he will clear out Washington’s homeless population but offers few details.",
  "description": "D.C.’s mayor acknowledged local officials could do little to block what was expected to be a 30-day takeover of the capital’s policing. President Trump suggested his action might be expanded to other cities.",
  "content": "Trump says he will clear out Washington’s homeless population but offers few details. Tents set up near the Institute of Peace in Washington, D.C., on Monday. Nonprofit agencies that serve homeless residents of Washington were left with little idea of what to expect on Monday after President Trump declared he would clear out the capital’s homeless population without saying how it would be done or where homeless people would go. Mr. Trump, during a news conference announcing that Washington’s Metropolitan Police Department would be placed under federal control for 30 days, said that officers from the department, alongside federal authorities, are “getting rid of the people from underpasses and public spaces from all over the city.” Mr. Trump, who has spent months railing against daily living conditions in Washington, said on Monday that the city had been overwhelmed by “bloodthirsty criminals” and homeless people. In fact, data from the Metropolitan Police Department shows that violent crime in the city is at a 30-year-low, and according to city data, homelessness fell 9 percent from January 2024 to January 2025. Efforts to clear homeless encampments in Washington predate the Trump administration and are overseen by the city government and the Metropolitan Police or the National Park Service, depending on whether the encampments are on city or federal land. The U.S. Park Police, a unit of the Park Service, has removed more than 70 encampments in the city since Mr. Trump signed an executive order in March requiring the Park Service to clear encampments on federal land in the city, Doug Burgum, the interior secretary, told reporters on Monday. Advocates for homeless people have long argued that encampment evictions simply displace residents from their communities and further exacerbate housing instability. “By doing sweeps and moving people out of their community, you’re not solving the problem,” said Ralph Boyd, the chief executive of So Others Might Eat, a Washington-based social services nonprofit. “You’re just moving it somewhere else and arguably actually making it worse, because here in the district, if someone is unhoused, they’re within shouting distance of services that can help them.” Mr. Trump’s latest promise to crack down on homelessness in Washington came after he demanded that homeless residents of the city leave “IMMEDIATELY” in a social media post on Sunday. “We will give you places to stay, but FAR from the Capital,” he wrote. It remained unclear how the federal takeover of the Metropolitan Police could change its role in the crackdown — for example, whether the police department’s enforcement would now focus on federal land or would continue to remove people camping on city property. “Nobody really knows how this is going to play out,” said Andy Wassenich, director of policy at Miriam’s Kitchen, a nonprofit that provides food and housing services for the homeless. Washington, Mr. Wassenich said, does not have the capacity to move every person living on the streets into shelters — not even to move them into jails or hospitals, as Mr. Trump has threatened to do. “Where are they going to take them?” Mr. Wassenich asked. For now, the street outreach team of Miriam’s Kitchen, which covers 33 square miles in the northwestern parts of the city, is relaying news of the federal police takeover to homeless residents and conveying some of the possibilities — that Metropolitan Police could make them move or hospitalize them, Mr. Wassenich said. The overarching message, he said, is that it is not a safe time to be living outside in Washington, and that anyone who can find a shelter bed or temporarily stay with friends or family should try to do so. Mr. Wassenich added that Mr. Trump was taking a criminal approach to what is fundamentally an economic problem — a shortage of affordable housing. “I’ve worked with people who have a sixth-grade education and people who have master’s degrees from Ivy League universities,” he said of the homeless. “The one thing they had in common is that they couldn’t afford rent.”\n\nNew York’s Democratic governor called in the troops last year to fight subway crime. Members of the National Guard patrolling the New York subway system in 2024. Adam Gray for The New York Times President Trump is not the only elected leader to deploy National Guard troops in response to a supposed crime wave that many have questioned. In March 2024, Gov. Kathy Hochul of New York, a Democrat, announced that she would deploy 750 members of the National Guard to New York’s subway system. It was a jarring sight to some New Yorkers who were not accustomed to seeing troops in military uniforms patrolling the subway with rifles. There is an important difference between the situation in Washington, and the one in New York, however: Ms. Hochul, as New York’s governor, controls the state’s National Guard and can deploy it as she sees fit. Mr. Trump, on the other hand, is sending the Guard into the streets of Washington against the wishes of the city’s leaders, just as he sent the National Guard to the streets of Los Angeles in June over objections from both the mayor and California’s governor. In the subways, Ms. Hochul said the deployment worked. Crime in the subway declined 27 percent in the 12 months following the troops’ arrival, she said. This summer, the Metropolitan Transportation Authority experienced its safest July on record, with an 8 percent drop in major felony crimes compared to July 2024, according to data from the governor’s office. Others point to data that suggests the Guard deployment may have had little effect, since crime in the subway was already declining before Ms. Hochul’s announcement. The rates of rape, robbery, burglary and assault all spiked in early 2020 during the Covid-19 pandemic, according to a report by Vital City, an urban policy think tank. By the middle of 2020, transit crime started to retreat across nearly all categories. That drop in subway crime has continued. It fell by another 2 percent in the first half of 2025, led by declines in harassment and misdemeanor assaults. One type of crime increased, however: felony assaults, which typically involve more serious injuries than misdemeanor assaults. There were 349 felony assaults reported in the subway in the first six months of 2025, a 7 percent increase over the same period last year, according to police data. While crime totals are down, anecdotal reports of disturbing, violent and sometimes fatal crimes in the subway still grip the city at times. Weeks before the National Guard troops were deployed, a train conductor was slashed. The next day, some New York City Transit workers stopped work for several hours to call attention to safety problems, causing delays across the system. Daniel Lambright, special counsel for criminal justice litigation at the New York Civil Liberties Union, said that the troop deployments in Washington and New York had less to do with deterring crime than with politics. “They’re really just efforts of political theater to appeal to their political bases,” he said. In June, after Mr. Trump sent the National Guard to Los Angeles, Ms. Hochul and other prominent Democrats released a statement accusing him of overreach. “It’s important we respect the executive authority of our country’s governors to manage their National Guards,” the statement said. On Monday, a spokeswoman for Ms. Hochul, Emma Wallner, said in a statement, “Trump’s betting that his fear-mongering tactics will distract from his Administration’s failed policies.” Danny Pearlstein, a spokesman for Riders Alliance, which represents New York transit users, pointed out that the city and state already spent hundreds of millions of dollars a year policing the subway before the National Guard was deployed. “We’re using the wrong tool,” Mr. Pearlstein said. “We already have law enforcement. What’s missing is housing and health care” for people in the subway — and across the city — who are homeless and experiencing mental health crises, he said.\n\nMuriel Bowser, the mayor of Washington, D.C., during a Monday news conference. Muriel Bowser, the mayor of Washington, on Monday called President Trump’s announced takeover of the city’s police force “unsettling and unprecedented” but appeared resigned to cooperate with it, stressing at a news conference that there was little she could do to block the move. She repeatedly characterized Mr. Trump’s federalization of the city’s police force, under an emergency declaration to combat a crime “crisis” despite falling violent crime rates, as a workable extension of the oftentimes collaborative relationship between federal and local law enforcement entities tasked to the nation’s capital. Ms. Bowser’s tone was strikingly diplomatic, an approach in keeping with the more muted posture she has adopted toward Mr. Trump during his second term, as compared to more fiery statements during his first term opposing similar threats to the city’s limited autonomy. The “plain language” of the city’s home rule charter, she explained, authorized the president to declare a public safety emergency and request the city to defer to the directions of the federal government. And, she added, “it says the mayor shall comply with those requests.” Under the Home Rule Act of 1973, which gave D.C. the power to elect its own local government but left Congress with ultimate power over the city’s laws and budget, Mr. Trump can declare a state of emergency to assert control over local law enforcement for 30 days. “We have a responsibility to support the executive order and one of the roles I have is to ensure that we work very collaboratively with our federal partners,” she said, later adding: “Our relationship with our federal partners is not new, we do this on a daily basis.” But despite her calm demeanor, it was clear that Ms. Bowser viewed Mr. Trump’s announcement as fundamentally different than anything the city has experienced in decades. “I don’t want to minimize what was said, and I don’t want too minimize the intrusion on our autonomy,” she told reporters. She dismissed Mr. Trump’s assertions of a crime-ridden D.C. as fundamentally divorced from fact, rattling off statistics indicating that the city had actually reversed a crime wave that rose on the heels the Covid-19 pandemic and crested in 2023. She argued that Mr. Trump was fully aware of those details. “In every conversation I have with him, we’re always briefing the president on our progress,” she said. In their first meeting after Mr. Trump’s November re-election, she added, “we went over the crime trends, we went over how we’re seeing decreases, so the president is read in on our efforts.” The city’s murder rate, while higher than it was 15 years ago, has been dropping over the past 18 months and is now where it was before the pandemic. The number of carjackings has also dropped precipitously after a steep spike in 2023. City officials say that violent crime generally is at a 30-year low, and while the F.B.I. measures violent crime somewhat differently than the district, the recent trend in the city is clear. Ms. Bowser said that city leaders would “continue to look for ways to make our city safe,” praising the local police force for their efforts. She also insisted that Chief Pamela Smith would remain in charge of the D.C. police, working with the administration while the force answers to the Department of Justice, despite Mr. Trump’s suggestion that there would be a change in leadership. Still, Ms. Bowser was careful not to express direct anger at Mr. Trump in her own words, referring instead to a statement from Brian Schwalb, the D.C. attorney general, to communicate her umbrage at Mr. Trump’s move. On Monday, Mr. Schwalb put out a statement calling Mr. Trump’s takeover “unprecedented, unnecessary, and unlawful,” adding that city officials “are considering all of our options and will do what is necessary to protect the rights and safety of District residents.” Ms. Bowser instead directed her most palpable frustrations toward Congress, pointing out that lawmakers had opportunities in recent years to put more power in the hands of Washington residents and its mayor, but had chosen not to. Ms. Bowser, like other past leaders of Washington, has been a staunch advocate for statehood, which would give the city the ability to govern itself and ensure that its residents had voting representation in Congress. In 2020 and 2021, the House of Representatives, then led by Democrats, passed bills that would have granted D.C. statehood, but neither passed the Senate. Ms. Bowser also pointed out that lawmakers had an opportunity to put the D.C. National Guard under the mayor’s authority, and didn’t. When asked Monday about Mr. Trump’s threats to deploy additional active duty military units beyond the National Guard to D.C., she said she did not believe it was legal “to use the American military against American citizens on American soil.” Several Democrats said they planned to introduce bills or legislation to address Mr. Trump’s announcement and reverse its effects. They include Representative Jamie Raskin, whose Maryland district includes Washington suburbs, who said he would introduce a resolution to “reverse this plainly ridiculous state of local emergency” and restore local control to D.C.’s government. Representative Eleanor Holmes Norton, the District of Columbia’s nonvoting delegate, and Senator Chris Van Hollen of Maryland have also said they would reintroduce bills that would repeal the president’s authority to take temporary control of the D.C. police and that would give the city’s mayor authority over the D.C. National Guard. These measures face an uphill climb to pass a Republican-controlled Congress, particularly given a 60-vote threshold needed to pass most legislation.\n\nTrump has pulled the military into yet another political issue. President Trump has previously used the military to advance his domestic agenda by deploying around 10,000 active-duty troops to the southwest U.S. border and 5,700 National Guard troops and Marines to quell protests in Los Angeles. President Trump’s decision to send at least 800 National Guard troops into the streets of Washington to fight crime is the latest example of how the president has used the military to advance domestic policy priorities. Though crime rates in the capital have been falling, Mr. Trump has said that they are “totally out of control” and has threatened a federal takeover. Already this year, Mr. Trump has deployed some 10,000 active-duty troops to the southwest U.S. border to choke off the flow of drugs as well as migrants, and 4,700 National Guard troops and Marines to Los Angeles to help quell protests that had erupted over immigration raids and to protect the federal agents conducting them. All but about 250 of those National Guard troops have since been withdrawn. Mr. Trump last month secretly signed a directive to the Pentagon to begin using military force against certain Latin American drug cartels that his administration has deemed terrorist organizations. The National Guard troops who will fan out across Washington starting this week will not perform law enforcement tasks, Pentagon officials said on Monday. Instead, 100 to 200 Guard soldiers at any given time will help with such tasks as logistics and transportation, while providing a “physical presence” in support of federal agents, the Army said in a statement. But like the Guard in Los Angeles, the soldiers in Washington will probably be able to detain people temporarily in certain circumstances until federal agents arrive, officials said. The soldiers will be armed and authorized to defend themselves, military officials said. “You will see them flowing into the streets of Washington in the coming week,” Defense Secretary Pete Hegseth, a former National Guard infantryman, said at a White House news conference on Monday morning, standing next to Mr. Trump. Mr. Hegseth offered no details on how long the National Guard would be deployed in the capital. But he said they “will be strong, they will be tough and they will stand with their law enforcement partners.” The Pentagon is contacting National Guards in other states, including “specialized units,” in case reinforcements are needed, Mr. Hegseth said. But a senior Army official said the 800 D.C. Guard soldiers tapped for duty should be sufficient. In a Truth Social post on Monday morning, Mr. Trump said, “I will, MAKE OUR CAPITAL GREAT AGAIN!” Unlike a state’s governor, the District of Columbia does not have control over its National Guard, giving the president broad leeway to deploy those troops. The D.C. Guard’s chain of command runs from its commanding general to the secretary of the Army to Mr. Hegseth to the president. The U.S. military responds quickly to executive directives. For that reason, it is a preferred institution for a president who presents himself as tough on crime, undocumented immigrants, drugs, “woke” culture and other perceived domestic enemies. But in recent months that has put the military at the center of a series of partisan political issues, traditionally where its leaders in the past have least wanted to be. Mr. Trump’s directive deploying National Guard troops to Washington “is a fraught one because it will seem partisan from the get-go,” said Peter Feaver, a political science professor at Duke University. “The military does not train for normal police beat-walking missions,” Mr. Feaver said in an interview. Military leaders are trying to keep the rules of engagement for the D.C. mission as narrow as possible, one Defense Department official said, so that soldiers with M-16s who have been trained to kill adversaries are not put in policing roles. “This is part of a pattern where the administration is using and appropriating military resources for nonmilitary domestic goals,” said Carrie A. Lee, the former chair of the department of national security and strategy at the Army War College. “Whether it’s immigration or going against drug cartels or crime in Washington, it’s very clear, to me at least, that this administration sees the military as a one-size-fits-all solution to its accomplishing its domestic political priorities.” Critics in Congress also assailed the new directive. “Our military is trained to defend the nation from external threats and assist communities during disasters or emergencies, not to conduct day-to-day domestic policing,” Senator Jack Reed of Rhode Island, the top Democrat on the Armed Services Committee, said in a statement. “This deployment is a serious misuse of the National Guard’s time and talent.” During Mr. Trump’s first term, Pentagon and military leaders cautioned him against using troops to shoot racial justice protesters in the legs, as former aides have said he suggested. He heeded their warnings, though some National Guard soldiers used aggressive tactics against protesters. But in Mr. Hegseth, Mr. Trump now has a defense secretary who has enthusiastically supported the president’s desire to use military force inside the country. For the troops, and for the military in general, there could be risks in calling on them for matters traditionally handled by other institutions. In some cases, troops could feel pitted against their own neighbors. “They’re members of the community, which is why these types of missions are very unpopular with those serving,” said Dr. Lee, who is now a senior fellow at the German Marshall Fund. “You’re being asked to threaten force against the people whose kids may go to school with yours.” In interviews with The New York Times, members of the California National Guard said the deployment to Los Angeles had eroded the morale of a force that, during the January wildfires, had been welcomed by many in the city. Guard officials also expressed concerns that the deployment would hurt re-enlistment. For the military as a whole, the cost could come in recruiting and retention, military experts say, as few join the military to police the Washington metro area. Mr. Trump’s order came two days after the retirement of Maj. Gen. John C. Andonie, the commanding general of the D.C. Guard. Brig. Gen. Leland D. Blanchard II was named acting commander. “The role of the National Guard is more relevant now than ever,” said General Andonie, who is stepping down after 35 years of service. “Modern citizen-soldiers and airmen must be agile and flexible, as demonstrated by our Guard members responding to missions both at home and abroad.” The D.C. Guard has more than 2,400 members, “with a longstanding commitment to national defense and community,” the Guard said in a statement about the change of command.\n\nTrump takes control of the D.C. police, citing ‘bloodthirsty criminals.’ But crime is down. “Our capital city has been overtaken by violent gangs and bloodthirsty criminals, roving mobs of wild youth, drugged-out maniacs and homeless people,” President Trump claimed on Monday, despite falling crime in Washington. President Trump on Monday took federal control of the police force in the nation’s capital for 30 days and mobilized 800 National Guard troops to fight crime in a city that he claimed was overrun with “bloodthirsty criminals,” even though crime numbers in Washington are falling. During a 78-minute news conference, during which he was flanked by several members of his cabinet, Mr. Trump took the lectern in the White House briefing room and said he also intended to clear out the capital’s homeless population, without saying how officials would do it, or detailing where those people would go. Armed with papers that showed crime statistics, Mr. Trump decried murders in Washington compared with other global cities but ignored the fact that violent crime has fallen recently in the nation’s capital. While the violent crime rate surged in 2023, it fell 35 percent from that year to 2024, according to the city’s Metropolitan Police Department. From January 1 through August 10 each year A chart shows the number of violent crimes in Washington, D.C. from January 1 to August 10 each year from 2010 to 2025. Violent crimes have declined from a peak of nearly 3,300 in the 2023 time span to fewer than 1,600 in 2025, lower than pre-pandemic levels. Instead, Mr. Trump painted Washington as an urban hellscape, repurposing some of the incendiary language he has used to describe conditions at the southern border. Mr. Trump has railed against crime in urban, largely liberal cities for decades, but his announcement on Monday was an extraordinary exertion of federal power over an American city. Warning of “caravans of mass youth” rampaging the city streets and relaying stories of children caught in shootings, Mr. Trump blamed Democrats for allowing the crime. “Our capital city has been overtaken by violent gangs and bloodthirsty criminals, roving mobs of wild youth, drugged-out maniacs and homeless people,” Mr. Trump said. “And we’re not going to let it happen anymore.” Local officials immediately criticized the president’s actions, and pockets of protesters sprang up around the city shortly after Mr. Trump declared a public safety emergency in Washington. Muriel Bowser, the mayor of Washington, said in a news conference on Monday afternoon that Mr. Trump’s actions were “unsettling and unprecedented,” but not surprising. Mayor Muriel Bowser of Washington called Mr. Trump’s actions on Monday “unsettling and unprecedented,” but not surprising. “I can’t say that given some of the rhetoric of the past that we are totally surprised,” Ms. Bowser said, before adding that the police chief, Pamela A. Smith, would remain in her position. Ms. Bowser acknowledged that the law gave Mr. Trump the authority to take over the department temporarily. But she disputed the idea that her administration had done little to curb violent crime in Washington. “There’s nobody here and certainly nobody who works for me who wants to tolerate any level of crime,” said Ms. Bowser, a Democrat. “We work every day to stop crime.” There are practical questions about how Mr. Trump’s plans would be implemented. The Trump administration is relying on a provision of the D.C. Home Rule Act, a law passed by Congress in 1973 establishing local control of Washington. The law gives the president the power to temporarily take over the Metropolitan Police Department. A White House official said the takeover would last 30 days, a time limit outlined in the law. Federal officials were still working out many of the operational details of the president’s plan on Monday afternoon, even though small groups of agents had been conducting limited patrols over the weekend. The effort envisions about 500 federal law enforcement officers, drawn from a host of agencies that operate in Washington, to be used for some version of patrol or support roles of the local police, according to two officials who spoke on the condition of anonymity to describe the still-developing plan. That figure includes roughly 120 F.B.I. agents and about 50 deputy U.S. marshals, as well as agents from the Drug Enforcement Administration and the Bureau of Alcohol, Tobacco, Firearms and Explosives, among other agencies. Some of those agents will be on foot or car patrol duty, while others may be assigned to be visible in high-crime or high-traffic areas, according to the officials. One complicating factor of using federal agents for essentially street-based police work is that those agents do not have the same authority as police officers to arrest people for minor criminal offenses, so the current view among Trump administration officials is that if federal agents see someone commit such a crime, they can stop and detain them until a local police officer arrives and makes an arrest. None of those details were available during Mr. Trump's briefing room appearance, during which he waxed on about his real estate experience, the “oceanfront property” in Ukraine and his coming trip to “Russia” — he is actually going to Alaska to meet with Vladimir V. Putin, Russia’s president. He did not say where city police officers, federal police officers and National Guard members would be stationed throughout the city. Mr. Trump said Attorney General Pam Bondi would oversee the broad effort. He said that Gadyaces S. Serralta, who was sworn in as the director of the U.S. Marshals Service this month, would oversee the police department alongside Terry Cole, who was sworn in as the head of the Drug Enforcement Administration less than a month ago. “I hope I don’t have to fire him in two weeks because he’s too soft,” Mr. Trump said after calling Mr. Serralta up to the briefing room lectern to shake his hand. “If you’re soft, weak and pathetic, like so many people, I will fire you so fast.” Attorney General Pam Bondi at the White House on Monday. She is expected to oversee the broad federal law enforcement crackdown on Washington. Mr. Trump’s remarks seemed largely aimed at rewriting history and the reality of crime in Washington. Soon after he took office, Mr. Trump pardoned hundreds of rioters, some of them violent, who ransacked the Capitol on Jan. 6, 2021. Many had already been convicted of their crimes and were serving their sentences before being immediately released in January. And in the summer of 2020, Mr. Trump deployed more than 5,000 National Guard troops to Washington to crack down on mostly peaceful demonstrators pushing for racial justice. That deployment was widely seen as a debacle. One by one, Mr. Trump summoned members of his cabinet and others to the lectern to discuss how they would carry out his orders. Interior Secretary Doug Burgum said U.S. Park Police officers had been patrolling federal parkland and traffic circles in the city for months, and had removed dozens of encampments of homeless people. And Pete Hegseth, the defense secretary, said 800 National Guard officers would be “flowing” into the city over the next week. Jeanine Pirro, the U.S. attorney for the District of Columbia and a former Fox News personality, delivered a cable-ready monologue against laws in the District that prevent charging minors as adults. “I see too much violent crime being committed by young punks who think that they can get together and gangs and crews and beat the hell out of you or anyone else,” Ms. Pirro said. “We need to go after the D.C. Council and their absurd laws.” Mr. Trump and Ms. Pirro both denounced the use of no-cash bail in Chicago and in Washington, where it has been effectively eliminated since 1992. The practice allows some defendants to be released from jail without posting bail that would help ensure their return to court. As he threatened to get involved with repealing no-cash bail in Chicago, Mr. Trump suggested that other cities would soon be subject to federal intervention, thought it is unclear what legal grounds he could use to exert federal control over them. “I’m going to look at New York in a little while,” Mr. Trump said, “and if we need to, we’re going to do the same thing in Chicago, which is a disaster.” Critics of the administration’s efforts said Mr. Trump deserved part of the blame for crime in Washington. Ankit Jain, a shadow senator for the District of Columbia who is the capital’s advocate in Congress in lieu of official senators, said the vacancy crisis in the U.S. attorney’s office, which prosecutes all adult crimes, had contributed to crime in the city. He also said the city is down two judges out of nine on its highest court, the D.C. Court of Appeals. “What happens when you don’t have enough judges? Trials get delayed, crime goes up,” he said. “Why has the president not made this a priority of nominating judges?” Several Washington residents said on Monday that the crime statistics relayed by the president had unnerved them, though they did not see the kind of violence he described. Others questioned whether calling the National Guard to Washington was necessary. “I’m not a particularly pro-police, pro-law enforcement kind of person,” said Sarah Struble, 37, who lives in the Capitol Hill neighborhood. “I would much rather resources go towards, you know, community support and services and things like that, things that our taxes support and things run by the community rather than bringing in the National Guard.” Shanta Rigsby, 43, said crime had remained steady for the past five years in the Navy Yard neighborhood where she lives, with a noticeable rise after the pandemic. She said Mr. Trump should focus on addressing the root causes of crime before sending in the National Guard. “It’s unfortunate that the new administration has to take this reactionary approach,” Ms. Rigsby said, “instead of local government really focusing on bringing down crime and making residents feel safe.” Reporting was contributed by Devlin Barrett , Darren Sands , Sonia A. Rao , Campbell Robertson , Chris Cameron and Annie Karni .\n\nTrump’s deployment of the National Guard in L.A. remains contentious. The Trump administration deployed nearly 5,000 federal troops to Southern California in June. As President Trump announced on Monday that he was deploying National Guard troops to fight crime in the nation’s capital, lawyers with his Justice Department were preparing to defend his use of the Guard in Los Angeles. Starting in early June, the Trump administration sent nearly 5,000 federal troops to Southern California over the objections of Gov. Gavin Newsom, citing protests over immigration raids in the region. The deployment was fraught with problems and lawsuits from the start, and a three-day trial began Monday in San Francisco federal court for a suit by state officials to end the activation. Since July 1, the Pentagon has released most of the roughly 4,000 members of the California National Guard who were federalized, along with 700 Marines. A sprawling tent city that was erected in June to house thousands of soldiers at a military base south of Los Angeles in Los Alamitos is being dismantled. Only about 300 troops remain. Testifying in federal court on Monday, William Harrington, who until last week was the deputy chief of staff for the Army task force with tactical control over the Guard troops, said that those still on duty in Los Angeles were “supporting the request for assistance” from federal law enforcement agents. But officials at the California National Guard and the military’s Northern Command, which is overseeing the force, said earlier Monday that the remaining troops were mostly on standby or guarding federal buildings and not being used for immigration enforcement. The Los Angeles protests lasted several days in early June and were largely confined to a section of downtown. Democratic leaders in the state said the administration had provoked them by sending masked and armed federal agents into workplaces to detain immigrants who otherwise had no criminal records, then used the subsequent public outrage as a pretext to intervene militarily. Mayor Karen Bass of Los Angeles compared the mobilization to an “armed occupation.” Mr. Newsom called it political theater, and said the president was using service members as “props in the federal government’s propaganda machine.” Trump administration officials said the troops were necessary to protect federal agents in a jurisdiction where state sanctuary laws prohibited local authorities from conducting immigration enforcement. They said the protests had overwhelmed local law enforcement agencies. The state swiftly sued to end the mobilization, which a federal judge ruled to be illegal. But an appeals court blocked that ruling, allowing the deployment to continue. By mid-June, the protests had died down but the troops were accompanying federal agents conducting immigration enforcement. California officials say those assignments amount to an illegal use of federal troops to conduct domestic law enforcement. The Trump administration has contended the troops were merely escorting federal agents. In the interim, complaints have mounted from those who have been deployed. On the base near Los Angeles where the troops have been stationed, soldiers have complained that only a small fraction of them were even given assignments beyond the base. Those who were sent out typically were ordered to guard federal facilities or provide backup to immigration agents delivering warrants or conducting arrests. In July, for example, one National Guard contingent sat in trucks while immigration agents conducted a show of force in MacArthur Park in Los Angeles. Another contingent faced protesters in a field outside a cannabis farm during a raid in Ventura County. State authorities have complained that the activation has damaged the California National Guard’s ability to handle other critical duties, including drug interdiction and wildfire management. In interviews with The New York Times, several members of the California National Guard said the deployment had threatened retention and severely eroded the morale of the force. The mission, which federal authorities had initially indicated would end on Aug. 6, has been extended for at least another 90 days. And last week, Mr. Trump said he would chair a task force designed to increase the federal government’s role in the 2028 Olympic Games in Los Angeles, telling reporters that he would use the National Guard there again, if necessary, “to keep the Olympics safe.”\n\nProtesters gathered near the White House as Trump unveiled his plans. Protesters organized by the group Free D.C. gathered near the White House on Monday as President Trump announced plans to take over Washington’s police department. About 150 people gathered a block north of the White House on Monday as President Trump laid out his plans to federalize the police force in Washington, D.C., protesting what they said was the president’s latest attempt to assert control over the city. Mr. Trump is “trying to annex D.C. from the White House,” said Lisa Walker, a Maryland resident who said she taught in the Washington public schools for 15 years. She carried a homemade sign reading: “Free D.C. No Police State.” “They’re usurping the concept of home rule,” said Ken Greene, a longtime Washington resident, referring to the 1973 law that allowed the federal district to elect its own local government, though Congress maintained final say over its laws and budget. Mr. Trump cited a portion of that law on Monday that allows the federal government to temporarily take control of the city’s police department. As the protesters rallied, Mr. Trump was framing his plans to beef up and militarize the district’s police force as a test for his vision for getting tough on crime, musing that if it worked in the nation’s capital, he could roll out similar efforts in other cities. But to the protesters, Mr. Trump’s plans were just the latest blow to a city that has been among the hardest hit by his executive orders and policies. Mr. Trump’s efforts to downsize the federal government, step up immigration raids in urban areas, and reduce funding for food stamps have had a negative effect on city residents, organizers of the protest argued. “It’s all connected,” said Samuel Epps, the president of the Metropolitan Washington Council, AFL-CIO, whose office the protesters gathered outside. “This is just another way to create that chaos in our communities.” Alex Dodds, one of the co-founders of Free D.C., an advocacy group formed just after the start of Mr. Trump’s second term, said Mr. Trump was following an authoritarian playbook by trying to assert control over the capital city. “It’s an easy way for them to silence dissent and accelerate their agenda, if they physically control the capital,” said Ms. Dodds, whose group organized the protests. She added: “D.C. is our home. It belongs to the people who live here, and Trump can’t have it.” Mr. Trump has frequently railed against crime in Washington. He became fixated on the idea of a federal takeover of local law enforcement after Edward Coristine, a 19-year-old software engineer and a prominent early member of the Department of Government Efficiency, was the victim of an attempted carjacking earlier this month. Though the protest was relatively small, criticism of Mr. Trump in Washington is not rare. The city is staunchly Democratic, and its residents have frequently rallied against the president’s actions. Monday’s protest took place on the same stretch of street that in 2020 became the centerpiece of Black Lives Matter protests — and had those words painted into the pavement until a couple of months ago.\n\nD.C.’s advocate in the Senate says President Trump has contributed to crime by failing to add judges. President Trump declared a public safety emergency in Washington and invoked a section of the District of Columbia Home Rule Act. The crime rate in the nation’s capital has been falling in spite of President Trump’s actions in his second term, said Ankit Jain, a shadow senator for the District of Columbia, soon after the president announced a temporary takeover of policing in the city. “We have a historic judicial vacancy crisis in D.C.,” said Mr. Jain, who serves as one of the District’s elected advocates before the U.S. Senate. He noted that the city is down two judges out of nine on its high court, the D.C. Court of Appeals. “What happens when you don’t have enough judges? Trials get delayed, crime goes up,” he said. “Why has the president not made this a priority of nominating judges?” Mr. Jain said the vacancy crisis in the U.S. attorney’s office, which prosecutes all adult crimes, also posed a problem for the city. Mr. Trump recently installed an ally, the former Fox News host Jeannine Pirro, as the U.S. attorney for Washington after he was forced his pull his first choice for the job. “Pirro’s predecessor fired attorneys who prosecuted violent insurrectionists from Jan. 6,” Mr. Jain said, referring to another Trump appointee, Ed Martin. “Now we’re facing a vacancy crisis in her office, too.” Mr. Jain said Mr. Trump’s his efforts to exert federal authority over the nation’s capital did not appear to offer any long term solutions to crime. “And I’m incredibly concerned about what he is going to use the police force to do to the people of D.C.,” he added. The takeover of the city police department was expected to last 30 days. That means that what Mr. Trump announced on Monday was essentially a show of force that will expire on Sept. 10. Mr. Jain is one of two shadow senators from the District of Columbia who serve as its elected advocates before the body. The other is Paul Strauss. They hold no voting power but lobby the Senate in favor of D.C. statehood, to prevent congressional interference in its affairs, and pass laws that protect D.C.’s interests. Mr. Jain said there was only one real way for Washington to protect itself. “We need D.C. statehood to stop this problem,” he said.\n\nDistrict residents say they feel safe, but occasionally unnerved. Eric Lee for The New York Times Like several District of Columbia residents interviewed Monday morning, Sarah Struble, 37, who lives in the Capitol Hill neighborhood, said she feels relatively safe, though the high-profile incidents of violence like those mentioned by President Trump during his news conference can be unnerving. Crime is “not something that is impacting me personally in my life every day,” said Ms. Struble. She said she liked that law enforcement officers don’t walk streets with military-style firearms as they do in some countries, and she said she did not support the president’s moves to take over Washington’s police and deploy the National Guard. “I’m not a particularly pro-police, pro-law enforcement kind of person,” she said. “I would much rather resources go towards, you know, community support and services and things like that, things that our taxes support and things run by the community rather than bringing in the National Guard.” Shanta Rigsby, 43, said crime had remained steady for the past five years in the Navy Yard neighborhood where she lives, with a noticeable rise after the pandemic. She said Mr. Trump should focus on addressing the root causes of crime before sending in the National Guard. “It’s unfortunate that the new administration has to take this reactionary approach,” said Ms. Rigsby, “instead of local government really focusing on bringing down crime and making residents feel safe.” Jerry Stenquist, 42, a federal employee who works in Navy Yard, said that some crime is inevitable with big events like baseball games for the Washington Nationals at the stadium in the neighborhood. “It’s a nice area,” Mr. Stenquist said of the Navy Yard, “but I think anytime you have a broad range of the public that’s going to show up at the stadium, you’re going to have some crime.” Jeffrey Willis, 66, a retiree, said the idea of Washington losing its autonomy was “insulting to me as a voter. It’s patronizing, and I just think it’s frightening for the country.” Mr. Willis lives in the U Street corridor, home to the African American Civil War Memorial, where, he said, large crowds of rowdy young people sometimes gather well into the wee hours of the morning. “Nobody should be out wandering around in the morning,” he said. “That’s going to be nothing but trouble.”",
  "medium": "Article",
  "links": [
    "https://www.nytimes.com/2025/01/20/us/politics/trump-pardons-jan-6.html",
    "https://www.nytimes.com/by/katie-rogers",
    "https://mayor.dc.gov/release/2025-point-time-results-show-decrease-homelessness-highlighting-continued-success-key",
    "https://www.nytimes.com/2023/10/18/nyregion/subway-attack-nyc.html?searchResultPosition=1",
    "https://www.nytimes.com/by/shawn-hubler",
    "https://www.nytimes.com/2025/05/15/us/politics/trump-border-military.html",
    "https://www.nytimes.com/2021/04/22/us/politics/dc-statehood-vote.html",
    "https://www.nytimes.com/2024/02/29/nyregion/subway-slashing-mta-protest.html",
    "https://x.com/PressSec/status/1954940175252849053",
    "https://www.nytimes.com/by/campbell-robertson",
    "https://www.nytimes.com/2025/01/21/us/politics/jan-6-defendants-freed.html",
    "https://www.nytimes.com/by/eric-schmitt",
    "https://www.nytimes.com/2020/06/05/us/politics/muriel-bowser-trump.html",
    "https://www.whitehouse.gov/presidential-actions/2025/03/making-the-district-of-columbia-safe-and-beautiful/",
    "https://www.nytimes.com/2025/03/10/us/politics/black-lives-matter-mural-dc.html",
    "https://www.nytimes.com/2025/06/13/us/politics/trump-protests-immigration-floyd.html",
    "https://www.whitehouse.gov/presidential-actions/2025/08/declaring-a-crime-emergency-in-the-district-of-columbia/",
    "https://www.nytimes.com/2020/06/10/us/politics/national-guard-protests.html",
    "https://www.nytimes.com/by/darren-sands",
    "https://www.nytimes.com/2025/07/07/us/la-macarthur-park-immigration.html?smid=nytcore-ios-share&referringSource=articleShare",
    "https://www.nytimes.com/by/helene-cooper",
    "https://www.nytimes.com/by/christopher-maag",
    "https://www.justice.gov/usao-dc/pr/violent-crime-dc-hits-30-year-low#:~:text=WASHINGTON%20%2D%20Total%20violent%20crime%20for,Graves.",
    "https://www.nytimes.com/2025/08/08/us/trump-military-drug-cartels.html",
    "https://www.nytimes.com/by/anushka-patil",
    "https://storage.courtlistener.com/recap/gov.uscourts.cand.450934/gov.uscourts.cand.450934.140.2.pdf",
    "https://www.nytimes.com/2025/07/11/us/immigration-raids-farmworker-death.html",
    "https://www.nytimes.com/2025/08/05/us/politics/trump-doge-member-assaulted.html",
    "https://www.nytimes.com/2025/03/14/nyregion/subway-crime-nyc.html",
    "https://x.com/JDVance/status/1953528808008466920",
    "https://www.nytimes.com/by/annie-karni",
    "https://www.nytimes.com/2022/03/02/nyregion/asian-women-attacked-nypd.html",
    "https://www.nytimes.com/by/karoun-demirjian",
    "https://www.nytimes.com/2025/07/31/us/troop-withdrawal-los-angeles.html",
    "https://www.nytimes.com/2020/06/06/us/politics/protests-trump-helicopters-national-guard.html",
    "https://www.nytimes.com/by/lazaro-gamio",
    "https://www.nytimes.com/2022/10/17/nyregion/nyc-subway-track-death.html",
    "https://www.nytimes.com/2025/07/16/us/trump-national-guard-california.html",
    "https://www.facebook.com/heritagefoundation/posts/washington-dc-shouldnt-have-one-of-the-worst-homicide-rates-among-capitals-in-th/1191365336365513/",
    "https://www.nytimes.com/2020/06/26/us/politics/dc-statehood-house-vote.html",
    "https://x.com/EndWokeness/status/1952880656335208551",
    "https://www.nytimes.com/2025/06/12/us/politics/california-trump-lawsuit-protests.html",
    "https://www.nytimes.com/2025/06/19/us/california-national-guard-trump.html",
    "https://www.nytimes.com/2025/01/31/us/politics/prosecutors-us-attorneys-office-trump-firings.html",
    "https://www.nytimes.com/2025/08/03/us/politics/senate-confirmation-jeanine-pirro-us-attorney.html"
  ],
  "labels": [
    {
      "name": "Feed"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [],
  "topics": [
    {
      "name": "Social Issues"
    },
    {
      "name": "Homelessness"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.96240234375
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.89501953125
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Charity & Philanthropy",
      "score": 0.76025390625
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.640625
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Poverty & Hunger",
      "score": 0.486572265625
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Housing & Development",
      "score": 0.480224609375
    }
  ],
  "sentiment": {
    "positive": 0.03077186,
    "negative": 0.8284607,
    "neutral": 0.14076735
  },
  "summary": "President Donald Trump has promised to clear out Washington's homeless population, without providing any specific details on how it would be done or where homeless people would go. The announcement came during a news conference announcing that the Metropolitan Police Department will be placed under federal control for 30 days. The move comes amid concerns that the city is overwhelmed by criminals and homeless people, despite violent crime levels at a 30-year low and that homelessness will fall 9% from January 2024 to January 2025. Efforts to clear homeless encampments in Washington have long precedented and are currently overseen by the city government and the National Park Service, depending on whether the encampments are on city or federal land. Advocates for homeless people argue that evictions simply displace residents from their communities and exacerbate housing instability. It is unclear how this will change the enforcement role in the crackdown. New York Gov. Kathy Hochul of New York announced that she would deploy 750 National Guard troops in response to a crime wave that many have questioned.",
  "shortSummary": "President Trump promises to clear Washington’s homeless population, but lacks details, sparking debate from non-profit agencies about housing and homelessness.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "afe38b02114a46e58e9f40c3245a220a",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.nytimes.com/by/lazaro-gamio",
      "text": "Trump’s homicide-rate chart has been making the rounds on right-wing social media.\nThis was featured in live coverage.\nBy Lazaro Gamio\nMy job is to make complicated topics as digestible as possible. Sometimes, that means working with large datasets and showing readers the most important trends. Other times, it means tracking information in real time to help readers get a better sense of what is going on.\nBefore joining The Times in 2020, I was in charge of visuals at Axios, where I managed a team of illustrators and data visualization designers. Before that, I was a graphics editor at The Washington Post and The Miami Herald.\nAs a Times journalist, I am committed to upholding the standards of integrity outlined in our Ethical Journalism Handbook.\nEmail: lazaro.gamio@nytimes.com\nThis was featured in live coverage.\nBy Lazaro Gamio\nThis was featured in live coverage.\nBy Elena Shao, Leanne Abraham, Eli Murray and Lazaro Gamio\nSee which countries are being targeted by President Trump, as he seeks to remake the global trading system.\nBy Lazaro Gamio, Tony Romm and Agnes Chang\nSee detailed maps of the latest temperature forecasts across Europe.\nBy Lazaro Gamio, Zach Levitt and Erin McCann\nThe period after President Trump announced the cease-fire was muddied by time zone differences, unclear wording in statements and continuing strikes.\nBy Lazaro Gamio, Elena Shao and Daniel Wood\nQatari officials said its air defenses had intercepted the missiles that were fired at Al Udeid Air Base.\nBy Elena Shao, Lazaro Gamio and Daniel Wood\nThis was featured in live coverage.\nBy Lazaro Gamio\nA Times analysis shows the extent of the U.S. strikes’ impact on the three nuclear sites.\nBy Leanne Abraham, Ashley Cai, Agnes Chang, Lazaro Gamio, Josh Holder, Elena Shao and Amy Schoenfeld Walker\nThis was featured in live coverage.\nBy Lazaro Gamio and Elena Shao\nThousands of U.S. troops stationed in the Middle East are within striking distance of ballistic missiles Iran has stockpiled.\nBy Ashley Cai, Albert Sun and Lazaro Gamio"
    },
    {
      "url": "https://www.justice.gov/usao-dc/pr/violent-crime-dc-hits-30-year-low#:~:text=WASHINGTON%20%2D%20Total%20violent%20crime%20for,Graves.",
      "text": "Press Release\nViolent Crime in D.C. Hits 30 Year Low\nFor Immediate Release\nU.S. Attorney's Office, District of Columbia\nWASHINGTON - Total violent crime for 2024 in the District of Columbia is down 35% from 2023 and is the lowest it has been in over 30 years, according to data collected by the Metropolitan Police Department (MPD) and announced by United States Attorney Matthew M. Graves. A breakdown of the data is available here.\nIn addition to the overall violent crime reduction, homicides are down 32%; robberies are down 39%; armed carjackings are down 53%; assaults with a dangerous weapon are down 27% when compared with 2023 levels, with the District reporting the fewest assaults with dangerous weapons and burglaries in over 30 years.\n“The strategy this Office began to employ shortly after I came into this role has been to work with our law enforcement partners to focus on the drivers of violence - those gangs or crews of people who are dealing drugs, protecting turf, committing carjackings and other robberies, all while armed,” said U.S. Attorney Graves. “It takes time to develop these investigations and prosecutions, but this is the fruit of that labor - a reduction in the violent crime - that D.C. is now seeing.”\nA central component of this strategy has been targeting those crews who have preyed upon certain neighborhoods in our community, often operating drug trafficking networks in these neighborhoods. These proactive investigations and prosecutions have yielded immediate reductions in violence that have had lasting impact. For instance, an MPD analysis of crime trends in the area around MLK Mellon before and after a crew operating a drug market in that area was arrested revealed that there was a 66% reduction in violent crime in the area when comparing the six months prior to the arrests to the six months after the arrests. Even two years after these arrests, there was a 56% reduction in the number of homicides that occurred after the arrests when compared to the two years before.\nAnother key component of this proactive approach was implementing in April 2022, Project Safe Neighborhood - a daily review by the Office and our law enforcement partners of every firearms arrest in the District to determine, using objective criteria about the person arrested and the firearm recovered, whether the case should be charged in U.S. District Court or D.C. Superior Court. Since April 2022, the Office has accepted for prosecution in U.S. District Court more than 150 gun offenders under this initiative.\nFinally, the Office has continued to do all that it can to hold accountable those who commit violent crimes with firearms and those who illegally possess firearms. And the Office has committed to provide on a quarterly basis data related to these efforts - data that can be found here. This data reflects that in the first half of 2024, the Office was able to charge at the time of arrest more than 90% of arrests for violent crimes committed with guns and nearly 70% of gun possession arrests. The Office continues to investigate many of these arrests even if it does not charge on the day of arrest. Also in the first half of 2024, the Office obtained convictions in approximately 75% of these gun-related cases.\nThese numbers related to firearms offenses are critical and stand in stark contrast to the overall day-of-arrest charging rate for every arrest in the District of Columbia, which is a significantly less informative metric. The vast majority of arrests in the District of Columbia are for misdemeanor offenses that are often non-violent in nature. For such offenses, the Office has had a longstanding practice of giving great weight to victims’ wishes about whether they want charges brought. For a variety of reasons, a substantial number of victims do not want criminal charges brought for these relatively minor offenses.\nIn Fiscal Year 2019, the Office expanded into a new section the number of prosecutors devoted to reviewing arrests and examining body-worn camera (BWC) footage - Fiscal Year 2018 was the first Fiscal Year where BWC had been fully deployed for the entire year - to determine whether the BWC footage reflected issues that would later require the Office to dismiss a prosecution or if there were otherwise fatal flaws with the case. This section is called the Early Case Assessment Section (ECAS). The combination of BWC footage and ECAS’s early detection of arrests that, if charged, would later need to be dismissed led to relatively modest decreases in cases charged at the time of arrest in Fiscal Years 2018 and 2019.\nThe overall day-of-arrest charging rate dropped dramatically in Fiscal Years 2020, 2021, and 2022, as the global pandemic brought the criminal justice system to a halt and the D.C. Department of Forensic Sciences lost its accreditation in 2021.\nOur Office, along with our local partners, worked to overcome these challenges and the overall day-of-arrest charging rate in Fiscal Year 2024 of 57% is virtually identical to the 54% day-of-arrest charging rate that the Office reported in Fiscal Year 2019 after forming ECAS. More significantly, though, the Office dismissed far fewer of the cases it charged in Fiscal Year 2024 than it did in Fiscal Year 2018, so more arrests resulted in a prosecutorial outcome in Fiscal Year 2024 than in Fiscal Year 2018. For felonies, in particular, the percentage of cases with a prosecutorial outcome rose from 66% in Fiscal Year 2018 to 85% in Fiscal Year 2024.\nThere is value in addressing the issues, such as the lack of drug testing, that were preventing our Office from charging, at the time-of-arrest, non-violent misdemeanor offenses. While charging more non-violent offenses can benefit the community and offenders are often sentenced to periods of probation with services that hopefully aid in rehabilitation, these cases typically do not identify and remove violent offenders from the community. As is universally recognized, targeting the relatively limited number of individuals responsible for driving gun violence is the most impactful thing that prosecutors can do to contribute to the kinds of sharp declines in violent crime the District saw in 2024. To that end, multiple proactive investigations are already underway that should further reduce violent crime in 2025.\n##\nFollow us on Twitter, Instagram, and YouTube\nOr at https://www.justice.gov/usao-dc\nContact\nUpdated January 3, 2025\nTopic\nViolent Crime\nComponent"
    },
    {
      "url": "https://www.whitehouse.gov/presidential-actions/2025/08/declaring-a-crime-emergency-in-the-district-of-columbia/",
      "text": "By the authority vested in me as President by the Constitution and the laws of the United States of America, including section 740 of the District of Columbia Self-Government and Governmental Reorganization Act (Public Law 93-198), as amended (section 740 of the Home Rule Act), and section 301 of title 3, United States Code, it is hereby ordered:\nSection 1. Crime is out of control in the District of Columbia. Washington, District of Columbia, is our Nation’s capital and home to the central institutions of American governance. Yet rising violence in the capital now urgently endangers public servants, citizens, and tourists, disrupts safe and secure transportation and the proper functioning of the Federal Government, and forces the diversion of critical public resources toward emergency response and security measures. The city government’s failure to maintain public order and safety has had a dire impact on the Federal Government’s ability to operate efficiently to address the Nation’s broader interests without fear of our workers being subjected to rampant violence.\nThe increase in violent crime in the heart of our Republic has consequences beyond the individual tragedies that have dominated media coverage. Such lawlessness also poses intolerable risks to the vital Federal functions that take place in the District of Columbia. Violence and crime hamper the recruitment and retention of essential Federal employees, undermine critical functions of Government and thus the well-being of the entire Nation, and erode confidence in the strength of the United States. These conditions are disgraceful anywhere, but particularly in the capital of our Nation and the seat of the Federal Government. Citizens, tourists, and Federal workers deserve peace and security, not fear and violence. The smooth functioning of executive departments and agencies, courts, diplomatic missions, and the Federal Government demands an effective law-enforcement mechanism capable of halting the precipitous rise in violent crime, not one that permits Government workers to be violently attacked by mobs or fatally shot close to the Federal buildings where they work.\nThe magnitude of the violent crime crisis places the District of Columbia among the most violent jurisdictions in the United States. In 2024, the District of Columbia averaged one of the highest robbery and murder rates of large cities nationwide. Indeed, the District of Columbia now has a higher violent crime, murder, and robbery rate than all 50 States, recording a homicide rate in 2024 of 27.54 per 100,000 residents. It also experienced the Nation’s highest vehicle theft rate with 842.4 thefts per 100,000 residents — over three times the national average of 250.2 thefts per 100,000 residents. The District of Columbia is, by some measures, among the top 20 percent of the most dangerous cities in the world.\nAs President, I have a solemn duty to take care that our laws are faithfully executed, and a sacred responsibility to protect the safety and security of United States citizens who live in and visit our Nation’s capital, including Federal workers who live or commute into the District of Columbia. These conditions cannot persist. We will make the District of Columbia one of the safest cities in the world, not the most dangerous.\nSec. 2. Services of the Metropolitan Police Department of the District of Columbia. I determine that special conditions of an emergency nature exist that require the use of the Metropolitan Police Department of the District of Columbia (Metropolitan Police force) for Federal purposes, including maintaining law and order in the Nation’s seat of Government; protecting Federal buildings, national monuments, and other Federal property; and ensuring conditions necessary for the orderly functioning of the Federal Government. Effective immediately, the Mayor of the District of Columbia (Mayor) shall provide the services of the Metropolitan Police force for Federal purposes for the maximum period permitted under section 740 of the Home Rule Act.\nSec. 3. Operational Control of the Metropolitan Police Department of the District of Columbia. (a) The authority of the President conferred by section 740(a) of the Home Rule Act to direct the Mayor with respect to the current special conditions of an emergency nature is delegated to the Attorney General.\n(b) In accordance with section 740(a) of the Home Rule Act, the Mayor shall provide such services of the Metropolitan Police force as the Attorney General may deem necessary and appropriate.\nSec. 4. Monitoring and Recommendations. (a) The Attorney General shall monitor and regularly consult with any senior official the Attorney General deems appropriate on the special conditions of an emergency nature that exist in the District of Columbia that require the use of the Metropolitan Police force for Federal purposes.\n(b) The Attorney General shall regularly update me on the status of the special conditions of an emergency nature that exist in the District of Columbia that require the use of the Metropolitan Police force for Federal purposes.\n(c) The Attorney General shall inform me of any circumstances that, in the Attorney General’s opinion, might indicate the need for further action by the President or that the action in this order is no longer necessary.\nSec. 5. Severability. If any provision of this order, or the application of any provision to any individual or circumstance, is held to be invalid, the remainder of this order and the application of its other provisions to any other individuals or circumstances shall not be affected thereby.\nSec. 6. General Provisions. (a) Nothing in this order shall be construed to impair or otherwise affect:\n(i) the authority granted by law to an executive department or agency, or the head thereof; or\n(ii) the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.\n(b) This order shall be implemented consistent with applicable law and subject to the availability of appropriations.\n(c) This order is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.\n(d) The costs for publication of this order shall be borne by the Department of Justice.\nDONALD J. TRUMP\nTHE WHITE HOUSE,\nAugust 11, 2025."
    },
    {
      "url": "https://www.nytimes.com/by/annie-karni",
      "text": "Does President Trump Want to Be Mayor, Too?\nPresident Trump has long railed about crime in blue cities. Now he’s effectively put himself in charge of policing one of them.\nBy Jess Bidgood\nI write features and profiles, with a recent focus on House Republican leadership. I also cover social issues in Congress.\nI have covered local politics in New York City for both of the city’s tabloid newspapers, The New York Post and The New York Daily News. I covered Hillary Clinton’s presidential campaign for Politico. At The Times, I covered the White House during the Trump administration and the beginning of the Biden administration, before moving over to cover Capitol Hill.\nI graduated from Haverford College, and I grew up in Baltimore.\nAs a Times journalist, I share the values and adhere to the standards of integrity outlined in The Times’s Ethical Journalism handbook. I don’t donate to political campaigns or attend political events or rallies in any capacity other than as a reporter covering the event. I make every effort to understand the issues and the people I cover from multiple angles.\nEmail: annie.karni@nytimes.com\nX: @AnnieKarni\nThreads: @AnnieKarni\nAnonymous tips: nytimes.com/tips\nPresident Trump has long railed about crime in blue cities. Now he’s effectively put himself in charge of policing one of them.\nBy Jess Bidgood\nThe president has railed against crime in urban, largely liberal cities for decades, but Monday’s announcement was an extraordinary exertion of federal power over an American city.\nBy Katie Rogers\nAnkit Jain, the shadow Senator for the District of Columbia, said President Trump should focus on adding judges, not policing.\nBy Annie Karni\nPlus, inside the weight-loss drug wars.\nBy Tracy Mumford, Will Jarvis, Ian Stewart, Jessica Metzger and Annie Karni\nWe explore the new political danger of a centuries-old format.\nBy Annie Karni\nThe booing started in seconds at Representative Mike Flood’s town hall in Lincoln, Neb. Annie Karni, a congressional correspondent for The New York Times, reports from the auditorium after the Republican congressman’s town hall, which she said was one of the most raucous political events she’s ever witnessed.\nBy Annie Karni, John Pappas, Gabriel Blanco, Nikolay Nikolov and Claire Hogan\nMost Republican lawmakers are avoiding town hall meetings, reluctant to confront energized Democrats and answer tough questions. When Representative Mike Flood of Nebraska gave it a try, the booing started in seconds.\nBy Annie Karni\nThe Charleston-area congresswoman was once a moderate Republican, but has more recently presented herself as a loyal supporter of President Trump.\nBy Eduardo Medina and Annie Karni\nThe Democrat from Nevada said she refused to be lectured about how to challenge President Trump, and she argues that her party needs to do more to gain voters’ trust.\nBy Annie Karni\nThe bill passed the committee with the support of every Democrat and only one Republican, its sponsor, who modified it to shield President Trump from a divestment requirement.\nBy Annie Karni"
    },
    {
      "url": "https://www.nytimes.com/by/anushka-patil",
      "text": "Trump says he will clear out Washington’s homeless population but offers few details.\nThis was featured in live coverage.\nBy Anushka Patil\nI cover breaking international stories and stay with them as they develop. I spent more than a year doing daily reporting on the war in Ukraine, covering a broad range of news, including families fleeing Russia’s invasion, missile strikes, the diplomatic fallout, press freedom in both countries and the changing nature of cyberwarfare.\nSince late 2023, my work has focused on the war in Gaza. I’ve reported on Israel’s destruction of Gaza’s hospitals, the impact on Palestinian mothers, the practice of administrative detention, attacks on aid workers and more.\nOccasionally, I also report on fast-moving story lines in the United States, including mass shootings, natural disasters and political news.\nBefore joining The Times, I worked at BuzzFeed News and studied journalism for a few years at Northwestern University. I am training to take on a larger role in the Times Guild, our newsroom union.\nAll Times journalists are committed to upholding the standards of integrity outlined in our Ethical Journalism Handbook.\nFor WhatsApp or Signal, please email, DM or write to me via the NYT Tips Line.\nEmail: anushka.patil@nytimes.com\nAnonymous tips: nytimes.com/tips\nThis was featured in live coverage.\nBy Anushka Patil\nA police officer. A security guard. An executive. An associate. They were remembered for their “light,” for their passion and commitment.\nBy Sarah Maslin Nir\nThis was featured in live coverage.\nBy Anushka Patil\nLeaders from Georgetown, the City University of New York and the University of California, Berkeley, said they are working to protect Jewish students but also free speech on their campuses.\nBy Vimal Patel, Sharon Otterman and Michael Gold\nThis was featured in live coverage.\nBy Anushka Patil\nKerr County had discussed buying such things as water gauges and sirens after previous flood disasters. But as with many rural Texas counties, cost was an issue.\nBy Jesus Jiménez, Margarita Birnbaum, Danny Hakim and Mike Baker\nThis was featured in live coverage.\nBy Anushka Patil\nThe Pentagon said there were no reports of casualties after the strike on Al Udeid Air Base in Qatar, and President Trump said it was time for peace.\nBy Farnaz Fassihi, Adam Rasgon, Eric Schmitt and Michael Levenson\nAs fighting between Iran and Israel continued for a sixth day, the U.S. Embassy in Jerusalem made its first announcement for Americans trying to leave Israel.\nBy Anushka Patil\nBetween 100,000 and 150,000 Israelis have been stuck abroad as the country’s airspace remains closed and the fighting with Iran drags on.\nBy Jenny Gross and Johnatan Reiss"
    },
    {
      "url": "https://www.nytimes.com/by/eric-schmitt",
      "text": "Trump Pulls Military Into Another Political Issue\nThe National Guard troops who will move into Washington, D.C., will not perform law enforcement tasks but may be able to detain people temporarily, officials said.\nBy Eric Schmitt and Helene Cooper\nI write about U.S. national security, with a particular focus on U.S. military affairs and counterterrorism issues overseas. I have written extensively on security matters in the Middle East, South Asia, Africa and Europe.\nI have been a reporter at The New York Times for 40 years — starting as a news assistant and working my way up to cover the U.S. military, counterterrorism and other national security issues for more than three decades. I have covered every conflict involving the U.S. military since the 1991 Persian Gulf war, and reported extensively from Iraq, Afghanistan, Africa and the Middle East. I have shared four Pulitzer Prizes. I got my start reporting on local education at the Tri-City Herald in Kennewick, Wash.\nI am the co-author of “Counterstrike: The Untold Story of America’s Secret Campaign Against Al Qaeda.” I earned a bachelor’s degree in political science from Williams College, studied in Madrid for a year and was a journalism fellow at Stanford University. I was born in Minneapolis and reared in the San Francisco Bay Area.\nKeeping my sources protected is a top priority for me, especially during sensitive or high-risk stories. I strive to be accurate and fair in my coverage, no matter what the subject. And, like all Times journalists, I follow the standards in our Ethical Journalism Handbook.\nI don’t back away from difficult stories, and will give subjects a chance to comment and express their side of a story.\nI do not participate in politics, nor do I make political donations. I am always careful to identify myself as a reporter for The Times in news-related conversations.\nEmail: erschm@nytimes.com\nFacebook: Eric Schmitt\nWhatsApp: email NYT tips,or DM to get my number\nSignal: email NYT tips or DM to get my number\nLinkedIn: Eric Schmitt\nAnonymous tips: nytimes.com/tips\nThe National Guard troops who will move into Washington, D.C., will not perform law enforcement tasks but may be able to detain people temporarily, officials said.\nBy Eric Schmitt and Helene Cooper\nThe deployment is part of President Trump’s crackdown on street crime in the city.\nBy Eric Schmitt\nThe president has ordered the Pentagon to use the armed forces to carry out what in the past was considered law enforcement.\nBy Helene Cooper, Maggie Haberman, Charlie Savage and Eric Schmitt\nThe suspect’s father said he was seeking a transfer from the Army base in Georgia, where he had complained of racism.\nBy Eduardo Medina, Christine Hauser and Alessandro Marazzi Sassoon\nIn a social media post, the president described the move as a deterrent prompted by threats by a former Russian leader. It is unclear if any submarines did actually change position.\nBy David E. Sanger\nJoe Kent, a former Army Green Beret, had attracted scrutiny over his associations with extremist groups and his promotion of conspiracy theories.\nBy Eric Schmitt\nAn Immigration and Customs Enforcement memo said that National Guard troops would assist in the deportation process for migrants in their custody.\nBy Chris Cameron, Hamed Aleaziz and Eric Schmitt\nTo hide the cost of renovating the plane Qatar donated to President Trump, the Air Force appears to have tucked it inside an over-budget, behind-schedule nuclear modernization program.\nBy David E. Sanger and Eric Schmitt\nSuspicions about leaks and a mistrust of senior military officers have defined much of the defense secretary’s first six months on the job.\nBy Greg Jaffe, Eric Schmitt and Helene Cooper\nThe military gave few details on the ground operation, but counterterrorism raids have typically involved helicopter-borne Special Operations commandos.\nBy Eric Schmitt"
    },
    {
      "url": "https://www.nytimes.com/by/christopher-maag",
      "text": "My job title, “enterprise reporter,” sounds nebulous, because what defines an enterprise story can be a little fuzzy. A good enterprise story shares some elements with investigative journalism, because both require deep reporting to dig up something new. But while investigative stories uncover information that someone in power hopes to hide, a good enterprise piece describes a phenomenon in our economy, politics or culture, ideally something no one has identified before. The writing should be beautiful. And since I write for the Times’s Metro desk, the focus is on New York City and the surrounding area. In the midst of what’s viewed widely as an immigration crisis, I interviewed researchers about the consensus among academics that immigrants bring net economic benefits to their destination cities and countries. I explored whether a novel intervention by New Jersey’s attorney general can fix a police department that for decades has faced allegations of racist violence.\nMy Background\nI’ve written for daily newspapers including The Seattle Times, national magazines like Fortune and Time, city magazines in Columbus and Philadelphia, wire services, weekly newspapers, alternative weeklies like Cleveland Scene, newsletters, and web startups including Credit.com. Before I joined The Times, I spent 10 years as a freelancer for the paper, mostly covering breaking news and feature stories across the Midwest. I also wrote for The Record newspaper in New Jersey, where I won the Banff Centre of Arts and Creativity Fellowship in Literary Journalism for my story on New York Harbor, and the Eugene C. Pulliam Fellowship for Editorial Writing to investigate why diagnostic testing in the United States will likely fail during the next pandemic.\nI studied history at Grinnell College in Iowa, and journalism at Columbia University. I grew up in Columbus, Ohio.\nIt’s Maag as in Saab.\nJournalistic Ethics\nLike all Times journalists, I’m committed to upholding the standards of integrity outlined in our Ethical Journalism Handbook. Practicing ethics in journalism has a lot in common with living an ethical life. Treat everyone I meet with empathy and respect. Start with a hypothesis, loosely held. When reporting blows my hypothesis to smithereens, I’m doing it right. Be skeptical, never cynical. If telling me the truth about something important might cause a person to be fired or physically threatened, it’s my responsibility to protect their identity, while proving to readers that the anonymous source really exists, and that I really spoke to them. If I get something wrong, fix it.\nPresident Trump is deploying the National Guard to the streets of an American city for the second time this year, but the Guard has been used by other leaders, too.\nAn investigation into the shooting deaths of two people and the apparent suicide of a suspect, a state trooper, “raised serious concerns” from the county prosecutor’s office.\nDid the shocking disappearance of a 6-year-old in 1979 forever alter how Americans raised children? Or were there other reasons for parents to be anxious?\nThe vehicle, a stolen rental car, had been traveling west on the Manhattan Bridge before it struck the victims at the base of the bridge in Chinatown early Saturday morning.\nBarely a week after devastating floods destroyed Camp Mystic and killed at least 134, Camp CAMP, which serves disabled youth, reopened Monday, thanks to a herculean cleanup led by a volunteer army.\nBy Christopher Maag and Carter Johnston For The New York Times\nFlood warnings were in effect in several areas, including ones that were devastated by the July 4 floods. By the afternoon, the rain had eased up in some parts, and some rescuers resumed their work.\nBy McKenna Oxenden, Sonia A. Rao and Nazaneen Ghaffar"
    },
    {
      "url": "https://mayor.dc.gov/release/2025-point-time-results-show-decrease-homelessness-highlighting-continued-success-key",
      "text": "(Washington, DC) – Today, Mayor Muriel Bowser and the District’s Department of Human Services (DHS) shared the results of the 2025 Point-In-Time (PIT) Count, the annual census of individuals experiencing homelessness. This year’s count took place on Wednesday, January 29, 2025, and showed an overall 9% decrease from 2024, including an 18.1% decrease among families and an 4.5% decrease among unaccompanied individuals. This year’s total count is 19% percent lower than the count in 2020, the last PIT recorded before the COVID-19 public health emergency.\n“I am incredibly grateful for the teams that are working every day to ensure we are able to not only provide shelter to neighbors who need it, but also help them move into – and thrive – in permanent housing,” said Mayor Bowser. “For more than a decade, we have been transforming our systems so that they are more effective and so that they meet the needs of people in our city. This is challenging but important work. We know that when we have the right investments, the right policies, and the right people in place, we can drive down homelessness and get our neighbors into safe and stable housing.”\nThe count also showed a decrease in homelessness among Transition Age Youth, which represents young adults ages 18 to 24. There was a 10.5% decrease among individual transition age youth and a 35.8% decrease among transition age youth-headed families.\n“These results show a positive change in course following increases in homelessness over the past two years,” said DHS Interim Director A.D. Rachel Pierre. “While there is more work to be done, this year’s PIT count is a clear indicator that the District’s investments – especially over the last year – are moving the needle in the right direction. We are committed to staying the course and continuing to focus on solutions that emphasize homelessness prevention and diversion, supportive case management, and bridging the gap from temporary shelter to permanent housing.”\nSince last year’s PIT count, the District has worked hard to deepen investment and focus on programs that work while launching new, innovative initiatives that continue to meet the needs of neighbors experiencing homelessness. These efforts have been key drivers of this year’s positive trend, and they include:\n- Project Reconnect: The District deploys staff to shelters, day centers, and with outreach teams to assist individuals newly experiencing homelessness or who are currently facing housing crises by providing housing counseling and flexible funding to either divert individuals from the homeless services system or facilitate a rapid exit to stable housing. In FY 2024, Project Reconnect successfully diverted nearly 400 individuals from entering homelessness.\n- Front Door Navigation Tool: DHS launched a new data-powered tool in coordination with the Homeless Services Hotline to increase opportunities for connection to diversion assistance and resources in a timelier fashion. Since its launch, Front Door Navigation has connected more than 150 referrals to Project Reconnect.\n- Transforming Our Shelter System: The District continued its work to improve and expand its shelter system, including the opening of The Aston non-congregate bridge housing program to provide 100 new shelter beds for unsheltered, adult-only families (without minors) and those who cannot be served effectively in low barrier shelters. The District will open a second non-congregate bridge housing program in 2025.\n- Targeting Youth Homelessness: The District has been a national leader in building a comprehensive system to address and prevent youth homelessness. Through programs focused on homelessness prevention, intervention, and transitional and permanent housing, the District provided vital, targeted services to hundreds of Transition Age Youth (ages 18 to 24) over the last year – including the addition of daily transportation services through the District’s shelter hotline and increasing the geographic footprint of youth-focused street outreach services.\n- Permanent Housing: The District supported more than 900 individuals and families to lease up with permanent housing vouchers in FY 2024 and leveraged Medicaid funding to provide supportive services to nearly 9,000 households. So far, in FY 2025, over 550 individuals and families have leased up with permanent housing vouchers.\n- Peer Case Management Institute (Winner of the Cafritz Team Award): DHS graduated its first cohort from the Peer Case Management Institute, a partnership with Howard University that trains District residents with lived experience of homelessness to become qualified case managers in the Homeless Services System. More than half of the first cohort has been employed as case managers in the Homeless Services System; the second cohort is set to graduate in June 2025.\nThe District’s results were among the strongest in the region. Four of the eight continuums of care that participate in the Metropolitan Washington Council of Governments (COG) saw an increase in their numbers this year, with four others (including the District) seeing varying degrees of decrease. While this points to the positive impact of the District’s targeted investments in strategic and innovative services, it also underscores the growing need of residents in the local region and the importance of regional collaboration.\nThe Community Partnership for the Prevention of Homelessness (TCP) conducted the PIT count on behalf of the District. The count is a requirement for all jurisdictions receiving federal homeless assistance funding. This single-day enumeration of the homeless services continuum of care provides an opportunity to identify gaps in the current portfolio of services and informs future program planning.\nData from the District will be included in a regional analysis and annual report on homelessness by the Metropolitan Washington Council of Governments (COG) Homeless Services Planning and Coordinating Committee, presented to the COG Board of Directors on May 14. Concerned by the lack of regional data available, COG undertook the first effort to produce a Point-in-Time count of homeless adults and children in metropolitan Washington in 2001. More information will be available at mwcog.org/homelessnessreport.\nMayor Bowser X: @MayorBowser\nMayor Bowser Instagram: @Mayor_Bowser\nMayor Bowser Facebook: facebook.com/MayorMurielBowser\nMayor Bowser YouTube: https://www.bit.ly/eomvideos"
    },
    {
      "url": "https://www.whitehouse.gov/presidential-actions/2025/03/making-the-district-of-columbia-safe-and-beautiful/",
      "text": "By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:\nSection 1. Purpose. As the Federal capital city, Washington, D.C., is the only city that belongs to all Americans and that all Americans can claim as theirs. As the capital city of the greatest Nation in the history of the world, it should showcase beautiful, clean, and safe public spaces.\nAmerica’s capital must be a place in which residents, commuters, and tourists feel safe at all hours, including on public transit. Its highways, boulevards, and parks should be clean, well-kept, and pleasant. Its monuments, museums, and buildings should reflect and inspire awe and appreciation for our Nation’s strength, greatness, and heritage. Our citizens deserve nothing less.\nSec. 2. Policy. It is the policy of the United States to make the District of Columbia safe, beautiful, and prosperous by preventing crime, punishing criminals, preserving order, protecting our revered American monuments, and promoting beautification and the preservation of our history and heritage.\nSec. 3. Making the District of Columbia Safe by Fighting Crime. (a) My Administration shall work closely with local officials to share information, develop joint priorities, and maximize resources to make the District of Columbia safe. Such coordination shall occur through the D.C. Safe and Beautiful Task Force (Task Force), which is hereby established by this order. The Task Force shall be chaired by the Assistant to the President and Homeland Security Advisor or his designee, and shall otherwise include representatives from the following departments, agencies, or components, selected as such department, agency, or component determines:\n(i) the Department of the Interior;\n(ii) the Department of Transportation;\n(iii) the Department of Homeland Security;\n(iv) the Federal Bureau of Investigation;\n(v) the United States Marshals Service;\n(vi) the Bureau of Alcohol, Tobacco, Firearms and Explosives;\n(vii) the United States Attorney’s Office for the District of Columbia;\n(viii) the United States Attorney’s Office for the District of Maryland; and\n(ix) the United States Attorney’s Office for the Eastern District of Virginia.\nThe Chairman of the Task Force may also select other departments, agencies, or components to participate as he deems necessary. Representatives of such other departments, agencies, or components shall be selected as such department, agency, or component determines.\n(b) The Task Force may, to the extent permitted by law, request operational assistance from and coordinate with the Metropolitan Police Department of the District of Columbia (MPD), Washington Metropolitan Area Transit Authority, United States Park Police, Amtrak Police, and other Federal and local officials as appropriate.\n(c) The Task Force shall coordinate to ensure effective Federal participation in the following tasks:\n(i) directing maximum enforcement of Federal immigration law and redirecting available Federal, State, or local law enforcement resources to apprehend and deport illegal aliens in the Washington, D.C. metropolitan area;\n(ii) monitoring the District of Columbia’s sanctuary-city status and compliance with the enforcement of Federal immigration law;\n(iii) providing assistance to facilitate the prompt and complete accreditation of the District of Columbia’s forensic crime laboratory;\n(iv) in collaboration with its leadership and union, providing MPD with assistance to facilitate the recruitment, retention, and capabilities of its police officers and to facilitate work with Federal personnel, resources, and expertise to reduce crime;\n(v) collaborating with appropriate local government entities to provide assistance to increase the speed and lower the cost of processing concealed carry license requests in the District of Columbia;\n(vi) reviewing and, as appropriate, revising Federal prosecutorial policies on seeking pretrial detention of criminal defendants to ensure that individuals who pose a genuine threat to public safety are detained to the maximum extent permitted by law;\n(vii) collaborating with appropriate local government entities to provide assistance to end fare evasion and other crime within the Washington Metropolitan Area Transit Authority system; and\n(viii) deploying a more robust Federal law enforcement presence and coordinating with local law enforcement to facilitate the deployment of a more robust local law enforcement presence as appropriate in areas in or about the District of Columbia, including in such areas as the National Mall and Memorial Parks, museums, monuments, Lafayette Park, Union Station, Rock Creek Park, Anacostia Park, the George Washington Memorial Parkway, the Suitland Parkway, and the Baltimore-Washington Parkway, and ensuring that all applicable quality of life, nuisance, and public-safety laws are strictly enforced, such as those prohibiting assault, battery, larceny, graffiti and other vandalism, unpermitted disturbances and demonstrations, noise, trespassing, public intoxication, drug possession, sale, and use, and traffic violations, including as prescribed by Executive Order 13933 of June 26, 2020 (Protecting American Monuments, Memorials, and Statues and Combating Recent Criminal Violence), which was reinstated by Executive Order 14189 of January 29, 2025 (Celebrating America’s 250th Birthday).\n(d) The Task Force shall report to me as necessary through the Assistant to the President and Homeland Security Advisor regarding safety in the District of Columbia, and the tasks set forth in subsection (c) of this section. As part of this reporting, the Attorney General, in consultation with the Task Force, shall assess whether public-safety circumstances in the District of Columbia require additional executive action.\nSec. 4. Making the District of Columbia Beautiful. (a) The Secretary of the Interior, in consultation with the Attorney General, the Secretary of Transportation, the United States Attorney for the District of Columbia, the Administrator of General Services, the National Capital Planning Commission, and the heads of such other executive departments or agencies and local officials as the Secretary of the Interior deems appropriate, shall develop and implement a program to beautify and make safe and prosperous the District of Columbia.\n(b) The program under subsection (a) of this section shall include, at a minimum, the following elements as appropriate and consistent with applicable law:\n(i) a coordinated beautification plan for Federal and local facilities, monuments, land, parks, and roadways in and around the District of Columbia;\n(ii) restoration of Federal public monuments, memorials, statues, markers, or similar properties that have been damaged or defaced, or inappropriately removed or changed, in recent years;\n(iii) removal of graffiti from commonly visited areas, with local assistance;\n(iv) proposals to ensure Federal buildings or lands adequately uplift and beautify public spaces and generate in the citizenry pride in and respect for our Nation;\n(v) a coordinated Federal and local approach to ensure the cleanliness of public spaces, sidewalks, parks, highways, roads, and transit systems in and around the District of Columbia; and\n(vi) the encouragement of private-sector participation in coordinated beautification and clean-up efforts in the District of Columbia.\nc) The Secretary of the Interior shall immediately issue a directive to the National Park Service requiring prompt removal and cleanup of all homeless or vagrant encampments and graffiti on Federal land within the District of Columbia subject to the National Park Service’s jurisdiction, to the maximum extent permitted by law.\nSec. 5. General Provisions. (a) Nothing in this order shall be construed to impair or otherwise affect:\n(i) the authority granted by law to an executive department or agency, or the head thereof; or\n(ii) the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.\n(b) This order shall be implemented consistent with applicable law and subject to the availability of appropriations.\n(c) This order is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.\nDONALD J. TRUMP\nTHE WHITE HOUSE,\nMarch 27, 2025."
    },
    {
      "url": "https://www.nytimes.com/by/karoun-demirjian",
      "text": "I am a breaking news reporter for the The New York Times.\nMy Background\nI joined The Times in 2023 after almost a decade at The Washington Post, where I covered the Pentagon and the national security beat on Capitol Hill. I started in The Post’s Moscow bureau, reporting on the former Soviet Union, and the 2014-15 Ukraine war.\nWhile at The Post, I was one of the lead reporters for the two impeachments of former President Donald Trump, eventually coauthoring a book about that period called “Unchecked: The Untold Story Behind Congress’s Botched Impeachments of Donald Trump,” published by W.M. Morrow in 2022. I was also a member of two teams that won Pulitzer Prizes: the 2018 prize in national reporting, and the 2022 public service medal.\nBefore The Post, I covered Washington, D.C., for the Las Vegas Sun, where I won or came in as runner-up for the David Lynch Regional Reporting Award for three years running. I covered Israel and the Palestinian territories for The Associated Press and the immigration and labor beat for Congressional Quarterly. Before that, I was a reporting fellow at the Chicago Tribune and a production assistant at NPR.\nI graduated with a bachelor’s degree in history from Harvard University and a master’s in law and diplomacy from the Fletcher School at Tufts University. In addition to English, I speak Russian, German and Armenian. Before committing full-time to journalism, I was a working classical musician.\nI grew up in the suburbs of Boston.\nJournalistic Ethics\nI have always made a point of trying to be accurate and fair, in both the reporting process and the final product of an article — which includes correcting mistakes when they happen. Sometimes the nature of what I cover can be quite sensitive, and I am very serious about protecting sources. I don’t accept gifts from the people and entities that I cover, and I do not make political donations or participate in political rallies. Like all Times journalists, I’m committed to upholding the standards of integrity outlined in our Ethical Journalism Handbook.\nContact Me"
    },
    {
      "url": "https://www.nytimes.com/by/helene-cooper",
      "text": "Trump Pulls Military Into Another Political Issue\nThe National Guard troops who will move into Washington, D.C., will not perform law enforcement tasks but may be able to detain people temporarily, officials said.\nBy Eric Schmitt and Helene Cooper\nI write about national security with a focus on the Pentagon and the U.S. military. These days the war in Ukraine has been a principal focus, but topics can range from faraway conflicts to U.F.O.s. It is, bar none, the best beat in Washington.\nI was born in Monrovia, Liberia, and moved to the United States in 1980. I decided I wanted to be a journalist when I read “All the President’s Men” in the 11th grade. I have a Bachelor of Arts in Journalism from the University of North Carolina at Chapel Hill, and have worked for three newspapers: The Providence Journal, The Wall Street Journal and The Times. I have won two George Polk awards and one Pulitzer Prize. I am the author of “The House at Sugar Beach: In Search of a Lost African Childhood,” a New York Times best seller, and “Madame President: The Extraordinary Journey of Ellen Johnson Sirleaf,” a Washington Post best seller, both published by Simon & Schuster.\nAs a Times journalist, I share the values and adhere to the standards of integrity outlined in The Times’s Ethical Journalism handbook. Reporters who write about national security often handle classified information, and we must work to decide what makes sense to report and what doesn’t. It’s a daily juggling act. For instance, I may not report on a coming raid by American special operations troops because publication of that information could harm said troops. There are times, however, when we must weigh the public’s right to know versus the government’s desire for secrecy.\nAnonymous tips: nytimes.com/tips\nThe National Guard troops who will move into Washington, D.C., will not perform law enforcement tasks but may be able to detain people temporarily, officials said.\nBy Eric Schmitt and Helene Cooper\nThe president has ordered the Pentagon to use the armed forces to carry out what in the past was considered law enforcement.\nBy Helene Cooper, Maggie Haberman, Charlie Savage and Eric Schmitt\nThe far-right activist is continuing to use her close association with President Trump to go after those she deems insufficiently loyal.\nBy Robert Draper, Julian E. Barnes and Christina Jewett\nThe military academy’s appointment of Jen Easterly, who had been director of the Cybersecurity and Infrastructure Agency, was canceled after complaints from the far-right agitator Laura Loomer.\nBy Helene Cooper\nSuspicions about leaks and a mistrust of senior military officers have defined much of the defense secretary’s first six months on the job.\nBy Greg Jaffe, Eric Schmitt and Helene Cooper\nFor years, Republican and Democratic administrations have sent officials to national security and foreign policy conferences around the world.\nBy Helene Cooper\nThe appraisal that Iran’s nuclear hopes had been set back 1 to 2 years by U.S. and Israeli bombings was the latest in a shifting series of pronouncements.\nBy Helene Cooper\nPresident Trump’s claimed Iran’s capabilities were “obliterated.” The full extent of the damage is still emerging.\nBy The New York Times\nNeither man gave new assessments of the state of Iran’s nuclear program or the damage to its sites.\nBy Eric Schmitt and Helene Cooper\nThe administration suggested an initial report of less-severe damage was already outdated as the president continued to defend his assertion that key facilities had been “obliterated,” though no intelligence official has yet directly echoed his view.\nBy Julian E. Barnes, Mark Mazzetti and Maggie Haberman"
    },
    {
      "url": "https://www.nytimes.com/by/katie-rogers",
      "text": "I’m a White House correspondent for The New York Times, covering the Trump administration.\nWhat I Cover\nI’m one of several reporters at The Times who cover the White House, a role I’ve had since 2018. I covered President Trump's first term and President Biden’s term.\nI am drawn to stories that give readers a better understanding of the inner lives of presidents and the people around them — how a key event, a shared history or a past failure can inform the decisions of the most powerful people in the world. That curiosity has driven my coverage across a range of stories, from foreign policy to the complicated dynamics of first families.\nMy Background\nI joined The Times in 2014 as a reporter covering breaking news. Before that, I worked at The Guardian, The Washington Post and at my hometown paper in Elkhart, Ind. I graduated from Loyola University Chicago and have a master’s degree from Northwestern.\nI am the author of “American Woman: The Transformation of the Modern First Lady, from Hillary Clinton to Jill Biden.”\nJournalistic Ethics\nMaintaining journalistic independence is important for every journalist at The Times, which has an extensive ethics policy.\nI want all of my work to be accurate and fair, and I make every effort to understand a story from multiple viewpoints. I protect my sources and work hard to build and keep their trust.\nI do not accept gifts, money or favors from anyone who might figure into my reporting. I do not participate in politics, nor do I make political donations. When I am working, I always identify myself as a reporter for The Times.\nContact Me"
    },
    {
      "url": "https://www.nytimes.com/by/shawn-hubler",
      "text": "Military officials testify at California’s suit against National Guard deployment.\nMilitary officials testified that\nBy Shawn Hubler and Laurel Rosenhall\nIn addition to covering the Los Angeles area, I also contribute to The Times’s coverage of statewide and national news. Recently, I helped lead our coverage of the Los Angeles fires, the national and human implications of California’s homelessness crisis and the pro-Palestinian protests that roiled Southern California. I also have written about California’s unofficial airline, Los Angeles’s bridge infatuation, Thundergraupel, Puckle guns and politically active bears.\nI occasionally cover political stories, and have written about California politicians including former Vice President Kamala Harris, Senators Adam Schiff and Alex Padilla, Governor Gavin Newsom and Los Angeles Mayor Karen Bass. I also have written about the legacy of Senator Dianne Feinstein and the second act of former Gov. Arnold Schwarzenegger.\nI have spent most of my adult life in California, working for news organizations from Orange County to Sacramento. For nearly two decades, I was a staff writer for The Los Angeles Times. There, I wrote about the 1992 Los Angeles riots from the Florence and Normandie intersection; the 2000 dot-com bust from San Francisco; and the internet’s impact on children from Orange County. I also shared three Pulitzer Prizes for coverage of the riots; the 1994 Northridge earthquake that devastated Southern California; and the violent, televised, 1997 shootout in North Hollywood between armored bank robbers and police that prompted the militarization of law enforcement nationally. I also have been a deputy editor at CalMatters, an award-winning, nonprofit news organization that specializes in California policy, and a member of the editorial board at The Sacramento Bee.\nI am a native of Central Pennsylvania and a graduate of Pennsylvania State University. I am married to Bob Magnuson, a former journalist and news executive and Southern California native. We have three wonderful grown daughters and an opinionated cat.\nLike all Times journalists, I am committed to upholding the standards of integrity outlined in our Ethical Journalism Handbook. I do not accept gifts from sources or participate in political causes. I protect my sources and identify myself as a reporter when I am on the job. I try to reflect California’s demographic and political diversity by elevating many kinds of voices. I strive to not only be accurate and fair in my reports, but also humane and understanding. I fact check before I publish and correct errors that I make.\nEmail: shawn.hubler@nytimes.com\nX: @ShawnHubler\nBluesky: @shawnhubler.bsky.social\nWhatsApp: Email or DM to get my number\nSignal: Email or DM to get my number\nAnonymous tips: nytimes.com/tips\nMilitary officials testified that\nBy Shawn Hubler and Laurel Rosenhall\nA three-day trial opened Monday in state officials’ challenge of the legality of the deployment, which followed protests over immigration raids.\nBy Shawn Hubler\nNew Hampshire is backing away from a promise to pay victims hundreds of millions of dollars. Other states are also rethinking payouts to those harmed under their care.\nBy Jenna Russell and Shawn Hubler\nDemocratic lawmakers maintained their walkout to thwart a Republican gerrymander, prompting Ken Paxton to ask the state’s Supreme Court to remove 13 of them from their seats.\nBy J. David Goodman and Shawn Hubler\nAn appellate panel upheld a finding that federal agents appeared to rely exclusively on race and other factors, such as speaking Spanish, in making arrests.\nBy Miriam Jordan and Tim Arango\nUntil she decided not to run, former Vice President Kamala Harris had loomed over the race as a likely favorite. Now, a host of hopefuls are jockeying for advantage.\nBy Laurel Rosenhall and Shawn Hubler\nThe move continues a scaling back of President Trump’s military deployment in Southern California that began on June 7.\nBy Shawn Hubler\nA Harris ally says “all options are on the table” but cautions against reading too much into the former vice president’s choice to skip the California governor race.\nBy Shane Goldmacher and Reid J. Epstein\nKamala Harris, the former vice president, announced that she has decided not to run for California’s top office.\nBy Laurel Rosenhall, Shawn Hubler and Reid J. Epstein\nThe worst predictions did not come to pass after a major earthquake off the coast of Russia sent a surge of water across the Pacific.\nBy Libby Leonard, Heather Knight, Francesca Regalado and Shawn Hubler"
    }
  ],
  "argos_summary": "President Trump announced a federal takeover of Washington, D.C.'s police force for 30 days, citing a crime emergency despite falling crime rates in the city. He also plans to clear the homeless population without providing details on how this will be accomplished or where the homeless will go. Local officials, including Mayor Muriel Bowser, criticized the move as unprecedented and unnecessary, arguing that it undermines the city's autonomy and that crime has been decreasing. Advocates for the homeless expressed concern that such actions merely displace individuals rather than address the root causes of homelessness.",
  "argos_id": "LDKXYB7HG"
}