{
  "url": "https://www.dailymail.co.uk/tvshowbiz/article-14991569/will-smith-film-robot-alan-tudyk.html?ns_mchannel=rss&ns_campaign=1490&ito=1490",
  "authorsByline": "Adam S. Levy",
  "articleId": "e61b405c88b24781bba440faae73a79e",
  "source": {
    "domain": "dailymail.co.uk",
    "paywall": false,
    "location": {
      "country": "gb",
      "city": "London",
      "coordinates": {
        "lat": 51.5073219,
        "lon": -0.1276474
      }
    }
  },
  "imageUrl": "https://i.dailymail.co.uk/1s/2025/08/12/01/101128691-0-image-a-36_1754959726821.jpg",
  "country": "gb",
  "language": "en",
  "pubDate": "2025-08-12T03:03:12+01:00",
  "addDate": "2025-08-12T02:08:11.947189+00:00",
  "refreshDate": "2025-08-12T02:08:11.947190+00:00",
  "score": 1.0,
  "title": "I, Robot star hints at drama on Will Smith film over audience reaction",
  "description": "Alan Tudyk, 54, portrayed the role of Sonny in the 2004 film iRobot, in which Smith, 56, starred as Del Spooner.",
  "content": "A former costar of actor Will Smith insinuated that the actor used his clout to minimize his presence in a film more than two decades back - impacting his career in the process.\n\nAlan Tudyk, 54, portrayed the role of Sonny in the 2004 film iRobot, in which Smith, 56, starred as Del Spooner.\n\nTudyk said that he was unceremoniously dumped from promotional materials when his character began testing higher than Smith's with trial audiences.\n\nTudyk, appearing on Toon'd In with Jimmy Cummings, explained the course of events that led to him being minimized in the promotional rollout of the motion picture.\n\n'They were doing test audiences with the movie,' Tudyk said on the June 15 edition of the podcast, which has begun to go viral.\n\nTudyk continued: 'They score the characters and I got word back, \"Alan, you're testing higher than Will Smith.\"'\n\n'And then I was gone - I was gone,' Tudyk said. 'There was no publicity and my name was not mentioned.'\n\nTudyk said he was 'so shocked' and concerned moviegoers weren't 'going to know' he played a key role in the motion picture.\n\nThis is not Smith’s first time publicly clashing with a costar: In 1993 he had a well-publicized feud with his Fresh Prince of Bel-Air castmate Janet Hubert, which ultimately resulted from her dismissal from the show.\n\nHubert did reunite with Smith and the cast during a 2020 reunion that aired on HBO Max.\n\nSmith in the special admitted that he 'wasn't sensitive' and 'wasn't perceptive' to struggles Hubert was dealing with, as she was pregnant at the time of their row.\n\n'Now that I've had three kids I've learned some things that I did not know at the time,' he said, 'and I would do things very differently - but I can see where I made the set very difficult for Janet.'\n\nThe Academy Award-winning King Richard star continues to try and rebuild his reputation more than three years after he slapped Chris Rock at the 2022 Oscars.\n\nSmith's infamous slap of Chris Rock came on March 27, 2022, after the comedian made a joke about Smith's wife, Jada Pinkett Smith.\n\nThe joke was about her shaved head, saying, 'Jada, I love you, G.I. Jane 2, can’t wait to see it!' in a reference to the 1997 movie which featured Demi Moore with a shaved head. (Pinkett Smith has diagnosed with alopecia, which causes hair loss.)\n\nSmith then walked onstage and smacked Rock, then returned to his seat and shouted at him twice, 'Keep my wife's name out of your f***ing mouth!' to a stunned audience.\n\nLater in the evening - in his acceptance speech after winning the Best Actor Oscar for his role as tennis patriarch Richard Williams in King Richard - Smith apologized to the Academy and other nominees, but made no reference to Rock.\n\nSmith subsequently apologized on multiple occasions over the incident, and resigned from the Academy of Motion Picture Arts and Sciences ahead of being issued a 10-year ban from the Oscars.\n\nIn an apology he issued in July of 2022 over the incident in an online clip, Smith said his spouse 'had nothing to do with' his attack on Rock.\n\n'I made a choice on my own from my own experiences, from my history with Chris,' he said. 'I want to say sorry to my kids and my family for the heat that I've brought on all of us.'\n\nHe added: 'I've reached out to Chris and the message that came back is that he's not ready to talk, and when he is he will reach out. So I will say to you, Chris, I apologize to you. My behavior was unacceptable, and I'm here whenever you're ready to talk.'",
  "medium": "Article",
  "links": [
    "https://www.dailymail.co.uk/tvshowbiz/will_smith/index.html",
    "https://www.dailymail.co.uk/news/article-11062209/Will-Smith-FINALLY-apologizes-Oscars-slap.html",
    "https://www.dailymail.co.uk/tvshowbiz/demi-moore/index.html",
    "https://www.dailymail.co.uk/tvshowbiz/article-8967087/Will-Smith-Janet-Hubert-emotionally-end-27-year-feud-Fresh-Prince-Bel-Air-reunion.html",
    "https://www.dailymail.co.uk/tvshowbiz/article-14859005/Will-Smith-takes-aim-Chris-Rock-savage-Oscar-slap-lyric-cringey-freestyle.html",
    "https://www.dailymail.co.uk/tvshowbiz/jada-pinkett-smith/index.html",
    "https://www.youtube.com/@jimcummingspod",
    "https://www.dailymail.co.uk/tvshowbiz/article-14522537/Will-Smith-social-media-criticism-fresh-prince.html",
    "https://www.dailymail.co.uk/tvshowbiz/article-14511509/will-Smith-uncancelling-slap.html",
    "https://www.dailymail.co.uk/tvshowbiz/chris-rock/index.html",
    "https://www.dailymail.co.uk/tvshowbiz/article-11827685/Will-Smith-tried-unsuccessfully-make-amends-Chris-Rock-Oscars-slap.html"
  ],
  "labels": [
    {
      "name": "Pop Culture"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Will Smith film",
      "weight": 0.10352497
    },
    {
      "name": "Will Smith",
      "weight": 0.10281126
    },
    {
      "name": "actor Will Smith",
      "weight": 0.099488296
    },
    {
      "name": "Smith",
      "weight": 0.098381855
    },
    {
      "name": "Pinkett Smith",
      "weight": 0.09710338
    },
    {
      "name": "Jada Pinkett Smith",
      "weight": 0.09544665
    },
    {
      "name": "Chris Rock",
      "weight": 0.074558966
    },
    {
      "name": "Alan Tudyk",
      "weight": 0.07212698
    },
    {
      "name": "Tudyk",
      "weight": 0.06403889
    },
    {
      "name": "Janet Hubert",
      "weight": 0.061203215
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.9951171875
    },
    {
      "name": "/Arts & Entertainment/Movies/Movie Reference",
      "score": 0.93603515625
    },
    {
      "name": "/Arts & Entertainment/Movies/Other",
      "score": 0.716796875
    },
    {
      "name": "/News/Gossip & Tabloid News/Other",
      "score": 0.425537109375
    },
    {
      "name": "/Arts & Entertainment/Movies/Drama Films",
      "score": 0.32958984375
    }
  ],
  "sentiment": {
    "positive": 0.049117837,
    "negative": 0.7446932,
    "neutral": 0.2061889
  },
  "summary": "Alan Tudyk, a former costar of actor Will Smith, has accused him of using his influence to minimize his role in the 2004 film iRobot. Tudyk portrayed the role of Sonny in the film, but was removed from promotional material when his character began testing higher than Smith's with trial audiences. This revelation comes after Smith had a public feud with his Fresh Prince of Bel-Air castmate Janet Hubert in 1993, which resulted in her dismissal from the show. Despite this, Smith has attempted to rebuild his reputation after he slapped Chris Rock at the 2022 Oscars.",
  "shortSummary": "Alan Tudyk alleged Will Smith used his influence to minimize his role in the 2004 film iRobot, which later ended up in a public feud.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "162ab223331847c19f5fc34bef44c430",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.dailymail.co.uk/tvshowbiz/demi-moore/index.html",
      "text": "Advertisement\nDemi Moore\nDemi Moore is an acclaimed American actress and producer, known for her roles in films such as Ghost, G.I. Jane and The Substance. Rising to fame in the 1980s, she became one of the highest-paid actresses in Hollywood. Moore is also recognised for her work in television and her advocacy for various social causes, including gender equality and human rights.\nRELATED TOPICS FOR Demi Moore\nDemi Moore - Latest news, views, gossip, photos and video\nPage\nBruce Willis' wife Emma reveals how action star husband really feels about her towering over him in heels\n10/08/25 23:24\nBruce Willis' wife of 17 years, Emma Heming Willis, has shared a post praising her husband's confidence. The model, 47, revealed her spouse, 70, has no issue with her wearing heels around him - despite her towering over him in the footwear. Emma shared the fun tidbit with fans as she posted two undated throwback images of her with Bruce - with the 5'10\" model standing inches taller than her 6'0\" husband as she stepped out in high heels. ...read\nDemi Moore fans are shocked to learn her REAL name... and how she grew up in a UFO town\n29/07/25 13:03Demi Moore is one of the biggest stars in Hollywood, especially now after her comeback that led to an Oscar nomination. But that is not her birth name. Find out what is on her birth certificate.The Greek restaurant which has gone viral for its gushing Kylie Jenner post has a history of OTT celeb tributes, from 'legendary' Magic Johnson to Demi Moore's 'timeless beauty'\n21/07/25 11:43Their gushing post about Kylie Jenner visiting their restaurant has set the internet on fire. But Tassia in the Greek village of Fiscardo is no stranger to an over-the-top celebrity tribute.Kylie Jenner's post about Greek island restaurant goes viral - and not in a good way\n21/07/25 03:45The owners of a restaurant in Greece have been beset by an unexpected wave of online vitriol after they bragged that Kylie Jenner had dined there.Kris Jenner, 69, showcases her lithe legs in puffball mini during Paris trip... as she cosies up to boyfriend Corey Gamble, 44, and flaunts the results of her facelift\n08/07/25 16:43Her smooth complexion is the result of the skills of celebrity plastic surgeon Dr. Steven M. Levine - dubbed the ' facelift maestro' - to achieve her new look.Bruce Willis' daughter Scout goes bra-free in see-through top and flashes her underwear while shopping in LA\n04/07/25 22:00Bruce Willis' middle daughter Scout Willis sent temperatures soaring on the Fourth of July when she went bra-free in Los Angeles.Demi Moore's psychic BFF reveals the 3 easy steps to instant success\n04/07/25 03:14Hollywood's go-to intuitive shares the unconventional, science-backed tools she used to survive family tragedy, predict market moves, and help celebrities manifest real-world success.Bruce Willis' wife Emma celebrates birthday with his ex Demi Moore and their family amid actor's dementia battle\n20/06/25 00:03Bruce Willis' wife Emma Heming rung in her 47th birthday during a lowkey celebration with her blended family this week.Star with famous parents who worked with Madonna and Meg Ryan has a Hugh Jackman link, who is this nepo baby?\n09/06/25 15:29She is the youngest child of two legendary movie stars - and has recently begun to follow in their footsteps. Can you guess the nepo baby?Demi Moore divides followers after rescuing orphaned ducklings\n09/06/25 11:21Demi Moore has caused controversy after revealing she's adopted three cute fluffy orphaned ducklings.Demi Moore divides followers after rescuing orphaned ducklings\n08/06/25 18:16The actress, 62, has rescued the baby mallards and is now caring for them with the assistance of her local veterinarian until they are ready to return to the wild.Revealed: The most attractive HEIGHTS for men and women, according to science - so, how do you stack up?\n08/06/25 06:33Scientists have revealed the most attractive heights for both men and women -and it's bad news for 75 per cent of men.How dementia-stricken Bruce Willis bonds with his granddaughter Louetta\n28/05/25 22:05Of Demi's interaction with Lou: 'I mean, you should see her face light up when they're on FaceTime when we're away.Loose Women's Mariella Frostrup takes BRUTAL swipe at Demi Moore, 62, for 'trying to look like she's in her 20s' - swiping 'how terrified of aging must you be to do that much to yourself'\n22/05/25 14:30The panel - consisting of Mariella, 62, Kaye Adams , 62, Denise Welch , 67, and Nadia Sawalha , 60 - returned to the live studio to talk about a number of topics, including Denise's 67th birthday.Andie MacDowell, 67, is a bra-free beauty in a silk negligee at Cannes as she reveals how she stays a size 4\n16/05/25 16:02Andie MacDowell has managed to stay in great shape after decades in Hollywood. She is known for the movies Four Weddings And A Funeral as well as St Elmo's Fire with Demi Moore.'Bumps, blemishes and wrinkles': A-list stars as you have never seen them before as close-up unfiltered pictures of Madonna, Kylie Jenner and Pamela Anderson emerge\n10/05/25 02:26A-listers have often been admired for their superhuman beauty.Brooke Shields, 59, flashes her black bra then quickly pulls closed her silky blouse during date with husband\n05/05/25 19:50Brooke Shields may have endured a small wardrobe malfunction on what was supposed to be a fun date night with her husband.Braless Scout Willis shows off her enviable figure in a midriff-baring top at a private party in LA\n30/04/25 22:52Scout Willis recently skipped a bra as she attended a private party in Los Angeles to celebrate the opening of Jacquemus' new boutique.Gary Oldman had to apologise to Demi Moore while filming The Scarlet Letter for 'being unprofessional' and 'drinking too much' on set\n28/04/25 23:28The Oscar winner, 67, played Arthur Dimmesdale in the 1995 Romance film alongside Demi Moore, now 62.I was a sceptic but a psychic changed my life - what she told me will convince you too, says KATE SPICER\n28/04/25 00:33My plan was to be a poker-faced sceptic who asked questions and gave nothing away, but of course that all flies out of the window.SNL star details humiliating treatment by ritzy New York restaurant while mid-conversation with Demi Moore\n27/04/25 20:30Chloe Fineman may have material for a new Saturday Night Live sketch after her recent experience at a ritzy New York City restaurant.Will you 'sink' or will you 'sag'? Experts reveal main types of facial ageing - and how to treat them\n27/04/25 07:38Find out whether you're a 'sinker', 'sagger', 'frowner' or 'raiser' and discover the treatments, tweakments and procedures that will help you maintain a youthful look for longer.The truth behind Demi Moore's picture with Blake Lively after she sparked fury at TIME 100 gala\n26/04/25 20:50Blake, 37, who is currently embroiled in a bitter legal battle with Justin Baldoni, was in attendance and struck up a friendly conversation inside the star-studded function with Demi, 62.Demi Moore, 62, flashes a super small waistline in silky gown at Time100 Gala\n25/04/25 13:59Demi Moore ignited fresh plastic surgery rumors as fans noticed a shocking detail when she took to the red carpet at the star-studded Time100 Gala in New York City on Thursday.Serena Williams cuts a glamorous figure in a black off-the-shoulder cut out dress as she attends TIME100 gala in NYC\n25/04/25 10:05Serena Williams cut a glamorous figure as she attended the TIME100 all-star gala on Thursday evening in New York City.Nicole Scherzinger flaunts her amazing figure in a glamorous sequin gown at the Time 100 gala in New York\n25/04/25 00:33Nicole Scherzinger looked nothing short of sensational in a glamorous black gown as she attended the Time 100 Gala at The Jazz at Lincoln Center in New York on Thursday.Demi Moore reveals which role left her 'absolutely terrified' years before full-frontal Striptease nudity\n24/04/25 17:37Demi Moore has revealed her most terrifying role years before she shocked fans by going fully naked in Striptease.Demi Moore showcases age-defying figure after detailing how she 'tortured' her body at the height of her fame\n24/04/25 05:59Demi Moore looked as youthful as ever when she was seen emerging in New York City on Wednesday.Demi Moore gives very telling four-word response on her future Oscar chances\n23/04/25 22:47Demi Moore opened up about her gut-wrenching Best Actress loss - and whether she still believes there's a shot at Oscar gold down the line.Succession star Sarah Snook is supported by pals Demi Moore and Emmy Rossum as she stars in new Broadway show The Picture of Dorian Gray\n23/04/25 13:48The actress, 37, is currently starring in The Picture of Dorian Gray on Broadway, which sees her taking on all 26 roles in the dynamic show.Demi Moore's shocking revelation about daughter Rumer Willis\n22/04/25 22:00The 62-year-old Brat Packer was deeply worried about her 36-year-old daughter's unmedicated water birth at homeDemi Moore reveals what Bruce Willis has 'never wavered on' amid actor's ongoing dementia battle\n22/04/25 19:07Demi Moore opened up about her enduring bond with ex-husband Bruce Willis amid his ongoing dementia battle, offering a glimpse into their evolving relationship, which includes co-parenting.People's Most Beautiful Person, 62, unveiled after four decades in the industry\n22/04/25 13:54This Brat Packer and doting grandparent experienced a career resurgence last yearBruce Willis' wife Emma unveils poignant cover for her guide to caring for loved ones with dementia\n17/04/25 23:42The 46-year-old Make Time podcaster teamed up with ghost author Michele Levy Bender to pen the 272-page guide about how she and the retired 70-year-old coped after his 2022 diagnosisDemi Moore's co-star Emilio Estevez reveals their iconic film St. Elmo's Fire was a 'nightmare' to work on\n17/04/25 20:24The coming-of-age film which starred Estevez, 62, Demi Moore, and Rob Lowe is now a classic, but Estevez still has unpleasant memories of working with Schumacher, who passed in 2022.Oscar-winning star turns down huge role with Ryan Gosling in major blow to franchise\n17/04/25 13:13The future is certainly bright for newly-minted Oscar winner Mikey Madison , though it seems she won't be joining one of the biggest movie franchises.Demi Moore finally reveals how she really felt about losing the Oscar to Mikey Madison\n17/04/25 04:11The 62-year-old Brat Packer won the Golden Globe and the SAG Award for her performance as workout guru Elisabeth Sparkle in Coralie Fargeat's body horror film The SubstanceDemi Moore, 62, named as one of TIME's 100 Most Influential People after career resurgence and Oscar nod as she joins Serena Williams and Ed Sheeran on the star-studded list\n16/04/25 23:34The movie star, 62, has been named a 'titan' of 2025 alongside singer Ed Sheeran , tennis star Serena Williams.Now Scout Willis weighs in on former stepdad Ashton Kutcher after sister leaked 'private' cryptic comment\n11/04/25 01:52After Talluah's comments made headlines, her sister Scout weighed in on the matter while attending the premiere of The Carters, where she agreed with her sibling that no one needed to be the 'bad guy.'Demi Moore's daughter leaks 'private' cryptic comment about ex stepdad Ashton Kutcher\n09/04/25 20:35Tallulah, 31, left a comment on Gwyneth Paltrow's post about step-parenting that referenced her ex step parent Kutcher, whom was married to her mother from 2005 to 2013.Demi Moore's daughter defends 'still taking baths' with her adult sisters\n03/04/25 06:10Rumer Willis revealed her unconventional Idaho upbringing meant she, Scout, and Tallulah never had to bathe alone nor sleep alonePregnant Poppy Delevingne displays growing bump by showing off her flawless moves in hilarious Baby Mama dance trend\n02/04/25 08:53In a short video posted on holiday on Tuesday, she could be seen appearing from the edge of a balcony with a funny face drawn on her bump and her black top turned inside out over her head.Doctors reveal update on Bruce Willis after ex Demi Moore posts family photos\n26/03/25 18:52Viewing the six images, physicians said America's favorite action hero appeared to be wearing a 'masked expression' showing 'a little less' emotion.Bruce Willis looks somber on drive in LA after celebrating 70th birthday amid dementia battle\n23/03/25 23:24He had back-to-back celebrations in recent days to mark his 16th wedding anniversary and his 70th birthday.Stephen Graham's height revealed after his starring role in Netflix's Adolescence: Scroll through our graphic to see the heights of 400 famous figures, past and present...\n22/03/25 08:42Serial Bafta nominee Graham broke into the film industry in 2000, playing Tommy in Guy Ritchie's Snatch. Six years later he had another breakout rule as racist skinhead Combo in This is England.Demi Moore gives update on Bruce Willis and shares intimate snaps from 70th birthday bash amid dementia battle\n20/03/25 18:35The 62-year-old Oscar nominee took to Instagram on Thursday morning to post sweet images from the Die Hard star's milestone day.Demi Moore shares rare Bruce Willis photos with daughters on his 70th birthday amid dementia battle\n20/03/25 02:52Demi Moore shared rare photos of Bruce Willis and their daughters in an Instagram tribute on Wednesday to celebrate his 70th birthday amid his ongoing dementia battle.Bruce Willis' wife, 46, begs fans to 'rally' for him in emotional post for 70th birthday amid dementia battle\n19/03/25 20:06'It's Bruce's birthday, and if there's one thing I know, it's that there's no greater fan than a Bruce fan,' wrote the brunette beauty. 'So flood him with all the love today,' she added.Demi Moore's daughter gives update on dad Bruce Willis amid devastating dementia battle\n19/03/25 03:26Demi Moore's daughter Rumer Willis gave an update on her father Bruce Willis just one day before the star's 70th birthday which will take place on Wednesday, March 19.Cameron Diaz spotted with baby son Cardinal in rare outing after fueling rumors she's quitting acting again\n15/03/25 19:32Cameron Diaz was spotted with her baby son Cardinal leaving a restaurant in Santa Barbara, California. She looked fashionable in a black top with wide-legged jeans.Revealed: What really sparked Demi Moore and Margaret Qualley's feud with Substance director, writes ALISON BOSHOFF\n14/03/25 02:24Panic attacks, horrifying prosthetics, skin damage and a feud which has lasted for ten months - the story behind the making of The Substance is nearly as sensational as the film itself.Hollywood icon, 88, makes shock acting return after 6-year hiatus... can you guess who it is?\n10/03/25 20:28He's appeared on the silver screen alongside sirens such as Demi Moore, Barbra Streisand, and Meryl Streep. Can you tell who this A-list movie star is?Lipreader reveals truth behind Emma Stone and Margaret Qualley's heated exchange that sparked viral meme\n10/03/25 16:16Emma Stone and Margaret Qualley's viral heated exchange at the 2025 Oscars has finally been deciphered.Demi Moore's daughter Rumer Willis wears mom's gold bikini from Striptease 30 years after co-starring in film\n06/03/25 20:24Rumer Willis proved the apple doesn't fall far from the tree, turning heads as she slipped into the iconic gold bikini her mom Demi Moore famously wore in the 1996 comedy Striptease.Mikey Madison looks tense as Demi Moore's loss overshadows her Oscars glory\n04/03/25 23:49Mikey Madison has quickly returned to her normal life after winning the Oscar for Best Actress in a Leading Role for her acclaimed performance in Anora.Jack Antonoff's reaction to Demi Moore losing Oscar to Mikey Madison goes viral\n04/03/25 22:49Eagle-eyed fans caught Antonoff looking stunned and turning to his wife before the camera pulled away to Mikey.Oscars ratings revealed amid woke nominees, Demi Moore's shock snub, and being dubbed most boring ceremony ever\n04/03/25 19:56The 97th Academy Awards hit a five year high at 19.96million viewers across both ABC and Hulu according to Nielsen's final same-day ratings which includes streaming.Demi Moore taking Oscars loss 'very hard' after Anora star Mikey Madison's shock victory\n04/03/25 07:34Moore, 62, was reportedly 'really hopeful' that she could win the Best Actress Oscar after several high-profile wins earlier in awards season.Meg Ryan has fans buzzing over her face at the Oscars: 'She removed everything that made her uniquely adorable'\n04/03/25 03:14The 63-year-old rom-com queen reunited with her When Harry Met Sally leading man Billy Crystal to present the award for best picture during the 97th Academy Awards on SundayMegyn Kelly reveals the Oscars star she thinks is going overboard with surgery...again\n03/03/25 23:48Megyn Kelly sparked debate by criticizing a Hollywood star's changing appearance, claiming she is once again going overboard with cosmetic procedures.Demi Moore breaks silence on shock Oscars loss with emotional message\n03/03/25 23:10The actress, 62, was up for Best Actress for her role in The Substance - her first ever Oscar nomination - but lost to Anora star Mikey Madison.LAURA CRAIK Oscars Fashion Verdict: A year for fairy-tale frocks that defied fashion\n03/03/25 21:46Do you care what people think of you, to the point that you go out of your way not to offend? Then the Oscars red carpet in Hollywood, California, would be your nightmare, writes LAURA CRAIK.The subtle Oscars insult that proves this was the worst awards show ever! MAUREEN CALLAHAN slams Ozempic Oprah, Awful Adrien Brody and the cruelest snub of all\n03/03/25 21:08Just when you thought Hollywood couldn't get more pretentious, out-of-touch and in love with itself, the Sunday's show somehow surmounted the odds.Demi Moore is supported by glamorous daughters Tallulah, Rumer and Scout Willis at the Vanity Fair Oscars party after missing out on the Best Actress prize\n03/03/25 09:54Demi Moore was supported by daughters Tallulah Willis , Rumer Willis and Scout Willis as they attended the star-studded Vanity Fair Oscars Party on Sunday night.Demi Moore and Sydney Sweeney suffer a fashion faux pas as they wear strikingly similar glitzy halterneck dress to the Vanity Fair Oscars party\n03/03/25 08:52Demi Moore and Sydney Sweeney suffered an awkward fashion blunder at the Vanity Fair Oscars bash on Sunday night as they arrived in nearly the same dress.Oscars 2025 dubbed the most boring ceremony EVER as shock snub for Demi Moore, risque jokes and string of Trump rants fail to avert an absolute snoozefest\n03/03/25 06:25Anora was the big winner of the evening, taking home five awards including Best Picture, Best Leading Actress and Best Director.Furious Demi Moore fans erupt over her Oscar loss to younger actress despite being favorite: 'Robbed'\n03/03/25 05:48Demi Moore fans have been left heartbroken after the star didn't receive an Oscar win for Best Actress on Sunday - with the honor going to Mikey Madison for her role in Anora.Fans fume as ITV star takes a savage swipe at nominee Demi Moore and The Substance during channel's live Oscars coverage\n03/03/25 01:56ITV viewers were left fuming with the channel's 2025 Oscars coverage. with one guest's comments on a nominated film not going down well with fans.Fans slam Conan O'Brien's 'weird' Oscars skit with Demi Moore\n03/03/25 01:01Fans were not too pleased with comedian Conan O'Brien's Oscars 2025 entrance - as he crawled out of the back of Demi Moore .Demi Moore and Whoopi Goldberg enjoy Ghost reunion on Oscars 2025 red carpet 35 years after film release\n03/03/25 00:07Now Demi is tipped for Oscars glory for the first time in her long and glamorous career - she is nominated for best actress for the body horror picture The Substance.Oscars 2025 Worst Dressed: Ariana Grande leads list with puffy gown as Wicked costar channels Dracula\n02/03/25 22:43On Sunday evening, A-listers will gather for one of the most exclusive and prestigious events of the year - The Oscars.Oscars 2025: How stars like Selena Gomez and Demi Moore get ready for Hollywood's biggest night of the year\n02/03/25 19:39The awards show, better known as the Oscars, kick off from Hollywood's Dolby Theatre in Los Angeles at 7e/4p on ABC and Hulu, with Conan O'Brien hosting.Mick Jagger, 81, and girlfriend Melanie Hamrick, 37, make rare appearance together at pre-Oscars dinner\n02/03/25 18:42Mick Jagger and his girlfriend made a rare appearance together Saturday night in Beverly Hills, attendng the Chanel 16th Annual Pre-Oscar Awards dinner.Who will attend Oscars 2025? Selena Gomez, Ariana Grande, Demi Moore and Zoe Saldana are a few\n02/03/25 18:41Halle Berry , Penélope Cruz, Elle Fanning , Scarlett Johansson and Selena Gomez have been confirmed to presenters. Also on the list are Whoopi Goldberg , John Lithgow, Amy Poehler.Truth behind Kim Kardashian's friendship with Lauren Sanchez as they hit an Oscar bash with Jeff Bezos\n02/03/25 16:24Kim and Lauren chit-chatted like they were old high school chums while at The Beverly Hills Hotel in Beverly Hills. Now DailyMail.com can reveal the truth behind their high-profile friendship.Mikey Madison looks radiant in white as she poses with Joe Alwyn while Demi Moore is joined by her daughters at MPTF's 23rd Annual Night Before pre-Oscars event\n02/03/25 12:48The actress, 25, looked incredible as she arrived at the star-studded bash wearing a sheer floral nude gown.Lupita Nyong'o rocks sheer black gown as she joins starry guest list at Chanel pre-Oscars bash\n02/03/25 08:06Held at the famous Polo Lounge in the Beverly Hills Hotel, the glittering event drew a parade of top names including Kim Kardashian, Demi Moore and Elle Fanning.Heidi Klum, 51, looks incredible in LBD with teased hair at Chanel's pre-Oscars bash in LA\n02/03/25 07:01Heidi Klum made a stunning appearance at Chanel's 16th annual pre-Oscar Awards dinner in Los Angeles on Saturday evening.Kim Kardashian, Demi Moore, Lily-Rose Depp and Elle Fanning lead stars at Chanel's pre-Oscars dinner in LA\n02/03/25 06:00Just hours before the 97th annual Academy Awards, some of Hollywood's biggest names gathered for Chanel's 16th Annual Pre-Oscar Awards Dinner on Saturday.Oscar nominee Demi Moore, 62, looks youthful in tweed at pre-party as she could become first time winner\n02/03/25 05:46Demi Moore put on a classy display as she stunned at Chanel's 16th Annual Pre-Oscar Awards Dinner in Beverly Hills on Saturday.\nPage\nDON'T MISS\n-\nHeartbroken David and Victoria Beckham fear Brooklyn has 'quit the family' after failing to invite ANY of his relatives to vow renewal with Nicola Peltz\n-\nEXCLUSIVE\nCat Deeley is snapped for the first time since her shock split from husband Patrick Kielty... with a male friend in Spain\n-\nTopless Nicola Peltz, 30, poses with her ageless mother Claudia, 70, as she shares a glimpse into the morning before she renewed her vows\n-\nEXCLUSIVE\nOlivia Rodrigo ENGAGED? Singer flashes huge new diamond ring on THAT finger... after romantic home tour with Brit actor boyfriend\n-\nCristiano Ronaldo forked out eye-watering seven-figure sum on model Georgina Rodriguez's incredible diamond engagement ring\n-\nEXCLUSIVE\nThe Yorkshire Vet's Matt Jackson-Smith reveals how to care for your dog as they grow up, and his dog Harry's VERY unusual traits\nAd Feature\n-\nStacey Solomon wows in plunging black bikini as mother-of-five enjoys luxury family holiday and admits she felt 'beautiful' in stunning snaps\n-\nInsiders tell KATIE HIND what 'furious' ITV production staff REALLY think of the 'rubbish' household names who are escaping jobs bloodbath\n-\nMoment Christine McGuinness shares doubts over joining Celebs Go Dating as she panics 'this isn't normal' before quitting the show\n-\nSmart moves: The 10 must-know education brands helping the UK learn better and faster\nAd Feature\n-\nOasis' future after their string of reunion gigs end 'revealed' as Gallagher brothers are flooded with performance opportunities\n-\nJoshua Jackson sparks romance rumors with Bridgerton star two years after dramatic divorce from Jodie Turner-Smith\n-\nAngelina Jolie is the latest Hollywood star planning to sell up and LEAVE LA... as she plots sale of 'historic' home\n-\nEDEN CONFIDENTIAL: Erin finds the jewel in her Crown - a new leading lady\n-\nThe stars of the much-loved Wittering Whitehalls podcast on how a hearing check has changed their relationship\nAd Feature\n-\nS Club 7's Jon Lee, 43, reveals he hasn't had sex in SIX years on Celebs Go Dating after 'traumatic' dating past\n-\nChris Hemsworth celebrates 42nd birthday in Ibiza with star-studded bash - while wife Elsa Pataky looks downcast as she shops alone in Australia's Byron Bay\n-\nNicola Peltz wears her mother's dress in secret vow renewal officiated by her father Nelson... while David and Victoria are thousands of miles away\n-\nKylie Jenner shows Timothée Chalamet what he's missing as she posts sexy snaps after birthday snub amid split rumors\n-\nEating for bump, and beyond! Pregnancy nutritionist reveals her top diet advice for those trying to conceive, pregnant, breastfeeding and baby nutrition\nAd Feature\n-\nCelebrity SAS star Lucy Spraggan breaks down in floods of tears after revealing horrifying rape ordeal during her time on the X Factor\n-\nI, Robot star hints at drama on Will Smith film after claiming his cyborg role 'tested higher' with audiences\n-\nEXCLUSIVE\nMyleene Klass' revenge wardrobe: Expert reveals how star is sending secret fashion signals amid Rochelle Humes 'feud'\n-\nKelly Clarkson's late ex-husband Brandon Blackstock is remembered in moving tribute by son after shock death from cancer\n-\nSip smarter this summer: Discover the 'Magic of Moderate Drinking' with these simple tips\nAd Feature\n-\nCristiano Ronaldo and Georgina Rodríguez are engaged! Footballer's fiancee reveals GIANT diamond ring\n-\nStrictly Come Dancing 2025: Love Island winner, Doctor Who star and footballing legend confirmed to take part in the competition\n-\nEd Westwick and his wife Amy Jackson pack on the PDA in swimwear-clad snap as they share a look at their family holiday to Italy\n-\nLiam Hemsworth and Gabriella Brooks spark engagement rumours after actress flaunts diamond ring in Ibiza\n-\nGet set for a totally WICKET summer: The Hundred is rolling into cities across the UK - this is how YOU and your family can join the fun\nAd Feature\n-\nEXCLUSIVE\nRita Ora's husband Taika Waititi wears tone-deaf T-shirt on star-studded Ibiza trip for Chris Hemsworth's birthday\n-\nMaya Jama shows off her incredible bikini body as she parties with AJ Odudu on 24 hour trip to Ibiza\n-\nJennifer Lopez shows off famous derriere in sultry snaps after Ben Affleck romance\n-\nBrad Pitt burglary suspects arrested after cops link separate heist to A-lister's home break-in\n-\nFrom spending when you're abroad to absolutely smashing the preparation and packing, we reveal how to holiday like a pro\nAd Feature\n-\nCelebrity SAS Who Dares Wins axes ex army corporal for 'lying and cheating' on the show - resulting in an explosive row\n-\nPrincess Andre tipped to become the UK's answer to Kylie Jenner with her budding career as a makeup mogul\n-\nMaura Higgins shows off dramatic living room makeover after moving into her 'dream' £1.25m Essex mansion\n-\nZoe Ball's famous dad Johnny says her relationship with her ex-husband Fatboy Slim is better than ever\n-\nFrom Icelandic waterfalls to Japanese tea ceremonies: The new cruise collection that promises adventure as well as ultra-luxury\nAd Feature\n-\nTaylor Swift fans go wild after Empire State Building 'stunt' hints at new music from singer\n-\nEXCLUSIVE\nMatt Damon almost goes overboard on boozy Ibiza trip with star-studded group for Chris Hemsworth's birthday\n-\nKelly Clarkson's ex-husband Brandon Blackstock's cause of death confirmed after passing aged 48\n-\nPeter Andre's manager Claire Powell's glow-up 16 years on as she gives advice to his daughter Princess on her show amid Katie Price's comments\n-\nThe Bear's Jeremy Allen White displays his chiseled physique as he cools off on the beach\n-\nJennifer Aniston and Gwyneth Paltrow still gossip about their mutual ex Brad Pitt\n-\nLIZ JONES: Like Katie Price I transformed myself with surgery, went bankrupt and dated terrible men. But there's one key difference between us\n-\nGethin Jones announces the death of his father as the TV star pays an emotional tribute and is flooded with supportive messages\n-\nCHRISTOPHER STEVENS reviews Celebs Go Dating on E4: Television hits the most wretched abyss with this atrocity of a series\n-\n'There's a part of me that thinks this is better': Jennifer Aniston is glad Matthew Perry is 'no longer in pain' and says she mourned Friends co-star for a 'long time'\n- EXCLUSIVE She was a silver screen siren of the 70s and ex-wife of a Hollywood icon, but is unrecognisable as she walks her dogs...can you guess who?\n-\nNetflix back away from Harry and Meghan with new deal, on worse terms: Sussexes sign 'first-look' agreement after shows flopped\n-\nKelly Clarkson breaks down in tears on stage singing poignant song just days before ex-husband's death was announced\n-\nEXCLUSIVE\nMeghan Markle and Prince Harry's new Netflix deal 'IS a downgrade' and more like a 'we'll call you' than 'here's the chequebook', experts say\n- After FOUR years of menopause struggles I took a chance on this supplement - now I'm sleeping better and finally feeling more like myself SHOPPING\n-\nTerry and Heather Dubrow take a major financial hit as they finally offload their Beverly Hills mansion\n-\nEmma Stone reveals heart-wrenching reason she cried before shaving her head for new role\n-\nGwyneth Paltrow, 52, shows off her VERY fit physique after sharing exercise secrets\n-\nWoke Bravo star claims 'fat' Trump voters should be banned from Mexican restaurants in explosive rant\n-\nNew Rambo star is FINALLY revealed... and it's not the successor Sylvester Stallone wanted\n- The 'liquid gold' facial tanner that fights ageing and has beauty fans obsessed: 'Best tanning drops EVER!' (now 20% off, but not for long) SHOPPING\n-\nMyleene Klass is accused of brutally 'ghosting' a close friend for contacting her ex-husband Graham Quinn - days after he ended their six-month marriage\n-\nKylie Jenner skips over-the-top Kardashian birthday bash for intimate party with homemade cake and kids\n-\nEXCLUSIVE\nRobin Thicke swarmed by female fans as he serenades crowd at Hamptons event following honeymoon with April Love Geary\n- Pet owners love this dog food subscription service for better fur, skin and health - and it costs just 89p a DAY (plus it's 40% off right now) SHOPPING\n-\nMusic icon stops concert to shame parent for 'irresponsible' act in front of crowd of 26,000 fans\n-\nEXCLUSIVE\nMy dad and I were jailed for running an illegal steroid lab together and brawled in the courtroom - I can't believe how he betrayed me\n-\nEXCLUSIVE\nThe Chase star Mark Labbett's ex Hayley Palmer gives her verdict his Celebs Go Dating debut following their 'traumatic' relationship\n-\nKatie Price, 47, seen for the first time since tweaking SIXTH face lift - as she recovers in Turkey after Princess, 18, revealed she would never turn to surgery like her mum\n- These 'DELICIOUS' cupboard-ready meals make nutritional eating quicker and easier than ever (and we have an exclusive deal) SHOPPING\n-\nJaw-dropping moment TOPLESS Katie Price derails Princess Andre's reality show - as teen screams 'no mum I'm filming!' and admits 'she's so unpredictable'\n-\nNelly Furtado's life as body positivity pin-up: How embracing her 'new silhouette', and becoming a mum again in her 40s has earned star, 46, 'icon' status\n-\nLiam Payne's ex Sophia Smith marries James Bridgwood as she stuns in a chic highneck gown during lavish London ceremony\n-\nRebecca Loos shoots down Richard Madeley on Good Morning Britain as they clash over David Beckham - swiping 'we don't need to talk about this'\n-\nA Place In The Sun's Laura Hamilton, 43, defiantly shows off her figure in blue swimwear after hitting back at trolls insisting she is 'too old to wear a bikini'\n-\nMeghan Markle has awkward Kardashians moment as she gifts As Ever merch to stars... who fail to acknowledge her\n-\nJennifer Aniston breaks silence on terrifying gate-crashing stalker: 'People are out of their minds'\n-\nFatboy Slim's Hove beachfront cafe slammed for his 'crazy' prices and 'shocking' waiting times\n-\nLorraine star reveals GP son was held at knifepoint in 'terrifying' ordeal at work - pleading 'it needs to stop' and begging for 'more protection'\n-\nBritish actor looks unrecognisable as he watches Oasis at Wembley with musician Tom Grennan - but can you guess who it is?\n-\nMolly-Mae Hague's sister Zoe totes £7K Chanel handbag as she heads to the gym weeks after being mocked for leaving Bali after 48 hours\n-\nPrincess Andre thought she'd be KILLED during 2018 carjacking - as she watched in horror while mum Katie Price was 'touched up' and made heart-wrenching plea\n-\nHulk Hogan's ex-wife Linda pays tribute to late wrestling icon on his birthday: 'Love and miss you so much'\n-\nMark Wright gives rare insight into family holiday with 5 month-old daughter Palma as he reveals 'disappointment'\n-\nShakira unleashes her inner She Wolf! Love Island's Khan sends fans wild as she shares VERY steamy bedroom snap with Harry Cooksley\n-\nKate Garraway's gorgeous floral midi dress is a must have for summer - and we've found it on sale with 50% off\n-\nGregg Wallace addresses claims he 'took his trousers down' on set of MasterChef - after being sacked in wake of inquiry into alleged misconduct\n-\nSam Thompson is forced to break news of his split from Zara McDermott to Jamie Lee Curtis after Hollywood star tipped the pair for marriage\n-\nLove Island stars send fans wild as they fuel romance rumours with telling Instagram snap in the same place: 'Definitely not a coincidence!'\n-\nLove Island's Arabella Chi shows off her figure in a crochet bikini in Palma just three months after welcoming baby daughter\n-\nBikini-clad Stacey Solomon addresses husband Joe Swash's whereabouts as they enjoy a family holiday at a swanky £1k-per-night hotel in Turkey\n-\nBombshell announcement Taylor Swift fans think singer will make in rumored appearance on Travis Kelce and brother Jason's podcast\n-\nOlivia Attwood reveals the bloody and bruised results of her latest beauty procedure after having fish DNA injected into her face\n-\nOne Direction fan caught up in Zayn Malik 'cheating' scandal finally breaks her silence - 13 years after leaked footage of their 'booty call' went viral\n-\nAdrian Thrills reviews The Black Keys' new album No Rain, No Flowers and finds the Ohio duo moving away from their fling with funk\n-\nTaylor Swift fans are CONVINCED she will announce next album on Travis Kelce's podcast after teasing 'new era'\n-\nI was branded 'the ugliest in the family' from nine years old - sick trolls mocked me for having a flat chest, admits Princess Andre in ITV documentary\n-\n'It felt like I was up there for everyone's entertainment': Tulisa claims a police officer mimed oral sex gestures at her when she was on trial for drug sting\n-\nEXCLUSIVE\nBlonde bombshell best known for playing a Bond Girl is seen on a rare outing... can you guess who?\n-\nLisa Rinna's daughter Amelia Gray DENIES promoting anorexia after sparking concern over 'skeletal' frame\n-\nLove Island's Dejon Noel-Williams breaks his silence over 'exposé' book - as he admits to 'questioning why people would do these things'\n-\nLottie Moss sets pulses racing in a skimpy leopard print bikini as she poses for sizzling snaps amid sun-soaked Spanish getaway\n-\nBBC axes beloved celebrity talk show after eight series - as broadcaster pays tribute to 'hardworking' host and admits cancellation was 'a difficult decision'\n-\nCynthia Nixon braves a dip in the Irish sea as she gives an insight into her travels with wife Christine Marinoni\n-\nMel B gushes her second wedding to husband Rory McPhee 'exceeded her expectations' after tying the knot in three-day ceremony in Morocco\n-\nMachine Gun Kelly offers dramatic three-word response to THOSE Sydney Sweeney dating rumors\n-\nTaylor Swift fans in meltdown as Travis Kelce and brother Jason tease singer will appear on their podcast\n-\nDenmark's party prince! Future King, 19, is caught smooching daughter of former Army captain at music festival\n-\nGeorgia May Foote slips into brown workout gear as she heads to the gym amid reports she and husband Kris Evans are 'headed for divorce'\n-\nFury over Katy Perry music video filmed in protected area without permission - as authorities in Majorca issue fine\n-\nLove Island besties Toni Laites and Shakira Khan put on a VERY racy display as they passionately kiss on a pool table in raunchy clip\n-\nCountry music star Spencer Hatcher's mother is stabbed to death in horrific home invasion\n-\nHot socialite summer! Lady Mary Charteris parties the night away with Lady Lola Bute, Lila Moss, Rita Ora's husband and Charlotte Tilbury\n-\nHit horror series with Hollywood A-lister AXED - as devastated fans fume 'how could they?!'\n-\nHalle Berry's ex is skewered by fans for saying he left her because she didn't cook, clean, or seem 'motherly'\n-\nShirtless David Beckham, 50, and wife Victoria, 51, continue soaking up the sun on their £16m superyacht amid lavish Italian getaway\n-\nRafael Nadal is a father for a second time! Tennis ace and wife Mery Perello welcome son as sweet meaning behind his name is revealed\n-\nMaya Jama displays her jaw-dropping figure in a skintight unitard as she runs last minute errands before jetting off to Ibiza\n-\nLily James hits back at Instagram moderators after her racy nude celebration is removed for breaching community guidelines\n-\nNicole Scherzinger sets pulses racing as she takes on Nicki Minaj pose challenge in a skimpy white bikini while balancing on a rock and sipping on a martini\n-\nThe moment that sparked Katie Price and Princess 'feud' as daughter makes modelling debut in Ibiza\n-\nMassive rock band announces long-awaited tour 20 years after hit song\n-\nAmelia Dimoldenberg reveals the A-list star who was her 'dream' Chicken Shop Date and opens up about her VERY flirty encounter with Andrew Garfield\n-\nAdam Rickitt shares news of heartbreaking family tragedy in emotional update\n-\nAnna Friel admits she was 'distraught' after being dumped by her first boyfriend Darren Day as she reveals his brutal move following split\n-\nKatie Price and ex Peter Andre's VERY public feud as daughter Princess reveals she sought counselling after realising her parents 'don't like each other'\n-\nPictured: Meghan Markle's California influence on Princess Eugenie's style - from '50 shades of beige' to Grecian draping\n-\nVictoria Beckham shares a snap of shirtless David as they holiday on the Italian riviera - after he was caught pinching her bottom during date\n-\n'Gutted' Lauren Goodger pulls out of scheduled This Morning appearance due to lack of childcare - as she shares sexy selfies from home instead\n-\nStrictly Come Dancing 2025's first star is REVEALED: Gladiators star Nitro set to compete in new series as the show battles a string of scandals\n-\nPamela Anderson's pickles will make Meghan green with envy! Fans go wild for Baywatch star's new product\n-\nBBC Breakfast guest slammed for 'harsh and disrespectful' swipe at late Blue Peter star Biddy Baxter - with shocked fans gasping 'he clearly wasn't a fan!'\n-\nFashion influencer gets slammed as she goes braless in 'hideous' designer dress\n-\nLucy-Jo Hudson showcases her incredible weight loss in before and after snaps following gruelling 30 day fitness challenge\n-\nWayne Lineker battles nerves ahead of his speech at daughter Tia's lavish wedding as she ties the knot with football manager Harry Agombar in Mallorca\n-\nEdinburgh Fringe luvvies claim 'Oasis effect' is 'catastrophic' as fans send hotel prices surging... and some moan they've been forced to live in cars\n-\nJames Whale's final words: Radio star said the past few months had been hard and expressed his sadness at missing Christmas in posthumous column\n-\nAaron Taylor Johnson's astronomical net worth revealed as actor becomes hot favourite to become the next James Bond after signing deal with 007 watch provider\n-\nSophie Turner hits back at critic that claimed she's 'forgotten' about her two daughters\n-\nKhloe Kardashian enjoys hamper from Meghan Markle's As Ever brand - as delighted Duchess reposts reality star's surprising social media shoutout\n-\nPrincess Andre's childhood trauma: Katie Price's daughter says she 'saw things kids shouldn't see' as she lays bare her mother's 'problems'\n-\nJenna Ortega looks quirky with bleached eyebrows as she promotes Wednesday in South Korea as series two of Netflix hit receives rave reviews\n-\nIsla Fisher and Kaitlyn Dever join pregnant Vanessa Hudgens as they lead the A-listers at star-studded event\n-\nHidden meaning in Princess Beatrice's husband Edoardo Mapelli Mozzi's birthday post for her as he takes inspiration from Prince William and Kate\n-\nPete Wicks admits he's 'in love' with a new woman six months on from his romance with Maura Higgins\n-\nBlue Peter icon Biddy Baxter dies aged 92: Tributes pour in for the 'pioneer' of children's television\n-\nNatalie Imbruglia and Delta Goodrem 'in talks to join cast of Strictly Come Dancing 2025' - as Gladiator Nitro is the first star announced\n-\nAlex Jones shares a kiss with husband Charlie Thomson as she celebrates 15 years on The One Show\n-\nKieran Hayler shows off new tattoo in Sellebrity Soccer match after Princess Andre laid bare her mother Katie Price's struggles following her split from the stripper\n-\nRebecca Loos breaks down in tears after being punched in the face in brutal Celebrity SAS boxing match - gasping 'f***ing hell!' and fighting for breath\n-\nLioness Ella Toone shows off her sparkling engagement ring as she celebrates her partner Joe Bunney's romantic beach proposal with pals\n-\nMaisie Smith breaks down in tears revealing Celebrity SAS moments 'worse than you can imagine' that were cut from 'brutal and torturous' show\n-\nRosie Huntington-Whiteley shows off her incredible figure in a white bikini top and TINY thong on the beach\n-\nVictoria Beckham shares a look at her family holiday as close-knit brood relax in St Tropez amid family rift - but Cruz isn't happy with one of her snaps!\n-\nMeghan Markle issues cryptic message about the UK as she teases As Ever update\n-\nJennifer Lopez's concert crashed by grasshopper as insect crawls up her NECK in nerve-wrecking moment\n-\nRochelle Humes 'gave Myleene Klass' ex-husband Graham Quinn a place to stay' following their split after she caught him 'cheating' with a celebrity\n-\nPaul Gallagher joins Oasis star brother Liam on Edinburgh-bound private jet ahead of looming court date after being charged with rape\n-\nMolly-Mae shows off her incredible figure in a black bikini while on family holiday in Turkey with boyfriend Tommy Fury and daughter Bambi\n-\nPrincess Andre says she 'hated' her appearance and fixated on her 'big nose' as she admits she doesn't have her mum Katie Price's confidence\n-\nCarmen Electra reveals risqué way Kim Kardashian has helped her turn heads\n-\nEXCLUSIVE\nPatrick Kielty's 'seething' family reveal heartbreaking moment they knew his marriage to Cat Deeley was over for good\n-\nLindsay Lohan looks fresh-faced as she visits Taronga Zoo with her rarely-seen husband Bader Shammas and their son in Sydney - and also brings the nanny\n-\nEXCLUSIVE\nMaura Higgins looks unrecognisable in a red wig and dramatic makeup as she poses for striking Original Magazine cover shoot\n-\nJacqueline Jossa shows her support for husband Dan Osborne at football match after Christine McGuinness texting accusations amid marital woes\n-\nIs Prince Louis following in Prince Harry's comedic footsteps? Royal shares a sense of humour with the Duke of Sussex and the late Queen\n-\nPeter Andre reacts to 'disgusting' online messages sent to daughter Princess, 18, by anonymous older men\n-\nGardener's World fans are moved to tears after star reveals his terminal cancer diagnosis during the show\n-\nDR MAX PEMBERTON: Meghan's deathly silence on Harry's woes says so much about their relationship. This is not what a successful marriage looks like..."
    },
    {
      "url": "https://www.dailymail.co.uk/tvshowbiz/chris-rock/index.html",
      "text": "Advertisement\nRELATED TOPICS FOR Chris Rock\nChris Rock - Latest news, views, gossip, photos and video\nPage\nI, Robot star hints at drama on Will Smith film after claiming his cyborg role 'tested higher' with audiences\n12/08/25 02:03\nAlan Tudyk, 54, portrayed the role of Sonny in the 2004 film iRobot, in which Smith, 56, starred as Del Spooner....read\nWill Smith reminds fans he is approaching his 60s as he trades in his sports car for a very safe $275K SUV\n08/07/25 15:49Will Smith has an impressive car collection worth $4.5 million, according to some estimates. This week he chose his white Lamborghini SUV for an outing in Los Angeles.Hollywood A-lister's mega mansion takes up a whole ZIPCODE... and has a mysterious set of symbols carved into secret hideaway\n06/07/25 11:03Aerial photos obtained by the Daily Mail show the 150-acre estate, inspired by Gene Hackman's Santa Fe home, that is so big it has its own zip code.Will Smith takes aim at Chris Rock with savage Oscar slap lyric in cringey freestyle\n29/06/25 22:56The disgraced 56-year-old still seems internally divided on whether he's truly contrite or defiant over assaulting the 60-year-old comedian onstage in 2022Will Smith's nepo baby son Jaden pictured with drug paraphernalia on park bench at 3 AM in Paris\n23/06/25 04:52Just a week after his surprise performance with famous father Will Smith in London , Jaden Smith was spotted with drug paraphernalia in Paris.Will Smith gives bizarre take on how that Chris Rock Oscars slap impacted his career as he reflects on authenticity and imperfection\n21/06/25 00:53The actor, 56, reflected on the incident - where he struck Chris, 60, on stage over a joke about his wife Jada Pinkett Smith's shaved head, which was due to her alopecia diagnosis.8 Netflix shows with a perfect Rotten Tomatoes score\n10/06/25 13:27Thanks to Rotten Tomatoes, MailOnline have found 8 Netflix shows that scored a whopping 100% on the site, so now you know what to watch first...Rita Ora stuns in a plunging animal print dress as she joins gorgeous Jodie Turner Smith at the We Matter x Limitless Mental Health dinner in LA\n02/06/25 23:29The British singer, 34, looked nothing short than sensational in the halter-neck animal print garment enhancing her very toned frame.Will Smith slammed over shocking treatment of crew on new music video\n23/05/25 21:02The 56-year-old entertainer is facing a protest by the International Alliance of Theatrical Stage Employees at Quixote Studios in West Hollywood on Friday according to THR.Will Smith's comeback album 'flops' as his first record in 20 years sells very few copies in the wake of the Chris Rock Oscars slap scandal\n12/04/25 08:42Last month, the actor and rapper, 56, released his latest record Based On A True Story, but despite his superstar status, the album only sold 268 copies in its first week in the UK.Nikki Glaser, 40, flaunts her fantastic figure in skintight dress amid claims she is on Ozempic\n01/04/25 14:01The 40-year-old comedian hung out backstage at the Beacon Theatre in NYC on Monday with Amy Schumer, Chris Rock, Drew Barrymore, and Adam SandlerEd Sheeran sits courtside alongside Ciara and Chris Rock to watch New York Knicks take on Los Angeles Clippers at Madison Square Garden\n27/03/25 08:49The singer-songwriter, 34, was joined by the likes of fellow music artist Ciara and comedian Chris Rock in getting a courtside view of the Clippers defeating the Knicks 126-113.Stephen Graham's height revealed after his starring role in Netflix's Adolescence: Scroll through our graphic to see the heights of 400 famous figures, past and present...\n22/03/25 08:42Serial Bafta nominee Graham broke into the film industry in 2000, playing Tommy in Guy Ritchie's Snatch. Six years later he had another breakout rule as racist skinhead Combo in This is England.Hollywood stars call on Donald Trump to make AI pay for their work amid tech row\n20/03/25 00:24Cate Blanchett, Ben Stiller, Chris Rock, Phoebe Waller-Bridge and Bette Midler are among 400 actors, film-makers, writers and musicians urging his administration to resist lobbying by Silicon Valley.Emily Ratajkowski flaunts her jaw-dropping figure in a skimpy metallic co-ord while partying it up at Carnival in Brazil\n06/03/25 09:23Emily Ratajkowski flaunted her incredible figure as she celebrated Carnival in Rio de Janeiro, Brazil, on Wednesday.Emily Ratajkowski shows off her jaw-dropping figure in a patterned bikini as she soaks up the sun on the beach in Brazil\n05/03/25 15:32Emily Ratajkowski flaunted her incredible frame as she took to Instagram on Wednesday while on vacation in Brazil.Oscars ratings revealed amid woke nominees, Demi Moore's shock snub, and being dubbed most boring ceremony ever\n04/03/25 19:56The 97th Academy Awards hit a five year high at 19.96million viewers across both ABC and Hulu according to Nielsen's final same-day ratings which includes streaming.Whoopi scores $40k goodie bag and notorious rapper parties with bevy of women: Behind the scenes on Hollywood's glitziest weekend\n03/03/25 22:02DailyMail.com can reveal behind-the-scenes of Hollywood's most luxurious gifting lounges and parties were stars like Whoopi Goldberg and Chris Brown were spotted.Emily Ratajkowski, 33, flashes underwear in see-through dress as she flirts with Chris Rock, 60, at Oscar party\n03/03/25 16:31Not only did the Gone Girl star stun in a see-through lace dress that showed off her tiny black underwear, but she also got some one-on-one time with a big male star.Most controversial Oscar's moments ever - from THAT Will Smith slap to Angelina Jolie's kiss with her brother\n02/03/25 11:16Here, FEMAIL reveals the most shocking and controversial Oscars moments in the show's long history.Bill Murray, 74, arrives to Chris Rock's birthday hand-in-hand with much younger mystery woman after he shocked fans with Kelis, 45, romance\n17/02/25 12:56The Ghostbusters star, 74, was among the stars who headed to the Crane Club in New York City to celebrate at the comedian's 60th birthday bash.Kim Kardashian shows ex Pete Davidson what he's missing in nude look at party after he scrubbed tattoo tribute to her and kids\n16/02/25 23:21The reality star worked a curve-clinging look paired with a fur coat as she headed to the celebrations, held at the Crane Club in the Big Apple.Madonna looks fantastic with no filters as she heads to Chris Rock's 60th birthday party\n16/02/25 21:05Madonna looked fabulous on Saturday night as she headed to Chris Rock 's 60th birthday celebration. The event marked the rare occasion of Madge being seen without filters applied to the photos.Cher, Madonna, and Anya Taylor-Joy bring the star power to Chris Rock's 60th birthday bash in NYC\n16/02/25 20:59Cher, Madonna and Anya Taylor-Joy were just a few of the star-studded guests that helped celebrate Chris Rock's 60th birthday on Saturday in New York City.SNL vet Siobhan Fallon Hogan reveals the cast member who would apologize in church after raunchy skits\n16/02/25 19:21Siobhan Fallon Hogan revealed the identity of an SNL cast member who would go to church and apologize after taking part in raunchy skits on the sketch comedy series.Will Smith attends Grammys WITHOUT Jada after bizarre marriage arrangement exposed\n03/02/25 03:20Will Smith hit the red carpet at 2025 Grammy Awards, without his significant other Jada Pinkett Smith.Will Smith to make surprise appearance at 2025 Grammys 3 years after shock Oscars slap\n31/01/25 20:10Will Smith is set to make a surprise appearance at the 2025 Grammys Sunday, three years after he slapped Chris Rock onstage at the Oscars.Burger expert reveals his top favorite fast food burgers in the US\n27/01/25 11:45America's foremost burger expert has revealed his surprising pick for the best fast-food burger in the country.America's foremost burger expert reveals his surprising favorite fast food burger\n27/01/25 02:24America's foremost burger expert has revealed his surprising pick for the best fast-food burger in the country.Celebrity dating app Raya's clients are a deadly secret kept by the elites. But I managed to infiltrate it... and you'll never guess which A-listers popped up\n13/01/25 12:08I hadn't expected to strike gold so swiftly. There on my phone was a picture of one of the world's best-known and best-looking comic actors.Vin Diesel breaks silence on Dwayne 'The Rock' Johnson feud rumors in shock post\n07/01/25 20:59Vin Diesel has broken his silence on feud rumors with Dwayne 'The Rock' Johnson which were reignited at Sunday's Golden Globes.Chris Rock sparks plastic surgery speculation after SNL hosting gig\n15/12/24 19:56Chris Rock returned to Saturday Night Live as a host for the fourth time, and had a lot to say about current affairs, but many viewers were were focused on the funny man's appearanceChris Rock's savage five-word commentary on UnitedHealthcare CEO assassination shocks SNL audience\n15/12/24 08:29Chris Rock offered brutal, five-word commentary about UnitedHealthcare CEO, Brian Thompson's, assassination during his opening monologue while hosting the latest episode of SNL.Adam Sandler makes SURPRISE cameo on SNL with host Chris Rock as fans go wild\n15/12/24 07:28Adam Sandler, 58, sent fans wild as he made a surprise cameo during the latest episode of Saturday Night Live alongside host Chris Rock.Chris Rock stuns SNL audience with brutal Bill Clinton dig as he savages anti-Trump liberals\n15/12/24 06:42Chris Rock delivered a sharp and hilarious SNL monologue, skewering both sides of the political aisle with biting humor. He took aim at Bill Clinton's scandals and Donald Trump's controversies.Somber Chris Rock seen for first time since 'storming out' of his comedy set at billionaire's holiday party\n10/12/24 17:55Chris Rock looked somber as he was seen for the first time Monday since 'storming out' of his comedy set at a billionaire's holiday party.Chris Rock 'storms out' angrily in the middle of his comedy set at billionaire's holiday party\n09/12/24 08:15The comedian was reportedly and seemingly upset by being videotaped so he 'stormed out' just minutes after he took the stage Anthony Pratt's winter holiday party.Paul Mescal promotes his upcoming hosting debut on Saturday Night Live alongside musical guest Shaboozey\n06/12/24 07:44The 28-year-old actor appeared in two short clips ahead of the episode set to air on NBC this upcoming weekend and be later available to stream on Peacock.Are YOU taller than Gary Barlow's son? See how you stack up with our interactive graphic which reveals heights of 400 famous figures, past and present\n08/11/24 14:2424-year-old Daniel went unexpectedly viral after social media users seized on a sweet family photo of him towering over his 5ft 7in Take That star father.Angelina Jolie is seen chatting up Brad Pitt's friend Chris Rock at her NYC fashion event\n18/10/24 16:27Angelina Jolie was seen spending time with fellow actor Chris Rock on Thursday evening. Chris and Brad Pitt, her ex, have been friends for many years.How Liam Payne's toe-curling gaffes have shattered his charming One Direction image\n10/10/24 07:18The Wolverhampton-born singer, 31, has made a series of toe-curling appearances in recent years, leading fans to liken him to Ricky Gervais's cringeworthy character from The Office.Wild video of Jaden Smith angry in Paris more than two years after dad Will Smith's Oscars slap\n02/10/24 22:50The Malibu, California native's ex-girlfriend Sab Zada, 25, was also pictured speaking with him and amid a group of friends during the outing.Oprah Winfrey recreates popular talk show for one night with Kamala\n20/09/24 10:00Oprah Winfrey recreated her popular talk show for one night only to assist Vice President Kamala Harris in winning the White House.Oprah packs Kamala Harris event with A-listers including Jennifer Lopez, Meryl Streep and Bryan Cranston and highlights 'preventable' abortion death and school shooting victim\n20/09/24 00:24Oprah Winfrey recreated her popular talk show for one night only to assist Vice President Kamala Harris in winning the White House.Jude Law reveals he gorged on 'late night pasta and ice-cream' for his 'extreme' transformation into a bloated Henry VIII as he reflects on THAT 'upsetting' Chris Rock jibe\n07/09/24 21:17The Closer actor, 51, revealed his metamorphosis for the role was his 'most extreme transformation yet', while also reflecting on some of the lower moments of his career.How tall are YOU compared to Hollywood heart-throbs, world leaders, sports stars and tech tycoons? Find out with our ultimate interactive graphic of more than 400 famous figures, past and present...\n23/08/24 11:31Ever wondered just how tall Kim Kardashian is? Or how the TV personality compares to the rest of her perfectly groomed Kardashian-Jenner clan? Well, ponder no more.Has Burning Man burned out? Unprecedented move by festival organizers suggests desert party is struggling after 2023 washout nightmare\n07/08/24 12:30Tickets are still available for the August 25 event even if you haven't registered. In previous years tickets would not still be up for grabs this close to the start date.Will Smith returns to the stage with new song at BET Awards as he continues career resurgence in first show appearance since Chris Rock slap\n01/07/24 05:48Will Smith took over the stage at the BET Awards on Sunday in his first major solo performance since the infamous Oscar slap. delivered an uplifting rendition of his new song You Can Make It.That's a laugh: Pope Francis meets with comedians Whoopi Goldberg, Jimmy Fallon, Julia Louis-Dreyfus, Chris Rock and more in warm-up act to his sitdown with Biden\n14/06/24 10:34Pope Francis hosted more than a 100 comedians at Vatican City on Friday morning in a warm up act to his meeting with President Joe Biden at the G7 later in the day.Hollywood comedy icon unleashes five-minute rant against Will Smith in scathing radio interview two years after THAT Oscars slap: 'Utter fraud'\n12/06/24 00:51American comedian Rob Schneider has brutally slammed actor Will Smith in a scathing interview, labelling the Hollywood star a 'liar' and an 'a**hole'.Will Smith's Bad Boys: Ride or Die grabs impressive $5.9M in box office previews... two years after his infamous Oscar slap\n08/06/24 00:26Will Smith and Martin Lawrence's Bad Boys: Ride or Die turned the lackluster as of late box office around with $5.9 million in Thursday night receipts on 3,339 screens.Rage on the red carpet! After Kelly Rowland's outburst at Cannes, we reveal the biggest outbursts when A-list tempers were running high at glitzy events\n23/05/24 09:40Kelly Rowland made headlines as she appeared to furiously scold a security guard at Cannes on Tuesday - but she's not the only celebrity to have lost their temper on the red carpet.Star Wars creator George Lucas throws epic bash for his 80th birthday at Skywalker Ranch... with Steve Martin MCing and performances by Alicia Keys, Jon Batiste and more\n21/05/24 06:04George Lucas held a huge birthday bash to celebrate turning 80 years old, with some of the biggest stars in the world showing up.Will Smith calls estranged wife Jada Pinkett Smith one of his 'ride-or-dies' - despite secret seven-year separation\n16/05/24 18:47Will Smith knows he can always count on his wife Jada Pinkett Smith, despite making the decision to secretly separate in 2016.Mark Ronson and Grace Gummer cut stylish figures in all-black ensembles as they lead the stars at glitzy Invasive Species opening night\n16/05/24 04:41Mark Ronson and Grace Gummer look more loved-up than ever as they attended the opening night for Invasive Species on Wednesday. They led the stars at The Vineyard's Dimson Theater.Will Smith's 'guards take down a trespasser at his LA home' until police make arrest... 3 months after wife Jada Pinkett Smith scared off intruders\n07/05/24 15:58On Wednesday, police responded twice to calls from Will Smith's Los Angeles home, where a trespasser made his way onto the grounds and was subdued by the actors' guardsJeff Ross speaks out after Tom Brady told him 'don't say that s**t again' following Robert Kraft joke at Netflix roast\n07/05/24 00:02Jeff Ross insists Tom Brady was not angry with his jibe about Robert Kraft - despite the NFL legend appearing to snap at him during Sunday's Netflix roast. 'Don't say that s**t again,' Brady said.Why you won't see Will Smith on the red carpet or on late night tv to promote his latest blockbuster Bad Boys: Ride or Die\n30/04/24 14:32DailyMail.com can reveal that Will Smith has refused to participate in any press for his upcoming film.Serena Williams' childhood home where she learned to play tennis will be seized to settle her stepmom's $600K debt - as years-long bankruptcy battle nears conclusion\n28/04/24 14:07Serena Williams' $1.4million Palm Beach childhood home where her father taught her to play tennis will be seized to settle her stepmom's $600k debts after her bankruptcy bid failed.8 Netflix shows with a perfect Rotten Tomatoes score you need to watch\n24/04/24 16:00Thanks to Rotten Tomatoes, MailOnline have found 8 Netflix shows that scored a whopping 100% on the site, so now you know what to watch first...Nicole Brown's sister says she 'knows' OJ Simpson was guilty but has 'forgiven' him - as she insists she doesn't want her sibling remembered as a 'victim'\n23/04/24 15:45Prior to OJ's death from cancer two weeks ago, Tanya Brown, 52, spoke to UK magazine Closer about her older sister's tumultuous relationship with the fallen football star.Elle Fanning and boyfriend Gus Wenner cheer the New York Knicks to a late victory at Madison Square Garden as actress enjoys a date night while filming Bob Dylan biopic\n23/04/24 10:39The Greenwich Village folk scene played second fiddle to the New York Knicks on Monday evening as Elle Fanning visited Madison Square Garden with Gus Wenner.Selena Gomez puts on a loved-up display with boyfriend Benny Blanco and chats with Sting at star-studded New York Knicks game\n23/04/24 07:58The couple looked in good spirits as they sat courtside next to musician Sting who chatted with Selena during the game.Knicks' long-rumored LeBron James 2010 recruitment video surfaces showing Donald Trump, Harvey Weinstein, Chris Rock, Robert De Niro, and the Soprano's James Gandolfini urging 'The King' to come to New York\n17/04/24 16:54The long-rumored video produced by the New York Knicks in 2010 to entice LeBron James to sign in the Big Apple has finally surfaced, showing everyone from Donald Trump to Tony Soprano.Will Smith brings back memory-wiping Men In Black character during surprise performance at Coachella... for first gig since THAT slap\n15/04/24 06:52Will Smith returned to the Coachella stage on Sunday in Indio, California, as he joined J Balvin for a surprise performance of his song Men In Black.Sacha Baron Cohen looks sombre as he leaves SNL afterparty in NYC following split from Isla Fisher and surfacing of Rebel Wilson allegations\n14/04/24 10:40Sacha Baron Cohen looked sombre as he stepped out in New York City on Saturday to head to the SNL afterparty - days after his split from wife Isla Fisher was revealed.Will Smith sidesteps question about $350M net worth after shuttering flailing charity two years after his infamous slap of Chris Rock at Academy Awards\n27/03/24 22:53The Oscar-winning actor, 55, was asked if a reported $350 million net worth gleaned via a Google search was accurate.Will and Jada Smith's charity tanks after Oscars slap debacle taking in just $365,000 in 2022 - compared to more than $2MILLION the year before\n27/03/24 01:25In the aftermath of Oscar slap-gate, Will and Jada Smith's charity seems to be shuttering.Will and Jada Pinkett Smith are shutting down their charity after donor exodus spurred by his shock Oscars slap led to 83 PERCENT revenue drop\n26/03/24 23:51Variety also reported that Will and Jada Pinkett Smith's charity had $3,000 in overdraft fees and seemingly had no paid staffers in 2022.Will Smith gets speeding ticket for going 63mph in a 45mph zone on dangerous stretch of Malibu highway where 58 people have died in past 14 years\n26/03/24 16:00Will Smith felt the need for speed on Friday night as he drove down the Pacific Coast Highway in Malibu. The Hitch star, 55, was clocked going 63 in a 45mph speed limit zone.Kevin Hart honored in Washington, D.C. for lifetime achievement in comedy where Chris Rock warns of 'dark days' if Trump wins in 2024\n25/03/24 03:41Comedians descended on Washington, D.C. as Kevin Hart was honored Sunday evening at the Kennedy Center. for a lifetime achievement award in comedy.Kevin Hart makes RARE appearance with all four of his children alongside wife Eniko as he is honored with Mark Twain Prize For American Humor\n25/03/24 03:17Kevin Hart had his family by his side at the 25th Annual Mark Twain Prize For American Humor event on Sunday. Kevin was honored with the prestigious award at the star-studded event.Diana Ross set to celebrate her 80th birthday 'with a party to remember' and have the ultimate A-list guest list... topping her iconic 75th bash\n24/03/24 18:56The Supremes icon, 79, set the bar high with her 75th birthday bash in 2019 - which saw Beyoncé sing Happy Birthday, whilst Diana performed a private concert featuring five wardrobe changes.Taylor Swift and Travis Kelce's post Eras Tour plans REVEALED: Couple are reveling in having NO commitments and plan to 'play house as a normal couple' - after celebrating end of singer's latest concert run by partying with Madonna\n13/03/24 16:30The pair's relationship kicked off at a busy time during both of their careers, leading the couple to jet back and forth in order to squeeze in some quality time amid their hectic schedules.Whoopi Goldberg is left SEETHING after The View CUTS OFF her Oscars commentary, as co-host Ana Navarro sparks outrage by comparing Will Smith to viral dog Messi and joking about Eva Longoria's 't**ties'\n11/03/24 18:28Whoopi, 68, was sharing her opinions about some of the Academy Award winners from when the Oscars music started playing, which stopped the furious Sister Act star in her tracks.Taylor Swift and Travis Kelce DID hit Oscar night! The lovebirds 'were seen at Madonna's Oscars afterparty' alongside Salma Hayek and Chris Rock\n11/03/24 16:23Taylor Swift and Travis Kelce brought their red-hot romance to the Oscars afterparties on Sunday. The couple made an appearance at Madonna 's exclusive soiree in the Hollywood Hills.The fakest acceptance speech... a lip-sync flop... fashion freak shows... and truck loads of abhorrent anti-Israel hate! MAUREEN CALLAHAN slams the worst Oscars EVER and pleads: When will the incessant Barbie hysteria finally end?\n11/03/24 16:21The evening turned into a Barbie-fest, some sort of weird apologia for snubbing (rightly!) star Margot Robbie and director Greta Gerwig. It was a glorified infomercial for Mattel.Chris Rock takes daughters to dinner after hitting a pre-Oscar party... 2 years after that infamous SLAP which got Will Smith banned from the Academy Awards\n10/03/24 18:49Chris Rock took his daughters Lola, 21, and Zahra, 19, to dinner on Sunday. The proud dad and his kids were seen leaving celebrity hot spot Giorgio Baldi in Santa Monica.Full list of celebrities banned from the Oscars 2024 - including Will Smith following infamous Chris Rock slap\n10/03/24 15:49A full list of celebrities that have been banned from the Oscars 2024 has been released in preparation for Sunday's 96th awards ceremony. Will Smith was banned for 10 years after he slapped Chris Rock.\nPage\nDON'T MISS\n-\nHeartbroken David and Victoria Beckham fear Brooklyn has 'quit the family' after failing to invite ANY of his relatives to vow renewal with Nicola Peltz\n-\nEXCLUSIVE\nCat Deeley is snapped for the first time since her shock split from husband Patrick Kielty... with a male friend in Spain\n-\nTopless Nicola Peltz, 30, poses with her ageless mother Claudia, 70, as she shares a glimpse into the morning before she renewed her vows\n-\nEXCLUSIVE\nOlivia Rodrigo ENGAGED? Singer flashes huge new diamond ring on THAT finger... after romantic home tour with Brit actor boyfriend\n-\nCristiano Ronaldo forked out eye-watering seven-figure sum on model Georgina Rodriguez's incredible diamond engagement ring\n-\nEXCLUSIVE\nThe Yorkshire Vet's Matt Jackson-Smith reveals how to care for your dog as they grow up, and his dog Harry's VERY unusual traits\nAd Feature\n-\nStacey Solomon wows in plunging black bikini as mother-of-five enjoys luxury family holiday and admits she felt 'beautiful' in stunning snaps\n-\nInsiders tell KATIE HIND what 'furious' ITV production staff REALLY think of the 'rubbish' household names who are escaping jobs bloodbath\n-\nMoment Christine McGuinness shares doubts over joining Celebs Go Dating as she panics 'this isn't normal' before quitting the show\n-\nSmart moves: The 10 must-know education brands helping the UK learn better and faster\nAd Feature\n-\nOasis' future after their string of reunion gigs end 'revealed' as Gallagher brothers are flooded with performance opportunities\n-\nJoshua Jackson sparks romance rumors with Bridgerton star two years after dramatic divorce from Jodie Turner-Smith\n-\nAngelina Jolie is the latest Hollywood star planning to sell up and LEAVE LA... as she plots sale of 'historic' home\n-\nEDEN CONFIDENTIAL: Erin finds the jewel in her Crown - a new leading lady\n-\nThe stars of the much-loved Wittering Whitehalls podcast on how a hearing check has changed their relationship\nAd Feature\n-\nS Club 7's Jon Lee, 43, reveals he hasn't had sex in SIX years on Celebs Go Dating after 'traumatic' dating past\n-\nChris Hemsworth celebrates 42nd birthday in Ibiza with star-studded bash - while wife Elsa Pataky looks downcast as she shops alone in Australia's Byron Bay\n-\nNicola Peltz wears her mother's dress in secret vow renewal officiated by her father Nelson... while David and Victoria are thousands of miles away\n-\nKylie Jenner shows Timothée Chalamet what he's missing as she posts sexy snaps after birthday snub amid split rumors\n-\nEating for bump, and beyond! Pregnancy nutritionist reveals her top diet advice for those trying to conceive, pregnant, breastfeeding and baby nutrition\nAd Feature\n-\nCelebrity SAS star Lucy Spraggan breaks down in floods of tears after revealing horrifying rape ordeal during her time on the X Factor\n-\nI, Robot star hints at drama on Will Smith film after claiming his cyborg role 'tested higher' with audiences\n-\nEXCLUSIVE\nMyleene Klass' revenge wardrobe: Expert reveals how star is sending secret fashion signals amid Rochelle Humes 'feud'\n-\nKelly Clarkson's late ex-husband Brandon Blackstock is remembered in moving tribute by son after shock death from cancer\n-\nSip smarter this summer: Discover the 'Magic of Moderate Drinking' with these simple tips\nAd Feature\n-\nCristiano Ronaldo and Georgina Rodríguez are engaged! Footballer's fiancee reveals GIANT diamond ring\n-\nStrictly Come Dancing 2025: Love Island winner, Doctor Who star and footballing legend confirmed to take part in the competition\n-\nEd Westwick and his wife Amy Jackson pack on the PDA in swimwear-clad snap as they share a look at their family holiday to Italy\n-\nLiam Hemsworth and Gabriella Brooks spark engagement rumours after actress flaunts diamond ring in Ibiza\n-\nGet set for a totally WICKET summer: The Hundred is rolling into cities across the UK - this is how YOU and your family can join the fun\nAd Feature\n-\nEXCLUSIVE\nRita Ora's husband Taika Waititi wears tone-deaf T-shirt on star-studded Ibiza trip for Chris Hemsworth's birthday\n-\nMaya Jama shows off her incredible bikini body as she parties with AJ Odudu on 24 hour trip to Ibiza\n-\nJennifer Lopez shows off famous derriere in sultry snaps after Ben Affleck romance\n-\nBrad Pitt burglary suspects arrested after cops link separate heist to A-lister's home break-in\n-\nFrom spending when you're abroad to absolutely smashing the preparation and packing, we reveal how to holiday like a pro\nAd Feature\n-\nCelebrity SAS Who Dares Wins axes ex army corporal for 'lying and cheating' on the show - resulting in an explosive row\n-\nPrincess Andre tipped to become the UK's answer to Kylie Jenner with her budding career as a makeup mogul\n-\nMaura Higgins shows off dramatic living room makeover after moving into her 'dream' £1.25m Essex mansion\n-\nZoe Ball's famous dad Johnny says her relationship with her ex-husband Fatboy Slim is better than ever\n-\nFrom Icelandic waterfalls to Japanese tea ceremonies: The new cruise collection that promises adventure as well as ultra-luxury\nAd Feature\n-\nTaylor Swift fans go wild after Empire State Building 'stunt' hints at new music from singer\n-\nEXCLUSIVE\nMatt Damon almost goes overboard on boozy Ibiza trip with star-studded group for Chris Hemsworth's birthday\n-\nKelly Clarkson's ex-husband Brandon Blackstock's cause of death confirmed after passing aged 48\n-\nPeter Andre's manager Claire Powell's glow-up 16 years on as she gives advice to his daughter Princess on her show amid Katie Price's comments\n-\nThe Bear's Jeremy Allen White displays his chiseled physique as he cools off on the beach\n-\nJennifer Aniston and Gwyneth Paltrow still gossip about their mutual ex Brad Pitt\n-\nLIZ JONES: Like Katie Price I transformed myself with surgery, went bankrupt and dated terrible men. But there's one key difference between us\n-\nGethin Jones announces the death of his father as the TV star pays an emotional tribute and is flooded with supportive messages\n-\nCHRISTOPHER STEVENS reviews Celebs Go Dating on E4: Television hits the most wretched abyss with this atrocity of a series\n-\n'There's a part of me that thinks this is better': Jennifer Aniston is glad Matthew Perry is 'no longer in pain' and says she mourned Friends co-star for a 'long time'\n- EXCLUSIVE She was a silver screen siren of the 70s and ex-wife of a Hollywood icon, but is unrecognisable as she walks her dogs...can you guess who?\n-\nNetflix back away from Harry and Meghan with new deal, on worse terms: Sussexes sign 'first-look' agreement after shows flopped\n-\nKelly Clarkson breaks down in tears on stage singing poignant song just days before ex-husband's death was announced\n-\nEXCLUSIVE\nMeghan Markle and Prince Harry's new Netflix deal 'IS a downgrade' and more like a 'we'll call you' than 'here's the chequebook', experts say\n- After FOUR years of menopause struggles I took a chance on this supplement - now I'm sleeping better and finally feeling more like myself SHOPPING\n-\nTerry and Heather Dubrow take a major financial hit as they finally offload their Beverly Hills mansion\n-\nEmma Stone reveals heart-wrenching reason she cried before shaving her head for new role\n-\nGwyneth Paltrow, 52, shows off her VERY fit physique after sharing exercise secrets\n-\nWoke Bravo star claims 'fat' Trump voters should be banned from Mexican restaurants in explosive rant\n-\nNew Rambo star is FINALLY revealed... and it's not the successor Sylvester Stallone wanted\n- The 'liquid gold' facial tanner that fights ageing and has beauty fans obsessed: 'Best tanning drops EVER!' (now 20% off, but not for long) SHOPPING\n-\nMyleene Klass is accused of brutally 'ghosting' a close friend for contacting her ex-husband Graham Quinn - days after he ended their six-month marriage\n-\nKylie Jenner skips over-the-top Kardashian birthday bash for intimate party with homemade cake and kids\n-\nEXCLUSIVE\nRobin Thicke swarmed by female fans as he serenades crowd at Hamptons event following honeymoon with April Love Geary\n- Pet owners love this dog food subscription service for better fur, skin and health - and it costs just 89p a DAY (plus it's 40% off right now) SHOPPING\n-\nMusic icon stops concert to shame parent for 'irresponsible' act in front of crowd of 26,000 fans\n-\nEXCLUSIVE\nMy dad and I were jailed for running an illegal steroid lab together and brawled in the courtroom - I can't believe how he betrayed me\n-\nEXCLUSIVE\nThe Chase star Mark Labbett's ex Hayley Palmer gives her verdict his Celebs Go Dating debut following their 'traumatic' relationship\n-\nKatie Price, 47, seen for the first time since tweaking SIXTH face lift - as she recovers in Turkey after Princess, 18, revealed she would never turn to surgery like her mum\n- These 'DELICIOUS' cupboard-ready meals make nutritional eating quicker and easier than ever (and we have an exclusive deal) SHOPPING\n-\nJaw-dropping moment TOPLESS Katie Price derails Princess Andre's reality show - as teen screams 'no mum I'm filming!' and admits 'she's so unpredictable'\n-\nNelly Furtado's life as body positivity pin-up: How embracing her 'new silhouette', and becoming a mum again in her 40s has earned star, 46, 'icon' status\n-\nLiam Payne's ex Sophia Smith marries James Bridgwood as she stuns in a chic highneck gown during lavish London ceremony\n-\nRebecca Loos shoots down Richard Madeley on Good Morning Britain as they clash over David Beckham - swiping 'we don't need to talk about this'\n-\nA Place In The Sun's Laura Hamilton, 43, defiantly shows off her figure in blue swimwear after hitting back at trolls insisting she is 'too old to wear a bikini'\n-\nMeghan Markle has awkward Kardashians moment as she gifts As Ever merch to stars... who fail to acknowledge her\n-\nJennifer Aniston breaks silence on terrifying gate-crashing stalker: 'People are out of their minds'\n-\nFatboy Slim's Hove beachfront cafe slammed for his 'crazy' prices and 'shocking' waiting times\n-\nLorraine star reveals GP son was held at knifepoint in 'terrifying' ordeal at work - pleading 'it needs to stop' and begging for 'more protection'\n-\nBritish actor looks unrecognisable as he watches Oasis at Wembley with musician Tom Grennan - but can you guess who it is?\n-\nMolly-Mae Hague's sister Zoe totes £7K Chanel handbag as she heads to the gym weeks after being mocked for leaving Bali after 48 hours\n-\nPrincess Andre thought she'd be KILLED during 2018 carjacking - as she watched in horror while mum Katie Price was 'touched up' and made heart-wrenching plea\n-\nHulk Hogan's ex-wife Linda pays tribute to late wrestling icon on his birthday: 'Love and miss you so much'\n-\nMark Wright gives rare insight into family holiday with 5 month-old daughter Palma as he reveals 'disappointment'\n-\nShakira unleashes her inner She Wolf! Love Island's Khan sends fans wild as she shares VERY steamy bedroom snap with Harry Cooksley\n-\nKate Garraway's gorgeous floral midi dress is a must have for summer - and we've found it on sale with 50% off\n-\nGregg Wallace addresses claims he 'took his trousers down' on set of MasterChef - after being sacked in wake of inquiry into alleged misconduct\n-\nSam Thompson is forced to break news of his split from Zara McDermott to Jamie Lee Curtis after Hollywood star tipped the pair for marriage\n-\nLove Island stars send fans wild as they fuel romance rumours with telling Instagram snap in the same place: 'Definitely not a coincidence!'\n-\nLove Island's Arabella Chi shows off her figure in a crochet bikini in Palma just three months after welcoming baby daughter\n-\nBikini-clad Stacey Solomon addresses husband Joe Swash's whereabouts as they enjoy a family holiday at a swanky £1k-per-night hotel in Turkey\n-\nBombshell announcement Taylor Swift fans think singer will make in rumored appearance on Travis Kelce and brother Jason's podcast\n-\nOlivia Attwood reveals the bloody and bruised results of her latest beauty procedure after having fish DNA injected into her face\n-\nOne Direction fan caught up in Zayn Malik 'cheating' scandal finally breaks her silence - 13 years after leaked footage of their 'booty call' went viral\n-\nAdrian Thrills reviews The Black Keys' new album No Rain, No Flowers and finds the Ohio duo moving away from their fling with funk\n-\nTaylor Swift fans are CONVINCED she will announce next album on Travis Kelce's podcast after teasing 'new era'\n-\nI was branded 'the ugliest in the family' from nine years old - sick trolls mocked me for having a flat chest, admits Princess Andre in ITV documentary\n-\n'It felt like I was up there for everyone's entertainment': Tulisa claims a police officer mimed oral sex gestures at her when she was on trial for drug sting\n-\nEXCLUSIVE\nBlonde bombshell best known for playing a Bond Girl is seen on a rare outing... can you guess who?\n-\nLisa Rinna's daughter Amelia Gray DENIES promoting anorexia after sparking concern over 'skeletal' frame\n-\nLove Island's Dejon Noel-Williams breaks his silence over 'exposé' book - as he admits to 'questioning why people would do these things'\n-\nLottie Moss sets pulses racing in a skimpy leopard print bikini as she poses for sizzling snaps amid sun-soaked Spanish getaway\n-\nBBC axes beloved celebrity talk show after eight series - as broadcaster pays tribute to 'hardworking' host and admits cancellation was 'a difficult decision'\n-\nCynthia Nixon braves a dip in the Irish sea as she gives an insight into her travels with wife Christine Marinoni\n-\nMel B gushes her second wedding to husband Rory McPhee 'exceeded her expectations' after tying the knot in three-day ceremony in Morocco\n-\nMachine Gun Kelly offers dramatic three-word response to THOSE Sydney Sweeney dating rumors\n-\nTaylor Swift fans in meltdown as Travis Kelce and brother Jason tease singer will appear on their podcast\n-\nDenmark's party prince! Future King, 19, is caught smooching daughter of former Army captain at music festival\n-\nGeorgia May Foote slips into brown workout gear as she heads to the gym amid reports she and husband Kris Evans are 'headed for divorce'\n-\nFury over Katy Perry music video filmed in protected area without permission - as authorities in Majorca issue fine\n-\nLove Island besties Toni Laites and Shakira Khan put on a VERY racy display as they passionately kiss on a pool table in raunchy clip\n-\nCountry music star Spencer Hatcher's mother is stabbed to death in horrific home invasion\n-\nHot socialite summer! Lady Mary Charteris parties the night away with Lady Lola Bute, Lila Moss, Rita Ora's husband and Charlotte Tilbury\n-\nHit horror series with Hollywood A-lister AXED - as devastated fans fume 'how could they?!'\n-\nHalle Berry's ex is skewered by fans for saying he left her because she didn't cook, clean, or seem 'motherly'\n-\nShirtless David Beckham, 50, and wife Victoria, 51, continue soaking up the sun on their £16m superyacht amid lavish Italian getaway\n-\nRafael Nadal is a father for a second time! Tennis ace and wife Mery Perello welcome son as sweet meaning behind his name is revealed\n-\nMaya Jama displays her jaw-dropping figure in a skintight unitard as she runs last minute errands before jetting off to Ibiza\n-\nLily James hits back at Instagram moderators after her racy nude celebration is removed for breaching community guidelines\n-\nNicole Scherzinger sets pulses racing as she takes on Nicki Minaj pose challenge in a skimpy white bikini while balancing on a rock and sipping on a martini\n-\nThe moment that sparked Katie Price and Princess 'feud' as daughter makes modelling debut in Ibiza\n-\nMassive rock band announces long-awaited tour 20 years after hit song\n-\nAmelia Dimoldenberg reveals the A-list star who was her 'dream' Chicken Shop Date and opens up about her VERY flirty encounter with Andrew Garfield\n-\nAdam Rickitt shares news of heartbreaking family tragedy in emotional update\n-\nAnna Friel admits she was 'distraught' after being dumped by her first boyfriend Darren Day as she reveals his brutal move following split\n-\nKatie Price and ex Peter Andre's VERY public feud as daughter Princess reveals she sought counselling after realising her parents 'don't like each other'\n-\nPictured: Meghan Markle's California influence on Princess Eugenie's style - from '50 shades of beige' to Grecian draping\n-\nVictoria Beckham shares a snap of shirtless David as they holiday on the Italian riviera - after he was caught pinching her bottom during date\n-\n'Gutted' Lauren Goodger pulls out of scheduled This Morning appearance due to lack of childcare - as she shares sexy selfies from home instead\n-\nStrictly Come Dancing 2025's first star is REVEALED: Gladiators star Nitro set to compete in new series as the show battles a string of scandals\n-\nPamela Anderson's pickles will make Meghan green with envy! Fans go wild for Baywatch star's new product\n-\nBBC Breakfast guest slammed for 'harsh and disrespectful' swipe at late Blue Peter star Biddy Baxter - with shocked fans gasping 'he clearly wasn't a fan!'\n-\nFashion influencer gets slammed as she goes braless in 'hideous' designer dress\n-\nLucy-Jo Hudson showcases her incredible weight loss in before and after snaps following gruelling 30 day fitness challenge\n-\nWayne Lineker battles nerves ahead of his speech at daughter Tia's lavish wedding as she ties the knot with football manager Harry Agombar in Mallorca\n-\nEdinburgh Fringe luvvies claim 'Oasis effect' is 'catastrophic' as fans send hotel prices surging... and some moan they've been forced to live in cars\n-\nJames Whale's final words: Radio star said the past few months had been hard and expressed his sadness at missing Christmas in posthumous column\n-\nAaron Taylor Johnson's astronomical net worth revealed as actor becomes hot favourite to become the next James Bond after signing deal with 007 watch provider\n-\nSophie Turner hits back at critic that claimed she's 'forgotten' about her two daughters\n-\nKhloe Kardashian enjoys hamper from Meghan Markle's As Ever brand - as delighted Duchess reposts reality star's surprising social media shoutout\n-\nPrincess Andre's childhood trauma: Katie Price's daughter says she 'saw things kids shouldn't see' as she lays bare her mother's 'problems'\n-\nJenna Ortega looks quirky with bleached eyebrows as she promotes Wednesday in South Korea as series two of Netflix hit receives rave reviews\n-\nIsla Fisher and Kaitlyn Dever join pregnant Vanessa Hudgens as they lead the A-listers at star-studded event\n-\nHidden meaning in Princess Beatrice's husband Edoardo Mapelli Mozzi's birthday post for her as he takes inspiration from Prince William and Kate\n-\nPete Wicks admits he's 'in love' with a new woman six months on from his romance with Maura Higgins\n-\nBlue Peter icon Biddy Baxter dies aged 92: Tributes pour in for the 'pioneer' of children's television\n-\nNatalie Imbruglia and Delta Goodrem 'in talks to join cast of Strictly Come Dancing 2025' - as Gladiator Nitro is the first star announced\n-\nAlex Jones shares a kiss with husband Charlie Thomson as she celebrates 15 years on The One Show\n-\nKieran Hayler shows off new tattoo in Sellebrity Soccer match after Princess Andre laid bare her mother Katie Price's struggles following her split from the stripper\n-\nRebecca Loos breaks down in tears after being punched in the face in brutal Celebrity SAS boxing match - gasping 'f***ing hell!' and fighting for breath\n-\nLioness Ella Toone shows off her sparkling engagement ring as she celebrates her partner Joe Bunney's romantic beach proposal with pals\n-\nMaisie Smith breaks down in tears revealing Celebrity SAS moments 'worse than you can imagine' that were cut from 'brutal and torturous' show\n-\nRosie Huntington-Whiteley shows off her incredible figure in a white bikini top and TINY thong on the beach\n-\nVictoria Beckham shares a look at her family holiday as close-knit brood relax in St Tropez amid family rift - but Cruz isn't happy with one of her snaps!\n-\nMeghan Markle issues cryptic message about the UK as she teases As Ever update\n-\nJennifer Lopez's concert crashed by grasshopper as insect crawls up her NECK in nerve-wrecking moment\n-\nRochelle Humes 'gave Myleene Klass' ex-husband Graham Quinn a place to stay' following their split after she caught him 'cheating' with a celebrity\n-\nPaul Gallagher joins Oasis star brother Liam on Edinburgh-bound private jet ahead of looming court date after being charged with rape\n-\nMolly-Mae shows off her incredible figure in a black bikini while on family holiday in Turkey with boyfriend Tommy Fury and daughter Bambi\n-\nPrincess Andre says she 'hated' her appearance and fixated on her 'big nose' as she admits she doesn't have her mum Katie Price's confidence\n-\nCarmen Electra reveals risqué way Kim Kardashian has helped her turn heads\n-\nEXCLUSIVE\nPatrick Kielty's 'seething' family reveal heartbreaking moment they knew his marriage to Cat Deeley was over for good\n-\nLindsay Lohan looks fresh-faced as she visits Taronga Zoo with her rarely-seen husband Bader Shammas and their son in Sydney - and also brings the nanny\n-\nEXCLUSIVE\nMaura Higgins looks unrecognisable in a red wig and dramatic makeup as she poses for striking Original Magazine cover shoot\n-\nJacqueline Jossa shows her support for husband Dan Osborne at football match after Christine McGuinness texting accusations amid marital woes\n-\nIs Prince Louis following in Prince Harry's comedic footsteps? Royal shares a sense of humour with the Duke of Sussex and the late Queen\n-\nPeter Andre reacts to 'disgusting' online messages sent to daughter Princess, 18, by anonymous older men\n-\nGardener's World fans are moved to tears after star reveals his terminal cancer diagnosis during the show\n-\nDR MAX PEMBERTON: Meghan's deathly silence on Harry's woes says so much about their relationship. This is not what a successful marriage looks like..."
    },
    {
      "url": "https://www.dailymail.co.uk/tvshowbiz/will_smith/index.html",
      "text": "Advertisement\nRELATED TOPICS FOR Will Smith\nLatest Will Smith News on the Fresh Prince star\nPage\nMiley Cyrus' mom Tish reveals bizarre Hollywood conspiracy theory involving Will Smith\n16/07/25 18:07\nMiley Cyrus' mother Tish Cyrus revealed her belief in a head-scratching conspiracy theory during a recent chat with her daughter Brandi. The mother-daughter duo were guests on Harry Jowsey's podcast Boyfriend Material when Tish began to spout off an unorthodox belief about the secret geography of Los Angeles that managed to include a digression about Will Smith. 'Tell him about the LA tunnels,' Brandi instructed her mother in a tone that suggested she was sick of hearing about them....read\nWill Smith reminds fans he is approaching his 60s as he trades in his sports car for a very safe $275K SUV\n08/07/25 15:49Will Smith has an impressive car collection worth $4.5 million, according to some estimates. This week he chose his white Lamborghini SUV for an outing in Los Angeles.Insane new sport that America's richest sports stars are pumping MILLIONS into: 'Real life Star Wars'\n06/07/25 17:00Set amid the sun-soaked backdrops of the world's most beautiful maritime locations, the sport has become a magnet for the rich and famous.Will Smith takes aim at Chris Rock with savage Oscar slap lyric in cringey freestyle\n29/06/25 22:56The disgraced 56-year-old still seems internally divided on whether he's truly contrite or defiant over assaulting the 60-year-old comedian onstage in 2022Will Smith gives bizarre take on how that Chris Rock Oscars slap impacted his career as he reflects on authenticity and imperfection\n21/06/25 00:53The actor, 56, reflected on the incident - where he struck Chris, 60, on stage over a joke about his wife Jada Pinkett Smith's shaved head, which was due to her alopecia diagnosis.Will Smith reveals he turned down HUGE role in one of the greatest films of all time for box office flop Wild Wild West\n17/06/25 14:14Fans were left in shock after Will Smith revealed he turned down a role in one of the greatest science fiction movies of all time for a 1990s Western sci-fi movie.How to see your favourite musician for free: Meet the London DJ who ditched £60k a year sales job to bring the world's most famous artists to street gigs in the UK\n13/06/25 15:18DJ AG, real name Ashley Gordon, 39, is quickly making a name for himself in the UK's music scene by inviting famous faces to perform outside UK landmarks, including London's King's Cross.Will Smith cuts a smart casual figure in a textured knit polo as he parties with Jude Bellingham at Ibiza club\n04/06/25 10:51Will Smith took to Instagram on Sunday to share a slew of snaps from his fun night out with DJ Anyma and football star Jude Bellingham at Ibiza's brand new [UNVRS] nightclub.Kathy Griffin drags Will Smith for rude act as she reignites feud\n02/04/25 21:14Kathy Griffin appears to be reigniting her long-standing feud with Will Smith. The comedian, 64, claimed the actor gave her the cold shoulder when they worked together decades ago.Is Will Smith 'uncancelling' himself? Actor has been on a mission to rebuild his career with viral videos and a return to his Fresh Prince roots - three years after THAT Oscars slap\n22/03/25 13:31With a tour announcement, new music, and a few viral videos, the actor seems to be throwing himself back into the spotlight and attempting to make his Hollywood comeback.Stephen Graham's height revealed after his starring role in Netflix's Adolescence: Scroll through our graphic to see the heights of 400 famous figures, past and present...\n22/03/25 08:42Serial Bafta nominee Graham broke into the film industry in 2000, playing Tommy in Guy Ritchie's Snatch. Six years later he had another breakout rule as racist skinhead Combo in This is England.Will Smith left red-faced as he addresses social media criticism with former Fresh Prince co-star Tatyana Ali and says 'this is terrible'\n21/03/25 13:04The actor, 56, had already risen to recognition through his hip hop hits, but he got his screen breakthrough in 1990 playing a version of himself in popular NBC show The Fresh Prince Of Bel Air.Jeremy Clarkson ROASTS Will Smith in Top Gear clip as he mocks the Hollywood star's lyrics\n17/03/25 10:21Appearing on the Star In A Reasonably Priced Car segment of the show in 2015, Will, then 46, could hardly have expected the grilling he got from Jeremy, then 54, in front of Margot and a large audience.Most controversial Oscar's moments ever - from THAT Will Smith slap to Angelina Jolie's kiss with her brother\n02/03/25 11:16Here, FEMAIL reveals the most shocking and controversial Oscars moments in the show's long history.Celebrity couples' yearbook photos: From Tom Hanks and Rita Wilson to Harrison Ford and Calista Flockhart\n08/02/25 19:14They might be loved up and happily married now, but these eight celebrity couples were once just single high school students.Jackie Chan appears in good spirits as he puts in energetic appearance at Australian Open - after sparking health concerns with altered appearance\n25/01/25 14:36Jackie Chan appeared to be having an absolute ball on Saturday.The A-list of step parents! Celebrities who raise their 'bonus children' as their own amid a rise in blended families\n04/01/25 08:56The elite parenting club includes members of royalty, Hollywood and sport, as stars like Russell Wilson, Gabrielle Union and Princess Beatrice proudly show off their blended broodJada Pinkett Smith sparks health concern following rare date night with husband Will Smith\n10/11/24 22:41Jada Pinkett Smith has sparked concern among fans after a recent date night with husband Will Smith.Forget nepo babies, it's all about nepo dating! How the children of the rich and famous have turned to each other for love\n10/11/24 07:50It seems one criteria for the nepo baby clique is dating a fellow star - one thrust from the loins of a celebrity - as seen in the prestigious Hollywood unions on out listAre YOU taller than Gary Barlow's son? See how you stack up with our interactive graphic which reveals heights of 400 famous figures, past and present\n08/11/24 14:2424-year-old Daniel went unexpectedly viral after social media users seized on a sweet family photo of him towering over his 5ft 7in Take That star father.Will Smith pays an emotional tribute to Fresh Prince of Bel-Air producer Quincy Jones who died at 91\n05/11/24 04:05Will Smith paid an emotional tribute to his 'mentor', music mogul Quincy Jones in the wake of his tragic passing at age 91.Bizarre reason Will Smith and Phillip Schofield aren't getting divorced from their wives despite splitting up\n03/10/24 16:04Philip Schofield's loyal wife is one of a growing band of SNODs - people who are separated from their spouses but remain legally married, and intend to stay that way.Will Smith FARTING on set caused film crew to be evacuated for three hours - director claims\n02/10/24 23:55Barry Sonnenfeld, who directed the 1997 action comedy Men In Black, has opened up about what it was like working with Will Smith.Jaden Smith rocks quirky ensemble as he films a music video in NYC - after Khleopatre PDA following Sab Zada split\n26/08/24 06:35Jaden Smith made a style statement in a large, fluffy, purple hat as he stepped out in New York City over the weekend.How tall are YOU compared to Hollywood heart-throbs, world leaders, sports stars and tech tycoons? Find out with our ultimate interactive graphic of more than 400 famous figures, past and present...\n23/08/24 11:31Ever wondered just how tall Kim Kardashian is? Or how the TV personality compares to the rest of her perfectly groomed Kardashian-Jenner clan? Well, ponder no more.Will Smith, 55, surprises fans with a performance of his 1991 hit song Summertime as he joins singer Coco Jones, 26, on stage in Los Angeles\n02/08/24 19:29Will Smith has not released a full-length album in nearly 20 years, but on Thursday he took the stage in Los Angeles for a surprise performance of his 1991 hit song Summertime.Ioan Gruffudd debuts his shaved head as he and leggy fiancée Bianca Wallace cosy up at Bad Boys: Ride Or Die premiere in LA\n31/05/24 09:50Welsh actor Ioan Gruffudd, 50, normally sports a cropped mop of dark brown hair, streaked with grey.Lionel Messi delights fans as he speaks ENGLISH in new Bad Boys commercial alongside Will Smith and Martin Lawrence\n28/05/24 15:20Lionel Messi spoke English publicly for the first time ever when he made a brief appearance in a commercial for Will Smith and Martin Lawrence's new comedy flick, Bad Boys.Will Smith joins co-star Martin Lawrence on the red carpet in Berlin as they attend the European premiere of Bad Boys: Ride or Die\n27/05/24 20:57The actor teamed up with Martin once again for the fourth instalment of their franchise and looked in good spirits as he took to the red carpet with his co-star.Rage on the red carpet! After Kelly Rowland's outburst at Cannes, we reveal the biggest outbursts when A-list tempers were running high at glitzy events\n23/05/24 09:40Kelly Rowland made headlines as she appeared to furiously scold a security guard at Cannes on Tuesday - but she's not the only celebrity to have lost their temper on the red carpet.Will Smith and his estranged wife Jada Pinkett Smith are joined by Martin Lawrence at the world premiere of Bad Boys: Ride Or Die\n23/05/24 06:43Will Smith and his estranged wife, Jada Pinkett Smith, posed for several glammed-up photos during the world premiere of Bad Boys: Ride Or Die, which was held in Dubai.Wealthy 15-year-old who has taken ayahuasca FOUR TIMES says the drug helped him 'experience death' - and his parents encourage it\n19/05/24 17:36Alex Renko from Russia (pictured) decided to try ayahuasca to get a new perspective on life after dropping out of school at 12 years old. He is now dedicating his life to tripping with adults.Will Smith reveals how his Bad Boys: Ride or Die co-star Vanessa Hudgens' pregnancy impacted production on the action sequel\n17/05/24 04:29When Bad Boys: Ride or Die hits theaters next month, Will Smith and Martin Lawrence won't be the only established characters returning.Will Smith calls estranged wife Jada Pinkett Smith one of his 'ride-or-dies' - despite secret seven-year separation\n16/05/24 18:47Will Smith knows he can always count on his wife Jada Pinkett Smith, despite making the decision to secretly separate in 2016.Will Smith and Martin Lawrence make surprise appearance at early screening of Bad Boys 4 in Los Angeles\n16/05/24 06:43Will Smith and Martin Lawrence surprised fans at an early screening of the new Bad Boys sequel at a movie theater in Los Angeles this week.Jaden Smith and his model girlfriend Sab Zada match in hoodies and trainers for a casual date night\n14/05/24 09:16Jaden Smith enjoyed a date night at a West Hollywood restaurant with his girlfriend Sab Zada on Monday.Will Smith celebrates Mother's Day with the whole family in Malibu including wife Jada Pinkett Smith, mother Caroline, mother-in-law Adrienne and his three kids\n13/05/24 07:02Will Smith gathered his entire family for a huge Mother's Day celebration in Malibu on Sunday.Tom Brady was 'ready to shut his Netflix roast down' after THAT Jeff Ross massage joke... as comedian Andrew Shulz reveals why NFL legend was so furious\n09/05/24 16:44On Sunday, Brady publicly showed that he didn't approve of Ross' joke on Kraft 'liking' happy endings at the end of massages,' by going up to the podium and telling him to 'not do that s**t again.'Will Smith's 'guards take down a trespasser at his LA home' until police make arrest... 3 months after wife Jada Pinkett Smith scared off intruders\n07/05/24 15:58On Wednesday, police responded twice to calls from Will Smith's Los Angeles home, where a trespasser made his way onto the grounds and was subdued by the actors' guardsHollywood nepo babies Willow and Jaden Smith play it cool in edgy outfits at 2024 Met Gala\n07/05/24 04:20Willow Smith, 23, and her older brother Jaden, 25, wore color coordinated outfits on Monday to the 2024 Met Gala in New York City.Jeff Ross speaks out after Tom Brady told him 'don't say that s**t again' following Robert Kraft joke at Netflix roast\n07/05/24 00:02Jeff Ross insists Tom Brady was not angry with his jibe about Robert Kraft - despite the NFL legend appearing to snap at him during Sunday's Netflix roast. 'Don't say that s**t again,' Brady said.Willow Smith admits that she has 'a little bit of insecurity' about being branded a 'nepo baby' but adds now she 'doesn't have to prove s**t to anyone'\n03/05/24 00:42Willow Smith is adding to the growing ongoing conversation swirling around Hollywood about 'nepo babies' as the daughter of Will Smith and Jada Pinkett Smith.Why you won't see Will Smith on the red carpet or on late night tv to promote his latest blockbuster Bad Boys: Ride or Die\n30/04/24 14:32DailyMail.com can reveal that Will Smith has refused to participate in any press for his upcoming film.Serena Williams' childhood home where she learned to play tennis will be seized to settle her stepmom's $600K debt - as years-long bankruptcy battle nears conclusion\n28/04/24 14:07Serena Williams' $1.4million Palm Beach childhood home where her father taught her to play tennis will be seized to settle her stepmom's $600k debts after her bankruptcy bid failed.Will Smith: Man who fatally shot ex-New Orleans Saints star, 34, in an argument after a 2016 car crash gets 25 years in jail\n25/04/24 20:40Cardell Hayes, 36, was convicted of manslaughter in Dec. 2016 but the jury vote had been 10-2 and the conviction was later tossed after the US Supreme Court outlawed non-unanimous verdicts.Nicole Brown's sister says she 'knows' OJ Simpson was guilty but has 'forgiven' him - as she insists she doesn't want her sibling remembered as a 'victim'\n23/04/24 15:45Prior to OJ's death from cancer two weeks ago, Tanya Brown, 52, spoke to UK magazine Closer about her older sister's tumultuous relationship with the fallen football star.Victoria Beckham's birthday guest list show who's in (and who's out) of close friendship group from her WAG days in the US\n22/04/24 11:09The former Spice Girl celebrated turning 50 at Oswald's in Mayfair this weekend - but how many of the Beckhams' exclusive LA friendship group made the guestlist?Will Smith wishes his 'ride or die' pal and Bad Boys co-star Martin Lawrence a happy 59th birthday ahead of fourth film from the franchise\n16/04/24 18:17The pair have been the leads of the Bad Boys movie franchise since its original instalment in 1995, and have just finished shooting the fourth film, which is slated for release in June.Coachella 2024's most viral moments! From Taylor Swift's selfie with RHONJ star Teresa Giudice to Doja Cat's near nude mud wrestle - all the times the festival broke the internet\n15/04/24 18:37Weekend one of the annual Coachella Arts And Music festival kicked off on Friday, April 12 and concluded on Sunday, April 14 as it took place at the Empire Polo Club located in Indio, CaliforniaGlamorous relationship coach who has helped HUNDREDS of women to find love reveals why having sex on the first date is the BIGGEST mistake you can make if you want to bag a boyfriend\n15/04/24 11:32Katie Flowers, from Las Vegas, calls herself the real-life Hitch - referring to the matchmaking character played by Will Smith in the film of the same name.Will Smith brings back memory-wiping Men In Black character during surprise performance at Coachella... for first gig since THAT slap\n15/04/24 06:52Will Smith returned to the Coachella stage on Sunday in Indio, California, as he joined J Balvin for a surprise performance of his song Men In Black.Will Smith reunites with all three of his siblings and their mom to recreate family photo: 'Now & then with my kin'\n10/04/24 22:41Will Smith recreated an adorable family photo with his three siblings and their mom, Caroline Bright, on National Siblings Day.Jackie Chan tells fans 'don't worry' after sparking health concerns with altered appearance... as Karate Kid star officially rings in his 70th birthday\n09/04/24 06:42Jackie Chan, 70, took time to reassure his fans that all was well after sparkling health concerns when recent photos circulated of the star looking older with gray hair.Will Smith wishes martial arts legend Jackie Chan a very happy 70th birthday and shares throwback snaps from the set of The Karate Kid with his son Jaden\n07/04/24 23:32Will Smith helped martial arts legend Jackie Chan celebrate his 70th birthday by sharing some throwback snaps from The Karate Kid remake.Rebel Wilson reveals her secret career ambitions had acting not taken off... after release of bombshell memoir which accused Sacha Baron Cohen of sexual harassment\n02/04/24 22:21Rebel Wilson has revealed that she once wanted to be a rapper.Will Smith, 55, is all smiles as he snaps an epic Easter selfie with his entire family while they wear matching headbands\n01/04/24 00:12Will Smith took to Instagram to share a snap that included his extended family as they celebrated Easter on Sunday. They wore matching bunny ears and egg headbands for the heartwarming photo.Hailey Bieber is a busty bunny in black swimsuit while Paris Hilton glams it up in Barbie pink with her son as they lead stars celebrating Easter\n31/03/24 18:01Hailey Bieber led celebrities celebrating Easter with a snap she shared to her Instagram Stories. The Rhode Beauty founder, 27, posed on the beach in a one-piece black swimsuit.Will Smith sidesteps question about $350M net worth after shuttering flailing charity two years after his infamous slap of Chris Rock at Academy Awards\n27/03/24 22:53The Oscar-winning actor, 55, was asked if a reported $350 million net worth gleaned via a Google search was accurate.Will and Jada Pinkett Smith are shutting down their charity after donor exodus spurred by his shock Oscars slap led to 83 PERCENT revenue drop\n26/03/24 23:51Variety also reported that Will and Jada Pinkett Smith's charity had $3,000 in overdraft fees and seemingly had no paid staffers in 2022.Will Smith gets speeding ticket for going 63mph in a 45mph zone on dangerous stretch of Malibu highway where 58 people have died in past 14 years\n26/03/24 16:00Will Smith felt the need for speed on Friday night as he drove down the Pacific Coast Highway in Malibu. The Hitch star, 55, was clocked going 63 in a 45mph speed limit zone.Bad Boys 4 official trailer: Will Smith and Martin Lawrence try to clear their boss' name in action-packed clip as new title is revealed\n26/03/24 14:15The trailer for Bad Boys 4 dropped on Tuesday morning. It saw Will Smith team up with Martin Lawrence in Miami, Florida. The film will be released in June.Stars reveal their wildest sex secrets - from Christina Aguilera's X-rated confessions to The Chainsmokers' threesomes with fans\n24/03/24 10:46Amid the rise in celebrity confessions, MailOnline looks at some of the wildest sex secrets shared by stars in recent years.Whoopi Goldberg is left SEETHING after The View CUTS OFF her Oscars commentary, as co-host Ana Navarro sparks outrage by comparing Will Smith to viral dog Messi and joking about Eva Longoria's 't**ties'\n11/03/24 18:28Whoopi, 68, was sharing her opinions about some of the Academy Award winners from when the Oscars music started playing, which stopped the furious Sister Act star in her tracks.Chris Rock takes daughters to dinner after hitting a pre-Oscar party... 2 years after that infamous SLAP which got Will Smith banned from the Academy Awards\n10/03/24 18:49Chris Rock took his daughters Lola, 21, and Zahra, 19, to dinner on Sunday. The proud dad and his kids were seen leaving celebrity hot spot Giorgio Baldi in Santa Monica.Full list of celebrities banned from the Oscars 2024 - including Will Smith following infamous Chris Rock slap\n10/03/24 15:49A full list of celebrities that have been banned from the Oscars 2024 has been released in preparation for Sunday's 96th awards ceremony. Will Smith was banned for 10 years after he slapped Chris Rock.Cillian Murphy's son Aran, 16, is set to follow in his father's footsteps after 'signing to the same Hollywood firm as Ryan Gosling and Angelina Jolie'\n07/03/24 20:55Cillian Murphy 's son Aran is set to follow in his footsteps after signing to the same Hollywood firm as many A-listers.Will Smith offers fans a behind-the-scenes look at filming Bad Boys 4 in Miami with Martin Lawrence and Fat Joe\n07/03/24 19:10Will Smith has been filming Bad Boys 4 in Miami, Florida and recently wrapped filming. The Men in Black star, 55, shared a behind-the-scenes look at his recent days in Miami.Jaden Smith is pictured holding a suspicious looking cigarette as he leaves Louis Vuitton afterparty in Paris at 3am\n06/03/24 10:58Jaden Smith was pictured holding a suspicious looking cigarette as he left the Louis Vuitton afterparty in Paris at 3am on Wednesday morning.Will Smith's daughter Willow Smith, 23, goes TOPLESS in stunning black-and-white image as she teases new single Symptom Of Life\n04/03/24 21:40Willow Smith took to her social media channels on Monday to tease artwork for her forthcoming new single Symptom of Life. Her father is movie star Will Smith.Will Smith looks every inch the action star as he films tense chase scene alongside his body double for Bad Boys 4 on a bridge in Miami\n04/03/24 12:32The actor, 55, was spotted filming a high-octane chase scene, which saw him aiming a prop gun on the side of a road on a bridge.Geri Halliwell and Christian Horner's PDA at Bahrain Grand Prix echoes some notorious shows of solidarity by famous couples hit by scandal\n04/03/24 11:50As Geri Halliwell and her husband packed on the PDA at the Bahrain Grand Prix - FEMAIL looks at other couples in the spotlight who have opted for more eager displays of unity amid scandals.Vanessa Hudgens gets heartfelt greeting from Martin Lawrence and Will Smith as actress is pictured on set of Bad Boys 4 for first time since production resumed last week in Miami\n04/03/24 02:14Vanessa Hudgens got a heartfelt greeting from Martin Lawrence and Will Smith as the actress is pictured on the set of Bad Boys 4 for first time since production resumed last week in Miami.Miami police force homeless people to move away from film set for 'Bad Boys 4' starring Will Smith and Martin Lawrence\n02/03/24 23:46Homeless people in Miami living in tents by the side of the road were forced to relocate by police due to the filming of Bad Boys 4 starring Will Smith.Will Smith and Martin Lawrence share a laugh on the set of Bad Boys 4 as the film shoot nears a close in Miami\n02/03/24 21:23Will Smith and Martin Lawrence had some laughs on the set of Bad Boys 4 in Miami Friday. The stars took a break from the action to enjoy a light moment together.Marion Cotillard, 48, stuns in sheer white skirt and tweed jacket as she leads the glamour at opening night of the 29th Rendez-Vous with French Cinema\n01/03/24 02:48The appearance comes after the actress showed off their glamorous sense of style at the 49th Cesar Film Awards at L'Olympia in Paris, France .Will Smith and Martin Lawrence break a sweat as they are seen shooting a scene for Bad Boys 4 on the beach in sunny Miami\n29/02/24 20:57Will Smith and Martin Lawrence were spotted filming a shooting scene for Bad Boys 4 in Miami. Photos taken from the scene show Will Smith and Martin Lawrence dressed as policemen.Will Smith exudes movie star magnetism as he arrives with Martin Lawrence to Bad Boys 4 set... amid career comeback post-Oscars slap\n29/02/24 02:53Principal photography is currently on the verge of completion - Will posted a video exactly one week earlier announcing that there were only eight days of filming left. The film will come out on June 7.Jada Pinkett Smith's 'heart broke' for 'courageous' Taraji P. Henson when she cried over pay disparity: 'She is the breadwinner of her family. Her pressures are different than mine'\n27/02/24 19:07Last December, the 53-year-old Oscar nominee broke down in tears while admitting to only being paid 'a fraction' of what she feels she's worthHollywood legends can't help but cuddle up on the red carpet this awards season to 'negate negativity' in 'dark world', brand expert says\n27/02/24 09:05It seems that the latest trend in Hollywood - on the red carpet at least - is friendly PDAs. Movie stars aren't battling it out, instead, they can't help but show their love.Will Smith and Martin Lawrence look ready to rumble as they shoot action scenes for Bad Boys 4 in Miami\n27/02/24 01:22Will Smith kept it casual as he shot scenes for Bad Boys 4 in Miami Monday. The actor, 55, was in action mode as he prepared to step in front of the camera with co-star Martin Lawrence, 58.\nPage\nDON'T MISS\n-\nHeartbroken David and Victoria Beckham fear Brooklyn has 'quit the family' after failing to invite ANY of his relatives to vow renewal with Nicola Peltz\n-\nEXCLUSIVE\nCat Deeley is snapped for the first time since her shock split from husband Patrick Kielty... with a male friend in Spain\n-\nTopless Nicola Peltz, 30, poses with her ageless mother Claudia, 70, as she shares a glimpse into the morning before she renewed her vows\n-\nEXCLUSIVE\nOlivia Rodrigo ENGAGED? Singer flashes huge new diamond ring on THAT finger... after romantic home tour with Brit actor boyfriend\n-\nCristiano Ronaldo forked out eye-watering seven-figure sum on model Georgina Rodriguez's incredible diamond engagement ring\n-\nEXCLUSIVE\nThe Yorkshire Vet's Matt Jackson-Smith reveals how to care for your dog as they grow up, and his dog Harry's VERY unusual traits\nAd Feature\n-\nStacey Solomon wows in plunging black bikini as mother-of-five enjoys luxury family holiday and admits she felt 'beautiful' in stunning snaps\n-\nInsiders tell KATIE HIND what 'furious' ITV production staff REALLY think of the 'rubbish' household names who are escaping jobs bloodbath\n-\nMoment Christine McGuinness shares doubts over joining Celebs Go Dating as she panics 'this isn't normal' before quitting the show\n-\nSmart moves: The 10 must-know education brands helping the UK learn better and faster\nAd Feature\n-\nOasis' future after their string of reunion gigs end 'revealed' as Gallagher brothers are flooded with performance opportunities\n-\nJoshua Jackson sparks romance rumors with Bridgerton star two years after dramatic divorce from Jodie Turner-Smith\n-\nAngelina Jolie is the latest Hollywood star planning to sell up and LEAVE LA... as she plots sale of 'historic' home\n-\nEDEN CONFIDENTIAL: Erin finds the jewel in her Crown - a new leading lady\n-\nThe stars of the much-loved Wittering Whitehalls podcast on how a hearing check has changed their relationship\nAd Feature\n-\nS Club 7's Jon Lee, 43, reveals he hasn't had sex in SIX years on Celebs Go Dating after 'traumatic' dating past\n-\nChris Hemsworth celebrates 42nd birthday in Ibiza with star-studded bash - while wife Elsa Pataky looks downcast as she shops alone in Australia's Byron Bay\n-\nNicola Peltz wears her mother's dress in secret vow renewal officiated by her father Nelson... while David and Victoria are thousands of miles away\n-\nKylie Jenner shows Timothée Chalamet what he's missing as she posts sexy snaps after birthday snub amid split rumors\n-\nEating for bump, and beyond! Pregnancy nutritionist reveals her top diet advice for those trying to conceive, pregnant, breastfeeding and baby nutrition\nAd Feature\n-\nCelebrity SAS star Lucy Spraggan breaks down in floods of tears after revealing horrifying rape ordeal during her time on the X Factor\n-\nI, Robot star hints at drama on Will Smith film after claiming his cyborg role 'tested higher' with audiences\n-\nEXCLUSIVE\nMyleene Klass' revenge wardrobe: Expert reveals how star is sending secret fashion signals amid Rochelle Humes 'feud'\n-\nKelly Clarkson's late ex-husband Brandon Blackstock is remembered in moving tribute by son after shock death from cancer\n-\nSip smarter this summer: Discover the 'Magic of Moderate Drinking' with these simple tips\nAd Feature\n-\nCristiano Ronaldo and Georgina Rodríguez are engaged! Footballer's fiancee reveals GIANT diamond ring\n-\nStrictly Come Dancing 2025: Love Island winner, Doctor Who star and footballing legend confirmed to take part in the competition\n-\nEd Westwick and his wife Amy Jackson pack on the PDA in swimwear-clad snap as they share a look at their family holiday to Italy\n-\nLiam Hemsworth and Gabriella Brooks spark engagement rumours after actress flaunts diamond ring in Ibiza\n-\nGet set for a totally WICKET summer: The Hundred is rolling into cities across the UK - this is how YOU and your family can join the fun\nAd Feature\n-\nEXCLUSIVE\nRita Ora's husband Taika Waititi wears tone-deaf T-shirt on star-studded Ibiza trip for Chris Hemsworth's birthday\n-\nMaya Jama shows off her incredible bikini body as she parties with AJ Odudu on 24 hour trip to Ibiza\n-\nJennifer Lopez shows off famous derriere in sultry snaps after Ben Affleck romance\n-\nBrad Pitt burglary suspects arrested after cops link separate heist to A-lister's home break-in\n-\nFrom spending when you're abroad to absolutely smashing the preparation and packing, we reveal how to holiday like a pro\nAd Feature\n-\nCelebrity SAS Who Dares Wins axes ex army corporal for 'lying and cheating' on the show - resulting in an explosive row\n-\nPrincess Andre tipped to become the UK's answer to Kylie Jenner with her budding career as a makeup mogul\n-\nMaura Higgins shows off dramatic living room makeover after moving into her 'dream' £1.25m Essex mansion\n-\nZoe Ball's famous dad Johnny says her relationship with her ex-husband Fatboy Slim is better than ever\n-\nFrom Icelandic waterfalls to Japanese tea ceremonies: The new cruise collection that promises adventure as well as ultra-luxury\nAd Feature\n-\nTaylor Swift fans go wild after Empire State Building 'stunt' hints at new music from singer\n-\nEXCLUSIVE\nMatt Damon almost goes overboard on boozy Ibiza trip with star-studded group for Chris Hemsworth's birthday\n-\nKelly Clarkson's ex-husband Brandon Blackstock's cause of death confirmed after passing aged 48\n-\nPeter Andre's manager Claire Powell's glow-up 16 years on as she gives advice to his daughter Princess on her show amid Katie Price's comments\n-\nThe Bear's Jeremy Allen White displays his chiseled physique as he cools off on the beach\n-\nJennifer Aniston and Gwyneth Paltrow still gossip about their mutual ex Brad Pitt\n-\nLIZ JONES: Like Katie Price I transformed myself with surgery, went bankrupt and dated terrible men. But there's one key difference between us\n-\nGethin Jones announces the death of his father as the TV star pays an emotional tribute and is flooded with supportive messages\n-\nCHRISTOPHER STEVENS reviews Celebs Go Dating on E4: Television hits the most wretched abyss with this atrocity of a series\n-\n'There's a part of me that thinks this is better': Jennifer Aniston is glad Matthew Perry is 'no longer in pain' and says she mourned Friends co-star for a 'long time'\n- EXCLUSIVE She was a silver screen siren of the 70s and ex-wife of a Hollywood icon, but is unrecognisable as she walks her dogs...can you guess who?\n-\nNetflix back away from Harry and Meghan with new deal, on worse terms: Sussexes sign 'first-look' agreement after shows flopped\n-\nKelly Clarkson breaks down in tears on stage singing poignant song just days before ex-husband's death was announced\n-\nEXCLUSIVE\nMeghan Markle and Prince Harry's new Netflix deal 'IS a downgrade' and more like a 'we'll call you' than 'here's the chequebook', experts say\n- After FOUR years of menopause struggles I took a chance on this supplement - now I'm sleeping better and finally feeling more like myself SHOPPING\n-\nTerry and Heather Dubrow take a major financial hit as they finally offload their Beverly Hills mansion\n-\nEmma Stone reveals heart-wrenching reason she cried before shaving her head for new role\n-\nGwyneth Paltrow, 52, shows off her VERY fit physique after sharing exercise secrets\n-\nWoke Bravo star claims 'fat' Trump voters should be banned from Mexican restaurants in explosive rant\n-\nNew Rambo star is FINALLY revealed... and it's not the successor Sylvester Stallone wanted\n- The 'liquid gold' facial tanner that fights ageing and has beauty fans obsessed: 'Best tanning drops EVER!' (now 20% off, but not for long) SHOPPING\n-\nMyleene Klass is accused of brutally 'ghosting' a close friend for contacting her ex-husband Graham Quinn - days after he ended their six-month marriage\n-\nKylie Jenner skips over-the-top Kardashian birthday bash for intimate party with homemade cake and kids\n-\nEXCLUSIVE\nRobin Thicke swarmed by female fans as he serenades crowd at Hamptons event following honeymoon with April Love Geary\n- Pet owners love this dog food subscription service for better fur, skin and health - and it costs just 89p a DAY (plus it's 40% off right now) SHOPPING\n-\nMusic icon stops concert to shame parent for 'irresponsible' act in front of crowd of 26,000 fans\n-\nEXCLUSIVE\nMy dad and I were jailed for running an illegal steroid lab together and brawled in the courtroom - I can't believe how he betrayed me\n-\nEXCLUSIVE\nThe Chase star Mark Labbett's ex Hayley Palmer gives her verdict his Celebs Go Dating debut following their 'traumatic' relationship\n-\nKatie Price, 47, seen for the first time since tweaking SIXTH face lift - as she recovers in Turkey after Princess, 18, revealed she would never turn to surgery like her mum\n- These 'DELICIOUS' cupboard-ready meals make nutritional eating quicker and easier than ever (and we have an exclusive deal) SHOPPING\n-\nJaw-dropping moment TOPLESS Katie Price derails Princess Andre's reality show - as teen screams 'no mum I'm filming!' and admits 'she's so unpredictable'\n-\nNelly Furtado's life as body positivity pin-up: How embracing her 'new silhouette', and becoming a mum again in her 40s has earned star, 46, 'icon' status\n-\nLiam Payne's ex Sophia Smith marries James Bridgwood as she stuns in a chic highneck gown during lavish London ceremony\n-\nRebecca Loos shoots down Richard Madeley on Good Morning Britain as they clash over David Beckham - swiping 'we don't need to talk about this'\n-\nA Place In The Sun's Laura Hamilton, 43, defiantly shows off her figure in blue swimwear after hitting back at trolls insisting she is 'too old to wear a bikini'\n-\nMeghan Markle has awkward Kardashians moment as she gifts As Ever merch to stars... who fail to acknowledge her\n-\nJennifer Aniston breaks silence on terrifying gate-crashing stalker: 'People are out of their minds'\n-\nFatboy Slim's Hove beachfront cafe slammed for his 'crazy' prices and 'shocking' waiting times\n-\nLorraine star reveals GP son was held at knifepoint in 'terrifying' ordeal at work - pleading 'it needs to stop' and begging for 'more protection'\n-\nBritish actor looks unrecognisable as he watches Oasis at Wembley with musician Tom Grennan - but can you guess who it is?\n-\nMolly-Mae Hague's sister Zoe totes £7K Chanel handbag as she heads to the gym weeks after being mocked for leaving Bali after 48 hours\n-\nPrincess Andre thought she'd be KILLED during 2018 carjacking - as she watched in horror while mum Katie Price was 'touched up' and made heart-wrenching plea\n-\nHulk Hogan's ex-wife Linda pays tribute to late wrestling icon on his birthday: 'Love and miss you so much'\n-\nMark Wright gives rare insight into family holiday with 5 month-old daughter Palma as he reveals 'disappointment'\n-\nShakira unleashes her inner She Wolf! Love Island's Khan sends fans wild as she shares VERY steamy bedroom snap with Harry Cooksley\n-\nKate Garraway's gorgeous floral midi dress is a must have for summer - and we've found it on sale with 50% off\n-\nGregg Wallace addresses claims he 'took his trousers down' on set of MasterChef - after being sacked in wake of inquiry into alleged misconduct\n-\nSam Thompson is forced to break news of his split from Zara McDermott to Jamie Lee Curtis after Hollywood star tipped the pair for marriage\n-\nLove Island stars send fans wild as they fuel romance rumours with telling Instagram snap in the same place: 'Definitely not a coincidence!'\n-\nLove Island's Arabella Chi shows off her figure in a crochet bikini in Palma just three months after welcoming baby daughter\n-\nBikini-clad Stacey Solomon addresses husband Joe Swash's whereabouts as they enjoy a family holiday at a swanky £1k-per-night hotel in Turkey\n-\nBombshell announcement Taylor Swift fans think singer will make in rumored appearance on Travis Kelce and brother Jason's podcast\n-\nOlivia Attwood reveals the bloody and bruised results of her latest beauty procedure after having fish DNA injected into her face\n-\nOne Direction fan caught up in Zayn Malik 'cheating' scandal finally breaks her silence - 13 years after leaked footage of their 'booty call' went viral\n-\nAdrian Thrills reviews The Black Keys' new album No Rain, No Flowers and finds the Ohio duo moving away from their fling with funk\n-\nTaylor Swift fans are CONVINCED she will announce next album on Travis Kelce's podcast after teasing 'new era'\n-\nI was branded 'the ugliest in the family' from nine years old - sick trolls mocked me for having a flat chest, admits Princess Andre in ITV documentary\n-\n'It felt like I was up there for everyone's entertainment': Tulisa claims a police officer mimed oral sex gestures at her when she was on trial for drug sting\n-\nEXCLUSIVE\nBlonde bombshell best known for playing a Bond Girl is seen on a rare outing... can you guess who?\n-\nLisa Rinna's daughter Amelia Gray DENIES promoting anorexia after sparking concern over 'skeletal' frame\n-\nLove Island's Dejon Noel-Williams breaks his silence over 'exposé' book - as he admits to 'questioning why people would do these things'\n-\nLottie Moss sets pulses racing in a skimpy leopard print bikini as she poses for sizzling snaps amid sun-soaked Spanish getaway\n-\nBBC axes beloved celebrity talk show after eight series - as broadcaster pays tribute to 'hardworking' host and admits cancellation was 'a difficult decision'\n-\nCynthia Nixon braves a dip in the Irish sea as she gives an insight into her travels with wife Christine Marinoni\n-\nMel B gushes her second wedding to husband Rory McPhee 'exceeded her expectations' after tying the knot in three-day ceremony in Morocco\n-\nMachine Gun Kelly offers dramatic three-word response to THOSE Sydney Sweeney dating rumors\n-\nTaylor Swift fans in meltdown as Travis Kelce and brother Jason tease singer will appear on their podcast\n-\nDenmark's party prince! Future King, 19, is caught smooching daughter of former Army captain at music festival\n-\nGeorgia May Foote slips into brown workout gear as she heads to the gym amid reports she and husband Kris Evans are 'headed for divorce'\n-\nFury over Katy Perry music video filmed in protected area without permission - as authorities in Majorca issue fine\n-\nLove Island besties Toni Laites and Shakira Khan put on a VERY racy display as they passionately kiss on a pool table in raunchy clip\n-\nCountry music star Spencer Hatcher's mother is stabbed to death in horrific home invasion\n-\nHot socialite summer! Lady Mary Charteris parties the night away with Lady Lola Bute, Lila Moss, Rita Ora's husband and Charlotte Tilbury\n-\nHit horror series with Hollywood A-lister AXED - as devastated fans fume 'how could they?!'\n-\nHalle Berry's ex is skewered by fans for saying he left her because she didn't cook, clean, or seem 'motherly'\n-\nShirtless David Beckham, 50, and wife Victoria, 51, continue soaking up the sun on their £16m superyacht amid lavish Italian getaway\n-\nRafael Nadal is a father for a second time! Tennis ace and wife Mery Perello welcome son as sweet meaning behind his name is revealed\n-\nMaya Jama displays her jaw-dropping figure in a skintight unitard as she runs last minute errands before jetting off to Ibiza\n-\nLily James hits back at Instagram moderators after her racy nude celebration is removed for breaching community guidelines\n-\nNicole Scherzinger sets pulses racing as she takes on Nicki Minaj pose challenge in a skimpy white bikini while balancing on a rock and sipping on a martini\n-\nThe moment that sparked Katie Price and Princess 'feud' as daughter makes modelling debut in Ibiza\n-\nMassive rock band announces long-awaited tour 20 years after hit song\n-\nAmelia Dimoldenberg reveals the A-list star who was her 'dream' Chicken Shop Date and opens up about her VERY flirty encounter with Andrew Garfield\n-\nAdam Rickitt shares news of heartbreaking family tragedy in emotional update\n-\nAnna Friel admits she was 'distraught' after being dumped by her first boyfriend Darren Day as she reveals his brutal move following split\n-\nKatie Price and ex Peter Andre's VERY public feud as daughter Princess reveals she sought counselling after realising her parents 'don't like each other'\n-\nPictured: Meghan Markle's California influence on Princess Eugenie's style - from '50 shades of beige' to Grecian draping\n-\nVictoria Beckham shares a snap of shirtless David as they holiday on the Italian riviera - after he was caught pinching her bottom during date\n-\n'Gutted' Lauren Goodger pulls out of scheduled This Morning appearance due to lack of childcare - as she shares sexy selfies from home instead\n-\nStrictly Come Dancing 2025's first star is REVEALED: Gladiators star Nitro set to compete in new series as the show battles a string of scandals\n-\nPamela Anderson's pickles will make Meghan green with envy! Fans go wild for Baywatch star's new product\n-\nBBC Breakfast guest slammed for 'harsh and disrespectful' swipe at late Blue Peter star Biddy Baxter - with shocked fans gasping 'he clearly wasn't a fan!'\n-\nFashion influencer gets slammed as she goes braless in 'hideous' designer dress\n-\nLucy-Jo Hudson showcases her incredible weight loss in before and after snaps following gruelling 30 day fitness challenge\n-\nWayne Lineker battles nerves ahead of his speech at daughter Tia's lavish wedding as she ties the knot with football manager Harry Agombar in Mallorca\n-\nEdinburgh Fringe luvvies claim 'Oasis effect' is 'catastrophic' as fans send hotel prices surging... and some moan they've been forced to live in cars\n-\nJames Whale's final words: Radio star said the past few months had been hard and expressed his sadness at missing Christmas in posthumous column\n-\nAaron Taylor Johnson's astronomical net worth revealed as actor becomes hot favourite to become the next James Bond after signing deal with 007 watch provider\n-\nSophie Turner hits back at critic that claimed she's 'forgotten' about her two daughters\n-\nKhloe Kardashian enjoys hamper from Meghan Markle's As Ever brand - as delighted Duchess reposts reality star's surprising social media shoutout\n-\nPrincess Andre's childhood trauma: Katie Price's daughter says she 'saw things kids shouldn't see' as she lays bare her mother's 'problems'\n-\nJenna Ortega looks quirky with bleached eyebrows as she promotes Wednesday in South Korea as series two of Netflix hit receives rave reviews\n-\nIsla Fisher and Kaitlyn Dever join pregnant Vanessa Hudgens as they lead the A-listers at star-studded event\n-\nHidden meaning in Princess Beatrice's husband Edoardo Mapelli Mozzi's birthday post for her as he takes inspiration from Prince William and Kate\n-\nPete Wicks admits he's 'in love' with a new woman six months on from his romance with Maura Higgins\n-\nBlue Peter icon Biddy Baxter dies aged 92: Tributes pour in for the 'pioneer' of children's television\n-\nNatalie Imbruglia and Delta Goodrem 'in talks to join cast of Strictly Come Dancing 2025' - as Gladiator Nitro is the first star announced\n-\nAlex Jones shares a kiss with husband Charlie Thomson as she celebrates 15 years on The One Show\n-\nKieran Hayler shows off new tattoo in Sellebrity Soccer match after Princess Andre laid bare her mother Katie Price's struggles following her split from the stripper\n-\nRebecca Loos breaks down in tears after being punched in the face in brutal Celebrity SAS boxing match - gasping 'f***ing hell!' and fighting for breath\n-\nLioness Ella Toone shows off her sparkling engagement ring as she celebrates her partner Joe Bunney's romantic beach proposal with pals\n-\nMaisie Smith breaks down in tears revealing Celebrity SAS moments 'worse than you can imagine' that were cut from 'brutal and torturous' show\n-\nRosie Huntington-Whiteley shows off her incredible figure in a white bikini top and TINY thong on the beach\n-\nVictoria Beckham shares a look at her family holiday as close-knit brood relax in St Tropez amid family rift - but Cruz isn't happy with one of her snaps!\n-\nMeghan Markle issues cryptic message about the UK as she teases As Ever update\n-\nJennifer Lopez's concert crashed by grasshopper as insect crawls up her NECK in nerve-wrecking moment\n-\nRochelle Humes 'gave Myleene Klass' ex-husband Graham Quinn a place to stay' following their split after she caught him 'cheating' with a celebrity\n-\nPaul Gallagher joins Oasis star brother Liam on Edinburgh-bound private jet ahead of looming court date after being charged with rape\n-\nMolly-Mae shows off her incredible figure in a black bikini while on family holiday in Turkey with boyfriend Tommy Fury and daughter Bambi\n-\nPrincess Andre says she 'hated' her appearance and fixated on her 'big nose' as she admits she doesn't have her mum Katie Price's confidence\n-\nCarmen Electra reveals risqué way Kim Kardashian has helped her turn heads\n-\nEXCLUSIVE\nPatrick Kielty's 'seething' family reveal heartbreaking moment they knew his marriage to Cat Deeley was over for good\n-\nLindsay Lohan looks fresh-faced as she visits Taronga Zoo with her rarely-seen husband Bader Shammas and their son in Sydney - and also brings the nanny\n-\nEXCLUSIVE\nMaura Higgins looks unrecognisable in a red wig and dramatic makeup as she poses for striking Original Magazine cover shoot\n-\nJacqueline Jossa shows her support for husband Dan Osborne at football match after Christine McGuinness texting accusations amid marital woes\n-\nIs Prince Louis following in Prince Harry's comedic footsteps? Royal shares a sense of humour with the Duke of Sussex and the late Queen\n-\nPeter Andre reacts to 'disgusting' online messages sent to daughter Princess, 18, by anonymous older men\n-\nGardener's World fans are moved to tears after star reveals his terminal cancer diagnosis during the show\n-\nDR MAX PEMBERTON: Meghan's deathly silence on Harry's woes says so much about their relationship. This is not what a successful marriage looks like...\nMORE DON'T MISS\n-\nGerard Butler and longtime girlfriend Morgan Brown look every bit the loved up couple as they jet out of LAX\n-\nDemi Lovato shocks fans as she reunites with ex boyfriend and her husband approves\n-\nGordon Ramsay wraps his arms around future son-in-law Adam Peaty after completing charity triathlon together as the Olympian is cheered on by fiancée Holly\n-\nBikini-clad Vogue Williams cosies up to ripped husband Spencer Matthews on a lavish boat during their sun-soaked family holiday in Spain\n-\nJustin Bieber beams in PDA-filled snaps with wife Hailey after airing marriage woes in new album\n-\nBilly Joel's ex-wife Elizabeth Weber reveals how they get along amid his brain disorder battle\n-\nKate Moss, 51, shows off her incredible figure in a skimpy pink bikini as she hits the beach for a day of sunbathing with daughter Lila, 22\n-\nMillie Mackintosh baffles fans as she shares clips of herself canoodling Hugo Taylor while still married to Professor Green\n-\nCHRISTOPHER STEVENS reviews Antiques Roadshow: VJ Day Special: Poignant keepsakes of the Forgotten Army brought a lump to the throat...\n-\nSelena Gomez accidentally confuses A-lister into thinking she missed Rare Beauty founder's wedding to Benny Blanco\n-\nBruce Willis' wife Emma reveals how action star husband really feels about her towering over him in heels\n-\nEXCLUSIVE\nWhat is the family secret? Baby-faced Melanie Griffith, 68, looks half her age at birthday with daughter Dakota\n-\nKathy Griffin confirms she underwent THIRD face lift after raising eyebrows with taut appearance\n-\nEXCLUSIVE\nFormer In The Style Founder Adam Frisby and long-term partner Jamie Corbett reveal they are expecting their first child via surrogate\n-\nDamian Hurley strips off for shirtless outdoor shower snap with female pal while on holiday in Mykonos\n-\nChristie Brinkley says marriage should have five-year renewal option 'in case of boredom' after FOUR weddings\n-\nControversial country singer Zach Bryan vows to 'NEVER' play in Kansas City again after clash with Chiefs fans\n-\nThe Wheel contestant leaves BBC show with ZERO pounds after everyone fails to answer jackpot question in 'rare' result - but could you have guessed it right?\n-\nTimothée Chalamet shares bizarre post on girlfriend Kylie Jenner's 28th birthday amid split speculation\n-\nJamie Dornan flaunts his ripped physique in silver trunks as he strips off for sizzling new Diet Coke 'This Is My Taste' campaign\n-\nHuge 90s film star is unrecognisable as she prepares to star in a new movie with Nicola Peltz - can you guess who she is?\n-\nEamonn Holmes shares tribute to his dog Maggie after custody battle with his ex-wife Ruth Langsford over the beloved pet in their bitter divorce\n-\nLindsay Lohan and Jamie Lee Curtis' Freakier Friday hits HUGE milestone at the box office in opening weekend\n-\nIconic 60s star from America's beloved outer space TV family is unrecognizable on rare outing... can you guess who?\n-\nThe Derek & the Dominos founder Bobby Whitlock dead at 77 following a 'brief illness'\n-\nControversial new rom-com on Netflix sparks OUTRAGE and boycotts for glorifying disturbing relationship\n-\nCybill Shepherd, 75, doesn't look like this anymore as Bruce Willis' Moonlighting rival spotted on rare outing\n-\nLoose Women star dresses up as a granny in a grey wig and makeshift BBL as she celebrates her birthday\n-\nBillie Eilish's brother Finneas details extremely 'cringeworthy' interaction with Taylor Swift that still haunts him\n-\nActor Ray Brooks famous for the voice of 1970s TV character Mr Benn dies aged 86 after a short illness and dementia battle\n-\nJosh Duhamel makes rare comment on son, 11, with Fergie as he reveals the pre-teen's camp crush\n-\nBeaming Myleene Klass defiantly steps out after being branded a 'vindictive bully' by ex Graham Quinn's pals after claims he 'cheated with a celebrity'\n-\nInside Kelly Clarkson's ex Brandon Blackstock's heartbreaking final days before his shock death at 48\n-\nPete Davidson shows rare PDA with pregnant girlfriend Elsie Hewitt amid whirlwind romance\n-\nPrincess Claudia and Prince Josef-Emanuel of Liechtenstein surprise royal fans by revealing the birth of their second child\n-\nHow the Spice Girls have said 'Stop Right Now' to ageing: The girl band's skin secrets, decoded by a top dermatologist\n-\nPrince Harry vows to continue supporting children in Lesotho but 'no decisions made' on next steps after Sentebale row\n- Kourtney Kardashian responds to backlash over not putting 21-month-old son in life vest Speaking out\n-\nSelena Gomez commits ultimate faux pas at wedding alongside fiancé Benny Blanco\n-\nEx co-stars of iconic TV series reunite and share selfie together 27 years after the show ended - as snap delights fans\n- Inside Elvis' bizarre weight loss methods... from injecting himself with protein from URINE to an induced coma Unorthodox\n-\nCelebrities who left their kids with NOTHING after they died - amid shock over Robert and Bindi Irwin's meagre inheritance\n-\nDua Lipa flaunts her sensational figure in a skimpy polka dot bikini before cosying up to fiancé Callum Turner in latest holiday snaps\n- King Charles drives himself for morning service at Balmoral church Behind the wheel on Sunday\n-\nEXCLUSIVE\nNicola Adams admits ex Ella Baig's x-rated career put a strain on their relationship as she discusses co-parenting son Taylor, 3\n-\nFrom Seann Walsh's Strictly smooch snaps to Kristen Stewart's betrayal... which stars' extracurricular kisses were caught on camera\n-\nIt was a film filled with unsimulated sex, but even nudity and severed genitals paled in comparison to one infamous scene\n-\nFrom finding God to coming close to death: How Mike Posner's life changed 11 years on from writing hit single I Took A Pill in Ibiza\n-\nPaul Hollywood appeals for help after his brother Lee was assaulted in a 'nasty and unprovoked' attack while walking his dog\n-\nPaddy McGuinness looks downcast as he steps out after 'struggling to sell his £6.5million Cheshire mansion'\n-\nNelly Furtado, 47, puts on a VERY leggy display in ruffled hotpants at Boardmasters Festival in Cornwall\n-\nMaisie Smith reveals the moment she and boyfriend Max George were forced to go 'off grid' after a 'nightmare' fire ruined their holiday\n-\nINXS stars reveal the celebrity guest list and backstage blowout at epic Wembley Stadium gig that cost the band $7 million dollar payday\n-\nEmily Ratajkowski shares her raciest photos yet as she STRIPS DOWN to string bikinis on summer vacation\n-\nCoronation Street fans are stunned as soap icon makes a surprise return to the cobbles after 18-month absence\n-\nIrina Shayk protects her modesty with a sheer drape while Adria Arjona is drenched with water in new Pirelli Calendar shoot\n-\nHow Ryan Giggs became football's biggest player: An eight-year affair with his brother's wife and THAT gagging order\n-\nJessie J shares heartbreaking moment she 'sobbed' over her scars after undergoing surgery for breast cancer\n-\nNetflix fans break down in tears at 'heartbreaking and messy' film based on true story with all-star cast\n-\nOlly Murs admits becoming a father helped him 'relate to his own mother's sadness' over his estrangement from twin brother Ben\n-\nOne Day star Ambika Mod says 'brown women have to work ten times harder to win roles than their white counterparts'\n-\nEXCLUSIVE\nREVEALED: Katie Price's 'full-on rage' as she's excluded from Princess's new reality TV show. Insiders tell KATIE HIND\n-\nSarah Jessica Parker just got caught in a big fat lie... but it couldn't be happening to a more deserving Mean Girl: MAUREEN CALLAHAN\n-\nDaughter of INXS rock legend Kirk Pengilly hits back at nepo baby label: 'I didn't want to be in my dad's shadow'\n-\nTV star shockingly admits he wants to 'grab women by the t***ies' in bizarre defence of Gregg Wallace\n- Kate Garraway shares gushing thanks to 'gallant stranger' for his act of kindness after enjoying Wembley Oasis gig with her kids week before.\n-\nEXCLUSIVE\nCountry music stardom. 'Honeypot' claims, and a cover-up. Kash Patel's mysterious girlfriend reveals TRUTH behind the rumours\n-\nNepo baby daughter of iconic Dawson's Creek star makes her acting debut in new horror film - but can YOU guess who it is?\n-\nKate and Jon Gosselin's son Collin makes heartbreaking claim about his estranged siblings in emotional post\n-\nYungblud says Ozzy Osbourne 'meant everything to him' and admits the Black Sabbath star's death was 'overwhelming'\n- EXCLUSIVE We went on Alan Titchmarsh's show and he transformed our garden... but the reaction of others left us confused .\n-\nEXCLUSIVE\nPhoebe Waller-Bridge looks swell in dungarees as she clutches folder of notes, so is she hiding latest creation?\n-\nHow Woody Harrelson and Matthew McConaughey are plotting to DESTROY woke Hollywood: TOM LEONARD\n- Gilbert & Sullivan Festival Review: Simon Butteriss is the very model of perfection, says Tully Potter Impressive\n-\nSarah Paulson, 50, and longtime partner Holland Taylor, 82, celebrate pal's Emmy nomination at dinner in Beverly Hills\n-\nOlly Murs and pregnant wife Amelia shower daughter Madison with affection as they become ambassadors for M&S\n-\nAb Fab and Bottom stars Jennifer Saunders and Adrian Edmondson face fresh planning battle over £250k extension to their home\n-\nPatrick Kielty cuts a sombre figure while stocking up on wine as he's seen for the first time since shock split from Cat Deeley after 12 years of marriage\n-\nMarius Borg Høiby has diplomatic passport revoked - after holidaying with his stepdad Crown Prince Haakon\n-\nREVEALED, after 58 years... What Mick Jagger told police about Marianne Faithfull on night that sparked 'Mars bar' myth\n-\nEXCLUSIVE\nI'm a psychotherapist, this is the reason why pampered celebrities like Molly-Mae Hague are NEVER happy...\n-\nFrank Skinner claims there are 'lots of men' working in TV 'making women's lives a misery' as he recalls getting vile cameraman sacked\n-\nAussie rock star brothers share heartbreaking news as their lauded filmmaker father dies: 'He pushed us sons hard'\n- Emmerdale fans only just realising that chart-topping singer starred on soap before rising to global fame Surprised\n- The Voice Australia fans react with fury over 'criminal' decision from Seven bosses as the new season premieres Not happy\n- Catherine Zeta-Jones, 55, admits nobody thought her marriage to Michael Douglas, 80, 'would ever last' Still going strong\n-\nLiam Gallagher shows support for brother Paul after he was charged with rape and 'offers him a bed in his £4million mansion'\n-\nMyleene Klass flashes a huge smile as she shakes off being branded a 'vindictive bully' by ex Graham Quinn's friends\n-\nVeteran Good Morning Britain presenter 'handed six-month contract' ahead of cost-cutting overhaul\n-\nLove Island's Harry Cooksley admits dating friend of Montana Brown just days before entering villa\n-\nAlex Scott flaunts her incredible figure in a tiny leopard print bikini as she packs on the PDA with girlfriend Jess Glynne amid romantic Greek getaway\n-\nNicole Scherzinger 'has Andrew Lloyd Webber's support to star in a film adaptation of Sunset Boulevard after successful Broadway run'\n-\nMaya Jama 'offered eight-figure deal to stay as Love Island host as ITV bosses make bid to keep her amid interest from rivals'\n- Selena Gomez copies BFF Taylor Swift as she gears up to re-record her favorite past song Revealed her surprise plans\n-\nFormer child star who worked with Hollywood legends Tony Curtis and William Devane in Bad News Bears sequels dead at 61\n- Billy Joel's ex-wife breaks silence on his 'homewrecker' label after leaving her first husband for singer Speaking out\n-\nLove Island's Toni reacts to Harrison's apparent side-eye after learning that Cach had dropped the L-bomb\n-\nStrictly rocked by fresh scandal amid 'drug probe' after staffer claims they were offered cocaine by show star during wild alcohol fuelled afterparty\n-\nEXCLUSIVE\nFrom partying with Hugh Hefner to starring in a Nicki Minaj video: The racy past of a Married At First Sight bride\n-\nBrooklyn Beckham reveals he could 'renew vows every day' as he opens up on secret ceremony with wife Nicola Peltz amid bitter feud with David and Victoria\n-\nEastEnders actor Jamie Borthwick's 'soap return after three month suspension' leaves disability campaigners fuming following slur backstage at Strictly\n-\nAmy Schumer shocks fans posing with walker as she reveals secret spinal surgery after surfing accident\n-\nDavid Beckham cheekily grabs wife Victoria's bum during meal with son Cruz in Portofino as Brooklyn and Nicola miss out amid ongoing feud\n-\nEXCLUSIVE\nInside 'And Just Like That' crisis talks... and the plot that destroyed all hope of a return\n-\nJames Norton: I auditioned for Fifty Shades... but they said I was too grey!\n-\nJustin Bieber's night spirals from sweet to scandalous as he smokes on car hood post-Hailey dinner then grabs crotch in racy snaps\n-\nAbbey Clancy shows off her incredible bikini body in sweet family holiday snaps with husband Peter Crouch\n-\nRebekah Vardy shows off her toned physique in a tiny bikini during family holiday\n-\nRoman Kemp left baffled by tricky questions on Celebrity Catchphrase - but can you guess the answers?\n-\nTALK OF THE TOWN: Becks may have splashed out on a lavish birthday dinner - but when it comes to gravy, he's a Bisto kid at heart\n-\nMolly-Mae Hague's sister Zoe Rae leaves a hair salon with her husband Danny weeks after scrapping Bali holiday because it 'looks better on social media'\n-\nKourtney Kardashian is fiercely slammed for taking young son on boat without a life vest\n-\nEmmerdale star Isabel Hodgins is pregnant! Actress announces she is expecting her first child with husband Adam Whitehead\n- Chad Michael Murray shares chilling near-death experience that resulted in him losing HALF of his blood Terrifying '\n-\nBig Brother stars Grace Adams-Short and Mikey Dalton are the ONLY couple still together from show - and you won't believe what their family look like now!\n-\nJennifer Aniston stuns fans with new BFF reveal as she calls her 'love language' with Courteney Cox 'boring'\n-\nGrief-stricken Kelly Clarkson shifts career focus after ex Brandon Blackstock's shock cancer death\n-\nEkin-Su Cülcülolu 'splashes out on £1M Essex mansion' after making a mint following US TV appearances and Love Island All Stars stint\n-\nThe Traitors winner Meryl Williams breaks silence on feud with co-star Maddy Smedley\n-\nKim Kardashian's ex-pal Larsa Pippen, 50, shuts down plastic surgery rumors after debuting shocking transformation\n-\nMAFS UK star Rozz Darlington gives birth! Reality bride welcomes first child with boyfriend Jordan Morris as she reveals tot's sweet name\n-\nRita Ora 'locked in bitter row with neighbours over plans to build high-tech gym in the garden of her £7.5m Grade II-listed London mansion'\n-\nScarlett Moffatt reveals when she plans to marry fiancé Scott Dobinson as she discusses their wedding plans\n-\nCarefree Frankie Bridge shows off her abs in a skimpy patterned bikini while relaxing on the beach amid rumours she's 'fallen out' with Rochelle Humes\n-\nDua Lipa showcases her incredible figure in white frilled two-piece as she soaks up the sun in stunning snaps\n-\nComedian Jimmy Carr likens Prince Harry to Kanye West, saying 'he occasionally dressed as a Nazi and he f***** up'\n- Country singer Lainey Wilson is bringing her Whirlwind tour to Australia and New Zealand in 2026 Big plans\n-\nGrieving Kym Marsh says some friends 'vanished' after tragic loss of cousin Carl\n-\nEmma Thompson reveals Donald Trump asked her out on a date on the day she got divorced\n-\nI've worked with Richard Madeley for years - the Good Morning Britain host shows his true colours when the cameras stop rolling\n-\nKourtney Kardashian fires off epic response to pregnancy rumors as fans are all saying the same thing\n-\nAlesha Dixon flaunts her toned figure in a racy pearl bra and hot pants as she teases exciting announcement after career change\n-\nLove Island winners Kai Fagan and Sanam Harrinanan reveal why they only invited ONE fellow Islander to their lavish Essex wedding\n-\nRylan Clark whisks mother Linda, 73, off on family holiday after she was rushed to hospital with health scare\n-\nSuri Cruise, 19, channels mom Katie Holmes in quirky dress but her Tom Cruise lookalike grin has fans doing a double take\n-\nLioness Ella Toone gets engaged to boyfriend Joe Bunney in romantic Ibiza proposal after England's Euros win\n-\nNaga Munchetty's 'Marmite meltdown': Under-fire BBC Breakfast host 'scolded intern over how they spread her toast', sources claim\n-\nEXCLUSIVE\nKelsey Parker on how she's told her children she will never leave them following the death of her baby three years after husband Tom died\n-\nNepo baby actress and singer is spitting image of her legendary country star father... can you guess who she is?\n-\nWhy Travis Kelce and Taylor Swift didn't attend funeral for dad Ed's long-term partner\n-\nThe evolution of Abbey Clancy: How she went from failed singer and reality wannabe to WAG before becoming £30M TV and podcast titan with Peter Crouch\n-\nDustin Hoffman and wife Lisa, 70, put on a loved-up display as they celebrate his 88th birthday with family in Santa Monica\n-\nEXCLUSIVE\nMyleene's ex-husband thinks she's a vindictive BULLY: Damning verdict of Graham Quinn's friends as they tell how she broke him\n-\nWhy The Saturdays are at odds over a reunion and haven't been seen together in YEARS - as fans suspect Frankie Bridge and Rochelle Humes have fallen out\n-\nAs Vick Hope and Calvin Harris surprise fans with graphic post-labour placenta picture - celebs who are turning their afterbirth into artwork and smoothies\n-\nTravis Barker's ex-wife Shanna Moakler, 50, shows off Mounjaro weight loss in sexy swimsuit\n-\nFrom Hollywood royalty to music icons: Which celebrities support YOUR favourite Premier League club ahead of the new season?\n-\nEXCLUSIVE\nI played The Traitors Live Experience - there was treachery, back-stabbing and it was absolute chaos\n-\nSarah Ferguson posts sweet video to mark Princess Beatrice's 37th birthday - and praises her 'strength and kindness'\n-\nDoja Cat stuns in plunging zebra print bra and figure-hugging leggings as she performs at Outside Lands Festival in California\n-\nDavid Beckham larks around with son Cruz in fun-filled snap during family holiday... hours after extending olive branch to eldest Brooklyn amid 'feud'\n-\n'Nepo baby' behind the original Freaky Friday revealed and it's NOT Jamie Lee Curtis... who is she?\n-\nBBC Breakfast's Naga Munchetty and Charlie Stayt's relationship with newly-returned boss Richard Frediani 'turns sour' amid 'bullying' review\n-\nLate night gone WOKE: Cringiest moments of hosts who prioritized liberalism over laughs as Stephen Colbert is sacked\n-\nEXCLUSIVE\nBody language expert reveals Harry and Meghan's awkward moment at film premiere when they 'acted like A-List celebrities'\n-\nUlrika Jonsson, 57, strips down to sheer lacy underwear in sultry mirror snaps and makes cheeky jibe at critics over 'ageing' comments\n-\nWild conspiracy theories emerge over why Leonardo DiCaprio ALWAYS covers his face - as all of his ridiculous disguises are revealed\n-\nAmanda Holden, 54, dazzles alongside youthful husband Chris Hughes, 51, in snap 22 years after meeting... as fans marvel at their aged-defying looks\n-\nEXCLUSIVE\nHoward Stern blasts back at critics with very pointed message... as insiders reveal his audacious comeback plan for NEW show\n-\nSelena Gomez looks as glamorous as ever in a shimmering white dress at her Rare Beauty perfume launch\n-\nHuge popstar looks unrecognisable in unseen video performing at music festival 16 years ago - can you guess who she is?\n-\nOasis onstage blast at council fan slur: Liam Gallagher brands city officials 'f****** slags' at Murrayfield gig as he demands apology after they called supporters 'fat, drunk and rowdy'\n-\nPregnant Georgia Harrison displays her growing bump at ultrasound scan before enjoying a spa weekend with boyfriend Jack Stacey\n-\nPixie Lott delightedly reveals her due date and details the exhaustion of mothering son Bertie, 23 months, while pregnant with number two\n-\nEmma Willis gives update after undergoing heart surgery and shares the secret to her happy marriage with husband Matt\n-\nMeghan Markle blindsided a senior royal aide in a 'very public way' leading to 'awkward moments'\n-\nOlly Murs' wife Amelia shows off her growing bare bump in a grey bra as they share sweet behind-the-scenes clips from pregnancy shoot\n-\nHelen Flanagan marks 35th birthday with racy snaps and emotional note about heartbreak and her 'amazing' kids... after driving ban and 'financial crisis' claims\n-\nGladiator star Steel and wife reveal they are trying for another baby four months after tragic death of their premature son - as they voice need to 'fill void' left by loss\n-\nJeremy Clarkson says it looks like Diddly Squat Farm has had a 'catastrophic' harvest this year as he warns it is bad news 'for anyone who eats food'\n-\nThe One Show's Alex Jones fights back tears as husband Charlie Thomson makes surprise appearance live on air\n-\nRachel Riley stalker hell: Countdown star targeted by convicted stalker who accused her of being the 'ringleader of a cult of celebrities'\n-\nKourtney Kardashian earns praise for posting 'unfiltered' photos of her body... unlike her famous sisters\n-\nHow foul-mouthed Lizzy Bardsley's life went south after Wife Swap: Reality TV star's stint in the spotlight ended in an arrest, fraud and divorce\n-\nKylie Jenner reveals she's listening to back-to-back breakup songs... after not being seen with boyfriend Timothee Chalamet in a month\n-\nPretty In Pink! Kylie Minogue, 57, shows off jaw-dropping figure in form-fitting jumpsuit on stage in Buenos Aires\n-\nEXCLUSIVE\nPrincess Andre hits back at feud claims after her mum Katie Price said she was 'upset' not to appear in her new ITV series and insists: 'This is MY show'\n-\nPrincess Eugenie wishes 'big sissy' Beatrice a happy birthday in sweet Instagram post as she calls her 'the best in the entire world'\n- David and Victoria Beckham fear Brooklyn has 'quit the family' after failing to invite ANY of his relatives...\n- Sturgeon: The Queen quizzed me on Salmond sex claims\n- Major retail chain with 115 stores across the country confirms more shops will close next month - as it...\n- The new weight-loss drugs experts say will be BETTER than Ozempic - from the 'gym in a jab' that builds...\n- 'All the big names are staying while the little people get the boot': Insiders tell KATIE HIND what...\n- A&E waits fuel 4,000 attacks on NHS staff a year: One worker is attacked every two hours in 'tinder box'...\n- Cat Deeley is snapped for the first time since her shock split from husband Patrick Kielty... with a male...\n- NADINE DORRIES: My daughters were publicly humiliated after I kept a huge secret from them. Here's what it...\n- Worried you smell bad? This is the everyday food you should stop eating - and the VERY unexpected ingredient...\n- Designer found dead in boat at ritzy yacht club had recently gone through divorce\n- Countries with the most 100-year-olds REVEALED - find out where Britain ranks in our league table\n- Sir Keir Starmer would not call shoplifters 'scumbags', No 10 says in the wake of 'data protection' saga\n- Emma Raducanu calls for crying child to be EJECTED from stadium, sparking tense row with umpire in narrow...\n- PETER HITCHENS: I'm pleased public sentiment on Lucy Letby has shifted - but there's still one puzzle in...\n- Nicola Peltz, 30, poses topless with her mother Claudia, 70, as she shares a glimpse into the morning before...\n- S Club 7's Jon Lee, 43, reveals he hasn't had sex in SIX years on Celebs Go Dating after 'traumatic' dating...\n- 'A wonderful grandfather and my best friend': British woman, 33, whose 'father-in-law turn-partner tried to...\n- Britain's new 'Wild West': This seaside resort was loved by families...but now three historic hotels shut to...\n- Kemi Badenoch suggests housing asylum seekers in 'camps' instead of hotels - as figures reveal 50,000...\n- Millions stuck on pills that can wreck lives: Years after experts admitted crippling side effects of...\n- Urgent warning to British parents over viral Labubu toys\n- The secret to living to 100: Lifestyle habits from the world's 'Blue Zones' - where people are TEN TIMES...\n- EDEN CONFIDENTIAL: Erin finds the jewel in her Crown - a new leading lady\n- Scientists baffled as new 'stone head' statue mysteriously appears on Easter Island: 'This is a first'\n- Donald Trump heaps praise on PUTIN as he confirms Zelensky is NOT invited to Alaska meeting - but promises...\n- British tourists warned against grotesque beach habit that people say is 'bizarre'\n- It's no surprise we are seeing vigilante groups on Britain's streets, warn Reform women who dub themselves...\n- Meghan Markle and Prince Harry's new Netflix deal 'IS a downgrade' and more like a 'we'll call you' than...\n- Europe's red alert HELL: Boy, four, dies of heatstroke in Italy as temperatures hit record highs in France...\n- JD Vance visits posh Cotswolds farm shop Daylesford Organic as his huge security convoy annoys locals after...\n- Strictly Come Dancing 2025: Love Island winner, Doctor Who star and footballing legend confirmed to take...\n- We want to give our children our buy-to-let properties - can we avoid capital gains and inheritance tax?\n- Over 40 rough sleepers line Oxford Street with makeshift beds after migrant 'shanty town' is cleared\n- Man, 51, lived with his ex-girlfriend's dead body on his sofa for more than two years\n- 'Prince Harry should stop being the victim': Queen's press secretary urges 'impulsive' duke to 'write his...\n- Two planes collide on runway at Montana airport causing huge fireball\n- I made a controversial change to my wardrobe... and now I'll never wear 'normal' shoes comfortably again\n- Death of Prince William's businessman pal who 'collapsed after swallowing a bee' sparks a £3billion...\n- More than 70 supercars worth £7m seized in London - including pair of purple Lamborghinis, Ferraris and...\n- Kelly Clarkson's ex-husband Brandon Blackstock's cause of death confirmed after passing aged 48\n- Man killed on Isle of Sheppey 'was hit over the head with a concrete slab': Girl, 16, and two boys, 14 and...\n- Sports-mad schoolgirl loses both legs days before her 13th birthday after being crushed by tractor in 'freak...\n- Cristiano Ronaldo forked out eye-watering seven-figure sum on model Georgina Rodriguez's incredible diamond...\n- Myleene Klass' revenge wardrobe: Expert reveals how star is sending secret fashion signals amid Rochelle...\n- Moment staff on London's 'lawless' Tube appear to ignore two fare dodgers who shamelessly push their way...\n- Stacey Solomon wows in plunging black bikini as mother-of-five enjoys luxury family holiday and admits she...\n- Queen Elizabeth II told Nicola Sturgeon she had no idea what was going on when she filmed iconic Paddington...\n- RICHARD LITTLEJOHN: In Lawless Britain the 'rights' of scumbags are put ahead of innocent shopkeepers and...\n- My wife and I are in our 50s and haven't had sex for TWO YEARS. Today I'm revealing all about the desperate...\n- Hundreds of pupils left 'with nowhere to study' after historic £23k-a-year private school shuts - blaming...\n- Vigilante Tube passengers face arrest over 'assault' of naked man on the Tube after they took law into their hands when he dropped his trousers on packed carriage\n- Moment vigilante Cycling Mikey pushes his bicycle into a car after row over whether motorist could drive there\n- Major retail chain with 115 stores across the country confirms more shops will close next month - as it announces sales to clear remaining stock\n- Netflix back away from Harry and Meghan with new deal, on worse terms: Sussexes sign 'first-look' agreement after shows flopped - with cooking Christmas special and another documentary\n- Europe's red alert HELL: Boy, four, dies of heatstroke in Italy as temperatures hit record highs in France and masses are evacuated in the Balkans as wildfires tear through\n- JD Vance's Beast of the Cotswolds: Countryside in lockdown as US Vice President arrives in tiny hamlet with Secret Service convoy amid huge security operation\n- British backpacker who hit and killed a father of two while riding an e-scooter faces 20 years in jail after pleading guilty to dangerous driving causing death in Australia\n- More than 70 supercars worth £7m seized in London - including pair of purple Lamborghinis, Ferraris and Porsches\n- Young grandmother, 34, is banned from driving after being caught high on cannabis on the school run\n- Moment passenger SLAPS air hostess who 'asked her to turn phone off' before being dragged away and detained by staff\n- Man killed on Isle of Sheppey 'was hit over the head with a concrete slab': Girl, 16, and two boys, 14 and 15, are arrested after holidaymaker heard shouts of 'I've done him'\n- The Spanish town that 'banned' Islamic festivals: Inside the historic city where officials say they're 'defending local traditions' but Muslims say it is 'racist'\n- Britain is hotter than Ibiza: Week-long 34C heatwave will bring a rise in deaths, 'tropical nights', thunderstorms and wildfires\n- Revealed: The luxurious 190-acre Cornish estate where The Salt Path author Raynor Winn and her husband have taken refuge from furore over memoir's 'fabrications'\n- 'Prince Harry should stop being the victim': Queen's press secretary urges 'impulsive' duke to 'write his own script' because people are 'tired' of how he thinks 'world is against him'\n- Girl, 16, and two boys, aged 14 and 15, are arrested after man in his 40s is 'murdered in fight' on the Isle of Sheppey\n- Furious customers condemn Fatboy Slim's beachfront cafe for 'crazy' prices, 'shocking' 40-minute wait times for burgers and bagels\n- Missing mother, 41, found dead after being pulled out of the sea at Cornish beauty spot is pictured as son pays tribute\n- Drunk easyJet pilot strips naked in Cape Verde hotel bar at 2.30am - hours before he was due to fly holidaymakers back to the UK\n- The animated film set to become Netflix's biggest ever hit - to the fury of Disney bosses who sank millions into woke flops like Moana, by TOM LEONARD\n- Prison officer, 23, facing jail herself after admitting affair with an inmate\n- JD Vance visits posh Cotswolds farm shop Daylesford Organic as his huge security convoy annoys locals after sending countryside into lockdown\n- Shocking moment British tourist collapses on Rio de Janeiro beach after being DRUGGED by women who gave him a laced cocktail then stole £16,000 from his bank accounts\n- Inside Paris's latest migrant camp: Families sleep on the floor beneath tarpaulin sheets outside French capital's city hall as they wait to be given housing\n- Terrifying moment Chinese Navy ships ram EACH OTHER as they intimidate Philippine boat in waters Beijing claims it owns\n- Trans Met Police volunteer, 27, groomed child after meeting online and told her 'you enjoy being raped', court hears\n- Drivers older than 70 will be forced to take eye tests every three years and banned if they fail, under new motoring law\n- Man, 51, lived with his ex-girlfriend's dead body on his sofa for more than two years\n- Will it be the hottest EVER day near you during Britain's 34C heatwave? Type in your postcode to find out...\n- It's no surprise we are seeing vigilante groups on Britain's streets, warn Reform women who dub themselves 'Farage's Fillies'\n- 'Ibiza Bob' parties at €9million mansion with the dwarf from Lamine Yamal's 18th birthday - as he's 'skating on thin ice' with girlfriend\n- Alton Towers is evacuated after 'small' fire broke out inside toilet block in Forbidden Valley\n- Woman is arrested and threatened with stoning after wearing a T-shirt saying 'Allah is lesbian' in Morocco\n- MOST READ IN DETAIL"
    },
    {
      "url": "https://www.youtube.com/@jimcummingspod",
      "text": "- Svenska\n- Deutsch\n- English\n- Español\n- Français\n- Italiano\n- Alla språk\n- Afrikaans\n- azərbaycan\n- bosanski\n- català\n- Čeština\n- Cymraeg\n- Dansk\n- Deutsch\n- eesti\n- EnglishUnited Kingdom\n- EnglishUnited States\n- EspañolEspaña\n- EspañolLatinoamérica\n- euskara\n- Filipino\n- FrançaisCanada\n- FrançaisFrance\n- Gaeilge\n- galego\n- Hrvatski\n- Indonesia\n- isiZulu\n- íslenska\n- Italiano\n- Kiswahili\n- latviešu\n- lietuvių\n- magyar\n- Melayu\n- Nederlands\n- norsk\n- o‘zbek\n- polski\n- PortuguêsBrasil\n- PortuguêsPortugal\n- română\n- shqip\n- Slovenčina\n- slovenščina\n- srpski (latinica)\n- Suomi\n- Tiếng Việt\n- Türkçe\n- Ελληνικά\n- беларуская\n- български\n- кыргызча\n- қазақ тілі\n- македонски\n- монгол\n- Русский\n- српски\n- Українська\n- ქართული\n- հայերեն\n- עברית\n- اردو\n- العربية\n- فارسی\n- አማርኛ\n- नेपाली\n- मराठी\n- हिन्दी\n- অসমীয়া\n- বাংলা\n- ਪੰਜਾਬੀ\n- ગુજરાતી\n- ଓଡ଼ିଆ\n- தமிழ்\n- తెలుగు\n- ಕನ್ನಡ\n- മലയാളം\n- සිංහල\n- ไทย\n- ລາວ\n- မြန်မာ\n- ខ្មែរ\n- 한국어\n- 日本語\n- 简体中文\n- 繁體中文\n- 繁體中文香港\n- Svenska\n- Deutsch\n- English\n- Español\n- Français\n- Italiano\n- Alla språk\n- Afrikaans\n- azərbaycan\n- bosanski\n- català\n- Čeština\n- Cymraeg\n- Dansk\n- Deutsch\n- eesti\n- EnglishUnited Kingdom\n- EnglishUnited States\n- EspañolEspaña\n- EspañolLatinoamérica\n- euskara\n- Filipino\n- FrançaisCanada\n- FrançaisFrance\n- Gaeilge\n- galego\n- Hrvatski\n- Indonesia\n- isiZulu\n- íslenska\n- Italiano\n- Kiswahili\n- latviešu\n- lietuvių\n- magyar\n- Melayu\n- Nederlands\n- norsk\n- o‘zbek\n- polski\n- PortuguêsBrasil\n- PortuguêsPortugal\n- română\n- shqip\n- Slovenčina\n- slovenščina\n- srpski (latinica)\n- Suomi\n- Tiếng Việt\n- Türkçe\n- Ελληνικά\n- беларуская\n- български\n- кыргызча\n- қазақ тілі\n- македонски\n- монгол\n- Русский\n- српски\n- Українська\n- ქართული\n- հայերեն\n- עברית\n- اردو\n- العربية\n- فارسی\n- አማርኛ\n- नेपाली\n- मराठी\n- हिन्दी\n- অসমীয়া\n- বাংলা\n- ਪੰਜਾਬੀ\n- ગુજરાતી\n- ଓଡ଼ିଆ\n- தமிழ்\n- తెలుగు\n- ಕನ್ನಡ\n- മലയാളം\n- සිංහල\n- ไทย\n- ລາວ\n- မြန်မာ\n- ខ្មែរ\n- 한국어\n- 日本語\n- 简体中文\n- 繁體中文\n- 繁體中文香港\nInnan du fortsätter till YouTube\nVi använder cookies och data för att\n- leverera och underhålla Googles tjänster\n- spåra avbrott och skydda mot spam, bedrägeri och otillåten användning\n- mäta målgruppsengagemang och webbplatsstatistik så att vi kan analysera hur våra tjänster används och förbättra tjänsternas kvalitet.\nOm du väljer knappen Godkänn alla använder vi även cookies och data för att\n- utveckla och förbättra nya tjänster\n- leverera annonser och mäta hur effektiva de är\n- visa anpassat innehåll utifrån dina inställningar\n- visa anpassade annonser utifrån dina inställningar\nOm du väljer knappen Avvisa alla använder vi inte cookies i dessa ytterligare syften.\nInnehåll och annonser utan anpassning påverkas bland annat av vad du tittar på för tillfället och din plats (annonser visas utifrån din ungefärliga plats). Innehåll och annonser med anpassning kan även omfatta sådant som videorekommendationer, en anpassad YouTube Hem-sida och anpassade annonser utifrån tidigare aktivitet, till exempel vad du tittar på och söker efter på YouTube. Vi använder även cookies och data för att anpassa upplevelsen efter lämplighet för din målgrupp, om tillämpligt.\nVälj knappen Fler alternativ för mer information, till exempel om hur du hanterar dina integritetsinställningar. Du kan även besöka g.co/privacytools när som helst."
    },
    {
      "url": "https://www.dailymail.co.uk/tvshowbiz/article-14522537/Will-Smith-social-media-criticism-fresh-prince.html",
      "text": "- Have YOU got a story? Email tips@dailymail.com\nWill Smith was left red-faced on Instagram on Thursday as he addressed a barrage of social media criticism over a hilarious habit viewers spotted in the opening episodes of hit US sitcom The Fresh Prince Of Bel Air.\nIn the last few days, fans of the classic comedy have been bombarding the actor, 56, with negative comments after they noticed his tendency to lip synch his co-stars' words while they were talking while waiting for his next line.\nNow the Men In Black lead has taken to social media to address the saga, branding the archive clips 'terrible' as he engaged in a light-hearted throwback with his Fresh Prince co-star Tatyana Ali, who played Ashley Banks.\nWill said he had never had an acting job before this one and no one told him about his bad habit until episode six. Showing one clip from season one to the actress Will said: 'This is the worst one right here.'\nThe Fresh Prince Of Bel Air is a 90s American sitcom which tells the story of an inner-city teenager from Philadelphia who is sent to live with his wealthy aunt and uncle at their Bel-Air mansion.\nIn the short video, Will's character very clearly mouths his colleague's part of the script before performing his own lines.\nTatyana then screamed with laughter and Will, who made his screen debut in the Fresh Prince, added: 'Ahhhh. That's awful.'\nWill Smith has been ridiculed on social media over one amateurish habit in the hit US sitcom The Fresh Prince Of Bel Air and responded to it on Instagram with co-star Tatyana Ali\nFans have only just noticed that in the series' early days Will used to mouth his co-stars' words while they were talking while waiting for his next line\nShe said: 'You used to know the entire script.'\nWill replied: 'Yes that was the thing I was learning the entire script. In the middle of the scene, Karyn [Parsons] just said, \"stop it!\"\n'I didn't know I was doing that.'\n'You used to do it with me a lot,' Tatyana said.\n'Terrible, terrible, terrible,' Will sighed.\nHis co-star said: 'It was only the first season though. It was only the first season.'\n'There's no reason we were successful,' Will laughed. 'There's no reason we should have been successful.'\nMocking a scene between the two, Tatyana pretended to say a few lines: '\"And yeah, um, cause mum said and dad said.\"'\nThe actor (pictured, second from top right on the show, with Tatyana, bottom left) got his screen breakthrough in 1990 playing a version of himself in the popular NBC show\nHe showed one particularly incriminating clip to Fresh Prince co-star Tatyana, who played Ashley Banks in the comedy\nWill then pretended to mouth her lines before adding: 'It was six episodes before somebody told me. I think Don Cheadle was the sixth episode.\n'I think that was the one that was bad and they were like, \"okay we have to stop\".\n'And they literally had to go and show me what I was doing. So the next couple of episodes I was just like... [Holding his mouth shut]... I'll do my lines and be like...\n'Yeah it was bad, tragedy.'\n'You never acted before Fresh Prince?' Tatyana asked. 'Was Fresh Prince the first?'\nWill said: 'Yeah, first, first.\n'And here we are, not bad, you know what I'm saying. Good to see you Tats, love you.'\nOn Thursday night, Will thrilled fans, including his mother Caroline Bright, in Las Vegas with an action-packed performance which also included emotional moments where he paid tribute to Fresh Prince co-star James Avery and Will's first son Trey.\nThe actor had risen to recognition as one half of hip hop duo DJ Jazzy Jeff and the Fresh Prince (pictured, in 1989) who released Grammy-winning single Parents Just Don't Understand\nOn Thursday night, Will thrilled fans, including his mother Caroline Bright, in Las Vegas with an action-packed performance which also included emotional moments\nThe rapper wore a white t-shirt and black cargo pants, adding a black cowboy hat during the show as his mother filmed the occasion on her phone\nThe rapper wore a white t-shirt and black cargo pants, adding a black cowboy hat during the show as his mother filmed the occasion on her phone.\nThe Fresh Prince Of Bel Air icon made a career out of his laid-back demeanour, an image that was compromised at the 2022 Academy Awards when Will infamously slapped comedian Chris Rock on stage in response to a joke he made about his wife Jada Pinkett Smith's shaved head, which was due to her alopecia.\nThe Aladdin actor continued shouting profanities at Chris as he returned to his seat and repeatedly said: 'Keep my wife's name out [of] your f***ing mouth.'\nWill later accepted his Best Actor Oscar for his performance in King Richard and apologised to the Academy for his behaviour.\nThe recently rediscovered clip comes after Will went viral as he recreated his iconic Fresh Prince of Bel-Air dance with former co-star Tatyana and a surprise appearance from singer Doechii.\nThe duo brought back their silly ditty for a whole new generation in video posted to social media on Friday, which was set to the trending song Anxiety by Doechii, 26.\nWhile the song delighted many fans, several took issue with Doechii's appearance in the video and accused her of being an 'industry plant.'\nAccording to Urban Dictionary, an industry plant is defined as 'an artist who has Major/Indie Label backing their movement but presents themselves as a \"home grown start up\" label to create a pseudo organic following.\nAt the 2022 Academy Awards, Will infamously slapped comedian Chris Rock on stage in response to a joke he made about his wife Jada Pinkett Smith's shaved head\nIt comes after Will went viral as he recreated his iconic Fresh Prince of Bel-Air dance with former co-star Tatyana and a surprise appearance from singer Doechii\nWhile the song delighted many fans, several took issue with Doechii's appearance in the video and accused her of being an 'industry plant'\nAddressing the allegations, Doechii recently told The Cut: 'When people aren’t familiar with the history of an artist these days, they get suspicious.\n'I’m pretty detached emotionally from it because I understand where it’s coming from.\n'And to be honest, once you get any conspiracies around your career, that’s just confirmation that I’m going somewhere and I’m doing something right.'\nOn Wednesday, Will left fans in hysterics after revealing the unusual locations for his first ever tour in the UK and Europe.\nThe American rapper and actor is travelling across the pond to play songs from his forthcoming album, Based On A True Story, his first full-length album in 20 years after 2005's Lost And Found.\nYet while many international artists traditionally stick to performing in the UK's largest venues - such as London's Wembley Stadium and Manchester's Co-op Live arena - the star is taking his tour to more unique locations.\nThe tour, which will also see him perform hits such as Gettin' Jiggy Wit It and Miami, lands in England with a date at the seaside resort Scarborough, with Will performing on August 24 at Open Air Theatre.\nThis will be followed with a gig at Cardiff's Bute Park on August 25 and a concert at Manchester's Victoria Warehouse on August 27.\nWill left fans in hysterics after revealing the unusual locations for his first ever tour in the UK and Europe - announcing dates in Scarborough and Wolverhampton\nThe American rapper and actor is travelling across the pond to play songs from his forthcoming album, Based On A True Story, his first full-length album in 20 years\nThe King Richard actor will perform at London's Brixton Academy the day after and a final gig at University of Wolverhampton at the Halls on August 30.\nWill is also taking his tour to several European festivals, such as the Moroccan festival Mawazine in Rabat.\nThe Oscar-winning actor announced the news in an Instagram post on Tuesday, writing: 'I'M GOING ON TOUR THIS SUMMER!!\n'We're hitting up UK & Europe to bring U all the hits, some new joints, and a few surprises. All these years, I've NEVER done a headline tour and I can't wait to see you guys!!'\nFPOBA was one of the best shows on tv. No languag...\nby Grady1 39"
    },
    {
      "url": "https://www.dailymail.co.uk/tvshowbiz/article-14859005/Will-Smith-takes-aim-Chris-Rock-savage-Oscar-slap-lyric-cringey-freestyle.html",
      "text": "- Have YOU got a story? Email tips@dailymail.com\nWill Smith blasted Chris Rock as nothing but a 'joker' in his 'Fire in the Booth' freestyle rap I Am the Illest, which he performed with Charlie Sloth three years after his violent assault against the comedian onstage the 94th Academy Awards.\n'Now I'm not the type of man to move in malicious ways / and I am too grown to play childish games / but if you talking crazy out your face up on the stage and disrespect me on the stage,' the disgraced 56-year-old rapped on June 22.\n'Expect me on the stage.'\nWill (born Willard) continued: 'Jokers dish it out, cry foul when it's time to take it / city full of real ones wasn't raised to fake it.'\nSmith slapped the 60-year-old Selective Outrage funnyman and warned him to 'keep my wife's name out of your f***ing mouth' after he delivered a G.I. Jane joke about Jada Pinkett Smith's bald head, which was a result of alopecia.\nCuriously, the Tantrum rapper avoided mentioning or even referring to the 53-year-old Worth author in his freestyle rap despite her being the very reason for his so-called 'chivalrous' outrage.\nWill Smith (R, pictured in 2022) blasted Chris Rock (L) as nothing but a 'joker' in his 'Fire in the Booth' freestyle rap I Am the Illest, which he performed with Charlie Sloth three years after his violent assault against the comedian onstage the 94th Academy Awards\nThe disgraced 56-year-old rapped on June 22: 'Now I'm not the type of man to move in malicious ways / and I am too grown to play childish games / but if you talking crazy out your face up on the stage and disrespect me on the stage'\nAside from throwback snaps, Will and Jada haven't been physically pictured together since the Hollywood premiere of Bad Boys: Ride or Die way back in May 2024.\nOn January 30, People reported that Smith and Pinkett - who were secretly separated from 2016-2022 - 'are still together' but 'living their own lives' in different homes.\nThe hot-tempered Oscar winner seems internally divided on whether he's truly contrite or defiant over slapping Chris, but the subject has crept into his new songs as well as being slapped three times by his Bad Boys co-star Martin Lawrence in their movie.\nHours after the shameful 2022 altercation, Will neglected to apologize to Rock in his acceptance speech, and then he went to the Vanity Fair Oscar Party in Beverly Hills where he celebrated and sang along to his own songs.\nBut the very next day, Smith resigned from the Academy of Motion Picture Arts and Sciences, which banned him from attending any of their events - in person or virtually - until 2032.\n'Change takes time and I am committed to doing the work to ensure that I never again allow violence to overtake reason,' the West Philly native said in a statement at the time.\n'My actions at the 94th Academy Awards presentation were shocking, painful, and inexcusable. The list of those I have hurt is long and includes Chris, his family, many of my dear friends and loved ones, all those in attendance, and global audiences at home.\n'I betrayed the trust of the Academy. I deprived other nominees and winners of their opportunity to celebrate and be celebrated for their extraordinary work. I am heartbroken.'\nOn June 18, Will told BBC Radio 1Xtra that he's done a lot of 'internal work' and 'deep reflection' and 'took a big, strong, honest look at myself.'\nWill (born Willard) added: 'Expect me on the stage'\nHe continued: 'Jokers dish it out, cry foul when it's time to take it / city full of real ones wasn't raised to fake it'\nSmith slapped the 60-year-old Selective Outrage funnyman and warned him to 'keep my wife's name out of your f***ing mouth' after he delivered a G.I. Jane joke about Jada Pinkett Smith's bald head, which was a result of alopecia\nCuriously, the Tantrum rapper avoided mentioning or even referring to the 53-year-old Worth author (R, pictured in 2022) in his freestyle rap despite her being the very reason for his so-called 'chivalrous' outrage\nAside from throwback snaps, Will and Jada haven't been physically pictured together since the Hollywood premiere of Bad Boys: Ride or Die way back in May 2024 (pictured)\nOn January 30, People reported that Smith and Pinkett - who were secretly separated from 2016-2022 - 'are still together' but 'living their own lives' in different homes\nThe hot-tempered Oscar winner seems internally divided on whether he's truly contrite or defiant over slapping Chris, but the subject has crept into his new songs as well as being slapped three times by his Bad Boys co-star Martin Lawrence (L) in their movie\nHours after the shameful 2022 altercation, Will neglected to apologize to Rock in his acceptance speech, and then he went to the Vanity Fair Oscar Party in Beverly Hills where he celebrated and sang along to his own songs\nBut the very next day, Smith resigned from the Academy of Motion Picture Arts and Sciences, which banned him from attending any of their events - in person or virtually - until 2032\nOn June 18, the West Philly native told BBC Radio 1Xtra that he's done a lot of 'internal work' and 'deep reflection' and 'took a big, strong, honest look at myself'\nSmith marveled: 'For the first time in my career, [I was] having to deal with a level of disapproval that I never had to experience. The addiction to the approval of others that I had to dissolve, it was brutal'\nHe added: 'But then all of a sudden, all these new thoughts, new energies, new creativity came through like a geyser and it started showing up as music'\nUnfortunately for the four-time Grammy winner, his first album in 20 years - Based On A True Story - failed to chart in any major territory with Pitchfork blasting it as 'excruciatingly corny' and Rolling Stone calling it 'cringey, clunky, and dated'\nWill is next scheduled to bring his 26-date Based On A True Story UK/European Tour to Spanish music festival Granca Live Fest in Las Palmas this Thursday (pictured last Thursday)\n'For the first time in my career, [I was] having to deal with a level of disapproval that I never had to experience,' Smith marveled.\n'The addiction to the approval of others that I had to dissolve, it was brutal. It was just like there was a manhole cover over some unexplored areas and the manhole cover came off.\n'It was scary for a minute what was in there. But then all of a sudden, all these new thoughts, new energies, new creativity came through like a geyser and it started showing up as music.'\nUnfortunately for the four-time Grammy winner, his first album in 20 years - Based On A True Story - failed to chart in any major territory with Pitchfork blasting it as 'excruciatingly corny' and Rolling Stone calling it 'cringey, clunky, and dated.'\nWill - who gets 11.8M monthly listeners on Spotify - is next scheduled to bring his 26-date Based On A True Story UK/European Tour to Spanish music festival Granca Live Fest in Las Palmas this Thursday.\nSmith's upcoming acting projects include long-delayed sequels to his early aughts blockbusters I Am Legend and Hancock, as well as sci-fi thriller Resistor for Sony Pictures and Michael Bay's amnesia action flick Fast and Loose for Netflix."
    },
    {
      "url": "https://www.dailymail.co.uk/tvshowbiz/article-11827685/Will-Smith-tried-unsuccessfully-make-amends-Chris-Rock-Oscars-slap.html",
      "text": "'He is still remorseful': Will Smith 'has tried unsuccessfully to make amends with Chris Rock' following Oscars slap - after comedian addressed incident in 'brutal' Netflix special\nWill Smith is 'still remorseful' over slapping Chris Rock at the 2022 Oscars and has tried 'unsuccessfully' to make amends with the comedian, a source told People this week.\nThe actor, 54, sent shockwaves around the world when he slapped Rock, 58, onstage after he made a joke about his wife Jada Pinkett Smith's shaved head - with Rock tearing into Will and Jada's relationship and addressing the slap on new Netflix show, Selective Outrage.\nA source told the publication Smith has 'felt terrible for so long', adding: 'He's tried unsuccessfully to make amends in the best way he could with Chris.\n'But beyond that, family is important to him and [Smith] leaned on them. It all has helped him look inside and mature. He is better but still remorseful.\n'Will listened to those who tried to help him and feels that he has become a better person.'\nRemorse: Will Smith is 'still remorseful' over slapping Chris Rock at the 2022 Oscars and has tried 'unsuccessfully' to make amends with the comedian, a source told People this week\nResponse: Chris 's long-awaited public response to being slapped by Smith has been met with high praise - with some calling it the 'best brutal takedown' in history\nChris's long-awaited public response to being slapped by Smith has been met with high praise - with some calling it the 'best brutal takedown' in history.\nAn industry source told People that Rock 'is riding high from the Netflix special.'\nThey added: 'He said what he needed to say and doesn't give a s*** about the reaction either way. He isn't worried.\n'People have been waiting for [Rock's] reaction for a year. For the most part, I think it was well received. People don't expect sugarcoating from Chris Rock.'\nDuring his new Netflix standup special which premiered live Saturday night, Rock verbally hit back at Smith a year after the incident that saw Smith banned from the Academy.\nIn a nearly two minute segment, Rock fired off at Smith's decision to slap him on stage at the awards ceremony, making Smith and Jada Pinkett Smith the butt of his joke about her infidelity.\n'Everybody called him a b**ch, and who's he hitting? Me,' Rock joked to a crowd that included a friend of Meghan Markle's who was spotted laughing backstage, according to Page Six.\nThe comedian also took aim at the former 'Suits' actress during his special, saying she was 'acting all dumb' for not realizing the royal family are the 'OGs of racism.'\nRock's rant has since been applauded on social media as 'the perfect/best way' to get back at Smith for the moment that changed both of their careers.\nThe comedian made audience members and live viewers wait until the last ten minutes of 'Chris Rock: Selective Outrage' before he addressed the slap.\n'You all know what happened to me, getting smacked by Suge Smith,' the comedian joked. Rock said: 'It still hurts. I got 'Summertime' ringing in my ears.'\nDigs: Bringing Jada up in the show, he addressed her affair and his frustration that he was the one who 'bore the brunt' of the couple's marital troubles\nBringing Jada up in the show, he addressed her affair and his frustration that he was the one who 'bore the brunt' of the couple's marital troubles.\n'Will Smith practices selective outrage,' Rock said, giving a nod to the special's title.\n'Everybody that really knows knows I had nothing to do with that. I didn't have any entanglements…She hurt him way more than he hurt me.'\nThe slap occurred last year after Rock made a joke about Pinkett-Smith's bald head, caused by alopecia.\nRock had joked that Pinkett-Smith was rocking a 'G.I. Jane' look which caused her husband to storm the stage and slap him, followed by him repeating: 'Keep my wife's name out your f***ing mouth!'\nDuring his new standup special, Rock joked about his struggle in the year since.\n'Anybody that say \"words hurt\" has never been punched in the face,' he said.\n'But I'm not a victim, baby. You'll never see me on Oprah or Gayle crying,' Rock said. He joked that he 'took that s**t like [Manny] Pacquaio.'\nThe crowd in the audience laughed out loud while those at home took to social media to give their thoughts.\n'Like most comedians I'm continuously grateful for the existence of Chris Rock. Thank you comedy gods,' wrote fellow comedian Jim Gaffigan.\n'Listen me when I tell you. THIS IS THE MOST SAVAGE MIC DROP OF ALL TIME. NUF RESPEC,' wrote on Twitter user.\nThat user was referencing the mic drop at the end of his special when he responds to those who have asked why he didn't slap Smith back, saying: 'You know what my parents taught me? Don't fight in front of white people.'\nThis comes after people called out Chris for getting a fact about Will Smith wrong for a joke he made during his Netflix special.\nChris quipped that he felt the slap and brought up some of Will's movie roles to illustrate that one of them was an action star and the other a funny guy.\nHe said: 'I know you can't tell on camera - Will Smith is significantly bigger than me. We are not the same size, okay? Will Smith does movies with his shirt off. You've never seen me do a movie with my shirt off.\nDeliberate? Fans have criticised Chris Rock for 'deliberately' choosing the city of Baltimore - Jada Pinkett Smith's hometown - to shoot his new Netflix special\n'If I'm in a movie getting open heart surgery, I've got on a sweater. Will Smith played Muhammad Ali in a movie.'\nThe comedian went on to compare their roles in cartoons, saying: 'even in animated movies, I'm a zebra, he’s a f**king shark'.\nThis is in reference to the 2004 movie Shark Tale.\nBut Chris' fans pointed out that Will did not play a shark but instead gave his voice to a fish, a bluestreak cleaner wrasse named Oscar to be precise.\nFans also criticised Chris Rock for 'deliberately' choosing the city of Baltimore - Pinkett Smith's hometown - to shoot his new Netflix special.\nMost watched News videos\n- Moment passengers 'stop' man who pulled down trousers on tube\n- Shocking moment man is gored to death after charging at bull\n- Moment Cycling Mikey pushes bike into a car after furious row\n- Shocking moment woman strikes flight attendant before being removed\n- Chinese Navy ship collides with own vessel while chasing boat\n- Chinese navy vessel collides with one of its own chasing Philippine boat\n- Florida man knocks out kayakers while attempting a DAREDEVIL leap\n- Family-friendly restaurant Cracker Barrel unveils bold new look\n- Kristen Welker calls out JB Pritzker over Gerrymandering\n- Hawaii ferry is tossed by strong waves before being run aground\n- Father of children mowed down in Oatlands tragedy confronts killer\n- Jennifer Lopez has an unexpected guest during her concert"
    },
    {
      "url": "https://www.dailymail.co.uk/tvshowbiz/article-8967087/Will-Smith-Janet-Hubert-emotionally-end-27-year-feud-Fresh-Prince-Bel-Air-reunion.html",
      "text": "Will Smith and Janet Hubert emotionally end their 27-year feud on Fresh Prince Of Bel-Air reunion... after she tells him: 'You guys went so far, I lost so much'\nWill Smith and Janet Hubert finally hashed out their feud which has been running since her departure from The Fresh Prince Of Bel-Air.\nJanet, 64, played Aunt Viv on the first three seasons of the sitcom but left in 1993, setting off a public war of words with Will and the collapse of her career.\nNow on a new reunion special with HBO Max she and Will, 52, talked emotionally through their past difficulties as she told him: 'I lost everything.'\nTalking it out: On a new HBO Max reunion special, Will Smith and Janet Hubert hashed out their feud which has been running 27 years since her departure from The Fresh Prince Of Bel-Air\nWill and Janet had a one-on-one conversation in a movie theater setting, separate from the general cast reunion in a recreation of the sitcom's living room set.\n'I just wanted to know one thing: why, why so far? You guys went so far. I lost so much,' she said to Will of their feud. 'How do we heal that?'\nWill suggested that he should 'know your story,' and Janet said: 'You have no idea,' adding that the experience 'was insane' for her.\nWhile filming season three Janet was pregnant with her son Elijah - and on the reunion special she alleged she was in a 'very abusive marriage' at the time.\nThe way they were: Janet, 64, played Aunt Viv on the first three seasons of the sitcom but left in 1993, setting off a public war of words with Will and the collapse of her career\nAt that point Janet was with her first husband James Whitten, whom she ultimately divorced in 1994, the year after she left The Fresh Prince Of Bel-Air.\nShe said in a confessional that when she was working during her tough pregnancy: 'I was no longer laughing, smiling, joking, because there were things that were going on that nobody knew about. The cast had no idea what was going on.'\n'You know, during that time of her pregnancy I wasn't sensitive. I wasn't perceptive,' Will admitted in his own confessional. 'And you know, now that I've had three kids I've learned some things that I did not know at the time and I would do things very differently, but I can see where I made the set very difficult for Janet.'\nJanet also denied the reports that she was fired, saying she left over a 'really bad deal' that limited the amount of work she could do on the sitcom while also hemming her into a non-compete arrangement.\nTogether again: Will and Janet had a one-on-one conversation in a movie theater setting, separate from the general cast reunion (pictured)\n'So that meant my salary was cut. I had a new baby and a husband who was out of work. So I said no. I did not accept their offer. I was never fired,' she insisted.\nShe told Will that 'when I left the show I had this new baby and no one. Family disowned me. Hollywood disowned me. My family said: \"You've ruined our name.\"'\nJanet added: 'And I wasn't unprofessional on the set. I just stopped talking to everybody because I didn't know who to trust because I'd been banished, and they said it was you who banished me, because you were Will. You were a kid. It was hard.'\n'I was 21 years old, you know. Everything was a threat to me,' said Will slowly, and when Janet asked why she was in that category he said: 'Not you, the world. I was so driven by fear - and jokes and comedy.'\nThrowback: Janet is pictured in a publicity still from the show with (left to right, top to bottom) Joseph Marcell, James Avery, Alfonso Ribeiro, Tatyana Ali and Karyn Parsons\nThe Hollywood heartthrob said that in the intervening years, divorce, remarriage and parenthood have enabled him to 'see now the level and pain and the level of struggle that it was for you just to show up everyday, and then - '\n'But you took all that away from me with your words,' Janet interjected. 'You know, words can kill. I lost everything. Reputation, everything. Everything. And I understand you were able to move forward, but you know those words, calling a black woman \"difficult\" in Hollywood is the kiss of death.'\nShe went on: 'It's the kiss of death, and it's hard enough being a dark-skinned black woman in this business. But I felt it was necessary for us to finally move forward - and I'm sorry that I have blasted you to pieces,' she added with a laugh.\nJanet struggled to hold back her tears as Will thanked her for her side of the story and said: 'When I look back now it's, you know, it's obvious that you were having a hard time and I felt like you hated me.'\nRepose: Joseph, James, Alfonso, Tyler Collins, Kadeem Hardison, Will, Quincy JOnes, Al B. Sure!, Tatyana, Janet and Karyn are pictured during a shoot day on the show in 1990\nShe touched his cheek and he placed a hand on her shoulder while he said: 'I could not do a 30-year celebration of this show and not celebrate you - celebrate your contribution to the show, celebrate your contribution to my life.'\n'I didn't come here to have animosity. I came here to resolve 'cause it's time,' she said in a confessional, calling her conversation with Will 'healing.'\nWill's chat with Janet was taped in September after she posted to her Instagram fan page urging him to discuss their problems with her face to face.\nDearly departed: The reunion had to take place in the absence of James Avery who died of complications from an open heart surgery in 2013 at the age of just 68\n'So September comes after August it's the 30th anniversary a Fresh Prince. And they want to start a war. Well here is my challenge - we can either keep this war going for another 30 years but I'm not going to, or you can sit down with me and talk to me and not about me Mr. Smith then let's do it,' wrote Janet.\n'Can you only sit and talk about your strange unsavory problems in front of the world?' she said, apparently having a dig at Will's recent Red Table Talk with his wife Jada Pinkett Smith about her affair with R&B singer August Alsina.\n'Accept my challenge or shut up! Either you're telling the truth and the BLACK MEN of the cast are telling the truth or I'm telling the truth. And only YOU and I... and quite a few others, know the truth let's do this do YOU have the courage? #seeyouinseptember,' Janet concluded\n'Well here is my challenge': Will's chat with Janet was taped in September after she posted to her Instagram fan page urging him to discuss their problems with her face to face\nWill apparently accepted her challenge as the pair sat down for the reunion taping this September 9, 30 years to the day since the show premiered.\nJanet had publicly held Will responsible for her exit from the show, calling him an 'egomaniac' during a 2011 interview where she said a reunion was off the table.\n'There will never be a reunion...as I will never do anything with an a**hole like Will Smith,' she declared to TMZ, adding that 'This constant reunion thing will never ever happen in my lifetime unless there is an apology, which he doesn't know the word.'\nFive years later she said on YouTube that while on the show she approached Will to help her and their co-stars negotiate a wage hike 'like they did on Friends.'\n'Janet Hubert was never difficult on that set': Four years ago Janet appeared on The Real and discussed the aftermath of her departure from The Fresh Prince Of Bel-Air\nShe claimed that Will rebuffed her efforts, alleging that he told her: 'My deal is my deal and y'all's deal is y'all's deal.'\n'I can say straight up that Janet Hubert wanted the show to be The Aunt Viv Of Bel-Air Show because I know she is going to dog me in the press,' Will said on the radio in Atlanta the year she left the series.\n'She has basically gone from a quarter of a million dollars a year to nothing. She’s mad now but she’s been mad all along,' he added.\n'She said once: \"I’ve been in the business for 10 years and this snotty-nosed punk comes along and gets a show.\" No matter what, to her I’m just the AntiChrist.'\n'A**hole': Janet has in the past held Will responsible for her departure from the show, calling him an 'egomaniac' during a 2011 interview where she said a reunion was off the table\nFour years ago Janet appeared on The Real and discussed the aftermath of her departure from The Fresh Prince Of Bel-Air.\n'Janet Hubert was never difficult on that set. Janet Hubert was so professional it wasn’t even funny. I think Will simply needed to win and I think sometimes when you get caught up in a lie – and those things never happened,' Janet insisted.\n'She never left the set. I never left the set. We got along great. I think he was young and he was inexperienced and I think he simply had to win.'\nReferring to Will's then-manager James Lassiter she said: 'I spoke to JL when my dad died and my brother died and I begged them, I said: \"I have a family. I need you to tell the world that this stuff didn’t happen.\" And I was waiting in my heart thinking: \"Somebody will come to me one day and help me,\" but they didn’t.'\nYou can watch The Fresh Prince of Bel-Air Reunion on HBO or on Stan in Australia.\nMost watched News videos\n- Moment passengers 'stop' man who pulled down trousers on tube\n- Shocking moment man is gored to death after charging at bull\n- Moment Cycling Mikey pushes bike into a car after furious row\n- Shocking moment woman strikes flight attendant before being removed\n- Chinese Navy ship collides with own vessel while chasing boat\n- Chinese navy vessel collides with one of its own chasing Philippine boat\n- Florida man knocks out kayakers while attempting a DAREDEVIL leap\n- Family-friendly restaurant Cracker Barrel unveils bold new look\n- Kristen Welker calls out JB Pritzker over Gerrymandering\n- Hawaii ferry is tossed by strong waves before being run aground\n- Father of children mowed down in Oatlands tragedy confronts killer\n- Jennifer Lopez has an unexpected guest during her concert"
    },
    {
      "url": "https://www.dailymail.co.uk/tvshowbiz/jada-pinkett-smith/index.html",
      "text": "Advertisement\nRELATED TOPICS FOR Jada Pinkett Smith\nJada Pinkett Smith - Latest news, views, gossip, photos and video\nPage\nWill Smith takes aim at Chris Rock with savage Oscar slap lyric in cringey freestyle\n29/06/25 22:56\nWill Smith blasted Chris Rock as nothing but a 'joker' in his 'Fire in the Booth' freestyle rap I Am the Illest, which he performed with Charlie Sloth three years after his violent assault against the comedian onstage the 94th Academy Awards. 'Now I'm not the type of man to move in malicious ways / and I am too grown to play childish games / but if you talking crazy out your face up on the stage and disrespect me on the stage,' the disgraced 56-year-old rapped on June 22....read\nWill Smith gives bizarre take on how that Chris Rock Oscars slap impacted his career as he reflects on authenticity and imperfection\n21/06/25 00:53The actor, 56, reflected on the incident - where he struck Chris, 60, on stage over a joke about his wife Jada Pinkett Smith's shaved head, which was due to her alopecia diagnosis.Jaden Smith showcases his usual quirky sense of style in a giant fluffy black hat as he steps out for dinner in Paris\n09/04/25 07:48The rapper, 26, was joined by a group including a mystery woman he was seated next to, and luxury fashion designer Christian Louboutin.Real reason Tupac split up with Madonna revealed in heart-wrenching break up letter\n30/03/25 08:10The California Love rapper penned the break-up letter to the Vogue songstress from his jail cell in Rikers Island, New York, in 1995.Will Smith's son Jaden raises eyebrows in tweed top with cinched waist and heels as bizarre look divides fans\n13/03/25 20:31Smith, who is no stranger to edgy and at times bizarre fashion choices, attended a Louis Vuitton event in a puffy-sleeved tweed tunic with cinched waist and plunging neckline.Will Smith slammed for 'inappropriate' act with singer India Martinez amid unusual marriage with Jada Pinkett\n25/02/25 18:33Will Smith has been blasted over an 'inappropriate' act with a female singer onstage amid his unusual marriage arrangement with wife Jada Pinkett.Will Smith eyes Zendaya to play a major role in possible sequel to one of his biggest hits\n20/02/25 04:06Will Smith is teasing a major new sequel to one of his highest-grossing films - and he thinks Zendaya would be perfect for the cast.Celebrity couples' yearbook photos: From Tom Hanks and Rita Wilson to Harrison Ford and Calista Flockhart\n08/02/25 19:14They might be loved up and happily married now, but these eight celebrity couples were once just single high school students.Ricky Gervais risks a slap from Will Smith as he mocks his son Jaden's viral Grammys look with cheeky reference to THAT Jada Pinkett Oscars joke - as fans declare he's 'won the Internet'\n06/02/25 11:47The comedian, 63, has never been shy at making brutal take-downs of A-list stars and took the opportunity to mock both Will's son and his wife on X on Monday.Will Smith attends Grammys WITHOUT Jada after bizarre marriage arrangement exposed\n03/02/25 03:20Will Smith hit the red carpet at 2025 Grammy Awards, without his significant other Jada Pinkett Smith.Will Smith and Jada Pinkett's bizarre marriage arrangement revealed\n31/01/25 01:47Will Smith and Jada Pinkett Smith are continuing to live in separate homes, though insiders insist the pair are still together.The A-list of step parents! Celebrities who raise their 'bonus children' as their own amid a rise in blended families\n04/01/25 08:56The elite parenting club includes members of royalty, Hollywood and sport, as stars like Russell Wilson, Gabrielle Union and Princess Beatrice proudly show off their blended broodJada Pinkett Smith, 53, enjoys relaxing soak in her pal's lavish bathtub as she shares intimate bathroom photo\n02/12/24 00:22Jada Pinkett Smith enjoyed a pampering session over the weekend. The Matrix star, 53, shared an intimate new photo of herself as she soaked in a luxurious bathtub on Sunday.Jada Pinkett Smith sparks health concern following rare date night with husband Will Smith\n10/11/24 22:41Jada Pinkett Smith has sparked concern among fans after a recent date night with husband Will Smith.Will Smith and Jada Pinkett cozy up on rare date night in first joint sighting in 6 MONTHS amid split drama\n08/11/24 18:48Will Smith and wife Jada Pinkett looked closer than ever as they enjoyed a rare date night in LA on Thursday - marking their first joint sighting since May .The 'brutal' cosmetic procedure more women are getting that make them 'like a virgin again'\n20/10/24 18:17As duck lips and Brazilian butt lifts continue to lose popularity, there's one wild procedure that's surprisingly gaining traction among women.Will Smith breaks down in tears as he reflects on the 'terrifying' birth of his son\n04/10/24 14:38The Men in Black alum, 56, broke down in tears as he reflected on the immense fears he felt after the birth of his first son, Trey, as he admitted that becoming a dad 'shook him to his core.'Bizarre reason Will Smith and Phillip Schofield aren't getting divorced from their wives despite splitting up\n03/10/24 16:04Philip Schofield's loyal wife is one of a growing band of SNODs - people who are separated from their spouses but remain legally married, and intend to stay that way.Will Smith FARTING on set caused film crew to be evacuated for three hours - director claims\n02/10/24 23:55Barry Sonnenfeld, who directed the 1997 action comedy Men In Black, has opened up about what it was like working with Will Smith.Wild video of Jaden Smith angry in Paris more than two years after dad Will Smith's Oscars slap\n02/10/24 22:50The Malibu, California native's ex-girlfriend Sab Zada, 25, was also pictured speaking with him and amid a group of friends during the outing.Jaden Smith showcases his rock hard abs as he goes shirtless beneath a leather jacket while putting on an animated display at Louis Vuitton show during Paris Fashion Week\n01/10/24 17:47he son of Will Smith and Jada Pinkett Smith , 26, went shirtless beneath a fur-trimmed leather jacket which he teamed with black trousers.Will Smith's son Jaden makes shock announcement on dad's 56th birthday\n26/09/24 21:53Jaden Smith stole a bit of his father's thunder on his 56th birthday. He shared a video to Instagram on August 25 showing a man putting up a poster that appeared to announce a new musical project.Willow Smith looks incredible in a fur coat and thigh-high stockings at Acne Studios' Paris Fashion Week show\n25/09/24 20:21The singer, 23, wore a dramatic cropped fur coat with thigh-high stockings and a black bodysuit.Jada Pinkett Smith sets her Instagram account to private after cryptic post about marriage\n04/09/24 02:24The actress, 52, has 11 million followers on the social media platform, put up a picture of a text block with a detailed message.Jaden Smith steps out with ANOTHER woman after ditching his girlfriend of four years, model and singer Sab Zada, for influencer Khleopatre\n30/08/24 10:30Jaden Smith stepped out with a mystery woman in West Hollywood on Thursday night after ditching his girlfriend of four years, model and singer Sab Zada for influencer Khleopatre.Jaden Smith puts on VERY amorous display with thong-clad influencer Khleopatre on yacht - one week after date with longterm partner Sab Zada\n14/08/24 16:20Will Smith and Jada Pinkett Smith's son Jaden Smith put on a very amorous display with influencer Khleopatre while on a yacht off the coast of Ibiza.Hollywood comedy icon unleashes five-minute rant against Will Smith in scathing radio interview two years after THAT Oscars slap: 'Utter fraud'\n12/06/24 00:51American comedian Rob Schneider has brutally slammed actor Will Smith in a scathing interview, labelling the Hollywood star a 'liar' and an 'a**hole'.Will Smith is joined once AGAIN by Jada Pinkett's look-alike at the Miami premiere of Bad Boys: Ride Or Die\n06/06/24 18:44Will Smith is continuing to fuel romance rumors with a mystery woman, who bears an undeniably striking resemblance to his estranged wife Jada Pinkett Smith.Will Smith and Martin Lawrence are in good spirits as they share a laugh while speaking at Bad Boys: Ride Or Die screening in New York City\n04/06/24 07:14Will Smith and Martin Lawrence made a special appearance at a screening of their new film Bad Boys: Ride or Die in New York City on Monday. The screening was hosted just before the film is released.Will Smith and Jada Pinkett Smith make first joint appearance since separation reveal - as couple are joined by their children at the Bad Boys: Ride Or Die premiere in LA\n31/05/24 02:48Will Smith and Jada Pinkett Smith made their first joint red carpet appearance since revealing they have been secretly separated for seven years, at premiere of Bad Boys: Ride Or Die.Will Smith joins co-star Martin Lawrence on the red carpet in Berlin as they attend the European premiere of Bad Boys: Ride or Die\n27/05/24 20:57The actor teamed up with Martin once again for the fourth instalment of their franchise and looked in good spirits as he took to the red carpet with his co-star.Rage on the red carpet! After Kelly Rowland's outburst at Cannes, we reveal the biggest outbursts when A-list tempers were running high at glitzy events\n23/05/24 09:40Kelly Rowland made headlines as she appeared to furiously scold a security guard at Cannes on Tuesday - but she's not the only celebrity to have lost their temper on the red carpet.Will Smith and his estranged wife Jada Pinkett Smith are joined by Martin Lawrence at the world premiere of Bad Boys: Ride Or Die\n23/05/24 06:43Will Smith and his estranged wife, Jada Pinkett Smith, posed for several glammed-up photos during the world premiere of Bad Boys: Ride Or Die, which was held in Dubai.Jada Pinkett Smith puts on leggy display in black Alaïa dress as she joins Jewel and Cynthia Erivo at star-studded Los Angeles LGBT Center Gala\n19/05/24 05:05As she presented Cynthia Erivo with an award at the Los Angles LGBT Center Gala, Jada Pinkett Smith dipped into her archives for a backless black Alaïa dress she previously wore nearly 20 years agoWill Smith calls estranged wife Jada Pinkett Smith one of his 'ride-or-dies' - despite secret seven-year separation\n16/05/24 18:47Will Smith knows he can always count on his wife Jada Pinkett Smith, despite making the decision to secretly separate in 2016.Jaden Smith and his model girlfriend Sab Zada match in hoodies and trainers for a casual date night\n14/05/24 09:16Jaden Smith enjoyed a date night at a West Hollywood restaurant with his girlfriend Sab Zada on Monday.Will Smith celebrates Mother's Day with the whole family in Malibu including wife Jada Pinkett Smith, mother Caroline, mother-in-law Adrienne and his three kids\n13/05/24 07:02Will Smith gathered his entire family for a huge Mother's Day celebration in Malibu on Sunday.Will Smith's 'guards take down a trespasser at his LA home' until police make arrest... 3 months after wife Jada Pinkett Smith scared off intruders\n07/05/24 15:58On Wednesday, police responded twice to calls from Will Smith's Los Angeles home, where a trespasser made his way onto the grounds and was subdued by the actors' guardsHollywood nepo babies Willow and Jaden Smith play it cool in edgy outfits at 2024 Met Gala\n07/05/24 04:20Willow Smith, 23, and her older brother Jaden, 25, wore color coordinated outfits on Monday to the 2024 Met Gala in New York City.Willow Smith admits that she has 'a little bit of insecurity' about being branded a 'nepo baby' but adds now she 'doesn't have to prove s**t to anyone'\n03/05/24 00:42Willow Smith is adding to the growing ongoing conversation swirling around Hollywood about 'nepo babies' as the daughter of Will Smith and Jada Pinkett Smith.Why you won't see Will Smith on the red carpet or on late night tv to promote his latest blockbuster Bad Boys: Ride or Die\n30/04/24 14:32DailyMail.com can reveal that Will Smith has refused to participate in any press for his upcoming film.Who are the shortest actresses in Hollywood? And it's not just the Kardashians (hint: one lady is 4ft11in). Here is a look at the 5ft3in and under crowd\n27/04/24 15:12Plenty of Hollywood actresses are quite short - under 5ft5in that is - but it is hard to tell when they are in front of the camera because they are styled to look statuesque. Platform heels help.Victoria Beckham's birthday guest list show who's in (and who's out) of close friendship group from her WAG days in the US\n22/04/24 11:09The former Spice Girl celebrated turning 50 at Oswald's in Mayfair this weekend - but how many of the Beckhams' exclusive LA friendship group made the guestlist?Will and Jada Pinkett Smith make appearance at Coachella together to support their daughter Willow as she joins Jon Batiste for his set\n15/04/24 08:29Will and Jada Pinkett Smith made an appearance at Coachella over the weekend as they supported their daughter Willow who was performing at the festival.Will Smith brings back memory-wiping Men In Black character during surprise performance at Coachella... for first gig since THAT slap\n15/04/24 06:52Will Smith returned to the Coachella stage on Sunday in Indio, California, as he joined J Balvin for a surprise performance of his song Men In Black.Will Smith sidesteps question about $350M net worth after shuttering flailing charity two years after his infamous slap of Chris Rock at Academy Awards\n27/03/24 22:53The Oscar-winning actor, 55, was asked if a reported $350 million net worth gleaned via a Google search was accurate.Will and Jada Smith's charity tanks after Oscars slap debacle taking in just $365,000 in 2022 - compared to more than $2MILLION the year before\n27/03/24 01:25In the aftermath of Oscar slap-gate, Will and Jada Smith's charity seems to be shuttering.Will and Jada Pinkett Smith are shutting down their charity after donor exodus spurred by his shock Oscars slap led to 83 PERCENT revenue drop\n26/03/24 23:51Variety also reported that Will and Jada Pinkett Smith's charity had $3,000 in overdraft fees and seemingly had no paid staffers in 2022.Whoopi Goldberg is left SEETHING after The View CUTS OFF her Oscars commentary, as co-host Ana Navarro sparks outrage by comparing Will Smith to viral dog Messi and joking about Eva Longoria's 't**ties'\n11/03/24 18:28Whoopi, 68, was sharing her opinions about some of the Academy Award winners from when the Oscars music started playing, which stopped the furious Sister Act star in her tracks.Chris Rock takes daughters to dinner after hitting a pre-Oscar party... 2 years after that infamous SLAP which got Will Smith banned from the Academy Awards\n10/03/24 18:49Chris Rock took his daughters Lola, 21, and Zahra, 19, to dinner on Sunday. The proud dad and his kids were seen leaving celebrity hot spot Giorgio Baldi in Santa Monica.Will Smith's daughter Willow Smith, 23, goes TOPLESS in stunning black-and-white image as she teases new single Symptom Of Life\n04/03/24 21:40Willow Smith took to her social media channels on Monday to tease artwork for her forthcoming new single Symptom of Life. Her father is movie star Will Smith.Jada Pinkett Smith's 'heart broke' for 'courageous' Taraji P. Henson when she cried over pay disparity: 'She is the breadwinner of her family. Her pressures are different than mine'\n27/02/24 19:07Last December, the 53-year-old Oscar nominee broke down in tears while admitting to only being paid 'a fraction' of what she feels she's worthHer fans include Paris Hilton and Jada Pinkett Smith. And her husband is Jay Shetty, Hollywood's favourite life coach. Here Radhi Devlukia-Shetty reveals how singing to your food and eating dessert first can brighten your skin and give you shiny hair\n25/02/24 21:12In an extract from her debut cookbook, JoyFull, Devlukia-Shetty explains how her plant-based recipes fuse ancient wisdom with a more modern lifestyle.Jordyn Woods follows on-off best pal Kylie Jenner's high fashion footsteps as she covers up in a stunning look alongside Coco Rocha and Bella Thorne at Viktor&Rolf PFW show\n25/01/24 10:36The stunner, 26, oozed elegance in an incredible all-black ensemble comprising a high-necked, tight top with a silk skirt and statement hatJada Pinkett Smith jokes she 'hasn't been able to get away from Will Smith' after David Blaine performed 'crazy' magic trick to spice up their 'connection'\n24/01/24 22:40Jada Pinkett Smith revealed that she once became 'emotional' over a magic trick performed on her and her husband, Will Smith. She said illusionist David Blaine brought her to tears.Jada Pinkett Smith reveals dog Fang she shares with Will Smith has died at age 15 as she pays tribute: 'He brought so much love into our family'\n24/01/24 17:19Jada Pinkett Smith shared her family's heartbreak over the loss of their beloved dog on Wednesday. The Set It Off veteran shared sweet pics of their husky Fang, who died at age 15.Will Smith and Jada Pinkett Smith have a dinner date reunion at Nobu Malibu before leaving SEPARATELY... after Jada said Will's shock Oscars slap 'saved' their marriage\n04/01/24 18:41Will Smith and his wife Jada Pinkett Smith reunited for a cozy dinner date at the celebrity hot spot Nobu Malibu on Wednesday night.Jada Pinkett Smith gets confused for Fat Joe 'on Ozempic' as her 2024 selfie goes viral with hilarious memes: 'She looks like Skinny Joe'\n03/01/24 06:04Jada Pinkett Smith is taking 'new year, new you' to a new level, as her first selfie of 2024 is drawing comparisons to Fat Joe. The photo was fabulous, but it didn't take long for fans to see similarities.Al Roker celebrates granddaughter Sky Clara's first Christmas while Hoda Kotb cozies up to daughters Hope and Haley in adorable matching PJs - as Today hosts mark holidays with family\n26/12/23 19:51The Today show presenters have celebrated with their nearest and dearest over the festive period, with Al Roker joining his granddaughter, Sky Clara, for her first Christmas.Christmas Day in Hollywood! Will Smith and Jada Pinkett Smith reunite for family snaps after bombshell memoir revelations as they lead celebs taking to social media to celebrate holiday\n26/12/23 00:47The actor, 55, reunited with his estranged wife, their two children and her parents for a fun and festive family photoshoot, which he shared on Instagram on Monday morning.Chris Rock spotted out with daughter Zahra in New York City after turning down the Golden Globes hosting gig\n17/12/23 22:14Chris Rock and his daughter Zahra Rock, 19, spent some quality time together in New York City on Saturday. He shares Zahra and his other daughter Lola Rock, 21, with his ex-wife.As Helen Flanagan gets close to David Haye and Sian Osborne - a look at other celebrity 'throuples' from Bella Thorne to Brooklyn Beckham and Jada Pinkett Smith\n17/12/23 08:16David Haye and his girlfriend Sian Osborne are reportedly on their fourth throuple of the year after hitting it off with Helen Flanagan.Kim Basinger, 70, of 9 1/2 Weeks fame looks youthful during rare outing in LA... after ex Alec Baldwin said Barbra Streisand is 'hottest woman ever'\n14/12/23 19:59Kim Basinger was spotted enjoying a bit of retail therapy in Beverly Hills on Thursday. The Oscar winner glowed as she made her way to a valet station just days after celebrating her 70th.Chris Rock DECLINES to host Golden Globes 2024 awards along with Ali Wong and Smartless hosts Will Arnett, Sean Hayes and Jason Bateman\n11/12/23 18:36The four comedians have turned down the opportunity to head up the award ceremony in Hollywood on January 7 - and the institution has not yet released who will be hosting.Willow Smith all but confirms romance with Aussie singer Eddie Benjamin as they pack on the PDA at Bronte Beach in Sydney\n10/12/23 03:04Willow Smith recently touched down in Sydney, Australia to attend the GQ Men of the Year Awards with her rumoured boyfriend, Aussie singer Eddie Benjamin.Will Smith is spotted for a SECOND time with a mystery woman that looks strikingly similar to his estranged wife Jada Pinkett Smith in Miami\n09/12/23 21:17Will Smith was spotted with the mystery woman who looks like his estranged wife Jada Pinkett Smith for a second time during Miami's Art Basel events.Jada Pinkett Smith reveals why she'll never leave Will Smith - even though they have separate homes - and how 'the Oscars slap saved my marriage'\n09/12/23 16:53When a marriage hits a rocky patch, couples find different ways of bringing back the magic - date night or perhaps counselling.Will Smith seen with mystery female rocking similar look to estranged wife Jada Pinkett Smith - as they leave Miami Art Basel together... following revelation of couple's 'split' seven years ago\n08/12/23 18:25Will Smith was spotted with a mystery woman at the Art Basel event in Miami on Friday. The actor and the woman reportedly departed the famous art fair together in the same limousine.Willow Smith cuts a casual figure as she is spotted carrying activist tote bag while dining at Luna Lu in Sydney ahead of her appearance at the GQ Awards\n05/12/23 23:45Willow Smith cut a low-key casual figure as she was spotted dining at popular Asian fusion restaurant Luna Lu by Sydney Harbour.Willow Smith makes a low-key arrival into Sydney ahead of her appearance at the GQ Awards... after her mother Jada Pinkett Smith declared she and Will would be together 'forever'\n05/12/23 04:49Willow Smith touched down in Sydney on Tuesday ahead of her appearance at the GQ Awards.Will Smith and Johnny Depp share a friendly embrace while attending the star-studded Red Sea Film Festival in Saudi Arabia\n04/12/23 02:56Will Smith shared a friendly hug with fellow Hollywood star, Johnny Depp, as the pair attended the star-studded, Red Sea International Film Festival held in Jeddah, Saudi Arabia.Will Smith admits he's 'made tons of mistakes' and says 'fame can be a unique monster'... after Jada Pinkett Smith's split revelation and THAT Oscars slap\n03/12/23 06:13Will Smith opened about about his personal life, including his many publicized ups and downs in recent years at the Red Sea International Film Festival.Dolly Parton recalls meeting Keanu Reeves 'when he was just little' as his costume designer mother worked with her\n01/12/23 05:30The 77-year-old music legend was asked about her work with Reeves' mother Patricia Taylor, who helped put together the outfit she wore on the cover of Playboy in 1978.Jada Pinkett Smith reveals whether she and estranged husband Will Smith are 'staying together forever' after secretly separating SEVEN years ago\n29/11/23 00:19Jada Pinkett Smith confirmed she has no plans to divorce her estranged husband Will Smith after revealing they've been secretly separated since 2016.Will Smith kisses wife Jada Pinkett Smith's head during cozy Thanksgiving celebration... after he denied gay affair rumors with Duane Martin\n25/11/23 06:00Will Smith and Jada Pinkett Smith spent Thanksgiving together, joined by their three children - Jaden Smith, 25, Willow, 23, and Trey, 31, from Will's previous marriage.Jordyn Woods says there's 'no shade' intended after wearing letterman jacket that references Tristan Thompson cheating scandal\n22/11/23 16:54Jordyn Woods insisted she wasn't trying to reignite a feud with Khloé Kardashian via her jacket from Monday.Jada Pinkett Smith says she has NEVER seen Will Smith with a man after declaring they will SUE over gay affair rumors with Duane Martin\n16/11/23 22:54Unlike her 55-year-old estranged husband who has mostly remained quiet during the controversy, the 52-year-old author did not hold back from commenting on it once again.Tristan Thompson, 32, discusses rocky power dynamic between him and Jordyn Woods, 26, amid their 2019 cheating scandal: 'I should have handled it as the older, wiser person'\n16/11/23 18:02Tristan Thompson has opened up about his regrets over his illicit kiss with Jordyn Woods behind Khloe Kardashian 's back in 2019.EXCLUSIVE: Will Smith feels he is the 'target of a SMEAR campaign' after he was accused of having sex with Duane Martin by close friend Brother Bilaal - with wife Jada and their kids 'hurt' by shock claim\n16/11/23 17:31Will, 55, was accused of engaging in a sexual act with his friend Duane Martin, by his former assistant Brother Bilaal, who has made shockwaves with the explosive claim.Duane Martin's now ex-wife Tisha Campbell SLAMMED Will Smith gay affair rumors in unearthed 2012 tweet: 'Stop perpetuating LIES'\n16/11/23 16:18Martin actress Tisha Campbell was married to Martin for 24 years from 1996 to 2020 and back in March 2012 tabloid Star Magazine had a cover story about alleged secret same-sex relationship.\nPage\nDON'T MISS\n-\nHeartbroken David and Victoria Beckham fear Brooklyn has 'quit the family' after failing to invite ANY of his relatives to vow renewal with Nicola Peltz\n-\nEXCLUSIVE\nCat Deeley is snapped for the first time since her shock split from husband Patrick Kielty... with a male friend in Spain\n-\nTopless Nicola Peltz, 30, poses with her ageless mother Claudia, 70, as she shares a glimpse into the morning before she renewed her vows\n-\nEXCLUSIVE\nOlivia Rodrigo ENGAGED? Singer flashes huge new diamond ring on THAT finger... after romantic home tour with Brit actor boyfriend\n-\nCristiano Ronaldo forked out eye-watering seven-figure sum on model Georgina Rodriguez's incredible diamond engagement ring\n-\nEXCLUSIVE\nThe Yorkshire Vet's Matt Jackson-Smith reveals how to care for your dog as they grow up, and his dog Harry's VERY unusual traits\nAd Feature\n-\nStacey Solomon wows in plunging black bikini as mother-of-five enjoys luxury family holiday and admits she felt 'beautiful' in stunning snaps\n-\nInsiders tell KATIE HIND what 'furious' ITV production staff REALLY think of the 'rubbish' household names who are escaping jobs bloodbath\n-\nMoment Christine McGuinness shares doubts over joining Celebs Go Dating as she panics 'this isn't normal' before quitting the show\n-\nSmart moves: The 10 must-know education brands helping the UK learn better and faster\nAd Feature\n-\nOasis' future after their string of reunion gigs end 'revealed' as Gallagher brothers are flooded with performance opportunities\n-\nJoshua Jackson sparks romance rumors with Bridgerton star two years after dramatic divorce from Jodie Turner-Smith\n-\nAngelina Jolie is the latest Hollywood star planning to sell up and LEAVE LA... as she plots sale of 'historic' home\n-\nEDEN CONFIDENTIAL: Erin finds the jewel in her Crown - a new leading lady\n-\nThe stars of the much-loved Wittering Whitehalls podcast on how a hearing check has changed their relationship\nAd Feature\n-\nS Club 7's Jon Lee, 43, reveals he hasn't had sex in SIX years on Celebs Go Dating after 'traumatic' dating past\n-\nChris Hemsworth celebrates 42nd birthday in Ibiza with star-studded bash - while wife Elsa Pataky looks downcast as she shops alone in Australia's Byron Bay\n-\nNicola Peltz wears her mother's dress in secret vow renewal officiated by her father Nelson... while David and Victoria are thousands of miles away\n-\nKylie Jenner shows Timothée Chalamet what he's missing as she posts sexy snaps after birthday snub amid split rumors\n-\nEating for bump, and beyond! Pregnancy nutritionist reveals her top diet advice for those trying to conceive, pregnant, breastfeeding and baby nutrition\nAd Feature\n-\nCelebrity SAS star Lucy Spraggan breaks down in floods of tears after revealing horrifying rape ordeal during her time on the X Factor\n-\nI, Robot star hints at drama on Will Smith film after claiming his cyborg role 'tested higher' with audiences\n-\nEXCLUSIVE\nMyleene Klass' revenge wardrobe: Expert reveals how star is sending secret fashion signals amid Rochelle Humes 'feud'\n-\nKelly Clarkson's late ex-husband Brandon Blackstock is remembered in moving tribute by son after shock death from cancer\n-\nSip smarter this summer: Discover the 'Magic of Moderate Drinking' with these simple tips\nAd Feature\n-\nCristiano Ronaldo and Georgina Rodríguez are engaged! Footballer's fiancee reveals GIANT diamond ring\n-\nStrictly Come Dancing 2025: Love Island winner, Doctor Who star and footballing legend confirmed to take part in the competition\n-\nEd Westwick and his wife Amy Jackson pack on the PDA in swimwear-clad snap as they share a look at their family holiday to Italy\n-\nLiam Hemsworth and Gabriella Brooks spark engagement rumours after actress flaunts diamond ring in Ibiza\n-\nGet set for a totally WICKET summer: The Hundred is rolling into cities across the UK - this is how YOU and your family can join the fun\nAd Feature\n-\nEXCLUSIVE\nRita Ora's husband Taika Waititi wears tone-deaf T-shirt on star-studded Ibiza trip for Chris Hemsworth's birthday\n-\nMaya Jama shows off her incredible bikini body as she parties with AJ Odudu on 24 hour trip to Ibiza\n-\nJennifer Lopez shows off famous derriere in sultry snaps after Ben Affleck romance\n-\nBrad Pitt burglary suspects arrested after cops link separate heist to A-lister's home break-in\n-\nFrom spending when you're abroad to absolutely smashing the preparation and packing, we reveal how to holiday like a pro\nAd Feature\n-\nCelebrity SAS Who Dares Wins axes ex army corporal for 'lying and cheating' on the show - resulting in an explosive row\n-\nPrincess Andre tipped to become the UK's answer to Kylie Jenner with her budding career as a makeup mogul\n-\nMaura Higgins shows off dramatic living room makeover after moving into her 'dream' £1.25m Essex mansion\n-\nZoe Ball's famous dad Johnny says her relationship with her ex-husband Fatboy Slim is better than ever\n-\nFrom Icelandic waterfalls to Japanese tea ceremonies: The new cruise collection that promises adventure as well as ultra-luxury\nAd Feature\n-\nTaylor Swift fans go wild after Empire State Building 'stunt' hints at new music from singer\n-\nEXCLUSIVE\nMatt Damon almost goes overboard on boozy Ibiza trip with star-studded group for Chris Hemsworth's birthday\n-\nKelly Clarkson's ex-husband Brandon Blackstock's cause of death confirmed after passing aged 48\n-\nPeter Andre's manager Claire Powell's glow-up 16 years on as she gives advice to his daughter Princess on her show amid Katie Price's comments\n-\nThe Bear's Jeremy Allen White displays his chiseled physique as he cools off on the beach\n-\nJennifer Aniston and Gwyneth Paltrow still gossip about their mutual ex Brad Pitt\n-\nLIZ JONES: Like Katie Price I transformed myself with surgery, went bankrupt and dated terrible men. But there's one key difference between us\n-\nGethin Jones announces the death of his father as the TV star pays an emotional tribute and is flooded with supportive messages\n-\nCHRISTOPHER STEVENS reviews Celebs Go Dating on E4: Television hits the most wretched abyss with this atrocity of a series\n-\n'There's a part of me that thinks this is better': Jennifer Aniston is glad Matthew Perry is 'no longer in pain' and says she mourned Friends co-star for a 'long time'\n- EXCLUSIVE She was a silver screen siren of the 70s and ex-wife of a Hollywood icon, but is unrecognisable as she walks her dogs...can you guess who?\n-\nNetflix back away from Harry and Meghan with new deal, on worse terms: Sussexes sign 'first-look' agreement after shows flopped\n-\nKelly Clarkson breaks down in tears on stage singing poignant song just days before ex-husband's death was announced\n-\nEXCLUSIVE\nMeghan Markle and Prince Harry's new Netflix deal 'IS a downgrade' and more like a 'we'll call you' than 'here's the chequebook', experts say\n- After FOUR years of menopause struggles I took a chance on this supplement - now I'm sleeping better and finally feeling more like myself SHOPPING\n-\nTerry and Heather Dubrow take a major financial hit as they finally offload their Beverly Hills mansion\n-\nEmma Stone reveals heart-wrenching reason she cried before shaving her head for new role\n-\nGwyneth Paltrow, 52, shows off her VERY fit physique after sharing exercise secrets\n-\nWoke Bravo star claims 'fat' Trump voters should be banned from Mexican restaurants in explosive rant\n-\nNew Rambo star is FINALLY revealed... and it's not the successor Sylvester Stallone wanted\n- The 'liquid gold' facial tanner that fights ageing and has beauty fans obsessed: 'Best tanning drops EVER!' (now 20% off, but not for long) SHOPPING\n-\nMyleene Klass is accused of brutally 'ghosting' a close friend for contacting her ex-husband Graham Quinn - days after he ended their six-month marriage\n-\nKylie Jenner skips over-the-top Kardashian birthday bash for intimate party with homemade cake and kids\n-\nEXCLUSIVE\nRobin Thicke swarmed by female fans as he serenades crowd at Hamptons event following honeymoon with April Love Geary\n- Pet owners love this dog food subscription service for better fur, skin and health - and it costs just 89p a DAY (plus it's 40% off right now) SHOPPING\n-\nMusic icon stops concert to shame parent for 'irresponsible' act in front of crowd of 26,000 fans\n-\nEXCLUSIVE\nMy dad and I were jailed for running an illegal steroid lab together and brawled in the courtroom - I can't believe how he betrayed me\n-\nEXCLUSIVE\nThe Chase star Mark Labbett's ex Hayley Palmer gives her verdict his Celebs Go Dating debut following their 'traumatic' relationship\n-\nKatie Price, 47, seen for the first time since tweaking SIXTH face lift - as she recovers in Turkey after Princess, 18, revealed she would never turn to surgery like her mum\n- These 'DELICIOUS' cupboard-ready meals make nutritional eating quicker and easier than ever (and we have an exclusive deal) SHOPPING\n-\nJaw-dropping moment TOPLESS Katie Price derails Princess Andre's reality show - as teen screams 'no mum I'm filming!' and admits 'she's so unpredictable'\n-\nNelly Furtado's life as body positivity pin-up: How embracing her 'new silhouette', and becoming a mum again in her 40s has earned star, 46, 'icon' status\n-\nLiam Payne's ex Sophia Smith marries James Bridgwood as she stuns in a chic highneck gown during lavish London ceremony\n-\nRebecca Loos shoots down Richard Madeley on Good Morning Britain as they clash over David Beckham - swiping 'we don't need to talk about this'\n-\nA Place In The Sun's Laura Hamilton, 43, defiantly shows off her figure in blue swimwear after hitting back at trolls insisting she is 'too old to wear a bikini'\n-\nMeghan Markle has awkward Kardashians moment as she gifts As Ever merch to stars... who fail to acknowledge her\n-\nJennifer Aniston breaks silence on terrifying gate-crashing stalker: 'People are out of their minds'\n-\nFatboy Slim's Hove beachfront cafe slammed for his 'crazy' prices and 'shocking' waiting times\n-\nLorraine star reveals GP son was held at knifepoint in 'terrifying' ordeal at work - pleading 'it needs to stop' and begging for 'more protection'\n-\nBritish actor looks unrecognisable as he watches Oasis at Wembley with musician Tom Grennan - but can you guess who it is?\n-\nMolly-Mae Hague's sister Zoe totes £7K Chanel handbag as she heads to the gym weeks after being mocked for leaving Bali after 48 hours\n-\nPrincess Andre thought she'd be KILLED during 2018 carjacking - as she watched in horror while mum Katie Price was 'touched up' and made heart-wrenching plea\n-\nHulk Hogan's ex-wife Linda pays tribute to late wrestling icon on his birthday: 'Love and miss you so much'\n-\nMark Wright gives rare insight into family holiday with 5 month-old daughter Palma as he reveals 'disappointment'\n-\nShakira unleashes her inner She Wolf! Love Island's Khan sends fans wild as she shares VERY steamy bedroom snap with Harry Cooksley\n-\nKate Garraway's gorgeous floral midi dress is a must have for summer - and we've found it on sale with 50% off\n-\nGregg Wallace addresses claims he 'took his trousers down' on set of MasterChef - after being sacked in wake of inquiry into alleged misconduct\n-\nSam Thompson is forced to break news of his split from Zara McDermott to Jamie Lee Curtis after Hollywood star tipped the pair for marriage\n-\nLove Island stars send fans wild as they fuel romance rumours with telling Instagram snap in the same place: 'Definitely not a coincidence!'\n-\nLove Island's Arabella Chi shows off her figure in a crochet bikini in Palma just three months after welcoming baby daughter\n-\nBikini-clad Stacey Solomon addresses husband Joe Swash's whereabouts as they enjoy a family holiday at a swanky £1k-per-night hotel in Turkey\n-\nBombshell announcement Taylor Swift fans think singer will make in rumored appearance on Travis Kelce and brother Jason's podcast\n-\nOlivia Attwood reveals the bloody and bruised results of her latest beauty procedure after having fish DNA injected into her face\n-\nOne Direction fan caught up in Zayn Malik 'cheating' scandal finally breaks her silence - 13 years after leaked footage of their 'booty call' went viral\n-\nAdrian Thrills reviews The Black Keys' new album No Rain, No Flowers and finds the Ohio duo moving away from their fling with funk\n-\nTaylor Swift fans are CONVINCED she will announce next album on Travis Kelce's podcast after teasing 'new era'\n-\nI was branded 'the ugliest in the family' from nine years old - sick trolls mocked me for having a flat chest, admits Princess Andre in ITV documentary\n-\n'It felt like I was up there for everyone's entertainment': Tulisa claims a police officer mimed oral sex gestures at her when she was on trial for drug sting\n-\nEXCLUSIVE\nBlonde bombshell best known for playing a Bond Girl is seen on a rare outing... can you guess who?\n-\nLisa Rinna's daughter Amelia Gray DENIES promoting anorexia after sparking concern over 'skeletal' frame\n-\nLove Island's Dejon Noel-Williams breaks his silence over 'exposé' book - as he admits to 'questioning why people would do these things'\n-\nLottie Moss sets pulses racing in a skimpy leopard print bikini as she poses for sizzling snaps amid sun-soaked Spanish getaway\n-\nBBC axes beloved celebrity talk show after eight series - as broadcaster pays tribute to 'hardworking' host and admits cancellation was 'a difficult decision'\n-\nCynthia Nixon braves a dip in the Irish sea as she gives an insight into her travels with wife Christine Marinoni\n-\nMel B gushes her second wedding to husband Rory McPhee 'exceeded her expectations' after tying the knot in three-day ceremony in Morocco\n-\nMachine Gun Kelly offers dramatic three-word response to THOSE Sydney Sweeney dating rumors\n-\nTaylor Swift fans in meltdown as Travis Kelce and brother Jason tease singer will appear on their podcast\n-\nDenmark's party prince! Future King, 19, is caught smooching daughter of former Army captain at music festival\n-\nGeorgia May Foote slips into brown workout gear as she heads to the gym amid reports she and husband Kris Evans are 'headed for divorce'\n-\nFury over Katy Perry music video filmed in protected area without permission - as authorities in Majorca issue fine\n-\nLove Island besties Toni Laites and Shakira Khan put on a VERY racy display as they passionately kiss on a pool table in raunchy clip\n-\nCountry music star Spencer Hatcher's mother is stabbed to death in horrific home invasion\n-\nHot socialite summer! Lady Mary Charteris parties the night away with Lady Lola Bute, Lila Moss, Rita Ora's husband and Charlotte Tilbury\n-\nHit horror series with Hollywood A-lister AXED - as devastated fans fume 'how could they?!'\n-\nHalle Berry's ex is skewered by fans for saying he left her because she didn't cook, clean, or seem 'motherly'\n-\nShirtless David Beckham, 50, and wife Victoria, 51, continue soaking up the sun on their £16m superyacht amid lavish Italian getaway\n-\nRafael Nadal is a father for a second time! Tennis ace and wife Mery Perello welcome son as sweet meaning behind his name is revealed\n-\nMaya Jama displays her jaw-dropping figure in a skintight unitard as she runs last minute errands before jetting off to Ibiza\n-\nLily James hits back at Instagram moderators after her racy nude celebration is removed for breaching community guidelines\n-\nNicole Scherzinger sets pulses racing as she takes on Nicki Minaj pose challenge in a skimpy white bikini while balancing on a rock and sipping on a martini\n-\nThe moment that sparked Katie Price and Princess 'feud' as daughter makes modelling debut in Ibiza\n-\nMassive rock band announces long-awaited tour 20 years after hit song\n-\nAmelia Dimoldenberg reveals the A-list star who was her 'dream' Chicken Shop Date and opens up about her VERY flirty encounter with Andrew Garfield\n-\nAdam Rickitt shares news of heartbreaking family tragedy in emotional update\n-\nAnna Friel admits she was 'distraught' after being dumped by her first boyfriend Darren Day as she reveals his brutal move following split\n-\nKatie Price and ex Peter Andre's VERY public feud as daughter Princess reveals she sought counselling after realising her parents 'don't like each other'\n-\nPictured: Meghan Markle's California influence on Princess Eugenie's style - from '50 shades of beige' to Grecian draping\n-\nVictoria Beckham shares a snap of shirtless David as they holiday on the Italian riviera - after he was caught pinching her bottom during date\n-\n'Gutted' Lauren Goodger pulls out of scheduled This Morning appearance due to lack of childcare - as she shares sexy selfies from home instead\n-\nStrictly Come Dancing 2025's first star is REVEALED: Gladiators star Nitro set to compete in new series as the show battles a string of scandals\n-\nPamela Anderson's pickles will make Meghan green with envy! Fans go wild for Baywatch star's new product\n-\nBBC Breakfast guest slammed for 'harsh and disrespectful' swipe at late Blue Peter star Biddy Baxter - with shocked fans gasping 'he clearly wasn't a fan!'\n-\nFashion influencer gets slammed as she goes braless in 'hideous' designer dress\n-\nLucy-Jo Hudson showcases her incredible weight loss in before and after snaps following gruelling 30 day fitness challenge\n-\nWayne Lineker battles nerves ahead of his speech at daughter Tia's lavish wedding as she ties the knot with football manager Harry Agombar in Mallorca\n-\nEdinburgh Fringe luvvies claim 'Oasis effect' is 'catastrophic' as fans send hotel prices surging... and some moan they've been forced to live in cars\n-\nJames Whale's final words: Radio star said the past few months had been hard and expressed his sadness at missing Christmas in posthumous column\n-\nAaron Taylor Johnson's astronomical net worth revealed as actor becomes hot favourite to become the next James Bond after signing deal with 007 watch provider\n-\nSophie Turner hits back at critic that claimed she's 'forgotten' about her two daughters\n-\nKhloe Kardashian enjoys hamper from Meghan Markle's As Ever brand - as delighted Duchess reposts reality star's surprising social media shoutout\n-\nPrincess Andre's childhood trauma: Katie Price's daughter says she 'saw things kids shouldn't see' as she lays bare her mother's 'problems'\n-\nJenna Ortega looks quirky with bleached eyebrows as she promotes Wednesday in South Korea as series two of Netflix hit receives rave reviews\n-\nIsla Fisher and Kaitlyn Dever join pregnant Vanessa Hudgens as they lead the A-listers at star-studded event\n-\nHidden meaning in Princess Beatrice's husband Edoardo Mapelli Mozzi's birthday post for her as he takes inspiration from Prince William and Kate\n-\nPete Wicks admits he's 'in love' with a new woman six months on from his romance with Maura Higgins\n-\nBlue Peter icon Biddy Baxter dies aged 92: Tributes pour in for the 'pioneer' of children's television\n-\nNatalie Imbruglia and Delta Goodrem 'in talks to join cast of Strictly Come Dancing 2025' - as Gladiator Nitro is the first star announced\n-\nAlex Jones shares a kiss with husband Charlie Thomson as she celebrates 15 years on The One Show\n-\nKieran Hayler shows off new tattoo in Sellebrity Soccer match after Princess Andre laid bare her mother Katie Price's struggles following her split from the stripper\n-\nRebecca Loos breaks down in tears after being punched in the face in brutal Celebrity SAS boxing match - gasping 'f***ing hell!' and fighting for breath\n-\nLioness Ella Toone shows off her sparkling engagement ring as she celebrates her partner Joe Bunney's romantic beach proposal with pals\n-\nMaisie Smith breaks down in tears revealing Celebrity SAS moments 'worse than you can imagine' that were cut from 'brutal and torturous' show\n-\nRosie Huntington-Whiteley shows off her incredible figure in a white bikini top and TINY thong on the beach\n-\nVictoria Beckham shares a look at her family holiday as close-knit brood relax in St Tropez amid family rift - but Cruz isn't happy with one of her snaps!\n-\nMeghan Markle issues cryptic message about the UK as she teases As Ever update\n-\nJennifer Lopez's concert crashed by grasshopper as insect crawls up her NECK in nerve-wrecking moment\n-\nRochelle Humes 'gave Myleene Klass' ex-husband Graham Quinn a place to stay' following their split after she caught him 'cheating' with a celebrity\n-\nPaul Gallagher joins Oasis star brother Liam on Edinburgh-bound private jet ahead of looming court date after being charged with rape\n-\nMolly-Mae shows off her incredible figure in a black bikini while on family holiday in Turkey with boyfriend Tommy Fury and daughter Bambi\n-\nPrincess Andre says she 'hated' her appearance and fixated on her 'big nose' as she admits she doesn't have her mum Katie Price's confidence\n-\nCarmen Electra reveals risqué way Kim Kardashian has helped her turn heads\n-\nEXCLUSIVE\nPatrick Kielty's 'seething' family reveal heartbreaking moment they knew his marriage to Cat Deeley was over for good\n-\nLindsay Lohan looks fresh-faced as she visits Taronga Zoo with her rarely-seen husband Bader Shammas and their son in Sydney - and also brings the nanny\n-\nEXCLUSIVE\nMaura Higgins looks unrecognisable in a red wig and dramatic makeup as she poses for striking Original Magazine cover shoot\n-\nJacqueline Jossa shows her support for husband Dan Osborne at football match after Christine McGuinness texting accusations amid marital woes\n-\nIs Prince Louis following in Prince Harry's comedic footsteps? Royal shares a sense of humour with the Duke of Sussex and the late Queen\n-\nPeter Andre reacts to 'disgusting' online messages sent to daughter Princess, 18, by anonymous older men\n-\nGardener's World fans are moved to tears after star reveals his terminal cancer diagnosis during the show\n-\nDR MAX PEMBERTON: Meghan's deathly silence on Harry's woes says so much about their relationship. This is not what a successful marriage looks like..."
    },
    {
      "url": "https://www.dailymail.co.uk/tvshowbiz/article-14511509/will-Smith-uncancelling-slap.html",
      "text": "Is Will Smith 'uncancelling' himself? Actor has been on a mission to rebuild his career with viral videos and a return to his Fresh Prince roots - three years after THAT Oscars slap\n- Have YOU got a story? Email tips@dailymail.com\nThe 2022 Academy Awards should've been a career high for Will Smith, with the star winning his first Best Actor Oscar in his illustrious three-decade career.\nYet the evening was overshadowed by him jumping on the stage and slapping comedian Chris Rock in the face - with many questioning if the stunt would stop him from ever working again.\nIndeed, it seems his life and career has been on a downward spiral since the incident.\nHis reported £28 million role in slavery epic Emancipation failed to make an impact at the box office in 2022, leaving his movie career somewhat in the wilderness.\nMore recently, Will garnered attention for an 'inappropriate' flirty display and an apparent kiss with India Martinez, 39, as they performed the song First Love at the Premio Lo Nuestro award show in Miami last month.\nYet despite the setbacks, Will has unveiled a number of new projects of late - seemingly throwing himself back into the spotlight and attempting to make his Hollywood comeback.\nSo is Will Smith officially 'uncancelling' himself? MailOnline spoke to a brand expert to uncover the evidence.\nAnnouncing a UK and European tour and a new album\nIs Will Smith 'uncancelling' himself? The actor has been on a mission to rebuild his career with viral videos and a return to his Fresh Prince roots - three years after THAT Oscars slap\nOn Tuesday, Will announced his Based on a True Story summer tour, which is his 'first ever' headline tour andwill see the actor visit a host of venues up and down the UK\nOn Tuesday, Will announced his Based on a True Story summer tour, which is his 'first ever' headline tour andwill see the actor visit a host of venues up and down the UK.\nIt coincides with an album of the same name which is set to be released later this month and will be his first in two decades.\nThese live shows will see him performing songs from the new album along with his classic hits including Jiggy Wit It, Miami, Summertime and more.\nThe 14-track album will feature a variety of collaborators including DJ Jazzy Jeff, Teyana Talor, and Jac Ross.\nAnd its cover shows Will paying tribute to his Fresh Prince character with a Philadelphia Varsity jacket and baseball cap as he poses in front of a white backdrop with his hand tipping his cap.\nBut, some fans are shocked to discover that most of the UK venues have a capacity of less than 5,000, which seems small compared to the actor's huge level of fame.\nThe locations include the likes of Scarborough and Wolverhampton, but skip out bigger cities like Birmingham, Glasgow and Dublin.\nAhead of his solo tour, he is set to perform at multiple international festivals, including Mawazine in Morocco, POSITIV Festival in France, Dreambeach in Spain and BIG ART Festival in Italy.\nAnnouncing the news of his album earlier this week, Will, whose last studio album Lost and Found was released in 2005, wrote in Instagram: I'M GOING ON TOUR THIS SUMMER!!\n'We're hitting up UK & Europe to bring U all the hits, some new joints, and a few surprises ;-) All these years, I've NEVER done a headline tour and I can't wait to see you guys!!'\nBrand and culture expert Nick Ede said: 'I think the best way to make a comeback is to connect with fans'\nHe gained recognition in American hip-hop duo DJ Jazzy Jeff & The Fresh Prince who released Grammy-winning single Parents Just Don't Understand (pictured in 1989)\nFans rushed to the comments to quip: 'Life is complete!!!! Been a fan since the fresh prince days !!!!!!! Omg' and 'I'm excited, I can't wait'.\nBrand and culture expert Nick Ede said: 'I think the best way to make a comeback is to connect with fans.\n'By going on tour he's not alienating himself he's coming to them. This makes him more likeable and more accessible too.\n'Having a movie star like Will smith perform in Manchester, Wolverhampton and Brixton academy, smaller more intimate venues, allows him to get up close and personal.'\nHe added: He will most likely visit local restaurants and sight see wherever he goes to give locals bragging righst that they say a Hollywood icon in their home town.\n'For many stars who have lost it, going back to basics and giving loyal fans what they want is very appealing.\n'Stars like Christina Aguilera whose appeal diminished a few years ago went on tour playing just their hits and in doing so proved their talent and played into the goodwill and nostalgia about them.\n'Now she's back on top commanding millions in vegas and producing West End shows.'\nHe concluded: 'I'm sure will will be doing the chat show circuits making self deprecating remarks about his past, leaving his ego at the door and letting his personality shine through.\n'He may also do some charity work in the places he visits on his tour. His appeal to multi generations means that his star power can be a major force for good and I think he will lean into this too in his bid to regain his Hollywood crown.'\nTaking part in a viral TikTok trend\nIt's been a busy month for Will, who went viral earlier this month as he recreated his iconic Fresh Prince of Bel-Air dance with former co-star Tatyana Ali and a surprise appearance from singer Doechii\nThe duo brought back their silly ditty for a whole new generation in video posted to social media on Friday, which was set to the trending song Anxiety by Doechii, 26\nIt's been a busy month for Will, who went viral earlier this month as he recreated his iconic Fresh Prince of Bel-Air dance with former co-star Tatyana Ali and a surprise appearance from singer Doechii.\nThe duo brought back their silly ditty for a whole new generation in video posted to social media on Friday, which was set to the trending song Anxiety by Doechii, 26.\nThe original dance saw Ashley Banks (Tatyana) busting a move in her room with her headphones on, but oblivious to the fact Smith had just entered.\nWill attempts to gain her attention, but when his efforts fail, he proceeds to mimic her dance moves before she becomes aware of his presence.\nIn this latest video, soundtracked to Anxiety, Tatyana, 46, is once again wearing headphones as she dances in a living room before Smith, 56, enters.\nWill proceeds to copy her dance moves, before Doechii appears and joins in on the fun.\n'Waited 35 years for this dance to trend,' Will captioned the post.\nRevealing he wants to wants to 'rebuild something beautiful' after THAT Oscars slap\nWill famously made headlines when he slapped Chris Rock during the 94th Oscars in March 2022\nWill famously made headlines when he slapped Chris Rock during the 94th Oscars in March 2022.\nThe incident occurred following a joke Chris made about Will's wife, Jada Pinkett Smith's bald head, amid her battle with alopecia,\nIt prompted Will to make his way to the stage, slap Chris and say 'keep my wife's name out of your f****** mouth.'\nLater on he picked up the Oscar for Best Actor for King Richard, bursting into tears onstage but failing to apologise to the comedian.\nWill was then was banned from the Oscars until 2032 and has kept a relatively low profile since.\nHowever, in a recent interview with Genius, Will admitted he wants to 'rebuild something beautiful and powerful' after the Oscars incident.\nHe compared the moment to kintsugi, which is the Japanese art of piecing smashed pottery back together.\nWill told the publication: 'I can look at [the Oscars incident] as an absolute mess, horrible, terrible – or I can look at it as a really great kintsugi opportunity, to rebuild something beautiful and powerful.\nTalking about one of his new songs, Beautiful Scars, he added: 'I hate admitting that I'm only human – my ego wants to be Superman … The word I was thinking about when I thought about the last couple of years of my life was 'brutaful' – brutal and beautiful.'\nHowever, in a recent interview with Genius , Will admitted he wants to 'rebuild something beautiful and powerful' after the incident\nHe also seems to get candid about it in the lyrcis, as he raps: 'I hate when I lose it, but I face the music / 'Oh, why did he do it?' See, I'm only human'.\nBrand expert Nick believes that Will is 'plugging into nostalgia ' to slowly rebuild his profile/\nHe added: 'Will Smith is one of the most famous people on the planet and although to many he is most famous for his Oscar slap or his fashion forward children, he has slowly been building his reputation that is seeing him being uncancelled.\n'Like many Hollywood stars who have fallen from grace he has been building his reputation in other territories namely Europe, Asia and the UAE.\n'With the announcement of his tour and a new album the first in 20 years hes slowly building his profile, playing to his loyal fan base and plugging into the good will and nostalgia that people have for him.\n'With his TikTok FreshPprince reunion going viral and the Bad Boys sequel making over 300 million more dollars than it cost it seems like the past is well and truly behind him.'\nHe continued: 'He's playing on his reputation as a Hollywood icon in countries where he knows hell get a big reception.\n'It feels right that someone who has been such a huge star should be getting it back – like Robert Downey jr and Eddie Murphy there are many Hollywood icons who have lost their star power only to regain it in a spectacular way and I think that Will Smith is one of those stars who will never fade and always shine bright.'\nReturning to the red carpet and awards shows\nWill returned to the Grammys this year, marking his first red carpet appearance since the Oscars drama in 2022\nAnd he did more than just attend - Will made his awards show return when he hit the Grammys stage for a special Quincy Jones tribute (pictured with children Willow and Jaden)\nWill returned to the Grammys this year, marking his first red carpet appearance since the Oscars drama in 2022.\nHe looked to be in high spirits as he stepped out in a black Balmain suit with silver and diamond-encrusted embellishments on his coat.\nWill wore matching black pants and black shoes to complete his look at the event, but was not joined by his wife Jada.\nAnd he did more than just attend - Will made his awards show return when he hit the Grammys stage for a special Quincy Jones tribute.\n'You probably wouldn't even know who Will Smith was if it wasn't for Quincy Jones,' he said.\nHe went on to talk about how Quincy 'changed his life,' pointing out that Quincy produced his show The Fresh Prince of Bel-Air.\nBeing supported by celeb pals and his wife Jada\nAs he orchestrates his comeback, Will has a slew of celebrity pals who are backing him all the way (Alfonso Ribeiro pictured left on The Fresh Prince of Bel Air with Will pictured right)\nDespite a rocky marriage including infedilty, Will's wife Jada and his family have stood by him publicly supporting him\nAs he orchestrates his comeback, Will has a slew of celebrity pals who are backing him all the way.\nIn a recent interview on The Jennifer Hudson Show, his Fresh Prince co-star Alfonso Ribeiro said: 'Will is my brother for life He's absolutely the best.'\nThe actor gushed that 'their friendship and bond has withstood the time of four or five decades.'\nHe told Jennifer: 'It's wonderful to hear Will give me some of my flowers. Obviously, I give him flowers all the time. He is just so incredible. He's the most talented guy I know and the most dedicated guy I know. It's mutual love.'\nDespite a rocky marriage including infidelity, Will's wife Jada and his family have stood by him publicly supporting him.\nIn 2020, Jada admitted to carrying on a multi-year affair with the musician Alsina during a period when she and Will were separated.\nHe later admitted to his own extramarital affairs, and in late 2023, Jada clarified that the two had been separated going all the way back to 2016, though she said they don't have any plans to divorce.\nSpeaking to Red magazine about the Oscars incident, she said: 'I was just really concerned about Will. And I realised in that moment that, as challenging as our relationship can be, I'm always going to be by his side, no matter what.'\nWhile speaking to Daily Mail's YOU Magazine, Jade said 'many positive things came after' Will slapped Chris.\n'After all those years trying to figure out if I would leave Will's side, it took that slap for me to see I will never leave him. Who knows where our relationship would be if that hadn't happened?'\nTeasing a sequel to one of his biggest movie hits\nWill revealed that an idea was in the works for a sequel to his hit 2008 superhero film Hancock. He said he has a part in mind for Zendaya\n'There's a really cool, really cool Hancock 2 idea,' he announced. 'We haven't even talked about it so I'm gonna give you one little piece — Zendaya will be being being approached for a role in Hancock 2'\nDuring an appearance last month on Twitch with Canadian gamer xQc (real name: Félix Lengyel), Will revealed that an idea was in the works for a sequel to his hit 2008 superhero film Hancock.\n'They've been leaking all my information,' he joked after the hosts pointed out that a commenter had mentioned a Hancock sequel.\n'There's a really cool, really cool Hancock 2 idea,' he announced. 'We haven't even talked about it so I'm gonna give you one little piece — Zendaya will be being being approached for a role in Hancock 2.'\nHancock's original studio, Sony Pictures, had no comment on Will's plans for a sequel, according to Variety.\nThe original film was a box office hit in 2008 despite being savaged by critics.\nIt managed to gross an impressive $629.4 million against a $150 million budget, according to Box Office Mojo, which made it the fourth highest-grossing film of the year, as well as one of Will's most-successful movies.\nHe starred in the title role of a seemingly immortal man with Superman-like abilities who has fallen on hard times and descended into alcoholism."
    },
    {
      "url": "https://www.dailymail.co.uk/news/article-11062209/Will-Smith-FINALLY-apologizes-Oscars-slap.html",
      "text": "'My behavior was unacceptable': Will Smith posts agonizing hand-wringing apology to Chris Rock AND wife Jada for THAT Oscars slap - but reveals his former friend is 'not ready to talk'\n- Smith posted a video on Instagram on Friday to apologize formally to Rock\n- He revealed the former friend isn't ready to forgive him but he is here 'whenever he wants to talk'\n- Smith apologized to his wife Jada Pinkett Smith and his family for bringing 'heat' to them all\n- He said disappointing people is his 'central trauma' so he is 'heartbroken' to have disappointed fans\n- Smith slapping Rock was the standout, shock moment from the show and overshadowed everything else\n- Rock had just joked that Jada looked like 'G.I.' Jane because she'd shaved her head\n- The actress was suffering from alopecia at the time\nWill Smith issued another groveling apology to Chris Rock on Friday and revealed his former friend still hasn't forgiven him for slapping him on-stage at the Oscars.\nSmith said he'd taken the last three months to 'work' on himself and realized now how many people he hurt when he smacked Rock on stage at the awards.\n'I've reached out to Chris and the message that came back is that he's not ready to talk when he is, he will reach out. So I will say to you, Chris, I apologize to you. My behavior was unacceptable and I'm here whenever you're ready to talk.'\nHe also apologized to Rock's mother and his entire family, specifically Rock's mother and his younger brother Tony.\n'I just didn't realize how many people got hurt in that moment, so I want to apologize to Chris's mother. I want to apologize.\n'I want to apologize to Tony Rock... Tony Rock was my man and this is probably irreparable,' he said.\nHe also apologized to Jada Pinkett Smith, his wife whose honor he claimed to be defending with the outburst, and said she had 'nothing to do with it'.\nScroll down for video\nThe actor posted the video on Instagram on Friday where said he was 'fogged out' during his acceptance speech, and that is why he did not apologize to Rock. 'I've reached out to Chris and the message that came back is that he's not ready to talk when he is, he will reach out\nThe slap heard round the world: Smith slapped Rock on March 27 at the 94th Academy Awards\nSmith said he'd spent the last three months 'reflecting' on his behavior and had come to realize how many people he hurt\n'I spent the last three months replaying and understanding the nuances and the complexities of what happened in that moment.\nSmith's wife Jada Pinkett Smith had recently revealed that she was suffering alopecia and had shaved her head. Rock joked during his hosting set that she looked like 'G.I. Jane'\n'I'm not going to try to unpack all of that right now but I can say to all of you, there is no part of me that thinks that was the right way to behave in that moment.\n'There is no part of me that thinks that's the optimal way to handle a feeling of disrespect or insults.'\nRock, who was hosting the show, joked that Smith's wife Jada looked like 'G.I. Jane' because of her bald head.\nShe had recently revealed that she suffers from alopecia.\nSmith stormed the stage and slapped Rock after fuming: 'Keep my wife's name out of your f*****g mouth.'\nHe went on to win Best Actor for his role in King Richard that night, but he did not specifically apologize to Rock.\nInsisting that his wife had nothing to do with the slap, he went on: 'I made a choice of my own from my own experiences from my history with Chris.\n'Jada had nothing to do with it. I'm sorry, babe.\n'I want to say sorry to my kids and my family for the heat that I brought on all of us.\n'To all my fellow nominees, this is a community.\n'It's like, I won because you voted for me and it breaks my heart to have stolen and tarnished your moment.'\nSmith went on to claim that 'disappointing people' is his 'central trauma'.\n'I can still see Questlove's eyes. You know it happened on Questlove's award. You know, it's like.\n'I'm sorry really isn't sufficient.\n'Disappointing people is my central trauma. I hate when I let people down so it hurts.\n'It hurts me psychologically and emotionally to know I didn't live up to people's image and impression of me, and the work I am trying to do is I am deeply remorseful.\n'And I'm trying to be remorseful without being ashamed of myself. I'm human and I made a mistake and I'm trying not to think of myself as a piece of s**t.\n'I would say to those people I know it was confusing, I know it was shocking, but I promise you I am deeply devoted and committed to putting light and love and joy into the world.\n'And, you know, if you hang on I promise we'll be able to be friends again,' he said to the fans he had let down.\nRock only recently addressed the controversy at a Madison Square Garden show, where he laughed it off.\n'Anyone who says words hurt has never been punched in the face,' he told the crowd.\nSmith issued his first apology to Rock back in March. He posted a lengthy statement on Instagram where he said 'violence in all its forms' was wrong.\nChris Rock was spotted in Hollywood drinking with fellow comedians and actors at the Zoj restaurant\nChris Rock with his new girlfriend Lake Bell and actor Woody Harrelson. Smith was not invited\nMost watched News videos\n- Moment passengers 'stop' man who pulled down trousers on tube\n- Shocking moment man is gored to death after charging at bull\n- Moment Cycling Mikey pushes bike into a car after furious row\n- Shocking moment woman strikes flight attendant before being removed\n- Chinese Navy ship collides with own vessel while chasing boat\n- Chinese navy vessel collides with one of its own chasing Philippine boat\n- Florida man knocks out kayakers while attempting a DAREDEVIL leap\n- Family-friendly restaurant Cracker Barrel unveils bold new look\n- Kristen Welker calls out JB Pritzker over Gerrymandering\n- Hawaii ferry is tossed by strong waves before being run aground\n- Father of children mowed down in Oatlands tragedy confronts killer\n- Jennifer Lopez has an unexpected guest during her concert\nToooooo late you big baby.\nby Dontbeatool 8109"
    }
  ],
  "argos_summary": "Alan Tudyk, who starred alongside Will Smith in the 2004 film 'iRobot', claimed that Smith used his influence to minimize Tudyk's role in promotional materials after audience testing showed Tudyk's character was more popular. Tudyk expressed his shock at being excluded from publicity, fearing that audiences wouldn't recognize his contribution to the film. This incident adds to the narrative of Smith's complex relationships with co-stars, including a previous feud with Janet Hubert from 'The Fresh Prince of Bel-Air', which was addressed in a recent reunion special.",
  "argos_id": "LPLYGO955"
}