{
  "url": "https://www.cbsnews.com/news/uvalde-school-district-releases-records-2022-classroom-shooting-legal-fight-access/",
  "authorsByline": "",
  "articleId": "a1ce33c7a6514845b0f8d3bae479aa0f",
  "source": {
    "domain": "cbsnews.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/08/11/8fa11aaf-ad4f-40ae-a4fd-202cff478156/thumbnail/1200x630/b53a00602bcf88880cd3b8bc7d35df86/ap25220742741375.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T20:24:19-04:00",
  "addDate": "2025-08-12T00:27:03.441389+00:00",
  "refreshDate": "2025-08-12T00:27:03.441392+00:00",
  "score": 1.0,
  "title": "Uvalde school district releases records for 2022 classroom shooting, after legal fight over access",
  "description": "The mass shooting at Robb Elementary School​ in Uvalde, Texas, killed 19 students and two teachers​. The slow law enforcement response has been widely condemned.",
  "content": "School officials in Uvalde, Texas, on Monday released text messages, personnel files and student records of the shooter from the 2022 attack at Robb Elementary School, following a yearslong legal battle over public access to the material.\n\nThe records include emails between top school district officials and also text messages and emails to and from at least two school police officers who were on the scene. The release also contains the personnel file of former Uvalde schools police chief Pete Arredondo, who has been described as the on-scene commander of the law enforcement response.\n\nThe release included a handful of text exchanges between Arredondo and others at the district that were sent before the shooting. At 9:04 a.m., the chief told officer Adrian Gonzales to \"go hang out at the park with the seniors until 11:30.\" At 11:40 a.m. a text to Arredondo from a district secretary noted someone reported hearing shots outside Robb Elementary.\n\n\"They went ahead and locked themselves down,\" the text to Arredondo read. At 1:07 p.m., a text to Arredondo asked if any students were injured or taken to the hospital and asked if the district can lift the \"secure status\" on the school. The shooter had been killed by law enforcement about 15 minutes earlier.\n\nMedia organizations, including CBS News and The Associated Press, sued the district and county in 2022 for the release of their records related to the mass shooting that killed 19 students and two teachers.\n\nA Texas appeals court in July upheld a lower court's ruling that the records must be released.\n\nThe records are not the public's first glimpse inside one of the nation's deadliest mass shootings and a slow law enforcement response that has been widely condemned. Last year, city officials in Uvalde released police body camera videos and recordings of 911 calls.\n\nNearly 400 officers waited more than 70 minutes before confronting the gunman in a classroom filled with dead and wounded children and teachers. Multiple federal and state investigations into the response have laid bare cascading problems in law enforcement training, communication, leadership and technology, and questioned whether officers prioritized their own lives over those of children and teachers.\n\nTwo school district officers face criminal charges for their actions that day. The former schools police chief, Arredondo, and former officer Adrian Gonzales both face multiple counts of child endangerment and abandonment. Both men have pleaded not guilty and are scheduled for trial later this year.\n\nThey are the only two responding officers to have been charged.\n\nLaura Prather, media law chair for Haynes Boone, which represented the media organizations in the suit, said in a statement Monday night: \"More than three years after the Robb Elementary School shooting, the release of long-withheld public records by the Uvalde Consolidated Independent School District is an important step toward giving the community the answers they deserve. The court's ruling makes clear that government agencies cannot hide behind vague legal claims to withhold public information.\"\n\n\"Three years is already too long to wait for truth and transparency that could prevent future tragedies,\" Prather added.",
  "medium": "Article",
  "links": [
    "https://www.cbsnews.com/live-updates/texas-school-shooting-victims-uvalde-robb-elementary/",
    "https://www.cbsnews.com/feature/school-shooting-in-uvalde-texas/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Uvalde school district",
      "weight": 0.096277945
    },
    {
      "name": "former Uvalde schools police chief Pete Arredondo",
      "weight": 0.091170974
    },
    {
      "name": "top school district officials",
      "weight": 0.08858063
    },
    {
      "name": "former officer Adrian Gonzales",
      "weight": 0.08165324
    },
    {
      "name": "officer Adrian Gonzales",
      "weight": 0.08107805
    },
    {
      "name": "law enforcement",
      "weight": 0.07885441
    },
    {
      "name": "law enforcement training",
      "weight": 0.07783067
    },
    {
      "name": "student records",
      "weight": 0.07738114
    },
    {
      "name": "School officials",
      "weight": 0.07487179
    },
    {
      "name": "Robb Elementary School",
      "weight": 0.07374218
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "General"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Local News",
      "score": 0.9970703125
    },
    {
      "name": "/Sensitive Subjects/Violence & Abuse",
      "score": 0.9892578125
    },
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.94384765625
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.921875
    },
    {
      "name": "/Sensitive Subjects/Death & Tragedy",
      "score": 0.90283203125
    },
    {
      "name": "/Jobs & Education/Education/Primary & Secondary Schooling (K-12)",
      "score": 0.86181640625
    },
    {
      "name": "/News/Other",
      "score": 0.70751953125
    }
  ],
  "sentiment": {
    "positive": 0.047600377,
    "negative": 0.75558263,
    "neutral": 0.19681698
  },
  "summary": "School officials in Uvalde, Texas, have released records for the 2022 classroom shooting that killed 19 students and two teachers at a school. The records, which have been subject to a yearslong legal battle over public access, include emails between top school district officials and personnel files from at least two school police officers who were on the scene. The personnel file of former police chief Pete Arredondo also contains a handful of text exchanges between Arredond and others at the district before the shooting. Media organizations, including CBS News and The Associated Press, sued the district and county in 2022 for the release of their records related to the mass shooting. Two school district officers, Arredonda and Adrian Gonzales, are facing multiple counts of child endangerment and abandonment and are scheduled for trial later this year.",
  "shortSummary": "Uvalde school officials released records of the 2022 classroom shooting, including text messages, personnel files, and police records, after a years-long legal battle.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "9b5d0492a5c04e2986d91eda575f3185",
  "places": [
    {
      "osmId": "499969350",
      "town": "Uvalde",
      "county": "Uvalde County",
      "state": "Texas",
      "postcode": "78801",
      "country": "United States",
      "countryCode": "us",
      "neighbourhood": "South Grove Street Colonia",
      "coordinates": {
        "lat": 29.1988371,
        "lon": -99.78900162091455
      }
    }
  ],
  "scraped_sources": [
    {
      "url": "https://www.cbsnews.com/feature/school-shooting-in-uvalde-texas/",
      "text": "Uvalde school shooting report reveals border officers couldn't access key tools\nA federal internal report found CBP officers who arrived at the scene of the Uvalde school shooting were unable to access important tools to aid their response.\nA federal internal report found CBP officers who arrived at the scene of the Uvalde school shooting were unable to access important tools to aid their response.\nUvalde city officials released a massive trove of audio and video recordings connected to the May 2022 shooting at Robb Elementary School after a legal fight.\nThe wrongful death lawsuits come just two days after the same group of 19 families reached a $2 million settlement with the city of Uvalde over the Robb Elementary School massacre.\nThe Biden campaign released a new ad highlighting the Uvalde school shooting, as well as a Trump attack ad narrated by Robert De Niro.\nFamily members of Uvalde school shooting victims also said they're filing lawsuits against dozens of Texas Department of Public Safety officers and Uvalde's school district.\nLaw enforcement took more than an hour to get inside the classroom and kill the gunman, even as children inside the classrooms called 911, begging police to rescue them.\nA Texas prosecutor has convened a grand jury to investigate the Uvalde school shooting that killed 21 people, multiple media outlets reported.\nIn the report, much of the blame was placed on former police chief of the Uvalde Consolidated Independent School District, Pete Arredondo, who was terminated in the wake of the shooting.\nThe Justice Department's report points to \"cascading failures\" by the police chief and other law enforcement responding to the shooting at Robb Elementary School in Uvalde, Texas, on May 4, 2022.\nAttorney General Merrick Garland met with families affected by the school shooting in Uvalde, Texas, on Wednesday ahead of the Thursday release of the report.\nThe announcement by the Uvalde County district attorney pushes back expectations that a grand jury would convene before the end of the year.\nPresident Biden remembered the victims of the Uvalde shooting and called for Congress to impose more gun restrictions.\nThrough their grief, the families of victims have found the strength to demand changes in gun laws, more school safety and greater accountability.\nJavier Cazares' 9-year-old daughter Jacklyn was killed with 18 other children and two teachers when a gunman opened fire at Robb Elementary last year.\nAlso, in response to the Uvalde shooting, a bill is pending in Texas that would let schools offer stipends of up to $25,000 to staffers who also become armed campus \"sentinels.\"\nThe gunman who killed 19 students and two teachers at an Uvalde elementary school in May gained access to the building through an unlocked side door.\nThe review of autopsies and other records is part of a criminal investigation by Texas Rangers into the hesitant police response at Robb Elementary School.\nAfter the gunman fired off dozens of rounds, and more than one hour after the massacre started, a 10-year-old called 911 begging for help from officers standing on the other side of the wall.\nHe previously said he would step down if any of his officers had any culpability in the botched response to the massacre.\nSgt. Juan Maldonado is the third officer to be fired over the botched law enforcement response to the shooting.\nAt a meeting Monday night, the Uvalde school board agreed unanimously to begin searching for Harrell's replacement.\nThe school district's police department has faced heavy criticism since the mass shooting that killed 19 students and two teachers.\nUvalde school officials have abruptly fired a former Texas state trooper who was on scene of the Robb Elementary School massacre in May and then hired by the school district.\nTwo of the five officers have already been suspended without pay while the investigation plays out.\nThe district has put in new fencing and security cameras and has added additional police officers and therapists.\nHuntington Park, California, is 95.6% Latino, and as many as 45% of the residents are undocumented, according to the city.\nThe mass shooting at Robb Elementary School in Uvalde, Texas, killed 19 students and two teachers. The slow law enforcement response has been widely condemned.\nThe Ohio-based nonprofit Magnet helped 56-year-old Mary Lamar find work after serving a 3.5-year prison sentence.\nPresident Trump says he expects to know quickly if a deal can be made with Russian leader Vladimir Putin to halt the war in Ukraine.\nPrince Harry and his wife, Meghan, announced Monday that their media company's partnership with Netflix has been extended with a multiyear, first-look deal.\nFord unveiled a new assembly line on Monday, which CEO Jim Farley called the most radical change at Ford \"since the Model T.\"\nLSU graduate James Robert helps design 3D-printed wheelchairs and prosthetics for children, inspired by his own limb difference.\nThe agreement between the chipmakers and the U.S. government will allow Nvidia and AMD to obtain export licenses to resume sales to China.\nThe midterms \"will determine whether our democracy still holds on,\" NAACP President Derrick Johnson said in a statement to CBS News.\nHuntington Park, California, is 95.6% Latino, and as many as 45% of the residents are undocumented, according to the city.\nThe mass shooting at Robb Elementary School in Uvalde, Texas, killed 19 students and two teachers. The slow law enforcement response has been widely condemned.\nThe Ohio-based nonprofit Magnet helped 56-year-old Mary Lamar find work after serving a 3.5-year prison sentence.\nPresident Trump says he expects to know quickly if a deal can be made with Russian leader Vladimir Putin to halt the war in Ukraine.\nPrince Harry and his wife, Meghan, announced Monday that their media company's partnership with Netflix has been extended with a multiyear, first-look deal.\nPresident Trump has extended a temporary truce in the U.S.-China trade war, preventing tariffs on China from leaping to at least 80%.\nPresident Trump announced E.J. Antoni as his nominee to lead the Bureau of Labor Statistics on Monday, after he fired the former commissioner and blamed her for a weaker-than-expected jobs report.\nFord unveiled a new assembly line on Monday, which CEO Jim Farley called the most radical change at Ford \"since the Model T.\"\nThe agreement between the chipmakers and the U.S. government will allow Nvidia and AMD to obtain export licenses to resume sales to China.\nParamount will become the new home to all UFC events in the U.S., while UFC's CEO says the White House may host a July 4 event broadcast on CBS.\nHuntington Park, California, is 95.6% Latino, and as many as 45% of the residents are undocumented, according to the city.\nPresident Trump has extended a temporary truce in the U.S.-China trade war, preventing tariffs on China from leaping to at least 80%.\nPresident Trump announced E.J. Antoni as his nominee to lead the Bureau of Labor Statistics on Monday, after he fired the former commissioner and blamed her for a weaker-than-expected jobs report.\nEducation Secretary Linda McMahon is touring the country to promote state-led education plans.\nPresident Trump says he expects to know quickly if a deal can be made with Russian leader Vladimir Putin to halt the war in Ukraine.\nFormer U.S. Surgeon General Jerome Adams — who served in President Trump's first term — tells \"Face the Nation with Margaret Brennan\" that \"people are going to die\" if the U.S. backs away from mRNA research, as Robert F. Kennedy Jr. calls off mRNA vaccine development projects. He also argues that RFK Jr. \"failed in his first major test\" after a deadly shooting at CDC headquarters.\nAdams, who served as surgeon general during the first Trump administration, said Kennedy's assertions about the efficacy of mRNA vaccines are \"simply not true.\"\nLogan Coleridge thought his long-lasting symptoms were from a concussion until an MRI found an alarming, unexpected abnormality.\nInstagram rolled out a new Map feature that lets users see their friends' locations in real time. Here's why privacy experts are concerned.\nA key indicator for tracking the spread of the COVID-19 virus has increased, according to the latest data from the Centers for Disease Control and Prevention.\nPresident Trump says he expects to know quickly if a deal can be made with Russian leader Vladimir Putin to halt the war in Ukraine.\nThe government of Niger has launched an investigation into what they call possible \"illicit international trafficking\" after a piece of Mars unearthed in the Sahara Desert was sold.\nA heat wave gripping parts of Europe sent temperatures over 109.4 degrees Fahrenheit — 40 degrees Celsius — in southern France and the Western Balkans on Monday.\nTropical Storm Erin was expected to become a hurricane later in the week.\nThe remains of Dennis \"Tink\" Bell, a British researcher who vanished in 1959 in Antarctica when he was 25 years old, were discovered near a receding glacier.\nPrince Harry and his wife, Meghan, announced Monday that their media company's partnership with Netflix has been extended with a multiyear, first-look deal.\nParamount will become the new home to all UFC events in the U.S., while UFC's CEO says the White House may host a July 4 event broadcast on CBS.\nChance the Rapper's \"Star Line\" album drops Friday, marking his first studio album in five years. The project's release comes ahead of his \"And We Back\" North American tour starting on Sept. 26. He joins \"CBS Mornings.\"\nActor Jessica Alba and entrepreneur Lizzy Mathis join \"CBS Mornings\" to talk about the new season of their show \"Honest Renovations\" where they transform homes with creative designs that solve real family challenges.\nKeyboardist and vocalist Bobby Whitlock, who co-founded Derek and the Dominos with Eric Clapton in 1970, died at his home in Texas. He was 77.\nSome experts say false narratives generated by artificial intelligence can pose a threat to global politics. Brett Benson, associate professor of political science at Vanderbilt University, joins \"The Takeout\" to explain why he believes the era of AI propaganda is here.\nAs the number of energy-intensive data centers needed to power Big Tech rises in the U.S., so are Americans' electricity bills. Ari Peskoe, director of the Electricity Law Initiative at Harvard Law School, joins \"The Takeout\" to discuss.\nFrom labor shortages to environmental impacts, farmers are looking to AI to help revolutionize the agriculture industry. One California startup, Farm-ng, is tapping into the power of AI and robotics to perform a wide range of tasks, including seeding, weeding and harvesting.\nFord unveiled a new assembly line on Monday, which CEO Jim Farley called the most radical change at Ford \"since the Model T.\"\nThe agreement between the chipmakers and the U.S. government will allow Nvidia and AMD to obtain export licenses to resume sales to China.\nASMR (or autonomous sensory meridian response) is the tingling sensation some people experience from certain sounds or visuals – a \"brain massage,\" in the words of Maria Viktorovna, who's been called the \"ASMR queen.\" Correspondent Faith Salie talks with Viktorovna about her wildly successful \"Gentle Whispering\" videos, and with physiology professor Craig Richard, who discusses ASMR's physical effects. Salie also visits Whisperwave, New York City's first ASMR spa. [Originally broadcast Dec. 8, 2024.]\nA new study finds that butterfly populations are rapidly declining in the Midwest. Elise Zipkin, one of the authors of the study, joins \"The Daily Report\" to discuss.\nThe Perseids meteor shower — considered one of the best shows in the sky — is set to peak this week.\nDiscovered last month by a telescope in Chile, the comet known as 3I-Atlas is only the third known interstellar object to pass our way.\nThe National Oceanic and Atmospheric Administration updated the 2025 Atlantic hurricane season forecast. CBS News' Jessica Burch reports.\nThree people are dead and a suspect is in custody after a shooting in the parking lot of an Austin, Texas, Target, police say. CBS News correspondent Omar Villafranca reports.\nPresident Trump on Monday announced drastic measures to crack down on crime in the nation's capital, but data shows crime in Washington, D.C., is declining. CBS News' Anna Schecter has the details.\nPolice say three people are dead and a suspect is in custody after a shooting in the parking lot of a Target in Austin, Texas. Omar Villafranca has more.\nViolent crime has dropped 26% from last year in Washington, D.C., but on Monday, President Trump took charge of the city's nearly 4,000-person police department, claiming the nation's capital is in crisis. Scott MacFarlane has more.\nCBS News has learned that the man who opened fire near the Centers for Disease Control and Prevention headquarters in Atlanta on Friday fired at least 180 shots and broke about 150 windows. Some staff members shared their accounts of the incident with CBS News medical contributor Dr. Céline Gounder.\nThe splashdown off San Diego closed out a 148-day mission for two NASA astronauts, a Japanese flier and a Russian cosmonaut.\nNASA astronaut Jim Lovell has died at the age of 97. Lovell was part of the crew of Apollo 8, the first mission to ever leave Earth's orbit and circle the moon. He also flew on the ill-fated Apollo 13 mission, which had to abort plans to land on the moon after an explosion in an oxygen tank.\nCrew 10 is the first NASA-sponsored crew that will land in the Pacific Ocean. All previous NASA Crew Dragon flights ended with splashdowns off the Florida Gulf coast or the Atlantic Ocean.\nAstronaut Jim Lovell circled the moon on Apollo 8 and helped bring Apollo 13 home safely despite a mishap far from Earth.\nNASA says it's a comet, but Harvard astrophysicist Avi Loeb believes the object known as 3I-Atlas may be something far more advanced and not natural. He joins \"CBS Mornings Plus\" to explain why.\nLive performances are in full swing this summer. Scroll through our concert gallery, featuring pictures by CBS News photojournalist Jake Barlow and photographers Ed Spinelli and Kirstine Walton.\nA look back at the esteemed personalities who've left us this year, who'd touched us with their innovation, creativity and humanity.\nCalling himself the \"Son of Sam\" in a letter left at one of the crime scenes, David Berkowitz claimed voices were ordering him to kill -- starting in the summer of 1976, he went on a 13-month spree of impulse killings in New York City that left six dead and seven injured\nBizarre clues and evidence in the investigation into the Colorado mother's disappearance include a spy pen, plastic needle cap, and a chipmunk alibi.\nA suspect was taken into custody after an attack on Pearl Street Mall in Boulder on June 1 in which there were 15 people and a dog who were victims. The suspect threw Molotov cocktails that burned some of the victims, who were part of a march for Israeli hostages.\nThree people are dead and a suspect is in custody after a shooting in the parking lot of an Austin, Texas, Target, police say. CBS News correspondent Omar Villafranca reports.\nPresident Trump announced Monday he's deploying National Guard members to Washington, D.C., in an effort to make the nation's capital safer. CBS News' Aaron Navarro and Eleanor Watson have the latest.\nJohn Dickerson goes inside the numbers on who actually pays when tariffs are levied against imports.\nThe share of working mothers between the ages of 25-44 has dropped 3% so far this year, according to a new report from the University of Kansas. Professor Misty Heggeness, who analyzed the data and is the author of the upcoming book, \"Swifty-Nomics: How Women Mastermind and Redefine our Economy,\" joins the \"CBS Evening News\" to discuss the report.\nAdam Yamaguchi takes us to a community in California that's struggling to survive as deportation raids increase."
    },
    {
      "url": "https://www.cbsnews.com/live-updates/texas-school-shooting-victims-uvalde-robb-elementary/",
      "text": "What we know about the victims of the Uvalde school shooting\nThe nation's eyes are on the Texas town of Uvalde following an elementary school shooting that has left 21 people dead and 17 more injured.\nOn Tuesday morning, a gunman entered Robb Elementary School in Uvalde after shooting his grandmother and crashing a car near the school, authorities said. According to an official from the Texas Department of Safety, the shooter walked into the building and fired at \"children, teachers, whoever was in his way.\"\nHe killed 19 children and two teachers.\nHere is a look at the victims and their stories:\nMaite Rodriguez\nMaite's mother, Ana Rodriguez, wrote on Facebook, \"The passing of my beautiful daughter has rocked me to my core and I simply cannot wrap my head around what has happened.\"\nShe shared small, heartbreaking details about her loss: \"What I would like the world to know about Maite Yuleana Rodriguez is that her favorite color was green and she loved those lime green converse, so much so that she drew a heart on the right one. ... She was sweet, charismatic, loving, caring, loyal, free, ambitious, funny, silly, goal driven and best of all my very best friend! Her dream to become a marine biologist started in kindergarten and she had her heart set on Texas A&M university in Corpus Christi. She loved animals and and babies so much lol! She was just picking up the camera and starting to enjoy photography. She had a very fun clothing style. As I lay here on this empty bed and with tears running down my face at 3am I would like to say to my baby girl \"it's not goodbye it's I'll see you later my sweet girl\" I LOVE YOU\"\nMakenna Elrod\nMakenna's aunt, Allison McCullough, described her as \"beautiful, funny, smart, and amazing. She had the biggest heart and loved her family and friends so much. Her smile would light up a room.\"\nMcCullough wrote on a verified GoFundMe page, \"Words cannot express the pain my sister and our family is going through. I know in the coming weeks my sister is going to be overcome with so much and any support is appreciated. Please pray for our family and remember Makenna. ... We will carry her in our hearts and we know she is with our Lord and Savior.\"\nEliahana Cruz Torres, 10\nPastor Jamie Cabralez of Jesus Christ Revealed Ministries told CBS News' Tanya Rivero Thursday that Eliahana Cruz Torres, his grandniece, was a victim in the shooting.\nCabralez said the 10-year-old was \"active\" and \"generous with her time.\" He said her grandfather is \"distraught and hurting\" over her loss.\nEliahana's aunt told CBS affiliate KHOU that the girl was excited to play in her last softball game of the season.\n\"I talked to her last night and she was kind of nervous, saying that it was her last game and she didn't want softball to end,\" her aunt said on the day of the shooting. \"And she was excited because they were gonna, I guess, announce the ones that made it to all-stars. And she was also saying, like, 'What if I make it? I'm gonna be so nervous.' And I was like, 'Girl, you got this. You're gonna be good at it. You got this.' So she was excited.\"\nAlithia Ramirez, 10\nAlithia Ramirez had recently celebrated her 10th birthday, her family told gubernatorial candidate Beto O'Rourke.\n\"Alithia was killed yesterday,\" O'Rourke tweeted on Wednesday. \"Her parents welcomed me into their home today. Balloons from Alithia's 10th birthday were still up as was her amazing art. They want the world to know what a beautiful, talented, happy girl she was. They never want this to happen to another kid.\"\nJose Flores, 10\nJose Flores was killed on Tuesday, his aunt, Lydia Salazar Torrez, told CBS News. His uncle, Christopher Salazar, wrote a touching Facebook tribute to the 10-year-old.\n\"I'm going to miss you baby Jose, i still can't believe this happened my heart is broken just hearing them tell us your gone it hurts me I love you so much and I wish you were still here. I'm going to miss you soo much rest in paradise my beautiful angel\"\nIn another post, Salazar wrote: \"I love you and I miss you.\"\nTess Marie Mata\nFaith, Tess Marie Mata's sister, told CBS News the child was among those killed in the shooting. She also shared a Facebook post about her sister's death.\n\"My sweet baby sister, I would've never thought I would be typing something like this. I honestly have no words just sadness, confusion, and anger. I'm sad because we will never get to tag team on mom and dad again and tell each other how much we mean to each other, I'm confused because how can something like this happen to my sweet, caring, and beautiful sister, and I'm angry because a coward took you from us. Sissy I miss you so much, I just want to hold you and tell you how pretty you are, I want to take you outside and practice softball, I want to go on one last family vacation, I want to hear your contagious laugh, and I want you to hear me tell you how much I love you. Tessy mom, dad, and I won't be the same without you but we are comforted knowing you are waiting for us up in heaven and have a spot for us. We have one sassy guardian angel that I know is going to protect our family. Till we meet again Tess Marie, love your Big Sister\"\nIrma Garcia, 48\nIrma Garcia's nephew, John Martinez, shared that she \"did not make it\" in a tweet on Tuesday.\n\"My tia did not make it, she sacrificed herself protecting the kids in her classroom, i beg of you to keep my family including all of her family in y'all's prayers , IRMA GARCIA IS HER NAME and she died a HERO. she was loved by many and will truly be missed.\"\nGarcia was a wife and had four children of her own, according to a GoFundMe page. She worked as a fourth grade teacher at Robb Elementary School and was \"Sweet, kind, loving. Fun with the greatest personality.\"\n\"She sacrificed herself protecting the kids in her classroom. She was a hero,\" the GoFundMe said.\nTwo days later, her husband Joe died of an apparent heart attack a short time after laying flowers at the memorial site.\n\"I truly believe Joe died of a broken heart,\" Irma Garcia's cousin Debra Austin wrote on a GoFundMe page. \"Losing the love of his life of more than 25 years was too much to bear.\"\nNevaeh Bravo, 10\nNevaeh Bravo's uncle told CBS News the young girl was killed. On Tuesday, a cousin posted on Facebook that their family was looking for her in the wake of the shooting.\nMiranda Mathis\nThe mother of a close friend described Miranda as \"very loving and very talkative.\" She told the Austin American-Statesman that her daughter and Miranda had been in the same classes and that Miranda would ask to have her hair done like her daughter's.\nJayce Carmelo Luevanos, 10\nA family member told CBS News Jayce Carmelo Luevanos was killed.\nJackie Cazares\nJacinto Cazares, Jackie Cazares' father, said his daughter died in the shooting.\n\"We're devastated in ways, I hope no one ever goes thru,\" he wrote in a Facebook post.\n\"Taken out of arms and lives, in this freaking cowardly way, so young, so innocent, full of life and love. It hurts us to our souls. We thank everyone from the bottom of our hearts, for you love, support and prayers. My babygirl will always be with us and those she has touched. May your passing not be in vein, something will be done, I promised you. Be in piece with the rest of the angels, sweetheart. Daddy, Mom,Sister, Brother and the whole family are going to miss you forever. Baby girl we all love you with all our hearts. Rest in peace, my Babygirl.\"\nJackie's cousin and best friend Annabell Rodriguez also died in the school shooting.\nJailah Nicole Silguero, 10\nA family member told CBS News that Jailah Nicole Silguero died in the shooting. She didn't want to go to school Tuesday, believing something bad would happen, her mom, Veronica Luevanos, told Univision, according to the AP. One of Silguero's cousins was killed.\nAlexandria \"Lexi\" Aniyah Rubio, 10\nLexi Rubi's grandmother confirmed to CBS News that she died in Tuesday's shooting. In a Facebook post, Kimberly Mata-Rubio remembered her daughter, saying her family had been with her at the school just hours before she was killed.\n\"My beautiful, smart, Alexandria Aniyah Rubio was recognized today for All-A honor roll,\" her post read. \"She also received the good citizen award. We told her we loved her and would pick her up after school. We had no idea this was goodbye.\"\nLayla Salazar, 10\nVincent Salazar said his 10-year-old daughter, Layla, was among those killed.\nLayla loved to swim and dance to videos on TikTok, her father told the AP. An avid runner, she won six races at the school's field day, and Salazar proudly posted a photo of Layla showing off two of her ribbons on Facebook.\nEliahna \"Ellie\" Garcia, 9\nEliahna Garcia's family learned Tuesday the 10-year-old was among the victims, her aunt, Siria Arizmemdi, told the AP.\n\"She was very happy and very outgoing,\" said Arizmendi, a fifth-grade teacher at Flores Elementary School in the same school district. \"She loved to dance and play sports. She was big into family, enjoyed being with the family.\"\nAmerie Jo Garza, 10\nAngel Garza's stepdaughter Amerie was just two weeks past her 10th birthday when he dropped her off at school for what turned out to be the last time.\n\"She was the sweetest thing. She's so creative. She just got an award for being the most creative,\" Garza told CBS News.\nShe was shot and killed in her fourth-grade classroom.\nHer parents aren't sure what to tell her 3-year-old brother Zayne. \"Every morning he wakes up, he asks for his sister,\" Garza said.\n\"I don't know what to do, man. She didn't deserve that. I just want to protect my little girl.\"\nGarza's father, Alfred Garza III, wrote about her death in a Facebook post, saying, \"My one and only baby. I'm going to miss you dearly Amerie. You did NOT deserve this, nor did the other children. I would do anything to have you back. Fly high my Amerie Jo and tell grandma we miss her. Visit me in my dreams anytime.\"\nRojelio Torres, 10\nRojelio Torres' father Frederico confirmed to CBS affiliate KHOU on Wednesday that the 10-year-old was one of the children killed in the shooting.\nXavier Lopez, 10\nXavier Lopez had been looking forward to a summer of swimming, according to his cousin Lisa Garza, who confirmed his death to the Associated Press.\n\"He was just a loving 10-year-old little boy, just enjoying life, not knowing that this tragedy was going to happen today,\" Garza, 54, said. \"He was very bubbly, loved to dance with his brothers, his mom. This has just taken a toll on all of us.\"\nAnnabell Rodriguez, 10\nAnnabell Rodriguez was a third grader at Robb Elementary, her family told CBS affiliate KHOU. She was in the same room as her cousin, Jackie Cazares, who was also killed.\nTheir aunt, Letty Hernandez, wrote that the two girls \"were not only cousins, but best friends as well.\"\nUziyah Garcia, 10\nUziyah Garcia died on Tuesday, his family told CBS News. Nikki Cross, his aunt, said in a Facebook post on the day of the shooting that his family was looking for him.\nGarcia was described by his grandfather Manny Renfro as a smart boy with a fantastic memory, according to the Associated Press.\n\"The sweetest little boy that I've ever known,\" Renfro said. \"I'm not just saying that because he was my grandkid.\"\nEva Mireles, 44\nEva Mireles was a fourth grade teacher at Robb Elementary School and was one of the first victims identified by family and police. She was described by those who knew her as a loving wife and mother, the Associated Press reports.\nAccording to her teacher profile, she was an educator for 17 years and loved running and hiking.\n\"She was adventurous,\" relative Amber Ybarra told the AP, confirming her death. \"I would definitely say those wonderful things about her. She is definitely going to be very missed.\"\nIn a statement to CBS News, her aunt called it a \"very sad day in the Uvalde community\" and called for \"expanded gun rules.\"\n\"let this be the last community affected by this and let's lobby together for the gun laws,\" Lydia Martinez Delgado said.\nA person who identified herself as Mireles' daughter Adalynn wrote a heartfelt post on Twitter, saying, \"My heart will forever be broken.\""
    }
  ],
  "argos_summary": "Uvalde, Texas school officials have released records related to the 2022 Robb Elementary School shooting, including text messages and personnel files, following a legal battle for public access. The documents reveal communication between school officials and police officers before and during the incident, where 19 children and two teachers were killed. The slow law enforcement response has faced widespread criticism, leading to criminal charges against two officers involved. Families of the victims continue to seek accountability and changes in gun laws in the wake of the tragedy.",
  "argos_id": "LQ0QFN0X2"
}