{
  "url": "https://www.latimes.com/world-nation/story/2025-08-10/nations-capital-waits-for-trumps-next-move-as-a-federal-takeover-threat-looms",
  "authorsByline": "Ashraf Khalil and Lindsay Whitehurst",
  "articleId": "12c1b64750324082a981fd9c2b994fda",
  "source": {
    "domain": "latimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "CA",
      "city": "Los Angeles",
      "coordinates": {
        "lat": 34.0536909,
        "lon": -118.242766
      }
    }
  },
  "imageUrl": "https://ca-times.brightspotcdn.com/dims4/default/5b759eb/2147483647/strip/true/crop/5609x2945+0+397/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F6f%2F8b%2Fd09d8fb9a99c71362e7df54e4a93%2F18896ead764745bdbb625ec75dbd4b31",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T03:05:58.200000+00:00",
  "addDate": "2025-08-11T03:11:16.728938+00:00",
  "refreshDate": "2025-08-11T03:11:16.728941+00:00",
  "score": 1.0,
  "title": "Nation's capital awaits Trump's next move as federal takeover threat looms",
  "description": "President Trump's planned law enforcement surge in D.C. didn't appear to happen as scheduled. But a days-long security lockdown could still occur.",
  "content": "Around 2 a.m., noisy revelers emerging from clubs and bars packed the sidewalks of U Street in Washington, many of them seeking a late-night slice or falafel. A robust but not unusual contingent of city police cruisers lingered around the edges of the crowds. At other late-night hot spots, nearly identical scenes unfolded.\n\nWhat wasn’t apparent in Friday’s earliest hours: any sort of security lockdown by a multiagency flood of uniformed federal law enforcement officers. That’s what President Trump had promised Thursday, starting at midnight, in the administration’s latest move to impose its will on the nation’s capital.\n\nIn short, that law enforcement surge to take control of the District of Columbia’s streets did not appear to unfold on schedule. A two-hour city tour, starting around 1 a.m. Friday, revealed no overt or visible law enforcement presence other than members of the Metropolitan Police Department, the city’s police force.\n\nThat might change in the coming evenings as Trump puts into action his long-standing plans to “take over” a capital city he has repeatedly slammed as unsafe, filthy and badly run. According to his declaration last week, the security lockdown will run for seven days, “with the option to extend as needed.” In an online post Saturday, the Republican president said the Democratic-led city would soon be one of the country’s safest and he announced a White House news conference for Monday, though he offered no details.\n\nOn Friday night, a White House official said Thursday night’s operations included arrests for possession of two stolen firearms, suspected fentanyl and marijuana. The official was not authorized to speak publicly and spoke on condition of anonymity. The official said more than 120 members of various federal agencies — the Secret Service, the FBI and the U.S. Marshals Service — were to be on duty Friday night, upping the complement of federal officers involved.\n\n“This is the first step in stopping the violent crime that has been plaguing the streets of Washington, D.C.,” White House Press Secretary Karoline Leavitt said in a statement.\n\nMayor Muriel Bowser, who publicly faced off against Trump in 2020 when he called in a massive federal law enforcement response to disperse crowds of protesters denouncing police brutality and racial profiling, has not said a public word since Trump’s declaration. The Metropolitan Police Department has gone similarly silent.\n\nA crackdown came after an assault\n\nThe catalyst for this latest round of takeover drama was an assault Aug. 3 during an attempted carjacking on a high-profile member of the White House’s government-slashing team known as the Department of Government Efficiency, formerly headed by Elon Musk.\n\nPolice arrested two 15-year-olds and were seeking others. Trump quickly renewed his calls for the federal government to seize control.\n\n“If D.C. doesn’t get its act together, and quickly, we will have no choice but to take Federal control of the City, and run this City how it should be run, and put criminals on notice that they’re not going to get away with it anymore,” Trump wrote in a post on his social media site.\n\nHe later told reporters he was considering a range of alternatives, including repealing Washington’s limited “home rule” autonomy and “bringing in the National Guard, maybe very quickly,” as he did in Los Angeles in response to protests over his administration’s immigration crackdown.\n\nThe threats come at a time when Bowser’s government can tout a reduction in the number of homicides and carjackings, both of which surged in 2023. The number of carjackings overall dropped significantly in 2024, from 957 to just under 500, and is on track to decline again this year, with fewer than 200 recorded so far.\n\nThe proportion of juveniles arrested on suspicion of carjacking, though, has remained above 50%, and Bowser’s government has taken steps to rein in a recent phenomenon of rowdy teenagers causing disarray and disturbances in public spaces.\n\nEmergency legislation passed by the D.C. Council this summer imposed tighter youth curfew restrictions and empowered Police Chief Pamela Smith to declare temporary juvenile curfew zones for four days at a time. In those areas, a gathering of nine or more people younger than 18 is unlawful after 8 p.m.\n\nTrump is within his powers in deploying federal law enforcement assets on D.C. streets. He could deploy the National Guard, although that is not one of the dozen participating agencies listed in his declaration. The first Trump administration called in the National Guard during Black Lives Matter protests in 2020 and again on Jan. 6, 2021, when his supporters overran the Capitol in a failed attempt to overturn his election defeat.\n\nFurther steps, including taking over the Police Department, would require a declaration of emergency. Legal experts believe that would most likely be challenged in court. Such an approach would fit the general pattern of Trump’s second term in office, when he has declared states of emergency on issues ranging from border protection to economic tariffs. In many cases, he moved forward while the courts sorted it out.\n\nImposing a full federal takeover of Washington would require a congressional repeal of the Home Rule Act of 1973. It’s a step that Trump said his administration’s lawyers are examining.\n\nThat law was specific to Washington, not other communities in the United States that have their own home rule powers but generally retain representation in their state legislatures, said Monica Hopkins, executive director of the American Civil Liberties Union of the District of Columbia.\n\nSigned into law by President Nixon, the measure allowed D.C. residents to elect their own mayor, council and local commissioners. The district had been previously run by federally appointed commissioners and members of Congress, some of whom balked at having to deal with potholes and other details of running a city of 700,000 residents.\n\nSo far, Trump’s criticisms of Washington can be felt most directly in the actions of the National Park Service, which controls large pieces of land throughout the capital. In Trump’s current administration, the agency has stepped up its clearing of homeless encampments on Park Service land and recently carried out a series of arrests of people smoking marijuana in public parks.\n\nThe agency said last week that a statue of a Confederate military leader that was toppled by protesters in 2020 would be restored and replaced, in line with an executive order.\n\nKhalil and Whitehurst write for the Associated Press. AP writers Mike Pesoli, Michael Kunzelman and Michelle L. Price contributed to this report.",
  "medium": "Article",
  "links": [
    "https://apnews.com/article/trump-washington-increased-federal-law-enforcement-takeover-33b186a95dabf111bac61db398aa7543",
    "https://mpdc.dc.gov/page/dc-curfew-law",
    "https://mpdc.dc.gov/page/designated-juvenile-curfew-zones-2025",
    "https://x.com/usparkpolicepio/status/1953812468611866653",
    "https://www.whitehouse.gov/fact-sheets/2025/04/fact-sheet-president-donald-j-trump-declares-national-emergency-to-increase-our-competitive-edge-protect-our-sovereignty-and-strengthen-our-national-and-economic-security/",
    "https://www.whitehouse.gov/fact-sheets/2025/01/fact-sheet-president-donald-j-trump-declares-a-national-emergency-at-the-southern-border/",
    "https://www.latimes.com/world-nation/story/2025-08-10/netanyahu-defends-planned-military-offensive-in-gaza-and-lashes-out-at-global-campaign-of-lies",
    "https://apnews.com/article/confederate-statue-removal-replacement-trump-culture-13ae94da5a9d652ba8a678d24bc9e7e8",
    "https://www.latimes.com/world-nation/story/2025-08-10/un-nuclear-watchdog-official-to-visit-iran-in-a-bid-to-improve-ties-but-no-inspections-planned",
    "https://apnews.com/article/district-of-columbia-trump-takeover-3b58c1efabf17db271dce582d9a09c6d",
    "https://www.latimes.com/world-nation/story/2025-08-09/jd-vance-went-kayaking-for-his-birthday-secret-service-had-the-river-level-raised",
    "https://apnews.com/article/elon-musk-doge-donald-trump-962778979dd35ea79d6092df9cb2cb56",
    "https://apnews.com/article/washington-dc-crime-assault-doge-05aaaeb09d106ca1af673b46e89d60e1",
    "https://www.whitehouse.gov/presidential-actions/2025/03/restoring-truth-and-sanity-to-american-history/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "federal law enforcement assets",
      "weight": 0.06911454
    },
    {
      "name": "uniformed federal law enforcement officers",
      "weight": 0.066881396
    },
    {
      "name": "President Trump",
      "weight": 0.06514147
    },
    {
      "name": "Trump",
      "weight": 0.06404175
    },
    {
      "name": "various federal agencies",
      "weight": 0.06150556
    },
    {
      "name": "Federal control",
      "weight": 0.06131469
    },
    {
      "name": "federal takeover threat",
      "weight": 0.06093758
    },
    {
      "name": "federal officers",
      "weight": 0.057817098
    },
    {
      "name": "Federal",
      "weight": 0.056960396
    },
    {
      "name": "city police cruisers",
      "weight": 0.053951394
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.98828125
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.94970703125
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.73583984375
    },
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.712890625
    },
    {
      "name": "/News/Local News",
      "score": 0.3212890625
    }
  ],
  "sentiment": {
    "positive": 0.061157227,
    "negative": 0.71484375,
    "neutral": 0.22363281
  },
  "summary": "President Trump has threatened a federal takeover of Washington, D.C., as part of his administration's latest move to impose its will on the nation's capital. The president had promised a seven-day security lockdown, with the option to extend it further. However, this did not appear to occur on schedule, with no visible law enforcement presence from the Metropolitan Police Department. This comes as Mayor Muriel Bowser's government praises a decrease in homicides and carjackings, both of which surged in 2023. The threat came after an assault on a high-profile White House official during an attempted carjacking. The White House is considering repealing Washington's limited \"home rule\" autonomy and bringing in the National Guard in response to protests over his administration’s immigration crackdown.",
  "shortSummary": "President Trump's plan to \"take over” Washington faces challenges, with local police and the National Guard deployed amid escalating violent crime.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "77fb98f4881a4057b9debd6fa4c453c2",
  "places": [
    {
      "osmId": "738189385",
      "road": "U Street Northwest",
      "city": "Washington",
      "state": "District of Columbia",
      "postcode": "20009",
      "country": "United States",
      "countryCode": "us",
      "neighbourhood": "Greater U Street Historic District",
      "coordinates": {
        "lat": 38.9169902,
        "lon": -77.0260055
      }
    }
  ],
  "scraped_sources": [
    {
      "url": "https://apnews.com/article/confederate-statue-removal-replacement-trump-culture-13ae94da5a9d652ba8a678d24bc9e7e8",
      "text": "Confederate statues in DC area to be restored and replaced in line with Trump’s executive order\nWASHINGTON (AP) — Two Washington, D.C.-area statues commemorating the Confederacy will be restored and replaced, in line with President Donald Trump’s pushback on recent efforts to reframe America’s historical narrative.\nDefense Secretary Pete Hegseth announced Tuesday that a statue commemorating the Confederacy would be returned to Arlington National Cemetery. The statue, which Hegseth referred to as “The Reconciliation Monument,” was removed in 2023.\nThe National Park Service announced Monday that the statue of Albert Pike, a Confederate brigadier general and a revered figure among Freemasons, would resume its previous position in Washington’s Judiciary Square, a few blocks from the U.S. Capitol. It was the only outdoor statue of a Confederate military leader in the nation’s capital.\nThe statue was pulled down with ropes and chains on Juneteenth in 2020 as part of mass protests following the death of George Floyd at the hands of Minneapolis police. Confederate statues around the country were toppled by similar protests while several military bases named for Confederate leaders were renamed.\nThe Pike statue restoration, which is targeted for October, “aligns with federal responsibilities under historic preservation law as well as recent executive orders to beautify the nation’s capital and reinstate pre-existing statues,” the park service said in a statement.\nArlington’s Confederate Memorial\nOn social media Tuesday, Hegseth said the Arlington statue “never should have been taken down by woke lemmings. Unlike the Left, we don’t believe in erasing American history — we honor it.”\nIn 2022, an independent commission recommended that the memorial be taken down, as part of its final report to Congress on renaming of military bases and assets that commemorate the Confederacy.\nThe statue, unveiled in 1914, features a bronze woman, crowned with olive leaves, standing on a 32-foot pedestal, and was designed to represent the American South. Some of the figures also on the statue include a Black woman depicted as “Mammy” holding what is said to be the child of a white officer, and an enslaved man following his owner to war.\nRestoration is part of a larger narrative\nIn March, Trump issued an executive order entitled “Restoring Truth and Sanity to American History.” It decried post-Floyd efforts to reinterpret American history, stating, “rather than fostering unity and a deeper understanding of our shared past, the widespread effort to rewrite history deepens societal divides and fosters a sense of national shame.”\nThe order targeted the Smithsonian network of museums as having “come under the influence of a divisive, race-centered ideology.” It also instructed the Interior Department to restore any statue or display that was “removed or changed to perpetuate a false reconstruction of American history, inappropriately minimize the value of certain historical events or figures, or include any other improper partisan ideology.”\nPike, who died in 1891, is more known for his decades-long stint as a senior leader of the Freemasons than for his Confederate military career. The Masons lobbied Congress for the right to erect the statue on NPS land in 1901 — provided that he be depicted in civilian, not military, garb.\nBut Pike did lead a regiment for the Confederacy during the Civil War. And as the only outdoor statue of a Confederate leader in Washington, D.C., it had been a source of controversy for decades. Even the brief Park Service page on the statue notes that it has “stirred opposition since it was first planned.”\nA long history of demands for removal of the Pike statue\nThe D.C. Council asked for its removal in 1992. In 2017, Mayor Muriel Bowser struck an agreement with congressional leaders to eventually remove it.\nWhen protesters toppled the statue in 2020 while police officers looked on, Trump — then in his first term — called it “a disgrace to our Country” on social media and called for their immediate arrests.\nCongresswoman Eleanor Holmes Norton, Washington’s non-voting delegate in Congress, called the Park Service move “odd and indefensible” in a statement Monday. Norton said she would introduce legislation to remove the statue permanently and place it in a museum.\n“I’ve long believed Confederate statues should be placed in museums as historical artifacts,” she said, “not remain in parks and locations that imply honor.”"
    },
    {
      "url": "https://www.whitehouse.gov/fact-sheets/2025/04/fact-sheet-president-donald-j-trump-declares-national-emergency-to-increase-our-competitive-edge-protect-our-sovereignty-and-strengthen-our-national-and-economic-security/",
      "text": "Fact Sheet: President Donald J. Trump Declares National Emergency to Increase our Competitive Edge, Protect our Sovereignty, and Strengthen our National and Economic Security\nPURSUING RECIPROCITY TO REBUILD THE ECONOMY AND RESTORE NATIONAL AND ECONOMIC SECURITY: Today, President Donald J. Trump declared that foreign trade and economic practices have created a national emergency, and his order imposes responsive tariffs to strengthen the international economic position of the United States and protect American workers.\n- Large and persistent annual U.S. goods trade deficits have led to the hollowing out of our manufacturing base; resulted in a lack of incentive to increase advanced domestic manufacturing capacity; undermined critical supply chains; and rendered our defense-industrial base dependent on foreign adversaries.\n- President Trump is invoking his authority under the International Emergency Economic Powers Act of 1977 (IEEPA) to address the national emergency posed by the large and persistent trade deficit that is driven by the absence of reciprocity in our trade relationships and other harmful policies like currency manipulation and exorbitant value-added taxes (VAT) perpetuated by other countries.\n- Using his IEEPA authority, President Trump will impose a 10% tariff on all countries.\n- This will take effect April 5, 2025 at 12:01 a.m. EDT.\n- President Trump will impose an individualized reciprocal higher tariff on the countries with which the United States has the largest trade deficits. All other countries will continue to be subject to the original 10% tariff baseline.\n- This will take effect April 9, 2025 at 12:01 a.m. EDT.\n- These tariffs will remain in effect until such a time as President Trump determines that the threat posed by the trade deficit and underlying nonreciprocal treatment is satisfied, resolved, or mitigated.\n- Today’s IEEPA Order also contains modification authority, allowing President Trump to increase the tariff if trading partners retaliate or decrease the tariffs if trading partners take significant steps to remedy non-reciprocal trade arrangements and align with the United States on economic and national security matters.\n- Some goods will not be subject to the Reciprocal Tariff. These include: (1) articles subject to 50 USC 1702(b); (2) steel/aluminum articles and autos/auto parts already subject to Section 232 tariffs; (3) copper, pharmaceuticals, semiconductors, and lumber articles; (4) all articles that may become subject to future Section 232 tariffs; (5) bullion; and (6) energy and other certain minerals that are not available in the United States.\n- For Canada and Mexico, the existing fentanyl/migration IEEPA orders remain in effect, and are unaffected by this order. This means USMCA compliant goods will continue to see a 0% tariff, non-USMCA compliant goods will see a 25% tariff, and non-USMCA compliant energy and potash will see a 10% tariff. In the event the existing fentanyl/migration IEEPA orders are terminated, USMCA compliant goods would continue to receive preferential treatment, while non-USMCA compliant goods would be subject to a 12% reciprocal tariff.\nTAKING BACK OUR ECONOMIC SOVEREIGNTY: President Trump refuses to let the United States be taken advantage of and believes that tariffs are necessary to ensure fair trade, protect American workers, and reduce the trade deficit—this is an emergency.\n- He is the first President in modern history to stand strong for hardworking Americans by asking other countries to follow the golden rule on trade: Treat us like we treat you.\n- Pernicious economic policies and practices of our trading partners undermine our ability to produce essential goods for the public and the military, threatening national security.\n- U.S. companies, according to internal estimates, pay over $200 billion per year in value-added taxes (VAT) to foreign governments—a “double-whammy” on U.S. companies who pay the tax at the European border, while European companies don’t pay tax to the United States on the income from their exports to the U.S.\n- The annual cost to the U.S. economy of counterfeit goods, pirated software, and theft of trade secrets is between $225 billion and $600 billion. Counterfeit products not only pose a significant risk to U.S. competitiveness, but also threaten the security, health, and safety of Americans, with the global trade in counterfeit pharmaceuticals estimated at $4.4 billion and linked to the distribution of deadly fentanyl-laced drugs.\n- This imbalance has fueled a large and persistent trade deficit in both industrial and agricultural goods, led to offshoring of our manufacturing base, empowered non-market economies like China, and hurt America’s middle class and small towns.\n- President Biden squandered the agricultural trade surplus inherited from President Trump’s first term, turning it into a projected all-time high deficit of $49 billion.\n- The current global trading order allows those using unfair trade practices to get ahead, while those playing by the rules get left behind.\n- In 2024, our trade deficit in goods exceeded $1.2 trillion—an unsustainable crisis ignored by prior leadership.\n- “Made in America” is not just a tagline—it’s an economic and national security priority of this Administration. The President’s reciprocal trade agenda means better-paying American jobs making beautiful American-made cars, appliances, and other goods.\n- These tariffs seek to address the injustices of global trade, re-shore manufacturing, and drive economic growth for the American people.\n- Reciprocal trade is America First trade because it increases our competitive edge, protects our sovereignty, and strengthens our national and economic security.\n- These tariffs adjust for the unfairness of ongoing international trade practices, balance our chronic goods trade deficit, provide an incentive for re-shoring production to the United States, and provide our foreign trading partners with an opportunity to rebalance their trade relationships with the United States.\nREPRIORITIZING U.S. MANUFACTURING: President Trump recognizes that increasing domestic manufacturing is critical to U.S. national security.\n- In 2023, U.S. manufacturing output as a share of global manufacturing output was 17.4%, down from 28.4% in 2001.\n- The decline in manufacturing output has reduced U.S. manufacturing capacity.\n- The need to maintain a resilient domestic manufacturing capacity is particularly acute in advanced sectors like autos, shipbuilding, pharmaceuticals, transport equipment, technology products, machine tools, and basic and fabricated metals, where loss of capacity could permanently weaken U.S. competitiveness.\n- U.S. stockpiles of military goods are too low to be compatible with U.S. national defense interests.\n- If the U.S. wishes to maintain an effective security umbrella to defend its citizens and homeland, as well as allies and partners, it needs to have a large upstream manufacturing and goods-producing ecosystem.\n- This includes developing new manufacturing technologies in critical sectors like bio-manufacturing, batteries, and microelectronics to support defense needs.\n- Increased reliance on foreign producers for goods has left the U.S. supply chain vulnerable to geopolitical disruption and supply shocks.\n- This vulnerability was exposed during the COVID-19 pandemic, and later with Houthi attacks on Middle East shipping.\n- From 1997 to 2024, the U.S. lost around 5 million manufacturing jobs and experienced one of the largest drops in manufacturing employment in history.\nADDRESSING TRADE IMBALANCES: President Trump is working to level the playing field for American businesses and workers by confronting the unfair tariff disparities and non-tariff barriers imposed by other countries.\n- For generations, countries have taken advantage of the United States, tariffing us at higher rates. For example:\n- The United States imposes a 2.5% tariff on passenger vehicle imports (with internal combustion engines), while the European Union (10%) and India (70%) impose much higher duties on the same product.\n- For networking switches and routers, the United States imposes a 0% tariff, but India (10-20%) levies higher rates.\n- Brazil (18%) and Indonesia (30%) impose a higher tariff on ethanol than does the United States (2.5%).\n- For rice in the husk, the U.S. imposes a tariff of 2.7%, while India (80%), Malaysia (40%), and Turkey (31%) impose higher rates.\n- Apples enter the United States duty-free, but not so in Turkey (60.3%) and India (50%).\n- The United States has one of the lowest simple average most-favored-nation (MFN) tariff rates in the world at 3.3%, while many of our key trading partners like Brazil (11.2%), China (7.5%), the European Union (5%), India (17%), and Vietnam (9.4%) have simple average MFN tariff rates that are significantly higher.\n- Similarly, non-tariff barriers—meant to limit the quantity of imports/exports and protect domestic industries—also deprive U.S. manufacturers of reciprocal access to markets around the world. For example:\n- China’s non-market policies and practices have given China global dominance in key manufacturing industries, decimating U.S. industry. Between 2001 and 2018, these practices contributed to the loss of 3.7 million U.S. jobs due to the growth of the U.S.-China trade deficit, displacing workers and undermining American competitiveness while threatening U.S. economic and national security by increasing our reliance on foreign-controlled supply chains for critical industries as well as everyday goods.\n- India imposes their own uniquely burdensome and/or duplicative testing and certification requirements in sectors such as chemicals, telecom products, and medical devices that make it difficult or costly for American companies to sell their products in India. If these barriers were removed, it is estimated that U.S. exports would increase by at least $5.3 billion annually.\n- Countries including China, Germany, Japan, and South Korea have pursued policies that suppress the domestic consumption power of their own citizens to artificially boost the competitiveness of their export products. Such policies include regressive tax systems, low or unenforced penalties for environmental degradation, and policies intended to suppress worker wages relative to productivity.\n- Certain countries, like Argentina, Brazil, Ecuador, and Vietnam, restrict or prohibit the importation of remanufactured goods, restricting market access for U.S. exporters while also stifling efforts to promote sustainability by discouraging trade in like-new and resource-efficient products. If these barriers were removed, it is estimated that U.S. exports would increase by at least $18 billion annually.\n- The UK maintains non-science-based standards that severely restrict U.S. exports of safe, high-quality beef and poultry products.\n- Indonesia maintains local content requirements across a broad range of sectors, complex import licensing regimes, and, starting this year, will require natural resource firms to onshore all export revenue for transactions worth $250,000 or more.\n- Argentina has banned imports of U.S. live cattle since 2002 due to unsubstantiated concerns regarding bovine spongiform encephalopathy. The United States has a $223 million trade deficit with Argentina in beef and beef products.\n- For decades, South Africa has imposed animal health restrictions that are not scientifically justified on U.S. pork products, permitting a very limited list of U.S. pork exports to enter South Africa. South Africa also heavily restricts U.S. poultry exports through high tariffs, anti-dumping duties, and unjustified animal health restrictions. These barriers have contributed to a 78% decline in U.S. poultry exports to South Africa, from $89 million in 2019 to $19 million 2024.\n- U.S. automakers face a variety of non-tariff barriers that impede access to the Japanese and Korean automotive markets, including non-acceptance of certain U.S. standards, duplicative testing and certification requirements, and transparency issues. Due to these non-reciprocal practices, the U.S. automotive industry loses out on an additional $13.5 billion in annual exports to Japan and access to a larger import market share in Korea—all while the U.S. trade deficit with Korea more than tripled from 2019 to 2024.\n- Monetary tariffs and non-monetary tariffs are two distinct types of trade barriers that governments use to regulate imports and exports. President Trump is countering both through reciprocal tariffs to protect American workers and industries from these unfair practices.\nTHE GOLDEN RULE FOR OUR GOLDEN AGE: Today’s action simply asks other countries to treat us like we treat them. It’s the Golden Rule for Our Golden Age.\n- Access to the American market is a privilege, not a right.\n- The United States will no longer put itself last on matters of international trade in exchange for empty promises.\n- Reciprocal tariffs are a big part of why Americans voted for President Trump—it was a cornerstone of his campaign from the start.\n- Everyone knew he’d push for them once he got back in office; it’s exactly what he promised, and it’s a key reason he won the election.\n- These tariffs are central to President Trump’s plan to reverse the economic damage left by President Biden and put America on a path to a new golden age.\n- This builds on his broader economic agenda of energy competitiveness, tax cuts, no tax on tips, no tax on Social Security benefits, and deregulation to boost American prosperity.\nTARIFFS WORK: Studies have repeatedly shown that tariffs can be an effective tool for reducing or eliminating threats that impair U.S. national security and achieving economic and strategic objectives.\n- A 2024 study on the effects of President Trump’s tariffs in his first term found that they “strengthened the U.S. economy” and “led to significant reshoring” in industries like manufacturing and steel production.\n- A 2023 report by the U.S. International Trade Commission that analyzed the effects of Section 232 and 301 tariffs on more than $300 billion of U.S. imports found that the tariffs reduced imports from China and effectively stimulated more U.S. production of the tariffed goods, with very minor effects on prices.\n- According to the Economic Policy Institute, the tariffs implemented by President Trump during his first term “clearly show[ed] no correlation with inflation” and only had a temporary effect on overall price levels.\n- An analysis from the Atlantic Council found that “tariffs would create new incentives for US consumers to buy US-made products.”\n- Former Biden Treasury Secretary Janet Yellen affirmed last year that tariffs do not raise prices: “I don’t believe that American consumers will see any meaningful increase in the prices that they face.”\n- A 2024 economic analysis found that a global tariff of 10% would grow the economy by $728 billion, create 2.8 million jobs, and increase real household incomes by 5.7%."
    },
    {
      "url": "https://www.latimes.com/world-nation/story/2025-08-10/un-nuclear-watchdog-official-to-visit-iran-in-a-bid-to-improve-ties-but-no-inspections-planned",
      "text": "U.N. nuclear watchdog official to visit Iran in a bid to improve ties, but no inspections set\n- Share via\nTEHRAN — The deputy head of the United Nations’ nuclear watchdog will visit Iran in a bid to restore frayed ties, the Islamic Republic’s foreign minister said Sunday.\nThere will be no inspection of nuclear facilities during the visit by the International Atomic Energy Agency scheduled for Monday, Foreign Minister Abbas Araghchi said. The visit would be the first since Israel and Iran’s 12-day war in June, when some of its key nuclear facilities were struck.\nIranian President Masoud Pezeshkian on July 3 ordered the country to suspend its cooperation with the IAEA after U.S. and Israeli airstrikes hit its most important nuclear facilities. The decision is likely to further limit inspectors’ ability to track Tehran’s program that had been enriching uranium to near weapons-grade levels.\n“As long as we haven’t reached a new framework for cooperation, there will be no cooperation, and the new framework will definitely be based on the law passed by the Parliament,” Araghchi said.\nState media last week quoted Araghchi as saying during a television program that Tehran would allow for IAEA cooperation only through the approval of the Supreme National Security Council, the country’s highest security body.\nIran has had limited IAEA inspections in the past as a condition of agreements with Western powers, and it is unclear how soon talks between Tehran and Washington for a deal over its nuclear program might resume.\nU.S. intelligence agencies and the International Atomic Energy Agency had assessed that Iran last had an organized nuclear weapons program in 2003, though Tehran had been enriching uranium up to 60% — a short, technical step away from weapons-grade levels of 90%. Iran says its nuclear program was not for military purposes.\nThe U.S. bombed three major Iranian nuclear sites in June as Israel waged an air war with Iran. Nearly 1,100 people were killed in Iran, including military commanders and nuclear scientists, while 28 people were killed in Israel."
    },
    {
      "url": "https://apnews.com/article/washington-dc-crime-assault-doge-05aaaeb09d106ca1af673b46e89d60e1",
      "text": "Trump threatens federal takeover of DC after attack on former DOGE worker\nWASHINGTON (AP) — Two 15-year-olds have been arrested in Washington in connection with the attempted carjacking and beating of one of the most prominent members of the Department of Government Efficiency, renewing calls from President Donald Trump for the federal government to seize control of the nation’s capital.\nThe victim, Edward Coristine, nicknamed “Big Balls,” was among the most visible figures of Trump’s DOGE, which was tasked with slashing federal bureaucracy.\nCoristine was assaulted around 3 a.m. Sunday in the city’s Logan Circle neighborhood by a group of teenagers attempting to carjack him and a woman whom police identified as his significant other, according to authorities.\nThe Metropolitan Police Department said the group approached the couple’s car and made a comment about taking it. Coristine pushed the woman into the vehicle for safety and turned to confront the group. At least several of the teens then attacked him, police said, until officers patrolling nearby intervened. As officers moved toward the group, the teens fled on foot.\nTwo 15-year-olds from Maryland were arrested on charges of unarmed carjacking, police said.\nThe attack gave new fuel to long-standing Republican efforts to challenge Washington’s autonomy, with Trump threatening to bypass local authority and impose direct federal control over the city.\nIn a social media post and remarks at the White House on Tuesday, the president described crime in Washington as “out of control.”\n“If D.C. doesn’t get its act together, and quickly, we will have no choice but to take Federal control of the City, and run this City how it should be run, and put criminals on notice that they’re not going to get away with it anymore,” Trump said in a post on Truth Social.\nThe District of Columbia has long served as a symbolic battleground in debates over crime and governance, and its lack of statehood has made it uniquely vulnerable to federal intervention. Republican leaders have frequently seized on episodes of violence to portray the city as a case study of violence in cities run by Democratic mayors, even as city officials note that violent crime overall is down more than 25% from the same period last year.\nStill, local officials have acknowledged in recent years that youth crime, particularly carjackings, remains a serious concern. Just last year, a 14-year-old was charged with killing a Lyft driver in a botched carjacking, and a significant portion of carjacking arrests in Washington involve juveniles.\nThe Metropolitan Police Department said its investigation into the attack on Coristine remains active and additional suspects are still being sought.\n__\nBalsamo reported from New York."
    },
    {
      "url": "https://mpdc.dc.gov/page/designated-juvenile-curfew-zones-2025",
      "text": "Below is a list of active and past Juvenile Curfew Zones designated by the Metropolitan Police Department.\nNote that within a Juvenile Curfew Zone, persons 17 and under are prohibited from gathering in a group of nine (9) or more in any public place or on the premises of any establishment unless engaged in certain exempted activities, which are listed here. The Metropolitan Police Department reminds the public that a citywide curfew remains in effect for all juveniles age 17 and under beginning nightly at 11 pm, lasting until 6 am the following morning, through August 31, 2025.\nAugust 10–13, 2025\nNavy Yard Juvenile Curfew Zone\n- The perimeter of the Zone is as follows:\n- To the north: I-695 and Virginia Avenue, SE\n- To the east: 8th Street from Virginia Avenue to M Street, SE; 4th Street from M Street, SE to the Anacostia River\n- To the south: M Street, SE between 4th and 8th Street, SE; Potomac Avenue, SE / Ancostia River between South Capitol Street and 4thStreet, SE\n- To the west: South Capitol Street, SE from the Anacostia River to I-695\n- Start Time: 8:00 PM on August 10, 2025; End Time: 11:00 PM on August 13, 2025\n- [Map]\nAugust 1–4, 2025\nSouthwest Juvenile Curfew Zone\n- The perimeter of the Zone is as follows:\n- To the north: I-395/Southwest Freeway\n- To the east: South Capitol Street, SW\n- To the south: Anacostia River from South Capitol Street to 2nd Street, SW; P Street, SW from 2nd Street, SW to the Washington Channel\n- To the west: 2nd Street, SW from the Anacostia River to P Street, SW; Washington Channel from P Street, SW to I-395\n- Start Time: 8:00 PM on August 1, 2025; End Time: 11:00 PM on August 4, 2025\n- [Map]\nNortheast Juvenile Curfew Zone\n- The perimeter of the Zone is as follows:\n- To the north and east: South Dakota Avenue, NE\n- To the west: Bladensburg Road, NE\n- To the south: V Street, NE\n- Start Time: 8:00 PM on August 1, 2025; End Time: 11:00 PM on August 4, 2025\n- [Map]\nJuly 18–20, 2025\nU Street Corridor Juvenile Curfew Zone\n- The perimeter of the Zone is as follows:\n- To the north: V Street from 15th Street to Vermont Avenue, NW ; Vermont Avenue from V Street to Florida Avenue, NW; Florida Avenue from Vermont Avenue to V Street, NW; V Street from Florida Avenue to Georgia Avenue, NW\n- To the east: Georgia Avenue / 7th Street from V Street to T Street, NW\n- To the south: T Street from 7th Street to 15th Street, NW\n- To the west: 15th Street from T Street to V Street, NW\n- Start Time: 8:00 PM on July 18, 2025; End Time: 11:00 PM on July 20, 2025\n- [Map]\nJuly 11–13, 2025\nNavy Yard Juvenile Curfew Zone\n- The perimeter of the Zone is as follows:\n- To the north: I-695 and Virginia Avenue, SE\n- To the east: 8th Street from Virginia Avenue to M Street, SE; 4th Street from M Street, SE to the Anacostia River\n- To the south: M Street, SE between 4th and 8th Street, SE; Potomac Avenue, SE / Ancostia River between South Capitol Street and 4thStreet, SE\n- To the west: South Capitol Street, SE from the Anacostia River to I-695\n- Start Time: 8:00 PM on July 11, 2025; End Time: 11:00 PM on July 13, 2025\n- [Map]"
    },
    {
      "url": "https://www.whitehouse.gov/fact-sheets/2025/01/fact-sheet-president-donald-j-trump-declares-a-national-emergency-at-the-southern-border/",
      "text": "Fact Sheet: President Donald J. Trump Declares a National Emergency at the Southern Border\nINVOKING A NATIONAL EMERGENCY: Today, President Donald J. Trump signed an Executive Order invoking the National Emergencies Act regarding the crisis at the Southern Border of the United States.\n- The Executive Order declares a national emergency at the southern border following four years of record-shattering illegal immigration into the U.S.\n- It directs the Secretary of Defense to deploy additional personnel to the border, including members of the Armed Forces and the National Guard.\n- Additionally, it directs the Secretaries of Defense and Homeland Security to finish the wall along the southern border and ensures that DHS has all the flexibility it needs to operate air missions near the border.\nTAKING BACK CONTROL: For the past four years, the federal government has abdicated its responsibility to enforce the border, resulting in a catastrophic immigration crisis for the United States.\n- When States like Texas took steps to prevent illegal crossings into their state, the federal government sought to stop them by cutting down their barriers.\n- A record-shattering 8.72 million border encounters have occurred at the southern border from FY21-FY24, overwhelming border resources and endangering communities.\n- This has led to untold hundreds of thousands of children being trafficked. Roughly 550,000 unaccompanied alien children have been encountered at the border since FY21. Fentanyl and other drugs are pouring over the border and flooding our communities, killing roughly 75,000 Americans in 2023—the number one cause of death for Americans ages 18-45.\n- It has allowed dangerous gangs like the Venezuelan Tren de Aragua to takeover and terrorize entire American cities.\n- And it has led to the murders of innocent Americans like Laken Riley, Jocelyn Nungaray, Rachel Morin, and many others.\nBUILDING ON PAST SUCCESS: America is in a dire situation, and it is past time for the government to act. President Trump first declared an emergency at the Southern Border on February 15, 2019, and continued that emergency on February 13, 2020.\n- Following the at-the-time historic surges of illegal aliens in 2018, President Trump declared a national emergency and successfully reduced the number of people seeking to enter the country illegally.\n- In 2024, President Trump promised to declare an emergency to secure the border and use the military where necessary to protect Americans from foreign threats.\n- This Executive Order will allow the government to gain operational control of the border, combat the cartels, and secure our nation.\n- As President Trump described in 2018: “Illegal immigration affects the lives of all Americans. Illegal immigration hurts American workers; burdens American taxpayers; and undermines public safety; and places enormous strain on local schools, hospitals, and communities in general, taking precious resources away from the poorest Americans who need them most. Illegal immigration costs our country billions and billions of dollars each year…And I will therefore take every lawful action at my disposal to address this crisis. And that’s what we’re doing.”"
    },
    {
      "url": "https://www.whitehouse.gov/presidential-actions/2025/03/restoring-truth-and-sanity-to-american-history/",
      "text": "By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:\nSection 1. Purpose and Policy. Over the past decade, Americans have witnessed a concerted and widespread effort to rewrite our Nation’s history, replacing objective facts with a distorted narrative driven by ideology rather than truth. This revisionist movement seeks to undermine the remarkable achievements of the United States by casting its founding principles and historical milestones in a negative light. Under this historical revision, our Nation’s unparalleled legacy of advancing liberty, individual rights, and human happiness is reconstructed as inherently racist, sexist, oppressive, or otherwise irredeemably flawed. Rather than fostering unity and a deeper understanding of our shared past, the widespread effort to rewrite history deepens societal divides and fosters a sense of national shame, disregarding the progress America has made and the ideals that continue to inspire millions around the globe.\nThe prior administration advanced this corrosive ideology. At Independence National Historical Park in Philadelphia, Pennsylvania — where our Nation declared that all men are created equal — the prior administration sponsored training by an organization that advocates dismantling “Western foundations” and “interrogating institutional racism” and pressured National Historical Park rangers that their racial identity should dictate how they convey history to visiting Americans because America is purportedly racist.\nOnce widely respected as a symbol of American excellence and a global icon of cultural achievement, the Smithsonian Institution has, in recent years, come under the influence of a divisive, race-centered ideology. This shift has promoted narratives that portray American and Western values as inherently harmful and oppressive. For example, the Smithsonian American Art Museum today features “The Shape of Power: Stories of Race and American Sculpture,” an exhibit representing that “[s]ocieties including the United States have used race to establish and maintain systems of power, privilege, and disenfranchisement.” The exhibit further claims that “sculpture has been a powerful tool in promoting scientific racism” and promotes the view that race is not a biological reality but a social construct, stating “Race is a human invention.”\nThe National Museum of African American History and Culture has proclaimed that “hard work,” “individualism,” and “the nuclear family” are aspects of “White culture.” The forthcoming Smithsonian American Women’s History Museum plans on celebrating the exploits of male athletes participating in women’s sports. These are just a few examples.\nIt is the policy of my Administration to restore Federal sites dedicated to history, including parks and museums, to solemn and uplifting public monuments that remind Americans of our extraordinary heritage, consistent progress toward becoming a more perfect Union, and unmatched record of advancing liberty, prosperity, and human flourishing. Museums in our Nation’s capital should be places where individuals go to learn — not to be subjected to ideological indoctrination or divisive narratives that distort our shared history.\nTo advance this policy, we will restore the Smithsonian Institution to its rightful place as a symbol of inspiration and American greatness –- igniting the imagination of young minds, honoring the richness of American history and innovation, and instilling pride in the hearts of all Americans.\nSec. 2. Saving Our Smithsonian. (a) The Vice President, in consultation with the Assistant to the President for Domestic Policy and the Special Assistant to the President and Senior Associate Staff Secretary, Lindsey Halligan, Esq., shall work to effectuate the policies of this order through his role on the Smithsonian Board of Regents with respect to the Smithsonian Institution and its museums, education and research centers, and the National Zoo, including by seeking to remove improper ideology from such properties, and shall recommend to the President any additional actions necessary to fully effectuate such policies.\n(b) The Vice President and the Director of the Office of Management and Budget shall work with the Congress to ensure that future appropriations to the Smithsonian Institution:\n(i) prohibit expenditure on exhibits or programs that degrade shared American values, divide Americans based on race, or promote programs or ideologies inconsistent with Federal law and policy; and\n(ii) celebrate the achievements of women in the American Women’s History Museum and do not recognize men as women in any respect in the Museum.\n(c) The Director of the Office of Management and Budget and the Secretary of the Interior shall take any other measures within their authority to promote the policy of this order.\n(d) As appropriate, the Vice President shall, in consultation with the Assistant to the President for Domestic Policy and Special Assistant to the President and Senior Associate Staff Secretary, Lindsey Halligan, Esq., work with the Speaker of the House of Representatives and the Senate Majority Leader, to seek the appointment of citizen members to the Smithsonian Board of Regents committed to advancing the policy of this order.\nSec. 3. Restoring Independence Hall. The Secretary of the Interior shall provide sufficient funding, as available, to improve the infrastructure of Independence National Historical Park, which shall be complete by July 4, 2026, the 250th anniversary of the signing of the Declaration of Independence.\nSec. 4. Restoring Truth in American History.\n(a) The Secretary of the Interior shall:\n(i) determine whether, since January 1, 2020, public monuments, memorials, statues, markers, or similar properties within the Department of the Interior’s jurisdiction have been removed or changed to perpetuate a false reconstruction of American history, inappropriately minimize the value of certain historical events or figures, or include any other improper partisan ideology;\n(ii) take action to reinstate the pre-existing monuments, memorials, statues, markers, or similar properties, as appropriate and consistent with 43 U.S.C. 1451 et seq., 54 U.S.C. 100101 et seq.,and other applicable law; and\n(iii) take action, as appropriate and consistent with applicable law, to ensure that all public monuments, memorials, statues, markers, or similar properties within the Department of the Interior’s jurisdiction do not contain descriptions, depictions, or other content that inappropriately disparage Americans past or living (including persons living in colonial times), and instead focus on the greatness of the achievements and progress of the American people or, with respect to natural features, the beauty, abundance, and grandeur of the American landscape.\nSec. 5. General Provisions. (a) Nothing in this order shall be construed to impair or otherwise affect:\n(i) the authority granted by law to an executive department or agency, or the head thereof; or\n(ii) the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.\n(b) This order shall be implemented consistent with applicable law and subject to the availability of appropriations.\n(c) This order is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.\nDONALD J. TRUMP\nTHE WHITE HOUSE,\nMarch 27, 2025."
    },
    {
      "url": "https://apnews.com/article/trump-washington-increased-federal-law-enforcement-takeover-33b186a95dabf111bac61db398aa7543",
      "text": "Trump orders increased federal law enforcement presence in Washington to ‘make DC safe again’\nTrump orders increased federal law enforcement presence in Washington to ‘make DC safe again’\nWASHINGTON (AP) — The White House said Thursday night that there will be increased presence of federal law enforcement in the nation’s capital to combat crime for at least the next week, amid President Donald Trump ‘s suggestions that his administration could fully take over running the city.\n“Washington, DC is an amazing city, but it has been plagued by violent crime for far too long,” White House press secretary Karoline Leavitt said in a statement. “President Trump has directed an increased presence of federal law enforcement to protect innocent citizens.”\nShe added that the increased federal presence means “there will be no safe harbor for violent criminals in D.C.”\nTrump has repeatedly suggested that the rule of Washington could be returned to federal authorities. Doing so would require a repeal of the Home Rule Act of 1973 in Congress, a step Trump said lawyers are examining — but could face steep pushback.\n“We have a capital that’s very unsafe,” Trump told reporters at the White House this week. “We have to run D.C.”\nThe White House said the increased law enforcement would “make D.C. safe again” and would be present on the streets starting at midnight — led by U.S. Park Police following an 11 p.m. Thursday roll call at an established command center.\nThe push will last the next seven days with the option to extend “as needed,” under the authority of Trump’s previous executive order establishing the Making DC Safe and Beautiful Task Force. The added federal officials will be identified, in marked units and highly visible, the White House said.\nParticipating law enforcement include personnel from the U.S. Capitol Police, Homeland Security Investigations, the Federal Protective Service, the Drug Enforcement Administration, Enforcement and Removal Operations, the Bureau of Alcohol, Tobacco, Firearms and Explosives, the U.S. Marshals Service and the U.S. Attorney’s Office for the District of Columbia.\nThe police forces for Amtrak and the city’s Metro rail service are also involved.\nHowever a two-hour tour of the D.C. streets, starting around 1 a.m. Friday, revealed no evidence of the sort of multi-agency flood of uniformed personnel described in Trump’s announcement. There was a robust, but not unusual, Metropolitan Police Department presence in late-night hot spots like 14th Street and along Florida Avenue. But there was no overt or visible law enforcement presence other than the MPD.\nTrump has long suggested crime and violence is on the rise in Washington, and has lately begun to criticize things like litter and graffiti. But the catalyst for the order to increase police presence was the assault last weekend on a high-profile member of the Department of Government Efficiency by a group of teenagers in an attempted carjacking.\nThe victim, Edward Coristine, nicknamed “Big Balls,” was among the most visible figures of DOGE, which was tasked with cutting jobs and slashing the federal bureaucracy. Police arrested two 15-year-olds and say they’re still looking for other members of the group.\n“If D.C. doesn’t get its act together, and quickly, we will have no choice but to take Federal control of the City, and run this City how it should be run, and put criminals on notice that they’re not going to get away with it anymore,” Trump posted on Truth Social earlier this week.\nThe president subsequently said he was considering repealing Washington’s limited Home Rule autonomy or “bringing in the National Guard, maybe very quickly.”\nThursday’s announcement comes as Washington Mayor Muriel Bowser’s government can claim to have reduced the number of homicides and carjackings — both of which spiked citywide in 2023.\nCarjackings in Washington overall dropped significantly the following year in 2024, from 957 to just under 500, and the number is on track to decline again this year — with less than 200 recorded so far more than halfway through 2025."
    },
    {
      "url": "https://www.latimes.com/world-nation/story/2025-08-10/netanyahu-defends-planned-military-offensive-in-gaza-and-lashes-out-at-global-campaign-of-lies",
      "text": "Amid global outcry, Netanyahu announces new Gaza offensive will be even broader\n- Share via\nJERUSALEM — Israeli Prime Minister Benjamin Netanyahu on Sunday defended a new military offensive in Gaza that’s more sweeping than previously announced, declaring in the face of growing condemnation at home and abroad that Israel “has no choice but to finish the job and complete the defeat of Hamas.”\nEven as more Israelis express concern over the 22-month war, Netanyahu said the security Cabinet last week instructed the dismantling of Hamas strongholds not only in Gaza City but also in the “central camps” and Muwasi. A source familiar with the operation, who spoke on condition of anonymity because they were not authorized to talk to the media, confirmed that Israel plans the operations in both areas.\nThe crowded camps — sheltering well over a half a million displaced people, according to the United Nations — had not been part of Israel’s announcement Friday of the offensive in Gaza City. It was unclear why, though Netanyahu faced criticism this weekend within his ruling coalition that targeting Gaza City was not enough. The prime minister said there would be “safe zones,” but such designated areas have been bombed in the past.\nNetanyahu’s office late Sunday said he had spoken with President Trump about the plan and thanked him for his “steadfast support.”\nHours after Netanyahu spoke, broadcaster Al Jazeera announced that one of its correspondents, Anas al-Sharif, was killed along with other journalists in an Israeli strike in Gaza City. Israel confirmed his death.\nAs authorities were reporting this weekend that two more Palestinian children had died of malnutrition-related deaths — bringing their toll in Gaza to 100 since the start of the war — the Israeli prime minister asserted Sunday that there is “no starvation in Gaza,” dismissing the notion as a “global campaign of lies.”\nNetanyahu spoke to foreign media just before an emergency meeting of the United Nations Security Council, which has been a platform for outrage but little action on the war.\n“Our goal is not to occupy Gaza, our goal is to free Gaza,” Netanyahu said.\nNetanyahu said there is a “fairly short timetable” for next steps in Gaza, but didn’t give specifics. The goals, he said, include demilitarizing the territory, the Israeli military having “overriding security control” there and a non-Israeli civilian administration in charge.\nIsrael wants to increase the number of aid distribution sites, he said, but in a later briefing to local media, he asserted: “There is no hunger. There was no hunger. There was a shortage, [but] there was certainly no policy of starvation.”\nNetanyahu also said he has directed Israel’s military to “bring in more foreign journalists” — which would be a striking development, as they haven’t been allowed into the Gaza Strip beyond trips with the military during the war.\nHe again blamed many of Gaza’s problems on the militant group Hamas, including civilian deaths, destruction and aid shortages. “Hamas still has thousands of armed terrorists,” he said, adding that Palestinians are “begging” to be freed from them.\nHamas responded with a lengthy statement that summed up Netanyahu’s remarks as “blatant lies.”\nLate Sunday, heavy bombardment was reported in Gaza City. Shortly before midnight, Al Jazeera said Al-Sharif was killed in a strike along with other journalists and a driver, citing the director of Shifa Hospital in Gaza City.\nIsrael’s military confirmed it, saying that Al-Sharif had “posed as a journalist” and alleging he was with Hamas. The Committee to Protect Journalists last month had said it was gravely concerned for his safety and that he was being “targeted by an Israeli military smear campaign.”\nAt Sunday’s U.N. Security Council meeting, the United States defended Israel, saying it has the right to decide what’s best for its security. It called allegations of genocide in Gaza false.\nThe U.S. has veto power on the Security Council and can block proposed actions there.\nOther council members, and U.N. officials, expressed alarm. China said Israel’s campaign amounted to the “collective punishment” of the people of Gaza, which it called unacceptable. Russia warned against a “reckless intensification of hostilities.”\n“This is no longer a looming hunger crisis; this is starvation,” said Ramesh Rajasingham with the U.N. humanitarian office. “Humanitarian conditions are beyond horrific. We have frankly run out of words to describe it.”\nIsrael faces growing unrest even among its closest allies. Netanyahu said Chancellor Friedrich Merz of Germany had “buckled under” the growing international criticism by stopping exports of military equipment to Israel that could be used in Gaza. Merz told public broadcaster ARD that Germany and Israel were talking “very critically” but Berlin’s overall policy of friendship hadn’t changed.\nAt least 31 Palestinians were killed while seeking aid in Gaza in the last 24 hours, hospitals and witnesses said Sunday.\nThe Associated Press spoke to witnesses of gunfire in the Israeli-controlled Morag and Netzarim corridors and the Teina area in the south. All accused Israeli forces of firing at crowds trying to reach food distributions or waiting for convoys.\nFifteen people were killed while waiting for aid trucks close to the newly built Morag corridor that separates the southern cities of Rafah and Khan Yunis, according to Nasser Hospital.\nThe situation is a “death trap,” said Jamal al-Laweh, who said Israeli forces opened fire there. “But I have no other choice to feed the kids.”\nSix people were killed while waiting for aid in northern Gaza near the Zikim crossing, according to Gaza’s Health Ministry and Shifa Hospital.\nIn central Gaza, witnesses said they heard warning shots before the fire was aimed toward crowds trying to reach a food distribution site operated by the Israeli-backed and U.S.-funded Gaza Humanitarian Foundation. The AP could not independently confirm who fired the shots. Al-Awda Hospital in the nearby Nuseirat refugee camp said four people were killed by Israeli gunfire.\n“First, it was in the air, then they started to fire at the people,” said Sayed Awda, who waited hundreds of yards from the aid site.\nSix other aid seekers were killed while trying to reach Gaza Humanitarian Foundation sites in Khan Yunis and Rafah, Nasser Hospital said.\nThe foundation sites opened in May as an alternative to the U.N.-run aid system, but their early operations have been marred by deaths and chaos, with aid seekers coming under gunfire near routes leading to the sites.\nResponding to AP inquiries, the foundation’s media office said: “There were no incidents at or near our sites today and these incidents appear to be linked to crowds trying to loot aid convoy.”\nIsrael’s military said there were no incidents involving its troops near central Gaza aid sites.\nSeven people were killed in airstrikes, local hospitals said — three near the fishermen’s port in Gaza City, and two adults and two children in a strike that hit a tent in Khan Yunis. Israel’s military did not immediately comment on the strikes, but has accused Hamas of operating from civilian areas.\nIsrael’s air and ground offensive has displaced most of Gaza’s population and pushed the territory toward famine. Two more Palestinian children died of malnutrition-related causes on Saturday, authorities said, bringing the toll among children to 100 since the war began.\nA total of 117 adults have died of malnutrition-related causes since late June, when the Health Ministry started to count that age category, it said.\nThe hunger toll is in addition to the ministry’s war toll of 61,400 Gazans. The Health Ministry, part of the Hamas-run government and staffed by medical professionals, doesn’t distinguish between fighters or civilians in its tally, but says around half of the dead have been women and children. The U.N. and independent experts consider it the most reliable source on war casualties.\nHostages’ relatives have urged a labor strike in Israel next week over the plans to expand military operations, fearing it will endanger their loved ones. Fifty hostages remain after being taken in the Hamas-led attack on Oct. 7, 2023, that sparked the war. Twenty are believed to be alive.\nDozens of people sat outside the U.S. Consulate in Jerusalem to protest Israel’s offensive. “I think it’s a horrible decision. It’s like deciding that we don’t want [hostages] alive anymore,” said one person, Milly Rothschild.\nTens of thousands of Israelis rallied in Tel Aviv on Saturday night in what local media called one of the largest antigovernment protests in months.\nLishay Miran-Lavi, whose husband, Omri, is among the hostages, appealed to Trump and U.S. special envoy Steve Witkoff to halt the fighting.\n“The decision to send the army deeper into Gaza is a danger to my husband, Omri. But we can still stop this disaster,” she said.\nAlso Sunday, Israeli Defense Minister Israel Katz toured the northern part of the Israeli-occupied West Bank, where about 40,000 Palestinians have been driven from their homes this year in the West Bank’s largest displacement since Israel captured the territory in 1967.\nIsrael says the operations are needed to stamp out militancy, as violence by all sides has surged since the war in Gaza began.\nKatz said the military would remain in the area’s refugee camps at least until the end of the year, and said the number of warnings about attacks against Israelis in the West Bank had decreased by 80% since the operation began in January.\nShurafa, Metz and Magdy write for the Associated Press and reported from Deir al Balah, Gaza Strip, Jerusalem and Cairo, respectively. AP writers Melanie Lidman in Tel Aviv, Sally Abou AlJoud in Beirut, Edith M. Lederer at the United Nations and Jamey Keaten in Geneva contributed to this report."
    },
    {
      "url": "https://www.latimes.com/world-nation/story/2025-08-09/jd-vance-went-kayaking-for-his-birthday-secret-service-had-the-river-level-raised",
      "text": "JD Vance went kayaking for his birthday. Secret Service had the river level raised\n- Share via\nCOLUMBUS, Ohio — Vice President JD Vance’s security detail had an Ohio river’s water level raised to accommodate a kayaking trip he and his family took to celebrate his 41st birthday earlier this month.\nThe U.S. Secret Service said it requested the increased waterflow for the Little Miami River, first reported by the Guardian, to ensure motorized watercraft and emergency personnel “could operate safely” while protecting the vice president, whose home is in Cincinnati.\nBut critics immediately blasted the action as a sign of the vice president’s entitlement, particularly given the Trump administration’s focus on slashing government spending.\nRichard W. Painter, who served as chief White House ethics lawyer under President George W. Bush, said on X that “it’s outrageous for the Army Corps of Engineers to spend taxpayer money to increase water flow in a river so @VP can go canoeing when budget cuts to the National Park Service have severely impacted family vacations for everyone else.”\nThe Army Corps of Engineers declined to address any financial impact of raising the river. Spokesman Gene Pawlik said the agency’s Louisville District temporarily increased outflows from the Caesar Creek Lake in southwest Ohio into the Little Miami “to support safe navigation of U.S. Secret Service personnel.” He said the move met operational criteria and fell within normal practice.\n“It was determined that the operations would not adversely affect downstream or upstream water levels,” he said in a statement. “Downstream stakeholders were notified in advance of the slight outflow increase, which occurred Aug. 1, 2025.” Vance’s birthday was on Aug. 2.\nVance spokesman Taylor Van Kirk said the vice president was unaware the river had been raised.\n“The Secret Service often employs protective measures without the knowledge of the Vice President or his staff, as was the case last weekend,” she said via text.\nThe sprawling 2,830-acre Caesar Creek Lake has an unlimited horsepower designation and five launch ramps, according to the Ohio Department of Natural Resources website. A marina, a campground and a lodge are also located on site. The department provided two natural resources officers to assist the Secret Service with the Vance event, spokesperson Karina Cheung said.\nThe Vance family has already become accustomed to certain accommodations being made as they move about the world. During a recent trip to Italy, the Roman Colosseum was closed to the public so that his wife, Usha, and their children could take a tour, sparking anger among some tourists. The Taj Mahal also was closed to visitors during the Vance family’s visit to India.\nSuch special treatment isn’t reserved for one political party.\nWhen Democratic Vice President Al Gore, then a presidential candidate, paddled down the Connecticut River for a photo opportunity in 1999, utility officials had opened a dam and released 4 billion gallons of water to raise the river’s level. That request too came after a review of the area by the Secret Service — and Gore also experienced political pushback.\nGore’s campaign said at the time that he did not ask for the water to be released.\nSmyth writes for the Associated Press."
    },
    {
      "url": "https://apnews.com/article/elon-musk-doge-donald-trump-962778979dd35ea79d6092df9cb2cb56",
      "text": "Musk defends his work as he prepares to wind down at DOGE but gives hazy answers on future\nMusk defends his work as he prepares to wind down at DOGE but gives hazy answers on future\nWASHINGTON (AP) — Elon Musk, preparing to step back from his work leading the Department of Government Efficiency, had a request of the reporters gathered at the White House to interview him: Before he would answer any questions, he wanted someone to tell him a joke.\nThe tech billionaire’s request in the Roosevelt Room on Wednesday underscored the surreal and idiosyncratic presence of the world’s richest man at the highest echelons of American power. Over the past few months, his work of downsizing the workforce has sent shocks through the federal government and drawn intense pushback, including protests of his electric vehicle company, Tesla.\nMusing about his and DOGE’s incongruous role in the U.S. government, he said, “It is funny that we’ve got DOGE.”\n“Doesn’t the absurdity of that seem, like, like, are we in a simulation here or what’s going on? But, like, it was a meme coin at one point,” he said, laughing. “How did we get here?”\nMusk, clad in all black but missing the two hats he had worn at Wednesday’s earlier Cabinet meeting, defended DOGE’s work as he prepares to scale back his government role and spend more time at his businesses. But he gave hazy answers about the work he’d been doing and DOGE’s future, and he seemed taken aback by the intense backlash he’d encountered.\n“Being attacked relentlessly is not super fun,” he said. “Seeing cars burning is not fun,” he added, referring to the instances of Tesla cars being smashed or set on fire.\n“In the grand scheme of things, I think we’ve been effective. Not as effective as I’d like. I think we could be more effective,” Musk said. “But we’ve made progress.”\nDOGE’s large-scale slashings have been met with dozens of lawsuits. DOGE’s attempts to access sensitive government information, including Social Security data, has similarly met resistance in court. And Democrats this week unveiled an online tracker tallying the federal funds approved by Congress that DOGE has blocked, setting up a constitutional struggle between two branches of government.\nMusk wouldn’t offer examples of anything he’d do differently, though DOGE is nowhere near its original savings goal and has overstated its progress.\nDOGE had sought to cut spending by $1 trillion. Musk estimates he’s cut $160 billion so far and acknowledged it would be hard to get anywhere close to $1 trillion.\n“It’s sort of, how much pain is the Cabinet and the Congress willing to take?” Musk said. “It can be done, but it requires dealing with a lot of complaints.”\nMusk didn’t detail any of those complaints and said he has a good relationship with President Donald Trump’s Cabinet. But when asked about clashes with certain members, particularly Secretary of State Marco Rubio, Musk said, “at times, there will be some disagreements with the Cabinet.”\nHe defended DOGE’s attempts to access Americans’ personal data, dismissing concerns about a potential “surveillance state” by quipping, “Don’t we already have a surveillance state?” He said DOGE needs to access the systems in its hunt for fraud, and said, “There has to be some way to reconcile the improper payments.”\nHe said DOGE has referred cases of suspected fraud to the Justice Department, though he offered few details, including how many referrals were made. Antonio Gracias, a Musk investor working for DOGE, pointed to the indictment last week of an Iraqi man living in New York on charges he illegally voted in the 2020 election. U.S. prosecutors said DOGE assisted in the investigation.\nA Justice Department spokesperson said DOGE “is working closely with DOJ to identify potential fraud.”\nMusk acknowledged there were some instances in which they had to restore the jobs of government workers who, in his words, were “accidently let go,” like “some people that were doing important regulatory work or taking care of national parks.”\nWhen asked if he’s found any areas where he’d recommended efficiencies beyond cuts, Musk veered into the nation’s military strategy and said he has repeatedly recommended to Defense Secretary Pete Hegseth that he should be spending more money on hypersonic missiles and long-range drones instead of on crewed systems.\nMusk said DOGE is also working on improving connectivity for the nation’s air traffic control system and reviewing plans to improve its software, but DOGE’s primary goal is “trying to stop wasteful and fraudulent spending.”\nBut on other points, he was vague.\nWho will lead DOGE when he leaves?\n“DOGE is a way of life,” he said. “Like Buddhism.”\nWill he retain the title of senior adviser to the president?\n“I guess.”\nWill DOGE wrap up its work by July 2026, as originally stated?\n“If the president wants us to stick to that date, we’ll stick to that date.”\nHow many of the roughly 100 DOGE employees will stay on the job while he winds down?\n“Some will stay on. Some will not. So it’s up to them. This is basically a volunteer organization.”\nIs DOGE winding down?\n“No, I think it will gain momentum.”\nMusk struck up a friendship with Trump during the 2024 campaign and spent nearly $300 million on the election — the bulk of which went toward helping the Republican reclaim the White House. He has since become a constant presence with Trump for much of the first 100 days of the administration, regularly traveling with the president to his home in Florida on the weekends.\nMusk said Wednesday that he was working on DOGE seven days a week during the first months of the administration, at times sleeping in the Lincoln Bedroom at Trump’s invitation.\nHe declined to say just how many times he had slept at the White House but said the president had implored him to try the caramel ice cream from the kitchen.\n“Don’t tell RFK,” Musk joked, referring to Trump’s Health Secretary Robert F. Kennedy Jr.\nMusk described it as an “intense period” during which he was trying to understand and map out the federal government.\n“It’s a startup, effectively. A new administration is like a startup,” he said.\nBut he said he is now scaling back his work on DOGE, spending one to two days a week on it, and he plans to be in Washington less.\n“Now we’re getting more of a rhythm so the amount of time that’s necessary for me to spend here is much less,” he said.\nHe also pointed to the limitation on his status as a special government employee, which means he can only work 130 days in a 365-day time period.\nHe said he will keep his “tiny” office on the second floor of the West Wing that he said has “a view of nothing” — a feature, he then remarked, that keeps him safe.\n“It’s harder to shoot me,” he said. “There’s not a good line of sight.”\n___\nAssociated Press writer Alanna Durkin Richer contributed to this report."
    },
    {
      "url": "https://mpdc.dc.gov/page/dc-curfew-law",
      "text": "Juvenile Curfew Emergency Amendment Act of 2025\nThe Juvenile Curfew Emergency Amendment Act of 2025 took effect on July 7, 2025. An 11:00 p.m. curfew is now in effect citywide every night for all persons age 17 and under though August 31, 2025.\nWhat does the law say?\nThe Juvenile Curfew Emergency Amendment Act of 2025 states that persons age 17 or younger cannot remain in any public place or on the premises of any establishment within the District of Columbia during curfew hours, unless they are involved in certain exempted activities.\nThe law gives the Chief of Police the authority to establish Extended Juvenile Curfew Zones and allows the Mayor of the District of Columbia to authorize an Emergency Juvenile Curfew.\nWhat are the curfew hours?\nNow through August 31, 2025 :\n- Curfew hours are 11:00 pm to 6 am, seven days a week\nBeginning September 1, 2025:\n- Curfew begins at 11 pm on Sunday through Thursday nights, and continues until 6 am the following day\n- Curfew hours are 12:01 am to 6 am on Saturday and Sunday (curfew on \"Friday night\" begins at 12:01 am Saturday; curfew on \"Saturday night\" begins at 12:01 am Sunday)\nJuvenile Curfew Zones\nIn Juvenile Curfew Zones, any person age 17 and under gathering in a group of nine (9) or more youths in any public place or on the premises of any establishment within the perimeter of an extended juvenile curfew zone must leave the area unless engaged in certain exempted activities. The Chief of Police will designate the curfew hours within these zones and communicate them to the public, but they will not begin before 8:00 pm or end after 6 am.\nA list of declared Juvenile Curfew Zones is available in a link at the bottom of this page.\nJuvenile Curfew Zone Petition\nPursuant to the emergency law, an Advisory Neighborhood Commission (ANC), business improvement district (BID), or Main Street organization may petition the Chief of Police to establish a Juvenile Curfew Zone with extended juvenile curfew hours in an area covered by, or adjacent to the area covered by, the organization.\nThe petition must be approved by a formal vote of the members of the ANC, or the members of the BID or Main Street board of directors.\nFor more information on submitting a petition, please visit this form.\nDoes the curfew law apply to non-District residents?\nYes. The curfew law applies to all persons age 17 and under who are in the District of Columbia during curfew hours. This includes both District residents as well as young people who reside elsewhere.\nWhat are the penalties for violating the law?\nA parent or legal guardian of a juvenile age 17 and under commits an offense if he or she knowingly permits, or by insufficient control allows, a minor to violate the curfew law. Any adult who violates the Juvenile Curfew Act is subject to a fine not to exceed $500 or community service. A minor who violates curfew may be ordered to perform up to 25 hours of community service.\nPersons age 17 and under are exempt from curfew if they:\n- Accompany a parent or guardian\n- Complete an errand at the direction of a parent or guardian, without detour or stop\n- Ride in a motor vehicle involved in interstate travel\n- Work or return home from a job, without detour or stop\n- Become involved in an emergency\n- Stand on a sidewalk that joins their residence or the residence of a next-door neighbor, if the neighbor did not complain to police\n- Attend an official school, religious, or other recreational activity sponsored by the District of Columbia, a civic organization, or other similar group that takes responsibility for the juvenile (this includes traveling to and from the activity)\n- Exercise their First Amendment rights protected by the US Constitution, including the free exercise of speech, religion, and right of assembly\nIs a Curfew Law Constitutional?\nPassed in 1995, The Juvenile Curfew Act of 1995 (DC Code 2-1541 et. seq.) was set up to protect the health and safety of young people and our communities. After the law was challenged in court, MPD stopped enforcement until the court decided whether the law was constitutional. In June 1999, the US Circuit Court of Appeals for the District of Columbia found the law to be constitutional. The District began enforcing the law again in the fall of 1999.\nAdditional Resources\nFor more information on programs and safety tips for young people, visit:\n- Safe Summer DC\n- DC Department of Parks and Recreation Summer Programs\n- Mayor Marion S, Barry Summer Youth Employment Program\n- National Crime Prevention Council Online Resource Center"
    },
    {
      "url": "https://apnews.com/article/district-of-columbia-trump-takeover-3b58c1efabf17db271dce582d9a09c6d",
      "text": "Why a full federal takeover of DC would require an act of Congress\nWhy a full federal takeover of DC would require an act of Congress\nWASHINGTON, D.C. (AP) — The moment that local officials in Washington have been dreading for months is finally here. President Donald Trump, one month into his second term, has publicly returned to one of his longtime talking points: a federal takeover of the District of Columbia.\nIt would take some doing, though — including, literally, an act of Congress. But the issue bubbled up again this week, the latest in the blizzard of initiatives that have surfaced since Trump took the oath of office Jan. 20.\nWhether it was just a reminder that the president possesses the power to set off alarms with an off-the-cuff remark or by directing his administration to take concrete steps to make it happen remains to be seen. As with efforts to rename the Gulf of Mexico, make Canada the 51st state or make Greenland a U.S. territory, a lot depends on what happens next.\nHere’s a look at some of the questions surrounding the issue:\nCould this really happen?\nYes, but Trump can’t do it alone. Congress, with both houses controlled by Republicans, could absolutely vote to repeal the 1973 Home Rule Act. That would be a deeply controversial vote which would likely test the strength of the three-seat GOP majority in the House of Representatives.\nWhy now?\nThat’s a bit of a mystery. Mayor Muriel Bowser has set a conciliatory tone ever since Trump was elected again. She traveled to Mar-a-Lago to meet with Trump, and said she looked forward to working with the new administration and emphasized the common-ground issues — such as their mutual desire to get federal workers back to their offices.\nTrump, in his brief comments on Air Force One, said he and Bowser “get along great.”\nBowser responded with a posting on X, declaring D.C. “a world-class city” and listing the District’s virtues.\nTrump was also responding to a specific question from a reporter, so it’s possible this was an off-the-cuff comment and not indicative of an immediate priority issue for him.\nWhat can Trump do unilaterally?\nLocal government officials have been quietly predicting some sort of executive order imposing stiffer criminal penalties or a crackdown on homeless encampments, but a full “ takeover” would still require an act of Congress.\nHe could theoretically take over the Metropolitan Police Department — something that was considered during the 2020 mass protests over the murder of George Floyd by Minneapolis police. Justin Hansford, a professor at D.C.'s Howard University School of Law, said such a step would need some sort of “justifying emergency.” Trump’s perspective on what constitutes such an emergency, Hansford said, “would absolutely be challenged in court.”\nHow bad are the problems he mentioned?\nViolent crime rates, particularly homicide and car jacking, legitimately spiked in 2023, leaving officials publicly scrambling for answers. Those numbers came down significantly in 2024, in the face of a new public safety bill and a concerted MPD crackdown. They’re up a bit so far in 2025 but still down from their recent peak but also well below the late 1990s when D.C. regularly led the nation in per-capita homicides.\nGraffiti in D.C. is common but not exactly a civic crisis. The city has worked to both clean up graffiti hotspots and transform young taggers into publicly sponsored muralists.\nMultiple homeless encampments are a fact of life in Washington, but the District government is partially handcuffed by the fact that large swaths of the public greenspace, including many parks and traffic circles, are under the jurisdiction of the National Park Service. The last few years have settled into a cyclical dynamic, with homeless encampments slowly growing into mini tent cities on NPS land, followed by a mass clearing with bulldozers once or twice a year.\nWhat’s the history between Trump and DC?\nIt’s not positive.\nDuring Trump’s turbulent first term, he and the local government publicly sparred multiple times — in tones ranging from playful to deeply personal. When Trump floated the idea of a massive July 4 military parade complete with tanks rolling through the streets, the D.C. Council publicly mocked him.\nTrump accused Bowser of losing control of her city during protests over the murder of George Floyd. He backed down from a threat to take over the MPD, and eventually declared his own multi-agency lockdown that included low-flying helicopters buzzing protesters. Bowser responded by having “Black Lives Matter” painted on the street in giant yellow letters one block from the White House.\nTrump’s feelings remained intense during the four years after leaving office. He repeatedly promised a federal takeover while on the campaign trail as part of an effort to stoke fears about violence in U.S. cities generally. In August 2023, when he briefly came to town to plead not guilty on charges of trying to overturn his 2020 electoral loss to former President Joe Biden, Trump blasted the capital city on social media, calling it a “filthy and crime ridden embarrassment to our nation.”\nWhat about Congress?\nActivist Republicans in Congress have long used the House Oversight Committee as a forum to employ their power over the local government. During the crime spike in 2023, Bowser and members of the D.C. Council were regularly summoned for inquiries before the committee. That year, Congress also, for the first time in decades, fully overturned a D.C. law when it repealed a rewrite of the D.C. criminal code. But that required Congressional Democrats to join in, and then-President Biden to sign off on it.\nMembers of Congress have also repeatedly used budget riders to alter D.C. laws in minor ways, targeting everything from marijuana legalization to the city’s use of traffic cameras.\nAs an indication of just how personal and petty this dynamic has become, the bill previously introduced in Congress proposing to repeal D.C. home rule was titled to produce an antagonistic acronym. It’s called the Bringing Oversight to Washington and Safety to Every Resident Act or the BOWSER Act.\nIs there any silver lining for D.C.?\nPerhaps the most optimistic interpretation among D.C. officials is a quiet belief that Trump and Congress have no actual interest in the hassle that comes with managing a city of 700,000 residents — more populous that two U.S. states.\nThey expect a wave of budget riders from GOP members of Congress emboldened by Trump’s statements. But some observers believe Congress will stop short of assuming the responsibility and liability that would come with a full federal takeover.\n“As a lawyer, I’m thinking about who I would sue if there’s a police brutality case,” said Hansford, the Howard law professor. “I don’t think Congress wants to deal with all that.”"
    }
  ],
  "argos_summary": "President Trump has announced an increased federal law enforcement presence in Washington, D.C., in response to rising crime, particularly following an assault on a member of his administration. Despite the announcement, a late-night tour revealed no significant federal presence beyond local police. Trump has threatened a federal takeover of the city if local officials do not address crime effectively, a move that would require congressional action to repeal the Home Rule Act of 1973. Meanwhile, crime rates in D.C. have seen fluctuations, with recent statistics indicating a decrease in carjackings.",
  "argos_id": "LQO78IAWC"
}