{
  "url": "https://www.usatoday.com/story/sports/nascar/2025/08/11/connor-zilisch-injury-update-nascar-xfinity-series/85619576007/",
  "authorsByline": "Ellen J. Horrow",
  "articleId": "b07134fd1c384c50b53e2fa9e6d3e3ff",
  "source": {
    "domain": "usatoday.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "VA",
      "county": "Fairfax County",
      "city": "McLean",
      "coordinates": {
        "lat": 38.9342888,
        "lon": -77.1776327
      }
    }
  },
  "imageUrl": "https://www.usatoday.com/gcdn/authoring/authoring-images/2025/08/12/USAT/85619748007-zilisch.jpg?crop=2947,1658,x944,y390&width=2947&height=1658&format=pjpg&auto=webp",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T01:38:53+00:00",
  "addDate": "2025-08-12T01:41:26.037884+00:00",
  "refreshDate": "2025-08-12T01:41:26.037886+00:00",
  "score": 1.0,
  "title": "Connor Zilisch injury update: Young NASCAR star 'grateful to be walking'",
  "description": "Connor Zilisch broke his collarbone while celebrating his NASCAR Xfinity Series win at Watkins Glen on Aug. 9. Surgery could be next for driver.",
  "content": "NASCAR driver Connor Zilisch, who broke his collarbone while celebrating his Xfinity Series victory at Watkins Glen International on Saturday, Aug. 9, is “grateful to be walking,” after his scary fall.\n\nThe 19-year-old driver had taken the checkered flag in Saturday’s race at the New York road course and was climbing out through the window to celebrate on the roof his car when one foot got caught in the window netting. Zilisch stumbled then took a hard fall to the pavement.\n\n“The last thing I remember is thinking, I don’t know why, but I thought I was going to break my femur,” Zilisch said Monday, Aug. 11, on the Door Bumper Clear podcast. \"My leg was stuck. I thought I was going to get caught in the headrest and just, I thought I was done.”\n\nZilisch blacked out momentarily before on-track medical personnel rushed to his aid and whisked him away in an ambulance.\n\nOn the podcast, Zilisch revealed the first things he remembered saying to the medical personnel when he came to before they put him on stretcher with a neck brace.\n\n“I was talking to the medics like, ‘I’m good. I’m good. My shoulder hurts a little but that’s it,’” he recalled. “I was like, ‘Why am I on a stretcher right now? I feel fine.’ I didn’t realize what had happened.”\n\nZilisch was back at Watkins Glen the next day for the NASCAR Cup Series, though only as a spectator. Trackhouse Racing withdrew the car they planned to have him drive in Sunday’s race, which was eventually won by Trackhouse driver Shane Van Gisbergen.\n\nSpeaking to NBC Sports reporter Marty Snider during the Cup race, Zilisch expressed his relief and appreciation.\n\n“So, glad it wasn’t any worse, and the collar bone was the extent of the injuries,\" he said. … Hopefully, my young bones will heal fast, and I’ll be able to get back in it as soon as possible.”\n\nZilisch said surgery might be his best option for a quick return to racing, and he has a window because the Xfinity Series is off Aug. 15-16, while both the Craftsman Truck and Cup series race at Richmond Raceway that weekend.\n\nZilisch, who drives in the Xfinity Series for JR Motorsports – the team co-owned by siblings Dale Earnhardt Jr. and Kelley Earnhardt Miller – won his sixth race of the season at Watkins Glen and is likely to be one of the favorites for the 2025 Xfinity Series championship. But the first thing on the agenda is healing and recovery.\n\n“I think it might be something that I might have to get surgery for. But in this case, I think surgery is something that speeds up the process, so you can get plates and screws and get it reconstructed back together,\" Zilisch said Monday on the Door Bumper Clear podcast.\n\n“Shane [van Gisbergen] talked about it. He had an injury in 2021 and broke his collarbone — he had plates, screws, everything done and he was racing back the next weekend. Thankfully, the collarbone is a relatively quick bone to fix and heal.”\n\nThe Xfinity Series returns to racing on Aug. 22 at Daytona International Speedway, a track known for big crashes. Zilisch is the Xfinity points leader and has already missed one race this season due to a back injury.",
  "medium": "Article",
  "links": [
    "https://www.usatoday.com/story/sports/nascar/2025/08/10/watkins-glen-nascar-race-start-time-tv-streaming-lineup/85584321007/",
    "https://www.usatoday.com/picture-gallery/sports/nascar/2025/03/06/nascar-cup-series-race-winners-2025/81846018007/",
    "https://sportsdata.usatoday.com/motorsports/nascar/standings",
    "https://www.usatoday.com/story/sports/nascar/2025/08/09/connor-zilisch-fall-today-injury-update/85594294007/",
    "https://www.dirtymomedia.com/doorbumperclear",
    "https://www.nascar.com/live-results/nascar-xfinity-series/mission-200-at-the-glen/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "NASCAR driver Connor Zilisch",
      "weight": 0.09319216
    },
    {
      "name": "Connor Zilisch injury update",
      "weight": 0.087488994
    },
    {
      "name": "Connor Zilisch",
      "weight": 0.08726443
    },
    {
      "name": "Xfinity Series",
      "weight": 0.08712639
    },
    {
      "name": "Zilisch",
      "weight": 0.08527398
    },
    {
      "name": "Watkins Glen International",
      "weight": 0.07088334
    },
    {
      "name": "Trackhouse driver Shane Van Gisbergen",
      "weight": 0.067579396
    },
    {
      "name": "Watkins Glen",
      "weight": 0.066029936
    },
    {
      "name": "Xfinity",
      "weight": 0.06408918
    },
    {
      "name": "Young NASCAR star",
      "weight": 0.06029574
    }
  ],
  "topics": [
    {
      "name": "NASCAR"
    },
    {
      "name": "Motorsports"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.9375
    },
    {
      "name": "/Sports/Motor Sports/Auto Racing",
      "score": 0.6484375
    }
  ],
  "sentiment": {
    "positive": 0.11607047,
    "negative": 0.5668729,
    "neutral": 0.31705663
  },
  "summary": "NASCAR driver Connor Zilisch broke his collarbone while celebrating his victory in the Xfinity Series at Watkins Glen International on Saturday, Aug. 9. The 19-year-old driver was climbing out of the window to celebrate on the roof of his car when his foot got caught in the netting. Zilish blacked out momentarily before on-track medical personnel rushed to his aid and whisked him away in an ambulance. The next day, he returned to the track for the NASCAR Cup Series, but his car was withdrawn by Trackhouse Racing and the win was eventually won by Shane Van Gisbergen. Despite the injury, Zilich remains hopeful about a quick return to racing.",
  "shortSummary": "Connor Zilisch, a 19-year-old NASCAR star, is grateful to be walking after breaking his collarbone celebrating his Xfinity Series win at Watkins Glen.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "e30c1195f41e4a70a36a4b562089ca74",
  "places": [
    {
      "osmId": "702671615",
      "road": "Grand Prix Road",
      "county": "Schuyler County",
      "state": "New York",
      "postcode": "14891",
      "country": "United States",
      "countryCode": "us",
      "coordinates": {
        "lat": 42.336380500000004,
        "lon": -76.92504880603917
      }
    }
  ],
  "scraped_sources": [
    {
      "url": "https://www.usatoday.com/story/sports/nascar/2025/08/09/connor-zilisch-fall-today-injury-update/85594294007/",
      "text": "Connor Zilisch falls celebrating win: NASCAR driver says he broke collarbone\n- Connor Zilisch fell awkwardly while celebrating his win in the NASCAR Xfinity Series\n- He was placed on a backboard, put in an ambulance and eventually taken to a local hospital\n- He was released Saturday night and says he has a broken collarbone\nConnor Zilisch took the checkered flag Saturday in the NASCAR Xfinity Series race at Watkins Glen, but his celebration was short-lived after he took a nasty fall that landed him in an ambulance.\nZilisch had climbed out of his car and had his right foot on the roof and the left on the window when he appeared to slip, his feet getting caught in the netting and sending his head hurtling toward the ground. He hit the pavement hard and did not immediately move.\nHe was placed on a backboard and eventually loaded into an ambulance. The CW broadcast said Zilisch was speaking with medical personnel. NBC Sports' Dustin Long said Zilisch sat up in the ambulance, which was taking him to the infield care center.\nConnor Zilisch injury update\nNASCAR said Zilisch was \"transported to a local hospital for further evaluation\" and added that he was \"awake and alert.\"\nJR Motorsports provided another update later Saturday, saying Zilisch had been released from the hospital.\nZilisch, 19, took to social media himself a few minutes after JR Motorsports' announcement. He said he has a broken collarbone.\n\"Thank you everybody for reaching out today,\" Zilisch wrote on X. \"I’m out of the hospital and getting better already. Thankfully, CT scans for my head are clear, I just have a broken collarbone. Thankful for all the medics for quick attention and grateful it wasn’t any worse.\"\nZilisch was slated to take part in Sunday's Cup Series race at Watkins Glen, but Trackhouse Racing said late Saturday night that the No. 87 would be withdrawn. \"We wish Connor a speedy recovery,\" Trackhouse said in its statement.\nThis story has been updated with new information."
    },
    {
      "url": "https://sportsdata.usatoday.com/motorsports/nascar/standings",
      "text": "| | | | |\n|---|---|---|---|\n| | | | |\n| | | | |\n| | | | |\n| | | | |\n| | | | |\n| | | | |\n| | | | |\n| | | | |\n| | | | |\n| | | | |\n| | | | |\n| | | | |\n| | | | |\n| | | | |\n| | | | |\n| | | | |\n| | | | |\n| | | | |\n| | | | |\n| | | | |\nVeteran race car driver Robbie Brewer, 53, died following a crash during a race Aug. 9 at Bowman Gray Stadium in Winston-Salem, North Carolina – his daughter confirmed in a social media post.\nGannett may earn revenue from sports betting operators for audience referrals to betting services. Sports betting operators have no influence over nor are any such revenues in any way dependent on or linked to the newsrooms or news coverage. Terms apply, see operator site for Terms and Conditions. If you or someone you know has a gambling problem, help is available. Call the National Council on Problem Gambling 24/7 at 1-800-GAMBLER (NJ, OH), 1-800-522-4700 (CO), 1-800-BETS-OFF (IA), 1-800-9-WITH-IT (IN). Must be 21 or older to gamble. Sports betting and gambling are not legal in all locations. Be sure to comply with laws applicable where you reside.\nGambling involves risk. Please only gamble with funds that you can comfortably afford to lose. While we do our upmost to offer good advice and information we cannot be held responsible for any loss that maybe be incurred as a result of gambling. We do our best to make sure all the information that we provide on this site is correct. However from time to time mistakes will be made and we will not be held liable. Please check any stats or information if you are unsure how accurate they are. No guarantees are made with regards to results or financial gain. All forms of betting carry financial risk and it is down to the individual to make bets with or without the assistance of information provided on this site and we cannot be held responsible for any loss that maybe be incurred as a result of following the betting tips provided on this site. Past performances do not guarantee success in the future and betting odds fluctuate from one minute to the next. The material contained on this site is intended to inform, entertain and educate the reader and in no way represents an inducement to gamble legally or illegally. Betting is illegal in some countries, or areas of countries. It is the sole responsibility of the user to act in accordance with their local laws."
    },
    {
      "url": "https://www.usatoday.com/story/sports/nascar/2025/08/10/watkins-glen-nascar-race-start-time-tv-streaming-lineup/85584321007/",
      "text": "NASCAR at Watkins Glen results: Shane van Gisbergen wins fourth race of 2025\nShane van Gisbergen continues to prove he’s on a whole other level when it comes to road-course racing in the NASCAR Cup Series.\nThe Trackhouse Racing driver won the Go Bowling at The Glen on Sunday, Aug. 10 at Watkins Glen International for his fourth victory of the season, tying Denny Hamlin for most wins this season. According to the TV broadcast on USA Network, he also became the first rookie to win four Cup races in a single season.\nVan Gisbergen previously won the road-course races at Mexico City and Sonoma, as well as the street-course race in Chicago. The only non-oval race that saw a winner of than van Gisbergen was the first road race of the season at the Circuit of the Americas in Austin, Texas on March 2, 2025. He finished sixth behind Christopher Bell.\nWith his fourth consecutive road-course win, van Gisbergen tied Chase Elliott for second most all time. Elliott won four in a row between 2019 and 2020. Jeff Gordon holds the record with six consecutive victories on road courses.\nBell finished second Sunday at Wakins Glen, 2024 winner Chris Buescher took third, points leader William Byron came home fourth, and Chase Briscoe took fifth.\nVan Gisbergen will enter the playoffs as one of the top seeds when the postseason begins Aug. 31 at Darlington Raceway. The 10-race playoffs will feature one more non-oval race on Oct. 5 in the Bank of America ROVAL 400 on the road course/oval hybrid at Charlotte Motor Speedway.\nSee below for full results from Sunday's race:\nNASCAR results today: Go Bowling at The Glen\nFull results from Sunday's NASCAR Cup Series race at Watkins Glen International (with starting position in parentheses):\n- (2) Shane Van Gisbergen, No. 88 Chevrolet\n- (9) Christopher Bell, No. 20 Toyota\n- (12) Chris Buescher, No. 17 Ford\n- (10) William Byron, No. 24 Chevrolet\n- (3) Chase Briscoe, No. 19 Toyota\n- (1) Ryan Blaney, No. 12 Ford\n- (19) Daniel Suarez, No. 99 Chevrolet\n- (15) Bubba Wallace, No. 23 Toyota\n- (21) Tyler Reddick, No. 45 Toyota\n- (4) Ross Chastain, No. 1 Chevrolet\n- (18) A.J. Allmendinger, No. 16 Chevrolet\n- (29) Erik Jones, No. 43 Toyota\n- (17) Ryan Preece, No. 60 Ford\n- (11) Joey Logano, No. 22 Ford\n- (25) Austin Dillon, No. 3 Chevrolet\n- (13) Austin Cindric, No. 2 Ford\n- (33) Zane Smith, No. 38 Ford\n- (8) Carson Hocevar, No. 77 Chevrolet\n- (6) Michael McDowell, No. 71 Chevrolet\n- (7) Alex Bowman, No. 48 Chevrolet\n- (35) Noah Gragson, No. 4 Ford\n- (5) Kyle Busch, No. 8 Chevrolet\n- (34) Ricky Stenhouse Jr, No. 47 Chevrolet\n- (28) Riley Herbst, No. 35 Toyota\n- (22) Denny Hamlin, No. 11 Toyota\n- (20) Chase Elliott, No. 9 Chevrolet\n- (23) Justin Haley, No. 7 Chevrolet\n- (27) Todd Gilliland, No. 34 Ford\n- (36) Cody Ware, No. 51 Ford\n- (32) Ty Dillon, No. 10 Chevrolet\n- (16) Brad Keselowski, No. 6 Ford\n- (30) John H. Nemechek, No. 42 Toyota\n- (14) Ty Gibbs, No. 54 Toyota\n- (31) Cole Custer, No. 41 Ford\n- (24) Josh Berry, No. 21 Ford\n- (37) Katherine Legge, No. 78 Chevrolet\n- (39) Josh Bilicki, No. 66 Ford\n- (38) J.J. Yeley, No. 44 Chevrolet\n- (26) Kyle Larson, No. 5 Chevrolet\nWhat time does the NASCAR Cup race at Watkins Glen start?\nThe Go Bowling at The Glen is scheduled to start at 2 p.m. ET on Sunday, Aug. 10, at Watkins Glen International in Watkins Glen, New York.\nWhat TV channel is the NASCAR Cup race at Watkins Glen on?\nThe Go Bowling at The Glen will be broadcast on USA Network, the second time the Cup Series is on the channel this season. Pre-race coverage will start at 1:30 p.m. ET.\nWill there be a live stream of the NASCAR Cup race at Watkins Glen?\nYes, the Go Bowling at The Glen will be streamed on HBO Max. The race can also be streamed on Fubo, which is offering a free trial to new subscribers.\nWatch NASCAR Cup races on Fubo\nHow many laps is the NASCAR Cup race at Watkins Glen?\nThe Go Bowling at The Glen is 90 laps around the 2.450-mile road course for a total of 220.86 miles. The race will have three segments (laps per stage) — Stage 1: 20 laps; Stage 2: 20 laps; Stage 3: 50 laps.\nWho won the NASCAR Cup race at Watkins Glen last year?\nChris Buescher won the NASCAR Cup Series race at Watkins Glen last year in overtime. He passed van Gisbergen on the final lap and held on through the final few corners to secure the win. That win was Buescher's first of the 2024 season and came during the playoffs. He played spoiler for many playoff hopefuls in that race.\nWhat is the lineup for the Go Bowling at The Glen?\n(Car number in parentheses)\n- (12) Ryan Blaney, Ford\n- (88) Shane Van Gisbergen, Chevrolet\n- (19) Chase Briscoe, Toyota\n- (1) Ross Chastain, Chevrolet\n- (8) Kyle Busch, Chevrolet\n- (71) Michael McDowell, Chevrolet\n- (48) Alex Bowman, Chevrolet\n- (77) Carson Hocevar, Chevrolet\n- (20) Christopher Bell, Toyota\n- (24) William Byron, Chevrolet\n- (22) Joey Logano, Ford\n- (17) Chris Buescher, Ford\n- (2) Austin Cindric, Ford\n- (54) Ty Gibbs, Toyota\n- (23) Bubba Wallace, Toyota\n- (6) Brad Keselowski, Ford\n- (60) Ryan Preece, Ford\n- (16) AJ Allmendinger, Chevrolet\n- (99) Daniel Suarez, Chevrolet\n- (9) Chase Elliott, Chevrolet\n- (45) Tyler Reddick, Toyota\n- (11) Denny Hamlin, Toyota\n- (7) Justin Haley, Chevrolet\n- (21) Josh Berry, Ford\n- (3) Austin Dillon, Chevrolet\n- (5) Kyle Larson, Chevrolet\n- (34) Todd Gilliland, Ford\n- (35) Riley Herbst, Toyota\n- (43) Erik Jones, Toyota\n- (42) John Hunter Nemechek, Toyota\n- (41) Cole Custer, Ford\n- (10) Ty Dillon, Chevrolet\n- (38) Zane Smith, Ford\n- (47) Ricky Stenhouse Jr., Chevrolet\n- (4) Noah Gragson, Ford\n- (51) Cody Ware, Ford\n- (78) Katherine Legge, Chevrolet\n- (44) JJ Yeley, Chevrolet\n- (66) Josh Bilicki, Ford"
    }
  ],
  "argos_summary": "NASCAR driver Connor Zilisch, 19, suffered a broken collarbone after a fall while celebrating his Xfinity Series victory at Watkins Glen International on August 9. During his celebration, Zilisch's foot became caught in the window netting, causing him to fall hard onto the pavement. He was quickly attended to by medical personnel and later released from the hospital, expressing gratitude that his injuries were not more severe. Zilisch is considering surgery to expedite his recovery, aiming to return to racing soon.",
  "argos_id": "M426IEK5L"
}