{
  "url": "https://www.cnet.com/tech/mobile/i-finally-cleared-out-my-duplicate-iphone-photos-it-was-weirdly-therapeutic/",
  "authorsByline": "Sareena Dayaram",
  "articleId": "728d875fbbf949b79e2ac4017ec6c691",
  "source": {
    "domain": "cnet.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "San Francisco",
      "city": "San Francisco",
      "coordinates": {
        "lat": 37.7790262,
        "lon": -122.419906
      }
    }
  },
  "imageUrl": "https://www.cnet.com/a/img/resize/dab8ddbceb14efe9302ab0a4af619904cb43fbad/hub/2024/12/17/a16797d8-f5b5-4291-bc53-65c8d6fb09fa/your-phones-camera-is-about-to-become-much-more-important-3724-2.jpg?auto=webp&fit=crop&height=675&width=1200",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T22:00:03+00:00",
  "addDate": "2025-08-11T22:55:00.957580+00:00",
  "refreshDate": "2025-08-11T22:55:00.957581+00:00",
  "score": 1.0,
  "title": "I Finally Cleared Out My Duplicate iPhone Photos. It Was Weirdly Therapeutic",
  "description": "Your iPhone might be hoarding space-wasting duplicates. Here's how to find and delete them.",
  "content": "My iPhone Photos app slowly crept past the point of being fun to scroll. Trips, pet videos, burst shots and a mountain of screenshots kept chewing through storage until the \"iPhone storage almost full\" alert became routine. I wanted a win I could see right away without paying for another app or more iCloud space. It was like playing the free storage lottery.\n\nThe Photos app ended up being the fix I was searching for. On iOS 16 or newer, a Duplicates album gathers identical shots so you can merge or delete them in batches. I opened it out of curiosity and cleared dozens of lookalikes from the same vacation album. The storage bar moved. Backups felt faster. Browsing the camera roll stopped lagging.\n\nIf your iPhone is packed with copies of the same photo, start there. Open Photos, tap Albums, find Duplicates under Utilities, then merge or delete. Removing duplicate photos frees up space quickly and turns cleanup into a simple, focused task that also surfaces memories you forgot you saved.\n\nFor more, check out every new feature we're expecting Apple to drop with iOS 26 this fall.\n\nApple introduced its \"duplicate detection\" feature in 2022 and it works just as its name suggests. The tool uses on-device AI to identify identical images and aggregate them in an easy-to-find album in the Photos app. Apple says the iPhone classifies duplicates not only as exact copies but also as photos that appear to be the same but have unique resolutions, file formats or other slight differences. That includes lower-resolution versions you may have saved to share on social media or even bursts of near-identical shots taken at the same time.\n\nHere's how to use the iPhone's built-in tool to free up storage space:\n\n1. Open the Photos app on your iPhone.\n\n2. Scroll down to the Utilities section and tap Duplicates. This is where you can view all the duplicate photos on your iPhone and delete them, either individually or at once.\n\n3. If you want to delete all the duplicates at once, tap the Select button, and then tap Select All. You can also remove them in groups of two or more: Tap Select in the top right corner and then tap the Select button to the right of the pairs. Next, tap Merge [number] to merge all the duplicate photos your iPhone detects and send them to the trash.\n\n4. If you want to delete duplicates individually, tap the Merge button that appears next to each pair. Then tap Merge [number] Copies to delete duplicates. Go down the line and repeat this step for all the identical photos you want to delete.\n\nMerging keeps the best version of the photo in your library. The duplicates are moved to the Recently Deleted album.\n\nIf you found this iOS feature helpful, check out CNET's cheat sheet for iOS 18. For more advice on how to save space, read our full list of tips for clearing your iPhone's storage.",
  "medium": "Article",
  "links": [
    "https://www.cnet.com/tech/mobile/clear-your-iphone-storage-with-these-easy-tricks/",
    "https://www.cnet.com/tech/services-and-software/liquid-glass-new-photos-app-and-all-the-other-ios-26-features-coming-to-your-iphone/",
    "https://www.cnet.com/tech/mobile/best-iphone/",
    "https://www.cnet.com/tech/services-and-software/ios-18-updates-and-whats-on-the-horizon-for-your-iphone/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "duplicate photos",
      "weight": 0.0926444
    },
    {
      "name": "iPhone Photos",
      "weight": 0.09088505
    },
    {
      "name": "identical shots",
      "weight": 0.084967606
    },
    {
      "name": "storage space",
      "weight": 0.08456361
    },
    {
      "name": "iPhone",
      "weight": 0.08232987
    },
    {
      "name": "Photos",
      "weight": 0.082046874
    },
    {
      "name": "photos",
      "weight": 0.082046874
    },
    {
      "name": "more iCloud space",
      "weight": 0.074630305
    },
    {
      "name": "identical images",
      "weight": 0.07191384
    },
    {
      "name": "Duplicates",
      "weight": 0.0700943
    }
  ],
  "topics": [
    {
      "name": "iPhone"
    },
    {
      "name": "Electronics"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Technology News",
      "score": 0.71044921875
    },
    {
      "name": "/Computers & Electronics/Software/Operating Systems",
      "score": 0.68701171875
    },
    {
      "name": "/Internet & Telecom/Mobile & Wireless/Mobile Apps & Add-Ons",
      "score": 0.55126953125
    },
    {
      "name": "/Internet & Telecom/Mobile & Wireless/Mobile Phones",
      "score": 0.48583984375
    }
  ],
  "sentiment": {
    "positive": 0.15805098,
    "negative": 0.25743613,
    "neutral": 0.58451295
  },
  "summary": "Apple's iPhone Photos app, which uses its \"duplicate detection\" feature to identify identical images and place them in an easy-to-find album in the Photos app on iOS 16 or newer, a Duplicates album gathers identical photos and allows users to merge or delete them in batches. This method is effective in reducing storage usage and creating a clear, focused task that also reveals memories you forgot you saved. The tool can be used to delete duplicate photos individually or in groups of two or more, or individually, or to delete them. The process is done using the iPhone's built-in tool to free up storage space.",
  "shortSummary": "Apple's \"duplicate detection\" app helps quickly remove duplicate photos from iPhone storage, making browsing and browsing easier without additional storage space costs.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "43b1d86186f8437f87de34460c135b30",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.cnet.com/tech/services-and-software/ios-18-updates-and-whats-on-the-horizon-for-your-iphone/",
      "text": "Apple announced at its Worldwide Developers Conference in June that is it will release iOS 26 this fall. That update will bring a new Liquid Glass design, a new Games app and more to your iPhone. But before the tech giant releases iOS 26, here's everything you should know about iOS 18.\nApple released iOS 18 to the general public in 2024, a week after the company announced its new iPhone 16 lineup, Apple Watch Series 10 and more at its \"Glowtime\" event. Since then, Apple has released more updates that bring Apple Intelligence, such as Genmoji and Image Playground, to certain iPhones models, such as the iPhone 15 Pro, Pro Max and the iPhone 16 lineup -- including the iPhone 16E.\nRead more: What CNET's Experts Hope to See in iOS 19\nWe've put together this cheat sheet to help you explore and make the most of the latest features in iOS 18. Check back periodically to see what future iOS 18 updates could bring to your iPhone.\nWant a full breakdown of everything Apple announced last month, including the new iOS 26 and its eye-catching Liquid Glass design? Here's everything you missed at WWDC 2025.\niOS 18 updates\n- Don't Expect Much From iOS 18.6\n- Apple's iOS 18.5 Brings These Small Changes To Your iPhone\n- Download iOS 18.4.1 Now for These Important Security Fixes\n- Everything iOS 18.4 Brings to Your iPhone\n- iOS 18.3.2 Fixes This 'Sophisticated' Security Risk\n- Why You Should Download iOS 18.3.1 Right Now\n- Download iOS 18.3 for Updates to AI Notification Summaries and More\n- iOS 18.3 Brings These Security Updates to Your iPhone\n- What You Should Know About iOS 18.2.1\n- iOS 18.2 Brings Genmoji, Apple Intelligence and More to iPhones\n- How to Download the Latest Beta of iOS 18.2\n- iOS 18.1.1 Fixes These Security Issues on Your iPhone\n- iOS 18.1 Brings Apple intelligence and More to Some iPhones\n- What Issues iOS 18.0.1 Fixes On Your iPhone\nUsing iOS 18\n- Never Split AirPods Again With This Trick\n- What You Need to Know About Apple Intelligence Priority Notifications\n- Your iPhone Got These Emoji With iOS 18.4\n- Become a Master Chef at Home With iOS 18.4's Apple News Food\n- Play Sudoku Now on Your iPhone with iOS 18.2 and Apple News\n- How to Bring the Volume Bar Back to Your iPhone's Lock Screen\n- Control an iPhone Remotely With This FaceTime Feature\n- Here's How to Turn Enhanced Visual Search Off If You're Worried About Privacy\n- Don't Like Your iPhone's Default Apps? Here's How To Change Them\n- This iOS 18.2 Feature Could Help You Find Your Lost Luggage\n- Where to Find AI Summaries on Your iPhone\n- How to Create Custom Emoji With Genmoji in iOS 18.2\n- iOS 18.2: What to Know About Mail Categories and How to Get Rid of Them\n- Create Custom Illustrations With Image Playground in iOS 18.2\n- iOS 18.2 Integrates ChatGPT Into Siri. Here's What You Should Know\n- Your iPhone Can Now Record Calls With iOS 18.1\n- iOS 18.1: How To Proofread and Edit Messages With Apple Intelligence\n- 3 Apple Intelligence Features You'll Use Daily\n- iOS 18 Is Here and It Brings These Features to Your iPhone\n- 7 Settings to Change in iOS 18 After You Download the Update\n- All the Ways to Customize Your Home Screen\n- 7 New Messages Features to Try Now\n- 6 New Maps Features to Help You Find Your Way\n- Hidden Settings and Features in iOS 18\n- How to Fix These Two Annoying iOS 18 Settings\n- How to Make Sure RCS Messaging Is Enabled on Your iPhone\n- Schedule a Message to Send Later So You Don't Forget\n- How to Make Your Texts Bold and Shake With Excitement\n- Customize Your Lock Screen So You Don't Accidentally Turn Your Flashlight on Again\n- How to Make Your iPhone's Control Center Live Up to Its Name\n- What is T9 Dialing and How to Use It on iOS 18\n- Quickly and Easily Lock and Hide Apps on Your iPhone\n- How to Resize Widgets Right From Your Home Screen\n- How to Use Your Favorite Emoji to React to a Text\n- Find On Page in Safari Has a New Location. Here's Where It Is\n- Open App is Your Key to Customizing Your iPhone's Controls and Lock Screen\n- Organize Your Notes App With Collapsible Sections\n- Convert Distance, Currency and More In Calculator\n- Your Maps App Gets This Helpful New Feature in iOS 18\n- How to Mirror Your iPhone to Your Mac\n- Shoot Video and Play Music at the Same Time With This Feature\n- Enable This iOS 18 Setting if You Can't Hear a Movie or Show's Dialogue\n- Hide Banners and More in Safari With This Feature\n- Your Phone App Gets This Hidden Upgrade\n- How to Make Messages Do the Math for You\n- Create a Custom Hiking, Walking or Running Route in Maps\n- What iOS 18 Changes About Your Smart Home Security\n- Why Does Siri Look the Same in iOS 18?\n- How Genmoji Will Work When It's Released on iOS 18\nGetting started with iOS 18\n- My iOS 18 Review\n- See Whether Your iPhone Is Compatible With iOS 18\n- Don't Forget to Back Up Your iPhone Before Updating to iOS 18\n- How to Download iOS 18 to Your iPhone\nCheck back here later for more updates on iOS 18 and how to use the new features in the OS.\nYou can also check out our iPhone 16, 16 Pro and 16E reviews."
    },
    {
      "url": "https://www.cnet.com/tech/services-and-software/liquid-glass-new-photos-app-and-all-the-other-ios-26-features-coming-to-your-iphone/",
      "text": "While we still don't know what new hardware the iPhone 17 models might be packing, we have seen the big changes coming to iPhone software with iOS26. Liquid Glass delivers a significant design refresh, and that's just where Apple is starting. The Photos app is getting a functional redesign, while Messages and Phone apps are putting power back in your hands by delivering features around hold, and screening calls. Apple Intelligence is still contributing as well, even if Siri has been delayed.\nThe next version of the operating system is due to ship in September or October (likely with new iPhone 17 models), but developer betas are available now, with a public beta expected this month.\nTransparent new Liquid glass design\nAfter more than a decade of a flat, clean user interface -- an overhaul introduced in iOS 7 when former Apple Chief Design Officer Jony Ive took over the design of software as well as hardware -- the iPhone is getting a new look. The new design extends throughout the Apple product lineup, from iOS to WatchOS, TVOS and iPadOS.\nThe Liquid Glass interface also now enables a third way to view app icons on the iPhone home screen. Not content with Light and Dark modes, iOS 26 now features an All Clear look -- every icon is clear glass with no color. Lock screens can also have an enhanced 3D effect using spatial scenes, which use machine learning to give depth to your background photos.\nDynamic and adaptable lock screen\nTranslucency is the defining characteristic of Liquid Glass, behaving like glass in the real world in the way it deals with light and color of objects behind and near controls. But it's not just a glassy look: The \"liquid\" part of Liquid Glass refers to how controls can merge and adapt -- dynamically morphing, in Apple's words. In the example Apple showed, the glassy time numerals on an iPhone lock screen stretched to accommodate the image of a dog and even shrunk as the image shifted to accommodate incoming notifications. The dock and widgets are now rounded, glassy panels that float above the background.\nCamera and Photos apps go even more minimal\nThe Camera app is getting a new, simplified interface. You could argue that the current Camera app is pretty minimal, designed to make it quick to frame a shot and hit the big shutter button. But the moment you get into the periphery, it becomes a weird mix of hidden controls and unintuitive icons.\nNow, the Camera app in iOS 26 features a \"new, more intuitive design\" that takes minimalism to the extreme. The streamlined design shows just two modes: Video or Camera. Swipe left or right to choose additional modes, such as Pano or Cinematic. Swipe up for settings such as aspect ratio and timers, and tap for additional preferences.\nWith the updated Photos app, viewing the pictures you capture should be a better experience -- a welcome change that customers have clamored for since iOS 18's cluttered attempt. Instead of a long, difficult-to-discover scrolling interface, Photos regains a Liquid Glass menu at the bottom of the screen.\nThe Phone app gets a revamp\nThe Phone app has kept more closely to the look of its source than others: a sparse interface with large buttons as if you're holding an old-fashioned headset or pre-smartphone cellular phone. iOS 26 finally updates that look not just with the new overall interface but in a unified layout that takes advantage of the larger screen real estate on today's iPhone models.\nIt's not just looks that are different, though. The Phone app is trying to be more useful for dealing with actual calls -- the ones you want to take. The Call Screening feature automatically answers calls from unknown numbers, and your phone rings only when the caller shares their name and reason for calling.\nOr what about all the time wasted on hold? Hold Assist automatically detects hold music and can mute the music but keep the call connected. Once a live agent becomes available, the phone rings and lets the agent know you'll be available shortly.\nMessages updates\nThe Messages app is probably one of the most used apps on the iPhone, and for iOS 26, Apple is making it a more colorful experience. You can add backgrounds to the chat window, including dynamic backgrounds that show off the new Liquid Glass interface.\nIn addition to the new look, group texts in Messages can incorporate polls for everyone in the group to reply to -- no more scrolling back to find out which restaurant Brett suggested for lunch that you missed. Other members in the chat can also add their own items to a poll.\nA more useful feature is a feature to detect spam texts better and screen unknown numbers, so the messages you see in the app are the ones you want to see and not the ones that distract you.\nSafari gets out of its own way\nIn the Safari app, the Liquid Glass design floats the tab bar above the web page (although that looks right where your thumb is going to be, so it will be interesting to see if you can move the bar to the top of the screen). As you scroll, the tab bar shrinks.\nFaceTime focuses on calls, not controls\nFaceTime also gets the minimal look, with controls in the lower-right corner that disappear during the call to get out of the way. On the FaceTime landing page, posters of your contacts, including video clips of previous calls, are designed to make the app more appealing.\nNew Music app features\nDo you like the sound of that song your friend is playing but don't understand the language the lyrics are in? The Music app includes a new lyrics translation feature that displays along with the lyrics as the song plays. And for when you want to sing along with one of her favorite K-pop songs, for example, but you don't speak or read Korean, a lyrics pronunciation feature spells out the right way to form the sounds.\nAutoMix blends songs like a DJ, matching the beat and time-stretching for a seamless transition.\nAnd if you find yourself obsessively listening to artists and albums again and again, you can pin them to the top of your music library for quick access.\nNew Games app is a reminder that yes, people game on iPhone\nThe iPhone doesn't get the same kind of gaming affection as Nintendo's Switch or Valve's Steam Deck, but the truth is that the iPhone and Android phones are used extensively for gaming -- Apple says half a billion people play games on iPhone.\nTrying to capitalize on that, a new Games app acts as a specific portal to Apple Arcade and other games. Yes, you can get to those from the App Store app, but the Games app is designed to remove a layer of friction so you can get right to the gaming action.\nLive translation enhances calls and texts\nAlthough not specific to iOS, Apple's new live translation feature is ideal on the iPhone when you're communicating with others. It uses Apple Intelligence to dynamically enable you to talk to someone who speaks a different language in near-real time. It's available in the Messages, FaceTime and Phone apps and shows live translated captions during a conversation.\nMaps gets more personal\nUpdates to the Maps app sometimes involve adding more detail to popular areas or restructuring the way you store locations. Now, the app takes note of routes you travel frequently and can alert you of any delays before you get on the road.\nIt also includes a welcome feature for those of us who get our favorite restaurants mixed up: visited places. The app notes how many times you've been to a place, be that a local business, eatery or tourist destination. It organizes them in categories or other criteria such as by city to make them easier to find the next time.\nNew CarPlay features\nLiquid Glass also makes its way to CarPlay in your vehicle, with a more compact design when a call comes in that doesn't obscure other items, such as a directional map. In Messages, you can apply tapbacks and pin conversations for easy access.\nWidgets are now part of the CarPlay experience, so you can focus on just the data you want, like the current weather conditions. And Live Activities appear on the CarPlay screen, so you'll know when that coffee you ordered will be done or when a friend's flight is about to arrive.\nWallet improvements\nThe Wallet app is already home for using Apple Card, Apple Pay, electronic car keys and for storing tickets and passes. In iOS 26, you can create a new Digital ID that acts like a passport for age and identity verification (though it does not replace a physical passport) for domestic travel for TSA screening at airports.\nThe app can also let you use rewards and set up installment payments when you purchase items in a store, not just for online orders. And with the help of Apple Intelligence, the Wallet app can help you track product orders, even if you did not use Apple Pay to purchase them. It can pull details such as shipping numbers from emails and texts so that information is all in one place.\nNew features powered by Apple Intelligence\nAlthough last year's WWDC featured Apple Intelligence features heavily, improvements to the AI tech were less prominent this year, folded into the announcements during the WWDC keynote.\nAs an alternative to creating Genmoji from scratch, you can combine existing emojis -- \"like a sloth and a light bulb when you're the last one in the group chat to get the joke,\" to use Apple's example. You can also change expressions in Genmoji of people you know that you've used to create the image.\nImage Playground adds the ability to tap into ChatGPT's image generation tools to go beyond the app's animation or sketch styles.\nVisual Intelligence can already use the camera to try to decipher what's in front of the lens. Now the technology works on the content on the iPhone's screen, too. It does this by taking a screenshot (press the sleep and volume up buttons) and then including a new Image Search option in that interface to find results across the web or in other apps such as Etsy.\nThis is also a way to add event details from images you come across, like posters for concerts or large gatherings. (Perhaps this could work for QR codes as well?) In the screenshot interface, Visual Intelligence can parse the text and create an event in the Calendar app.\nSome iOS 26 updates Apple didn't mention\nNot everything fits into a keynote presentation -- even, or maybe especially, when it's all pre-recorded -- but some of the more interesting new features in iOS 26 went unremarked during the big reveal. For instance:\n- If you have AirPods or AirPods Pro with the H2 chip, you can use AirPods Camera Remote to start recording video on your iPhone by pressing and holding one of the AirPods.\n- You can choose your own snooze duration of between 1 and 15 minutes for alarms.\n- Audio recording options have expanded, enabling high-quality recording during conference calls and high-definition recording in the Camera app with AirPods and AirPods Pro that contain the H2 chip.\n- Accessibility features include an \"all-new experience designed with Braille users in mind,\" more options for the Vehicle Motion Cues feature to avoid motion sickness and \"a more customizable reading experience.\"\n- Reminders uses Apple Intelligence to \"suggest tasks, grocery items and follow-ups based on emails or other text on your device.\"\n- The Journal app supports multiple journals, inline images and a map view that tracks where journal entries were made.\n- Parental controls have been updated in unspecified ways, including \"enhancements across Communication Limits, Communication Safety and the App Store.\"\niOS 26 availability\nThe finished version of iOS 26 will be released in September or October with new iPhone 17 models. In the meantime, developers can install the first developer betas now, with an initial public beta arriving this month. (Don't forget to go into any beta software with open eyes and clear expectations.)\nFollow the WWDC 2025 live blog for details about Apple's other announcements.\niPhone models compatible with iOS 26\niOS 26 will run on the iPhone 11 and later models, including the iPhone SE (2nd generation and later). That includes:\n- iPhone 16e\n- iPhone 16\n- iPhone 16 Plus\n- iPhone 16 Pro\n- iPhone 16 Pro Max\n- iPhone 15\n- iPhone 15 Plus\n- iPhone 15 Pro\n- iPhone 15 Pro Max\n- iPhone 14\n- iPhone 14 Plus\n- iPhone 14 Pro\n- iPhone 14 Pro Max\n- iPhone 13\n- iPhone 13 mini\n- iPhone 13 Pro\n- iPhone 13 Pro Max\n- iPhone 12\n- iPhone 12 mini\n- iPhone 12 Pro\n- iPhone 12 Pro Max\n- iPhone 11\n- iPhone 11 Pro\n- iPhone 11 Pro Max\n- iPhone SE (2nd generation and later)"
    },
    {
      "url": "https://www.cnet.com/tech/mobile/best-iphone/",
      "text": "There are five models in Apple's current iPhone 16 lineup, and we tested and reviewed them all. Each has a different appeal, depending on your needs and budget. The $829 iPhone 16 gets you new buttons for shortcuts, an additional camera and MagSafe. Then there's the $999 iPhone 16 Pro, which has a new camera and a bigger screen. The $599 iPhone 16E is the most affordable. It has the same chip as the iPhone 16, along with a single rear camera, but it lacks Apple's most notable features, like MagSafe charging. Please note that we expect the iPhone 17 series to be revealed in September. So it might be best to hold off on buying any new iPhone until then.\nOur Picks\nMOBILE DEALS OF THE WEEK\n- $449 (save $50)\n- $550 (save $50)\n- $300 (save $100)\nWhat's the best iPhone right now?\nThe best iPhone for most people is the $799 iPhone 16. We think the iPhone 16 and 16 Plus are ideal for most people looking for a great phone that will last for years. It comes in two sizes: a 6.1-inch regular iPhone 16 model or a larger, 6.7-inch iPhone 16 Plus model that starts at $899. The phones have a new 12-megapixel ultrawide camera that performs better in low light and can now take macro photos, meaning you'll be able to focus close to take amazing food snaps.\nThe iPhone 16 and 16 Plus have a handful of Apple Intelligence tools for writing, removing distractions from photos and creating summaries of messages and web pages. There's also ChatGPT integration with Siri. The phones have an Action button, too, which can be programmed for different functions like turning on the flashlight, recording a voice memo, changing the focus mode and more. There's also a new Camera Control button that not only lets you take photos and quickly change things like zoom, Portrait mode aperture and Photographic Styles, but can also trigger a new feature called Visual Intelligence, which will add context to whatever the camera is pointed at.\nBest iPhones of 2025\nPros\n- Camera Control is useful for switching camera settings\n- Photographic Styles makes photos pop\n- Ultrawide camera is better in low light\nCons\n- Apple Intelligence isn’t out yet\n- No always on display\n- No changes to wired charging speeds\n- No upgrades to the Action button\nWhen I tested the iPhone 16 and 16 Plus I was definitely impressed by the new photography features, the convenient Action button and the elegant build. I consider these phones to be top-notch choices for Apple fans. Parts of the iPhone 16’s key feature, Apple Intelligence, are now out, and the fact that these phones will support it means they’ll likely feel future-proofed for years to come. Aside from screen size (6.1 inches on the regular, 6.7 inches on the Plus), battery size and price, the iPhone 16 and 16 Plus are identical in every way.\nThe iPhone 16 isn’t perfect -- it’s missing an always-on display, and it feels like it’s been ages since Apple improved its wired charging speeds. But it checks all the important boxes and then some.\nWhy we like it\nThe iPhone 16 and 16 Plus rank so high in our testing because the phones appeal to both novice users and power players a like. They offer about 90% of the experience of Apple's Pro models but cost hundreds of dollars less. Not only is the iPhone 16 a wonderful phone out of the box, Apple has a long track record of updating its software and security patches for years.\nWho it's best for\nWhen you think about how the Camera Control key, the Action button and the Dynamic Island come together, along with the camera and battery improvements Apple has made over the last several years, the iPhone 16 is a compelling upgrade for someone coming from an older iPhone, especially if that person is on an iPhone 13 or older. For those who don’t need the Pro’s extra photography prowess and battery life, the iPhone 16 won’t disappoint.\nWho shouldn’t get it\nI wouldn't recommend buying the iPhone 16 just for the Camera Control button or the better ultrawide camera.\nPros\n- Larger screens/thinner bezels\n- 4K slo-mo OMG\n- Audio Mix is brilliant\n- iOS 18\nCons\n- No Apple Intelligence out of the box\n- Camera Control placement not optimal for one-handed shooting\n- Elegant finishes aren't very colorful\n- Only 128GB of storage for $1,000\nThe iPhone 16 Pro and 16 Pro Max have everything I've come to expect in a year-over-year upgrade. The 6.3-inch iPhone 16 Pro and 6.9-inch iPhone 16 Pro Max have a slew of upgrades including one of the best batteries on any phone I've tested as well as. In our testing it will easily last a day on a single charge.\nThe phones also have larger displays, outstanding photo and video chops, high-resolution slo-mo, a new Camera Control button, iOS 18 goodies and a handful of Apple Intelligence tools. The negatives are as thin as the borders around the new screens: You only get 128GB of storage for $1,000; there are only drab color options, and a the new camera button is easy to tap accidentally. Read our full iPhone 16 Pro and 16 Pro Max review.\nWhy we like it\nThis year the 16 Pro and 16 Pro Max have the exact same cameras -- unlike the 15 Pro and 15 Pro Max, which had different telephoto options. Screen size, battery life and price should be the deciding factors when you're choosing between the two. The iPhone 16 Pro and Pro Max are excellent phones worthy of a spot in your pocket (and mine) if you can afford them.\nWho it's best for\nIf you have an iPhone 12 Pro or older, upgrading to the 16 Pro makes a lot of sense. If you're on a 13 Pro and still have a decent battery capacity, I'd say save your money. And if you're on a 14 Pro or 15 Pro, there's no need to upgrade. Also, I should note that the entry-level $999 iPhone 16 Pro only has 128GB of storage.\nWho shouldn't get it\nIf you are looking for a budget phone or don't need a phone with the latest features or tech.\nPros\n- Does most of the Apple stuff I want\n- Battery life is great\n- Matte finish back\n- The rear camera is good\n- A18 chip performance\nCons\n- $599 price isn't cheap\n- Odd value proposition\n- Lacks MagSafe\n- Screen is good, but wonder how it will age\nApple took a Taco Bell-like approach with the $599 iPhone 16E, mixing and matching parts and features from prior phones to create a \"new\" iPhone. Its design and screen are similar to the iPhone 14. Its A18 processor is the same as the one in the iPhone 16. In my testing, I found that this gives the iPhone 16E a weird value proposition. It's new, but it's old. It's affordable, but not cheap.\nIf you're rocking an iPhone SE, an iPhone 11 or older, the 16E will be a nice upgrade in every way, from the camera to the battery life -- though you might miss that ultrawide camera. I also think that this is a good phone for people using Android phones who want to switch and dip the proverbial toe into Apple's waters. I do recommend looking into carrier deals, discounts and trade-ins to drop that price a bit, unless you're set on doing an installment plan over a couple of years. Read our iPhone 16E review.\nWhy we like it\nAfter testing the iPhone 16E, I was most surprised by how wonderfully uneventful it was to use. Along with all the standard iOS 18 functions and goodies, like iMessage and FaceTime, I used Apple Intelligence, made calls on 5G, took a bunch of share-worthy photos and videos and played video games like Resident Evil 4. If this is all you want in an iPhone, look no further.\nWho it's best for\nIf you're rocking an iPhone SE, an iPhone 11 or older, the 16E will be a nice upgrade in every way, from the camera to the day plus battery life -- though you might miss that ultrawide camera. I also think that this is a good phone for people using Android phones who want to switch and dip the proverbial toe into Apple's waters.\nWho shouldn't get it\nChoosing between the $829 iPhone 16 and the $599 16E is a tough choice. If you have the budget, I'd go with the regular 16. You get a brighter screen, MagSafe, and an ultrawide camera that doubles as a macro lens -- great for taking close-up photos like of food since the main camera automatically switches to a cropped version of the ultrawide in order to nail focus.\nPros\n- USB-C port is more convenient charging\n- Colorful matte design\n- Improved camera that can automatically take people and pet portraits\n- Dynamic Island brings better multitasking\nCons\n- No always-on display\n- Find My Friends feature only works with other iPhone 15 phones\n- Discounted iPhone 14 Pro may be a better value\n- Galaxy S24 offers a longer optical zoom\nWith the launch of the iPhone 16, the regular iPhone 15 is being sold at a discount -- $100 off. That means that the iPhone 15 now starts at $699. And you might be able to find steeper discounts throughout the coming weeks and months. With the Dynamic Island, a USB-C port for more convenient charging and a high resolution camera and a sharper digital zoom, I found the iPhone 15 to be a significant upgrade for those with older iPhones.\nThe iPhone 15 is available in two size options: the 6.1-inch iPhone 15 and the 6.7-inch iPhone 15 Plus. They run on the same chip as iPhone 14 Pro, the A16 Bionic, which should bring notable performance upgrades to those with an iPhone that's several years old. These phones also have Apple's second-generation ultra wideband chip, enabling a new feature that makes it easier to find friends or family members in a crowd which I found handy. Read our full iPhone 15 review.\nWhy we like it\nThe iPhone 15 and 15 Plus are heavily influenced by the iPhone 14 Pro. That includes the Dynamic Island, a dedicated area near the top of the screen for viewing time-sensitive data like your Uber's ETA, and the A16 Bionic processor. Overall, these changes come together to make the iPhone 15 feel like a big step forward for those upgrading from an aging iPhone.\nWho it's best for\nThe iPhone 15 is for someone coming from an iPhone 12 or older. In 2025, Apple sells it for $699. But I recommend looking for one that's discounted. If you're contemplating the iPhone 16E but really want an ultrawide camera (remember the 16E only has a single rear camera) and MagSafe charging, then grab an iPhone 15.\nWho shouldn't get it\nApple sells the $599 iPhone 16E which makes the iPhone 15 a curious value. If you can score a discounted iPhone 15 I'd go that way. But otherwise, the iPhone 16E might be a better buy.\nThe iPhone 16 is the recipient of a CNET Editors' Choice award, and you can get one for free when you switch to T-Mobile. You just need to sign up for a qualified Experience Beyond Plan with up to four lines. There's no trade-in required, and T-Mobile will pay off your current eligible phone, up to $800, via a prepaid Mastercard. It’s never been easier to switch. (New line and port-in are required, and a $10 device activation charge applies.)\nBest iPhone models compared\n| Product | Apple iPhone 16 | Apple iPhone 16 Plus | Apple iPhone 16E | Apple iPhone 16 Pro | Apple iPhone 16 Pro Max | Apple iPhone 15 |\n|---|---|---|---|---|---|---|\n| Display size, tech, resolution, refresh rate | 6.1-inch OLED; 2,556 x 1,179 pixel resolution; 60Hz refresh rate | 6.7-inch OLED; 2,796 x 1,290 pixel resolution; 60Hz refresh rate | 6.1-inch OLED display; 2,532x1,170 pixels; 60Hz refresh rate | 6.3-inch OLED; 2,622 x 1,206 pixel resolution; 1-120Hz adapative refresh rate | 6.9-inch OLED; 2,868 x 1,320 pixel resolution; 1-120Hz adapative refresh rate | 6.1-inch OLED; 2,556x1,179 pixels; 60Hz refresh rate |\n| Pixel density | 460 ppi | 460 ppi | 460 ppi | 460 ppi | 460 ppi | 460 ppi |\n| Dimensions (inches) | 5.81 x 2.82 x 0.31 inches | 6.33 x 3.06 x 0.31 inches | 5.78 x 2.82 x 0.31 in. | 5.89 x 2.81 x 0.32 inches | 6.42 x 3.06 x 0.32 inches | 2.82x5.81x0.31 inches |\n| Dimensions (millimeters) | 147.6 x 71.6 x 7.8mm | 160.9 x 77.8 x 7.8mm | 146.7 x 71.5 x 7.8 mm | 149.6 x 71.5 x 8.25mm | 163 x 77.6 x 8.25mm | 71.6x147.6x7.8 mm |\n| Weight (grams, ounces) | 170 g (6 oz.) | 199 g (7.03 oz.) | 167g (5.88 oz.) | 199 g (7.03 oz.) | 227 g, (7.99 oz.) | 171g (6.02 oz.) |\n| Mobile software | iOS 18 | iOS 18 | iOS 18 | iOS 18 | iOS 18 | iOS 17 |\n| Camera | 48-megapixel (wide), 12-megapixel (ultrawide) | 48-megapixel (wide), 12-megapixel (ultrawide) | 48-megapixel (wide) | 48-megapixel (wide), 48-megapixel (ultrawide) 5x telephoto | 48-megapixel (wide), 48-megapixel (ultrawide) 5x telephoto | 48-megapixel (wide), 12-megapixel (ultrawide) |\n| Front-facing camera | 12-megapixel | 12-megapixel | 12-megapixel | 12-megapixel | 12-megapixel | 12-megapixel |\n| Video capture | 4K | 4K | 4K | 4K | 4K | 4K |\n| Processor | Apple A18 | Apple A18 | Apple A18 | Apple A18 Pro | Apple A18 Pro | Apple A16 Bionic |\n| RAM + storage | RAM N/A + 128GB, 256GB, 512GB | RAM N/A + 128GB, 256GB, 512GB | RAM unknown + 128GB, 256GB, 512GB | RAM N/A + 128GB, 256GB, 512GB, 1TB | RAM N/A + 256GB, 512GB, 1TB | RAM N/A + 128GB, 256GB, 512GB |\n| Expandable storage | None (Face ID) | None (Face ID) | None | None (Face ID) | None (Face ID) | None (Face ID) |\n| Battery | Up to 22 hours video playback; up to 18 hours video playback (streamed). 20W wired charging. MagSafe wireless charging up to 25W with 30W adapter or higher; Qi2 up to 15W | Up to 27 hours video playback; up to 24 hours video playback (streamed). 20W wired charging. MagSafe wireless charging up to 25W with 30W adapter or higher; Qi2 up to 15W | Up to 26 hours video playback, 21 hours streamed video playback, 90 hours of audio playback. 20W wired charging, 7.5W Qi wireless charging | Up to 27 hours video playback; up to 22 hours video playback (streamed). 20W wired charging. MagSafe wireless charging up to 25W with 30W adapter or higher; Qi2 up to 15W | Up to 33 hours video playback; up to 29 hours video playback (streamed). 20W wired charging. MagSafe wireless charging up to 25W with 30W adapter or higher; Qi2 up to 15W | Undisclosed; Apple claims up to 20 hours of video playback (16 hours streamed) |\n| Fingerprint sensor | None (Face ID) | None (Face ID) | None, Face ID | None (Face ID) | None (Face ID) | Face ID |\n| Connector | USB-C | USB-C | USB-C | USB-C | USB-C | USB-C |\n| Headphone jack | None | None | None | None | None | None |\n| US starting price | $799 (128GB) | $899 (128GB) | $599 (128GB) | $999 (128GB) | $1,199 (256GB) | $799 (128GB) |\n| UK starting price | £799 (128GB) | £899 (128GB) | £599 (128GB) | £999 (128GB) | £1,199 (256GB) | £799 (128GB) |\n| Australia starting price | AU$1,399 (128GB) | AU$1,599 (128GB) | AU$999 (128GB) | AU$1,799 (128GB) | AU$2,149 (256GB) | AU$1,499 (128GB) |\nRecent updates\nIn March 2025, we added the iPhone 16E to this list. The $599 price is more than Apple's previous cheap phone, the $429 iPhone SE, but it has a similar appeal especially for those currently on an older iPhone.\nFactors to consider when buying a new iPhone\nHold the iPhone first: You may love or hate the way it looks and feels in person.\nDon't discount the last year's model: Apple has a history of keeping recent iPhone models from previous years around at a lower price. You can get a great phone that does almost everything that a new iPhone 16 can do for a fraction of the price. The iPhone 15 packs a great camera and a big battery, but comes at a more reasonable price.\nBuy an iPhone case and screen protector: You'll protect your iPhone from costly damage, and will increase the phone's resale or trade-in value for when you're ready to move on.\nKnow what you care about most: Is it screen size? Camera quality? Battery life? Phones like the iPhone 15 Pro or Pro Max, for example, pack incredible cameras that almost rival the quality you'd get from a DSLR. If you're a photographer, then spending money here is a good idea.\nSeek out holiday discounts: Look for deep discounts and promo deals around major holidays, especially Amazon's Prime Day and Cyber Monday. And find out what your grace period is in case you need a quick return or exchange.\nHow we test iPhone models\nWe test every iPhone in real-world scenarios focusing on its features, design, performance, cameras, battery life and overall value. We document our findings in an initial review that is periodically updated when there are new iOS updates or to compare against new phones from competitors like Samsung, Google and OnePlus.\nPhotography\nPhotography is a major focus for the iPhone, so we take pictures and videos of various subjects in a variety of settings and lighting scenarios. We try out any new camera modes, such as 4K 120fps slow-mo video that debuted with the iPhone 16 Pro and 16 Pro Max.\nBattery life\nBattery testing is conducted in a variety of ways. We assess how long the iPhone lasts during a typical day of use, and note how it performs during more focused sessions of video calls, media streaming and gaming. We also conduct a video playback test and a 45-minute drain test starting with a full battery, which isn't always included in the initial review and added later in an update.\nPerformance measuring\nWe use benchmarking apps to measure the performance, alongside our own anecdotal experiences using the phone for our review. Of particular note are how graphics and animations look. Are they smooth? Or do they lag or stutter? We also look at how quickly the phone switches between horizontal and vertical orientations and how fast the camera app opens and is ready to take a photo.\nWe perform processor-heavy tasks like editing photos and videos, exporting videos and playing games. We evaluate whether a newer version of the iPhone includes enough features to make it worth upgrading from older models. Some of these tests are added later in updates after the initial review is published.\nRead more: How CNET Tests Phones\nOther iPhones we tested\nWhile Apple doesn't sell the iPhone 15 Pro, you can still find it at carriers and third-party retailers. The 15 Pro has a 6.1-inch adaptive-refresh rate screen that adjusts between 1-120Hz depending on what's on the screen. It has excellent cameras, a fast processor, an always-on display, supports iOS 18 and safety features like Crash Detection and Emergency SOS via Satellite. Driving all these upgrades is Apple's A17 Pro chip which in use feels peppy. The iPhone 15 Pro is still an excellent phone in 2025. Check out our iPhone 15 Pro review.\nKey terms\neSIM\nAn eSIM takes all of the important information about your phone account -- including its number, wireless carrier and subscription -- and stores it in software instead of on a physical SIM card.\nWith the iPhone 14, 15 and 16 series Apple removed the physical SIM card tray and embraced embedded SIM cards in the US. This means you can't just pluck your SIM card out of your current phone and put it into a new one. But this shouldn't affect your experience since all the major US carriers and a number of smaller operators work with eSIM.\nApple has long supported eSIM, dating back to 2018's iPhone XS, XS Max and XR. When setting up a new iPhone 14, 15 or 16, tthe device will guide you through transferring your current provider over to the new phone. A list of supported wireless networks can be found on Apple's website.\niOS 18\nApple's iOS 18 is the latest iPhone software version. It's on the iPhone 16 by default and is also available as an update for the iPhone XR and later. iOS 18 includes new features such as being able to move apps anywhere on your home screen, change an app icon's color and a size, add buttons to Control Center, use emoji and live photo stickers as Tapbacks in Messages, support for RCS in messages and eventually Apple Intelligence on some models.\niPhone FAQs\nWhen is the best time of year to buy a new iPhone?\niPhone or Android?\nShould I wait for the new iPhone model (iPhone 17)?\nHow reliable is an iPhone?\nHow long does an iPhone last?\nWhat to look forward to in 2025\nThere's already been plenty of buzz about what we could see with the next iPhone, likely called the iPhone 17 -- from a slimmer version of the upcoming device to a new screen with a higher refresh rate on baseline models. The camera module could also get a makeover, and reports suggest Apple will overhaul the look and feel of its software with the launch of iOS 19. Apple doesn't release details on future products, but to get an idea of what to expect, we rounded up rumors, leaks and analysis on the iPhone 17 Air (one of several nicknames for Apple's next iPhone). Read CNET's iPhone 17 rumor roundup for more info."
    },
    {
      "url": "https://www.cnet.com/tech/mobile/clear-your-iphone-storage-with-these-easy-tricks/",
      "text": "If you're anything like me, you have a decade's worth of memories stored on your iPhone. All of those photos, videos and texts, along with your entire app library, can take up a lot of space. Thankfully, there are a few ways to maximize your iPhone's storage capacity, from offloading apps to transporting essential items to the cloud.\nThe best way to save local storage is to invest in a cloud storage service like Apple's iCloud, Google Drive, Box or Dropbox to offload some of your files. But there are also certain settings you can change to make sure you're using your iPhone's storage capacity to its fullest. With last year's iOS 16 update, your iPhone also gained the ability to detect duplicate photos, making it easier to keep your image library lean and organized.\nSee below to learn more about how to free up storage space on your iPhone.\nFirst, see what's taking up the most space on your iPhone\nTo maximize your iPhone's storage, you need to know what's occupying your device in the first place. Take a look at what's eating up your storage so that you know where to get started. Launch Settings, tap General and scroll down to iPhone Storage. Choose this option to see a breakdown of the types of files and media that are taking up space on your iPhone. Apple might also make some recommendations about how to free up space, such as reviewing videos stored on your device as shown below.\nMake sure your iPhone is optimizing photo storage\nPhotos are among the biggest offenders when it comes to gobbling up space on your iPhone, but the iPhone's settings menu has an option that enables your device to save smaller photo files locally if your device is low on space, instead of the original versions. These full-resolution photos and videos are stored in iCloud, and you can download them as needed. To make sure this feature is turned on, start by opening the Settings app. Then scroll down to Photos and make sure there's a blue checkmark next to the Optimize iPhone Storage option.\nSave photos and videos to a cloud service instead of on your device\nThe best way to free up space on your iPhone is to remove files you don't need to store on your device, but that doesn't mean you have to downsize your photo library. Instead, try storing them in a third-party cloud storage service like Google Photos rather than on your device. It's a quick way to free up a lot of storage without requiring you to part with old memories.\nBefore you delete anything, make sure the photos you want to save have been backed up or transferred to Google Photos. If your photos and videos are not backed up to another service like Google Photos, Dropbox, Box or OneDrive before being deleted, they'll be permanently erased. This guide walks you through how to copy over your entire iCloud photo library to Google Photos, but note that the unlimited free storage option is no longer available.\nYou might wonder why you need to use a separate cloud service if your photos are already stored in iCloud; deleting your photos from your iPhone erases them from iCloud as well, so you'll want to use another service if you plan to delete images from your device.\nMore from the Apple event\nDelete apps you no longer use\nAnother great way to clear out your iPhone is to get rid of apps you no longer use. If you don't know where to start, take a look at which apps you haven't used in a long time. Open your iPhone's Settings menu, tap General and go to iPhone Storage. You'll see a list of your apps along with how much space each app occupies and the last time you used it. Scroll through the list and try deleting apps that you haven't used in a long time.\nOffload apps you don't use all the time\nIf you don't want to completely delete an app, you can offload it instead. Offloading it lets you retain the documents and data associated with that app so that you can reinstall it anytime and quickly pick up right where you left off. Navigate back to the list mentioned above by opening Settings, pressing General and choosing iPhone Storage. Tap any app in the list and select Offload App. You can also set your iPhone to do this automatically by opening Settings, tapping the App Store option and making sure the Offload Unused Apps switch is toggled on.\nAutomatically delete old messages\nIt's not just iPhone photos, videos and apps that may be clogging your device's storage; getting rid of old text messages can be helpful as well. You can set your iPhone to automatically delete your message history by opening Settings, choosing Messages and tapping the Keep Messages option under Message History. From there, select if you'd like your iPhone to retain text messages for 30 days, one year or forever.\nDelete videos and music from apps\nYou probably have videos and music stored offline in multiple apps on your phone, and fortunately, there's an easy way to find those files and delete them. Launch Settings, choose General and select iPhone Storage. Search for an app that you've downloaded offline content from, such as Netflix. You'll then see storage information about the app, such as its size and buttons for deleting or offloading it.\nIf you've downloaded offline videos, you'll also see a section for this content underneath the Delete App button. Place your finger on a downloaded video and swipe it all the way over to the left side of the screen to delete it.\nClear out your web browser cache\nYou can always try cleaning out your web browser cache if you're really scrounging for space, although deleting apps and media will make a much bigger difference. But doing so could give your iPhone a bit of a speed boost when web browsing, so it's worth trying if you're low on storage and are experiencing sluggish browser performance. But just remember that it will sign you out of websites you've logged into.\nOpen Settings, choose Safari and tap Clear History and Website Data.\nIf you use Google Chrome, tap the three dots at the bottom of the screen, choose History and tap Clear Browsing Data. You should see a checkmark next to three categories: Browsing History, Cookies, Site Data and Cached Images and Files. If you want to only delete browsing data for a certain time period, tap the Time Range option near the top of the screen before hitting Clear Browsing Data at the bottom.\nLooking for more iPhone advice? Check out our favorite iOS 17 features and our iPhone 15 upgrade guide."
    }
  ],
  "argos_summary": "The article discusses how to effectively manage storage on an iPhone, particularly through the use of the built-in Duplicates album feature introduced in iOS 16. This feature allows users to easily identify and merge or delete duplicate photos, freeing up space and improving the performance of the Photos app. Additionally, it highlights other tips for maximizing storage, such as utilizing cloud services, offloading unused apps, and managing message history.",
  "argos_id": "M86CB0AWP"
}