{
  "url": "https://finance.yahoo.com/news/optimove-reports-reveal-80-us-210700821.html",
  "authorsByline": "Optimove",
  "articleId": "1a2abf1e2fb14acf88eb7af7464d5ad1",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://s.yimg.com/ny/api/res/1.2/orKi8m00Ia.dHyNzwXxrSQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03NDE7Y2Y9d2VicA--/https://media.zenfs.com/en/globenewswire.com/c1de9e2c07d56d03388c6454ebba3aab",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T21:07:00+00:00",
  "addDate": "2025-08-11T22:00:32.822182+00:00",
  "refreshDate": "2025-08-11T22:00:32.822183+00:00",
  "score": 1.0,
  "title": "Optimove Reports Reveal 80%+ of US Consumers Have Anxiety Over Tariffs Across 2025 Shopping Seasons",
  "description": "Optimove Insights survey of 1,066 consumers also reveals widespread concerns about inflation, highlighting the need for empathetic and responsive marketing strategies Tariffs concern consumers Over 80% of U.S. shoppers say tariffs are a concern, according to a new Optimove Insights survey of 1,000+ consumers New York, Aug. 11, 2025 (GLOBE NEWSWIRE) -- Optimove Insights, the research and analysis arm of Optimove, today released new findings showing that American consumers are increasingly concern",
  "content": "Optimove Insights survey of 1,066 consumers also reveals widespread concerns about inflation, highlighting the need for empathetic and responsive marketing strategies\n\nNew York, Aug. 11, 2025 (GLOBE NEWSWIRE) -- Optimove Insights, the research and analysis arm of Optimove, today released new findings showing that American consumers are increasingly concerned about the impact of tariffs on their spending power. Data from Optimove Insights' surveys of 1,066 US consumers aged 18–65 with household incomes over $75,000 on summer, back-to-school, and pre-holiday shopping periods revealed a consistent theme: more than 81.4% of shoppers are worried about tariffs, and 80.5% are concerned about inflation.\n\nOptimove, the creator of Positionless Marketing, frees marketing teams from the limitations of fixed roles, giving every marketer the power to execute any marketing task instantly and independently. Its platform is used by leading global B2C brands.\n\n“These findings are a wake-up call for marketers,” said Pini Yakuel, CEO of Optimove. “Now more than ever, consumers feel economic pressures. Marketers need agility and empathy to respond in real time. Brands must acknowledge financial anxiety through supportive, empathetic messaging.”\n\nSurvey results also revealed that while consumers are anxious, many remain willing to spend if presented with value and trust-driven engagement. Irrelevant messaging leads to fatigue and missed opportunities.\n\nYakuel added, “Brands that cannot listen to consumers’ needs and wants and respond in real time will appear tone-deaf. Positionless Marketing helps eliminate these inefficiencies by enabling smarter, more personalized engagement at scale.”\n\nOptimove, the creator of Positionless Marketing, frees marketing teams from the limitations of fixed roles, giving every marketer the power to execute any marketing task instantly and independently. Positionless Marketing has been proven to improve campaign efficiency by 88%, allowing marketing teams to create more personalized engagement with existing customers.\n\nOptimove is recognized as the Visionary Leader in Gartner’s Magic Quadrant for Multichannel Marketing Hubs. Being a visionary leader is a hallmark of Optimove. It was the first CRM Marketing Platform to natively embed AI with the ability to predict customer migrations between lifecycle stages in 2012.\n\nToday, its comprehensive AI-powered suite is at the leading edge of empowering marketers to optimize workflows from Insight to Creation and through Orchestration. Optimove provides industry-specific and use-case solutions for leading consumer brands globally.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "leading consumer brands",
      "weight": 0.10305779
    },
    {
      "name": "Optimove Insights survey",
      "weight": 0.093545385
    },
    {
      "name": "US Consumers",
      "weight": 0.09122633
    },
    {
      "name": "Optimove Insights",
      "weight": 0.090396404
    },
    {
      "name": "American consumers",
      "weight": 0.08656646
    },
    {
      "name": "consumers",
      "weight": 0.084866405
    },
    {
      "name": "Positionless Marketing",
      "weight": 0.08294183
    },
    {
      "name": "Optimove",
      "weight": 0.08278018
    },
    {
      "name": "Optimove Reports",
      "weight": 0.08267795
    },
    {
      "name": "marketing teams",
      "weight": 0.08255754
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Business"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Other",
      "score": 0.97607421875
    },
    {
      "name": "/Business & Industrial/Advertising & Marketing/Marketing",
      "score": 0.8671875
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.84716796875
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.6875
    }
  ],
  "sentiment": {
    "positive": 0.61036485,
    "negative": 0.08321114,
    "neutral": 0.30642405
  },
  "summary": "Optimove Insights, the research and analysis arm of Optimove, has revealed that 80% of US consumers are increasingly concerned about the impact of tariffs on their spending power across 2025 shopping seasons. The survey also revealed widespread concerns about inflation, highlighting the need for empathetic and responsive marketing strategies. The findings were released by Optimove Insight, the marketing arm of the company, which also revealed that over 81.4% of shoppers were concerned about tariffs and 80.5% were worried about inflation. The company's CEO, Pini Yakuel, called these findings a \"wake-up call\" for marketers who must respond in real time to consumers' financial anxiety.",
  "shortSummary": "Optimove Insights' survey reveals 80% of US consumers are anxious about tariffs and inflation, highlighting the need for empathetic and responsive marketing strategies.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "7caa108ca417450aa2bec364c413361d",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "A recent survey by Optimove Insights of 1,066 American consumers reveals significant concerns about tariffs and inflation, with over 81% worried about tariffs and 80% about inflation affecting their spending power. The findings emphasize the need for marketers to adopt empathetic and agile strategies to address consumer anxieties, as many shoppers are still willing to spend if they perceive value and trust. Optimove's Positionless Marketing approach aims to enhance personalized engagement and campaign efficiency, enabling brands to respond effectively to consumer needs.",
  "argos_id": "MO1T06TVY"
}