{
  "url": "https://www.latimes.com/world-nation/story/2025-08-11/saved-from-militants-timbuktus-famed-manuscripts-return-home-after-13-years-in-malis-capital",
  "authorsByline": "Baba Ahmed",
  "articleId": "85112b4764234d1384c1c69f6854b03c",
  "source": {
    "domain": "latimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "CA",
      "city": "Los Angeles",
      "coordinates": {
        "lat": 34.0536909,
        "lon": -118.242766
      }
    }
  },
  "imageUrl": "https://ca-times.brightspotcdn.com/dims4/default/8f51885/2147483647/strip/true/crop/1800x945+0+128/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F99%2F1b%2F7af132e4bfdb4d6af72a3c04cc97%2F91ddb9a827a1442d815fcbcf2cd46265",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T00:36:38.565000+00:00",
  "addDate": "2025-08-12T00:40:21.923240+00:00",
  "refreshDate": "2025-08-12T00:40:21.923242+00:00",
  "score": 1.0,
  "title": "Saved from militants, Timbuktu's famed manuscripts return home after 13 years in Mali's capital",
  "description": "Islamist radicals destroyed more than 4,000 manuscripts, some dating back to the 13th century, after they seized Timbuktu in 2012, according to a U.N. mission's findings.",
  "content": "Members of the Malian government return boxes containing ancient Timbuktu manuscripts to the community’s elders on Monday.\n\nThe Malian military government on Monday started returning home the historic manuscripts of Timbuktu that were spirited out of their fabled northern city when it was occupied by Al Qaeda-linked militants more than a decade ago.\n\nIslamist radicals destroyed more than 4,000 manuscripts, some dating back to the 13th century, after they seized Timbuktu in 2012, according to the findings of a United Nations expert mission. They also destroyed nine mausoleums and a mosque’s door — all but one of the buildings on the UNESCO World Heritage list.\n\nThe majority of the documents dating back to the 13th century — more than 27,000 — were saved by the devotion of the Timbuktu library’s Malian custodians, who carried them out of the occupied city in rice sacks, on donkey carts, by motorcycle, by boat and four-wheel-drive vehicles.\n\nThe first batch of the manuscripts were brought to Timbuktu by plane from the capital of Bamako, authorities said, adding that the return was necessary to protect them from the threats of Bamako’s humidity.\n\nThe shipment consisted of more than 200 crates and weighed some 5.5 tons. The rest would be shipped in the coming days, officials said.\n\nAbout 439 miles from Bamako, Timbuktu sits on the edge of the Sahara desert and has a dry climate. For years, the local municipal and religious authorities have asked for the return of the manuscripts.\n\nDiahara Touré, Timbuktu’s deputy mayor, said the famous documents are important to the local people as they “reflect our civilization and spiritual and intellectual heritage.”\n\n“This is the first stage” of the return, said Bilal Mahamane Traoré, a local official.\n\nIn February, the military government made a commitment to return the manuscripts, according to Bouréma Kansaye, the Malian Minister of Higher Education. He described them as a “legacy that bears witness to the intellectual greatness and crossroads of civilization” of the city of Timbuktu — “a bridge between the past and the future.”\n\n“We now have a responsibility to protect, digitize, study and promote these treasures so that they continue to enlighten Mali, Africa and the world,” Kansaye said during Monday’s return ceremony.\n\nThe manuscripts, which UNESCO has designated as part of the World Cultural Heritage, cover a myriad of subjects, including Islamic theology and jurisprudence, astronomy, medicine, mathematics, history and geography. They are a testimony to the rich cultural heritage of the Mali and Songhai empires in West Africa.\n\nMali, along with neighboring Burkina Faso and Niger, has long battled an insurgency by armed militants, including some allied with Al Qaeda and the Islamic State group. Following two military coups, the ruling junta expelled French troops and instead turned to Russia for security assistance.\n\nStill, 13 years after the occupation of Timbuktu, the security situation in Mali remains precarious and analysts say it has worsened in recent months. Although the city is back under government control, militants continue attacking its surroundings, including as recently as last month.\n\nAhmed writes for the Associated Press.",
  "medium": "Article",
  "links": [
    "https://www.latimes.com/world-nation/story/2020-06-29/sale-of-sacred-statues-riles-black-lives-matter-campaigners",
    "https://www.latimes.com/world-nation/story/2021-03-16/discovery-new-dead-sea-scrolls-biblical-text",
    "https://www.latimes.com/world-nation/story/2021-04-22/relics-seized-smugglers-returning-afghanistan"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "ancient Timbuktu manuscripts",
      "weight": 0.10109516
    },
    {
      "name": "Timbuktu",
      "weight": 0.08626364
    },
    {
      "name": "Mali",
      "weight": 0.06169541
    },
    {
      "name": "armed militants",
      "weight": 0.05976128
    },
    {
      "name": "Timbuktus famed manuscripts",
      "weight": 0.059610173
    },
    {
      "name": "Al Qaeda",
      "weight": 0.057031542
    },
    {
      "name": "government control",
      "weight": 0.05622957
    },
    {
      "name": "militants",
      "weight": 0.05441815
    },
    {
      "name": "Malian",
      "weight": 0.052679673
    },
    {
      "name": "Timbuktu’s deputy mayor",
      "weight": 0.049879592
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/Sensitive Subjects/War & Conflict",
      "score": 0.927734375
    },
    {
      "name": "/News/Other",
      "score": 0.89208984375
    },
    {
      "name": "/Reference/Humanities/History",
      "score": 0.78955078125
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.6865234375
    },
    {
      "name": "/News/Local News",
      "score": 0.65478515625
    },
    {
      "name": "/News/World News",
      "score": 0.418212890625
    },
    {
      "name": "/Travel & Transportation/Tourist Destinations/Historical Sites & Buildings",
      "score": 0.40869140625
    },
    {
      "name": "/People & Society/Other",
      "score": 0.396240234375
    }
  ],
  "sentiment": {
    "positive": 0.18234134,
    "negative": 0.35661498,
    "neutral": 0.46104366
  },
  "summary": "The Malian military government has begun returning the historic manuscripts of Timbuktu, which were stolen from Al Qaeda-linked militants over a decade ago. The majority of the documents, dating back to the 13th century, were saved by the Timbuka library's Malian custodians. The first batch of the manuscripts were brought to TimbUKtu by plane from Bamako to protect them from the humidity. The remainder of the shipment will be shipped in the coming days. The manuscripts cover various subjects including Islamic theology and jurisprudence, astronomy, medicine, mathematics, history and geography. Despite this, the security situation in Mali remains precarious, with attacks on the city and its surroundings.",
  "shortSummary": "The Malian military government has returned historic Timbuktu manuscripts, saved from Islamist militants 13 years ago, to their community by hand.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "fbe2a88962694767ad55bd2c0a1152a6",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.latimes.com/world-nation/story/2020-06-29/sale-of-sacred-statues-riles-black-lives-matter-campaigners",
      "text": "Sacred statues sold despite experts’ pleas that they were stolen during Nigerian civil war\n- Share via\nPARIS — A pair of sacred statues that a Nigerian museum commission and protesters said were looted during the country’s 1960s civil war fetched $239,000 at auction in Paris on Monday.\nThe Igbo statues were sold by Christie’s auction house, which defended the sale and said the artworks were legitimately acquired.\nA Princeton University scholar, Chika Okeke-Agulu, alongside Nigeria’s National Commission for Museums and Monuments, raised alarms this month that the objects were looted during the Biafran war in the late 1960s.\nThe war saw more than 1 million people die, many of starvation, trying to create a state for the Igbo people. The Igbo are one of Nigeria’s largest ethnic groups.\nOkeke-Agulu, who is Igbo, said the objects were taken through “an act of violence” and shouldn’t be sold. An online petition with the hashtags BlackArtsMatter and MyHeritageMatters collected more than 3,000 signatures demanding the auction be halted.\nThe petition said “as the world awakens to the reality of systemic racial injustice and inequality, thanks to the #BlackLivesMatter movement, we must not forget that it is not just the Black body, but also Black culture, identity and especially art that is being misappropriated.”\nIn a statement to the Associated Press, the auction house said “these objects are being lawfully sold having been publicly exhibited and previously sold over the last decades prior to Christie’s involvement.”\nChristie’s said it recognized the “nuanced and complex debates around cultural property,” but also argued that such sales stop illegal markets from flourishing.\nBabatunde E. Adebiyi, legal advisor for the National Commission for Museums and Monuments of Nigeria, said officials had contacted Christie’s on June 17 and had asked the auction house to suspend the sales pending further investigation into their origins.\n“We are shocked the sales went on,” he told the Associated Press. “It represents a major setback in our effort to get our antiquities from abroad.”\nIn recent years, French courts have consistently ruled in favor of auction houses whose sales of sacred objects, such as Hopi tribal masks, were contested by rights groups and representatives of the tribes.\nParis has a long history of collecting and selling tribal artifacts, tied to its colonial past in Africa, and to Paris-based groups in the 1960s, such as the “Indianist” movement, that celebrated indigenous tribal cultures.\nInterest in tribal art in Paris was revived in the early 2000s following two high-profile — and highly lucrative — sales in Paris of tribal art owned by late collectors Andre Breton and Robert Lebel."
    },
    {
      "url": "https://www.latimes.com/world-nation/story/2021-03-16/discovery-new-dead-sea-scrolls-biblical-text",
      "text": "New Dead Sea Scrolls dating back nearly 2,000 years found in Israel\n- Share via\nJERUSALEM — Israeli archaeologists Tuesday announced the discovery of dozens of new Dead Sea Scroll fragments bearing text from the Hebrew Bible and dating back about 1,900 years. The ancient fragments were found in a desert cave and believed hidden during a Jewish revolt against Rome.\nThe fragments of parchment bear lines of Greek text from the biblical books of Zechariah and Nahum and have been radiocarbon-dated to the 2nd century, according to the Israel Antiquities Authority. They are the first new scrolls found in archaeological excavations in the desert south of Jerusalem in 60 years.\nThe Dead Sea Scrolls, a collection of Jewish texts found in desert caves in the West Bank near Qumran in the 1940s and 1950s, date from the 3rd century BC to the 1st century AD. They include the earliest-known copies of biblical texts and documents outlining the beliefs of a little-understood Jewish sect.\nThe roughly 80 new pieces are believed to belong to a set of parchment fragments found in a site known as the “Cave of Horror” — named for the 40 human skeletons found there during excavations in the 1960s — that also bear a Greek rendition of the Twelve Minor Prophets, a book in the Hebrew Bible. The cave is located in a remote canyon about 25 miles south of Jerusalem.\nThe artifacts were found during an operation in Israel and the occupied West Bank conducted by the Israel Antiquities Authority to find scrolls and other artifacts to prevent possible plundering. Israel captured the West Bank in the 1967 Middle East War, and international law prohibits the removal of cultural property from occupied territory. The authority held a news conference Tuesday to unveil the discovery.\nThe fragments are believed to have been stashed away in the cave during the Bar Kochba Revolt, an armed Jewish uprising against Rome during the reign of Emperor Hadrian, between AD 132 and 136. Coins struck by rebels and arrowheads found in other caves in the region also hail from that period.\nThe eternal disputes of the Dead Sea Scrolls\n“We found a textual difference that has no parallel with any other manuscript, either in Hebrew or in Greek,” said Oren Ableman, a Dead Sea Scroll researcher with the Israel Antiquities Authority. He referred to slight variations in the Greek rendering of the Hebrew original compared to the Septuagint — a translation of the Hebrew Bible into Greek made in Egypt in the 3rd and 2nd centuries BC.\n“When we think about the biblical text, we think about something very static. It wasn’t static. There are slight differences, and some of those differences are important,” said Joe Uziel, head of the antiquities authority’s Dead Sea Scrolls unit. “Every little piece of information that we can add, we can understand a little bit better” how the biblical text came into its traditional Hebrew form.\nAlongside the Roman-era artifacts, the exhibit included other discoveries of no lesser importance found during the authority’s sweep of more than 500 caves in the desert: the 6,000-year-old mummified skeleton of a child; an immense, complete woven basket from the Neolithic period, estimated to be 10,500 years old; and other delicate organic materials preserved in the caves’ arid climate.\nIn 1961, Israeli archaeologist Yohanan Aharoni excavated the “Cave of Horror,” where his team found nine parchment fragments belonging to a scroll with texts from the Twelve Minor Prophets in Greek, and a scrap of Greek papyrus.\nSometimes science seems like science, and sometimes it seems like magic.\nSince then, no new texts have been found during archaeological excavations, but many have turned up on the black market, apparently plundered from caves.\nFor the last four years, Israeli archaeologists have launched a major campaign to scour caves nestled in the precipitous canyons of the Judean Desert in search of scrolls and other rare artifacts. The aim is to find them before plunderers disturb the remote sites and destroy archaeological strata and data in search of antiquities to sell on the black market.\nUntil now, the hunt had found only a handful of parchment scraps that bore no text.\nAmir Ganor, head of the antiquities authority’s theft-prevention unit, said that since the commencement of the operation in 2017 there has been virtually no plundering in the Judean Desert.\n“For the first time in 70 years, we were able to preempt the plunderers,” he said."
    },
    {
      "url": "https://www.latimes.com/world-nation/story/2021-04-22/relics-seized-smugglers-returning-afghanistan",
      "text": "Uncertain about its future, Afghanistan gets back smuggled relics from its past\n- Share via\nWASHINGTON — Precious relics of Afghanistan’s ancient past are returning home even as the nation confronts deepening uncertainty about its future.\nA collection of 33 artifacts seized from a New York-based art dealer who authorities say was one of the world’s most prolific smugglers of antiquities was turned over by the U.S. to the government of Afghanistan this week.\n“The significance of the material is huge,” Roya Rahmani, the country’s ambassador to the U.S., said Wednesday. “Each one of these pieces are priceless depictions of our history.”\nRahmani formally took control of the collection in a ceremony Monday in New York with the Manhattan district attorney’s office and Homeland Security Investigations, which recovered the artifacts as part of a larger investigation into the trafficking of antiquities from a number of countries.\nNow, after briefly being displayed at the embassy in Washington, the masks, sculptures and other items, some from the 2nd and 3rd centuries, are en route to Kabul, where they are expected to go on display at the National Museum.\nIt’s the same museum where members of the Taliban destroyed artifacts in 2001 as part of a cultural rampage rooted in a fundamentalist version of Islam, in which depictions of the human form are considered offensive.\nYoung Afghans fear losing new freedoms and their lives to the Taliban as U.S. troops prepare to exit.\nThe Taliban is now out of power. But it controls much of the country outside of Kabul amid stalled talks with the government and the looming withdrawal of U.S. and NATO forces after two decades of war. Rahmani concedes it’s a delicate time.\n“However, what I know is that our security forces are determined to defend our people,” she said in an interview with the Associated Press. “The government is committed to do its part for peace and stability in a way that would bring durable peace.”\nPresident Biden has said the U.S. would remove all its troops by Sept. 11, the 20th anniversary of the attacks that prompted the American invasion to dislodge the Taliban in 2001 for allowing Al Qaeda to operate from Afghanistan.\nBefore the Sept. 11 attacks, the Taliban had already become internationally notorious for enforcing a harsh form of Islamic law that kept women out of public view and for destroying — with rockets, shells and dynamite — the famed giant, 6th century sandstone Buddha statues built into a cliff in Bamiyan province.\nSecretary of State Antony Blinken makes an unannounced visit to Afghanistan to sell its leaders on President Biden’s plan to withdraw all U.S. troops.\nRahmani says she wept when she first learned what the Taliban had done to the Buddha statues.\nBy contrast, the recovered antiquities are “returning to a government and people who cherish their past” and will make sure they are preserved for future generations, Rahmani said. She doesn’t expect the Taliban, if they return to power, would dare to destroy them.\n“Our security forces and our government would not let that happen,” she said. “We are determined not to let that happen.”\nLike the statues, some of the recovered antiquities depict Buddha. There’s also a marble statue of the Hindu god Shiva and a Greek mask. The artifacts reflect the multicultural influences on Afghanistan, an important center of trade and commerce, according to Fredrik Hiebert, an archaeologist and National Geographic fellow who studies the country.\nMen on the border between Afghanistan and Iran have battled for centuries. Now a fight over water is brewing.\nThere are at least 2,600 archaeological sites around the country, said Hiebert, who helped authenticate some of the items after they had been confiscated by federal agents.\n“Afghanistan is one of the richest countries in archaeology and history in the world,” he said. “And there’s very good reason, of course. For 6,000 years there’s been civilization based in Afghanistan.”\nThat also makes it an attractive target to looters, which is how the items eventually ended up in the United States.\nIn 2007, Homeland Security Investigations, an agency that deals with cases of smuggling that cross international borders, received information about looted artifacts brought to the New York area from India.\nIt eventually led to the indictment of a New York art gallery owner, Subhash Kapoor, and seven others, as well as the seizure of more than 2,600 artifacts, valued at more than $140 million. Kapoor is in jail in India and faces extradition to the U.S.\nIn the meantime, the U.S. government is working to repatriate the looted material, much of which was found in a series of raids on storage units in the New York area.\nThey have already returned relics to Nepal and Sri Lanka and soon will turn over artifacts to Thailand, said Stephen Lee, the supervisor special agent in charge of Homeland Security Investigations’ cultural property, arts and antiquities unit. The 33 items being sent to Afghanistan, valued at around $1.8 million, are the first to go back there as part of this investigation.\n“They belong to the people of Afghanistan,” Lee said. “That’s their cultural history.”"
    }
  ],
  "argos_summary": "The Malian military government has begun returning ancient manuscripts from Timbuktu, which were saved from destruction by Islamist militants over a decade ago. The first shipment, weighing 5.5 tons and consisting of over 200 crates, is part of a commitment made by the government to protect and promote these cultural treasures, which reflect the rich heritage of the region. Meanwhile, other cultural artifacts, including 33 relics from Afghanistan, are being repatriated from the U.S. as part of efforts to restore historical items to their countries of origin.",
  "argos_id": "MR8SYQK4S"
}