{
  "url": "https://www.gamesradar.com/games/action-rpg/elden-ring-does-it-again-bandai-namco-lights-a-cigar-with-digital-profits-up-jpy7-billion-partly-thanks-to-5-million-nightreign-players-and-doubles-down-on-sony-collaboration/",
  "authorsByline": "Austin Wood",
  "articleId": "463305487235432bbbc1b13bbdc79855",
  "source": {
    "domain": "gamesradar.com",
    "paywall": false,
    "location": null
  },
  "imageUrl": "https://cdn.mos.cms.futurecdn.net/LGPX596CrcJmMWtPveFcvL-1280-80.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T19:15:12+00:00",
  "addDate": "2025-08-11T20:57:54.547986+00:00",
  "refreshDate": "2025-08-11T20:57:54.547990+00:00",
  "score": 1.0,
  "title": "Elden Ring does it again: Bandai Namco lights a cigar with digital profits up ¥7 billion partly thanks to 5 million+ Nightreign players, and doubles down on Sony collaboration",
  "description": "Elden Ring Nightreign has been a boon for Bandai",
  "content": "If I had a nickel for every time an Elden Ring release beefed up Bandai Namco's video game sales figures, I'd have three nickels. We've had Elden Ring, Elden Ring: Shadow of the Erdtree, and now Elden Ring Nightreign.\n\nIn its latest quarterly financial results, Bandai Namco reports an appreciable rise in net sales and operating profit compared to the same quarter last year, and most of that profit growth was driven by its digital segment, which covers video games. In total, the company saw sales increase 19.8 billion Yen while operating profit went up 7.9 billion Yen.\n\nToys and hobby was the biggest segment by sales with a growth of ¥14 billion, but with a much smaller ¥1.6 billion increase in profit. Digital, meanwhile, saw a ¥1.4 billion jump in sales but a sizable ¥7 billion increase in profits.\n\nBandai Namco highlights two releases for \"trends in the digital business.\" One is Gundam, a trend throughout the company's segments – specifically, SD Gundam G Generation Eternal, which Bandai describes as \"off to a solid launch.\" The other, at a whopping 5 million copies shipped as of last month, is Elden Ring Nightreign.\n\n\"Console title Elden Ring Nightreign performed well,\" Bandai reiterates in its report. In total, the publisher saw 4.62 million units of new titles sold, alongside 6.13 million units of old titles, in the quarter. This means Elden Ring Nightreign was a huge chunk of that volume, even if its sales did spill over beyond the end of the tracked quarter.\n\nI spoke with Nightreign director Junya Ishizaki at length earlier this year, and my understanding of the game's development pipeline is that, as much as an inherently costly and labor-intensive craft like game development will allow, this game was made pretty fast and fairly cheap to keep it agile and affordable. Not quite made in a cave with a box of scraps, but a lot closer to it than most games get at the AA or AAA level.\n\nThat being said, I would wager that 5 million copies is already a solid return on investment for FromSoftware and Bandai Namco, and Nightreign still has a DLC ahead of it. Post-launch, Nightreign has been kept afloat with minor patches and rotating super-bosses called Everdark Nightlords, giving players new challenges to tear into.\n\nI've already put more hours into the game than I ever thought I would, and there's hope in the community that its success could fuel more, or more ambitious, updates in the farther future, even if FromSoftware isn't trying to make a full live service game.\n\nBack to Bandai's report, another slide perks up the ol' ears. The publisher highlights \"a strategic partnership between Sony Group and Bandai Namco Holdings,\" revisiting the partnership revealed last month after Sony snapped up 16 million shares of Bandai.\n\nAt the time, the partnership was described as a way to \"focus on expanding the fan community for IP such as anime and manga around the world and strengthening engagement.\"\n\nBandai's financial report has slightly more detail: \"The expansion of works as well as products and services based on IP developed by Bandai Namco, leveraging Sony's strengths in areas such as the production and distribution of anime and other video content, as well as merchandising.\"\n\nThis will play out in the \"joint development and promotion of IP, planning and technical collaboration on experiential entertainment, support for creators through the joint development and operation of entertainment related technologies and services,\" and \"joint investments and business alliances in the area of fan engagement.\"\n\nFunnily enough, we're gearing up for yet more Elden Ring, as the Switch 2 release and Tarnished Edition content update seem to be coming soon.\n\nFor the first time since the original Dark Souls, Elden Ring Nightreign sleuth finds FromSoftware significantly changed how grab attacks work – creating a 0.2-second window for one old boss.",
  "medium": "Article",
  "links": [
    "https://www.gamesradar.com/tag/bandai-namco/",
    "https://www.gamesradar.com/games/action-rpg/elden-ring-nightreign-is-an-extension-of-fromsoftwares-philosophy-director-says-not-a-revision-were-always-looking-to-make-something-valuable-in-our-games-something-that-feels-worthwhile/",
    "https://www.gamesradar.com/tag/fromsoftware/",
    "https://www.gamesradar.com/games/open-world/elden-rings-new-content-and-nintendo-switch-2-release-could-be-coming-soon-the-tarnished-edition-was-just-rated-by-the-esrb/",
    "https://www.gamesradar.com/games/action-rpg/elden-ring-nightreign-guide/",
    "https://www.bandainamco.co.jp/files/ir/financialstatements/pdf/en_20250805_presentation.pdf",
    "https://www.gamesradar.com/games/action-rpg/elden-ring-nightreign-passes-2-million-sales-on-its-first-day-despite-a-mixed-steam-rating-and-some-of-fromsoftwares-lowest-critic-scores-in-years/",
    "https://www.gamesradar.com/games/action-rpg/for-the-first-time-since-the-original-dark-souls-elden-ring-nightreign-sleuth-finds-fromsoftware-significantly-changed-how-grab-attacks-work-creating-a-0-2-second-window-for-one-old-boss/",
    "https://www.gamesradar.com/games/sony-acquires-16-million-shares-of-bandai-namco-for-around-usd464-million-in-new-partnership-aimed-at-strengthening-engagement-among-anime-and-manga-fans/",
    "https://www.gamesradar.com/nintendo-switch-2-guide/",
    "https://www.gamesradar.com/games/action-rpg/at-10-million-copies-sold-elden-ring-shadow-of-the-erdtree-has-one-of-the-highest-attach-rates-in-dlc-history-rivalling-cd-projekt-reds-sterling-run-with-the-witcher-3-and-cyberpunk-2077/",
    "https://www.gamesradar.com/tag/sony/"
  ],
  "labels": [
    {
      "name": "Pop Culture"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Elden Ring Nightreign",
      "weight": 0.099382125
    },
    {
      "name": "Bandai Namco",
      "weight": 0.09550897
    },
    {
      "name": "Elden Ring Nightreign sleuth",
      "weight": 0.09460607
    },
    {
      "name": "Console title Elden Ring Nightreign",
      "weight": 0.09110391
    },
    {
      "name": "Bandai Namco Holdings",
      "weight": 0.09106088
    },
    {
      "name": "Elden Ring",
      "weight": 0.08522548
    },
    {
      "name": "game development",
      "weight": 0.08139901
    },
    {
      "name": "Bandai",
      "weight": 0.077808246
    },
    {
      "name": "most games",
      "weight": 0.075298525
    },
    {
      "name": "Bandai Namcos video game sales figures",
      "weight": 0.07252857
    }
  ],
  "topics": [
    {
      "name": "Gaming"
    },
    {
      "name": "Cigars"
    },
    {
      "name": "Elden Ring"
    }
  ],
  "categories": [],
  "taxonomies": [
    {
      "name": "/Games/Computer & Video Games/Gaming Reference & Reviews",
      "score": 0.9453125
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.8291015625
    },
    {
      "name": "/Games/Computer & Video Games/Adventure Games",
      "score": 0.5029296875
    },
    {
      "name": "/Games/Computer & Video Games/Action & Platform Games",
      "score": 0.471435546875
    },
    {
      "name": "/Games/Computer & Video Games/Other",
      "score": 0.39453125
    },
    {
      "name": "/Games/Roleplaying Games",
      "score": 0.373779296875
    },
    {
      "name": "/Games/Computer & Video Games/Video Game Development",
      "score": 0.331298828125
    }
  ],
  "sentiment": {
    "positive": 0.79107827,
    "negative": 0.060645018,
    "neutral": 0.14827675
  },
  "summary": "Bandai Namco has reported a significant increase in digital profits, largely due to the release of Elden Ring Nightreign, which has 5 million players. Most of this growth was driven by the digital segment, which saw sales increase 19.8 billion Yen and operating profit go up 7.9 billion Yen. The company also highlighted a trend in the digital business, with SD Gundam G Generation Eternal being off to a good launch. The publisher continued to expand on collaboration with Sony, focusing on expanding fan community for IP such as anime and manga globally and increasing engagement.",
  "shortSummary": "Bandai Namco's digital profits surged by ¥7 billion due to Elden Ring's success and a strategic partnership with Sony, enhancing fan engagement and collaboration.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "b2e2457976e24ff6a710b358d1172a7d",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.gamesradar.com/games/open-world/elden-rings-new-content-and-nintendo-switch-2-release-could-be-coming-soon-the-tarnished-edition-was-just-rated-by-the-esrb/",
      "text": "Elden Ring's new content and Nintendo Switch 2 release could be coming soon – the Tarnished Edition was just rated by the ESRB\nWe may have an Elden Ring Tarnished Edition release date soon\nElden Ring's Tarnished Edition, which will bring the storied open-world RPG to Switch 2 and bring a smattering of content to folks who own the game elsewhere, has been rated by the ESRB, suggesting a launch or at least a release date reveal is imminent.\nThe Switch 2 ESRB rating for the Tarnished Edition is just that: a rating, predictably matching the existing version of the game, which is rated M. It does, however, provide another opportunity to examine the ESRB's summary of the game's hands-off narrative.\n\"This is an action role-playing game in which players assume the role of a character trying to retrieve a magical ring and become the Elden Lord,\" the ESRB reckons.\nI mean, kind of? There are certainly magical rings of light, and the classical ending sees you seated upon the Elden throne. But from my memory, Elden Ring is either a game about completing ridiculously convoluted side quests for Ranni so that she gives you the magic sword you need to perfect your build, or a game about setting the world on fire to prevent Marika from setting herself on fire, with little to no in-between. To each their own.\nAlso, after 250 hours of Elden Ring and its DLC, I'm still not entirely sure what this line from the ESRB is a reference to: \"During the course of the game, a humanoid monster is depicted partially nude, with scales/scars covering its breast and pelvic regions.\" Surely the little stretchy lizards in the lava castle didn't warrant a disclaimer.\nThis line, however, I understand perfectly: \"The word 'sh*t' appears in the dialogue.\"\nElden Ring has been on the big list of upcoming Switch 2 games for some time. It was revealed in the big Nintendo Switch 2 Direct back in April, but we didn't learn the full implications of the Tarnished Edition until later. It's got new starting classes, armor, weapons, and more, and all Elden Ring players will get to enjoy that part. But only Switch 2 players will get to savor the whiplash of seeing the Elden Ring title card alongside Mario's face in their console home page UI.\nWeekly digests, tales from the communities you love, and more\nMeanwhile, I'm still reeling from the fact that FromSoftware's next game, The Duskbloods, is a bona fide Nintendo exclusive.\nAustin has been a game journalist for 12 years, having freelanced for the likes of PC Gamer, Eurogamer, IGN, Sports Illustrated, and more while finishing his journalism degree. He's been with GamesRadar+ since 2019. They've yet to realize his position is a cover for his career-spanning Destiny column, and he's kept the ruse going with a lot of news and the occasional feature, all while playing as many roguelikes as possible.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.gamesradar.com/games/action-rpg/for-the-first-time-since-the-original-dark-souls-elden-ring-nightreign-sleuth-finds-fromsoftware-significantly-changed-how-grab-attacks-work-creating-a-0-2-second-window-for-one-old-boss/",
      "text": "For the first time since the original Dark Souls, Elden Ring Nightreign sleuth finds FromSoftware significantly changed how grab attacks work – creating a 0.2-second window for one old boss\nA couple of old foes from Dark Souls got a little rework in Nightreign.\nFromSoftware has made some tricksy mechanical changes in Elden Ring Nightreign that actually give you a slight leg up on big encounters. Grabs from bosses are now a touch easier to dodge, but some have been made trickier to get out of if you land in a twisted beast's clutches.\nExpert Nightreign deepdiver Zullie the Witch posted a breakdown of the alterations, going through where and how grabs have been changed. The biggest thing to note, and something you may have already clocked, is that grab maneuvers have large on-screen tells in the multiplayer slobberknocker.\nA glowing effect with audio now comes before whatever creature you're facing takes a massive swing at you, providing a wider window for dodging. Do so just right, and you'll get an Ultimate Arts buff of 15%, but that's risky as you need to narrowly miss capture.\nIf you do get enraptured in their slithery claws, good news: your fellow Nightfarers can disrupt the damage. In prior games, enemies got temporary immunity if you were captured, but now they can be hit and staggered to drop you. Handy indeed!\nBut it's always give and take when we're talking about FromSoftware. Several Nightlords have inescapable grabs, to the extent no amount of button-bashing will free you sooner if you're without help from others. Two bosses from Dark Souls, Centipede Demon and Gaping Dragon, have had their thresholds for escape doubled. Previously, you had to hammer buttons up to 25HP, but now it’s 50, though still possible since it’s just five seconds.\nFor Centipede Demon, getting this right sets you free in the nick of time, as a third hit occurs at 5.2 seconds. You'll get away right before taking substantial damage. All in all, it seems the best strategy is the simplest: don't get captured.\nFor further assistance, rest a moment and have a look at our guide to all the Elden Ring Nightreign bosses.\nWeekly digests, tales from the communities you love, and more\nAnthony is an Irish entertainment and games journalist, now based in Glasgow. He previously served as Senior Anime Writer at Dexerto and News Editor at The Digital Fix, on top of providing work for Variety, IGN, Den of Geek, PC Gamer, and many more. Besides Studio Ghibli, horror movies, and The Muppets, he enjoys action-RPGs, heavy metal, and pro-wrestling. He interviewed Animal once, not that he won’t stop going on about it or anything.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.gamesradar.com/nintendo-switch-2-guide/",
      "text": "Everything we know about Nintendo Switch 2\nAll the news and details surrounding the brand-new Nintendo Switch 2\nThe Nintendo Switch 2 launch day came and went on June 5, 2025. After years of speculation, leaks, and rumors, Ninty's latest machine was finally unleashed onto the world and managed to sell 3.5 million units in the subsequent four days of release. Now, the Switch 2 has become Nintendo's fastest-selling console to date, and its new lifespan has just begun.\nThe Switch 2 has an MSRP of $450 / £395.99, and was available at launch with a Mario Kart World bundle available for $499.99 / £429.99, where it introduced 256GB of internal storage, magnetically attached Joy-Con 2 controllers, a GameCube NSO game library, mouse controls, a bigger 7.9 inch 1080p 120Hz LCD display, and a wealth of new games, including Switch 2 Enhanced versions of older releases.\nOur hardware team's own Tabitha Baker shared in her Nintendo Switch 2 review that we're in for an \"excellent generation\" with the new handheld, and that while its battery life isn't ideal and its HDR needs a little tuning, the device is a \"leap\" from the previous Switch. Many more of us now finally have a Switch 2 of our own too, and are getting to grips with the changes from its predecessors. But with more upcoming Switch 2 games being announced all the time, we're continuing to gather every bit of news and details about the Switch 2 so you can find out the latest about Nintendo's newest machine, or decide if buying a Switch 2 is right for you.\nThe Nintendo Switch 2 launch date & price\nThe Nintendo Switch 2 released worldwide on Thursday, June 5, 2025, for $450 / £395.99. At launch, both the standard console and a Mario Kart World bundle (with a digital copy of the game) were available to purchase, with the bundle costing $499.99 / £429.99, respectively.\nThe release date for the upcoming handheld was unveiled during the April 2 Nintendo Switch Direct presentation, with the price shared through official channels shortly afterward. Nintendo Switch 2 pre-orders went live in the UK on April 8, 2025, just days after the April 2 Direct from the official Nintendo website and selected retailers.\nIn a likely bid to prevent resellers getting hold of the new console across the globe, the opportunity to pre-order the Switch 2 from the official My Nintendo Store was initially limited and offered on an invite-only basis to selected Nintendo Switch Online members. To be one of those lucky few, you had to match a series of criteria, which included being a Nintendo Switch Online member for at least two years continuously by March 31, 2025, and having an active NSO subscription on the day of pre-orders.\nNintendo Switch 2 Specs\nThe Nintendo Switch 2 is a monumental upgrade from its predecessor inside and out, but using what we know from past Nintendo Switch 2-centered Directs, supplementary tech specs provided officially by the Nintendo website, and information provided by those directly involved in its manufacture, like Nvidia, the overall specs are:\n- 401g weight (534g with Joy-Cons attached)\n- Custom NVIDIA Ampere GPU\n- 128-bit/LPDDR5\n- 256GB internal storage\n- 7.9-inch LCD 1080p 120Hz display with 120Hz refresh rate\n- Dock with 4K and HDR (in TV mode) support\n- Magnetically attached Joy-Con 2 controllers with mouse controls\n- MicroSD Express card reader (compatible up to 2TB)\n- Built-in microphone (with noise and echo cancellation, and auto gain control)\n- 2 – 6.5 hours battery life\nOn June 2, 2025, just days before launch, Nintendo of America dropped a special edition of Creator’s Voice video on its YouTube Channel, featuring Nvidia CEO Jensen Huang. Huang stated that the launch of the Switch 2 was a \"big moment\" for everyone at Nvidia, and that they had to \"reinvent everything\" for the brand new handheld. According to Huang, the Switch 2 chip is \"unlike anything\" they've built before, and features the most \"advanced graphics ever in a mobile device\" which includes full ray-tracing, HDR for brighter highlights and deeper shadows, and a backwards compatibility supporting architecture.\nHuang also shared that the Switch 2's chip had dedicated AI processors to sharpen and enhance gameplay in real-time, and that Nvidia optimized its semiconductor processing tech to ensure high-performance in the brand-new handheld.\nThe Digital Foundry YouTube Channel released a deeper dive into the specs of the new Switch 2, confirming that the handheld is integrated with a custom Nvidia T239 chip with an Ampere-based GPU. Digital Foundry also revealed that VRR is only available in handheld mode. As of now, the tech, which helps synchronize the frame rate of your display with the frame rate of your Switch, won't work with your gaming monitor or smart TV. The handheld also features a custom file decompression engine, designed to help improve the load times of games.\nIf you're into the nitty and gritty details, the Switch 2 CPU has a clock of 998MHz in docked mode and a 1101MHz clock in handheld mode. Meanwhile, the GPU is rated for 1007MHz docked and 561MHz in handheld mode.\nDisplay\nThe Nintendo Switch 2 is armed with a larger 7.9-inch 1080p 120Hz screen with HDR abilities, while its docking station allows players to ramp things up to 4K on external gaming TV and monitors. To pull off those enhanced resolutions, the dock also has a built-in fan to keep the system cool, which makes sense, seeing as even the Steam Deck OLED and Asus ROG Ally will struggle to deliver UHD visuals in newer games.\nJust like the OLED Nintendo Switch, the Nintendo Switch 2 features a film layer that acts as a screen protector. Its existence on the new handheld was discovered by The Verge, and as per Nintendo's instructions in the official Switch 2 manual.\nWeekly digests, tales from the communities you love, and more\nStorage\nThe Switch 2 has 256GB of storage (with around 7GB of that being used for the operating system), which Nintendo claims is faster than the 32GB flash memory used by the original system.\nIt helps improve load times in more demanding games or existing adventures like Breath of the Wild and Tears of the Kingdom Enhanced Edition. It also opens the door for bigger, bolder outings since the handheld will be able to pull data much faster than before. The caveat is that the new game cards are now simply keys that allow you access to a download, which ties in the idea of faster memory beyond the old cartridges.\nWhen it comes to additional storage, the best Nintendo Switch SD cards are not compatible with the new device, and instead, you'll have to grab one of the best Nintendo Switch 2 microSD Express cards for $49.99 / £49.99 to get an additional 256GB worth of storage. Officially licensed Samsung and SanDisk 256GB Express Card available through the official Nintendo website and other retailers, which feature red Super Mario branding. However, iconic storage brands Lexar and SanDisk have 128GB and 256GB compatible cards available to purchase from select retailers.\nThe official Nintendo website states that inserting a microSD card that has been previously used on a Nintendo Switch into a Nintendo Switch 2 console will not allow you to save or load digital games or save data. That being said, you can transfer over screenshots and game captures with an older microSD card, generally, and through the system transfer process.\nJoy-Con\nThe brand new Joy-Con 2 controllers for the Switch 2 are very similar to their predecessors, but feature all-black colorways with dabs of the iconic blue and red iconic Switch-branded colors poking out from around the sticks and magnetically connecting edges.\nThe new controllers are the same width as before but are now half an inch taller and feature a brand new 'C' button (on the right Joy-Con 2) to activate the new 'GameChat' feature - a Discord-like chat system that allows Switch 2 users to chat to their friends and share gameplay footage. This new C button will be a paid-for feature in the future, though. Players can use it via a free trial that expires on March 31, 2026, after which they'll need to have a Nintendo Switch Online membership to use it. Without a membership, the C button will be useless and provide no function.\nOne of the biggest changes with the new Joy-Con controllers is that they can be used upside down and are integrated with mouse gameplay mechanics. These brand-new mouse controls are included in both controllers and, when held on their side against a flat surface, can be dragged just like a gaming mouse. Within the Ask the Developer Vol. 16: Nintendo Switch 2 — Part 2 blog post, producer Kawamoto stated that the mouse controls can be used to \"move your character around with the control stick, while using the right Joy-Con 2 as a mouse to aim and shoot\" in games like Metroid Prime 4 Beyond.\nDespite not using stick-drift eliminating tech like hall effect sticks, the brand-new sticks are larger and more durable, with \"smoother movement\", according to producer Kawamoto, and the L and R buttons have also been lengthened for comfort. They can also be customized by purchasing replacement color panels, however, as of typing, only third-party accessory manufacturers currently have different colored panels available for the new controllers.\namiibo\nNintendo released brand-new Street Fighter 6 and The Legend of Zelda amiibo figures on June 5, 2025.\nFighters Luke, Jamie, and Kimberly received their own amiibo figures, which launched alongside the Switch 2 version of Street Fighter 6 Fighters Edition and unlock \"exclusive in-game content\" and the ability to save and load your favorite character's outfit, control style, and button settings.\nAlongside the figures, 22 amiibo cards featuring a range of Street Fighter 6 characters are also available. The Legend of Zelda Tears of the Kingdom also received more amiibos of its own, with figures based on Tulin, Yunobo, Riju, and Sidon. These launched on June 5 too, and unlock fabric for Link’s paraglider, as well as weapons and materials like previously existing Zelda amiibos.\nThe fifth brand-new Zelda amiibo, Mineru's Construct, will be released in the future, however, a release date and price haven't yet been announced.\nNintendo Switch 2 design\nThe design and overall look of the Nintendo Switch 2 are similar to that of the original Switch. The brand-new console features an all-black colorway, with hints of the original blue and red design visible on the side of the controllers and around their sticks.\nThe Switch 2 is still 13.9mm thick, just like the original, but it now wields a 7.9-inch screen. It also has longer gamepads (known as the Joy-Con 2 controllers) that connect magnetically to the side of the device, although there are connecting pins - which hopefully won't be subject to damage in the long run like the mounting rails of the original console. The new Switch also features an updated kickstand design, which, similar to that of the Nintendo Switch OLED, is a lot bigger than the classic Switch and offers up more angles for its tabletop gaming mode.\nNintendo Switch 2 backwards compatibility\nThe Nintendo Switch 2 is backwards compatible with original Switch games, including physical game carts, digital downloads, and the official Nintendo Switch Online game libraries.\nHowever, the official Nintendo website states that due to the difference in hardware between the two consoles, \"some Nintendo Switch games may not be supported on or fully compatible with Nintendo Switch 2\" but that the tech giant is continuing to improve compatibilty including by \" working with publishing and developing partners.\"\nYou can check the official Nintendo backwards compatibility list full an in-depth look at every game that's affected by the change of hardware. Additionally, some original Nintendo Switch games still require the use of the older Joy-Con controllers, and we've gathered them all below:\n- Ring Fit Adventure\n- 1-2-Switch\n- Everybody 1-2-Switch\n- Game Builder Garage\n- Nintendo Switch Sports\n- WarioWare Move It!\n- Nintendo Labo Toy-Con 01: Variety Kit\n- Nintendo Labo Toy-Con 02: Robot Kit\n- Nintendo Labo Toy-Con 03: Vehicle Kit\nJust as we suspected, games like Ring Fit Adventure and Nintendo Labo are effected, namely as of their reliance on the old Joy-Con controllers. Ring Fit Adventure is only playable by using an existing Joy-Con controller, as the Joy-Con 2 is not compatible with the Ring Con, and is too large for the leg strap. The new controllers also don't feature an IR Motion Camera, so the older versions of the Joy-Con are required to play games like 1-2-Switch and Everybody 1-2-Switch.\nOn the positive side, a number of original Switch games received free upgrades to \"enhance the gameplay experience\" on the Switch 2. This included ARMS, Big Brain Academy Brain vs. Brain, Captain Toad Treasure Tracker, Clubhouse Games 51 Worldwide Classics, Game Builder Garage, New Super Mario Bros U Deluxe, Pokemon Scarlet, Pokemon Violet, Super Mario 3D World + Bowser's Fury, Super Mario Odyssey, and Legend of Zelda Echoes of Wisdom and Link's Awakening.\nThese free upgrades include everything from HDR support, the ability to share locally and online via GameChat, and visual optimizations and frame rate improvements. For example, Pokemon Scarlet and Violet, which were infamous for their performance on the original Switch, will have \"improved and smoother movement\" on the Switch 2, along with more optimized resolutions to help improve performance.\nThe Nintendo Switch 2 also features a new Virtual Game Card system. These new virtual game cards replace the icons of digital Switch games with icons that look more visually like physical game cards. With these digital game cards, you can lend Switch games to any members of your Nintendo family group.\nNintendo Switch 2 games\nThere were a number of Nintendo Switch 2 launch games available to play on day one, and we've gathered them all below:\n- Nintendo Switch 2 Welcome Tour\n- Mario Kart World\n- The Legend of Zelda: Breath of the Wild (Nintendo Switch 2 Edition)\n- The Legend of Zelda: Tears of the Kingdom (Nintendo Switch 2 Edition)\n- Split Fiction\n- Cyberpunk 2077: Ultimate Edition\n- Street Fighter 6\n- Sid Meier's Civilization 7 (Nintendo Switch 2 Edition)\n- Hogwarts Legacy\n- Bravely Default Flying Fairy HD Remaster\n- Yakuza 0 Director's Cut\n- Sonic X Shadow Generations\n- Fortnite\n- Hitman World of Assassination – Signature Edition\n- Deltarune\n- Survival Kids\n- Kunitsu-Gami: Path of the Goddess\n- Puyo Puyo Tetris 2S\n- Rune Factory: Guardians of Azuma\n- Nobunaga's Ambition: Awakening Complete Edition\n- Fast Fusion\n- Arcade Archives 2 Ridge Racer\n- Suikoden I & II HD Remaster for Nintendo Switch 2 Gate Rune and Dunan Unification Wars\nOut of these launch party titles, we first got a look at Mario Kart World during the big April 2 Nintendo Direct. The latest iteration of the iconic kart racer takes things up a notch by being the first open-world Mario Kart game to date, and it was available on launch day, 2025. The latest kart racer is host to a ton of new tracks, new modes, and even new characters like the Moo Moo Meadows Cow, and a series first with 24 racers hitting the track all at once. The game was available separately for $79.99 / £74.99, and as part of a Nintendo Switch 2 bundle at launch, with a digital copy packed inside.\nThere are a plethora of first-party games planned for the Switch 2, including Super Mario Party Jamboree, which will be receiving its own Switch 2 edition, with Super Mario Party Jamboree Nintendo Switch 2 Edition + Jamboree TV. Other than being a mouthful of a title, the game will have opportunities to use the Nintendo Switch 2 camera (sold separately), the new Joy-Con 2 controller's mouse mechanics, and a ton of new modes and features.\nAdditionally, Metroid Prime 4, and Pokemon Legends Z-A will also be making their way onto the Switch 2. Originally, these games were set to release on the current Switch, as shown off during the March game-focused Nintendo Direct presentation. And they are, but Switch 2 owners will be able to grab 'Enhanced Switch 2' versions of the games by buying upgrade packs. These upgrade packs are also available for The Legend of Zelda: Breath of the Wild and The Legend of Zelda: Tears of the Kingdom, however, the Legend of Zelda upgrades are also included as part of the Nintendo Switch Online + Expansion Pack membership.\nAs far as brand-new Switch 2 exclusives, we also got a look at a return of the big man himself, Donkey Kong, in Donkey Kong Bananza set to release on July 17, 2025, and everyone's favorite pink puffball, Kirby, is returning in Kirby AirRiders, directed by Masahiro Sakurai and due for release on the new handheld later this year.\nThere's also a ton of games set to release on the Nintendo Switch 2 shortly after launch, including some of the biggest upcoming releases originally shown off in the April 2 Nintendo Direct. So far, those with confirmed release dates include:\n- Raidou Remastered: The Mystery of the Soulless Army (19 June)\n- Tamagotchi Plaza (27 June)\n- Donkey Kong Bananza (17 July)\n- Shadow Labyrinth (18 July)\n- No Sleep For Kaname Date (25 July)\n- Story of Seasons: Grand Bazaar (27 August)\n- Wild Hearts S (25 July)\n- Tony Hawk's Pro Skater 3+4 (11 July)\n- Daemon x Machina Titanic Scion (5 September)\n- Pokemon Legends Z-A (16 October)\nWhen it comes to physical games, the carts for the Switch 2 are the same size as the original Switch games - however, now, they're red instead of black to distinguish themselves from what came before. The disgusting taste of the previous Switch game carts has also returned.\nNintendo Switch 2 Accessories\nThe Nintendo Switch 2 has a plethora of official (and licensed) accessories, and we've listed them and their pricing (where available) below:\n- Nintendo Switch 2 Camera ( $54.99 / £49.99)\n- Nintendo Switch 2 Pro Controller ($84.99 / £74.99)\n- Nintendo GameCube (GCN) Controller - Nintendo Classics (£58.99)\n- Joy-Con 2 Charging Grip ($34.99 / £29.99)\n- Nintendo Switch microSD Express Card 256GB for Nintendo Switch 2 ( $59.99 / £49.99)\n- Switch 2 All-In-One Carrying Case ($84.99 / £66.99)\n- Switch 2 Carrying Case and Screen Protector ( $39.99 / £20.99)\n- Joy-Con 2 Wheel (set of two) ( $24.99 / £16.99)\n- Piranha Plant Camera for Nintendo Switch 2 (£34.99)\n- Joy-Con 2 (L) and Joy-Con 2 (R) Controller Set ($94.99 / £74.99)\n- Joy-Con 2 Strap ($13.99)\n- Nintendo Switch 2 AC Adapter ($34.99 / £24.99)\n- Nintendo Switch 2 Dock Set ($119.99)\nThe Nintendo Switch 2 Pro controller, Switch 2 camera, and the GameCube controller were released on June 5, 2025, the same day as the console. Alongside these brand-new peripherals, an official Joy-Con 2 charging grip, Joy-Con 2 wheel (set of two), Switch 2 Carrying Case & Screen Protector, and Switch 2 All-In-One Carrying Case were also released on launch day.\nThe prices of first-party Switch 2 accessories in the US and Canada rose in April 2025, which Nintendo explained is \"due to changes in market conditions.\" The Joy-Con 2 controllers, Switch 2 Pro controller, and the Switch 2 camera all received a $5 price hike. Meanwhile, even the Joy-Con 2 Wheel Set and Joy-Con charging grip also increased in price by $5, while the official Joy-Con 2 strap increased by just $1. Not all accessories were affected, as the prices of the officially licensed microSD Express cards remain unchanged.\nThough there are some exceptions, a lot of original Switch accessories can be used with the upcoming Switch 2, including the original Joy-Con controllers, which can be \"paired wirelessly\" to the Switch 2, which is the same case as the original Switch Pro controller. For a full list of compatible devices, check out the Nintendo Switch and Nintendo Switch 2 Accessory Compatibility list available through the official Nintendo website.\nSam Loveridge is the Brand Director and former Global Editor-in-Chief of GamesRadar. She joined the team in August 2017. Sam came to GamesRadar after working at TrustedReviews, Digital Spy, and Fandom, following the completion of an MA in Journalism. In her time, she's also had appearances on The Guardian, BBC, and more. Her experience has seen her cover console and PC games, along with gaming hardware, for a decade, and for GamesRadar, she's in charge of the site's overall direction, managing the team, and making sure it's the best it can be. Her gaming passions lie with weird simulation games, big open-world RPGs, and beautifully crafted indies. She plays across all platforms, and specializes in titles like Pokemon, Assassin's Creed, The Sims, and more. Basically, she loves all games that aren't sports or fighting titles! In her spare time, Sam likes to live like Stardew Valley by cooking and baking, growing vegetables, and enjoying life in the countryside.\n- Rosalie NewcombeHardware Editor\n- Tabitha BakerManaging Editor - Hardware\n- Emma-Jane BettsManaging Editor, Evergreens\n- Duncan RobertsonHardware Editor\n- Phil HaytonHardware Editor\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.gamesradar.com/games/sony-acquires-16-million-shares-of-bandai-namco-for-around-usd464-million-in-new-partnership-aimed-at-strengthening-engagement-among-anime-and-manga-fans/",
      "text": "Sony acquires 16 million shares of Elden Ring publisher Bandai Namco for around $464 million in new partnership \"aimed at strengthening engagement among anime and manga fans\"\nAnd also \"creating new and emotionally moving experiences\"\nSigning on to a brand-new \"strategic partnership,\" Sony has acquired 16 million shares of Elden Ring publisher Bandai Namco for 68 billion yen – approximately $464 million.\nThe two companies reveal as much in a new statement via Sony's official website, outlining the deal made and what it might mean for future Bandai Namco releases. Following the acquisition of approximately 2.5% of the latter brand's total issued shares, Sony states that the companies will begin to \"focus on expanding the fan community for IP such as anime and manga around the world and strengthening engagement.\"\nThis plan rings true, particularly in the anime field where rapid market growth is anticipated, while merging their strengths to create new and emotionally moving experiences for fans, and as a result of these efforts, maximize the value of IP.\"\nThe announcement also describes how the two \"intend to implement initiatives including the expansion of works as well as products and services based on IP developed by Bandai Namco.\"\nOn the new partnership, Bandai Namco executive vice president Nobuhiko Momoi says the company is \"filled with excitement about the potential to create new entertainment by combining Sony Group's strengths and technological capabilities across various entertainment fields with Bandai Namco's IP axis strategy.\"\nSony chief strategy officer and representative corporate executive officer Toshimoto Mitomo shares similar words.\n\"Through this partnership, we aim to co-create an array of content and experiences that exceed expectations and deliver Kando (emotion) to even more fans,\" writes Mitomo.\nWeekly digests, tales from the communities you love, and more\nThe future certainly looks bright for the two – and judging by Bandai Namco's past anime-aligned releases, like Dragon Ball: Sparking Zero, and its future launches, including Code Vein 2, Sony couldn't have picked a better partner for its plans.\nHere's hoping that, together, Bandai Namco and Sony can add to the ever-growing list of best anime games – I know I'll personally be looking forward to more.\nHere are some of the most exciting new games this year and beyond that you should keep an eye on.\nAfter spending years with her head in various fantastical realms' clouds, Anna studied English Literature and then Medieval History at the University of Edinburgh, going on to specialize in narrative design and video game journalism as a writer. She has written for various publications since her postgraduate studies, including Dexerto, Fanbyte, GameSpot, IGN, PCGamesN, and more. When she's not frantically trying to form words into coherent sentences, she's probably daydreaming about becoming a fairy druid and befriending every animal or she's spending a thousand (more) hours traversing the Underdark in Baldur's Gate 3. If you spot her away from her PC, you'll always find Anna with a fantasy book, a handheld video game console of some sort, and a Tamagotchi or two on hand.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.gamesradar.com/tag/fromsoftware/",
      "text": "FromSoftware\nLatest about FromSoftware\nElden Ring Nightreign's big new challenge is one of the most hated, polarizing bosses in FromSoftware history: \"I wish it was longer and he traveled a full zip code away with every attack\"\nBy Austin Wood published\nNews Some people seem to like Everdark Augur, but its haters are tireless\nCan you play Elden Ring Nightreign solo?\nBy Joel Franey last updated\nGuide Elden Ring Nightreign supports solo play but it's not easy, so you'll need to be prepared\nDoes Elden Ring Nightreign have crossplay? Cross-platform support explained\nBy Josh West last updated\nGuide If you were hoping to play Elden Ring Nightreign cross-platform with your friends, I've got bad news for you\nAfter admitting it kind of forgot about duos, FromSoft finally adds a 2-player mode to Elden Ring Nightreign and adjusts balance based on number of players\nBy Kaan Serin published\nNews 'Expedition Type' is now 'Number of Players'\nHot 25: Summer 2025 Edition\nBy Josh West published\nYour essential guide to the hottest upcoming video games\nLong-awaited Elden Ring Nightreign update adding a 2-player mode to the FromSoftware spin-off has been delayed following tsunami warning\nBy Anna Koselke published\nNews Patch 1.02, which brings duos, is now coming tomorrow\nFromSoftware had one big problem turning an old Dark Souls 3 boss into an Elden Ring Nightreign boss, and apparently it solved it by yeeting him into the sky\nBy Issy van der Velde published\nnews If in doubt, send them into orbit\nAt 10 million copies sold, Elden Ring: Shadow of the Erdtree has one of the highest attach rates in DLC history, rivalling CD Projekt Red's sterling run with The Witcher 3 and Cyberpunk 2077\nBy Issy van der Velde published\nNews Around 1 in 3 players bought it\nWeekly digests, tales from the communities you love, and more"
    },
    {
      "url": "https://www.gamesradar.com/games/action-rpg/elden-ring-nightreign-guide/",
      "text": "Elden Ring Nightreign: Everything you need to know\nSoulslike meets roguelike in Elden Ring: Nightreign, the new FromSoftware epic that's now released\nElden Ring Nightreign is finally here, launching months after it was first announced last year during the Game Awards 2024 showcase. It's safe to say that it's one of the most exciting games in terms of May releases; however, given the fact that Bandai Namco and FromSoftware are venturing into new gameplay territory with this one, you may be wondering if it's the right pick for your gaming library.\nAs a standalone adventure that sees up to three players team up in online co-op to take on various dangers and work together to face the Nightlord, Nightreign takes place in a parallel universe to Elden Ring, set in the new setting of Limveld. You take on the role of Nightfarers, choosing from one of several different characters that each have their own unique abilities and weapons. You can pick from the likes of a Raider, to the archer-type known as the Ironeye, and more. Nightreign is for sure a fresh take on the Soulsborne format, and there are plenty of Elden Ring Nightreign tips for folks to already dig into. However, with the FromSoftware game The Duskbloods to look forward to in the future as well, you may be hesitant to give this game a shot.\nWell, that's where we come in. Below, we've gathered all the information you need to know about Elden Ring Nightreign. From its release, reviews, gameplay, and more, you'll find the latest news and insights right here!\nElden Ring Nightreign release date and reviews\nFromSoftware released Elden Ring Nightreign on May 30, 2025.\nComing just a year after the much-anticipated DLC Shadow of the Erdtree, we weren't expecting the co-op extravaganza to land so soon; however, it's already proven to be one of the most exciting (and surprisingly divisive) new games for 2025.\nCurrently, Elden Ring Nightreign has mixed reviews on Steamwith players finding the game fun but frustrating due to limited matchmaking options. In our Elden Ring Nightreign review, author Will Sawyer writes: \"Elden Ring Nightreign is certainly an odd game, and one that will mainly appeal to only the most hardcore of Elden Ring fans.\"\nWe are keen to see how the game evolves in the future and to see how perceptions may shift as more players pick up this title. So stay tuned for updates.\nWeekly digests, tales from the communities you love, and more\nElden Ring Nightreign platforms\nElden Ring Nightreign is on PC, PS5, PS4, Xbox Series X, and Xbox One as of May 30, 2025. The great news is that you won't need to own a copy of Elden Ring to access this cooperative experience with your friends, as it is a standalone adventure.\nWhile the new multiplayer experience is landing on multiple platforms, it's unfortunately been confirmed that there will be no Elden Ring Nightreign cross-play support. But with it on current-gen and last-gen consoles, it allows for cross-generation support, meaning PS4 players can battle alongside PS5 players, and Xbox One players can join up with Xbox Series X/S players.\nElden Ring Nightreign trailer\nWhat is Elden Ring Nightreign?\nElden Ring Nightreign is a three-player co-op game, a standalone spin-off adventure set in a universe parallel to the events of Elden Ring. You'll join two friends at the Roundtable Hold and then head off into the setting of Limveld, a country that \"once thrived thanks the power of the gods\" but is now \"nearing it's end\". Within it, you'll be fighting together with other players to survive three day-and-night cycles. Outlast the day, and you'll need to contend with the coming Night's Tide, which shrinks the map until you're left with no option but to battle one of many different Elden Ring Nightreign bosses.\nThe world becomes progressively more challenging across each of the three days, culminating in a battle with the Nightlord himself. FromSoftware says you can opt to play Elden Ring Nightreign solo, but there is strength in numbers.\nElden Ring Nightreign isn't Elden Ring DLC\nElden Ring Nightreign isn't a DLC, it's a standalone adventure. Publisher Bandai Namco has also confirmed that it won't be free-to-play and that it isn't a premium-priced experience either. However, saying that, the game isn't exactly cheap either. Nightreign costs $39.99/ £34.99 for its standard edition and $54.99/£47.99 for the deluxe edition.\nAs this is standalone, it's unlikely that any progression or items will carry over from Elden Ring or Shadow of the Erdtree. So keep that in mind before finalizing your purchases.\nElden Ring Nightreign characters\nElden Ring Nightreign is a departure from the classic FromSoftware model. You won't be able to create a character from scratch, and will instead choose from one of eight unique Elden Ring Nightreign characters. Known as Nightfarers, each one has their own fighting styles, unique abilities, and ultimates, fulfilling a fairly typical class role, be it fighter, mage, or assassin.\nAs you head into the realm of the Nightlord, you'll need to work together with two other players to ensure a balanced party – collaborating to take down powerful foes and venture into more dangerous parts of the open-world Limveld map. You'll be able to customize the appearance of your character in Elden Ring Nightreign by unlocking skins, and you'll be able to upgrade your equipment by unearthing special relics.\nBandai Namco has released a series of character trailers, with details about each Nightfarer's abilities, which are as follows:\n- Raider: a \"powerful sea-farer\" who wields big weapons and makes use of a defensive character skill to reduce incoming damage.\n- Ironeye: an archer with \"pinpoint accuracy\" who uses their skills with a bow to mark enemies, observe their surroundings, and deliver powerful shots.\n- Duchess: a character skilled in evasion and uses quick, agile moves to effectively dodge attacks and hide from enemies.\n- Recluse: A witch-like character that wields cursed magics that allows them to use powerful spells and invoke a blood chant to brand enemies.\n- Wylder: A character with \"well-balanced abilities who can make use of a grappling claw to draw in enemies, or deliver a powerful hit with an iron stake.\n- Guardian: An eagle-like warrior-type character with high defensive abilities who wields a shield, and can perform a whirlwind move.\nElden Ring Nightreign gameplay\nElden Ring Nightreign gameplay is markedly different to the original Elden Ring. Where that experience dropped you into a sprawling open-world and left you well enough alone to figure out how to proceed, Elden Ring Nightreign is more focused. It's a session-based game, allowing you and two friends to launch into Limveld, the layout of which changes each time to step into it, and attempt to outlast three full day-and-night-cycles.\nAs you explore the land and battle enemies together you'll uncover more powerful weapons and better rune and relic rewards – used to upgrade your equipment and abilities. Sites of Grace can be located throughout the shrinking map too, giving you a chance to level up and gain crucial power for the session.\nLeveling is different in Elden Ring Nightreign versus its single-player counterpart. You won't be investing runes into individual stats, but rather into entire levels which increase your character stats across the board.\nNightreign has eight characters to choose between and stat expansion is different for each of them. Character stat progression doesn't carry across between sessions – meaning that regardless of whether your group succumbs to the dangers of Limveld or is able to defeat the Nightlord, you'll always begin a new adventure back at level one.\nThere is however progression in the form of Relics – earned through both successful and unsuccessful runs – which provide massive bonuses, impacting everything from exploration to your equipment.\nAs the Elden Ring Neighreign overview trailer details, each time you step into Limveld, you can choose to hunt enemies to increase your level, search for treasure to secure more weapons and armor, or infiltrate bases to gather information from operational maps hidden within, or take on powerful boss-like enemies roaming the lands to get your hands on rewards.\nThere's also a base for Nightfareres known as Roundtable Hold, where you can prepare for battle. Here you can equip relics (that alter your stats and skills), and use the Fitting Mirror, which is where you can unlock special costumes and change up the appearance of your Nightfarer - and yes, there's even some costumes from Dark Souls and Bloodborne in the mix.\nWe also got a look at a small Jar merchant that we can find in \"a corner of the back room\", according to the official Elden Ring Nightreign website. Operating a bazaar that sells \"various goods\", you're able to spend any currency known as \"Murk\" that we earn as battle rewards.\nCuriously, as we fight against the night and take on the foes that inhabit the land, we also recover \"fragments\" of \"lost memories\" that will allow us to get a better picture of our chosen Nightfarer's recollections. The conversations we discover within the memories might even reveal a new objective for us to take on in Limveld.\nGamesRadar+'s senior writer Austin Wood said it \"feels like a modded version of FromSoftware's best game ever\" in our Elden Ring Neightreign hands-on preview, which is well worth checking out if you want to get a first-hand feel of what's in store.\nElden Ring Nightreign combat\nThe Elden Ring Nightreign combat experience builds on the baseline Elden Ring experience, but there are some notable differences. With the character creator gone, there are eight builds to choose between as you load into a session, each with its own equipment, weapons, and proficiencies. From the gameplay footage we've seen so far, it's the combination of the three characters that unlocks the best opportunities in Elden Ring Nightreign, with tank, DPS, and support builds coming together to tackle big challenges.\nThere's some subtle changes too, with fall damage removed from the experience, and movement sped up to allow faster exploration and navigation as you combat a shrinking map. Otherwise, you should expect Elden Ring Nightreign to handle similarly to the original Elden Ring, with the controls and core combat mechanics returning.\nIt's also been revealed that Elden Ring Nightreign features a different kind of revival system that will see you actually attack incapacitated teammates to bring them back into the fray. Game director Junya Ishizaki explained the decision to include this unique take on reviving in an official PlayStation blog:\n\"As we were tossing around ideas, we realized that 'attacking' is the most consistent element of Nightreign's gameplay,\" Ishizaki says. \"We tested to see if it would work for resuscitation, and we discovered a wide variety of tactics depending on range, frequency, and probability, so we formally implemented it. We also found it quite amusing.\"\nElden Ring is one of the best action games ever made, but only time will tell if this co-op spin-off will be considered one of the best online games in today's market.\nJosh West is the Editor-in-Chief of GamesRadar+. He has over 15 years experience in online and print journalism, and holds a BA (Hons) in Journalism and Feature Writing. Prior to starting his current position, Josh has served as GR+'s Features Editor and Deputy Editor of games™ magazine, and has freelanced for numerous publications including 3D Artist, Edge magazine, iCreate, Metal Hammer, Play, Retro Gamer, and SFX. Additionally, he has appeared on the BBC and ITV to provide expert comment, written for Scholastic books, edited a book for Hachette, and worked as the Assistant Producer of the Future Games Show. In his spare time, Josh likes to play bass guitar and video games. Years ago, he was in a few movies and TV shows that you've definitely seen but will never be able to spot him in.\n- Emma-Jane BettsManaging Editor, Evergreens\n- Heather WaldSenior staff writer\n- Jasmine Gould-WilsonStaff Writer, GamesRadar+\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.gamesradar.com/games/action-rpg/elden-ring-nightreign-is-an-extension-of-fromsoftwares-philosophy-director-says-not-a-revision-were-always-looking-to-make-something-valuable-in-our-games-something-that-feels-worthwhile/",
      "text": "Elden Ring Nightreign is an extension of FromSoftware's philosophy, director says, not a revision: \"We're always looking to make something valuable in our games, something that feels worthwhile\"\nThe immediate future of FromSoftware just has a little more multiplayer in it\nJunya Ishizaki is, understandably, a little nervous. After working at FromSoftware as a combat and level designer since the original Dark Souls, he's made his directorial debut with Elden Ring Nightreign, an off-the-walls spinoff of the studio's open-world masterwork, distilled and almost kitbashed into a session-based, three-player boss gauntlet. It's a weird one – about as quick-and-dirty as game development gets at this level – but exciting. \"Personally,\" Ishizaki tells me over a Zoom call from Japan (via interpreter), \"I feel confident about this game that we've made.\"\nWhen I speak with him ahead of launch, Ishizaki seems contemplative. I ask him to walk me through the very beginnings of this game, which he's been thinking about since development on Dark Souls 3. Elden Ring, in all its hugeness, gave him the foothold he needed. He never thought he'd be the one directing it, let alone that FromSoftware boss and Souls maestro Hidetaka Miyazaki would specifically push for him to take the reins.\nA new challenge\n\"To have that opportunity finally presented to me, I was frankly very excited, and I couldn't believe that this opportunity had finally come,\" he says. \"So it was extremely exciting, but at the same time, of course, you feel, wow, is this really happening? Is this really something I'm going to do? Is this really something I can do? So again, mixed portions of excitement and nerves, but I'm extremely honored and happy to have been given that chance.\"\nIshizaki says he'd love to direct again, especially now that he's gotten more of a feel for the role. At the start, he thought he might have \"full control\" over everything as director. He soon realized yet again that \"games these days are way too big in scope, and it quickly became important to me to suppress my own emotions and ego and take input from all sorts of parts of the team and project.\" He reflects on the \"fork in the road\" of the game's pacey three-day structure, which prompted \"some concerns\" within the studio at first, and it seems he's also been feeling out how to find what a game \"wants to be.\"\n\"From conception to finding the idea of what the game wants to be and what I feel it should be, there are a lot of difficulties, and there's a lot of points you have to overcome in order to accept that,\" he says. \"You have to go into these things being prepared to explain your ideas to the team and to sort of overcome these difficulties. But during that process, there come these moments where you find something that just feels pure fun, and you just have to try to lock into that. It's an ongoing process that occurs every day.\n\"Every day you try to find something new and something fun to lock into, something that's giving you that idea and that motivation to keep going. So this is kind of how I feel the process went with Nightreign, and we'll see how it pans out for a future project.\"\nMore multiplayer\nFromSoftware, it seems, has locked onto something new. Nightreign gained new meaning after the reveal of The Duskbloods, the studio's Nintendo Switch 2-exclusive PvPvE title due in 2026. Another multiplayer-focused game, so soon? Some fans, who are specifically here after the studio's string of single-player triumphs, were perplexed or concerned.\nWeekly digests, tales from the communities you love, and more\nIshizaki, an outspoken fan of multiplayer, reiterates what Miyazaki said previously: FromSoftware isn't changing its DNA by dabbling more in multiplayer. Nightreign is an extension of the studio's design philosophy, not a rejection of it.\n\"Of course, I can't personally speak to what FromSoftware as a company might make in the future,\" he begins, \"but in terms of the types of experiences we're all aiming to create, we're always looking to make something valuable in our games, something that feels worthwhile to play, that you come away from it and feel satisfied like that was a good use of your time. And I think that's the crux of what makes our titles and what we keep in mind with everything we develop.\n\"We've had these two titles, Nightreign and the recently announced Duskbloods, with multiplayer at their core. But that's not necessarily to say that we are leaning in that specific direction going forward. I think this is simply a result of ideas and interests taking shape in the company across various departments and various titles. I think there's a little bit of serendipity involved there. But personally, I feel that multiplayer is a very interesting aspect to explore, and I think users will find that both these titles are very different and something else to enjoy along with our back catalog.\"\nDespite reusing many assets, even Nightreign is meaningfully different. It treats Elden Ring \"as a base,\" Ishizaki reckons, but you don't need to play the original game before diving in here. \"We feel that the gameplay is a key part of Nightreign that differentiates it from Elden Ring, as well as our other previous Soulslike titles,\" he says. \"If you're familiar with Elden Ring, you might have some preconceptions going in and some ideas of what to expect, but it's ultimately a very different experience, and we're excited for new players to jump in and make this their first FromSoft game.\"\nWhat's next\nEspecially after the sky-high success of Elden Ring, which just recently topped 30 million copies sold, there was a reasonable expectation that FromSoftware would double down. It felt like the capstone of Souls games, and clearly this kind of game can soar. Surely there are more coming. And there are, surely, more coming; Nightreign and The Duskbloods just come first. Ishizaki says \"I am sure there's still many things that we're looking to challenge and experiment with in future. So we look forward to the continued support and blessings of players and media alike.\"\n\"This is a condensed RPG,\" Ishizaki concludes. \"There's a short time span in which a lot of exhilarating and dramatic events can happen. We wanted this to be the focus of Nightreign, to create these dramatic and dynamic play sessions, and to have all of these emotions and these peaks and troughs occur during any one single session. This was a challenge for us to make in this short time span, as well. But we hope that users will appreciate this new challenge and appreciate this new game flow with Nightreign. We're really looking forward to it.\"\nOur Elden Ring Nightreign review arrived alongside dozens of others calling it a well-executed idea held back by a punishing solo experience. The scores are pretty good across the board. Nightreign has settled as the lowest-rated FromSoft game in several years, but that ain't bad for an experimental project competing with some of the most acclaimed games in the industry.\nAfter playing an early build of Nightreign, I'm personally excited for launch today, May 29. (Our Elden Ring Nightreign live coverage has all the unfurling details in one place.) Assuming the servers hold – Ishizaki laughs out loud when I ask about plans for worst-case scenarios, but says they've prepped all they can for the launch rush – the multiplayer buff, the peerless fun multiplier of playing with friends, could bump this game up a notch provided you've got buddies to spare. There's always matchmaking if you don't. And FromSoftware has largely made the same type of game for over a decade, so I'm thrilled to see it step outside the box a little, even if the box is still comfortably in The Lands Between.\nElden Ring Nightreign release time – FromSoftware's new co-op roguelike is almost here.\nAustin has been a game journalist for 12 years, having freelanced for the likes of PC Gamer, Eurogamer, IGN, Sports Illustrated, and more while finishing his journalism degree. He's been with GamesRadar+ since 2019. They've yet to realize his position is a cover for his career-spanning Destiny column, and he's kept the ruse going with a lot of news and the occasional feature, all while playing as many roguelikes as possible.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.gamesradar.com/games/action-rpg/elden-ring-nightreign-passes-2-million-sales-on-its-first-day-despite-a-mixed-steam-rating-and-some-of-fromsoftwares-lowest-critic-scores-in-years/",
      "text": "Elden Ring Nightreign passes 2 million sales on its first day, despite a \"Mixed\" Steam rating and some of FromSoftware's lowest critic scores in years\n\"Thank you for your support\"\nElden Ring Nightreign might not have received the same barrage of glowing review scores like Elden Ring did before it, but that's not stopped it from flying off the shelves. In fact, less than 24 hours after launch, FromSoftware's new co-op romp has already sold two million copies.\nThis was announced over on the official Elden Ring Twitter account, where it proclaims: \"Darkness fell over Limveld, and two million Nightfarers rose up against it. Thank you for your support.\"\nAlthough the post focuses on the number of players rather than copies sold, since Nightreign isn't on any subscription services like Xbox Game Pass or PlayStation Plus, you can be sure that every one of those loyal Nightfarers is someone who's actually paid for the game.\nDarkness fell over Limveld, and two million Nightfarers rose up against it. Thank you for your support. #ELDENRING #NIGHTREIGN pic.twitter.com/VEUbLp5xiDMay 30, 2025\nOn one hand, this isn't hard to believe. It's a new FromSoftware title, after all, and a spin-off to a phenomenal game that's sold over 30 million copies. But on the other hand, the situation around this one is a bit different. It's a co-op-focused release – one that specifically wants players to set out in groups of three, with pairs not allowed – which, as reflected by the many posts from duos looking for a third player to round out their team, is already proving to be a bit of an issue.\nAnd its reviews haven't exactly been without their criticism, either. When it debuted on Metacritic with an average critic score of 78, it was already FromSoftware's lowest-scored game in seven years, and it's since dropped another point to 77 (at least for its more frequently rated PS5 version).\nNightreign's Steam reviews aren't looking so great, either. The \"Mostly Positive\" rating it launched with has dropped further throughout the day, and it now has a \"Mixed\" average score with 65% positive ratings. At least it's bringing in a lot of players, though, with a concurrent player peak of 313,593 hit almost right out of the gate.\nClearly, though, none of those things have proven problematic enough to halt its day-one sales. This is just the start for Nightreign – it already has another new patch on the way next week, which promises to improve the experience for any solo players.\nWeekly digests, tales from the communities you love, and more\nWhile you're here, be sure to take a look at our Elden Ring Nightreign review, as well as out list of new games for 2025 and beyond for more upcoming releases.\nI'm GamesRadar+'s Deputy News Editor, working alongside the rest of the news team to deliver cool gaming stories that we love. After spending more hours than I can count filling The University of Sheffield's student newspaper with Pokemon and indie game content, and picking up a degree in Journalism Studies, I started my career at GAMINGbible where I worked as a journalist for over a year and a half. I then became TechRadar Gaming's news writer, where I sourced stories and wrote about all sorts of intriguing topics. In my spare time, you're sure to find me on my Nintendo Switch or PS5 playing through story-driven RPGs like Xenoblade Chronicles and Persona 5 Royal, nuzlocking old Pokemon games, or going for a Victory Royale in Fortnite.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.gamesradar.com/tag/sony/",
      "text": "Sony\nLatest about Sony\nIntergalactic: The Heretic Prophet – Everything we know about the new Naughty Dog game\nBy Josh West last updated\nGuide All the latest Intergalactic news and updates from the developer of The Last of Us\nThe fact that you can still buy 19 inches of Venom with the Spider-Man 2 Collector's Edition has my Spidey sense tingling\nBy Rosalie Newcombe published\nNews With great power comes great responsibility of trying not to unload my cash to buy the Marvel's Spider-Man 2 Collector's Edition two years after release just to get the Venom statue.\nMarvel Rivals season 3.5 has landed, and I'm already prepared thanks to these 4 fantastic PS5 accessories\nBy Rosalie Newcombe published\nNews I cannot wait to waste away the hours playing the new 3.5 season of Marvel Rivals this weekend with these top-tier PS5 accessories.\n10 days after Sony sued over Tencent's allegedly \"slavish\" Horizon Zero Dawn clone, its Steam page has been scrubbed of robot mastodons and Aloy lookalikes\nBy Dustin Bailey published\nNews I guess the lawsuit has already had some effect\nThis Lexar PS5 SSD has saved me from making the error of buying an entirely new Sony console, but I wish it was available in the UK\nBy Rosalie Newcombe published\nReview Lexar's new 4TB PS5 SSD has breathed new life into my aging launch model Sony console, but UK Sony players have to look elsewhere.\nThe best PS5 bundles and deals in August 2025\nBy Tabitha Baker last updated\nDeals Looking for the best PS5 price and deals? We've got you covered with updates on PS5 bundles too.\nUpcoming PS5 games: New PS5 games for 2025 and beyond\nBy Sam Loveridge, Emma-Jane Betts last updated\nUpcoming With so many upcoming PS5 games to keep track of in August and beyond, this list does the remembering for you\nAmid Marathon's ongoing struggles and Concord's closure after just 2 weeks, Sony admits the whole PlayStation live service strategy thing isn't \"entirely going smoothly\"\nBy Anna Koselke published\nNews It's all about the \"longer-term perspective,\" though\nMarathon: Everything we know so far about the upcoming game\nBy Josh West last updated\nGuide Bungie's new extraction shooter reboot Marathon has been delayed out of its previous September date\nSony says Bungie's \"independence is getting lighter\" as it aims to launch the Destiny 2 studio's troubled new FPS Marathon before April 2026: \"We are now fixing the problems, so we believe this launch will happen\"\nBy Catherine Lewis published\nNews It's still expected that we'll get a launch update this Fall\nWeekly digests, tales from the communities you love, and more"
    },
    {
      "url": "https://www.gamesradar.com/tag/bandai-namco/",
      "text": "Bandai Namco\nLatest about Bandai Namco\nThe 25 best fighting games you can play right now\nBy Josh West last updated\nBest List The best fighting games to play in 2025 will have you pulling all the punches\nElden Ring Nightreign's big new challenge is one of the most hated, polarizing bosses in FromSoftware history: \"I wish it was longer and he traveled a full zip code away with every attack\"\nBy Austin Wood published\nNews Some people seem to like Everdark Augur, but its haters are tireless\nAfter 23 years, Pac-Man World 2 is back – I don't know if this 73 Metacritic PS2 underdog really needed a remake, but I'm happy it's getting one\nBy Dustin Bailey published\nNews Let's hear it for the 7/10 sleepers of days past\nLong-awaited Elden Ring Nightreign update adding a 2-player mode to the FromSoftware spin-off has been delayed following tsunami warning\nBy Anna Koselke published\nNews Patch 1.02, which brings duos, is now coming tomorrow\nFromSoftware had one big problem turning an old Dark Souls 3 boss into an Elden Ring Nightreign boss, and apparently it solved it by yeeting him into the sky\nBy Issy van der Velde published\nnews If in doubt, send them into orbit\nSony acquires 16 million shares of Elden Ring publisher Bandai Namco for around $464 million in new partnership \"aimed at strengthening engagement among anime and manga fans\"\nBy Anna Koselke last updated\nNews And also \"creating new and emotionally moving experiences\"\nThe best retro remakes and reboots out there aren't afraid to get weird with it – as Shadow Labyrinth being a dark and gritty Pac-Man game shows us\nBy Joel Franey published\nBest List Pac-Man recreated as a D&D warlock patron has me thinking back to the best retro remakes and out-there reboots from gaming history\nI hope you're ready for round 2, because Elden Ring Nightreign is bringing back 3 weeks of mega-bosses – except this time they come in pairs for more varied pain: \"F*** my life\"\nBy Ashley Bardhan published\nNews Ow, ow, ow, ow\nWeekly digests, tales from the communities you love, and more"
    }
  ],
  "argos_summary": "Bandai Namco reported significant growth in net sales and operating profit, largely driven by its digital segment, particularly from the success of Elden Ring Nightreign, which shipped 5 million copies shortly after its release. The company also highlighted a strategic partnership with Sony, aimed at expanding engagement with anime and manga IPs globally. Despite mixed reviews for Nightreign, it achieved impressive sales figures, indicating strong player interest in the franchise.",
  "argos_id": "MWUEL9HYC"
}