{
  "url": "https://finance.yahoo.com/video/2-reasons-strategist-glass-half-210805883.html",
  "authorsByline": "Yahoo Finance Video",
  "articleId": "df68157365164a05a2cafdf38447eaf8",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://s.yimg.com/ny/api/res/1.2/YOAmJ7m.VGjLrcF_Pk36lg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzY-/https://s.yimg.com/os/creatr-uploaded-images/2025-08/1a6bb710-76f4-11f0-9f1e-846c44239892",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T21:08:05+00:00",
  "addDate": "2025-08-11T22:02:54.727512+00:00",
  "refreshDate": "2025-08-11T22:02:54.727513+00:00",
  "score": 1.0,
  "title": "2 reasons this strategist has a 'glass half-full' view on stocks",
  "description": "Earnings breadth is giving the market (^GSPC, ^IXIC, ^DJI) a boost beyond just Big Tech. SEI chief investment officer Jim Smigiel explains why signs of growth in financials and industrials support a positive outlook for markets, even as artificial intelligence (AI) remains the dominant market driver. To watch more expert insights and analysis on the latest market action, check out more Market Domination Overtime.",
  "content": "There's two things with earnings which, uh, we find, uh, uh, really having ourselves have a glass half full, uh, kind of outlook for the market right now. It's not just that they've been so strong, but they've also been relatively broad. Over 80% of the S&P 500 are showing kind of some earnings momentum over the last three months. That's a really, really good sign for us because we do have kind of this little bit of a divergence going on, particularly in US markets, where we still have the MAG 7, particularly Nvidia now hitting over 8% market cap within the S&P, the highest in recent memory of any kind of single name. But we have a little bit of this bubbling up of earnings kind of happening kind of below the surface with some financials, some, uh, industrials. So there's, uh, still that concentration, that big AI theme which is dominating, uh, everything. We saw a lot of the CapEx spend of the recent announcements from Microsoft, from Meta, kind of dominating the headlines. Uh, but really the trend is your friend. That's, uh, that's kind of where we've been. We have, uh, again a positive outlook mostly because we do see some broadening out of earnings, some early signs of that, uh, bubbling up in the market.\n\nAnd that's been fueling a lot of the records that we've seen, but you brought up tech AI and Bank of America. They released their latest global fund manager survey this morning, and it shows that long mag 7 is still the most crowded trade, but 55% say that AI is boosting productivity. Most managers not seeing a bubble yet. How do you interpret this? Are investors too optimistic or is this justified given the tech sector's solid fundamentals?\n\nWell, the BFA is exactly correct. I mean, this is the theme of all themes right now. Everything trades on AI for for the most part. You know, we there's there's even a little bit of divergence between, you know, what we do see as some softening economic data, particularly on the employment side, obviously, with the recent release, and just the absolute resilience in the tech market. And one does begin to wonder, uh, is the S&P and US markets kind of separating a little bit from the economy because of the dominance of AI? But to your point specifically, I mean, let's roll back a little bit and think about that, the latest Microsoft release. I mean, you know, Microsoft announced that about 30% of all coding is kind of being done now by AI. That's that's an amazing number. So this isn't necessarily something that we're looking really far into the future and hoping for some efficiencies to manifest themselves. We are seeing the impact of it right now. So, uh, it is definitely a dominant theme, but it's one that we think has has legs and and will be continuing, uh, really for the rest of 2025.",
  "medium": "Video",
  "links": [],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "tech AI",
      "weight": 0.0879344
    },
    {
      "name": "US markets",
      "weight": 0.08449369
    },
    {
      "name": "AI",
      "weight": 0.07816023
    },
    {
      "name": "recent memory",
      "weight": 0.07460213
    },
    {
      "name": "earnings",
      "weight": 0.070717916
    },
    {
      "name": "Microsoft",
      "weight": 0.059717853
    },
    {
      "name": "S&P",
      "weight": 0.057622977
    },
    {
      "name": "Most managers",
      "weight": 0.056089003
    },
    {
      "name": "long mag",
      "weight": 0.054642666
    },
    {
      "name": "a little bit",
      "weight": 0.05369441
    }
  ],
  "topics": [
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.9921875
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.98095703125
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.90283203125
    }
  ],
  "sentiment": {
    "positive": 0.29915062,
    "negative": 0.33748537,
    "neutral": 0.36336404
  },
  "summary": "The strategist for the Financial Services Department has a positive outlook for the stock market, noting that over 80% of the S&P 500 are showing some earnings momentum over the last three months, despite a significant divergence in US markets, particularly in the MAG 7, which saw Nvidia reach over 8% market cap within the S-P, the highest in recent memory of any major name. The strategist also noted that the focus on AI is a dominant theme in all sectors, with a recent Microsoft release revealing that about 30% of all coding is being done by AI. However, he questioned whether the dominance of AI in the US and the future of the tech sector is justified given their solid fundamentals.",
  "shortSummary": "Despite strong earnings and strong economic conditions, the outlook for stock market is optimistic, driven by a broadening AI theme and continued market growth.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "76230da25ded4adea9a458ecbf998b95",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "The earnings outlook for the market is positive, with over 80% of the S&P 500 showing earnings momentum, indicating broad strength despite some concentration in major tech stocks like Nvidia. The Bank of America's global fund manager survey highlights that 55% of managers believe AI is enhancing productivity, with many not perceiving a bubble in the tech sector. This suggests that while there are signs of economic softening, the tech market, particularly driven by AI advancements, remains resilient and is expected to continue its growth through 2025.",
  "argos_id": "N2TGC2F46"
}