{
  "url": "https://www.nytimes.com/athletic/6548004/2025/08/12/brendan-donovan-pinch-hit-double-cardinals-rockies/",
  "authorsByline": "Katie Woo",
  "articleId": "447ca969adf64bb7b9a7bd3adf35f4f4",
  "source": {
    "domain": "nytimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "AZ",
      "county": "Pima County",
      "city": "Tucson",
      "coordinates": {
        "lat": 32.1988848,
        "lon": -110.8218543
      }
    }
  },
  "imageUrl": "https://static01.nyt.com/athletic/uploads/wp/2025/08/12010014/GettyImages-2228956106-scaled.jpg?width=1200&height=630&fit=cover",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T05:11:31+00:00",
  "addDate": "2025-08-12T05:23:25.346817+00:00",
  "refreshDate": "2025-08-12T05:23:25.346819+00:00",
  "score": 1.0,
  "title": "Brendan Donovan’s go-ahead, pinch hit double latest spark for scrappy Cardinals",
  "description": "After a dismal July, the Cardinals have strung together wins despite a depleted bullpen and a limited bench.",
  "content": "ST. LOUIS — Brendan Donovan had every intention of returning to the St. Louis Cardinals’ lineup Monday. The team’s lone All-Star had missed two games with nagging groin discomfort but was hopeful he’d be available — even for one at-bat — in Monday’s series opener against the Colorado Rockies.\n\nHe sure picked the right time.\n\nWith St. Louis trailing 2-1 in the bottom of the eighth, Cardinals manager Oli Marmol turned to Donovan to pinch hit for catcher Pedro Pagés with two runners on and one out. The skipper was encouraged by Donovan’s pregame work but did not make a final decision on his availability until just before first pitch. When Marmol saw his team in a prime scoring spot, he didn’t hesitate.\n\nDonovan emerged from the dugout, worked a 1-2 count off Rockies reliever Juan Mejia, and then promptly drilled a two-run, go-ahead double to right field to give the Cardinals a 3-2 lead. Thanks to another stellar outing from Kyle Leahy — who posted 2 1/3 scoreless frames in relief of Miles Mikolas’ quality start — that one-run lead held. St. Louis beat Colorado for its sixth win in its last 10 games and moved to just three games out of the final National League wild-card spot.\n\nNot too shabby for a team that traded its top three relievers and pledged its focus to the future less than two weeks ago.\n\n“Even though we did sell at the deadline, you still don’t lose belief,” Donovan said. “If you lose belief, you have nothing. And I think that’s one thing that this team has done a really good job of is responding. Very cool tonight to see that.”\n\nAfter a dismal July that sank their chances of adding to the roster, the Cardinals have strung together wins despite a depleted bullpen and a limited bench. The team is without Nolan Arenado (shoulder strain) indefinitely and traded its closer, top setup man and a key left-handed reliever. It has also seen its roster jam to the point where its opening day starting catcher is seeing reps in left field. Maneuvering through the logistics of the roster has been complicated for Marmol, who must try to field his best nine each game while also finding sufficient playing time for a slew of players the front office is evaluating for next season and beyond.\n\nMarmol has had to change his managerial strategy to make this happen. His players have had to respond accordingly. Both have done so — and it’s led to a surprising surge. Dating back to the deadline, the Cardinals have taken series victories over the Los Angeles Dodgers and Chicago Cubs. But Monday’s win was arguably this month’s most impressive yet, due to how the late innings were navigated.\n\nSt. Louis entered play knowing Donovan would only be available in a needed at-bat. Its bench became shorter when Lars Nootbaar departed in the top of the sixth with a left knee contusion, sustained after fouling a ball off his leg in the third. X-rays were negative for Nootbaar, who is considered day to day. Jordan Walker took over for Nootbaar in right field, leaving backup catcher Yohel Pozo and outfielder Garrett Hampson as the only two full-time replacements.\n\nThe bullpen wasn’t much better. Both JoJo Romero and Riley O’Brien were unavailable after their usage over the weekend, leaving Leahy as the highest-leverage reliever. St. Louis was aided immensely by Mikolas, who allowed two earned runs over 6 2/3 innings, to create an optimal lane for Leahy from the seventh inning.\n\nThat’s where the coaching staff’s navigation and the players’ execution truly came into play.\n\nBefore the deadline, Marmol and pitching coach Dusty Blake had created consistent roles for their relievers. With Romero the only left-handed reliever on the roster, that can no longer be the case. Marmol also didn’t want to use Donovan in the field Monday, and preferred to deploy him only for a pinch hit opportunity with the game on the line.\n\nThings changed quickly when the Cardinals started to rally. Leahy emerged from the seventh unscathed and followed up with a shutdown eighth inning, punctuated by back-to-back strikeouts to end the frame. Nolan Gorman worked a key one-out walk in the bottom half of the inning and advanced to second on Thomas Saggese’s third hit of the night. This was when Marmol decided to empty his bench, knowing it would mean Donovan would need to play defense in the ninth.\n\nHampson pinch ran as the lead runner for Gorman, and Donovan took the at-bat for Pagés, advancing to third on the throw home. When the Cardinals took a one-run lead, Marmol weighed the options in his bullpen, determined Leahy to be the best option (even though it would mean a third inning of work) and went for adding an insurance run over relying on defense, an uncharacteristic move. Marmol pinch hit Pozo for Victor Scott II, who roped a 105 mph liner right to third baseman Kyle Karros, who doubled off Donovan to end the inning.\n\nHampson took over for Scott in center field, Saggese moved to third base in lieu of Gorman, and Donovan took over second base for the ninth. Leahy pitched around a two-out single to secure his third win of the season. It was not how Marmol usually manages his one-run leads, but a different roster means different decisions.\n\n“We veered a little bit from what we’ve done all year,” Marmol said. “We take the lead there, we typically leave Scott in the game as our best defense. With no Romero and no O’Brien, knowing Leahy is going to go back out in a one-run game, I’m trying to add one more run, let Pozo take that at-bat and make it a two-run game.\n\n“We took our shot, and we’re OK with Donovan playing defense if we can get the win. Glad it worked out that way.”\n\nWhile asking a bullpen arm to log more than two innings can be a tall order, Marmol felt comfortable riding with Leahy, who has grown accustomed to longer relief outings.\n\n“He was efficient, he looked good and I trust him,” Marmol said. “Especially in that moment, a one-run game, nothing’s going to speed this kid up. We felt good with the other guys down with him being the guy to go back out and finish that game.”\n\nThe Cardinals feel good about a lot of things, and all things considered, they should. The expectations externally have been lowered, but internally, the daily grind remains the same. Much can happen within the final seven weeks of the regular season, and the Cardinals are in no way declaring themselves a playoff team. But they continue to play compelling baseball in what could have been a lost second half of the season.\n\n“There are a lot of young guys in this locker room that have tremendous amounts of fight in them and tons of heart,” Mikolas said. “We’re not giving up no matter what anyone else is going to throw our way. We have athletic guys making great plays, hitting, running the bases, having fun. And I think as long as we have fun, we’re pretty dangerous.”",
  "medium": "Article",
  "links": [
    "https://twitter.com/UncleCharlie50/status/1954243630933443019?ref_src=twsrc%5Etfw",
    "https://twitter.com/Cardinals?ref_src=twsrc%5Etfw",
    "https://twitter.com/Cubs?ref_src=twsrc%5Etfw",
    "https://www.nytimes.com/athletic/6535825/2025/08/05/stl-cardinals-roster-playing-time-development/",
    "https://t.co/BTVSkAwL1E",
    "https://twitter.com/Cardinals/status/1955085742058651941?ref_src=twsrc%5Etfw"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Cardinals manager Oli Marmol",
      "weight": 0.06960113
    },
    {
      "name": "Donovan",
      "weight": 0.064978525
    },
    {
      "name": "Brendan Donovan",
      "weight": 0.06448519
    },
    {
      "name": "Oli Marmol",
      "weight": 0.05969552
    },
    {
      "name": "Marmol",
      "weight": 0.059431266
    },
    {
      "name": "Kyle Leahy",
      "weight": 0.05751507
    },
    {
      "name": "Cardinals",
      "weight": 0.05541731
    },
    {
      "name": "scrappy Cardinals",
      "weight": 0.055277046
    },
    {
      "name": "left field",
      "weight": 0.05345233
    },
    {
      "name": "Leahy",
      "weight": 0.05272262
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.97998046875
    },
    {
      "name": "/Sports/Team Sports/Baseball",
      "score": 0.9482421875
    }
  ],
  "sentiment": {
    "positive": 0.16903183,
    "negative": 0.50519055,
    "neutral": 0.32577762
  },
  "summary": "The St. Louis Cardinals have won their sixth consecutive game against Colorado, moving just three games out of the final National League wild-card spot. Brendan Donovan, the team's lone All-Star, had been out of two games due to groin discomfort but was hopeful he would be available for one at-bat in the series opener against the Rockies. Cardinals manager Oli Marmol enlisted Donovan to pinch hit for catcher Pedro Pagés, who promptly hit a two-run, go-ahead double to give the team a 3-2 lead. Despite a depleted bullpen and a limited bench, the Cardinals have managed to string together wins despite a difficult schedule. The team is without Nolan Arenado indefinitely due to a shoulder strain and traded its closer, top setup man and a key left-handed reliever.",
  "shortSummary": "Brendan Donovan's late double led the St. Louis Cardinals to a 3-2 win over Colorado, overcoming injuries and shifting focus to the future.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "e4fb333564024cfdbd7449e37fdfc423",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.nytimes.com/athletic/6535825/2025/08/05/stl-cardinals-roster-playing-time-development/",
      "text": "LOS ANGELES — With two outs, two on and runners going on the pitch, Max Muncy’s hard liner to right could have spelled trouble for the St. Louis Cardinals.\nClinging to a one-run lead over the Los Angeles Dodgers in the bottom of the ninth, the Cardinals turned to their vastly different bullpen to hold it. JoJo Romero, the lone left-handed reliever on the roster, drew an unfavorable hand: Shohei Ohtani, Mookie Betts and Freddie Freeman were due to lead off the inning.\nAdvertisement\nIt marked just his second save opportunity of the year, but Romero didn’t waver. After Ohtani hit a leadoff single, Romero retired Betts (thanks to a diving play by Lars Nootbaar), struck out Freeman and pitched around Will Smith, walking him to get to Muncy. Romero’s 3-2 pitch left Muncy’s bat at 99 mph, but Nootbaar took a few steps back, reached up and corralled the ball, capping off the play with a resounding fist bump.\nThere was plenty to like about Monday’s 3-2 win. Sonny Gray shoved seven sparkling innings, allowing just one hit — a solo shot by Freeman in the fourth — with eight strikeouts over 90 pitches. A pair of solo homers by St. Louis (Masyn Winn in the second and Iván Herrera in the eighth) gave the Cardinals a fighting chance. When Los Angeles tied the game at two in the eighth, Yohel Pozo came through off the bench in the ninth, drilling a two-out, go-ahead single.\nPOZO IN THE 9TH! pic.twitter.com/2PCLv2jDQx\n— St. Louis Cardinals (@Cardinals) August 5, 2025\n“I’m always trying to do what the game is telling me to do,” Pozo said. “In that situation, we just needed a hit. I saw the big hole between first and second, I was trying to hit the ball there. (Dodgers reliever Brock Stewart) threw me a cutter, gave me a chance to do it.”\nMonday’s victory over the reigning World Series champions was one of the Cardinals’ best of the year, and is surely a welcome performance after a disappointing trade deadline. But when a season has taken a turn such as the Cardinals’ has, wins and losses become secondary. The priority for the remainder of the year is the future — what Cardinals brass first intended at the end of the 2024 season. However, the organization’s desire to attempt to compete simultaneously (and its inability to offload several veteran players over the offseason due to no-trade clauses) muddled the messaging.\nAdvertisement\nThere will be no mistaking what the rest of the season will look like. Manager Oli Marmol will spend each of the remaining 48 games trying to help answer what things will look like come 2026 and beyond.\nThis is not the same situation as the team’s last selloff season, he insists. In 2023, the final two months consisted of the Cardinals simply trying to survive the remainder of the calendar. Many of the rostered players were not part of the team’s future. At least this year, the roster reflects what the organization hopes will develop into a prominent core.\n“This lineup is what’s next,” Marmol said. “Some of these guys in the ‘pen, that’s what’s next. There is way more enthusiasm in a year like this compared to a 2023 standpoint because you’re investing in what the future is going to look like. That wasn’t the case last time.”\nBut given the Cardinals’ current roster construction, it’s fair to question if the organization can accurately do that. Some players, like Brendan Donovan and Herrera, solidified themselves early on as everyday players. Alec Burleson, who entered play Monday with an .801 OPS and the second-most homers on the team (14), has emerged as another example. The players the front office identified as priorities before the season started — namely Jordan Walker and Nolan Gorman — have not taken advantage of their respective playing time opportunities. They will still need to see time on the field, but not at the expense of the players who have seized their runway.\n“(People) are going to, every day, ask why one player is not (in the lineup), regardless of how I do it,” Marmol said. “Burleson has earned the right to be in there every day — and he’s going to be. The other guys we’ll have to find a rotation for.”\nEasier said than done. The roster logjam is still an issue, even with Nolan Arenado on the 10-day injured list. Marmol would like for Gorman to take the bulk of the reps at third base in Arenado’s absence, but “there has to be a real commitment to his objective and his mobility,” he said. Gorman was not in Monday’s starting lineup, but started at third base in each of the three previous games. The early returns were far from encouraging, with Gorman committing multiple costly misplays.\nAdvertisement\nBut there isn’t anywhere else the Cardinals can play Gorman, as long as the future remains the focus. For Gorman to be a true impact player, he needs to have a position on the diamond. The organization’s lack of positional flexibility is not unique to the active roster. It’s an organization-wide issue that has trickled down into Triple A. St. Louis already has several offense-first, designated-hitter type of players, both at the major-league level and in the upper tier of their minor leagues. That’s why the club first converted Burleson to a corner outfield spot, and why they are now trying the same with Herrera.\nThose decisions solved one problem only to create another. Walker’s move to right field, combined with Nootbaar’s need for a corner spot, makes four players for two roles. Nootbaar can play center, but not nearly to the defensive skillset of Victor Scott II, and the Cardinals are already subtracting plenty defensively with Gorman at third base and Herrera in left. If player development is the priority, Scott should remain the starting center fielder anyway, regardless of his .226 average and .629 OPS. The goal is to help Scott round into becoming the organization’s next full-time center fielder, and that means riding out his struggles offensively.\nNOOOOOOOOOT SAVES THE GAME!#ForTheLou x @STIHLUSA pic.twitter.com/oyL6S1VwoO\n— St. Louis Cardinals (@Cardinals) August 5, 2025\nSo what are Marmol and his staff to do? The major-league coaches are stuck trying to find a solution to an unsolvable math problem. There are not enough spots in the starting lineup to guarantee everyday playing time to the players the front office wants to see. Sitting players like Burleson and Herrera, who have taken advantage of playing time and have turned in productive seasons, is out of the question — and doing so would send the wrong message to players looking to play their way into consideration next season.\nThe playing time rotation won’t be perfect. Walker and Nootbaar should get four to five starts a week. Gorman has the potential to start every day, but only if his defense at third base improves. Herrera will be in the lineup every day, but he’ll go between designated hitter and left field. Burleson can play either left or right field, and will DH on days Herrera doesn’t. That’s the only rotation that guarantees at least some sort of consistent playing schedule to every player identified as a priority.\nIt’s a challenging ask, to say the least. Marmol understands the task and is hopeful the remaining eight weeks of the season will indeed lead to a jumpstart in planning for next year’s team.\n“I don’t think my job changes, because I’ve had the same approach since the beginning of the season as to what we find important,” Marmol said. “We won games along the way, but not at the expense of rotating guys, development, evaluating.”\n“We gave guys opportunities and our staff is highly focused on growing these guys. That doesn’t change,” he added. “We have different guys now and a younger group … but our objective overall, our goals as a staff, remain the same.”\n(Photo of Burleson and Herrera: Harry How / Getty Images)"
    }
  ],
  "argos_summary": "Brendan Donovan made a crucial pinch-hit appearance for the St. Louis Cardinals, hitting a two-run double that led to a 3-2 victory over the Colorado Rockies. Despite recent trades and injuries, including the absence of Nolan Arenado, the Cardinals have shown resilience, winning six of their last ten games and remaining in contention for a wild-card spot. Manager Oli Marmol is navigating a roster with limited options while focusing on player development for the future, as the team evaluates its young talent amidst a challenging season.",
  "argos_id": "N59YSFO0X"
}