{
  "url": "https://www.seattletimes.com/business/inflation-likely-moved-higher-last-month-as-tariffs-bite-putting-the-fed-in-bind/",
  "authorsByline": "CHRISTOPHER RUGABER",
  "articleId": "122a973501d946bd88236337d5267453",
  "source": {
    "domain": "seattletimes.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "WA",
      "county": "King County",
      "city": "Seattle",
      "coordinates": {
        "lat": 47.6038321,
        "lon": -122.330062
      }
    }
  },
  "imageUrl": "https://images.seattletimes.com/wp-content/uploads/2025/07/urnpublicidap.org99d90bab1ba2faa0fc5d4a6106125da7Federal_Reserve_Powell_36111.jpg?d=1200x630",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T21:01:20-07:00",
  "addDate": "2025-08-12T04:20:35.699585+00:00",
  "refreshDate": "2025-08-12T04:20:35.699587+00:00",
  "score": 1.0,
  "title": "Inflation likely moved higher last month as tariffs bite, putting the Fed in bind",
  "description": "Inflation likely ticked up in July for the third straight month as tariffs lift the cost of imported goods such as furniture, appliances, and toys, which could make it harder for the Federal Reserve to cut short-term interest rates as...",
  "content": "WASHINGTON (AP) — Inflation likely ticked up in July for the third straight month as tariffs lift the cost of imported goods such as furniture, appliances, and toys, which could make it harder for the Federal Reserve to cut short-term interest rates as President Donald Trump has demanded.\n\nConsumer prices are forecast to have risen 2.8% in July from a year earlier, according to a survey of economists by data provider FactSet. That annual pace would be up from 2.7% in June and a post-pandemic low of 2.3% in April. Excluding volatile food and energy costs, core inflation is expected to rise to 3%, from 2.9% in June. Both figures are well above the Fed’s 2% price target.\n\nThe potential increases, while modest, would put the Fed in a difficult spot: Hiring slowed sharply in the spring, after Trump announced a sweeping set of tariffs in April. The stalling out of job gains has boosted financial market expectations for an interest rate cut by the central bank.\n\nYet Fed chair Jerome Powell has warned that worsening inflation could keep the Fed on the sidelines — a stance that has enraged Trump, who has defied traditional norms of central bank independence and demanded lower borrowing costs.\n\nTuesday’s data will also arrive at a highly-charged moment for the Labor Department’s Bureau of Labor Statistics, which collects and publishes the inflation data. Trump fired Erika McEntarfer, then the head of BLS, after the Aug. 1 jobs report also showed sharply lower hiring for May and June than had previously been reported.\n\nThe president posted on social media Monday that he has picked E.J. Antoni, an economist at the conservative Heritage Foundation and a frequent critic of the jobs report, to replace McEntarfer.\n\n“E.J. will ensure that the Numbers released are HONEST and ACCURATE,” Trump said on Truth Social.\n\nAdding to the BLS’s turmoil is a government-wide hiring freeze that has forced it to cut back on the amount of data it collects for each inflation report, the agency has said. UBS economist Alan Detmeister estimates that BLS is now collecting about 18% fewer price quotes for the inflation report than it did a few months ago. He thinks the report will produce more volatile results, though averaged out over time, still reliable.\n\nOn a monthly basis, prices are expected to rise modestly, increasing just 0.2% from June to July and core prices rising 0.3%. Gas prices likely fell in July and grocery costs are expected to barely increase, muting overall inflation.\n\nSigns of duties pushing up prices first emerged in the June inflation report released last month. Toy prices jumped 1.8% from May to June, after a 1.3% increase the previous month. Clothing prices rose 0.4% in June, while sporting goods leapt 1.8%.\n\nMeanwhile, the average tariff level has climbed from about 2% before Trump’s inauguration to nearly 18%, the highest since the early 1930s, according to the Budget Lab at Yale. Most imports from the European Union and Japan now face duties of 15%, while goods from Taiwan pay 20% and Switzerland, 39%.\n\nOther trends are helping keep inflation from rising more quickly. Price increases for apartment rents, for example, are steadily cooling after sharp spikes during the pandemic era. And prices for new cars have declined slightly in recent months, even after Trump slapped 25% duties on autos and auto parts.\n\nSo far, U.S. and overseas carmakers are paying the tariffs, though economists say they likely will pass them on to consumers soon. Car companies are also paying 50% import taxes on steel and aluminum and 30% on parts from China.\n\nFord has said it paid $800 million in tariffs in the second quarter, while General Motors shouldered $1.1 billion. Stellantis, the world’s fourth-largest carmaker and the maker of brands such as Chrysler, Dodge, and Jeep, has said it has paid $350 million in tariffs out of a $1.7 billion expected cost this year.\n\nConsumers are likely to absorb more costs beyond the auto industry in the coming months, as Trump has begun to finalize many tariffs. Once businesses know what they will be paying, they are more likely to pass those costs to consumers, economists say.\n\nTrump has insisted that overseas manufacturers will pay the tariffs by reducing their prices to offset the duties. Yet the pre-tariff prices of imports haven’t fallen much since the levies were put in place.\n\nEconomists at Goldman Sachs estimate that foreign manufacturers have absorbed just 14% of the duties through June, while 22% has been paid by consumers and 64% by U.S. companies. Based on previous patterns, however — such as Trump’s 2018 duties on washing machines — the economists expect that by this fall consumers will bear 67% of the burden, while foreign exporters pay 25% and U.S. companies handle just 8%.\n\nMany large firms are still raising prices in response to the tariffs, including apparel makers Ralph Lauren and Under Armour, and eyewear company Warby Parker.\n\nConsumer products giant Procter & Gamble, maker of Crest toothpaste, Tide detergent and Charmin toilet paper, said late last month that it would lift prices on about a quarter of its products by mid-single-digit percentages.\n\nAnd cosmetics maker e.l.f. Beauty, which makes a majority of its products in China, said on Wednesday that it had raised prices by a dollar on its entire product assortment as of Aug. 1 because of tariff costs, the third price hike in its 21-year history.\n\n“We tend to lead and then we will see how many more kind of follow us,” CEO Tarang Amin said on an earnings call Wednesday.\n\nMatt Pavich, CEO of Revionics, a company that provides AI tools to large retailers to help them evaluate pricing decisions, says many companies are raising prices selectively to offset tariffs, rather than across the board.\n\n“Up until now we haven’t seen a massive hit to consumers in retail prices,” Pavich said. “Now, they are going up, we’ve seen that.”\n\nAssociated Press Retail Writer Anne D’Innocenzio in New York contributed to this report.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Consumer prices",
      "weight": 0.08499787
    },
    {
      "name": "tariff costs",
      "weight": 0.08018481
    },
    {
      "name": "Price increases",
      "weight": 0.07936586
    },
    {
      "name": "core prices",
      "weight": 0.07791743
    },
    {
      "name": "Toy prices",
      "weight": 0.077582985
    },
    {
      "name": "prices",
      "weight": 0.0775405
    },
    {
      "name": "retail prices",
      "weight": 0.07635498
    },
    {
      "name": "Gas prices",
      "weight": 0.074926324
    },
    {
      "name": "Clothing prices",
      "weight": 0.074842624
    },
    {
      "name": "many tariffs",
      "weight": 0.07089312
    }
  ],
  "topics": [
    {
      "name": "Inflation"
    },
    {
      "name": "Markets"
    },
    {
      "name": "Federal Reserve"
    }
  ],
  "categories": [
    {
      "name": "Business"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Economy News",
      "score": 0.990234375
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.88671875
    },
    {
      "name": "/News/Business News/Fiscal Policy News",
      "score": 0.869140625
    },
    {
      "name": "/People & Society/Social Sciences/Economics",
      "score": 0.82763671875
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.3994140625
    }
  ],
  "sentiment": {
    "positive": 0.05811705,
    "negative": 0.8221093,
    "neutral": 0.119773656
  },
  "summary": "Inflation likely increased in July, according to a survey by FactSet, with consumer prices expected to rise by 2.8% from the previous year, up from 2.7% in June and a post-pandemic low of 2.3% in April. This could make it harder for the Federal Reserve to cut short-term interest rates as President Donald Trump has demanded. The potential increases would put the Fed in a difficult spot as job gains slowed after the announcement of tariffs. However, Fed Chair Jerome Powell has warned that worsening inflation could keep the Fed on the sidelines, a stance that has angered Trump. The Labor Department’s Bureau of Labor Statistics has been under a government-wide hiring freeze and has been forced to reduce the amount of data it collects for each inflation report.",
  "shortSummary": "Inflation rose for the third month in July as tariffs increased the cost of imported goods, impacting Fed interest rate cuts amid slowing job growth.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "0997a8fa0d6d4ce9af7c8d2d4adf881c",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Inflation in the U.S. is expected to rise for the third consecutive month in July, driven by tariffs on imported goods, with consumer prices projected to increase by 2.8% year-over-year. This poses a challenge for the Federal Reserve, which may find it difficult to lower interest rates as President Trump has requested, especially with core inflation also rising. The ongoing tariff situation has led to increased costs for consumers, as companies like Procter & Gamble and e.l.f. Beauty have already raised prices on their products in response to these tariffs.",
  "argos_id": "N6N91L8VF"
}