{
  "url": "https://www.latimes.com/socal/daily-pilot/news/story/2025-08-11/15-year-old-student-athlete-idd-as-victim-of-gang-related-stabbing-in-costa-mesa",
  "authorsByline": "By Sara CardineStaff Writer  Follow",
  "articleId": "df10d1c4218e483b924eb9f51d494e64",
  "source": {
    "domain": "latimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "CA",
      "city": "Los Angeles",
      "coordinates": {
        "lat": 34.0536909,
        "lon": -118.242766
      }
    }
  },
  "imageUrl": "https://ca-times.brightspotcdn.com/dims4/default/c4f21dd/2147483647/strip/true/crop/2000x1050+0+188/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F00%2F0e%2Fc40fda29415a94db45059dddd989%2Ftn-dpt-me-cm-stabbing-arrest-6.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T01:30:37.673000+00:00",
  "addDate": "2025-08-12T01:37:21.110819+00:00",
  "refreshDate": "2025-08-12T01:37:21.110820+00:00",
  "score": 1.0,
  "title": "15-year-old student athlete ID'd as victim of gang-related stabbing in Costa Mesa",
  "description": "Following the arrest Saturday of Anaheim resident Matthew Juarez, 31,whom police say has known gang ties, more information is emerging about the NMUSD student killed in the Shalimar Drive incident.",
  "content": "First responders were contacted Saturday at 12:30 p.m. regarding a stabbing on the 700 block of Shalimar Drive, and discovered a 15-year-old girl with a life-threatening stab wound.\n\nAuthorities have identified a victim of a fatal stabbing in Costa Mesa Saturday as a 15-year-old Newport-Mesa Unified student whom social media reports describe as an up-and-coming soccer player killed in an incident being investigated as a gang-related attack.\n\nAllison Castillo — a student athlete who was recently invited to play soccer in Spain — was identified by the county coroner’s office Monday as the teenager found collapsed in an outside courtyard on the 700 block of Shalimar Drive by police.\n\nFirst responders were contacted Saturday at 12:30 p.m. regarding a stabbing and arrived to find the teen suffering from a life-threatening wound, according to a Costa Mesa Police Department release issued Sunday.\n\nOfficers and paramedics performed CPR at the scene and eventually transported the victim to a nearby hospital, where she died of her injuries a few hours later, the release stated.\n\nAlthough CMPD spokeswoman Roxi Fyad declined to release Castillo’s identity to the public, Orange County Sheriff’s Department spokesman Gerard McCann confirmed Monday coroner officials had identified the victim as Castillo, a resident of Costa Mesa.\n\nDuring their investigation of the incident, police detectives determined the stabbing may have involved a suspect with known gang ties, at which point investigators from CMPD’s Gang Unit were called to the scene.\n\n“The suspect was known to law enforcement as a known participant in illegal criminal gang activity,” Fyad said Monday.\n\nThat individual — Matthew Juarez, 31, of Anaheim — was quickly traced to a residence in the city of Anaheim, where he was detained without incident. Juarez was booked into the county’s intake release center on Sunday and is awaiting charges from the district attorney’s office.\n\nNewport-Mesa Unified School District officials acknowledged Castillo was a student of the district, although a spokesperson did not indicate which school the student attended.\n\n“She was a student in our district, and we are saddened by her passing,” the spokesperson said in a statement to media, declining to share further out of respect for the victim’s family. “Counseling and support services are available for our school community.”\n\nCastillo reportedly played soccer for two years with So Cal Select, an independent scouting program that prepares young athletes to play in college- and professional-level international tournaments, according to the organization’s .\n\nAn online GoFundMe account established on behalf of Castillo’s family recalled the youth as “the life of the party, always bringing joy, laughter and warmth to everyone around her.”\n\n“Her kindness, her ability to inspire, and her loving nature changed lives,” the page read. “She was a kind soul who didn’t deserve what happened to her. We demand justice for Allison, and we will not stop until those responsible are held accountable.”\n\nCosta Mesa police detectives are asking anyone who may have information about Saturday’s incident to contact Det. Eloisa Peralta at (714) 754-5039 or Investigator Eric Molina at (714) 754-5694.",
  "medium": "Article",
  "links": [
    "https://www.instagram.com/so_cal_select/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Costa Mesa police detectives",
      "weight": 0.078494065
    },
    {
      "name": "Costa Mesa Police Department",
      "weight": 0.07587641
    },
    {
      "name": "Costa Mesa",
      "weight": 0.07493038
    },
    {
      "name": "Allison Castillo",
      "weight": 0.07088728
    },
    {
      "name": "Castillo",
      "weight": 0.06410454
    },
    {
      "name": "illegal criminal gang activity",
      "weight": 0.06302912
    },
    {
      "name": "known gang ties",
      "weight": 0.062183555
    },
    {
      "name": "victim",
      "weight": 0.060123436
    },
    {
      "name": "lives",
      "weight": 0.057428777
    },
    {
      "name": "CMPD spokeswoman Roxi Fyad",
      "weight": 0.055427723
    }
  ],
  "topics": [
    {
      "name": "Organized Crime"
    },
    {
      "name": "Crime"
    }
  ],
  "categories": [
    {
      "name": "General"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Local News",
      "score": 0.97998046875
    },
    {
      "name": "/Sensitive Subjects/Violence & Abuse",
      "score": 0.91357421875
    },
    {
      "name": "/Sensitive Subjects/Death & Tragedy",
      "score": 0.85986328125
    },
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.480224609375
    }
  ],
  "sentiment": {
    "positive": 0.0757094,
    "negative": 0.6323613,
    "neutral": 0.29192933
  },
  "summary": "A 15-year-old student athlete named as Allison Castillo has been identified as the victim of a fatal stabbing in Costa Mesa, California. The incident is being investigated as a gang-related attack. Castillo was found with a life-threatening stab wound and transported to a nearby hospital where she died a few hours later. The suspect, Matthew Juarez, was identified as a known participant in illegal criminal gang activity and was quickly tracked down to a residence in Anaheim. The victim was identified by the county coroner’s office as Castillo. An online GoFundMe account dedicated to Castillo's life described her as “the life of the party, always bringing joy, laughter and warmth to everyone around her”",
  "shortSummary": "A 15-year-old Newport-Mesa Unified student, Allison Castillo, was stabbed to death in a gang-related attack in Costa Mesa, prompting a police investigation.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "f82e234fb87249fdbffec7f9408e13b8",
  "places": [
    {
      "osmId": "13301087",
      "road": "Shalimar Drive",
      "city": "Costa Mesa",
      "county": "Orange County",
      "state": "California",
      "postcode": "92627",
      "country": "United States",
      "countryCode": "us",
      "coordinates": {
        "lat": 33.6383158,
        "lon": -117.9249802
      }
    }
  ],
  "scraped_sources": [],
  "argos_summary": "A 15-year-old girl named Allison Castillo, a student athlete from Newport-Mesa Unified School District, was fatally stabbed in Costa Mesa in what authorities are investigating as a gang-related incident. First responders found her with life-threatening injuries on Shalimar Drive, and she later died at the hospital. The suspect, Matthew Juarez, 31, was arrested and is known to have gang ties. Castillo was remembered fondly by her community, with a GoFundMe page highlighting her positive impact and calling for justice.",
  "argos_id": "NHW9CEFUK"
}