{
  "url": "https://www.msnbc.com/top-stories/latest/intel-ceo-trump-resignation-lip-bu-tan-rcna224385",
  "authorsByline": "Ja'han Jones",
  "articleId": "83bf088428cd4b6ab68f5c52db0104bf",
  "source": {
    "domain": "msnbc.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-08/250807-Lip-Bu-Tan-rs-f6dad6.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T22:12:13.006000+00:00",
  "addDate": "2025-08-11T22:57:49.426039+00:00",
  "refreshDate": "2025-08-11T22:57:49.426040+00:00",
  "score": 1.0,
  "title": "After demanding his resignation, Trump meets with Intel CEO",
  "description": "Intel CEO Lip-Bu Tan was invited to the White House on Monday after Trump and his conservative allies called on him to resign.",
  "content": "The Trump administration and its conservative allies are pushing for the ouster of Intel CEO Lip-Bu Tan as the MAGA movement advances its authoritarian assault on free enterprise.\n\nDonald Trump’s gambits to strong-arm American companies to conform with his political agenda — be they law firms, universities or chip manufacturers — have exposed the fundamental disdain for democratic principles now being practiced by the party of “free enterprise.” Tan is the latest target.\n\nTan visited the White House on Monday, a meeting that followed a post from Trump’s Truth Social account last week accusing him of being “conflicted” and demanding that he resign “immediately.” As Media Matters researcher Matt Gertz noted, the post from Trump’s account came minutes after a Fox Business report on a letter sent by Sen. Tom Cotton, R-Ark., to Intel raising concerns about Tan’s investment in businesses with ties to China’s military. (Tan, who was born in Malaysia, joins TikTok CEO Shou Chu as a target of Cotton’s Joseph McCarthy-esque crusade against businesspeople with ties to China.)\n\nIn the letter, Cotton referred to Reuters’ reporting on Tan’s private investments and his previous job at Cadence, a tech company that recently reached a settlement in which it pleaded guilty to illegally selling semiconductor design technology to a Chinese military university. (A spokesperson for Intel told Reuters that Tan had answered questionnaires that included “disclosure of any potential conflicts of interest” and that the company handles such conflicts “appropriately.”)\n\nAfter Monday’s meeting, another post from Trump’s Truth Social account referred to Tan’s rise as an “amazing story” and said Tan and White House Cabinet members are going to “bring suggestions to me during the next week.” Intel released a statement calling the meeting “candid and constructive” and said the company appreciates “the President’s strong leadership.”\n\nBut as the mercurial president wields his influence, it’s worth noting the facts don’t appear to be as scandalous as Trump or Cotton have implied. The Reuters report, for example, does not allege that Tan has done anything unlawful. In fact, as Reuters noted in its report on Cotton’s letter:\n\nIn a memo to staff published to Intel’s website Thursday, Tan denounced “misinformation” being spread about him and said he’s “always operated within the highest legal and ethical standards.” The lack of any demonstrable culpability for Tan arguably highlights how blatantly authoritarian Trump’s push to oust him truly is.\n\nIt’s certainly ironic that the president who eagerly welcomed Elon Musk into the fold despite his financial entanglements with China and their related national security concerns would turn around and insist that the business leader of an independent company must step down over his alleged ties to China.\n\nAnd it’s revealing that other members of the Republican Party are contributing to this obvious attack on free enterprise.",
  "medium": "Article",
  "links": [
    "https://www.msnbc.com/top-stories/latest/jim-jordan-spotify-misinformation-censorship-rcna223196",
    "https://www.nbcnews.com/news/us-news/trump-require-universities-admissions-data-race-rcna223659",
    "https://thehill.com/opinion/5196156-elon-musk-china-influence/",
    "https://www.justice.gov/opa/pr/cadence-design-systems-agrees-plead-guilty-and-pay-over-140-million-unlawfully-exporting",
    "https://www.cotton.senate.gov/imo/media/doc/aug5letter.pdf",
    "https://www.pbs.org/newshour/politics/singaporeans-bemoan-sen-cottons-ignorant-grilling-of-tiktok-ceo",
    "https://newsroom.intel.com/corporate/my-commitment-to-you-and-our-company",
    "https://newsroom.intel.com/corporate/intels-statement-following-the-meeting-with-president-trump",
    "https://truthsocial.com/@realDonaldTrump/115012131343690532",
    "https://www.msnbc.com/opinion/msnbc-opinion/trump-liberation-day-tariffs-us-economy-rcna198940",
    "https://www.propublica.org/article/elon-musk-spacex-allows-china-investment-cayman-islands-secrecy",
    "https://www.reuters.com/world/us/us-lawmaker-questions-intel-ceos-ties-china-letter-company-board-chair-2025-08-06/",
    "https://www.reuters.com/world/china/cadence-plead-guilty-pay-140-million-us-china-sales-2025-07-28/",
    "https://www.msnbc.com/rachel-maddow-show/maddowblog/legal-firms-fight-back-trump-attacks-big-law-rcna223122",
    "https://www.msnbc.com/rachel-maddow-show/maddowblog/gops-free-market-principles-take-authoritarian-turn-rcna23008",
    "https://theconversation.com/how-elon-musks-deep-ties-to-and-admiration-for-china-could-complicate-trumps-beijing-policy-249988",
    "https://www.reuters.com/technology/intel-ceo-invested-hundreds-chinese-companies-some-with-military-ties-2025-04-10/",
    "https://www.msnbc.com/the-reidout/reidout-blog/elon-musk-lawsuit-jim-jordan-war-advertisers-rcna165447",
    "https://truthsocial.com/@realDonaldTrump/posts/114987288040725570",
    "https://www.politico.com/news/magazine/2024/07/16/the-trump-vance-ticket-is-a-repudiation-of-free-market-conservatism-00168578"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Tan",
      "weight": 0.092606306
    },
    {
      "name": "Trump",
      "weight": 0.07684649
    },
    {
      "name": "Intel CEO",
      "weight": 0.076342925
    },
    {
      "name": "American companies",
      "weight": 0.071060665
    },
    {
      "name": "Intel CEO Lip-Bu Tan",
      "weight": 0.06597161
    },
    {
      "name": "Intel",
      "weight": 0.06517591
    },
    {
      "name": "White House Cabinet members",
      "weight": 0.06442747
    },
    {
      "name": "Sen. Tom Cotton",
      "weight": 0.06406449
    },
    {
      "name": "Tom Cotton",
      "weight": 0.06318076
    },
    {
      "name": "free enterprise",
      "weight": 0.06115816
    }
  ],
  "topics": [
    {
      "name": "Business Leaders"
    }
  ],
  "categories": [
    {
      "name": "Business"
    },
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.97412109375
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.947265625
    },
    {
      "name": "/News/Technology News",
      "score": 0.91748046875
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.80908203125
    },
    {
      "name": "/News/Politics/Campaigns & Elections",
      "score": 0.35400390625
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.311279296875
    }
  ],
  "sentiment": {
    "positive": 0.08005312,
    "negative": 0.6702765,
    "neutral": 0.24967036
  },
  "summary": "The Trump administration and its conservative allies are pushing for the ouster of Intel CEO Lip-Bu Tan, amid concerns about Tan's investment in businesses with ties to China's military. This comes after a post from President Donald Trump's Truth Social account accused Tan of being \"conflicted\" and demanded his resignation immediately. Despite these allegations, Tan has denied wrongdoing and stated that he operates within the highest legal and ethical standards. This move shows the increasing disrespect for democratic principles by the party of \"free enterprise.\"",
  "shortSummary": "Donald Trump's administration and conservative allies are pushing for the resignation of Intel CEO Lip-Bu Tan over conflicts of interest and ties to China.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "053696f72bd54b01abf092e41ba754fb",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://theconversation.com/how-elon-musks-deep-ties-to-and-admiration-for-china-could-complicate-trumps-beijing-policy-249988",
      "text": "Elon Musk holds an outsized influence in the new Trump administration.\nAs head of his Department of Government Efficiency, or DOGE, the world’s wealthiest man has enjoyed nearly unfettered political power in slashing and refashioning the federal government as he sees fit. And it has quickly become clear that he has the president’s ear on issues beyond that brief.\nBut on one topic, Musk stands somewhat apart from others in the coterie of aides and advisers around Trump: China. In contrast to the many hawks in the new Trump cabinet who call for a hard-line approach on China, Musk is a striking outlier.\nAs an expert on China-U.S. relations who has monitored Musk’s views on China, I don’t find his long history of espousing pro-Chinese sentiment surprising, given that he has sought throughout to get a business hold in the country.\nBut those entanglements are worth scrutiny, given Musk’s role in the Trump administration at a time when one of America’s biggest foreign policy challenges is how to manage its relationship with Beijing.\nMusk’s journey to the East\nFor years, Musk has had significant business interests in China, with Tesla’s Shanghai factory, Tesla Giga Shanghai, playing a crucial role in the company’s global operations.\nSince its opening in 2019, the Shanghai plant has surpassed Tesla’s Fremont, California, facility in both size and productivity, now accounting for more than half of the company’s global deliveries and a majority of its profits. Moreover, nearly 40% of Tesla’s battery supply chain relies on Chinese companies, and these partnerships continue to expand.\nNotably, Tesla was the first foreign automaker permitted to establish operations in China without a local partner, following a change in ownership regulations. The Shanghai factory was constructed with the support of US$1.4 billion in loans from Chinese state-owned banks, granted at favorable interest rates.\nBetween 2019 and 2023, the Shanghai government also provided Tesla with a reduced corporate tax rate of 15% – 10 percentage points lower than the standard rate.\nThe cost advantages of manufacturing in Shanghai, which include lower production and labor expenses, have further cemented Tesla’s reliance on the Chinese market.\nGiven that Musk’s wealth is largely tied to Tesla stock, his financial standing is increasingly dependent on the company’s fortunes in China, making any potential disengagement from the country both economically and strategically challenging.\nTesla’s continued investment in China underscores this dependency. On Feb. 11, 2025, the company opened its second factory in Shanghai — a $200 million plant that is set to produce 10,000 megapack batteries annually. It’s the company’s first megapack battery factory outside the U.S..\nThis investment deepens Tesla’s presence in China amid a new wave of U.S.-China trade tensions. On Feb. 1, the Trump administration imposed a 10% tariff on Chinese imports, prompting Beijing’s retaliation with tariffs on American coal, liquefied natural gas, agricultural equipment and crude oil.\nA Chinese fan\nIt remains unclear to what extent Musk’s financial interests in China will translate to real influence over the Trump administration’s policy toward Beijing. But Musk’s long history of pro-China remarks suggests the direction he wants the administration to move.\nDuring his visit to Beijing in April 2024, Musk praised the country, noting also: “I also have a lot of fans in China – well, the feeling is mutual.”\nHis admiration appears to hinge in part on how he views business and labor practices in China. In that vein, Musk has criticized American workers as lazy and has faced U.S. labor law disputes, while simultaneously praising Chinese workers for “burning the 3 a.m. oil” under an intensely repressive labor system.\nIn numerous posts on the social media platform X, formerly Twitter, which he owns, Musk has also praised China’s infrastructure and high-speed rail system, lauded its space program, applauded its leadership in global green energy initiatives and urged his followers to visit the country.\nMusk has also opposed U.S. efforts to decouple from China, describing the countries’ economies as “conjoined twins,” despite a sizable part of the foreign policy establishment in the West viewing decreased dependency on China as necessary for security interests amid rising geopolitical tensions.\nOn the issue of Taiwan, the most dangerous flashpoint in U.S.-China relations, Musk has compared Taiwan to Hawaii, arguing that it is an integral part of China and noting that the U.S. Pacific Fleet has prevented mainland China from achieving reunification by force.\nMusk further suggested that the Taiwan dispute could be resolved by allowing China to establish Taiwan as a special administrative zone, similar to Hong Kong.\nHis remarks were shared and welcomed by China’s then-ambassador to the U.S., who, in a post on X, emphasized China’s so-called peaceful unification strategy and advocated for the “one country, two systems” model.\nTrump’s back-channel envoy?\nThe big question going forward is how Musk’s financial stakes in, and stated admiration for, China will translate into attempts to influence the U.S. administration’s China policy, particularly given Musk’s unconventional advisory role and the strong faction of anti-China hawks in Trumpworld.\nGiven Musk’s approach to China, it’s hard to see him not trying to use his influence with the president to push for somewhat warmer relations with Beijing.\nIf such counsel were heeded, it’s easy to envision Musk leveraging his deep ties to China, particularly his close personal relationship with China’s current second-ranking official, Premier Li Qiang, who was the Shanghai party chief when Tesla’s factory was built. In the scenario, Donald Trump could tap Musk as a back channel for diplomacy to ease U.S.-China tensions and facilitate bilateral cooperation when needed.\nTo this point, it was, perhaps, telling that it was Musk who met with China President Xi Jinping’s envoy to Trump’s inauguration, Vice President Han Zheng, on the eve of the event.\nBut it’s far from certain that Trump wants that diplomatic role for Musk, or that other voices won’t win out with regard to Beijing. In his first term, Trump launched an unprecedented trade war and tech blockade against China, fundamentally reshaping U.S.-China relations and pushing the U.S. toward something of a bipartisan consensus to counter Beijing that has existed for several years.\nTrump’s tariff moves and second-term picks for top trade and commerce roles, like Peter Navarro and Jamieson Greer — who played key roles in the trade war against China during the president’s first term — suggest that Trump’s commitment to further decoupling from China remains strong.\nFurthermore, Musk’s business interests and personal wealth tied to China could leave him vulnerable to Chinese influence. By leaning on Musk’s close ties with Trump, China could use his dependence on the Chinese market as a bargaining chip to pressure Trump into making concessions on issues of major strategic importance to Beijing.\nChina has a history of coercing foreign companies reliant on its market into making compromises on matters concerning its national interests. For instance, Apple removed virtual private network apps from its app store in China at the government’s request. Similarly, Tesla could face comparable pressure in the future if Beijing wants to use Musk as a cudgel to influence policy in the Trump administration. Notably, as the head of DOGE, with access to sensitive data from multiple agencies, Musk could find himself caught between U.S. security scrutiny and China’s strategic targeting.\nSo long as Musk retains the influence with Trump that he holds now, it’s conceivable that his pro-China sentiments will translate into attempts to influence government policy. Yet even if this is to be the case, whether those efforts succeed will depend on the president and his other advisers, many of whom are seeking an aggressive front against Beijing and are likely to view Musk as an impediment rather than ally in that fight to come."
    },
    {
      "url": "https://www.nbcnews.com/news/us-news/trump-require-universities-admissions-data-race-rcna223659",
      "text": "President Donald Trump is expected to sign a directive on Thursday mandating that universities provide admissions data to prove that they are not implementing affirmative action policies, White House press secretary Karoline Leavitt said on X.\nLeavitt did not disclose the criteria that the administration will use to determine whether schools are practicing race-conscious admissions.\nIt comes after Ivy League universities Columbia and Brown last month reached settlements that require them to release information about applicants’ race in addition to test scores and academic performance after they went back and forth with the Trump administration for months over federal funding. The settlements have stoked debates about academic freedom and the role of government institutions in higher education.\nThe president's directive comes more than two years after the Supreme Court struck down the use of affirmative action programs at the University of North Carolina and Harvard, ruling that the consideration of race in the admissions process violated the Equal Protection Clause of the Constitution. Conservative activists, who argued that the policy led to discrimination against white and Asian students, considered the rulings a major victory.\nThe rulings, however, were heavily criticized by those who argued that race-conscious admissions provided an avenue for students from marginalized communities to combat historical racial discrimination in the higher education system.\n“But deeming race irrelevant in law does not make it so in life,” Justice Ketanji Brown Jackson wrote in a dissenting opinion in the UNC case (Jackson recused herself from the Harvard case; she was on Harvard’s board of overseers until last year). “And having so detached itself from this country’s actual past and present experiences, the Court has now been lured into interfering with the crucial work that UNC and other institutions of higher learning are doing to solve America’s real-world problems.”\nThe Trump administration has aggressively cracked down on diversity, equity and inclusion-related programs, with the president signing an executive order in his first week directing all departments and agencies to terminate “discriminatory and illegal preferences, mandates, policies, programs” and more."
    },
    {
      "url": "https://www.msnbc.com/the-reidout/reidout-blog/elon-musk-lawsuit-jim-jordan-war-advertisers-rcna165447",
      "text": "Happy Tuesday. Here's your Tuesday Tech Drop, the past week's top stories from the intersection of politics and the seemingly all-inclusive world of technology.\nMusk's 'war' on free enterprise\nElon Musk is propelling House Judiciary Chairman Jim Jordan’s war on private enterprise. On Tuesday, Musk announced a lawsuit and, in a post on X, declared \"war\" against a coalition of advertisers known as the Global Alliance for Responsible Media (GARM), which uses its collective power to prioritize investing in companies that align with what they feel are issues of import. Jordan previously used his role as Judiciary chairman to accuse companies in GARM of illegally colluding against conservatives over their choice not to advertise on some controversial conservative platforms. Musk’s lawsuit cites Jordan’s investigations, and in posts online he claimed companies could be guilty of racketeering for choosing not to advertise on X after he took over, which was a period in which advertisers fled from X due to the platform being rife with hate speech.\nRead more at Wired.\nJD Vance's media investment\nDonald Trump’s running mate Sen. JD Vance is a profiteer of the budding right-wing media ecosystem, and of the hate and disinformation that fuels it. Talking Points Memo has a new report informing — or perhaps, in some cases, reminding — readers about Vance’s investment in Rumble, a video streaming platform known to platform far-right celebrities, extremists and conspiracy theorists.\nRead more at Talking Points Memo.\nVance goes viral again\nNewsweek spoke to the creators behind a viral TikTok song made out of JD Vance’s previous remarks about being a “Never Trump guy.” The song, remixed to fit Petey Pablo’s 2003 song “Freek-a-Leek,” has garnered millions of listens across several TikTok videos over the last couple weeks.\nRead more at Newsweek.\nSocial media fuels violence and misinfo in the U.K.\nThe Independent published a post outlining how the Elon Musk-owned social media platform X — and many of the right-wing influencers who use it — helped fuel racist and xenophobic misinformation and violent attacks in the U.K. last week following a series of stabbings.\nRead more at The Independent.\nTeen takes Meta to court\nA teenage girl in New York filed a lawsuit against Meta, which is Instagram and Facebook’s parent company, accusing executives at Meta of approving the use of features that they knew would make children addicted to their apps, and did so while knowingly exposing children to harmful material online.\nAn Instagram spokesperson said:\n“These are complex issues but we will continue working with experts and listening to parents to develop new tools, features and policies that are effective and meet the needs of teens and their families.”\nRead more at The Washington Post.\nTrump and Musk's fake news\nElon Musk and Donald Trump have both used their social media platforms to spread manipulated video of Kamala Harris over the last couple weeks, demonstrating why tech experts and Democratic lawmakers were right to raise awareness about how easily the spread of misinformation and the misuse of artificial intelligence tools could be used to manipulate voters in the upcoming election.\nRead more at Mother Jones.\nTech troubles with Georgia's voter cancellation site\nProPublica published an article highlighting security issues discovered within a new website Georgia Republicans created to cancel one’s voter registration. Multiple outlets had already discovered various security issues with the platform that exposed voters’ private information, and the ProPublica discovery found a flaw that made it easier for users of the platform to cancel other people’s voter registrations. Georgia Republicans have expanded opportunities for people to purge purportedly ineligible voters from the voter rolls, and in their rush to do so, they’ve clearly overlooked flaws in the process that could leave eligible voters disenfranchised.\nRead more at ProPublica."
    },
    {
      "url": "https://www.msnbc.com/top-stories/latest/jim-jordan-spotify-misinformation-censorship-rcna223196",
      "text": "Happy Tuesday! Here’s your Tuesday Tech Drop, a weekly roundup of the top stories from the intersection of technology and politics.\nJim Jordan goes to bat for disinformation\nRep. Jim Jordan, R-Ohio, last week launched a congressional probe into the popular streaming platform Spotify, in what is the latest Republican-led effort to discourage efforts to stem the spread of misinformation and disinformation online.\nIn a letter to Spotify, Jordan dredges up years-old allegations of censorship by U.S. and European agencies of conservative programming on its platform, including of MAGA-friendly podcaster Joe Rogan — who recently claimed that two (unnamed) former presidents called the company over his widely denounced Covid conspiracy theories, and of Steve Bannon, who was recently welcomed back to Spotify after a five-year ban for suggesting the beheading of U.S. officials such as infectious disease expert Dr. Anthony Fauci and former FBI Director Christopher Wray.\nRepublicans have repeatedly tried — and failed — to prove that Big Tech platforms have worked hand in hand with the government to censor conservative voices. This appears to be more of the same. And it’s not the first time Jordan has name-checked Rogan while targeting a private company on behalf of his conservative agenda.\nRead Jordan’s letter to Spotify here.\nNew MAGA mantra online\nA new Politico article reports on the origin of the phrase “heritage American,” the absurd term that’s gaining popularity among far-right, white nationalist types online to describe white Americans who feel their ancestry is indispensable to an authentic American identity.\nRead more at Politico here.\nApple update unnerves Republicans\nA new update to the iPhone's operating system will allow users to filter text messages from unknown numbers automatically into an “unknown senders” folder. And while many Apple users might be eager for a reprieve from unsolicited texts, the National Republican Senatorial Committee is quite worried the change could hamper its fundraising and voter mobilization efforts, according to an unearthed memo.\nRead more in Business Insider here.\nYouTube’s new AI to enforce age restrictions\nThe popular video platform YouTube, facing persistent concerns over its impact on children, announced last week that it will use artificial intelligence — including a review of one’s browsing history — to determine users’ ages and enforce the site’s age restrictions.\nRead more at Mashable.\nDemocrats want details on DOGE\nSenate Democrats introduced a bill last week to require audits at dozens of federal agencies to determine whether employees, acting on behalf of the Elon Musk-led Department of Government Efficiency, created cybersecurity vulnerabilities through their access to government computer systems.\nRead my blog on the bill here.\n‘Rise of the Idiot Interviewer’\nEgyptian American comedian Bassem Youssef schooled a group of MAGA influencers known as the “Nelk Boys” (who are grown men, despite their name) after the group faced bipartisan backlash for hosting a softball interview (read: propaganda appearance) with Israeli Prime Minister Benjamin Netanyahu.\nRead my report on the exchange here.\nFor more on the controversy and the trend of MAGA podcasters embracing authoritarian talking points, check out writer Nathan Robinson’s editorial “The Rise of the Idiot Interviewer” in Current Affairs.\nPhotos capture devastation of Gaza from above\nRare aerial photos of Gaza, obtained by The Washington Post, reveal disturbing scenes of the widespread destruction caused by Israeli bombardment of the Palestinian enclave.\nView the Post’s interactive report here."
    },
    {
      "url": "https://www.propublica.org/article/elon-musk-spacex-allows-china-investment-cayman-islands-secrecy",
      "text": "Elon Musk’s aerospace giant SpaceX allows investors from China to buy stakes in the company as long as the funds are routed through the Cayman Islands or other offshore secrecy hubs, according to previously unreported court records.\nThe rare picture of SpaceX’s approach recently emerged in an under-the-radar corporate dispute in Delaware. Both SpaceX’s chief financial officer and Iqbaljit Kahlon, a major investor, were forced to testify in the case.\nIn December, Kahlon testified that SpaceX prefers to avoid investors from China because it is a defense contractor. There is a major exception though, he said: SpaceX finds it “acceptable” for Chinese investors to buy into the company through offshore vehicles.\n“The primary mechanism is that those investors would come through intermediate entities that they would create or others would create,” Kahlon said. “Typically they would set up BVI structures or Cayman structures or Hong Kong structures and various other ones,” he added, using the acronym for the British Virgin Islands. Offshore vehicles are often used to keep investors anonymous.\nExperts called SpaceX’s approach unusual, saying they were troubled by the possibility that a defense contractor would take active steps to conceal foreign ownership interests.\nKahlon, who has long been close to the company’s leadership, has said he owns billions of dollars of SpaceX stock. His investment firm also acts as a middleman, raising money from investors to buy highly sought SpaceX shares. He has routed money from China through the Caribbean to buy stakes in SpaceX multiple times, according to the court filings.\nThe legal dispute centers on an aborted 2021 deal, when SpaceX executives grew angry after news broke that a Chinese firm was going to buy $50 million of the company’s stock. SpaceX then had the purchase canceled. In separate testimony, the rocket company’s CFO explained that the media coverage was “not helpful for our company as a government contractor.” SpaceX’s business is built on those contracts, with the U.S. government paying the company billions to handle sensitive work like building a classified spy satellite network.\nCompany executives were concerned that coverage of the deal could lead to problems with national security regulators in the U.S., according to Kahlon’s testimony and a filing from his attorneys.\nSpaceX, which also launches rockets for NASA and sells satellite internet service, is perhaps the most important pillar of Musk’s fortune. His estimated 42% stake in the company is valued at around $150 billion. If he owned nothing else, he’d still be richer than Bill Gates.\nFederal law gives regulators broad power to oversee foreign investments in tech companies and defense contractors. Companies only have to proactively report Chinese investments in limited circumstances, and there aren’t hard and fast rules for how much is too much. However, the government can initiate investigations and then block or reverse transactions they deem a national security threat. That authority typically does not apply to purely passive investments in which a foreign investor is buying only a small slice of a company. But experts said that federal officials regularly ask companies to add up Chinese investments into an aggregate total.\nThe U.S. government charges that China has a systematic strategy of using even minority investments to secure leverage over companies in sensitive industries, as well as to gain privileged access to information about cutting-edge technology. U.S. regulators view even private investors in China as potential agents of the country’s government, experts said.\nThe new materials do not contain allegations that the Chinese investments in SpaceX would violate the law or were directed by the Chinese government. The company did not respond to detailed questions from ProPublica. Kahlon declined to comment on the reasons for SpaceX’s approach.\nIt’s not uncommon for foreigners to buy U.S. stock through a vehicle in the Cayman Islands, often to save money on taxes. But experts said it was strange for the party on the other side of a deal — the U.S. company — to prefer such an arrangement.\nProPublica spoke to 13 national security lawyers, corporate attorneys and experts in Chinese finance about the SpaceX testimony. Twelve said they had never heard of a U.S. company with such a requirement and could not think of a purpose for it besides concealing Chinese ownership in SpaceX. The 13th said they had heard of companies adopting the practice as a way to hide foreign investment.\n“It is certainly a policy of obfuscation,” Andrew Verstein, a UCLA law professor who has studied defense contractors, said of the SpaceX testimony. “It hints at potentially serious problems. We count on companies to be forthright with the government about whether they’ve taken money from America’s rivals.”\nThe new material adds to the questions surrounding Musk’s extensive ties with China, which have taken a new urgency since the world’s richest man joined the Trump White House. Musk has regularly met with Communist Party officials in China to discuss his business interests in the country, which is where about half of Tesla cars are built.\nLast week, The New York Times reported that Musk was scheduled to get a briefing on secret plans for potential war between China and the U.S. The Times later reported that the briefing was called off, and Trump denied it had ever been scheduled. The president told reporters it would be wrong to show the war plans to the businessman: “Elon has businesses in China, and he would be susceptible perhaps to that,” Trump said.\nThe Delaware court records reveal SpaceX insiders’ intense preoccupation with secrecy when it comes to China and detail a network of independent middlemen peddling SpaceX shares to eager Chinese investors. (Unlike a public company, SpaceX exercises significant control over who can buy into the company, with the ability to block sales even between outside parties.)\nBut the case leaves unanswered the question of exactly what percentage of SpaceX is owned by Chinese investors.\nThe Financial Times recently reported that Chinese investors had managed to acquire small amounts of SpaceX stock and that they were turning to offshore vehicles to do so. The deals were structured to limit the information investors receive, the outlet said. The Delaware records reveal additional, previously unreported Chinese investments in SpaceX but do not say how much they were worth. The few Chinese investments in SpaceX where a dollar figure is publicly known total well under $100 million.\nThe experts said the court testimony is puzzling enough that it raises the possibility that SpaceX has more substantial ties to China than are publicly known and is working to mask them from U.S. regulators. A more innocent explanation, they said, is that SpaceX is seeking to avoid scrutiny of perfectly legal investments by the media or Congress.\nOnce a welcome source of cash, Chinese investment in Silicon Valley has become the subject of intense debate in Washington as hostility between the two countries deepened in recent years. Corporate lawyers told ProPublica they’d counsel their clients against requiring the use of offshore vehicles because it could make it look like they are trying to hide something from the government.\nBret Johnsen, the SpaceX CFO, testified in the Delaware dispute that the company does not have a formal policy about accepting investments from countries deemed adversaries by the U.S. government. Rather, he said, SpaceX has “preferences that kind of feel like a policy.” Sensitive to how such financial ties could make it “more challenging to win government contracts,” Johnsen said that he asks fund managers to “stay away from Russian, Chinese, Iranian, North Korean ownership interest.”\nIn the public portion of his deposition, Johnsen wasn’t asked whether routing Chinese money offshore made such investments acceptable to SpaceX. But he lent credibility to Kahlon, the investor who said that was enough to get the green light. Johnsen said that he has a long-standing personal relationship with Kahlon and that he’s discussed the company’s approach to Chinese ownership with him. The CFO added that he trusts Kahlon to bring in only investors that the company approves of.\nOver the years, Kahlon has personally helped Chinese investors buy stakes in SpaceX on “a number of occasions” through “proxies such as British Virgin Islands- or Cayman Islands-based entities,” according to a filing from his lawyers. He also knows of “many” other Chinese investors who own SpaceX shares, the filing said. He learned about them through conversations with investors and brokers, as well “from having viewed investor lists.”\nKahlon is a consummate SpaceX insider. He “has been with the company in one form or fashion longer than I have,” said Johnsen, who’s worked at SpaceX for 14 years. Early in his career, Kahlon worked for Peter Thiel at the same venture capital firm that once employed JD Vance, and he first met with SpaceX around 2007 a few years after it was founded.\nKahlon eventually opened his own firm called Tomales Bay Capital, becoming a major player among the middlemen who cater to would-be investors in SpaceX. He’s helped people like former Education Secretary Betsy DeVos buy pieces of the rocket company. He also said he has served as a “back channel” between SpaceX and international regulators as the company sought to bring its satellite internet products to countries like India.\nKahlon and Johnsen were forced to testify after the deal with a Chinese firm fell apart in late 2021, sparking years of litigation. That year, Kahlon had the opportunity to buy more than half a billion dollars of SpaceX stock from a West Palm Beach private equity firm. Kahlon had already brought Chinese money into SpaceX before, he testified, and he again turned to China as he gathered funds to purchase the stake.\nKahlon soon connected with a Shanghai-based company called Leo Group, short for “Love Each Other.” As Kahlon made his pitch during their first call, Leo was told that “it would be best not to disclose the name of SpaceX,” an executive at the Chinese company later testified. “They deemed that information to be quite sensitive.”\nLeo quickly sent Kahlon $50 million. He then messaged another business associate in China: “Have any folks interested in spcex still?”\nKahlon testified that he was planning to tell Johnsen about the Leo investment and expected the CFO to sign off on it. But the deal blew up after Leo mentioned SpaceX in a regulatory filing that generated widespread coverage in the Chinese business press. (Whether Leo had Kahlon’s permission to make the disclosure is a matter of dispute.) In a panic, Kahlon enlisted a Leo vice president to try to get the articles taken down. But when Johnsen and Tim Hughes, SpaceX’s top in-house lobbyist, spotted the stories, they grew alarmed.\n“This is not helpful for our company as a government contractor,” the SpaceX CFO later testified regarding the press attention. “It, in essence, arms our competitors with something to use as a narrative against us.”\n“In my entire professional career, this was literally the worst situation that I’ve been in,” Kahlon said. “I failed at what I thought was a core responsibility in the relationship we had.”\nSpaceX ultimately decided to let Kahlon buy only a smaller portion of the stake, purchasing much of the half-billion dollar investment itself. According to contemporaneous messages and testimony from Kahlon, he was told that decision was made by Musk. However, Kahlon continued to have a strong relationship with SpaceX after the mishap, court records say, with the company allowing his firm to keep buying a large quantity of shares.\nMusk’s business interests in China extend far beyond SpaceX’s ownership structure — a fact that has drawn criticism from Republican lawmakers over the years. In 2022, after Tesla opened a showroom in the Chinese region where the government runs Uyghur internment camps, then-Sen. Marco Rubio tweeted, “Nationless corporations are helping the Chinese Communist Party cover up genocide.”\nIn addition to Tesla’s sprawling factory in Shanghai, last year, almost 40% of Tesla’s sales were to Chinese customers. The company has also secured major tax breaks and regulatory victories in the country. In 2019, the Chinese premier offered Musk the country’s equivalent of a green card.\nIn recent years, the billionaire has offered sympathetic remarks about China’s desire to reclaim Taiwan and lavished praise on the government. “My experience with the government of China is that they actually are very responsive to the people,” Musk said toward the end of Trump’s first term. “In fact, possibly more responsive to the happiness of people than in the U.S.”\nDo you have any information we should know about Elon Musk’s businesses? Josh Kaplan can be reached by email at [email protected] and by Signal or WhatsApp at 734-834-9383. Justin Elliott can be reached by email at [email protected] and by Signal or WhatsApp at 774-826-6240.\nAlex Mierjeski contributed research."
    },
    {
      "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/legal-firms-fight-back-trump-attacks-big-law-rcna223122",
      "text": "This is an adapted excerpt from the Aug. 4 episode of “The Rachel Maddow Show.\"\nAs Donald Trump continues to push around the nation’s universities — suspending their federal funding and then shaking them down to comply with his demands — some colleges have decided to do deals with the White House. In recent weeks, Brown University coughed up $50 million and Columbia University paid more than $200 million.\nLast week, there was reporting that an even bigger deal was in the works. The New York Times reported that Harvard University was preparing to fork over $500 million to appease Trump. However, according to the school’s student newspaper, The Harvard Crimson, the university’s president told the faculty he is absolutely not considering such a deal.\nThe rule of law is under direct assault right now, and its greatest threat comes when those within the legal system fail to do their duties and stand up against the attack.\nMichael Teter\nThe paper reports: “The University is seriously considering resolving its dispute with the White House through the courts rather than a negotiated settlement.”\nThen there are the law firms that Trump has been pushing around. Nine big law firms struck deals with the president after he began issuing executive orders targeting certain firms. Four firms refused to make deals with Trump; they fought back and all four firms won in court.\nDespite their success, new reporting from Reuters found that Trump’s assault on law firms has nevertheless had what is presumably the desired effect: Some big law firms are scaling back their pro bono work for the kinds of people or organizations the Trump administration is trying to victimize or persecute.\nAt the same time, smaller law firms and new purpose-driven legal organizations are being formed to make up the moral difference, to do the work that these big law firms are too cowardly to do and to stand up for people being fired by Trump when they’ve done nothing wrong.\nOn Monday, The New York Times reported on a new firm of just four lawyers — including two who were fired from the Justice Department this year by Trump — that is focused on challenging the administration in court, specifically with the aim of getting precedent-setting cases before the Supreme Court that could curtail the president’s power.\nThere are also those fighting against the administration who are using the standards of the legal profession, its internal ethics and rules, as a way to stand up and push back. The Freedom of the Press Foundation has taken on Trump’s Federal Communications Commission chairman by filing a disciplinary complaint against him with the D.C. Bar Association. The complaint accused the FCC chair of, among other things, intimidating media outlets in violation of professional conduct rules he is bound to follow as a lawyer.\nMeanwhile, the D.C. Bar’s disciplinary board has just recommended that former Trump lawyer Jeffrey Clark be disbarred for his role in trying to help Trump overturn the 2020 election. The board said Clark should be disbarred “to send a message to the rest of the Bar and to the public that this behavior will not be tolerated.”\nOn top of these efforts, a legal watchdog group has filed professional ethics complaints against three lawyers who currently work for Trump’s Justice Department. The Legal Accountability Center has accused the attorneys of making false statements to a federal judge while defending the Trump administration in court.\n“The rule of law is under direct assault right now, and its greatest threat comes when those within the legal system fail to do their duties and stand up against the attack,” Michael Teter, the group’s executive director, told The New York Times. “The message that needs to be heard by all attorneys representing the government is that even though the Trump administration isn’t interested in following the rules, we are watching.”"
    },
    {
      "url": "https://www.msnbc.com/opinion/msnbc-opinion/trump-liberation-day-tariffs-us-economy-rcna198940",
      "text": "Today is what President Donald Trump calls “Liberation Day,” the day he frees the U.S. economy from the global economy. President Trump claims that his policy of chaotically implemented tariffs will “bring back jobs” and that U.S. manufacturing will boom “like we have never boomed before.”\nWe’ve been down this road before, and it didn’t end well.\nIn his first term, President Trump claimed that he’d revitalize U.S. manufacturing, but he failed to do so; there’s no reason to believe that doubling down on the same, failed policies will do so now. There is a better way — and that comes with real federal investments into the American economy.\nWe’ve been down this road before, and it didn’t end well.\nPresident Trump is right to say that domestic manufacturing matters. Some goods are integral to national and economic security, so we all have an interest in ensuring reliable production within our borders or friendshored.\nTake the example of semiconductors, many thinner than a wisp of hair, now in everything from cars to refrigerators to cellphones. While innovators in Silicon Valley invented this technology, by the time Trump left office in 2021, most chips were made overseas. When Covid hit, the combination of lockdowns that shuttered factories around the world and higher demand for consumer goods as people were stuck at home led to a global chip shortage affecting 169 separate industries, which, in turn, contributed to rising prices.\nThis is a clear example of why we must think deeply about what is produced within the boundaries of the nation. So how do we do that?\nTariffs are one tool, but on their own they don’t deliver. After Trump put tariffs in place during his first term and gave tax cuts for the very wealthy, investment in the construction of new manufacturing facilities fell. That’s right, fell.\nNow what’s scary is that we’re already seeing signs of manufacturers struggling. In New York state, manufacturers are seeing new orders and shipments fall and overall business conditions deteriorate, leading them to lose hope that this economy will allow them to grow.\nWhen I was working in the Biden administration, we saw a more-than-doubling of investment in the construction of new manufacturing facilities. How did we do that? We invested in America.\nWhile tariffs make foreign goods more expensive, our approach instead sought to improve domestic production. By investing public dollars in infrastructure and other essential services, we brought capital into critical sectors. And we made sure that those investments could thrive and that they would deliver good, middle-class jobs.\nThis economic development strategy acknowledges the real-world challenge with building up a manufacturing industry in the United States. Firms need infrastructure, such as roads and access to affordable electricity, an ecosystem of other manufacturers, including suppliers, as well as competitors to keep them on their toes and build a community of best practices, and a pipeline of skilled workers who, in turn, need homes and schools and child care for their families.\nAll of this is a distraction from the fleecing of America by giving $4.6 trillion in tax cuts to the wealthiest.\nThis is why Congress passed, and President Biden signed into law, the Bipartisan Infrastructure Law, the CHIPS and Science Act, and the Inflation Reduction Act. Combined, these laws catalyzed a trillion dollars in new private investment in clean energy, semiconductors and other advanced manufacturing. By crowding in investment into sectors that matter through both supply and demand side policies and addressing market failures, we saw a revitalization of U.S. manufacturing in sectors in which there’s both need and a potential to thrive.\nBut President Trump doesn’t get it. He thinks that capricious on-again/off-again tariffs will lead to investment and growth. But no one can plan sound investments amid this chaos. Further, he has no plan to improve domestic industry. The lack of even the concept of a plan is showing up in the data: already, there are indications that manufacturers have scaled back their intentions by $57 billion.\nAnd let’s be clear, all of this is a distraction from the fleecing of America by giving $4.6 trillion in tax cuts to the wealthiest and letting Elon Musk take a chainsaw to the U.S. government. These policies will not spur growth that benefits America’s working people. Just look at what happened last time: in his first term, Trump promised that his tax cuts would lead to growth of 4%-6% and wage gains of $4,000 per worker. Neither happened.\nWhen I visited Syracuse last year, I got to see the Biden administration’s ideas in action. At Beldon Industries, they were installing a new production line to produce a fiber optic cable that is easier to install and more cost-effective, particularly in rural areas. Across town, the Idaho-based semiconductor firm Micron was promising to invest $100 billion over the next two decades, having won a $6.1 billion grant from the CHIPs for America program.\nThat’s what it means to revitalize American manufacturing. It’s not about one man’s whims, but about helping communities come together and build great things."
    },
    {
      "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/gops-free-market-principles-take-authoritarian-turn-rcna23008",
      "text": "American politics only has a handful of trends that have endured for generations, but near the top of the list is the seemingly unshakable partnership between corporate America and the Republican Party. One of the defining characteristics of the GOP for over a century is its commitment to the nation’s largest and most powerful businesses.\nWhat corporate leaders want, Republicans have told us, is what corporate leaders should get. What’s good for business is what’s good for America. The government must never be in a position to pick winners and losers: Those decisions should be left to the private sector, guided by good ol’ fashioned free market principles. For politicians to intervene in corporations’ decisions is to open the door to socialism.\nBut as regular readers know, over the last year or so, the relationship between the GOP and its corporate partners has been tested in unfamiliar ways.\nThe first sign of strain came about a year ago, when Republicans started imposing new voting restrictions, prompting criticisms from many prominent American businesses. Many in the party responded by threatening major corporations with retaliatory policy measures if they said anything negative in public about the GOP’s voter-suppression campaign.\nIndeed, it was a year ago this week when Senate Minority Leader Mitch McConnell told corporations to “stay out of politics,” adding that business “will invite serious consequences” if they take public stands on issues in ways Republicans don’t like.\nIn the months that followed, related examples came to the fore. Corporate leaders and GOP officials clashed over efforts to end the pandemic. And raising the debt ceiling. And cooperating with the bipartisan investigation into the Jan. 6 attack, which led to an unusually aggressive threat from House Minority Leader Kevin McCarthy, who vowed to retaliate against businesses that provided information the GOP preferred to keep secret.\nNow, in the wake of Florida Gov. Ron DeSantis signing what some have dubbed the “Don’t Say Gay” bill into law, the Republican Party’s culture war agenda not only has a new front, it’s also leading to different kinds of threats. As MSNBC colleague Ja’han Jones explained yesterday:\nNow, like a disgruntled despot demanding fealty, Florida Republicans and their allies are looking for ways to punish Disney for its stance — belated as it was — in support of LGBTQ people. Last week, Florida state Rep. Spencer Roach said he and other lawmakers have considered revoking a state law enacted in 1967 that effectively gives Disney unique autonomy over its massive Florida properties, including Disney World. DeSantis has also called on lawmakers to re-evaluate Disney’s special status after saying the company’s criticism “crossed the line.”\nAt face value, the fact that state policymakers are eager to revisit generous benefits to a massive, multi-national corporation may be a popular move, even on the left. (As a native Floridian, I’ve long marveled at just how expansive Disney’s benefits are in the Sunshine State.)\nBut no one should miss the forest for the trees: As Ja’han explained very well, the effort launched by DeSantis and his allies is part of an authoritarian-style push in which partisans are exploring using the power of the state to punish a business for criticizing one of their regressive policies.\nWhat we’re witnessing isn’t a change in Republican Party orthodoxy related to the free market, but rather, a corruption of that orthodoxy. Prominent GOP officials want corporate partners, so long as they’re silent partners.\nThose who fall out of line, and dare to express societal opinions that Republicans find inconvenient, should expect adverse governmental consequences.\nIndeed, there is no subtlety to any of this. A prime-time Fox News host told viewers last week that the next time the GOP is in the majority, companies such as Disney should expect the government to retaliate in a variety of ways, including anti-trust measures and copyright/trademark protections.\nThe power of the state will serve as an extension of the Republican Party’s cultural grievances, and businesses whose opinions are deemed unacceptable will be punished accordingly. Corporate giants that appear \"woke\" should expect to be bullied into submission by those controlling the levers of governmental power.\nWe saw some of this kind of corruption during Donald Trump’s presidency, when the White House was credibly accused of making administrative decisions based on whether he saw corporations as political foes. The message at the time was that businesses expecting fair treatment from the administration had to “play ball” with the president’s wishes.\nIn 2022, that message is being amplified by some the GOP’s most powerful voices.\nIndeed, new rules appear to be taking shape. As the Republican Party now sees it, corporations are allowed to give money to the GOP, stand in the way of unionization efforts, pollute, and partner with Republicans in opposition to economic measures such as minimum wage increases and paid family-leave proposals.\nBut by the same rules, as the Republican Party now sees it, corporations are not allowed to support voting rights, endorse LGBTQ+ rights, take steps to end the pandemic, call for debt-ceiling increases, or cooperate with congressional investigations the party don’t like.\nThe Washington Post’s Greg Sargent added yesterday, “Some on the right, particularly the new nationalists seeking to build a post-Trump Trumpism, actually do believe the state should be weaponized to fight the culture wars as aggressively as possible.” They appear to have more than a few allies in the contemporary GOP.\nRelated:"
    },
    {
      "url": "https://www.pbs.org/newshour/politics/singaporeans-bemoan-sen-cottons-ignorant-grilling-of-tiktok-ceo",
      "text": "By — Zen Soo, Associated Press Zen Soo, Associated Press Leave your feedback Share Copy URL https://www.pbs.org/newshour/politics/singaporeans-bemoan-sen-cottons-ignorant-grilling-of-tiktok-ceo Email Facebook Twitter LinkedIn Pinterest Tumblr Share on Facebook Share on Twitter Singaporeans bemoan Sen. Cotton’s ‘ignorant’ grilling of TikTok CEO Politics Feb 2, 2024 1:59 PM EDT SINGAPORE (AP) — After a U.S. senator grilled the Singaporean CEO of TikTok about his nationality and suggested he was affiliated with the Chinese Communist Party, Singaporeans are complaining about ignorant — or even racist — views of their country. TikTok CEO Shou Chew and executives of other technology firms such as Meta, X and Snap testified Wednesday before U.S. lawmakers on online harm to children from social media. During the hearing, Chew was repeatedly questioned about his nationality and possible affiliations to the Chinese Communist Party by Sen. Tom Cotton, R-Ark. TikTok, which is operated by the Chinese firm ByteDance, has over 150 million users in America. U.S. lawmakers have regarded TikTok with considerable suspicion over whether its data can be accessed by the Chinese government and whether the app can be used to expand China’s influence. Chinese companies are required to set up Communist Party cells. “You said today, as you often say, that you live in Singapore. Of what nation are you a citizen?” Cotton asked. WATCH: Why Universal Music Group is pulling songs from TikTok Chew affirmed that he is Singaporean — which does not allow its citizens to hold dual citizenship — but Cotton pressed on, asking if Chew was a citizen of any other nation, and if he had ever applied for Chinese citizenship. China also does not permit dual nationality, and rarely accepts applications for citizenship. When Chew responded no to both questions, Cotton asked if he had ever been a member of the Chinese Communist Party or have had any affiliation to it. “No Senator, again, I’m Singaporean,” Chew responded, visibly perplexed. The party requires members to be Chinese citizens. Cotton’s line of questioning was described as “McCarthy-esque” by The Washington Post. Clips of the exchange posted on social media platforms drew tens of thousands of views. An Instagram reel of the exchange uploaded by Singapore flagship newspaper The Straits Times drew nearly 2,000 comments, most criticizing or mocking Cotton for his line of questioning. “Senator, do you know where Singapore is?” one person asked. Another remarked that “just because he looks Chinese, doesn’t mean he’s Chinese.” About 75 percent of Singapore’s approximately 5.9 million population is ethnically Chinese, a result of Chinese immigrants moving to Singapore in the 1800s and early 1900s. Many young Singaporeans today do not identify with China as a cultural motherland. READ MORE: Singapore executes man convicted of coordinating delivery of 2 pounds of cannabis Wednesday’s hearing was Chew’s second time appearing before U.S. lawmakers. He first testified in front of lawmakers in March 2023. That grilling lasted six hours, with lawmakers asking questions about TikTok’s data security and harmful content on the platform. Jojo Choo, an assistant marketing manager in her 30s, said she was happy to see a Singaporean appearing in Congress at first. “Initially I felt pride because the CEO of such a huge company is actually someone from Singapore,” she said. “But I quickly realized how ignorant the senator’s questions were.” Choo said the Cotton’s questions were tinged with racism and it was “narrow-minded” to assume that someone who’s ethnically Chinese would be affiliated with China. Another Singaporean, Fian Fazlie, said he was “completely baffled yet amused” at the senator’s questioning. “He’s just being ignorant and he’s still justifying (his words) in his latest Instagram post,” Fazlie, who works in the public transport sector, said about Cotton. Cotton posted a clip of himself giving an interview on Fox News to Instagram, stating in the caption that Chew had “a lot of explaining to do.” “Of course, you can be affiliated with or associated with the Chinese Communist Party anywhere in the world,” Cotton said on Fox News, adding that the Biden administration has many cases against U.S. citizens suspected of collaborating or working with the Chinese Communist Party. “Singapore unfortunately is one of the places in the world that has the highest degree of infiltration and influence by the Chinese Communist Party,” said Cotton. It’s unclear what Cotton’s claims about Singapore were based on. The 41-year-old Chew is a native of Singapore, where he lives with his wife Vivian Kao and their three children. Prior to joining TikTok, Chew worked for five years at Xiaomi, a Chinese smartphone company. Before that, he was a partner at the venture capital firm DST Global and earlier worked at Goldman Sachs. We're not going anywhere. Stand up for truly independent, trusted news that you can count on! Donate now By — Zen Soo, Associated Press Zen Soo, Associated Press\nSINGAPORE (AP) — After a U.S. senator grilled the Singaporean CEO of TikTok about his nationality and suggested he was affiliated with the Chinese Communist Party, Singaporeans are complaining about ignorant — or even racist — views of their country. TikTok CEO Shou Chew and executives of other technology firms such as Meta, X and Snap testified Wednesday before U.S. lawmakers on online harm to children from social media. During the hearing, Chew was repeatedly questioned about his nationality and possible affiliations to the Chinese Communist Party by Sen. Tom Cotton, R-Ark. TikTok, which is operated by the Chinese firm ByteDance, has over 150 million users in America. U.S. lawmakers have regarded TikTok with considerable suspicion over whether its data can be accessed by the Chinese government and whether the app can be used to expand China’s influence. Chinese companies are required to set up Communist Party cells. “You said today, as you often say, that you live in Singapore. Of what nation are you a citizen?” Cotton asked. WATCH: Why Universal Music Group is pulling songs from TikTok Chew affirmed that he is Singaporean — which does not allow its citizens to hold dual citizenship — but Cotton pressed on, asking if Chew was a citizen of any other nation, and if he had ever applied for Chinese citizenship. China also does not permit dual nationality, and rarely accepts applications for citizenship. When Chew responded no to both questions, Cotton asked if he had ever been a member of the Chinese Communist Party or have had any affiliation to it. “No Senator, again, I’m Singaporean,” Chew responded, visibly perplexed. The party requires members to be Chinese citizens. Cotton’s line of questioning was described as “McCarthy-esque” by The Washington Post. Clips of the exchange posted on social media platforms drew tens of thousands of views. An Instagram reel of the exchange uploaded by Singapore flagship newspaper The Straits Times drew nearly 2,000 comments, most criticizing or mocking Cotton for his line of questioning. “Senator, do you know where Singapore is?” one person asked. Another remarked that “just because he looks Chinese, doesn’t mean he’s Chinese.” About 75 percent of Singapore’s approximately 5.9 million population is ethnically Chinese, a result of Chinese immigrants moving to Singapore in the 1800s and early 1900s. Many young Singaporeans today do not identify with China as a cultural motherland. READ MORE: Singapore executes man convicted of coordinating delivery of 2 pounds of cannabis Wednesday’s hearing was Chew’s second time appearing before U.S. lawmakers. He first testified in front of lawmakers in March 2023. That grilling lasted six hours, with lawmakers asking questions about TikTok’s data security and harmful content on the platform. Jojo Choo, an assistant marketing manager in her 30s, said she was happy to see a Singaporean appearing in Congress at first. “Initially I felt pride because the CEO of such a huge company is actually someone from Singapore,” she said. “But I quickly realized how ignorant the senator’s questions were.” Choo said the Cotton’s questions were tinged with racism and it was “narrow-minded” to assume that someone who’s ethnically Chinese would be affiliated with China. Another Singaporean, Fian Fazlie, said he was “completely baffled yet amused” at the senator’s questioning. “He’s just being ignorant and he’s still justifying (his words) in his latest Instagram post,” Fazlie, who works in the public transport sector, said about Cotton. Cotton posted a clip of himself giving an interview on Fox News to Instagram, stating in the caption that Chew had “a lot of explaining to do.” “Of course, you can be affiliated with or associated with the Chinese Communist Party anywhere in the world,” Cotton said on Fox News, adding that the Biden administration has many cases against U.S. citizens suspected of collaborating or working with the Chinese Communist Party. “Singapore unfortunately is one of the places in the world that has the highest degree of infiltration and influence by the Chinese Communist Party,” said Cotton. It’s unclear what Cotton’s claims about Singapore were based on. The 41-year-old Chew is a native of Singapore, where he lives with his wife Vivian Kao and their three children. Prior to joining TikTok, Chew worked for five years at Xiaomi, a Chinese smartphone company. Before that, he was a partner at the venture capital firm DST Global and earlier worked at Goldman Sachs. We're not going anywhere. Stand up for truly independent, trusted news that you can count on! Donate now"
    }
  ],
  "argos_summary": "The Trump administration is targeting Intel CEO Lip-Bu Tan, accusing him of conflicts due to his investments linked to China, amid broader efforts to exert political pressure on American companies. Tan's recent meeting with Trump followed a letter from Senator Tom Cotton raising concerns about his ties to Chinese military interests, although Intel maintains that Tan has complied with conflict of interest disclosures. Meanwhile, Elon Musk's influence in the Trump administration raises questions about his pro-China sentiments, especially as he navigates significant business interests in China, including Tesla's operations and investments.",
  "argos_id": "NS89AH29Q"
}