{
  "url": "https://www.bbc.com/news/articles/cjr119nrwj5o",
  "authorsByline": "George Carden",
  "articleId": "e10ce3c308d54c3f94a36fd333a867ac",
  "source": {
    "domain": "bbc.com",
    "paywall": false,
    "location": {
      "country": "gb",
      "state": "",
      "county": "",
      "city": "London",
      "coordinates": {
        "lat": 51.5073219,
        "lon": -0.1276474
      }
    }
  },
  "imageUrl": "https://ichef.bbci.co.uk/news/1024/branded_news/4316/live/dd285e10-76af-11f0-8155-5f8739f897b4.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T05:16:34.684000+00:00",
  "addDate": "2025-08-12T05:32:23.663624+00:00",
  "refreshDate": "2025-08-12T05:32:23.663627+00:00",
  "score": 1.0,
  "title": "Ikea set to open first Sussex store in Brighton",
  "description": "The new branch of Ikea opens on Thursday and will replace a former Debenhams unit in Churchill Square.",
  "content": "Ikea set to open first Sussex store in Brighton\n\nIkea is set to open the doors to its new store in Brighton in a move which is bringing more than 150 jobs to the city. The new branch - its first in Sussex - opens on Thursday, replacing a former Debenhams unit, with about 6,700 sq m of retail space across two floors. Churchill Square manager Mark Buchanan-Smith said he was \"super excited\" and it was \"brilliant\" to have Ikea as its \"main anchor\". However, one local shopkeeper has spoken of her trepidation at the arrival of the Swedish retail giant.\n\nMartha Tiffin, who co-owns and runs the nearby independent houseware shop, Utility, said: \"Obviously, we cannot compete on price [but] if we can survive this, we can survive anything.\"\n\nIkea's parent company, Ingka, bought Churchill Square shopping centre for an estimated £145m in November 2023. The new shop is smaller than many Ikea sites so certain furniture items will be delivered or available for click and collect. Previous plans for a full-size shop in Lancing were axed in 2021 with the company blaming changing customer habits. Mr Buchanan-Smith said those wishing to go to Ikea have previously had to travel to Southampton or East Croydon.\n\nMinutes away in the North Laines, George Diplocks, who runs the consignment shop Diplock's Yard, said the new Ikea \"won't make a difference\" to his business. \"Small businesses are going under anyway,\" he said, adding the proliferation of cafes and restaurants around his business meant people were not coming to the area to shop. Meanwhile, Ikea manager Karina Gilpin, said the new store would have \"everything you need for the home under one roof\" as well as food to eat in or take away. \"We're a Swedish company so to be able to share with Brightonians Swedish meatballs and the dime cake, it's very important for us,\" she added.",
  "medium": "Article",
  "links": [
    "https://www.facebook.com/BBCSussex/",
    "https://x.com/BBCSussex",
    "https://www.instagram.com/accounts/login/?next=https%3A%2F%2Fwww.instagram.com%2Fbbcsussex%2F%3Fhl%3Den&is_from_rle",
    "https://www.bbc.co.uk/news/articles/cj0mge849jpo",
    "https://www.bbc.com/news/topics/cmgm211ekwnt",
    "https://www.bbc.com/news/topics/cgmxj6eyylxt",
    "https://www.bbc.com/news/topics/cewrlqmeyzvt"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "many Ikea sites",
      "weight": 0.09400403
    },
    {
      "name": "Ikea manager Karina Gilpin",
      "weight": 0.09250358
    },
    {
      "name": "Ikea",
      "weight": 0.09242998
    },
    {
      "name": "first Sussex store",
      "weight": 0.08842591
    },
    {
      "name": "Brightonians Swedish meatballs",
      "weight": 0.07465961
    },
    {
      "name": "Churchill Square shopping centre",
      "weight": 0.07455215
    },
    {
      "name": "Small businesses",
      "weight": 0.06801105
    },
    {
      "name": "Churchill Square",
      "weight": 0.067636125
    },
    {
      "name": "certain furniture items",
      "weight": 0.064450145
    },
    {
      "name": "retail space",
      "weight": 0.062269546
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Business"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.97900390625
    },
    {
      "name": "/News/Local News",
      "score": 0.9580078125
    },
    {
      "name": "/Shopping/Mass Merchants & Department Stores",
      "score": 0.8974609375
    },
    {
      "name": "/News/Other",
      "score": 0.376953125
    },
    {
      "name": "/Food & Drink/Food & Grocery Retailers/Other",
      "score": 0.348876953125
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.30908203125
    }
  ],
  "sentiment": {
    "positive": 0.18246195,
    "negative": 0.40328053,
    "neutral": 0.41425756
  },
  "summary": "Ikea is set to open its first Sussex store in the city, replacing a former Debenhams unit with about 6,700 sq m of retail space across two floors. The move is expected to bring more than 150 jobs to the city. However, local shopkeeper, Martha Tiffin, expressed concern over the potential impact on small businesses. The store's parent company, Ingka, bought the shopping centre for an estimated £145m in November 2023.",
  "shortSummary": "Ikea is opening its first store in Brighton, bringing over 150 jobs to the city, despite local concerns about competition.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "febd1b5c07ff4ac08565e849bfa69432",
  "places": [
    {
      "osmId": "96345720",
      "road": "Russell Place",
      "suburb": "Brunswick",
      "city": "Brighton",
      "county": "Brighton and Hove",
      "state": "England",
      "postcode": "BN1 2TE",
      "country": "United Kingdom",
      "countryCode": "gb",
      "amenity": "Churchill Square",
      "coordinates": {
        "lat": 50.822442800000005,
        "lon": -0.1470862316504004
      }
    }
  ],
  "scraped_sources": [
    {
      "url": "https://www.bbc.co.uk/news/articles/cj0mge849jpo",
      "text": "New Brighton city centre Ikea to open next month\n- Published\nIkea will open its new two-storey shop in Brighton on 14 August, the retailer has confirmed.\nThe Swedish homeware store will launch its new two-storey, 6,695 sq m (72,064 sq ft) site as the anchor unit for Churchill Square Shopping Centre.\nThe new shop will be the first time that the unit in Churchill Square has been filled since Debenhams closed in May 2021 as the brand disappeared from the High Street during the Covid-19 pandemic.\nKaren Gilpin, market manager of the store, said the opening is \"a celebration of Brighton's bold personality\".\nThe opening of Ikea in Churchill Square comes after the shopping centre was bought by the Ingka Centres, part of the group which also owns Ikea.\nIngka bought the shopping centre in November 2023 in a deal estimated to be worth £145m.\n'Vote of confidence'\nThe store is the latest of Ikea's smaller High Street shops, as opposed to its full-sized sites which first opened in the UK in 1987.\nPrevious plans for a full-size Ikea shop in Lancing were axed in 2021 with the company blaming changing customer habits.\nBella Sankey, leader of Brighton and Hove City Council, said the opening of the new shop is a \"real vote of confidence\" in the city, bringing new jobs and investment into the local economy.\nAn Ikea pop-up shop, opened in Churchill Square ahead of the new development, will close on 10 August.\nFollow BBC Sussex on Facebook, external, on X, external, and on Instagram, external. Send your story ideas to southeasttoday@bbc.co.uk, external or WhatsApp us on 08081 002250.\nRelated topics\n- Published13 November 2023\n- Published21 March\n- Published17 April"
    },
    {
      "url": "https://www.bbc.com/news/topics/cgmxj6eyylxt",
      "text": "Brighton1 hr agoIkea set to open first Sussex store in BrightonThe new branch of Ikea opens on Thursday and will replace a former Debenhams unit in Churchill Square.1 hr ago2 days ago'Lourdes trip reminded me nursing is a loving act'Lourdes trip gives University of Brighton nurses an insight into person-centred care.2 days ago3 days agoCall for knitted roses ahead of Rugby World CupPeople have until Sunday to submit knitted and crocheted red roses to Jubilee Library in Brighton. 3 days ago4 days agoMeasles warning for parents in East SussexEast Sussex parents are urged to check whether their children are up to date with vaccinations.4 days ago4 days agoBrighton could be next 'silicon valley' of gamingThe latest instalment of the Mafia series, developed in Brighton, is released on Friday.4 days ago5 days agoMariah Carey hails 'amazing' Brighton Pride crowdThe five-time Grammy winner headlined the Brighton Pride event in Preston Park on Saturday.5 days ago5 days agoAlbion's three-storey car park plan approvedA three-storey, 43-space car park will be built into an earth bank near the club's Falmer stadium.5 days ago6 days agoRollercoaster record on track despite Storm FlorisThrill-seeker Dean Stokes had wanted to go on 120 rollercoasters across 32 theme parks in 16 days. 6 days ago6 days agoAlbion plans to build new three-storey car parkPlanning officers are recommending that councillors approve the football club's application.6 days ago..."
    },
    {
      "url": "https://www.bbc.com/news/topics/cmgm211ekwnt",
      "text": "Lancing1 hr agoIkea set to open first Sussex store in BrightonThe new branch of Ikea opens on Thursday and will replace a former Debenhams unit in Churchill Square.1 hr ago17 Jul 2025Delays on A27 after truck hits central reservationPart of the eastbound carriageway was closed while the car was removed and repairs carried out.17 Jul 202510 Jul 2025Dead fish and water levels to be tackled at lagoonWorld of Widewater in Lancing is using a digger on Thursday to clear an outlet pipe.10 Jul 20259 Jul 2025Plans to extend powers to tackle nuisance dogsAdur and Worthing Councils are consulting on plans to ban dogs from more public spaces in the area.9 Jul 202525 Jun 2025'We need more young female football referees'Women's Super League referee Lisa Benn wants more young people to take up refereeing.25 Jun 202512 Jun 2025Race Across the World sisters 'happy' with finaleElizabeth and Letitia, from West Sussex, say they were 'so determined' to win the BBC show.12 Jun 20258 Jun 2025Road junction could be replaced with 'pocket park'Adur District Council says it wants to close a North Farm Road junction to install a new park. 8 Jun 20256 Jun 2025Parking charges introduced for motorcyclesThe changes start from Friday for off-street car parks in the Adur district.6 Jun 20256 May 2025Residents reminded to check bin day due to changesMost residents' rubbish, recycling and garden waste collection dates will change in the new system.6 May 2025..."
    },
    {
      "url": "https://www.bbc.com/news/topics/cewrlqmeyzvt",
      "text": "Ikea1 hr agoIkea set to open first Sussex store in BrightonThe new branch of Ikea opens on Thursday and will replace a former Debenhams unit in Churchill Square.1 hr ago20 Jul 2025Young, curious and fun: How Ikea was a playground for young designersEdinburgh's Dovecot gallery has secured the very first Ikea touring exhibition.20 Jul 202516 Jul 2025New Brighton city centre Ikea to open next monthThe store is the latest of Ikea's smaller High Street shops, as opposed to its full-sized sites.16 Jul 202517 Apr 2025Ikea opens pop-up shop in BrightonThe temporary store will be in Churchill Square shopping centre until the end of July17 Apr 202513 Mar 2025Rescue for £60m regeneration of old Ikea storeWork to transform Coventry's former Ikea building had to stop when the former contractor went into administration.13 Mar 202520 Oct 2024Coventry Ikea project labelled ‘flatpack fantasy’Council bosses will plough on with the £60m scheme to revamp the former Ikea into a cultural hub.20 Oct 202425 Sep 2024Firm behind old Ikea store revamp collapsesISG's UK operations went into administration on Friday.25 Sep 202418 Sep 2024Town's homeless children issue under the spotlightIn Hastings, one in 28 homeless children are in temporary accommodation, Shelter says.18 Sep 20247 Sep 2024Parking spaces to be used as Ikea collection baysIkea will get rid of 64 spaces in the Churchill Square car park to make way for its collection bays.7 Sep 2024..."
    }
  ],
  "argos_summary": "Ikea is set to open its first store in Sussex, located in Brighton, on Thursday, bringing over 150 jobs to the city. The new store, which replaces a former Debenhams unit, will feature approximately 6,700 sq m of retail space and is part of the Churchill Square shopping centre, recently acquired by Ikea's parent company, Ingka. While local business owners express concerns about competition, Ikea aims to provide a comprehensive home goods shopping experience along with Swedish food offerings.",
  "argos_id": "O6UW6O3CB"
}