{
  "url": "https://www.usatoday.com/press-release/story/11905/xcf-global-to-ring-nasdaq-opening-bell-on-august-25-2025/",
  "authorsByline": "accesswire",
  "articleId": "78bf7e6933fa4911be0792247502a214",
  "source": {
    "domain": "usatoday.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "VA",
      "county": "Fairfax County",
      "city": "McLean",
      "coordinates": {
        "lat": 38.9342888,
        "lon": -77.1776327
      }
    }
  },
  "imageUrl": "http://usatoday.xpr-gannett.com/wp-content/uploads/sites/3/2025/05/image-14.webp",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T18:48:36+00:00",
  "addDate": "2025-08-11T20:46:15.064978+00:00",
  "refreshDate": "2025-08-11T20:46:15.064979+00:00",
  "score": 1.0,
  "title": "XCF Global to Ring Nasdaq Opening Bell on August 25, 2025",
  "description": "Marks a key milestone following the company’s public listing and continued growth as a U.S.-listed SAF company Celebrates XCF’s mission to decarbonize the aviation industry through scalable, investor-grade SAF infrastructure Nasdaq Opening Bell Ceremony to be broadcast live from Times Square HOUSTON, TEXAS / ACCESS Newswire / August 7, 2025 / XCF Global, Inc. (“XCF”) […]",
  "content": "• Marks a key milestone following the company’s public listing and continued growth as a U.S.-listed SAF company\n• Celebrates XCF’s mission to decarbonize the aviation industry through scalable, investor-grade SAF infrastructure\n• Nasdaq Opening Bell Ceremony to be broadcast live from Times Square\n\nHOUSTON, TEXAS / ACCESS Newswire / August 7, 2025 / XCF Global, Inc. (“XCF”) (Nasdaq:SAFX), a key player in decarbonizing the aviation industry through Synthetic Aviation Fuel (“SAF”) today announces it will ring the Nasdaq Stock Market Opening Bell on Monday, August 25, 2025. The Opening Bell Ceremony will take place at Nasdaq’s iconic MarketSite in New York City’s Times Square and will be broadcast live on the Nasdaq website and social media platforms.\n\nThe Opening Bell Ceremony marks a major milestone for XCF following its public listing earlier this year and highlights the company’s momentum in building a global platform of renewable fuel production facilities engineered to accelerate the decarbonization of the aviation industry through the adoption of SAF.\n\n“The Nasdaq Opening Bell Ceremony will be a significant moment – not just for XCF, but for everyone who believes in the future of clean flight. XCF offers investors the opportunity to own a piece of the energy transition, backed by real assets, real production, and real momentum. The neat SAF that we have produced during our ramp-up phase is expected to produce approximately 2.4 million gallons of blended SAF to power greener skies. The Ceremony is an exciting moment for our team, our shareholders, and everyone who believes in the power of clean energy to drive long-term value.”\n\nThe Opening Bell Ceremony on 25 August will include remarks from XCF’s executive leadership team and will be streamed live at: https://www.nasdaq.com/marketsite/bell-ringing-ceremony (link will be updated with live URL).\n\nXCF Global, Inc. is a pioneering synthetic aviation fuel company dedicated to accelerating the aviation industry’s transition to net-zero emissions. XCF is developing and operating state-of-the-art clean fuel SAF production facilities engineered to the highest levels of compliance, reliability, and quality. The company is actively building partnerships across the energy and transportation sectors to accelerate the adoption of SAF on a global scale. XCF is listed on the Nasdaq Capital Market and trades under the ticker, SAFX. Current outstanding shares: ~149.3 million; <20% free float (as of 07 August 2025).\n\nThis Press Release includes “forward-looking statements” within the meaning of the “safe harbor” provisions of the United States Private Securities Litigation Reform Act of 1995. In some cases, you can identify forward-looking statements by terminology such as “may”, “should”, “expect”, “intend”, “will”, “estimate”, “anticipate”, “believe”, “predict”, “potential” or “continue”, or the negatives of these terms or variations of them or similar terminology. These forward-looking statements, including, without limitation, statements regarding XCF Global’s expectations with respect to future performance and anticipated financial impacts of the recently completed business combination with Focus Impact BH3 Acquisition Company (the “Business Combination”), estimates and forecasts of other financial and performance metrics, and projections of market opportunity and market share, are subject to risks and uncertainties, which could cause actual results to differ materially from those expressed or implied by such forward-looking statements. These forward-looking statements are based upon estimates and assumptions that, while considered reasonable by XCF Global and its management, are inherently uncertain and subject to material change. These forward-looking statements are provided for illustrative purposes only and are not intended to serve as and must not be relied on by any investor as, a guarantee, an assurance, a prediction or a definitive statement of fact or probability. New risks and uncertainties may emerge from time to time, and it is not possible to predict all risks and uncertainties. Factors that may cause actual results to differ materially from current expectations include, but are not limited to: (1) changes in domestic and foreign business, market, financial, political, and legal conditions; (2) unexpected increases in XCF Global’s expenses resulting from potential inflationary pressures and rising interest rates, including manufacturing and operating expenses and interest expenses; (3) the occurrence of any event, change or other circumstances that could give rise to the termination of negotiations and any agreements with regard to XCF Global’s offtake arrangements; (4) the outcome of any legal proceedings that may be instituted against the parties to the Business Combination or others; (5) XCF Global’s ability to meet Nasdaq’s continued listing standards; (6) XCF Global’s ability to integrate the operations of New Rise and implement its business plan on its anticipated timeline; (7) XCF Global’s ability to raise financing in the future and the terms of any such financing; (8) the New Rise Reno production facility’s ability to produce the anticipated quantities of SAF without interruption or material changes to the SAF production process; (9) XCF Global’s ability to resolve current disputes between its New Rise subsidiary and its landlord with respect to the ground lease for the New Rise Reno facility; (10) XCF Global’s ability to resolve current disputes between its New Rise subsidiary and its primary lender with respect to loans outstanding that were used in the development of the New Rise Reno facility; (11) costs related to the Business Combination and the New Rise acquisitions; (12) the risk of disruption to the current plans and operations of XCF Global as a result of the consummation of the Business Combination; (13) XCF Global’s ability to recognize the anticipated benefits of the Business Combination and the New Rise acquisitions, which may be affected by, among other things, competition, the ability of XCF Global to grow and manage growth profitably, maintain relationships with customers and suppliers and retain its management and key employees; (14) changes in applicable laws or regulations; (15) risks related to extensive regulation, compliance obligations and rigorous enforcement by federal, state, and non-U.S. governmental authorities; (16) the possibility that XCF Global may be adversely affected by other economic, business, and/or competitive factors; (17) the availability of tax credits and other federal, state or local government support; (18) risks relating to XCF Global’s and New Rise’s key intellectual property rights; (19) the risk that XCF Global’s reporting and compliance obligations as a publicly-traded company divert management resources from business operations; (20) the effects of increased costs associated with operating as a public company; and (21) various factors beyond management’s control, including general economic conditions and other risks, uncertainties and factors set forth in XCF Global’s filings with the Securities and Exchange Commission (“SEC”), including the final proxy statement/prospectus relating to the Business Combination filed with the SEC on February 6, 2025, this Press Release and other filings XCF Global makes with the SEC in the future. If any of the risks actually occur, either alone or in combination with other events or circumstances, or XCF Global’s assumptions prove incorrect, actual results could differ materially from the results implied by these forward-looking statements. There may be additional risks that XCF Global does not presently know or that it currently believes are not material that could also cause actual results to differ from those contained in the forward-looking statements. In addition, forward-looking statements reflect XCF Global’s expectations, plans or forecasts of future events and views as of the date of this Press Release. These forward-looking statements should not be relied upon as representing XCF Global’s assessments as of any date subsequent to the date of this Press Release. Accordingly, undue reliance should not be placed upon the forward-looking statements. While XCF Global may elect to update these forward-looking statements at some point in the future, XCF Global specifically disclaims any obligation to do so.",
  "medium": "Article",
  "links": [
    "https://www.accessnewswire.com/",
    "https://pr.report/d1wy",
    "https://pr.report/d1w5",
    "https://www.accessnewswire.com/newsroom/en/clean-technology/xcf-global-to-ring-nasdaq-opening-bell-on-august-25-2025-1057818"
  ],
  "labels": [
    {
      "name": "Press Release"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "XCF Global",
      "weight": 0.10996462
    },
    {
      "name": "XCF",
      "weight": 0.08794802
    },
    {
      "name": "New Rise",
      "weight": 0.07087966
    },
    {
      "name": "New Rise Reno",
      "weight": 0.070294686
    },
    {
      "name": "other risks",
      "weight": 0.06634217
    },
    {
      "name": "Nasdaq Opening Bell Ceremony",
      "weight": 0.06331016
    },
    {
      "name": "XCF Global’s expenses",
      "weight": 0.0618181
    },
    {
      "name": "XCF Global’s expectations",
      "weight": 0.061710697
    },
    {
      "name": "XCF Global’s offtake arrangements",
      "weight": 0.061401706
    },
    {
      "name": "XCF Global’s assumptions",
      "weight": 0.061066728
    }
  ],
  "topics": [
    {
      "name": "Stocks"
    },
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.994140625
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.97802734375
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.955078125
    },
    {
      "name": "/Business & Industrial/Aerospace & Defense/Aviation Industry",
      "score": 0.5078125
    },
    {
      "name": "/Travel & Transportation/Transportation/Air Travel",
      "score": 0.39697265625
    }
  ],
  "sentiment": {
    "positive": 0.8150517,
    "negative": 0.021848032,
    "neutral": 0.1631002
  },
  "summary": "XCF Global, Inc. (XCF) (Nasdaq:SAFX), a key player in decarbonizing the aviation industry through Synthetic Aviation Fuel (SAF), will ring the Nasdaq Stock Market Opening Bell on August 25, 2025. The Opening Bell Ceremony will take place at Nasdaq’s MarketSite in Times Square and will be broadcast live on Nasdaq website and social media platforms. This milestone follows XCF's public listing and growth as a U.S.-listed SAF company. XCF Global is developing and operating state-of-the-art clean fuel SAF production facilities designed to meet regulatory requirements. The company is also building partnerships across the energy and transportation sectors to accelerate the adoption of SAF on a global scale.",
  "shortSummary": "XCF Global will ring the Nasdaq Opening Bell on August 25, 2025, celebrating its progress in decarbonizing aviation through synthetic aviation fuel infrastructure.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "e7167d7d1cb0482bb51c4a95b203992a",
  "places": [
    {
      "osmId": "14942838",
      "road": "Times Square",
      "suburb": "Manhattan",
      "city": "New York",
      "county": "New York County",
      "state": "New York",
      "country": "United States",
      "countryCode": "us",
      "coordinates": {
        "lat": 40.75701215,
        "lon": -73.98597092538824
      }
    }
  ],
  "scraped_sources": [
    {
      "url": "https://pr.report/d1w5",
      "text": "Pardon our appearance\nWe are actively working to enhance your experience by translating more content. However, please be aware that the page you are about to visit has not yet been translated.\nWe appreciate your undertanding and patience as we continue to imporove our services.\nNasdaq MarketSite\nCelebrate Your Success\nAs a Nasdaq-Listed company, you will get to experience the power of our iconic bell ringing ceremony at MarketSite, streamed live from the heart of Times Square and broadcasted on television to a global audience.\nNasdaq Daily Bell Ceremonies\nLearn more about the guests ringing the bell, watch the ceremony and view ceremony photos.\nClosing Bell\nThe Experience\nA Curated Experience\nEach Bell Ceremony is carefully planned and choreographed by our world class team of event producers to deliver an unforgettable experience for you and your guests. We are with you from the moment you book your Bell Ceremony to those final moments counting down to open or close the markets.\nGlobal Brand Recognition\nDuring this special moment, your company will gain global recognition from networks such as CNBC, Fox Business, and Bloomberg, reaching millions of viewers.\nOn-Site Photo & Video\nOur on-site photographer will capture every special moment of your group from the Bell Ceremony to photos in Times Square with your branding on the Nasdaq Tower. Each Bell Ceremony includes one-hour of exclusive advertising at the crossroads of the world, on our 7-story high Nasdaq Tower. High-resolution photos will be shared with guests the day-of their event.\nA Look at Past Bell Ceremonies\nGiving Back\nWhile the Nasdaq Bell Ceremony is primarily reserved for listed companies, occasionally opportunities arise where we can extend the bell ringing opportunity to non-profit organizations doing good."
    }
  ],
  "argos_summary": "XCF Global, Inc. will ring the Nasdaq Stock Market Opening Bell on August 25, 2025, marking a significant milestone following its public listing. The ceremony, which will be broadcast live from Times Square, celebrates XCF's mission to decarbonize the aviation industry through scalable synthetic aviation fuel (SAF) infrastructure. The company aims to produce approximately 2.4 million gallons of blended SAF, emphasizing its commitment to clean energy and the energy transition.",
  "argos_id": "O6VIUA4G1"
}