{
  "url": "https://www.zdnet.com/article/how-i-got-another-15gb-of-gmail-storage-at-no-cost-and-without-losing-old-files/",
  "authorsByline": "Chris Bayer",
  "articleId": "6d649ec424a242c288077b78aec3cb27",
  "source": {
    "domain": "zdnet.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://www.zdnet.com/a/img/resize/84348957305f56a20b147bce2b1309885e207f72/2025/04/23/e46a52f9-0076-41dc-a648-5e3bb81de2db/gmail-on-android-is-about-to-make-it-a-whole-lot-easier-to-clean-out-your-inbox.jpg?auto=webp&fit=crop&height=675&width=1200",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T18:15:00+00:00",
  "addDate": "2025-08-11T20:32:13.447108+00:00",
  "refreshDate": "2025-08-11T20:32:13.447109+00:00",
  "score": 1.0,
  "title": "How I got another 15GB of Gmail storage at no cost (and without losing old files)",
  "description": "Back up all your Google messages and media for free - no matter your account type - with this quick, hassle-free method.",
  "content": "Every new Google email account comes with 15GB of free storage -- a solid offer at no cost. However, that space can fill up fast, especially since it also covers files in Google Drive and Google Photos.\n\nIf your inbox is cluttered with unread newsletters and sneaky spam, there's a way to clean house without losing important messages. With the right approach, you can preserve what matters while giving yourself a fresh start.\n\nAlso: Gmail is making it a whole lot easier to clean out your inbox on Android\n\nThere is always the option of manually cleaning out your Gmail inbox or downloading some material to your local drive. What a pain, though, right? And, chances are, you'll only eliminate so much junk before those gigabytes start stacking up again.\n\nI should note that Google offers a way to pay for more storage by upgrading to a Google One account. The \"Basic\" plan costs $24 per year for 100GB. The free solution, however, lies in taking a few steps to back up your essential files and reset your data capacity.\n\n1. Back up your files, at least temporarily\n\nIf you're going through this process, you're likely serious about retaining emails that could span years. So, as an added safety measure, it's a good practice to back up your emails on your computer or an external hard drive before transferring them back into the cloud.\n\nAlso: 6 hidden Android features every user should know - and how they make life easier\n\nTo do this, go to Google Takeout and select \"Google Photos\" and/or \"Drive\" as the products you wish to export, then follow the prompts. (Once you've completed the transfer, you can delete and free up your hard disk drive (HDD) for other uses.) Be aware that this process can take a while, depending on your quantity of emails and number of gigabytes. To give you an idea, CNET's Jason Chun used Google Takeout with a test Gmail account that held about 75,000 emails, and this wholesale download took around two hours to complete.\n\n2. Prepare to transfer your Gmails to a new email account\n\nNow that you've saved a copy of your emails, it's time to transfer them. To do this:\n• None Log into your original Gmail account and click the gear icon in the top right corner. Then click \"See all settings.\"\n• None Select the Forwarding POP/IMAP tab. Then select the option \"Enable POP for all mail.\" (POP stands for Post Office Protocol).\n• None You'll have several options under \"When messages are accessed with POP.\" Select delete Gmail's copy to automatically delete the emails from your original account after the transfer.\n\n3. Create a second (archive) account and transfer your messages\n\nAt this point, you can create your new account and transfer all your messages there:\n• None To create a new inbox-zero Gmail account, go here. This new one will serve as your archive account.\n• None Log into your new archive account, click the gear icon in the top right, and select \"See all settings.\"\n• None Select the Accounts and Import tab at the top. Then select \"Add a mail account\" next to \"Check mail from other accounts.\"\n• None In the pop-up window, enter the name of your original Gmail account, then select \"Next.\"\n• None Select \"Import emails from my other account (POP3),\" and then select \"Next\" again.\n\n6. Enter the password of your original Gmail account.\n\nAlso: Notion Mail offers AI perks - but skips a few crucial Notion features\n\nNote that you might also need to whip up a temporary Google app password to sync the accounts. So, if your original Gmail account password doesn't work at this step, visit https://myaccount.google.com/apppasswords to create a temporary 16-digit passcode.\n\nSimply create a name for the password, such as \"Email Transfer,\" then hit \"Create.\" A pop-up window with your new 16-digit passcode will display. Here, you should jot it down or take a screenshot until you can discard this password. Google will only show it to you once!\n\n7. Once you've synced your accounts, find Port and select \"995.\"\n\n8. Next, you'll want to check three boxes:\n• None Always use a secure connection (SSL) when retrieving mail\n\nWhat's next, now that your accounts are synced?\n\nThe email migration process will automatically begin after successfully connecting your new Gmail archive account to your primary account. How long this takes also depends on the volume of emails being transferred. For example, CNET's test transfer of 75,000 messages found that it took about two full days to complete the transfer of all messages and media to a new archived mail account.\n\nOnce that step is complete, your original Gmail account will toss all your messages into the Trash folder, which you must empty manually. According to Chun, deleting 75,000 messages from the Trash took about an hour.\n\nFurther, keep in mind that Gmail will not transfer your Drafts and Spam folders. In my opinion, this is a good thing for the latter, but do be sure you don't have any loose-end messages hanging around in your Drafts folder. You can always email them to yourself to finish later.\n\nAlso: Why you need a data backup plan for your Mac or PC - before disaster strikes\n\nAt this point, there are three final steps to stop the automatic transfer process so that you can continue using your original account, starting anew at inbox zero.\n• None Login to your new account. Click the gear icon and select \"See all settings.\"\n• None Select the Accounts and Import tab. Under \"Check mail from other accounts,\" select \"Delete\" for your original account.\n• None Select \"OK\" when prompted to \"Confirm delete mail account.\"\n\nFollowing the steps above is at least less daunting of a chore than manually sifting through countless messages and media to determine what you want to keep for eternity. Now you can enjoy the long-forgotten experience of having a clean new inbox while maintaining years' worth of older stuff -- with 15 free gigabytes to go.",
  "medium": "Article",
  "links": [
    "https://www.zdnet.com/article/should-you-upgrade-to-mesh-i-compared-it-with-a-traditional-wi-fi-router-and-heres-my-advice/",
    "https://www.zdnet.com/article/gmail-is-making-it-a-whole-lot-easier-to-clean-out-your-inbox-on-android/",
    "https://support.google.com/drive/answer/2375123?hl=en&co=GENIE.Platform%3DDesktop",
    "https://www.cnet.com/tech/services-and-software/too-much-email-get-back-15gb-of-free-storage-for-your-gmail-account/",
    "https://www.zdnet.com/article/i-tested-gpt-5s-coding-skills-and-it-was-so-bad-that-im-sticking-with-gpt-4o-for-now/",
    "https://www.zdnet.com/article/notion-mail-offers-ai-perks-but-skips-a-few-crucial-notion-features/",
    "https://www.zdnet.com/article/i-tried-lenovos-new-rollable-thinkbook-and-cant-go-back-to-regular-sized-screens/",
    "https://support.google.com/mail/answer/56256?hl=en",
    "https://takeout.google.com/#link=%7B%22role%22:%22standard%22,%22href%22:%22https://takeout.google.com/%22,%22target%22:%22%22,%22absolute%22:%22%22,%22linkText%22:%22Google%20Takeout%22%7D",
    "https://myaccount.google.com/apppasswords#link=%7B%22role%22:%22standard%22,%22href%22:%22https://myaccount.google.com/apppasswords%22,%22target%22:%22_blank%22,%22absolute%22:%22%22,%22linkText%22:%22https://myaccount.google.com/apppasswords%22%7D",
    "https://www.zdnet.com/home-and-office/work-life/why-you-need-a-data-backup-plan-for-your-mac-or-pc-before-disaster-strikes/",
    "https://www.zdnet.com/article/how-to-upgrade-an-incompatible-windows-10-pc-to-windows-11-2-free-options/",
    "https://www.zdnet.com/article/6-hidden-android-features-every-user-should-know-and-how-they-make-life-easier/"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "mail account",
      "weight": 0.098153815
    },
    {
      "name": "other accounts",
      "weight": 0.094982624
    },
    {
      "name": "Gmail storage",
      "weight": 0.0794834
    },
    {
      "name": "Every new Google email account",
      "weight": 0.073918976
    },
    {
      "name": "Gmail",
      "weight": 0.072843164
    },
    {
      "name": "your new Gmail archive account",
      "weight": 0.07243818
    },
    {
      "name": "countless messages",
      "weight": 0.06949022
    },
    {
      "name": "messages",
      "weight": 0.06880409
    },
    {
      "name": "your original Gmail account password",
      "weight": 0.068662226
    },
    {
      "name": "important messages",
      "weight": 0.068107374
    }
  ],
  "topics": [
    {
      "name": "Gmail"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Reference/General Reference/How-To, DIY & Expert Content",
      "score": 0.857421875
    }
  ],
  "sentiment": {
    "positive": 0.24215299,
    "negative": 0.1538995,
    "neutral": 0.6039475
  },
  "summary": "The article discusses how to get another 15GB of Gmail storage without losing old files. Every new Google email account comes with 15GB in total, but this storage can quickly grow. The solution is to back up essential files and reset your data capacity. This involves transferring emails from your original Gmail account to a new email account. This process can take a while depending on the volume of emails and number of gigabytes. The process requires a temporary 16-digit passcode to sync the accounts. If the original Gmail password doesn't work, visit https://myaccount.google.com/apppasswords to create a temporary passcode.",
  "shortSummary": "Google's free 15GB Gmail storage offers an easy way to store and transfer important emails to a new Gmail account without losing files.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "01364e5e49174d67abf9737caad04f0e",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.zdnet.com/article/i-tested-gpt-5s-coding-skills-and-it-was-so-bad-that-im-sticking-with-gpt-4o-for-now/",
      "text": "I tested GPT-5's coding skills, and it was so bad that I'm sticking with GPT-4o (for now)\nZDNET's key takeaways\n- OpenAI's new GPT-5 flagship failed half of my programming tests.\n- Previous OpenAI releases have had just about perfect results.\n- Now that OpenAI has enabled fallbacks to other LLMs, there are options.\nSo GPT-5 happened. It's out. It's released. It's the talk of the virtual town. And it's got some problems. I'm not gonna bury the lede. GPT-5 has failed half of my programming tests. That's the worst that OpenAI's flagship LLM has ever done on my carefully designed tests.\nAlso: The best AI for coding in 2025 (and what not to use)\nBefore I get into the details, let's take a moment to discuss one other little feature that's also a bit wonky. Check out the new Edit button on the top of the code dumps it generates.\nClicking the Edit button takes you into a nice little code editor. Here, I replaced the Author field, right in ChatGPT's results.\nThat seemed nice, but it ultimately proved futile. When I closed the editor, it asked me if I wanted to save. I did. Then this unhelpful message showed up.\nI never did get back to my original session. I had to submit my original prompt again, and let GPT-5 do its work a second time.\nBut wait. There's more. Let's dig into my test results…\n1. Writing a WordPress plugin\nThis was my very first test of coding prowess for any AI. It's what gave me that first \"the world is about to change\" feeling, and it was done using GPT-3.5.\nSubsequent tests, using the same prompt but with different AI models, generated mixed results. Some AIs did great, some didn't. Some AIs, like those from Microsoft and Google, improved over time.\nAlso: How I test an AI chatbot's coding ability - and you can, too\nChatGPT's model has been the gold standard for this test since the very beginning. That makes the results of GPT-5 all that much more curious.\nSo, look, the actual coding with GPT-5 was partially successful. GPT-5 generated a single block of code, which I pasted into a file and was able to run. It provided the requisite UI.\nWhen I pasted in the test names, it dynamically updated the line count, although it described it as \"Line to randomize\" instead of \"Lines to randomize.\"\nBut then, when I clicked Randomize, it didn't. Instead, it redirected me to tools.php. What?? ChatGPT has never had a problem with this test, whether GPT-3.5, GPT-4, or GPT-4o. You mean to tell me that OpenAI's much-anticipated GPT-5 is failing right out of the gate? Ouch.\nAlso: How to use GPT-5 in VS Code with GitHub Copilot\nI then gave GPT-5 this prompt.\nWhen I click randomize, I'm taken to http://testsite.local/wp-admin/tools.php. I do not get a list of randomized results. Can you fix?\nThe result was a line to patch. I'm not thrilled with that approach because it requires the user to dig through code and to make no mistakes replacing a line.\nSo, I asked GPT-5 for a full plugin. It gave me the full text of the plugin to copy and paste. This time, it worked.\nThis time, it did randomize the lines. When it encountered duplicates, it separated them from each other, as it was instructed. Finally.\nAlso: I found 5 AI content detectors that can correctly identify AI text 100% of the time\nI'm sorry, OpenAI. I have to fail you on this test. You would have passed if the only error was not using the plural of \"line\" when appropriate. But the fact that it gave me back a non-working plugin on the first try is fail territory, even if the AI did eventually make it work on the second try.\nNo matter how you spin it, this is a step back.\n2. Rewriting a string function\nThis second test is designed to rewrite a string function to better check for dollars and cents. The original code that GPT-5 was asked to rewrite did not allow for cents (it only checked for integers).\nGPT-5 did fine with this test. It did return a minimal result because it didn't do any error checking. It didn't check for non-string input, extra whitespace, thousands separators, or currency symbols.\nBut that's not what I asked for. I told it to rewrite a function, which itself did not have any error checking. GPT-5 did exactly what I asked with no embellishment. I'm kind of glad of that because it doesn't know whether or not code prior to this routine already did that work.\nGPT-5 passed this test.\n3. Finding an annoying bug\nThis test came about because I was struggling with a less-than-obvious bug in my code. Without going into the weeds about how the WordPress framework works, the obvious answer is not the right answer.\nYou need some fairly arcane knowledge about how WordPress filters pass their information. This test has been a stumbling block for more than a few AI LLMs.\nAlso: Gen AI disillusionment looms, according to Gartner's 2025 Hype Cycle report\nGPT-5, however, like GPT-4 and GPT-4o before it, did understand the problem. It articulated a clear solution.\nGPT-5 passed this test.\n4. Writing a script\nThis test asks the AI to incorporate a fairly obscure Mac scripting tool called Keyboard Maestro, as well as Apple's scripting language AppleScript, and Chrome scripting behavior.\nIt's really a test of the reach of the AI in terms of knowledge, its understanding of how web pages are constructed, and the ability to write code across three interlinked environments.\nQuite a few AIs have failed this test, but the failure point is usually a lack of knowledge about Keyboard Maestro. GPT-3.5 didn't know about Keyboard Maestro. But ChatGPT has been passing this test since GPT-4. Until now.\nWhere should we start? Well, the good news is that GPT-5 handled the Keyboard Maestro part of the problem just fine. But it got the coding so wrong that it even doubled down on its lack of understanding of how case works in AppleScript.\nIt actually invented a property. This is one of those cases where an AI confidently presents an answer that is completely wrong.\nAlso: ChatGPT comes with personality presets now - and other upgrades you might have missed\nAppleScript is natively case-insensitive. If you want AppleScript to pay attention to case, you need to use a \"considering case\" block. So, this happened.\nThe reason the error message referred to the title of one of my articles is because that was the front window in Chrome. This function checks the front window and does stuff based on the title.\nBut misunderstanding how case works wasn't the only AppleScript error GPT-5 generated. It also referenced a variable named searchTerm without defining it. That's pretty much an error-creating practice in any programming language.\nFail, fail, fail, McFaildypants.\nThe internet hath spoken\nOpenAI seemed to suffer from the same hubris that its AIs do. It confidently moved everyone to GPT-5 and burned the bridges back to GPT-4o. I'm paying $200 a month for a ChatGPT Pro account. On Friday, I couldn't move back to GPT-4o for coding work. Neither could anyone else.\nThere was, however, just a tiny bit of user pushback on the whole bridges burning thing. And by tiny, I mean the entire frickin' internet. So, by Saturday, ChatGPT had a new option.\nTo get to this, go to your ChatGPT settings and turn on \"Show legacy models.\" Then, as it has always been, just drop down the model menu and choose the one you want. Note: this option is only available to those on paid tiers. If you're using ChatGPT for free, you'll take what you're given, and you'll love it.\nEver since the whole generative AI thing kicked off at the beginning of 2023, ChatGPT has been the gold standard of programming tools, at least according to my LLM testing.\nAlso: Microsoft rolls out GPT-5 across its Copilot suite - here's where you'll find it\nNow? I'm really not sure. This is only a day or so after GPT-5 has been released, so its results will probably get better over time. But for now, I'm sticking with GPT-4o for coding, although I do like the deep reasoning capabilities in GPT-5.\nWhat about you? Have you tried GPT-5 for programming tasks yet? Did it perform better or worse than previous versions like GPT-4o or GPT-3.5? Were you able to get working code on the first try, or GPT-4o did you have to guide it through fixes? Are you going to use GPT-5 for coding or stick with older models? Let us know in the comments below.\nYou can follow my day-to-day project updates on social media. Be sure to subscribe to my weekly update newsletter, and follow me on Twitter/X at @DavidGewirtz, on Facebook at Facebook.com/DavidGewirtz, on Instagram at Instagram.com/DavidGewirtz, on Bluesky at @DavidGewirtz.com, and on YouTube at YouTube.com/DavidGewirtzTV."
    },
    {
      "url": "https://www.zdnet.com/article/i-tried-lenovos-new-rollable-thinkbook-and-cant-go-back-to-regular-sized-screens/",
      "text": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nI tried Lenovo's new rollable ThinkBook and can't go back to regular-sized screens\nThinkBook Plus Gen 6 Rollable\nZDNET's key takeaways\n- The ThinkBook Plus Gen 6 is available now, starting at $3,300.\n- The 120Hz, OLED, portrait-style 16.7-inch display delivers an expansive workspace, supported by a haptic touchpad.\n- It has limited I/O, has some visible creasing on the rollable display, and has a sky-high price.\nLenovo unveiled its \"rollable\" laptop at CES two years ago as a wild proof of concept that turned heads, but left consumers skeptical. Well, the company has since proved its point: the ThinkBook Plus Gen 6 Rollable is now available to consumers for an eye-watering $3,300, but packed with premium design elements, solid hardware, and a 120Hz OLED display that extends to almost 17 inches at the press of a button.\nAlso: Lenovo's $3,000 rollable ThinkBook laptop is officially available to buy - know this before you do\nI've been using the ThinkBook Plus for over a week as my main laptop, and I have to admit, I'm enamored by the extendable screen, particularly as a productivity machine for work.\nBut as the first of its kind, it's far from perfect. There are a handful of trade-offs due to the laptop's form, and the sky-high price invites a critical eye to every element of its design. That being said, it is ultimately a well-engineered laptop. Let's take a closer look.\nLike all ThinkBooks, the laptop exudes business, featuring a metallic, two-tone design. It's not my favorite aesthetic, but it's certainly durable and resists fingerprints way better than all the matte black designs out there.\nUpon first glance, the laptop looks like any other. One of the first things to stand out is the thick bezels framing the display, but as your eye draws to the bottom, you notice something strange: there's no bottom bezel -- the screen just continues below the keyboard.\nAlso: How to buy a laptop for school, work, or gaming (and our top picks for each)\nThe rest of the rollable screen is parked underneath, waiting to be unfurled. With the push of a button, the standard-sized display extends upwards, increasing the screen size to 16.7 inches.\nThe result is a large, portrait-style display that goes far beyond any other standard laptop screen size on the market. The glossy, OLED screen delivers a fantastic picture, with no flickering or dimming around the edges, although there is some visible creasing that looks like what you'd see on a foldable phone's display.\nThis is especially true if you rotate the glossy display to reflect the light. It's a little more visible than I expected and certainly something of note (given the price), but ultimately, it doesn't really overshadow the benefit of the large screen.\nFor example, you stop noticing the creasing when your attention is focused on what you're actually doing. It's one of those things that's an inevitable part of its mechanics -- it took foldable phones several years to reduce the creasing on their displays -- and although it doesn't exactly scream \"premium\", it doesn't cancel out the benefits the screen provides.\nAlso: I tried Lenovo's infamous 'rollable' laptop at CES - it's more practical than I thought\nSo what are the said benefits? First off, the extra room is a breath of fresh air. It allows for a spacious workspace that I have to admit, makes for a very nice user experience. Personally, I like running one large, full-screen desktop, but you can also put two windows, one on top of the other, for two 16:9 desktops.\nTo maximize real estate, I set the scale in Windows to 125%, bringing the UI down to a more manageable size that results in a crisp and efficient interface. However, if you want a larger UI, it still feels more roomy than a regular laptop display.\nIf you're a programmer, you'll appreciate the extended portrait orientation, but anyone who works with documents will love being able to see a third more content on the screen at a glance.\nAs an editor, it drastically improves working in Google Docs and my browser-based CMS, both of which benefit from more visibility without having to squint at a UI that's been scaled down to the atomic level.\nEven basic web browsing is improved, with more of the page on the screen at once, and more content visible with less scrolling. In that sense, the display mirrors the mobile layout, which is ultimately more scrollable.\nRolling the screen up can be done by pressing the associated key or with a hand gesture in front of the webcam. While it's extending, the screen defaults to playing an animation (different ones are selectable in settings) with some thematic music, then reloading your desktop once it reaches the desired size. The music can be a little much in a quiet office, so luckily, all of these features can be turned off.\nWhen fully extended, the bottom third of the screen is occupied by the Lenovo widget panel, which shows reminders, your to-do list, and a calendar at a glance. You can pin this to stay permanently on or have it hide behind your other apps.\nThere's actually a lot of content here, including short videos that show how to use gesture controls to raise and lower the display and some suggestions on how to organize the screen more effectively.\nBeyond the display, the rest of the laptop's core components are quite nice. The keyboard is a little shallow, but the keys feel great, with a satisfying click that's crisp and responsive.\nI was also thrilled to find the haptic trackpad to be just as well-engineered, with a uniform click no matter where you press down on the pad, and a sensitive input for swipe gestures. One thing to note, however, is that in cooler temperatures, you might have some trouble with the pad recognizing your fingers, especially if they're cold.\nAlso: The Lenovo ThinkPad streak is over: This model I tested bucks a decade-long trend (for the better)\nAlso note that the laptop's form factor limits its I/O access, with just two USB-C Thunderbolt 4 ports and a headphone jack. All three ports are located on the left side of the device, which might be problematic for some users, but is an expected trade-off for the features.\nAll in all, the laptop's core physical build feels premium (if a little chunky), and even without the rollable display, it would be a solid office laptop. The fingerprint reader on the power key, along with support for Wi-Fi 7 seal the deal as a modern business device.\nUnder the hood, the Intel Core Ultra 7 \"Lunar Lake\" processor, 32GB of RAM, and 1TB of storage make for a standard hardware loadout comparable to any number of mid-to-upper range business laptops. The big display is powered by an integrated Intel Arc 140V GPU with 16GB of internal memory, supplying more than enough power for daily use.\nCinebench 24 MC | Geekbench 6.2.2 SC | Geekbench 6.2.2 MC | |\nThinkBook Plus Gen 6 Rollable | 563 | 2,732 | 10,701 |\nDell 14 Premium | 732 | 2,626 | 15,462 |\nAcer Swift 16 AI | 518 | 2,743 | 10,932 |\nIf you're looking to game on this laptop, it can handle some mainstream titles, but it's not exactly built for running top-tier gaming content. In \"normal\" laptop mode, you've got a 2000 x 1600 resolution, standard fare for a 14-inch. But if your game supports a 2000 x 2350 resolution, you can play with the screen fully extended, which definitely feels like a unique experience, but because of all the screen space, it isn't exactly optimized for high-APM gaming.\nIf you're playing an older game that doesn't support that resolution, well, the game will simply revert to the traditional resolution, resulting in empty space below the window and negating the whole point of the extended display. The bottom line here: gaming can be a bonus for this laptop, but not what it's made for.\nAlso: Finally, a Windows laptop that I wouldn't mind putting away my MacBook Pro for\nRegarding battery life, the display expectedly cuts into the 66Whr battery's longevity, although not as much as you might expect. During normal use, you can get a full work day of use out of it with the screen extended, but it's cutting it close. If you add in videoconferencing and more demanding workloads, you might not make it through the day without a power top-up.\nThat being said, the Lunar Lake chip does allow for the battery loss to reduce to a trickle when not in use, and it charges fast: about 80% in an hour. In our video playback test, we got a little over 11 hours at half brightness in balanced mode over Wi-Fi.\nSo let's address the elephant in the room: the price. Lenovo is well aware that this laptop is not for everyone. In fact, it's probably the most niche product I've reviewed all year. Instead, it's more about proving a point.\nAlso: I've tested dozens of ThinkPads: Here's the Lenovo model I keep coming back to\nLenovo wants to project a reputation of innovation, but more importantly, it wants to prove it can deliver said products to market. This device reflects that mission, earning it an important place in Lenovo's portfolio, even if it's not the year's top seller.\nIt's also the first iteration of this rollable concept, and as such, the physical design is not quite as polished as you'd find in Lenovo's other high-end laptops, like the ThinkPad X9 Aura Edition or the X1 Carbon. These laptops come from a product line backed up by decades of design and engineering, with the ThinkBook Plus Gen 6 having room to improve in subsequent model versions.\nZDNET's buying advice\nThe ThinkBook Plus Gen 6 is an impressive product, even considering its trade-offs. The display has visible creases and thick bezels, but when it's fully extended, you forget about them. The battery isn't the best, but it's far from the worst. It's not a stellar gaming rig, but that's not why you buy a ThinkBook, anyway.\nIt's niche, and it's expensive, but it does what it's supposed to: deliver a fantastic user experience in the office, with an expansive, flexible display that looks great, pairs nicely with a premium haptic touchpad, and just the right amount of power under the hood.\nAlso: I switched to the Dell 14 Premium for two weeks, and it made my XPS laptop look bad\nAt $3,200, this isn't a mainstream laptop, and I wouldn't recommend it unless you're absolutely sold on the extendable display and are committed to the form factor in the long term.\nThe reality is that you can get almost anything for less: a MacBook Pro M4 with 24GB of RAM, or the new brand-new Dell 14 Premium with the same processor and an upgraded Nvidia GeForce RTX 4050 GPU for $1,000 less. But if you're in love with the big screen, I can say that it's a productivity game-changer in the office."
    },
    {
      "url": "https://support.google.com/drive/answer/2375123?hl=en&co=GENIE.Platform%3DDesktop",
      "text": "- Google Drive\n- Gmail\n- Google Photos\nGet more cloud storage with:\n- Google One, which starts with 100 GB of storage. Check if Google One is available for your account.\n- Google Workspace for work and school. Storage sizes vary. For more information, contact your administrator.\n- Google Workspace Individual, which comes with 1 TB of storage. Learn about Workspace Individual.\nStorage subscriptions\n- At any time, you can change your storage plan to either a monthly or annual fee.\n- A Google One subscription doesn't expire — it'll renew automatically unless you cancel.\n- When you switch to a different payment schedule, it can take up to 24 hours for these changes to take effect.\n- In addition to the listed price, you may be charged local taxes or fees. These rates may be changed by local entities without notice from Google. Google doesn't charge extra fees beyond the listed price. If you live in the European Economic Area or Morocco, you'll be charged Value-Added Tax (VAT) on Google Play purchases. For these purchases, you can request a VAT invoice or receipt.\n- Buying Google storage is only available in some countries. Find countries where you can buy storage.\nIf you already pay for a Drive plan, you get automatically upgraded to Google One at no charge. Learn more about how your existing storage works with Google One.\nIf you don't have a Drive plan, you can become a Google One member to get more storage, help from experts, and extra member benefits.\nUpgrade your Google storage\nBuy more storage with Google One\n- Make sure you’re signed in to your Google Account.\n- On your computer, go to one.google.com.\n- On the left, click Upgrade.\n- Choose your new storage limit.\n- Review the new plan prices and payment date. Then, click Next.\n- To confirm your Google One plan, click Subscribe.\nLearn more\n- How your existing storage works with Google One\n- How much Google One costs in your location.\n- How to switch to a monthly or yearly storage plan.\nAbout Google One plans offered by another company\nManage a Google One plan offered by another company\nSwitch to a Google One plan in the Google One site & appIf you bought your current plan from another company, and instead want a plan that’s only available for purchase on the Google One site or app, you need to:\n- Cancel your current Google One plan by contacting the company that sold you the plan.\n- Subscribe to a Google One plan available on the Google One site and app.\nPayment issues\nBenefit access\nUpdate your Google One membership through Pixel Pass\nChange your plan\n- On your computer, go to one.google.com.\n- Sign in to your Google Account.\n- Click Settings Change membership plan.\n- Select an upgrade plan.\nIf you purchased your Pixel Pass subscription through the Google Store, you can also update your Google One plan on the Google Store.\nLearn about pricing for Google One\nGoogle One members get increased storage space and exclusive benefits. Learn how much Google One costs in your location.\nGoogle One price update in Australia, Brazil, Chile, Colombia, Egypt, Ghana, Indonesia, Japan, Kazakhstan, Mexico, Nigeria, Pakistan, Paraguay, Peru, Philippines, Sri Lanka, Turkey & United Republic of Tanzania\nEffective February 18, 2025, the price of Google One plans purchased from Google will increase. New members of Google One can subscribe at the updated price in the countries or regions listed below:\n- Australia\n- Brazil\n- Chile\n- Colombia\n- Egypt\n- Ghana\n- Indonesia\n- Japan\n- Kazakhstan\n- Mexico\n- Nigeria\n- Pakistan\n- Paraguay\n- Peru\n- Philippines\n- Sri Lanka\n- Turkey\n- United Republic of Tanzania\nWhen current Google One members renew their subscription on or after March 21, 2025, they’re charged with the new price. If existing members don’t want to renew their subscription at the new price, they can cancel their membership on or before March 20, 2025.\nFor Google One members on a monthly subscription through the Apple App Store, the new price takes effect on or after March 18, 2025. If they don’t want to renew their subscription at the new price, they can cancel their membership on or before March 17, 2025.\nPlan price increases vary by plan type and country or region currency. You can check your current plan and price from Google One.\nImportant: If members are over their storage limit, these services may be interrupted:\n- Google Drive\n- Gmail\n- Google Photos\nFor more information on what happens when membership is canceled, go to Cancel your Google One membership.\nAs a current Google One member, the new price will apply to your plan renewal as follows:\n- Google Play: On or after March 21, 2025.\n- Apple App Store:\n- For annual subscriptions: On or after March 21, 2025.\n- For monthly subscriptions: On or after March 18, 2025.\nIf you don't want to renew at the new price, you can cancel your membership on or before March 20, 2025. Learn how to cancel your Google One membership.\nWhen you cancel your membership, your Google One storage and benefits don’t immediately end. At the end of the billing cycle, you lose your paid Google One benefits.\nTip: If you’re on a monthly subscription through the Apple App Store, and you don’t wish to renew your subscription at the new price, you can cancel your membership on or before March 17, 2025.\nYour Workspace Individual plan comes with 1 TB of storage. You can buy more storage with Google One. Learn about Workspace Individual.\nIf you're a Google One plan member:- Your Google One plan storage is in addition to your Workspace Individual storage.\n- There's no change to your Google One membership or Family Plan and Membership Sharing.\n- You stay enrolled unless you choose to cancel.\nStorage space doesn’t increase after upgrade\nIt may take up to 24 hours for your new storage to become available after you purchase a new storage plan.\nIf your storage is still incorrect after 24 hours, sign into your Google Account to check if your payment went through.\nIf your payment went through, it’s been 24 hours since you upgraded, and your storage is still incorrect, try these troubleshooting steps.\nIf a charge is applied to your payment card, but you don’t find a payment reflected on your Google Account, check if you’re signed into multiple Google Accounts. If so, Google One may be purchased on a different account. You can cancel the purchase on that account and repurchase Google One on the desired account. Learn how to cancel purchases on Google One.\nSwitch to a plan with less storage\nIf you don’t use all the space you have right now, or you want to pay less for Google storage, downgrade or cancel your storage plan.\nChange Google One membership with Pixel PassIf you need more help\nGoogle One members can ask for help with Android backups and other topics like family sharing, Google Photos management, and storage plan info. Learn how to ask a Google expert.\nManage subscriptions not purchased on the App StoreIf you use the Google One website or another device to sign up for a plan instead of the App Store:\n- You can't change your Google One plan on your iPhone or iPad.\nTip: If you purchased via the Google One website, you can manage your plan on the web at Google One.\n- At the top right, select Settings Change membership plan.\n- Choose your new storage limit. You can choose a monthly or yearly subscription.\nIf you have Google One on an Android device, you can change your membership plan in Settings.\nIf you want to manage your membership with the app on iPhone or iPad, you must buy a plan with an Apple subscription.\nStep 1: Cancel your Google One plan\nOn your computer:\n- Go to Google One.\n- At the top right, select Settings Cancel membership.\n- Select Cancel.\nStep 2: Buy a Google One plan with an Apple subscription\nOn your iPhone or iPad:\n- Download the Google One app from the App store.\n- Open the Google One app .\n- On the left, tap Menu Membership plans.\n- Select a Google One plan.\n- After you pick your plan, in the App Store, confirm your new subscription.\nTip: You can also manage your payment method or manage your subscriptions with Google Play.\nTo make changes to your Google One membership plan on your iPhone or iPad, you must make those changes in the Google app used to purchase the plan.\n- Google One\n- Gmail\n- Google Drive\n- Google Photos"
    },
    {
      "url": "https://www.zdnet.com/article/notion-mail-offers-ai-perks-but-skips-a-few-crucial-notion-features/",
      "text": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nNotion Mail offers AI perks - but skips a few crucial Notion features\nToday, Notion announced the general availability of its free Notion Mail add-on to its wildly popular eponymous productivity dashboard. For those who have been hiding under a rock for the past five years or so, Notion is a digital environment that allows users to customize how they integrate notes, tasks, and databases into a very personalized workspace.\nA little over a year ago, Notion acquired Skiff, a company that offered a number of privacy-focused tools, including mail, calendar, documents, and file storage. Notion Mail is based on the mail tool acquired from Skiff.\nAlso: Hate Apple Mail's redesign in iOS 18.2? How to get your old inbox back\nThis continues Notion's pattern of technology acquisitions that it uses to shore up its basic offerings. Two years earlier, Notion acquired Cron, which provided the company with calendaring software. The core of that acquisition is now found in Notion Calendar, another line extension of the Notion offering.\nBoth Notion Mail and Notion Calendar follow Notion's freemium approach to SaaS licensing. You can use Notion, Notion Mail, and Notion Calendar for free, but if you want more storage or additional features, you'll need to upgrade to more expensive licensed services.\nUnlike Notion and Notion Mail, Notion Calendar does not offer an AI feature upsell. Notion has long had integrated AI built into the product. Notion Mail is launching with a number of interesting AI features as well.\nAlso: The top 20 AI tools of 2025 - and the #1 thing to remember when you use them\nUnfortunately, Notion Mail does not integrate with Notion databases. While the interface appears similar, there's no interoperability with Notion databases. So, while it might be nice to integrate Notion Mail into, say, a tech support database, that capability does not exist at launch. Notion hasn't indicated whether database integration is a planned feature for a future release.\nWhat is Notion Mail?\nNotion Mail provides all the usual mail features, which means you can read messages, send messages, reply to messages, and so on. It uses the Gmail API interface, so whatever you do in Notion Mail is reflected in your main Gmail interface.\nAlso: 5 tools I trust to keep my online conversations private and anonymous\nThere are four big features that Notion is promoting that set Notion Mail apart from other email tools: smart labeling, custom views, a meeting scheduler, and the Notion writing interface with slash commands.\nSmart labeling\nSmart labels use AI to help you create labels based on emails that are coming into your inbox. You can click the Auto Label button, and Notion Mail will present you with a number of sorting and cataloging choices from which you can choose an action. It appears that Notion then sets up its own AI-based filter for selecting and sorting emails from any smart label you create.\nThis may offer the main feature I've long wanted in Gmail: the ability for AI to distinguish classes of email based on a prompt.\nFor example, I'd love to have Gmail put all press releases into one folder, distinguished from other promotional materials. It would be even better if, based on the content of the incoming message, it could put AI-related releases in one folder, AR/VR-related releases in another folder, and all other press releases in a third.\nAlso: 5 simple ways to regain your data privacy online - starting today\nIf it works, and if it's possible to do this with the thousands upon thousands of messages I have, it would be an enormous time saver.\nIs this possible in Notion Mail? I don't know yet. You'll have to stay tuned for whenever Notion Mail will remove its unfortunate email address restriction.\nCustom views\nOne of Notion's greatest strengths is its ability to create custom views into database tables. These allow you to format, isolate, and focus on important information for each view.\nIt appears that Notion Mail has implemented Notion-style views in mail. This, depending on how flexible and powerful it is, might allow for some very interesting email processing and management workflows.\nMeeting scheduler\nIf you want to set up a meeting, you can use the meeting scheduler to embed a calendar in an email invite. This allows users to choose times that they can meet, taking into account open times on your calendar.\nAlso: 8 MacOS apps I can't live without - and why\nThis feature exists in a lot of add-ons, but building it right into email could be a nice time-saver.\nNotion writing environment\nEmail messages can be written using the same editing environment found in Notion. In fact, I'm writing this article in Notion right now.\nNotion supports a slash syntax, where you type a slash and then choose a format (like /h3 which produced the heading above). It's fast and convenient, but occasionally gets in its own way. That said, I spend at least four to eight hours every day in the Notion writing environment. I'm generally quite comfortable with how it works.\nIt starts off free\nNotion Mail starts off free, just like Notion Calendar and the main Notion product itself. There are some limitations to the free version, which is why some serious users have upgraded to the Plus, Business, or Enterprise plans.\nYou don't need to upgrade to one of those plans if you want to use the AI features with Notion Mail. But after a week's trial, you will need to pay $8 per month per user to use Notion AI, whether you're using a free plan or not.\nAlso: This quick Mac tip will save you lots of clicks over time. Here's how\nFor Plus plan users and above, this could get costly pretty quickly.\nMy initial experience trying Notion Mail\nNotion Mail is essentially a front end to Gmail. When you start using it, you're asked to connect with Google.\nFrom there, you'll be presented with the usual sign-in with Google prompt, which links your Gmail to your Notion Mail.\nThen, you'll be asked to give Notion a wide range of permissions. Here, I only allowed it to have email permission, which seemed like more than enough.\nAlso: This simple Gmail trick gave me another 15GB of storage for free - and I didn't lose any files\nI understand that for Notion Mail to provide an easier-to-manage front end to my Gmail, it needs to see my Gmail. But still, it doesn't make me particularly comfortable giving away that kind of access. Worse, Notion refused to allow me to use Notion Mail until I gave it all the permissions it requested.\nTo be honest, I see no reason Notion Mail needs access to all my contacts. And since I'm not using Notion Calendar, I see no reason I should have to give Notion Mail access to my Google Calendar.\nBut, since I'm doing this for you folks reading this, I gave Notion everything it asked for.\nAlso: Five reasons why email will never die\nSadly, I immediately hit another wall. I log into my Notion account using my primary corporate email address, but Notion Mail wanted my Gmail address. Since they are two different things, I appear to be blocked from using Notion Mail, at least for now.\nI had intended to show you how Notion Mail worked with my Gmail, but that's not in the cards for today. I'm sure I can eventually get the Notion folks to help me connect my Gmail, even though I log into Notion using my main email address, but that won't happen in time for this article's deadline.\nSince I'd rather not leave Notion Mail with the broad range of permissions I had to grant it in my attempt to use it with my Gmail account, I pointed my browser to https://myaccount.google.com/permissions and removed all permissions assigned to Notion Mail. I figure that if it won't let me have access, I won't let it have access either.\nSo, let's just move on. I can't yet demo these features. In the meantime, I have been in touch with the Notion team, so I can share some useful information to at least get you started.\nIs this the mail client you've been waiting for?\nI'm not sure. If it can go beyond the limits of email filters and rules and manage mail based on context rather than string matching, it could prove to be a boon for overwhelmed email users.\nThe ability to rearrange your mail environment with custom views might also prove helpful, but Notion itself is often limited in how custom it's willing to get. For example, while you can assign colors to certain objects in Notion, the app only allows a small set of fairly pastel colors, and that's it.\nOutlook, by contrast, has long had formatting rules that can parse messages and format them in terms of color and font based on some text-matching requirements. That doesn't exist in Gmail, and it definitely doesn't exist in Notion Mail.\nAlso: How to remove software from a Mac - and why you should do so regularly\nI was surprised that Notion Mail doesn't connect to Notion. Yes, the interface looks similar, but there's no data sharing between the two. I would have expected that Notion's very powerful database capabilities would have provided the underpinning to Notion Mail, but that's not how it works. There is so much potential for a true linkage between an email client, a database-aware AI, and Notion's database flexibility, that the absence of any connection is a big swing and a miss.\nAnd, of course, there's the weird situation where Notion Mail won't work if your Notion account login is an email address other than your Gmail address. That has to be a bug, and I'm sure it will be resolved eventually.\nI have to say that this release disappointed me. From the inability for it to be able to handle my corporate email address login ID to lack of connectivity to what makes Notion Notion, Notion Mail is more promise than value right now. I can see the potential, but whether Notion Mail eventually lives up to that potential is a question we'll have to examine at some point in the future.\nFor now, I'm sticking with my tried-and-true Gmail client.\nNotion's response\nAfter publication, Notion's press team got back to me about some of the issues discussed in this article. Here's what they had to say.\nThere are deep connections across all three products (Notion, Calendar, Mail) at launch-with many more to come. We offer a unified account model where you see all your Notion accounts in Mail, and creating a new account on Notion Mail automatically provides you with a workspace.\nThe connections go far beyond visual similarities: When composing an email, you can see Notion workspace members in your contacts, @mention any Notion page, and use Notion pages with the Mail AI assistant. When you @mention a page in the AI assistant, its contents become available to help draft your email. These features demonstrate how Notion Mail integrates with Notion workspaces.\nNotion Mail integrates deeply with Notion Calendar. The most notable feature is /schedule, which lets you insert one-click scheduling links. You can also RSVP to events, add recurring time blocks using slash commands, and preview upcoming events by hovering over the Calendar icon in the app switcher (bottom left corner).\nFinally, we recognize the potential of Notion database connections! We recently tweeted a prototype showing Notion Mail syncing with Notion databases. While we haven't released this feature yet, you're right that it will enable powerful cross-app workflows and it's coming soon.\nI was also contacted about the email login issue, which (at least for me) remains unresolved. Even so, the company provided an explanation for why they made this implementation choice.\nThe core problem here is that we currently require you to either 1) connect the existing email on your Notion account, or 2) create a new account with the email you want to connect.\nThis is purely to avoid confusion. We previously had a more relaxed constraint, and it was a headache to explain that you may need to login with email a@a.com to access the Notion Mail email account of b@b.com.\nHave you tried Notion Mail yet, or are you considering it? Do you think its smart labeling and custom views could actually change how you manage your inbox? How important is full integration with Notion databases to you? And what's your take on the Gmail-only access and required permissions? Is that reasonable or a dealbreaker? Let us know in the comments below.\nGet the morning's top stories in your inbox each day with our Tech Today newsletter.\nYou can follow my day-to-day project updates on social media. Be sure to subscribe to my weekly update newsletter, and follow me on Twitter/X at @DavidGewirtz, on Facebook at Facebook.com/DavidGewirtz, on Instagram at Instagram.com/DavidGewirtz, on Bluesky at @DavidGewirtz.com, and on YouTube at YouTube.com/DavidGewirtzTV."
    },
    {
      "url": "https://www.zdnet.com/home-and-office/work-life/why-you-need-a-data-backup-plan-for-your-mac-or-pc-before-disaster-strikes/",
      "text": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nWhy you need a data backup plan for your Mac or PC - before disaster strikes\nMost people who have developed a sensible backup strategy did it the hard way, after losing precious data to a disk crash or a power surge, or losing an entire data-filled PC to a thief or in a natural disaster such as a fire or flood. That sinking feeling as you realize you will never see those files again is painful and unforgettable.\nAlso: I never pay full price for PCs or Macs, thanks to these 7 money-saving tricks\nThe natural response to that sort of loss is to resolve never to let it happen again. And if it has not happened to you -- yet -- then now is a great time to make that resolution. But devising an effective backup strategy, one that works without requiring a lot of extra effort, takes organization, planning, and forethought.\nHow to protect your data by backing up your PC or Mac\nWhere do you start? It's a four-step process.\n1. Choose your backup approach\nIn my experience, you have three backup strategies to choose from. Which one you choose involves equal parts personal preference and practicality. The biggest factor to consider is whether the data you need to back up is work related or strictly personal.\nHere is a brief description of each one.\nJust keep the important stuff\nThis approach is for people whose PC is primarily for casual personal use. If your IT department takes care of managing your work laptop and backing up work-related files to your company's network, you only need to worry about personal files: photos, digital photos and videos, and important documents. Backing up those crucial files to your preferred cloud service is the logical solution.\nAlso: 5 simple ways to regain your data privacy online - starting today\nIf your system drive has a catastrophic failure, you will have to reinstall your operating system and apps, but you do not have to worry about losing those important files, which are safely tucked away in the cloud, with one or more synced copies available locally, just in case. On a PC running Windows 10 or Windows 11, you can use the Windows Backup app to automate the process of backing up files, apps, and settings to OneDrive.\nBack up all data files\nOn a PC that you (and possibly other family members) use for work, school, and personal tasks, you might want to ensure that every data file for every user account is backed up for quick recovery in the event of a problem. You can back up everything (except the operating system, apps, and saved settings) to the cloud, a local drive, or both.\nAlso: The best cloud storage services: Expert tested\nThis option lets you recover older versions of a file or folder after accidentally deleting it. It also allows you to retrieve an older version of a document that has been overwritten by more recent work, and it gives you the option to recover all data for all users if you migrate to a new PC, replace your primary storage, or reinstall your operating system from scratch -- or, in the worst-case scenario, if that PC is lost, stolen, damaged, or compromised by a ransomware attack.\nCreate a system image that you can restore to a new PC or Mac in case of disaster\nThis option is the one to choose if business continuity matters more than anything else. It is labor intensive initially, and it can require intermediate-to-advanced technical skills, but it will save you a tremendous amount of time if you need to recover quickly from a crash or upgrade to a new PC or Mac with the absolute minimum of downtime.\nA system image includes everything on the target drive: hidden configuration files, installed programs, settings, and data files. Typically, the image file is saved on an external drive connected via USB; with the right software, you can save an image file to another PC or server on a local network or in the cloud.\nDone right, a backup image is a perfect clone of the system configuration at the time it was taken. That means, of course, that you have to find a way to back up data files and other system changes you make after that image is created.\nAlso: How to clear the cache on your Windows 11 PC (and free up valuable system resources)\nBoth Macs and Windows PCs include built-in software that can help with this task. MacOS has Time Machine, which can be used to do a full system restore. Windows 11 and Windows 10 offer the legacy Windows Backup client, which does image backups as well as allowing incremental backups of data files in common locations.\nIf you choose third-party software, you can create fairly sophisticated routines that capture occasional full images along with differential or incremental backups to keep you covered.\n2. Organize your data files\nWhat do you have to lose?\nEveryone has a collection of personal files they would absolutely hate to never see again. That video of your firstborn taking his first steps, the PDF copies of your tax returns for the last five years that the bank wants before they can process your mortgage application, the CV or resume you need to send to the recruiter offering you the job of your dreams -- all of these are irreplaceable.\nThat is not to mention all your other personal photos and videos, plus digital music and media files that you bought or downloaded long ago that are not available on streaming services, as well as folders full of work, school, and personal documents that are not on anyone else's server.\nOh, and do not forget program installers, product keys, license info, and other digital details you will need when you are restoring apps after a crash.\nAlso: The 5 apps I depend on to keep my life and data organized\nMany of these files can be re-created from online sources, although that can be an extremely tedious process. But some of the items on that list are absolutely irreplaceable, and keeping your only copy on a hard disk that is one power surge away from an unrecoverable crash is foolhardy, to say the least.\nOnce you have identified the files and folders that are most important, you can organize them into a handful of known locations that you can target for backup. That last step is key: If your important files are scattered across multiple locations, you are likely to miss one of those folders and end up with an incomplete backup.\nAnd even though you might prefer an idiosyncratic organizational structure, I recommend that you keep everything in the folders that are created and managed by the operating system for you: Documents, Downloads, Photos, Videos, and so on. For a Windows PC, that is your user profile folder. On a Mac, it is the Home folder for your user account.\n3. Choose where to store your backup copies\nWhich backup destination is right for you? This is a multiple-choice question, with the available answers being:\n- Cloud\n- Local\n- Both\nAs far as I am concerned, copying your most important files to the cloud and then syncing them to multiple local devices is the core of an effective backup strategy.\nPutting those files in the cloud means you are not at the mercy of hardware failures. A catastrophic failure of the cloud provider is a very low risk, especially if you store with a provider that has engineered redundancy and fault tolerance into its system, and has the financial wherewithal to survive an economic downturn. Microsoft, Google, Apple, and Dropbox are unlikely to go out of business anytime soon, so having a Plan B is prudent but not quite as urgent as preparing for a local disk crash.\nAlso: Maxing out your Google cloud storage? How I deleted more than 10TB, thanks to this handy tool\nPrivacy and security are not trivial concerns here, but depending on your preferences and your budget, those concerns can be dealt with by choosing your cloud provider wisely or by encrypting files locally before sending them to the cloud.\nThe bigger problems with the cloud are, of course, the cost of storage and the limitations of bandwidth. Those problems intensify as your cache of data grows larger. Consumer plans like Microsoft 365 give you access to as much as a terabyte of storage for a few dollars per month, but your Internet service provider might have a thing or two to say about that, as upload/download caps can turn the process of backing up and restoring from the cloud into a multi-day activity. And you can be hit with unexpected charges or slowdowns if the total goes over your data cap.\nSo, is a local drive better than the cloud? Well, yes, at least sometimes, for some tasks.\nAlso: I doubled my PC's storage with this thumb-sized accessory. Here's how it works\nStoring your backups on a local drive means you have ready access to them and can restore your files as fast as your external hard drive and your storage bus can deliver them, unencumbered by any limitations of your cloud provider or your broadband connection. But those local copies are vulnerable to some of the same risks as the PC containing the original data. If your home or office is destroyed by fire or flood, your local backups are likely to disappear along with the PC they are backing up.\nClearly, the most complete strategy involves a hybrid approach, with important files safely stored in the cloud and copies of that big cloud store synced locally, and maybe another copy of the most important files on a thumb drive in a safe deposit box or another offsite location. Just in case.\n4. Make sure your data is being backed up properly\nA backup you cannot restore is worse than no backup at all.\nChecking the status of synced cloud data files is fairly simple -- just compare the contents of the remote folder with your synced local copy. Local backup images need more attention.\nAlso: Stop buying cheap, no-name SSD drives - here's why\nGood backup software allows you to schedule regular backups and notifies you after each operation runs, giving you a heads-up if it encounters any errors. But that is only half the job. If business continuity is the goal, you need to test your backup image to confirm that it can easily and quickly be restored. You definitely do not want to discover that your image file is damaged or corrupted when you are under the gun to restore it.\nIf you have a spare PC or Mac handy, you can use it as a testbed. Some third-party software allows you to mount a backup image as a virtual drive or restore it to a virtual machine, which greatly simplifies the burden of testing. But whatever you do, do not skip that step.\nSo, what's in your backup plan? Share your experience and advice with other readers in the comments below.\nGet the morning's top stories in your inbox each day with our Tech Today newsletter."
    },
    {
      "url": "https://www.zdnet.com/article/should-you-upgrade-to-mesh-i-compared-it-with-a-traditional-wi-fi-router-and-heres-my-advice/",
      "text": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nShould you upgrade to mesh? I compared it with a traditional Wi-Fi router, and here's my advice\nWith the adoption of remote and hybrid working, having a reliable internet connection at home is imperative -- not just for one device, but for several. If you have a family, maybe even dozens. So what's better, one single access point, or a mesh network spread about the home?\nThe answer depends on how your home and office are set up and what kind of connection you need. Wi-Fi routers are so good these days that a single access point is often the most straightforward solution. But if you have a larger home or your office is located far away from your router, a mesh network could be a game-changer, boosting the signal no matter where you are.\nAlso: The best VPN routers of 2025\nIf you're not sure of the difference, that's okay, too. Let's examine both types of connection and consider their pros and cons to determine which one is best for you.\nWhat is a traditional Wi-Fi router?\nA traditional router acts as a central hub for internet connectivity. The router acquires the connection from your internet service provider (ISP), and then allows other devices around the home to connect to it, either via Wi-Fi, or by simply plugging in an Ethernet cable. Typically, routers are password-protected so only your household can connect to it.\nYou should buy a traditional Wi-Fi router if...\n1. You're on a budget\nStandard routers are generally much more affordable than mesh network products. While you can still expect to pay a hundred dollars or more for a premium router, there are many budget-friendly options stable enough to keep your home office running effectively without further input.\n2. You have heavy bandwidth and speed requirements\nMany routers today, such as the TP-Link AXE5400 are designed with the technology needed to meet heavy bandwidth and streaming requirements. Some, like the Asus RT-BE86U, aim to exceed the requirements of most people for the fastest connection possible.\nAlso: Should you upgrade to Wi-Fi 7? Here's my verdict after testing this next-gen router at home\nGamers and live streamers, for example, should generally stick with wired Ethernet connections and traditional routers, as they will likely provide improved speeds and stability over wireless-first products.\n3. You want a plug-and-play product\nA standard router is often less hassle to set up than a mesh network. For something that \"just works,\" a typical router might be the best option. Set it up once, make sure updates are automatically applied, and forget about it.\n4. You want to separate devices and networks\nYou can set up guest Wi-Fi networks on most modern routers, but if you also want to keep all of your devices on a separate home network in the interests of security, most routers will allow you to do this without much hassle.\nWhat is a mesh router?\nWhile traditional routers are singular, centralized access points, mesh networking devices are decentralized.\nInstead of one device connecting to a single gateway to the internet, mesh networks are created from multiple Wi-Fi nodes that all provide web connectivity. For example, you could have a central hub in the kitchen and satellite nodes in the home office, kitchen, and bedroom.\nAlso: This is the fastest and most expensive Wi-Fi router I've ever tested\nWhen you access the internet while in the kitchen, you would automatically connect to the hub, whereas you would jump on a node while you're in your home office, and so on -- and this blanket coverage is why mesh devices are great for larger homes or offices. Most mesh systems will automatically select the best channels and nodes to avoid dead zones and lower the risk of poor connectivity.\nYou should buy a mesh networking system if...\n1. You have spotty coverage in your home\nThe main benefit of a mesh network is extended coverage. Investing in a mesh setup will remove annoyances, such as coverage blackspots or slow connections in larger properties with a lot of square feet. You're far less likely to have dead zones with a mesh system than you are with a single router access point.\nMesh networks can often cover up to 5,000 sq. ft., and more, with enough satellites. That's far more than you can expect from one central router.\n2. You need a reliable connection, no matter where you are\nAs your device will connect to the nearest satellite node rather than a central point of access, this feature helps ensure that -- no matter where you are in a property -- you are less likely to experience connectivity failures or drops.\nAlso: I switched my high-end Wi-Fi 7 router to a more affordable option - and don't regret it\nIn this manner, mesh networks are particularly useful if you have a home office in a garden area separate from your house, for example.\nAnother benefit is that mesh systems and satellites are often designed to look modern, sleek, and may be more discreet than bulky, traditional routers, giving you more options for placement.\n3. You want additional controls\nOnce a mesh network is active, many vendors allow users to control their system through a mobile app. This could include keeping an eye on network traffic, rebooting, or even turning off the internet entirely -- perhaps an appealing prospect for those with children who don't want to mess with a typical router's configuration. In addition, some mesh networks also act as smart hubs and are compatible with voice assistants.\nA note of warning, however: you may need to spend some time tweaking configuration settings when you first set up a mesh network.\nFAQs\nWhat are the disadvantages of using a Wi-Fi router?\nThere are three key disadvantages of using a traditional Wi-Fi router:\nCoverage issues: As internet access is distributed through a single point, this setup can mean that areas far away from your router will have slow or spotty connections that drop. Range extenders can help remove this barrier, and while they can still be cheaper than investing in a mesh network, it's an additional expense.\nOverload: Unless extenders or channel separation features are used, too many connections may result in overloading, bottlenecks, lags, and connectivity drops.\nTweaking: If you want to tweak the more advanced settings on a router, this can often require annoying visits to a platform via desktop, rather than the seamless mobile app connectivity we have learned to enjoy for many of our modern services.\nWhat router system is best for my home office?\nYou need to decide whether the financial outlay for a whole mesh network is worth it. In larger homes with dead spots, mesh networking can provide a way to improve your Wi-Fi signal strength and coverage immediately.\nHowever, it can be expensive to overhaul your existing router setup for a large home. Going for a complete mesh system may be overkill unless you consistently have multiple users and connected devices competing for bandwidth.\nA Wi-Fi extender can be a worthwhile investment instead if you decide to stay with a traditional home router but need to expand coverage.\nSome mesh network systems, such as Google Wifi, Netgear Orbi, and Amazon Eero, are relatively cheap to set up if you don't need too many satellites.\nAlso: The best mesh Wi-Fi routers: Expert recommended\nIf you're the only person using your network and need a stable, powerful internet connection -- such as for resource-hungry work applications or gaming -- a traditional router and an Ethernet cable may be all you need for reliable and rapid internet access. Wired internet speeds should be quicker than wireless if the connection is working properly, and investing in a simple Ethernet cable, easy to find for no more than $10 or $15, could be enough. This could save you the cost of a complete overhaul.\nWi-Fi range extenders, too, could be considered an alternative to mesh if you need to boost coverage and throughput in some areas, and they will likely be less expensive than purchasing individual mesh nodes. Some vendors also offer mesh \"bolt-ons,\" such as Asus' AiMesh, which creates a mesh-like coverage wireless network without ripping everything out and starting again. However, the downside is that you will probably have to spend some time setting these bolt-ons up and tampering with your router's configurations.\nIs mesh Wi-Fi better for gaming?\nThe best way to answer this question is to consider latency. Overall, many mesh systems today trade extended coverage for potential downgrades to speed.\nIf your household has gamers using consoles casually, it shouldn't matter what type of router you use. However, professional and dedicated gamers will absolutely notice small lags or latency issues -- and they will want the best speed and stability available. In these cases, a wired, traditional router is likely your best bet.\nI prefer an Ethernet, cabled connection for PC, Internet-based gaming and sessions with friends, and while my mesh network would probably be adequate, I don't want to risk lagging.\nIs mesh Wi-Fi better than an extender?\nWhile both mesh Wi-Fi and extenders will improve the coverage of your home, there are disadvantages to both.\nMesh systems require investment and the cost can add up quickly, but they provide seamless transitions between Wi-Fi access points dotted around your home. Furthermore, you can rapidly change settings or perform updates via mobile apps.\nWi-Fi extenders can't be tweaked so easily. However, they are cheaper and are the best option if you just want to tackle a few dead zones, as you just need to plug one into your main router. Keep in mind that, unlike mesh nodes, Wi-Fi extenders won't improve congestion or eradicate bottlenecks.\nCheck your ISP first\nBefore changing your setup, you should review your ISP package. If you're subscribed to a low-speed offering, or your internet provider throttles your speed at peak times, new equipment is not going to help. Instead, a package upgrade could be a better option.\nGet the morning's top stories in your inbox each day with our Tech Today newsletter."
    },
    {
      "url": "https://www.cnet.com/tech/services-and-software/too-much-email-get-back-15gb-of-free-storage-for-your-gmail-account/",
      "text": "If your Gmail inbox is overflowing with years of receipts, promotions and forgotten threads, you're not the only one. All those messages, plus attachments, can quietly push you toward Gmail's limit of 15GB of free storage. And when that happens, your email grinds to a halt.\nThe good news is you don't have to spend hours deleting messages or pay for more space. With a few built-in Gmail tools and some smart filtering, you can clear out massive amounts of storage in minutes, all without losing a single important email. It's a quick, stress-free way to get your inbox running smoothly again and reclaim that precious free space.\nAll I had to do was create a second Gmail account to store all of my current messages. There's no restriction on the number of free Google accounts you can own, which meant I could set one up as a dedicated archive account and then transfer all of my old emails to it.\nTransferring your Gmail messages is also a great strategy if you have a school or business Gmail account that you won't be able to access permanently. Most universities and businesses will deactivate your account once you're no longer a student or employee, so if you want to view your old messages and files, you'll have to port them to a personal account before you lose access.\nCompleting the whole process of transferring your Gmail messages to a new account doesn't take too long but it will depend on just how many messages you have. I'll walk you through the simple process of transferring your emails from your old account to a new one (including the important step of backing everything up first).\nFor more about Gmail, learn about its new AI summaries or how to use emoji reactions.\nHow much data can you store on Gmail?\nFifteen gigabytes of free storage may sound like a lot when you make a Gmail account but it gets filled up quickly. For starters, the 15GB isn't just used for email: It also includes the files you've saved in your Google Drive and Google Photos.\nIf you frequently send or receive messages that contain large files such as videos, or if you find yourself uploading a lot of pictures and videos to your Google Photos, then it won't be long before you'll see the \"Account storage is full\" notification. This means that you will no longer be able to send or receive emails on this account, so you'll want to do something ASAP.\nThe quickest solution is to upgrade to a Google One account. Even if you choose the least expensive plan -- 100GB for $20 a year -- you'll still end up paying money to store old emails that you might not even need anymore.\nIf you don't want to buy more storage, you can always delete your old emails. You can get back a surprising amount of storage space by putting large files in the trash. Gmail makes it easy for you to identify and delete files by size. Even so, that option might seem tedious; maybe you don't want to spend hours sifting through correspondence from a decade or more ago, deciding which memories to keep and which to get rid of forever.\nThere's always the option to download large files to your desktop before you delete them from your Google account but at some point you'll probably run into the same issue with your local files and have to manage the storage space on your device.\nThis brings us to our \"nuclear option:\" Transferring all your emails to a new Gmail account.\nHow to transfer your Gmail messages to a new email account\nBefore you start the Gmail transfer process, I recommend that you back up your emails. You can do this by downloading your emails either to your computer or an external hard drive. You can delete the backup after you finish transferring the emails to your new account if you like but it's always a good idea to have an extra copy stored locally.\nTo back up your Gmail messages, go to Google Takeout. Using my test Gmail account that held about 75,000 messages, I got a download from Google Takeout in about 2 hours.\nOnce you've saved a copy of your emails, you're ready to begin transferring them. Here are the steps you need to take:\n1. Start by logging into your original Gmail account, clicking the \"gear\" icon in the top right and clicking See all settings.\n2. Select the Forwarding POP/IMAP tab and then select the option Enable POP for all mail (POP stands for Post Office Protocol).\n3. You'll have several options under When messages are accessed with POP. To automatically delete the emails from your original account after the transfer, select delete Gmail's copy.\n4. Select Save Changes.\nNow it's time to create your new account and transfer all your messages there:\nIf you haven't already done so, create your brand new, inbox-zero Gmail account -- we'll call this your archive account.\n1. Login to your new archive account, click the gear icon at the top and select See all settings.\n2. Select the Accounts and Import tab at the top, then select Add a mail account next to Check mail from other accounts.\n3. In the pop-up window, enter the name of your original Gmail account. Select Next.\n4. Select Import emails from my other account (POP3) and select Next again.\n5. Enter the password of your original Gmail account. You might also be required to create a Google app password (see note below).\n6. Select 995 under Port.\n7. Check these 3 boxes: Always use a secure connection (SSL) when retrieving mail, Label incoming messages, Archive incoming messages (Skip the Inbox)\n8. Select Add Account.\nYou'll probably need to create a Google app password to transfer Gmail messages\nI tested this Gmail message transfer process twice and both times the standard password for the Gmail accounts did not work. After a bit of research, I determined that I'd need to create a temporary \"app password\" to sync the accounts.\nGoogle app passwords are 16-digit passcodes created for \"less secure\" apps or devices to access your Google account. They work exactly like your Google password.\nIf your regular Google password doesn't work for syncing Gmail accounts, visit https://myaccount.google.com/apppasswords to create an app password. Simply create a name for the password -- I used \"Transfer Bulk Email\" -- and then hit the Create button. You'll get a pop-up window with your new 16-digit passcode.\nOnce you've created the app password, return to step 6 of the instructions above and use that new app password instead of your usual password.\nImportant: Google will only display your app password once. After you've created it, you can't ask to see it again so be sure to write it down or otherwise record it after it's been created.\nGoogle's own Help Center mentions that \"app passwords aren't recommended and are unnecessary in most cases.\" So once you've completed transferring your Gmail messages, I recommend deleting your app password.\nWhat happens after my Gmail accounts are synced?\nOnce you've successfully linked your new Gmail archive account to your original account, your emails should begin to transfer automatically. The process could take several hours or days, depending on how many emails you have.\nIn my test account with about 75,000 messages, I found that it took Gmail about 2 full days to transfer all of them from the original account to the new archived mail account.\nImportant: After transferring your Gmail messages to your archived mail account, your original Gmail account will place all those messages in the Trash folder, which you'll need to empty manually. Clearing out those 75,000 messages from the Trash took about an hour.\nBefore transferring Gmail messages, my test account was using a little more than 12GB, or 80%, of Google's free 15GB. After transferring, the account was only using 0.66GB, of which 0.06GB was from Gmail.\nWhat Gmail messages won't be transferred?\nI found that Gmail transferred all of my messages except for two categories -- Drafts and Spam.\nYou'll need to decide what to do with your Drafts manually. Spam messages are automatically deleted every 30 days so you can let Gmail handle that or go into the Spam folder yourself after transferring your mail and delete or forward those messages.\nOnce all of your emails have been imported to your new account, enjoy the experience of inbox zero. You've given your original account a new lease on life.\nAt this point, there are two last steps: You'll want to stop the automatic transfer process so that you can continue using your original account and you'll want to delete that app password if you had to make one.\n1. Login to your new account, go into your Settings and select See all settings.\n2. Select the Accounts and Import tab, and then select delete for your original account (under Check mail from other accounts.)\n3. When prompted to Confirm delete mail account, select OK.\nIf you had to create a Google app password and want to delete it now, go back to https://myaccount.google.com/apppasswords and click the trashcan icon next to the password you created.\nCongrats, you're finished.\nOne important final note: Google will delete accounts that have been inactive for more than two years. So make sure you don't completely ignore all your old emails after transferring them. If you don't plan to regularly use your archive account to send email, you can still keep the account active by signing in at least once every two years."
    },
    {
      "url": "https://www.zdnet.com/article/6-hidden-android-features-every-user-should-know-and-how-they-make-life-easier/",
      "text": "6 hidden Android features every user should know - and how they make life easier\nI've been using Android since version 1.5, so it's not often that a feature catches me off guard. You can imagine that when I do come across an unfamiliar Android feature, it's an exciting moment.\nFor more casual (or newer) users of Google's mobile operating system, there are probably several hidden gems waiting to be discovered in Android, and some of these can be handy.\nAlso: Pixel phone battery life tanking? Google is working on a fix\nI've curated five somewhat hidden Android features that I believe every user should at least know about.\nLet's dive into those features.\n1. Share Wi-Fi via QR code\nYou may not give this feature a second thought, but allow me to set a scene for you. Say you're having visitors for the holidays and want to grant them access to your Wi-Fi network. Instead of making the password public (so anyone can use it), you could share the Wi-Fi credentials via QR code. Not only does this approach simplify the process of adding another device to the network, but it does so with a nod to security.\nOpen Settings > 'Network and Internet' > Internet, and tap the network you want to share. At the top of the resulting page, tap Share and verify it's you via biometrics or password/PIN.\nAlso: My secret trick to easily share Wi-Fi passwords with guests (and why I can't go back)\nA new page will open with a QR code for the selected Wi-Fi network. Present the QR code to whoever you want to scan it with their phone, a process that automatically adds the network to their device. You could also screenshot the QR code, print it out, and make the printout available (so you don't have to hand your phone around for people to scan).\n2. Enable 'Developer options'\nAndroid's 'Developer options' menu isn't just for developers. Anyone can enable it and gain access to a host of features, some of which are very handy.\nWith Developer options enabled, you can configure the maximum number of Bluetooth devices allowed to connect to your phone, unlock your bootloader, enable automatic system updates, enable USB debugging, edit the graphics driver settings, force peak refresh rate, and much more. Developer options should be enabled if you want power user-level control over Android.\nAlso: How to factory reset your Android phone without unlocking it first\nTo enable the feature, go to Settings > About Phone, scroll to the bottom of the page, and tap 'Build number' seven times. Once you've done that, you'll find 'Developer options' in Settings > System. Tap that entry to reveal the new options.\n3. Text translation\nIf you're traveling outside your country, you might need help translating text. Fortunately, Android is quite capable of translating text via the camera app.\nThis is an impressive feature. Let's say you have a menu or some other information you want translated. Unlock your Android phone and tap the Lens icon in the Search bar. Point your camera at what you want to translate and tap the Translate button.\nAlso: 5 habit trackers on Android that can reveal your patterns - and motivate you to change\nAndroid will automatically translate the text and display it as an image (almost exactly how it's laid out in the original document). You can then view the translated text, copy it to your computer, take a screenshot, or search for the translated text. You could use this feature for just about any situation where you need text translated automatically.\nAs a bonus, there's also the official Google Translate app, which can listen to voices and translate from one language to another. If you travel to countries and don't speak the native language, this app should be considered a must.\n4. Use Extend Unlock\nWhen at home, I don't need to lock my phone because I'm not concerned that someone will grab it and steal my information.\nWhere physical threats to your phone are minimal, consider making access easier by enabling Extend Unlock (which used to be called Smart Lock) and adding your home as a Trusted Place.\nAlso: How to start using the new Linux terminal on your Android device\nTo do this, go to Settings > 'Security & privacy' > 'More security & privacy' > Extend Unlock. You'll be prompted to verify that it's you and then be presented with a description of Extend Unlock.\nOn the next page, you can configure Extend Unlock for on-body detection, trusted places, or trusted devices. Tap 'Trusted places' and, on the resulting page, add a new trusted place. Once you've done that step, whenever you arrive at your trusted place, your phone will be unlocked automatically until you leave that location.\nNote that this approach can lead to security issues, especially if you have guests in your home. With that in mind, use this feature judiciously.\n5. Set your medical information\nAndroid allows you to store important medical information, such as name, height, weight, gender, blood type, date of birth, organ donor status, pregnancy status, medications, address, and medical notes. If you ever need this feature, you'll be glad you took advantage of it.\nTo add your medical information, go to Settings > 'Safety & emergency' > 'Medical information'. On the next page, add whatever information you deem important. There are two caveats to this feature. First, emergency responders need to know about the feature to use it. Second, those same responders would have to be able to unlock your phone to access it.\nTo get around that issue, tap 'Change setting' at the bottom and, on the resulting page, make the information available, even when your phone is locked, during an emergency call. To access this feature, tap Emergency at the bottom of the dial pad (for the unlock screen) and then tap View Emergency Information.\nAlso: The best SSH clients for Android - including my two favorites\nEven with these hurdles, it's an important feature to have available should you need it.\n6. Gboard clipboard\nYou might not know this fact, but the Android keyboard (Gboard) has some impressive clipboard features. Once enabled, you can copy text and images (holding them on the clipboard for up to an hour before forgetting them), save and edit clips (so you can reuse them later), pin clips (by touching and holding them), and more.\nAlso: I changed 12 settings on my Android phone to dramatically improve battery life\nYou have to enable the Gboard clipboard manually. Otherwise, Android will use the traditional, built-in clipboard. I much prefer the Gboard clipboard because of the extended features. You enable the clipboard by opening the keyboard (from within any app), tapping the clipboard icon, and then tapping the On/Off slider until it's in the On position.\nGet the morning's top stories in your inbox each day with our Tech Today newsletter."
    },
    {
      "url": "https://www.zdnet.com/article/how-to-upgrade-an-incompatible-windows-10-pc-to-windows-11-2-free-options/",
      "text": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nHow to upgrade an 'incompatible' Windows 10 PC to Windows 11 - 2 free options\nOn Oct. 14, 2025, Microsoft will stop delivering security updates to your Windows 10 PC unless you enroll that PC in the Extended Security Updates program.\nIf you try to upgrade to Windows 11 on a PC that's more than five or six years old, you'll probably encounter an error message telling you -- in no uncertain terms -- that your old PC doesn't qualify because its CPU isn't on the official list of compatible processors. Microsoft has stated, forcefully, that it will not revise those requirements. You will also hit roadblocks if your PC doesn't have a Trusted Platform Module (TPM) version 2.0, or if the TPM is not enabled.\nAlso: Two ways to get free Windows 10 security updates through October 2026\nThat might be the official policy, but -- as with everything Windows-related -- it pays to read the fine print.\nThose pesky restrictions prevent you from automatically upgrading to Windows 11 using Windows Update or the Windows 11 Installation Assistant. Yet, as I detail in ZDNET's Windows 11 FAQ, there are documented workarounds for most PCs that were originally built for Windows 10.\nOver the past few years, Microsoft has played a cat-and-mouse game with enthusiasts, adding occasional speed bumps that make it more difficult to bypass these compatibility checks. There are workarounds for most modern PCs, but some older devices, especially those built using AMD processors, might be out of luck. The instructions below take all those developments into account.\nAlso: Can your old PC handle the Windows 11 upgrade? How to find out - before you try\nThese instructions also assume that you have a PC running a retail or OEM edition of Windows 10 (Home or Pro) and that you are signed in as an administrator on the PC you want to upgrade.\nWhich option should you choose?\nPlease don't skip over this section.\nThis article describes two upgrade options. To take advantage of the workaround described in option 1 below, your computer must meet all the other requirements for Windows 11.\n- It must be configured to start up using UEFI, not a legacy BIOS configuration.\n- Secure Boot must be supported, although it does not need to be enabled. (But seriously, folks, you should enable Secure Boot.)\n- A TPM must be enabled; version 1.2 is OK, but a system without any TPM or with the TPM disabled will fail. Any PC that was originally designed for Windows 10 should include a TPM 2.0.\nTo check these details on a PC you're considering upgrading, run the System Information utility, Msinfo32.exe, and look at the System Summary page. Pay special attention to the BIOS Mode value. If it says \"Legacy,\" you'll need to reconfigure your system to UEFI mode (and convert your system disk from MBR to GPT partitioning) before you can install Windows 11 as a normal upgrade.\nAlso: Why Windows 11 requires a TPM - and how to get around it\nTo see whether your PC has a TPM enabled, run the Trusted Platform Module Management tool, Tpm.msc. If your computer includes a TPM and it's turned on, this app will display information about it. Under the TPM Manufacturer Information heading, check the specification version to confirm that it is 2.0. If there's no TPM, or if the TPM is disabled in firmware settings, you'll see a message that says \"Compatible TPM cannot be found.\"\nIf you're unable (or unwilling) to change from Legacy BIOS to UEFI, or if you have an older PC that doesn't have a TPM option at all, you'll need to use the second option, which takes advantage of an undocumented hack that allows you to bypass the compatibility checks and complete the upgrade. Skip to the Option 2 section of this post for details on how to use the free Rufus utility to perform this upgrade.\nAlso: How to install Windows 11 your way (and avoid Microsoft's restrictions)\nFinally, note that Microsoft added a new set of restrictions as part of the Windows 11 version 24H2 update. These changes require a CPU that supports specific instructions -- SSE4.2 and PopCnt. Most PCs with Intel CPUs from 2009 or later will meet this standard. AMD CPUs from 2013 or later should also meet these requirements. But it is impossible to upgrade to Windows 11 version 24H2 on a PC that was built in 2008 or earlier. For details, see \"Microsoft blocked your Windows 11 upgrade? This trusty tool can (probably) fix that.\"\nIf you plan to perform a clean installation of Windows 11, you can boot from installation media and run Windows Setup. That option skips the CPU compatibility check completely (but still requires a TPM and Secure Boot support). After the installation completes, you'll need to reinstall all your apps, restore your data files, and tweak settings to personalize your system preferences.\nWant to avoid all that hassle? Choose the option that's appropriate for your hardware.\nOption 1: Use this simple registry edit\nWith this registry edit, you can bypass CPU checks and accept any TPM version. Please be aware that this option requires that you run the Setup program from within your current Windows installation. You can't boot from a USB flash drive and install Windows 11 this way.\nThis process requires four steps.\n1. Change one key in the Windows registry\nYou need to make one small change to the Windows registry. For more than three years, this change was documented at Microsoft's support website, but the company removed those instructions in December 2024. (Here's an archived version of that support article.) This change tells the Windows 11 Setup program to skip the check for compatible CPUs and to allow installation on a PC with an older TPM (version 1.2). The usual warnings apply when working with the registry; I recommend you make a complete backup before proceeding.\nOpen Registry Editor (Regedit.exe) and navigate to the following key:\nHKEY_LOCAL_MACHINE\\SYSTEM\\Setup\\MoSetup\nIf the MoSetup key doesn't exist, you need to create it. Right-click the node for HKEY_LOCAL_MACHINE\\SYSTEM\\Setup in the left-hand navigation pane, then choose New > Key. Name it MoSetup and press Enter.\nAlso: Wiping your Windows laptop? Here's the simplest way to erase all personal data\nSelect the MoSetup key and then right-click in any empty space in the pane on the right. Choose the option to create a new DWORD value. (Don't choose the QWORD option!)\nReplace the default name for that key by typing the text AllowUpgradesWithUnsupportedTPMOrCPU and then press Enter. Then double-click the new value and change the \"Value data\" box to 1. The result should look like this:\nCheck for typos before proceeding -- Windows is frustratingly literal about the contents of the registry, and if you misspell the key or value name, your upgrade will fail. Click OK to save your change, and then restart your PC.\n2. Download the Windows 11 ISO\nOn the PC you want to upgrade, go to the Windows 11 Download page (aka.ms/DownloadWindows11) and choose the option at the bottom of the page, \"Download Windows 11 Disk Image (ISO) for x64 devices.\" Save the ISO file in your Downloads folder.\nNote that this is a big file. Depending on the speed of your internet connection, the download could take a while.\nAlso: The ultimate Windows 11 upgrade guide: Everything you need to know\nFor those running Windows with English (UK) as the selected language, choose English (United States) when prompted for a product language. Several readers have reported that choosing English International results in an upgrade that does not allow you to keep installed apps and data files.\n3. Mount the ISO file in File Explorer\nAfter the download completes, open File Explorer and double-click the ISO file you downloaded in the previous step. Doing so mounts the file as a virtual DVD drive in its own folder, with its own drive letter.\n4. Run Windows Setup\nIn File Explorer, find the Setup.exe file in the virtual drive you opened in the previous step and double-click it to begin the upgrade. You'll see a stern warning about compatibility issues and the possibility that performing an upgrade will mean you are not entitled to future updates. You can safely click Accept to move past this message. (For details on what that warning message really means, see \"Is Microsoft really going to cut off security updates for your 'unsupported' Windows 11 PC?\" Spoiler: They are not going to cut off security updates.) After you click OK on that dialog box, your upgrade should proceed without any serious issues.\nIf you're upgrading from the same edition (Home or Pro), you'll have three options: You can keep your apps, settings, and files (Full Upgrade); keep your data files but start fresh with apps and settings (Keep Data Only); or start completely fresh (Clean Install).\nOption 2: Use the free Rufus utility\nOn older PCs without a TPM and on PCs that don't support Secure Boot, you'll need to use an undocumented hack to bypass the compatibility checker. You can do this manually by replacing the Appraiserres.dll file (in the Sources subfolder on the Windows 11 installer drive) with a zero-byte version and then making a series of registry edits. But it's simpler to use the free, open-source Rufus utility to create installation media (on a USB flash) drive that includes these tweaks automatically.\nTo get started, download Rufus version 4.6 or later. Earlier versions won't work, thanks to changes Microsoft made in October 2024 to its compatibility checking tools. For details of how the newer versions work, see \"Microsoft blocked your Windows 11 upgrade? This just-released tool can get the job done.\" In addition, be aware that using Rufus will not allow you to bypass the new restrictions on very old PCs that were introduced with Windows 11 version 24H2.\nIf you have a PC with a CPU that lacks support for SSE4.2 and PopCnt instructions, not even Rufus can help. (Of course, any PC that fails that test is nearly 20 years old and probably deserves to be retired.)\nAlso: Yes, you can upgrade that old PC to Windows 11, even if Microsoft says no. These readers proved it\nTo get started, you'll need to download the Windows 11 ISO. Be sure to save it to the Downloads folder of your Windows system drive so you can find it easily. You'll also need a USB flash drive of at least 16 GB in size. You will reformat this drive as part of the process, so back up any data on that drive first -- and do not store the Windows 11 ISO here!\n- Download Rufus from the developer's site or from the Microsoft Store and run the app.\n- Choose the USB drive and then choose the \"Disk or ISO image\" option.\n- Click the Select button, choose the Windows 11 ISO you downloaded earlier, and then click Start.\n- In the Windows User Experience dialog, select the first checkbox to remove hardware requirements, as shown in the screenshot below.\n- Click OK to begin creating the drive.\nAfter Rufus successfully creates your installer, open that USB drive in File Explorer, and double-click Setup. Do not try to upgrade by booting from that USB drive and performing a clean install; it won't work.\nAs is the case with the other option, you'll see a warning about compatibility issues. It's a scare tactic. (For details on what the language in that warning message actually means, see \"Is Microsoft really going to cut off security updates for your 'unsupported' Windows 11 PC?\") After you click Accept on that dialog box, your upgrade should proceed without any serious issues.\nAlso: Microsoft blocked your Windows 11 upgrade? This trusty tool can (probably) fix that\nMy ZDNET colleague Lance Whitney has more details on the other options available with Rufus in \"How to install Windows 11 the way you want (and bypass Microsoft's restrictions).\"\nDid your upgrade work?\nIf you've tried this upgrade, I want to hear about your experience. If it worked, please share the details. If you run into snags, send me an email so we can figure out what's going wrong. Be sure to include details -- the make and model of your PC and screenshots of any error messages. I've set up a special inbox just for this feedback: Win11Upgrade [at] realworldwindows.com.\nThis article was originally published on April 9, 2022, but has been updated multiple times since then. It was last updated on July 10, 2025.\nGet the morning's top stories in your inbox each day with our Tech Today newsletter."
    }
  ],
  "argos_summary": "Google offers 15GB of free storage for new Gmail accounts, which can quickly fill up due to emails, Google Drive, and Google Photos. Users can transfer emails to a new account to free up space without losing important messages, involving steps like backing up emails via Google Takeout, enabling POP settings, and creating a new archive account. Additionally, Notion has launched Notion Mail, a new email tool that integrates with its productivity platform, featuring AI-driven smart labeling and custom views, although it currently lacks database integration.",
  "argos_id": "O7VEAKGVQ"
}