{
  "url": "https://finance.yahoo.com/news/ravelin-properties-reit-reports-second-214900070.html",
  "authorsByline": "Newsfile Corp.",
  "articleId": "2009652b6a2945d7a663a6ee025a01b8",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/newsfile_64/0d314448172305ab136cd81aa0b75759",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T21:49:00+00:00",
  "addDate": "2025-08-11T22:30:13.546503+00:00",
  "refreshDate": "2025-08-11T22:30:13.546504+00:00",
  "score": 1.0,
  "title": "Ravelin Properties REIT Reports Second Quarter 2025 Results",
  "description": "Toronto, Ontario--(Newsfile Corp. - August 11, 2025) - Ravelin Properties REIT (TSX: RPR.UN) (\"Ravelin\" or the \"REIT\"), an internally managed global owner and operator of well-located commercial real estate, announces financial results for the three and six months ended June 30, 2025.The REIT's unaudited interim financial statements and Management's Discussion and Analysis for the six months ended June 30, 2025 are available under the REIT's issuer profile on SEDAR+ and can also be found ...",
  "content": "During the three months ended June 30, 2025, the REIT continued the process with its lenders and restructuring advisors in respect of a potential recapitalization plan. Please refer to the relevant disclosures contained in the unaudited interim financial statements and Management's Discussion and Analysis for the six months ended June 30, 2025.\n\nOn a trailing twelve-month basis, the REIT generated $77.8 million of Adjusted EBITDA, resulting in a net debt to Adjusted EBITDA ratio of 13.6x, inclusive of the REIT's convertible debentures, or 11.6x excluding convertible debentures. Management expects these metrics to improve as the full benefit of savings achieved from the termination of the REIT's external management agreement with Slate Management ULC (the \"Internalization\") in the first two quarters of 2025 will be reflected in the trailing twelve-month Adjusted EBITDA calculation in coming quarters.\n\nOn April 1, 2025, the REIT disposed of one property (1189 Colonel Sam Drive in Oshawa, Ontario) for total gross proceeds of $16.5 million. The net cash proceeds from the disposition were fully used to reduce borrowings on the REIT's Canadian revolving credit facility.\n\nThe REIT's liquidity as at June 30, 2025 consisted of unrestricted cash of $17.8 million ($13.6 million at December 31, 2024) and property level restricted cash of $11.0 million ($10.7 million at December 31, 2024), for total liquidity of $28.8 million ($24.3 million at December 31, 2024).\n\nThe REIT's current leasing pipeline exceeds 450,000 square feet of renewals and new leases across its portfolio. In addition, the REIT has more than 139,533 square feet of rent reviews underway in Ireland, whereby the REIT has an opportunity to increase in-place rents to market rent levels during the lease terms.\n\nOccupancy as at June 30, 2025 was 75.8%, a decrease from 76.7% as at March 31, 2025. 0.4% of the sequential occupancy decrease was a result of the REIT's disposition of a fully occupied property in Ontario in April 2025. The remaining 0.5% is due to the expiration of tenant leases.\n\n163,279 square feet of new leases and renewals were signed in the second quarter of 2025 (inclusive of leases which will commence in future quarters). These deals were completed at a weighted average net rental rate per square foot of $19.73. Excluding cases of leasing vacant space, new leases and renewals were completed at 6.23% above the prior rental rate.\n\nOn May 31, 2025, and June 30, 2025, G2S2 Capital Inc. (\"G2S2 Capital\") and the REIT agreed to capitalize for the months of May and June 2025, respectively, a total of $5.5 million in interest payable to G2S2 Capital under the revolving credit facilities and related mortgages. The accrued interest for May 2025 was capitalized to the principal balance of the revolving credit facilities and the respective mortgages as of May 31, 2025. The accrued interest for June 2025, which was due and payable on July 1, 2025, was capitalized to the debt principal subsequent to June 30, 2025.\n\nEffective June 1, 2025, the REIT internalized property management and property level accounting functions for its Chicago, IL properties. Management anticipates the annualized run-rate costs savings from internalizing the Chicago property management and accounting functions to be in excess of $2.5 million (June 1, 2025 to May 31, 2026).\n\nThe REIT achieved total cost savings of approximately $4.1 million during the six months ended June 30, 2025 from the elimination of management fees and greater focus on overhead expense management. Please see the MD&A for a detailed cost savings analysis on an itemized basis during the six months ended June 30, 2025. Management continues to anticipate that the Internalization will result in annualized run-rate cost savings of approximately $10 million on a full year basis in 2025.\n\nThe REIT's unaudited interim financial statements and Management's Discussion and Analysis for the six months ended June 30, 2025 are available under the REIT's issuer profile on SEDAR+ and can also be found on the REIT's website at ravelinreit.com .\n\nToronto, Ontario--(Newsfile Corp. - August 11, 2025) - Ravelin Properties REIT (TSX: RPR.UN) (\"Ravelin\" or the \"REIT\"), an internally managed global owner and operator of well-located commercial real estate, announces financial results for the three and six months ended June 30, 2025.\n\n1 EBITDA is calculated using trailing twelve month actuals, as defined below.\n\nThe REIT's financial results and supplemental materials have been filed under the REIT's issuer profile on SEDAR+ and are also available on the REIT's website at ravelinreit.com under the Investors page. For any questions related to the REIT's financial results or ongoing business initiatives, please contact the REIT's investor relations team at ir@ravelinreit.com or (647) 792-6060.\n\nThe REIT owns and operates a portfolio of well-located commercial real estate assets in North America and Europe. The majority of the REIT's portfolio is comprised of government and high-quality credit tenants. Visit ravelinreit.com to learn more.\n\nCertain information herein constitutes \"forward-looking information\" as defined under Canadian securities laws which reflect management's expectations regarding objectives, plans, goals, strategies, future growth, results of operations, performance, business prospects and opportunities of the REIT. The words \"plans\", \"expects\", \"does not expect\", \"scheduled\", \"estimates\", \"intends\", \"anticipates\", \"does not anticipate\", \"projects\", \"believes\", or variations of such words and phrases or statements to the effect that certain actions, events or results \"may\", \"will\", \"could\", \"would\", \"might\", \"occur\", \"be achieved\", or \"continue\" and similar expressions identify forward-looking statements. Forward-looking statements contained herein include, but are not limited to, statements relating to: the REIT's current leasing pipeline and anticipated future leasing activity; expectations of improved Adjusted EBITDA and related metrics; the anticipated cost savings of the Internalization and greater focus on overhead expense management; the anticipated annualized run-rate costs savings from the internalization of property management and accounting functions for the REIT's Chicago, IL properties; and the ability of the REIT to reach an agreement regarding terms of a potential recapitalization plan. Such forward-looking statements are qualified in their entirety by the inherent risks and uncertainties surrounding future expectations.\n\nForward-looking statements are necessarily based on a number of estimates and assumptions that, while considered reasonable by management as of the date hereof, are inherently subject to significant business, economic and competitive uncertainties and contingencies. When relying on forward-looking statements to make decisions, the REIT cautions readers not to place undue reliance on these statements, as forward-looking statements involve significant risks and uncertainties and should not be read as guarantees of future performance or results, and will not necessarily be accurate indications of whether or not the times at or by which such performance or results will be achieved. A number of factors could cause actual results to differ, possibly materially, from the results discussed in the forward-looking statements. Additional information about risks and uncertainties is contained in the REIT's Annual Information Form for the year ended December 31, 2024, available under the REIT's issuer profile on SEDAR+ and on the REIT's website at ravelinreit.com.\n\nWe disclose a number of financial measures in this news release that are not measures used under IFRS, including NOI, FFO, Core-FFO, AFFO, NAV, adjusted EBITDA, net debt to adjusted EBITDA ratio and interest coverage ratio, in addition to certain measures on a fully-diluted per unit basis.\n• NOI is defined as rental revenue, excluding non-cash straight-line rent and leasing costs amortized to revenue, less property operating costs prior to International Financial Reporting Interpretations Committee 21, Levies (\"IFRIC 21\") adjustments. Rental revenue for purposes of measuring NOI excludes revenue recorded as a result of determining rent on a straight-line basis and the amortization of leasing costs in revenue for IFRS. Same-property NOI includes those properties owned by the REIT for each of the current period and the relevant comparative period.\n• FFO is defined as net income adjusted for certain items including transaction costs, change in fair value of properties, change in fair value of financial instruments, change in fair value of Class B LP units, deferred income taxes, tax on gains on disposals of investment properties, distributions to Class B unitholders, depreciation and IFRIC 21 property tax adjustments.\n• Core-FFO is defined as FFO adjusted for the REIT's share of lease payments received for a data centre in Winnipeg, Manitoba (the \"Data Centre\"), which for IFRS purposes is accounted for as a finance lease.\n• AFFO is defined as FFO adjusted for amortization of deferred transaction costs; de-recognition and amortization of mark-to-market (\"MTM\") adjustments on mortgages refinanced or discharged; adjustments for interest rate subsidies received; recognition of the REIT's share of lease payments received for the Data Centre, which for IFRS purposes, is accounted for as a finance lease; amortization of straight-line rent; and normalized direct leasing and capital costs.\n• FFO per unit, Core-FFO per unit and AFFO per unit are defined as FFO, Core-FFO and AFFO divided by the weighted average diluted number of units outstanding, respectively.\n• NAV is defined as the aggregate of the carrying value of the REIT's equity, Class B LP units, deferred units, and deferred tax liability.\n• Adjusted EBITDA is defined as earnings before interest, income taxes, depreciation, fair value gains (losses) from both financial instruments and investment properties, while also excluding non-recurring items such as transaction costs from dispositions, acquisitions or other events.\n• Net debt to adjusted EBITDA is defined as the aggregate amount of debt outstanding, less cash on hand, divided by the trailing twelve-month adjusted EBITDA.\n• Interest coverage ratio is defined as adjusted EBITDA divided by the REIT's interest expense for the period.\n\nWe use these measures for a variety of reasons, including measuring performance, managing the business, capital allocation and the assessment of risk. Descriptions of why these non-IFRS measures are useful to investors and how management uses each measure are included in the Management's Discussion and Analysis for the six months ended June 30, 2025, which readers should read when evaluating the measures included herein. We believe that providing these performance measures on a supplemental basis to our IFRS results is helpful to investors in assessing the overall performance of our businesses in a manner similar to management. These financial measures should not be considered as a substitute for similar financial measures calculated in accordance with IFRS. We caution readers that these non-IFRS financial measures may differ from the calculations disclosed by other businesses, and as a result, may not be comparable to similar measures presented by others.\n\nThe tables below summarize a calculation of non-IFRS measures based on IFRS financial information.\n\nThe calculation of NOI is as follows:\n\n1 In accordance with IFRIC 21, the REIT recognizes property tax liability and expense on its existing U.S. properties as at January 1 of each year, rather than progressively, i.e., ratably throughout the year. The recognition of property taxes as a result of IFRIC 21 has no impact on NOI, FFO or AFFO.\n\n2 Refer to \"Non-IFRS measures\" section above.\n\nThe reconciliation of cash flow from operating activities to FFO, Core-FFO and AFFO is as follows:\n\nThe calculation of trailing twelve month adjusted EBITDA is as follows:\n\n1In accordance with IFRIC 21, the REIT recognizes property tax liability and expense on its existing U.S. properties as at January 1 of each year, rather than progressively, i.e., ratably throughout the year. The recognition of property taxes as a result of IFRIC 21 has no impact on NOI, FFO, Core-FFO or AFFO.\n\n2Adjusted EBITDA is based on actuals for the twelve months preceding the balance sheet date.\n\n3 Refer to \"Non-IFRS measures\" section above.\n\nThe calculation of net debt is as follows:\n\nThe calculation of net debt to adjusted EBITDA is as follows:\n\n1 Adjusted EBITDA is based on actuals for the twelve months preceding the balance sheet date.\n\n2 Refer to \"Non-IFRS measures\" section above.\n\nThe interest coverage ratio is calculated as follows:\n\n1 Adjusted EBITDA and interest expense are based on actuals for the twelve months preceding the balance sheet date.\n\n2 Refer to \"Non-IFRS measures\" section above.\n\nThe following is the calculation of IFRS NAV on a total and per unit basis at June 30, 2025 and December 31, 2024:\n\n1 Represents the fully diluted number of units outstanding and includes outstanding REIT units, DUP units and Class B LP units.\n\nTo view the source version of this press release, please visit https://www.newsfilecorp.com/release/262107",
  "medium": "Article",
  "links": [
    "https://api.newsfilecorp.com/redirect/rppykCrppJ",
    "https://api.newsfilecorp.com/redirect/VvvXNceAA1",
    "https://api.newsfilecorp.com/redirect/zAAxKCovvn"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "REIT",
      "weight": 0.08779226
    },
    {
      "name": "outstanding REIT units",
      "weight": 0.085724376
    },
    {
      "name": "Ravelin Properties REIT",
      "weight": 0.08046725
    },
    {
      "name": "financial results",
      "weight": 0.070452444
    },
    {
      "name": "property operating costs",
      "weight": 0.06992483
    },
    {
      "name": "non-IFRS measures",
      "weight": 0.06767335
    },
    {
      "name": "similar financial measures",
      "weight": 0.06575258
    },
    {
      "name": "financial measures",
      "weight": 0.06569016
    },
    {
      "name": "non-IFRS financial",
      "weight": 0.065533206
    },
    {
      "name": "property taxes",
      "weight": 0.061753105
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.931640625
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.90478515625
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.853515625
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.78173828125
    },
    {
      "name": "/Real Estate/Other",
      "score": 0.60791015625
    },
    {
      "name": "/Real Estate/Property Development",
      "score": 0.54052734375
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.44287109375
    },
    {
      "name": "/Finance/Investing/Real Estate Investment Trusts",
      "score": 0.346435546875
    }
  ],
  "sentiment": {
    "positive": 0.45589685,
    "negative": 0.16038688,
    "neutral": 0.38371626
  },
  "summary": "Ravelin Properties REIT (TSX: RPR) has reported its second quarter of 2025 results, with the REIT generating $77.8 million of Adjusted EBITDA, resulting in a net debt to Adjusted EDBDA ratio of 13.6x. The company disposed of one property in Oshawa, Ontario for $16.5 million, which was fully used to reduce borrowings on the ReIT's Canadian revolving credit facility. The REIT's current leasing pipeline exceeds 450,000 square feet and new leases across its portfolio, with over 139,533 square feet of rent reviews underway in Ireland. The full benefit of savings achieved from internalizing the external management agreement with Slate Management ULC (the \"Internalization\"), will be reflected in the trailing twelve-month Adjusted EBDDA calculation in coming quarters. The current occupancy rate as at June 30, 2025 was 75.8%, a decrease from 76.7% as at March 31, 2025.",
  "shortSummary": "Ravelin Properties REIT's Q2 Q25 results reflect ongoing discussions with lenders and restructuring advisors regarding a potential recapitalization plan, while achieving significant cost savings and leasing opportunities.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "dc36286c67814ab6b733675cb66ca3d6",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://api.newsfilecorp.com/redirect/zAAxKCovvn",
      "text": "Ravelin Properties REIT Reports Second Quarter 2025 Results\nAugust 11, 2025 5:49 PM EDT | Source: Ravelin Properties REIT\nToronto, Ontario--(Newsfile Corp. - August 11, 2025) - Ravelin Properties REIT (TSX: RPR.UN) (\"Ravelin\" or the \"REIT\"), an internally managed global owner and operator of well-located commercial real estate, announces financial results for the three and six months ended June 30, 2025.\nThe REIT's unaudited interim financial statements and Management's Discussion and Analysis for the six months ended June 30, 2025 are available under the REIT's issuer profile on SEDAR+ and can also be found on the REIT's website at ravelinreit.com.\nHighlights\n- The REIT achieved total cost savings of approximately $4.1 million during the six months ended June 30, 2025 from the elimination of management fees and greater focus on overhead expense management. Please see the MD&A for a detailed cost savings analysis on an itemized basis during the six months ended June 30, 2025. Management continues to anticipate that the Internalization will result in annualized run-rate cost savings of approximately $10 million on a full year basis in 2025.\n- Effective June 1, 2025, the REIT internalized property management and property level accounting functions for its Chicago, IL properties. Management anticipates the annualized run-rate costs savings from internalizing the Chicago property management and accounting functions to be in excess of $2.5 million (June 1, 2025 to May 31, 2026).\n- On May 31, 2025, and June 30, 2025, G2S2 Capital Inc. (\"G2S2 Capital\") and the REIT agreed to capitalize for the months of May and June 2025, respectively, a total of $5.5 million in interest payable to G2S2 Capital under the revolving credit facilities and related mortgages. The accrued interest for May 2025 was capitalized to the principal balance of the revolving credit facilities and the respective mortgages as of May 31, 2025. The accrued interest for June 2025, which was due and payable on July 1, 2025, was capitalized to the debt principal subsequent to June 30, 2025.\n- 163,279 square feet of new leases and renewals were signed in the second quarter of 2025 (inclusive of leases which will commence in future quarters). These deals were completed at a weighted average net rental rate per square foot of $19.73. Excluding cases of leasing vacant space, new leases and renewals were completed at 6.23% above the prior rental rate.\n- Occupancy as at June 30, 2025 was 75.8%, a decrease from 76.7% as at March 31, 2025. 0.4% of the sequential occupancy decrease was a result of the REIT's disposition of a fully occupied property in Ontario in April 2025. The remaining 0.5% is due to the expiration of tenant leases.\n- The REIT's current leasing pipeline exceeds 450,000 square feet of renewals and new leases across its portfolio. In addition, the REIT has more than 139,533 square feet of rent reviews underway in Ireland, whereby the REIT has an opportunity to increase in-place rents to market rent levels during the lease terms.\n- The REIT's liquidity as at June 30, 2025 consisted of unrestricted cash of $17.8 million ($13.6 million at December 31, 2024) and property level restricted cash of $11.0 million ($10.7 million at December 31, 2024), for total liquidity of $28.8 million ($24.3 million at December 31, 2024).\n- On April 1, 2025, the REIT disposed of one property (1189 Colonel Sam Drive in Oshawa, Ontario) for total gross proceeds of $16.5 million. The net cash proceeds from the disposition were fully used to reduce borrowings on the REIT's Canadian revolving credit facility.\n- On a trailing twelve-month basis, the REIT generated $77.8 million of Adjusted EBITDA, resulting in a net debt to Adjusted EBITDA ratio of 13.6x, inclusive of the REIT's convertible debentures, or 11.6x excluding convertible debentures. Management expects these metrics to improve as the full benefit of savings achieved from the termination of the REIT's external management agreement with Slate Management ULC (the \"Internalization\") in the first two quarters of 2025 will be reflected in the trailing twelve-month Adjusted EBITDA calculation in coming quarters.\n- During the three months ended June 30, 2025, the REIT continued the process with its lenders and restructuring advisors in respect of a potential recapitalization plan. Please refer to the relevant disclosures contained in the unaudited interim financial statements and Management's Discussion and Analysis for the six months ended June 30, 2025.\nSummary of Q2 2025 Results\n| Three months ended June 30, | |||||||||\n| (thousands of dollars, except per unit amounts) | 2025 | 2024 | Change % | ||||||\n| Rental revenue | $ | 45,161 | $ | 49,567 | (8.9) % | ||||\n| Net operating income (\"NOI\") | $ | 20,366 | $ | 24,719 | (17.6) % | ||||\n| Net loss | $ | (10,399 | ) | $ | (150,045 | ) | (93.1) % | ||\n| Weighted average diluted number of trust units (000s) | 86,190 | 85,909 | 0.3 % | ||||||\n| Funds from operations (\"FFO\") | $ | 2,156 | $ | 4,388 | (50.9) % | ||||\n| FFO per unit | $ | 0.03 | $ | 0.05 | (40.0) % | ||||\n| Core-FFO | $ | 3,187 | $ | 5,334 | (40.3) % | ||||\n| Core-FFO per unit | $ | 0.04 | $ | 0.06 | (33.3) % | ||||\n| Adjusted FFO (\"AFFO\") | $ | 2,459 | $ | 4,211 | (41.6) % | ||||\n| AFFO per unit | $ | 0.03 | $ | 0.05 | (40.0) % | ||||\n| June 30, 2025 | December 31, 2024 | Change % | |||||||\n| Total assets | $ | 1,223,244 | $ | 1,229,711 | (0.5) % | ||||\n| Total debt | $ | 1,079,012 | $ | 1,090,024 | (1.0) % | ||||\n| Portfolio occupancy | 75.8 % | 76.8 % | (1.0) % | ||||||\n| Loan-to-value (\"LTV\") ratio | 89.0 % | 89.4 % | (0.4) % | ||||||\n| Net debt to adjusted EBITDA 1 | 13.6x | 12.9x | 0.7x | ||||||\n| Interest coverage ratio 1 | 1.1x | 1.0x | 0.1x |\n1 EBITDA is calculated using trailing twelve month actuals, as defined below.\nInvestor Information\nThe REIT's financial results and supplemental materials have been filed under the REIT's issuer profile on SEDAR+ and are also available on the REIT's website at ravelinreit.com under the Investors page. For any questions related to the REIT's financial results or ongoing business initiatives, please contact the REIT's investor relations team at ir@ravelinreit.com or (647) 792-6060.\nAbout Ravelin Properties REIT (TSX: RPR.UN)\nThe REIT owns and operates a portfolio of well-located commercial real estate assets in North America and Europe. The majority of the REIT's portfolio is comprised of government and high-quality credit tenants. Visit ravelinreit.com to learn more.\nForward-Looking Statements\nCertain information herein constitutes \"forward-looking information\" as defined under Canadian securities laws which reflect management's expectations regarding objectives, plans, goals, strategies, future growth, results of operations, performance, business prospects and opportunities of the REIT. The words \"plans\", \"expects\", \"does not expect\", \"scheduled\", \"estimates\", \"intends\", \"anticipates\", \"does not anticipate\", \"projects\", \"believes\", or variations of such words and phrases or statements to the effect that certain actions, events or results \"may\", \"will\", \"could\", \"would\", \"might\", \"occur\", \"be achieved\", or \"continue\" and similar expressions identify forward-looking statements. Forward-looking statements contained herein include, but are not limited to, statements relating to: the REIT's current leasing pipeline and anticipated future leasing activity; expectations of improved Adjusted EBITDA and related metrics; the anticipated cost savings of the Internalization and greater focus on overhead expense management; the anticipated annualized run-rate costs savings from the internalization of property management and accounting functions for the REIT's Chicago, IL properties; and the ability of the REIT to reach an agreement regarding terms of a potential recapitalization plan. Such forward-looking statements are qualified in their entirety by the inherent risks and uncertainties surrounding future expectations.\nForward-looking statements are necessarily based on a number of estimates and assumptions that, while considered reasonable by management as of the date hereof, are inherently subject to significant business, economic and competitive uncertainties and contingencies. When relying on forward-looking statements to make decisions, the REIT cautions readers not to place undue reliance on these statements, as forward-looking statements involve significant risks and uncertainties and should not be read as guarantees of future performance or results, and will not necessarily be accurate indications of whether or not the times at or by which such performance or results will be achieved. A number of factors could cause actual results to differ, possibly materially, from the results discussed in the forward-looking statements. Additional information about risks and uncertainties is contained in the REIT's Annual Information Form for the year ended December 31, 2024, available under the REIT's issuer profile on SEDAR+ and on the REIT's website at ravelinreit.com.\nNon-IFRS Measures\nWe disclose a number of financial measures in this news release that are not measures used under IFRS, including NOI, FFO, Core-FFO, AFFO, NAV, adjusted EBITDA, net debt to adjusted EBITDA ratio and interest coverage ratio, in addition to certain measures on a fully-diluted per unit basis.\n- NOI is defined as rental revenue, excluding non-cash straight-line rent and leasing costs amortized to revenue, less property operating costs prior to International Financial Reporting Interpretations Committee 21, Levies (\"IFRIC 21\") adjustments. Rental revenue for purposes of measuring NOI excludes revenue recorded as a result of determining rent on a straight-line basis and the amortization of leasing costs in revenue for IFRS. Same-property NOI includes those properties owned by the REIT for each of the current period and the relevant comparative period.\n- FFO is defined as net income adjusted for certain items including transaction costs, change in fair value of properties, change in fair value of financial instruments, change in fair value of Class B LP units, deferred income taxes, tax on gains on disposals of investment properties, distributions to Class B unitholders, depreciation and IFRIC 21 property tax adjustments.\n- Core-FFO is defined as FFO adjusted for the REIT's share of lease payments received for a data centre in Winnipeg, Manitoba (the \"Data Centre\"), which for IFRS purposes is accounted for as a finance lease.\n- AFFO is defined as FFO adjusted for amortization of deferred transaction costs; de-recognition and amortization of mark-to-market (\"MTM\") adjustments on mortgages refinanced or discharged; adjustments for interest rate subsidies received; recognition of the REIT's share of lease payments received for the Data Centre, which for IFRS purposes, is accounted for as a finance lease; amortization of straight-line rent; and normalized direct leasing and capital costs.\n- FFO per unit, Core-FFO per unit and AFFO per unit are defined as FFO, Core-FFO and AFFO divided by the weighted average diluted number of units outstanding, respectively.\n- NAV is defined as the aggregate of the carrying value of the REIT's equity, Class B LP units, deferred units, and deferred tax liability.\n- Adjusted EBITDA is defined as earnings before interest, income taxes, depreciation, fair value gains (losses) from both financial instruments and investment properties, while also excluding non-recurring items such as transaction costs from dispositions, acquisitions or other events.\n- Net debt to adjusted EBITDA is defined as the aggregate amount of debt outstanding, less cash on hand, divided by the trailing twelve-month adjusted EBITDA.\n- Interest coverage ratio is defined as adjusted EBITDA divided by the REIT's interest expense for the period.\nWe use these measures for a variety of reasons, including measuring performance, managing the business, capital allocation and the assessment of risk. Descriptions of why these non-IFRS measures are useful to investors and how management uses each measure are included in the Management's Discussion and Analysis for the six months ended June 30, 2025, which readers should read when evaluating the measures included herein. We believe that providing these performance measures on a supplemental basis to our IFRS results is helpful to investors in assessing the overall performance of our businesses in a manner similar to management. These financial measures should not be considered as a substitute for similar financial measures calculated in accordance with IFRS. We caution readers that these non-IFRS financial measures may differ from the calculations disclosed by other businesses, and as a result, may not be comparable to similar measures presented by others.\nFor Further Information\nInvestor Relations\nTel: +1 647 792 6060\nE-mail: ir@ravelinreit.com\nCalculation and Reconciliation of Non-IFRS Measures\nThe tables below summarize a calculation of non-IFRS measures based on IFRS financial information.\nThe calculation of NOI is as follows:\n| Three months ended June 30, | ||||||\n| (thousands of dollars, except per unit amounts) | 2025 | 2024 | ||||\n| Revenue | $ | 45,161 | $ | 49,567 | ||\n| Property operating expenses | (23,009 | ) | (23,428 | ) | ||\n| IFRIC 21 property tax adjustment 1 | (3,476 | ) | (3,349 | ) | ||\n| Straight-line rents and other changes | 1,690 | 1,929 | ||||\n| Net operating income | $ | 20,366 | $ | 24,719 | ||\n| The reconciliation of net income to FFO, Core-FFO and AFFO is as follows: | ||||||\n| Three months ended June 30, | ||||||\n| (thousands of dollars, except per unit amounts) | 2025 | 2024 | ||||\n| Net loss | $ | (10,399 | ) | $ | (150,045 | ) |\n| Add (deduct): | ||||||\n| Leasing costs amortized to revenue | 2,040 | 2,318 | ||||\n| Change in fair value of properties | 11,695 | 154,405 | ||||\n| IFRIC 21 property tax adjustment 1 | (3,476 | ) | (3,349 | ) | ||\n| Change in fair value of financial instruments | 2,590 | 2,982 | ||||\n| Transaction costs | 712 | 614 | ||||\n| Depreciation of hotel asset | 107 | 249 | ||||\n| Deferred income tax expense (recovery) | (3 | ) | 42 | |||\n| Change in fair value of Class B LP units | (1,110 | ) | (2,828 | ) | ||\n| FFO 2 | $ | 2,156 | $ | 4,388 | ||\n| Finance income on finance lease receivable | (599 | ) | (659 | ) | ||\n| Finance lease payments received | 1,630 | 1,605 | ||||\n| Core-FFO 2 | $ | 3,187 | $ | 5,334 | ||\n| Amortization of deferred transaction costs | 1,498 | 1,553 | ||||\n| Amortization of debt mark-to-market adjustments | (8 | ) | (8 | ) | ||\n| Amortization of straight-line rent | (350 | ) | (389 | ) | ||\n| Normalized direct leasing and capital costs | (1,868 | ) | (2,279 | ) | ||\n| AFFO 2 | $ | 2,459 | $ | 4,211 | ||\n| Weighted average number of diluted units outstanding (000s) | 86,190 | 85,909 | ||||\n| FFO per unit 2 | $ | 0.03 | $ | 0.05 | ||\n| Core-FFO per unit 2 | $ | 0.04 | $ | 0.06 | ||\n| AFFO per unit 2 | $ | 0.03 | $ | 0.05 |\n1 In accordance with IFRIC 21, the REIT recognizes property tax liability and expense on its existing U.S. properties as at January 1 of each year, rather than progressively, i.e., ratably throughout the year. The recognition of property taxes as a result of IFRIC 21 has no impact on NOI, FFO or AFFO.\n2 Refer to \"Non-IFRS measures\" section above.\nThe reconciliation of cash flow from operating activities to FFO, Core-FFO and AFFO is as follows:\n| Three months ended June 30, | ||||||\n| (thousands of dollars) | 2025 | 2024 | ||||\n| Cash flow from operating activities | $ | 12,390 | $ | 12,290 | ||\n| Add (deduct): | ||||||\n| Leasing costs amortized to revenue | 2,040 | 2,318 | ||||\n| Transaction costs | 712 | 614 | ||||\n| Working capital changes | (1,687 | ) | (2,503 | ) | ||\n| Straight-line rent and other changes | (1,690 | ) | (1,929 | ) | ||\n| Interest and finance costs | (17,730 | ) | (18,872 | ) | ||\n| Interest paid | 8,121 | 12,470 | ||||\n| FFO 1 | $ | 2,156 | $ | 4,388 | ||\n| Finance income on finance lease receivable | (599 | ) | (659 | ) | ||\n| Finance lease payments received | 1,630 | 1,605 | ||||\n| Core-FFO 1 | $ | 3,187 | $ | 5,334 | ||\n| Amortization of deferred transaction costs | 1,498 | 1,553 | ||||\n| Amortization of debt mark-to-market adjustments | (8 | ) | (8 | ) | ||\n| Amortization of straight-line rent | (350 | ) | (389 | ) | ||\n| Normalized direct leasing and capital costs | (1,868 | ) | (2,279 | ) | ||\n| AFFO 1 | $ | 2,459 | $ | 4,211 |\n1 Refer to \"Non-IFRS measures\" section above.\nThe calculation of trailing twelve month adjusted EBITDA is as follows:\n| Twelve months ended June 30, | ||||||\n| (thousands of dollars) | 2025 | 2024 | ||||\n| Net loss | $ | (305,498 | ) | $ | (268,706 | ) |\n| Straight-line rent and other changes | 6,408 | 9,965 | ||||\n| Interest income | (319 | ) | (536 | ) | ||\n| Interest and finance costs | 73,472 | 72,070 | ||||\n| Change in fair value of properties | 278,878 | 265,498 | ||||\n| IFRIC 21 property tax adjustment 1 | (259 | ) | (121 | ) | ||\n| Change in fair value of financial instruments | 18,937 | 15,979 | ||||\n| Distributions to Class B shareholders | - | 212 | ||||\n| Transaction costs | 2,902 | 1,132 | ||||\n| Depreciation of hotel asset | 712 | 983 | ||||\n| Change in fair value of Class B LP units | 714 | (9,329 | ) | |||\n| Costs related to the Internalization | 1,265 | - | ||||\n| Strategic review costs | - | 315 | ||||\n| Deferred income tax recovery | (271 | ) | 253 | |||\n| Current income tax expense | 838 | 2,955 | ||||\n| Adjusted EBITDA 2 3 | $ | 77,779 | $ | 90,670 |\n1In accordance with IFRIC 21, the REIT recognizes property tax liability and expense on its existing U.S. properties as at January 1 of each year, rather than progressively, i.e., ratably throughout the year. The recognition of property taxes as a result of IFRIC 21 has no impact on NOI, FFO, Core-FFO or AFFO.\n2Adjusted EBITDA is based on actuals for the twelve months preceding the balance sheet date.\n3 Refer to \"Non-IFRS measures\" section above.\nThe calculation of net debt is as follows:\n| (thousands of dollars) | June 30, 2025 | June 30, 2024 | ||||\n| Debt, non-current | $ | 166,516 | $ | 325,967 | ||\n| Debt, current | 912,496 | 818,028 | ||||\n| Debt | $ | 1,079,012 | $ | 1,143,995 | ||\n| Less: cash on hand | 17,803 | 10,908 | ||||\n| Net debt | $ | 1,061,209 | $ | 1,133,087 |\nThe calculation of net debt to adjusted EBITDA is as follows:\n| Twelve months ended June 30, | ||||||\n| (thousands of dollars) | 2025 | 2024 | ||||\n| Debt | $ | 1,079,012 | $ | 1,143,995 | ||\n| Less: cash on hand | 17,803 | 10,908 | ||||\n| Net debt | $ | 1,061,209 | $ | 1,133,087 | ||\n| Adjusted EBITDA 1 2 | 77,779 | 90,670 | ||||\n| Net debt to adjusted EBITDA 2 | 13.6x | 12.5x |\n1 Adjusted EBITDA is based on actuals for the twelve months preceding the balance sheet date.\n2 Refer to \"Non-IFRS measures\" section above.\nThe interest coverage ratio is calculated as follows:\n| Twelve months ended June 30, | ||||||\n| (thousands of dollars) | 2025 | 2024 | ||||\n| Adjusted EBITDA 1 2 | $ | 77,779 | $ | 90,670 | ||\n| Interest expense 1 | 67,747 | 65,873 | ||||\n| Interest coverage ratio 2 | 1.1x | 1.4x |\n1 Adjusted EBITDA and interest expense are based on actuals for the twelve months preceding the balance sheet date.\n2 Refer to \"Non-IFRS measures\" section above.\nThe following is the calculation of IFRS NAV on a total and per unit basis at June 30, 2025 and December 31, 2024:\n| (thousands of dollars, except per unit amounts) | June 30, 2025 | December 31, 2024 | ||||\n| Equity | $ | 46,351 | $ | 59,810 | ||\n| Class B LP units | 1,850 | 2,854 | ||||\n| Deferred unit liability | 177 | 193 | ||||\n| Deferred tax liability | - | 268 | ||||\n| IFRS net asset value | $ | 48,378 | $ | 62,857 | ||\n| Diluted number of units outstanding (000s) 1 | 86,351 | 86,030 | ||||\n| IFRS net asset value per unit | $ | 0.56 | $ | 0.73 |\n1 Represents the fully diluted number of units outstanding and includes outstanding REIT units, DUP units and Class B LP units.\nTo view the source version of this press release, please visit https://www.newsfilecorp.com/release/262107"
    }
  ],
  "argos_summary": "Ravelin Properties REIT reported its financial results for the second quarter of 2025, highlighting a trailing twelve-month Adjusted EBITDA of $77.8 million and a net debt to Adjusted EBITDA ratio of 13.6x. The REIT achieved approximately $4.1 million in cost savings from the internalization of management functions and expects further improvements in financial metrics. As of June 30, 2025, occupancy decreased to 75.8%, with a leasing pipeline exceeding 450,000 square feet and liquidity totaling $28.8 million.",
  "argos_id": "OOOD74V0B"
}