{
  "url": "https://www.latimes.com/world-nation/story/2025-08-11/islamic-court-in-indonesia-sentences-2-men-to-public-caning-over-sexual-acts-kissing-and-hugging",
  "authorsByline": "Yayan Zamzami",
  "articleId": "b8964c8464ac44bfaeb07554b956eab0",
  "source": {
    "domain": "latimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "CA",
      "city": "Los Angeles",
      "coordinates": {
        "lat": 34.0536909,
        "lon": -118.242766
      }
    }
  },
  "imageUrl": "https://ca-times.brightspotcdn.com/dims4/default/c361442/2147483647/strip/true/crop/5749x3018+0+403/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F72%2F2d%2F062e19a01a08f76a25990ed443dc%2F98a2d28a4fe440f7b17c14b0c0701ffa",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T19:35:28.080000+00:00",
  "addDate": "2025-08-11T21:03:33.948100+00:00",
  "refreshDate": "2025-08-11T21:03:33.948101+00:00",
  "score": 1.0,
  "title": "Islamic court in Indonesia sentences 2 men to public caning for kissing and hugging",
  "description": "The two men, ages 20 and 21, were arrested in April after residents saw them entering the same bathroom at a park in Indonesia and reported it to police.",
  "content": "Chief Judge Rokhmadi M. Hum, center, reads his verdict during the sentencing hearing for two men accused of homosexuality, at the Sharia Court in Banda Aceh, Indonesia, on Aug. 11, 2025.\n\nAn Islamic court in Indonesia ’s conservative Aceh province on Monday sentenced two men to public caning, 80 times each, after Islamic religious police caught them engaged in what the court deemed were sexual acts: hugging and kissing.\n\nThe trial at the Islamic Sharia District Court in Banda Aceh, the provincial capital, was held behind closed doors. Judges have the authority to limit public access in such a case and open it only for the verdict.\n\nThe two men, ages 20 and 21, were arrested in April after residents saw them entering the same bathroom at Taman Sari city park and reported it to police patrolling the area. The police broke into the bathroom and caught the men kissing and hugging, which the court considered to be a sexual act.\n\nThe lead judge, Rokhmadi M. Hum, said the two college students were “legally and convincingly” proved to have violated Islamic law by committing acts that lead to gay sexual relations. The court didn’t publicly identify the men.\n\nProsecutors previously sought 85 strokes of the cane for each, but the three-judge panel decided on what they described as lenient punishment because the men were outstanding students who were polite in court, cooperated with authorities and had no previous convictions.\n\nThe judges also ordered the time they have served to be deducted from their sentence. It means the number of lashes will be reduced by four as they have been detained for four months.\n\nThe prosecutor, Alfian, who, like many Indonesians, uses only a single name, said he was not satisfied with the lighter sentence. But he said he will not appeal.\n\nAceh is the only province in Muslim-majority Indonesia allowed to observe a version of Islamic law. It allows up to 100 lashes for morality offenses including gay sex. Caning is also punishment for adultery, gambling, drinking and for women who wear tight clothes and men who skip Friday prayers.\n\nIndonesia’s secular central government granted Aceh the right to implement the law in 2006 as part of a peace deal to end a separatist war. Aceh implemented an expansion in 2015 that extended the law to non-Muslims, who account for about 1% of the province’s population.\n\nHuman rights groups have criticized the law, saying it violates international treaties signed by Indonesia protecting the rights of minorities. Indonesia’s national criminal code doesn’t regulate homosexuality.\n\nMonday’s verdict was the fifth time that Aceh has sentenced people to public caning for homosexuality since the Islamic law was implemented.\n\nIn February, the same court sentenced two men to public caning up to 85 times for gay sex after neighborhood vigilantes in Banda Aceh suspected them of being gay and broke into their rented room to catch them naked and hugging each other.\n\nZamzami writes for the Associated Press. AP writer Niniek Karmini in Jakarta, Indonesia, contributed to this report.",
  "medium": "Article",
  "links": [
    "https://www.latimes.com/world-nation/story/2025-08-11/israeli-drone-strike-al-jazeera-journalist-anas-al-sharif-killed",
    "https://www.latimes.com/world-nation/story/2025-08-10/should-l-a-look-to-sponge-cities-to-solve-its-flooding-problem",
    "https://www.latimes.com/world-nation/story/2025-08-11/trump-expands-l-a-military-tactics-by-sending-national-guard-to-washington-d-c"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Banda Aceh",
      "weight": 0.0861352
    },
    {
      "name": "Islamic court",
      "weight": 0.08339824
    },
    {
      "name": "Islamic law",
      "weight": 0.08335279
    },
    {
      "name": "men",
      "weight": 0.07939514
    },
    {
      "name": "public caning",
      "weight": 0.07732248
    },
    {
      "name": "Aceh",
      "weight": 0.07535685
    },
    {
      "name": "Indonesia",
      "weight": 0.07356235
    },
    {
      "name": "Islamic religious police",
      "weight": 0.07135436
    },
    {
      "name": "public access",
      "weight": 0.06702178
    },
    {
      "name": "Rokhmadi M. Hum",
      "weight": 0.065554395
    }
  ],
  "topics": [
    {
      "name": "Islam"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.9248046875
    },
    {
      "name": "/Law & Government/Legal/Other",
      "score": 0.91748046875
    },
    {
      "name": "/Law & Government/Government/Courts & Judiciary",
      "score": 0.9091796875
    },
    {
      "name": "/Sensitive Subjects/Violence & Abuse",
      "score": 0.82763671875
    },
    {
      "name": "/People & Society/Religion & Belief",
      "score": 0.82568359375
    },
    {
      "name": "/News/Other",
      "score": 0.8173828125
    },
    {
      "name": "/Sensitive Subjects/Other",
      "score": 0.767578125
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Discrimination & Identity Relations",
      "score": 0.51904296875
    },
    {
      "name": "/News/Local News",
      "score": 0.48291015625
    },
    {
      "name": "/People & Society/Other",
      "score": 0.32958984375
    }
  ],
  "sentiment": {
    "positive": 0.06645482,
    "negative": 0.6391852,
    "neutral": 0.29436
  },
  "summary": "An Islamic court in Indonesia's conservative Aceh province has sentenced two men to public caning, 80 times each, for engaging in sexual acts such as hugging and kissing. The men, ages 20 and 21, were arrested in April after residents reported them to police. The trial was held behind closed doors and the lead judge, Rokhmadi M. Hum, stated that the men were proven to have violated Islamic law by committing acts that lead to gay sexual relations. The judge also ordered the time they have served to be deducted from their sentence, reducing the number of lashes by four as they have been detained for four months. This is not the first time the Aceh court has sentenced people for homosexuality since the Islamic law was implemented. The law allows up to 100 lashes for morality offenses including gay sex, and is also punishment for adultery, gambling, drinking and women who wear tight clothes and men who skip Friday prayers.",
  "shortSummary": "An Islamic court in Indonesia sentenced two men to 80 public caning for homosexuality, citing legal violations and insufficient time for appeal.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "18f79773e51f4bc0a4a5812930383286",
  "places": [
    {
      "osmId": "303390566",
      "suburb": "Suka Ramai",
      "city": "Banda Aceh",
      "state": "Aceh",
      "country": "Indonesia",
      "countryCode": "id",
      "coordinates": {
        "lat": 5.5457095,
        "lon": 95.3158531577078
      }
    }
  ],
  "scraped_sources": [
    {
      "url": "https://www.latimes.com/world-nation/story/2025-08-10/should-l-a-look-to-sponge-cities-to-solve-its-flooding-problem",
      "text": "- Share via\nIn 2019, when the Thai government announced plans to turn an abandoned tobacco factory in the nation’s smoggy capital into a public park, Bangkok-based landscape architect Chatchanin Sung saw an opportunity to address another of the city’s chronic problems: flooding.\nFor Bangkok, a city of 11 million sitting on low-lying swampland, the management of its water has increasingly become a matter of survival. With the capital facing more frequent and extreme rainfall as well as rising sea levels due to climate change, experts have warned that entire swaths of the city may be underwater within the next few decades.\nLos Angeles knows how to weather a crisis — or two or three. Angelenos are tapping into that resilience, striving to build a city for everyone.\nLike Los Angeles, where intensifying droughts and floods have revealed limitations of conventional flood control systems like the L.A. River, Chatchanin felt that Bangkok’s own stormwater infrastructure had reached its tipping point.\nDecades of rapid urban development have encased the city with impermeable concrete surfaces that hinder the natural drainage of water. As a result, the city’s network of over 1,600 urban canals, which were once used for transporting goods and people but now primarily act as stormwater channels, are regularly overwhelmed.\n“Because the canal water mixes with public sewage, the water quality is really bad,” Chatchanin said. “The park project was an opportunity to absorb and clean this water.”\nTo design the new space, a 102-acre expansion to the pre-existing Benjakitti Park, Chatchanin partnered with Kongjian Yu, a Beijing-based landscape architect who has long advocated what is known as a “sponge city” model of urban water management.\nU.S. officials didn’t even bother to ask Australia for help battling the Los Angeles fires.\nThe idea is that, unlike “gray” infrastructure, which is designed to flush water away as quickly as possible, cities like Bangkok can mitigate flood risk simply by making its surfaces more absorbent like a sponge, capturing stormwater before it can turn into runoff that pollutes streets and strains drainage systems.\nTheir winning design, which was opened to the public three years ago, was realized in just 18 months and reflects the idea that such urban water management systems can also provide valuable aesthetic and recreational benefits to communities.\nToday, the former brownfield is a popular bird-watching spot. It features forested walkways alongside badminton and pickleball courts built in repurposed cigarette warehouses, all the while capturing and cleaning water.\nFed by a nearby canal, a long system of wetlands containing thickets of aquatic plants removes pollutants from the water as it winds around the park’s perimeter, releasing what’s left into a large pond dotted with small islets.\nThis, alongside the park’s porous landscape and additional retention ponds, enable it to capture 23 million gallons of stormwater during Bangkok’s rainiest months. The water that’s entering permeable earth instead of being blocked by concrete is helping to replenish natural underground reservoirs that benefit humans and the environment.\n“Last year we had really heavy rains,” Chatchanin said. “The park also flooded but eventually absorbed it much more quickly.”\nShe pointed to the pond, which no longer had the foul odor or the oily sheen of the canal despite being just a few steps away. Dragonflies buzzed overhead — a common sign, she noted, that the water is clean.\nChatchanin acknowledged that one park alone can’t fix Bangkok’s water issues. But its modest success might, at the very least, encourage cities to rethink their relationship to water.\n“People want fast answers,” Chatchanin said. “But hiding the problem is no solution. You can’t just raise your house on stilts, or flush out the water. It all comes back in the end.”\nMelanie Winter has long advocated for change along the L.A. River. As she undergoes cancer treatment, she remains focused on healing L.A.’s relationship to water.\nThe idea that cities need to adapt to — not outrun — their floods has been a lifelong preoccupation of Kongjian Yu, whose work with sponge cities has earned him the prestigious Oberlander International Landscape Architecture Prize and comparisons to Frederick Law Olmsted, the designer of New York’s Central Park.\nYu traces its beginnings to a near-death experience he had as a child growing up in rural China.\nAt the time just 10 years old, Yu had been playing on the banks of his village’s river, which was more voluminous than usual due to heavy monsoon rains, when he suddenly found himself being swept away by the powerful currents.\nWhat saved him were the river’s reeds and willows, which slowed the water and gave him a chance to pull himself out.\n“My experience in these villages, my experience with the river and the creek, taught me how to live with nature,” he said.\nLater, Yu earned a landscape ecology degree from Harvard University’s Graduate School of Design and spent two years in Los Angeles working for SWA Group before returning to China in 1997.\nDismayed that the rapidly modernizing country had lined its cities with concrete dams and channelized waterways, Yu began writing to local mayors, warning of the risks of this approach and advocating instead for “rewilding natural water systems.”\n“Sponge cities follow three principles: retain, slow down and embrace water,” Yu said. “That means removing all unnecessary concrete and pavement.”\nAt first, his ideas found few sympathetic ears. Some people, he recalled, sent letters to the Communist Party claiming he was “a spy from the U.S. sent to demolish Chinese infrastructure.”\nBut things changed in 2012, when severe flooding in Beijing destroyed thousands of homes and killed 79 people, some of whom were caught off-guard in the street.\n“Every sort of paradigm shift, you need a crisis,” Yu said. “People dying in the street — that was the critical point.”\nThe floods prompted Chinese leader Xi Jinping to adopt Yu’s sponge city philosophy as a national agenda in 2015. Since then, the government has pledged more than $28 billion to help fund over 33,000 sponge city projects in 90 cities, aiming to have them capture and reuse at least 70% of their rainwater by 2030.\nBy 2020, over 40,000 sponge city projects were completed nationwide, contributing to around 3.8 trillion gallons of rainwater being recycled that year, according to the Ministry of Housing and Urban-Rural Development. The ministry noted that this amount was equal to about one-fifth of China’s annual urban water supply.\nMany, like Bangkok’s Benjakitti Park, are wetlands designed to address urban flooding. Others, like a mangrove forest built on the banks of a river in the tropical southern city of Sanya on Hainan Island, act as a natural buffer against saltwater intrusion and coastal erosion from rising sea levels.\n“The idea is to not build too close to the water in order to create a buffer zone,” Yu said. “Instead of building a wall, we allow the water to come in.”\nThis approach, said Yu, has made sponge city projects uncomplicated and low-cost compared with conventional solutions, deployable just about anywhere.\nBenjakitti Park, for example, cost $20 million and was built by the Thai army, which had little experience in environmental landscaping. Yu scribbled the design on a napkin during his flight to Bangkok to meet Chatchanin, keeping it simple enough to be achievable — at least in theory — with only a single excavator.\nStill, the program hasn’t been without challenges.\nWetlands are often breeding grounds for mosquitoes. And with local governments expected to foot up to 80% of the cost for their projects, much-needed investments from the private sector have been slow to materialize. Meanwhile, critics have pointed out that some of China’s most touted sponge cities, like Zhengzhou in Henan province, have still experienced devastating floods.\n“If a city can’t handle a flood, that means it’s not spongy enough,” Yu said.\n“Ultimately, it’s not about getting rid of every piece of concrete. It’s about combining gray and green — upgrading the current model.”\nSince 2006, Singapore has been turning its own waterways and reservoirs into public parks that also absorb stormwater, an initiative known as the Active, Beautiful, Clean Waters (ABC Waters) Programme.\nIn the Netherlands, a flood-prone country famous for mastering the art of keeping water out with techniques like land reclamation, the government has also experimented with a softer approach, strategically allowing its rivers to flood in certain areas in order to spare others.\nIn L.A., too, there has been a growing awareness that the area’s city’s own impermeable flood control system, which discards billions of gallons of rainwater that might otherwise be stored and reused, is overdue for change.\nWith around 490,000 acre-feet of stormwater available to be captured a year in an area that includes Long Beach and Anaheim, the L.A. area ranks first in the West in stormwater runoff potential and, 19th out of 2,645 urban areas nationwide, according to a Pacific Institute report last year.\nAmong the efforts to make the city spongier — and therefore less dependent on imported water — is the Safe Clean Water Program, which L.A. County voters approved in 2018 as ballot Measure W.\nThe program levies a property tax on impermeable surfaces to provide around $300 million a year in grants for municipal stormwater capture projects.\nThe aim of the program is to capture 98 billion gallons annually. Experts have said that projects like this in the upper L.A. watershed could simultaneously help prevent flooding downstream.\nYet officials have estimated that it will take decades to achieve this goal, and progress has been slow.\nJust 30 acres of green space were added to the county in its first three years, according to a report by Los Angeles Waterkeeper, a local watchdog.\nAnd although the program has recently begun to pick up pace, with around $1 billion allocated across 130 projects, Bruce Reznik, the group’s executive director and a member of the Measure W scoring committee, pointed out there are a host of challenges not present in China’s centralized model.\nAmong them are scant federal support and the slow, costly bureaucratic processes involved with the program, such as cleaning up contaminated project sites and getting permits. He estimated that the projects the county needs will cost around $50 billion, 10 times what Measure W funding can provide over the next 20 years.\n“In terms of expenses, that’s a question a lot of us are asking: Why are these projects so expensive?” Reznik said. “I get that there’s inflation, but man, projects we thought were going to be $10 million are now $25 million. I think we’ve got to figure out ways that we can streamline some of this stuff.”\nSpecial correspondents Chalida Ekvitthayavechnukul and Xin-yun Wu contributed reporting from Bangkok and Taipei, respectively."
    },
    {
      "url": "https://www.latimes.com/world-nation/story/2025-08-11/israeli-drone-strike-al-jazeera-journalist-anas-al-sharif-killed",
      "text": "Prominent Al Jazeera journalist among several killed in Israeli strike on Gaza press tent\n- Share via\n- Al Jazeera, which is funded by the government of Qatar, described the killings as a ‘targeted assassination’ and a ‘premeditated attack on press freedom.’\n- Israel’s military confirmed the strike, and referred to Al-Sharif as a ‘terrorist’ who ‘posed as a journalist.’\nAMMAN, Jordan — Israel’s military targeted a tent for journalists in Gaza City late Sunday, killing seven people, including Anas al-Sharif, a reporter for Al Jazeera who drew millions of followers on social media and emerged as a top voice in the Arab world for his chronicling of the war in Gaza over the last 22 months.\nKilled alongside the 28-year-old al-Sharif were Al Jazeera correspondent Mohammed Qreiqeh and camera operators Ibrahim Zaher, Moamen Aliwa and their assistant Mohammed Noufal. A seventh journalist, freelancer Mohammad al-Khaldi, who was in a nearby tent, was also killed, according to the Committee to Protect Journalists.\nIn a statement, Al Jazeera, which is funded by the government of Qatar and has long had a fraught relationship with the Israeli government, described the killings as a “targeted assassination” that was “yet another blatant and premeditated attack on press freedom.”\n“The order to assassinate Anas al-Sharif, one of Gaza’s bravest journalists, and his colleagues, is a desperate attempt to silence the voices exposing the impending seizure and occupation of Gaza,” the statement said, referring to the Israeli government’s recently approved plans for its military to take over the enclave.\nIsrael’s military has targeted and killed an Al Jazeera correspondent and others with an airstrike as they sheltered outside a Gaza City hospital\n“Al Jazeera emphasizes that immunity for perpetrators and the lack of accountability embolden Israel’s actions and encourage further oppression against witnesses to the truth,” the Al Jazeera statement said.\nQatari Prime Minister Sheikh Mohammed bin Abdulrahman Al-Thani also excoriated Israel in a statement on social media, saying in a statement on X that “the deliberate targeting of journalists by Israel in the Gaza Strip reveals how these crimes are beyond imagination.”\nIsrael’s military confirmed it conducted the attack, issuing a statement shortly before midnight Monday saying it struck “the terrorist Anas Al-Sharif” who it said “posed as a journalist” but “served as the head of a terrorist cell” in Hamas.\nIt claimed that “previously disclosed intelligence information” and “many documents found in the Gaza Strip” confirmed Al-Sharif’s involvement with Hamas. The documents, which the statement said included personnel rosters, lists of terrorist training courses, among others, “provide proof of the integration of the Hamas terrorist” within Al Jazeera.\nThe documents were first released in October 2024 and accused six Al Jazeera journalists of involvement with Hamas or the Islamic Jihad militant group.\nAt the time, Al Jazeera, a U.N. expert, the Committee to Protect Journalists and other groups cast doubt on the veracity of the documents. The U.N. special rapporteur on freedom of expression, Irene Khan, denounced Israel’s accusations against Al-Sharif in July as “unfounded” and a “blatant attempt to endanger his life and silence his reporting on the genocide in Gaza.”\nThe Israeli military has previously made unsubstantiated claims that journalists it targeted and killed in Gaza were terrorists. In March, Israel killed Al Jazeera correspondent Hossam Shabat; in July 2024, it killed Ismail Ghoul and his cameraman Rami al-Rifi.\nChief correspondent Wael al Dahdouh lost his wife, son, daughter and grandson in an Israeli airstrike in October 2023. Weeks after that, he was injured in a strike that killed Al Jazeera cameraman Samer Abu Daqqa.\nIsrael has barred international journalists from entering Gaza even as it has targeted local reporters. Health authorities in Gaza say 237 journalists have been killed since the war began on Oct. 7, 2023. The Committee to Protect Journalists says at least 186 have been killed.\nSunday’s drone attack came weeks after the Israeli military stepped up its attacks on Al-Sharif, with the Israeli military’s Arabic-language spokesman accusing the Al Jazeera correspondent in July of spreading “propaganda” and taking part in “a false Hamas campaign on starvation.”\nLater that month, the Committee to Protect Journalists said it was “gravely worried” about Al-Sharif’s safety. The group’s Middle East and North Africa director, Sara Qudah, warned that the smear campaign against Al-Sharif represented “an effort to manufacture consent to kill Al-Sharif.”\nIn a statement on Monday, Qudah said, “Israel is murdering the messengers.”\n“If Israel can kill the most prominent Gazan journalist, then it can kill anyone. The world needs to see these deadly attacks on journalists inside Gaza, as well as its censorship of journalists in Israel and the West Bank, for what they are: a deliberate and systematic attempt to cover up Israel’s actions.”\nThe Israeli prime minister, facing growing opposition at home and abroad, declares that Israel ‘has no choice but to finish the job and complete the defeat of Hamas’ in Gaza.\nBritish Prime Minister Keir Starmer said he was “gravely concerned” over the repeated targeting of journalists in Gaza; Human Rights Watch, Amnesty International, Reporters Without Borders and other groups also issued condemnations. The U.S. government did not immediately provide comment.\nAl-Sharif’s killing drew tributes for a journalist who for many across the region came to embody Gaza’s suffering.\nOn social media people shared poignant moments from his coverage, including when he covered his father’s killing in an Israeli airstrike in the Jabalia refugee camp in Gaza City in December 2023; a video when he was reunited with his daughter earlier this year; or when he almost broke down on air, his voice cracking.\n“Keep on going, Mr. Anas,” says an unseen passerby. “You are our voice.”\nVideo posted to social media showed crowds massing at the Sheikh Radwan Cemetery for the journalists’ funeral. Footage depicted mourners crying and embracing each other, while others in the crowd carried Al-Sharif’s shrouded corpse and chanted, “With our soul and blood, we will sacrifice ourselves for you, Anas.”\nAl-Sharif is survived by his wife, daughter and son.\nMinutes before the strike that killed him, Al-Sharif posted on X saying there was “intense, concentrated Israeli bombardment” on Gaza City for two hours.\nAl-Sharif’s final message, written in April to be posted in the event of his death, read: “If these words reach you, know that Israel has succeeded in killing me and silencing my voice.”\nHe continued: “I have lived through pain in all its details, tasted suffering and loss many times, yet I never once hesitated to convey the truth as it is, without distortion or falsification — so that Allah may bear witness against those who stayed silent, those who accepted our killing, those who choked our breath, and whose hearts were unmoved by the scattered remains of our children and women, doing nothing to stop the massacre that our people have faced for more than a year and a half.”"
    },
    {
      "url": "https://www.latimes.com/world-nation/story/2025-08-11/trump-expands-l-a-military-tactics-by-sending-national-guard-to-washington-d-c",
      "text": "Trump expands L.A. military tactics by sending National Guard to Washington, D.C.\n- Share via\nIn an expansion of tactics started in June during immigration raids in Los Angeles, President Trump on Monday announced he would take federal control of the city’s police department and activate 800 National Guard troops in Washington, D.C., to help “reestablish law and order.”\n“Our capital city has been overtaken by violent gangs and bloodthirsty criminals, roving mobs of wild youth, drugged-out maniacs and homeless people,” Trump said at the White House.\n“This is liberation day in D.C.,” he declared.\nTrump, who sent roughly 5,000 Marines and National Guard troops to L.A. in June in a move that was opposed by California Gov. Gavin Newsom and L.A. Mayor Karen Bass, issued an executive order declaring a public safety emergency in D.C. The order invoked Section 740 of the District of Columbia Home Rule Act that places the Metropolitan Police Department under direct federal control.\nCalifornia Gov. Newsom decried Trump’s move in D.C., warning that what happened in L.A. was now taking place across the country.\n“He was just getting warmed up in Los Angeles,” Newsom said on X. “He will gaslight his way into militarizing any city he wants in America. This is what dictators do.”\nCalifornia arrests lag behind states such as Texas and Florida, because those states started with more arrests. They also have a stronger record of cooperation.\nIn his briefing, Trump painted D.C. in dark, apocalyptic terms as a grimy hellhole “of crime, bloodshed, bedlam, squalor and worse.” He said he planned to get tough, citing his administration’s stringent enforcement on the nation’s southern border.\nAlready, Trump said, his administration has begun to remove homeless people from encampments across the city, and he said he planned to target undocumented immigrants, too. He vowed to “restore the city back to the gleaming capital that everybody wants it to be.”\nAlthough the president cited issues of violent crime in Washington — stating the city is “totally out of control” — data show violent crime has declined significantly in recent years.\nJust a few weeks before Trump took office, the Justice Department announced that violent crime in the city was at a 30-year low. Homicides were down 32%, robberies down 39% and armed carjackings down 53% when compared with 2023 levels, according to data collected by the Metropolitan Police Department.\nLocal D.C. officials pushed back against Trump’s characterization of the city.\n“There is no crime emergency in the District of Columbia,” read a statement from Brian Schwalb, the elected attorney general of the District of Columbia. He criticized the administration’s deployment of troops as “unprecedented, unnecessary and unlawful.”\nJeanine Pirro, United States Attorney for the District of Columbia, promised during Monday’s briefing to crack down on juvenile crime, or as she put it, “young punks” who she said were too often granted probation or other lenient sentences\nIn D.C., the U.S. Attorney’s office handles all adult felonies and the majority of adult misdemeanors, while Schwalb’s office exercises jurisdiction over crimes committed by juveniles and some adult misdemeanors.\nSince Schwalb took office in January 2023, the office has prosecuted so many juveniles at higher rates that the mayor has had to issue an emergency order creating more space at juvenile detention facilities, according to an office statement. Last year, the office prosecuted over 90% of homicide and attempted homicide cases, 88% of violent assault cases and 87% of car jacking cases, according to the statement.\nMayor Bowser did not immediately respond to Trump’s press briefing. But on Sunday, she told MSNBC’s “The Weekend” show “we are not experiencing a crime spike.” She said she had relayed that message to Trump repeatedly since he took office and her police department and agencies had cooperated with a task force Trump set up.\nOklahoma Mayor David Holt, who also president of the United States Conference of Mayors, condemned Trump’s move as a “takeover,” and said “local control is always best.”\nHolt noted that the Trump administration’s data — specifically, the FBI’s national crime rate report released last week — shows crime rates dropping in cities across the nation.\nPatrick Eddington, a senior fellow in homeland security at the Cato Institute, described Trump’s move as a “radical overreaction” and “yet another step towards the creation of a permanent American police state.”\nTrump said the deployment of troops in D.C. should serve as a warning to cities across the nation — including Los Angeles.\n“Hopefully L.A.’s watching,” Trump said as he berated Bass and Newsom for their handling of the firestorm that swept through the region in January, destroying thousands of homes.\n“The mayor’s incompetent and so is Gov. Newscum,” Trump said, renewing his criticism of local officials for not accelerating rebuilding and the permitting process after the disaster. “He’s got a good line of bull—, but that’s about it.”\nTrump’s announcement that he was deploying troops to D.C. comes two months after he sparked a major legal battle with California when he sent thousands of troops to Los Angeles. He argued they were necessary to combat what he described as “violent, insurrectionist mobs” as protests broke out in the city against federal immigration raids.\nBut the protests calmed relatively quickly and local officials said they were primarily kept in check by police. The National Guard troops and Marines wound up sparsely deployed in Los Angeles. Some protected federal buildings, but most remained at the Joint Forces Training Base in Los Alamitos.\nSome of the deployed personnel assisted federal agents as they conducted immigration enforcement operations, but military officials said the troops were restricted to security and crowd control and had no law enforcement authority. The National Guard played a role in both the convoy that descended on MacArthur Park and the raid of cannabis farms in Ventura and Santa Barbara counties.\nThe number of arrests of undocumented immigration in the Los Angeles area appears to have dropped significantly since June.\nIn June, U.S. District Judge Charles Breyer of San Francisco ruled that Trump broke the law when he mobilized thousands of California National Guard members against the state’s wishes.\nIn a 36-page U.S. District Court decision, Breyer wrote that Trump’s actions “were illegal — both exceeding the scope of his statutory authority and violating the 10th Amendment to the United States Constitution.” Breyer added that he was “troubled by the implication” inherent in the Trump administration’s argument that “protest against the federal government, a core civil liberty protected by the First Amendment, can justify a finding of rebellion.”\nBut the U.S. 9th Circuit Court of Appeals paused that court order, allowing the troops to remain in Los Angeles while the case plays out in federal court. The appellate court found the president had broad, though not “unreviewable,” authority to deploy the military in American cities.\nThat decision is set to be reviewed by a larger “en banc” panel of the appellate court. Meanwhile, California will continue to fight its case in Judge Breyer’s court in San Francisco.\nState officials say Guard troops under Trump’s command violated the Posse Comitatus Act, which bars federalized military from civilian law enforcement. A trial this week is likely to further muddy the waters for troops remaining in Los Angeles, as well as any deployed in D.C. to fight crime there.\nTimes Staff Writers Michael Wilner in Washington D.C. and Sonja Sharp in Los Angeles contributed to this report."
    }
  ],
  "argos_summary": "An Islamic court in Aceh, Indonesia, sentenced two men to 80 lashes each for engaging in homosexual acts, specifically hugging and kissing, after being caught by religious police. The trial was held behind closed doors, and the judges deemed the punishment lenient due to the men's status as outstanding students with no prior convictions. This case marks the fifth public caning for homosexuality in Aceh since the implementation of Islamic law, which allows such punishments for morality offenses.",
  "argos_id": "OP1EB5NT7"
}