{
  "url": "https://lifehacker.com/tech/its-about-to-get-harder-to-read-old-reddit-threads",
  "authorsByline": "Michelle Ehrhardt",
  "articleId": "6758e5b578a9452da280e246628500eb",
  "source": {
    "domain": "lifehacker.com",
    "paywall": false,
    "location": null
  },
  "imageUrl": "https://lifehacker.com/imagery/articles/01K2DDHY2ZDG3JZM4RX258XC9G/hero-image.fill.size_1200x675.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T22:00:29+00:00",
  "addDate": "2025-08-11T22:58:41.433719+00:00",
  "refreshDate": "2025-08-11T22:58:41.433720+00:00",
  "score": 1.0,
  "title": "It's About to Get Harder to Read Old Reddit Threads, and You Can Blame AI",
  "description": "Reddit will now block the Internet Archive from indexing most of the site, blaming AI companies for scraping Reddit archives to get around paying for training data.",
  "content": "With more and more AI showing up in Google searches as of late, I've been leaning extra hard on that one magic word that makes the internet work: Reddit. It's got its problems, but appending \"Reddit\" to a search is still the surest bet I have of getting an honest opinion from a real person, which is more than I can say for some other platforms. Unfortunately, it seems like the \"Reddit\" trick is about to get a lot less useful, and once again, you can blame AI for it.\n\nThe problem with any live forum is that information comes and goes as people delete old posts and new updates break older parts of the site. There used to be a way to get around this, but going forward, that loophole's getting closed.\n\nYes, Reddit is about to start blocking the Internet Archive. The site, run by a nonprofit dedicated to preserving the open internet, is host to the Wayback Machine, a popular way to browse internet pages that are no longer active, or have changed significantly since they first went up. Simply enter a URL in the Machine's search box, and you'll be able to browse captures of what that page used to look like, sometimes going as far back as the 1990s.\n\nIt's a useful way to see how a site has changed, or access information that's supposed to be long gone. In Reddit's case, you could use it to look at, say, a hotel review that's since been deleted. Sure, you might feel a bit awkward about reading a post that's been purposefully taken down, but because deleting all your threads when leaving the service is a common practice, the Wayback Machine is a great way to preserve useful content well into the future, and keep classic memes from becoming lost media.\n\nUnfortunately, while Reddit says it's not against the Wayback Machine in general, it's about to stop the Internet Archive from indexing anything but the Reddit homepage, which means the only archives it'll be able to keep going forward will be lists of what was popular on Reddit on a certain day. Individual subreddits and posts will be blocked.\n\nThat's not totally useless, say if you're an internet researcher, but it will make all future Reddit threads way more temporary in nature, and will definitely hurt casual web searches down the line. If I review a hotel now, and then delete my thread, users in a month or two won't be able to easily see it. On the bright side, existing archives shouldn't be affected by this block, at least unless Reddit asks the Internet Archive to take down existing captures. But as time passes, the lack of Reddit archives is only going to become a bigger issue.\n\nSo why is this happening? Basically, Reddit doesn't like AI companies scraping content from its site, at least without paying for it first.\n\n\"Internet Archive provides a service to the open web,\" Reddit spokesperson Tim Rathschmidt told the Verge, \"but we've been made aware of instances where AI companies violate platform policies, including ours, and scrape data from the Wayback Machine.\"\n\n\n\nEssentially, Reddit wants to tightly control which AI companies it works with (it's sued over this before), and has blocked most of them from crawling its site. However, with some then turning to scraping Reddit pages captured by the Internet Archive instead, the company is now going to crack down on those captures as well. Basically, we're paying the price for a few bad apples.\n\nRathschmidt told The Verge that limits on the Internet Archive will start \"ramping up\" today, although he wasn't entirely clear about how. I've reached out to Reddit for details, but for now, I did double check, and I'm still able to access archives that already exist, so at least Reddit hasn't gone nuclear yet.\n\nAs for any future posts, all might not be lost. The Verge also spoke to Wayback Machine director Mark Graham, who said that the Internet Archive has a \"longstanding relationship with Reddit,\" and that there are \"ongoing discussions about this matter.\"",
  "medium": "Article",
  "links": [
    "https://www.theverge.com/news/757538/reddit-internet-archive-wayback-machine-block-limit",
    "https://web.archive.org/web/20230601000000*/https://www.reddit.com/r/AskReddit/comments/2s36ge/what_if_everything_was_spiders/",
    "https://web.archive.org/",
    "https://mashable.com/article/reddit-openai-deal-what-it-means?test_uuid=003aGE6xTMbhuvdzpnH5X4Q&test_variant=b",
    "https://archive.org/",
    "https://lifehacker.com/tech/how-to-delete-your-reddit-account",
    "https://viterbischool.usc.edu/news/2025/02/a-platform-problem-hate-speech-and-bots-still-thriving-on-x/",
    "https://www.zdnet.com/article/reddit-sues-anthropic-for-scraping-its-users-content-without-consent/",
    "https://lifehacker.com/tech/dont-depend-on-reddit-for-search",
    "https://lifehacker.com/tech/google-is-adding-more-ai-to-search"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Reddit archives",
      "weight": 0.114870936
    },
    {
      "name": "Old Reddit Threads",
      "weight": 0.11319952
    },
    {
      "name": "Reddit pages",
      "weight": 0.111389585
    },
    {
      "name": "Reddit",
      "weight": 0.10756227
    },
    {
      "name": "Reddit spokesperson Tim Rathschmidt",
      "weight": 0.09741358
    },
    {
      "name": "Internet Archive",
      "weight": 0.090394616
    },
    {
      "name": "Wayback Machine",
      "weight": 0.0826088
    },
    {
      "name": "AI companies",
      "weight": 0.07933052
    },
    {
      "name": "Wayback Machine director Mark Graham",
      "weight": 0.07635014
    },
    {
      "name": "internet pages",
      "weight": 0.06845112
    }
  ],
  "topics": [
    {
      "name": "AI"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Technology News",
      "score": 0.8037109375
    },
    {
      "name": "/Online Communities/Social Networks",
      "score": 0.61669921875
    },
    {
      "name": "/Science/Computer Science/Machine Learning & Artificial Intelligence",
      "score": 0.6025390625
    }
  ],
  "sentiment": {
    "positive": 0.046581518,
    "negative": 0.6956295,
    "neutral": 0.25778902
  },
  "summary": "Reddit is set to block the Internet Archive, a nonprofit dedicated to preserving the open internet, from indexing anything but the Reddit homepage. This move is due to AI companies violating platform policies, which Reddit has previously blocked from crawling its site. The move will make future Reddit threads more temporary in nature and may impact casual web searches down the line. However, existing archives should not be affected by this block, unless Reddit requests the Internet Archives to remove existing captures. The company has also begun to crack down on AI companies using Reddit pages captured by the Internet archive instead.",
  "shortSummary": "Reddit is blocking the Internet Archive, citing AI-related censorship, making old Reddit threads less useful and potentially harmful to future web searches as part of efforts to control AI.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "21470c661e6e46e88b4394744d2b239a",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://mashable.com/article/reddit-openai-deal-what-it-means?test_uuid=003aGE6xTMbhuvdzpnH5X4Q&test_variant=b",
      "text": "Reddit's deal with OpenAI is confirmed. Here's what it means for your posts and comments.\nA few months back, reports emerged that Reddit had signed a $60 million deal with OpenAI to allow the ChatGPT creator to train its LLM using Reddit content. On Thursday, the deal was confirmed.\nIn a blog post shared by Reddit and OpenAI the companies unveiled the details of the agreement, which essentially sees the \"front page of the internet\" trading its content for access to AI tools and an advertising partnership.\n\"Keeping the internet open is crucial, and part of being open means Reddit content needs to be accessible to those fostering human learning and researching ways to build community, belonging, and empowerment online,\" reads the blog post. \"Reddit is a uniquely large and vibrant community that has long been an important space for conversation on the internet.\"\nBut what exactly does this mean for Reddit's users? How will your posts, comments, and images be affected by this new partnership?\nWhat does the OpenAI deal mean for your Reddit posts and comments?\nIn a nutshell, it means your content is being used to train ChatGPT.\n\"OpenAI will bring Reddit content to ChatGPT and new products, helping users discover and engage with Reddit communities,\" reads the core deal point outlined in the blog. \"To do so, OpenAI will access Reddit’s Data API, which provides real-time, structured, and unique content from Reddit. This will enable OpenAI’s AI tools to better understand and showcase Reddit content, especially on recent topics.\"\nThe part about Reddit's Data API is key. This means that along with everything you've posted on Reddit in the past, you can safely assume that anything you post going forwards will immediately become AI training material.\nCan Reddit users opt out?\nIf the thought of training an AI doesn't sit well with you, you can obviously decide not to post or comment on Reddit anymore. But what about all your old posts? Well, the honest answer lies in Reddit's User Agreement, which makes it clear exactly what rights you're giving up when you use the platform:\n\"When Your Content is created with or submitted to the Services, you grant us a worldwide, royalty-free, perpetual, irrevocable, non-exclusive, transferable, and sublicensable license to use, copy, modify, adapt, prepare derivative works of, distribute, store, perform, and display Your Content and any name, username, voice, or likeness provided in connection with Your Content in all media formats and channels now known or later developed anywhere in the world. This license includes the right for us to make Your Content available for syndication, broadcast, distribution, or publication by other companies, organizations, or individuals who partner with Reddit. You also agree that we may remove metadata associated with Your Content, and you irrevocably waive any claims and assertions of moral rights or attribution with respect to Your Content.\"\nBasically, when you post on Reddit, they can pretty much do what they want with it — including making your content \"available for syndication, broadcast, distribution, or publication by other companies, organizations, or individuals who partner with Reddit.\"\nAnd if you decide to delete your content at some point down the line? Mashable has reached out to Reddit to ask if deleted content can still be used to train OpenAI, and we will update this article when we receive a response.\nUPDATE: May. 17, 2024, 3:02 p.m. GMT Reddit confirmed to Mashable that it doesn't license deleted posts and comments — so it's possible that content deleted prior to the deal's completion may not be included. But given that OpenAI now has access to Reddit's API, it's probably safe to assume that anything newly posted is immediately being used to train its AI."
    },
    {
      "url": "https://www.theverge.com/news/757538/reddit-internet-archive-wayback-machine-block-limit",
      "text": "Reddit says that it has caught AI companies scraping its data from the Internet Archive’s Wayback Machine, so it’s going to start blocking the Internet Archive from indexing the vast majority of Reddit. The Wayback Machine will no longer be able to crawl post detail pages, comments, or profiles; instead, it will only be able to index the Reddit.com homepage, which effectively means Internet Archive will only be able to archive insights into which news headlines and posts were most popular on a given day.\nReddit will block the Internet Archive\nThe company says that AI companies have scraped data from the Wayback Machine, so it’s going to limit what the Wayback Machine can access.\n”Internet Archive provides a service to the open web, but we’ve been made aware of instances where AI companies violate platform policies, including ours, and scrape data from the Wayback Machine,” spokesperson Tim Rathschmidt tells The Verge.\nThe Internet Archive’s mission is to keep a digital archive of websites on the internet and “other cultural artifacts,” and the Wayback Machine is a tool you can use to look at pages as they appeared on certain dates, but Reddit believes not all of its content should be archived that way.“Until they’re able to defend their site and comply with platform policies (e.g., respecting user privacy, re: deleting removed content) we’re limiting some of their access to Reddit data to protect redditors,” Rathschmidt says.\nThe limits will start “ramping up” today, and Reddit says it reached out to the Internet Archive “in advance” to “inform them of the limits before they go into effect,” according to Rathschmidt. He says Reddit has also “raised concerns” about the ability of people to scrape content from the Internet Archive in the past.\nReddit has a recent history of cutting off access to scraper tools as AI companies have begun to use (and abuse) them en masse, but it’s willing to provide that data if companies pay. Last year, Reddit struck a deal with Google for both Google Search and AI training data early last year, and a few months later, it started blocking major search engines from crawling its data unless they pay. It also said its infamous API changes from 2023, which forced some third-party apps to shut down, leading to protests, were because those APIs were abused to train AI models.\nReddit also struck an AI deal with OpenAI, but it sued Anthropic in June, claiming Anthropic was still scraping from Reddit even after Anthropic said it wasn’t scraping anymore.\n“We have a longstanding relationship with Reddit and continue to have ongoing discussions about this matter,” Mark Graham, director of the Wayback Machine, says in a statement to The Verge.\nUpdate, August 11th: Added statement from the Wayback Machine.\nMost Popular\n- Reddit will block the Internet Archive\n- GitHub is no longer independent at Microsoft after CEO resignation\n- RFK Jr. wants a wearable on every American — that future’s not as healthy as he thinks\n- Ford reveals breakthrough process for lower priced EVs\n- Sex is getting scrubbed from the internet, but a billionaire can sell you AI nudes"
    },
    {
      "url": "https://lifehacker.com/tech/google-is-adding-more-ai-to-search",
      "text": "When Google rolled out AI Overviews for Search last year, it didn't go over so well. The company's AI made some pretty massive mistakes with its results, many of which went viral. In response, Google pulled back the feature, reworked it, and slowly reintroduced it to the masses. You've probably noticed.\nGoogle is continuing its work of adding AI to Search—whether you want it or not. Since March, the company has been testing something called AI Mode. See, Google says that they've heard from \"power users\" that they are looking for AI responses from more of their Google searches. In response, AI Mode lets you ask the AI multi-part questions that offers more advanced reasoning, thinking, and multimodal (combination of text, images, and video) functions.\nOn paper, it sounds like a more complex AI Overview, but it's a bit more nuanced than that. AI Mode is its own tab in Search, that turns the UI into more of what you'd expect from ChatGPT or Gemini. Google says this experience is supposed to combine what would've taken multiple searches into one: You ask the AI something complicated, it reasons through it (showing its thinking along the way) and delivers a full answer with multiple results, claims, and summaries—citing its sources for each of its generations.\nGoogle says AI Mode uses a “query fan-out” technique to generate its results. Essentially, it searches for multiple related things at the same time, combining those results together into the response you see at the end. AI Mode pulls from many different data points for its results, including web results, Google's Knowledge Graph, and shopping data.\nGoogle uses the following query to demonstrate this approach: “What's the difference in sleep tracking features between a smart ring, smartwatch and tracking mat?\" AI Mode supposedly takes that multi-part question, develops a multi-step \"plan\" to conduct a number of searches to find the information, and changes that plan according to the results it returns.\nNew features coming to AI Mode in the future\nAside from rolling out the feature to all users, Google had some more AI Mode news to share at I/O. Most of the announcements are for features planned for the near future, but here's what you can expect from AI Mode down the line.\nFirst, AI Mode is getting Gemini 2.5, Google's \"most intelligent model,\" this week. Whether that's today or sometime this weekend, remains to be seen, but it'll be interesting to see how Gemini 2.5 affects AI Mode's performance—at least, as long as you've been using it with Gemini 2.0.\nThen, there's Deep Search—similar to, but not quite the same as Deep Research. Deep Search takes the AI Mode model and dives deeper, running potentially hundreds of searches on your queries. Like Deep Research, Deep Search can generate a report for you based on its findings. (Google says this can be done in \"just minutes.\") AI Mode will be able to generate graphs and charts, as well, if it makes sense for the query.\nGoogle is also adding agentic capabilities to AI Mode. \"Agentic\" is the current AI buzzword floating around these days, which basically covers any task the AI performs on your behalf. As such, agentic AI is a goal for many companies looking to turn AI assistants into real assistants. Whether or not you'll actually find these tools helpful is another thing altogether, but you can expect some agentic AI tools in AI Mode in the coming months. For example, you may be able to ask AI Mode to find you affordable tickets to a particular baseball game on a specific night, and not only will it pull up the links for you, it'll fill out all the necessary forms as well, so, in theory, you only need to confirm your purchase.\nAI Mode will offer shopping features later this year, as well. Google says a shopping request will return a \"Shopping Graph,\" which can pull from more than 50 billion product listings, in the hopes of showing you products relevant to your requests. If it's an article of clothing, Google will let you try it on virtually.\nAI Mode will also be able to pull from your past searches, as well as your Google apps (starting with Gmail), if you opt-in. The idea is to show you more relevant results based on what you've done in the past and what you like.\nHow to try AI Mode\nAI Mode is no longer just an experimental feature for Google Labs users: Following Google I/O 2025, AI Mode is rolling out to everyone in the U.S. As such, the next time you go to Google's homepage, or open the Google app on your phone, you may see the new \"AI Mode\" tab on the right side of the search bar. (Some users saw AI Mode replace the \"I'm Feeling Lucky\" button, but hopefully that was a now-completed experiment on Google's part.)\nTo use AI Mode, just click the button. Google will offer suggested prompts, but you can type out any query you have. You can enter the same types of searches you normally would, but give a multi-part question a try. (Google's promotional materials encourage you to ask \"10 questions in one.\")\nIf you've ever used a chatbot's web search, whether that be Google's Gemini or ChatGPT, this will be a familiar experience. Answers are broken down into sections, with the usual AI bullet points and links to individual sources. You may also get some interactive elements: If you've asked about a specific location, for example, you may see an in-line Google Maps window."
    },
    {
      "url": "https://www.zdnet.com/article/reddit-sues-anthropic-for-scraping-its-users-content-without-consent/",
      "text": "Reddit sues Anthropic for scraping its users' content without consent\nThe list of lawsuits against AI companies is growing: Reddit has joined in with a suit against Anthropic.\nOn Wednesday, the company filed a complaint in California stating that Anthropic -- developer of Claude -- ignores Robots Exclusion Protocol (REP), or robots.txt, which blocks AI crawlers from scraping a site's content. Research indicates that other AI companies are also engaging in this practice: In March, Columbia's Tow Center found that multiple chatbots, including Perplexity, could still retrieve articles from publishers that had blocked their crawlers using REP.\nAlso: Anthropic's popular Claude Code AI tool now included in its $20/month Pro plan\nThe complaint states that \"Anthropic is in fact intentionally trained on the personal data of Reddit users without ever requesting their consent,\" which is a violation of Reddit's user privacy agreement. In July 2024, when Reddit publicly criticized Anthropic for misusing its content, the complaint continues, \"Anthropic's bots continued to hit Reddit's servers over 100,000 times\" despite insisting that it had stopped its bots from crawling the site.\nThe lawsuit is the latest in the ongoing clash between sites that create and host content -- including publishers, news organizations, and user forums like Reddit -- and the AI companies that scrape that content to use as training data. In late 2023, The New York Times became the first publisher to sue OpenAI and Microsoft for using its content to train its models without permission or payment. In April, Ziff Davis, the parent company of this publication, sued OpenAI for copyright violation, citing similar instances of the AI company crawling Ziff Davis sites despite being blocked. Authors and creatives have also sued OpenAI and Meta on similar grounds.\nWhat sets Reddit apart here is that it is also a tech company, unlike the publishers behind the lawsuits that predate this one. Reddit has licensing agreements with OpenAI and Google.\nAlso: Reddit's new Google-powered AI search tool makes finding answers faster than ever\nOther publishers, including Dotdash Meredith, Financial Times, and the AP, have taken a different approach, proactively entering into licensing agreements with AI companies that allow them to access some or all of their content in exchange for internal AI tools and preferential citation placements in chatbot responses. However, research shows that chatbots still struggle to accurately cite and favor stories from publishers, meaning it is still unclear whether those benefits are being realized.\nWant more stories about AI? Sign up for Innovation, our weekly newsletter."
    },
    {
      "url": "https://lifehacker.com/tech/dont-depend-on-reddit-for-search",
      "text": "It's one of those tech hacks that's been around a long time: Add \"reddit\" to the end of your Google search queries, the theory goes, and you'll get some actually useful information from real people, rather than SEO-optimized spam sites looking for your clicks. It's a trick that works, a lot of the time, depending on what you're looking for.\nNow Reddit is starting to push its credentials as a search engine, making use of the \"breadth of conversations and knowledge\" on the platform to position itself as a genuine alternative to Google. We already have Reddit Answers, which lets you type in a query and get the opinions of Reddit back in summarized form, and there's apparently more to come.\nBut while the Reddit tweak may be handy for some Google searches, is it a substitute for Google? I'd argue that while there's undoubtedly a wealth of useful information on Reddit, and a lot of value in the platform as a whole, it's not the best idea to use it as a default search engine.\nThere's no guarantee of expertise\nMaybe you're heading to Reddit to find out how to fix a broken keyboard. For queries like this, you'll come across a pile of relevant posts. However, quantity doesn't necessarily mean quality, and there's no guarantee that what you're reading can be trusted.\nYes, you have the upvote and downvote system, which is helpful in assessing the quality of comments, and the associated karma system. Nevertheless, even with these signals, it doesn't necessarily mean you can always rely on the instructions, advice, and takes that appear on Reddit. For much of the time you're going to be putting your trust in someone you don't know anything about.\nAdd in the AI slop that is appearing on Reddit (as well as everywhere else on the internet), and it's not always easy to pick out the good stuff from the bad stuff. Compare and contrast these with articles that take you through topics step-by-step, written by authors with real names and photos attached, and put together with proper editorial oversight, and it's not hard to see where Reddit comes up short.\nReddit is limited to Redditors\nNo offense to the good people of Reddit, but they only represent a subsection of humanity—a rather significant subsection, admittedly, with around 110 million people checking the site every day, but still only a fraction of the people who are connected to the web and who might be able to help you with your search queries.\nLimit your searches to Reddit, and you're limiting yourself to posts from Redditors who are actually active in terms of contributions, and who have actually noticed the threads you're checking. What if the Redditors who know most about attracting birds to your garden have ignored or missed the conversation about attracting birds to your garden?\nIn terms of the stats, Reddit users tend to be younger, male, and from the U.S., and that means there are going to be certain biases in terms of the posts than come up when you search the platform. It's not quite like searching the web at large, which has certain biases of its own, but is open to everyone.\nDon't discount all the information and advice you can get from everyone who has never logged into Reddit—whether you're looking for travel guides from locals or wondering in which order to watch Bond films.\nYou've got better options\nGoogle is far from perfect, but it can still surface useful and informative resources a lot of the time—especially if you know some of the secrets to using it as effectively as possible. Remember you can use the \"site:\" operator to limit results to one domain, add a \"+\" (plus) in front of words that must be matched, and a \"-\" (minus) next to words that should be excluded from results (which can help filter out some of the rubbish).\nThere's also the advanced search page on Google, which lets you limit results by language, region, or time (helping you avoid out-of-date information). The best approach is going to vary depending on what it is you're searching for, but Google still offers the most comprehensive and powerful search out there.\nAnother good idea is to seek out and follow sources you trust, whether that's on the web, on social media, or on platforms like YouTube. Over time, you should be able to figure out who you should be giving your attention to—and again these sources of information should be more reliable than random Reddit accounts.\nHowever you do your searching, do it with a bit of caution and common sense. That obviously applies to AI searches, too: They're susceptible to hallucinations, and you need to double-check the websites they're pulling their knowledge from, but the way these AI tools are able to aggregate and present information from multiple sources can come in handy in certain search scenarios."
    },
    {
      "url": "https://lifehacker.com/tech/how-to-delete-your-reddit-account",
      "text": "Reddit is feeding all user comments and posts into Google’s virtual wood chipper, meaning the reconstituted goop of your conversations is going to be spat out by Google's AI language models. The move, as reported by Reuters, is worth $60 million a year for the social network.\nYou might, after reading this, want to delete your Reddit account and everything on it. Reddit, after all, isn't much fun anymore—and not just because they killed off \"reddit is fun\" last year when they killed off all the good Reddit clients. The truth is that the older Reddit gets the less vital it feels, in part because last year the company seemed outright hostile to the moderators and posters who power the site. The company's upcoming IPO, if the history of other social networks is anything to go by, probably isn't going to make matters any better.\nBut deleting your Reddit account isn't enough. Follow the official documentation and every post and comment you make will stay on the site—it's just disassociated from your account. You might want all of your posts gone, forever, to avoid them being regurgitated by any large language models masquerading as general purpose AI. You also might want your own, personal backup of your posts. Here's how to get that backup, delete your posts, and finally delete your account for good.\nBack up your posts\nYou probably don't want to lose all of the comments and posts you've made over the years. Reddit allows you to request your Reddit data—go through the process and you'll get ZIP file full of CSV files that include all of your comments, posts, upvotes, and more.\nTo get started, log into Reddit and head to the data request page. You'll be asked what kind of a request it is—if you're in the EU or California, you can use those respective laws and Reddit will have to send you the information. If not, Reddit offers an \"Other\" field, which still works. Specify which dates you want or ask for all of your data, then click Submit.\nYou'll get a note saying that your data is on its way and that you'll get a Reddit DM when the data is ready. I only had to wait a couple hours for my information. The archive comes as a ZIP file full of CSV files, which you can open using something like Microsoft Excel. Blogger Daniel Rosehill has a great blog post that outlines what's in the file, if you want details.\nDelete all posts and comments\nNow that you've backed up your comments and posts, it's time to delete them. The bad news: Reddit doesn't offer a way to bulk delete your comments and posts. They suggest simply heading to your profile page, clicking the three dots to the right of such posts, then clicking Delete for every single one.\nThat's fine if you only have a couple posts, but longtime Reddit users likely have a lot more. There are a variety of tools out there that can bulk delete old posts. The best one I found is Reddit Nuker, a Chrome extension that has two buttons: Delete Posts and Delete Comments. Click either while you're logged into Reddit and the extension will do the work for you.\nNote that, due to API limitation, this extension can only delete 100 comments or posts at a time. The extension will take a one-minute break after it hits this limit, after which you can click the button again to continue. It's a little annoying—especially if you have thousands of posts—but believe me: it's way less annoying than deleting everything one by one.\nIf that's not automated enough, there's another Chrome extension, Bulk Delete Reddit Posts, that can delete 50 posts and 50 comments per day for free. More than that costs $9.99, one-time, but it doesn't make you play the same waiting game as Reddit Nuker. Both tools are well reviewed, so it's really up to you.\nDelete your Reddit account\nNow that you've backed up your comments and posts and removed them from Reddit, it's time to delete your account. Head to account settings and scroll down to the bottom. You'll find the Delete account button.\nYou'll be asked why you're leaving Reddit—you can respond or not respond (I recommend using AI to generate a long essay, just for the irony, but I'm a huge jerk). You'll need to enter your username and password, check a box to indicate you know your data can't be recovered, and that's it: you can click the Delete button and your account will be completely gone. You're free."
    }
  ],
  "argos_summary": "Reddit is set to block the Internet Archive from indexing most of its content, limiting access to only the homepage, due to concerns over AI companies scraping data from the Wayback Machine. This change will hinder the ability to view deleted posts and discussions, making Reddit's content more ephemeral. Additionally, Reddit has confirmed a $60 million deal with OpenAI, allowing the AI company to use Reddit content for training its models, raising privacy concerns among users regarding the future use of their posts.",
  "argos_id": "OW4ZW9US2"
}