{
  "url": "https://www.forbes.com/sites/karadennison/2025/08/11/the-impact-on-organizations-post-trumps-dei-executive-orders/",
  "authorsByline": "SPHR, EC, CPRW, Kara Dennison",
  "articleId": "306009742b3744b29030eb34eddb3f26",
  "source": {
    "domain": "forbes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NJ",
      "county": "Hudson County",
      "city": "Jersey City",
      "coordinates": {
        "lat": 40.7215682,
        "lon": -74.047455
      }
    }
  },
  "imageUrl": "https://imageio.forbes.com/specials-images/imageserve/689a2814901e99b1bb361b14/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T17:30:30+00:00",
  "addDate": "2025-08-11T20:08:59.874392+00:00",
  "refreshDate": "2025-08-11T20:08:59.874394+00:00",
  "score": 1.0,
  "title": "The Impact On Organizations Post Trump’s DEI Executive Orders",
  "description": "A major change in U.S. policy is forcing many organizations to rethink their commitment to diversity, equity, and inclusion.",
  "content": "A major change in U.S. policy is forcing many organizations to rethink their commitment to diversity, equity, and inclusion. In January this year, President Donald Trump signed that formally reversed federal DEI mandates. These orders directed agencies to dismantle internal DEI offices, eliminate DEI training programs, and withdraw equity-focused funding, calling such efforts “discriminatory” and “ideologically driven.”\n\nFor over a decade, DEI has influenced the way teams are built, people are supported, and communities are included in decision-making. It drove innovation, improved team performance, and helped people from overlooked backgrounds feel seen, heard, and included.\n\nTrump’s new orders push back against DEI, replacing it with ‘merit-based’ hiring, raising concern about what’s lost in the process. The shift left many teams unsure of how to move forward, especially those who’ve built their culture around inclusion. Organizations are reassessing policies, directing legal and cultural shifts, and working to preserve inclusive values even as federal priorities move in a different direction.\n\nThe Executive Orders Behind the Disruption\n\nTrump's move to dismantle DEI efforts began with two executive orders signed within days of taking office, setting off immediate ripple effects across federal agencies and beyond. These orders marked an , affecting not just government operations but also private contractors who rely on government partnerships.\n\nExecutive Order 14151, titled \"Ending Radical and Wasteful Government DEI Programs and Preferencing,\" directed the termination of what it calls \"discriminatory programs\" going by the name of diversity, equity, and inclusion. The order instructed agencies to shut down DEI offices, cancel equity-centered grants and contracts, and eliminate DEI performance requirements for employees, contractors, and grantees. Federal agencies were given broad mandates to dismantle these programs \"to the maximum extent allowed by law.\"\n\nExecutive Order 14173, \"Ending Illegal Discrimination and Restoring Merit-Based Opportunity,\" took a different approach by revoking several prior orders focused on equal employment opportunity and workplace diversity. This order directed agency heads to submit reports by May 20, 2025, identifying \"the most egregious and discriminatory DEI practitioners\" in their sectors and outlining specific steps to deter DEI programs that might constitute illegal discrimination.\n\nA third order, Executive Order 14281, signed in April, aimed to \"eliminate the use of disparate impact liability in all contexts to the maximum degree possible.\" This targets a legal theory that holds employers liable for policies that disproportionately affect protected groups, even without intentional discrimination.\n\nThe administration frames these changes as a return to \"merit-based\" hiring, arguing that identity-focused practices are discriminatory and unlawful. However, the orders don't define \"illegal DEI,\" creating uncertainty for organizations trying to understand what's permissible. This ambiguity has prompted many companies to scale back or completely eliminate their DEI programs, even as legal challenges to the orders work their way through the courts.\n\nThe effects of Trump's executive orders are moving beyond policy changes into measurable workplace outcomes. , of 965 U.S. companies with active DEI programs before November 2024, reveals the tangible consequences organizations are facing.\n\nThe numbers show immediate shifts in hiring and retention patterns. One in five companies has eliminated DEI initiatives entirely, with 74% citing the changed political climate as their primary reason. Among companies that cut programs, 57% report hiring fewer people from underrepresented groups. The decline is particularly pronounced for women of color (37% decrease), LGBTQIA+ candidates (33% decrease), and men of color (33% decrease). By comparison, only 12% reported decreased hiring of white men.\n\nThe workplace culture impacts are equally significant. Nearly half of the companies that reduced DEI efforts report declining employee morale, while 36% struggle with retention of diverse talent. Leadership representation has also shifted, with 30% noting fewer people of color in leadership roles and 24% reporting fewer women in leadership positions.\n\nPerhaps most concerning, 18% of organizations report increased incidents of workplace discrimination or bias following DEI program cuts. 25% acknowledge reputational damage, suggesting the changes extend beyond internal operations to external perceptions.\n\nThe survey reveals divided opinions among business leaders about these changes. Some view DEI elimination as removing divisive elements, with one respondent noting it \"restored a sense of fairness.\" Others express disappointment, with leaders describing the loss of \"safe spaces\" and being worried about being \"worse off as a company.\"\n\nThese patterns suggest the executive orders have created a ripple effect that extends across public agencies, private companies, nonprofits, and educational institutions. The changes are reshaping not just policies but fundamental aspects of how organizations attract talent, build leadership, and maintain workplace culture.\n\nHow the Changes are Impacting Organizations and Workplaces\n\nThe executive orders affect government agencies, federal contractors, private companies with federal funding, nonprofits, and educational institutions tied to federal grants. Even organizations without direct contracts are experiencing ripple effects as partners and industry peers adjust policies to comply.\n\nOrganizations that eliminated DEI programs report Employees who valued these initiatives feel abandoned, making them more likely to seek opportunities elsewhere. Recruitment has become more challenging, particularly with younger workers, while unclear communication about policy changes has damaged internal trust.\n\n, especially women, black professionals, and other underrepresented groups who prioritize inclusive workplaces. Hiring for these groups has slowed, and fewer younger candidates are applying. Internally, trust has weakened, opportunities feel less equitable, and problem-solving has suffered due to reduced diverse perspectives.\n\nWithout DEI initiatives, companies struggle to attract diverse talent. Skilled candidates who value inclusion often bypass employers that don't demonstrate clear commitment to equity, intensifying competition for talent in an already tight market.\n\nStepping away from DEI can damage both public perception and internal culture. Externally, organizations may appear out of touch, hurting brand image and stakeholder trust. Internally, the absence of DEI structures can allow bias or discrimination to go unchecked, weakening morale and creating unsafe work environments.\n\nSome companies, like have scaled back DEI programs amid political pressures. Others, including Costco, Apple, and Microsoft, maintain their inclusion commitments. Cutting DEI risks backlash from progressive employees, investors, and customers, while maintaining programs may provoke conservative opposition. Organizations must navigate these competing pressures, particularly as black consumers' buying power is projected to nearly double by 2030, underscoring the business case for inclusion.\n\nThe Trump administration's executive orders have created significant uncertainty for organizations across all sectors. Federal agencies are intensifying enforcement of civil rights laws, potentially creating legal risks for companies that maintain DEI programs. This has left businesses facing a difficult decision. Some are dismantling programs to avoid potential scrutiny, while others are maintaining their diversity commitments despite the political shift.\n\nOrganizations don't have to navigate these changes blindly. Clear, honest communication with employees and stakeholders helps maintain trust during this transition period. Companies should continue focusing on essential practices like fair hiring, equitable career development, and respectful workplace policies, regardless of what these efforts are called. Legal reviews of existing programs can help identify potential compliance issues while preserving inclusive practices.\n\nThe key is balancing political realities with organizational values and goals. Companies that stay committed to inclusion, even if they rebrand their approach, can continue attracting diverse talent and driving innovation. Those that abandon these efforts entirely risk losing valuable employees and damaging relationships with customers and stakeholders who value diversity.\n\nSuccess requires both flexibility and strategic thinking. Organizations that communicate transparently, review their policies carefully, and maintain inclusive cultures will be better positioned to weather this period of change while keeping the benefits of diverse, engaged teams.",
  "medium": "Article",
  "links": [
    "https://www.resume.org/6-in-10-companies-that-eliminated-dei-since-trumps-reelection-are-hiring-fewer-diverse-employees/",
    "https://www.aalrr.com/Labor-Employment-Law-Blog/president-trumps-executive-orders-on-dei",
    "https://diversity.com/post/corporate-dei-under-fire-trump-executive-order#:~:text=Challenges%20in%20Employee,within%20their%20organizations.",
    "https://www.hrgrapevine.com/us/content/article/2025-01-23-analyzing-the-impact-on-workplaces-morale-business-strategy#:~:text=Risk%20of%20consumer,not%20so%20prevalent.",
    "https://www.whitehouse.gov/presidential-actions/2025/01/ending-illegal-discrimination-and-restoring-merit-based-opportunity/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "DEI programs",
      "weight": 0.095433645
    },
    {
      "name": "DEI training programs",
      "weight": 0.08926372
    },
    {
      "name": "active DEI programs",
      "weight": 0.08913093
    },
    {
      "name": "DEI program cuts",
      "weight": 0.08868269
    },
    {
      "name": "DEI efforts",
      "weight": 0.08227209
    },
    {
      "name": "DEI offices",
      "weight": 0.07983027
    },
    {
      "name": "DEI initiatives",
      "weight": 0.07968689
    },
    {
      "name": "federal DEI mandates",
      "weight": 0.07962494
    },
    {
      "name": "illegal DEI",
      "weight": 0.07932504
    },
    {
      "name": "DEI",
      "weight": 0.07919281
    }
  ],
  "topics": [
    {
      "name": "US Politics"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.89208984375
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.81982421875
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.51904296875
    },
    {
      "name": "/Business & Industrial/Business Operations/Human Resources",
      "score": 0.35205078125
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Other",
      "score": 0.34912109375
    }
  ],
  "sentiment": {
    "positive": 0.052316885,
    "negative": 0.69930893,
    "neutral": 0.24837416
  },
  "summary": "The impact of President Donald Trump's Executive Orders on diversity, equity, and inclusion (DEI) has been significantly impacted by the elimination of federal DEI mandates, which have led many organizations to rethink their commitment to diversity and equity. The orders were signed by the president in January this year and directed agencies to dismantle internal DEI offices, eliminate DEI training programs, and withdraw equity-focused funding. The changes have led to uncertainty in many organizations, including those who have built their cultures around inclusion. The administration's executive orders have led them to replace DEI with'merit-based' hiring, which they argue is discriminatory and unlawful. The effects of these executive orders can be traced back to the workplace, with one in five companies eliminating DEI initiatives and 57% reporting hiring fewer people from underrepresented groups. The decrease in DEI efforts has led to decreased employee morale and decreased retention of diverse talent, with 18% of organizations reporting increased workplace discrimination following the cuts.",
  "shortSummary": "President Donald Trump's executive orders have led to significant changes in diversity, equity, and inclusion (DEI) programs, causing significant workplace changes and job losses.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "8cfbe3ae8cb548d78255553d12154ae6",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.whitehouse.gov/presidential-actions/2025/01/ending-illegal-discrimination-and-restoring-merit-based-opportunity/",
      "text": "By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:\nSection 1. Purpose. Longstanding Federal civil-rights laws protect individual Americans from discrimination based on race, color, religion, sex, or national origin. These civil-rights protections serve as a bedrock supporting equality of opportunity for all Americans. As President, I have a solemn duty to ensure that these laws are enforced for the benefit of all Americans.\nYet today, roughly 60 years after the passage of the Civil Rights Act of 1964, critical and influential institutions of American society, including the Federal Government, major corporations, financial institutions, the medical industry, large commercial airlines, law enforcement agencies, and institutions of higher education have adopted and actively use dangerous, demeaning, and immoral race- and sex-based preferences under the guise of so-called “diversity, equity, and inclusion” (DEI) or “diversity, equity, inclusion, and accessibility” (DEIA) that can violate the civil-rights laws of this Nation.\nIllegal DEI and DEIA policies not only violate the text and spirit of our longstanding Federal civil-rights laws, they also undermine our national unity, as they deny, discredit, and undermine the traditional American values of hard work, excellence, and individual achievement in favor of an unlawful, corrosive, and pernicious identity-based spoils system. Hardworking Americans who deserve a shot at the American Dream should not be stigmatized, demeaned, or shut out of opportunities because of their race or sex.\nThese illegal DEI and DEIA policies also threaten the safety of American men, women, and children across the Nation by diminishing the importance of individual merit, aptitude, hard work, and determination when selecting people for jobs and services in key sectors of American society, including all levels of government, and the medical, aviation, and law-enforcement communities. Yet in case after tragic case, the American people have witnessed first-hand the disastrous consequences of illegal, pernicious discrimination that has prioritized how people were born instead of what they were capable of doing.\nThe Federal Government is charged with enforcing our civil-rights laws. The purpose of this order is to ensure that it does so by ending illegal preferences and discrimination.\nSec. 2. Policy. It is the policy of the United States to protect the civil rights of all Americans and to promote individual initiative, excellence, and hard work. I therefore order all executive departments and agencies (agencies) to terminate all discriminatory and illegal preferences, mandates, policies, programs, activities, guidance, regulations, enforcement actions, consent orders, and requirements. I further order all agencies to enforce our longstanding civil-rights laws and to combat illegal private-sector DEI preferences, mandates, policies, programs, and activities.\nSec. 3. Terminating Illegal Discrimination in the Federal Government. (a) The following executive actions are hereby revoked:\n(i) Executive Order 12898 of February 11, 1994 (Federal Actions to Address Environmental Justice in Minority Populations and Low-Income Populations);\n(ii) Executive Order 13583 of August 18, 2011 (Establishing a Coordinated Government-wide Initiative to Promote Diversity and Inclusion in the Federal Workforce);\n(iii) Executive Order 13672 of July 21, 2014 (Further Amendments to Executive Order 11478, Equal Employment Opportunity in the Federal Government, and Executive Order 11246, Equal Employment Opportunity); and\n(iv) The Presidential Memorandum of October 5, 2016 (Promoting Diversity and Inclusion in the National Security Workforce).\n(b) The Federal contracting process shall be streamlined to enhance speed and efficiency, reduce costs, and require Federal contractors and subcontractors to comply with our civil-rights laws. Accordingly:\n(i) Executive Order 11246 of September 24, 1965 (Equal Employment Opportunity), is hereby revoked. For 90 days from the date of this order, Federal contractors may continue to comply with the regulatory scheme in effect on January 20, 2025.\n(ii) The Office of Federal Contract Compliance Programs within the Department of Labor shall immediately cease:\n(A) Promoting “diversity”;\n(B) Holding Federal contractors and subcontractors responsible for taking “affirmative action”; and\n(C) Allowing or encouraging Federal contractors and subcontractors to engage in workforce balancing based on race, color, sex, sexual preference, religion, or national origin.\n(iii) In accordance with Executive Order 13279 of December 12, 2002 (Equal Protection of the Laws for Faith-Based and Community Organizations), the employment, procurement, and contracting practices of Federal contractors and subcontractors shall not consider race, color, sex, sexual preference, religion, or national origin in ways that violate the Nation’s civil rights laws.\n(iv) The head of each agency shall include in every contract or grant award:\n(A) A term requiring the contractual counterparty or grant recipient to agree that its compliance in all respects with all applicable Federal anti-discrimination laws is material to the government’s payment decisions for purposes of section 3729(b)(4) of title 31, United States Code; and\n(B) A term requiring such counterparty or recipient to certify that it does not operate any programs promoting DEI that violate any applicable Federal anti-discrimination laws.\n(c) The Director of the Office of Management and Budget (OMB), with the assistance of the Attorney General as requested, shall:\n(i) Review and revise, as appropriate, all Government-wide processes, directives, and guidance;\n(ii) Excise references to DEI and DEIA principles, under whatever name they may appear, from Federal acquisition, contracting, grants, and financial assistance procedures to streamline those procedures, improve speed and efficiency, lower costs, and comply with civil-rights laws; and\n(iii) Terminate all “diversity,” “equity,” “equitable decision-making,” “equitable deployment of financial and technical assistance,” “advancing equity,” and like mandates, requirements, programs, or activities, as appropriate.\nSec. 4. Encouraging the Private Sector to End Illegal DEI Discrimination and Preferences. (a) The heads of all agencies, with the assistance of the Attorney General, shall take all appropriate action with respect to the operations of their agencies to advance in the private sector the policy of individual initiative, excellence, and hard work identified in section 2 of this order.\n(b) To further inform and advise me so that my Administration may formulate appropriate and effective civil-rights policy, the Attorney General, within 120 days of this order, in consultation with the heads of relevant agencies and in coordination with the Director of OMB, shall submit a report to the Assistant to the President for Domestic Policy containing recommendations for enforcing Federal civil-rights laws and taking other appropriate measures to encourage the private sector to end illegal discrimination and preferences, including DEI. The report shall contain a proposed strategic enforcement plan identifying:\n(i) Key sectors of concern within each agency’s jurisdiction;\n(ii) The most egregious and discriminatory DEI practitioners in each sector of concern;\n(iii) A plan of specific steps or measures to deter DEI programs or principles (whether specifically denominated “DEI” or otherwise) that constitute illegal discrimination or preferences. As a part of this plan, each agency shall identify up to nine potential civil compliance investigations of publicly traded corporations, large non-profit corporations or associations, foundations with assets of 500 million dollars or more, State and local bar and medical associations, and institutions of higher education with endowments over 1 billion dollars;\n(iv) Other strategies to encourage the private sector to end illegal DEI discrimination and preferences and comply with all Federal civil-rights laws;\n(v) Litigation that would be potentially appropriate for Federal lawsuits, intervention, or statements of interest; and\n(vi) Potential regulatory action and sub-regulatory guidance.\nSec. 5. Other Actions. Within 120 days of this order, the Attorney General and the Secretary of Education shall jointly issue guidance to all State and local educational agencies that receive Federal funds, as well as all institutions of higher education that receive Federal grants or participate in the Federal student loan assistance program under Title IV of the Higher Education Act, 20 U.S.C. 1070 et seq., regarding the measures and practices required to comply with Students for Fair Admissions, Inc. v. President and Fellows of Harvard College, 600 U.S. 181 (2023).\nSec. 6. Severability. If any provision of this order, or the application of any provision to any person or circumstance, is held to be invalid, the remainder of this order and the application of its provisions to any other persons or circumstances shall not be affected thereby.\nSec. 7. Scope. (a) This order does not apply to lawful Federal or private-sector employment and contracting preferences for veterans of the U.S. armed forces or persons protected by the Randolph-Sheppard Act, 20 U.S.C. 107 et seq.\n(b) This order does not prevent State or local governments, Federal contractors, or Federally-funded State and local educational agencies or institutions of higher education from engaging in First Amendment-protected speech.\n(c) This order does not prohibit persons teaching at a Federally funded institution of higher education as part of a larger course of academic instruction from advocating for, endorsing, or promoting the unlawful employment or contracting practices prohibited by this order.\nSec. 8. General Provisions. (a) Nothing in this order shall be construed to impair or otherwise affect:\n(i) the authority granted by law to an executive department, agency, or the head thereof; or\n(ii) the functions of the Director of the Office of Management and Budget relating to budgetary, administrative, or legislative proposals.\n(b) This order shall be implemented consistent with applicable law and subject to the availability of appropriations.\n(c) This order is not intended to and does not create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.\nTHE WHITE HOUSE,\nJanuary 21, 2025."
    },
    {
      "url": "https://diversity.com/post/corporate-dei-under-fire-trump-executive-order#:~:text=Challenges%20in%20Employee,within%20their%20organizations.",
      "text": "Corporate DEI Under Fire: How Companies Are Responding to Trump's Executive Order\nThe landscape of Diversity, Equity, and Inclusion (DEI) in corporate America is undergoing significant changes following recent executive actions by President Donald Trump.\nOn January 21, 2025, President Trump issued an executive order titled \"Ending Illegal Discrimination and Restoring Merit-Based Opportunity,\" which seeks to eliminate DEI policies and programs across federal agencies and within private industries that do business with the federal government.\nThis directive has prompted varied responses from corporations, with some scaling back their DEI initiatives due to legal and political pressures, while others remain committed to fostering inclusive workplaces.\nHow Companies Are Responding to the Executive Order\nScaling Back DEI Programs\nTarget Corporation: Target announced on January 24, 2025, that it will end several of its DEI programs, including its Racial Equity Action and Change (REACH) initiatives, citing an evolving external landscape. (Them, 2025)\nMeta Platforms, Inc.: Meta has also reduced its DEI initiatives, reflecting a broader trend among major corporations to reassess their diversity commitments in response to political and legal pressures. (Business Insider, 2025)\nCompanies Standing Firm on DEI\nCostco Wholesale Corporation: Costco's shareholders recently overwhelmingly rejected a proposal to investigate the company's DEI policies, with 98% voting against it. This decision underscores Costco's commitment to its DEI initiatives despite external pressures. (Reuters, 2025)\nJPMorgan Chase & Co.: CEO Jamie Dimon has strongly defended the company's DEI efforts, highlighting their importance to innovation and financial results. JPMorgan continues to uphold its diversity initiatives amidst the changing political landscape. (Business Insider, 2025)\nInvestor and Market Reactions\nWall Street’s Response: Investor sentiment is divided. Some shareholders urge companies to maintain DEI commitments, viewing them as essential to long-term growth, while others advocate for a neutral approach to avoid legal entanglements.\nConsumer Sentiment Trends: Recent surveys indicate that 70% of Gen Z and Millennial consumers prefer to buy from companies that prioritize workplace diversity. (Business Insider, 2025)\nStock Performance and Risk: Companies that make abrupt changes to DEI policies risk reputational damage, employee disengagement, and stock fluctuations due to investor uncertainty.\nRebranding DEI Strategies Without Political Backlash\nSome corporations are reframing their DEI efforts under different terminology:\nInclusive Leadership Development: Replacing “DEI training” with leadership-focused programs that highlight diverse perspectives without political connotations.\nWorkplace Culture and Innovation Programs: Shifting language toward “workplace culture enhancement” rather than explicit DEI branding.\nBroadening Diversity Strategies: Expanding programs beyond race and gender to include economic diversity, skills-based hiring, and professional development for all employees.\nKey Takeaway: Simply renaming initiatives isn’t enough. Employees, job seekers, and investors demand measurable impact rather than performative rebranding efforts.\nChallenges in Employee Engagement and Retention\nInternal morale is emerging as a significant concern as companies alter their DEI strategies:\nEmployee Pushback: Workforces previously engaged in DEI programs are expressing frustration over abrupt changes, leading to lower morale and potential retention issues.\nRecruitment Challenges: Companies that cut diversity hiring programs may struggle to attract top talent, as job seekers increasingly prioritize inclusive workplaces, as 70% of Gen Z & Millennials prefer inclusive workplaces ([Business Insider, 2025])..\nTrust and Transparency: Business leaders must carefully communicate policy changes to avoid eroding trust within their organizations.\nThe Future of Corporate DEI: What Happens Next?\nThe corporate response to Trump’s executive order is more than just a policy shift.\nIt’s a turning point for businesses, employees, and job seekers.\nSome companies are stepping away from DEI due to legal and political pressures, while others are reinforcing their commitment to inclusion, recognizing that workplace diversity isn’t just about compliance. it’s about business growth, innovation, and long-term success.\nWhat does this mean for you? Whether you're an employer navigating new challenges or a job seeker looking for an inclusive workplace, now is the time to take action.\nHow to Move Forward: Action Steps for Employers & Job Seekers\nFor Employers\nAssess Your DEI Strategy: Conduct a legal compliance review to ensure policies align with emerging regulations.\nMeasure DEI Impact: Instead of performative branding, link DEI efforts to business performance, innovation, and workforce retention.\nCommunicate Clearly: Transparency is key—whether scaling back or reinforcing DEI, ensure employees and stakeholders understand why.\nRetain & Attract Top Talent: With Gen Z and Millennial job seekers prioritizing diverse workplaces, cutting DEI may cost you more in recruitment struggles.\nFor Job seekers\nResearch Companies’ DEI Policies: Actions speak louder than words—look at their track record, leadership representation, and employee reviews.\nAsk the Right Questions: During interviews, inquire about diversity efforts, mentorship programs, and company culture.\nNetwork in DEI-Friendly Spaces: Connect with professionals in industries and companies that align with your values.\nWhere Do You Stand?\nEmployers: Curious about how your company measures up in DEI? Take our DEI Survey and gain industry insights.\nJob Seekers: Looking for a company that doesn’t just talk about diversity but actually commits to it? Browse DEI-friendly employers hiring now.\nAt Diversity.com, We are committed to supporting both employers and job seekers in fostering equitable and inclusive workplaces.\nIf you have any questions or need assistance, feel free to Contact Us Here. Our dedicated support team is ready to help!\nRelated Articles\nTrump’s DEI Ban: What It Means for Employers & Workplace Diversity in 2025\nWhat’s Next for Workplace Inclusion? How Companies Can Rebrand Their Initiatives Without Saying \"DEI\"\nFrom Policy to Action: How Companies Can Maintain Inclusive Workplaces Beyond DEI Mandates\nThe Legal Risks of Scaling Back Inclusion Programs: What Employers Should Know in 2025\nWhy Inclusive Workplaces Matter More Than Ever: Addressing Common Misconceptions\nSources & References\nAssociated Press. (2025, January 24). Target Ends DEI Initiatives, Becoming Latest Company to Bow to the Right's Moral Panic. AP News. Retrieved from https://www.them.us/story/target-ends-dei-initiatives-latest-company-right-wing-moral-panic\nBusiness Insider. (2025, January 25). The Companies Fighting Back Against Trump's War on DEI. Business Insider. Retrieved from https://www.businessinsider.com/jpmorgan-costco-keeping-dei-despite-trump-executive-orders-2025-1\nReuters. (2025, January 28). Republican State Attorneys Pressure Costco to Drop Diversity Policies. Reuters. Retrieved from https://www.reuters.com/sustainability/society-equity/republican-state-attorneys-pressure-costco-drop-diversity-policies-2025-01-28/\nWilmerHale. (2025, January 27). Executive Order Seeks to Impose False Claims Act Liability for Federal Contractors’ DEI Programs. WilmerHale. Retrieved from https://www.wilmerhale.com/en/insights/client-alerts/20250127-executive-order-seeks-to-impose-false-claims-act-liability-for-federal-contractors-dei-programs\nThe Wall Street Journal. (2025, January 26). DEI Pay Incentives Come Under Pressure After Two-Year Surge. WSJ. Retrieved from https://www.wsj.com/articles/dei-pay-incentives-come-under-pressure-after-two-year-surge-8377c95f\nBloomberg. (2025, January 25). How Companies Are Quietly Rebranding DEI Efforts Amid Political Backlash. Bloomberg Businessweek. Retrieved from https://www.bloomberg.com/news/articles/2025-01-25/how-companies-are-rebranding-dei-amid-political-pressure\nPew Research Center. (2024, December 15). Public Attitudes Toward Corporate Diversity Initiatives in the U.S. Pew Research Center. Retrieved from https://www.pewresearch.org/fact-tank/2024/12/15/public-opinion-on-dei-in-corporate-america"
    },
    {
      "url": "https://www.aalrr.com/Labor-Employment-Law-Blog/president-trumps-executive-orders-on-dei",
      "text": "Controversy surrounding “diversity, equity and inclusion” (DEI) programs is neither new nor surprising. But since the beginning of 2025, increased challenges and scrutiny of the term DEI itself has called into question the state of its future existence.\nAt the start of his administration, President Donald Trump signed two executive orders aimed at putting an end to illegal “diversity, equity, and inclusion” (DEI) policies and programs, now referred to as “illegal DEI.” The executive orders, while mainly directed at federal government agencies, also impact other sectors, including private companies, educational institutions, and non-profit organizations. Accordingly, it is important that employers from all industries stay updated with the current state of DEI because although the executive orders do not change the existing law regarding discrimination, they have prompted scrutiny, suspicion, investigation and enforcement activities on DEI programs and policies.\nFirst, Executive Order 14151, titled “Ending Radical and Wasteful Government DEI Programs and Preferencing,” asserts that the Biden Administration has “forced illegal and immoral discrimination programs, going by the name ‘diversity, equity, and inclusion’ (DEI) …” The order directs, among others, “the termination of all discriminatory programs, including illegal DEI and ‘diversity, equity, inclusion, and accessibility’ (DEIA) mandates, policies, programs, preferences, and activities in the Federal Government …” Executive Order 14151 also directs federal agencies, departments, and commission heads to “terminate, to the maximum extent allowed by law … ‘equity-related’ grants or contracts; and all DEI or DEIA performance requirements for employees, contractors, or grantees.”\nSecond, Executive Order 14173, or “Ending Illegal Discrimination and Restoring Merit-Based Opportunities,” revokes several prior orders aimed at equal employment opportunity and the promotion of diversity and inclusion in the workplace. One of Executive Order 14173’s directives are to the heads of all agencies to submit a report, within 120 days of the order (by May 20, 2025), “containing recommendations for enforcing Federal civil-rights laws and taking other appropriate measures to encourage the private sector to end illegal discrimination and preferences, including DEI.” The report must include “the most egregious and discriminatory DEI practitioners in each sector of concern” and a “plan of specific steps or measures to deter DEI programs or principles … that constitute illegal discrimination or preferences.”\nThe executive orders do not define “illegal DEI,” and currently, at least two lawsuits had been filed challenging these orders. However, despite the legal challenges, the executive orders have prompted many major companies to scale back or dismantle their DEI programs altogether. While the impact of these measures on the workplace remains to be seen, it is clear government agencies will be looking for “illegal DEI” and there is a potential increase in litigation with lawsuits testing the definitions of the executive orders’ terms and provisions.\nOn March 19, 2025, the Equal Employment Opportunity Commission (EEOC) and the Department of Justice (DOJ) jointly released two technical assistance documents that was said to be “focused on educating the public about unlawful discrimination related to ‘diversity, equity, and inclusion’ (DEI) in the workplace.” The jointly released document titled, “What To Do If You Experience Discrimination Related to DEI at Work,” describes what “DEI-related discrimination” can look like and who can be affected by it. Among the description of DEI-related discrimination include:\n(1) disparate treatment, “where an employer takes an employment action motivated (in whole or in part) by race, sex, or another characteristic;”\n(2) limiting, segregating, and classifying employees based on race, sex, or other protected characteristics, “such as Employee Resource Groups (ERG) or other affinity groups” that limit membership in workplace groups to certain protected groups and “separating employees into groups based on race, sex, or another protected characteristic when administering DEI or other trainings;”\n(3) “workplace harassment, which may occur when an employee is subjected to unwelcome remarks or conduct based on race, sex, or other protected characteristics”; and\n(4) “retaliation by an employer because an individual has engaged in protected activity under the statute, such as objecting to or opposing employment discrimination related to DEI …”\nThe technical assistance document also noted that “[d]epending on the facts, DEI training may give rise to a colorable hostile work environment claim” and “[r]easonable opposition to a DEI training may constitute protected activity if the employee provides a fact-specific basis for his or her belief that the training violates Title VII.” The EEOC and DOJ do not provide any examples of these facts that may give rise to workplace harassment or retaliation based on DEI, but it is fair to anticipate that sooner rather than later, we will see lawsuits testing what those facts are.\nWhile President Trump’s first two executive orders aimed at DEI has increased the potential for litigation with challenges to DEI policies or programs, there is one theory of liability that the Trump Administration has aimed to eliminate: “disparate-impact” discrimination.\nOn April 23. 2025, President Trump signed Executive Order 14281, titled “Restoring Equality of Opportunity and Meritocracy,” which aims “to eliminate the use of disparate impact liability in all contexts to the maximum degree possible.” “Disparate impact” liability is a legal theory where an employer can be held liable for facially neutral policies or practices that have a disparate impact on a group of applicants or employees based on a protected characteristic, even without intentional discrimination. According to the executive order, disparate impact liability “requires individuals and businesses to consider race and engage in racial balancing to avoid potentially crippling legal liability. It not only undermines our national values, but also runs contrary to equal protection under the law and, therefore, violates our Constitution.”\nHowever, while Executive Order 14281 directs federal agencies to “deprioritize enforcement of all statutes and regulations to the extent they include disparate-impact liability,” it does not immediately change the law, and disparate impact remains a recognized theory of liability. Accordingly, employers should continue to monitor their policies and practices for potential disparate impact.\nMoreover, employers with existing DEI policies or programs should conduct an audit, preferably by an attorney, of their DEI policies and programs to identify potential risks. Again, while the executive orders do not define “illegal DEI,” based on the EEOC and DOJ technical assistance document, employers should consider that any recruitment policy or program that sets quotas for persons of certain protected characteristics, or any program that limits, segregates or classifies applicants or employees based on race, sex or other protected characteristics, are risky and likely to lead to lawsuits.\nFinally, employers have responded in various ways to President Trump’s executive orders, from scaling back to dismantling their DEI programs, to reaffirming their commitment to DEI. Based on these various responses, it is uncertain what the future of DEI will look like. The only certainty for now is that the fight for and against DEI continues. The scrutiny and investigation into DEI policies and programs continues and more lawsuits will likely follow. Therefore, it is important for companies to stay updated with new developments in this area of the law. Consult your counsel with questions you may have about your DEI policies and programs.\nThis AALRR publication is intended for informational purposes only and should not be relied upon in reaching a conclusion in a particular area of law. Applicability of the legal principles discussed may differ substantially in individual situations. Receipt of this or any other AALRR publication does not create an attorney-client relationship. The Firm is not responsible for inadvertent errors that may occur in the publishing process.\n© 2025 Atkinson, Andelson, Loya, Ruud & Romo\n- Of Counsel\nMae Alberto serves as Of Counsel in our Private Labor & Employment practice group. With significant experience in law and motion work and appellate litigation, Ms. Alberto primarily handles the drafting of complex dispositive ...\nOther AALRR Blogs\nRecent Posts\n- California Agency Issues Guidance on Violence Leave\n- California Employers Should Review Their Cellular Phone and Driving Policies Following Recent Court of Appeal Decision\n- Numerous Local Minimum Wages Poised to Increase Effective July 1, 2025\n- U.S. Citizen and Immigration Services Issues Updated I-9 Form\n- President Trump’s Executive Orders on DEI\n- California Court of Appeal Upholds Revocable, Prospective Meal Period Waivers\n- SPRING CLEANING: Have You “Cleaned Up” Your Arbitration Agreement?\n- What One Court Takes Away In Attorneys’ Fees Other Courts Give Back\n- California Court Finds Employers Cannot Contract Around the “Ending Forced Arbitration of Sexual Assault and Sexual Harassment Act” With Choice-of-Law Provision\n- Love In The Workplace? Embrace It!\nPopular Categories\n- (129)\n- (50)\n- (33)\n- (37)\n- (8)\n- (34)\n- (15)\n- (17)\n- (4)\n- (6)\n- (15)\n- (13)\n- (1)\n- (1)\n- (9)\n- (3)\n- (3)\n- (2)\n- (2)\n- (2)\n- (3)\n- (3)\n- (1)\n- (2)\n- (1)\n- (2)\n- (1)\n- (1)\n- (1)\n- (1)\n- (1)\n- (1)\n- (1)\n- (1)\nContributors\n- Mae G. Alberto\n- Cindy Strom Arellano\n- Sarkis A. Atoyan\n- William M. Betley\n- Michele L. Collender\n- Kevin R. Dale\n- Scott K. Dauscher\n- Alexandria M. Davidson\n- William A. Diedrich\n- Paul S. Fleck\n- Grant C. Furukawa\n- Lauren S. Gafa\n- Priscilla Gamino\n- L. Brent Garrett\n- Evan J. Gautier\n- Carol A. Gefis\n- Jennifer S. Grock\n- Jonathan Judge\n- Nate J. Kowalski\n- Joshua N. Lange\n- Catherine M. Lee\n- Thomas A. Lenz\n- David M. Lester\n- Martin S. Li\n- Mia A. Lomedico\n- Jorge J. Luna\n- Brian D. Martin\n- Ronald W. Novotny\n- Michael J. O'Connor, Jr.\n- Aaron V. O'Donnell\n- Shawn M. Ogle\n- Sharon J. Ormond\n- Nora Pasin\n- Joseph E. Pelochino\n- Chesley D. Quaide\n- Todd M. Robbins\n- Irma Rodríguez Moisa\n- Saba Salamatian\n- Casandra P. Secord\n- Jon M. Setoguchi\n- Ann K. Smith\n- Amber M. Solano\n- Susan M. Steward\n- April Szabo\n- Jay G. Trinnaman\n- Jonathan S. Vick\n- Robert L. Wenzel\n- Glen A. Williams\nArchives\n2025\n2024\n2023\n2022\n- November 2022\n- October 2022\n- September 2022\n- July 2022\n- June 2022\n- May 2022\n- April 2022\n- March 2022\n- February 2022\n- January 2022\n2021\n- November 2021\n- October 2021\n- September 2021\n- July 2021\n- June 2021\n- May 2021\n- April 2021\n- March 2021\n- February 2021\n- January 2021\n2018\n- December 2018\n- November 2018\n- October 2018\n- September 2018\n- August 2018\n- July 2018\n- June 2018\n- May 2018\n- March 2018\n- February 2018\n- January 2018\n2017\n- December 2017\n- November 2017\n- October 2017\n- September 2017\n- August 2017\n- June 2017\n- May 2017\n- March 2017\n- February 2017\n2016\n- December 2016\n- November 2016\n- October 2016\n- September 2016\n- August 2016\n- July 2016\n- June 2016\n- May 2016\n- April 2016\n- March 2016\n- February 2016\n2015\n- December 2015\n- October 2015\n- September 2015\n- August 2015\n- July 2015\n- June 2015\n- May 2015\n- April 2015\n- March 2015\n- February 2015\n- January 2015\n2014\n- November 2014\n- October 2014\n- September 2014\n- August 2014\n- July 2014\n- June 2014\n- May 2014\n- April 2014\n- February 2014\n- January 2014\n2013\n- October 2013\n- September 2013\n- July 2013\n- June 2013\n- May 2013\n- April 2013\n- March 2013\n- February 2013\n- January 2013\n2012\n- October 2012\n- September 2012\n- August 2012\n- July 2012\n- June 2012\n- May 2012\n- April 2012\n- March 2012\n- February 2012\n- January 2012\n2011\n- December 2011\n- November 2011\n- October 2011\n- September 2011\n- August 2011\n- July 2011\n- June 2011\n- May 2011\n- April 2011\n- March 2011\n- February 2011\n- January 2011"
    },
    {
      "url": "https://www.resume.org/6-in-10-companies-that-eliminated-dei-since-trumps-reelection-are-hiring-fewer-diverse-employees/",
      "text": "- 1 in 5 Companies Eliminated DEI Since Trump’s Reelection\n- Majority of Companies That Made Cuts to DEI Are Hiring Fewer Underrepresented Workers\n- 1 in 3 Companies That Slashed DEI Efforts Are Promoting Fewer Underrepresented Employees\n- Business Leaders Report Mixed Feelings About Their Company’s DEI Cuts\nIn July, Resume.org surveyed 965 companies that had diversity, equity, and inclusion (DEI) programs before November 2024 to understand how these initiatives have changed since President Trump’s election.\nMajor takeaways:\n- 1 in 5 companies eliminated DEI since Trump’s reelection\n- 10% of companies with DEI programs reduced their investment\n- 57% of companies that eliminated DEI report decreases in hiring of one or more underrepresented groups\n- 1 in 3 companies that cut DEI programs report promoting fewer underrepresented workers\n- Half of companies that cut DEI say morale is down, and 1 in 5 say reports of discrimination and bias are up\n1 in 5 Companies Eliminated DEI Since Trump’s Reelection\nSince President Trump’s reelection in November 2024, 20% of companies have eliminated their DEI programs entirely. Among the 80% of companies that still have a DEI program, the majority (71%) say it hasn’t changed, but 11% report reducing their efforts.\nOf those that scaled back or cut DEI altogether, the top reason — cited by 74% of business leaders — is a shift in the political climate.\nMany companies that haven’t eliminated DEI initiatives since Trump’s election are considering doing so. About 16% are likely to eliminate their program by the end of 2025, and another 7% expect to do so within the next four years.\nWhile some companies are backing away from DEI, business leaders are conflicted. Most agree that these initiatives meaningfully improved diversity and inclusion and are key drivers of employee satisfaction and retention.\nMajority of Companies That Made Cuts to DEI Are Hiring Fewer Underrepresented Workers\nAmong those that eliminated DEI programs, 57% report hiring fewer underrepresented workers. More specifically, 37% say hiring of women of color has declined, along with 33% who report fewer LGBTQIA+ hires, 33% who report fewer men of color being hired, and 26% who say hiring of people with disabilities has declined. About 13% report fewer white women being hired.\nIn contrast, the decline in hiring white candidates has been notably smaller: 12% report a drop in hiring white men.\nThese disparities suggest that reductions in DEI efforts disproportionately affect already underrepresented groups.\n“Eliminating DEI programs, particularly due to political pressure, is short-sighted and creates long-term risks,” says Kara Dennison, head of career advising at Resume.org. “Companies that cut DEI programs are hiring fewer underrepresented employees, leading to reduced innovation, lower performance, and weaker talent pipelines. Many report declining morale and rising incidents of discrimination, signaling damage to culture and psychological safety.\n“DEI initiatives shouldn’t be political; they should be strategic. They can help attract top talent, foster inclusive leadership, and boost retention, especially among younger and more diverse employees. Companies that abandon DEI risk reputational harm, disengagement, and an inability to adapt to an increasingly global, values-driven marketplace.”\n1 in 3 Companies That Slashed DEI Efforts Are Promoting Fewer Underrepresented Employees\nNearly half of companies (47%) that pulled back on DEI report a decline in employee morale, and 39% say they’ve reduced benefits that were originally tied to DEI.\nAdditionally, more than one-third of companies report a drop in both retention (36%) and attraction (35%) of diverse talent. Roughly 3 in 10 acknowledge fewer promotions for underrepresented employees (30%) and decreased leadership representation for people of color (30%). Meanwhile, 24% report fewer women in leadership roles. Some companies are experiencing reputational damage (25%), and 18% report an increase in workplace discrimination or bias-related incidents.\n“Slashing DEI programs often leads to immediate declines in morale and retention, especially among underrepresented employees who no longer feel supported or valued. DEI fosters belonging and psychological safety, which are critical to employee engagement and loyalty. Without it, trust erodes and turnover increases,” says Dennison.\n“Removing DEI signals that inclusion is no longer a priority, which can encourage harmful behavior and silence affected voices. This creates a toxic culture, weakens future leadership, and puts both reputation and performance at risk.”\nBusiness Leaders Report Mixed Feelings About Their Company’s DEI Cuts\nWhile many companies reduced or eliminated DEI programs in response to political pressure or shifting priorities, reactions from business leaders reveal a stark divide in how those decisions are perceived internally.\nSome respondents expressed frustration with DEI efforts, describing them as counterproductive or harmful to workplace culture. Several saw DEI initiatives as performative or divisive, and felt their removal restored a sense of fairness:\n- “It has caused more problems than it solved. White employees felt discriminated against, causing workplace tension.”\n- “DEI in the workplace was a totally worthless program. Really did nothing for the employees but possibly hindered development.”\n- “DEI was very divisive. Good that we eliminated it.”\n“My company’s DEI practices were very obviously performative and didn’t drive any real change or improvements at all.”\nOthers voiced disappointment or concern about the consequences of pulling back on diversity initiatives. They pointed to reduced morale, reputational damage, and the loss of progress made in recent years:\n- “It seems to have stalled due to budgetary concerns and possibly due to the political environment. I would prefer that it have been maintained, if not expanded.”\n“DEI was valuable, and I’m very disappointed that it has been eliminated.” - “We are worse off as a company and our place in society since dropping the DEI policy.”\n- “I thought DEI created a safe space for us all. It allowed us to feel represented. The company removed them with no notice and did not provide any mention of it or reasoning.”\nMethodology: Resume.org commissioned this survey, and it was conducted via Pollfish in July 2025. A total of 965 U.S. business leaders participated. Demographic and screening criteria ensured appropriate respondents.\nResume.org offers free, HR approved resume templates to help you create a professional resume in minutes. Choose from several template options and even pre-populate a resume from your profile."
    }
  ],
  "argos_summary": "Recent executive orders by President Trump have led to significant changes in U.S. diversity, equity, and inclusion (DEI) policies, prompting many organizations to reassess their commitments to these initiatives. The orders dismantle federal DEI programs, labeling them as discriminatory, and have resulted in a notable decline in hiring and promotion of underrepresented groups across various sectors. While some companies have scaled back or eliminated their DEI efforts due to political pressures, others continue to advocate for inclusive practices, recognizing their importance for innovation and employee morale.",
  "argos_id": "QEC28I6FB"
}