{
  "url": "https://finance.yahoo.com/news/village-farms-international-delivers-record-110000530.html",
  "authorsByline": "Village Farms International, Inc.",
  "articleId": "529218c9e01247ac990622c7c0176dda",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/globenewswire.com/0ec06cba40c14fd8e22c18effca94770",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T11:00:00+00:00",
  "addDate": "2025-08-11T11:30:43.139530+00:00",
  "refreshDate": "2025-08-11T11:30:43.139532+00:00",
  "score": 1.0,
  "title": "Village Farms International Delivers Record Profitability and Performance from Continuing Operations in Q2/25",
  "description": "Consolidated Income from Continuing Operations was $9.9 Million or $0.09 Per ShareNet Income of $26.5 Million and EPS of $0.24Adj. EBITDA from Continuing Operations of $17.1 Million or 28.6% of Sales; Both Records for Company Canadian Cannabis Adj. EBITDA Up 146% YoY Reflects Success of Recent Margin Improvement InitiativesYTD Consolidated Operating Cash Flow from Continuing Operations of $22 MillionStrong Q2 Profitability Enhances Net Cash Position; Company Ends Q2 with $65 Million in CashExpan",
  "content": "“The recent closing of our produce transaction has coincided fortuitously with several other powerful catalysts, including our commencement of sales in Holland’s adult-use market, success of our recent initiatives to align our product portfolio toward higher-margin SKUs, and a continuing wave of additional countries around the world following Canada’s lead with pragmatic approaches to regulating cannabis. We are proud to be part of an emerging, vibrant global cannabis ecosystem, proud to be leveraging our 36-years in controlled environment agriculture to become a partner of choice in the cannabis community, and proud to be in a leadership position that enables us to self-fund an additional 40 metric tons of annual cultivation capacity to serve our Canadian and international customers.”\n\n“Our second quarter results demonstrate the improving earnings potential of Village Farms and our continued success in scaling a profitable global cannabis enterprise,” said President and Chief Executive Officer Michael DeGiglio. “Second quarter performance reflected record levels of profitability since we expanded into cannabis in 2017, and eclipsed several records set during our nearly 20-year history as a publicly traded company. Our teams are excelling during a period of rapid change for the organization, and energized by the many pockets of upside opportunity that we see across virtually every aspect of our business.”\n\nThe Company’s second quarter 2025 results reflect the May 30, 2025 closing of its previously-announced, transformative transaction to privatize certain assets and operations of its Produce segment through the formation of a new entity backed by private investment firms (the “Transaction”). In connection with the Transaction, the Company received $40 million in cash, subject to working capital adjustments, and common units representing a 37.9% equity ownership interest in Vanguard Food LP. As a result of the Transaction, operations which were privatized are now classified as discontinued operations and the reported financial results for comparative prior periods have been adjusted accordingly.\n\nVANCOUVER, British Columbia, Aug. 11, 2025 (GLOBE NEWSWIRE) -- Village Farms International, Inc. (“Village Farms” or the “Company”) (NASDAQ: VFF) today reported financial results for its second quarter ended June 30, 2025. All figures are in U.S. dollars unless otherwise indicated.\n\nAdj. EBITDA from Continuing Operations of $17.1 Million or 28.6% of Sales; Both Records for Company\n\nConsolidated Income from Continuing Operations was $9.9 Million or $0.09 Per Share\n\n“While we are benefiting from multiple catalysts unlocking value for our stakeholders, we continue to see meaningful potential for additional long-term value creation through our ownership interest in our newly formed produce entity and future optionality of our U.S. based greenhouse assets and operations. We believe the trends observed in our business during the second quarter are sustainable, and that our capacity expansion projects in Canada and the Netherlands position us for continued profitable growth in 2026 and beyond. We are growing organically, profitably and generating positive free cash flow, and we believe the strength of our balance sheet will enable us the flexibility to make additional growth investments that will drive strong returns for shareholders.”\n\nSecond Quarter 2025 Financial Highlights \n\n(All comparable periods are for the second quarter of 2024 unless otherwise stated)\n• Consolidated net income from continuing operations was $9.9 million, or $0.09 per share compared to a net loss of $16.6 million, or ($0.15) per share;\n• Consolidated net income was $26.5 million, or $0.24 per share compared to net loss of $23.5 million, or ($0.21) per share;\n• Year-to-date consolidated cash flow from continuing operations was $22.3 million compared with ($3.7 million).\n• Consolidated adjusted EBITDA from continuing operations (a non-GAAP measure) was $17.1 million compared with $2.9 million; and,\n• Consolidated adjusted EBITDA margin from continuing operations (a non-GAAP measure) of 28.6%, an increase of 2,320 basis points compared to 5.4%.\n• International medical export sales increased 690%, retail branded sales decreased 20% due to a planned mix shift toward higher-margin products, and non-branded (wholesale) sales decreased 15% (in Canadian dollars);\n• Gross margin increased to 39% from 26%, due primarily to the increase in international sales;\n• Adjusted EBITDA increased 146% to $11.9 million (C$16.5 million) from $4.8 million (C$6.6 million); and,\n• Cash flow from operations increased 233% to $18.0 million (C$24.6 million) from $5.4 million (C$7.2 million).\n• Net loss was $0.2 million compared with a net loss of $12.3 million; and\n\nLeli Holland commenced sales during the first quarter of 2025. Leli Holland was not operational during the comparable quarter of 2024. As a result, comparative financial performance to the prior-year quarter is not meaningful.\n• Net income from continuing produce operations improved to $4.3 million from a loss from continuing produce operations of $1.3 million, due to a vendor settlement in the second quarter of 2025 related to a partial recovery of operating losses from the Tomato Brown Rugose Fruit Virus (“ToBRFV”) infestation;\n• Adjusted EBITDA from continuing produce operations improved to $6.4 million from $0.1 million for the quarter ended June 30, 2024 due to both a vendor settlement and improved continuing produce operations.\n• Company has maintained a top three overall market share position in Canada and the number one position in dried flower year-to-date through the month of July, despite planned reductions in sales of lower-margin SKUs1;\n• Achieved the high end of its targeted gross margin range of 30-40% for the second consecutive quarter, and its strongest adjusted EBITDA performance in six years;\n• Refinanced its syndicated Canadian Cannabis Term Loans, consolidating three previous loans into one credit facility with two of its existing lenders. The new credit facility carries a variable interest rate below 6.0 percent, reflecting a 250 basis point improvement to the previous interest rate, as well as improved financial covenants and a maturity date of February 7, 2028, replacing its previous credit facilities maturing on February 7, 2026;\n• Subsequent to quarter end, published groundbreaking peer-reviewed research in Scientific Reports (Nature Portfolio), highlighting the natural variability of THC potency within cannabis plants, reinforcing a need for a greater focus on product quality versus potency and more transparent and accurate labelling across the industry;\n• Subsequent to quarter end, the Company launched innovative new windowed packaging for its flower products in the Canadian market, enabling consumers to see product quality in the package before purchase;\n• Subsequent to quarter end, the Company announced that its Board of Directors unanimously approved an investment to expand cannabis cultivation capacity in its Delta 2 greenhouse in order to meet increasing demand in Canadian and International markets. The expansion will be funded with existing cash on hand, and is expected to yield an incremental 40 metric tons of annualized cannabis production.\n\n1. Based on estimated retail sales from HiFyre, other third parties and provincial boards\n• International export sales increased 690% year-over-year in the second quarter and 116% sequentially, driven by new customer relationships as well as increased sales from existing customers;\n• The Company achieved its previous full-year sales target for International export sales during the first six months of the year, and expects similar international export sales performance in the second half of 2025 as compared to the first half of the year;\n• Company continues to distribute several leading cultivars in Germany through third-party partners2\n\n1. Based on German government data and Company estimates \n\n2. Based on Company estimates and ranking compiled by German outlet Flowzz\n• Operations in the Company’s Phase I facility in Drachten continued to ramp toward full capacity during the second quarter, while demonstrating strong profitability and cash flow generation;\n• Leli Holland products are now represented in 66 of 80 participating coffeeshops, representing market penetration of 82.5%;\n• The Company has continued to introduce new product categories into the market and expects to launch hash products during the fourth quarter;\n• Construction of the Company’s Phase II facility in Groningen remains on track to be operational in Q1 2026;\n• Once completed, the Phase II facility is expected to quintuple total annualized production capacity.\n• The Company's application for a Texas medicinal marijuana license remains pending review by the Department of Public Services. If awarded, the Company plans to work with its listing authority to structure an acceptable ownership structure and comply with all applicable regulatory requirements.\n• On May 30, 2025 the Company closed on the previously-announced transaction to privatize certain assets and operations of its Produce segment. Under the terms of the agreement, the Company privatized Produce segment operations, including its Marfa II, Marfa I and Fort Davis greenhouses, and all of its produce distribution centers, as well as its third party produce distribution business, through a series of asset and lease transfers, for total consideration of $40 million and a 37.9% equity ownership interest in Vanguard Food LP, a new, private-equity-backed partnership;\n• During the second quarter, the Company entered into service and supply agreements with Vanguard Fresh Canada ULC for produce production in its Delta 1 and Delta 2 greenhouses, which will continue supplying produce to Vanguard for a multi-year term. The Delta 1 and Delta 2 greenhouses generated approximately $29 million in produce sales in fiscal year 2024. The Company’s Produce segment financial results are now predominantly comprised of activities related to operation of the Delta 1 and Delta 2 greenhouses. Following completion of the 2025 tomato crop, the Delta 2 greenhouse will no longer supply produce to Vanguard.\n• During the second quarter, the Company regained compliance with the Nasdaq minimum closing bid price of US$1.00 per share listing requirement (NASDAQ Listing Rule 5550(a)(2));\n\nVillage Farms’ management team will host a conference call to discuss its second quarter 2025 financial results today, Monday 11, 2025, at 8:30 a.m. ET. Participants can access the conference call via a webcast at or on the company website at . Participants wanting to access the conference call by telephone must register in advance at to receive telephone dial-in information.\n\nThe live question and answer session will be limited to analysts; however, others are invited to submit questions ahead of the conference call via email at . Management will address questions received via email during the question-and-answer session as time permits.\n\nVillage Farms leverages decades of experience in Controlled Environment Agriculture as a large-scale, vertically-integrated supplier of high-value, high-growth plant-based Consumer Packaged Goods. The Company built a strong foundation as the leading and longest-tenured fresh produce supplier to grocery and large-format retailers throughout the US and Canada, but now focuses its agricultural expertise on high-growth cannabinoid opportunities internationally while maintaining strategic optionality through remaining produce assets.\n\nIn Canada, the Company's wholly owned Canadian subsidiary, Pure Sunfarms, is one of the single largest cannabis operations in the world (2.2 million square feet of greenhouse production), a low-cost producer and one of Canada’s highest quality and best-selling brands. The Company owns an incremental 2.6 million square feet of greenhouse capacity in Canada for future expansion, and also owns 80% of Québec-based, Rose LifeScience, a leader in the commercialization of cannabis products.\n\nInternationally, Village Farms is targeting selected, nascent, legal cannabis opportunities with significant growth potential. The Company exports medical cannabis from its EU GMP certified facility in Canada to international markets including Germany, the United Kingdom, Israel, Australia, and New Zealand. The Company is expanding its export business to new countries and customers, and making select investments in international production assets. In Europe, wholly-owned Leli Holland has one of 10 licenses to grow and distribute recreational cannabis within the Dutch Coffee Shop Experiment.\n\nIn the US, wholly-owned Balanced Health Botanicals is one of the leading CBD and hemp-derived brands and e-commerce platforms in the country. Subject to compliance with all applicable US federal and state laws and stock exchange rules, Village Farms plans to enter the US THC market via multiple strategies, leveraging its Texas-based greenhouse assets (2.2 million square feet of existing greenhouse capacity and 950 acres of owned, unoccupied land for future expansion).\n\nVillage Farms Clean Energy (VFCE), through a partnership with Atlanta-based Terreva Renewables, creates renewable natural gas from landfill gas at its Delta RNG facility. VFCE receives royalties on all revenue generated.\n\nPresentation of Financial Results\n\nThe Company’s financial statements for the three and six months ended June 30, 2025, as well as the comparative periods for 2024, have been prepared and presented under United States Generally Accepted Accounting Principals (“GAAP”).\n\n\n\n(1) Adjusted EBITDA is not a recognized earnings measure and does not have a standardized meaning prescribed by GAAP. Therefore, Adjusted EBITDA may not be comparable to similar measures presented by other issuers. Management believes that Adjusted EBITDA is a useful supplemental measure in evaluating the performance of the Company because it excludes non-recurring and other items that do not reflect our business performance. Adjusted EBITDA includes the Company’s 70% interest in Rose LifeScience through March 31, 2024, 80% interest in Rose LifeScience beginning on April 1, 2024, 85% interest in Leli through September 22, 2024, and our 100% interest in Leli beginning on September 23, 2024.\n\n\n\nWe caution that our results of operations for the three months and six months ended June 30, 2025, and 2024 may not be indicative of our future performance.\n\n\n\n(1) Adjusted EBITDA is not a recognized earnings measure and does not have a standardized meaning prescribed by GAAP. Therefore, Adjusted EBITDA presented for these segments may not be comparable to similar measures presented by other issuers. Management believes that Adjusted EBITDA is a useful supplemental measure in evaluating the performance of the Company because it excludes non-recurring and other items that do not reflect the underlying business performance of the Company.\n\n\n\nThis press release is intended to be read in conjunction with the Company’s Consolidated Financial Statements (\"Financial Statements”) and Management’s Discussion & Analysis (\"MD&A”) for the three and six months ended June 30, 2025 in the Company Form 10-Q, which will be filed on (www.sec.gov/edgar.shtml) and SEDAR (www.sedar.com) and will be available at www.villagefarms.com.\n\nThe following tables reflect a reconciliation of net income to Adjusted EBITDA, as presented by the Company:\n\n\n\n(1) Reflects impairment to goodwill and intangibles of $11,939 in U.S. Cannabis that was based on recent historical performance, near-term forecasts, and the state of the CBD industry in the United States. See “Critical Accounting Estimates and Judgments” below for more information.\n\n(2) Adjusted EBITDA is not a recognized earnings measure and does not have a standardized meaning prescribed by GAAP. Therefore, Adjusted EBITDA presented for these segments may not be comparable to similar measures presented by other issuers. Management believes that Adjusted EBITDA is a useful supplemental measure in evaluating the performance of the Company because it excludes non-recurring and other items that do not reflect the underlying business performance of the Company.\n\nA detailed discussion of our consolidated and segment results can be found in the 10-Q MD&A on the Village Farms website under Financial Reports (https://villagefarms.com/financial-reports/) within the Investors section.\n\nAs used in this Press Release, the terms “Village Farms”, “Village Farms International”, the “Company”, “we”, “us”, “our” and similar references refer to Village Farms International, Inc. and our consolidated subsidiaries, and the term “Common Shares” refers to our common shares, no par value. Our financial information is presented in U.S. dollars and all references in this Press Release to “$” means U.S. dollars and all references to “C$” means Canadian dollars.\n\nThis Press Release contains forward-looking statements within the meaning of the United States Private Securities Litigation Reform Act of 1995, Section 27A of the U.S. Securities Act of 1933, as amended, (the \"Securities Act\") and Section 21E of the Securities Exchange Act of 1934, as amended (the \"Exchange Act\"), and is subject to the safe harbor created by those sections. This Press Release also contains \"forward-looking information\" within the meaning of applicable Canadian securities laws. We refer to such forward-looking statements and forward-looking information collectively as \"forward-looking statements\". Forward-looking statements may relate to the Company's future outlook or financial position and anticipated events or results and may include statements regarding the financial position, business strategy, budgets, expansion plans, litigation, projected production, projected costs, capital expenditures, financial results, tariffs, taxes, plans and objectives of or involving the Company or statements regarding the anticipated benefits from the closing of the transaction involving Vanguard Food LP. Particularly, statements regarding future results, performance, achievements, prospects or opportunities for the Company, the greenhouse vegetable or produce industry, the cannabis industry and market and our energy segment are forward-looking statements. In some cases, forward-looking information can be identified by such terms as \"can\", \"outlook\", \"may\", \"might\", \"will\", \"could\", \"should\", \"would\", \"occur\", \"expect\", \"plan\", \"anticipate\", \"believe\", \"intend\", \"try\", \"estimate\", \"predict\", \"potential\", \"continue\", \"likely\", \"schedule\", \"objectives\", or the negative or grammatical variation thereof or other similar expressions concerning matters that are not historical facts. The forward-looking statements in this Press Release are subject to risks that may include, but are not limited to: our limited operating history in the cannabis and cannabinoids industry, including that of Pure Sunfarms, Corp. (“Pure Sunfarms”), Rose LifeScience Inc. (“Rose” or “Rose LifeScience”) and Balanced Health Botanicals, LLC (“Balanced Health”); the limited operational history of the Delta RNG Project in our energy segment and Leli Holland B.V. (\"Leli\"); the legal status of the cannabis business of Pure Sunfarms and Rose and the hemp business of Balanced Health and uncertainty regarding the legality and regulatory status of cannabis in the United States; risks relating to the integration of Balanced Health and Rose into our consolidated business; risks relating to obtaining additional financing on acceptable terms, including our dependence upon credit facilities and dilutive transactions; potential difficulties in achieving and/or maintaining profitability; variability of product pricing; risks inherent in the cannabis, hemp, CBD, cannabinoids, and agricultural businesses; our market position and competitive position; our ability to leverage current business relationships for future business involving hemp and cannabinoids; the ability of Pure Sunfarms and Rose to cultivate and distribute cannabis in Canada as well as exports; risks related to the start-up of international production at our Netherlands operations under Leli; existing and new governmental regulations, including risks related to regulatory compliance and regarding obtaining and maintaining licenses required under the Cannabis Act (Canada), the Criminal Code and other Acts, S.C. 2018, C. 16 (Canada) for its Canadian operational facilities, and changes in our regulatory requirements; legal and operational risks relating to expected conversion of our greenhouses to cannabis production in Canada and in the United States; risks related to rules and regulations at the U.S. Federal (Food and Drug Administration and United States Department of Agriculture), state and municipal levels with respect to produce and hemp, cannabidiol-based products commercialization; retail consolidation, technological advances and other forms of competition; transportation disruptions; product liability and other potential litigation; retention of key executives; labor issues; uninsured and underinsured losses; vulnerability to rising energy costs; inflationary effects on costs of cultivation and transportation; recessionary effects on demand of our products; environmental, health and safety risks, foreign exchange exposure, risks associated with cross-border trade and the potential for tariffs and other trade restrictions; difficulties in managing our growth; restrictive covenants under our credit facilities; natural catastrophes; elevated interest rates; and tax risks.\n\nThe Company has based these forward-looking statements on factors and assumptions about future events and financial trends that it believes may affect its financial condition, results of operations, business strategy and financial needs. Although the forward-looking statements contained in this Press Release are based upon assumptions that management believes are reasonable based on information currently available to management, there can be no assurance that actual results will be consistent with these forward-looking statements. Forward-looking statements necessarily involve known and unknown risks and uncertainties, many of which are beyond the Company's control, which may cause the Company's or the industry's actual results, performance, achievements, prospects and opportunities in future periods to differ materially from those expressed or implied by such forward-looking statements. These risks and uncertainties include, among other things, the factors contained in the Company's filings with securities regulators, including this Press Release and the Company’s most recently filed annual report on Form 10-K.\n\nWhen relying on forward-looking statements to make decisions, the Company cautions readers not to place undue reliance on these statements, as forward-looking statements involve significant risks and uncertainties and should not be read as guarantees of future results, performance, achievements, prospects and opportunities. The forward-looking statements made in this Press Release relate only to events or information as of the date on which the statements are made in this Press Release. Except as required by law, the Company undertakes no obligation to update or revise publicly any forward-looking statements, whether as a result of new information, future events or otherwise, after the date on which the statements are made or to reflect the occurrence of unanticipated events.",
  "medium": "Article",
  "links": [
    "https://www.globenewswire.com/Tracker?data=GzVG_vUMJFRucBCfh9LyxawglyjlLvnIbhDLcOHcPJLMhhGnkZlCQsX-NC1IL9atMC6bAVlRQM9NfrD4VM5gvA-uYfUn63JezjtLNiB9E5LCOQiy2nWmSvqkSfLVlpLzB2fzNgk1-QXuvH4yLmAFYUCs-nZmOedeNbV0H5cNuQ2TMyGyppoQDZw0UYeM4wjki8ysTs_nwiNjBH3RbZr1YqCVHQAodJ8kipXCxysyPj8iCQXR6uRMbGunvG85rxD1RfiyiIfl8gtTcNF2mC8B2g==",
    "https://www.globenewswire.com/Tracker?data=ySkOTKY8mTa2p895GE0PVPOe0bAnsquyZmwUX4ARjhDvMuUjAhhcZrjz0ZGueCvyTT8qu9A9AcWeM-XmhGb7iqxACgHYNNB0Tahb6ghmBxXnLv5bWbBu1YOyQJm5ASb-Jk4owlWMSIamgO48k7_DA1VT2JnsTgho0cph7IB1BNkS50WUQdTGXECdk7W08YPWrTE56MJ7lVMwXCDvIgBEeFroul39V0Bb9-f2l-MJ7ATeSF0v_pqNkpyQ_LrDWpZ_-39RyhYnawW8RfZ78TWIKg==",
    "https://www.globenewswire.com/Tracker?data=ySkOTKY8mTa2p895GE0PVJ3NvbJnfq0WOuuamc2p6Eyox8PP4ZE2dUihiaFzI7zAetIeVrO6A8UT9ZxNvT_5mPP0bw8EgHaOOGMgqojySLehP0eCx56G6F6I692r_r8ssPmPktWWYS-7JFWCI4LbHixv_e_vZshhCZULqGnQ0M6xKucAuJCQDpr1uRUol-UE",
    "https://www.globenewswire.com/Tracker?data=FJRQ6Ak5RyanThlHA5M_L9RrxRGzFLE7-_6Vjj6FDLUL8VZyGcrvYy3P6Vhj5dXunLiZSy93arg8LHtnTYYfSVawE-78Xz2pmpjFGBls2oWlvVndsdTkldbBPZXMwDIXirlpnyT2Kk2K9k5U-w3tjVn3Cpiy_tdEzSRGPGQMUHW6B317MNeoEmOJCLKzUY_zrYH_3-CxsNeG4NkDInXTTc53xVpAo0b2pMBCx9K54MYNYysruz3s7BRn8RCTbI99eEAHTWNv0Kt5comKtbiGZg==",
    "https://www.globenewswire.com/Tracker?data=PIFlnEaEFKV2GEuaaQzjNRg0jaQDKf_Id_xuG6QGr3LYdmyQXhn5m5wU0mLsY6bTUAj1z6louJhiqYAnY4hJOpn1Ihao2GK5wzSeOSnxztH8PN4mnxSC3lwFGOtW9XItXaGO0Kd4MYGJN02cpc1G7Q==",
    "https://www.globenewswire.com/Tracker?data=GzVG_vUMJFRucBCfh9LyxRlLpqwFucHh-i_JhHZSD4eHnDqWxql7BObgKRCYn6u5c2UTYbHMw1rxcwhba40loiRWsFRHKAPcSsZ7sXLkMxIIWXHMK8PnVJrm2T9KDbjsUbAkw3KpidBhHtxJXooORmtKvGOneva5Q5_DilB5t8nQwWufsZI-sllQVDrBwWgsh5eW6fl0mQD0Q3Ohz-fLSVkGS7kOCCK0MyRYwT4W9Z4=",
    "https://www.globenewswire.com/Tracker?data=ySkOTKY8mTa2p895GE0PVJ3NvbJnfq0WOuuamc2p6Eyox8PP4ZE2dUihiaFzI7zA4SvquBZEPmPk-4xLvmagmE0udpPtPukNl8rq_ZgjsLJSZXtmW42HxdF1ml2_gYC2qd4YDX-qMmHgfeYSChsExPjsC2i9bYRJRyaJ1QEgOG5FFawOkG1lQNTyBdq9oCt4G8smB7rJOZ7MkyTiLkcDMr1QxnIO1r_yJgdZzNYUNzY=",
    "https://www.globenewswire.com/Tracker?data=rMYY2xLe1wlMYZAWDDg5xYYe218wHWQzr4Ma2CCuWpZbs03m1jUWGr5nf6QCpRh-qlb8Q_dq5WT-Z4lkgjy5HhTWK6qPo5tn11qUvl7PO8zx0TNNunV0vNPISptq44Hpdcy9bmo2kbwbU0oF_j7pdrZxroaJXvk1gWAoCg0lSOI="
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "continuing produce operations",
      "weight": 0.06092745
    },
    {
      "name": "cannabis products",
      "weight": 0.06012361
    },
    {
      "name": "Second quarter performance",
      "weight": 0.05816504
    },
    {
      "name": "improved continuing produce operations",
      "weight": 0.057130292
    },
    {
      "name": "Company",
      "weight": 0.05680987
    },
    {
      "name": "Company estimates",
      "weight": 0.055424105
    },
    {
      "name": "Continuing Operations",
      "weight": 0.05446203
    },
    {
      "name": "continuing operations",
      "weight": 0.05446203
    },
    {
      "name": "cannabis production",
      "weight": 0.054172464
    },
    {
      "name": "Second quarter",
      "weight": 0.05229489
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.85107421875
    },
    {
      "name": "/Sensitive Subjects/Recreational Drugs",
      "score": 0.51611328125
    }
  ],
  "sentiment": {
    "positive": 0.8457031,
    "negative": 0.022613525,
    "neutral": 0.13195801
  },
  "summary": "Village Farms International, Inc. (NASDAQ: VFF) has reported record profits and performance from its continuing operations for the second quarter of 2025. The company's results were driven by the recent closing of its previously announced transaction to privatize certain assets and operations of its Produce segment. The transaction resulted in the formation of a new entity backed by private investment firms and the Company received $40 million in cash, subject to working capital adjustments, and common units representing a 37.9% equity ownership interest in Vanguard Food LP. As a result, operations which were privatized are now classified as discontinued operations and the reported financial results for comparative prior periods have been adjusted accordingly. Despite these challenges, the company remains optimistic about continued profitable growth in 2026 and beyond.",
  "shortSummary": "Village Farms International reported record profitability and increased global cannabis sales, driven by multiple catalysts including the recent acquisition of produce assets.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "35b7777aa353422689ea218dd1e91094",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Village Farms International, Inc. reported strong financial results for the second quarter of 2025, achieving record profitability and significant growth in international cannabis sales. The company closed a transformative transaction to privatize certain produce operations, receiving $40 million in cash and equity, which has allowed for a focus on higher-margin cannabis products. With a consolidated net income of $9.9 million and a 28.6% adjusted EBITDA margin, Village Farms is well-positioned for continued growth in both Canadian and international markets, leveraging its extensive greenhouse capacity and strategic investments.",
  "argos_id": "QGTP7PTFY"
}