{
  "url": "https://finance.yahoo.com/news/proficient-stock-under-siege-turns-234046034.html",
  "authorsByline": "John Kingston",
  "articleId": "970ae43ad6c14760bafd08fd93f4199a",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/freightwaves_373/600654cfc73a9249d2dc0b7068d52622",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T23:40:46+00:00",
  "addDate": "2025-08-11T23:48:40.327488+00:00",
  "refreshDate": "2025-08-11T23:48:40.327489+00:00",
  "score": 1.0,
  "title": "Proficient, its stock under siege, turns in solid numbers for the second quarter",
  "description": "Proficient Auto Logistics’ stock has been sliding for months but its second quarter numbers were sequentially better. The post Proficient, its stock under siege, turns in solid numbers for the second quarter appeared first on FreightWaves.",
  "content": "Even as the stock of Proficient Auto Logistics was getting hammered for the quarter and then some–dropping about 34% from early April to Monday’s close at $5.97–the auto hauler racked up several performance metrics during those three months that were solidly above that of the first three months of the year.\n\nAmong the key numbers at Proficient (NASDAQ: PAL), its operating ratio came in at 96.7%. While that is far worse than the 91.8% recorded in the second quarter of 2024, it marked a sequential improvement of 200 bps from the 98.7% it posted for the first quarter.\n\nThat improved OR helped lead the company to an adjusted operating income of $3.8 million for the quarter, an improvement sequentially from the $1.2 million recorded in the first quarter. But the year-on-year comparisons were not positive; the company had adjusted operating income in the second quarter of 2024 of $8.7 million.\n\nCEO Rick O’Dell, who on the company’s first quarter earnings call had spoken of late quarter strength in the market (possibly the first signs of the impact from the Jack Cooper closure), said that stronger trend continued into April, resulting in record revenue for Proficient (which admittedly has only been around since May 2024). Revenue and unit volumes for the month were up 13% and 25%, respectively, though the comparisons were impacted by Proficient acquisitions in August 2024 (Auto Transport Group) and at the start of this year’s second quarter (Brothers Transport).\n\nBut the strength has continued, O’Dell said. Between the impact of the Brothers acquisitionand gains in market share that may have been bolstered by the collapse of auto hauler Jack Cooper–though O’Dell did not specifically reference the company–O’Dell said “June did not decelerate from May, and revenue performance finished above our expectations for the combined May and June months.”\n\nSequential comparisons have been highlighted by several companies this quarter. Year-on-year comparisons were always going to be negative, and the market is looking for some signs of life from the freight market.\n\nProficient’s volume almost certainly got a significant boost from the first quarter closure of Jack Cooper.\n\nProficient delivered 220,758 vehicles in the quarter while its subhaulers moved 401,848 vehicles. A year ago, the corresponding numbers were 152,714 and 354,998, respectively. In the first quarter of this year, when the Jack Cooper shutdown would have first been hitting the market, the numbers were 163,754 and 330,755.\n\nOne metric that was not a positive for Proficent in the quarter was its measurement of yield, revenue per unit on company deliveries. It was $178.82 in the second quarter, down 15.8% from a year earlier when the figure was $212.25. It was also down 3.5% sequentially.",
  "medium": "Article",
  "links": [
    "https://www.freightwaves.com/news/in-3-months-jack-cooper-went-from-discussing-new-funding-to-closing-its-doors",
    "https://www.freightwaves.com/news/auto-hauler-proficient-grows-with-acquisition-of-pennsylvania-company",
    "https://www.freightwaves.com/news/2-markets-in-1-quarter-auto-hauling-demand-volatile-for-proficient",
    "https://finance.yahoo.com/quote/PAL/",
    "https://www.freightwaves.com/news/ceo-leathers-says-werner-acting-decisively-after-red-ink-quarter"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "first quarter",
      "weight": 0.13082527
    },
    {
      "name": "late quarter",
      "weight": 0.11494053
    },
    {
      "name": "late quarter strength",
      "weight": 0.11308946
    },
    {
      "name": "auto hauler Jack Cooper",
      "weight": 0.09609495
    },
    {
      "name": "several companies",
      "weight": 0.09055037
    },
    {
      "name": "Proficient Auto Logistics",
      "weight": 0.08959505
    },
    {
      "name": "Jack Cooper",
      "weight": 0.08810015
    },
    {
      "name": "Proficient acquisitions",
      "weight": 0.08411619
    },
    {
      "name": "adjusted operating income",
      "weight": 0.08378742
    },
    {
      "name": "company deliveries",
      "weight": 0.08233133
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Auto"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.990234375
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.921875
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.9111328125
    }
  ],
  "sentiment": {
    "positive": 0.6864446,
    "negative": 0.22925751,
    "neutral": 0.08429795
  },
  "summary": "Proficient Auto Logistics, a company that has seen its stock drop by 34% from early April to its close at $5.97, reported solid second quarter results, with its operating ratio at 96.7%, a sequential improvement of 200 bps from the 98.7% posted for the first quarter. This led to an adjusted operating income of $3.8 million for the quarter, an improvement sequentially from the $1.2 million recorded in the same period. However, the company's year-on-year comparisons were not positive. Proficient delivered 220,758 vehicles in the quarter while its subhaulers moved 401,848 vehicles. The company's revenue and unit volumes for the month were up 13% and 25%, respectively.",
  "shortSummary": "Proficient Auto Logistics reported strong second quarter performance, despite a 34% drop, with improved operating margins and increased vehicle sales despite year-on-year comparisons.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "c6f4453c48cd4078a3160184b043452a",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://finance.yahoo.com/quote/PAL/",
      "text": "Proficient Auto Logistics, Inc. (PAL)\n- Previous Close\n6.05 - Open\n6.11 - Bid 5.89 x 100\n- Ask 6.03 x 100\n- Day's Range\n5.88 - 6.54 - 52 Week Range\n5.88 - 20.85 - Volume\n143,011 - Avg. Volume\n167,551 - Market Cap (intraday)\n161.603M - Beta (5Y Monthly) --\n- PE Ratio (TTM)\n-- - EPS (TTM)\n-0.06 - Earnings Date Aug 11, 2025\n- Forward Dividend & Yield --\n- Ex-Dividend Date --\n- 1y Target Est\n13.67\nProficient Auto Logistics, Inc. focuses on providing auto transportation and logistics services in North America. It primarily focuses on transporting and delivering finished vehicles from automotive production facilities, ports of entry, and rail yards to a network of automotive dealerships. The company operates approximately 1,145 auto transport vehicles and trailers, including 845 company-owned transport vehicles and trailers. It serves auto companies, electric vehicle producers, auto dealers, auto auctions, rental car companies, and auto leasing companies. The company was formerly known as AH Acquisition Corp. and changed its name to Proficient Auto Logistics, Inc. in October 2023. The company was incorporated in 2023 and is headquartered in Jacksonville, Florida.\nwww.proficientautologistics.comRecent News: PAL\nView MorePerformance Overview: PAL\nTrailing total returns as of 8/11/2025, which may include dividends or other distributions. Benchmark is S&P 500 (^GSPC) .\nYTD Return\n1-Year Return\n3-Year Return\n5-Year Return\nCompare To: PAL\nSelect to analyze similar companies using key performance metrics; select up to 4 stocks.\nStatistics: PAL\nView MoreValuation Measures\nMarket Cap\n163.77M\nEnterprise Value\n242.87M\nTrailing P/E\n--\nForward P/E\n15.13\nPEG Ratio (5yr expected)\n1.01\nPrice/Sales (ttm)\n--\nPrice/Book (mrq)\n0.49\nEnterprise Value/Revenue\n--\nEnterprise Value/EBITDA\n--\nFinancial Highlights\nProfitability and Income Statement\nProfit Margin\n-3.38%\nReturn on Assets (ttm)\n--\nReturn on Equity (ttm)\n--\nRevenue (ttm)\n336.06M\nNet Income Avi to Common (ttm)\n-11.36M\nDiluted EPS (ttm)\n-0.06\nBalance Sheet and Cash Flow\nTotal Cash (mrq)\n10.91M\nTotal Debt/Equity (mrq)\n26.79%\nLevered Free Cash Flow (ttm)\n--"
    }
  ],
  "argos_summary": "Proficient Auto Logistics experienced a 34% drop in stock price but reported improved performance metrics in the second quarter, including an adjusted operating income of $3.8 million, up from $1.2 million in the first quarter. The company's operating ratio improved to 96.7%, although it was worse than the previous year's 91.8%. Revenue and unit volumes increased by 13% and 25% respectively in April, likely benefiting from the closure of competitor Jack Cooper. However, yield per unit decreased by 15.8% year-over-year.",
  "argos_id": "QR7PT8AJJ"
}