{
  "url": "https://www.benzinga.com/trading-ideas/movers/25/08/47042046/whats-going-on-with-monday-com-shares-on-monday",
  "authorsByline": "Vaishali Prayag",
  "articleId": "c7f90b0743df46a9b42ac9ab3089b450",
  "source": {
    "domain": "benzinga.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "MI",
      "county": "Wayne County",
      "city": "Detroit",
      "coordinates": {
        "lat": 42.3315509,
        "lon": -83.0466403
      }
    }
  },
  "imageUrl": "https://cdn.benzinga.com/files/images/story/2025/08/11/Konskie--Poland---May-11--2024-Monday-co_2.jpeg?width=1200&height=800&fit=crop",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T15:14:39-04:00",
  "addDate": "2025-08-11T20:56:26.893655+00:00",
  "refreshDate": "2025-08-11T20:56:26.893659+00:00",
  "score": 1.0,
  "title": "What's Going On With Monday Shares On Monday? - Monday.Com (NASDAQ:MNDY)",
  "description": "Monday Ltd. (NASDAQ: MNDY) shares are volatile Monday after the company reported second-quarter 2025 results.",
  "content": "Monday.com Ltd. MNDY shares are volatile Monday after the company reported second-quarter 2025 results.\n\nWhat To Know: The software company posted revenue of $299 million, up 27% year over year, driven by strong demand from enterprise customers and growth in its customer base. The company also added a record number of net new customers generating over $100,000 in annual recurring revenue (ARR), while its monday CRM product reached $100 million in ARR just three years after launch.\n\nDespite the revenue growth, profitability metrics were mixed. On a non-GAAP basis, operating income was $45.1 million, up from $38.4 million a year ago, but the operating margin slipped to 15% from 16%.\n\nThe number of paying customers with more than 10 users rose 8% to 61,803. Large customers also grew sharply, with those generating over $50,000 in ARR up 36% and those over $100,000 in ARR up 46% from the prior year. Net dollar retention rates remained strong, reaching 117% for customers spending more than $100,000 annually.\n\nManagement highlighted that AI-driven capabilities are becoming a core part of the company's strategy. \"We continue to see evidence that our commitment to AI innovation is delivering real value for customers,\" said co-CEOs Roy Mann and Eran Zinman.\n\nLooking ahead, Monday.com expects third-quarter revenue of $311 million to $313 million, representing 24% to 25% growth. For the full year, the company projects revenue of $1.224 billion to $1.229 billion.\n\nMNDY Price Action: Monday.com shares were down 26.5% at $182.2 at the time of writing, according to Benzinga Pro.",
  "medium": "Article",
  "links": [
    "http://www.benzinga.com/pro/register/?utm_source=BZprocontent071824&t=be2bearmibe3na1",
    "https://www.benzinga.com/pressreleases/25/08/b47026517/monday-com-announces-second-quarter-2025-results",
    "https://www.benzinga.com/markets/equities/25/08/47037982/markets-today-wall-street-monday-intel-bitcoin-trump-nvidia-amd"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "net new customers",
      "weight": 0.108153485
    },
    {
      "name": "enterprise customers",
      "weight": 0.10522636
    },
    {
      "name": "paying customers",
      "weight": 0.10308756
    },
    {
      "name": "customers",
      "weight": 0.102184355
    },
    {
      "name": "Large customers",
      "weight": 0.10170111
    },
    {
      "name": "annual recurring revenue",
      "weight": 0.090179846
    },
    {
      "name": "Monday Shares",
      "weight": 0.08720601
    },
    {
      "name": "year",
      "weight": 0.086931325
    },
    {
      "name": "co-CEOs Roy Mann",
      "weight": 0.08306307
    },
    {
      "name": "revenue",
      "weight": 0.082848586
    }
  ],
  "topics": [
    {
      "name": "Stocks"
    },
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.9560546875
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.955078125
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.9326171875
    }
  ],
  "sentiment": {
    "positive": 0.12311349,
    "negative": 0.8043703,
    "neutral": 0.07251618
  },
  "summary": "Monday.com Ltd. shares have fluctuated following the company's second-quarter results, with shares falling 26.5% to $182.2. The company posted revenue of $299 million, up 27% year over year, driven by strong demand from enterprise customers and growth in its customer base. Despite mixed profitability metrics, operating income was $45.1 million on a non-GAAP basis, but the operating margin slipped to 15% from 16%. The company added a record number of net new customers generating over $100,000 in annual recurring revenue (ARR), while its CRM product reached $100 million in ARR three years after launch.",
  "shortSummary": "Monday.com's shares fell nearly 30% after reporting a 27% revenue increase, with mixed profitability and strong customer retention.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "d2718583d7954f59a85909a6d54a960b",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.benzinga.com/markets/equities/25/08/47037982/markets-today-wall-street-monday-intel-bitcoin-trump-nvidia-amd",
      "text": "- US stocks traded flat as investors awaited July CPI data and the Trump-Putin meeting in Alaska.\n- Intel jumped 6% on CEO’s planned White House meeting to discuss government collaboration.\n- The next 100%+ earnings move could hit this month. See how to find it live on Wednesday →\nU.S. equities opened the week with little momentum as traders kept risk-taking in check ahead of a packed economic and geopolitical calendar. Tuesday brings the release of July's inflation report, with economists expecting both headline and core annual inflation to tick higher to 2.9% and 3%, respectively.\n- MAGS ETF is moving fast. Check the chart here.\nLater in the week, attention will shift to Friday's high-profile meeting between President Donald Trump and Russian President Vladimir Putin in Alaska.\nBy midday in New York, the S&P 500 and Nasdaq 100 posted modest gains, while the Dow Jones Industrial Average remained flat.\nIn the semiconductor space, Trump confirmed that Nvidia Corp. NVDA and Advanced Micro Devices Inc. AMD will pay a 15% fee to the U.S. government on chip exports to China in exchange for export licenses.\nAMD climbed 2.5% and Nvidia edged up 0.3%. Intel Corp. INTC jumped 6% after CEO Lip-Bu Tan scheduled a meeting with Trump to discuss potential collaboration with the federal government.\nTrump also announced measures to address crime in Washington, DC, announcing a public safety emergency that will see 800 National Guard troops deployed to the capital, with the possibility of expanding the plan to other cities.\nOn currency markets, the US dollar strengthened, with the dollar index up 0.3%. Commodities traded broadly lower, with gold sliding 1.63% to $3,345 and silver down 1.5% to $37.73.\nIn crypto, Bitcoin BTC/USD rebounded 1.2% to $120,000 after retreating from $122,300 hit during the weekend, staying within striking distance of its mid-July record high of $123,236.\nMonday’s Performance In Major US Indices, ETF\n| Major Indices | Price | Chg % |\n| Nasdaq 100 | 23,700.96 | +0.4% |\n| Russell 2000 | 2,225.23 | +0.3% |\n| S&P 500 | 6,407.33 | +0.3% |\n| Dow Jones | 44,188.97 | 0.0% |\nAccording to Benzinga Pro data:\n- The Vanguard S&P 500 ETF VOO inched 0.2% up to $586.91.\n- The SPDR Dow Jones Industrial Average DIA flattened at $441.63.04.\n- The tech-heavy Invesco QQQ Trust Series QQQ rose 0.3% to $576.22.\n- The iShares Russell 2000 ETF IWM gained 0.3% to $220.84\n- The Consumer Discretionary Select Sector SPDR Fund XLY outperformed, up 0.7%; the Energy Services Select Sector SPDR Fund XLY lagged, down 0.7%.\nMonday’s Stock Movers\n- Albemarle Corp. ALB rallied 8% after a major lithium mine halted operations in China.\n- Micron Technology Inc. MU rose 3% after the company hiked its four-quarter revenue guidance to $11.2 billion, up from $10.7 billion.\n- Ford Motor Co. F fell 2% after unveiling plans to launch a new line of affordable EVs in 2027, including a midsize pickup starting at $30,000.\n- e.l.f. Beauty Inc. ELF rallied 9% after Morgan Stanley upgraded the stock to overweight and lifted its price target from $114 to $134.\nNow Read:\nImage: Shutterstock\nEdge Rankings\nPrice Trend\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
      "url": "http://www.benzinga.com/pro/register/?utm_source=BZprocontent071824&t=be2bearmibe3na1",
      "text": "Benzinga Pro\nJoin 6,000+ traders who get up to a 30-minute head start on market-moving events with tools, insights, and an active community to back you up\nJoin Benzinga Pro FREE for 14 days. You'll get lightning-fast alerts, expert tools, and live trainings without risking a penny.\nBenzinga Pro delivers the tools, insights, and speed you need to make profitable trades alongside your schedule. It's the best-value solution available for all types of traders.\ncharge thousands for personalized advice that may not be as timely or actionable as Benzinga Pro's insights.\ncost hundreds or even thousands of dollars, but they lack the real-time news and community aspect that Benzinga Pro offers.\nlike scanners, calendars, and news feeds can easily add up to a monthly cost exceeding the price of Benzinga Pro.\nYet, you get all of this and more for a full year at a fraction of the cost! And the best part?\nYou can try it for 14 days with our no-risk guarantee.\nAt Benzinga, we're committed to your trading success.\nThat’s why we're giving you three choices today to join Benzinga Pro in the way that fits you best.\nMost traders see the difference within days. Some may see it sooner, others might take a bit longer. Everyone's trading journey is different. That's why we encourage you to give Benzinga Pro a try. If you don't feel like you're making smarter, faster trading decisions, simply reach out and get your money back. Ready to Experience the Benzinga Pro Advantage?\nBenzinga Pro delivers the tools, insights, and speed you need to\nmake profitable trades alongside your schedule\nBenzinga Pro analysts use historical context related to news items to help anticipate the direction or degree of a price move.\nCommunity\nThe chatroom is for traders of any level—whether you have decades of experience or just starting out. Ask questions, find trading ideas, share news and developments, and more!\n7 Channels Total:\nIncluding special lounges for crypto traders and day traders!\nWith a Pro membership you get exclusive access to Anne-Marie's trading room. See what she's trading in real time, her market insights, and technical analysis. This trading room alone can help you pay for your Pro membership!\nLive Q&A Sessions with Anne-Marie Baiynd\nGet direct access to the mind of a trading master. Join live Zoom calls with Anne-Marie Baiynd, a 20-year veteran trader renowned for her unique blend of mathematical prowess and deep understanding of trading psychology.\nExclusive News\nBe the FIRST to know about market-moving events. We work directly with insiders to deliver exclusive news on earnings, M&A deals, drug trials, and more. While others react, you profit.\nProven Results:\nMembers received an exclusive news release for Vivani Medical (VANI)…\n30 minutes before it doubled!\n\"What was most important wasn't knowing the future - it was knowing how to react appropriately to the information available at each point in time.\"\nRay Dalio\nFounder of Bridgewater Associates, the largest hedge fund in the world.\nAudio Squawk\nOur LIVE Audio Squawk keeps you informed, no matter where you are. It’s multitasking for maximum profits. Get breaking news read aloud, freeing your eyes for charts and analysis.\nPlease click below to listen to a sample\nReal Success Story\nRyan Faloona was in another room, and he had just bought Apple. Then the price moved down from his buy. He thought maybe he should sell and wait to get back in at a better price.\nThen, he heard the squawk\n“Apple to join the Dow!”\nHe felt better about his hold…\nand hasn't sold it since!\n“I can be on the beach and I can use Benzinga Pro to set alerts to find what I’m going to trade on Monday morning.\nI mean, it’s just, it’s just incredible. It really is.\nYou don’t find this kind of information as a retail trader or a guy learning to get into the market anywhere else.”\n“You need live feed! And I was getting delayed information [with other companies].\nEven though I was well informed I was still not able to trade as well as I should until I got Benzinga Pro.”\n“[…] Benzinga Pro is a great tool to sharpen a beginner.”\n“[…] if I wanted to know the things first, this [Benzinga Pro] was the place to be.”\n“It really comes down to the community in Benzinga Pro.\nOne first things I noticed was the intelligence level in the small chat window that comes with Benzinga Pro.”\nMovers\nNo more scrambling to figure out what's hot. With a few clicks, you’ll have a shortlist of potential plays. When a stock sees dramatic price action over a selected duration, the stock will automatically appear on Movers.\nExpert Tip:\nYou can have more than 1 Movers tool. Some users set one for gainers and the other for losers.\nThis gives you TWICE as many results.\nCalendar\nThis is the easiest way to see what’s going to happen to stocks you’re watching. Find crucial dividend dates, analyst upgrades, earnings, historical data, and more with just a quick glance!\nChoose From Over 12 Calendars:\nSeparate the noise and find exactly what you want.\nScanner & Screener\nUse filters like price, market cap, volume, float, relative volume, and short interest to fit your trading style. Freeze your stock list or choose a refresh rate. Plus, export your list to a CSV file!\nPresets Included:\nOverall Gainers, 5-Minute Movers, Mid-Cap Movers From Open, Real-Time After Hours Gainers, and Large-Cap Gainers\nSignals\nThe fastest way to know about price spikes, options activity, block trades, halt/resumes, opening gaps, or highs and lows. Fine-tune your alerts even more by choosing your own filters.\nCustom Notifications:\nReceive a browser pop-up, a sound alert, or a synthesized voice.\nDiscover Benzinga Pro’s simple system for generating triple-digit trading ideas\nJoin thousands of satisfied members and harness the power and speed of Benzinga Pro Today!\nThe most amazing...\nHonestly, the most amazing platform I’ve been using since I’ve started day trading. I love how fast the news gets updated so i don’t have to go searching for more sources. Kept me out of GNUS when it dropped from 1.40 to .70 due to reverse split. Would def reccomend.\nby Jason Mcneir\nRated 4.5/5 | 155 reviews\nA MUST HAVE...\nby LKTrader\nRated 4.5/5 | 155 reviews\nHow is it so fast?!...\nBenzinga Pro is hands down the BEST tool for day traders, option traders and anyone who is looking to profit from the market! The platform is easy to use, so many customizable feautures, and the newsfeed is FAST and ACCURATE! THANK YOU SO MUCH to everyone that works at Benzinga!\nby Jason Mcneir\nRated 4.5/5 | 155 reviews\nBest of the Best...\nVery high quality service for trading. This is likely a must-have as far as I can tell after sampling about 8 different platforms in depth.\nby Serena Bernstein\nRated 4.5/5 | 155 reviews\nI Can't Go Back...\n“I would not want to trade without Benzinga Pro. The SQWAUK, the instant news availability, the level of detail you can access quickly, and continuous updating of features are all excellent.”\nby Emily\nRated 4.5/5 | 155 reviews\nThe most amazing...\nCan’t do without it. Benzinga and a cup of coffee are your friends in the early morning of the premarket as you get ready for battle!\nby Jason Mcneir\nRated 4.5/5 | 155 reviews"
    },
    {
      "url": "https://www.benzinga.com/pressreleases/25/08/b47026517/monday-com-announces-second-quarter-2025-results",
      "text": "Second quarter revenue of $299.0 million grew 27% year over year\nAdded a record number of net new customers with over $100k in ARR\nmonday CRM recently reached $100 million in ARR\nmonday.com MNDY today reported financial results for its second quarter ended June 30, 2025.\nManagement Commentary:\n\"Q2 marked another strong quarter for monday.com, with continued revenue growth and rapidly growing demand for our broad product suite, particularly from enterprise customers,\" said monday.com co-founders and co-CEOs Roy Mann and Eran Zinman. \"We continue to see evidence that our commitment to AI innovation is delivering real value for customers, and we're proud to be leading a new era of work execution. By taking the platform's flexibility to the next level, our new AI capabilities address core challenges across all our product areas and allow users to focus on their most critical strategic priorities.\"\n\"This quarter demonstrated our relentless focus on driving highly efficient growth at scale, and I'm energized by the momentum in our business and the opportunities we see ahead,\" said Eliran Glazer, monday.com CFO. \"As we navigate the shifting landscape, we remain focused on the factors we can control – executing on our innovation roadmap, bolstering our go-to-market efforts to serve customers of all sizes, driving best-in-class operational efficiencies, and delivering products people love.\"\nSecond Quarter Fiscal 2025 Financial Highlights:\n- Revenue was $299.0 million, an increase of 27% year-over-year.\n- GAAP operating loss was $11.6 million compared to GAAP operating income of $1.8 million in the second quarter of 2024; GAAP operating margin was negative 4% compared to 1% in the second quarter of 2024.\n- Non-GAAP operating income was $45.1 million compared to $38.4 million in the second quarter of 2024; non-GAAP operating margin was 15%, compared to 16% in the second quarter of 2024.\n- GAAP basic and diluted net income per share was $0.03, compared to GAAP basic and diluted net income per share of $0.29 and $0.27, respectively, in the second quarter of 2024; non-GAAP basic and diluted net income per share was $1.13 and $1.09, respectively, compared to non-GAAP basic and diluted net income per share of $0.99 and $0.94, respectively, in the second quarter of 2024.\n- Net cash provided by operating activities was $66.8 million, with $64.1 million of adjusted free cash flow, compared to net cash provided by operating activities of $55.8 million and $50.8 million of adjusted free cash flow in the second quarter of 2024.\nRecent Business Highlights:\n- Net dollar retention rate was 111%.\n- Net dollar retention rate for customers with more than 10 users was 115%.\n- Net dollar retention rate for customers with more than $50,000 in ARR was 116%.\n- Net dollar retention rate for customers with more than $100,000 in ARR was 117%.\n- The number of paid customers with more than 10 users was 61,803, up 8% from 57,203 as of June 30, 2024.\n- The number of paid customers with more than $50,000 in ARR was 3,702, up 36% from 2,713 as of June 30, 2024.\n- The number of paid customers with more than $100,000 in ARR was 1,472, up 46% from 1,009 as of June 30, 2024.\n- Appointed Harris Beber as Chief Marketing Officer.\n- Appointed Adi Dar as Chief Customer Officer.\n- monday CRM recently reached $100 million in ARR, just three years since launch.\n- Announced three new AI-powered capabilities - monday magic, monday vibe, and monday sidekick.\nFinancial Outlook:\nFor the third quarter of fiscal year 2025, monday.com currently expects:\n- Total revenue of $311 million to $313 million, representing year-over-year growth of 24% to 25%.\n- Non-GAAP operating income of $34 million to $36 million and operating margin of 11% to 12%.\nFor the full year 2025, monday.com currently expects:\n- Total revenue of $1,224 million to $1,229 million, representing year-over-year growth of approximately 26%.\n- Non-GAAP operating income of $154 million to $158 million and operating margin of approximately 13%.\n- Adjusted free cash flow of $320 million to $326 million and adjusted free cash flow margin of 26% to 27%.\nNon-GAAP Financial Measures:\nThis press release and the accompanying tables contain the following non-GAAP financial measures: non-GAAP gross profit, non-GAAP gross margin, non-GAAP sales and marketing expenses, non-GAAP research and development expenses, non-GAAP general and administrative expenses, non-GAAP operating income, non-GAAP operating margin, non-GAAP net income, non-GAAP net income per share, adjusted free cash flow, which is defined as free cash flow plus costs associated with the built-out and expansion of our corporate headquarters and adjusted free cash flow margin. Certain of these non-GAAP financial measures exclude share-based compensation.\nmonday.com believes that these non-GAAP financial measures provide useful information to management and investors regarding certain financial and business trends relating to monday.com's financial condition and results of operations. monday.com management uses these non-GAAP measures to compare monday.com performance to that of prior periods, for trend analysis and for budgeting and planning purposes. monday.com believes that the use of these non-GAAP financial measures provides an additional tool for investors to use in evaluating ongoing operating results and trends and in comparing monday.com financial results to the results of other software companies, many of which present similar non-GAAP financial measures to investors. The non-GAAP financial information is presented for supplemental informational purposes only and should not be considered a substitute for financial information presented in accordance with GAAP and may be different from similarly titled non-GAAP measures used by other companies.\nManagement does not consider these non-GAAP measures in isolation or as an alternative to financial measures determined in accordance with GAAP. The principal limitation of these non-GAAP financial measures is that they exclude significant expenses and income that are required by GAAP to be recorded in monday.com financial statements. In addition, they are subject to inherent limitations as they reflect the exercise of judgment by management about which expenses and income are excluded or included in determining these non-GAAP financial measures.\nReconciliation tables of the most directly comparable GAAP financial measures to the non-GAAP financial measures used in this press release are included with the financial tables at the end of this release. monday.com urges investors to review these reconciliation tables and not to rely on any single financial measure to evaluate the monday.com business. Management is not able to forecast GAAP operating income (loss) on a forward-looking basis without unreasonable efforts due to the high variability and difficulty in predicting share-based compensation expense, the amounts of which may be significant in future periods. Management is not able to forecast GAAP net cash provided by operating activities on a forward-looking basis without unreasonable efforts due to the high variability and difficulty in predicting property and equipment purchases and capitalized software costs, the amounts of which may be significant in future periods.\nDefinitions of Business Key Performance Indicators\nNet Dollar Retention Rate\nWe calculate Net Dollar Retention Rate as of a period end by starting with the ARR from customers as of the 12 months prior to such period end (\"Prior Period ARR\"). We then calculate the ARR from these customers as of the current period end (\"Current Period ARR\"). The calculation of Current Period ARR includes any upsells, contraction and attrition. We then divide the total Current Period ARR by the total Prior Period ARR to arrive at the Net Dollar Retention Rate. For the trailing 12-month calculation, we take a weighted average of this calculation of our quarterly Net Dollar Retention Rate for the four quarters ending with the most recent quarter.\nAnnual Recurring Revenue (\"ARR\")\nIs defined to mean, as of the measurement date, the annualized value of our customer subscription plans assuming that any contract that expires during the next 12 months is renewed on its existing terms.\nForward-Looking Statements:\nThis press release contains \"forward-looking statements\" within the meaning of the \"safe harbor\" provisions of the Private Securities Litigation Reform Act of 1995, including but not limited to, statements regarding our financial outlook and market positioning. These forward-looking statements are made as of the date they were first issued and were based on current expectations, estimates, forecasts and projections as well as the beliefs and assumptions of management. Words such as \"outlook,\" \"guidance,\" \"expect,\" \"anticipate,\" \"should,\" \"believe,\" \"hope,\" \"target,\" \"project,\" \"plan,\" \"goals,\" \"estimate,\" \"potential,\" \"predict,\" \"may,\" \"will,\" \"might,\" \"could,\" \"intend,\" \"shall\" and variations of these terms or the negative of these terms and similar expressions are intended to identify these forward-looking statements. Forward-looking statements are subject to a number of risks and uncertainties, many of which involve factors or circumstances that are beyond monday.com control. monday.com's actual results could differ materially from those stated or implied in forward-looking statements due to a number of factors, including but not limited to our ability to effectively manage the scope and complexity of our business following years of rapid growth and our ability to maintain profitability; foreign currency exchange rate fluctuations; the fact that we continue to derive a majority of revenues from monday work management; fluctuations in operating results; real or perceived errors, failures, vulnerabilities or bugs in our platform, products or third-party applications offered in our app marketplace or interruptions or performance problems in the technology or infrastructure underlying our platform; risks related to artificial intelligence and machine learning; our ability to attract customers, grow our retention rates and expand usage within organizations, including cross-selling and upselling; risks related to our subscription-based business model; our sales efforts may require considerable time and expense and the use of differing sales strategies may extend our sales cycles; changes in sizes or types of business that purchase our platform and products; our ability to offer high-quality customer support and consistent sales strategies; maintenance of corporate culture; risks related to international operations and compliance with laws and regulations applicable to our global operations; risks related to acquisitions, strategic investments, partnerships, or alliances; risks associated with environmental and social responsibility and climate change; our dependence on key employees and ability to attract and retain highly skilled employees; our ability to raise additional capital or generate cash flows necessary to grow our business; uncertain global economic conditions and inflation; changes and competition in the market and software categories in which we participate; our ability to introduce new products, features, integrations, capabilities, and enhancements; the ability of our platform to interoperate with a variety of software applications; our reliance on third-party application stores to distribute our mobile application; our successful strategic relationships with, and our dependence on third parties; our reliance on traditional web search engines to direct traffic to our website; interruption or delays in service from third parties or our inability to plan and manage interruptions; risks related to security disruptions, unauthorized system access; evolving privacy protection and data security laws, regulations, industry standards, policies, contractual obligations, and cross-border data transfer or localization restrictions; new legislation and regulatory obligations regulating AI; changes in tax law and regulations or if we were to be classified as a passive foreign investment company; our ability to maintain, protect or enforce our intellectual property rights or intellectual property infringement claims; risks related to our use of open-source software; risks related to our founder share that provides certain veto rights; risks related to our status as a foreign private issuer incorporated and located in Israel, including risks related to the ongoing war between Israel and Hamas and escalations thereof; our expectation not to pay dividends for the foreseeable future; risks related to our Digital Lift Initiative and the monday.com Foundation; risks related to legal and regulatory matters; and other factors described in \"Risk Factors\" in our Annual Report on Form 20-F for the year ended December 31, 2024, filed with the SEC on March 17, 2025. Further information on potential risks that could affect actual results will be included in the subsequent filings that monday.com makes with the Securities and Exchange Commission from time to time.\nPast performance is not necessarily indicative of future results. The forward-looking statements included in this press release represent monday.com's views as of the date of this press release. monday.com anticipates that subsequent events and developments will cause its views to change. monday.com undertakes no intention or obligation to update or revise any forward-looking statements, whether as a result of new information, future events, or otherwise. These forward-looking statements should not be relied upon as representing monday.com's views as of any date subsequent to the date of this press release.\nEarnings Webcast:\nmonday.com will hold a public webcast at 8:30 a.m. ET today to discuss the results for its second quarter 2025 and financial outlook. The live call may also be accessed via telephone at +1 (646) 968-2525 or +1 (888) 596-4144 (toll-free). Please reference conference ID: 1347415. An archived webcast can be accessed from the News & Events section of monday.com's Investor Relations website following the call.\nInvestor Presentation Details:\nAn investor presentation providing additional information can be found at http://ir.monday.com.\nAbout monday.com:\nmonday.com is a global software company that builds products people love to manage the core of their work. Our product suite can adapt to the needs of diverse industries and use cases within one powerful platform. Our ~245,000 customers are reimagining how work gets done, driving greater efficiency, and scaling like never before. For more information, visit monday.com.\nMONDAY.COM LTD\n|\n|||||||||||||||\n(U.S. dollars in thousands, except share and per share data) |\n|||||||||||||||\n|\n|\n||||||||||||||\n|\nThree months ended June 30, |\n|\nSix months ended June 30, |\n||||||||||||\n|\n2025 |\n|\n2024 |\n|\n2025 |\n|\n2024 |\n||||||||\n|\n|\n(unaudited) |\n|\n(unaudited) |\n|||||||||||\nRevenue |\n$ |\n299,014 |\n|\n$ |\n236,106 |\n|\n$ |\n581,264 |\n|\n$ |\n453,019 |\n|\n|||\nCost of revenue |\n|\n31,173 |\n|\n|\n23,763 |\n|\n|\n59,978 |\n|\n|\n47,217 |\n|\n|||\nGross profit |\n|\n267,841 |\n|\n|\n212,343 |\n|\n|\n521,286 |\n|\n|\n405,802 |\n|\n|||\nOperating expenses: |\n|\n|\n|\n|\n|\n|\n|\n|\n|||||||\nResearch and development |\n|\n87,039 |\n|\n|\n50,445 |\n|\n|\n156,424 |\n|\n|\n94,868 |\n|\n|||\nSales and marketing |\n|\n152,590 |\n|\n|\n131,471 |\n|\n|\n294,310 |\n|\n|\n259,612 |\n|\n|||\nGeneral and administrative |\n|\n39,763 |\n|\n|\n28,633 |\n|\n|\n72,307 |\n|\n|\n54,550 |\n|\n|||\nTotal operating expenses |\n|\n279,392 |\n|\n|\n210,549 |\n|\n|\n523,041 |\n|\n|\n409,030 |\n|\n|||\nOperating income (loss) |\n|\n(11,551 |\n) |\n|\n1,794 |\n|\n|\n(1,755 |\n) |\n|\n(3,228 |\n) |\n|||\nFinancial income, net |\n|\n14,102 |\n|\n|\n14,850 |\n|\n|\n31,749 |\n|\n|\n27,689 |\n|\n|||\nIncome before income taxes |\n|\n2,551 |\n|\n|\n16,644 |\n|\n|\n29,994 |\n|\n|\n24,461 |\n|\n|||\nIncome tax expense |\n|\n(978 |\n) |\n|\n(2,329 |\n) |\n|\n(996 |\n) |\n|\n(3,068 |\n) |\n|||\nNet income |\n$ |\n1,573 |\n|\n$ |\n14,315 |\n|\n$ |\n28,998 |\n|\n$ |\n21,393 |\n|\n|||\nNet income per share attributable to ordinary shareholders, basic |\n$ |\n0.03 |\n|\n$ |\n0.29 |\n|\n$ |\n0.57 |\n|\n$ |\n0.43 |\n|\n|||\nNet income per share attributable to ordinary shareholders, diluted |\n$ |\n0.03 |\n|\n$ |\n0.27 |\n|\n$ |\n0.55 |\n|\n$ |\n0.41 |\n|\n|||\nWeighted-average ordinary shares used in calculating net income per ordinary share, basic |\n|\n51,385,862 |\n|\n|\n49,680,114 |\n|\n|\n51,196,507 |\n|\n|\n49,442,327 |\n|\n|||\nWeighted-average ordinary shares used in calculating net income per ordinary share, diluted |\n|\n53,271,524 |\n|\n|\n52,209,431 |\n|\n|\n53,149,561 |\n|\n|\n52,106,369 |\n|\nMONDAY.COM LTD\n|\n|||||||\n(U.S. dollars in thousands) |\n|||||||\n|\n|||||||\n|\nJune 30, |\n|\nDecember 31, |\n||||\n|\n2025 |\n|\n2024 |\n||||\nASSETS |\n(unaudited) |\n|\n(audited) |\n||||\nCURRENT ASSETS: |\n|\n|\n|\n|\n|||\nCash and cash equivalents |\n$ |\n1,590,515 |\n|\n$ |\n1,411,602 |\n|\n|\nMarketable securities |\n|\n60,102 |\n|\n|\n50,004 |\n|\n|\nAccounts receivable, net |\n|\n36,196 |\n|\n|\n25,804 |\n|\n|\nPrepaid expenses and other current assets |\n|\n87,237 |\n|\n|\n44,836 |\n|\n|\nTotal current assets |\n|\n1,774,050 |\n|\n|\n1,532,246 |\n|\n|\nLONG-TERM ASSETS: |\n|\n|\n|\n|\n|||\nProperty and equipment, net |\n|\n47,232 |\n|\n|\n41,576 |\n|\n|\nOperating lease right-of-use assets |\n|\n109,612 |\n|\n|\n94,703 |\n|\n|\nOther long-term assets |\n|\n33,077 |\n|\n|\n16,983 |\n|\n|\nTotal long-term assets |\n|\n189,921 |\n|\n|\n153,262 |\n|\n|\nTotal assets |\n$ |\n1,963,971 |\n|\n$ |\n1,685,508 |\n|\n|\nLIABILITIES AND SHAREHOLDERS' EQUITY |\n|\n|\n|\n|\n|||\nCURRENT LIABILITIES: |\n|\n|\n|\n|\n|||\nAccounts payable |\n$ |\n41,859 |\n|\n$ |\n35,611 |\n|\n|\nAccrued expenses and other current liabilities |\n|\n198,429 |\n|\n|\n171,040 |\n|\n|\nDeferred revenue, current |\n|\n402,794 |\n|\n|\n339,951 |\n|\n|\nOperating lease liabilities, current |\n|\n29,828 |\n|\n|\n29,013 |\n|\n|\nTotal current liabilities |\n|\n672,910 |\n|\n|\n575,615 |\n|\n|\nLONG-TERM LIABILITIES: |\n|\n|\n|\n|\n|||\nOperating lease liabilities, non-current |\n|\n96,384 |\n|\n|\n77,023 |\n|\n|\nDeferred revenue, non-current |\n|\n2,299 |\n|\n|\n2,639 |\n|\n|\nTotal long-term liabilities |\n|\n98,683 |\n|\n|\n79,662 |\n|\n|\nTotal liabilities |\n|\n771,593 |\n|\n|\n655,277 |\n|\n|\nSHAREHOLDERS' EQUITY: |\n|\n|\n|\n|\n|||\nOther comprehensive income |\n|\n22,984 |\n|\n|\n3,189 |\n|\n|\nShare capital and additional paid-in capital |\n|\n1,692,428 |\n|\n|\n1,579,074 |\n|\n|\nAccumulated deficit |\n|\n(523,034 |\n) |\n|\n(552,032 |\n) |\n|\nTotal shareholders' equity |\n|\n1,192,378 |\n|\n|\n1,030,231 |\n|\n|\nTotal liabilities and shareholders' equity |\n$ |\n1,963,971 |\n|\n$ |\n1,685,508 |\n|\nMONDAY.COM LTD\n|\n|||||||||||||||\n(U.S. dollars in thousands) |\n|||||||||||||||\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|||||||\n|\nThree months ended June 30, |\nSix months ended June 30, |\n|||||||||||||\n|\n2025 |\n2024 |\n2025 |\n2024 |\n|||||||||||\n|\nunaudited |\nunaudited |\n|||||||||||||\nCASH FLOWS FROM OPERATING ACTIVITIES: |\n|\n|\n|\n|\n|\n|\n|\n|\n|||||||\nNet income |\n$ |\n1,573 |\n|\n$ |\n14,315 |\n|\n$ |\n28,998 |\n|\n$ |\n21,393 |\n|\n|||\nAdjustments to reconcile net income to net cash provided by operating activities: |\n|\n|\n|\n|\n|\n|\n|\n|\n|||||||\nDepreciation and amortization |\n|\n3,375 |\n|\n|\n2,920 |\n|\n|\n6,625 |\n|\n|\n5,453 |\n|\n|||\nShare-based compensation |\n|\n56,645 |\n|\n|\n36,623 |\n|\n|\n87,603 |\n|\n|\n63,166 |\n|\n|||\nAmortization of discount and accretion of interest on marketable securities |\n|\n580 |\n|\n|\n— |\n|\n|\n(95 |\n) |\n|\n— |\n|\n|||\nChanges in operating assets and liabilities: |\n|\n|\n|\n|\n|\n|\n|\n|\n|||||||\nAccounts receivable, net |\n|\n(9,760 |\n) |\n|\n(1,292 |\n) |\n|\n(10,392 |\n) |\n|\n(1,691 |\n) |\n|||\nPrepaid expenses and other assets |\n|\n(16,987 |\n) |\n|\n(17,306 |\n) |\n|\n(26,757 |\n) |\n|\n(15,199 |\n) |\n|||\nAccounts payable |\n|\n10,068 |\n|\n|\n9,625 |\n|\n|\n6,224 |\n|\n|\n21,668 |\n|\n|||\nAccrued expenses and other liabilities, net |\n|\n2,941 |\n|\n|\n(3,636 |\n) |\n|\n24,098 |\n|\n|\n2,710 |\n|\n|||\nDeferred revenue |\n|\n18,402 |\n|\n|\n14,545 |\n|\n|\n62,503 |\n|\n|\n50,249 |\n|\n|||\nNet cash provided by operating activities |\n|\n66,837 |\n|\n|\n55,794 |\n|\n|\n178,807 |\n|\n|\n147,749 |\n|\n|||\nCASH FLOWS FROM INVESTING ACTIVITIES: |\n|\n|\n|\n|\n|\n|\n|\n|\n|||||||\nPurchase of property and equipment |\n|\n(5,884 |\n) |\n|\n(4,504 |\n) |\n|\n(9,571 |\n) |\n|\n(5,964 |\n) |\n|||\nPurchase of marketable securities |\n|\n— |\n|\n|\n— |\n|\n|\n(10,049 |\n) |\n|\n— |\n|\n|||\nCapitalized software development costs |\n|\n(924 |\n) |\n|\n(469 |\n) |\n|\n(1,703 |\n) |\n|\n(1,070 |\n) |\n|||\nNet cash used in investing activities |\n|\n(6,808 |\n) |\n|\n(4,973 |\n) |\n|\n(21,323 |\n) |\n|\n(7,034 |\n) |\n|||\nCASH FLOWS FROM FINANCING ACTIVITIES: |\n|\n|\n|\n|\n|\n|\n|\n|\n|||||||\nProceeds from exercise of share options and employee share purchase plan |\n|\n12,365 |\n|\n|\n10,616 |\n|\n|\n26,501 |\n|\n|\n19,324 |\n|\n|||\nReceipt (repayment) of tax advance relating to exercises of share options and RSUs, net |\n|\n(9,484 |\n) |\n|\n4,261 |\n|\n|\n(5,072 |\n) |\n|\n14,075 |\n|\n|||\nNet cash provided by financing activities |\n|\n2,881 |\n|\n|\n14,877 |\n|\n|\n21,429 |\n|\n|\n33,399 |\n|\n|||\nINCREASE IN CASH, AND CASH EQUIVALENTS |\n|\n62,910 |\n|\n|\n65,698 |\n|\n|\n178,913 |\n|\n|\n174,114 |\n|\n|||\nCASH AND CASH EQUIVALENTS - Beginning of period |\n|\n1,527,605 |\n|\n|\n1,224,544 |\n|\n|\n1,411,602 |\n|\n|\n1,116,128 |\n|\n|||\nCASH AND CASH EQUIVALENTS - End of period |\n$ |\n1,590,515 |\n|\n$ |\n1,290,242 |\n|\n$ |\n1,590,515 |\n|\n$ |\n1,290,242 |\n|\nMONDAY.COM LTD Reconciliation of GAAP to Non-GAAP Financial Information |\n|||||||||||||||\n(U.S. dollars in thousands) |\n|||||||||||||||\n|\n|\n||||||||||||||\n|\nThree months ended June 30, |\nSix months ended June 30, |\n|||||||||||||\n|\n2025 |\n2024 |\n2025 |\n2024 |\n|||||||||||\n|\n|\n(unaudited) |\n|\n(unaudited) |\n|||||||||||\nReconciliation of gross profit and gross margin |\n|\n|\n|\n|\n|\n|\n|\n|\n|||||||\nGAAP gross profit |\n$ |\n267,841 |\n|\n$ |\n212,343 |\n|\n$ |\n521,286 |\n|\n$ |\n405,802 |\n|\n|||\nShare-based compensation |\n|\n2,272 |\n|\n|\n1,872 |\n|\n|\n3,406 |\n|\n|\n3,116 |\n|\n|||\nNon-GAAP gross profit |\n$ |\n270,113 |\n|\n$ |\n214,215 |\n|\n$ |\n524,692 |\n|\n$ |\n408,918 |\n|\n|||\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|||||||\nGAAP gross margin |\n|\n90 |\n% |\n|\n90 |\n% |\n|\n90 |\n% |\n|\n90 |\n% |\n|||\nNon-GAAP gross margin |\n|\n90 |\n% |\n|\n91 |\n% |\n|\n90 |\n% |\n|\n90 |\n% |\n|||\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|||||||\nReconciliation of operating expenses |\n|\n|\n|\n|\n|\n|\n|\n|\n|||||||\nGAAP research and development |\n$ |\n87,039 |\n|\n$ |\n50,445 |\n|\n$ |\n156,424 |\n|\n$ |\n94,868 |\n|\n|||\nShare-based compensation |\n|\n(27,806 |\n) |\n|\n(13,567 |\n) |\n|\n(43,347 |\n) |\n|\n(23,193 |\n) |\n|||\nNon-GAAP research and development |\n$ |\n59,233 |\n|\n$ |\n36,878 |\n|\n$ |\n113,077 |\n|\n$ |\n71,675 |\n|\n|||\nGAAP sales and marketing |\n$ |\n152,590 |\n|\n$ |\n131,471 |\n|\n$ |\n294,310 |\n|\n$ |\n259,612 |\n|\n|||\nShare-based compensation |\n|\n(13,367 |\n) |\n|\n(10,733 |\n) |\n|\n(19,205 |\n) |\n|\n(18,068 |\n) |\n|||\nNon-GAAP sales and marketing |\n$ |\n139,223 |\n|\n$ |\n120,738 |\n|\n$ |\n275,105 |\n|\n$ |\n241,544 |\n|\n|||\nGAAP general and administrative |\n$ |\n39,763 |\n|\n$ |\n28,633 |\n|\n$ |\n72,307 |\n|\n$ |\n54,550 |\n|\n|||\nShare-based compensation |\n|\n(13,200 |\n) |\n|\n(10,451 |\n) |\n|\n(21,645 |\n) |\n|\n(18,789 |\n) |\n|||\nNon-GAAP general and administrative |\n$ |\n26,563 |\n|\n$ |\n18,182 |\n|\n$ |\n50,662 |\n|\n$ |\n35,761 |\n|\n|||\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|||||||\nReconciliation of operating income (loss) |\n|\n|\n|\n|\n|\n|\n|\n|\n|||||||\nGAAP operating income (loss) |\n$ |\n(11,551 |\n) |\n$ |\n1,794 |\n|\n$ |\n(1,755 |\n) |\n$ |\n(3,228 |\n) |\n|||\nShare-based compensation |\n|\n56,645 |\n|\n|\n36,623 |\n|\n|\n87,603 |\n|\n|\n63,166 |\n|\n|||\nNon-GAAP operating income |\n$ |\n45,094 |\n|\n$ |\n38,417 |\n|\n$ |\n85,848 |\n|\n$ |\n59,938 |\n|\n|||\nGAAP operating margin |\n|\n(4 |\n%) |\n|\n1 |\n% |\n|\n(0 |\n%) |\n|\n(1 |\n%) |\n|||\nNon-GAAP operating margin |\n|\n15 |\n% |\n|\n16 |\n% |\n|\n15 |\n% |\n|\n13 |\n% |\nReconciliation of net income |\n|\n|\n|\n|\n|\n|\n|\n|\n|||||||\nGAAP net income |\n$ |\n1,573 |\n$ |\n14,315 |\n|\n$ |\n28,998 |\n$ |\n21,393 |\n|\n|||||\nShare-based compensation |\n|\n56,645 |\n|\n36,623 |\n|\n|\n87,603 |\n|\n63,166 |\n|\n|||||\nTax expense (benefit) related to share-based compensation(1) |\n|\n78 |\n|\n(1,620 |\n) |\n|\n78 |\n|\n(3,525 |\n) |\n|||||\nNon-GAAP net income |\n$ |\n58,296 |\n$ |\n49,318 |\n|\n$ |\n116,679 |\n$ |\n81,034 |\n|\n|||||\nReconciliation of weighted average number of shares outstanding |\n|\n|\n|\n|\n|\n|\n|\n|\n|||||||\nWeighted-average ordinary shares used in calculating GAAP and Non-GAAP net income per ordinary share, basic |\n|\n51,385,862 |\n|\n49,680,114 |\n|\n|\n51,196,507 |\n|\n49,442,327 |\n|\n|||||\nEffect of dilutive shares |\n|\n1,885,662 |\n|\n2,529,317 |\n|\n|\n1,953,054 |\n|\n2,664,042 |\n|\n|||||\nWeighted-average ordinary shares used in calculating GAAP and Non-GAAP net income per ordinary share, diluted |\n|\n53,271,524 |\n|\n52,209,431 |\n|\n|\n53,149,561 |\n|\n52,106,369 |\n|\n|||||\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|||||||\nGAAP net income per share, basic |\n$ |\n0.03 |\n$ |\n0.29 |\n|\n$ |\n0.57 |\n$ |\n0.43 |\n|\n|||||\nGAAP net income per share, diluted |\n$ |\n0.03 |\n$ |\n0.27 |\n|\n$ |\n0.55 |\n$ |\n0.41 |\n|\n|||||\nNon-GAAP net income per share, basic |\n$ |\n1.13 |\n$ |\n0.99 |\n|\n$ |\n2.28 |\n$ |\n1.64 |\n|\n|||||\nNon-GAAP net income per share, diluted |\n$ |\n1.09 |\n$ |\n0.94 |\n|\n$ |\n2.20 |\n$ |\n1.56 |\n|\n(1) |\nThe tax benefit related to share-based compensation was excluded in calculating non-GAAP net income and non-GAAP net income per basic and diluted share. The Company believes that excluding the tax benefit enables investors to see the full effect that excluding share-based compensation expenses had on the operating results. |\nMONDAY.COM LTD\n|\n|||||||||||||||\n(U.S. dollars in thousands) |\n|||||||||||||||\n|\n|\n||||||||||||||\n|\nThree months ended\n|\nSix months ended\n|\n|||||||||||||\n|\n2025 |\n2024 |\n2025 |\n2024 |\n|||||||||||\n|\n(unaudited) |\n|\n(unaudited) |\n||||||||||||\n|\n|\n|\n|\n|\n|\n|\n|\n||||||||\nNet cash provided by operating activities |\n$ |\n66,837 |\n|\n$ |\n55,794 |\n|\n$ |\n178,807 |\n|\n$ |\n147,749 |\n|\n|||\nPurchase of property and equipment |\n|\n(5,884 |\n) |\n|\n(4,504 |\n) |\n|\n(9,571 |\n) |\n|\n(5,964 |\n) |\n|||\nCapitalized software development costs |\n|\n(924 |\n) |\n|\n(469 |\n) |\n|\n(1,703 |\n) |\n|\n(1,070 |\n) |\n|||\nPurchase of property and equipment related to build-out and expansion of our corporate headquarters |\n|\n4,064 |\n|\n|\n— |\n|\n|\n6,092 |\n|\n|\n— |\n|\n|||\nAdjusted free cash flow |\n$ |\n64,093 |\n|\n$ |\n50,821 |\n|\n|\n173,625 |\n|\n|\n140,715 |\n|\n|||\nAdjusted free cash flow margin |\n|\n21 |\n% |\n|\n22 |\n% |\n|\n30 |\n% |\n|\n31 |\n% |\nView source version on businesswire.com: https://www.businesswire.com/news/home/20250811246144/en/\nInvestor Relations:\nByron Stephen\nbyron@monday.com\nMedia Relations:\nJulie Case\njulieca@monday.com\nEdge Rankings\nPrice Trend\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    }
  ],
  "argos_summary": "Monday.com reported a 27% year-over-year revenue increase for Q2 2025, totaling $299 million, driven by strong enterprise demand and a growing customer base. The company achieved a record number of new customers generating over $100,000 in annual recurring revenue, while its monday CRM product reached $100 million in ARR. Despite the revenue growth, profitability metrics showed mixed results, with a slight decline in operating margin. Looking ahead, Monday.com projects Q3 revenue between $311 million and $313 million, reflecting continued growth.",
  "argos_id": "QZR5D0CGG"
}