{
  "url": "https://www.techradar.com/audio/speakers/i-listened-to-the-new-focal-diva-mezza-utopia-a-usd69-000-lifestyle-speaker-heres-how-high-res-wireless-audio-makes-a-difference",
  "authorsByline": "Al Griffin",
  "articleId": "44752a8bd12e4341979fb149acc709d9",
  "source": {
    "domain": "techradar.com",
    "paywall": false,
    "location": {
      "country": "in",
      "city": "New Delhi",
      "coordinates": {
        "lat": 28.6138954,
        "lon": 77.2090057
      }
    }
  },
  "imageUrl": "https://cdn.mos.cms.futurecdn.net/gSg2b8h7h8iH9sJKNHsPnE-1280-80.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T23:00:00+00:00",
  "addDate": "2025-08-11T23:16:47.651644+00:00",
  "refreshDate": "2025-08-11T23:16:47.651647+00:00",
  "score": 1.0,
  "title": "I listened to the new Focal Diva Mezza Utopia, a ‘lifestyle’ speaker that costs as much as a luxury EV – here’s why I want it",
  "description": "Wireless beyond your wildest dreams",
  "content": "French speaker maker Focal was a very active participant in the recent Audio Advice Live 25 consumer audio show, which took place in Raleigh, North Carolina, from August 1-3. Along with demonstrating a stunning 7.4.4-channel Dolby Atmos home theater system, the company took advantage of the show to make the US debut of its new Focal Diva Mezza Utopia speakers.\n\nSimilar to the best wireless speakers, the Diva Mezza Utopia uses a wireless connection to stream music from services like Tidal, Qobuz, and Spotify. But the Focal’s similarities to most other wireless speakers end right there.\n\nThe biggest difference is price. While Focal calls the Diva Mezza Utopia a “lifestyle” speaker, at $69,000 (around £51,000 / AU$106,000) for the pair, it is priced stratospherically higher than your typical lifestyle speaker from Sonos, Apple, or Bose.\n\nAnother big difference is the resolution of the audio signal that passes between a pair of Diva Mezza Utopias: the system supports a lossless, high-res 24-bit/96kHz wireless connection, and an optional wired speaker interconnect will bump the resolution up to 24-bit/192kHz.\n\nThough it's a “lifestyle” product with all-in-one wireless convenience and a luxurious ivory felt finish to help the 50 x 18 x 24-inch (127 x 46 x 62cm) speakers slot easily into an upscale living space, the Diva Mezza Utopia is designed and engineered like a typical 3-way example of the best stereo speakers.\n\nIts four eight-inch woofers are mated with a 6.5-inch mid-bass driver and a Pure Beryllium ‘M’-shaped inverted dome tweeter. Power is specified at 500 watts per speaker, with separate Naim-designed Class-AB amplifiers used for the tweeter, mid-range, and bass, and separate power supplies used for the tweeter-mid-bass and bass sections.\n\nAlong with its Wi-Fi, Bluetooth 5.3, Spotify Connect, and Tidal Connect wireless streaming capabilities, the Diva Mezza Utopia features a range of wired audio input options. There’s HDMI eARC, optical digital, Ethernet, USB, and analog stereo RCA, with that last one also letting you connect one of the best turntables if you pair it with a phono preamp.\n\nGiven its wireless, lifestyle-friendly design, most listeners will likely go the streaming route, and the Focal & Naim app lets you stream from the Tidal and Qobuz music services directly within the app, as well as access internet radio stations. The app also features Focal’s ADAPT (Adaptive Acoustic Personal Tuning) technology, which “uses a sophisticated algorithm to calibrate the system to both room acoustics and user preferences,” according to the company.\n\nFocal additionally provides a Zigbee hardware remote for controlling the speakers.\n\nThe Diva Mezza Utopia was a no-show at Focal’s scheduled press-only demo due to the speakers being held up in customs, but the company also had its Focal Diva Utopia ($40,000), the Mezza’s smaller, less powerful predecessor, on hand at the show.\n\nThankfully, the company was able to retrieve its goods from customs the next day and reschedule the demo, but I was glad I had the opportunity to first hear the Diva Utopia before getting the Diva Mezza Utopia treatment.\n\nWhile Focal’s smaller speaker sounded great, the new wireless flagship had a more open, effortless, and dynamic sound than the original, along with deeper, more powerful bass. Focal leaned heavily on electronic music tracks for its demo, and one track in particular, Bungee Jump by Captain Hook, best showcased the Diva Mezza Utopia's capabilities.\n\nImaging in particular was fantastic on this track, with the soundstage extending far beyond the physical confines of the speakers themselves. With four 8-inch, separately amped woofers per speaker, the bass was similarly impressive, especially given the large-ish, high-ceilinged room where the demo took place.\n\nWith a pair of Diva Mezza Utopias priced around the same as a luxury EV, I won’t be buying them anytime soon. But the dynamic, detailed, full-range hi-res sound I experienced in Focal’s demo was a highlight of Audio Advice Live 25, and it made me desperately want to own these luxury lifestyle speakers.\n\nYou might also like\n• I thought I knew home theater bass until I experienced an 11.13.8-channel demo with an ‘infrasonic’ 32-inch subwoofer\n• ‘Don’t call it a soundbar’: KEF’s new Dolby Atmos soundbar is more than meets the eye",
  "medium": "Article",
  "links": [
    "https://www.techradar.com/televisions/home-theater/i-listened-to-spatial-audio-on-a-7-4-4-channel-focal-speaker-system-and-now-i-need-to-up-my-dolby-atmos-music-game",
    "https://www.techradar.com/reviews/qobuz-review",
    "https://www.techradar.com/news/best-stereo-speakers",
    "https://www.techradar.com/audio/speakers/focal-diva-utopia-review",
    "https://www.techradar.com/audio/speakers/quads-new-gen-x-esl-electro-static-speakers-look-nothing-like-the-1957-originals-and-i-really-really-want-them",
    "https://www.techradar.com/reviews/spotify",
    "https://www.techradar.com/tag/apple",
    "https://www.techradar.com/reviews/tidal",
    "https://www.techradar.com/audio/wireless-bluetooth-speakers/i-review-wireless-speakers-for-a-living-and-most-succumb-to-this-one-major-flaw-heres-the-one-that-doesnt",
    "https://www.techradar.com/news/best-speaker",
    "https://www.techradar.com/tag/sonos",
    "https://www.techradar.com/audio/i-listened-to-a-usd3-million-stereo-system-and-i-dont-know-if-i-could-hear-every-penny-but-i-definitely-heard-the-dollars",
    "https://www.techradar.com/televisions/dont-call-it-a-soundbar-kefs-new-dolby-atmos-soundbar-is-more-than-meets-the-eye",
    "https://www.techradar.com/televisions/home-theater/i-thought-i-knew-home-theater-bass-until-i-experienced-an-11-13-8-channel-demo-with-an-infrasonic-32-inch-subwoofer",
    "https://www.techradar.com/audio/best-of-high-end-munich-2025-audio-show-our-top-5-products-from-headphones-to-a-tube-amp-portable-cd-player",
    "https://www.techradar.com/news/best-turntables"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Focal Diva Mezza Utopia",
      "weight": 0.10630744
    },
    {
      "name": "Focal Diva Utopia",
      "weight": 0.099929474
    },
    {
      "name": "Diva Mezza Utopia",
      "weight": 0.096712574
    },
    {
      "name": "French speaker maker Focal",
      "weight": 0.09331843
    },
    {
      "name": "most other wireless speakers",
      "weight": 0.09237021
    },
    {
      "name": "Diva Mezza Utopias",
      "weight": 0.08958975
    },
    {
      "name": "speaker",
      "weight": 0.08566959
    },
    {
      "name": "its new Focal Diva Mezza Utopia speakers",
      "weight": 0.081434056
    },
    {
      "name": "Focal",
      "weight": 0.0720218
    },
    {
      "name": "the new Focal Diva Mezza Utopia",
      "weight": 0.07078353
    }
  ],
  "topics": [
    {
      "name": "Celebrities"
    }
  ],
  "categories": [
    {
      "name": "Auto"
    },
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Shopping/Consumer Resources/Product Reviews & Price Comparisons",
      "score": 0.87158203125
    }
  ],
  "sentiment": {
    "positive": 0.43437463,
    "negative": 0.045493063,
    "neutral": 0.5201323
  },
  "summary": "French speaker manufacturer Focal has introduced its new 'lifestyle' speaker, the Diva Mezza Utopia, which costs $69,000 ($51,000 / AU$106,000) and uses a wireless connection to stream music from services like Tidal, Qobuz, and Spotify. The company also showcased a 7.4-channel Dolby Atmos home theater system at the Audio Advice Live 25 consumer audio show in Raleigh, North Carolina. The price difference is due to the size of the speaker and its high price compared to other high-quality speakers from Sonos, Apple, or Bose. Despite being a lifestyle product with all-in-one wireless convenience and a luxurious ivory felt finish, it is designed and engineered like a typical 3-way example of the best stereo speakers. The system supports a lossless, high-res 24-bit/96kHz wireless connection and an optional wired speaker interconnect will increase this resolution up to 24-Bit/192kHz.",
  "shortSummary": "Focal’s new Diva Mezza Utopia speaker offers excellent, immersive sound and wireless streaming capabilities, with included wired and wireless controls, and enhanced audio technology.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "ad8fc17238664a08b7b260cd44753eeb",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.techradar.com/audio/i-listened-to-a-usd3-million-stereo-system-and-i-dont-know-if-i-could-hear-every-penny-but-i-definitely-heard-the-dollars",
      "text": "I listened to the most mind-blowing stereo music system in the world – and the price is terrifying\n7-foot speakers and 7,200 watts of amp power\nWorking in tech journalism has its perks. True, sometimes you spend a whole day staring at the battery level of earbuds with a stopwatch in-hand while they run down, but sometimes you get sent the chance to try something special.\nWhen I saw the invitation to book in for a listening session with a $3 million hi-fi system, I took it. I mean, who wouldn't?\nMore specifically, the price of the system as shown was a little over €3.4 million – most of the components are from European manufacturers and are priced to order, so if you were putting this system together in the US (as I'm sure you were just about to), the exact price would vary.\nThat includes some of the most impressive speakers in the world, a literal metric ton of amplification power, and a speaker cable invoice that will leave you double-checking you're reading this article correctly. (You are.)\nHere's the full list of the equipment in the setup:\nManufacturer | Product | List price |\n|---|---|---|\nWilson Audio | WAMM Master Chronosonic Loudspeaker (pair) | €1,000,000 |\nWilson Audio | WAMM Master Subsonic Subwoofer (pair) | €100,000 |\nDan D'Agostino | Relentless Epic 1600 | €250,000 |\nDan D'Agostino | Relentless Epic 1600 | €250,000 |\nDan D'Agostino | Relentless Epic 1600 | €250,000 |\nDan D'Agostino | Relentless Epic 1600 | €250,000 |\nDan D'Agostino | Relentless Preamplifier | €230,000 |\nDan D'Agostino | MxV Momentum Phonostage Preamp | €44,000 |\ndCS | Vivaldi APEX Digital to Analogue Converter* | €45,500 |\ndCS | Vivaldi || CD/SACD Upsampling Transport | €49,000 |\ndCS | Vivaldi Master Clock | €24,500 |\ndCS | Vivaldi Upsampler Plus / Network Streamer | €32,500 |\nVPI Industries | THE VANQUISH | €130,000 |\nNordost | ODIN2 Cables (multiple) | €600,000 |\nNordost | QBase 10 Reference 2pcs | €43,000 |\nNordost | Accessories (multiple) | €4,000 |\nBassocontinuo | Revolution X Line - Maxi Argo | €30,000 |\nBassocontinuo | Ultimate Line - Golia | €14,500 |\nBassocontinuo | B by Bassocontinuo - Power Amp Stands for D'Agostino Relentless | €17,000 |\nStromtank | S6000 Alpha | €84,000 |\n| Row 20 - Cell 0 | Total | €3,448,000 |\nBut as much as those prices somehow make my jaw hurt, having heard the thing in action I have to say that it produced something really special.\nThe two Wilson Audio WAMM Master Chronosonic loudspeakers obviously dominate the stage, despite being tucked away at the edges. Well, as much as you can tuck away two seven-foot speakers that weight 900 lbs (400kg) each.\nSign up for breaking news, reviews, opinion, top tech deals, and more.\nEach of the main speakers includes two low-end woofer drivers, two lower-midrange drivers, two upper-midrange drivers, a forward firing tweeter and rear-facing tweeter.\nThese speakers are designed so that you can make physical micro-adjustments to the positioning of each driver, moving them slightly forward or backwards to perfect the timing for your particular listening space – no 'automatic room-tuning audio processing' here, they need manual calibration to perfect their output.\nNow, you might think that with one 10.5-inch bass driver and one 12.5-inch bass driver – i.e. the sizes of pretty serious subwoofers for home theater use – these speakers can handle their own bass.\nAh, what a fool you would be. Obviously you need a separate subwoofer behind each of these speakers, each of which is over five feet tall itself, and has three 12-inch drivers.\nPowering these four speakers are four monoblock amplifiers, each of which is capable of outputting 1,600 watts at 8 ohms, and weighs 570 lbs (258kg). Bear in mind that for the affordable home options among the best stereo speakers, 80-150 watts per channel is generally more than sufficient.\nYou won't be wondering where all that effort goes, though. There was a scale to the sound produced here that just can’t be matched any other way than by throwing this much power and air movement at it.\nThere's so much dynamic range in each portion of the dynamic range, it feels closer to an orchestra than a set of speakers – it's as live as a recording can hope to sound.\nThe piercing sound sound of a woman’s wail on a track unsettled my brain in a way other speakers can’t. When bassy drums hit, they come so low, so dispersed and so resonant that they don’t feel like part of the same soundstage as the vocals, but in a good way. They sound like a different thing, as if they’re not tied together by being part of the same audio waveform. Every element is utterly its own thing, recreated wholly.\nThe system's ability to produce lower mids you can feel in your diaphragm was unparalleled compared to anything I’ve heard outside of an IMAX theater, and I’ve been to a lot of fancy speaker demos. It gave acoustic instruments a rawness, again lending itself to that feeling of being in front of a colossal live performance.\nSimilarly, I don’t know that I’ve ever heard such detail within bass before, maintaining such a delicate touch over fluctuations within the lowest frequencies – and yet at the same time as being such a thoughtful touch on bass, you could feel the bass when the track wants you to.\nIt has so many more gears than lesser speakers; so many different levels it can move through, to deliver just the right amount of punch – the right tools for the right job.\nSitting in that room, you knew you were listening to something special – but it did also make me think of diminishing returns, perhaps inevitably.\nOnce you get to a certain point in the world of hi-fi (or TVs, or anything techy really) you start having to spend a lot more just to get a 10% improvement.\nWould I have been similarly impressed by a setup with Wilson Audio's own Alexxa V speakers (around $150,000 per pair), which use tech from the Chronosonic range? I suspect the difference wouldn't have been vast in most people's ears, in the right setup – but I still think you'd hear the difference.\nI'm glad I got to hear one of the most elaborate, powerful and – yes – expensive hi-fi setups in the world. By hearing what's possible when you go all-out, I have an even better understanding of just how good a home setup for a tiny fraction of the price is when it comes to sound-per-pound.\nIt simultaneously slightly ruined my home listening experience, while also enhancing my appreciation for it. And what is a $3 million hi-fi system for if it's not for giving you mixed feelings about the whole affair?\nYou might also like…\nMatt is TechRadar's Managing Editor for Entertainment, meaning he's in charge of persuading our team of writers and reviewers to watch the latest TV shows and movies on gorgeous TVs and listen to fantastic speakers and headphones. It's a tough task, as you can imagine. Matt has over a decade of experience in tech publishing, and previously ran the TV & audio coverage for our colleagues at T3.com, and before that he edited T3 magazine. During his career, he's also contributed to places as varied as Creative Bloq, PC Gamer, PetsRadar, MacLife, and Edge. TV and movie nerdism is his speciality, and he goes to the cinema three times a week. He's always happy to explain the virtues of Dolby Vision over a drink, but he might need to use props, like he's explaining the offside rule.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.techradar.com/tag/apple",
      "text": "Apple\nApple is arguably the world's most important consumer tech company, having played a hugely influential role in shaping the smartphone, laptop, desktop computer, tablet, and wearable markets.\nIt continues to dominate many of those areas today through the iPhone 14, iPad, MacBook Air and Pro, iMac, and Apple Watch product lines, and with new forays into the likes of AV/VR to come. Its decision to build its own silicon, meanwhile, has given it an advantage over rivals such as Samsung and Microsoft - one that's only slowly being closed.\nIt's been every bit as dominant in the software space through iOS, macOS, watchOS, iTunes, Apple Pay, and more, while its Apple TV Plus streaming service is now regularly home to top-quality, award-winning original content.\nApple was founded by Steve Jobs, Steve Wozniak, and Ronald Wayne in 1976, and has been led by CEO Tim Cook since 2011. It is currently valued at around $2.6 trillion; not bad for a company that started in a garage.\nLatest about Apple\nMacBook screens can be broken with a simple greeting card, viral TikTok video warns – and Apple has explained the reason why\nBy Alex Blake published\nThere’s one thing that can quickly break your laptop’s screen, but there are ways to avert it.\nI’ll upgrade my M1 MacBook Pro for the first time in years if this rumor is true – and it might be the last MacBook I buy this decade\nBy Alex Blake published\nThe M6 MacBook Pro is rumored to be a major step up, and it could keep me happy for years.\nThe Morning Show season 4: everything we know so far about the hit Apple TV+ show's return\nBy Grace Dean published\nThe Morning Show season 4 is coming on September 17 – here's everything we know so far about the hit show's return to Apple TV+.\nA $599 MacBook could actually be coming – and even as a hardened Windows fan, I'd be tempted to take the plunge\nBy Darren Allan published\nThere's more chatter about a cheap MacBook, and rumored $599 price would indeed 'shake up the notebook market' - to put it mildly.\nI'm a serial iPhone buyer, but the Google Pixel 10 Pro in Moonstone will test my loyalty to Apple\nBy Axel Metz published\nGoogle's Pixel 10 Pro design is tempting me away from the iPhone 17 Pro.\nForget talking to a human ever again - Apple is rolling out AI chatbots in its customer service app\nBy Efosa Udinmwen published\nApple begns limited testing of AI chatbot in its support app, offering basic troubleshooting with privacy safeguards - and human fallback if needed.\n5 ways the Google Pixel 10 Pro can get ahead of the iPhone 17 Pro and Galaxy S26 Ultra\nBy Jamie Richards published\nWith these 5 upgrades, the Google Pixel 10 can get a head start on the iPhone 17 Pro and Samsung Galaxy S25 Ultra.\nThe newest M3-powered iPad Air plummets to a rock-bottom price\nBy Paul Hatton published\nThe iPad Air M3 11-inch drops to a record-low price of $449 at Amazon.\nBest Buy launches a massive weekend Apple sale – here are the 15 top deals I'd buy on MacBooks, iPads, AirPods, and more\nBy James Pickard published\nBest Buy has launched a big Apple sale this weekend, so I've looked through the offers and picked out the 15 best deals I'd buy on MacBooks, iPads, AirPods, and more.\nSign up for breaking news, reviews, opinion, top tech deals, and more."
    },
    {
      "url": "https://www.techradar.com/audio/speakers/quads-new-gen-x-esl-electro-static-speakers-look-nothing-like-the-1957-originals-and-i-really-really-want-them",
      "text": "Quad's new Gen X ESL electro-static speakers look nothing like the 1957 originals, and I really, really want them\nESL 2812X or ESL 2912X – medium or large?\nWe love to give practical buying advice on the latest gadgets here at TechRadar. But sometimes what we love even more is to indulge in the most high-end, cutting-edge, luxurious tech on the planet. That's what we bring you in these Money no Object columns – you can read the whole series here.\nBefore I get into Quad's new (and quite stunning) speakers specifically, a quick brief on how full-range electrostatic designs differ from traditional passive stereo speakers.\nIt's a piece of engineering that Quad's founder, Peter Walker, gave to the world with the first Quad ESL speaker pair in 1957, so it's like buying ANC headphones from Bose – you're buying from the firm that wrote the book on it.\nMost speakers generate sound waves by using dynamic drive units; think conical or dome-shaped diaphragms, moving back and forth in pistonic motion in response to an audio signal (made by a voice-coil in a magnetic field). Electrostatic speakers replace all of that with ultra-thin panel-shaped diaphragms, electrically charged and suspended in an electrostatic field to generate movement.\nAt the heart of a Quad ESL speaker, said panels contain a diaphragm of fine Mylar film ten times thinner than a human hair. This Mylar film is coated with a high-resistance conductive material and suspended between two perforated metal plates called stators. Quad says this particular setup is unique, but the theory is that something incredibly light is therefore far more dynamically agile, because it can respond to signal transients with far greater speed and accuracy.\nFeel those Quads\nQuad ESL updates are like hen's teeth – there have only been five generations since the original ESL. The inaugural model (known these days as the ESL 57) was eventually replaced by the ESL 63 in 1981. Then, in 1999, the ESL 988 and ESL 989 arrived – the first time Quad had offered a medium-sized ESL model, accompanied by a new, larger option in the 989. These were replaced by the ESL 2805 and ESL 2905 in 2006, and finally, the ESL 2812 and ESL 2912 in 2012.\nCut to today, 13 years after the last revision, and a sixth Quad ESL generation is now ready to launch, namely the new ESL 2812X and ESL 2912X – otherwise known as the Quad Generation X models (and a proud day for Gen X representation).\nBoth models are broader than regular ‘box’ or 'tower' speakers (you love to see it), but with a slimmer side profile as you'd expect from electrostatic panels – apart from the necessary plinth. The ESL 2812X has a height of 107cm; the ESL 2912X stands 40cm taller. The former incorporates four electrostatic panels, while the latter includes six.\nSign up for breaking news, reviews, opinion, top tech deals, and more.\nListen in Quad\nNo, not quadrophonic sound (I see you and I like that your brain went there though), we're still talking about Quad's exceptional stereo speakers. I've been lucky enough to hear them once, in 2019. It was a brief listen, but the clarity and apparent lack of distortion was, to my ear at least, exceptional. Some of the best stereo speakers I've heard? Without a doubt.\nSince the 1981 ESL 63, Quad tells us that the electrostatic panels handling the higher audio frequencies have been \"uniquely configured with a ‘concentric ring’ electrode design\". What that means is that rather than allowing all sections of the diaphragm to move uniformly, the speakers are engineered with the aim of making the audio signal seem to emanate from a singular point in space.\nThe ESL Generation X has been six long years in the making, too, starting in 2019. Using techniques such as advanced laser-precision metrology, Quad seems to have systematically upgraded its processes of spraying, etching, tensioning, and assembly here.\nForget traditional wood trims, too; these speakers adopt a classy all-black-everything minimalist approach, apart from one subtle embellishment. It's a new LED Halo lighting feature – which can be dimmed or switched off – to illuminate the speakers from beneath, giving the impression that they’re floating above the floor (not unlike the Bowers & Wilkins Zeppelin Pro, if I'm honest).\nPricing? Let's. The Quad ESL 2812X and ESL 2912X are available from mid-August, with RRPs of £10,999 and £12,999 per pair, respectively. That would make the smaller speaker pair around $14,779 or AU$22,619 before any associated duties and, of course, shipping, give or take.\nAs you can probably tell, I'm a huge fan. Best start saving then…\nYou may also like\n- See our roundup of the best wired headphones\n- Considering wireless headphones? Consult our pick of the best over-ear headphones\n- Want ANC? You need our guide to the best noise-cancelling headphones\nBecky became Audio Editor at TechRadar in 2024, but joined the team in 2022 as Senior Staff Writer, focusing on all things hi-fi. Before this, she spent three years at What Hi-Fi? testing and reviewing everything from wallet-friendly wireless earbuds to huge high-end sound systems. Prior to gaining her MA in Journalism in 2018, Becky freelanced as an arts critic alongside a 22-year career as a professional dancer and aerialist – any love of dance starts with a love of music. Becky has previously contributed to Stuff, FourFourTwo and The Stage. When not writing, she can still be found throwing shapes in a dance studio, these days with varying degrees of success.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.techradar.com/reviews/spotify",
      "text": "TechRadar Verdict\nSpotify boasts an extensive library of music, podcasts, and, more recently, audiobooks. Although its interface could benefit from a redesign, it’s still user-friendly and looks good. Its lack of hi-res streaming options is a notable shortfall and, in more ways than one, competitors are narrowing the gap. But its exceptional personalized playlists and spot-on recommendations, combined with the continual introduction of new features, solidify its status as our best streaming service.\nPros\n- +\nExcellent personalized playlists\n- +\nHuge catalogue of music, podcasts and audiobooks\n- +\nGreat social features\nCons\n- -\nNo Hi-Res Audio\n- -\nDesign could do with an update\n- -\nNot the best for compensating artists\nWhy you can trust TechRadar\nSpotify: Two-minute review\nSpotify is our favorite music streaming service. First launched in 2008, it has a library of more than 100 million tracks, 5 million podcasts and, thanks to a recent new update, more than 200,000 audiobooks. This extensive range of content has propelled Spotify to over 602 million users worldwide, including 236 million paying subscribers.\nBut Spotify's appeal extends beyond its vast library. The platform has an intuitive interface and an exceptional recommendation engine that tailors playlists to individual tastes. It's also constantly evolving, with new and innovative features being introduced regularly, alongside social tools that simplify content sharing. Plus, its compatibility across a broad range of devices ensures that users can enjoy Spotify virtually anywhere.\nDespite its dominance, Spotify faces serious competition from the best music streaming services, particularly for those seeking audiophile-grade sound quality. Services like Tidal and Apple Music offer superior, lossless audio tracks, with Apple Music presenting a solid ecosystem for Apple lovers. Other contenders include Deezer, YouTube Music and Amazon Music Unlimited, as well as artist-centric platforms like Bandcamp and SoundCloud that give artists more control over their music.\nBut Spotify still stands out as one of the most popular streamers around. Its unique value proposition lies in its expansion into podcasts and audiobooks, continual platform enhancements, and personalized playlists that resonate deeply with users, affirming the Spotify’s knack for understanding user preferences. This evolution from a streaming service to a highly personalized entertainment hub makes Spotify an unmatched choice for most people.\nSpotify review: Pricing and subscription\n- Free plan has ads\n- Premium tier costs $10.99 / £10.99 / AU$12.99 a month\n- Specialized plans for families\nSpotify has two main subscription offerings: Free or Premium. Spotify’s Free plan doesn’t cost you anything, but serves up ads between tracks as a trade-off. Users with the Free plan also have access to less features and restrictions on what they can play. For example, a Free subscription means you can only shuffle songs in an album, playlist or radio station when you’re using the Spotify app on your phone. You can’t pick a specific song and play it. You also won’t be able to save tracks to listen to offline.\nSpotify’s Premium subscription comes with a one month free trial. After that, it costs $10.99 / £10.99 / AU$12.99 per month. Premium subscribers enjoy unrestricted access to any song, album, playlist or radio station, in addition to the ability to add music to their library, create personalized playlists and download music for offline listening – all ad-free. Premium also upgrades the audio quality to 320Kbps, enhancing your listening experience.\nSpotify offers several specialized Premium subscriptions, like Premium Duo ($14.99 / £14.99 / AU$17.99), which gives you two Premium accounts as long as you both live at the same address. There’s also Premium Family ($16.99 / £16.99 / AU$20.99), accommodating up to six Premium accounts with features tailored for family use, like kid-friendly content options.\nSign up for breaking news, reviews, opinion, top tech deals, and more.\n| Type | Monthly Cost |\n|---|---|\n| Free | No cost but there's ads |\n| Premium | $10.99 / £10.99 / AU$12.99 |\n| Premium Duo | $14.99 / £14.99 / AU$17.99 |\n| Premium Family | $16.99 / £16.99 / AU$20.99 |\n| Student | $5.99 / £5.99 / AU$6.99 |\nSpotify review: Specs\n| Monthly fee | $10.99 / £10.99 / AU$12.99 |\n| Free plan? | Yes |\n| Music library size | 100 million tracks |\n| Maximum bitrate | 320kbps |\n| Podcasts | Yes |\nSpotify review: Music library and content\n- 100 million tracks, it's rare anything is missing\n- 5 million podcasts\n- 200,000 audiobooks\nSpotify often updates its library size, and as of the latest count, it has over 100 million tracks. Despite a history of some artists pulling their music from the platform over various concerns – including dissatisfaction with compensation – the major have returned. It’s rare to search for a song on Spotify and not find it.\nReasons for removing their music have varied over the years, but criticism has often centered on the ways Spotify has unfairly compensated creators. Some make the argument that Spotify steers listeners away from piracy and towards legal music consumption, fostering new music and artist discovery in the process. But we get why people might prefer purchasing music directly or using platforms, like Tidal and Bandcamp, which are known for granting more control and higher royalties to artists.\nIn its quest to be the ultimate audio application, Spotify introduced podcasts in 2015 and has expanded that offering to host an impressive selection of over five million podcasts, which have become a central feature of the app. Unlike the traditional 'subscribe' model, Spotify users 'follow' podcasts, with new episodes appearing on your home screen. Spotify might be known for curating personalized music playlists, but it applies similar algorithmic ingenuity to suggest podcasts, too.\nSpotify added audiobooks in late 2022 and now Premium subscribers have access to 200,000 titles through a dedicated section of the app, mirroring the music section's layout. Users can explore new and trending books, browse by genre or popular authors, and find selections suited to activities, like commuting. While dedicated book apps have their loyal users, Spotify's foray into podcasts has proven that it can successfully capture and satisfy audience preferences in new content domains, suggesting a promising future for audiobooks on Spotify.\nSpotify review: Apps and compatibility\n- Easy-to-use apps\n- Interface looks a little dated\n- Spotify Connect for seamless streaming\nYou can use Spotify through its apps on desktops, mobile phones, and tablets, as well as via a web player. Although the web player offers a decent experience, it lacks the polished feel of the apps, making some actions, like playlist creation, feel clunky.\nWithin the Spotify apps, users navigate through three primary sections: Home, Search, and Your Library. While there are slight variations across different platforms, the core experience is the same. The Home section primarily features personalized playlists and recently played tracks, alongside occasional podcast and audiobook suggestions and trending music.\nThe Search function allows users to explore the vast Spotify catalogue, including tracks, albums, artists, playlists, podcasts, and audiobooks, with the option to filter by genre or activity, such as Chill or Workout. Your Library houses all saved content, including playlists, podcasts, audiobooks, albums, and artists, with sorting options like recent additions, listens, alphabetical order, or creator.\nSpotify's apps on iOS, Android, and Windows Phone are known for their stability, user-friendliness, and regular updates aimed at enhancing intuitiveness. The interface, which is a grid-like design similar to other streaming platforms like Netflix, facilitates easy navigation amidst an extensive selection of media.\nHowever, Spotify's design has remained unchanged for years, and may feel a little outdated to some users. I also find that sometimes I’ll log in and love the overwhelming amount of options at my fingertips and other times it all feels too cluttered.\nA significant advantage of Spotify over most of its rivals is in its broad compatibility with a range of devices and platforms, including sound systems, TVs, car stereos, game consoles, and wearables like the Apple Watch.\nSpotify Connect provides a seamless user experience by enabling streaming to speakers and other devices over Wi-Fi directly from the cloud. This feature is accessible by tapping the speaker icon within the app and allows playback on Spotify Connect-compatible devices, such as speakers and soundbars. Spotify's integration with smart assistants, like Alexa and Google Assistant, also works really well and more often than not delivers precise and efficient voice-controlled navigation.\nSpotify review: Playlists and recommendations\n- Incredibly fun and accurate playlists\n- Packed full of recommendations\n- Top social features to share personalized content\nOne of the biggest draws of Spotify is its personalized playlists and recommendations. You can easily make your own playlists but, interestingly, the playlists generated by Spotify dominate my listening habits. This speaks volumes about the platform's precise and engaging recommendation system.\nSpotify curates many playlists that it then distributes to users based on their individual listening patterns. For instance, a playlist titled My Life is a Movie is currently featured in my Home section and has been recommended to me and shared with more than two million other users.\nHowever, beyond these broader recommended playlists, Spotify offers uniquely personalized compilations that are for your eyes only. For example, Discover Weekly presents a new assortment of tracks every Monday, tailored to your tastes yet unexplored by you. The Daily Mix series adapts to your varying moods, and Your Time Capsule nostalgically predicts tracks you might have cherished during your teenage years. And there are so many more.\nA recent addition that has captured my interest in a major way is Daylist. This dynamic playlist changes every few hours and is personalized to reflect your listening habits throughout the day, adding a layer of excitement to each login. Spotify also generates whimsical titles for these playlists based on the included tracks. For instance, my 'Sensational Rhythmic Tuesday Morning' playlist perfectly aligns with my usual gym routine, embracing party tunes, techno, and vibrant hip-hop. Daylist never fails to match my musical needs, meaning most of the times I open Spotify these days I’ll head right there.\nFinally, another new recommendation feature I think is worth mentioning is Spotify's AI DJ. Rather than a curated playlist, Spotify says it's best to think of it as your own AI DJ, which you start playing and it picks out tracks based on the time of day and listening habits, but shakes things up to keep the listening experience fun and exciting. For example, it'll play fresh new tunes you might like, old songs you haven't listened to in a while and much more, announcing its choices as it goes.\nThese personalized playlists have revolutionized music listening for many, encouraging exploration within Spotify's recommendations rather than seeking out specific tracks or artists. While there's a risk of becoming trapped in a particular music genre, by including new songs and creators in these playlists it keeps the experience fresh.\nSpotify's vibrant graphics and tailored playlists are designed to encourage social sharing. The platform simplifies the process of sharing playlists on social networks like Facebook, Twitter, Tumblr, and Telegram, or directly with friends via WhatsApp or SMS.\nWhen Spotify lifts the lid on a big social campaign, like Spotify Wrapped (the details of all the tracks and genres you listened to over the past year), it even creates a personalized web experience that animates your listening stats and creates really great-looking social graphics for you to share and celebrate your musical journey over the past year.\nSpotify review: Sound quality\n- Better quality with premium\n- No lossless or high-res\n- Spotify HiFi promised but years late\nSpotify Premium subscribers listening on desktop, mobile or tablet apps can choose between five sound quality levels: automatic (depends on your network connection), low, normal, high and very high. At the low setting, music streams at 24kbps. At the normal setting, music streams at 96kbps, which sounds a lot better than MP3 at 129kbps. Switch to the high-quality setting and the bit-rate bumps up to 160kbps. Most users will be happy at this level, since any compression trade-offs aren't obvious.\nThe very high setting uses 320kbps, which is perceptually close to lossless. Spotify doesn't offer any lossless or hi-res streaming, which is one reason that audiophiles might want to look elsewhere. Deezer and Tidal are two other options for those who want the best quality available. Deezer's Premium hi-fi subscription costs $11.99 / £11.99 / AU$11.99 a month and lets you stream lossless 16-bit FLAC files.\nIf you want more, go with Tidal. With a $9.99 / £9.99 / AU$11.99, Tidal HiFi subscription you can stream lossless 16-bit FLAC and ALAC audio, but there are also thousands (but not millions) of Tidal Masters files that stream at 24-bit. Tidal HiFi Plus is even better and for $19.99 / £19.99 / AU$23.99 a month you can stream up to 24-bit, including HiRes FLAC, Dolby Atmos, and more.\nSpotify has clearly realized that in order to keep up with the competition, it needs to offer a way for people to upgrade their sound quality, which is the reason it’s been promising to launch Spotify HiFi for years now. This is Spotify’s answer to Deezer and Tidal’s high-quality offerings.\nIt’s difficult to predict what Spotify HiFi will be like, how much it will cost or if it'll ever materialize as it's been promised for more than three years. Spotify initially said that HiFi would be available as an upgrade for premium subscribers and would offer CD-quality, lossless audio at upwards of 1411kbps. This is more than four times the amount of data you currently hear when streaming a song.\nShould I subscribe to Spotify?\nSubscribe if...\nYou love personalized playlists\nSpotify's clever algorithms are excellent at recommending music via its personalized playlists and fun features.\nYou want to listen to podcasts as much as music\nSpotify's growing podcast library means you can get your spoken word fix as well as find your favorite tunes.\nYou'll use Spotify Connect\nIf you have some speakers or a soundbar at home, Spotify Connect will provide a truly seamless listening experience.\nDon't subscribe if...\nYou want Hi-Res Audio\nIf you need audiophile-grade music, you're better off heading to Tidal or Deezer.\nYou're worried about artist compensation\nSpotify is making moves to rectify this, but right now it doesn't have the best reputation for compensating artists.\nYou love Apple products\nSpotify works well with Apple products, but Apple Music does offer better integration with the broader ecosystem.\nBecca is a contributor to TechRadar, a freelance journalist and author. She’s been writing about consumer tech and popular science for more than ten years, covering all kinds of topics, including why robots have eyes and whether we’ll experience the overview effect one day. She’s particularly interested in VR/AR, wearables, digital health, space tech and chatting to experts and academics about the future. She’s contributed to TechRadar, T3, Wired, New Scientist, The Guardian, Inverse and many more. Her first book, Screen Time, came out in January 2021 with Bonnier Books. She loves science-fiction, brutalist architecture, and spending too much time floating through space in virtual reality."
    },
    {
      "url": "https://www.techradar.com/news/best-speaker",
      "text": "The best wireless speaker, all tested by us, from Apple, JBL, Sonos and more\nThe best wireless speakers you can buy for your home\nOur audio experts have tested and selected the best wireless speakers, informed by years of experience and after reviewing countless devices. Whether you need a compact Bluetooth speaker that integrates with your Wi-Fi for enhanced indoor audio or a premium Wi-Fi model for a multi-room setup, we’ve got you covered.\nThe best wireless speakers combine outstanding sound quality with the freedom of a cable-free design. By connecting to your home’s Wi-Fi, they also let you enjoy music anywhere without the hassle of wires. Many of our top picks also include Bluetooth for added flexibility, along with smart features like voice assistant support (Alexa, Google Assistant, or Siri) and seamless compatibility with the best music streaming services. Plus, many come with dedicated apps for easy control and personalized sound settings.\nEvery speaker in our guide has been thoroughly tested by our team of audio experts. We evaluate each model in real-world settings, paying close attention to the features that matter most – from sound quality and smart controls, to ease of use and value for money. Our reviewers have years – usually decades – of experience, and know exactly what to look for. We work with them to curate the final selection in this guide.\nIf portability is your main concern, check out our best Bluetooth speakers guide. If you want full Apple Music integration instead, our best AirPlay speakers guide has you covered.\nThe quick list\nIf you want to find out which best wireless speaker is for you in a hurry, you’ll find a roundup of our choices below. You can them jump to a more detailed review of every pick, along with our price comparison tool to help you find the best deals.\nBest overall\nBest wireless speaker overall\nExpect rich and detailed sound that makes this JBL speaker a dream to listen to. It also has a stunning, retro design and a long list of excellent features. It's not cheap, but it's worth every penny.\nBest budget\nBest budget wireless speaker\nApple's smaller, cheaper version of the HomePod is still an impressively smart wireless speaker a few years after launch. It has an elegant spherical design with top audio performance.\nBest sound under $1000\nBest wireless speaker for sound under $1000\nThe latest addition to B&W's Zeppelin line delivers expansive, well-structured sound, multi-room connectivity, and a distinctive, high-quality design – all for under $1,000.\nBest for connectivity\nBest wireless speaker for multi-room connectivity\nExpect stunning hi-res sound from this stylish, feature-packed speaker. With a variety of connectivity options, it can effortlessly deliver audio from almost any source you've got.\nBest for portability\nBest portable wireless speaker\nSonos isn't cheap, but this lightweight speaker pumps out powerful, detailed sound from a small and rugged design – ideal if you're looking for the best portable wireless option.\nBest premium\nBest premium stereo wireless speaker\nA true audiophile wireless speaker for those that are after luxury high-definition sound. We couldn't fault this when we tested it and gave it a full five stars across the board.\nLoad the next 3 products...\nBest for design\nBest wireless speaker for design\nThis stunning crescent-shaped hi-fi system is a luxury Italian speaker that sounds as good as it looks. It has a smart wooden top panel that comes in walnut and graphite colorways.\nBest for spatial audio\nBest wireless speaker for spatial audio\nThe Era 300 completely raises the bar when it comes to spatial audio. Its array of drivers include up- and side-firing speakers that make it comes alive with Dolby Atmos.\nBest money no object\nBest wireless speaker if money's no object\nThere aren’t many speakers that look and sound as impeccable as the Beolab 8. The only downside? Its astronomical price tag. Regardless, this is in a league of its own.\nI've reviewed over 150 audio products since becoming a tech journalist, ranging from super-budget earbuds to high-end Hi-Res Audio music players. Before joining TechRadar, I spent three years at What Hi-Fi? testing everything the world of audio had to offer; before that, I was a professional dancer, so obviously I have strong opinions about the quality of speakers, whether that's at home or something pro.\nJuly 22, 2025\nChecked all products against our latest reviews and price changes. Created a comparison table at the end of the guide to give readers a quick glance at how the recommended products stack up. Added the Edifier D32 to our list of other products to consider. Added several new entries to the FAQs.\nThe best wireless speakers available today\nWhy you can trust TechRadar\nThe best wireless speaker overall\nSpecifications\nReasons to buy\nReasons to avoid\n✅ Audio quality is your top priority: Expect full, rich and dynamic audio. If only the best sound matters, you'll be delighted with the experience here.\n✅ You like a retro design: Most smart speakers are neutral and minimal, this one is oozing with vintage style.\n❌ You're on a budget: In our books, it's worth every penny. But you can get the Sonos Era 100 for slightly cheaper if you want to keep costs down a little further.\n❌ You value simplicity: Room-filling sound and lots of features means this makes the most sense for those after an all-singing, all-dancing smart speaker.\nThe JBL Authentics 200 is one incredibly impressive speaker. For starters, it looks gorgeous. It’s also got all of the essential features you could need from a top wireless speaker and, most importantly, it sounds fantastic. It could have topped multiple categories in this guide, but for now, we’re naming it our best overall wireless speaker – the top choice for most people.\nExpect excellent audio across the range, with full bass, rich mids and plenty of detailed treble. In our review we also commented: “Separation is impressive, and there’s a depth to its soundstage that delivers remarkable immersion for a single speaker.” The result is a lot of depth and a listening experience we described as “sublime”\nAll of the top features are here, including multi-room audio and connectivity to the intuitive JBL One app. There’s also Wi-Fi streaming from several services. You can integrate the app with a range of streaming platforms, as well as customize the EQ settings – but we found it most enjoyable to do that manually by turning the treble and bass knobs on the speaker itself. If you like using voice commands, there’s support for Google Assistant and Amazon Alexa to choose from.\nThe JBL Authentics 200 has a refreshingly different aesthetic. In our review we wrote that it delivers “a dose of vintage style in a market crowded by neutral designs”. This is down to the curved foam grille and the aluminium frame – a nod to the look of older amps. Then again, it’s not overtly retro. It doesn’t look like a regular speaker cosplaying as a cool one, is what we’re saying. All of the design choices here look subtle and the result is a stunning build and finish that also feels premium, too.\nIt’s not the cheapest speaker in this guide. It’s also lacking Atmos compatibility, which you can find for less. But it’s one of the most appealing right now for its combination of superb sound, a refreshing, retro look and excellent feature set. As we pointed out in our review, “there’s really nothing else like the Authentics 200.”\nRead our full JBL Authentics 200 review\nFeatures | Packed with Wi-Fi streaming, multi-room support, app control, and both Alexa and Google Assistant. | 4.5/5 |\nSound quality | Excellent separation, rich mids, and deep bass make for a truly immersive experience. | 5/5 |\nDesign | A stylish vintage design with standout retro flair when competitors are going hard on minimalism. | 4.5/5 |\nValue | Not the cheapest, but the features, sound, and standout looks make it worth the price. | 4/5 |\nThe best budget wireless speaker\nSpecifications\nReasons to buy\nReasons to avoid\n✅ You like Siri: Siri is your smart assistant in this smart speaker, so only buy it if you're a fan – or you think you could quickly become one.\n✅ You use Apple Music: There are ways to play things without a subscription, but to use music-based voice commands seamlessly, you'll need one.\n❌ You're an Android user: You require an Apple device to set this up, and the only way to stream music to it from your phone is Apple AirPlay 2.\n❌ Things might get messy: The fabric outside doesn't clean as easily as options with hard grilles on the exterior – don't put one too close to your cooking area.\nIf you want to enter the Apple smart ecosystem or you have an Apple Music subscription, the Apple HomePod Mini is the wireless speaker we recommend. It is a few years old now, launched in late 2020, but we think it’s a solid choice and cheaper than you might expect – although frustratingly Apple Music discontinued the cheapest way to get it up and running, its Apple Music Voice plan, in Nov 2023.\nIt’s for Apple users only as you need an iPhone or iPad to set it up. The process is remarkably straightforward. “It's easily the best we've seen for any smart speaker,” we commented in our review. “Especially if you've not owned a smart speaker before and are worried that setting one up would be a complicated business.” Although if you don’t have an Apple Music subscription, you’re limited in music streaming. For example, we discovered that you can't ask the HomePod mini to play music through Spotify – you’d need to enable that through AirPlay, which requires using your phone rather than the simpler method of asking Siri.\nHowever, we highly rate the HomePod Mini’s sound quality, which delivered clear treble and smooth mids during our tests. Our review noted that “the bass isn't too heavy, vocals aren't lost in the mix, and when you pair two minis, the stereo experience is really immersive.” Of course, you’ll find a better audio experience with a bigger, more powerful speaker, but considering the Apple HomePod Mini is so small and affordable, it’s excellent. “It really feels like the right mix of value for money and sound quality,” we wrote in our review.\nDesign-wise, the Apple HomePod Mini is a small sphere – this is how it pumps out 360-degree sound – with clean lines and a grey or white mesh, depending on your chosen color. In our review, we wrote that “the latticed fabric housing blends nicely into the background, and the top glows with a pleasing light.” However, we did note there should be an option to dim or turn off the light at night if you’re using the speaker to listen to calming music as you sleep.\nAs for other Apple options, the original HomePod has been discontinued, but the February 2023 Apple HomePod 2 is still around – although we still prefer the Mini between the two. Not sure which is for you? Read our Apple HomePod 2 vs HomePod mini guide, but essentially, the HomePod 2 would suit bigger rooms – and deeper pockets. For everyone else, especially if you like using Siri and have an Apple Music subscription, buying a couple of HomePod Minis instead would be an easy, great-value choice.\nOf course, this might all change when the rumored HomePod mini 2 arrives. Nothing officially has been announced yet, but if it comes bearing notable smart improvements, as well as better sound, it'll trounce most things in this list. Maybe don't let that sway your opinion just yet, but it's worth considering if you want to wait a couple of months before you decide and really value having the most bang up-to-date tech in your home.\nRead the full Apple HomePod mini review\nFeatures | Lots of smart home features, thanks to Siri. Very much one for the Apple users. | 4/5 |\nSound quality | Strong and capable sound for a small speaker. Good balance across the range, which worked well with all genres. | 4/5 |\nDesign | An understated and minimal spherical design – ideal for 360-degree sound. Compact enough for small spaces. | 4/5 |\nValue | Ideal if you want a small, compact smart speaker and you have an iPhone – not so great value for anyone else. | 4/5 |\nThe best wireless speaker for sound under 1000\nSpecifications\nReasons to buy\nReasons to avoid\n✅ You want spacious, lively sound: We threw around a lot of superlatives for this speaker, but what stood out most was how open and detailed it sounded.\n✅ You like a bold design: B&W has been making the Zeppelin line for years, this is the latest and it's one very distinctive design, that's for sure.\n❌ You have a small space: If you want it for a small home or you're hoping it'll slip onto a small gap on a shelf shelf, you should look for something more compact.\n❌ You want the latest smart features: There's plenty here, but it does lack wider network compatibility and a voice assistant.\nThe Bowers & Wilkins Zeppelin Pro is the latest addition to the brand’s iconic Zeppelin line-up, with the same bold, distinctive design that has defined the range. However, beyond the signature look, this Pro model introduces some upgrades.\nUnder the hood, the specs are impressive. The tweeter array has been reworked, featuring the same titanium dome unit found in B&W’s premium 600 S3 series passive speakers. This is paired with mid-range drivers and a powerful 150mm bass driver, driven by 240 watts of amplification. The speaker also supports the aptX Adaptive Bluetooth codec and integrates with a range of music streaming services and internet radio platforms.\nIn our review, we described the sound as delivering “a detailed, spacious, and vigorous listen,” capturing the finest details while packing a punch. It offers a well-balanced tone, a smooth frequency range, and an expansive soundstage, delivering a far superior audio experience than you’d expect at this price. No, it's not flawless, but the sound quality is impressive for the budget.\nAs you’d expect from B&W, the build quality and finish are excellent. The Zeppelin-inspired design makes a statement in any space, and with good reason, it looks as premium as it sounds. Available in two finishes, ‘Solar Gold’ and ‘Space Gray,’ it also features 15 different ‘ambient light’ colors, this is a nice touch and they illuminate the speaker’s base. While it’s not the most high-end wireless speaker in this guide, it’s the best option if you’re looking for top-tier sound and design while staying under the $1,000/£1,000 mark.\nRead our full Bowers & Wilkins Zeppelin Pro review\nFeatures | There's aptX Adaptive, multi-room, and more – but limited smart connectivity holds it back marginally. | 4.5/5 |\nSound quality | Spacious and punchy with great clarity, though a touch more dynamic energy wouldn’t hurt. | 4.5/5 |\nDesign | Impeccably built with bold Zeppelin styling, a choice of finishes and some cool lighting colors. | 5/5 |\nValue | Pricey, but strong performance makes it a solid one-box investment. | 4/5 |\nThe best wireless speaker for connectivity\nSpecifications\nReasons to buy\nReasons to avoid\n✅ You want a powerful, all-in-one solution: It takes the place of four or five separates, so for a simple set-up or if you're tight on space, it's ideal.\n✅ You want bold, confident sound: Get it properly optimized and feed it high-res material and it delivers exquisite audio.\n❌ You were considering a soundbar: It's a great wireless speaker and has an HDMI input, but it won't give you the height channels and wide soundstage of the best soundbars.\n❌ You don't want to pay a premium price: This is an expensive speaker, which means the experience is premium, but so is that price tag.\nIf you're looking for a wireless speaker that ticks all of the key boxes – like style, sound quality, specs, and a wide range of connectivity options – we highly recommend the Cambridge Audio Evo One.\nThis speaker is packed with features. In our review, we noted that the Evo One functions \"more like a hi-fi than a single speaker.\" It boasts 14 drivers, each powered by 50W of amplification, delivering an impressive audio experience.\nAs well as Bluetooth 5.1, it can stream hi-res audio up to 24-bit/192kHz from services like Tidal and Spotify, with multi-room support via Google Home, Apple AirPlay 2, and Roon. You can also stream internet radio, play music via USB at an ultra-high 32-bit/384kHz, use it as a TV speaker via eARC, or connect a turntable.\nGive the Evo One hi-res audio, and it delivers. In our review, we praised its \"exquisite balance and impressive separation of different elements.\" Yes, it may lack the height channels and expansive soundstage of a top-tier soundbar, but it makes up for it with rich, detailed sound that stands out in any multi-room setup.\nIts design is as impressive as its performance. The Evo One looks premium, feels well-built, and features a sleek display. But it’s on the larger side, so you’ll need to make sure you have space. If you do, it’s an elegant addition to any home.\nYes, it’s expensive at $1,499 / £1,299 / AU$2,495, but if you’re looking for an all-in-one system that replaces four or five different separates while delivering stunning sound, you've found it. With its connectivity options and easy setup, the Evo One is our top pick for those who want a premium wireless speaker that looks as good as it sounds.\nRead the full Cambridge Audio Evo One review\nFeatures | Stacks of features that make it feel more like a full hi-fi system than a solo speaker. | 5/5 |\nSound quality | Rich, precise, and immersive – it seriously impresses for music or even movies. | 4.5/5 |\nDesign | Sleek, solid, and stylish, with a display that adds polish to the premium feel. | 4.5/5 |\nValue | It’s pricey, but few rivals match this level of sound and feature set for the money. | 4/5 |\nThe best wireless speaker for portability\nSpecifications\nReasons to buy\nReasons to avoid\n✅ You have other Sonos devices: The Roam 2 fits very well into the existing Sonos ecosystem, as well as for users of AirPlay 2.\n✅ You want a simple, portable speaker: It's very easy to carry this speaker around with you, good for use at home or on the move, thanks for Bluetooth connectivity.\n❌ You want all-day and all-night listening: It's a shame it doesn't last longer as it's a solid portable pick, but 10 hours isn't bad – it just isn't great.\n❌ You want big, audiophile sound: It's a small speaker, and that limits what it can do – other options here offer way more scale and expansiveness.\nThe Sonos Roam 2 is our top pick if you're looking for a hybrid indoor and portable wireless speaker, making it ideal for travel, any activities outside or just for round the house so you can easily move it as you get on top of chores. A minor upgrade on the original Sonos Roam, this second version boasts very powerful sound for such a small box, a rugged design, excellent connectivity features, and smart home control for when you want to bring it indoors.\nThe Sonos Roam comes with Bluetooth and Wi-Fi connectivity, which means it can work both as a portable speaker on the go, and part of your wider multi-room Sonos system when at home. With Google Assistant and Alexa onboard, it doubles up as a smart speaker, too. The only thing that disappointed us here was the battery life, which will get you 10 hours – the same as the first Roam. These days that’s below the standard of many other wireless speakers, so we recommend you take a power bank with you if you’re using it out and about.\nIn our review we wrote you can expect “an excellent sound that punches far above the sheer size” of this small speaker. Like the original Roam, this is thanks to the two class-H amplifiers inside, which have a high-efficiency motor that Sonos says increases the power and range of the audio output, as well as a custom racetrack mid-woofer, and a tweeter. We described the audio as providing \"a rich, clear, and balanced experience\" in our review. You can make adjustments as you listen thanks to the Sonos app which has EQ settings built-in. There’s also a feature called Automatic Trueplay, which basically means the mix will adjust to make sure it sounds good wherever you’re listening. While it's powerful for such a small speaker, we should make clear that it obviously doesn't fill a larger room with detailed sound in the way that larger speakers here do\nLooks-wise, it's similar to the original Roam. It has a slick and minimal build about the same size as a water bottle. Which means it’s small enough to sit on a shelf or a table without looking out of place. It has a rugged build that’s waterproof and dustproof, making it ideal for using outdoors or in a home gym or garage. The one major difference over the first Roam is you’ll find a button on the back that lets you switch between using the speaker on Wi-Fi or Bluetooth. It also now comes in a better range of colors too, including black, white, red, blue and green.\nIf you already have the original Sonos Roam that came before it, not enough has changed here to justify an upgrade – unless the button on the back is annoying you – but for everyone else, it's a great choice if you want a fantastic-sounding Bluetooth speaker with a premium, portable build and an excellent features list.\nRead our full Sonos Roam 2 review\nFeatures | Delivers almost everything you'd want on the go – short battery life is the main drawback. | 4/5 |\nSound quality | Balanced, rich, and makes all genres shine – though this is in the context of it being a portable speaker. | 4/5 |\nDesign | Minimalist, weather-ready, and easy to use with intuitive controls. | 4.5/5 |\nValue | Great sound and design, but better battery life in Bluetooth speakers can be found for less. | 3.5/5 |\nThe best premium wireless speaker\nSpecifications\nReasons to buy\nReasons to avoid\n✅ You want phenomenal, audiophile-grade sound: You've got it all here, Hi-Res Audio, customizable EQ and an excellent, expansive sound.\n✅ You like listening from lots of audio sources: If you want to switch between your TV, laptop, phone, turntable and anything else, these speakers make it easy.\n❌ You're on a budget: Unfortunately, detailed and impressive sound does come at a steep price.\n❌ You need smart features: There's no voice assistant compatibility here (and a few other smart features are AWOL) so you won't be able to control your music that way.\nThe LS50 Wireless II speakers build upon the success of the LS50 Wireless, which impressed with their detailed sound and connectivity options. The result is a pair of stereo speakers that are the best you can buy today at this price.\nOne reason some people are put off by stereo systems like this one is that they assume they’ll be tricky. During our hands-on testing, we wrote that setting up the LS50 Wireless II speakers is “blissfully easy.” All you need to do is plug each speaker into power and connect them to your Wi-Fi network. You can then stream from the Spotify app using Spotify Connect or via Tidal, Qobuz, Amazon Music, or Deezer through the KEF Connect app.\nWith support for Hi-Res Audio, an expansive soundstage, and excellent detail and dexterity, audio quality is nothing short of fantastic. In our review, we wrote: “We’re happy to report that the LS50 Wireless II stereo speakers continue to provide the phenomenal audio quality offered by their predecessors – and then some.” That incredibly well-balanced, detailed, clarified sound may not appeal to bass-heads, but it will to audiophiles. It boasts great stereo separation, and a wide enough soundstage to fill any room.\nNot only is the sound great and setup easy, but you can customize it easily. This is because the app is easy to use and gives you access to EQ settings that can be optimized by where you’ve positioned your speakers. You can also adjust the bass extension and treble trim and set low and high-pass frequencies. We’re happy to report that, during our testing, we found that you can pretty much tailor the sound profile exactly to your needs and environment.\nThere are several color options to choose from, white, black, red, and gray. The system, as a whole, looks stylish and understated. It has a sleek cabinet and a copper-colored Uni-Q driver, which fits a tweeter in the center of the bass and mid-range cone. On top of the primary speaker, you’ll find a touch-sensitive control panel that also comes with an infrared remote control.\nThey're a little pricey, but they’re well worth the money. These speakers sound amazing, delivering premium sound that’ll fill your room. Add to that a vastly improved app, the ability to adjust the EQ settings, and a blissfully easy setup, and you have a pair of stereo speakers that can ddo no wrong in our eyes.\nRead the full KEF LS50 Wireless II review\nFeatures | Lots of connectivity options. Support for Hi-Res Audio. An improved app with adjustable EQ settings. But lacks some smart features. | 4/5 |\nSound quality | Phenomenal sound. Expect a wide soundstage, exceptional clarity and detail and solid, powerful bass. | 5/5 |\nDesign | A stylish and understated design with sleek lines. Available in four finishes. | 4.5/5 |\nValue | They're expensive, there's no getting around that. But if you want excellent, audiophile-grade sound, they're well worth it. | 4/5 |\nThe best looking wireless speaker\nSpecifications\nReasons to buy\nReasons to avoid\n✅ You're after top-tier sound: The Sonus Faber Omnia delivers impressive audio for its size, uncovering layers in your favorite tracks you may not have noticed before.\n✅ You want a statement design piece: It'll get people talking, while still looking classic. It's a beautiful piece of design.\n❌ You're on a tight budget: There's no sugarcoating it, the Omnia comes with a premium price tag.\n❌ You're after true stereo separation: While the Omnia offers an impressively wide soundstage, dedicated stereo speakers still deliver more precise left/right separation.\nSonus Faber is well-known for its high-priced, luxury hi-fi equipment, and the Omnia is no exception. This is a sleek, sophisticated, and fairly big all-in-one system that we found incredibly easy to use thanks to comprehensive wireless connectivity, with built-in support for the major streaming services, AirPlay, Chromecast, and Roon.\nThe Sonus Faber Omnia is an all-in-one system that brings simplicity and ease of use thanks to its wireless connectivity features and built-in support for major streaming services, AirPlay, Chromecast, Spotify, Tidal and Roon. There’s wired connectivity, too. You’ll find a switchable phone/line input to connect it to a turntable or other analog device, HDMI ARC, and an Ethernet port. Otherwise, you can control the speaker via your smartphone. If you’re on an iOS device, you’ll need the Home app to connect the Omnia to your Wi-Fi, while Android users can do this with the Google Home app. During our review, we found that setting up the Omnia was easy – follow the instructions in the app of your choice or use a wired Ethernet connection.\nThe Sonus Faber Omnia has a four-way closed-box system. This has seven drivers that are powered by 490W of amplification. Sonically speaking, it’s exemplary, with a wide soundstage, excellent clarity, and a deep bass response. During our testing, we were impressed by its stellar performance: “This is a powerful speaker that can soundtrack a party just as well as it can act as your TV’s main speaker in place of a soundbar.”\nThe Omnia may not sound as supremely detailed as Sonus Faber’s larger speakers, but it will still convey the minutiae of your favorite tracks with aplomb. In our review, we wrote: “It really shines in its presentation of close-mic vocals. In Eva Cassidy’s rendition of What A Wonderful World, the raspiness of her voice comes across with exquisite detail.”\nThe system has a tactile lacquered wooden surface that lights up when you interact with it. As we wrote in our review, we’ve seen for ourselves how these speakers are made and can confirm that plenty of care goes into picking the right wood, sanding it down, and preparing it by hand. Consider that this is a larger speaker, so although it looks sleek and sophisticated enough to elevate any home, you’ll need space.\nThis is a luxury speaker with a price tag to match. This means it’s only the right choice for people willing to invest in their sound system. But if you’re an audiophile with a big budget and want an option that works with your favorite streaming services at the touch of a button, the Sonus Faber Omnia is a top choice.\nRead the full Sonus Faber Omnia review\nFeatures | Lots of streaming service support and connectivity, but slightly odd to set up – you use a web interface instead of an app. | 4/5 |\nSound quality | An exceptional level of detail. Excels across all styles, especially its presentation of close-mic vocals | 4/5 |\nDesign | A luxury speaker through and through with an impeccable level of design and build quality. | 5/5 |\nValue | Extremely expensive. But then again, that's to be expected from Sonus for such a thing of great beauty. | 3.5/5 |\nThe best wireless speaker for spatial audio\nSpecifications\nReasons to buy\nReasons to avoid\n✅ You want a feature-packed, flexible pick: With support for the Sonos app, AirPlay 2, Bluetooth, line-in (via adapter), Dolby Atmos, and Hi-Res audio, this speaker can do kinds of stuff.\n✅ You want to create a Sonos surround system: Pair two Sonos Era 300 units with a Sonos Arc Ultra for glorious surround sound.\n❌ You're after pure hi-fi performance: It sounds excellent, but the Sonos Five is still the go-to for those who want uncompromising audio fidelity.\n❌ You want subtle background sound: The Era 300 isn’t built to whisper. It shines at higher volumes and feels underpowered when playing quietly.\nSonos was generous enough to launch two new wireless speakers into its range in 2023. The Era 100 and this Era 300, which is the more premium version, and we went as far as to say in our review that it is on a whole new level when it comes to dispersing sound.\nIt's a very flexible speaker, and by far the best if you want to set up a Sonos surround system. You can also access the Sonos app to support AirPlay 2, Bluetooth 5.0, line-in, Hi-Res Audio and (of course) Dolby Atmos. Unlike previous Sonos products, the Era 300 supports a new type of room tuning tech called TruePlay Quick Tuning that works with both iOS and Android devices. You play a sound on your phone and the speaker listens and adjusts to your room.\nThe Sonos Era 300 sounds amazing in every conceivable way. First of all, we were blown away by the levels of detail on offer here. In our Sonos Era 300 review we wrote: “It elevates voices in the mix better than anything else I've heard at this size or price.” At times, we were slightly disappointed by the bass, which didn’t hit quite as deep as we expected, but we did note that it improved at higher volumes.\nThe speaker sounds so good for all sorts of reasons, but most notably, it’s the first speaker from Sonos with Dolby Atmos support. Thanks to up- and side-firing speakers, its spatial audio is also next-generation, which is the biggest differential factor of the two Era offerings and the main reason we would choose the 300 over the 100. This was really obvious during our sound tests, where we noted: “The Sonos Era 300 may be the most well-dispersed soundstage I've heard from a single speaker.”\nThe Sonos Era 300 has an unusual squashed cylinder shape, but that’s because it needs to have multiple angled speakers and horn shapes for its compression drivers. Still, Sonos has done a good job at making it look sleek and stylish, like the rest of its devices. One thing to note, however, that we picked up on during testing is that you can’t put it on a set of shelves where it’s covered at the top or on its sides. It must be in the open to blast soundwaves up and to the sides.\nThe Sonos Era 300 is great as a high-quality, super-flexible speaker. It’s not cheap, but it's not the most expensive wireless speaker either. Instead, it delivers exceptional audio prowess that most affordable speakers can’t touch, but you can opt for even more premium models if you want more bass extension. We also think that hi-fi fans may prefer the more traditional sound and style of the Sonos Five, although that device feels a little old compared to Sonos' newer models.\nRead the full Sonos Era 300 review\nCheck out our Sonos discount codes for our latest deals and savings.\nFeatures | From Wi-Fi and Bluetooth to Dolby Atmos, voice control, and line-in support – everything you could ask for is here. | 5/5 |\nSound quality | Delivers pinpoint stereo and Atmos positioning, with crisp detail and impressive depth. | 4.5/5 |\nDesign | Stylish and understated, though its angular shape might divide opinion. | 4/5 |\nValue | It’s not cheap, but for the performance and feature set, it’s hard to beat. | 4/5 |\nThe best wireless speaker if money is no object\nSpecifications\nReasons to buy\nReasons to avoid\n✅ Design matters as much to you as sound: With its unmistakable Bang & Olufsen aesthetic, the Beolab 8 is as much a design statement as it is a speaker.\n✅ You want sound with serious presence: ‘Lively’ doesn’t quite cut it. This speaker delivers bold, energetic audio that grabs your attention.\n❌ You're looking for value for money: There’s a lot to admire about the Beolab 8, but just don’t expect it to offer bang for your buck.\n❌ You prefer a more relaxed listen: The Beolab 8 brings high energy to everything it plays, which might clash with slower, more laid-back tracks.\nThe Bang & Olufsen Beolab 8 looks just as elegant as it sounds. Its only real downside? The eye-wateringly high price tag that comes attached to it. While the Danish audio brand is known for making high-end audio gear, the Beolab 8 is the epitome of its expensive reputation, costing $2,749 / £2,199 / AU$4,499 for a single speaker.\nYou do get a lot for what you pay for, though. In terms of connectivity, there’s dual-band Wi-Fi alongside Bluetooth 5.3, including AirPlay, Chromecast, Spotify, and Tidal Connect. It also packs a DAC that supports 24bit/192kHz Hi-Res Audio. Using B&O’s Mozart platform, you can pair several Beolab 8 speakers together and use the control app to calibrate them to your environment.\nThere are also plenty of ways to install the speaker into your stereo or home theater setup. No matter whether you’d prefer the table, wall bracket or floor stand, there’s a lot of flexibility on offer to show off this elegant looking speaker and we found all to work well during our testing.\nFrom the top all the way through the mids and low end of the frequency range, the Beolab 8 delivers an expansive, energetic and exciting sound quality. In our review, we said that “there’s an articulacy to the way the Bang & Olufsen handles the midrange that’s by no means a given in any speaker – even one as optimistically priced as this one”. We also wrote that these are some of the best wireless speakers we’ve ever tested. The only downside? We recommend you don’t listen to it at big volumes – that can skew the speaker’s sonic balance a little.\nThe speaker has a simple but bold design, and it’s impeccably well made and finished. At 189 x 290 x 165mm, the Beolab 8 is big enough to look like it means business – after testing it for ourselves for several weeks, we know it stands out in any room. Having said that, it is small enough to be either decorative or discreet, depending on what you prefer and how you position it. There are several slightly different shades and finish options. You’ll get ‘natural’ aluminum with a gray ‘mélange’ grille on a table stand for the lowest price – which is still incredibly high – and you'll have to pay more for a ‘gold tone’ with a light oak grille or ‘black anthracite’ with dark oak grille.\nThere’s no denying this is one exceptionally good-looking and excellent-sounding speaker. But does it justify its high price tag? That comes down to what you value the most. If it’s the best possible build and sound quality, and super-cool design, then this hits the brief and some.\nRead the full Bang & Olufsen Beolab 8 review\nFeatures | You get support for wired, wireless, Wi-Fi, AirPlay 2, Bluetooth 5.3 and more. Control app is good, as are touch controls. No voice control though. | 4.5/5 |\nSound quality | Expect a powerful, detailed and energetic listen. There's also a good presence and control in that low end. | 4/5 |\nDesign | A distinctive design with a high level of build and finish. A couple of different finish options to choose from. | 4.5/5 |\nValue | Very expensive. Worth it, but only if you love B&O's commitment to premium materials and a unique design. | 3.5/5 |\nThe best wireless speakers: Score comparison table\n| Header Cell - Column 0 | Features | Sound quality | Design | Value |\n|---|---|---|---|---|\nJBL Authentics 200 | 4.5/5 | 5/5 | 4.5/5 | 4/5 |\nApple HomePod Mini | 4/5 | 4/5 | 4/5 | 4/5 |\nBowers & Wilkins Zeppelin Pro Edition | 4.5/5 | 4.5/5 | 5/5 | 4/5 |\nCambridge Audio Evo One | 5/5 | 4.5/5 | 4.5/5 | 4/5 |\nSonos Roam 2 | 4/5 | 4/5 | 4.5/5 | 3.5/5 |\nKEF LS50 Wireless II | 4/5 | 5/5 | 4.5/5 | 4/5 |\nSonus Faber Omnia | 4/5 | 4/5 | 5/5 | 3.5/5 |\nSonos Era 300 | 5/5 | 4.5/5 | 4/5 | 4/5 |\nBang & Olufsen Beolab 8 | 4.5/5 | 4/5 | 4.5/5 | 3.5/5 |\nOther wireless speakers to consider\nB&W Zeppelin (2021): Take a look at our Bowers & Wilkins Zeppelin (2021) review and you'll see we gave it a rare 5 out of 5 rating. Why? It sounds amazing, looks stunning and works well. The only reason it's not longer in this guide is the company released the latest model, which is currently in the guide above as our 'best under $1000' pick.\nBluesound Pulse M: We recently tested this wireless speaker and although we rated the detailed hi-res audio and simple design, as you'll see from our Bluesound Pulse M review, the whole package just didn't live up to expectations, especially for the price.\nEdifier D32: If you enjoy a vintage vibe, this speaker should look the part in your home. You won't find booming bass and power for big parties here, but if that's not a priority for you, then this is a lovely-looking choice that delivers high-res sound and style for a decent price. Read our full Edifier D32 review for more.\nKanto Ren: Now, these aren't wi-fi enabled, so why are we mentioning them? Well, read our Kanto Ren review and you'll learn that these 5 star rated stereo speakers are powered (so no need for separate amps) and also boast Bluetooth connectivity. Which means if you want something to plug into your TV, laptop or other setup that also has Bluetooth baked in, the sound is truly sensational.\nKEF LSX II LT: We rated this excellent, simple streaming hi-fi system highly in our KEF LSX II LT review and it's an ideal smaller and cheaper alternative to the LS50 II Wireless in the guide above.\nMeridian Ellipse: Glance quickly at our Meridian Ellipse review and you might think you were looking at the B&W Zeppelin (above) but it's actually quite a different beast – and not always in a good way. It's crammed with smarts and looks the part, but we think it's missing the low end clout it needs for this kind of money…\nSonos Era 100: For a long time, the Era 100 was our top overall pick, and while we now think there are better options, it’s still a fantastic speaker. With excellent detail, clarity, and bass, it remains a solid choice. Read our full Sonos Era 100 review to see why we love it. However, as time has passed, newer models have surpassed it in value and audio performance, making it a little less competitive than it once was.\nSonos Five: Once our top pick for the best connectivity, the Sonos Five has now been overtaken by the newer Cambridge Audio Evo One. That said, it’s still worth considering for its room-filling sound and Sonos and AirPlay integration. However, the lack of Bluetooth and hi-res support means it’s no longer our top choice. Read our Sonos Five review to learn more.\nOther AirPlay speakers: If you're on the hunt for other wireless speakers, do also take a look at our best AirPlay speakers guide. This is packed full of wireless options that work particularly well with Apple's wireless streaming tech – although they're not all from Apple. You'll find speaker options from KEF, Naim and Sonos, too.\nHow to choose the best wireless speaker\nIt's not easy when the market is awash with wireless, cubes, oblongs, teardrops cylinders and cushions all claiming to be the best, is it? If casting music from your phone or any other Bluetooth device is important to you, a Wi-Fi only connection (even if it uses Apple AirPlay 2) may not be sufficient.\nBut when it comes to picking a new wireless speaker for your home, room-filling sound is key, so look for models that feature 360-degree grilles and disperse audio at all angles. If it's true audio fidelity you're after, opt for trusted brands such as Sonos, Bowers & Wilkins and KEF – speakers from these companies are always likely to sound brilliant.\nIf you have an iPhone or an iPad, it might also be worth checking out the best AirPlay speakers, which allow you to stream music, podcasts or audiobooks directly from your devices to your speaker. That means room-filling sound from your phone without the need for a more complex entertainment set-up. With so many fantastic home wireless speakers on the market right now, we’ve selected and ranked only the best ones to include in this buying guide.\nAre Sonos wireless speakers still worth buying?\nSonos speakers are still a good choice. However, you should know that Sonos rolled out big changes to its app in 2024. These changes caused frustration among Sonos fans because key features were missing or harder to access, and the rollout felt rushed. Backlash to the changes was loud, which is why Sonos has steadily been issuing updates to restore missing functionality and improve the overall experience.\nWith all that in mind, we do think the core appeal of Sonos remains intact and the app has been restored to working very well, in our experience. Sonos products deliver strong audio quality, seamless multi-room support, and lots of compatibility with streaming services and smart home systems.\nSo if you're already in the Sonos ecosystem or considering a Sonos speaker, we still think Sonos devices are absolutely worth buying. However, do keep an eye out for news about ongoing updates – especially if the app experience is a top priority for you.\nWhat are the best wireless speaker brands to look out for?\nIt really depends on what kind of speaker you're after. If you want multi-room connectivity and excellent sound, look for home speakers from Sonos.\nNeed a smart speaker? Check out models in the Google Nest and Amazon Echo ranges (and if you're a Siri user, Apple). Bear in mind though, you're not stuck with these brands if you need a voice assistant, as many third-party speakers come with Alexa and Google Assistant compatibility.\nIf it's pure audio fidelity you're after, brands like KEF, Naim, and Devialet are worth looking into. And, for portability, check out the likes of JBL, Ultimate Ears, Bose, and Urbanista.\nWhat is the difference between these wireless speakers and a Bluetooth speaker?\nThe key difference about what's in this guide compared to our list of the best Bluetooth speakers lies in Wi-Fi support. Wireless speakers often connect via Wi-Fi, which provides a more stable and high-quality audio stream. That’s because the Wi-Fi connection allows larger data transmissions, which results in better sound quality, especially with high-resolution audio files. Wi-Fi speakers can also connect to multiple devices simultaneously, making them ideal for multi-room setups controlled via apps.\nIn contrast, Bluetooth speakers connect directly to devices like smartphones, tablets, or laptops using Bluetooth. While convenient and portable, Bluetooth has a shorter range and can be more prone to signal interference and compression, which can affect audio quality.\nHowever, when considering the difference between wireless speakers and Bluetooth speakers, it’s also worth considering that most of the best wireless speakers also have Bluetooth built-in, bringing you both options.\nWi-Fi is relatively uncommon in portable speakers, because it uses a lot more power than Bluetooth, and usually requires a network to connect to. However, there are some portable options in this guide.\nWhat are the disadvantages of wireless speakers?\nThere’s a lot to love about wireless speakers, but they do have some disadvantages compared to wired speakers. One of the main drawbacks is that they’re dependent on a stable Wi-Fi network. This means that if your Wi-Fi signal is weak or inconsistent, you might experience interruptions or poor sound quality. Setting up wireless speakers can also sometimes be more complex, requiring apps and network configurations.\nAnother potential downside is latency. Wireless connections can sometimes introduce a slight delay in audio transmission. This could be noticeable when you’re watching videos or playing games. Battery life can also be a concern for portable wireless speakers, as they’d need regular charging.\nCan I use a turntable with wireless speakers?\nYes, you can likely use one of the best turntables with wireless speakers, but exactly how will depend on the speakers or the turntable. The simplest option is, of course, if your turntable has wireless capabilities. There are products like the Cambridge Audio Alva TT V2 that can broadcast Bluetooth to headphones or wireless speakers, while some support Wi-Fi to play to certain wireless system, such as the Sonos-friendly Victrola Stream Carbon.\nHowever, a lot of wireless speakers have wired inputs, and they always have their own built-in amplification, so these can be connected to a turntable use RCA wired cabling… as long as either the turntable or wireless speaker has a phono stage pre-amp built in. This is common in turntables, but much less common in speakers, so make sure you've got this somewhere in there.\nFinally, there are adapters that you can plug a turntable into to add wireless transmission to them, such as a WiiM Pro Plus or a Sonos Port.\nWhat streaming services do wireless speakers work with?\nMost of the best wireless speakers support several different streaming services. But it depends on the brand. Spotify, Apple Music, Amazon Music, Tidal and Deezer are among the most commonly supported streaming services. Qobuz is fairly common as well.\nRoon is less common, but is often supported by higher-end models.\nIt's also worth mentioning that if you’re a big podcast or audiobook listener, you'll need to make sure your speaker supports the apps you use most – or that it has Bluetooth as a backup. If you have Bluetooth (or Apple AirPlay and Google Cast, to a degree), you can play basically anything from your phone or other device.\nAre wireless speakers' connections reliable?\nGenerally, yes. However, it does depend on your home Wi-Fi. Wireless speakers rely on a strong, stable signal to deliver quality sound. In most homes with a decent router, you’ll get a smooth experience with little to no dropouts.\nBut if your Wi-Fi is patchy or overloaded, you might experience some lag or interruptions. Multi-room setups are especially sensitive to network strength, so it might be worth considering a Wi-Fi mesh system or positioning your router centrally for the best possible results – or even using an Ethernet cable to connect directly to your router.\nBluetooth tends to be very stable if you're in the same room, but will drop of quickly when walls get in the way.\nWhat's the best multi-room wireless speaker system?\nSonos is still one of the best choices. Its multi-room setup is intuitive, reliable and it works across a range of speaker types and budgets, which means that you can start with one speaker and expand room by room.\nSonos earned a lot of complaints in 2024 when it changed its app drastically, in a way that broke features and massively reduced reliability. The app has improved a lot since then, and works well now.\nBut there are other strong options too. In the guide above, several of the picks have some multi-room functionality, including brands such as JBL, Bowers & Wilkins and Cambridge Audio.\nGoogle Cast and Apple AirPlay can offer multi-room support using speakers from different brands, which is useful for mixing and matching what you need.\nGoogle and Amazon also support multi-room setups for their smart speakers.\nWill a wireless speaker work if my internet goes down?\nThis would depend on how your speaker is set up. If you’re streaming directly from the cloud, such as using Spotify Connect or playing music from Apple Music via the Sonos app, then yes. No internet would mean no music.\nHowever, if your speaker also supports Bluetooth, AirPlay/Google Cast, or has an aux input, then you’ve got a backup plan. You would be able to switch to local playback from your phone or laptop until the connection’s back.\nBluetooth and an aux input don't require your network at all. AirPlay and Google Cast both use your home's Wi-Fi network – but this may still be working even if you're internet is down. If it's just the internet that's not working and you have saved music on your phone, you're fine; if your Wi-Fi went down along with the internet, then Bluetooth or aux-in are the only options.\nHow we test the best wireless speakers\nAt TechRadar we get our hands on many wireless speakers throughout the year, which means we know which features and specs to look for – and we know that the best ones can sound just as good as a traditional stereo speaker system if you treat them right.\nIt's important for us to compare the performance of these speakers against the specs claimed by their manufacturers, so we take the time to make sure the claims are legit.\nWe make sure to test a speaker against its chief competitors for sound and features, such as multi-room compatibility and app support, so you can be sure that the product is the best if we say it is. We live with these speakers in our homes to make sure that their performances are consistent, and we don't finalize our testing until we are certain of the sound quality.\nWe test the audio performance using a range of musical genres and stream from various sources, to ensure that these speakers can handle everything from thumping dance tracks to softly-spoken podcasts.\nAfter years testing all of the latest audio tech, we are truly confident that our star-rated reviews are the best indication of the quality of the wireless speakers in this list. There are no sales teams involved in our verdicts, which means if we don't like it for sound, design, usability and features, we simply won't recommend it here.\nThe latest updates to this best wireless speakers guide\nJuly 22, 2025\nChecked all products against our latest reviews and price changes. Created a comparison table at the end of the guide to give readers a quick glance at how the recommended products stack up. Added the Edifier D32 to our list of other products to consider. Added several new entries to the FAQs.\nJuly 18, 2025\nRemoved the Edifier D32 and added it to our 'Also consider' section instead. Created a comparison table at the end of the guide to give readers a quick glance at how the recommended products stack up. Added several new entries to the FAQs. Checked the entire guide to ensure everything is up to date.\nSee more updates\nMay 21, 2025\nAdded 'buy it if / don't buy it if' boxouts for each entry to help you more quickly see which device best suits you. Added scorecards under each device based on our testing. Added the KEF LSX II LT to our 'also consider' section. Updated our FAQ section to include the latest information about Sonos.\nMarch 14, 2025\nRefreshed the introduction. Swapped out the Sonos Five as our 'best for connectivity' pick and replaced it with the recently reviewed Cambridge Audio Evo One. Also switched the Sonos Era 100 for the B&W Zeppelin Pro in our 'best under $1000' slot. Added those two speakers that are no longer in the guide to our 'also consider' section (as well as the newly-reviewed Meridian Ellipse), because they'll still be solid choices for some people. Moved some of our recommendations around to make the guide more current and easier to scan for our readers.\nJanuary 23, 2025\nRefreshed the introduction. Added a mention of the rumored HomePod mini 2 in our HomePod mini entry. Added some new products into the 'also consider' section, including the Bluesound Pulse M. Created galleries for each product entry so readers can get a better sense of how the recommendations look.\nDecember 5, 2024\nRewrote the introduction. Added an 'also consider' section for readers who want more choice. Refreshed our Apple HomePod Mini entry to reflect the fact the speaker is a little older than some options, but still our top Apple pick. Added the JBL Authentics 200 as our top 'best for sound' pick, replacing the B&W Zeppelin. Switched the Sonos Roam for the new Sonos Roam 2 as our 'best portable' choice.\nOctober 3, 2024\nRewrote the introduction. Added the Edifier D32 as our 'best retro-look' pick based on our testing, appealing to those who like a vintage aesthetic.\nAugust 5, 2024\nChecked all products against our latest reviews. Added more information to our FAQ section to help with key queries about wireless speakers.June 5, 2024\nChecked reviews against our latest reviews. Expanded our write-ups of each product to make it easier to see where their strengths and weaknesses are.\nFebruary 13, 2024\nAdded the Bang & Olufsen Beolab 8 as the best money no object wireless speaker you can buy and reviewed current rankings against available models.\nDecember 13, 2023\nChecked rankings against recent reviews and made some small copy enhancements throughout the guide to make sure nothing was out of date.\nSeptember, 6 2023\nWhile no new reviews are in yet, we decided to remove the Marshall Stanmore due to it being succeeded by second and third generation models.\nJuly 18, 2023\nIntroduced a new quick list navigation, lead image and reordered list, adding in Sonos' new Era 100 and Era 300 speakers.\nSign up for breaking news, reviews, opinion, top tech deals, and more.\nBecky became Audio Editor at TechRadar in 2024, but joined the team in 2022 as Senior Staff Writer, focusing on all things hi-fi. Before this, she spent three years at What Hi-Fi? testing and reviewing everything from wallet-friendly wireless earbuds to huge high-end sound systems. Prior to gaining her MA in Journalism in 2018, Becky freelanced as an arts critic alongside a 22-year career as a professional dancer and aerialist – any love of dance starts with a love of music. Becky has previously contributed to Stuff, FourFourTwo and The Stage. When not writing, she can still be found throwing shapes in a dance studio, these days with varying degrees of success."
    },
    {
      "url": "https://www.techradar.com/audio/speakers/focal-diva-utopia-review",
      "text": "TechRadar Verdict\nAs an object lesson in what can be achieved when two hugely credible audio companies spend half a decade crafting a product, the Focal Diva Utopia is impeccable.\nPros\n- +\nFull-scale, full-fat sound with dynamism and dexterity to burn\n- +\nProfoundly individual looks, impeccable build and finish\n- +\nExtensive specification\nCons\n- -\nWill overpower anything but a large listening space\n- -\nPhysically and financially imposing\n- -\nSpecification could conceivably be even more extensive\nWhy you can trust TechRadar\nFocal Diva Utopia: Two-minute review\nLet’s be polite in our choice of word, shall we, and describe an asking price of $39,999 / £29,999 / AU$59,999 for a pair of wireless active speakers as ‘punchy’? Focal has leveraged both its own long-established expertise (and that of its sister company Naim) and spent five years developing what the asking price insists must be the most accomplished, least compromised wireless music streaming system you can buy.\nCertainly it looks the part, as long as you consider ‘the part’ to mean ‘striking and dramatic’. The quality of construction is unarguable, and the finish is currently unique in the world of loudspeakers. There are numerous control options, all of them expertly implemented. And it’s specified without apparent compromise, to the point that it’s ready to do unashamedly high-performance things to all your favourite music no matter where it’s stored.\nWhen it comes to performance, there’s virtually nothing to take issue with. As long as your room is large enough for the Diva Utopia to stretch out and properly express itself, it will reward you with a sound that combines muscularity, insight, scale and attack with the sort of deft manoeuvrability and rhythmic positivity that makes every listen an event. It’s a staggeringly accomplished system with a list of talents as long as your arm – which, in the context of the asking price, is exactly as it should be.\nWill they enter our best stereo speakers roundup very soon? That's hardly fair since most products within our guide are a mere fraction of the Diva Utopia's asking fee. That said, if you've got this kind of money, they're well worth it, and we never make such statements glibly.\nFocal Diva Utopia review: Price & release date\n- Released October 2, 2024\n- Priced $39,999 / £29,999 / AU$59,999\nThe Focal Diva Utopia launched on 2nd October 2024, and in the United Kingdom they cost a not-inconsiderable £29,999 while in the United States they will set you back an equally significant $39,999. The price in Australia is AU$59,999.\nNeed I say with undue emphasis that this is an awful lot of money for a wireless audio system in a pair of loudspeakers? That expectations in every respect – design, build, finish, specification, performance, you name it – are, inevitably, sky-high? That anything less than across-the-board excellence must count as a failure? No pressure then, Focal…\nFocal Diva Utopia review: Features\n- 800 watts of Class AB power in total\n- 32bit/384kHz native DAC resolution\n- Numerous analog and digital input options\nApparently Focal has, in conjunction with sister company Naim, been working on the Diva Utopia for the past five years. Obviously that’s quite a chunk of time for a product to be in development – but it’s sufficient time for a product’s feature-set to be specified without apparent compromise, too.\nSign up for breaking news, reviews, opinion, top tech deals, and more.\nEach Diva Utopia is a three-way bass-reflex speaker. Near the top of the front baffle there’s a 27mm pure beryllium ‘M’-shaped inverted dome tweeter – it sits behind a red/black ‘double’ grille that appears to change colour and brightness as you move around the speaker. Beneath it there’s a 165mm ‘W’ mid/bass driver with tuned mass damper surround and a ‘neutral inductance circuit’ motor of the type Focal has been refining for quite some time.\nOn each of the speaker’s side panels there are a pair of 165mm ‘W’ bass drivers arranged in a push/push configuration. The output of this quartet is augmented by a downward-firing bass reflex port that vents against the fixed boundary of the speaker’s integrated aluminium plinth.\nThere’s a total of 400 watts of Naim Audio-designed Class AB amplification on board each speaker to power this driver array. The tweeter and the mid/bass driver get 75 watts each, and the remaining 250 watts is divided between the four bass drivers. Focal reckons this is an arrangement that’s good for a frequency response of 27Hz - 40kHz.\nAs is the way with the majority of products of this type, one speaker does all the heavy lifting where connectivity is concerned. So one of the Utopia Diva has just a mains power socket and an RJ45 socket for making a hard-wired connection to its partner on its rear panel, the other is taking care of business. It features the same mains power input and RJ45 system link, and also has the same substantial heat-dissipating radiator arrangement that’s more than a little reminiscent of Naim’s statement Statement amplification. But it also incorporates an RJ45 for Ethernet, a Type 2.0 USB-A slot, a digital optical input, a line-level stereo RCA input, and an HDMI eARC socket. With the possible exception of a phono input for use with an unamplified turntable, it’s difficult to know what else Focal might have included where physical connectivity is concerned.\nWireless stuff is handled by Bluetooth 5.3 with aptX Adaptive codec compatibility, and dual-band wi-fi. Wi-fi (or Ethernet, if you prefer) brings Apple AirPlay 2, Google Cast, Spotify Connect and TIDAL Connect into play – the Diva Utopia is UPnP-compatible, too, although it’s not Roon Ready. Internet radio is available, and both Qobuz, and QQMusic via QPlay (for Chinese customers) are also accessible via the dedicated control app. All incoming digital signals, whether wired or wirelessly received, are dealt with by a 32bit/384kHz DAC that’s also compatible with DSD128.\nFocal has deployed UWB (ultra wide band) technology to ensure latency between the two speakers is negligible. When the speakers are connected wirelessly, resolution tops out at 24bit/96kHz - but use the supplied RJ45 cable to make a physical connection between the two and 24bit/192kHz can be yours.\n- Features score: 4.5/5\nFocal Diva Utopia review: Sound quality\n- Deftly dynamic presentation\n- Scale and muscularity combined with detail and insight\n- Requires a fair bit of breathing space\nJust imagine what a story it would be if the Focal Diva Utopia, with its remarkable looks, extensive specification and terrifying price-tag, didn’t actually sound all that good? What a story that would be…\nBut it’s a story that will have to wait for another day – because in the simplest terms, the Diva Utopia sounds bloody marvellous. It’s a profoundly accomplished, endlessly engaging and thoroughly enjoyable listen, a system that revels in any and every type of music, and that is seemingly capable of wringing the last drop of detail from a recording.\nNo matter if it’s decoding, amplifying and delivering an Amazon Prime Video stream of Nick Cave & The Bad Seeds’ Distant Sky via its HDMI eARC socket, dealing with a (pre-amplified) vinyl copy of Mary Lattimore’s And Then He Wrapped His Wings Around Me or giving the treatment to a TIDAL Connect stream of a 24bit/96kHz FLAC file of What Goes On by The Velvet Underground, the Focal system is is complete command of the material. It combines iron-fisted low-frequency behaviour, unarguable dynamic potency and a forensic level of insight that ensures you always feel like you’re getting a complete account of a recording - and at considerable scale.\nLow-frequency presence is, unsurprisingly, significant. The system digs deep and hits hard, but loads bass information with an absolute stack of detail concerning tone and texture, and is so positive and straight-edged in its control that rhythmic expression is never a concern. It’s deft enough to skip through a complex double-bass part, muscular enough to attack a hip-hop drum pattern, dynamic enough to make the harmonic variations in a timpani obvious.\nAbove there, the midrange communicates in an absolutely explicit, torrential manner. No transient detail is too minor or too fleeting to escape it, and no singer has yet made a recording that can’t have the nuance of emotion, attitude and character of their performance teased out of it. At the top of the frequency range, the Focal is more than substantial enough to give treble sounds proper presence, detailed enough to make the gauge of, say, a cymbal obvious, and attacking enough to really sink its teeth into the brightest and/or splashiest high-end stuff.\nThe tonal balance is carefully and convincingly neutral, and the crossover between the drivers is imperceptible. The entire frequency range hangs together as if it was being produced by a single driver, and there’s no understatement or overplaying of any particular area. The Diva Utopia is a naturalistic as they come where this sort of thing is concerned.\nDynamic headroom is superabundant, as seems only reasonable when you consider the sheer amount of power that’s on tap here. When Michael Tilson Thomas shifts the Cleveland Symphony Orchestra and Chorus into top gear during Orff’s Carmina Burana the sheer amount of drive and attack that the system can summon is almost shocking. But all of this barn-burning intensity is not at the expense of subtlety – when the going gets mild and contemplative, the Focal can cosset with the best of them. And no matter the specific circumstances, the soundstage the Diva Utopia creates is large, three-dimensional and entirely convincing. Even a full-scale orchestra with massed chorus enjoys sufficient elbow room.\nEverything the system does, it does without seeming to make all that much of an effort. There’s an almost casual authority about the way it goes about things, a suggestion that ‘there’s plenty more where that came from’. I’m not sure if the Diva Utopia can be provoked into sounding in any way stressed or otherwise uncomfortable – all I know is I haven’t been able to do so. And believe me, I have tried.\nIt follows that downsides are few. In fact, it’s really only the amount of breathing space the system needs that is noteworthy. I’m going to go ahead and assume that anyone with 30 grand to spend on a couple of speakers has a fair amount of space in which to position them – but in a room that’s anything less than ‘really quite large’ the Diva Utopia can overwhelm. And that, really, is about the only note of caution I can sound.\n- Sound quality score: 5/5\nFocal Diva Utopia review: Design\n- High-density moulded polymer cabinet\n- Gray felt finish (with other colors to follow)\n- Floor-spikes or castors\nEach Diva Utopia loudspeaker is 121 x 42 x 56cm (HxWxD) and 64kg – and consequently is quite imposing. But while Focal has obviously designed this system for optimum performance, it hasn’t allowed the opportunity to inject a little visual drama into the ownership experience to pass it by.\nThe cabinets here are made from high-density moulded polymer, and are structurally reinforced to produce a rigid structure that rejects vibrations almost entirely. Each one stands on an injected aluminium base that is pre-fitted with castors – these can be swapped for chunky, high quality floor-spikes that are also supplied, along with discs they can stand in to protect your floor’s finish. The angularity of the cabinet, especially the top section that houses the tweeter, is a) recognisable to anyone who’s familiar with the Utopia range, b) dictated by sound acoustic principles, and c) more than a little reminiscent of an H.R. Giger creation.\nFocal has finished these cabinets with a robust, tactile grey felt cloth – it combines, says the manufacturer, elegance and minimal environmental impact. Other colors are likely to be available in the future.\nIt’s certainly a point of difference from high-gloss colors or wood finishes, and it gives the speakers a slightly ethereal look. The division between the side panels (which also include contrasting grille covers for the side-firing bass drivers), where the obligatory illuminated ‘Focal’ logo sits proudly, is brilliantly consistent – Tesla could learn a thing or two about panel gaps from Focal, that’s for sure. The overall quality of the finish is basically flawless and, even if it’s not your cup of tea, you can’t deny that it makes the Diva Utopia look distinctive.\n- Design score: 5/5\nFocal Diva Utopia review: Setup and usability\n- Focal & Naim control app\n- Voice assistant-compatible\n- Zigbee remote control handset\nObviously these are large, heavy loudspeakers. But Focal has gone to reasonable lengths to make installation and set-up as straightforward as possible.\nThe speakers arrive with the castors pre-fitted, and it’s actually quite straightforward to wheel them out of their necessarily large boxes using the little wooden ramp that’s inside. After that, it’s easy enough to get them positioned as you’d like (although if you decide to put them on the supplied floor-spikes, as you really should, you’ll need the help of at least one additional volunteer).\nThe system also ships with a ‘Zigbee’ remote control that will be familiar to anyone with experience of Naim electronics over the last decade or so. The Diva Utopia is also compatible with your preferred voice assistant – but it’s the Focal & Naim app where the real action is. As well as the usual stuff like saving some favourites and assigning presets, checking for firmware updates and what-have-you, it also features a comprehensive room correction routine into which the end user gets an unusual amount of input (although Focal’s assertion that it is ‘fun’ is, I am prepared to say here and now, a false alarm). It allows you to enable or disable specific inputs to keep the homepage nice and clean, trim the output level of specific inputs, and plenty more besides. The app was in ‘beta’ at the time of testing, but even in less-than-perfect shape it proves clean, logical, reliable and stable.\n- Setup and usability score: 5/5\nFocal Diva Utopia review: Value\nYou might argue that $39,999 / £29,999 for a wireless music streaming system can’t possibly represent value for money, and to be honest you won’t get much of an argument from me.\nBut what I would point out is that it’s possible to build a high-end music system of the more traditional type and spend way more money than this, that the Diva Utopia is an architectural talking-point as well as a superbly adaptable music system, and that quality like this where both industrial design and sonic performance are concerned seldom comes cheap.\nOn a pound-for-pound basis it’s difficult to make the case that you’re getting notable value here – but if you can afford it, I say go right ahead. I know I will if my numbers ever come up…\nShould you buy the Focal Diva Utopia?\nBuy it if...\nYou want what is definitely the best wireless streaming system costing less than six figures\nIt doesn’t have a huge amount of competition at the price, it’s true - but nevertheless the Focal Diva Utopia is a tremendously accomplished product\nYou have a fairly large room in which to put it\nThese are big speakers that are capable of big sound – and they will prove altogether too much of a good thing in smaller spaces…\nYou enjoy muscular, poised and endlessly communicative sound\nIf there’s an aspect of music reproduction that the Diva Utopia isn’t in complete command of, I’ve yet to identify it\nDon't buy it if...\nYou think this sort of money should buy amplification for a turntable\nIf a system is really going to be all-in-one (or even all-in-two) then a phono stage for use with a record player really needs to be on the menu\nYou’re a Roon subscriber\nFocal has its reasons for shunning Roon, but well-off music streaming aficionados tend to have music on a number of different platforms that it’s nice to aggregate…\nYou have a badly behaved cat\nThat felt finish is a visual and tactile delight – but if I owned the Utopia Diva, I’d be concerned that I wasn’t the only one who thought so…\nFocal Diva Utopia review: Also consider\nAs far as all-in-two music streaming systems are concerned, there’s not a lot of competition for the Diva Utopia at a similar sort of price – even the never-knowingly-underpriced Bang & Olufsen can only offer its Beolab 28 high-resolution wireless stereo speakers, and they’re around half the price of the Focal.\nOf course, it’s possible to build a system that does much of what the Diva Utopia can do by checking out amplification, passive loudspeakers and a music streamer at around ten grand a pop - but that’s not going to have the same sort of visual impact or ergonomic tidiness of the Focal. The Diva Utopia, then, currently seems to be number one in a field of one…\nFirst reviewed: October 2024\nRead more about how we test at TechRadar\nSimon Lucas is a senior editorial professional with deep experience of print/digital publishing and the consumer electronics landscape. Based in Brighton, Simon worked at TechRadar's sister site What HiFi? for a number of years, as both a features editor and a digital editor, before embarking on a career in freelance consultancy, content creation, and journalism for some of the biggest brands and publications in the world.\nWith enormous expertise in all things home entertainment, Simon reviews everything from turntables to soundbars for TechRadar, and also likes to dip his toes into longform features and buying guides. His bylines include GQ, The Guardian, Hi-Fi+, Metro, The Observer, Pocket Lint, Shortlist, Stuff T3, Tom's Guide, Trusted Reviews, and more."
    },
    {
      "url": "https://www.techradar.com/audio/best-of-high-end-munich-2025-audio-show-our-top-5-products-from-headphones-to-a-tube-amp-portable-cd-player",
      "text": "Best of High End Munich 2025 audio show: our top 5 products, from headphones to a tube amp portable CD player\nHear hear\nThe High End Munich 2025 audio show has brought its usual excellent, extravagant and extremely expensive mix of speakers, headphones and hi-fi gear this year – though 2025 also continued the show's recent trend of including more affordable options.\nWe've scoured the whole show floor – and its many, many side rooms – for the most interesting new releases that are the type of products TechRadar usually covers, to see which are worthy of one of our 'Best of High End Munich 2025' awards.\nThis means we're looking less at stereo speakers that cost five figures (though check out the Munich coverage from our friends at What Hi-Fi? for that), and more at the kind of headphones, wireless speakers and music players we usually review.\nWe only had five trophies to give out, so the competition was extremely tight this year, despite us focusing on newly unveiled products only; there were lots of truly excellent launches that just missed the cutoff. But here are our picks of the High End Munich winners that just pipped them to the post.\nBest headphones\nMeze Audio 105 Silva\nFiring up these wired headphones, I was struck immediately by the intense physicality to their sound, expressed in everything from the papery rasp of vocals to the imperfect impact of a stick on a drum skin. It's all captured and expressed in the detail here, giving instruments a wonderful weight and sense of reality.\nThat's backed up by deep and gut-busting bass, which is magnificently controlled despite being heady, and which helps to build that feeling of real-life impact from the recorded instruments. But it's never overwhelming – the 105 Silva are really dynamic, and really sharp off the mark for transients.\nThese headphones have a striking design, as most Meze headphones do, and a very comfortable headband design that leads to them feeling very wearable overall – though I'll be interested to see if they get a little warm when we eventually review them, or if that was just the toasty show floor…\nSign up for breaking news, reviews, opinion, top tech deals, and more.\nAre they contenders for our list of the best wired headphones? Well, I had a lovely time testing them at the show, but we'll see how they hold up again the tough competition at their likely $600/£500-ish price. They're due out later in 2025.\nBest portable speaker\nWe Are Rewind GB-001\nWe said that the boombox is back when we covered the announcement of this, and whatever you call it, it's the real deal.\nYou've got 100W of speaker power here to play music that's connected over Bluetooth, aux-in or – most notably – from its built-in cassette deck. Yes, following We Are Rewind's first Bluetooth tape player revealed at CES this year, now we've got the logical next step.\nAll not-so-mod cons are here. You can record to cassettes either from the aux-in port or by connecting a microphone (but not from Bluetooth sources, alas), and there are twin VU meters on the front, and I can't tell you how much fun they are to see twitching up and up the dial as you crank up the volume.\nAnd crank you will, because the sound is fun, crucially. I wouldn't describe it as super high fidelity, and I was listening to it in a busy public space (though this actually felt quite appropriate for this product), but there's good driving low end to fulfill your funky outdoor dancing needs, and fair clarity to vocals. It performs better with Bluetooth sources than tape, delivering a bigger dynamic range with a bit more airiness to the high frequencies, but that's no surprise.\nIt's also lighter than I expected, and also not as expensive you might think: for £379 (expect about $449), you could find a better-sounding option among the best Bluetooth speakers – but not, I think, a cooler one. I love it.\nBest hi-res player\nAstell & Kern A&ultima SP4000\nThe new flagship portable music player from the company that defines flagship portable music players is here. Made with a solid shell of steel that's the same grade as that used by the likes of Rolex, and a hefty weight to match, it's beautiful bit of craftsmanship.\nNaturally, it's elite inside as well, packing a quad DAC setup that A&K's never managed to pull off before, despite trying hard.\nA&K also said this is its first player that uses full-fat Android with access to the Google Play store and therefore any music service you want easily – but told me that it's bypassed Android's handling of high-res audio files, which apparently isn't great for maintaining their quality. Instead the SP4000's own system will keep every bit in pristine condition.\nListening on A&K's own earbuds, it certainly sounds the business – full of range, power and with a deft touch for detail.\nWe'll give it the full review when it releases later this year, for an unknown (but definitely mid-four-figures) price. But from what I heard, it's likely to be the new elite king of the best hi-res audio players.\nBest Wi-Fi speaker\nWiiM Sound\nThe WiiM Sound was just announced alongside a new sub and amp for WiiM's range – and it's the first time that WiiM has released a speaker that it designed itself.\nWiiM's system is aiming to be a direct competitor to Sonos, but as far as speakers go, it had only worked with others in the past, putting its system into speakers from Audio Pro.\nNow it's done its own thing, and it's a fun mix of the familiar and different. It's a little bigger than a Sonos Era 100, and looks slightly closer to the Apple HomePod 2 – and the speaker setup inside is just like the Sonos competitor, with two tweeters angled left and right, and a larger woofer facing forward.\nBut it has that round touchscreen on the front, which gives it a great look of its own, displaying artwork for the current track. Give it a tap and you unlock playback controls.\nObviously, it needed to sound good too to win this award, and I was impressed by the demo I got. There's a great thick layer of bass underpinning things like pop songs, but that felt well-heeled and controlled from my time with it. There was energy to the mid-range and vocals, and a width to the sound that should help it to fill small rooms really well.\nWe don't have pricing yet, but it's due out in \"Q3\" of 2025, so probably by October. I'm looking forward to seeing how it compares to the best wireless speakers – this really could be a danger to Sonos.\nBest physical media player\nShanling EC Zero T\nPortable CD players have been making a comeback as part of the retro music revival over the last few years, and I've seen several striking, square players like this recently.\nBut I was particularly charmed by the combination of the see-through cover and the use of dual tube amps inside the Shanling EC Zero T – another trend, where companies are seeing the value in adding a little extra analogue touch.\nWe've also seen tube amps in a hi-res player and directly in headphones recently. In this case, you can bypass the tube amp mode and stick with less delicate amplification if you're worried about microphonic noise when on the move.\nOn top of the tube amp, this has other tricks under its see-through lid. It has Bluetooth aptX HD output for the audio, it can work as a pure USB DAC using Shanling's own in-house RSR DAC, and you can run it either from its 5,500mAh battery or powered by USB in a desktop mode. There's a screen on the front to show options, and a lovely physical volume slider on the front edge.\nI listened to it with Shanling's own HW600 planar headphones, which it had no problem driving (planar headphones can be rather power hungry) and the combination was great – meaty, rich, energetic and crisp.\nWith a price of $589 planned for its release this year, it's not as expensive as I was fearing, either. I had a blast exploring everything it could do, and enjoying that combination of an ultra-modern looking square digital music player with the tube amps tucked under a clear panel on the front.\nYou might also like…\n- Audio-Technica's see-through turntable is so cool, it seems a shame to put your vinyl on it\n- This Bluetooth travel adapter for flights lets two headphones connect for shared viewing – and can be used to stream music to your car, too\n- Wharfedale's new Evo 5 speakers look perfect for music or home theater, at a price I can get behind\nMatt is TechRadar's Managing Editor for Entertainment, meaning he's in charge of persuading our team of writers and reviewers to watch the latest TV shows and movies on gorgeous TVs and listen to fantastic speakers and headphones. It's a tough task, as you can imagine. Matt has over a decade of experience in tech publishing, and previously ran the TV & audio coverage for our colleagues at T3.com, and before that he edited T3 magazine. During his career, he's also contributed to places as varied as Creative Bloq, PC Gamer, PetsRadar, MacLife, and Edge. TV and movie nerdism is his speciality, and he goes to the cinema three times a week. He's always happy to explain the virtues of Dolby Vision over a drink, but he might need to use props, like he's explaining the offside rule.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.techradar.com/tag/sonos",
      "text": "Sonos\nSonos was a pioneer in the world of audio, making the idea of seamless wireless multi-room audio a reality. Today, it still makes some of the best wireless speakers on the planet, but has expanded to soundbars, Bluetooth speakers for outside the home, and gear to help convert your classic hi-fi equipment into something wireless and modern.\nSonos’ app is the center of its products, and works with all the major streaming services, including Spotify, Apple Music, Tidal and more. Recently, the company has got into the idea of Spatial Audio, with its latest soundbars and speakers supporting Dolby Atmos 3D sound.\nFounded in California in 2022, Sonos has managed to survive the rise of competition from the likes of Apple, Amazon and Google – in fact, it’s thrived even as the world of wireless sound has become hotter and hotter.\nLatest about Sonos\nICYMI: the week's 7 biggest tech stories from GPT-5's rocky debut to Sonos' upcoming price hike\nBy Hamish Hector published\nThis week ChatGPT got an upgrade, and Tom Holland swung back into action as Spider-Man.\nSonos says it was wrong again, but in the best way: Sonos speakers do sound better now\nBy Carrie Marshall published\nSonos took to Reddit to concede that actually, its speakers do sound better now – which is good, because there will soon be price hikes\n'Later this year we plan to raise prices' says Sonos – and yes, it's a response to US tariffs\nBy Hamish Hector published\nIf you have your eye on a Sonos speaker and live in the US, you might want to act sooner rather than later – because price hikes are incoming.\nThe best soundbars for all budgets, all tested by us\nBy Matt Bolton last updated\nUpdated From budget-friendly bars to Dolby Atmos wonders, the best soundbars make it easy to get a serious TV audio upgrade.\nThe cheapest Sonos sales and deals for August 2025\nBy Mackenzie Frazier last updated\nBuilding a multi-room Sonos speaker setup? Check out the best Sonos deals on its best-rated soundbars and speakers.\nBest Sonos speakers and soundbars, as rated by our expert reviewers\nBy Matt Bolton last updated\nUpdated We've tested the best Sonos speakers to bring you a definitive list of the top speakers and soundbars available.\nThese cheap new noise-cancelling headphones have the style of the Sonos Ace for a fraction of the price – but you can still get Sonos' originals for an amazing discount right now, too!\nBy Carrie Marshall published\nIt's a good deal day for wireless headphones buyers on a budget – but if you can spend more, there's a good deal available\nPrime Day is almost over, but the Sonos Ace are still at the lowest price ever\nBy Jacob Krol published\nPrime Day 2025 is nearing its close, but you can still save $150 on the Sonos Ace headphones and score them for $299.\nSign up for breaking news, reviews, opinion, top tech deals, and more."
    },
    {
      "url": "https://www.techradar.com/televisions/dont-call-it-a-soundbar-kefs-new-dolby-atmos-soundbar-is-more-than-meets-the-eye",
      "text": "‘Don’t call it a soundbar’: KEF’s new Dolby Atmos soundbar is more than meets the eye\nKEF's first soundbar will rock you\nBritain’s KEF was on-site to demonstrate the new KEF XIO Dolby Atmos soundbar at Audio Advice Live 2025 in Raleigh, North Carolina, on August 1-3, and at first listen, the company’s first soundbar turned out to be everything I’d expected from the well-regarded speaker manufacturer.\nLike other examples of the best soundbars, the KEF XIO is a Dolby Atmos model that also supports DTS: X. It uses 12 total drivers in a 5.1.2-channel configuration powered by 820 watts. KEF is also working on a surround sound feature to support KEF wireless speakers, an upgrade that will make XIO systems 5.1.4-channel compatible when it arrives in fall 2025.\nAt $2,499 / $1,999 / AU$3,600, the XIO is priced at the high end of the spectrum compared to other top standalone soundbars such as the Sonos Arc Ultra. But KEF adds some design flourishes to the XIO to help justify the added cost, with a key one being an internal gyroscope that detects if the soundbar is installed in a wall-mount (vertical) or shelf (horizontal) configuration and configures the sound output accordingly. A similar feature can be found on the new Samsung HW-QS700F.\nThe XIO has a premium design with an aluminum top plate and fabric mesh grilles in black or silver finishes. Connections include HDMI eARC and optical digital inputs as well as an RCA output for a wired subwoofer connection. Wireless connection to a compatible KEF subwoofer, such as the KC62 model used in the company's Audio Advice Live demo, is also supported.\nAlong with Bluetooth, both AirPlay and Google Cast are supported for wireless music streaming, along with Spotify Connect and Tidal Connect. Amazon Music, Qobuz, Deezer, and more services can also be streamed over Wi-Fi via the KEF Connect app – available for Android and iOS – which is additionally used for setup and sound adjustments.\nMusic first\nTo support its claims for the XIO as a ‘high-performance audio system that happens to be in the form of a soundbar,’ KEF started its demo with a music track, Hey Laura, from Gregory Porter Live in Berlin. This vocal-led jazz track had a crisp, yet warm sound, and Porter’s vocals were natural and full-bodied. Also, instruments like guitar, standup bass, and drums all cut through clearly in the mix in a way that typical soundbars are rarely able to manage.\nThe We Will Rock You scene from the Queen biopic Bohemian Rhapsody turned out to be one of the more popular demo tracks at Audio Advice Live 25, and it sounded great on the XIO, with the super-compact KC62 subwoofer adding an extra layer of low-frequency depth to the fans stomping their feet on the stadium floorboards. KEF specs the XIO’s low frequency extension at 34Hz (+/-3dB), which should be plenty enough for most folks – a good thing, considering adding a single KC62 ($1,699) will boost the total system price to $4,198.\nSign up for breaking news, reviews, opinion, top tech deals, and more.\nKEF wrapped things up with the motorcycle race/King Kong scene from Ready Player One, another popular demo at the show, and the system’s clarity, dynamics, and sound effects positioning all exceeded my expectations for an all-in-one soundbar plus subwoofer-based system.\nThe KEF XIO is now available, and TechRadar’s full review will be posted shortly. It's still early to say, but from what I heard at Audio Advice Live 25, the KEF XIO may very well end up dominating the high-end all-in-one soundbar space.\nYou might also like\nAl Griffin has been writing about and reviewing A/V tech since the days LaserDiscs roamed the earth, and was previously the editor of Sound & Vision magazine.\nWhen not reviewing the latest and greatest gear or watching movies at home, he can usually be found out and about on a bike.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.techradar.com/televisions/home-theater/i-thought-i-knew-home-theater-bass-until-i-experienced-an-11-13-8-channel-demo-with-an-infrasonic-32-inch-subwoofer",
      "text": "I thought I knew home theater bass until I experienced an 11.13.8-channel demo with an ‘infrasonic’ 32-inch subwoofer\nBass that can be felt as well as heard\nGerman speaker maker Ascendo and France’s Trinnov are known for putting on breathtaking home theater demos, and the one they teamed up for at the recent Audio Advice Live 25 consumer show in Raleigh, North Carolina, which ran from August 1-3, was perhaps the best one yet.\nFor sheer immersive audio horsepower, the joint demo utilized Trinnov’s flagship Altitude 32-channel audio processor and a pair of Amplitude 16-channel amplifiers. That electronics stack was used to power an 11.13.8-channel Ascendo speaker system consisting of three The12 Passive On-Wall point source speakers up front as LCRs, a surround array consisting of The10 Passive On-Wall and The10 Passive Wedge 30 speakers, and eight The6 Passive Wedge 30 speakers used for height channels.\nI haven’t even mentioned the subwoofers yet! Six The16 Sub Active Sealed subwoofers were positioned at the front of the room, and six more at the rear to enable Trinnov’s WaveForming, a sophisticated type of room correction processing that can cancel out bass peaks caused by room modes while simultaneously filling in bass frequency dips for smoother and more evenly distributed bass throughout the listening environment.\nAlong with its 12-pack of 16-inch subwoofers, Ascendo also brought along a secret weapon: its The32 Pro Passive Sealed subwoofer, a model that uses an enormous 32-inch woofer to deliver ‘infrasonic’ bass that’s meant more to be felt than heard. In fact, The32 Pro is specified for 109 dB output @ 10 Hz.\nOther components of the demo included a JVC DLA-NZ900 projector, that company’s top 8K-capable model, paired with a madVR Envy video processor and a Kaleidscape movie player as a source.\nWe Will Rock You\nOne of the most popular home theater demo clips at Audio Advice Live 25 was Queen’s We Will Rock You from the movie Bohemian Rhapsody. The song’s boom-boom-clap rhythm makes it a good demo track for bass, and the movie soundtrack supplements it with the sound of a live audience stomping heavily on stadium floorboards.\nI’ve watched this clip many times, but never have I heard such a precise separation between the kick drum and the sound of stomping feet as in the Trinnov/Ascendo demo. The low bass was powerful, yet detailed, and there was a physical quality to it that I’ve mostly only heard in IMAX theaters.\nSign up for breaking news, reviews, opinion, top tech deals, and more.\nSpider-Man: Far from Home showed off the JVC 8K projector’s exceptional detail, contrast, and color definition, but it was also a showcase for the system’s immersive audio prowess. And the same could be said for Top Gun: Maverick, another hugely popular demo source at Audio Advice Live, and one that I have regularly used in my testing of the best soundbars and speakers.\nThe demo clip that most left my jaw on the floor, however, was one from 13 Hours: The Secret Soldiers of Benghazi. The intense firefighting in this Michael Bay-directed depiction of an American compound in Libya under attack was vividly rendered on the 11.13.8-channel system, with the sound of bullets flying coming from all around. The low bass was again very powerful, yet controlled, and I could certainly feel as well as hear it.\nNeedless to say, this demo involved a money-no-object system – the Trinnov Amplitude 32 processor alone costs around $40,000! But I’m glad I had the chance to experience it, and if you attend a future Audio Advice Live, you may get to do the same.\nYou might also like\nAl Griffin has been writing about and reviewing A/V tech since the days LaserDiscs roamed the earth, and was previously the editor of Sound & Vision magazine.\nWhen not reviewing the latest and greatest gear or watching movies at home, he can usually be found out and about on a bike.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.techradar.com/televisions/home-theater/i-listened-to-spatial-audio-on-a-7-4-4-channel-focal-speaker-system-and-now-i-need-to-up-my-dolby-atmos-music-game",
      "text": "I listened to spatial audio on a 7.4.4-channel Focal speaker system, and now I need to up my Dolby Atmos music game\nMusic to the immersive max\nFrench speaker manufacturer Focal is demonstrating a range of speaker setups and headphones at the Audio Advice Live show in Raleigh, NC, but the demo I was most excited to catch was its Utopia Cinema system.\nFocal’s 7.4.4-channel home theater setup consists of five Cinema LCR and two Focal 1000 IWLCR speakers, four Cinema Sub subwoofers, two IWSUB in-wall subwoofers, and four ICLCR5 in-ceiling Atmos speakers, all driven by a Focal Astral 16 audio processor and multiple Naim CI-NAP amps.\nThe system costs around $150,000 alone, with the Sony VPL-GTZ30 projector, 200-inch Stewart Filmscreen screen, and Kaleidescape movie player that Focal also used for its demo adding another 100K or so to the bill of sale.\nFocal screened several movie clips, including one of my reference go-tos for TV testing, the 2021 James Bond film No Time to Die, and the image from the 10,000-lumen Sony professional projector looked fantastically bright even on the enormous screen.\nThe sound was equally impressive, with the explosion when Bond makes an ill-advised visit to former flame Vesper Lynd’s gravesite conveyed with a level of impact and low-end rumble that one would expect to hear from six huge subs with dual 13-inch woofers.\nThe sweet sounds of Dolby Atmos music\nAs good as the Bond clip looked and sounded (and I have screened it innumerable times, so I know what to expect), what really grabbed my attention in Focal’s demo was the Dolby Atmos music selections.\nTwo songs were played, with the first being Elton John’s Rocket Man, from the 1972 album Honky Château. John’s piano had a solid yet wonderfully wide presentation that remained locked up front, while the soaring lead guitar and backing vocals spread above and around me in a manner that I found warm and engaging instead of gimmicky.\nSign up for breaking news, reviews, opinion, top tech deals, and more.\nThe next clip was a spatial audio remix of the electronic track On My Knees by Rüfüs Du Sol (those umlauts!) done by Techno Dad, a well-known YouTuber and friend of Focal. This was Atmos music to the max, with the trajectory of the bass-heavy, spatially adventurous mix graphically depicted in an onscreen display. Once again, I found myself utterly engaged, as well as curious to hear more demo-worthy Atmos music mixes, and on the best possible system.\nAfter a year or so settling for the best soundbars for music listening, it looks like I’m going to have to reinstall my big AV rig when I get home. Sadly, I’ll be limited to only one subwoofer, not six, but I’ll manage to make do.\nYou might also like\nAl Griffin has been writing about and reviewing A/V tech since the days LaserDiscs roamed the earth, and was previously the editor of Sound & Vision magazine.\nWhen not reviewing the latest and greatest gear or watching movies at home, he can usually be found out and about on a bike.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.techradar.com/news/best-stereo-speakers",
      "text": "The best stereo speakers 2025: top speaker systems for all budgets, tested by our experts\nNeed the best stereo speakers? Whether passive, powered or active, we've got you covered\nThe best stereo speakers deliver a complete home audio experience, combining the spacious sound of traditional passive setups with the convenience of modern (often wireless) technology. Every model in this guide has been rigorously tested by our expert audio team, who bring decades of combined experience reviewing hi-fi gear from top audio brands, like Dali, KEF, JBL, and Q Acoustics, to bring you only the very best recommendations.\nClassic hi-fi systems – with separate components like amplifiers, NAS drives, or turntables – will still appeal to audio purists. But today’s best stereo speakers offer far more flexibility. Many double as all-in-one multimedia speakers, and even casual listeners will notice just how immersive, detailed, and lifelike great stereo sound can be.\nWe love the best wireless speakers, but most come in a single unit. True stereo setups, with two independent speakers, create a much richer and more dynamic soundstage. If you’ve got the space – especially for floorstanding models – you’ll enjoy a more natural, textured, and responsive sound. And when you crank up the volume, these speakers don’t just keep up, they shine.\nIn this guide, you’ll find our expert team’s top picks across the board. From compact bookshelf speakers (some of which also appear in our best computer speakers roundup) to powerful floorstanders with built-in subwoofers designed to fill your room with sound.\nThe Quick List\nGet straight to it with our easy-to-browse list of the best stereo speakers for every setup and budget. Click through to jump straight to the full write-up of each model.\nBest overall\nBest stereo speakers overall\nAn all-in-one music system that delivers big, bold sound in a sleek, floorstanding design. With powerful performance, versatile connectivity, and a compact footprint, it’s easily our top pick.\nBest compact\nBest compact stereo speakers\nCompact and confident, they deliver powerful, detailed sound and look as premium as they perform. Ideal for shelves or stands, they bring Dali tech to a more affordable price point.\nBest budget\nBest budget stereo speakers\nOur top affordable choice, especially if you want better TV sound but not a soundbar. These powered bookshelf speakers offer great clarity and warmth, plus Bluetooth streaming for ease.\nBest premium wireless stereo speakers\nBest premium wireless stereo speakers\nExpect a stunning design, rich hi-res audio, and good connectivity. While they're compact and stylish, their powerful sound and built-in streaming tech justify the price for serious stereo lovers.\nBest super-compact\nBest super-compact stereo speakers\nSmall but mighty, these beautifully built speakers sound far bigger than they look. With Bluetooth, optical input, and excellent clarity, they're ideal for desks or small spaces with impressive musicality.\nBest bookcase\nBest bookcase stereo speakers\nStylish and detailed, these passive bookcase speakers look more expensive than they are. They deliver balanced, engaging sound – perfect for music lovers wanting a compact setup that packs a punch.\nLoad the next products...\nBest desktop\nBest desktop stereo speakers\nQuirky, compact, and packed with surprisingly punchy sound, these desktop speakers are a top choice for laptop setups. Their design and impressive bass make them fun and powerful for work and play.\nBest powered speakers\nBest powered stereo speakers\nA stylish, powered stereo pair that blends good looks with room-filling sound. With HDMI ARC, Bluetooth 5.3, and loads of ports, they're a top pick for big audio without the hassle of a full system.\nBest for design\nBest stereo speakers for design\nDesign-led and beautifully built, these Italian-made passive speakers sound as refined as they look. With detailed highs and a natural midrange, they're ideal if you want premium stereo sound.\nBest floorstanders\nBest floorstander stereo speakers\nStylish floorstanders with bold sound and a small footprint. With wireless support, HDMI ARC, and a vibrant soundstage, they're a great choice for immersive stereo audio without a complex setup.\nI've reviewed over 150 audio products since becoming a tech journalist, ranging from super-budget earbuds to high-end Hi-Res Audio music players. Before joining TechRadar, I spent three years at What Hi-Fi? testing everything the world of audio had to offer; before that, I was a professional dancer. My love of music ties it all together.\nMarch 28, 2025\nRefreshed the introduction to add more details about our testing process and expertise. Switched the Sonus Faber Lumina I for the Sonus Faber Lumina II in as our 'best for a stylish home' pick. Removed the Apple HomePod mini. Added the Creative Pebble Nova as our 'best desktop' option. Added the lovely Audioengine A2+ to our 'also consider' section.\nThe best stereo speakers 2025\nWhy you can trust TechRadar\nThe best stereo speakers overall\nSpecifications\nReasons to buy\nReasons to avoid\nTo many an avid music fan, the Q Acoustics M40 HD's arrival will be akin to finding the holy grail: floorstanding speakers that neither take up much space (they're gloriously svelte) nor require separate amplifiers cluttering up your den. Built on the success of the excellent M20 HD (listed below, at no. 3 in this buying guide), the M40 HD take things all the way to the floor – and do an exceptional job at relaying your music, however you choose to listen.\nThese are powered speakers (there's a 'master', with amplification for both towers squirrelled inside it plus controls on the top plate, and a 'slave' speaker) that offer both wired and wireless connectivity options as well as hi-res audio capability through both the digital optical and USB-B inputs. 200 watts of power is more than enough for most households and you're also getting Q Acoustics' revered Continuous Curved Cone (C3) driver, plus aptX HD and aptX Adaptive over Bluetooth.\nOK, some users will be disappointed to see the lack of wi-fi action or a control app, but there’s more than enough to be excited about for this money – and as far as the sound quality is concerned, they're a zealous and articulate listen, provided you give them a bit of room to operate and don’t position them too close to a rear wall.\nRead our full Q Acoustics M40 HD review\nThe best compact stereo speakers\nSpecifications\nReasons to buy\nReasons to avoid\nThe Dali Rubikore 2 are compact stand, shelf or furniture-mount loudspeakers. They show Dali’s commitment to making high-end audio technology more accessible. Incorporating advancements from Dali's eye-wateringly expensive Kore series, they aim to deliver premium sound quality at a more accessible price point.\nThese speakers are packed with features, including a 6.5-inch mid-bass driver utilizing Dali's Clarity Cone technology. A soft dome tweeter ensures precise high-frequency reproduction, while a rear-firing bass port with a continuous flare design contributes to deeper bass.\nThe Rubikore 2 has a sleek design with gently curved front and rear panels, available in four different finishes. Measuring 350 x 195 x 335 mm and weighing 10.5 kg each, the cabinets are braced, providing a solid and refined look and build.\nIn terms of sound, the Dali Rubikore 2 delivered impressive bass extension and tonal accuracy during our testing, offering a balanced and engaging listen we described as “consistently good fun” in our review. At times, the soundstage did lack some depth compared to rivals. Overall, the Rubikore 2 provides excellent value for anyone looking for high-quality audio in a compact form, which is why we’d rate them as our top all-rounder pick for most people looking for a flexible speaker system.\nRead our full Dali Rubikore 2 review\nThe best budget stereo speakers\nSpecifications\nReasons to buy\nReasons to avoid\nThe Q Acoustics M20 HD speakers from Q Acoustics are a good value option and also a solid choice if you’re looking to upgrade the audio on your TV but don’t want a soundbar. It’s certainly more versatile. They’re a pair of powered bookshelf speakers — one with a digital amplifier built-in — and they make for an easy-to-use and impressive-sounding audio solution for a living room, games room, bedroom or even a home office.\nOne drawback here is they’re not ‘wireless’ in the sense you may imagine. You do get Bluetooth streaming, but the M20 HD system involves significant cabling. In the box is a mains cable for the active speaker and a four-meter speaker cable for linking up the active and the passive speakers via binding posts on the reverse of each. The active speaker essentially powers the passive speaker.\nHowever, this sound system is a fantastic all-rounder. As we wrote in our review, \"the M20 HD is great at what it does.\" We also said: \"If you’re as much into music as you are TV, the system’s warm digital sound, treble detail and balanced sound delivers an ideal all-round soundstage that’s as adept with Nirvana as it is with Netflix.\"\nRead our full Q Acoustics M20 HD review\nThe best premium wireless stereo speakers\nSpecifications\nReasons to buy\nReasons to avoid\nLooking for an excellent pair of stereo speakers that we awarded a rare 5 out of 5 stars during our recent testing? Meet the latest speakers from KEF, the KEF LSX II LT. The brand has long been at the top of its game for packing what is essentially an entire hi-fi system into a pair of speakers and it's done it again with added style.\nThe KEF LSX II LT consists of a top streaming sound system within two very compact and very nice-looking loudspeakers. They're beautifully-designed and capable of excellent high-res digital audio from any hi-res source you feed them, which includes your TV.\nOne of their appeals for homes on the smaller side is they're quite compact. Which means they're not going to fill larger rooms with sound, but that's not what they're designed for. What's more, you won't find analog inputs here, which some people might miss – although the KEF LSX II do have them. And they're not a good pick for vinyl – the Kanto Ren in this guide are a good alternative for that.\nIf these smaller issues don't concern you, there's very little to complain about here. The KEF LSX II LT are some of the best wireless stereo speakers we've tested and you won't be disappointed.\nRead our full KEF LSX II LT review\nThe best super-compact stereo speakers\nSpecifications\nReasons to buy\nReasons to avoid\nIf we’re cutting to the chase here (and that is what this guide is for) then we’ll just go ahead and say the Ruark MR1 MkII is basically all gain, no pain. It’s small enough to sit happily on any remotely tidy desk, it’s built and finished to a standard that belies its fairly modest asking price (so pride of ownership is more-or-less guaranteed) and it sounds very accomplished indeed.\nYou've got aptX Bluetooth support here and don’t let the Ruark’s bijou size fool you – the MR1 MkII is all business. It sounds fuller, more open and more convincing than seems remotely likely. Given a fighting chance with some digital audio over Bluetooth or optical, the Ruark creates an open, quite spacious soundstage, with plenty of detail handed over and a very agreeable sense of clarity to its overall presentation.\n'Musical’ might seem a redundant term when describing a pair of speakers when they’re playing music, but there are some alternatives that don’t sound anything like as musical as the MR1 MkII – it’s a revealing, confident and entertaining listen.\nRead our full Ruark MR1 MkII review\nThe best bookcase stereo speakers\nSpecifications\nReasons to buy\nReasons to avoid\nThe Q Acoustics 3020c speakers are part of the company's 3000c series, aiming to deliver high-quality sound at an affordable price. Available in four finishes, they feature braced, elegantly curved cabinets that are slightly longer than tall, with satin nickel driver surrounds and magnetically attached grilles for an upscale appearance.\nEach speaker houses a 22mm decoupled soft dome tweeter and a 120mm mid/bass driver utilizing Q Acoustics' 'continuous curved cone' design, first seen in the brand’s higher-end models. A rear-facing bass reflex port enhances low-frequency response, and the speakers offer a frequency range of 60Hz to 30kHz. The rear panel includes a single pair of low-profile cable binding posts.\nMeasuring 279 x 175 x 281mm and weighing 5.5kg each, the 3020c speakers are compact yet sturdy. Their unconventional dimensions contribute to a rather distinctive look compared to rivals, and the build quality reflects some thoughtful design principles we rated in our review.\nIn performance, the 3020c speakers delivered an assertive and detailed sound during our testing, with impressive stereo focus and soundstage capabilities. While they may lack some low-end punch and dynamic power compared to rivals, our expert team found they provided an engaging and insightful listening experience, making them a strong contender in this affordable price range.\nRead our full Q Acoustics 3020c review\nThe best desktop stereo speakers\nSpecifications\nReasons to buy\nReasons to avoid\nStereo speakers don’t have to be floorstanding beasts to impress. If you’re after rich stereo sound for your desktop setup, we highly recommend the Creative Pebble Nova speakers.\nWith their distinctive spherical design – we likened them to Magic 8-Balls or lawn bowls in our full review – they definitely stand out. They're stylish in their own way, but more for fans of bold, quirky design than minimalist setups. So while they won’t suit every taste, they’ll absolutely appeal to those who love something a bit different.\nLooks aside, the Pebble Novas deliver seriously impressive sound for their size. During testing, we were surprised by their defined bass, punchy max volume, and a range of customizable features that help them outshine many rivals in the desktop speaker space.\nIn short, these compact speakers will level up your computer or laptop audio with immersive, room-filling sound and coaxial drivers that add real clarity and depth. They're not the cheapest option, and they do take a little patience to set up. Plus, they’ll need a decent chunk of desk space. But if you’re willing to make that trade-off, you’re in for a treat.\nRead our full Creative Pebble Nova review\nThe best powered stereo speakers\nSpecifications\nReasons to buy\nReasons to avoid\nIf you like your speakers to look tasteful and compact, as well as delivering on some seriously bold and powerful sound, then the Kanto Ren are well worth considering.\nIn our review, we called this a “does-everything bookshelf hi-fi system” because we think it’s incredibly versatile. For starters, these lovely-looking stereo speakers boast a refined and robust build, which we think will fit in seamlessly to all sorts of homes.\nBut it’s also the connectivity that impresses too, with HDMI ARC, optical, USB-C, RCA and 3.5mm aux inputs, and strong Bluetooth 5.3 connectivity besides. Some people might put a system like this together piece-by-piece, but if that doesn’t appeal, you’ve got pretty much everything you need here.\nThe Kanto Ren sounds brilliant, too. These speakers are rich in sound and although they’re low-profile compared to similarly-powered hi-fi and AV systems, as we wrote in our review, they “pack a punch with their 100W RMS of auditory juice”. This makes them a top choice for whatever you want to watch, movies, TV shows, video games – we think it’s safe to say they’d beat any TV soundbar in terms of power and performance.\nIf you want excellent hi-fi sound without the faff in a pair of speakers you’ll actually enjoy looking at as well as hearing, the Kanto Ren are a reliable pick.\nRead our full Kanto Ren review\nThe best stereo speakers for design\nSpecifications\nReasons to buy\nReasons to avoid\nSonus Faber has a rich legacy of crafting high-performance, high-end loudspeakers – and a reputation for premium price tags to match. Fortunately, the Lumina II offer a more accessible entry point into the brand’s world of luxurious sound, priced at $1,499 / £999 / AU$2,200 per pair.\nAs you’d expect from Sonus Faber, the build quality and finish are impeccable. Premium materials give these speakers a look that’s both understated and elegant, making them our top pick for design-conscious listeners. That said, they do feature real leather, which won’t be to everyone’s taste – that's both ethically and practically, as it can be sensitive to sunlight over time.\nThankfully, they sound as good as they look. In our review, we praised the Lumina II for delivering an open, naturalistic sound that’s “balanced, insightful, and nicely detailed.” The soundstage is well-organized, with impressive tonal accuracy and frequency response. They’re not the most powerful speakers we’ve tested – bass depth and overall volume fall slightly short of some rivals – but that’s a trade-off some will happily accept for this level of refinement.\nIf you’re drawn to style, quality, and a sophisticated listening experience, the Lumina II won’t disappoint. We called them “a visual and tactile treat”, and they absolutely are. Just be sure to explore a few alternatives at this price point, especially if you’re chasing a punchier, more bass-forward sound.\nRead our full Sonus Faber Lumina II review\nThe best floorstander stereo speakers\nSpecifications\nReasons to buy\nReasons to avoid\nSmart and stylish, compact and manageable, ergonomically excellent and with as perky a sound as it’s possible to imagine, the Audio Pro A36 floorstanding stereo speakers may not be perfect, but they’ll be perfect for some.\nThere's wireless connectivity, as well as physical inputs that include HDMI ARC so you can easily involve your TV in the Audio Pro ecosystem.\nDuring our testing, we loved the sound on offer from these speakers. In our review we wrote: \"They reveal themselves to be straightforward and competent. Dynamic headroom is sufficient to allow the peaks and troughs of Metronomy’s Love Letters worthwhile expression while still picking up on the more subtle harmonic variations throughout the same song. \"\nHowever, these stereo speakers aren’t the last word in fidelity. They're constantly this close to getting carried away where the lower frequencies are concerned. But if it’s excitement and entertainment you crave along with a big serving of convenience, the Audio Pro A36 are a solid option that we enjoyed testing.\nRead our full Audio Pro A36 review\nOther stereo speakers to consider\nSeveral other stereo speakers have been launched recently that might also be worth considering and haven't quite made it to our guide – at least not yet.\nAudioengine A2+: As you'll see in our Audioengine A2+ review, we really did think that these are lovely and compact speakers while we were testing them. The reason they're not in this guide? They just won't quite deliver the oomph you're likely after in the bass/volume department.\nDali Epikore: First up, there's Dali's new Epikore additions: three new models, and they'll present plenty of Dali's impressive tech at a more affordable price tag compared to the amazing Epikore 11 4.5-way floorstander, which is already out in the range.\nFocal Diva Utopia: We've also published our Focal Diva Utopia review. This is an excellent wireless stereo system, but we're still working out if we can feasibly put them in any TechRadar buying guide, given their huge $39k asking fee!\nKEF MAT: We're also looking forward to testing KEF's new speakers with something the company calls 'MAT' in an eight-strong range that promises incredibly life-like and high-fidelity listening.\nBest stereo speakers FAQ\nHow we test the best stereo speakers\nIn testing these hi-fi speakers, we compared each stereo set at a comparable power level and tested the same tunes, plucked from a variety of music genres.\nOur test songs spanned the dynamic range of music and artists, from John Mayer to Tom Petty, and from U.K. prog-metal band TesseracT to the likes of John Williams and Hans Zimmer. Each song was chosen to test the dynamics offered by each set of speakers with some speakers reacting better to certain genre’s than others, depending on their design.\nOf course, not all speakers are created equal in function. The Q Acoustics M40 HD towers, for example, are obviously made to cover a more broad frequency range than say the Edifier bookshelf speakers with a 4-inch woofer. We used our best judgement in testing these speakers according to their individual purpose and affordability, and graded them with that in mind.\nSince comparing bookshelf speakers to high performance towers is an obvious case of apples and oranges, we try to make it clear which speaker is an apple and which is an orange.\nWhich speaker type is best for you?\nThere are lots of speaker styles to choose from – that's why we've put together lots of guides on the best speakers you can buy.\nIf you need a speaker you can take everywhere, make sure you look at the best waterproof speakers and best Bluetooth speakers. Or, if you want to fill your entire home with sound, check out the best wireless speakers and the best Sonos speakers for high-end sound performance.\nWant to boost your TV's audio? Check out the best soundbars and best Dolby Atmos speakers.\nFor total control of your smart home, invest in one of the best smart speakers, which come with Google Assistant, Amazon Alexa, or Siri built-in.\nIf you have an iPhone or an iPad, you might also want to consider one of the best AirPlay speakers. These allow you to stream music from your Apple devices directly to your speaker. That means no complex entertainment set-up necessary.\nWhat are stereo speakers?\nStereo speakers play sound from two distinct audio channels: a left channel, and a right one. That enables you to hear instruments as if they're coming from different places, so for example a guitar might sound like it's coming from the far left of the room while a vocal sounds like it's in the middle.\nThe difference between stereo speakers and mono ones, where every speaker gets the same audio, is dramatic. It makes music in particular sound much bigger and more detailed, and if you're watching a TV programme the sound is more realistic because it appears to be coming from both sides of the room.\nWhat are the advantages of stereo speakers?\nAlmost all music is recorded with stereo playback in mind, and has been for many decades now: The Beatles' first stereo album, Abbey Road, was released in 1969 and stereo became the standard for most music in the 1970s and beyond.\nThe 1970s also saw movies move to stereo, primarily with Dolby Stereo in the mid-70s, and that became the default until the dawn of surround sound – but even today's multi-channel surround movies are also designed to be listened to in stereo if you don't have a full-on surround system.\nThe biggest single advantage of stereo, then, is that you're hearing music as the artists intended it to be heard. What they listened to in the studio was mixed and played back in stereo, mastered in stereo and then produced in stereo formats. As a result, listening on a single speaker, or on a multi-speaker system where every speaker plays the same thing, means you don't get the full experience.\nThe best way to describe stereo is that it's bigger. Instead of having everything come from a single place, stereo creates a sound field or sound stage where different things – musical instruments, effects, dialogue – can appear to be coming from different places. So gunshots may shoot from left to right, or AC/DC's Malcolm Young is to your left while Angus Young solos towards your right, or the rap may be dead centre while all kinds of sonic sculpting is going on either side of them.\nBecause you don't have everything stuffed into the same sonic space stereo gives music and other audio more room to breathe, and the result is a much clearer, more vivid, more lifelike sound.\nCan a single speaker be stereo?\nYes, you can. In fact, some single speakers can deliver 360-degree audio. That's because inside the case there are multiple speaker drivers, which are the vibrating domes you probably think of when you hear the word \"speaker\". If a speaker has more than one set of drivers inside it, it can be configured so that one driver plays sound from the left audio channel and another plays the sound from the right audio channel.\nThe problem with that is that the drivers are still very close together, and that means you don't get the impression of room-filling sound that you get from standard stereo speaker pairs.\nThere are some quite clever ways to get around this – some phones and tablets use clever audio processing to make their audio sound much wider than you'd expect from such small devices – but ultimately there's only so much you can do when your speaker drivers are right next to each other. We much prefer the sound of dedicated, separate stereo speakers and we're sure you will too.\nCan you use stereo speakers with a TV?\nYes, and we'd heartily recommend it: having a good quality pair of stereo speakers with your TV in the middle can make pretty much anything you watch feel more immersive. Whether it's the double bass of the Narcos title music or the horrible sounds of the clickers in The Last of Us, stereo speakers give you a much wider sound field and a more engaging (or frightening) audio experience than most TVs can deliver.\nIn the vast majority of cases you'll need to connect your TV to an AV receiver unless your speakers are wireless, and that connection is usually done via an optical cable or more commonly, an HDMI cable to the ARC (Audio Return Channel) or eARC (enhanced Audio Return Channel). ARC/eARC means that everything on your TV is passed to your speakers, including streaming TV apps, games on your console, and content from set-top boxes or streaming sticks.\nAn additional benefit to going down the AV receiver route is that you can add more speakers later to make your audio even better. We did that with our setup: what started as a simple but great-sounding stereo system is now a less simple but even greater-sounding system with a subwoofer, two rear surround speakers and two upwards-firing Dolby Atmos speakers.\nWhat is the difference between passive and active stereo speakers?\nThe difference between passive and active stereo speakers is in their power and amplification setup. Passive speakers need an external amplifier or receiver to power them. This setup gives you lots of flexibility in choosing the right amplifier for you, often resulting in better sound quality due to higher-end external amps.\nIn contrast, active speakers have built-in amplifiers. They can be connected to a power source, and then you can connect an audio source directly (or wirelessly). This all-in-one design makes them more convenient and easier to set up, especially for beginners or anyone with limited space. However, because everything you need is built-in, upgrading or changing components is more challenging (or impossible) compared to passive speakers.\nWhat are the differences between floorstanding and standmount stereo speakers?\nFloorstanding and standmount speakers (often called a bookshelf speaker) differ in size, design, and performance. Floorstanding speakers are tall and, as you’d expect, they sit directly on the floor. They typically have multiple drivers inside them, including woofers, midrange, and tweeters, all in a single cabinet. This allows them to produce a full range of sound and makes them ideal for larger rooms or home theater setups. If you want highly powerful, immersive audio, floorstanding speakers are the best option.\nStandmount speakers, as the name suggests, are smaller and designed to be placed on stands or shelves. They usually have fewer drivers, and typically this will be a woofer and a tweeter. This means their bass input can be limited – at least compared to floorstanding models. But they can deliver excellent sound quality, especially in smaller spaces. Their compact size also makes them easier to position.\nDo wired stereo speakers offer better sound quality than wireless?\nWired stereo speakers tend to offer better sound quality than wireless ones. This is due to the direct connection between the speaker and the audio source. This direct connection minimizes any potential signal interference and loss, ensuring you get a clean and uninterrupted audio signal. Audiophiles often prefer wired speakers for this reason, because they bring you sound performance that tends to be the most reliable and consistent.\nIn comparison, wireless speakers use Bluetooth or Wi-Fi to connect to audio sources. These days, wireless technology is great and it offers convenience, as well as eliminating the need for cables. But it can still suffer from occasional interference or compression, which would affect sound performance. Then again, most newer, high-end wireless speakers have advanced tech that can address these issues, providing an experience that rivals many wired setups.\nLatest updates to the best stereo speakers\nMarch 28, 2025\nRefreshed the introduction to add more details about our testing process and expertise. Switched the Sonus Faber Lumina I for the Sonus Faber Lumina II in as our 'best for a stylish home' pick. Removed the Apple HomePod mini. Added the Creative Pebble Nova as our 'best desktop' option. Added the lovely Audioengine A2+ to our 'also consider' section.\nJanuary 30, 2025\nRefreshed the introduction. Replaced the older KEF LSX II entry with the recently reviewed KEF LSX II LT as our best premium wireless pick. Removed several older entries. Added the Kanto Ren based on our recent testing.\nDecember 3, 2024\nSwitched the Definitive Technology BP9080x for the Dali Rubikore 2 as our best all-around speakers pick based on our recent testing. Also added the Q Acoustics 3020c in place of the Klipsch RP-150M.\nOctober 3, 2024\nRewrote the introduction. Added an 'also consider' section to give readers more options in case they want to know what else to check out or which similar products have been launched and reviewed recently.\nAugust 5, 2024\nChecked all products against the latest reviews. Added more information to our FAQ section.\nJune 6, 2024\nAdded an author biog block plus an 'Also consider' section and this update log! Removed two products that, although very good indeed, are now being superseded by next-gen models. Refreshed copy throughout.\nMarch 4, 2024\nAdded the Q-Acoustics' M40 HD in at the top spot – an excellent set of floorstanders with onboard amplification, offering the convenience of streaming in a wireless design.\nSign up for breaking news, reviews, opinion, top tech deals, and more.\nBecky became Audio Editor at TechRadar in 2024, but joined the team in 2022 as Senior Staff Writer, focusing on all things hi-fi. Before this, she spent three years at What Hi-Fi? testing and reviewing everything from wallet-friendly wireless earbuds to huge high-end sound systems. Prior to gaining her MA in Journalism in 2018, Becky freelanced as an arts critic alongside a 22-year career as a professional dancer and aerialist – any love of dance starts with a love of music. Becky has previously contributed to Stuff, FourFourTwo and The Stage. When not writing, she can still be found throwing shapes in a dance studio, these days with varying degrees of success."
    },
    {
      "url": "https://www.techradar.com/news/best-turntables",
      "text": "The best turntables for all budgets, tested and selected by TechRadar experts\nThe best turntables and record players you can buy today\nOur expert audio team has picked the best turntables and record players after extensive hands-on testing and years of deep industry insight. We’ve made sure there’s something here for every budget and experience level. Choosing the right setup is a big deal for music lovers and the right turntable can transform your vinyl experience, revealing stunning clarity and depth to your favorite records.\nSo, what actually sets a turntable apart from a record player? Record players usually come with built-in speakers and amplification, making them a convenient, all-in-one option. Turntables, on the other hand, are built with high-quality components – think tonearm, platter, and sometimes a built-in phono stage – giving you the freedom to build a custom setup with your own phono preamp, amp, and speakers. Whether you're new to vinyl or a seasoned audiophile, our expert recommendations will help you find the perfect fit. Need help getting started? Check out our guide about how to set up a turntable.\nMany modern turntables also come with handy features such as USB ports for digitizing your record collection, and Bluetooth or Wi-Fi for wirelessly connecting to the best wireless speakers, the best Bluetooth speakers or the best headphones. Prefer a classic setup? There are great options for analog purists too.\nThe quick list\nWant to cut to the bit where we tell you which turntables are the absolute best – whatever your budget? Have at this bevy of beauties. You can jump to a more detailed review of each product – or our nifty price comparison tool for the best deals.\nBest overall\nBest for most people\nOK it's not exactly cheap, but the Debut Carbon Evo is the most refined, upgraded and enjoyable Pro-Ject model we've ever tested, which is why it's our shout for the best turntable most people could own.\nBest budget\nBest budget buy\nAn excellent budget turntable that has everything you need. Other options in this guide sound better, but for the price this is one of the top-performing turntables for beginners on the market right now.\nBest high-end\nBest high-end performer\nCambridge's updated V2 Alva TT has a switchable integrated phono stage and a new tonearm. The price is higher, but the V2 retains the original’s bank-vault build quality, hi-res wireless streaming and air of profound solidity that made it one of the best decks around.\nBest mid-priced\nBest mid-priced\nThis classic and understated turntable from a trusted name in audio is a small step up from entry-level, but manages to blend easy setup, sound quality, room to grow and features with a palatable price tag.\nBest super budget beginner deck\nBest super-budget beginner deck\nWith sustainable style by the bucketload, this Revolution is easily one of the best-value turntables we’ve tested. Easy setup and fuss-free operation make it foolproof, but the sound signature is surprisingly full.\nBest for tinkerers\nBest for turntable tinkerers\nIt's a Rega, and that comes with real pride in ownership, but it's also the best version yet of a truly classic entry-level record player… and one you can grow with, adjusting the tonearm, upgrading the cartridge and more.\nLoad the next products...\nBest for durability\nBest bullet-proof build\nTechnics was reborn in 2015, (parent company Panasonic closed it in 2010) but this is the first deck released since the relaunch that really reminds listeners of what they loved about the brand. Truly, this direct-drive deck feels unbreakable.\nRead more below\nBest all-in-one\nBest all-in-one\nA great-sounding and well-priced turntable that has an amp, phono stage and Bluetooth receiver built-in – just add speakers! Great for those starting out who want top music quality.\nBest for design\nBest for design\nA fantastically detailed turntable that delivers an engaging, unified sound. Not the most energetic choice out there, but it's so revealing you won't mind – and just look at that plinth. With its exhaustive spec list and high standard of finish, it's built for serious listening.\nRead more below\nI've reviewed over 150 audio products since becoming a tech journalist, ranging from super-budget earbuds to high-end Hi-Res Audio music players. Before joining TechRadar, I spent three years at What Hi-Fi? testing everything the world of audio had to offer; before that, I was a professional dancer. I'll always extol the virtues of listening (and dancing) to the best musical quality you can stretch to – and for more and more people, happily, that includes vinyl.\nJuly 14, 2025\nWe simplified this list a little to make it easier to choose the best option for you, and expanded our list of other turntables we've tested worthy of consideration. We also added several new entries to the FAQs section.\nThe best turntables as tested by us\nWhy you can trust TechRadar\nThe best turntable overall\nSpecifications\nReasons to buy\nReasons to avoid\n✅ You want to hear everything from your records: The Pro-Ject is a wildly detailed listen – even the barely there transient details are picked up on and handed over.\n✅ You don’t want to get too hands-on: The new automatic speed control means no more lifting off the platter and moving the drive belt.\n❌ You want the cleanest, clearest vinyl experience: The Pro-Ject’s not without competition – and the best rivals are a little less laid-back.\n❌ You want some 21st-century touches: Lately we’ve seen a few turntables with Bluetooth, or USB outputs. This ain’t one of them.\nIf you want to enjoy the rich sound of vinyl without compromising on even a speck of glorious audio information, the Pro-Ject Debut Carbon Evo is one of the best turntables for this – and that makes it one of the best decks on the planet right now. Also, the carbon fiber tonearm is pre-mounted with a very capable Ortofon (or Sumika) cartridge. A new motor design, some damped and adjustable feet, and automatic speed change contribute no end to the Debut Evo's improved performance and improved ergonomics over the previous Pro-Ject model.\nSimply put, it sounds fantastic. It doesn’t matter what sort of music you like to listen to, the Debut Carbon Evo laps it up. Our testing process revealed a detailed and compelling deck that's able to focus on the minutiae even as it describes the complete picture. And it does so with conviction. The Debut Carbon Evo has all the warmth and weight that vinyl is famous for, but it refuses to get bogged down – it simply motors along in the most natural way imaginable.\nIts steel platter is now heavier, thanks to a thermoplastic ring on its inside edge – this reduces operation noise – and there’s now a suggestion of convenience in the shape of a speed-change switch at the bottom of the plinth; previously you’d have to take off the platter and move the drive belt to change speeds, but now 33.3rpm can become 45rpm (or vice-versa) at a press. You can change the drive belt itself in order to play at 78rpm. Both belts are included in the package. The one-piece tonearm is made of carbon fiber, and comes fitted with a very capable Ortofon 2M Red cartridge (except in America, where it features a Sumiko Ranier cartridge instead). With a choice of nine finishes, including five very attractive new ‘satin’ options, there’s sure to be a Debut Carbon Evo to fit in with your interior decor choices.\nThe Debut Carbon Evo is the most refined, upgraded and enjoyable Pro-ject model we've ever tested, which is why it's our pick for the best turntable you can buy – but it’s also the most expensive. Don't let the price put you off if you can afford it, though.\nRead our full Pro-Ject Debut Carbon Evo review\nThe best budget Bluetooth buy\nSpecifications\nReasons to buy\nReasons to avoid\n✅ You're a beginner: A plug-and-play device that's ideal for anyone getting started with vinyl.\n✅ You want a simple set-up: There are a few things you need to do before you can get up and spinning, but it's all relatively simple.\n❌ You may want to customize it one day: Yes, you can upgrade the stylus but otherwise your options are pretty limited.\n❌ You want the ultimate audio experience: Sound is good here, but it's not perfect. For a more detailed, immersive experience, you'll need spend a little more.\nThe Audio-Technica AT-LP70XBT is our top budget choice. It replaces the Audio-Technica AT-LP60XBT that came before it, and is a little pricier, making it the top-end of budget. But in our books it's still the best affordable choice, especially for beginner vinyl enthusiasts who want to get up-and-running with little fuss, partly thanks to its automatic operation.\nSetting it up is easier than ever. This is a plug-and-play device that's been pre-calibrated, meaning you get easy playback. You can then listen either wired or wirelessly and there's seamless Bluetooth connectivity if that's what you choose. Although some cheaper players have underpowered motors, the AT-LP70XBT is belt-driven with a motor that's not only strong but quiet, too.\nDon't expect the impeccable, premium sound of pricier options. But what you do get is an audio performance that outperforms many other budget picks. In our review, we wrote: \"It scores highly here for its impressive stability, surprising depth and otherwise clear voice.\" The pre-installed AT-VMN95C stylus is responsible for the smooth playback. But you're also able to switch the stylus out for another Audio-Technica needle, which is handy and mostly unheard of with budget turntables.\nThe design of the AT-LP70XBT is slinkier and more minimal than its predecessor, the AT-LP60XBT. With some features control buttons and switches hidden away. However, it does have both a fixed cartridge system and a fixed-weight tonearm, which is expected at this price. It's also lightweight with a plastic chassis, which is handy for moving about but does mean you'll need to be careful with it.\nIf you want an affordable and simple set-up, the Audio-Technica AT-LP70XBT is a great value choice that outperforms many other budget options. Its flourishes and improvements over the previous AT entry-level option make it a solid and enjoyable device, especially for anyone considering their first turntable.\nRead our full Audio-Technica AT-LP70XBT review\nThe best high end performer\nSpecifications\nReasons to buy\nReasons to avoid\n✅ You want your old format to have some modernity: Short of turning your records over for you, the Alva TT V2 makes things as simple as possible.\n✅ You like a balanced and easy listen: ‘Easy’ in this instance is by no means a negative, and sounds great through various connection options.\n❌ You’re expecting wireless to match wired: It sounds better hard-wired, no two ways about it. But that's always going to be the case.\n❌ You enjoy the more visceral aspects of music: The Alva TT v2 isn’t the most forthright or dynamic turntable around for those who like lots of attack.\nIf you’re looking for a top-performing turntable, the Cambridge Audio Alva TT V2 is tough to beat. You get a built-in phono stage so it can be connected directly to an amp or active speakers, but it's switchable, so you can use your own high-end solution if you have one. It also includes Bluetooth for sending sound directly to headphones or a wireless speaker – and it's aptX HD Bluetooth, so you get more detail. The device’s tonearm features anti-skate as well as counter-weight adjustment and has a detachable headshell for ease of cartridge-replacement. It’s pre-fitted with a cartridge, of course – a high-output Cambridge Audio moving coil option.\nInevitably, we found that it does sound its best through some great wired components than even the best top-tier Bluetooth headphones. However, we did still get that rich, vinyl sound wirelessly, and with greater clarity and precision than from cheaper Bluetooth turntables. As we said in our review: \"The Alva TT V2 is a deft, smooth and insightful listen, a little short of dynamic headroom but very long indeed on detail retrieval, tonal balance and generously engaging sound.\"\nIt might be the best in the list for high-performing audio and specs, but it isn’t the prettiest or most elegant model. This turntable's aesthetic could best be described as functional; it is designed to look like a turntable, albeit a nicely constructed one. A hefty chassis is topped by a tactile aluminium plinth – but the build quality is classy.\nThe Alva TT v2 isn’t the most forthright or dynamically agile deck around for those who like oodles of attack. But it is way more convenient than the norm, and it's also a turntable that’s able to hold its head high in pure performance terms, too. If you want a deck packed with clever and useful tech that delivers an easy listen most music lovers will find enjoyable, it’s a great value investment.\nRead our full Cambridge Audio Alva TT V2 review\nThe best mid priced deck\nSpecifications\nReasons to buy\nReasons to avoid\n✅ You need easy setup and convenient features: Changing speeds is easy with a dedicated button – and it has an automatic start and stop.\n✅ You want to get the best possible value: If you want a deck that just works, looks classy and can be upgraded later, put this on the list.\n❌ You want consistent speed: We found there to be some hunting and pecking to keep a smooth playing speed.\n❌ You want some 21st-century touches: The Fluance RT81 slightly lacks the detail of higher-end turntables.\nThe Fluance RT81 is an excellent beginner turntable. The reason? It's simple to set up and use for newbies, but as you'd expect, you can level up the cartridge to squeeze even more performance out of it later on. You don't need to worry about getting a separate phono preamp either, as there's one built in, but you can turn that off if you want to use a more powerful external preamp in the future.\nWe really enjoyed this turntable's sound during testing, but we did encounter a few issues. The Fluance RT81's promised “auto-off” feature turns the platter off to prevent excessive needle wear, which is good, but you still have to return the arm to its resting place yourself.\nYou’ll also have to manually queue records, which isn’t a deal breaker by any means but may put off anyone looking for a fully automatic player.\nThen again, if you want a more high-end performance from the get-go, take a look at the Pro-Ject Carbon Evo at #1 in this guide. Then again, the Fluance remains a viable shout. As we wrote in our review: \"If you want a turntable that just works, looks good, and can be upgraded later, the Fluance RT81 is the turntable for you.\"\nRead our full Fluance RT81 review\nThe best super budget beginner deck\nSpecifications\nReasons to buy\nReasons to avoid\n✅ You need something simple to use: As a plug-and-play deck that’s pre-calibrated out of the box, the Revolution makes it very easy to get into the groove.\n✅ You like the option of wired or wireless: It's useful to have the flexibility of enjoying playback via wires or Bluetooth. Hook it up to House of Marley’s Uplift or Get Together speakers, or use your own.\n❌ You're looking for the very best sound quality: Excellent value because of the dynamic sound for the price. However, muddying mids and a hint of treble distortion mean the quality is far from perfect for audiophiles.\n❌ You want a flexible setup: Designed with simplicity and streamlining your vinyl experience in mind. You cannot adjust the tracking force or anti-skate, so if you prefer to tinker with your deck, you'll need to look elsewhere.\nLook, it would be wrong to suggest that this plucky budget belt-driven deck can challenge the best, it cannot. But good starter deck that's easy to use and sounds decent without breaking the bank? The House of Marley Revolution is emphatically that, and with an added shot of sustainable style that makes it highly loveable – not to mention one of the best-value Bluetooth turntables we’ve tested.\nThe Revolution sets itself apart from your average budget turntable's plastic build – apart from the platter, which is plastic, but it works very well. In fact, there’s a reassuring weight to the build overall; the chosen (largely sustainable) materials lend it a quality feel which is impressive given the cost. The base is wrapped in recycled fabric and the distinctive bamboo plinth is a lovely thing to set down in your chosen listening spot.\nIt comes pre-calibrated out of the box, so setting it up is as simple as putting the felt mat on the platter and attaching the counterweight to the tonearm. You can push the Bluetooth button for wireless pairing, or wire it up the more traditional way; it’s all outrageously straightforward. Naturally, this plug-and-play approach won’t suit purists, but it makes for a stress-free feeling that’s ideal for first-timers.\nThe Revolution isn’t the kind of deck that needs to be paired with high-end separates from hi-fi's biggest names. For he picky listener, there’s also much to pick at – but bear in mind the price. Mids can come of a little muddy and you could hear some distortion in the treble on occasion. That said, the sound is more than zealous enough for casual listening, with a refreshing weight to the low end especially.\nRead our full House of Marley Revolution review\nThe best hi fi turntable for tinkerers\nSpecifications\nReasons to buy\nReasons to avoid\n✅ You admire efficient engineering: It’s not luxurious (because Regas aren't), but the Planar PL1 is properly specified and built.\n✅ You like to get ‘hands on’: Change the speed from 33.3 to 45rpm; see what we mean.\n❌ You want some modernity: Some turntables have USB outputs and wireless connectivity. Not this one.\n❌ You don’t have a proper shelf to put it on: Those feet will suppress some vibration, but they’re not miracle-workers. It needs a sturdy rack to call home.\nThe Rega Planar PL1 is an excellent starting place for an audiophile on a budget. It's no longer the latest turntable from Rega – that's the flagship September 2023-launch Rega Naia – but the Planar PL1 is still the newest affordable deck from the brand.\nIt sounds excellent and is well damped thanks to its phenolic resin platter. For fledgling vinyl collectors, the Rega is also an easy setup, though you’ll have to supply your own phono preamp. Want to embark on a life of tonearm adjustment, cartridge upgrades and maybe even vinyl subscription services? This is the deck for you.\nIn our testing, this record player sounded so good it seemed churlish to fault it. Vocals are revealing and you perceive the subtle textures of instruments within orchestral soundstages. The included Rega Carbon cartridge isn’t anything particularly special, but it's a very decent match for the deck.\nGranted, it's one of the older turntables in our list, but it's still one of the best. Yes, for similar money you could get a more modern, feature-packed choice. But for vinyl purists on a budget who like to get hands on with their tech, the PL1 is hard to beat several years on.\nRead our full Rega Planar PL1 review\nThe best for durability\nSpecifications\nReasons to buy\nReasons to avoid\n✅ You want \"bomb-proof\" build quality: With a hefty aluminum top-plate and platter, the SL-1500C could survive a medium-sized detention.\n✅ You want an expansive soundstage: Recordings are given plenty of elbow-room with loads of depth and height, without lacking unity.\n❌ You want the best value turntable: The SL-1500C is marginally expensive compared to rivals.\n❌ You're looking for a subtle design: Technics has stuck with its DJ deck look and feel with the SL-1500C.\nSay hello to this budget-friendly Technics SL. This SL-1500C will only set you back £899 / $999 / AU$2,499 (for reference, look to the Technics SL-1210g to see how much Technics decks usually go for). It may still not be the most affordable turntable on the market, but it's the first reborn Technics to really remind us of why we, and so many DJs, fell in love with the brand in the first place.\nUser-friendly and as painless as possible, the SL-1500C stands on four hefty rubberized feet with a lot of articulation. A switchable phono stage proves useful along with a switchable auto-stop feature – we've gone into great detail about these in our extensive review.\nSound-staging is really impressive here, with recordings given plenty of elbow room for individual instruments to make their presence felt at all times. There’s depth and height to the Technics’ stage as well as width, and the sound is consistently compelling.\nIn our review, we wrote: \"This isn’t the most out-and-out accomplished turntable you can buy in purely sonic terms, but it’s not far off – and it’s more robustly made, better specified and has greater cachet than any price-comparable alternative. \"\nRead our full Technics SL-1500C review\nThe best all in one record player\nSpecifications\nReasons to buy\nReasons to avoid\n✅ You want an all-in-one device: Everything you need is here, except for speakers (and Pro-Ject does a well-priced bundle with them, if you like).\n✅ You want a stylish pick: Pro-Ject's turntables always look great, even in this chunkier size.\n❌ You already have a good amp: In this case, we recommend you take a look at our Pro-Ject E1 review instead, that's the E1 regular version.\n❌ You might upgrade: If you've already got your eyes on future upgrades, go for separates instead.\nWhen most people want to buy their first turntable, they want an all-in-one option that's easy to get up and running, and doesn't require lots of additional separates. The problem is that all-in-one devices tend to cut corners, they're cheaper, and the audio doesn't match up to rivals. But the Pro-Ject Juke Box E1 is different. It's not cheaply made, it sounds great and it's got everything you need. It's built for convenience while maintaining quality, and that's why it's a great choice for anyone who's starting out with vinyl. And while it isn't super-cheap, it's very reasonably priced.\nTo pack everything in one, the Pro-Ject Juke Box E1 takes the familiar and stylist Pro-Ject Primary E1 turntable from the brand but then adds a built-in phono stage, amplification and Bluetooth receiver. All you need to add is speakers, though it's worth mentioning that you can buy a bundle from Pro-Ject that includes them for only $200/£200 more.\nThe Pro-Ject Juke Box E1 gave us an enjoyable listening during testing. In our review we even commented: \"It's the sort of turntable that makes you smile involuntarily as you listen.\" This was largely down to its clear and detailed soundstage and pleasing b bass. The inclusion of the phono stage and amplification made a significant difference over the E1. We also wrote: \"The amp is rated 2x50W at 4 ohms, and I was impressed by its performance compared to an affordable standalone option.\"\nAt £599 / $799 / AU$999 it may not be budget, but you'd need to spend the same or more to get a quality record player and separate amplifier of the same level of quality, so we think it's fair value given it sounds great and it's incredibly compact.\nRead our full Pro-Ject Juke Box E1 review\nBest for design\nSpecifications\nReasons to buy\nReasons to avoid\n✅ You want a bold, stylish option: The best record players all tend to look good too, but this thoughtful and interesting design is truly unique.\n✅ You want an easy straight-out-of-the-box set-up: No extras needed, it's highly-capable and yet pretty straightforward to get up-and-running.\n❌ You want punch and energy: Look, it's got a lot going for it in the sound department, but it's not the most attacking listen in this list.\n❌ You're willing to shop around: This is an excellent sound-per-pound pick, but there's a lot out there with similar specs at a similar price.\nThe Vertere DG X isn’t just a turntable, it’s a statement piece. It has a distinctive, futuristic plinth, which is best described as either beautiful or bonkers, depending on your tastes. But one thing’s for sure, this deck doesn’t blend in. Which means if you’re after something that sounds as unique as it looks, you’re in the right place.\nThis is a beautifully built, high-end turntable that takes a lot of the usual complexity out of a more premium vinyl setup. That's because it comes with its own dedicated power supply, high-quality cables, and even a dust cover. The cartridge is already fitted and fully adjusted, so you can spend more time listening and less time fiddling with alignments.\nWhat really makes the Vertere DG X shine is its sound. It might not have the raw punch and attack of some similarly-priced rivals, but what it delivers instead is detail – and lots of it. This is a controlled, balanced, and exceptionally refined listen. It handles music with the kind of finesse and cohesion that makes it incredibly enjoyable and entertaining.\nThe Vertere DG X is a brilliant choice if you’re looking for a high-end experience without the complexity. It’s a complete, high-spec package with a serious focus on performance as well as usability. Sure, it won't blow your hair back with its force, but it'll surprise you with its detail and delivers style in spades.\nRead our full Vertere DG X review\nOther turntables to consider\nWe test dozens of decks every year at TechRadar and we don't mean to brag – we do love it, but it's just our job. We also mean to tell you that plenty of turntables we've tested do receive a full, in-depth review, but they don't make it into this buying guide.\nAudio-Technica AT-LP60XBT: We may have taken this Audio-Technica turntable out of our guide, but it's still a solid option for most people. After all, it was only launched in 2019 and if you can find it a reduced price, it would be a great bargain. Read more about this great starter turntable in our Audio-Technica AT-LP60XBT review.\nDenon DP-300F: A good fully automatic choice, which means you just need to push a button to start and stop spinning plates. It's not ideal if you want a premium design or to digitize your records – that capability isn't here – but otherwise, it's a top pick for beginners, which is why it's well worth taking a proper look at our full Denon DP-300F review.\nEAT C-DUR Concrete: This turntable sounds fantastic, but as you'll read in our EAT C-DUR Concrete review, it's also very expensive, needs a sturdy support, so won't suit every room, and is also oddly small-scale sonically.\nMajority Moto 2.0: If you do want a cheap, one-box, does-it-all turntable, our Majority Moto 2.0 review is still worth a look. It combines a turntable, speakers, Bluetooth transmission/receiver and USB output in a single package and slaps a very low price-tag on it. Sadly, some of the key components were more than a little flimsy and did cause us too many problems to wholeheartedly recommend this inexpensive record player.\nMarantz TT-15S1: This is a fairly expensive turntable, but it really does deliver a top performance. Bass could be better and setup isn't as easy as it could be, but we could only really identify minor annoyances during testing. If you're becoming a serious vinyl collector and want clarity, range and a stunning design, read our full Marantz TT-15S1 review.\nRekkord Audio F300: There’s plenty to be said for ease of use where turntables are concerned. But as a glance at our Rekkord Audio F300 review proves, it’s not the be-all and end-all. This good-looking turntable features a fully automatic operation with a quality build and finish that promotes a relaxed sound, but it is a little short of sonic verve and punch – and it's also not particularly upgradeable.\nTechnics SL-1300G: We're currently working on a full review of the Technics SL-1300G ($2,999 / £2,799). We're discussing whether to include it here once the review is finalized (we take our time on this, because it is important to get it right; if you see a TechRadar verdict, know that it we did not arrive at it quickly).\nVictrola Eastwood II: As you'll see in our Victrola Eastwood II review, we loved the plug-and-play design, surprisingly powerful built-in amp and novel two-way Bluetooth connectivity, but the build itself was a little lightweight and a shade off rock-solid – an issue which continued into the playback.\nVictrola Hi-Res Onyx: We recommend this turntable if you like a minimal, low profile design and intend to listen with headphones some of the time to make the most of that Bluetooth connectivity. It's not our top choice for long-term upgradeability, so if you're already serious about vinyl, maybe look elsewhere. Otherwise, take a look at our full Victrola Hi-Res Onyx review.\nVictrola Stream Sapphire: In our Victrola Stream Sapphire review, you'll find that we were disappointed with Victrola's latest offering. This turntable simply feels too expensive and it's hard to say what that extra money actually buys here.\nHow to choose the best turntable\nFinding the best record player for you can seem confusing, but there are some key details you need to consider when choosing your next turntable.\nFully fledged record player, or dedicated turntable?: This is the first major decision you'll need to make, and it largely depends on personal preference. Do you already have speakers? Are you looking for a plug-and-play setup, or do you want a system you can upgrade over time?\nOne of the most vital things to look for when you’re shopping for a new vinyl player is also how well damped it is. Damping is essentially the method by which manufacturers combat vibrations – whether internal or external. They do this through the use of different motor configurations, and through the use of various components.\nBelt-drive or direct-drive?: Belt-driven turntables are going to be a lot quieter and offer higher fidelity than their direct drive brethren, as direct drive turntables have a motor that is directly connected to the platter. However, there are some great direct drive turntables out there, so don’t write them off just yet.\nExtra features: The best turntables these days are packed with features, so you'll need to consider which are the most important to you.\nIf you’re just starting out, you probably don’t need to be fooling around with a complex turntable featuring an adjustable vertical tracking angle, anti-skate and azimuth. You may even want a turntable that connects to your portable speaker or headphones wirelessly over Bluetooth. Or one that has Sonos compatibility or Wi-Fi support.\nAlso worth considering is this: do you want to rip your vinyl to your digital library? If so, look for a turntable with a USB output and reliable software to get the job done.\nBudget: Turntables can cost anything from $50 / £50 to well over $16,000 / £12,000, it's a good idea to have a top-end fee in mind before you start your search.\nStyle: Think about how your new record player will fit into your home, as well. Do you have the space for an external amplifier? If not, look for a turntable with a built-in preamp.\nWe know you'll probably still have questions. We get it, finding the best turntable isn't easy, especially if you're just starting out. That's why we've answered the main ones below – keep reading!\nWhat are the best turntable brands?\nThere are loads of great turntable brands, but a few names consistently come up thanks to their build quality, sound, and reputation.\nAudio-Technica is a big favorite for beginners and budget-friendly options. Pro-Ject, Cambridge Audio and Rega are loved by audiophiles for their simple design and excellent performance. Technics is legendary, especially if you’re into DJing or want something solid and long-lasting.\nIf you’re after something a bit more high-end, we've included brands like Rega (again!) and Vertere above that are worth a look. Whatever your budget, it's best to stick to trusted names to ensure good sound and durability.\nWhat’s the best turntable for beginners?\nIf you’re just getting started, the Audio-Technica AT-LP70XBT at #2 in our guide above is a solid choice. It’s budget-friendly, easy to use thanks to automatic operation, and packs in all the basics without compromising too much on quality.\nIf you want something with more personality, then the House of Marley Revolution at #5 in the list adds sustainable style and fuller than you'd expect sound, all with a setup so simple it’s basically plug-and-play, and is our top entry-level pick for that reason.\nWhat should I look for in a beginner-friendly turntable?\nIf you're looking for a beginner-friendly turntable, keep it simple. An automatic turntable handles the needle for you, which reduces the risk of you scratching your records. But if you prefer manual control, you'll have more options.\nBluetooth connectivity makes setting up your record player easy, since it means you can stream wirelessly without an amp or any extra cables, to one of the best Bluetooth speakers. It's great for flexibility of positioning individual items if you don't have a lot of space, too. Otherwise, you'll need speakers and an amp (though this could be built into your speakers, or into the record player in some cases).\nA built-in phono stage is essential for beginners. It amplifies the signal so that your records play properly through a speakers and dedicated amp. Without one of these, you'd need a separate preamp, adding yet more complexity. The vast majority of beginner turntables include this, so you can plug and play right away – but just make sure before you buy.\nWhat does it mean if a turntable is automatic?\nAn automatic turntable does the hard work of putting the needle onto the vinyl for you. Press a button and it will spin the record, move the tonearm into the correct starting position, then lower it onto your record. Once the music has finished, it will lift it back up. There are semi-automatic models, which tend to handle just one part of that process, usually the lift at the end.\nManual turntables leave everything to you, which some vinyl lovers prefer for the extra control. But if you want something that’s simple and hands-free, especially to avoid scratching records if you’re new to turntables, automatic models are a good choice.\nWhat does it mean for a turntable to have Bluetooth or wireless streaming?\nA turntable that comes with Bluetooth or wireless streaming lets you play your records without cables. So instead of connecting to an amp or wired speakers, it sends audio wirelessly to Bluetooth speakers or headphones.\nThis makes setup easier – there's no need for extra gear and no tangle of wires – but it’s worth noting that Bluetooth compresses audio, which means you will lose some detail compared to a wired connection. Some turntables include other wireless streaming tech, over Wi-Fi, which can be much higher quality, but these will be more expensive (as will the speakers they work with).\nHowever, it's worth nothing here that some record players have built-in speakers, and offer a Bluetooth connection so you that play music from your phone onto their built-in speakers. So if you're looking at buying a record player with built-in speakers and you want support for Bluetooth out to other speakers, make sure the connection works the way you want first!\nDo I need to buy speakers for my turntable?\nAside from your new turntable, there are some other bits of kit you might want to invest in.\nFirst off, you'll want to check out the best stereo speakers; after all, a turntable is only as good as your speakers you hook it up to. Or, you might want to look into the best over-ear headphones and wireless earbuds to go with your record player.\nIf you opt for a wireless record player, you might want to invest in a Bluetooth speaker, a wireless speaker, or connect it to your existing smart speaker.\nIf your deck of choice doesn't have built-in amplification or a phono stage and you want to connect it to passive speakers, you'll need to buy these too – check out our amplifier reviews for more information.\nAre old turntables better than new ones?\nThe best-sounding turntable is one you enjoy listening to – and don't let anybody tell you any different! Some people prefer the rich, authentic quality of an older turntable. However, many of the newest turntables bring you that same sound, but with several new features and a more reliable experience.\nPrice comes into play here, as you might expect. If you have an older turntable but it's much more expensive and higher quality than a newer, cheaper model, you might prefer the older sound. You should also consider whether it's in need of some TLC. Older turntables might need repairing to sound as good as they once did.\nFinally, what do you want to listen to? If you're looking for high-end audio that sounds exactly as intended, you might want to try a newer turntable. If you want a more gravelly sound and don't mind sacrificing some quality, use the old turntable you already have.\nUltimately, new turntables are more advanced than older turntables, but it all comes down to your preferences.\nDoes my turntable need to have a built-in phono stage?\nYour turntable doesn’t necessarily need a built-in phono stage, but it's a good idea for beginners. It all depends on your current setup and what you’re plugging it into.\nA phono stage, which might also be called a phono preamp, is what you need to boost the signal from your turntable to a level that an amplifiers is then able to work with. So at some point in your audio setup you’ll need one.\nLots of the best turntables that we recommend have a built-in phono stage, and this makes getting yourself set up easier – especially if you’re connecting your turntable to powered speakers without a dedicated amp.\nBut if you don’t have a phono stage built-in, you’ll need either an amp or speakers with one built in there, or an external phono stage that connect between your turntable and your amp. This is rare in wireless speakers, though the Cambridge Audio Evo One has one.\nBuilt-in phono stages tend to be better in terms of convenience, but external ones can offer better sound for the real audiophiles. If you think you'll want something futureproof for getting more hardcore in the future, several record players here have optional preamps, which you can bypass if you buy something higher-quality in the future.\nWhat's the difference between belt-drive and direct-drive turntables?\nThe difference all comes down to what makes the platter spin – that’s the flat bit of your turntable that your record sits on. And the one you should choose depends on your priorities.\nBelt-drive turntables use a rubber belt that runs from the motor to the platter to actually spin the platter. This isolates the motor and the platter, which helps to reduce motor 'noise' and vibration leaking into your recordings. This means it’s a great choice if you’re focused on sound quality above all else.\nDirect-drive turntables are powered by a motor that’s directly under the platter. They tend to be quicker to start, more robust, have super-accurate timing, and are often preferred by DJs because they’re better for cueing up tracks and scratching.\nBoth are a good choice, but generally, it’s belt-drives that are the better choice for audio quality and pure listening. Whereas direct-drives are for performance or multi-tasking.\nAre high-end turntables worth it?\nIf you're an audiophile that can notice the subtle differences and nuances of the devices you're playing music on, and if you have the budget, you'll benefit from a high-end turntable.\nPremium turntables typically offer a more precise and natural sound, so your vinyl collection will come across better than ever – though you'll need to pair it with a phono stage, amp and speakers that are equally revealing, of course.\nIf you don't have as strong an ear for music or you simply don't need perfection, you'll be just as happy with a mid-range turntable. You also tend to need pretty hefty setups with large speakers to benefit fully from the qualities of high-end turntables, so if you're tight on space, you may also be better off saving your money.\nHow much should I spend on a turntable?\nThat really depends on you. A $99/£99 turntable will do a good job of playing vinyl, but the more you spend the more premium your experience is likely to be.\nAn example of a good mid-range turntable is the Rega Planar PL1, which has a list price of £299 / $595 / AU$645. But while it's an undeniably great turntable, Rega has chosen to spend its money on the core components and high quality engineering rather than gee-whiz features or fancy materials. Its more expensive models follow that philosophy too, focusing on delivering the most pristine audio quality possible.\nSony's slightly cheaper PS-LX310BT comes in at £249 / $249 and adds Bluetooth to the mix – but what you gain in connectivity you lose (slightly) in visual appeal and in sound quality. It's not bad by any means, but if you're listening on high-end equipment you'll hear a difference.\nAs with most audio equipment, it comes down to what features matter most to you. If you already have high-end audio kit then it's worth spending that little bit more to get a really premium sound. But as our guide above demonstrates, you can get a really great turntable for a lot less than you might expect.\nIs it worth buying an expensive turntable?\nIt all depends on your budget and your needs. Casual listeners might be happy with a mid-range or budget turntable. But those deeply invested in the vinyl experience or audiophiles who can appreciate subtle audio nuances might find that investing in a high-end turntable could significantly improve their listening experience.\nIf you have a small budget and can’t possibly consider an expensive turntable, there are more affordable options. Consider the Audio-Technica AT-LP60XBT in our guide above, which is great value for money. Granted, in our testing, we did say the materials the Audio-Technica AT-LP60XBT is made from feel a little cheap, and there could be more detail in the audio, but they’re not deal-breakers, and there does need to be a trade-off for that more affordable price tag.\nOf course, expensive options, like our high-end pick, the Cambridge Audio Alva TT V2, are well worth the money. They have a premium build and a balanced and insightful sound quality.\nWith turntables, and most tech for that matter, you tend to get what you pay for. And when it comes to turntables, higher-priced options often offer superior audio quality. They boast better components like platters, cartridges, and tonearms, which effectively reduce vibrations and noise, thereby enhancing the clarity and detail of the sound.\nBut that doesn’t always have to be the case. You can find affordable and mid-range tech that can compete with much more expensive devices – you often just have to make a small sacrifice in one or two areas.\nCan I upgrade parts of my turntable for better sound in the future?\nYes. In fact, it's one of the big appeals of vinyl. Many of the best turntables are designed with upgrades in mind. The easiest thing to upgrade tends to be the cartridge (that’s the bit that holds the needle). Switching this out can make a big difference to sound quality.\nYou can also swap out the platter mat, upgrade the platter itself, or invest in a better phono stage (the preamp). Some models will also let you upgrade the tonearm, though that’s a bit more advanced.\nIf you're starting with a budget-friendly or beginner deck, there might be fewer upgrade options, but with mid-range and higher-end models, there's usually lots of room to tweak and improve your setup over time.\nWhat's the difference between a record player and turntable?\nAlthough the terms record player and turntable are often used interchangeably, they describe two distinct types of vinyl playback devices.\nTurntables are the components within a larger audio system that spin the vinyl record – they're basically just a way of getting the recording off the wax. They require additional equipment – including a pre-amp, amplifier and speakers – to produce the sound you hear. People like turntables because they're usually highly customizable, allowing users to mix and match components like the stylus, cartridge, and tonearm to tailor the audio output to their preferences, which is further tailored to your tastes or budget by the other hi-fi components. This makes them a favorite among audiophiles who want high-quality sound and a way to upgrade parts over time.\nRecord players, on the other hand, are all-in-one units that include the turntable, amplifier and even speakers. This makes them more convenient and user-friendly, particularly for casual listeners or anyone living in a small home. While they offer ease of use and portability, record players generally do not match the audio quality of a good turntable setup. They also don't provide much customization, and it's not as easy to upgrade them.\nChoosing between a turntable and a record player depends largely on your needs and preferences. If you prioritize sound quality and are keen to customize your audio setup, a turntable might be the better choice. If you prefer simplicity and want a compact option, a record player would better serve you. In this guide, we've chosen both turntables and record players to suit different needs.\nWhat is the most reliable turntable?\nFor us, reliable means a turntable that's a fantastic all-rounder and good value for money. With that in mind, you can't go wrong with the Pro-Ject Debut Carbon Evo that sits at the top of our list of the best turntables, with an expansive, detailed sound and impressive specs.\nIf you're willing to spend a little more, then the Cambridge Audio Alva TT V2 is our high-end option. This futuristic, fantastic-looking turntable brings you a balanced and insightful sound, as well as modern connectivity options. In contrast, the Fluance RT81 is a mid-range option with no-frills but a great sound for the price.\nBut if by reliable you mean sheer toughness, then the Technics SL-1500C needs to under consideration, because it's built like musical tank.\nWhat makes a high-quality turntable?\nThis largely depends what you're looking for – although of course, we have our opinions. We judge a high-quality turntable on the build, the different playback speeds that are on offer, the compatibility and how well-damped the deck is. It's also worth looking for extra features, like USB ports.\nBeginners may want to find an easy-to-use turntable rather than a high-quality, picky one requiring calibration of the tonearm and such. We recommend looking for simple setups, built-in phono stages and wireless connectivity, like Bluetooth. Style matters too, so pick out a look you like as well as a solid and dependable design.\nDoes vinyl sound better?\nThis is a big, complex question. And the answer depends on what you’re comparing it to – even among audiophiles, there’s some debate.\nGenerally speaking, traditional vinyl, especially older pressings made from analog masters, is often praised for its warm, rich sound. That’s because it’s a fully analog format and no digital processing gets in the way of the original recording’s texture and depth.\nHowever, many modern records are pressed from digital masters. This means that the music has already been digitized to some extent before being cut to vinyl. Which means that while you still get the tactile joy of playing a record, the sound quality might not be all that different from what you’d hear on a well-mastered digital file or CD.\nSo vinyl generally does offer more nuance and character than compressed MP3s. But whether it truly sounds all that “better” really depends on the recording, the pressing, the device you're using and your ears, because a lot of this is also down to personal preference, too.\nAre there any dangers with cheap turntables?\nObviously, cheap turntables aren't likely to sound as good as more expensive models – but they also pose a risk of damaging your records. Most cheap turntables use a ceramic cartridge instead of a magnetic cartridge, which means the needle is flexible and so will cause more wear to the record's grooves. In addition, cheap turntables often don't have counterweights in the arms, which means the needle isn't balancing delicately on the grooves, it's pushing into them – and then that combines with the inflexible needle. If the motor is rocky in quality and the turntable isn't well damped against outside vibrations, the record may wobble and apply even more undue pressure. And that goes double for turntables with built-in speakers, which will be adding their own vibrations to the body.\nNot all cheap turntables are a disaster waiting to happen to your (not cheap!) vinyl – some will have made good decisions about putting the money into the parts that matter, and skipping other unnecessary features. But some definitely are, so be sure to buy based on the reviews of people with experience, and consider strong saving a little longer to get a step-up model if you can, because the jump in safety and quality from 'super-cheap' to 'inexpensive' is large, but the price isn't that different.\nDoes my turntable need a USB port?\nYou might have noticed that several mid-range or budget turntables include USB ports, which is obviously a relatively recent addition to the tech inside these machines. So, should you prioritize having this option on your next spinner? Well, we have a whole guide that digs into the question of whether your next turntable should have a USB port, but we'll summarize the key points here.\nThe point of the USB port is to be able to digitize your record collection. You can connect it to a computer, and use software to record what the player plays – complete with analogue imperfections. In some cases, there may be albums or tracks on records that never made it onto the best music streaming services, so you might want to preserve these digitally, and a USB port enables you to do that.\nBut that is essentially the only reason. You wouldn't use for direct music playback in any way, and they're not used for software updates that improve turntable performance or anything like that.\nIf you are looking for an affordable turntable with a USB port, read our Audio-Technica AT-LP120XBT-USB review – that's an excellent option for the price.\nHow can I listen to a turntable using headphones?\nTo use headphones with a turntable, you’ll need either a model with built-in Bluetooth (such as the Audio-Technica AT-LP70XBT at #2 in the list, or Cambridge Audio Alva TT V2 at #3 in the list) – or you'll need to have them connected to an amp that offers a headphones output.\nMost turntables don’t come with a headphone jack, so you’ll usually have to run the turntable through a preamp or amplifier that has one, or that has Bluetooth support.\nHow we test the best turntables\nHaving tested countless record players over the years, we know that the best way to find out whether they live up to their specs is simply to open up our vinyl collection, set up the deck, calibrate the tonearm (if necessary) and get playing.\nSetup: When it comes to beginner and budget-friendly turntables, we're looking for simple setups, built-in phono stages and wireless connectivity options such as Bluetooth (for listening to the vinyl spinning on the platter through your wireless headphones) alongside solid tracking.\nExtra features: Naturally, when it comes to high-end audiophile record players, we look at the playback speeds offered, compatibility, how well-damped the deck is and extra features such as USB ports.\nBuild quality: Of course, a rock-solid, dependable build is also paramount here. We spend considerable time looking into the quality of the build. This means in terms of how the build impacts the performance – because sound is what matters the most – but also how to feels to use and how it'll look in your home. Style isn't everything, but if you're paying high-end prices and want something that looks just as high-end, aesthetics matter.\nPerformance: Audio quality is of paramount importance when it comes to selecting the best turntables. To earn a spot in this guide, a deck has to produce detail and clarity from your record stash while delivering that warm, rich analogue sound that good turntables are so well known for.\nValue: Finally, are you getting your money's worth? Several of the best turntables in this guide are expensive, but considering the build, performance and build, they represent great value. Similarly, you'll find cheaper options here but that doesn't mean they're not great value in some respects, particularly for beginners who may need reliability but not necessarily premium specs and features.\nThe latest updates to this turntables guide\nJuly 3, 2025\nRemoved several entries from the main list, including the Denon DP-300F, Marantz TT-15S1 and Victrola Hi-Res Onyx, and added them to our 'Also consider' section instead. Renumbered the new list and checked to ensure all info is up to date and relevant. Added several new entries to the FAQs section to help readers find the best turntable for them.\nMay 30, 2025\nAdded more beginner-friendly explanations and advice to our FAQs section, including about phono stages and automatic operation.\nMay 2, 2025\nRefreshed the intro. Added several new responses to our FAQs section to demystify the turntable buying process for readers.\nSee more updates\nApril 11, 2025\nRefreshed the introduction and added a link to gives readers details about Record Store Day 2025. Added the Vertere DG X as our new 'best for design' pick, based on recent testing.\nMarch 14, 2025\nRewrote the introduction and added information about the Technics SL-1200 watch. Alphabetized our 'also consider' section to make it easier for readers to scan, and added the EAT C-DUR Concrete here as another option. Restructured the 'how to choose' advice to focus on the key considerations.\nFebruary 17, 2025\nAdded more information for vinyl beginners to our 'How to choose' section.\nJanuary 16, 2025\nRewrote the introduction to keep things up to date and to mention that we're testing the Gadhouse Duke & Roy. Added image galleries to each entry to give readers a better look at the products we're recommending. Ensured all copy is up to date and doesn't reference old deals or outdated advice.\nDecember 20, 2024\nAdded the new House of Marley Revolution as our best super-budget beginner pick. Refreshed the intro to add clarity on different models and newer tech.\nNovember 27, 2024\nAdded a section about Black Friday turntable deals and suggestions.\nNovember 1, 2024\nRewrote the introduction. Added the Audio-Technica AT-LP70XBT as our 'best budget pick' , removing the older Audio-Technica AT-LP60XBT. Updated our 'also consider' section to include some new alternatives, including the Victrola Stream Sapphire. Itemized our 'how we test' explainer to make it easier for readers to see what we're looking for when we're reviewing the best turntables.\nSeptember 3, 2024\nAdded the Victrola Hi-Res Onyx as 'best for Bluetooth streaming'. Listed the Victrola Eastwood II, Majority Moto 2.0 and Rekkord Audio F300 to a new 'Also consider' section, which details products we've tested but don't recommend as a 'best for' model in this guide – and why.\nAugust 5, 2024\nSwapped the Lenco LS-410WA for the Pro-Ject Juke Box E1 as our new 'best all-in-one' option. It requires speakers adding, but that's it – and it sounds like a high-quality hi-fi system.\nJuly 31, 2024\nSwapped the Lenco LS-410WA for the Pro-Ject Juke Box E1 as our new 'best all-in-one' option. Granted, you do need to buy extra speakers but it's nearly all-in-one, and it's a great-sounding, well-priced, compact pick.\nJuly 5, 2024\nAdded a section explaining the use of USB ports in turntables.\nJune 7, 2024\nChecked all products. Added information about the difference between turntables and record players.\nMay 10, 2024\nAdded information about the potential risks of cheaper turntables damaging vinyl.\nMarch 28, 2024\nRemoved Clearaudio Concept because it's been discontinued.\nJanuary 22, 2024\nUpdated copy and content to reflect new turntables.\nNovember 10, 2023\nChecked all recommendations, and updated some descriptions and FAQs to aid clarity. Added notes about Black Friday deals.\nOctober 2, 2023\nChecked products against current prices and reviews, and updated some buying advice.\nSeptember 14, 2023\nAdded buy it if, don't buy it if boxouts to each individual product write-up, and checked product rankings against latest reviews.\nAugust 9, 2023\nUpdated the format of this guide to feature quick links at the top, refreshed prices within the copy to reflect the market.\nJuly 19, 2023\nChanged images to our own hands-on pictures. Reordered products to reflect the latest prices.\nJune 13, 2023\nChecked all products against our latest reviews and ratings.\nSign up for breaking news, reviews, opinion, top tech deals, and more.\nBecky became Audio Editor at TechRadar in 2024, but joined the team in 2022 as Senior Staff Writer, focusing on all things hi-fi. Before this, she spent three years at What Hi-Fi? testing and reviewing everything from wallet-friendly wireless earbuds to huge high-end sound systems. Prior to gaining her MA in Journalism in 2018, Becky freelanced as an arts critic alongside a 22-year career as a professional dancer and aerialist – any love of dance starts with a love of music. Becky has previously contributed to Stuff, FourFourTwo and The Stage. When not writing, she can still be found throwing shapes in a dance studio, these days with varying degrees of success."
    },
    {
      "url": "https://www.techradar.com/reviews/tidal",
      "text": "TechRadar Verdict\nTidal is the streaming service you need if you care about audiophile-approved listening. It also proves Spotify isn’t the only service with a huge library of music, curated playlists and easy-to-use apps. Anyone serious about music should sign-up for a free 30-day trial to see if you can tell the difference between Tidal’s stellar sound and your current music streaming service of choice.\nPros\n- +\nExceptional sound\n- +\nMusic videos\n- +\nGreat interface\nCons\n- -\nPlaylists not quite as polished as Spotify\n- -\nNo podcasts\n- -\nNot as savvy with social media\nWhy you can trust TechRadar\nTidal review: Two-minute review\nTidal is our top streaming service recommendation if you're after the best possible audio experience. Since it launched in 2014, Tidal has positioned itself as a solid rival to other platforms, with a strong commitment to prioritizing both artists and sound quality. In recent years, it has expanded its offering to include over 100 million tracks, mirroring Spotify's library size, and enhanced both its user interface and social sharing capabilities.\nDespite the fact it looks similar to Spotify, Tidal sets itself apart in two significant ways. First, it ensures artists receive fairer compensation per stream compared to many competitors. Second, it provides listeners with exceptional CD-quality audio.\nTidal isn’t for casual listeners. But for those who take their audio experience seriously, Tidal offers a sonic paradise. Particularly for anyone who owns high-quality audio gear, like the best noise cancelling headphones or the best surround sound system, Tidal's lossless and high-resolution audio files are designed to complement sophisticated setups, deliver a rich and immersive listening experience. Not sure if this applies to you? Start with the 30-day free trial. You might not notice a difference between Tidal and your music streaming service of choice, but you might notice the difference immediately and realize what you’ve been missing out on.\nWhile Tidal is a leading choice for high-fidelity music streaming, it’s not without competition. Deezer also caters to the high-resolution audio market, and both Amazon Music Unlimited and Qobuz offer CD-quality streams. However, Tidal's combination of a user-friendly interface, exclusive content and commitment to audio excellence secures its position as a top pick for audiophiles who prioritize quality and artist connection above all else.\nTidal review: Pricing and subscription\n- Individual subscription: $10.99 / £10.99 / $11.99 for Tidal HiFi\n- DJ add-on: $9 / £9 per month\n- A 30-day free trial\nYou used to have two subscription options with Tidal, Tidal HiFi and Tidal HiFi Plus – but not any more; not since April 2024, when the service bundled its once-'Hi-Fi Plus' streaming option down to an Apple Music-matching price – ie. $10.99 / £10.99 / AU$12.99 per month (rather than $19.99 / £19.99 / AU$23.99 a month. Yes, we know that's huge).\nFor this fee, you get the Tidal high-resolution 'Plus' audio option (with a lovely lossless audio tier), for Tidal HiFi money. There's also a $9 / £9 DJ add-on, which gives you catalog access and stem separation via select DJ partners, a half-price student tier (also hi-res, and you can also add your DJ stems here, if you wish) as well as a $16.99 / £16.99 family membership for up to six members of your household.\nIs there a free version of Tidal? That's a tricky question to answer. Sign-up for one of the two options above and you get a 30-day free trial before your subscription kicks in to check it's right for you.\nSign up for breaking news, reviews, opinion, top tech deals, and more.\nBack in 2021, Tidal also announced it would be launching a Tidal Free plan in the US, a free version of the music streaming service. A number of people then signed up, but as far as we can tell, that option no longer exists and Tidal never made an official announcement saying it was no longer an option. Since then, users have posted to Reddit and other forums saying they were prompted to sign-up for a subscription after using Tidal Free.\n| Type | Monthly Cost |\n|---|---|\n| Tidal HiFi | $10.99 / £10.99 / AU$11.99 |\nTidal review: Key specs\n| Monthly fee | Tidal Individual plan: $10.99 / £10.99 / AU$11.99 |\n| Free plan? | Yes (US only) |\n| Music library size | 100 million tracks |\n| Maximum bitrate | 24-bit/192 kHz (via FLAC) |\n| Podcasts | Yes |\nTidal review: Music library and content\n- More than 100 million tracks\n- Over 650,000 videos\n- Limited number of podcasts\nThere are currently more than 100 million tracks on Tidal, which is the same amount you'll find on Spotify and Apple Music. There used to be a time when you’d need to check a music streaming service has your favorite artist before you sign up, but that’s no longer the case now. Although it’s worth mentioning you’re likely to find artists on Tidal who leave (or temporarily leave) Spotify over its various controversies.\nUnlike many other music streaming services, Tidal also has a section specially for videos. Right now there are more than 650,000 videos on the platform. You can watch many full length shows and concerts, exclusive content, as well as some classic videos, either within the app or cast them to your TV. This is a cool addition, but you won’t find videos from all of your favorite artists here.\nTidal has added podcasts to its offering. Tidal says it has “curated a selection of podcast series that focus on intimate storytelling”, which means you’ll find a small library of shows that tend to focus on music, creativity and culture. This is a nice addition, but don’t expect the huge selection you’ll find on Spotify covering a range of subjects.\nTidal review: Apps and compatibility\n- Mobile and desktop app\n- Nice and slick experience\n- Tidal Connect for seamless streaming\nTidal has a mobile app and a desktop app, but you can also listen via a web player too. There are a few key sections in both apps. Home is where you’ll find lots of suggested mixes, artists and albums based on what you’ve listened to before. In Videos you’ll have access to video playlists, documentaries and live content. Go to Explore to search by genre, moods and activities or by quality categories, like HiRes and Dolby Atmos. My Activity is where your most streamed and played artists appear and Your Account is where you can access your collection of mixes, radio stations, playlists, albums, tracks, videos and artists.\nIn the desktop app the larger screen the menu is displayed down the left hand side and there you’ll also find all of your playlists. There are standard sharing features too, to Facebook, X and you can copy the track link or even an embed code. In the mobile app, you can share directly to Facebook Stories or Instagram Stories. Some people won’t care about this feature, others will love the Stories-worthy image Tidal creates for you out of the artwork for the track you’re listening to, which you can then share instantly.\nThe Tidal apps might be the nicest to use and best-looking compared to its rivals. The design is very similar to Spotify with a grid-like layout, but it feels a little cleaner and less cluttered to scroll through your options. I also like the simple black and gray color palette with bright turquoise accents, as well as the neat font.\nLike Spotify, Tidal has a feature called Spotify Connect, which allows you to stream tracks straight from the cloud to a range of other devices, including Cambridge Audio and KEF sound systems, as well as within some cars thanks to Apple’s AirPlay and Android Auto. Simply find the little icon that looks like a speaker in the top right hand corner of whatever you’re playing and compatible devices will appear.\nTidal review: Playlists and recommendations\n- Great recommendations\n- Mixes are spot on\n- Tidal Rising is fun\nSpotify is considered the king of playlists perfectly crafted for you, but Tidal clearly has a powerful algorithm working behind-the-scenes to make solid recommendations too. When you first sign up for the service, you’re encouraged to pick three of your favorite artists. This informs your first mix, called your Welcome Mix. Based on only three artists, I wasn't holding out much hope with this playlist, but it was spot on taste-wise and I listened to nothing else for the first morning I signed up.\nThe more you like and listen to music, the more Tidal will learn about your tastes and generate different playlists called mixes. Each is based on your listening and focuses on a different genre. These don’t update as regularly as Spotify’s, but tend to do a great job at predicting what users will like. Make sure to hit save if you like a particular mix, this way you can save it as a separate playlist before it gets refreshed.\nThe mix of playlist recommendations and updates doesn’t feel as expansive as what Spotify offers, there also aren’t as many fun themed playlists, like Spotify's Wrapped or Daylist, but it’s not too far off. And if you're the kind of person who just wants quality music and doesn't need the themed playlists, then you'll love it here at Tidal.\nWhen it comes to recommendations, a great feature of Tidal’s service is Tidal Rising, which you can find in the explore tab. This is where Tidal spotlights up-and-coming artists from all over the world. It’s a fun way to stay ahead of trends and discover new talent. If you’re at all worried that services like Spotify might serve up the same kind of music and the same kind of artists over and over, Tidal Rising is a good antidote.\nUnfortunately, you can’t add local music files to Tidal. This is a bit of a shame but shouldn’t be a dealbreaker for most people. If it is, look at Spotify or Deezer instead. However, you can transfer your music library and your playlists from other music streaming services to your Tidal library via third-party apps.\nTidal review: Audio quality\n- Tidal offers up to 9,216kbps or 24-bit/192kHz with HiRes FLAC\n- You'll need good audio tech to make the most of Tidal\nYou’ll get a great audio experience with Tidal, with a bitrate of up to 9,216kbps or 24-bit/192kHz with HiRes FLAC.\nWhen you have Tidal, you also have three sound quality options to choose from, which you can manually select. Max is up to 9,216kbps or 24-bit/192kHz, which Tidal says is HiRes Free Lossless Audio Codec (HiRes FLAC). This is best if you’re on 5G or WiFi. High is up to 1411kbps or 16-bit/441.kHz, which Tidal calls “studio quality” in a FLAC format. And finally, Low 320kbps, which Tidal recommends if you have a weak signal. Low actually matches the bitrate on offer from Spotify. With Tidal HiFi, you’ll only get access to High and Low.\nI spent a lot of time trialling them, and with the right audio equipment (more on that soon), I could definitely tell a difference between the two options. In summary, Max files are just so much better. With Max, tracks sounded clearer, more detailed and more expansive. This means if you really care about audiophile-grade sound and you have the right kit for it, you’re going to love Tidal.\nHowever, the quality of the sound you hear will depend on a couple of factors. The first is the format and quality of the track you’re playing. In 2023, Tidal made some changes to its service. Before then, it was really its Masters tracks. These had an MQA (Master Quality Authenticated) format. This claims to be a superior format, but not everyone is a fan and not all audio devices support MQA decoding. This could be why Tidal has since moved its focus away from MQA, and no longer seems to refer to tracks as Masters. It now instead calls these higher quality tracks Max tracks or just HiRes tracks.\nTidal says it now offers the best quality version of these tracks, which might be FLAC, or it might be MQA. These tracks are now labelled as HiRes in the Tidal app. Go to Explore and scroll down to HiRes to see them. What seems to be happening here is Tidal is migrating tracks to lossless hi-res audio in the open-source FLAC format. So now you’ll play a HiRes track and it might be MQA or not. Take a look at the image above and you’ll see that Water by Tyla has a small MQA label. Whereas Back on 74 by Jungle has a 24-bit, 44.1Hz FLAC label.\nIt’s also worth mentioning FLAC will never sound quite as good through an average mobile device's headphone jack as it does from a device with more competent audio hardware. That means you might want to upgrade your headphones or sound system to really make the most of Tidal if you don’t have compatible tech already.\nWith Tidal, you used to get Dolby Atmos Music with Sony 360 Reality Audio, but the streaming platform cut ties and ended support for the Sony proprietary spatial audio solution in July 2024. Apple Music , however, does offer Spatial Audio, so it's worth considering this if you like your music truly immersive…\nShould I subscribe to Tidal?\nSubscribe if…\nYou want great-sounding hi-res music\nWe can tell you that while it's a close-run race here between Apple Music, Tidal's dynamically agile tracks win out.\nYou want music to be recommended to you\nTidal does a great job of curating personalized playlists based on the artists you like already.\nYou've forked out for some audiophile headphones\nIt's worth subscribing to Tidal HiFi Plus if you've got a pair of high-end headphones to really enjoy the audio quality you're getting with this tier.\nDon’t subscribe if...\nYou don’t care about Hi-Res Audio\nDon’t subscribe to Tidal’s HiFi Plus tier if this applies to you. And if you don't have compatible tech, go for Spotify.\nYou want to listen to podcasts and audiobooks\nThere are now a limited number of podcasts on Tidal, but for broader choice and audiobook options too, you'll need to head to Spotify.\nYou like fun social features\nTidal has improved its social features over the years, but it still doesn't have the same seamless experience or fun and colorful vibe as Spotify in this respect.\nBecca is a contributor to TechRadar, a freelance journalist and author. She’s been writing about consumer tech and popular science for more than ten years, covering all kinds of topics, including why robots have eyes and whether we’ll experience the overview effect one day. She’s particularly interested in VR/AR, wearables, digital health, space tech and chatting to experts and academics about the future. She’s contributed to TechRadar, T3, Wired, New Scientist, The Guardian, Inverse and many more. Her first book, Screen Time, came out in January 2021 with Bonnier Books. She loves science-fiction, brutalist architecture, and spending too much time floating through space in virtual reality."
    }
  ],
  "argos_summary": "Focal showcased its new Diva Mezza Utopia speakers at the Audio Advice Live 25 show in Raleigh, North Carolina, introducing a high-end wireless audio solution priced at $69,000. These speakers support high-resolution audio streaming and feature a sophisticated design with multiple connectivity options, including Wi-Fi and Bluetooth. The system is engineered for exceptional sound quality, featuring advanced drivers and amplifiers, and is aimed at audiophiles seeking a luxurious listening experience.",
  "argos_id": "RHRBZZBH5"
}