{
  "url": "https://www.usatoday.com/story/sports/nba/2025/08/11/nba-christmas-schedule-eastern-conference-weak/85615296007/",
  "authorsByline": "Robert Zeglinski",
  "articleId": "030ed4934e394f5cbf77fab87e7563d2",
  "source": {
    "domain": "usatoday.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "VA",
      "county": "Fairfax County",
      "city": "McLean",
      "coordinates": {
        "lat": 38.9342888,
        "lon": -77.1776327
      }
    }
  },
  "imageUrl": "https://www.usatoday.com/gcdn/authoring/authoring-images/2025/08/11/SFTW/85613702007-usatsi-26179542.jpg?crop=4283,2410,x0,y142&width=3200&height=1801&format=pjpg&auto=webp",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T18:52:46+00:00",
  "addDate": "2025-08-11T20:47:44.810740+00:00",
  "refreshDate": "2025-08-11T20:47:44.810742+00:00",
  "score": 1.0,
  "title": "The NBA is already punting on the Eastern Conference",
  "description": "Even the NBA knows that the Eastern Conference is actually the \"Leastern\" Conference.",
  "content": "For most of the 21st century, the disparity between the NBA's Western and Eastern Conferences has been a chasm.\n\nThe prevailing sentiment among hoops fans has been that the West's overall quality usually blows the East out of the water. Between the contrast in the number of All-NBA selections, the massive difference in the number of league champions this millennium (17 for the West, nine for the East), and the sheer amount of free agent superstars who seemingly waste no time running to states like California and Texas, it's hard to ignore this reality as a basketball lover.\n\nI just never thought the NBA itself would directly acknowledge the gulf between the West and East.\n\nWell, at least heavily imply it exists, you know?\n\nOn Friday, the league revealed (news-dumped) its opening night and Christmas schedules. These are, as I'm sure all of you know, traditionally considered the two biggest evenings on the NBA regular season calendar. One tips off eight months of professional men's basketball after a much-needed summer break. The other is essentially a marquee league showcase for people who have been paying attention to the NFL and college football up until that point and are ready to start devoting their energy elsewhere.\n\nBut when you look at the reported games, you'll notice there's a distinct lack of Eastern basketball flavor.\n\nOf the seven total opening night and Christmas games, only the Cleveland Cavaliers and New York Knicks are carrying the East's torch. One game. Of 14 total slots, just two East teams. Woof. Essentially, the only two teams being featured are the two who might end up meeting in this year's Eastern Conference Finals. Otherwise, the NBA is temporarily giving up on selling the East to hardcore fans and casuals alike. By ignoring everyone else, the NBA is saying no other East team this season has the juice. At least, not yet.\n\nTo be clear, I'm not surprised by this development.\n\nWith the Boston Celtics and Indiana Pacers operating without an injured Jayson Tatum and Tyrese Haliburton, respectively, for the entire season, the East is extremely top-heavy. Giannis Antetokounmpo's Milwaukee Bucks aren't in flux, but they're also not very good. The Orlando Magic, Atlanta Hawks, and Detroit Pistons could all be nice stories and great teams by the end of the year, but they're likely not going to attract a lot of eyeballs right now. There's not a lot to work with here.\n\nWhile the East was already weaker than the West on paper, it, by default, has even less intrigue than ever.\n\nBy comparison, the West has, at minimum, three of the NBA's five best teams (the reigning champion Oklahoma City Thunder, Nikola Jokić's Denver Nuggets, and Kevin Durant's Houston Rockets). Luka Dončić plays for the Los Angeles Lakers, arguably the most popular sports team in the world. Potential all-time generational talent Victor Wembanyama is a San Antonio Spur. And, of course, there's still the electric Steph Curry in Golden State and the intrigue of Cooper Flagg in Dallas, among other hotspots.\n\nIf you were a league trying to sell yourself to bog-standard sports fans, it's just good business to center this conference.\n\nBut that's the thing.\n\nMost of us already knew the NBA's West generally provided better basketball than the East. You know, especially as it tries to get back on its feet. It's still pretty jarring to see the league, the people running the show, agree with us.\n\nFor those of you jonesing to see some of your favorite NBA players hoop it up again, may I humbly suggest this year's EuroBasket tournament? I mean, let's be honest, three of the league's four best players will be featured. It's no amateur showcase of young players. It's a serious affair with the vaunted title of European champion on the line.\n\nSo, to put it lightly, I think it's worth our time.\n\nBut not every nation participating in EuroBasket is created equal. With all due respect to squads like Iceland and Jeremy Sochan's Poland, they're probably going to have the chance to go home early and put their feet up. FIBA's been keeping track of the leading contenders for the gold medal so far, and I have to say: it's pretty spot on.\n\nWith Nikola Jokić in the fold, this is Serbia's tournament to lose:\n\nI'm not saying Serbia is guaranteed its fourth-ever European championship and the first in nearly a quarter-century. Squads like Franz Wagner's Germany and the always-tough France will be tough outs. But I feel a lot less confident in the French without their twin towers in Rudy Gobert and Wembanyama, who won't play in the tournament. And while Germany is a well-oiled machine of efficiency, it doesn't have the same level of talent or depth that Serbia's program possesses.\n\nThe Serbians are not so quietly ranked second in FIBA's men's world rankings. They're only a year removed from putting a genuine scare into arguably the greatest on-paper team the United States has ever assembled. And they've only gotten better since then, with more young players coming into their own. Also, again, they still have the world's best player in his prime in Jokić.\n\nCall me old-fashioned, but I think it's wonderful that a country with a population of less than seven million people can really put itself on the map as a mainstream basketball powerhouse by winning EuroBasket.\n• Sydney Colson's season-ending injury is devastating for the Fever. Cory Woodroof outlined some replacement options.\n• Speaking of the injured Fever, at least Caitlin Clark is keeping busy courtside.\n• Grown man Tyrese Maxey doesn't know how to use a standard kitchen tool.\n\nThis was Layup Lines, For the Win's basketball newsletter. Subscribe here to get it delivered to your inbox every Monday, Wednesday, and Friday.",
  "medium": "Article",
  "links": [
    "https://sportsdata.usatoday.com/basketball/nba/teams/new-york-knicks/18/",
    "https://sportsdata.usatoday.com/football/nfl/scores",
    "https://www.usatoday.com/story/sports/nba/2025/08/08/nba-christmas-day-2025-schedule/85583781007/",
    "https://sportsdata.usatoday.com/basketball/nba/teams/cleveland-cavaliers/5/",
    "https://ftw.usatoday.com/search/?q=sydney+colson",
    "https://www.usatoday.com/story/sports/wnba/2025/08/09/caitlin-clark-playfully-booed-stephanie-white-random-fever-timeout/85595855007/",
    "https://profile.usatoday.com/newsletters/USAT-NWSLTRMNGMNT-SM/layup-lines/",
    "https://www.usatoday.com/story/sports/nba/2025/06/22/kevin-durant-trade-rockets-odds-championship/84308571007/",
    "https://www.usatoday.com/story/sports/nba/2025/08/04/luka-doncic-lakers-extension-trust-free-agency-2027/85512766007/",
    "https://x.com/LevAkabas/status/1793620395771502608",
    "https://www.usatoday.com/story/sports/nba/2025/08/11/eurobasket-nba-player-rankings-2025/85602415007/",
    "https://sportsdata.usatoday.com/basketball/nba/teams/houston-rockets/10/",
    "https://www.fiba.basketball/en/ranking/men?gad_source=1&gad_campaignid=21668710559&gbraid=0AAAAA9uTMqD03Q5kvjDdanYOQxRED3GiP&gclid=Cj0KCQjwqebEBhD9ARIsAFZMbfzObGWYUd5oCpffUNqUNkAd0gKFnUF3VwRxt1rTF5mwbccCOcQg2QwaAuGjEALw_wcB",
    "https://sportsdata.usatoday.com/basketball/nba/teams/oklahoma-city-thunder/25/",
    "https://sportsdata.usatoday.com/basketball/nba/teams/orlando-magic/19/",
    "https://www.usatoday.com/story/sports/nba/2025/07/28/tyrese-haliburton-engaged-proposal-girlfriend-jade-jones/85414876007/",
    "https://www.usatoday.com/story/sports/nba/2025/07/15/nba-win-totals-over-under-picks-2025/85209917007/",
    "https://www.usatoday.com/story/sports/nba/2025/08/04/giannis-antetokounmpo-trade-rumors-bucks-shams-reaction/85511704007/",
    "https://sportsdata.usatoday.com/basketball/nba/teams/boston-celtics/2/",
    "https://www.usatoday.com/story/sports/nba/2025/07/02/nuggets-free-agency-nikola-jokic-nba-title-odds/84446287007/",
    "https://www.usatoday.com/story/sports/nba/2025/05/13/jayson-tatum-injury-update-achilles-twitter-reaction/83609071007/",
    "https://www.usatoday.com/story/sports/nba/2025/08/11/tyrese-maxey-asked-instagram-help-can-opener-nba/85613192007/",
    "https://www.usatoday.com/story/sports/nba/2025/08/10/kevin-durant-thunder-banner-night-trolls-rockets-reaction/85601863007/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "NBA",
      "weight": 0.06471879
    },
    {
      "name": "great teams",
      "weight": 0.061324865
    },
    {
      "name": "league champions",
      "weight": 0.06072974
    },
    {
      "name": "East",
      "weight": 0.060077295
    },
    {
      "name": "better basketball",
      "weight": 0.05771466
    },
    {
      "name": "Eastern basketball flavor",
      "weight": 0.054101687
    },
    {
      "name": "young players",
      "weight": 0.05243773
    },
    {
      "name": "more young players",
      "weight": 0.05223739
    },
    {
      "name": "Grown man Tyrese Maxey",
      "weight": 0.049554966
    },
    {
      "name": "European champion",
      "weight": 0.0489805
    }
  ],
  "topics": [
    {
      "name": "Basketball"
    },
    {
      "name": "NBA"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.98193359375
    },
    {
      "name": "/Sports/Team Sports/Basketball",
      "score": 0.9560546875
    }
  ],
  "sentiment": {
    "positive": 0.10340396,
    "negative": 0.58041364,
    "neutral": 0.31618237
  },
  "summary": "The NBA's Western and Eastern Conferences have been a significant disparity for most of the 21st century, with the West's overall quality often outperforming the East's. However, the league recently revealed its opening night and Christmas schedules, which traditionally showcase the West and East, has been lacking. Only two teams featured in these games are the Cleveland Cavaliers and New York Knicks, suggesting that the East lacks the power to compete. This move suggests that the league may be giving up on selling the East to casual fans and casuals. While the East was already weaker than the West on paper, it has even less intrigue than ever due to its top-heavy teams.",
  "shortSummary": "The NBA is significantly reducing its focus on the Eastern Conference, prioritizing the West over the East, as part of efforts to attract more viewers.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "774e988b52a546a49f467eace06990de",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.usatoday.com/story/sports/nba/2025/07/02/nuggets-free-agency-nikola-jokic-nba-title-odds/84446287007/",
      "text": "Nuggets’ fantastic free agency will give Nikola Jokić legit chance at 2nd NBA title\nIn 2023, the Denver Nuggets won their first NBA championship in franchise history in dominant fashion. Their 16-4 postseason record that year remains one of the best for any champion in the modern era. In the years since, the Nuggets have bled reliable role players. That was enough to push them to two consecutive heartbreaking second-round Game 7 losses. To put it lightly, the franchise was backed into a corner as all-time great Nikola Jokić dove headfirst into his prime.\nAs it turns out, after having arguably the best NBA free agency of anyone in the league, the Nuggets have finally wiggled themselves out of this jam. They have finally rebuilt a bona fide title contender with genuine star power and depth. They have finally given Jokić what he asked for: a real chance to lead his team to the promised land once again.\nThe massive shift upward in the betting market on the Nuggets' 2026 title chances reflects these sentiments as much. Everyone, and I mean everyone, is scared of Jokić's Nuggets again:\nIt's easy to see why people hovering in and around the NBA are respecting Jokić's Nuggets as title-worthy once more. And no, it's not just limited to them taking the reigning champion Oklahoma City Thunder to seven games despite a rash of injuries and a dangerously thin lineup.\nThat's because the last time the Nuggets had this deep and versatile of a rotation on paper, they won it all. Full stop. Any time you give a transcendent talent like Jokić a quality, complementary supporting cast, no one should question his ability to reach the NBA's tallest summit.\nLet's run it all down.\nNew starting small forward Cam Johnson is a more versatile player than his predecessor, Michael Porter Jr. He can shoot from deep, create his own shot off the dribble, and is more dependable on defense. Honestly, Johnson is a higher IQ basketball player in general. These kinds of intuitive players tend to thrive with Jokić, who is usually operating at least one or two steps ahead on the court. Johnson's skillset will simply give Denver more much-needed optionality and wrinkles.\nAs the do-it-all Swiss Army Knife sixth man during Denver's 2023 title run, Bruce Brown returns to run it all back. Between health and consistency issues, it's been a rough couple of years for Brown since he (rightfully) cashed in on that first Denver championship. However, he likely remains a winning player who knows how to play off Jokić and the other key members of the Nuggets' core, including Jamal Murray, Aaron Gordon, and Christian Braun. Brown is the kind of plug-and-play role player who, just like he did in 2023, will wear many different hats in all sorts of Nuggets lineups.\nTalk to anyone associated with Denver over the last decade, and they'll tell you how much of a problem it's been finding someone reliable to spell Jokić off the bench. In recent years, especially, it has not been uncommon for Jokić to build a double-digit lead, take his first rest, then come back facing a deficit. It's this very mix that has led the Nuggets to stretch Jokić unnecessarily thin during the regular season, when they'd much rather prefer he conserve energy for the playoffs. This should no longer be an issue with the steady Jonas Valančiūnas in the fold. Because of his natural feel and old-school play style, Valančiūnas has long been one of the NBA's more underrated and dependable centers.\nNow the guy they call \"Big Val\" gets the easy job of keeping mileage off Jokić's odometer until April.\nThrow in hopeful internal development from former first-round prospects Julian Strawther, Peyton Watson, and rookie DaRon Holmes, as well as shooting insurance option Tim Hardaway Jr., and the Nuggets, to put it plainly, are cooking with gas.\nOf course, nothing is guaranteed for Jokić or his Nuggets.\nThe Thunder figure to come back storming for a chance to repeat. After adding Kevin Durant, among others, the Houston Rockets will also be a force to be reckoned with. This is to say nothing of the daunting Western Conference overall, where no one ever gets a \"night off\" with supposed cupcake competition.\nBut everyone should feel the same way about the Nuggets now. Their much-needed facelift has them sitting in the healthiest, strongest place they've been in years. On paper, they're in a position to achieve something genuinely special. Betting against them and the best player in the world after what they just accomplished in free agency feels like the silliest prospect.\nI certainly wouldn't advise it."
    },
    {
      "url": "https://sportsdata.usatoday.com/basketball/nba/teams/oklahoma-city-thunder/25/",
      "text": "Even the NBA knows that the Eastern Conference is actually the \"Leastern\" Conference.\n“Adding Kevin Durant in place of Jalen Green to a young, successful, and elite defensive team was the perfect fit for the 15-time All-Star.”\nEven the NBA knows that the Eastern Conference is actually the \"Leastern\" Conference.\nEven the NBA knows that the Eastern Conference is actually the \"Leastern\" Conference.\n| | | | |\n|---|---|---|---|\n| | | | |\n| | | | |\n| | | | |\n| | | | |\n| | | | |\nGannett may earn revenue from sports betting operators for audience referrals to betting services. Sports betting operators have no influence over nor are any such revenues in any way dependent on or linked to the newsrooms or news coverage. Terms apply, see operator site for Terms and Conditions. If you or someone you know has a gambling problem, help is available. Call the National Council on Problem Gambling 24/7 at 1-800-GAMBLER (NJ, OH), 1-800-522-4700 (CO), 1-800-BETS-OFF (IA), 1-800-9-WITH-IT (IN). Must be 21 or older to gamble. Sports betting and gambling are not legal in all locations. Be sure to comply with laws applicable where you reside.\nGambling involves risk. Please only gamble with funds that you can comfortably afford to lose. While we do our upmost to offer good advice and information we cannot be held responsible for any loss that maybe be incurred as a result of gambling. We do our best to make sure all the information that we provide on this site is correct. However from time to time mistakes will be made and we will not be held liable. Please check any stats or information if you are unsure how accurate they are. No guarantees are made with regards to results or financial gain. All forms of betting carry financial risk and it is down to the individual to make bets with or without the assistance of information provided on this site and we cannot be held responsible for any loss that maybe be incurred as a result of following the betting tips provided on this site. Past performances do not guarantee success in the future and betting odds fluctuate from one minute to the next. The material contained on this site is intended to inform, entertain and educate the reader and in no way represents an inducement to gamble legally or illegally. Betting is illegal in some countries, or areas of countries. It is the sole responsibility of the user to act in accordance with their local laws."
    },
    {
      "url": "https://www.usatoday.com/story/sports/nba/2025/07/15/nba-win-totals-over-under-picks-2025/85209917007/",
      "text": "NBA win totals: Offseason over/under picks for all 30 teams\nThe NBA playoffs, draft, and free agency are all finally behind us. You know what that means?\nEven though we're still a few months away from the start of the 2025-2026 NBA season, it's time to take a more earnest stock of the league's current landscape.\nFor example, Nikola Jokić's Denver Nuggets and Kevin Durant's Houston Rockets look like bona fide championship contenders after crushing their respective offseasons. I also wouldn't discount the possibilities for the revitalized Atlanta Hawks and Orlando in a (temporarily) weaker East. And if you somehow have any hope for squads like the Utah Jazz, well, godspeed to you.\nI say all this because the projected regular-season win totals for the next NBA season have already been released at most major sportsbooks. They are an early (but still noteworthy) sense of how the betting market is treating all 30 teams before the next meaningful tip-off in late October.\nAnd let me tell you: some of these over/unders are free money. Full stop.\nAfter a wild offseason, let's make over/under win totals picks for all 30 NBA teams. If one of my predictions irritates you, don't worry, that was obviously the clear intention.\nAll over/under win totals courtesy of FanDuel Sportsbook.\nAtlanta Hawks: Over/Under 46.5 wins\nAfter trading for Kristaps Porzingis, the Hawks have surrounded Trae Young, one of the NBA's best playmakers, with length and versatile, two-way play. The East is weaker than usual, which should also give the Hawks an easy path to one of the conference's top seeds.\nPick: Over\nBoston Celtics: Over/Under 43.5 wins\nBoston will be without Jayson Tatum for the entire season. His absence will stack on top of sizable departures from Porzingis and Al Horford. So, the Celtics probably won't be a title contender. But between Jaylen Brown, Derrick White, and an empowered role from Anfernee Simons, there's still enough to like about Boston being a respectable team.\nPick: Over\nBrooklyn Nets: Over/Under 20.5 wins\nOn some level, I like what the Nets are building. I'm just not exactly sure what they're building. For now, they're a young team led by Cam Thomas and Michael Porter Jr., who will likely be empowered to shot-chuck as much as possible. Oh, and no one will play much of any defense. We're heading for another tank season in Brooklyn.\nPick: Under\nCharlotte Hornets: Over/Under 25.5 wins\nThe Hornets couldn't even crack 20 wins last year. However, that was with key players like LaMelo Ball and Brandon Miller, among others, missing significant time due to injuries. Factor in better injury luck along with additions like veteran Collin Sexton and No. 4 overall pick Kon Knueppel, and I like the Hornets to (relatively) surprise some people in a down year for the East.\nPick: Over\nChicago Bulls: Over/Under 31.5 wins\nThe Bulls couldn't be this bad if they tried. Which, to be clear, they will never try. This is a sorry organization content with straddling around the East's play-in tournament just so it can put butts in seats for a few more games before hibernating for the summer. Having them hover much closer to .500 (but not much higher) is such a lock.\nPick: Over\nCleveland Cavaliers: Over/Under 56.5 wins\nThe Cavaliers cruised to 64 wins last year. And that was with a healthy Tatum and Tyrese Haliburton playing for other Eastern powers. Cleveland is basically running it back with the same roster in a now-weaker conference, meaning it should enjoy another season of roughly 60 wins.\nPick: Over\nDallas Mavericks: Over/Under 40.5 wins\nI would like these Mavericks so much more if they had a healthy Kyrie Irving. But he's probably going to miss most of next season while recovering from a torn ACL at age 33. That's bad news for a Dallas team with a stacked frontcourt (Anthony Davis, Cooper Flagg, Dereck Lively II) that still lacks offensive creators with juice.\nPick: Under\nDenver Nuggets: Over/Under 53.5 wins\nTo maximize Nikola Jokić's gifts, you have to surround him with shooters and smart, instinctive players. After adding Cam Johnson, Bruce Brown, Tim Hardaway Jr., and Jonas Valančiūnas this offseason, that's exactly what the Nuggets have done. And if young players like Julian Strawther and Peyton Watson take another leap forward, the sky's the limit for one of this year's true title contenders.\nPick: Over\nDetroit Pistons: Over/Under 44.5 wins\nThe youthful Pistons turned heads when a midseason stretch last year vaulted them to a top-six seed in the East. With valuable experience under their belt, this still-developing group that just added Duncan Robinson and Caris LeVert should be taken a lot more seriously. Winning a playoff round and enjoying a 50-win season is on the table for Cade Cunningham's team.\nPick: Over\nGolden State Warriors: Over/Under 46.5 wins\nOn paper, outside of their size concerns, I actually really like the Warriors' roster. Steph Curry, Draymond Green, and Jimmy Butler comprise quite a core. And this isn't even factoring in a potential Al Horford addition. But Curry, Green, and Butler are all at least 35 years old. I have doubts that a still-small squad built around this many old players is ready for the long haul of an 82-game regular season.\nPick: Under\nHouston Rockets: Over/Under 54.5 wins\nThe Kevin Durant Brooklyn Nets were title contenders. Until they weren't. The Kevin Durant Phoenix Suns were title contenders. Until they weren't. Forgive me if I'm not going to totally buy into the hype of a late-30s Durant joining a Houston team that needs him to be the No. 1 perimeter scorer. The Rockets are capable of hoisting the Larry O'Brien Trophy. But I think they'll require some time to figure things out before that really becomes possible.\nPick: Under\nIndiana Pacers: Over/Under 38.5 wins\nTyrese Haliburton's Achilles tear and Myles Turner's departure will take a lot of wind out of the Pacers' sails. They were poised for dominance in the East for years to come. Now, they're kind of just treading water. Rick Carlisle is too good of a coach for Indiana to completely crater, but I'm otherwise writing the Pacers off for a good while.\nPick: Under\nLos Angeles Clippers: Over/Under 47.5 wins\nThe Clippers were already a sneaky great team last season. Now they've added Brook Lopez and John Collins into their mix. I still don't think this group can make that much noise in the postseason, but one of the NBA's deepest rosters should absolutely feast during the regular season.\nPick: Over\nLos Angeles Lakers: Over/Under 48.5 wins\nThe Lakers followed up the momentum of the Luka Dončić trade by ... flaming out in the first round of the playoffs and making Deandre \"I can't leave my driveway for the game because it's snowed in\" Ayton their big-ticket free agent acquisition. Woof. Los Angeles has made it clear that winning in 2026 and 2027 is a bigger priority for the franchise. It'll show this year, and not in a good way.\nPick: Under\nMemphis Grizzlies: Over/Under 40.5 wins\nI don't like the Grizzlies' general direction, but hoo boy, this is free money. Three-and-defense guard Kentavious Caldwell-Pope is a better fit next to Ja Morant. Jaren Jackson Jr. should continue getting better. And a potential big step forward for second-year player Jaylen Wells should do wonders. This team isn't good, but it is underrated.\nPick: Over\nMiami Heat: Over/Under 36.5 wins\nUntil further notice, the Heat are the definition of mediocre. However, they no longer have the spectre of Jimmy Butler pleading his way out hanging over them. And there are worse rosters in the East than a group that just added Norman Powell to play alongside Tyler Herro, Andrew Wiggins, Bam Adebayo, and Kel'El Ware. Erik Spoelstra is cooking with, er, something.\nPick: Over\nMilwaukee Bucks: Over/Under 44.5 wins\nThe Bucks' backcourt is a mess. Seriously, Kevin Porter Jr., Gary Trent Jr., and Cole Anthony? Gross. However, Myles Turner should be one of the better frontcourt partners for Giannis Antetokounmpo in his illustrious career. By no means is Milwaukee a contender, but it will still be in play for a top-five East seed and a decent season.\nPick: Over\nMinnesota Timberwolves: Over/Under 50.5 wins\nThere were hints that the Timberwolves would try shaking things up this offseason. Instead, they kept Rudy Gobert and extended Julius Randle. That means essentially the same group that has made it to back-to-back Western Conference Finals is returning for another crack at it. With that said, the loss of stalwart perimeter defender Nickeil Alexander-Walker will hurt, and I think Minnesota is more of a playoff team than one that shines during the regular season.\nPick: Under\nNew Orleans Pelicans: Over/Under 30.5 wins\nOn paper, the Pelicans should probably be a lot better. But Zion Williamson, who was recently accused of sexual assault in a lawsuit, has never been able to put it together for a full season. Neither have guys like Herb Jones and, to a lesser extent, Dejounte Murray. Derik Queen is a fun rookie addition, but this is a New Orleans roster rife with pieces that simply don't mesh together.\nPick: Under\nNew York Knicks: Over/Under 52.5 wins\nFresh off their first Eastern Conference Finals appearance in a quarter-century, the Knicks are poised to finally return to the NBA Finals. That's why they're bringing back the same roster, albeit with the notable acquisition of bully-ball bruising forward Guerschon Yabusele. Not even the uninspiring hire of Mike Brown could stop the Knickerbockers from a sterling season. Well, maybe, but you get the idea.\nPick: Over\nOklahoma City Thunder: Over/Under 62.5 wins\nThe reigning NBA champions are also running it back. After committing over $800 million to Shai Gilgeous-Alexander, Jalen Williams, and Chet Holmgren, why wouldn't they? But I have a hunch there will be a bit of a learning period for an Oklahoma team that learns what it's like to be the hunted instead of the hunter for the first time. I think another 60-win season is still on the horizon, but not one that approaches all-time NBA greatness.\nPick: Under\nOrlando Magic: Over/Under 50.5 wins\nThe Magic do two things well: defend like hell and play together. With a healthy Jalen Suggs returning to the lineup alongside the solid Desmond Bane in the backcourt, Orlando should be poised to capture one of the East's top seeds. In terms of starting cores in the conference for this season, it doesn't get much better than Suggs, Bane, Franz Wagner, and Paolo Banchero.\nPick: Over\nPhiladelphia 76ers: Over/Under 43.5 wins\nI was starting to feel optimistic about the 76ers again. Then, it was announced that Paul George had another knee surgery this offseason. Welp. This Philadelphia team is destined to tread water and hope (pray?) for better injury luck for the foreseeable future.\nPick: Under\nPhoenix Suns: Over/Under 32.5 wins\nHave we considered the sheer amount of hijinks that will ensue from a Jalen Green and Devin Booker backcourt? Because I haven't really stopped thinking about it. This is a baddddddd team, y'all.\nPick: Under\nPortland Trail Blazers: Over/Under 32.5 wins\nAfter adding Jrue Holiday as a starter, the Trail Blazers will be one of my favorite \"randomly ruin a contender's night\" teams for this season. That doesn't mean they're good, but they're on an upward trajectory. They're young, with promising prospects like Toumani Camara and Donovan Clingan. They can defend. And they've even got the potential surprise factor with rookie center Yang Hansen. Everyone playing Portland this year better have their brights on.\nPick: Over\nSacramento Kings: Over/Under 36.5 wins\nAs it stands, the Kings have one true big in their main rotation: starting center Domantas Sabonis. They otherwise have one of more perplexing gluts of guards/wings that I can remember between Malik Monk, Zach LaVine, DeMar DeRozan, Keegan Murray, Dennis Schröder, Keon Ellis, and Nique Clifford. What is this team doing? What is its plan? I'm not even sure the Kings know.\nPick: Under\nSan Antonio Spurs: Over/Under 43.5 wins\nThis kinda feels like a high bar for a Spurs team that still has to learn how to win. Don't get me wrong. A full season of Victor Wembanyama and De'Aaron Fox should do wonders for San Antonio. They are going to give the league a lot of fits. But the Spurs are still mired in a daunting West filled with teams who are much ready for relevance at this present moment. The Spurs' time will come, but it's not right now.\nPick: Under\nToronto Raptors: Over/Under 36.5 wins\nI almost talked myself into thinking the Raptors would also take advantage of the shoddy East. Scottie Barnes, Brandon Ingram, and R.J. Barrett are a fascinating core. But then I actually used my brain and realized how much work Toronto still has to do before it returns to prominence. The Raptors are stuck in Purgatory, and I'm not sure when they'll leave.\nPick: Under\nUtah Jazz: Over/Under 18.5 wins\nPop quiz: Who's Utah's best player outside of Lauri Markkanen? Might it already be rookie Walter Clayton Jr.? (Pulls in wind through gritted teeth) That's rough. The Jazz don't want to win this season. When I review their depth chart, I believe they'll succeed in their mission.\nPick: Under\nWashington Wizards: Over/Under 21.5 wins\nMan, I know they're the Wizards. I know their history. But this is so disrespectful to what Washington is building. After drafting Tre Johnson, adding caretaker veterans like C.J. McCollum, and trading for Cam Whitmore, call me a believer in the Wizards' project. They will be a lot feistier than you think.\nPick: Over"
    },
    {
      "url": "https://sportsdata.usatoday.com/basketball/nba/teams/orlando-magic/19/",
      "text": "Even the NBA knows that the Eastern Conference is actually the \"Leastern\" Conference.\nOne writer proposed a trade for the Lakers that would bring back a 3-and-D guard from their last championship team.\nFrom Nikola Jokić to Bilal Coulibaly, here are the biggest NBA names to watch at this year's EuroBasket.\nAnthony, who was drafted by Orlando 15th overall in …\nDennis Schroeder, Franz Wagner combine for 35 as Germany downs Slovenia\n| | | | |\n|---|---|---|---|\n| | | | |\n| | | | |\n| | | | |\n| | | | |\n| | | | |\nGannett may earn revenue from sports betting operators for audience referrals to betting services. Sports betting operators have no influence over nor are any such revenues in any way dependent on or linked to the newsrooms or news coverage. Terms apply, see operator site for Terms and Conditions. If you or someone you know has a gambling problem, help is available. Call the National Council on Problem Gambling 24/7 at 1-800-GAMBLER (NJ, OH), 1-800-522-4700 (CO), 1-800-BETS-OFF (IA), 1-800-9-WITH-IT (IN). Must be 21 or older to gamble. Sports betting and gambling are not legal in all locations. Be sure to comply with laws applicable where you reside.\nGambling involves risk. Please only gamble with funds that you can comfortably afford to lose. While we do our upmost to offer good advice and information we cannot be held responsible for any loss that maybe be incurred as a result of gambling. We do our best to make sure all the information that we provide on this site is correct. However from time to time mistakes will be made and we will not be held liable. Please check any stats or information if you are unsure how accurate they are. No guarantees are made with regards to results or financial gain. All forms of betting carry financial risk and it is down to the individual to make bets with or without the assistance of information provided on this site and we cannot be held responsible for any loss that maybe be incurred as a result of following the betting tips provided on this site. Past performances do not guarantee success in the future and betting odds fluctuate from one minute to the next. The material contained on this site is intended to inform, entertain and educate the reader and in no way represents an inducement to gamble legally or illegally. Betting is illegal in some countries, or areas of countries. It is the sole responsibility of the user to act in accordance with their local laws."
    },
    {
      "url": "https://www.usatoday.com/story/sports/nba/2025/08/11/eurobasket-nba-player-rankings-2025/85602415007/",
      "text": "Ranking 20 best NBA players at EuroBasket 2025, including a definitive top tier\nUnfortunately, we remain months away from the start of the 2025-2026 NBA season.\nIt'll still be a good while before we see some of the most exciting hoopers on the planet put on a show on a nightly basis. To be quite honest, that reality makes me sad. Aside from the schedule-makers and those who decide the healthy balance of an NBA season, how DARE anyone do this to us?\nNBA SEASON PREVIEW: Over/under pick for all 30 teams' win totals this season.\nFortunately, for those who find themselves quite invested in the NBA and men's international basketball in general, we have something fantastic to tide us over.\nIn a few weeks, the quadrennial EuroBasket tournament will tip off across host countries Poland, Cyprus, Finland, and Latvia. For those across the pond, it'll be a worthwhile treat seeing who shapes us as the eventual European champion. For those of us oriented more Westward, it'll be our first taste of meaningful men's basketball as the global game infuses itself with more and more European talent, among other continents, by the year.\nIn the interest of setting the table for what should be a thrilling tournament from start to finish, here's an ironclad (read: totally correct) ranking of the 20 best players at EuroBasket 2025.\nPlease note that, even with the difference in rules from the NBA to anything FIBA, these evaluations are mainly based on the quality of basketball players that we see under the NBA's umbrella, where all of these players spend most of their playing time.\n20. PF/C Sandro Mamukelashvili, Georgia (Toronto Raptors)\nMamukelashvili is still a lesser-heralded NBA player, which might make his inclusion in these rankings a bit puzzling. But make no mistake: he's got some notable court-tilting talent. Mamukelashvili moves well in space and is more than capable of attacking mismatches and making himself consistently available to his initiators. For a Georgia team that needs all the juice it can get, Mamukelashvili is vital to the nation's chances of making any noteworthy noise.\n19. F/G Bilal Coulibaly, France (Washington Wizards)\nA strong two-way wing, Coulibaly has acquitted himself rather nicely through his first two seasons in the NBA. He's a plus, playmaking defender who knows how to cut and move well without the ball in his hands on offense. Ahead of another hopeful season of growth in Washington, Coulibaly should be an integral all-around piece for a French team that finished with a silver medal in the 2024 Summer Olympics.\n18. F Zaccharie Risacher, France (Atlanta Hawks)\nAs the somewhat unheralded No. 1 overall pick of the 2024 NBA Draft, Risacher had the opportunity to develop while flying under the radar as a rookie. This allowed the small forward to post solid shooting splits while working within the confines of an offense built around Trae Young's playmaking. He'll be one of France's more important perimeter shooters in Europe before taking on a similar role for an underrated Hawks squad.\n17. C Tristan Vukčević, Serbia (Washington Wizards)\nSerbia has quietly built one of the world's strongest men's basketball programs. Vukčević is another prime example of this success. The smooth shooting stretch five has already proven himself as a viable offensive role player in the league with the Wizards, and he's still got room to grow. For the time being, he should be a vital contributor in a loaded and skilled frontcourt for the Serbians.\n16. G/F Jeremy Sochan, Poland (San Antonio Spurs)\nIn the NBA, Sochan has the enviable position of getting to play with the generational Victor Wembanyama as one of his many Spurs sidekicks. It allows the young wing to act as a do-it-all Swiss Army Knife. It's a different story at EuroBasket on a Polish team lacking distinctive (or talented) difference makers outside of a fourth-year role player like Sochan. Nonetheless, he belongs in this spot on this list.\nREAD MORE SOCHAN: He says he has \"something to prove\" next season.\n15. G Dennis Schröder, Germany (Sacramento Kings)\nSchröder is what I would call the rare \"tournament riser.\" In the NBA, with NBA rules, he's a decent if somewhat middling two-way point guard who has questionable descriptions about playing in today's league. When playing in international tournaments for Germany, with FIBA rules, he's usually one of the best overall players. For a German team with a real chance at the European championship, Schröder has to be firing on all cylinders. And he probably will be.\n14. C Nikola Vučević, Montenegro (Chicago Bulls)\nA former two-time All-Star, Vučević's game has languished, to an extent, as he's gotten older on the Bulls. Even still, he remains a highly effective offensive hub who is more than capable of lighting it up from behind the arc and having his way in the post. He'll be Montenegro's key piece in any possible extended run in Europe.\n13. F Guerschon Yabusele, France (New York Knicks)\nAfter a half-decade absence from the NBA, Yabusele thrived as a depth piece for the Philadelphia 76ers last year. This, after breaking out during the 2024 Olympics. The power forward has a classic bully-ball game with a soft shooting touch and an excellent feel for creating space and opportunities for himself. He'll be one of France's leading characters on a squad with legitimate aspirations at the podium.\n12. C Goga Bitadze, Georgia (Orlando Magic)\nEven in a smaller role for the Magic, Bitadze is quietly one of the most impactful defenders in the NBA. He's a bona fide weapon as a defensive anchor because he protects the rim with the best of them. It wouldn't be that hard to see Bitadze as a veritable Defensive Player of the Year candidate if he played more than a career average of 14.4 minutes per game. I'm serious. For now, he'll have to settle on blocking tons of shots for Georgia.\n11. C Jonas Valančiūnas, Lithuania (Denver Nuggets)\nValančiūnas has carved out a lengthy NBA career by doing one thing well: putting the ball in the basket. In 13 NBA seasons, Valančiūnas has averaged a solid 13.1 points per game despite seldom playing more than roughly 20 minutes. He's big, strong, experienced, and savvy. It's no wonder the Nuggets were so intent on keeping him as their backup center. Lithuania can feel safe running its offense through his old-school back-to-the-basket game.\n10. F Santi Aldama, Spain (Memphis Grizzlies)\nAs a perimeter-oriented offensive big man, the Grizzlies rewarded Aldama with over $50 million simply and mainly because he can shoot the cover off the ball. Entering his fifth NBA season, Aldama has ascended to a status as one of the finer role-playing shooting bigs. He's now one of the faces of the next generation of Spanish basketball that wants to return to international prominence.\n9. G Bogdan Bogdanović, Serbia (L.A. Clippers)\nA lights-out shooter for most of his professional career, Bogdanović has settled in nicely as a depth piece for a tough Clippers squad. Whenever he appears for Serbia, Bogdanović usually has much more responsibility, acting as one of the primary offensive initiators for the nation alongside Nikola Jokić. He should be a prime contributor once again for a Serbian team eyeing the gold medal.\n8. C Kristaps Porziņģis, Latvia (Atlanta Hawks)\nHealth issues have marred Porziņģis's recent career prospects, who otherwise has one of the better all-around skill sets for a big in today's NBA. Provided he can stay healthy, Porziņģis is not only a seamless fit next to Trae Young in Atlanta but the perfect person to man the middle for Latvia at EuroBasket.\n7. F Lauri Markkanen, Finland (Utah Jazz)\nMarkkanen is a fleet-footed power forward who can create his own shot, reliably shoot from deep, move well off-ball, and act as a physical offensive presence near the rim. His star has only lost its luster of late because he's been mired on a Utah squad that is usually actively tanking by March, if not earlier. But make no mistake. He's clearly one of the best players at this year's EuroBasket.\n6. F Deni Avdija, Israel (Portland Trail Blazers)\nWith five years of NBA experience under his belt, Avdija has gotten better and better every year. His true breakout might have been last season in Portland, where he shined as a two-way scoring wing who took off after the All-Star break. At this point, at the age of 24, Avdija is on a trajectory toward being a consistent difference-maker, not just a role player.\n5. C/F Alperen Şengün, Turkey (Houston Rockets)\nA first-time All-Star last season, Şengün is one of the reasons many people are high on the Rockets' NBA title chances this year. He has blossomed as a scoring big man who is an exceptional playmaker for his teammates, and if nothing else, he has shown he can be a physical defender when asked to exert more effort on that end of the court. At the age of 23, it's likely safe to say that Şengün's star has only really started to spark.\n4. F Franz Wagner, Germany (Orlando Magic)\nWagner feels like one of those guys who is right there on the brink of superstardom. When I say that, I mean that I think Wagner can be a genuine top-10 player in the NBA. At the very least, thanks to his efficiency and supreme skill, he should eventually become a perennial All-NBA guy. He is, indeed, that good. If Wagner adds a more reliable 3-point shot to his repertoire, then the sky's the limit for him in Orlando. It's easy to see why Germany is high on its EuroBasket chances with Wagner leading the charge.\n3. G/F Luka Dončić, Slovenia (Los Angeles Lakers)\nThis is where the true cutoff for this list begins. There is a clear chasm between the top three players, starting with Dončić at No. 3 overall, and everyone else mentioned here. I want that distinction to be pronounced because it is. As for Dončić, what else can you say about a sublime passer who always (ALWAYS) plays at his own pace? He's one of the four best players in the sport on the men's side of the proceedings. He's a generational talent capable of taking any game over on a whim. His brilliance alone makes Slovenia a must-watch in Europe.\nL.A. LUKA: Dončić can shine with Lakers, if he stays patient.\n2. F Giannis Antetokounmpo, Greece (Milwaukee Bucks)\nDon't let the Bucks' recent disappointing postseasons fool you: Antetokounmpo remains at the peak of his powers. He is still every bit the talisman who captured two MVPs, a Defensive Player of the Year, and an NBA Finals MVP within three seasons from 2019 to 2021. He is arguably the best transition talent in basketball, is a dynamite rim protector, and he gets to the basket at will like a bat out of hell. It's a breathtaking mix to witness. Very few are as capable of putting their team on their back like Antetokounmpo.\n1. C Nikola Jokić, Serbia (Denver Nuggets)\nEven though he didn't win his fourth MVP in five seasons last year, it's tough to argue against Jokić as the best player in Europe. In all honesty, the horse racing-obsessed center is clearly still the best player in the world at the helm of a bona fide championship-caliber Denver team. Full stop. How else do you explain the man basically averaging a 30-point triple-double with 62-41-80 shooting splits? That is absurd for anyone, let alone a seven-footer who seldom jumps more than several inches off the ground (quite literally). Jokić is so remarkable and so polished at this prime stage in his career that it boggles the mind. It is no wonder many consider Serbia to be the EuroBasket favorite when it has someone like Jokić on its side."
    },
    {
      "url": "https://sportsdata.usatoday.com/basketball/nba/teams/new-york-knicks/18/",
      "text": "“Adding Kevin Durant in place of Jalen Green to a young, successful, and elite defensive team was the perfect fit for the 15-time All-Star.”\nEven the NBA knows that the Eastern Conference is actually the \"Leastern\" Conference.\nEven the NBA knows that the Eastern Conference is actually the \"Leastern\" Conference.\nMichael Scotto: Just In: The New York Knicks plan to …\n| | | | |\n|---|---|---|---|\n| | | | |\n| | | | |\n| | | | |\n| | | | |\n| | | | |\nGannett may earn revenue from sports betting operators for audience referrals to betting services. Sports betting operators have no influence over nor are any such revenues in any way dependent on or linked to the newsrooms or news coverage. Terms apply, see operator site for Terms and Conditions. If you or someone you know has a gambling problem, help is available. Call the National Council on Problem Gambling 24/7 at 1-800-GAMBLER (NJ, OH), 1-800-522-4700 (CO), 1-800-BETS-OFF (IA), 1-800-9-WITH-IT (IN). Must be 21 or older to gamble. Sports betting and gambling are not legal in all locations. Be sure to comply with laws applicable where you reside.\nGambling involves risk. Please only gamble with funds that you can comfortably afford to lose. While we do our upmost to offer good advice and information we cannot be held responsible for any loss that maybe be incurred as a result of gambling. We do our best to make sure all the information that we provide on this site is correct. However from time to time mistakes will be made and we will not be held liable. Please check any stats or information if you are unsure how accurate they are. No guarantees are made with regards to results or financial gain. All forms of betting carry financial risk and it is down to the individual to make bets with or without the assistance of information provided on this site and we cannot be held responsible for any loss that maybe be incurred as a result of following the betting tips provided on this site. Past performances do not guarantee success in the future and betting odds fluctuate from one minute to the next. The material contained on this site is intended to inform, entertain and educate the reader and in no way represents an inducement to gamble legally or illegally. Betting is illegal in some countries, or areas of countries. It is the sole responsibility of the user to act in accordance with their local laws."
    },
    {
      "url": "https://www.usatoday.com/story/sports/nba/2025/08/10/kevin-durant-thunder-banner-night-trolls-rockets-reaction/85601863007/",
      "text": "Kevin Durant isn’t letting trolls bother him ahead of Thunder banner night\nIn many ways, we're still feeling the effects of Kevin Durant's decision to jump ship from the Oklahoma City Thunder to join the juggernaut Golden State Warriors during the summer of 2016.\nFor one, the NBA's restrictive second-apron rules were created in large part to try to prevent an established great team like the Warriors from ever simply adding a superstar like Durant ever again. For the other, it took the Thunder over half a decade to recover in earnest from losing arguably the best player they've ever had. And after winning the 2025 NBA title — the first in franchise history — you could say their project went very well.\nThat's what makes the Thunder's NBA opening night matchup against Durant's Houston Rockets so juicy. Even though he has two championships with the late 2010s Warriors, the prolific scorer is going to be in attendance for the banner night of the franchise that some people in hoops circles think he left \"high and dry\" for the \"easy way out.\"\nEver the #online maniac on X that he is, Durant couldn't help but talk trash to NBA fans who tried to troll him by reminding him he'll be present for the first-ever Thunder banner night ... as a member of the opposing team.\nPredictably, as a two-time NBA champion with a laundry list of impressive accomplishments, Durant was having none of it:\nWhen another fan tried to call Durant out for joking that it took too long for the Thunder to win a title after he left, his response was apt. It was just some light [expletive] talking. Nothing more.\nDurant has every right to feel this way. He's got his NBA championships. He's got his Olympic gold medals. He will finish as one of the NBA's all-time leading scorers. And he has generational wealth (and then some). He's an iconic, all-time player who has been there and done that. At this point, little snipes here and there about what he should and shouldn't be upset about will, understandably, never faze him.\nTo be clear, the NBA almost certainly placed Durant and the ascending Rockets against the Thunder on opening night for a reason. It's a juicy matchup. It's a matchup between, in my estimation, two of the three biggest threats for the 2025-2026 NBA title. That Durant has to face down the first-ever reigning champion Thunder team probably played a part, too. But that doesn't mean games like this have any extra meaning for Durant anymore.\nHe buried his Thunder demons as a member of the Warriors a long time ago."
    },
    {
      "url": "https://sportsdata.usatoday.com/football/nfl/scores",
      "text": "Gannett may earn revenue from sports betting operators for audience referrals to betting services. Sports betting operators have no influence over nor are any such revenues in any way dependent on or linked to the newsrooms or news coverage. Terms apply, see operator site for Terms and Conditions. If you or someone you know has a gambling problem, help is available. Call the National Council on Problem Gambling 24/7 at 1-800-GAMBLER (NJ, OH), 1-800-522-4700 (CO), 1-800-BETS-OFF (IA), 1-800-9-WITH-IT (IN). Must be 21 or older to gamble. Sports betting and gambling are not legal in all locations. Be sure to comply with laws applicable where you reside.\nGambling involves risk. Please only gamble with funds that you can comfortably afford to lose. While we do our upmost to offer good advice and information we cannot be held responsible for any loss that maybe be incurred as a result of gambling. We do our best to make sure all the information that we provide on this site is correct. However from time to time mistakes will be made and we will not be held liable. Please check any stats or information if you are unsure how accurate they are. No guarantees are made with regards to results or financial gain. All forms of betting carry financial risk and it is down to the individual to make bets with or without the assistance of information provided on this site and we cannot be held responsible for any loss that maybe be incurred as a result of following the betting tips provided on this site. Past performances do not guarantee success in the future and betting odds fluctuate from one minute to the next. The material contained on this site is intended to inform, entertain and educate the reader and in no way represents an inducement to gamble legally or illegally. Betting is illegal in some countries, or areas of countries. It is the sole responsibility of the user to act in accordance with their local laws."
    },
    {
      "url": "https://www.usatoday.com/story/sports/wnba/2025/08/09/caitlin-clark-playfully-booed-stephanie-white-random-fever-timeout/85595855007/",
      "text": "Caitlin Clark playfully booed Stephanie White over random Fever timeout\nThe Indiana Fever shook off two devastating injuries from Thursday's Phoenix Mercury loss to rout the Chicago Sky at home on Saturday, 92-70.\nAfter losing guards Aari McDonald and Sydney Colson to season-ending injuries this week, the Fever defeated the Sky with only nine active players in front of the Gainbridge Arena crowd. Talk about a resilient bunch.\nThe win's funniest moment came when coach Stephanie White called a timeout with her team up 20 points with about three-and-a-half minutes to go in the game.\nAs the Fever were getting into rhythm on offense, White called a timeout, only for her own team to playfully jeer her decision. Forward Damiris Dantas was open for a potential 3-pointer before the timeout.\nInjured superstar guard Caitlin Clark even playfully booed White's decision. It wasn't a popular one!\nOf course, the Fever had this game in the bag at this point, so White's timeout must have just been a coaching decision in the moment. However, her Indiana team still had some fun with the unexpected stop in play.\nWhen is Caitlin Clark returning for the Fever?\nIt's unknown at this time. She is out indefinitely."
    },
    {
      "url": "https://www.usatoday.com/story/sports/nba/2025/08/08/nba-christmas-day-2025-schedule/85583781007/",
      "text": "NBA Christmas Day 2025 schedule: ESPN announces five big games\nThe NBA went big-name hunting for its Christmas Day schedule this season.\nDonovan Mitchell, Dairus Garland, Jalen Brunson, Karl-Anthony Towns, Victor Wembanyama, Shai Gilgeous-Alexander, Jalen Williams, Kevin Durant, Alperen Sengun, LeBron James, Luka Doncic, Anthony Davis, Cooper Flagg, Steph Curry, Jimmy Butler, Anthony Edwards, Julius Randle, Nikola Jokic and Jamal Murray some of the big names projected to play on the NBA’s five-game Christmas Day schedule on Thursday, Dec. 25, according to ESPN, which will televise the games along with ABC.\nHere is the schedule that ESPN revealed on Friday, August 8:\n- Cleveland Cavaliers at New York Knicks\n- San Antonio Spurs at Oklahoma City Thunder\n- Houston Rockets at Los Angeles Lakers\n- Dallas Mavericks at Golden State Warriors\n- Minnesota Timberwolves at Denver Nuggets\nThe Knicks, Timberwolves, Mavericks, Spurs, Lakers, Warriors and Nuggets also played on Christmas in 2024.\nThe NBA again will compete against the NFL’s three-game Christmas schedule: Dallas Cowboys at Washington Redskins, Detroit Lions at Minnesota Vikings and Denver Broncos at Kansas City Chiefs.\nHere’s a closer look at the NBA’s five Christmas Day games:\nNBA Christmas Day schedule 2025\nCleveland Cavaliers at New York Knicks\nThis is Cleveland’s first Christmas game since 2017, and this is the Knicks’ 58th Christmas game.\nSan Antonio Spurs at Oklahoma City Thunder\nThe defending champion Thunder and Wembanyama should expect to be part of the Christmas schedule for the next several seasons.\nHouston Rockets at Los Angeles Lakers\nJames, the all-time leading scorer on Dec. 25, is headed for his 20th Christmas game, a league record.\nDallas Mavericks at Golden State Warriors\nGolden State will play on Christmas for the 13th consecutive season.\nMinnesota Timberwolves at Denver Nuggets\nTimberwolves star Anthony Edwards had 26 points, eight rebounds and five assists in this NBA Christmas debut in 2024."
    },
    {
      "url": "https://www.fiba.basketball/en/ranking/men?gad_source=1&gad_campaignid=21668710559&gbraid=0AAAAA9uTMqD03Q5kvjDdanYOQxRED3GiP&gclid=Cj0KCQjwqebEBhD9ARIsAFZMbfzObGWYUd5oCpffUNqUNkAd0gKFnUF3VwRxt1rTF5mwbccCOcQg2QwaAuGjEALw_wcB",
      "text": "FIBA World Ranking Presented by NIKE - Men\nCheck the latest FIBA World Ranking updates presented by NIKE. Browse past ranking using the date selection.\n# | country | zone rank | PTS | +/- |\n|---|---|---|---|---|\n1. | 1. | 840.1 | 0 | |\n2. | 1. | 761.4 | 0 | |\n3. | 2. | 757.3 | 0 | |\n4. | 3. | 753.4 | 0 | |\n5. | 4. | 745.7 | 0 | |\n6. | 2. | 744.9 | 0 | |\n7. | 1. | 733.1 | 0 | |\n8. | 3. | 732.5 | 0 | |\n9. | 5. | 716.1 | 0 | |\n10. | 6. | 702.8 | 0 | |\n11. | 7. | 673.8 | 0 | |\n12. | 4. | 672.9 | 0 | |\n13. | 8. | 659.3 | 0 | |\n14. | 9. | 638.6 | 0 | |\n15. | 5. | 606.9 | 0 | |\n16. | 10. | 596.6 | 0 | |\n17. | 11. | 582 | 0 | |\n18. | 6. | 551 | 0 | |\n19. | 12. | 545.9 | 0 | |\n20. | 13. | 537.4 | 0 | |\n21. | 2. | 528.5 | 0 | |\n22. | 3. | 491.4 | 0 | |\n23. | 1. | 486.9 | 0 | |\n24. | 14. | 460.9 | 0 | |\n25. | 7. | 459.6 | 0 | |\n26. | 8. | 437.8 | 0 | |\n27. | 15. | 427.5 | 0 | |\n28. | 4. | 414.1 | 0 | |\n29. | 5. | 408.9 | 0 | |\n30. | 6. | 397.4 | 0 | |\n31. | 2. | 389.8 | 0 | |\n32. | 16. | 387.7 | 0 | |\n33. | 3. | 379.1 | 0 | |\n34. | 7. | 376.6 | 0 | |\n35. | 8. | 372.1 | 0 | |\n36. | 4. | 336.3 | 0 | |\n37. | 17. | 327.3 | +1 | |\n38. | 5. | 326.3 | -1 | |\n39. | 18. | 322.2 | 0 | |\n40. | 19. | 320.3 | 0 | |\n41. | 20. | 312.2 | 0 | |\n42. | 6. | 297.8 | 0 | |\n43. | 21. | 279.6 | 0 | |\n44. | 22. | 278.7 | 0 | |\n45. | 7. | 272.9 | 0 | |\n46. | 23. | 265.3 | 0 | |\n47. | 8. | 252.7 | 0 | |\n48. | 24. | 249.2 | 0 | |\n49. | 25. | 249.2 | 0 | |\n50. | 26. | 244.3 | 0 | |\n51. | 9. | 242.4 | 0 | |\n52. | 10. | 238.4 | 0 | |\n53. | 9. | 235.6 | 0 | |\n54. | 27. | 231.4 | 0 | |\n55. | 11. | 207.1 | 0 | |\n56. | 28. | 205.6 | 0 | |\n57. | 12. | 197.8 | 0 | |\n58. | 29. | 195.9 | 0 | |\n59. | 30. | 194.4 | 0 | |\n60. | 31. | 188.2 | 0 | |\n61. | 13. | 185.2 | 0 | |\n62. | 32. | 182 | 0 | |\n63. | 33. | 175.4 | +1 | |\n64. | 9. | 174.5 | -1 | |\n65. | 10. | 164.1 | 0 | |\n66. | 11. | 158.7 | 0 | |\n67. | 34. | 153.7 | 0 | |\n68. | 14. | 150.5 | 0 | |\n69. | 15. | 147.1 | 0 | |\n70. | 12. | 143.4 | 0 | |\n71. | 13. | 139.5 | 0 | |\n72. | 10. | 136.9 | 0 | |\n73. | 14. | 136.1 | +2 | |\n74. | 16. | 131.8 | 0 | |\n75. | 11. | 128.6 | -2 | |\n76. | 15. | 127.3 | +5 | |\n77. | 35. | 126.5 | -1 | |\n78. | 36. | 124.7 | -1 | |\n79. | 16. | 124.2 | -1 | |\n80. | 17. | 124 | -1 | |\n81. | 37. | 121.6 | +1 | |\n82. | 18. | 121.1 | +2 | |\n83. | 12. | 120 | -3 | |\n84. | 38. | 118.5 | +1 | |\n85. | 13. | 118.3 | -2 | |\n86. | 39. | 114.2 | 0 | |\n87. | 17. | 111.5 | 0 | |\n88. | 18. | 111.4 | +3 | |\n89. | 14. | 110.9 | -1 | |\n90. | 19. | 109.9 | -1 | |\n91. | 40. | 107.7 | +1 | |\n92. | 20. | 107.6 | +1 | |\n93. | 15. | 106.1 | -3 | |\n94. | 16. | 99.9 | 0 | |\n95. | 41. | 95.2 | 0 | |\n96. | 42. | 94.4 | 0 | |\n97. | 17. | 92.6 | 0 | |\n98. | 21. | 92.6 | 0 | |\n99. | 43. | 89.5 | +1 | |\n100. | 18. | 88.6 | -1 | |\n101. | 22. | 86.2 | +1 | |\n102. | 19. | 84.8 | +1 | |\n103. | 23. | 83.4 | +1 | |\n104. | 20. | 82.7 | +1 | |\n105. | 19. | 80.6 | +1 | |\n106. | 21. | 78.9 | +1 | |\n107. | 22. | 77.1 | +2 | |\n108. | 24. | 76.5 | +3 | |\n109. | 23. | 76 | +3 | |\n110. | 44. | 75.9 | +3 | |\n111. | 25. | 74.9 | +3 | |\n112. | 26. | 74.4 | +3 | |\n113. | 45. | 74.1 | +3 | |\n114. | 20. | 73.9 | +9 | |\n115. | 21. | 73.2 | -7 | |\n116. | 24. | 72.3 | +1 | |\n117. | 22. | 71.4 | -7 | |\n118. | 25. | 71.1 | 0 | |\n119. | 26. | 70.2 | 0 | |\n120. | 27. | 70.1 | 0 | |\n121. | 23. | 69.5 | +12 | |\n122. | 28. | 68.2 | -1 | |\n123. | 29. | 68 | -1 | |\n124. | 46. | 66 | +1 | |\n125. | 27. | 64.4 | +1 | |\n126. | 30. | 64.3 | +1 | |\n127. | 24. | 64.2 | -3 | |\n128. | 31. | 61.5 | 0 | |\n129. | 28. | 60.8 | 0 | |\n130. | 32. | 60.2 | 0 | |\n131. | 25. | 58.5 | +1 | |\n132. | 29. | 56.5 | +2 | |\n133. | 33. | 56.5 | +2 | |\n134. | 30. | 55.9 | +2 | |\n135. | 31. | 55.9 | +2 | |\n136. | 26. | 55.8 | +9 | |\n137. | 32. | 53.4 | +1 | |\n138. | 27. | 52.9 | +1 | |\n139. | 33. | 52.2 | +2 | |\n140. | 34. | 51.4 | +2 | |\n141. | 28. | 49.8 | +2 | |\n142. | 35. | 49.1 | +2 | |\n143. | 29. | 48.4 | +5 | |\n144. | 36. | 46.4 | +2 | |\n145. | 37. | 45.8 | +2 | |\n146. | 30. | 43.9 | +3 | |\n147. | 38. | 43.1 | +3 | |\n148. | 39. | 42.9 | +3 | |\n149. | 34. | 36.8 | +3 | |\n150. | 40. | 34.9 | +3 | |\n151. | 47. | 34.1 | +3 | |\n152. | 41. | 33.7 | +3 | |\n153. | 42. | 33.5 | +3 | |\n154. | 43. | 32.8 | +3 | |\n155. | 31. | 27.1 | +3 | |\n156. | 44. | 25.6 | +3 | |\n157. | 35. | 20 | +3 |"
    },
    {
      "url": "https://sportsdata.usatoday.com/basketball/nba/teams/houston-rockets/10/",
      "text": "“Adding Kevin Durant in place of Jalen Green to a young, successful, and elite defensive team was the perfect fit for the 15-time All-Star.”\nEven the NBA knows that the Eastern Conference is actually the \"Leastern\" Conference.\nEven the NBA knows that the Eastern Conference is actually the \"Leastern\" Conference.\n“This is contract sorcery,” CBS Sports’ Sam Quinn says in his evaluation of Houston’s recent transactions.\n| | | | |\n|---|---|---|---|\n| | | | |\n| | | | |\n| | | | |\n| | | | |\n| | | | |\nGannett may earn revenue from sports betting operators for audience referrals to betting services. Sports betting operators have no influence over nor are any such revenues in any way dependent on or linked to the newsrooms or news coverage. Terms apply, see operator site for Terms and Conditions. If you or someone you know has a gambling problem, help is available. Call the National Council on Problem Gambling 24/7 at 1-800-GAMBLER (NJ, OH), 1-800-522-4700 (CO), 1-800-BETS-OFF (IA), 1-800-9-WITH-IT (IN). Must be 21 or older to gamble. Sports betting and gambling are not legal in all locations. Be sure to comply with laws applicable where you reside.\nGambling involves risk. Please only gamble with funds that you can comfortably afford to lose. While we do our upmost to offer good advice and information we cannot be held responsible for any loss that maybe be incurred as a result of gambling. We do our best to make sure all the information that we provide on this site is correct. However from time to time mistakes will be made and we will not be held liable. Please check any stats or information if you are unsure how accurate they are. No guarantees are made with regards to results or financial gain. All forms of betting carry financial risk and it is down to the individual to make bets with or without the assistance of information provided on this site and we cannot be held responsible for any loss that maybe be incurred as a result of following the betting tips provided on this site. Past performances do not guarantee success in the future and betting odds fluctuate from one minute to the next. The material contained on this site is intended to inform, entertain and educate the reader and in no way represents an inducement to gamble legally or illegally. Betting is illegal in some countries, or areas of countries. It is the sole responsibility of the user to act in accordance with their local laws."
    },
    {
      "url": "https://www.usatoday.com/story/sports/nba/2025/08/04/luka-doncic-lakers-extension-trust-free-agency-2027/85512766007/",
      "text": "The Lakers have set Luka Dončić up to succeed as long as he’s willing to wait\nNo one ever turns down an opportunity to be the face of the Los Angeles Lakers. Anyone who has ever been handed the keys to one of the most prestigious sports teams in the world takes them without hesitation.\nLuka Dončić is no different.\nYou may have already heard the weekend's news. On Saturday, Dončić, who is a top-four player in the world on his worst day, agreed to a three-year, $165 million contract extension that should keep him in Lakers purple and gold until at least the summer of 2028. Contrary to some reports (and misunderstandings), Dončić did not take a discount by \"only\" getting $55 million in average annual value. Following his trade from the team that drafted him, the Dallas Mavericks, this was the maximum yearly salary Dončić was eligible for. Taking that amount of money wasn't a favor to the Lakers.\nHowever, Dončić's choosing to sign an extension now was, in fact, a gesture of good faith. It is him relinquishing his options and all the leverage he could've had by delaying the contract decision for another year. It is the All-NBA caliber forward's tacit acknowledgement that he'd like to see through his time with the Lakers, however long it will be, while giving them momentary peace of mind. As conversations about LeBron James' basketball future swirl, Dončić taking pen to paper now is his saying he genuinely believes the Lakers can construct a championship team around his talent.\nDončić has every right to believe this. Recent foibles aside, the Lakers' historical precedent with superstars and contenders is unmatched. No one else in the NBA builds juggernauts overnight quite like the Lakers. No one else stacks and collects stars quite like the league's marquee franchise. That they got Dončić for pennies on the dollar in the first place is prime evidence of this phenomenon.\nTo the chagrin of everyone outside of their bubble, this is what the Lakers do.\nThe catch for Dončić is that he'll have to bide his time, smack dab in the middle of his prime, before the Lakers can find him a viable running mate.\nAs it stands, James' contract is still eating up a sizable portion of the Lakers' salary cap sheet. That is, of course, money that will eventually be allocated toward an attempt at signing someone like, say, Giannis Antetokounmpo. Barring a shocking trade of James, it seems pretty likely that his deal will be a financial anchor of sorts on Los Angeles until next summer. The issue for the Lakers is that while they'd probably prefer to get active in signing someone to pair with Dončić right then and there, most franchise players who are worth the money won't become unrestricted free agents until 2027 at the earliest.\nSo, at best, Dončić is spending two years of his career on a Lakers team that is slowly, gradually preparing a red carpet for his sidekick. He'll be 28 by the time the Lakers are ready to put a bona fide heavyweight supporting cast around him. To put it lightly, even if Dončić is seemingly starting to take better care of himself, this sort of basketball Purgatory is not ideal.\nI have sincere doubts that Dončić would ever seriously consider leaving the Lakers. They usually do what they want and get who they want, after all. He knows that. But don't discount how this semi-transition roster of players will present itself over the next two seasons. These Lakers might not be veritable Tier 1 title contenders, but they can't afford to tread water with someone like Dončić, either.\nHow they fare competitively may determine just how patient Dončić is willing to be with the Lakers' plans for him.\nPlease put the Giannis speculation to rest (for now)\nLook, I'm not going to pretend that Giannis Antetokounmpo is an absolute lock to be a Milwaukee Buck for life. There's a reason I mention him as a potential 2027 target for the Lakers. Two years is a long time, and the Bucks are far from stable even after an eventful and productive offseason. But for now, no one in Antetokounmpo's inner circle, no one in the Bucks organization, and not even Antetokounmpo has hinted that he still potentially wants to leave Milwaukee before this coming NBA season.\nIn fact, the only reputable person still fanning the flames is ESPN's Shams Charania. On Monday, the reporter claimed that Antetokounmpo remains undecided about where he wants to play. Not in the long term, which is a lot safer to describe as up in the air. In the short term, with Antetokounmpo already clearly giving the Bucks a longer rope to figure things out.\nSo, until I hear someone else closer to the situation verify these Antetokounmpo trade \"rumors,\" I'm taking them with a grain of salt:\n\"After the conclusion of the draft and free agency, all 30 rosters around the league are more or less set in stone. Anyone who would ostensibly even have the space to trade for [Giannis] Antetokounmpo now probably has much less flexibility to do so without moving mountains around their salary cap sheet. Everything has been accounted for, and it would be a huge headache to dig things up again. We're also roughly two months out from the start of NBA training camps. That sort of short turnaround timeline doesn't lend itself to one of the best players in the world making a seismic change in his career at this specific point.\"\nHere's more on the latest (speculative) update concerning Antetokounmpo.\nShootaround\n- An NBA European league makes so much sense, but the logistics seem absurd. My pal Bryan Kalbrosky has the details.\n- The rich get richer. DiJonai Carrington is on her way to the powerhouse Lynx, and our Meg Hall has trade grades.\n- Cory Woodroof explained the hoopla over, ahem, NSFW \"items\" being thrown onto WNBA courts. Man, we gotta show more respect for the players and the game.\n- Also from Bryan, here's THE definitive ranking of all 30 NBA mascots. Does anyone surprise you?\nThis was Layup Lines, For the Win's basketball newsletter. Subscribe here to get it delivered to your inbox every Monday, Wednesday, and Friday."
    },
    {
      "url": "https://sportsdata.usatoday.com/basketball/nba/teams/boston-celtics/2/",
      "text": "The Boston Celtics recently signed Joe Mazzulla to a multi-year contract extension\nJoe Mazzulla will likely need to adjust the style of basketball the Boston Celtics play\nThe Boston Celtics are preparing for a retooling season\nBob Cousy recently shared his concerns about the upcoming season for the Boston Celtics\nEven the NBA knows that the Eastern Conference is actually the \"Leastern\" Conference.\n| | | | |\n|---|---|---|---|\n| | | | |\n| | | | |\n| | | | |\n| | | | |\n| | | | |\nGannett may earn revenue from sports betting operators for audience referrals to betting services. Sports betting operators have no influence over nor are any such revenues in any way dependent on or linked to the newsrooms or news coverage. Terms apply, see operator site for Terms and Conditions. If you or someone you know has a gambling problem, help is available. Call the National Council on Problem Gambling 24/7 at 1-800-GAMBLER (NJ, OH), 1-800-522-4700 (CO), 1-800-BETS-OFF (IA), 1-800-9-WITH-IT (IN). Must be 21 or older to gamble. Sports betting and gambling are not legal in all locations. Be sure to comply with laws applicable where you reside.\nGambling involves risk. Please only gamble with funds that you can comfortably afford to lose. While we do our upmost to offer good advice and information we cannot be held responsible for any loss that maybe be incurred as a result of gambling. We do our best to make sure all the information that we provide on this site is correct. However from time to time mistakes will be made and we will not be held liable. Please check any stats or information if you are unsure how accurate they are. No guarantees are made with regards to results or financial gain. All forms of betting carry financial risk and it is down to the individual to make bets with or without the assistance of information provided on this site and we cannot be held responsible for any loss that maybe be incurred as a result of following the betting tips provided on this site. Past performances do not guarantee success in the future and betting odds fluctuate from one minute to the next. The material contained on this site is intended to inform, entertain and educate the reader and in no way represents an inducement to gamble legally or illegally. Betting is illegal in some countries, or areas of countries. It is the sole responsibility of the user to act in accordance with their local laws."
    },
    {
      "url": "https://www.usatoday.com/story/sports/nba/2025/08/04/giannis-antetokounmpo-trade-rumors-bucks-shams-reaction/85511704007/",
      "text": "Bucks respond to latest Giannis trade rumors with a single emoji\nFor now, the Milwaukee Bucks are probably (and finally) out of the woods regarding Giannis Antetokounmpo's future.\nAfter stretching and waiving Damian Lillard's contract, then signing a big-time frontcourt partner in Myles Turner, the Bucks seem like they've done enough to appease Antetokounmpo. Factor in a temporarily weaker Eastern Conference on paper after injuries to Jayson Tatum and Tyrese Haliburton, and it gets easier to talk yourself into the kind of Bucks competence that keeps Antetokounmpo happy. Well, at least for the next two years before the superstar has a decision to make on a player option in the summer of 2027.\nBut we'll cross that bridge when we get to it.\nThat didn't stop ESPN's Shams Charania from continuing to stoke the Antetokounmpo fire in Milwaukee.\nIn a Monday morning appearance on First Take, Charania claimed that Antetokounmpo is still undecided about his future in Milwaukee. To be clear, that's not from a long-term perspective. That's from the perspective of whether Antetokounmpo will even want to be in Milwaukee this season. Hmm. While I can't say these rumors are false with absolute certainty, they don't pass the smell test.\nGiven where we are in the NBA offseason, it's hard to believe that Antetokounmpo is really still pondering the near future in Milwaukee.\nAfter the conclusion of the draft and free agency, all 30 rosters around the league are more or less set in stone. Anyone who would ostensibly even have the space to trade for Antetokounmpo now probably has much less flexibility to do so without moving mountains around their salary cap sheet. Everything has been accounted for, and it would be a huge headache to dig things up again. We're also roughly two months out from the start of NBA training camps. That sort of short turnaround timeline doesn't lend itself to one of the best players in the world making a seismic change in his career at this specific point.\nThis new rash of an Antetokounmpo rumor reeks of pot-stirring for engagement, but I can't prove it. Not without some help, anyway.\nThat's where the Bucks' social media team came in. They posted a single yawn emoji on their X account, which seems pretty clearly in response to the (manufactured) fervor about Antetokounmpo still wanting to leave the franchise right now:\nSuffice it to say, if the Bucks aren't publicly concerned about Antetokounmpo leaving like this, then no one else should bat an eyelash over contrary reports. It's all conjecture until someone from Antetokounmpo's camp or the Bucks' camp lends more credence to it.\nHas Shams Charania previously pushed seemingly unfounded Giannis Antetokounmpo trade rumors?\nYes, actually!\nWay back in early June, Charania claimed that the Antetokounmpo trade saga would extend well into the summer regardless of any extenuating factors. Later that day, Antetokounmpo posted how he missed former longtime NBA reporter Adrian Wojnarowski, which was an apparent shot at Charania's reporting. The Bucks responding like this to another Charania report is right in line with how their summer has gone with one of the best players they've ever rostered."
    },
    {
      "url": "https://sportsdata.usatoday.com/basketball/nba/teams/cleveland-cavaliers/5/",
      "text": "Even the NBA knows that the Eastern Conference is actually the \"Leastern\" Conference.\n“Adding Kevin Durant in place of Jalen Green to a young, successful, and elite defensive team was the perfect fit for the 15-time All-Star.”\nThe Detroit Pistons are reportedly signing veteran free agent forward Javonte Green to a one-year deal.\nEven the NBA knows that the Eastern Conference is actually the \"Leastern\" Conference.\nEven the NBA knows that the Eastern Conference is actually the \"Leastern\" Conference.\n| | | | |\n|---|---|---|---|\n| | | | |\n| | | | |\n| | | | |\n| | | | |\n| | | | |\nGannett may earn revenue from sports betting operators for audience referrals to betting services. Sports betting operators have no influence over nor are any such revenues in any way dependent on or linked to the newsrooms or news coverage. Terms apply, see operator site for Terms and Conditions. If you or someone you know has a gambling problem, help is available. Call the National Council on Problem Gambling 24/7 at 1-800-GAMBLER (NJ, OH), 1-800-522-4700 (CO), 1-800-BETS-OFF (IA), 1-800-9-WITH-IT (IN). Must be 21 or older to gamble. Sports betting and gambling are not legal in all locations. Be sure to comply with laws applicable where you reside.\nGambling involves risk. Please only gamble with funds that you can comfortably afford to lose. While we do our upmost to offer good advice and information we cannot be held responsible for any loss that maybe be incurred as a result of gambling. We do our best to make sure all the information that we provide on this site is correct. However from time to time mistakes will be made and we will not be held liable. Please check any stats or information if you are unsure how accurate they are. No guarantees are made with regards to results or financial gain. All forms of betting carry financial risk and it is down to the individual to make bets with or without the assistance of information provided on this site and we cannot be held responsible for any loss that maybe be incurred as a result of following the betting tips provided on this site. Past performances do not guarantee success in the future and betting odds fluctuate from one minute to the next. The material contained on this site is intended to inform, entertain and educate the reader and in no way represents an inducement to gamble legally or illegally. Betting is illegal in some countries, or areas of countries. It is the sole responsibility of the user to act in accordance with their local laws."
    },
    {
      "url": "https://www.usatoday.com/story/sports/nba/2025/08/11/tyrese-maxey-asked-instagram-help-can-opener-nba/85613192007/",
      "text": "Tyrese Maxey cleverly asked for Instagram's help to use a can opener\nPhiladelphia 76ers star guard Tyrese Maxey just utilized social media in perhaps the most practical way possible. He asked for help on using a very confusing kitchen tool.\nMaxey stared an Instagram Live session on Monday to ask his followers for help on how to use an old school can opener, one of the most nefarious and perplexing of all the kitchen tools. Seriously, those things stink and are very hard to use.\nRather than struggle in silence, Maxey made the particularly inspired move of asking for Instagram's help. Thankfully, he must have gotten the information he needed because he got his can of pumpkin open, seemingly to feed his dogs. Those poor pups might have an upset stomach if pumpkin is on the menu.\nSpeaking from experience as a person who has quite literally struggled to use an classic can opener to open a can of pumpkin for their dog and had to wait to ask their wife for help, I wish I'd come up with Maxey's clever strategy to get his instant answer.\nThe world still hasn't found a way to avoid these ridiculously archaic can openers, so good on Maxey for figuring out that social media really does have at least one good use... figuring out how to get a can open the old-fashioned way.\nMaxey is a hero to all of us who need to get that stupid can of pumpkin open as soon as possible.\nWhy do we still use those stupid can openers as a society?\nWe don't dream enough anymore. We stopped going to the moon. We stopped reaching for the stars."
    }
  ],
  "argos_summary": "The disparity between the NBA's Western and Eastern Conferences has been stark, with the West dominating in terms of talent and championships. The NBA's recent schedule announcement highlighted this gap, featuring only two Eastern teams in marquee matchups, suggesting a lack of competitive intrigue in the East. Meanwhile, the Denver Nuggets have emerged as strong title contenders after a successful offseason, bolstering their roster around star Nikola Jokić, while the Eastern Conference faces challenges with injuries to key players like Jayson Tatum and Tyrese Haliburton.",
  "argos_id": "RLFE3YKIU"
}