{
  "url": "https://www.polygon.com/one-piece-heroines-anime-announcement-fan-letter/",
  "authorsByline": "Isaac Rouse",
  "articleId": "ad21119116de4bb59019a420568c768b",
  "source": {
    "domain": "polygon.com",
    "paywall": false,
    "location": {
      "country": "be",
      "county": "Antwerp",
      "city": "Antwerp",
      "coordinates": {
        "lat": 51.2211097,
        "lon": 4.3997081
      }
    }
  },
  "imageUrl": "https://static1.polygonimages.com/wordpress/wp-content/uploads/2025/08/one-piece-heroines-thumbnail.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T16:43:22+00:00",
  "addDate": "2025-08-11T19:45:52.403731+00:00",
  "refreshDate": "2025-08-11T19:45:52.403733+00:00",
  "score": 1.0,
  "title": "One Piece is getting a new anime that's been a long time coming",
  "description": "One Piece Heroines is a short-form series that explores the pirate world through the perspectives of its most intriguing female characters.",
  "content": "During One Piece Day '25, a few original anime voice actors hit the stage to announce an anime adaptation of the novel One Piece Heroines by Jun Esaka and Sayaka Suwa. The novel is a collection of short stories featuring the women of the pirate world, including Nami and Nico Robin, who are featured in the upcoming show's new key visual.\n\nThe stories first appeared in One Piece Magazine in June 2021 before being compiled into two light novels in March 2024. The first focuses on Nami, Robin, Vivi, and Perona, while the second spotlights Hancock, Tashigi, Reiju, and Uta. The collection wraps up with a final chapter in which Nami and Robin discuss the crew’s hygiene—a topic that, according to original author Eiichiro Oda, ranges from bad to worse.\n\nThis isn’t the first One Piece spinoff, but it’s the first to be adapted into an anime, and it’s been a long time coming. If One Piece: Fan Letter proved anything, it’s that this universe has countless untold stories and perspectives worth exploring. While the main series is largely male-focused, highlighting its female characters could offer a fresh perspective for the storytelling. The world of One Piece boasts a wealth of compelling women, especially after the events of the recent Chapter 1156. One Piece Heroines will have its scripts penned by Momoka Toyoda, the acclaimed writer behind One Piece: Fan Letter, which earned widespread praise and even inspired a follow-up one-shot manga after readers were captivated by its touching tale of Nami through the eyes of a lonely young girl.\n\nHaruka Kamatani (One Piece in Love) will direct One Piece Heroines, and Takashi Kojima (Flip Flappers) will handle character designs. And although there's currently no release date or news about the format, fans should keep their eyes peeled for more announcements later.",
  "medium": "Article",
  "links": [
    "https://gamerant.com/oda-revealed-how-often-the-straw-hat-crew-bathes-and-its-kind-of-gross/",
    "https://www.polygon.com/23302190/one-piece-manga-anime-anniversary/",
    "https://www.polygon.com/23711069/one-piece-eiichiro-oda-netflix-release/",
    "https://www.polygon.com/netflix-one-piece-season-3-confirmed/"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "One Piece Heroines",
      "weight": 0.124858186
    },
    {
      "name": "One Piece",
      "weight": 0.12260679
    },
    {
      "name": "One Piece Magazine",
      "weight": 0.1177149
    },
    {
      "name": "One Piece Day",
      "weight": 0.11681053
    },
    {
      "name": "One Piece: Fan Letter",
      "weight": 0.07578246
    },
    {
      "name": "Nami",
      "weight": 0.07452546
    },
    {
      "name": "original author Eiichiro Oda",
      "weight": 0.072125286
    },
    {
      "name": "Nico Robin",
      "weight": 0.07211391
    },
    {
      "name": "the first One Piece spinoff",
      "weight": 0.07157615
    },
    {
      "name": "countless untold stories",
      "weight": 0.07096193
    }
  ],
  "topics": [
    {
      "name": "Gaming"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/TV & Video/TV Guides & Reference",
      "score": 0.65478515625
    },
    {
      "name": "/Arts & Entertainment/Comics & Animation/Anime & Manga",
      "score": 0.5029296875
    },
    {
      "name": "/Arts & Entertainment/TV & Video/TV Shows & Programs",
      "score": 0.414794921875
    }
  ],
  "sentiment": {
    "positive": 0.35741654,
    "negative": 0.14490378,
    "neutral": 0.49767968
  },
  "summary": "The announcement of an anime adaptation of the novel One Piece Heroines was made during One Piece Day '25. The short stories, featuring the women of the pirate world, are set to be compiled into two light novels in 2024. The adaptation will be directed by Haruka Kamatani and character designs by Takashi Kojima. This is not the first time One Piece has been adapted into an anime, but this could offer a fresh perspective for the storytelling.",
  "shortSummary": "A new anime adaptation of the novel One Piece Heroines, based on Jun Esaka and Sayaka Suwa, will air this summer, featuring Nami and Nico Robin, with production underway.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "f4cf5f0bf2ce4cf5b08631fe8f64f9f7",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.polygon.com/23302190/one-piece-manga-anime-anniversary/",
      "text": "When I finished reading One Piece, I felt a 1,000-chapter hole in my heart. Hungry for more, I decided to rewatch some of my favorite moments via the anime. I wanted to know what the Straw Hat crew looked like bursting through the great open seas fully animated. I wanted more of this world I had grown to love over the months I blazed through the manga.\nBut as I turned to the animation, I was disappointed.\nBoisterous, joyous scenes of the Straw Hat crew celebrating victories with buckets of booze and colorful characters seemed to fall flat. Perfectly paced frame-by-frame fights turned into drawn-out scenes that dragged across entire episodes. Luffy, the pirate protagonist of the series whose superpower is to stretch like rubber, came across as surprisingly stiff in the earlier episodes.\nThat’s not to say I’m here to absolutely roast the One Piece anime. It’s over 1,000 episodes long, and for any show to make it that far is a feat. Like any anime of that size, it has its high and low points — I won’t hold its early-2000s animation against it. It’s still a great story and I still got giddy during the big reveals. Rewatching arcs even helped me notice details I missed while reading.\nBut here’s what I told my little brother while watching: “This is fun. But you should just go read the manga.”\nAs of this year, One Piece presents a 25-year-long epic that follows Luffy, a pirate with the power to stretch like rubber, and the Straw Hats, his crew of pirates. Like many shonen protagonists, Luffy’s goal is very simple: He wants to become the Pirate King, and thus the most infamous pirate in the world. Creator Eiichiro Oda released the first chapter in 1997, and it has since become one of the most beloved manga franchises of all time. It’s also the best selling manga of all time, with several related spinoffs and adaptations — from the anime series to video games to movies. The series spirals into an ocean-spanning adventure that threads together themes of societal injustice, personal loss, and friendship, among others.\nAdditionally, the manga is extremely accessible. The entire 1,000-plus-chapter epic is available on the Shonen Jump app for $1.99 a month. Toss in a cheap tablet, and you have the perfect way to experience One Piece. For me personally, it was way easier to read downloaded chapters on the go — traveling, while waiting for appointments, and so on, than it would be to whip out a set of headphones and load up an episode. You can download up to 100 chapters at a time, which I would exceed only on the most lazy of days.\nBut beyond that, Oda brings the world of One Piece to life in a way that I don’t think is fully communicated in sections of the anime.\nOne Piece deals in excess. An excess of characters. An excess of action. An excess of stuff just happening, everywhere, all the time. But Oda is also a genius at managing his page; never giving the impression of too much or confusing the reader’s eye. And that makes the world feel all the fuller; no detail is lost between panels. You can see every scuff and scratch, every drop of sweat, as the characters bear the weight of their fights. The colorful cast, while portrayed in black and white, feels especially alive on the page when you can relish in examining them closely, taking in the character designs.\nOda’s depiction of movement in the manga doesn’t just push the story forward, it teaches the reader about the world and the characters there. We love Luffy not just because he’s dedicated to his crew and inspires those around him to question the status quo; we also love him because it’s funny to watch a rubber pirate fight off the government forces of the world. Luffy stretches, sweats, and steams, and the manga steeps in constant action.\nPerhaps the biggest reason I’d tell folks to read One Piece instead of watching it is just that the pacing feels way better when compared to the anime. While I picked my favorite arcs while reading, there wasn’t anything that I felt I wanted to skip. (Whereas when I watched the anime I found myself skipping either sections of episodes or deciding to skip entire parts of arcs to just get to the action.) And with a manga, you never need to scrub through the intro or the episode recap.\nOne Piece is a silly story about a rubber pirate. It’s also a story about found family. About misfits and people who don’t fit in. It follows a group who defies the global powers that be, and will stop at nothing to pursue a world that doesn’t overlook injustice. Reading through the story was a genuine spot of light for me, during the deepest, darkest depths of the COVID-19 pandemic. Not just because it’s fun, but because it felt meaningful. So if all you know of the series is a few anime episodes you caught on a random Saturday as a child, you might try experiencing the zany adventure from a whole new perspective."
    },
    {
      "url": "https://gamerant.com/oda-revealed-how-often-the-straw-hat-crew-bathes-and-its-kind-of-gross/",
      "text": "Summary\n- The Straw Hat Pirates have varying levels of cleanliness, with Luffy and Zoro only taking baths once a week, while Sanji, Robin, and Nami take baths every day.\n- Usopp and Chopper, despite their quirky tendencies, defy expectations by taking baths once every three days, showing that they are not as \"stinky\" as one would assume.\n- Franky, being a cyborg, is content with taking baths once every three days, while Brook, a skeleton, takes a bath once a week, showing that even non-living crew members still value cleanliness.\nIn the One Piece series, the Strawhat Pirates started their journey in East Blue and have now become a crew capable of taking on the big names of the Grand Line. While much is known about the Straw Hats' motivations and desires, little is known of their day-to-day schedule when they aren't fighting other pirate groups or escaping from the Marines, as is usual in One Piece.\nAs a pirate group, neatness and healthy living may not be on their list of priorities; however, fans would not expect the future Pirate King's crew to live an unclean life. While some of the Straw Hat Pirates are as clean as one would assume, others defy expectations.\nFor The Captain Of The Straw Hat Pirates, It Is To Be Expected\nMonkey D. Luffy, the man who aims to be the Pirate King—the freest man on the seas—is a joyful and happy-go-lucky person who faces danger with a smile. As a devil fruit user, Luffy has a natural weakness for the ocean, so many would not expect him to be a fan of baths. However, in some episodes and various spin-offs of One Piece, Luffy has been shown taking baths. The question then is, how often does he take them? In a post, Oda stated that the captain of the Straw Hats takes a bath once a week. While this is definitely gross, it is not all that surprising, considering Luffy's carefree nature.\nZoro Loses Out To Sanji In Terms Of Cleanliness\nWho is stronger between the two wings of the future Pirate King? Roronoa Zoro versus Vinsmoke Sanji is one of the most heated debates in the One Piece fandom. While fans of the skillful chef (Sanji) and the straight-laced swordsman (Zoro) continually engage in heated debates, Zoro clearly loses out to Sanji when it comes to baths. In his post, Oda revealed that, like his captain, Zoro only takes baths once a week, while Sanji takes baths every day. Sanji's cleanliness is expected, as he needs to be neat and tidy to prepare delicious and properly cooked meals. On the other hand, one can only wonder how Zoro carries out intensive training every day, gathering grime and sweat, yet carries on without taking a bath. Perhaps the swordsman simply prioritizes naps more than he does baths. While gross, this is one of Zoro's many similarities with his captain and best friend.\nThe Fearful Sniper And The Brilliant Doctor Defy The 'Stinky' Expectations\nUsopp and Chopper are two individuals who bring much humor to the Straw Hat Pirates and the One Piece series. With their many quirky and humorous tendencies, the duo has a knack for making fans laugh. When it comes to baths, they defy expectations. Many times in the series, fans have seen Robin invite Chopper for a bath, and he often declines. As a reindeer with a lot of fur, many would expect Chopper to have his bath once in a blue moon; however, he manages to have it once every three days. Despite the many inconveniences having a bath may have on him due to his fur, he is not as nasty as many would have thought. On the other hand, Usopp also has his bath once every three days. As Usopp and Luffy have similar tendencies, one would have expected the sniper to have his bath as frequently as his captain. However, he defies expectations by having his bath more frequently than one would expect, even if it's not the best.\nDoes Franky Remain 'Superrr' In Taking Baths?\nWhenever Cyborg Franky is seen making a statement, it usually starts or ends with 'Superrr' in an iconic pose. While Franky is definitely a super shipwright, crewmate, and cyborg, is he also a super neat person? The answer is no. Franky is not one to have his bath every day like Nami, Robin, and Sanji. He is more content with having his bath once every three days. Franky's neatness is passable for a cyborg, as his body is mainly steel and iron. Only his back remains flesh and blood, and still, he far outclasses his captain when it comes to taking baths.\nDoes A Skeleton Need Baths?\nUnlike most living people, Brook is a skeleton that can do without many of the things people need to survive, as he is just bones. As a being made up of bones, Brook has shown to love milk, as it has many wonderful effects on his bones besides being tasty. Whether or not Brook needs baths, Oda stated that he takes one once a week. This shows that even after the deterioration of his body, Brook still washes up from time to time rather than never. However, if this is merely a habit from the time Brook was part of the Rumbar Pirates, then he has quite a few gross tendencies.\nAre The Female Crew Members Any Neater Than The Males?\nNico Robin, the archaeologist, and Nami, the navigator, remain the only female crew members of the Straw Hat Pirates. While most of their male crew members are not to be emulated in terms of neatness, one must ask, what about the females? Unsurprisingly, Nami and Robin are the complete opposite of Luffy and Zoro when it comes to taking baths, as they take their baths every day. Robin is often seen inviting Chopper to join her in a bath, implying that she takes one frequently. Nami is also frequently seen denying Sanji's many attempts to join her in a bath in a rather violent manner. As someone who cares about her appearance, she definitely would not allow herself to become like the boys.\nOne Piece is available to stream on Crunchyroll."
    },
    {
      "url": "https://www.polygon.com/23711069/one-piece-eiichiro-oda-netflix-release/",
      "text": "While May 4 has become closely associated with Star Wars thanks to the “May the Fourth/Force” pun, manga and anime fans regard it in a different way: as the eve of Luffy’s birthday. The One Piece character was canonically born on May 5, and this year, to commemorate the occasion, creator Eiichiro Oda issued a much welcome update on the upcoming Netflix live-action anime adaptation. The note is, true to the spirit of the mangaka, quirky and blunt.\n“I’ve been working with Tomorrow Studios and Netflix for quite some time now,” Oda writes in his new message to fans. “Even though they understand each of the characters, we obviously come from very different cultures so, when it comes to entertainment, we have different codes, skill sets, and aims. Sometimes it could be frustrating for both sides. It felt like, ‘We’re all trying to get to the same place so how come we’re not on the same wavelength?’ There was even a time when I thought, ‘Is a foreign production even possible?!’”\nOda’s sentiment is likely shared by fans of the One Piece manga, which has been running since 1997, and anime, which recently eclipsed over 1,000 episodes. While Netflix has gobbled up anime properties with every kind of adaptation in mind, few have really hit as hard as the source material. A 2017 Death Note movie is barely remembered in the collective conscious and many wish they could forget 2021’s live-action Cowboy Bebop series. So there’s reason to be skeptical of if the One Piece show will clear the bar with fans — especially if you are Eiichiro Oda. But he assures fans it’s going smoothly, and that he’s completely invested in getting it right, in whatever time he has left on this planet.\n“Considering my expected life span, I believe this is the last chance to bring One Piece to the entire world,” he writes, perhaps nodding to his various health issues over the years. “If we’re going to do it, I want to be able to supervise things while I’m still active. That’s why I agreed to the live-action adaptation of one piece back in 2016.”\nOda says all units of the production eventually got on sync to bring his vision for a live-action One Piece to life, and that “Netflix has committed enormous resources to the production.” While the show is slated for a 2023 premiere, the creator also insists that the streaming service won’t launch the show “until I’m satisfied.”\nNetflix has kept most of its One Piece under guard. The streamer released a short teaser for the series in late 2022, and showcased a number of character/cast shots earlier this year. As for when season 1’s eight episodes will actually premiere, it’s anyone’s guess, but it sounds like Oda gets to make the final call. He says fans won’t have to wait too long.\n“We’ll be setting sail very soon!!” he promises. Happy birthday to Luffy and anyone who celebrates."
    },
    {
      "url": "https://www.polygon.com/netflix-one-piece-season-3-confirmed/",
      "text": "As Japan’s annual One Piece Day wrapped up, Netflix unveiled the first look at season 2 and confirmed that a third season is already in the works. Although season 2 won't arrive until 2026, the early season 3 renewal also comes with news that production will begin later this year in Cape Town, South Africa. Marvel's Luke Cage and Iron Fist producer Ian Stokes is set to join Percy Jackson and the Olympians writer Joe Tracz as co-showrunner after original showrunner Matt Owen stepped down earlier this year.\nThe show's upcoming second season is set to cover the early stages of the Arabasta saga, including Reverse Mountain, Whiskey Peak, Little Garden, Drum Island, and likely tease the larger Arabasta arc — especially with Mr. 0 actor Joe Manganiello confirming his debut this season. Season 3 is expected to wrap up the Arabasta saga and launch directly into the full Sky Island saga.\nIt’s one thing to create settings on the vast open sea or in the scorching desert, as seen in Season 1 and expected in parts of Season 2, but it will be fascinating to see how the live-action team brings an entire civilization in the clouds to life, at least as “realistic” as the delightfully wacky world of One Piece will allow.\nExpect an announcement on when to expect season 3, which will probably be sometime after One Piece season 2's debut in 2026."
    }
  ],
  "argos_summary": "During One Piece Day '25, it was announced that an anime adaptation of the novel 'One Piece Heroines' will be produced, focusing on the female characters of the series. The novel, which includes stories about characters like Nami and Nico Robin, was compiled from short stories first published in One Piece Magazine. Additionally, Eiichiro Oda shared updates on the Netflix live-action adaptation of One Piece, expressing his commitment to ensuring the project aligns with his vision, while confirming that a second season is in the works, set to premiere in 2026.",
  "argos_id": "RON06GOMR"
}