{
  "url": "https://www.independent.co.uk/news/apple-app-store-tesla-european-union-epic-games-b2805883.html",
  "authorsByline": "The Associated Press",
  "articleId": "2a05b80ed7c74dde8aadce9ca3704204",
  "source": {
    "domain": "independent.co.uk",
    "paywall": false,
    "location": {
      "country": "gb",
      "city": "London",
      "coordinates": {
        "lat": 51.5073219,
        "lon": -0.1276474
      }
    }
  },
  "imageUrl": "https://static.independent.co.uk/2025/07/31/06/Australia_X_Corp_88975.jpg?width=1200&height=800&crop=1200:800",
  "country": "gb",
  "language": "en",
  "pubDate": "2025-08-12T05:16:56+00:00",
  "addDate": "2025-08-12T05:30:05.064413+00:00",
  "refreshDate": "2025-08-12T05:30:05.064415+00:00",
  "score": 1.0,
  "title": "Musk says he plans to sue Apple for not featuring X or Grok among its top apps",
  "description": "Billionaire SpaceX, Tesla and X owner Elon Musk says he plans to sue Apple for not featuring X and its Grok artificial intelligence chatbot app in its top recommended apps in its App Store",
  "content": "Your support helps us to tell the story From reproductive rights to climate change to Big Tech, The Independent is on the ground when the story is developing. Whether it's investigating the financials of Elon Musk's pro-Trump PAC or producing our latest documentary, 'The A Word', which shines a light on the American women fighting for reproductive rights, we know how important it is to parse out the facts from the messaging. At such a critical moment in US history, we need reporters on the ground. Your donation allows us to keep sending journalists to speak to both sides of the story. The Independent is trusted by Americans across the entire political spectrum. And unlike many other quality news outlets, we choose not to lock Americans out of our reporting and analysis with paywalls. We believe quality journalism should be available to everyone, paid for by those who can afford it. Your support makes all the difference.\n\nBillionaire SpaceX, Tesla and X owner Elon Musk says he plans to sue Apple for not featuring X and its Grok artificial intelligence chatbot app in its top recommended apps in its App Store.\n\nMusk posted the comments on X late Monday, saying, “Hey @Apple App Store, why do you refuse to put either X or Grok in your ‘Must Have’ section when X is the #1 news app in the world and Grok is #5 among all apps? Are you playing politics? What gives? Inquiring minds want to know.”\n\nMusk went on to say that “Apple is behaving in a manner that makes it impossible for any AI company besides OpenAI to reach #1 in the App Store, which is an unequivocal antitrust violation. xAI will take immediate legal action.”\n\nHe gave no further details.\n\nThere was no immediate comment from Apple, which has faced various allegations of antitrust violations in recent years.\n\nA federal judge recently found that Apple violated a court injunction in an antitrust case filed by Fortnite maker Epic Games.\n\nRegulators of the 27-nation European Union fined Apple 500 million euros in April for breaking competition rules by preventing app makers from pointing users to cheaper options outside its App Store.\n\nLast year, the EU fined the U.S. tech giant nearly $2 billion for unfairly favoring its own music streaming service by forbidding rivals like Spotify from telling users how they could pay for cheaper subscriptions outside of iPhone apps.\n\nAs of early Tuesday, the top app in Apple's App Store was TikTok, followed by Tinder, Duolingo, YouTube and Bumble. Open AI's ChatGPT was ranked 7th.",
  "medium": "Article",
  "links": [
    "https://www.independent.co.uk/topic/apple",
    "https://www.independent.co.uk/topic/app-store",
    "https://www.independent.co.uk/topic/epic-games",
    "https://www.independent.co.uk/topic/tesla",
    "https://www.independent.co.uk/topic/european-union",
    "https://www.independent.co.uk/donate?regSourceMethod=Donations"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "App Store",
      "weight": 0.08472305
    },
    {
      "name": "@Apple App Store",
      "weight": 0.0825111
    },
    {
      "name": "Apple",
      "weight": 0.0805603
    },
    {
      "name": "app makers",
      "weight": 0.075425535
    },
    {
      "name": "Elon Musk",
      "weight": 0.06804987
    },
    {
      "name": "iPhone apps",
      "weight": 0.06801789
    },
    {
      "name": "X",
      "weight": 0.066094235
    },
    {
      "name": "reproductive rights",
      "weight": 0.06504579
    },
    {
      "name": "Apples App Store",
      "weight": 0.06168297
    },
    {
      "name": "antitrust violations",
      "weight": 0.06095341
    }
  ],
  "topics": [
    {
      "name": "Lawsuits"
    }
  ],
  "categories": [
    {
      "name": "Environment"
    },
    {
      "name": "Politics"
    },
    {
      "name": "Tech"
    },
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Technology News",
      "score": 0.96533203125
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.92236328125
    },
    {
      "name": "/Law & Government/Legal/Other",
      "score": 0.5087890625
    }
  ],
  "sentiment": {
    "positive": 0.07456832,
    "negative": 0.6597701,
    "neutral": 0.26566163
  },
  "summary": "Billionaire SpaceX, Tesla and X owner, Elon Musk, plans to sue Apple for not featuring X and its Grok artificial intelligence chatbot app in its top recommended apps in its App Store. The move is seen as an \"encomprehensible antitrust violation\" by Musk. The top app in Apple's App Store was TikTok, followed by Tinder, Duolingo, YouTube and Bumble. The European Union recently fined Apple 500 million euros for breaking competition rules by preventing app makers from pointing users to cheaper options outside its App store.",
  "shortSummary": "Elon Musk plans to sue Apple for not featuring X and Grok in its App Store top 10, deeming it a violation of antitrust laws.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "87453c7be20346e1972440a409c87968",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Elon Musk plans to sue Apple for allegedly not featuring his social media platform X and its Grok AI chatbot in the App Store's recommended apps, claiming this constitutes an antitrust violation. Musk criticized Apple for favoring certain apps and suggested that this behavior hinders competition for AI companies. Apple's history of facing antitrust allegations, including fines from the EU for anti-competitive practices, adds context to Musk's claims.",
  "argos_id": "RPSVV3DEK"
}