{
  "url": "https://www.popularmechanics.com/science/environment/a65627444/mummified-pakistan/",
  "authorsByline": "Darren Orf",
  "articleId": "95ab77d371844ea5a1a1abc0c412c420",
  "source": {
    "domain": "popularmechanics.com",
    "paywall": false,
    "location": null
  },
  "imageUrl": "https://hips.hearstapps.com/hmg-prod/images/frozen-man-with-hand-against-a-blue-snowy-royalty-free-image-1754939273.pjpeg?crop=1.00xw:0.754xh;0,0.0337xh&resize=1200:*",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T19:09:28.604778+00:00",
  "addDate": "2025-08-11T20:55:00.152708+00:00",
  "refreshDate": "2025-08-11T20:55:00.152712+00:00",
  "score": 1.0,
  "title": "A Man Was Perfectly Frozen in Ice for 28 Years. The Glacier Just Spit Him Back Out.",
  "description": "A painful three-decades-long search can finally come to a close.",
  "content": "Here's what you'll learn when you read this story:\n• A 31-year-old Pakistani man, who went missing in June 1997 in an ice cave, was found perfectly preserved last week by a local sheppard.\n• The discovery puts an end to a painful three-decade-long search for a family that tirelessly searched for his body in the mountainous Kohistan region.\n• As glaciers retreat around the world due to climate change, discoveries of bodies or ancient artifacts will likely increase as melting ice reveals their frozen tombs.\n\nIn June 1997, a 31-year-old Pakistani man by the name Naseeruddin, while traveling in the Supat Valley in the mountainous northern region of Pakistan called Kohistan, disappeared into a cave never to be seen again. He left behind a wife and two children, and for years, the family of the missing man searched the area for any sign of him—ultimately, to no avail.\n\n“Our family left no stone unturned to trace him over the years,” Malik Ubaid, the nephew of the deceased, told the AFP. “Our uncles and cousins visited the glacier several times to see if his body could be retrieved, but they eventually gave up as it wasn’t possible.”\n\nAfter nearly three decades, the search for Naseeruddin has finally come to an end. On July 31, a local shepherd in the valley named Omar Khan discovered the missing man’s body, with an identity card still on him. But that wasn’t the only surprise.\n\n“What I saw was unbelievable,” Khan told BBC Urdu. “The body was intact. The clothes were not even torn.”\n\nFor 28 years, Naseeruddin lay mummified in the glacial ice. He underwent a quick freezing process that then protected the body from moisture and oxygen. Pakistan is home to some 7,000 glaciers—the largest amount outside of Earth’s polar regions—and like many glaciers around the world, these ice giants are slowly disappearing due to anthropogenic climate change.\n\nIn northern Pakistan, climate change has caused decreased snowfall in the region, leading to more direct sunlight melting the glaciers. This unnatural warming is what eventually exposed Naseeruddin’s body, allowing the passing shepherd to finally put a painful mystery to rest.\n\n“Finally, we have got some relief after the recovery of his dead body,” Ubaid said.\n\nGlaciers and other icy bodies, such as ice sheets, are basically planetary time capsules. Scientists around the world frequently drill ice cores to measure past climactic events by analyzing trapped air bubbles, as well as the isotropic composition of the surrounding ice. They can also provide incredible glimpses into humanity’s past. While many amazing artifacts have been found encased in glacial ice , the most famous frozen finding is Ötzi, also known as The Iceman, who was found in the Italian Alps in 1991 with his soft tissues and organs intact. This discovery provided an unprecedented glimpse into life and times and neolithic Europe.\n\nWhile glaciers are amazing at preserving soft tissue (scientists even know what Ötzi’s last meal was), they aren’t as effective as cryogenic freezing, which can perfectly preserve an organism. This is why Ötzi, as well as other bodies of frozen WWI soldiers discovered in 2017, still show signs of decomposition and dehydration.\n\nSadly, Naseeruddin’s fate is one shared by many intrepid explorers who venture into these dangerous and cold altitudes. Last year, National Geographic reported the partial recovery of mountaineer Sandy Irvine, who a century ago. In fact, crews regularly conducted clean-up campaigns on the world’s tallest peak, often finding long-lost climbers frozen .\n\nWith glaciers rapidly in retreat around the world, we’ll soon see what other mysteries—both tragic and wondrous—that may lay hidden at the top of the world.",
  "medium": "Article",
  "links": [
    "https://www.nbcnews.com/news/world/melting-glaciers-reveal-world-war-i-corpses-n9711",
    "https://www.cbsnews.com/news/mount-everest-melting-ice-reveals-climbers-bodies-death-zone-climate-change/",
    "https://www.popularmechanics.com/author/2793/darren-orf/",
    "https://x.com/BBCUrdu/status/1952201878638318066",
    "https://www.popularmechanics.com/science/a62057118/pinnacle-man-identified/",
    "https://www.popularmechanics.com/science/archaeology/a44831513/new-study-reveals-secrets-otzi-iceman-mummy/",
    "https://www.nationalgeographic.com/science/article/news-otzi-iceman-food-DNA-diet-meat-fat",
    "https://www.popularmechanics.com/science/a60202478/an-alpine-mummys-mysterious-tattoos-have-upended-archaeological-theories/",
    "https://archaeology.org/news/2017/09/12/170912-norway-viking-sword/",
    "https://www.popularmechanics.com/science/environment/a65104265/50000-year-old-ice-block/",
    "https://www.popularmechanics.com/adventure/outdoors/a62616802/sandy-irvine-boot-everest/",
    "https://www.popularmechanics.com/home/a65368312/how-trane-is-adapting-to-a-changing-climate/",
    "https://www.popularmechanics.com/science/animals/a64514746/ancient-egypt-mummified-crocodile-discovery/",
    "https://www.popularmechanics.com/science/environment/a63635704/climate-change-conservation/",
    "https://www.aljazeera.com/features/longform/2024/5/12/guardians-of-the-glaciers-life-alongside-pakistans-vanishing-ice",
    "https://www.popularmechanics.com/science/archaeology/a64445986/mexico-cave-chamber/",
    "https://www.popularmechanics.com/science/a65546567/dead-pigs-human-graves/",
    "https://www.popularmechanics.com/science/a60248410/walt-disney-frozen-head/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "other bodies",
      "weight": 0.08854292
    },
    {
      "name": "other icy bodies",
      "weight": 0.0847791
    },
    {
      "name": "bodies",
      "weight": 0.08315354
    },
    {
      "name": "melting ice",
      "weight": 0.079673715
    },
    {
      "name": "glacial ice",
      "weight": 0.07938949
    },
    {
      "name": "ice sheets",
      "weight": 0.07723441
    },
    {
      "name": "ice cores",
      "weight": 0.07721167
    },
    {
      "name": "many glaciers",
      "weight": 0.07653327
    },
    {
      "name": "Ice",
      "weight": 0.07571534
    },
    {
      "name": "Last year",
      "weight": 0.072011985
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Science"
    },
    {
      "name": "Environment"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Other",
      "score": 0.626953125
    },
    {
      "name": "/Sensitive Subjects/Accidents & Disasters",
      "score": 0.5302734375
    },
    {
      "name": "/Reference/Humanities/History",
      "score": 0.4287109375
    },
    {
      "name": "/Arts & Entertainment/Offbeat/Other",
      "score": 0.37255859375
    },
    {
      "name": "/Sensitive Subjects/Death & Tragedy",
      "score": 0.3720703125
    },
    {
      "name": "/Pets & Animals/Wildlife",
      "score": 0.369384765625
    }
  ],
  "sentiment": {
    "positive": 0.06982896,
    "negative": 0.66025805,
    "neutral": 0.269913
  },
  "summary": "A 31-year-old Pakistani man named Naseeruddin went missing in June 1997 in an ice cave in the Supat Valley in the mountainous northern region of Pakistan called Kohistan, leaving behind a wife and two children. His family had been searching for him for three decades before his body was discovered by a local shepherd. The discovery ends a three-decade-long search for his family. As glaciers retreat globally due to climate change, discoveries of bodies or ancient artifacts are likely to increase as melting ice reveals their frozen tombs. The most famous frozen finding is Ötzi, also known as The Iceman, who was found in 1991 with his soft tissues and organs intact.",
  "shortSummary": "A 31-year-old Pakistani man, found perfectly preserved in glacial ice, ended a three-decade search for his remains amid global glacier retreat.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "612dbf0e6d57455bb3d3dc607d1a0362",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.popularmechanics.com/science/archaeology/a44831513/new-study-reveals-secrets-otzi-iceman-mummy/",
      "text": "- Updated DNA testing on the 5,000-year-old Ötzi the Iceman mummy reveals fresh clues about his ancestry.\n- The new finds show that he was an Anatolian farmer, and likely had an increased risk of obesity.\n- Ötzi the Iceman also had darker hair and skin than originally believed. Plus, he was likely bald.\nLife wasn’t too kind to Ötzi the Iceman, the 5,000-year-old mummy discovered in 1991 by German hikers in the Italian Alps. Not only did the naturally mummified remains show that he was murdered, but a new study delved deeper into his DNA to reveal that he was a balding farmer who likely struggled with obesity.\nAlong with the discovery of the murder, crews preserving the remains in 1991 also located a copper ax, longbow, and bearskin hat. But the efforts to find more info about the Iceman didn’t stop there. Researchers followed up physical excavation in 2012 with attempts at genetic analysis, but modern DNA contamination hindered early efforts and genome mapping wasn’t as far along over a decade ago as it is now.\nSo, scientists from Germany’s Max Planck Institute for Evolutionary Anthropology decided to update that 2012 effort, using DNA from Ötzi’s left hip bone as the source material. The findings were published in the journal Cell Genomics.\n“Contrary to previous studies, we found no detectable Steppe-related ancestry in the Iceman,” the authors write. “Instead, he retained the highest Anatolian-farmer-related ancestry among contemporaneous European populations, indicating a rather isolated Alpine population with limited gene flow from hunter-gatherer-ancestry-related populations.”\nAs Albert Zink, head of the Institute for Mummy Studies at Eurac Research in Italy, tells the Associated Press, most Europeans have a mix of genes from three groups: Anatolia farmers, western hunter-gatherers, and eastern herders. Ötzi’s ancestry was 92 percent Anatolian farmer, meaning he was likely from the area that is present-day Turkey.\n“Ötzi the Iceman keeps having new surprises in store for us,” Lars Pilø, archaeologist with the Secrets of the Ice project, told Live Science, “which is remarkable as he must be the most investigated archaeological find ever.”\nÖtzi has proven fascinating to the scientific community. As the oldest naturally mummified body ever discovered, researchers have studied the prehistoric farmer’s life in detail. There have been studies published on everything from the the tools, weapons, and clothes he had with him to the route of his journey.\nFurther analysis revealed in the new study shows that the Iceman had darker skin then present-day Europeans—roughly the same tone that he still has—and “carried risk alleles associated with male-pattern baldness, type-2 diabetes, and obesity-related metabolic syndrome.”\nAdding the DNA results to the visual observations of the preserved mummy, roughly 45-years-old at the time of his death, and the authors believe the lack of “hair on his head” may have not only been a result of the mummification process, but could simply be that Ötzi was bald—he would have had dark hair. The way he looks 5,000 years later may not be unlike how he looked on that fateful day between 3,350 and 3,105 BC in which he took an arrow to the back.\nNow, if science can just tell us why he was wanted dead, we may fully understand the life and times of Ötzi the Iceman.\nTim Newcomb is a journalist based in the Pacific Northwest. He covers stadiums, sneakers, gear, infrastructure, and more for a variety of publications, including Popular Mechanics. His favorite interviews have included sit-downs with Roger Federer in Switzerland, Kobe Bryant in Los Angeles, and Tinker Hatfield in Portland."
    },
    {
      "url": "https://www.popularmechanics.com/science/a65546567/dead-pigs-human-graves/",
      "text": "Here’s what you’ll learn when you read this story:\n- Because pigs have remarkably similar anatomy to humans, knowing the signs of decomposition in the animals can help identify hidden graves of humans.\n- Victims of cartel violence in Jalisco, Mexico, often go missing for years, and they can be buried in graves that prove difficult to find.\n- Researchers have replicated these burials with pig cadavers, identifying substances released into the soil by decomposition, as well as insect activity and the positioning of soil and plants.\nKnowing what signs to look for helps both forensic scientists and the families of the deceased in the ongoing search for missing cartel victims.\nJalisco, Mexico, is renowned for its mariachi music, rodeos, top-shelf tequila and historic capital city of Guadalajara, but beneath this colorful facade lurks a dark underbelly of crime. The Jalisco Nueva Generación cartel is behind the murder and disappearance of thousands of victims who are often never found.\nOver one hundred thousand people have disappeared under mysterious circumstances linked to the crime syndicate since 2006—About 15,500 were reported missing in March of this year alone. Efforts to find the remains of loved ones have often been futile. Members of the Guerreros Buscadores collective, who tirelessly try to locate the missing, have found hundreds of items of clothing on the property, along with charred human remains that were almost impossible to identify.\nWhile a mapping project headed by the federal research institute CentroGeo keeps testing new techniques and equipment, such as laser scanners and thermal drones, that could lead to breakthroughs in unearthing clandestine graves, technology is not enough. This is why the Jalisco Search Commission is trying to learn more about identifying hidden bodies by dressing up pig cadavers in human clothes and burying them.\nWhile humans may not look anything like pigs, Homo sapiens have 98% of their DNA in common with the hoofed mammals. Too few humans donate their bodies to taphonomic facilities (often called “body farms”). Most donors are also elderly and die of natural causes, while cartel victims are usually adults whose lives are lost in violence. Swine models are ideal analogs for humans due to size and fat distribution. The structure and thickness of skin are incredibly similar, which makes the ideal for studying postmortem insect colonization and other decomposition processes.\nForensic scientists in Jalisco have learned to pick up on some telltale signs of a grave. After the burial of pig carcasses in one area of the Search Commission’s facility, scientists led by mapping project coordinator José Luis Silván noticed yellow flowers blooming from the phosphorus leaching into the soil from bodily fluids. Another group of researchers who ran their own experiments with pigs were able to connect levels of phosphorus in the soil with decomposition. Phosphorus encourages flowering in plants, which is why the sight of yellow flowers guides those in search of graves.\nOther elements released as pig cadavers decompose, such as nitrogen and potassium, are detected by drones with hyperspectral cameras that measure light signatures from substances in the ground. Nitrogen contained in the tissues of organisms is in its organic form. When fungi and microbes start to decompose dead tissue, inorganic nitrogen is then returned to the soil as ammonia. Potassium can release during the early stages of decomposition because it is not bound to carbon in an organic form, which is why its presence could possibly identify the body of someone recently reported as missing.\nSilván and his fellow researchers also use graves behind a transparent acrylic pane to study cadavers decomposing in real time. They also analyze soil samples from the pig graves and compare the to those from human graves. Both are especially important in terms of insect activity, since some species, such as blowflies, colonize soon, and others appear later. The growth phases of larvae when a body is discovered can possibly give away how much time has elapsed since death.\nVictims of cartel murders also tend to be found in certain places, as the commission has learned from information given by family members who have found clandestine graves. Many of these graves are found under trees with vertical roots because grave diggers prefer to stay in the shade when the scorching Mexican sun is beating down. Other graves have been identified by the placement of soil and plants that, when compared to the surrounding environment, seem unnatural.\n“In the context of this terrible tragedy, Amnesty International urges the Mexican state to engage in dialogue with the searchers, to listen to their needs and to recognize the experience they have gained through many years of work in the field,” said Edith Olivares Ferreto, Executive Director of Amnesty International Mexico. “[They should also be guaranteed] their right to search without fear.”\nElizabeth Rayne is a creature who writes. Her work has appeared in Popular Mechanics, Ars Technica, SYFY WIRE, Space.com, Live Science, Den of Geek, Forbidden Futures and Collective Tales. She lurks right outside New York City with her parrot, Lestat. When not writing, she can be found drawing, playing the piano or shapeshifting."
    },
    {
      "url": "https://www.popularmechanics.com/science/archaeology/a64445986/mexico-cave-chamber/",
      "text": "- Explorations of a submerged passage in the Tlayococ cave in Mexico led to an undiscovered room.\n- Within the room, cave explorers discovered bracelets sitting atop stalagmites and other artifacts from a lost civilization.\n- The motif on the shell bracelets traces to the extinct Tlacotepehuas ethnic group, about which relatively little is known.\nA mapping expedition in the Tlayócoc cave in Mexico led a professional cave explorer to a hidden chamber containing shocking evidence of an extinct civilization.\nYekaterina Katiya Pavlova ventured to a community in the Sierra de Guerrero to further map the Tlayócoc cave. When Pavlova and local guide Adrián Beltrán Dimas reached the bottom of the cave, having already explored all that was mapped, they opted to head into an unknown passage through a submerged entrance. The effort paid off.\nThe passage led to a previously unseen room in which two engraved shell bracelets sat atop stalagmites, likely as an offering, according to a translated statement from the Mexican National Institute of Anthropology and History (INAH).\nThe explorers also found another bracelet, a giant snail shell, and pieces of black stone discs similar to pyrite mirrors—all of it dated to more than 500 years ago.\nArchaeologists then descended on the cave, uncovering 14 total objects—three shell bracelets, a bracelet fragment, the giant snail shell, a piece of burnt wood, and pieces of eight stone discs (two of which were complete). Each of the bracelets were made from snail shells—likely a marine species—and were engraved with anthropomorphic symbols and figures.\nThe bracelets feature S-shaped symbols known as xonecuilli, zigzagging lines,a and circles to create human faces in profile. These designs could be meant to signify deities.\nThe archaeologista estimate that the items were left in the cave during the Postclassic period between 950 and 1521 A.D.—a time when the area was known to be populated by the now-extinct Tlacotepehaus ethnic group.\n“This finding is of great relevance, since, with the study of the contextual relationship of the pieces of the cave, we can interpret symbolic notions, cultural aspects, manufacturing, and even trade,” Miguel Perez, INAH archaeologist, said in a statement, “to characterize the pre-Hispanic societies settled in the Sierra de Guerrero.”\nThe archaeologists determined that the stalagmites were manipulated in pre-Hispanic times to give them a more spherical finish, likely to better fit with ritual needs.\n“Possibly the symbols and representations of characters on the bracelets are related to pre-Hispanic cosmogony regarding creation and fertility,” Cuauhtemoc Reyes Alvarez, INAH archaeologist, said in a statement. He added that the sealed context allows experts to understand how the ancient inhabitants may have conceived of these caves—as portals to the underworld, or as sacred spaces connected to the Earth and the divine.\nThe black stone discs resemble others from nearby archaeological regions, such as El Infiernillo, along with ones from distant cultures like Huasteca.\nHistorical reports say extreme cold forced people groups living in the Sierra de Guerrero (located over 7,850 feet above sea level and filled by dense pine and oak forests) to lower altitudes. Little is known about the Tlacotepheuas, other than 16th century historical mentions of their presence. The snail-shell bracelets could help tell their story.\nTim Newcomb is a journalist based in the Pacific Northwest. He covers stadiums, sneakers, gear, infrastructure, and more for a variety of publications, including Popular Mechanics. His favorite interviews have included sit-downs with Roger Federer in Switzerland, Kobe Bryant in Los Angeles, and Tinker Hatfield in Portland."
    },
    {
      "url": "https://www.popularmechanics.com/science/a60202478/an-alpine-mummys-mysterious-tattoos-have-upended-archaeological-theories/",
      "text": "- The 5,000-year-old Ötzi the Iceman mummy had 61 tattoos preserved on his body, and nobody knows the method by which they got there.\n- A new research study experimented with differing tattoo tools and methods to get us closer to understanding Ötzi’s ink.\n- It appears Ötzi’s tattoos were made by using either a piece of bone or copper awl.\nÖtzi the Iceman didn’t have a full tattoo sleeve, but he may have been well on his way before meeting his death in the Italian Alps over 5,000 years ago. It’s those 61 tattoos—or tattoo-like marks—on Ötzi that apparently have both researchers and tattoo artists intrigued enough to start tattooing themselves, hoping to find just how Ötzi got his ink.\nThere’s been a series of guesses floating about regarding just what made the tattoo marks on Ötzi’s wrist, legs, back, and abdomen ever since he was uncovered by hikers in 1991, but there’s really been no scientific evidence to back them up. That’s why Aaron Deter-Wolf of the Tennessee Division of Archaeology partnered with New Zealand tattoo artists Danny Riday to test out the methods. They published a study on their findings in the European Journal of Archaeology.\nThe team tattooed Riday using eight different tools and four tattooing techniques in the same exact designs as found on Ötzi. They chronicled the way the wounds healed, the lines of the ink, and the way the tattoos aged, and compared Riday’s tattoos with those of Ötzi to find the closest match.\n“We ultimately proposed that Ötzi’s tattoos were made by puncture, likely using either a bone of copper awl,” Deter-Wolf told ScienceAlert. “Those types of artifacts appear in the archaeological record of the region, but none have ever been identified as tattooing tools. We hope this paper will inspire archaeologists to reassess how artifacts may have been used, and maybe discover actual Copper Age tattooing tools.”\nTools were the first key in the experiment—animal bones, obsidian, copper, boar tusk, and a modern steel needle were all part of the process. All tools in the experiment were crafted using traditional or pre-electric technologies, when possible, the authors wrote when discussing the study, to ensure continuity with archaeological materials. Techniques included hand-tapping, hand-poking, incision, and subdermal tattooing, the last of which requires a bone to puncture the skin twice.\nThe finding that hand-poking with either animal bone or a copper awl is the most likely method used differs from early theory that gained traction in the mainstream discussion of Ötzi—that the tattoo-like markings were created by an incision getting filled with plant matter that was then set on fire.\n“Popular discussions of the Iceman describe his tattoos as having been made by incision, first cutting the skin, and then rubbing in pigment from the surface,” the authors wrote.\nThe team found that the Ötzi tattoos were not only a hand-poked method with a single-pointed tool, but probably not made using the incision technique popularly discussed, based on matching the wounds, line widths, and ink diffusion.\n“There’s absolutely no proof of that, and over time the bit about fire got left behind, but the idea of their being incised persisted,” Deter-Wolf told ScienceAlert. “Most of the archaeologists who have discussed Ötzi’s tattoos in recent years are upfront that we don’t know how they were made, but the idea still appears in just about every popular media discussion.”\nEach tattoo pattern was executed with a single tool type and technique, and featured both commercial black tattoo ink and a soot-based ink harvested from burning kauri tree resin mixed with powdered charcoal, alcohol, and coconut oil in order to “examine possible variations between natural and commercially produced tattoo pigment.”\n“Our findings reveal that there are discernible variations in tattoos created using different tools and techniques,” the team wrote. “This data may be applied to the study of preserved remains from archaeological and museum collections, as well as to analysis of historical imagery and traditions, to illuminate previously unknown aspects of the associated cultures.”\nTim Newcomb is a journalist based in the Pacific Northwest. He covers stadiums, sneakers, gear, infrastructure, and more for a variety of publications, including Popular Mechanics. His favorite interviews have included sit-downs with Roger Federer in Switzerland, Kobe Bryant in Los Angeles, and Tinker Hatfield in Portland."
    },
    {
      "url": "https://www.popularmechanics.com/science/animals/a64514746/ancient-egypt-mummified-crocodile-discovery/",
      "text": "- Ancient Egyptians regularly mummified crocodiles in elaborate ceremonies in dedication to their crocodile god Sobek.\n- A study of one of these crocodiles reveals details about the animal’s death and the methods through which Ancient Egyptians captured these fearsome predators.\n- Using x-ray and CT-scanning technologies, archaeozoologists can now explore the insides of these animals, which, unlike human mummification, have their organs intact.\nTo uncover the mysteries of the past, scientists employ a wide variety of techniques to get at the truth. Climate scientists drill two-mile-long ice cores to glimpse Earth’s past climatic conditions. Paleontologists analyze sediment layers to visualize the physical timeline of past epochs. And while Egyptologists similarly deploy lots of state of the art archeological techniques, sometimes it’s best to just use a mummified crocodile stomach.\nThat’s exactly what researchers at the University of Manchester did with a 3,000-year-old, 7.2-foot-long crocodile corpse, kept at the Birmingham Museum and Art Gallery and known simply as 2005.335. Although Ancient Egyptians typically removed organs when mummifying humans, crocodiles sacrificed to the crocodile god Sobek kept their innards intact, and this small deviation from tradition allows scientists in the 21st century to analyze the organs to unlock mysteries of this strange sacrificial ritual.\nTo preserve the specimen for future display, the research team deployed non-invasive techniques, such as x-rays and CT scanning, to catalog the contents of the crocodile’s stomach. Among the ancient gastronomic detritus, scientists found some usual suspects called gastroliths, which are small stones crocodiles regularly swallow to aid digestion.\nHowever, the scientists also found intact fish baited to a bronze hook. Because the time frame between the croc’s last meal and its death was so short—the gastroliths hadn’t reached the stomach yet—the crocodile was likely intentionally caught by Ancient Egyptians to be part of a sacrificial ceremony to Sobek.\n“Whereas earlier studies favored invasive techniques such as unwrapping and autopsy, 3D radiography provides the ability to see inside without damaging these important and fascinating artifacts,” University of Manchester archaeozoologist Lidija McKnight, co-author of a study published in the journal Digital Applications in Archaeology and Cultural Heritage, said in a press statement.\nWhile keeping the long-dead crocodilian intact, McKnight and her team also “virtually” recreated the bronze hook lodged in the specimen’s stomach for future museum displays. McKnight says that in the past Ancient Egyptians likely used hardened clay to create a mold and then poured molten metal over a charcoal fire to create the hook.\n“Despite the passing of several millennia between the production of the ancient fish hook and the modern replica, the casting process remains remarkably similar,” McKnight said in the press statement.\nAlthough 2005.335 met a grisly fate, crocodiles were actually revered in Ancient Egyptian society for their strength but also their displays of gentleness (especially with their young)—but perhaps they were too revered. Archeologists believe that this Nile-based culture, in which the crocodile was the top predator (besides humans, of course), likely bred the animals specifically for sacrificial purposes by “crocodile cults.” In the Egyptian town of Fayoum, which was the center of worship for Sobek, experts have uncovered thousands of mummified crocodiles, many of them babies.\nBut thanks to these long-ago sacrifices, the story behind these ancient mummified crocodiles is finally spilling its guts.\nDarren lives in Portland, has a cat, and writes/edits about sci-fi and how our world works. You can find his previous stuff at Gizmodo and Paste if you look hard enough."
    },
    {
      "url": "https://www.popularmechanics.com/science/a62057118/pinnacle-man-identified/",
      "text": "- A man found frozen in a mountain cave in Pennsylvania in 1977 was finally identified by authorities.\n- His fingerprints were misplaced after the original autopsy, and they were recently discovered in a file and used to identify the 27-year-old from Fort Washington, Pennsylvania.\n- The unidentified male was dubbed “Pinnacle Man” because of the location near a popular hiking peak his body was found.\nA frozen body found in a Pennsylvania cave by hikers 47 years ago had gone unidentified until now. And it only took about an hour to make the positive identification of Nicolas Paul Grubb, a 27-year-old from Fort Washington, Pennsylvania.\nIn January 1977, two hikers on the Appalachian Trail discovered the then-unidentified body frozen in a cave near the Pinnacle peak when they tucked into the cave to escape harsh weather. Because of the location of the body, the John Doe was dubbed the “Pinnacle Man.” A 1977 autopsy showed no signs of foul play, and the death was ruled a drug overdose, but no identification was made. His belongings and dental records yielded no clues and the fingerprints were misplaced.\nFinding the fingerprints 47 years later sure sped up the identification process.\n“After 47 years Jon Doe ‘Pinnacle Man’ has been identified,” the Berks County Coroner’s Office wrote on Facebook. Pennsylvania state trooper Ian Keck located Grubb’s missing fingerprint card in a file and less than an hour after turning the card over to the National Missing and Unidentified Persons System, the FBI matched them to Grubb.\nThe story of Grubb still isn’t fully known, though. George Holmes, chief deputy coroner of Berks County, said in a news conference that Grubb, who had received an honorable discharge from the Pennsylvania Army National Guard in 1971, was wearing light clothing even though he was on a snow-covered trail. It appeared he had tried to start a fire within the cave.\n“The rest of it is still a question mark for us,” said Holmes, according to the New York Times, about how Grubb ended up alone in a cave on the trail.\nWhile those questions may not have answers now, the family has received closure and asked for his remains to be moved to a family plot.\n“It is moments like these that remind us of the importance of our work to provide answers, to bring closure, and to give the unidentified a name and a story,” John Fielding, Berks County coroner, said in the news conference, according to CNN.\nThis wasn’t the first attempt to identify Grubb since the initial autopsy in 1977. Five years ago, his body was exhumed, according to the Associated Press, to check a link between dental records and two missing person cases in Florida and Illinois. The body’s DNA didn’t match either case.\nIt was left to a state trooper digging through old files to run across the fingerprint card to solve the case of the identity of the Pinnacle Man.\nTim Newcomb is a journalist based in the Pacific Northwest. He covers stadiums, sneakers, gear, infrastructure, and more for a variety of publications, including Popular Mechanics. His favorite interviews have included sit-downs with Roger Federer in Switzerland, Kobe Bryant in Los Angeles, and Tinker Hatfield in Portland."
    },
    {
      "url": "https://www.popularmechanics.com/science/environment/a63635704/climate-change-conservation/",
      "text": "- A new meta-analysis of 882 studies across 34 years including 628 plant, animal, and fungi species shows that conservation efforts are sustaining or increasing genetic diversity among many at-risk species.\n- Increasing, or at least sustaining, genetic diversity is crucial as it makes a species more adept at adapting to changing conditions, a useful trick during an age of anthropogenic climate change.\n- The authors stress that we can’t let off these efforts as two-thirds of the species studied are still experiencing biodiversity loss, but this meta-analysis shows that conservation efforts are making a noticeable and important impact.\nReading about the natural world during an age of anthropogenic climate change can feel a bit like a supermassive black hole of bad news—not even light beams of hope can escape its dispiriting maw. However, a new meta-analysis looking at 628 plant, animal, and fungi species data spanning nearly 35 years shows that conservation efforts are making a big impact in promoting genetic diversity and safeguarding species.\nThe authors of the study, led by scientists at the University of Sydney and in partnership with scientists around the globe, stress that this bit of good news doesn’t mean we can let up on our efforts—roughly two-thirds of the species surveyed are still declining in genetic diversity—but there is a large, positive increases in others, whether sustaining that diversity or, in some cases, even increasing it. The results of the study were published in the journal Nature.\nGenetic diversity is crucial in protecting species, especially as the mercury rises on Earth at an unprecedented rate. The more genetically diverse a species is, the better equipped it is to adapt to environmental challenges. If you lack this diversity, then bad things can happen (see: Irish potato famine). Over the decades, conservations have developed a variety of techniques for increasing biodiversity, including translocation, habitat restoration, and population control (to name a few), and it looks like their hard work is definitely paying off.\n“There is no getting around the fact that biodiversity is declining at unprecedented rates across the globe—but there are glimmers of hope,” Catherine Grueber, the senior author of the study from the University of Sydney, said in a press statement. “The action of conservationists is reversing these losses and helping to create genetically diverse populations that can better meet the challenges of the future.”\nUsing innovations in genetic analysis, the team pored through 80,271 records, but only 882 met their set criteria, which was primarily tracking genetic diversity of species across time. Grueber and her team then developed a method for creating a common measurement scale so comparisons could be made even if studies used different methods of analyses or different genetic data retrieval. Grueber said that these employed advancements make it possible to “to learn from studies long after they were carried out,” which has a big benefit when trying to track genetic change in a population across decades.\nHighlights of conservation wins can be found around the globe. The Golden bandicoot (Isoodon auratus) sustained its genetic diversity thanks to reintroduced populations in western Australia. Translocation of the Greater prairie chicken (Tympanuchus cupido pinnatus) in North America to new areas helped reduce inbreeding. Devastated by the fur trade, the Scandinavian arctic fox (Vulpes lagopus) is on the rebound after a robust captive breeding program and removal of the steadily encroaching red fox. The list (thankfully) goes on and on, but work still remains.\n“Despite successes, we can't be complacent,” Robyn Shaw, a co-first author of the study from the University of Sydney, said in a press statement. “It’s vital that we learn from what is working so that we can protect species in the long-term.”\nLet’s see if we can make that glimmer of hope grow into something even brighter.\nDarren lives in Portland, has a cat, and writes/edits about sci-fi and how our world works. You can find his previous stuff at Gizmodo and Paste if you look hard enough."
    },
    {
      "url": "https://www.aljazeera.com/features/longform/2024/5/12/guardians-of-the-glaciers-life-alongside-pakistans-vanishing-ice",
      "text": "Skardu, Gilgit-Baltistan, Pakistan - As we make our way towards Pakistan's first organic village, an intense one-hour trek along the rugged, steep and unfenced mountainside pathway from Mindoq-Khar, near Kharpocho Fort, my legs are shaking with a mix of fear and strain.\nThe sharp mountain edges stick out threateningly, and I am reminded of the soulful lyrics of Ali Zafar's Paharon Ki Qasam (Oaths of the Mountains), a tribute to the late Pakistani climbing hero, Muhammad Ali Sadpara from Skardu, who tragically lost his life in February 2021 while climbing the notorious Bottleneck gully which is just 300 metres (984 feet) below the summit of K2.\nAbove us, the sky is a brilliant shade of blue, adding to the surreal beauty of the landscape. As we gain a wider view of the Indus River Valley below us, our 44-year-old guide, Abbas Jaan, stops and draws our attention to the colour of the water.\n\"You can see the water turning a murky grey, carrying with it the particles from the retreating glaciers,\" he says, his eyes scanning the slow-flowing waves of this vital drinking water supply. “And even though it's grey,\" he adds, \"the glacial water is mineral-rich and incredibly pure.\"\n\"But, year by year, these glaciers are melting fast. They are decreasing,\" he says, pointing towards the thousands of smaller glacier peaks that surround us in the far distance; some mountains are snow-covered while others are dry and brown.\nThe city of Skardu, from where we have departed, sits some 2,228 metres (7,310 feet) above sea level. It is the gateway to the Karakoram mountain range and some of the world's highest peaks such as K2, Broad Peak and Gasherbrum, making it a popular destination for trekkers and mountaineers who come to marvel at the breathtaking scenery.\nWith a population of more than 200,000, the city boasts a rich cultural blend influenced by Tibetan, Balti and other Central Asian traditions, where diverse Islamic sects, including Noor Bakshi, Sunni and Shia, coexist.\nBut this region of Pakistan is also home to more than 7,000 glaciers - the largest number outside the earth’s polar regions.\nThese icy giants are far more than just a breathtaking natural spectacle; they are vital to the local ecosystem.\nThey serve as a crucial source of freshwater, sustaining agriculture and powering electricity generation through the meltwater that feeds into rivers.\nNow, however, their existence is under threat.\nA 2019 study (PDF) published in the Pakistan Geographical Review by Lahore College for Women University, highlights the increasingly unusual behaviour of glaciers in the Karakoram range, compared with glaciers in other parts of the world.\nThe Baltoro Glacier is a particular example. Spanning some 63km (39 miles) in length, the Baltoro is one of the longest glaciers in the world outside the polar regions. Its width varies, but generally ranges from two to three kilometres. The meltwater from the Baltoro Glaciers feeds the Shigar River, which is the main right-bank tributary of the Indus River Valley in the Skardu Valley.\nIt is an essential source of freshwater for this region and beyond, but the study showed that the glacier has been decreasing in size by 0.9 percent each year between 2003 and 2017.\nThe immediate effect of the shrinking glacier is a rise in water levels and even dangerous flooding in the Shigar River.\nLocally, roads have been known to have become completely submerged when water levels rise too high, says Chris Lininger, founder and director of US-based travel company Epic Expeditions, who has been travelling across Pakistan's intricate terrains, including the Baltoro Glacier, since 2018.\n“I actually had a problem coming out of a trip when the floods happened in 2022 because the road was just gone,” he says over a Zoom call. \"Many [locals] are already in a low socioeconomic state, and when this happens, it's catastrophic for them.\"\nBut the extreme long-term effect will be even more deadly - the water will eventually dry up when the glacier is gone.\n‘The mountains don’t care about anyone’\nMuhammad Ali Sadpara's legacy looms large over the landscape surrounding Skardu, from where he braved the harsh conditions of the Baltoro glacier with only second-hand kit. As I imagine the daring paths he must have conquered, I am constantly alert to the risk of slipping and, during the start of this difficult trek, I resist the urge to even look up or around.\nLocally known as Khari Nangsoq, the organic village we are trekking towards, is devoted to the preservation of the region’s traditional lifestyle.\nAs research from the World Wildlife Fund (WWF) highlights, glacial melting here has been occurring since the early 1900s, largely, it says as a result of “human activities” such as industrial farming and burning fossil fuels which release carbon dioxide and other global warming gases into the atmosphere.\nThe organic and traditional farming practices employed by this village are part of an approach aimed at reversing the rise in greenhouse gases.\nIn 2006, the village gained some attention when the United Kingdom's then-Prince Charles, now king, and Prince Karim Aga Khan, the spiritual leader of the Ismaili Muslims, as well as a notable philanthropist and business magnate, visited.\nOur guide escorting us to the village, Abbas, is dressed casually in blue jeans and a white shirt. Alongside him is his 16-year-old son, Yasir Abbas, with a cap playfully turned backwards atop his head and a blue backpack. Together, they carry forward their family’s tour-guiding business here.\nAs father and son lead the way with confident strides, I and my trekking partner, Afzaal Hussain, 34, a digital marketing expert, sport professional and, like me, a curious traveller from Lahore, find ourselves taking baby steps.\n\"The mountains don't care about anyone. Respect them, and they will respect you back. Indeed, each step needs to be soft and cautious,\" says Afzaal.\nAlong the way, we learn more about the melting glaciers. Abbas says he has witnessed firsthand the dramatic changes taking place here. Soon, he worries, there could be a sharp reduction in the amount of water here as a result of the shrinking glaciers. “Without them, without water, our very existence would be at stake. The glaciers are the backbone of our region,\" he adds.\nThis looming crisis in the Hindu Kush Himalayas region, which the International Centre for Integrated Mountain Development (ICIMOD) last year described as a pivotal \"global asset\" and the \"water tower of Asia\" in its own report (PDF), is already becoming apparent.\nIn the summer of 2023, Skardu suffered a rare water shortage when the Satpara Dam, which stores and releases water run-off from the glaciers, ran low. \"Last summer was the first time in my life that I witnessed such a significant water shortage in the Satpara Dam,” Sadpara says. “It's a direct consequence of the melting glaciers and reduced water flow.”\nTen years before, in 2013, Pakistan's Federal Minister for Science and Technology, Zahid Hamid, had addressed the inaugural ceremony of the International Conference on Plants, People, and Climate, and warned: \"By the year 2035, the country will no longer have water reserves in the form of glaciers.\"\nAnd, even before that, a 2008 report from the Pakistan Meteorological Department (PDF), warned that the Siachen Glacier, located in the eastern Karakoram range of the Himalayan mountains and stretching for more than 70km (43 miles), \"has lost about 2km of its length and 17 percent of its ice mass since 1989\".\nOur guide, Abbas, who is intimately familiar with the Siachen and Baltoro glaciers, seems sorrowful when he says, \"I've seen glaciers retreat by at least one kilometre in just a few years.\"\nAs well as guiding visitors to this area, he also actively participates in research initiatives and projects and aims to educate visitors about the fragile ecosystems and environmental challenges facing these majestic landscapes.\nIn July 2018, the Government of Pakistan and the United Nations Development Programme (UNDP), launched a five-year, $37m project to invest in early warning systems, training on glacial lake outburst flooding (GLOF), preparedness and response, and the construction of new protective infrastructure. \"This project operated under my supervision in Skardu,\" Abbas explains. \"I served as their guide for two years, during which they worked directly on these glaciers.\"\nPlastic peril\nThe sun casts a warm, golden hue over the vast expanse of the landscape as we continue our journey along the edgeless tracks. We cross small, rickety wooden bridges that creak under our weight and navigate a sloping, desert-like trail.\nTrees sprout from the sand at odd angles, their roots clinging to the earth, seemingly challenging gravity and adding to the mystical allure of the scenery.\nAs we teeter on along the path, a young boy dressed in a neat school uniform, about eight years old, strides confidently past us at a brisk pace. His heavy backpack, filled with books, does not seem to slow him down.\nHe pauses just ahead of us and tells us proudly, \"This is my way to school in Skardu city every day from my home in Khari Nangsoq.\" Then, seemingly unaware of the changes occurring around him - the retreating glaciers that are slowly reshaping the landscape and threatening the very environment that sustains his community - he joyfully skips off down the trail ahead.\nWe marvel at his ease in navigating this challenging terrain, contrasting sharply with our own heavy breathing, and Abbas explains, \"Because you were born at ground level, your lungs are a normal size. But those of us born at high altitudes have larger lung volumes.\"\nMeanwhile, Yasir picks up rubbish left behind by previous trekkers and puts it in the bin nearby. \"Taking care of our environment is everyone's responsibility, and I want to do my part,\" he says.\nThis might seem a small gesture to some, but rubbish left abandoned on the mountainside is a large part of the problem facing the glaciers.\nWhen plastic rubbish is left lying on the ground or in the shrubbery, it absorbs the heat from the sun and can accelerate glacier melt, according to scientists. Dark-coloured plastics are a particular problem - they absorb more solar radiation, leading to localised heating and melting of the glacier surface.\nAbbas says that when trekkers take horses along the glacier areas, the waste they leave behind stains the pristine ice, causing a permanent discolouration on the land.\n“This reminds us of the lasting impact human activities can have on delicate ecosystems,\" he says.\nLater, after the journey is over, Chris Lininger of US-based Epic Expeditions tells me over a Zoom call that \"Rubbish is a big problem, especially in the Baltoro and Central Karakoram National Park. You see Coca-Cola bottles.\n“During our treks, we also like to organise glacier clean-ups with local porters and pay them to assist. It sends a message that littering isn't acceptable, and it encourages other companies to be mindful, too. It's an ongoing effort,\" he says.\nOne solution would be for tourists to pay a levy to help reduce rubbish, he suggests. \"Nepal collects rubbish deposit payments from expeditions. It's pretty standard, that's how national parks generate income. I also think Pakistan can take an example from Nepal and maybe make the visa process a bit easier and charge more money for the visas as Nepal does and use that money.\n\"There's a magic there and that magic needs to be protected.\"\nLearning from our ancestors\nAs we finally arrive at our destination, a wooden signboard greets us with the words: \"Welcome to the first organic village.\"\nThe air here is noticeably cooler than it was back in Skardu and the sounds of gushing water and birds chirping create a soothing melody.\nTraditional stone-and-wooden houses dot the landscape, complemented by a treehouse restaurant. Small streams of water flow through, undoubtedly from glacier melts, reflecting the community's sustainable lifestyle and close connection to the surrounding environment. The village is surrounded by fields in which the villagers cultivate a variety of organic fruits and vegetables, including apricots, mulberries and potatoes.\nYasir explains, \"This village employs traditional methods of cultivation, relying on bulls and cows instead of modern machinery, to minimise environmental impact.”\nIn addition, the absence of vehicle pollution underscores the village's commitment to environmental sustainability.\nThe villagers keep yaks, sheep and goats which graze freely on the lush green pastures, contributing to the natural balance of the environment and providing valuable resources for the community.\nAs Abbas looks at the animals, he becomes reflective, \"Glacier melting has also put certain species at risk of extinction. For example, the Snow Leopard, which relies on snow and glaciers, is particularly affected.\"\nPakistan is one of only 12 countries that are home to these elusive cats, and 80 percent of their habitat in the country is located in Gilgit-Baltistan. Melting glaciers have reduced the availability of freshwater and disrupted the delicate balance of the ecosystem, impacting the Snow Leopard's prey and habitat.\nAs we explore the organic village, we find various sustainable farming practices, including innovative water conservation and irrigation practices and the use of renewable energy sources, such as solar.\nAbbas introduces us to Hassan, a respected elder who owns the village's only treehouse. He tells us, \"Sustainability is more than a trend here; it's a generational responsibility to protect our unique ecosystem.\"\nWe learn of an ancient potato storage method, through which farmers bury potatoes in the frozen earth before winter, keeping them fresh for months due to the natural insulation. The method is thought to have originated from the region’s harsh winter climate.\nFor now, the organic village of Khari Nangsoq serves as a symbol of hope, resilience and the possibility of a harmonious coexistence between humans and nature. While it may not directly slow down the harm to glaciers, it does highlight the importance of adopting sustainable practices and traditional wisdom when it comes to mitigating the effects of climate change.\nBefore we bid farewell, Hassan treats us to a delicious spread of mulberry jam with bread, thick apricot juice and freshly caught trout from the local glacial streams.\nAs we walk back, Abbas shares his thoughts on the urgent need for global action. \"While it's heartening to see efforts like the organic village, it's crucial for the international community to step up and take collective action. Climate change is a global issue, and we need global solutions.\"\n‘At first, you don’t realise’\nBack at our hotel in Skardu, a diverse group of trekkers has gathered below in the garden, visible through the large glass windows of the dining room where we are sipping our tea.\nWith their gear spread out on the ground, they're preparing for an ambitious 25-day trek in the Karakoram mountain range, along the Baltoro Glacier to the Gondogoro Pass - south of K2, linking the Gondogoro Glacier to the southwest with the Vigne Glacier to the northeast.\nThe trek will be led by Victor Saunders, a distinguished British climber who has completed some of the world's most challenging mountaineering routes.\nIntrigued by the sight of a large group of foreign trekkers - a rarity in Pakistan's tourism landscape - Afzaal decides to head down to the garden, and I join him.\nAround us, the crisp air is filled with the sounds of clinking carabiners, harnesses and helmets. The towering majesty of the mountains and tall green trees form a breathtaking backdrop as conversations begin to unfold.\nAfzaal, carrying a camera around his neck, captures the group with the stunning Karakoram range behind them. \"Seeing so many passionate travellers here gives me hope and excitement for the future of tourism in our country, \" he says. \"It also fosters cultural exchange and understanding.\"\nVictor explains that he has been visiting Pakistan since the 1970s and has also witnessed a great deal of change in the glacial region.\nHis eyes framed by black-rimmed glasses and dressed in a light blue t-shirt, Saunders explains, \"Walking up the Baltoro towards Concordia and K2 Base Camp, you can really see the enormous changes.\n\"The glaciers have definitely receded, they've noticeably gotten thinner,\" he says, with a hint of sadness.\nHe also highlights some of the effects observed in the local community due to the changes in the glacier and landscape.\n\"The routes have changed a little bit. For example, If you go up to Spantik peak from Nagar Valley or from the Hunza area, there were previously villagers with shepherding outlets. For instance, there was one above Hopar in the Nagar Valley that had to be abandoned. The glacier had shifted so significantly that accessing water became impossible for them.\"\nThese outlets, integral to the community's livelihood and local pastoral tradition, not only provide income but are also deeply rooted in the region's culture. The glacier shifts disrupt more than just the environment; they threaten the economy and way of life that has sustained the community for generations.\nVictor explains the glacier's subtle, yet dramatic, changes. \"Unless you're actually looking at the tongue [the narrow, projecting end] of the glacier, you don't really notice. When you look at your old photographs or diaries, you suddenly realise that there's an extra kilometre to walk, and the paths you once walked in have suddenly become much more difficult. You used to be able to first walk into K2 Base Camp just on a flat glacier. Now, when you come to Concordia, you have to cross quite deep ice ravines, ice valleys.\"\nHe likens these changes to \"watching an ageing parent with Alzheimer's, where the changes every year are very small. However, if you were to return after 10 years, the differences would seem very big. It's like what happens when your parents begin to age and become forgetful. At first, you don't realise.\"\n‘A lot of water comes’\n\"I've been trekking to the Baltoro Glacier since 1994, so it's been 30 years now,\" says Wazir, a local guide who will be accompanying Victor's group on their expedition. He is from the district of Shigar, a one-and-a-half-hour drive from Skardu city, speaking in Urdu in the soft Balti accent. Wearing a blue shalwar kameez, he seems to blend seamlessly into the mountainous landscape.\n\"We walk for at least seven to eight hours a day to reach K2 base camp and the glacier points,\" he explains, sitting on the floor and sorting through the climbing gear.\nWorking with Victor for this expedition, Wazir's local expertise is crucial for navigating the challenging terrain.\nHe is also eager to talk about the glaciers and the effect their melting is having on his own community.\n\"Bohat ziyaada paani ata hai,\" he tells us: “A lot of water comes.”\nThe area he lives in near the town of Shigar is surrounded by fields of wheat and potatoes which stretch along the winding riverbanks, he says. But in recent years as the warm months of July and August have arrived, the glaciers have released an overwhelming rush of water which has threatened on occasion to overwhelm the communities there.\n“The water sweeps down from the mountains with incredible force, filling up the Shigar River,” Wazir explains. “It tears away at the land that it has nourished all year, carrying away precious soil, crops, and fields in its path.\nHe is heartbroken, he says, to know that it is the very glaciers which he loves so dearly and which have sustained the communities of his home for so long that are now threatening their existence.\n\"In Shigar, the homes of the people are often destroyed by floods triggered by these glacial melts, sending stones and dirt surging from the river outside. There's little we can do on our own. The government needs to implement strategies to address these issues, but so far, nothing has been done.\"\nThese guides and mountaineers, who are witnessing firsthand the alarming changes to this terrain are the ones ringing the warning bells, demanding global attention, advocacy, and action. As Pakistan's glaciers continue their retreat, the human stories from these icy landscapes serve as reminders of the interconnectedness of human beings, their culture and the environment that sustains - or threatens - them.\nFor our guide, Abbas, these glaciers hold a significance that goes far beyond just supporting livelihoods and sustaining the ecosystem; they are deeply woven into his identity and heritage.\n\"I am a man who grew up around these glaciers,\" he says. \"To me, they're more than just ice and water; they're the backdrop of my childhood, where our water comes from, and a symbol of our connection to the land.\""
    },
    {
      "url": "https://www.popularmechanics.com/home/a65368312/how-trane-is-adapting-to-a-changing-climate/",
      "text": "The humble, deceptively simple heat pump is a bit like a pop singer who scores a hit single after years of anonymously putting the work in, only to get labeled an “overnight success.” But heat pumps have—to paraphrase a musical artist responsible for many hits of his own—been here for years. The first one appeared in the mid-19th century, and they’ve been used in homes for decades.\nNow, as the world grapples with the effects of climate change and rising energy costs, heat pumps are getting their due. And for good reason: A single unit can both heat and cool your home, and it runs on electricity, which removes burning fossil fuels in your home from the equation.\nSuch economic and eco-friendly benefits have pushed heat-pump sales past those of traditional gas furnaces—to the tune of 32 percent more shipped in 2024—and manufacturers are continually refining and improving the machines. Helping lead the way is Trane, a company with decades of experience engineering high-efficiency heat pumps. Its latest models tackle some long-standing issues, while also addressing the emerging complexities of a changing climate. Take a look:\nLower GWP Refrigerant is Making Comfort More Sustainable\nHeat pumps work by moving heat into or out of a space to heat or cool it. They use refrigerant to do this, and that’s the source of one critique of the devices: Refrigerants aren’t derived from fossil fuels, but they do contain fluorocarbons, greenhouse gases that punch above their weight when it comes to trapping heat in the earth’s atmosphere. Trane’s newest heat pumps, such as the 20 TruComfort Variable Speed Heat Pump, address this problem with a next-generation refrigerant, called R-454B, that has a global warming potential (GWP)—which measures the warming effect of greenhouse gases relative to carbon dioxide—78 percent lower than that of traditional refrigerants.\nComfort in Extreme Climates\nWhile heat pumps have been in U.S. homes since the 1950s, they have until recently been most popular in Southern states, where winters may get chilly but not freezing cold. That’s because in particularly cold weather, the units frankly struggled with the “moving heat into the home” part of the heat-pump equation. But Trane has developed a series of new variable-speed heat pumps that can get the job done in bona fide Arctic-blast weather. These premium appliances detect outdoor temperature shifts and adjust accordingly, either speeding up or slowing down to keep your home within half a degree of the temperature you preset either in person or remotely through Trane’s Home app. This allows them to provide 100 percent heating capacity down to an outdoor temperature of approximately 27°F, and an impressive 70 percent capacity when the temperature dips down near 5°F.\nFlex Capacity\nIf you live in an area with extreme temperatures—both hot and cold—you could opt for one of Trane’s hybrid heat pumps, aka dual-fuel heat pumps. They pair an electric heat pump with a gas furnace, and then shift seamlessly between the two depending on the season and the external temperature. The heat pump shoulders most of the work, cooling the home in the summer and regulating the temperature at all times except the coldest periods of winter, when the furnace steps in. The result is an energy-efficient, effective way to heat and cool your home that still significantly reduces reliance on fossil fuels.\nEfficiency Experts\nThe HVAC industry uses several acronyms for its metrics on appliance efficiency. There’s SEER2, or Seasonal Energy Efficiency Ratio, which measures cooling efficiency on a scale from 13 to 25. Trane’s 20 TruComfort Variable Speed Heat Pump with WeatherGuard clocks a lofty 22.4. Then, for heating efficiency, there’s HSPF2, or Heating Seasonal Performance Factor, which runs from 7 to 13. The Trane 20 TruComfort notches a 10.5 there, placing it among industry leaders in both categories.\nWhat all those numbers and letters mean in practice: These levels of efficiency can save you up to 50 percent on your utility bill—remember, a heat pump can replace both your AC and your gas furnace—while potentially reducing your carbon footprint by 38 to 53 percent. Adding to the savings are federal tax credits, state and local rebates, and other incentives that make adding a heat pump both energy- and wallet-efficient.\nWith 60 years of engineering experience in making heat pumps, Trane is uniquely poised to help consumers meet today’s climate and economic challenges. Learn more here."
    },
    {
      "url": "https://www.popularmechanics.com/adventure/outdoors/a62616802/sandy-irvine-boot-everest/",
      "text": "- In June of 1924, mountaineers George Mallory and Andrew Comyn “Sandy” Irvine disappeared during an attempt to be the first people to summit Mount Everest.\n- While Mallory’s remains were discovered in 1999, the ultimate fate of Irvine—as well as whether or not the duo ever successfully reached the summit—remained unknown.\n- Now, National Geographic reports that one of its documentary teams found a boot (complete with severed foot) with a sock labeled “A.C. Irvine.”\nOn June 8, 1924, 22-year-old Andrew Comyn “Sandy” Irvine and fellow mountaineer George Mallory set out to become the first people to ever reach the peak of Mount Everest. They were never seen alive again, and the mountain remained un-summitted until nearly thirty years later in May of 1953, Edmund Hillary and Tenzing Norgay completed what Mallory and Irvine had hoped to accomplish that early June day.\nThe body of George Mallory was found almost a half-century later, discovered in 1999 as part of a Mallory and Irvine Research Expedition. When a photograph of Mallory’s wife (which he planned to leave on the summit) was deemed missing from the mountaineer’s body, it led to a fascinating question—did Irvine and Mallory actually achieve their objective, only to meet their demise on the return trip?\nNow, just over 100 years since the two men departed, a new piece of evidence is entering this century-long drama. National Geographic reports that one of its documentary teams—headed by Oscar-winning director Jimmy Chin—discovered a severed foot and boot belonging to Irvine at the Central Rongbuk Glacier below the north face of Everest. How could they be so sure who the appendage belonged to? Well, “A.C. Irvine” was stitched into the sock. In an interview with National Geographic, Chin was pretty candid about his reaction to this startling discovery: “We were all literally running in circles dropping F-bombs.”\nSeen as one of the greatest mountaineering challenges, the peak of Everest has claimed the lives of at least 340 people since 1921. While a majority of those deaths involve avalanches, falls into crevasses, or medical emergencies, Irvine’s fate has remained one of the most enduring mysteries in the history of Everest expeditions. The first person Chin called upon finding the boot was Irvine’s great-niece Julie Summers, whose father told long told stories of the “mystery of Uncle Sandy on Everest,” The Guardian reported. The Irvine family has agreed to DNA testing to definitively confirm the remains.\n“When Jimmy told me that he saw the name AC Irvine on the label on the sock inside the boot, I found myself moved to tears,” Summers told The Guardian. “It was and will remain an extraordinary and poignant moment.”\nWhile the discovery of Irvine’s boot-clad foot helps paint a clearer picture of the fall that ended the lives of these two intrepid mountaineers, the question remains as to whether they ever successfully made it to the summit. Luckily, there is actually hope that a future search nearby could find Irvine’s body, which should contain a Kodak Vest Pocket Camera that was lent to Irvine by a fellow climber on the 1924 expedition. The undeveloped film inside could contain direct evidence proving whether Irvine and Mallory were truly the first mountaineers to reach the top of the world.\nDarren lives in Portland, has a cat, and writes/edits about sci-fi and how our world works. You can find his previous stuff at Gizmodo and Paste if you look hard enough."
    },
    {
      "url": "https://www.nationalgeographic.com/science/article/news-otzi-iceman-food-DNA-diet-meat-fat",
      "text": "Ötzi the Iceman's stomach wasn't where it was supposed to be. The misplaced organ eluded researchers for some 20 years. But in 2009, while looking at new radiographic scans, they finally found it—inexplicably pushed up under his ribs, where the lower lungs usually sit. What's more, it was completely full.\nSince 1991, when a pair of hikers found the 5,300-year-old hunter in the Ötztal Alps, researchers have been scouring Ötzi's frozen, shriveled form for clues to life in the past and his violent demise. They've studied his sheepskin coat and goat skin tights; scrutinized his tooth decay; ogled his likely frostbite-induced nub on his toe; ruminated over parasitic worm eggs in his gut; and cataloged every tattoo inked on his skin.\nAnd now, after putting the stomach contents through a battery of tests, the researchers determined the ice mummy's final meal: dried ibex meat and fat, red deer, einkorn wheat, and traces of toxic fern. The results, published this week in the journal Current Biology, offer a stunningly detailed peek into an ancient diet and hint at possible food preparation methods.\nThe Lost Stomach\nIn the late 90s, with Ötzi's stomach nowhere to be found, researchers studied the nitrogen isotopes of the mummy's hair for dietary clues, which suggested the Iceman was a vegetarian. Later analysis of his colon contents pointed to Ötzi's omnivorous ways, revealing he ate not only cereals but also red deer and goat meat in the day before his death.\nBut in this latest work, scientists were trying to figure out the exact species that made up the Iceman's last meal. And to do that, they had to sample his stomach.\nThey located the wandering organ by examining Ötzi's gall stones, which form in the gallbladder, a small sack sitting below the liver near the stomach. By lining up the position of surrounding organs in radiographic images, the team finally found the stomach.\nTo sample it, however, scientists had to first defrost the mummy, which is kept at a chilly 21.2 degrees Fahrenheit to prevent microbial invasion. They then used an endoscopic tool to pull 11 blobs of brownish yellow material from his stomach and intestines.\nUnlike the mushy intestinal material, the crumbly stomach stuffs were essentially freeze dried, study author Frank Maixner explains. “It has an interesting appearance, actually,” he says.\nThe research team first took a peek under magnification. “Already under a microscope it was clear it was an omnivore diet,” says Maixner, who is a microbiologist at the Institute for Mummies and the Iceman in Bolzano, Italy. Tiny flecks of undigested fibers of plants and meat were visible in the sample, surrounded by a cloudy haze of fat. The team then began their array of tests, which included DNA, proteins, lipids, metabolites, and more.\nÖtzi's Last Meal\nLipids and protein analysis indicate that Ötzi was eating both muscle and fat of the ibex (Capra ibex), a goat still common in the Ötztal Alps. The high-fat stomach contents would have supported energy-intensive treks. “Even though maybe ibex fat tastes horrible,” Maixner jokes.\nBut curiously, though DNA analysis suggests red deer (Cervus elaphus) was also part of the meal, researchers couldn't figure out what part of the creature Ötzi ate. One possibility is that he consumed its organs, like the spleen, liver, or brain. Degradation may also be an issue. “It's really hard to say,” Maixner says.\nThey could, however, look at meat preparation. By studying the meat's microstructures and chemistry and comparing it to modern cooked and uncooked meats, they surmised Ötzi's meat was not heated above 140 degrees Fahrenheit. It's most likely the meat was dried for preservation, Maixner says, since fresh meat spoils quickly. The presence of carbon flecks also hint the meat could have been smoked.\nÖtzi also ate einkorn wheat and the toxic bracken fern. When eaten in sufficient doses, bracken has been associated with anemia in cattle, and blindness in sheep. It may also have carcinogenic effects. Yet some people still eat small quantities of the plant.\nIt's possible Ötzi also indulged in this greenery. “ You can go as far as he might have treated stomach ache with this fern since we knew that he suffered from some stomach pathogens,” says Maixner. But he adds, “this, for me at least, goes a little bit too far.” Another possibility is that he wrapped his food in fern, accidentally ingesting pieces along with his snack—an idea previously proposed for Ötzi's ingested moss.\nPeeking at the Past Through Ötzi's Stomach\nTogether, the diet shows a well-prepared meal, with some fiber, protein and lots of energy-rich fat. “They had knowledge on making preparing the proper clothes, the proper hunting equipment, and this is also true for the diet,” Maixner says. “They were clearly well prepared.”\nThough it's just a single sample, the results give a surprisingly detailed look into Ötzi's final hours. “I don't know if we're going to get a whole lot better than this,” says Katherine Ryan Amato, a biological anthropologist at Northwestern University who wasn't involved in the work.\nResearchers have long used indirect methods to look at diet, broadly looking at transitions through time, she explains. “This actually lets us get at it on a finer scale and talk about it in more detail,” she says, “which is really exciting.”\nThe events surrounding Ötzi's death are still debated. His many recent wounds point to violent conflict, and some say Ötzi fled into the mountains while being hunted down. But Maixner says that the last meal points to a slightly different story: “I personally think he was prepared for this trek.”\nThe mix of cereals and meats—and just two completed arrows in his deer hide quiver—suggests he hadn't just eaten a fresh kill. Instead, in the hours before his death, Ötzi likely consumed the contents of what Maixner calls “a well-prepared doggy bag.”"
    },
    {
      "url": "https://www.cbsnews.com/news/mount-everest-melting-ice-reveals-climbers-bodies-death-zone-climate-change/",
      "text": "Mount Everest's melting ice reveals bodies of climbers lost in the \"death zone\"\nKathmandu - On Everest's sacred slopes, climate change is thinning snow and ice, increasingly exposing the bodies of hundreds of mountaineers who died chasing their dream to summit the world's highest mountain. Among those scaling the soaring Himalayan mountain this year was a team not aiming for the 29,032-foot peak, but risking their own lives to bring some of the corpses down.\nFive as yet unnamed frozen bodies were retrieved — including one that was just skeletal remains — as part of Nepal's mountain clean-up campaign on Everest and adjoining peaks Lhotse and Nuptse.\nIt is a grim, tough and dangerous task.\nRescuers took hours to chip away the ice with axes, with the team sometimes using boiling water to release its frozen grip.\n\"Because of the effects of global warming, (the bodies and trash) are becoming more visible as the snow cover thins,\" said Aditya Karki, a major in Nepal's army who led the team of 12 military personnel and 18 climbers.\nMore than 300 people have perished on the mountain since expeditions started in the 1920s, eight this season alone.\nMany bodies remain. Some are hidden by snow or swallowed down deep crevasses.\nOthers, still in their colourful climbing gear, have become landmarks en route to the summit.\nNicknames include \"Green Boots\" and \"Sleeping Beauty.\"\nMount Everest body retrievals \"extremely difficult,\" but necessary\n\"There is a psychological effect,\" Karki told AFP. \"People believe that they are entering a divine space when they climb mountains, but if they see dead bodies on the way up, it can have a negative effect.\"\nMany are inside the \"death zone,\" where thin air and low oxygen levels raise the risk of altitude sickness.\nClimbers must have insurance, but any rescue or recovery mission is fraught with danger.\nOne body, encased in ice up to its torso, took the climbers 11 hours to free.\nThe team had to use hot water to loosen it, prising it out with their axes.\n\"It is extremely difficult,\" said Tshiring Jangbu Sherpa, who led the body retrieval expedition. \"Getting the body out is one part, bringing it down is another challenge.\"\nSherpa said some of the bodies still appeared almost as they had at the moment of death — dressed in full gear, along with their crampons and harnesses.\nOne seemed untouched, only missing a glove.\nThe retrieval of corpses at high altitudes is a controversial topic for the climbing community.\nIt costs thousands of dollars, and up to eight rescuers are needed for each body.\nA body can weigh over 220 pounds, and at high altitudes, a person's ability to carry heavy loads is severely affected.\nBut Karki said the rescue effort was necessary.\n\"We have to bring them back as much as possible,\" he said. \"If we keep leaving them behind, our mountains will turn into a graveyard.\"\nBodies are often wrapped in a bag then put on a plastic sled to drag down.\nSherpa said that bringing one body down from close to Lhotse's 8,516 metre peak — the world's fourth-highest mountain — had been among the hardest challenges so far.\n\"The body was frozen with hands and legs spread,\" he said. \"We had to carry it down to Camp Three as it was, and only then could it be moved to be put in a sled to be dragged.\"\nRakesh Gurung, from Nepal's tourism department, said two bodies had been preliminarily identified and authorities were awaiting \"detailed tests\" for the final confirmation.\nThe retrieved bodies are now in the capital Kathmandu, with those not identified likely to be eventually cremated.\nEverest still littered with secrets — and garbage\nDespite the recovery efforts, the mountain still holds its secrets.\nThe body of George Mallory, the British climber who went missing during a 1924 attempt on the summit, was only found in 1999.\nHis climbing partner, Andrew Irvine, has never been found — nor has their camera, which could provide evidence of a successful summit that would rewrite mountaineering history.\nThe clean-up campaign, with a budget of over $600,000, also employed 171 Nepali guides and porters to bring back about 12 tons of garbage.\nFluorescent tents, discarded climbing equipment, empty gas canisters and even human excreta litter the well-trodden route to the summit.\n\"The mountains have given us mountaineers so many opportunities,\" Sherpa said. \"I feel that we have to give back to them, we have to remove the trash and bodies to clean the mountains.\"\nToday, expeditions are under pressure to remove the waste that they create, but historic trash remains.\n\"This year's trash might be brought back by the mountaineers,\" said Karki. \"But who will bring the old ones?\""
    },
    {
      "url": "https://www.popularmechanics.com/science/environment/a65104265/50000-year-old-ice-block/",
      "text": "- Scientists from the Oregon State University conducted chemical analyses on air bubbles trapped within the West Antarctic Ice Sheet Divide ice core.\n- They discovered that, in the last glacial period, Earth experienced its highest CO2 increase: 14 parts per million in just 55 years. Now, our planet experiences that increase every five years.\n- The mechanism of these natural CO2 increases suggest that increasing westerly winds in the Southern hemisphere could weaken the Southern Ocean’s ability to absorb CO2.\nA favorite refrain among the dwindling number of climate deniers is that increases in temperature and carbon dioxide levels are a natural part of the Earth’s atmospheric cycle. And while the planet has certainly seen some rise and falls in both of those metrics over thousands (and even millions) of years, what the planet is currently experiencing far outstrips nearly everything that has come before.\nIn a new study published this week in the journal Proceedings of the National Academy of Sciences (PNAS), scientists from Oregon State University identified the fastest natural rates of CO2 rise over the past 50,000 years. To do this, the research team tapped into bubbles of air trapped in West Antarctic Ice Sheet Divide ice core that essentially preserved the delicate balance of gasses present in Earth’s atmosphere at the time of their icy entombment.\nThe team had to drill some 2 miles deep to get enough ice to study a 50,000 year time span. After conducting an extensive chemical analysis, the researchers discovered just how extreme and outlier the current rising CO2 levels fueling our current climate crisis are compared to the rest of Earth’s recent geologic history.\n“Studying the past teaches us how today is different. The rate of CO2 change today really is unprecedented,” OSU’s Kathleen Wendt, the lead author of the study, said in a press statement. “Our research identified the fastest rates of past natural CO2 rise ever observed, and the rate occurring today, largely driven by human emissions, is 10 times higher.”\nDuring the most recent glacial period, CO2 levels rose 14 parts per million in the span of roughly 55 years—today, a similar increase takes only 5 or 6 years.\nUsually—that is, when humans aren’t sowing the seeds of own climate destruction—the Earth experiences periodic increases in CO2 levels due to an effect known as Heinrich Events. Named after German marine geologist Hartmut Heinrich, these events coincide with a cold spell in the North Atlantic caused by icebergs breaking off from the Laurentide Ice Sheet. This causes a kind of chain reaction that leads to a change in global climate patterns.\n“We think [Heinrich events] are caused by a dramatic collapse of the North American ice sheet,” OSU’s Christo Buizert, a co-author on the study, said in a press statement. “This sets into motion a chain reaction that involves changes to the tropical monsoons, the Southern hemisphere westerly winds and these large burps of CO2 coming out of the oceans.”\nThis small bit about westerly winds is particularly bad news. Climate models suggest that these winds will only increase as the planet warms, meaning the Southern Ocean could lose a lot of its much-needed carbon dioxide-absorbing ability.\nWhile this news is all definitely one big climate bummer, maybe there’s at least some hope that this last vestige of climate denialism will finally face oblivion, and humanity can focus on the hard and necessary work of cleaning up our mess.\nDarren lives in Portland, has a cat, and writes/edits about sci-fi and how our world works. You can find his previous stuff at Gizmodo and Paste if you look hard enough."
    },
    {
      "url": "https://www.popularmechanics.com/science/a60248410/walt-disney-frozen-head/",
      "text": "This story is a collaboration with Biography.com.\nSixty years ago this month, on April 22, 1964, the New York World’s Fair opened in Flushing Meadows–Corona Park in Queens, New York. The Fair had the theme of “Peace Through Understanding,” and was dedicated to “Man’s Achievement on a Shrinking Globe in an Expanding Universe,” as symbolized by the 140-foot-tall stainless-steel globe, known as the “Unisphere,” that towered over a massive reflecting pool.\nThe 1964 World’s Fair wasn’t the first one held in Flushing Meadows; the Unisphere was built on the same ground once occupied by the similarly spherical “Perisphere,” which was constructed for the 1939 World’s Fair. To kick off the 1964 Fair, President Lyndon B. Johnson delivered opening remarks that evoked the ‘39 edition, which imagined the 1960s of the future:\n“The last time New York had a World’s Fair, we also tried to predict the future. A daring exhibit proclaimed that in the 1960s, it would really be possible to cross the country in less than 24 hours, flying as high as 10,000 feet; that an astounding 38 million cars would cross our highways. There was no mention of outer space, or atomic power, or wonder drugs that could destroy disease.”\nBut Johnson’s reflections on human progress weren’t all positive. “No one prophesied that half the world would be devastated by war, or that millions of helpless would be slaughtered,” the President noted, just months after he approved the controversial National Security Action Memorandum 288 escalating the U.S.’s involvement in the Vietnam War. “No one foresaw power that was capable of destroying man, or a cold war which could bring conflict to every continent.”\nJohnson’s presence at the 1964 World’s Fair underscored the somber reality facing America at the time. After all, an assassin’s bullet killed the intended speaker, his predecessor, John F. Kennedy, thrusting him—a representative of Washington D.C.’s “old guard”—into the role intended for JFK, a symbol of the “New Frontier.”\nSo, who could Fair attendees turn to for hopeful visions of “Peace Through Understanding,” and “Man’s Achievement on a Shrinking Globe”? Only one man: Walt Disney.\nDisney, who had been a weekly presence in American homes for the last decade through his television show, Walt Disney’s Disneyland—later titled Walt Disney Presents—created four attractions for the ‘64 World’s Fair. These exhibits were a hit, drawing 135,000 visitors per day during the first season alone, according to The Walt Disney Family Museum.\nDisney’s attractions included “Great Moments with Mr. Lincoln” at the Illinois Pavilion, an animatronic replica of another President who represented hope, and who was also assassinated; “Ford’s Magic Skyway” for the Ford Motor Company, where guests rode in Ford vehicles past animatronic dinosaurs; and the now-iconic “it’s a small world,” which Disney’s Imagineers built in collaboration with Pepsi-Cola as a tribute to UNICEF.\nBut it was the “Carousel of Progress,” located in General Electric’s “Progressland” pavilion, that most epitomized Walt Disney’s vision of the future. The rotating animatronic show guided audiences through the history of human innovation and provided a comforting escape with its optimistic theme song by the Sherman Brothers, promising, “There’s a great, big, beautiful tomorrow/Shining at the end of every day.”\nIn the aftermath of a national tragedy, Walt Disney became a beacon of optimism for fairgoers, and for Americans. His presence fostered a belief in a “great big beautiful tomorrow.”\nPerhaps it’s that enduring optimism that fuels the persistent conspiracy that Disney, who died in 1966, might still be among us, secretly preserved in hopes of one day being revived.\nThe “Final” Years of Walt Disney\nIn 1964, besides contributing to the World’s Fair, Disney also released his most acclaimed live-action film yet: Mary Poppins. Just a few years earlier, during a screening of To Kill a Mockingbird, Disney had reportedly lamented, “That’s the kind of film I’d like to make, but I can’t.” Now, his tender musical adaptation of P.L. Travers’ novel had achieved the same milestone as Universal’s adaptation of Harper Lee’s seminal work: a nomination for Best Picture at the Academy Awards.\nWith his status finally solidified in the entertainment industry, Disney turned his sights to the future—not of his film studio, but of humanity. Intent on using his renowned imagination to forge a brighter tomorrow, Disney envisioned a utopia designed to last forever. In 1964, the future looked bright for Walt Disney.\nIn less than three years, he would be dead.\nOn December 15, 1966, Walt Disney died as a result of complications from lung cancer. As Biography notes, “a private funeral was held the next day, and on December 17, his body was cremated and interred at Forest Lawn Memorial Park in Glendale, California.”\nSome conspiracy theorists, however, believe that Disney’s remains aren’t actually at Forest Lawn. They’ll tell you, according to Biography, that Disney’s body is instead “suspended in a frozen state and buried deep beneath the Pirates of the Caribbean ride at Disneyland in Anaheim, California, awaiting the day when medical technology would be advanced enough to reanimate the animator.”\nWhy Do People Believe Walt Disney Is Frozen?\nThe rumored cryonic freezing of Walt Disney has no clear origin point that Biography could confirm. But its first documented mention is in a 1969 Ici Paris article, reportedly as a prank concocted by “disgruntled animators” who once worked for Disney “seeking to have a laugh at their late taskmasker employer’s expense.” Their motive was seemingly revenge for Disney’s strict oversight, an aftermath of a labor uprising in the late 1930s that is chronicled in depth in The Disney Revolt: The Great Labor War of Animation’s Golden Age.\nInitially, whispers suggested Disney’s entire body was preserved in a secret facility, but soon the tale focused on the animator’s head alone, frozen beneath iconic Disneyland attractions like Pirates of the Caribbean, the Matterhorn, the Partners statue at the center of the park, and even the Magic Kingdom castle. Over time, it seems every corner of Disneyland has been rumored to shelter its founder’s frozen head.\nThe notion of Walt Disney’s icy remains hiding within park attractions might stem from the actual secrets of Disneyland. There is indeed a hidden space at the top of the Matterhorn, but it’s home to a basketball court for bored Disney staff, not a frozen former CEO. And while early versions of Pirates of the Caribbean did feature real skeletons from UCLA’s medical school, according to SFGate, none belonged to Disney himself.\nThe grim idea that only Walt Disney’s head was placed in cryostasis might have caught on due to its eerie, sci-fi feel, with modern cryonics offering both full-body and head-only preservation options. That singular detail adds a creepy wrinkle to the conspiracy, evoking images more akin to the 1962 horror flick The Brain That Wouldn’t Die than the reality of a Hollywood mogul’s legacy.\nNevertheless, the tale of Walt Disney’s “frozen head” persisted, specifically resurfacing in two biographies released years after his death: Leonard Mosely’s 1986 Disney’s World and Marc Eliot’s 1993 Walt Disney: Hollywood’s Dark Prince, which further embedded the legend into popular culture.\nEliot’s controversial biography, which was criticized by Disney’s family and historians alike for its speculative content, included unfounded allegations against Disney, including claims that he was an FBI informant (which evidence suggests he was not), and that he refused to have flags at half mast at Disneyland when JFK died (which photographic evidence disproves). Nevertheless, Hollywood’s Dark Prince fed into a desire to find the dark side of a man often propped up as the symbol of Americana, pushing both the cryonics rumor and the assertions of Disney’s rampant antisemitism (also notably debunked) into the mainstream.\nDisney’s family has firmly denied the rumor that he was cryogenically frozen, and as Biography points out, it has been “further discredited by those pointing to the existence of signed legal documents that indicate Disney was in fact cremated and that his remains are interred in a marked plot (for which his estate paid $40,000) at Forest Lawn, the exact location of which is a matter of public record.” Plus, the first instance of a person being cryopreserved after his death, James Bedford, didn’t occur until nearly a month after Disney’s cremation, debunking the timeline of the rumor that Disney was frozen.\nDiane Disney, Walt’s daughter, wrote in a 1972 biography about her famous father that she “doubted her father had even heard of cryonics.”\nNonetheless, even skeptics who reject the frozen head story might concede that Walt Disney, a famously forward-thinking futurist, could have been aware of cryonics. The concept gained attention in 1964, the same year Disney shifted his focus from film to envisioning his utopian future.\nThe Futurist Who Inspired Walt Disney\nIf you were browsing the “New Releases” shelf at a bookstore in 1964, you might stumble upon an intriguing non-fiction book in between copies of Ernest Hemingway’s A Moveable Feast and the Warren Commission’s The Warren Report: Robert Ettinger’s The Prospect of Immortality.\n“Most of us now living have a chance for personal, physical immortality,” Ettinger claims in the very first sentence. All you need to do, Ettinger says, is join one “established fact” with one “reasonable assumption.”\nThe fact: “At very low temperatures it is possible, right now, to preserve dead people with essentially no deterioration, indefinitely.”\nThe assumption: “If civilization endures, medical science should eventually be able to repair almost any damage to the human body, including freezing damage and senile debility or other cause of death.”\nSix decades later, while we haven’t mastered the art of repairing all human body damage, our cryopreservation methods have advanced significantly, particularly with the introduction of vitrification by Greg Fahy and William F. Rall in the 1980s. And recent scientific advancements suggest that what we currently understand as death might be more reversible than previously thought.\nSome excerpts from Ettinger’s book resonate with the futuristic optimism of Walt Disney’s Tomorrowland. For example, Ettinger writes,“If civilization endures ... if the Golden Age materializes, the future will reveal a wonderful world indeed, a vista to excite the mind and thrill the heart.” However, even if Disney had encountered Ettinger’s work, his imagination had already been sparked by another piece of literature before he died.\nIn May 1960, Horizon magazine published “Out of a Fair, a City,” an article in which architect Victor Gruen envisioned transforming the 1964 World’s Fair site into a domed city to test solutions for societal challenges. According to Imagineer Marty Sklar’s 1999 book, Remembering Walt, Gruen’s philosophy (further elaborated in Gruen’s 1964 work, “The Heart of our Cities: The Urban Crisis, Diagnosis and Cure,”) was a significant influence on Disney during his final years—so much that he began an ambitious plan to build a community in Florida that would “never cease to be a living blueprint of the future.”\nDisney, utilizing land his corporation discreetly bought in Florida, set out to build an “Experimental Prototype Community of Tomorrow” adjacent to his planned East Coast theme park. The community aimed to eliminate traffic jams, offer abundant green spaces, and showcase efficient public transportation with the use of a monorail system.\nAfter Walt Disney’s death, the Florida land earmarked for his future city was transformed into EPCOT, the second theme park at Walt Disney World Resort. EPCOT features a “Future World” section with educational attractions and a World Showcase with international pavilions, operating as a “perpetual World’s Fair.”\nWhy People Want To Believe Walt Disney Is Frozen\nIn his last years, Walt Disney was introspective, focusing not on the “prospect of immortality,” but on a different sentiment. While the 1964 song “Great Big Beautiful Tomorrow” planted the seed in millions of young minds, it was another tune by the Sherman Brothers from the same year that resonated deeply with Disney as he reflected on his life. Richard Sherman recalls:\n“On Fridays, after work, Walt Disney would often invite us into his office and we’d talk about things that were going on at the Studio. After a while, he’d wander to the north window, look out into the distance and just say, 'Play it.' And Dick would wander over to the piano and play 'Feed the Birds' for him. One time just as Dick was almost finished, under his breath, I heard Walt say, 'Yep. That’s what it’s all about.'”\nThere is little left of the 1964 New York World’s Fair in Flushing Meadows—Corona Park. The spot where the “Carousel of Progress” once played in GE’s Progressland is now an athletic field. The Vatican pavilion has been replaced by a stone bench. The Unisphere, however, still remains, towering over a park whose occupants have little memory, or even awareness, of the “Great Big Beautiful Tomorrow” promised at the park 60 years ago.\nFor the Baby Boomers who experienced Disney’s contributions to the 1964 World’s Fair, the event offered hope and a last optimistic vision of the future from “Uncle Walt.” And while today, these visitors can encounter preserved pieces of the Fair at the Queens Museum and experience “it’s a small world” at Disney parks worldwide, they can’t turn that athletic field back into Progressland. And they can’t bring back the man who made it possible.\nWalt Disney’s legacy extends far beyond his films and theme parks. He symbolizes something greater than a sprawling entertainment empire. As biographer Neal Gabler put it in the final pages of Walt Disney: The Triumph of the American Imagination, “he demonstrated how one could assert one’s will on the world at the very time when everything seemed to be growing beyond control and beyond comprehension.”\nFor conspiracy theorists who want to believe Walt Disney is a frozen head, waiting for revival, perhaps it’s because they want to believe he asserted his will over the one thing no one has been able to do before. That maybe, “if the Golden Age materializes,” Walt Disney could even come back to life. And with him would come, once again, the promise of a “Great Big Beautiful Tomorrow.” A promise he made in Queens 60 years ago.\nMichale Natale is a News Editor for the Hearst Enthusiast Group. As a writer and researcher, he has produced written and audio-visual content for more than fifteen years, spanning historical periods from the dawn of early man to the Golden Age of Hollywood. His stories for the Enthusiast Group have involved coordinating with organizations like the National Parks Service and the Secret Service, and travelling to notable historical sites and archaeological digs, from excavations of America’ earliest colonies to the former homes of Edgar Allan Poe."
    },
    {
      "url": "https://www.popularmechanics.com/author/2793/darren-orf/",
      "text": "Darren Orf\nContributing Editor\nDarren lives in Portland, has a cat, and writes/edits about sci-fi and how our world works. You can find his previous stuff at Gizmodo and Paste if you look hard enough.\nScientists Are Mapping the End of the World. And Maybe, Just Maybe, a Way Out.\nPositive climate action can have cascading effects.\nAn AI System Found a New Kind of Physics that Scientists Had Never Seen Before\nScientists had theorized about the possibility of a plasma physics phenomenon, but their AI system discovered the real thing.\nA Company Says It Can Predict Your Baby’s IQ Before Birth. But Where’s the Science?\nThe company released white paper that details how it’ll be able to screen embryos for the likelihood of 17 different diseases. But it only mentioned its IQ predictions on social media.\nScientists Say Ozempic Could Reverse Your Biological Age by 3.1 Years\nWhat can’t it do?\nLightning Might Be Irradiating Our World Without Ever Showing Its Face. Here’s How.\nWe’ve long understood the broad strokes of lightning, but the what kickstarts the process—and allows for some of its weirdest quirks—was a mystery until now.\nScientists Developed ‘Super Steel’ That Could Take Fusion to the Next Level\nTo make fusion reactors, we need materials that can withstand its punishing environment, and a new Chinese-made material can survive reactors’ intense conditions.\nHumans Didn’t Evolve Two Legs to Run, Scientists Say—They Just Wanted Some Mangos\nSome scientists believe humans became bipedal to adapt to climate change, but our closest primate ancestors complicate that picture.\nA Fusion Startup Claims It Can Transform Mercury Into Gold—Meaning Alchemy Could Be Very Real\nIf Sir Isaac Newton’s wildest dream is finally coming true, we could be on the brink of a new type of gold rush.\nScientists Discovered a Way to Reverse Time—and Possibly Erase Mistakes\nThat changes things.\nThis Quantum Entanglement Trick Has Physicists Losing Their Minds\nNew research shows that entangled particles can pass on their shared state again and again and again.\nScientists Built a Cell That Can Keep Time Like a 24-Hour Clock\nThese synthetic cell-like vesicles helped scientists explore the mysteries of our biological clock.\nA Study Says Your Brain Can Travel Through Time. Here’s What It Does to Your Memory.\nRecalling thoughts and feelings when a memory was encoded improved memory recall, but this mental trick has its limits.\nHumanity May Reach Singularity Within Just 5 Years, Trend Shows\nBy one major metric, artificial general intelligence is much closer than you think.\nScientists Are Turning the Earth Beneath Our Feet Into a Giant Battery\nA new technology known as Geochemical Energy Storage (GES) could provide months-long storage for renewable energy, increasing grid reliability.\nScientists Grew a Tiny Brain That Fires Like a 40-Day-Old Fetus\nMimicking multiple parts of the brain, this miniature mind could help scientists investigate a variety of neuropsychiatric disorders.\nA New Hidden State of Matter Could Make Computers 1,000x Faster\nUsing a technique known as “thermal quenching,” scientists made a quantum material that can switch instantly between conductive and insulating states.\nScientists Say Your Body Starts Aging Faster After 50—but Not All Parts at Once\nYour aorta could be aging differently than your adrenal gland, but don’t worry—that's normal!\nThis Plane Is Bigger than a 747. It Can Fly for Months on Its Own.\nPowered by 17,000 solar cells, the Skydweller is an autonomous drone capable of carrying out long-duration missions over seas and conflict zones.\nScientists Created an Antimatter Qubit That Could Upend Physics\nIt won’t make its way into quantum computers, but it could help us understand why the universe is filled with matter.\nArchaeologists Found an Entirely New Language Among the Ruins of an Ancient Empire\nLook for it soon on Duolingo.\nScientists May Have Found Humanity’s Sixth Sense—In Our Gut\nAn ancient bacterial protein known as “flagellin” signals to our neurons in our gut when we’re full, directly showing how our microbiome and brain communicate.\nScientists Are Warning of A Brand-New Kind of Acid Rain\nGetting rid of the “forever chemical” Trifluoroacetic acid, or TFA, found in everything from drinking water to human blood, may be an impossible task.\nAn Entire Hidden Layer of Reality May Be Lurking Just Below the Standard Model of Physics\nThe discovery of the Higgs boson hasn’t led to an explosion of new physics as many predicted. Now, some scientists think that hidden physics may be hiding beyond LHC’s view.\nScientists Found a Ghost Code Hidden in the Human Genome\nAn international team of scientists a family genome sequences known as “transposable elements,” and found they play a vital role in gene expression.\nThe Elusive Aerospike Engine Is Finally Moving From Theory to Reality\nThe aerospike has been considered as a replacement for the bell-shaped nozzle rocket engine for nearly 70 years. The combination of artificial intelligence and 3D printing may finally make it happen.\nThe Magic at the Heart of Quantum Computers Has Finally Worked\nUsing a process known as “magic state distillation” in logical qubits will help make future quantum computers more fault-tolerant.\nA Revolutionary New Drug Could Stop Your Cells From Self-Destructing—And Hit the Pause Button on Aging\nThis could be the first-ever drug approved to treat aging, and clinical trials begin this year.\nScientists Found a Black Hole That Shouldn’t Exist. Now Physics Has a Problem.\nAt 225 solar masses, this gargantuan merger of two black holes challenges our thinking on these famously elusive objects.\nYour Local Airport Might Be Attracting Alien Attention\nIf aliens are out there, then our radar systems are putting on quite an electromagnetic show for them.\nScientists Discovered a New Human Species That Defies Conventional Wisdom\nWelcome to the family.\nTrees Are Growing Rocks Inside Themselves, and It’s Incredible\nTurns out some forests don’t just clean the air—they fossilize it.\nArchaeologists Found an ‘Anomaly’ Near the Pyramids That May Reveal an Ancient Portal\nNew findings beneath the desert floor hint at entrances to long-lost chambers."
    },
    {
      "url": "https://archaeology.org/news/2017/09/12/170912-norway-viking-sword/",
      "text": "OPPLAND, NORWAY—Fox News reports that a well-preserved Viking sword made of high-quality iron was discovered by reindeer hunters at an elevation of 5,381 feet on a mountain in southern Norway. Archaeologist Lars Pilø of Oppland County Council said the cold, dry conditions on the mountain helped to preserve the sword, which had been resting among small loose stones with its blade sticking out. During the winters, the sword would have been covered with snow and ice. The archaeologists and hunters returned to the site with a metal detector, but did not find any additional artifacts. They think the weapon may have been lost some 1,100 years ago by a Viking crossing the rough terrain during a blizzard. For more, go to “Hoards of the Vikings.”\nViking Sword Found on Mountain in Norway\nNews September 12, 2017\nSHARE:\nRecommended Articles\nArtifacts November/December 2015\nViking Sword\n(Ellen C. Holthe, Museum of Cultural History, University of Oslo)\nFeatures July/August 2025\nSetting Sail for Valhalla\nVikings staged elaborate spectacles to usher their rulers into the afterlife\nMuseum of the Viking Age, University of Oslo\nDigs & Discoveries May/June 2023\nThe Road to Runes\n(Alexis Pantos/Museum of Cultural History/University of Oslo)\n-\nLetter From Peru July/August 2017\nConnecting Two Realms\nArchaeologists rethink the early civilizations of the Amazon\n(Courtesy Quirino Olivera Nuñez) -\nArtifacts July/August 2017\nBone Rosary Bead\n(Courtesy Border Archaeology) -\nDigs & Discoveries July/August 2017\nKa-Ching!\n(Courtesy Jersey Heritage)"
    }
  ],
  "argos_summary": "A Viking sword, well-preserved due to cold and dry conditions, was discovered by reindeer hunters at a high elevation in southern Norway. Archaeologist Lars Pilø noted that the sword, made of high-quality iron, likely belonged to a Viking who lost it while crossing the mountainous terrain during a blizzard about 1,100 years ago. Despite returning to the site with a metal detector, no additional artifacts were found.",
  "argos_id": "S8MMC1DSQ"
}