{
  "url": "https://www.foxnews.com/media/msnbc-contributor-rages-trumps-federal-takeover-dc-police-fight-crime",
  "authorsByline": "David Spector",
  "articleId": "c1e5d25075b444178669dfe4894c3f99",
  "source": {
    "domain": "foxnews.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/08/931/523/trump-dc.jpg?ve=1&tl=1",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T19:00:31-04:00",
  "addDate": "2025-08-11T23:13:49.940932+00:00",
  "refreshDate": "2025-08-11T23:13:49.940934+00:00",
  "score": 1.0,
  "title": "MSNBC contributor rages at Trump's federal takeover of DC police to fight crime",
  "description": "President Trump places D.C.'s 3,400 police officers under federal control using emergency powers and proposes legislation to end no-cash bail practices.",
  "content": "An MSNBC contributor had a strong reaction on Monday to President Donald Trump’s announcement that his administration would take over the Washington, D.C. police department, and claimed that the president was trying to distract from the Epstein story. \"I’m trying to hold my temper… you have to understand this within the context of Donald Trump’s racial politics and within the context of his effort to get Epstein off the front pages,\" MSNBC commentator Eddie Glaude said.Trump announced that he was sending 800 National Guard troops to Washington, D.C., and putting the district’s police department under federal control on Monday. He also announced federal legislation to end the practice of no-cash bail, which allows judges to send suspects home from jail without them paying bail. The Metropolitan Police Department’s 3,400 officers will be under the command of DEA administrator Terry Cole. The National Guard troops will be commanded by Army Secretary Dan Driscoll, Secretary of Defense Pete Hegseth announced. Trump vowed to remove homeless encampments popping up around the city and have the U.S. Park Police remove graffiti in the nation’s capital. TRUMP'S PLAN TO DEPLOY NATIONAL GUARD IN DC SPARKS BACKLASH FROM RESIDENTS—BUT SOME WELCOME IT\"He really doesn't really care about what's actually happening in D.C. On a certain level because he's not trying to get at the underlying root causes,\" Glaude continued. The president is allowed to federalize local D.C. police for up to 30 days in the event of an emergency, according to the Home Rule Act which granted the nation’s capital self-governing rights in 1973. Congress can lengthen the president’s emergency powers through a joint resolution. \"Watch them, the police are standing, and they're told not to do anything under any search or this, and you can see they want to get at it. And they're standing there and people are spitting in their face, and they are not allowed to do anything, but now they are allowed to do whatever the hell they want,\" Trump said. Trump has long railed against what he sees as out-of-control crime in the nation’s capital. Metropolitan Police Department data shows that while the homicide rate is falling, the last five years saw the greatest number of murders since 2008. CLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTUREGlaude, a professor of African American Studies at Princeton University, claimed that Trump’s announcement was just an attempt to throw \"red meat\" to his base in an attempt to distract them from the Jeffrey Epstein case. Epstein, a former longtime friend of Trump, former President Bill Clinton and other high-profile individuals, killed himself in federal prison while awaiting trial on sex trafficking of minors charges. Many in the MAGA world have demanded the release of the so-called \"Epstein files,\" while Trump has dismissed the affair as \"pretty boring stuff\" and denounced the \"past supporters\" agitating around it.",
  "medium": "Article",
  "links": [
    "https://www.foxnews.com/politics/trump-claims-dc-crimes-trounce-stats-from-notoriously-violent-cities-worldwide",
    "https://www.foxnews.com/politics/trump-activates-national-guard-troops-address-totally-out-control-crime-washington",
    "https://www.foxnews.com/media",
    "https://www.foxnews.com/video/6376803753112",
    "https://www.foxnews.com/opinion/david-marcus-trump-flunking-his-maga-bases-jeffrey-epstein-test",
    "https://www.foxnews.com/politics/trumps-plan-deploy-national-guard-dc-sparks-backlash-from-residents-but-some-welcome",
    "https://www.foxnews.com/apps-products"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Donald Trump",
      "weight": 0.088024266
    },
    {
      "name": "Trump",
      "weight": 0.082973026
    },
    {
      "name": "local D.C. police",
      "weight": 0.07899453
    },
    {
      "name": "DC police",
      "weight": 0.07233385
    },
    {
      "name": "federal control",
      "weight": 0.06493811
    },
    {
      "name": "Metropolitan Police Department data",
      "weight": 0.064337485
    },
    {
      "name": "Jeffrey Epstein",
      "weight": 0.06428668
    },
    {
      "name": "Metropolitan Police Department",
      "weight": 0.0631657
    },
    {
      "name": "federal prison",
      "weight": 0.06224443
    },
    {
      "name": "Epstein",
      "weight": 0.06087074
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.98095703125
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.93408203125
    },
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.88427734375
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.732421875
    },
    {
      "name": "/News/Other",
      "score": 0.50830078125
    },
    {
      "name": "/Law & Government/Government/Intelligence & Counterterrorism",
      "score": 0.3154296875
    }
  ],
  "sentiment": {
    "positive": 0.039693933,
    "negative": 0.79261607,
    "neutral": 0.16768989
  },
  "summary": "President Donald Trump has announced that his administration will take over the Washington, D.C. police department, under federal control. The move comes amid criticism that it is an attempt by the president to distract from the Jeffrey Epstein case. The Metropolitan Police Department’s 3,400 officers will be under the command of DEA administrator Terry Cole. The National Guard troops will be overseen by Army Secretary Dan Driscoll and Secretary of Defense Pete Hegseth. The president is allowed to federalize local D.c. police for up to 30 days in an emergency, according to the Home Rule Act.",
  "shortSummary": "MSM contributor Eddie Glaude criticized President Donald Trump’s federal takeover of Washington, D.C, to combat crime and distract from the Epstein affair, which led to his resignation.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "067830091e1c4d30812bbdabef09b548",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.foxnews.com/opinion/david-marcus-trump-flunking-his-maga-bases-jeffrey-epstein-test",
      "text": "President Trump once famously quipped that he could shoot a man on 5th Avenue and his strongest supporters would stay with him. For nearly a decade this has seemed true, but today, the president may have stumbled on the exception, in the sickening form of the Jeffrey Epstein case.\nIt turns out that Epstein is a major test for Trump in the eyes of his MAGA warriors. They want real answers from this administration, not fumbled document dumps and dismissive comments from the president himself, as we saw this week.\n10 REASONS THE DOJ AND FBI FACE BACKLASH OVER EPSTEIN FILES FLOP\nNow, we have FBI Deputy Director Dan Bongino who is apparently threatening to resign over the debacle, if Attorney General Pam Bondi doesn’t go first and a bewildered MAGA base that feels it is being insulted and lied to by its government, again.\nTo be sure, Epstein was an awful human being who preyed on poor underage girls for decades, according to testimony from the Ghislane Maxwell trial (which I covered in the courthouse), as well as a wealth of other evidence. But for most Americans, his crimes and suspicious death are a mere curiosity at this point.\nIt is much, much more for hard-core MAGA. For them, it is nothing less than a test to determine whether or not the Swamp that has lied to our faces for decades is still in control.\nThis week, Steve Bannon said the only way the Epstein story goes away is if \"the 5 to 10 to 15 percent of the Trump movement, the Pepes and hardcores,\" finally just say, \"I’ve had enough of it.\" He added that the basic question is, \"who is running the country?\"\nLikewise, at the TPUSA convention in Florida this weekend, which is led by Trump ally Charlie Kirk and is as pure a distillation of the core MAGA movement as exists, my sources tell me that Epstein is very much the top topic of concern.\nBut why did this curious case of this infamous creep and his private island become a synecdoche for all government lies in the mind of MAGA? In other words, how did Epstein become the symbol of deep government corruption?\nFor one thing, the notion Epstein was allowed to kill himself inside a federal prison has always strained credulity. From missing video to conflicting medical exams, there have been legitimate questions about how a man rumored to have damaging information on powerful people and ties to the intelligence community could turn up dead in federal custody. While officials assured the nation there was nothing to see, MAGA seethed. \"Epstein didn't kill himself\" became not just a meme and a mantra, but a declaration that we've been gaslit by our government.\nThere is also the matter of Bondi seeming to indicate that there was an Epstein client list in a Fox News Channel interview, only to now say it doesn’t exist. She says she was talking about the file writ large, but it didn’t sound that way at the time.\nBongino, in recent weeks, along with FBI Director Kash Patel, told us that a video from the prison is proof positive that this was suicide, but it turns out there was a missing minute of footage, and the video may have been doctored.\nThis was after Bondi all but hijacked a group of influencers in the spring at the White House, handing out binders purporting to share new bombshell information that turned out to be as exciting as a list of grandma’s baking recipes.\nOn top of all of this, we have President Trump himself, visibly annoyed in the White House, this week when asked about Epstein, \"Are you still talking about this guy…this creep?\" Trump asked. Well, yes, Mr. President, they are.\nAll in all, the administration's handling of the Epstein case has been about as transparent as a brick wall, one that appears to be crumbling.\nTrump has expressed concern in the past about innocent people being listed in Epstein documents, as happened to attorney Alan Dershowitz and others, and according to Elon Musk, both Trump and Bannon appear in this evidence, though Musk offers no proof of this.\nCLICK HERE FOR MORE FOX NEWS OPINION\nThis may be a reasonable concern, but after decades of blatant lies and stalled prosecutions of Epstein, Trump’s hardcore supporters want more than assurances. They want to see the documents. They want to see everything.\nAnd this is a central part of Trump’s appeal, his promise to open up the hood and expose the broken-down, deep-state engine of government. But promises are not enough. Where are the results? When are we going to Fort Knox as promised, for example?\nA breathtaking hallmark of the second Trump term has been extreme transparency. The president takes questions almost daily, and answers with candor. Except, it seems, when it comes to Jeffrey Epstein.\nCLICK HERE TO GET THE FOX NEWS APP\nFor a quarter-century now, the Epstein case has been a combustible cocktail of power, greed, private islands and sexual abuse. It has ushered in both careful examination and wild conspiracy theories, and the only way to separate the two is with complete sunlight onto the evidence.\nFor President Trump, this may be the first time he is risking the loyalty of his longest, strongest supporters, and for a populist political movement that is pure poison.\nThe time to release everything is now, the future of MAGA may depend on it."
    },
    {
      "url": "https://www.foxnews.com/politics/trump-activates-national-guard-troops-address-totally-out-control-crime-washington",
      "text": "President Donald Trump announced Monday that he is activating approximately 800 National Guard troops and is taking over the Metropolitan Police Department to tackle crime in Washington, after beefing up federal law enforcement presence in the nation's capital Saturday.\n\"I'm deploying the National Guard to help reestablish law, order and public safety in Washington, DC,\" Trump told reporters at a Monday press conference. \"And they're going to be allowed to do their job properly.\"\nTrump also said that he would federalize the Metropolitan Police Department in Washington to respond to crime, placing it under the authority of Attorney General Pam Bondi.\nNational Guard troops are reserve forces that are mobilized in response to state and federal operations, including natural disasters, and are typically overseen by their respective state governments. However, Trump controversially deployed National Guard troops from California to respond to immigration riots in June, bypassing California Gov. Gavin Newsom to dispatch the troops.\nThe federal government oversees the District of Columbia National Guard.\nSecretary of Defense Pete Hegseth said that Secretary of the Army Dan Driscoll will operationalize the D.C. National Guard, and signaled that more National Guard troops could be roped into the deployment down the line.\n\"You will see them flowing into the streets of Washington in the coming week,\" Hegseth told reporters Monday. \"At your direction as well, sir, there are other units we are prepared to bring in. Other National Guard units, other specialized units. They will be strong, they will be tough, and they will stand with their law enforcement partners.\"\nTrump’s remarks come just after he promised Washington would be \"LIBERATED\" from \"Crime, Savagery, Filth, and Scum\" in a post on Truth Social Monday morning. He said in the post that the \"days of ruthlessly killing, or hurting, innocent people, are OVER!\"\nTrump floated the idea of taking over Washington’s Metropolitan Police Department and utilizing National Guard troops to manage crime in Washington Wednesday, following the assault of a former Department of Government Efficiency (DOGE) staffer on Aug. 3 in Washington’s Logan Circle.\nTRUMP THREATENS TO FEDERALIZE DC AFTER EX-DOGE EMPLOYEE 'BIG BALLS' VIOLENTLY BEATEN\n\"What a shame – rate of crime, the rate of muggings, killings and everything else, we’re not going to let it, and that includes bringing in the National Guard, maybe very quickly, too,\" Trump told reporters Wednesday at the White House.\nTrump also told reporters at the time he was open to taking over Washington’s Metropolitan Police Department because crime in the nation’s capital is \"ridiculous.\"\nWhile a temporary federal takeover of the Metropolitan Police Department is justified in cases of emergency, Trump's move will likely be challenged in court over whether the situation in Washington qualifies as an emergency.\nTrump has historically railed against violence in Washington, and said Tuesday that crime is \"totally out of control\" in the nation's capital.\nMeanwhile, crime in Washington is on the decline. Violent crime is down 26% this year, in comparison to the same timeframe in 2024, according to Washington’s Metropolitan Police Department. Likewise, assaults with a dangerous weapon are down 20%, and homicides are down by 12%.\nWATCH: TRUMP HINTS HE WILL FEDERALIZE DC SOON, BRING IN NATIONAL GUARD AFTER ‘BIG BALLS’ ATTACK\nWashington’s Mayor Muriel Bowser challenged Trump’s description of the city during an interview with MSNBC Sunday, and voiced concerns about the possibility of activating the National Guard to tackle the city’s crime.\n\"Any comparison to a war-torn country is hyperbolic and false,\" Bowser said.\nCLICK HERE TO GET THE FOX NEWS APP\n\"I’m concerned about them not being used efficiently, and I just think that’s not the most efficient use of our Guard,\" Bowser said.\nThe Associated Press contributed to this report.\nThis is a breaking news story and will be updated."
    },
    {
      "url": "https://www.foxnews.com/apps-products",
      "text": "Fox News is Everywhere.\nWatch Fox News Channel on all of your devices to keep up to date with the latest in news, politics, entertainment and more. On phones, tablets, wearables and TV, it's easy to stay connected anywhere.\niOS Devices\nAndroid Devices\nApple TV\nRoku\nChromecast\nAndroid TV\nAmazon Fire\nFubo TV\nApple Watch\nAmazon Echo\nGoogle Home\nFox News Go\nApple News\nAT&T TV Now\nYouTube TV\nHulu\nFacebook\nInstagram\nSamsung Devices\nSling TV\nVidgo\nSpotify\niHeartRadio\nFlipboard\nLinkedIn\nGoogle Newsstand\nNewsletters\nYouTube\nFAQ\nHow much data does Fox News Go use?\nFox News Go uses about 2GB per hour of SD viewing and 4GB per hour of HD viewing. This can vary depending on your device and internet connection. If you are concerned about your data usage we recommend not streaming over a cellular network and contacting your Internet or Cellular Service Provider.\nWhat broadcast quality will I get while streaming on my device?\nFox News will stream at the highest quality possible based on your device and internet connection quality. For the best quality we recommend streaming via Wi-Fi or 4G.\nWhat channels are available on Fox News Go?\nYou can Watch Fox News Channel on Fox News Go and Fox Business Channel on Fox Business Go"
    },
    {
      "url": "https://www.foxnews.com/politics/trumps-plan-deploy-national-guard-dc-sparks-backlash-from-residents-but-some-welcome",
      "text": "President Donald Trump shared new details on Monday about his plan to take control of public safety in Washington, D.C., following a brutal attack on a former Department of Government Efficiency (DOGE) staffer, but D.C. residents aren't convinced.\nTrump announced on Monday that he is activating the District of Columbia National Guard and seizing control of the Metropolitan Police Department after floating the idea since last week's assault in Washington’s Logan Circle.\nSome Washington residents who spoke to Fox News Digital called it a \"terrible idea\" that \"doesn't make a lot of sense.\"\n\"I think D.C. politics should stay with D.C., and, unfortunately, the federal government is apparently overstepping their bounds right now, so I hope that D.C. is allowed to govern itself, as well as police itself,\" one Washington resident told Fox News Digital ahead of Trump's announcement.\nTRUMP IS THREATENING TO 'FEDERALIZE' DC WITH NATIONAL GUARD AND MORE. HERE'S HOW THAT COULD PLAY OUT\nTrump controversially federalized the California National Guard amid anti-ICE protests that delved into riots in Los Angeles in June. Protesters were rejecting the U.S. Immigration and Customs Enforcement (ICE) deportations and Trump's robust immigration crackdown.\nThe president bypassed Gov. Gavin Newsom's authority to deploy National Guard troops to support ICE deportation. It was the first time a president federalized the National Guard without the governor's request in more than 60 years.\nNow, the tension between local and federal powers is unfolding in the nation's capital. But just like in California, many Washington residents have concerns about seeing \"troops on our streets.\"\n\"We have laws for a reason,\" one resident told Fox News Digital.\n\"Privatizing security is a terrible idea, and I think anything that Trump does is garbage,\" another Washington resident added.\nDespite their apprehension about National Guard troops patrolling the nation's capital, many residents said something needs to be done to address crime in Washington, D.C.\nWhile the Department of Justice indicated a 30-year low in violent crime last year, concerns about the city's safety linger, with one resident telling Fox News Digital, \"The city is getting dangerous.\"\n\"I think it's a good idea,\" one resident said of Trump's new plan. \"It's something that needs to be done for the city to be safe. Right now, we're not safe. The kids and the teenagers are doing everything. So yeah, I think that's a great idea.\"\nAnd another Washington resident said, \"We need all the protection that we can get in the city, because the city is really getting dangerous,\" telling Fox News Digital that she has to \"make sure to come home before sundown\" and she is afraid of getting robbed when she gets off public transportation.\n\"Things do seem out of control and desperate, but I don't know what kind of numbers to take, what numbers to read. One minute they'll say crime is out of control. Next minute, they will say crime is down a certain percentage. It's kind of confusing, and I don't know who to believe in and which way to go, to be honest,\" a Washington resident said, articulating the dichotomy between the low crime statistics and the alarming crime stories.\nBut another D.C. resident said, \"There's no way he should be in control of anything,\" and Washington, D.C., \"should be a state,\" so the district has more power to make decisions for itself.\n\"I don't think it's necessary,\" another Washington resident added. \"I do think there needs to be some change within [the] Metropolitan [Police Department] because safety is an issue.\"\nCLICK HERE TO GET THE FOX NEWS APP\nShe added: \"It needs to be localized.\"\nFox News Digital's Diana Stacy contributed to this report."
    },
    {
      "url": "https://www.foxnews.com/politics/trump-claims-dc-crimes-trounce-stats-from-notoriously-violent-cities-worldwide",
      "text": "President Donald Trump claimed crimes in Washington, D.C., trounce data from notoriously violent cities in nations such as Mexico and Colombia during his Monday morning press conference announcing he is federalizing the D.C. police department to curb spiraling violence.\n\"The murder rate in Washington today is higher than that of Bogota, Colombia, Mexico City, some of the places that you hear about as being the worst places on Earth, much higher,\" Trump said Monday. \"This is much higher. The number of car thefts has doubled over the past five years, and the number of carjackings has more than tripled. Murders in 2023 reached the highest rate, probably ever. They say 25 years, but they don't know what that means because it just goes back 25 years can't be worse.\"\nTrump whipped out charts showing the media that the nation's capital allegedly suffers worse crime trends than other cities worldwide, calling on them to \"take a look at numbers\" as he rattled off the data's findings.\n\"Look at these. Baghdad is … we doubled up on Baghdad. Panama City, Brasilia, San Jose, Costa Rica, Bogota, Colombia. Heavy drugs. Mexico City, I mentioned Lima, Peru, all double and triple what they are. So do you want to live in places like that? I don't think so. I don't think so. And I think the people in this room, if you wrote correctly, you'd see. Look at the kind of numbers we have. D.C. 41 per 100,000 (for homicides in 2023). Number one that we can find anywhere in the world. Other cities are pretty bad, but they're not as bad as that. That the way you want to live? The reporters of the world? Juvenile offenders and crimes against persons as they say, it's getting worse, not getting better. It's getting worse,\" he continued.\nTRUMP IS THREATENING TO 'FEDERALIZE' DC WITH NATIONAL GUARD AND MORE. HERE'S HOW THAT COULD PLAY OUT\nThe White House directed Fox Digital to a pair of graphs published on the White House Rapid Response's X account on Monday when asked for copies of the charts, data and its citations. The graphs published to X show D.C.'s murder rate in 2024 sat at 27.54 per 100,000, according to FBI data – reportedly higher than the stats in cities such as Bogota and Mexico City.\nThe nation overall saw an uptick in violent crimes in 2020, when protests and riots broke out in cities across the nation at the height of the pandemic. That year notched a nearly 30% increase in murders compared to the year prior, according to FBI data, marking the largest single-year increase in killings since the agency began tracking the crimes.\nThe nation's capital in the following years has been rocked by shootings that have left innocent children shot and dead, a trend of juveniles committing carjackings that have turned deadly in some cases, shoplifting crimes and attacks on government employees, summer interns and others, including the fatal shooting of 21-year-old congressional intern, Eric Tarpinian-Jachym, in June.\nWASHINGTON, DC IS MORE DANGEROUS THAN THE CAPITALS OF MANY THIRD-WORLD COUNTRIES, SENATOR SAYS\nTrump announced Monday that he was federalizing the local police department starting Monday under section 740 of the District of Columbia Home Rule Act, which allows the president to assume emergency control of the capital's police force.\nCLICK HERE TO GET THE FOX NEWS APP\n\"This is Liberation Day in D.C., and we're going to take our capital back,\" he said. \"We're taking it back under the authority vested in me as the president of the United States, I'm officially invoking section 740 of the District of Columbia Home Rule Act. You know what that is. And placing the D.C. Metropolitan Police Department under direct federal control. … In addition, I'm deploying the National Guard to help reestablish law, order and public safety in Washington, DC. And they're going to be allowed to do their job properly.\""
    }
  ],
  "argos_summary": "President Donald Trump announced the federal takeover of the Washington, D.C. police department and the deployment of 800 National Guard troops to address rising crime, claiming the city's crime rates surpass those of notorious cities worldwide. MSNBC contributor Eddie Glaude criticized Trump's actions as a distraction from the Jeffrey Epstein case, suggesting it serves to rally his base rather than address underlying issues. While some residents support the move for increased safety, others express concerns about federal overreach and the effectiveness of such measures.",
  "argos_id": "T1V5I2BJ9"
}