{
  "url": "https://www.reuters.com/business/healthcare-pharmaceuticals/us-cdc-tightens-safety-measures-after-gunman-kills-officer-atlanta-2025-08-11/",
  "authorsByline": "Dan Levine, Deena Beasley",
  "articleId": "10c7bf6cfe2f44ed92fb763fde98c8ca",
  "source": {
    "domain": "reuters.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://www.reuters.com/resizer/v2/6A6OWWR7PZNINBZUOM4SMEANJI.jpg?auth=f90ae242d5a400f767492eb2911f66be5ce9915b9cef596504b814b63eef6578&height=1005&width=1920&quality=80&smart=true",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T17:04:17.608000+00:00",
  "addDate": "2025-08-11T19:55:34.572013+00:00",
  "refreshDate": "2025-08-11T19:55:34.572014+00:00",
  "score": 1.0,
  "title": "US CDC tightens safety measures after gunman kills officer in Atlanta",
  "description": "The U.S. CDC has tightened security following an attack Friday on its Atlanta headquarters that left a police officer and the gunman dead, including having employees work from home on Monday and removing vehicle decals showing where they work.",
  "content": "Aug 11 (Reuters) - The U.S. CDC has tightened security following an attack Friday on its Atlanta headquarters that left a police officer and the gunman dead, including having employees work from home on Monday and removing vehicle decals showing where they work.\n\nThe union representing workers at the U.S. Centers for Disease Control and Prevention said the violence \"compounds months of mistreatment, neglect, and vilification that CDC staff have endured,\" citing reports that the gunman blamed the Covid-19 vaccine for making him depressed and suicidal.\n\nSince being named Health and Human Services Secretary earlier this year, Robert F. Kennedy Jr. has targeted vaccine policy , and in May withdrew a federal recommendation for Covid shots for pregnant women and healthy children.\n\nKennedy will visit the CDC campus in Atlanta on Monday, according to a source familiar with the plans.\n\n\"No one should face violence while working to protect the health of others,\" Kennedy Jr. said in a post on X on Saturday.\n\nA source briefed on the matter told Reuters that 189 rounds of gunfire had hit the CDC buildings during the attack, 85 windows were broken and over 100 doors destroyed, among other damage.\n\nThe Atlanta Police Department referred calls to the Georgia Bureau of Investigation, which did not have an immediate comment.\n\nBoth local and federal law enforcement are \"conducting intensive monitoring of all potential threats to CDC and its staff,\" the agency's acting Chief Operating Officer Christa Capozzola said in an email to staff over the weekend that was seen by Reuters.\n\nShe said work was under way to clean up and repair extensive damage to the CDC's campus by the shooter who, according to the investigation so far, acted alone.\n\nAn \"all-staff\" meeting on Tuesday will become a virtual-only event, CDC Director Susan Monarez said in a separate email to employees seen by Reuters. She said teams were working hard to determine \"our workplace posture\" moving forward.\n\nThe agency's safety division asked employees to remove CDC-identifying decals from their vehicles, an email seen by Reuters showed.",
  "medium": "Article",
  "links": [
    "https://x.com/SecKennedy/status/1954197860754350238",
    "https://www.reutersagency.com/en/licensereuterscontent/?utm_medium=rcom-article-media&utm_campaign=rcom-rcp-lead",
    "https://www.thomsonreuters.com/en/about-us/trust-principles.html",
    "https://www.afge2883ga.org/post/in-solidarity-after-the-cdc-roybal-shooting",
    "https://www.reuters.com/business/healthcare-pharmaceuticals/medical-groups-us-states-work-circumvent-kennedys-vaccine-decisions-2025-07-24/",
    "https://www.pbs.org/newshour/nation/cdc-shooter-believed-covid-vaccine-was-harmful-union-says-misinformation-put-staff-at-risk"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "CDC staff",
      "weight": 0.108315594
    },
    {
      "name": "CDC",
      "weight": 0.09567613
    },
    {
      "name": "US CDC",
      "weight": 0.09380318
    },
    {
      "name": "CDC Director Susan Monarez",
      "weight": 0.091419965
    },
    {
      "name": "Robert F. Kennedy Jr.",
      "weight": 0.0735299
    },
    {
      "name": "Kennedy Jr.",
      "weight": 0.07060465
    },
    {
      "name": "staff",
      "weight": 0.06359937
    },
    {
      "name": "Atlanta",
      "weight": 0.059992462
    },
    {
      "name": "vaccine policy",
      "weight": 0.059977673
    },
    {
      "name": "vehicle decals",
      "weight": 0.058719255
    }
  ],
  "topics": [
    {
      "name": "Crime"
    },
    {
      "name": "CDC"
    }
  ],
  "categories": [
    {
      "name": "Business"
    },
    {
      "name": "Health"
    },
    {
      "name": "General"
    }
  ],
  "taxonomies": [
    {
      "name": "/Sensitive Subjects/Death & Tragedy",
      "score": 0.958984375
    },
    {
      "name": "/News/Other",
      "score": 0.95361328125
    },
    {
      "name": "/Sensitive Subjects/Violence & Abuse",
      "score": 0.87744140625
    },
    {
      "name": "/News/Local News",
      "score": 0.71337890625
    },
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.66162109375
    },
    {
      "name": "/Sensitive Subjects/War & Conflict",
      "score": 0.333740234375
    }
  ],
  "sentiment": {
    "positive": 0.037667196,
    "negative": 0.7859362,
    "neutral": 0.1763966
  },
  "summary": "The U.S. Centers for Disease Control and Prevention (CDC) has tightened security following a Friday attack on its Atlanta headquarters that left a police officer and the gunman dead. The union representing workers at the CDC described the incident as \"months of mistreatment, neglect, and vilification\" that the gunman attributed to the Covid-19 vaccine. Since being named Health and Human Services Secretary, Robert F. Kennedy Jr. has criticized vaccine policy and has withdrawn a federal recommendation for the drug treatment. The attack left 189 rounds of gunfire and 85 windows broken, and over 100 doors destroyed.",
  "shortSummary": "The US CDC has tightened security following a fatal shooting at its Atlanta headquarters, prompting employee to work from home and remove vehicle decals.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "b5b7a7577e3c4876b33f08d44921c70b",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.afge2883ga.org/post/in-solidarity-after-the-cdc-roybal-shooting",
      "text": "In solidarity after the CDC Roybal Shooting\n- AFGE 2883 Executive Committee\n- 16 hours ago\n- 4 min read\nUpdated: 18 minutes ago\nTo our CDC colleagues,\nWe are heartbroken and outraged by the traumatic violence that unfolded yesterday afternoon at CDC’s Roybal Campus, in which DeKalb County Police Officer David Rose was killed in the line of duty while courageously protecting his community and saving lives. We honor his service and will forever remain deeply indebted to his family for his heroism.\nThis tragedy was not random and it compounds months of mistreatment, neglect, and vilification that CDC staff have endured. The deliberate targeting of CDC through this violent act is deeply disturbing, completely unacceptable, and an attack on every public servant. Early reports indicate the gunman was motivated by vaccine disinformation, which continues to pose a dangerous threat to public health and safety.\nSome of you were trapped in various buildings throughout campus well into the late evening hours, including the 90+ children locked down inside CDC's Clifton School. Those of us not directly part of the lockdowns watched in fear for our colleagues as the events unfolded. The terror, the uncertainty, and the trauma of what happened, as well as what could have happened, are still very present. Trauma doesn’t end once the lockdown is lifted.\nAFGE Local 2883 stands with you. We see your fear, anger, and exhaustion. We share it.\nWe are here to defend each other through concrete and comprehensive action. This attack violated our collective safety. We will not accept this as “business as usual,” and temporary fixes won't cut it. You deserve more.\nMany of you are probably asking—what happens next and what will be done? We are, too.\nWe promise this: AFGE Local 2883 will not stop fighting for your safety, your dignity, and your healing.\nWe are committed to advocating for:\nFlexible leave, expanded telework, and remote options for those who need time to process and heal, while not forcing those who still feel unsafe back into the office before they’re ready.\nSafe and delayed return to the office. Staff should not be required to return to the office until the windows and buildings are fixed and completely secure. Staff should not be required to work next to bullet holes. Forcing a return under these conditions risks re-traumatizing staff by exposing them to the reminders of the horrific shooting they endured. A safe and psychologically supportive workspace must be prioritized before resuming in-person work.\nFair and comprehensive telework policies across all CDC campuses and divisions, recognizing that the threat and fear extend beyond one campus.\nAccess to trauma-informed mental health resources. CDC’s Employee Assistance Program (EAP), while a valuable resource, is understaffed and intended for short-term assistance only. CDC staff need access to meaningful, ongoing care.\nA clear and unequivocal stance in condemning vaccine disinformation by CDC and HHS leadership. Their leadership is critical in reinforcing public trust and ensuring that accurate, science-based information prevails. This condemnation is necessary to help prevent violence against scientists that may be incited by such disinformation.\nPerimeter security on all campuses until a full investigation is completed and findings are shared transparently with staff.\nComplete transparency around building repairs, reopening timelines, and safety upgrades.\nA seat at the table for 2883 when decisions are being made about employee safety. As CDC employees ourselves, we can represent the voices and concerns of affected employees.\nClear, compassionate communication from leadership, with space for staff to voice their thoughts, concerns, and experiences.\nCongressional action to end the reckless politicization of federal employees and hold leaders accountable for rhetoric that incites hostility and vilifies public servants.\nCongressional support to provide dedicated funding for workplace safety upgrades and comprehensive trauma recovery programs for federal workers.\nThis list is not complete. If there’s something you need, something we’ve missed, or something you want to see prioritized, please tell us. Your voice matters, and we are listening. Please feel free to share your thoughts with us by emailing: info@afge2883ga.org or completing this anonymous form.\nWe will be replacing our regular monthly union meeting with a space for collective support. A licensed clinical psychologist with expertise in immediate response after mass violence and shootings will be present to guide and support. This space is open to all who need a moment to process, reflect, or simply be in community. We will send out details and meeting link soon.\nPlease be aware of some of the immediate resources available to you, such as:\nNational Mass Violence Center’s (NMVC) free self-help app, Transcend NMVC, is available free on Apple and Android\nNMVC’s Virtual Resiliency Center\nNMVC’s Twelve Self-Help Tips for Coping in the Aftermath of Mass Violence Incidents\nSAMHSA’s Coping with Grief After a Disaster or Traumatic Event\nSAMHSA’s Tips for Survivors of a Disaster or Other Traumatic Event\nSAMHSA’s Tips for Talking With and Helping Children and Youth Cope After a Disaster or Traumatic Event\nNMVC’s How to Identify an Experienced Trauma-Focused Therapist\nRecovery in the Aftermath of Workplace Violence: Guidance for Workers\nMental Health America’s Coping with Gun Violence\nAmerican Psychological Association’s Managing your distress in the aftermath of a shooting\nEverytown Survivor Network’s Resources for Victims and Survivors of Gun Violence\nSandy Hook Promise’s Help for Victims and Survivors of Gun Violence\nThe 988 mental health hotline: free, confidential support 24/7 via call, text, or chat\nWe are working to provide additional resources as soon as we can.\nIn solidarity and community,\nAFGE Local 2883"
    },
    {
      "url": "https://www.pbs.org/newshour/nation/cdc-shooter-believed-covid-vaccine-was-harmful-union-says-misinformation-put-staff-at-risk",
      "text": "By — Susan Haigh, Associated Press Susan Haigh, Associated Press Leave your feedback Share Copy URL https://www.pbs.org/newshour/nation/cdc-shooter-believed-covid-vaccine-was-harmful-union-says-misinformation-put-staff-at-risk Email Facebook Twitter LinkedIn Pinterest Tumblr Share on Facebook Share on Twitter CDC shooter believed COVID vaccine was harmful; union says misinformation put staff at risk Nation Aug 10, 2025 12:26 PM EDT A Georgia man who had blamed the COVID-19 vaccine for making him depressed and suicidal has been identified as the shooter who opened fire late Friday on the U.S. Centers for Disease Control and Prevention headquarters, killing a police officer. The 30-year-old suspect, who died during the incident, had also tried to get into the CDC’s headquarters in Atlanta but was stopped by guards before driving to a pharmacy across the street and opening fire, a law enforcement official told The Associated Press on Saturday. READ MORE: Authorities identify suspect who opened fire at CDC in Atlanta, killing one police officer The man, identified as Patrick Joseph White, was armed with five guns, including at least one long gun, the official said, speaking on condition of anonymity because they were not authorized to publicly discuss the investigation. A union representing workers at the CDC said the incident was not random and “compounds months of mistreatment, neglect, and vilification that CDC staff have endured.” It demanded federal officials condemn vaccine misinformation, saying it was putting scientists at risk. Here’s what to know about the shooting and the continuing investigation: An attack on a prominent public health institution Police say White opened fire outside the CDC headquarters in Atlanta on Friday, leaving bullet marks in windows across the sprawling campus. At least four CDC buildings were hit, Director Susan Monarez said on X. DeKalb County Police Officer David Rose was mortally wounded while responding. Rose, 33, a former Marine who served in Afghanistan, had graduated from the police academy in March. White was found on the second floor of a building across the street from the CDC campus and died at the scene, Atlanta Police Chief Darin Schierbaum said. He added that “we do not know at this time whether that was from officers or if it was self-inflicted.” The Georgia Bureau of Investigations said the crime scene was “complex” and the investigation would take “an extended period of time.” CDC union calls for condemnation of vaccine misinformation and tighter security The American Federation of Government Employees, Local 2883, said the CDC and leadership of the Department of Health and Human Services must provide a “clear and unequivocal stance in condemning vaccine disinformation.” Such a public statement by federal officials is needed to help prevent violence against scientists, the union said in a news release. “Their leadership is critical in reinforcing public trust and ensuring that accurate, science-based information prevails,” the union said. Fired But Fighting, a group of laid-off CDC employees, has said HHS Secretary Robert F. Kennedy Jr. is directly responsible for the villainization of CDC’s workforce through “his continuous lies about science and vaccine safety, which have fueled a climate of hostility and mistrust.” READ MORE: Ousted vaccine panel members say rigorous science is being abandoned under RFK Jr. Kennedy reached out to staff on Saturday, saying “no one should face violence while working to protect the health of others.” Thousands of people who work on critical disease research are employed on the campus. The union said some staff were huddled in various buildings until late at night, including more than 90 young children who were locked down inside the CDC’s Clifton School. The union said CDC staff should not be required to immediately return to work after experiencing such a traumatic event. In a statement released Saturday, it said windows and buildings should first be fixed and made “completely secure.” “Staff should not be required to work next to bullet holes,” the union said. “Forcing a return under these conditions risks re-traumatizing staff by exposing them to the reminders of the horrific shooting they endured.” The union also called for “perimeter security on all campuses” until the investigation is fully completed and shared with staff. Shooter had fixation on COVID-19 vaccine White’s father, who contacted police and identified his son as the possible shooter, said White had been upset over the death of his dog and also had become fixated on the COVID-19 vaccine, according to the law enforcement official. A neighbor of White told The Atlanta Journal-Constitution that White “seemed like a good guy” but spoke with her multiple times about his distrust of COVID-19 vaccines in unrelated conversations. “He was very unsettled, and he very deeply believed that vaccines hurt him and were hurting other people,” Nancy Hoalst, told the Atlanta newspaper. “He emphatically believed that.” But Hoalst said she never believed White would be violent: “I had no idea he thought he would take it out on the CDC.” We're not going anywhere. Stand up for truly independent, trusted news that you can count on! Donate now By — Susan Haigh, Associated Press Susan Haigh, Associated Press\nA Georgia man who had blamed the COVID-19 vaccine for making him depressed and suicidal has been identified as the shooter who opened fire late Friday on the U.S. Centers for Disease Control and Prevention headquarters, killing a police officer. The 30-year-old suspect, who died during the incident, had also tried to get into the CDC’s headquarters in Atlanta but was stopped by guards before driving to a pharmacy across the street and opening fire, a law enforcement official told The Associated Press on Saturday. READ MORE: Authorities identify suspect who opened fire at CDC in Atlanta, killing one police officer The man, identified as Patrick Joseph White, was armed with five guns, including at least one long gun, the official said, speaking on condition of anonymity because they were not authorized to publicly discuss the investigation. A union representing workers at the CDC said the incident was not random and “compounds months of mistreatment, neglect, and vilification that CDC staff have endured.” It demanded federal officials condemn vaccine misinformation, saying it was putting scientists at risk. Here’s what to know about the shooting and the continuing investigation: An attack on a prominent public health institution Police say White opened fire outside the CDC headquarters in Atlanta on Friday, leaving bullet marks in windows across the sprawling campus. At least four CDC buildings were hit, Director Susan Monarez said on X. DeKalb County Police Officer David Rose was mortally wounded while responding. Rose, 33, a former Marine who served in Afghanistan, had graduated from the police academy in March. White was found on the second floor of a building across the street from the CDC campus and died at the scene, Atlanta Police Chief Darin Schierbaum said. He added that “we do not know at this time whether that was from officers or if it was self-inflicted.” The Georgia Bureau of Investigations said the crime scene was “complex” and the investigation would take “an extended period of time.” CDC union calls for condemnation of vaccine misinformation and tighter security The American Federation of Government Employees, Local 2883, said the CDC and leadership of the Department of Health and Human Services must provide a “clear and unequivocal stance in condemning vaccine disinformation.” Such a public statement by federal officials is needed to help prevent violence against scientists, the union said in a news release. “Their leadership is critical in reinforcing public trust and ensuring that accurate, science-based information prevails,” the union said. Fired But Fighting, a group of laid-off CDC employees, has said HHS Secretary Robert F. Kennedy Jr. is directly responsible for the villainization of CDC’s workforce through “his continuous lies about science and vaccine safety, which have fueled a climate of hostility and mistrust.” READ MORE: Ousted vaccine panel members say rigorous science is being abandoned under RFK Jr. Kennedy reached out to staff on Saturday, saying “no one should face violence while working to protect the health of others.” Thousands of people who work on critical disease research are employed on the campus. The union said some staff were huddled in various buildings until late at night, including more than 90 young children who were locked down inside the CDC’s Clifton School. The union said CDC staff should not be required to immediately return to work after experiencing such a traumatic event. In a statement released Saturday, it said windows and buildings should first be fixed and made “completely secure.” “Staff should not be required to work next to bullet holes,” the union said. “Forcing a return under these conditions risks re-traumatizing staff by exposing them to the reminders of the horrific shooting they endured.” The union also called for “perimeter security on all campuses” until the investigation is fully completed and shared with staff. Shooter had fixation on COVID-19 vaccine White’s father, who contacted police and identified his son as the possible shooter, said White had been upset over the death of his dog and also had become fixated on the COVID-19 vaccine, according to the law enforcement official. A neighbor of White told The Atlanta Journal-Constitution that White “seemed like a good guy” but spoke with her multiple times about his distrust of COVID-19 vaccines in unrelated conversations. “He was very unsettled, and he very deeply believed that vaccines hurt him and were hurting other people,” Nancy Hoalst, told the Atlanta newspaper. “He emphatically believed that.” But Hoalst said she never believed White would be violent: “I had no idea he thought he would take it out on the CDC.” We're not going anywhere. Stand up for truly independent, trusted news that you can count on! Donate now"
    },
    {
      "url": "https://www.thomsonreuters.com/en/about-us/trust-principles.html",
      "text": "The Trust Principles\nThomson Reuters is dedicated to upholding the Trust Principles and to preserving its independence, integrity, and freedom from bias in the gathering and dissemination of information and news.\nTrust Principles – the history\nThe Trust Principles were created in 1941, in the midst of World War II, in agreement with The Newspaper Proprietors Association Limited and The Press Association Limited (being the Reuters shareholders at that time). The Trust Principles imposed obligations on Reuters and its employees to act at all times with integrity, independence, and freedom from bias.\nReuters Directors and shareholders were determined to protect and preserve the Trust Principles when Reuters became a publicly traded company on the London Stock Exchange and Nasdaq. A unique structure was put in place to achieve this. A new company was formed and given the name 'Reuters Founders Share Company Limited', its purpose being to hold a 'Founders Share' in Reuters.\nThe legal structure has evolved over time and the Founders Share and other contractual arrangements now confer a number of special rights upon the Thomson Reuters Founders Share Company. For example, (i) the Thomson Reuters Founders Share Company has enhanced voting rights in circumstances where someone is seeking to obtain a significant shareholding in, or acquire control of, Thomson Reuters and (ii) the prior consent of the Thomson Reuters Founders Share Company must be sought prior to undertaking any sale of, or other material transaction involving, the Reuters news business unit.\nThomson Reuters itself is obliged and committed to apply the Trust Principles to its operations. The charter documents of Thomson Reuters Corporation include provisions to safeguard the Trust Principles as they apply to the Thomson Reuters business and require Thomson Reuters Directors, in the performance of their duties, to have due regard to the Trust Principles, by the proper exercise of their powers and in accordance with their other duties as Directors.\nThe Trust Principles are:\n- That Reuters shall at no time pass into the hands of any one interest, group, or faction;\n- That the integrity, independence, and freedom from bias of Thomson Reuters shall at all times be fully preserved;\n- That Reuters shall supply unbiased and reliable news services to newspapers, news agencies, broadcasters, and other media subscribers and to businesses, governments, institutions, individuals, and others with whom Reuters has or may have contracts;\n- That Thomson Reuters shall pay due regard to the many interests which it serves in addition to those of the media; and\n- That no effort shall be spared to expand, develop, and adapt the news and other services and products of Thomson Reuters so as to maintain its leading position in the international news and information business\nThomson Reuters Founders Share Company was established in 1984 when Reuters became a public company. The directors of Thomson Reuters Founders Share Company (known as ‘Trustees’) have a duty to ensure, to the extent possible, that the Trust Principles are complied with.\nThe Trustees are experienced and eminent people from diverse arenas in politics, diplomacy, media, public service and business. The Trustees are selected by a nomination committee and proposed to the board of the Thomson Reuters Founders Share Company for appointment. The nomination committee assists in scrutinizing candidates’ suitability and its members include two persons appointed by the chairman after consultation with the European Court of Human Rights and representatives of certain press associations. The Thomson Reuters Corporation board has two representatives on the nomination committee. The Chairman and Deputy Chairman of the Thomson Reuters Founders Share Company Board are members of the nomination committee, and the Chairman appoints three other directors of the Thomson Reuters Founders Share Company as members of the nomination committee. The Chairman of the Thomson Reuters Founders Share Company acts as chairman of the nomination committee.\nThe number of Trustees has to be at least 14 and not more than 18. Trustees have a minimum of two meetings per year, and receive reports on our activities in the different fields in which we operate (including Reuters news). The Trustees meet with both the Thomson Reuters Board and representatives of senior management. Through Thomson Reuters Founders Share Company's Chairman, regular contact is maintained with our company. The relationship is one of trust and confidence.\nIndependence of Thomson Reuters\nCustomers across the world depend on us to provide them with reliable and objective news and information.\nThis means that we have a special need to safeguard our independence and integrity and avoid any bias which may stem from control by specific individuals or interests.\nThe Thomson Reuters Trust Principles were adopted in 1941 and include the preservation of integrity, reliability of news, development of the news business, and related principles.\nToday, the Trust Principles are fundamental to our entire business.\nMore information\nContact us\nBrian Moss\nFor inquiries pertaining to Reuters reporting standards and the Trust Principles please email: brian.moss@thomsonreuters.com."
    }
  ],
  "argos_summary": "The CDC tightened security measures following a shooting at its Atlanta headquarters that resulted in the deaths of a police officer and the gunman, who was reportedly motivated by misinformation about the COVID-19 vaccine. The incident has prompted the CDC union to call for stronger condemnation of vaccine disinformation and improved safety protocols for employees. In response to the violence, the CDC is allowing employees to work from home and has removed identifying decals from vehicles to enhance security.",
  "argos_id": "T8ADQYC6X"
}