{
  "url": "https://www.nytimes.com/athletic/6545496/2025/08/12/andoni-iraola-interview-bournemouth-premier-league-nba/",
  "authorsByline": "Adam Crafton",
  "articleId": "3b46a617d68d4a878f398168bd7182c6",
  "source": {
    "domain": "nytimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "AZ",
      "county": "Pima County",
      "city": "Tucson",
      "coordinates": {
        "lat": 32.1988848,
        "lon": -110.8218543
      }
    }
  },
  "imageUrl": "https://static01.nyt.com/athletic/uploads/wp/2025/08/11050404/GettyImages-2210269997-scaled-e1754903407778.jpg?width=1200&height=630&fit=cover",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T04:13:18+00:00",
  "addDate": "2025-08-12T04:21:18.184964+00:00",
  "refreshDate": "2025-08-12T04:21:18.184966+00:00",
  "score": 1.0,
  "title": "Andoni Iraola: Learning from the NBA, why celebrating goals is important, and contracts are less so",
  "description": "The head coach has lost the defensive core of his team from last season but is calmer than many of his peers might be in a similar situation",
  "content": "“When we sign players, I’m an assistant to them,” says the Bournemouth head coach Andoni Iraola.\n\nHe is discussing the rebuild of his squad, which has been depleted after a ninth-placed finish, which also included the club’s highest-ever Premier League points haul last season.\n\nBournemouth have sold centre-back Dean Huijsen to Real Madrid, left-back Milos Kerkez to Liverpool and they have lost goalkeeper Kepa Arrizabalaga at the end of a loan spell from Chelsea. Further outgoings are expected, with centre-back Illia Zabarnyi tipped to join Paris Saint-Germain.\n\nIraola has lost the defensive core of the team that secured Premier League wins against Arsenal, Manchester City, Manchester United, Tottenham Hotspur and Newcastle United last season but, seated in a boardroom of a Chicago hotel, the Spanish coach is calmer than many of his peers might be in a similar situation.\n\nAt Bournemouth, the club’s structure works in a particular way, where Iraola sees his role as coaching the team and preparing the players, but recruitment is delegated to Tiago Pinto, the club’s president of football operations, and technical director Simon Francis. Hence his “assistant” role.\n\nAlready this summer, Bournemouth have secured replacements, signing goalkeeper Djordje Petrovic from Chelsea for £25million and left-back Adrien Truffert from Rennes for £14.4m. This weekend, they agreed a £30.3m deal to sign 24-year-old centre-back Bafode Diakite from Lille, whose defence was bettered only by PSG in terms of goals against last season in the French top flight.\n\nLast summer, Iraola lost centre-forward Dominic Solanke to Tottenham in a £65m deal but his replacement Evanilson — signed for £40.2m from Porto — scored 10 goals in his first season in the Premier League. The coach trusted his club to deliver the goods.\n\n“When we sign players, I try to help as much as I can,” Iraola says.”I give my opinion, especially the kind of player we need and the demands that will be needed for that position, but I don’t control the market as well as they do.\n\n“Obviously, if they ask me about a player in the Premier League, I will give a very precise and a very good evaluation, but for us, it’s very difficult to sign players from the Premier League. I don’t think we have signed anyone from the Premier League while I have been here. Most of the players we sign are from other leagues and a lot of them, I don’t control.”\n\nIraola is speaking English and when he says he does not “control” the market in all leagues, he means it in the sense of not having full knowledge of every possible player in every league.\n\n“You can watch a video and you will watch a game from a player, but probably this is not solid enough not to give a strong opinion,” the 43-year-old explains.\n\nThe Athletic points out that many coaches are not so humble as to actually admit they do not know everything about the transfer market. Others are not prepared to delegate responsibilities to recruitment experts.\n\n“For me, it is the truth,” Iraola says. “Sometimes, I watch a player and I don’t like what I see from the beginning — it may be in the way he moves or his reactions. I watch not only how a player is technically and physically. For example, one thing I look at is their reactions when the team scores a goal. I like it when players celebrate and they are very happy, even if they haven’t been involved in anything for the goal and they haven’t touched the ball.\n\n“I try to somehow get to people who know that player or know things about their character, or about their personal life. But I am not a specialist in signing players. Ninety-five per cent of the job is done by people who, in this case, know more than me.”\n\nWhen it comes to coaching, however, Iraola leaves no stone unturned. Last summer, after a 12th-placed finish in his first season at Bournemouth, Iraola challenged his players to aspire. In his debut season, Bournemouth did not win any Premier League matches against teams who finished in the top six of the table. He sat his players down in pre-season and gave them a new goal, insisting they were capable of overcoming the best teams in the league on one-off occasions.\n\nThey did a double over second-placed Arsenal, took four points from fifth-placed Newcastle, beat Manchester City at home and demolished Nottingham Forest, who spent much of the campaign in the European places, by a 5-0 scoreline. They also beat Manchester United 3-0 at Old Trafford for the second season in a row.\n\n“We had very good wins against the best teams, apart from Liverpool, who is still the only team we don’t find a way to get points against,” says Iraola.\n\nWhile in the U.S. on pre-season, he spent time with staff at the NFL’s Chicago Bears but he has also taken inspiration from studying the NBA. He spent a season at the end of his playing career in the MLS at New York City FC, where he followed the New York Giants in the NFL, but became a Minnesota Timberwolves fan due to his admiration for power forward Kevin Garnett. It was a period where he explored the U.S. from East Coast to West Coast, also spending a summer in the Rockies and travelling to Vancouver in Canada.\n\n“I took a cruise to Alaska. There is just one highway!” he laughs.\n\n“With the NFL, we can learn from the methodology, particularly on set pieces.” Iraola smiles. “They have this playbook and they have 200 to 300 plays. They put everything together so that 50 players are on the same page. They find a way to adjust from week to week, and nobody forgets what they have to do.”\n\nIn soccer, Iraola says different players have different capacities for taking on instructions.\n\n“There are players who know what they have to do at a set play and also know what the other 10 players have to do. Normally, the first two to three set plays are quite easy to remember, but when it gets a little bit messy and they start to get tired, they are not always able to do what they’ve been told.\n\n“We have to keep it much more simple than (NFL). We don’t have the luxury of so many stops in play. If we were to have a timeout, football would lose a little bit of what it is. Football is different and unique because you cannot correct so much in real-time. It’s a dynamic sport.”\n\nIs it scary as a coach when you prepare so much but then cede so much control?\n\n“You have to accept it and trust players,” Iraola answers. “There are players in your team who can correct the others in-game. Normally, these are midfielders or central defenders, who see more and correct how we are pressing or the spaces we are occupying. For us, it is guys like Ryan Christie, Lewis Cook, Tyler Adams and Marco Senesi; players who are in the middle, who have experience and understand the game globally.”\n\nIraola still watches the NBA, looking for tricks he can apply to his own team.\n\n“In basketball, you can shoot, but what are the other players doing when a player shoots? How many do you send forward and leave behind so they are also ready for the defensive transitions?” he says.\n\n“Then there are the lookouts; it is not just the one on the ball to think about, it’s the others too. What are they doing and why are they not going to the rebound? Why are they opening the court with two guys?\n\n“Basketball is also about creating these mismatches. They are trying to force a match-up of our best player against their weakest player. If your strong player is the inside player in basketball, then you have to shoot threes, but then they may close everything on the inside and this will allow you go outside. You need to have different threats.”\n\nIraola is used to thinking deeply about his own sport. During a 12-year spell at Athletic Club, where he made over 400 appearances, he played under Marcelo Bielsa. He recalls how the Argentine coach created training drills designed to produce outcomes that had been achieved during games by some of the world’s best teams and players.\n\n“We named exercises after players who we were watching on the video,” Iraola explains. “One was Juan Roman Riquelme because it was something he had done at Boca Juniors. It makes it fun and relatable for players to use real examples, but you also need a mixture of everything. It cannot be only to try to copy what others are doing.”\n\nIraola is still in his first decade of coaching, having previously worked in more humble environments at AEK Larnaca in Cyprus and second-tier Mirandes in Spain before arriving in the Spanish top flight by achieving promotion with Rayo Vallecano. In his first jobs, where clubs were less handsomely staffed, he would be extremely hands-on: “It was me cutting the videos, editing everything with the assistant coach, basically working without an analyst and doing everything.”\n\nNow he has five analysts at his disposal at Bournemouth.\n\n“Even now, with all our facilities and staff, I want to be the first one setting up and I am the one putting the cones out,” says Iraola. “I’m measuring the distances. I feel more comfortable this way. I am learning how to use every person in the best way. At the beginning (at Bournemouth), I used to do post-match (analysis) and my own edit (of analysis videos).”\n\nHe is learning to delegate.\n\n“We have time to produce more small details. We have to get into depth, into the micro of everything. Analysts are very underrated in clubs because they are the ones preparing for the next game, giving us all the information — not only about the opposition, but also about our own team. I am going to be the one taking the decisions, but they give me the starting point. When you have analysts who know what you are going to demand in every phase of the game, they save you a lot of time.”\n\nThere is a good connection, too, with the club’s ownership under U.S. billionaire Bill Foley, who also owns the Las Vegas Golden Knights in the NHL, as well as having investments in Auckland FC, Lorient and Hibernian in soccer.\n\nTowards the end of last season, Iraola was under consideration by Tottenham, who have since replaced Ange Postecoglou with Thomas Frank. “I was thinking since the beginning (to continue at Bournemouth),” he says. “I was very happy we had a very good season. I feel comfortable with with the players, the staff and the people in charge.”\n\nHis contract is up at the end of this season.\n\n“I’m very happy here,” Iraola insists. “It is something we will discuss during the season. I’m very used to it being like this. The past season was the only one where I already had a contract in place for the next season. I’m very comfortable working this way.\n\n“I like it when you get to the end of the season and have the meeting to say: ‘OK, you are happy with me?’. ‘Yes. I’m happy with you. Let’s keep going’. In the end, contracts, they look important, but especially for managers, we have to win. Otherwise, in two months, you can be out. For me, it (a contract) is not so important.”\n\nFor the coming season, Iraola is cautious in his expectations. His defence being plucked by Liverpool, Real Madrid and PSG is an affirmation of Bournemouth’s eye for recruitment and talent development, but he says replacements will need time to arrive at the level of those who have left the club. He has told his players he wants them to start games more effectively, as their numbers tend to be better in the second half of matches when the games “open up”.\n\n“We have to be the best team we can be,” says Bournemouth’s head coach. “In the Premier League, there are eight or nine teams that everyone can say are above us and the rest of the teams. Among the others, we want to be as high as we can. If it can be as high last season, then amazing.\n\n“When you start the new season, you don’t think you are going to get six points against Arsenal. We know that is going to be difficult. If we do not, we have to change those points for those we lost against weaker opposition.\n\n“In the Premier League, we have to know that if we are not close to our 100 per cent level, then it is going to be very difficult for us to win any game. This is very clear because if we lose this humility, we are going to struggle for sure.”",
  "medium": "Article",
  "links": [
    "https://www.nytimes.com/athletic/6413844/2025/07/01/kepa-arrizabalaga-arsenal-transfer-tldr/",
    "https://www.nytimes.com/athletic/6544679/2025/08/11/tyler-adams-usmnt-pulisic-pochettino-world-cup-bournemouth/",
    "https://www.nytimes.com/athletic/6545028/2025/08/10/bournemouth-bafode-diakite-transfer/",
    "https://www.nytimes.com/athletic/6435542/2025/06/21/bill-foley-auckland-fc-stanley-cup-steven-adams-golden-knights/",
    "https://www.nytimes.com/athletic/6413081/2025/06/10/arsenal-transfer-latest-news-manchester-united-liverpool-chelsea-barcelona-real-madrid/",
    "https://www.nytimes.com/athletic/6435068/2025/06/26/huijsen-real-madrid-malaga-spain-juventus/",
    "https://www.nytimes.com/athletic/5918365/2024/11/14/kevin-garnett-the-basketball-100-book-excerpt/",
    "https://www.nytimes.com/athletic/6488728/2025/07/16/bournemouth-djordje-petrovic-chelsea-transfer/",
    "https://www.nytimes.com/athletic/4518222/2023/05/14/bournemouth-owner-bill-foley-interview/",
    "https://www.nytimes.com/athletic/5489394/2024/05/13/andoni-iraola-bournemouth-contract/",
    "https://www.nytimes.com/athletic/6234936/2025/03/27/tottenham-manager-next-iraola-ange/",
    "https://www.nytimes.com/athletic/6429641/2025/06/26/milos-kerkez-liverpool-robertson-tsimikas/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "different players",
      "weight": 0.07381788
    },
    {
      "name": "player",
      "weight": 0.07285153
    },
    {
      "name": "players",
      "weight": 0.07285153
    },
    {
      "name": "last season",
      "weight": 0.065747686
    },
    {
      "name": "season",
      "weight": 0.05931279
    },
    {
      "name": "Iraola",
      "weight": 0.059002243
    },
    {
      "name": "Andoni Iraola",
      "weight": 0.057852272
    },
    {
      "name": "Premier League",
      "weight": 0.0543624
    },
    {
      "name": "Premier League wins",
      "weight": 0.053402405
    },
    {
      "name": "many coaches",
      "weight": 0.050815534
    }
  ],
  "topics": [
    {
      "name": "Basketball"
    },
    {
      "name": "NBA"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.9951171875
    },
    {
      "name": "/Sports/Team Sports/Soccer",
      "score": 0.9658203125
    }
  ],
  "sentiment": {
    "positive": 0.10086574,
    "negative": 0.4885428,
    "neutral": 0.41059154
  },
  "summary": "Bournemouth head coach Andoni Iraola discusses the rebuilding of his squad after a disappointing ninth-place finish last season, which saw the club's highest-ever Premier League points haul last season. His team has lost several key players, including centre-back Dean Huijsen to Real Madrid, left-back Milos Kerkez to Liverpool, and goalkeeper Kepa Arrizabalaga to Chelsea. Further departures are expected. Bournemouth has already signed replacements for goalkeeper Djordje Petrovic from Chelsea for £25m and left back Adrien Truffert from Rennes for £14.4m. Despite his role as an assistant to Tiago Pinto, the club’s president of football operations, and technical director Simon Francis, IRAola shares his knowledge of the transfer market.",
  "shortSummary": "Bournemouth head coach Andoni Iraola emphasizes player celebration and technical skill, emphasizing the importance of such actions amid ongoing transfer losses and high-profile signings.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "3f269dc0e0ae4fb7a264a6a2cd0c4469",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.nytimes.com/athletic/6413081/2025/06/10/arsenal-transfer-latest-news-manchester-united-liverpool-chelsea-barcelona-real-madrid/",
      "text": "Welcome to the second edition of The Athletic’s Transfer DealSheet for the summer 2025 transfer window.\nOur team of dedicated writers, including David Ornstein, will take you inside the market to explain the deals being worked on in this window, which began earlier this month due to the special window for the Club World Cup. This mini-window opened on June 1 and will run until Tuesday, with the normal transfer window then running from June 16 until September 1.\nAdvertisement\nThe information found within this article has been gathered according to The Athletic’s sourcing guidelines. Unless stated, our reporters have spoken to more than one person briefed on each deal before offering the clubs involved the opportunity to comment. Those responses, when they were given, have been included in the Transfer DealSheet.\nWe aim to bring you analysis you can trust about what is happening at Europe’s leading clubs and the latest information we’re hearing from across the market. This year, The Athletic’s football finance writer, Chris Weatherspoon, will be adding to our analysis of the transfer market, along with tactical analysis from Anantaajith Raghuraman.\nLast week, we looked at Liverpool’s ongoing chase of Florian Wirtz, City’s interest in Rayan Cherki — which has now advanced — and Bryan Mbeumo’s decision to join Manchester United. This week, we explore Martin Zubimendi’s situation, Paris Saint-Germain’s interest in a Premier League defender, and the state of play across a number of Premier League clubs.\nThis article is long but detailed, so enjoy it all — or search for the club or player you want to read about.\nDavid Ornstein’s One to Watch\nThere has been plenty of noise around Martin Zubimendi’s future — however the Spain midfielder’s transfer to Arsenal is regarded by the north London club as being done and signed.\nReal Sociedad have expressed a preference for the deal to be ratified in July for accounting purposes, and Zubimendi is expected to link up with Arsenal for the start of pre-season.\nOur Real Madrid correspondent Mario Cortegana says sources in Madrid assert that the 15-time European champions like the player but did not pursue or actively work on recruiting him.\nArsenal are among those to keep an eye on this week, with work being carried out on a new striker and wide attacker. Benjamin Sesko, Viktor Gyokeres and Ollie Watkins have been prominent in their thoughts for the No 9 role, while the likes of Nico Williams, Rodrygo and Anthony Gordon have admirers at the Emirates Stadium as wingers.\nAdvertisement\nThere should also be some clarity on the future of Thomas Partey in the coming days. The Ghana midfielder’s contract expires this summer, and there is still no agreement over a renewal. Should he depart, it is likely Arsenal will need to enter the market for a replacement.\nArsenal are already on course to bring in Kepa Arrizabalaga from Chelsea for £5million.\nWhat else we’re hearing\n- Bournemouth are aware of interest from Paris Saint-Germain in Illia Zabarnyi. Luis Campos, PSG’s football advisor, and Bournemouth’s president of football operations Tiago Pinto are both Portuguese and know one another. They do not need official negotiations to talk about a deal and are speaking. It will take a high price for PSG to sign the 22-year-old, for whom the potential switch appeals, and there is a good chance it happens this summer. David Ornstein\n- Meetings are expected between Bournemouth, Liverpool and Milos Kerkez’s representatives this week. There is a very good chance that agreements are reached for the left-back to transfer to Anfield. Bournemouth are lining up Rennes left-back Adrien Truffert to replace him, but will only complete that transfer if a deal for Kerkez is done. David Ornstein\n- There could be developments in Manchester United’s pursuit of Bryan Mbeumo this week. As The Athletic recently revealed, the Cameroon forward has decided he wants to join the Old Trafford side — and other suitors are aware of his choice. United made an opening offer that valued Mbeumo at £45million plus £10m in add-ons, but that was below the level of fee it would take for Brentford to sell and discussions continue. David Ornstein\n- Arsenal will pay a total of around €65million (£55m) for Martin Zubimendi, more than his release clause — which is in the region of €60m (£51m) — after agreeing with Real Sociedad to pay for his transfer in instalments. Coming to this agreement, after months of negotiation, enables Arsenal to avoid paying the release clause in one lump sum. Mario Cortegana and James McNicholas\n- Borussia Dortmund have expressed their interest in Jadon Sancho to the player’s representatives. Dortmund are in the process of rebuilding their attack and see Sancho as a potential No 10 option, behind Serhou Guirassy, in Niko Kovac’s 3-4-2-1. At this stage, Sancho is one of several candidates for the role, with Freiburg’s Japanese international Ritsu Doan another. And while the finances for any deal involving Sancho would be prohibitive given the winger’s current wages, the club remain optimistic that the opportunity to return to the Westfalenstadion, where so many of his career’s best moments have occurred, would be appealing. Sebastian Stafford-Bloor\n- Manchester City have reached an agreement with Lyon for the signing of Rayan Cherki. The Athletic reported in last week’s Transfer DealSheet that City were exploring a deal for Cherki and were hopeful of signing the 21-year-old. An agreement between the clubs on a fee in the region of €40m (£33.7m; $45.7m) and between City and the player on a contract until 2030 have now been reached. David Ornstein\n- Brighton & Hove Albion are working on a deal to sign Italian central defender Diego Coppola from Serie A side Hellas Verona. The club are keen to add the 21-year-old to Fabian Hurzeler’s squad as part of a refresh in the middle of the defence. Andy Naylor\nHave Bournemouth become one of the Premier League’s best sides at selling?\nA key tale this summer looks to be the emergence of Bournemouth as a strong selling club. Indeed, there’s already plenty of evidence, with £50million-plus deals for both Dominic Solanke and Dean Huijsen sealed inside the past 10 months.\nNow the vultures are circling on two of Huijsen’s fellow defensive mainstays last season in Milos Kerkez and Illia Zabarnyi. They are wanted by Liverpool and Paris Saint-Germain, respectively.\nNeither will go cheap; Solanke and Huijsen brought in Bournemouth’s largest-ever transfer fees, and, should Kerkez and Zabarnyi join them in leaving by the end of this month, it will almost certainly mean the club’s four biggest sales in their history will have all occurred in the 2024-25 financial period.\nBournemouth value Kerkez at around £45m, and were Zabarnyi to make his way to Paris, they’ll be able to command a chunky sum for him, too. They have already surpassed their single-season record for player sale profits of £55.8m, set in 2020-21 after being relegated the previous year.\nThe Athletic reported in April that Bournemouth had benefited from a £71.4m owner loan write-off being included in their recent PSR submissions, on the back of which they recorded the fifth-highest net spend in England across 2022-23 and 2023-24. Kerkez and Zabarnyi were each signed during that time, and it is clear that good work done in the transfer market then has set Bournemouth up in a strong position now.\nIf both depart this month, Bournemouth should become only the ninth English club to report more than £100m in player profits in a single season. Across the past 13 seasons, Bournemouth’s combined player profits totalled £113m – a mark they’d likely pass in 2024-25 on its own with those two sales.\nChris Weatherspoon\nArsenal\nHas anything happened over the past week?\nArsenal appear to have solved one of their positional requirements for the summer by agreeing a deal to sign goalkeeper Kepa Arrizabalaga from Chelsea. Arsenal have been looking for quality backup to David Raya, and with initial target Joan Garcia seemingly headed elsewhere, they have moved quickly to agree a deal with 30-year-old Kepa. Arsenal will activate a £5m release clause in Kepa’s contract to complete the deal.\nAdvertisement\nAndrea Berta has also made a positive start on contract renewals, tying Gabriel down to a new contract until 2029.\nThere have been some departures: Arsenal have confirmed that Neto and Raheem Sterling will leave at the end of their loans, while the club also reached an agreement with Jorginho to terminate his contract three weeks early. That enabled the 33-year-old to join Flamengo in time to take part in the World Club Cup.\nArsenal have also struck an agreement to sell 22-year-old Brazilian winger Marquinhos to Cruzeiro. The winger is currently on loan with the Brazilian club, but will join them permanently for a fee in the region of £3million with a sell-on clause.\nIs the striker situation now down to just Sesko and Gyokeres?\nThose two are certainly the main candidates. There are others — such as Aston Villa’s Ollie Watkins — who remain under consideration, but for the time being, Arsenal’s focus is on Benjamin Sesko and Viktor Gyokeres.\nArsenal are actively working on the No 9 situation and hope for progress this week.\nWhat positions/players are they looking at?\nArsenal would also like to add a wide player. As mentioned in The Athletic’s Transfer DealSheet on May 16, the La Liga pair of Nico Williams and Rodrygo is of particular interest. Arsenal’s coaching staff are huge fans of both, but a deal for either player would present some financial challenges. There is also interest in Anthony Gordon.\nMikel Arteta would also like to sign a central defender to complement the first-choice pair of Gabriel and William Saliba. Arsenal made a significant effort to lure Huijsen from Bournemouth, but the Spanish international ultimately chose Real Madrid.\nIf Arsenal do enter the defender market, one man high on their list is Marc Guehi. The 24-year-old has a year remaining on his contract, which could make him considerably more affordable. The issue may be whether England international Guehi is prepared to join Arsenal, where he must compete for a place against the established pair of Gabriel and Saliba in a World Cup year.\nIf Arsenal and Thomas Partey fail to strike an agreement, the club may have to revisit central midfield. His contract currently expires this summer.\nWhich players could be leaving?\nOne player attracting some interest is Reiss Nelson. The 25-year-old spent last season on loan with Fulham, and Marco Silva’s team are interested in bringing him back to Craven Cottage if an appropriate deal can be reached.\nJames McNicholas\nWould Williams or Rodrygo suit Arsenal?\nThe key benefit Arsenal will get from either player is versatility. Rodrygo has played across the frontline for Real Madrid, while Nico Williams can play on either flank, often swapping wings mid-game for Spain and Athletic Club.\nWilliams brings excitement and greater dribbling prowess, with frightening ball control at pace. He averaged 9.2 take-ons per 90 in La Liga last season, only behind Lamine Yamal (10.6) among wide attackers. In contrast, Rodrygo averaged 5.3, but under mitigating circumstances as Real struggled to find an offensive balance.\nRodrygo offers more without the ball and reads pressing triggers well. The Brazilian often compensated for the lack of effort from Vinicius Junior and Kylian Mbappe last season. Williams can rush defenders into mistakes with his acceleration, but is still perfecting his out-of-possession game.\nWhile Williams excels at delivering dangerous crosses into the box, Rodrygo is the more incisive passer, especially closer to the box. His 2.4 passes inside the opposition’s penalty area per 90 is well ahead of Williams’s 1.4.\nAdvertisement\nBoth have an affinity for big stages and bright lights. Nico was excellent in Athletic’s 2024 Copa del Rey final win against Mallorca and was one of Spain’s best players in all their Euro 2024 knockout matches. Rodrygo, meanwhile, has scored eight Champions League knockout-stage goals.\nAnantaajith Raghuraman\nChelsea\nHas anything happened over the past week?\nIn terms of completed deals, yes. Chelsea beat competition from several clubs to sign Liam Delap from Ipswich Town for £30m.\nChelsea have had a bid rejected by Borussia Dortmund for Jamie Gittens, but significantly, agreed terms with the winger over a seven-year contract.\nBorussia Dortmund value the 20-year-old at £50m, but that is above Chelsea’s valuation for a player who does not fit into Niko Kovac’s preferred style of play.\nThe Bundesliga club believe there will be more competition for Gittens’ signature later in the summer, which is why they have hopes of getting a higher sum. However, Chelsea do not see how this can be the case if he does not start regularly at the Club World Cup.\nChelsea have ended their interest in signing AC Milan goalkeeper Mike Maignan this summer.\nChelsea did not want to overpay for the goalkeeper, who has 12 months left on his contract and will be able to negotiate a free transfer with foreign clubs from January onwards.\nThey never made an official bid for Maignan but told Milan that they were willing to spend a maximum of €15m. The London club saw the €20m sale of Christian Pulisic to Milan in 2023 as part of their reasoning. The United States international also had a year remaining on his contract, but was six years younger and plays in a position which commands higher fees. However, Milan valued their goalkeeper at a higher fee and so Chelsea have decided to walk away.\nMeanwhile, Chelsea decided not to trigger the option to sign Jadon Sancho permanently from Manchester United. Defender Mamadou Sarr has completed his £14m move from Strasbourg, a deal that was agreed back in January.\nAdvertisement\nCan we now expect a pause in business ahead of the Club World Cup?\nNot necessarily. The market reopens on June 16, the same day as their opening fixture against Los Angeles FC, and that gives Chelsea more time to sign players for the knockout phase, should they get there. The window to register new players at the tournament runs from June 27 to July 3.\nIt is one of the reasons Chelsea have not felt under pressure to get all of their business done by June 10.\nWhen a transfer window is shut, that does not mean negotiations between clubs cannot take place. Chelsea showed that in March by agreeing deals in advance with Sporting CP for Geovany Quenda and Dario Essugo. The latter officially completed the switch last week and will be competing with Maresca’s side in the U.S. Quenda is going to spend next season on loan at Sporting CP before joining Chelsea next summer.\nWhat positions/players are they looking at?\nWith Mykhailo Mudryk still provisionally suspended for failing a doping test and Sancho not being signed, Chelsea are looking at buying one or two wide players. Apart from Gittens, others on the list include Manchester United’s Alejandro Garnacho and West Ham United’s Mohammed Kudus. Athletic Bilbao’s Nico Williams has already been ruled out for a variety of reasons.\nChelsea have made an enquiry for Eintracht Frankfurt forward Hugo Ekitike, but they are not prepared to pay the current asking price of €100m.\nA centre-back and goalkeeper will be considered if a good enough player becomes available for the right price. This has been shown by Chelsea’s interest in Huijsen and Maignan, respectively.\nWhich players could be leaving?\nKeeper Kepa Arrizabalaga, who joined Chelsea from Athletic Bilbao for £71.6m in 2018, is on the verge of completing a £5m move to Arsenal. Backup goalkeeper Marcus Bettinelli is expected to join Manchester City for an undisclosed fee in time for him to be part of their Club World Cup squad, having made just one appearance in four years at Chelsea.\nAdvertisement\nMany more are expected to follow. There is a long list involving most of the players who were loaned out last season (not Andrey Santos) and some of the current squad. This includes Raheem Sterling, Ben Chilwell, Armando Broja, Carney Chukwuemeka, Axel Disasi and Renato Veiga. Christopher Nkunku is also a player who could leave. They are also likely to try to sell one of Robert Sanchez and Djordje Petrovic as they are well-stocked in the goalkeeper department.\nChelsea do not intend to take all the players to the U.S., so there will be no ‘bomb squad’ out there while departures are being organised.\nSimon Johnson and James Horncastle\nLiverpool\nHas anything happened over the past week?\nLiverpool stepped up their pursuit of Florian Wirtz by submitting an improved offer of €134m to sign the attacker, but Bayer Leverkusen’s asking price is a reported €150m (£126.4m). Liverpool have no intention of bidding as high as that figure. Negotiations are ongoing.\nWirtz played in the Nations League defeat to France on Sunday. Liverpool hoped a €118.7m upfront fee with a further €15.4m in add-ons would be enough to get their man, but they are still trying to find a breakthrough.\nThe push to sign Milos Kerkez from Bournemouth also continues.\nIf Liverpool wrap up Wirtz and get Kerkez, will that be the end of their business?\nAlongside the signing of Jeremie Frimpong, securing Wirtz and Kerkez early into the summer window would represent a fine start.\nLiverpool are taking advantage of what was a smooth, free-flowing season. The position on recruitment is clearly aligned. Well-organised clubs are able to get their business done early and Liverpool have clear targets in areas that need strengthening.\nIf they are able to move on players for the right money, it will free up room to continue rebuilding for the future.\nAdvertisement\nWhat positions/players are they looking at?\nWhether Liverpool feel the need to recruit a new No 9 and another central defender will depend on future outgoings.\nIt’s also unclear at this stage whether the signing of Wirtz would give Slot enough variety in the attacking areas should Darwin Nunez and Federico Chiesa leave, so there may be room for another addition.\nAlthough the central defensive positions are currently well covered, Liverpool would feel more secure if Ibrahima Konate extended his contract. The club continue to look at centre-backs under the age of 24 as part of their succession planning strategy.\nIt also wouldn’t be a surprise to see further additions made for the under-21 team following the arrival of 20-year-old Hungarian goalkeeper Armin Pecsi from Puskas Akademia.\nWhich players could be leaving?\nHarvey Elliott revealed this week that he is wary of “wasting years of my career”, so he’ll weigh up his options this summer.\nTyler Morton is desperate to play after a loan move was blocked last season, while Nat Phillips has strong interest from West Bromwich Albion and a number of other Championship clubs after his temporary spell at Derby County ended.\nLiverpool will also listen to bids for Kostas Tsimikas, Nunez and Chiesa and are expected to sanction a loan move for third-choice goalkeeper Vitezslav Jaros, who sacrificed a year of football to provide cover last season. The 23-year-old is expected to leave for a top-flight club in Europe and currently has various options in France and the Netherlands to consider.\nGregg Evans\nManchester City\nHas anything happened over the past week?\nCity have wasted no time in accelerating deals for Wolves left-back Rayan Ait-Nouri, who has now signed, Milan midfielder Tijjani Reijnders, and Lyon attacking midfielder Rayan Cherki.\nThey reached an agreement with Wolves to sign Ait-Nouri for just below €40m and also struck a deal with Milan to sign Reijnders for a €55m fixed fee, plus bonuses.\nAdvertisement\nBoth players have agreed five-year contracts, with Ait-Nouri having the option of a further year. On Monday, City completed a hat-trick by agreeing a fee in the region of €40m with Lyon for France midfielder Cherki.\nAit-Nouri is now confirmed. Pending medicals, which will take place in the coming hours and days, the other two are expected to be available for the Club World Cup. City fly out to the U.S. on Thursday ahead of their opening game against Wydad AC next Wednesday.\nWill City make further moves after the Club World Cup?\nChelsea goalkeeper Marcus Bettinelli is expected to join on a free transfer from Chelsea as a replacement for backup goalkeeper Scott Carson. The 33-year-old has been at Stamford Bridge since 2021, having made over a century of appearances for Fulham, where he came through the ranks and remained for more than a decade.\nHe will be replacing a much-loved member of the squad in Carson, who, after playing just 108 minutes of football in six years, is exiting after the expiry of his contract. The 39-year-old has been at the club since 2021, helping to support and provide cover for Ederson and Stefan Ortega.\nWhat positions/players are they looking at?\nDespite being on the verge of adding three first-team players, City could yet add another couple.\nRight-back is an area they are short in after Kyle Walker moved to Milan in January. Matheus Nunes filled in and improved as the season went on, but it is not a perfect solution. Rico Lewis and Manuel Akanji have also been deployed there at times.\nReijnders and Cherki represent a substantial recalibration of the midfield, but out wide, City may require another option, too. However, these other gaps in the squad could depend as much on who leaves in the coming weeks.\nWhich players could be leaving?\nGuardiola still wants a tighter squad, but choosing where he will trim is still to be decided.\nAdvertisement\nJack Grealish looks the likeliest to depart as, after being left out of the squad to face Fulham on the final day of the Premier League season, he has also been left out of the group that will go to the Club World Cup. With two years still to run on his deal, it is unclear whether it will be a permanent move or a loan, given the finances involved.\nJames McAtee is another player who will not be taking part in the Club World Cup after City offered him the choice of travelling or going to Slovakia to compete with England at the European Under-21 Championship. He decided that he would be likely to feature more for Lee Carsley’s side, which could be indicative of where he sees his future.\nJordan Campbell\nManchester United\nHas anything happened over the past week?\nManchester United’s opening offer for Mbeumo, submitted last Wednesday, was short of Brentford’s valuation. Suggestions of a second bid already being placed have been dismissed, but talks are continuing this week in the hope of finding an agreement.\nArguably more important than any incoming, Bruno Fernandes ended speculation over his future last week by rejecting a lucrative offer from Saudi Pro League club Al Hilal after talks with Ruben Amorim and his family.\nJadon Sancho’s return from Chelsea was confirmed, earning United £5m in a penalty fee after the obligation to buy was not executed, but it adds another name — and another hefty salary — to the list of those that United are trying to find a suitor for.\nMan Utd seem to want to get their business done early — is that on purpose?\nYou have to go back six years to Daniel James’ £15m move from Swansea City for the last time United agreed a first-team-level signing in early June, but even that was not settled as early as Matheus Cunha’s.\nUnited entered the window prepared to trigger not only Cunha’s £62.5m release clause, but also Liam Delap’s £30m buyout. The fixed fees set clear parameters for deals to be done.\nAdvertisement\nAgreeing a deal for Mbeumo requires more negotiation, but with Newcastle United, Arsenal and Tottenham Hotspur all registering interest, the level of competition for the 25-year-old has also forced a more proactive approach than usual.\nBut United are far from the only club acting early in this window, as those competing at the Club World Cup have sought to do business quickly, and that has carried a ripple effect through the market.\nWhat positions/players are they looking at?\nThe signing of Cunha and potential arrival of Mbeumo would leave United well-stocked in the No 10 positions, although both have experience of playing as a centre-forward and could theoretically deputise up top.\nBut even so, following Delap’s decision to join Chelsea, Amorim is still thought to want a recognised No 9. His fondness for Viktor Gyokeres is well established, although a deal could prove difficult to do from a financial perspective before sales.\nUnited’s latest financial results — released on Friday — listed the club’s cash reserves at £72.3m, although a more detailed filing later revealed the capacity to borrow another £140m under their revolving credit facility as of the end of April.\nGenerating funds through sales would be a more sustainable route to the necessary squad rebuild, though. Amorim would like to add depth in midfield and the addition of a goalkeeper has also been mooted.\nWhich players could be leaving?\nSancho’s unexpected return could lead to a reunion with Borussia Dortmund, who are interested in signing the 25-year-old for a third time following his loan spell at Signal Iduna Park in the 2023-24 season.\nInter’s interest in Rasmus Hojlund is concrete but, as the 22-year-old intimated over the weekend while on international duty, he wants to stay at Old Trafford and prove himself.\nAdvertisement\nReal Betis retain an interest in signing Antony permanently, but questions remain over whether they will be able to meet United’s demands. Finding buyers for Alejandro Garnacho, Marcus Rashford and Tyrell Malacia would also make more room for incomings.\nMark Critchley\nNewcastle United\nHas anything happened over the past week?\nThe news that Mbeumo prefers a move to Manchester United, as revealed by The Athletic, has led Newcastle to re-evaluate what they require to bolster their attack this summer. There is an acceptance that a deal for the Brentford right winger is now unlikely, so Newcastle are focusing on alternative targets, as will be discussed below.\nNewcastle will not pay the prices they are currently being quoted for those targets.\nNewcastle also released their retained list on Friday, which confirmed that Jamal Lewis has been released, Lloyd Kelly’s transfer to Juventus will become permanent on June 30, and a clause has been triggered to extend Mark Gillespie’s stay by another year.\nIt was also revealed that John Ruddy, the 38-year-old goalkeeper, is in talks over a new deal, with progress being made.\nCallum Wilson, meanwhile, is also in discussions over a fresh contract on more incentivised terms, after Newcastle opted against exercising an extension clause in his present deal. Negotiations are ongoing, but an agreement is not close with the 33-year-old striker, with discussions yet to advance in the way they have with Ruddy.\nThe club also confirmed that Antonio Cordero, the 18-year-old Spanish winger, will join from Malaga on July 1. Cordero is expected to head out on loan next season and is a development signing rather than a first-team addition.\nHow has the Mbeumo situation affected Newcastle’s plans?\nThe 25-year-old was Newcastle’s top right-winger target, despite the club never officially approaching Brentford with an offer, and alternative attackers are now being considered.\nAdvertisement\nEddie Howe is determined to bolster his offensive ranks and while a right winger has been sought pretty much since the takeover of October 2021, versatility in attack is deemed crucial. Forwards who can play in multiple positions will be important as Newcastle tackle another Champions League campaign, so it remains to be seen whether an out-and-out wide man, an attacker who can play across the frontline, or both, arrive.\nThat will partly be determined by how far Newcastle’s budget stretches. While they do not have a PSR need to sell before June 30, the headroom that the sales of Kelly and Miguel Almiron in January created is not huge. The club’s owners continue to preach the need for financial control internally, with a desire to leave enough space in the kitty to strengthen in January and future windows.\nBrighton & Hove Albion’s Joao Pedro and Nottingham Forest’s Anthony Elanga are admired by multiple senior figures inside Newcastle, with both of long-term interest, and moves for both are being considered. Bournemouth’s Antoine Semenyo and West Ham United’s Kudus have also featured in discussions.\nChelsea’s Noni Madueke is not among players being considered, while they do not hold an interest in Manchester City’s Jack Grealish.\nNewcastle do not agree with the current asking prices and will not pay those fees to sign the players they are targeting. That is the case for targets both domestically and abroad as things stand, despite a wider perception that European imports are relatively cheaper.\nThere is a hope that demands will drop as the summer develops, with attacking reinforcements deemed of paramount importance.\nWhat positions/players are they looking at?\nAlongside a right-sided forward, Newcastle are prioritising the recruitment of a right-sided centre-half and a goalkeeper, while they may also bring in a striker or versatile attacker.\nNewcastle’s interest in Marc Guehi remains, following the failed month-long pursuit of the Crystal Palace defender last August. Having missed out on Real Madrid-bound Huijsen, they have a shortlist of centre-back targets, with Guehi highly regarded.\nGoalkeeper-wise, Newcastle had an offer rejected for Burnley’s James Trafford 12 months ago and are expected to return for the 22-year-old, whose price tag has risen following a stellar campaign but remains their top target.\nAgain, with Newcastle resolute in their determination not to pay what they view as excessive fees, they have explored alternatives. Newcastle had watched Barcelona-bound Joan Garcia during his impressive 2024-25 campaign for Espanyol, while Lille’s Lucas Chevalier has admirers inside St James’ Park.\nAdvertisement\nWhen it comes to attackers, Brighton’s Joao Pedro is viewed as a versatile, Premier League-experienced option, and the 23-year-old came close to joining Newcastle in 2022 from Watford. Lille’s Jonathan David was tracked but is expected to head elsewhere, while soon-to-be-free-agent Dominic Calvert-Lewin is not currently under consideration, despite previous interest. A forward arriving is partly dependent on Wilson’s future.\nWhich players could be leaving?\nHowe is keen to keep Nick Pope, even if a rival goalkeeper joins as expected. The 33-year-old has been linked with an exit, but he is still first choice and Howe wants to increase depth in that department.\nNewcastle will consider offers for Sean Longstaff, who is entering the final 12 months of his deal and turned down opportunities to leave in January. Should Newcastle sell, they can bank “pure profit” in PSR terms.\nHowe would ideally like to retain Joe Willock and Harvey Barnes, though Newcastle may have to consider decent offers for both given funds could be reinvested. Kieran Trippier is also valued by Howe, but the right-back has been repeatedly linked with an exit.\nOdysseas Vlachodimos, the £20m goalkeeper who has made only one substitute appearance, is available. Martin Dubravka’s situation is also unclear, despite signing an extension in January.\nNewcastle will listen to offers for Matt Targett, while a resolution is required to Isaac Hayden’s situation as he is not part of Howe’s plans.\nNewcastle are confident they can rebuff any interest in Alexander Isak, Anthony Gordon, Tino Livramento and Sandro Tonali.\nChris Waugh\nWhy Guehi’s passing would make him a good candidate for Arsenal and Newcastle\nGuehi’s biggest asset is his comfort on the ball and range of passing, illustrated in the graph below, which will be valuable to Arsenal and Newcastle. His long passes over the top of defences have proved crucial to Crystal Palace’s attacking approach under Oliver Glasner.\nApart from finding Palace’s wing-backs to stretch play, Guehi often passed long down the middle, creating opportunities for the three forwards. He was a consistent back-post threat from set pieces, too, tasked with bringing down the first ball and heading across or crossing to a team-mate in the penalty box. His ball-carrying has also improved over the past few seasons.\nAdvertisement\nGuehi’s defensive stats rarely stand out from the rest due to his reliance on positioning and recovery pace to make tackles. His ability in the air is a concern, with his 54 per cent aerial duel success rate ranking him 50th out of 64 centre-backs who played 900+ minutes last season.\nThere will be a period of adaptation required, but Guehi would be a solid signing for either team.\nAnantaajith Raghuraman\nTottenham Hotspur\nHas anything happened over the past week?\nSpurs finally decided to sack Ange Postecoglou, 16 days after he guided them to victory in the Europa League final and on the second anniversary of his appointment as head coach. The Australian won Spurs their first piece of silverware in 17 years, but they lost 22 games last season and finished 17th in the Premier League.\nThere was more drama in north London last week as women’s head coach Robert Vilahamn was sacked, after they finished second from bottom in the Women’s Super League, along with chief football officer Scott Munn. Ryan Mason, who has been Postecoglou’s assistant for the past two seasons and previously had two spells as a caretaker, left to become West Bromwich Albion’s head coach.\nLong-serving executive Donna-Maria Cullen, who is one of chairman Daniel Levy’s most trusted allies, is stepping down from the board to spend more time with her family. All of this upheaval happened as new chief executive Vinai Venkatesham settled into his role. There seems to be movement everywhere across Spurs, except within the playing squad.\nCan business move ahead now that Postecoglou has left?\nIt will take time for the dust to settle from the departures of Postecoglou, Vilahamn and Munn. At boardroom level, roles and responsibilities will change, which could have an impact on their transfer plans as people adjust to the new processes in place.\nAdvertisement\nTottenham cannot truly move forward until they have appointed Postecoglou’s successor, with Brentford’s head coach Thomas Frank the leading contender. Frank is more tactically flexible than Postecoglou, but he will have his own ideas on what this squad needs to reach the next level.\nAll of this drama has left Spurs in a messy situation and at risk of failing to build upon the momentum of winning the Europa League. They are being left behind while their rivals, including Chelsea, Liverpool and Manchester United, have already made moves in the transfer market.\nFrank has known Spurs’ technical director Johan Lange for nearly two decades. They previously worked together at Danish club Lyngby. If Frank does join Spurs, hopefully that pre-existing relationship means they will work together effectively and can move on targets quickly.\nWhat positions/players are they looking at?\nYves Bissouma and Rodrigo Bentancur shared the defensive midfield role in the 2024-25 campaign. They have both entered the final year of their contracts and a decision needs to be made about who stays and goes.\nThere is a strong argument to be made that neither of them is a perfect fit for the No 6 position. Spurs should consider signing a specialist who can instantly slot into the starting XI and tutor 19-year-old Archie Gray. The England Under-21 international possesses all of the attributes to excel in that role but needs more consistent game time. Frank wanted to sign Gray at Brentford, which means he might receive more chances next season.\nSpurs have a lot of options at left wing, but none of them are at the peak of their powers. Son Heung-min turns 33 next month and failed to reach double figures for goals for the first time since the 2015-16 season. Wilson Odobert struggled with hamstring injuries, Mikey Moore is only 17 and Mathys Tel joined on loan from Bayern Munich with an option to buy, which has not been triggered yet.\nWith the challenge of Champions League football coming up, Spurs could do with an elite winger who is capable of playing on both flanks. Spurs were interested in Brentford forward Mbeumo, but he has made it clear he wants to join Manchester United.\nAdvertisement\nWhich players could be leaving?\nWe have already mentioned Bissouma and Bentancur, while Manor Solomon excelled on loan at Leeds United last season and will probably leave permanently this summer. Keep an eye on Richarlison and Cristian Romero, too.\nRicharlison has struggled for fitness since he joined Spurs from Everton in July 2022, while Romero has spoken about the appeal of playing in La Liga in the future.\nThere are a load of young players, including Jamie Donley, Will Lankshear and Yang Min-hyeok, who would probably benefit from a loan in the Championship.\nThe new head coach will want to take a good look at everybody before making any decisions, though.\nJay Harris\nBarcelona\nHas anything happened over the past week?\nBarcelona have been edging closer to signing Espanyol goalkeeper Joan Garcia, who has a €25m ($28.4m) release clause.\nThe Barcelona hierarchy see the Catalan keeper as a clear market opportunity at this price — and want to make the 24-year-old the team’s starting keeper for the 2025-26 campaign.\nBarcelona also made an initial approach to Liverpool about attacker Luis Diaz. Their sporting director Deco had publicly named Diaz as a target, but Liverpool said they had no intention of selling the Colombia international.\nBarcelona have raised almost €15m over the last week. Como exercised their €6m option to sign left-back Alex Valle, after he spent the second half of last season on loan at the Serie A club. Barcelona will also earn €7.8m from a sell-on clause, with their former defender Jean-Clair Todibo joining West Ham for €39m.\nBarcelona’s targets seem to be ambitious — are they in a better position with La Liga’s rules?\nLa Liga told The Athletic last week that Barcelona are above their permitted salary limit — meaning they have no space to register any new signings to play next year.\nTo fix that situation, Barcelona must raise money by selling players and/or increasing club income. This could mean further use of financial ‘levers’ (selling club assets such as future revenues in return for money up front).\nAdvertisement\nBarcelona’s most recent ‘lever’, announced last January, involves the sale of future revenues from 475 VIP seats at Camp Nou, which is being redeveloped, to raise €100m. The club has received €58m of the promised €100m — receiving more by June 30 could help, but La Liga has already voiced scepticism over the viability of this deal.\nWhat positions/players are they looking at?\nLaporta has mentioned goalkeeper as a priority position. As well as pursuing Garcia, Barcelona have offered Wojciech Szczesny a two-year contract extension. The Pole impressed the club hierarchy after coming out of retirement to join the club last autumn when previous first-choice Marc-Andre ter Stegen was injured.\nDeco and head coach Hansi Flick have said they would like a left winger, with a player capable of operating anywhere across the front three ideal.\nWhich players could be leaving?\nIt seems unlikely Barca will have three senior goalkeepers next season — if Garcia is signed and Szczesny renews, Ter Stegen will come under pressure to leave. The Germany international, 33, however has no intention of leaving, so an awkward situation is looming — similar to when the club hierarchy tried to persuade Frenkie de Jong to leave in previous summers.\nClement Lenglet, who was on loan at Atletico Madrid for 2024-25, has reached an agreement with Barcelona to leave the club. France international Lenglet has joined Atletico for free on a permanent deal.\nBarcelona would listen to offers for other central defenders Ronald Araujo and Andreas Christensen — both know they are not first choice for Flick, but would like to stay and fight for a place.\nOthers not in Flick’s plans for next season include former La Masia starlet Ansu Fati, young playmaker Pablo Torre, homegrown goalkeeper Inaki Pena and holding midfielder Oriol Romeu.\nDermot Corrigan\nReal Madrid\nHas anything happened over the past week?\nThe main focus has been on Madrid’s pursuit of 22-year-old left-back Alvaro Carreras from Benfica and 17-year-old attacking midfielder Franco Mastantuono from River Plate.\nMadrid reached an agreement with Carreras on personal terms for a long-term contract weeks ago, but they remain in talks with Benfica over the deal and there has been no significant progress towards agreement. The Portuguese club are asking Madrid to meet his €50m release clause. Madrid have been keen to lower that amount and would also prefer to pay a transfer fee in instalments.\nCarreras has travelled to the United States with Benfica for the Club World Cup. Their first game is on June 16 against Boca Juniors in Miami, where Madrid land on June 14.\nThe pursuit of Mastantuono is looking more positive. There had been interest from Paris Saint-Germain, but the player is said to have always given priority to Madrid, while chief scout Juni Calafat has visited Argentina.\nThe Spanish club and Mastantuono have reached an agreement in principle on personal terms and sources with knowledge of the situation suggest it would be a six-year deal.\nAdvertisement\nMadrid and River have been in contact in recent days, and an agreement is expected to be reached. The Argentine club want Madrid to meet Mastantuono’s €45m release clause, but Madrid could end up paying more if they can reach a deal to pay in instalments. It also has to be specified when he would join, as River are counting on him for the Club World Cup and would also like him to finish the 2025 season with them, including playing in the Copa Libertadores.\nIn any case, it is expected that Mastantuono will become the most expensive export in Argentine football history, surpassing the €44.25m Benfica paid River for Enzo Fernandez in 2022. This was a key condition for Mastantuono’s camp, as they wanted to leave River on good terms.\nSources close to Mastantuono, who became Argentina’s youngest player last week, say that despite him having an Italian passport, completing the transfer could take time. It is expected he would land in Spain in August at the earliest, when he turns 18.\nMadrid seem to be willing to spend more this summer — is this to reconstruct the squad for Alonso?\nMadrid are shaping up for their biggest summer transfer window spend since 2019, when they invested almost €300m on Eden Hazard, Luka Jovic, Eder Militao and Ferland Mendy, with Rodrygo also arriving following a deal that had been agreed a year earlier.\nThey planned to sign a centre-back and did so in May by landing Huijsen from Bournemouth via his £50m release clause. They also began to look at left-backs, despite having two under contract in Mendy and Fran Garcia.\nMore arrivals are not ruled out, especially in midfield and even in attack. Xabi Alonso is one of the voices being heard in this reconstruction.\nWhat positions/players are they looking at?\nA left-back — Carreras is their chosen one in that position. They would also like a midfielder, with Nico Paz as another option. Madrid sold him to Como last summer for €6m but have a buy-back clause of €8m. Following talks between the club and the Argentina international’s agents, the final say is with Alonso.\n“Xabi wants more signings,” a Valdebebas source told The Athletic when asked about the potential arrival of a midfielder. An attacker has not been ruled out either.\nWhich players could be leaving?\nLuka Modric, who turns 40 in September, did not receive a renewal offer and is in talks with Milan. There is an expectation a deal will be finalised after the international break. Croatia played the Czech Republic on Monday night.\nLucas Vazquez is expected to leave after the expiry of his contract following the Club World Cup.\nAdvertisement\nReserve goalkeeper Andriy Lunin has said he wants to stay. His agent, Jorge Mendes, has received interest from suitors across Europe.\nLeft-backs Garcia or Mendy could be an option for a departure if Madrid strengthen in that position, although there is no indication of either wanting to leave.\nPaz could also leave again — if he is brought back. Major clubs in Europe have been following him, including Bayer Leverkusen.\nIt is worth paying attention to Rodrygo. He has been approached through intermediaries by some Premier League clubs, with Arsenal keeping an eye on him. Arsenal like Rodrygo and feel he can add another dimension to their attack.\nHowever, the player’s father and agent do not want to enter into negotiations until the striker has spoken to Madrid and Alonso. Rodrygo says he wants to feel important and he feels most comfortable playing on the left or more centrally than on the right.\nMario Cortegana\n(Top photos: Michael Steele, Juan Manuel Serrano Arce/Getty Images; design: Eamonn Dalton)"
    },
    {
      "url": "https://www.nytimes.com/athletic/5489394/2024/05/13/andoni-iraola-bournemouth-contract/",
      "text": "Andoni Iraola has signed a new contract extension with Bournemouth that will see him remain as head coach until 2026.\nThe 41-year-old’s current deal was due to expire in 2025 but the Spaniard has now committed his future to the club for a further year.\nBournemouth — 11th in the table — have already registered their highest ever top-flight points total with Iraola at the helm.\nAdvertisement\n“I’m very happy to sign the contract. For me, it is a matter of renewing the confidence from both sides,” said Iraola.\n“We have had a good experience with our first season together in the Premier League, and I am happy that both sides want to continue the relationship further.\n“I’m proud that we achieved the points record. We are playing in a difficult competition, with very good opposition. The season started slowly, but I think we improved a lot and are playing in the right way.\n“We have to continue improving the team, because the level of the Premier League is really high, and I’m looking forward to working with Simon and the rest of the team over the summer to help us do that.\n“I would like to thank the supporters for everything in our first year together. I am thankful that they were supporting us even in the beginning when we were not winning games, and that they have been very helpful to the players for the whole year.”\nGO DEEPER\nPressing, unlocking Solanke and a 45-yard goal: How Andoni Iraola turned it around at Bournemouth\nBournemouth owner and chairman Bill Foley said: “Andoni has made a huge impact since arriving at the club and we are thrilled to agree to this extension.\n“We have achieved a club-record points tally in the Premier League thanks to a series of excellent performances and results from the team.\n“The players have clearly bought into his footballing philosophy and our supporters have really taken to him. We look forward to continuing to work with him.”\nIraola replaced Gary O’Neil — who was sacked after seven months in permanent charge.\nPrior to joining Bournemouth, he guided Rayo Vallecano to an 11th-placed finish in his final season at the club before joining Bournemouth on a two-year deal.\nBournemouth end their campaign against Chelsea on Sunday.\n‘Significant coup’\nAnalysis by Jacob Tanswell\nThe contract extension is a significant coup for Bournemouth, given the reputation Iraola has forged since arriving in England.\nAdvertisement\nRecognition must go to outgoing sporting director Richard Hughes, who will join Liverpool at the end of the season.\nHe first advocated for Iraola to replace O’Neil and his assistant Simon Francis, who will replace Hughes and has continued the close relationship.\nIraola does not wish to sign long-term contracts at any club, so essentially the new extension will reset the contract he signed when he initially joined.\nBournemouth are a high-pressing, entertaining outfit who have changed styles, as intended, for the enterprising better.\n(Photo by Robin Jones – AFC Bournemouth/AFC Bournemouth via Getty Images)"
    },
    {
      "url": "https://www.nytimes.com/athletic/6545028/2025/08/10/bournemouth-bafode-diakite-transfer/",
      "text": "Bournemouth have reached an agreement to sign centre-back Bafode Diakite from French club Lille.\nThe 24-year-old is undergoing a medical in London today ahead of signing a five-year contract after Bournemouth reached an agreement with Lille on a deal worth €35million (£30.3m) plus €5m in add-ons.\nThe fee would represent the second biggest transfer in Bournemouth’s history.\nAdvertisement\nThe club’s move for Diakite comes amid interest from Paris Saint-Germain in Bournemouth defender Illya Zabarnyi, with the Ukraine international on a verge of a move to the French capital.\nDiakite made 48 appearances for Lille last season, scoring four goals, and has been capped up to under-21 level by France.\nHe began his career with Toulouse and made his senior debut in 2018, appearing for the club’s B team before establishing himself as a regular part of the first team. He helped the side win Ligue 2 and achieve promotion to the French top flight in 2021-22 season.\nThat summer, Diakite signed a four-year deal with Lille and has gone on to make 112 appearances for the team, scoring 13 times. He signed a contract extension until 2028 in September last year.\nIf the transfer is completed, Diakite would become Bournemouth’s third signing of the summer after goalkeeper Djorde Petrovic and left-back Adrien Truffert arrived from Chelsea and Rennes respectively.\n(Claudio Villa/Getty Images)"
    },
    {
      "url": "https://www.nytimes.com/athletic/6234936/2025/03/27/tottenham-manager-next-iraola-ange/",
      "text": "Tottenham Hotspur have made Bournemouth’s Andoni Iraola their top target to take over as head coach should they decide to part company with Ange Postecoglou.\nPostecoglou’s position at Spurs has been the subject of intense scrutiny with the club 14th in the Premier League table, having lost more than half of their league games this season (15 of 29).\nAdvertisement\nTottenham are still focused on finishing the season strongly, especially with a Europa League quarter-final against Eintracht Frankfurt next month. But regardless of what happens over the next two months, there are question marks over Postecoglou’s long-term future. The 59-year-old will still have one year left on his Spurs contract this summer, with the option of a fourth, but his future is in serious doubt beyond this season.\nIraola, 42, has been hugely impressive since he was appointed by Bournemouth in the summer of 2023. His team are 10 points ahead of Tottenham in the Premier League. They beat Spurs 1-0 in December and had the better of a 2-2 draw at the Tottenham Hotspur Stadium earlier this month.\nThe former Rayo Vallecano coach has one year left on the contract he signed at the start of the season, and if Tottenham want to appoint him they would have to pay a £10million ($13m) release clause, although this is unlikely to be a barrier. Ultimately, the ball will be in Iraola’s court, although the situation may also be connected to which other big jobs are available this summer, not least whether there might be a vacancy at Real Madrid. Right now, there is no clarity about what Iraola will decide.\nWhile Iraola would be the leading candidate for a Spurs vacancy this summer, he is not the only potential option. Fulham’s Marco Silva and Brentford’s Thomas Frank are under consideration. Both have taken their teams into the Premier League and established them there in recent years. Fulham are eighth, 11 points ahead of Spurs, and in the quarter-finals of the FA Cup. Brentford are 11th, seven points ahead of Postecoglou’s side.\nSilva is the second likeliest for the role behind Iraola. The 47-year-old was highly rated during Tottenham’s 2023 managerial search, reaching the final three, only for the job to go to Postecoglou instead. Silva has made Fulham a consistent top-half side during his four years there, and is aiming to win their first-ever major trophy in the FA Cup.\nAdvertisement\nSilva also has one year left at Craven Cottage. That deal initially contained a release clause in excess of £10m, so he would not come cheap. But Fulham are confident of keeping hold of their best manager of the modern era.\nFrank held talks with Aston Villa about becoming their head coach in October 2022 when Tottenham’s technical director Johan Lange was Villa’s sporting director but they ultimately opted for Unai Emery. The Dane has won many admirers for helping Brentford punch above their weight since promotion to the top flight in 2021, despite having one of the lowest budgets in the division.\nWhat Tottenham could be getting\nAnalysis by Jay Harris\nIraola’s appeal to Spurs is clear to see — not least because he shares a similar career path and style to former head coach Mauricio Pochettino, who guided them to the 2019 Champions League final. Pochettino was a young and upcoming manager when he left Southampton after a year to join Tottenham. He developed a young core which became Spurs’ best side of the modern era. In Micky van de Ven, Dejan Kulusevski, Lucas Bergvall, Mikey Moore and Archie Gray, the building blocks are already in place for Iraola if he takes on the role.\nIraola crucially already has Premier League experience which was not the case with Postecoglou. There are similarities between the pair in how intense they want their teams to be without the ball but they have different approaches in possession. Spurs have averaged around 112 passes per game in the defensive third under Postecoglou while Bournemouth tend to complete around 59. Spurs under Postecoglou are about controlling the ball by building up from the back, whereas Iraola’s Bournemouth thrive at disrupting their opponents.\nSilva rebuilt his reputation with Fulham after stints with Hull City, Watford and Everton. During his first year in charge, Fulham won the Championship title with 90 points and scored 106 goals. Aleksandar Mitrovic broke the competition’s goalscoring record by finding the back of the net 43 times. After years of bouncing around between the two divisions, Silva has stabilised Fulham in the top-flight. They finished 10th in the 2022-23 campaign and, despite losing Mitrovic, came 13th last season.\nAdvertisement\nFulham have recorded several impressive results this season, including beating Newcastle United twice and taking four points from Spurs. They are on course to break their record points total of 53, set back in 2008-09 under Roy Hodgson. Silva has proven adept at improving players who had fallen out of favour at other clubs including Alex Iwobi, Emile Smith Rowe and Andreas Pereira, while Calvin Bassey and Antonee Robinson have improved under him.\nFrank, meanwhile, became an assistant at Brentford in December 2016 and he replaced Dean Smith as head coach two years later. Brentford were one of the most attractive and exciting teams to watch in the Championship on their way to winning the 2021 play-off final.\nHe adapted his style for their first two seasons in the Premier League and put an extra focus on defensive solidity. They switched shape from 4-3-3 to 3-5-2 and played direct with then-goalkeeper David Raya often launching passes towards Ivan Toney. Frank has evolved the side since and they now primarily play out from the back.\nAt the beginning of his career, Frank coached Denmark’s youth-teams and he has a track record of developing players and harnessing their potential including Toney, Bryan Mbeumo, Ollie Watkins and Mikkel Damsgaard.\nHe has a long history with Lange due to their shared Danish background. Since Lange joined in November 2023, Tottenham have focused on signing young players under the age of 23. Frank’s skillset would perfectly complement this young core.\n(Top photo of Andoni Iraola / Ryan Pierse/Getty Images)"
    },
    {
      "url": "https://www.nytimes.com/athletic/6488728/2025/07/16/bournemouth-djordje-petrovic-chelsea-transfer/",
      "text": "Bournemouth have confirmed the signing of Djordje Petrovic from Chelsea on a five-year contract.\nThe Athletic reported on Friday that Petrovic, 25, had been granted permission to complete his medical with Bournemouth after the two clubs agreed a £25million deal. It completes the south-coast club’s search for a No 1 goalkeeper following the departure of Kepa Arrizabalaga, who spent the 2024-25 season on loan from Chelsea.\nAdvertisement\nPetrovic wanted assurance as a regular starter at Stamford Bridge, but Chelsea could not promise that with Robert Sanchez and Filip Jorgensen featuring prominently during 2024-25. He was one of several out-of-favour players to return for preseason training at Cobham.\n“I’m really happy to be here,” Petrovic said in a club statement. “I came to Bournemouth because I want to grow and I want to play at the best level.\n“Together with this club, with these facilities, I think we can achieve it. I want to help the team get the results, improve every day and be a better player.”\nThe Serbia international made 31 appearances for Strasbourg, Chelsea’s French sister club which is also owned by BlueCo, on loan last season, helping the team to a seventh-placed finish and was voted supporters’ player of the season.\nPetrovic made 31 appearances for Chelsea since signing for the Premier League club from MLS side New England Revolution in 2023. He was left out of Enzo Maresca’s Club World Cup squad which won the tournament after beating Paris Saint-Germain in the final on June 13.\nHe played 86 times for Serbian side FK Cukaricki before moving to New England in 2022, and earned seven caps for Serbia after making his senior international debut in 2021.\nPetrovic’s arrival comes a day after Mark Travers’ departure to Everton was confirmed.\n(Photo: Ryan Pierse/Getty Images)"
    },
    {
      "url": "https://www.nytimes.com/athletic/6435542/2025/06/21/bill-foley-auckland-fc-stanley-cup-steven-adams-golden-knights/",
      "text": "As the owner of several vineyards around the world, Bill Foley knows a thing or two about a successful vintage.\nOlder vines with deeper roots tend to produce more distinguished, coveted wines. And you’ve got to be patient. If you nurture the grapes properly, results will follow down the line.\nBut Foley also has a knack for overturning conventional logic, whether in business or sports.\nAdvertisement\nSo when the billionaire owner of Premier League club AFC Bournemouth launched a new football club in Auckland, New Zealand, a country traditionally dominated by rugby, success might have been considered a long-term dream.\nInstead, Auckland FC, which competes in the Australian top flight, won the league stage in its first year at a canter, and only narrowly missed out on lifting the A-League Champions trophy through the play-offs.\nAlong the way, they made history by smashing a string of records for an expansion team — including the league’s highest average attendances, winning its six opening games, and the longest run of clean sheets in Australian national league history. Add to that the highest domestic crowd record for a regular season football match in New Zealand.\nIt is not the first time Foley’s clubs — others are French Ligue 1 side Lorient and Scottish Premier League club Hibernian — have defied expectations. In 2017, he launched a new National Hockey League (NHL) club in, of all places, the Nevada desert.\nHe caused surprise, and even prompted derision, by vowing that his new team, the Vegas Golden Knights, would lift the Stanley Cup within their first six seasons. But the Golden Knights did it, and although Auckland only just failed to repeat the trick within a single campaign, they appear to have uncorked something special in New Zealand.\n“I was totally confident,” says Foley, reflecting on Auckland’s audacious debut season. “We should have won everything.”\nThere was a defining moment in the play-off semi-final first leg win against Melbourne Victory (the team Brighton owner Tony Bloom has a minority share) when Auckland, winning 1-0 away, launched a counter-attack in which forward Neyder Moreno’s shot hit the post, rebounded onto the other post then dropped into the arms of Victory goalkeeper Jack Duncan.\nAdvertisement\n“I had that sinking feeling of, ‘Uh oh, I hope that doesn’t come back to haunt us,'” Foley says. “Of course it did.”\nThat first leg ended 1-0 — a slim aggregate lead — and in the second leg back on Kiwi soil, the Australians won 2-0 with one of their goals a cruel deflection. The new boys were unlucky, then, in the manner they missed out on ultimate glory. But it was less good fortune than savvy planning and vision that led to their rapid ascent.\nThe first thing was sensing a weakening in rugby union’s grasp on Auckland. Partly due to safety concerns around concussions and injury, but also a complacency, which Auckland FC’s chief executive Nick Becker, who was born and bred in the city and played high school rugby, noticed when he returned home after living in England (including working for Manchester City).\nBecker was tasked with building Foley’s football club from the ground up and used his local knowledge, plus 20 years of experience in the UK, to ensure this venture would work. “There is a famous rugby club in Auckland called Ponsonby,” he says. “One of the oldest in New Zealand and effectively an All Black factory.\n“When I left to move to England in 2003, it probably had two or three thousand kids playing there. Next door to it is a football club called Western Springs, which then had a handful of kids playing at it, at the most 50.\n“When I returned, it had flipped on its head: Western Springs has over 3,000 kids and Ponsonby has 400 at the most. It’s a generational shift. Rugby is the national game and I still love it, but it has kind of taken its feet off the pulse of the nation.\n“They’ve done a bad job in connecting with communities while football has grown and grown with the success of the Premier League, La Liga and even MLS with Lionel Messi.”\nBecker connected with as many of Auckland’s growing list of amateur football clubs as he could, while Foley demanded the same community focus that made the Golden Knights a success.\n“In Vegas, we gave tickets to firemen, policemen, first responders, nurses, doctors, lawyers and teachers,” says Foley. “We did a study that said there were around 150,000 avid hockey fans in Las Vegas all from somewhere else; whether it was Calgary, Minneapolis or Vancouver.\nAdvertisement\n“We made sure we got involved intimately with the community and there were similarities with Auckland. Vegas is not a hockey town. At first, we got a lot of feedback saying we were crazy, you can’t skate on the sand, you can’t do this and that. Well, if I’m told I can’t do something, then I get really serious about accomplishing it.\n“Auckland is a vibrant, multi-cultural city and has more in terms of families. We knew ticket prices had to be fairly accessible and drive traffic to the games, get our players involved with local teams and develop an academy-like structure.”\nAt their 27,000-seater Go Media stadium, the club have developed a terrace culture. A section of fans have nicknamed themselves The Port, after the city’s port area, growing into a noisy mix of locals and British ex-pats, of whom many bring their children to try and emulate the atmosphere of matches back home.\nThere are also supporters from the city’s Latino and Indian communities. Matchdays are family-oriented with an emphasis on keeping supporters at the ground before and after games, based on Foley’s experience with U.S. sport.\nAt one end of the stadium, Auckland have installed a huge inflatable slide which goes down a grassy hill — a big hit with young fans — and next to it is an inland beach area, which is another popular feature with the A-League season running through the Southern Hemisphere summer.\n“We have the hardcore fans who sing for 90 minutes, then the family dynamic,” says Becker. “It’s really captured the imagination of Auckland.”\nBecker acknowledges that the speed of starting the club in the space of a year was, at times, daunting. “I arrived back in Auckland in January 2024 and we played our first game 10 months later,” he recalls.\n“At that point, all we had was a football director, our head coach and a commercial director, so there were four of us crowded around two desks at an office in one of Bill’s other businesses. It was kind of mad how it all came together so well.”\nAdvertisement\nFoley was in constant contact offering advice and steadying any nerves. As a graduate of U.S. military academy West Point, who had a successful career in his country’s air force, he values his clubs’ staff as he once did the men who served under him.\n“He gave us solid direction,” adds Becker. “One of the main things he said was: ‘You’ll go a lot further if you get good people’. So when we hired people across the club, and even players, it wasn’t just, ‘How good are they?’ It was also: ‘Are they a good human being?’\n“There were nervy times when you’re like: ‘F***, is this going to work?’ Whether it’s walking out of boardrooms where they just haven’t got it, or missing out on players because they didn’t believe in what we wanted to do. It was a real start-up experience — and there are always moments when you question yourself.”\nIt has helped that Auckland have won so many home games. “We didn’t forget the football side,” says Foley. “We made sure we had a very competitive team.”\nFormer Northern Ireland international Terry McFlynn, who had a successful playing career in Australia with Sydney FC and was running Perth Glory’s academy, was hired as their director of football. In turn, he recruited his former Sydney team-mate Steve Corica to become Auckland’s first-team manager.\nThe club’s popularity has resulted in commercial interest, with 35 deals signed already, including two with ANZ and Anchor, the country’s biggest names in banking and commercial dairy, respectively. An embedded TV crew have followed their first season for a documentary out later this year.\nThere is a boardroom star factor too. As with Bournemouth, where Foley brought Hollywood actor Michael B Jordan on board as an investor, he has compiled a who’s who of famous Kiwis: former All Black Ali Williams, AllBirds footwear billionaire Tim Brown, Zuru Toys founder Anna Mowbray, and ex-West Ham defender Winston Reid.\nAdvertisement\nThere is even an NBA star onboard: Houston Rockets centre Steven Adams, who is from New Zealand. And the 31-year-old is not just lending his famous name to the club; he is invested in its success on both levels.\n“I was attracted by the group itself,” he says. “And by the Kiwi sportsmen who are successful, who know how to win, and have had winning experiences. I would say I am a football fan — not necessarily knowledgeable about all the tactics and whatnot, but I appreciate any form of physical expression.”\nAdams has been pleased to see his homeland respond so enthusiastically. “It’s been great to see the strong support,” he says. “There is the sports side, obviously, but there’s the whole experience: seeing families and kids out there, enjoying themselves.\n“My hope is to win championships and also, the grassroots piece is really important. To create pathways for kids that give them more opportunities for school and their career.”\nCuriously, there is an Auckland football team competing back in the U.S. at the moment — but it isn’t the one Adams has bought into. Auckland City, who made headlines by losing 10-0 to Bayern Munich on Sunday, are a semi-professional side who are there by virtue of being the champions of Oceania, or winners of the OFC Champions League.\nBecause they compete in Australia, and Football Australia is affiliated with the Asian Football Confederation (AFC), Auckland FC and Wellington Phoenix cannot take part in the OFC Champions League. So no limelight in his homeland this summer then, but Foley’s focus is increasingly laser-like on the sporting part of his business.\n“I’m at the stage now of basically limiting most of my public company positions,” he explains. “I have resigned as chairman of Alight (a health and wealth management company). Then I stepped down as chairman and CEO of Cannae, which is one of the investors in Black Knight Football Club.\n“Now I’m the vice chairman and just responsible for football operations. That’s all I want to do.”\nBut after such a remarkable rise, is there a risk Auckland’s second season might not live up to the first?\n“Now the players have been to the semi-finals, and the group has stayed together, they know what it is like to be there and lose at that stage,” says Becker. “They won’t want that feeling again. The next step is to win it, and that’s our motivation for next season.\nAdvertisement\n“The bigger risk might have been to go through and win it all. Then the motivation for next season would have been a different challenge, but now we have unfinished business.”\nThe last word goes to Foley, with a smile but also a dash of that old military steel behind his eyes: “If anyone sits on their laurels, they won’t be playing for Auckland FC,” he says.\n“Period.”\n(Top photo: Auckland FC supporters; by Hannah Peters via Getty Images)"
    },
    {
      "url": "https://www.nytimes.com/athletic/5918365/2024/11/14/kevin-garnett-the-basketball-100-book-excerpt/",
      "text": "“The Basketball 100” is the definitive ranking of the 100 greatest NBA players of all time from The Athletic’s award-winning writers and analysts, including veteran columnists David Aldridge and John Hollinger. This excerpt is reprinted from the book, which also features a foreword by Hall of Famer Charles Barkley.\n“The Basketball 100” is available Nov. 26. Read David Aldridge’s introduction and all of the excerpts here.\nIt was one of those perfect summer evenings during a family trip from Minnesota to the northeast in 1995, 65 degrees and sunny as 6-year-old me walked into Fenway Park for the first time. The Red Sox were hosting the Toronto Blue Jays and we settled into our seats near the top of a section above the third-base dugout, ready for a momentous occasion for a sports-crazy kid who begged his parents to sprinkle some games into the history and sightseeing.\nAdvertisement\nAs I sat down and marveled at the Green Monster in front of me, I couldn’t help but pull out a Sony Walkman, put the headphones over my ears, and start listening as intently as I was watching. It wasn’t the radio broadcast of the game but coverage of the 1995 NBA Draft.\nMy hometown Minnesota Timberwolves had the fifth pick, and there were so many intriguing possibilities in a class filled with household names. Jerry Stackhouse and Rasheed Wallace from North Carolina. Damon Stoudamire from Arizona. Michigan State’s Shawn Respert and UCLA’s Ed O’Bannon. All were players I watched on television at storied college programs who became well-known stars with tantalizing potential.\nThere was another name out there I had never seen take one dribble, but he grabbed my attention as much as any other. In the week leading up to the draft, I pulled Sports Illustrated out of the mailbox to see a skinny high school kid on the cover with the tagline “Ready or Not … ”\nThe story of the greatest players in NBA history. In 100 riveting profiles, top basketball writers justify their selections and uncover the history of the NBA in the process.\nThe story of the greatest plays in NBA history.\n“Three weeks ago Kevin Garnett went to his high school prom,” the subhead read, stretching across a young man with legs so long they did not even fit onto the magazine cover despite his best efforts to fold himself into the camera frame. “Next week he’ll be a top pick in the NBA Draft.”\nThis was before YouTube compilations, Twitter (or “X”) highlights, and ESPN coverage of high school games, so there was an air of mystery surrounding this kid’s game that rarely happens these days. And he was a kid, just a little bit older and a whole lot bigger than I was at the time. The story told of a player with the audacity to jump straight from high school to the NBA, the first player to do it in two decades.\nThe great Jack McCallum detailed a big man with guard skills and movie-star charisma, someone who NBA front-office personnel predicted would be the kind of magnetic presence who could “put backsides in the seats when Michael and Shaq aren’t in town.”\nAdvertisement\nAs I sat in one of the grandest ballparks there is, on a picture-perfect night, my biggest thrill came when NBA commissioner David Stern announced, “With the fifth pick in the 1995 NBA Draft, the Minnesota Timberwolves select Kevin Garnett from Farragut Academy in Chicago.”\nGarnett’s 21-year career started with cementing the Timberwolves’ place in the league and also included returning the proud Boston Celtics to their once-preordained spot at the top of the basketball world.\nWidely considered one of the best and most versatile defenders of his or any generation, Garnett was the 2004 NBA MVP after leading the Timberwolves to the Western Conference finals, their only trip outside the first round in franchise history. He was a 15-time All-Star, the NBA Defensive Player of the Year in 2007–08, and a nine-time member of the All-Defensive First Team, the rare player capable of shutting down any position on the floor. He won the rebounding title four times, and since the NBA began tracking offensive and defensive rebounds in 1973–74, no NBA player has grabbed more than his 11,453 defensive rebounds.\nAbove all the numbers and superlatives, no one played with more fire, from the moment he first set foot on the court in 1995 to the day he retired 21 years later.\nUp until he was drafted, for anyone who wasn’t old enough to remember the Minneapolis Lakers, professional basketball in Minnesota was more of an idea than a reality. The Timberwolves entered the NBA in 1989, lost at least 60 games in five of their first six seasons (they lost 53 in the other one), and were so mismanaged that they nearly moved to New Orleans in 1994. There was nothing identifiable about them.\nIn a league with Michael Jordan, Shaquille O’Neal, Hakeem Olajuwon, Charles Barkley, and Penny Hardaway, Wolves fans had to settle for Christian Laettner, Tom Gugliotta, and Doug West to get them excited. They always seemed to be a step behind, from building the last arena in the league with more seats in the upper deck than the lower bowl, to constantly ending up one pick away from a true star in the draft lottery.\nAdvertisement\nGarnett represented the first time the Timberwolves, as an organization, were ahead of the game. When he arrived in the Twin Cities, it marked Wolves fans’ first introduction to the real NBA. Until that point, Wolves fans had only known scrappy, undertalented teams that only had a chance to win on a given night if the opponent took them lightly. Once Garnett arrived, the team quickly morphed from the cute, cuddly Shep teams that were easily dismissed to the snarling, howling teams lurking in the trees that would huff and puff and blow your basket down.\nTarget Center was already there, so you couldn’t say it was the place that KG built. But he was responsible for keeping the lights on. He was the franchise’s first bankable star, endearing himself to the hardworking, basketball-loving community by making sure anyone who bought a ticket to come to see him play got their money’s worth. His No. 21 jersey was the only one for fans to have when he first arrived, and the All-Star appearances and playoff berths that quickly followed gave young fans a reason to tune in for the first time in, well, ever.\nBefore Garnett’s arrival, I was a casual NBA fan. I loved Jordan, of course, and rooted for the Gary Payton/Shawn Kemp Sonics. My father was a Celtics fan. But there wasn’t much of a reason to watch the Wolves other than to see the other team.\nGarnett changed all that. His youthful enthusiasm was instantly endearing. The way he always insisted on being listed at 6-foot-11 rather than 7 foot 1 to which he was likely a lot closer — KG always thought it would stop coaches from making him ditch his guard skills to live in the post—resonated with a fan base that counts modesty as one of its most treasured personality traits.\nBut it was the intensity that drew everyone in. Garnett would work up a full lather in pregame warm-ups, stewing and swearing and foaming at the mouth as he prepared to go to battle in the game. Before every tip, he would stand underneath the Wolves basket, tie his shorts, and butt his head against the stanchion, talking to himself the entire time. Maybe it was something an opponent said in the media that had pissed him off. Maybe it was the suggestion, real or invented, that another power forward was better than he was. Maybe it was the doubts that Garnett could convert a hockey state into a hoops one. It was probably a combination of all those things. But he brought it every night.\n“I’m out there and I suit up every night,” Garnett told coaching legend and TNT analyst John Thompson in an epic interview as the team was starting to crumble in 2005, a season after reaching the Western Conference finals. “I suit up every night. Banged up, hurt, whatever. Hundred percent, 30 percent, ain’t no numbers. It’s in my heart, and you can’t measure that.”\n“This ain’t golf. It ain’t tennis,” Garnett, who politely declined an interview for this, told Thompson as tears streamed down his face. “It ain’t about me. It’s about us.”\nAdvertisement\nAs I rose the journalism ranks and left my fandom behind, the closer I got into KG’s orbit, the clearer it became how his passion, his zeal, and his cutting competitiveness could transform an organization. I was a pup as his first run in Minnesota was winding down, most often not even getting to write stories from the games but rather tasked with compiling interviews and quotes for The Associated Press writers to include in their stories.\nI had to wait in the locker room for Garnett to come out to talk. He was notorious for taking a long time to come down after the game before addressing the media, so I would have to stand sentry while the writers pecked away on deadline.\nIt was always worth the wait. Some players stare through a reporter, muttering whatever inanities it takes to get him off the hook and out of the locker room as quickly and painlessly as possible. Garnett stared into your soul as he dissected your motives, then offered detailed and colorful examinations of what went right or what went wrong on a particular night.\nFor a young reporter and an older one who was exposed to him again when he returned to the Wolves at the end of the 2014-15 season, it was captivating. In the earlier days of Garnett’s time in Minnesota, reporters sat courtside at Target Center. One of Garnett’s favorite pregame rituals was to come to the scorer’s table, dump a huge portion of talcum powder into his massive hands, and clap them together right over the reporters sitting there preparing for the game. It was his way of needling us. Some of the veteran scribes would purposely wait to get to their seats until after the opening tip so Garnett couldn’t get them, grumbling the whole way about how no one ever dared tell him to knock it off.\nI, on the other hand, developed a ritual of my own. I would get out there early, bringing with me an extra packet of pregame notes. I would tear sheets out of the packet and cover my laptop. Then I would place my notebook over the drink I brought to ensure none of the powder would land in my Coca-Cola. Then I would sit there and let KG have his fun. He would say a little “What’s good?” as he doused me in the powder, then head to center court for the opening tip. I would then stand up, wipe the powder from my hair, pick up the sheets of paper covering the laptop, and dump them into a nearby trash can. Fans would laugh, and I would too. It never bothered me because I always saw it as playful hazing, not bullying. It was clear even back then that he was a Hall of Fame player, the most important member of the franchise, and I wanted to experience as much of him as possible.\nThat also meant seeing him change the energy in the room as soon as he was within 10 feet of it. Pregame locker rooms for KG-led teams were painfully quiet, with Garnett making it clear in no uncertain terms that it was a time for focus, preparation, and concentration. Those who could not abide were castigated. Those who didn’t like it … well, this is what he told me in 2018 at the height of the Jimmy Butler drama that eventually led to the latter being traded:\n“I built this house,” Garnett said when I asked about why he never requested a trade back in the day. “I’m not leaving this goddamn house. You can get the f——up out of here. You don’t like it, then leave.\nAdvertisement\n“I would hear a bunch of whining and it’s snowing and it’s cold and why are we practicing? Man, you know what this was when you signed up. If you don’t want to be here, get the f— up out of here, man. Guys know this. Guys know what you sign up for. I never asked for a trade because I never wanted to be traded.”\nIt was precisely what Timberwolves fans needed to hear. Butler was burning their house down, trashing the organization and making a mockery of their fandom. Garnett always stood tall for Minnesota. And even though he left on bad terms and would often say he wished he would have gotten out sooner, he always rode for ’Sota in the heat of the moment. Where others snickered at it, Garnett embraced it. And the people loved him for it.\nHe went to Boston and won a championship with Paul Pierce and Ray Allen. Pierce was the face of that team and Allen provided the sizzle, but Garnett was the beating heart in the middle of it all. The Celtics probably would have won two had Garnett not suffered a knee injury the following season.\nIn a franchise filled with legends, Garnett belongs right there with them. He’s often credited for changing the tenor of that team with his maniacal practice habits and suffocating defense. His No. 5 jersey was retired in Boston in March 2022, a legacy-cementing achievement for one of the greatest power forwards to ever do it.\nWolves fans won’t ever let him go. There was bad blood with Wolves owner Glen Taylor and tragedy when Flip Saunders passed away, but through all the struggles this franchise has endured, Garnett remains a shining beacon to their long-suffering fans. He could be demanding and biting behind the scenes, but that was the way for him to turn an unserious franchise into one that commanded respect. And while so many players, coaches, and executives came and went, Garnett would never allow Minnesotans to feel inferior.\n“I left my spirit and my soul in there,” Garnett said then. “You can’t ever replace that. You feel me? That will always be, forever, as long as they have the Timberwolves in Minnesota.”\nTo this day, he is the franchise’s career leader in games played, minutes played, field goals made, scoring, rebounding, assists, steals, blocks, triple-doubles, and win shares. But his legacy is so much more than his name at the top of a statistical category.\nAdvertisement\nTo root for Kevin Garnett was to root for Minnesota basketball. He proved that when it was done right, this sport didn’t have to take a back seat to hockey in this community. When this league was failing in this market, Garnett arrived to prove basketball could flourish in Minnesota. When Garnett prowled the hardwood, be it in the playoffs or when he made his triumphant return after the 2015 trade from Brooklyn, the arena was as loud and as rowdy as any other in the league.\nKG huffed and he puffed and he blew that roof off. Here is hoping that one day, somehow, he and the Timberwolves figure things out so he returns to hear that roar again.\nCareer NBA stats: G: 1,462, Pts.: 17.8, Reb.: 10.0, Ast.: 3.7, Win Shares: 191.4, PER: 22.7\nAchievements: NBA MVP (’04), Nine-time All-NBA, 15-time All-Star, Defensive Player of the Year (’08), NBA champ (’08), Olympic gold (‘00), Hall of Fame (’20)\nExcerpted from “The Basketball 100” published by William Morrow. Copyright © 2024 by The Athletic Media Company. Reprinted courtesy of HarperCollins Publishers\n(Illustration: Kelsea Petersen / The Athletic; Photo: Jared Wickerham / Getty Images)"
    },
    {
      "url": "https://www.nytimes.com/athletic/6413844/2025/07/01/kepa-arrizabalaga-arsenal-transfer-tldr/",
      "text": "Arsenal have signed goalkeeper Kepa Arrizabalaga from Chelsea for a fee of £5million ($6.9m).\nThe 30-year-old Spaniard has signed a three-year deal at the Emirates and will be back-up to No 1 David Raya.\nAs part of this summer’s transfer coverage on The Athletic, in addition to breaking news, tactical analysis and in-depth reads, our Transfers TLDR series (you can read them all here) will bring you a quick guide to each of the key deals.\nGive me their backstory in 100 words…\nEven though he had not commanded a transfer fee for seven years, Kepa remains the most expensive goalkeeper in history after Chelsea paid £71.6million to bring him from Athletic Club in 2018.\nHis move to Stamford Bridge did not work out as planned, however, only reaching double figures for Premier League appearances in a season just three times for the London club.\nAdvertisement\nHe spent a season on loan at Real Madrid as understudy to Thibaut Courtois in 2023-24 and was a regular starter in the Premier League last season on loan at Bournemouth.\nHe learned his trade in the Basque Country, where he was born and raised.\nSteve Madeley\nWhat should, and shouldn’t, I expect to see?\nKepa has evolved, but his strengths and weaknesses remain broadly the same as when he arrived at Stamford Bridge as one of the most coveted goalkeepers in world football.\nHe is capable with his feet, which means he should work as an understudy to David Raya at Arsenal, and fans can expect to see him take chances in possession. But while he has become more reliable, his shot-stopping is still erratic, so fans should not expect him to be an impenetrable wall.\nSteve Madeley\nHow will he fit tactically?\nRaya’s shared Golden Glove win in 2024-25 means Kepa is unlikely to receive too many minutes unless his compatriot picks up an injury.\nWhile occasionally error-prone with his handling, Kepa conceded 2.9 fewer goals than expected last season, as the graph shows, despite Bournemouth’s direct style resulting in quality opportunities for the opposition.\nHis distribution is solid. Kepa has completed 77 per cent of his passes over the last three league seasons despite 38 per cent of his attempts being Opta-defined long passes (travel 35+ yards).\nAt Bournemouth, he embodied Andoni Iraola’s direct approach, with 44 completed passes to winger Antoine Semenyo across the league season.\nRaya has regularly gone long over the past two seasons (43 per cent of passes on average), so Kepa should be able to deputise. But Kepa can also be indecisive with his positioning and claiming of crosses, which will be a concern.\nAnantaajith Raghuraman\nWhat’s his injury record?\nKepa suffered an adductor injury last October and missed two league games, having faced the same issue a year earlier. His only serious injuries before that were a shoulder problem in 2020 and a bruised metatarsal and torn muscle bundle in 2017. He missed around two months on all three occasions.\nAnantaajith Raghuraman\nSomeone who knows him says…\nBournemouth manager Iraola told the Bournemouth Echo in March: “He has been playing continuously all the season, very few big mistakes, very consistent.\n“He helps us a lot with the ball. I think he’s transmitting — in a very young team — the experience, the calmness, in sometimes crazy games. He’s putting some calmness in a team that normally plays fast. Sometimes you have to make quick decisions and I’m liking it and I think I see him enjoying the situation.”\nSteve Madeley\nWhat do we know about the finances of the deal?\nKepa has joined Arsenal on a three-year deal, moving across London for a £5m fee. He leaves Chelsea for just seven per cent of what they paid for him seven years ago.\nWith both clubs now into their 2025-26 accounting period, all figures related to this deal will be booked in the coming season’s financials.\nChris Weatherspoon\nWhat impact will this have on both clubs’ PSR calculation?\nAssuming agent fees of 10 per cent on the transfer, and the transfer levy due on the deal, Kepa’s signing will cost Arsenal a total of £5.7m, spread across his three-year contract term. £1.7m will land in their 2025-26 books, then £1.9m a season over the next two financial years before a mere £156,000 is recorded in 2028-29 (a quirk of player contracts running to the end of June while Arsenal’s accounting date arrives in May).\nAdvertisement\nChelsea signed Kepa from Athletic Club in August 2018 for £71.6m, a world record fee for a goalkeeper, which still stands today. He signed a seven-year deal, then extended for a further year last summer.\nThat extension included the insertion of a £5m release clause, a huge drop on the fee he was brought to Stamford Bridge for.\nHowever, due to the way transfer fees are accounted for, Kepa’s book value has also reduced significantly. His value at Chelsea is close to the price Arsenal are paying to sign him and, after estimating agent fees on his initial purchase and subsequent contract renewal, we project Chelsea will book an accounting loss of just £0.4m on Kepa’s sale.\nAs well as the release clause, last year’s contract extension also saw Kepa’s wages significantly reduced, so the saving from those on Chelsea’s finances will be relatively immaterial.\nChris Weatherspoon\n(Top photo: Ryan Pierse/Getty Images)"
    },
    {
      "url": "https://www.nytimes.com/athletic/4518222/2023/05/14/bournemouth-owner-bill-foley-interview/",
      "text": "When you spend most of your time writing and talking about bad examples and cautionary tales, you can get a bit… well, negative.\nWe imagine that British consumer rights expert Martin Lewis finds it hard to believe there are some utility companies that are not trying to fleece everyone, Gordon Ramsay struggles with the idea that anyone else can make a decent beef wellington or Roy Keane will ever accept that today’s players want it as much as he did.\nAdvertisement\nGood football club owners are our blindspot. We know they exist but they get crowded out by all the rubbish ones creating havoc in plain sight. So, when we do get to meet a good one, we should mark the occasion by getting out of the way and letting them speak for themselves.\nAnd that is what we propose to do with this interview with Bill Foley, the 78-year-old businessman who bought AFC Bournemouth in December, adding the Premier League club to a growing stable of sports teams that includes the Vegas Golden Knights of the National Hockey League.\nFoley spoke to us from his California home on the morning of game five in the Western Conference semi-final between the Golden Knights and the Edmonton Oilers, a game his team would win to take a 3-2 lead in the best-of-seven series. Since their launch as the NHL’s 31st team in 2017, the Golden Knights have made the play-offs in five of their six seasons, reaching the Stanley Cup finals in their first campaign. No NHL expansion team has ever been so successful, so quickly.\nBournemouth lost at Crystal Palace on Saturday but their mission — avoid relegation — has already been accomplished, a feat few thought was possible when the newly promoted team got thumped 9-0 by Liverpool in August. That is not an experience Foley intends to go through and he will be setting his team loftier goals than survival in the seasons to come.\nBefore we let him speak for himself, we should make it clear that when we say he is a “good owner”, we obviously do not know how his ownership of Bournemouth will pan out; British football’s history is packed with owners who made good first impressions only to leave to a chorus of boos, and that could easily be Foley’s fate.\nBut he has already achieved more than many by not promising too much and actually delivering tangible improvements. He has put his money where his mouth is and has made himself available to fans and the media. And, most of all, he has a plan that has already worked somewhere else.\nBournemouth fans, meet the newish custodian of your club. Golden Knights fans, here is the boss’ latest venture…\nThe Athletic: We know you have plans to make every game at Bournemouth feel like a real, stand-alone event, and we’re told that is what you have achieved with the Golden Knights. To those who haven’t ticked it off their bucket list yet, what is a Vegas Golden Knights game like?\nFoley: Well, Las Vegas is the entertainment capital of the world and, when we got the team, our business plan was to be competitive with all the shows on the Strip. So, we have a big pre-game in the Plaza and then our Drumbots (the official drumline of the Golden Knights) march in with our cheerleaders and lead the fans into the game. It’s a big show.\nAdvertisement\nAnd we love doing skits. We have our own production company and we try to do a new skit every month. At the start of the season, I was in one based on the scene in Dumb and Dumber where the killer is sat between them in the truck and they’re playing “it”. So, it was me and (Golden Knights players) William Karlsson and Jonathan Marchessault. We also have a pre-game show where our knight fights the other teams’ mascots. So, we have a pretty big entertainment and video department and we put a lot of money into it.\nLook, it will never be that at Bournemouth but we are buying some really big LED screens that we can show videos on and we’re starting every game with “Hey Jude”. We’re doing all kinds of little things. In the NHL, we have rally towels — they’re little towels that might say Golden Knights or have our logo on them. So, we put a “Red Army” rally towel on every seat and, at first, people didn’t really know what to do with them but then some of them got it and started waving them around. We weren’t sure how that would go down but it was OK.\nThe Athletic: Why “Hey Jude”? Is it just your favourite Beatles song?\nFoley: Yeah, I like it but (president of business operations) Jim Frevola came up with the idea. And the fans seem to love it.\nThe Athletic: And everyone knows the words! But getting back to what you can do at Bournemouth, when you bought the club there were some over here who said “he does know about the stadium, doesn’t he?” You did, of course, but what is the plan?\nFoley: Obviously, it is inadequate. It’s too small and we don’t have the right hospitality assets. We have 13 or 14 suites but we need 30, maybe 33. We can sell them — our pre-game meals and bars are packed.\nWe really have two choices. We still have five years on our lease at the stadium. The South Stand is a temporary stand, so if we wanted to renovate the stadium we could tear that down and put about 5,000 seats down there with a two-tier deck and have it wrap around and join the Main Stand. The trouble is, you would then need to build a second deck there and almost push it over the Main Stand, and we’d still be stuck with the concourses and inadequate hospitality.\nAdvertisement\nSo, the best approach is to try to build a new stadium and to do it economically, spend £80-90million ($99.6m-$112.1m), with the right hospitality and about 20,000 seats. We don’t need much more than that but we do need to open up our ticketing to new fans. They’ve been using a points system until now — you get a point for attending a game — but that just means everyone in the stadium looks like me: old, white guys. We want younger people. The tickets aren’t that expensive but to widen our fanbase we need to expand. We’re very intent on accomplishing that mission.\nThe Athletic: Sounds expensive…\nFoley: No, we could get some pre-payments on suites, we could get some PSLs (personal seat licenses, or debentures, as they are known in the UK) in certain areas of the stadium to raise some financing. We’ve actually got a separate group that is interested in being a partner in the stadium. We don’t think the money is going to be the problem; it’s more a matter of timing.\nBut, in the meantime, the stadium was old and decrepit, so we’ve wrapped it with AFC Bournemouth slogans and logos, and we’ve painted it, inside and out. We’ve now got approval to do a good-sized food and beverage opportunity outside the South Stand. That will enable us to move some of the things that happen in the Main Stand that take up a lot of space and aren’t as profitable as they should be, and then we can use that space for more high-end hospitality. There’s a big demand for that.\nWe want to get some real pre-game activity going outside and we’re making a lot of progress. I’m proud of the work the guys have been doing, Jim Frevola and his team. He was my chief sponsorship officer at the Golden Knights and then he went to the Tampa Bay Lightning. He’s running the business side of the operation. He hasn’t gotten rid of people, he’s just brought some new ones in and moved others. They were understaffed before and maybe lacked some experience. Two of our big sponsors — great partners — weren’t paying enough money, so Jim told them “You’re going to have to pay double from next season”, and they have renewed.\nThe Athletic: It was that easy?\nFoley: Their contracts were about to expire and we said we wanted to renew you but it’s not for £700,000, it’s £1.5million, and it’s not for £400,000, it’s £800,000. I don’t want to name them but they are key sponsors.\nAdvertisement\nWe have the worldwide rights to AFC Bournemouth. At the Golden Knights, I have an 80-mile radius where I have complete control. In Bournemouth, I have the world. If we have £12-13million in sponsorships today, why don’t we have £80m? Then we’ll have real revenue coming in to reinvest. For me, it’s a pretty easy fix. Obviously, it’s going to take time: we’re not going to go from £13million to £80m overnight, but we can do it. We’ve got an international operation up and running in Vegas and Bournemouth, and Jim has opened a sponsorship office in London — that’s where the companies are.\nI’m happy with where we’re going but the reality is we need a new stadium. Our other gating issue is that our current training ground is where the stadium will go. That means we need to get our new training facility built and move our first team, academy and women’s team there. It’s north of Bournemouth (at the former Canford Magna Golf Club). We have the space, we have 57 acres, and we’ve built one pitch. We’re building the indoor pitch right now and we’re just about to start the training facility. It should be ready in the fall of 2024.\nThat will mean we can move our business operations to where the training facility is now (in Kings Park, next door to the Vitality Stadium) so we can work on our stadium plan and have more room for hospitality at the stadium. Our offices are taking up space that we should be selling. We’ve got a whole plan for expanding our restaurants and bars. We want people to come an hour or two before the game, and stay an hour or two afterwards. But we have to make it easier. And if some of them don’t want to drink a better glass of wine or beer, that’s fine, they can drink a less expensive one. We’re going to give fans options. And we’re seeing the results already. We’re trying to do something every week but the big changes will come over the summer.\nThe Athletic: There’s a lot going on. Are you worried it could be too much, too soon? British football fans can be quite conservative.\nFoley: We’re not afraid of change. We want to make things better. I want this team to play in Europe. Our ultimate goal is not to worry about avoiding relegation but to move way up the table. To do that, we’ve got to improve our team, improve our facilities, our infrastructure. We have to be a place where players want to go, where agents will say this is a place you want to go. Not a stepping stone but a destination.\nI know we can do it because I did it with the Golden Knights. We were an expansion team and we had our expansion draft but when we tried to get some free agents, none of them wanted to come. Their agents said, ‘You’re just going to lose, we don’t know about your facilities’ and so on. So we invested quite a bit of money in first-class training facilities and a first-class arena. And we started doing things for players that other teams weren’t doing. We showed them we’d take care of them. Now we’re a destination. If you talk to players, they want to come to Vegas. It’s a competitive advantage. That’s why I went for Bournemouth. I am completely confident we can do it.\nThe Athletic: The fans are going to love hearing that but, getting back to the stadium, it sounds like you have a lot of freedom to make changes at the Vitality Stadium. It begs the question: why didn’t your predecessor Maxim Demin do it?\nFoley: I don’t think he was as focused on the gameday experience as I am. When I go to the games, I try to sign every autograph and stop for every picture. I want the fans to think I’m just another guy. I happen to be fortunate enough to own the team but I’m one of them. The previous ownership focused on bringing players in but not the fans’ experience or making the place a destination. I’m just using the Golden Knights as my playbook, frankly. We built our team here from scratch.\nAdvertisement\nI was talking to Loic Fery (co-owner of French side Lorient, where Foley has a minority stake) today about what we want to do, and he definitely got it. That’s another very good opportunity we have. We have a path to majority ownership and, as of June, we’ll have about 40 per cent of the team. It’s a place where we can put players and buy players. The multi-club model is the second part of the story. If I’m going to acquire players, why don’t I acquire them from myself? It’s a lot less expensive. The only downside is if you have two or three really good teams, only one can play in Europe.\nThe Athletic: We’re glad you brought that up because we wanted to ask you about what we thought was admirable but slightly unusual honesty in this business, as you have made it clear Bournemouth is the flagship in your multi-club fleet…\nFoley: It is.\nThe Athletic: Most owners of several clubs don’t say that out loud because no European fan wants their team to be a farm team. Do you regret it?\nFoley: I’m just being honest. Many players in Ligue 1 want to move to the Premier League, and we want to give them that opportunity. We want Lorient to be very good and if they can play in Europe, we would want them to do that. We don’t want Loic to sell all of his best players. We want him to have the opportunity of reaching Europe. But if a player wants to move on, I don’t want him to move to Liverpool or Arsenal — I want him to move to us.\nThe Athletic: Quite right, too, but to return to the new stadium, you made it sound very straightforward. Unfortunately, building stadiums rarely goes smoothly in the UK. Are you completely confident you can do this on time and on budget?\nFoley: I am. We’ve established the budget, we have our plan. We’re going to three different firms to develop the design, based on our budget. We have to stick to it. I can’t afford to spend £120-150million on something that won’t return value. We’ll have a functional stadium, with the right hospitality assets. That’s where the ticket sales and food and beverage sales are — it’s the piece of the puzzle we need.\nAdvertisement\nWe’ve been in touch with the local authorities. The land is available. We’ve got to move a running track, which isn’t that big of a deal. The actual stadium will go where our training pitches are. The only thing that gives me pause is if we could somehow rehabilitate the current stadium by adding 8,500 seats and make it work; it would be easier because I could do it in stages and wouldn’t need to spend so much right away. I’d start with the South Stand next year. I’m just not sure how doable it is. There is a plan but I’m not sure if it will give us the extra suites we need.\nThe Athletic: Would the current landlords (London-based property group Structadene, who bought the stadium when the club was desperate for money in 2005) give you a reasonable price for it?\nFoley: We have an advantage because it can only be a stadium and we only have five years on our lease.\nThe Athletic: That’s because there is a sporting-use covenant on the land?\nFoley: Right. So, the clock is ticking. We know they’ll sell us the stadium at a reasonable price and that price gets more reasonable the longer we wait. If we move out, I guess they could go back to the council and say “We’ll tear it down and build affordable housing”, which is fine but that could take a while, so time is on our side.\nBut I wrestle with this with Jim and Neil (Blake, the club’s CEO): can we improve the stadium or do we have to build a new one, with all the procedural headaches that might come with that? We built the Dollar Loan Center (home of the Golden Knights’ farm team the Silver Knights and Foley’s Indoor Football League team the Knight Hawks) in Henderson with the cooperation of the city last year and that went smoothly, but it’s tougher everywhere now.\nThe Athletic: So why risk spoiling a good thing in Las Vegas with English football?\nAdvertisement\nFoley: Because it’s the greatest sport in the world and the Premier League is the best league. I’ve been fooling about with football for three years, looking at opportunities in other leagues. But it’s like when I decided to expand my wine business. I looked at South Africa, Argentina, Chile, France, Spain, Italy, and I settled on New Zealand because you have the rule of law, English speaking, varietals I like, and a stable currency. Football for me came down to the UK and the Premier League. I had opportunities to be a minority owner in a number of other teams but, as you can probably tell, I’m not a good minority owner.\nThe Athletic: Ha! Well, we are aware of some of those opportunities but, looking from the outside, it looks like you made a good call.\nFoley: I’m very happy. I know we can improve the team. We need to be embedded in the community and vice-versa. I know some of the guys on the team don’t like talking to the press but (I say), “The press will write what it’s going to write but, if you talk to them, they’re more likely to tell your story”. I’ve used the same philosophy at the Golden Knights. I’m going to be honest and transparent.\nThe Athletic: And long may it continue. But on your choice to invest here, English football appears to be very popular in the US. Should we worry that it’s just a flash in the pan and next year something else will be fashionable?\nFoley: No, it’s the real deal. Americans love it. We’re developing local fan clubs for Bournemouth. People are getting up early to watch games in bars at 7am on the West Coast. The Premier League is very understandable to Americans. There’s always been a close relationship between the US and the UK. MLS has started to get out of its own way a bit and has gained acceptability in the US. It’s still only the eighth or so best league in the world but the stadiums are filling up and people are more engaged with it. But Americans love the Premier League. It’s the best football in the world. I hope I’m not going to irritate my Italian and Spanish friends, but it just is.\nThe Athletic: That will certainly help to win us over, Bill. But, as a final thought, do you acknowledge that sometimes, some of your compatriots have come to the Premier League and perhaps behaved as though they know it all, and maybe not listened very much? We hasten to add that Brits have been doing the same for centuries.\nFoley: Ha! Well, that can be an American trait and I know quite a few of the other owners and some of them definitely do think they know it all. But there are exceptions.\nAdvertisement\nThe Athletic: But, clearly, we do have some things to learn from what you have created at the Golden Knights, right?\nFoley: Well, thank you. I’m going to do a little bit of it at Bournemouth but we don’t want to scrap established traditions. We want to make improvements and be a bit different, but I’m very cognisant of the history of Bournemouth and the Premier League. We’re not going to be ugly Americans that come in and change this and change that because we think we know it all. We know we don’t, and we can learn a lot from you."
    },
    {
      "url": "https://www.nytimes.com/athletic/6544679/2025/08/11/tyler-adams-usmnt-pulisic-pochettino-world-cup-bournemouth/",
      "text": "U.S. men’s national team midfielder Tyler Adams was back in Chicago for a second time this summer.\nHe had been in the Windy City with the U.S. team in the first days of June for its pre-Concacaf Gold Cup camp, where the United States’ 2022 World Cup captain was intent on making a statement to head coach Mauricio Pochettino ahead of the 2026 edition.\nAdvertisement\nNow, in the first days of August, he was back, with AFC Bournemouth this time, on tour in the United States and preparing for the new Premier League season — a campaign he believes can be an important chance to level up at a vital time. (And with his club facing reigning champion Liverpool at Anfield in Friday’s curtain-raiser, it won’t be long before he’s facing a first significant challenge.)\nThat he was not only in the same city but the very same hotel felt symbolic. It was a reminder of the 26-year-old’s approach to the year leading into that largely home World Cup next summer. Adams says he feels motivated and all-in.\nAdams’ presence with the U.S. this summer shouldn’t have been newsworthy. But for a Gold Cup that became as much about who wasn’t in camp as who was, it was notable that the defensive midfielder was there despite a foot injury that kept him from fully training or playing in the first weeks of camp.\nAdams had gotten just one camp with Pochettino to that point since the Argentine’s appointment in September last year, and he felt it was important to begin to prove himself and understand his new national-team manager better.\n“It was a great learning experience,” Adams tells The Athletic. “Just because I hadn’t been in his initial camps to begin with. So I think a lot of guys had a lot more time with him than I’ve had. Just ironing out that relationship, what he wants from the players, how the players can get the best out of the coaching staff, just balancing that relationship.\n“You hear about him in the way that he works, but until you spend a month with him, you don’t really know. I’ve had the opportunity to do that now, so I feel like that will be really helpful in the long run, for not just myself, but a lot of the young guys that had the first opportunity as well.”\nWhile the U.S. was missing several regulars due to injury and Club World Cup duties, the controversy of the summer revolved around Christian Pulisic’s decision to opt out of the Gold Cup. The Milan forward and sometimes USMNT captain felt he needed rest if he was going to be ready for the 2025-26 season — and, as an extension, primed for the World Cup.\nAdvertisement\nPochettino and his staff agreed to let him skip the tournament. But the coach, responding to Pulisic’s comments to CBS that he wanted to take part in the two warm-up friendlies in June before missing the Gold Cup itself, was clearly bothered by the idea that those types of decisions would be left to the players.\n“I am the head coach,” Pochettino said. “I am not a mannequin.”\nIt raised the question as to whether Pulisic will have to earn back the trust of the coaches — and maybe even his teammates, too. Adams pushes back hard on the idea that he had anything to prove.\n“It’s a topic that everyone wants to have an opinion on, of course, but what Christian did is what he had to do for himself,” Adams says. “He doesn’t have to earn the respect of anyone in the group. Everyone knows who Christian is as a person, and how good of a player he is as well. But everyone needs time in certain moments of their career or life to just say: ‘Let me take a step back, focus on myself for a second and then move forward’.\n“I speak to Christian all the time. We’re obviously super close. And I just know that this summer, while he took a step away, he didn’t anticipate that there was going to be that much noise and heat around it. But again, everyone wants to throw his name in the gutter because it creates a big story, or it creates noise around (the team). And that’s how big of a player he is and how important of a player he is. But everyone in the team knows how important he is, what an amazing person he is.\n“I can’t say enough good things about him. He’s one of the leaders of our team. The decision that he made was best for him, and it’s going to help him in the long run.”\nPulisic’s absence didn’t just spark criticism. It also turned a spotlight on what feels like a growing divide between the program’s current players and its alumni, many of whom have taken on roles in the media.\nAdvertisement\nSeveral former USMNT players harshly criticized the team for its disappointing performances in the Concacaf Nations League finals in March, pointing to a perceived lack of heart or passion in losses to Panama and Canada. Multiple high-profile predecessors then offered thoughts on Pulisic’s Gold Cup absence, including Clint Dempsey, Landon Donovan and Tim Howard.\nThe comments from Donovan and Howard eventually led to Pulisic’s CBS interview.\n“You can talk about my performances, whatever you want, but to question my commitment, especially towards the national team, in my opinion, that’s way out of line, but that’s how it is,” Pulisic told the Call It What You Want podcast.\nAsked about what feels like a disconnect between players past and present in the program, Adams calls it “the strangest thing.”\n“I can’t even explain it,” he says. “I’m not a social-media guy, so I don’t follow anything, but when people bring up some of the things that are being said and some of the stories that are being created, it feels weird, because it feels like not long ago that every single one of those people were on board with, like, the direction that the federation was going and how well the players were doing. And it feels like any setback, is (treated) like a disaster is happening. Do you know what I mean?\n“And that happens in football. I get it. Some people have jobs where their job is to speak about the sport, and if that’s their opinion, that’s their opinion. My goal is to try to create an environment, especially within our team, where guys feel like they can go out, be themselves, be comfortable. We’re all on the same page and want to grow the sport in America. People’s opinions are people’s opinions at the end of the day.”\nAdams says he’s “always a truthful guy” and that “the truth can hurt sometimes,” so he doesn’t shy away from tougher conversations. That would include talks with former players who have criticisms, or with coaches who might want more from him, or initiating difficult conversations with teammates when the time calls for it.\nAdvertisement\nIt’s part of what has made Adams one of the leaders of this team. He called being the U.S. captain in the 2022 World Cup “one of the most special moments of my career,” and though center-back Tim Ream has been wearing the armband most regularly under Pochettino – no official captain has been designated yet by the new manager – Adams says he will continue to be himself and help to the lead the group.\nHis goal for now, though, is to progress at the club level this season. He noted that this is his first chance to go through a full preseason in three years, and after having a full campaign last year without an injury, 2025-26 with Bournemouth is about reaching his peak form going into next summer.\n“This past season gave me the confidence that I needed to now say: ‘You could take the next step. Let’s take another step in development. Take a step in pushing yourself’,” Adams says.\nThere is no doubt that as the USMNT continues to push through what has been a tumultuous two years, it would benefit significantly from having Adams consistently available and in the lineup, much as he was throughout the previous World Cup cycle ending wth the tournament itself in Qatar. The Gold Cup was a huge step forward in that regard. Adams feels confident he’s rounding into form at just the right moment.\n“Now it’s like: ‘OK, I’m back to myself, I feel like myself’,” he says. “I’ve had a nice break. I’m going to be able to get a nice preseason. And (then) it’s go time.”\n(Top photo: Mark J. Rebilas/Imagn Images)"
    },
    {
      "url": "https://www.nytimes.com/athletic/6429641/2025/06/26/milos-kerkez-liverpool-robertson-tsimikas/",
      "text": "For a young man who likes to stay out of the spotlight each summer, Milos Kerkez could be forgiven for changing tack this year.\nUsually, he will pitch up in a remote location and switch off his phone during the off-season. He likes to be out in the wild, fishing, as it helps him unwind — yet this summer, a £40million ($54m) move to Liverpool has taken centre stage.\nAdvertisement\nLast week, before his move from Bournemouth was confirmed, Kerkez appeared on the Super Indirektno YouTube show alongside his father and agent, Sebastijan, to discuss his burgeoning career, with some of those memories leading back to Liverpool. Speaking in Serbian, the 21-year-old discussed the excitement of visiting Anfield as an opponent and how Mohamed Salah is the toughest player he has faced.\nSebastijan then explained how Liverpool sporting director Richard Hughes, who signed Kerkez from Dutch side AZ when he worked at Bournemouth, was the leading force in securing another move for his son. “He brought us to Bournemouth, so if he said we go to India, then we go to India,” he said on the Serbian show.\nMerseyside was always the likely destination once Liverpool registered their strong interest and began piecing together the deal. It was months in the making and was held up slightly until all parties were satisfied with the terms. The final agreement came on Friday and after passing a medical, Kerkez has signed a five-year contract. There is still a little time for a vacation but hiding away will become much harder as a Liverpool player.\nHughes and head coach Arne Slot believe Kerkez, who was born in Serbia but represents Hungary internationally, can significantly improve the team for years to come. He is seen as the long-term replacement for Andy Robertson, who has dominated the left side of Liverpool’s team for six seasons.\nYet for Bournemouth, who knew they could not hold onto their star performer when Liverpool came calling, it marks another day of mixed emotions. Dean Huijsen has joined Real Madrid and Paris Saint-Germain are negotiating for Illia Zabarnyi, with Europe’s biggest clubs picking off Bournemouth’s best players.\nOwner Bill Foley knows the huge sum of transfer money received will help the club rebuild for the future, but there are bigger plans for the years ahead. “For us, it’s a big deal because it tells young players: if you go to Bournemouth, look where you might end up — Liverpool, PSG, Arsenal, Real Madrid,” he told The Athletic. “Our job now is to make them so happy that they never want to leave. We’re partway there but not all the way yet.\nAdvertisement\n“We’re in a position of bringing in younger players and if they’re successful, within two or three years, they’re coming to us saying they want to go and play in the Champions League. So our next step is we need to be in Europe consistently and have that to offer our players.”\nHow will Kerkez fit in at Liverpool?\nFlexibility is a key attribute Slot wants in a full-back. He often deploys them in narrow positions so they can influence build-up play in more central attacking areas and underlap their wingers. He also expects them to take up more traditional wide positions.\nOne of Kerkez’s standout attributes is his aggression in off-ball movement, as shown by the graphic below.\nAccording to SkillCorner, Kerkez made more underlapping runs than any Premier League player during the 2024-25 season (131, nearly double Robertson’s 68 in third). Broaden that out across Europe’s top seven leagues (as shown below), and you will struggle to find a player more active in making such underlapping runs.\nKerkez is keen to exploit the space behind the opposition defence, also ranking fourth for overlaps, which highlights how he frequently wants to make positive runs forward and support his winger — often Antoine Semenyo on Bournemouth’s left flank.\nTheoretically, that would dovetail well with Cody Gakpo and Luis Diaz, who benefit from overlapping full-backs. That was particularly true of Gakpo last season: those types of runs have opened space for the Dutchman’s signature goal — cutting inside into space and striking a shot with his right foot.\nAs The Athletic has previously analysed, underlapping runs from team-mates were vital for Liverpool’s forwards, either by dragging an opponent out of shape or offering a passing option to cross from the byline.\nKerkez’s desire to break forward has translated to a strong attacking return from the full-back. No player created more chances from crosses than the 21-year-old last season (22).\nOnly four defenders (Rayan Ait-Nouri, Trent Alexander-Arnold, Pedro Porro and Antonee Robinson) produced more than Kerkez’s five Premier League assists last season.\nTwo of Kerkez’s assists came against Manchester City and demonstrated his different attributes. In the first assist, he powered past Phil Foden to the byline before cutting the ball back to Semenyo.\nIn the second, an aggressive overlap allowed him to cross to Evanilson.\nAnother overlap beyond Semenyo allowed him to set up David Brooks for the winner in a 1-0 victory over Everton.\nHe has also taken 19 shots. Few have been high-quality opportunities, but his goal against Newcastle United demonstrated his impressive engine…\n… while he also showcased his overlapping threat to score against Wolverhampton Wanderers.\nKerkez has the energy and intensity to play in Slot’s side but there would be adaptation required as he would likely be asked to tuck in and form part of a back three during build-up.\nThis is particularly pertinent when looking at his touch map for Bournemouth last season, highlighting that the majority of his touches (73 per cent) have come in the far-left channel of the pitch.\nCompared to Robertson, Kerkez is more of a dribbler and more inclined to get into the box, while the Scot is more creative and secure on the ball, relying on passes to move play forward.\nDefensively, Kerkez has been a much more passive full-back than Robertson, making relatively few tackle attempts and interceptions and preferring to force his opponent down the line. He struggles in the air — winning just 36 per cent of his aerial duels — but he is a solid tackler, with a 61.5 per cent true-tackle win rate.\nRepeating the form he showed for Bournemouth will now be key as he has been signed as Liverpool’s primary left-back during a summer of change.\nHow will others be affected?\nInevitably, this will have an impact on Robertson and Kostas Tsimikas and may force one of them to leave.\nSlot does not need three senior left-backs, especially when Liverpool can only name 17 non-homegrown players in the Premier League squad, and already the numbers are looking tight.\nTsimikas started only nine Premier League games last season and would like the opportunity to play more regularly, but he is not in a rush to leave.\nAdvertisement\nWith strong interest in Robertson, Tsimikas, 29, who still has two years left on his contract, may be the player to stick around in support. Clubs have shown an interest in the Greece international this summer and all options will be considered to decide on the best way forward.\nMuch of that, no doubt, will depend on what Robertson decides in the weeks ahead. Atletico Madrid had made the 31-year-old a priority, but they still have other options to consider.\nRobertson excelled in the second half of the season and started 27 of the 34 games before the title was wrapped up, but he has just one year left on his contract and knows his place is under threat.\n“When you play for a big club like Liverpool, you expect challenges, you expect to have competition. I’ve always faced that and so has everyone in their own positions,” he said recently while on international duty with Scotland.\n“We want the club to be ambitious. Wherever we fit into that, if you’re happy with the role, you stay and do it. If you’re not, I’m sure there will be some people out the door as well.”\nWith Atletico keen, it is now down to Robertson to decide whether he is interested in the move or would prefer to stay around at Anfield until the end of his deal. Owen Beck, the 22-year-old left-back who spent last season on loan at Championship side Blackburn Rovers, may be called upon as backup if needed.\n(Top photo: Paul Ellis/AFP via Getty Images)"
    },
    {
      "url": "https://www.nytimes.com/athletic/6435068/2025/06/26/huijsen-real-madrid-malaga-spain-juventus/",
      "text": "Dean Huijsen was 14 years old when he and his family were involved in a serious car crash.\nOn their way to one of his training sessions in Malaga, the southern Spanish city where he grew up, they collided with another vehicle. Their car turned over three times but somehow, nobody was hurt.\nAs onlookers approached the youngster to ask how they could help, there was only one thing on his mind.\nAdvertisement\n“Dean was going crazy looking for people who would take him to training instead of the hospital,” says his close friend and then team-mate, Fernando Padilla. “Whatever happened he wanted to train, he wanted to play.” Police at the scene had to intervene to ensure Huijsen did not leave.\nThose who have coached, played with or know Huijsen well describe him as being supremely calm on and off the pitch. But that story also demonstrates the laser focus that led to Huijsen becoming Real Madrid’s £50million ($67m) centre-back this summer.\nThis is the story of the Dutch-born Spain international’s beginnings.\nSome 258 miles to the south of Madrid, Malaga is the Andalusian city where Pablo Picasso was born. The wider region is known as the Costa del Sol — the sunshine coast — and it is not hard to see why so many foreigners visit or choose to make it their home.\nHuijsen (it is pronounced How-sen) was born in Amsterdam in 2005 and his family did exactly that when he was four. They settled 30 miles along the coast near the town of Marbella, where Dean took his first steps in football at amateur team Costa Unida C.F..\nIt is 25C (77F) with spotless skies when The Athletic visits the club’s installations one morning in May. The worn seven-a-side pitch Huijsen played on 10 years ago is flanked by sweeping views of the nearby mountains, with rows of white houses in the distance.\nHuijsen and his father Donny — a former professional himself who spent time at Dutch clubs Ajax and AZ and played a key role in his son’s development — used to practise passing from one goal to the other after games here. Donny still owns a trampoline park a five-minute drive from the club and the company sponsors Costa Unida’s shirts. Back then, he used to talk Dean through his performances using a tactical whiteboard in the family kitchen.\nAdvertisement\nSet up in 2005 by the former Premier League midfielder Jamie Fullarton, who lived in the area, Costa Unida was aimed at kids of all nationalities along the coast. Huijsen arrived when he was six but could not appear in official competition until his licence had been approved under FIFA regulations a few months later. Not that it stalled his progress.\n“There’s a lot of times the team looks like the United Nations — we have 20 countries represented at the club,” says Salvador Moreno, Huijsen’s first coach at Costa Unida. “There are kids who adapt very quickly and others who need more time. You could see he was happy in these surroundings.”\nHuijsen started out wearing the No 9 shirt and playing as a striker. From the start, he stood out for his height — Moreno estimates he was already close to 4ft 3in or 130cm when he joined Costa Unida. These days, he stands at 6ft 5in (196cm).\n“When you play in those categories, a boy who’s 10 centimetres taller than the other kids is very important, because one of Dean’s strides almost counted for three by his opposite number,” says Moreno. “Sometimes it looked like he was playing against training cones.\n“He had the soul of a striker. But because of his stature and physique in these age levels, his coaches at the time decided that he helped the team more playing as a centre-back.”\nHuijsen’s ambition was clear even then.\nMoreno remembers a top-of-the-table match against Malaga when one of Huijsen’s team-mates committed an error leading to a goal. When the player started to cry, Huijsen immediately called for his coach to replace him as he was not helping the team. “To do that at nine years old isn’t very common,” says Moreno.\nHe was Costa Unida’s top scorer in his final season at the club in 2014-15, with 16 goals in 30 games for the under-nines. A 3-1 win against a Malaga team who had previously gone three years unbeaten put the region’s biggest club on high alert. Malaga — Champions League quarter-finalists in 2013 — started calling up Huijsen for youth tournaments after that game, before he officially joined in the summer of 2015.\nAdvertisement\nOff the pitch, Huijsen’s adaptation to a new culture was equally seamless. He attended Aloha College, an English-language school in Marbella which counts Stranger Things actor Millie Bobby Brown as another of its famous alumni. Curiously, she too went on to live in Bournemouth for part of her childhood.\nHuijsen learnt Spanish there and excelled at sports, including cross country and beach football. His former PE and Spanish teacher in fourth grade, Sebastian Perea, says his language skills improved significantly once he joined Malaga and had to use Spanish more regularly. The school’s headteacher Francisco Escobar says he was just a sociable kid and a “natural linguist” who wanted to speak with his friends. When Huijsen completed his international GCSEs (the equivalent to a U.S. high school diploma) at 16, he achieved an A in French and Bs in business, English language and literature and sport science.\nHe still drops consonants in the typical Andalusian way when speaking Spanish, while his friends describe him as a Malaga fanatic who took every opportunity to wear the club’s kit and attend games at their Rosaleda home ground. He swapped Spain shirts with the club’s iconic former midfielder Isco during the most recent international break, sharing the photo alongside his previous interaction with the 33-year-old — an unanswered Instagram message in 2017 wishing him a happy birthday.\n“He’s more malagueno (from Malaga) than us,” says another of his former academy team-mates and friends, Oscar Puentes.\nThat is why Huijsen’s international switch to represent Spain last year did not raise eyebrows among those who know him best. He was first called up for trials with the Dutch under-14 side — a level that did not exist for Spain until last year — and played for their youth teams until under-19 level, when the Spanish football federation (RFEF) came calling. He gained Spanish citizenship last year, played for the under-21s and made his senior debut in March against the Netherlands in Rotterdam — where every one of his touches was whistled by the home crowd.\nHuijsen himself told The Athletic before that game that he would “continue to be Spanish” even if Spain did not call him up for the next 20 years. The former RFEF youth coordinator who pushed for his switch, Francis Hernandez, says: “We are from where we make ourselves, not where we’re born.”\nHe adds: “Today it’s easy for all the world to see he’s a high-level player. The difficult thing is to think that at the time, to make decisions and make such an important bid, because it’s not common for us to take a plane and go to Italy (when Huijsen was on loan at Roma from Juventus) to see the family, the player and his agent.\nAdvertisement\n“We base ourselves on two aspects. Firstly, the potential we understood he had to be a senior Spain player. Secondly, his characteristics fitted perfectly into the style of play we had in the youth categories and, of course, for (senior coach) Luis de la Fuente.”\nThat style of play had to be honed at Malaga. Puentes describes the Huijsen he first met as a “beast” while one of his former youth coaches, Ruben Castillo, says he looked more like a basketball player than a footballer.\n“When he developed more at under-15 level and he started to grow muscles, he experienced his biggest growth in football terms,” says his first Malaga coach Isaac ‘Gordillo’ Jimenez Lozano. “He improved a lot on a tactical level, in terms of the understanding of the game and above all in playing out from the back. It was an amazing evolution.”\nMadrid played on Huijsen’s status as a “chill guy” in one of their videos on social media welcoming the defender — something his friends say is an accurate reflection of his personality. He valued rest and nutrition highly as a youngster, always taking a special pillow with him for youth tournaments around the world.\n🫵😎🥶 pic.twitter.com/roGS11ZUd7\n— Real Madrid C.F. (@realmadrid) June 10, 2025\nSometimes he could be too chill, as his former youth coach Castillo discovered on one trip to Portugal when he was 10 years old.\n“When we arrived, we left the main coach and had to take a regular bus to the town of Vila Real de Santo Antonio, in the south of Portugal,” he says. “In that short bus journey, we all got off at the stop for the hotel, but he didn’t. Nobody paid attention and the bus continued with Dean in there because he was asleep. He had to go to the final stop and then the conductor returned with him.”\nHuijsen spent six years in the Malaga youth ranks, one of which was with their then-affiliate club San Felix, coached by Castillo. He was his side’s main threat from set pieces — according to Castillo, the header he scored against Arsenal in May was identical to a move they regularly employed with the towering centre-back.\nMeanwhile, Gordillo helped Huijsen understand how to choose the right moment to be strong in a challenge and avoid making unnecessary fouls. Dean and his father Donny were also determined to improve his left foot.\nThere were plenty of highlights. Huijsen won player of the tournament at a 2017-18 tournament in Valencia, scoring two headers in the semi-finals and another in the final against Sevilla. A year later, the Malaga cohort including him, Puentes and goalkeeper Padilla won their under-14 league.\nAdvertisement\nMalaga — whose senior team had been relegated to Spain’s third tier — were unable to compete with the financial might of Juventus when they signed Huijsen in 2023. It proved to be just the first in a series of bold moves from the youngster. From Spain to Italy, from Italy to England, from England back to Spain.\nAs his former teacher Perea says, “If you told any 16-year-old they need to go to another country, they’d say, ‘I’m staying here, I’m comfortable in Malaga, I have my friends, I have my home, why would I go elsewhere to an unfamiliar environment?’ He had the determination to say, ‘I’m going, I’m fighting for that and I don’t care’.”\nHuijsen’s team-mates in Malaga’s academy have yet to make it to the elite. Huijsen, meanwhile, has already impressed for Madrid in his first two appearances at the Club World Cup.\nSo, what does that say about his rise to the top?\n“It shows that he’s chosen his steps correctly and he’s also had that pinch of luck that you need to arrive (among the elite) so early,” says Gordillo. “Because a centre-back arriving there at 20 years old isn’t normal. Dean has broken down all barriers.”\nAdditional reporting: Mario Cortegana and Guillermo Rai\n(Top photo: Salvador Moreno/Antonio Villalba/Getty Images. Visual design by Kelsea Petersen)"
    }
  ],
  "argos_summary": "Bournemouth head coach Andoni Iraola discusses the challenges of rebuilding his squad after losing key players like Dean Huijsen and Milos Kerkez to top clubs. Despite the departures, Iraola remains optimistic, emphasizing his role in player recruitment and the importance of maintaining a strong team culture. The club has already secured replacements, including goalkeeper Djordje Petrovic and left-back Adrien Truffert, while also preparing for the upcoming season with a focus on improving performance against top teams.",
  "argos_id": "TXGDRJ8LM"
}