{
  "url": "https://nypost.com/2025/08/12/sports/sebastian-telfair-pleads-for-donald-trump-pardon-before-prison-stint/",
  "authorsByline": "Christian Arnold",
  "articleId": "39e2fd452f6c4dbe9fcd51388fcc1297",
  "source": {
    "domain": "nypost.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://nypost.com/wp-content/uploads/sites/2/2025/08/newspress-collage-t93o4dics-1754974099973.jpg?quality=75&strip=all&1754959780&w=1024",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T05:07:11+00:00",
  "addDate": "2025-08-12T05:10:34.602594+00:00",
  "refreshDate": "2025-08-12T05:10:34.602597+00:00",
  "score": 1.0,
  "title": "NYC hoops legend Sebastian Telfair pleads for last-ditch Donald Trump pardon before prison stint",
  "description": "Former Brooklyn hoops star Sebastian Telfair is calling on President Donald Trump to give him a last-second pardon before he has to report to prison on Tuesday to serve out a six-month sentence.",
  "content": "Former Brooklyn hoops star Sebastian Telfair is calling on President Donald Trump to give him a last-second pardon before he has to report to prison on Tuesday to serve out a six-month sentence.\n\nTelfair, who starred for Abraham Lincoln High School in Coney Island and bounced around the NBA, allegedly failed to satisfy the terms of a plea bargain related to a healthcare fraud case he was wrapped up in, and decided to make a last-ditch plea to Trump during an interview with TMZ.\n\n“Trump, go check in on my story and you’re definitely going to want to pardon me,” he said during the interview on the streets of New York. “You’ll hold me accountable and want me to continue to go do good. But I did too good to being sending anybody to jail.”\n\nTelfair called the situation “super unfair” and told the outlet that he was “mad” he had to spend time in federal jail.\n\nThe former high school basketball star said that it had been an issue with paperwork that led to the current situation he finds himself in.\n\n“I know Donald Trump’s got some big things going on, but Donald Trump, I need you to come holla’ … give your boy a pardon so I could stay home with my baby,” Telfair said while talking to TMZ.\n\nTelfair had been among a number of ex-NBA players who were alleged to have run a scheme to try and cheat the league’s health care plan out of nearly $4 million back in 2021.\n\nHe was first sentenced to time served plus supervised release for three years, but this summer he was re-sentenced to six months in jail for failing to abide by the terms of his release.\n\nTelfair did try to put a positive spin on the situation, saying that he has plans to write a book and he was documenting his story.\n\nHe played 10 seasons in the NBA, with stops in Minnesota, Portland, Phoenix, Boston, Los Angeles, Oklahoma City, Toronto and Cleveland after becoming a rare guard to make the jump straight from high school. He was drafted No.13 overall by the Timberwolves in 2004.",
  "medium": "Article",
  "links": [
    "https://nypost.com/2025/08/10/sports/michael-jordans-boat-wins-400k-prize-for-71-pound-fish-in-white-marlin-open/",
    "https://nypost.com/2025/08/11/sports/cristiano-ronaldo-engaged-to-georgina-rodriguez-after-8-years-of-dating/",
    "https://nypost.com/2025/08/11/sports/taylor-swift-unveiled-as-travis-kelces-new-heights-podcast-special-guest/",
    "https://www.tmz.com/2025/08/11/sebastian-telfair-pleads-for-donald-trump-pardon/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Donald Trump",
      "weight": 0.09296551
    },
    {
      "name": "President Donald Trump",
      "weight": 0.09096248
    },
    {
      "name": "Sebastian Telfair",
      "weight": 0.08888934
    },
    {
      "name": "Former Brooklyn hoops star Sebastian Telfair",
      "weight": 0.08887901
    },
    {
      "name": "NYC hoops legend Sebastian Telfair",
      "weight": 0.08522425
    },
    {
      "name": "Telfair",
      "weight": 0.079262294
    },
    {
      "name": "Trump",
      "weight": 0.07500356
    },
    {
      "name": "ex-NBA players",
      "weight": 0.064026035
    },
    {
      "name": "Abraham Lincoln High School",
      "weight": 0.06341685
    },
    {
      "name": "ex-NBA",
      "weight": 0.059535757
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    },
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/Sports/Team Sports/Basketball",
      "score": 0.90283203125
    },
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.89990234375
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.845703125
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.6845703125
    },
    {
      "name": "/News/Sports News",
      "score": 0.6689453125
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.658203125
    },
    {
      "name": "/News/Gossip & Tabloid News/Other",
      "score": 0.544921875
    },
    {
      "name": "/News/Gossip & Tabloid News/Scandals & Investigations",
      "score": 0.51220703125
    }
  ],
  "sentiment": {
    "positive": 0.058707878,
    "negative": 0.7546733,
    "neutral": 0.18661882
  },
  "summary": "Former Brooklyn basketball player Sebastian Telfair is seeking a last-minute pardon from President Donald Trump before he must report to prison for a six-month sentence related to a healthcare fraud case. The former high school star, who starred for Abraham Lincoln High School and played in the NBA, allegedly failed to meet the terms of a plea bargain related to the case and called the situation \"super unfair\". He also mentioned plans to write a book about his experiences and is documenting his experiences.",
  "shortSummary": "Former Brooklyn hoops star Sebastian Telfair pleaded for a last-minute pardon from President Donald Trump after serving a six-month sentence for healthcare fraud.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "4ae80f4475a04bf7a752abaf0a6227b4",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://nypost.com/2025/08/11/sports/taylor-swift-unveiled-as-travis-kelces-new-heights-podcast-special-guest/",
      "text": "In the wee hours of Tuesday morning, the “New Heights” podcast social media account revealed another clip, which was timed along with a countdown clock on Taylor Swift’s website, to reveal that the pop star announced her new album on her soon-to-be-released appearance on the show.\nSwift revealed that her 12th studio produced album will be titled “The Life of a Showgirl” intentionally on Aug. 12 at 12:12 a.m.\n“So I wanted to show you something,” Swift said in the clip before breaking out a mint green briefcase with the letters ‘T.S.'”\nTravis’ brother Jason is seen excitedly narrating before the girlfriend of the Chiefs star revealed the album cover– which was blurred out – and the name.\nJason screamed with excitement and Travis jumped in by shouting, “TS 12!”\nSwifties have speculated that the singer could announce a new album after her in-house marketing team seemed to be dropping hints on social media earlier on Monday.\n“Thinking about when she said ‘See you next era…” they posted on Instagram along with a carousel of 12 photos of Swift wearing orange outfits.\nMonday was a busy day for Swift and the Kelce brothers on social media.\nAfter teasing a “VERY special guest” on the new episode of the “New Heights”, the show confirmed that the Swift will appear on the program Wednesday in a clip released late Monday night.\nThe teaser clip features Swift complementing the hoodie that co-host and Chiefs star Travis Kelce is wearing.\n“Such a nice color on you,” Swift said in the 13-second clip that whipped the internet into a frenzy.\n“Yes, I know. It’s the color of your eyes, sweetie,” Kelce responded. “It’s why we match so well.”\nAfter a brief pause, Swift exclaims: “We’re about to do a f–king podcast.”\nSpeculation had already started to run rampant about who Jason and Travis Kelce would have as their guest on the show, especially with the number of easter eggs that seemed to be in the first post on Monday morning.\nTravis and Jason have mentioned Swift on the podcast several times since the pair went public with their relationship back in 2023 after she appeared at one of the Chiefs tight end’s games in September of that year, kicking off a whirlwind around the couple."
    },
    {
      "url": "https://nypost.com/2025/08/10/sports/michael-jordans-boat-wins-400k-prize-for-71-pound-fish-in-white-marlin-open/",
      "text": "A boat, whose crew included one of the greatest basketball players of all time, finished in second place in the prestigious White Marlin Open held in Ocean City, Maryland.\nMichael Jordan was aboard the “Catch 23” when angler Trey “Cricket” McMillan reeled in a 71-pound white Marlin on the sixth day of the 52-year-old deep-sea fishing tournament that is dubbed as one of the world’s largest and richest of its kind.\nThe boat pulled back into the harbor in Ocean City with the song “Sirus” – synonymous with Jordan as the team’s entrance music when he played for the Bulls – playing over the event sound system as the six-time NBA champion could be seen standing alongside other crew members.\nThe boat erupted in celebration when the weigh-in revealed they had moved into second place in the tournament.\nSecond place takes home a prize of $400,000. Angler Dan Gough of the Billfisher won the estimated $4.27 million first prize with a 72-pound Marlin.\nSocial media showed other images of Jordan from the tournament.\nOne image shared showed him posing alongside the rest of the crew with the fish after they returned to shore.\nAnother showed him sitting on the boat and the reflection in the window behind Jordan showed the large group of people who gathered to try and get a glimpse of the NBA legend.\nThe weather had forced tournament organizers to open up Saturday and Sunday to fishing and 211 of the 282 boats entered took advantage of the chance on Sunday, according to COAST TV.\nCompetitor Jimmy David equated the tournament to the likes of the Super Bowl, for fishing, especially with a star like Jordan there.\n“The biggest tournament, people come from all over,” David said to COAST TV. “Michael Jordan, all kinds of people. I heard they have the Secretary of the Navy over there and all kinds of celebrities. And the best of the best fishing. That’s for sure — the Super Bowl.”"
    },
    {
      "url": "https://www.tmz.com/2025/08/11/sebastian-telfair-pleads-for-donald-trump-pardon/",
      "text": "Sebastian Telfair Pleads For Donald Trump Pardon Hours Before Reporting To Prison\nSebastian Telfair Pleads For Donald Trump Pardon ... My Prison Sentence Is B.S.!!!\nSebastian Telfair tells TMZ Sports he wants Donald Trump to help him avoid a lengthy stay behind bars this year.\nThe former NBA star is scheduled to report to prison on Tuesday ... after he violated the conditions of his supervised release in his healthcare fraud case -- but he's hoping No. 45/47 can get him out of it.\nTelfair said he believes the whole situation is \"definitely some bulls***\" ... and he's confident if POTUS hears his story, he can avoid the six-month prison sentence he's about to begin serving in a matter of hours.\n\"Trump,\" he told us out in New York City on Monday, \"go check in on my story and you're definitely going to want to pardon me. You'll hold me accountable and want me to continue to go do good. But I did too good to being sending anybody to jail.\"\nTelfair was one of several former NBA players -- including Glen \"Big Baby\" Davis -- who were accused of running a scheme that swindled loads of cash out of the Association's healthcare plan.\nHe was at first sentenced to time served plus three years of supervised release -- but he was re-sentenced this summer to six months in prison after he allegedly failed to satisfy the terms of his release.\nTelfair told us the whole matter surrounded an issue with \"paperwork,\" and he's clearly upset over it.\n\"It's super unfair,\" he said.\nBut if Trump is unable to come through with the pardon, Telfair insisted to his family, friends and fans he's going to spend the time behind bars improving himself ... and working on his book.\n\"I'm definitely mad I put myself in this situation,\" he said. \"But we definitely have got some wins coming.\"\n\"So, my fans, just hold tight.\""
    },
    {
      "url": "https://nypost.com/2025/08/11/sports/cristiano-ronaldo-engaged-to-georgina-rodriguez-after-8-years-of-dating/",
      "text": "Cristiano Ronaldo put a ring on it.\nThe Portuguese soccer star, 40, and his girlfriend, Georgina Rodriguez, are engaged after eight years of together, the model shared on Instagram Monday.\n“Yes I do. In this and in all my lives,” Rodriguez, 31, wrote in Spanish, including a snapshot of her oval-shaped diamond engagement ring.\nThe couple first stepped out together at Best FIFA Football Awards in Zurich in January 2017, and later made things Instagram official in May of that year.\nRonaldo and Rodriguez share five children: 8-year-old twins Eva Maria and Mateo, daughters Alana, 7, and Bella, 3, and his 15-year-old son Cristiano Jr., from a previous relationship.\nThey announced the death of Bella’s newborn twin brother, Ángel, in April 2022.\nAlthough Rodriguez has been spotted with a ring on her ring finger, this is the first time she shared engagement news.\nThe couple discussed taking the next step in their relationship in the Netflix docuseries, “I Am Georgina” — an emotional in-depth portrait of the influencer’s daily life.\n“They’re always joking about the wedding, ‘When is the wedding?'” Rodriguez said of her friends in the March 2025 episode. “Since Jennifer Lopez’s song “The Ring Or When” came out, they started singing it to me. And well, this is not up to me.'”\n“I always tell her, when we get that click,” Ronaldo said, snapping his fingers. “Like everything with our life, and I know she knows what I’m talking about. It could be in a year, or it could be in six months or it could be in a month. I’m 1,000 percent sure that it’ll happen.”\nThe couple’s engagement comes more than three years after a federal civil case accusing Ronaldo of raping a 25-year-old woman in a Las Vegas hotel in 2009 was dismissed.\nKathryn Mayorga, a former school teacher, claimed Ronaldo, who was 24 at the time, raped her at the Palms Place in 2009. The allegations were first reported in 2017 by German magazine Der Spiegel.\nUS District Judge Jennifer Dorsey dismissed the case with prejudice, due to misconduct by Mayorga’s attorney, Leslie Mark Stovall, who used “purloined” confidential documents.\nStovall was ordered to pay a proportion of Ronaldo’s legal costs."
    }
  ],
  "argos_summary": "Former NBA player Sebastian Telfair is seeking a last-minute pardon from President Trump before reporting to prison for a six-month sentence related to a healthcare fraud case. Telfair claims he was unfairly re-sentenced due to paperwork issues and expressed his desire to stay home with his family. Meanwhile, Cristiano Ronaldo and his girlfriend Georgina Rodriguez have announced their engagement after eight years together, sharing the news on social media.",
  "argos_id": "TXOKU52RC"
}