{
  "url": "https://www.ajc.com/news/2025/08/china-and-the-us-clash-at-the-un-over-the-panama-canal-a-focus-of-trumps-attention/",
  "authorsByline": "EDITH M. LEDERER",
  "articleId": "a9d97101ca2d441dbccc1a6370615d64",
  "source": {
    "domain": "ajc.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "GA",
      "county": "Fulton County",
      "city": "Atlanta",
      "coordinates": {
        "lat": 33.7489924,
        "lon": -84.3902644
      }
    }
  },
  "imageUrl": "https://www.ajc.com/resizer/v2/7UFMOW5UGZCO7FRNTWBH6F4FT4.jpg?auth=4c0923452acb376ec713f4c7a418e9171c883d51da2f21c1deebb4c2d6e610fd&width=1200&height=630&smart=true",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T22:13:14.627000+00:00",
  "addDate": "2025-08-11T22:57:23.186568+00:00",
  "refreshDate": "2025-08-11T22:57:23.186570+00:00",
  "score": 1.0,
  "title": "China and the US clash at the UN over the Panama Canal, a focus of Trump's attention",
  "description": "The United States and China have clashed at the United Nations over the Panama Canal",
  "content": "U.S. President Donald Trump thrust Panama into the spotlight even before winning election last November by suggesting that his country should consider retaking control of the Panama Canal and accusing Panama of ceding influence to China.\n\nThe U.S. built the canal in the early 1900s as it looked for ways to facilitate the transit of commercial and military vessels between its coasts. Control of the waterway transferred to Panama in 1999 under a treaty signed in 1977 by President Jimmy Carter.\n\nChina’s U.N. Ambassador Fu Cong emphasized to the council that “Panama has consistently and effectively managed the canal, making significant contributions to global shipping and trade.”\n\n“China has always respected the permanent neutrality of the canal and firmly supports Panama in safeguarding its sovereignty over the canal to ensure its openness and smooth operation,” he said.\n\nActing U.S. Ambassador Dorothy Shea, who spoke afterward, went after China, expressing concern about its “outsized influence over the Panama Canal area, especially over critical infrastructure and port operations.”\n\nAlluding to its claims in the South China Sea, she said, “China’s expansive and unlawful maritime claims and aggressive actions demonstrate its threat to maritime security and commerce.” She said the U.S. rejects these claims and supports countries opposing them.\n\n“China’s influence in the canal area is not just a risk to Panama and the United States, but rather a potential threat to global trade and security,” Shea said.\n\nThe Trump administration has pressured China to have the Hong Kong-based operator of ports at either end of the canal sell those interests to a U.S. consortium that includes BlackRock Inc.\n\nPanama has vehemently rejected a takeover of the canal, but in April, U.S. Defense Secretary Pete Hegseth visited Panama and agreed with Mulino to step up security coordination. The agreement also gives U.S. troops access to strategic air and naval facilities in the Central American nation, which sparked large protests in Panama’s capital.\n\nChina’s Fu asked for the floor to respond to Shea’s accusations after all council members spoke, this time lashing out at the Trump administration.\n\n“The United States’ fabrication of lies and groundless attacks against China are nothing but a pretext for seeking control of the canal,” he said.\n\nThe Chinese envoy called the U.S. and its deployment of offensive weapons in the South China Sea area “the biggest disrupter of peace and stability” in the region, and he accused the administration of exacerbating risks to global maritime security.\n\n“China firmly opposes economic coercion and bullying practices and urges the United States to stop fabricating rumors, lies and creating trouble,” Fu said.\n\nMurillo then responded, saying he wanted to stress Panama’s sovereignty “in terms of the ownership of the canal” and the multilateral treaty governing its administration. He called the canal’s neutrality “the only and the best defense” to any specific or global threats.",
  "medium": "Article",
  "links": [
    "https://apnews.com/article/panama-us-mulino-hegseth-canal-33b7e18a1e879706712309118c3ad8c0",
    "https://apnews.com/article/panama-canal-trump-china-a56f0bcec1952417f1c8c47fa34ec20e",
    "https://apnews.com/article/panama-canal-us-trump-protest-f98997ef4da1f944948357ccd884fa36",
    "https://apnews.com/article/hong-kong-panama-canal-beijing-hutchison-blackrock-rubio-d02a8439cc63d9e740e5154d4e0c56f6"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Panama Canal",
      "weight": 0.10246357
    },
    {
      "name": "Panama",
      "weight": 0.097591646
    },
    {
      "name": "South China Sea",
      "weight": 0.09236123
    },
    {
      "name": "China",
      "weight": 0.090021804
    },
    {
      "name": "U.S. President Donald Trump",
      "weight": 0.08365924
    },
    {
      "name": "Acting U.S. Ambassador Dorothy Shea",
      "weight": 0.08027838
    },
    {
      "name": "U.S. troops",
      "weight": 0.080215506
    },
    {
      "name": "U.S.",
      "weight": 0.07740108
    },
    {
      "name": "U.S. Defense Secretary Pete Hegseth",
      "weight": 0.07570949
    },
    {
      "name": "global maritime security",
      "weight": 0.07428855
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.97998046875
    },
    {
      "name": "/People & Society/Social Sciences/Political Science",
      "score": 0.97265625
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.86572265625
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.58837890625
    },
    {
      "name": "/News/World News",
      "score": 0.52978515625
    }
  ],
  "sentiment": {
    "positive": 0.07014318,
    "negative": 0.7125841,
    "neutral": 0.21727282
  },
  "summary": "The US and China clashed at the United Nations (UN) over the Panama Canal, a topic that has been a focus of attention since President Donald Trump suggested that the US should consider retaking control of the canal. The U.S. built the canal in the early 1900s to facilitate the transit of commercial and military vessels between its coasts. Control of the waterway was transferred to Panama in 1999 under a treaty signed in 1977 by President Jimmy Carter. China's U.N. Ambassador Fu Cong emphasized that Panama has consistently managed the canal, making significant contributions to global shipping and trade. The US has accused China of having its influence over the canal area, particularly over critical infrastructure and port operations, and has pressured China to sell its ports to a U.K. consortium that includes BlackRock Inc. The Chinese envoy accused the US of using its expansive maritime claims and aggressive actions to threaten maritime security and commerce.",
  "shortSummary": "China and the US are in conflict over control of the Panama Canal, with both sides emphasizing Panama's sovereignty and China's influence over the waterway.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "f9cdb65acbf945dea7126520b8729a0b",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://apnews.com/article/panama-canal-us-trump-protest-f98997ef4da1f944948357ccd884fa36",
      "text": "Thousands march over concern Panama bending to US government\nThousands march over concern Panama bending to US government\nPANAMA CITY (AP) — Thousands of Panamanians marched in the capital Tuesday in the largest protest yet against an agreement signed during last month’s visit by U.S. Defense Secretary Pete Hegseth giving U.S. troops access to strategic air and naval facilities in the Central American nation.\nU.S. President Donald Trump thrust Panama into the spotlight even before winning election last November by suggesting that his country should consider retaking control of the Panama Canal and accusing Panama of ceding influence to China.\nPanama has vehemently rejected those comments but also tried to pacify the new administration, which has slapped tariffs on many trade partners.\nUniversity students led Tuesday’s protest accusing President José Raúl Mulino of sacrificing Panama’s sovereignty with the deal.\n“We feel like our president is acting against the wishes of many Panamanians and in very sensitive affairs,” 30-year-old student Tony Ruiz said. “He signs an agreement behind our back that compromises our sovereignty, our neutrality with the world.\nThe previous night Foreign Affairs Minister Javier Martínez-Acha said of the agreement with Washington: “The memorandum of understanding does not imply a surrender of sovereignty, nor does it violate the national constitution, nor the neutrality treaty.”\nBases where the U.S. will get access for military personnel and contractors will always remain under the control of Panama and it can terminate the agreement with six months notice, he said.\nMartínez-Acha said the U.S. government acted in bad faith in how it handled the sensitive issue in the media, an apparent reference to Trump’s inflammatory comments on the canal, but nonetheless Panama was being “prudent” and trying to avoid sanctions that have befallen other countries.\n“International cooperation is necessary to strengthen our capabilities,” he said. “Collaborating with the United States in this case helps us improve security without affecting our sovereignty or our laws.”\nThe details of the deal only became public days after Hegseth’s visit.\nIn a separate agreement, Panama also agreed to look for a way for the U.S. government to be reimbursed for fees its naval ships pay to transit the Canal. The Trump administration has argued that it should not be obligated to defend the canal and pay to use it.\nThe U.S. built the canal in the early 1900s as it looked for ways to facilitate the transit of commercial and military vessels between its coasts. Control of the waterway transferred to Panama in 1999 under a treaty signed in 1977 by President Jimmy Carter.\nThe Trump administration has also pressured for the Hong Kong-based operator of ports at either end of the canalto sell those interests to a U.S. consortium that includes BlackRock Inc.\nWhile Martínez-Acha suggested that politically motivated opponents are stirring controversy, the student protesters expressed concern about a U.S. return to a country it invaded as recently as 1989.\n“We are a neutral country; we cannot take sides with any country,” said Jam Allard, another student.\n“We want our country to be sovereign.”"
    },
    {
      "url": "https://apnews.com/article/panama-canal-trump-china-a56f0bcec1952417f1c8c47fa34ec20e",
      "text": "Panama president calls Trump’s talk of ‘reclaiming’ the Panama Canal a lie\nPanama president calls Trump’s talk of ‘reclaiming’ the Panama Canal a lie\nPANAMA CITY (AP) — Panama President José Raúl Mulino on Wednesday accused U.S. President Donald Trump of lying when he said in his address to Congress that his administration was “reclaiming” the Panama Canal.\nTrump was referencing a deal announced Tuesday for a consortium led by the U.S. investment management company BlackRock Inc. to buy a controlling stake in the company held by a Chinese group that operates ports at both ends of the Panama Canal.\nPanama maintains that it has full control over the canal and that the Hong Kong-based group’s operation of the ports did not amount to Chinese control over the waterway, and that therefore the sale to a U.S.-based company would not represent any U.S. “reclaiming” of the canal. Panama’s government on Tuesday called the sale a private transaction.\nMulino in a message posted to X on Wednesday, rejected that the deal came about because of U.S. pressure. “I reject in the name of Panama and all Panamanians this new affront to the truth and our dignity as a nation,” he wrote. He accused Trump of “lying again.”\nTrump has talked about retaking the Panama Canal since his campaign, arguing that the U.S. should have never turned control over to the Panamanians and that the U.S. was being overcharged for using it.\nU.S. Secretary of State Marco Rubio met with Mulino in early February and insisted that China was exerting influence over the canal’s operations. The focus was the Chinese consortium running the ports. Panama rejected that China had any influence over canal operations.\n“Cooperation between our governments passes through clear understandings in terms of issues of mutual interest,” Mulino wrote. “It doesn’t have anything to do with ‘reclaiming the canal’ nor with tarnishing our national sovereignty.”\nIn a filing, CK Hutchison Holding said Tuesday that it would sell all shares in Hutchison Port Holdings and in Hutchison Port Group Holdings to the BlackRock consortium in a deal valued at nearly $23 billion, including $5 billion in debt.\nThe deal has to be approved by Panama’s government.\nThe United States built the canal in the early 1900s as it looked for ways to facilitate the transit of commercial and military vessels between its coasts. Washington relinquished control of the waterway to Panama on Dec. 31, 1999, under a treaty signed in 1977 by President Jimmy Carter. Trump has claimed that Carter “foolishly” gave the canal away.\nFrank Sixt, co-managing director of CK Hutchison, said in a statement that the transaction was “the result of a rapid, discrete but competitive process in which numerous bids and expressions of interest were received.”\n“I would like to stress that the transaction is purely commercial in nature and wholly unrelated to recent political news reports concerning the Panama Ports,” Sixt said."
    },
    {
      "url": "https://apnews.com/article/hong-kong-panama-canal-beijing-hutchison-blackrock-rubio-d02a8439cc63d9e740e5154d4e0c56f6",
      "text": "BlackRock strikes deal to bring ports on both sides of Panama Canal under American control\nBlackRock strikes deal to bring ports on both sides of Panama Canal under American control\nA Hong Kong-based conglomerate has agreed to sell its controlling stake in a subsidiary that operates ports near the Panama Canal to a consortium including BlackRock Inc., effectively putting the ports under American control after President Donald Trump alleged Chinese interference with the operations of the critical shipping lane.\nIn a filing, CK Hutchison Holding said Tuesday that it would sell all shares in Hutchison Port Holdings and in Hutchison Port Group Holdings to the consortium in a deal valued at nearly $23 billion, including $5 billion in debt.\nThe deal will give the BlackRock consortium control over 43 ports in 23 countries, including the ports of Balboa and Cristobal, located at either end of the Panama Canal. Other ports are in Mexico, the Netherlands, Egypt, Australia, Pakistan and elsewhere.\nThe transaction, which must be approved by Panama’s government, does not include any interest in a trust that operates ports in Hong Kong, Shenzhen and South China, or any other ports in China.\nSome 70% of the sea traffic that crosses the Panama Canal leaves or goes to U.S. ports. The United States built the canal in the early 1900s as it looked for ways to facilitate the transit of commercial and military vessels between its coasts. Washington relinquished control of the waterway to Panama on Dec. 31, 1999, under a treaty signed in 1977 by President Jimmy Carter. Trump has claimed that Carter “foolishly” gave the canal away.\nTrump and his supporters have also complained about the fees that ships are charged to use the waterway and alleged that China has been operating the canal, an assertion denied by Panama’s government.\nIn January, U.S. Sen. Ted Cruz, the Republican chair of the Senate Committee on Commerce, Science and Transportation, raised concerns that China could exploit or block passage through the canal and that the ports “give China ready observation posts” to take action. “This situation, I believe, posts acute risks for U.S. national security,” Cruz said.\nU.S. Secretary of State Marco Rubio visited Panama in early February and told President José Raúl Mulino that Panama had to reduce Chinese influence over the canal or face potential retaliation from the United States. Mulino rejected the idea that China had any control over canal operations.\nPanama quit China’s Belt and Road Initiative following Rubio’s visit, drawing condemnation from Beijing. Belt and Road is Beijing’s global development strategy to build roads, ports and railways to open up new markets.\nBut while much attention was focused on Trump’s threat to retake control of the canal, his administration trained its sights on Hutchison Ports, the Hong Kong-based consortium that manages the ports key ports at either end of the canal.\nHutchison Ports had recently been awarded a 25-year no-bid extension to run the ports, but an audit looking at that extension was already underway. Observers believed the audit was a preliminary step toward eventually rebidding the contract, but rumors had swirled in recent weeks that a U.S. firm close to the White House was being lined up to take over.\nFrank Sixt, co-managing director of CK Hutchison, said in a statement that the transaction was “the result of a rapid, discrete but competitive process in which numerous bids and expressions of interest were received.”\n“I would like to stress that the transaction is purely commercial in nature and wholly unrelated to recent political news reports concerning the Panama Ports,” Sixt said.\nIn addition to BlackRock, a New York-based global investment management company with $11.6 trillion in assets under management as of Dec. 31, the consortium includes BlackRock subsidiary Global Infrastructure Partners and Terminal Investment Limited.\nBlackRock declined to comment outside of a press release touting the deal. Shares in BlackRock fell 1.5% in afternoon trading Tuesday."
    },
    {
      "url": "https://apnews.com/article/panama-us-mulino-hegseth-canal-33b7e18a1e879706712309118c3ad8c0",
      "text": "US defense secretary says China is a threat to Panama Canal, spurring a fiery response from Beijing\nUS defense secretary says China is a threat to Panama Canal, spurring a fiery response from Beijing\nPANAMA CITY (AP) — U.S. Defense Secretary Pete Hegseth said Tuesday the Panama Canal faces ongoing threats from China but that together the United States and Panama will keep it secure.\nHegseth’s remarks triggered a fiery response from the Chinese government, which said: “Who represents the real threat to the Canal? People will make their own judgement.”\nSpeaking at a ribbon cutting for a new U.S.-financed dock at the Vasco Nuñez de Balboa Naval Base after a meeting with Panama President José Raúl Mulino, Hegseth said the U.S. will not allow China or any other country to threaten the canal’s operation.\n“To this end, the United States and Panama have done more in recent weeks to strengthen our defense and security cooperation than we have in decades,” he said.\nHegseth alluded to ports at either end of the canal that are controlled by a Hong Kong consortium, which is in the process of selling its controlling stake to another consortium including BlackRock Inc.\n“China-based companies continue to control critical infrastructure in the canal area,” Hegseth said. “That gives China the potential to conduct surveillance activities across Panama. This makes Panama and the United States less secure, less prosperous and less sovereign. And as President Donald Trump has pointed out, that situation is not acceptable.”\nHegseth met with Mulino for two hours Tuesday morning before heading to the naval base that previously had been the U.S. Rodman Naval Station.\nOn the way, Hegseth posted a photo on X of the two men laughing and said it was an honor speaking with Mulino. “You and your country’s hard work is making a difference. Increased security cooperation will make both our nations safer, stronger and more prosperous,” he wrote.\nLate Tuesday, Mulino and Hegseth released a joint statement.\nA vaguely worded portion of the statement suggested the two had discussed the tolls the United States pays for its ships crossing the canal. It said that within the canal’s framework, “the Republic of Panama and the United States of America will work, as established, on a mechanism to compensate for the payment of tolls and charges.”\nPanama’s Foreign Relations Ministry did not immediately answer a request for clarification.\nBut the Spanish and English versions had at least one significant discrepancy. The Spanish version included that “Secretary Hegseth recognized the leadership and inalienable sovereignty of Panama over the Panama Canal and its adjacent areas.” That sentence appeared nowhere in the English version.\nThe visit comes amid tensions over Trump’s repeated assertions that the U.S. is being overcharged to use the Panama Canal and that China has influence over its operations — allegations that Panama has denied.\nShortly after the meeting, the Chinese Embassy in Panama slammed the American government in a statement on X, saying the U.S. has used “blackmail” to further its own interests and that who Panama carries out business with is a “sovereign decision of Panama ... and something the U.S. doesn’t have the right to interfere in.”\n“The U.S. has carried out a sensationalistic campaign about the ‘theoretical Chinese threat’ in an attempt to sabotage Chinese-Panamanian cooperation, which is all just rooted in the United State’s own geopolitical interests,” the embassy wrote.\nAfter Hegseth and Mulino spoke by phone in February, the U.S. State Department said that an agreement had been reached to not charge U.S. warships to pass through the canal. Mulino publicly denied there was any such deal.\nTrump has gone so far as to suggest the U.S. never should have turned the canal over to Panama and that maybe that it should take the canal back.\nThe China concern was provoked by the Hong Kong consortium holding a 25-year lease on ports at either end of the canal. The Panamanian government announced that lease was being audited and late Monday concluded that there were irregularities.\nThe Hong Kong consortium, however, has already announced that CK Hutchison would be selling its controlling stake in the ports to a consortium including BlackRock Inc., effectively putting the ports under American control once the sale is complete.\nU.S. Secretary of State Marco Rubio told Mulino during a visit in February that Trump believes China’s presence in the canal area may violate a treaty that led the U.S. to turn the waterway over to Panama in 1999. That treaty calls for the permanent neutrality of the American-built canal.\nMulino has denied that China has any influence in the operations of the canal. In February, he expressed frustration at the persistence of the narrative. “We aren’t going to speak about what is not reality, but rather those issues that interest both countries,” he said.\nThe U.S. built the canal in the early 1900s as it looked for ways to facilitate the transit of commercial and military vessels between its coasts. Washington relinquished control of the waterway to Panama on Dec. 31, 1999, under a treaty signed in 1977 by President Jimmy Carter.\n“I want to be very clear, China did not build this canal,” Hegseth said Tuesday. “China does not operate this canal and China will not weaponize this canal. Together with Panama in the lead, we will keep the canal secure and available for all nations through the deterrent power of the strongest, most effective and most lethal fighting force in the world.”"
    }
  ],
  "argos_summary": "U.S. President Donald Trump's comments about potentially retaking control of the Panama Canal have sparked significant controversy, with Panama's government firmly rejecting any notion of ceding sovereignty to the U.S. or China. U.S. officials, including Defense Secretary Pete Hegseth, have expressed concerns over China's influence in the canal area, while Panama maintains that it effectively manages the canal and its operations. Recent protests in Panama reflect public discontent over agreements with the U.S. that some citizens believe compromise national sovereignty, despite government assurances that these agreements do not violate the country's constitution or neutrality treaty.",
  "argos_id": "TZ16GSIRO"
}