{
  "url": "https://www.bbc.co.uk/news/articles/cj0yzv0r3l9o",
  "authorsByline": "Tom Edwards",
  "articleId": "98f856c7d29f488997278e2a56be7d85",
  "source": {
    "domain": "bbc.co.uk",
    "location": {
      "country": "gb",
      "state": "",
      "county": "",
      "city": "London",
      "coordinates": {
        "lat": 51.5073219,
        "lon": -0.1276474
      }
    }
  },
  "imageUrl": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/3244/live/761fa330-72b4-11f0-afda-bb39e9f348ef.jpg",
  "country": "gb",
  "language": "en",
  "pubDate": "2025-08-12T05:27:31.281000+00:00",
  "addDate": "2025-08-12T05:39:57.492415+00:00",
  "refreshDate": "2025-08-12T05:39:57.492417+00:00",
  "score": 1.0,
  "title": "Heatwaves: What can London learn from Europe's hotter cities?",
  "description": "An academic says the UK treats the heat as \"a nice thing\" but it needs to be treated as a risk.",
  "content": "It is like a hair dryer blasting you in the face. It is nicknamed the \"Iberian Oven\" for very good reason. It is a dry heat, but get caught for long in the sun and you really feel it. It is 3pm in Seville in Southern Spain and the temperature is about 40 degrees. \"It's manageable in the shade.\" \"At least it's not 50 degrees!\" This vibrant, ancient, beautiful city is one of the hottest in Europe and the temperatures are becoming more and more severe.\n\nIn the temperatures of Seville, shade is a necessity. Trees and running water fountains that cool the environment are very common in the old part of Seville. The building are close together which creates shade. In the newer areas, awnings are tied across shopping streets to create shade. Most public buildings have air conditioning where people can take refuge from the temperatures during heatwaves.\n\nIn the centre of Seville is the huge wooden structure called Setas de Sevilla. It was originally going to be called the Metropol Parasol. As well as creating a magnicent spectacle, it also shades the whole of that area creating a cool plaza. It also gives you an idea of how creating shade is a big part of the city's identity.\n\nOf course, the best way to avoid the heat is not to go out in it. And in Seville, many of the bars and restaurants close during the afternoon. Behaviour has changed over the centuries and the siesta is part of Spanish life. Locals seem to go out late, after 8pm, once the heat has abated. Dr Mehri Khosravi is an expert in heat at the University of East London and says Londoners need to change their attitude to extreme heat and we can learn from our continental neighbours. \"We need to adapt in terms of building design. But we need to adapt our behaviour especially in the UK where the culture of heat is missing. People in the UK treat heat as a nice thing - they arrange BBQs and leisure activities but we need to start treating as a risk like they do in other countries. \"In the hottest hours of the day, they pause some activities and then they resume it in the evening. \"Or when you walk into a street during the day, and the sun is out they never open the windows. Curtains are shut so they don't let the heat in. They use night for ventilation. \"These simple changes in behaviour, the changes in routine, can make a big difference in how to deal with heat and we can learn from those countries.\"\n\nIn 2022, Seville became the first city to name heatwaves with Heatwave Zoe. The aim is to raise awareness and people take precautions. Other cities like Athens are now looking at the idea. Elsewhere in Italy, heatwaves have been called Cerebus and Charon although it has been contentious and not everyone agrees it helps. In the UK, storms are now named and that seems to be accepted. It's not a huge leap to see heatwaves also getting the same treatment.\n\nThe London Heat Risk Delivery Plan , externalis currently being developed. It will \"better prepare London for rising temperatures and extreme heat from climate change\". The Mayor of London is also committed to increasing London's tree canopy cover by 10% by 2050. Mete Coban is the deputy mayor, also responsible for environment and energy. He said: \"The first thing that we're doing is publishing a cool spaces map so we are signposting places to residents where they can go to cool off. \"The second thing that we're doing is making sure we have much more water refill points - over 4,000 across the city - to make sure Londoners stay hydrated. \"Our tree planting programme especially to create that shade, the mayor has planted over 600,000 trees across the city since 2016.\"",
  "medium": "Article",
  "links": [
    "https://www.bbc.co.uk/news/uk-62232654",
    "https://twitter.com/BBCLondonNews",
    "https://www.london.gov.uk/talk-london/topics/environment/londons-risk-rising-temperatures/background",
    "https://www.bbc.co.uk/news/topics/cmj34zmwm1zt",
    "https://www.london.gov.uk/",
    "https://www.bbc.co.uk/news/topics/c1y3r184ywpt",
    "https://www.bbc.co.uk/news/topics/clw2rl7ekd6t",
    "https://www.bbc.co.uk/news/articles/c8rpvpnzy4zo",
    "https://www.bbc.co.uk/sounds/curation/p0cjdwm5",
    "https://www.bbc.co.uk/future/article/20230718-the-fiery-row-behind-europes-mythological-heatwave-names",
    "https://www.facebook.com/BBCLondon",
    "https://www.bbc.co.uk/news/articles/cy8kdv3k027o",
    "https://www.bbc.co.uk/news/uk-england-london-66148110",
    "https://www.bbc.co.uk/news/topics/czp2j9gdep0t",
    "https://www.bbc.co.uk/news/topics/ckj6kvx762pt",
    "https://www.bbc.co.uk/news/topics/c302m85qenvt",
    "https://www.instagram.com/bbclondon/?hl=en"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "extreme heat",
      "weight": 0.0900994
    },
    {
      "name": "heat",
      "weight": 0.08540793
    },
    {
      "name": "Other cities",
      "weight": 0.07109002
    },
    {
      "name": "East London",
      "weight": 0.06480035
    },
    {
      "name": "rising temperatures",
      "weight": 0.061443962
    },
    {
      "name": "London",
      "weight": 0.06082066
    },
    {
      "name": "shade",
      "weight": 0.058887918
    },
    {
      "name": "Seville",
      "weight": 0.056603488
    },
    {
      "name": "Heatwaves",
      "weight": 0.056260377
    },
    {
      "name": "heatwaves",
      "weight": 0.056260377
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Weather"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Weather",
      "score": 0.892578125
    },
    {
      "name": "/Travel & Transportation/Tourist Destinations/Other",
      "score": 0.367431640625
    }
  ],
  "sentiment": {
    "positive": 0.07575921,
    "negative": 0.5761503,
    "neutral": 0.34809044
  },
  "summary": "The article discusses the lessons learned from European cities such as Seville, where temperatures are becoming more severe. Seville is one of the hottest cities in Europe and its inhabitants use shade, trees, running water fountains, and awnings tied across shopping streets to create shade. Dr Mehri Khosravi from the University of East London suggests that Londoners need to adopt a more accepting attitude to extreme heat and learn from continental counterparts. He also suggests that the UK should adopt a culture of heat and start treating it as a risk like those in other countries. The article also discusses the implementation of the London Heat Risk Delivery Plan, which aims to prepare London for rising temperatures and extreme heat from climate change.",
  "shortSummary": "London must adopt strategies like Seville's shade system and increased water refit points to cope with extreme heat, learning lessons from European cities like Athens and Seville.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "c4a35e632da9434d94616de84b9bd563",
  "places": [
    {
      "osmId": "138602581",
      "road": "Calle Imagen",
      "suburb": "Casco Antiguo",
      "city": "Seville",
      "stateDistrict": "Sevilla",
      "state": "Andalusia",
      "postcode": "41003",
      "country": "Spain",
      "countryCode": "es",
      "neighbourhood": "Encarnación-Regina",
      "coordinates": {
        "lat": 37.3931193,
        "lon": -5.991853249229725
      }
    }
  ],
  "scraped_sources": [
    {
      "url": "https://www.bbc.co.uk/news/uk-62232654",
      "text": "London Fire Brigade had busiest day since World War Two, says London mayor\n- Published\nLondon's fire service had its busiest day since World War Two dealing with multiple blazes in record-breaking temperatures on Tuesday, London Mayor Sadiq Khan has said.\nThe capital was one of 15 areas around the UK to declare a major incident.\nThe fires started on a day which saw a record temperature of 40.3C (104.5F) in Coningsby, Lincolnshire.\nWednesday has been cooler for most but thunderstorms are forecast in central England.\nA yellow warning has been issued by the Met Office for heavy showers and thunderstorms which could bring disruption in eastern and south-east England on Wednesday evening.\nDespite falling temperatures, the weather is continuing to affect transport, with Network Rail advising passengers to only travel if necessary.\nBy mid-afternoon LNER services from London to Scotland were starting up again, while trains on the East Coast Mainline resumed after a fire in Bedfordshire.\nMr Khan said London Fire Brigade (LFB) received 2,600 calls as it dealt with multiple fires. He earlier told Sky News 41 properties were destroyed in London on Tuesday.\nIn Wennington, east London, 100 firefighters tackled a blaze which destroyed several homes.\nLFB said two rows of terraced houses, four other homes, 12 stables and five cars were destroyed by the blaze, while one firefighter at the scene described it as \"absolute hell\".\nDramatic images from the scene showed smoke billowing from buildings, some with their roofs collapsed, and extensive damage to the surrounding land.\nSpeaking to BBC Radio 4's Today programme, Mr Khan said: \"Yesterday was the busiest day for the fire service in London since the Second World War.\n\"Normally we get 350 calls a day, on a busy day we can get up to 500 calls. Yesterday the fire service had more than 2,600 calls a day.\"\nThe mayor has advised Londoners not to have barbecues in parks or private gardens over concerns they could set alight grass.\nLFB assistant commissioner Jonathan Smith said he had not seen anything like the \"sheer scale across the whole of London\" as the brigade dealt with 15 major fires, and a large number of wildfires and grassland fires.\nThe heat and dry conditions created \"the perfect scenario\" for fires to spread rapidly across grassland and woodland, with the speed a particular challenge, he said.\nSpeaking in Wennington, he said the brigade had never before asked firefighters to operate when the temperature outside was 40C.\n\"We're obviously thinking very carefully about how we can be even better prepared as we move forward, because what we do know is that climate change is going to continue to pose challenges for us.\"\nElsewhere, a number of homes were destroyed by fire in Norfolk, and major incidents were declared in Leicestershire, Hertfordshire, Suffolk, Lincolnshire and Yorkshire., among others.\nAt Prime Minister's Questions, Boris Johnson thanked firefighters and said he had spoken with the chair of the National Fire Chiefs Council.\nLFB said 16 firefighters had heat-related injuries - two of whom were taken to hospital but have since been discharged. South Yorkshire Fire and Rescue said four from their crews had been taken to hospital but have made a full recovery.\nSpeaking after PMQs, Cabinet Office minister Kit Malthouse told MPs some of the pressure would now ease as the \"fiercest heat has subsided\" but he warned the summer was likely to bring further hot weather and the risk of wildfire remained elevated.\n\"That is why we are treating this heatwave as an exacting test of our national resilience and contingency planning,\" he said.\n'My house is completely gone'\nTim Stock alerted the fire brigade when he saw flames near his home in Wennington.\nMr Stock, whose house was destroyed, told BBC Radio 5 Live he and his son had spotted the fire in his neighbour's garden but, despite their best efforts with a hose and watering can, had been unable to stop it spreading.\n\"I reckon about 15 to 20 houses might be gone or uninhabitable,\" he said.\n\"My house is completely gone, as is the next door neighbour's and three or four other houses along that bit.\"\nThe Fire Brigades Union (FBU) has accused government spending cuts of hampering the fire service's ability to react.\nMatt Wrack, the union's general secretary, said firefighters were \"at the forefront of the climate emergency\" but, while the demands of the job were increasing, their resources had been cut by government for over a decade with 11,500 firefighter jobs cut since 2010.\nSpeaking about the LFB, Mr Khan said he inherited closed fire stations, cancelled engines and firefighters losing jobs when he took over as mayor from Boris Johnson.\nHe said he has been rebuilding the capital's fire service with kit and more firefighters.\nPhil Garrigan, who leads the National Resilience group for the National Fire Chiefs Council, said the UK must now consider what equipment it had to fight wildfires.\nHe said most European countries where significant wildfires occur have planes or helicopters which can collect or distribute water to areas where fire is developing.\nMeanwhile, Just Stop Oil demonstrators climbed motorway signs on the M25, near Cobham, Surrey, to protest at the extreme temperatures in the UK.\nPolice closed sections of the motorway and at one stage there were five-mile traffic queues approaching junction 30 in Essex, National Highways said.\nThe latest Met Office provisional figures show that Scotland's record-breaking highest temperature, hit on Tuesday, was higher than first thought, with 35.1C registered at Floors Castle in Kelso.\nHeatwaves have become more frequent, more intense, and last longer because of human-induced climate change, and that hot, dry weather is likely to fuel wildfires.\nThe world has already warmed by about 1.1C since the industrial era began and temperatures will keep rising unless governments around the world make steep cuts to emissions.\nMet Office chief scientist Prof Stephen Belcher said Tuesday's temperatures were striking due to the large record-breaking margin and the extensive area of the UK experiencing the severe temperatures.\nBut \"aggressive emissions cuts\" could very sharply reduce the frequency of extreme temperatures, he told BBC News.\nWere you affected by Tuesday's fires? You can share your experiences by emailing haveyoursay@bbc.co.uk, external.\nPlease include a contact number if you are willing to speak to a BBC journalist. You can also get in touch in the following ways:\nWhatsApp: +44 7756 165803, external\nTweet: @BBC_HaveYourSay, external\nOr fill out the form below\nPlease read our terms & conditions and privacy policy\nIf you are reading this page and can't see the form you will need to visit the mobile version of the BBC website to submit your question or comment or you can email us at HaveYourSay@bbc.co.uk, external. Please include your name, age and location with any submission.\nRelated topics\n- Published20 July 2022\n- Published19 July 2022\n- Published19 July 2022\n- Published19 July 2022\n- Published20 July 2022"
    },
    {
      "url": "https://www.bbc.co.uk/news/topics/c302m85qenvt",
      "text": "Spain\nUpdates from your News topics will appear in My News and in a collection on the News homepage.\n- Attribution\n- Posted1 hour ago\n- Attribution\n- Posted2 hours ago\n- Attribution\n- Posted2 days ago\n- Attribution\n- Posted4 days ago\n- Attribution\n- Posted1 August\n- Attribution\n- Posted31 July\n- Attribution\n- Posted30 July\n- Attribution\n- Posted29 July\nWitness History. Eta’s assassination of Juan Mari Jáuregui. Audio, 10 minutes\nOn 29 July 2000, Basque separatists Eta killed the retired Spanish politician\n- AttributionBBC World Service\n- Available for over a year\n- Attribution\n- Posted18 July\nWitness History. The 'Turbot War' Audio, 11 minutes\nIn 1995, an international row broke out between Canada and Spain over fishing quotas\n- AttributionBBC World Service\n- Available for over a year\n- Attribution\n- Posted15 July\n- Attribution\n- Posted8 July\n- Attribution\n- Posted1 July\n- Attribution\n- Posted29 June\n- Attribution\n- Posted28 June\n- Attribution\n- Posted24 June\n- Attribution\n- Posted24 June\n- Attribution\n- Posted23 June\n- Attribution\n- Posted20 June\nRamblings. Arriving in Santiago de Compostela with Sharon, Shirley and friends. Audio, 24 minutes\nClare arrives in Santiago de Compostela with a group of friends completing the Camino.\n- AttributionBBC Radio 4\n- Available for over a year\n- Attribution\n- Posted17 June"
    },
    {
      "url": "https://www.bbc.co.uk/news/articles/c8rpvpnzy4zo",
      "text": "Why London Fire Brigade is running wildfire drills\n- Published\nFirefighters are preparing for what is expected to be an increase in wildfires in London over the summer months with regular drills in the city's parks.\nSince experiencing its busiest day since World War Two in 2022, London Fire Brigade (LFB) has dedicated more resources to tackling wildfires in the capital, nearly half of which is made up of green space.\nLast week, Richmond Park in south-west London saw more than 50 people from LFB, the Met Police and the Royal Parks - the charity responsible for running eight London parks - take part in an exercise.\nRob Davies from the LFB said it was a \"good opportunity for staff to see how the equipment works and how arduous it is\".\nLast Thursday's drill focused on protecting an area of special scientific interest hosting skylarks on one side, and the Royal Ballet School on another.\nSurrey Fire and Rescue's Unimog machine, which holds up to 4,500 litres and is used to spray a curtain of water, was deployed to create a fire break.\nMr Davies said there had already been 16 grass fires needing four or more fire engines to attend in 2025 following one of the driest UK springs on record.\nBy the same time last year, there had been just two. Overall, there have been 20 wildfires in London this year.\nIt follows a report from Imperial College London, which suggested there were 263 excess deaths caused by heatwaves in the 10 days since 23 June.\nThe report also stated wildfire risk was heightened by climate change, as high temperatures dry out leaf litter, grasses and trees, which leads to fires spreading rapidly across grassland and woodland.\nMr Davies said resourcing something like this was \"quite difficult\" because of the hot weather, but was essential to arrange as \"it's a big part of our firefighters' day-to-day job\".\nHe added: \"We've invested substantially in wildfire technology, training and extra equipment.\n\"It's a risk that's not going to go away and scenarios like this are ideal.\"\n- Published9 April\n- Published6 June\n- Published10 April\nPeter Lawrence, assistant manager at Richmond Park, said the drill was \"excellent... because with extremes of weather, wildfire risk is increasing\".\nHe added: \"We are regularly seeing wildfires, whether that's in trees or grasslands and it does cause harm to wildlife.\n\"It was great to see the response, to get support from across the police and the London Fire Brigade and for our teams to be able to join in and really test what we can offer.\"\nThe advice remains to avoid any open fires.\nListen to the best of BBC Radio London on Sounds and follow BBC London on Facebook, external, X, external and Instagram, external. Send your story ideas to hello.bbclondon@bbc.co.uk, external"
    },
    {
      "url": "https://www.bbc.co.uk/news/uk-england-london-66148110",
      "text": "Wennington wildfire probably started in back garden - report\n- Published\nA London Fire Brigade investigation has concluded the Wennington wildfire was likely to have started in a garden.\nA large grass fire in the village in Havering, east London, tore through 17 houses during scorching temperatures in July last year.\nWhile investigators were unable to determine the exact cause of the blaze, a large caravan was noted as an early area of where it began.\nThe brigade added it had not fully discounted that it was deliberate.\nAt about 13:00 BST on 17 July 2022, a neighbour saw white smoke coming from near a large willow tree in the garden, which turned into flames.\nIn total the fire spread across 40 hectares, damaging 17 houses, five garages, 12 stables, a car repair workshop and several vehicles, as well as numerous sheds and outbuildings.\nThe investigator wrote: \"Having called the brigade, [the neighbour] attempted to stop the fire spreading using a hosepipe, however, this had little effect.\"\nThe conditions were \"exceptionally hot and dry\", the investigator added, which meant the flames could easily move along the marshland to the rear of the properties.\nAt the time of the blaze, the fire brigade was also fighting numerous other blazes including a 30-pump fire in Upminster.\nThe investigator said the brigade, which had a station less than 100m (328ft) from the site where the fire started, would have sent more than 15 pumps were it not for the \"unprecedented conditions\".\nHavering Council leader Ray Morgon said: \"Whilst the report does not provide a definite conclusion on the cause of the fire, one thing we can conclude from the findings and guidance is that fire safety is everyone's responsibility.\n\"As we enter the summer months and the likelihood of higher temperatures it is up to us all to take measures to prevent this type of horrific incident from happening again.\"\nFollow BBC London on Facebook, external, Twitter , externaland Instagram, external. Send your story ideas to hellobbclondon@bbc.co.uk, external\nRelated topics\n- Published10 July 2023\n- Published20 July 2022\n- Published4 August 2022\n- Published18 August 2022"
    },
    {
      "url": "https://www.london.gov.uk/talk-london/topics/environment/londons-risk-rising-temperatures/background",
      "text": "London’s risk from rising temperatures\nOpen\n1654 Londoners have responded\nBackground\nThe challenge\nLondon’s climate continues to change. In recent decades, we have experienced warmer, wetter winters and hotter, drier summers than in the 20th century.\nIn summer 2022, temperatures exceeded 40C in London. Schools were closed, hospital operations were cancelled as systems crashed and wildfires caused the London Fire Brigade's busiest day since WWII. Trainlines buckled at King’s Cross railway station, and London’s economy suffered as footfall in the city plunged. Heat also puts pressure on infrastructure, including water and power grids.\nIt is estimated that the summer 2022 heatwaves caused 387 excess deaths in London (UKHSA). Whilst everybody was at risk from the 40C heatwave, older people and young children and babies are more vulnerable to the risk of overheating in hot weather. Outdoor workers are also vulnerable to the risks of overheating, as well as people rough sleeping in London. Pregnant women and people with underlying medical conditions can also be vulnerable to the effects of heat.\nHotter, drier summers can also result in the loss of biodiversity. High temperatures can damage trees. Four out of 10 of the most common street tree species in London are known to have a low tolerance to drought (UK Forestry Commission Blog).\nOur approach\nCity Hall is working on an action plan with partners to better prepare London for rising temperatures and extreme heat from climate change.\nYour views in our survey will help inform the London Heat Risk Delivery Plan. This will set out the roles, responsibilities and actions we need to better manage London's heat risk.\nGet involved and tell us:\n- What helps you cope with heat?\n- What would you like to see done to help cool the city during a heatwave?\n- What do you think should be done in London to help keep the city cooler all year round?\nAlongside our Talk London survey, the team are also:\n- carrying out polling with a representative sample of Londoners\n- running workshops with young Londoners\n- hosting a roundtable with key stakeholders\nThe recommendation to create a Heat Risk Delivery Plan came out of the London Climate Resilience Review. This was informed by the views of experts and Londoners, including here on Talk London.\nIn addition to the London Heat Risk Delivery Plan, City Hall has set up the following initiatives to help keep Londoners safe in heat:\n- Cool spaces map – A network of indoor spaces that provide Londoners with shelter in hot weather\n- Refill London – Water fountains distributed across the city to provide free tap water all year round and especially during hot weather\n- Climate Risk Map – A map that helps London boroughs identify which communities are at the highest risk from extreme weather events\n- Trees for London – The Mayor’s programme to plant thousands of new trees to cool the city and provide shade to Londoners in hot weather.\n- Overheating audits for care homes – the Mayor’s Care Home Audit pilot includes recommendations to help care homes prepare for extreme heat events.\n- Guidance for schools and Early Years – the Mayor has established guidance that schools and Early Years’ Settings can take to prepare for extreme heat\n- Climate Resilience Schools – The programme worked with up to 100 schools to reduce flooding and heat risk\nDelve deeper\nAbout the policy team\nEleanor from City Hall’s Climate Adaptation team will be reading your comments in our survey and discussion.\nThe Environment team works towards supporting a fairer, greener London for everyone.\nTheir work ensures that:\n- Londoners can enjoy green and wild spaces across the capital\n- London is resilient to extreme weather and the impacts of climate change\n- London is net zero-carbon by 2030."
    },
    {
      "url": "https://www.bbc.co.uk/future/article/20230718-the-fiery-row-behind-europes-mythological-heatwave-names",
      "text": "The creature was the stuff of nightmares. Three-headed, with gnashing teeth that dripped gore and slobbering jaws that foamed poison, his mane and tail sprouted with writhing snakes. So massive that he sprawled across the entirety of his cave, he had a bark that echoed across the realm. His tail was a hissing serpent. By some accounts, his eyes flashed fire. He was so horrific, wrote Hesiod, that he could neither be overcome – or even described.\nThe monster was Cerberus, and, from the 8th Century BC, he was known to the ancient Greeks, and then to the Romans, as the \"hound of Hades\". His job was to ensure that no-one escaped the realm of the dead. (He also protected it from unwanted visitors but, needless to say, this task was required much less often).\nMore recently, he has also lent his name to a blistering heatwave that engulfed Europe this month.\nLarge storms, such as hurricanes and typhoons, are given names by weather services around the world to make it easier for meteorologists to communicate information about them. Tropical cyclone monikers are picked from a banal, internationally-agreed rota of everyday names that get recycled every six years – Atlantic tropical storms this year include Emily, Cindy and Sean. Heatwaves, on the other hand, are not.\nAnd attempts to name heatwaves has now led to a growing row among meteorologists about whether it is right to do so.\nThere is no international convention on naming extreme and excessive heat events, and the current position of the World Meteorological Organization (WMO), which oversees the naming of storms, is that it might distract attention from the public health threat. It argues that the science of issuing heatwave forecasts and warnings is still too young to be done consistently and effectively.\nYet others disagree, arguing that naming can bring attention to a \"grossly underestimated and gravely misunderstood\" health threat. And so, as heatwaves – generally defined as periods of unusually hot weather that persist over more than two days – become more common, other organisations are naming them instead. In June 2022, the local authority of Seville, Spain, launched a pilot programme naming heatwaves. The ensuing category three heatwave, named Zoe, scorched southern Spain the following month with temperatures of 43C (109F).\nParts of southern Europe – and in particularly Spain and Italy – have experienced temperatures in excess of 46C (114F) during July (Credit: ESA)\nThe latest heatwaves, which have affected parts of Italy and southern Europe with temperatures as high as 48.8C (119.8F), were named Cerberus and Caronte – the Italian name for Charon, the boatman of Hades – by an Italian weather website iLMeteo. It has been using mythological figures for the high-pressure regions that produce extreme heat in Europe since 2017.\nThis year, however, the names seems to have struck a chord with the public worldwide, and led to inaccurate claims the heatwaves had been officially named by the Italian Meteorological Society. The naming of heatwaves was taking place unofficially and \"somewhat sensationalistically, in the case of Italy\", the Italian Meteorological Society, told the BBC. A spokesperson confirmed they did not name heatwaves.\nYou might also like to read:\n- What science says about staying cool in a heatwave\n- How cities are adapting to a hotter future\n- The ancient Chinese way to cool homes\nOne reason for the reluctance from official weather bodies to name heatwaves is the difficulty in unpicking one event from another. Heatwaves are often not distinct events but can merge into one another and straddle international borders as weather systems build.\n\"The different levels of heatwave intensity and associated impacts within a heatwave are significant,\" adds John Nairns, senior extreme heat advisor at the WMO. \"This valuable information cannot afford to compete with multiple names across a single weather system, where one neighbour may have named the event whilst another has not, or multiple names are assigned across the life cycle of an event. We cannot afford to be distracted by additional coordination nor inevitable divisions and distractions which will destroy confidence in forecasts and warnings.\"\nYet, the latest mythological names have caught on. And perhaps one reason may be that the names are not simple monikers – they also provide a message.\nThat approach may be particularly important given that we know that both heatwaves and higher average temperatures overall are far likelier due to human-induced climate change. On 4 July, the world's average temperature crept above 17C (63F) for the first time in recorded history, while heatwaves are becoming more common and intense. Research has found that the April 2023 heatwave in south-western Europe and north Africa where temperatures exceeded 41C (106F), for example, was 100 times more likely to occur due to global warming.\nAnd the greater risk of heatwaves exerts a heavy toll: a study published this month estimated that 61,672 people died of heat-related causes in Europe in 2022. The authors called on governments to re-evaluate and strengthen heat prevention and adaptation plans.\nHades is, in other words, the \"upside-down\" of the ancient world – much like the most ominous forecasts of our future under climate change\nOn the surface, there are some obvious reasons for why the names Cerberus and Charon might fit a heatwave. Both have connotations of hellishness: while Cerberus was the underworld's guard dog, Charon was the ferryman who took the dead across the river Styx. Meanwhile, the current heatwave, Cerberus, has been divided into three separate, climatic zones – or three \"heads\" of the monstrous dog.\nBut there could be a deeper meaning too.\n\"Cerberus is supposed to be this guardian of the underworld,\" says Emma Stafford, professor of Greek culture at the School of Languages, Cultures and Societies at the University of Leeds. \"It's threatening – potentially life-threatening. And it needs a Herakles to fight it off.\"\nIt isn't just that Cerberus is monstrous and frightening, or that he keeps doomed souls where they belong. It's also that it is a creature that is impossible to overpower. Impossible for everyone, that is, except Herakles – the demigod with superhuman strength also often known as Hercules.\nAnd therein lies the hope in the ancient stories – and, perhaps, in ours too. Told to capture and bring Cerberus up from the underworld, Herakles finds he can't rely on strength alone to overpower the monster.\n\"He doesn't just use brute force on it. Instead, he has to persuade or charm the dog,\" Stafford says. In other words, Herakles does not just rely on the physical might that have ensured his other victories. Instead, he must use his intellect – much as, perhaps, we cannot fight climate change by simply relying on the same strategies that have brought us here but, many experts say, must come up with a completely new paradigm.\nIn Greek mythology, Cerberus was a monstrous three-headed dog who was impossible to overpower by all but the demigod Herakles (Credit: Getty Images)\nOf course, Cerberus' and Charon's literary connections to Hades aren't a perfect parallel to today's heatwaves. (Nor is it clear that those behind the naming meant for them to be). For one, the ancients conceived of Hades itself as misty, gloomy, and dark, a far cry from the heat, fire and brimstone of later Christian traditions. (Some media outlets have referred to Cerberus as being named after the Cerberus of Dante's Inferno, a poem which certainly had much more fire than the original, ancient myths).\nThe cool temperatures aside, however, there could be other ways in which Hades holds resonance for our heatwaves today. For one, Hades is a kind of nightmarish mirror image of our own world, a bustling community that absorbs, and traps, every single soul of the dead. \"Lifeless shadows without body or bones wander about, some jostling in the marketplace, some round the palace of the underworld's king, while others busy themselves with the trades which they practised in the old days, when they were alive,\" writes Ovid in the Metamorphoses.\nHades is, in other words, the \"upside-down\" of the ancient world – much like the most ominous forecasts of our future under climate change, which seem to be becoming more and more likely to come to pass without a drastic and urgent global response. They predict a kind of \"upside-down\" for our own world, one in which not only heatwaves but floods, droughts and a decimated natural landscape in some parts of the world become the norm.\nFor some unlucky souls, Hades also is a place of perpetual punishments. In the Abode of the Accursed, unfortunate souls undergo an eternity of tortures: Tityus, stretched out in chains, must endure vultures always tearing at his entrails. Sisyphus pushes a stone in vain up a hill as it continually rolls back.\nIn terms of our own fight against climate change, the most poignant victim, may be Ixion – a king punished for murdering his own kin by being lashed to a fiery wheel that spun for eternity, forcing him to run in circles forever, both chasing, and fleeing from, himself.\n--\nJoin one million Future fans by liking us on Facebook, or follow us on Twitter or Instagram.\nIf you liked this story, sign up for the weekly bbc.com features newsletter, called \"The Essential List\" – a handpicked selection of stories from BBC Future, Culture, Worklife, Travel and Reel delivered to your inbox every Friday."
    },
    {
      "url": "https://www.london.gov.uk/",
      "text": "We are London.\nWho we are\nSadiq Khan is the current Mayor. He provides citywide leadership and creates policies to improve London for all.\nThe Assembly holds the Mayor and Mayoral advisers to account by examining their work to ensure promises to Londoners are delivered.\nPriorities for London\nRead about the things that matter most right now.\nOur 10-year ambition for London's growth, and the actions we will take to make it happen.\nWe are on a mission to end rough sleeping in London by 2030. Will you join us?\nFind out what support is available to help you manage the cost of living in London.\nHelp us prepare for heatwaves in London\nCity Hall is putting together a new action plan to better prepare for heatwaves and their impact on our city.\nTake our survey to share your ideas.\nUpcoming events\nDiscover the exciting events happening in London.\nHead to the Royal Docks this summer for an unmissable programme of arts and culture, waterside activities and family-friendly events.\nHosted by the Mayor of London, livestream the ceremony and learn about the upcoming Memorial to Victims of Transatlantic Slavery.\nThe Notting Hill Carnival, Europe's biggest street festival is organised by Notting Hill Carnival Limited and supported by the Mayor of London.\nSpotlight on\nLoved and Wanted is a new campaign from the Mayor of London that reaffirms to Londoners that no matter who you are or where you’re from - you are loved and wanted in our city.\nLondon is getting a memorial to victims of transatlantic slavery. See the chosen artwork.\nFind out how you can help those affected by the ongoing situation in the Middle East.\nMale violence against women and girls starts with words. Learn how to respond when our friends behave inappropriately."
    },
    {
      "url": "https://www.bbc.co.uk/news/articles/cy8kdv3k027o",
      "text": "'Unsung heroes' saved homes from grass fire\n- Published\nPeople would have probably lost their homes in Monday's grass fire in Dagenham, east London, were it not for the actions of maintenance workers, according to the council leader.\nThe fire broke out behind Clemence Road, which backs on to Beam Parklands, at about 18:30 BST on Monday. The blaze, which covered about eight hectares (20 acres), was tackled by more than 120 firefighters.\nBarking and Dagenham Council leader Dominic Twomey said the fire would have spread to homes if maintenance workers - who he described as \"unsung heroes\" - had not cut fire breaks into the grass over recent weeks.\nLondon saw four wildfires break out over a 24-hour period from Monday into Tuesday.\nTwomey said: \"They very fact that our team – our front-line maintenance team – worked incredibly hard over the last months to put in the fire breaks that were acknowledged by the London Fire Brigade and others that stopped these fires spreading to residents' homes, I think it has to be acknowledged that they are often the unsung heroes.\n\"People won't see that, people won't understand that.\"\nThe council leader said the team's actions were not \"by chance\" but planned out months in advance and carried out regularly.\n\"They're effective. Without it a number of residents would have probably lost their homes and belongings,\" he told a council meeting on Tuesday.\nLondon Fire Brigade borough commander Blake Betts also said the fire breaks had prevented the blaze from spreading further.\nHe told the BBC: \"In this instance they've worked really effectively to stop the spread, or control the spread to one particular area.\"\nListen to the best of BBC Radio London on Sounds and follow BBC London on Facebook, external, X, external and Instagram, external. Send your story ideas to hello.bbclondon@bbc.co.uk, external\n- Published15 July\n- Published14 July"
    }
  ],
  "argos_summary": "Seville, known for its extreme heat, has implemented various measures to cope with rising temperatures, including creating shaded areas and promoting a culture of siestas. The city has also begun naming heatwaves, with 'Heatwave Zoe' being the first, aiming to raise awareness about the dangers of extreme heat. In contrast, London is developing a Heat Risk Delivery Plan to prepare for similar challenges, as it faced its busiest fire service day since World War II during a recent heatwave, highlighting the increasing risks of wildfires and the need for better adaptation strategies.",
  "argos_id": "UIR5PMH94"
}