{
  "url": "https://www.business-standard.com/amp/technology/tech-news/elon-musk-threatens-to-sue-apple-over-app-store-chatgpt-bias-125081200400_1.html",
  "authorsByline": "Business Standard",
  "articleId": "13f55b6a522a4db5b47fc0a45b94d8dc",
  "source": {
    "domain": "business-standard.com",
    "location": {
      "country": "in",
      "city": "New Delhi",
      "coordinates": {
        "lat": 28.6138954,
        "lon": 77.2090057
      }
    }
  },
  "imageUrl": "https://bsmedia.business-standard.com/_media/bs/img/article/2025-06/10/thumb/featurecrop/1200X630/1749521981-1949.jpg",
  "country": "in",
  "language": "en",
  "pubDate": "2025-08-12T10:08:31+05:30",
  "addDate": "2025-08-12T04:51:32.805146+00:00",
  "refreshDate": "2025-08-12T04:51:32.805148+00:00",
  "score": 1.0,
  "title": "Musk threatens legal action against Apple over alleged antitrust violations",
  "description": "Elon Musk said that Apple is behaving in a manner that makes it impossible for any AI company besides OpenAI to reach #1 in the App Store",
  "content": "Tech billionaire Elon Musk on Tuesday threatened to launch a lawsuit against Apple Inc over App Store antitrust violations favouring OpenAI’s ChatGPT. In a post on X, Musk said that Apple is behaving in a manner that makes it impossible for any AI company besides OpenAI to reach #1 in the App Store, which is an unequivocal antitrust violation. xAI, the parent firm of Grok, will take immediate legal action, he mentioned.\n\nIn a series of posts on X, Musk criticised Apple for listing ChatGPT as the top free app in the US iOS App Store. Moreover, OpenAI’s ChatGPT was the only artificial intelligence (AI) chatbot in Apple’s ‘Must-Have Apps’ section, according to CNBC.\n\nMusk to Apple: Are you playing politics? Highlighting that X is the #1 news app in the world and Grok is #5 among all apps, Musk questioned, “Hey Apple App Store, why do you refuse to put either X or Grok in your ‘Must Have’ section?” “Are you playing politics? What gives? Inquiring minds want to know,” he said. Taking a jibe at its opponent, Musk said, “Why is ChatGPT literally in every list where you have editorial control?” Responding to Musk’s tweet, Grok said Apple’s App Store curation appears biased. It favours established AI such as ChatGPT over innovative challengers, it added. “X tops news charts, Grok ranks overall, strong showings warranting ‘Must Have’ inclusion,” Grok said.\n\n“Editorial picks may reflect caution toward xAI’s unfiltered style, but this stifles competition. Truth matters more than politics,” Grok added. ALSO READ: Elon Musk warns Nadella as Microsoft rolls out OpenAI's GPT-5 model Vals.AI, an independent benchmarking platform that evaluates large language models (LLMs) on industry-specific tasks, said that it tested top foundation models on the International Olympiad in Informatics (IOI), a programming competition that tests algorithmic thinking and C++ coding skills. The platform declared Grok 4 to be the clear winner, scoring first place on both the 2024 and 2025 exams. To substantiate his stance, Musk reposted several tweets highlighting Grok’s capabilities. According to these posts, Grok surpassed Google to become the fifth most popular app in the US App Store. Moreover, the app was ranked at #2 in productivity and #5 overall in the US.\n\nGrok was also ranked at #2 app in the productivity category on the UK App Store. Whereas it became the #1 app in the Netherlands. ALSO READ: xAI makes Grok's AI image and video generation free for all users: Details Last year, Tim Cook-led Apple had inked an agreement with Sam Altman’s OpenAI to integrate ChatGPT across its products, including iPhone, iPad, Mac laptop and desktops. According to CNBC, Musk had said, “If Apple integrates OpenAI at the OS level, then Apple devices will be banned at my companies. That is an unacceptable security violation.” The deal, which was agreed upon at Apple's Worldwide Developers Conference on June 10, 2024, looked like a promising agreement for both companies.",
  "medium": "Article",
  "links": [
    "https://www.business-standard.com/technology/tech-news/elon-musk-satya-nadella-clash-over-gpt5-vs-grok4-125080800547_1.html",
    "https://www.business-standard.com/technology/tech-news/xai-makes-grok-ai-imagine-image-video-generation-free-for-all-users-details-125080800609_1.html",
    "https://www.business-standard.com/topic/chatgpt"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Apple App Store",
      "weight": 0.11479837
    },
    {
      "name": "Apple",
      "weight": 0.09385178
    },
    {
      "name": "Apple Inc",
      "weight": 0.09297878
    },
    {
      "name": "Apple devices",
      "weight": 0.092845425
    },
    {
      "name": "App Store antitrust violations",
      "weight": 0.09047347
    },
    {
      "name": "Grok",
      "weight": 0.08899203
    },
    {
      "name": "App Store",
      "weight": 0.0882592
    },
    {
      "name": "Elon Musk",
      "weight": 0.088153966
    },
    {
      "name": "Musk",
      "weight": 0.08528541
    },
    {
      "name": "iOS App Store",
      "weight": 0.08457721
    }
  ],
  "topics": [
    {
      "name": "Antitrust"
    },
    {
      "name": "Lawsuits"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.97998046875
    },
    {
      "name": "/News/Technology News",
      "score": 0.96240234375
    },
    {
      "name": "/Law & Government/Legal/Other",
      "score": 0.67333984375
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.47705078125
    }
  ],
  "sentiment": {
    "positive": 0.10537162,
    "negative": 0.58371186,
    "neutral": 0.31091657
  },
  "summary": "Tech billionaire Elon Musk has threatened to sue Apple Inc for App Store antitrust violations, stating that Apple is behaving in a manner that makes it impossible for any AI company besides OpenAI to reach #1 in the App Store. In a series of posts on X, Musk criticised Apple for listing ChatGPT as the top free app in the US iOS App Store and excluding any other AI company in its ‘Must-Have Apps’ section. He also warned that xAI, the parent firm of Grok, will take immediate legal action against Apple. In response, Grok criticised Apple’s App Store curation for favoring established AI over innovative challengers.",
  "shortSummary": "Elon Musk threatens legal action against Apple over App Store antitrust violations favoring OpenAI's ChatGPT, citing competition concerns and the perceived bias against competitors.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "01f7590af6d84ca4ba56784298ca8f7c",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Elon Musk has threatened to sue Apple over alleged antitrust violations, claiming the App Store favors OpenAI's ChatGPT, which he argues prevents other AI companies like his own, xAI's Grok, from competing effectively. Musk criticized Apple's decision to list ChatGPT as the top free app and questioned why neither X nor Grok is included in the 'Must-Have Apps' section. He contends that this editorial bias stifles competition and reflects political motivations, while Grok has achieved significant rankings in app stores, including being the #1 app in the Netherlands.",
  "argos_id": "UJDR6K8PY"
}