{
  "url": "https://www.bbc.com/news/articles/cpv007xnw83o",
  "authorsByline": "BBC News",
  "articleId": "92083dc575b348c68183b8f34e739c1c",
  "source": {
    "domain": "bbc.com",
    "paywall": false,
    "location": {
      "country": "gb",
      "state": "",
      "county": "",
      "city": "London",
      "coordinates": {
        "lat": 51.5073219,
        "lon": -0.1276474
      }
    }
  },
  "imageUrl": "https://ichef.bbci.co.uk/news/1024/branded_news/4a53/live/a9403e10-76a0-11f0-a975-cb151ca452f4.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T05:08:32.673000+00:00",
  "addDate": "2025-08-12T05:32:57.817144+00:00",
  "refreshDate": "2025-08-12T05:32:57.817146+00:00",
  "score": 1.0,
  "title": "Blackpool mum 'proud' to join suicide baton relay in hometown",
  "description": "Samantha Southern says she's honoured to bring the Baton of Hope to Blackpool for the first time.",
  "content": "A mother-of-six who was \"blindsided\" when her husband took his own life has said she is \"honoured and extremely proud\" to take part in the Baton of Hope tour when it starts in Blackpool. Organised by the suicide prevention charity, bereaved families are preparing to carry the baton through 20 locations in the UK again in a bid to challenge stigma and campaign for practical change. Samantha Southern is taking part for the second time along with her sister Charlotte Dawson, in remembrance of her husband Glen who took his own life in 2020. Ms Southern who works for Blackpool's Empowerment Charity said she was \"honoured and extremely proud\" to bring the baton to the resort for the first time.\n\nThe baton is carried like an Olympic torch, passed from person to person, being held by 100 local people who each have a direct connection to suicide. Baton-bearers will walk through Blackpool, Fylde and Wyre. They will pass local services that can offer support for mental and physical health. They will then tour the country, including visiting Leeds, London, Bournemouth and Jersey.\n\nMs Southern said: \"When suicide swept into my life, it completely blindsided me. \"It detonated like an atomic bomb, leaving me and our six distraught children in the depths of despair. \"I felt the loneliest I have ever been, even with so many people around me. I never wanted another family or person to feel that alone. \"Carrying the Baton in 2023 was an incredible day. For the first time in a long time, I felt like I belonged and that's why I knew we had to bring the Baton to the Fylde Coast.\" Also taking part in the Blackpool route is May Cunningham from Bispham who will be walking for her daughter Melissa who was 30 years old when she took her own life in August 2024. She said she was \"so honoured that her brother and I are going to be side by side to help publicise this huge silent killer that is devastating to millions of people\".\n\nKaren Strong is a local suicide survivor who said she applied to walk in the Baton of Hope \"as living proof of hope after coming back from the absolute depths of despair and here I am living life, loving life, volunteering, having fun, enjoying my family and my first grandchild.\" She added: \"I want to carry it for me because I am proud of how far I have come from how low I was, and I want to carry it for other people to give them hope that it doesn't matter how dark and bleak life can be, you can come back from it and start living again.\" Nurses Claire Hickson and Vicki Lang, from the SWAN End of Life Bereavement Service, based at Blackpool Victoria Hospital, are also involved and said it \"means a lot\" to be asked to take part. \"Anything that reduces the stigma, raises awareness, gets people talking about their feelings and also highlights what support is available for people, can only be a good thing,\" Ms Hickson said.",
  "medium": "Article",
  "links": [
    "https://www.facebook.com/BBCLancashire/",
    "https://www.instagram.com/bbclancashire",
    "https://www.bbc.co.uk/iplayer/episodes/b006pfjx/north-west-tonight",
    "https://www.bbc.co.uk/sounds/curation/p0cjdttt",
    "https://www.bbc.co.uk/news/articles/cwyr9dzell1o",
    "https://www.bbc.co.uk/news/uk-england-beds-bucks-herts-66090693",
    "https://www.bbc.com/news/topics/cg1l7x8pnxmt",
    "https://www.bbc.co.uk/news/articles/cdxljjy28gpo",
    "https://www.bbc.co.uk/programmes/articles/4WLs5NlwrySXJR2n8Snszdg/information-and-support-suicide-feelings-of-despair",
    "https://www.bbc.com/news/topics/cllmr0pkx9nt",
    "https://twitter.com/bbclancashire"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "suicide baton relay",
      "weight": 0.08120014
    },
    {
      "name": "other people",
      "weight": 0.07562907
    },
    {
      "name": "people",
      "weight": 0.07269241
    },
    {
      "name": "Blackpool Victoria Hospital",
      "weight": 0.07243739
    },
    {
      "name": "Blackpool mum",
      "weight": 0.06957172
    },
    {
      "name": "life",
      "weight": 0.068268165
    },
    {
      "name": "Blackpool",
      "weight": 0.06808496
    },
    {
      "name": "suicide",
      "weight": 0.06470514
    },
    {
      "name": "Ms Southern",
      "weight": 0.0591365
    },
    {
      "name": "bereaved families",
      "weight": 0.058762282
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Health"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Local News",
      "score": 0.9931640625
    },
    {
      "name": "/Sensitive Subjects/Death & Tragedy",
      "score": 0.845703125
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Charity & Philanthropy",
      "score": 0.84326171875
    },
    {
      "name": "/News/Other",
      "score": 0.72900390625
    }
  ],
  "sentiment": {
    "positive": 0.16529994,
    "negative": 0.44431385,
    "neutral": 0.39038625
  },
  "summary": "The Baton of Hope tour, organised by the suicide prevention charity, will begin in Blackpool, where bereaved families will carry the baton through 20 locations in the UK in a bid to challenge stigma and campaign for practical change. Samantha Southern, a mother-of-six who was \"blindsided\" when her husband Glen took his own life, is participating in the second time, in memory of her husband's death in 2020. The baton is carried like an Olympic torch, passed from person to person by 100 local people who each have a direct connection to suicide. They will pass local services that can offer support for mental and physical health before touring the country, including Leeds, London, Bournemouth, and Jersey. The Baton will also be carried by May Cunningham from Bispham for her daughter Melissa who took her own life in 2024.",
  "shortSummary": "A Blackpool mother-of-six will join the Baton of Hope tour, which aims to raise awareness and support for suicide victims across the UK.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "c40840b036d0438bac4907a79bbc910e",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.bbc.co.uk/news/articles/cdxljjy28gpo",
      "text": "Suicide prevention tour to return for second year\n- Published\nA symbolic baton representing mental wellbeing will visit a range of communities as part of a special tour promoting suicide prevention.\nThe event will see bereaved families and suicide survivors carry the Baton of Hope through 20 locations in the UK in a bid to challenge stigma and campaign for practical change.\nOrganised by the Baton of Hope suicide prevention charity, the tour will begin in Blackpool on 1 September 2025 before visiting Cumbria on 7 September and Tameside on 12 September.\nThe charity said Blackpool was chosen because the town's suicide rate was significantly higher than the overall rate in England, according to the latest data from the Samaritans.\nIt will visit 20 locations, external in total, including Leeds, London, Bournemouth and Jersey.\nBaton of Hope was set up by two fathers.\nMike McCarthy, from Sheffield, lost his son Ross in 2021 and Steve Phillip, from Harrogate, lost Jordan in 2019.\nThey came up with the idea of a silver baton which would be carried, like an Olympic torch, by families and friends of people who have taken their lives.\nIt first toured the country in 2023, when it was carried through 12 cities in 12 days, finishing at 10 Downing Street.\nEllie Scott, who carried the symbol as part of the 2023 tour, said it was \"an incredibly powerful moment\" in her life.\n\"Experiencing a loss through suicide is a different kind of grief and at times I have felt very lonely,\" she said.\n\"From the moment the baton was handed over to me, I felt safe, I felt surrounded by love and for the first time, surrounded entirely by people who just get it.\n\"I will always be thankful to Baton of Hope for giving everyone this symbol to remind us, that we are not alone.\"\nListen to the best of BBC Radio Lancashire on Sounds and follow BBC Lancashire on Facebook, external, X, external and Instagram, external. You can also send story ideas to northwest.newsonline@bbc.co.uk, external\nRelated topics\nRelated internet links\n- Published2 July 2023\n- Published4 July 2023\n- Published9 June 2023"
    },
    {
      "url": "https://www.bbc.co.uk/programmes/articles/4WLs5NlwrySXJR2n8Snszdg/information-and-support-suicide-feelings-of-despair",
      "text": "Information and Support: Suicide / Feelings of despair\nIf you or someone you know are having feelings of despair or emotionally distressed, the following organisations offer advice and support.\nSamaritans\nSamaritans is available for anyone struggling to cope and provides a safe place to talk 24 hours a day.\nPhone: 116 123\nSuicide Prevention UK\nSuicide Prevention UK helps anyone who may be struggling with their mental health and/or thoughts of suicide via the National Suicide Prevention Helpline UK.\nPhone: 0800 587 0800\nVisit the Suicide Prevention UK website\nSOS Silence of Suicide\nSOS Silence of Suicide provides a listening service for children and adults who need emotional support, understanding, compassion & kindness.\nPhone: 0808 115 1505\nShout\nShout is a 24/7 text service, free on all major mobile networks, for anyone struggling to cope and in need of immediate help.\nText SHOUT to 85258\nPAPYRUS HOPELINE247\nPAPYRUS HOPELINE247 offer support, practical advice and information to young people considering suicide and can also offer help and advice if you’re concerned about someone you know.\nPhone: 0800 068 41 41 (24/7)\nCALM\nCALM, the campaign against living miserably is a suicide prevention charity that offers free, anonymous and confidential support via their helpline and webchat for anyone who is in crisis.\nPhone: 0800 58 58 58\nVisit the CALM website\nLifeline\nLifeline provides support to people suffering distress or despair in Northern Ireland, regardless of age or district.\nPhone: 0808 808 8000 (24/7)\nCommunity Advice & Listening Line\nCommunity Advice & Listening Line offers emotional support and information on mental health and related matters to people in Wales.\nPhone: 0800 132 737 (24/7) or text \"help\" to 81066\nBreathing Space\nBreathing Space offers a confidential phone and web based service for people in Scotland experiencing low mood, depression or anxiety.\nPhone: 0800 83 85 87\nA BSL service is also available via the website.\nSurvivors of Bereavement by Suicide\nSurvivors of Bereavement by Suicide exists to meet the needs and break the isolation of those bereaved by the suicide of a close relative or friend.\nPhone: 0300 111 5065\nSuicide&Co\nSuicide&Co provides support to bereaved individuals and opens the conversation around suicide-related grief.\nPhone: 0800 054 8400\nRelated Information and Support\nIf you have also been affected by bereavement, or self-harm, organisations listed on our Bereavement support page or Self Harm support page may be able to help.\nYou can find current information and support for issues covered by Action Line on the BBC Action Line website."
    },
    {
      "url": "https://www.bbc.co.uk/news/articles/cwyr9dzell1o",
      "text": "'Suicide prevention baton made me feel less alone'\n- Published\nA woman who lost her husband to suicide has said carrying a symbolic baton representing mental wellbeing helped her to feel less isolated.\nSamantha Southern, from Blackpool, who took part in the Baton of Hope tour in 2023, said it was the first time in years she had not felt alone and the event had brought her \"connection\".\nOrganised by the suicide prevention charity, bereaved families are preparing to carry the baton through 20 locations in the UK again in a bid to challenge stigma and campaign for practical change.\nThe 2025 tour begins in Blackpool in September.\nThe baton is carried like an Olympic torch, passed from person to person, being held by 100 local people who each have a direct connection to suicide.\nBaton-bearers will walk through Blackpool, Fylde and Wyre. They will pass local services that can offer support for mental and physical health.\nThey will then tour the country, including visiting Leeds, London, Bournemouth and Jersey.\nMike McCarthy, co-founder of The Baton Of Hope, said: \"The idea is that people who have been bereaved by suicide or survived a suicide attempt find some comfort by being involved.\"\nSuicide is the biggest killer of men under the age of 50 in the UK, according to the Samaritans.\nMr McCarthy said he believed a change in strategy was needed.\n\"Suicide is preventable, he said. \"Whatever we have been doing over the last twenty years hasn't worked.\"\nHe said he was motivated to start the charity after his son Ross took his own life.\n\"He wrote a long goodbye letter and one of the things that he said in that letter was please fight for mental health, the support is just not there,\" he said.\n\"If he could look down and see what we are trying to do in his name, and the name of all of the people we have lost to suicide, I'm sure he would think 'I'm proud of what you are trying to do'.\"\nThe campaign is being supported by the Blackpool-based Empowerment Charity, external, where Ms Southern is the Solace Suicide Prevention and Bereavement Manager.\nHer husband Glen died in 2020 and she walked with the baton during the Baton of Hope tour in 2023.\n\"It was the first time in two-to-three years that I hadn't felt as alone,\" she said.\n\"Being with a community of people who just understood and got me. I think it brings connection.\"\nBlackpool Councillor Jo Farrell, said: \"It is an honour for Blackpool to host the launch of the Baton of Hope 2025 tour.\n\"This powerful movement shines a vital light on suicide awareness and reminds us that behind every statistic is a real person.\"\nThe 2025 tour sets off from the Village Hotel in Blackpool on Monday 1 September at 08.00 BST.\nIf you have been affected by any of the issues raised in this story you can visit BBC Action Line.\nGet in touch\nTell us which stories we should cover in Lancashire\nListen to the best of BBC Radio Lancashire on Sounds and follow BBC Lancashire on Facebook, external, X, external and Instagram, external. You can also send story ideas via Whatsapp to 0808 100 2230.\nRelated topics\n- Published29 August 2024\n- Published2 July 2023\n- Published4 July 2023"
    },
    {
      "url": "https://www.bbc.com/news/topics/cg1l7x8pnxmt",
      "text": "Suicide prevention1 hr agoMum 'proud' to join hometown suicide baton relaySamantha Southern says she's honoured to bring the Baton of Hope to Blackpool for the first time.1 hr ago2 hrs agoCharity runners raise £4k in memory of woman, 31Her husband, who organised the 10k charity race, says: \"I just wish she was here.\"2 hrs ago3 days agoSuicide memorial quilt stitched together for eventThe Kent Speak Their Name artwork will be displayed at an event in Margate in September. 3 days ago6 days agoA mental wellbeing support group for men gave Tom his life backA mental wellbeing and suicide prevention support group for men, gave Tom his life back6 days ago8 days ago10 marathons in 10 days success raises £10kJoe Wild completes the challenge in memory of friend Dan McAllister, who took his own life in 2015.8 days ago25 Jul 2025Joe's 10 marathons in 10 days for friend's memoryJoe Wild will takes on 10 marathons in 10 days in memory of best pal who took his own life in 2015.25 Jul 202525 Jul 2025Samaritans to close more than 100 branchesThe charity's chief executive says \"at least half\" of their branches will close in the UK and Ireland.25 Jul 202522 Jul 2025BGT dancers to perform after Baton of Hope tour legKent 40+ dance group Midlife Movers got four \"yes\" votes in their Britain's Got Talent audition.22 Jul 202515 Jul 2025Dads win battle for suicide prevention lessonsThe government says lessons on dealing with suicidal thoughts will be compulsory in schools.15 Jul 2025..."
    },
    {
      "url": "https://www.bbc.co.uk/news/uk-england-beds-bucks-herts-66090693",
      "text": "Milton Keynes: Baton of Hope relay aims to inspire 'open conversations'\n- Published\nA city is set to host the latest stop of a baton relay hoping to enable \"open conversations about mental health\".\nThe Baton of Hope relay began a 12-city route on 25 June and ends at 10 Downing Street on 6 July.\nIt will tour Milton Keynes from 08:30 BST on Tuesday, starting at Campbell Park and finishing at about 17:30.\nNick Wilson, from Towcester, Northamptonshire, who is among those who will carry the baton, said \"greater support\" was needed to reduce suicides.\nMr Wilson, a disabled British Army veteran and mental health campaigner, will deliver the baton to Red Bull Racing's headquarters.\nHe said: \"It [experiencing suicidal thoughts] is an incredibly confusing, sorry and lonely place to be.\"\nStatistics reveal,, external external suicide is the leading cause of death for people under 35 in the UK.\nTuesday's events, organised by Milton Keynes Council, will see the baton pass through locations including Furzton Lake and Stadium MK before finishing at the city's Peace Pagoda.\nCouncillor Jane Carr, said: \"We want to share the message that nobody should be afraid to talk about how they feel.\n\"This event is about breaking down barriers and having open conversations about mental health.\"\nA Baton of Hope representative said it was \"designed to be the biggest suicide awareness and prevention initiative the UK has ever seen\".\nThey said it was about \"opening up necessary conversations and prompting appropriate actions\".\nFollow East of England news on Facebook, external, Instagram, external and Twitter, external. Got a story? Email eastofenglandnews@bbc.co.uk, external or WhatsApp us on 0800 169 1830\nRelated topics\n- Published2 July 2023\n- Published28 June 2023\n- Published7 June 2023\n- Published2 February 2023"
    },
    {
      "url": "https://www.bbc.com/news/topics/cllmr0pkx9nt",
      "text": "Blackpool1 hr agoMum 'proud' to join hometown suicide baton relaySamantha Southern says she's honoured to bring the Baton of Hope to Blackpool for the first time.1 hr ago2 days agoThousands attend Blackpool Air Show flypastsVintage aircraft featured in a Battle of Britain memorial alongside displays by a wing-walking team.2 days ago2 days agoArrest after two badly hurt in crash near car meetAn 18-year-old has been arrested on suspicion of causing serious injury by dangerous driving, say police.2 days ago3 days agoBlackpool Air Show 2025: All you need to knowBlackpool Air Show returns, featuring the Red Arrows, wingwalkers and more.3 days ago4 days agoWhere to spot the Red Arrows this weekendThe famous jets will fly across the region as they swoop in and out of Blackpool Air Show.4 days ago4 days agoHotel plan for 'landmark' Art Deco bar approvedThe former Yates pub on Blackpool Promenade is set to be converted into an 18-bedroom hotel with bars.4 days ago5 days agoBlackpool sign Forest's Taylor on four-year dealBlackpool sign forward Dale Taylor from Premier League side Nottingham Forest on a four-year deal with the option of a further year.5 days ago6 days agoTalking parrot helps bring down drugs gangRaids in Blackpool uncovered the bird which had been taught to say phrases used by drug dealers.6 days ago6 days agoSpectators warned not to feed gulls during air showOfficials say food can attract gulls and raise the risk of a bird strike during Blackpool Air Show.6 days ago..."
    },
    {
      "url": "https://www.bbc.co.uk/iplayer/episodes/b006pfjx/north-west-tonight",
      "text": "Homepage\nAccessibility links\nSkip to content\nAccessibility Help\nBBC Account\nNotifications\nHome\nNews\nSport\nWeather\niPlayer\nSounds\nBitesize\nCBeebies\nCBBC\nFood\nHome\nNews\nSport\nBusiness\nInnovation\nCulture\nTravel\nEarth\nVideo\nLive\nMore menu\nSearch iPlayer\nHome\nNews\nSport\nWeather\niPlayer\nSounds\nBitesize\nCBeebies\nCBBC\nFood\nHome\nNews\nSport\nBusiness\nInnovation\nCulture\nTravel\nEarth\nVideo\nLive\nClose menu\niPlayer Navigation\niPlayer Accessibility Help\nMenu\nChannels\n;\n;\nChannels Sub Navigation\nScroll Channels Sub Navigation left\nBBC One\nBBC Two\nBBC Three\nBBC Four\nBBC Radio 1\nCBBC\nCBeebies\nBBC Scotland\nBBC News\nBBC Parliament\nBBC Alba\nS4C\nScroll Channels Sub Navigation right\nCategories\nCategories\nCategory Sub Navigation\nScroll Category Sub Navigation left\nDrama & Soaps\nFilms\nComedy\nDocumentaries\nSport\nNews\nEntertainment\nMusic\nFood\nLifestyle\nHistory\nScience & Nature\nArts\nFrom the Archive\nAudio Described\nSigned\nNorthern Ireland\nScotland\nWales\nCBeebies\nCBBC\nScroll Category Sub Navigation right\nDrama & Soaps\nFilms\nComedy\nDocumentaries\nSport\nNews\nEntertainment\nMusic\nFood\nLifestyle\nHistory\nScience & Nature\nArts\nFrom the Archive\nAccessible alternative formats\nAudio Described\nSigned\nRegions\nNorthern Ireland\nScotland\nWales\nChildren’s\nCBeebies\nCBBC\nA-Z\nTV Guide\nWatchlist\nNews\nNorth West Tonight\nThe regional news programme for the north west of England\nEvening News: 11/08/2025 (28 mins)\nStart watching\nSeries Navigation\nScroll Series Navigation left\nEpisodes\nScroll Series Navigation right\nEvening News: 11/08/2025\nThe latest news, sport and weather for the North West of England.\n28 mins\nLate News: 11/08/2025\nThe latest news, sport and weather for the North West of England.\n7 mins"
    }
  ],
  "argos_summary": "Samantha Southern, a mother-of-six whose husband took his own life, expressed her pride in participating in the Baton of Hope tour, which aims to raise awareness about suicide and challenge stigma. The tour, organized by a suicide prevention charity, will visit 20 locations across the UK, starting in Blackpool, where local families and survivors will carry the baton to symbolize hope and connection. Southern emphasized the importance of community support in overcoming feelings of isolation after losing a loved one to suicide.",
  "argos_id": "UZB9GGPJI"
}