{
  "url": "https://www.forbes.com/sites/maryroeloffs/2025/08/11/harry-and-meghan-sign-new-netflix-deal-after-all-but-for-less-than-previous-mega-deal/",
  "authorsByline": "Mary Whitfill Roeloffs",
  "articleId": "fe0d07a1f8ae4325b7379635f12cfe0b",
  "source": {
    "domain": "forbes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NJ",
      "county": "Hudson County",
      "city": "Jersey City",
      "coordinates": {
        "lat": 40.7215682,
        "lon": -74.047455
      }
    }
  },
  "imageUrl": "https://imageio.forbes.com/specials-images/imageserve/689a146b0cde330d1c5fe18c/0x0.jpg?format=jpg&crop=2396,1348,x140,y180,safe&height=900&width=1600&fit=bounds",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T16:31:07+00:00",
  "addDate": "2025-08-11T19:40:57.723507+00:00",
  "refreshDate": "2025-08-11T19:40:57.723508+00:00",
  "score": 1.0,
  "title": "Netflix Re-Signs Prince Harry and Meghan Markle—But For Less Than Original Deal",
  "description": "The new deal is worth less than the initial $100 million agreement between the streamer and Archewell Productions.",
  "content": "Netflix on Monday announced it renewed its creative partnership with Harry and Meghan (after reports the relationship was ending) with a multi-year, first-look deal that will give the streamer the right of first refusal for all Archewell film and television projects The new deal is structured differently than the $100 million, five-year agreement struck in 2020 in which Netflix paid Herry and Meghan for the exclusive rights to all Archewell content. Under the new agreement, which the New York Times reported is worth less, Netflix has the first option to stream Archewell content. The new deal comes with less commitment from Netflix and reflects the streamer’s move away from all-encompassing agreements (a deal with Barack and Michelle Obama's production company Higher Ground that was similar to the initial exclusivity arrangement with Archewell transitioned into a first-look deal last year). Netflix also invested in As Ever, the lifestyle brand Markle launched with the streamer last year that sells products like jam, wine and baking mixes, producing some of the products through its consumer product group and sharing in the revenue, according to the Times.\n\nGet Forbes Breaking News Text Alerts: We’re launching text message alerts so you'll always know the biggest stories shaping the day’s headlines. Text “Alerts” to (201) 335-0739 or sign up here: joinsubtext.com/forbes.\n\nWhat’s To Come From Harry And Meghan’s New Netflix Deal?\n\nIn addition to a second season of \"With Love, Meghan,\" which has already been made and will debut later this month, Netflix announced it will produce a special holiday episode at the couple's California home called \"With Love, Meghan: Holiday Celebration.\" The deal also includes a film adaptation of bestselling novel \"Meet Me at the Lake\" and includes a documentary short about an orphanage in Uganda, famous for its viral videos, called \"Masaka Kids, A Rhythm Within.\" Archewell Productions is also in “active development” on additional projects with Netflix and As Ever will expand into new product categories later this year, the streamer said.\n\nWhat Have Harry And Meghan Already Made At Netflix?\n\nWhen its first deal was announced, Archewell and Netflix said they would make “inspirational family programming” including documentaries, docuseries, feature films, scripted shows and children’s television, but it made just five projects in the last five years and none were children’s TV, feature films or scripted shows. The explosive 2022 “Harry & Meghan” docuseries was by far the most successful to come out of the deal and still holds the record for the most viewing time of any Netflix documentary in its debut week. It’s still drawing interest and was watched another 7.3 million hours in the first half of 2025. The deal also produced “Heart of Invictus,” a documentary following athletes participating in the Prince Harry-founded sporting event for wounded veterans; “Live to Lead,” a docuseries on impactful world leaders, \"Polo\" about the professional sport; and the lifestyle series “With Love, Meghan.” “With Love” spent one week on Netflix’s global top 10 list, at No. 10, with 12.6 million hours viewed in its first week.\n\nWhat Is As Ever?\n\nMarkle launched a brand called American Riviera Orchard via Instagram on March 14, 2024 with a short video that showed the duchess arranging flowers, baking and standing in a stone walkway wearing a floor-length gown. Company registration documents revealed plans to create an online retail store selling tableware, cutlery, cookbooks, stationary, party decorations and other similar items, but no products were ever sold under the name. A trademark request for the brand was rejected and there were several reports no CEO had been found to run the business. In February, she partnered with Netflix and re-branded the company to be called \"As Ever.” A handful of products were released, including two jams, three teas and honey, all of which sold out almost immediately. Since then, As Ever has released a Napa Valley rosé, which is available in a three-bottle pack for $90. The brand was featured in the first season of “With Love, Meghan.”",
  "medium": "Article",
  "links": [
    "https://joinsubtext.com/forbes",
    "https://www.forbes.com/sites/maryroeloffs/2024/03/15/meghan-markle-launches-new-lifestyle-brand-amid-kate-middleton-photo-editing-scandal-heres-what-we-know/",
    "https://www.forbes.com/sites/maryroeloffs/2025/07/23/meghan-and-harry-lose-their-netflix-deal-reports-say-heres-what-happens-to-meghans-show/",
    "https://tel:2013350739/",
    "https://www.forbes.com/sites/carlieporterfield/2023/01/19/how-rich-are-prince-harry-and-meghan-markle-heres-what-we-know-about-the-power-couples-135-million-deals/?sh=43554faf3d86",
    "https://people.com/meghan-markle-netflix-show-ratings-are-in-where-fell-top-10-11695633",
    "https://www.forbes.com/sites/maryroeloffs/2023/08/07/prince-harry-and-meghan-markle-buy-rights-to-bestseller-meet-me-at-the-lake-for-netflix/",
    "https://asever.com/",
    "https://www.forbes.com/sites/alisondurkee/2023/06/16/spotify-ends-podcasting-deal-with-prince-harry-and-meghan-markle/?sh=440b1e44173b",
    "https://www.forbes.com/sites/tylerroush/2025/02/18/meghan-markle-renames-lifestyle-brand-heres-what-we-know-about-as-ever/",
    "https://www.nytimes.com/2025/08/11/business/media/netflix-prince-harry-meghan-markle-deal.html"
  ],
  "labels": [
    {
      "name": "Pop Culture"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Netflix",
      "weight": 0.079390235
    },
    {
      "name": "Meghan Markle",
      "weight": 0.074238725
    },
    {
      "name": "Meghan",
      "weight": 0.06866463
    },
    {
      "name": "Original Deal",
      "weight": 0.06569272
    },
    {
      "name": "new product categories",
      "weight": 0.06517122
    },
    {
      "name": "first refusal",
      "weight": 0.062740766
    },
    {
      "name": "first",
      "weight": 0.061236504
    },
    {
      "name": "Prince Harry",
      "weight": 0.06079264
    },
    {
      "name": "last year",
      "weight": 0.05895989
    },
    {
      "name": "As Ever",
      "weight": 0.056173332
    }
  ],
  "topics": [
    {
      "name": "Royal Family"
    }
  ],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.9912109375
    },
    {
      "name": "/Arts & Entertainment/TV & Video/TV Shows & Programs",
      "score": 0.79736328125
    },
    {
      "name": "/News/Gossip & Tabloid News/Other",
      "score": 0.69140625
    },
    {
      "name": "/Arts & Entertainment/TV & Video/Online Video",
      "score": 0.671875
    }
  ],
  "sentiment": {
    "positive": 0.436738,
    "negative": 0.06933858,
    "neutral": 0.4939234
  },
  "summary": "Netflix has renewed its creative partnership with Prince Harry and Meghan Markle with a multi-year, first-look deal that gives Netflix the right of first refusal for all Archewell film and television projects. This deal is structured differently than the $100 million, five-year agreement struck in 2020. The new deal allows Netflix to stream Archewell content and comes with less commitment from the company. In addition, Netflix will produce a special holiday episode at their California home called \"With Love, Meghan: Holiday Celebration.\" The deal also includes a film adaptation of bestselling novel \"Meet Me at the Lake\" and a documentary short about an orphanage in Uganda.",
  "shortSummary": "Netflix has renewed its partnership with Harry and Meghan, granting it priority over all Archewell content, with As Ever a successful brand.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "7a0470d8dec741ff8d68960715bcace4",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.forbes.com/sites/maryroeloffs/2024/03/15/meghan-markle-launches-new-lifestyle-brand-amid-kate-middleton-photo-editing-scandal-heres-what-we-know/",
      "text": "Topline\nCookbooks, servingware, home decor, stationary, yoga gear and pet food could all be coming soon from Meghan Markle’s new lifestyle brand, launched via Instagram Thursday night, amid a photoshopping scandal at Kensington Palace that has all eyes on her sister-in-law Kate Middleton.\nKey Facts\nMarkle announced the creation of a new brand, called American Riviera Orchard, via a nine-post grid on Instagram and a short video that shows the duchess arranging flowers, baking and standing in a covered walkway while wearing a floor-length black ball gown.\nThe logo for the venture seems to be a new crest featuring the letters A and R, which she has been speculated to have been involved in designing, and includes the word “Montecito” under the brand name’s sprawling cursive (Markle has lived in California with her husband, Prince Harry, and two young children, Prince Archie and Princess Lilibet, since 2020).\nWhile the Instagram launch provided little details on the venture (but did score 358,000 followers for the brand overnight), trademark filing applications show Markle's new company could be headed in the direction of those owned by Gwyneth Paltrow, Jessica Alba or HGTV's Chip and Joanna Gaines.\nA filing from February shows the company registered as an LLC in Delaware with plans to create an online retail store selling tableware, cutlery, cookbooks, servingware, coffee and tea services, kitchen textiles, jams and jellies, oils and other foods.\nA second set of documents, filed in March, suggests the brand could also venture into gardening items, lighting, stationary, party decorations, gift wrapping, tote bags, pet gear, kitchen items and home decor like pillows, curtains, linens and picture frames.\nWhether the goods would be manufactured and produced by the American Riviera Orchard brand or simply curated and re-sold under the brand name was not clear in the filings.\nSurprising Fact\nThis isn't Markle's first lifestyle brand. Before she was engaged to Prince Harry in 2017, she ran a lifestyle blog called The Tig on which she interviewed celebrities, talked fashion and revealed personal details of her early life and career as an actress. She closed the site in 2017.\nKey Background\nAfter minor roles in projects like \"Get Him to the Greek\" and \"Horrible Bosses,\" Markle shot to fame in 2011 as a main character in the TV series \"Suits,\" on which she starred until 2017. Shortly after her departure from the show was announced, she was engaged to Prince Harry, the youngest of two sons of Princess Diana and King Charles III. They were married in May 2018 and Markle gave birth to Prince Archie of Sussex in May 2019. In January 2020, the couple announced they would be stepping down as senior royals, citing bullying from the British media, racism within the family and general mistreatment. They moved to California in June 2020. Since their departure, Harry and Markle have launched several business ventures. The couple created a charity organization and an audio and video production company using the name Archewell and signed deals with Netflix and Spotify worth $100 million and $20 million, respectively. “Harry & Meghan,” a multipart docuseries discussing Harry and Markle’s tenure as royals, debuted in 2022. The same year, Netflix reportedly cut a children's show called \"Pearl\" that was created by Meghan Markle and would have been Archewell Productions' first animated series. Last year, the couple's Spotify partnership ended after they reportedly failed to meet “productivity benchmarks\" and Markle in February said her podcast, \"Archetypes,\" will now be made with Lemonada Media.\nTangent\nMarkle’s announcement comes amid a scandal at Kensington Palace that has had all eyes on her former in-laws: Prince William and Princess Kate. Kensington Palace in January announced Kate had been hospitalized for a planned abdominal surgery and would postpone all of her upcoming engagements while she recovered. Before the announcement, the Princess of Wales had not been seen or heard from since Christmas Day. In the months after the surgery, public speculation arose and time went on without a sighting of the princess. On Sunday, Kensington Palace released a photo of Kate and her three children to celebrate Mother’s Day in the United Kingdom. The photo, which was said to have been taken by Prince William, was immediately the subject of ire for seemingly major edits. That same day, agencies like AFP and the Associated Press issued kill notices, asking news agencies to stop circulating the photo because it “appeared the source had manipulated the image.\" The next day, Monday, Kate took the fall for the botched photo and said she occasionally experiments with editing images like “many amateur photographers.” Since then, the global news director of Agence France-Presse, one of the world's biggest news agencies, has said the palace is no longer a \"trusted source\" of information. Middleton was photographed in the backseat of a car leaving Windsor Castle earlier this week. Photo agency Goff Photos has denied doctoring the photo. Kate has not been seen in public since."
    },
    {
      "url": "https://people.com/meghan-markle-netflix-show-ratings-are-in-where-fell-top-10-11695633",
      "text": "The Ratings Are in for Meghan Markle's Netflix Show With Love, Meghan: See Where It Landed The Duchess of Sussex's first solo hosting project for Netflix has clinched a top spot on the charts By Janine Henni Janine Henni Janine Henni is a Royals Staff Writer for PEOPLE Digital, covering modern monarchies and the world's most famous families. Like Queen Elizabeth, she loves horses and a great tiara moment. People Editorial Guidelines Published on March 12, 2025 02:54PM EDT 716 Comments Meghan, Duchess of Sussex on the set of With Love, Meghan. Credit : Courtesy of Netflix Meghan Markle's lifestyle series With Love, Meghan premiered on Netflix last week, and the viewership numbers are in. As of March 12, the Duchess of Sussex's show ranked tenth on Netflix's global Top 10 Shows Overview list. According to the streamer, With Love, Meghan has amassed 2.6 million views and 12.6 million hours watched since its debut on Tuesday, March 4. More specifically, With Love, Meghan ranks seventh on Netflix's Top 10 Shows chart in the United Kingdom and tenth on the platform’s Top 10 list in the United States. Season two of With Love, Meghan has already been filmed and will hit Netflix queues this fall. Michael Steed returned as director for the second season, as the first season of the Duchess of Sussex’s show premiered at number six on Netflix’s U.S. Top 10. Meghan, Duchess of Sussex and Mindy Kaling in episode 102 of With Love, Meghan. Justin Coit/Netflix Meghan Markle's Netflix Series With Love, Meghan Returning for Second Season This Fall (Exclusive) Meghan, 43, is in good company on the charts as her friend and With Love guest Mindy Kaling also has something to celebrate. Kaling's basketball comedy Running Point, starring Kate Hudson, is ranked number one on both the global and U.S. lists. The series premiered on Feb. 27 and imagines Hudson as an overlooked executive who's unexpectedly named president of her family's sports franchise. Kaling, 45, is one of several old friends who stepped in front of the camera with Meghan for the upbeat series, where the Duchess of Sussex shares her personal passions for cooking, creating and entertaining with her biggest audience yet. She also forged new friendships with chef Roy Choi, farm-to-table pioneer Alice Waters and more in the eight-episode show, which PEOPLE exclusively revealed will have a second season. In her most intimate interview in years, Meghan tells PEOPLE in this week's exclusive cover story that it's been a joy to get back into her creative groove. Meghan, Duchess of Sussex photographed in Montecito, California, in March 2024. Meghan Markle's Most Intimate Interview in Years: Harry, the Kids and Getting Real About Her 'Learning Curve' (Exclusive) \"When your children get to a certain age — when you’re not just playing in the sandbox with them but almost playing in your own sandbox again — it’s super joyful,\" the Duchess of Sussex says. \"As a woman, a mom and a wife, to be able to find yourself again — in a way that was always present but that you maybe couldn’t put as much attention on as you now can when your kids are a little bit older — is a wonderful feeling.\" Meghan and Prince Harry are parents to young son Prince Archie, 5 and daughter Princess Lilibet, 3, and she says that her husband has been happy to see her back in her element through producing the Netflix series and launching her lifestyle brand, As ever. “My husband met me when I had The Tig, and I see this spark in his eye when he sees me doing the thing that I was doing when he first met me,” she says, referring to the original lifestyle blog she ran from 2014 to 2017. \"It’s almost like a honeymoon period again,\" she adds, \"because it’s exactly how it was in the beginning when he’d watch me scribbling away, writing newsletters, fine-tuning edits and just really being in the details of it. I think he loves watching as much as I love doing that creative process. It’s just been fun. This is who I’ve always been.\" Prince Harry and Meghan, Duchess of Sussex, on the set of With Love, Meghan. Courtesy of Netflix The Duchess of Sussex served as both host and executive producer for With Love, Meghan, which was filmed in Montecito where she lives with her family. Harry, Archie and Lili visited her on set during filming, where a crew member tells PEOPLE that the Duke of Sussex was so supportive of Meghan's moment. \"Whenever Harry visited set, he was always super polite and friendly, but it was clear he wanted this to be Meghan’s moment to shine,\" the crew member says. Can't get enough of PEOPLE's Royals coverage? Sign up for our free Royals newsletter to get the latest updates on Kate Middleton, Meghan Markle and more! With Love, Meghan is the fifth project from the multiyear deal the Duke and Duchess of Sussex signed with Netflix in 2020 for a reported $100 million. It was produced in part by the couple's Archewell Productions company, which also released the docuseries Harry & Meghan. Part one of the candid series set records as the streamer's biggest documentary debut ever when it premiered in December 2022. Close Leave a Comment Read more: Royals British Royal Family British Royal Family News"
    },
    {
      "url": "https://www.forbes.com/sites/maryroeloffs/2025/07/23/meghan-and-harry-lose-their-netflix-deal-reports-say-heres-what-happens-to-meghans-show/",
      "text": "Topline\nNetflix will reportedly not renew its $100 million contract with Prince Harry And Meghan Markle when it expires in September after making five shows with the couple that debuted on the streaming service to various levels of success since 2020.\nKey Facts\nSources told The Sun and People that no more shows will be made under the deal, which kicked off with the uber-successful release of “Harry & Meghan,” a show about the couple’s departure from royal life, in 2022.\nSources added that the end of the deal doesn’t necessarily mean Netflix will never work with the pair again, and that the streamer is open to a \"one-off project down the line,” according to the publications.\n“With Love, Meghan,” a lifestyle series, is the only still-running show to come out of the deal. A second season has already been filmed and will be released this fall, but the fate of a third is unclear under the deal’s reported cancellation.\n\"With Love, Meghan\" spent one week on Netflix's list of top 10 most-watched shows after its March premiere, in the No. 10 spot, and was ranked No. 389 on a list of Netflix's most watched programs in the first half of 2025 with 25.5 million hours viewed.\nRepresentatives with Netflix and Archewell did not immediately return Forbes’ request for more information.\nGet Forbes Breaking News Text Alerts: We’re launching text message alerts so you'll always know the biggest stories shaping the day’s headlines. Text “Alerts” to (201) 335-0739 or sign up here.\nWhat We Don’t Know\nHow the end of the deal will impact future projects. Netflix did not respond to questions about if “With Love, Meghan” could get a third season, and it’s unclear what will happen to another already announced project: “Meet Me At The Lake.” Harry and Meghan bought the rights to the bestselling novel through their company, Archewell Productions, and it was announced last year they would work with Netflix to bring the story to the small screen.\nKey Background\nPrince Harry and Meghan Markle announced in January 2020 they would be stepping down as senior royals. They moved to California and have since launched several business ventures, including an audio and video production company using the name Archewell. They signed deals with Netflix and Spotify worth $100 million and $20 million, respectively. The Spotify deal ended in 2023 after the couple reportedly failed to meet “productivity benchmarks.\" Markle moved her podcast, \"Archetypes,\" to Lemonada Media, while the couple ultimately made five shows under the Netflix deal. The explosive 2022 “Harry & Meghan” docuseries was by far the most successful and still holds the record for the most viewing time of any Netflix documentary in its debut week. It’s still drawing interest and was watched another 7.3 million hours in the first half of 2025. The deal also produced “Heart of Invictus,” a documentary following athletes participating in the Prince Harry-founded sporting event for wounded veterans; “Live to Lead,” a docuseries on impactful world leaders, \"Polo\" about the professional sport; and “With Love, Meghan.”\nTangent\nAnother of the couple’s business ventures, a lifestyle brand from Markle, has had its share of challenges. Markle launched a brand called American Riviera Orchard via Instagram on March 14, 2024 with a short video that showed the duchess arranging flowers, baking and standing in a stone walkway wearing a floor-length gown. Company registration documents revealed plans to create an online retail store selling tableware, cutlery, cookbooks, stationary, party decorations and other similar items, but no products were ever sold under the name. A trademark request for the brand was rejected and there were several reports no CEO had been found to run the business. In February, she re-branded the company to be called \"As Ever,\" and a handful of products were released (they're all marked as “sold out” now)."
    },
    {
      "url": "https://www.forbes.com/sites/maryroeloffs/2023/08/07/prince-harry-and-meghan-markle-buy-rights-to-bestseller-meet-me-at-the-lake-for-netflix/",
      "text": "Topline\nPrince Harry and Meghan Markle have bought the rights to the bestselling novel Meet Me at the Lake through their company, Archewell Productions, and will work with Netflix to bring the story to the small screen, a spokesperson for Penguin Random House confirmed to Forbes Monday, adapting a story that shares several similarities to their own lives.\nKey Facts\nCarley Fortune, author of the New York Times bestselling book, said in a statement she is “so thrilled about working with Netflix and Archewell to bring Meet Me at the Lake to the screen.”\nThe novel tells the story of Will and Fern, a couple who meet in their 30s, and deals with themes of childhood trauma that closely resemble Harry and Markle’s own lives—including losing a parent in a car crash, as Harry did with Princess Diana, and postpartum struggles, which Markle opened up about in a 2021 interview with Oprah Winfrey.\nIt is set near Toronto, where Markle was living when she started dating Harry and filming the show Suits, and discusses mental health challenges, which the prince discussed in length in his memoir, Spare.\nMeet Me At The Lake—which shares a publisher with Spare—spent five weeks on the New York Times bestseller list and has amassed more than 95,000 Goodreads ratings since it was first published in May.\nBritish tabloid The Sun estimated Archewell Productions paid as much as $3.8 million (£3 million) for the film rights, but Penguin Random House did not confirm the dollar amount to Forbes.\nKey Background\nPrince Harry and Meghan Markle famously stepped away from their royal duties and moved to Los Angeles in March 2020. In September 2020, the pair signed a five-year, $100 million contract with Netflix to produce documentaries, docuseries, feature films, scripted shows and children’s programming. The documentary Harry & Meghan premiered in December 2022 and was Netflix's biggest documentary debut ever, and the streaming platform has a docuseries called Heart of Invictus in the works, but no premiere date has been announced. Meet Me At The Lake will be the couple’s third project with Netflix. Harry and Markle also signed a since-terminated, multi-million-dollar deal with Spotify in December of 2020. The deal ended in June after producing just one series—a podcast called Archetypes hosted by Markle that lasted one season and featured interviews with guests like Serena Williams, Mariah Carey, Mindy Kaling, Paris Hilton and Trevor Noah. Forbes estimated the Spotify deal to be worth between $15 million and $18 million.\nSurprising Fact\nSuits, the show Markle acted in before leaving to date Harry, broke its own Nielsen streaming record last month after premiering on Netflix and Peacock in June. The USA Network series had 3.7 billion viewing minutes in the week of July 3 to July 9, up 17% from when the series first broke the record for most-watched acquired content with 3.1 billion minutes, Deadline reported. Suits premiered in June 2011 and ended in September 2019 with season nine, two seasons after Markle’s last appearance on the show.\nFurther Reading\nHere’s What We Know About Prince Harry And Meghan Markle’s $135 Million Deals (Forbes)\nHarry And Meghan’s Spotify Podcast Deal Ends (Forbes)\nMeghan Markle Says She Was ‘Fed To The Wolves’ In New Trailer For Netflix Documentary (Forbes)"
    },
    {
      "url": "https://www.forbes.com/sites/alisondurkee/2023/06/16/spotify-ends-podcasting-deal-with-prince-harry-and-meghan-markle/?sh=440b1e44173b",
      "text": "Topline\nSpotify has ended its podcast deal with Prince Harry and wife Meghan Markle, the two sides announced Thursday, ending the multi-million-dollar partnership after it produced only one season of Markle’s Archetypes podcast and as Spotify restructures its podcast division, which resulted in layoffs at the company earlier this month.\nKey Facts\nSpotify and Archewell Audio, Harry and Markle’s audio production company, said in a statement the two sides had “mutually agreed to part ways and are proud of the series we made together.”\nHarry and Markle, known as the Duke and Duchess of Sussex, originally signed with Spotify in December 2020, in a deal that Spotify said would “elevate underrepresented voices.”\nThe podcasting deal resulted in only one series, Markle’s podcast, Archetypes, which ran for one season starting in August 2022, featuring interviews with such guests as Serena Williams, Mariah Carey, Mindy Kaling, Paris Hilton and Trevor Noah.\nArchetypes became the top podcast on Spotify following its debut and won a People’s Choice Award in December, but sources cited by Variety said Spotify expected more content from the podcast deal.\nOther sources cited by Variety said Harry and Markle wanted to “find a new home” for their audio content, and a representative for Markle’s talent agency, WME, told the Wall Street Journal the Duchess of Sussex “is continuing to develop more content for the Archetypes audience on another platform.”\nThe announcement comes days after Spotify announced it would lay off approximately 200 people as it restructures its podcasting division, though sources cited by Variety said ending the deal with Harry and Markle was unrelated to the realignment.\nBig Number\nApproximately $20 million. That’s how much Archewell Audio’s podcasting deal with Spotify was worth, according to the Journal. The exact figure is unclear, with industry sources cited by Forbes previously valuing it at closer to $15 million to $18 million, and other reports putting it as high as $25 million. The Sussexes did not meet the “productivity benchmarks” needed to get the full payout from the deal by the time it ended, according to sources cited by the Journal.\nTangent\nSpotify ended another high-profile podcasting deal with former President Barack Obama and Michelle Obama’s Higher Ground media company in April 2022. Sources cited by Variety said at the time that Spotify was the one to decline to renew the agreement, and the Obamas reportedly wanted its content to not be exclusive to the platform. Higher Ground has since signed a new deal with Audible.\nKey Background\nThe Sussexes stepped down as working members of the royal family in early 2020 following clashes with the Palace and ongoing concerns about their privacy, relocating to California. The Spotify deal was part of the couple’s broader pivot to media content in their post-royals life, which has also included a $100 million contract with Netflix and the publication of Harry’s controversial memoir, Spare. The end of Archewell’s Spotify deal comes as the podcasting industry faces a moment of reckoning after a surge of interest, with Chartr data released in February finding the number of new podcasts dropped by 80% over the past year compared with the two years before. The number of U.S. podcast listeners only increased by 5% in 2022, according to Insider Intelligence. Spotify’s recent round of layoffs came after the audio company previously canceled ten of its original podcasts in October 2022 and laid off a reported 38 podcast employees that month.\nFurther Reading\nPrince Harry and Meghan, Spotify End Podcasting Deal (Wall Street Journal)\nMeghan Markle’s ‘Archetypes’ Podcast Unseats Joe Rogan For Top Spot On Spotify (Forbes)\nHere’s What We Know About Prince Harry And Meghan Markle’s $135 Million Deals (Forbes)\nHow Much Are Prince Harry And Meghan Markle Worth? Surprisingly, Not That Much (Forbes)"
    },
    {
      "url": "https://www.forbes.com/sites/carlieporterfield/2023/01/19/how-rich-are-prince-harry-and-meghan-markle-heres-what-we-know-about-the-power-couples-135-million-deals/?sh=43554faf3d86",
      "text": "Topline\nPrince Harry and Meghan Markle have been fast at work unveiling a slew of ventures since they shocked the world by stepping down as working royals three years ago, launching into books—with Harry’s bestselling Spare shattering records—along with movies, television and podcasts that have an estimated value of more than $135 million.\nKey Facts\nHarry is rumored to have received a $20 million advance for his latest venture, controversial tell-all Spare, which debuted earlier this month and sold more than 1.4 million copies on its release day, surpassing the 887,000 first-day copies shifted by former President Barack Obama’s 2020 memoir to become the fastest-selling nonfiction book of all time, according to Guinness World Records.\nStill perhaps their most lucrative deal yet, the couple signed a five-year, $100 million contract with Netflix in September 2020 to produce documentaries, docuseries, feature films, scripted shows and children’s programming.\nIn 2020, the couple splurged on a $14.7 million home in the posh seaside town of Montecito, California, cozying up alongside moguls and celebrities such as Oprah Winfrey, Ellen DeGeneres and Ariana Grande in a leafy residential area blocked to the public.\nIn December 2020, the former working royals penned a three-year podcasting deal with Spotify worth between $15 million to $18 million, according to industry sources, but some reports indicate it could be as much as $25 million.\nBooks\nIn the U.S. alone, Spare sold 629,300 print copies its first week on shelves (falling short of Obama’s record, with 831,300 copies), according to figures compiled by NPD Bookscan, which monitors roughly 85% of the domestic print market. Spare’s publisher, Penguin Random House, said Harry planned to support British charities with donations from the book’s proceeds, including roughly $671,000 to nonprofit WellChild and $1.5 million already given to Sentebale, an organization he cofounded to help children in Southern Africa at risk of HIV.\nMarkle, too, has dabbled in publishing, though the works have netted much less: In 2021, she released a children's picture book entitled The Bench that reportedly landed her an advance of up to $618,000 (500,000 British pounds). The 167-word book, which features an illustration of the couple’s then newborn daughter, Lilibet Diana, landed on the New York Times bestsellers list, but it’s unclear how much it ultimately sold. In 2018, Markle also published a cookbook, and donated all the proceeds to a West London community's cooking group.\nTv & Entertainment\nSo far under their Netflix deal, Harry and Markle have released two docuseries, Live to Lead, which features interviews with world leaders and celebrities including Ruth Bader Ginsburg and Gloria Steinem, as well as Harry & Meghan, the buzzy tell-all that shattered Netflix documentary viewership records upon its release in December, but also garnered waves of criticism, with some reviewers calling the series a \"tedious, narcissistic wallow.” An animated kids show, named Pearl, was announced but then scrapped in May before release, but Heart of Invictus, a docuseries following a group of injured service members preparing for the Invictus Games, is slated for release later this year. Meanwhile, the couple’s first Spotify podcast, Markle’s Archetypes, briefly surpassed The Joe Rogan Experience as Spotify’s top podcast when it was released in August.\nBefore stepping down as a working royal, Harry announced in 2019 he would executive produce a mental health series for Apple TV+ alongside Oprah Winfrey. Because of pandemic delays, the show didn’t premiere until May 2021. Nevertheless, it’s unclear if Harry made any profit from the series, given that senior working members of the royal family cannot accept money from commercial projects.\nReal Estate\nDespite its steep $14.7 million price tag, the couple’s Montecito home seems a steal compared to the $25.3 million its former owner, Russian magnate Sergey Grishin, paid in 2009. They took out a $10 million mortgage for the home, but it’s unclear, based on available records, whether the loan has been paid off. According to the Santa Barbara assessors’ office, the 14,500-square-foot estate sits on more than 5 acres and comes with seven bedrooms and 13.5 bathrooms.\nRoyal Inheritance\nAfter stepping down as working royals, Harry and Markle largely relied on Harry’s inheritance from his late mother, Princess Diana, estimated at $10 million. Representatives told Forbes in 2021 that Harry was not a beneficiary of any of the $100 million left to the royal family by his great-grandmother, the Queen Mother. It’s unclear if Harry was left any money from his grandmother the late Queen Elizabeth II, whose will is expected to stay sealed for at least 90 years.\nKey Background\nHarry and Markle no longer receive money from Harry’s royal relatives. The pair announced in early 2020 they would step down as working members of the royal family, and they no longer receive money from the royal family. Previously, the vast majority of the couple’s expenses—which Forbes estimated to be about $800,000 annually—were paid for by Harry’s father, now King Charles III, through the Duchy of Cornwall, which last year netted Charles some $27 million. (After Charles became king, the Prince of Wales title and the duchy were passed to Harry’s older brother, Prince William). As the new monarch after Elizabeth II’s death last year, Charles assumed ownership of institutions that manage an estimated $42 billion in assets on behalf of the kingdom, including famous landmarks such as Buckingham Palace, Windsor Castle and the Tower of London. However, many of those assets aren’t his to sell, as they’re held “in trust” and must be passed on to his successors.\nUpon stepping down, Harry and Markle dropped their HRH titles—short for His and Her Royal Highness—and voluntarily repaid more than $3 million to the Sovereign Grant for renovations at Frogmore Cottage, their family home in the U.K., which had previously been covered by taxpayers. Before marrying Harry in 2018, Forbes estimated Markle netted an estimated $2 million from her previous career as an actress, most notably as a star in the legal drama Suits for seven seasons.\nSurprising Fact\nHarry and Markle are responsible for covering costs for their own security detail, which security experts in 2021 told Forbes could reach up to $3 million a year. A British court ruled in July that Harry can proceed to challenge a British government committee’s decision to rule his family ineligible for police protection during visits to the U.K., even if he and Markle foot the bill. The Metropolitan Police’s former head of counterterrorism Neil Basu revealed in November that Meghan was the target of “disgusting and very real” threats from the far right. “If you’d seen the stuff that was written and you were receiving it . . . you would feel under threat all of the time,” Basu told Channel 4.\nTangent\nHarry and Markle founded their foundation Archewell in 2020. In October, the foundation announced it would distribute $1 million in grants to women who “serve as inspiration to young individuals” in partnership with the VING Project, which is funded by Groupon billionaire Eric Lefkofsky’s family foundation.\nLisette Voytko contributed reporting.\nFurther Reading\nInside ‘The Firm’: How The Royal Family’s $28 Billion Money Machine Really Works (Forbes)\nHow Much Are Prince Harry And Meghan Markle Worth? Surprisingly, Not That Much (Forbes)\nHow Rich Is King Charles III? Inside The New Monarch’s Outrageous Fortune (Forbes)"
    },
    {
      "url": "https://www.forbes.com/sites/tylerroush/2025/02/18/meghan-markle-renames-lifestyle-brand-heres-what-we-know-about-as-ever/",
      "text": "Topline\nNearly a year after launching her lifestyle brand American Riviera Orchard, Meghan Markle said Tuesday she will now call her company “As Ever” in a relaunch, with products ranging from pet food to yoga gear, home decor and cookbooks—as Markle prepares to debut a Netflix show.\nKey Facts\nMarkle announced the rebranding of American Rivera Orchard—a reference to her home in Santa Barbara, California—on Instagram, saying the renamed label As Ever is an “extension” of The Tig, Markle’s former lifestyle blog.\nIt’s not immediately clear when As Ever will launch (a website for the company includes a subscription for updates about product releases).\nThe rebrand comes ahead of the release of Markle’s Netflix show, “With Love, Meghan,” on March 4, as Markle called Netflix a “partner in my business.”\nGet Forbes Breaking News Text Alerts: We’re launching text message alerts so you'll always know the biggest stories shaping the day’s headlines. Text “Alerts” to (201) 335-0739 or sign up here.\nWhat Will Markle’s ‘as Ever’ Sell?\nMarkle said the new company will feature the same products sold under the American Riviera Orchard, including fruit preserves and “many more products,” though she did not specify. A trademark filing from September shows the company registered as an LLC in Delaware with plans to sell several products online, including soaps, shampoos, gardening tools, jewelry, furniture, kitchenware, wallpaper, yoga gear, sauces, coffee, alcoholic beverages and stationary, among others. The filing also suggests the company will sell streaming content, in addition to films, TV series, newsletters and books. It’s unclear whether goods sold by As Ever will be manufactured and produced by the company.\nWhat Is The Tig?\nMarkle launched her lifestyle blog The Tig—a reference to the wine label Tignanello—in 2014, on which she interviewed celebrities, talked about fashion and revealed details of her early life and career as an actress. She closed the site in April 2017, months before her engagement to Prince Harry.\nKey Background\nMarkle rose to fame as an actress with roles in “Get Him to the Greek” and “Horrible Bosses” before starring in the TV series “Suits” through 2017. An engagement between Markle and Harry—the youngest of two sons of Princess Diana and King Charles III—was announced shortly after Markle departed the show in 2017. They married in May 2018 and Markle gave birth to Prince Archie of Sussex in May 2019. The royal couple announced in January 2020 they would step down as senior royals, citing mistreatment by the British media and racism within the Royal Family. Since then, Harry and Markle launched the audio and video production company Archewell and signed $100 million and $20 million deals with Netflix and Spotify, respectively."
    }
  ],
  "argos_summary": "Netflix has renewed its partnership with Prince Harry and Meghan Markle, transitioning from a $100 million exclusive deal to a multi-year first-look agreement for their Archewell projects. The new deal allows Netflix the first option to stream Archewell content with less commitment, reflecting a broader trend in the streaming industry. Upcoming projects include a second season of 'With Love, Meghan,' a holiday special, a film adaptation of 'Meet Me at the Lake,' and a documentary about an orphanage in Uganda.",
  "argos_id": "V9Y48I1D6"
}