{
  "url": "https://9to5mac.com/2025/08/11/ios-26-beta-hints-at-upcoming-airpods-live-translation-gesture/?extended-comments=1",
  "authorsByline": "Marcus Mendes",
  "articleId": "3b830f75058f4a8c8e72b180668da2c1",
  "source": {
    "domain": "9to5mac.com",
    "paywall": false,
    "location": null
  },
  "imageUrl": "https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2025/08/airpods-live-translation.jpg?resize=1200%2C628&quality=82&strip=all&ssl=1",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T21:25:08+00:00",
  "addDate": "2025-08-11T22:09:20.462486+00:00",
  "refreshDate": "2025-08-11T22:09:20.462488+00:00",
  "score": 1.0,
  "title": "iOS 26 beta hints at upcoming AirPods live translation gesture",
  "description": "When Apple announced Live Translation at WWDC25, one major use case was missing: real-world conversations. That might be in the works too.",
  "content": "When Apple announced Live Translation at WWDC25, it highlighted use cases like FaceTime, phone calls, and messages. But one major use case was missing: real-world conversations. As it turns out, that was in the works too.\n\nNew image hints at new AirPods gesture\n\nIn today’s iOS 26 developer beta 6, we spotted a new system asset that appears to depict a gesture triggered by pressing both AirPods stems at once.\n\nThe image displays text in English, Portuguese, French, and German, and it is associated with the Translate app. For now, we can confirm it’s associated specifically with the AirPods Pro (2nd generation) and AirPods (4th generation).\n\nReal-world live translation is right up the wearable wheelhouse\n\nWhile Apple didn’t mention real-world translation for AirPods during the WWDC25 keynote, Bloomberg had reported earlier in the year that this feature was in the works. This feels like a natural extension of the Live Translation features already announced for FaceTime, Messages, and Phone, and it is also a strong use case for wearables in general, something we’ve already seen with devices like the Meta Ray-Bans.\n\nAt this point, it’s unclear which iPhones will support the new gesture, as it is very unlikely that the feature will run entirely on the AirPods. But it’s reasonable to assume the cutoff will align with Apple’s official hardware requirements for other Live Translation features:\n\nLive Translation in Messages is available in Chinese (Simplified), English (UK, US), French (France), German, Italian, Japanese, Korean, Portuguese (Brazil) and Spanish (Spain) when Apple Intelligence is enabled on a compatible iPhone, iPad or Mac, as well as on Apple Watch Series 9 and later and Apple Watch Ultra 2 when paired with an Apple Intelligence–enabled iPhone. Live Translation in Phone and FaceTime is available for one-to-one calls in English (UK, US), French (France), German, Portuguese (Brazil) and Spanish (Spain) when Apple Intelligence is enabled on a compatible iPhone, iPad or Mac.\n\nGiven the need of an even lower latency for real-world interactons, it is possible that this feature may be exclusive to the iPhone 17 lineup, which could help explain why Apple has kept it under wraps until now.\n\nSpeculation aside, what we do know is that Apple appears to be prepping the release of a live translation feature associated with AirPods, and that’s exciting enough, especially for anyone living abroad or traveling somewhere the language is unfamiliar.\n\nCould you see yourself using AirPods for live translation? Let us know in the comments.",
  "medium": "Article",
  "links": [
    "https://news.google.com/publications/CAAqBggKMLOFATDAGg?hl=en-US&gl=US&ceid=US:en",
    "https://www.amazon.com/Apple-Headphones-Cancellation-Transparency-Personalized/dp/B0DGJ7HYG1/?tag=marcmendes-20",
    "https://www.amazon.com/Apple-Bluetooth-Headphones-Personalized-Effortless/dp/B0DGHMNQ5Z/?tag=marcmendes-20",
    "https://9to5mac.com/2025/08/11/ios-26-beta-6/",
    "https://www.bloomberg.com/news/articles/2025-03-13/apple-plans-ios-19-feature-that-lets-airpods-live-translate-conversations",
    "https://www.amazon.com/Apple-Cancellation-Transparency-Personalized-High-Fidelity/dp/B0D1XD1ZV3/?tag=marcmendes-20",
    "https://www.amazon.com/Apple-Headphones-Cancellation-Transparency-Personalized/dp/B0DGJC52FP/?tag=marcmendes-20"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "upcoming AirPods live translation gesture",
      "weight": 0.107063204
    },
    {
      "name": "new AirPods gesture",
      "weight": 0.10477134
    },
    {
      "name": "Apple Intelligence",
      "weight": 0.10123121
    },
    {
      "name": "other Live Translation features",
      "weight": 0.099489234
    },
    {
      "name": "Apple Watch Ultra",
      "weight": 0.09288423
    },
    {
      "name": "Apple",
      "weight": 0.0925076
    },
    {
      "name": "Apple Watch Series",
      "weight": 0.09218622
    },
    {
      "name": "AirPods Pro",
      "weight": 0.08867817
    },
    {
      "name": "AirPods",
      "weight": 0.08670392
    },
    {
      "name": "live translation",
      "weight": 0.08585458
    }
  ],
  "topics": [
    {
      "name": "AirPods"
    },
    {
      "name": "Electronics"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Computers & Electronics/Software/Operating Systems",
      "score": 0.9267578125
    },
    {
      "name": "/News/Technology News",
      "score": 0.9140625
    },
    {
      "name": "/Internet & Telecom/Mobile & Wireless/Mobile Phones",
      "score": 0.798828125
    },
    {
      "name": "/Shopping/Consumer Resources/Product Reviews & Price Comparisons",
      "score": 0.4287109375
    }
  ],
  "sentiment": {
    "positive": 0.2362495,
    "negative": 0.13515015,
    "neutral": 0.62860036
  },
  "summary": "Apple's iOS 26 developer beta 6 has revealed a new system asset showing a gesture triggered by pressing both AirPods simultaneously. The gesture is associated with the AirPod Pro (2nd generation) and AirPod (4th generation). This move is a significant extension of Live Translation features already announced for FaceTime, Messages, and Phone. While it is unclear which iPhones will support the new gesture, it is expected to be exclusive to the iPhone 17 lineup.",
  "shortSummary": "Apple's iOS 26 beta hints at a new live translation gesture for AirPods, enabling real-world interaction with compatible devices and devices.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "3787a3434e2744ffbc74c4725d262b84",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://news.google.com/publications/CAAqBggKMLOFATDAGg?hl=en-US&gl=US&ceid=US:en",
      "text": "- EnglishUnited States\n- Deutsch\n- English\n- Español\n- Français\n- Italiano\n- Svenska\n- All languages\n- Afrikaans\n- azərbaycan\n- bosanski\n- català\n- Čeština\n- Cymraeg\n- Dansk\n- Deutsch\n- eesti\n- EnglishUnited Kingdom\n- EspañolEspaña\n- EspañolLatinoamérica\n- euskara\n- Filipino\n- FrançaisCanada\n- FrançaisFrance\n- Gaeilge\n- galego\n- Hrvatski\n- Indonesia\n- isiZulu\n- íslenska\n- Italiano\n- Kiswahili\n- latviešu\n- lietuvių\n- magyar\n- Melayu\n- Nederlands\n- norsk\n- o‘zbek\n- polski\n- PortuguêsBrasil\n- PortuguêsPortugal\n- română\n- shqip\n- Slovenčina\n- slovenščina\n- srpski (latinica)\n- Suomi\n- Svenska\n- Tiếng Việt\n- Türkçe\n- Ελληνικά\n- беларуская\n- български\n- кыргызча\n- қазақ тілі\n- македонски\n- монгол\n- Русский\n- српски\n- Українська\n- ქართული\n- հայերեն\n- עברית\n- اردو\n- العربية\n- فارسی\n- አማርኛ\n- नेपाली\n- मराठी\n- हिन्दी\n- অসমীয়া\n- বাংলা\n- ਪੰਜਾਬੀ\n- ગુજરાતી\n- ଓଡ଼ିଆ\n- தமிழ்\n- తెలుగు\n- ಕನ್ನಡ\n- മലയാളം\n- සිංහල\n- ไทย\n- ລາວ\n- မြန်မာ\n- ខ្មែរ\n- 한국어\n- 日本語\n- 简体中文\n- 繁體中文\n- 繁體中文香港\n- EnglishUnited States\n- Deutsch\n- English\n- Español\n- Français\n- Italiano\n- Svenska\n- All languages\n- Afrikaans\n- azərbaycan\n- bosanski\n- català\n- Čeština\n- Cymraeg\n- Dansk\n- Deutsch\n- eesti\n- EnglishUnited Kingdom\n- EspañolEspaña\n- EspañolLatinoamérica\n- euskara\n- Filipino\n- FrançaisCanada\n- FrançaisFrance\n- Gaeilge\n- galego\n- Hrvatski\n- Indonesia\n- isiZulu\n- íslenska\n- Italiano\n- Kiswahili\n- latviešu\n- lietuvių\n- magyar\n- Melayu\n- Nederlands\n- norsk\n- o‘zbek\n- polski\n- PortuguêsBrasil\n- PortuguêsPortugal\n- română\n- shqip\n- Slovenčina\n- slovenščina\n- srpski (latinica)\n- Suomi\n- Svenska\n- Tiếng Việt\n- Türkçe\n- Ελληνικά\n- беларуская\n- български\n- кыргызча\n- қазақ тілі\n- македонски\n- монгол\n- Русский\n- српски\n- Українська\n- ქართული\n- հայերեն\n- עברית\n- اردو\n- العربية\n- فارسی\n- አማርኛ\n- नेपाली\n- मराठी\n- हिन्दी\n- অসমীয়া\n- বাংলা\n- ਪੰਜਾਬੀ\n- ગુજરાતી\n- ଓଡ଼ିଆ\n- தமிழ்\n- తెలుగు\n- ಕನ್ನಡ\n- മലയാളം\n- සිංහල\n- ไทย\n- ລາວ\n- မြန်မာ\n- ខ្មែរ\n- 한국어\n- 日本語\n- 简体中文\n- 繁體中文\n- 繁體中文香港\nBefore you continue to Google\nWe use cookies and data to\n- Deliver and maintain Google services\n- Track outages and protect against spam, fraud, and abuse\n- Measure audience engagement and site statistics to understand how our services are used and enhance the quality of those services\nIf you choose to “Accept all,” we will also use cookies and data to\n- Develop and improve new services\n- Deliver and measure the effectiveness of ads\n- Show personalized content, depending on your settings\n- Show personalized ads, depending on your settings\nIf you choose to “Reject all,” we will not use cookies for these additional purposes.\nNon-personalized content is influenced by things like the content you’re currently viewing, activity in your active Search session, and your location. Non-personalized ads are influenced by the content you’re currently viewing and your general location. Personalized content and ads can also include more relevant results, recommendations, and tailored ads based on past activity from this browser, like previous Google searches. We also use cookies and data to tailor the experience to be age-appropriate, if relevant.\nSelect “More options” to see additional information, including details about managing your privacy settings. You can also visit g.co/privacytools at any time."
    },
    {
      "url": "https://9to5mac.com/2025/08/11/ios-26-beta-6/",
      "text": "Apple has released the sixth developer beta version of iOS 26. We expect the redesigned version of the iPhone software to officially launch next month.\niOS 26 developer beta 6 has arrived\nApple describes the upcoming iPhone software update by saying that iOS 26 “delivers a stunning new design, powerful Apple Intelligence capabilities, new ways to stay connected in the Phone and Messages apps, and exciting updates to CarPlay, Apple Music, Maps, and Wallet.”\nIn iOS 26 beta 2, we saw design tweaks including legibility improvements for Control Center, better menu organization in Safari, and stronger accessibility options with borders added to High Contrast Mode.\niOS 26 beta 3 most notably added opaqueness to some of the more transparent tab bars alongside new wallpaper colors. Beta 4 reverted the opaqueness tweaks. Meanwhile, Notification Center still uses absolute transparency when pulled down until fully open. That seems ripe for changing.\niOS 26 beta 4 also reintroduced notification summaries for news and entertainment apps. Apple previously paused the Apple Intelligence feature after complaints that text summaries could change the meaning of headlines.\niOS 26 beta 5 addressed a lot of user feedback by bringing back the Select button in Mail, adding a toggle to revert back to the classic Camera mode swipe direction, and more.\nStay tuned to 9to5Mac for changes discovered in iOS 26 beta 6. If all goes well, today’s developer beta build will likely be the same release as a future iOS 26 public beta 3 release.\nIs your iPhone ready for iOS 26? The next major software update runs on iPhone SE (2nd generation) as well as iPhone 11 and up. iOS 18 is the last version that will run on iPhone XR, iPhone XS, and iPhone XS Max. You’ll need to upgrade your iPhone if you want the latest features and newest design, but older iPhones will continue to receive software updates for security for a while. Features that use Apple Intelligence require iPhone 15 Pro, iPhone 15 Pro Max, or any iPhone 16 family model.\nWe’ll collect and list every change to iOS 26 beta and more on 9to5Mac so stay tuned (and join the fun with tips@9to5mac.com)!\nCheck out these great accessories\nApple AirTag | Add Find My tracking to anything\nBeats USB-A to USB-C Cable | The official CarPlay cable\nFTC: We use income earning auto affiliate links. More.\nComments"
    }
  ],
  "argos_summary": "Apple's upcoming iOS 26 developer beta 6 hints at a new live translation feature for AirPods, allowing real-world conversations to be translated in real-time. This feature, which was not mentioned during the WWDC25 keynote, is expected to enhance the usability of AirPods Pro (2nd generation) and AirPods (4th generation) for travelers and those living abroad. The feature may require the latest iPhone models for optimal performance, aligning with Apple's existing hardware requirements for other Live Translation functionalities.",
  "argos_id": "VCPU1JASM"
}