{
  "url": "https://www.washingtontimes.com/news/2025/aug/11/scientists-search-dna-endangered-salamander-mexico-citys-canals/",
  "authorsByline": "The Washington Times https://www.washingtontimes.com, María Verza",
  "articleId": "5bb3ead653b841f49086c8f0e89daa47",
  "source": {
    "domain": "washingtontimes.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "DC",
      "city": "Washington",
      "coordinates": {
        "lat": 38.8949924,
        "lon": -77.0365581
      }
    }
  },
  "imageUrl": "https://twt-thumbs.washtimes.com/media/image/2025/08/11/Mexico_Axolotl_71574_c0-156-3741-2338_s1200x700.jpg?0e2076cb998de582bcb050b19f7848b6152b87cd",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T23:35:16+00:00",
  "addDate": "2025-08-11T23:47:04.847039+00:00",
  "refreshDate": "2025-08-11T23:47:04.847041+00:00",
  "score": 1.0,
  "title": "Scientists search for DNA of an endangered salamander in Mexico City’s canals",
  "description": "Sixty years ago, residents of a canal-crossed borough in Mexico City could pluck axolotls - the large salamander reminiscent of a tiny dragon - out of the water with their hands because they were so plentiful. Now it’s almost impossible to find them in the wild.",
  "content": "MEXICO CITY — Sixty years ago, residents of a canal-crossed borough in Mexico City could pluck axolotls - the large salamander reminiscent of a tiny dragon - out of the water with their hands because they were so plentiful. Now it’s almost impossible to find them in the wild.\n\nThat’s why scientists from Mexico’s National Autonomous University are filtering Xochimilco’s murky waters for traces of the endangered creature’s DNA.\n\n“We all shed DNA along our path across the world and that can be captured by filtering air or water,” said biologist Luis Zambrano, from the university’s ecological restoration lab.\n\nAs they try to monitor the axolotls’ dwindling numbers, scientists increasingly rely on this technique as their nets come back empty during periodic surveys of the population, which is only found in Xochimilco.\n\nThey sample water taken from the canals and filter it for environmental DNA, or the genetic particles left by animals and plants that have contact with the water. That’s then compared to the profiles contained in a genetic library put together some years ago by British scientists, said Esther Quintero of Conservation International in Mexico, which has collaborated with Zambrano since 2023.\n\nScientists collected water from 53 locations in Xochimilco: 10 inside refuges where water is filtered and the water is cleaner and 43 outside those areas. They found axolotl DNA inside the protected areas and in one site outside them.\n\nReferring to the one unprotected area, Zambrano said “it’s very little,” but a sign that there is the possibility of resilience, even with continuing environmental degradation and pollution of the canals.\n\nSo far, the researchers have only searched a third of Xochimilco with the environmental DNA technique and the manual work with nets, but they plan to continue the work and hopefully present an updated census early next year.\n\nThe trend, however, is not good. From an estimated 6,000 axolotls per square kilometer in 1998, there were only 36 per square kilometer in the last census, in 2014.\n\nZambrano highlights that his team’s work has shown that conservation works and that the effort to protect the species is also improving water quality, increasing the number of pollinizers in the area and means that Mexico City makes better use of Xochimilco’s water, among other benefits.\n\nBut policymakers can do more, he said, such as prohibiting the opening of dance clubs, spas and soccer fields on Xochimilco’s traditional man-made islands, known as chinampas. Instead, the government should incentivize the islands’ traditional agricultural production, ensuring that farmers can actually make a living at it.\n\nIf its habitat is fixed, the axolotl can take care of the rest.\n\n“The axolotl reproduces a lot because it lays a lot of eggs … it can easily recover and we know how,” Zambrano said.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "axolotl DNA",
      "weight": 0.091931865
    },
    {
      "name": "water quality",
      "weight": 0.089079976
    },
    {
      "name": "water",
      "weight": 0.08768286
    },
    {
      "name": "environmental DNA",
      "weight": 0.08712302
    },
    {
      "name": "Mexico City",
      "weight": 0.08021541
    },
    {
      "name": "DNA",
      "weight": 0.07397301
    },
    {
      "name": "Xochimilco",
      "weight": 0.07348734
    },
    {
      "name": "biologist Luis Zambrano",
      "weight": 0.07029208
    },
    {
      "name": "Luis Zambrano",
      "weight": 0.06883192
    },
    {
      "name": "continuing environmental degradation",
      "weight": 0.06864013
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/Pets & Animals/Wildlife",
      "score": 0.92578125
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Green Living & Environmental Issues",
      "score": 0.7890625
    },
    {
      "name": "/Science/Ecology & Environment/Other",
      "score": 0.77734375
    },
    {
      "name": "/Science/Biological Sciences/Other",
      "score": 0.75244140625
    },
    {
      "name": "/Science/Earth Sciences/Other",
      "score": 0.5869140625
    },
    {
      "name": "/News/Local News",
      "score": 0.382568359375
    }
  ],
  "sentiment": {
    "positive": 0.23277631,
    "negative": 0.30311155,
    "neutral": 0.46411213
  },
  "summary": "Scientists from Mexico's National Autonomous University are searching for the DNA of an endangered salamander in Xochimilco's canals for traces of the endangered creature's DNA. The scientists use this technique to sample water taken from the canals and compare it to the genetic profiles contained in a genetic library by British scientists. So far, they have found axolotl DNA inside protected areas and in one site outside them. However, the trend is not good, with there being only 36 per square kilometer in the last census in 2014. The researchers have only searched a third of Xochilco with the environmental DNA technique and manual work with nets, but plan to continue their work.",
  "shortSummary": "Scientists are filtering Xochimilco's canals for DNA from endangered salamander axolotls, emphasizing conservation efforts and advocating for better water quality and environmental protection.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "bdfdfad0bc1e4ca29057ec7744f890cd",
  "places": [
    {
      "osmId": "5606640",
      "suburb": "Xochimilco",
      "city": "Mexico City",
      "country": "Mexico",
      "countryCode": "mx",
      "coordinates": {
        "lat": 19.2633049,
        "lon": -99.1041121
      }
    }
  ],
  "scraped_sources": [],
  "argos_summary": "Sixty years ago, axolotls were abundant in Xochimilco, Mexico City, but their numbers have drastically declined, prompting scientists from Mexico's National Autonomous University to use environmental DNA techniques to monitor their population. Recent findings indicate the presence of axolotl DNA in both protected and one unprotected area, suggesting a potential for resilience despite ongoing environmental challenges. Researchers emphasize the importance of habitat preservation and advocate for policies that support traditional agricultural practices to aid in the species' recovery.",
  "argos_id": "VD1G79Y99"
}