{
  "url": "https://gizmodo.com/creepy-kids-horror-movies-streaming-weapons-2000641405",
  "authorsByline": "Cheryl Eddy",
  "articleId": "393d70ceff3b4e2f8e2f24b24dc52a1b",
  "source": {
    "domain": "gizmodo.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://gizmodo.com/app/uploads/2025/08/THERES-SOMETHING-WRONG-WITH-THE-CHILDREN-1200x675.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T19:39:01+00:00",
  "addDate": "2025-08-11T21:05:57.304437+00:00",
  "refreshDate": "2025-08-11T21:05:57.304441+00:00",
  "score": 1.0,
  "title": "8 Movies About Freaky Kids to Stream After 'Weapons'",
  "description": "Stream these cult horror favorites to make you feel even uneasier about the younger generation.",
  "content": "Weapons topped the box office this weekend, which is fantastic news for fans of original horror movies. The movie follows a town grappling with the unbelievable truth that an entire classroom of kids has vanished en masse—and the discovery of the sinister reason behind their disappearance. If Weapons has you in the mood to take in more tales of freaky children, the horror genre has many to choose from. Here are 10 cult classics featuring that same theme, which remains as evergreen as it is consistently terrifying.\n\nThis deliciously grim 1976 Spanish film follows a vacationing couple who drifts onto an island populated only by children—hostile, homicidal children. The movie’s title sets you up for its central dilemma, though the answer quickly becomes, “Anyone who wants to survive this hellscape better start shooting.” There’s plenty of horror baked into this concept even before you consider the woman is pregnant… and the kill-crazy affliction extends to unborn children as well. Even worse, the kids find a way off the island at the end, suggesting adults of the world should start watching their backs immediately. (Available to rent or buy on Prime Video.)\n\nThere’s Something Wrong With the Children\n\nThis 2023 chiller follows two couples on a glamping getaway. The pair with two young kids brings them along, and while you hate to blame that choice for turning a relaxing vacation into nightmarish terror, it’s definitely the root cause. When the young ‘uns go briefly missing, they return alarmingly transformed, and There’s Something Wrong With the Children does an admirable job wringing frights from that fact while it digs into the ways the adults react to this sudden dreadful change in circumstances. (Streaming on Prime Video)\n\nIt wouldn’t be a gathering of scary kids without some Stephen King flavor, and 1984’s Children of the Corn remains the most effective adaptation in this unnecessarily prolonged cinematic franchise. It’s the scariest and the simplest: Peter Horton and Linda Hamilton (The Terminator came out a few months after this) star as a married pair whose road trip takes a malevolent turn in rural Nebraska. They’re soon stranded in a community where nobody seems to be over 18—John Franklin, who was actually in his 20s at the time, is memorably eerie as their leader, Isaac—and everyone worships a demonic, bloodthirsty presence that lurks in the cornfield. Or else. (Streaming on AMC+ and Tubi.)\n\nThis 2012 Irish film (not to be confused with the same-named Prime Video spy series) is full of disturbing imagery that will linger long after you finish watching it. Director Ciarán Foy went on to make Sinister 2 and help with episodes of Sweet Tooth and The Haunting of Bly Manor, but even if he’d never made anything else, he could be confident about creating plenty of nightmares with his feature debut. It’s about a man who struggles to put his life back together after his pregnant wife is attacked by a mob of mysterious, hoodie-clad teens in their run-down apartment building. After he moves to another run-down building, he soon comes to realize there’s something terribly off about those “teens.” (Rent or buy on Prime Video)\n\nThe 1990s John Carpenter remake is fine, but the coldest chills come from the 1960 original, which taps into post-war fears to explore what happens when a town first experiences an unexplained cosmic event, then a few months later all the women of the right age realize they’re pregnant. The unusual children are all born on the same day and have the same eerie appearance, as well as the power to read and control minds, especially when it comes to adults who question just what in the (alien in origin) hell is going on. (Rent or buy on Prime Video)\n\nThe Omen, The Bad Seed, and Pet Sematary\n\nWhile the rest of this list focuses on groups of children—and indeed, most of the time, freaky kids are scarier in numbers—there are some horror-movie tots who do just fine menacing adults on their own. These include Satan’s own spawn, Damien, in 1976’s The Omen (baby-swapped at birth to torment a diplomat while ladder-climbing toward world domination); Rhoda Penmark, the murderously competitive moppet of 1956’s The Bad Seed; and, for one more dose of Stephen King, resurrected toddler terror Gage in 1989’s Pet Sematary. (The Omen is available to rent or buy on Prime Video, also on Tubi; The Bad Seed rent or buy on Prime Video; Pet Sematary streaming on Paramount+)",
  "medium": "Article",
  "links": [
    "https://gizmodo.com/theres-something-wrong-with-the-children-horror-review-1849998960",
    "https://www.amazon.com/gp/video/detail/amzn1.dv.gti.a2a9f75a-d2cf-11cf-28ed-52936ea0b11c?tag=gizmodo08c-20",
    "https://gizmodo.com/weapons-is-a-terrifying-fascinating-excellent-character-driven-horror-movie-2000635404",
    "https://www.amazon.com/gp/video/detail/amzn1.dv.gti.f50b52c8-82c4-4afc-981b-d79fb8db6ac9?tag=gizmodo08c-20",
    "https://gizmodo.com/the-50-spookiest-kids-in-horror-movies-ranked-1781681290",
    "https://gizmodo.com/doctor-who-release-dates-streaming-ncuti-gatwa-rtd-1849745140",
    "https://gizmodo.com/star-trek-release-dates-where-to-stream-picard-discover-1848839650",
    "https://tubitv.com/movies/648401/the-omen?start=true&tracking=google-feed&utm_source=google-feed",
    "https://www.amazon.com/gp/video/detail/amzn1.dv.gti.f94e4e14-94ab-4c03-b3a1-029d2b028e24?tag=gizmodo08c-20",
    "https://www.amazon.com/gp/video/detail/amzn1.dv.gti.9ead526b-8220-30d8-5e2d-ad57c4ef91fa?tag=gizmodo08c-20",
    "https://www.paramountplus.com/movies/video/80JU7nWal_1IEvEuFD5Kkd0WZ1dCKsgT/?searchReferral=desktop-web&source=google-organic&ftag=PPM-23-10bfh8c",
    "https://www.amazon.com/gp/video/detail/amzn1.dv.gti.0f29a2c3-b9c5-4e2c-89d2-03d60a62f746?tag=gizmodo08c-20",
    "https://gizmodo.com/weapons-runs-to-big-70m-global-opening-in-debut-weekend-2000641198",
    "https://www.amazon.com/gp/video/detail/amzn1.dv.gti.18a9f66e-062e-c7d8-0df6-8bc48f947fc5?tag=gizmodo08c-20",
    "https://tubitv.com/movies/478814/children-of-the-corn?start=true&tracking=google-feed&utm_source=google-feed",
    "https://www.amazon.com/gp/video/detail/amzn1.dv.gti.8aa9f6fa-6639-9aa3-caa8-1ad3656af546?tag=gizmodo08c-20",
    "https://gizmodo.com/marvel-release-dates-when-to-see-upcoming-mcu-movies-1848196856",
    "https://gizmodo.com/star-wars-movies-tv-shows-release-dates-disney-1848494806",
    "https://gizmodo.com/warner-bros-dc-release-dates-hbo-max-cast-details-1848354161"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Prime Video",
      "weight": 0.06556066
    },
    {
      "name": "Freaky Kids",
      "weight": 0.06344574
    },
    {
      "name": "freaky kids",
      "weight": 0.06344574
    },
    {
      "name": "scary kids",
      "weight": 0.062379774
    },
    {
      "name": "freaky children",
      "weight": 0.060716
    },
    {
      "name": "original horror movies",
      "weight": 0.060204457
    },
    {
      "name": "kids",
      "weight": 0.054644633
    },
    {
      "name": "unborn children",
      "weight": 0.05301942
    },
    {
      "name": "children",
      "weight": 0.051036656
    },
    {
      "name": "adults",
      "weight": 0.049959876
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Movies/Movie Reference",
      "score": 0.88720703125
    },
    {
      "name": "/Arts & Entertainment/TV & Video/Online Video",
      "score": 0.54931640625
    }
  ],
  "sentiment": {
    "positive": 0.087487474,
    "negative": 0.6111505,
    "neutral": 0.30136198
  },
  "summary": "The recent release of \"Weapons\" topped the box office this weekend, providing a welcome welcome for fans of original horror movies. The film follows a town in which a classroom of kids mysteriously disappears, leading to the discovery of the sinister reason behind their disappearance. The 1976 Spanish film \"There's Something Wrong With the Children\" follows a vacationing couple who finds a way off an island populated only by children, suggesting adults should start watching their backs immediately. Other cult classics include \"Children of the Corn\" and \"There’s Something Wrong with the Children,\" a 2023 chiller about a man who struggles to rebuild his life after his pregnant wife is attacked by a mob of mysterious teens. The most successful adaptation of \"Children Of the Corn,\" \"Children the Corn\", is \"the scariest and simplest\" adaptation in the franchise. \"The Omen, The Bad Seed, and Pet Sematary\" are also included in the list.",
  "shortSummary": "The film \"Weapons\" topped the box office, but horror films like \"There’s Something Wrong With the Children\" and \"Children of the Corn\" are among those you can stream online.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "6a379f7291734522b4b56eb0c1e74d7a",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://gizmodo.com/star-wars-movies-tv-shows-release-dates-disney-1848494806",
      "text": "“Star Wars! Nothing but Star Wars! Give me those Star Wars! Don’t let them end…” Just as Bill Murray said it in 1978, we’re still saying it today. Star Wars is everywhere these days, with multiple movies and TV shows in the works from Disney and Lucasfilm. This article will give you the most up-to-date Star Wars release dates so you know exactly when every new Star Wars movie or Disney+ show will arrive.\nWhat are the next three movies? What TV shows are coming up? Have any TV shows or movies been canceled? What are people saying about what’s next? We’ve got you covered on all things in a galaxy far, far away.\nThis post was last updated on 9/13/2023.\nWhat’s the next Star Wars movie?\nSharmeen Obaid-Chioy’s New Jedi Order Film Film\nRelease Date: TBD, but May 26, 2026, December 18, 2026 or December 17, 2027 (In Theaters)\nAt Star Wars Celebration 2023 in London, Lucasfilm announced that three Star Wars movies are now in the works.\nJames Mangold (Indiana Jones 5) will direct a film 25,000 years before any known Star Wars timeline about the first Jedi to use the Force.\nDave Filoni will direct a film that’s kind of the Star Wars Disney+ Avengers, telling the story of a climactic event meeting the stories of The Book of Boba Fett, The Mandalorian, Ahsoka and more in the time between Return of the Jedi and The Force Awakens.\nAnd Sharmeen Obaid-Chioy will direct a film set 15 years after the events of The Rise of Skywalker following Rey (Daisy Ridley) as she creates a New Jedi Order.\nThis last one, we think, is the film that Damon Lindelof (Lost, The Leftovers, Watchmen) was co-writingwith Justin Britt-Gibson before departing the project. Steven Knight is now reportedly writing.\nA week after the news of these films first broke, it began to seem like the Rey project by Obaid-Chioy could be the first one out of the gate. However, in June, Disney shuffled its release schedule and moved its December 2025 Star Wars movie to May 2026, and added a third Star Wars movie to the schedule in December 2026. So maybe these three movies are on those dates. We’ll see.\nUpcoming Star Wars release dates\nThese shows and movies have all been officially announced and are in various stages of production, even if we don’t know when they will definitely come out.\nStar Wars: Ahsoka\nRelease Date: Now Playing (On Disney+)\nThe first full live-action Ahsoka Tano show from co-creator Dave Filoni is finally here. Rosario Dawson is, of course, returning. And our first look at footage confirmed that actress Natasha Liu Bordizzo has been cast as Sabine Wren; more recently, Eman Esfandi was confirmed as Ezra Bridger. At Star Wars Celebration this year we learned Mary Elizabeth Winstead is playing Hera Syndulla, Lars Mikkelsenis playing Grand Admiral Thrawn and Wes Chatham is his right-hand man.\nWhat does that all mean? Well, in the first teaser trailer, you can see she’ll make good onthe Star Wars Rebels finale and go after Thrawn. And what about the fact she knows Luke Skywalker now? And how does Ray Stevenson’s lightsaber-wielding character fit in?\nThe show is now airing on Disney+ and here you can read our weekly recaps:\nEpisode 1, “Master and Apprentice: and Episode 2, “Toil and Trouble”\nEpisode 6, premiering September 19\nEpisode 7, premiering September 26\nEpisode 7, premiering October 3\nStar Wars: Skeleton Crew\nRelease Date: 2023 (On Disney+)\nCreated by Spider-Man Homecoming/Far From Home/No Way Home director Jon Watts along with writer Chris Ford, this mystery Star Wars show is now currently in development. The title for the show was released during the Star Wars Celebration, and was previously internally referred as “Grammar Radio.” Celebration also revealed its headlining star, Jude Law.\nSet after the events of Return of the Jedi, Skeleton Crew is described as an adventure in the mold of Amblin adventures of the 1980s. The show will be about seeing the galaxy through the eyes of children (but it is not a kids show), and will follow a group of children who get lost in the galaxy and try to find their way home. Jon Watts explained that the series will take place during the same time period as the upcoming Ahsoka series and The Mandalorian.\nFilming on the series began in 2022 and ended in early 2023. And though not much is know about what happens on the show,it has been revealed that The Daniels, the Oscar-winning directors of Everything Everywhere All At Once, directed an episode. Ditto David Lowery, who did the film The Green Knight. Read more about the show here.\nio9 saw the first footage at Star Wars Celebration 2023 and you can read about it here. Three of the main stars of the show are played by Ravi Cabot-Conyers, Kyriana Kratter, and Robert Timothy Smit. Rumors suggest it could debut in November or December 2023.\nStar Wars: The Acolyte\nRelease Date: 2024 (On Disney+)\nRussian Doll co-creator Leslye Headland will be the first person to bring the excellent High Republic timeline into live-action with this show, long rumored to star Amandla Stenberg before an actual confirmation finally arrived at San Diego Comic-Con 2022—one of few Star Wars bits of news to emerge from the convention.\nIn an interview in 2022, Headland revealed the show would be about 100 years before the events of The Phantom Menace. “A lot of those characters haven’t even been born yet,” she said. “We’re taking a look at the political and personal and spiritual things that came up in a time period that we don’t know much about. My question when watching The Phantom Menace was always like, ‘Well, how did things get to this point?’ How did we get to a point where a Sith lord can infiltrate the Senate and none of the Jedi pick up on it? Like, what went wrong? What are the scenarios that led us to this moment?”\nIn an interview released later, Headland spoke about her goals for the series. For Headland, above all else The Acolyte is a mystery, and that mystery is figuring out what is going on in this peak period. It was also suggested that The Acolyte will bring more elements from the Expanded Universe to canon, but what parts that will be incorporated will remain to be seen.\nIn September 2022, both Jodie Turner-Smith and Squid Game’s Emmy-winning Lee Jung-Jae joined the cast, with an official announcement in November adding Carrie-Anne Moss, Manny Jacinto, and others to the roster. The first image, which you see above, was released in November and you can read about the first footage here, which was shown at Star Wars Celebration 2023.\nAnd no, despite what bullcrap rumors you may have been reading online, the show has not been canceled.\nAndor: Season 2\nRelease Date: August 2024 (On Disney+)\nSeason one of Tony Gilroy’s Rogue One prequel starring Diego Luna showed an excitingly different side of Star Wars. Season two will reportedly be spread across the four years leading up to Rogue One, with four episodes covering each year in Cassian Andor’s life until that fateful point. Filming began in late 2022.\nAt Star Wars Celebration 2023, Gilroy announced the show should be out in August 2024 and showed fans the first footage from the season. Read about it here. Plus, the final episodes of the season/series will take place just days before Rogue One, leading right into that story.\nOne minor hiccup though, due to the Writer’s Guild strike, showrunner and head writer Tony Gilroy left his duties show in May 2023. He’s unlikely to return until the Writer’s Strike is over, which could cause a delay.\nStar Wars: A Droid Story\nRelease Date: TBD (On Disney+)\nLucasfilm Animation is teaming up with Industrial Light and Magic for this streaming show that will “introduce us to a new hero, guided by legendary duo R2-D2 and C-3PO.” We don’t know anything beyond that and there hasn’t been a significant update in years, which could be a good thing or bad thing.\nStar Wars: Lando\nRelease Date: TBD (On Disney+)\nWay back in December 2020, Disney announced a bunch of Star Wars TV shows. Among them was a Lando show which, at the time, was going to be made by Dear White People creator Justin Simien. After that, things went quiet for about three years. Then,in an April 2023 article, Donald Glover hinted that he’s still interested and it’s still possible in the works. A May 2023 interview with Lucasfilm president Kathleen Kennedy confirmed it’s still in the works.\nThe first significant update in almost three years came in July when news broke that Simien has been off the project since he started working on Haunted Mansion, and not only is Donald Glover going to star in the series, he’s co-writing it with his brother Stephen.\nUntitled Taika Waititi Star Wars Movie\nRelease Date: TBD\nIn May 2020, news broke that Oscar-winning director of Thor: Ragnarok would be helming and co-writing along with Krysty Wilson-Cairns. “Taika’s approach to Star Wars will be fresh, unexpected, and … unique,” Lucasfilm president Kathleen Kennedy said. “His enormous talent and sense of humor will ensure that audiences are in for an unforgettable ride.”\nThere was a time when this was likely to be the next Star Wars film but, after Star Wars Celebration 2023, it seems like it’s now on the back burner. That was confirmed by Lucasfilm president Kathleen Kennedy who said the Oscar-winner is still working on the film, it’s just going slowly.\nIn the past, Waititi has discussed some broad ideas of what he wants to do with his upcoming film. Read those below.\nTaika Waititi Doesn’t Want Star Wars to Rely on Legacies\nAre You as Confused About Taika Waititi’s Star WarsMovie as We Are?\nUntitled Dave Filoni Star Wars Movie\nRelease Date: TBD\nWe mentioned this one above but, at some point, Dave Filoni will be directing a film that is meant to be a climactic event wrapping up stories that have begun on shows he’s involved with such as The Mandalorian, Ahsoka, The Book of Boba Fett, Skeleton Crew and others.\nUntitled James Mangold Star Wars Movie\nRelease Date: TBD\nThis was one of the three films announced at Star Wars Celebration but, like Filoni’s, isn’t likely to be next. This one is set 25,000 years before the original trilogy and tells the story of the first person to use the Force.\n“For me, it’s about, I want to be part of the saga, but I also don’t want to be holding so much lore in the air that you can hardly tell a story,” Mangold told io9 when asked about this film. “And what I really wanted to do…was just can we make a kind of the Ten Commandments of the Force, you know? A kind of origin story of how the Force came to be known, understood, wielded, and harnessed.” We love this idea so much we even wrote about it.\nStar Wars Movies and TV Shows That Are Currently Unscheduled and Haven’t Been Officially Announced, But We Think Are Still Happening\nThe Mandalorian Season 4\nRelease Date: TBD\nWith The Mandalorian Season 3 now in the books, all eyes look ahead to season 4. However, the season has not yet been officially announced. Unofficially though, series creator Jon Favreau said he’s already written a fourth season which he probably wouldn’t have done just for fun. It’s coming. It’s just a matter of when, especially with writers and actors on strike.\nThe Book of Boba Fett Season 2\nRelease Date: TBD (On Disney+)\nThe Book of Boba Fett season one ended with the implication that we’d see more of these character in the future. But alas, there has been no official announcement… yet. Dive into the making-of season one while we wait and ponder the words of executive producer Robert Rodriguez who said he knows when the character is coming back, but he can’t say when.\nUntitled Shawn Levy Movie\nRelease Date: TBD\nShawn Levy, the prolific director and producer behind Stranger Things, Night at the Museum, and Free Guy is gearing up to develop a film in a galaxy far far away. He’ll focus on that after completing Deadpool 3, which stars Ryan Reynolds and Hugh Jackman.\nStar Wars Movies and TV Shows That Are Currently Unscheduled and Probably NOT Going To Happen\nStar Wars: Rangers of the New Republic\nOriginally announced alongside shows like Obi-Wan Kenobi, Ahsoka, and Andor, Rangers of the New Republic was rumored to be Cara Dune’s show which would tie into The Mandalorian and Book of Boba Fett. However, with actress Gina Carano no longer a part of Star Wars, word on the street is this will no longer be happening. Nothing is official though.\nUntitled Rian Johnson Trilogy\nLet’s be honest. Do we think this is happening anymore? Probably not. Rian Johnson has moved on to other things. But, until we hear otherwise (and no one is officially saying), we’d be remiss if we didn’t mention that before the divisive release of The Last Jedi, Lucasfilm officially said Johnson would make his very own trilogy. It hasn’t officially been canceled yet but, in a new interview, Lucasfilm president Kathleen Kennedy suggested that it’s been placed on the back burner as Johnson does other things. With Johnson’s next film, Glass Onion, set for release in late 2022 though, he’s been quoted saying he still hopes these movies happen. So do we.\nStar Wars: Rogue Squadron\nFor several years, Wonder Woman director Patty Jenkins’ film about pilots in the Star Wars universe has been earmarked as the next film. Well, that’s no longer the case. After months of rumors suggesting it might move off its 2023 release date, Disney officially took it off the schedule. On December 13 2022, Jenkins said the movie is still in “active development” but recent news suggests it’s dead. Lucasfilm president Kathleen Kennedy disagrees, saying in May 2023 it’s still on the books.\nUntitled Kevin Feige Movie\nMarvel Studios President Kevin Feige is best known for helping create the Marvel Cinematic Universe. But as much as he loves Marvel, he loves Star Wars even more. And so it was exciting to hear that he was producing a Star Wars movie and even recruited Loki and Doctor Strange in the Multiverse of Madness writer Michael Waldron to help him. Feige doesn’t like to even acknowledge this project though and in a 2022 interview, Lucasfilm president Kathleen Kennedy also tiptoed around the project’s existence. Then, a few weeks before Star Wars Celebration 2023, we learned the project is likely dead.\nFor more, check out io9’s list of every canceled (or re-worked) Disney Star Wars project.\nWant more io9 news? Check out when to expect the latest Marvel, Star Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about the future of Doctor Who."
    },
    {
      "url": "https://www.amazon.com/gp/video/detail/amzn1.dv.gti.18a9f66e-062e-c7d8-0df6-8bc48f947fc5?tag=gizmodo08c-20",
      "text": "Skip to\nMain content\nKeyboard shortcuts\nSearch\nalt\n+\n/\nCart\nshift\n+\nalt\n+\nC\nHome\nshift\n+\nalt\n+\nH\nOrders\nshift\n+\nalt\n+\nO\nShow/Hide shortcuts\nshift\n+\nalt\n+\nZ\nTo move between items, use your keyboard's up or down arrows.\n.us\nPrime Video\nSelect the department you want to search in\nPrime Video\nAll Departments\nArts & Crafts\nAutomotive\nBaby\nBeauty & Personal Care\nBooks\nBoys' Fashion\nComputers\nDeals\nDigital Music\nElectronics\nGirls' Fashion\nHealth & Household\nHome & Kitchen\nIndustrial & Scientific\nKindle Store\nLuggage\nMen's Fashion\nMovies & TV\nMusic, CDs & Vinyl\nPet Supplies\nSoftware\nSports & Outdoors\nTools & Home Improvement\nToys & Games\nVideo Games\nWomen's Fashion\nSearch Amazon\nEN\nHello, sign in\nAccount & Lists\nReturns\n& Orders\n0\nCart\nAll\nToday's Deals\nPrime Video\nRegistry\nCustomer Service\nGift Cards\nSell\nDisability Customer Support\nMenu\nCaret Down\nBrowse\nHome\nMovies\nTV shows\nSports\nHome\nMovies\nTV shows\nSports\nCategories Remaster\nYour account\nGetting Started\nHelp\nMenu\nCaret Down\nHome\nMovies\nTV shows\nSports\nCategories\nYour account\nGetting Started\nHelp\nChildren of the Corn\nA young couple is trapped in a remote town where a dangerous religious cult of children believes that everyone over age 18 must be killed.\nStar Filled\nStar Filled\nStar Filled\nStar Filled\nStar Half\n1,319\nIMDb 5.6\n1 h 28 min\n1984\nR\nHorror\n•\nDark\n•\nHaunting\n•\nIntense\nThis video is currently unavailable\nto watch in your location\nWatch trailer\nAdd\nWatchlist\nLike\nNot for me\nShare Android\nShare\nRelated\nDetails\nRelated\nCustomers also watched\nForward\nRobocop 2\nStore Filled\nCocktail\nStore Filled\nThe Conjuring\nStore Filled\nThe Big Bang Theory\nStore Filled\nJohn Carpenter's Village of the Damned\nStore Filled\nTerrifier\nStore Filled\nDemolition\nStore Filled\nCreepshow 2\nStore Filled\nChildren of the Corn VII: Revelation\nStore Filled\nNobody\nStore Filled\nThe Monster Squad\nStore Filled\nThe Book of Eli\nStore Filled\nThe Blair Witch Project\nStore Filled\nForward\nBack to top\nGet to Know Us\nCareers\nBlog\nAbout Amazon\nInvestor Relations\nAmazon Devices\nAmazon Science\nMake Money with Us\nSell products on Amazon\nSell on Amazon Business\nSell apps on Amazon\nBecome an Affiliate\nAdvertise Your Products\nSelf-Publish with Us\nHost an Amazon Hub\n›\nSee More Make Money with Us\nAmazon Payment Products\nAmazon Business Card\nShop with Points\nReload Your Balance\nAmazon Currency Converter\nLet Us Help You\nAmazon and COVID-19\nYour Account\nYour Orders\nShipping Rates & Policies\nReturns & Replacements\nManage Your Content and Devices\nHelp\nEnglish\n$\nUSD - U.S. Dollar\nUnited States\nAmazon Music\nStream millions\nof songs\nAmazon Ads\nReach customers\nwherever they\nspend their time\n6pm\nScore deals\non fashion brands\nAbeBooks\nBooks, art\n& collectibles\nACX\nAudiobook Publishing\nMade Easy\nSell on Amazon\nStart a Selling Account\nVeeqo\nShipping Software\nInventory Management\nAmazon Business\nEverything For\nYour Business\nAmazonGlobal\nShip Orders\nInternationally\nAmazon Web Services\nScalable Cloud\nComputing Services\nAudible\nListen to Books & Original\nAudio Performances\nBox Office Mojo\nFind Movie\nBox Office Data\nGoodreads\nBook reviews\n& recommendations\nIMDb\nMovies, TV\n& Celebrities\nIMDbPro\nGet Info Entertainment\nProfessionals Need\nKindle Direct Publishing\nIndie Digital & Print Publishing\nMade Easy\nPrime Video Direct\nVideo Distribution\nMade Easy\nShopbop\nDesigner\nFashion Brands\nWoot!\nDeals and\nShenanigans\nZappos\nShoes &\nClothing\nRing\nSmart Home\nSecurity Systems\neero WiFi\nStream 4K Video\nin Every Room\nBlink\nSmart Security\nfor Every Home\nNeighbors App\nReal-Time Crime\n& Safety Alerts\nAmazon Subscription Boxes\nTop subscription boxes – right to your door\nPillPack\nPharmacy Simplified\nConditions of Use\nPrivacy Notice\nConsumer Health Data Privacy Disclosure\nYour Ads Privacy Choices\n© 1996-2025, Amazon.com, Inc. or its affiliates"
    },
    {
      "url": "https://gizmodo.com/marvel-release-dates-when-to-see-upcoming-mcu-movies-1848196856",
      "text": "There’s now over 30 feature films in addition to eight Disney+ shows in 15 years in the Marvel Cinematic Universe. 2023 got off to a promising start here’s what’s coming next from the MCU. In short: a lot, we began Phase Five with Ant-Man and the Wasp: Quantumania followed by Guardians of the Galaxy: Volume 3, Secret Invasion and by the fall we’ve got The Marvels on the horizon along with season 2 of Loki.\nHere’s the latest news for Marvel theatrical release dates and Marvel TV release dates on Disney+—which the studio can often tweak or reschedule—so we get it, keeping track of when your favorite superheroes are returning or making their debuts can be challenging. Don’t worry, to help you stay on top of things, we’re compiling all the current MCU release dates; when specific titles have been announced but still not officially scheduled, we’ll put them in order when we think they’re most likely to show up.\n(Last updated 6/16/23)\nWhat’s the next Marvel movie?\nThe Marvels\nRelease date: November 10 (In theaters)\nThe sequel to Captain Marvel will pull together three of the MCU’s most powerful women: Brie Larsen’s titular Captain, Ms. Marvel’s Iman Vellani as Kamala Khan, and Teyonah Parris as Monica Rambeau. Nia DaCosta (who most recently helmed the revival of Candyman) is directing the film.\nIn the finale of Ms. Marvel season one, Carol Danvers showed up in Kamala Khan’s bedroom, marking the first real tease of the film. The film release date change came with a poster. Most recently the teaser trailer dropped and here’s our breakdown of everything we saw.\nUpcoming Marvel Cinematic Universe Release Dates\nSecret Invasion\nRelease date: June 21 (On Disney+)\nThis series picks up storylines from both Captain Marvel and Spider-Man: Far From Home to explain the decades-long Skrull invasion of Earth. Samuel L. Jackson and Ben Mendelsohn will star withEmilia Clarke taking on the role of Talos’ grown daughter who has joined a rebellious splinter cell of Skrulls. Martin Freeman has also confirmed he will be appearing in Secret Invasion.\nThe Disney+ blurb of the series describes the series as a “crossover event series showcasing a faction of shape-shifting Skrulls who have been infiltrating Earth for years.” A trailer was released at D23.\nLoki Season 2\nRelease date: Fall 2023 (On Disney+)\nThe smash hit series about Tom Hiddleston’s antihero will return soon for more variant shenanigans across the multiverse. Hiddleston confirmed “the whole cast” of Loki’s first season will return for season two on an episode of Jimmy Kimmel Live. In December, we got a very, very brief tease of season two.\nEcho\nRelease date: November 29, 2023 (On Disney+)\nThis spinoff from the Hawkeye series will follow Echo, a deaf martial artist, as played by actress Alaqua Cox. Devery Jacobs (Reservation Dogs) co-stars. Echo officially began filming on May 24, according to a tweet by series creator Marion Dayre. According to James Clement on an episode of the Weekly Planet podcast, both Vincent D’Onofrio and Charlie Cox are set to return for the Echo series at Disney+.\nThe series was recently announced along with Ironheart, Agatha Coven of Chaos and What If season 2 as potentially moving to 2024.\nX-Men ‘97\nRelease date: Fall 2023 (On Disney+)\nThe X-Men are coming to the MCU… kinda. X-Men ‘97 is a revival of the classic ‘90s animated show, bringing back the same style, stories and yes, theme song, of the iconic series. (See more: X-Men ‘97 Looks Like a Nostalgic Blast From the Past)\nIronheart\nRelease date: 2024 (On Disney+)\nWith Tony Stark gone, the MCU needs a new super-genius inventor. Enter teenage prodigy Riri Williams (played by Dominique Thorne), who creates a brand new, ultra-advanced armored suit. Other cast members include Anthony Ramos (In the Heights) as the villain the Hood and Lyric Ross (This Is Us). Chinaka Hodge (TNT’s Snowpiercer) is attached as the head writer, and Black Panther director Ryan Coogler is an executive producer alongside Marvel’s Kevin Feige and others. Manny Montana (Good Girls) has joined the cast of Marvel’s Ironheart in an undisclosed role as well as Han Solo himself, Alden Ehrenreich.\nAgatha: Coven of Chaos\nRelease date: Winter 2024 (On Disney+)\nThis spinoff from WandaVision will star Kathryn Hahn as her fan-favorite character Agatha Harkness. Joe Locke (Heartstopper) and Aubrey Plaza (Hahn’s Parks and Recreation co-star, among her other many credits) are also in the cast, as is Patti LuPone. (A second WandaVision spin-off, this one focusing on Paul Bettany’s Vision, is also reportedly in the works.)\nCaptain America: Brave New World\nRelease date: August 26, 2024 (in Theaters)\nWe’ve got a new Captain America, so it was inevitable that we’d be getting a new Cap movie. Anthony Mackie will appear in the title role. Harrison Ford was announced to take over the role of General Thaddeus Ross and will make his debut in this release.\nDaredevil: Born Again\nRelease date: Spring 2024 (On Disney+)\nCharlie Cox and Vincent D’Onofrio will return as Daredevil and Kingpin for an 18-episode Disney+ series. Jon Bernthal has signed on to reprise his role as the Punisher. Things remain uncertain for Foggy and Karen.\nThunderbolts\nRelease date: December 20, 2024 (In theaters)\nMarvel Studios is readying a movie based on the comic Thunderbolts and director Jake Schreier has been tapped to bring it to life. This film marks the end of Phase Five of the Marvel Cinematic Universe. Steven Yeun (Nope) signed on for an undisclosed role\nBlade\nRelease date: February 14, 2025 (In theaters)\nDisney hasn’t revealed much about this reboot of the franchise that features a badass vampire-hunter who is also a vampire, but we know that it stars two-time Academy Award winner Mahershala Ali, who also played Cornell “Cottonmouth” Stokes in Netflix Marvel series Luke Cage. We also know Blade appeared (or at least his voice did) in the end credits of The Eternals. After losing director Bassam Tariq, who would have been the first U.S.-Pakistani person to helm a Marvel Studios film, Blade was put on pause, and its release date was shifted. But now it has a new director in place: Lovecraft Country’s Yann Demange, as well as a writer in Michael Starrbury, so the September 2024 date looks ever more likely.\nDeadpool 3\nRelease date: May 3, 2024 (In Theaters)\nRyan Reynolds’ “merc with the mouth” is set to appear in Disney’s first R-rated film following the company’s completed acquisition of Fox assets. Oh, and did you happen to hear that Hugh Jackman’s Wolverine is also appearing in this one? Unless you are cut off from all social media, you no doubt caught that announcement.\nDeadpool 3 writers Rhett Reese and Paul Wenick spoke with Den of Geek about how Deadpool’s move to the MCU will not affect the feel of the movie. Or, in Wernick’s words: “Deadpool’s gonna be Deadpool.” Reese also said that Disney has been more than willing to ensuring the franchise keeps its core identity. Shawn Levy (Free Guy) is directing.\nFantastic Four\nRelease date: May 2, 2025 (In theaters)\nPhase Six of the Marvel Cinematic Universe, kicks off with the MCU debut of Marvel’s most famous family. Jon Watts was scheduled to directbut he is no longer doing that—Matt Shakaman of WandaVision is now in the chair—and though we saw John Krasinski as Mr. Fantastic in Doctor Strange in the Multiverse of Madness, there’s no guarantee he returns.\nAvengers: The Kang Dynasty\nRelease date: May 1, 2026 (In theaters)\nSince neither Phase Four or Phase Five ended with Avengers movies, Phase Six will end with two, back to back. The first is The Kang Dynasty, a title which heavily suggests that Kang (Jonathan Majors) will play a major role. Destin Daniel Cretton (Shang-Chi) will direct.\nAvengers: Secret Wars\nRelease date: May 7, 2027 (In theaters)\nIt all comes down to this. Phase Six, and the whole Phase 4-6 arc of the Multiverse Saga, ends with Secret Wars. We don’t know anything about the plot other than the comics that the title is based on; Marvel veteran Michael Waldron (Loki, Doctor Strange in the Multiverse of Madness) is writing the script.\nArmor Wars\nRelease date: Unknown (In theaters)\nThis project—originally slated for a Disney+ series, but now getting the feature film treatment—will follow James Rhodes (Don Cheadle) as he tracks down stolen tech that allows criminals to replicate Iron Man technology.\nAlso: Marvel slotted several other projects for Phase Six that take place alongside Fantastic Four and the Avengers films. There are two in fall 2024, two in winter 2024, one in winter 2025, two in spring 2025 and two in summer 2025. Some of those are probably…\nUnscheduled But Probably Still Happening Shows & Movies\nMoon Knight Season 2\nRelease date: Unknown (On Disney+)\nMoon Knight himself, Oscar Isaac, was recently spotted in Egypt and teased that a second season of his show could be on the way. Marvel and Disney have yet to confirm.\nMarvel Zombies\nRelease date: Unknown (On Disney+)\nThis new animated show is loosely spun out from a breakout episode of What If? that saw MCU heroes battling a zombie apocalypse.\nSpider-Man: Freshman Year\nRelease date: Unknown (On Disney+)\nDisney says this new animated series follows Peter Parker “on his way to becoming Spider-Man in the MCU, with a journey unlike we’ve ever seen and a style that celebrates the character’s early comic book roots.”\nWhat if…? Season 2\nRelease date: Unknown (On Disney+)\nThe speculative animated series and its omnipresent narrator the Watcher will return with an all-new season. The show’s creators say next season will focus on new stories, new heroes, and “lots of fun.” Though the trailer still hasn’t been released, the Marvel Animation Panel at San Diego Comic Con revealed some Phase 4 characters that will be in the show.\nUntitled Wakanda Series\nRelease date: Unknown (On Disney+)\nNot much is known yet about this show set in Black Panther’s home country.\nUntitled Shang-Chi sequel\nRelease date: Unknown (In theaters)\nShang-Chi’s debut movie was compelling, exciting and fun. It also made a ton of money, so a sequel is inevitable. That the film’s director is making Avengers: The Kang Dynasty does throw it into limbo a bit.\nUntitled Wonder Man series\nRelease date: Unknown (On Disney+)\nMarvel Studios has announced that it’s moving ahead with a Wonder Man series. Shang-Chi and the Legend of the Ten Rings director Destin Daniel Cretton is attached to helm and Brooklyn 99 writer Andrew Guest (who also produced Hawkeye) is on board to showrun the series. On October 31, the title star was announced: genre favorite Yayha Abdul-Mateen II.\nUntitled mutants movie\nRelease date: Unknown (In theaters)\nNow that Disney owns the old Fox assets that included all the “mutant” Marvel superheroes, you can very likely count on characters like the X-Men making an MCU debut.\nWant more io9 news? Check out when to expect the latest Marvel, Star Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about the future of Doctor Who."
    },
    {
      "url": "https://gizmodo.com/doctor-who-release-dates-streaming-ncuti-gatwa-rtd-1849745140",
      "text": "At a Glance:\nDoctor Who ended the eras of both Chris Chibnall as series showrunner and Jodie Whittaker as the 13th Doctor in 2022 with “The Power of the Doctor,” bringing to a close a three-season, three-special run.\nWhittaker’s replacement is returning star David Tennant. He will play the official 14th incarnation of the Doctor under returning showrunner Russell T. Davies, who revived Doctor Who in 2005 and managed the series until 2009.\nTennant will appear in three specials in November 2023 to coincide with the 60th anniversary of Doctor Who on November 23.\nHe’ll be joined by returning characters Donna Noble and Wilfred Mott, who were played by Catherine Tate and Bernard Cribbins in season four of Doctor Who. Neil Patrick Harris will play a new villain, while Heartstopper’s Yasmin Finney will play a character named Rose.\nTennant will be succeeded by Sex Education’s Ncuti Gatwa as the 15th Doctor. His announcement in May 2022 makes him the first Black male actor to play the character on-screen.\nGatwa will star in Doctor Who’s 14th season, set to air some time in 2024.\nMillie Gibson will co-star as the 15th Doctor’s companion.\nGame of Thrones star Indira Varma will play a mysterious character known as “the Duchess.”\nDoctor Who’s beloved tradition of doing a Christmas Special—no more New Year’s Day Specials, in other words—will return in 2023, with another confirmed for 2024.\nComedian Sooz Kempner will star in Doom’s Day, a new transmedia Doctor Who campaign tied into the anniversary. She’ll play Doom, the titular intergalactic assassin, who has found herself hunted by Death itself—and must use a purloined vortex manipulator with a day’s worth of time-jumping charge to find the Doctor and save herself.\nThis post was last updated 5/30/23.\nWhat’s Been Going on in Doctor Who?\nThree Doctor Who specials aired out the last days of Jodie Whittaker’s time as the Doctor in 2022. “Eve of the Daleks” saw the Doctor and her companions Dan (introduced in the prior 13th season, known as Doctor Who: Flux) and Yaz facing the titular iconic monsters in a time loop paradox. “Legend of the Sea Devils” revived the classic ‘70s monsters for a new adventure, while “Power of the Doctor” saw the 13th Doctor face off against the Master in an adventure that ultimately saw her mortally wounded, returning her companions to contemporary Earth while she regenerated into a new body.\nWhy Is David Tennant the Doctor Again? Is David Tennant Playing the 10th Doctor?\nWhittaker regenerated not into previously announced new Doctor Ncuti Gatwa, but David Tennant, who played the official 10th incarnation of the Time Lord from Christmas 2005 to New Year’s Day 2010, before reprising the role for Doctor Who’s 50th anniversary special, “The Day of the Doctor,” in 2013.\nWhile this marks his first return on-screen in the series since then, Tennant will not be playing the 10th Doctor, but the official 14th incarnation—and the character will be aware that they are both using a familiar form and are a new entity. Aside from the fact that Tennant is arguably the most popular actor to take on the role, so bringing him back for the 60th anniversary makes sense, there’s plenty of reasons Doctor Who can come up with as to why the Doctor’s regenerative process decided to re-use an old identity, more of which you can read about here.\nWhen Will Doctor Who Return in 2023?\nDoctor Who will return for three special episodes in November 2023, set to air in celebration of the series’ 60th anniversary.\nWhat Is Doctor Who’s 60th Anniversary Special About?\nAside from Tennant returning as the Doctor, he’ll be joined by former companions Donna Noble and Wilfred Mott, played by Catherine Tate and Bernard Cribbins (the actor’s last role prior to his passing in July 2022) in Doctor Who’s fourth season. Donna exited the series as a regular character after an adventure lead to her needing to have her memory wiped by the 10th Doctor, forgetting her time alongside him lest her mind face grievous harm, so just how Donna will play into the the story remains to be seen.\nThe Doctor and Donna will face a mysterious new adversary, played by Neil Patrick Harris, and will be joined in the specials by Yasmin Finney as a new character named Rose. How Finney’s Rose might connect to the other famous Rose of Doctor Who, Billie Piper’s Rose Tyler, also remains to be seen.\nIs There a Trailer for Doctor Who’s 60th Anniversary?\nThe first premiered at the end of “The Power of the Doctor,” and you can watch it above. The second premiered in December and you can watch it here:\nWhen Will Ncuti Gatwa Become the Doctor?\nGatwa is briefly seen in the trailer for Doctor Who’s 60th anniversary, so will presumably follow the long tradition of new Doctors appearing in the final moments of their predecessor’s last episodes to become the 15th Doctor. The BBC has announced that Gatwa will appear as the Doctor first “over the festive season” in 2023, before he takes over full-time in a new season of the show after that.\nIs There a Doctor Who Season 14 Release Date?\nThere’s no current release date for season 14 of Doctor Who, but it is expected to be broadcast some time in 2024.\nWhere Is Doctor Who Streaming in the U.S. and UK?\nCurrently, the first 13 seasons of the revived Doctor Who are streaming on the BBC iPlayer in the UK; in the U.S., the revived series streams exclusively on HBO Max. In both countries, episodes from the classic era of the show are available through Britbox.\nThis will change in 2023, at least in the U.S. The BBC and Disney have announced that as part of a new deal, Doctor Who will stream exclusively worldwide on Disney+, except for in the UK and Ireland, where it will still stream on the BBC iPlayer and BBC One. It’s currently unknown if this will affect Doctor Who’s place on BBC America, where it currently airs in the U.S..\nDoes Disney Co-Own Doctor Who Now?\nA report in the wake of the BBC/Disney announcement from British paper the Telegraph alleged that the deal will also see Disney contribute finances to help create the show, and while the series’ creative team will still hold control of the series primarily, the deal will allow Disney some level of say in the creative decisions for the series—as well as allowing access to talent or “cinematic production moments” previously inaccessible due to the BBC’s budget for the show.\nNone of this has been confirmed by the BBC, however. The announcement strictly focused on Disney’s acquisition of Doctor Who’s streaming rights, and did not mention any co-owning. The new era of the series will be made for the BBC by Bad Wolf Studios, created by former Doctor Who producer Julie Gardner and former BBC Controller of Fiction Jane Tranter—which is now owned by Sony Pictures Television, after the studio took a majority stake in Bad Wolf in December 2021. The series was previously made by BBC Studios directly.\nIn January, Davies did say that Doctor Who is now working with a bigger budget, telling GQ that Disney’s involvement came about as part of “the BBC’s notion to go for a streamer to invest in the show worldwide … We’re not on the budget level with Star Wars and the Marvel shows, [but] it’s better than it was … We’re not allowed to talk about budget… but it’s more than I’ve ever had to work with.”\nWant more io9 news? Check out when to expect the latest Marvel,\nStar Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about James Cameron’s Avatar: The Way of Water."
    },
    {
      "url": "https://gizmodo.com/theres-something-wrong-with-the-children-horror-review-1849998960",
      "text": "There’s Something Wrong With the Children drops a big hint as to what it’s about with that title—but what’s wrong with the kids, as well as the adults surrounding them, not to mention how everyone got that way, are the prickly pleasures in Roxanne Benjamin’s (Creepshow, XX, Body at Brighton Rock) new film, written by written by T.J. Cimfel and Dave White (Intruders).\nAfter an eerie opening credits sequence that establishes the increasingly nightmarish red and green color scheme that runs throughout the movie, we meet an apparently average pair of couples: Ben (Midnight Mass’ Zach Gilford) and Margaret (Raising Dion’s Alisha Wainwright), and Ellie (Silicon Valley’s Amanda Crew) and Thomas (Gentefied’s Carlos Santos). The quartet has rented a pair of upscale adjacent cabins for some rural relaxation, with Ellie and Thomas’ precocious kids, Lucy (Briella Guiza) and Spencer (David Mattle), in tow.\nThere’s already some perceptible tension between Ellie and Thomas, the result of a recent transgression in their relationship, which we learn about in racy detail. The friction between Ben and Margaret is less obvious; we see them breezily deflecting any conversation about why they haven’t had their own children yet by explaining “We’re not kid people.” Privately, they mull over their decision—or more pointedly, exactly whose decision it was not to have kids in the first place.\nBen and Margaret gamely offer to baby-sit Lucy and Spencer overnight so their parents can get some alone time; though they’re flabbergasted when the kids aren’t in their beds the next morning, the audience is already primed for things to go off the rails. The children haven’t been acting right since the prior day’s hike into an abandoned structure the group discovered deep in the woods, an otherwise unremarkable ruin containing what appears to be a bottomless pit. “The place that shines,” the kids murmur, and since they’re bilingual, their enchantment spills out in two languages: “Es brillante.” When the kids return from their unplanned absence, well—read the movie title, though only a frantic Ben realizes it at first.\nThere are countless horror movies about spooky children, and quite a few that narrow that storyline to changeling tales; there are also lots of movies about bad things that happen in the woods. There are even several films that hinge on the presence of a giant, sinister hole. There’s Something Wrong With the Children—which is stylishly directed, with a perfectly off-putting electronic soundtrack—takes all of those elements and weaves them into a tale that makes kids into monsters, but also scrutinizes how adults, both parental and childless, react to what rapidly becomes an increasingly awful kid-centric situation.\nAmong a strong cast, Wainwright is particularly magnetic as a woman who’s long since declared she doesn’t want to have kids, so much so that she doesn’t really think about it anymore—until circumstances force her to reevaluate what went into that choice. The movie is also made especially effective by the performances of Guiza and Mattle, who are perfectly cast and have creepy energy to burn.\nThere’s Something Wrong With the Children is available now on digital and On Demand; it’ll arrive on MGM+ March 17.\nWant more io9 news? Check out when to expect the latest Marvel, Star Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about the future of Doctor Who."
    },
    {
      "url": "https://gizmodo.com/star-trek-release-dates-where-to-stream-picard-discover-1848839650",
      "text": "Trying to keep track of what’s coming in the realm of Star Trek feels like trying to stop a tribble from procreating. Before even more new series are announced, here’s our guide of when to expect all the new Star Trek shows, as well as returning familiar favorites, and what else is in the works right now. Engage!\nThis post was last updated 7/14/23.\nCurrently Airing: Star Trek: Strange New Worlds Season 2\nThe Enterprise is back after a successful first season, and this time Captain Kirk will be along for the ride with another appearance by Paul Wesley after his surprise finale role in season one. Not much else is known about the season so far, other than one episode will see the show crossover with Star Trek: Lower Decks in a live-action/animated hybrid directed by The Next Generation’s Jonathan Frakes. The show has also been renewed for a third season.\nSeason two recaps:\n“Tomorrow and Tomorrow and Tomorrow”\n“Charades”\nUpcoming: Star Trek: Lower Decks Season 4\nThe third season of the animated series following the misfit crew of the USS Cerritos—and in particular its cadre of ensigns, Mariner (Tawny Newsome), Boimler (Jack Quaid), Tendi (Noël Wells), and Rutherford (Eugene Cordero)—once again followed our heroic ensigns and the remaining bridge officers aboard the Cerritos. Season four will be arriving in late summer. The show has also been renewed for a fifth season.\nUpcoming: Star Trek: Discovery Season 5\nExpected in early 2024, Discovery’s fifth season will be 10 episodes long, down from the 13 of prior seasons. In the wake of season four‘s climax earlier this year, Michael Burnham (Sonequa Martin-Green) led her crew in a desperate attempt to save the galaxy from a mysterious anomaly created by an extra-galactic race, ensuring peace and stability for the Federation once more… for now. As her romantic partner Book (David Ajala) pays time for his own role in a campaign to surreptitiously destroy that anomaly, we’re not sure what awaits Burnham and Discovery’s crew just yet, but given this show, we’re sure it’ll be very, very dramatic.\nIn Flux: Star Trek: Prodigy Season 2\nThe animated series aimed at younger Trek fans (and Janeway fans!) and kids at heart can be found on both Nickelodeon and Paramount+. The first season was divided into two parts, with part two wrapping up at the end of 2022; after Paramount+ announced it would not move forward with the show’s already greenlit season two, it was removed from the service. (A home release of the complete first season is still possible; the first 10 episodes are still available for purchase.) Fans are still waiting to hear if Prodigy season two will surface on a different outlet.\nUpcoming: Starfleet Academy\nIt’s really happening! After a long tease, filming on this series will begin in 2024. Here’s the official announcement from co-showrunners and executive producers Alex Kurtzman and Noga Landau:\n“Admission is now open to Starfleet Academy! Explore the galaxy! Captain your destiny! For the first time in over a century, our campus will be re-opened to admit individuals a minimum of 16 Earth years (or species equivalent) who dream of exceeding their physical, mental and spiritual limits, who value friendship, camaraderie, honor and devotion to a cause greater than themselves. The coursework will be rigorous, the instructors among the brightest lights in their respective fields, and those accepted will live and study side-by-side with the most diverse population of students ever admitted. Today we encourage all who share our dreams, goals and values to join a new generation of visionary cadets as they take their first steps toward creating a bright future for us all. Apply today! Ex Astris, Scientia!”\nUpcoming (movie): Star Trek: Section 31\nAnnounced as a TV series back in 2019 as a spinoff for fan-favorite Discovery guest star Michelle Yeoh, this plunge into the seediest side of Starfleet—the shadowy spy organization Section 31 first introduced in Deep Space Nine—is now planned as a Paramount+ film.\nNewly minted Oscar winner Yeoh will return as former emperor of the Mirror Universe’s Terran Empire, Phillipa Georgiou, now turned into a kinder, but still kickass person by her time with Michael Burnham. “I’m beyond thrilled to return to my Star Trek family and to the role I’ve loved for so long,” Yeoh said in a statement. “Section 31 has been near and dear to my heart since I began the journey of playing Philippa all the way back when this new golden age of Star Trek launched. To see her finally get her moment is a dream come true in a year that’s shown me the incredible power of never giving up on your dreams. We can’t wait to share what’s in store for you, and until then: live long and prosper (unless Emperor Georgiou decrees otherwise)!”\nWritten by Craig Sweeny and directed by Olatunde Osunsanmi, Star Trek: Section 31 will start production later this year, and eventually come to Paramount+.\nWhere Can I Stream Classic Star Trek Shows?\nThat’s all the new bits of Star Trek coming. But what about the old Star Trek? In the U.S. at least, the vast majority of classic Star Trek shows are available exclusively to stream on Paramount+ (albeit not without issues), although some holdouts remain on other streaming services. Here’s a full list of classic Star Trek shows and where to stream them, as well as links to our recommended episode guides for every series!\nStar Trek: The Original Series (Paramount+)\nStar Trek: The Animated Series (Paramount+)\nStar Trek: The Next Generation (Paramount+, Netflix)\nStar Trek: Deep Space Nine (Paramount+, Netflix)\nStar Trek: Voyager (Paramount+)\nStar Trek: Enterprise (Paramount+)\nWant more io9 news? Check out when to expect the latest Marvel and Star Wars releases, what’s next for the DC Universe on film and TV, and everything you need to know about House of the Dragon and Lord of the Rings: The Rings of Power."
    },
    {
      "url": "https://gizmodo.com/weapons-is-a-terrifying-fascinating-excellent-character-driven-horror-movie-2000635404",
      "text": "Zach Cregger’s latest movie, Weapons, is unforgettable. And not only because it’s intense, gross, and fascinating, which it is. It’s that the premise of the movie is so smart, seductive, and deeply disturbing that we’d gladly watch a bad movie about it just to find out more. Thankfully, Cregger is able to build off his ingenious idea and deliver a constantly surprising and often horrific mystery that blends drama and scares in a way that creates something truly special.\nThe aforementioned premise of Weapons is, what if a schoolteacher walked into her classroom one morning and no one was there? Everyone else at the school is there. But for this one teacher, her class is missing. Making things worse, each and every student woke up at the exact same time in the middle of the night, ran out of their house, and never came back. What would that do to the teacher? What would that do to the community? What would that do to the parents? And what the heck actually happened?\nWritten and directed by Cregger, Weapons answers all those questions and more in an interconnected tale inspired by the sprawling epics of filmmakers like Robert Altman and Paul Thomas Anderson. The film goes character by character through the story, with each section providing new answers as well as questions, all building to not just the reveals you are waiting for, but shocks and gore that are wholly unpredictable and super satisfying.\nThe first of those characters is Justine, played by Julia Garner. Justine is the teacher whose class is missing, and, of course, she becomes the scapegoat for the whole thing. Surely, she organized it. Surely, she knows something. And as more people get increasingly angry with and suspicious of her, we feel not just sympathy but a whole new kind of fear. There’s also Archer, played by Josh Brolin. He’s the father of one of the missing kids who blames Justine and decides to take the investigation into his own hands, turning up a few very unsettling revelations. Next up is Paul, played by Alden Ehrenreich. He’s a local police officer with a questionable past who takes the story into even more directions. And on and on it goes through a few other characters you meet throughout the story.\nIn each of these sections, Cregger gives things a slightly different energy that keeps the movie moving. He also ends them all on a bit of a cliffhanger that lingers as we go into the next section. Plus, the sections cross over, so we see events from different points of view. This not only provides great character moments and drama, but it allows us to feel more fully invested in the story and keeps us filled with anxiety. Often, we feel like we know everything about a certain person or event, but a few minutes later, it’s flipped on its head entirely. Then there are scenes and reveals that happen and don’t come back for a while, laying on even more lingering anticipation.\nEach story has its fair share of jump scares and gross-outs, but those definitely become more prevalent as the film goes on. It’s clear Cregger wants us to really live with this messed-up situation and explore what it’s doing to these characters. He wants us to ponder how we would handle it. That slow burn of it all is maybe the only real criticism of Weapons. It hides its secrets for a very long time and backloads many of its more traditional horror elements. However, doing that also helps make those scenes even more shocking and satisfying. By the time answers arrive, they do so with a blood-soaked, jaw-dropping carnage that delivers sweet, sweet catharsis.\nCregger’s previous film, Barbarian, shares some of Weapons‘ DNA but had a few wild pivots that made it feel like two or even three movies slapped into one. Weapons is not that. It’s cohesive in a very assured way, with everything both fitting, and not, for just the right reasons. It’s a movie that will scare you, surprise you, make you laugh, make you cheer, and make you cover your eyes as you slowly learn how these kids disappeared. And, by the end, the fact it’s called Weapons not only makes sense, it makes the movie even more disturbing.\nCo-starring Austin Abrams, Benedict Wong, Amy Madigan, June Diane Raphael, and Cary Christopher, Weapons opens August 8.\nWant more io9 news? Check out when to expect the latest Marvel, Star Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about the future of Doctor Who."
    },
    {
      "url": "https://gizmodo.com/the-50-spookiest-kids-in-horror-movies-ranked-1781681290",
      "text": "There’s something exquisitely dreadful about scary little kids. Children aren’t supposed to be vicious killers—but they’re also not supposed to die young and lurch back from the grave with a vengeance. Horror movies, of course, can’t get enough of ’em. Here are 50 terrifying tykes that make us grateful that we didn’t spawn.\n50) Jump-Rope Girls, A Nightmare on Elm Street\nThe jump-roping girls who sing the world’s scariest nursery rhyme (“One, two, Freddy’s coming for you…”) are presumably victims of the Elm Street maniac. They never do much of anything other than appear in ghostly slo-mo. But they’re like an early Freddy warning system: anytime they show up, ol’ razor-fingers is never far behind.\n49) Dennis, Cabin Fever\n“PANCAKES!!!” The best weird scene in this movie. Maybe the best weird scene in any movie.\n48) Jumby, The Unborn\nDavid S. Goyer took a break from Batman and Blade to direct this tale of a woman (Odette Annable) who is haunted by an evil spirit that takes the form of her long-dead twin brother. Ergo, a glaring, corpse-like tyke appears at regular intervals—including on the movie poster, which is conveniently set in a bathroom so Annable has an excuse to be underwear-clad.\n47) Lilith, Case 39\nRenée Zellweger plays a Child Protective Services social worker who rescues a 10-year-old girl from what appears to be abusive parents… or so she thinks. In fact, the kid is a demonic Succubus whose talents include making Bradley Cooper vomit up swarms of hornets.\n46) Brahms, The Boy\nIt’s a doll! It’s a possessed doll! It’s a doll that comes alive? You might guess the twist in The Boy long before it’s revealed, but this movie, which takes place in a cavernous old house for good measure, offers a one-two punch that preys on fears of lifelike dolls and evil children.\n45) Youth Gang, Eden Lake\nVacation tip: if you decide to go camping in an isolated wilderness, make sure there’s not a torture-crazed gang of teenage baddies lurking about, poised to prevent you from making it home in one piece.\n44) Samantha, Stir of Echoes\nKevin Bacon’s character, a regular workin’ man named Tom, is blessed with an unusually intuitive young son—but the real spooky kid is a tormented teenage girl who suddenly begins popping up in Tom’s nightmares. The whole “ghost looking for justice so it can rest in peace” storyline has been done dozens of times, but Bacon makes everything better.\n43) Dark Alessa, Silent Hill\nEverything in the town of Silent Hill is spooky. But the little girls are extra-spooky.\n42) Esther, Orphan\nWell, we couldn’t very well make this list without this little lady, despite that incredible last-act reveal.\n41) Laddie, The Lost Boys\nGranted, most of the vampires in this movie are rad dudes with mullets, but who could forget half-vampire Laddie, the junior member of the crew?\n“It’s the attack of Eddie Munster!”\n40) Virginia, Spider Baby\nJack Hill’s morbid comedy imparts the strange story of a family with some very particular eating habits, as well as an odd disease that makes them act much younger than their apparent ages.\nJill Banner was 18 when she played the title character, arachnid-obsessed Virginia. An essential cult movie.\n39) The Children, The Children\nJust look at that movie title. (And its tagline: “You brought them into this world… now, they will take you out.”) This is a film that’s deeply committed to the theme we’ve got going on here. It’s also a cautionary tale about why you shouldn’t pack a bunch of kids into a house in the middle of nowhere over the snowy holidays, because one of ’em is liable to start spreading an illness around that turns shorties into bloodthirsty maniacs.\n38) Kevin, We Need to Talk About Kevin\nTilda Swinton gives an agonizingly great performance as the guilt-ridden mother of a kid who’s born bad and grows up to commit mass murder at his high school. Ezra Miller is chilling as the teenage psychopath, but the actors who play Kevin’s younger incarnations are also scary as hell. Even jaded horror fans might find it hard to sleep after watching this disturbing film.\n37) Victoria and Lilly, Mama\nWhen a pair of long-missing sisters is found living in the woods, their uncle and his girlfriend take them in, not realizing the feral girls will be bringing their supernatural protector with them. “Mama” is the main scare-giver here, but the kids (particularly the younger girl) serve up plenty of unease, too.\n36) Alice, Alice Sweet Alice\nThis early entry into the slasher genre features the film debut of Brooke Shields—but don’t get too attached to her character, because she dies early after being attacked by an unseen assailant. Did her 12-year-old sister Alice do it?\nOr is there some other killer running about, clad in that horrific raincoat ‘n’ mask combo?\n35) Dalton, Insidious\nThe foreboding poster says a lot… though, technically, this poor kid spends most of the movie in a coma-like state as his mind roams the spirit world.\n34) Bughuul’s Little Helpers, Sinister\nIt takes Ethan Hawke the entire movie to figure out exactly who’s acting on behalf of that pagan demon that keeps popping up in everyone’s home movies, but we’ll just ask you this: have you checked the children?\n33) Eli, Let the Right One In\nMaybe the most sympathetic child vampire in all of cinema, but a vampire nonetheless.\n32) The Brood, The Brood\nThis is one of David Cronenberg’s most shocking, disturbing films—which is really saying something. It might be a stretch to call the creatures in this movie “children,” but whatever they are, they emerge out of Samantha Eggar’s body, and they are absolute missiles of rage.\n31) Mutant Baby, It’s Alive\nFrom the mind of B-movie master Larry Cohen came this sordid tale of a mutant baby—thanks, shady pharmaceutical company—that’s born ready to kill anything that gets in its way. Followed by two progressively sillier sequels, It Lives Again and It’s Alive 3: Island of the Alive.\n30) Joshua, Joshua\nSomething’s amiss with Sam Rockwell and Vera Farmiga’s child-prodigy son. Very amiss. Like, taunting-your-dad-into-abusing-you-in-public-so-he-goes-to-jail amiss, or killing-your-grandma-by-shoving-her-down-the-stairs amiss. Diagnosis: the pint-sized genius is a stone-cold psycho.\n29) Charlie, Firestarter\nShe’s not evil, per se, but she’s extremely spooky. And you definitely don’t want to make her angry.\n28) Sam, The Babadook\nThe child in this movie isn’t technically the monster—he’s a different kind of menace entirely.\nThough his brattiness (and how it affects his struggling mother) is an intentional, integral part of what The Babadook is all about, it’s still very, very, very difficult to watch.\n27) Ghost Girl, Kill Baby… Kill!\nEven Italian horror master Mario Bava made a movie with a spooky kid in it.\n26) Tiny Terrors, Them\nNo, not the Them! with the giant ants in it. This Them, a stripped-down suspense thriller, hails from France but is set in a remote part of Romania where a young couple comes under attack one night. Who could possibly be skulking around, making prank calls, messing with their cars, and generally causing bumps in the night? HINT: think small.\n25) Su-mi and Su-yeon, A Tale of Two Sisters\nA teenage girl is discharged from a mental hospital and into the care of her deliriously dysfunctional family, which includes her beloved younger sister and her hated stepmother. It’s not always obvious what’s really real and what’s actually happening in the main character’s imagination, which makes Kim Jee-woon’s lush, gory film a gleefully mind-warping treat.\n24) Emily and Jack, Home Movie\nAs the title suggests, this is a “found footage” exercise about a rural New York state family with 10-year-old twins who start acting out in violent, distressing ways. Naturally, the camera never stops rolling.\n23) Santi, The Devil’s Backbone\nMade before Guillermo del Toro became a household name with Hellboy and Pan’s Labyrinth, this Pedro Almodóvar-produced indie is set at an orphanage during the Spanish Civil War.\nA haunted orphanage, naturally, that’s chock-full of dark secrets.\n22) Baby Sadists, Devil Times Five\nBefore he found fame as a teen dream, Leif Garrett starred in this nutty movie about a gang of crazy kids who survive a van accident and promptly begin terrorizing the inhabitants of a nearby ski lodge. One of them is Sorrell Booke, before he found fame as Boss Hogg on The Dukes of Hazzard.\n“If you take them in, YOU’LL be taken in!” …by little ragamuffins who’re likely to pull some nasty pranks, like dumping your piranha collection into the bathtub while someone’s using it.\n21) Jason, Friday the 13th\nYou thought the movie was over.\nYou thought wrong.\n20) Karen, Night of the Living Dead\nA group of strangers gathers in a farmhouse during a zombie outbreak, not realizing that there’s already an almost-zombie in their midst: 11-year-old Karen, hiding in the basement with her parents. Of course, once she goes full zombie, she makes short work of Mom and Dad. Fun fact: child actor Kyra Schon was the real daughter of Karl Hardman, who played her father onscreen.\n19) Carol Anne, Poltergeist\nCarol Anne Freeling’s innocently chipper delivery of “They’re heeeere!”—heralding the arrival of angry supernatural beings eager to kidnap her into their midst—is almost as spooky as her big brother’s clown doll.\n18) Tomás, The Orphanage\nAs with many films on this list, a grown-up character is the true villain in The Orphanage. That said, this pint-sized lost soul is completely terrifying every time he appears.\n17) High-Rise Hooligans, Citadel\nA gang of hoodie-wearing kids terrorizes the few remaining residents of a broken-down apartment complex, including a pregnant woman and her husband. When the wife dies as a result of a horrific attack, her grieving widower does his best to protect their infant daughter from a menace that might not be entirely human. Irish director Ciaran Foy made such an impression with his skin-crawlingly effective debut that he was hired to direct Sinister 2.\n16) Michael, Halloween\n“I met this 6-year-old child with his blank, pale, emotionless face, and the blackest eyes—the Devil’s eyes. I spent eight years trying to reach him, and then another seven trying to keep him locked up, because I realized that what was living behind that boy’s eyes was purely and simply… evil.”\n15) Mercy and Jonas, The Witch\nThere’s an evil, baby-stealing witch lurking in the woods. A pity she didn’t also snatch up the main character’s screechy, manipulative twin siblings.\nWhat seems like annoying kid stuff gets deadly serious once it’s established that the family farm is home to a most unusual goat. What has Black Phillip been whispering to the children? Nothing good.\n14) Alpine Assassin, Phenomena\nDario Argento’s cult horror film is noted for casting a Labyrinth-era Jennifer Connelly as its lead, as well as for using Iron Maiden and Motorhead on the soundtrack (in addition to Argento’s usual synth-music suspects Goblin). It also features memorable turns by Halloween’s Donald Pleasence and “Tanga” as “Inga,” his character’s chimpanzee assistant. Oh, and also a hideously disfigured serial killer. Can you guess what age group he’s in?\n13) Henry, The Good Son\nIt’s Elijah Wood versus Macauley Culkin in a battle of the early-1990s kid stars! When the movie came out in 1993, it was just one year post-Home Alone 2, and audiences were startled to see lovable scamp Kevin McCallister cast as a psychopath so beyond redemption that his own mother drops him off a cliff at the end. (As it happens, Culkin’s famously overbearing stage dad was the reason he was cast; it was a condition of his agreeing to allow his son to do the Home Alone sequel in the first place.)\n12) Gage, Pet Sematary\nAnd thaaaaat’s why you don’t bury your dead toddler in a cursed cemetery.\n11) The Baby, Rosemary’s Baby\nSatan’s son is so scary we don’t even get a look at him. We just get Rosemary’s reaction to seeing the infant she gave birth to for the first time. The sudden musical cue, combined with Mia Farrow’s palpable horror, is just perfect.\n“GOD IS DEAD, SATAN LIVES!”\n10) Platinum Mafia, Village of the Damned\nThere have been multiple cinematic versions of this tale, but—apologies to John Carpenter—the classic take is the 1960 version.\nIt’s set in a British town that experiences a baby boom after a mysterious incident in which the entire population loses consciousness. The freaky-eyed offspring are, of course, not of natural origin, and it’s soon apparent they can read minds and control them, too. Diabolically.\n9) Kiddie Cultists, Children of the Corn\nMultiple Stephen King-derived films are on this list; the dude just loves to write about scary kids. But Nebraska’s sacrifice-happy, youthful cult of “He Who Walks Behind the Rows” is a particularly chilling creation.\nhttps://www.youtube.com/watch?v=vdG1w-caaWk\nFun fact: diminutive actor John Franklin, who also played Cousin Itt in The Addams Family movies, was actually in his mid-20s when he played preacher Isaac. He later retired from show biz and is now a high-school teacher.\n8) Damien, The Omen\nThe toddler Antichrist barely has any dialogue in the movie, but oooooh that stare is heavy.\n“It’s all for you, Damien!”\n7) Cole, The Sixth Sense\n“I see dead people!”\nhttps://www.youtube.com/watch?v=QUYKSWQmkrg\nChild actor Haley Joel Osment and writer-director M. Night Shyamalan both got Oscar nominations—but only one of the two formed an unbreakable addition to twist endings. Like a few tots on this list, Haley’s character isn’t evil, but you still would not want to babysit him.\n6) Toshio, Ju-On/The Grudge\nTakashi Shimizu directed both the Japanese original and the American remake (as well as each film’s first sequel), and both take place in Japan. So there’s some continuity with the series’ vengeful supernatural entities, including ghostly little Toshio, who died young and is mad as hell about it. Here he is with A+ crazy eyes in the 2002 original:\nMEOW!\n5) Sadako and Samara, Ringu/The Ring\nAnother J-horror film that enjoyed a successful do-over aimed at American audiences (I can’t wait for the crossover film that’ll pit The Grudge against The Ring; check out the trailer here). But while Toshi has back-up from his equally spooky mother, The Ring’s nightmares spiral from one little inky-haired girl, who victimizes anyone who watches a certain cursed videotape. Sadako was re-named Samara for the stateside remake…\n…but let’s face it, she’s terrifying in any language.\n4) Wee Mob, Who Can Kill a Child?\nIn this gleefully nasty Spanish oddity, a man and his pregnant wife are on vacation, sailing around, when they encounter an island filled with children. Malevolent children, who can pass their bloodthirsty urges to any other child simply by looking at them. This includes looking at babies that haven’t been born yet, which ends up being just as awful as it sounds. Bonus points for having one of the most shamelessly provocative movie titles of all time.\n3) The Grady Twins, The Shining\nForever and ever and ever.\n2) Regan, The Exorcist\nYes, Pazuzu is freaky, with the pea soup and the crucifix misappropriation and whatnot. But one of the scariest scenes in the whole movie takes place when Regan is just beginning to transform into something… not herself. It’s during her mother’s dinner party, when the nightgown-clad girl wanders into the room and delivers a very dark message to the astronaut in the group.\nAnd then she pees on the carpet, which makes it a thousand times more intense.\n1) Rhoda, The Bad Seed\nRhoda Penmark looks just like a little angel, and she always gets what she wants. When she doesn’t, she makes short work of anyone who gets in her way.\nPatty McCormack originated the role of Rhonda on Broadway, and was Oscar-nominated for her performance in the film. The movie is six decades old, but Rhoda—without benefit of any supernatural powers, and never seen with a hair out of place—is just as scary today as she was in 1956."
    },
    {
      "url": "https://gizmodo.com/warner-bros-dc-release-dates-hbo-max-cast-details-1848354161",
      "text": "The DC Extended Universe is finally giving Marvel a run for its money—something that’s bound to increase now that James Gunn is running the show. The DCEU’s myriad projects stretch far beyond superhero mainstays Batman, Superman, and the Justice League, promising to include new and interesting takes on DC Comics’ enormous stable of characters.\nWhat follows is an up-to-date list of everything DCEU-related that’s on the way: DC movies heading to theaters, as well as DC streaming movies and shows coming to Max.\nLast updated 8/23/2023.\nWhat’s the next DC Movie?\nAquaman and the Lost Kingdom\nRelease date: December 20 (in theaters)\nDirector James Wan returns for the next adventure following Arthur Curry (Jason Momoa) as the newly crowned King of Atlantis. Now in his new role, Arthur will explore more of the world under the sea while also dealing with new threats from Black Manta (Yahya Abdul-Mateen II) and others. Like Shazam 2, Aquaman 2 has endured its share of release-date changes, with its new Christmas 2023 date designed to give Wan and company ample time to complete all the necessary special effects.\nUpcoming DC Movie Release Dates\nJoker: Folie à Deux\nRelease date: October 4, 2024 (in theaters)\nTodd Phillips never saw his Joker movie as anything but a singular film. But over a billion dollars at the box office and an Oscar for Best Actor (for star Joaquin Phoenix) obviously changed things. We have a few nuggets of info so far: the title is Joker: Folie à Deux(French for “shared madness”), Phoenix is returning and will co-star with Lady Gaga (who’s playing Harley Quinn), Zazie Beetz is probably returning as Arthur Fleck’s neighbor, and… it’s likely going to be a musical? Filming wrapped in early April 2023.\nThe Batman 2\nRelease date: 2025 (in theaters)\nHot off the success of Matt Reeves’ long-awaitedThe Batman, everyone involved made it clear that wasn’t a one-and-done. Robert Pattinson’s Batman will be back. Will he face off with the Joker? It’s possible but not definitive. You’d imagine the Penguin and Catwoman could be back too. We don’t know much yet about this one, but we do know it won’t be arriving until 2025.\nCurrent DC Shows\nDoom Patrol Season 4, Part 2\nRelease date: TBD 2023 (on Max)\nThe fourth and final season of Doom Patrol—starring Brendan Fraser, Matt Bomer, Diane Guerrero, April Bowlby, Joivan Wade, Timothy Dalton, Skye Roberts, and Michelle Gomez—already aired its first batch of episodes; the remaining six will return later this year.\nUpcoming DC Movies and Shows Without Release Dates\nThe Penguin\nRelease date: Unknown (on Max)\nYou saw him in The Batman and now, Colin Farrell’s Penguin is getting his own Max series. As of April 2023, the show is in production, with a cast that also includes Cristin Milioti, Rhenzy Feliz, Michael Kelly, Shohreh Aghdashloo, and Deirdre O’Connell, with Clancy Brown and Michael Zegen recurring.\nPeacemaker Season 2\nRelease date: Unknown (on Max)\nFrom the instant that opening credits scene rolled for the first time, DC fans and non-fans alike fell in love with Peacemaker. Well, he’s coming back, still played by John Cena and still from the twisted mind of James Gunn. There’s no word on when it’ll happen but we’re guessing 2024.\nSuperman: Legacy\nRelease date: July 11, 2025\nJames Gunn will write and direct this Superman movie, which is touted as not being an origin story. Casting announcements started with Clark Kent/Superman and Lois Lane, who’ll be played by David Corenswet and Rachel Brosnahan. We also know Isabela Merced will play Hawkgirl, Edi Gathegi is Mister Terrific, and Nathan Fillion is a Green Lantern (Guy Gardner), as well as Anthony Carrigan as Metamorpho.\nMore Upcoming DC Movies and Shows Announced for the Gunn/Safran Era\nThe shake-up at DC Studios got a huge zap of energy at the end of January, when James Gunn and Peter Safran announced their massive slate of planned projects. Little is known about most of these projects so far in terms of cast and crew and even release dates—but we do have a few tidbits for each.\nCreature Commandos (An animated Max show) – A seven-episode animated series written by James Gunn himself. It stars Indira Varma (Obi-Wan Kenobi, Game of Thrones) as the Bride, who’s the lead character, and Marvel veteran Frank Grillo as Rick Flagg Sr.—father of Rick Flagg, played by Joel Kinnaman in The Suicide Squad. The rest of the cast includes David Harbour (Stranger Things) as Eric Frankenstein, Sean Gunn (Guardians of the Galaxy Vol. 3) as G.I. Robot, Zoe Chao (The Afterparty) as Nina Mazursky, Alan Tudyk (Star Wars: Rogue One) as Dr. Phosphorus, Maria Bakalova (Guardians of the Galaxy Vol. 3) as new character Princess Ilana Rostovic, and Peacemaker’s Steve Agee and Sean Gunn returning as John Economos and Weasel, respectively.\nWaller (A live-action Max show) – Viola Davis will reprise her Suicide Squad character; the story will bring back characters from the Peacemaker show and tell a story with events set between Peacemaker seasons one and two.\nLanterns (A live-action Max show) – Set on Earth, this mystery series will follow Hal Jordan and John Stewart doing their thing as DC’s “super cops.”\nThe Authority (Theatrical film) – The Wildstorm superhero characters will make their big-screen debut in a film co-written by Gunn.\nParadise Lost (A live-action Max show) – How did Wonder Woman’s world, Themyscira, come to be? Find out in this Game of Thrones-ish tale set before her birth.\nThe Brave and the Bold (Theatrical film) – Based on the acclaimed Grant Morrison comic run, this will explore the story of Batman’s son, Damien Wayne, and will feature “other members of the extended Bat-family.”\nBooster Gold (A live-action Max show) – The “loser from the future” superhero character gets his own series.\nSupergirl: Woman of Tomorrow (Theatrical film) – Based on Tom King’s comics run, this movie will explore how Supergirl is different from Superman. It’s not yet certain if Sasha Calle, who plays Supergirl in The Flash, will reprise the role here.\nSwamp Thing (Theatrical film) – The character’s “dark origins” will be the focus of this one. DC does horror! Rumored but not yet confirmed to be directing, James Mangold (Indiana Jones 5) told Collider that he’s slated to write the script.\nUpcoming DC Movies and Shows That Were Once in Development, But Whose Fate Is Unclear in the Gunn/Safran Era\nTa-Nehisi Coates and J.J. Abrams’ Superman movie\nRelease date: Unknown (in theaters)\nThe news of Superman: Legacy cast uncertainty on this project from writer Ta-Nehisi Coates and producer J.J. Abrams. There hadn’t been an update on this one in a while, but in late April, James Gunn himself told io9 that the two films don’t necessarily cancel each other out: “That’s an exciting movie … if it comes in and it’s great … and if the timing is right, that could absolutely happen. That’s totally unrelated. It would be an Elseworlds tale like Joker.”\nMichael B. Jordan Superman Series\nRelease date: Unknown (for Max)\nMichael B. Jordan was once developing a Superman take for Max as a limited series that would feature Val-Zod as opposed to Clark Kent. Again, there hasn’t been an update in a while.\nStatic Shock\nRelease date: Unknown\nPart of the relaunch of the Milestone comic brand is this adaptation produced by, once again, Michael B. Jordan. A writer was hired back in 2021 to come up with a script and we haven’t heard much since.\nJustice League Dark\nRelease date: Unknown (for Max)\nJ.J. Abrams was among the people involved with bringing this evil super-team to life and while there hasn’t been a ton of movement on the project of late, it’s been around long enough that we’d imagine it happens eventually.\nMetal Men\nRelease date: Unknown\nOne of the more recent pre-Gunn/Safran DC films to go into development, this is this tale of six beings based on various powerful metals. It’s from directors Ron Clements and John Musker (Aladdin, The Little Mermaid, and Moana), so if it happens, it’ll have an incredible pedigree.\nZatanna\nRelease date: Unknown\nLast year, Emerald Fennell won an Oscar for writing Promising Young Woman. She followed that up landing the job to write this DC superhero flick about the young magician. Like most of the films in this section, there hasn’t been movement in a while.\nHourman\nRelease date: Unknown\nYes, the hero who takes a drug that makes him a hero for an hour was, back in 2021, rumored to be in development. Whether or not that’s still the case is unknown but we figured it was worth noting.\nUntitled Arkham Show\nRelease date: Unknown (on Max)\nIn addition to The Penguin, Matt Reeves has said he plans to expand the world of The Batman into Max shows. At one point, a series about Gotham PD was in the works, but now he says it might be more about the inner workings at Arkham Asylum. On October 25, The Staircase’s Antonio Campos came aboard as a writer—the third to hold that position on the potential series so far—and may direct and serve as showrunner if the show happens, according to a report in Variety.\nWant more io9 news? Check out when to expect the latest Marvel and Star Wars releases, what’s next for the DC Universe on film and TV, and everything you need to know about House of the Dragon and Lord of the Rings: The Rings of Power."
    },
    {
      "url": "https://gizmodo.com/weapons-runs-to-big-70m-global-opening-in-debut-weekend-2000641198",
      "text": "“Are you watching?” asks a creepy voice in the trailer for Weapons. And the answer to that question is a resounding “yes.”\nPer Variety, Zach Cregger’s sophomore outing earned $70 million worldwide. Domestically, its $42.5 million take was $10 million ahead of projections, and its overall take marks another win for New Line and parent company Warner Bros. Since Minecraft’s release in April, the studio has been on a money making hot streak thanks to Final Destination Bloodlines, F1: The Movie, Sinners, and Superman. Like several of those movies, Weapons has had a lot of momentum behind it thanks to its intriguing trailers and glowing pre-release buzz. Audiences sure seem to agree, since it’s got an “A-” consensus on CinemaScore, which is rare for a horror movie.\nFor the family-focused crowd—well, the other part of that crowd, since Weapons is about missing kids—Freakier Friday also did pretty well. Disney’s legacy sequel starring Lindsay Lohan and Jamie Lee Curtis made $44.5 million worldwide, led largely by its domestic take of $29 million. This one has also been marketed pretty heavily in recent months, and has the added bonus of bringing back much of the 2003 film’s cast and introducing new blood in Manny Jacinto, Sophia Hammons, and Julia Butters, the latter of whom get their bodies swapped with Lohan and Curtis.\nMeanwhile, older releases like Superman and Fantastic Four: First Steps continue to make some money. Analyst Luiz Fernando reports the Marvel Studios pic added $17.5 million to its international take in its third weekend, bringing its worldwide total to $434.2 million. Despite a 55.8% drop, it’s now earned more than Thunderbolts ($382.4 million) and Captain America: Brave New World ($415.3 million), and will likely to reach $490-510 million when all is said and done. And Superman continues to hold strong with $578.8 million worldwide. After becoming the highest-grossing domestic Superman movie last week, it’s poised to make (or exceed) $600 million worldwide before it hits streaming on August 26.\nWant more io9 news? Check out when to expect the latest Marvel, Star Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about the future of Doctor Who."
    }
  ],
  "argos_summary": "The horror film 'Weapons' topped the box office this weekend, earning $70 million worldwide, with a strong domestic opening of $42.5 million. The film, which revolves around a teacher dealing with the mysterious disappearance of her entire classroom, has received positive reviews, reflected in its 'A-' CinemaScore. Alongside 'Weapons', Disney's 'Freakier Friday' also performed well, grossing $44.5 million globally, while older releases like 'Superman' continue to perform strongly at the box office.",
  "argos_id": "WIIF2LY4E"
}