{
  "url": "https://nypost.com/2025/08/11/opinion/zohran-mamdani-faces-huge-budget-gap-and-will-have-to-scale-back-his-utopian-dreams/",
  "authorsByline": "Post Editorial Board",
  "articleId": "084f4e0c28b64edfa01061924ca4df2c",
  "source": {
    "domain": "nypost.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://nypost.com/wp-content/uploads/sites/2/2025/08/newspress-collage-0fxyk2t59-1754956788335.jpg?quality=75&strip=all&1754942521&w=1024",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T00:32:46+00:00",
  "addDate": "2025-08-12T00:35:11.694035+00:00",
  "refreshDate": "2025-08-12T00:35:11.694037+00:00",
  "score": 1.0,
  "title": "New York’s huge budget gaps leave no dough for Mamdani’s big-spending dreams",
  "description": "Zohran Mamdani’s dreamy, big-spending plans for New York City are about to smash into the hard reality of the state’s massive $36 billion budget gap.",
  "content": "Zohran Mamdani’s dreamy, big-spending plans for New York City — free buses, free babysitting and $100 billion for free apartments — are about to smash into the hard reality of the state’s massive $36 billion budget gap.\n\nWhoever is mayor come Jan. 1 will have a hard enough time meeting payroll, much less expanding the scope of government spending.\n\nNew York has been on a spree lately, much of it funded by once-in-a-lifetime federal bonanza grants tied to the pandemic. But those giveaway days are gone, and Washington’s far more likely to reduce what it sends this way, so both city and state must now face some serious belt-tightening.\n\nBlaming President Donald Trump — as Mamdani is already doing with his “Five Boroughs Against Trump” tour — can’t change the stony truth that New York spends money like it’ll never run out.\n\nHeck, in the face of federal tightening of eligibility for Medicaid and food stamps, Gov. Kathy Hochul is scrambling to ensure no illegal immigrant gets cut off, even if New York taxpayers must cover the whole bill.\n\nIt all means less state and federal flowing to Gotham.\n\nWhich would leave a Mayor Mamdani looking for soak-the-rich tax hikes even larger than what he now suggests to fund his big dreams.\n\nThe great Maggie Thatcher famously noted: “The problem with socialism is eventually you run out of other people’s money,” but New York City is on track to run out even before the socialist takes over.",
  "medium": "Article",
  "links": [
    "https://nypost.com/2025/07/22/opinion/to-plug-new-yorks-massive-budget-gaps-gov-hochul-should-focus-on-growing-the-economy/",
    "https://nypost.com/2025/08/11/opinion/nyc-schools-are-still-failing-to-teach-over-40-of-kids-and-it-may-soon-get-worse/",
    "https://nypost.com/2025/08/11/opinion/trumps-takeover-of-dc-policing-is-entirely-sensible-and-a-win-for-the-people-of-washington/",
    "https://nypost.com/2025/08/11/opinion/if-eric-adams-gets-ousted-in-november-say-goodbye-to-progress-on-nyc-subway-safety/",
    "https://nypost.com/2025/08/11/us-news/socialist-mamdani-launches-trump-bashing-tour-across-5-nyc-boroughs/",
    "https://nypost.com/2025/07/15/us-news/zohran-mamdani-sticks-to-socialist-guns-tax-the-rich-plan-during-highly-anticipated-sitdown-with-nyc-big-business-leaders/"
  ],
  "labels": [
    {
      "name": "Opinion"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "New York City",
      "weight": 0.12066079
    },
    {
      "name": "New York",
      "weight": 0.119530484
    },
    {
      "name": "New York taxpayers",
      "weight": 0.116518795
    },
    {
      "name": "federal tightening",
      "weight": 0.08393589
    },
    {
      "name": "less state",
      "weight": 0.079380736
    },
    {
      "name": "New York’s huge budget gaps",
      "weight": 0.07665082
    },
    {
      "name": "Mamdani",
      "weight": 0.076339014
    },
    {
      "name": "state",
      "weight": 0.07419359
    },
    {
      "name": "free apartments",
      "weight": 0.07093335
    },
    {
      "name": "Gov. Kathy Hochul",
      "weight": 0.06944915
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.9970703125
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.970703125
    },
    {
      "name": "/News/Business News/Fiscal Policy News",
      "score": 0.7939453125
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.67431640625
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.3759765625
    },
    {
      "name": "/News/Local News",
      "score": 0.307373046875
    }
  ],
  "sentiment": {
    "positive": 0.046775002,
    "negative": 0.76754755,
    "neutral": 0.18567744
  },
  "summary": "New York City's large budget gaps are preventing the implementation of Zohran Mamdani's ambitious plans for free buses, babysitting, and apartments. The state's $36 billion budget gap is a significant gap, with both the city and state facing significant cuts. Maddani is already campaigning against President Donald Trump, arguing that New York City spends so much on its own. Meanwhile, Gov. Kathy Hochul is working to ensure no illegal immigrant is cut off from the state, even if taxpayers must pay the bill.",
  "shortSummary": "Zohran Mamdani's vision for New York City faces challenges as it faces a $36 billion budget deficit, necessitating tax increases for both sides.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "1df96a14b8da45a48ada0c2647714581",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://nypost.com/2025/08/11/opinion/if-eric-adams-gets-ousted-in-november-say-goodbye-to-progress-on-nyc-subway-safety/",
      "text": "Mayor Eric Adams deserves a cheer for “Subway Safety Plan” wins, but making the transit system truly safe will mean getting a lot more help to Gotham’s seriously mentally ill.\nOn Monday, Adams announced that the city has placed 3,500 onetime “street” homeless, including 1,000 pulled from the subways, into permanent housing since 2022.\nIt looks like Adams’ efforts, combined with Police Commissioner Jessica Tisch’s emphasis on quality-of-life policing, are paying off: MTA officials just announced drops in transit-system crime, including a 16.7% dip in robberies and a 9.3% fall in felony assaults, comparing July 2025 to July 2024.\nThen again, the subways saw a 19% spike in felony assaults in 2025’s first quarter.\nAnd straphangers still have good reason to be skittish: On Saturday, a screaming maniac shoved a man onto the tracks at the No. 1 50th Street station for no apparent reason; an hour later, another unhinged man stabbed another man in the neck at an East Village station after the two got into a fight.\nThe city has a lot more dangerously unwell vagrants to get out from underground and into treatment, in other words — and could use continued state reforms to make that easier.\nMayor Adams and Gov. Hochul won some expanded standards for involuntary commitment this year, but the leading mayoral candidates have other priorities.\nZohran Mamdani even wants to convert subway retail spaces into homeless-outreach centers, which would mean more emotionally disturbed people wandering the system.\nForcing unwilling people into treatment sends progressives into conniptions, but true compassion means not letting the seriously mentally ill resist the help they desperately need.\nAdams and Tisch have made some hard-earned strides, but the gains are fragile and unlikely to survive a progressive victory in November.\nIf Adams gets voted out of office, watch for transit crime to balloon again."
    },
    {
      "url": "https://nypost.com/2025/08/11/opinion/nyc-schools-are-still-failing-to-teach-over-40-of-kids-and-it-may-soon-get-worse/",
      "text": "Bad news: More than 40% of city kids in grades 3-8 failed math and English in this spring’s state testing.\nWorse news: Most ideas on the table for the public-school system would only add to the failure.\nThe city Department of Education opted to look on the bright side, pointing to small increases in proficiency of 7 points in reading and 3 in math — but that comes as the State Education Department is steadily watering down the exams.\nIndeed, SED’s hostility to standardized testing is also shown by the insanely delayed release of the results, which in past years came at the start of the summer, not the end.\nThat said, the double-digit improvement in Grade 3 (12.9%) and 5 (15%) reading scores suggests that Mayor Eric Adams’ NYC Reads reforms are having a positive impact after two years.\nBut even these gains are imperiled, as the leading mayoral candidate, Zohran Mamdani, seeks to end mayoral control and so hand de facto control of the schools to the United Federation of Teachers — whose only priorities are ever-growing pay and perks for its members, and gaining more members to collect dues from.\nBecause it’s somehow coded as “progressive,” Mamdani also openly intends to wage war on the city’s charter schools — the very public schools that best deliver for the lower-income, minority children that fare worst in DOE schools.\nIndependent candidate Andrew Cuomo, polling second in the race, was once better on these issues — has now declared allegiance to the UFT and turned his back on charters: As we’ve said before, he’ll betray anyone to serve his own interests.\nThat 40% of schoolchildren in grades 3 through 8 can’t earn a barely passing grade in math or English is the shame of a city. Parents should be furious. Politicians should be embarrassed.\nThis year’s mayoral contest has so far offered not even token debate on improving public education, and now Mamdani’s trying to make the race all about who can best fight President Donald Trump. He and Cuomo are in a race to see who hates President Trump more.\nNew York’s children matter a lot more to the city’s future; here’s hoping the candidates don’t keep getting away with ignoring their needs."
    },
    {
      "url": "https://nypost.com/2025/07/22/opinion/to-plug-new-yorks-massive-budget-gaps-gov-hochul-should-focus-on-growing-the-economy/",
      "text": "Here’s a novel idea for Gov. Kathy Hochul: Focus on growing the state’s economy — keeping taxes low, unleashing fracking, easing regulations — and generating new revenue to avoid painful cuts and tax hikes as she closes her massive budget gap.\nPresident Donald Trump’s federal budget restructuring popped a hole Hochul’s own $254 billion spending plan, so she’s already directed state agencies to cut $750 million.\nShe’ll have to come up with another $3 billion in savings, or new revenue, next year.\nAnd the Citizens Budget Commission flags a $22 billion long-term structural imbalance.\nOne way to plug the hole is to supercharge the economy. A growing economy means a growing tax base.\nThis week, Politico Playbook declared that “Wall Street could be the state budget’s savior next year — or a major headache.”\nBut it’s dangerous for the state’s economic fortunes to be dependent on the ebb and flow of the financial markets.\n(Wall Street provides about a fifth of state tax revenue.)\nNew York has so much more to offer: Tech companies, like AI, are certainly growing.\nBut energy-intensive industries and large companies won’t locate here unless New York offers reliable, reasonably priced energy.\nAnd Hochul, pandering to green extremists, has been downright hostile to traditional sources of energy, particularly natural gas.\nThe state’s climate law, which then-Gov. Andrew Cuomo put in place and Hochul adopted, sets all kinds of rules for emissions that discourage new tech business.\nAnd renewables, like wind and solar, won’t cut it.\nContrast that with the way investors view Pennsylvania: Just last week, they — along with Trump — announced a whopping $90 billion injection of funds to turn Pittsburgh into a major AI hub.\nMeanwhile, another economic-bonanza-in-waiting in New York is the Southern Tier’s Marcellus Shale Formation, with its massive quantities of natural gas.\nThat gas has sat idle ever since Cuomo banned fracking (the process of extracting the gas) about a decade ago.\nHochul has zero interest in lifting the ban, but if she did it could jumpstart the region — kicking off a new flow of revenues to help with her budget woes.\nIn Pennsylvania, fracking has been a major boon — for jobs, businesses and the state’s balance sheet.\nHochul can also boost New York’s economy by making the state more business friendly overall. That means lowering taxes, not raising them.\nAnd scrapping many of the state’s endless regulations; its minimum-wage laws alone are surely deterrents to businesses.\nSuch steps will help the state in countless ways.\nThey’ll open up more jobs to New Yorkers (and the rise in demand for labor will itself push up wages).\nThey’ll boost economic activity, creating more prosperity for everyone.\nAnd they’ll generate new revenue to help close the state’s budget gap, reducing the need for cuts or tax hikes.\nHochul can stick to the old ways — laying off workers, reining in spending (both of which are necessary, in any case) and/or hiking taxes.\n(How she’ll justify her $400-a-family refunds, meant to goose her reelection chances, is beyond us.)\nOr she can make New York a pro-growth state, by lifting the fracking ban, holding down taxes, promoting new energy production and relaxing regulations.\nWe won’t hold our breath waiting for that, but when her budget cuts and tax hikes hit, just remember: She had other options."
    },
    {
      "url": "https://nypost.com/2025/07/15/us-news/zohran-mamdani-sticks-to-socialist-guns-tax-the-rich-plan-during-highly-anticipated-sitdown-with-nyc-big-business-leaders/",
      "text": "Zohran Mamdani sticks to socialist guns, ‘Tax the rich’ plan during highly anticipated sitdown with NYC big business leaders\nHe’s staying red.\nMayoral front-runner Zohran Mamdani stuck to his socialist guns during a highly anticipated powwow with Big Apple business leaders Tuesday — doubling down on his plan to raise their taxes, if elected.\nMamdani — who just last month said billionaires shouldn’t exist — schmoozed with roughly 100 CEOs convened at his request by the powerful Partnership for New York City, for the first of two days of scheduled meetings with business bigs.\nThe 90-minute meeting’s temperature remained low, even as Mamdani was grilled about his Communist-tinged and anti-Israel comments, including his refusal to condemn the “Globalize the intifada” rallying cry, one attendee told The Post.\nAsked about his intent to lean on the ultra-wealthy and corporations, Mamdani told the executives that taxes had been raised on those groups in the past without it resulting in an exodus of high earners from the Big Apple, the source said.\n“He didn’t back away from any policy position, though he did so in a non-confrontational manner,” the attendee dished.\n“It shows he’s a good politician. He was very confident.”\nThe slick Mamdani also distanced himself from his past use of the phrase “seizing the means of production,” a Marxist concept, but in a roundabout way, chalking it up to a rookie mistake, another business bigwig in attendance said.\n“It was very frustrating,” the source said.\n“He talks so much and says so little.”\nThe sit-down — which was requested by Mamdani and will be followed by a Wednesday confab with tech industry leaders — was pointedly snubbed by JPMorgan CEO Jamie Dimon, who sits on the Partnership’s board, and other Wall Street titans, many of whom sent non-executive underlings, sources said.\n“Everyone is just in listening mode,” joked one banking bigwig.\nDimon — who branded Mamdani a “Marxist” at an event in Ireland last week — begged off with a vague scheduling “conflict,” according to bank reps.\nEven with the brush-off, Mamdani’s move to engage business leaders shows the “Tax the rich” firebrand shifting toward broader outreach ahead of November’s general election, where he’ll face incumbent Mayor Eric Adams, a stubborn ex-Gov. Andrew Cuomo, Republican nominee Curtis Sliwa and independent Jim Walden.\nThose in attendance included Loews Corporation chair James Tisch, an ardent backer of Israel and the father of NYPD Commissioner Jessica Tisch — whom Mamdani did not commit to keeping as top cop during the meeting.\nA top rep from Louis Vuitton was also in the room for the confab, held at real estate company Tishman Speyer’s Rockefeller Plaza offices, sources said.\nMamdani, when pressed about the anti-Israel “Globalize the intifada” cry by the business leaders, said he discouraged its use, according to attendees.\nPfizer CEO Albert Bourla, who is Jewish, pressed Mamdani for throwing around the word “genocide” about the plight of Palestinians in Gaza under Israel, the second source said.\nBut Mamdani evidently forged ahead smoothly.\n“It was very frustrating. He speaks well,” the source said, recounting Mamdani’s response to a question about retail theft.\n“He went into a lengthy discussion about people with mental illness. You scratch your head and say, ‘He didn’t answer the question. Unless you believe everyone who commits retail theft is mentally ill.'”\nThe source added: “(Mamdani) speaks very well, in paragraphs. He’s well organized. It’s easy to fall into the trap of not getting an answer to your question.”\nAnother source said Mamdani came out of the high-stakes meeting without stepping on any political landmines and left some tycoons wondering if they could work with the avowed socialist.\n“He faced some tough questions. I don’t think he gained any support, but didn’t do any harm and was prepared,” a business source at the meeting told The Post.\n“The thing he did is [he] showed up with confidence, like he is going to be mayor,” the source stated, adding, “He doesn’t act like he has it in the bag but does say ‘If I am mayor’ in a way that got people thinking, ‘Oh, he really could be mayor.’”\n“So do we fight him or do we work with him? I think a lot thought they could work with him,” the source added.\nKathryn Wylde, CEO of Partnership for New York City, told The Post that Mamdani “allayed some fears” of business bigwigs in attendance Tuesday, citing his “good” communication and listening skills.\n“There was a frank discussion of issues that matter to the business community. Clearly there is a lot of agreement on making New York a safe and affordable city, although different views on how to achieve those goals,” Wylde said.\nThe summit came as the Queens state assemblyman shifts his campaign to the general election after his shocking win in last month’s Democratic primary.\nMamdani recently picked Jeffrey Lerner, a seasoned Democratic political veteran who once worked for top rival Cuomo, to lead his campaign.\nHe has been engaging with Wylde as he tried to make nice with business leaders who’ve greeted his surprise primary win over Cuomo with serious concern verging on full-blown panic.\nMamdani has also extended lower-profile olive branches, including meeting with many individual business leaders in one-on-ones, a source tied to the candidate said.\nHe met Monday with a dozen executives with the Black Economic Alliance, including chairman and techie investment honcho Charles Phillips, sources said.\n“He’s proven himself to be a savvy campaigner,” a Democratic political operative said.\n“The way you do it without angering your base is to quietly reach out to these people.”\nAnd Mamdani has given tense tycoons plenty of ammunition to justify their fears.\nHe has pushed for a 2% tax hike on millionaires, a 4.5% increase on corporations and unhesitatingly said billionaires shouldn’t exist — all of which sparked fears that a Mamdani mayoralty would cause an exodus of high earners from the Big Apple.\nSome bigs have gone on the offense against the leftist, such as billionaire hedge fund titan Bill Ackman, who publicly searched for an anti-Mamdani candidate before casting his lot with Adams.\nFellow billionaire John Catsimatidis likewise threatened to close or sell his Manhattan-based grocery chain Gristedes if Mamdani — who has proposed launching government-owned grocery shops — wins.\nAsked about the looming sit-down earlier Tuesday, Mamdani said he was looking for common ground.\n“I go into that room knowing that there will be disagreements, and also knowing that the foundation of it is a belief in the possibility of the city, and it will take a new kind of politics to unlock that possibility,” he said.\n“And what I will say to them, when I will say to every New Yorker, is that not only is my door open, but no matter of the question of the primary, the general, but that I am looking to work with everyone.\n“My interest is a partnership, not in the politics.”\nAdditional reporting by Hannah Fierick and James Franey"
    },
    {
      "url": "https://nypost.com/2025/08/11/us-news/socialist-mamdani-launches-trump-bashing-tour-across-5-nyc-boroughs/",
      "text": "Mamdani launches Trump-hating tour across 5 boroughs — and again attempts to tie prez to Cuomo\nIt’s a Big Apple bashing.\nMayoral frontrunner Zohran Mamdani kicked off a weeklong, citywide rage tour in Manhattan Monday slamming President Trump for enacting policies that he claims are “dire threats” to New Yorkers – and used the platform to again try to link the Republican to his rival Andrew Cuomo.\nThe champagne socialist was surrounded by former and current pols, including Rep. Jerry Nadler, who piled on Trump, arguing that through his signature “Big, Beautiful” bill that Medicaid, food assistance and other programs vital to city dwellers are being slashed.\nMamdani, 33, also claimed the legislation “contains such dire threats to the lives of so many that we love and care about” before pivoting to Cuomo, who allegedly had a recent phone call with the president, according to a New York Times report.\n“These leaders, alongside me, whether in current office or continuing to lead our city beyond those offices, have been on the phone with constituents across this borough, speaking to them,” the Queens assemblyman said at 1199 SEIU headquarters near Times Square. “Trying to speak to their anxieties, their fears, their concerns, about whether they can afford this city, whether they will be safe in this city, whether there is room in this city for them as well.\n“And amidst all of those phone calls, former Governor Andrew Cuomo has been having a very different conversation on the phone.”\nCuomo, who is running as an independent after getting trounced by Mamdani in a Democratic primary in June, has disputed that he has spoken to Trump about the mayoral race.\nThe 47th president, who grew up in Queens and long called New York City home, is considering injecting himself into the contest to target Mamdani.\nThe president has consistently slammed Mamdani following his shocking primary upset, labeling him a “100% communist lunatic.”\nCuomo’s campaign insisted the ex-gov would not kowtow to Trump.\n“That’s the case in Mayor Adams, for sure, but no one has a stronger or longer record of standing up to Trump than Andrew Cuomo,” Cuomo spokesperson Rich Azzopardi said in a statement.\n“Trust me, Trump and the republicans are salivating at the notion of a Mayor Mamdani and will make him the de facto head of the Democratic Party and will run against him in every race across the nation.”\nAdams blasted Cuomo for “turning serious issues into a childish game of ‘he said, she said.’”\n“New Yorkers don’t need political gossip — they need leadership. We have a city to run, not a political scorecard to keep,” the mayor added.\nAdams told The Post he’s willing to work with any president, “Republican or Democrat” to deliver results for the city.\nMamdani, in his press conference, called the alleged Trump-Cuomo phone call a “betrayal of the fabric of this city” and argued his other opponents — Mayor Eric Adams, who is also running as an independent, and Republican Curtis Sliwa — are also aligned with Trump.\n“And what New Yorkers want is a mayor who is accountable to them, not to the president, not to the same billionaires that put that president back in the White House, but to the people of this city,” he said.\nHizzoner has faced allegations of a quid pro quo with the Trump administration that led to Adams’ federal corruption charges disappearing, though both the mayor and the White House have denied there was a deal.\nAnd while Sliwa and Trump are both Republicans, the Guardians Angels founder also said recently that the president should stay out of the race.\nMamdani’s Trump-hating tour is supposed to include all five boroughs by Friday as the lefty insisted, “We know that there is no borough that will be free from Trump’s cruelty.”"
    },
    {
      "url": "https://nypost.com/2025/08/11/opinion/trumps-takeover-of-dc-policing-is-entirely-sensible-and-a-win-for-the-people-of-washington/",
      "text": "Washington, DC’s political class may scream in fury at Team Trump’s takeover of policing, but we suspect most district residents will be relieved: Regular people put public safety first.\nThe city’s politicians have failed to do that, and the feds have a duty to act when the nation’s capital is unsafe.\nEven Democrats have been willing to stomp on DC’s demands for “home rule” when it comes to fighting crime: By a vote of 81-14 in 2023, for example, the Dem-run Senate joined with the GOP-run House to override the City Council’s bid to reduce maximum penalties for violent crime, including carjackings — and President Joe Biden signed the measure into law.\nCarjackings, for the record, are still triple the 2018 level, part of a grim wave of youth crime — yet city leaders have refused to get serious about stopping the violence.\nNor did President Donald Trump rush to do this: He warned Mayor Muriel Bowser last year that action was on the table; she’s had six months to turn things around — but several high-profile recent crimes, including last month’s shooting death of 3-year-old Honesty Cheadle, showed she needs help.\nIndeed, as Trump noted, the US capital has more murders per capita than notorious Mexico City and Bogotá, Colombia. The homicide rate is six times New York City’s.\nTo drive crime down, this intervention will bring in new resources, including hundreds of National Guard and broader deployment of the federal Park Police.\nNote, too: The feds share blame for DC’s high crime: The US Attorney for the District of Columbia is responsible for all felony prosecutions in the city — but Biden appointees to the job refused to prosecute over half of local crimes.\nWe hope neither the City Council nor Democrats (in Congress or neighboring Maryland and Virginia) try to sabotage this intervention. Everyone but the bad guys, and DC’s citizens most of all, is a winner if it succeeds."
    }
  ],
  "argos_summary": "Zohran Mamdani's ambitious plans for New York City, including free services and substantial housing investments, face significant challenges due to a projected $36 billion budget deficit. As the city grapples with declining federal support and rising costs, the incoming mayor will need to navigate tough fiscal realities while addressing pressing issues like public safety and education, where recent state testing reveals alarming failure rates among students. Mamdani's campaign has focused on taxing the wealthy, but his proposals may lead to further economic strain, raising concerns among business leaders about the potential impact on New York's economy.",
  "argos_id": "WJV6ER3EG"
}