{
  "url": "https://www.cnn.com/2025/08/11/politics/trump-putin-summit-reagan-mcgurk-analysis",
  "authorsByline": "Brett H. McGurk",
  "articleId": "f8b7ad6746ca4d28957e07018def50b8",
  "source": {
    "domain": "cnn.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://media.cnn.com/api/v1/images/stellar/prod/c-ap18198051335109.jpg?c=16x9&q=w_800,c_fill",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T23:00:43.181000+00:00",
  "addDate": "2025-08-11T23:12:16.158003+00:00",
  "refreshDate": "2025-08-11T23:12:16.158005+00:00",
  "score": 1.0,
  "title": "For summit with Putin, Trump should channel Reagan",
  "description": "What might deliver a ceasefire? Not a performative meeting that allows Vladimir Putin to wriggle out of sanctions. Instead, Trump should study President Ronald Reagan at Reykjavik.",
  "content": "The surprise news last week of a Trump-Putin summit raised the stakes in the ongoing US efforts to establish a ceasefire in Ukraine. Having played the ultimate card of a presidential summit, the only result that counts will be the full and complete ceasefire that President Trump has long demanded and that Ukraine accepted five months ago.\n\nShort of that, the summit will be a failure with peace further out of reach for the foreseeable future.\n\nSo, what might deliver a ceasefire? Not a performative meeting that allows Vladimir Putin to wriggle out of sanctions and buy time. Instead, Trump should study President Ronald Reagan at Reykjavik.\n\nAs I’ve written previously, the Russians seated across the table in a negotiation consider themselves bears at a dance. If you choose to dance with a bear, the saying goes, the bear determines when and how the dance ends. Unless you’re a bigger bear.\n\nPutin will arrive in Alaska believing he can manipulate Trump. The US may be the far more powerful country, but Russia is the power in Ukraine and Putin is fully committed to his objective there: to subjugate the entire country. He believes his commitment to those aims is greater than Trump’s commitment to supporting Ukraine to blunt them.\n\nSo, Putin will likely aim to convince Trump that Russia’s goals are reasonable, and that Russia is committed to a peaceful resolution, even while the peaceful resolution Putin seeks is one that requires the complete subjugation of Ukraine. He may then seek to draw Trump into supporting a protracted diplomatic process — without stopping the war.\n\nTrump should not fall for this. The one consistency in his policy from the start has been the call for an unconditional 30-day ceasefire during which negotiations can begin to end the war. Ukraine signed up in March, after which Secretary of State Rubio declared, “Russian reciprocity is the key to achieving peace.” Since then, Russia has only escalated the war, with its attacks against Ukraine having doubled since Trump entered office.\n\nBut Trump can now demand a ceasefire from Putin from a position of strength.\n\nLast month, he announced a new Ukraine policy whereby the failure of Russia to accept a ceasefire triggers increasing and crippling economic sanctions on both Russia and any purchaser of Russian energy products. He has thus far followed through with tariffs on India, the second largest purchaser of those products behind China. He also confirmed continuation of US military support to Ukraine through systems paid for and delivered by NATO allies. And he led a successful NATO summit where allies agreed to increase their defense spending at 5 percent of GDP, higher than what the US spends on defense.\n\nThis new demonstration of support for Ukraine means that Russia’s continuing the war will lead to its continuing losses and economic strain. Putin might strut confidently into a summit, but behind him lie one million Russian military casualties from his disastrous invasion of Ukraine, including 250,000 dead. All the American side needs to convey is that short of a ceasefire and then a negotiation process (in that order, not the reverse) the situation will not improve for Putin, and his aims in Ukraine will remain out of reach.\n\nTrump also arrives in a strong position globally. One thing that Putin knows, understands, and respects is power. He will have noticed the American airstrikes on Iran, a projection of military power from bases inside the United States, as both an impressive feat that the Russian military could never hope to match, as well as a demonstration of Trump’s tolerance for risk and readiness to exert muscle when required.\n\nJust last week, when Russia’s former President Demitry Medvedev warned Trump that his ultimatum to Russia on Ukraine was “a step towards war” with the US, Trump responded by announcing the deployment of two nuclear-powered submarines towards Russia.\n\nIn sum, the president of the United States is arriving at this summit in a far stronger position than the president of Russia, and the negotiation strategy should reflect that equation. This is an opportunity to demand and stick to principle, which is the only path to peace. Putin must agree to stop the war he started, or else we should leave Alaska empty-handed.\n\nWith that backdrop, Trump should take inspiration from the portrait of Reagan hanging behind the Resolute Desk. In October 1986, Reagan met Russia’s President Mikhail Gorbachev in the capital of Iceland to discuss de-escalation between the Cold War powers, and for the first time, the possibility of a sweeping nuclear arms control pact. As the Russians often do, Gorbachev arrived well prepared with new proposals, fallback positions, and forward leaning prescriptions for cutting back Moscow’s nuclear arsenal.\n\nReagan wanted a deal too, and over two days of talks, the two sides agreed on parameters for what could have been a historic outcome. Reagan, however, also arrived with firm principles on which he would not budge. One of those was the nascent missile defense system known at the time as Star Wars, which Moscow knew it could never match and viewed as a threat to their military capabilities and the deterrent value of its missiles.\n\nWhen Gorbachev demanded as part of a deal that the US abandon efforts to develop and deploy such a system, Reagan flatly rejected the proposal. The talks deadlocked, and the two leaders walked out of the summit looking grim and disappointed.\n\nReportedly, when Gorbachev asked Reagan just before that grim-faced photo what else could have been done to achieve peace, Reagan told him, “You should have said ‘Yes.’” The Reykjavik summit at the time was deemed a spectacular diplomatic failure.\n\nBut Reagan’s refusal to budge, even at risk of increasing Cold War tensions, and the failed summit one month before midterm elections ultimately set the conditions for peace. One year later, the US and USSR signed the first treaty to eliminate a category of nuclear weapons. In 1991, following the collapse of the Soviet Union, with Washington still pursuing missile defense innovations, the US and Russia signed the sweeping Strategic Arms Reduction Treaty (START I).\n\nHistorians today point to Reykjavik as a turning point in the Cold War, crediting Reagan’s principled stand with Gorbachev as a foundation for peace.\n\nIn Alaska, Putin will seek to influence Trump with promises of cooperation on other global matters, from Iran, to China, to trade and access to markets and minerals, to civil-nuclear cooperation, and counterterrorism. While the summit is supposed to be about Ukraine, the Russians will aim to distract the US side with various unrelated agenda items, seeking to portray an image of two great powers cooperating on global affairs.\n\nI’ve seen this tactic up close. When I led a channel with Russia on the Syria conflict, our agenda focused on risks of a military confrontation between our forces. But the Russians often arrived with a list of unrelated issues or presented mementos from World War II to suggest that Washington and Moscow cooperation is the key to a more stable world. It was our job on the American side to keep the discussion focused solely on issues that mattered to us and the outcome we aimed to achieve, which was the point of the meeting.\n\nIn Alaska on Friday, the American side should similarly keep the focus solely on Ukraine and make clear that cooperation on other issues is possible — with Ukraine resolved.\n\nOn Ukraine, the Russians will likely present detailed proposals with maps, or propose new prisoner exchanges, or perhaps localized and limited ceasefires. Putin will claim that he is prepared for a lasting peace, and praise Trump as the only leader who can achieve it. This may all sound promising and appeal to Trump’s performative interests, but it’s a trap for the American side.\n\nWhat Putin aims to do is delay any imposition of new sanctions, continue to prosecute the war, and shift the burden for peace in Trump’s mind back on Zelensky.\n\nIf Trump aims for a summit that advances the cause of peace in Ukraine, he should channel Reagan and stick to his own declared principle: a full 30-day ceasefire. Short of that, there should be no further discussion, particularly of new territorial concessions reportedly to be demanded by Russia from Ukraine. Anything short of Russia stopping the war — with further negotiations to end it altogether taking place during a ceasefire — will be a failure, and to set the conditions needed for peace in Ukraine, the president should be prepared to walk.\n\nIn comments on Monday, Trump described the summit as a “feel-out meeting” as opposed to a meeting with the desired outcome. Reagan would not have taken that approach, and neither should Trump.\n\nNot on the table, on the menu\n\nOne final and important reason to avoid being drawn into detailed discussions with maps and adjustments to the line-of-contact between Russian and Ukrainian forces is that the Ukrainians are not participating on this summit. There is a famous saying in diplomacy: “If you’re not at the table, you’re on the menu.” And Putin will want the world to see images of him seated with Trump on American soil with maps in hand to draw up future boundaries in a European country that he invaded. If there is lasting risk in this summit, it’s that image, one Putin covets and the United States under no circumstances should ever grant.\n\nWith a ceasefire in hand, then the table will be set for these detailed negotiations of which Ukraine would need to be a full participant. That sequence cannot be reversed.\n\nLast week on CNN, John King rightly pressed me on whether there was any serious chance that Trump might channel Reagan as opposed to Trump himself during his face-to-face encounter with Putin in Helsinki. There, in 2018, the president seemed to accept Putin’s version of global affairs and sided with Russia over his own intelligence community on charges of Russian efforts to influence American elections.\n\nWill Alaska be the same? Let’s hope not.\n\nAs the Secretary General of NATO, Marke Rutte, pointed out on Sunday, “We have seen President Trump putting tremendous pressure on Russia” and the summit in Alaska “will be about testing Putin, how serious he is on bringing this terrible war to an end.” Seven months into Trump’s presidency, albeit with fits and starts, predictions that he would abandon Kyiv have proved unfounded, and Trump has even hardened his policy towards Moscow while boosting his support for the Ukrainians. There is risk that Alaska reverses this new policy direction and removes pressure from Putin to end the war.\n\nBut that outcome is not inevitable. By maintaining a firm line on a ceasefire, Trump’s own declared policy from the start of his presidency, this summit has potential to kickstart a process that ultimately leads to a just resolution of the war. The outcome is binary: Is there a ceasefire after Alaska, or not? Everything else is extraneous and a distraction.\n\nAnd to succeed in Alaska, the president might look for inspiration from Reykjavik.",
  "medium": "Article",
  "links": [
    "https://www.cnn.com/2025/06/25/politics/nato-meeting-trump-defense-spending",
    "https://x.com/ac360/status/1953627642818662754?s=46",
    "https://www.cnn.com/2025/07/29/politics/trump-promises-gaza-ukraine-mcgurk-analysis",
    "https://www.cnn.com/2025/07/09/europe/russia-air-assault-ukraine-kyiv-intl-hnk",
    "https://www.cnn.com/2025/06/21/politics/trump-iran-air-strikes",
    "https://www.cnn.com/follow",
    "https://www.cnn.com/2018/07/16/politics/donald-trump-putin-helsinki-summit",
    "https://www.cnn.com/2025/08/11/politics/trump-putin-summit-alaska-details",
    "https://www.cnn.com/2025/08/06/politics/india-tariffs-trump-russian-oil",
    "https://www.cnn.com/2025/07/15/politics/trumps-ukraine-pivot-mcgurk-analysis"
  ],
  "labels": [
    {
      "name": "Opinion"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "President Trump",
      "weight": 0.08125239
    },
    {
      "name": "Trump",
      "weight": 0.078491025
    },
    {
      "name": "Ukraine",
      "weight": 0.06466948
    },
    {
      "name": "Russia",
      "weight": 0.064520605
    },
    {
      "name": "Putin",
      "weight": 0.06381057
    },
    {
      "name": "Vladimir Putin",
      "weight": 0.0627451
    },
    {
      "name": "summit",
      "weight": 0.06198083
    },
    {
      "name": "US military support",
      "weight": 0.05789868
    },
    {
      "name": "President Ronald Reagan",
      "weight": 0.056633413
    },
    {
      "name": "Reagan",
      "weight": 0.052091796
    }
  ],
  "topics": [
    {
      "name": "Russia-Ukraine War"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.98193359375
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.94287109375
    },
    {
      "name": "/People & Society/Social Sciences/Political Science",
      "score": 0.84912109375
    },
    {
      "name": "/Sensitive Subjects/War & Conflict",
      "score": 0.5751953125
    },
    {
      "name": "/News/World News",
      "score": 0.3896484375
    }
  ],
  "sentiment": {
    "positive": 0.11769164,
    "negative": 0.5407572,
    "neutral": 0.34155124
  },
  "summary": "The prospect of a summit between President Trump and Vladimir Putin has raised the stakes in US efforts to establish a ceasefire in Ukraine. The only result that matters is a full and complete ceasefire, which has been long demanded by President Trump. So, instead of a performative meeting that allows Putin to evade sanctions and buy time, Trump should study Ronald Reagan's approach. Putin is likely to convince Trump that Russia's goals are reasonable and that Russia is committed to a peaceful resolution, which requires the complete subjugation of Ukraine. Despite this, Trump can now demand a ceasefire from Putin from a position of strength. This comes after he announced a new Ukraine policy where failure to accept a ceasefire triggers increasing and crippling economic sanctions on both Russia and any purchaser of Russian energy products.",
  "shortSummary": "President Trump should channel Reagan's influence instead of Putin's in-examining for a ceasefire in Ukraine, as Putin seeks to manipulate him to achieve peace.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "50b14502d04e44b29648ebe505548a71",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.cnn.com/2018/07/16/politics/donald-trump-putin-helsinki-summit",
      "text": "US President Donald Trump, in a stunning rebuke of the US intelligence community, declined on Monday to endorse the US government’s assessment that Russia interfered in the 2016 presidential election, saying he doesn’t “see any reason why” Russia would be responsible.\nInstead, Trump – standing alongside Russian President Vladimir Putin – touted Putin’s vigorous denial and pivoted to complaining about the Democratic National Committee’s server and missing emails from Hillary Clinton’s personal account.\n“I have great confidence in my intelligence people, but I will tell you that President Putin was extremely strong and powerful in his denial today,” Trump said during a joint news conference after he spent about two hours in a room alone with Putin, save for a pair of interpreters.\nTrump’s statements amounted to an unprecedented refusal by a US president to believe his own intelligence agencies over the word of a foreign adversary and drew swift condemnation from across the partisan divide.\nHis words signaled that he continues to equate the assessment of Russian election meddling with efforts to deligitimize his election, even though the US intelligence community made no such assessment.\nThe US President also hailed Putin’s offer for Russian law enforcement officials to interrogate the Russian agents indicted by the special counsel Robert Mueller as “incredible,” an offer that would effectively give Russia oversight and influence of part of a US investigation into Russian state activities. Putin had also said the offer would be reciprocal.\nTrump repeatedly equated US and Russian actions, saying he holds both the US and Russia responsible for the breakdown in the bilateral relationship and homed in on the effect of the special counsel’s probe, saying it – not Russian meddling – has “kept us (the US and Russia) apart.”\nThe US intelligence community – in a report compiled by the CIA, NSA, FBI and the Office of the Director of National Intelligence – concluded with “high confidence” that Russia interfered during the 2016 presidential campaign, aiming to help elect Trump and hurt Clinton.\nEvery current US intelligence chief who has testified on the matter has also backed the intelligence community’s assessment and the Republican-led Senate Intelligence Committee also affirmed the assessment in a report earlier this month.\nTrump had previously said he sided with his intelligence community’s assessment over Putin’s denials, but he has more frequently cast doubt on the assessments and repeatedly assailed Mueller’s investigation as a “witch hunt.”\nPutin, for his part, reiterated his denial for the public, though he did admit for the first time that he wanted Trump to win the election.\n“Russia has never interfered in and is not going to interfere in US internal affairs, including the elections,” Putin said during the news conference. “If there are any specific materials, if they are presented, we are ready to review them together.”\nTrump, aboard Air Force One returning back to Washington, belatedly attempted to quell outrage over his earlier remarks saying he has confidence in his own intelligence officials.\n“As I said today and many times before, “I have GREAT confidence in MY intelligence people.” However, I also recognize that in order to build a brighter future, we cannot exclusively focus on the past – as the world’s two largest nuclear powers, we must get along!” Trump tweeted.\nBut it was his own pick – Dan Coats, the Director of National Intelligence – who warned on Friday that “the warning lights are blinking red again” regarding Russian cyber interference. Coats then defended the US intelligence community’s assessment about the 2016 election in a statement Monday afternoon.\n“We have been clear in our assessments of Russian meddling in the 2016 election and their ongoing, pervasive efforts to undermine our democracy, and we will continue to provide unvarnished and objective intelligence in support of our national security,” Coats said.\nDemocrats and Republicans alike pushed back on Trump’s comments.\nHouse Speaker Paul Ryan, who rarely rebukes Trump’s controversial statements, said “there is no question that Russia interfered in our elections” and called on Trump to recognize that Russia “is not our ally.”\n“The President must appreciate that Russia is not our ally. There is no moral equivalence between the United States and Russia, which remains hostile to our most basic values and ideals,” Ryan said in a statement.\nOther Republicans were even more critical, with Senate Foreign Relations Committee Chairman Bob Corker saying Trump’s comments “made us look like a pushover.”\nJohn Brennan, the former CIA director and a career intelligence officer, called Trump’s comments “nothing short of treasonous.”\n“Donald Trump’s press conference performance in Helsinki rises to & exceeds the threshold of ‘high crimes & misdemeanors,’ ” Brennan tweeted. “It was nothing short of treasonous. Not only were Trump’s comments imbecilic, he is wholly in the pocket of Putin. Republican Patriots: Where are you???”\nMeeting runs long\nTrump and Putin blew past the 90 minutes they were scheduled to spend with only interpreters at their sides on Monday, just hours after the US President blamed US policy for the dismal state of relations between the two countries.\nAfter their initial meeting, the two leaders brought in their top aides for an expanded bilateral meeting, the next step in their first official summit, and then concluded with a joint news conference.\nSpeaking to reporters, Trump again lambasted the special counsel’s investigation stemming from Russian interference in the 2016 election as “a disaster for our country.”\n“I think that the probe is a disaster for our country. I think it’s kept us (the US and Russia) apart. I think it’s kept us separated,” Trump said.\nThe US President proclaimed in front of Putin that “there was no collusion” during the 2016 campaign and said he “beat Hillary Clinton easily.”\nHe added the Mueller probe has “had a negative impact on the relationship between the two nuclear powers.”\nWhile Trump dove into specifics on US missteps, he did not list any malignant Russian activities responsible for the low point in the US-Russia relationship.\nInstead he said he holds both the United States and Russia responsible for the breakdown in the relationship between the two countries and railed against the special counsel’s Russia investigation.\n“I hold both countries responsible. I think that the United States has been foolish. We’ve all been foolish,” Trump said at the news conference in Helsinki, Finland.\n“We should have, frankly, had this dialogue a long time ago. I think that we’re all to blame. I think that the United States has now stepped forward along with Russia,” Trump said, adding that he feels that the US and Russia have “both made some mistakes.”\nHistoric summit\nGathered at the Finnish presidential palace, a historic venue where previous US presidents have also gathered with their Russian and Soviet counterparts to tackle the complex bilateral relationship, Trump made clear at the outset that he hopes the meeting can help transform the relationship into an “extraordinary” one.\n“I think we have great opportunities together as two countries that, frankly, we have not been getting along very well for the last number of years,” said Trump, who is hoping his personal touch can reverse the steep decline. “I think we will end up having an extraordinary relationship.”\nBut the highly anticipated meetings that had been minutely planned began with a sluggish start after the Russian President arrived late, setting the summit about 45 minutes back.\nPutin is known for arriving late to important events – considered a power play by some observers – but this time his late arrival offered a role reversal for the US President, who has recently walked in late to meetings at the G7 and NATO summits.\nIn 2009 and 2012, Putin showed up about 40 and 45 minutes late for his meetings with then-President Barack Obama. But he kept German Chancellor Angela Merkel and Ukrainian President Viktor Yanukovych waiting about four hours each in 2014 and 2012, respectively. Even the Pope waited more than an hour for Putin to show up at the Vatican in 2015.\nThe two men walked into the palace’s Gothic Hall together, offering brief remarks and shaking hands for the cameras before the two men were left alone – save for a pair of interpreters – for the first meeting of the day.\nTrump and Putin had set aside 90 minutes of solo time – just as Trump did with Kim Jong Un last month. But the two men spilled into overtime, inviting reporters for the start of their expanded bilateral meeting with top aides 2 hours and 11 minutes after their one-on-one meeting began. Trump was joined by Secretary of State Mike Pompeo, national security adviser John Bolton, White House chief of staff John Kelly, Fiona Hill, the top Russia expert at the National Security Council, and interpreter Marina Gross.\nThe lengthy tête-à-tête made Trump’s remarks ahead of the meeting all the more notable – and concerning to some.\nImproving US-Russia ties\nUS officials have stressed the path to improving US-Russia ties runs through a clear-eyed understanding of Russian aggression and the root causes of discord in the relationship, but Trump is signaling a different course. He is holding previous US administrations and the Justice Department’s investigation stemming from Russian meddling in the 2016 election responsible.\n“Our relationship with Russia has NEVER been worse thanks to many years of U.S. foolishness and stupidity and now, the Rigged Witch Hunt!” Trump tweeted Monday morning ahead of the summit.\nTrump was eager to have time alone with Putin to better personally assess him and develop a personal relationship, according to a US official, but he has also expressed anger at leaks from his meetings with foreign leaders and told aides he wanted to ensure his sensitive discussions with Putin remained secret.\nThe official also said that Trump doesn’t want aides – who may take a harder line on Russia – undercutting or interrupting him during his talks with Putin.\nJust days earlier, Trump pointed to the “pure stupidity” and a “political problem” in the United States for making it “very hard to do something with Russia.”\n“Anything you do, it’s always going to be, ‘Oh, Russia, he loves Russia,’ ” Trump said during a joint news conference with his British counterpart.\nTrump’s Monday morning tweet and his words and actions in the last week have only amplified concerns about his approach to Russia among US allies and lawmakers of both parties in Washington. During his swing through Brussels and the United Kingdom, Trump has repeatedly criticized US allies, called the European Union a “foe” and criticized the Obama administration rather than Russia in the wake of the Justice Department’s indictment of 12 Russian agents who allegedly worked to hack Democrats’ emails and computer networks during the 2016 election.\nAhead of his meeting with Putin – who is alleged to be behind the assassination of journalists and political dissidents – the US President also lashed out again at the news media on Sunday by branding journalists “the enemy of the people.”\nCNN’s Kevin Liptak contributed to this report."
    },
    {
      "url": "https://www.cnn.com/2025/08/06/politics/india-tariffs-trump-russian-oil",
      "text": "President Donald Trump on Wednesday announced sweeping and substantial tariffs on India, one of America’s most important trading partners. In addition to a 25% tariff that is set to go into effect Thursday, Trump also announced an additional 25% tariff on India that will go into effect later this month as punishment for importing Russian oil and gas.\nThose combined penalties would bring the total tariff on goods imported from the world’s fifth-largest economy to a whopping 50% – among the highest the US charges.\nThe latest executive order, according to a document posted on the White House website, represents an escalation of his trade battle with New Delhi and his first use of so-called secondary sanctions on countries the US says are fueling Moscow’s war machine.\nThe order finds India is “currently directly or indirectly importing Russian Federation oil,” and says it is “necessary and appropriate” to apply the new 25% tariff on Indian goods.\nThe new, Russia-related tariffs will take effect in 21 days, while the already-threatened 25% tariff is set to take effect Thursday.\n“I have received additional information from various senior officials on, among other things, the actions of the Government of the Russian Federation with respect to the situation in Ukraine,” the order notes as rationale for imposing the new duties.\nThe announcement came hours after Trump’s foreign envoy Steve Witkoff concluded a meeting in Moscow with Russian President Vladimir Putin.\nTrump earlier this week threatened India with the new tariffs, saying they were helping Russia wage war in Ukraine.\n“India is not only buying massive amounts of Russian Oil, they are then, for much of the Oil purchased, selling it on the Open Market for big profits. They don’t care how many people in Ukraine are being killed by the Russian War Machine,” he wrote on social media.\nIndia responded to Trump’s tariff escalation, defending its purchases of Russian oil.\n“We have already made clear our position on these issues, including the fact that our imports are based on market factors and done with the overall objective of ensuring the energy security of 1.4 billion people of India,” a statement published Wednesday by India’s Ministry of External Affairs read.\n“It is therefore extremely unfortunate that the US should choose to impose additional tariffs on India for actions that several other countries are also taking in their own national interest,” the statement added. It also hinted at potential retaliatory tariffs on American goods, saying that “India will take all actions necessary to protect its national interests.”\nThe impact of 50% tariffs on Indian goods\nThe US goods trade deficit with India has nearly doubled since Trump’s first term, as India has become a significantly more important American trading partner. The trade gap widened as both countries roughly doubled the amount of imported goods from one another.\nIt also came as Trump ramped up tariffs on China, which former President Joe Biden left in place, incentivizing American businesses to seek out alternative production locations like India.\nApple, for instance, moved much of its iPhone production to India over the past few years. Smartphones are exempt from both the tariffs set to take effect Thursday as well as the additional 25% tariff later this month.\nLast year, the US imported $87 billion worth of goods from India, according to Commerce Department data. India imported $42 billion worth of goods from the US.\nThe top goods the US received from India last year included pharmaceuticals, communications equipment, such as smartphones, and apparel. Trump has been threatening a separate across-the-board tariff on pharmaceuticals, which would not be stacked on top of the 50% tariff on Indian goods if that indeed takes effect.\nMeanwhile, the top American exports to India were various oils and gases, chemicals and aerospace products and parts. Were India to slap retaliatory tariffs on American goods these industries could suffer.\nThis story has been updated with additional developments and context."
    },
    {
      "url": "https://www.cnn.com/2025/07/15/politics/trumps-ukraine-pivot-mcgurk-analysis",
      "text": "Brett McGurk is a CNN global affairs analyst who served in senior national security positions under Presidents George W. Bush, Barack Obama, Donald Trump and Joe Biden.\nTo appreciate the dramatic shift in President Donald Trump’s policy towards Ukraine, consider two scenes in the Oval Office, months apart:\nOn February 28, Trump berated Ukrainian President Volodymyr Zelensky in front of the global news media, declaring that he has “no cards” and effectively no choice but to sue for peace with Russia and largely on Russia’s terms. Shortly after that meeting, the United States announced a temporary pause on all military and intelligence support for Ukraine.\nOn July 14, Trump met with the secretary general of NATO, Mark Rutte, and announced significant new cards for Zelensky, in the form of billions of dollars in military equipment, including advanced anti-air systems, and new sanctions on Russia to go into effect 50 days from now if Russian President Vladimir Putin continues to prosecute the war.\nThese scenes bookmark a chapter of ineffective American diplomacy and the beginning of a new and more promising one: diplomacy backed by the leverage ultimately required to stop a war that Putin has otherwise demonstrated he intends to continue indefinitely.\nDancing with a bear\nTheodore Roosevelt once said, “Diplomacy is utterly useless, where there is no force behind it.” This is particularly true when it comes to diplomacy with Russia, a task I’ve confronted with some difficulty as an envoy for Presidents Obama and Trump.\nAs a presidential envoy leading the campaign against the Islamic State in Iraq and Syria (ISIS), one of my jobs was to lead a diplomatic channel with Russia over its support of the Assad regime in Syria. The aim was primarily to keep Russian forces away from ours as we prosecuted the campaign against ISIS. The Russians wanted Syria to themselves, and they often sought to limit our maneuvering space.\nMy main Russian counterpart was a seasoned diplomat and confidant of Putin’s named Alexander Lavrentiev. He and his team of military officials and diplomats often said all the right things at the table, promising ceasefires and drawing lines on maps where Russian forces would operate separate from ours to avoid any risk of a direct clash. Often, however, the actions of Russian forces on the ground sent precisely the opposite message, conducting airstrikes near Syrian forces backed by the United States, or maneuvering provocatively to test whether US military forces were truly prepared to defend the lines we had drawn on a map through our diplomatic channel.\nThis came to a head in early 2018 as the United States was consolidating positions around Raqqa, a city recently seized from ISIS and from where ISIS had actively planned terrorist attacks into Europe and the United States. The Euphrates River snakes just south of the city and presents a natural dividing line between northeast and southeast Syria, a line we told the Russians not to cross.\nThe Russians kept proposing that we back off from Raqqa and claimed they should rehabilitate the city with forces backed by the Assad regime, ideas we repeatedly and consistently rejected at the negotiating table.\nIn February 2018, Russian-backed mercenary forces known as the Wagner Group crossed the Euphrates River together with Syrian forces in a misguided effort to test our resolve. As the column of armored vehicles approached a US position and kept advancing despite repeated warnings to stop, US military forces acted in self-defense and annihilated the column.\nThe next time I met with Lavrentiev, he never mentioned the incident, but he and his team suddenly accepted our boundaries without question, and we never had another problem or incident as we continued the ISIS campaign to a successful conclusion.\nA Russian expert on my team said the Russians approach diplomacy as a bear approaches a dance. The bear knows it will determine when and how the dance ends, unless the other dance partner proves itself to be a bigger bear. Sometimes, it helps to be the bigger bear.\nIn the context of Ukraine, like Syria, while the United States is a far more powerful country than Russia, Putin believes that he has the upper hand in such localized conflicts due to Moscow’s determination and consistency contrasted with Washington’s perceived lack of focus, stamina and shifting politics through election cycles.\nCorrecting that perception is a first principle for effective diplomacy with Moscow, and the approach outlined by Trump yesterday offers the chance to do exactly that.\nDiplomatic inertia\nSo, how did we get here?\nAs a candidate, Trump pledged to end the war in Ukraine on “Day One” of his presidency. Many of his top advisors had long suggested that Russia’s invasion of Ukraine was somehow provoked by the United States, or by Ukraine’s expressed desires to be integrated with Europe and not a satellite of Moscow.\nThis misreading of the conflict’s origins – in fact, Putin launched an unprovoked invasion in 2022 with an aim to conquer all of Ukraine, a goal he has failed to achieve due entirely to Ukraine’s defense of its territory backed by a pipeline of western military supplies – led to a diplomatic strategy that appealed to Putin’s good will and incentives such as proposals for trade and sanctions relief while at the same time pulling back support from Ukraine. For example, Trump formally took NATO membership for Ukraine off the table, while also suggesting that Washington’s support for Ukraine’s defense would soon run dry.\nThe result has been a Ukraine that accepted multiple ceasefires backed by Washington, only to see Russia – sensing vulnerability in Kyiv – escalate the war in response.\nAs I discussed on CNN this past Friday, it was five months ago that Ukraine formally accepted an unconditional ceasefire proposed by the Trump administration. In response, Secretary of State Marco Rubio and then-National Security Adviser Mike Waltz declared in a joint statement with Ukraine that Washington would communicate to Putin that “Russian reciprocity is the key to achieving peace.”\nSince then, Trump has held three phone calls with Putin and his envoys have made multiple trips to Moscow or have met with Putin and Russian diplomats elsewhere.\nTo say there has been no “Russian reciprocity” in response to these ceasefire proposals would be an understatement. Russia in recent months and often within 24 hours of Putin’s calls with Trump, has launched the largest air raids of the war: thousands of missiles and drones striking cities randomly and with no apparent strategic aim but to sow terror among the civilian population.\nUkraine, as it has done since the moment of invasion, responded defiantly and with new tactics of its own, striking with drones deep into Russian territory and against clear military targets – unlike Moscow’s tactics – such as air bases, and destroying the bomber aircraft that Russia has been using to target Ukrainian cities.\nInflection point\nSo, after months of diplomacy and a war that seems further from a ceasefire than ever, the Trump administration confronted an inflection point with two options.\nOne option was to declare indifference and abandon diplomacy while allowing Ukraine’s defensive military systems to deplete, thereby shifting military advantage decisively towards Moscow. Vice President JD Vance previewed such an approach on April 23, saying, “We’ve issued very explicit proposals to both the Russians and the Ukrainians, and it’s time for them to either say yes or for the United States to walk away from this process.”\nThe other option was to reinforce diplomacy with a demonstration of commitment to Ukraine through military resupplies, coordination with allies and imposing additional costs on Putin should he choose to continue the war. Under this option, the US would stick to the objective of a ceasefire – this war can only end with a deal – but the tactics for getting there would shift away from pleading appeals to Putin’s good will and recognition that Russia (not Ukraine) has been the obstacle to peace.\nTrump has apparently chosen the second option, and rightly so.\nThe former “walk away” option would have led only in one direction: Russian escalations against Ukrainian cities and new ground offensives with Ukraine increasingly unable to defend itself or its people, leading to thousands of civilian deaths and Moscow believing it might ultimately achieve its original goal: the subjugation of Ukraine in its entirety.\nThe second option, if carried through, will save lives in Ukraine while demonstrating to Russia that continuing its war of choice will be futile and increasingly costly, thereby making a ceasefire and diplomatic settlement more likely over time.\nNotably, Trump appears to have chosen this new course against the advice of some advisers, including his senior civilian team at the Pentagon, which only last week had ordered a pause on all military deliveries to Ukraine. Trump, in responding to questions by CNN’s Kaitlan Collins, claimed to have not known about this decision, or who made it – and then abruptly reversed it. This suggests that Trump himself is bought into the new direction on Ukraine, which may well give the policy more staying power.\nTrump perhaps best summed up the logic behind the shift in a comment about Putin to reporters before returning to Washington on Sunday night: “He talks nice and then he bombs everybody in the evening.” Putin, in other words, misplayed his own cards.\nNew approach: leveraged diplomacy\nWhile this new approach is continuing to evolve, the broad outlines are in view with three main components.\n- Military Support for Ukraine: In the meeting yesterday with Rutte, Trump announced a new US policy to sell military systems directly to NATO allies, with the understanding that allies would then transfer the systems directly to Ukraine. This is important because until now, Trump had refused to replenish the pipeline of supplies to Ukraine established by the Biden administration once it ran dry. Selling systems to allies allows Trump to claim that he’s doing something different from Biden, while also continuing to replenish badly needed supplies and military systems for Ukrainian forces.\n- Coordination with Allies: Preceding this announced shift in policy, the president had just participated in a successful NATO Summit where allies committed to a target of defense investment at 5 percent of national GDP. This is a significant increase above the current 2-percent target for NATO allies, and above even what the United States spends on defense as a percentage of GDP (just above 3 percent). In a unanimous statement after the summit, NATO allies also declared Russia “a long-term threat to Euro-Atlantic security,” held Russia entirely responsible for the war, and called on Russian forces to withdraw. This unanimity was surely a surprise to Putin, who tends to count on European divisions and America’s lack of conviction on Ukraine. The NATO summit was bookended by the US military strike into Iran and then a conference in Rome with European partners and the US pledging significant economic support for Ukraine as it looks to withstand and then recover from the war. This display of American power and newfound consensus with allies will be noted in Moscow.\n- Threat of New Sanctions: In an era of intensive political discord in Washington, Ukraine carries a unique consensus as shown by a Russia sanctions bill now pending before the Senate with more than 82 co-sponsors. Initially backed by Republican Sen. Lindsey Graham of South Carolina, and Democratic Sen. Richard Blumenthal of Connecticut, the bill has been awaiting a green light from the White House. That appears to have now happened, with both Senate Majority Leader John Thune and Speaker of the House Mike Johnson previewing possible votes before August recesses, as CNN has reported. This bill would impose massive US tariffs on countries that purchase Russian oil and gas, namely India and China. Yesterday, Trump confirmed that 100-percent tariffs will be imposed on these countries in 50 days if Russia continues to prosecute the war. Used wisely, this threat combined with the bipartisan legislation can be brandished to encourage Beijing, New Delhi, and others to press Moscow into accepting a US-backed ceasefire within this timeframe.\nCan it work? Yes\nThis new approach has potential to significantly buttress American diplomacy over the coming months given Russia’s already staggering losses in Ukraine. By even conservative estimates, Russia has suffered over 1 million military casualties, including over 250,000 dead. It’s lost more than 10,000 tanks and armored vehicles, and its vaunted Black Sea naval fleet is now mostly at the bottom of the Black Sea.\nDirect military costs are estimated to be above $300 billion and growing together with frozen assets and GDP losses for Russia in the hundreds of billions of dollars. The churning of manpower is reportedly causing record shortages of factory workers and essential labor needed to sustain Russia’s war effort.\nPutin had clearly hoped that Trump’s shift away from Ukraine might allow for these trends to reverse and set his campaign on a more sustainable trajectory as the Ukrainians ran out of resources to sustain their own defense. So long as this new US policy continues, however, Putin will have few options to meaningfully reverse these trends, and he will need to recalculate the costs of continuing a war that is bleeding resources for little gain.\nIt is important now for the White House to drive this policy forward and for Trump to stick to his new convictions, which combined with bipartisan majorities in Congress and the strong backing of allies carries the best chance to force this recalculation in the Kremlin.\nConclusion\nTrump yesterday announced a dramatic shift in Ukraine policy, opening a new chapter for American diplomacy and ongoing efforts to stop Russia’s war. It was the right move, and one that deserves bipartisan backing and follow through from partners and allies. The most important thing for Putin to understand is that the United States is not going to waver, and that the consequences for Moscow will only worsen the longer the war continues.\nBecause even in Ukraine, when standing with allies, the US is the biggest bear around."
    },
    {
      "url": "https://www.cnn.com/2025/08/11/politics/trump-putin-summit-alaska-details",
      "text": "President Donald Trump framed his Friday summit with Vladimir Putin as a moment to feel out the Russian leader’s parameters for ending the war in Ukraine and acknowledged it would take further meetings to strike a final peace deal.\n“I think it’ll be good,” Trump told reporters at the White House on Monday. “But it might be bad.”\nIt was the clearest picture yet of what Trump hopes to accomplish Friday in Alaska, where urgent preparations are now underway for the first US-Russia leaders summit in more than four years. Trump, who once promised to end the war in Ukraine within a day of taking office, said he would know within two minutes during Friday’s meeting whether such a resolution is even possible.\n“I may leave and say, ‘good luck,’ and that’ll be the end. I may say this is not going to be settled,” he said.\nTrump signaled Ukrainian President Volodymyr Zelensky would not participate in Friday’s summit, though the US president previewed his plans to phone Zelensky immediately after the meeting, along with other European leaders, to brief them on the session with Putin.\nTrump said his goal is ultimately to get Putin and Zelensky in the same room to hash out their differences, and surmised only they would be able to find a way to end the war – almost certainly, he said, with some “land swapping” between them.\n“I’m not going to make a deal,” Trump said. “It’s not up to me to make a deal. I think a deal should be made for both.”\nTrump was speaking as American officials rush to finalize details ahead of Friday’s summit, with both logistical and geopolitical issues still unsettled four days ahead of the momentous sit-down.\nAs of Monday, no venue for the summit had been announced. Administration officials were making their way to Alaska — selected for its centrality to Washington and Moscow — to scope out where, exactly, the US and Russian presidents would meet.\nOfficials were also working to clarify the contours of the two men’s expected discussion, which Trump hopes can yield significant progress toward ending the war in Ukraine.\nAfter US officials spent the weekend briefing European leaders about their expectations for the summit, it was Trump himself who offered the most illuminating perspective in his appearance on Monday.\n“I’m going to meet with President Putin and we’re going to see what he has in mind,” he said. “And if it’s a fair deal, I’ll reveal it to the European Union leaders and to the NATO leaders, and also to President Zelensky.”\nThe president’s comments underscored the extraordinary moment he finds himself in seven months into his second term. After entering office hoping to leverage his relationship with Putin to end the Ukraine war, only to become disillusioned by the Russian leader’s duplicity, Trump is now embarking on the biggest test yet of his long-held faith in face-to-face diplomacy.\n“Next Friday will be important, because it will be about testing Putin, how serious he is on bringing this terrible war to an end,” NATO Secretary General Mark Rutte, who has forged a close partnership with Trump, said Sunday on ABC.\nTrump has told advisers in private that any attempt to end the war is worth the effort, even if it isn’t ultimately successful. He pressed his team to organize this week’s meeting with extraordinary speed; typically, high-profile summits, particularly with adversaries like Russia, take weeks or months to plan.\nAs the week opened, a number of questions were hanging over the preparations.\nOne was whether Zelensky would be invited. The White House hasn’t ruled out including him in Alaska, but officials said their priority was organizing the Trump-Putin one-on-one.\nTrump affirmed Monday that Zelensky likely wouldn’t be present in Alaska.\n“He wasn’t a part of it. I would say he could go, but he’s been to a lot of meetings. You know, he’s been there for three and a half years. Nothing happened,” Trump said.\nZelensky warned Monday that making concessions to Moscow will not persuade it to stop fighting in Ukraine, urging “stronger global pressure” on Russia. He stressed that Moscow is showing little sign of winding down its campaign.\n“Another week has ended without any attempt by Russia to agree to the numerous demands of the world and stop the killings,” Zelensky said on X.\n“Russia is dragging out the war, and therefore it deserves stronger global pressure. Russia refuses to stop the killings, and therefore must not receive any rewards or benefits. And this is not just a moral position – it is a rational one. Concessions do not persuade a killer. But truly strong protection of life stops the killers,” he added.\nUkrainian officials made clear Zelensky was prepared to travel to Alaska if invited by Trump. But they also acknowledged much would hinge on how the Trump-Putin meeting unfolds.\n“We have shown that he is ready to be anywhere to advance the agenda of peace. So, if needed, President Zelensky, of course, will be present at the meetings. We have been very open about it, but let’s see how this will go,” the Ukrainian ambassador to the US, Oksana Markarova, said on CBS.\nAnother question was what, precisely, Putin put on the table during his meeting with Trump’s envoy Steve Witkoff last week to convince the US the time was right for a meeting between the leaders. While exact details of his proposal remained hazy, it was clear that major land concessions on the part of the Ukrainians would be central to his plan.\n“There’ll be some land swapping going on,” Trump said Monday. “It’s good and there’s bad, but it’s very complex, because you have lines that are very uneven, and there’ll be some swapping, there’ll be some changes in land.”\nOn both fronts, European leaders have been anxiously awaiting more details from the United States. The way they understand it, the plan put forward by Putin would give Moscow control of Ukraine’s entire eastern Donbas region, which Russia partially occupies. The fate of the two other regions that have been in Putin’s sights, Kherson and Zaporizhzhia, remained unclear, as did the status of US security guarantees going forward.\nTrump’s aides believe it’s important to have buy-in from European nations on the president’s peace efforts, and spent much of the weekend explaining Trump’s objectives while hearing out concerns about how Putin might approach the session.\nAt a meeting in the English countryside on Saturday, Vice President JD Vance listened as several national security advisers from major European nations spelled out the parameters they believed must be upheld in peace talks with Putin.\nAtop their list was the importance of implanting a ceasefire before any further ideas are discussed — a mandate Putin has repeatedly rejected in the past.\nThe Europeans have also pressed for reciprocity in any land concessions, positing that if Ukraine cedes territory in the eastern Donbas region, Russia must also pull back its occupation in other parts of Ukraine.\nPerhaps most urgently, however, the leaders said Ukraine itself must be involved in discussions about its future.\nA US official said the meeting, held at the stately home of the British foreign secretary, yielded “significant progress.” Two European officials said they felt Vance was receptive to their viewpoints and actively engaged their ideas.\nAnd Zelensky said afterward he believed the US was listening.\n“Our arguments are being heard,” he said during his nightly address.\nTrump, meanwhile, spent much of the weekend hearing from allies about the importance of including Ukraine in any discussions about its future.\nAfter playing a round of golf with Trump on Saturday, Sen. Lindsey Graham said he, too, wanted Ukraine to be a part of the peace talks.\n“I do hope that Zelensky can be part of the process. I’ll leave that up to the White House,” the South Carolina Republican said on NBC. “But I have every confidence in the world that the president is going to go to meet Putin from a position of strength, that he’s going to look out for Europe and Ukrainian needs to end this war honorably.”\nGerman Chancellor Friedrich Merz, who said he planned to speak with Trump on Sunday, reiterated the European position that any discussions on Ukrainian territory must involve Ukraine and Europe.\n“We hope and assume that the government of Ukraine, that President Zelensky, will be involved in this meeting,” Merz said in an interview with German public broadcaster ARD, adding later: “We cannot accept that territorial issues between Russia and America are discussed or even decided over the heads of Europeans and Ukrainians.”\nCNN’s Daria Tarasova-Markina and Christian Edwards contributed to this report.\nThis headline and story have been updated with additional developments."
    },
    {
      "url": "https://www.cnn.com/2025/07/29/politics/trump-promises-gaza-ukraine-mcgurk-analysis",
      "text": "Brett McGurk is a CNN global affairs analyst who served in senior national security positions under Presidents George W. Bush, Barack Obama, Donald Trump and Joe Biden.\nAs a candidate, Donald Trump promised to end the Ukraine war on his first day in office and swiftly bring the Gaza war to a close as well. Now more than six months into his presidency, peace on both fronts appears further away than ever.\nIn Gaza, talks for a ceasefire and hostage deal that had shown promise only a few weeks ago broke down, and the humanitarian situation is catastrophic. In Ukraine, repeated diplomatic approaches were answered by Russia with its largest air attacks to date.\nWhat happened? And what can be done now?\nHistorical context\nThere is no more difficult diplomatic task than ending a war, and Trump is not the first president to learn this lesson the hard way:\nDwight D. Eisenhower, as a candidate in 1952, promised to rapidly end the Korean war, pledging “I will go to Korea” to break what was then a deadly stalemate. Once elected, he did go to Korea, but it took him seven months and threats to significantly escalate the war before negotiating an armistice to freeze the lines. The war has never formally ended.\nRichard Nixon, as a candidate in 1968, pledged an “honorable end” to the Vietnam war and was said to have a secret plan to bring it about. In fact, most of Nixon’s first term saw an escalation of the war. The Paris Peace Accords mapping out a wind-down of direct US military involvement were signed after his reelection four years later.\nBarack Obama as a candidate pledged to end the war in Iraq but he largely continued the policy that he inherited from the outgoing George W. Bush administration, which had already set in place the path for ending US combat operations in the country.\nTrump’s promises\nTrump, as a candidate in 2016, promised a “secret plan” to rapidly defeat ISIS, but then as president kept the same personnel and for the most part prosecuted the plan he inherited from Obama, defeating ISIS’s so-called caliphate in year three of his first term.\nI was a part of those last two transitions, spanning Bush-to-Obama and Obama-to-Trump, witnessing first-hand how campaign promises often clash with the hard reality of global affairs. In the recent transition from Joe Biden-to-Trump, I helped secure the agreement for a ceasefire in Gaza and the release of Israeli hostages before Trump’s inauguration.\nThis agreement led to six weeks of peace with hostages coming out and massive quantities of aid (at least 600 trucks per day) flowing into Gaza before tragically falling apart.\nFrom history and first-hand experience, I appreciate how difficult this is, particularly when – as in Gaza and Ukraine – the United States is not a direct participant in a conflict. But six months into the president’s term, it’s fair to ask what has not worked and what might be done now to produce better results over the coming weeks and months.\nWhat is so unfortunate about the current situation is that Trump inherited policies (and in one case an agreement) that were far more likely to lead to the results he promised as a candidate than the policies he adopted over the early months of his presidency.\nDiplomatic Missions Impossible\nIn any negotiation, it’s important to first understand and define what’s known as a ZOPA, or “Zone of Possible Agreement.” Is it even possible for two parties to reach a deal?\nFor example, if you are prepared to sell your car for no less than $5,000, and a buyer is prepared to pay no more than $6,000, the ZOPA is the range between the two, and a broker can easily close a mutually agreeable deal.\nWhen approaching a negotiation in international affairs, the issues are far more complex, but the framework for any diplomatic strategy is similar. The negotiator must consider all potential areas of leverage and compromise to map out a possible ZOPA.\nApplying this framework to both Gaza and Ukraine demonstrates why the two situations are so intractable from the standpoint of a diplomatic outcome.\nIn Gaza, no ZOPA – thus, a phased deal\nIn Gaza, the terrorist group Hamas has had one core demand from the moment it invaded Israel and slaughtered over 1,000 people and stole nearly 250 people as hostages. That demand is to stay in power as the ruling authority in Gaza under cover of an internationally recognized and permanent ceasefire and reconstruction plan. Hamas to this day has not accepted even a discussion of handing security responsibility to another entity – such as a coalition of Arab forces, or other Palestinian forces – even as it’s militarily battered.\nIsrael flatly rejects that demand. It is committed to an outcome whereby Hamas at the end of the war is no longer willing or able to control Gaza. The United States has endorsed that outcome, as have many other countries. The prime minister of the UK, Keir Starmer, just yesterday while seated next to Trump, said the UK would not allow Hamas to remain in power in Gaza but he did not offer any ideas as to how to achieve that outcome, let alone what the UK or other partners of the United States might do to bring it about.\nGiven that there is no ZOPA whatsoever when it comes to Israel and Hamas, the United States, together with Egypt and Qatar, formulated a negotiation to secure the release of hostages in exchange for temporary ceasefires that might then be extended. This began in November 2023, with a deal to release all the women and children then held by Hamas in exchange for a rolling ceasefire. Over 100 hostages were freed before Hamas broke the deal by refusing to release the younger women hostages.\nIn May of last year, President Biden set forth a three-part framework for the release of hostages and a roadmap for ending the war altogether. This deal ensured the release of remaining women, older men and sick and wounded hostages in exchange for a ceasefire, Israel’s military withdrawal from populated areas in Gaza, release of Palestinian prisoners and a massive sustained surge in humanitarian aid that the ceasefire would enable.\nThe second phase would see a full withdrawal of Israeli forces from Gaza subject to both sides agreeing on “conditions” for the post-war phase. That phase would need to include a new governance structure without Hamas in a meaningful role. So long as mediated talks were ongoing towards that outcome in good faith, the ceasefire would continue.\nThis phased arrangement was endorsed unanimously by the UN Security Council and helped place the spotlight on Hamas to release hostages and stop the war.\nIn Ukraine, no ZOPA and no deals\nUkraine similarly lacks a ZOPA between warring parties. Russia’s intent from the start has been to subjugate the entirety of Ukraine, to annex significant portions of its territory, and to “de-militarize” the country. Ukraine flatly rejects this, seeks to eject Russian troops, and aims to join NATO or secure western military security guarantees in another form.\nWithout a ZOPA to be found, the United States since the war began and in coordination with its NATO allies had sought to increase Ukraine’s bargaining power through military support and economic assistance, as well as economic pressure against Russia, while seeking at most to broker smaller deals such as prisoner exchanges or localized truces before seeking a longer-term ceasefire, let alone settlement of the conflict.\nTrump’s approach has been inconsistent at best. In February, he berated Zelensky as the obstacle to peace whereas the next month his administration deemed Russian reciprocity as the key to peace. This month, Trump’s defense chiefs announced a pause on military assistance to support Ukraine before Trump himself days later reversed that decision and announced significant military support to Ukraine through NATO allies.\nThe result has been constant diplomatic motion by the president and his emissaries but no forward movement against the backdrop of ongoing Russian escalations.\nSix months adrift\nIn Gaza, the Biden ceasefire was secured through painstaking negotiations with pressure applied to both Israel and Hamas to make necessary compromises. At the same time, the Biden administration consistently focused on the humanitarian situation, rejected calls by Israeli ministers to blockade or besiege Gaza, and publicly condemned calls by hard-right Israeli leaders calling for the depopulation of Gaza altogether.\nEvery day throughout the crisis, even while negotiating the ceasefires, my first call every morning was with our senior humanitarian coordinator for Gaza, USAID experts and our team in Israel to ensure aid continued to flow and to address blockages or bottlenecks wherever possible.\nTrump from the start took the opposite approach. He abolished the humanitarian aid coordinator position. He abolished USAID, which was responsible for overseeing US-provided aid in Gaza. He said nothing as Israel imposed an unprecedented 77-day blockade on aid deliveries. He called for mass displacement of Palestinians from Gaza, and Itamar Ben Gvir, an extremist Israeli minister that calls for the same, was welcomed into the United States and feted by guests at Trump’s Mara Lago resort.\nOnly in the last 48 hours and in the face of an international uproar have Israel and the US adjusted their approach to once again support and enable UN deliveries of aid.\nThe result has been tragic, with Gaza witnessing the worst humanitarian catastrophe of the war and diplomacy now deadlocked as Hamas basks in the international condemnation of Israel even as it holds hostages in tunnels and hardens its demands in ceasefire talks.\nIn Ukraine, the Trump administration over its first six months sought to entice Russian President Vladimir Putin with promises of sanctions relief while refusing to replenish the pipeline of assistance that had helped Ukraine defend itself and protect its people from Russian attacks. Putin answered Trump’s entreaties with escalations and doubled down on his own maximalist demands at the negotiating table, believing that he now held all the cards.\nThe result was an eroding position for Ukraine and increasing confidence in Moscow, the recipe for an even longer war that Putin believed he might now win.\nFortunately, Trump two weeks ago dramatically shifted course and promised military assistance to Ukraine through NATO as well as brandishing sanctions against Russia and tariffs on countries (mainly India and China) that purchase Russian energy products unless Putin accepts a ceasefire by September 2. Trump yesterday reaffirmed this new policy and pledged that his September 2 deadline on Putin may now come even sooner.\nNow, a reset\nTo ensure the next six months produce better results, it’s important for the White House to follow through on the recent adjustments in approach.\nFor Gaza, this means truly prioritizing the humanitarian crisis. Where pressure is required on Israel, it must be applied deliberately and consistently. Where pressure is required on the UN and other distributors, it must be applied there as well. Yes, Hamas uses suffering of civilians to advance its cause, and Hamas benefits indirectly and in some cases directly from the flow of assistance, but the assistance must flow regardless. The administration could buttress this approach by restoring the senior humanitarian adviser position, to ensure the concerted and daily focus on this problem as will be required.\nAlong with urgently addressing the humanitarian crisis, the US should not give up on the ceasefire talks because without them there is no serious hope of freeing the hostages or ending the war anytime soon. If Israel must make final compromises on an issue or two, then at this stage it must do so, and the White House should demand it. If the issue as usual is Hamas, then the mediators should make this clear publicly and place the onus and the ongoing suffering on the backs of Hamas’ leaders where it belongs.\nAs for Ukraine, the path is more straightforward: follow through on the new policy that Trump just yesterday reinforced. That means getting ready to sanction purchasers of Russian energy products, while working with our NATO allies to surge military materiel into Ukraine. This will not lead to an immediate breakthrough, but by buttressing Ukrainian defenses and demonstrating that pending sanctions are serious and on the way, Washington can reset the table for a future diplomatic push in lockstep with its European allies, something that Putin only a few months ago thought he could avoid."
    },
    {
      "url": "https://www.cnn.com/2025/07/09/europe/russia-air-assault-ukraine-kyiv-intl-hnk",
      "text": "Hundreds of Russian drones flying from all directions attacked Kyiv overnight into Thursday in an apparent new Russian tactic, marking a second consecutive night of ferocious attacks on Ukraine.\nAt least two people were killed, including a 22-year-old police officer who was named by authorities as Maria Dziumaha, and more than a dozen were wounded in the attacks, according to authorities.\nCNN staff on the ground in Kyiv witnessed massive, fiery explosions that illuminated the night sky. Smoke filled the air, creating a burning smell and obscuring the visibility in the city center.\nRussia has been intensifying its aerial attacks against Ukraine in recent weeks, but the assault on Thursday appeared to mark a change in approach from Moscow.\nRussia launched 400 drones and 18 missiles, including eight ballistic and six cruise missiles, according to a Telegram post from Ukrainian President Volodymyr Zelensky.\nThey were flying at different altitudes, and attacking from all directions — with some of the drones initially bypassing the capital before abruptly changing direction and speeding back towards the city.\nWhile Kyiv has previously experienced attacks from multiple directions, as Russian drones attempted to bypass the city’s air defenses, the assault on Thursday saw the drones launching towards the city simultaneously, effectively encircling Kyiv before attacking.\nThis made guarding the capital’s skies even more challenging for the strained Ukrainian air defenses. Yet the Ukrainian Air Force said it shot down or disabled 382 of the 415 aerial weapons Russia launched at the country overnight, including all of the ballistic and cruise missiles. That is a stunning success given the scale of the attack, especially given Ukraine’s limited access to air defense systems.\nMany Kyiv residents spent another sleepless night in shelters, listening to the terrifying sounds of explosions and drones flying overhead.\nNadiya Voitsehivkya, 63, told CNN her brother-in-law has been taken to hospital with injuries he sustained when his apartment was struck.\n“Everything in it was completely destroyed, and (my sister) escaped in her underwear. She managed to escape, but her husband didn’t make it; he was crushed by a slab. The ambulance took him away,” she said, tears rolling down her cheeks.\n“We don’t know where to turn: I don’t know who can help us. Everything there is burned down; there is nothing left of that apartment.”\nAs terrifying as the night was for Kyiv’s residents, these massive aerial attacks have become the new normal for Ukrainian civilians.\nJust on Wednesday, Russia conducted its largest drone assault since the start of its full-scale invasion, launching 728 drones and 13 missiles in strikes that killed at least one person, according to Ukrainian officials.\n“This is an obvious build-up of terror by Russia,” Zelensky said on Thursday, adding that he would be talking to allies about more funding for interceptor drones and air defenses.\nThe damage from the latest offensive attacks appeared to be substantial.\nThe Russian Defense Ministry said Thursday that it was targeting “Ukrainian military-industrial complex enterprises in Kyiv and military airfield infrastructure.”\nBut houses and residential buildings, cars, warehouse facilities, offices and other buildings across the city were damaged and caught fire, according to city authorities.\nA health care clinic was almost completely destroyed in the strikes, Kyiv’s mayor Vitali Klitschko said.\nTetyana, a 68-year old Kyiv resident who asked for her last name not to be published because of fears for her security, said the windows in her apartment were smashed by the pressure wave from a nearby explosion.\n“We survived the night, it was very scary. There were a lot of people in the basement … there was a humming, whistling, banging. Fire broke out. The windows were shattered, everything was broken, the walls. … My hands are still shaking,” she told CNN.\nPeace talks going nowhere\nAs Russia ramped up its aerial attacks against Ukrainian cities, efforts to reach a ceasefire have largely stalled.\nUS President Donald Trump has become increasingly frustrated with the Russian leader Vladimir Putin.\n“We get a lot of bullsh*t thrown at us by Putin, if you want to know the truth,” Trump said in a Cabinet meeting on Tuesday. “He’s very nice all of the time, but it turns out to be meaningless.”\nRussia’s sustained assault in recent days has injected new urgency into questions surrounding Washington’s commitment to defending Ukraine, as the Trump administration pledged to send additional defensive weaponry to Kyiv in an apparent policy reversion.\nMoscow downplayed Trump’s harsh words in a press briefing Wednesday. A Kremlin spokesperson said it is reacting “calmly” to Trump’s criticism of Putin. “Trump in general tends to use a fairly tough style and expressions,” Dmitry Peskov said, adding Moscow hopes to continue dialogue with Washington.\nUS Secretary of State Marco Rubio met Russian Foreign Minister Sergey Lavrov in Malaysia on Thursday, where he said he relayed Trump’s “disappointment and frustration” during a “frank conversation.”\nTrump’s Ukraine envoy Keith Kellogg weighed in, as well, calling Russia’s latest attacks “simply horrific” in a speech at the Ukraine Recovery Conference in Rome.\nZelensky said at a new conference at the same summit on Thursday that all signals point toward the US resuming its aid to Ukraine.\n“It is important that, following very constructive and very positive conversations with President Trump, we have all the necessary political signals regarding the resumption of aid supplies,” Zelensky said. “We are now working at the team level to ensure that everything arrives in Ukraine on time. We have agreed on all of this.”\nZelensky added that at the recovery conference, he discussed purchasing expensive Patriot missile systems with representatives from the US and European countries.\nFollowing Wednesday’s record drone attack, Zelensky said there had been “so many attempts to achieve peace and cease fire, but Russia rejects everything.”\nThis story has been updated with additional developments.\nCNN’s Anna Chernova, Svitlana Vlasova, Max Saltman, Jennifer Hansler, Ollie Ieltsov and Sophie Tanno contributed reporting."
    },
    {
      "url": "https://www.cnn.com/2025/06/21/politics/trump-iran-air-strikes",
      "text": "The United States decisively entered into conflict with Iran on Saturday after President Donald Trump ordered US warplanes to drop massive bombs on three nuclear sites inside the country, thrusting him squarely into an escalating Middle East conflict even as he holds out hope the matter can be resolved diplomatically.\nIn social media posts and during a late-night address from the White House, Trump described the bombings as entirely successful and warned Iran against retaliation.\n“Our objective was the destruction of Iran’s nuclear enrichment capacity and a stop to the nuclear threat posed by the world’s No. 1 state sponsor of terror,” Trump said during his four-minute speech from the White House Cross Hall.\nHe described the mission as a “spectacular military success” and called on Iran to immediately return to diplomatic efforts to end the conflict. He said the sites had been “totally obliterated.”\n“Iran, the bully of the Middle East, must now make peace,” Trump said, flanked by his vice president, secretary of state and defense secretary. “If they do not, future attacks will be far greater and a lot easier.”\nThe US strikes on the Iranian nuclear sites, which Trump identified earlier as Fordow, Natanz and Isfahan, significantly ratchet up tensions in the country, and amounts to one of the most consequential choices of Trump’s young second presidency. The debate over whether to target Iran directly had divided Trump’s political coalition, with concerns high among some members of the Republican base that intervening could drag the US into a new, prolonged conflict.\nThe US used six B-2 bombers to drop a dozen “bunker buster” bombs on the Fordow nuclear site, a US official told CNN. Trump said in a message on social media that “a full payload of BOMBS was dropped on the primary site, Fordow.”\n“There is not another military in the World that could have done this,” Trump wrote. “NOW IS THE TIME FOR PEACE!”\nThe bombs used in the strikes were GBU-57A/B Massive Ordnance Penetrators, known as a “bunker busters,” two sources familiar with the operation said. Experts have highlighted them as the only type of bomb potentially capable of destroying Iran’s underground Fordow nuclear facility.\nThe MOP — a 30,000-pound bomb with 6,000 pounds of explosives — was designed for “reaching and destroying our adversaries’ weapons of mass destruction located in well-protected facilities,” according to a fact sheet from the US Air Force. Saturday is the first known instance of the bomb being used operationally.\nThe move to target the Fordow facility in particular, which successive US presidents had considered but ultimately decided against, will now insert Trump directly into a growing crisis that he had once hoped to defuse through diplomacy.\nThe decision to target Iran directly came days after the White House announced Trump would allow for two weeks to determine whether diplomacy was possible to resolve the conflict.\nIt’s the first time in several decades — since the Iranian revolution in 1979 — that an American president has deployed Air Force assets to target major facilities in the country.\nIn his remarks Saturday night, Trump described himself as a longtime opponent of allowing Iran to obtain a nuclear weapon.\n“I decided a long time ago that I will not let this happen,” he said.\nThe US gave Israel a heads-up on its strikes before launching them, two officials familiar with the matter told CNN. Trump and Israeli Prime Minister Benjamin Netanyahu also spoke Saturday evening following the strikes, two White House officials said.\nTrump said during his speech that he and Netanyahu had worked closely to coordinate the attacks in Iran. The Israeli leader praised Trump’s decision, saying it will “change history.”\n“President Trump, I thank you. The people of Israel thank you,” Netanyahu said in a statement.\nAs Trump was mulling his decision, Iran had vowed to retaliate to any US aggression, and American military assets had begun massing in the region to prepare for any retaliatory action from Tehran. After his address to the nation, Trump issued a stark warning to Iran, saying any retaliation will be met with “far greater” force than the Saturday strikes.\nTrump appears hopeful the strikes will propel Tehran back to negotiations, and there were no plans for additional US actions inside Iran on Saturday evening as he presses Iranian leaders to “agree to end this war,” according to sources familiar with the matter.\nTrump had come to believe over the last several days that US forces were necessary to taking out Iran’s highly fortified nuclear facilities, and made the decision when it seemed clear that diplomacy remained deadlocked.\nUS officials had come to believe Iran was not ready to strike a satisfactory nuclear deal after Europeans leaders met with their Iranian counterparts in Geneva on Friday, two sources familiar with the matter told CNN.\nIran’s foreign minister said after the Geneva meeting that Iran would not sit down with the United States without Trump asking Netanyahu to stop Israel’s attacks, which was not something the president was willing to do, the sources said.\nThis story has been updated with additional information.\nCNN’s Alayna Treene and Kristen Holmes contributed to this report."
    }
  ],
  "argos_summary": "The upcoming Trump-Putin summit in Alaska is seen as a critical moment for U.S. diplomacy regarding the ongoing war in Ukraine, with President Trump emphasizing the need for a full ceasefire as a prerequisite for negotiations. Analysts suggest that Trump should adopt a firm stance similar to Ronald Reagan's approach during the Reykjavik summit with Gorbachev, avoiding distractions from unrelated issues and focusing solely on Ukraine. The article warns that any concessions to Russia without a ceasefire could undermine Ukraine's position and ultimately lead to a failure in achieving lasting peace.",
  "argos_id": "WPBNVWW64"
}