{
  "url": "https://www.dallasnews.com/sports/rangers/2025/08/11/texas-rangers-mlb-offense-chris-young-bruce-bochy/",
  "authorsByline": "Evan Grant",
  "articleId": "17d7aa885a5e4b79b9b9b1ce44aa5226",
  "source": {
    "domain": "dallasnews.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "TX",
      "county": "Dallas County",
      "city": "Dallas",
      "coordinates": {
        "lat": 32.7762719,
        "lon": -96.7968559
      }
    }
  },
  "imageUrl": "https://dmn-dallas-news-prod.cdn.arcpublishing.com/resizer/v2/B33WHA622BFHDDHFB4U3WQFVEQ.jpg?auth=c163604fbd42ef187fa63d2115bb1231f6d212fd7abb10427060761ac7af5cd9&quality=80&width=1200&height=630&smart=true",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T02:17:00.432000+00:00",
  "addDate": "2025-08-12T02:30:52.661308+00:00",
  "refreshDate": "2025-08-12T02:30:52.661309+00:00",
  "score": 1.0,
  "title": "‘It shouldn’t happen’: How the Rangers’ offense tends to get worse as the game goes along",
  "description": "Texas exemplified its issue of scoring runs later into games against Philadelphia, scoring in the first inning of all three games, then putting up a total of...",
  "content": "ARLINGTON - A Rangers official posed a question Monday: Have all the columns about the ineffectiveness of the offense been exhausted?\n\nOf topics, the Rangers’ offense has been a prolific producer. Of actual runs: Not so much.\n\nIt’s been established the Rangers offense struggles against lefties. Also: on the road. Add top-tier pitching, too. Much of that can be explained by pure physical deficiencies or something as easy as playing away from home. What may be most damning about an offense that has become accustomed to profanity is this: The team doesn’t seem to get better as the game progresses.\n\nWhat it suggests: Either a lack of feel or as president of baseball operations Chris Young once described it earlier this year a lack of “connectivity.”\n\nConsider the natural flow of the game. Some teams are hot starters, other are not. But according to league averages, teams see about a 4% increase in run production from the first three innings to the middle three. Pitchers have shown most or all of their repertoire the first time through the order. They may start to fatigue. The advantage moves towards the hitter. Then, when facing high-leverage relievers late in games, it drops off again.\n\nNot the Rangers. They start out OK enough, ranking 12th in the majors in run scored through the first three innings. Then, when other offenses are figuring things out, they go flat. They have a dropoff of 6% in scoring in innings 4-6 and their 119 total runs from the seventh through the ninth are last in baseball.\n\nThat sure appeared to be crystal clear over the weekend, when the Rangers scored in the first inning of all three games against Philadelphia, then scored a total of one run after that.\n\nIt’s almost like they either don’t - or can’t - make adjustments.\n\n“I know it’s there because I’ve seen it,” co-hitting instructor Bret Boone said Monday. “But why do we go in these extreme lows? Is it a lack of focus? No, these guys want to win. They want to do well. We do all get caught up in our individual numbers. I’d be lying to you if I always thought, ‘Oh, I’m not worried my number. Let’s just win.’ No, let’s just win. But I want my numbers too. You want to contribute.\n\n“The thing that really just grates on me is when we have a runner on third and less than two outs. Let’s get this runner in. I love it when we move the runner. The energy is unbelievable. And I can’t tell you the difference between scoring one run in an inning and two. It’s a world of difference. I can’t say they they’re not capable of making adjustments, but you have a fair point that we’ve gone through streaks during the season - and big streaks - where we tend to take the middle innings off, and now all of a sudden, it’s 2-2 in the eighth and we’re facing high leverage guys.”\n\nMaybe the best way to measure guys ability to make adjustments from at-bat to at-bat is in on-base percentage. Getting on base moves the line and continues to build stress on the pitcher.\n\nThe Rangers OBP stays essentially flat innings 1-3 (.312) to innings 4-6 (.311), then drops precipitously in the late innings (.269). Among the biggest dropoffs from the first three to the middle three are Josh Smith (.402 to .308), Josh Jung (.360 to .224), Kyle Higashioka (.361 to .196) and Adolis García (.301 to .264).\n\nBoth Smith and Jung, each in their first three seasons, acknowledged that pitchers are gaining an advantage on them.\n\n“Maybe they are making a better adjustment off of me based on my first at-bat and I’m not properly adjusting to them,” Smith said. “I don’t think I change a lot from at-bat to at-bat. It could just be coincidence.”\n\nIt could. It could also be yet another telling sign that this offense simply doesn’t work as intended.\n\nEven manager Bruce Bochy, who does everything he can to find reasons to support his offense, had a hard time trying to dismiss it.\n\n“We talk about it, how important it is every inning,” Bochy said. “I wish I had a good answer for you. It shouldn’t happen.”\n\nYet it has.\n\nFind more Rangers coverage from The Dallas Morning News here.\n\nClick or tap here to sign up for our Rangers newsletter.",
  "medium": "Article",
  "links": [
    "https://www.dallasnews.com/person/2ebb17df-1b51-eacd-b1ea-d8c1176b9c30/chris-young/",
    "https://www.dallasnews.com/topic/josh-jung/",
    "https://www.dallasnews.com/sports/rangers/2025/08/11/texas-rangers-mlb-wyatt-langford-bruce-bochy/",
    "https://www.dallasnews.com/newsletters/",
    "https://www.dallasnews.com/help/privacy-policy",
    "https://www.dallasnews.com/topic/texas-rangers/",
    "https://www.dallasnews.com/person/e2bf7fd8-d54f-2480-453a-2d4ac0d58082/adolis-garcia/",
    "https://www.dallasnews.com/person/3cc208c8-b520-881d-2c77-0732b22f401c/bruce-bochy/",
    "https://www.dallasnews.com/sports/stars/2025/08/11/stars-release-2025-26-promotional-schedule-featuring-mikko-rantanen-bobblehead-night/",
    "https://www.dallasnews.com/sports/rangers/",
    "https://www.dallasnews.com/help/terms-of-service/",
    "https://www.dallasnews.com/sports/rangers/2025/08/11/texas-rangers-mlb-first-base-platoon-jake-burger-rowdy-tellez/",
    "https://www.dallasnews.com/sports/rangers/2025/08/10/texas-rangers-philadelphia-phillies-sweep-offense-struggles/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "other offenses",
      "weight": 0.079526626
    },
    {
      "name": "more Rangers coverage",
      "weight": 0.07640508
    },
    {
      "name": "Rangers",
      "weight": 0.07544527
    },
    {
      "name": "first",
      "weight": 0.070387915
    },
    {
      "name": "run production",
      "weight": 0.065463744
    },
    {
      "name": "actual runs",
      "weight": 0.062433865
    },
    {
      "name": "run",
      "weight": 0.062254783
    },
    {
      "name": "high leverage guys",
      "weight": 0.059030667
    },
    {
      "name": "innings",
      "weight": 0.058762714
    },
    {
      "name": "bat",
      "weight": 0.057877965
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.98193359375
    },
    {
      "name": "/Sports/Team Sports/Baseball",
      "score": 0.95263671875
    }
  ],
  "sentiment": {
    "positive": 0.06151122,
    "negative": 0.73307425,
    "neutral": 0.20541456
  },
  "summary": "The Rangers' offense tends to get worse as the game progresses, with a dropoff of 6% in scoring in innings 4-6 and 119 total runs from the seventh through the ninth. The team struggles against lefties and on-the-road opponents, as well as top-tier pitching. However, the team's performance seems to improve as game progresses. Co-hitting instructor Bret Boone believes the team doesn't make adjustments, either to the hitter or to the pitcher. The Rangers' on-base percentage also indicates a lack of ability to adjust from at-bat to bat. Manager Bruce Bochy has had a difficult time trying to support his offense, but believes it's a sign that this offense doesn't work.",
  "shortSummary": "The Rangers' offense tends to decline as they progress, with key players like Josh Smith and Adrien Gilder struggling against lefties.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "d6446a0158ef45648a6f0d380e06c30d",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.dallasnews.com/sports/rangers/2025/08/10/texas-rangers-philadelphia-phillies-sweep-offense-struggles/",
      "text": "ARLINGTON — The Texas Rangers staggered into Sunday’s series finale vs. the Philadelphia Phillies after three games in a five-day span against a trio of left-handed starting pitchers with favorable odds to win the Cy Young award in their respective leagues.\nTheir reprieve was one of baseball’s premier right-handers.\nThe difference in outcome — and the way they arrived to it — was negligible at best. Elite pitchers are impossible to escape, Rangers manager Bruce Bochy cautioned, and offered the reminder that good teams are able to produce runs nonetheless.\n“If we think we are who we are,” Bochy said, “then we find a way to get those runs.”\nAbout that.\nThe Rangers, through 119 games, are a barely-over-.500 team that’s on the outside of the postseason after a series loss vs. the Philadelphia Phillies at Globe Life Field that featured three identical losses. Sunday’s 4-2 loss vs. All-Star right-hander Zack Wheeler, Saturday’s 3-2 loss vs. left-hander Jesús Luzardo and Friday’s 9-1 loss vs. Cy Young award candidate Cristopher Sánchez were each marred by the same inability to build on quick starts.\n“I think it’s kind of a lull right now,” leadoff hitter Josh Smith said Sunday after an 0-for-5 day. “We’ve faced some pretty good pitching, but, we’ve got to do a better job and win those games.”\nThe Rangers have scored the fewest runs in baseball against teams with an above-.500 record this season and, against all pitchers they’ve faced with a 3.00 ERA or better, have not once scored more than four runs. Sunday’s loss included that continuation of a troubling trend in which early offense is followed by zeroes. Bochy officially categorized it as a “funk” Sunday afternoon.\nIt’s one thing to recognize it.\nIt’s another to escape it.\n“We changed the lineup today,” Bochy said when asked how, exactly, Texas can break the habit. “We mixed it up, moved guys around a little bit, you try that.”\nThe attempt was not in vain. The Rangers bumped right fielder Adolis García out of the four-hole and replaced him with designated hitter Joc Pederson. A first-inning two-run home run vs. Wheeler, Pederson’s second this homestand, gave the Rangers an early lead.\nThe issue continued to lie in the eight innings that followed. The Rangers were shut out in the second through ninth innings Sunday afternoon and went 6 for 25 and advanced just one runner to second base after Pederson’s home run.\nThey scored four runs in the three combined first innings of this series and scored just once — on a home run from shortstop Corey Seager in the eighth inning of Saturday’s loss — in the other 24 frames. Seager would have hit a game-tying home run in the bottom of the fifth inning Sunday had Philadelphia center fielder Harrison Bader not leaped and caught the ball before it landed in the Texas bullpen.\nTeams on average have a .705 OPS when they face pitchers the first time through a batting order and it increases to .735 and .754 by the second and third trips through. That’s a 0.49-point improvement from the first to the third. The Rangers, who have a .666 OPS against pitchers the first time through the order, do not make a comparable jump when the face starters for a second and third time.\n“It’s a pretty simple game,” Bochy said. “You’ve got to get a big hit when you do get guys on base. That’s been missing.\"\nPitching and defense, as it has been all season, was not. Left-hander Patrick Corbin allowed three runs in 4⅓ innings and was bailed out in the second inning by a sliding catch from center fielder Wyatt Langford (that he ran 75 feet into right field to snag) and a circus catch one at bat later from García on a shallow pop fly.\nIt’s a reminder of the elite play that Texas has been unable to capitalize on this year. The Rangers’ 3.28 ERA and .991 fielding percentage both lead the league. Only three teams have led baseball in both categories this century; each made the postseason and two, the 2001 Seattle Mariners and 2018 Houston Astros, advanced to the championship series.\nThe Rangers are 2½ games back of the last wild card berth and six-and-a-half games back of the American League West lead with 43 games left to play. They have a 21.9% chance to make the playoffs, according to FanGraphs.\n“There’s a bunch of games left,” Corbin said. “We’ve got to start winning some of them.”\nFind more Rangers coverage from The Dallas Morning News here."
    },
    {
      "url": "https://www.dallasnews.com/sports/rangers/2025/08/11/texas-rangers-mlb-first-base-platoon-jake-burger-rowdy-tellez/",
      "text": "ARLINGTON — If it looks like a platoon and swings like a platoon, it is most likely a platoon.\nThat’s what the Rangers have at first base at the moment.\nAgainst right-hander Ryne Nelson on Monday, the Rangers started left-handed hitting Rowdy Tellez. It was the second straight game Tellez started at first. Right-handed hitting Jake Burger, who was activated Friday following a three-week stint on the injured list because of a quadriceps strain, started against lefties the first two nights back.\n“I haven’t said that [it’s a platoon],” manager Bruce Bochy said. “But that’s kind of how I’m doing it right now, especially with how Burger’s quad has been.”\nBurger’s performance against right-handed pitching this year has lagged. He’s hitting just .220/.248/.376/.624 against right-handed pitching in 226 plate appearances. The on-base percentage is particularly telling. It is the third lowest among 237 major leaguers with at least 200 plate appearances against right-handers this season. It underscores the all-or-nothing element that is the Rangers’ lineup.\nTellez hasn’t been significantly better at reaching base against right-handers, posting a .268 OBP in 192 plate appearances entering Monday, but he has slugged at a .469 clip to post a .737 OPS against right-handers.\nFind more Rangers coverage from The Dallas Morning News here."
    },
    {
      "url": "https://www.dallasnews.com/topic/josh-jung/",
      "text": "Texas exemplified its issue against Philadelphia, scoring in the first inning of all three games, then putting up a total of one run after that.\nBruce Bochy was not commital to Garcia remaining the Rangers’ full-time closer on Tuesday.\nVincent Gaggiano spent Tuesday with the Rangers on behalf of the Make-A-Wish foundation.\nGray’s outing in Monday’s win over the Yankees, provided a glimpse into the flexibility he could give Texas during its playoff push.\nJung missed the Rangers’ four-game series in Seattle with a calf issue, but is DHing Monday against the Yankees.\nJung missed his fourth straight game due to a left calf issue and hasn’t responded as quickly as the Rangers hoped.\nThe Rangers recalled outfielder Alejandro Osuna from Triple-A Round Rock ahead of Saturday’s game.\nBoth Coulombe and Maton have some history with their new Rangers teammates. On Friday, the relievers made nice introductions.\nPlus, the Rangers’ busy trade deadline created a roster crunch that required some maneuvering.\nThe Rangers were active at the trade deadline, boosting their bullpen and starting rotation, but not their lineup.\nBurger was placed on the injured list with a quadriceps issue coming out of the All-Star break.\nTexas went 8-1 on its nine-game homestand that was especially important with the trade deadline looming.\nLangford got the Rangers on the board early on Sunday and they never looked back.\nThe Rangers optioned Jung to the minors to improve the swing decisions that caused him significant issues during the season’s first half.\nTexas’ steady second baseman overcame a scary moment early in the game to come up clutch in extra innings.\nThe Rangers selected Fien, a high school shortstop, with the No. 12 pick in the 2025 MLB draft.\nPart performance, part upcoming matchups, the reason may be entirely irrelevant to Jung after a stint in Triple-A.\nJung, still in Triple-A after struggling through June, is “not quite there yet,” according to Bruce Bochy.\nIf the Rangers are going to claw their way back into the playoffs, it’s going to be all hands on deck during the final stretch."
    },
    {
      "url": "https://www.dallasnews.com/sports/rangers/2025/08/11/texas-rangers-mlb-wyatt-langford-bruce-bochy/",
      "text": "ARLINGTON — The Rangers believe Wyatt Langford has 30-homers, 30-steals ability.\nBut he’s gone into both a power and speed brownout since the All-Star break. Langford began Monday’s game without a homer or a stolen base in the second half. He last homered on July 11 at Houston and last stole a base on July 12, also at Houston. He has 15 homers and 15 steals for the season.\nLangford was in a 2-for-17 stretch entering the Arizona series.\n“When he’s right on, he’s pulling more balls,” manager Bruce Bochy said. “He’s not doing that as much. He’s staying on the breaking ball a little bit better and doing a good job of controlling strikes on it and getting his walks. Sometimes you can overdo that a little bit and lose a little bit of what you do well. It’s a fine line.”\nIt’s another way of saying Langford can fall into a pattern of getting passive at the plate. Since the All-Star break, Langford had taken 10 called third strikes, tied for the fifth most in the majors. For the year, he had taken 38, seventh most in the majors.\nThere isn’t as easy an explanation for why he’s stopped running as often, though he has been caught on three consecutive attempts. One explanation may be the proliferation of lefties the Rangers are facing lately. In addition to being harder for the club to hit, they are better at controlling the running game.\nAs a team, the Rangers are just 9 for 16 (56%) on stolen base attempts.\n“We’re not shutting him down or anything,” Bochy said. “I will say some of the pitchers we’re facing are not giving us as much of a chance to run. We’ve made some outs on the bases lately. We’re trying to pick our spots a little more so we’re not running ourselves out of innings. But [Langford] is not being shut down.”\nFind more Rangers coverage from The Dallas Morning News here."
    },
    {
      "url": "https://www.dallasnews.com/sports/stars/2025/08/11/stars-release-2025-26-promotional-schedule-featuring-mikko-rantanen-bobblehead-night/",
      "text": "It’s never too early to start planning ahead, right?\nThe Dallas Stars released their promotional schedule for the 2025-26 season on Monday. It includes the team’s recognition nights, giveaways and theme nights.\nSome of the highlights include Pickleball Night, in which fans can get a limited edition Stars pickleball paddle, Mikko Rantanen bobblehead night, three different Retro Nights, Texas Rangers Night, Video Game Night and more.\nIn what will probably be the most popular promotion of the year, you should probably plan to get to the American Airlines Center early on November 4 when the Stars take on the Oilers if you want to land your own Rantanen bobblehead.\nSee the full schedule below.\nHome opener: Oct. 14 vs. Wild\nFans can score a magnet schedule at the Stars’ first home game of the year\nCollege nights\nThe Stars are partnering with 10 local colleges, and you can purchase a ticket through the Stars’ campaign to get a co-branded hat split between the Stars and that night’s college. Texas, Texas A&M, Texas Tech, UT-Dallas, North Texas, SMU, Oklahoma State, UT-Arlington and Baylor are each represented in the promotion.\nSee the dates for each college’s night here.\nPickleball Night: Oct. 23 vs. Kings\nEach discounted ticket purchased through the Stars’ offer will include a Dallas Stars Volair Pickleball Paddle.\nHalloween: Oct. 28 vs. Capitals\nEnjoy a spooky evening at the AAC in your favorite Halloween costume as Dallas faces Washington.\nMikko Bobblehead Night: Nov. 4 vs. Oilers\nGet there early if you want to land a Mikko bobblehead! Doors open at 5:30 p.m. and fans will probably be lining up well before then to get their bobblehead of the Moose.\nMilitary and Veterans Appreciation Night: Nov. 9 vs. Kraken\nA limited number of military-themed hats will be given out to early-arriving fans. Doors open at 4:30 p.m. and puck drops at 6 p.m.\nDallas Stars Hall of Fame Celebration Night: Nov. 15 vs. Flyers\nThe team is honoring Ralph Strangis and Joe Nieuwendyk for their induction into the Dallas Stars Hall of Fame. Fans can get a commemorative poster upon entry.\nDaryl “Razor” Reaugh Hockey HOF Celebration: Nov. 18 vs. Islanders\nThe Stars’ longtime color analyst is being inducted into the Hockey Hall of Fame and the team is celebrating his achievement with a night full of “Razor-isms”\nScout Night: Nov. 18 vs. Islanders\nTickets purchased through the Stars’ promotion will come with a custom Stars scout patch.\nRetro Nights: Nov. 28 vs. Mammoth, Nov. 30 vs. Senators, Jan. 23 vs. Blues\nThe Stars say that Retro Night will include “an entertaining show that blends nostalgic throwbacks with the sport of hockey.”\nHockey Fights Cancer Night: Dec. 5 vs. Sharks\nThe Stars will be fighting against cancer on Hockey Fights Cancer Night and “I Fight For” cards will be available for fans who would like to honor loved ones who have dealt with cancer.\nHoliday Games: Dec. 13 vs. Panthers, Dec. 15 vs. Kings, Dec. 21 vs. Maple Leafs\nThese three home games will be embracing the holiday season as the Stars get in the Christmas spirit.\nNew Year’s Eve Game: Dec. 31 vs. Sabres\nGo ring in the New Year at the AAC in a New Year’s Eve-themed night as the Stars face the Sabres.\nTeacher Appreciation Night: Jan. 4 vs. Canadiens\nThe Stars are giving away a teacher appreciation tote cooler bag to fans who purchase tickets through the team’s “Teacher Tickets” offer.\nKids Day: Jan. 18 vs. Lightning\nKids ages 13 and under will get a special giveaway upon entry while supplies last.\nTexas Rangers Night: Jan. 20 vs. Bruins\nAre you a baseball fan and a hockey fan? You can scratch both those itches on Rangers Night at the AAC when a limited number of tickets will be available through an offer that will include a co-branded Stars-Rangers baseball jersey.\nBlack History Night: Feb. 4 vs. Blues\nThe Stars are celebrating Black History Month and will be giving away a Black History Night poster at the door.\nCareer Fair: Feb. 25 vs. Kraken\nThe Stars are hosting a career fair in the afternoon at the AAC for anyone wanting to work in sports. Purchasing a ticket to the career fair includes access to the Stars’ game against the Kraken.\nCountry Western Night: Feb. 25 vs. Kraken\nCareer Fair Night will have a country twist to it, too! There will be an unspecified giveaway to early-arriving fans.\nVideo Game Night: March 6 vs. Avalanche\nThe Stars say that this theme night will have “an entertaining show that blends your favorite video game concepts with the sport of hockey.” Tickets bought through their theme night link will include an Optic Gaming co-branded jersey.\nNoche Mexicana: March 10 vs. Golden Knights\nEarly-arriving fans can enjoy some Mexican cuisine and more on the plaza, including a replica fútbol jersey upon entry to the AAC. The game will include performances by various Mexican-American artists.\nFirst Responders Night: March 16 vs. Mammoth\nAll tickets purchased through the Stars’ Responders Night promotional link will include a Stars-First Responders co-branded hat.\nPride Night: March 24 vs. Devils\nThe Stars will celebrate the LGBTQIA+ community during this game and early-arriving fans will receive Pride Night themed socks.\nAlumni Game: April 4 vs. Avalanche\nAfter the Stars face the Avalanche in a playoff rematch, some Dallas Stars Alumni will take the ice for the annual alumni game.\nFan Appreciation Night: April 11 vs. Rangers\nOn the final home game of the season, the Stars will be celebrating their fans with special giveaways and prizes throughout the evening."
    }
  ],
  "argos_summary": "The Texas Rangers are struggling offensively, particularly against left-handed pitchers and in late-game situations, as evidenced by their recent series against the Philadelphia Phillies where they scored early but failed to maintain momentum. The team's on-base percentage drops significantly in the later innings, indicating a lack of adjustments against pitchers. Manager Bruce Bochy and players acknowledge the need for improvement, especially in capitalizing on scoring opportunities, as the Rangers remain on the brink of playoff contention with a challenging schedule ahead.",
  "argos_id": "XHKWOGJXW"
}