{
  "url": "https://www.cnbc.com/2025/08/12/european-defense-giants-could-move-higher-bank-of-america-says.html",
  "authorsByline": "Chloe Taylor",
  "articleId": "d67575bf01774e0ba1d7f08500fec8b6",
  "source": {
    "domain": "cnbc.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NJ",
      "county": "Bergen County",
      "city": "Englewood Cliffs",
      "coordinates": {
        "lat": 40.8853773,
        "lon": -73.9523597
      }
    }
  },
  "imageUrl": "https://image.cnbcfm.com/api/v1/image/107207524-1678713611088-gettyimages-1248129985-AFP_33B96QW.jpeg?v=1754919066&w=1920&h=1080",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T23:14:54+00:00",
  "addDate": "2025-08-11T23:19:02.674482+00:00",
  "refreshDate": "2025-08-11T23:19:02.674484+00:00",
  "score": 1.0,
  "title": "European defense giants could be about to get another big push higher, Bank of America says",
  "description": "Some regional defense stocks have more than tripled in value since the beginning of the year.",
  "content": "European defense stocks could be set for another big tailwind, according to an analyst who says the sector is about to see a surge in demand from one particular pocket of the market. Speaking to CNBC's \"Squawk Box Europe\" on Thursday, Ben Heelan, Bank of America's head of EU industrials research, said his team expects European long-only investors are yet to buy into the defense space. Many ESG funds, which have historically swerved defense investments, appear to have shifted their stance on the sector amid rising geopolitical instability and commitments from Western governments to grow their security budgets. Heelan pointed to this trend as a potential driver of more growth among already booming defense names. \"I think what we've seen actually is, if you speak to some of these investors that had previously been restricted, they're no longer restricted, but in order to be able to buy those assets within their funds, they need to update all the fund documents,\" he explained. \"They need to notify their clients what they're planning on doing. So we actually did some benchmarking of the flow situation a couple of weeks ago with our team here. And actually, we don't think that the weighting for ESG funds in Europe has actually shifted that much, which I think is very interesting — we do feel as though a lot of that re-weighting of the European ESG asset basis is still to come.\" European defense stocks have had a year of blockbuster growth, amid commitments from regional governments and the NATO military alliance — whose members are largely European nations — to drastically ramp up defense spending. The Stoxx Europe Aerospace and Defense index has gained 50% since the beginning of 2025, with the top performers seeing their valuations swell dramatically. Shares of French maritime robotics firm Exail Technologies , for example, have surged 581% over the course of the year. Meanwhile, German defense contractors Renk , Rheinmetall and Hensoldt are up 235%, 164% and 147%, respectively. EXA-FR RHM-DE,R3NK-FF,HAG0-FF YTD line European defense stocks However, regional defense stocks have been selling off over the past three sessions, as a planned meeting between U.S. President Donald Trump and his Russian counterpart Vladimir Putin raised hopes of an end to the Ukraine war. \"The reality is, you've seen a lot of hedge funds [and] macro funds being involved in these names. What we've seen over the past month has been a lot of de-grossing. So, some funds have just made a lot of money in the first six months,\" Bank of America's Heelan told CNBC on Thursday. He added that many defense stocks had recorded massive gains simply on expectations of big orders coming through from regional governments, and suggested that the materialization of those orders may help support the growth story. \"The orders in Germany, they're really going to start hitting the backlogs of companies,\" he said. \"So we're in this period where we have very, very high valuations in the short term, because we're expecting this significant trajectory of growth through to the end of this decade.\"",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "European defense stocks",
      "weight": 0.10216327
    },
    {
      "name": "regional defense stocks",
      "weight": 0.09508165
    },
    {
      "name": "European defense giants",
      "weight": 0.092722535
    },
    {
      "name": "many defense stocks",
      "weight": 0.09055497
    },
    {
      "name": "defense investments",
      "weight": 0.08171722
    },
    {
      "name": "defense spending",
      "weight": 0.07960092
    },
    {
      "name": "German defense contractors Renk",
      "weight": 0.07691303
    },
    {
      "name": "ESG funds",
      "weight": 0.076141514
    },
    {
      "name": "Many ESG funds",
      "weight": 0.07581912
    },
    {
      "name": "big orders",
      "weight": 0.07135511
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.984375
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.91015625
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.85498046875
    },
    {
      "name": "/Business & Industrial/Aerospace & Defense/Other",
      "score": 0.61474609375
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.5703125
    }
  ],
  "sentiment": {
    "positive": 0.765064,
    "negative": 0.08748808,
    "neutral": 0.14744793
  },
  "summary": "European defense stocks could be boosted by demand from European long-only investors, according to Bank of America's head of EU industrials research, Ben Heelan. This comes amid rising geopolitical instability and commitments from Western governments to increase security budgets. Many ESG funds have shifted their stance on defense investments, potentially leading to further growth in the sector. The Stoxx Europe Aerospace and Defense index has gained 50% since the beginning of 2025, with the top performers seeing their valuations rise significantly. However, regional defense stocks have been selling off recently due to hopes of an end to the Ukraine war.",
  "shortSummary": "European defense stocks are set for a significant surge due to increased demand from ESG funds, despite recent strong growth and political tensions.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "01ea3248d61e46f683fe05082986c8a1",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "European defense stocks are poised for further growth as demand from long-only investors, including ESG funds, is expected to increase due to rising geopolitical tensions and government commitments to boost security budgets. Analyst Ben Heelan from Bank of America noted that many ESG funds are reevaluating their restrictions on defense investments, which could lead to a significant re-weighting in the sector. Despite recent sell-offs linked to geopolitical developments, the defense sector has seen substantial gains this year, with the Stoxx Europe Aerospace and Defense index rising 50% since early 2025.",
  "argos_id": "XPZ1A5T72"
}