{
  "url": "https://www.pocket-lint.com/im-tired-of-in-car-subscription-services/",
  "authorsByline": "Tanner Marlar",
  "articleId": "ebd392cc929948b8a2e1c3a871f2403b",
  "source": {
    "domain": "pocket-lint.com",
    "location": {
      "country": "gb",
      "city": "London",
      "coordinates": {
        "lat": 51.5073219,
        "lon": -0.1276474
      }
    }
  },
  "imageUrl": "https://static1.pocketlintimages.com/wordpress/wp-content/uploads/2025/07/model-s_67.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T19:28:54+00:00",
  "addDate": "2025-08-11T21:03:14.275914+00:00",
  "refreshDate": "2025-08-11T21:03:14.275916+00:00",
  "score": 1.0,
  "title": "In-car subsription services are a massive scam, and I'm tired of it",
  "description": "In a time where everything comes with a subscription, even our cars are sucking away at our wallets more than ever before.",
  "content": "Do you ever feel like there are one too many hands reaching into your wallet?\n\nWhat about feeling like it's harder than ever before to get ahead? There's a myriad of reasons for that latter point in 2025, but a big one is subscriptions. Everything comes with a subscription today, from the music we listen to, the books we read, the shows we watch, and now, even the cars we drive. Many customers shot down early innovators with the idea of charging subscriptions for common car features, but that didn't stop every brand, and now, manufacturers are getting even more creative when it comes to devising new ways to charge your card.\n\nUsually, I stick to gadgets and gizmos to help drivers go about their days or road trips, but can't stand how much subscription fatigue wears me out, and we don't need our cars piling on to the problem. Therefore, I've set out to create one place where the worst of the worst car-subscription services can be found. It ain't much, but it's honest work.\n\nCharging for everything you should already get with a car\n\nFor those who have never sat in a Tesla, they're not bad places to be. I quite like the minimalist, clean styling, and have never had a poor trip in one, per se. However, I do not own one, and I doubt that I ever will for a multitude of reasons. Chiefly among those reasons is that to access most of the features on the car, you have to pay an extra $100 a year or be charged $10 a month, which is just enough to piss me off.\n\nThe cheapest Tesla, the Model 3, starts at as near as it makes no difference $45,000 for out-the-door prices, with a $7,500 tax credit until September. Tax credit or not, that's no small amount of change, and arguably the biggest selling point of a Tesla, outside the EV part, is its robust infotainment system, which you cannot fully access without paying a subscription.\n\n\"Oh, can't you just opt to not have the subscription?\"\n\nYou most certainly can, but allow me to list off just some of the features that require the premium connectivity subscription for you. Keep in mind, this is nowhere near the whole list.\n\nThose all seem pretty important, and big selling points for any Tesla. Now, allow me to list out every single option you get with the standard plan.\n• Navigation With Real-Time Traffic Along the Route\n\nThat's it. That's the only one. Absurd.\n\nThat's before we even talk about self-driving\n\nYou best believe that there's more\n\nIf you thought I was done ragging on Tesla for the wild amount of subscriptions being charged by a car company, think again, because it reaches a completely new level when it comes to the cost of self-driving subscriptions. However, this isn't a Tesla-only problem, though. Tesla, Ford, General Motors, and Mercedes all charge subscriptions for their autonomous driving software, with Mercedes being the most expensive at around $2,500 per year. However, manufacturers aren't always giving the whole truth when it comes to their self-driving levels, so take each of these with a grain of salt.\n\nThe kicker here is that Tesla's self-driving mode, which has seen some debate in its time, is just a Level Two system, which the company first attempted to charge $200 a month for. The price now sits at $99 a month, while Ford charges under $50 for Blue Cruise, and General Motors charges anywhere from $20-$40 per month, depending on the vehicle, but only after the first three years of ownership. So, if you're a Tesla owner, just know that the same tech can be had in other cars for much, much less, and you might not even end up like poor Wally from Alabama, whose FSD-equipped Tesla steered him straight into a ditch.\n\nBMW tried to start the fire\n\nBut it died out thanks to some smart consumers\n\nBack in 2020, when everyone lost their minds a bit, myself included, BMW really went off the deep end when they decided to start charging customers to use things like heated seats and advanced safety features in their cars. Consumers rose up against the changes, and just a few model years later, BMW canned the idea in favor of the traditional option checklist yet again. The thing about cars is that there always has to be a back and forth between customers and consumers. When customers like things, they tend to buy them, the manufacturers make more of them, and then the manufacturers make more money. Everyone wins.\n\nHowever, what we're seeing with subscription fatigue in modern cars is different. Most customers do not like them, and the vast majority are not buying them, yet companies like Tesla are still rolling them out at exorbitant prices, so they must be making money off them somewhere. Whether it's the age of materialism that we live in or the completely blind eye being turned towards actual drivers in 2025, I'm not sure, but if it's ever going to stop, it will take consumers deciding, as a group again, that this isn't something they're going to spend their hard-earned money on. That looks to be fast approaching, but it's hard to tell just how fast.\n\nOnly one subscription out there makes remote sense\n\nRealistically, there are three legal ways to have a car in your possession. You can buy one, lease one, or rent one. I guess you could build one, but who has that kind of time? That last one, though, is where Porsche's Drive subscription might come in handy if, say, your work allows for a certain amount to be spent on a car lease/rental per month, or you simply have the cash and want access to a stable of cool, new cars.\n\nPorsche Drive starts at around $1,700 per month for one car under a one-month or three-month subscription agreement.\n\nAfter that time is up, you can either swap out the Porsche you've been driving for another model or keep going with the one you have. Currently, Porsche Drive is only available in select cities across the U.S. and Canada, but if you live in one of those larger cities and have the income, it actually sounds quite nice. Who wouldn't want to be able to swap their 911 for something like a Macan for the family vacation at a moment's notice?\n\nIn my view, this is the only car subscription that makes remote sense, and it's really only reserved for those of us who can stand making that kind of payment, which does not include me and the majority of the world. Every car company is trying to create a vehicle for every person now, and find one model that can go through a sales boom.\n\nHowever, I'm sorry to tell you, that boom is not coming anytime soon as long as there are extra subscriptions and fees attached to every car on the market.",
  "medium": "Article",
  "links": [
    "https://carbuzz.com/cars/tesla/model-3/",
    "https://www.fromtheroad.ford.com/us/en/articles/2024/ford-lowers-bluecruise-annual--monthly-plan-pricing#:~:text=For%202025%20model%20year%20vehicles,reflected%20on%20their%20next%20payment.",
    "https://www.awin1.com/cread.php?awinmid=26123&awinaffid=326657&clickref=UUplUeUpU209914&p=https%3A%2F%2Fwww.porsche.com%2Fcanada%2Fen%2Faccessoriesandservices%2Fporschedrive%2F",
    "https://www.topspeed.com/mercedes-benz-level-3-self-driving-subscription/",
    "https://www.forbes.com/sites/peterlyon/2025/05/24/the-scary-side-to-teslas-full-self-driving-exposed-in-crash-video/",
    "https://www.tesla.com/tesla-gallery#vehicles",
    "https://www.unitedbmw.com/2021-bmw-3-series-interior/",
    "https://www.pocket-lint.com/five-gadgets-to-upgrade-your-old-car-in-2025/",
    "https://www.pocket-lint.com/ev-buyers-are-responding-to-the-end-of-federal-tax-credits-2025/",
    "https://www.topspeed.com/cars/car-news/bmw-takes-subscription-models-too-far-wants-you-to-pay-to-use-things-like-heated-seats-and-safety-features/",
    "https://cars.usnews.com/cars-trucks/advice/what-is-super-cruise#:~:text=Like%20just%20about%20every%20other,vehicle%2C%20to%20maintain%20that%20connectivity.",
    "https://www.topspeed.com/drivers-say-no-to-in-car-subscriptions/",
    "https://www.pocket-lint.com/car-gadgets-that-make-any-road-trip-a-breeze/",
    "https://www.tesla.com/support/connectivity"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "common car features",
      "weight": 0.08420248
    },
    {
      "name": "car",
      "weight": 0.08303411
    },
    {
      "name": "cars",
      "weight": 0.08303411
    },
    {
      "name": "other cars",
      "weight": 0.08210827
    },
    {
      "name": "modern cars",
      "weight": 0.08143762
    },
    {
      "name": "extra subscriptions",
      "weight": 0.08087709
    },
    {
      "name": "subscription fatigue",
      "weight": 0.08070592
    },
    {
      "name": "subscriptions",
      "weight": 0.07898808
    },
    {
      "name": "Tesla",
      "weight": 0.065020695
    },
    {
      "name": "the only car subscription",
      "weight": 0.060002938
    }
  ],
  "topics": [
    {
      "name": "Scam"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.487548828125
    },
    {
      "name": "/Shopping/Consumer Resources/Consumer Advocacy & Protection",
      "score": 0.426025390625
    }
  ],
  "sentiment": {
    "positive": 0.08793014,
    "negative": 0.59972095,
    "neutral": 0.31234887
  },
  "summary": "The article criticizes in-car subscription services, claiming that they are a scam that consumers are increasingly becoming more dependent on subscription services. Subscription services charge subscriptions for everything that customers already pay for, such as music, books, and cars. The article suggests that to access most of the features on a Tesla car, you have to pay an extra $100 a year or be charged $10 a month. This is not the first time Tesla has charged subscriptions for their autonomous driving software, with the cheapest Model 3 starting at $45,000 with a $7,500 tax credit until September. Other car companies like Ford, Ford, General Motors, and Mercedes also charge subscriptions, with Mercedes being the most expensive at around $2,500 per year. The author argues that this is not a case of subscription fatigue and that subscription fatigue is causing customers to feel more unappreciable. However, the article also notes that the cost of self-driving subscriptions is considered a significant increase. The cost of these services is not representative of Tesla's Level Two system, which the company first attempted to charge $200 a month for.",
  "shortSummary": "Subscription services, which charge for various features and subscriptions, are becoming increasingly harmful to consumers, leading to increased costs and consumer fatigue in modern-day cars.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "6375774f504b467ab27a625c4f5fc70e",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.topspeed.com/cars/car-news/bmw-takes-subscription-models-too-far-wants-you-to-pay-to-use-things-like-heated-seats-and-safety-features/",
      "text": "BMW is taking a page out of service-based pricing by turning a lot of traditional car options into software services that can be enabled (and disabled) at any point in them.\nThe German automaker made the announcement in a VR presentation that was streamed live from company headquarters in Germany. BMW tackled a series of digital updates to a lot of its models, but the most significant part of the presentation involved plans to turn a lot of its options into software services that that can be enabled through the new MY BMW app.\nSubscription-based services are not a new deal with BMW, are they?\n4\nNo, they're not. In fact, BMW has talked about this for a while. The basic gist of BMW’s planned subscription-based service is straightforward.\nSuppose you bought a 3 Series with no options for heated seats and a heated steering wheel, you can retroactively avail those options through a subscription service. These options can be added manually (hardware subscriptions) or as updates (software subscriptions) through the new MY BMW app that all new BMW models will come with as standard. BMW can offer a free three-month trial and then you can basically buy a subscription for these features for a set amount of time.\nWhat’s the difference between this new subscription tool and the Connected Drive Store that’s been operational since 2014?\nThe Connected Drive Store that BMW launched in 2014 allowed car owners to book or avail digital services, but more often than not, those features were directly tied to the car’s infotainment features.\nSafety features like active cruise control with stop-and-go functionality or a high beam assistant can be availed after-the-fact for a set period or until you have no use for them, in which case you can unsubscribe the service.\nThis is a good thing, right?\nIt’s a good thing in the sense that you don’t have to pay for heated seats in the summer when they’re basically useless. Those who lease their BMWs - a significant part of the car-buying population in the US — won’t have to spend for features that they have no use for, saving them some money in the process.\nAt the same time, consumers can cherry-pick the specifications they want from their BMWs without having to buy bloated bundles and packages that include options they don’t have any use for. In this sense, service-based subscriptions could potentially save buyers or leasers a lot of money.\nWhat’s the downside to BMW’s service-based pricing?\nFor all of the perceived benefits that this will bring to car buyers, there are some potential downsides to it, too, especially when it comes to used car sales.\nIf you’re buying a used BMW and you have to spend more to avail of features and services that have been discontinued in those cars, that’s a hit to the wallet that you probably don’t want. If money isn’t an issue, then you can have a better-equipped BMW than the previous owner of the car.\nYou’ll just have to pay extra for that distinction. It’s not hard to make the financial connection, especially when you look at it from BMW’s perspective.\nThis is another source of revenue that BMW, and other automakers, can take advantage of. Whether it becomes an actual thing that’s sustainable will be determined by how hard BMW pushes to make it happen.\nIs it going too far when you have to subscribe to safety features that you should probably get as standard on your models in the first place? Perhaps it is, but service-based pricing is the rage these days, and it seems that the auto industry is itching to jump in that bandwagon, for better or worse."
    },
    {
      "url": "https://www.pocket-lint.com/car-gadgets-that-make-any-road-trip-a-breeze/",
      "text": "Summary\n- Rove R2-4K Pro dash cam captures crisp video at a low price.\n- Anti-slip dash mats keep items secured during long drives.\n- NOCO Boost Jumper pack is a lifesaver for dead batteries, offering up to 3,000 amps.\nI work as a freelance photographer and journalist for a living in addition to being a PhD student who travels a lot for his research, so I know a thing or two about long car rides.\nEating up the highway or interstate miles can be a bit boring, especially if you're like me and don't drive a particularly exciting vehicle. However, these five gadgets have taken my driving experience to a whole new level in terms of cleanliness and accessibility.\n1 Anti-slip dash mats\nNobody wants their favorite hat, wallet, or phone sliding across the car\nThe actual mat photographed here is more than well-used. I know this because it's mine. Luckily enough for me, in my 2022 Volkswagen Taos, someone out there in the ether 3D printed a mat to lay perfectly in the dash storage compartment that was at one point, like many other vehicles, clad in the same slick plastic as what covers the rest of my dash.\nHowever, the lines blurred between where my dash started, and my storage began, until this little tray with pre-cut rubber adhesive strips came along and made the area above my infotainment system exactly what I needed it to be -- a place to put things. If you drive a different vehicle, though, not all hope is lost, as there are a plethora of model-specific and generic anti-slip dash mats out there to ensure that your favorite hats, notebook, sunglasses, phone, or wallet are sliding about the cabin on those long road trips.\n2 Wireless Carplay/Android Auto adapter\nConnectivity has never been easier than right now.\nThis is a problem that still baffles me to this day. One of my best friends owns a 2023 Toyota RAV4, and you would think that in a vehicle from this decade, wireless infotainment connectivity would be standard across the board. Unfortunately, that's not the reality, and far too many people have to take the extra few seconds to plug their phone into a cord that may or may not work that day, depending on what way the wind is blowing, to have access to the infotainment system of their choice.\nVevavi Wireless CarPlay Adapter (2025)\n- Type\n- CarPlay Adapter\n- Power Source\n- USB\n- What's Included\n- USB adapter, USB-C adapter\n- Brand\n- Vevavi\nThe Vevavi Wireless CarPlay Adapter turns CarPlay into a plug-and-play experience after a simple and short setup.\nLuckily, there are now quite a few companies producing high-quality USB devices that can essentially give any car with a screened, touch-sensitive infotainment display Carplay or Android Auto capabilities.\n3 Radar Shield Ghost PRO radar detector\nNothing can ruin a day quite like a speeding ticket or unscheduled stop.\nMy fiancé will be the first to tell you that I don't always live life in the fast lane. In fact, she wishes I would be in a bit more of a hurry more times than not. However, we don't have speeding ticket money set aside, so I try to always showcase to officers how well I obey the speed limit by using Radarshield's line of radar detectors, particularly the Ghost PRO.\nRadarshield Ghost PRO\nThe unit combines a high-tech reprogrammable wideband digital circuit, delivering flawless long-range detection and a sophisticated neutralization technique which is completely concealed from police radar detector-detection systems.\nNobody is saying you drive above the speed limit, but it certainly helps to know what to expect coming around the next curve in the interstate. I've seen one too many cars hiding in the bushes in wait.\n4 Small trash cans keep my car clean year-round\nIf you're as uptight about your floor mats and seats as I am, this is a must-buy\nNothing grinds my gears like trash on the floor of my car. Dirt from shoes or general dust I can stand -- that happens no matter how much you try and keep it out -- but if someone just haphazardly throws their trash on my floor, I will officially be down one friend before the day ends.\nAccmor car trash can with lid\nAccmor Compact Car Trash Can keeps your litter in one place and makes use of your car little space artfully. It takes up minimal amount of space yet creates you full garbage capacity, keep your car clean and tidy.\nThankfully, this little trash can from Accmor via Amazon keeps that from happening, and we can all remain friends after the road trip has ended. Some families may require a larger can, though, and luckily, there are numerous Amazon options available for just that as well.\n5 NOCO Boost Jumper pack\nSpeaking of unplanned stops, a dead battery is the end all be all of \"Oh, come on!\" moments\nThere may not be a handier thing on the road than a fresh jump pack, especially from a high-quality brand like NOCO. Gone are the days of having to wait for an empathetic passerby to stop off with some jumper cables. Now, if you're running into electrical issues on the road, these NOCO battery packs are life-savers with up to 3,000 amps of lithium battery-powered juice.\nNOCO Boost Plus GB40 Jump Starter Box\nThe Noco Boost Plus GB40 is another essential tool for outdoor adventures because its 12V battery pack can store up to 20 charges and jump start most car, truck, and boat batteries. It's rugged for everyday use with a rubberized, IP65-resistant exterior and LED flashlight function and can also work as a powerbank to charge smartphones and tablets.\nThis pack isn't just for your car, though. It has enough power to charge your phone, boat, tablet, or pickup truck. It's a must-have safety gadget for anyone that spends a lot of time on the road, especially if your car, truck, or vessel is of the older variety."
    },
    {
      "url": "https://carbuzz.com/cars/tesla/model-3/",
      "text": "Tesla Model 3\n2024 - Tesla Model 3\n| Drivetrain | Rear-Wheel Drive |\n| Transmission | Single Speed Automatic |\n| Horsepower | 271 hp |\n| Torque | 310 lb-ft |\n| Fuel Economy Equivalent (city/highway/combined) | 140/125/132 MPGe (RWD) |\nlatest\nElectric Super Sedan Showdown: Hyundai Ioniq 6 N Vs. Tesla Model 3 Performance\nIs the Hyundai Ioniq 6 N worth waiting for? Or will you be happier buying a Tesla Model 3 Performance?\nTesla Opens Largest Off-Grid Supercharger Station In America\nThe Supercharger stations spans 30 acres, with 168 stalls ready for EVs when fully operational.\nTesla's Freshest EVs Look Epic Once The Aftermarket Gets Hold Of Them\nTesla's more affordable EVs look absolutely sick when Japan is involved.\nTesla's Smallest Offering Is Now Rated To Tow 2,200 Pounds\nThe Model 3 now offers a Tesla-installed towing package, but only if you got the Highland sold from 2024 onward.\nTesla Model 3 Maintenance Costs And Common Problems\nWith early Tesla's gaining a reputation for poor build quality, how much does it really cost to run one?\nTesla's $250 Upgrade Adds Just A Touch Of Luxury\nThe fancy look was formerly only available for the Launch Series, but any new Model 3 or Model Y can now take advantage.\nTesla Refused To Let Customers Buy Lease Cars So It Could Make Extra Profit From Them\nTesla's strategy for off-lease cars involved more than just future robotaxis, according to a new report detailing profitable resales."
    },
    {
      "url": "https://www.topspeed.com/drivers-say-no-to-in-car-subscriptions/",
      "text": "Much of the modern auto market features some degree of online connectivity. Manufacturers use these for everything from updates, to GPS navigation and search results, to in-car media streaming. They also use it to charge consumers for some features. Ford charges $49.99 per month for its BlueCruise level 3 autonomous driving software. BMW attempted to charge users for access to heated seats among other paywalled hardware features. It didn't go well in that case, and a new study shows a majority of consumers aren't using their car's connected features.\nBuyers Don't Use Connected Car Features\nSmartcar develops platform and app management for connected cars. Its annual report on the state of in-car tech shows that of more than 1,000 drivers in the US and Europe, 75% of them report they have not signed up for an automaker's connected features in their vehicles. It's an overwhelming majority of sampled owners, to be sure, and meanwhile, Smartcar predicts around 96% of new vehicles on sale in 2030 will offer some level of connected features (built-in Wi-Fi connectivity and features) in them. Reasons for this lack of adoption vary. Some buyers say they're unwilling to pay for a subscription, others say they aren't happy with the features on offer by a given manufacturer, and others said they were simply unaware of the automaker's connected service offerings.\nBuyers Won't Pay For Features... Unless They Like Them\nThis isn't some holistic consumer stand against the monetization of an asset already owned by someone. Instead, the data points to a lack of features. 67% of surveyed drivers said they would pay \"more for a subscription to access additional features.\" Those who are subscribing are generally happy with the \"state of vehicle connectivity\" as well. Survey subjects said that cost and value are lacking, and many don't pay for additional features as a result. 61% said they wanted more features and services for what they do pay, too.\nTopSpeed's Take\nThis should be a holistic stand against the further monetization of the most expensive thing people own following their homes. Automakers are in the business of making money, and it's up to the consumer to draw a line. The average price of a new car is kissing $50,000, and wages for many, many Americans are not keeping up. No one should shell out that kind of cash, whether at once, over a lease term, or via a loan (the interest rates for which have also risen), and then have to pay more. To ask consumers to pay for more in-car features, especially if they're hardware features already in the car, like more power, heated seats, and other functions, is insulting."
    },
    {
      "url": "https://www.pocket-lint.com/five-gadgets-to-upgrade-your-old-car-in-2025/",
      "text": "Summary\n- Upgrade your car with HUDWAY Drive for a modern heads-up display experience.\n- Consider a CarPlay and Android Auto-compatible infotainment system for convenience.\n- Install aftermarket blind spot monitors & a remote start system for an updated & comfortable driving experience.\nHave you ever gotten into your friend's new car and thought to yourself, 'Wow, it's crazy what comes as standard these days?' Well, you're not alone. I distinctly remember getting into my friend's new 3-series BMW back in 2022 and immediately thinking of ways I could spice up my old Volkswagen.\nI myself used a few of these gadgets right up until I bought the car I have now, and despite using other gizmos to make it a bit more user-friendly, I haven't exactly needed as many of these. However, as the years have passed, new iterations and models have emerged that take old cars to even greater heights in 2025. These five gadgets can make any older model feel like a brand-new release if done correctly.\n1 Modular heads-up display\nAll the information you need right inside your field of vision\nHeads-up displays are quite common on newer vehicles, and they've been proven to be a feature that can make your driving experience safer and enjoyable. This isn't a new technology, though, and in fact, it was an option all the way back on the 1999 Chevrolet Corvette, but it's one that has come a long way in terms of providing drivers with great information without distracting them from the road.\nHUDWAY Drive\nHUDWAY Drive is a portable heads-up display for everyday commute:\nKeeps you connected in a less distracting way: speed, navigation, calls, notifications, or music info on a translucent screen right in front of you.\nI'd recommend HUDWAY's Drive system before anything else, as it comes with a fully functioning app to edit your HUD widgets and an OBD2 plugin that can show you live diagnostics information regarding your car itself, so if you're running a little hot or a check engine light displays, the HUD will let you know.\nAs HUDWAY is a smaller company, they often run out of stock fairly quickly. However, customers can join their mailing list to receive updates on when new stock is available, and it will ship within a week of their order, according to HUDWAY.\n2 A CarPlay and Android Auto-compatible infotainment system\nIt doesn't have to be a movie screen, but CarPlay and Android Auto make any drive easier.\nPeople have been upgrading their stereos just about as soon as they became standard equipment, but they've never been as advanced as they are right now. Sure, you can just take a tablet into the cabin, but sometimes it's a custom fit you're looking for. Of course, a lot of what you can and can't do with your stereo system revolves around what car you drive. Luckily, Crutchfield has an easy-to-use menu to determine the answer to that exact question.\nTruth be told, you can spend as much as $1,500 and as little as a couple of hundred dollars on finding a new touchscreen stereo for your car, but in this competitive marketplace, more often than not, you get what you pay for. For instance, Kenwood's latest system goes for upwards of the $1,500 mark, but it comes with the ability to integrate the company's new HD cameras at all corners of the car and embedded Garmin navigation software.\n3 Rearview mirror backup camera\nYour mirror is the easiest thing in your car to replace. Why not do it right?\nMuch like a new stereo system, the shape and size of a rearview mirror camera system can vary depending on factors such as the type, size, and shape of the dash and vehicle itself. There are numerous options to choose from here, again, but the same principle applies -- you get what you pay for.\nCrutchfield doesn't make this as easy as it does buying stereos, but they do have a helpful guide on deciding which system is best for you, especially if it's a rearview mirror replacement. Most manufacturers are already shifting to a screened overhead mirror to monitor things like back seat activity without a funky-shaped mirror system, and even that option can be checked off in the aftermarket space.\n4 Aftermarket blind spot monitors\nYou'll never know how handy they are until you use them\nAnother safety feature that you may not realize you need until you try it is a set of blind spot monitors. Gone are the days of slapping on extra convex mirrors and other funky add-ons. Now, with radar assistance, any driver can have this modern piece of tech by replacing a few interior pieces, depending on their model. Additionally, some companies will manufacture mirrors to OEM spec with radar detection built in, but those require sitting through a waiting list, sending a deposit, etc.\nAs someone who used to drive a vehicle from the early 2000s, I would slap these on in a heartbeat now that they're standard on my new car. They make highway and interstate driving a breeze, even through dense Atlanta traffic. Just ask my fiancé, who peacefully slept away through that portion of our last trip.\n5 Remote Start System\nBecause nobody enjoys just jumping into a hot car.\nThe final step in equipping any older car with modern tech in 2025 is adding a remote start feature, and no company makes this easier than Compustar. There are some challenges when it comes to getting your hands on one -- you can't have it delivered straight to your door -- but if there's a dealer near you, it can take away one of the worst parts of an old car; having to get inside a scorching cabin during these hot summer months.\nCompustar works directly with dealers as opposed to selling on the open market, so prices may vary depending on markup and location. Additionally, Compustar manufactures various autostart and security systems tailored to meet a customer's specific needs, including phone connectivity and finely tuned alarm systems. If interested, you can search for a dealer via a portal on the Compustar website.\nThere are other ways to make your car more modern, like newer headlights, taillights, or even performance-enhancing braking systems. However, these five features are the fastest way to take any old car into 2025 from a comfort and usability standpoint."
    },
    {
      "url": "https://www.topspeed.com/mercedes-benz-level-3-self-driving-subscription/",
      "text": "For some, driving is more of a chore rather than a pleasure, while for others, it’s mostly a pleasure, but only under favorable circumstances. It’s in these circumstances where self-driving can become handy, such as in congested traffic or on long highway stretches that have seemingly no end in sight.\nBut how close are we to true self-driving? As you’ll find out, we’re only midway to achieving that goal, and there are only a few brands today that offer such a capability. Mercedes-Benz is one of them, and depending on the model you want or the state you live in, you could have that feature for the right amount of money.\nIn order to give you the most up-to-date and accurate information possible, the data used to compile this article was sourced from various manufacturer websites and other authoritative sources, including SAE International, Tesla, Mercedes-Benz, Forbes, and EE Power.\nSay Hello To Mercedes-Benz’s Drive Pilot - A $2,500 Annual Subscription\nMercedes-Benz introduced Drive Pilot in 2022, wherein it’s an SAE Level 3 self-driving feature. There aren’t a lot of SAE Level 3 self-driving features on the market at the moment, which puts Mercedes-Benz in a unique position - if you have the right model. The Mercedes-Benz S-Class and EQS sedan, both of which are the brand’s flagship luxury sedans, are the two vehicles that can be fitted with Drive Pilot for a $2,500 annual subscription.\nWhere You Can Use Mercedes Drive Pilot\nUnlike Tesla’s Full Self Driving (FSD), which you can add to the vehicle as an upgrade over the standard Autopilot even after purchasing it, Drive Pilot has a plethora of sensors and hardware that isn’t part of the vehicle as standard. This means you either have to find an existing vehicle stock that’s already equipped with Drive Pilot or configure one for yourself and select that feature.\nDrive Pilot doesn’t work in every area in the United States, however. Specifically, Drive Pilot will only work on the major freeways of California as well as parts of Nevada. The reason for this is because Drive Pilot also works through GPS, in which Mercedes-Benz’s engineers mapped the area in extreme detail, down to which lane the vehicle occupies on the freeway. This is thanks to digital high-definition mapping that “provides a 3D image of the road and the surroundings with information on road geometry, route characteristics, traffic signs, and special traffic events.” Of course, doing this on every single major road in the United States is a time-consuming task, so it may take a while for this feature to make it in your state.\nHow Mercedes Drive Pilot Works\nMercedes-Benz’s Drive Pilot is an SAE Level 3 self-driving feature that allows for conditional hands-free driving on compatible freeways. Thanks to pre-mapped roads, as well as the plethora of sensors and satellite navigation working in tandem, the vehicle fitted with this feature has spatial awareness of its surroundings, which allows it to execute its own decisions and thus allows the driver to just sit back and relax.\nThose sensors include radar, Light Detection and Ranging (LiDAR), ultrasound sensors, as well as an antenna array to orient the vehicle in real-life driving conditions. The sensors need to first recognize these parameters before they allow hands-free driving:\n- Clear lane markings on approved freeways\n- Daytime lighting and clear weather\n- Driver visible by camera located above the driver's display\n- There is no construction zone present.\nWhen these circumstances are met, Drive Pilot will allow the vehicle to operate hands-free, even with the driver doing something else like watching a movie or receiving and sending emails. However, there's one major caveat to Drive Pilot: the limitation to operate at 40 MPH or less during moderate to heavy traffic. For now, legalization to drive at up to 80 MPH hands-free is still in the works, and when that comes, you can bet it will be offered via an over-the-air (OTA) update. It also won't work in the rain or on wet roads, in twilight or at night.\nWhat SAE Level 3 Exactly Is\nAt this point, you probably have questions about what SAE Level 3 self-driving means, especially with Tesla’s FSD, which makes people believe that their Teslas are indeed full self-driving cars. The reality is, that Drive Pilot and FSD have varying capabilities, but it’s Drive Pilot that’s capable of offering a higher degree of autonomy.\nThe Different SAE Self-Driving Levels\nTo understand what makes Drive Pilot an SAE Level 3 self-driving system, we have to know the other SAE autonomy levels as well and each level is categorized. Firstly, SAE means Society of Automotive Engineers, which is an organization that sets standards (kind of like ISO, for example) for automobiles, like the measurement of power and torque, for instance. SAE International also sets the standards for the various advanced driver-assistance systems (ADAS), with Level 0 being the most basic and Level 5 being fully autonomous. To fully grasp the six levels, here's a summary of what each level means:\n- Level 0 - ADAS features are only designed to provide warnings and give momentary assistance.\n- Level 1 - ADAS features can control throttle (adaptive cruise control) or steering (lane centering).\n- Level 2 - ADAS features can control both throttle (adaptive cruise control) and steering (lane centering).\n- Level 3 - Conditional hands-free self-driving is possible, but when the feature prompts, you must take over the driving.\n- Level 4 - Conditional hands-free self-driving is possible, but it won't request any driver input.\n- Level 5 - No conditions need to be met as the system can completely drive the car whatever the circumstances.\nWe've Peaked So Far At Level 4\nSAE Level 4 is basically your self-driving \"robotaxis\". Think of Waymo or Cruise, which, as you'll notice and as SAE states, is conditional self-driving that only happens in pre-mapped areas. These taxis also don't require a driver, which neatly classifies them as SAE Level 4 systems. This is so far our current peak in terms of technological capability. Achieving SAE Level 5 autonomy will be a huge milestone because this is when a certified vehicle is able to operate truly independently regardless of the circumstance and make its own decisions in emergency circumstances.\nWhat Lies Ahead For Autonomous Driving\nApart from carbon neutrality, automakers are also aiming to eventually reach a point where their vehicles can truly offer self-driving abilities. At the moment, Drive Pilot is the peak that a consumer in the United States can own at the moment and here's how it fares versus other ADAS systems.\nTesla's Not-So-Full Self Driving\nTesla's FSD, along with Ford's BlueCruise and GM's Super Cruise, are actually an SAE Level 2 or Level 2+ ADAS system. They do a good job of keeping the car in their lanes, or even perform lane changes, especially when tied to the car's built-in navigation systems, but they do not offer conditional true self-driving capabilities. These systems will at some point require a driver's attention, but Drive Pilot allows for completely hands and eyes-free driving on pre-mapped roads.\nThe other competing system is BMW's Personal Pilot L3, which is likewise an SAE Level 3 system. Unfortunately, Personal Pilot L3 is not yet ready to be launched in the United States and is currently only being offered in Germany. China's numerous EV companies have also been making strides in terms of SAE Level 3 ADAS systems, though none have hit the market yet. BYD will be one of the first automakers from China to test these systems before eventually being rolled out to consumers in the near future.\nSAE Level 5 Will Be Difficult To Achieve\nAs our automotive technology progresses, the goal of reaching SAE Level 5 autonomy is an arduous task. Reaching SAE Level 5 is a lot longer than we expected. Elon Musk, for instance, has pushed back its self-driving promises numerous times already, because developing such as system is truly challenging. SAE Level 4 is not yet even being offered at a consumer level and is limited to taxi use in pre-mapped areas, which is a sign that we still have a long way to go. Furthermore, as EE Power has explained, numerous challenges lie ahead in the deployment of self-driving vehicles, primarily due to these factors:\n- Sensor errors - Sensors can be fooled by bad weather, glare, or other road conditions. This can lead to the autonomous vehicle making mistakes, such as crashing into something or running a red light.\n- Software bugs - The software that controls the vehicle is complex and can contain bugs. These bugs can also lead to mistakes.\n- Hacking - Autonomous vehicles may be vulnerable to hacking. If the vehicle is hacked, the hacker could take control of the vehicle and cause it to do something dangerous, such as crash into another vehicle or cause a traffic jam.\n- Public acceptance - Some people are not comfortable with the idea of riding in an autonomous vehicle. They worry that the vehicle will make mistakes or that they will not be able to trust it.\nFinally, there's another aspect that's worth highlighting, and that's the moral and ethical dilemma that a self-driving car will eventually have to face. When an accident happens, who is at fault, or what kind of decision-making will it make, such as whether to hit a certain vehicle or hit a barrier as a way to slow down when the brakes fail? In the case of Drive Pilot, Mercedes-Benz said they would be liable when the system is activated, but there is a black box in the vehicle to determine who really was a fault in an accident. Germany has imposed such rules on the development of self-driving cars, which is yet another challenge that engineers need to address before going all-in on true self-driving cars."
    },
    {
      "url": "https://www.forbes.com/sites/peterlyon/2025/05/24/the-scary-side-to-teslas-full-self-driving-exposed-in-crash-video/",
      "text": "Around two months ago, a Tesla owner was driving his Model 3 in FSD (Full Self-Driving) mode – also called ‘Autopilot’ – in Alabama when the car suddenly, for no obvious reason, veered off the road, crashed and flipped upside down. The driver suffered a chin injury but was okay. The owner shared a video of the accident, a video that has Tesla examiners baffled. (Go to the 30-second mark).\nSince Tesla’s FSD was first launched in 2020, we have heard about hundreds of non-fatal crashes involving Tesla’s FSD software and 51 reported fatalities, 44 of which The National Highway Traffic Safety Administration’s (NHTSA) investigations had later verified.\nTesla’s FSD naming is actually a misnomer\nIn an October 2024 Reuters story, the publication reported that the NHTSA had opened an investigation into 2.4 million Tesla vehicles fitted with the carmaker’s FSD software after four collisions and one fatal crash in Arizona in 2023. In the NHTSA’s report findings, “Tesla concluded in its 23V838 filing that, in certain circumstances, Autopilot’s system controls may be insufficient for a driver assistance system that requires constant supervision by a human driver.”\nTesla calls its well-known autonomous driving system ‘full-self drive’ which is actually a misnomer. Despite its title, FSD is still defined as a level 2 driver assist system and is not fully self-driving. Drivers are expected to stay attentive at all times and be ready to take control, which is one reason Tesla has recently added ‘Supervised’ to the name. According to Tesla, the driver is responsible for the car’s behavior, even if FSD is activated.\nInterestingly though, just last week, Tesla released a post on X in which it commented that drivers just have to “lean back and watch the road” when using its FSD.\nThe driver was paying attention but had no time to react\nThat’s exactly what Wally, a Tesla Model 3 owner in Toney, Alabama was doing when his car suddenly veered off the road and crashed in March this year. The driver was aware that even though he had engaged the car’s FSD, he was required to pay attention and be ready to take control immediately if something untoward happened.\nWally explained that, “I used FSD every chance I could get I actually watched YouTube videos to tailor my FSD settings and experience. I was happy it could drive me to Waffle House and I could just sit back and relax while it would drive me on my morning commute to work.”\nWally said that he didn’t have time to react even though he was paying attention, and a quick look at the video reveals just how quickly the FSD system can malfunction. He said, “I was driving to work and had FSD on. The oncoming car passed, and the wheel started turning rapidly, driving into the ditch, side-swiping a tree, and the car flipped over. I did not have any time to react.”\nSo what caused the malfunction? That’s hard to determine\nFrom this writer’s point of view, it appears as though Wally’s Tesla veered left as soon as it sensed the passing of the oncoming pickup truck as his car turned a split second after the truck passed. Had it turned in even one second earlier his car would have collided head on with the truck. But there were other shadows on the road and a sign post which could have triggered to unexpected response.\nWally explained that he was using Tesla FSD v13.2.8 on Hardware 4, Tesla’s latest FSD software. He requested that Tesla send him the data from his car to better understand what happened.\nAs you can see from the video, the driver had less than a second to react, which counters Tesla’s claim that the driver can take control if the system suddenly malfunctions. The driver here appears to be not at fault. The car is. From what we saw in this incident, it would seem as though Tesla needs to go back to the drawing board and rethink its FSD system, especially as it plans to rollout this self-driving tech on Robotaxis in June."
    },
    {
      "url": "https://www.pocket-lint.com/ev-buyers-are-responding-to-the-end-of-federal-tax-credits-2025/",
      "text": "Summary\n- EV tax credits ending in September causing rush\n- Rise in used EV market activity, buyers shift focus\n- Switch to brands still eligible for tax credit, lease incentives offer savings\nThe signing of the \"One Big Beautiful Bill Act\" carries a lot of weight for automakers, and one of the biggest results of the bill's passing is the end of the federal tax credit that is awarded to buyers of electric vehicles. Come September 30, the new EV tax credit of $7,500 and a used EV tax credit of $4,000 or 30 percent of the entire vehicle's price (whichever was less) will cease to exist, and EV owners and buyers alike are all responding differently, despite companies like Tesla introducing new incentives to buy fresh models.\nWhether it's by taking advantage of an inventory-cleaning sweeper of a deal or leaving one popular brand for another less established one, buyers are making their feelings known with their most powerful tool -- their wallets.\n5 Q3 EV sales are expected to soar\nThe surge before the fall\nFor those keeping up with the EV market, Q2 saw sales dip a bit for titans of the space like Tesla, who's seen a 21 percent drop this year alone. However, they weren't alone. Overall, EV sales slowed a bit in Q2, but if there's any inventory left on dealer lots, there's a good chance that it will be gone by the end of Q3. With the federal tax credit set to end in September, buyers are rushing through the doors to take advantage of the credit on name brands like Tesla before it expires. Official numbers haven't been released yet, but senior analyst at Cox Automotive Stephanie Valdez Streaty probably put it best.\n“With government-backed incentives set to end in September and economic pressures mounting, the second half of the year will be a critical test of EV demand,” said Streaty. “Q3 will likely be a record, followed by a collapse in Q4, as the electric vehicle market adjusts to its new reality.”\nThe incentives on leased EVs will also come to a halt on September 30, closing the popular loophole of listing EVs as commercial vehicles.\nTesla Cybertruck sales have already resulted in a financing slash due to the mass number of recalls and issues, but if the brand's flagship models lose their momentum in the race, the EV boom that we've all been told is coming for the past few years may turn out to be more of an EV blunder when the dust settles.\n4 Rise in used EV market activity\nBuyers who were saving for new EVs are now spending on used options\nRemember when you saved up for something when you were little? For me, it was a new Nintendo Wii. I see them all the time now on Facebook Marketplace and laugh a little, but do you know what else there's an abundance of now on just about every used marketplace site? Electric vehicles. The past few years, every manufacturer has rushed to make their own brand of EVs, which are now, subsequently, hitting the used EV market at a rapid pace as owners scramble for new models (see point one). There are currently 70 total EV models available on the market, according to Recurrent, and this could be argued as a bit of a market maturation, with could being the operative word there.\nIf a new EV was on your to-purchase list in late 2025, you might want to act now instead of later and go used.\nIn reality, though, that probably isn't the whole truth. Just like I saved for my Nintendo Wii, many people who were saving for a big EV purchase now realize that time is running out. If a new EV was on your to-purchase list in late 2025, you might want to act now instead of later and go used.\n3 Switching from Tesla to brands who still get the tax credit\nNot all EVs are created equal\nThere may be some confusion about this point, and I'm here to put it to bed. All Tesla models still qualify for the tax credit, but some trims do not. Without making you sit through an economics lecture, the price for an EV SUV to claim the tax credit has to be under $80,000, while an EV sedan or car must be under $55,000. The full list can be found on the U.S. Treasury Department website, but just know that there are some higher-tier trims that either only qualify for a partial tax credit or even none at all.\nThis has caused a bit of a trickle-down effect for brands who offer EVs at lower prices with the same features as Tesla, Lucid or BMW. Particularly, General Motors had a successful Q2 of sales, and are expecting an even bigger jump in Q3 than most companies, even with the added purchases around the tax credit deadline. In that same vein, brands like Kia or Hyundai, despite its recent recalls, are also expecting a bump in Q3 EV sales greater than that of Tesla and other luxury EV brands that may not qualify for the credit.\n2 Leasing increases to keep some incentives\nHang on to those credits for as long as you can\nOne of the loopholes to the previous point is to lease a more luxurious EV rather than buy it outright, and this is the fourth way that some buyers and dealers are skirting around maintaining the EV tax credits without having the customer actually purchase the vehicle. When leasing a vehicle, the tight rules on EV ownership are loosened a bit, as the leasing company, which is usually just the finance arm of the automaker itself, are legally considered the owners of the vehicle. This is yet another popular leasing loophole that buyers and dealers alike have used to move inventory and boost numbers over the past few years. Buyers can miss out on the tax credit for a myriad of reasons, including personal income or even the place where the car is manufactured.\nThen, the automaker passes that $7,500 worth of savings on to the customer through lower lease payments, essentially making sure that the customer gets the same tax credit. Of course, many drivers are re-upping their leases before September hits in order to keep their tax credits. So, if you didn't know about this loophole before, now you do, and I consider that a win for everyone involved.\n1 Demand spikes for plug-in hybrids\nWelcome to the cool kid club, PHEV owners\nAs a middle ground, the plug-in hybrid market is expected to reach new heights with EV tax credits ending, and the switch might have already begun. Plug-in hybrid EV sales have been steadily climbing in the past two years, reaching over 320,000 in 2024 alone. At this rate, with a boom expected in late 2025, sales numbers could realistically reach the 500,000 mark this year alone with manufacturers across the board bringing impressive models to market, like the new Toyota RAV4 PHEV.\nThe concept of the EV isn't dying. In fact, it has more money and investment power behind it than ever before. However, that buyer boom that the entire industry has been waiting for might find itself dead in the water, and EV companies will be left to duke it out with the titans of the industry just like everyone else."
    }
  ],
  "argos_summary": "The article discusses the growing trend of subscription services in the automotive industry, highlighting how many car manufacturers, including Tesla, Ford, and BMW, are charging for features that were once standard. It emphasizes consumer frustration with subscription fatigue, particularly regarding essential features like navigation and self-driving capabilities, which can come at a high cost. The piece also touches on the potential backlash from consumers, as seen with BMW's failed attempt to charge for heated seats, and suggests that the future of car subscriptions will depend on consumer pushback against these practices.",
  "argos_id": "XQSI1NESI"
}