{
  "url": "https://www.dailykos.com/story/2025/8/11/2337819/-Overnight-News-Digest-Global-outrage-mounts-over-journalists-killings-by-Israel",
  "authorsByline": "",
  "articleId": "14e12bea3045482b92c480fa36fc694c",
  "source": {
    "domain": "dailykos.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Alameda County",
      "city": "Oakland",
      "coordinates": {
        "lat": 37.8044557,
        "lon": -122.2713563
      }
    }
  },
  "imageUrl": "https://cdn.prod.dailykos.com/images/797652/story_image/unnamed.jpg?1587929719",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T04:01:20+00:00",
  "addDate": "2025-08-12T04:11:40.842442+00:00",
  "refreshDate": "2025-08-12T04:11:40.842444+00:00",
  "score": 1.0,
  "title": "Overnight News Digest: Global outrage mounts over journalists killings by Israel",
  "description": "Global outrage mounts as funeral held for five journalists killed by Israel\n\nThe Guardian\n\n\nThe death of the prominent Al Jazeera journalist Anas al-Sharif, killed along with four colleagues in an ...",
  "content": "Global outrage mounts as funeral held for five journalists killed by Israel\n\nThe death of the prominent Al Jazeera journalist Anas al-Sharif, killed along with four colleagues in an Israeli airstrike on Sunday, prompted condemnation from around the world, as hundreds of mourners carried their bodies through the streets of Gaza City. Sharif, one of Al Jazeera’s most recognisable faces in Gaza, was killed while inside a tent for journalists outside al-Shifa hospital in Gaza City on Sunday night. Seven people were killed in the attack, including the Al Jazeeracorrespondent Mohammed Qreiqeh and the camera operators Ibrahim Zaher, Mohammed Noufal and Moamen Aliwa, according to the Qatar-based broadcaster. On Monday, the Guardian visited the site where the journalists were killed. Wadi Abu al-Saud, a Palestinian journalist who was near the tent when the Israeli strike occurred on Sunday, said the attack happened at 11.22pm, just after he had finished filming his latest news bulletin.\n\nThis is an open thread where everyone is welcome, especially night owls and early birds, to share and discuss the happenings of the day. Please feel free to share your articles and stories in the comments.\n\nHere's How to Spot Bright Fireballs During the Dazzling Perseids Meteor Shower\n\nSkygazers rejoice, the summer isn't finished with delivering dazzling meteor showers. The last week of July saw dueling meteor showers taking over the sky, but the most popular meteor shower of the year won't hit its peak until next week. The Perseids meteor shower is about to give you a real light show, provided you're far enough away from light pollution to see it. Perseids are known for their bright fireballs and plentiful meteors. The show started on July 17, and will run through Aug. 23. The reason the Perseids meteor shower is so popular is twofold. First, it takes place in the summer, so going outside and watching it is less uncomfortable than other large meteor showers like Quadrantids, which takes place in wintery January.\n\nColombian Senator Miguel Uribe dies two months after being shot\n\nColombian senator and presidential hopeful Miguel Uribe has died two months after being shot in the head in a targeted attack which shocked the South American nation. The 39-year-old was hit by three bullets - two of them in the head and one in the leg - at a campaign rally on 7 June in the capital, Bogotá. His wife confirmed his death on social media, paying tribute to \"the love of my life\". A teenager has been arrested on suspicion of carrying out the shooting, but the motive behind the attack is still unclear.\n\nBritish man who perished in Antarctic glacier found 65 years later\n\nThe bones of a British man who died in a terrible accident in Antarctica in 1959 have been discovered in a melting glacier. The remains were found in January by a Polish Antarctic expedition, alongside a wristwatch, a radio, and a pipe. He has now been formally identified as Dennis \"Tink\" Bell, who fell into a crevasse aged 25 when working for the organisation that became the British Antarctic Survey. \"I had long given up on finding my brother. It is just remarkable, astonishing. I can't get over it,\" David Bell, 86, tells BBC News.\n\nAnas and Mohammed, journalists slain by Israel, remembered as role models\n\nLate Sunday evening, Israel’s military targeted Al Jazeera Arabic’s Gaza correspondents Anas al-Sharif, Mohammed Qreiqeh and three others, killing them in a drone strike against their media tent at the gate of al-Shifa Hospital in Gaza City. The slain journalists had spent the past 22 months documenting the ongoing conflict and its impact on their community. Al-Sharif, 28, and Qreiqeh, 33, are both survived by their wives and a baby boy and a girl. Qreiqeh, who was an only child, had lost his mother in Gaza in March 2024, when Israeli forces stormed al-Shifa Hospital. He searched for his mother for two weeks, eventually finding her decomposing body on the stairs of the facility.\n\nWildfires blaze through parts of Europe as heatwave hits\n\nA new heatwave has gripped parts of Europe, sending temperatures up to 43 degrees Celsius (109.4 degrees Fahrenheit), with wildfires wreaking havoc and forcing evacuations as the impact of global warming is keenly felt on the continent. Firefighters in northwestern Spain struggled on Monday to contain a wildfire that damaged an ancient Roman mining site and forced hundreds of residents to flee. Regional Environment Minister Juan Carlos Suarez-Quinones said the firefighting effort near the UNESCO World Heritage Site of Las Medulas faced “many difficulties” due to high temperatures and winds of up to 40 kilometres per hour (25 miles per hour). Extreme heat and strong winds caused “fire whirls”. “This occurs when temperatures reach around 40 degrees Celsius [104F] in a very confined valley and then suddenly [the fire] enters a more open and oxygenated area,” Suarez-Quinones said.\n\nGerman sportswear brand Adidas has apologized for \"cultural appropriation\" in the design of its \"Oaxaca Slip-On\" shoe. The Indigenous-inspired design attracted criticism in Mexico, including from President Sheinbaum. German sportswear manufacturer Adidas has issued an apology after being accused of cultural appropriation in the design of its new \"Oaxaca Slip-On\" shoe. The shoe, designed by US designer Willy Chavarria, is inspired by the \"huarache\" sandals traditionally worn by Indigenous villagers from Villa Hidalgo Yalalag in the Mexican state of Oaxaca, who weren't involved in the production. \"Adidas values the cultural richness of Mexico's Indigenous communities and the importance of their craft heritage,\" the Bavaria-based company said in a statement on Monday.\n\nOpposition lawmakers were arrested after protesting against electoral roll revisions, including in the key northern state of Bihar. Critics fear that Modi's Hindu nationalist BJP aims to disenfranchise Muslim voters. Indian opposition leader Rahul Gandhi was among dozens of lawmakers temporarily detained by police in New Delhi on Monday following a protest against perceived electoral malpractice. Around 300 opposition parliamentarians, including Gandhi, marched towards the Election Commissionheadquarters, jumping barricades and shouting that recent elections had been \"stolen.\" They claim that electoral rolls in key states have been altered to the benefit of Prime Minister Narendra Modi's ruling Hindu nationalist Bharatiya Janata Party (BJP), with more to come.\n\nExplosion ‘like thunder’ at Pennsylvania US Steel plant leaves at least one dead\n\nOne person has died and two are believed to be unaccounted for after an explosion at a US Steel plant in Pennsylvania, near Pittsburgh, officials said. An Allegheny county emergency services spokesperson, Kasey Reigner, said multiple other people were treated for injuries. Abigail Gardner, the director of communications for Allegheny county, told local news station TribLive that “a search-and-rescue operation” was under way after the blast. “It felt like thunder,” Zachary Buday, a construction worker near the scene, told WTAE-TV. “Shook the scaffold, shook my chest, and shook the building, and then when we saw the dark smoke coming up from the steel mill and put two and two together, and it’s like something bad happened.”\n\nWhat Does Palantir Actually Do?\n\nPALANTIR IS ARGUABLY one of the most notorious corporations in contemporary America. Cofounded by libertarian tech billionaire Peter Thiel, the software firm's work with Immigration and Customs Enforcement, the US Department of Defense, and the Israeli military has sparked numerous protests in multiple countries. Palantir has been so infamous for so long that, for some people, its name has become a cultural shorthand for dystopian surveillance. But a number of former Palantir employees tell WIRED they believe the public still largely misunderstands what the company actually does and how its software works. Some people think it's a data broker that buys information from private companies and resells it to the government. Others think it’s a data miner, constantly scanning the internet for unique insights it can collect and market to customers. Still others think it maintains a giant, centralized database of information collected from all of its clients. In reality, Palantir does none of these things, but the misconceptions continue to persist.\n\nFactories from GE to Kraft Heinz lose immigrant workers, stressing those who remain\n\nTrump says he will 'feel out' Putin in Alaska on ending the war in Ukraine\n\nPresident Trump said on Monday that he plans to use a Friday summit in Alaska to gauge whether Russian President Vladimir Putin is ready to end his war on Ukraine — and said he'd been disappointed in the past with Putin's actions. \"This is really a feel-out meeting, a little bit,\" Trump told reporters, predicting he would know \"probably in the first two minutes\" whether a deal would be possible. \"I may say, 'Lots of luck, keep fighting.' Or I may say, 'We can make a deal,'\" Trump said. Trump has long pledged to use his relationship with Putin to broker an end to the war, now in its fourth year.\n\nThe crew of the Overnight News Digest consists of founder Magnifico, regular editors side pocket, maggiejean, Chitown Kev, FarWestGirl, eeff, annetteboardman, Besame, and jck. Alumni editors include (but not limited to), Rise above the swamp, DoomandGloom, Interceptor 7, Man Oh Man (RIP), wader",
  "medium": "Article",
  "links": [
    "https://www.wired.com/story/palantir-government-contracting-push/",
    "https://www.dw.com/en/narendra-modi/t-65800410",
    "https://www.dw.com/en/mexico-adidas-apologizes-for-cultural-appropriation/a-73606400",
    "https://www.aljazeera.com/news/2025/8/11/wildfires-blaze-through-parts-of-europe-as-heatwave-hits",
    "https://www.dw.com/en/bavaria/t-18968282",
    "https://www.dw.com/en/indias-elections-are-a-mammoth-undertaking/a-68521065",
    "https://www.wired.com/story/ice-palantir-immigrationos/",
    "https://www.cnet.com/science/how-to-watch-this-weeks-meteor-shower-all-in-2025-shooting-star-guide/",
    "https://www.dw.com/en/india-court-orders-removal-of-5000-stray-dogs-in-new-delhi/a-73597706",
    "https://bsky.app/profile/did:plc:4lx6nur5wstwoc4wtgj56kyu/post/3lw5a5frtlk2v?ref_src=embed",
    "https://bsky.app/profile/did:plc:x4g4laxkmsrczwvnvbbgsm7g?ref_src=embed",
    "https://www.cnet.com/science/space/look-to-the-sky-bright-fireballs-appear-during-the-perseids-meteor-shower/",
    "https://www.dw.com/en/india/t-18996071",
    "https://www.aljazeera.com/news/2025/8/11/anas-and-mohammed-journalists-slain-by-israel-remembered-as-role-models",
    "https://www.theguardian.com/world/china",
    "https://www.theguardian.com/us-news/pennsylvania",
    "https://bsky.app/profile/did:plc:3g5sfs7ml5bywjxlzg4aw46q/post/3lw5rzdizfs2p?ref_src=embed",
    "https://www.theguardian.com/world/2025/aug/11/funeral-held-for-anas-al-sharif-and-other-journalists-killed-in-israeli-strike",
    "https://www.theguardian.com/us-news/2025/may/12/china-us-agree-pause-trade-war-trump",
    "https://www.npr.org/2025/08/11/g-s1-82010/trump-putin-alaska-ukraine",
    "https://www.npr.org/2025/06/02/nx-s1-5414522/ukraine-peace-talks-russia-trump-putin-istanbul",
    "https://www.cnet.com/science/space/you-can-see-two-meteor-showers-at-once-this-week-how-to-catch-a-glimpse/",
    "https://www.npr.org/2025/08/08/nx-s1-5347716/trump-putin-meeting",
    "https://www.theguardian.com/us-news/2025/aug/11/trump-china-tariffs-deal-deadline",
    "https://www.wired.com/story/palantir-what-the-company-does/",
    "https://www.theguardian.com/media/al-jazeera",
    "https://www.aljazeera.com/news/2025/7/16/why-is-europe-facing-record-breaking-heatwaves#:~:text=This%20June%20was%20the%20warmest%20on%20record%20for%20Western%20Europe&text=The%20same%20average%20temperature%20was,%2C%202019%2C%202022%20and%202023.",
    "https://www.bbc.com/news/articles/c4g034yx4gjo",
    "https://www.dw.com/en/india-can-hindu-nationalists-reshape-the-constitution/a-73143290",
    "https://bsky.app/profile/did:plc:4llrhdclvdlmmynkwsmg5tdc/post/3lw5vwsm6jp2f?ref_src=embed",
    "https://www.dw.com/en/rahul-gandhi-embraces-his-new-role-as-head-of-indias-opposition/a-69630543",
    "https://bsky.app/profile/did:plc:4llrhdclvdlmmynkwsmg5tdc?ref_src=embed",
    "https://bsky.app/profile/did:plc:4lx6nur5wstwoc4wtgj56kyu/post/3lw5squclmk2v?ref_src=embed",
    "http://www.dailykos.com/comments/1519053/61203883#comment_61203883",
    "https://www.dw.com/en/mexico-hurricane-erick-weakens-as-residents-clear-debris/a-72978989",
    "https://www.aljazeera.com/features/2025/8/11/israel-kills-anasal-sharif-and-four-al-jazeera-in-gaza-what-to-know",
    "https://www.dw.com/en/mexico/t-18214018",
    "https://www.aljazeera.com/news/2025/8/10/al-jazeera-journalist-anas-al-sharif-killed-in-israeli-attack-in-gaza-city",
    "https://www.dw.com/en/india-elections-2024/t-68826548",
    "https://bsky.app/profile/did:plc:x4g4laxkmsrczwvnvbbgsm7g/post/3lw5uacmfpk25?ref_src=embed",
    "https://bsky.app/profile/did:plc:4lx6nur5wstwoc4wtgj56kyu?ref_src=embed",
    "https://www.npr.org/2025/08/11/nx-s1-5496335/trump-immigration-workers-parole-tps",
    "https://www.bbc.com/news/articles/c78mmj97ygmo",
    "https://www.theguardian.com/us-news/2025/aug/11/steel-plant-explosion-pennsylvania",
    "https://www.npr.org/2025/03/22/nx-s1-5337214/dhs-revokes-humanitarian-parole-cubans-haitians-nicaraguans-venezuelans",
    "https://bsky.app/profile/did:plc:3g5sfs7ml5bywjxlzg4aw46q?ref_src=embed",
    "https://www.dw.com/en/india-rahul-gandhi-among-detainees-in-electoral-protests/a-73605041",
    "https://www.dw.com/en/adidas/t-19085653",
    "https://www.aljazeera.com/news/2025/8/10/southern-europe-battling-worst-wildfires-in-decades-amid-massive-blazes"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "dazzling meteor showers",
      "weight": 0.0527858
    },
    {
      "name": "dueling meteor showers",
      "weight": 0.05138214
    },
    {
      "name": "other large meteor showers",
      "weight": 0.05134942
    },
    {
      "name": "Pennsylvania US Steel plant",
      "weight": 0.040892594
    },
    {
      "name": "Mohammed Qreiqeh",
      "weight": 0.04065261
    },
    {
      "name": "plentiful meteors",
      "weight": 0.040637873
    },
    {
      "name": "Gaza City",
      "weight": 0.03947837
    },
    {
      "name": "cultural appropriation",
      "weight": 0.039027616
    },
    {
      "name": "Al Jazeera",
      "weight": 0.038851086
    },
    {
      "name": "Russian President Vladimir Putin",
      "weight": 0.038712326
    }
  ],
  "topics": [
    {
      "name": "Media"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Other",
      "score": 0.98095703125
    },
    {
      "name": "/Sensitive Subjects/War & Conflict",
      "score": 0.91943359375
    },
    {
      "name": "/Sensitive Subjects/Death & Tragedy",
      "score": 0.83935546875
    },
    {
      "name": "/News/World News",
      "score": 0.6787109375
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.67138671875
    }
  ],
  "sentiment": {
    "positive": 0.0726117,
    "negative": 0.6478133,
    "neutral": 0.279575
  },
  "summary": "The death of Al Jazeera journalist Anas al-Sharif and four colleagues in an Israeli airstrike has sparked global outrage, with hundreds of mourners carrying their bodies through the streets of Gaza City. The journalists were killed while inside a tent for journalists outside al-Shifa hospital in Gaza City, along with Al Jazeeracorrespondent Mohammed Qreiqeh and the camera operators Ibrahim Zaher, Mohammed Noufal and Moamen Aliwa. The most popular meteor shower of the year, Perseids, will peak next week. Colombia's Miguel Uribe has died two months after being shot in the head in a targeted attack in Bogotá. The bones of a British man who died in Antarctica in 1959 have been discovered in a melting glacier.",
  "shortSummary": "Global outrage grows as mourners gather for the funeral of five Al Jazeera journalists killed by Israel in Gaza City, including Anas al-Sharif and Mohammed Qreiqeh.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "b82d89d2c38c4945b2b5b71bcef24d23",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.aljazeera.com/news/2025/8/11/wildfires-blaze-through-parts-of-europe-as-heatwave-hits",
      "text": "Wildfires blaze through parts of Europe as heatwave hits\nFires threaten a UNESCO World Heritage Site in Spain as temperatures hit new records.\nA new heatwave has gripped parts of Europe, sending temperatures up to 43 degrees Celsius (109.4 degrees Fahrenheit), with wildfires wreaking havoc and forcing evacuations as the impact of global warming is keenly felt on the continent.\nFirefighters in northwestern Spain struggled on Monday to contain a wildfire that damaged an ancient Roman mining site and forced hundreds of residents to flee.\nRecommended Stories\nlist of 3 items‘We are scapegoats’: The rise of anti-migrant anger in Poland\nWho’s seeking asylum in Europe today?\nRegional Environment Minister Juan Carlos Suarez-Quinones said the firefighting effort near the UNESCO World Heritage Site of Las Medulas faced “many difficulties” due to high temperatures and winds of up to 40 kilometres per hour (25 miles per hour).\nExtreme heat and strong winds caused “fire whirls”. “This occurs when temperatures reach around 40 degrees Celsius [104F] in a very confined valley and then suddenly [the fire] enters a more open and oxygenated area,” Suarez-Quinones said.\nFour people, including two firefighters, have suffered minor injuries, he added. “We will not allow people to return until safety in their communities is absolutely guaranteed,” Suarez-Quinones told reporters, estimating that about 700 people remained displaced.\nAuthorities said damage to the Roman gold-mining area famed for its striking red landscape in northwestern Spain will be assessed once the fire is fully under control.\nIn the northern part of neighbouring Portugal, nearly 700 firefighters were battling a blaze that started on Saturday in Trancoso, about 350km (200 miles) northeast of Lisbon.\nThe French national weather authority, Meteo-France, placed 12 departments on red alert, the country’s highest heat warning, anticipating exceptional heat stretching from the Atlantic coast to the Mediterranean plains.\n“Don’t be fooled. This isn’t normal, ‘it’s summer.’ It’s not normal. It’s a nightmare,” agricultural climatologist Serge Zaka told BFMTV. The red alert in France has been issued only eight times since it was created in 2004 after a deadly summer the year before.\nThree major fires also blazed along the borders with Greece and Turkiye, including one near Strumyani that reignited after three weeks.\nIn Bulgaria, temperatures were expected to exceed 40C (104F) on Monday with maximum fire danger alerts in place.\nNearly 200 fires have been reported. Most have been brought under control, localised and extinguished, but the situation remains “very challenging”, said Alexander Dzhartov, head of Bulgaria’s national fire safety unit.\nHungary on Sunday recorded a new national high of 39.9C (104F) in the southeast, breaking a record set in 1948. Budapest also recorded a city record at 38.7C (101.6F).\nWildfires destroyed several homes in Albania as firefighters battled blazes in sweltering conditions on Monday. According to Albania’s Ministry of Defence, firefighters and soldiers subdued most of the close to 40 fires that flared up within 24 hours but more than a dozen were still active.\nIn Croatia, about 150 firefighters spent the night defending homes from a blaze near the port city of Split."
    },
    {
      "url": "https://www.theguardian.com/us-news/2025/may/12/china-us-agree-pause-trade-war-trump",
      "text": "Donald Trump hailed a “total reset” in relations between China and the US after the countries agreed a 90-day pause to the deepening trade war that has threatened to upend the global economy, with tariffs to be lowered by 115 percentage points.\n“They’ve agreed to open up China,” the US president claimed at a press conference at the White House on Monday morning, having spent months escalating tensions with Beijing by ratcheting up tariffs on the country’s exports.\nAfter talks in Geneva, the US treasury secretary, Scott Bessent, said both sides had shown “great respect” in the negotiations. “The consensus from both delegations this weekend was neither side wants a decoupling,” he said.\nWall Street rose sharply after the announcement, with the benchmark S&P 500 jumping 3.2%, the Dow Jones industrial average climbing 2.6% and the tech-heavy Nasdaq gaining 4%.\nThe S&P 500, which endured a torrid sell-off as Trump ramped up his tariffs on China and much of the world, has now reversed all its losses since his “liberation day” announcement in April. Much of what he unveiled that day has since been shelved.\n“The talks in Geneva were very friendly,” said Trump. “We’re not looking to hurt China.”\nThe US president, who has claimed for months that tariffs could raise trillions of dollars for the US federal government, appeared to change tack on Monday. “The biggest thing to me is the opening up,” he said of China. “I think it would be fantastic for our businesses if we could go in and compete.”\nAt an event largely focused on his administration’s efforts to lower drug prices, Trump signaled he may now turn his focus to the European Union, which he claimed had been “nastier” than China.\n“We have all the cards,” the president claimed, using similar rhetoric to describe relations with the EU that he was using about China just weeks ago. “They treated us very unfairly.”\nThe 90-day lowering of tariffs applies to the duties announced by Trump on 2 April, which ultimately escalated to 125% on most Chinese imports, with Beijing responding with equivalent measures.\nChina also imposed non-tariff measures, such as restricting the export of critical minerals that are essential to US manufacturing of hi-tech goods.\nThe US trade representative, Jamieson Greer, said China’s retaliation had been disproportionate and amounted to an effective embargo on trade between the world’s two biggest economies.\nWith the 115 percentage point deduction, Chinese duties on US goods will be lowered to 10%, while the US tax on Chinese goods will be lowered to 30%. That is because the US tariffs include a 20% rate imposed by Trump before the latest trade war, which the president said was related to China’s role in the US’s fentanyl crisis.\nThe fentanyl-related tariff will still apply, and Trump stressed that sector-specific US tariffs on cars, steel and aluminium will be unaffected.\nA spokesperson for China’s ministry of commerce said: “This move meets the expectations of producers and consumers in both countries, as well as the interests of both nations and the common interest of the world.\n“We hope that the US side will, based on this meeting, continue to move forward in the same direction with China, completely correct the erroneous practice of unilateral tariff hikes, and continually strengthen mutually beneficial cooperation.”\nChina’s yuan jumped to a six-month high on the signal that the trade war would be paused. Up to 16m jobs were at risk in China, according to some estimates, while the US faced rising inflation and empty shelves thanks to dizzying tariffs on the biggest supplier of US goods.\nBessent said he was impressed by the level of Chinese engagement on the fentanyl problem during the talks in Switzerland. “For the first time the Chinese side understood the magnitude of what is happening in the US,” Bessent said.\nA joint statement published by the US and China on Monday said both sides would “continue to advance related work in a spirit of mutual openness, continuous communication, cooperation and mutual respect”.\nWilliam Xin, the chair of the hedge fund Spring Mountain Pu Jiang Investment Management, told Reuters: “The result far exceeds market expectations. Previously, the hope was just that the two sides can sit down to talk, and the market had been very fragile. Now, there’s more certainty. Both China stocks and the yuan will be in an upswing for a while.”\nHu Xijin, the former editor of the nationalist Chinese tabloid the Global Times, said on social media the agreement was a “great victory for China in upholding the principles of equality and mutual respect”. Hu noted on Weibo that the recently agreed UK-US trade deal maintained the US’s 10% tariff on UK imports, “while the UK did not implement reciprocal measures”.\nWang Wen, the head of the Chongyang Institute for Financial Studies at Renmin University in Beijing, said: “This is an unexpected achievement in Sino-US tariff negotiations.”\nHowever, Wang also urged caution, as he said the agreement “does not represent the resolution of the structural contradictions between China and the United States, nor does it mean that there will be no friction and serious differences between China and the United States in the future”.\nStock markets across Europe rose in the aftermath of the US-China announcement. Germany’s Dax index jumped by nearly 1%, as Mercedes-Benz, Daimler Trucks and BMW were among the biggest risers. France’s Cac 40 index rose by 1.3%. Shares in the Danish shipping group Maersk rose 12%.\nBrent crude rose almost 3% at $65.75 a barrel, while the dollar index, which measures the greenback against a basket of currencies, jumped by 1.2%.\nAfter the announcement of the US-China agreement, analysts at the Dutch bank ING lifted their forecast for China’s growth this year. ING predicted a jump in exports from China to the US, reverting to forecasting 4.7% growth in the Chinese economy this year.\nAdditional research by Lillian Yang"
    },
    {
      "url": "https://www.dw.com/en/mexico-adidas-apologizes-for-cultural-appropriation/a-73606400",
      "text": "Mexico: Adidas apologizes for cultural appropriation\nAugust 11, 2025German sportswear manufacturer Adidas has issued an apology after being accused of cultural appropriation in the design of its new \"Oaxaca Slip-On\" shoe.\nThe shoe, designed by US designer Willy Chavarria, is inspired by the \"huarache\" sandals traditionally worn by Indigenous villagers from Villa Hidalgo Yalalag in the Mexican state of Oaxaca, who weren't involved in the production.\n\"Adidas values the cultural richness of Mexico's Indigenous communities and the importance of their craft heritage,\" the Bavaria-based company said in a statement on Monday.\n\"The Oaxaca Slip-On was inspired by a design from Oaxaca rooted in the tradition of Villa Hidalgo Yalalag,\" it continued. \"We apologize publicly and reaffirm our commitment to working with Yalalag in a respectful dialogue that honors their cultural heritage.\"\nSheinbaum defends Indigenous 'intellectual property'\nThe issue went as far as Mexican President Claudia Sheinbaum, who described the shoe design as \"inappropriate cultural appropriation,\" saying: \"Large companies are taking products, ideas and designs from our country's Indigenous communities. That is intellectual property.\"\nOaxaca Governor Salomon Jara said on social media that \"huaraches from Yalalag are part of the cultural heritage of this community, a tradition that has been passed down from generation to generation and reflects its identity,\" adding: \"This heritage is one of our greatest treasures, and we must not allow it to be treated as a commodity.\"\nCultural appropriation punishable under Mexican law\nMexico passed legislation in 2022 to protect Indigenous and Afro-Mexican peoples' intellectual and cultural property, with unauthorized use now punishable with fines and even prison sentences.\nIn a statement to the BBC, Chavarria, a former senior vice president of design at Calvin Klein, said he was \"deeply sorry that the shoe was appropriated in this design and not developed in direct and meaningful partnership with the Oaxacan community.\"\nHe continued: \"The intention was always to honor the powerful cultural and artistic spirit of Oaxaca and its creative communities – a place whose beauty and resistance have inspired me. This falls short of the respect and collaborative approach that Oaxaca, Villa Hidalgo Yalalag and its people deserve.\"\nEdited by: Wesley Dockery"
    },
    {
      "url": "https://www.wired.com/story/palantir-what-the-company-does/",
      "text": "Palantir is arguably one of the most notorious corporations in contemporary America. Cofounded by libertarian tech billionaire Peter Thiel, the software firm's work with Immigration and Customs Enforcement, the US Department of Defense, and the Israeli military has sparked numerous protests in multiple countries. Palantir has been so infamous for so long that, for some people, its name has become a cultural shorthand for dystopian surveillance.\nBut a number of former Palantir employees tell WIRED they believe the public still largely misunderstands what the company actually does and how its software works. Some people think it's a data broker that buys information from private companies and resells it to the government. Others think it’s a data miner, constantly scanning the internet for unique insights it can collect and market to customers. Still others think it maintains a giant, centralized database of information collected from all of its clients. In reality, Palantir does none of these things, but the misconceptions continue to persist.\nPalantir has tried to correct the record itself in a series of blog posts with titles like “Palantir Is Not a Data Company” and “Palantir Is Still Not a Data Company.” In the latter, Palantir explains that “misconceptions can arise because our products are complicated,” but nonetheless, “it is absolutely possible” to accurately describe them to “people who are curious.”\nThe problem, however, is that even ex-employees struggle to provide a clear description of the company. “It's really hard to explain what Palantir works on or what it does,” says Linda Xia, who was an engineer at Palantir from 2022 to 2024. “Even as someone who worked there, it's hard to figure out, how do you give a cohesive explanation?”\nXia was one of 13 former Palantir staffers who signed an open letter published in May arguing that the company risks being complicit in authoritarianism by continuing to cooperate with the Trump administration. She and other former Palantir staffers who spoke to WIRED for this story argue that, in order to grapple with Palantir and its role in the world, let alone hold the company accountable, you need to first understand what it really is.\nIt’s not that former employees literally don’t know what Palantir is selling. In interviews with WIRED, they spoke fluidly about how its software can connect and transform different kinds of data collected by government agencies and corporations. But when asked to, say, name its direct business competitors, two former Palantir employees who requested anonymity to speak freely about their experiences, struggled to come up with anything. “I still don't know how to answer that question, to be honest,” says one.\nJuan Sebastián Pinto, who worked as a content strategist at Palantir and also signed the open letter, says it sells software to other businesses, a category commonly referred to in Silicon Valley as B2B SaaS. Another former staffer says Palantir provides “really extravagant plumbing with data.”\nXia calls Foundry, one of Palantir's flagship software platforms, “a collection of different applications” that customers use to “operationalize data.” A fourth ex-employee dubbed Foundry a “super-charged filing cabinet.” While all of these descriptions are technically accurate, they could also apply to products from hundreds of other tech companies. So what sets Palantir apart?\nPart of the answer may lie in Palantir’s marketing strategy. Pinto says he believes that the company, which recently began using the tagline “software that dominates,” has cultivated its mysterious public image on purpose. Unlike consumer-facing startups that need to clearly explain their products to everyday users, Palantir’s main audience is sprawling government agencies and Fortune 500 companies.\nWhat it’s ultimately selling them is not just software, but the idea of a seamless, almost magical solution to complex problems. To do that, Palantir often uses the language and aesthetics of warfare, painting itself as a powerful, quasi-military intelligence partner. “Palantir is here to disrupt and make the institutions we partner with the very best in the world,” Palantir CEO Alexander Karp says in a February 2025 earnings call, “And when it's necessary, to scare enemies, and on occasion, kill them.”\nPalantir sends its employees to work inside client organizations essentially as consultants, helping to customize their data pipelines, troubleshoot problems, and fix bugs. It calls these workers “forward deployed software engineers,” a term that appears to be inspired by the concept of forward-deployed troops, who are stationed in adversarial regions to deter nearby enemies from attacking.\nA former Palantir employee tells WIRED that the company also has code words for certain job titles—like “Delta” for a forward deployed engineer, and “Echo” for Palantir’s version of a product manager—which they say are sourced from the North Atlantic Treaty Organization's phonetic alphabet of code words meant for use over military radio.\nA different former employee tells WIRED that Palantir staffers will often use the military term “FYSA,” or “for your situational awareness,” instead of “FYI.” Many Palantir emails, they say, also begin with “BLUF:” or “bottom line up front,” followed by a short summary of key details or events. (It’s essentially the military equivalent of “TLDR,” or “too long didn’t read.”) The ex-staffer says this jargon can be traced back to Palantir's first clients, which included US intelligence and military agencies.\nBut arguably Palantir’s most recognizable jargon is borrowed from the Lord of the Rings universe. The company’s name is a reference to J.R.R. Tolkien’s “palantíri,” magical stones that can be used to communicate, see faraway places, and observe moments from the past and future.\nPalantir’s employees are also sometimes called “hobbits.” According to one former employee, a common internal motto in Palantir’s early days was “Save the Shire,” a reference to the hobbit homeland, which they say was a rallying cry that reflected the company’s ethos at the time.\n“It was all about ‘Save the Shire’ and do good for the war fighters,” the ex-staffer says. “It was all about, really, we are going in and solving hard problems.”\nIn response to a detailed request for comment from WIRED, Palantir spokesperson Lisa Gordon said in a statement that the company is “proud to support the US government, especially our warfighters,” and that it has never wavered from its founding mission “to support the West and empower the world’s most important institutions.” Gordon added that the open letter criticizing Palantir was only signed by a small portion of the company’s approximately 8,000 employees and alumni.\n| Got a Tip? |\n|---|\n| Are you a current or former Palantir employee who wants to talk about what's happening? We'd like to hear from you. Using a nonwork phone or computer, contact the reporter securely on Signal at carolinehaskins.61. |\nDawn of Big Data\nUnderneath the jargon and marketing, Palantir sells tools that its customers—corporations, nonprofits, government agencies—use to sort through data. What makes Palantir different from other tech companies is the scale and scope of its products. Its pitch to potential customers is that they can buy one system and use it to replace perhaps a dozen other dashboards and programs, according to a 2022 analysis of Palantir’s offerings published by blogger and data engineer Ben Rogojan.\nCrucially, Palantir doesn’t reorganize a company's bins and pipes, so to speak, meaning it doesn’t change how data is collected or how it moves through the guts of an organization. Instead, its software sits on top of a customer’s messy systems and allows them to integrate and analyze data without needing to fix the underlying architecture. In some ways, it’s a technical band-aid. In theory, this makes Palantir particularly well suited for government agencies that may use state-of-the-art software cobbled together with programming languages dating back to the 1960s.\nPalantir began gaining steam in the 2010s, a decade when corporate business discourse was dominated by the rise of “Big Data.” Hundreds of tech startups popped up promising to disrupt the market by leveraging information that was now readily available thanks to smartphones and internet-connected sensors, including everything from global shipping patterns to the social media habits of college students. The hype around Big Data put pressure on companies, especially legacy brands without sophisticated technical know-how, to upgrade their software, or else risk looking like dinosaurs to their customers and investors.\nBut it’s not exactly easy or cheap to upgrade computer systems that may date back years, or even decades. Rather than tearing everything down and building anew, companies may want a solution designed to be slapped on top of what they already have. That’s where Palantir comes in.\nPalantir’s software is designed with nontechnical users in mind. Rather than relying on specialized technical teams to parse and analyze data, Palantir allows people across an organization to get insights, sometimes without writing a single line of code. All they need to do is log into one of Palantir’s two primary platforms: Foundry, for commercial users, or Gotham, for law enforcement and government users.\nThe Sales Pitch\nFoundry focuses on helping businesses use data to do things like manage inventory, monitor factory lines, and track orders. Gotham, meanwhile, is an investigative tool specifically for police and government clients, designed to connect people, places, and events of interest to law enforcement. There’s also Apollo, which is like a control panel for shipping automatic software updates to Foundry or Gotham, and the Artificial Intelligence Platform, a suite of AI-powered tools that can be integrated into Gotham or Foundry.\nFoundry and Gotham are similar: Both ingest data and give people a neat platform to work with it. The main difference between them is what data they’re ingesting. Gotham takes any data that government or law enforcement customers may have, including things like crime reports, booking logs, or information they collected by subpoenaing a social media company. Gotham then extracts every person, place, and detail that might be relevant. Customers need to already have the data they want to work with—Palantir itself does not provide any.\nA former Palantir staffer who has used Gotham says that, in just minutes, a law enforcement official or government analyst can map out who may be in a person’s network and see documents that link them together. They can also centralize everything an agency knows about a person in one place, including their eye color from their driver’s license, or their license plate from a traffic ticket—making it easy to build a detailed intelligence report. They can also use Gotham to search for a person based on a characteristic, like their immigration status, what state they live in, or whether they have tattoos.\nThe sales pitch for tools like Foundry and Gotham is that they can transcend all of the challenges associated with storing and structuring data, and naturally bring investigations and business decisionmakers to the correct solution. With an objectively superior technology, the thinking goes, the best possible outcomes will follow.\nA version of this logic pervades the internal culture at Palantir. When asked what distinguishes it from other tech companies, former employees consistently mentioned its “flat” staffing structure. Engineers can laterally move to more prestigious or challenging projects if they prove worthy based on their skills and connections. One former staffer tells WIRED that this made the company feel like a meritocracy where the best people, and the best ideas, naturally rise to the top.\nSome former employees say that Palantir’s meritocratic culture helped cultivate a sense of loyalty among staff. But they also believe that this can make it difficult to speak out against the company or its business decisions. (Gordon said that Palantir “prides itself on a culture of fierce internal dialog and disagreement on difficult issues related to our work.”)\nDuring her time at Palantir, Xia says she worked exclusively with private businesses using Foundry. However, she felt a nagging discomfort about the military work happening in other parts of the organization. “I did the thing that I think a lot of people do,” Xia says, “which is, I just didn't engage with it.”\nSince leaving Palantir, Pinto says he’s spent a lot of time reflecting on the company’s ability to parse and connect vast amounts of data. He’s now deeply worried that an authoritarian state could use this power to “tell any narrative they want” about, say, immigrants or dissidents it may be seeking to arrest or deport. He says that software like Palantir’s doesn’t eliminate human bias.\nPeople are the ones that choose how to work with data, what questions to ask about it, and what conclusions to draw. Their choices could have positive outcomes, like ensuring enough Covid-19 vaccines are delivered to vulnerable areas. They could also have devastating ones, like launching a deadly airstrike, or deporting someone.\nIn some ways, Palantir can be seen as an amplifier of people’s intentions and biases. It helps them make evermore precise and intentional decisions, for better or for worse. But this may not always be obvious to Palantir’s users. They may only experience a sophisticated platform, sold to them using the vocabulary of warfare and hegemony. It may feel as if objective conclusions are flowing naturally from the data. When Gotham users connect disparate pieces of information about a person, it could seem like they are reading their whole life story, rather than just a slice of it.\n“It's a really powerful tool,” says one former Palantir employee. “And when it's in the wrong hands, it can be really dangerous. And I think people should be really scared about it.”"
    },
    {
      "url": "https://www.aljazeera.com/news/2025/7/16/why-is-europe-facing-record-breaking-heatwaves#:~:text=This%20June%20was%20the%20warmest%20on%20record%20for%20Western%20Europe&text=The%20same%20average%20temperature%20was,%2C%202019%2C%202022%20and%202023.",
      "text": "Why is Europe facing record-breaking heatwaves?\nWestern Europe has recorded its hottest June, and the continent is the fastest-warming in the world.\nHeatwaves in Europe have arrived unexpectedly early this year with two major spikes in temperatures already affecting millions of people and a third gripping parts of the continent.\nFrom late June to mid-July, temperatures soared as high as 46 degrees Celsius (114 degrees Fahrenheit) with some locations in Western Europe experiencing record-breaking heat.\nWildfires in Greece have triggered evacuations while in France, emergency measures have closed schools and even the Eiffel Tower. In Italy, bans on outdoor labour have affected many workers.\nSpain’s environment ministry said high temperatures have caused 1,180 deaths in the past two months, a sharp increase from the same period last year.\nAccording to a study, about 2,300 heat-related deaths were recorded in 12 European cities from June 23 to July 2. About 1,500 of those deaths were linked to climate change, according to the researchers at Imperial College London and the London School of Hygiene and Tropical Medicine.\n“Climate change has made it significantly hotter than it would have been, which in turn makes it a lot more dangerous,” Dr Ben Clarke, a researcher at Imperial College London, said.\nWhere have heatwaves occurred?\nThe first heatwave Europe experienced peaked between June 17 and 22 and affected Western and Southern Europe.\nDuring the second heatwave, peaking between June 30 and July 2, temperatures exceeded 40C (104F) in several countries with some cities in Spain and Portugal reaching 46C (118F).\nWhat is causing the heatwaves?\nThe persistent heat is being driven by a high-pressure system over Western Europe known as a heat dome.\nIt acts like a lid that traps hot air under it. The pressure from the weather system pushes air down into a hot, dome-shaped mass and prevents milder weather systems from moving through.\nAs a result, it creates prolonged periods of excessively high temperatures.\nThe heat in turn prevents clouds from building up, reducing the chances of rain.\nThis June was the warmest on record for Western Europe\nDue to the weather phenomenon, Western Europe saw its warmest June on record with an average temperature of 20.49C (68.88F), surpassing the previous record for the month from 2003 by 0.06C (0.11F), according to the Copernicus Climate Change Service.\nOn June 30, temperatures averaged 24.9C (76.8F) over Western Europe, setting a new daily temperature record for June. The same average temperature was recorded on July 1.\nThat was one of the highest daily temperatures ever observed in Europe during this time of year. It was exceeded only during the heatwaves of 2003, 2018, 2019, 2022 and 2023.\nEurope is the fastest warming continent and has warmed by 0.53C (0.95F) per decade since the mid-1990s, according to the ERA5 dataset from the Copernicus Climate Change Service.\nSeveral factors are causing this effect in Europe, including shifts in atmospheric circulation, leading to more frequent and intense heatwaves. Additionally, reduced air pollution means that more solar radiation is reaching the Earth’s surface and reducing cloud cover. Certain areas of Europe also extend into the Arctic, which is the fastest warming region on the planet.\nCountries such as the United Kingdom, France, Spain and Portugal saw the hottest temperatures recorded since 1979 from the start of the first heatwave to the end of the second heatwave – June 17 to July 2.\nHeat-related deaths in Europe\nHeatwaves have been deadly for Europe.\nA report by Imperial’s Grantham Institute published last week studied 12 European cities to measure changes in the intensity of heatwaves.\nFrom June 23 to July 2 it estimated there were 2,300 heat-related deaths, including 1,500 linked to climate change, which made the heatwaves more severe.\nClimate change was behind:\n- 317 of the estimated excess heat deaths in Milan\n- 286 in Barcelona\n- 235 in Paris\n- 171 in London\n- 164 in Rome\n- 108 in Madrid\n- 96 in Athens\n- 47 in Budapest\n- 31 in Zagreb\n- 21 in Frankfurt\n- 21 in Lisbon\n- six in Sassari, Italy\nThe study found that the heatwaves were more deadly due to the early arrival of higher temperatures, which usually occur in late July and in August.\nPeople in Europe are not acclimatised to such high temperatures, especially the older population. More than 80 percent of the estimated excess deaths are expected in people older than 65.\nThe world is getting hotter\nLast month was the third warmest June globally since 1850, according to average temperatures. June’s average surface air temperature was 16.46C (61.62F) to 0.47C (0.84F) and higher than the 1991-2020 average for June, according to the Copernicus Climate Change Service.\nGlobal temperatures remain unusually high, closely tracking 2024 – the hottest year on record, having averaged a surface air temperature of 15.1C (59.18F), which was more than 1.5C (2.7F) higher than pre-industrial levels, a threshold seen as crucial to avoid dangerous global warming.\nAn article published last month in the Earth System Science Data journal also noted that human-induced warming has been increasing at a rate of 0.27C per decade from 2015 to 2024, which is the highest rate observed in the instrumental record."
    },
    {
      "url": "https://www.npr.org/2025/08/08/nx-s1-5347716/trump-putin-meeting",
      "text": "Trump says he will host Putin in Alaska next Friday to talk about Ukraine\nPresident Trump said on Friday that he plans to meet Russian President Vladimir Putin in Alaska on Aug. 15 to talk about a plan to end Russia's war in Ukraine, now in its fourth year.\n\"The highly anticipated meeting between myself, as president of the United States of America, and President Vladimir Putin, of Russia, will take place next Friday, August 15, 2025, in the Great State of Alaska. Further details to follow. Thank you for your attention to this matter!\" Trump said on social media.\nPutin last met with a U.S. president in 2021, when he sat down with President Joe Biden in Geneva. Trump last met Putin in 2019 on the sidelines of the G20 in Osaka, Japan.\nEarlier, Trump had told reporters that a deal to end the war in Ukraine would involve some exchange of territory. \"It's very complicated. But we're going to get some [territory] back, and we're going to get some switched. There'll be some swapping of territories to the betterment of both, but we'll be talking about that either later, or tomorrow,\" Trump said.\nThe long-awaited meeting comes after the complicated relationship between Trump and Putin has seen ups and downs over the past several months.\nTrump came into office promising to quickly end the war, boasting that his relationship with Putin would help reach a peace deal.\nFor months, he resisted putting much pressure on Putin, saying he did not want to complicate the path to a peace agreement. But more recently, Trump's posture has shifted as Russia escalated its strikes against Ukraine. Trump has threatened tougher sanctions against Moscow, saying this week that he would apply steep tariffs on India — a key buyer of Russian oil.\nTrump's envoy Steve Witkoff met with Putin on Aug. 6 in Moscow, and afterward, Trump said progress had been made. \"There is a good chance we could be coming to an end of this road. That road was long, and continues to be long, but there's a good chance that there will be a meeting very soon,\" Trump said.\nOfficials in Kyiv and across Europe have accused Moscow of stalling as its troops continue to advance in Eastern Ukraine. Ukraine has also launched surprise drone strikes deep into Russia.\nWhen Russian and Ukrainian officials met in Turkey in May for their first direct peace talks in years, Putin failed to show up. Trump told reporters in May that he thought it would be necessary for him to meet with Putin.\n\"I don't believe anything's going to happen, whether you like it or not, until he and I get together,\" Trump said. \"But we're going to have to get it solved because too many people are dying.\""
    },
    {
      "url": "https://www.theguardian.com/world/2025/aug/11/funeral-held-for-anas-al-sharif-and-other-journalists-killed-in-israeli-strike",
      "text": "The death of the prominent Al Jazeera journalist Anas al-Sharif, killed along with four colleagues in an Israeli airstrike on Sunday, prompted condemnation from around the world, as hundreds of mourners carried their bodies through the streets of Gaza City.\nSharif, one of Al Jazeera’s most recognisable faces in Gaza, was killed while inside a tent for journalists outside al-Shifa hospital in Gaza City on Sunday night. Seven people were killed in the attack, including the Al Jazeera correspondent Mohammed Qreiqeh and the camera operators Ibrahim Zaher, Mohammed Noufal and Moamen Aliwa, according to the Qatar-based broadcaster.\nOn Monday, the Guardian visited the site where the journalists were killed. Wadi Abu al-Saud, a Palestinian journalist who was near the tent when the Israeli strike occurred on Sunday, said the attack happened at 11.22pm, just after he had finished filming his latest news bulletin.\n“I entered the tent opposite theirs, raised my phone to make a call, and then the explosion occurred, Saud said. “A piece of shrapnel hit my phone. I looked back and saw people burning in flames. I tried to extinguish them. Anas and the others had died instantly from the strike.”\nIn two videos of the aftermath of the strike, Saud can be seen carrying the bodies of those killed. “From now on, I will not continue the coverage,” he said. “I will return to my life as a citizen. The truth has died and the coverage has ended.”\nThe Israel Defense Forces (IDF) admitted carrying out the attack, claiming Sharif was the leader of a Hamas cell responsible for rocket attacks against Israel – an allegation that Al Jazeera and Sharif had previously dismissed as baseless.\nIt was the first time during the war that Israel’s military has swiftly claimed responsibility after a journalist was killed in a strike.\nPro-Israel advocates on social media hailed the killing of Sharif and posted photos handed out by the IDF of photos the journalist took with the former Hamas leader Yahya Sinwar, taken before Hamas’s attack on 7 October.\nSara Qudah, the Middle East and north Africa director at the Committee to Protect Journalists (CPJ), said: “Israel’s pattern of labelling journalists as militants without providing credible evidence raises serious questions about its intent and respect for press freedom.”\nIn July, Sharif told CPJ that he lived with the “feeling that I could be bombed and martyred at any moment”.\nReporters Without Borders condemned the “acknowledged murder by the Israeli army” of Sharif in Gaza and called on the international community to intervene.\nKeir Starmer’s spokesperson said: “We are gravely concerned by the repeated targeting of journalists in Gaza. Reporters covering conflicts are afforded protection under international humanitarian law and journalists must be able to report independently without fear, and Israel must ensure journalists can carry out their work safely.”\nThe UN human rights office condemned the targeting of the journalists’ tent, saying it was “in grave breach of international humanitarian law”.\nAl Jazeera said the attack was “a desperate attempt to silence voices in anticipation of the occupation of Gaza” and called Sharif “one of Gaza’s bravest journalists”.\nPeople gathered at Sheikh Radwan cemetery in the heart of the Gaza Strip to mourn the journalists, whose bodies lay wrapped in white sheets at al-Shifa hospital before their burial. Friends, colleagues and relatives embraced and consoled one another.\nThe area where the attack took place was crowded with media workers on Monday, some speaking to cameras or mobile phones, others taking photos.\nIslam al-Za’anoun, a news correspondent for Palestine TV and several Arab channels who participated in the funeral, said Sunday’s attack was “a turning point in the world of journalism”.\nShe said: “Despite all the threats he received and the Israeli media’s incitement against him, al-Sharif continued reporting. Now one question haunts me: Who will be next on the list? Will it be me?”\nBilal Abu Khalifa, a presenter at Al Jazeera, said he had met Sharif four days ago. “He told me he was in danger,” Abu Khalifa said. “I asked him not to go out or appear publicly too often. He gave me a very simple answer: Bilal, I will not leave Gaza except to the sky! I will not leave Gaza even if I am killed. I know I am on the assassination list, but I will continue to expose the crimes of the Israeli army against my people and show the world, and everyone who stands by them, the truth.”\nIn a final message, which Al Jazeera said had been written on 6 April and which was posted to Sharif’s X account after his death, the reporter said he had “lived through pain in all its details, tasted suffering and loss many times, yet I never once hesitated to convey the truth as it is, without distortion or falsification.”\nHe continued: “Allah may bear witness against those who stayed silent, those who accepted our killing, those who choked our breath, and whose hearts were unmoved by the scattered remains of our children and women, doing nothing to stop the massacre that our people have faced for more than a year and a half.”\nAfter the Hamas attacks on 7 October 2023, Israel barred international journalists from entering Gaza – one of the rare moments when international reporters have been denied access to an active war zone. Since then, the task of documenting the war has fallen heavily on Palestinian journalists, often at the cost of their lives – themselves caught in its devastation, displaced multiple times, their homes reduced to rubble, friends and relatives killed, and at times queueing for food at perilous distribution points.\nAccording to Gaza’s government media office, 238 journalists have been killed by Israel since the war started. CPJ said at least 186 journalists had been killed in the Gaza conflict. Israel denies deliberately targeting journalists.\nIn a report released this year, the Watson School of International and Public Affairs’ costs of war project said more journalists had been killed in Gaza than in both world wars, the Vietnam war, the wars in Yugoslavia and the US war in Afghanistan combined."
    },
    {
      "url": "https://www.cnet.com/science/space/you-can-see-two-meteor-showers-at-once-this-week-how-to-catch-a-glimpse/",
      "text": "While meteor showers happen all year, a rarer occurrence is having two meteor showers that peak at the same time. It'll happen this week, on Tuesday.\nThe shooting star show comes courtesy of the Alpha Capricornids and Southern delta Aquariids meteor showers. The former is already happening and runs until Aug. 12, with a peak on Tuesday. Southern delta Aquariids will start on Monday, peaks early on Tuesday and runs until Aug. 12 as well. That means for one evening, the two meteor showers are peaking at the same time, giving stargazers a much better chance at catching a shooting star.\nOf the two, the Southern delta Aquarids is typically the larger meteor shower, tossing upward of 25 meteors per hour during its zenith. Alpha Capricornids is a lesser meteor shower, with about five per hour on average. Combined, they'll output an estimated 30 per hour.\nSee 2 meteor showers at once\nSince the meteors are coming from two different points in the sky, you would think spotting meteors from both would be difficult, but that is far from the truth.\nAlpha Capricornids, which hails from the 169P/NEAT comet, originates from the Capricornus constellation. It will rise from the eastern skies across the continental US around sunset and streak across the southern sky, setting in the western sky at sunrise.\nFor the Southern delta Aquariids, its radiant — the point from which its meteors seem to originate — is the Aquarius constellation. Aquarius is right next to Capricornus. That means it also rises out of the eastern horizon, streaks across the southern sky, and sets in the western horizon around dawn.\nIf you have trouble finding either of them, Stellarium's free sky map will help you hunt them down. Set the time, date and location, and you're off to the races. Once you find one, the other one is essentially right there next to it.\nTips on watching meteor showers\nAs per the norm, the tips here are the same as they are for the aurora borealis and planet parades. Light pollution and weather are your two biggest enemies. Since you can only do anything about one of those, let's focus on light pollution. You'll want to drive as far away from the city and suburbs as possible, as the light pollution will make it difficult to see the dimmer meteors. The farther away you are, the better, as even suburban light pollution can obfuscate most meteors.\nOnce out there, you just have to sit and wait. Since the constellations will move across the south as you watch, you may have to rotate your chair if you're out there for a while. Otherwise, a pair of binoculars may help. Telescopes aren't recommended, as they obscure your field of view and may actively obstruct your ability to see meteors."
    },
    {
      "url": "https://www.dw.com/en/rahul-gandhi-embraces-his-new-role-as-head-of-indias-opposition/a-69630543",
      "text": "Gandhi embraces role as India opposition leader\nJuly 11, 2024Just three days after a crowd crush disaster at a religious event in northern Uttar Pradesh state killed more than 120 people, Rahul Gandhi, the newly appointed leader of the opposition in the lower house of India's Parliament, visited the site to meet with family members of those killed.\n\"It is a matter of grief that so many families have suffered, so many have lost their lives,\" Gandhi told reporters after meeting with the families. \"I don't want to speak through a political prism, but there have been some lapses on the part of the administration. There have been mistakes, which should be identified.\"\nSoon after, Gandhi visited relief camps in Manipur, a state in northeastern India that has been torn by ethnic conflict.\n\"I want to tell Manipur, I come here as your brother. I want to work with you to bring back peace in Manipur,\" he said.\nAt each stop, Gandhi railed against Prime Minister Narendra Modi and his ruling Bharatiya Janata Party (BJP). For Gandhi, who has often been portrayed as an unserious politician, the gains by his Congress Party and the opposition in the recently concluded national elections have given him a wider, more prominent platform to take on the BJP.\nNew role, same rhetoric\nDespite having won a third consecutive term, Prime Minister Modi's BJP failed to win an outright majority and now relies on coalition partners to remain in power.\nIn his first address to parliament earlier this month, his first since being appointed leader of the opposition, Gandhi picked up where he left off on the campaign trail, attacking Modi's government on various fronts.\n\"All religions talk about courage. All our great men have spoken about non-violence and fear. But those who call themselves Hindu only talk about violence, hatred, untruth,\" said Gandhi, referring to the BJP.\nHe finished the statement by asking in Hindi, \"Are you Hindu or not?\"\nThis remark led to loud protests from the BJP members and their allies. The comment was considered so inflammatory that it was later expunged from the parliamentary record. For many, though, the comments signaled a change in the power dynamics of the newly constituted legislature.\n\"Gandhi surprised Modi and his political opponents by his sharp speech in parliament. He has emerged as a powerful voice on issues that have put the government on the defensive,\" political analyst Rasheed Kidwai told DW. \"Gandhi wants to prove his detractors wrong that he lacks application and avoids a position of responsibility.\"\nGandhi's more prominent role\nAs the Congress Party's most prominent face, Gandhi's popularity has soared since the election. His image was bolstered in the run-up to the election as Gandhi embarked on a 6,700-kilometer-long (4,160 miles) trek across India. Some observers believe that these actions have transformed his image into that of a \"poor man's leader.\"\n\"His constant mention of social justice, and saving the Constitution not only pulled in more listeners but has solidified his support base. For the first time, there was great coherence in Gandhi's pitch,\" Alishan Jafri, a commentator told DW, adding that Gandhi needs to continue to debate Modi on real issues that matter to all Indians.\n\"Modi has altered the thought process of many Indians. They see rights with contempt and government as the ultimate authority before which all subjects must kneel. For Gandhi, the real challenge is to remind the people that all Indians have the right to have rights,\" added Jafri.\nPolitical columnist Radhika Ramaseshan told DW that Gandhi's new position is markedly different from his previous stint as the Congress president.\n\"The difference this time is that he has accepted a constitutional post. The Congress Party's vastly improved performance in the election has given him the confidence he lacked,\" said Ramaseshan.\nShe pointed out that these were still early days and the Gandhi would be tested in and out of parliament. \"Consistency is all-important to motivate the Congress workers and galvanize their morale. It is a long haul and the onus to take the party to a position where it can respectably challenge the BJP lies squarely on Gandhi.\"\nEdited by Ole Tangen Jr\nBefore you leave: Every Friday, the DW Asia newsletter delivers compelling articles and videos from around the continent right to your inbox. Subscribe below."
    },
    {
      "url": "https://www.cnet.com/science/space/look-to-the-sky-bright-fireballs-appear-during-the-perseids-meteor-shower/",
      "text": "Skygazers rejoice, the summer isn't finished with delivering dazzling meteor showers. The last week of July saw dueling meteor showers taking over the sky, but the most popular meteor shower of the year won't hit its peak until next week. The Perseids meteor shower is about to give you a real light show, provided you're far enough away from light pollution to see it.\nPerseids are known for their bright fireballs and plentiful meteors. The show started on July 17, and will run through Aug. 23.\nThe reason the Perseids meteor shower is so popular is twofold. First, it takes place in the summer, so going outside and watching it is less uncomfortable than other large meteor showers like Quadrantids, which takes place in wintery January.\nThe other reason is that it's one of the most active meteor showers of the year. During its peak, the meteor shower is known to rain down as many as 100 meteors per hour, according to the American Meteor Society. These not only include your typical shooting stars, but also a higher chance for fireballs, which are meteors that explode as they enter orbit. Per NASA, fireballs tend to last longer than standard shooting stars and can come in a variety of different colors.\nPerseids come to Earth courtesy of the 109P/Swift-Tuttle comet. Earth's orbit around the sun brings it through Swift-Tuttle's tail every year. The comet itself takes 133 years to orbit the sun. Its last perihelion -- the point at which it's the closest to the sun -- was in 1992. It won't be back until the year 2125. Until then, it leaves behind an excellent tail of dust and debris to feed us yearly meteor showers.\nHow to catch the Perseids meteor shower\nThe best time to view the Perseids is during its peak, which occurs on the evenings of Aug. 12 and 13. During this time, the shower will produce anywhere from 25 to 100 meteors per hour on average. However, since the shower officially lasts for over a month, you have a chance to see a shooting star on any given evening, provided that you're far enough away from light pollution.\nThus, if you're planning on watching this year's Perseids during their peak, you'll want to get out of the city and suburbs as far as possible. According to Bill Cooke, lead of NASA's Meteoroid Environments Office, folks in the city might see one or two meteors from the meteor shower per hour, which is pocket change compared to what those outside city limits might see.\nRegardless, once you've arrived at wherever you want to watch the meteors, you'll want to direct your attention to the radiant, or the point at which the meteors will appear to originate. Like all meteors, Perseids are named after the constellation from which they appear. In this case, it's Perseus.\nPer Stellarium's free sky map, Perseus will rise from the northeastern horizon across the continental US on the evenings of Aug. 12 and 13. It'll then rise into the eastern sky, where it'll remain until after sunrise. So, in short, point yourself due east and you should be OK. Binoculars may help, but we recommend against telescopes since they'll restrict your view of the sky to a very small portion, which may hinder your meteor-sighting efforts.\nThe American Meteor Society also notes that the moon may give viewers some difficulty. Perseids' peak occurs just three days after August's full moon, so the moon will still be mostly full. Thus, it is highly probable that light pollution from the moon may reduce the number of visible meteors by a hefty margin, depending on how things go."
    },
    {
      "url": "https://www.dw.com/en/indias-elections-are-a-mammoth-undertaking/a-68521065",
      "text": "India's elections are a mammoth undertaking\nMarch 14, 2024In India, around 970 million voters are eligible to cast their ballots during the upcoming election .\nThe vote will determine whether the ruling Bharatiya Janata Party (BJP) of Indian Prime Minister Narendra Modi will be elected a rare third consecutive term in power.\nPeople eligible to vote in the world's most populous country include 497 million male, 471 million female and 48,044 third-gender electors, according to India's Election Commission (EC), which is overseeing the gargantuan exercise in democracy.\nLargest festival of democracy\nMore women than men have enrolled as new electors for the upcoming vote, said the poll panel, and over 20 million voters aged 18 to 29 have been added to the electoral roll.\nVoters will cast their ballots in one of the 1.25 million booths, spread across densely populated megacities and far-flung villages, overseen by 15 million election officials across the 28 states and nine union territories.\nIndia's electoral rules say there must be a polling station within 2 kilometers (about 1.2 miles) of every habitation.\nIn addition, the EC will fan out a whole gamut of observers to ensure the fairness of the ballot.\nAlmost 340,000 security personnel from the central armed police forces have been requisitioned to assist the existing state police officers — a task that requires a lot of logistical organization.\n\"We have underlined the need for timely movement of central forces being deployed for election duty\" an EC official told DW. \"Indian Railways is roped in to move forces from one location to another.\"\nMeticulous planning\nOnce the election schedule is announced, the EC enforces a model code of conduct — a set of guidelines for the conduct of political parties and candidates during elections.\nIts main purpose is to ensure that ruling parties do not misuse their position of advantage to gain an unfair advantage, and it's designed to prevent practices that are deemed corrupt.\n\"The logistics of an Indian general elections has always been formidable,\" former chief election commissioner S. Y. Quraishi told DW. \"When the country voted in the first election of 1951-52, almost a sixth of the world's population voted. The numbers are staggering.\"\nAt that time, out of a total population of 360 million, about 173.2 million people were eligible to vote. The turnout in the first general elections was 45%. In the fray were 53 political parties contesting for 489 parliamentary seats; voting went on for about four months.\nIn 2019, 8,054 candidates representing 673 parties stood for elections from 543 constituencies for a shot at becoming a member of parliament.\nQuraishi, who wrote the book \"An Undocumented Wonder: The Making of the Great Indian Election,\" pointed out that meticulous planning is gone through on all fronts.\nThis includes different aspects that go into the organization of the elections which are carefully mapped — including deployment of security forces and electronic voting machines.\nTechnology and artificial intelligence\nIndia has been using secure electronic voting machines since 1999. In 2014, it introduced a second machine, a printer that deposits a hard copy of each ballot into a sealed box called a Voter Verifiable Paper Audit Trail, ensuring an additional layer of security. Typically, 3 million to 4 million voting machines are deployed for a general election in India.\nElection officials must not only account for the most remote voters, but also provide efficient systems for those in the country's crowded cities. While polls are staggered, electronic voting will enable counting to be concluded in just a day.\n\"To organize elections on such a large scale and conduct them in a free and fair manner is certainly a huge task,\" said Quraishi.\nIndia's electorate is four times the size of the United States, meaning more than 10% of the world's population is eligible to vote this year.\nIn a lengthy recent report, the Carnegie Endowment for International Peace said in India's last general election, held in 2019, parties and candidates spent an estimated $8.7 billion (€8.02 billion) to woo more than 900 million eligible voters.\nWith India's Supreme Court scrapping electoral bonds last month, financing polls in the world's largest democracy is expected to be the most expensive. The New Delhi-based Centre for Media Studies estimates that political parties and candidates are set to spend more than $14.4 billion in the elections.\nThe electoral bonds scheme requires donors to purchase electoral bonds from the government-owned State Bank of India in denominations ranging between 1,000 and 10 million rupees (€11.2 and €112,220, or $12 and $120,000).\nThe donors do not need to disclose their identity, and donations are exempt from taxes. The scheme has been challenged by opposition members and civil society groups on the grounds that it lacked transparency.\nAnother first in India's upcoming elections is that both the ruling BJP and the main opposition Congress Party will be actively deploying artificial intelligence (AI) to enhance their campaign strategies.\nFor this reason, the Election Commission will for the first time set up hundreds of control rooms dedicated to spotting fake content on social media.\nEdited by: Keith Walker"
    },
    {
      "url": "https://www.theguardian.com/us-news/2025/aug/11/steel-plant-explosion-pennsylvania",
      "text": "An explosion at a US Steel plant in Pennsylvania, near Pittsburgh, has killed two people and injured at least 10 on Monday, officials said.\nThe body of one worker was pulled from the wreckage hours after an explosion that sent black smoke spiraling into the sky in the Mon Valley, a region of the state synonymous with steel for more than a century. Allegheny county emergency services said a fire at the plant started around 10.51am. Authorities later said a second person had died.\nAbigail Gardner, the director of communications for Allegheny county, told local news station TribLive that “a search-and-rescue operation” was under way after the blast.\nThe explosion, followed by several smaller blasts, could be felt in the nearby community and prompted county officials to warn residents to stay away from the scene so emergency workers could respond.\n“It felt like thunder,” Zachary Buday, a construction worker near the scene, told WTAE-TV. “Shook the scaffold, shook my chest, and shook the building, and then when we saw the dark smoke coming up from the steel mill and put two and two together, and it’s like something bad happened.”\nPennsylvania governor Josh Shapiro said in a statement on X: “My administration is in touch with local officials in Clairton … as they respond to an explosion at US Steel Clairton Coke Works plant [Monday] morning.”\nHe said Pennsylvania’s emergency management agency and its state police were in “touch with first responders and have offered all assistance”.\nJohn Fetterman, a Democratic Pennsylvania US senator who formerly served as the mayor of nearby Braddock, called the explosion “absolutely tragic” and vowed to support steelworkers in the aftermath.\n“I grieve for these families,” Fetterman said. “I stand with the steelworkers.”\nClairton’s mayor, Richard Lattanzi, said his heart went out to the victims of the explosion. “The mill is such a big part of Clairton,” he said. “It’s just a sad day for Clairton.”\nThe Clairton Coke Works, a huge industrial facility along the Monongahela River about 20 miles (32km) south of Pittsburgh, is considered the largest coking operation in North America.\nThe plant, which is part of US Steel and more than 120 years old, bakes coal at high temperatures into a pure carbon form that is then used in blast furnaces to turn iron ore into liquid iron used to make steel.\nThe Clairton plant supplies coke to US Steel’s mill in Gary, Indiana, and has previously been subject to concerns about safety and pollution.\nIn February, a problem with a battery at the plant led to a “buildup of combustible material” that ignited, causing an audible “boom”, the Allegheny county health department said. Two workers who got material in their eyes received first aid treatment at a local hospital but were not seriously injured.\nIn 2019, it agreed to settle a 2017 lawsuit for $8.5m. Under the settlement, the company agreed to spend $6.5m to reduce soot emissions and noxious odors from the plant.\nIn June, US Steel and Nippon Steel announced they had finalized a “historic partnership”. The deal came a year and a half after the Japanese company first proposed its nearly $15bn buyout of the US steelmaker.\nThe deal was approved with a caveat issued by Donald Trump in a June executive order, in which the president said he “reserved my authority to issue further orders with respect to the purchasers or US Steel as shall in my judgment be necessary to protect the national security of the United States”.\nThe Breathe Project, a south-western Pennsylvania group working to improve air quality in the region, warned the facility was likely emitting hazardous air pollutants, including asbestos, heavy metals and possibly benzene.\n“This is the third major event at this plant in 2025. There was a stack explosion on February 2, 2025. A pollution control room malfunction on June 2-3, 2025 took pollution control equipment offline for an extended period of time. There were no known major documented injuries from these prior two incidents. Unfortunately, the incident today is more dire,” it said in a statement.\n“Many people have been concerned about this facility and the community that hosts it for a long time. For decades, workers and residents across Western Pennsylvania have heard lofty promises from US Steel – many of which are later delayed or abandoned – and often delivered without transparency or meaningful community involvement,” it added, warning: “Problems have been ongoing with the facility, piling tragedy upon tragedy.”\nAssociated Press contributed reporting"
    },
    {
      "url": "https://www.cnet.com/science/how-to-watch-this-weeks-meteor-shower-all-in-2025-shooting-star-guide/",
      "text": "Want to see a meteor shower next week? They come around every year like clockwork and that means planning shooting star trips can be done months in advance. Here's a look at the next one, plus what's coming for the rest of 2025.\nTips for watching\nTo have the best odds of seeing the most meteors during any given shower, the first advice is to get as far away from the big city as logistically possible -- and that also applies to suburbanites. Light pollution is the enemy of space viewing and most meteor showers are barely visible in the suburbs, let alone a big city. From there, you'll want to find the radiant -- also known as the point from which the meteor shower appears to originate -- and then keep your eyes pointed in that direction. The moon's light can also be a negative factor, but since meteor showers occur on specific days, it's up to nature as to whether or not moonlight will affect viewing.\nLyrids\nWhen: Apr. 15 to Apr. 30\nPeak date: Apr. 21 to 22\nMaximum meteor rate: 18 meteors per hour\nRadiant: Lyra\nThings pick up again in April with the Lyrids meteor shower. Its radiant is Lyra, which will rise out of the eastern sky every night during its run. This one is a little bigger than most, having up to 18 meteors per hour. Earth runs through the C/1861 G1 Thatcher comet every April to bring this shower to its citizens. Interestingly, meteors from Lyrids tend to not have trails but can produce some pretty bright fireballs.\nEta Aquariids\nWhen: Apr. 20 to May 21\nPeak date: May 3 to 4\nMaximum meteor rate: 50 meteors per hour\nRadiant: Aquarius\nThe 1P/Halley, famously known as Halley's Comet, is responsible for the Eta Aquariids, and it's the biggest meteor shower to occur during spring with up to 50 meteors per hour. The only downside is that its radiant, Aquarius, doesn't rise out of the southeastern sky until around 4 a.m. local time, meaning you'll have to wake up very early or stay up super late to catch it. On the plus side, the moon will have set by then, meaning the moon won't obstruct the view for this meteor shower.\nAlpha Capricornids\nWhen: July 12 to Aug. 12\nPeak date: July 29 to 30\nMaximum meteor rate: 5 meteors per hour\nRadiant: Capricornus\nAlpha Capricornids is a minor meteor shower that comes from the 169P/NEAT comet. It's not a strong shower, but it is notable for producing some rather large fireballs. It's also equally visible in the Southern and Northern Hemispheres. The radiant for this one is Capricornus, which streaks through the south sky and will be visible all night during its peak. Fortunately, the moon won't be too full, so it won't obstruct the view too much.\nSouthern delta Aquariids\nWhen: July 28 to Aug. 12\nPeak date: July 29 to 30\nMaximum meteor rate: 25 meteors per hour\nRadiant: Aquarius\nSouthern delta Aquariids often overshadows the Alpha Capricornids. This meteor shower peaks early, just a day or two after it officially starts, and then tails off through mid-August. Its early peak puts it on the same day as Alpha Capricornids, so if you see a shooting star on July 29 or 30, it might have come from either one. The radiant for this one is Aquarius, which is right next to Capricornus, making the two showers a fine pairing. Researchers aren't 100% certain which comet gives us the Southern delta Aquariids, although the best guess right now is 96P/Machholz.\nPerseids\nWhen: July 17 to Aug. 23\nPeak date: Aug. 12 to 13\nMaximum meteor rate: 100 meteors per hour\nRadiant: Perseus\nPerseids is one of the premier space events that takes place during the summer. It comes from the 109P/Swift-Tuttle comet and is one of the most consistently busy meteor showers of the year. Plus, it takes place over the summer, which is perfect meteor shower weather. The radiant is Perseus, which rises out of the northeastern sky relatively early in the evening and stays up all night. The only downside is that the moon will be almost full during Perseids' peak in 2025, making it more difficult to see the smaller meteors.\nSouthern Taurids\nWhen: Sept. 23 to Nov. 4\nPeak date: Oct. 10 to 11\nMaximum meteor rate: 5 meteors per hour\nRadiant: Taurus\nSouthern Taurids is one of the longest-lasting meteor showers of the year lasting well over a month. It's not a particularly active meteor shower, but since it takes place during several other meteor showers, you may spot one of these while looking for another one. The 2P/Encke comet fuels this one and it peaks a couple of weeks away from Halloween. This one is paired with the Northern Taurids to make the Taurids meteor shower. However, they peak on different days so they're often listed as separate meteor showers.\nOrionids\nWhen: Oct. 2 to Nov. 12\nPeak date: Oct. 22 to 23\nMaximum meteor rate: 20 meteors per hour\nRadiant: Orion\nOrionids is a reasonably active meteor shower that happens mostly during October. It also has the distinction of coming from the famous Halley's Comet just like the Eta Aquariids shower. Unlike Eta Aquariids, the Orionids come out of the Orion constellation, which rises out of the eastern sky in October. Also, the moon will be virtually new, so it'll have one of the darkest skies of any meteor shower this year.\nDraconids\nWhen: Oct. 6 to Oct. 10\nPeak date: Oct. 8\nMaximum meteor rate: 10 meteors per hour\nRadiant: Draco\nDraconids is a minor meteor shower and the shortest one on the list, lasting for all of four days. It hails from the 21/P Giacobini-Zimmer comet and has a fairly decent peak at around 10 meteors per hour. The peak occurs just two days after it starts and then the meteor shower ends two days later. The radiant for Draconids is Draco, which is between the Big Dipper and Little Dipper, making it relatively easy to find in the night sky.\nNorthern Taurids\nWhen: Oct. 13 to Dec. 1\nPeak date: Nov. 8 to 9\nMaximum meteor rate: 5 meteors per hour\nRadiant: Taurus\nNorthern Taurids is the other half of the Taurids meteor shower and this one lasts even longer, going from the middle of October all the way until December. It peaks about halfway through its run on Nov. 8, which is a few weeks later than its southern counterpart. Otherwise, the two are virtually identical. They are both fueled by the 2P/Encke comet and at their best produce around five meteors per hour. For now, researchers believe that this shower comes from a different segment of the Encke comet trail, which is why it's often listed separately from its southern cousin.\nLeonids\nWhen: Nov. 3 to Dec. 2\nPeak date: Nov. 16 to 17\nMaximum meteor rate: 15 meteors per hour\nRadiant: Leo\nJust a few days after the Northern Taurids peaks, the Leonids shower will also peak. Created by the 55P/Tempel-Tuttle comet, Leonids will come from the Leo constellation, which rises in the eastern sky right around 2 a.m. local time for most of its run. This is a bigger meteor shower than the Taurids but a smaller shower than the Orionids. Since all four of them intersect during the first week of November, it may be tough to tell which meteor shower a shooting star comes from. This is especially true since Taurus, Leo, and Orion are all in the eastern sky at this time of year. Leonids often has fast, bright meteors that leave a trail, which may be the only way to differentiate a Leonids meteor from the other three showers.\nGeminids\nWhen: Dec. 4 to Dec. 20\nPeak date: Dec. 14 to 15\nMaximum meteor rate: 120 meteors per hour\nRadiant: Gemini\nGeminids is one of the biggest meteor showers of the year, and it peaks less than two weeks away from Christmas. It's generated by the 3200 Phaethon comet and can show as many as 120 meteors per hour in the right conditions. Geminids is best known for its brighter, slower-moving meteors, making them easier to see in brighter areas like cities or suburbs. It takes place during the cold season, but it can put on quite a show if viewed from outside the big city.\nUrsids\nWhen: Dec. 17 to Dec. 26\nPeak date: Dec. 22 to 23\nMaximum meteor rate: 10 meteors per hour\nRadiant: The Little Dipper\nUrsids begins right after the peak of Geminids and continues until the day after Christmas. Since Geminids ends before Christmas, it is statistically likely that if you've ever watched a Christmas movie that has a shooting star, it likely came from Ursids. The shower peaks on the evening of Dec. 22 from the Little Dipper, which is readily visible in the night sky for most of the evening. Much like Draconids, it disappears almost as fast as it shows up, lasting only nine days in total.\nQuadrantids\nWhen:: Dec. 12, 2025 to Jan. 12, 2026\nPeak date: Jan. 3 to 4, 2026\nMaximum meteor rate: 120 meteors per hour\nRadiant: The Big Dipper\nThe year ends the same way it begins with the Quandrantids meteor shower. It starts in early December and wraps around to the New Year. Thus, while it does have the distinction of being the only meteor shower that occurs twice a year, the peak is always in the first few days of January. Otherwise, it's the same meteor shower as the Quadrantids listed above. So, we'll use this space to deliver a fun fact. Most meteor showers are fueled by comets, chunks of ice floating through the universe that leave long trails that, as Earth moves through them, create meteors. However, Quadrantids is fueled by 2003 EH, which is an asteroid and not a comet. Researchers believe that 2003 EH is potentially a comet that died out and became an asteroid."
    },
    {
      "url": "https://www.aljazeera.com/news/2025/8/10/al-jazeera-journalist-anas-al-sharif-killed-in-israeli-attack-in-gaza-city",
      "text": "Anas al-Sharif among five Al Jazeera staff killed by Israel in Gaza\nAl Jazeera staff killed in targeted Israeli attack on a tent housing journalists near al-Shifa Hospital, Gaza City.\nAl Jazeera journalist Anas al-Sharif has been killed alongside four colleagues in a targeted Israeli attack on a tent housing journalists in Gaza City.\nThe attack late on Sunday on the tent located outside the main gate of Gaza City’s al-Shifa Hospital also killed Al Jazeera correspondent Mohammed Qreiqeh and camera operators Ibrahim Zaher, Mohammed Noufal and Moamen Aliwa. Freelance reporter Mohammed al-Khaldi was also among those reported killed.\nRecommended Stories\nlist of 4 itemsIsrael kills four Al Jazeera journalists including Anas al-Sharif in Gaza\nGaza journalist reports on Israeli attack that killed Al Jazeera colleagues\nIsrael kills Anas al-Sharif and four other Al Jazeera journalists in Gaza\nShortly before being killed, al-Sharif, a well-known 28-year-old Al Jazeera Arabic correspondent who had reported extensively from northern Gaza, wrote on X that Israel had launched intense, concentrated bombardment – also known as “fire belts” – on the eastern and southern parts of Gaza City.\nIn his last video, the loud booms of Israel’s intensive missile bombing can be heard in the background as the dark sky is lit in a flash of orange light.\nقصف لا يتوقف…\nمنذ ساعتين والعدوان الإسرائيلي يشتد على مدينة غزة. pic.twitter.com/yW8PesTkFT— أنس الشريف Anas Al-Sharif (@AnasAlSharif0) August 10, 2025\nTranslation: Nonstop bombing… For the past two hours, the Israeli aggression on Gaza City has intensified.\nIn a final message, written on April 6, to be published in the event of his death, al-Sharif said he “lived the pain in all its details” and “tasted grief and loss repeatedly”.\n“Despite that, I never hesitated to convey the truth as it is, without distortion or misrepresentation, hoping that God would witness those who remained silent, those who accepted our killing, and those who suffocated our very breaths,” he said.\n“Not even the mangled bodies of our children and women moved their hearts or stopped the massacre that our people have been subjected to for over a year and a half.”\nThe reporter also expressed sorrow for having had to leave his wife, Bayan, behind, and for not seeing his son, Salah, and daughter, Sham, grow up.\n‘Desperate attempt to silence voices’\nIn a statement, Al Jazeera Media Network condemned the killings as “yet another blatant and premeditated attack on press freedom”.\n“This attack comes amid the catastrophic consequences of the ongoing Israeli assault on Gaza, which has seen the relentless slaughter of civilians, forced starvation, and the obliteration of entire communities,” the network said.\n“The order to assassinate Anas Al Sharif, one of Gaza’s bravest journalists, and his colleagues, is a desperate attempt to silence the voices exposing the impending seizure and occupation of Gaza.”\nAl Jazeera called on the international community and all relevant organisations to “take decisive measures to halt this ongoing genocide and end the deliberate targeting of journalists”.\n“Al Jazeera emphasises that immunity for perpetrators and the lack of accountability embolden Israel’s actions and encourage further oppression against witnesses to the truth,” the network said.\nAl Jazeera correspondent Hani Mahmoud, who was just one block away when the strike hit, said reporting on al-Sharif’s killing was the hardest thing he has had to do in the past 22 months of war.\nMahmoud, who works for the network’s English channel, said the reporters were killed “because of their relentless reporting on the starvation and the famine and the malnutrition” suffered by Palestinians in Gaza, “because they’re bringing the truth of this crime to everyone”.\nNo proof of Hamas affiliation\nIn a statement confirming the deliberate killing of al-Sharif, Israel’s military accused the journalist of heading a Hamas cell and “advancing rocket attacks against Israeli civilians and [Israeli] troops”. It also alleged that it had documents providing “unequivocal proof” of his involvement with the Palestinian group.\nMuhammed Shehada, an analyst at the Euro-Med Human Rights Monitor, said there was “zero evidence” that al-Sharif took part in any hostilities.\n“His entire daily routine was standing in front of a camera from morning to evening,” he told Al Jazeera.\nLast month, after Israeli army spokesperson Avichai Adraee reshared a video on social media accusing al-Sharif of being a member of Hamas’s military wing, the United Nations special rapporteur on freedom of expression, Irene Khan, said she was “deeply alarmed by repeated threats and accusations of the Israeli army” against al-Sharif.\n“Fears for al-Sharif’s safety are well-founded as there is growing evidence that journalists in Gaza have been targeted and killed by the Israeli army on the basis of unsubstantiated claims that they were Hamas terrorists,” Khan said.\nAl Jazeera, which has accused Israeli authorities of fabricating evidence to link its staff to Hamas, had recently denounced Israel’s military for waging a “campaign of incitement” against its reporters in the Gaza Strip, including al-Sharif.\nThe Committee to Protect Journalists last month said it was gravely concerned for the journalist’s safety as he was being “targeted by an Israeli military smear campaign”.\nSince Israel launched its war on the enclave in October 2023, it has routinely accused Palestinian journalists in Gaza of being Hamas members as part of what rights groups say is an effort to discredit their reporting of Israeli abuses.\nThe Israeli military has killed more than 200 reporters and media workers since its bombardment began, including several Al Jazeera journalists and their relatives."
    },
    {
      "url": "https://www.npr.org/2025/06/02/nx-s1-5414522/ukraine-peace-talks-russia-trump-putin-istanbul",
      "text": "Trump promised peace in Ukraine within a day. Here's what actually happened\nDonald Trump often promised to get a deal to end the fighting in Ukraine in one day, but more than four months since his second-term inauguration that goal looks as far away as ever.\nRussia proposed another attempt at peace negotiations with Ukraine on Monday in Istanbul, but both sides remain firmly entrenched in their positions on territorial disputes and sovereignty that have thus far made substantial progress unlikely.\nMeanwhile, Trump, who has been eager to bring Ukrainian President Volodymyr Zelenskyy and Russian President Vladimir Putin to the table, has been showing signs of frustration over the process, suggesting that he is prepared to \"just back away\" and allow the fighting to continue if the two leaders can't make progress soon.\nSeth Jones, president of the defense and security department of the Center for Strategic and International Studies (CSIS), describes the U.S. role so far in the negotiations as \"relatively weak\" and cautions that if the administration were to walk away from the talks \"it would fundamentally shift the balance of power in the war to the Russian side.\"\nHe adds that European nations could not easily or quickly replace the intelligence that the U.S. has provided.\nBut Samuel Charap, distinguished chair in Russia and Eurasia policy at the RAND research institute, says \"If 'walking away' just means that the president is less engaged and leaves it more to working-level officials ... then that might not be such a calamity,\" but if it means cutting off military assistance and intelligence support to Kyiv, \"that would be a problem.\"\nAccording to a U.S. assessment released in April, an estimated 790,000 Russian soldiers have been killed or injured since the Feb. 24, 2022, invasion of Ukraine, while Zelenskyy has said more than a total of 400,000 Ukrainian forces been killed or injured since the start of the fighting.\nEven so, \"the Russian preference is for this to end on the battlefield with a Russian victory, rather than have to go to any kind of serious peace talks where they may actually have to give up some of their objectives,\" Jones says.\nEven before the start of his second term, Trump's remarks on the campaign trail telegraphed a notable shift away from the Biden administration's nearly unqualified support for Ukraine. In an appearance on a podcast before the election, Trump suggested that Zelenskyy was to blame for the invasion.\n\"He should never have let that war start. The war's a loser,\" Trump said then, adding that President Joe Biden had \"instigated that war.\"\nHere is a look at how the Trump administration's efforts to bring about a peace have fared.\nFebruary\nWeeks after his inauguration, Trump made separate calls to Vladimir Putin and Volodymyr Zelenskyy. He then announced plans for an in-person meeting with the Russian leader in Saudi Arabia.\n\"I think we're on the way to getting peace,\" Trump told reporters in the Oval Office. \"I think President Putin wants peace, and President Zelenskyy wants peace. I want peace. I just want to see people stop getting killed.\"\nBut days later, it wasn't Trump and Putin sitting down together — instead, Secretary of State Marco Rubio met with his Russian counterpart, Sergey Lavrov. In any case, the U.S. willingness for a high-level meeting with Kremlin officials that seemingly cut out Ukraine signaled a fundamental shift from the Biden administration policy.\nSecretary of Defense Pete Hegseth also suggested that Kyiv would have to permanently cede some territory illegally seized by Russia, including Crimea, a Ukrainian Black Sea peninsula that Russia annexed in 2014. Since the start of the war, retaking Crimea has been a key strategic goal for Ukraine.\nInitially, Zelenskyy rejected a White House proposal offering the U.S. access to Ukraine's critical mineral reserves as compensation for past military and financial support, as well as a means to secure future aid.\nHe later relented, traveling to Washington for a now-infamous meeting at the White House on Feb. 28 to finalize the deal. During an extraordinary Oval Office moment captured by media outlets, President Trump and Vice President Vance publicly scolded Zelenskyy, accusing him of lacking gratitude for American assistance.\nAs discussions turned to potential peace negotiations, Trump remarked, \"You don't have the cards right now. With us, you start having the cards.\" Zelenskyy, remaining composed, replied: \"I'm not playing cards. I'm very serious, Mr. President.\"\n\"I have determined that President Zelenskyy is not ready for Peace if America is involved, because he feels our involvement gives him a big advantage in negotiations,\" Trump posted on his social media platform after the meeting. \"I don't want advantage, I want PEACE. He disrespected the United States of America in its cherished Oval Office. He can come back when he is ready for Peace.\"\nMarch\nJust days after Zelenskyy's meeting in the Oval Office, the White House announced it was suspending critical aid and intelligence sharing with Ukraine — a decision that risked undermining Kyiv's position on the battlefield and potentially giving Russian forces a strategic advantage.\nUkraine announced it would accept a limited 30-day ceasefire, provided Russian forces reciprocated. While Putin rejected a broader truce, he did agree to an immediate halt to strikes on Ukraine's energy infrastructure.\nDuring high-level talks in Jeddah, Saudi Arabia, with Ukrainian officials, the United States pledged to resume providing aid and intelligence to Kyiv. In a joint statement, both governments described the discussions as \"important steps toward restoring durable peace for Ukraine.\"\nAt a subsequent meeting in Riyadh, between the U.S. and Russia, Moscow agreed to a Black Sea ceasefire aimed at ensuring safe navigation, prohibiting the use of force, and preventing commercial vessels from being used for military purposes. Kremlin spokesperson Dmitry Peskov emphasized that the talks' limited scope meant \"a great many different aspects [of a ceasefire] are still to be worked through.\"\nRAND's Charap credits the Trump administration's efforts in securing the infrastructure and Black Sea ceasefires.\n\"A negotiation seems much more plausible now, even if it's going to be protracted and complex, than it was before [Trump] took office,\" he says. \"The U.S. pressure on the parties to move towards negotiations has produced some results and it started a process.\"\nApril\nOn April 19, Russia announces a 30-hour Easter truce, which Ukraine accepts. A wary Zelenskyy says on the Telegram communication app: \"If a full ceasefire truly takes hold, Ukraine proposes extending it beyond Easter Day on April 20.\"\nHowever, both sides accuse each other of violating the truce.\nDays later, the U.S. proposes a peace plan that would freeze the frontlines and recognize Russian control over territories already seized in Ukraine. Kyiv would forgo NATO membership — meeting a key Kremlin demand. Both sides reject the plan, with Sergey Ryabkov, a Putin foreign policy adviser, saying \"we can't accept it all in its current form\" and Zelenskyy insisting that Ukraine will never recognize Moscow's control over Crimea. \"There's nothing to talk about here,\" Zelenskyy said.\nTrump took to the Truth Social platform to fire back, criticizing Zelenskyy's \"inflammatory statements\" that would \"prolong the 'killing field.'\"\nBut Trump — who has frequently boasted about his friendship with Putin — also expressed exasperation with Russia's continued airstrikes on Kyiv. Posting on Truth Social, Trump wrote: \"I am not happy with the Russian strikes on KYIV. Not necessary, and very bad timing. Vladimir, STOP! 5000 soldiers a week are dying,\" adding, \"Lets get the Peace Deal DONE!\"\nMay\nIn what could mark a pivotal moment in the negotiations, Russian and Ukrainian officials meet face-to-face in Istanbul on May 16 — their first direct talks since the invasion began. Facilitated by Turkey, the meeting resulted in a prisoner exchange, with over 1,000 detainees released by each side. However, beyond the swap, the discussions yielded little progress.\nThe Kremlin's planned talks in Istanbul on Monday are intended as a follow-up. However, despite this limited diplomatic progress, the fighting on the ground continues unabated.\nOn May 25, Russian forces launched a massive drone and missile strike on Ukraine — the largest attack of its kind since the war began.\nTrump expressed dismay at Russia's actions, reiterating that he is \"not happy\" with Putin defying efforts to secure a ceasefire. Speaking to reporters about the attack, Trump said: \"I don't know what the hell happened to Putin.\"\n\"I've known him a long time, always gotten along with him, but he's sending rockets into cities and killing people, and I don't like it at all,\" the president said. Asked if he'd consider further sanctions on Russia, he replied \"absolutely.\"\nAhead of the proposed round two talks in Istanbul, which Ukraine said it was ready to attend, Zelenskyy also accused Russia of engaging in \"yet another deception\" by not handing over its proposed peace settlement ahead of the meeting.\nJones, of CSIS, says there are possible paths forward in negotiations, but they would require difficult concessions from Ukraine — concessions Zelenskyy has so far firmly rejected. According to Jones, Kyiv \"could agree not to pursue NATO membership ... and not [to attempt] to reclaim territory currently held by Russian forces.\""
    },
    {
      "url": "https://www.bbc.com/news/articles/c78mmj97ygmo",
      "text": "Colombian Senator Miguel Uribe dies two months after being shot\nColombian senator and presidential hopeful Miguel Uribe has died two months after being shot in the head in a targeted attack which shocked the South American nation.\nThe 39-year-old was hit by three bullets - two of them in the head and one in the leg - at a campaign rally on 7 June in the capital, Bogotá.\nHis wife confirmed his death on social media, paying tribute to \"the love of my life\".\nA teenager has been arrested on suspicion of carrying out the shooting, but the motive behind the attack is still unclear.\nUribe's wife, María Claudia Tarazona, thanked her late husband for \"a life full of love\" and for being \"the best father\" for their children.\nAccording to a statement published on Saturday by the hospital where Uribe was being treated, the senator had suffered a bleed to his central nervous system and was due to undergo surgery.\nHe had already had several surgeries since he was first taken to the Santa Fe clinic in June.\nHis wife had asked people to pray for his recovery and thousands had turned out at vigils and rallies to show their support.\nUribe, who had been a senator since 2022, had been seeking his party's nomination for the 2026 presidential election.\nHe was popular in the polls and recognised as an up-and-coming figure in the right-wing Democratic Centre party, known for his outspoken criticism of the current left-wing president, Gustavo Petro.\nPresident Petro's office released a statement expressing its condolences to the family of the slain politician.\nUribe was attending a political event in a middle-class neighbourhood of the capital when he was shot.\nA teenage suspect was arrested as he was fleeing the scene. The 15-year-old has been charged with attempted murder and pleaded not guilty.\nSeveral others have been detained on suspicion of aiding the gunman.\nThe brazen attack on the senator has brought back memories of the turbulent decades of the 1980s and 90s in Colombia, when several presidential candidates and influential Colombian figures were assassinated.\nUribe's own mother, journalist Diana Turbay, was kidnapped by Los Extraditables in 1990 - an alliance created by leading drug lords.\nShe was held hostage by them for five months before being shot dead during a botched rescue attempt.\nUribe often cited her as his inspiration to run for political office \"to work for our country\".\nLos Extraditables, who said they would prefer a grave in Colombia to a prison cell in the US, abducted and attacked renowned Colombians in an attempt to force the government at the time to overturn its extradition treaty with the US.\nIn recent decades, Colombia's security indicators have substantially improved, and in 2016 a historic peace agreement was reached between the government and the leftist guerrilla group, Farc.\nIn 2024, Colombia recorded a murder rate of 25.4 per 100,000 inhabitants, the lowest in the past four years, according to security research group Insight Crime.\nIn 1990, the homicide rate exceeded 70 per 100,000 inhabitants.\nHowever, Colombia's murder rate remains among the highest in the region, alongside those Ecuador, Brazil, and Honduras.\nPoliticians, members of the security forces, union leaders, environmentalists, and social leaders frequently face death threats, pressure, and attacks.\nVarious armed groups are engaged in a bloody territorial disputes in the country, often also clashing with the security forces.\nLaura Bonilla, deputy director of the Peace and Reconciliation Foundation in Colombia (Pares), said that \"the political outlook will now depend on who manages to capitalize on the narrative of security\".\nMs Bonilla told BBC News Mundo that the situation in the wake of Senator Uribe's killing was likely to give more prominence to right-wing politicians and their rhetoric.\nVice-President Francia Márquez urged Colombians to unite and reject all violent acts, telling them that \"violence cannot continue to mark our democracy\".\n\"Democracy is not built with bullets or blood; it is built with respect, dialogue and recognizing our differences, regardless of political position.\"\nUribe's death also made waves beyond Colombia with US Secretary of State Marco Rubio among the first to post following the announcement of his death to demand that those responsible be brought to justice."
    },
    {
      "url": "https://www.npr.org/2025/08/11/g-s1-82010/trump-putin-alaska-ukraine",
      "text": "Trump says he will 'feel out' Putin in Alaska on ending the war in Ukraine\nPresident Trump said on Monday that he plans to use a Friday summit in Alaska to gauge whether Russian President Vladimir Putin is ready to end his war on Ukraine — and said he'd been disappointed in the past with Putin's actions.\n\"This is really a feel-out meeting, a little bit,\" Trump told reporters, predicting he would know \"probably in the first two minutes\" whether a deal would be possible.\n\"I may say, 'Lots of luck, keep fighting.' Or I may say, 'We can make a deal,'\" Trump said.\nTrump has long pledged to use his relationship with Putin to broker an end to the war, now in its fourth year.\nBut Ukrainian President Volodymyr Zelenskyy and European allies are concerned that Putin will press to take over large swaths of Ukrainian sovereign territory. Trump confirmed that he believes there will be \"some land-swapping\" involved in any potential deal.\n\"Russia has occupied a big portion of Ukraine. They've occupied some very prime territory. We're going to try and get some of that territory back for Ukraine,\" Trump said on Monday.\nEuropean leaders are calling on Trump to consult closely with Zelenskyy ahead of the meeting. Trump said he would talk with the Ukrainian president and European allies both before and immediately after the summit.\n\"I'm talking to the European leaders. I'll be talking to President Zelenskyy. I'm going to get everybody's ideas. I go into that thing fully loaded right up there — and we're going to see what happens,\" he said.\nThe upcoming meeting is the first time Trump and Putin have met face-to-face since 2019. He said the next step should be for Zelenskyy and Putin to meet in person. \"I'll be there if they need, but I want to have a meeting set up between the two leaders.\""
    },
    {
      "url": "https://www.npr.org/2025/08/11/nx-s1-5496335/trump-immigration-workers-parole-tps",
      "text": "Factories from GE to Kraft Heinz lose immigrant workers, stressing those who remain\nAn employer that has welcomed immigrants loses workers as policies change\nLOUISVILLE, Ky. — Jaelin Carpenter was stressed. Four people on her team of 26 at GE Appliances had learned that their immigration status had changed.\nUnder former President Biden, they'd been allowed to stay and work in the U.S. for two years, protected by a program set up to help people fleeing humanitarian crises back home. But the Trump administration abruptly canceled that program, revoking their legal status and their authorization to work. Carpenter fielded call after call from her panicked co-workers.\n\"They were calling me asking me if they're on the run. 'Does this mean I'm getting deported today?'\" she recalls them asking.\nAs a team leader on a washing machine line and a union shop steward for IUE-CWA Local 83761, Carpenter was used to fielding all kinds of questions at work. But she wasn't prepared for this.\nHer co-workers were desperate for answers. Carpenter had none. That tore her down, she says.\nCarpenter says the four team members were doing some of the most difficult tasks on the line, installing the hoses on the washers as well as affixing the platforms that hold the motors.\n\"These are people who are on critical jobs,\" she says.\nAnd suddenly, they were gone.\nSudden departures leave companies with holes\nIn recent months, immigrants working in manufacturing, food production and other industries have lost their jobs due to President Trump's immigration policies — not as a result of immigration raids, but because Trump ended Biden-era programs that had provided them temporary permission to remain in the U.S. and get jobs.\nThose affected include more than a half-million immigrants from Cuba, Haiti, Nicaragua and Venezuela who had been granted humanitarian parole for two years through a program known as CHNV — an acronym for the countries it covered. The changes also affect close to 1 million immigrants who were allowed into the U.S. after securing appointments at the U.S.-Mexico border via a U.S. government app.\nThose programs were part of Biden's efforts to create a safe, orderly process at the border for those fleeing war, violence or political unrest. The Trump administration says they achieved the opposite.\n\"Programs like CHNV were abused to admit hundreds of thousands of poorly vetted illegal aliens. It was exploited by bad actors, undercut American workers, and encouraged more illegal immigration,\" wrote White House spokesperson Abigail Jackson in a statement.\nTrump's cancellation of those programs has been challenged in court, delaying his efforts to get people to leave immediately. Also facing legal challenges is Trump's cancellation of temporary protected status for people from a number of countries. Those protections, in some cases granted decades ago, were aimed at providing temporary relief for people escaping unsafe conditions due to war or environmental disasters. The Trump administration argues that those conditions have long passed, despite ongoing violence and instability in some places.\nEven with the legal battles still unfolding, the reversal in immigration policies has left employers with holes to fill as they've scrambled to remove from their payrolls those no longer authorized to work or even stay in the U.S.\n\"This is a new area for us. We've certainly consulted with other people just to understand — what does this mean? How are we supposed to do this?\" says Julie Wood, head of corporate communications for GE Appliances. To date, Wood says the company has seen 148 employees lose their eligibility to work.\nWood says the departures have not caused a major disruption at the plant, which employs some 5,000 production workers across five buildings. The company always keeps replacement workers on hand to fill in for absences, and Wood says they've added to that pool during the current uncertainty.\nStill, the sudden exits are felt deeply in some parts of the appliance park. For Carpenter, training new people has been taxing. She worries mistakes will be made. She's uneasy, wondering who's going to be on the job on any given day.\n\"I can't control it,\" she says. \"Nothing I can do about it.\"\nA vow to protect American jobs\nDuring the presidential campaign last fall, Trump warned American workers that Biden's immigration policies had cost them.\n\"What's going on with African American workers and with Hispanic in particular — just taking your jobs. They're taking your jobs. Every job produced in this country over the last two years has gone to illegal aliens,\" Trump told a crowd in Wilmington, N.C., last September. \"What we're doing to this country is so sad.\"\nBut Tom Torres doesn't see things that way.\nA mechanic for Kraft Heinz in Holland, Mich., Torres says immigrants have long played key roles at the plant, which is best known for making pickles. Born in Michigan to Mexican farmworkers and raised in Texas, Torres grew up making the annual summer migration from Texas to Michigan to pick berries and other crops. He sees in his immigrant co-workers the same work ethic he saw in his parents.\n\"Whatever you give them, they'll do,\" he says, whether it's dumping bottles, sweeping the floors or sorting pickles, hunched over the conveyor all day. \"No complaints.\"\nUnder Trump, some of Torres' co-workers are now gone, stripped of their authorization to work.\nKraft Heinz says six employees have been affected by Trump's immigration policies. The Retail, Wholesale and Department Store Union, which represents about 270 employees at the plant in Holland, believes it's more.\nTorres, who serves as the local union president, says he's sat in on more than a dozen human resources meetings where employees have been told they're no longer eligible to work. He's watched people in the company struggle to deliver the message.\n\"Just tears in their eyes,\" he says, adding that it's been difficult for him, too. \"It's killing me, because I'm watching them walk out. I know these people because I work with them every day.\"\nChamber of commerce calls for more immigration\nEven as companies like Kraft Heinz and GE Appliances maintain they are adequately staffed for now, there are growing concerns across the broader business community that Trump's immigration policies could create problems in the not-too-distant future.\nGreater Louisville Inc., the regional chamber of commerce, has long advocated for more immigration, not less.\n\"In today's exceptionally tight labor market, decreased legal immigration has contributed to stifling our economy,\" the chamber states in its 2025 Federal Agenda. \"American businesses are experiencing significant workforce shortages despite investments in expanding domestic pipelines.\"\nShelby Somervell, senior vice president of government affairs for Greater Louisville Inc., was part of a delegation that traveled to Washington, D.C., this summer to lobby for an expansion of legal immigration, among other issues.\n\"The workforce participation rate in Kentucky is lower,\" Somervell says. \"Any way that we can fill those jobs legally is what we want to do.\"\nFilling at least some of them with immigrants appears necessary, given Louisville's changing demographics. Domestic migration to the region has been down, while international migration is on the rise.\n\"Louisville metro itself would have lost population last year without international migration,\" says Sarah Ehresman, director of labor market intelligence at the workforce development board known as KentuckianaWorks.\nShe notes that some 10,000 Cubans and Haitians settled in the area in the last fiscal year alone. \"So it's definitely an important part of the city's population growth, and as a result, its workforce,\" she says.\nEhresman says manufacturers in particular are going to need workers because of their aging workforce. More than a quarter of the sector's workers are 55 and older.\nMeanwhile, GE Appliances recently announced two new production lines. They'll need another 800 workers by the year 2027 to build a new front-loading washer and a washer-dryer combo.\nBefore then, though, the company could lose more workers. Trump has canceled temporary protected status for people from Afghanistan, Venezuela, Honduras, Nicaragua, Haiti and other countries. Although there are legal challenges pending in court, TPS protections have expired or will expire in coming months unless Trump changes his mind and extends them.\nMichel Ange Lucas, who builds refrigerators for GE Appliances, says the current Feb. 3 expiration date for TPS for Haitians will leave big gaps at the plant, given how many Haitians work there.\n\"From Building 1 to Building 5, it's a lot of us,\" says Lucas, who is of Haitian descent but is not a TPS holder.\nHe thinks for people who had the government's permission to stay and work in the U.S., what's happening now is unfair.\n\"The people is not illegal,\" Lucas says. \"Politics made them illegal. But they was never illegal.\""
    },
    {
      "url": "https://www.bbc.com/news/articles/c4g034yx4gjo",
      "text": "British man who perished in Antarctic glacier found 65 years later\nThe bones of a British man who died in a terrible accident in Antarctica in 1959 have been discovered in a melting glacier.\nThe remains were found in January by a Polish Antarctic expedition, alongside a wristwatch, a radio, and a pipe.\nHe has now been formally identified as Dennis \"Tink\" Bell, who fell into a crevasse aged 25 when working for the organisation that became the British Antarctic Survey.\n\"I had long given up on finding my brother. It is just remarkable, astonishing. I can't get over it,\" David Bell, 86, tells BBC News.\n\"Dennis was one of the many brave personnel who contributed to the early science and exploration of Antarctica under extraordinarily harsh conditions,\" says Professor Dame Jane Francis, director of the British Antarctic Survey .\n\"Even though he was lost in 1959, his memory lived on among colleagues and in the legacy of polar research,\" she adds.\nIt was David who answered the door in his family home in Harrow, London, in July 1959.\n\"The telegram boy said, 'I'm sorry to tell you, but this is bad news',\" he says. He went upstairs to tell his parents.\n\"It was a horrendous moment,\" he adds.\nTalking to me from his home in Australia and sitting next to his wife Yvonne, David smiles as stories from his childhood in 1940s England spill out.\nThey are the memories of a younger sibling admiring a charming, adventurous big brother.\n\"Dennis was fantastic company. He was very amusing. The life and soul of wherever he happened to be,\" David says.\n\"I still can't get over this, but one evening when me, my mother and father came home from the cinema,\" he says.\n\"And I have to say this in fairness to Dennis, he had put a newspaper down on the kitchen table, but on top of it, he'd taken a motorbike engine apart and it was all over the table,\" he says.\n\"I can remember his style of dress, he always used to wear duffel coats. He was just an average sort of fellow who enjoyed life,\" he adds.\nDennis Bell, nickednamed \"Tink\", was born in 1934. He worked with the RAF and trained as a meteorologist, before joining the Falkland Islands Dependencies Survey to work in Antarctica.\n\"He was obsessed with Scott's diaries,\" David says, referring to Captain Robert Scott who was one of the first men to reach the South Pole and died on an expedition in 1912.\nDennis went to Antarctica in 1958. He was stationed for a two-year assignment at Admiralty Bay, a small UK base with about 12 men on King George Island, which is roughly 120 kilometres (75 miles) off the northern coast of the Antarctic Peninsula.\nThe British Antarctic Survey keeps meticulous records and its archivist Ieuan Hopkins has dug out detailed base camp reports about Dennis's work and antics on the harsh and \"ridiculously isolated\" island.\nReading aloud, Mr Hopkins says: \"He's cheerful and industrious, with a mischievous sense of humour and fondness for practical jokes.\"\nDennis's job was to send up meteorological weather balloons and radio the reports to the UK every three hours, which involved firing up a generator in sub-zero conditions.\nDescribed as the best cook in the hut, he was in charge of the food store over the winter when no supplies could reach them.\nAntarctica felt even more cut off than it is today, with extremely limited contact with home. David recalls recording a Christmas message at BBC studios with his parents and sister Valerie to be sent to his brother.\nHe was best known for his love of the husky dogs used to pull sledges around the island, and he raised two litters of dogs.\nHe was also involved in surveying King George Island to produce some of the first mapping of the largely unexplored place.\nIt was on a surveying trip that the accident happened, a few weeks after his 25th birthday.\nOn 26 July 1959, in the deep Antarctic winter, Dennis and a man called Jeff Stokes left the base to climb and survey a glacier.\nAccounts in the British Antarctic Survey records explain what happened next and the desperate attempts to rescue him.\nThe snow was deep and the dogs had started to show signs of tiredness. Dennis went on ahead alone to encourage them, but he wasn't wearing his skis. Suddenly he disappeared into a crevasse, leaving a hole behind him.\nAccording to the accounts, Jeff Stokes called into the depths and Dennis was able to shout back. He grabbed onto a rope that was lowered down. The dogs pulled on the rope and Dennis was hitched up to the lip of the hole.\nBut he had tied the rope onto his belt, perhaps because of the angle he lay in. As he reached the lip, the belt broke and he fell again. His friend called again, but this time Dennis didn't reply.\n\"That's a story I shall never get over,\" says David.\nThe base camp reports about the accident are business-like.\n\"We heard from Jeff […] that yesterday Tink fell down a crevasse and was killed. We hope to return tomorrow, sea ice permitting,\" it continues.\nMr Hopkins explains that another man, called Alan Sharman, had died weeks earlier, and the morale was very low.\n\"The sledge has got back. We heard the sad details. Jeff has badly bitten frostbitten hands. We are not taking any more risks to recover,\" the report reads the day after the accident.\nReading the reports again, Mr Hopkins discovered that earlier in the season, it had been Dennis who'd made the coffin for Alan Sharman.\n\"My mother never really got over it. She couldn't handle photographs of him and couldn't talk about him,\" David says.\nHe recalls that two men on Dennis's base visited the family, bringing a sheepskin as a gesture.\n\"But there was no conclusion. There was no service; there was no anything. Just Dennis gone,\" David says.\nAbout 15 years ago, David was contacted by Rod Rhys Jones, chair of the British Antarctic Monument Trust.\nSince 1944, 29 people have died working on British Antarctic Territory on scientific missions, according to the trust.\nRod was organising a voyage for relatives of some of the 29 to see the spectacular and remote place where their loved ones had lived and died.\nDavid joined the expedition, called South 2015.\n\"The captain stopped at the locations and give four or five hoots of the siren,\" he says.\nThe sea-ice was too thick for David to reach his brother's hut on King George Island.\n\"But it was very, very moving. It lifted the pressure, a weight off my head, as it were,\" he says.\nIt gave him a sense of closure.\n\"And I thought that would be it,\" he says.\nBut on 29 January this year, a team of Polish researchers working from the Henryk Arctowski Polish Antarctic Station stumbled across something practically on their doorstep.\nDennis had been found.\nSome bones were in the loose ice and rocks deposited at the foot of Ecology Glacier on King George Island. Others were found on the glacier surface.\nThe scientists explain that fresh snowfall was imminent, and they put down a GPS marker so their \"fellow polar colleague\" would not be lost again.\nA team of scientists made up of Piotr Kittel, Paulina Borówka and Artur Ginter at University of Lodz, Dariusz Puczko at the Polish Academy of Sciences and fellow researcher Artur Adamek carefully rescued the remains in four trips.\nIt is a dangerous and unstable place, \"criss-crossed with crevasses\", and with slopes of up to 45 degrees, according to the Polish team.\nClimate change is causing dramatic changes to many Antarctic glaciers, including Ecology Glacier, which is undergoing intense melting.\n\"The place where Dennis was found is not the same as the place where he went missing,\" the team explains.\n\"Glaciers, under the influence of gravity, move their mass of ice, and with it, Dennis made his journey,\" they say.\nFragments of bamboo ski poles, remains of an oil lamp, glass containers for cosmetics, and fragments from military tents were also collected.\n\"Every effort was made to ensure that Dennis could return home,\" the team say.\n\"It's an opportunity to reassess the contribution these men made, and an opportunity to promote science and what we've done in the Antarctic over many decades,\" adds Rod Rhys Jones.\nDavid still seems overwhelmed by the news, and repeats how grateful he is to the Polish scientists.\n\"I'm just sad my parents never got to see this day,\" he says.\nDavid will soon visit England where he and his sister, Valerie, plan to finally put Dennis to rest.\n\"It's wonderful; I'm going to meet my brother. You might say we shouldn't be thrilled, but we are. He's been found - he's come home now.\""
    },
    {
      "url": "https://www.dw.com/en/mexico-hurricane-erick-weakens-as-residents-clear-debris/a-72978989",
      "text": "Mexico: Hurricane Erick weakens as residents clear debris\nJune 20, 2025Erick made landfall in Mexico's southern state of Oaxaca as a Category 3 hurricane early Thursday, having been downgraded from a Category 4 shortly beforehand.\nIt hit with wind speeds of up to 205 kph (around 130 mph), however, by midafternoon, after moving inland, Erick weakened to a tropical storm, with sustained winds weakening to 85 kph.\nOfficials cautioned that Erick's intense rains remained dangerous.\nThe US National Hurricane Center has warned that life-threatening flooding and mudslides are likely, particularly in areas with steep terrain.\nThey have predicted that Guerrero state could receive up to 8 inches (20 centimeters) of rain, while its neighboring states, Oaxaca and Michoacan, could expect up to 4 inches.\nErick leaves some damage, but no deaths\nAfter the hurricane made landfall, Mexican President Claudia Sheinbaum said, \"The people have reacted very well so far.\"\nAccording to reports, Erick left flooded streets and damaged boats and buildings in Oaxaca, but residents of the coastal towns have started cleaning up the debris.\nAt a press conference, Laura Velazquez, the head of Mexico's civil protection agency, said there were no immediate reports of deaths.\nShe added that two hospitals had been damaged and that the power supply had been compromised.\nMeanwhile, the state-owned utility company CFE reported that more than 123,000 users in Oaxaca had lost power and that service had been restored to 26% of them by late morning.\nOaxaca Governor Salomon Jara said that roads and highways had been significantly damaged.\nEdited by: Alex Berry"
    },
    {
      "url": "https://www.wired.com/story/ice-palantir-immigrationos/",
      "text": "Immigration and Customs Enforcement is paying software company Palantir $30 million to provide the agency with “near real-time visibility” on people self-deporting from the United States, according to a contract justification published in a federal register on Thursday. The tool would also help ICE choose who to deport, giving special priority to “visa overstays,” the document shows.\nPalantir has been an ICE contractor since 2011, but the document published Thursday indicates that Palantir wants to provide brand-new capabilities to ICE. The agency currently does not have any publicly known tools for tracking self-deportation in near real-time. The agency does have a tool for tracking self-reported deportations, but Thursday’s document, which was first reported by Business Insider, does not say to what degree this new tool may rely on self-reported data. ICE also has “insufficient technology” to detect people overstaying their visas, according to the Department of Homeland Security. This is particularly due to challenges in collecting \"biographic and biometric\" data from departing travelers, especially if they leave over land, according to Customs and Border Protection.\nThe agency says in the document that these new capabilities will be under a wholly new platform called the Immigration Lifecycle Operating System, or ImmigrationOS. Palantir is expected to provide a prototype of ImmigrationOS by September 25, 2025, and the contract is scheduled to last at least through September 2027. ICE’s update to the contract comes as the Trump administration is demanding that thousands of immigrants “self-deport,” or leave the US voluntarily.\nICE and Palantir did not respond for comment.\nAccording to the document, ImmigrationOS is intended to have three core functions. Its “Targeting and Enforcement Prioritization” capability would streamline the “selection and apprehension operations of illegal aliens.” People prioritized for removal, ICE says, should be “violent criminals,” gang members, and “visa overstays.”\nIts “Self-Deportation Tracking” function would have “near real-time visibility into instances of self-deporation,” the document says. The document does not say what data Palantir would use for such a system, but ICE says it aims to “accurately report metrics of alien departures from the United States.” The agency stipulates that this tool should also integrate with “enforcement prioritization systems to inform policy” but does not elaborate on these systems or policies.\nMeanwhile, the “Immigration Lifecycle Process” function would streamline the “identification” of aliens and their “removal” from the United States, with the goal of making \"deportation logistics” more efficient.\nIn a “rationale” section, ICE claims that it has an “urgent and compelling” need for ImmigrationOS’s capabilities. Without them, ICE claims, it would be “severely” limited in its ability to target the gangs MS-13 and Tren de Aragua, and abide by President Donald Trump’s executive order to expedite deportations.\nPalantir, ICE claims, is “the only source that can provide the required capabilities and prototype of ImmogrationOS [sic] without causing unacceptable delays.” ICE says the company has developed “deep institutional knowledge of the agency’s operations over more than a decade of support.”\n“No other vendor could meet these timeframes of having the infrastructure in place to meet this urgent requirement and deliver a prototype in less than six months,” ICE says in the document.\nICE’s document does not specify the data sources Palantir would pull from to power ImmigrationOS. However, it says that Palantir could “configure” the case management system that it has provided to ICE since 2014.\nPalantir has done work at various other government agencies as early as 2007. Aside from ICE, it has worked with the US Army, Air Force, Navy, Internal Revenue Service, and Federal Bureau of Investigation. As reported by WIRED, Palantir is currently helping Elon Musk’s so-called Department of Government Efficiency (DOGE) build a brand-new “mega API” at the IRS that could search for records across all the different databases that the agency maintains.\nLast week, 404 Media reported that a recent version of Palantir’s case-management system for ICE allows agents to search for people based on “hundreds of different, highly specific categories,” including how a person entered the country, their current legal status, and their country of origin. It also includes a person’s hair and eye color, whether they have scars or tattoos, and their license-plate reader data, which would provide detailed location data about where that person travels by car.\nThese functionalities have been mentioned in a government privacy assessment published in 2016, and it’s not clear what new information may have been integrated into the case management system over the past four years.\nThis week’s $30 million award is an addition to an existing Palantir contract penned in 2022, originally worth about $17 million, for work on ICE’s case management system. The agency has increased the value of the contract five times prior to this month; the largest was a $19 million increase in September 2023.\nThe contract’s ImmigrationOS update was first documented on April 11 in a government-run database tracking federal spending. The entry had a 248-character description of the change. The five-page document ICE published Thursday, meanwhile, has a more detailed description of Palantir’s expected services for the agency.\nThe contract update comes as the Trump administration deputizes ICE and other government agencies to drastically escalate the tactics and scale of deportations from the US. In recent weeks, immigration authorities have arrested and detained people with student visas and green cards, and deported at least 238 people to a brutal megaprison in El Salvador, some of whom have not been able to speak with a lawyer or have due process.\nAs part of its efforts to push people to self-deport, DHS in late March revoked the temporary parole of more than half a million people and demanded that they self-deport in about a month, despite having been granted authorization to live in the US after fleeing dangerous or unstable situations in Cuba, Haiti, Nicaragua, and Venezuela under the so-called “CHNV parole programs.”\nLast week, the Social Security Administration listed more than 6,000 of these people as dead, a tactic meant to end their financial lives. DHS, meanwhile, sent emails to an unknown number of people declaring that their parole had been revoked and demanding that they self-deport. Several US citizens, including immigration attorneys, received the email.\nOn Monday, a federal judge temporarily blocked the Trump administration’s move to revoke people’s authorization to live in the US under the CHNV programs. White House spokesperson Karoline Leavitt called the judge’s ruling “rogue.”"
    },
    {
      "url": "https://www.aljazeera.com/features/2025/8/11/israel-kills-anasal-sharif-and-four-al-jazeera-in-gaza-what-to-know",
      "text": "Israel kills Anas al-Sharif and four Al Jazeera staff in Gaza: What we know\nIsrael deliberately attacked the tent the journalists were working out of, at the gates of al-Shifa Hospital.\nLate on Sunday, an Israeli strike shook al-Shifa Hospital in Gaza City, targeting a journalists’ tent by the gate.\nAs people rushed to help, it became apparent that five Al Jazeera staff had been killed, including Anas al-Sharif, one of the most famous faces of Arabic reporting from Gaza.\nRecommended Stories\nlist of 3 itemsAustralia to recognise Palestinian statehood; New Zealand may follow\nIsrael is occupying Gaza to clean up the crime scene\nWhy did Israel want to kill journalists? What happened that night? Here’s what we know:\nWho were the five Al Jazeera staff Israel killed?\nAl Jazeera correspondent Anas al-Sharif, 28, was one of Gaza’s most recognisable faces for his constant reporting of the reality on the ground over the last 22 months. The father of two was born in Jabalia refugee camp and graduated from Al-Aqsa University’s Faculty of Media. His father was killed by Israel in an air strike on the family home in December 2023.\nAl Jazeera correspondent Mohammed Qreiqeh, 33, made his last live report on air only shortly before his assassination, speaking in his trademark eloquent manner. Qreiqeh was born in Gaza City in 1992 and lived in the Shujayea neighbourhood. He earned a BA in journalism and media at the Islamic University of Gaza. Israel killed his brother, Karim, in March in an air attack on Gaza City.\nAl Jazeera cameraman Ibrahim Zaher, 25, was from Jabalia refugee camp in northern Gaza.\nAl Jazeera cameraman Mohammed Noufal, 29, was also from Jabalia. He lost his mother and one brother in earlier Israeli attacks. His other brother, Ibrahim, also works as a cameraman for Al Jazeera.\nWhat were they doing when they were killed?\nThey were working.\nThe team was in a tent by the main gate of Gaza City’s al-Shifa Hospital late on Sunday evening.\nThe tent was where they worked, as journalists in Gaza have gathered at hospitals to seek better electricity and internet connections, a fact that has been well-known since the start of Israel’s war on Gaza.\n“I’m not far from al-Shifa Hospital, just one block away, and I could hear the massive explosion that took place in the past half an hour or so, near al-Shifa Hospital,” Al Jazeera’s Hani Mahmoud reported yesterday.\n“I could see it when it lit up the sky and, within moments, the news circulated that it was the journalist camp at the main gate of the al-Shifa Hospital.”\nWhat happened?\nAl Jazeera’s reporter Hani al-Shaer said an Israeli drone hit the journalists’ tent at approximately 11:35pm (20:35 GMT) on Sunday night.\nShortly before being killed, al-Sharif wrote on X that Israel had launched intense, concentrated bombardment – also known as “fire belts” – on the eastern and southern parts of Gaza City.\nJournalist Amer al-Sultan was in a neighbouring tent when the attack took place.\n“I came to the scene and saw all the destruction,” al-Sultan told Al Jazeera Mubasher, standing amid the tent’s wreckage, his back to a concrete wall pocked and splattered from the attack. “[I thought] all our colleagues were martyred.”\nAl-Sultan added that he wasn’t sure who the journalists were who were in the tent, but “when I started filming, I saw our colleagues Anas al-Sharif was on the ground and Mohammed Qreiqeh, who was on fire.\n“We started to pull him out and try to put out the fire.”\nThe people gathered there tried to get Qreiqeh inside al-Shifa Hospital, but he succumbed to his wounds before they could get him treatment, al-Sultan said.\nMohammed Qeita, a freelance journalist, was also nearby.\n“I was not just a witness to the event, I was part of it…The fire was very strong.\n“Even now, I can’t believe it,” he said.\n“We knew Anas was the target… He was our voice.”\nHow did Israel explain deliberately killing journalists?\nIt said one of them wasn’t really a journalist.\nIsrael’s army posted about deliberately killing the journalists, claiming it had wanted to kill al-Sharif, who it accused of being an armed commander for Hamas only posing as a journalist.\nIn the statement, it accused al-Sharif of “advancing rocket attacks against Israeli civilians and troops” and alleged it had documents providing “unequivocal proof” of this.\nMuhammad Shehada, an analyst at the European Council on Foreign Relations, said there was “zero evidence” that al-Sharif took part in any hostilities.\n“His entire daily routine was standing in front of a camera from morning to evening,” he told Al Jazeera.\nOn numerous occasions over the last 22 months, Israel has justified killing reporters by claiming they belonged to armed groups. Groups focused on press freedom and media workers’ rights have said for months that Israel is deliberately targeting journalists in Gaza.\nTwo of the most prominent incidents included journalist Hamza Dahdouh, son of Al Jazeera’s Gaza Bureau Chief Wael Dahdouh, and journalist Hossam Shabat, who were both assassinated by Israel and accused of being members of Hamas without any evidence.\nWhat did Al Jazeera say?\nAl Jazeera called the killing of its staff a “targeted assassination … in yet another blatant and premeditated attack on press freedom”.\nIt said the journalists “were among the last remaining voices from within Gaza, providing the world with unfiltered, on-the-ground coverage of the devastating realities endured by its people”.\nIsrael has banned international media from entering Gaza since October 2023, but “Al Jazeera journalists remained within besieged Gaza … [delivering] searing eyewitness accounts of the horrors unleashed over 22 months of relentless bombing and destruction,” the statement said.\nWhy did Israel want to assassinate Anas al-Sharif?\nAl-Sharif was the face of Al Jazeera Arabic in Gaza and of iconic moments as he reported on Israel’s atrocities in the besieged, bombarded enclave.\nFor months, Israeli officials had threatened him, demanding that he stop reporting, but he refused, pledging to stay in northern Gaza and continue his coverage.\nNumerous rights groups and press freedom groups called for al-Sharif’s protection after he was directly threatened by Israel.\nIsrael ramped up a smear campaign on al-Sharif in recent months, with army spokesperson Avichay Adraee calling out al-Sharif by name in a video on X last month, accusing him of being part of Hamas’s military wing.\nIrene Khan, UN special rapporteur on freedom of expression, said last month that Adraee made “an unsubstantiated claim” and called the smear a “blatant assault on journalists”.\nIsrael killing al-Sharif was a targeted attempt to shut down coverage of its atrocities, former Executive Director of Human Rights Watch Ken Roth said.\n“This is not an accidental killing. This is not a journalist who happened to get caught in Israel’s indiscriminate bombardment of Palestinian civilians in general.\n“This was a targeted killing,” Roth told Al Jazeera.\nAuthorities in Gaza say Israel has killed nearly 270 journalists and media workers since it launched its war on Gaza."
    },
    {
      "url": "https://www.dw.com/en/india-rahul-gandhi-among-detainees-in-electoral-protests/a-73605041",
      "text": "India: Rahul Gandhi among detainees in electoral protests\nAugust 11, 2025Indian opposition leader Rahul Gandhi was among dozens of lawmakers temporarily detained by police in New Delhi on Monday following a protest against perceived electoral malpractice.\nAround 300 opposition parliamentarians, including Gandhi, marched towards the Election Commission headquarters, jumping barricades and shouting that recent elections had been \"stolen.\"\nThey claim that electoral rolls in key states have been altered to the benefit of Prime Minister Narendra Modi's ruling Hindu nationalist Bharatiya Janata Party (BJP), with more to come.\n\"This fight is not political; this fight is to save the constitution,\" Gandhi told reporters as he and others were taken to a nearby police station. \"We want a clean, pure voters' list.\"\nIndia: Does electoral revision risk disenfrachising Muslims?\nMonday's demonstration came after a decision by the Election Commission to carry out a large-scale revision of the electoral roll in the northern state of Bihar, which the opposition say could render millions of citizens unable to vote.\nThe process requires voters to submit official documentation such as birth certificates, passports and matriculation records, which critics say could be hard to come by for many in Bihar, one of the poorest parts of India where literacy rates are among the lowest in the country.\nBihar is also home to a significant Muslim minority (around 17.7% according to the 2023 census) who opposition lawmakers fear could be particularly disenfranchised ahead of state elections later this year.\nA similar exercise in the northeastern state of Assam in 2019 left nearly two million people – many of them Muslims – at risk of statelessness.\nModi's BJP backs electoral roll changes\nNevertheless, Prime Minister Modi's BJP has backed the revision, arguing that it is necessary to update new voters and delete the names of those who may have died or moved to other states.\nThe Election Commission said the changes were needed to avoid the \"inclusion of the names of foreign illegal immigrants\" – shorthand in the context of Bihar for undocumented Muslims who may have arrived from neighboring Bangladesh.\nThe BJP said opposition parties were trying to create a \"state of anarchy\" by sowing seeds of doubt about the electoral process. \"They are in a state of bankruptcy because of their continuous losses,\" said federal minister Dharmendra Pradhan.\nEdited by: Wesley Dockery"
    },
    {
      "url": "https://www.aljazeera.com/news/2025/8/11/anas-and-mohammed-journalists-slain-by-israel-remembered-as-role-models",
      "text": "Anas and Mohammed, journalists slain by Israel, remembered as role models\nColleagues pay tribute to assassinated Gaza journalists, vowing to continue their work.\nLate Sunday evening, Israel’s military targeted Al Jazeera Arabic’s Gaza correspondents Anas al-Sharif, Mohammed Qreiqeh and three others, killing them in a drone strike against their media tent at the gate of al-Shifa Hospital in Gaza City.\nThe slain journalists had spent the past 22 months documenting the ongoing conflict and its impact on their community.\nRecommended Stories\nlist of 3 itemsIsrael is occupying Gaza to clean up the crime scene\nFunerals held for Al Jazeera journalists assassinated by Israel in Gaza\nAl-Sharif, 28, and Qreiqeh, 33, are both survived by their wives and a baby boy and a girl.\nQreiqeh, who was an only child, had lost his mother in Gaza in March 2024, when Israeli forces stormed al-Shifa Hospital. He searched for his mother for two weeks, eventually finding her decomposing body on the stairs of the facility.\nWitnesses said she was shot and killed in cold blood.\nDespite the personal grief and excruciating circumstances, both al-Sharif and Qreiqeh continued to document Israel’s war in Gaza, which is increasingly being deemed a genocide by critics worldwide.\nAl-Sharif’s last tweet on X, posted minutes before he was killed, warned that Israel’s latest plan to invade Gaza risked muzzling Palestinian voices in the besieged enclave.\n“If this madness doesn’t end, Gaza will be reduced to ruins, its people’s voices silenced, their faces erased – and history will remember you as a silent witness to a genocide that you chose not to stop,” he posted.\nSacrifice and courage\nLike all Palestinians in Gaza, al-Sharif and Qreiqeh were born and raised under Israeli occupation. For most of their lives, Israel has imposed a full land, sea and air blockade over the enclave, effectively turning it into what human rights groups describe as an open-air prison.\nThe siege affected every aspect of Palestinian life – livelihoods, travel and family connections and compelled al-Sharif and Qreiqeh to dedicate their lives to telling the world about their people’s struggle under Israel’s brutal occupation.\nAl-Sharif studied media studies at Al-Aqsa University in Gaza and was known for his reporting on the Israeli military campaign that began on October 7, 2023, documenting its humanitarian and civilian impacts.\nYaser al-Banna, a Palestinian journalist in Gaza, said that when Israel ordered the entire population of 2.2 million Palestinians to flee south – an act that likely amounts to a war crime – al-Sharif stayed in the north to document the events and actions of the Israeli military.\n“His life was in danger from Israeli strikes [at the time in the north]. But he still went to the scene of every Israeli blast to uncover Israel’s crime, just five minutes after it happened,” al-Banna told Al Jazeera.\nAl-Banna added that he had formed a strong professional relationship with Qreiqeh since last year.\nAt the time, al-Banna was in southern Gaza and Qreiqeh was in the north, and they often traded contacts and exchanged information to better cover the humanitarian impact of Israel’s genocidal war.\n“He never waited a moment to help me or to help anybody,” al-Banna said of Qreiqeh. “My impression of Qreiqeh was that he was always patient and calm.”\nColleagues and friends\nIn October 2024, Israel published unsubstantiated claims that al-Sharif was among six Palestinian journalists affiliated with a Hamas cell, which Al Jazeera has repeatedly denied.\nHuman rights groups, including the Committee to Protect Journalists (CPJ), note that Israel often brands Palestinian journalists as “terrorists” without providing proof.\nFrom then on, al-Sharif knew his life was in danger.\n“All of this is happening because my coverage of the crimes of the Israeli occupation in the Gaza Strip harms them and damages their image in the world. They accuse me of being a terrorist because the occupation wants to assassinate me morally,” he told CPJ in July.\nThe Israeli threats made some in Gaza hesitant to give al-Sharif interviews out of fear that Israel could kill him and everyone around him at any moment.\nStill, most commended his bravery and continued to support him as he reported from the eye of the storm. Al-Banna added that Qreiqeh continued to work with al-Sharif, despite the risks.\nThey knew that they could both die at any time from Israeli bombardment.\n“The relationship between them was very strong,” al-Banna said, acknowledging that most people knew al-Sharif would likely be targeted.\n“Journalists in Gaza became closer to al-Sharif. We accepted that we would all live together and then die together,” al-Banna added.\nCarrying the torch\nSpeaking from Al Jazeera’s studio in Doha, Qatar, their colleague Tamer Almisshal revealed that both al-Sharif and Qreiqeh were mentally and physically exhausted leading up to their deaths.\nThey hardly turned off their phones because Israel was killing so many people, forcing them to report on the extermination of their people every waking moment, he explained.\n“These are journalists. These are role models,” Almisshal said, holding back tears.\n“I’m making a pledge, after the death of Anas: We will continue to spread their message responsibly and with full professionalism,” he added.\nThis is a sentiment shared by journalists across Gaza who are bearing the burden of reporting on Israel’s genocide alone.\nSince October 7, Israel has banned the entry of international reporters and killed nearly 270 journalists and media workers in Gaza.\nSaleh Jafar, 28, is a Palestinian journalist in Gaza who is vowing to keep the memory of his colleagues alive. He said Israel is targeting the media to stop the world from seeing its crimes in Gaza.\n“They can’t silence the rest of us. There are a million more [voices in Gaza] like Anas, and there are a million more [voices] like Mohammed.\n“Our voices and footage will continue to be [broadcast] in the face of [Israeli] terror and threats.”"
    },
    {
      "url": "https://www.wired.com/story/palantir-government-contracting-push/",
      "text": "President Donald Trump’s administration has dramatically expanded its work with Palantir, elevating the company cofounded by Trump ally Peter Thiel as the government’s go-to software developer. Following massive contract terminations for consulting giants and government contractors like Accenture, Booz Allen, and Deloitte, Palantir has emerged ahead. Now the data analytics firm is partnering with those companies—offering them a lifeline while consolidating its own power.\nPalantir has become one of the few winners in the Trump administration’s cost-cutting efforts, receiving more than $113 million in federal spending since the beginning of the year, according to The New York Times. Palantir’s US government revenue has grown by more than $ 370 million compared to this time last year, according to the company’s most recent quarterly earnings report. Before making remarks at last week’s AI Summit in DC, Trump thanked a variety of cabinet secretaries and tech leaders, including Palantir chief technology officer Shyam Sankar. “We buy a lot of things from Palantir,” Trump said. “Are we paying our bills? I think so.”\nInstead of replacing these more traditional contractors, Palantir’s software is becoming the core tool deployed by them in government systems, placing Palantir in a newly central role.\nThe White House itself is thrilled by this partnership: “The Trump Administration has high-standard [sic] when spending American’s hard-earned tax dollars—which is why agencies have partnered with Palantir, a top-tier American company renowned for their longstanding history of innovation, results, and increasing government efficiency,” says White House spokesperson Taylor Rogers.\nPalantir did not immediately respond to requests for comment.\nIn April, WIRED reported that Palantir was working alongside IRS engineers to build what sources called a “mega API,” which would unify all data across the agency. An API, or application programming interface, enables applications and databases to exchange data and possibly compare it against other interoperable datasets. Once completed, this mega API could become the “read center of all IRS systems.” Immigration and Customs Enforcement contracted Palantir for $30 million to track self-deportations in April. The company has also won federal contracts more recently, like a $795 million award from the Pentagon in May to expand its Maven Smart System program. The total contract ceiling for the Army’s Maven program is now $1.3 billion.\nThis growth comes as some of the companies Palantir has chosen to partner with have lost billions in government contract cuts. In April, defense secretary Pete Hegseth announced plans to cut $5.1 billion in IT consulting contracts with companies including Accenture, Booz Allen, and Deloitte. In a memo announcing the cuts, Hegseth said that the Pentagon would be forced to bring more of its IT work in-house.\n“These contracts represent non-essential spending on third party consultants to perform services more efficiently performed by the highly skilled members of our DoD workforce using existing resources,” Hegseth wrote.\nPalantir’s partnerships with these companies vary, but each one makes it easier for Palantir to extend the reach of its software and AI technology across the federal government. With Accenture’s government branch, Palantir will train and certify at least 1,000 Accenture workers on its Foundry software as well as its AI tech, according to an Accenture press release The companies also said that together they could create “a 360-degree view” of government agency budgets, something the so-called Department of Government Efficiency (DOGE) has sought to build and use to review federal spending. (Palantir partnered with Accenture before in 2022, but this is the first partnership to focus on US government clients.)\n“We are teaming up with Accenture Federal Services to accelerate AI across the U.S. Government, working to address federal agencies’ highest-priority operational challenges,” Palantir posted to X last month.\n\"What makes this partnership so uniquely powerful is Accenture’s expertise working with the federal government and our ability to bring commercial capabilities to government solutions, combined with Palantir’s deep experience in government software,\" Julie Sweet, chair and CEO of Accenture, said in a press release. “Together, we will harness the ever-growing power of AI to help the federal government succeed in its critical mission to modernize and reinvent its operations—with stronger data flows, transparency and resilience—to better serve warfighters, citizens and all its stakeholders.”\nAccenture did not immediately respond to a request for comment.\nWhile Palantir has become a major government contractor in its own right, partnering with contracting giants could enable the software company to scale at a much faster rate, leveraging long-standing relationships these larger contractors have with virtually every federal agency. “It's actually a pretty savvy business decision on the part of both Palantir, then also what you would call a traditional, more legacy-oriented, like defense or just government contractors,” says Jessica Tillipman, associate dean for government procurement law at George Washington University. “If they’re newer to certain areas and others have that footprint, that’s how it would benefit Palantir.”\nLast week, Palantir and Deloitte announced a partnership that includes what they call the “Enterprise Operating System” (EOS) to unify data across organizations. At government agencies like the Internal Revenue Service and reportedly at the Social Security Administration (SSA), Palantir is already working to combine agency datasets, allowing what were previously disparate datasets to communicate with one another more easily.\n\"Deloitte shares Palantir's commitment to decisive action and a dedication to delivering meaningful, lasting results for commercial and government clients,\" said Jason Girzadas, Deloitte US CEO, said in a press release announcing the partnership. \"Expanding our preferred relationship at this pivotal moment provides our clients with Palantir's latest advances in AI, combined with Deloitte's engineering scale and deep sector experience.\"\nDeloitte did not immediately respond to a request for comment.\nPalantir struck some of these deals prior to Trump taking office as well. In December of last year, Booz Allen partnered with Palantir specifically, working together on building out defense IT infrastructure.\n“To have one company monopolize and become the gatekeeper of software in the government, to become an ‘app factory,’ for the government, in a sense, where they're in every agency, they're part of the defense complex and the intelligence complex, brings huge concerns regarding fairness, regarding competition, and puts Palantir in a very unique position that maybe has never existed,” says Juan Sebastián Pinto, a former Palantir employee and critic of the company."
    },
    {
      "url": "https://www.theguardian.com/us-news/2025/aug/11/trump-china-tariffs-deal-deadline",
      "text": "Donald Trump has once again delayed implementing sweeping tariffs on China, announcing another 90-day pause just hours before the last agreement between the world’s two largest economies was due to expire.\nOn Monday, Trump signed an executive order extending the deadline for higher tariffs on China until 10 November, officials confirmed to Reuters.\nChinese officials said earlier in the day they hoped the United States would strive for “positive” trade outcomes on Monday, as the 90-day detente reached between the two countries in May was due to expire.\nChina’s commerce ministry, in a statement on early Tuesday, said it will suspend additional tariffs on US goods for 90 more days, after Trump signed an executive order extending the tariff truce.\nChina will maintain its tariffs on US goods at 10%, the statement said, and take action to address non-tariff barriers facing American products. China will also postpone for 90 days the addition of US firms it had targeted in April to trade and investment restriction lists.\n“We hope that the US will work with China to follow the important consensus reached during the phone call between the two heads of state … and strive for positive outcomes on the basis of equality, respect and mutual benefit,” a foreign ministry spokesman, Lin Jian, said in an earlier statement Monday.\nChinese and US officials said they expected the pause to be extended after the most recent round of trade talks held last month in Stockholm. Scott Bessent, the US treasury secretary, said last week the US had “the makings” of a trade deal with China and that he was optimistic about a path forward.\nFailure to reach a deal would have major consequences. Trump had threatened tariffs on China as high as 245%, with China threatening retaliatory tariffs of 125%, setting off a trade war between the world’s largest economies.\nOn Sunday, Trump posted on TruthSocial that China should quadruple its purchases of soybeans from the US to help reduce the trade deficit between the US and China.\nCurrently, US exports to China are subject to tariffs of about 30%, with imports from China subject to a baseline tariff of 10% and a 20% extra tariff in response to fentanyl smuggling allegations against China. Some products are taxed at higher rates. US exports to China are subject to tariffs of about 30%\nThe Federal Reserve and many economists have argued that the tariffs will push up prices in the US. Goldman Sachs strategists calculate that US consumers have absorbed 22% of tariff costs through June 2025. That share is expected to rise to 67% if recent tariffs follow the same pattern as earlier ones.\nBefore the tariff deadline, chipmakers Nvidia and AMD agreed to pay the US government 15% of their revenue from advanced chips sold to China in exchange for export licenses to the market.\nStephen Olson, a former US trade negotiator, told Bloomberg of the deal: “What we are seeing is in effect the monetization of US trade policy in which US companies must pay the US government for permission to export. If that’s the case, we’ve entered into a new and dangerous world.”\nAssociated Press and Reuters contributed to this story"
    },
    {
      "url": "https://www.dw.com/en/india-court-orders-removal-of-5000-stray-dogs-in-new-delhi/a-73597706",
      "text": "India court orders removal of 5,000 stray dogs in New Delhi\nAugust 11, 2025India's top court on Monday ordered the removal of stray dogs from New Delhi's streets, citing a surge in dog bite cases.\nThe Supreme Court instructed authorities to capture 5,000 dogs from \"high-risk areas\" within six to eight weeks, sterilize them and relocate them to shelters.\nThe order comes as hospital records suggest New Delhi sees nearly 2,000 dog bite incidents each day.\nStray dogs biting children sparked legal case\nNo one knows exactly how many dogs roam the streets of India's capital.\nThe most recent data, from 2013, estimated at least 60,000, while more recent figures suggest the number could be as high as one million.\nWhile many of the dogs roaming New Delhi's streets are harmless, the court described the number of dog bite incidents as \"extremely grim.\"\n\"Infants, young children should not at any cost fall prey to stray dogs,\" it said.\nThe court also ordered a 24-hour helpline to report dog bites and directed officials to publicize locations where anti-rabies vaccines are available.\nCriticism from conservationists\nIndia accounts for more than a third of global rabies deaths, according to the World Health Organization. If left untreated, the virus, which invades the central nervous system of people bitten by an infected animal, is almost always fatal.\nThe court's decision has drawn criticism from conservationists over its implementation.\n\"Where are the shelters to house thousands of dogs?\" conservation biologist Bahar Dutt said in a post on X, calling the top court's order an \"impractical, unscientific move.\"\n\"We respectfully believe the focus should be on humane solutions for street dogs in Delhi — mass vaccination and sterilization — rather than removal,\" Vidit Sharma, founder of the animal welfare organization Save A Stray wrote on social media.\nThe court warned animal activists not to obstruct the process.\nKapil Mishra, a minister in the Delhi government, welcomed the order and said it was a step toward freeing New Delhi \"from the fear of rabies and stray animals.\"\n\"Special attention will also be given to the comprehensive welfare of stray animals,\" he added in a post on social media.\nEdited by: Karl Sexton"
    },
    {
      "url": "https://www.aljazeera.com/news/2025/8/10/southern-europe-battling-worst-wildfires-in-decades-amid-massive-blazes",
      "text": "Southern Europe battling worst wildfires in decades amid huge blazes\nFrance has been suffering its largest wildfire in at least 50 years, according to disaster officials.\nFirefighters in southern France have warned that a huge fire they have been battling, which spread across an area bigger than Paris, could reignite as the region continues to face a scorching heatwave.\nAuthorities on Sunday said hot, dry winds and a heatwave would make the work of firefighters even more hazardous.\nRecommended Stories\nlist of 3 itemsWildfires and heatwaves grip southern Europe as evacuations ordered\nAt least one killed as firefighters battle Greece blaze for second day\nThe fire has ravaged a vast area of France’s southern Aude area, larger than the size of the nation’s capital, killing one person and injuring several.\n“It’s a challenging day, given that we are likely to be on red alert for heatwave from 4:00pm (14:00 GMT), which will not make things any easier,” said Christian Pouget, Aude’s prefect.\nThe fire is no longer spreading but is still burning within a 16,000-hectare area, the chief of the region’s firefighter unit, Christophe Magny, said on Saturday, adding it would not be under control until Sunday evening.\nThe blaze will “not be extinguished for several weeks”, he said.\nSome 1,300 firefighters were mobilised to prevent the blaze from reigniting.\nTemperatures this weekend are expected to hit 40 degrees Celsius (104 degrees Fahrenheit) in some areas, while Monday is forecast to be the “hottest day nationwide”, according to national weather service Meteo France.\nIn Saint-Laurent-de-la-Cabrerisse, a 65-year-old woman was found dead on Wednesday in her home, which had been engulfed in flames.\nAuthorities said one resident suffered serious burns and four were lightly injured, while 19 firefighters were hurt.\nThe blaze – the largest in at least 50 years – tore through 16,000 hectares (40,000 acres) of vegetation, disaster officials said.\nEmmanuelle Bernier said she was “extremely angry” when she returned to a devastating scene on her farm, with 17 animals lost in the fire.\n“I will definitely change jobs. This will change my whole life,” she told the AFP news agency, with her property now housing just a few geese and two sick goats.\nPrime Minister Francois Bayrou visited the area last week, calling the wildfire a “catastrophe on an unprecedented scale”.\n“What is happening today is linked to global warming and linked to drought,” Bayrou said.\nFires burning elsewhere in Europe\nElsewhere in Europe, fires also rage, with experts stating that European countries are becoming more prone to such disasters due to intensifying summer heatwaves linked to global warming.\nItalian firefighters on Sunday tackled a wildfire on Mount Vesuvius, with all hiking routes up the volcano near Naples closed to tourists.\nThe national fire service said it had 12 teams on the ground and six Canadair planes fighting the blaze, which has torn through the national park in southern Italy since Friday.\nIn Greece, emergency services brought numerous fires under control over the last two days, but new outbreaks are likely, due to a lasting drought and strong winds, civil protection officials said on Sunday.\nThe region southeast of Athens was particularly hard-hit, with almost 1,600 hectares (4,000 acres) of agricultural land, forest and scrubland destroyed, according to the meteorological service.\nNumerous villages had to be evacuated as a precautionary measure, and about 400 people had to be rescued. On Friday, a man died when his remote house was engulfed by flames."
    },
    {
      "url": "https://www.npr.org/2025/03/22/nx-s1-5337214/dhs-revokes-humanitarian-parole-cubans-haitians-nicaraguans-venezuelans",
      "text": "DHS revokes legal protections for 532,000 Cubans, Haitians, Nicaraguans and Venezuelans\nMIAMI — The Department of Homeland Security said Friday that it will revoke legal protections for hundreds of thousands of Cubans, Haitians, Nicaraguans and Venezuelans, setting them up for potential deportation in about a month.\nThe order applies to about 532,000 people from the four countries who came to the United States since October 2022. They arrived with financial sponsors and were given two-year permits to live and work in the U.S. Homeland Security Secretary Kristi Noem said they will lose their legal status on April 24, or 30 days after the publication of the notice in the Federal Register.\nThe new policy impacts people who are already in the U.S. and who came under the humanitarian parole program. It follows an earlier Trump administration decision to end what it called the \"broad abuse\" of the humanitarian parole, a long-standing legal tool presidents have used to allow people from countries where there's war or political instability to enter and temporarily live in the U.S.\nDuring his campaign President Donald Trump promised to deport millions of people who are in the U.S. illegally, and as president he has been also ending legal pathways for immigrants to come to the U.S. and to stay.\nDHS said parolees without a lawful basis to stay in the U.S. \"must depart\" before their parole termination date.\n\"Parole is inherently temporary, and parole alone is not an underlying basis for obtaining any immigration status,\" DHS said.\nBefore the new order, the beneficiaries of the program could stay in the U.S. until their parole expires, although the administration had stopped processing their applications for asylum, visas and other requests that might allow them to remain longer.\nThe change is being challenged in court\nThe administration decision has already been challenged in federal courts.\nA group of American citizens and immigrants sued the Trump administration for ending humanitarian parole and are seeking to reinstate the programs for the four nationalities.\nLawyers and activists raised their voices to denounce the government's decision.\nFriday's action is \"going to cause needless chaos and heartbreak for families and communities across the country,\" said Karen Tumlin, founder and director of Justice Action Center, one of the organizations that filed the lawsuit at the end of February. She called it \"reckless, cruel and counterproductive.\"\nThe Biden administration allowed up to 30,000 people a month from the four countries to come to the United States for two years with eligibility to work. It persuaded Mexico to take back the same number from those countries because the U.S. could deport few, if any, to their homes.\nCuba generally accepted about one deportation flight a month, while Venezuela and Nicaragua refused to take any. All three are U.S. adversaries.\nHaiti accepted many deportation flights, especially after a surge of migrants from the Caribbean country in the small border town of Del Rio, Texas, in 2021. But Haiti has been in constant turmoil, hampering U.S. efforts.\nSince late 2022, more than half a million people have come to the U.S. under the policy, also known as CHNV. It was a part of the Biden administration's approach to encourage people to come through new legal channels while cracking down on those who crossed the border illegally."
    }
  ],
  "argos_summary": "Global outrage has erupted following the Israeli airstrike that killed five Al Jazeera journalists, including Anas al-Sharif, in Gaza City. The attack, which occurred at a journalists' tent outside al-Shifa Hospital, has drawn condemnation from various international bodies and sparked discussions about press freedom and the safety of journalists in conflict zones. Al Jazeera and human rights organizations have criticized Israel's justification for the strike, claiming it was a targeted assassination aimed at silencing voices documenting the ongoing conflict.",
  "argos_id": "XX996W873"
}