{
  "url": "https://www.washingtontimes.com/news/2025/aug/11/business-spat-daryl-hall-john-oates-resolved-arbitration-attorneys/",
  "authorsByline": "The Washington Times https://www.washingtontimes.com, Jonathan Mattise",
  "articleId": "992d0613e14148de83f23f2ebb997338",
  "source": {
    "domain": "washingtontimes.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "DC",
      "city": "Washington",
      "coordinates": {
        "lat": 38.8949924,
        "lon": -77.0365581
      }
    }
  },
  "imageUrl": "https://twt-thumbs.washtimes.com/media/image/2025/08/11/Hall_amp_Oates_Lawsuit_19698_c0-159-2800-1792_s1200x700.jpg?b88adf6774b1ddf521397abd3c78f52a1235bf7d",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T23:30:51+00:00",
  "addDate": "2025-08-11T23:37:27.226176+00:00",
  "refreshDate": "2025-08-11T23:37:27.226181+00:00",
  "score": 1.0,
  "title": "Business spat between Daryl Hall and John Oates has been resolved in arbitration, attorneys say",
  "description": "Daryl Hall and John Oates have resolved their dispute over a Hall & Oates business partnership through arbitration, reaching a private ending after details of their rift went public in court documents filed in a 2023 lawsuit by Hall against Oates, according to a court filing Monday.",
  "content": "NASHVILLE, Tenn. — Daryl Hall and John Oates have resolved their dispute over a Hall & Oates business partnership through arbitration, reaching a private ending after details of their rift went public in court documents filed in a 2023 lawsuit by Hall against Oates, according to a court filing Monday.\n\nIn Monday’s status report, attorneys for Hall noted the case received a final judgment in arbitration and they filed a proposed order for the judge, Nashville Chancellor Russell Perkins, to dismiss the case. In mid-July, Perkins ordered Hall’s attorneys to offer an update in the case, which had last seen a public filing in December 2023.\n\nIt’s unclear when the arbitration process was finalized. And details were not revealed about the arbitration outcome between the duo who made music together for more than a half century, including hits in the 1970s and ’80s such as “Maneater,” “Rich Girl” “Kiss on My List” and “I Can’t Go for That (No Can Do).”\n\nRobb Harvey, an attorney for Hall, declined to comment. Representatives for Oates did not immediately respond to The Associated Press’ request for comment.\n\nIn 2023 filings in the case, Hall accused Oates of blindsiding and betraying him, saying their relationship and his trust in Oates have deteriorated. Oates replied that he was “deeply hurt” that Hall was making “inflammatory, outlandish, and inaccurate statements” about him.\n\nThe judge had paused the sale of Oates’ stake in Whole Oats Enterprises LLP to Primary Wave IP Investment Management LLC. Whole Oats includes valuable Hall & Oates materials such as trademarks, personal name and likeness rights, record royalty income and website and social media assets, a court declaration says.\n\nThe dispute went public in November 2023, when Hall filed the lawsuit asking the judge to stop the sale by Oates so private arbitration could begin.\n\nHall gave a scathing account of their relationship in early November 2023 during arbitration, and it was made public later in the month in the lawsuit. It alleges that Oates and his team engaged in the “ultimate partnership betrayal” by pushing to sell his share while telling Hall’s associates that he wanted to maintain his ownership.\n\nIn his own declaration, Oates expressed disappointment with his longtime partner’s words, saying Hall’s accusations that Oates went behind his back and breached their agreement aren’t true. Oates declined to go into specifics, saying he’s obligated to keep details private, even if Hall didn’t.\n\nLast year, Oates told The Associated Press that he’s had “no communication” with Hall and declined to discuss the legal proceedings. He did not see a Hall & Oates reunion in his future.\n\n“I personally don’t see it happening. It’s not in my plans at all. You can ask Daryl Hall what he thinks. But for me personally, no,” he says.\n\nThe Times asked Hall in February if the ship had sailed on mending the pair’s relationship.\n\n“That ship has gone to the bottom of the ocean,” Hall told the news outlet. “I’ve had a lot of surprises in my life, disappointments, betrayals, so I’m kind of used to it.”\n\nMaria Sherman in New York contributed to this report.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Daryl Hall",
      "weight": 0.11224384
    },
    {
      "name": "Hall",
      "weight": 0.111953944
    },
    {
      "name": "John Oates",
      "weight": 0.104564026
    },
    {
      "name": "Oates",
      "weight": 0.103422225
    },
    {
      "name": "valuable Hall & Oates materials",
      "weight": 0.081169836
    },
    {
      "name": "private arbitration",
      "weight": 0.08086692
    },
    {
      "name": "Hall & Oates",
      "weight": 0.0762067
    },
    {
      "name": "arbitration",
      "weight": 0.072424814
    },
    {
      "name": "a Hall & Oates business partnership",
      "weight": 0.06262308
    },
    {
      "name": "Hall’s attorneys",
      "weight": 0.0621681
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.97802734375
    },
    {
      "name": "/Law & Government/Legal/Other",
      "score": 0.80322265625
    },
    {
      "name": "/News/Gossip & Tabloid News/Other",
      "score": 0.62841796875
    },
    {
      "name": "/Law & Government/Government/Courts & Judiciary",
      "score": 0.494140625
    },
    {
      "name": "/Arts & Entertainment/Music & Audio/Urban & Hip-Hop",
      "score": 0.4443359375
    },
    {
      "name": "/Arts & Entertainment/Music & Audio/Pop Music",
      "score": 0.42138671875
    },
    {
      "name": "/Law & Government/Legal/Legal Services",
      "score": 0.391845703125
    }
  ],
  "sentiment": {
    "positive": 0.046471283,
    "negative": 0.75294393,
    "neutral": 0.20058477
  },
  "summary": "Daryl Hall and John Oates have resolved their dispute over a Hall & Oates business partnership through arbitration, according to attorneys. The dispute began in 2023 after details of their rift were revealed in court documents filed in a 2023 lawsuit by Hall against Oates. Hall accused Oates of blindsiding and betraying him, and Oates responded by saying their relationship had deteriorated. The judge had halted the sale of Oates' stake in Whole Oats Enterprises LLP to Primary Wave IP Investment Management LLC. The arbitration outcome was not disclosed.",
  "shortSummary": "Daryl Hall and John Oates resolved their dispute over their Hall & Oates business partnership in arbitration, ending in a private court case.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "00f2a068516645a6a2c05ca620c83545",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Daryl Hall and John Oates have settled their business partnership dispute through arbitration, following a public lawsuit filed by Hall against Oates in 2023. The arbitration outcome remains undisclosed, but Hall's attorneys reported a final judgment and requested the case be dismissed. The conflict, which included accusations of betrayal and miscommunication, has strained their long-standing relationship, with both parties expressing disappointment over the situation.",
  "argos_id": "Y2ED7W6XS"
}