{
  "url": "https://www.seattletimes.com/business/bolivias-election-may-spell-the-end-of-its-long-ruling-left-heres-what-to-know/",
  "authorsByline": "ISABEL DEBRE, PAOLA FLORES",
  "articleId": "a3645036d8de4d1aacb928bf49b63e34",
  "source": {
    "domain": "seattletimes.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "WA",
      "county": "King County",
      "city": "Seattle",
      "coordinates": {
        "lat": 47.6038321,
        "lon": -122.330062
      }
    }
  },
  "imageUrl": "https://images.seattletimes.com/wp-content/uploads/2025/08/urnpublicidap.orgdf3b502d552e5b995d082dbdbb226c1dBolivia_Arce_75388.jpg?d=1200x630",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T21:05:07-07:00",
  "addDate": "2025-08-12T04:51:44.959843+00:00",
  "refreshDate": "2025-08-12T04:51:44.959846+00:00",
  "score": 1.0,
  "title": "Bolivia’s election may spell the end of its long-ruling left. Here’s what to know",
  "description": "Bolivia's governing Movement Toward Socialism party won't have a big-name presidential candidate on the ballot for the first time in two decades.",
  "content": "LA PAZ, Bolivia (AP) — For most of Renan Aliaga’s adult life, a single name dominated the politics of Bolivia: Evo Morales.\n\nMorales, a former union leader for coca farmers, founded the Andean nation’s most successful political party and transformed Bolivia over three consecutive terms marked by political stability and economic growth.\n\nBut when Aliaga goes to the polls on Sunday to vote for Bolivia’s next president, he won’t see Morales’ name on the ballot after electoral authorities excluded him.\n\nIn fact, for the first time in two decades, Aliaga won’t see any big name from the governing Movement Toward Socialism, or MAS, party that Morales founded — not even President Luis Arce, Morales’ protege-turned-rival, who withdrew from the race over his failure to halt an economic tailspin.\n\nUnder MAS, Bolivia enjoyed years of a fixed exchange rate, low inflation and subsidized energy. Now, high inflation, a scarcity of imported goods and fuel shortages have beset the country.\n\nThe main options remaining include a conservative businessman and right-wing former president — both of whom have run and lost three times before — and a young leftist Senate leader.\n\nUnsatisfied, Aliaga, a 39-year-old bus driver and former MAS voter, says he’ll make a last-minute decision.\n\n“The right wing had its chance, and it was a disaster,” he said, recalling the hardship of the 1990s, when Bolivia became a poster child for free-market economics and the two right-wing front-runners — businessman Samuel Doria Medina and ex-President Jorge “Tuto” Quiroga — built their careers.\n\n“But the left wing has proven to be the same, or worse,” Aliaga said, referring to how the MAS strategy of nationalizing resources and redistributing tax receipts sputtered out with the end of the commodities boom.\n\nThe main issues in this hotly contested election are Bolivia’s long-standing leftist economic model, its democratic integrity and the livelihoods of millions of people undergoing the country’s worst financial crisis in four decades.\n\n“This seems the end of the cycle not only for MAS, but for an entire model of government,” Bolivia political analyst Verónica Rocha said.\n\nTensions within MAS can be traced to Morales’ disputed 2019 reelection. Protests erupted and the leftist leader resigned under pressure from the military. He fled into exile and right-wing Senator Jeanine Áñez took office in what many view as a coup.\n\nViolent clashes between protesters and security forces killed at least 37 people.\n\nMorales returned to Bolivia following the 2020 election victory of his former finance minister, Arce.\n\nBut their competing ambitions collided when Morales announced his intention to return to politics. Lawmakers loyal to Morales deprived Arce’s government of its majority. Judges answering to Arce ordered Morales’ arrest over his sexual relationship with a 15-year-old girl and barred his 2025 presidential candidacy on account of his past terms.\n\n“MAS torpedoed its own chances of winning this election,” said Gustavo Flores-Macías, a professor of government and public policy at Cornell University.\n\nA young vice president, Quiroga became interim leader in 2001 when then President Hugo Banzer, Bolivia’s former military dictator, resigned because of terminal cancer with a year left in his term.\n\nEver since, Quiroga has yearned for a term of his own. He ran three times — twice against Morales in 2005 and 2014. Now 65, he’s hoping the fourth time’s the charm.\n\nDoria Medina, 66, a former minister of planning from 1991-1993 made his fortune in cement and owns Bolivia’s Burger King franchise. Dubbed the “eternal candidate,” he lost to Morales in 2005, 2009 and 2014, as Bolivia’s natural gas windfall, underwritten by public investment and generous subsidies, buoyed the union leader’s popularity.\n\nWhen commodity prices slumped and gas production plummeted, Morales’ “economic miracle” went bust.\n\nNow once-routine errands have turned into nightmares as Bolivians wait in fuel lines that wrap around city blocks, run from pharmacy to pharmacy in search of medicines and queue for subsidized bread that has shrunk to almost half its normal size.\n\nThis may give the opposition its first real shot at power in two decades.\n\nYet Bolivians interviewed across the administrative capital of La Paz expressed not only frustration with the MAS party, but also disappointment in the right-wing establishment.\n\n“If people vote for the right, it’s because they’re resigned to it as the only alternative,” said Bolivian author Quya Reyna. “These are recycled politicians from the 1990s era of privatization.”\n\nDoria Medina and Quiroga vow to slash fuel subsidies, dismantle inefficient state-owned companies, let foreign investors mine Bolivia’s abundant lithium reserves and reorient the nation’s foreign policy toward the United States after years of its alignment with China and Russia.\n\nGraffiti sprayed across La Paz reads “100 days, dammit” — Doria Medina’s pledge to fix fuel shortages and stabilize the exchange rate within his first 100 days. Motorists waiting for hours to get gas find themselves facing billboards of Quiroga promising “No more lines!”\n\nIf no candidate wins a majority of the vote, a runoff between the top two finishers will be held on Oct. 19.\n\nVoter cynicism is widespread, with many Bolivians saying that they have no faith in any of the candidates to improve their lives.\n\nLongtime MAS voters wary of austerity under a right-wing president aren’t sure where to turn.\n\nSome initially pinned their hopes on 36-year-old Senate President Andrónico Rodríguez, a coca-farming union activist who could have appealed to Indigenous communities looking for the kind of representation they found under Morales.\n\nBut Morales branded Rodríguez a traitor for advancing his own candidacy. The Senate leader has made few public appearances since.\n\nA rare centrist candidate, lawmaker Rodrigo Paz and his media-savvy running mate, ex-Police Captain Edman Lara, have recently energized young voters with TikTok videos from the campaign trail. With Doria Medina and Quiroga neck and neck, Paz could play kingmaker.\n\nBut their Christian Democratic Party’s blistering attacks on both MAS and the right-wing have left some voters without a clear sense of where they stand.\n\n“We’ve all been raised on politicians’ broken promises,” said Irma Marín, 38, shouting to be heard over the crowd at a Paz-Lara campaign rally Sunday. “I’m not sure who to trust.”\n\nFacing an arrest warrant, Morales, 66, has been holed up for months in his tropical stronghold of Chapare. His followers staged raucous protests against his removal from the race, blocking key roads and confronting police in clashes in June that killed four officers and four civilians.\n\nMorales is urging voters to register their rage by casting null-and-void ballots.\n\n“Null votes signal that these elections are not legitimate and the next government of Bolivia won’t be legitimate,” said Chris Velasco, an organizer close to Morales. “That will mean political instability, social instability.”",
  "medium": "Article",
  "links": [],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "former MAS voter",
      "weight": 0.07182642
    },
    {
      "name": "Morales",
      "weight": 0.07066701
    },
    {
      "name": "Evo Morales",
      "weight": 0.068616025
    },
    {
      "name": "Bolivia",
      "weight": 0.06682161
    },
    {
      "name": "Longtime MAS voters",
      "weight": 0.06393834
    },
    {
      "name": "Bolivia political analyst Verónica Rocha",
      "weight": 0.062088404
    },
    {
      "name": "MAS",
      "weight": 0.05462471
    },
    {
      "name": "young voters",
      "weight": 0.05148681
    },
    {
      "name": "businessman Samuel Doria Medina",
      "weight": 0.048794236
    },
    {
      "name": "La Paz",
      "weight": 0.04876554
    }
  ],
  "topics": [
    {
      "name": "US Politics"
    }
  ],
  "categories": [
    {
      "name": "Business"
    },
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.9892578125
    },
    {
      "name": "/News/Politics/Campaigns & Elections",
      "score": 0.95703125
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.90869140625
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.8671875
    }
  ],
  "sentiment": {
    "positive": 0.0574311,
    "negative": 0.7264602,
    "neutral": 0.21610866
  },
  "summary": "Bolivian President Evo Morales, a former union leader for coca farmers, was excluded from the ballot after electoral authorities excluded him from the governing Movement Toward Socialism (MAS), a party that Morales founded. This is the first time in two decades that Aliaga will see no big name from MAS, which he believes to be the best of the left. The main candidates are a conservative businessman and former president, former President Jorge \"Tuto\" Quiroga, and a young leftist Senate leader. The election, which is hotly contested, may end the long-ruling left in Bolivia due to high inflation, imported goods shortages and a financial crisis. Key issues include Bolivia's leftist economic model, its democratic integrity, and the livelihoods of millions of people during the country's worst financial crisis in four decades.",
  "shortSummary": "Bolivian voters choose a new president, with Evo Morales' party MAS facing challenges from conservative businessman Samuel Doria Medina and right-wing politicians amid economic struggles.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "31e713431370499f96388938631353d4",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Bolivia's upcoming presidential election marks a significant shift as former president Evo Morales, a dominant figure in Bolivian politics for two decades, is absent from the ballot due to legal issues. The ruling Movement Toward Socialism (MAS) party, founded by Morales, faces criticism for its failure to address the country's economic crisis, leading to a lack of trust among voters. With high inflation and fuel shortages, the election features candidates from both the right and a centrist option, but many Bolivians express cynicism and disappointment in the political landscape, unsure of who can effectively address their needs.",
  "argos_id": "Y3INC6J8M"
}