{
  "url": "https://www.usatoday.com/story/entertainment/movies/2025/08/11/dennis-quaid-the-parent-trap-pool-scene/85618389007/",
  "authorsByline": "Edward Segarra",
  "articleId": "339207e5be604185b5b5e2c88fa2e42f",
  "source": {
    "domain": "usatoday.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "VA",
      "county": "Fairfax County",
      "city": "McLean",
      "coordinates": {
        "lat": 38.9342888,
        "lon": -77.1776327
      }
    }
  },
  "imageUrl": "https://www.usatoday.com/gcdn/authoring/authoring-images/2025/08/11/USAT/85618676007-e-01-parent-trap-olderlohan-ecov-24.JPG?crop=2464,1386,x0,y0&width=2464&height=1386&format=pjpg&auto=webp",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T02:59:13+00:00",
  "addDate": "2025-08-12T03:03:00.517352+00:00",
  "refreshDate": "2025-08-12T03:03:00.517354+00:00",
  "score": 1.0,
  "title": "Why Dennis Quaid's iconic 'Parent Trap' pool scene was a costume designer's nightmare",
  "description": "Dennis Quaid's famous pool scene from \"The Parent Trap\" turned out to be a massive undertaking in the fashion department.",
  "content": "Not even Elizabeth James could save Dennis Quaid from the fashion heroics of \"The Parent Trap.\"\n\nQuaid starred alongside then-newcomer Lindsay Lohan and Natasha Richardson in the 1998 family comedy about estranged twin sisters Hallie Parker and Annie James, who scheme to reunite their divorced parents after meeting during a chance encounter at summer camp.\n\nOne of Quaid's most memorable scenes from the Disney film, which grossed $92.1 million at the global box office, is when his character Nick Parker spots his fashion designer ex, Elizabeth James (Richardson), at a hotel pool area.\n\nStunned to see his former spouse after more than a decade, Nick quickly — and ungracefully — makes his way across the deck to talk to James, eventually falling into the pool after bumping into a hotel employee. Nick, who was dressed in a crisp two-piece suit and black dress shoes, later emerges from the pool and sheepishly walks over to James to greet her.\n\n\"Dennis was very game to fall into the pool a few times in a row, which meant drying off, changing, and taking another spill,\" the film's director Nancy Meyers told People magazine in an interview published Aug. 9. \"He was just wonderful to work with.\"\n\nThe now-iconic scene was filmed at The Ritz-Carlton in Marina del Rey, California, and turned the marina hotel into something of a pop cultural landmark over the years.\n\n\"Of all the filming we have had at the hotel over the past 35 years, that is the movie that guests mention the most,\" Ed Curry, the hotel's director of sales and marketing, told the magazine. \"People love the movie, and all seem to know that is our pool area.\"\n\nQuaid's commitment to his \"Parent Trap\" wipeout came at a sartorial cost.\n\nCostume designer Penny Rose told People magazine that Quaid changed between six identical designer suits from Giorgio Armani for the aquatic scene, with the production crew even spraying the suits with pool water to test the fabric.\n\nRose noted that the chlorine from the pool water caused the suit to shrink. \"I mean, I've had Tom Cruise in a fake suede shirt so that he can get it wet,\" Rose said. \"But you can't really replicate an Armani suit.\"\n\nQuaid reflected on the impact of \"The Parent Trap\" on his career in a March interview with People magazine, telling the outlet that the beloved dad character has become his signature role.\n\n\"Everybody grew up with 'The Parent Trap,' and now there's always new kids coming along,\" said Quaid, jokingly adding: \"I tell people, 'I was your babysitter because your parents would put this on. They'd go do what they wanted to do in the next room.'\"",
  "medium": "Article",
  "links": [
    "https://www.usatoday.com/story/entertainment/celebrities/2025/07/31/lindsay-lohan-premiere-fashion-freaky-friday-parent-trap/85466417007/",
    "https://www.usatoday.com/story/entertainment/celebrities/2024/08/23/dennis-quaid-parent-trap-revival-natasha-richardson/74923528007/",
    "https://puzzles.usatoday.com/",
    "https://people.com/the-parent-trap-cast-and-crew-reveal-how-they-made-the-movie-11784849",
    "https://www.usatoday.com/story/entertainment/celebrities/2025/08/03/joely-richardson-pamela-anderson-liam-neeson-natasha-richardson/85501305007/",
    "https://www.usatoday.com/story/entertainment/movies/2025/08/09/freakier-friday-lindsay-lohan-elaine-hendrix-cameo/85507948007/",
    "https://www.boxofficemojo.com/title/tt0120783/",
    "https://www.usatoday.com/story/entertainment/movies/2023/07/28/the-parent-trap-cast-where-are-they-now-lindsay-lohan/70477057007/",
    "https://www.youtube.com/watch?v=x7udPgSU8PQ",
    "https://www.usatoday.com/picture-gallery/entertainment/movies/2025/07/03/2025-best-movies-ranked-photos/84438497007/"
  ],
  "labels": [
    {
      "name": "Pop Culture"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "pool water",
      "weight": 0.08860315
    },
    {
      "name": "Parent Trap",
      "weight": 0.08645844
    },
    {
      "name": "Dennis Quaid",
      "weight": 0.0795672
    },
    {
      "name": "Costume designer Penny Rose",
      "weight": 0.07240927
    },
    {
      "name": "Quaid",
      "weight": 0.07192427
    },
    {
      "name": "Elizabeth James",
      "weight": 0.07023829
    },
    {
      "name": "People magazine",
      "weight": 0.068540834
    },
    {
      "name": "Annie James",
      "weight": 0.06823173
    },
    {
      "name": "Nick Parker",
      "weight": 0.065561235
    },
    {
      "name": "James",
      "weight": 0.06347464
    }
  ],
  "topics": [
    {
      "name": "Movies"
    }
  ],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.9873046875
    },
    {
      "name": "/Arts & Entertainment/Movies/Movie Reference",
      "score": 0.9052734375
    },
    {
      "name": "/Arts & Entertainment/Movies/Other",
      "score": 0.708984375
    },
    {
      "name": "/Arts & Entertainment/Entertainment Industry/Film & TV Industry",
      "score": 0.34423828125
    },
    {
      "name": "/Arts & Entertainment/Movies/Drama Films",
      "score": 0.33544921875
    },
    {
      "name": "/Arts & Entertainment/Movies/Comedy Films",
      "score": 0.328857421875
    }
  ],
  "sentiment": {
    "positive": 0.10953422,
    "negative": 0.5628177,
    "neutral": 0.32764807
  },
  "summary": "Dennis Quaid's iconic pool scene from \"The Parent Trap\" is one of the most memorable moments of his career. The scene, which was filmed at The Ritz-Carlton in Marina del Rey, California, involved Quaid and Lindsay Lohan. Costume designer Penny Rose said that Quaid changed six identical designer suits from Giorgio Armani for the aquatic scene, and the production crew even tested the fabric with pool water to test the fabric. The film's director, Nancy Meyers, said Quaid was \"wonderful to work with.\"",
  "shortSummary": "Dennis Quaid's iconic \"The Parent Trap\" pool scene, filmed at The Ritz-Carlton, was marred by wardrobe issues and multiple wardrobe changes.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "129a27147ac644d487ef68f79f9389ef",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.usatoday.com/story/entertainment/movies/2025/08/09/freakier-friday-lindsay-lohan-elaine-hendrix-cameo/85507948007/",
      "text": "'Parent Trap' reunion! Lindsay Lohan explains Elaine Hendrix's 'Freakier Friday' cameo\nElaine Hendrix has long proclaimed that her character in “The Parent Trap” is not the villain of the 1998 movie, and now Lindsay Lohan is weighing in.\nLohan, 39, played dual roles in Disney’s remake, starring as twins Hallie and Annie, who were separated when their parents, Nick Parker (Dennis Quaid) and Elizabeth James (Natasha Richardson), divorced. Elizabeth raised Annie in London, while Hallie had her run of Nick’s vineyard in Napa.\nA chance meeting at summer camp reunited the twins, and they switched places in hopes of bringing their parents back together. But the duo ran into a little problem when they learned that Nick was engaged to Meredith Blake (Hendrix), a 26-year-old PR powerhouse. Sure, she might be eyeing Nick’s bank account and unknowingly standing in the way of true love, but as Meredith says in the movie, “Being young and beautiful is not a crime, you know.”\nLohan and Hendrix reunite in “Freakier Friday” (in theaters now), a sequel to the 2003 film in which angsty teenager Anna (Lohan) switched bodies with her psychologist mom Tess (Jamie Lee Curtis). In the second installment, Anna has shelved her dreams of becoming a rock star in order to be a devoted mom to her teenage daughter Harper (Julia Butters) and now manages a rising pop artist, Ella (Maitreyi Ramakrishnan). Thanks to a fortune teller (Vanessa Bayer), Anna swaps with Harper and Tess trades places with Harper’s school nemesis and soon-to-be stepsister Lily (Sophia Hammons).\nHendrix, 54, appears briefly as Anna’s colleague Blake Kale, who assists at a photoshoot for Ella’s album. Lohan tells USA TODAY that she and “Freakier Friday” director Nisha Ganatra are both friends with Hendrix, which is how the cameo came to be.\n“When it was mentioned, ‘Should we have Elaine do a little cameo?’ We were like, ‘Yeah, why not? Let's do it! Let's get Elaine in here,’ ” Lohan says. ”Because she's so awesome and she's amazing.”\nLohan says she felt like the clock had turned back two decades.\n“When we were shooting, I kept laughing because she says this line, something puss, and I was like, ‘Oh, my God. That's like a ‘Parent Trap’ line,” Lohan says. “I felt like I was 10 again.” (In “The Parent Trap,“ Meredith tells one of the twins, “OK, puss, you listen and you listen good. I am marrying your father in two weeks, whether you like it or not.”)\nIs Meredith the villain in 'The Parent Trap'?\nIn 2022, Hendrix leaned into the “He’s a 10 but …” trend and took the opportunity to roast Nick in a TikTok set to Adele’s “Easy on Me.”\nShe revisited the movie’s plot with a video snippet of Hendrix pouring herself a tall glass of red wine.\nA voiceover says Meredith, Nick and the twins, “go on a camping trip to get to know one another, but you’re not a nature girl and the twins know it. So the little brats put rocks in your backpack, a lizard on your head, sugar water in your mosquito repellent, and push your air mattress into the lake while you’re sleeping.”\nSo you lose it, the text reads, “threaten to ship them to Switzerland (for boarding school) and throw a ring at his head. And you’ve never looked back.”\n“She's a bit of a villain in that movie,” Lohan says. “But she's also just a beautiful blonde bombshell who falls in love with a man, and it's his fault too.”\n“I think if you asked Hallie and Annie, they'd probably still say that she was the villain,” Lohan adds with a laugh. “Or I don't know what they’d feel today! Maybe we'll see.”"
    },
    {
      "url": "https://people.com/the-parent-trap-cast-and-crew-reveal-how-they-made-the-movie-11784849",
      "text": "17 Cast and Crew Members from The Parent Trap Share Behind-the-Scenes Details of How the Pool Scene Came Together (Exclusive) Director Nancy Meyers tells PEOPLE Dennis Quaid was 'very game' to do his stunt work in one pivotal scene By Madeleine Janz Madeleine Janz Madeleine Janz is an Evergreen Editor at PEOPLE. She has been working at PEOPLE since 2023. Her work has previously appeared on Real Simple, Architectural Digest, and World Wildlife. People Editorial Guidelines Published on August 9, 2025 11:00AM EDT 17 Comments Natasha Richardson and Dennis Quaid in The Parent Trap. Credit : Disney NEED TO KNOW Nancy Meyers' 1998 remake of the classic 1961 The Parent Trap has been beloved since it hit the big screenOne pivotal scene, in which Dennis Quaid falls into a pool, proved to be a challenging day on setHere, 17 cast and crew members from The Parent Trap reveal what it was actually like to trap the parents and make the iconic movie It was a beautiful November day at the Ritz-Carlton in Marina del Rey, interrupted only by the continuous shout and splash of Dennis Quaid crashing into the pool. “Poor Dennis went in and out of that pool for 4 days in an Armani suit that shrank the second he went in,” The Parent Trap director Nancy Meyers said in the film’s director's commentary. Now, 27 years later, she tells PEOPLE that Quaid’s willingness to do it over and over again has always stuck with her. “Dennis was very game to fall into the pool a few times in a row, which meant drying off, changing and taking another spill,” she says. “He was just wonderful to work with.” The cast and crew of the iconic 1998 remake of the beloved 1961 original were nearing the end of their months-long shoot and finally filming the titular trap scene, where Quaid’s Nick is so stunned by seeing Natasha Richardson’s Elizabeth that he takes an epic trip and falls into the hotel’s pool. Lindsay Lohan in The Parent Trap. Disney In what was Meyers’ directorial debut, Lindsay Lohan also made her triumphant first splash on the big screen, new motion control technology was used to its most perfect potential and the set was filled with friends and family, including Meyers and producer Charles Shyer’s two daughters, the real-life Annie and Hallie. Now, nearly three decades later, 17 of these actors, costumers, location managers and VFX experts sat down with PEOPLE to share their memories of this pivotal scene and the impact of the movie’s legacy in the wake of Shyer’s December 2024 death. Lohan, 39, tells PEOPLE that she can’t pick just one piece of direction from Shyer or Meyers that has stuck with her because \"everything\" she learned \"from both of them on that film has always been incredible.\" The director-producer pair had their work cut out for them during the pool scene. Over the couple of days that The Parent Trap crew took over the Marina del Rey Ritz-Carlton, the director of photography, Dean Cundey, said lighting was their biggest foe. Location manager Rory Enke remembers Cundey using a simple trick to help Lohan stop squinting into the bright sun. “Before they rolled cameras, he said, ‘Now Lindsay, I want you to close your eyes and put your face towards the sun.’ And with her eyes closed, she stood there for maybe a minute,” Enke explains to PEOPLE. “Then he said, ‘Now turn and look at me.’ With her back to the sun, she opened her eyes, and she didn't squint.\" Dennis Quaid in The Parent Trap. Disney As the crew dealt with the ever-changing light, Quaid was getting his stunt practice in, changing between six identical Armani suits, being sprayed with pool water and intermittently jumping into the jacuzzi to warm up. Costume designer Penny Rose, who was hired in part because she had an 11-year-old daughter at the time, tells PEOPLE that the worst problem they faced still makes her laugh. “It was the shrinkage because of the chlorine. I mean, I've had Tom Cruise in a fake suede shirt so that he can get it wet. But you can't really replicate an Armani suit,” she says, noting that the production team even got a sample of the Ritz’s pool water to run tests on the fabric. Each night, costume supervisor Carolyn Dessert tells PEOPLE, the suits were picked up by Dmitry Tokar at La Cienega Dry Cleaners, made perfect again and brought back at 5 a.m. the next morning to do it all again. Composer Alan Silvestri, who had already worked with Meyers and Shyer on Father of the Bride, says that this pool stunt was more than just a fun gag; it also called back to the couple’s body of work. “Filmmakers have their motifs. As you recall, George Banks [in Father of the Bride] fell in a pool and so Chuck and Nancy have a thing about falling into pools,” he says. “I think audiences fall in love with filmmakers and their approaches to things. So inherently there are Easter eggs that are sometimes incredibly subtle that make for enjoying a filmmaker's body of work.” Related Stories \"The Parent Trap\" 's Tie-Dye Girl Is Reclaiming the Joy from Her Iconic Role While Raising Her Own 4 Kids (Exclusive) Elaine Hendrix Is Coming Back to 'The Parent Trap,' but Not for a Sequel: 'Justice for Meredith Blake!' (Exclusive) Although the costuming was a hassle and the fall into the pool had to happen over and over again, Dessert says Quaid was a “trooper” and stayed “easy going.” Lohan, then 11, agreed in behind-the-scenes footage shot at the time. “He makes everything fun, even if it’s the worst day of his life. For other actors, he’ll make it fun,” she said of Quaid. “He’s always happy. I mean, he just did like five scenes in a row jumping into water, and he’s still happy.” Finding the perfect Nick was not a simple feat, casting director Ilene Starger tells PEOPLE. Ultimately, through the search, Starger found that one throughline in the process made the biggest impact on how they picked “the ‘dream’ dad.” “One thing that moved me was that whenever Charles and Nancy’s daughters Annie and Hallie would visit their offices, Charles would just light up at the sight of them, and put everything aside to spend time with them,” she says. “It was obvious that he and Nancy were wonderful parents, and I think that informs their script for The Parent Trap, the roles of Nick and Elizabeth, and their working relationship with Lindsay.” The role was unlike anything Quaid had starred in, as he was most known for violent, dramatic movies at the time, so his charming take on Nick Parker made an outsized impact on his career. The actor told PEOPLE in March 2025 that he is most recognized for the doting dad role. Natasha Richardson, Dennis Quaid, Elaine Hendrix, screenwriter Charles Shyer, director Nancy Meyers on set of The Parent Trap, 1998. Walt Disney/courtesy Everett Collection \"Everybody grew up with The Parent Trap and now there's always new kids coming along,\" he said, adding with a laugh, \"I tell people, 'I was your babysitter because your parents would put this on. They'd go do what they wanted to do in the next room.' \" While Quaid had quite a few acrobatics to perform in the scene, most of the actors were tasked with doing their best lounging by the poolside. When the scene opens, Nick's housekeeper Chessy (Lisa Ann Walter), Elizabeth's butler Martin (Simon Kunz) and Annie, still pretending to be Hallie (Lohan), are relaxing by the pool, discovering their newfound dynamic. “Most of the time we just glammed it out,” Kunz tells PEOPLE. The iconic house manager-butler duo had just met a scene ago, when Martin strolls into the hotel living room in only a Speedo. In the film, Chessy is taken by his confidence and the two immediately hit it off, rushing down to the pool, leaving Elizabeth to spiral. On set, Kunz was not so sure about being the only nearly naked man in a Disney movie. Rose remembers having to “persuade” him into wearing the “budgie smuggler,” as she and Kunz called it, after Meyers insisted it would be funny. “If ever I do get recognized nowadays, Speedos comes up. Handshake and Speedos. That's basically it. That's the two things,” Kunz jokes to PEOPLE. Simon Kunz in The Parent Trap. Disney Walter, for her part, was reminded that he was “embarrassed” but tells PEOPLE, “he did not need to be.” “There was nothing to be ashamed of, seriously. When he came out, me and Natasha looked at each other and gave each other the raised eyebrow of, ‘Hey,’ “ she recalls. Walter even remembers Shyer at one point offering to \"strip down to a Speedo\" with him so that the actor didn't \"have to worry.\" In part, Chessy and Martin look to have such an instantly natural dynamic because Walter and Kunz had connected quickly on set, and their chemistry was evident. He says she took him under her wing because it was his first time in Los Angeles, and he had originally arrived solo. “I did take him under my wing because I had a house in L.A. and family, and he was alone. Of course, he was gonna come over,” Walter says. “My family loved him, too.” While shooting the pool scene, and sunning themselves as Kunz remembers, he and Walter also had a little photoshoot, resulting in what she says are her “favorite on-set pictures ever.” Simon Kunz in Parent Trap. Disney After Quaid falls into the pool, Martin snaps a photo of him, a moment Kunz said was a bit of improv. The actor says this kind of creativity was encouraged on set — Quaid’s “you’re all wet” line was also improvised — and guided by Meyers’ particular filmmaking sensibility. While some of the actors took a breather and had fun improvising during these shoot days, for the crew, the pool scene proved to be one of the most difficult logistically. Meyers and Shyer’s assistant at the time, Roshanna Baron, who also appeared as an extra in the pool scene, remembers the mayhem of the shoot. “That day was very much a whirlwind. It had a lot of moving parts because everybody was on set and there were a lot of intricacies in trying to get the timing right,” she tells PEOPLE. Script supervisor Jeanne Byrd, who was tasked with ensuring continuity at all times with the added challenge of motion control technology, tells PEOPLE that the scene had many hurdles. “Oh my gosh. Who said what, when, at what point does he come up out of the water with what hand flailing so she [Meyers] could cut to the wider shot of the same hand flailing? I mean, it was a nightmare,” she says with a laugh. “I don't think I slept for days before we shot that scene and probably drank lots of wine on the night that we finished it.” Lindsay Lohan and Elaine Hendrix in Parent Trap. Disney Twenty-seven years later, though, they both have fresh perspectives on the moment. Baron still remembers the air on set. “When we got done with the scene, everybody was clapping and grateful,” she says. “It was a fun set. Everybody was just happy to work around each other. It was a joy to be around when everybody knows what they're doing and gets it done right.” Meyers agrees and adds, “The whole cast on that film was fantastic, and it was very fun having them all in the same scene.” Thomas Harrigan, who was an assistant location manager, also concurs that all the right people came together on The Parent Trap, working to the best of their ability to make a difficult project come to life. “You just make it happen,” he tells PEOPLE. “There's almost nothing impossible to do in film.” And, despite the difficulties, Byrd concedes that she still enjoyed the pool scene more than the motion control shots. Out of only a handful of scenes like it, the pool scene featured an actor other than Lohan taking part in the new technology, Elaine Hendrix. Meyers and Shyer said they loved writing the scene in which her character, Meredith, enters and finally learns that there is not one but two of her archnemeses to contend with. In real life, the then-26-year-old was also taking on this new motion control style of shooting in stride. The technology allows camera movement to be computerized and replicated so filmmakers can shoot two sides of the same shot in an identical fashion. For the actors, this means repeating their lines and reactions over and over again. Lindsay Lohan behind the scenes of The Parent Trap. RGR Collection/Alamy “I remember Nancy saying that she trusted me. By that point, she could see everything I could do physically and that she wasn't concerned,” Hendrix tells PEOPLE. “And I remember feeling kind of honored by that.” Joining the ranks of Polly Holliday (who played camp leader Marva Sr. and appeared in a motion control shot during the breakfast line), Hendrix was directed to do the scene by the pool over and over again “exactly like you did it before.” Hendrix says. “That took particular focus and attention and time, and that was just longer to do.” Gayle Busby, one of the visual effects producers, remembers the massive operation it took to run the motion control tech. Seven on-site technicians were constantly compositing the side-by-side shots of Lohan in the moment so that Meyers could pick which she most liked. Byrd likens the process to “flying the plane while building it.” She tells PEOPLE, “The motion control was stimulating because it was new and different, but it was also scary and so scientific.” Our new app is here! Free, fun and full of exclusives. Scan to download now! The writing in this technically brilliant scene has its own charming flair, too, which made it Richardson’s favorite in the whole movie, according to Meyers. The writers maintained a line from the original movie, when Annie says she has been “quite without a father,” and had a little more fun with Hallie’s side of the coin, having the fiery twin rant about her upcoming “messed up teenage years.” This labor of love on the intensive pool scene paid off, and then some. Ed Curry, director of sales and marketing at the Marina del Rey Ritz-Carlton, tells PEOPLE the hotel is lucky to still have some of the same staff who were working during filming and many of these folks (and guests!) remember the movie fondly. “Of all the filming we have had at the hotel over the past 35 years, that is the movie that guests mention the most,” he says. “People love the movie, and all seem to know that is our pool area.” Curry continues, “The leadership team even watched the pool scene for inspiration as we look to renovate the pool area.” Simon Kunz and Lisa Ann Walter in The Parent Trap. Disney Picking locations for The Parent Trap, including the Marina Ritz, was an at times painstaking process, led by Enke, John Panzarella and Thomas Harrigan, among others. Enke, who had worked with Quaid on The Right Stuff years earlier, remembers dressing up an administration building on Treasure Island to look like the front of the grand hotel. Panzarella recalls spending time with revered production designer Dean Tavoularis while he and his family and friends, whom he’d brought on as crew, searched for locations and had laughter-filled lunches in between. “The decorator [Gary Fettis] was his nephew, the art director [Alex Tavoularis] was his brother and the prop master [Douglas T. Madison] was somebody he had worked with for years and years, and we'd all go out to lunch together. It was like the Tavoularis Mafia,” he tells PEOPLE with a laugh. “Dean would regale the table with incredible stories of Apocalypse Now and the making of The Godfather. It was just magic for me.” Nancy Meyers, Lindsay Lohan, screenwriter Charles Shyer on set of The Parent Trap, 1998. Walt Disney/courtesy Everett Collection Casting director Starger reflects on how the magic of making The Parent Trap reverberated out into the success of the movie. “It’s worth remembering that this was Nancy Meyers’ first film as a director, and she did a superb job. It’s a film which seems to appeal to all genders and ages, and it has stood the test of time in that audiences still enjoy it,” she tells PEOPLE. “I always smile when I’m on a plane and notice, on a screen by someone else’s seat, that they are watching this movie!” The familial vibe on set spread into the cast’s real-life connections and into the legacy of the movie, too. “I'm very close with Nancy Meyers now, and I was close with Charles. They were like a second family to me,” Lohan says. At the end of the director’s commentary, as the credits play, Shyer says something particularly poignant to hear today. “If we get lucky, this could be one that lasts,” he remarks as the final credits roll. And lasted it has, in ways far beyond the cast and crew’s imagination. Close Leave a Comment Read more: Entertainment Movies Comedy Movies"
    },
    {
      "url": "https://www.usatoday.com/story/entertainment/celebrities/2025/07/31/lindsay-lohan-premiere-fashion-freaky-friday-parent-trap/85466417007/",
      "text": "Lindsay Lohan channels 'Freaky Friday,' 'Parent Trap' roles with press tour looks: Photos\n\"Freakier Friday\" star Lindsay Lohan isn't just serving up nostalgia on the silver screen.\nThe Critics' Choice-nominated actress and former child star, whose starring roles in \"The Parent Trap,\" \"Freaky Friday\" and \"Mean Girls\" have made her synonymous with millennial pop culture, revisited some of her most iconic characters on the press tour for \"Freakier Friday,\" a sequel to the 2003 body-switching comedy starring Lohan and Jamie Lee Curtis.\nWhile attending the film's U.K. premiere in London on Thursday, July 31, Lohan sparkled in a sequined, lavender halter gown by Ludovic de Saint Sernin that mirrored the dress worn by \"Freaky Friday\" protagonist Anna Coleman in the film's closing scenes. She completed the look with a campy, guitar-shaped purse that paid homage to her character's musician background.\n\"London, You're the Ultimate!\" wrote Lohan on Instagram alongside a photo of the nostalgic look, also referencing the soundtrack theme song \"Ultimate.\"\nAside from her fashion tributes, Lohan has also been reconnecting with her movie-making family amid the press tour. During the \"Freakier Friday\" Los Angeles premiere on July 22, Lohan posed for photos with Lisa Ann Walter and Elaine Hendrix, who starred with Lohan in her film debut \"The Parent Trap.\"\n\"Freakier Friday\" follows the mother-daughter duo of Tess (Curtis) and Anna Coleman as they endure another comical body switch with Anna's daughter Harper (Julia Butters) and soon-to-be stepdaughter Lily Davies (Sophia Hammons).\nAhead of the Disney flick's Aug. 8 release, check out Lohan's most nostalgic looks.\nLindsay Lohan goes rocker chic with Pink Slip tribute\nIn \"Freaky Friday,\" Lohan's character Anna serves as the guitarist for Pink Slip, an all-female rock band Anna forms with schoolmates Maddie (Christina Vidal) and Peg (Haley Hudson).\nDuring a July 28 outing in New York City's Madison Square Park, Lohan was spotted wearing a Pink Slip graphic T-shirt, which she paired with a black leather miniskirt and dark sunglasses.\n\"💖✨ Pink Slip energy in full effect,\" wrote Lohan in a July 26 Instagram post, in which she could be seen wearing the same band tee with a baby pink cardigan.\nLindsay Lohan recreates 'Freaky Friday' finale look\nOne of the most memorable scenes from \"Freaky Friday\" is when Anna — who had been struggling to accept Tess' fiancé Ryan (Mark Harmon) — performs a musical number for her mother and new stepfather at their nuptials after switching back places.\nGuitarist Anna, donning a lavender wrap dress, takes center stage for the performance, singing the sweet pop-rock banger \"Ultimate\" in dedication to the newlywed couple.\nLohan's U.K. premiere version of the look elevated the wedding frock with its elegant, sequined beading and silver halter collar.\nLindsay Lohan is a preppy princess with 'Parent Trap' homage\nLohan, who starred as identical twins Annie James and Hallie Parker in 1998's \"The Parent Trap,\" paid tribute to British twin Annie with a preppy ensemble while in New York City on July 28.\nThe actress looked posh in a yellow plaid, tweed dress by Balmain, which she paired with canary Jimmy Choo heels and a black Hermès bag. The outfit struck an undeniable resemblance to the look Annie wears while departing summer camp.\n\"Annie James energy with a Freakier Friday Twist 💛,\" Lohan wrote on Instagram.\nLindsay Lohan serves up double dose of 'Parent Trap' nostalgia\nIn true twinning fashion, Lohan served up another \"Parent Trap\" homage during a July 28 appearance on \"Live with Kelly and Mark.\"\nThe actress wore a multicolored, short-sleeved dress by Roberto Cavalli that resembled the floral number that Hallie wears as she and sister Annie attempt to reunite their divorced parents with a romantic dinner.\n\"A little shine, a little silk, a lot of love and some inspo from Hallie Parker 😉💚💜,\" Lohan wrote on Instagram.\nLindsay Lohan pays tribute to 'Sex and the City' glam with Carrie Bradshaw-inspired look\nLohan may not have hung around with Carrie Bradshaw in the late '90s, but the ladies are birds of a feather in the fashion department.\nThe \"Freakier Friday\" star took a page from Bradshaw's style book at the film's New York City premiere on July 28. Lohan donned a white Jacquemus dress featuring a poofy tulle skirt, a whimsical ensemble reminiscent of \"Sex and the City\" star Sarah Jessica Parker's iconic tutu dress in the show's opening sequence.\n\"Freakier Friday feels with a little family love and a nod to Carrie Bradshaw 🗽✨,\" Lohan wrote on Instagram."
    },
    {
      "url": "https://www.usatoday.com/story/entertainment/movies/2023/07/28/the-parent-trap-cast-where-are-they-now-lindsay-lohan/70477057007/",
      "text": "Revive that handshake: 'The Parent Trap' is 25! See Lindsay Lohan and cast then and now\nWhile it might sound as absurd as two divorced parents splitting up and raising their identical twins as only children, the Lindsay Lohan version of “The Parent Trap” turns 25 on Saturday.\nAs Hayley Mills did in the original 1961 movie − which inspired the 1998 remake − Lohan portrayed the pair of siblings scheming to get their parents back together upon realizing they have a twin. Dennis Quaid and Natasha Richardson play Annie and Hallie’s parents, Nick Parker and Elizabeth James. The twins’ mission of reuniting their parents was made all the harder by Nick’s fiancée Meredith Blake (Elaine Hendrix), who taught audiences that “Being young and beautiful is not a crime, you know.”\nIn celebration of the anniversary, put on a pot of Chessy’s chili as we dive into what the film’s stars have been up to lately.\nLindsay Lohan\nLohan has gone from parent trapper who discovers she has a long-lost sister to parent herself: The 37-year-old actress and her husband, financier Bader Shammas, have welcomed their first child, the couple confirmed to USA TODAY earlier this month. They wed in 2022 and named their son Luai, meaning “shield” or “protector” in Arabic.\nThough Lohan had a string of popular teen movies in the mid-2000s − “Freaky Friday,” “Confessions of a Teenage Drama Queen” and “Mean Girls” − her career stalled amid struggles with substance abuse.\nLohan moved to Dubai in 2014 and worked sporadically, mostly on TV series. Last November, Netflix announced a two-picture deal with the star. The first film, “Falling for Christmas,” in which Lohan played a hotel heiress struck with amnesia, arrived that same month.\nLindsay Lohan is a mom! Actress welcomes first child with Bader Shammas\nDennis Quaid\nAfter Quaid played Nick, the man who could melt you just by saying “Lizzie,” he continued to have a steady career, with roles in “Any Given Sunday,” “Traffic,” “The Rookie,” “The Day After Tomorrow” and the remake of “Footloose.” He received an Emmy nod for his work on HBO’s “The Special Relationship” (2010) for his portrayal of Bill Clinton.\nIn recent years, Quaid has starred in numerous inspirational films, including “I Can Only Imagine,” “Blue Miracle” and “On a Wing and a Prayer.” This week, the 69-year-old released his Christian music album \"Fallen: A Gospel Record for Sinners.\" He told People that he had once again embraced his Christian upbringing.\nQuaid, who previously battled cocaine addiction, told the magazine: “When you're done with the addiction, you need something to fill that hole, something that really works, right?”\nNatasha Richardson\nFollowing her role as an elegant fashion designer in “The Parent Trap,” Richardson appeared in 2002’s “Maid in Manhattan,” starring Jennifer Lopez and Ralph Fiennes. Sadly, about a decade after “The Parent Trap,” Richardson died in 2009 at 45. While skiing in Québec, Richardson hit her head and refused to see a doctor. But she fell ill and her husband Liam Neeson made the decision to remove life support.\nQuaid remembered his co-star in a 2018 interview with Us Weekly. “She was such a beautiful person, such a beautiful, beautiful person. Just none of that, that actor stuff, prima donna stuff,” Quaid said. “Someone easy to work with and such a great sense of humor.”\n'Really special': Lindsay Lohan reflects on 'Parent Trap' experience in co-star reunion\nElaine Hendrix\nHendrix played the villain who thought she’d scored, landing a fiancé who owned a Napa Valley vineyard. With dreams of sending his maniacal twins to boarding school, Meredith was ultimately taken down by Annie and Hallie.\nFollowing “The Parent Trap,” Hendrix, 52, appeared in popular series like “Friends,” “ER” and “Two and a Half Men.” More recently, she portrayed Alexis Carrington on CW’s reboot of \"Dynasty.\"\nHendrix hasn’t strayed from referencing the iconic Meredith Blake over the years on social media. \"People loved to hate her,\" she told Insider in 2021, \"and now people just love her.\"\nLisa Ann Walter\nAfter playing the sharp housekeeper Chessy in “The Parent Trap,” Walter appeared on TV series like “Curb Your Enthusiasm,” “Nip/Tuck” and “Grey’s Anatomy.” Since 2021, the 59-year-old actress has played rough-around-the-edges teacher Melissa Schemmenti on ABC darling “Abbott Elementary.”\nWalter and Hendrix remain close after all these years. Hendrix dressed as Chessy for Halloween 2021. And Walter asked Hendrix to be her date for the Screen Actors Guild Awards in February."
    },
    {
      "url": "https://www.usatoday.com/story/entertainment/celebrities/2024/08/23/dennis-quaid-parent-trap-revival-natasha-richardson/74923528007/",
      "text": "A 'Parent Trap' revival? Dennis Quaid not sure it's possible without Natasha Richardson\nDennis Quaid is on board with a \"The Parent Trap\" revival — but the movie wouldn't be the same without a key character.\n\"That would be fantastic, but Natasha (Richardson). How do we do it without Natasha?\" he told Entertainment Tonight on the red carpet of his new film \"Reagan\" on Tuesday. Her sudden death at 45 years old in 2009 still \"breaks my heart,\" he added.\nIn the 1998 remake of the original \"The Parent Trap\" released in 1961, Quaid and Richardson played the parents of identical twins Annie and Hallie (played by Lindsay Lohan) who contrived a plot that brought the exes back together. Lisa Ann Walter — who recently said she'd \"love to go back for another version\" of the movie — played nanny Chessy, and Elaine Hendrix portrayed Quaid's villainous fiancée, Meredith Blake.\nLohan \"is really fantastic. She's grown into a beautiful person,\" Quaid said.\n\"'The Parent Trap' was, like, a whole new career for me,\" he continued. \"It's such a beautiful movie. And I think people will be watching that 100 years from now, I really do.\"\nRichardson died after a seemingly minor fall that led to a blow to the head while skiing at Quebec’s Mont Tremblant. The actress initially waved off medical care, but the head injury turned out to be fatal. She was survived by her husband, actor Liam Neeson, and their sons Micheál and Daniel, who were then 13 and 12, respectively.\nRichardson was part of the prominent Redgrave family, the daughter of Oscar, Emmy, Tony and Golden Globe winner Vanessa Redgrave and director Tony Richardson.\n“When that accident happened, it just devastated me and so many other people,” Quaid told Us Weekly in 2018. “She had such a beautiful love, married life with Liam, and two beautiful boys. She always had a smile on her face when she came to work. That really affected everyone around her.”\nTwenty-six years of 'The Parent Trap': See Lindsay Lohan and cast then and now\nLindsay Lohan cried when she caught her son watching 'The Parent Trap'\n\"The Parent Trap\" still holds a special place in Lohan's heart, too.\nIn 2020, director Nancy Meyers and Katie Couric reunited the cast over Zoom to reminisce and reenact scenes from the beloved film.\n\"Without this movie, I wouldn't have gotten the acting bug. How do you not want to only act for the rest of your life after doing a film like this?\" Lohan said in the video. \"It's timeless and special. Just really special.\"\nThe 26-year-old Disney film popped back up in Lohan's life in an unexpected way earlier this year when she caught her infant son Luai watching it on TV, she revealed on “The Drew Barrymore Show” in March.\n\"I just started to cry because I'm like, he doesn't even know that's mommy yet,” Lohan said. “I was like, do I turn it off? And he was kind of just staring. Because maybe my voice is still similar to how it was then, so I was like, maybe he knows a little bit that it's me ‘cause it sounds like me. But it was a really magical moment. I took tons of pictures of it.\"\nContributing: Bryan Alexander and Edward Segarra"
    },
    {
      "url": "https://www.usatoday.com/story/entertainment/celebrities/2025/08/03/joely-richardson-pamela-anderson-liam-neeson-natasha-richardson/85501305007/",
      "text": "Joely Richardson, sister of Natasha Richardson, gushes over Pamela Anderson, Liam Neeson\nWhile Pamela Anderson and Liam Neeson are staying mum on their alleged romance, the rumored couple seems to have gotten a stamp of approval from the family of Neeson's late wife.\nJoely Richardson, the sister of Natasha Richardson (who died in 2009), commented on Instagram photos that Anderson shared of herself and Neeson in celebration of the actors' new movie \"The Naked Gun.\"\nSeveral of the playful black-and-white photos show Anderson, 58, and Neeson, 73, goofing around with a popcorn bucket, while the Aug. 1 post's final two images see the costars engage in an impromptu photoshoot with a camera.\nMuch of the comments section was filled with congratulatory messages complimenting Anderson and Neeson's joint project, as well as their purported new couple status. \"I did not have Pam and Liam on my 2025 Bingo card … and I can't even describe the happiness I feel for them ❤️👏💕,\" @taraphotog wrote.\nRichardson joined in on the warm sentiment, commenting with string of red heart emojis: \"❤️❤️❤️❤️❤️❤️❤️.\"\nNeeson was married for 15 years to British actress Natasha Richardson, from 1994 until her death at age 45. The Richardson sisters are the daughters of Oscar-winning actress Vanessa Redgrave and director Tony Richardson. Joely, an actress in her own right, has appeared in the TV series \"Nip/Tuck\" and \"The Tudors,\" as well as the 1996 Disney film \"101 Dalmatians.\"\nNatasha, best known for her roles in \"The Handmaid's Tale\" movie, \"The Parent Trap\" and \"Maid in Manhattan,\" died after a seemingly minor fall while skiing at Quebec's Mont Tremblant. The actress initially waved off medical care, but her head injury turned out to be fatal. She and Neeson shared sons Micheál and Daniel.\nPamela Anderson, Liam Neeson spark romance rumors on 'Naked Gun' promotional tour\nAnderson and Neeson have been at the center of dating speculation as they promote \"The Naked Gun,\" a slapstick detective comedy starring Neeson as LA cop Frank Drebin Jr. and Anderson as his unexpected partner in crime, the femme fatale Beth.\nThe actors sparked romance rumors at the film's London premiere on July 22. As they posed at the red carpet's step-and-repeat, Anderson leaned up and gave Neeson a smooch on the side of his face. While taking photos with one of the film's producers, Anderson was also seen clasping Neeson's hand around her left hip.\nDays later, Anderson and Neeson poked fun at their flirty chemistry in a July 28 interview with \"Entertainment Tonight.\" As Anderson leaned in for a near-kiss from Neeson, an \"ET\" red-carpet reporter said they were \"so close,\" before Anderson said, \"Yeah, so close.\" Neeson chimed in, \"We're pros.\"\nThe following day, Anderson and Neeson were confronted about their affectionate dynamic during a July 29 interview on the \"Today\" show. Coanchor Craig Melvin bluntly asked the duo if they were dating: \"You're both single right now. There's clearly chemistry on display throughout this film. Are you two an item?\"\nWhile the pair balked at the question, Neeson conceded that he and Anderson \"discovered we had a lovely, budding chemistry as two actors\" during production on \"The Naked Gun.\"\nIn an Instagram post recapping the film's New York premiere July 29, Anderson's caption included a not-so-cryptic message of her own: \"Love is in the air.\"\nContributing: KiMi Robinson, Jay Stahl and Brian Truitt, USA TODAY"
    }
  ],
  "argos_summary": "Dennis Quaid's memorable pool scene in the 1998 film 'The Parent Trap' showcased his comedic talent, as he repeatedly fell into the pool while wearing multiple Armani suits, a challenge that costume designer Penny Rose noted due to the suits shrinking from chlorine exposure. The film, which grossed over $92 million, has become a beloved classic, with Quaid reflecting on its lasting impact on his career as he is often recognized for his role as Nick Parker. The Ritz-Carlton in Marina del Rey, where the scene was filmed, has since become a pop culture landmark, frequently mentioned by guests.",
  "argos_id": "Y3WH84ZF4"
}