{
  "url": "https://www.theguardian.com/commentisfree/2025/aug/11/the-guardian-view-on-rfk-jrs-vaccine-cuts-an-assault-on-science-from-a-politician-unfit-for-his-office",
  "authorsByline": "Editorial",
  "articleId": "18c9bd4647ff43cabe39f0d9dba9faa9",
  "source": {
    "domain": "theguardian.com",
    "paywall": false,
    "location": {
      "country": "gb",
      "city": "London",
      "coordinates": {
        "lat": 51.5073219,
        "lon": -0.1276474
      }
    }
  },
  "imageUrl": "https://i.guim.co.uk/img/media/8be2b7cfc85288bdc3c3985082a8a90d4f2071be/896_0_6827_5464/master/6827.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=6c373a198c9d6d587217bdb70cb997ed",
  "country": "gb",
  "language": "en",
  "pubDate": "2025-08-11T17:45:33+00:00",
  "addDate": "2025-08-11T20:15:57.302511+00:00",
  "refreshDate": "2025-08-11T20:15:57.302512+00:00",
  "score": 1.0,
  "title": "The Guardian view on RFK Jr’s vaccine cuts: an assault on science from a politician unfit for his office ",
  "description": "Editorial: The decision by the US health and human services secretary to remove mRNA research funding is ill-informed and dangerous",
  "content": "Science is not black and white. It’s more complicated and more exciting. It’s a constant process of exploration. An adventure into the unknown. Scientists come up with theories about what might be going on, and then test them. They don’t always get it right. Far from it. But inch by inch, testing, failing and trying again, they make progress.\n\nRobert F Kennedy Jr, during Senate confirmation hearings for the role of secretary at the Department of Health and Human Services (HHS), seemed to get that. Those who feared what a vaccine sceptic might do in that role breathed again. “I’m going to empower the scientists at HHS to do their job and make sure that we have good science that is evidence based … I’m not going to substitute my judgment for science,” he said.\n\nYet now, without good explanation or sound science, he is cutting $500m of research funding for mRNA vaccines, claiming that they “fail to protect effectively against upper respiratory infections like Covid and flu”. In fact, no Covid vaccine fully protects against infection, but they have been shown to prevent deaths in billions of people. The 22 contracts that will be cancelled include one with Moderna for a vaccine against bird flu, which many fear could trigger the next human pandemic (and there will be one). Instead, federal funds will go to vaccines developed in more traditional ways.\n\nEither Mr Kennedy lied to Congress or he has a different understanding of science and evidence from most scientists, unpicking what they thought was uncontestable. The childhood vaccine schedule is being reconsidered, and mandating the measles vaccine is being questioned in spite of fatal outbreaks in the US. He has sacked the Centers for Disease Control vaccine advisory panel and replaced it with many people known to have sceptical views.\n\nMr Kennedy is particularly hostile to the mRNA vaccines against Covid-19, panning them in 2021 as the “deadliest vaccines in history”, wrongly claiming that half those suffering the rare side-effect of myocarditis would die or need heart transplants within five years. The vast majority have quickly recovered. Until 2023, he chaired an anti-vaccine organisation called Children’s Health Defense, where he petitioned the Food and Drug Administration to rescind the licence of all Covid-19 vaccines and compared mandating vaccines to Nazi oppression in the second world war.\n\nThis is the stuff of internet scares; labyrinthine tangles of misinformation dotted with odd inaccurate nuggets of quasi-science. It doesn’t compare with the evidence base for mRNA vaccines, which went through clinical trials on hundreds of thousands of people and have since been used to vaccinate billions.\n\nExperts agree that the mRNA vaccines were a stunning breakthrough that allowed people to be protected in record time from Covid-19. They contain messenger RNA, a tiny bit of genetic code that teaches the immune system to fight the virus. No need to grow the virus in hen’s eggs, which takes months. The “plug and play” technology can be adapted against other viruses, such as flu, including some that devastate populations in poor countries. The inventors won the Nobel prize in 2023.\n\nMr Kennedy’s cancellation of funding not only stymies much research but also feeds worldwide doubt in mRNA vaccines. We are all the losers. Humanity needs these vaccines. Other countries need to step up with money and reassurance to try to heal this latest breach between science and nonsense. And Mr Kennedy is clearly unfit for the job he holds.",
  "medium": "Article",
  "links": [
    "https://www.theguardian.com/us-news/2025/aug/05/rfk-jr-hhs-mrna-vaccine-research",
    "https://www.finance.senate.gov/hearings/hearingto-consider-the-nomination-of-robert-f-kennedy-jr-of-california-to-be-secretary-of-health-and-human-services",
    "https://publichealthcollaborative.org/alerts/false-claims-that-covid-19-vaccines-are-the-most-deadly-vaccines-in-history/",
    "https://www.news-medical.net/health/Could-Bird-Flu-Be-the-Next-Global-Pandemic.aspx",
    "https://www.haaretz.com/us-news/2022-01-24/ty-article/.premium/robert-f-kennedy-jr-says-vaccine-mandates-harder-to-escape-than-nazi-persecution/0000017f-dc44-d3a5-af7f-feee56c50000",
    "https://www.scrippsnews.com/health/rfk-measles-vaccines-are-important-but-government-mandates-are-not-the-answer",
    "https://www.theguardian.com/science/2023/oct/02/scientists-whose-work-enabled-mrna-covid-vaccine-win-nobel-prize-for-medicine-katalin-kariko-drew-weissman"
  ],
  "labels": [
    {
      "name": "Opinion"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "mRNA vaccines",
      "weight": 0.11188001
    },
    {
      "name": "vaccines",
      "weight": 0.10327765
    },
    {
      "name": "good science",
      "weight": 0.07550915
    },
    {
      "name": "sound science",
      "weight": 0.07247085
    },
    {
      "name": "Science",
      "weight": 0.07156356
    },
    {
      "name": "science",
      "weight": 0.07156356
    },
    {
      "name": "many people",
      "weight": 0.06255378
    },
    {
      "name": "Mr Kennedy",
      "weight": 0.06228532
    },
    {
      "name": "RFK Jr’s vaccine cuts",
      "weight": 0.060748532
    },
    {
      "name": "Robert F Kennedy Jr",
      "weight": 0.060747184
    }
  ],
  "topics": [
    {
      "name": "Violence"
    }
  ],
  "categories": [
    {
      "name": "Health"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.986328125
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.76123046875
    },
    {
      "name": "/Health/Public Health/Health Policy",
      "score": 0.640625
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.384033203125
    },
    {
      "name": "/News/Health News",
      "score": 0.3662109375
    }
  ],
  "sentiment": {
    "positive": 0.04582373,
    "negative": 0.72383815,
    "neutral": 0.23033811
  },
  "summary": "Robert F Kennedy Jr, the former Secretary of Health and Human Services (HHS), has cut $500m of research funding for mRNA vaccines, claiming they fail to protect effectively against upper respiratory infections like Covid and flu. The 22 contracts that will be cancelled include one with Moderna for a vaccine against bird flu, which many fear could trigger the next human pandemic. Instead, federal funds will go to vaccines developed in more traditional ways. Critics argue that these vaccines have been shown to prevent deaths in billions of people. Kennedy's actions have been criticised as an assault on science and he is clearly unfit for his position.",
  "shortSummary": "Robert F Kennedy Jr's vaccine cuts undermine scientific credibility and undermine effectiveness, especially in protecting against potentially deadly viruses like Covid-19.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "1fccdd1a865648babb0a7627f3bf50e9",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.news-medical.net/health/Could-Bird-Flu-Be-the-Next-Global-Pandemic.aspx",
      "text": "Introduction\nRecent Developments\nWhy Experts Are Worried\nHow Prepared Are We?\nBarriers to a Pandemic\nWhat Needs to Happen Now\nReferences\nThe rapid spread of H5N1 from wild birds to mammals, and even humans, is raising the stakes in the fight against avian influenza. As experts warn of the virus’s pandemic potential, global action on surveillance, vaccine development, and One Health strategies has never been more urgent.\nImage Credit: ShishkinStudio / Shutterstock.com\nIntroduction\nH5N1, H5N6, and H7N9 are classified as highly pathogenic avian influenza viruses (HPAIVs) that belong to the influenza A genus. These viruses are characterized by surface proteins hemagglutinin (H) and neuraminidase (N), which determine their subtype and infectivity.2\nH5N1 was first identified in 1959 in Scotland, with the first cases of human transmission reported almost 40 years later in Hong Kong. Between 2003 and 2023, the World Health Organization (WHO) documented 878 human cases of H5N1 infection with 458 deaths reported across 23 countries.\nViral transmission typically occurs through close contact with infected birds or contaminated environments. Although human-to-human transmission is rare, the ability of H5N1 to infect mammals, including cats, dogs, seals, and even sea lions, raises concerns about its evolutionary potential.2\nThe continued spread among wild and domestic bird populations globally, along with sporadic human infections, highlights bird flu as a persistent and evolving global health threat.\nTransmission of Highly Pathogenic Avian Influenza (HPAI) H5N1 to Humans, Birds, and Other Animals and The Action of Adaptive and Innate Immune Response against HPAI H5N1. Represent the activation of the innate immune response upon detection of HPAI H5N1 viral components. This response includes the release of pro-inflammatory cytokines, such as Interferons (IFNs), and the recruitment of innate immune cells. The adaptive immune response, including both the humoral and cellular immune responses, triggered by HPAI H5N1 infection. This response involves the activation and proliferation of antigen-specific B cells, resulting in the production of virus-neutralizing antibodies and the activation of T cells, including both cytotoxic T lymphocytes (CTLs) and helper T cells. The figure shows interactions between adaptive and innate immune cells, such as the presentation of viral antigens by antigen-presenting cells (APCs) to activate T cells and the cooperation between B cells and T cells for the production of specific antibodies.2\nRecent Developments\nBetween December 2024 and March 2025, HPAIVs spread across 31 countries, with 743 cases detected in birds, predominantly of the H5N1 subtype, including poultry, wild birds, and captive birds, with notable outbreaks in waterfowl like mute swans and geese.\nThe spread of H5N1 to mammals, including domestic cats and wild carnivores in Europe, as well as nearly 1,000 dairy cattle farms, has been reported in 17 U.S. states. A recent genetic analysis identified a different H5N1 genotype of D1.1 in U.S. cattle, which suggests potential viral evolution. Human infections remain rare but notable, with 22 new cases reported globally, including a U.S. dairy worker infected in 2024.3 Global health authorities, including the WHO and U.S. Centers for Disease Control and Prevention (CDC), are increasingly concerned about the potential for mutation and wider transmission of avian influenza. Although human-to-human transmission has not been observed, continued surveillance and precautionary measures remain critical due to the rapid geographic spread of this virus and its occasional ability to cross the species barrier.3\nAvian influenza transmission flow from the natural reservoir (aquatic birds) to poultry, humans, and other animal species. Figure generated with BioRender.com8\nWhy Experts Are Worried\nBird flu strains like H5N1 exhibit genetic flexibility that could eventually allow these viruses to infect mammals more efficiently. Recent cases of bird flu spreading among mammals such as minks, sea lions, and cows have raised fears that the virus could adapt to sustained mammal-to-mammal transmission, which increases the risk of a future pandemic.4\nUnlike seasonal flu, which regularly circulates and allows populations to build partial immunity, avian strains remain largely unfamiliar to the human immune system. Furthermore, current human flu vaccines are not designed to protect against bird flu variants.4\nScientists warn what future bird flu mutations could mean for people | 60 Minutes\nHow Prepared Are We?\nSurveillance systems for detecting avian influenza in birds, livestock, and humans exist in many countries. However, these strategies are often not equipped to identify outbreaks in unexpected species or under unusual circumstances. As a result, local reporting plays a crucial role in capturing early warning signs.\nAlthough most strains of H5N1 are sensitive to antiviral drugs such as oseltamivir, clinical guidelines for treating avian influenza are limited and the available evidence remains weak. Stockpiling antivirals and personal protective equipment, as well as enhancing laboratory capacity, especially in lower-resource settings, is essential.5\nVaccine development infrastructure exists, with the WHO equipped with the capabilities needed to rapidly update candidate vaccine viruses in the event of an emergency situation. However, as evident during coronavirus disease 2019 (COVID-19) pandemic, equitable access and timely production of novel vaccines remain major challenges.\nThe early response to COVID-19 exemplifies the consequences of fragmented communication and uncoordinated actions. To avoid repeating these mistakes, global and national authorities must prioritize data sharing, rapid research, and clear communication between animal and public health sectors, ideally under a unified One Health framework.5\nStay current—read over 1,100 news stories on bird flu’s evolving global impact\nBarriers to a Pandemic\nMost human cases of bird flu arise from direct contact with infected birds, particularly during culling, handling, or live poultry markets. In these environments, especially in densely populated regions where humans and animals closely coexist, opportunities for interspecies transmission increase. Nevertheless, human-to-human transmission remains extremely rare and limited to isolated instances, which suggests that the virus is not well-adapted to human hosts.6\nA single amino acid mutation in the H5 hemagglutinin protein can alter its receptor-binding properties, potentially allowing the virus to infect human cells more efficiently. This genetic shift could break existing species barriers.\nContinuous monitoring of these mutations is crucial, as changes in the virus’s genome, particularly those affecting how it binds to human receptors, could eventually lead to sustained human transmission.6\nWhat Needs to Happen Now\nTo reduce the risk of a bird flu pandemic, global disease monitoring systems must be strengthened to ensure early detection of outbreaks and viral mutations. This includes building and maintaining robust veterinary and public health surveillance infrastructures, especially in regions with close human-animal interaction.\nMany developing countries lack the laboratory capacity and trained personnel needed for timely diagnosis and reporting of avian influenza in poultry and wild animals, which are primary reservoirs of the virus.\nExisting human influenza vaccines offer limited protection against avian strains like H5N1 or H7N9; therefore, investing in bird flu-specific vaccine research and production is crucial.\nEducating frontline workers, including farmers, animal health technicians, and veterinary professionals, is vital. Training programs can improve outbreak response, enhance biosecurity, and reduce the likelihood of animal-to-human transmission.7\nReferences\n-\nPalù, G., Roggero, P. F., & Calistri, A. (2024). Could H5N1 bird flu virus be the cause of the next human pandemic? Frontiers in Microbiology, 15, 1477738. DOI: 10.3389/fmicb.2024.1477738, https://www.frontiersin.org/journals/microbiology/articles/10.3389/fmicb.2024.1477738/full\n-\nCharostad, J., Rezaei Zadeh Rukerd, M., Mahmoudvand, S., Bashash, D., Hashemi, S. M. A., Nakhaie, M., & Zandi, K. (2023). A comprehensive review of highly pathogenic avian influenza (HPAI) H5N1: An imminent threat at doorstep. Travel Medicine and Infectious Disease, 55, 102638. DOI: 10.1016/j.tmaid.2023.102638, https://www.sciencedirect.com/science/article/pii/S1477893923000984\n-\nAlexakis, L., Buczkowski, H., Ducatez, M., Fusaro, A., Gonzales, J. L., Kuiken, T., Ståhl, K., Staubach, C., Svartström, O., Terregino, C., Willgert, K., Melo, M., & Kohnle, L. (2025). Avian influenza overview December 2024–March 2025. EFSA Journal, 23(4), e9352. DOI: 10.2903/j.efsa.2025.9352, https://efsa.onlinelibrary.wiley.com/doi/abs/10.2903/j.efsa.2025.9352\n-\nDey, P., Ahuja, A., Panwar, J., Choudhary, P., Rani, S., Kaur, M., Sharma, A., Kaur, J., Yadav, A. K., Sood, V., Suresh Babu, A. R., Bhadada, S. K., Singh, G., & Barnwal, R. P. (2023). Immune Control of Avian Influenza Virus Infection and Its Vaccine Development. Vaccines, 11(3), 593. DOI: 10.3390/vaccines11030593, https://www.mdpi.com/2076-393X/11/3/593\n-\nKojima N, Adlhoch C, Mitja O, Dat VQ, Lescano AG, Klausner JD. Building global preparedness for avian influenza. Lancet. 2024 Jun 8;403(10443):2461-2465. DOI: 10.1016/S0140-6736(24)00934-6. https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(24)00934-6/fulltext\n-\nMittal N, Medhi B. The bird flu: a new emerging pandemic threat and its pharmacological intervention. Int J Health Sci (Qassim). 2007 Jul;1(2):277-83. PMID: 21475439; PMCID: PMC3068632, https://pmc.ncbi.nlm.nih.gov/articles/PMC3068632/\n-\nJonas, O., & Warford, L. (2014). Global program for Avian Influenza control and human pandemic preparedness and response: project accomplishments. Health, Nutrition and Population (HNP) Discussion Paper Series, (94043) https://documents1.worldbank.org/curated/en/527421468329073537/pdf/940430WP0Box385430B0GPAI0Final00PUBLIC0.pdf\n-\nGraziosi, G., Lupini, C., Catelli, E., & Carnaccini, S. (2023). Highly Pathogenic Avian Influenza (HPAI) H5 Clade 2.3.4.4b Virus Infection in Birds and Mammals. Animals, 14(9), 1372. DOI: 10.3390/ani14091372, https://www.mdpi.com/2076-2615/14/9/1372"
    },
    {
      "url": "https://www.finance.senate.gov/hearings/hearingto-consider-the-nomination-of-robert-f-kennedy-jr-of-california-to-be-secretary-of-health-and-human-services",
      "text": "Hearing to consider the nomination of Robert F. Kennedy, Jr., of California, to be Secretary of Health and Human Services\nAgenda\nWe encourage the public to utilize the Committee’s livestream of the hearing, available on the website at https://www.finance.senate.gov/\nAn overflow space will be provided in 215 of the Dirksen Senate Office Building\nMember Statements\n- Mike Crapo (R - ID)\n- Ron Wyden (D - OR)\nWitnesses\n-\nRobert F.\nKennedy, Jr.\nof California, to be Secretary of Health and Human Services\n- Download Testimony\n- Responses to Questions for the Record to Robert F. Kennedy, Jr. Part 1\n- Responses to Questions for the Record to Robert F. Kennedy, Jr. Part 2\n- Responses to Questions for the Record to Robert F. Kennedy, Jr. Part 3\n- Further Responses to Questions for the Record to Robert F. Kennedy, Jr.\n- Further Response to Senator Wyden Question for the Record to Robert F. Kennedy, Jr.\nHow do I submit a statement for the record?\nAny individual or organization wanting to present their views for inclusion in the hearing record should submit in a Word document, a single-spaced statement, not exceeding 10 pages in length. No other file type will be accepted for inclusion. Title and date of the hearing, and the full name and address of the individual or organization must appear on the first page of the statement. Statements must be received no later than two weeks following the conclusion of the hearing. Non-compliant submissions will not be accepted. Submissions are not reviewed by policy staff.\nStatements can be emailed to:\nStatementsfortherecord@finance.senate.gov\nStatements can be mailed (not faxed) to:\nSenate Committee on Finance\nAttn. Editorial and Document Section\nRm. SD-219\nDirksen Senate Office Bldg.\nWashington, DC 20510-6200"
    },
    {
      "url": "https://www.scrippsnews.com/health/rfk-measles-vaccines-are-important-but-government-mandates-are-not-the-answer",
      "text": "As measles cases surge throughout the U.S., Health and Human Services Secretary Robert F. Kennedy Jr. is encouraging people to get vaccinated against the disease.\nKennedy, who has given mixed messages about his support for the vaccine, said his position and the federal government's stance are that the government should not be mandating people to get the vaccine.\n\"We encourage people to get the measles vaccine,\" Kennedy told CBS News. \"The federal government's position, my position, is that people should get the measles vaccine, but the government should not be mandating that.\"\nKennedy suggested his views on vaccines have been misinterpreted.\nRELATED STORY | As measles spreads to another state, how early can babies be vaccinated?\n\"I always said during my campaign and in every public statement I've made, 'I'm not gonna take people's vaccines away from them,'\" Kennedy said. \"What I'm gonna do is make sure that we have good science so that people can make an informed choice.\"\nThe World Health Organization says that herd immunity against measles can be reached when a community achieves a 95% vaccination rate. U.S. health officials estimate that 92.7% of kindergarten students were vaccinated last school year.\nBut the data might not include all children in that age group since various states have different requirements for vaccinations to enroll in school.\nThe Centers for Disease Control and Prevention (CDC) said that it has identified six measles outbreaks in the United States so far in 2025. A measles outbreak is declared when there are three or more related cases.\nThe CDC says it has identified 607 measles cases this year in the U.S. The agency reported that only 3% of those with confirmed cases had a known measles vaccine.\nThe largest outbreak has been reported in Texas, where 505 cases have been cited this year.\nRELATED STORY | Second child died from measles-related causes in West Texas, where cases are nearing 500\nSeventy-four of the 607 cases resulted in hospitalization, the CDC said. Forty-two of the hospitalizations were among children under age 5. Children are routinely vaccinated for measles at 12 to 15 months and again at 4 to 6 years of age — before going to kindergarten — but children as young as 6 months old can receive the measles vaccine if they are at risk.\nAccording to the CDC, measles causes the following symptoms:\n- Pneumonia\n- Brain Damage\n- Blindness\n- Deafness\n- Diarrhea\n- Premature birth or low-birthweight baby (in unvaccinated pregnant women who contract measles during pregnancy)\n- Measles infection leads to loss of immunity to other deadly diseases."
    },
    {
      "url": "https://www.theguardian.com/science/2023/oct/02/scientists-whose-work-enabled-mrna-covid-vaccine-win-nobel-prize-for-medicine-katalin-kariko-drew-weissman",
      "text": "Two scientists have been awarded the 2023 Nobel prize in physiology or medicine for their contributions to RNA biology that contributed to the unprecedented rate of vaccine development during the Covid pandemic.\nProf Katalin Karikó and Prof Drew Weissman share the 11m Swedish kronor (£823,000) prize announced on Monday by the Nobel Assembly at the Karolinska Institute in Stockholm.\nThe Nobel committee awarded the prize for their discoveries concerning “nucleoside base modifications that enabled the development of effective mRNA vaccines against Covid-19”.\nThese vaccines work by smuggling the genetic instructions for making viral proteins into our cells, enabling them to churn out large amounts of this protein and prime the immune cells to fight the virus.\nA significant obstacle in the development of such vaccines was early prototypes of these synthetic mRNAs provoked inflammatory reactions, making them unsuitable for medical use.\nTogether, Karikó and Weissman discovered that by making small chemical tweaks to the mRNA molecules, they could not only abolish these unwanted inflammatory responses, but also markedly increased production of the target protein. This approach became the basis for the Pfizer and Moderna vaccines.\nProf John Tregoning, a vaccine immunologist at Imperial College London, said: “They demonstrated that changing the type of the RNA nucleotides within the vaccine altered the way in which cells see it. This increased the amount of vaccine protein made following the injection of the RNA, effectively increasing the efficiency of the vaccination: more response for less RNA.\n“This was a vital building block of the success of the RNA vaccines in reducing disease and death during the pandemic.”\nProf Robin Shattock, also at Imperial College London, added that these discoveries “will be key to the successful use of future RNA vaccines and new RNA-based medicines”.\nKarikó, a research professor at the University of Szeged in Hungary and external consultant to BioNTech in Germany, was said to be “overwhelmed” by the announcement – particularly as she endured decades of scepticism over her work, and was even demoted by the University of Pennsylvania in the mid-90s because of the lack of funding she was generating for her research. She is still an adjunct professor at the university’s Perelman school of medicine.\nKarikó grew up in a small town in central Hungary, where her family lived in a single room with no running water, no refrigerator and no television. After gaining a postdoc at the Hungarian Academy of Sciences in Szeged, she sold her car, sewed the money into her daughter’s teddy bear and moved her family to Philadelphia, US.\nShe met Weissman, now a professor of vaccine research at the Perelman school of medicine, in the late 1990s over a departmental photocopier at the University of Pennsylvania, where Karikó was printing research papers. The pair struck up a partnership and began investigating mRNA as a potential therapeutic, initially using Weissman’s funding to finance their experiments.\nKarikó previously told the Guardian she never doubted that their approach would work. “I always wished that I would live long enough to see something that I’ve worked on be approved,” she said.\nBioNTech and Moderna licensed the modified mRNA technology developed by Karikó and Weissman for their vaccines. Weissman has gone on to develop RNA vaccine candidates against flu, herpes and HIV.\nSpeaking at the announcement of the prize in Stockholm on Monday, the chair of the Nobel committee, Prof Gunilla Carlsson, stressed that their discovery was critical for making the mRNA vaccine platform suitable for clinical use, rapidly, when it was most needed. “I think in terms of saving lives, especially in the early phase of the pandemic, it was very important,” she said.\nKarikó and Weissman’s work has previously been recognised with the £2.2m Breakthrough prize and numerous other international awards."
    }
  ],
  "argos_summary": "Robert F. Kennedy Jr., during his Senate confirmation hearings for the Department of Health and Human Services, expressed a commitment to empowering scientists and evidence-based science. However, he has since proposed cutting $500 million in research funding for mRNA vaccines, claiming they are ineffective against respiratory infections, despite evidence showing they prevent deaths. This decision, along with his controversial views on vaccines, raises concerns about his fitness for the role and contributes to growing skepticism about mRNA vaccines, which have been crucial in combating COVID-19.",
  "argos_id": "YM0F0KSSK"
}