{
  "url": "https://www.seattletimes.com/nation-world/trump-weighs-taking-steps-to-decriminalize-marijuana/",
  "authorsByline": "Dave Goldiner",
  "articleId": "fb8063b5f1b84c86a1fb9cd29e539fcb",
  "source": {
    "domain": "seattletimes.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "WA",
      "county": "King County",
      "city": "Seattle",
      "coordinates": {
        "lat": 47.6038321,
        "lon": -122.330062
      }
    }
  },
  "imageUrl": "https://images.seattletimes.com/wp-content/uploads/2025/08/08112025_DJTgetty-tzrAug11_tzr_151347.jpg?d=1200x630",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T15:19:22-07:00",
  "addDate": "2025-08-11T22:48:04.146015+00:00",
  "refreshDate": "2025-08-11T22:49:22.218260+00:00",
  "score": 1.0,
  "title": "Trump weighs taking steps to decriminalize marijuana",
  "description": "Acknowledging potential divisions, the president said he will likely decide in coming weeks whether to reduce the official assessment of the danger of pot.",
  "content": "President Donald Trump on Monday said his administration is considering rescheduling marijuana on the federal level, a move that would amount to a big step toward decriminalization of weed nationwide.\n\nAcknowledging potential divisions over the step, Trump said he will likely decide in coming weeks whether to reduce the official assessment of the danger of marijuana.\n\n“It’s a very complicated subject,” he said at a White House press conference, pushing back against the suggestion that reclassification could seem weak on crime. “I’ve heard great things having to do with medical and bad things having to do with just about everything else.”\n\nTrump effectively confirmed a Wall Street Journal report from Friday that said the White House might reclassify marijuana from a Schedule I to a Schedule III drug, meaning it would be considered to have some medical uses and be much less likely to cause dependence than it was before.\n\nSchedule I drugs includes heroin and cocaine, while Schedule III includes steroids and Tylenol with codeine.\n\nReclassification would allow marijuana companies to fall under different tax regulations and encourage investment in the $80 billion legal weed market, among other benefits.\n\nCannabis company stocks soared Monday, with several stocks and funds that track the pot business shooting up by 10% or more.\n\nThe move to decriminalize would amount to a promise kept by Trump who said during the presidential campaign that he would move to “end needless arrests and incarcerations of adults for small amounts of marijuana for personal use.”\n\nThe president said he also voted for a 2024 state referendum that would have legalized marijuana in Florida. The measure won 56% support but failed to clear the 60% mark needed for adoption.\n\nPublic opinion has shifted over the years to dramatically favor mostly legalizing marijuana as many states have moved to permit the use of weed for both medical and recreational purposes.\n\nBut some conservatives, including within Trump’s loyal MAGA base, argue that weed fuels other criminal behavior and is a gateway to use of other harder drugs.",
  "medium": "Article",
  "links": [
    "https://www.cnbc.com/2025/08/11/cannabis-stocks-trump-considering-reclassification-weed.html",
    "https://www.politico.com/news/2025/08/11/trump-marijuana-reclassification-decision-00503684?utm_source=firefox-newtab-en-us",
    "https://www.pewresearch.org/politics/2024/03/26/most-americans-favor-legalizing-marijuana-for-medical-recreational-use/",
    "https://www.usatoday.com/story/news/politics/2025/08/11/trump-considering-reclassifying-marijuana/85610334007/",
    "https://tribunecontentagency.com/",
    "https://www.wsj.com/politics/policy/trump-marijuana-federal-drug-classification-01a73b8c?gaa_at=eafs&gaa_n=ASWzDAir-AdxdoD1tFgkZ07sWzM12Qirf4Kftbg8Jz0-Ojy9mZZNsPFokB-6OkZWZ3A%3D&gaa_ts=689a3525&gaa_sig=TkACJfkxB4EIDIrKRAz6xozH7iOupbVvL1tcVPymxzBiN856ysAV7hKYMRp62aJxYJiuRUOvKnHv-0t-dy6m1Q%3D%3D",
    "https://nydailynews.com",
    "https://www.wusf.org/politics-issues/2024-11-05/florida-voters-reject-ballot-initiative-legalize-recreational-marijuana"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "marijuana companies",
      "weight": 0.09837079
    },
    {
      "name": "marijuana",
      "weight": 0.08982247
    },
    {
      "name": "Donald Trump",
      "weight": 0.080304466
    },
    {
      "name": "Trump",
      "weight": 0.07852249
    },
    {
      "name": "President Donald Trump",
      "weight": 0.07813513
    },
    {
      "name": "other harder drugs",
      "weight": 0.073908344
    },
    {
      "name": "Cannabis company stocks",
      "weight": 0.070165
    },
    {
      "name": "personal use",
      "weight": 0.07011251
    },
    {
      "name": "White House",
      "weight": 0.069655396
    },
    {
      "name": "other criminal behavior",
      "weight": 0.06775692
    }
  ],
  "topics": [
    {
      "name": "Cannabis"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.86328125
    },
    {
      "name": "/Sensitive Subjects/Recreational Drugs",
      "score": 0.734375
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.65625
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.4736328125
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Drug Laws & Policy",
      "score": 0.408935546875
    }
  ],
  "sentiment": {
    "positive": 0.16817063,
    "negative": 0.44177443,
    "neutral": 0.39005497
  },
  "summary": "President Donald Trump is considering rescheduling marijuana on the federal level, a move that could lead to the decriminalization of the drug. The move would allow marijuana companies to fall under different tax regulations and stimulate investment in the $80 billion legal weed market. However, some conservatives argue that marijuana fuels other criminal behavior and is a gateway to other harder drugs. The president confirmed a report that the White House might reclassify marijuana from a Schedule I to a Schedule III drug, making it considered to have some medical uses and less likely to cause dependence.",
  "shortSummary": "President Donald Trump is considering rescheduling marijuana from Schedule I to Schedule III, potentially paving the way for nationwide decriminalization of marijuana.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "0cbabc1ffbb54400b884fc097324aba2",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.cnbc.com/2025/08/11/cannabis-stocks-trump-considering-reclassification-weed.html",
      "text": "Cannabis stocks rallied Monday after President Donald Trump said he is considering reclassifying marijuana, which would categorize it as less of a danger to public safety.\nCanopy Growth soared more than 26%, while Tilray Brands skyrocketed more than 41% in its best day since 2021. Cronos Group jumped around 16% and hit a new 52-week high.\nThe AdvisorShares Pure U.S. Cannabis ETF (MSOS) surged around 28%, marking its best day since 2022. The Amplify Alternative Harvest ETF (MJ) recorded its biggest one-day gain on record, rising more than 26%.\n\"We're looking at reclassification,\" Trump told reporters Monday during a press conference to announce the deployment of the National Guard to Washington, D.C. \"We'll make a determination ... over the next few weeks.\"\n\"It's a very complicated subject,\" he added.\nPenny stocks\nMany stocks in the sector now sell for less than a dollar per share, meaning a move of just a few cents can lead to a large percentage change. Despite Monday's rally, many of these stocks are far below their all-time highs.\nShares of publicly traded pot growers and distributors surged before the press conference after a Wall Street Journal report late Friday, citing people familiar with the matter, said Trump was considering changing marijuana to a less-dangerous drug classification. Trump disclosed he was considering such a move during a fundraiser at his New Jersey golf club earlier this month, the people said.\nUnder federal law, cannabis is currently classified as a Schedule I drug in a group that also includes heroin and cocaine. Previously, reclassification discussions have centered on moving the drug to Schedule III, a class that includes steroids and Tylenol with codeine.\nReclassification would allow marijuana companies to fall under different tax regulations and encourage investment interest, among other benefits.\nYearlong process\nTilray CEO Irwin Simon told CNBC he expects the process of reclassification to take about a year. Trump discussing the matter publicly, and saying he plans to make a decision in coming weeks, is cause for optimism in the industry, Simon said.\n\"Trump gets things done,\" Simon said. \"He wouldn't be talking about it ... if he's not going to get something done.\"\nTrump's backing can brighten the outlook, but technically he cannot reclassify the drug alone. The Controlled Substances Act places that authority under the Attorney General, who historically has delegated it to the administrator of the Drug Enforcement Administration.\nA move from Schedule I to Schedule III would be \"a game changer\" for the roughly $80 billion market, Tim Seymour, investing chief at Seymour Asset Management, said on CNBC's \"Worldwide Exchange\" on Monday. He noted that such a change seems to have bipartisan support.\n\"It does not mean that it won't be a complicated trade,\" Seymour said. \"But it does mean that you're investing now well ahead of a lot of institutional capital if you are, in fact, investing into this sector.\""
    },
    {
      "url": "https://www.usatoday.com/story/news/politics/2025/08/11/trump-considering-reclassifying-marijuana/85610334007/",
      "text": "Trump says he's looking at reclassifying marijuana at federal level\nIn 2024, DEA proposed a rule to transfer marijuana to Schedule III. That rule change has been on hold since March 2025.\nPresident Donald Trump said his administration is considering reclassifying marijuana as a less dangerous drug.\n\"We're looking at reclassification and we'll make a determination over the next few weeks,\" Trump said at news conference August 11.\nThough 45 states have legalized the use of marijuana for medicinal or recreational use, the federal government still classifies it as a Schedule I drug.\nSchedule I drugs are defined as highly dangerous, addictive and without medical use. Marijuana has belonged to this class of drugs since the Controlled Substances Act was signed in 1970. If reclassified, marijuana would be treated the same as drugs like Tylenol with codeine and anabolic steroids, which can be prescribed by licensed health care providers and dispensed by licensed pharmacies.\nReclassifying marijuana would be the biggest change in marijuana policy the federal government has taken since the drug was first outlawed, but it would not make recreational usage legal under federal law.\nThe move began in 2022, when then-President Joe Biden asked the Department of Health and Human Services and the Drug Enforcement Administration to review how marijuana is scheduled. In 2023, Health and Human Services recommended that marijuana be moved to Schedule III. In 2024, DEA proposed a rule to transfer marijuana to Schedule III. That rule change has been on hold since March 2025.\nTrump said the decision is complicated, weighing the benefits of marijuana use for medical reasons against potential societal impacts.\n\"Some people like it, some people hate it. Some people hate the whole concept of marijuana,\" he said."
    },
    {
      "url": "https://tribunecontentagency.com/",
      "text": "Delivery site\nTribune News Service\nTribune Premium Content\nTribune SmartContent\nTCA Health\n- Syndicated content from the world’s experts\n- Information libraries from Mayo Clinic and Harvard Health\nTCA Video Network\n600 OF THE WORLD’S BEST CONTRIBUTORS\nServing 2,000 clients around the globe\nCREATE A FOLLOWING\nTribune Content Agency builds audience\nOur content engages millions of readers in 75 countries every day\nREQUEST A TOUR\nContact us to find out how premium content can engage your audience.\nUPDATES\n- Features newly added to Tribune Content Agency’s roster\n- Kevin Kreneck: 40 Years of Editorial Artistry\n- Gil Thorp comic strip welcomes Rachel Merrill as new artist\n- Careers Now column welcomes new expert: Vicki Salemi takes the helm\n- A Farewell to “Ask Amy,” A Welcome to “Asking Eric”\n- Broom-Hilda Sweeps Up Guinness World Record for Longest Running Daily Cartoon Strip by a Single Author\n- 40 Years of Distinguished Commentary: Cal Thomas’ Legacy of Insight\n- New games from Bulls\n- Welcome to the team! Gil Thorp comic strip welcomes new author Henry Barajas\n- Tribune Content Agency is pleased to announce Patti Varol as editor of the Los Angeles Times Crossword\n- 24/7 Wall Street: slideshows based on data-driven journalism\n- Nick Anderson joins TCA Editorial Cartoon Service"
    },
    {
      "url": "https://www.wusf.org/politics-issues/2024-11-05/florida-voters-reject-ballot-initiative-legalize-recreational-marijuana",
      "text": "A $150 million-plus effort to allow recreational use of marijuana in Florida fizzled out Tuesday, falling short of the needed 60 percent voter approval and delivering a major victory for Gov. Ron DeSantis.\nTrulieve, the state’s largest medical marijuana operator, pumped nearly $144.6 million into the proposed constitutional amendment. The Quincy-based company’s contributions made up more than 94 percent of the overall total of $152.27 million in cash raised by the Smart & Safe Florida political committee that sponsored the measure, which appeared as Amendment 3 on the ballot.\nThe drive to authorize recreational weed came eight years after voters overwhelmingly approved a constitutional amendment allowing medical marijuana. More than 800,000 Florida patients are enrolled in the medical marijuana program.\nRELATED: How the Tampa Bay area voted in key state local, state races\nRELATED: How Florida voted on constitutional amendment proposals\nRELATED: How Florida voted on the U.S. State and House seats\nRELATED: Trump wins White House. How Florida voted for president\nBut this year’s proposed amendment faced unprecedented opposition from the state’s most powerful elected official — DeSantis — who launched a crusade to defeat Amendment 3 and another ballot measure, Amendment 4, aimed at enshrining abortion rights in the state constitution. The abortion amendment also fell short of the required 60 percent voter support.\nDeSantis blitzed the state and the airwaves blasting the pot and abortion amendments. His chief of staff, James Uthmeier, chaired two committees that raised more than $30 million to fight the two proposals.\n“We fought the good fight, we kept the faith, and we finished the race. Thanks to @GovRonDeSantis and our great team for everything they sacrificed over the past months to protect our great state from amendments that sought to attack our families and way of life. To other states facing these challenges — you can win, but you must fight!” Uthmeier posted on the social media platform X.\nAmendment 3 would have given Trulieve and the state's other medical marijuana companies the ability to start selling euphoria-inducing cannabis products to adults in Florida, including tourists, age 21 or older. With 156 retail locations throughout the state, Trulieve sells more than a third of all medical marijuana products — including smokable marijuana — in the state.\nDeSantis targeted contributions by Trulieve, which is publicly traded on the Canadian stock market, as he fought the proposed amendment. The governor argued that the proposal’s passage would cement the company’s “monopoly” on the cannabis market in Florida.\n“I don’t think there’s ever been one company that’s put in this much money for one ballot measure in all of American history. And so the only way they can justify that is because this amendment is going to guarantee them a massive profit stream,” DeSantis said at a rally-style event last week.\nWith 99% of the vote counted, the state Division of Elections website showed that nearly 56 percent of voters supported the proposal — not enough to meet the 60 percent approval threshold.\n\"Tonight, a strong majority of Floridians voted in support of legalizing recreational marijuana for adults. While the results of Amendment 3 did not clear the 60 percent threshold, we are eager to work with the governor and legislative leaders who agree with us on decriminalizing recreational marijuana for adults, addressing public consumption, continuing our focus on child safety, and expanding access to safe marijuana through home grow,” the Smart & Safe Florida committee said in a statement.\nOpponents of the proposal, however, cheered its demise.\n“Even after spending over $150 million – the most in any drug legalization effort in American history – the people of Florida saw through Amendment 3’s web of deception and defeated this corporate power grab,” Jessica Spencer, director of advocacy for the Vote No on 3 Campaign, said in a statement.\nMark Wilson, president and CEO of the Florida Chamber of Commerce, called the proposal “bad for Florida and even worse for Floridians.”\n“This pro-drug amendment was bad for our kids, bad for our communities, bad for our local business, and ultimately bad for Florida. The Florida Chamber was proud to stand with Governor DeSantis to unite community and business leaders across Florida to help ensure this amendment’s defeat,” Wilson said in a statement.\nAs he traveled throughout the state campaigning against the proposal, DeSantis repeatedly called out Trulieve CEO Kim Rivers, who shepherded the company into one of the nation’s largest cannabis sellers in less than a decade. Trulieve was one of Florida’s first licensed operators, after voters approved the 2016 constitutional amendment allowing medical marijuana. The company also operates in Arizona, California, Connecticut, Georgia, Maryland, Ohio, Pennsylvania and West Virginia.\nThe governor flexed the full strength of his executive office to oppose the measure, tapping numerous state agency heads — including leaders of the Department of Juvenile Justice, the Department of Children & Families, the Florida Department of Law Enforcement, the Department of Highway Safety and Motor Vehicles and the Department of Health — to join his effort to defeat the pot proposal.\nState Surgeon General Dr. Joseph Ladapo, as an example, recently released guidance warning about dangers of marijuana and advising health care providers to regularly drug-screen patients ages 12 and older. The Department of Highway Safety and Motor Vehicles, meanwhile, released public service announcements warning against driving while under the influence of marijuana.\nDeSantis also focused on what could have been a weakness in the proposal for people who might otherwise support decriminalizing marijuana: The measure did not include allowing people to grow their own marijuana.\n“They do provide that you have basically an unfettered right to possess and smoke marijuana, but only if you buy it from them. They do not provide you with the right to grow your own product in your backyard,” DeSantis said at an event last week. “So they’re forcing business into this big weed cartel.”"
    },
    {
      "url": "https://www.pewresearch.org/politics/2024/03/26/most-americans-favor-legalizing-marijuana-for-medical-recreational-use/",
      "text": "Pew Research Center conducted this study to understand the public’s views about the legalization of marijuana in the United States. For this analysis, we surveyed 5,140 adults from Jan. 16 to Jan. 21, 2024. Everyone who took part in this survey is a member of the Center’s American Trends Panel (ATP), an online survey panel that is recruited through national, random sampling of residential addresses. This way nearly all U.S. adults have a chance of selection. The survey is weighted to be representative of the U.S. adult population by gender, race, ethnicity, partisan affiliation, education and other categories. Read more about the ATP’s methodology.\nHere are the questions used for the report and its methodology.\nAs more states pass laws legalizing marijuana for recreational use, Americans continue to favor legalization of both medical and recreational use of the drug.\nAn overwhelming share of U.S. adults (88%) say marijuana should be legal for medical or recreational use.\nNearly six-in-ten Americans (57%) say that marijuana should be legal for medical and recreational purposes, while roughly a third (32%) say that marijuana should be legal for medical use only.\nJust 11% of Americans say that the drug should not be legal at all.\nOpinions about marijuana legalization have changed little over the past five years, according to the Pew Research Center survey, conducted Jan. 16-21, 2024, among 5,14o adults.\nThe impact of legalizing marijuana for recreational use\nWhile a majority of Americans continue to say marijuana should be legal, there are varying views about the impacts of recreational legalization.\nAbout half of Americans (52%) say that legalizing the recreational use of marijuana is good for local economies; just 17% think it is bad and 29% say it has no impact.\nMore adults also say legalizing marijuana for recreational use makes the criminal justice system more fair (42%) than less fair (18%); 38% say it has no impact.\nHowever, Americans have mixed views on the impact of legalizing marijuana for recreational use on:\n- Use of other drugs: About as many say it increases (29%) as say it decreases (27%) the use of other drugs, like heroin, fentanyl and cocaine (42% say it has no impact).\n- Community safety: More Americans say legalizing recreational marijuana makes communities less safe (34%) than say it makes them safer (21%); 44% say it has no impact.\nPartisan differences on impact of recreational use of marijuana\nThere are deep partisan divisions regarding the impact of marijuana legalization for recreational use.\nMajorities of Democrats and Democratic-leaning independents say legalizing recreational marijuana is good for local economies (64% say this) and makes the criminal justice system fairer (58%).\nFewer Republicans and Republican leaners say legalization for recreational use has a positive effect on local economies (41%) and the criminal justice system (27%).\nRepublicans are more likely than Democrats to cite downsides from legalizing recreational marijuana:\n- 42% of Republicans say it increases the use of other drugs, like heroin, fentanyl and cocaine, compared with just 17% of Democrats.\n- 48% of Republicans say it makes communities less safe, more than double the share of Democrats (21%) who say this.\nDemographic, partisan differences in views of marijuana legalization\nSizable age and partisan differences persist on the issue of marijuana legalization though small shares of adults across demographic groups are completely opposed to it.\nOlder adults are far less likely than younger adults to favor marijuana legalization.\nThis is particularly the case among adults ages 75 and older: 31% say marijuana should be legal for both medical and recreational use.\nBy comparison, half of adults between the ages of 65 and 74 say marijuana should be legal for medical and recreational use, and larger shares in younger age groups say the same.\nRepublicans continue to be less supportive than Democrats of legalizing marijuana for both legal and recreational use: 42% of Republicans favor legalizing marijuana for both purposes, compared with 72% of Democrats.\nThere continue to be ideological differences within each party:\n- 34% of conservative Republicans say marijuana should be legal for medical and recreational use, compared with a 57% majority of moderate and liberal Republicans.\n- 62% of conservative and moderate Democrats say marijuana should be legal for medical and recreational use, while an overwhelming majority of liberal Democrats (84%) say this.\nViews of marijuana legalization vary by age within both parties\nAlong with differences by party and age, there are also age differences within each party on the issue.\nA 57% majority of Republicans ages 18 to 29 favor making marijuana legal for medical and recreational use, compared with 52% among those ages 30 to 49 and much smaller shares of older Republicans.\nStill, wide majorities of Republicans in all age groups favor legalizing marijuana at least for medical use. Among those ages 65 and older, just 20% say marijuana should not be legal even for medical purposes.\nWhile majorities of Democrats across all age groups support legalizing marijuana for medical and recreational use, older Democrats are less likely to say this.\nAbout half of Democrats ages 75 and older (53%) say marijuana should be legal for both purposes, but much larger shares of younger Democrats say the same (including 81% of Democrats ages 18 to 29). Still, only 7% of Democrats ages 65 and older think marijuana should not be legalized even for medical use, similar to the share of all other Democrats who say this.\nViews of the effects of legalizing recreational marijuana among racial and ethnic groups\nSubstantial shares of Americans across racial and ethnic groups say when marijuana is legal for recreational use, it has a more positive than negative impact on the economy and criminal justice system.\nEconomy\nAbout half of White (52%), Black (53%) and Hispanic (51%) adults say legalizing recreational marijuana is good for local economies. A slightly smaller share of Asian adults (46%) say the same.\nCriminal justice\nAcross racial and ethnic groups, about four-in-ten say that recreational marijuana being legal makes the criminal justice system fairer, with smaller shares saying it would make it less fair.\nHowever, there are wider racial differences on questions regarding the impact of recreational marijuana on the use of other drugs and the safety of communities.\nUse of other drugs\nNearly half of Black adults (48%) say recreational marijuana legalization doesn’t have an effect on the use of drugs like heroin, fentanyl and cocaine. Another 32% in this group say it decreases the use of these drugs and 18% say it increases their use.\nIn contrast, Hispanic adults are slightly more likely to say legal marijuana increases the use of these other drugs (39%) than to say it decreases this use (30%); 29% say it has no impact.\nAmong White adults, the balance of opinion is mixed: 28% say marijuana legalization increases the use of other drugs and 25% say it decreases their use (45% say it has no impact). Views among Asian adults are also mixed, though a smaller share (31%) say legalization has no impact on the use of other drugs.\nCommunity safety\nHispanic and Asian adults also are more likely to say marijuana’s legalization makes communities less safe: 41% of Hispanic adults and 46% of Asian adults say this, compared with 34% of White adults and 24% of Black adults.\nWide age gap on views of impact of legalizing recreational marijuana\nYoung Americans view the legalization of marijuana for recreational use in more positive terms compared with their older counterparts.\nClear majorities of adults under 30 say it is good for local economies (71%) and that it makes the criminal justice system fairer (59%).\nBy comparison, a third of Americans ages 65 and older say legalizing the recreational use of marijuana is good for local economies; about as many (32%) say it makes the criminal justice system more fair.\nThere also are sizable differences in opinion by age about how legalizing recreational marijuana affects the use of other drugs and the safety of communities."
    }
  ],
  "argos_summary": "President Donald Trump announced that his administration is considering reclassifying marijuana from a Schedule I to a Schedule III drug, which would recognize its medical uses and reduce its perceived danger. This potential change could significantly impact the cannabis industry, allowing for different tax regulations and encouraging investment in the $80 billion market. While public opinion increasingly favors legalization, some conservatives express concerns about marijuana's societal effects, complicating the discussion around decriminalization.",
  "argos_id": "YRP6SCVPF"
}