{
  "url": "https://www.ajc.com/news/2025/08/republicans-democrats-alike-exhort-trump-keep-security-pact-with-australia-and-uk-alive/",
  "authorsByline": "ALBEE ZHANG",
  "articleId": "965bdc4c77b044b683f4a5593f366390",
  "source": {
    "domain": "ajc.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "GA",
      "county": "Fulton County",
      "city": "Atlanta",
      "coordinates": {
        "lat": 33.7489924,
        "lon": -84.3902644
      }
    }
  },
  "imageUrl": "https://www.ajc.com/resizer/v2/4JAYAD3SIZE63IANXROLYZPUZU.jpg?auth=934f047638a09b700bc31ac93a48d6282bb712d93a9531cbb0a6525bc6ac4c12&width=1200&height=630&smart=true",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T01:13:47.580000+00:00",
  "addDate": "2025-08-12T01:21:39.816177+00:00",
  "refreshDate": "2025-08-12T01:21:39.816181+00:00",
  "score": 1.0,
  "title": "Republicans, Democrats alike exhort Trump: Keep security pact with Australia and UK alive",
  "description": "U.S. lawmakers are urging the Trump administration to maintain a security partnership with Australia and the United Kingdom to supply nuclear-powered submarines",
  "content": "The review comes as the Trump administration works to rebalance its global security concerns while struggling with a hollowed-out industrial base that has hamstrung U.S. capabilities to build enough warships. The review is being led by Elbridge Colby, the No. 3 Pentagon official, who has expressed skepticism about the partnership.\n\n“If we can produce the attack submarines in sufficient number and sufficient speed, then great. But if we can’t, that becomes a very difficult problem,\" Colby said during his confirmation hearing in March. “This is getting back to restoring our defense industrial capacity so that we don’t have to face these awful choices but rather can be in a position where we can produce not only for ourselves, but for our allies.\"\n\nUS cannot build enough ships\n\nAs part of the $269 billion AUKUS partnership, the United States will sell three to five Virginia-class nuclear-powered submarines to Australia, with the first delivery scheduled as soon as 2032. The U.S. and the U.K. would help Australia design and build another three to five attack submarines to form an eight-boat force for Australia.\n\nA March report by the Congressional Research Service warned that the lack of U.S. shipbuilding capacities, including workforce shortage and insufficient supply chains, is jeopardizing the much-celebrated partnership. If the U.S. should sell the vessels to Australia, the U.S. Navy would have a shortage of attack submarines for two decades, the report said.\n\nThe Navy has been ordering two boats per year in the last decade, but U.S. shipyards have been only producing 1.2 Virginia-class subs a year since 2022, the report said.\n\n“The delivery pace is not where it needs to be\" to make good on the first pillar of AUKUS, Admiral Daryl Caudle, nominee for the Chief of Naval Operations, told the Senate Armed Services Committee last month.\n\nAustralia has invested $1 billion in the U.S. submarine industrial base, with another $1 billion to be paid before the end of this year. It has agreed to contribute a total of $3 billion to uplift the U.S. submarine base, and it has sent both industry personnel to train at U.S. shipyards and naval personnel for submarine training in the United States.\n\n\"Australia was clear that we would make a proportionate contribution to the United States industrial base,” an Australian defense spokesperson said in July. “Australia’s contribution is about accelerating U.S. production rates and maintenance to enable the delivery of Australia’s future Virginia-class submarines.”\n\nThe three nations have also jointly tested communication capabilities with underwater autonomous systems, Australia's defense ministry said on July 23. Per the partnership, the countries will co-develop other advanced technologies, from undersea to hypersonic capabilities.\n\nAt the recent Aspen Security Forum, Kevin Rudd, the Australian ambassador to the United States, said his country is committed to increasing defense spending to support its first nuclear-powered sub program, which would also provide “massively expensive full maintenance repair facilities\" for the U.S. Indo-Pacific fleet based in Western Australia.\n\nRudd expressed confidence that the two governments “will work our way through this stuff.”\n\nBruce Jones, senior fellow with the Strobe Talbott Center for Security, Strategy and Technology, told The Associated Press that the partnership, by positioning subs in Western Australia, is helping arm the undersea space that is “really crucial to American deterrence and defense options in the Western Pacific.”\n\n“The right answer is not to be content with the current pace of submarine building. It’s to increase the pace,\" Jones said.\n\nJennifer Parker, who has served more than 20 years with the Royal Australian Navy and founded Barrier Strategic Advisory, said it should not be a zero-sum game. “You might sell one submarine to Australia, so you have one less submarine on paper. But in terms of the access, you have the theater of choice from operating from Australia, from being able to maintain your submarines from Australia,\" Parker said. “This is not a deal that just benefits Australia.\"\n\nDefense policy is one of the few areas where Republican lawmakers have pushed back against the Trump administration, but their resolve is being tested with the Pentagon’s review of AUKUS. So far, they have joined their Democratic colleagues in voicing support for the partnership.\n\nThey said the U.S. submarine industry is rebounding with congressional appropriations totaling $10 billion since 2018 to ensure the U.S. will have enough ships to allow for sales to Australia.\n\nSen. Tim Kaine, D-Va., told the AP that support for AUKUS is strong and bipartisan, “certainly on the Armed Services Committee.”\n\n\"There is a little bit of mystification about the analysis done at the Pentagon,” Kaine said, adding that “maybe (what) the analysis will say is: We believe this is a good thing.”",
  "medium": "Article",
  "links": [
    "https://apnews.com/article/trump-war-powers-iran-democrats-senate-vote-6cc19772c4ec53a5a05c4a0c942350df"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Western Australia",
      "weight": 0.08444944
    },
    {
      "name": "Australia",
      "weight": 0.081618205
    },
    {
      "name": "U.S. capabilities",
      "weight": 0.08066662
    },
    {
      "name": "attack submarines",
      "weight": 0.07927773
    },
    {
      "name": "U.S. shipyards",
      "weight": 0.07730556
    },
    {
      "name": "U.S. shipbuilding capacities",
      "weight": 0.07586532
    },
    {
      "name": "U.S.",
      "weight": 0.07525892
    },
    {
      "name": "submarine training",
      "weight": 0.07345755
    },
    {
      "name": "submarine building",
      "weight": 0.072733834
    },
    {
      "name": "U.S. production rates",
      "weight": 0.072717585
    }
  ],
  "topics": [
    {
      "name": "Australia"
    },
    {
      "name": "GOP"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.9873046875
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.94482421875
    },
    {
      "name": "/People & Society/Social Sciences/Political Science",
      "score": 0.794921875
    },
    {
      "name": "/Law & Government/Military/Other",
      "score": 0.71044921875
    },
    {
      "name": "/Business & Industrial/Aerospace & Defense/Other",
      "score": 0.423828125
    }
  ],
  "sentiment": {
    "positive": 0.11081084,
    "negative": 0.6087684,
    "neutral": 0.28042084
  },
  "summary": "The review of the $269 billion AUKUS partnership is being led by Elbridge Colby, the No. 3 Pentagon official, who has expressed skepticism about the partnership. The review comes as the Trump administration struggles with a hollowed-out industrial base that hinders U.S. capabilities to build enough warships. As part of the partnership, the United States will sell three to five Virginia-class nuclear-powered submarines to Australia, with the first delivery scheduled as soon as 2032. A report by the Congressional Research Service warned that if the U.K. could sell the vessels to Australia it would create a shortage of attack submarines for two decades. Australia has invested $1 billion in the US submarine industrial base and has contributed $3 billion to uplift the US.",
  "shortSummary": "The Trump administration is reviewing the AUKUS partnership due to a lack of submarine production, despite Australia's commitment to increased investment and production capabilities.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "7b2c9d60cc3a4f92960bfbbd23e3fe14",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://apnews.com/article/trump-war-powers-iran-democrats-senate-vote-6cc19772c4ec53a5a05c4a0c942350df",
      "text": "Senate rejects effort to restrain Trump on Iran as GOP backs his strikes on nuclear sites\nSenate rejects effort to restrain Trump on Iran as GOP backs his strikes on nuclear sites\nWASHINGTON (AP) — Democratic efforts in the Senate to prevent President Donald Trump from further escalating with Iran fell short Friday, with Republicans blocking a resolution that marked Congress’ first attempt to reassert its war powers following U.S. strikes on Iranian nuclear sites.\nThe resolution, authored by Sen. Tim Kaine of Virginia, aimed to affirm that Trump should seek authorization from Congress before launching more military action against Iran. Asked Friday if he would bomb Iranian nuclear sites again if he deemed necessary, Trump said, “Sure, without question.”\nThe measure was defeated in a 53-47 vote in the Republican-held Senate. One Democrat, Sen. John Fetterman of Pennsylvania, joined Republicans in opposition, while Sen. Rand Paul of Kentucky was the only Republican to vote in favor.\nMost Republicans have said Iran posed an imminent threat that required decisive action from Trump, and they backed his decision to bomb three Iranian nuclear sites last weekend without seeking congressional approval.\n“Of course, we can debate the scope and strategy of our military engagements,” said Sen. Bill Hagerty, R-Tenn. “But we must not shackle our president in the middle of a crisis when lives are on the line.”\nDemocrats cast doubt on that justification, arguing the president should have come to Congress first. They also said the president did not update them adequately, with Congress’ first briefings taking place Thursday.\n“The idea is this: We shouldn’t send our sons and daughters into war unless there’s a political consensus that this is a good idea, this is a national interest,” Kaine said in a Thursday interview with The Associated Press. The resolution, Kaine said, wasn’t aimed at restricting the president’s ability to defend against a threat, but that “if it’s offense, let’s really make sure we’re making the right decision.”\nIn a statement following Friday’s vote, Kaine said he was “disappointed that many of my colleagues are not willing to stand up and say Congress” should be a part of a decision to go to war.\nDemocrats’ argument for backing the resolution centered on the War Powers Resolution, passed in the early 1970s, which requires the president “in every possible instance” to “consult with Congress before introducing United States Armed Forces.”\nSpeaking on the Senate floor ahead of Friday’s vote, Paul said he would back the resolution, saying that “despite the tactical success of our strikes, they may end up proving to be a strategic failure.”\n“It is unclear if this intervention will fully curtail Iran’s nuclear aspirations,” said Paul.\nTrump is just the latest in a line of presidents to test the limits of the resolution — though he’s done so at a time when he’s often bristling at the nation’s checks and balances.\nTrump on Monday sent a letter to Congress — as required by the War Powers Resolution — that said strikes on Iran over the weekend were “limited in scope and purpose” and “designed to minimize casualties, deter future attacks and limit the risk of escalation.”\nBut following classified briefings with top White House officials this week, some lawmakers remain skeptical about how imminent the threat truly was.\n“There was no imminent threat to the United States,” said Rep. Jim Himes, the top Democrat on the House Intelligence Committee, after Friday’s classified briefings.\n“There’s always an Iranian threat to the world. But, I have not seen anything to suggest that the threat from the Iranians was radically different last Saturday than it was two Saturdays ago,” Himes said.\nDespite Democratic skepticism, nearly all Republicans applauded Trump’s decision to strike Iran. And for GOP senators, supporting the resolution would have meant rebuking the president at the same time they’re working to pass his major legislative package.\nKaine proposed a similar resolution in 2020 aimed at limiting Trump’s authority to launch military operations against Iran. Among the eight Republicans who joined Democrats in approving the resolution was Indiana Sen. Todd Young.\nAfter Thursday’s classified briefing for the Senate, Young said he was “confident that Iran was prepared to pose a significant threat” and that, given Trump’s stated goal of no further escalation, “I do not believe this resolution is necessary at this time.”\n“Should the Administration’s posture change or events dictate the consideration of additional American military action, Congress should be consulted so we can best support those efforts and weigh in on behalf of our constituents,” Young said in a statement.\nTrump has said that a ceasefire between Israel and Iran is now in place. But he and Ayatollah Ali Khamenei have verbally sparred in recent days, with the ayatollah warning the U.S. not to launch future strikes on Iran.\nWhite House officials have said they expect to restart talks soon with Iran, though nothing has been scheduled.\n___\nAssociated Press reporter Leah Askarinam contributed to this report."
    }
  ],
  "argos_summary": "The Trump administration is reviewing its global security strategy amid concerns about the U.S. industrial base's capacity to produce enough warships, particularly submarines, for the AUKUS partnership with Australia and the U.K. The U.S. plans to sell Virginia-class submarines to Australia, but a Congressional report warns that current shipbuilding rates could lead to a significant shortage for the U.S. Navy. Australia is investing in the U.S. submarine industrial base to help accelerate production, while bipartisan support for AUKUS remains strong despite challenges.",
  "argos_id": "YVUFPDDZI"
}