{
  "url": "https://gizmodo.com/hp-15-6%E2%80%B3-touchscreen-laptop-drops-by-70-practically-free-with-windows-11-pro-and-accessories-included-2000641108",
  "authorsByline": "Zainab Falak",
  "articleId": "abf40931950c4beead0a74912f809ebb",
  "source": {
    "domain": "gizmodo.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://gizmodo.com/app/uploads/2025/08/hp-business-laptop-1-1200x675.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T16:40:38+00:00",
  "addDate": "2025-08-11T19:43:16.799972+00:00",
  "refreshDate": "2025-08-11T19:43:16.799973+00:00",
  "score": 1.0,
  "title": "HP 15.6″ Touchscreen Laptop Drops by 70%, Practically Free With Windows 11 Pro and Accessories Included",
  "description": "Amazon is offering a massive $2,100 discount on this laptop, but it is likely going to end soon.",
  "content": "Tech gear prices feel like they’re at an all-time high right now. If you’ve been looking forward to a laptop upgrade but feel like your options under $1,000 are limited, we have good news.\n\nThe HP 15.6-inch touchscreen business laptop has dropped to $900 after a massive 70% discount on Amazon. Considering how HP makes some of the best machines out there, this is a rare chance to get premium performance at a budget-friendly price.\n\nFlaunting the classic HP style, this sleek machine packs serious power. Starting with the basics, you’re getting a decent 15.6 inches touchscreen display with Full HD (1920 x 1080) resolution. This means great visuals for all your tasks, including studying, presentations, and those Netflix sessions. This device isn’t a 2-in-1 convertible, so while you won’t exactly get a tablet-like experience with the touchscreen, it’s still decent for navigation.\n\nVisuals are made even better with the Intel Iris Xe Graphics, which offers smooth playback and sharp details. That’s a boost from the standard Intel UHD graphics you find in many budget laptops. Pair this with the 13th Gen Intel Core i7-1355U processor with 10 cores and 12 threads, and you’re looking at impressive power for multitasking, as well. Data-heavy projectors or some creative tasks – it takes care of it all.\n\nOf course, speeds matter and for that, you’ve got 32GB of DDR4 RAM. This is more than enough to switch between multiple programs without experiencing lag. Store all your documents, media content, and games with the 1TB PCIe SSD that also ensures quicker file access. HP calls it a business laptop, but with this power, it easily doubles as a solid choice for students as well as remote workers.\n\nThe design is portable. At just 3.52 lbs and under an inch thick, carrying it around where life leads you is easy. Battery life is up to 7 hours and 45 minutes on mixed usage, which should cover most of a workday. Plus, fast charging support means you can juice it back up in no time.\n\nConnectivity-wise, you’re getting multiple USB-A ports, a USB-C port, HDMI for presentations, and a headphone/mic combo jack. Some other features that deserve a mention include the built-in HP True Vision HD camera and noise reduction software that work together to make video calls a breeze. Windows 11 Pro comes pre-installed, so start using it right away.\n\nAt $900, you’re getting a laptop that’s built for serious work but priced like a mid-range machine. If you’ve been wanting to upgrade, don’t miss out on this deal.",
  "medium": "Article",
  "links": [
    "https://gizmodo.com/download/windows-11-pro",
    "https://shop.gizmodo.com/go/3540/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "many budget laptops",
      "weight": 0.074043386
    },
    {
      "name": "HP",
      "weight": 0.06320689
    },
    {
      "name": "serious power",
      "weight": 0.060621865
    },
    {
      "name": "Intel",
      "weight": 0.05904035
    },
    {
      "name": "multiple programs",
      "weight": 0.057772297
    },
    {
      "name": "True Vision HD",
      "weight": 0.055827968
    },
    {
      "name": "HP 15.6″ Touchscreen Laptop",
      "weight": 0.055679403
    },
    {
      "name": "impressive power",
      "weight": 0.055296846
    },
    {
      "name": "noise reduction software",
      "weight": 0.05257636
    },
    {
      "name": "mixed usage",
      "weight": 0.052168522
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Shopping/Consumer Resources/Product Reviews & Price Comparisons",
      "score": 0.95361328125
    }
  ],
  "sentiment": {
    "positive": 0.3391264,
    "negative": 0.24052064,
    "neutral": 0.4203529
  },
  "summary": "The HP 15.6-inch touchscreen business laptop has been reduced to $900 after a 70% discount on Amazon. The device features a Full HD (1920 x 1080) display and Intel Iris Xe Graphics, making it a rare opportunity for premium performance at a budget-friendly price. It also features 32GB of DDR4 RAM, a 1TB PCIe SSD, multiple USB-A ports, a USB-C port, and a headphone/mic combo jack. Other notable features include a built-in HP True Vision HD camera and noise reduction software.",
  "shortSummary": "HP 15.6-inch touchscreen laptop offers excellent graphics, high-speed internet, and portable computing, all while charging for your daily needs.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "34d8cbca23c1488e8a806ae6bff79fc2",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "The HP 15.6-inch touchscreen business laptop is currently available for $900 after a significant 70% discount on Amazon, making it an attractive option for those seeking a powerful machine under $1,000. It features a Full HD touchscreen display, an Intel Core i7 processor, 32GB of RAM, and a 1TB SSD, providing excellent performance for multitasking and creative tasks. With a lightweight design, long battery life, and various connectivity options, this laptop is suitable for both students and remote workers.",
  "argos_id": "Z15FK0S65"
}