{
  "url": "https://nypost.com/2025/08/11/world-news/bullfighter-gored-to-death-after-taunting-animal-at-colombia-festival/",
  "authorsByline": "Anthony Blair",
  "articleId": "152392909a7343d2b5669d950032f7d9",
  "source": {
    "domain": "nypost.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://nypost.com/wp-content/uploads/sites/2/2025/08/109479298.jpg?quality=75&strip=all&w=1024",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T20:21:05+00:00",
  "addDate": "2025-08-11T21:23:57.253121+00:00",
  "refreshDate": "2025-08-11T21:23:57.253122+00:00",
  "score": 1.0,
  "title": "Bullfighter gored to death after taunting animal at controversial festival",
  "description": "“He stood up as if he was fine, but the blood was flowing. It was only a few seconds before he fell to the ground,” one eyewitness said.",
  "content": "Sickening video shows a bullfighter being gored to death in front of horrified onlookers after he taunted the animal at a festival in Colombia.\n\nYovanis Márquez, 35, was one of dozens taking part in Saturday’s bullfighting festival in the small town of Fundación in the northern Colombian region of Magdalena when he was killed.\n\nGruesome footage captures the bull tossing Márquez in the air with its horns.\n\nMárquez charges at the creature as part of the “corraleja,” or bullfighting festival, and tries to leap over it, but doesn’t clear the jump and instead is attacked multiple times by the bull, as witnesses scream.\n\nThe video shows him being helped to his feet and led away by spectators, but he later died from his injuries, according to local reports.\n\n“He stood up as if he was fine, but the blood was flowing. It was only a few seconds before he fell to the ground,” one eyewitness told El Tiempo.\n\nMárquez was rushed to a nearby hospital but was declared dead on arrival, the outlet reported.\n\nAnother video from the same event showed the bullfighter looking around the packed bullring and shouting at spectators as he prepared for his final charge.\n\n“The man passed away yesterday after being gored by an injured bull, in an act of self-defense, during the ‘festivities’ of the municipality,” said Colombian animal rights group Plataforma ALTO, which shared video of the attack on social media.\n\nCorralejas are a popular tradition in parts of Colombia which see bullfighters take part in challenges in front of large crowds.\n\nBut the events have come to be seen as increasingly old-fashioned, and as festivals of animal cruelty that also put human lives at risk.\n\nLast year, Colombia’s parliament passed a law banning bullfighting, but the ban won’t come into full effect until 2027.",
  "medium": "Article",
  "links": [
    "https://nypost.com/2025/08/11/world-news/chinese-ship-crashes-in-showdown-with-philippines-boat-in-contested-waters/",
    "https://www.eltiempo.com/colombia/otras-ciudades/tragedia-en-fundacion-magdalena-mortal-embestida-en-corralejas-reaviva-debate-sobre-riesgos-y-crueldad-de-esta-practica-3479958",
    "https://x.com/PlataformaALTO/status/1954548036639842518",
    "https://nypost.com/2025/08/11/world-news/israel-kills-al-jazeera-journalists-in-attack-on-hamas-terrorist-cell/",
    "https://nypost.com/2025/08/09/world-news/european-cities-slap-ridiculous-fees-on-tourists-for-taking-beach-shells/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "bullfighting festival",
      "weight": 0.095131904
    },
    {
      "name": "Colombian animal rights group",
      "weight": 0.08635237
    },
    {
      "name": "controversial festival",
      "weight": 0.07839475
    },
    {
      "name": "animal cruelty",
      "weight": 0.07789728
    },
    {
      "name": "festivals",
      "weight": 0.076275684
    },
    {
      "name": "Yovanis Márquez",
      "weight": 0.07311614
    },
    {
      "name": "part",
      "weight": 0.07187469
    },
    {
      "name": "parts",
      "weight": 0.07187469
    },
    {
      "name": "Sickening video",
      "weight": 0.0715564
    },
    {
      "name": "animal",
      "weight": 0.07111041
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/News/Local News",
      "score": 0.94140625
    },
    {
      "name": "/Sensitive Subjects/Death & Tragedy",
      "score": 0.82666015625
    },
    {
      "name": "/News/Other",
      "score": 0.7822265625
    },
    {
      "name": "/Sensitive Subjects/Violence & Abuse",
      "score": 0.693359375
    },
    {
      "name": "/Arts & Entertainment/TV & Video/Online Video",
      "score": 0.6005859375
    },
    {
      "name": "/Sensitive Subjects/Accidents & Disasters",
      "score": 0.55078125
    },
    {
      "name": "/Pets & Animals/Wildlife",
      "score": 0.52978515625
    }
  ],
  "sentiment": {
    "positive": 0.044294786,
    "negative": 0.75138766,
    "neutral": 0.20431758
  },
  "summary": "A video shows a bullfighter being gored to death after taunting the animal at a festival in Colombia. Yovanis Márquez was part of the \"corraleja,\" or bullfighting festival, when he was attacked multiple times by the animal. The video shows him being thrown in the air by the bull, but he later died from his injuries. The incident occurred during the festival in the small town of Fundación in the northern Colombian region of Magdalena. The festival is seen as an old-fashioned event and as festivals of animal cruelty that put human lives at risk.",
  "shortSummary": "A Colombian bullfighter was gored to death by his own animal at a controversial festival, prompting calls for a ban on such events.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "64d73f9588b645de91c752ad86de233d",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.eltiempo.com/colombia/otras-ciudades/tragedia-en-fundacion-magdalena-mortal-embestida-en-corralejas-reaviva-debate-sobre-riesgos-y-crueldad-de-esta-practica-3479958",
      "text": "En este portal utilizamos datos de navegación / cookies propias y de terceros para gestionar el portal, elaborar información estadística, optimizar la funcionalidad del sitio y mostrar publicidad relacionada con sus preferencias a través del análisis de la navegación. Si continúa navegando, usted estará aceptando esta utilización. Puede conocer cómo deshabilitarlas u obtener más información\naquí\nYa tienes una cuenta vinculada a EL TIEMPO, por favor inicia sesión con ella y no te pierdas de todos los beneficios que tenemos para tí. Iniciar sesión\n¡Hola! Parece que has alcanzado tu límite diario de 3 búsquedas en nuestro chat bot como usuario registrado.\n¿Quieres seguir disfrutando de este y otros beneficios exclusivos?\nAdquiere el plan de suscripción que se adapte a tus preferencias y accede a ¡contenido ilimitado! No te\npierdas la oportunidad de disfrutar todas las funcionalidades que ofrecemos. 🌟\n¡Hola! Haz excedido el máximo de peticiones mensuales.\nPara más información continua navegando en eltiempo.com\nError 505\nEstamos resolviendo el problema, inténtalo nuevamente más tarde.\nProcesando tu pregunta... ¡Un momento, por favor!\n¿Sabías que registrándote en nuestro portal podrás acceder al chatbot de El Tiempo y obtener información\nprecisa en tus búsquedas?\nCon el envío de tus consultas, aceptas los Términos y Condiciones del Chat disponibles en la parte superior. Recuerda que las respuestas generadas pueden presentar inexactitudes o bloqueos, de acuerdo con las políticas de filtros de contenido o el estado del modelo. Este Chat tiene finalidades únicamente informativas.\nDe acuerdo con las políticas de la IA que usa EL TIEMPO, no es posible responder a las preguntas relacionadas con los siguientes temas: odio, sexual, violencia y autolesiones\nNoticia\nTragedia en Fundación, Magdalena: mortal embestida en corralejas reaviva debate sobre riesgos y crueldad de esta práctica\nYovanis Márquez, reconocido por su destreza en la arena, murió tras un salto fallido. Videos reabren polémica por espectáculos taurinos.\nLa euforia de las fiestas patronales de Fundación, Magdalena, se vio interrumpida por una tragedia que ha conmovido a toda la región. En medio de la música, los aplausos y la algarabía de la corraleja, un reconocido participante perdió la vida tras un fallido intento de salto sobre un toro.\nLa víctima, identificada como Yovanis Márquez, era ampliamente conocido en el circuito taurino popular por su rapidez y destreza frente a los astados. No era un improvisado; en años anteriores se había ganado el respeto del público por sus maniobras arriesgadas y por lograr esquivar embestidas que dejaban a más de uno sin aliento.\nEse día, sin embargo, el destino jugó en su contra. Impulsado por la adrenalina y la ovación del público, corrió hacia el toro con la intención de saltarlo. Un error de cálculo en la distancia y la altura lo dejó expuesto al golpe letal de los cuernos del animal.\nEl momento del impacto y la desesperación en la arena\nTestigos narran que, tras recibir la embestida, Yovanis intentó incorporarse como si nada hubiera pasado, probablemente impulsado por el shock del momento. Sin embargo, apenas dio unos pasos antes de desplomarse. La herida en su cuello, provocada por el cuerno del toro, resultó mortal.\n“Se paró como si estuviera bien, pero la sangre corría. Solo fueron unos segundos antes de que cayera al suelo”, relató un asistente que presenció la escena desde las gradas. El ambiente festivo se transformó en segundos en una mezcla de gritos, carreras y pánico.\nMientras algunos intentaban socorrerlo, otros grababan con sus teléfonos, y pronto los videos comenzaron a circular por redes sociales, mostrando el instante preciso de la tragedia. Las imágenes se hicieron virales, avivando un intenso debate sobre los riesgos y la naturaleza de este tipo de espectáculos.\nEl traslado y el inevitable desenlace\nYovanis fue trasladado de inmediato al hospital del municipio, pero los médicos confirmaron que llegó sin signos vitales. La herida había causado una hemorragia masiva que no pudo ser contenida. La noticia se difundió rápidamente y sumió a Fundación en un ambiente de luto en plena celebración patronal.\nSu muerte dejó una sensación amarga entre los asistentes y en la comunidad. Aunque la corraleja continuó según lo programado, el recuerdo del accidente se convirtió en tema central de conversación, opacando en parte el resto de los festejos.\nNo es la primera vez que la violencia de las corralejas deja víctimas en la región. Los informes locales recuerdan que, año tras año, este tipo de eventos cobra vidas y deja a decenas de personas heridas, tanto participantes como espectadores.\nUn espectáculo arraigado y cuestionado\nLas corralejas son una practica profundamente arraigada en varios municipios del Magdalena y de la región Caribe. Combinan música, licor y desafíos frente a toros de gran tamaño, en un ambiente donde la adrenalina y el riesgo forman parte del atractivo.\nPese a las advertencias y críticas de organizaciones animalistas y defensores de derechos humanos, la práctica sigue convocando a multitudes. Para muchos, es un símbolo cultural y una fuente de ingresos para comerciantes y organizadores. Para otros, es una manifestación de crueldad que pone en peligro vidas humanas y animales.\nLa muerte de Yovanis Márquez ha vuelto a encender la polémica. Las redes sociales se han llenado de mensajes que cuestionan si este tipo de espectáculos deberían continuar, señalando que no es aceptable normalizar el riesgo mortal como parte del entretenimiento.\nDiferencia en las opiniones\nEn Fundación, algunos ven en la tragedia una advertencia sobre la urgencia de replantear las corralejas. Otros, en cambio, defienden la continuidad de una costumbre que consideran parte de su identidad cultural. La tensión entre ambos puntos de vista se repite cada año, sin que hasta ahora se logre un consenso.\nPor ahora, lo único seguro es que la muerte de Yovanis se sumará a la larga lista de víctimas de esta práctica. Un salto que pretendía ser una demostración de valentía terminó como símbolo de los peligros que encierra la arena, recordando que, detrás de cada aplauso, siempre está latente la tragedia."
    },
    {
      "url": "https://nypost.com/2025/08/11/world-news/chinese-ship-crashes-in-showdown-with-philippines-boat-in-contested-waters/",
      "text": "Wild video shows Chinese ships crashing while trying to cut off Philippines’ boat in disputed waters\nDramatic footage shows two Chinese government ships violently colliding Monday while chasing down a Filipino coast guard vessel in a disputed area of the South China Sea.\nA Chinese coast guard ship was in hot pursuit Monday when it “performed a risky maneuver,” then violently T-boned a massive Chinese navy ship, according to the Philippines coast guard, which shared the footage.\nCrews could be heard shouting over the brutal sound of crunching metal, with photos showing the front of the Chinese vessel totally smashed.\nThe “substantial damage” left the Chinese ship “unseaworthy,” said Philippines coast guard spokesperson Commodore Jay Tarriela, adding that China declined help for any potential injuries or rescues.\nThe wild showdown came about 12 miles from the contested Scarborough Shoal as two Philippines vessels were delivering food and fuel to around 35 Filipino fishing ships, GMANews reported.\nBeijing has claimed nearly all of the South China Sea for its own, including areas claimed by other neighboring countries like the Philippines, Vietnam and Indonesia.\nChina confirmed there was a confrontation between the two countries but did not mention a collision, according to the BBC.\nPhilippines President Ferdinand “Bongbong” Marcos Jr. said his country would continue to assert its territorial claims in the region.\n”We will continue to be present. We will continue to defend our territory. We will continue to exercise our sovereign rights. And despite any opposition from anyone, we will continue to do that as we have done in the past three years,” Marcos told reporters at a brief press conference hours after the incident, GMANews reported.\nMarcos said that Monday’s altercation was likely the result of comments he made last week when he warned China that the Philippines could be dragged into a conflict between China and the United States over Taiwan."
    },
    {
      "url": "https://nypost.com/2025/08/11/world-news/israel-kills-al-jazeera-journalists-in-attack-on-hamas-terrorist-cell/",
      "text": "Israel says it killed a Hamas terrorist posing as an Al Jazeera reporter, 4 others in targeted airstrike\nA prominent Al Jazeera journalist was killed in an airstrike alongside four of his colleagues as Israel’s military accused him of posing as a reporter to run a Hamas terrorist cell.\nAnas al-Sharif, a 28-year-old correspondent, was among those killed Sunday when the strikes hit a tent near Al Shifa Hospital in eastern Gaza City, Gaza officials and Al Jazeera confirmed.\n“Al-Sharif was the head of a Hamas terrorist cell and advanced rocket attacks on Israeli civilians and IDF troops,” the Israel Defense Forces (IDF) said, calling him a “terrorist” who “posed as an Al Jazeera journalist.”\n“Intelligence and documents from Gaza, including rosters, terrorist training lists and salary records, prove he was a Hamas operative integrated into Al Jazeera,” the IDF said.\n“A press badge isn’t a shield for terrorism.”\nBefore his death, al-Sharif had denied ties to Hamas, as had his network.\nAl Jazeera called the airstrikes a “targeted assassination” and accused Israeli officials of incitement.\nCalling al-Sharif “one of Gaza’s bravest journalists,” Al Jazeera blasted the attack as a “desperate attempt to silence voices in anticipation of the occupation of Gaza.”\n“Anas and his colleagues were among the last remaining voices from within Gaza, providing the world with unfiltered, on-the-ground coverage of the devastating realities endured by its people,” the Qatari network said in a statement.\nThe network said al-Sharif had left a social media message to be posted in the event of his death that read, “I never hesitated to convey the truth as it is, without distortion or misrepresentation, hoping that God would witness those who remained silent.”\nAl-Sharif, who boasted more than 500,000 followers on X, had been posting on social media just minutes before his death — saying that Israel had been intensely bombarding Gaza City for more than two hours.\nIn the wake of his death, Hamas said the latest strikes may signal the start of an Israeli offensive.\n“The assassination of journalists and the intimidation of those who remain paves the way for a major crime that the occupation is planning to commit in Gaza City,” the terror group said in a statement.\nAl-Sharif began reporting for Al Jazeera a few days after war broke out and his coverage repeatedly went viral.\nIn January, he whipped off his press vest and helmet following news of a cease-fire. Al-Sharif cried on air in July, too, as women behind him collapsed from hunger.\n“I am talking about slow death of those people,” he said at the time.\nMeanwhile, the Committee to Protect Journalists, which in July urged the international community to protect al-Sharif, said Israel had failed to provide any evidence to back up its allegations against him.\n“Israel’s pattern of labeling journalists as militants without providing credible evidence raises serious questions about its intent and respect for press freedom,” said Sara Qudah, CPJ’s director for the Middle East and North Africa.\nWith Post wires"
    },
    {
      "url": "https://nypost.com/2025/08/09/world-news/european-cities-slap-ridiculous-fees-on-tourists-for-taking-beach-shells/",
      "text": "European cities slap hefty fees on tourists — here’s what it’ll cost if you’re caught wearing flip-flops\nHighway robbery!\nIf you’re vacationing in Europe this summer, better bring along extra cash.\nPopular tourist destinations in European cities are combating mass tourism by slapping some ridiculous, costly fines — some rising into the thousands — on visitors they deem unruly.\nWearing flip-flops while driving, taking a shell or pebble from a beach and unbuckling your seatbelt before the plane stops taxiing can now cost you.\nThose who wear a bathing suit off the beach in the cities of Barcelona, Albufeira, Split, Sorrento, Cannes and Venice could face fines of up to $1,747, according to the BBC.\nIn Mallorca, Ibiza, Magaluf and the Canary Islands, drinking alcohol on the street can set tourists back $3,495, and in Spain, leaving your towel to hold your pool chair for too long can cost $291.\nSpain, Greece, Italy, France and Portugal are the countries cracking down on those sporting flip-flops behind the wheel — and doling out $349 tickets for the crime.\nGreece is punishing those who make off with a shell or pebble by making them shell out $1,165 — and if you swim in a canal in Venice, be prepared to cough up $407.\n“Locals are fed up,” tourism advocate Birgitta Spee-König told the outlet.\n“These fines are signals that communities want to reclaim space. It’s not that tourists are worse — it’s more that the tolerance has gone. And it’s important to consider that not every fine is a crackdown: Some are calls for respect.”\nCities are even going so far as to launch marketing campaigns that outline what’s against the law.\nA brand new 10-point Improve Your Stay campaign was introduced on buses and billboards in Malaga, Spain. Its signage details what the area expects of its guests — that they dress in a tasteful manner and avoid littering, making excessive noise and riding scooters recklessly, or risk an $873 fine.\nAlbufeira also plastered signs in public spaces, explaining the fines for things tourists cannot do in public, like perform sexual acts, urinate, cook or even camp.\nAuthorities are defending the stringent rules — which are being implemented by patrolling police — by saying they were set to protect locals, as well as respectful tourists who want to enjoy their vacation.\n“The rules, while they might sound rigid and punitive when listed out, are all about encouraging responsible and empathetic traveling,” Jessica Harvey Taylor, head of press at the Spanish Tourism Office in London, told BBC.\n“They are designed to protect the holiday experiences of the vast majority of people who behave responsibly on holiday.”\nJuan Antonio Amengual, mayor of Calvià, Mallorca, echoed the sentiment in a speech earlier this year.\n“We must act with two main ideas in mind: the protection and preservation of the environment; and ensuring that tourism is in harmony with our society.\n“Tourism cannot be a burden on citizens.”"
    }
  ],
  "argos_summary": "Yovanis Márquez, a 35-year-old bullfighter, was gored to death during a bullfighting festival in Fundación, Colombia, after a failed jump over the bull. Despite initially appearing to be fine after the attack, he succumbed to his injuries shortly after being taken to the hospital. His death has reignited debates about the dangers and ethical implications of bullfighting events, which are seen by some as outdated and cruel, especially in light of a recent law banning such practices in Colombia that will take effect in 2027.",
  "argos_id": "ZHWSNK6EJ"
}