{
  "url": "https://www.morningstar.com/news/dow-jones/2025081111005/dow-jones-top-company-headlines-at-7-pm-et-intels-stock-is-rising-as-trump-suggests-a-path-forward-after-ceos-white-house-visit-bigbear",
  "authorsByline": "",
  "articleId": "cfc8845b8db0457e8e1ab825166b4f1e",
  "source": {
    "domain": "morningstar.com",
    "location": {
      "country": "us",
      "state": "IL",
      "county": "Cook County",
      "city": "Chicago",
      "coordinates": {
        "lat": 41.8755616,
        "lon": -87.6244212
      }
    }
  },
  "imageUrl": "https://images.contentstack.io/v3/assets/blt4eb669caa7dc65b2/blta7dd42ebdd7b93b8/61899b34a3c7df383578294c/morningstar-og.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T18:15:00-05:00",
  "addDate": "2025-08-11T23:35:37.198282+00:00",
  "refreshDate": "2025-08-11T23:35:37.198284+00:00",
  "score": 1.0,
  "title": "Dow Jones Top Company Headlines at 7 PM ET: Intel's stock is rising as Trump suggests a path forward after CEO's White House visit",
  "description": "",
  "content": "Intel's stock is rising as Trump suggests a path forward after CEO's White House visit\n\nTensions seem to be easing between Intel's Lip-Bu Tan and Trump, who days ago called for the CEO's firing but now praises for his \"amazing\" success story.\n\nThe company blamed cuts in federal contracts for its disappointing results.\n\nEastman Kodak swung to a second-quarter loss and warned about its ability to pay its current debt obligations, as it attempts to find savings by terminating its retirement pension plan.\n\nThe private-equity firm is looking to hire bankers to work on the deal.\n\nThe mining and magnet company said it has signed 12 memorandums of understanding and joint defense agreements to date, representing potentially 300 tons of annual production with customers in the aerospace and defense, data center and automotive sectors.\n\nThe lithium and bromine producer aims to boost its agility and efficiency amid an increasingly dynamic market.\n\nU.S. Steel Plant Explosion Kills at Least One Person, Injures 10\n\nThe automaker said it would spend $2 billion to overhaul a Louisville, Ky., factory to build a new line of affordable, high-tech EVs, and it aims to launch the pickup in 2027.\n\nNvidia, AMD to Give U.S. 15% Cut on AI Chip Sales to China\n\nThe unusual arrangement follows Nvidia CEO Jensen Huang's meeting with President Trump.\n\nThe chief executive officer of Microsoft's coding unit plans to stay on through the end of 2025 before departing to become a startup founder once again.\n\nUnder the seven-year deal, UFC fights will be streamed on Paramount+ and select bouts will be simulcast on CBS.\n\nVulcan Elements says Brad Gerstner's Altimeter led the funding round, which comes as China tightens exports of critical minerals.\n\nThe Canadian miner will add a performance payout after improved production for the period kept it on track to hit its output targets for the full year.\n\nAMC Entertainment narrowed its second-quarter loss as revenue jumped, fueled by a rebound in the box office and the chain's emphasis on premium moviegoing experiences.\n\nThe European Commission approved the merger after the Naspers subsidiary offered concessions to ease competition concerns.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Dow Jones Top Company Headlines",
      "weight": 0.06274403
    },
    {
      "name": "joint defense agreements",
      "weight": 0.05804707
    },
    {
      "name": "President Trump",
      "weight": 0.057007823
    },
    {
      "name": "U.S. Steel Plant Explosion",
      "weight": 0.056265615
    },
    {
      "name": "improved production",
      "weight": 0.055767123
    },
    {
      "name": "annual production",
      "weight": 0.05497089
    },
    {
      "name": "Trump",
      "weight": 0.05356867
    },
    {
      "name": "premium moviegoing experiences",
      "weight": 0.052379787
    },
    {
      "name": "AI Chip Sales",
      "weight": 0.05164139
    },
    {
      "name": "White House",
      "weight": 0.050279643
    }
  ],
  "topics": [
    {
      "name": "Business Leaders"
    },
    {
      "name": "Stocks"
    },
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    },
    {
      "name": "Business"
    },
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.97265625
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.96875
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.9462890625
    },
    {
      "name": "/News/Technology News",
      "score": 0.46923828125
    }
  ],
  "sentiment": {
    "positive": 0.46828038,
    "negative": 0.3236169,
    "neutral": 0.20810276
  },
  "summary": "Intel's stock is rising as President Trump suggests a path forward after CEO's White House visit. The company blamed cuts in federal contracts for its disappointing second-quarter results. Eastman Kodak also warned about its ability to pay its current debt obligations by terminating its retirement pension plan. The automaker plans to spend $2 billion to overhaul a Louisville, Ky., factory to build a new line of affordable, high-tech EVs. Nvidia and AMD will give the U.S. a 15% cut on AI Chip Sales to China following CEO Jensen Huang's meeting with President Trump. The European Commission approved the merger between the two companies after Naspers subsidiary offered concessions to address competition concerns.",
  "shortSummary": "Intel's stock rose as President Trump suggested a path forward for CEO Lip-Bu Tan, amid easing tensions with him and increased investment in new vehicles by $2 billion.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "8808590e2abe47e0bb903523fe5a3c11",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Intel's stock is rising following a shift in tone from Trump, who previously called for the CEO's firing but now praises his success. Meanwhile, Eastman Kodak reported a second-quarter loss and is seeking savings by terminating its pension plan. In other news, U.S. Steel experienced a fatal explosion, and Nvidia and AMD agreed to give the U.S. a 15% cut on AI chip sales to China, following a meeting with Trump.",
  "argos_id": "ZTHBQ51B6"
}