{
  "url": "https://finance.yahoo.com/news/morning-bid-why-matters-rallies-043332375.html",
  "authorsByline": "Reuters",
  "articleId": "1c6cb0c9d0b34d76a3b8c1cbc6e539f7",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/reuters-finance.com/b0c15df6312997319cc93343bfe31b0b",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-25T04:33:32+00:00",
  "addDate": "2025-08-25T04:41:39.939276+00:00",
  "refreshDate": "2025-08-25T04:41:39.939279+00:00",
  "score": 1.0,
  "title": "Morning Bid: The 'Why' matters for rallies, and rate cuts",
  "description": "Asian markets have so far managed a cautious cheer for Fed Chair Jerome Powell's seemingly dovish turn last week, with the Nikkei up and Chinese stocks extending their recent rousing run.  Chinese blue chips have climbed almost 10% so far this month to reach ground not trod since mid-2022, even as domestic demand remains tepid and companies have no pricing power to speak of.  European and U.S. stock futures are in a more sober mood after Friday's euphoria, perhaps reflecting the realisation that things must be getting worse for the U.S. economy for the Fed to consider cutting rates even as inflation heads for 3% and above.",
  "content": "(Reuters) -A look at the day ahead in European and global markets from Wayne Cole.\n\nAsian markets have so far managed a cautious cheer for Fed Chair Jerome Powell's seemingly dovish turn last week, with the Nikkei up and Chinese stocks extending their recent rousing run.\n\nChinese blue chips have climbed almost 10% so far this month to reach ground not trod since mid-2022, even as domestic demand remains tepid and companies have no pricing power to speak of.\n\nThat's the power of momentum. Why are shares going up? Because people are buying them. Why are they buying? Because they're going up.\n\nEuropean and U.S. stock futures are in a more sober mood after Friday's euphoria, perhaps reflecting the realisation that things must be getting worse for the U.S. economy for the Fed to consider cutting rates even as inflation heads for 3% and above.\n\nThe \"why\" matters. It's one thing to ease policy because inflation is cooling, but another thing entirely to have to ease to support the economy and head off an unwelcome rise in unemployment. Powell argued the inflationary impact of tariffs was likely to be a one-off rise in the price level, but that risks sounding like the \"transitory\" tag given to the initial spike in prices post-COVID.\n\nThe Fed's favoured core PCE price index due on Friday is already expected to tick up to a 19-month high of 2.9%, and a 3.0% reading would cause some sticker shock for the long end of the Treasury curve. The Street also has to digest $183 billion in new supply this week, an outsized meal even for a market this big.\n\nTalking of outsized, Nvidia reports on Wednesday and needs to knock the lights out to justify its $4 trillion market cap - which is fast approaching the worth of the entire Nikkei index.\n\nExpectations are for a mere 48% rise in earnings per share on revenue of almost $46 billion, so the bar is high. Which could be why options imply the chance of a 6% move in the share price in either direction depending on the results.\n\nIt was notable last week that tech stumbled a little as some began to wonder how much of hundreds of billions of dollars going into AI investment will ever make a return, or is this another dot-com bubble.\n\nThere will be much interest in how exactly the proposed deal with President Trump works, where Nvidia pays the U.S. government 15% of its earnings on some chips sold to China in return for export permits. Details are scarce and analysts are not even sure that it's constitutional, but that's State Capitalism with American Characteristics for you.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "last week",
      "weight": 0.06740143
    },
    {
      "name": "prices",
      "weight": 0.06608042
    },
    {
      "name": "Asian markets",
      "weight": 0.06345416
    },
    {
      "name": "Chinese stocks",
      "weight": 0.05877795
    },
    {
      "name": "Chinese blue chips",
      "weight": 0.0582604
    },
    {
      "name": "U.S.",
      "weight": 0.053338356
    },
    {
      "name": "State Capitalism",
      "weight": 0.053087972
    },
    {
      "name": "Fed",
      "weight": 0.052894883
    },
    {
      "name": "Jerome Powell",
      "weight": 0.05179413
    },
    {
      "name": "much interest",
      "weight": 0.05038564
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.98828125
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.95263671875
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.82373046875
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.65625
    },
    {
      "name": "/People & Society/Social Sciences/Economics",
      "score": 0.398193359375
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.35205078125
    },
    {
      "name": "/News/Business News/Fiscal Policy News",
      "score": 0.333251953125
    }
  ],
  "sentiment": {
    "positive": 0.11694153,
    "negative": 0.62726027,
    "neutral": 0.2557982
  },
  "summary": "The article discusses the day ahead in European and global markets, with focus on the importance of understanding why shares are going up and whether the Fed will consider cutting rates. Asian markets have been cautious about Fed Chair Jerome Powell's seemingly dovish stance, with the Nikkei up and Chinese stocks increasing by nearly 10%. However, European and U.S. stock futures are more cautious, suggesting that the Fed may need to consider cutting interest rates even as inflation rises to 3.9%. The core PCE price index is expected to rise to a 19-month high of 2.9%, and a 3.0% reading could cause financial strain. Meanwhile, Nvidia is set to report a 48% rise in earnings per share on revenue of almost $46 billion, potentially leading to a 6% move in the share price in either direction.",
  "shortSummary": "Global markets face mixed fortunes with rising inflation, a potential interest rate cut, and significant gains in Chinese stocks and tech stocks.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "230499d0357f463d86c519d11f89b23f",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Asian markets cheer Fed Chair Jerome Powell’s dovish stance, while Chinese blue‑chips surge nearly 10% this month amid momentum rather than fundamentals. European and U.S. futures adopt a sober tone as investors weigh the need for Fed rate cuts against inflation staying above 3% and potential economic slowdown. Nvidia’s upcoming earnings will test its $4 trillion valuation, with analysts wary of AI investment returns and a controversial proposed deal with President Trump that could affect export permits. The market remains cautious as new Treasury supply and core PCE expectations loom.",
  "argos_id": "04ZEJMI6A"
}