{
  "url": "https://www.benzinga.com/pressreleases/25/08/g47300946/questerre-updates-px-energy-transaction",
  "authorsByline": "Globe Newswire",
  "articleId": "77e0a5ed215d4e4c84d88647b766b2db",
  "source": {
    "domain": "benzinga.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "MI",
      "county": "Wayne County",
      "city": "Detroit",
      "coordinates": {
        "lat": 42.3315509,
        "lon": -83.0466403
      }
    }
  },
  "imageUrl": "http://benzinga.com/next-assets/images/schema-image-default.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-25T00:10:00-04:00",
  "addDate": "2025-08-25T04:24:43.348302+00:00",
  "refreshDate": "2025-08-25T04:24:43.348303+00:00",
  "score": 1.0,
  "title": "Questerre updates PX Energy transaction",
  "description": "THIS NEWS RELEASE IS NOT FOR DISSEMINATION OR DISTRIBUTION IN THE UNITED STATES OF AMERICA TO UNITED STATES NEWSWIRE SERVICES OR UNITED STATES PERSONS CALGARY, Alberta, Aug. 25, 2025 (GLOBE NEWSWIRE) --",
  "content": "THIS NEWS RELEASE IS NOT FOR DISSEMINATION OR DISTRIBUTION IN THE UNITED STATES OF AMERICA TO UNITED STATES NEWSWIRE SERVICES OR UNITED STATES PERSONS\n\nCALGARY, Alberta, Aug. 25, 2025 (GLOBE NEWSWIRE) -- Questerre Energy Corporation (\"Questerre\" or the \"Company\") (TSX,OSE:QEC) reported today on the status of its proposed acquisition of Parana Xisto SA (\"PX Energy\"), a privately held oil shale production and refining company based in southern Brazil by way of acquisition of the shares of its indirect parent companies, Forbes & Manhattan Resources Inc. (\"F&M Resources\") and Forbes Participaҫões Ltda (the \"Acquisition\").\n\nMichael Binnion, President & Chief Executive Officer of Questerre, commented, \"Our top priority has been completing due diligence on the Acquisition to ensure we have an accretive transaction for our shareholders. Site visits have confirmed that operationally the existing facilities are well maintained and in full compliance from a HSE perspective. We have also reviewed their proposed growth projects that are designed to increase throughput.\"\n\nHe added, \"Our financial due diligence has identified a larger requirement for both short-term and long-term liquidity since we announced the transaction. We believe meeting this urgent need through a comprehensive agreement with financial partners is vital. It will mitigate the risks of a corporate reorganization process that could have other impacts on their business.\"\n\n\"In addition, we have been working with our financial advisors on an arrangement with the bondholders to ensure they have a path towards realizing a full recovery of their principal. Although we have not yet reached an agreement, we are continuing discussions. We have also been in discussions with the holders of convertible notes issued by F&M Resources as well the parties related to its agreement with Papaya Growth Opportunity Corp. I, a NASDAQ-listed Special Purpose Acquisition Company. We remain focused on a sustainable capital structure for the company given the liquidity requirements and existing cash flow capacity of the base business\", he further added.\n\nHe concluded, \"We still see the strategic value in this acquisition to advance our oil shale strategy. Additionally, the company's refining license provide opportunities to further expand their distribution business. We remain committed to collaborating with all stakeholders on a transaction that restores the company's financial flexibility and establishes a viable path to realize its potential.\"\n\nCompletion of the Acquisition is subject to a number of conditions, including satisfactory due diligence review, board approval, standard regulatory approvals (including acceptance from the Toronto Stock Exchange and Oslo Stock Exchange (collectively, the \"Exchanges\")) and third-party approvals. Where applicable, the proposed Acquisition cannot close until the required shareholder approval is obtained. There can be no assurance that the Acquisition will be completed as proposed or at all.\n\nQuesterre Energy Corporation is a Calgary-based energy technology company focused on the responsible development of oil and gas resources across the Americas. Questerre integrates leading-edge technologies with a disciplined capital strategy to unlock long-term value while maintaining strong environmental and social governance standards.\n\nAll information contained in this news release with respect to PX Energy was supplied by F&M Resources, for inclusion herein, without independent review by Questerre, and Questerre and its directors and officers have relied on F&M Resources for any information concerning the PX Energy.\n\nThis news release contains certain statements which constitute forward-looking statements or information (\"forward-looking statements\") within the meaning of applicable securities laws in Canada. Any statements about Questerre's expectations, beliefs, plans, goals, targets, predictions, forecasts, objectives, assumptions, information and statements about possible future events, conditions and results of operations or performance are not historical facts and may be forward-looking. Forward-looking information is often, but not always, made through the use of words or phrases such as \"anticipates\", \"aims\", \"strives\", \"seeks\", \"believes\", \"can\", \"could\", \"may\", \"predicts\", \"potential\", \"should\", \"will\", \"estimates\", \"plans\", \"mileposts\", \"projects\", \"continuing\", \"ongoing\", \"expects\", \"intends\" and similar words or phrases suggesting future outcomes. Forward-looking information in this news release includes, but is not limited to, statements in respect of the Company's views on the liquidity requirements of PX Energy, discussions with bondholders and other financial partners and its commitment to collaborating with all stakeholders on a transaction.\n\nThe forward-looking information that may be in this news release is based on current expectations, estimates, projections and assumptions, having regard to the Company's experience and its perception of historical trend which have been used to develop such statements and information, but which may prove to be incorrect, and includes, but is not limited to, expectations, estimates, projections and assumptions relating to:\n• the timely receipt of approval of the Acquisition by the Exchanges, third parties, and other regulatory bodies;\n• all closing conditions to the Acquisition being satisfied and the closing of the Acquisition occurring as anticipated;\n• ability of management to execute on key priorities;\n• the effectiveness of various actions resulting from the Company's strategic priorities;\n• the Company's ability to integrate the PX Energy platform to advance its oil shale and biofuel technology to the next stage; and\n• the Company's ability to apply its HCCO technology to the assets being acquired.\n\nAlthough Questerre believes that the expectations reflected in these forward-looking statements are reasonable, undue reliance should not be placed on them because Questerre can give no assurance that they will prove to be correct. Since forward-looking statements address future events and conditions, by their very nature they involve inherent risks and uncertainties. Current conditions, economic and otherwise, render assumptions, although reasonable when made, subject to greater uncertainty. Undue reliance should not be placed on forward-looking information as actual results may differ materially from those expressed or implied by forward-looking information.\n\nEvents or circumstances may cause actual results to differ materially from those predicted as a result of numerous known and unknown risks, uncertainties, and other factors, many of which are beyond the control of the Company, including, without limitation, the following risk factors:\n• the Acquisition not being completed on the terms anticipated or at all, including due to a closing condition not being satisfied, including, the inability to obtain receipt of all necessary securityholder, third parties (including satisfactory waivers by the bond holders and convertible noteholders), Exchanges, and regulatory approvals or consents, lack of material changes with respect to the parties and their respective businesses;\n• the synergies expected from the Acquisition not being realized;\n• loss of key personnel of PX Energy upon completion of the Acquisition;\n• the implementation of Bill 21 by the Government of Quebec;\n• volatility in the oil and gas industry;\n• prices, markets, and marketing of crude oil and natural gas;\n• prices, markets, and marketing of crude oil and natural gas;\n• alternatives to and changing demand for petroleum products;\n• inability of management to execute its business plan;\n• possible failure to realize anticipated benefits of acquisitions; and\n\nAdditional information regarding some of these risks, expectations or assumptions and other risk factors may be found in the Company's Annual Information Form for the year ended December 31, 2024, and other documents available on the Company's profile at www.sedarplus.ca. Readers are cautioned not to place undue reliance on these forward-looking statements. The forward-looking statements contained in this news release are made as of the date hereof and Questerre undertakes no obligations to update publicly or revise any forward-looking statements, whether as a result of new information, future events or otherwise, unless so required by applicable securities laws.\n\nThis news release is not an offer of securities for sale in the United States. Securities may not be offered or sold in the United States or to or for the account or benefit of US persons (as such terms are defined in Regulation S under the United States Securities Act of 1933, as amended (the \"U.S. Securities Act\")), absent registration or an exemption from registration. The securities offered have not been and will not be registered under the U.S. Securities Act or any state securities laws and, therefore, may not be offered for sale in the United States, except in transactions exempt from registration under the U.S. Securities Act and applicable state securities laws. This news release shall not constitute an offer to sell or the solicitation of an offer to buy nor shall there be any sale of the securities in any State in which such offer, solicitation or sale would be unlawful.",
  "medium": "Article",
  "links": [
    "https://www.globenewswire.com/NewsRoom/AttachmentNg/39b3134d-89f4-4104-bf3e-9841455e59c0",
    "http://www.sedarplus.ca"
  ],
  "labels": [
    {
      "name": "Press Release"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Questerre Energy Corporation",
      "weight": 0.06466312
    },
    {
      "name": "PX Energy transaction",
      "weight": 0.06420576
    },
    {
      "name": "PX Energy",
      "weight": 0.06040728
    },
    {
      "name": "acquisition",
      "weight": 0.059703674
    },
    {
      "name": "acquisitions",
      "weight": 0.059703674
    },
    {
      "name": "other risk factors",
      "weight": 0.058639072
    },
    {
      "name": "other financial partners",
      "weight": 0.05601816
    },
    {
      "name": "such statements",
      "weight": 0.055333648
    },
    {
      "name": "Special Purpose Acquisition Company",
      "weight": 0.05382258
    },
    {
      "name": "Questerre",
      "weight": 0.05368916
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.98193359375
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.876953125
    },
    {
      "name": "/Business & Industrial/Energy & Utilities/Oil & Gas",
      "score": 0.73193359375
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.67333984375
    }
  ],
  "sentiment": {
    "positive": 0.7673197,
    "negative": 0.019004226,
    "neutral": 0.21367607
  },
  "summary": "Questerre Energy Corporation (TSX,OSE:QEC) has updated the status of its proposed acquisition of Parana Xisto SA (PX Energy), a privately held oil shale production and refining company based in southern Brazil. The acquisition will be completed through acquisition of shares from PX Energy's indirect parent companies, Forbes & Manhattan Resources Inc. and Forbes Participaҫões Ltda. Michael Binnion, President & Chief Executive Officer of Questerry, stated that the company's top priority is completing due diligence on the Acquisition to ensure an accretive transaction for shareholders. Completion of the Acquisition is subject to several conditions including satisfactory due diligence review, board approval, standard regulatory approvals, and third-party approvals.",
  "shortSummary": "Questerre Energy Corporation updates its proposed acquisition of Parana Xisto SA, focusing on liquidity, while continuing negotiations with bondholders to ensure value.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "0b6f4a75d0e34b84ae0dd3c75f1c104f",
  "places": [],
  "scraped_sources": [
    {
      "url": "http://www.sedarplus.ca",
      "text": "Sign up for email alerts of financial disclosure documents\nSign up for email alerts of Cease Trade Orders and the Disciplined List\nSearch the archive for public documents filed prior to the launch of SEDAR+\nQUICK REFERENCE\nCSA National Systems Status\nAccess the most current information about CSA National Systems updates, scheduled maintenance and known issues that are being addressed\nSEDAR+ Fee Guide\nThe relevant regulatory filing fees governed by the provincial and territorial securities regulatory authorities\nSEDAR+ Resources\nRead the overview information on profiles, filings, payments and refunds, and records of cease trade orders and disciplinary actions in SEDAR+\nSEDAR+ Rules and Forms\nView the rules and access forms regarding the electronic transmission of documents and payments through SEDAR+\nActivity Reports\nAccess the annual reports of CSA member enforcement activities, intended to provide the public with a better contextual understanding of enforcement activities\nCrypto Trading Platforms\nView crypto trading platforms (CTPs) that are registered, filed a pre-registration undertaking, or banned from the Canadian Capital Markets\nInvestment Tools and Alerts\nLearn how investment frauds happen and how to protect your investments. The CSA has resources to help you understand how to detect potential scams and fraudulent activities."
    }
  ],
  "argos_summary": "Questerre Energy reports progress on its proposed acquisition of Parana Xisto SA, noting that due diligence confirms operational compliance and growth plans but also reveals a need for additional liquidity and ongoing discussions with bondholders and convertible note holders. The company stresses the strategic value of PX Energy’s oil‑shale and refining assets, while acknowledging that the deal’s completion depends on regulatory, shareholder, and third‑party approvals. Forward‑looking statements outline risks such as failure to close, market volatility, and potential loss of key personnel.",
  "argos_id": "1L52DHXO6"
}