{
  "url": "https://finance.yahoo.com/news/chinese-backer-uk-tech-takeover-160000515.html?_guc_consent_skip=1756052170",
  "authorsByline": "James Titcomb",
  "articleId": "4fba1b1c24084b01be9e37873d01a676",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://s.yimg.com/ny/api/res/1.2/3ZykhUE8l52s9J7E5VRNtQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03NTE7Y2Y9d2VicA--/https://media.zenfs.com/en/the_telegraph_818/fdba615f875405d13effd8023b098db0",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-24T16:00:00+00:00",
  "addDate": "2025-08-24T16:16:53.957470+00:00",
  "refreshDate": "2025-08-24T16:16:53.957471+00:00",
  "score": 1.0,
  "title": "Chinese backer of UK tech takeover accused of military ties",
  "description": "A Chinese tech giant funding the takeover of a British semiconductor company has been accused of links to the country’s military.",
  "content": "A Chinese tech giant funding the takeover of a British semiconductor company has been accused of links to the country’s military.\n\nGoertek, which is providing a £75m loan for the takeover of Plessey, co-operates with military research institutions and has fostered close relationships with the ruling Communist Party (CCP), according to researchers.\n\nA report from the Australian Strategic Policy Institute (ASPI), a think tank partly funded by the Australian defence department, said that the “extent of [Goertek’s] alignment with the CCP – which goes beyond the established ‘norm’ for Chinese companies – raises significant national-security concerns”.\n\nLast week, investment firm Haylo Labs bought Plymouth-based Plessey, which dates back to 1917 and is one of Britain’s last remaining high-tech manufacturers.\n\nThe deal is being financed by a five-year $100m (£75m) loan from Goertek, a Chinese tech giant.\n\nGoertek is a major supplier to tech companies including Apple and Meta but has also been accused of close links to the CCP.\n\nThe ASPI report said that the company had collaborated with the Qingdao Research Institute at Beihang University, a top military research institution that has been added to US export controls lists after accusations it had attempted to acquire American rocket and drone technology.\n\nJiang Bin, the company’s billionaire chairman and co-founder, is also a member of China’s National Congress.\n\nPlessey is a specialist in high-performance micro LEDs, an advanced screen technology that is expected to grow in the coming years amid the rise of virtual reality and augmented reality (AR) devices.\n\nThe company already supplies Meta, which is developing advanced smart glasses, having worked with the Silicon Valley giant for the last five years.\n\nHaylo Labs – founded by former executives at Snap and WaveOptics, a British smart glasses company – promised this week to invest £100m into Plessey, expanding its workforce and opening new manufacturing sites with Goertek overseas.\n\nGoertek will not have a stake in the business or any board influence, with the companies saying its interest extends only to financing.\n\nThe company already has deep relationships with Western companies, manufacturing on behalf of Apple, Meta and Google, and has a stake in the American display company Kopin, which supplies the US military.\n\nHowever, the ASPI, which has also been financed by the US state department, said the company was also involved in several technologies with potential military applications such as drones and technology to train pilots.\n\nThe deal has been assessed and cleared under British national security laws.",
  "medium": "Article",
  "links": [
    "https://www.telegraph.co.uk/business/2025/05/23/chinese-takeover-smoke-alarm-maker-national-security/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "tech companies",
      "weight": 0.10967043
    },
    {
      "name": "Chinese companies",
      "weight": 0.10453838
    },
    {
      "name": "Western companies",
      "weight": 0.0976534
    },
    {
      "name": "UK tech takeover",
      "weight": 0.07570107
    },
    {
      "name": "military research institutions",
      "weight": 0.075653575
    },
    {
      "name": "Goertek",
      "weight": 0.06859036
    },
    {
      "name": "British national security laws",
      "weight": 0.068147555
    },
    {
      "name": "advanced smart glasses",
      "weight": 0.06783651
    },
    {
      "name": "potential military applications",
      "weight": 0.065922275
    },
    {
      "name": "a British smart glasses company",
      "weight": 0.06590332
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.876953125
    },
    {
      "name": "/Business & Industrial/Aerospace & Defense/Other",
      "score": 0.85498046875
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.81982421875
    },
    {
      "name": "/News/Technology News",
      "score": 0.7998046875
    },
    {
      "name": "/People & Society/Social Sciences/Political Science",
      "score": 0.796875
    },
    {
      "name": "/Law & Government/Military/Other",
      "score": 0.75634765625
    },
    {
      "name": "/News/World News",
      "score": 0.69677734375
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.68212890625
    },
    {
      "name": "/Sensitive Subjects/War & Conflict",
      "score": 0.39404296875
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.302001953125
    }
  ],
  "sentiment": {
    "positive": 0.18549725,
    "negative": 0.29900402,
    "neutral": 0.5154987
  },
  "summary": "Chinese tech company Goertek, which is funding the takeover of British semiconductor company Plessey, has been accused of having links to the country's military. The Australian Strategic Policy Institute (ASPI), a think tank partly funded by the Australian defence department, stated that Goerte's alignment with the ruling Communist Party (CCP), which goes beyond the established ‘norm’ for Chinese companies, raises significant national-security concerns. Last week, investment firm Haylo Labs bought Plymouth-based Plessey. The deal is being financed by a five-year $100m loan from GoerTE, a major supplier to tech companies including Apple and Meta.",
  "shortSummary": "Goertek, a Chinese tech giant providing a £75m loan for UK-based Plessey, faces national security concerns due to its close ties to the military.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "81bc76edc630452087642ea01bfd5159",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Goertek, a Chinese tech giant with close ties to the CCP and military research institutions, is providing a £75m loan to finance the takeover of British semiconductor firm Plessey, sparking national‑security concerns highlighted by an ASPI report. The report notes Goertek’s collaboration with Beihang University’s Qingdao Research Institute and its involvement in military‑related technologies such as drones and pilot‑training systems. Plessey, a specialist in high‑performance micro‑LEDs for AR/VR and a supplier to Meta, is being acquired by Haylo Labs, which will invest £100m in the company while Goertek retains no equity or board influence. The deal has been cleared under UK national‑security laws despite the raised concerns.",
  "argos_id": "1V91H60JJ"
}