{
  "url": "https://finance.yahoo.com/news/asean-h1-2025-sales-edge-104539454.html",
  "authorsByline": "GlobalData",
  "articleId": "918597db926b4de88fe5741851f398e8",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://s.yimg.com/ny/api/res/1.2/teAS79CKX.ZSvJV.mZqatQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03OTk-/https://media.zenfs.com/en/just_auto_187/56b697b519add05ca0ea51e9b8e7cabb",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-22T10:45:39+00:00",
  "addDate": "2025-08-22T11:02:27.710543+00:00",
  "refreshDate": "2025-08-22T11:02:27.710544+00:00",
  "score": 1.0,
  "title": "ASEAN H1 2025 sales edge up, but risks remain to outlook – GlobalData",
  "description": "In H1 2025, ASEAN Light Vehicle (LV) sales marginally increased by 2% compared to the same period last year.",
  "content": "In H1 2025, ASEAN Light Vehicle (LV) sales marginally increased by 2% compared to the same period last year. The positive result was supported by stronger performances in the Philippines and Vietnam—the two smallest markets in the region—which helped to offset weaknesses in Malaysia, Indonesia, and\n\nThailand—the three largest markets in ASEAN5. Following four consecutive years of growth since 2021, LV demand in the Philippines continued to rise by 6% YoY in H1 2025, thanks to strong economic growth. The country’s GDP expanded by 5.4% YoY and 5.5% YoY in Q1 and Q2 2025, respectively, driven by strong domestic consumption and government expenditure. Additionally, the central bank cut the interest rate to 5.5% in April and continued to reduce it to 5.25% in June, marking the lowest rate in 2.5 years. The lower interest rate should support new vehicle sales due to the reduced cost of ownership. For the outlook, we have kept the Philippines’ 2025 sales forecast unchanged at 493k units (+4% YoY). However, the forecast carries upside risks since a) the central bank has hinted at further interest rate cuts during the remainder of the year, which would be positive for new vehicle sales and business investment, and b) the average annual sales volumes before the pandemic (2015-19) stood at 395k units per year, which is still higher than the post-pandemic average (2020-24) at 361k units. This could imply room for pent-up demand. Vietnam’s LV sales surged by 41% YoY in H1 2025. VinFast, the Vietnamese BEV manufacturer, has been a significant driver behind this growth, with the company achieving total deliveries of 67.6k EVs in the country. Of particular note are the VF 3 and VF 5 which emerged as the top-selling models. Looking ahead, we maintain a cautious outlook for 2025 and project total LV sales of 521k units (+12% YoY). Growth in H2 2025 is anticipated to decelerate, primarily due to a high comparative base established in the latter half of 2024. However, average monthly volumes for H2 2025 are expected to be approximately 47.6k units, which is higher than the H1 average of 39.2k units. Nonetheless, it is important to note that these volumes compare to a much lower H1 2024 monthly average of 27.8k units, while the H2 2024 average jumped to 50k units as the VinFast VF 3—the current best-selling model— was launched in August 2024 and contributed to the stronger performance. In contrast, Malaysia’s LV sales dropped by 4% YoY in H1 2025, and the registration data showed that volumes in July fell by 2% YoY. As such, the country’s LV market has now declined by 3% YoY from January to July overall. This is somewhat unexpected, given that the market set new record highs for three consecutive years: 711k units in 2022, 792k units in 2023, and 817k units in 2024. Therefore, a slowdown in sales is unsurprising.\n\nFor the outlook, we have marginally cut Malaysia’s 2025 sales total to 776k units, reflecting a 5% YoY decline. This is due to July sales being weaker than our projections, as well as an expected slowdown in GDP growth in H2 2025 as a result of the uncertainty in global trade. Indonesia's H1 2025 sales fell by 8% YoY. Recent data showed that volumes in July continued to decline by 18% YoY, even though the local association previously expected that the GAIKINDO Indonesia International Auto Show (GIIAS), which started from July 24, would boost LV demand due to new model launches and aggressive sales campaigns. However, the weakness in July could be attributed to a) new model launches and order bookings at the event being delivered in August, and b) although the number of visitors increased compared to last year’s event, order bookings were lower as buyers are considering and comparing options before making a decision. As such, Indonesia’s sales outlook remains unchanged at 749k units (-6% YoY), but we will promptly lower the outlook if demand in August continues to fall. LV sales in Thailand dropped by 3% YoY in H1 2025. A closer examination of the period reveals a mixed performance across segments: the PV sector recorded positive growth of 4% YoY, while the LCV segment faced significant challenges and experienced a substantial drop of 16% YoY. However, preliminary data for July indicates a nearly 10% YoY increase in LV sales. Nevertheless, the overall outlook for the LV market in 2025 remains unchanged from our previous forecasts, with volumes anticipated to reach 571k units (+1% YoY). This projection is tempered by expectations of a potential slowdown in sales in August, attributed to ongoing tensions between Thailand and Cambodia, as well as flooding in the northern regions of the country. In conclusion, ASEAN 2025 sales have been slightly lowered from 3.12 million units in our previous report to 3.11 million units in this report due to the downward adjustment for Malaysia. Moreover, the regional market outlook faces downside risks due to the negative sales momentum in Indonesia and the Thai-Cambodia border conflict, coupled with rising political uncertainty in Thailand. Thailand’s Constitutional Court suspended the Prime Minister from duty in July due to a leaked phone conversation with the ex-Cambodia Prime Minister, with a ruling set to take place on August 29. This article was first published on GlobalData’s dedicated research platform, the Automotive Intelligence Center. \"ASEAN H1 2025 sales edge up, but risks remain to outlook – GlobalData\" was originally created and published by Just Auto, a GlobalData owned brand. \n\n The information on this site has been included in good faith for general informational purposes only. It is not intended to amount to advice on which you should rely, and we give no representation, warranty or guarantee, whether express or implied as to its accuracy or completeness. You must obtain professional or specialist advice before taking, or refraining from, any action on the basis of the content on our site.",
  "medium": "Article",
  "links": [
    "https://www.globaldata.com/industries-we-cover/automotive/",
    "https://www.just-auto.com/news/asean-h1-2025-sales-edge-up-but-risks-remain-to-outlook-globaldata/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "LV sales",
      "weight": 0.09704817
    },
    {
      "name": "July sales",
      "weight": 0.09579151
    },
    {
      "name": "total LV sales",
      "weight": 0.09372799
    },
    {
      "name": "new vehicle sales",
      "weight": 0.08931239
    },
    {
      "name": "sales",
      "weight": 0.08525923
    },
    {
      "name": "aggressive sales campaigns",
      "weight": 0.07809895
    },
    {
      "name": "LV demand",
      "weight": 0.067143336
    },
    {
      "name": "new model launches",
      "weight": 0.06194178
    },
    {
      "name": "strong economic growth",
      "weight": 0.06008473
    },
    {
      "name": "positive growth",
      "weight": 0.057830848
    }
  ],
  "topics": [
    {
      "name": "ASEAN Summit"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Economy News",
      "score": 0.98193359375
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.89208984375
    },
    {
      "name": "/People & Society/Social Sciences/Economics",
      "score": 0.59521484375
    },
    {
      "name": "/Business & Industrial/Automotive Industry",
      "score": 0.4697265625
    }
  ],
  "sentiment": {
    "positive": 0.7049158,
    "negative": 0.14293289,
    "neutral": 0.15215127
  },
  "summary": "In H1 2025, ASEAN Light Vehicle (LV) sales increased by 2% compared to the same period last year, largely due to strong performances in the Philippines and Vietnam. These results offset weaknesses in Malaysia, Indonesia, and Thailand, the three largest markets in ASEAS. The Philippines' GDP expanded by 5.4% YoY and 5.5% YoYo in Q1 and Q2 2025, driven by strong domestic consumption and government expenditure. The central bank reduced its interest rate to 5.25% in June, marking the lowest rate in 2.5 years. However, the forecast carries upside risks as the central bank has hinted at further interest rate cuts. Looking ahead, GlobalData projects total LV sales of 521k units for 2025, with average monthly volumes expected to be approximately 47.6k units, higher than the H1 average of 39.2k units. Malaysia's LV sales dropped by 4% Yo2019 and registration data showed that volumes in July fell by 2%. Indonesia's LV market has now declined by 3%. Despite this, the overall outlook for the LV market remains unchanged.",
  "shortSummary": "In H1 2025, ASEAN Light Vehicle sales slightly increased, driven by stronger performances in the Philippines and Vietnam, but risks remain amid high global trade uncertainty.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "1010fd74d1f24c55a2e482d8ad1ab925",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.globaldata.com/industries-we-cover/automotive/",
      "text": "Using the collective power of trusted data, market intelligence, expert knowledge, and advanced technology, we empower the Automotive Industry with data-driven insights and precise forecasts you need to decode the future in uncertain times.\nOur solutions are designed to help you with key strategic activities to:\nWith GlobalData’s Intelligence Center, you will gain access to real-time insights tailored to your specific needs. From competitor activity to comprehensive Auto sales forecasts, to granular insights into emerging market trends, to fluctuating market conditions, we deliver the information necessary to optimize production planning, streamline supply chain operations, and identify lucrative market opportunities.\nAs a Supplier, staying ahead of the competition and maximizing your opportunities in the Automotive industry is crucial. We understand the unique challenges you face, from optimizing your supply chain to identifying growth opportunities and mitigating risks. Balance the shifting demand of OEMs while searching for the future sourcing opportunities, and transformative industry trends.\nWith our expert analysis and innovative sector solutions, we empower organizations to delve deep into the automotive sector and gain a detailed understanding of its dynamics – providing you with the most comprehensive and up-to-date information available, helping you stay ahead of the curve. You will get a detailed understanding of the automotive sector – where the industry has been, where it is today and what is driving change tomorrow.\nWe cover the entire spectrum of the global automotive industry, macroeconomic drivers and external shocks/disruptions to the outlook for light vehicle sales, light vehicle production, light vehicle powertrains, the tyre & rubber sector, hybrid & electric vehicles (EVs) with sector-specific automotive forecasts, including parc forecasts, vehicle component analysis, and manufacturer factory footprints across the globe.\nWith in-depth analysis, exclusive news, and highly detailed forecasts and databases at your fingertips, we give you a complete 360-degree insight into the Automotive industry.\nDecode the future by discovering our Automotive Industry Solution. Request a free no-obligation run-through of our unique and powerful tools.\nWe produce hundreds of quantitative and qualitative reports annually. Ranging from strategic reports, industry forecast reports, sector reports, panel reports, insight reports, trend trackers, and country profiles.\nOur consulting services provide you with contextualized, real time market insights. Our consultants are highly experienced in helping clients identify new opportunities, minimize risk, gain competitive advantage and improve profitability."
    }
  ],
  "argos_summary": "ASEAN light‑vehicle sales edged up 2% in H1 2025, largely thanks to strong growth in the Philippines (6% YoY) and Vietnam (41% YoY, driven by VinFast’s EV deliveries), which offset declines in Malaysia, Indonesia and Thailand. Forecasts for 2025 are modestly revised: the Philippines is expected to sell 493k units (+4% YoY), Vietnam 521k (+12% YoY), Malaysia 776k (5% decline), Indonesia 749k (6% decline), and Thailand 571k (+1% YoY), bringing total ASEAN sales to 3.11 million units. Key upside risks include further interest‑rate cuts in the Philippines and pent‑up demand, while downside risks stem from Indonesia’s weak sales momentum, the Thai‑Cambodia border conflict, and political uncertainty in Thailand. Overall, the outlook remains cautious, with potential volatility in H2 2025 as new model launches and geopolitical tensions could impact demand.",
  "argos_id": "2997M0N48"
}