{
  "url": "https://www.ibtimes.com/israeli-strikes-yemens-capital-kill-four-huthis-say-3781570",
  "authorsByline": "AFP News",
  "articleId": "4ef16c91f08e4ac783ab6e6e722107ae",
  "source": {
    "domain": "ibtimes.com",
    "location": {
      "country": "us",
      "state": "AZ",
      "county": "Pima County",
      "city": "Tucson",
      "coordinates": {
        "lat": 32.1988848,
        "lon": -110.8218543
      }
    }
  },
  "imageUrl": "https://d.ibtimes.com/en/full/4617694/israeli-army-said-it-had-hit-military-compound-where-presidential-palace-located.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-24T16:15:19-04:00",
  "addDate": "2025-08-24T20:22:11.700751+00:00",
  "refreshDate": "2025-08-24T20:22:11.700754+00:00",
  "score": 1.0,
  "title": "Israeli Strikes In Yemen's Capital Kill Four, Huthis Say",
  "description": "Israeli strikes in Yemen's capital Sanaa on Sunday killed at least four people, according to the country's Iran-backed Huthi rebels, who have repeatedly launched missiles and drones at Israel throughout the Gaza war.",
  "content": "Israeli strikes in Yemen's capital Sanaa on Sunday killed at least four people, according to the country's Iran-backed Huthi rebels, who have repeatedly launched missiles and drones at Israel throughout the Gaza war.\n\nAFP images showed a large fireball lighting up the skies over the rebel-held capital, leaving behind a column of thick, black smoke.\n\nA spokesperson for the Huthis' health ministry reported four people dead and 67 wounded in the Israeli raid, raising an earlier toll.\n\nA Huthi security source told AFP the strikes had targeted a building in central Sanaa. The group's Al-Masirah TV reported they had also hit an oil company facility and a power station in Sanaa's south already struck last Sunday.\n\nThe Israeli army said it had hit a military compound where the presidential palace is located, along with two power stations and a fuel depot.\n\nThe strikes were \"in response to repeated attacks by the Huthi terrorist regime against the State of Israel and its civilians\", including \"in recent days\", it said.\n\nLate Friday, the Huthis fired a missile that Israeli authorities said had \"most likely fragmented in mid-air\".\n\nMedia outlets the Times of Israel and Ynet, citing the Israeli military, reported the missile had carried a cluster warhead, the first of its kind known to have been fired from Yemen.\n\nThe Israeli defence ministry released a photo on Sunday showing Prime Minister Benjamin Netanyahu, Defence Minister Israel Katz and army chief Eyal Zamir following the strikes in Yemen from a command bunker.\n\nIn a statement released by his office, Netanyahu said the air force had struck \"the presidential palace in the heart of the capital Sanaa, the city's power plant and the fuel tanks that supply it\".\n\n\"The terrorist Huthi regime is learning the hard way that it will pay -- and has paid already -- a very high price for its aggression against the State of Israel,\" he said, adding \"the whole region\" was also learning a lesson in Israeli power.\n\nIn a statement from their political bureau, the Huthis vowed to respond, saying they would \"not deviate from the fight\" against Israel and its ally the United States \"until the aggression stops and the (Israeli) blockade on Gaza is lifted\".\n\nSince the October 2023 start of the Israel-Hamas war in the Gaza Strip, the Huthis have repeatedly fired missiles and drones at Israel, claiming to be acting in solidarity with the Palestinians.\n\nMost of the Huthi attacks have been intercepted, but they have prompted retaliatory Israeli air strikes on rebel targets in Yemen.\n\nOn August 17, Israel said it targeted an energy infrastructure site in Sanaa linked to the Huthis, with Al-Masirah reporting at the time the capital's Haziz power station was hit.\n\nIsraeli Defence Minister Israel Katz said earlier this month that the Huthis would \"pay with compound interest for every attempt to fire at Israel\".\n\nBeyond attacks on Israel itself, the Huthis have also targeted ships they say are linked to the country in the Red Sea and Gulf of Aden.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Israeli Defence Minister Israel Katz",
      "weight": 0.10664998
    },
    {
      "name": "Israeli Strikes",
      "weight": 0.099202454
    },
    {
      "name": "Israeli strikes",
      "weight": 0.099202454
    },
    {
      "name": "Israel Katz",
      "weight": 0.09661867
    },
    {
      "name": "Israeli power",
      "weight": 0.096429504
    },
    {
      "name": "retaliatory Israeli air strikes",
      "weight": 0.09606715
    },
    {
      "name": "Defence Minister Israel Katz",
      "weight": 0.09357862
    },
    {
      "name": "Israel",
      "weight": 0.09334379
    },
    {
      "name": "Israeli authorities",
      "weight": 0.08329245
    },
    {
      "name": "Israeli",
      "weight": 0.08240658
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Other",
      "score": 0.97314453125
    },
    {
      "name": "/Sensitive Subjects/War & Conflict",
      "score": 0.92578125
    },
    {
      "name": "/News/World News",
      "score": 0.7431640625
    },
    {
      "name": "/Sensitive Subjects/Death & Tragedy",
      "score": 0.697265625
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.5751953125
    }
  ],
  "sentiment": {
    "positive": 0.06637263,
    "negative": 0.6929709,
    "neutral": 0.24065655
  },
  "summary": "Israeli strikes in Yemen's capital Sanaa have killed at least four people, according to the Huthi rebels. The rebels have been launching missiles and drones at Israel throughout the Gaza war. The Israeli army said the strikes were in response to repeated attacks from the Hothi regime. The Huthis have vowed to continue their fight against Israel and its ally the United States until the Israeli blockade on Gaza is lifted. Israeli Prime Minister Benjamin Netanyahu said the air force had struck \"the presidential palace in the heart of Sanaa, the city's power plant and the fuel tanks that supply it\".",
  "shortSummary": "Israeli strikes in Yemen's capital Sanaa killed four people and wounded 67 others, following Huthi rebels' repeated attacks on Israel during the Gaza war.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "90b37876080e45849c2aaf63f95da976",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Israeli forces struck Yemen’s capital Sanaa, killing at least four people and damaging the presidential palace, a power plant and fuel depot, in retaliation for Huthi missile attacks. The Huthis, who have fired missiles and drones at Israel in support of the Gaza war, claimed the raid hit a central building and an oil facility. Israel said the strikes targeted military sites and were a response to repeated Huthi aggression, while the Huthis vowed to keep fighting until the Gaza blockade ends.",
  "argos_id": "2KTE25NMW"
}