{
  "url": "https://patch.com/pennsylvania/doylestown/bucks-co-health-department-spray-mosquitoes-warrington",
  "authorsByline": "Jeff Werner",
  "articleId": "05eba7a2c9194c4ebec01be084719234",
  "source": {
    "domain": "patch.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://patch.com/img/cdn20/users/26019821/20250824/114259/styles/patch_image/public/warrington-township-building___24233811044.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-25T03:43:01+00:00",
  "addDate": "2025-08-25T03:49:32.960312+00:00",
  "refreshDate": "2025-08-25T03:49:32.960316+00:00",
  "score": 1.0,
  "title": "Bucks Co. Health Department To Spray For Mosquitoes In Warrington",
  "description": "According to the health department, the treatment will be administered via truck-mounted equipment, spraying targeted mosquito habitats.",
  "content": "WARRINGTON TOWNSHIP, PA — The Bucks County Department of Health Mosquito Disease Control \n\nProgram will conduct an ultra-low volume (ULV) mosquito control operation over two days on Monday, August 25, beginning at 7:45 p.m. in Warminster and Warrington townships to reduce high \n\npopulations of nuisance mosquitoes and mosquitoes capable of transmitting West Nile Virus.\n\nAccording to the health department, the treatment will be administered via truck-mounted equipment, spraying mosquito habitats in residential and park locations. Trucks used in the spray are identified with Bucks County seal logos located on the doors. The equipment dispenses Duet at a rate of 0.75 ounces per acre. The product is designed to provide quick, effective control of adult mosquito populations. The application materials have a very low toxicity profile to mammals and will have negligible impact to non-target insects and the environment, according to the health department. Treatments will take place in Warminster Township bound by Valley Road, West Bristol Road, York Road (Route 263), Emma Lane, Sloan Road, Worthington Drive, and Park Heights Avenue. In addition, areas bound by West Bristol Road, Mearns Road, Orchard Avenue, Roberts Road, Tennyson Drive, Mueller Road, Ivyland Road, Brennan Drive, and Bellemeade Drive will be treated.\n\nCertain mosquito species carry the West Nile Virus, which can cause humans to contract West Nile encephalitis, an infection that can result in an inflammation of the brain. According to the Pennsylvania Department of Health, all residents in areas where virus activity has been identified \n\nare at risk of contracting West Nile encephalitis. Weather conditions and other unexpected events could delay or cancel the spray operation. If conditions do not allow application on Day 1 of the operation on August 25, subsequently Tuesday evening, August 26, will serve as the backup spray date. If conditions do not allow application on \n\nDay 2 of the operation on August 26, subsequently Wednesday evening, August 27, will serve as the backup spray date.\n\nResidents can help protect themselves and their community from West Nile Virus by getting rid of standing water around their home. Mosquitoes can breed in even small amounts of water that could be found in items including flowerpots, buckets, toys and clogged gutters. Using bug spray and wearing long sleeves, especially around dawn and dusk, can also help keep bites away. To learn more about mosquitoes and West Nile Virus, visit www.dep.pa.gov/westnile If you have questions or want to report a concern, give the Bucks County Department of Health a call at 215-345-3318.",
  "medium": "Article",
  "links": [
    "https://patch.com/pennsylvania/doylestown/around-town",
    "http://www.dep.pa.gov/westnile"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "West Nile Virus",
      "weight": 0.10566099
    },
    {
      "name": "West Bristol Road",
      "weight": 0.10049279
    },
    {
      "name": "West Nile encephalitis",
      "weight": 0.099393055
    },
    {
      "name": "mosquito habitats",
      "weight": 0.08394224
    },
    {
      "name": "nuisance mosquitoes",
      "weight": 0.08310679
    },
    {
      "name": "adult mosquito populations",
      "weight": 0.08237566
    },
    {
      "name": "Mosquitoes",
      "weight": 0.08140796
    },
    {
      "name": "mosquitoes",
      "weight": 0.08140796
    },
    {
      "name": "Certain mosquito species",
      "weight": 0.07875562
    },
    {
      "name": "Bucks Co. Health Department",
      "weight": 0.07736922
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Health"
    }
  ],
  "taxonomies": [
    {
      "name": "/Health/Public Health/Other",
      "score": 0.92578125
    },
    {
      "name": "/News/Local News",
      "score": 0.88720703125
    },
    {
      "name": "/Health/Health Conditions/Infectious Diseases/Other",
      "score": 0.7041015625
    },
    {
      "name": "/News/Health News",
      "score": 0.63232421875
    }
  ],
  "sentiment": {
    "positive": 0.12049163,
    "negative": 0.3066363,
    "neutral": 0.57287204
  },
  "summary": "The Bucks County Department of Health Mosquito Disease Control will conduct an ultra-low volume (ULV) mosquito control operation on August 25 in Warminster and Warrington townships. The operation aims to reduce high populations of nuisance mosquitoes and mosquitoes capable of transmitting West Nile Virus. The treatment will be administered via truck-mounted equipment, which dispenses Duet at a rate of 0.75 ounces per acre. The application materials have a low toxicity profile to mammals and will have negligible impact on non-target insects and the environment. All residents in areas where virus activity has been identified are at risk of contracting West Nile encephalitis.",
  "shortSummary": "The Bucks County Department of Health will conduct an ultra-low volume mosquito control operation on August 25 and 28 to reduce populations susceptible to West Nile virus infections.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "728ed68164c34d519ff8c7876d90c8f7",
  "places": [
    {
      "osmId": "12272999",
      "road": "Tennyson Drive",
      "town": "Warminster Township",
      "county": "Bucks County",
      "state": "Pennsylvania",
      "postcode": "18974",
      "country": "United States",
      "countryCode": "us",
      "coordinates": {
        "lat": 40.213323,
        "lon": -75.097063
      }
    },
    {
      "osmId": "12362254",
      "road": "Worthington Drive",
      "town": "Warminster Township",
      "county": "Bucks County",
      "state": "Pennsylvania",
      "postcode": "18974",
      "country": "United States",
      "countryCode": "us",
      "coordinates": {
        "lat": 40.222543,
        "lon": -75.115028
      }
    },
    {
      "osmId": "12350102",
      "road": "Park Heights Avenue",
      "town": "Warminster Township",
      "county": "Bucks County",
      "state": "Pennsylvania",
      "postcode": "18974",
      "country": "United States",
      "countryCode": "us",
      "coordinates": {
        "lat": 40.221443,
        "lon": -75.121265
      }
    },
    {
      "osmId": "12303726",
      "road": "Mueller Road",
      "town": "Warminster Township",
      "county": "Bucks County",
      "state": "Pennsylvania",
      "postcode": "18974",
      "country": "United States",
      "countryCode": "us",
      "coordinates": {
        "lat": 40.215211,
        "lon": -75.096811
      }
    },
    {
      "osmId": "12370277",
      "road": "Ivyland Road",
      "town": "Warminster Township",
      "county": "Bucks County",
      "state": "Pennsylvania",
      "postcode": "18974",
      "country": "United States",
      "countryCode": "us",
      "coordinates": {
        "lat": 40.2106241,
        "lon": -75.0793701
      }
    },
    {
      "osmId": "12303137",
      "road": "Emma Lane",
      "town": "Warminster Township",
      "county": "Bucks County",
      "state": "Pennsylvania",
      "postcode": "18974",
      "country": "United States",
      "countryCode": "us",
      "coordinates": {
        "lat": 40.219214,
        "lon": -75.103831
      }
    },
    {
      "osmId": "12307303",
      "road": "Bellemeade Drive",
      "town": "Warminster Township",
      "county": "Bucks County",
      "state": "Pennsylvania",
      "postcode": "18974",
      "country": "United States",
      "countryCode": "us",
      "coordinates": {
        "lat": 40.22395,
        "lon": -75.09389
      }
    },
    {
      "osmId": "12278209",
      "road": "Roberts Road",
      "town": "Warminster Township",
      "county": "Bucks County",
      "state": "Pennsylvania",
      "postcode": "18974",
      "country": "United States",
      "countryCode": "us",
      "coordinates": {
        "lat": 40.215812,
        "lon": -75.091888
      }
    },
    {
      "osmId": "12293731",
      "road": "Orchard Avenue",
      "town": "Warminster Township",
      "county": "Bucks County",
      "state": "Pennsylvania",
      "postcode": "18974",
      "country": "United States",
      "countryCode": "us",
      "coordinates": {
        "lat": 40.20481,
        "lon": -75.093797
      }
    },
    {
      "osmId": "12287839",
      "road": "Brennan Drive",
      "town": "Warminster Township",
      "county": "Bucks County",
      "state": "Pennsylvania",
      "postcode": "18974",
      "country": "United States",
      "countryCode": "us",
      "coordinates": {
        "lat": 40.221888,
        "lon": -75.093315
      }
    },
    {
      "osmId": "48357577",
      "road": "Mearns Road",
      "town": "Warminster Township",
      "county": "Bucks County",
      "state": "Pennsylvania",
      "postcode": "18974",
      "country": "United States",
      "countryCode": "us",
      "coordinates": {
        "lat": 40.2110168,
        "lon": -75.0856206
      }
    }
  ],
  "scraped_sources": [
    {
      "url": "https://patch.com/pennsylvania/doylestown/around-town",
      "text": "According to the health department, the treatment will be administered via truck-mounted equipment, spraying targeted mosquito habitats.\nExpanded fairgrounds, 115 vendors, daily costume contests, and exciting new additions await guests at the historic TileWorks.\nThe event offers beer enthusiasts plenty of room to enjoy the one-of-a-kind setting while sampling a variety of regional craft brews.\nArchbishop Wood Cheerleaders to Join Giant Supermarket for a Food Drive to be Held on August 30\nThe Thompson Performing Arts series continues this week with a concert by the Journey tribute band, Frontiers, on Thursday.\nResidents and businesses are encouraged to turn their lights off or dim outdoor-facing lights between 11 p.m. and 5 a.m.\nSince 1989, the Good Bears Committee at Doylestown Senior Living Community has donated 27,000 hand-crafted teddy bears to area hospitals.\nThis weekend is filled with fun things to do, from a celebration of Bucks County agriculture to a sea of gold and sunshine.\nGuided tours will now be offered on Saturdays, providing a rare behind-the-scenes look at how the mill continues its stone milling process.\nLearn important tactics to keep kids safe from harm\nComedian Tony Braithwaite, joined by pianist Dan Matarazzo, channels the icons of the Borscht Belt through masterful impersonations.\nThe workshops will help parents and caregivers prepare for tough, yet important, conversations with their children about child sexual abuse.\nThe Thompson Performing Arts Series continues this week with back-to-back concerts by the Rock This Town Orchestra and Soul Cruisers.\nHammerstein composed the lyrics to Oklahoma!, South Pacific, and more at the iconic desk, now on view at the Doylestown.\nAnnounces 2025 Scholarship Winners\nFrom a cornfield to outer space, the 15-year-old participated in a summer space camp experience in rural Indiana.\nOver the past 15 years, 228 college students have completed the program, contributing more than 65,000 service hours\nThe sand sculptures feature a jungle full of safari animals including elephants, rhinoceros, lions, gorillas, and more.\nDuring the farm's 2025 Sunflower Days, visitors are invited to take a leisurely walk or a hayride to the farm's enchanting sunflower fields.\nTo better serve the Upper Bucks and Upper Montco community, Visiting Angels cut the ribbon on its new satellite office in Quakertown.\nThe repair stations include all the tools necessary to perform basic bike repairs and maintenance, from changing a flat to adjusting brakes\nThe Bucks County Tour of Honor recognizes the courage and sacrifice of members of the United States military.\nDoylestown Borough in July approved a new agreement with Stage United to bring two more live concerts to town in September.\nAs mandated by the Pennsylvania Department of Environmental Protection, all blasting activities will be monitored and conducted according to\nStevieMac will take the stage beginning at 7 p.m. in a performance that \"authentically and flawlessly pays tribute\" to Fleetwood Mac.\nWeekend summer festivals will celebrate peach and sweet corn season with themed events, food and entertainment.\nThe weekend event will include local peaches, peach pies, and other treats, live music, shopping, and family activities.\nFarms owned by the same family for at least 100 consecutive years are eligible to be named a Pennsylvania Century Farm.\nThe new length will add four laps to the race on the 1.4 mile course and bring the total feet of climbing to nearly 2000.\nKeystone Opportunity Center Received $19,000; The Leukemia & Lymphoma Society Eastern PA–Delaware Received $14,020\nPAL program to provide unique athletic opportunity for students ages 11-17; promotes mentorship & positive engagement with Law Enforcement.\nGrant to be used to renovate multi-purpose training & healing space\nThe new system will bring PFAS levels into regulatory limits, significantly reducing health risks associated with PFAS contamination.\nThe 34th annual festival will host more than 40 musicians on five stages throughout the weekend.\n\"Frontiers\" to perform Journey's chart-topping hits including \"Don't Stop Believing,\" \"Faithfully,\" \"Separate Ways\" and \"Send Her My Love.\"\nBurpee to open Fordhook Farm for a one-day-only behind-the-scenes tour of its breeding and garden trial operations.\nThe skies over Sellersville lit up once again on Friday, July 11, during the annual Sellersville Volunteer Fire Department Carnival.\nThe concert series presents the Legacy Band on Wednesday night and Jesse Garron's tribute to Elvis on Friday night.\nThe program provides opportunities for volunteers to spend time in and around nature while helping to sustain and improve treasured parks.\nDuring the show, Rotarians handed out $30,000 in donations to seven community groups and nonprofit organizations.\nCommon Musculoskeletal Conditions Related to Neck Pain\nHow Failed Back Surgeries can Cause a Life Filled with Chronic Pain\nWhat to Look out for when Managing Stressors\nOptions for Treating Nerve Pain at the Source\nCoping with Pain Symptoms and Fatigue\nIt’s Time to Bring the Heat!\nKeeping your body healthy with Physical Activity\nStrengthening your Mind and Body as you Age\nSurgery Alternatives for Joint & Bone on Bone Pain\nHelpful Information for Treatments Other Than Medication"
    },
    {
      "url": "http://www.dep.pa.gov/westnile",
      "text": "Submit a report or find your county coordinator\nCurrent Counties Positive for West Nile Virus and Jamestown Canyon Virus\nThese static maps show 2025 positive West Nile Virus counties in red and 2025 positive Jamestown Canyon Virus counties in yellow.\n-\n2025 West Nile Virus Activity by County\n-\n2025 Jamestown Canyon Virus Activity by County\n-\nEastern Equine Encephalitis Virus Fact Sheet\n-\nJamestown Canyon Virus Fact Sheet\n-\nLa Crosse Virus Fact Sheet\n-\nWNV Fact Sheet\n-\nA Guide to Homeowner Mosquito Control (English)\n-\nA Guide to Homeowner Mosquito Control (Spanish)\n-\nSee Previous Years Surveillance Results\nMosquito Testing Data For additional information regarding these data, please contact brocoder@pa.gov\nIn 2000, West Nile Virus appeared in Pennsylvania for the first time. To help detect, track, and control the virus, the Pennsylvania Departments of Health, Environmental Protection, and Agriculture developed a comprehensive surveillance program. Pennsylvania's plan uses the principles of Integrated Pest Management (IPM) and focuses on education, habitat reduction, surveillance, and control.\nThe Department of Health is conducting laboratory testing to confirm West Nile Virus cases, and monitoring any possible human cases. In addition, it has been working with healthcare providers across the state to educate them about the signs and symptoms of West Nile Virus.\nDEP coordinates the Commonwealth's mosquito control program with representatives from 50 counties at the highest risk of mosquito-borne disease to develop a comprehensive mosquito surveillance and control network. The foundation of this collaborative effort is based on integrated pest management principles. Since the virus is transmitted by mosquitoes, early detection and control are key. The program is a gold member of EPA's pesticide environmental stewardship program. The Department of Environmental Protection, with the support of the legislature, provides funding to this network of counties to protect against disease and alleviate public nuisances.\nThe Department of Agriculture is monitoring animal populations for any signs of the virus. Due to the impact of WNV on the ruffed grouse, the Pennsylvania Game Commission collaborates with the PA program to track the intensity of seasonal WNV. Seasonal data is used, in part, to determine hunting season length of the ruffed grouse.\nSince 2000, Pennsylvania's State budget has included funding to prevent and mitigate the potential public health effects of West Nile on the citizens of the Commonwealth. The funds provide necessary staffing and an improved epidemiological infrastructure to monitor and control the virus. This network, which covers 38 counties, includes mosquito and bird surveillance and monitoring people and horses. Please explore our site to find out more about how you can help reduce your risk of disease exposure, to learn about West Nile Virus or the latest surveillance update from your area.\nPlease Note: The PA West Nile Virus Control Program is not a hospital or clinical facility; we do not see patients and are unable to diagnose your illness, provide treatment, prescribe medication, or refer you to specialists. If you have a medical emergency, contacting the PA WNV Control Program is not the proper way to get immediate help. If you are a patient, please see your health care provider or the nearest emergency room. If you are a health care provider, please contact your state epidemiologist or local health department.\nCommonwealth of Pennsylvania WNV Plan\nWest Nile Virus is a mosquito-borne disease that can cause encephalitis, a brain inflammation and is typically spread by the bite of a mosquito. West Nile Virus was first detected in North America in 1999 and found in Pennsylvania in 2000. Prior to that, it had only been found in Africa, Eastern Europe, and West Asia.\nIn Pennsylvania, West Nile Virus maintains itself in nature by cycling between mosquitoes in the genus Culex and certain species of birds. A mosquito (the vector) bites an uninfected bird (the host), the virus amplifies within the bird, an uninfected mosquito bites the bird and is in turn infected. This cycle compounds itself through summer and fall, increasing the likelihood of someone being bitten by a diseased mosquito.\nWest Nile Fever and Encephalitis\nWest Nile fever is a case of mild disease in people, characterized by flu-like symptoms. West Nile fever typically lasts only a few days and does not appear to cause any long-term health effects. More severe diseases due to a person being infected with this virus can be “West Nile encephalitis,” West Nile meningitis or West Nile meningoencephalitis. Encephalitis refers to an inflammation of the brain, meningitis is an inflammation of the membrane around the brain and the spinal cord, and meningoencephalitis refers to inflammation of the brain and the membrane surrounding it.\nHow can I get West Nile Virus?\nThe principal route of human infection with West Nile virus is through the bite of an infected mosquito. Additional routes of infection have become apparent as scientists and physicians continue to study the virus, they include blood transfusion and organ transplantation. It is important to note that these other methods of transmission represent a very small proportion of cases. Other methods of transmission include blood transfusion, organ transplantation, mother-to-child (ingestion of breast milk and transplacental) and occupational.\nAll residents of areas where virus activity has been identified are at risk of getting West Nile encephalitis; persons over 50 and immunocompromised individuals are at increased risk for WNV disease.\nWhat are the symptoms?\nPeople with mild infections may experience fever, headache, body aches, skin rash and swollen lymph glands. Most people who are infected with the West Nile Virus will not have any type of illness. It is estimated that 1 in 5 people who become infected will develop West Nile fever: mild symptoms, including fever, headache, and body aches, occasionally with a skin rash on the trunk of the body and swollen lymph glands.\nThe symptoms of severe infection (West Nile encephalitis or meningitis) include headache, high fever, neck stiffness, stupor, disorientation, coma, tremors, convulsions, muscle weakness, and paralysis. It is estimated that 1 in 150 persons infected with the West Nile Virus will develop a more severe form of disease.\nSymptoms of mild disease will generally last a few days. Symptoms of severe disease may last several weeks, although neurological effects may be permanent.\nIs there treatment or a vaccine?\nThere is no specific treatment or vaccine for West Nile Virus infection. Most people fully recover from the virus. In more severe cases, intensive supportive therapy is indicated, often involving hospitalization, intravenous fluids, airway management, respiratory support (ventilator), prevention of secondary infections (pneumonia, urinary tract, etc.), and good nursing care.\nTesting Mosquitoes for West Nile Virus in Pennsylvania\nPennsylvania tests between 1 and 1.5 million mosquitoes for West Nile virus each year. So how do we do it? At DEP's Bureau of Labs, the testing process includes multiple steps to test for West Nile at the cellular level.\nDid you know that standing water in something as small as a bottle cap can provide enough space for a mosquito egg raft? This tiny raft of eggs can produce as many as 300 mosquitoes.\nHelp Prevent Mosquitoes From Breeding\nPennsylvania residents are encouraged to help eliminate mosquito habitat by getting rid of standing and stagnant water where mosquitoes lay eggs. Common places water can accumulate are outdoor features like potted plants and birdbaths, yard debris like, storage bins, kids’ toys (including kiddie pools), rain gutters, and even corrugated downspouts.\nTurn over plastic wading pools when not in use. Stagnant water in a wading pool becomes a place for mosquitoes to breed.\nDispose of tin cans, plastic containers, ceramic pots, or similar water-holding containers that have collected on your property.\nTurn over wheelbarrows and don't let water stagnate in birdbaths. Both provide breeding habitats for domestic mosquitoes.\nAerate ornamental pools or stock them with fish. Water gardens can become major mosquito producers if they are allowed to stagnate. Clean and chlorinate swimming pools not in use. Mosquitoes may even breed in the water that collects on pool covers.\nPay special attention to discarded tires. Stagnant water in tires is an excellent habitat for mosquitoes to thrive.\nEliminating tires from urban environments is critical to reducing mosquito populations associated with transmitting diseases from mosquitoes.\nIf West Nile virus is found in your area, here are some ways you can protect yourself:\nWear shoes, socks, long pants, and a long-sleeved shirt when outdoors for long periods of time, or when mosquitoes are most active. Mosquitoes are most active at dusk and dawn, although the invasive Asian tiger is known to bite predominately during daylight hours.\nConsider the use of mosquito repellent, according to directions, when it is necessary to be outdoors. Wash all treated skin and clothing when returning indoors.\nTips to prevent mosquito bites\nThese simple precautions can help prevent mosquito bites.\nDEP and county mosquito control professionals have been using Bacillus thuringiensis israelensis (Bti), a naturally occurring soil bacteria. This material is now becoming widely available for you to buy and use yourself at home.\nBti can be purchased in small, donut-shaped form, often called \"mosquito dunks\", which are useful in small areas of standing water, such as a birdbath or small puddle of water that may gather in a low spot on your property. A granular form of Bti is available and effective for larger areas, such as backyard ponds.\nBti can be purchased in many lawn and garden, outdoor supply, and home improvement stores. The great thing about this bacteria is that it kills only mosquito and black fly larvae. It is not harmful to people, pets, aquatic life (such as fish) or plants.\nThe best way to control mosquitoes is to eliminate standing water on your property. If you do decide to use mosquito dunks, make sure to follow label and application instructions.\nSomething as innocuous as this ornamental pond can produce millions of mosquitoes capable of transmitting disease. Ornamental ponds with permanent standing water should be aerated or treated with Bti to reduce mosquito bites and West Nile Virus transmission.\nWest Nile Virus has been detected in a variety of bird species. Some infected birds, especially robins, crows, jays, and raptors are known to get sick and die from the infection. Reporting and testing of dead birds is one way to check for the presence of West Nile Virus in the environment. Incidents of dead or sick birds involving robins, crows, jays or raptors can be reported on this website or to your local county WNV coordinator.\nWest Nile Virus is transmitted to birds through the bite of infected mosquitoes. Mosquitoes become infected by biting infected birds. Some birds that are predators (such as hawks and owls) or scavengers (such as crows) may become infected after eating sick or dead birds that were already infected with West Nile Virus.\nHow You Can Help With Dead Bird Reporting\nReporting of dead birds is a good way to check for West Nile Virus activity in the environment and allow implementation of prevention and control measures to minimize the spread of the virus. The Pennsylvania Surveillance program relies on citizens to report dead birds to their West Nile county coordinator or by using the reporting tool on this website. Since the virus was detected in New York City in 1999, thousands of dead birds have been submitted for testing by citizens in the northeastern US.\n| Arbovirus* | Local Vectorborne Transmission Documented | Important Pennsylvania Vectors | Primary Reservoir/Host |\n|---|---|---|---|\n| West Nile virus (WNV) | Yes | Culex pipiens Culex restuans | Birds |\n| Eastern Equine encephalitis virus (EEEV) | Yes | Coquillettidia perturbans Culiseta melanura | Birds |\n| Jamestown Canyon virus (JCV) | Yes | Culiseta inornata (possibly other Aedes spp., Anopheles spp.) | Deer/Elk |\n| La Crosse encephalitis virus (LACV) | Unknown, but multiple human cases reported in Ohio border counties in recent years | Aedes triseriatus | Small mammals/rodents |\n| St. Louis encephalitis virus (SLEV) | Yes | Culex pipiens | Birds |\n| Dengue virus (DENV) | No (travel-associated) | Aedes albopictus | Humans, non-human primates |\n| Chikungunya virus (CHIKV) | No (travel-associated) | Aedes albopictus | Humans, non-human primates |\n| Zika virus (ZIKV) | No (travel-associated; however, other modes of transmission [e.g., sexual, etc.] have resulted in locally-acquired infections) | Aedes albopictus | Humans, non-human primates |\n| * Note: Technical information available at CDC's ArboCat website |\nSt. Louis Encephalitis (SLE)\n- SLE virus is also spread by the bite of infected mosquitoes (primarily Culex pipiens & Culex quinquefasciatus in the eastern states).\n- The most common bird hosts are sparrows, pigeons, blue jays, and robins.\n- Most cases have occurred in Eastern and Central states in late summer or early fall.\n- Most people who become infected do not have symptoms, but those who do become ill could develop neuroinvasive diseases such as encephalitis or meningitis.\n- Eastern Equine Encephalitis (EEE) virus is also spread to people by the bite of an infected mosquito.\n- Only a few cases are reported in the United States each year, with the majority occurring in the eastern or gulf coast states.\n- Approximately 30% of people with EEE die and many survivors have ongoing neurological problems.\n- In Africa these viruses are transmitted between Aedes mosquitoes and primates- sporadic human infection.\n- In an urban setting these viruses are maintained in a human-mosquito-human transmission cycle."
    }
  ],
  "argos_summary": "The Bucks County Department of Health will conduct an ultra‑low volume mosquito spray in Warminster and Warrington townships on August 25, with backup dates on August 26 and 27, to reduce nuisance and West Nile‑virus‑carrying mosquitoes. Trucks will apply Duet at 0.75 oz/acre, targeting residential and park areas while minimizing impact on non‑target species. Residents are urged to eliminate standing water and use repellents to protect against West Nile encephalitis. The operation is part of the county’s integrated pest management plan to monitor and control mosquito‑borne disease.",
  "argos_id": "2KYWH1A9Z"
}