{
  "url": "https://finance.yahoo.com/news/telegram-ceo-pavel-durov-criticizes-050644171.html",
  "authorsByline": "Vismaya V",
  "articleId": "fde6a4f8e9a440afa63a96b70f916144",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://s.yimg.com/ny/api/res/1.2/0xw7pS2q.0S.gmtP5j2Heg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/decrypt_157/89bc06c1a91df332afb1466e311ab968",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-25T05:06:44+00:00",
  "addDate": "2025-08-25T05:34:27.926366+00:00",
  "refreshDate": "2025-08-25T05:34:27.926368+00:00",
  "score": 1.0,
  "title": "Telegram CEO Pavel Durov Criticizes France Over 'Absurd' 2024 Arrest",
  "description": "Telegram CEO Pavel Durov, who was arrested last year, says he must return to France every 14 days with no appeal date in sight.",
  "content": "Telegram CEO Pavel Durov called his arrest by French police \"legally and logically absurd\" on Sunday, exactly one year after being detained for four days over alleged criminal activity on his messaging platform.\n\nIn an X thread posted one year after his arrest at Le Bourget airport outside Paris, the 40-year-old tech mogul revealed he must still return to France every 14 days with \"no appeal date in sight.\"\n\nSince his release on €5 million (US$5.8 million) bail, Durov has been permitted to travel briefly to Dubai, where Telegram is headquartered, but remains under judicial supervision.\n\nDurov was initially detained on charges related to alleged criminal activity on his messaging platform, which prosecutors claimed he failed to moderate adequately.\n\n“So far, the only outcome of my arrest has been massive damage to France’s image as a free country,” he tweeted Sunday.\n\n“This legal action against a platform's CEO over user actions highlights a fundamental tension between legacy legal frameworks and the core Web3 principle of individual sovereignty,” HashKey Group chief analyst Jeffrey Ding told Decrypt.\n\nThe case prompts a \"broader, global discussion\" on the balance between innovation and \"regulatory oversight\" in the digital ecosystem, he said.\n\nDurov's arrest immediately impacted crypto markets, causing Toncoin (TON), the native token of The Open Network blockchain, closely affiliated with Telegram, to plummet as news broke.\n\nFrench authorities detained Durov on charges including complicity in distributing child pornography, narcotics sales, and organized fraud, saying Telegram's encryption tools were being used without proper government authorization.\n\nThe National Anti-Fraud Office accused the platform of refusing to cooperate with law enforcement requests and failing to moderate criminal content.\n\nDurov’s detention drew condemnation from Tesla CEO Elon Musk and ex-NSA whistleblower Edward Snowden, compelling President Emmanuel Macron to defend France’s record on free expression.\n\nTON Spikes 29% After Telegram Founder Pavel Durov Is Allowed to Leave France\n\nHowever, Durov pushed back against these accusations, claiming the French police had made procedural errors that revealed their own incompetence, and “they could have learned the correct procedure simply by googling it or asking.\"\n\nThe tech executive said Telegram was easy to reach, saying they have “always responded to every legally binding request from France.”",
  "medium": "Article",
  "links": [
    "https://decrypt.co/247751/most-ton-holders-in-the-red-as-price-keeps-falling-after-telegram-ceo-arrest",
    "https://decrypt.co/246882/pavel-durov-indictment-france-telegram",
    "https://wp.decrypt.co/326141/telegram-boss-pavel-durov-permitted-travel-to-dubai/",
    "https://x.com/durov/status/1959676036507205649",
    "https://decrypt.co/246459/telegram-ceo-custody-french-president-macron-political",
    "https://wp.decrypt.co/310173/ton-spikes-29-telegram-founder-pavel-durov/",
    "https://decrypt.co/326141/telegram-boss-pavel-durov-permitted-travel-to-dubai",
    "https://decrypt.co/246286/ton-price-plunges-17-telegram-ceo-pavel-durov-arrested-reports",
    "https://decrypt.co/resources/what-is-toncoin-the-cryptocurrency-conceived-by-telegram"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Telegram CEO Pavel Durov",
      "weight": 0.10504153
    },
    {
      "name": "Telegram Founder Pavel Durov",
      "weight": 0.10101056
    },
    {
      "name": "Pavel Durov",
      "weight": 0.088486135
    },
    {
      "name": "Durov",
      "weight": 0.07872152
    },
    {
      "name": "Telegram",
      "weight": 0.07748025
    },
    {
      "name": "France",
      "weight": 0.0700449
    },
    {
      "name": "HashKey Group chief analyst Jeffrey Ding",
      "weight": 0.066085406
    },
    {
      "name": "alleged criminal activity",
      "weight": 0.0639728
    },
    {
      "name": "Tesla CEO Elon Musk",
      "weight": 0.062962666
    },
    {
      "name": "ex-NSA whistleblower Edward Snowden",
      "weight": 0.062156346
    }
  ],
  "topics": [
    {
      "name": "Business Leaders"
    }
  ],
  "categories": [
    {
      "name": "Business"
    }
  ],
  "taxonomies": [
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.95263671875
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.91748046875
    },
    {
      "name": "/News/Other",
      "score": 0.716796875
    },
    {
      "name": "/News/Technology News",
      "score": 0.60546875
    },
    {
      "name": "/Online Communities/Social Networks",
      "score": 0.48583984375
    },
    {
      "name": "/Law & Government/Legal/Other",
      "score": 0.44140625
    }
  ],
  "sentiment": {
    "positive": 0.047893573,
    "negative": 0.7554262,
    "neutral": 0.19668019
  },
  "summary": "Telegram CEO Pavel Durov has criticised France for its \"legally and logically absurd\" arrest of him a year after he was detained for four days over alleged criminal activity on his messaging platform. Since his release on €5 million ($5.8 million) bail, he has been permitted to briefly travel to Dubai, where Telegram is headquartered, but remains under judicial supervision. His arrest immediately impacted crypto markets, leading to a 29% increase in Toncoin (T), the native token of The Open Network blockchain. The case prompted a global discussion on the balance between innovation and regulatory oversight in the digital ecosystem.",
  "shortSummary": "Telegram CEO Pavel Durov criticized France's arrest for alleged criminal activity, calling it \"absurd\" and \"legally absurd,\" while maintaining his bail remains in place for 14 days.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "d3174f5bf8d84d2fbd5e859144293a31",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://decrypt.co/resources/what-is-toncoin-the-cryptocurrency-conceived-by-telegram",
      "text": "In 2018, the messaging platform Telegram released a white paper for a layer-1 blockchain it called the Telegram Open Network.\nThe project’s currency, called ‘Gram’, was designed to pay transaction fees, settle payments and validate transactions on the network.\nThe launch hit the headlines. It broke records in 2018 after raising an eye-watering $1.7 billion in a token sale. It was the second largest ICO in history, behind EOS, which raised $4 billion. But two years later, Telegram abandoned the project. What happened?\nRegulatory Trouble\nThe project, conceived by brothers Nikolai and Pavel Durov, is a proof of stake protocol that uses sharding to help it solve some of the scaling issues found on projects like Bitcoin.\nLike its contemporaries, TON was attempting to build a suite of decentralized services. including decentralized storage, a domain name system, a privacy network, instant payments, and fast transaction processing.\nThe Durov brothers, and Telegram’s engineering team had brought the project to the verge of completion, but then the Securities and Exchange Commission (SEC) got involved.\nWhile Telegram had worked with American regulators on its token release, the SEC saw investors in the project as underwriters, and Telegram’s offering of Gram was considered an unregistered distribution of securities.\nTelegram did try to fight the ruling, but in 2020, Pavel Durov announced that Telegram’s participation in the development of the project would cease, and began issuing refunds to investors. That’s when the community stepped in.\nTON’s code was open source, and accessible on GitHub, allowing anyone to contribute to its development. A group of community developers decided to pick up where Telegram left off and build new TON functionality. The current network was launched and developed by Anatoliy Makosov, a software developer and Kirill Emelianenko, a programmer and Ph.D. in Physics and Mathematics.\nToncoin #mining has ended\nToday miners mined the last #Toncoin from the PoW Giver smart contracts, marking the end of the initial token distribution phase.\nThe $TON Foundation has published an article that describes the history of TON mining.\n👉https://t.co/SYHelDyr3i pic.twitter.com/fiz709C99J\n— TON 💎 (@ton_blockchain) June 28, 2022\nThe TON Foundation, a non-commercial group of supporters, renamed the project to The Open Network, allowing it to retain the TON moniker now runs Toncoin.\nHow does it work?\nToncoin is the native cryptocurrency of the TON network. It is used for network operations, transactions, games or collectibles built on TON.\nTON also features a wallet that provides commission-free crypto transfers to any other Telegram user, and is the primary way users interact with Telegram Mini apps, Telegram’s JavaScript based interface ecosystem that allows businesses to create in-app experiences.\nThere are also other services on TON, including TON Storage, TON Proxy (a decentralized VPN service), and the TON naming system. Toncoin is the primary way these services are paid for by users. It has its own app store, with more than 500 apps deployed a the time of writing, that also use the currency.\nTON uses a sharded, proof of stake consensus mechanism, meaning it can process transactions in parallel, improving transaction speed. In 2021, it hit a then record of being able to process 55,000 transactions per second. The company claims the network can process millions of transctions.\nTokenomics\nToncoin has a maximum supply of 5 billion TON, and at the time of writing, 3.4 billion TON are in circulation. Validators receive rewards in TON for maintaining the network, and the Foundation has created an inbuilt annual inflation rate of 0.6%.\nWhile Toncoin is the currency for Telegram’s services, Toncoin is also be used to influence how the network develops in the future. The Open Network is a decentralized autonomous organization (DAO), so users who hold the blockchain’s native token can cast votes on any proposed changes to the blockchain or ecosystem.\nRoadmap\nAccording to the TON Developer Report for Q2 2023, the network has experienced increases in developer activity, as other projects have plateaued during the recent crypto winter.\nTON network’s development activity is up 102% year-on-year. By the end of June, the developer count reached 9,134, marking a 6.56% increase from April’s figure of 8,572. TON’s strategy has been to leverage the Telegram community to attract projects to build, and ultimately use Toncoin.\nTap Fantasy, an MMORPG blockchain game made the switch to TON from Binance Chain in August 2023 to take advantage of the project's integrations with the messaging platform’s 700 million monthly active users.\nErrata, September 18, 2023 : A previous version of this article stated that Toncoin was minted using a proof-of-work consensus algorithm, but transitioned to proof of stake in June 2022. In fact, TON has always been a proof of stake protocol. Mining took place using smart contracts that mimicked a PoW protocol.\nThis article also previously stated that Telegram conceived of Toncoin. This is inaccurate. While Telegram played a role in initially building the infrastructure of TON, they were never involved in the creation of Toncoin. Telegram made Gram, not Toncoin."
    },
    {
      "url": "https://decrypt.co/246286/ton-price-plunges-17-telegram-ceo-pavel-durov-arrested-reports",
      "text": "Telegram co-founder and CEO Pavel Durov was arrested in France late Saturday, according to a local media report, after arriving on his private jet from Azerbaijan. As the news spread, the price of Toncoin (TON)—the token of the Telegram-affiliated The Open Network—plunged sharply.\nThe 39-year-old Durov was arrested by France's National Anti-Fraud Office, reports TF1, over what the publication said were various charges tied to alleged illegal conduct by Telegram users that the service reportedly refused to moderate. According to the publication, this includes charges linked to facilitating terrorism, the sale of narcotics and stolen goods, fraud, and more.\nDecrypt reached out to Telegram for confirmation and comment, but did not immediately receive a response.\nIt's unclear why Durov, who reportedly does not travel to many countries where Telegram has faced scrutiny, had flown to France on Sunday. TF1 cites an unnamed investigator who said that Durov will \"for sure\" end up in pre-trial detention.\nTelegram's user base recently topped the 950 million mark, Durov announced in July, with a recent spike in users coinciding with the rise of crypto-fueled games playable on the messaging app via integrated \"mini apps.\" Hamster Kombat, the largest of them, has reportedly amassed over 300 million players over the past few months ahead of an upcoming token launch and airdrop.\nThe Open Network was originally created internally at Telegram, but the firm abandoned the project in 2020 amid regulatory scrutiny. Development continued externally via a community of contributors, and over the past year, Telegram has increasingly embraced and integrated the blockchain network.\nWhile that close association has apparently helped boost the price of TON by more than 300% over the past year, that link appears to be hitting TON's price hard Saturday. TON is down by nearly 17% over the past 24 hours as of this writing, and fell from a price of $6.80 before the reports hit to a current price of $5.61, according to CoinGecko."
    },
    {
      "url": "https://decrypt.co/326141/telegram-boss-pavel-durov-permitted-travel-to-dubai",
      "text": "In brief\n- Telegram co-founder and CEO Pavel Durov was arrested in France last year.\n- Authorities allege illegal material was being shared on the crypto-friendly app.\n- Durov will be allowed to travel to Dubai for just two weeks.\nEmbattled Telegram co-founder and CEO Pavel Durov may leave France to travel to Dubai, according to a Thursday report in the French daily Le Monde.\nDurov, who was arrested in France last year on allegations his crypto-friendly platform was complicit in allowing illegal material to be shared on the app, will be able to leave the country starting July 10. It is the second time he has received such permission since being detained.\nIn April, French authorities allowed Durov to briefly travel to Dubai—but not to the United States. Telegram's offices are headquartered in Dubai. Durov had to pay a €5 million ($5.7 million) bond and report to the authorities twice a week as part of the deal at the time.\nTelegram could not immediately be reached for comment.\nFrench police allege that criminals have been using the app and that Telegram was not doing enough to moderate content on it.\nThey have also said that Durov was under investigation for using certain types of cryptography on the platform in the country without permission.\nThe app has changed some of its functions since Durov has been cooperating with the authorities following his arrest. Users who now try to share illegal content could have their IP addresses and phone numbers passed to authorities, the app announced last year.\nRussian-born Durov, who is worth $13.9 billion, according to the Bloomberg Billionaire's Index, frequently talks about civil liberties and the importance of freedom.\nHis arrest last year outraged many in the crypto community—and many out of it—with prominent figures like whistleblower Edward Snowden and Tesla boss Elon Musk criticizing the French law enforcement’s move.\nMessaging app Telegram is popular in the crypto world, and supports a number of \"mini apps\" that allow users to earn digital tokens.\n🎥 My first attempt at recording a video in French (at the request of @LePoint 🇫🇷). Forgive my French! 😉 pic.twitter.com/mzdYbDwGSu\n— Pavel Durov (@durov) June 18, 2025\nA top blockchain, The Open Network, was created by Telegram but then abandoned in 2020 due to regulatory issues.\nDevelopment then continued externally via a community of independent programmers. Users can earn its native token, TON, the 21st biggest cryptocurrency by market cap, in the app.\nEdited by James Rubin"
    },
    {
      "url": "https://decrypt.co/246459/telegram-ceo-custody-french-president-macron-political",
      "text": "French president Emmanuel Macron pushed back forcefully on Monday against growing outrage in the tech community over the arrest of Telegram CEO Pavel Durov, insisting that the surprise move was “in no way a political decision.”\n“I have seen false information regarding France following the arrest of Pavel Durov,” Macron posted to Twitter. “France is deeply committed to freedom of expression and communication, to innovation, and to the spirit of entrepreneurship. It will remain so.”\nOn Saturday, Durov was arrested by French authorities while stepping off his private jet outside of Paris, for allegedly facilitating terrorism, drug sales, and fraud by refusing to moderate communications between Telegram users.\nIn the hours following the arrest, tech leaders decried it as an unjust and politically motivated attempt by the French government to quell Durov, a prominent free speech advocate who was born in Russia and now resides in Azerbaijan.\nAccusations against France quickly escalated to extremes.\n“France has fallen to fascism (again),” Balaji Srinivasan, the prominent crypto investor and former Coinbase CTO, wrote in a Twitter thread that was reposted and endorsed by Elon Musk.\n“Emmanuel Macron wants founders to build in France,” he continued. “Why would you even visit France? Build an app, go to jail.”\nEdward Snowden, the former National Security Agency (NSA) contractor turned whistleblower, also laid responsibility for Durov’s arrest directly at the French president’s feet.\n“I am surprised and deeply saddened that Macron has descended to the level of taking hostages as a means for gaining access to private communications,” Snowden wrote Sunday in a Twitter post that received over 85,000 likes.\nThe aggressive backlash against Macron’s potential involvement in the case against Durov appears to have struck a chord with the politician, who has spent years carefully fostering an image as a pro-business, pro-tech leader intent on promoting France globally as a “startup nation.”\nMacron insisted on Monday that Durov’s arrest stemmed from an independent, ongoing judicial investigation that he had nothing to do with. Shortly thereafter, the Paris Public Prosecutor’s Office released a statement in which it revealed that Durov has been under investigation since July 8.\nThe office also laid out the 12 potential charges levied against Durov. Those include several charges of complicity in illegal acts including the distribution of child pornography, the sale of narcotics, and organized fraud.\nThree of the charges also specifically fault Durov for giving Telegram users access to cryptology tools and services within the privacy-focused app without receiving proper government authorization.\nThe prosecutors also said that given the nature of the potential charges, they are entitled to keep him in custody until Wednesday at the latest.\nThe Open Network is a blockchain network that Telegram originally started, but was furthered by community developers after the messaging platform abandoned it in 2020 amid regulatory scrutiny.\nTelegram has increasingly integrated the chain over the past year, however, including using its Toncoin (TON) to pay channel operators a share of ad revenue. A crypto gaming boom has also emerged on Telegram with games like Hamster Kombat and Notcoin, which are building on TON.\nThe price of TON plunged over the weekend following news of the arrest, and has since fallen out of the top 10 cryptocurrencies by market cap. It's now down by 19% over the past week.\nEdited by Andrew Hayward\nDaily Debrief Newsletter\nStart every day with the top news stories right now, plus original features, a podcast, videos and more."
    },
    {
      "url": "https://decrypt.co/246882/pavel-durov-indictment-france-telegram",
      "text": "Four days after his airport arrest, Telegram founder Pavel Durov has been formally indicted on multiple charges by French authorities, the latest development in the ongoing investigation into the platform's alleged role in facilitating criminal activities.\nThe Office of the Prosecutor of the Republic in Paris announced Wednesday that the charges against Durov include accusations of enabling the use of his platform for drug trafficking, organized fraud, and the dissemination of pornographic content involving minors.\nThe indictment also cites Durov’s refusal to cooperate with law enforcement by withholding information necessary for legal investigations.\n“The investigation will continue under the direction of the investigating judges—this could take several months,” warned French deputy prosecutor Maylis DeRoeck, in a statement to Decrypt.\nDurov has been placed under judicial supervision and is required to pay a €5 million bond (about $5.5 million). He is also prohibited from leaving French territory and must report to a police station twice a week.\n\"This indictment is the result of a thorough investigation into Telegram's near-total lack of response to judicial requests, which has been a concern for multiple law enforcement agencies across Europe,” Prosecutor Laure Beccuau stated.\nThe charges stem from an investigation that began in February 2024, following reports from various investigative services and prosecutors about Telegram's alleged involvement in cases ranging from child exploitation to drug trafficking and online hate speech.\nPavel Durov’s arrest at Le Bourget airport near Paris on August 24 has sparked worries about the impact on technology firms in Europe. Authorities have meanwhile expressed apprehension about Telegram’s insufficient moderation, claiming that the platform has facilitated the growth of illegal activities.\nResponding to Pavel’s arrest, Telegram asserted that he has \"nothing to hide\" in a statement shared on the platform's official news channel.\n\"Telegram complies with EU laws, including the Digital Services Act—its moderation practices are in line with industry standards and are continually improving,\" the statement read."
    },
    {
      "url": "https://wp.decrypt.co/310173/ton-spikes-29-telegram-founder-pavel-durov/",
      "text": "Coin Prices\nBTC\n$112,328.00\n-2.24%ETH\n$4,701.07\n-1.66%XRP\n$2.99\n-1.77%BNB\n$874.77\n-0.24%SOL\n$204.21\n-2.06%USDC\n$0.999798\n-0.00%STETH\n$4,684.23\n-1.78%DOGE\n$0.227012\n-3.26%TRX\n$0.357571\n-1.80%ADA\n$0.897831\n-1.63%WSTETH\n$5,684.79\n-1.62%LINK\n$25.87\n0.43%WBETH\n$5,069.96\n-1.52%HYPE\n$45.78\n4.14%WBTC\n$112,533.00\n-2.25%WEETH\n$5,036.98\n-1.65%SUI\n$3.61\n-2.75%XLM\n$0.402355\n-2.45%USDE\n$0.999894\n-0.04%BCH\n$574.48\n-3.30%AVAX\n$25.08\n-2.12%HBAR\n$0.244065\n-2.32%WETH\n$4,699.74\n-1.67%LEO\n$9.57\n-0.41%LTC\n$115.08\n-5.04%TON\n$3.29\n-2.05%USDS\n$0.999577\n0.01%SHIB\n$0.00001275\n-2.51%BSC-USD\n$0.999465\n-0.03%UNI\n$10.64\n-5.07%WBT\n$43.63\n-1.12%DOT\n$4.03\n-2.43%CBBTC\n$112,333.00\n-2.28%SUSDE\n$1.19\n0.04%CRO\n$0.159526\n-1.78%BGB\n$4.60\n-2.85%AAVE\n$341.08\n-2.92%XMR\n$276.14\n2.69%PEPE\n$0.00001064\n-4.12%ENA\n$0.668218\n-5.71%OKB\n$192.09\n-3.47%MNT\n$1.18\n-6.95%ETC\n$22.65\n-4.18%TAO\n$351.02\n-2.09%NEAR\n$2.59\n-2.60%APT\n$4.56\n-2.43%JITOSOL\n$249.80\n-2.11%ONDO\n$0.958185\n-3.53%ARB\n$0.567831\n-2.92%WETH\n$4,702.50\n-1.59%ICP\n$5.21\n-2.34%PI\n$0.347466\n-3.21%USD1\n$0.998971\n-0.07%BUIDL\n$1.00\n0.00%KAS\n$0.088846\n-0.35%ALGO\n$0.265041\n2.08%POL\n$0.246931\n-0.59%VET\n$0.02627907\n4.24%BNSOL\n$219.30\n-1.65%ATOM\n$4.71\n-1.35%RETH\n$5,352.72\n-1.61%GT\n$17.30\n-2.36%PENGU\n$0.03275514\n-8.19%RSETH\n$4,934.60\n-1.54%FTN\n$4.52\n-0.47%JLP\n$5.44\n-0.95%RENDER\n$3.69\n-2.74%SUSDS\n$1.064\n0.02%WLD\n$0.944689\n-3.39%IP\n$6.06\n2.46%SEI\n$0.304854\n-4.16%OSETH\n$4,947.90\n-1.58%FET\n$0.667533\n-2.21%TRUMP\n$8.56\n-2.14%LSETH\n$5,066.27\n-1.80%BFUSD\n$0.999506\n0.00%BONK\n$0.00002186\n-4.02%FLR\n$0.02325057\n-1.63%KCS\n$12.86\n-2.74%FIL\n$2.35\n-4.85%JUP\n$0.506228\n-3.13%QNT\n$105.77\n-0.76%KHYPE\n$45.86\n4.16%LBTC\n$112,332.00\n-2.31%XDC\n$0.082644\n0.30%EZETH\n$4,962.09\n-1.69%USDTB\n$0.999974\n0.01%METH\n$5,026.13\n-1.29%USDT\n$0.99957\n-0.00%INJ\n$14.07\n-2.55%USDT0\n$0.999282\n-0.07%USDF\n$0.999532\n-0.01%TIA\n$1.77\n-2.70%OP\n$0.763883\n-2.84%SKY\n$0.062889\n-5.13%NEXO\n$1.27\n-3.59%HASH\n$0.0261823\n-0.83%XAUT\n$3,365.06\n-0.10%LDO\n$1.40\n-6.70%CRV\n$0.882814\n0.31%AERO\n$1.37\n-5.18%PYUSD\n$0.99972\n-0.01%SPX\n$1.29\n-3.06%JUPSOL\n$230.96\n-2.19%FDUSD\n$0.996841\n0.02%STX\n$0.664733\n-3.57%WBNB\n$873.88\n-0.40%SOLVBTC\n$112,216.00\n-2.33%IMX\n$0.569366\n-3.11%S\n$0.330347\n-3.17%SUPEROETH\n$4,704.45\n-1.59%USDC\n$0.999771\n0.02%CAKE\n$2.69\n-1.87%PUMP\n$0.00279663\n-6.67%FLOKI\n$0.00010198\n-3.20%CFX\n$0.190003\n1.67%GRT\n$0.092479\n-1.07%RAY\n$3.54\n-2.61%MSOL\n$268.72\n-2.17%PAXG\n$3,355.36\n-0.09%PENDLE\n$5.61\n-5.73%FARTCOIN\n$0.932731\n-0.92%WBTC\n$112,235.00\n-2.37%SYRUPUSDC\n$1.12\n0.06%SAROS\n$0.353263\n-2.02%CGETH.HASHKEY\n$4,542.46\n-1.92%EETH\n$4,694.28\n-1.55%CLBTC\n$112,610.00\n-2.57%WIF\n$0.867599\n-2.99%XTZ\n$0.82016\n-2.71%WETH\n$4,698.04\n-1.75%KAIA\n$0.146522\n-2.26%ENS\n$25.47\n-4.16%THETA\n$0.832907\n0.65%VIRTUAL\n$1.26\n0.48%MORPHO\n$2.50\n-4.99%GALA\n$0.01778891\n-1.34%A\n$0.509475\n-0.02%IOTA\n$0.2001\n-1.37%JASMY\n$0.0155889\n-4.37%M\n$0.434926\n-0.27%OUSG\n$112.29\n0.00%ETHX\n$5,008.28\n-2.05%SAND\n$0.291768\n-1.30%JTO\n$1.92\n-2.31%PYTH\n$0.121604\n-2.67%CMETH\n$5,029.67\n-1.39%RLUSD\n$0.999775\n0.02%BTT\n$0.0000007\n1.30%ZEC\n$42.10\n-2.94%WETH\n$4,695.20\n-1.78%USDX\n$0.996981\n-0.05%CBETH\n$5,175.41\n-1.63%USDY\n$1.083\n0.27%TBTC\n$112,138.00\n-2.47%AB\n$0.00899401\n0.29%FLOW\n$0.399962\n-1.07%SWETH\n$5,124.69\n-0.74%WAL\n$0.419653\n-3.42%DOGE\n$0.226916\n-3.39%VSN\n$0.179202\n-1.13%NEO\n$8.18\n16.77%USD0\n$0.998093\n-0.01%ETHFI\n$1.22\n-1.56%MANA\n$0.295158\n-1.38%BTC.B\n$112,408.00\n-2.20%B\n$0.551298\n-1.10%BSV\n$27.67\n-0.90%USDG\n$0.999931\n-0.01%FRXETH\n$4,681.43\n-1.29%BRETT\n$0.054048\n-4.55%LION\n$0.01746581\n-3.15%BDX\n$0.074852\n-2.50%STRK\n$0.137564\n-2.03%WETH\n$4,702.41\n-1.62%DYDX\n$0.665484\n-2.65%TUSD\n$0.997553\n-0.04%TEL\n$0.00529521\n-3.14%HNT\n$2.62\n-2.34%XSOLVBTC\n$111,568.00\n-2.27%APE\n$0.608292\n-2.45%RSR\n$0.00816941\n-3.24%ZK\n$0.066699\n0.10%SYRUP\n$0.427115\n-12.66%CORE\n$0.468133\n-3.68%BIO\n$0.236735\n-2.14%SUN\n$0.02465717\n0.63%KTA\n$1.14\n-7.39%RUNE\n$1.31\n-1.77%AR\n$6.98\n-2.67%NFT\n$0.00000046\n-0.10%USDD\n$0.998584\n-0.05%FLUID\n$6.80\n-7.54%ZBCN\n$0.00515163\n6.84%EGLD\n$15.40\n-2.36%SDAI\n$1.16\n-0.03%EIGEN\n$1.34\n-3.27%DAI\n$0.999928\n0.01%COMP\n$45.91\n-3.62%XCN\n$0.01243463\n-2.99%USDT\n$0.99891\n0.22%BBSOL\n$224.42\n-2.45%SAVAX\n$30.73\n-1.82%TETH\n$5,706.22\n-1.59%AIOZ\n$0.35559\n-5.01%MOG\n$0.00000106\n-5.25%USDC.E\n$0.999746\n-0.01%XEC\n$0.0000207\n-0.57%TKX\n$5.15\n2.08%USYC\n$1.096\n0.01%USDB\n$1.001\n0.70%USTB\n$10.79\n0.00%KAVA\n$0.371389\n0.24%DEXE\n$7.01\n-1.64%WAVAX\n$25.11\n-1.98%AXS\n$2.39\n-1.85%CHZ\n$0.04036322\n-1.32%SUPER\n$0.635233\n-3.02%WHYPE\n$45.70\n4.02%BEAM\n$0.00748275\n-4.66%ATH\n$0.03356394\n-2.76%RON\n$0.549844\n-1.78%ZORA\n$0.116504\n-0.75%W\n$0.079594\n-3.26%WETH\n$4,701.63\n-1.18%OHM\n$22.56\n-0.90%DEEP\n$0.147007\n-4.24%SFRXETH\n$5,294.66\n-1.47%UBTC\n$112,030.00\n-2.36%ETH+\n$4,935.46\n-1.64%1INCH\n$0.260635\n-0.02%REKT\n$0.00000086\n-5.44%GNO\n$137.58\n-1.62%WEMIX\n$0.795599\n-2.79%STEAKUSDC\n$1.097\n-0.01%JST\n$0.03554996\n1.90%DSOL\n$232.67\n-1.96%DRIFT\n$0.553244\n-5.26%SNEK\n$0.00467887\n0.65%GHO\n$0.999056\n-0.00%MOVE\n$0.127271\n-2.87%QTUM\n$3.24\n30.80%CVX\n$4.16\n0.11%EBTC\n$112,002.00\n-2.61%EOS\n$0.506978\n-0.38%LUNC\n$0.00005977\n-2.90%AKT\n$1.18\n-2.46%MATIC\n$0.246628\n-0.54%"
    },
    {
      "url": "https://wp.decrypt.co/326141/telegram-boss-pavel-durov-permitted-travel-to-dubai/",
      "text": "Coin Prices\nBTC\n$112,328.00\n-2.24%ETH\n$4,701.07\n-1.66%XRP\n$2.99\n-1.77%BNB\n$874.77\n-0.24%SOL\n$204.21\n-2.06%USDC\n$0.999798\n-0.00%STETH\n$4,684.23\n-1.78%DOGE\n$0.227012\n-3.26%TRX\n$0.357571\n-1.80%ADA\n$0.897831\n-1.63%WSTETH\n$5,684.79\n-1.62%LINK\n$25.87\n0.43%WBETH\n$5,069.96\n-1.52%HYPE\n$45.78\n4.14%WBTC\n$112,533.00\n-2.25%WEETH\n$5,036.98\n-1.65%SUI\n$3.61\n-2.75%XLM\n$0.402355\n-2.45%USDE\n$0.999894\n-0.04%BCH\n$574.48\n-3.30%AVAX\n$25.08\n-2.12%HBAR\n$0.244065\n-2.32%WETH\n$4,699.74\n-1.67%LEO\n$9.57\n-0.41%LTC\n$115.08\n-5.04%TON\n$3.29\n-2.05%USDS\n$0.999577\n0.01%SHIB\n$0.00001275\n-2.51%BSC-USD\n$0.999465\n-0.03%UNI\n$10.64\n-5.07%WBT\n$43.63\n-1.12%DOT\n$4.03\n-2.43%CBBTC\n$112,333.00\n-2.28%SUSDE\n$1.19\n0.04%CRO\n$0.159526\n-1.78%BGB\n$4.60\n-2.85%AAVE\n$341.08\n-2.92%XMR\n$276.14\n2.69%PEPE\n$0.00001064\n-4.12%ENA\n$0.668218\n-5.71%OKB\n$192.09\n-3.47%MNT\n$1.18\n-6.95%ETC\n$22.65\n-4.18%TAO\n$351.02\n-2.09%NEAR\n$2.59\n-2.60%APT\n$4.56\n-2.43%JITOSOL\n$249.80\n-2.11%ONDO\n$0.958185\n-3.53%ARB\n$0.567831\n-2.92%WETH\n$4,702.50\n-1.59%ICP\n$5.21\n-2.34%PI\n$0.347466\n-3.21%USD1\n$0.998971\n-0.07%BUIDL\n$1.00\n0.00%KAS\n$0.088846\n-0.35%ALGO\n$0.265041\n2.08%POL\n$0.246931\n-0.59%VET\n$0.02627907\n4.24%BNSOL\n$219.30\n-1.65%ATOM\n$4.71\n-1.35%RETH\n$5,352.72\n-1.61%GT\n$17.30\n-2.36%PENGU\n$0.03275514\n-8.19%RSETH\n$4,934.60\n-1.54%FTN\n$4.52\n-0.47%JLP\n$5.44\n-0.95%RENDER\n$3.69\n-2.74%SUSDS\n$1.064\n0.02%WLD\n$0.944689\n-3.39%IP\n$6.06\n2.46%SEI\n$0.304854\n-4.16%OSETH\n$4,947.90\n-1.58%FET\n$0.667533\n-2.21%TRUMP\n$8.56\n-2.14%LSETH\n$5,066.27\n-1.80%BFUSD\n$0.999506\n0.00%BONK\n$0.00002186\n-4.02%FLR\n$0.02325057\n-1.63%KCS\n$12.86\n-2.74%FIL\n$2.35\n-4.85%JUP\n$0.506228\n-3.13%QNT\n$105.77\n-0.76%KHYPE\n$45.86\n4.16%LBTC\n$112,332.00\n-2.31%XDC\n$0.082644\n0.30%EZETH\n$4,962.09\n-1.69%USDTB\n$0.999974\n0.01%METH\n$5,026.13\n-1.29%USDT\n$0.99957\n-0.00%INJ\n$14.07\n-2.55%USDT0\n$0.999282\n-0.07%USDF\n$0.999532\n-0.01%TIA\n$1.77\n-2.70%OP\n$0.763883\n-2.84%SKY\n$0.062889\n-5.13%NEXO\n$1.27\n-3.59%HASH\n$0.0261823\n-0.83%XAUT\n$3,365.06\n-0.10%LDO\n$1.40\n-6.70%CRV\n$0.882814\n0.31%AERO\n$1.37\n-5.18%PYUSD\n$0.99972\n-0.01%SPX\n$1.29\n-3.06%JUPSOL\n$230.96\n-2.19%FDUSD\n$0.996841\n0.02%STX\n$0.664733\n-3.57%WBNB\n$873.88\n-0.40%SOLVBTC\n$112,216.00\n-2.33%IMX\n$0.569366\n-3.11%S\n$0.330347\n-3.17%SUPEROETH\n$4,704.45\n-1.59%USDC\n$0.999771\n0.02%CAKE\n$2.69\n-1.87%PUMP\n$0.00279663\n-6.67%FLOKI\n$0.00010198\n-3.20%CFX\n$0.190003\n1.67%GRT\n$0.092479\n-1.07%RAY\n$3.54\n-2.61%MSOL\n$268.72\n-2.17%PAXG\n$3,355.36\n-0.09%PENDLE\n$5.61\n-5.73%FARTCOIN\n$0.932731\n-0.92%WBTC\n$112,235.00\n-2.37%SYRUPUSDC\n$1.12\n0.06%SAROS\n$0.353263\n-2.02%CGETH.HASHKEY\n$4,542.46\n-1.92%EETH\n$4,694.28\n-1.55%CLBTC\n$112,610.00\n-2.57%WIF\n$0.867599\n-2.99%XTZ\n$0.82016\n-2.71%WETH\n$4,698.04\n-1.75%KAIA\n$0.146522\n-2.26%ENS\n$25.47\n-4.16%THETA\n$0.832907\n0.65%VIRTUAL\n$1.26\n0.48%MORPHO\n$2.50\n-4.99%GALA\n$0.01778891\n-1.34%A\n$0.509475\n-0.02%IOTA\n$0.2001\n-1.37%JASMY\n$0.0155889\n-4.37%M\n$0.434926\n-0.27%OUSG\n$112.29\n0.00%ETHX\n$5,008.28\n-2.05%SAND\n$0.291768\n-1.30%JTO\n$1.92\n-2.31%PYTH\n$0.121604\n-2.67%CMETH\n$5,029.67\n-1.39%RLUSD\n$0.999775\n0.02%BTT\n$0.0000007\n1.30%ZEC\n$42.10\n-2.94%WETH\n$4,695.20\n-1.78%USDX\n$0.996981\n-0.05%CBETH\n$5,175.41\n-1.63%USDY\n$1.083\n0.27%TBTC\n$112,138.00\n-2.47%AB\n$0.00899401\n0.29%FLOW\n$0.399962\n-1.07%SWETH\n$5,124.69\n-0.74%WAL\n$0.419653\n-3.42%DOGE\n$0.226916\n-3.39%VSN\n$0.179202\n-1.13%NEO\n$8.18\n16.77%USD0\n$0.998093\n-0.01%ETHFI\n$1.22\n-1.56%MANA\n$0.295158\n-1.38%BTC.B\n$112,408.00\n-2.20%B\n$0.551298\n-1.10%BSV\n$27.67\n-0.90%USDG\n$0.999931\n-0.01%FRXETH\n$4,681.43\n-1.29%BRETT\n$0.054048\n-4.55%LION\n$0.01746581\n-3.15%BDX\n$0.074852\n-2.50%STRK\n$0.137564\n-2.03%WETH\n$4,702.41\n-1.62%DYDX\n$0.665484\n-2.65%TUSD\n$0.997553\n-0.04%TEL\n$0.00529521\n-3.14%HNT\n$2.62\n-2.34%XSOLVBTC\n$111,568.00\n-2.27%APE\n$0.608292\n-2.45%RSR\n$0.00816941\n-3.24%ZK\n$0.066699\n0.10%SYRUP\n$0.427115\n-12.66%CORE\n$0.468133\n-3.68%BIO\n$0.236735\n-2.14%SUN\n$0.02465717\n0.63%KTA\n$1.14\n-7.39%RUNE\n$1.31\n-1.77%AR\n$6.98\n-2.67%NFT\n$0.00000046\n-0.10%USDD\n$0.998584\n-0.05%FLUID\n$6.80\n-7.54%ZBCN\n$0.00515163\n6.84%EGLD\n$15.40\n-2.36%SDAI\n$1.16\n-0.03%EIGEN\n$1.34\n-3.27%DAI\n$0.999928\n0.01%COMP\n$45.91\n-3.62%XCN\n$0.01243463\n-2.99%USDT\n$0.99891\n0.22%BBSOL\n$224.42\n-2.45%SAVAX\n$30.73\n-1.82%TETH\n$5,706.22\n-1.59%AIOZ\n$0.35559\n-5.01%MOG\n$0.00000106\n-5.25%USDC.E\n$0.999746\n-0.01%XEC\n$0.0000207\n-0.57%TKX\n$5.15\n2.08%USYC\n$1.096\n0.01%USDB\n$1.001\n0.70%USTB\n$10.79\n0.00%KAVA\n$0.371389\n0.24%DEXE\n$7.01\n-1.64%WAVAX\n$25.11\n-1.98%AXS\n$2.39\n-1.85%CHZ\n$0.04036322\n-1.32%SUPER\n$0.635233\n-3.02%WHYPE\n$45.70\n4.02%BEAM\n$0.00748275\n-4.66%ATH\n$0.03356394\n-2.76%RON\n$0.549844\n-1.78%ZORA\n$0.116504\n-0.75%W\n$0.079594\n-3.26%WETH\n$4,701.63\n-1.18%OHM\n$22.56\n-0.90%DEEP\n$0.147007\n-4.24%SFRXETH\n$5,294.66\n-1.47%UBTC\n$112,030.00\n-2.36%ETH+\n$4,935.46\n-1.64%1INCH\n$0.260635\n-0.02%REKT\n$0.00000086\n-5.44%GNO\n$137.58\n-1.62%WEMIX\n$0.795599\n-2.79%STEAKUSDC\n$1.097\n-0.01%JST\n$0.03554996\n1.90%DSOL\n$232.67\n-1.96%DRIFT\n$0.553244\n-5.26%SNEK\n$0.00467887\n0.65%GHO\n$0.999056\n-0.00%MOVE\n$0.127271\n-2.87%QTUM\n$3.24\n30.80%CVX\n$4.16\n0.11%EBTC\n$112,002.00\n-2.61%EOS\n$0.506978\n-0.38%LUNC\n$0.00005977\n-2.90%AKT\n$1.18\n-2.46%MATIC\n$0.246628\n-0.54%"
    },
    {
      "url": "https://decrypt.co/247751/most-ton-holders-in-the-red-as-price-keeps-falling-after-telegram-ceo-arrest",
      "text": "Toncoin’s price slipped below $5 on Tuesday, hitting a four-month low following the arrest of Telegram founder and CEO Paul Durov in France late last month.\nThe Telegram-linked cryptocurrency, which powers The Open Network (TON), is officially separate from the messaging app. Still, TON has roots with Telegram’s CEO, and it serves as the backbone for Telegram’s crypto features, such as in-app, digital wallets.\nOver the past day, Toncoin’s price had fallen 4.1% to $4.95, showing a 26% loss over the past two weeks. With the asset market cap at $12.4 billion, Tuesday’s dip was enough to push Toncoin out of the top ten cryptocurrencies ranked by market capitalization, according to CoinGecko.\nWhile Toncoin’s integration with Telegram yielded an initial burst of users, Durov’s arrest and a recent network outage have compounded price declines, as TON shows signs of struggling to grow beyond Telegram use-cases, said David Kinitsky, the COO of Dominant Strategies, a blockchain development firm.\n“You could not ask for two worse events to come back-to-back,” Kinitsky told Decrypt in an interview, adding the events amplified questions about TON’s resilience and growth.\nDurov was arrested on charges related to Telegram’s lack of moderation. French authorities said he refused efforts to stop the spread of illegal activity on the platform, such as drugs and money laundering. Following his indictment on six charges, Durov was released on bail last week.\nWhile Toncoin’s price is up 166% over the past year, a majority of holders are in the red, according to IntoTheBlock data. Around 70% of addresses holding TON bought the cryptocurrency above its current price, while 10% have profits on paper.\nTelegram began rolling out TON-based wallets to users last September. And nearly a year later, tap-to-earn games are driving a speculative wave of engagement. It all started with Notcoin, followed by games such as Hamster Kombat and X Empire.\nIn July, Durov celebrated as Telegram hit 950 million users. But depending on how Durov’s criminal case plays out, access to Telegram could be impacted in certain regions, preventing that lucrative integration from driving new Toncoin users, Kinitsky said.\n“It's a double-edged sword,” he said. “Once they reached saturation on Telegram, the question became where the next leg up was, and furthermore, how they foster a developer community.”\nTelegram features its own app store with more than 1,100 different applications. While many apps support Toncoin as a currency, the network has a smaller number of DeFi protocols.\nSo far, 23 DeFi protocols have been launched on Toncoin, according to DeFillama. Of those, a majority are focused on liquid staking, with a couple of decentralized exchanges representing a lion’s share of assets deposited or staked in Toncoin smart contracts.\nSince mid-July, the total value locked of assets on Toncoin has dropped to $333 million from $776 million. As Toncoin’s ability to grow has come under greater scrutiny, that’s left little in terms of an ecosystem of apps for the project’s merits to fall back on, Kinitsky said.\nMeanwhile, the network has weathered several outages. Last week, the launch of a dog-themed meme coin on the network ground TON to a standstill for more than three hours, for example. Previously, network outages were a price-pummeling thorn in Solana’s side.\nOriginally, TON was envisioned as the Telegram Open Network by Durov and his brother Nikolai. But the company stepped away from the project as it neared completion in 2020 after the Securities and Exchange Commission (SEC) raised concerns about an associated token.\nThe project was later picked up by a group of community developers, who launched it as The Open Network in 2022. Ultimately, Kinitsky said that TON’s prospects would be bolstered by a greater focus on technical solutions making it easier for developers to build protocols.\n“I haven't seen as much infrastructure, middleware, and tooling being built around the TON ecosystem,” he said. “You got very easy distribution and bootstrapping, but if you can't take the next leg up or go further [...] then what’s going to happen here?”\nEdited by Ryan Ozawa."
    }
  ],
  "argos_summary": "Telegram CEO Pavel Durov was arrested in France on charges of failing to moderate illegal content, leading to a €5 million bail and ongoing judicial supervision that forces him to return every 14 days. The arrest sparked condemnation from tech leaders and a sharp drop in Toncoin’s price, which fell below $5 and slipped out of the top ten cryptocurrencies. The case highlights tensions between legacy legal frameworks and Web3 principles, prompting broader debate over regulatory oversight of crypto platforms. Meanwhile, the TON ecosystem—now run by community developers—faces declining TVL and network outages, raising doubts about its long‑term viability beyond Telegram’s user base. Despite a 166% yearly gain, most Toncoin holders remain in the red, and the project’s future depends on resolving legal and technical challenges.",
  "argos_id": "2ZZM8QA0P"
}