{
  "url": "https://www.cleveland.com/nation/2025/08/this-legend-is-7th-pro-athlete-to-become-a-billionaire.html",
  "authorsByline": "Cliff Pinckard | cpinckard@cleveland.com, Cliff Pinckard, cpinckar",
  "articleId": "9f96d19926ea49f8bcb2dbfbb47c9638",
  "source": {
    "domain": "cleveland.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "OH",
      "county": "Cuyahoga County",
      "city": "Cleveland",
      "coordinates": {
        "lat": 41.4996574,
        "lon": -81.6936772
      }
    }
  },
  "imageUrl": "https://www.cleveland.com/resizer/v2/RTUD5XRYXVFN3ICWGLMNZI5OWY.jpg?auth=e538980798531b7dcb58beb52946f4328cfed73d8aa1afa4824984ba9c80d1f4&width=1280&quality=90",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-25T04:01:03.403000+00:00",
  "addDate": "2025-08-25T04:20:54.017744+00:00",
  "refreshDate": "2025-08-25T04:20:54.017746+00:00",
  "score": 1.0,
  "title": "This legend is 7th pro athlete to become a billionaire",
  "description": "The 20-time Grand Slam champion becomes just the second tennis player to achieve billionaire status.",
  "content": "Beyond his $130 million in prize money, Roger Federer's business acumen and endorsements with luxury brands like Rolex and Mercedes-Benz propelled him to financial success. (Andy Wong, Associated Press file photo) AP\n\nTennis legend Roger Federer, who won 20 major titles during his career and is considered one of the greatest to ever play the game, has reached another milestone in retirement.\n\nForbes estimates Federer is now worth $1.1 billion, making him just the seventh pro athlete to reach billionaire status.\n\nFederer, 44, won more than $130 million in prize money during his 24 years as a pro tennis player, but it’s his savvy business moves that have led to the bulk of his earnings. Forbes says Federer has a \"significant minority stake\" in On, a publicly traded Swiss shoe and apparel brand.\n\nAccording to People, Federer took an interest in On when his wife started wearing the brand’s sneakers. He contacted the business’ owners and now has a 3% stake worth $375 million.\n\nHe also has earned millions in endorsements for brands such as Lindt, Mercedes-Benz, Rolex and Moët & Chandon, and through personal appearances, Forbes reports. He also has invested in other companies over the years.\n\n“Between his character and his likability, that’s a big thing,” Lisa Delpy Neirotti, director of the sport management program at George Washington University, tells Forbes. “You may be a great athlete on the field, but not everyone likes you. He’s kind of debonair. He’s got good looks. He’s very polite. He’s sophisticated, and his brands reflect that.”\n\nCNN reports Federer is the second tennis player to become a billionaire; the first was Romanian player Ion Țiriac, who began investing after the fall of communism.\n\nThe remaining sports billionaires are current NBA and former Cleveland Cavaliers star LeBron James; former NBA players Michael Jordan, Magic Johnson, and Junior Bridgeman.\n\nGolfer Tiger Woods and James are the only players to become billionaires while still competing in their sports, CNN reports.",
  "medium": "Article",
  "links": [
    "https://people.com/roger-federer-estimated-net-worth-reaches-1-billion-11796368",
    "https://www.cnn.com/2025/08/23/sport/roger-federer-billionaire-tennis",
    "https://www.forbes.com/sites/justinbirnbaum/2025/08/22/roger-federer-is-now-a-billionaire/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Roger Federer",
      "weight": 0.093074396
    },
    {
      "name": "Tennis legend Roger Federer",
      "weight": 0.090315916
    },
    {
      "name": "former NBA players Michael Jordan",
      "weight": 0.08798963
    },
    {
      "name": "Federer",
      "weight": 0.085131064
    },
    {
      "name": "Romanian player Ion Țiriac",
      "weight": 0.082118995
    },
    {
      "name": "luxury brands",
      "weight": 0.07750961
    },
    {
      "name": "7th pro athlete",
      "weight": 0.07661535
    },
    {
      "name": "brands",
      "weight": 0.07264929
    },
    {
      "name": "billionaire status",
      "weight": 0.06850198
    },
    {
      "name": "billionaires",
      "weight": 0.06655424
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Sports"
    },
    {
      "name": "Auto"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.96240234375
    },
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.9208984375
    },
    {
      "name": "/Sports/Individual Sports/Racquet Sports",
      "score": 0.52587890625
    },
    {
      "name": "/Sports/International Sports Competitions/Other",
      "score": 0.50146484375
    },
    {
      "name": "/News/Gossip & Tabloid News/Other",
      "score": 0.33251953125
    }
  ],
  "sentiment": {
    "positive": 0.45435685,
    "negative": 0.11954321,
    "neutral": 0.42609993
  },
  "summary": "Tennis legend Roger Federer, who won 20 major titles during his career and is considered one of the greatest to ever play the game, has become the seventh pro athlete to become a billionaire. His business success was largely due to his successful business moves, including a significant minority stake in On, a Swiss shoe and apparel brand. Federer also earned millions through endorsements with brands such as Lindt, Mercedes-Benz, Rolex and Moët & Chandon. He became a billionaire when his wife started wearing the brand's sneakers, and now has a 3% stake worth $375 million.",
  "shortSummary": "Roger Federer, a tennis legend with over $130 million in prize money and significant business investments, became the seventh pro athlete to become a billionaire at $1.1 billion.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "ecd82786041d4c799f223fdf3e2bd456",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.cnn.com/2025/08/23/sport/roger-federer-billionaire-tennis",
      "text": "Tennis icon Roger Federer has become the seventh billionaire athlete in history, according to estimates published by Forbes on Friday.\nThe Swiss star, who retired from the sport in 2022, is now believed to have a net worth of $1.1 billion, boosted by his minority stake in Swiss shoe and apparel brand On.\nHaving collected around $1 billion in off-court endeavors during his playing career, Federer was tennis’ highest-paid player for 16 straight years despite earning less in prize money than rivals Novak Djokovic and Rafael Nadal.\nIn 2020, he earned $106.3 million before tax, more than any other athlete in the world.\nFederer becomes tennis’ second billionaire, following Romanian player Ion Țiriac, who won the 1970 French Open men’s doubles championship and began investing after the fall of communism.\nAlso on the list are basketball stars Michael Jordan, Magic Johnson and LeBron James, as well as Milwaukee Bucks sixth man Junior Bridgeman. Tiger Woods rounds out the list and joins James as the only players to have become billionaires while still competing in their sports.\nCarlos Alcaraz was named by Forbes on Friday as the highest-paid active tennis player over the last 12 months for the second year in a row, having earned $48.3 million. Only Federer, Djokovic and Naomi Osaka have ever earned more in a single year.\nJannik Sinner, who is the men’s world No. 1 and whose burgeoning rivalry with Alcaraz is increasingly shaping the sport, is second on the list. He made $47.3 million, almost double the $26.6 million he earned in the 12 months prior.\nThe Italian earned $20.3 million directly from tennis this year, the third highest total since Forbes’ records began, and significantly more than Alcaraz. Only Djokovic, in Forbes’ 2016 and 2019 lists, has ever earned more directly from the sport in a single year.\nCoco Gauff placed third on this year’s list, having earned $37.2 million – more than any other female athlete over the last 12 months.\nHer placement means that – for the first time since Federer, Maria Sharapova and Nadal in 2010 – each of the top three are under 30.\nIn total, the top 10 highest earners made a combined $285 million, up 16% from last year but still significantly less than the record of $343 million in 2020."
    },
    {
      "url": "https://people.com/roger-federer-estimated-net-worth-reaches-1-billion-11796368",
      "text": "Roger Federer's Estimated Net Worth Reaches $1 Billion Thanks to His Latest Big Business Deal The two-time Olympic medalist is estimated to be worth $1.1 billion By Charna Flam Charna Flam Charna Flam is a writer-reporter at PEOPLE. She has been working at PEOPLE since 2023. Her work has previously appeared on Variety, The New York Post, and The Wrap. People Editorial Guidelines Published on August 23, 2025 12:46AM EDT 2 Comments Roger Federer in December 2022. Credit : Jamie McCarthy/Getty NEED TO KNOW Roger Federer has earned the title of \"billionaire,\" according to ForbesThe 20-time Grand Slam Champion is estimated to be worth $1.1 billionA large portion of his fortune comes from his 2019 investment in the Swiss sportswear company, On Roger Federer has earned a very exclusive new title. The 20-time Grand Slam Champion is now a billionaire, as Forbes announced on Friday, Aug. 22, that it estimates his net worth at about $1.1 billion. The tennis star, 44, is among the highest-paid tennis players ever. He scored nearly $131 million in prize money over his 24-year Association of Tennis Professionals career, behind only Novak Djokovic’s $189 million total and Rafael Nadal’s $135 million. However, it was his investment in the Swiss sports apparel company On in 2019 that has steadily raised his net worth. He now holds a significant stake in the company. He was first introduced to On when his wife, Mirka, started wearing the brand’s sneakers. Soon after, he contacted the company’s founders, David Allemann, Olivier Bernhard and Caspar Coppetti, and then took an equity stake in the business. He then helped the brand create an on-court tennis shoe, as well as a lifestyle apparel line. The company went public on the New York Stock Exchange in 2021, and now has a market capitalization of nearly $15 billion. The athlete holds 3% stake, making his equity worth more than $375 million, per Forbes. Roger Federer on July 07, 2025 in London, England. Karwai Tang/WireImage His investment in On follows the various high-profile sponsorships he received throughout his career. In 2018, he left Nike and signed with Uniqlo for a $300 million contract that would span over 10 years. Meanwhile, Nike paid him roughly $150 million over two decades. He was also sponsored by Lindt, Mercedes-Benz, Rolex and Moët & Chandon. Related Stories 29 Celebrities Who Have Reached Billionaire Status, Including Taylor Swift and LeBron James Meet the Kids of Billionaire Tech Titans: From Steve Jobs' Model Daughter to Jeff Bezos' Rarely-Seen Son Along with his investment in On, he has invested in a variety of companies throughout the years, including private plane operator NetJets, eyewear brand Oliver Peoples and UBS bank. In 2013, he and Tony Godsick cofounded management company Team8, and then four years later, created the Laver Cup. The event is an annual team tennis tournament comprised of six European men playing against six international players. Our new app is here! Free, fun and full of exclusives. Scan to download now! He now becomes the seventh athlete to become a billionaire, and the second ever tennis player, following Ion Tiriac. In 2014, Forbes estimated that Michael Jordan became a billionaire and is now worth $3.8 billion. Magic Johnson joined the club in October 2023 and now has a net worth of $1.5 billion. Junior Bridgeman had a $1.4 billion fortune at the time of his death in March. LeBron James and Tiger Woods are the only athletes in the exclusive group to be billionaires while still playing in their sports. Forbes estimated that James, 40, reached billionaire status in June 2022 and now has a net worth of $1.2 billion. Woods, 49, earned the title that same month and now has a fortune of $1.3 billion. Close Leave a Comment Read more: Celebrity Celebrity News Celebrity Finance"
    },
    {
      "url": "https://www.forbes.com/sites/justinbirnbaum/2025/08/22/roger-federer-is-now-a-billionaire/",
      "text": "Lucrative endorsements and a stake in shoe brand On have made the Swiss star just the seventh athlete in the three-comma club—and a food tech investment may serve up another payday.\nIn 2019, Roger Federer stood at center court in Basel, Switzerland, with gold confetti raining from above and tears streaming down his face. The show of emotion was natural after a straight-sets victory in the final at his hometown tournament, the Swiss Indoors, where he had once served as a ball boy. But it also seemed to reflect a growing awareness that, at age 38, he might not have many more such moments as a professional tennis player.\nIn fact, that trophy proved to be the last one that Federer would ever hoist, with injuries severely limiting his final three years on the ATP Tour before he finally hung up his racket in September 2022. But even though Federer, now 44, never added another piece of hardware to a collection that also included 20 Grand Slam singles titles and two Olympic medals, he remained tennis’ highest-paid player all the way to the end—and into retirement. Now, Forbes estimates that Federer is a billionaire, with a net worth of $1.1 billion thanks in part to his significant minority stake in publicly traded Swiss shoe and apparel brand On.\nFederer—whose father, from a prominent Swiss family, and whose mother, raised in South Africa, both worked for a pharmaceutical company—started playing tennis at age 3. He became the world’s top-ranked junior player and, after turning pro in 1998, made his breakthrough in 2003 by claiming the singles title at Wimbledon. Over his 24-year ATP Tour career, Federer spent 310 weeks as the top-ranked men’s singles player and won 103 tournaments while hauling in nearly $131 million in prize money—still the third-best total in tennis history, behind only his rivals Novak Djokovic ($189 million) and Rafael Nadal ($135 million).\nFederer was even more successful off the court, collecting roughly $1 billion (before taxes and agents’ fees) from endorsements, appearances and other business endeavors during his tennis career, more than double what Djokovic or Nadal has pocketed, according to Forbes estimates. With an unmatched sponsor portfolio that included several brands that stuck with him for more than a decade, Federer was the world’s highest-paid tennis player for 16 straight years and in 2020 led all sports with an estimated $106.3 million in total pretax earnings.\nFederer stands as one of just seven athletes to have crossed $1 billion in career pretax income while active in their sport, along with Los Angeles Lakers forward LeBron James, golfers Tiger Woods and Phil Mickelson, soccer players Cristiano Ronaldo and Lionel Messi, and boxer Floyd Mayweather.\nNow, as a billionaire, Federer is part of an equally exclusive group, as only the seventh high-level athlete to join the three-comma club. The first was another tennis player, Ion Tiriac, who won the 1970 French Open men’s doubles championship and also played hockey for his native Romania at the 1964 Winter Olympics. Tiriac, who began investing after the fall of communism, joined the billionaires list in 2007 and has an estimated net worth of $2.3 billion, with interests in real estate, car dealerships and financial services.\nHe was followed in 2014 by Basketball Hall of Famer Michael Jordan—now worth an estimated $3.8 billion—and later by Lakers great Magic Johnson, worth an estimated $1.5 billion, and former Milwaukee Bucks sixth man Junior Bridgeman, who had a $1.4 billion fortune when he died in March. James (worth an estimated $1.2 billion) and Woods ($1.3 billion) are the only athletes to have joined the three-comma club while still active in their sports.\nWorld’s Highest-Paid Tennis Players 2025\nVIEW THE FULL LIST\nFederer’s business success starts with his marketing appeal. A carefully cultivated stable of sponsors that has long included Lindt, Mercedes-Benz, Rolex and Moët & Chandon made him synonymous with luxury, dovetailing with his elegant style of tennis and his spotless reputation.\n“Between his character and his likability, that’s a big thing,” says Lisa Delpy Neirotti, director of the sport management program at George Washington University. “You may be a great athlete on the field, but not everyone likes you. He’s kind of debonair. He’s got good looks. He’s very polite. He’s sophisticated, and his brands reflect that.”\nFederer leveraged that allure in 2018 when he left Nike—which had paid him roughly $150 million over two decades—to sign an apparel deal with Japanese brand Uniqlo for a reported $300 million over ten years. And because Uniqlo doesn’t make tennis footwear—leaving open a sponsor category that Nike would have blocked as a matter of brand exclusivity—Federer was then able to pounce on an even more lucrative opportunity with the Zurich-based On.\nFederer first learned about the company when his wife started wearing its sneakers, and he soon reached out to On’s founders, David Allemann, Olivier Bernhard and Caspar Coppetti. In 2019, Federer took an equity stake in the up-and-coming business, which at the time was focused on running shoes.\nHe wasn’t content to be a passive investor, either, agreeing to help the brand develop an on-court tennis shoe and a lifestyle apparel line. The gamble paid off in just two years as On went public on the New York Stock Exchange in 2021, with Federer holding a stake estimated at around 3%. The company now has a market capitalization of nearly $15 billion, and its shares are up 86% from the IPO price, making Federer’s equity worth more than $375 million.\n“Roger was the accelerator,” Marc Maurer, then On’s co-CEO, told Forbes in 2023. “We basically wanted to open the door, and we were clear that tennis is the next sport. We were very fortunate that Roger embarked on that mission together with us.”\nFederer has served up impressive returns with some of his other investments as well. In 2013, he cofounded management company Team8 alongside his longtime agent, Tony Godsick, and four years later, they created the Laver Cup, an annual team tennis tournament that pits six European men against six players from the rest of the world. The event, now a sanctioned stop on the ATP Tour and a consistent draw for big-name talent, has consistently been profitable—with the exception of 2023, when it made infrastructure improvements—according to Sports Business Journal. This year’s Laver Cup, scheduled to be played in San Francisco in September, is expected to exceed $20 million in both sponsorship and ticketing/hospitality revenue.\nFederer may soon have another winner. In 2021, he participated in a $235 million Series D round for NotCo, a Chilean company developing plant-based foods. The fundraise, which featured other celebrity investors such as Formula 1 driver Lewis Hamilton and Roots drummer Questlove, valued the startup at $1.5 billion. A year later, NotCo raised another $70 million as it launched a B2B unit to license its artificial intelligence tools to other food makers.\nBut Federer can afford to be patient with his equity plays as he continues to work with more than a dozen partners from his playing days, including private plane operator NetJets, eyewear brand Oliver Peoples and UBS bank (which acquired his sponsor Credit Suisse in 2023). Among his selling points for advertisers, Federer remains more popular than just about any other tennis player, with 43.5 million followers across Facebook, Instagram and X (formerly Twitter)—second only to Rafael Nadal’s 51.6 million, according to marketing agency Two Circles. Meanwhile, Federer saw an engagement rate of 2.3% on those social media platforms over the past three years, nearly double Djokovic’s 1.2% and more than quadruple Nadal’s 0.5%.\n“I think it’s enduring,” Delpy Neirotti, the George Washington University professor, says of Federer’s value as a pitchman. “I think he will be able to sustain this.”\nWith additional reporting by Brett Knight and Matt Craig."
    }
  ],
  "argos_summary": "Roger Federer has become a billionaire, with Forbes estimating his net worth at $1.1 billion, largely due to a 3% stake in the Swiss shoe and apparel company On that is now worth over $375 million. His fortune also stems from lucrative endorsements with luxury brands such as Rolex, Mercedes‑Benz, Lindt and Moët & Chandon, as well as investments in other companies and his own management ventures. Federer is the second tennis player and the seventh athlete overall to reach billionaire status, joining figures like LeBron James, Tiger Woods, Michael Jordan and Magic Johnson. His business acumen and likability have made him one of the most valuable athletes on and off the court.",
  "argos_id": "3CYTA3MFK"
}