{
  "url": "https://www.foxnews.com/us/fbi-warns-seniors-about-billion-dollar-scam-draining-retirement-funds-expert-says-ai-driving",
  "authorsByline": "Adam Sabes",
  "articleId": "eb29965ec46d41c9ac4ddec41866cdd0",
  "source": {
    "domain": "foxnews.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://static.foxnews.com/foxnews.com/content/uploads/2025/08/internet-scammer-presents-cybersecurity-threat.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-24T08:00:58-04:00",
  "addDate": "2025-08-24T12:12:54.594566+00:00",
  "refreshDate": "2025-08-24T12:12:54.594569+00:00",
  "score": 1.0,
  "title": "FBI warns seniors about billion-dollar scam draining retirement funds, expert says AI driving it",
  "description": "The FBI is warning about a scam that it says has wiped out entire life savings and retirement accounts, leaving seniors devastated.",
  "content": "A cybersecurity expert warns that a scam that has been used to drain entire life savings or retirement accounts has become \"devastating\" for seniors.\n\nFBI Los Angeles on July 15 posted a reminder on X about the Phantom Hacker Scam, which has cost Americans over $1 billion since at least 2024, according to the agency. The FBI said the scam targets senior citizens and warns that victims could lose their \"life savings.\"\n\nThe scam operates in three phases: a \"tech support impostor,\" \"financial institution impostor\" and a \"US government impostor.\"\n\nIn the first phase, a tech support impostor will contact victims through text, phone call or email, then direct them to download a program allowing the scammer remote access to their computer. Then, the scammer asks victims to open their financial accounts to \"determine whether there have been any unauthorized charges,\" which the FBI says \"is most lucrative for targeting.\" Afterwards, the scammer will choose an account to target, then tell the victim they will get a call for further instructions from the \"fraud department\" of the bank hosting their account.\n\nHOW SCAMMERS EXPLOIT YOUR DATA FOR 'PRE-APPROVED' RETIREMENT SCAMS\n\nIn the second phase, the financial institution impostor will then call the victim and inform them that their funds have been \"accessed by a foreign hacker\" and must be moved to a \"safe\" third party account. Victims are then instructed to send the money via wire transfer, cash or cryptocurrency, and are told to send \"multiple transactions over a span of days or months.\"\n\nIn the third phase of the scam, the victim could be contacted by someone posing as a U.S. government employee, who prompts the individual to move their funds to an \"alias\" account for protection.\n\nPete Nicoletti, chief information security officer at Check Point, told Fox News Digital the scam has become \"devastating\" for seniors, and said families need to have discussions with their loved ones to keep them protected. Nicoletti said scammers are now getting personal with some of their tactics, targeting people with specific interests they have.\n\n\"The family should have dinner-time discussions about this,\" Nicoletti said. \"But, you know, seniors are posting things on Facebook like they're a Corvette collector. The criminals are actually using artificial intelligence to look for those type of characteristics and profiles. And they'll send you an email or a message saying, 'hey, that Corvette that you ordered a month ago is now available. It's, you know, for $500, you can get it…and we'll deliver it to you right away. And of course, the senior goes, 'well, I'm a Corvette collector. Maybe I was forgetful and I didn't know that I ordered that Corvette, or, you know.\"\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nNicoletti said that victims rarely get their money back, even after reporting it stolen to authorities.\n\n\"It's devastating,\" he said. \"If [victims report their funds stolen] the same day, there's a chance. I think it's in the single digit percentages. It's, you know, 10, 15%. I've heard, I have heard of people getting their money back. If it delayed beyond that, it's not good. It's gone.\"",
  "medium": "Article",
  "links": [
    "https://www.ic3.gov/PSA/2023/PSA230929",
    "https://www.foxnews.com/auto",
    "https://www.foxnews.com/video/6377270886112",
    "https://www.foxnews.com/download",
    "https://www.foxnews.com/category/tech/topics/cybercrime",
    "https://www.foxnews.com/tech/social-security-administration-phishing-scam-targets-retirees",
    "https://x.com/FBILosAngeles/status/1945196804850475069",
    "https://www.foxnews.com/tech/how-scammers-exploit-your-data-pre-approved-retirement-scams"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Victims",
      "weight": 0.08109563
    },
    {
      "name": "victims",
      "weight": 0.08109563
    },
    {
      "name": "retirement accounts",
      "weight": 0.07625834
    },
    {
      "name": "retirement funds",
      "weight": 0.07323752
    },
    {
      "name": "SCAMMERS",
      "weight": 0.0587098
    },
    {
      "name": "scammers",
      "weight": 0.0587098
    },
    {
      "name": "seniors",
      "weight": 0.058708183
    },
    {
      "name": "FBI Los Angeles",
      "weight": 0.05818966
    },
    {
      "name": "Pete Nicoletti",
      "weight": 0.056333885
    },
    {
      "name": "chief information security officer",
      "weight": 0.055574067
    }
  ],
  "topics": [
    {
      "name": "AI"
    },
    {
      "name": "Scam"
    }
  ],
  "categories": [
    {
      "name": "General"
    },
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.94189453125
    },
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.51806640625
    },
    {
      "name": "/Shopping/Consumer Resources/Identity Theft Protection",
      "score": 0.46337890625
    },
    {
      "name": "/Shopping/Consumer Resources/Consumer Advocacy & Protection",
      "score": 0.40771484375
    }
  ],
  "sentiment": {
    "positive": 0.047081,
    "negative": 0.664372,
    "neutral": 0.28854698
  },
  "summary": "The FBI in Los Angeles has issued a warning about the Phantom Hacker Scam, which has cost over $1 billion since at least 2024. The scam involves three phases: a \"tech support impostor,\" \"financial institution imposter\" and a \"US government impostour\". These individuals are directed to download a program allowing the scammer remote access to their computer and then asked to open their financial accounts to check for unauthorized charges. The financial institution imposter then instructs victims to move their funds to a safe third party account. Pete Nicoletti, chief information security officer at Check Point, said the scam has become \"devastating\" for seniors and that victims rarely receive their money back, even after reporting it stolen to authorities.",
  "shortSummary": "The FBI warns of the $1 billion \"Phantom Hacker Scam,\" which drains retirement funds through three phases using fake financial support and identity theft.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "db598e69dc2b47b69ea664ad81475cdf",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.foxnews.com/auto",
      "text": "HIT THE ROAD iStock Travel Woman refuses to let her friend borrow car again after it was trashed the first time\nQuizzes July 8, 2024 American Culture Quiz: Test yourself on pop stars, sports cars, rock guitars and Olympic high bars\nLIFESTYLE April 16, 2024 Utah teen and dad go on Ford racing trip after CEO learns of son’s cancer battle: ‘Hard to put into words’\nAutos Newsletter June 22, 2023 The most American-Made cars and more autos stories The Fox News Autos newsletter brings you the latest developments in the world of cars, trucks, performance vehicles and collectible automobiles.\nFord June 22, 2023 Here's how to turn the Ford Bronco into a 'no-door' roadster Anderson Composites is offering a new kit for the Ford Bronco that replaces its stock doors with cutaway-style doors inspired by the original Bronco Roadster.\nTesla June 21, 2023 Tesla sweeps the 2023 Cars.com American-Made Index The Tesla Model Y, Model 3, Model X and Model S took the top four spots in the Cars.com American-Made Index that ranks vehicles on their impact on the U.S. economy.\nArtificial Intelligence June 21, 2023 Toyota is using AI to design better cars faster Toyota has developed a new Generative AI design algorithm that can help its designers and engineers quickly optimize the shape of a vehicle.\nCadillac June 20, 2023 Shock: Electric Cadillac Escalade revealed in first images ahead of August debut Teaser images of the Cadillac Escalade IQ reveal details of its design, including the illuminated faux grille and a full-width digital display.\nPickups June 19, 2023 Here's why you can't buy a compact Chevy pickup in the USA Chevrolet said body-on-frame trucks better serve its customers than the small, unibody models that have been introduced by Ford and Hyundai.\nCollector Cars June 19, 2023 'The most original' 1970 Plymouth Superbird muscle car sold for a small fortune A 1970 Plymouth Superbird owned by the same family for nearly 50 years has been auctioned for 40 times the price they paid for it when it was new.\nElectric June 16, 2023 The Telo is a teeny tiny electric truck California electric vehicle startup Telo has unveiled a minicompact pickup that has 500 horsepower and can carry items that are 8 feet long.\nMedia February 6 Comic Ari Shaffir urges Americans to put down the phone, turn off the news, and 'find some joy' in the world\nLifestyle October 31 On this day in history, October 31, 1926, escape artist Harry Houdini shackled eternally by Grim Reaper\nCollector Cars June 19, 2023 'The most original' 1970 Plymouth Superbird muscle car sold for a small fortune\nMercedes-Benz June 16, 2023 The Mercedes-Benz Vision One-Eleven is a look into the future The Mercedes-Benz Vision One-Eleven is an electric supercar concept that showcases a new type of motor and battery pack that could end up in road cars.\nAutos Newsletter June 16, 2023 A drag racing Dragonsnake and more autos stories The Fox News Autos newsletter brings you the latest developments in the world of cars, trucks, performance vehicles and collectible automobiles.\nFord June 16, 2023 Ford Ranger Dakar Rally raider revealed Ford has unveiled the Ranger-based racing truck it will enter in the 2024 Dakar rally. The vehicle will compete in the top T1 class and go for the overall win.\nArtificial Intelligence June 15, 2023 Mercedes-Benz is adding ChatGPT to its cars... right now Mercedes-Benz is launching a beta version of a ChatGPT-based voice assistant that will allow drivers and passengers to interact with the vehicles through natural dialogue.\nFord June 15, 2023 Ford's 200 mph wind tunnel was designed to blow the competition away Ford has installed the world's most powerful rolling road wind tunnel at a development center, which can simulate wind speeds up to 200 mph.\nFox News Car Reviews June 2, 2023 Review: The 2023 Toyota Prius Prime is a sleek, solar-powered hybrid\nFox News Car Reviews May 12, 2023 Review: The 2023 Nissan Versa is the lowest-priced new car, but is it cheap?\nVIDEO January 6, 2024 Giving up a high-carbon lifestyle is not as easy as people thought: Jason Isaac Energy expert Jason Isaac joins ‘Fox & Friends Weekend’ to explain why a survey found declining interest in electric vehicles despite the government’s push for them.\nVIDEO December 11, 2023 VIDEO: LA man shoots McDonald's fries from $250,000 Lamborghini Man shoots French fries out of Lamborghini exhaust system in Los Angeles. (Credit: Storyful)\nVIDEO December 10, 2023 GRAPHIC VIDEO: Seattle PD search for suspects involved in vehicular assaults Video shows drivers purposefully hit pedestrians in Seattle. (Credit: Seattle Police Department)\nVIDEO December 3, 2023 Video captures moments car crashed into Washington state restaurant No serious injuries after car crashed into Bellevue restaurant.\nVIDEO December 2, 2023 China is going to own our transportation system through EV manufacturing: Tom Maoli New Jersey car dealership owner Tom Maoli joined ‘Fox & Friends Weekend’ to discuss the Biden administration’s electric vehicle mandate.\nVIDEO November 28, 2023 Car dealers urging Biden to put brakes on strict EV regulations FOX News' Bryan Llenas reports from a Lexus dealership in Whippany, N.J.\nVIDEO November 18, 2023 LA Auto Show displays newest models Auto expert Mike Claudill shows ‘FOX & Friends Weekend’ some of the newest big-brand car models like the 2024 Lucid Gravity and the 2025 Toyota Crown Signia SUV.\nVIDEO October 30, 2023 Auto workers’ strike settled FOX News’ Grady Trimble reports that the United Auto Workers Union made a tentative agreement with the big three auto-makers, ending the over 40-day strike costing the U.S. economy more than an estimated $10 billion.\nVIDEO September 30, 2023 Auto workers expand strike FOX News senior correspondent Jonathan Serrie reports on President Biden and former President Donald Trump visiting the Michigan auto workers’ strike.\nVIDEO September 24, 2023 Auto expert gives tips for consumers looking to buy a new car during UAW strike J.D. Power Vice President of data and analytics Tyson Jominy joined ‘Fox News Live’ to break down the economic fallout from the UAW strike.\n0:04:37 VIDEO 5 days ago Ron DeSantis: Consequences of this fatal crash 'go beyond' criminal prosecution"
    },
    {
      "url": "https://www.foxnews.com/tech/how-scammers-exploit-your-data-pre-approved-retirement-scams",
      "text": "Every year, American seniors lose over $28 billion to fraud, according to AARP. But here's the shocking part: Only a fraction ever gets reported.\nIf you've received a letter, email, or call claiming you've been \"pre-qualified\" or \"pre-approved\" for a 401(k) rollover or annuity upgrade, beware. These scams are getting smarter. They sound official and even personalized. But the offers aren't random; they're based on real details about you.\nSign up for my FREE CyberGuy Report\nGet my best tech tips, urgent security alerts and exclusive deals delivered straight to your inbox. Plus, you’ll get instant access to my Ultimate Scam Survival Guide — free when you join my CYBERGUY.COM/NEWSLETTER\n5 STEPS TO PROTECT YOUR FINANCES FROM FAMILY SCAMS\nWhy these retirement scams feel so real\nScammers now buy your personal data from data brokers to craft convincing offers. If you're in your 50s or 60s, you're a prime target. They know your age, homeownership status, estimated net worth and even retirement timeline. They don't guess, they know. Your information is being sold across hundreds of websites, and thousands of people can access it. Curious about how exposed you are?\nWHAT IS ARTIFICIAL INTELLIGENCE (AI)?\nWhat is a \"pre-qualified\" retirement scam?\nThese scams mimic real communications from financial institutions. You might get a letter or call claiming you're approved for a new investment or annuity opportunity. Scammers often use financial buzzwords like \"IRA consolidation\" or \"required minimum distribution guidance.\" The goal? To make you feel like you're dealing with a trusted expert. They create fake advisor profiles, complete with headshots, license numbers and U.S. contact info. Many even add logos or branding from familiar banks to boost credibility. But once you respond, they'll ask for private financial info or, worse, get you to transfer funds directly into their accounts.\nWhy older adults are prime targets\nScammers love targeting seniors because they typically have savings and are making major financial decisions. Plus, their data is easier to get. The unregulated data broker industry makes it easy for bad actors to find and target seniors with laser focus.\nGET FOX BUSINESS ON THE GO BY CLICKING HERE\nHow scammers get your data\nThese scams are fueled by data purchased from brokers. These companies gather your details, compile profiles and sell them, often without your knowledge. You could appear on lists labeled \"Retirees with $250k+ Net Worth\" or \"Homeowners Nearing Retirement.\" It's disturbingly precise. Some brokers scrape public records, while others buy data from loyalty cards, surveys or sweepstakes. Bottom line: this happens quietly, behind your back.\nThe financial toll of these scams\nIn 2024, the FBI reported that seniors lost over $4.8 billion to scams, a record high. Retirement-related fraud was a major part of that. Once your money is gone, it's usually gone for good. Even if the scammer misled you, your bank may not cover the loss if you authorized the transaction. These scams drain more than just savings. They create lasting stress, fear and shame. Prevention is your best defense.\n6 warning signs of a retirement scam\nStay alert for these red flags anytime you get financial offers:\n- You didn't request the offer. If it's unsolicited, be skeptical, even if it looks legit.\n- Urges you to act fast. Pressure tactics are a classic scam move.\n- Promises \"guaranteed\" returns. No real investment can promise that.\n- Asks for sensitive details. Legitimate advisors won't demand your Social Security number or account info over email or phone.\n- References real personal info. Just because they \"know\" your retirement date, that doesn't mean they're trustworthy.\n- Lacks verifiable credentials. Always double-check licenses and business addresses through your state regulator.\nHow to protect yourself from retirement scams\nYou don't have to wait until it's too late. Follow these steps to take control today:\n1. Use a personal data removal service\nThe fewer people who can access your personal information, the safer you are. Opt out of data broker websites manually, or use a data-removal service. Manually removing yourself from hundreds of data brokers is overwhelming. A reputable service can automate the process and protect your exposure long-term. While no service can guarantee the complete removal of your data from the internet, a data-removal service is really a smart choice. They aren’t cheap, and neither is your privacy. These services do all the work for you by actively monitoring and systematically erasing your personal information from hundreds of websites. It’s what gives me peace of mind and has proven to be the most effective way to erase your personal data from the internet. By limiting the information available, you reduce the risk of scammers cross-referencing data from breaches with information they might find on the dark web, making it harder for them to target you.\nCheck out my top picks for data removal services, and get a free scan to find out whether your personal information is already out on the web by visiting Cyberguy.com/Delete\nGet a free scan to find out if your personal information is already out on the web: Cyberguy.com/FreeScan\n2. Verify the source\nContact your bank, broker or financial advisor directly. Never trust a cold call, email, or mailed offer without confirmation.\n3. Guard your personal details\nNever share your Social Security number, account numbers or full birthdate over the phone or email, even if the offer sounds legitimate.\n4. Loop in a trusted contact\nBefore making any financial moves, talk to a family member or someone you trust. A second opinion can expose red flags.\n5. Block scam messages\nUse spam filters, call blockers and browser protections to stop scam messages before they reach you.\n6. Use strong antivirus software\nProtect your devices from phishing links and malicious downloads that scammers use to steal personal info. The best way to safeguard yourself from malicious links that install malware, potentially accessing your private information, is to have antivirus software installed on all your devices. This protection can also alert you to phishing emails and ransomware scams, keeping your personal information and digital assets safe.\nGet my picks for the best 2025 antivirus protection winners for your Windows, Mac, Android & iOS devices CyberGuy.com/LockUpYourTech\n7. Monitor your accounts\nRegularly check your bank, investment and credit accounts for unusual activity, and set up alerts for transactions.\n8. Report suspicious activity\nIf you think you've been targeted, file a report with the FTC at reportfraud.ftc.gov. It helps investigators and prevents others from falling victim.\n9. Stay informed\nSubscribe to alerts from trusted sources like CyberGuy to stay ahead of new scams targeting seniors and retirees by signing up for my free CyberGuy Report newsletter at CYBERGUY.COM/NEWSLETTER\nWhat this means for you\nIf you're planning your retirement, you must be extra cautious. Scammers are watching, and they're armed with your data. Blocking them starts with controlling what's out there. The less they know, the harder it is to fool you.\nCLICK HERE TO GET THE FOX NEWS APP\nKurt's key takeaways\nDon't assume an offer is real just because it uses your real data. That's often a sign it's a scam. Scammers thrive on your personal information. Take control by locking it down, verifying offers and refusing to be rushed into decisions.\nShould data brokers be required to get your permission before selling your information? Let us know by writing to us at Cyberguy.com/Contact\nSign up for my FREE CyberGuy Report\nGet my best tech tips, urgent security alerts, and exclusive deals delivered straight to your inbox. Plus, you’ll get instant access to my Ultimate Scam Survival Guide — free when you join my CYBERGUY.COM/NEWSLETTE\nCopyright 2025 CyberGuy.com. All rights reserved."
    },
    {
      "url": "https://www.foxnews.com/tech/social-security-administration-phishing-scam-targets-retirees",
      "text": "Phishing emails and messages are among the most dangerous cybersecurity threats. One of the most common and harmful examples is the Social Security Administration phishing scam, which targets unsuspecting individuals with alarming and deceptive messages. Even the biggest data breaches and financial frauds in history started with someone receiving a phishing email.\nThey are highly effective because of two things — urgency and impersonation. You'll often see phishing emails or messages asking you to take immediate action. They create urgency to make you panic and click the link, which can install malware on your device. Scammers build this urgency through impersonation, pretending to be government agencies and threatening you with things like pending taxes, traffic violation tickets and more.\nI recently received an email from Charles, who almost fell victim to one of these phishing emails, which is a classic example of a Social Security Administration phishing scam, claiming his Social Security number had been suspended due to its association with money-laundering activities.\nHOW TO DETECT FAKE AMAZON EMAILS AND AVOID IMPERSONATION SCAMS\nIt's a classic phishing email, one that either wants to steal your money or infect your computer and steal your personal data. These kinds of scams are very common, and if you're not careful, they can easily fool you.\nLet's discuss how this Social Security Administration phishing scam works and how you can stay safe.\nSign up for my FREE CyberGuy Report\nGet my best tech tips, urgent security alerts and exclusive deals delivered straight to your inbox. Plus, you’ll get instant access to my Ultimate Scam Survival Guide — free when you join my CYBERGUY.COM/NEWSLETTER\nHow the Social Security number phishing scam works\nIn the email received, the scammers used alarming language to create fear and urgency. It begins with an alarming accusation that your Social Security number is under investigation for links to serious crimes like drug trafficking and money laundering. Here's a portion of the message:\n\"We are conducting an ongoing inquiry into your Social Security Number and identity due to suspected links to drug trafficking. A series of international wire transfers to accounts on the Federal Trade Commission's restricted list has been flagged. There have been reports of suspicious activities associated with your Social Security Number in Texas and New Mexico. We would like to inform you that this document contains sensitive information and should be managed carefully. The document presented here is an official communication from the Social Security Administration, authorized by the Texas Attorney General. The Texas Court has directed the suspension of your Social Security Number due to its association with money laundering activities involving your bank accounts.\"\nAt first glance, the email looks official enough to cause real panic. It name-drops major authorities like the Social Security Administration (SSA), the Texas Attorney General and the Federal Trade Commission to make the threat sound credible. By tying your SSN to federal crimes, the scammers are not just suggesting you might be in trouble. They imply serious legal consequences, even the possibility of arrest.\nThis is urgency weaponized. The goal is to make you act before you think, pushing you to click a link or download a document out of fear. In that moment of panic, a person might forget the basic rules of cybersecurity.\nAnother psychological trick the scammers use is overwhelming the reader with details. They mention multiple states such as Texas and New Mexico, wire transfers and restricted lists, all to create the impression that the situation is deeply serious and far beyond an individual's control. When people feel overwhelmed, they are more likely to submit to someone who seems to have authority and offers a quick way to \"resolve\" the problem, usually by clicking a link or downloading a file.\nHow to spot a fake Social Security scam email\nWhile phishing emails are designed to look convincing, there are always subtle but important signs that give them away.\nThis email did not address the recipient by name. Instead, it used broad terms like \"Recipient\" or launched directly into accusations without a personal salutation. Legitimate government communications almost always use your full legal name and reference specific case numbers or account details.\nWHAT IS ARTIFICIAL INTELLIGENCE (AI)?\nAgencies like the SSA do not suspend Social Security numbers based on a single incident, and they certainly do not send serious notices through unsecured emails. Threatening suspension due to vague, unverified \"activity\" is a tactic meant to bypass logical thinking and trigger fear.\nAlthough the email tries to sound formal, the phrasing is clumsy and inconsistent. Sentences like \"The Texas Court has directed the suspension of your Social Security Number\" are vague and improperly structured for an official legal notification.\n10 ways to protect yourself from Social Security scams and phishing attacks\nScammers are constantly improving their tactics, but by following these steps, you can protect your Social Security information and outsmart even the most convincing phishing attempts.\n1. Be skeptical of urgency and threats\nScammers love to make things sound urgent, like claiming your Social Security number is about to be suspended or that you're suddenly under investigation for something serious. It's all about creating panic so you'll act before you think. Remember, real government agencies don't send scary emails demanding immediate action, threaten you with arrest or ask for payment in gift cards or wire transfers. If you get a message that feels rushed, alarming or just \"off,\" hit pause. Take a breath, double-check the facts, and never click a link or respond until you're absolutely sure it's legit.\n2. Strengthen your device security by using strong antivirus software\nGood cybersecurity habits start at the device level. Make sure you have strong antivirus software installed on your phone, tablet and computer. This tool can help catch phishing links, block suspicious downloads and even warn you if you accidentally visit a dangerous website.\nGet my picks for the best 2025 antivirus protection winners for your Windows, Mac, Android and iOS devices at CyberGuy.com/LockUpYourTech\n3. Consider removing your data from the internet\nScammers do not get your email address and phone number by accident. Your information could have been leaked through a past data breach, sold by shady data brokers, or even scraped from public profiles online. Also, limit how much personal information you share publicly. If you can, consider using a personal data removal service that helps remove your data from people search sites. While no service promises to remove all your data from the internet, having a removal service is great if you want to constantly monitor and automate the process of removing your information from hundreds of sites continuously over a longer period of time.\nCheck out my top picks for data removal services and get a free scan to find out if your personal information is already out on the web by visiting Cyberguy.com/Delete\nGet a free scan to find out if your personal information is already out on the web: Cyberguy.com/FreeScan\n4. Use separate emails for different purposes\nOne smart way to limit scam exposure is by compartmentalizing your digital life. Use one email address for banking and sensitive accounts, another for shopping or subscriptions and a different one for newsletters or social media. That way, if one email is compromised, scammers cannot easily link it to your entire identity. An email alias address is also a great way for you to stop receiving constant spam mail by simply deleting the email alias address.\nSee my review of the best secure and private email services at Cyberguy.com/Mail\nGET FOX BUSINESS ON THE GO BY CLICKING HERE\n5. Regularly monitor your credit and online accounts\nStaying safe is not just about avoiding that one phishing email. It is about noticing if something goes wrong afterward. Set up free credit monitoring if available, keep an eye on your Social Security statement through the SSA website and check your bank statements closely. Early detection of fraud can make a huge difference in limiting damage.\n6. Enable multi-factor authentication (MFA) on your accounts\nEven if your login credentials are stolen, MFA adds a powerful extra layer of security. With MFA, logging in requires a second code sent to your phone or generated by an app. Set up MFA on your email, bank and social media accounts to make it much harder for scammers to take over your accounts, even if they have your password.\n7. Use a password manager for unique, strong passwords\nA password manager can generate and securely store strong, unique passwords for all your accounts. This makes it much harder for scammers to access your accounts, even if one password gets leaked.\nGet more details about my best expert-reviewed Password Managers of 2025 at Cyberguy.com/Passwords\n8. Keep your software updated\nCybercriminals exploit outdated software to install malware or steal your data. Turn on automatic updates for your operating system, browsers and apps. This ensures you always have the latest security patches, making it much harder for scammers to compromise your devices.\n9. Use an identity theft protection service\nIf you're worried about identity theft, a credit freeze can prevent scammers from opening new accounts in your name, even if they have your Social Security number. Identity theft companies can monitor personal information like your Social Security number (SSN), phone number and email address and alert you if it is being sold on the dark web or being used to open an account. They can also assist you in freezing your bank and credit card accounts to prevent further unauthorized use by criminals.\nSee my tips and best picks on how to protect yourself from identity theft at Cyberguy.com/IdentityTheft\n10. Report phishing attempts to the authorities\nReporting suspicious emails helps authorities track and shut down scams. If you receive a phishing message:\n- Forward it to the Anti-Phishing Working Group (APWG): reportphishing@apwg.org\n- Report Social Security-related scams to the Social Security Administration (SSA) Office of the Inspector General: oig.ssa.gov/report\n- Report phishing and fraud to the Federal Trade Commission (FTC): reportfraud.ftc.gov\nMost email providers also have a \"Report phishing\" or \"Mark as spam\" button. Use it to help others stay safe.\nCLICK HERE TO GET THE FOX NEWS APP\nKurt's key takeaway\nPhishing scams are getting more sophisticated, but the psychology behind them remains the same: scare you into acting without thinking. Whether it's a fake Social Security suspension or a bogus bank alert, the goal is always to get your personal information or your money or access to your devices. The best defense is staying informed, thinking critically and never letting urgency override caution.\nHave you or someone you know ever received a suspicious message like the ones described here? How did you handle it? Let us know by writing us at Cyberguy.com/Contact\nSign up for my FREE CyberGuy Report\nGet my best tech tips, urgent security alerts and exclusive deals delivered straight to your inbox. Plus, you’ll get instant access to my Ultimate Scam Survival Guide — free when you join my CYBERGUY.COM/NEWSLETTER\nCopyright 2025 CyberGuy.com. All rights reserved."
    },
    {
      "url": "https://www.ic3.gov/PSA/2023/PSA230929",
      "text": "\"Phantom Hacker\" Scams Target Senior Citizens and Result in Victims Losing their Life Savings\nThe FBI is warning the public of a recent nationwide increase in \"Phantom Hacker\" scams, significantly impacting senior citizens. This Phantom Hacker scam is an evolution of more general tech support scams, layering imposter tech support, financial institution, and government personas to enhance the trust victims place in the scammers and identify the most lucrative accounts to target. Victims often suffer the loss of entire banking, savings, retirement, or investment accounts under the guise of \"protecting\" their assets. Between January and June 2023, 19,000 complaints related to tech support scams were submitted to the FBI Internet Crime Complaint Center (IC3), with estimated victim losses of over $542 million. Almost 50% of the victims reported to IC3 were over 60 years-old, comprising 66% of the total losses. As of August 2023, losses have already exceeded those in 2022 by 40%.\nThe Scam\nPhase 1 - Tech Support Imposter\n- A scammer posing as a tech or customer support representative from a legitimate company contacts the victim through a phone call, text, email, or a pop-up window on the victim's computer and instructs the victim to call a number for \"assistance.\"\n- Once the victim calls the number, a scammer directs the victim to download a software program, allowing the scammer remote access to the victim's computer. The scammer pretends to run a virus scan on the victim's computer and falsely claims the computer has been or is at risk of being hacked.\n- Next, the scammer requests the victim open their financial accounts to determine whether there have been any unauthorized charges - a tactic the scammer uses to determine which financial account is most lucrative for targeting. The scammer chooses an account to target and tells the victim they will receive a call with further instructions from the fraud department of the respective financial institution hosting that account.\nPhase 2 - Financial Institution Imposter\n- A scammer posing as a representative of the financial institution mentioned in phase 1, such as a bank or a brokerage firm, contacts the victim. The scammer falsely informs the victim their computer and financial accounts have been accessed by a foreign hacker and the victim must move their money to a \"safe\" third-party account, such as an account with the Federal Reserve or another US Government agency.\n- The scammer directs the victim to transfer money via a wire transfer, cash, or cryptocurrency, often directly to overseas recipients. The scammer may instruct the victim to send multiple transactions over a span of days or months.\n- The scammer tells the victim to not inform anyone of the real reason they are moving their money.\nPhase 3 - US Government Imposter\n- The victim may also be contacted by a scammer posing as an employee at the Federal Reserve or another US Government agency. If the victim becomes suspicious of the government imposter, the scammer may send an email or a letter on what appears to be official US Government letterhead to legitimize the scam.\n- The scammer continues to emphasize the victim's funds are \"unsafe\" and they must be moved to a new \"alias\" account for protection until the victim concedes.\nTips to Protect Yourself\n- Do not click on unsolicited pop-ups, links sent via text messages, or email links or attachments.\n- Do not contact the telephone number provided in a pop-up, text, or email.\n- Do not download software at the request of an unknown individual who contacted you.\n- Do not allow an unknown individual who contacted you to have control of your computer.\n- The US Government will never request you send money via wire transfer to foreign accounts, cryptocurrency, or gift/prepaid cards.\nReport it\nThe FBI requests victims report these fraudulent or suspicious activities to their local FBI field office and the FBI IC3 at www.ic3.gov. Be sure to include as much information as possible.\n- The name of the person or company that contacted you.\n- Methods of communication used, to include websites, emails, and telephone numbers.\n- The bank account number(s) where the funds were wired to and the recipient's name(s).\nFor additional information on similar scams, please see previous Public Service Announcements published on the FBI IC3 website."
    },
    {
      "url": "https://www.foxnews.com/category/tech/topics/cybercrime",
      "text": "U.S. 1 hour ago FBI warns seniors about billion-dollar scam draining retirement funds, expert says AI driving it The FBI is warning about a scam that it says has wiped out entire life savings and retirement accounts, leaving seniors devastated.\nU.S. 1 day ago Chinese national sentenced to prison for sabotaging employer's systems with 'kill switch' Former software developer Davis Lu receives four-year sentence for cyber attack that crashed systems and cost Ohio company hundreds of thousands.\nCybercrime 2 days ago The truth behind those mysterious shipment emails in your inbox Receiving order confirmations for purchases you never made could mean your email address is being exploited in fraud operations targeting multiple retailers.\nCybercrime 2 days ago Remove your data to protect your retirement from scammers Data brokers sell personal details that scammers use to target retirement funds through fake financial advisor calls and convincing phishing attempts\nArtificial Intelligence 2 days ago Meta AI docs exposed, allowing chatbots to flirt with kids Meta AI internal documents revealed chatbots were allowed to flirt with children and engage in romantic conversations until the company was exposed by Reuters.\nTech 5 days ago Air France and KLM breach tied to hacker group Authorities in France and the Netherlands have been notified. Meanwhile, impacted customers are being told to stay alert.\nTech 6 days ago Nearly a million patients hit by DaVita dialysis ransomware attack Kidney dialysis provider DaVita experienced a ransomware breach by the Interlock gang affecting 916,000 people in the second-largest U.S. healthcare attack of 2025.\nTech August 16 Google confirms data stolen in breach by known hacker group The ShinyHunters cybercriminal group breached Google's Salesforce system through vishing attacks, stealing business contact details and customer data.\nTech August 14 Don’t fall for this bank phishing scam trick Bank phishing emails mimic legitimate security alerts from trusted companies to trick users into clicking dangerous links that can compromise accounts and install malware.\nTech August 13 How to secure your 401(k) plan from identity fraud The tricky part is that most of us don't check our 401(k) accounts all that often, which makes it harder to spot unusual charges. And that gives cybercriminals the upper hand.\nTech August 12 CAPTCHAgeddon signals a dangerous shift Fake captchas have evolved into full-blown malware launchpads, thanks to a sneaky new method called ClickFix. It copies commands to your clipboard and tricks you into running them, without ever downloading a file.\nTech August 11 WhatsApp bans 6.8M scam accounts, launches safety tool Scammers are working harder than ever to trick people online, but WhatsApp is hitting back in a big way.\nTech August 10 Allianz Life Insurance data breach exposes 1.4 million Americans Minneapolis-based Allianz Life Insurance Company confirmed a cybersecurity breach affecting most customers after hackers accessed a cloud customer management system.\nTech August 9 How scammers exploit your data for 'pre-approved' retirement scams Scammers target older adults with fake retirement investment offers using personal information purchased from data brokers to appear legitimate and trustworthy.\nTech August 8 How to tell if your Samsung Galaxy tablet has been hacked Signs your Samsung Galaxy tablet may be hacked include battery drain, strange apps, pop-ups, crashes and suspicious account activity requiring immediate action.\nTech August 3 Microsoft SharePoint bug puts critical government agencies at risk Microsoft released patches for a SharePoint zero-day bug after hackers compromised over 400 servers worldwide using weaponized exploit chain.\nTech August 3 Update your iPhone now: iOS 18.6 fixes 29 security flaws A new iOS 18.6 iPhone update fixes a passcode exposure bug, address bar spoofing and multiple memory corruption issues in quick, free security patch.\nTech July 31 Dior data breach exposes US customers’ personal information Luxury fashion brand Dior experienced a January 2025 data breach affecting customer personal information, and notifications were sent months after the discovery.\nVIDEO July 31 Meta unveils 'personal superintelligence' as AI race heats up Kurt 'CyberGuy' Knutsson warns of a new scam targeting travelers and discusses Meta CEO Mark Zuckerberg sharing the company's 'personal superintelligence' plan.\nTech July 30 How AI is now helping hackers fool your browser's security tools Platforms like Hoax Tech and JS Click Cloaker help cybercriminals bypass detection systems using machine learning to selectively display scam content to victims.\nTech July 29 AI scam alerts now on Venmo and PayPal: What you need to know PayPal and Venmo just rolled out something big: AI-powered scam alerts for Friends and Family payments.\nTech July 28 The one thing that could protect your parents from scammers Stop the scammers from making contact in the first place. They're getting your parents' contact information and much more personal data besides, from somewhere.\nAirlines July 28 Russia's Aeroflot hit with 'hacker attack' by pro-Ukrainian group, cancels dozens of flights Russian airline Aeroflot cancels over 40 flights after cyberattack claimed by pro-Ukrainian group, prompting a criminal investigation by Russia.\nVIDEO July 28 Travelers stranded in Moscow after pro-Ukrainian hacker group targets Russia's Aeroflot airline Dozens of flights canceled after pro-Ukrainian hackers carried out a cyberattack against Russia's Aeroflot airline, reports said. (Credit: Reuters)\nTech July 25 Is your home Wi-Fi really safe? Think again Protect your home network from hidden dangers, including router vulnerabilities, ISP tracking and smart device weaknesses with proper encryption, firmware updates and VPN technology.\nCrime July 24 Woman learns fate after DOJ guilty plea admitting she helped North Korean tech workers infiltrate US companies Christina Marie Chapman of Arizona received a lengthy sentence for helping North Korean IT workers get jobs at American companies through an identity theft scheme.\nTech July 24 World’s first hybrid solar cargo ship launches in Germany The world's first hybrid solar cargo ship has just launched in Germany, marking a major milestone for sustainable shipping.\nTech July 24 What happens when Windows 10 support ends in 2025? Now that Windows 10 is being phased out, many users, especially those with older PCs that don't meet the hardware requirements, are understandably concerned.\nTech July 24 Amazon alerts customers about impersonation scams Think twice before clicking that email from Amazon. The company has sent out emails to hundreds of millions of customers warning about phishing scams that are tricking people into giving up their login credentials.\nMicrosoft July 23 Chinese hackers breach US nuclear security agency in cyberattack operation, officials say Chinese hackers breached the U.S. National Nuclear Security Administration through Microsoft SharePoint, with the Energy Department confirming no sensitive information was stolen."
    }
  ],
  "argos_summary": "The FBI warns that the \"Phantom Hacker\" scam, which has cost seniors over $1 billion since 2024, uses a three‑phase impersonation strategy—tech support, bank, and government— to trick victims into transferring funds.  The scheme pre‑selects targets by exploiting personal data from brokers and AI‑generated messages that reference specific interests.  Victims often lose entire life savings or retirement accounts, and recovery rates are low, with experts urging families to discuss and verify any unsolicited financial requests.  The FBI urges reporting to IC3 and highlights that the FBI’s public service announcements and recent media coverage aim to raise awareness and protect older adults from this evolving threat.",
  "argos_id": "3V387NR39"
}