{
  "url": "https://www.nytimes.com/athletic/6573472/2025/08/24/us-open-medvedev-bonzi-crowd-photographer-umpire/",
  "authorsByline": "Charlie Eccleshare",
  "articleId": "2ff1f67a4ccc4296b56c848f5ed17486",
  "source": {
    "domain": "nytimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "AZ",
      "county": "Pima County",
      "city": "Tucson",
      "coordinates": {
        "lat": 32.1988848,
        "lon": -110.8218543
      }
    }
  },
  "imageUrl": "https://static01.nyt.com/athletic/uploads/wp/2025/08/24233254/Medvedev-Bonzi-US-Open-scaled.jpg?width=1200&height=630&fit=cover",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-25T03:39:59+00:00",
  "addDate": "2025-08-25T03:46:45.212643+00:00",
  "refreshDate": "2025-08-25T03:46:45.212645+00:00",
  "score": 1.0,
  "title": "Daniil Medvedev’s U.S. Open match vs. Benjamin Bonzi delayed after crowd refuses to be quiet",
  "description": "After Bonzi was given back a first serve because a photographer entered the court, Medvedev was irate.",
  "content": "NEW YORK — There was bedlam at the U.S. Open Sunday night, when Daniil Medvedev’s match against Benjamin Bonzi was delayed for six minutes after a photographer prematurely entered the court.\n\nFrance’s Bonzi was up match point against former world No. 1 and U.S. Open champion Medvedev on Louis Armstrong Stadium, leading 6-3, 7-5, 5-4, when he missed a first serve. At this point, a photographer walked onto the court thinking the match was about to finish. Because of the delay caused by him coming onto the court, umpire Greg Allensworth ruled that Bonzi should have a first serve back, rather than having to hit a second serve.\n\nMedvedev, always a volatile player who knows how to work a crowd, berated Allensworth and demanded the crowd to make some noise and show their displeasure.\n\nAfter claiming that Allensworth “wanted to leave” because he gets “paid by the match, not by the hour,” he shouted toward the camera: “Reilly Opelka was right!” This was in apparent reference to the American player saying in February that: “The guy (Allensworth) shouldn’t have a job or should be sidelined for about four weeks, maybe learn a thing or two,” after he penalized Opelka for swearing at a spectator at the Dallas Open.\n\nWith the noise deafening, Bonzi waited before serving. Amid chants of “second serve,” Allensworth tried and failed to quieten the crowd, with Bonzi asking why Medvedev did not receive a time violation for inciting the commotion.\n\nEventually, after a six-minute delay, Bonzi did serve, missing it, before sending a backhand into the net after a nervy second serve. Medvedev won the next two points and broke to rescue the match, sending the crowd into a frenzy. He then claimed the set in a tiebreak, resurrected after the most unlikely of delays.",
  "medium": "Article",
  "links": [
    "https://twitter.com/TheTennisLetter/status/1959818781540397197?ref_src=twsrc%5Etfw",
    "https://t.co/nzlqgoWxre"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "match point",
      "weight": 0.10347454
    },
    {
      "name": "Benjamin Bonzi",
      "weight": 0.101529494
    },
    {
      "name": "umpire Greg Allensworth",
      "weight": 0.09249945
    },
    {
      "name": "Bonzi",
      "weight": 0.09193307
    },
    {
      "name": "Greg Allensworth",
      "weight": 0.09171608
    },
    {
      "name": "U.S. Open",
      "weight": 0.09139276
    },
    {
      "name": "Allensworth",
      "weight": 0.08710055
    },
    {
      "name": "Medvedev",
      "weight": 0.08272494
    },
    {
      "name": "Daniil Medvedev’s U.S. Open match",
      "weight": 0.08214681
    },
    {
      "name": "crowd",
      "weight": 0.08036494
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.98828125
    },
    {
      "name": "/Sports/International Sports Competitions/Other",
      "score": 0.78759765625
    },
    {
      "name": "/Sports/Individual Sports/Racquet Sports",
      "score": 0.515625
    }
  ],
  "sentiment": {
    "positive": 0.059296474,
    "negative": 0.6710337,
    "neutral": 0.2696698
  },
  "summary": "Daniil Medvedev's match against Benjamin Bonzi was delayed for six minutes when a photographer prematurely entered the court. Bonzi, who was leading 6-3, 7-5, 5-4, had missed a first serve and umpire Greg Allensworth ruled that he should return the first serve. Medvedeva, known for his volatile behavior, berated Allenshew and demanded the crowd to make more noise. After the delay, Bonzi waited before serving and eventually won the match.",
  "shortSummary": "Daniil Medvedev's match against Benjamin Bonzi was delayed six minutes due to crowd trouble at the U.S. Open, resulting in a set loss and a time violation.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "5e6c663e850249b6949bf137f7d76637",
  "places": [
    {
      "osmId": "840573223",
      "road": "New York Avenue",
      "suburb": "Queens",
      "city": "New York",
      "state": "New York",
      "postcode": "11368",
      "country": "United States",
      "countryCode": "us",
      "coordinates": {
        "lat": 40.7510137,
        "lon": -73.8454146258459
      }
    }
  ],
  "scraped_sources": [],
  "argos_summary": "At the U.S. Open, a photographer entered the court during Medvedev’s match against Bonzi, causing a six‑minute delay. Umpire Greg Allensworth allowed Bonzi a first‑serve replay, which Medvedev protested loudly, citing a prior incident involving Reilly Opelka. After the delay Bonzi missed his serve, allowing Medvedev to break and win the set in a tiebreak.",
  "argos_id": "3ZOD7FP0Z"
}