{
  "url": "https://www.foxnews.com/politics/trump-says-he-could-send-national-guard-maryland-address-crime",
  "authorsByline": "Amanda Macias",
  "articleId": "64a596421e384ae1b0838e0ef4f66310",
  "source": {
    "domain": "foxnews.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/08/931/523/maryland-gop-congressman-redistricting-fox-news-001.jpg?ve=1&tl=1",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-24T12:11:13-04:00",
  "addDate": "2025-08-24T16:21:02.845221+00:00",
  "refreshDate": "2025-08-24T16:21:02.845223+00:00",
  "score": 1.0,
  "title": "Trump says he could send the National Guard to Maryland to address crime",
  "description": "President Donald Trump said he could send the National Guard to Maryland to address the cities crime rate following an invitation from Governor Wes Moore for Trump to participate in a public safety walk.",
  "content": "President Donald Trump said Sunday that he would send the National Guard to Baltimore to \"quickly clean up the crime\" if Maryland Gov. Wes Moore says he need help.Moore had earlier invited Trump to attend a public safety walk in the crime-ridden city in September, saying in an Aug. 21 letter that the event would provide an opportunity to \"discuss strategies for effective public safety policy.\"TRUMP VOWS TO MAKE DC 'SAFER' AND 'BEAUTIFUL' AS CAPITAL BATTLES CRIME AND HOMELESSNESS\"As President, I would much prefer that he clean up this crime disaster before I go there for a walk,\" Trump wrote in a Truth Social post. He accused Moore of having a poor record on crime \"unless he fudges his figures on crime like many of the other Blue States are doing.\"Trump added that he did not appreciate the tone of Moore’s invitation.CHICAGO MAYOR CALLS TRUMP'S NATIONAL GUARD DEPLOYMENT PLAN 'UNCOORDINATED, UNCALLED-FOR AND UNSOUND'\"But if Wes Moore needs help, like Gavin Newscum did in L.A., I will send in the \"troops,\" which is being done in nearby DC, and quickly clean up the crime,\" Trump wrote. He added that Baltimore ranks among the worst cities in the United States for crime and murder.Earlier this month, the Trump administration rolled out a plan aimed at making Washington, D.C., \"safer and more beautiful\" as his administration doubles down on efforts to address crime and a growing homeless population in the nation’s capital. \"I will take care of our cherished Capital, and we will make it, truly, GREAT AGAIN! Before the tents, squalor, filth, and crime, it was the most beautiful Capital in the world. It will soon be that again,\" Trump wrote in a Truth Social post on Aug. 10. BLUE CITIES IN TRUMP’S CROSSHAIRS AFTER DC POLICE TAKEOVERTrump has repeatedly characterized Washington, D.C., as \"one of the most dangerous cities anywhere in the world.\" Officials have sought to curb crime by deploying hundreds of federal agents and National Guard troops to patrol the streets.On Friday, Trump said he was considering sending the National Guard to Chicago, calling the Windy City \"a mess.\"Trump said that his administration will \"straighten that one out probably next,\" adding that \"it won’t even be tough.\" The White House has not offered additional details of a potential deployment of troops to Chicago.",
  "medium": "Article",
  "links": [
    "https://governor.maryland.gov/Documents/Letter%20to%20President%20on%20Public%20Safety.pdf",
    "https://www.foxnews.com/politics/chicago-mayor-calls-trumps-national-guard-deployment-plan-uncoordinated-uncalled-for-unsound",
    "https://www.foxnews.com/politics/trump-vows-make-dc-safer-beautiful-capital-battles-crime-homelessness",
    "https://www.foxnews.com/category/person/donald-trump",
    "https://www.foxnews.com/us/blue-cities-trumps-crosshairs-after-dc-police-takeover",
    "https://www.foxnews.com/category/us/chicago",
    "https://www.foxnews.com/video/6377318071112",
    "https://foxnews.onelink.me/xLDS?pid=AppArticleLink&af_dp=foxnewsaf%3A%2F%2F&af_web_dp=https%3A%2F%2Fwww.foxnews.com%2Fapps-products"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "CRIME",
      "weight": 0.10724004
    },
    {
      "name": "crime",
      "weight": 0.10724004
    },
    {
      "name": "National Guard troops",
      "weight": 0.09516153
    },
    {
      "name": "National Guard",
      "weight": 0.089097835
    },
    {
      "name": "Maryland Gov. Wes Moore",
      "weight": 0.08219658
    },
    {
      "name": "Wes Moore",
      "weight": 0.080600664
    },
    {
      "name": "President Donald Trump",
      "weight": 0.080588385
    },
    {
      "name": "Donald Trump",
      "weight": 0.08040821
    },
    {
      "name": "Trump",
      "weight": 0.07942698
    },
    {
      "name": "BLUE CITIES",
      "weight": 0.072017424
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.96875
    },
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.9482421875
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.9091796875
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.442626953125
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.345458984375
    }
  ],
  "sentiment": {
    "positive": 0.053026807,
    "negative": 0.76789206,
    "neutral": 0.17908108
  },
  "summary": "President Donald Trump has suggested sending the National Guard to Baltimore, if Maryland Gov. Wes Moore needs assistance. Moore had invited Trump to a public safety walk in the crime-ridden city in September, promising to discuss strategies for effective public safety policy. However, Trump criticized Moore's lacklustre record on crime and accused him of fiddling his figures. The Trump administration has been focusing on making Washington, D.C. safer and more aesthetically.",
  "shortSummary": "President Donald Trump may send the National Guard to Baltimore to address crime, following a public safety invitation by Maryland governor Wes Moore.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "d954beeb752d46ffa6b8038b94bb6b07",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.foxnews.com/us/blue-cities-trumps-crosshairs-after-dc-police-takeover",
      "text": "As President Donald Trump looks to crack down on crime within Washington, D.C., by sending in federal law enforcement to patrol the city, data reveals the nation’s capital is plagued by violent crime when compared to other metropolitan areas around the country.\nThe crackdown comes as the Metropolitan Police Department (MPD) is asking for the public's help in identifying a suspect involved in a stabbing on Aug. 7, according to police.\nThe incident occurred as the suspect and victim became involved in a physical altercation in the 1100 block of 7th Street, Northwest, authorities said. During the fight, the suspect allegedly stabbed the victim before fleeing the scene.\nThe victim was subsequently transported to a local hospital with non-life-threatening injuries.\nTRUMP'S FEDERAL CRIME OPERATION BRINGS 100 ARRESTS, 800 NATIONAL GUARD TROOPS TO WASHINGTON\nIn a news conference Monday, Trump announced he is planning to deploy members of the National Guard to the city’s streets while taking control of the MPD in an effort to restore safety and combat violence.\n\"You can be anything you want, but you want to have safety in the streets,\" Trump said. \"You want to be able to leave your apartment or your house where you live and feel safe and go into a store to buy a newspaper or buy something, and you don’t have that now.\"\nThe move comes as the nation’s capital \"averaged one of the highest robbery and murder rates of large cities nationwide,\" according to an executive order, \"Declaring a Crime Emergency in the District of Columbia.\"\n\"Indeed, the District of Columbia now has a higher violent crime, murder, and robbery rate than all 50 states, recording a homicide rate in 2024 of 27.54 per 100,000 residents,\" the order states.\nTRUMP CLAIMS DC CRIMES TROUNCE STATS FROM NOTORIOUSLY VIOLENT CITIES WORLDWIDE\nIn 2024, Washington D.C. placed fourth among 24 of the nation’s cities when comparing homicide rates per 100,000 citizens, according to a report conducted by the Rochester Institute of Technology (RIT).\n\"The recent increase of federal law enforcement officers across Washington, D.C., has already stopped vicious criminals, the distribution of deadly narcotics and the violent use of stolen handguns,\" a White House spokesperson said in a statement to Fox News Digital.\n\"President Trump’s bold leadership and decisive action will make our nation’s capital beautiful and safe again for its residents and visitors from all the world. The president’s efforts to crack down on crime is an incredibly popular policy that everyday Americans support.\"\nSt. Louis, New Orleans and Detroit accounted for more homicides per capita, the study reported.\nWhen compared to other major metropolitan cities, Washington D.C.’s homicide rate remained exceptionally high when placed alongside New York City’s rate of and Los Angeles’ rate, according to RIT.\nMPD did not immediately respond to Fox News Digital's request for comment.\nWhile Trump's ability to utilize the MPD is unique to the nation's capital, federal law enforcement could integrate into other cities with high crime rates utilizing consent decrees, according to former NYPD Lt. Darrin Porcher.\n\"That's when the federal government comes in, and they review a police department,\" Porcher told Fox News Digital. \"And they'll make a series of recommendations based on what the police department is not doing.\"\nI SUPPORT TRUMP TAKING CONTROL OF DC POLICE — THE CONSTITUTION IS ON HIS SIDE\nPorcher pointed to the ability of federal law enforcement to collaborate with local authorities in crime-ridden cities in an effort to reform a department's response to violence.\n\"A lot of task force activity would be the key component,\" Porcher said. \"So, what the feds can do is send a series of FBI, DEA or ATF agents to a particular city, and they would be a part of a task force that works with the localized police departments. The resources would bridge together from both the city and the federal government to target the excessive crimes that are being committed in that particular area, whether it's homicides, robberies, burglaries.\"\nTRUMP ACTIVATES NATIONAL GUARD TROOPS TO ADDRESS ‘TOTALLY OUT OF CONTROL’ CRIME IN WASHINGTON\nWATCH: The president was clear we must stand behind our police officers, DEA administrator says\nDespite the higher-than-average rates, the homicide rate within Washington, D.C., dropped 35% when compared to 2023, marking the lowest violent crime rates the city has seen in 30 years, according to the Department of Justice.\n\"In addition to the overall violent crime reduction, homicides are down 32%,\" the DOJ said in a news release. \"Robberies are down 39%; armed carjackings are down 53%; assaults with a dangerous weapon are down 27% when compared with 2023 levels, with the District reporting the fewest assaults with dangerous weapons and burglaries in over 30 years.\"\nHowever, residents within the nation’s capital insist the move by the Trump administration is a step in the right direction.\nTRUMP'S PLAN TO DEPLOY NATIONAL GUARD IN DC SPARKS BACKLASH FROM RESIDENTS—BUT SOME WELCOME IT\n\"This is something I think that's been long overdue,\" Jenn Pellegrino, chief spokesperson of America First Policy Institute, told Fox News Digital. \"If you walk around our nation's capital, which sees over 20 million visitors from all around the world every year, this is a lot of people's first impression of what the United States of America is like.\"\nPellegrino has been living in Washington, D.C., for 15 years and has become disheartened by the state of the city she calls home.\n\"While the left is saying that there's nothing to see here, that the White House is overreacting to this situation, it's about how people feel,\" Pellegrino said. \"They can say that the crime stats are down, which some are, but some are rising, like carjacking. People don't feel safe, and something needs to be done to address that.\"\nWASHINGTON, DC, IS MORE DANGEROUS THAN THE CAPITALS OF MANY THIRD-WORLD COUNTRIES, SENATOR SAYS\nAlthough instances of violent crime within Washington, D.C. are down when compared to 2023, reports of incidents involving property remain either relatively stagnant or trending upward.\n\"I think that there is a significant need for crime reduction in a lot of these large cities, such as Los Angeles, New York, Philadelphia, Washington, D.C.,\" Porcher said.\nIn 2025, property crime within the city is down by 4%, according to the MPD. Additionally, there have already been 2,926 reports of motor vehicle theft logged this year, approaching last year's total of 2,940.\n\"It's time to get tough on some of the smaller crimes to prevent the more violent crimes that have been going on in the city,\" Pellegrino said. \"Because, honestly, if you walk around D.C., even in the middle of the daytime [or] a weekday, you’ve got to have your head on a swivel.\"\nCLICK HERE TO GET THE FOX NEWS APP\nPellegrino hopes the Trump administration’s efforts will set a standard for other cities grappling with crime throughout the country, while ensuring the nation’s capital is a safe place to visit, live and work.\n\"These violent crimes can happen to anybody,\" Pellegrino told Fox News Digital. \"They don't discriminate based on your politics. And, again, whether you're a tourist coming to visit or you're somebody that's lived here, or you just work in the city, we deserve better than that. This is the United States of America. It's the greatest country on Earth. Our nation's capital should represent something better than the standard it's been held to over the last several years.\""
    },
    {
      "url": "https://foxnews.onelink.me/xLDS?pid=AppArticleLink&af_dp=foxnewsaf%3A%2F%2F&af_web_dp=https%3A%2F%2Fwww.foxnews.com%2Fapps-products",
      "text": "Fox News is Everywhere.\nWatch Fox News Channel on all of your devices to keep up to date with the latest in news, politics, entertainment and more. On phones, tablets, wearables and TV, it's easy to stay connected anywhere.\niOS Devices\nAndroid Devices\nApple TV\nRoku\nChromecast\nAndroid TV\nAmazon Fire\nFubo TV\nApple Watch\nAmazon Echo\nGoogle Home\nFox News Go\nApple News\nAT&T TV Now\nYouTube TV\nHulu\nFacebook\nInstagram\nSamsung Devices\nSling TV\nVidgo\nSpotify\niHeartRadio\nFlipboard\nLinkedIn\nGoogle Newsstand\nNewsletters\nYouTube\nFAQ\nHow much data does Fox News Go use?\nFox News Go uses about 2GB per hour of SD viewing and 4GB per hour of HD viewing. This can vary depending on your device and internet connection. If you are concerned about your data usage we recommend not streaming over a cellular network and contacting your Internet or Cellular Service Provider.\nWhat broadcast quality will I get while streaming on my device?\nFox News will stream at the highest quality possible based on your device and internet connection quality. For the best quality we recommend streaming via Wi-Fi or 4G.\nWhat channels are available on Fox News Go?\nYou can Watch Fox News Channel on Fox News Go and Fox Business Channel on Fox Business Go"
    },
    {
      "url": "https://www.foxnews.com/politics/trump-vows-make-dc-safer-beautiful-capital-battles-crime-homelessness",
      "text": "President Donald Trump vowed on Sunday to make Washington, D.C., \"safer and more beautiful\" as his administration doubles down on efforts to address crime and a growing homeless population in the nation’s capital.\n\"I will take care of our cherished Capital, and we will make it, truly, GREAT AGAIN! Before the tents, squalor, filth, and crime, it was the most beautiful Capital in the world. It will soon be that again,\" Trump wrote in a Truth Social post.\nTrump also announced that a plan to address homelessness, public safety, and urban cleanliness will be detailed during a press conference at the White House scheduled for 10 a.m. on Monday.\nTRUMP INCREASES FEDERAL LAW ENFORCEMENT PRESENCE IN DC FOLLOWING VIOLENT CRIME SURGE\n\"The Mayor of D.C., Muriel Bowser, is a good person who has tried, but she has been given many chances, and the Crime Numbers get worse, and the City only gets dirtier and less attractive. The American Public is not going to put up with it any longer,\" Trump added.\nTrump wrote in a separate Truth Social post that he wants the homeless to \"immediately\" move \"far from\" the nation's capital. \"The criminals, you don’t have to move out. We're going to put you in jail where you belong,\" he wrote in the same post, adding that the new crackdowns on both issues are \"going to happen very fast.\"\n\"There will be no \"MR. NICE GUY.\" We want our Capital BACK,\" Trump wrote, adding that more details on these efforts will be laid out during a press conference on Monday.\nWHITE HOUSE LAUNCHES FEDERAL SECURITY BLITZ AS PRESIDENT VOWS TO END DC 'CRIME PLAGUE'\nTrump has repeatedly characterized Washington, D.C., as \"one of the most dangerous cities anywhere in the world.\" On Saturday, Trump said his administration will \"essentially, stop violent crime\" in the nation's capital.\nLast week, Trump said he was weighing a federal takeover of D.C.’s police force, including the potential deployment of the National Guard, to confront rising crime in the capital.\nThe renewed focus follows a series of violent incidents in the city, some involving federal staffers, including a high-profile employee from the Department of Government Efficiency (DOGE) who was a victim of an attempted carjacking.\nTRUMP THREATENS TO FEDERALIZE DC AFTER EX‑DOGE EMPLOYEE BEATEN\n\"We have a capital that’s very unsafe, you know, we just almost lost a young man, beautiful, handsome guy that got the hell knocked out of him,\" Trump said, referencing former DOGE employee Edward Coristine.\nThe president described crime in D.C. as \"out of control,\" with young \"thugs\" and \"gang members\" who are \"randomly attacking, mugging, maiming, and shooting innocent citizens.\"\nCLICK HERE TO GET THE FOX NEWS APP\nWhite House Press Secretary Karoline Leavitt said last week in a statement to Fox News that \"President Trump has directed an increased presence of federal law enforcement to protect innocent citizens. Starting tonight, there will be no safe harbor for violent criminals in D.C.\"\n\"Washington, D.C. is an amazing city, but it has been plagued by violent crime for far too long,\" Leavitt added."
    },
    {
      "url": "https://www.foxnews.com/politics/chicago-mayor-calls-trumps-national-guard-deployment-plan-uncoordinated-uncalled-for-unsound",
      "text": "Mayor Brandon Johnson blasted President Donald Trump over what he described as \"threats\" to deploy the National Guard in Chicago to crack down on crime.\nJohnson's comments came hours after the president on Friday said Chicago would be the next city to see federal intervention after the mission to decrease crime in Washington, D.C., concluded.\n\"After we do this, we'll go to another location, and we'll make it safe, also,\" Trump said in the Oval Office. \"We're going to make our country very safe. … Chicago's a mess.\"\nJohnson released a statement noting the city had not received any formal communication about additional federal law enforcement or military deployments to Chicago, adding he has \"grave concerns\" about the impact of any \"unlawful deployment.\"\nTRUMP VOWED DC TAKEOVER MULTIPLE TIMES ON 2024 CAMPAIGN TRAIL: 'HE'S KEEPING HIS PROMISE'\nJohnson called the Trump administration's efforts \"uncoordinated, uncalled-for and unsound,\" seemingly snapping back at the president, who called him \"grossly incompetent\" earlier in the day.\nHe added the city has reduced homicides by 30%, robberies by 35% and shootings by almost 40% in the last year, suggesting federal action would deteriorate trust.\n\"Unlawfully deploying the National Guard to Chicago has the potential to inflame tensions between residents and law enforcement when we know that trust between police and residents is foundational to building safer communities,\" Johnson wrote. \"An unlawful deployment would be unsustainable and would threaten to undermine the historic progress we have made.\"\nBLUE CITIES IN TRUMP’S CROSSHAIRS AFTER DC POLICE TAKEOVER\nThe city, which struggles with poverty and gang activity, has a crime rate higher than the national average.\nHowever, 2023 crime data shows other Illinois cities, including Chicago Heights, Danville, Peoria, Rockford, and Harvey, had substantially higher violent crime rates than Chicago.\n\"The National Guard will not alleviate the housing crisis,\" Johnson wrote. \"It will not put food in the stomachs of the 1 in 4 children that go to bed hungry every night in Chicago. The National Guard will not fully-fund our public schools or provide mental healthcare or substance abuse treatment to Chicagoans in need.\n\"The National Guard is no substitute for dedicated local law enforcement and community violence interrupters who know and serve our communities every day. There are many things the federal government could do to help us reduce crime and violence in Chicago, but sending in the military is not one of them.\"\nTrump federalized D.C.'s Metropolitan Police Department on Aug. 11 under the District of Columbia Home Rule Act, which allows the president to take emergency control of the police force for 30 days.\nJust over a week later, six red states pledged to send 2,000 guardsmen to the nation's capital to help with the efforts, alongside agents from the FBI, the Drug Enforcement Administration (DEA) and the Bureau of Alcohol, Tobacco, Firearms and Explosives (ATF).\nAn official confirmed to Fox News on Friday Defense Secretary Pete Hegseth authorized soldiers and airmen to be armed in D.C., if their mission requires it.\nCLICK HERE TO GET THE FOX NEWS APP\nThe White House did not immediately respond to Fox News Digital's request for comment.\nFox News Digital's Rachel Wolf contributed to this report."
    },
    {
      "url": "https://www.foxnews.com/category/us/chicago",
      "text": "J.B. Pritzker 11 hours ago Gov. Pritzker says Trump trying to 'manufacture a crisis' as admin plans National Guard deployment to Chicago Illinois Gov. JB Pritzker said there is no emergency following reports that the federal government may deploy the National Guard to Chicago.\nCrime 23 hours ago Gianno Caldwell mulls Senate bid as Chicagoans are 'begging for change' on crime woes Gianno Caldwell mulls Illinois Senate campaign for Dick Durbin's open seat, focusing on a law-and-order platform after a personal tragedy in Chicago.\nJussie Smollett 1 day ago Jussie Smollett felt 'extremely emasculated' by outpouring of support after assault story went viral In a new Netflix documentary, former \"Empire\" star Jussie Smollett spoke out about the support he received after he came forward with the hate crime allegation.\nVIDEO 1 day ago Trump previews crime crackdown outside the beltway Fox News senior White House correspondent Peter Doocy has the latest on President Donald Trump's plan to crack down on crime in more cities on 'Special Report.'\nChicago 1 day ago Chicago mayor calls Trump's National Guard deployment plan 'uncoordinated, uncalled-for and unsound' Chicago mayor opposes Trump's planned National Guard deployment for crime reduction, citing city's recent 30% decrease in homicides and community trust concerns.\nChicago 2 days ago Three killed in blue city shootings as Trump threatens to expand federal crime crackdown Overnight shootings leave three dead in Chicago as Trump discusses expanding federal law enforcement to crime-ridden cities across America.\nMedia 4 days ago Chicago mayor says applicants for flood relief need not reveal if they’re in the US illegally Mayor Johnson said undocumented immigrants can apply for Chicago flood aid without revealing status as sanctuary city protects residents.\nBarack Obama 5 days ago Chicago residents call Obama Presidential Center a 'monstrosity,' fear they'll be displaced: report Chicago community leaders and longtime residents say the Obama Presidential Center risks washing away the neighborhood’s fabric, warning that proposed luxury developments tied to the project could price out families who have long called the South Side home.\nChicago 6 days ago Woman killed in blue city robbery as threat of Trump takeover looms with thieves terrorizing public Chicago police search for suspect in fatal shooting of Gabriela Ochoa during botched robbery attempt on South Side Saturday night in ongoing investigation.\nMedia August 14 Jussie Smollett calls Chicago PD and Rahm Emanuel 'villains' while denying hate crime hoax Former Empire star Jussie Smollett criticized the Chicago Police Department and former Mayor Rahm Emanuel over his past hate crime hoax conviction in an interview with Variety on Wednesday.\nMedia August 13 Illinois changes benchmarks that proved proficiency in math, English on standardized tests More Illinois students will be labeled proficient in reading and math after state board adjusts standardized test cut scores to align with college readiness expectations.\nMedia August 13 Ex-police chief warns Chicago cops will get hurt because Mayor Johnson won’t help ICE A former Riverside police chief warned that Mayor Brandon Johnson's anti-ICE stance could lead to injuries among Chicago police officers and federal agents.\nOpinion August 12 America's obsession with politicizing our children has got to stop Imagine my shock hearing about the summer camp my friend’s daughter attended. Nestled in a mountain paradise of trees and lakes, it looked like the all-American camp—until it wasn’t.\nIllegal Immigrants August 11 Illinois Democrats tell feds to stop trying to 'usurp' state authority over immigration Illinois Democrats tell DOJ and DHS that state sanctuary laws, including TRUST Act and Chicago Welcoming City Ordinance, follow constitutional requirements.\nZohran Mamdani August 8 Chicago's budget shortfall puts spotlight on Mamdani's 'socialism' agenda for New York City NYC mayoral frontrunner Zohran Mamdani faces criticism over costly socialist policies that opponents warn could create a fiscal crisis similar to Chicago.\nHomeland Security August 8 Noem, in Illinois, calls out Gov. Pritzker, Chicago's mayor over their handling of criminal illegal immigrants Homeland Security Secretary Kristi Noem said Illinois Gov. JB Pritzker and Chicago Mayor Brandon Johnson are \"being obstructionist\" when it comes removing criminals.\nVIDEO August 7 Sean Hannity: Democrats are ‘nothing like the party they used to be’ Fox News host Sean Hannity exposes former House Speaker Nancy Pelosi’s, D-Calif., ‘dramatic shift’ and calls out Democrats’ old ‘tactics’ as they promote socialism on ‘Hannity.’\nVIDEO August 7 Beloved Fox News photographer sworn in as US citizen 'Special Report' highlights Fox News senior field photographer Svein Schwab's dream come true after he was sworn in as a U.S. citizen.\nImmigration August 7 Chicago Mayor concludes council-demanded probe of city police’s role during recent ICE raid Chicago mayor finishes investigation into police presence at June 4 ICE raid that detained 10 people, leading to aldermen blocking ICE van\nOpinion August 5 I'm a Black pastor alarmed by a new identity game some on the right are playing Some on the right are pivoting to 'Black fatigue' and tribal thinking about Black Americans. But tribalism is a crutch, a cheap shot that fuels keyboard wars on X but fixes nothing.\nTexas August 4 Texas Dems also skipped town in 2021 to avoid a vote, and several caught COVID-19 in DC Texas House Democrats flee state to block redistricting vote, claiming Republicans are using an intentionally racist map to undermine Black and Latino voters.\nZohran Mamdani August 4 Mamdani studies 'America's Worst Mayor' Brandon Johnson to avoid his political pitfalls: report Democratic socialist Zohran Mamdani hopes to emulate Boston's Michelle Wu rather than Chicago's struggling Brandon Johnson in his New York mayoral campaign.\nCrime August 4 Armed robbers target bar hoppers in ritzy blue city neighborhood: ‘Held the gun to my head’ People in Chicago's River North Neighborhood are targeting intoxicated individuals in the early morning hours and robbing them, police said\nMedia August 1 Chicago Tribune warns 'Halloween comes early' with Mayor Johnson's plan to 'scare' businesses away The Chicago Tribune criticized Mayor Johnson for announcing controversial tax policies before his working group meets, calling his proposals economically destructive.\nJoe Biden July 31 Biden takes aim at Trump as ‘existential’ threat to Black Americans in speech to lawyers group Former President Joe Biden warned that Trump-era policies threaten civil rights progress in a fiery speech to a Black legal group in Chicago Thursday night.\nVIDEO July 31 Chicago Mayor Brandon Johnson is 'in over his head' running the city, former governor lodges Former Illinois Gov. Rod Blagojevich rails against Chicago Mayor Brandon Johnson for refusing to work with I.C.E. on 'The Ingraham Angle.'\nFox News Flash July 29 Chicago's 'Rooftop Pastor' to embark on epic cross-country journey to benefit America's troubled youth Pastor Corey Brooks will walk from New York to Los Angeles to raise $25 million for underserved youth to promote a message of faith, merit, and perseverance.\nOpinion July 29 The untapped potential AI can't replace in underserved communities like mine Demand across America for over 500,000 electricians and thousands more tradespeople could transform America's underserved neighborhoods.\nChicago July 26 Federal judge tosses Trump DOJ lawsuit against sanctuary policies in Chicago A federal judge in Illinois has dismissed a Trump administration lawsuit that sought to disrupt limits Chicago imposes on cooperation between federal immigration agents and local police.\nMedia July 23 Chicago Public Schools agrees to pay feds back $1 million over misallocated grants A Department of Education investigation found Chicago Public Schools wrongly obtained $1.1 million by misidentifying South Asian students as Native Americans for grant money."
    },
    {
      "url": "https://www.foxnews.com/category/person/donald-trump",
      "text": "Key facts about President Donald Trump: What to know\nDonald Trump served as the 45th President of the United States and was re-elected in 2024 to become the 47th President. He was sworn into office on January 20, 2025. With his 2024 presidential win, Trump became the second person in U.S. history to win non-consecutive terms, following Grover Cleveland, the 22nd and 24th President.\nDuring his first campaign, Trump, a real estate developer and reality TV host, successfully defeated Hillary Clinton for the White House. Although he lost the popular vote, he won the Electoral College, securing his first presidential victory.\nThe 2020 presidential election resulted in defeat for Trump, as he lost his re-election bid to Democratic challenger Joe Biden. In 2022, Trump announced his candidacy for the 2024 Presidential election, marking the start of his third campaign.\nIn July 2024, Trump announced Ohio Senator JD Vance as his running mate. The Republicans focused heavily on issues like the economy and border security during their campaign. Trump was victorious against Vice President Kamala Harris in the 2024 presidential election, winning both the popular vote and the Electoral College to regain his position as President of the United States.\nIn April 2025, Trump unveiled a series of historic tariffs during a \"Make America Wealthy Again\" event at the White House's Rose Garden. This event was part of a day his administration called \"Liberation Day\" for the United States. Trump argues that these tariffs will help bring manufacturing jobs back to the U.S. The Trump administration plans to impose tariffs on certain goods from countries such as Mexico, Canada, China, and others.\nPresident Trump is married to First Lady Melania Trump, and together they have one son, Barron Trump. Trump was previously married to Ivana Trump in 1977, with whom he had three children: Donald Trump Jr., Ivanka Trump, and Eric Trump. Ivana passed away in 2022. Trump married Marla Maples in 1993, and they have one daughter, Tiffany Trump.\nDonald Trump Jr., the eldest child of President Trump, has five children: Kai Trump, Donald J. Trump III, Tristan Trump, Spencer Trump, and Chloe Trump. Eric Trump is married to Lara Trump, who currently hosts FOX News Channel's \"My View with Lara Trump.\" Eric and Lara have two children, Eric Luke Trump and Carolina Trump. Ivanka Trump is married to Jared Kushner, and they have three children: Arabella Kushner, Joseph Kushner, and Theodore Kushner. Tiffany Trump welcomed her first child, Alexander Boulos, in 2025 with her husband, Michael Boulos."
    }
  ],
  "argos_summary": "President Donald Trump announced he would send the National Guard to Baltimore if Maryland Gov. Wes Moore asks for help, criticizing the governor’s crime record and calling for a rapid cleanup. He also pledged to make Washington, D.C., “safer and more beautiful,” announcing a federal takeover of the city’s police force and a planned deployment of National Guard troops to curb rising violence and homelessness. Trump’s comments extend to Chicago, where he threatened an uncoordinated National Guard deployment to address crime, prompting criticism from city officials who highlighted recent crime reductions and concerns about federal overreach. The administration’s broader strategy involves increased federal law‑enforcement presence in major cities, citing high homicide rates and the need for swift action to restore public safety.",
  "argos_id": "42PBUGIKP"
}