{
  "url": "https://nypost.com/2025/08/24/us-news/forensic-team-reveals-kohbergers-panicked-phone-activity-before-idaho-murders-arrest/",
  "authorsByline": "Fox News",
  "articleId": "8c7e79aeff49423295e0f485beef7723",
  "source": {
    "domain": "nypost.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://nypost.com/wp-content/uploads/sites/2/2025/08/110033685.jpg?quality=75&strip=all&w=1024",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-25T02:54:05+00:00",
  "addDate": "2025-08-25T02:58:07.623085+00:00",
  "refreshDate": "2025-08-25T02:58:07.623087+00:00",
  "score": 1.0,
  "title": "Bryan Kohberger’s panicked phone activity after car was ID’d following Idaho murders revealed by forensic team: ‘Huge stress point’",
  "description": "Forensic experts detail Bryan Kohberger’s panicked phone searches before his arrest in Idaho murders.",
  "content": "Bryan Kohberger saw a news article about a white Hyundai Elantra having been identified as a suspect vehicle in the Idaho student murders and immediately panicked, according to the forensic team that analyzed his phone.\n\n“I think the vehicle was a huge stress point for him, because he had registered it to park there,” said Jared Barnhart, who along with his wife Heather works at the digital forensics firm Cellebrite. “He had a PDF download of like a list of Hyundai Elantras for the university, you know, and you can see this long list of cars.”\n\nKohberger was attending Washington State University, just 10 miles from the crime scene adjacent to the University of Idaho, and had been pulled over driving near both campuses in the weeks before the murders.\n\nThe car was still on his mind in the hours before his arrest, according to the Barnharts.\n\n“If you weren’t the bad guy, you wouldn’t care, but he was scrambling, and he thought the police were on him,” Jared Barnhart told Fox News Digital. “And they were. They were at that point.”\n\nAccording to phone data reviewed by the Barnharts, Kohberger did the following during the late-night hours of Dec. 29, 2022:\n• Kohberger searched for the phrases “wiretap” and “psychopaths paranoid”\n• He read an article about how police were still searching for the suspect vehicle\n• He visited the Moscow Police Department website and checked the latest press release on the case\n• He “immediately” looked up an auto detailing shop\n• Within 10 minutes, he was shopping online for another car\n\n“Literally the pressure of, ‘Oh, look, they’re really talking about my car,’ caused…within 15 minutes of behavior, him trying to clean it and get rid of it,” Jared Barnhart told Fox News Digital. “Just not normal.”\n\nAt around 1:30 a.m. on Dec. 30, police swarmed his parents’ house and arrested him.\n\nPolice found a Ka-Bar sheath at the crime scene that had Kohberger’s DNA on it, which led them to his parents’ house in the Poconos with help from the FBI and state-of-the-art techniques called investigative genetic genealogy.\n\nBut detectives have maintained that even if they didn’t have the sheath, they would have found Kohberger by hunting down leads connected to the suspect vehicle, which appeared on surveillance cameras coming and going from the crime scene.\n\nLast month, after his lawyers failed to convince a judge to throw out key evidence and have the potential death penalty taken off of the table, Kohberger pleaded guilty to the murders of Madison Mogen, 21, Kaylee Goncalves, 21, Xana Kernodle, 20, and Ethan Chapin, 20.\n\nAll but Kernodle are believed to have been asleep at the start of the 4 a.m. home invasion attack.\n\nHe received four consecutive sentences of life without parole, plus another 10 years.",
  "medium": "Article",
  "links": [
    "https://nypost.com/2025/06/27/us-news/bryan-kohberger-may-evade-death-penalty-over-leaked-evidence-on-tv/",
    "https://nypost.com/2025/08/03/us-news/bryan-kohberger-possibly-second-weapon-spared-dylan-mortensen-in-university-of-idaho-murders-prosecutor-bill-thompson/?rand=189",
    "http://foxnews.com",
    "https://www.foxnews.com/us/forensic-team-reveals-kohbergers-panicked-phone-activity-before-idaho-murders-arrest",
    "https://nypost.com/2025/08/22/us-news/body-cam-footage-shows-cops-finding-bryan-kohbergers-idaho-victims/",
    "https://nypost.com/2025/08/21/us-news/idoc-pledges-to-limit-access-to-inmate-records-after-releasing-byran-kohberger-prison-rape-threat/",
    "https://nypost.com/2025/08/24/us-news/my-small-town-beer-buddy-vented-about-his-creepy-teaching-assistant-all-semester-it-turned-out-to-be-killer-bryan-kohberger/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Bryan Kohberger",
      "weight": 0.08325196
    },
    {
      "name": "Kohberger",
      "weight": 0.08190014
    },
    {
      "name": "Idaho murders",
      "weight": 0.074886985
    },
    {
      "name": "Jared Barnhart",
      "weight": 0.071468316
    },
    {
      "name": "car",
      "weight": 0.057974715
    },
    {
      "name": "cars",
      "weight": 0.057974715
    },
    {
      "name": "forensic team",
      "weight": 0.057484742
    },
    {
      "name": "Bryan Kohberger’s panicked phone activity",
      "weight": 0.05602791
    },
    {
      "name": "phone data",
      "weight": 0.055254996
    },
    {
      "name": "Washington State University",
      "weight": 0.05452355
    }
  ],
  "topics": [
    {
      "name": "Crime"
    }
  ],
  "categories": [
    {
      "name": "General"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Local News",
      "score": 0.96533203125
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.958984375
    },
    {
      "name": "/Sensitive Subjects/Violence & Abuse",
      "score": 0.958984375
    },
    {
      "name": "/Sensitive Subjects/Death & Tragedy",
      "score": 0.94384765625
    },
    {
      "name": "/News/Other",
      "score": 0.90283203125
    },
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.8984375
    },
    {
      "name": "/Jobs & Education/Education/Colleges & Universities",
      "score": 0.339599609375
    }
  ],
  "sentiment": {
    "positive": 0.08945452,
    "negative": 0.55012006,
    "neutral": 0.36042538
  },
  "summary": "Bryan Kohberger's panicked phone activity after his car was identified as a suspect vehicle in the Idaho student murders was reviewed by a forensic team. The team noted that Kohberger had registered it to park near the crime scene and had been stopped driving near both campuses in the weeks leading up to the murders. He also had a list of Hyundai Elantras for the university and was shopping online for another car. Kohberger was arrested on Dec. 30 after a police search found a Ka-Bar sheath at the scene that had Kohberger’s DNA on it, leading them to his parents' house in the Poconos. He pleaded guilty to four consecutive sentences of life without parole, plus another 10 years.",
  "shortSummary": "Bryan Kohberger panicked after seeing a Hyundai Elantra as a suspect vehicle in the Idaho murders, leading to his arrest and lengthy prison term.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "454b66963d12487f9975d14a787a7ae4",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://nypost.com/2025/08/22/us-news/body-cam-footage-shows-cops-finding-bryan-kohbergers-idaho-victims/",
      "text": "Chilling bodycam footage shows survivor describe screams heard the night Bryan Kohberger murdered four Idaho students\nNewly released police bodycam footage captured the chilling moment a survivor recounted the moments Bryan Kohberger slaughtered four University of Idaho students and the horrifying scream he heard.\nMoscow police officers arrived at the murder scene just after noon Nov. 13, 2022, according to bodycam footage, obtained by Law & Crime.\nThe first officers rushed inside past several college-age people to discover the bloody scene on the second floor of the three-story house in Moscow, Idaho.\n“Slow down, just come here. There’s two, looks like fatalities,” the first officer told another cop.\nDuring the house sweep that lasted several minutes, officers discovered the bodies of students Kaylee Goncalves, Maddie Mogen, Xana Kernoodle and Ethan Chapin, who were all brutally stabbed to death.\n“Oh, man,” one officer exclaimed over the gruesome discovery.\nOfficers spoke with surviving roommates Dylan Mortensen and Bethany Funke outside the home at the beginning of the investigation.\nMortensen, whose face was blurred in the video, recalled Goncalves screaming around 4 a.m. before running downstairs, and hearing a strange man’s voice talking to her.\n“I remember I was in my room and I was trying to go to bed and I heard Kaylee. All I heard was her go upstairs and I was like, ‘OK, I’m going to go to sleep now, ’cause she is going upstairs.’ And then all of a sudden I heard her walking up and I heard a scream and she ran upstairs ’cause she saw someone,” Mortensen told police.\n“That’s when I’m pretty sure she said ‘someone’s here’ and she screamed and ran downstairs and I called for her name and I jumped up and locked my door because I was so scared.”\n“I heard her in the bathroom and I heard her crying and I heard some guy say that ‘You’re going to be OK. I’m going to help you,'” Mortensen recalled. “I kept calling her name and she wasn’t answering.”\nMortensen recalled that the man’s voice, later revealed to be Kohberger’s, was not a calming tone.\n“I don’t know how to explain it. Like it wasn’t in a nice way. It was a weird way. Like a weird tone,” she said.\nThe University of Idaho student says she ran into the murderous intruder for a brief second when she went to look for Goncalves.\n“I opened the door and that’s when the guy looked at me, but he didn’t come towards me or say anything, which was really confusing to me. I don’t understand that. And I’m pretty sure he went out the side door,” Mortensen said.\nShe described him as “not insanely tall” but wearing an all-black outfit with a mask that covered his forehead and mouth.\n“He was a little bit taller than me. I couldn’t really see much of him, but I’m almost positive he was wearing a full black outfit. He had this mask that was just over his forehead and over his mouth and he didn’t say anything to me at all. I just shut the door and locked it ’cause I didn’t know what to do,” she said.\nMortensen says she called Funke just after 4 a.m. before running downstairs to her roommate’s room, where the two locked the door and talked before falling asleep, not knowing the ghastly horrors upstairs.\n“We didn’t think anything of it. We’re like ‘Nothing happens in Moscow,’ so we just tried to go to bed and then we woke up and it was weird because none of our roommates were up and we called all of them. They were not waking up.”\nThe two woke up around 9 or 10 a.m. and were confused because no one else was awake.\n“I didn’t know anything else, so I called (the other roommate) and I was like ‘I just need to come downstairs and find you’ ’cause I didn’t know where anyone else is. And I called Maddie, I called Xana, I called Kaylee and no one would answer.\nThe friends decided to call other people they knew to come over and check on their roommates, leading to the deadly discovery.\nThe officer pressed the devastated roommate for more information on the suspicious figure she saw in the middle of the night.\nSeveral of the roommates attended a formal the night of the stabbing before returning to the house, Mortensen told police, saying everything was normal.\n“Nothing weird at all. Nothing suspicious until 4 a.m.,” she said.\nFunke, who had been waiting on the side of the road with several friends, was asked to recall the events from the night before, saying she had been in bed at 2 a.m. before being awoken by a noise.\n“Am I still allowed to go home for Thanksgiving?” the heartbroken co-ed asked the officer before any questions were asked.\nThe officer reassured Funke that they would work with her to get the help they needed."
    },
    {
      "url": "https://nypost.com/2025/08/24/us-news/my-small-town-beer-buddy-vented-about-his-creepy-teaching-assistant-all-semester-it-turned-out-to-be-killer-bryan-kohberger/",
      "text": "My small-town beer buddy vented about his creepy teaching assistant all semester — it turned out to be Bryan Kohberger\nJohn Snyder is a kindly older man who lives in my small town. He’s what you’d consider a normal person — a married homeowner who teaches at the local university.\nHe’d been a public defender for almost 30 years when he took the opportunity to teach students about the legal system instead of defend them in it, feeling he was nearing burnout in a demanding profession.\nI’ve come to know John pretty well over the years, not just because we live in the same town — my wife, Alexis, is his favorite bartender, and he likes going out for dinner with his wife or having a beer after work as much as the next guy.\nBut there was a marked theme to John’s happy-hour conversation in fall 2022: His teaching assistant in Washington State University’s Criminal Justice and Criminology Department was “an a–hole” who was driving him crazy.\nNormal after-work grumbling, one might think, even if in a high quantity. Then bucolic life in our peaceful region was interrupted in November 2022 when four University of Idaho students were brutally murdered just 20 minutes away.\nAfter the new year, John came into the bar carrying a newspaper and looking bad enough that my wife said, “What’s wrong? You look like shit.”\nJohn held up the paper and confirmed what we suspected after the arrest: His teaching assistant was Bryan Kohberger.\nJohn Snyder has avoided the media since Kohberger’s arrest, but due to our friendship he agreed to meet me at the Palouse Caboose Bar & Grill, where my wife is a bartender, for some pitchers of beer and his first, and probably only, in-depth interview about supervising Bryan Kohberger.\nJohn graduated from the University of Idaho Law School in 1988 and began working as a public defender, his specialization throughout his legal career, saying, “Criminals are more honest and easier to work with than people going through a divorce.”\nHe was also attracted to the field by his sense of justice and desire to see people who may have disadvantages within society treated fairly by the legal system.\nAnd something of a troublemaker himself — his skill at pool paid his bar tabs all through law school — he could imagine being caught making some of the same mistakes as his clients.\nHe occasionally dealt with homicides or other serious crimes, but in a college town it’s mostly young people screwing up.\nJohn doesn’t feel this career has given him any greater ability to sense evil than the average person.\nAs a professor, John had a high volume of students and couldn’t get to know many of them well. Teaching assistants are different, and in normal circumstances one works with them extensively.\nIt used to be that professors chose preferred potential TAs from a list, but for reasons he never discovered, the school abandoned this system and randomized the process, which is how he was assigned Kohberger.\nWhen the graduate student came to introduce himself early in summer 2022, John didn’t think much of him: “He was a little odd, but a lot of people in academia are odd.”\nDespite the TA-assignment system being designed to prevent this exact problem, Kohberger had a scheduling conflict and thus limited attendance in class, though he also often didn’t show up when available.\nThe infrequency of his class appearances didn’t stop one female student from emailing a friend near the semester’s start, “My class’s TA looks like a murderer.”\nJohn says he tries to look at TAs’ individual attributes and put them to work where they will be the most useful while training them on their weaker points.\nIn this instance, however, “Bryan quickly disabused me of the idea that I would get a sufficient amount of work out of him, and I quickly figured out he was a bit of a douche. And within a few weeks I realized this was going to be an exceptionally long semester.”\nDespite Kohberger missing class, the prof saw him plenty.\nHere’s the latest coverage on Bryan Kohberger:\n- Bryan Kohberger’s classmates made 13 formal complaints about the killer for ‘being a d–k,’ making offensive comments: report\n- Bryan Kohberger’s creepy remark on night of Idaho murders revealed by surviving roommate\n- Eerie leaked videos of Bryan Kohberger with red hands inside cell being probed by Idaho prison\n- Bryan Kohberger’s phone records unveil similarities to Norman Bates: ‘Just super eerie’\n“He rapidly developed the habit of coming in at the end of the day, when I clearly wanted to go home,” he says. “He would start talking about inane, stupid and immature things. . . . I quickly realized this was a technique where he felt like he was in control as long as he was wasting my time.”\nKohberger once tried to tell John how he was going to get out of a parking ticket, even managing to get him to examine the “scene.” It turned out the TA had parked next to a yellow curb in a lot where he didn’t have a permit anyway.\nAdmonitions that in his experience as a defense attorney, people who believe they know the law better than the courts are always wrong fell on deaf ears.\nJohn says over time Kohberger “would follow me down the hall yapping, and I started calling it his ‘terrier routine.’”\nWhen John’s wife was waiting for him in the car once, she saw Kohberger following him and recoiled nearly to the other side, a reaction he’d never seen from her in many years of marriage.\nSnyder had grown to hate Kohberger over the course of the semester but never thought he was dangerous — he actually considered him a wimp.\nHe learned of Kohberger’s arrest along with everyone else. He was in his office Dec. 30 in a nearly empty building when the custodian told him the police had the basement sealed off.\nThey ended up walking to a picture board of department members, and the custodian started pointing at photos speculating whose office the police might be searching.\nWhen the custodian got to Kohberger, it hit him: His teaching assistant was the murderer.\nThen his phone rang; his brother-in-law told him Kohberger had been arrested. That call was interrupted by his son calling, which was interrupted by the Moscow, Idaho, police calling to set up an immediate interview; he drove to Moscow instead of waiting around for them to show up.\nFrom the police he learned Kohberger had a list of women’s names of unknown purpose — though surely not anything good — and one of them was a woman he knew from the department. But overall he wasn’t able to greatly help them besides describing Kohberger’s character.\nHaving worked with a mass murderer was a system shock for John, even if he always disliked the guy.\nThe university’s standard trauma-assistance programs proved unhelpful; the support “hotline” he called listed every imaginable identity group besides his own — old white men — and then said it could set an appointment in two weeks.\nBut he says the stream of graduate students and undergrads coming into his office to offer support “was one of the coolest things I’ve ever experienced.”\nThe department chair also transferred his own excellent teaching assistant to John for the next semester to ease his workload — and so there would be no more surprises.\nJohn says the reality of the crime isn’t what bothers him — it is instead someone studying criminology to become a better criminal instead of to pursue justice.\n“It was the assault on why I do what I do: promote justice and fairness, to find honor where there isn’t any, to teach people to be decent human beings, and to realize that life goes on, and to let people who had not experienced respect from the system know that the power to move past their troubles is inside them.”\nMost of the people he worked with throughout his career were in bad circumstances and needed help out of the abyss, while Kohberger chose to dive into it.\nThough this may be over for the public, for those affected it will never go away, and a feeling of safety is slow to return when you learn you have been in close contact with a monster.\nThis coming year is likely to be Snyder’s last spent teaching, not just because of Kohberger — he has been working to make a more just society since 1988 and is tired.\nLet’s hope some of the students he’s taught over the last 10 years can pick up the torch and none of them turns out to be the next Bryan Kohberger.\nAs for his former TA, it is John’s belief that being both extremely irritating and physically weak he won’t survive to the end of his natural life in prison.\nBrad Pearce writes The Wayward Rabbler on Substack."
    },
    {
      "url": "https://nypost.com/2025/08/21/us-news/idoc-pledges-to-limit-access-to-inmate-records-after-releasing-byran-kohberger-prison-rape-threat/",
      "text": "Release of Bryan Kohberger rape threat prompts Idaho prison officials to limit access to inmate records\nIdaho prison officials have vowed to limit access to inmate records after releasing a graphic sexual harassment complaint filed by Bryan Kohberger in which the convicted killer begged for a transfer after a fellow inmate threatened to “b—h f–k” him.\n“The Idaho Department of Correction (IDOC) recently made available public records associated with complaints filed by Bryan Kohberger in response to public records requests submitted by members of the news media and the public,” a department spokesperson told The Post.\n“IDOC seeks to clarify that additional scrutiny will be applied to future requests for public records concerning any individual in IDOC custody,” the spokesperson added.\n“The media and the public can expect that similar public records requests submitted in the future may be denied altogether or may produce records that will be redacted consistent with the Idaho Public Records Act in order to protect the safety and security of the prison population, staff, and our operations,” the IDOC continued.\nThe policy clarification from the IDOC comes as Kohberger, the convicted killer of four University of Idaho undergrads, barely made it one night in the Idaho Maximum Security Institution in Boise before requesting to be moved to another part of the hellhole prison on July 30 over constant harassment, according to documents obtained by People.\nThe request complained of “minute-by-minute verbal threats/harassment,” as well as prisoners flooding their own cells with toilet water and other mischief.\nLess than a week later, Kohberger gave a guard a handwritten note claiming a fellow inmate had threatened to rape him, People reported.\nAnother inmate allegedly said: “The only a– we’ll be eating is Kohberger’s.”\nThe IDOC has previously issued a statement downplaying claims that fellow inmates have been tormenting and taunting the convicted killer by yelling through vents.\nThe department also noted that it will “comply with all applicable laws” when responding to inmate records requests from the media.\n“We will continue to balance confidentiality, public safety, security, and habilitation with the public’s interest in disclosure,” the IDOC spokesperson said.\n“We also take reports of threats and harassment seriously. Each matter is investigated thoroughly, and when appropriate, we take disciplinary action in accordance with our policies and the law,” they added.\nKohberger in the prison’s notorious J Block, which houses a mix of general population and death row inmates.\nLong-term prisoners are kept in their own cells, moved in restraints, allowed only one hour of outdoor time each day, and allowed a shower only once every second day.\nThe treatment makes Kohberger’s pre-trial housing in county jails — in which he took hourlong showers and constantly requested clean clothes and bedding — look downright ritzy.\nYet even a lifetime in Block J isn’t bad enough for some family members of Kohberger’s victims, who had pushed for the death penalty.\nKohberger dodged the firing squad as part of a “guilty” plea deal for the brutal slayings of undergrads Kaylee Goncalves, Madison Mogen, Xana Kernodle, and Ethan Chapin in their off-campus house in Moscow, Idaho."
    },
    {
      "url": "https://nypost.com/2025/06/27/us-news/bryan-kohberger-may-evade-death-penalty-over-leaked-evidence-on-tv/",
      "text": "Bryan Kohberger could evade the death penalty over evidence leaked on ‘Dateline’\nIdaho quadruple murder suspect Bryan Kohberger might avoid the death penalty if convicted because of leaked evidence, a former prosecutor suggested.\nKohberger is accused of killing Madison Mogen, 21, Ethan Chapin, 20, Kaylee Goncalves, 21, and Xana Kernodle, 20.\nOn May 9, a television episode featured leaked information relating to the case, which Kohberger’s attorney has argued will taint the jury pool.\nIncluded in NBC’s “Dateline” special on the University of Idaho murders was surveillance video from a neighboring house, which caught a car similar to Kohberger’s driving in the King Road area several times in the hours and minutes before the four college students were killed.\nThe episode also featured alleged evidence from a nearby FBI cellphone tower, which claimed to show that Kohberger’s phone pinged nearly a dozen times near a tower providing coverage to an area within 100 feet of 1122 King Road, where the students were killed.\nThe phone allegedly pinged near the tower on multiple occasions between July 2022 and mid-August 2022.\nFormer Assistant U.S. Attorney Neama Rahmani told Fox News Digital that the leak has the potential to remove the death penalty as a punishment.\n“The media leak could help Bryan Kohberger on appeal or potentially take the death penalty off the table. If the leak results in prejudicial pretrial publicity that taints the jury pool, especially if the leak was of inadmissible evidence, that’s a constitutional violation,” Rahmani said.\nRahmani brought up the Lori Vallow Daybell case, where the judge ruled that prosecutors couldn’t seek the death penalty after they didn’t comply with discovery rules.\nVallow Daybell was found guilty after prosecutors alleged that she worked with Alex Cox, her brother, to murder her fourth husband, Charles Vallow, to receive money from a $1 million life insurance policy.\n“The other basis for appeal or to strike the death penalty would be prosecutorial misconduct or a violation of a judicial order.\nIn a recent high-profile Idaho capital case, Lori Vallow Daybell, the court ruled that prosecutors could no longer seek the death penalty because they failed to comply with their discovery obligations,” Rahmani said.\nHere’s the latest coverage on Bryan Kohberger:\n- Bryan Kohberger’s classmates made 13 formal complaints about the killer for ‘being a d–k,’ making offensive comments: report\n- Bryan Kohberger’s creepy remark on night of Idaho murders revealed by surviving roommate\n- Eerie leaked videos of Bryan Kohberger with red hands inside cell being probed by Idaho prison\n- Bryan Kohberger’s phone records unveil similarities to Norman Bates: ‘Just super eerie’\nOn May 15, Judge Steven Hippler said a violation of the gag order was “likely” committed by someone involved in the case.\nHe ordered the prosecution and Kohberger’s defense team to preserve all communications and data relating to the case, including law enforcement officers who worked on the case.\nHippler said the following pieces of evidence were revealed during the episode:\n- Surveillance footage of “Suspect Vehicle One”\n- AT&T records for Kohberger\n- Content of Kohberger’s cellphone\n- Photographs and information associated with Kohberger’s Amazon account.\n“Such violations not only undermine the rule of law, potentially by persons charged with upholding it, but also significantly impede the ability to seat an impartial jury and will likely substantially increase the cost to be borne by the taxpayers of Latah County to prosecute this case by extending the time it will take to seat a jury and potentially requiring lengthy period of juror sequestration,” Hippler wrote.\nKohberger’s lawyer, Anne Taylor, asked Hippler to delay the trial because the jury pool could be tainted by information aired during the “Dateline” episode, in addition to other reasons.\nProsecutors argued in a court filing that the airing of information relating to the case should not be a reason to delay August’s trial start date.\n“Like the court in the Vallow-Daybell trial, this Court is well-equipped to select a jury, to handle ongoing media coverage, and to conduct a fair trial in the Ada County courthouse,” prosecutors wrote.\nTimeline of Nov. 13, 2022:\n- 4 a.m.: Suspect arrives at house\n- Between 4 and 4:17: Time of murders\n- 4:19: Roommate calls three victims; no one answers\n- 4:22 to 4:24: Surviving roommates text each other from inside house\n- 4:27: Roommate calls victims again; no one answers\n- 4:32: Roommate texts Goncalves, “Pls answer”\n- 10:23: Surviving roommate texts victims; no one answers\n- 11:39: Roommate calls her father\n- 12 p.m.: 911 call placed from roommate’s phone.\nAn amended scheduling order filed in Idaho’s Fourth Judicial District Court on Thursday indicated that the trial will be pushed back one week.\nJury selection will begin on Aug. 4, but opening statements are now expected on Aug. 18, one week later than the previously anticipated start date on Aug. 11.\nA court spokesperson said the updated timeline was not the result of any attempt by the defense to delay the proceedings, but rather an internal scheduling adjustment by the court.\nFox News Digital reached out to Kohberger’s lawyer, prosecutors and NBC for comment."
    },
    {
      "url": "https://nypost.com/2025/08/03/us-news/bryan-kohberger-possibly-second-weapon-spared-dylan-mortensen-in-university-of-idaho-murders-prosecutor-bill-thompson/?rand=189",
      "text": "Bryan Kohberger may have used second weapon and left ‘scared’ while sparing surviving roommate: report\nIdaho prosecutor Bill Thompson said investigators can’t rule out the possibility that Bryan Kohberger used a second weapon during the murders of four University of Idaho students and believes the killer spared surviving roommate Dylan Mortensen because he panicked and fled, according to an interview with the Idaho Statesman.\nThompson explained that some injuries observed on victim Kaylee Goncalves, 21, appeared to have been caused by something other than the knife used in the attack, though he stopped short of confirming a second weapon.\n“There were injuries that appeared to have been caused by something other than the knife, although it could have been the knife,” Thompson told the Statesman. “I don’t think we can exclude the possibility that there was an additional weapon involved.”\nCourt documents revealed the extent of the November 2022 attack on Goncalves, Madison Mogen, Xana Kernodle and Ethan Chapin.\nGoncalves, authorities revealed in recently released Moscow Police Department documents, endured “more than 20 stab wounds,” alongside blunt-force trauma.\nRegarding why Mortensen, a surviving roommate, was left unharmed despite encountering Kohberger as he fled the scene through the rental property’s sliding door, Thompson said it appeared Kohberger panicked.\n“From what Dylan described, I have a hard time imagining that the killer did not see Dylan,” Thompson said. “At that point, he’d been in the house probably longer than he planned, and he had killed more people than he planned. It wouldn’t surprise us that the killer was scared at that point and decided they had to leave, not knowing if law enforcement already had been called.”\nMortensen shared with authorities that she had noticed an intruder with “bushy eyebrows” on the night of the attack on 1122 King Road in Moscow, who had told her that he was “here to help.”\nJames Fry, who was chief of the Moscow Police Department at the time, told ABC News that there are many theories as to why Mortensen survived, including that Kohberger may have been exhausted from the quadruple murders.\n“I don’t know, only he has that answer,” Fry told the outlet.\nThompson also emphasized the critical role DNA evidence played in solving the case.\n“From our perspective as prosecutors, the DNA was critical to the strength of the case for trial purposes,” he said.\nWithout the DNA linking Kohberger to the knife sheath, securing a conviction might have been “insurmountable,” Thompson told the Statesman.\nFox News Digital has reached out to the Latah County Prosecutor’s Office for comment."
    },
    {
      "url": "https://www.foxnews.com/us/forensic-team-reveals-kohbergers-panicked-phone-activity-before-idaho-murders-arrest",
      "text": "Bryan Kohberger saw a news article about a white Hyundai Elantra having been identified as a suspect vehicle in the Idaho student murders and immediately panicked, according to the forensic team that analyzed his phone.\n\"I think the vehicle was a huge stress point for him, because he had registered it to park there,\" said Jared Barnhart, who along with his wife Heather works at the digital forensics firm Cellebrite. \"He had a PDF download of like a list of Hyundai Elantras for the university, you know, and you can see this long list of cars.\"\nKohberger was attending Washington State University, just 10 miles from the crime scene adjacent to the University of Idaho, and had been pulled over driving near both campuses in the weeks before the murders.\nThe car was still on his mind in the hours before his arrest, according to the Barnharts.\n\"If you weren't the bad guy, you wouldn't care, but he was scrambling, and he thought the police were on him,\" Jared Barnhart told Fox News Digital. \"And they were. They were at that point.\"\nAccording to phone data reviewed by the Barnharts, Kohberger did the following during the late-night hours of Dec. 29, 2022:\nBRYAN KOHBERGER CALLED HIS MOM WHILE RETURNING TO IDAHO MURDER SCENE THE NEXT DAY, EXPERT REVEALS\n- Kohberger searched for the phrases \"wiretap\" and \"psychopaths paranoid\"\n- He read an article about how police were still searching for the suspect vehicle\n- He visited the Moscow Police Department website and checked the latest press release on the case\n- He \"immediately\" looked up an auto detailing shop\n- Within 10 minutes, he was shopping online for another car\nBRYAN KOHBERGER PLEADED GUILTY TO IDAHO STUDENT MURDERS, BUT THESE KEY QUESTIONS REMAIN UNANSWERED\n\"Literally the pressure of, 'Oh, look, they're really talking about my car,' caused...within 15 minutes of behavior, him trying to clean it and get rid of it,\" Jared Barnhart told Fox News Digital. \"Just not normal.\"\nAt around 1:30 a.m. on Dec. 30, police swarmed his parents' house and arrested him.\nPolice found a Ka-Bar sheath at the crime scene that had Kohberger's DNA on it, which led them to his parents' house in the Poconos with help from the FBI and state-of-the-art techniques called investigative genetic genealogy.\nBut detectives have maintained that even if they didn't have the sheath, they would have found Kohberger by hunting down leads connected to the suspect vehicle, which appeared on surveillance cameras coming and going from the crime scene.\nCLICK HERE TO GET THE FOX NEWS APP\nLast month, after his lawyers failed to convince a judge to throw out key evidence and have the potential death penalty taken off of the table, Kohberger pleaded guilty to the murders of Madison Mogen, 21, Kaylee Goncalves, 21, Xana Kernodle, 20, and Ethan Chapin, 20.\nAll but Kernodle are believed to have been asleep at the start of the 4 a.m. home invasion attack.\nHe received four consecutive sentences of life without parole, plus another 10 years."
    }
  ],
  "argos_summary": "Bryan Kohberger, a Washington State University graduate student, was arrested for the 2022 quadruple murder of University of Idaho students after forensic analysis of his phone revealed frantic searches for a suspect vehicle, a white Hyundai Elantra, and attempts to clean and replace it. DNA from a knife sheath at the crime scene linked him to the murders, leading to his guilty plea and four consecutive life sentences without parole, plus an additional ten years. Body‑camera footage and survivor testimony detail the brutal 4 a.m. home‑invasion attack, while investigations have explored possible second weapons and the impact of leaked evidence on potential death‑penalty proceedings. In prison, Kohberger has faced harassment, filed transfer requests, and prompted Idaho correctional officials to tighten access to inmate records following a graphic harassment complaint.}",
  "argos_id": "4T00TIVMP"
}