{
  "url": "https://www.foxnews.com/travel/archaeologists-uncover-ancient-baptistery-france-tied-christian-rituals",
  "authorsByline": "Andrea Margolis",
  "articleId": "2dc21227c1b64e5cb9ddf3d47212ad6e",
  "source": {
    "domain": "foxnews.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://static.foxnews.com/foxnews.com/content/uploads/2025/08/france-vence-ancient-christian-baptistery-archaeology-1.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-24T09:00:54-04:00",
  "addDate": "2025-08-24T13:11:26.300229+00:00",
  "refreshDate": "2025-08-24T13:11:26.300232+00:00",
  "score": 1.0,
  "title": "Archaeologists uncover ancient baptistery in France tied to early Christian rituals",
  "description": "Archaeologists recently uncovered a 1,500-year-old baptistery in Vence, France, revealing insights into early Christian rituals and religious practices from the fifth century.",
  "content": "An ancient baptistery was recently unearthed in France – and archaeologists say the discovery sheds light on Christian rituals from over 1,500 years ago.\n\nThe baptistery, dating back to the fifth and sixth centuries A.D., was found next to an ancient cathedral in Vence, a commune less than 10 miles west of Nice. While the cathedral was discovered earlier this year, the baptistery was only uncovered this summer.\n\nFabien Blanc Garidel, the supervising archaeologist on the project, confirmed the discovery to Fox News Digital.\n\nITALIAN ARCHAEOLOGISTS UNVEIL RARE 2,600-YEAR-OLD TOMB UNTOUCHED BY LOOTERS: 'DOORWAY TO OUR ANCESTORS'\n\nIn an email translated from French to English, the historian described the baptistery as a \"circular building, likely surrounded by a colonnade and covered.\"\n\nBlanc Garidel noted that \"at the center, the baptismal font is octagonal on the outside and cross-shaped on the inside. It is bordered by a decorative coating made of béton de tuileau, a Roman concrete using crushed tile.\"\n\nBlanc Garidel estimated the baptistery to be 1,500 to 1,600 years old.\n\nIt is located in front of the forecourt of the cathedral, which was a common layout at the time.\n\nThe foundation of the baptistery, Blanc Garidel said, is the only relic that remains – but the font, or the baptism receptacle, is \"in very good condition.\"\n\nHe said the recent excavation helps show how early the diocese of Vence was established.\n\n\"This discovery confirms the antiquity of the bishopric of Vence and enhances our knowledge of early Christian religious practices in the Alpes-Maritimes and Provence,\" he said.\n\n\"However, much work and analysis remain to be done in the coming months to provide further details.\"\n\nSeveral burials were uncovered in the cathedral's nave, he also said.\n\nThe tombs were built using pitched Roman roof tiles, a method typical of the time.\n\nCLICK HERE TO SIGN UP FOR OUR LIFESTYLE NEWSLETTER\n\n\"All of these burials are likely those of religious figures (bishops or canons) from the Carolingian period,\" he said.\n\n\"Radiocarbon dating will help clarify the timeline.\"\n\nOverall, the archaeologist said, the excavation sheds light on over six centuries of construction – and even revealed a Roman dwelling under the cathedral.\n\n\"One of the most significant aspects of this discovery is that the preserved archaeological structures offer insight into the history of this monument over six centuries (5th–11th centuries),\" he said.\n\n\"The cathedral was demolished in the 11th century to build a new one right next to it.\"\n\n\"After it was abandoned, two bell molds were installed in the nave of the old cathedral – likely to cast bells for the new one.\"\n\nThe discovery is among several recent finds offering new insight into early Christianity in Europe.\n\nLast year, historians unveiled a silver inscription representing the earliest-known north of the Alps.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nMore recently, an ancient Christian warning was unearthed at the site of a fifth-century church in Turkey this summer.",
  "medium": "Article",
  "links": [
    "https://www.foxnews.com/video/6373478631112",
    "https://www.foxnews.com/category/travel/regions/europe",
    "https://www.foxnews.com/travel/italian-archaeologists-unveil-rare-2600-year-old-tomb-untouched-looters-doorway-our-ancestors",
    "https://www.foxnews.com/newsletters?cmpid=fnfirstnl",
    "https://www.foxnews.com/lifestyle/archaeologists-uncover-earliest-known-evidence-christianity-north-alps-unusual-time",
    "https://www.foxnews.com/apps-products?pid=AppArticleLink",
    "https://www.foxnews.com/travel/ancient-christian-church-reveals-mysterious-1500-year-old-warning-against-nonbelievers-righteous",
    "https://www.foxnews.com/category/science/archaeology",
    "https://www.foxnews.com/travel/archaeologist-unearths-mysterious-christian-settlement-hidden-centuries",
    "https://www.foxnews.com/category/christianity",
    "https://www.foxnews.com/lifestyle"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "ancient baptistery",
      "weight": 0.0825847
    },
    {
      "name": "early Christian religious practices",
      "weight": 0.07677736
    },
    {
      "name": "early Christian rituals",
      "weight": 0.07279693
    },
    {
      "name": "5th–11th centuries",
      "weight": 0.071021765
    },
    {
      "name": "Blanc Garidel",
      "weight": 0.069525614
    },
    {
      "name": "pitched Roman roof tiles",
      "weight": 0.06937555
    },
    {
      "name": "Fabien Blanc Garidel",
      "weight": 0.067629464
    },
    {
      "name": "new insight",
      "weight": 0.06337921
    },
    {
      "name": "Christian rituals",
      "weight": 0.06295936
    },
    {
      "name": "ITALIAN ARCHAEOLOGISTS",
      "weight": 0.06259463
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Science"
    },
    {
      "name": "Travel"
    }
  ],
  "taxonomies": [
    {
      "name": "/People & Society/Religion & Belief",
      "score": 0.8603515625
    },
    {
      "name": "/Reference/Humanities/History",
      "score": 0.84326171875
    },
    {
      "name": "/Travel & Transportation/Tourist Destinations/Historical Sites & Buildings",
      "score": 0.60009765625
    }
  ],
  "sentiment": {
    "positive": 0.29604548,
    "negative": 0.16814712,
    "neutral": 0.5358074
  },
  "summary": "An ancient baptistery in France has been discovered, dating back to the fifth and sixth centuries A.D., next to an ancient cathedral in Vence. The discovery sheds light on early Christian rituals over 1,500 years ago. While the cathedral was discovered earlier this year, the baptisterry was only uncovered this summer. Fabien Blanc Garidel, the supervising archaeologist on the project, confirmed the discovery and said it helps establish the early diocese of Vence and enhances our knowledge of early Christian religious practices in the Alpes-Maritimes and Provence. Several burials were uncovered in the cathedral's nave, likely those of religious figures from the Carolingian period.",
  "shortSummary": "Archaeologists discovered an ancient baptistery in France's Vence, dating back to the fifth and sixth centuries, shedding new light on early Christian rituals and early Roman burial practices.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "f129197956324374aa9c68390165f7a5",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.foxnews.com/newsletters?cmpid=fnfirstnl",
      "text": "Newsletters and Alerts\nSign up for our free email newsletters and alerts\n-\nBreaking News Alerts\nFast, 24/7 alerts to keep you in the know on the most important moments around the world.\nArrives 24/7By entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox Business Breaking News Alerts\nFast, 24/7 alerts to keep you in the know on the most important business moments around the world.\nArrives 24/7By entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox News First\nGet all the stories you need-to-know from the most powerful name in news delivered first thing every morning to your inbox.\nArrives WeekdaysBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nAntisemitism Exposed\nFox News' Antisemitism Exposed\" newsletter brings you stories on the rising anti-Jewish prejudice across the U.S. and the world.\"\nArrives WeeklyBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox News Politics\nGet the latest updates on the Trump administration and Congress, exclusive interviews and more Fox News politics content.\nArrives WeekdaysBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox Business Rundown\nGet a brief on the top business stories of the week, plus CEO interviews, market updates, tech and money news that matters to you.\nArrives WeeklyBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox News Entertainment\nGet a daily look at the top news in music, movies, television and more in the entertainment industry.\nArrives WeekdaysBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox True Crime\nThe hottest stories ripped from the headlines, from crime to courts, legal and scandal.\nArrives WeeklyBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nBest of Opinion\nGet the recap of top opinion commentary and original content throughout the week.\nArrives Twice a weekBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox News Lifestyle\nA look at the top-trending stories in food, relationships, great outdoors and more.\nArrives Twice a weekBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox News Health\nStay up-to-date on the biggest health and wellness news with our weekly recap.\nArrives WeeklyBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox News Sports Huddle\nReceive your weekly recap of all the happenings around the world of sports.\nArrives WeeklyBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox News Artificial Intelligence\nStay up-to-date on the latest AI technology advancements and learn about the challenges and opportunities AI presents now and for the future.\nArrives WeeklyBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox News Autos\nGet revved up with the week's hottest stories from the new and classic car worlds.\nArrives WeeklyBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nLearn More About Fox Nation\nFox Nation is an entertaining streaming service featuring your favorite Fox News personalities, with original shows and documentaries that Celebrate America.\nArrives WeeklyBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\nUnsubscription Successful\nYou have successfully unsubscribed from the newsletter. To re-subscribe or to subscribe to any of our other newsletters, please close this prompt and follow the directions on the page."
    },
    {
      "url": "https://www.foxnews.com/lifestyle/archaeologists-uncover-earliest-known-evidence-christianity-north-alps-unusual-time",
      "text": "The earliest known evidence of Christianity north of Italy was recently unveiled by archaeologists, who call the discovery one of the \"most important testimonies of early Christianity.\"\nThe artifact, publicized by the Frankfurt Archaeological Museum last week, is called the Frankfurt silver inscription. Discovered in 2018, the inscription has been analyzed and studied for years before finally being released to the public this month.\nThe Frankfurt silver inscription is an engraving on silver foil that consists of 18 lines written in Latin. It dates to between 230 and 260 A.D. and was discovered wrapped in a small silver amulet.\nIn a press release translated from German, the museum explained that the artifact was found in a third-century grave in Hesse, Germany, in what was once the former Roman city of Nida. The inscription begins, \"In the name of Saint Titus, Holy, holy, holy! In the name of Jesus Christ, God's Son!\"\nARTIFACT WITH STRANGE INSCRIPTION DUG UP AT HOLY SITE IN JERUSALEM: 'UNUSUAL LOCATION'\nSaint Titus was a first-century Christian missionary and disciple of Paul the Apostle. The inscription also calls for the amulet to protect \"the man who gives to the will the Lord Jesus Christ, God's Son.\"\n\"The heavenly, the earthly and the underground, and every tongue confess (to Jesus Christ),\" the text concludes.\nWritten in Latin, the inscription took several weeks to decipher due to its deteriorated condition. Archaeologists needed to \"digitally unroll\" the silver foil, which had been crumpled for around 1,800 years.\nUsing computed tomography and state-of-the-art technological equipment, the text was finally decrypted in May. It was then translated over an extended period of time.\nARCHAEOLOGISTS UNCOVER ONE OF THE WORLD'S OLDEST CHRISTIAN CHURCHES\n\"Sometimes it took weeks, even months, for me to have the next idea,\" Goethe University professor Markus Scholz said of the translation process. \"I brought in experts from the history of theology, among other things, and piece by piece we have approached the text together and ultimately deciphered it.\"\nScholz added that the inscription was \"very sophisticated\" and called its author \"an elaborate writer.\"\n\"It is unusual that the inscription is completely in Latin,\" Scholz said. \"This is unusual for this time. Such inscriptions were usually written in amulets in Greek or Hebrew.\"\nNot only is the inscription not written in Hebrew, it doesn't reference Judaism at all, nor does it contain any pagan elements, which makes it even more unique.\nCLICK HERE TO SIGN UP FOR OUR LIFESTYLE NEWSLETTER\n\"It is unusual that there is no reference in the inscription to any other belief besides Christianity,\" the museum's press release added. \"Usually until the fifth century, a mixture of different faiths can always be expected with precious metal amulets of this kind. Often there are still elements from Judaism or pagan influences.\"\n\"But in this amulet neither Yahweh, the almighty God of Judaism, nor the archangels Raphael, Gabriel, Michael or Suriel are mentioned, no forefathers of Israel like Isaac or Jacob. And also no pagan elements like demons. The amulet is purely Christian.\"\nThe press release called the artifact \"one of the most important testimonies of early Christianity worldwide.\"\nFor more Lifestyle articles, visit foxnews.com/lifestyle.\n\"So far, there has been no such early, authentic proof of pure Christianity north of the Alps,\" the statement explained. \"All [other] finds are at least around 50 years younger.\"\n\"There are references from historiography to the first Christian groups in Gaul and perhaps also in the province of Upper Germania in the late second century,\" the statement added. \"However, certain evidence of Christian life in the northern Alpine regions of the Roman Empire generally only comes from the fourth century AD.\"\nCLICK HERE TO GET THE FOX NEWS APP\n\"These 18 lines, experts agree, will enormously enrich previous research on the spread of Christianity and the late period of Roman rule on the right of the Rhine.\""
    },
    {
      "url": "https://www.foxnews.com/category/science/archaeology",
      "text": "Travel 1 hour ago Archaeologists uncover ancient baptistery in France tied to early Christian rituals Archaeologists recently uncovered a 1,500-year-old baptistery in Vence, France, revealing insights into early Christian rituals and religious practices from the fifth century.\nArchaeology 1 day ago Rare ancient gold discovery made by Florida student at archaeological site An archaeology student from Florida discovered a ninth-century golden artifact during her first excavation in Redesdale, Northumberland, near an ancient Roman road.\nAncient Egypt 1 day ago Ancient artifacts of sunken city likely destroyed by earthquake or tsunami plucked from seafloor Ancient 2,000-year-old artifacts were recovered from the Mediterranean Sea near Alexandria, Egypt, possibly from the sunken city of Canopus.\nOpinion 3 days ago MORNING GLORY: Churchill then and now Winston Churchill's \"The Gathering Storm\" offers crucial insights for today's world as political tensions rise and global conflicts threaten international stability.\nTravel 4 days ago Luxurious 1,700-year-old Roman bathhouse unearthed by archaeologists after surprise discovery Archaeologists recently uncovered a remarkably preserved 1,700-year-old Roman bathhouse in Turkey, featuring underfloor heating and distinct temperature zones.\nArchaeology 5 days ago Ancient Roman mosaic in Sicily reveals 'extraordinary' find resembling modern footwear Archaeologists in Sicily uncovered a Roman mosaic of flip-flop sandals, a rare find at the UNESCO-listed Villa Romana del Casale. The villa is famous for its collection of Roman mosaics.\nAncient Egypt 6 days ago Oldest written reference to Moses may be revealed in ancient Egyptian desert inscriptions, researcher says American-Israeli epigraphist interprets ancient inscriptions at Serabit el-Khadim that could be the oldest written mention of Moses, predating the Bible by centuries.\nGermany August 15 German researchers discover dozens of shipwrecks including possible WWII steamer lost in air raid German researchers have found 31 shipwrecks in Lake Constance, with one nearly completely preserved cargo sailing ship with its mast and yard still in place.\nArchaeology August 15 Divers reveal images of 321-year-old shipwreck in remarkable condition off coast The 1703 \"Northumberland\" shipwreck off Kent's coast has been documented in stunning detail, revealing preserved wooden structures and artifacts threatened by shifting sands.\nVIDEO August 15 1703 shipwreck off Kent coast documented in extraordinary detail by divers The 1703 Northumberland shipwreck off Kent's coast was recently documented in stunning detail, revealing preserved wooden structures and artifacts threatened by shifting sands.\nWhite House August 14 American history won't be displayed 'in a woke manner' at Smithsonian, Trump says The White House sent a letter to the Smithsonian Tuesday unveiling plans to conduct a review of museums and exhibits in preparation for the 250th birthday of the United States in 2026.\nOpinion August 14 DAVID MARCUS: Trump takes on Smithsonian’s lefty bias and statue-toppling libs melt down Democrats who cheered statue toppling in 2020 now oppose Trump's transparent process to curate Smithsonian museums and address leftist historical bias\nArchaeology August 14 2,000-year-old Jewish rebel coin, minted decades after Jesus, unearthed in Jerusalem Archaeologists recently uncovered a bronze coin inscribed 'For the Redemption of Zion' near Jerusalem's Temple Mount, created by Jewish rebels in the fourth year of their revolt against Rome.\nMedia August 13 CNN's Jennings says same critics of Trump's Smithsonian review were cheering destruction of monuments in 2020 CNN's Scott Jennings argued many critics of Trump's Smithsonian review are hypocritical for previously cheering monument destruction during 2020 protests.\nFood-Drink August 12 Researchers discover 2,500-year-old honey residue in ancient bronze jars Experts identified a preserved honey residue in sealed bronze jars from an ancient Greek settlement. Researcher Luciana Carvalho spoke to Fox News Digital about the 2,500-year-old substance.\nTravel August 12 Archaeologists uncover ancient blade factory tied to major group in the Bible: 'Exceptional individuals' Israeli archaeologists recently discovered the first Bronze Age blade factory found in southern Israel, showing evidence of complex Canaanite society 5,500 years ago.\nTravel August 11 Ancient rare Chinese manuscripts stolen in alleged scheme by man using multiple aliases The FBI is investigating the theft of valuable Chinese manuscripts from the UCLA library system after a man allegedly replaced originals with fake copies using multiple aliases.\nArchaeology August 11 Utility crews unearth two 1,000-year-old tombs beneath city street in single day: 'Feels so exciting' Utility workers in Lima, Peru, uncovered two pre-Incan tombs during gas line construction, including one holding a 1,000-year-old Chancay skeleton buried with clay vessels.\nBoston August 10 Founding Father’s historic property in Boston tourist district hits market with one intriguing secret A historic Revolutionary War-era home once owned by John Hancock is up for sale in downtown Boston's Blackstone Block, the last surviving property tied to the Founding Father in the city.\nArchaeology August 10 Rare biblical seal with ancient fingerprint found in debris from Jerusalem's Temple Mount The Temple Mount Sifting Project recently uncovered a well-preserved biblical-era clay sealing with ancient Hebrew letters and clear fingerprint from a King Josiah-era official.\nSpirits August 7 Rye grain from 1878 shipwreck opens door to rare whiskey revival efforts A Michigan distillery and university scientists are working to revive a long-lost variety of rye grain recovered from a 19th-century shipwreck in Lake Huron.\nTravel August 7 Angler expecting a fish pulls up rare 700-year-old sword: ‘Real treasures’ A fisherman in Poland reeled in a rare 700-year-old medieval sword from the Vistula River. An expert told Fox News Digital that it dates back to when Warsaw was founded.\nTravel August 6 New bridge will link popular island to mainland as critics warn of mafia, earthquakes The world's longest suspension bridge has been approved for a Sicily-Italy connection; construction may start in 2026. It's designed to carry 6,000 cars hourly as critics cite concerns.\nOpinion August 5 SEN TIM SCOTT: The secret behind Apollo 8's broadcast is a favorite story of Christian courage The historic Apollo 8 mission featured astronauts reading from the Book of Genesis during a Christmas Eve broadcast that reached millions of viewers worldwide\nTravel August 3 Ancient Christian church reveals mysterious 1,600-year-old warning to nonbelievers: 'Only the righteous' Archaeologists in Turkey recently uncovered an inscription near the entrance of a fifth-century Christian church in ancient Olympus. It has a message not seen in over 1,000 years.\nTravel August 1 Researchers accidentally discover Civil War-era shipwreck while exploring murky Midwest river Wisconsin archaeologists accidentally discovered a Civil War-era shipwreck believed to be the L.W. Crane. The vessel was built in 1865 and sank in 1880 after catching fire.\nOpinion July 31 Liberty and unity: What America’s 250th anniversary asks of us today Virginia's pivotal role in American independence from Patrick Henry to Thomas Jefferson highlighted as the nation prepares for its 250th anniversary in 2026.\nArchaeology July 31 Ancient Roman soldier's monthly paycheck unearthed in pristine condition in countryside British officials recently unveiled 25 silver denarii found by a metal detectorist in Great Ellingham. An expert told Fox News Digital about the hoard, which dates back as early as the 160s.\nTravel July 30 Schoolboy spots American Revolution warship on beach after storm uncovers 230-year-old wreck Wooden remains of the Earl of Chatham, a British warship from 1749 that was used during the American Revolution, were discovered by a schoolboy on one of Scotland's Orkney Islands.\nMedia Buzz July 29 Ed Sullivan, an unsung civil rights champion Ed Sullivan is a small-screen legend, but there's one oft-overlooked part of his legacy: his contributions to civil rights. \"Sunday Best,\" a new Netflix documentary, highlights them."
    },
    {
      "url": "https://www.foxnews.com/category/travel/regions/europe",
      "text": "Travel 44 mins ago Archaeologists uncover ancient baptistery in France tied to early Christian rituals Archaeologists recently uncovered a 1,500-year-old baptistery in Vence, France, revealing insights into early Christian rituals and religious practices from the fifth century.\nArchaeology 1 day ago Rare ancient gold discovery made by Florida student at archaeological site An archaeology student from Florida discovered a ninth-century golden artifact during her first excavation in Redesdale, Northumberland, near an ancient Roman road.\nArchaeology 5 days ago Ancient Roman mosaic in Sicily reveals 'extraordinary' find resembling modern footwear Archaeologists in Sicily uncovered a Roman mosaic of flip-flop sandals, a rare find at the UNESCO-listed Villa Romana del Casale. The villa is famous for its collection of Roman mosaics.\nTravel August 17 Queen Elizabeth's personal wardrobe choices to debut in major palace exhibition Queen Elizabeth II's wardrobe will take center stage in a comprehensive Buckingham Palace exhibition featuring over 200 items spanning her life from childhood to monarchy.\nTravel August 16 Would you donate pets for zoo to feed to its predators? Some say 'yes' Aalborg Zoo defends feeding donated pets to predators as natural behavior while critics call the practice \"disgusting\" and \"completely unacceptable\"\nArchaeology August 15 Divers reveal images of 321-year-old shipwreck in remarkable condition off coast The 1703 \"Northumberland\" shipwreck off Kent's coast has been documented in stunning detail, revealing preserved wooden structures and artifacts threatened by shifting sands.\nTravel August 15 3 exclusive 'golden' visa destinations that America's wealthiest are eyeing Malta, the UAE and Portugal emerge as top destinations for Americans pursuing citizenship through investment programs. These areas offer healthcare, tax benefits and global mobility.\nVIDEO August 13 Jimmy Kimmel secures Italian citizenship, hints at fleeing Trump's America 'Outnumbered' reacts to late-night comedian Jimmy Kimmel saying President Donald Trump's second term is 'so much worse' than he thought it would be.\nTravel August 11 Nuclear plant on coastal waters shut down over massive jellyfish swarm Jellyfish swarms forced a shutdown of France's largest nuclear facility at Gravelines, impacting 900-megawatt reactors but posing no safety risks to staff.\nVIDEO August 8 Trump-Putin summit has potential for 'significant concession,' Gen. Keane says Fox News senior strategist analyst Ret. Gen. Jack Keane previews the potential Trump-Putin summit amid increased pressure to end the war in Ukraine on ‘Fox & Friends.’\nTravel August 7 Coastal city greenlights new visitor tax amid widespread overtourism trend Aberdeen, Scotland, will implement a 7% visitor tax starting in April 2027, adding approximately $6 to average hotel stays to generate over $7 million annually.\nTravel August 7 Angler expecting a fish pulls up rare 700-year-old sword: ‘Real treasures’ A fisherman in Poland reeled in a rare 700-year-old medieval sword from the Vistula River. An expert told Fox News Digital that it dates back to when Warsaw was founded.\nTravel August 6 New bridge will link popular island to mainland as critics warn of mafia, earthquakes The world's longest suspension bridge has been approved for a Sicily-Italy connection; construction may start in 2026. It's designed to carry 6,000 cars hourly as critics cite concerns.\nTravel August 5 Tourists face dangerous 'crush-and-grab' pickpocket schemes in major city The U.S. Embassy and the Reddit community both provide pickpocket prevention strategies for Paris tourists, covering subway safety, street scams and high-risk tourist locations.\nTravel July 31 Locals rant their neighborhood now 'like Disneyland' as post-Olympics tourism surges Paris residents in Montmartre say their neighborhood resembles Disneyland as a post-Olympics tourism boom drives up housing prices and displaces local businesses.\nTravel July 31 'Carbon passports' would track travel and even restrict how some people take vacation A university lecturer is proposing carbon passports for U.K. travelers to address environmental concerns due to tourism through personal emission credit systems.\nArchaeology July 31 Ancient Roman soldier's monthly paycheck unearthed in pristine condition in countryside British officials recently unveiled 25 silver denarii found by a metal detectorist in Great Ellingham. An expert told Fox News Digital about the hoard, which dates back as early as the 160s.\nTravel July 29 Beach town cracks down on half-naked tourists with hefty fines for inappropriate attire A French beach town has implemented swimwear restrictions requiring tourists to keep bathingsuits on the beach, citing respect for locals and public hygiene as major concerns.\nVIDEO July 28 This is the 'source' of Gaza's humanitarian problem: Marc Thiessen 'Special Report' panelists analyze the status of President Donald Trump's tariff deals and aid to Gaza.\nTravel July 28 Italian archaeologists unveil rare 2,600-year-old tomb untouched by looters: 'Doorway to our ancestors' The Italian Ministry of Culture recently announced the discovery of an undisturbed 2,600-year-old tomb at San Giuliano archaeological area. Though it's one of over 500 tombs, the burial is among the few not looted.\nTravel July 27 Man throws darts at world map, visits whichever country he hits: 'Are you crazy?' Random dart throws have taken Sorin Mihailovici, a Canadian man, to Indonesia, the North Pole and dozens of other locations since 2012. He's turned spontaneous travel into an Amazon Prime show.\nTravel July 27 Everything to know about Turnberry, Scotland, home of Trump golf course Trump's Scotland trip includes visiting the Turnberry golf resort, which has hosted four Open Championships and features the historic Turnberry Lighthouse on the Ayrshire coast.\nArchaeology July 25 Metal detectorist's 'feeling' leads to massive Roman settlement discovery in popular tourist hotspot An amateur metal detectorist's discovery of Roman cavalry swords led archaeologists to uncover a 2,000-year-old settlement in Gloucestershire, including a villa and building remains.\nTravel July 24 Tower of London dig reveals Black Death-era skeletons below popular tourist site: 'Tip of the iceberg' A mass grave with 14th-century skeletons possibly linked to the Black Death was recently discovered at the Tower of London, along with rare medieval burial artifacts.\nTravel July 22 Overdosing tourists in vacation hotspot are straining local health system Ibiza's ambulance services are overwhelmed, as a quarter of daily emergencies are linked to tourists experiencing drug and alcohol incidents at the island's popular nightclubs.\nMuseums Exhibits July 22 Museum unveils 1,300-year-old monk doodles revealing surprising complaints about hangovers and weather A new exhibition by the National Museum of Ireland features 17 ancient manuscripts with margin scribbles by Irish monks from the 850s, offering rare glimpses into medieval monastery life.\nTravel July 21 Rescue operation frees injured man trapped 130 feet underground in Italian cave Rescuers used controlled explosives to widen passages and free a 62-year-old explorer, who was found 130 feet underground with a head injury at the Abisso Paperino cave in Italy.\nTravel July 21 Medieval knight's tomb discovered beneath former ice cream parlor in Poland: 'Very rare' A medieval knight's tomb was recently uncovered in Gdańsk, Poland, near the country's oldest wooden church, revealing a skeleton and rare limestone tombstone from Sweden.\nLifestyle July 20 Ancient Roman emperor Caligula had an unexpected interest in medicinal plants, historians find Florida State University professor Trevor Luke spoke to Fox News Digital about recently uncovered evidence that the notorious ruler Caligula had a surprising interest in botany.\nHistory July 17 Historic medieval monastery once visited by legendary kings hits market with royal catch A 12th-century property in Kent with royal history is on the market for over $4.4 million, featuring a 13th-century chapel and moated gardens. Its lease ends in 2122."
    },
    {
      "url": "https://www.foxnews.com/category/christianity",
      "text": "Religion 20 hours ago Dr. James Dobson, Focus on the Family founder and advisor to 5 presidents, dead at 89 Dr. James Dobson, founder of the Focus on the Family Christian ministry and former advisor to five U.S. presidents, has died at 89.\nPope Francis 1 day ago Pope Leo opts to share papal residence with four associates, breaking with tradition Pope Leo XIV breaks with tradition by moving into the papal apartment with companions, contrasting Pope Francis who chose a Vatican guesthouse over the official residence.\nAncient Egypt 3 days ago Oldest written reference to Moses may be revealed in ancient Egyptian desert inscriptions, researcher says American-Israeli epigraphist interprets ancient inscriptions at Serabit el-Khadim that could be the oldest written mention of Moses, predating the Bible by centuries.\nMedia 4 days ago Blue-city pastor sees signs of revival after tens of thousands attend Christian crusade Portland pastor Brett Meador said the city is ripe for a religious revival after successful evangelism crusade this month and years of turmoil in the city.\nOpinion 4 days ago Gen Z embraces the Bible in unexpected global spiritual awakening Young adults seek authentic spiritual meaning beyond materialism, flocking to the Bible and Jesus as they reject hollow modern life and embrace ancient truths\nOpinion 4 days ago My flight was canceled. But a baby in the airport taught me everything about God's peace in a storm I saw an image of peace-giving in Chicago O’Hare. The airport atmosphere was anything but peaceful and there were thunderstorms overhead. There was a lot of grumbling. And I was, too.\nNorth Korea 4 days ago South Korea's move to lower tensions with Kim Jong Un threatens 400,000 Christians A move to lower tensions with Kim Jong Un's hermit kingdom has led to vital radio broadcasts of Christian material being cut off from the people who need it most.\nMedia August 11 Deep blue city attracts tens of thousands for largest Christian revival event in decades A Portland megachurch's revival event attracted 35,000 attendees, according to the church, in region where non-religious residents outnumber Christians.\nMedia August 11 Hostility against churches a 'growing trend,' as study finds hundreds of attacks on U.S. churches in 2024 New report finds church hostility remains high with over 400 incidents in 2024, including vandalism, gun violence and arson attacks across the United States.\nOpinion August 10 MAX LUCADO: Finding peace and faith in God in the middle of the storm God sometimes calms the storm and other times calms the child, as shown through biblical stories of Moses, Jesus, and modern testimonies of finding peace amid trials."
    },
    {
      "url": "https://www.foxnews.com/travel/italian-archaeologists-unveil-rare-2600-year-old-tomb-untouched-looters-doorway-our-ancestors",
      "text": "Archaeologists recently unearthed a remarkable 2,600-year-old tomb in Italy — a rare find untouched by looters.\nThe discovery was announced by the Italian Ministry of Culture on June 30. In a press release, the organization said the burial mound dated back to the late 7th century B.C., during the Orientalizing period of Italian history.\nThe tomb is part of the Caiolo Necropolis within the San Giuliano archaeological area, some 30 miles north of Rome. The site is famous for housing other ancient burials, including the Queen's Tomb, the Tomb of the Stag and the Tomb of the Beds.\nANCIENT CHRISTIAN TOMB COMPLEX REVEALED BENEATH RUBBLE FROM SYRIA'S CIVIL WAR\nThe newly discovered tomb has not been officially named, but authorities emphasized its significance – especially as it remained undisturbed for 2,600 years.\nIts treasures included ceramic vessels still bearing paint, along with bronze ornaments.\n\"Once the slab sealing the chamber was removed, numerous vessels immediately became visible,\" the ministry said in a statement translated from Italian to English.\n\"Some [were] fine painted ceramics, such as those near the entrance – deliberately placed according to a precise ritual performed before the tomb was sealed,\" the statement added.\n\"Finding an untouched tomb is incredibly rare. That’s what makes this discovery so exceptional.\"\n\"On the left-hand bed, a basin and several bronze ornamental elements belonging to the deceased remain in situ.\"\nThe excavation was conducted under the supervision of the Superintendency of Viterbo and Southern Etruria, in partnership with Baylor University.\nSupervising archaeologist Barbara Barbaro said that the necropolis contains over 500 tombs, though most were looted by either ancient people or modern robbers – but not the most recent one.\nCLICK HERE TO SIGN UP FOR OUR LIFESTYLE NEWSLETTER\n\"Finding an untouched tomb is incredibly rare,\" Barbaro noted.\n\"That’s what makes this discovery so exceptional.\"\nBarbaro also said that further study on the site will be \"fundamental to advancing knowledge of the ancient world.\"\nFor more Lifestyle articles, visit foxnews.com/lifestyle\n\"A sealed context is crucial not only for preservation but also because it gives us a complete snapshot of life through the ritual of death,\" she added.\n\"We’re thrilled to have rescued this material from those who would illegally profit from it.\"\nReflecting on the emotional weight of the find, Barbaro compared the discovery of the tomb to \"a bridge to our past, a doorway to our ancestors.\"\n\"This is what happens when an untouched tomb is found – it becomes a collective event,\" the archaeologist said. \"The silence … the awe, the respect for those waiting behind that massive stone. The emotion.\"\nCLICK HERE TO GET THE FOX NEWS APP\n\"We’re thrilled to have rescued this material from those who would illegally profit from it,\" she added. \"Now, it will tell a beautiful story for everyone.\""
    },
    {
      "url": "https://www.foxnews.com/apps-products?pid=AppArticleLink",
      "text": "Fox News is Everywhere.\nWatch Fox News Channel on all of your devices to keep up to date with the latest in news, politics, entertainment and more. On phones, tablets, wearables and TV, it's easy to stay connected anywhere.\niOS Devices\nAndroid Devices\nApple TV\nRoku\nChromecast\nAndroid TV\nAmazon Fire\nFubo TV\nApple Watch\nAmazon Echo\nGoogle Home\nFox News Go\nApple News\nAT&T TV Now\nYouTube TV\nHulu\nFacebook\nInstagram\nSamsung Devices\nSling TV\nVidgo\nSpotify\niHeartRadio\nFlipboard\nLinkedIn\nGoogle Newsstand\nNewsletters\nYouTube\nFAQ\nHow much data does Fox News Go use?\nFox News Go uses about 2GB per hour of SD viewing and 4GB per hour of HD viewing. This can vary depending on your device and internet connection. If you are concerned about your data usage we recommend not streaming over a cellular network and contacting your Internet or Cellular Service Provider.\nWhat broadcast quality will I get while streaming on my device?\nFox News will stream at the highest quality possible based on your device and internet connection quality. For the best quality we recommend streaming via Wi-Fi or 4G.\nWhat channels are available on Fox News Go?\nYou can Watch Fox News Channel on Fox News Go and Fox Business Channel on Fox Business Go"
    },
    {
      "url": "https://www.foxnews.com/travel/archaeologist-unearths-mysterious-christian-settlement-hidden-centuries",
      "text": "An archaeologist recently uncovered the likely remains of a long-forgotten Byzantine settlement, offering new insights into the history of Christianity in the Middle East.\nMusallam R. Al-Rawahneh, an associate professor of archaeology at Mu’tah University in Jordan, recently published his findings in the journal Gephyra in May.\nThe archaeologist believes he's uncovered the ancient site of Tharais, guided by the enigmatic Madaba Map – a remarkable mosaic that has puzzled historians for centuries.\nANCIENT ROMAN MILITARY FORTIFICATIONS FOUND IN 'STRATEGIC LOCATION' IN EGYPT\nSpeaking to Fox News Digital, Al-Rawahneh said he located the site near the Jordanian village of El-ʿIrāq, in an area known as Ain Al-Qala’a.\nThough the site was lost to obscurity, the historian said the once-thriving settlement was located \"strategically\" along trade routes to the southeastern Dead Sea region.\nAt the site, Al-Rawahneh and his team uncovered artifacts ranging from pottery shards and stone tools to glass remnants. He also uncovered fossils during his excavation.\nThe area was filled with architectural remains, including a Byzantine church. When asked what was the most interesting finding at the site, Al-Rawahneh pointed to several discoveries, including the Christian church and an olive oil press.\nARCHAEOLOGISTS MAKE GRIM DISCOVERY AFTER FINDING ANCIENT ROMAN BUILDINGS\nThe church, which the historian called \"basilica-style,\" retained fragments of mosaic floors typical of Byzantine Christian sites.\n\"[It] reflects Byzantine design, including a prominent entrance and possible remnants of decorative elements,\" he said.\nArchaeologists also found various inscriptions, which Al-Rawahneh said were linked to ancient funerary practices.\nWhile the inscriptions require further research, the professor said they \"may include Christian imagery and references,\" which will provide more insight into ancient religious practices.\nArchaeologists also found various inscriptions.\nSo what led to Tharais becoming \"lost\"? Al-Rawahneh said the site was abandoned by the 7th century A.D., based on what archaeologists have learned about activity in the area.\nCLICK HERE TO SIGN UP FOR OUR LIFESTYLE NEWSLETTER\nThe expert pointed to changes in trade routes, earthquakes and environmental changes as possible reasons.\nAl-Rawahneh also noted that the area transitioned from Byzantine to Islamic control in the seventh century.\nMore research is in the works, including surveys of surrounding areas and additional analysis of the artifacts that were found, he said.\nIn the future, Al-Rawahneh said he hopes that upcoming research will \"enhance the understanding of Tharais and its significance within the broader context of Byzantine archaeology in Jordan.\"\nFor more Lifestyle articles, visit foxnews.com/lifestyle\nThe Byzantine Empire, also known as the Eastern Roman Empire, lasted from 330 A.D. to the 15th century.\nThe empire began to take shape in 330 A.D., when Constantine the Great moved the Roman capital to Byzantium, which he renamed Constantinople.\nMany fascinating finds from the Byzantine era still turn up in Asia Minor and the Middle East today.\nIn May, Israeli officials put a 1,600-year-old Byzantine-era mosaic from a Christian monastery on public display for the first time.\nCLICK HERE TO GET THE FOX NEWS APP\nIn Syria, a contractor recently stumbled across a Byzantine tomb complex while clearing rubble."
    },
    {
      "url": "https://static.foxnews.com/foxnews.com/content/uploads/2025/08/france-vence-ancient-christian-baptistery-archaeology-1.jpg",
      "text": "���� JFIF ��ICC_PROFILE lcms mntrRGB XYZ � ) 9acspAPPL �� �-lcms\ndesc � ^cprt \\ wtpt h bkpt | rXYZ � gXYZ � bXYZ � rTRC � @gTRC � @bTRC � @desc c2 text FB XYZ �� �-XYZ 3 �XYZ o� 8� �XYZ b� �� �XYZ $� � ��curv ��c�k�?Q4!�)�2;�FQw]�kpz���|�i�}���0���� C \"\"*%%*424DD\\�� C \"\"*%%*424DD\\�� � \" �� �� �� F���h�t� ���\na���q�!���uy�E;�h T)���4sb�Q�5��l�/]������B����w9Q��t�ib���3y^�;�ޅ���@-f܃%Ƹ7CkuO� �SQn�T*[I#��\n��\n�x�ab�H�eSVO(بh\\� �Ѳ�>�Q�� >z��������fb��&�,������R�rJ_w�员��e��T��k����{:wPř����K��%¤s�5��U�5$P��e�����P���0�\n�ʏ%ʏ��C�}P�Ϣ���B�ʡ)u�����}��g+���]�nT��=H[μ��(�⾑�L�%�(xq'��C��N}u��iP��K��+v��\nj@�v7�W�����)C�8R3j�V�&V�b�T��2���� �}����A��E+˶3愷Mff�+Uk�|�*�D��p:l̫`C�R7hC���g؏K�[9B�O�|�۷��g��Ϣ��Ƈ��WYT7��B�[�O���}�ʹ�K��rȍ��}*����.��qҠ��ۑ/��Z<&�\n*q���6}U�Zpbf��L�7��F�+ǛF\n��ք[�����t�L/8��tø�ZF�Mƣ(N���0�����6H���ծ�B���ӛMeQ�f��o��\n���|}I��VF}ө_\n�&Y}�p�T�� �!��<�S�-��ku���#�=c��L�W�n�\\� �2�������[ ���}}���wWg+�s�,�(�v�46�]���T�P���}�B�Vٺ�9�~�����`��P��_J_0��vVƣ��U��T���0�+�eFr��YSD.\\`��$P\"�`�\\�W*�.5�Td��ZO��ĤK�5��U@Ņk|�6��i�id_d�Ł�+�ͭc� �M��z� ���םGv�化��*��$m���1k-�_(Զn.��=FQ�>wU��h�\\�s�Q&U�8 �j�j2�@�0=��s�eR�q���ԭrLf���s�t�N�XE�m�Y����������ċi��\"��mWՒ�C��[�J��2�ϓ���W����}�����(�t�J �����2�ʧ\n�g�������\nd:��S�#Q�:�B�4#��;���w���߬��dZ�e��M vN{o��0ҝ���Z�@Ը�����O6�.���i�jn9IB�E䁢��@�������nUMϻ�a�v��E(�YY����M=�i��������\\��vy���~�����I�} f%��j�Œ�msMR������4���/� c�����k��A=j\\�>��x����r�`������(y�\\��T�U��Y������ۼ�@��:�D\nAP��Wqx��Wq}d,�-���{:��$���N߭o;M��~6��yU�ي�tj�\n��Cb1���*�i���嬉��(���;��{ڪ�[U��vU˕��؇ҍ}>��/���VD�x]7j�\n,(CBf�>s�E�#����mK �*���e!�8U��.�BWJ��6Zo�f{33+j#.��.��3\n��&yM.7xAU�����tҰ��ނn����|����ᰭ5l\n��i>o4q��~o'��.���zG�tv\"����Ϗ��,��3���L�}������g���O��-�v�#��I�ʰ�ʮ�_�o�>�П��������95y��\"�ٺt�u7U��}r]�}?��\\��\n�����Aj��|�*���\"ٕ\"�st蕈J� I�`�C��?��FQ�O�5q���\n���F}�G��]��Q�eP�d����� NM+���V4�h�����T-�>+�>C�b��w�{dڈ}� Z�쫮WebS�i� ;\"����Ҳ�O���1i��]1����r�zjF�;�>�G\n�ڌ��o��D��|�q���$Q[ߕ]����Ԏ�m�;G�_��Z�ҳ�.{:��(�w�/�x����Ā��'U�c�4N��gNӓ�!��2�Xb�Z�r��Ca�/��W�����_�� C~x�n$b��P�U��aH��6Ux�?��5�|�n�����>Y0k�����Ur��u����!�x�@L>��U�5�Sh�m�[Y�W��>��ЅѪ�9T;��l䂩w�ϻ:�{��&�R�v�^�PP�M7Q�R��3��)Aכ��/헗O\\�N����LY���ȳꚈ�Nx�����+G_�w��TNU�N��Q����D�{��և���u�F;.�Rr-�}]&)>�5��$\"$�(�iP��+�},-�`�5�E9��֏�)H�2Vy��韗F�����Z��j&Z��|n�@3踡I��g� ��J��H(\"��pѠ�̾ϦU�r�o���H+Ȥ� �̯����(\"gg&=�K�]�n�$��4��Q�z�����}�&;�h�'Ϯ�zE��h~U�L7P�!�~|��^uB�Wk�O�\\�*��L�.�;���ߺՓ]�U�N��-j-������r�bgC��rܓG�:0^����^&]�9�\\gS�gP��Um�����8u���J(�H�|-coz#�*k��v�Y��cW�~M�C���jfKj�μ�҉�\ncB���I9�}�K>~���x�J�u�l\n� ������{�}�@��:!�X>�`>}3όu�w���7{��e��w��j�x>��ï��_0��i�f5EՐ��Qee���&���ai��]sˣ-�]�l�����,N֚� �y��X\\lR-�:.�ϧ�El��}.�r\nF\\?K�º�����+\"�_�,���P�}�Ͻ����9���c}9�����h�F��te�h�ѕʟ��}1�;5U��m[P>R�����Y\\ze�n}�I{;JE|`=[�zTB�<�|GNk4�]o>�w�ݖ)�+�`�*'ZrVlɌe��l�{ �+\n�R@�5�,96� *-b��P���x�3�ZP��ubVao#˅h��`1��Yٷ(��Q��3��'����Iq�,O�.�L���W����� Fb�m�vZ�#Q$�Y]d-�m��;9d��HNO�s˹t}.M��ڶ/˝�n���C��n�K��'Ӣ�C�#�D���>��;��2�p�\n�&�'UF�o��B_[U�ߪ�uoܕN|�'�:��hj��:r��p·��c�[MD�y����_g8w��I��w�O���]/ϭƹ���':��F��dTEU��NK����r�MD\\�+Z��H��&m���.N�����]��NG�tQ\\�Y����(B����'��-v2?=�G�m���T�וb�ډ�r�e�Ѡo�ksmvU_w�*���ƕ��]*d�n�w�❥s�5 �y'�*֓��y�~Luz�� �=++�e]�\"&��&C��A�1�ye�f��!�W���ϴ��fZ߀����&[|ƓY\" 6AHz�+�m�M'����v�$�Y�w�K�'�R}��C��K��MVG*� ����5N���7��S�3�M~2]gjg���hV������^�9��괃��c6��� �� ��6�w���*Iv�DL�Kmڲ��]����C�391h��IrD���}�b�i�����G�<�Լ� F4�G�Fy�F5gF\"m7>�4�-�����>�_hb�1Iy�Ŋe���y�[*�O�]�>�][ʦ����G;�9M.�t\\�uN�\\�*l�|l���~���/?}P��gZ��������\nC�)���Z����!�m�L4��1��ڜ����W��^� ӭ��T:%ʚe��k�A(V4��d�d��5����yI�Ui����Yҭ�lC�Bd�˜����mF�W'HHf�r|z�������5A� &�{���ASr�3�Ux�������� L b�%FdD�_-~���aBM�U���IxZf.X�,ةkMF�Y�؇��Ӽ��|��Ϡ��9�W�<:־4xG�����{_L��Zl�kz�^0��>���/�v���v��Jj�����.}jJ�WЏ٢�����8`��K��ճ=��� G #�g�K)���Y�7�~A�� �^�J]��û�,(��������-�r��݄?��y��% v\"�tz�%���ei-�y>O����S�UỬ�(Y�6�UwF�5�G�6i�m�g\"&ފ��0IZn�����u�ۆ���l�'��+c��4�[A��Q k��\n���i�\\��Yꖯ������<�Ա��N5u�E)�ŸK�j�˝Q�j\";8*ߧ�� ����,yh��[WC�,����Oq[|�L�� n��Hb�P(���ږ�����o<���>�mVT_|9�?�2�[\\� ��Pӻy���G�l깅�=���w��Z����X��\nt3.�9���7R�,2)��o��i>,`.[Xi�.�58� \".g� .,V �d�g�2���_?VZ����cf ]�H�9W\\)5+(���{�����J��E�/^�`p4�W�`?.BgYo: �����Ԇ�9��ʖ�u-��p%l���GIs����|}4�`�]R��z�Vr���#�3�50S��E�[}WgY#hDE�`����,'�����=�?�b��ԓP��Sx�]�^] ���A��g�k|��]�����2�gd�u��&W&o�|��jb�5���J5��f����?F���2�&�� M�!���,�6����_?���6Vª�{2M����<ӯ=�0��(֣Z��87kΠ�^�D�t� Q�)Yf�ιt��Ҁ1 �vE�ŷ��n�y�>�(̤ßWl�U�-к�$\"���T9���)�m2$F��Y������_�f.�wFzG�Y����րL�_��\\r���>�EyM���$۬�B}�[U7E���\\^�ܭ�pP�-�մ���� ���#.zrjS�M*~P��˨?Im��V��[��t�ۉ��ۂ/��ih�@�Ā���5^k�1�r���qW��1��K��9�L�,^����a��v�\"\nU�3��r�5����O8t#+\\N������(-V��?;���o�-Ñf�z�h�ɪDJ)g�O�>��2���gpT�jN���U���;�S$tA���Ἢ��F8���o5�͍��\\M�xB��ߒ�\\�lj���}kO�\"(x[e +���ǐ���~&C!��B.�����O'>��m���dp��!���\\��,}U�X!�}n�m�I�Q�ά^-|���+.0Ι�3���o}���en^x�'�1&���y�tl��ֆ�|.uA��.�ZgT�d�qkε҅���ELη7�β��tl�n0��^��d`a��,4��(�*�e݇]�� At��61H��&�`=)�}���N���X��ԵؗV)�f~���!\nkr�gP�Jk�WV���Y����v\\B9ە�l@������.74���Q}�T�kD�ё�LX�������>Eǥ���6���w�]T�Ǩ'7O� ����%]�r�MtW@�����xТV@�r��b�U/o��F�y��Kئc:��u߉W��'U0�^cl��\n��6�۹zB�}<�-�J��YM�p*����VV\n�/$�<��`��������eb;N ���u��7��>��heB*�*൨�]9?�ε�F�3Y���\n3�l�z5��Ӫ�jp"
    },
    {
      "url": "https://www.foxnews.com/travel/ancient-christian-church-reveals-mysterious-1500-year-old-warning-against-nonbelievers-righteous",
      "text": "Archaeologists in Turkey recently excavated the ruins of a millennia-old city, revealing a fifth-century Christian church with a message that hasn't been seen in over 1,000 years.\nThe excavation took place at Olympus, an ancient Lycian port city in Turkey’s Antalya province, according to Anadolu Agency (AA), a state-run news outlet in Ankara.\nThe city has been excavated continuously since 2006, but during the recent season, archaeologists uncovered multiple mosaic floors, along with large storage jars called pithoi.\nARCHAEOLOGISTS EXCAVATE ANCIENT WORKSHOP WITH UNFINISHED SCULPTURES ON GREEK ISLAND\nExcavator Gokcen Kurtulus Oztaskin, an associate professor at Pamukkale University, told AA that the site \"continues to surprise us with its mosaics.\"\nThe professor noted that \"in 2017, 2022 and 2023, we discovered richly decorated mosaic floors at the sites we worked on. This year, we uncovered and restored the floor mosaics of Church No. 1.\"\nThe most striking discovery was an inscription found at Church No. 1's entrance.\nOztaskin translated the message as: \"Only those on the righteous path may enter here.\"\nANCIENT CHRISTIAN TOMB COMPLEX REVEALED BENEATH RUBBLE FROM SYRIA'S CIVIL WAR\nOlympus was abandoned by the 12th century — meaning the inscription has not been seen since.\nThe mosaics also featured vegetable motifs, a common artistic element of the era.\nThe names of benefactors were also visible on the mosaics, indicating that an affluent class once flourished in Olympus.\nCLICK HERE TO SIGN UP FOR OUR LIFESTYLE NEWSLETTER\nExcavators also found a newly uncovered building that resembles a temple, though more work will be done to determine its age and function.\nOlympus was in use for several centuries. It still bears some remnants of Hellenistic, Roman and Byzantine architecture.\nArchaeologists have uncovered multiple churches, a bridge and an entrance complex.\nThey also found the Bishop’s Palace, the Antimakhos sarcophagus and the Lycian Marcus Aurelius Archepolis Monumental Tomb.\nFor more Lifestyle articles, visit foxnews.com/lifestyle\nThe discoveries come on the heels of several recent breakthroughs in early Christian archaeology.\nEarlier this spring, an archaeologist uncovered an ancient Christian settlement in Jordan known as Tharais.\nCLICK HERE TO GET THE FOX NEWS APP\nLast year, historians unveiled the earliest-known evidence of Christianity north of the Alps, in the form of a silver inscription."
    }
  ],
  "argos_summary": "Archaeologists uncovered a 1,500‑year‑old baptistery beside the Vence cathedral in France, revealing a circular structure with a distinctive octagonal‑cross font and Roman‑style concrete. The find confirms the early establishment of the Vence bishopric and offers new insight into fifth‑century Christian baptismal practices. Excavations also uncovered Roman‑style burials and a Roman dwelling beneath the cathedral, illustrating six centuries of religious and architectural development in the region. The discovery adds to a series of recent early‑Christian finds across Europe, including a silver inscription in Germany and an untouched tomb in Italy.",
  "argos_id": "4UZ2LJTPL"
}