{
  "url": "https://fortune.com/2025/08/24/stock-market-today-dow-record-high-nvidia-earnings-ai-bubble-pce-inflation-fed-rate-cuts/",
  "authorsByline": "Jason Ma",
  "articleId": "2e8d9cd1bdad4b27b6ed40ea425a319e",
  "source": {
    "domain": "fortune.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "AZ",
      "county": "Pima County",
      "city": "Tucson",
      "coordinates": {
        "lat": 32.1988848,
        "lon": -110.8218543
      }
    }
  },
  "imageUrl": "https://fortune.com/img-assets/wp-content/uploads/2025/08/GettyImages-1091025172-e1756069794314.jpg?resize=1200,600",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-24T22:18:10+00:00",
  "addDate": "2025-08-24T22:26:15.761650+00:00",
  "refreshDate": "2025-08-24T22:26:15.761652+00:00",
  "score": 1.0,
  "title": "Dow eyes fresh highs as Nvidia gets set to report earnings amid AI bubble fears",
  "description": "Wall Street's faith in the staying power of AI as an investment thesis will be put to the test when Nvidia reports quarterly earnings on Wednesday.",
  "content": "Stock futures edged up on Sunday evening as Wall Street looks ahead to another big week that will feature earnings from AI chip leader Nvidia and another inflation update.\n\nMarkets are coming off a monster rally on Friday, when Federal Reserve Chairman Jerome Powell opened the door to a rate cut next month.\n\nFutures tied to the Dow Jones Industrial Average rose 24 points, or 0.05%. S&P 500 futures were up 0.05%, and Nasdaq futures added 0.06%. On Friday, the Dow hit a new all-time high, while the S&P 500 and Nasdaq closed in on their records.\n\nThe yield on the 10-year Treasury was flat at 4.256% after diving Friday on rate-cut expectations. The U.S. dollar was down 0.02% against the euro and flat against the yen.\n\nGold fell 0.13% to $3,413.80 per ounce. U.S. oil prices rose 0.2% to $63.79 per barrel, and Brent crude added 0.15% to $67.83.\n\nFriday’s stock surge came after a big selloff that was led by tech giants, as doubts have grown about the AI boom and how much it will actually help companies.\n\nThat’s after a recent report from MIT found that 95% of AI pilot programs at businesses are failing to produce much of a return.\n\nAdding to those concerns were remarks from OpenAI CEO Sam Altman, who drew a parallel between today’s AI frenzy and the 1990s dot-com bubble.\n\nWall Street’s faith in the staying power of AI as an investment thesis will be put to the test when Nvidia reports quarterly earnings after the close on Wednesday.\n\nThe report also comes after Nvidia and AMD agreed to an unprecedented deal where they give the federal government a 15% cut of their chip sales to China.\n\nFor now, demand from U.S. companies remains high as so-called hyperscaler tech giants Alphabet, Microsoft, Amazon, and Meta Platforms alone are expected to deploy $400 billion in capital expenditures this year, and most of that is going to AI.\n\nOn Friday, the Fed’s preferred inflation gauge is due as policymakers wait and see how much of an effect on inflation President Donald Trump’s tariffs are having.\n\nEarlier updates on the consumer price index and the producer price index were mixed, and analysts expect the personal consumption expenditures index for July to rise 0.2% on a monthly basis and 2.6% on a yearly basis, the same annual rate as June.\n\nBut the core PCE is seen climbing 0.3% on a monthly basis and 2.9% on a yearly basis, accelerating from June’s 2.8% annual rate.\n\nStill, some Fed officials, including Powell, have indicated that tariff-related impacts on inflation may be short term and that more attention should go to the labor market, which has shown signs of weakening.",
  "medium": "Article",
  "links": [
    "https://fortune.com/2025/08/11/nvidia-amd-china-chip-sales-15-percent-unconstitutional-trump-china/",
    "https://fortune.com/company/dow/",
    "https://fortune.com/2025/08/19/wall-street-ai-bubble-sam-altman/",
    "https://fortune.com/company/microsoft/",
    "https://fortune.com/company/nasdaq/",
    "https://fortune.com/2025/08/22/jerome-powell-jackson-hole-markets-reaction/",
    "https://fortune.com/company/facebook/",
    "https://fortune.com/company/alphabet/",
    "https://fortune.com/company/amazon-com/",
    "https://fortune.com/2025/08/22/powell-jackson-hole-shifting-balance-risks-september-rate-cut/",
    "https://fortune.com/2025/08/18/mit-report-95-percent-generative-ai-pilots-at-companies-failing-cfo/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "AI chip leader Nvidia",
      "weight": 0.08222566
    },
    {
      "name": "AI pilot programs",
      "weight": 0.06923513
    },
    {
      "name": "AI bubble fears",
      "weight": 0.06765303
    },
    {
      "name": "AI",
      "weight": 0.06432015
    },
    {
      "name": "inflation",
      "weight": 0.06248643
    },
    {
      "name": "tech giants",
      "weight": 0.060967594
    },
    {
      "name": "Federal Reserve Chairman Jerome Powell",
      "weight": 0.06048077
    },
    {
      "name": "Nvidia",
      "weight": 0.059922922
    },
    {
      "name": "U.S. oil prices",
      "weight": 0.05951345
    },
    {
      "name": "quarterly earnings",
      "weight": 0.058633756
    }
  ],
  "topics": [
    {
      "name": "Markets"
    },
    {
      "name": "AI"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    },
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.99609375
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.9677734375
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.63623046875
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.316162109375
    }
  ],
  "sentiment": {
    "positive": 0.147275,
    "negative": 0.6861662,
    "neutral": 0.16655882
  },
  "summary": "Stock futures have risen ahead of a busy week that includes earnings from AI chip leader Nvidia and another inflation update. The Dow Jones Industrial Average rose by 0.05%, S&P 500 futures, and Nasdaq futures added 0.06%. This follows a rally following Federal Reserve Chairman Jerome Powell's announcement of a potential rate cut next month. The 10-year Treasury yield was flat at 4.256%. The dollar was down 0.02% against the euro and flat against the yen. Despite concerns about the AI boom and its effectiveness, Nvidia and AMD have agreed to a 15% cut of their chip sales to China.",
  "shortSummary": "Stock futures rose as investors awaited Nvidia's earnings and inflation updates, following a massive rally and amid concerns over the AI bubble and potential rate cuts.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "12a78c1b75c14b88b6d9a640fc592af4",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://fortune.com/2025/08/11/nvidia-amd-china-chip-sales-15-percent-unconstitutional-trump-china/",
      "text": "Nvidia and AMD agreed to share 15% of their revenues from chip sales to China with the U.S. government, President Donald Trump confirmed at a press conference Monday.\nThe Trump administration halted the sale of advanced computer chips to China in April over national security concerns, but Nvidia and AMD revealed in July that Washington would allow them to resume sales of the H20 and MI308 chips, which are used in artificial intelligence development.\nThe president said he originally wanted 20% of sales in exchange for Nvidia obtaining export licenses to sell the “obsolete” H20 chip to China, but credited Nvidia CEO Jensen Huang for negotiating him down to 15%.\n“So we negotiated a little deal. So he’s selling a essentially old chip,” Trump said.\nNvidia did not comment about the specific details of the agreement or its quid pro quo nature, but said they would adhere to the export rules laid out by the administration.\n“We follow rules the U.S. government sets for our participation in worldwide markets. While we haven’t shipped H20 to China for months, we hope export control rules will let America compete in China and worldwide,” Nvidia wrote in a statement to the AP. “America cannot repeat 5G and lose telecommunication leadership. America’s AI tech stack can be the world’s standard if we race.”\nAMD did not immediately reply to a request for comment.\nThe top Democrat on a House panel focusing on competition with China raised concerns over the reported agreement, calling it “a dangerous misuse of export controls that undermines our national security.”\nRep. Raja Krishnamoorthi, the ranking member of the House Select Committee on China, said he would seek answers about the legal basis for this arrangement and demand full transparency from the administration.\n“Our export control regime must be based on genuine security considerations, not creative taxation schemes disguised as national security policy,” he said. “Chip export controls aren’t bargaining chips, and they’re not casino chips either. We shouldn’t be gambling with our national security to raise revenue.”\nDerek Scissors, senior fellow and China expert at the conservative American Enterprise Institute, questioned the constitutionality of the deal and also warned against risking national security for revenue.\n“There’s no precedent for this, probably because export taxes are unconstitutional,” said Derek Scissors, senior fellow and China expert at the conservative American Enterprise Institute. “They call it a fee, but 15% of sales revenue is about a standard a tax as it comes. For this reason, I don’t think the ‘arrangement’ is at all durable. ‘’\n“If it were to last, it has two possible implications. First, there’s a possible export tax that high-profile companies and goods must consider. Or the tax only applies in exceptional situations, such as changing export controls. Then we’d risk national security for the sake of tax revenue, which is effectively the same as cutting the defense budget,” Scissors said.\nBack in July, Nvidia argued that tight export controls around their chip sales would cost the company an extra $5.5 billion. They’ve argued that such limits hinder U.S. competition in a sector in one of the world’s largest markets for technology, and have also warned that U.S. export controls could end up pushing other countries toward China’s AI technology.\nCommerce Secretary Howard Lutnick told CNBC in July that the renewed sale of Nvidia’s chips in China was linked to a trade agreement made between the two countries on rare earth magnets.\nRestrictions on sales of advanced chips to China have been central to the AI race between the world’s two largest economic powers, but such controls are also controversial. Proponents argue that these restrictions are necessary to slow China down enough to allow U.S. companies to keep their lead. Meanwhile, opponents say the export controls have loopholes — and could still spur innovation. The emergence of China’s DeepSeek AI chatbot in January particularly renewed concerns over how China might use advanced chips to help develop its own AI capabilities.\n—-\nAssociated Press writers Josh Boak and Shawn Chen contributed to the reporting."
    },
    {
      "url": "https://fortune.com/2025/08/22/powell-jackson-hole-shifting-balance-risks-september-rate-cut/",
      "text": "Federal Reserve Chair Jerome Powell on Friday opened the door ever so slightly to lowering a key interest rate in the coming months but gave no hint on the timing of a move and suggested the central bank will proceed cautiously as it continues to evaluate the impact of tariffs and other policies on the economy.\nIn a high-profile speech closely watched at the White House and on Wall Street, Powell said that there are risks of both rising unemployment and stubbornly higher inflation. Yet he suggested that with hiring sluggish, the job market could weaken further.\n“The shifting balance of risks may warrant adjusting our policy stance,” he said, a reference to his concerns about weaker job gains and a more direct sign that the Fed is considering a rate cut than he has made in previous comments.\nStill, Powell’s remarks suggest the Fed will proceed carefully in the coming months and will make its rate decisions based on how inflation and unemployment evolve.\n“The stability of the unemployment rate and other labor market measures allows us to proceed carefully as we consider changes to our policy stance,” Powell said. That suggests the Fed will continue to evaluate jobs and inflation data as it decides whether to cut rates, including at its next meeting Sept. 16-17.\nThe stock market jumped in response to Powell’s remarks, with the broad S&P 500 index rising 1.4% in early trading.\nPowell spoke with the Fed under unprecedented public scrutiny from the White House, as President Donald Trump has repeatedly insulted Powell and has urged him to cut rates, arguing there is “no inflation” and saying that a cut would lower the government’s interest payments on its $37 trillion in debt.\nWhile Powell spoke, Trump told reporters in Washington, D.C. that he would fire Federal Reserve Governor Lisa Cook if she did not step down over allegations from an administration official that she committed mortgage fraud.\nIf Cook is removed, that would give Trump an opportunity to put a loyalist on the Fed’s governing board. The Fed has long been considered independent from day-to-day politics.\nPowell spoke at the Fed’s annual economic symposium in Jackson Hole, Wyoming, a conference with about 100 academics, economists, and central bank officials from around the world. He was given a standing ovation before he spoke.\nIn his remarks, the Fed chair underscored that tariffs are lifting inflation and could push it higher in the coming months.\n“The effects of tariffs on consumer prices are now clearly visible. We expect those effects to accumulate over coming months, with high uncertainty about timing and amounts,” Powell said.\nInflation has crept higher in recent months though it is down from a peak of 9.1% three years ago. Tariffs have not spurred inflation as much as some economists worried but are starting to lift the prices of heavily imported goods such as furniture, toys, and shoes.\nConsumer prices rose 2.7% in July from a year ago, above the Fed’s target of 2%. Excluding the volatile food and energy categories, core prices rose 3.1%.\nRegarding the job market, Powell noted that even as hiring has slowed sharply this year, the unemployment rate remains low. He added that with immigration falling sharply, fewer jobs are needed to keep unemployment in check.\nYet with hiring sluggish, the risks of a sharper downturn, with rising layoffs, has risen, Powell said.\nPowell added that higher prices from tariffs could cause a one-time shift to prices, rather than an ongoing bout of inflation. Other Fed officials have said that is the most likely outcome and as a result the central bank can cut rates to boost the job market.\nPowell, however, suggested it is largely up to the Fed to ensure tariffs don’t lead to sustained inflation.\n“Come what may, we will not allow a one-time increase in the price level to become an ongoing inflation problem,” he said.\nPowell also suggested the Fed would continue to make its decisions free from political pressure.\nFed officials “will make these decisions, based solely on their assessment of the data and its implications for the economic outlook and the balance of risks. We will never deviate from that approach.”"
    },
    {
      "url": "https://fortune.com/company/microsoft/",
      "text": "Routinely ranked as one of the world’s most valuable companies by market capitalization, the software giant makes the popular Windows PC operating system and the Microsoft 365 suite of business productivity software. It also runs the Microsoft Azure cloud computing service, and owns the Xbox gaming platform, the code repository GitHub, and the professional social network LinkedIn. Cofounded by Bill Gates in 1975, Microsoft operates data centers around the globe to support its cloud computing services. In recent years, Microsoft has been at the forefront of the generative AI revolution through its partnership with OpenAI, its Copilot-branded AI applications, and its own AI models produced in-house.\nJoe Raedle—Getty Images"
    },
    {
      "url": "https://fortune.com/2025/08/22/jerome-powell-jackson-hole-markets-reaction/",
      "text": "Wall Street responded sharply to Federal Reserve Chair Jerome Powell’s address at the Jackson Hole symposium on Friday. The speech, delivered amid mounting economic uncertainty and political pressure, provided new signals on the Fed’s interest rate outlook that immediately moved stocks, bonds, and global currencies.\nMajor U.S. stock indexes surged following Powell’s remarks, with the S&P 500 climbing over 1.5% and set to break a five-day losing streak—the longest since January. The Dow Jones industrial average and the Nasdaq Composite each rose by nearly 2%, buoyed by renewed hopes of a rate cut at the Fed’s next meeting in September.\nTen out of 11 S&P 500 sectors traded higher, led by health care and real estate, as traders interpreted Powell’s comments about weakening labor markets and persistent inflationary risks as supportive of easier monetary policy.\nBonds and currencies shift, Europe and Asia rise\nIn the bond market, Treasury yields fell and the U.S. dollar weakened as traders increased their bets on a September rate cut. The CME FedWatch tool showed a roughly 70% probability of a 0.25 percentage point reduction next month, slightly below earlier expectations. European and Asian equity markets likewise gained, with China’s CSI 300 index reaching multiyear highs, reflecting global optimism for lower U.S. rates.\nPowell’s speech carefully balanced concerns: He acknowledged unusual weakness in both hiring and inflationary trends, and signaled confidence that the impacts from tariffs might be temporary. Investors and analysts viewed this as an indirect endorsement of policy easing, though Powell stopped short of explicitly pledging a cut.\nTraders are now positioning for the Fed’s September meeting, with markets pricing in up to two rate cuts by year’s end. Analysts caution that sustained market gains are contingent on Powell’s continued focus on downside risks and the ongoing tug-of-war between inflation data and jobs figures.\nOverall, Powell’s Jackson Hole speech quickly reversed the recent stock market slide and triggered renewed optimism that the Fed may act to support growth—while underscoring the uncertainty clouding monetary policy for the remainder of 2025.\nFor this story, Fortune used generative AI to help with an initial draft. An editor verified the accuracy of the information before publishing."
    },
    {
      "url": "https://fortune.com/2025/08/18/mit-report-95-percent-generative-ai-pilots-at-companies-failing-cfo/",
      "text": "Good morning. Companies are betting on AI—yet nearly all enterprise pilots are stuck at the starting line.\nThe GenAI Divide: State of AI in Business 2025, a new report published by MIT’s NANDA initiative, reveals that while generative AI holds promise for enterprises, most initiatives to drive rapid revenue growth are falling flat.\nDespite the rush to integrate powerful new models, about 5% of AI pilot programs achieve rapid revenue acceleration; the vast majority stall, delivering little to no measurable impact on P&L. The research—based on 150 interviews with leaders, a survey of 350 employees, and an analysis of 300 public AI deployments—paints a clear divide between success stories and stalled projects.\nTo unpack these findings, I spoke with Aditya Challapally, the lead author of the report, and a research contributor to project NANDA at MIT.\n“Some large companies’ pilots and younger startups are really excelling with generative AI,” Challapally said. Startups led by 19- or 20-year-olds, for example, “have seen revenues jump from zero to $20 million in a year,” he said. “It’s because they pick one pain point, execute well, and partner smartly with companies who use their tools,” he added.\nBut for 95% of companies in the dataset, generative AI implementation is falling short. The core issue? Not the quality of the AI models, but the “learning gap” for both tools and organizations. While executives often blame regulation or model performance, MIT’s research points to flawed enterprise integration. Generic tools like ChatGPT excel for individuals because of their flexibility, but they stall in enterprise use since they don’t learn from or adapt to workflows, Challapally explained.\nThe data also reveals a misalignment in resource allocation. More than half of generative AI budgets are devoted to sales and marketing tools, yet MIT found the biggest ROI in back-office automation—eliminating business process outsourcing, cutting external agency costs, and streamlining operations.\nWhat’s behind successful AI deployments?\nHow companies adopt AI is crucial. Purchasing AI tools from specialized vendors and building partnerships succeed about 67% of the time, while internal builds succeed only one-third as often.\nThis finding is particularly relevant in financial services and other highly regulated sectors, where many firms are building their own proprietary generative AI systems in 2025. Yet, MIT’s research suggests companies see far more failures when going solo.\nCompanies surveyed were often hesitant to share failure rates, Challapally noted. “Almost everywhere we went, enterprises were trying to build their own tool,” he said, but the data showed purchased solutions delivered more reliable results.\nOther key factors for success include empowering line managers—not just central AI labs—to drive adoption, and selecting tools that can integrate deeply and adapt over time.\nWorkforce disruption is already underway, especially in customer support and administrative roles. Rather than mass layoffs, companies are increasingly not backfilling positions as they become vacant. Most changes are concentrated in jobs previously outsourced due to their perceived low value.\nThe report also highlights the widespread use of “shadow AI”—unsanctioned tools like ChatGPT—and the ongoing challenge of measuring AI’s impact on productivity and profit.\nLooking ahead, the most advanced organizations are already experimenting with agentic AI systems that can learn, remember, and act independently within set boundaries—offering a glimpse at how the next phase of enterprise AI might unfold.\nSheryl Estrada\nsheryl.estrada@fortune.com\nLeaderboard\nMichael A. Discenza was appointed VP and CFO of The Timken Company (NYSE: TKR), effective immediately. Discenza has 25 years of experience at Timken in roles of increasing responsibility, including the last 10 as VP of finance, and group controller.\nJohn Cole was appointed CFO of ELB Learning, a provider of immersive learning solutions. He brings more than 25 years of experience leading finance and operations for Fortune 100 and 500 companies, according to ELB. Cole aims to strengthen the financial infrastructure to support the company’s next phase of growth.\nBig Deal\nThe report’s findings are based on a survey of more than 1,500 manufacturing leaders across 17 major manufacturing countries. Cybersecurity now ranks among the top external risks, second only to inflation and economic growth. One-third of respondents hold responsibilities spanning both information technology (IT) and operational technology (OT) cybersecurity.\nNearly half (48%) of cybersecurity professionals identified securing converged architectures as key to positive outcomes over the next five years, compared to just 37% of all respondents.\nHowever, a shortage of skilled talent, training challenges, and rising labor costs remain major hurdles. As manufacturers recruit the next generation, cybersecurity and analytical skills are becoming hiring priorities—reinforcing the need to align technical innovation with human development, according to the report.\nGoing deeper\nOverheard\n“Every single Monday was called 'AI Monday.' You couldn’t have customer calls, you couldn’t work on budgets, you had to only work on AI projects.”\n—Eric Vaughan, CEO of enterprise software company IgniteTech, told Fortune in an interview that he established a mandate: on Mondays, staff could only work on AI. In early 2023, convinced generative AI was an “existential” transformation, Vaughan saw that his team was not fully on board. His ultimate response? He replaced nearly 80% of the staff within a year, according to headcount figures reviewed by Fortune."
    },
    {
      "url": "https://fortune.com/company/nasdaq/",
      "text": "SEARCH\nHome\nNews\nFortune 500\nFortune Global 500\nFortune 500 Europe\nFortune China 500\nFortune SEA 500\nGreat Place to Work\nTech\nAI\nInnovation\nCybersecurity\nFinance\nPersonal Finance\nReal Estate\nEconomy\nInvesting\nBanking\nCrypto\nLeadership\nSuccess\nFuture of Work\nWorkplace Culture\nC-Suite\nCEO Initiative\nLifestyle\nArts & Entertainment\nTravel & Leisure\nWell\nEducation\nRankings\nAnalytics\nMultimedia\nLive Media\nMagazine\nNewsletters\nVideo\nPodcasts\nHome\nNews\nFORTUNE 500\nFORTUNE 500\nFORTUNE SEA 500\nFortune 500 Europe\nFortune Global 500\nFortune China 500\nGreat Place to Work\nTech\nTech\nAI\nInnovation\nCybersecurity\nFinance\nFinance\nPersonal Finance\nReal Estate\nEconomy\nBanking\nInvesting\nCrypto\nLeadership\nLeadership\nSuccess\nFuture of Work\nWorkplace Culture\nC-Suite\nCEO Initiative\nLifestyle\nLifestyle\nArts & Entertainment\nTravel & Leisure\nWell\nEducation\nRankings\nRankings\nAnalytics\nMultimedia\nMultimedia\nLive Media\nMagazine\nNewsletters\nVideo\nPodcasts\nAsia\nEurope\nAnalytics\nCompanies\nCompanies\nNasdaq\nNasdaq\nNasdaq in Fortune Rankings\n502\nFortune 500\nCompany Information\nKey Financials (last Fiscal Year)\nProfit Ratios\nEarnings Per Share (last Fiscal Year)\nTotal Return\nCompany Information\nCompany Information\nKey Financials (last Fiscal Year)\nProfit Ratios\nEarnings Per Share (last Fiscal Year)\nTotal Return\nNasdaq stock chart\nVideos"
    },
    {
      "url": "https://fortune.com/2025/08/19/wall-street-ai-bubble-sam-altman/",
      "text": "- Wall Street is feeling confident about the AI boom, even as OpenAI CEO Sam Altman cautions that some investors could be “burnt” amid soaring valuations. Major tech firms, including Microsoft, Amazon, Alphabet, and Meta, continue to increase capital spending to meet growing AI demand, while analysts like Wedbush’s Dan Ives and Treasury Partners’ Richard Saperstein emphasize the long-term potential.\nWall Street analysts are confident the artificial intelligence boom still has room to run. Even if Sam Altman, the OpenAI chief executive at the center of it all, appears less confident.\nSpeaking to reporters over dinner late last week, Altman drew a parallel between today’s AI frenzy and the 1990s dotcom bubble, when internet company valuations spiked dramatically before crashing.\n“When bubbles happen, smart people get overexcited about a kernel of truth,” Altman said, in comments reported by The Verge. “If you look at most of the bubbles in history, like the tech bubble, there was a real thing. Tech was really important. The internet was a really big deal. People got overexcited.”\nHe noted some startup valuations for companies raising hundreds of millions of dollars with only a staff of three were “insane.”\n“Are we in a phase where investors as a whole are overexcited about AI? My opinion is yes,” he said. “Is AI the most important thing to happen in a very long time? My opinion is also yes.”\nAltman warned that some investors are likely to get “very burnt” as some of the hype unwinds, but maintained that the long-term value created by artificial intelligence will outweigh short-term losses. He also repeated the word “bubble” three times in 15 seconds, joking that the comments were likely to become a headline.\nWedbush’s Dan Ives, however, was undeterred by Altman’s slightly tepid tone. He told Fortune that the “AI revolution will fuel a tech bull market for the next two to three years at least.\n“This is trillions being spent in the build-out of this fourth industrial revolution. There could be froth in certain areas of the private market for AI vendors, but ultimately, we do not see this as a bubble. This is a 1996 moment with a lot more room to go, not a 1999 moment in our view,” he said in an email.\nRichard Saperstein, chief investment officer at Treasury Partners, also shrugged off concerns, noting that large-cap technology stocks remain the market’s driving force.\nIn a Monday note reported by Barron’s, he wrote that big tech companies “have led the market higher and will continue to dominate market performance,” citing expectations for continued earnings growth, strong reinvestment of cash flows, and the expansion of their global reach.\nSaperstein advised investors to remain fully invested in U.S. equities, with a particular focus on large-cap technology names. He pointed to structural tailwinds, including deregulation, onshoring, and favorable treatment of capital expenditures, that he believes will support both corporate performance and broader economic growth in the years ahead.\nNo sign of a spending slowdown\nInvestors have had a reason to cheer in recent weeks, as major tech companies reported earnings that exceeded expectations. Microsoft, Alphabet, and Meta all posted strong growth and showed no signs of pulling back on AI.\nThe largest technology companies, including Microsoft, Amazon, Alphabet, and Meta, have all increased their capital expenditure forecasts to meet rising demand for artificial intelligence. Altman’s OpenAI is no different.\n“You should expect OpenAI to spend trillions of dollars on data center construction in the not very distant future,” Altman said, in comments reported by The Verge. “And you should expect a bunch of economists wringing their hands, saying, ‘This is so crazy, it’s so reckless,’ and we’ll just be like, ‘You know what? Let us do our thing.’”\nAs AI spending soars, there has been simmering concern that investment in AI may be outpacing sustainable growth. Industry figures, including Alibaba cofounder Joe Tsai and Bridgewater Associates founder Ray Dalio, have all voiced concerns about the trend.\nEarlier this year, Dalio warned that the current cycle on Wall Street appeared to be “very similar” to that seen before the dotcom bust in 1998 and 1999.\n“There’s a major new technology that certainly will change the world and be successful. But some people are confusing that with the investments being successful,” Dalio told the Financial Times.\nIn a report last month, Apollo Global Management chief economist Torsten Slok went further, arguing that the current AI boom may surpass the internet bubble of the 1990s. He noted that the 10 largest companies in the S&P 500 are now more overvalued relative to fundamentals than during the peak of the dotcom era."
    },
    {
      "url": "https://fortune.com/company/dow/",
      "text": "Dow makes and sells materials science solutions for packaging, infrastructure, mobility, and consumer applications. It is among the world’s largest chemical and plastics producers. Dow’s roots go back to the 1890s. The company was created in its current form after chemical companies Dow and DuPont merged in the 2010s to form DowDuPont; in 2019, the materials science division of the company was spun off from that entity to create Dow Inc.\nDow\nDow in Fortune Rankings\n- About\n- Great Place to Work\n- Earnings Reports\nEmployees say: \"Dow is a great place to work because I can always be myself. I have the opportunity to make a big difference not only to Dow's bottom line, but also the community and environment around us. We have many great perks and benefits that are really not comparable to other companies. Dow is led by an outstanding CEO who I feel is really part of the reason that Dow is such a great place to work.\"\nDow ranks No. 20 on the 2024 World’s 25 Best Workplaces list.\nEmployees say:\n\"Dow is a big company but operates like a small, family-oriented company. All of my colleagues are great, and we work so well together for Team Dow!\"\nThis is the fourth year Dow has made the list, and it climbed 10 spots this year. The plastics and industrial-supplies manufacturer operates sites in 31 countries, and 60% of its workforce have on-the-ground roles like plant operators, engineers, and maintenance workers. Off the ground, its workers include researchers, scientists, information systems professionals, and sales staff.\nDow’s values, namely personal safety, inclusion and diversity, pay equity, and global humanitarian aid, are part of what makes it a great place to work. Dow offers opportunities to all employees to answer questions and voice concerns through 10 employee resource groups, which saw increased employee participation from 15% in 2017 to nearly 60% of employees this year.\nIt also offers employees access to a well-being portal where they can access rewards for healthy habits—in the first half of last year, the company invested more than $5 million in rewards, and employees have redeemed almost $12 million since the portal launched.\nInclusivity is an ongoing priority for this manufacturer of plastics, silicones, and more, which has earned Dow a spot on the Best Companies to Work For list for a third year.\n- To ensure its efforts don’t falter, Dow built a scorecard for diversity and inclusion metrics, which provides transparency for how each segment of the company is progressing. A separate workforce dashboard for leaders gives them visibility into the diversity breakdown of their team.\n- The company’s Peer Allies program randomly assigns participants a new peer/ally connection each month, encouraging them to meet for at least one 30-minute one-on-one conversation. So far, more than 1,400 people at all levels throughout the company (making up roughly 10% of the workforce) take part in it.\n- “Dow is a wonderful company to work for,” said one employee. “The management does a wonderful job meeting you where you are in life and being flexible to allow employees to be productive all while managing their lives.”\nEmployees say:\n\"The way the company is engaged in inclusion and diversity is going beyond words, straight into action. It is clear that Dow puts people first. One recent example is the new parental leave policy, offering the same time off to both parents, either birth or adopting parents, including same-sex parents.\"\n- Company Information\n- Best Workplaces In Manufacturing And Production\n- World's Best Workplaces\n- World's Most Admired Companies\n- Best Companies\n- Benefits\n- Key Financials (last Fiscal Year)\n- Profit Ratios\n- Earnings Per Share (last Fiscal Year)\n- Total Return"
    }
  ],
  "argos_summary": "Wall Street futures rose on a hopeful tone after Fed Chair Jerome Powell signaled a possible rate cut, while investors eye Nvidia’s upcoming earnings and an unprecedented 15% revenue‑share deal with the U.S. government for chip sales to China.  The markets remain buoyant amid strong AI‑driven capital spending from giants like Alphabet, Microsoft, Amazon and Meta, even as a MIT report warns that 95% of enterprise AI pilots fail to deliver returns.  Inflation data shows modest PCE gains, and the Fed stresses tariffs may only temporarily lift prices, keeping the policy outlook cautious but optimistic for a September easing.  Overall, optimism about AI’s long‑term value persists despite concerns about overvaluation and the challenges of integrating generative AI in businesses.",
  "argos_id": "4YEPDLBLI"
}