{
  "url": "https://gizmodo.com/craig-mazin-talks-going-solo-for-the-last-of-us-season-3-2000647268",
  "authorsByline": "Justin Carter",
  "articleId": "3c76cdd84c794df8a4d2f4596266a26b",
  "source": {
    "domain": "gizmodo.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://gizmodo.com/app/uploads/2025/08/last-of-us-joel-1200x675.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-24T14:30:43+00:00",
  "addDate": "2025-08-24T14:37:52.597235+00:00",
  "refreshDate": "2025-08-24T14:37:52.597237+00:00",
  "score": 1.0,
  "title": "Craig Mazin Talks Going Solo for 'The Last of Us' Season 3",
  "description": "Now that he's the lone showrunner and writer for 'The Last of Us,' things are and aren't all that different for Mazin.",
  "content": "Season two of The Last of Us came and went earlier this year, and we already know its third season is on the horizon. Whereas the first two seasons were a team effort between showrunners Craig Mazin and Neil Druckmann and writer Hailey Gross, this next season will have Mazin as sole showrunner and writer—Druckmann, who also runs game developer Naughty Dog, is devoting his time to the studio’s next project, Intergalactic: The Heretic Prophet.\n\nIn a recent interview with the Hollywood Reporter, Mazin discussed his writing process, which he said won’t change now that his co-writers have exited the show. According to him, not much is going to change, since Druckmann’s “always had a full-time job running Naughty Dog, so it’s always been me up in Canada [where the production is].” Before Druckmann and Gross left, Mazin got “so much” out of them while working on the first two seasons, and they’d already been thinking about the future while working on the second season.\n\n“We really did get that work in. You can’t really tell half that story without thinking about what the whole story could be,” Mazin continued, referencing adapting only half of The Last of Us Part II. When the show returns, audiences will see things from Abby’s (Kaitlyn Dever) point of view before, during, and after the previous season. If you thought season was too short at seven episodes, the third may have more. Mazin told THR he and HBO are “currently fiddling around” with the specifics, but he’s looking at making this next season “more on par” with the first’s nine episodes to provide “more bang for the buck.”\n\nMazin didn’t just create and write the show, he’s also directed the first episode of each season. He revealed directing the premieres can be easy and allow for a full season prep, and now that that he’s sole showrunner, it’s on him to ensure “everything is fitting together tonally. We have directors alternating, and I’m on set doing—I don’t know what you’d call it—’showrunner QC’ sounds insulting to our directors, who are amazing.” He’s open to helming more than the premiere next season, but admitted it would be “hard to go prep something while I’m also still writing. We’ll see if I can get away with directing more than one [episode].”\n\nThe Last of Us is set to return for season three in 2027, so we’ve got time before we know how many episodes it’ll have, what it’ll change or update for Abby’s side of the story, and how much longer it’ll go on.",
  "medium": "Article",
  "links": [
    "https://gizmodo.com/warner-bros-dc-release-dates-hbo-max-cast-details-1848354161",
    "https://gizmodo.com/doctor-who-release-dates-streaming-ncuti-gatwa-rtd-1849745140",
    "https://gizmodo.com/the-last-of-us-will-need-a-4th-season-to-finish-its-story-2000604427",
    "https://gizmodo.com/star-wars-movies-tv-shows-release-dates-disney-1848494806",
    "https://www.hollywoodreporter.com/tv/tv-features/last-of-us-showrunner-craig-mazin-writing-directing-season-3-1236342633/",
    "https://gizmodo.com/the-last-of-us-part-ii-new-mode-playstation-2000625788",
    "https://gizmodo.com/the-last-of-us-showrunners-talk-that-shocking-cliffhanger-and-season-3-teases-2000606758",
    "https://gizmodo.com/marvel-release-dates-when-to-see-upcoming-mcu-movies-1848196856",
    "https://gizmodo.com/hbo-last-of-us-season-3-neil-druckmann-exit-naughty-dog-2000623486",
    "https://gizmodo.com/star-trek-release-dates-where-to-stream-picard-discover-1848839650"
  ],
  "labels": [
    {
      "name": "Pop Culture"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "next season",
      "weight": 0.11654993
    },
    {
      "name": "third season",
      "weight": 0.10380012
    },
    {
      "name": "Season",
      "weight": 0.1005443
    },
    {
      "name": "season",
      "weight": 0.1005443
    },
    {
      "name": "Craig Mazin",
      "weight": 0.09465059
    },
    {
      "name": "Mazin",
      "weight": 0.08982781
    },
    {
      "name": "game developer Naughty Dog",
      "weight": 0.07235828
    },
    {
      "name": "writer Hailey Gross",
      "weight": 0.07181638
    },
    {
      "name": "sole showrunner",
      "weight": 0.07150982
    },
    {
      "name": "Neil Druckmann",
      "weight": 0.0683093
    }
  ],
  "topics": [
    {
      "name": "TV"
    }
  ],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/TV & Video/TV Shows & Programs",
      "score": 0.97314453125
    },
    {
      "name": "/Arts & Entertainment/TV & Video/TV Guides & Reference",
      "score": 0.91162109375
    },
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.869140625
    }
  ],
  "sentiment": {
    "positive": 0.08345202,
    "negative": 0.6061831,
    "neutral": 0.31036487
  },
  "summary": "Craig Mazin, the showrunner and writer for the third season of The Last of Us, has spoken about his intention to go solo for the season three of the show. The first two seasons were a team effort between Mazin and Neil Druckmann, and writer Hailey Gross. Mazin stated that his writing process will not change, since Druckman, who also runs Naughty Dog, is focusing on the studio's next project, Intergalactic: The Heretic Prophet. He also revealed that he has directed the first episode of each season and is open to directing more episodes. The show is set to return for season three in 2027.",
  "shortSummary": "Craig Mazin will be the sole showrunner for The Last of Us, taking over from Neil Druckmann, who is focusing on Naughty Dog's next project.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "f9328cf1487e463e8f1b0f88f98c8458",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.hollywoodreporter.com/tv/tv-features/last-of-us-showrunner-craig-mazin-writing-directing-season-3-1236342633/",
      "text": "Craig Mazin will be The Last of Us season three’s lone writer after co-creator Neil Druckmann and co-writer Halley Gross announced they were stepping away from the series. (Druckmann co-developed the original Last of Us game and directed The Last of Us: Part II, which he co-wrote with Gross.) Emmy-winning writer-director Mazin (Chernobyl), who this year is nominated for outstanding drama series, spoke to THR about how the HBO thriller focusing on the survivors of a mass fungal infection that collapses modern-day society has helped level up the art of game-to-small-screen adaptations and whether he’s already busy writing the third season.\nRelated Stories\nVideo game adaptations are nothing new, but a TV spinoff earning Emmys is. Has The Last of Us proved that video game adaptations can hold their own?\nYeah. I think that in the wake of The Last of Us, a ton of video game projects got greenlit. Fallout was already happening, and that was fantastic in its first season, and I’m really looking forward to the second season. There’s just this incredible wave coming. Like anything, when people first said, “Hey, let’s start adapting books into movies or television shows,” some of them are going to be great, some of them will stumble. But the idea that the industry has woken up to how rich some of that storytelling is and how wonderful it is to adapt is fantastic.\nWhere are you with writing season three?\nThis is kind of my favorite time. It’s very quiet. It’s just sitting here with my wonderful ergonomic keyboard and clacking away. The pages are happening, and I get to be a monk for a while, which I love, and I just write. It’s the purest form of what I do. And then in just a couple of months or so, that happy time will start to be less quiet because we begin a very long prep period while I’m still writing, and then we begin to shoot while I’m still writing. In seasons one and two, I finished writing about six weeks before we started shooting the last episode. I don’t necessarily recommend this method other than to say this works for me, but it is insane.\nNow that Neil is stepping away to focus on Intergalactic: The Heretic Prophet, will the writing process change?\nI don’t think it is, in the sense that I was pretty much a monk just writing in a room by myself for most of the time regardless. And I’ve gotten so much out of talking with them over the course of seasons one and two. When we made season two, we really were thinking about what comes after because you can’t really tell half of that story without thinking about what the whole story should be. So we really did get that work in. Neil’s always had a full-time job running Naughty Dog, so it’s always been me up in Canada [where the production is], and, ultimately, things are pretty much going to proceed as usual.\nWhat were the most challenging scenes to shoot, logistics- and VFX-wise?\nEpisode two, the attack on Jackson, Wyoming, was an enormous undertaking for everybody. It was hard to write, it was hard to plan, it was hard to shoot. The prosthetics, the stunts and then the visual effects afterward were just massive. So we had [VFX houses] Weta and DNEG and about five other companies all working together to create all of the moments, and that was insane.\nThere were nine episodes in the first season but only seven in this one, and yet the pacing feels so different. Despite the fact that everything takes place in a span of three days, the attack on Jackson feels like it was ages ago. How does it compare to the game?\nThe attack on Jackson is not in the video game, so that’s new to our show. It’s one of those surprises that people who played the game would be like, “Oh!” But, yeah, the characters have gone through quite a bit, but the way we use time, it’s almost like so much of season two is really about three days, and I love being able to focus in on a period of time.\nThe Last of Us subreddit is quite a busy place. How closely do you keep track of the chatter and are there responses that surprise you?\nI don’t look at them, so I don’t know. Problem solved! I don’t go on Reddit. I mean, I’m always playing video games; I’m playing The Elder Scrolls IV: Oblivion Remastered right now. Sometimes I’ll go on Reddit when I’m like, “What is the best bow for an archer build?” That’s about as much Redditing as I do.\nWhat lessons did you learn from Chernobyl that you brought with you to The Last of Us?\nFor starters, I learned how much attention to detail matters. [What] we showed in Chernobyl was really born out of a desire to be as respectful as possible to the culture. We were telling a story that impacted people who are still alive, who lost people.\nI just had a sense that stories that have been told in the West about the Soviet Union were not accurate, and why not go for as real, real, real as you can? That approach to being as grounded as we can, especially in a genre story where there are monsters, is something that I brought forward. The style of shooting is something I pulled through — and I say it every time — but everything I ever learned about directing, I learned by watching Johan Renck direct Chernobyl. I really internalized the way that he used multiple cameras as an artistic choice, as opposed to just [shoot] faster.\nThe other thing that I learned from Chernobyl was how important it was for the people who were at the creative helm to pay as much attention to visual effects as they do to anything else that you don’t. In your mind, you think, “I’ll just send this away, it’ll come back, I’ll put it in the show.” It doesn’t work like that at all. It is almost like doing takes with an actor: “Great, now let’s try this. Great, let’s try this.” And then, “Ah, there it is.” And that process of working through visual effects is exhausting and exhaustive for everybody, but I think what we end up getting is pretty remarkable, and it makes the show better. I just believe that visual effects are beyond integral to the success of a show like ours.\nBefore Chernobyl, you worked on The Hangover films. How much are you itching to get back to comedy?\nNot strong itches. I mean, I spent a long time doing comedy, and even though I’ve been doing drama — it’s been about five, six years. Prior to that, it was like 25 years of comedy. Look, I think I’ve told all the jokes. I think my comedy is used up. I like having moments. I like having moments inside of drama. And I love working with comedic actors in dramatic roles because we can find comedy in there. So you do a scene where you’ve got Catherine O’Hara and she has this very heavy scene with therapy and all the rest, but still we find the funny in it because, of course, we do. But going back to pure comedy, I think probably, no, I don’t think so.\nDo you envision directing the first episode of TLOU season three as you’ve done with the first two seasons?\nYeah. Honestly, I’d love to direct more, but the problem is just logistics. I like to direct the first episode because you can prep the whole season. There are a lot of characters that get cast and there are a lot of decisions that get made about environments, so you can sort of prep a lot of the season by prepping and directing the first episode. As we’re going along, you have to prep the other episodes. We have directors alternating, and I’m on set doing — I don’t know what you’d call it — “showrunner QC” sounds insulting to our directors, who are amazing. But [I’m] just making sure everything is fitting together tonally. So it’s hard for me to then go prep something while I’m also still writing, but we’ll see if I can get away with [directing] more than one.\nAre more people lining up for roles now that The Last of Us has more Emmy nods?\nIt’s not quite like people knocking on your door as much as I think after season one. There may have been actors who were unaware of the video game or the show, but what they were aware of was that we were filling up those guest actor Emmy categories pretty extensively. We had fewer actual guest actors in season two, but we’ve still got Jeffrey Wright, Joey Pantoliano, Kaitlyn Dever and Catherine O’Hara, [who] all got nominated [for best guest acting in a drama series]. So when we pull people in, I think at least in the community, there’s an understanding they’re going to get something juicy to do. They’re not glorified day players. We try and create these little tiny, impactful stories with really, really good actors. So as we head into season three, I hope that we’ll see a couple of more fascinating additions like that.\nFor me, it’s so much fun to [say], “Hey, let’s just get Melanie Lynskey, why don’t we?” And to discover brilliant new talent, Keivonn Montreal Woodard, who had never acted before, and there he is getting an Emmy nomination for season one — that was just incredible. And Storm Reid won — obviously, she wasn’t new, but it was giving actors these interesting things to do that maybe they don’t normally get to do. Nick Offerman, who also won, normally doesn’t get to play that guy. And I love doing that.\nWho’s on your wish list for actors to write for?\nMy wishlist is Meryl Streep. I’ve always had [her] on my wishlist since I started in this business. I’ve never worked with her, but I met her when I was at the Golden Globes and I ran into somebody who was there with her. We were talking, and he was like, “Do you want to meet Meryl? She’s just around the corner. She’s going to walk over.” And I was like, “I would love to meet Meryl Streep. Yes!”\nSo she comes over and he [introduces us]. And I shook her hand and I went, “Pffff. You know!” [Raises hands] And she was like, “Yeah, I know.” I wanted to say, “Oh my God! I love you in this [and] this!” But I just figured, everyone always says that. I’m just going to package it into just, “Insert here, me just freaking out.” And she was really nice and seemed to accept that I was freaking out. So anyway, I short-handed it to, “You know!”\nI have not spoken to Meryl Streep, I have not written anything for her — yet — but one day, one day!\nYou just announced you and podcast co-host John August are releasing a book based on ScriptNotes. Will Neil and Halley ever join the pod guests?\nNeil and I have done at this point, 16 podcasts for the show and Halley’s been on, so that’s sort of that. ScriptNotes, the show has been going on forever. It was just hardcore screenwriting nerds, and it sort of expanded a bit. And we’ll get pitches from publicity people like, “Hey, would you like this person or this person?” But John and I have always felt we will bring guests on the show, but mostly we’re just keeping it a non-guest show so that it doesn’t turn into a talk show.\nYou got a tattoo of Ellie’s switchblade to commemorate The Last of Us’ success. Any plans to get any more show-inspired ink?\nI don’t have a specific plan, but I’m thinking maybe when it’s over. The other possibility is that I go for a tattoo-per-show method, so I only have the one. I may say, “OK, this is my Last of Us tattoo, now let’s see what comes next, and maybe that’ll be the next one,” but no plans yet. “No ragrets!”\nSince the second season only covered the first half of the second video game, what will the pacing and episode count be like for this next installment and beyond?\nWe’re kind of fiddling around with that — it’s a little bit of a trade secret at the moment. But I will say that season three will be longer than season two. Season three will be more on par with season one. More bang for the buck.\nThis story first appeared in an August stand-alone issue of The Hollywood Reporter magazine. To receive the magazine, click here to subscribe.\nTHR Newsletters\nSign up for THR news straight to your inbox every day"
    },
    {
      "url": "https://gizmodo.com/star-trek-release-dates-where-to-stream-picard-discover-1848839650",
      "text": "Trying to keep track of what’s coming in the realm of Star Trek feels like trying to stop a tribble from procreating. Before even more new series are announced, here’s our guide of when to expect all the new Star Trek shows, as well as returning familiar favorites, and what else is in the works right now. Engage!\nThis post was last updated 7/14/23.\nCurrently Airing: Star Trek: Strange New Worlds Season 2\nThe Enterprise is back after a successful first season, and this time Captain Kirk will be along for the ride with another appearance by Paul Wesley after his surprise finale role in season one. Not much else is known about the season so far, other than one episode will see the show crossover with Star Trek: Lower Decks in a live-action/animated hybrid directed by The Next Generation’s Jonathan Frakes. The show has also been renewed for a third season.\nSeason two recaps:\n“Tomorrow and Tomorrow and Tomorrow”\n“Charades”\nUpcoming: Star Trek: Lower Decks Season 4\nThe third season of the animated series following the misfit crew of the USS Cerritos—and in particular its cadre of ensigns, Mariner (Tawny Newsome), Boimler (Jack Quaid), Tendi (Noël Wells), and Rutherford (Eugene Cordero)—once again followed our heroic ensigns and the remaining bridge officers aboard the Cerritos. Season four will be arriving in late summer. The show has also been renewed for a fifth season.\nUpcoming: Star Trek: Discovery Season 5\nExpected in early 2024, Discovery’s fifth season will be 10 episodes long, down from the 13 of prior seasons. In the wake of season four‘s climax earlier this year, Michael Burnham (Sonequa Martin-Green) led her crew in a desperate attempt to save the galaxy from a mysterious anomaly created by an extra-galactic race, ensuring peace and stability for the Federation once more… for now. As her romantic partner Book (David Ajala) pays time for his own role in a campaign to surreptitiously destroy that anomaly, we’re not sure what awaits Burnham and Discovery’s crew just yet, but given this show, we’re sure it’ll be very, very dramatic.\nIn Flux: Star Trek: Prodigy Season 2\nThe animated series aimed at younger Trek fans (and Janeway fans!) and kids at heart can be found on both Nickelodeon and Paramount+. The first season was divided into two parts, with part two wrapping up at the end of 2022; after Paramount+ announced it would not move forward with the show’s already greenlit season two, it was removed from the service. (A home release of the complete first season is still possible; the first 10 episodes are still available for purchase.) Fans are still waiting to hear if Prodigy season two will surface on a different outlet.\nUpcoming: Starfleet Academy\nIt’s really happening! After a long tease, filming on this series will begin in 2024. Here’s the official announcement from co-showrunners and executive producers Alex Kurtzman and Noga Landau:\n“Admission is now open to Starfleet Academy! Explore the galaxy! Captain your destiny! For the first time in over a century, our campus will be re-opened to admit individuals a minimum of 16 Earth years (or species equivalent) who dream of exceeding their physical, mental and spiritual limits, who value friendship, camaraderie, honor and devotion to a cause greater than themselves. The coursework will be rigorous, the instructors among the brightest lights in their respective fields, and those accepted will live and study side-by-side with the most diverse population of students ever admitted. Today we encourage all who share our dreams, goals and values to join a new generation of visionary cadets as they take their first steps toward creating a bright future for us all. Apply today! Ex Astris, Scientia!”\nUpcoming (movie): Star Trek: Section 31\nAnnounced as a TV series back in 2019 as a spinoff for fan-favorite Discovery guest star Michelle Yeoh, this plunge into the seediest side of Starfleet—the shadowy spy organization Section 31 first introduced in Deep Space Nine—is now planned as a Paramount+ film.\nNewly minted Oscar winner Yeoh will return as former emperor of the Mirror Universe’s Terran Empire, Phillipa Georgiou, now turned into a kinder, but still kickass person by her time with Michael Burnham. “I’m beyond thrilled to return to my Star Trek family and to the role I’ve loved for so long,” Yeoh said in a statement. “Section 31 has been near and dear to my heart since I began the journey of playing Philippa all the way back when this new golden age of Star Trek launched. To see her finally get her moment is a dream come true in a year that’s shown me the incredible power of never giving up on your dreams. We can’t wait to share what’s in store for you, and until then: live long and prosper (unless Emperor Georgiou decrees otherwise)!”\nWritten by Craig Sweeny and directed by Olatunde Osunsanmi, Star Trek: Section 31 will start production later this year, and eventually come to Paramount+.\nWhere Can I Stream Classic Star Trek Shows?\nThat’s all the new bits of Star Trek coming. But what about the old Star Trek? In the U.S. at least, the vast majority of classic Star Trek shows are available exclusively to stream on Paramount+ (albeit not without issues), although some holdouts remain on other streaming services. Here’s a full list of classic Star Trek shows and where to stream them, as well as links to our recommended episode guides for every series!\nStar Trek: The Original Series (Paramount+)\nStar Trek: The Animated Series (Paramount+)\nStar Trek: The Next Generation (Paramount+, Netflix)\nStar Trek: Deep Space Nine (Paramount+, Netflix)\nStar Trek: Voyager (Paramount+)\nStar Trek: Enterprise (Paramount+)\nWant more io9 news? Check out when to expect the latest Marvel and Star Wars releases, what’s next for the DC Universe on film and TV, and everything you need to know about House of the Dragon and Lord of the Rings: The Rings of Power."
    },
    {
      "url": "https://gizmodo.com/warner-bros-dc-release-dates-hbo-max-cast-details-1848354161",
      "text": "The DC Extended Universe is finally giving Marvel a run for its money—something that’s bound to increase now that James Gunn is running the show. The DCEU’s myriad projects stretch far beyond superhero mainstays Batman, Superman, and the Justice League, promising to include new and interesting takes on DC Comics’ enormous stable of characters.\nWhat follows is an up-to-date list of everything DCEU-related that’s on the way: DC movies heading to theaters, as well as DC streaming movies and shows coming to Max.\nLast updated 8/23/2023.\nWhat’s the next DC Movie?\nAquaman and the Lost Kingdom\nRelease date: December 20 (in theaters)\nDirector James Wan returns for the next adventure following Arthur Curry (Jason Momoa) as the newly crowned King of Atlantis. Now in his new role, Arthur will explore more of the world under the sea while also dealing with new threats from Black Manta (Yahya Abdul-Mateen II) and others. Like Shazam 2, Aquaman 2 has endured its share of release-date changes, with its new Christmas 2023 date designed to give Wan and company ample time to complete all the necessary special effects.\nUpcoming DC Movie Release Dates\nJoker: Folie à Deux\nRelease date: October 4, 2024 (in theaters)\nTodd Phillips never saw his Joker movie as anything but a singular film. But over a billion dollars at the box office and an Oscar for Best Actor (for star Joaquin Phoenix) obviously changed things. We have a few nuggets of info so far: the title is Joker: Folie à Deux(French for “shared madness”), Phoenix is returning and will co-star with Lady Gaga (who’s playing Harley Quinn), Zazie Beetz is probably returning as Arthur Fleck’s neighbor, and… it’s likely going to be a musical? Filming wrapped in early April 2023.\nThe Batman 2\nRelease date: 2025 (in theaters)\nHot off the success of Matt Reeves’ long-awaitedThe Batman, everyone involved made it clear that wasn’t a one-and-done. Robert Pattinson’s Batman will be back. Will he face off with the Joker? It’s possible but not definitive. You’d imagine the Penguin and Catwoman could be back too. We don’t know much yet about this one, but we do know it won’t be arriving until 2025.\nCurrent DC Shows\nDoom Patrol Season 4, Part 2\nRelease date: TBD 2023 (on Max)\nThe fourth and final season of Doom Patrol—starring Brendan Fraser, Matt Bomer, Diane Guerrero, April Bowlby, Joivan Wade, Timothy Dalton, Skye Roberts, and Michelle Gomez—already aired its first batch of episodes; the remaining six will return later this year.\nUpcoming DC Movies and Shows Without Release Dates\nThe Penguin\nRelease date: Unknown (on Max)\nYou saw him in The Batman and now, Colin Farrell’s Penguin is getting his own Max series. As of April 2023, the show is in production, with a cast that also includes Cristin Milioti, Rhenzy Feliz, Michael Kelly, Shohreh Aghdashloo, and Deirdre O’Connell, with Clancy Brown and Michael Zegen recurring.\nPeacemaker Season 2\nRelease date: Unknown (on Max)\nFrom the instant that opening credits scene rolled for the first time, DC fans and non-fans alike fell in love with Peacemaker. Well, he’s coming back, still played by John Cena and still from the twisted mind of James Gunn. There’s no word on when it’ll happen but we’re guessing 2024.\nSuperman: Legacy\nRelease date: July 11, 2025\nJames Gunn will write and direct this Superman movie, which is touted as not being an origin story. Casting announcements started with Clark Kent/Superman and Lois Lane, who’ll be played by David Corenswet and Rachel Brosnahan. We also know Isabela Merced will play Hawkgirl, Edi Gathegi is Mister Terrific, and Nathan Fillion is a Green Lantern (Guy Gardner), as well as Anthony Carrigan as Metamorpho.\nMore Upcoming DC Movies and Shows Announced for the Gunn/Safran Era\nThe shake-up at DC Studios got a huge zap of energy at the end of January, when James Gunn and Peter Safran announced their massive slate of planned projects. Little is known about most of these projects so far in terms of cast and crew and even release dates—but we do have a few tidbits for each.\nCreature Commandos (An animated Max show) – A seven-episode animated series written by James Gunn himself. It stars Indira Varma (Obi-Wan Kenobi, Game of Thrones) as the Bride, who’s the lead character, and Marvel veteran Frank Grillo as Rick Flagg Sr.—father of Rick Flagg, played by Joel Kinnaman in The Suicide Squad. The rest of the cast includes David Harbour (Stranger Things) as Eric Frankenstein, Sean Gunn (Guardians of the Galaxy Vol. 3) as G.I. Robot, Zoe Chao (The Afterparty) as Nina Mazursky, Alan Tudyk (Star Wars: Rogue One) as Dr. Phosphorus, Maria Bakalova (Guardians of the Galaxy Vol. 3) as new character Princess Ilana Rostovic, and Peacemaker’s Steve Agee and Sean Gunn returning as John Economos and Weasel, respectively.\nWaller (A live-action Max show) – Viola Davis will reprise her Suicide Squad character; the story will bring back characters from the Peacemaker show and tell a story with events set between Peacemaker seasons one and two.\nLanterns (A live-action Max show) – Set on Earth, this mystery series will follow Hal Jordan and John Stewart doing their thing as DC’s “super cops.”\nThe Authority (Theatrical film) – The Wildstorm superhero characters will make their big-screen debut in a film co-written by Gunn.\nParadise Lost (A live-action Max show) – How did Wonder Woman’s world, Themyscira, come to be? Find out in this Game of Thrones-ish tale set before her birth.\nThe Brave and the Bold (Theatrical film) – Based on the acclaimed Grant Morrison comic run, this will explore the story of Batman’s son, Damien Wayne, and will feature “other members of the extended Bat-family.”\nBooster Gold (A live-action Max show) – The “loser from the future” superhero character gets his own series.\nSupergirl: Woman of Tomorrow (Theatrical film) – Based on Tom King’s comics run, this movie will explore how Supergirl is different from Superman. It’s not yet certain if Sasha Calle, who plays Supergirl in The Flash, will reprise the role here.\nSwamp Thing (Theatrical film) – The character’s “dark origins” will be the focus of this one. DC does horror! Rumored but not yet confirmed to be directing, James Mangold (Indiana Jones 5) told Collider that he’s slated to write the script.\nUpcoming DC Movies and Shows That Were Once in Development, But Whose Fate Is Unclear in the Gunn/Safran Era\nTa-Nehisi Coates and J.J. Abrams’ Superman movie\nRelease date: Unknown (in theaters)\nThe news of Superman: Legacy cast uncertainty on this project from writer Ta-Nehisi Coates and producer J.J. Abrams. There hadn’t been an update on this one in a while, but in late April, James Gunn himself told io9 that the two films don’t necessarily cancel each other out: “That’s an exciting movie … if it comes in and it’s great … and if the timing is right, that could absolutely happen. That’s totally unrelated. It would be an Elseworlds tale like Joker.”\nMichael B. Jordan Superman Series\nRelease date: Unknown (for Max)\nMichael B. Jordan was once developing a Superman take for Max as a limited series that would feature Val-Zod as opposed to Clark Kent. Again, there hasn’t been an update in a while.\nStatic Shock\nRelease date: Unknown\nPart of the relaunch of the Milestone comic brand is this adaptation produced by, once again, Michael B. Jordan. A writer was hired back in 2021 to come up with a script and we haven’t heard much since.\nJustice League Dark\nRelease date: Unknown (for Max)\nJ.J. Abrams was among the people involved with bringing this evil super-team to life and while there hasn’t been a ton of movement on the project of late, it’s been around long enough that we’d imagine it happens eventually.\nMetal Men\nRelease date: Unknown\nOne of the more recent pre-Gunn/Safran DC films to go into development, this is this tale of six beings based on various powerful metals. It’s from directors Ron Clements and John Musker (Aladdin, The Little Mermaid, and Moana), so if it happens, it’ll have an incredible pedigree.\nZatanna\nRelease date: Unknown\nLast year, Emerald Fennell won an Oscar for writing Promising Young Woman. She followed that up landing the job to write this DC superhero flick about the young magician. Like most of the films in this section, there hasn’t been movement in a while.\nHourman\nRelease date: Unknown\nYes, the hero who takes a drug that makes him a hero for an hour was, back in 2021, rumored to be in development. Whether or not that’s still the case is unknown but we figured it was worth noting.\nUntitled Arkham Show\nRelease date: Unknown (on Max)\nIn addition to The Penguin, Matt Reeves has said he plans to expand the world of The Batman into Max shows. At one point, a series about Gotham PD was in the works, but now he says it might be more about the inner workings at Arkham Asylum. On October 25, The Staircase’s Antonio Campos came aboard as a writer—the third to hold that position on the potential series so far—and may direct and serve as showrunner if the show happens, according to a report in Variety.\nWant more io9 news? Check out when to expect the latest Marvel and Star Wars releases, what’s next for the DC Universe on film and TV, and everything you need to know about House of the Dragon and Lord of the Rings: The Rings of Power."
    },
    {
      "url": "https://gizmodo.com/hbo-last-of-us-season-3-neil-druckmann-exit-naughty-dog-2000623486",
      "text": "In the wake of the controversially received second season of HBO’s Last of Us TV series, series co-creator and executive producer Neill Druckmann has announced that he is stepping away ahead of production on season three.\nIn a statement posted to Naughty Dog’s social media accounts today, Druckmann said his move comes “before any meaningful work” had begun on a third season of The Last of Us, set to continue adapting the remaining events of The Last of Us Part II. Druckmann will return his focus to working on Naughty Dog’s own upcoming gaming projects, including the sci-fi game Intergalactic: The Heretic Prophet, announced late last year.\n— Naughty Dog (@Naughty_Dog) July 2, 2025\n“Co-creating the show has been a career highlight,” Druckmann’s statement reads in part. “It’s been an honor to work alongside Craig Mazin to executive produce, direct, and write on the last two seasons. I’m deeply thankful for the thoughtful approach and dedication the talented cast and crew took to adapting The Last of Us Part I and the continued adaptation of The Last of Us Part II.”\nSeason one of the HBO series was met with near-universal critical acclaim when it debuted in 2023, but season two faced a rougher road—perhaps almost inevitably considering it dug into adapting the events of Part II, a sequel that had received its own fair share of controversies when it first launched in 2020. Some of the backlashes were mirrored with the release of the HBO show, like the reaction to the shock exit of Pedro Pascal’s Joel, but the season also faced criticism for its approach to adapting the game’s events in the context of the game’s own controversial reception at launch, questioning whether something was lost in exchanging the game’s ambiguity in storytelling for an attempt at a more clear-cut version of the narrative.\nHBO’s Last of Us adaptation was initially anticipated to run three seasons long, splitting its adaptation of The Last of Us Part II across two seasons. But earlier this year, showrunner Craig Mazin suggested that instead “the most likely outcome” will be that the series continues for a fourth season.\nWant more io9 news? Check out when to expect the latest Marvel, Star Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about the future of Doctor Who."
    },
    {
      "url": "https://gizmodo.com/the-last-of-us-part-ii-new-mode-playstation-2000625788",
      "text": "Season two of The Last of Us ended on “the” moment. The moment when a story you thought was one thing actually becomes another. It’s a moment lifted directly from the video game The Last of Us Part II, but now the game is letting players get rid of it, and we’re very curious about the timing.\nTuesday, Naughty Dog announced that it’s releasing a new update to the remastered edition of The Last of Us Part II. The update will allow fans to play the game chronologically, which drastically shifts the timing and intentions of the original game. “Those who have already played will know its story is told non-linearly, as Ellie and Abby’s motivations, realizations, and emotional stakes unfold across myriad flashbacks and present-day storylines,” the announcement reads. “While this structure is very intentional and core to how our studio wanted Part II’s themes and narrative beats to impact players, we always wondered what it would be like to experience this story chronologically. And now finally, we can answer that question.”\nBut did the question need to be answered? And is the fact it’s being answered so soon after the TV show based on the game was met with criticism for following the game a coincidence? It sure doesn’t seem like it. It, in fact, feels like a way to potentially undercut the intentions of the game, which we admit were pointedly unpleasant, but in a very good way.\nFor those who may not know the context here, The Last of Us Part II (and the TV adaptation so far) starts with a woman named Abby killing Joel, one of the main characters in the first game. In the game, you then play primarily as Ellie, Joel’s almost daughter, who goes on to hunt Abby. But, once the two finally meet again, the game flips back in time, and you’re forced to play as Abby. It’s an uncomfortable moment to become the villain, but as the game moves along, that conflict becomes the point. We start to see Abby as less of a villain and more of a hero.\nIt’s what The Last of Us Part II is all about. Making the player question themselves and others. Forcing us to deal with our own empathy. It’s also what the TV show is going for too, albeit in a slightly more drawn-out way since we’ll have to wait two years for new episodes. A chronological version of the story might still have that in there, but it won’t land in such a direct, gut-punch way.\n“Through the new Chronological mode, we believe players will gain even deeper insight into Part II’s narrative,” the company says. “Players will be able to see how Ellie being gifted a guitar flows so neatly into her learning to play, for example, while the journey through Seattle will showcase the fascinating parallels between Ellie and Abby’s crisscrossing journeys. You’ll see just how close they come into running into each other, how their actions impact each other, and more.”\nWhich, honestly, as a fan of the game, sounds kind of fun. It’s just a different point of view on the story. Maybe the answer here is to only make this mode available after you beat the game the original way, something that doesn’t seem to be in place but is recommended. “While we of course recommend players still new to the game to play through Part II’s story as was originally developed, the team’s hard work has paid off with a fascinating new way to enjoy this chapter,” Naughty Dog says.\nDo you think this new mode is in any way an answer to issues with the TV show? Does it bother you it exists? Or are you excited to actually give it a shot and see what new things you can learn? Let us know below.\nWant more io9 news? Check out when to expect the latest Marvel, Star Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about the future of Doctor Who."
    },
    {
      "url": "https://gizmodo.com/doctor-who-release-dates-streaming-ncuti-gatwa-rtd-1849745140",
      "text": "At a Glance:\nDoctor Who ended the eras of both Chris Chibnall as series showrunner and Jodie Whittaker as the 13th Doctor in 2022 with “The Power of the Doctor,” bringing to a close a three-season, three-special run.\nWhittaker’s replacement is returning star David Tennant. He will play the official 14th incarnation of the Doctor under returning showrunner Russell T. Davies, who revived Doctor Who in 2005 and managed the series until 2009.\nTennant will appear in three specials in November 2023 to coincide with the 60th anniversary of Doctor Who on November 23.\nHe’ll be joined by returning characters Donna Noble and Wilfred Mott, who were played by Catherine Tate and Bernard Cribbins in season four of Doctor Who. Neil Patrick Harris will play a new villain, while Heartstopper’s Yasmin Finney will play a character named Rose.\nTennant will be succeeded by Sex Education’s Ncuti Gatwa as the 15th Doctor. His announcement in May 2022 makes him the first Black male actor to play the character on-screen.\nGatwa will star in Doctor Who’s 14th season, set to air some time in 2024.\nMillie Gibson will co-star as the 15th Doctor’s companion.\nGame of Thrones star Indira Varma will play a mysterious character known as “the Duchess.”\nDoctor Who’s beloved tradition of doing a Christmas Special—no more New Year’s Day Specials, in other words—will return in 2023, with another confirmed for 2024.\nComedian Sooz Kempner will star in Doom’s Day, a new transmedia Doctor Who campaign tied into the anniversary. She’ll play Doom, the titular intergalactic assassin, who has found herself hunted by Death itself—and must use a purloined vortex manipulator with a day’s worth of time-jumping charge to find the Doctor and save herself.\nThis post was last updated 5/30/23.\nWhat’s Been Going on in Doctor Who?\nThree Doctor Who specials aired out the last days of Jodie Whittaker’s time as the Doctor in 2022. “Eve of the Daleks” saw the Doctor and her companions Dan (introduced in the prior 13th season, known as Doctor Who: Flux) and Yaz facing the titular iconic monsters in a time loop paradox. “Legend of the Sea Devils” revived the classic ‘70s monsters for a new adventure, while “Power of the Doctor” saw the 13th Doctor face off against the Master in an adventure that ultimately saw her mortally wounded, returning her companions to contemporary Earth while she regenerated into a new body.\nWhy Is David Tennant the Doctor Again? Is David Tennant Playing the 10th Doctor?\nWhittaker regenerated not into previously announced new Doctor Ncuti Gatwa, but David Tennant, who played the official 10th incarnation of the Time Lord from Christmas 2005 to New Year’s Day 2010, before reprising the role for Doctor Who’s 50th anniversary special, “The Day of the Doctor,” in 2013.\nWhile this marks his first return on-screen in the series since then, Tennant will not be playing the 10th Doctor, but the official 14th incarnation—and the character will be aware that they are both using a familiar form and are a new entity. Aside from the fact that Tennant is arguably the most popular actor to take on the role, so bringing him back for the 60th anniversary makes sense, there’s plenty of reasons Doctor Who can come up with as to why the Doctor’s regenerative process decided to re-use an old identity, more of which you can read about here.\nWhen Will Doctor Who Return in 2023?\nDoctor Who will return for three special episodes in November 2023, set to air in celebration of the series’ 60th anniversary.\nWhat Is Doctor Who’s 60th Anniversary Special About?\nAside from Tennant returning as the Doctor, he’ll be joined by former companions Donna Noble and Wilfred Mott, played by Catherine Tate and Bernard Cribbins (the actor’s last role prior to his passing in July 2022) in Doctor Who’s fourth season. Donna exited the series as a regular character after an adventure lead to her needing to have her memory wiped by the 10th Doctor, forgetting her time alongside him lest her mind face grievous harm, so just how Donna will play into the the story remains to be seen.\nThe Doctor and Donna will face a mysterious new adversary, played by Neil Patrick Harris, and will be joined in the specials by Yasmin Finney as a new character named Rose. How Finney’s Rose might connect to the other famous Rose of Doctor Who, Billie Piper’s Rose Tyler, also remains to be seen.\nIs There a Trailer for Doctor Who’s 60th Anniversary?\nThe first premiered at the end of “The Power of the Doctor,” and you can watch it above. The second premiered in December and you can watch it here:\nWhen Will Ncuti Gatwa Become the Doctor?\nGatwa is briefly seen in the trailer for Doctor Who’s 60th anniversary, so will presumably follow the long tradition of new Doctors appearing in the final moments of their predecessor’s last episodes to become the 15th Doctor. The BBC has announced that Gatwa will appear as the Doctor first “over the festive season” in 2023, before he takes over full-time in a new season of the show after that.\nIs There a Doctor Who Season 14 Release Date?\nThere’s no current release date for season 14 of Doctor Who, but it is expected to be broadcast some time in 2024.\nWhere Is Doctor Who Streaming in the U.S. and UK?\nCurrently, the first 13 seasons of the revived Doctor Who are streaming on the BBC iPlayer in the UK; in the U.S., the revived series streams exclusively on HBO Max. In both countries, episodes from the classic era of the show are available through Britbox.\nThis will change in 2023, at least in the U.S. The BBC and Disney have announced that as part of a new deal, Doctor Who will stream exclusively worldwide on Disney+, except for in the UK and Ireland, where it will still stream on the BBC iPlayer and BBC One. It’s currently unknown if this will affect Doctor Who’s place on BBC America, where it currently airs in the U.S..\nDoes Disney Co-Own Doctor Who Now?\nA report in the wake of the BBC/Disney announcement from British paper the Telegraph alleged that the deal will also see Disney contribute finances to help create the show, and while the series’ creative team will still hold control of the series primarily, the deal will allow Disney some level of say in the creative decisions for the series—as well as allowing access to talent or “cinematic production moments” previously inaccessible due to the BBC’s budget for the show.\nNone of this has been confirmed by the BBC, however. The announcement strictly focused on Disney’s acquisition of Doctor Who’s streaming rights, and did not mention any co-owning. The new era of the series will be made for the BBC by Bad Wolf Studios, created by former Doctor Who producer Julie Gardner and former BBC Controller of Fiction Jane Tranter—which is now owned by Sony Pictures Television, after the studio took a majority stake in Bad Wolf in December 2021. The series was previously made by BBC Studios directly.\nIn January, Davies did say that Doctor Who is now working with a bigger budget, telling GQ that Disney’s involvement came about as part of “the BBC’s notion to go for a streamer to invest in the show worldwide … We’re not on the budget level with Star Wars and the Marvel shows, [but] it’s better than it was … We’re not allowed to talk about budget… but it’s more than I’ve ever had to work with.”\nWant more io9 news? Check out when to expect the latest Marvel,\nStar Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about James Cameron’s Avatar: The Way of Water."
    },
    {
      "url": "https://gizmodo.com/the-last-of-us-will-need-a-4th-season-to-finish-its-story-2000604427",
      "text": "Next season of The Last of Us won’t be the last of it. In a new interview, the show’s co-creator Craig Mazin said that the upcoming third season of the show will not finish the story of the second video game, The Last of Us Part II. “There’s no way to complete this narrative in a third season,” Mazin said. “Hopefully, we’ll earn our keep enough to come back and finish it in a fourth. That’s the most likely outcome.”\nThe quote comes from an extensive interview with Collider where Mazin, ahead of the upcoming season two finale, spoke about working on the third season, which HBO officially greenlit a few weeks back. “It would take forever,” Mazin said about finishing the events of the second game in the third season. “There are natural perforations in the narrative where you can go, ‘Okay, let’s tear it here.’ I think there’s a decent chance that season three will be longer than season two, just because the manner of that narrative and the opportunities it affords us are a little different. The thing about Joel’s death is that it’s so impactful. It’s such a narrative nuclear bomb that it’s hard to wander away from it. We can’t really take a break and move off to the side and do a Bill and Frank story. I’m not sure that will necessarily be true for season three. I think we’ll have a little more room there.”\nAudiences have not yet seen where season two ends, but it certainly seems to be aiming at one of the second game’s biggest “perforations” that Mazin mentions. Assuming the game’s big point of view shift is the end of this season, there is definitely a lot more story to go, but it’s a bit of a surprise to hear Mazin flat out say they don’t want to wrap it up next season.\nThankfully, Mazin confirms that they don’t start writing anything until—not just the upcoming season is planned, but even further in advance. “We always think ahead,” he said. “We thought ahead to season three and season four, to try to get as much visibility as we can, so that we don’t end up in a situation where we’re sitting down and getting into details for a season and then going, ‘Oh, man, if only we hadn’t had that person say that one line or be in that spot or wear that jacket, this would be so much cooler.’ So, we really do try to think things through fundamentally. The challenge for our first season was, how do we tell this big story in a way that’s complete and doable within an amount of time and with the budget we have? And with this season, it was, ‘Okay, this source material goes way beyond one season.'”\nIn fact, it might take three seasons. The season two finale of The Last of Us airs Sunday; we’ll have much more then.\nWant more io9 news? Check out when to expect the latest Marvel, Star Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about the future of Doctor Who."
    },
    {
      "url": "https://gizmodo.com/the-last-of-us-showrunners-talk-that-shocking-cliffhanger-and-season-3-teases-2000606758",
      "text": "The wait between seasons one and two of The Last of Us was brutal, but at least that story had ended. We wanted to see what was next for Joel and Ellie, but it wasn’t absolutely necessary. That’s not the case for season two, though, which ends right smack in the middle of the story, with a cliffhanger that’s sure to frustrate many viewers. It’s all but assured that the wait for season three will be worse.\nIn the meantime, you are probably wondering a few things about not just the end of season two, but what’s to come in season three. And, thankfully, showrunners Craig Mazin and Neil Druckmann were happy to talk about that. Below, we’ll tell you what The Last of Us team had to say about the season two cliffhanger, whether that was always the ending, how things might be changing for season three, and some of the questions you should be asking as you wait.\nSeason two of The Last of Us ends in the middle of a key moment between Ellie and Abby before flashing back a few days to Abby. The implication, much as it is in the video game, is that we are about to see Abby’s story moving ahead, and that’s absolutely the plan.\n“We often talk about what are we promising the audience going forward?” Druckmann said in a press conference. “So, for example, it was important for Craig in episode five that we show Joel in that last scene, because then there’s a promise of where we’re going to next. And had we ended the season somewhere else, maybe like a few moments before, I think that we wouldn’t be making the right promise of what this is about. And we’re telling you next season, well, one is that there’s just an epic nature to what’s about to happen. But this other story is going to be really important coming back to Joel and Ellie and everything that you’ve seen so far.”\nIn the game, though, the audience has a natural pain and discomfort when the point of view shifts from Ellie, a character you have been playing as, to then playing as her sworn enemy, Abby. Mazin admits it’s one place a show comes up short compared to the video game but they hope they did as good a job as possible to duplicate it.\n“We can’t… reproduce the shock of becoming another person,” he said. “In games, you are Joel. You are Ellie. You are Abby. And when that shift happens, it is jarring because you have been someone. But here we are watching everybody equally on a screen. We may identify with them from time to time in different ways, and we may be conflicted, but we’re not them. So when we go to a scene where we’re somebody else, there’s the normal thing of, ‘Whoa, I’m suddenly with Jeffrey Wright in a weird, creepy kitchen. And I’m watching him torture somebody.’ That’s a little jarring, but it’s never going to be what a video game can do when you shift perspective in a massive way like that. So I think what we do, and what we’re doing correctly, is honoring the notion that there is a time period where one person experiences it one way, and another person is experiencing it so wildly different, and yet they converge. It’s a convergent storm… And that’s what matters. But can we reproduce that gut-punch feeling? No. And I think if we had chased it, we probably would have fallen on our faces.”\nSo if the show couldn’t match that moment in the same way, was there ever a discussion of changing things? Maybe ending it differently? There was, but not for long.\n“Honestly, we were open to a different ending,” Mazin admitted. “We talked about it a lot. We considered everything. Of course, you want to play around. Like maybe we should just interlace the stories. Maybe we should just go back and forth. Maybe we should try this. Maybe we should try that. And then in the end, I just remember saying, ‘Isn’t this part of the genetics of how this story functions?’ It’s just part of the genetics. Now, what it means is we have to take risks as a television show and HBO has to back us taking risks. But then again, we did just kill Pedro Pascal. They understand that this show is going to be a different show every season, which is sort of a tricky thing to do when you’re a hit show. You keep asking people like, ‘I know you love this. We’re taking it away and giving you this now.’ And then hopefully they go, ‘Oh, well, you know what? We actually really like this.’ ‘Oh, that’s nice. Now we’re giving you this now’ because that’s how the story works.”\nAnd so, in season three, the point of view will certainly shift to Abby. But, does that mean Bella Ramsey’s Ellie won’t be in season three?\n“I remember when people were asking about season two, they were like, ‘And what about Joel and when he dies?’ I’m like, ‘Whoa, whoa, whoa. What do you mean ‘When?’ ‘If!'” Mazin says. “The [third] season will arrive, and it will do what it does. Even if I thought I knew now exactly how it was going to go. I’m experienced enough to know that two weeks from now, we may have a different idea of how it should go. All I can say is we haven’t seen the last of Kaitlyn Dever, we haven’t seen the last of Bella Ramsey, we haven’t seen the last of Isabela Merced, and we haven’t even seen the last of a lot of people who are currently dead in the story.”\nDruckmann added, “Whether you will see them on screen or not, their presence will be there throughout.”\nFinally, season two may have focused on Ellie’s story, and season three might focus on Abby’s, but so much else is happening too. There’s Isaac and the WLF. The Serephites. Their war. And Mazin wants fans to be aware of all of that.\n“I think [all those other stories] bode well for next season,” he said. “I have so many questions and I think and I understand that the audience does too. I sort of want to assure them that those questions are correct and will be answered. ‘What is going on? How did that war start? How did the Seraphites start? Who is the prophet? What happened to her? What does Isaac want? What’s happening at the end of episode seven? What is this explosion? What is all of it?’ All of it will become clear.”\nWhen specifically? We don’t know. In 2027 perhaps? Either way, the wait has begun. Watch all seven episodes of The Last of Us season two on HBO Max now.\nWant more io9 news? Check out when to expect the latest Marvel, Star Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about the future of Doctor Who."
    },
    {
      "url": "https://gizmodo.com/star-wars-movies-tv-shows-release-dates-disney-1848494806",
      "text": "“Star Wars! Nothing but Star Wars! Give me those Star Wars! Don’t let them end…” Just as Bill Murray said it in 1978, we’re still saying it today. Star Wars is everywhere these days, with multiple movies and TV shows in the works from Disney and Lucasfilm. This article will give you the most up-to-date Star Wars release dates so you know exactly when every new Star Wars movie or Disney+ show will arrive.\nWhat are the next three movies? What TV shows are coming up? Have any TV shows or movies been canceled? What are people saying about what’s next? We’ve got you covered on all things in a galaxy far, far away.\nThis post was last updated on 9/13/2023.\nWhat’s the next Star Wars movie?\nSharmeen Obaid-Chioy’s New Jedi Order Film Film\nRelease Date: TBD, but May 26, 2026, December 18, 2026 or December 17, 2027 (In Theaters)\nAt Star Wars Celebration 2023 in London, Lucasfilm announced that three Star Wars movies are now in the works.\nJames Mangold (Indiana Jones 5) will direct a film 25,000 years before any known Star Wars timeline about the first Jedi to use the Force.\nDave Filoni will direct a film that’s kind of the Star Wars Disney+ Avengers, telling the story of a climactic event meeting the stories of The Book of Boba Fett, The Mandalorian, Ahsoka and more in the time between Return of the Jedi and The Force Awakens.\nAnd Sharmeen Obaid-Chioy will direct a film set 15 years after the events of The Rise of Skywalker following Rey (Daisy Ridley) as she creates a New Jedi Order.\nThis last one, we think, is the film that Damon Lindelof (Lost, The Leftovers, Watchmen) was co-writingwith Justin Britt-Gibson before departing the project. Steven Knight is now reportedly writing.\nA week after the news of these films first broke, it began to seem like the Rey project by Obaid-Chioy could be the first one out of the gate. However, in June, Disney shuffled its release schedule and moved its December 2025 Star Wars movie to May 2026, and added a third Star Wars movie to the schedule in December 2026. So maybe these three movies are on those dates. We’ll see.\nUpcoming Star Wars release dates\nThese shows and movies have all been officially announced and are in various stages of production, even if we don’t know when they will definitely come out.\nStar Wars: Ahsoka\nRelease Date: Now Playing (On Disney+)\nThe first full live-action Ahsoka Tano show from co-creator Dave Filoni is finally here. Rosario Dawson is, of course, returning. And our first look at footage confirmed that actress Natasha Liu Bordizzo has been cast as Sabine Wren; more recently, Eman Esfandi was confirmed as Ezra Bridger. At Star Wars Celebration this year we learned Mary Elizabeth Winstead is playing Hera Syndulla, Lars Mikkelsenis playing Grand Admiral Thrawn and Wes Chatham is his right-hand man.\nWhat does that all mean? Well, in the first teaser trailer, you can see she’ll make good onthe Star Wars Rebels finale and go after Thrawn. And what about the fact she knows Luke Skywalker now? And how does Ray Stevenson’s lightsaber-wielding character fit in?\nThe show is now airing on Disney+ and here you can read our weekly recaps:\nEpisode 1, “Master and Apprentice: and Episode 2, “Toil and Trouble”\nEpisode 6, premiering September 19\nEpisode 7, premiering September 26\nEpisode 7, premiering October 3\nStar Wars: Skeleton Crew\nRelease Date: 2023 (On Disney+)\nCreated by Spider-Man Homecoming/Far From Home/No Way Home director Jon Watts along with writer Chris Ford, this mystery Star Wars show is now currently in development. The title for the show was released during the Star Wars Celebration, and was previously internally referred as “Grammar Radio.” Celebration also revealed its headlining star, Jude Law.\nSet after the events of Return of the Jedi, Skeleton Crew is described as an adventure in the mold of Amblin adventures of the 1980s. The show will be about seeing the galaxy through the eyes of children (but it is not a kids show), and will follow a group of children who get lost in the galaxy and try to find their way home. Jon Watts explained that the series will take place during the same time period as the upcoming Ahsoka series and The Mandalorian.\nFilming on the series began in 2022 and ended in early 2023. And though not much is know about what happens on the show,it has been revealed that The Daniels, the Oscar-winning directors of Everything Everywhere All At Once, directed an episode. Ditto David Lowery, who did the film The Green Knight. Read more about the show here.\nio9 saw the first footage at Star Wars Celebration 2023 and you can read about it here. Three of the main stars of the show are played by Ravi Cabot-Conyers, Kyriana Kratter, and Robert Timothy Smit. Rumors suggest it could debut in November or December 2023.\nStar Wars: The Acolyte\nRelease Date: 2024 (On Disney+)\nRussian Doll co-creator Leslye Headland will be the first person to bring the excellent High Republic timeline into live-action with this show, long rumored to star Amandla Stenberg before an actual confirmation finally arrived at San Diego Comic-Con 2022—one of few Star Wars bits of news to emerge from the convention.\nIn an interview in 2022, Headland revealed the show would be about 100 years before the events of The Phantom Menace. “A lot of those characters haven’t even been born yet,” she said. “We’re taking a look at the political and personal and spiritual things that came up in a time period that we don’t know much about. My question when watching The Phantom Menace was always like, ‘Well, how did things get to this point?’ How did we get to a point where a Sith lord can infiltrate the Senate and none of the Jedi pick up on it? Like, what went wrong? What are the scenarios that led us to this moment?”\nIn an interview released later, Headland spoke about her goals for the series. For Headland, above all else The Acolyte is a mystery, and that mystery is figuring out what is going on in this peak period. It was also suggested that The Acolyte will bring more elements from the Expanded Universe to canon, but what parts that will be incorporated will remain to be seen.\nIn September 2022, both Jodie Turner-Smith and Squid Game’s Emmy-winning Lee Jung-Jae joined the cast, with an official announcement in November adding Carrie-Anne Moss, Manny Jacinto, and others to the roster. The first image, which you see above, was released in November and you can read about the first footage here, which was shown at Star Wars Celebration 2023.\nAnd no, despite what bullcrap rumors you may have been reading online, the show has not been canceled.\nAndor: Season 2\nRelease Date: August 2024 (On Disney+)\nSeason one of Tony Gilroy’s Rogue One prequel starring Diego Luna showed an excitingly different side of Star Wars. Season two will reportedly be spread across the four years leading up to Rogue One, with four episodes covering each year in Cassian Andor’s life until that fateful point. Filming began in late 2022.\nAt Star Wars Celebration 2023, Gilroy announced the show should be out in August 2024 and showed fans the first footage from the season. Read about it here. Plus, the final episodes of the season/series will take place just days before Rogue One, leading right into that story.\nOne minor hiccup though, due to the Writer’s Guild strike, showrunner and head writer Tony Gilroy left his duties show in May 2023. He’s unlikely to return until the Writer’s Strike is over, which could cause a delay.\nStar Wars: A Droid Story\nRelease Date: TBD (On Disney+)\nLucasfilm Animation is teaming up with Industrial Light and Magic for this streaming show that will “introduce us to a new hero, guided by legendary duo R2-D2 and C-3PO.” We don’t know anything beyond that and there hasn’t been a significant update in years, which could be a good thing or bad thing.\nStar Wars: Lando\nRelease Date: TBD (On Disney+)\nWay back in December 2020, Disney announced a bunch of Star Wars TV shows. Among them was a Lando show which, at the time, was going to be made by Dear White People creator Justin Simien. After that, things went quiet for about three years. Then,in an April 2023 article, Donald Glover hinted that he’s still interested and it’s still possible in the works. A May 2023 interview with Lucasfilm president Kathleen Kennedy confirmed it’s still in the works.\nThe first significant update in almost three years came in July when news broke that Simien has been off the project since he started working on Haunted Mansion, and not only is Donald Glover going to star in the series, he’s co-writing it with his brother Stephen.\nUntitled Taika Waititi Star Wars Movie\nRelease Date: TBD\nIn May 2020, news broke that Oscar-winning director of Thor: Ragnarok would be helming and co-writing along with Krysty Wilson-Cairns. “Taika’s approach to Star Wars will be fresh, unexpected, and … unique,” Lucasfilm president Kathleen Kennedy said. “His enormous talent and sense of humor will ensure that audiences are in for an unforgettable ride.”\nThere was a time when this was likely to be the next Star Wars film but, after Star Wars Celebration 2023, it seems like it’s now on the back burner. That was confirmed by Lucasfilm president Kathleen Kennedy who said the Oscar-winner is still working on the film, it’s just going slowly.\nIn the past, Waititi has discussed some broad ideas of what he wants to do with his upcoming film. Read those below.\nTaika Waititi Doesn’t Want Star Wars to Rely on Legacies\nAre You as Confused About Taika Waititi’s Star WarsMovie as We Are?\nUntitled Dave Filoni Star Wars Movie\nRelease Date: TBD\nWe mentioned this one above but, at some point, Dave Filoni will be directing a film that is meant to be a climactic event wrapping up stories that have begun on shows he’s involved with such as The Mandalorian, Ahsoka, The Book of Boba Fett, Skeleton Crew and others.\nUntitled James Mangold Star Wars Movie\nRelease Date: TBD\nThis was one of the three films announced at Star Wars Celebration but, like Filoni’s, isn’t likely to be next. This one is set 25,000 years before the original trilogy and tells the story of the first person to use the Force.\n“For me, it’s about, I want to be part of the saga, but I also don’t want to be holding so much lore in the air that you can hardly tell a story,” Mangold told io9 when asked about this film. “And what I really wanted to do…was just can we make a kind of the Ten Commandments of the Force, you know? A kind of origin story of how the Force came to be known, understood, wielded, and harnessed.” We love this idea so much we even wrote about it.\nStar Wars Movies and TV Shows That Are Currently Unscheduled and Haven’t Been Officially Announced, But We Think Are Still Happening\nThe Mandalorian Season 4\nRelease Date: TBD\nWith The Mandalorian Season 3 now in the books, all eyes look ahead to season 4. However, the season has not yet been officially announced. Unofficially though, series creator Jon Favreau said he’s already written a fourth season which he probably wouldn’t have done just for fun. It’s coming. It’s just a matter of when, especially with writers and actors on strike.\nThe Book of Boba Fett Season 2\nRelease Date: TBD (On Disney+)\nThe Book of Boba Fett season one ended with the implication that we’d see more of these character in the future. But alas, there has been no official announcement… yet. Dive into the making-of season one while we wait and ponder the words of executive producer Robert Rodriguez who said he knows when the character is coming back, but he can’t say when.\nUntitled Shawn Levy Movie\nRelease Date: TBD\nShawn Levy, the prolific director and producer behind Stranger Things, Night at the Museum, and Free Guy is gearing up to develop a film in a galaxy far far away. He’ll focus on that after completing Deadpool 3, which stars Ryan Reynolds and Hugh Jackman.\nStar Wars Movies and TV Shows That Are Currently Unscheduled and Probably NOT Going To Happen\nStar Wars: Rangers of the New Republic\nOriginally announced alongside shows like Obi-Wan Kenobi, Ahsoka, and Andor, Rangers of the New Republic was rumored to be Cara Dune’s show which would tie into The Mandalorian and Book of Boba Fett. However, with actress Gina Carano no longer a part of Star Wars, word on the street is this will no longer be happening. Nothing is official though.\nUntitled Rian Johnson Trilogy\nLet’s be honest. Do we think this is happening anymore? Probably not. Rian Johnson has moved on to other things. But, until we hear otherwise (and no one is officially saying), we’d be remiss if we didn’t mention that before the divisive release of The Last Jedi, Lucasfilm officially said Johnson would make his very own trilogy. It hasn’t officially been canceled yet but, in a new interview, Lucasfilm president Kathleen Kennedy suggested that it’s been placed on the back burner as Johnson does other things. With Johnson’s next film, Glass Onion, set for release in late 2022 though, he’s been quoted saying he still hopes these movies happen. So do we.\nStar Wars: Rogue Squadron\nFor several years, Wonder Woman director Patty Jenkins’ film about pilots in the Star Wars universe has been earmarked as the next film. Well, that’s no longer the case. After months of rumors suggesting it might move off its 2023 release date, Disney officially took it off the schedule. On December 13 2022, Jenkins said the movie is still in “active development” but recent news suggests it’s dead. Lucasfilm president Kathleen Kennedy disagrees, saying in May 2023 it’s still on the books.\nUntitled Kevin Feige Movie\nMarvel Studios President Kevin Feige is best known for helping create the Marvel Cinematic Universe. But as much as he loves Marvel, he loves Star Wars even more. And so it was exciting to hear that he was producing a Star Wars movie and even recruited Loki and Doctor Strange in the Multiverse of Madness writer Michael Waldron to help him. Feige doesn’t like to even acknowledge this project though and in a 2022 interview, Lucasfilm president Kathleen Kennedy also tiptoed around the project’s existence. Then, a few weeks before Star Wars Celebration 2023, we learned the project is likely dead.\nFor more, check out io9’s list of every canceled (or re-worked) Disney Star Wars project.\nWant more io9 news? Check out when to expect the latest Marvel, Star Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about the future of Doctor Who."
    },
    {
      "url": "https://gizmodo.com/marvel-release-dates-when-to-see-upcoming-mcu-movies-1848196856",
      "text": "There’s now over 30 feature films in addition to eight Disney+ shows in 15 years in the Marvel Cinematic Universe. 2023 got off to a promising start here’s what’s coming next from the MCU. In short: a lot, we began Phase Five with Ant-Man and the Wasp: Quantumania followed by Guardians of the Galaxy: Volume 3, Secret Invasion and by the fall we’ve got The Marvels on the horizon along with season 2 of Loki.\nHere’s the latest news for Marvel theatrical release dates and Marvel TV release dates on Disney+—which the studio can often tweak or reschedule—so we get it, keeping track of when your favorite superheroes are returning or making their debuts can be challenging. Don’t worry, to help you stay on top of things, we’re compiling all the current MCU release dates; when specific titles have been announced but still not officially scheduled, we’ll put them in order when we think they’re most likely to show up.\n(Last updated 6/16/23)\nWhat’s the next Marvel movie?\nThe Marvels\nRelease date: November 10 (In theaters)\nThe sequel to Captain Marvel will pull together three of the MCU’s most powerful women: Brie Larsen’s titular Captain, Ms. Marvel’s Iman Vellani as Kamala Khan, and Teyonah Parris as Monica Rambeau. Nia DaCosta (who most recently helmed the revival of Candyman) is directing the film.\nIn the finale of Ms. Marvel season one, Carol Danvers showed up in Kamala Khan’s bedroom, marking the first real tease of the film. The film release date change came with a poster. Most recently the teaser trailer dropped and here’s our breakdown of everything we saw.\nUpcoming Marvel Cinematic Universe Release Dates\nSecret Invasion\nRelease date: June 21 (On Disney+)\nThis series picks up storylines from both Captain Marvel and Spider-Man: Far From Home to explain the decades-long Skrull invasion of Earth. Samuel L. Jackson and Ben Mendelsohn will star withEmilia Clarke taking on the role of Talos’ grown daughter who has joined a rebellious splinter cell of Skrulls. Martin Freeman has also confirmed he will be appearing in Secret Invasion.\nThe Disney+ blurb of the series describes the series as a “crossover event series showcasing a faction of shape-shifting Skrulls who have been infiltrating Earth for years.” A trailer was released at D23.\nLoki Season 2\nRelease date: Fall 2023 (On Disney+)\nThe smash hit series about Tom Hiddleston’s antihero will return soon for more variant shenanigans across the multiverse. Hiddleston confirmed “the whole cast” of Loki’s first season will return for season two on an episode of Jimmy Kimmel Live. In December, we got a very, very brief tease of season two.\nEcho\nRelease date: November 29, 2023 (On Disney+)\nThis spinoff from the Hawkeye series will follow Echo, a deaf martial artist, as played by actress Alaqua Cox. Devery Jacobs (Reservation Dogs) co-stars. Echo officially began filming on May 24, according to a tweet by series creator Marion Dayre. According to James Clement on an episode of the Weekly Planet podcast, both Vincent D’Onofrio and Charlie Cox are set to return for the Echo series at Disney+.\nThe series was recently announced along with Ironheart, Agatha Coven of Chaos and What If season 2 as potentially moving to 2024.\nX-Men ‘97\nRelease date: Fall 2023 (On Disney+)\nThe X-Men are coming to the MCU… kinda. X-Men ‘97 is a revival of the classic ‘90s animated show, bringing back the same style, stories and yes, theme song, of the iconic series. (See more: X-Men ‘97 Looks Like a Nostalgic Blast From the Past)\nIronheart\nRelease date: 2024 (On Disney+)\nWith Tony Stark gone, the MCU needs a new super-genius inventor. Enter teenage prodigy Riri Williams (played by Dominique Thorne), who creates a brand new, ultra-advanced armored suit. Other cast members include Anthony Ramos (In the Heights) as the villain the Hood and Lyric Ross (This Is Us). Chinaka Hodge (TNT’s Snowpiercer) is attached as the head writer, and Black Panther director Ryan Coogler is an executive producer alongside Marvel’s Kevin Feige and others. Manny Montana (Good Girls) has joined the cast of Marvel’s Ironheart in an undisclosed role as well as Han Solo himself, Alden Ehrenreich.\nAgatha: Coven of Chaos\nRelease date: Winter 2024 (On Disney+)\nThis spinoff from WandaVision will star Kathryn Hahn as her fan-favorite character Agatha Harkness. Joe Locke (Heartstopper) and Aubrey Plaza (Hahn’s Parks and Recreation co-star, among her other many credits) are also in the cast, as is Patti LuPone. (A second WandaVision spin-off, this one focusing on Paul Bettany’s Vision, is also reportedly in the works.)\nCaptain America: Brave New World\nRelease date: August 26, 2024 (in Theaters)\nWe’ve got a new Captain America, so it was inevitable that we’d be getting a new Cap movie. Anthony Mackie will appear in the title role. Harrison Ford was announced to take over the role of General Thaddeus Ross and will make his debut in this release.\nDaredevil: Born Again\nRelease date: Spring 2024 (On Disney+)\nCharlie Cox and Vincent D’Onofrio will return as Daredevil and Kingpin for an 18-episode Disney+ series. Jon Bernthal has signed on to reprise his role as the Punisher. Things remain uncertain for Foggy and Karen.\nThunderbolts\nRelease date: December 20, 2024 (In theaters)\nMarvel Studios is readying a movie based on the comic Thunderbolts and director Jake Schreier has been tapped to bring it to life. This film marks the end of Phase Five of the Marvel Cinematic Universe. Steven Yeun (Nope) signed on for an undisclosed role\nBlade\nRelease date: February 14, 2025 (In theaters)\nDisney hasn’t revealed much about this reboot of the franchise that features a badass vampire-hunter who is also a vampire, but we know that it stars two-time Academy Award winner Mahershala Ali, who also played Cornell “Cottonmouth” Stokes in Netflix Marvel series Luke Cage. We also know Blade appeared (or at least his voice did) in the end credits of The Eternals. After losing director Bassam Tariq, who would have been the first U.S.-Pakistani person to helm a Marvel Studios film, Blade was put on pause, and its release date was shifted. But now it has a new director in place: Lovecraft Country’s Yann Demange, as well as a writer in Michael Starrbury, so the September 2024 date looks ever more likely.\nDeadpool 3\nRelease date: May 3, 2024 (In Theaters)\nRyan Reynolds’ “merc with the mouth” is set to appear in Disney’s first R-rated film following the company’s completed acquisition of Fox assets. Oh, and did you happen to hear that Hugh Jackman’s Wolverine is also appearing in this one? Unless you are cut off from all social media, you no doubt caught that announcement.\nDeadpool 3 writers Rhett Reese and Paul Wenick spoke with Den of Geek about how Deadpool’s move to the MCU will not affect the feel of the movie. Or, in Wernick’s words: “Deadpool’s gonna be Deadpool.” Reese also said that Disney has been more than willing to ensuring the franchise keeps its core identity. Shawn Levy (Free Guy) is directing.\nFantastic Four\nRelease date: May 2, 2025 (In theaters)\nPhase Six of the Marvel Cinematic Universe, kicks off with the MCU debut of Marvel’s most famous family. Jon Watts was scheduled to directbut he is no longer doing that—Matt Shakaman of WandaVision is now in the chair—and though we saw John Krasinski as Mr. Fantastic in Doctor Strange in the Multiverse of Madness, there’s no guarantee he returns.\nAvengers: The Kang Dynasty\nRelease date: May 1, 2026 (In theaters)\nSince neither Phase Four or Phase Five ended with Avengers movies, Phase Six will end with two, back to back. The first is The Kang Dynasty, a title which heavily suggests that Kang (Jonathan Majors) will play a major role. Destin Daniel Cretton (Shang-Chi) will direct.\nAvengers: Secret Wars\nRelease date: May 7, 2027 (In theaters)\nIt all comes down to this. Phase Six, and the whole Phase 4-6 arc of the Multiverse Saga, ends with Secret Wars. We don’t know anything about the plot other than the comics that the title is based on; Marvel veteran Michael Waldron (Loki, Doctor Strange in the Multiverse of Madness) is writing the script.\nArmor Wars\nRelease date: Unknown (In theaters)\nThis project—originally slated for a Disney+ series, but now getting the feature film treatment—will follow James Rhodes (Don Cheadle) as he tracks down stolen tech that allows criminals to replicate Iron Man technology.\nAlso: Marvel slotted several other projects for Phase Six that take place alongside Fantastic Four and the Avengers films. There are two in fall 2024, two in winter 2024, one in winter 2025, two in spring 2025 and two in summer 2025. Some of those are probably…\nUnscheduled But Probably Still Happening Shows & Movies\nMoon Knight Season 2\nRelease date: Unknown (On Disney+)\nMoon Knight himself, Oscar Isaac, was recently spotted in Egypt and teased that a second season of his show could be on the way. Marvel and Disney have yet to confirm.\nMarvel Zombies\nRelease date: Unknown (On Disney+)\nThis new animated show is loosely spun out from a breakout episode of What If? that saw MCU heroes battling a zombie apocalypse.\nSpider-Man: Freshman Year\nRelease date: Unknown (On Disney+)\nDisney says this new animated series follows Peter Parker “on his way to becoming Spider-Man in the MCU, with a journey unlike we’ve ever seen and a style that celebrates the character’s early comic book roots.”\nWhat if…? Season 2\nRelease date: Unknown (On Disney+)\nThe speculative animated series and its omnipresent narrator the Watcher will return with an all-new season. The show’s creators say next season will focus on new stories, new heroes, and “lots of fun.” Though the trailer still hasn’t been released, the Marvel Animation Panel at San Diego Comic Con revealed some Phase 4 characters that will be in the show.\nUntitled Wakanda Series\nRelease date: Unknown (On Disney+)\nNot much is known yet about this show set in Black Panther’s home country.\nUntitled Shang-Chi sequel\nRelease date: Unknown (In theaters)\nShang-Chi’s debut movie was compelling, exciting and fun. It also made a ton of money, so a sequel is inevitable. That the film’s director is making Avengers: The Kang Dynasty does throw it into limbo a bit.\nUntitled Wonder Man series\nRelease date: Unknown (On Disney+)\nMarvel Studios has announced that it’s moving ahead with a Wonder Man series. Shang-Chi and the Legend of the Ten Rings director Destin Daniel Cretton is attached to helm and Brooklyn 99 writer Andrew Guest (who also produced Hawkeye) is on board to showrun the series. On October 31, the title star was announced: genre favorite Yayha Abdul-Mateen II.\nUntitled mutants movie\nRelease date: Unknown (In theaters)\nNow that Disney owns the old Fox assets that included all the “mutant” Marvel superheroes, you can very likely count on characters like the X-Men making an MCU debut.\nWant more io9 news? Check out when to expect the latest Marvel, Star Wars, and Star Trek releases, what’s next for the DC Universe on film and TV, and everything you need to know about the future of Doctor Who."
    }
  ],
  "argos_summary": "Craig Mazin will be the sole showrunner and writer for The Last of Us season 3 after Neil Druckmann and Halley Gross depart, but he says the core writing process will stay the same.  The third season is expected to be longer than the seven‑episode second season—potentially nine episodes—to give more “bang for the buck” and fully explore Abby’s arc.  Mazin notes that he and the team have already mapped out future seasons, so the show will continue to build on the narrative groundwork laid in season 2, while keeping the tone and pacing consistent.  Production will involve alternating directors with Mazin doing a “showrunner QC” on set, and he may direct more than the premiere if logistics allow.  The series is slated to return in 2027, with plans to extend the story beyond the second game’s ending.",
  "argos_id": "5GZ91IMUE"
}