{
  "url": "https://www.reuters.com/sports/south-african-smith-eyes-cinderella-finish-fiji-finale-2025-08-25/",
  "authorsByline": "Lincoln Feast",
  "articleId": "139ee2d1f1ab4cd3a5926d621e8cc626",
  "source": {
    "domain": "reuters.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://www.reuters.com/resizer/v2/SMB6Z6JLFNLOXNSUCUMJM64Z4I.jpg?auth=25de766c0f8642dcd9c3e685cf00fa33c109cf79924477380df00083b754bd54&height=1005&width=1920&quality=80&smart=true",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-25T03:44:29.766000+00:00",
  "addDate": "2025-08-25T03:51:48.119801+00:00",
  "refreshDate": "2025-08-25T03:51:48.119802+00:00",
  "score": 1.0,
  "title": "South African Smith eyes Cinderella finish in Fiji finale",
  "description": "While Yago Dora and Molly Picklum head into the WSL finals in Fiji as top seeds and favourites for their first world titles, plenty of surf fans will be rooting for Jordy Smith as he bids for a fairytale championship after 18 years on tour.",
  "content": "Aug 25 (Reuters) - While Yago Dora and Molly Picklum head into the WSL finals in Fiji as top seeds and favourites for their first world titles, plenty of surf fans will be rooting for Jordy Smith as he bids for a fairytale championship after 18 years on tour.\n\nThe powerful regular-footer from Durban was touted as surfing's next big thing as a teenager and joined the world tour as a 19-year-old in 2008, finishing second in 2010 and 2016.\n\nA two-time Olympian, Smith enjoyed his best year on tour in 2025, finishing with two event wins and earning the men's second seeding going into the one-day, winner-takes-all finals.\n\n\"Something has changed, truly, with Jordy this year,\" former pro surfer now commentator Mitchell Salazar told the WSL's \"The Lineup\" podcast. \"I'm loving it, I've always been a huge fan of Jordy Smith, now at 37 years of age.\n\n\"If there's one person that's on tour at the moment that's deserving to be called world champ, then it's this guy ... If he does it, it's a Cinderella story.\"\n\nRaised on South Africa's long right-hand point breaks, Smith has put in the time to master his backhand tube-riding.\n\nThat will prove essential at Fiji's Cloudbreak reef, especially against Brazilian goofy-footers Dora and 2019 world champion Italo Ferreira, who will ride facing the waves, and Australian Jack Robinson, the Paris silver medallist.\n\nWhile other reef breaks such as Teahupo'o in Tahiti and Pipeline in Hawaii might pack more punch in a concentrated area, Cloudbreak's vast playing field and long sections for barrels, turns and aerials make it a favourite wave of many top surfers.\n\nThe event can take place on any day between August 27 and September 4, with long-range forecasts pointing to better conditions in the latter part of the waiting period.\n\nThe format sees the fifth and fourth seeds facing off, with the winner to face the third seed and so on until the final challenger faces the top seed. In a change this year, the top seeds can seal the championship if they win their first heat, otherwise it will go to a best-of-three match-up.\n\nPicklum dominated the back-end of the women's regular season, with a second and two wins in the final three events, including a spectacular triumph in Tahiti , giving her the advantage as top seed.\n\nThe 22-year-old Australian's top rival in recent years has been California's Caitlin Simmers, who became surfing's youngest world champion last year at 18 and goes into this year's finals ranked third.\n\nWSL pundit Dave Prodan thought Picklum's performance this year at heavy waves, including a win at the Paris Olympic venue of Teahupo'o, would make her hard to beat at Cloudbreak.\n\n\"Her positioning in the line-up, where she sets up her waves, and the line that she locks in on her backhand at Teahupo'o is second-to-none,\" Prodan said.\n\n\"I was so impressed and everyone in the channel was just blown away and I think that bodes very, very well for her title campaign at the WSL Finals in Fiji.\"",
  "medium": "Article",
  "links": [
    "https://www.reuters.com/graphics/OLYMPICS-2024/SURFING/akpeoxnyopr/",
    "https://www.reuters.com/sports/australians-picklum-robinson-claim-tahiti-pro-wins-head-fiji-finale-2025-08-14/",
    "https://www.reuters.com/sports/simmers-claims-world-surfing-title-california-hawaiis-florence-wins-his-third-2024-09-06/",
    "https://www.reutersagency.com/en/licensereuterscontent/?utm_medium=rcom-article-media&utm_campaign=rcom-rcp-lead",
    "https://www.linkedin.com/in/linkedin.com/in/lincoln-feast-90a7083b",
    "https://www.thomsonreuters.com/en/about-us/trust-principles.html",
    "https://x.com/lincolnfeast",
    "https://www.reuters.com/authors/lincoln-feast/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "recent years",
      "weight": 0.08090338
    },
    {
      "name": "last year",
      "weight": 0.080721736
    },
    {
      "name": "top seed",
      "weight": 0.08019251
    },
    {
      "name": "top seeds",
      "weight": 0.08019251
    },
    {
      "name": "year",
      "weight": 0.080100104
    },
    {
      "name": "Jordy Smith",
      "weight": 0.074947484
    },
    {
      "name": "many top surfers",
      "weight": 0.070074245
    },
    {
      "name": "world champ",
      "weight": 0.06609952
    },
    {
      "name": "South African Smith",
      "weight": 0.0635044
    },
    {
      "name": "WSL pundit Dave Prodan",
      "weight": 0.06296266
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.94482421875
    },
    {
      "name": "/Sports/International Sports Competitions/Other",
      "score": 0.69921875
    }
  ],
  "sentiment": {
    "positive": 0.2874546,
    "negative": 0.19120575,
    "neutral": 0.52133965
  },
  "summary": "South African surfer Jordy Smith is aiming for his first world title at the WSL finals in Fiji after 18 years on the tour. The top seeds are expected to be against Yago Dora and Molly Picklum, who are also favourites for their first world titles. Smith, a two-time Olympian, had his best year on tour in 2025 with two event wins and earning the men's second seeding going into the one-day winner-takes-all finals. His backhand tube-riding skills will be crucial at Fiji's Cloudbreak reef, particularly against Brazilian Dora, 2019 world champion Italo Ferreira, and Australian Jack Robinson. The format now involves fifth and fourth seeds facing off, with the winner facing the third seed.",
  "shortSummary": "Jordy Smith aims for a historic finish in the WSL finals, where he faces top seeds Yago Dora and Molly Picklum.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "2c614995ab9b48db9f2d86e36f54e8cc",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.reuters.com/graphics/OLYMPICS-2024/SURFING/akpeoxnyopr/",
      "text": "While most 2024 Olympians will be battling for glory in Paris, the world's best surfers will be going for gold 16,000km away on Tahiti, where the spinning blue barrels of Teahupo'o might be the real star of the show.\nA potent mix of beauty and brutality, Teahupo’o has been the venue for many of surfing’s most exciting contests and some of the sport’s seminal moments since it was revealed to the wider world in the 1990s.\nTeahupo'o, which loosely translates as “Pile of Heads” or “Wall of Skulls” after a gruesome local legend, was picked to stage the Olympic competition because the beaches in France are mostly flat this time of year.\nHuge winter storms in the South Pacific near New Zealand generate swells of up to 15m that travel thousands of kilometres before lurching out of the deep onto a shallow reef at “The End of the Road”, as Teahupo’o is also known.\nA map showing a string of islands in the middle of the Pacific Ocean, with the island of Tahiti at the far right and the town of Teahupo’o on the southern edge of Tahiti.\nA large trench carved by fresh water running off the jungle-clad mountains provides an incredibly close and relatively safe spot for spectator boats.\nWhile the biggest waves rise some 10m and are not as tall as those in Portugal's Nazare or Hawaii's Peahi, the explosive power, giant tubes and sheer volume of water set Teahupo'o apart as a hydrodynamic freak of nature.\nWhile Italo Ferreira and Carissa Moore carved and spun their way to gold in the murky, typhoon-churned waves of Japan's Shidashita beach for surfing’s debut at the Tokyo Olympics, Teahupo'o breaks perfectly over a coral reef and is renowned for its heavy, hollow tubes.\n“It's a totally different wave,” said Lucca Mesinas, who represented Peru in Tokyo and has also qualified for Paris 2024.\nWaves change as they near land\nWaves travel across oceans easily and become surfable only when they near shore and crash. But the shape they take is in large part a reflection of the seafloor underneath.\nA graphic showing cross sections of three waves and how the seafloor helps to create the shape of the waves as they break.:end\n“Japan was a beach break and a lot of wind. It was a really hard wave to surf. And Tahiti is just an amazing island with a perfect lefthander.”\n“It usually is barrelling, so it's a super nice wave. It can be really big too, and it can be really strong.”\n“Hosting the Olympics at Teahupo'o is the best spot they could ever pick just because it's such a good wave at that time of the year,” said local Vahine Fierro, who won the world professional tour’s Tahiti Pro in pumping waves in May.\n“It’s hard to describe - you need to live it to feel what I am talking about. But paddling into a wave as hard as you can, not knowing if you’re going to make the drop or not because it is so hollow, getting into this big blue tube that just feels like time is stopping, and then coming out with the spit of the wave in your back, into the boats that are right there - it’s just indescribable and the best feeling in the world.”\na series of photographs showing surfers at different aspects of the surfing process, the takeoff, being deep in the barrel, and wiping out.\nThe following properties are optional and can be deleted.\nThe Olympics surfing competition will take place at Teahupo’o from July 27-August 5. The schedule includes potential lay-days for when conditions are unsuitable with poor winds or if the waves are too small … or too big. A total of 48 surfers (24 men and 24 women) from 21 countries will be competing, with traditional surfing powerhouses the United States, Australia and Brazil likely to be among the medals. Host nation France will also be a strong contender with two local Tahitians in their team of four.\nSources\nFrench Hydrographic Office (SHOM); Satellite image ©2024 Maxar Technologies, Surfing video courtesy World Surf League; Reuters reporting\nAll photos by\nThomas Bevilacqua / REUTERS\nAdditional development by\nSudev Kiyada\nEdited by\nJulia Wolfe and Tom Hogue"
    },
    {
      "url": "https://www.thomsonreuters.com/en/about-us/trust-principles.html",
      "text": "The Trust Principles\nThomson Reuters is dedicated to upholding the Trust Principles and to preserving its independence, integrity, and freedom from bias in the gathering and dissemination of information and news.\nTrust Principles – the history\nThe Trust Principles were created in 1941, in the midst of World War II, in agreement with The Newspaper Proprietors Association Limited and The Press Association Limited (being the Reuters shareholders at that time). The Trust Principles imposed obligations on Reuters and its employees to act at all times with integrity, independence, and freedom from bias.\nReuters Directors and shareholders were determined to protect and preserve the Trust Principles when Reuters became a publicly traded company on the London Stock Exchange and Nasdaq. A unique structure was put in place to achieve this. A new company was formed and given the name 'Reuters Founders Share Company Limited', its purpose being to hold a 'Founders Share' in Reuters.\nThe legal structure has evolved over time and the Founders Share and other contractual arrangements now confer a number of special rights upon the Thomson Reuters Founders Share Company. For example, (i) the Thomson Reuters Founders Share Company has enhanced voting rights in circumstances where someone is seeking to obtain a significant shareholding in, or acquire control of, Thomson Reuters and (ii) the prior consent of the Thomson Reuters Founders Share Company must be sought prior to undertaking any sale of, or other material transaction involving, the Reuters news business unit.\nThomson Reuters itself is obliged and committed to apply the Trust Principles to its operations. The charter documents of Thomson Reuters Corporation include provisions to safeguard the Trust Principles as they apply to the Thomson Reuters business and require Thomson Reuters Directors, in the performance of their duties, to have due regard to the Trust Principles, by the proper exercise of their powers and in accordance with their other duties as Directors.\nThe Trust Principles are:\n- That Reuters shall at no time pass into the hands of any one interest, group, or faction;\n- That the integrity, independence, and freedom from bias of Thomson Reuters shall at all times be fully preserved;\n- That Reuters shall supply unbiased and reliable news services to newspapers, news agencies, broadcasters, and other media subscribers and to businesses, governments, institutions, individuals, and others with whom Reuters has or may have contracts;\n- That Thomson Reuters shall pay due regard to the many interests which it serves in addition to those of the media; and\n- That no effort shall be spared to expand, develop, and adapt the news and other services and products of Thomson Reuters so as to maintain its leading position in the international news and information business\nThomson Reuters Founders Share Company was established in 1984 when Reuters became a public company. The directors of Thomson Reuters Founders Share Company (known as ‘Trustees’) have a duty to ensure, to the extent possible, that the Trust Principles are complied with.\nThe Trustees are experienced and eminent people from diverse arenas in politics, diplomacy, media, public service and business. The Trustees are selected by a nomination committee and proposed to the board of the Thomson Reuters Founders Share Company for appointment. The nomination committee assists in scrutinizing candidates’ suitability and its members include two persons appointed by the chairman after consultation with the European Court of Human Rights and representatives of certain press associations. The Thomson Reuters Corporation board has two representatives on the nomination committee. The Chairman and Deputy Chairman of the Thomson Reuters Founders Share Company Board are members of the nomination committee, and the Chairman appoints three other directors of the Thomson Reuters Founders Share Company as members of the nomination committee. The Chairman of the Thomson Reuters Founders Share Company acts as chairman of the nomination committee.\nThe number of Trustees has to be at least 14 and not more than 18. Trustees have a minimum of two meetings per year, and receive reports on our activities in the different fields in which we operate (including Reuters news). The Trustees meet with both the Thomson Reuters Board and representatives of senior management. Through Thomson Reuters Founders Share Company's Chairman, regular contact is maintained with our company. The relationship is one of trust and confidence.\nIndependence of Thomson Reuters\nCustomers across the world depend on us to provide them with reliable and objective news and information.\nThis means that we have a special need to safeguard our independence and integrity and avoid any bias which may stem from control by specific individuals or interests.\nThe Thomson Reuters Trust Principles were adopted in 1941 and include the preservation of integrity, reliability of news, development of the news business, and related principles.\nToday, the Trust Principles are fundamental to our entire business.\nMore information\nContact us\nBrian Moss\nFor inquiries pertaining to Reuters reporting standards and the Trust Principles please email: brian.moss@thomsonreuters.com."
    }
  ],
  "argos_summary": "The World Surf League finals in Fiji will feature top seeds Yago Dora and Molly Picklum, with veteran Jordy Smith poised for a Cinderella run after a strong 2025 season. The event will be contested at Cloudbreak, a reef with wide, long sections ideal for barrels and aerials, and follows a knockout format that may shift to best‑of‑three if the top seed loses their first heat. Picklum’s recent victories on heavy waves, including Teahupo’o, give her a strong advantage, while Smith’s mastery of backhand tube‑riding could prove decisive against Brazilian and Australian rivals. The article also highlights Teahupo’o’s role as the Olympic surfing venue, noting its powerful, hollow waves and cultural significance in Tahiti.",
  "argos_id": "661XVYM8G"
}