{
  "url": "https://www.usatoday.com/story/money/lottery/2025/08/24/nebraska-lottery-results-winning-numbers/85811684007/",
  "authorsByline": "Jay Cannon",
  "articleId": "9ddd4df5a8f74f6fa570c2d932bc9d98",
  "source": {
    "domain": "usatoday.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "VA",
      "county": "Fairfax County",
      "city": "McLean",
      "coordinates": {
        "lat": 38.9342888,
        "lon": -77.1776327
      }
    }
  },
  "imageUrl": "https://www.usatoday.com/gcdn/authoring/authoring-images/2025/04/01/USAT/82753949007-20230711-t-211850-z-1650760054-rc-2812-a-7-gsgc-rtrmadp-3-usalottery.JPG?crop=5250,2953,x577,y0&width=3200&height=1800&format=pjpg&auto=webp",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-25T03:30:12+00:00",
  "addDate": "2025-08-25T03:36:26.870401+00:00",
  "refreshDate": "2025-08-25T03:36:26.870403+00:00",
  "score": 1.0,
  "title": "Nebraska Lottery results: See winning numbers for Pick 3, Pick 5 on Aug. 24, 2025",
  "description": "Were you a lucky winner? Check your tickets for lottery draw games in Nebraska here.",
  "content": "The Nebraska Lottery offers several draw games for those aiming to win big.\n\nLottery players in Nebraska can choose from popular national games like the Powerball and Mega Millions, which are available in the vast majority of states. Other games include Lotto America, Lucky For Life, Pick 3, Pick 5, MyDaY and 2 by 2.\n\nBig lottery wins around the U.S. include a lucky lottery ticketholder in California who won a $1.27 billion Mega Millions jackpot in December 2024. See more big winners here. And if you do end up cashing a jackpot, here’s what experts say to do first.\n\nHere’s a look at Sunday, Aug. 24, 2025 results for each game:\n\nCheck 2 By 2 payouts and previous drawings here.\n\nCheck Lucky For Life payouts and previous drawings here.\n\nWhen are the Nebraska Lottery drawings held?\n\nWinning lottery numbers are sponsored by Jackpocket, the official digital lottery courier of the USA TODAY Network.\n\nWhere can you buy lottery tickets?\n\nTickets can be purchased in person at gas stations, convenience stores and grocery stores. Some airport terminals may also sell lottery tickets.\n\nYou can also order tickets online through Jackpocket, the official digital lottery courier of the USA TODAY Network, in these U.S. states and territories: Arizona, Arkansas, Colorado, Idaho, Maine, Massachusetts, Minnesota, Montana, Nebraska, New Hampshire, New Jersey, New York, Ohio, Oregon, Puerto Rico, Washington D.C., and West Virginia. The Jackpocket app allows you to pick your lottery game and numbers, place your order, see your ticket and collect your winnings all using your phone or home computer.\n\nJackpocket is the official digital lottery courier of the USA TODAY Network. Gannett may earn revenue for audience referrals to Jackpocket services. GAMBLING PROBLEM? CALL 1-800-GAMBLER, Call 877-8-HOPENY/text HOPENY (467369) (NY). 18+ (19+ in NE, 21+ in AZ). Physically present where Jackpocket operates. Jackpocket is not affiliated with any State Lottery. Eligibility Restrictions apply. Void where prohibited. Terms: jackpocket.com/tos.\n\nThis results page was generated automatically using information from TinBu and a template written and reviewed by a USA Today editor. You can send feedback using this form.",
  "medium": "Article",
  "links": [
    "https://nelottery.com/homeapp/lotto/34/gamedetail",
    "https://www.usatoday.com/story/money/2023/07/19/powerball-how-where-buy-lottery-ticket/70430356007/",
    "https://nelottery.com/homeapp/lotto/37/gamedetail",
    "https://jkpt.sng.link/A0spb/pj93/tehs",
    "https://jackpocket.com/tos",
    "https://www.usatoday.com/story/money/lottery/2024/12/28/did-anyone-win-mega-millions-jackpot/77243200007/",
    "https://www.usatoday.com/story/money/lottery/2024/12/27/mega-millions-how-to-play-drawing-time-buying-tickets/77261084007/",
    "https://nelottery.com/homeapp/lotto/33/gamedetail",
    "https://gannett-nxuao.formstack.com/forms/website_appfeedback_automation",
    "https://nelottery.com/homeapp/lotto/32/gamedetail",
    "https://nelottery.com/homeapp/lotto/31/gamedetail",
    "https://www.usatoday.com/story/graphics/2024/04/02/states-you-can-buy-powerball-tickets-online/73118601007/",
    "https://www.usatoday.com/story/money/personalfinance/2024/12/26/what-to-do-mega-miliions-jackpot-winner/77238184007/",
    "https://nelottery.com/",
    "https://puzzles.usatoday.com/",
    "https://www.usatoday.com/lottery/",
    "https://www.usatoday.com/lottery/us-ne",
    "https://www.usatoday.com/picture-gallery/money/lottery/2024/01/02/powerball-jackpot-winners-through-the-years/72083222007/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Winning lottery numbers",
      "weight": 0.10300014
    },
    {
      "name": "lottery tickets",
      "weight": 0.10264461
    },
    {
      "name": "Big lottery wins",
      "weight": 0.090996884
    },
    {
      "name": "Lottery players",
      "weight": 0.088803016
    },
    {
      "name": "Nebraska Lottery",
      "weight": 0.08043105
    },
    {
      "name": "popular national games",
      "weight": 0.07691985
    },
    {
      "name": "several draw games",
      "weight": 0.076761104
    },
    {
      "name": "Jackpocket services",
      "weight": 0.07479122
    },
    {
      "name": "winning numbers",
      "weight": 0.07463093
    },
    {
      "name": "Jackpocket",
      "weight": 0.07304193
    }
  ],
  "topics": [
    {
      "name": "Lottery"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/Games/Gambling/Lottery",
      "score": 0.382568359375
    }
  ],
  "sentiment": {
    "positive": 0.18132153,
    "negative": 0.12105187,
    "neutral": 0.6976266
  },
  "summary": "The Nebraska Lottery offers several draw games, including Powerball and Mega Millions, and Lotto America. Tickets can be purchased in person at gas stations, convenience stores, and grocery stores. Online tickets can also be ordered through Jackpocket, the official digital lottery courier of the USA TODAY Network. The winning lottery numbers are sponsored by the company. If you ever win, check out the results on Sunday, Aug. 24, 2025.",
  "shortSummary": "The Nebraska Lottery offers various draw games, including Pick 3, Pick 5, and 2 By 2, with winners announced via Jackpocket, which is offering free online options.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "fda7e362d31147bd82f01c938eedb366",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.usatoday.com/story/money/lottery/2024/12/27/mega-millions-how-to-play-drawing-time-buying-tickets/77261084007/",
      "text": "How do you play Mega Millions? What to know about buying tickets, picking numbers\nMega Millions players could ring in the new year as a billionaire if the odds are in their favor.\nJust a few hours away of the Friday, Dec. 27 drawing, the jackpot is worth an estimated $1.22 billion. If the lucky winner chooses the cash option, they can take home $549.7 million, the lottery said.\nThe last time someone won a Mega Millions jackpot was back in September. A Texas player won the $810 million prize. Another lucky player won $1.128 billion in March. On Dec. 23, the New Jersey player claimed their prize. The largest lottery jackpot in Mega Millions history was a $1.602 billion prize from one winning ticket in Florida in August 2023.\nWith the jackpot continuing to rise, more people are trying their luck at the game. If no one wins tonight's jackpot, the grand prize will continue to grow until a winner is declared.\nReady to try your luck? Here's a guide on how to play Mega Millions.\nWhat time is the Mega Millions drawing?\nMega Millions drawings are every Tuesday and Friday at 11 p.m. ET. The next drawing is Friday, Dec. 27.\nWinning lottery numbers are sponsored by Jackpocket, the official digital lottery courier of the USA TODAY Network.\nWhat are the top 10 Mega Millions jackpots?\nAccording to the lottery, the following jackpots are the top 10 jackpots that have been won as of Dec. 27:\n- $1.602 billion, Aug. 8, 2023; a Florida player\n- $1.537 billion, Oct. 23, 2018; a South Carolina player\n- $1.348 billion, Jan.13, 2023; a Maine player\n- $1.337 billion, July 29, 2022; an Illinois player\n- $1.128 billion, March 26, 2024; a New Jersey player\n- $1.050 billion, Jan. 22, 2021; a Michigan player\n- $810 million, Sept. 10, 2024; a Texas player\n- $656 million, March 30, 2012; a player from Illinois, Kansas and Maryland\n- $648 million, Dec. 17, 2013; a player from California and Georgia\n- $552 million, June 4, 2024; an Illinois player\nHow to play Mega Millions\nMega Millions tickets cost $2 per play.\nTo play, pick six numbers from two separate pools of numbers: either five different numbers from 1-70 for the white numbers, and one number from 1-25 for the gold Mega Ball.\nYou win the Mega Millions jackpot by matching your numbers to all six numbers pulled in the drawing.\nIf you don't want to pick your own numbers or if you'd rather leave it up to chance, the Mega Millions has a random number generator on its website, where a computer will randomly generate options for white balls and a Mega Ball.\nPlayers can add the \"Megaplier\" for $1 which can increase non-grand prize winnings by two, three, four or five. The Megapiler is drawn before the Mega Millions numbers on Tuesday and Friday.\nThere are 15 Megapiler balls in all:\n- 2X, five balls\n- 3X, six balls\n- 4X, three balls\n- 5X, one ball\nWhat is the Megaplier?\nMost states offer the Megaplier feature, a multiplier which increases non-jackpot prizes by two, three, four and five times.\nIt costs an additional $1 per play. Before each regular Mega Millions drawing, the Megaplier is drawn. From a pool of 15 balls, five are marked with \"2X,\" three with \"4X\" and one with \"5X.\"\nWhat are the odds of winning the Mega Millions?\nYour odds of winning the Mega Millions jackpot are pretty slim: Just 1 in 302,575,350, according to the lottery.\nThe odds of winning the smaller, $1 million prize are 1 in 12,607,306.\nWhere to buy Mega Millions tickets\nTickets can be purchased in person at gas stations, convenience stores and grocery stores. Some airport terminals may also sell lottery tickets.\nYou can also order tickets online through Jackpocket, the official digital lottery courier of the USA TODAY Network, in these U.S. states and territories: Arizona, Arkansas, Colorado, Idaho, Massachusetts, Minnesota, Montana, Nebraska, New Hampshire, New Jersey, New Mexico, New York, Ohio, Oregon, Puerto Rico, Texas, Washington D.C. and West Virginia. The Jackpocket app allows you to pick your lottery game and numbers, place your order, see your ticket and collect your winnings all using your phone or home computer.\nJackpocket is the official digital lottery courier of the USA TODAY Network. Gannett may earn revenue for audience referrals to Jackpocket services. Must be 18+, 21+ in AZ and 19+ in NE. Not affiliated with any State Lottery. Gambling Problem? Call 1-877-8-HOPE-NY or text HOPENY (467369) (NY); 1-800-327-5050 (MA); 1-877-MYLIMIT (OR); 1-800-981-0023 (PR); 1-800-GAMBLER (all others). Visit jackpocket.com/tos for full terms."
    },
    {
      "url": "https://www.usatoday.com/story/graphics/2024/04/02/states-you-can-buy-powerball-tickets-online/73118601007/",
      "text": "Can you buy Powerball tickets online? These are the states that allow it\nI used to think I was clever passing up convenience-store or gas-station lines by buying Powerball or Mega Millions tickets at my local grocery store. People rarely stood in front of the big lottery machine, which quickly gobbled down my dollars and spat out my tickets.\nBut then I started thinking: \"My state offers online sports betting now. Can I also buy lottery tickets online?\"\nThe answer: Yes, it does let me buy lottery tickets online.\nBut online lottery options aren't as common as it might seem. There's a way to play or purchase tickets online in just over half the 45 states that offer Powerball and Mega Millions.\nStates where you can buy Powerball and Mega Millions tickets online\nUnable to view our graphics? Click here to see them.\nWhy I purchase Powerball tickets online now\nMany state legislatures clearly recognize the value to retailers of extra shoppers buying lottery tickets – especially when jackpots grow over $1 billion as Powerball is now.\nBut for someone like me who is allergic to standing in lines and wants control of his number selection, the retail environment is not for me. And, yes, I understand how terrible the odds are for anyone playing Powerball or Mega Millions – regardless of how much I think I'm gaming the game.\nBesides being convenient, online lotteries let you visit several websites, including ours to make a slightly more educated guesses about which numbers might win.\nNote: Several states that don't offer online purchases do have apps that allow you to select your numbers. Those numbers can be transmitted to lottery machines or a cashier when purchasing your tickets.\nState lotteries where you can play Powerball and Mega Millions\nThe map above seems simple enough, but only 10 states' lotteries actually allow online purchases. Click on any of the 10 boxes below to visit the states' online web sites.\nWhere can you buy lottery tickets from lottery couriers\nIf your state's lottery doesn't offer an online option, a few other businesses such as Jackpocket and TheLotter are filling that void in 18 other places. Click on one of the blue boxes below to visit their sites.\nJackpocket, the official digital lottery courier of the USA TODAY Network, operates in 16 states (above), Washington D.C. and Puerto Rico. While using your phone or home computer, both companies let you to pick your lottery game and numbers, place your order, see your ticket and collect your winnings.\nRemember your odds are are impossibly high to win either jackpot: 1 in 302.6 million for the Mega Millions and 1 in 292.2 million for Powerball. But if you spend a little time curating your numbers for your online purchase, maybe you'll be able to dream a little bigger before the next draw.\nJackpocket is the official digital lottery courier of the USA TODAY Network. Gannett may earn revenue for audience referrals to Jackpocket services. Must be 18+, 21+ in AZ and 19+ in NE. Not affiliated with any State Lottery. Gambling Problem? Call 1-877-8-HOPE-NY or text HOPENY (467369) (NY); 1-800-327-5050 (MA); 1-877-MYLIMIT (OR); 1-800-GAMBLER (all others). Visit jackpocket.com/tos for full terms and conditions."
    },
    {
      "url": "https://www.usatoday.com/story/money/lottery/2024/12/28/did-anyone-win-mega-millions-jackpot/77243200007/",
      "text": "Lucky ticket sold in California can claim $1.22 billion Mega Millions jackpot\nA lucky lottery ticketholder in California holds the winning ticket from Friday night's drawing for the $1.22 billion Mega Millions jackpot.\nA winning ticket sold in Cottonwood, Calif., means a fine finish to the winner's 2024 as the Mega Millions jackpot, estimated at $1.22 billion, has a cash option payout of $549.7 million, according to the lottery.\nThe winning of the fifth-largest Mega Millions jackpot in history comes in a year which had seen the least amount of jackpot winners in a calendar year, with only three jackpot winners so far. The last one was in Texas on Sept. 10, when a lucky person won a $552 million jackpot.\nFriday's drawing also yielded five $1 million winners, the lottery said.\n“Congratulations to our $1.22 billion jackpot winner from California,” said Joshua Johnston, lead director for the Mega Millions Consortium, in a press release. “At an incredibly special time of year, this is both an incredibly special moment for our winner, and for all the great organizations and causes that benefit from lottery ticket sales around the country. Thank you to everyone who plays. Because of you, we have winners all around the country taking home cash prizes both big and small, and we have educational causes, parks and many other great organizations benefiting as well.”\nHere is the other information about Friday’s drawing.\nDid anyone win the Mega Millions?\nYes, a winning ticket for the $1.22 billion jackpot was sold in Cottonwood, Calif., a town of about 6,300 located 200 miles north of San Francisco.\nThe ticket was purchased at Sunshine Food and Gas at 3505 Rhonda Road, according to the California Lottery.\nTo view the list of past winners, visit the Mega Millions website.\nMega Millions winning numbers for 12/27/24\nThe winning numbers from the Friday, Dec. 27 Mega Millions drawing were white ball numbers 3, 7, 37, 49 and 55, plus the gold Mega Ball 6 and a multiplier of 3X, the lottery said.\nWinning lottery numbers are sponsored by Jackpocket, the official digital lottery courier of the USA TODAY Network.\nHow to play the Mega Millions\nTo play the Mega Millions, you have to buy a ticket. You can do this at a variety of locations, including your local convenience store, gas station, or even grocery store. In some states, Mega Millions tickets can be bought online.\nOnce you have your ticket, you need to pick six numbers. Five of them will be white balls with numbers from 1 to 70. The gold Mega Ball ranges from 1 to 25.\nIf you’re feeling especially unlucky, or don’t want to go through the hassle of picking, you can ask for a \"Quick Pick\" or an \"Easy Pick.” These options let the computer randomly generate numbers for you.\nFor an extra dollar, players can add the “Megaplier,” which increases non-jackpot prizes by two, three, four, or five times. The Megaplier is drawn before six Mega Millions numbers are drawn.\nThere are 15 Megapiler balls in all:\n- 2X, five balls\n- 3X, six balls\n- 4X, three balls\n- 5X, one ball\nWhere can you buy lottery tickets?\nTickets can be purchased in person at gas stations, convenience stores and grocery stores. Some airport terminals may also sell lottery tickets.\nYou can also order tickets online through Jackpocket, the official digital lottery courier of the USA TODAY Network, in these U.S. states and territories: Arizona, Arkansas, Colorado, Idaho, Maine, Massachusetts, Minnesota, Montana, Nebraska, New Hampshire, New Jersey, New Mexico, New York, Ohio, Oregon, Puerto Rico, Texas, Washington, D.C., and West Virginia. The Jackpocket app allows you to pick your lottery game and numbers, place your order, see your ticket and collect your winnings all using your phone or home computer.\nJackpocket is the official digital lottery courier of the USA TODAY Network. Gannett may earn revenue for audience referrals to Jackpocket services. Must be 18+, 21+ in AZ and 19+ in NE. Not affiliated with any State Lottery. Gambling Problem? Call 1-877-8-HOPE-NY or text HOPENY (467369) (NY); 1-800-327-5050 (MA); 1-877-MYLIMIT (OR); 1-800-981-0023 (PR); 1-800-GAMBLER (all others). Visit jackpocket.com/tos for full terms.\nFernando Cervantes Jr. is a trending news reporter for USA TODAY. Reach him at fernando.cervantes@gannett.com and follow him on X @fern_cerv_."
    },
    {
      "url": "https://jkpt.sng.link/A0spb/pj93/tehs",
      "text": "Sign Up for Jackpocket!\nNew customers, sign up for Jackpocket and claim $10 in Lottery Credits\nGame of the Day\nPowerball\n$750,000,000\nDrawing Monday 10:59 PM\nCut-Off Time: 8:30 PM\n--:--\nCut-Off Time: 8:30 PM\n--:--\nScratch Games\nView All\n$200 Frenzy\n$200\nPrice\n$5\n$250,000 DEUCE$ WILD POKER\n$250,000\nPrice\n$10\n$250,000 Golden Casino\n$250,000\nPrice\n$10\n100X\n$250,000\nPrice\n$10\n200X\n$1,000,000\nPrice\n$20\n$200 Frenzy\n$200\nPrice\n$5\n$250,000 DEUCE$ WILD POKER\n$250,000\nPrice\n$10\n$250,000 Golden Casino\n$250,000\nPrice\n$10\n100X\n$250,000\nPrice\n$10\n200X\n$1,000,000\nPrice\n$20\nUpcoming Draw Games\nView All\nCut-Off Time: 8:30 PM\n--:--\nCut-Off Time: 8:30 PM\n--:--\nCut-Off Time: 8:30 PM\n--:--\nCut-Off Time: 8:30 PM\n--:--\nCut-Off Time: 8:30 PM\n--:--\nCut-Off Time: 8:30 PM\n--:--\nCut-Off Time: 8:30 PM\n--:--\nCut-Off Time: 8:30 PM\n--:--\nCut-Off Time: 8:30 PM\n--:--\nCut-Off Time: 8:30 PM\n--:--\nCut-Off Time: 8:30 PM\n--:--\nCut-Off Time: 8:30 PM\n--:--\nExplore More\nMore than $3.5 billion of lottery sales have gone to preserve and protect Colorado's outdoors.\nInfo provided by coloradolottery.com\nEnvironmental Funds\nColorado Schools"
    },
    {
      "url": "https://www.usatoday.com/lottery/",
      "text": "Some Cracker Barrel customers are saying 'no, thank you' to new logo\nGraphics\nNo evidence of shootings at Villanova, University of South Carolina: Officials\nNation\nShilo Sanders, son of Deion Sanders, cut by Tampa Bay Buccaneers\nTampa Bay Buccaneers\nTrump says he could 'rethink' funds for Baltimore bridge repair\nPolitics\nChris Christie says Ghislaine Maxwell's praise of Trump is phony\nPolitics\nRaja Jackson allegedly attacks wrestler during show\nMMA\nThe next generation of hurricane hunters: Sharks. We explain.\nGraphics\nHere's how these 6 Americans became 401(k) millionaires\nMoney\nSpaceX scrubs critical Starship launch due to 'ground systems' issue\nNation\nNorman Reedus' son Mingus Reedus arrested for alleged assault\nCelebrities\nTropical Storm Fernand forms in the Atlantic. Where is it heading?\nWeather"
    },
    {
      "url": "https://www.usatoday.com/story/money/2023/07/19/powerball-how-where-buy-lottery-ticket/70430356007/",
      "text": "First time playing the Powerball? Here's exactly how to ask the cashier for a ticket.\nThe Powerball jackpot continues to grow, reaching an estimated $1 billion ahead of the next drawing Wednesday night.\nThe current jackpot is the seventh largest U.S. lottery jackpot and third largest Powerball jackpot ever, according to lottery officials. It is second only to the $2.04 billion Powerball jackpot won in 2022 and the $1.586 billion Powerball jackpot, which was won in 2016.\nWhile there are regular Powerball players, a giant jackpot seems to get new players flocking to retailers to buy tickets – and they may not know what to say or how to play. We're here to help.\nHere’s everything to know before stopping by your local store to buy a ticket.\nFeeling Lucky? Explore the Latest Lottery News & Results\nHow do you ask the cashier for a Powerball ticket?\nBuying a Powerball ticket can be a simple process if you know what you're doing.\nTo buy a ticket in-person, you can either ask for a \"Quick Pick\", where a computer will generate numbers randomly, or you can pick the numbers yourself. The cashier will also ask about \"power play.\" For an extra dollar, you may choose to \"power play,\" which multiplies all non-grand prize winnings by a factor of 2, 3, 4, 5 or 10.\nFor \"Quick Pick,\" say this: \"I'd like a quick pick Powerball ticket.\" Then tell the cashier whether you want the multiplier or \"power play.\"\nTo pick your own numbers, say this: \"I'd like a Powerball ticket and I will pick my numbers.\"\nWith this option, you will fill out a playslip with your selections. Slips may also be up for grabs on the store floor, so you could fill it out before approaching the cashier. You will need to pick six Powerball numbers total: Five numbers between 1-69 and the Powerball number, which is one number between 1-26. Hand your slip to the cashier and you will receive a printout of those numbers. Again, you can choose to \"power play\" or not.\nNeed help choosing numbers? These are the most commonly drawn numbers.\nThe Powerball also offers \"double play,\" an add-on feature with a cash prize up to $10 million. For an additional $1 per play, \"double play\" gives players in select jurisdictions another chance to match Powerball numbers in a separate drawing, which happens after the regular Powerball drawing.\nHow much are Powerball tickets?\nPowerball tickets are $2 per play.\nThe \"power play\" is an additional $1 per play, and can multiply non-jackpot prizes by 2, 3, 4, 5 or 10 times. \"Double play\" is also an additional $1 per play if selected, thus a single ticket could cost $4 if the player adds both \"power play\" and \"double play.\"\nThere are 23 states where it's allowed to buy lottery tickets with a credit card, according to NerdWallet. The other 22 states that offer the lottery can vary in what they accept for payment, from only cash to debit cards, gift cards and more. If you're unsure, check the rules for your specific state or territory.\nHow do you play Powerball? A beginner's guide to Powerball rules and potential prizes.\nHow late can you buy a Powerball ticket tonight?\nDepending on the selling jurisdiction, sales for Powerball tickets may cut off one to two hours before the drawing. Drawings are held at 10:59 p.m. ET every Monday, Wednesday and Saturday.\nHow do you find out if you won?\nFirst, remember to watch the Powerball drawing live, which is broadcast from the Florida Lottery draw studio in Tallahassee. Some local stations will air the drawings live, so check your local listings.\nYou can also stream it live on Powerball's website or watch clips on their YouTube channel.\nIf you aren't able to watch a drawing, you can always check your numbers on the Powerball's website. Enter the date range of your drawing and your numbers to see if there was a match. The Powerball will only show numbers that have won a prize.\nWhere can you buy lottery tickets?\nTickets can be purchased in-person at gas stations, convenience stores and grocery stores. Some airport terminals may also sell lottery tickets.\nYou can also order tickets online through Jackpocket, the official digital lottery courier of the USA TODAY Network, in these U.S. states: Arizona, Arkansas, Colorado, Idaho, Massachusetts, Minnesota, Montana, Nebraska, New Hampshire, New Jersey, New Mexico, New York, Ohio, Oregon, Texas, Washington D.C. and West Virginia. The Jackpocket app allows you to pick your lottery game and numbers, place your order, see your ticket and collect your winnings all using your phone or home computer.\nJackpocket is the official digital lottery courier of the USA TODAY Network. Gannett may earn revenue for audience referrals to Jackpocket services. Must be 18+, 21+ in AZ and 19+ in NE. Not affiliated with any State Lottery. Gambling Problem? Call 1-877-8-HOPE-NY or text HOPENY (467369) (NY); 1-800-327-5050 (MA); 1-877-MYLIMIT (OR); 1-800-GAMBLER (all others). Visit jackpocket.com/tos for full terms and conditions.\nHow much is the Powerball jackpot taxed? Why winning numbers don't guarantee $1 billion"
    },
    {
      "url": "https://www.usatoday.com/story/money/personalfinance/2024/12/26/what-to-do-mega-miliions-jackpot-winner/77238184007/",
      "text": "'Keep it quiet:' Here's what to know and do if you win the Mega Millions jackpot\nWhether you bought a ticket yourself or got some as a stocking stuffer, could that $1.15 billion Mega Millions jackpot have your name on it? The odds may be against you − like 1 in 302.6 million − but that doesn't mean you can't prepare.\nIf there is a winner, Mega Millions jackpot would be the fifth-largest jackpot in Mega Millions history, making the take-home prize a lump-sum payment of an estimated $516.1 million after taxes. How do you even begin to get ready for a windfall like that?\nThe \"smartest thing\" you can do, in the event that you do win, is keep calm and carry on, financial advisers shared with USA TODAY back in March. And avoid posting any and all details of your win on social media.\n\"If you’re lucky enough to win the lottery, keep it quiet,\" Rob Burnette, an Ohio-based financial adviser at Outlook Financial Center. \"Get organized and make a plan. Consider staying anonymous, if it’s a possibility.”\nWho, if anyone, do I tell about my Mega Millions win?\nIf you find yourself in a situation where you stand to inherit millions of dollars, the best people to get in touch with financial experts right off the bat so scammers don't get the chance to bleed you dry before you even get the chance to cash in.\n\"Crooks usually try to get you to wire money for 'taxes' or 'fees,' or may try to get you to provide them with a bank account number, which they will then clean out,\" Mega Millions said. \"No real lottery tells winners to put up their own money in order to collect a prize they have already won.\"\nNo Mega Millions representative would ever call, text, or e-mail anyone about winning a prize so be especially wary of who contact you out of the blue. In certain states, you can remain anonymous if you win.\nSteve Azoury, owner of Azoury Financial in Troy, Michigan, who has advised many lottery winners, including a $181 million winner \"who said ‘If I didn’t know you before, I don’t want to know you now.’”\nSpend your money smarter: Sign up for USA TODAY's Daily Money newsletter.\n\"Get a tax attorney and a tax accountant right off the bat and then a financial adviser,” according to Azoury. “They’ll work hand in hand to figure out the plan.”\nThe \"plan\" will help you get some things squared away, such as whether you will opt to take an immediate cash payout, or if you'd prefer the cash distributed over time.\nThe difference between the two is outlined below:\n- An annuity option makes an initial annual payment followed by 29 annual payments. Each payment is 5% larger than the previous one.\n- The cash option is a one-time, lump-sum payment equal to all the cash in the jackpot prize pool. At Tuesday's drawing, it's $413.5 million.\nThe decision, though, will likely depend on your goals, your age, and what lottery rules are for beneficiaries to continue receiving payments, or if you’d likely squander a lump sum. The size of the lottery winning as well as your current and projected earnings are some things to consider, according to Mark Steber, chief tax officer at Jackson Hewitt.\nYour financial expert, or experts can also help you find a \"fall guy,\" a person or adviser \"who keeps you from giving loans to anybody, who tells people all the money’s tied up in investments, not available,\" Azoury said. \"We have nothing available to help you out, and we’re not interested in your project.”\nHow do I decide what to do with my Mega Millions win?\nOnly you and your financial adviser, or advisers can help you figure out the best way to protect you and your money.\nMost people won't claim their prize right away, taking some time to figure out a plan that's right for them. Mega Millions claim periods, which ranges from 90 days to one year from the drawing date, varies from state to state.\n\"Winning tickets must be redeemed in the state in which they were purchased, but lotteries typically have a claim-by-mail option for most prize levels,\" Mega Millions said.\nBut it might be in your best interest to \"park\" the earnings until you are able to hire and meet with a financial adviser, tax accountant and attorney that's right for you.\n\"One suggestion would be putting your winnings in a brokerage account, as many brokerage firms can spread the cash deposits across multiple banks,\" according to Azoury. \"Within one brokerage account, up to $4 million can be insured, if single, and up to $8 million can be insured on a joint account.\"\nHow much of my Mega Millions win will I take home? And when do I get it?\nThe exact amount you stand to net will vary, depending on the state you win the Mega Millions jackpot in. Lottery-related regulations and laws are different from state to state. While there is no hard and fast timeframe for the claimed prize to make its way to you, it shouldn't take more than a \"couple of weeks,\" Azoury said.\nYou’ll likely be propelled into the highest federal tax bracket, if you win the lottery. The state where you live and the place where you bought the winning ticket can greatly impact what you pay in taxes and how many, if any other states you will have to file taxes in.\nCalifornia is one a dozen states, including Alaska, Delaware, Florida, Nevada, New Hampshire, South Dakota, Tennessee, Texas, Washington and Wyoming, that does not tax lottery winnings.\n“This is where a tax professional really comes in handy,” Steber says. “State taxes can be very tricky.\nWhen is the next Mega Millions drawing? And how do I play?\nThe next drawing, where the winning numbers for the $1.15 billion jackpot will be determined, is Friday, Dec. 27 at 11 p.m. ET. Mega Millions drawings take place every Tuesday and Friday at 11 p.m. ET. Tickets are available up to 15 minutes before the drawing takes place.\nIn order to win the jackpot, you must match all six winning numbers in a drawing. That being said, players may pick up to six numbers from two separate number pools.\nFive of the numbers will come from white balls whose numbers range between 1 to 70 and the last number will come from the gold Mega Ball whose numbers range between 1 and 25. Players may also select the \"Easy Pick\" or \"Quick Pick\" options, which will have the computer randomly generate six-number sequence.\nThe \"Megaplier,\" a $1 add-on feature, that can increase non-jackpot prizes by 2, 3, 4 or 5 times. Before each regular Mega Millions drawing, the Megaplier is drawn. From a pool of 15 balls, six are marked with \"3X,\" five are marked with \"2X,\" three with \"4X\" and one with \"5X.\"\nWhere can I buy lottery tickets?\nLottery tickets can be found and purchased from local convenience stores, gas stations, grocery stores or purchased online − in a handful of states. Some airport terminals may even sell lottery tickets, too.\nYou can also order tickets online through Jackpocket, the official digital lottery courier of the USA TODAY Network, in these U.S. states and territories: Arizona, Arkansas, Colorado, Idaho, Maine, Massachusetts, Minnesota, Montana, Nebraska, New Hampshire, New Jersey, New Mexico, New York, Ohio, Oregon, Puerto Rico, Texas, Washington, D.C., and West Virginia. The Jackpocket app allows you to pick your lottery game and numbers, place your order, see your ticket and collect your winnings all using your phone or home computer.\nJackpocket is the official digital lottery courier of the USA TODAY Network. Gannett may earn revenue for audience referrals to Jackpocket services. Must be 18+, 21+ in AZ and 19+ in NE. Not affiliated with any State Lottery. Gambling Problem? Call 1-877-8-HOPE-NY or text HOPENY (467369) (NY); 1-800-327-5050 (MA); 1-877-MYLIMIT (OR); 1-800-981-0023 (PR); 1-800-GAMBLER (all others). Visit jackpocket.com/tos for full terms.\nContributing: Emily DeLetter and Fernando Cervantes; USA TODAY"
    },
    {
      "url": "https://www.usatoday.com/lottery/us-ne",
      "text": "Some Cracker Barrel customers are saying 'no, thank you' to new logo\nGraphics\nNo evidence of shootings at Villanova, University of South Carolina: Officials\nNation\nShilo Sanders, son of Deion Sanders, cut by Tampa Bay Buccaneers\nTampa Bay Buccaneers\nTrump says he could 'rethink' funds for Baltimore bridge repair\nPolitics\nChris Christie says Ghislaine Maxwell's praise of Trump is phony\nPolitics\nRaja Jackson allegedly attacks wrestler during show\nMMA\nThe next generation of hurricane hunters: Sharks. We explain.\nGraphics\nHere's how these 6 Americans became 401(k) millionaires\nMoney\nSpaceX scrubs critical Starship launch due to 'ground systems' issue\nNation\nNorman Reedus' son Mingus Reedus arrested for alleged assault\nCelebrities\nTropical Storm Fernand forms in the Atlantic. Where is it heading?\nWeather"
    },
    {
      "url": "https://jackpocket.com/tos",
      "text": "Jackpocket Terms of Service\nLast Modified: June 24, 2025\nTHESE TERMS AND CONDITIONS ARE SUBJECT TO A WAIVER OF TRIAL BY JURY.\nThese terms and conditions (\"Terms of Service\") govern your use of the Application (as defined below) as provided by Jackpocket LLC (\"Jackpocket,\" the \"Company,\" \"We\" or \"Us\"). These Terms of Service are a binding legal agreement between you and Jackpocket. Jackpocket may change these Terms of Service at any time without notice to you by posting the revised Terms of Service with the date they were revised.\nWhen ordering a lottery ticket through Jackpocket, you are placing an order for a lottery ticket and not purchasing a lottery ticket directly. As a service provider and acting on your behalf, Jackpocket will fulfill that order through a licensed lottery retailer in the jurisdiction where the order was placed.\nIMPORTANT LEGAL NOTICE: PLEASE READ THESE TERMS OF SERVICE CAREFULLY AS THEY AFFECT YOUR LEGAL RIGHTS AND OBLIGATIONS. JACKPOCKET LLC IS NOT AFFILIATED, OR ENDORSED BY ANY STATE LOTTERY OR GOVERNMENT AGENCY. IF YOU DO NOT AGREE TO THESE TERMS OF SERVICE IN THEIR ENTIRETY, DO NOT ACCESS OR USE THE SERVICE.\n1. Defined Terms\nFor the purpose of these Terms of Service:\n2. User Agreement\nBy accessing the Application, creating an account via the Application (an \"Account\"), or clicking to accept or agree to these Terms of Service when this option is made available to you, you hereby (a) acknowledge that you have read and agree to be bound to and abide by these Terms of Service; (b) represent and warrant that you are eligible to access the Application and are authorized and able to accept these Terms of Service; and (c) acknowledge that you have read Jackpocket's Privacy Policy, available at https://myaccount.jackpocket.com/documents/lottery-privacy-policy, and agree that Jackpocket may collect, process, store, and disclose your information consistent with such policy. If you do not wish to be bound by these Terms of Service, you must not access or use the Application. By declining to accept these Terms of Service, you will be unable to create an Account or access or use the Application.\nWe reserve the right to change these Terms of Service at any time without prior notice to you. If we make what we determine to be material changes to these Terms of Service, we will notify you by prominently posting a notice or by sending a notice to the e-mail address on file. It is your obligation to provide us with notice of any change to your e-mail address by sending us notice immediately to support@jackpocket.com. Your continued use of the Application following any changes constitutes your affirmative consent to the changes. If you do not agree to the changes, your sole remedy is to cease using the Application and close your Account. You can permanently close your Account at any time for any reason by e-mailing support@jackpocket.com or through the Login & Security tab of the Account Information page. You are expected to check this page each time you access the Application so you are aware of any changes, as they are binding on you.\n3. Eligibility\nIn order to create an Account, order Tickets and/or claim prizes on the Application, you must, at the time of registration:\nIf you reside in a Jurisdiction that requires you to be nineteen (19) or twenty-one (21) years of age or older to participate in a Lottery, you must adhere to that Jurisdiction's laws in order to use the Application. If you do not meet all of these requirements, you must not access or use the Application. Jackpocket reserves the right to verify your age and/or identity and eligibility at any time. Any failure to cooperate with Jackpocket in this respect may result in the suspension and/or termination of your Account. Eligibility determinations are made by Jackpocket, in its sole discretion.\nBY ACCESSING OR USING THE APPLICATION, YOU REPRESENT AND WARRANT THAT YOU HAVE THE RIGHT, AUTHORITY AND CAPACITY TO ENTER INTO THIS AGREEMENT, TO ABIDE BY ALL OF THESE TERMS OF SERVICE, THAT YOU ARE NOT PROHIBITED OR RESTRICTED FROM ACCESSING OR USING THE APPLICATION, AND THAT YOU MEET ALL OF THE ELIGIBILITY REQUIREMENTS SET FORTH ABOVE. THE COMPANY MAKES NO REPRESENTATIONS OR WARRANTIES, IMPLICIT OR EXPLICIT, AS TO YOUR LEGAL RIGHT TO ACCESS OR USE THE APPLICATION AND NO PERSON AFFILIATED, OR CLAIMING AFFILIATION, WITH JACKPOCKET SHALL HAVE AUTHORITY TO MAKE ANY SUCH REPRESENTATIONS OR WARRANTIES. JACKPOCKET DOES NOT INTEND FOR THE APPLICATION TO BE USED BY PERSONS PRESENT IN JURISDICTIONS IN WHICH PARTICIPATION IS PROHIBITED OR RESTRICTED. YOU AGREE THAT THE AVAILABILITY OF THE APPLICATION DOES NOT CONSTITUTE AN OFFER, SOLICITATION OR INVITATION BY JACKPOCKET FOR THE USE OF THE APPLICATION IN ANY JURISDICTION IN WHICH SUCH ACTIVITIES ARE PROHIBITED OR RESTRICTED. JACKPOCKET RESERVES THE RIGHT TO DENY ACCESS TO THE APPLICATION TO ANYONE AT ITS SOLE DISCRETION.\n4. User Accounts\nh. Account Termination. Your Account may be suspended or terminated and prize funds may be returned to the Regulator, if applicable, for:\nIn the event of Account suspension, Jackpocket may, in its sole discretion, restrict all Account functionality, including but not limited to orders (including, without limitation, Smart Orders or pre-paid orders), claims, Account Funding and withdrawals. Registered Users of Accounts for which suspension escalates to Account termination may be subject to forfeiture of prizes awarded for Winning Tickets back to the Regulator, and will be permanently restricted from using this Application in any capacity. Jackpocket may also restrict any person or entity found to be using or attempting to be using the Application fraudulently, or with intent to commit fraud, disrupt the Application, or create harm to Jackpocket, its Users, or any third party, including for research or any other purpose outside of the stated purposes of the Application.\nUsers can also unsubscribe from the Application. To unsubscribe from the Jackpocket Application and de-activate your Account, by e-mailing support@Jackpocket.com or through the Login & Security tab of the Account Information page. You will need to delete the Application to complete the process. Jackpocket is under no obligation to permanently delete any data except as otherwise may be set forth in our Privacy Policy. USERS CANNOT DEACTIVATE THEIR ACCOUNT IF THEY HAVE ANY PENDING OR IN-PROCESS FUND REQUESTS OR IF THEIR ACCOUNT IS ALREADY LOCKED.\n5. Account Funding, Orders and Withdrawals\nExcept for Lottery Credits, you may withdraw funds from your Account at any time. Except for Lottery Credits, funds from your Account can be withdrawn to a bank account and will usually take 3-5 business days to complete, but may take longer due to unusual circumstances. If you do not receive your funds within 5 business days of your withdrawal request, please contact support@Jackpocket.com for additional assistance. In the event of the death of a Jackpocket User, all available funds in your Account, with the exception of Lottery Credits, will be paid in accordance with these Terms of Service, to the Executor or similarly functioning representative under his/her last will and testament or, if there is no will, in accordance with the laws of the state of his/her legal residence. Jackpocket may, in its sole discretion, require proof and documentation to establish that the User is deceased and the individual or entity claiming the funds in an Account is entitled to them before paying such funds.\nEach time you use the Application to fund your Account with a single transaction, you agree to the following: \"I authorize Jackpocket to debit the account indicated for the amount noted on today's date. I will not dispute Jackpocket debiting my account, so long as the transaction corresponds to the terms in this online form and my agreement with Jackpocket.\"\nYou must ensure that your name on any Ticket order you place through the Application always matches your bank account name. The authorized bank account holder will be deemed the Ticket holder in the event of any dispute.\nIf asked to enter the last 4 digits of your social security number you agree to the following: \"I certify, under penalty of perjury that: 1) The Taxpayer Identification Number or Social Security Number I provided is correct; 2) I am not subject to backup withholding because: (a) I am exempt from backup withholding, or (b) I have not been notified by the Internal Revenue Service (IRS) that I am subject to backup withholding as a result of a failure to report all interest or dividends, or (c) the IRS has notified me that I am no longer subject to backup withholding; and 3) I am a U.S. citizen or other U.S. person; and 4) The FATCA code(s) entered (if any) indicating that I am exempt from FATCA reporting is correct. The Internal Revenue Service does not require your consent to any provision of this document other than the certifications required to avoid backup withholding.\"\nYou must ensure that your name on any Ticket order you place through the Application always matches your debit account name. The authorized debit account holder will be deemed the Ticket holder in the event of any dispute.\nYou authorize Jackpocket to share your identity and Account data with PayPal and/or Venmo, as applicable, for the purposes of supporting such account, and you are responsible for the accuracy and completeness of that data.\nYou must ensure that your name on any Ticket order you place through the Application always matches your PayPal or Venmo account name, as applicable. The authorized account holder will be deemed the Ticket holder in the event of any dispute.\nAny underlying funding source used through PayPal or Venmo must be a permitted funding source for ordering lottery tickets in the jurisdiction in which you place your order.\n6. Jackpocket Application Services\nUpon registering with Jackpocket, you will be able to utilize the Application to order official Tickets over the internet; log into your Account; view past Tickets and upcoming Tickets; manage your Account; and access other information related to the official state Lotteries.\n7. Courier Model and Ticket Orders\nPursuant to N.J.A.C. 17:20-12.5(a)9, Jackpocket is required to disclose our insurance coverages and amounts:\nPursuant to N.J.A.C. 17:20-7.7, holders of winning lottery tickets or shares are anonymous, but may expressly consent to waive their anonymity to allow the following information to be published by the New Jersey Division of the Lottery, its marketing and sales contractors and subcontractors, and lottery couriers, including Jackpocket: (i) name, (ii) town and state of residence, (iii) game name and drawing date, (iv) amount won, and (v) photographic and video-graphic likeness in any medium for purposes of publicity or promotion. In the event a winner remains anonymous, the New Jersey Division of the Lottery, its marketing and sales contractors and subcontractors, and lottery couriers, including Jackpocket, may publish the following: (i) name of the county and state where winner resides, (ii) game name and drawing date, and (iii) amount won. The foregoing does not apply to second chance drawings, contests or giveaways. In such instances, house number, street name, social security numbers, taxpayer ID numbers, driver's license numbers, passport numbers, and any other identifying information, other than individual's name and town of residence, shall remain confidential for all purposes.\nJackpocket is a courier service licensed by the New Jersey Lottery. Please be warned that ordering New Jersey Lottery tickets through a courier service not licensed by the New Jersey Lottery may expose you to fraud or other illegal activity.\nAlthough Jackpocket is licensed by the New Jersey Lottery, it is a separate legal entity and is not a part of the New Jersey Lottery, and the New Jersey Lottery does not guarantee, nor have any liability, for courier customer activities.\nAvoid Lottery Scams\nThis is a warning to all consumers about scammers who are sending false announcements regarding lottery prizes.\nAs part of the scam, an individual is contacted by phone, email, text message, or a letter from a scammer who is claiming that the recipient has won a prize with a state lottery. Unless you hear from Jackpocket directly, this is a fraudulent claim and there is no such prize. Federal law prohibits the sale or mailing of lottery tickets across state lines. You may only order lottery tickets or set up a Smart Order in the Jurisdiction you are physically located. Never respond to these communications and never provide information or send money to a scammer.\nWarning Signs\nReport the Scam\nReport any attempted scam to the Federal Trade Commission at 1-877-FTC-HELP or at the FTC Consumer Information website.\nFor Users within New Jersey, contact the New Jersey Lottery's Security Unit immediately at (609) 599-6100. The Security Unit takes these \"lottery scams\" very seriously, and looks into each particular \"scam\" in great detail. Please submit the \"scam\" material you have received, along with as many details as possible (i.e. instructions, your contact information, etc.). You can forward this information to the Security Unit by email (publicinfo@lottery.state.nj.us), by fax (609) 599-5814, ATTN: Security Unit, or via regular mail to New Jersey Lottery; Security Unit; P.O. Box 041; Trenton, NJ 08625-0041.\nk.New York Lottery: For those Users located in New York who order Tickets for the New York Lottery games, we are required to disclose the following terms of service to you prior to the creation of an Account and before the placement of any order:\nReceipt is not a Ticket. No interactive customer order constitutes evidence of a validly issued lottery ticket. A ticket, in order to be a validly issued ticket, shall be generated as set forth in 9 § 5004.9(a), (d), (p).\nTicket Issuance. A draw game ticket is deemed validly issued at the time such ticket is generated by a lottery terminal authorized by the commission or when a registered ticketless transaction is affected and not when a request for order is made of a digital courier service or a ticket order is placed with an interactive sales agent.\nBet Ticket Responsibility. Lottery tickets are bearer instruments. As such, the New York State Gaming Commission shall not be responsible for: (i) lost or stolen bet tickets; (ii) bet tickets claimed by a customer in error for a lower prize at a lottery sales agent; (iii) bet tickets that are not intact; (iv) bet tickets that are mutilated, altered, reconstituted, counterfeit in whole or in part, or tampered with in any manner, or mis-cut; or (v) bet tickets that have not been issued in an authorized manner, or are mis-registered, defective, or printed or produced in error.\nBy creating an account using the digital network of an interactive sales agent or of a digital courier service to place an order for lottery tickets, an interactive customer agrees:\ni) to be bound by the commission's regulations;\nii) to release and hold harmless the interactive sales agent or digital courier service licensee, the State, and the commission from any liability related to an order for tickets placed through the digital network that is not completed before the drawing cutoff and never results in the generation of the tickets ordered through the digital network; and\niii) that, in the event a dispute occurs as to whether a ticket generated to complete an order placed through a digital network would have been a winning ticket had the ticket purchase occurred and no prize is paid, the commission may, at the commission's option, replace the ticket with a ticket equal in value to the price paid for the ticket that is the subject of the dispute, which remedy shall be the sole and exclusive remedy of the claimant against the commission\nl. Exclusions/Self-Exclusions. No Arrangements for Prohibited Persons/Excluded Persons. You acknowledge that Jackpocket is a United States company. As such:\nm. Other Parties. As set forth and unless otherwise indicated in these Terms of Service, other persons are excluded from using the Application or creating an Account. Those persons include those under the age of 18 (or 21 where required in the applicable Jurisdiction); employees, officers, and directors of Jackpocket and any of its or their parent companies, subsidiaries, affiliates as well as direct technology vendors, content providers, component suppliers (both hardware and software) directly related to the Application, and each of their respective immediate family (defined as parents, spouse, partner, and children) residing in the same household (but such persons may, however, access the Application, and will from time-to-time do so for the purpose of testing the Application, including, without limitation, evaluating User experience, and other reasonable and fair uses at the sole discretion of Jackpocket); those who are not located in a Jurisdiction where Jackpocket is available or where Jackpocket can order Tickets on a User's behalf; those who do not meet the eligibility and verification requirements, including identification and requirements; and those excluded by the applicable Regulator. Jackpocket may exclude any person or entity from using its Application or opening an Account in its sole discretion.\n8. Winning Tickets and Prize Claiming\nIn connection with a Ticket redemption, Jackpocket transmits winnings to the User's Account if the winnings are under the In-Store Redemption Threshold. You consent to Jackpocket storing any Ticket on your behalf.\nOnce the drawing and prize results are in, Jackpocket will notify you in the Application and email you to let you know if your Ticket is a Winning Ticket. If it is a Winning Ticket and the prize value is less than or equal to the In-Store Redemption Threshold, Jackpocket will credit your Account for the full prize value, as further described in Section 8(a) below. If a Winning Ticket has a prize value worth more than the In-Store Redemption Threshold, Jackpocket will arrange for delivery or pickup of the Winning Ticket to the User or to the Regulator, as further described in Section 8(b) below.\nPrize claims made through this Application are subject to the prize payout rules and regulations set forth by the Regulator. Jackpocket may provide the Regulator with any User Personal Information as requested by the Regulator, including to process prize claims. Such information may include, but is not limited to, the full name, address and phone number listed in your Account.\na. Winning Tickets with prizes totaling less than or equal to the In-store Redemption Threshold. By using the Application you authorize Jackpocket to store and claim Winning Tickets with prize totals that are less than or equal to the In-Store Redemption Threshold in the Jurisdiction of purchase on your behalf at an authorized lottery retailer once drawing results are posted. Neither Jackpocket nor the licensed retailers from which Jackpocket collects these prizes will withhold any applicable taxes on your behalf . Jackpocket will deposit the full prize value into your Jackpocket Account. With the exception of Lottery Credits, funds in your Account can be transferred to an eligible checking or savings account in accordance with these Terms of Service.\nFor New Jersey Customers, if you desire to opt-out of authorizing Jackpocket to claim these types of Winning Tickets, you can do so by contacting support@jackpocket.com, specifying whether you want the Winning Tickets to be delivered (i) via a nationally recognized courier or mail service at Jackpocket's expense, or (ii) by hand at our processing location.\nFor non-New York customers, if the official prize for the Winning Ticket is a free Ticket for a separate drawing, then Jackpocket may either provide the User with the new Ticket or credit the User with a Lottery Credit equal to the purchase value that the new Ticket would cost if purchased. For New York customers, if the official prize for the Winning Ticket is a free Ticket for a separate drawing, then Jackpocket will provide the User with the new Ticket.\nYou are ultimately responsible for paying any tax liability associated with claims made through this Application for Winning Tickets with prizes that are less than or equal to the In-Store Redemption Threshold in the state of purchase . The In-Store Redemption Threshold varies by Jurisdiction, but is typically around $600. Check your Regulator's official website for more information.\nb.Winning Tickets with prizes greater than the In-store Redemption Threshold. Claims for Winning Tickets with prizes totaling more than the In-Store Redemption Threshold and up to $10,000 will, at your option, be delivered (i) via a nationally recognized courier or mail service at Jackpocket's expense, or (ii) by hand at our processing location. For non-New York customers claiming Winning Tickets worth more than $10,000, the customer will be required to pick up the ticket in person, subject to the in-person requirements set forth in the next paragraph. For New York customers claiming Winning Tickets worth more than $10,000, the customer will still have the option for hand delivery or a nationally recognized courier or mail service. If permitted in your jurisdiction, you agree to allow Jackpocket to send your Winning Ticket, including any required claim information, directly to the Regulator, allowing you to receive a check or other form or method of payment from such Regulator.\nJACKPOCKET STRONGLY RECOMMENDS TO NEW YORK WINNERS THAT THEY REQUEST HAND DELIVERY IN PERSON AT THE JACKPOCKET PROCESSING CENTER OF A WINNING TICKET WORTH MORE THAN $10,000.\nIN THE EVENT YOU ELECT TO RECEIVE DELIVERY VIA A NATIONALLY RECOGNIZED COURIER OR MAIL SERVICE, JACKPOCKET SHALL HAVE NO LIABILITY FOR LACK OF DELIVERY, INCORRECT DELIVERY OR MISPLACEMENT OF ANY WINNING TICKET, ONCE SUCH TICKETS ARE PROVIDED BY JACKPOCKET TO THE NATIONALLY RECOGNIZED COURIER OR MAIL SERVICE. ANY AMOUNT PAID BY JACKPOCKET IN RELATION TO ANY SUCH WINNING TICKET SHALL NOT BE: (I) AN ADMISSION OF LIABILITY, (II) A REQUIREMENT TO MAKE ADDITIONAL PAYMENTS, OR (III) CONSIDERED A WAIVER OF ANY OF JACKPOCKET'S RIGHTS IN THIS TERMS OF SERVICE.\nWinning Tickets greater than the In-Store Redemption Threshold are subject to approval by the Regulator and must be claimed directly from the Regulator either by mail or in person. Claiming rules vary by Jurisdiction. Check your Jurisdiction for more details. The Regulator may withhold taxes from prize distributions for Winning Tickets with claimed prizes totaling more than the In-Store Redemption Threshold. Jackpocket will not be liable for verifying the appropriateness or accuracy of taxes withheld from Users' claims, and Users are solely responsible for handling individual tax situations directly with the applicable Jurisdiction. Jackpocket will not be liable for any unclaimed prizes associated with Winning Tickets ordered through this Application for any reason. You authorize Jackpocket to store any such Winning Tickets until delivery or pick up, as applicable.\nJackpocket requires, and you agree to present a government-issued identification in order to pick up any Winning Ticket associated with your Account. In the event you do pick up a Winning Ticket in person, you agree to take full possession and release Jackpocket from any responsibility for the Winning Ticket, and any associated prize claims, by signing a ticket release form.\nIn the event that Jackpocket mails you the Winning Ticket, Jackpocket will be responsible for paying for the shipping costs and Jackpocket is released from any liability and responsibility as soon as the packaged Winning Ticket is put into the possession of the mail courier. Prior to or upon shipping, Jackpocket will provide you with an email containing the tracking information for your Winning Ticket. In the event you do not receive your Winning Ticket, you must notify Jackpocket within fifteen (15) days following receipt of the email containing the tracking information so that Jackpocket may notify the courier or mail service. You are responsible for ensuring the accuracy of your mailing address. At no time will Non-Winning Tickets be available for in-person pick up or mailing.\nJACKPOCKET IS NOT RESPONSIBLE OR LIABLE FOR THE PAYMENT OR NON-PAYMENT OF ANY WINNING TICKET WHERE THE PRIZE EXCEEDS THE IN-STORE REDEMPTION THRESHOLD. FOR ANY WINNING TICKET THAT EXCEEDS THE IN-STORE REDEMPTION THRESHOLD, THE LOTTERY THAT ISSUED SUCH WINNING TICKET IS SOLELY RESPONSIBLE FOR THE PAYMENT OR NON-PAYMENT OF ALL PRIZES FOR THAT TICKET. BY USING THE APPLICATION, YOU HEREBY WAIVE ANY CLAIM AGAINST JACKPOCKET, AND AGREE TO RELEASE AND HOLD HARMLESS JACKPOCKET FROM ANY AND ALL LIABILITY, CLAIMS, ACTIONS, PROCEEDINGS, DAMAGES, LOSSES, COSTS, EXPENSES OR SETTLEMENTS OF ANY KIND WHATSOEVER, WHICH DIRECTLY OR INDIRECTLY ARISE FROM, ARE RELATED TO, OR ARE BASED UPON THE PAYMENT OR NON-PAYMENT OF PRIZES FOR ANY WINNING TICKET THAT EXCEEDS THE IN-STORE REDEMPTION THRESHOLD.\nc. Prohibition on Claiming Winning Tickets. You are prohibited from claiming, or attempting to claim, any Winning Tickets in any manner that is inconsistent with the terms of this Section 8. In the event you claim, or attempt to claim, any Winning Ticket in a manner that is inconsistent with this Section, you agree that Jackpocket will have no liability to you with respect to such Winning Ticket, including, without limitation, the obligation to deposit any winnings into your Account associated with such Winning Ticket. Additionally, in the event that you and Jackpocket both claim the prize for any Winning Ticket, Jackpocket has the right to immediately remove any associated winnings from your Account and suspend or terminate your Account. You shall indemnify, defend and hold harmless Jackpocket for any claims, losses, expenses and all other liabilities Jackpocket incurs as a result of your failure to comply with these Terms of Service.\nd. Winning Ticket is a Bearer Instrument. Note that your ticket is held in trust by Jackpocket as the courier, and a Ticket is a bearer instrument within the meaning of all applicable law, such that the holder of the ticket is presumed to be the owner of the ticket with all applicable rights in the ticket and its proceeds. Therefore, if you obtain possession of your Winning Ticket, do not lose your Ticket or allow others to possess your Ticket. Jackpocket attempts to mitigate this risk by placing the winning customer's name on the back of the Ticket following the ticket being deemed a Winning Ticket, however Jackpocket cannot be held responsible for any lost or stolen tickets or other tickets that, for whatever reason, are not in the winning customer's possession.\n9. SMART ORDERS\na. Overview of the Smart Order Feature\nJackpocket offers a feature that enables eligible Users to schedule recurring Ticket orders based on preferences they set (\"Smart Order\"). For Users with a Smart Order, Jackpocket will place Ticket orders on the User's behalf only when all of your selected criteria in the Smart Order are met.\nEligible criteria may vary depending on the Lottery game selected and may include, but are not limited to:\n· Selection of pseudo-randomly generated numbers or selection of specific numbers;\n· Number of Tickets to be ordered per Designated Drawing, and\n· A jackpot threshold (if available). For certain Lotteries, Smart Order allows Users to set a jackpot threshold, where Smart Order will only place an order for that Lottery when the jackpot meets or exceeds the dollar amount selected through Smart Order. For example only, if a User sets a $500 million jackpot threshold for a specific Lottery, Smart Order will not place an order unless and until the jackpot for that Lottery reaches at least $500 million.\nJackpocket may modify, suspend, or discontinue the Smart Order feature, in whole or in part, at any time and for any reason or no reason, in its sole and absolute discretion.\nb. Smart Order Eligibility\nSmart Order is available only to Users who are eligible to order Lottery tickets on Jackpocket and who are physically located in a jurisdiction where Smart Order is offered. Smart Order is not offered in New York. Additional geographic or legal restrictions may apply to Smart Orders based on applicable law, regulations, or Lottery-specific rules.\nc. Automatic Payment and Order Processing\nUNLESS YOU CANCEL YOUR SMART ORDER BEFORE THE NEXT SCHEDULED ORDER IS PLACED, YOU AUTHORIZE JACKPOCKET TO CHARGE THE ORDER TOTAL OF THAT ORDER TO YOUR SELECTED PAYMENT METHOD.\nWhen a Smart Order is triggered based on your selected criteria, Jackpocket will automatically charge the total order cost, including any applicable service fees, to your selected payment method. You authorize Jackpocket to initiate such recurring charges as part of your use of Smart Order.\nThe exact timing of order placement may vary depending on when a User's Smart Order is processed and the specific criteria a User has selected.\nIf your selected payment method cannot be charged at the time an order is triggered to be placed through Smart Order, including, but not limited to, due to insufficient funds or an expired payment method, that individual Smart Order will not be placed. Jackpocket will not attempt to place an individual order again in the event your selected payment method cannot be charged at the time of that individual order, but the Smart Order will remain active and future orders will be attempted based on your selected criteria in accordance with your Smart Order. For more information about how payment failures, chargebacks, or insufficient funds are handled, including potential fees and account actions, see Section 5(g): (Chargebacks/Insufficient Fund Charges) of these Terms of Service.\nYou are solely responsible for ensuring that your selected payment method remains valid and has sufficient funds while your Smart Order is in place.\nJackpocket is not responsible for any failure to place any order related to A SMART ORDER.\nd. Cancelling, Pausing, or Editing a Smart Order\nYOUR SMART ORDER WILL REMAIN ACTIVE, AND YOUR SELECTED PAYMENT METHOD WILL CONTINUE TO BE CHARGED AUTOMATICALLY, IN EACH CASE, UNTIL YOU CANCEL THE SMART ORDER.\nYou may cancel your Smart Order at any time. To do so, go to the \"Smart Order\" section in the Application, select the relevant Smart Order, and click \"Delete Smart Order.\"\nYou may also update your selected payment method for a Smart Order at any time. To change your payment method for a Smart Order, go to the \"Smart Order\" section in the Application, select the relevant Smart Order, click \"Payment Method,\" and then follow the prompts to enter the required information.\nIf you wish to temporarily stop your Smart Order without cancelling the Smart Order, you may pause it at any time. To pause a Smart Order, go to the \"Smart Order\" section in the Application, select the relevant Smart Order, and toggle the \"Smart Order Enabled\" switch to off. The Smart Order will be paused until you proactively toggle the \"Smart Order Enabled\" switch back to on.\nYou cannot edit the criteria of an existing Smart Order. If you wish to make changes to the criteria of an existing Smart Order-including, but not limited to, selecting a different Lottery, jackpot threshold, or number of Tickets-you must cancel the existing Smart Order and create a new one with your updated preferences.\nAny cancellations of a Smart Order will take effect immediately for all future orders that have not yet been triggered or placed through the Smart Order. Once a Ticket order has been placed through a Smart Order that order is final and cannot be cancelled or changed by you.\ne. Lottery Ticket Price Increase\nIn the event a Lottery increases the cost of any Ticket(s), any Smart Orders related to such Ticket(s) will continue at the increased price, and you will be charged and authorize Jackpocket to charge your selected payment method for the increased price, whether or not you have been notified of such price increase by Jackpocket, unless you cancel the Smart Order.\nf. Winning Tickets\nThe process for claiming or redeeming Winning Tickets ordered through Smart Order is the same as for any other Winning Tickets ordered through Jackpocket. See Section 8 (Winning Tickets and Prize Claiming) of these Terms of Use for more information on claiming or redeeming Winning Tickets.\ng. Jackpocket Termination of Smart Order\nJackpocket may terminate or suspend any Smart Orders and/or your access to Smart Orders at any time and for any reason or no reason, in Jackpocket??Ts sole and absolute discretion, including but not limited to, in the event of:\nIn the event Jackpocket terminates or suspends any active Smart Orders, no further orders will be placed in connection with that Smart Order. However, any tickets already ordered through the Smart Order prior to termination or suspension will remain valid and subject to these Terms of Service and applicable laws, regulations, and Lottery rules.\nJackpocket shall not be liable to you for any loss of access to, or malfunctions in, Smart Order, including, without limitation, any cancelled orders, any Tickets that were not purchased in connection with a Smart Order, any malfunctions in a Smart Order or a feature related to a Smart Order, or errors in the settings associated with a Smart Order.\n10. PREPAID ORDERS\na. Overview of Prepaid Orders\nJackpocket offers a feature that allows eligible Users to prepay for Ticket orders in advance of future Designated Drawings (\"Prepaid Orders\"). With a Prepaid Order, Users pay a one-time, upfront amount, including any applicable service fee(s), for a set number of Tickets to future Designated Drawings. Jackpocket will then place the corresponding Ticket orders on the User's behalf until the prepaid balance has been fully used.\nOnce a Prepaid Order is confirmed and payment is successfully processed, no additional charges will be applied for the applicable Designated Drawings. Prepaid Orders are not recurring and will automatically conclude once the prepaid balance of the Prepaid Order has been fully used.\nJackpocket may modify, suspend, or discontinue the Prepaid Order feature at any time, in whole or in part, at any time and for any reason or no reason, in its sole and absolute discretion, with or without notice to you.\nb. Prepaid Order Eligibility\nPrepaid Orders are available only to Users who are eligible to order Lottery tickets through Jackpocket and who are physically located in a jurisdiction where Prepaid Orders are offered. Additional geographic or legal restrictions may apply based on applicable laws, regulations, or Lottery-specific rules.\nc. Payment and Order Fulfillment\nWhen you place a Prepaid Order, you authorize Jackpocket to charge the full, upfront cost-including any applicable service fees-for the Prepaid Order to your selected payment method. No further charges will be made for that Prepaid Order after this initial payment.\nTicket orders associated with a Prepaid Order will be placed for each drawing as scheduled, and you will receive order confirmations in accordance with Jackpocket's standard process.\nIf your payment for a Prepaid Order cannot be successfully processed at the time of placing the Prepaid Order, no Tickets will be ordered, and the Prepaid Order will not be initiated. Jackpocket will not attempt to retry a failed Prepaid Order payment.\nd. Cancelling or Modifying a Prepaid Order\nONCE A PREPAID ORDER IS PLACED AND PAYMENT IS PROCESSED, IT CANNOT BE CANCELLED, REFUNDED, OR MODIFIED.\nJackpocket does not support cancellations, changes to drawing dates, changes to number selections, or any other changes to criteria, in each case, related to a Prepaid Order that has been placed.\ne. Lottery Ticket Price Increase\nIn the event a Lottery increases the cost of any Ticket(s) related to a Prepaid Order, Jackpocket will automatically cancel the remaining unfulfilled portion of the Prepaid Order and issue you a pro rata refund of the Prepaid Order based on the number of Designated Drawings remaining after the price increase.\nFor example, if you prepaid for 10 Tickets to Designated Drawings and a price increase occurs after 5 Tickets have been ordered, Jackpocket will cancel the remaining 5 Tickets and refund to you half of the payment you made for such Prepaid Order.\nIn the event your Prepaid Order is canceled due to a Lottery increasing the cost of Tickets, you may place a new order at the updated Ticket price if you choose to do so.\nf. Winning Tickets\nThe process for claiming or redeeming Winning Tickets ordered through a Prepaid Order is the same as for any other Winning Tickets ordered through Jackpocket. See Section 8 (Winning Tickets and Prize Claiming) of these Terms of Service for more information on claiming or redeeming Winning Tickets.\ng. Jackpocket Termination of Prepaid Orders\nJackpocket may terminate or suspend Prepaid Orders and/or your access to this feature at any time and for any reason or no reason, in Jackpocket??Ts sole and absolute discretion, including but not limited to, in the event of:\nIn the event Jackpocket terminates a Prepaid Order before all Tickets are fulfilled, and such termination is not the result of your violation of these Terms of Service, Jackpocket may, at its sole and absolute discretion, issue a pro rata refund for the unused portion of the terminated Prepaid Order.\nJackpocket shall not be liable to you for any loss of access to, or malfunction in, Prepaid Orders, including, without limitation, any terminated Prepaid Orders, any Tickets that were not purchased in connection with a Prepaid Order, malfunctions of any features related to Prepaid Orders, or errors in the settings associated with a Prepaid Order.\n11. Quick Picks\nUsers may elect to utilize this Application to generate and/or order pseudo-random plays. By using Jackpocket, you understand and acknowledge that, as is common in random number generators, the Quick Pick randomization process is seeded by the timestamp of its initial generation request (as recorded by Jackpocket) and, as such, cannot be classified a \"True Random Number\" by definition. You further understand that Jackpocket cannot be held responsible for the numbers chosen for any of the pseudo-randomly generated Plays derived through this system.\n12. Playing Scratch Offs\nIf Jackpocket permits users to order scratch off tickets in your Jurisdiction, you are subject to the following terms for any such order, in addition to the other terms and conditions of this Terms of Service. Solely with regard to scratch off orders, to the extent there is any contradiction between the terms of this Section 11 and the terms of the remainder of this Terms of Service, the terms of this Section 11 shall prevail.\nBy ordering scratch off tickets, you agree to the terms, conditions, and game rules provided on each ticket and published by the lottery commission in your jurisdiction.\nYou authorize Jackpocket to collect your personal information, including your mailing address, and to share such information, including your identity and mailing address with any third-party delivery provider. YOU ARE RESPONSIBLE FOR THE ACCURACY AND COMPLETENESS OF THAT DATA, INCLUDING THE MAILING ADDRESS. IN THE EVENT YOU PROVIDE AN INCORRECT MAILING ADDRESS OR YOUR TICKETS ARE OTHERWISE LOST OR NOT DELIVERED, JACKPOCKET SHALL HAVE NO LIABILITY FOR LACK OF DELIVERY, INCORRECT DELIVERY OR MISPLACEMENT OF ANY TICKET, ONCE SUCH TICKETS ARE PROVIDED TO THE THIRD PARTY DELIVERY PROVIDER.\nYour scratch off tickets will be delivered to you within the Application.\nUpon placing an order for scratch off tickets, you will receive an email from Jackpocket confirming the order. Jackpocket will send you a second email confirming when your tickets were delivered to you within the Application. Your order will also be viewable in your transaction history in the mobile application.\nIf Jackpocket permits Users in Your Jurisdiction to order scratch off tickets to be delivered within the Application, you agree that Jackpocket will scan and scratch the ticket on your behalf, and will provide you with the opportunity to reveal the outcome of the ticket within the Application. The redemption procedures detailed in Section 8 of these Terms of Service shall apply to any such winning ticket that was delivered within the Application. You are responsible for following the terms, conditions and game rules provided on the back side of each ticket and published by the Lottery in Your Jurisdiction.\nSCRATCH OFF TICKETS ARE LIMITED BY THE AVAILABILITY OF THE LICENSED RETAILER. YOU ARE NOT GUARANTEED A TICKET AT ALL TIMES. IN THE EVENT THERE IS NO INVENTORY OF A REQUESTED SCRATCH OFF TICKET, YOUR ORDER WILL BE REJECTED. ALL ORDERS PLACED FOR SCRATCH OFF TICKETS THAT ARE NOT REJECTED ARE FINAL.\nJackpocket has the right to void any scratch off tickets that Jackpocket has scanned and scratched on your behalf in the event any such scratch off tickets are damaged, mutilated, altered, unreadable, unredeemable, or incomplete in any manner, as determined by Jackpocket in its sole and absolute discretion, for any reason or no reason.\nYou agree that the price of the scratch off tickets will count towards any spending limits placed on your Account.\n13. Limited License to the Jackpocket Application\na. License Grant. The Application and its contents, features and functionality, including but not limited to, all information, products, services, text, displays, graphics, video, audio and software as well as the design, selection and arrangement thereof (collectively, \"Content\"), are owned by the Company, its licensors or other providers of such material and are protected by United States and international copyright, trademark, patent, trade secret and other intellectual property or proprietary rights laws. Subject to these Terms of Service, the Company grants you a limited, non-exclusive and nontransferable license to (i) download, install and use the Jackpocket Application for your personal, non-commercial use on a mobile device owned or otherwise controlled by you (\"Mobile Device\") strictly in accordance with these Terms of Service and (ii) access and use the services made available in or otherwise accessible through the Jackpocket Application strictly in accordance with these Terms of Service.\nb. License Restrictions. You acknowledge and agree that you shall not:\nAny such conduct may result in the immediate termination of your Account as well as your limited right and license to use the Application, and may subject you to liability for violations of law.\nc. Reservation of Rights. You further acknowledge and agree that the Application is provided under license, and not sold, to you. You do not acquire any ownership interest in the Application under these Terms of Service, or any other rights thereto other than to use the Application in accordance with the license granted, and subject to all terms, conditions and restrictions under these Terms of Service. The Company and its licensors and service providers reserve and shall retain their entire right, title and interest in and to the Application, including all copyrights, trademarks and other intellectual property rights therein or relating thereto, except as expressly granted to you in these Terms of Service.\nd. From time to time, the Company may in its sole discretion develop and provide Application updates, which may include upgrades, bug fixes, patches and other error corrections and/or new features (collectively, including related documentation, \"Updates\"). Updates may also modify or delete in their entirety certain features and functionality. You agree that the Company has no obligation to provide any Updates or to continue to provide or enable any particular features or functionality. Based on your Mobile Device settings, when your Mobile Device is connected to the Internet either (i) the Application will automatically download and install all available Updates or (ii) you may receive notice of or be prompted to download and install available Updates. You acknowledge and agree that the Application or portions thereof may not properly operate should you fail to promptly download and install all Updates. You further agree that all Updates will be deemed part of the Application and be subject to these Terms of Service.\ne. Mobile Device and Service Charges. Certain features of the Application require communication with the Company's servers, including, without limitation, Application downloads and Updates, which may consume and exceed your service provider's data or minute allowance limits. You acknowledge and agree that you are solely responsible for any charges incurred with your data/mobile service provider as a result of the Application, including any overage and penalties assessed for exceeding the limits imposed by your service provider. You are responsible for the cost of your Mobile Device and to ensure that your Mobile Device meets the system requirements of the Application, including obtaining periodic updates or upgrades from your Mobile Device service provider to continue using the Application. THE COMPANY DOES NOT WARRANT OR GUARANTEE THAT THE APPLICATION WILL BE COMPATIBLE OR FUNCTION WITH ANY PARTICULAR MOBILE DEVICE, NOR DOES THE COMPANY WARRANT OR ACCEPT ANY LIABILITY FOR OPERATION OF THE MOBILE DEVICE USED TO ACCESS THE APPLICATION.\n6. Term and Termination. The term of your limited license to the Application commences when you download the Application and accept these Terms of Service and will continue in effect until the earlier of (i) your deletion of the Application from your Mobile Device or (ii) the Company's suspension or termination of your limited license to the Application and/or termination of your Account. Upon termination (i) all rights granted to you under these Terms of Service will also terminate and (ii) you must cease all use and delete all copies of the Application from your Mobile Device. Termination of your limited license will not limit any of the Company's rights or remedies at law or in equity.\n14. Intellectual Property Rights\n15. Use Prohibitions\nYou agree to access and use this Application only for lawful reasons. You are responsible for knowing and complying with any and all laws, statutes, rules and regulations pertaining to your use of this Application. You are prohibited from using this Application in a way that:\nIf requested and required by law or regulation, Jackpocket will cooperate fully with any law enforcement officials, Regulators, and/or governmental agencies in the investigation of any Users and may disclose your information to such law enforcement officials, Regulators, and/or agencies if required by law or regulation.\n16. Comments and Other User Submissions/Use of Information\nWhile Jackpocket does not claim ownership of any comments or suggestions that you may submit to Jackpocket, by submitting a comment or suggestion or any other material to this Application, you hereby authorize and grant Jackpocket the non-exclusive right and license to use, display, reproduce, modify and distribute the comment, suggestion or material in whole or in part, anywhere in perpetuity in any and all media outlets, whether alone or together, or as part of any material of any kind or nature. Without limiting any of the foregoing, Jackpocket will have the non-exclusive right and license to use, copy, edit, display, perform, distribute, modify and re-format the comment, suggestion or material in any manner that Jackpocket may determine. You waive any claims to compensation for any such right or license. By submitting a comment, suggestion or material, you represent and warrant to Jackpocket that you have all necessary rights in and to all comments, suggestions or materials you provide and all information they contain, and that such comments, suggestions or materials do not infringe upon any proprietary or other rights of third parties or contain any libelous, tortious, or otherwise unlawful information.\nYou should note that by using the Application, you grant Jackpocket the non-exclusive right and license to use your full name and details of the game(s) you won (including the winner amount and any reason you have stated to Jackpocket for why you chose your numbers) in the event Jackpocket chooses to publish (through the Application or otherwise) this information concerning your win(s) for promotional or other purposes. For instance, we may publish \"Jack won $100 in Minnesota. Jack picked his numbers based upon family birthdates. Congrats Jack!\" Further, Jackpocket may use your image, your full name, and details of the game(s) you played or won to promote Jackpocket on social media and in other media, on the Application or in any other medium, on the Internet or otherwise. Your use of the Application constitutes permission (except where prohibited by law) to use your name, city, state, likeness, image, comments and/or voice for purposes of advertising, promotion, and publicity in any and all media now or hereafter known, throughout the world in perpetuity, without additional compensation, notification, permission, or approval, except as required by applicable law.\n17. Disclaimers and Limitations of Liability\na. Disclaimer of Liability. Jackpocket is not liable for any direct, indirect, incidental, consequential, or punitive damages (including, without limitation, those resulting from lost profits, lost data, or business interruption) arising out of your access to, use of, or inability to use, this Application or any material from this Application, including but not limited to damages caused by any failure of performance, interruption (including those disruptions described in Section 19 below), error, omission, deletion, defect, delay in operation or transmission, computer virus, security, communication line failure, theft, destruction or unauthorized access to, alteration of, or use of record, whether for breach of contract, tortious behavior, negligence or under any other cause of action.\nb. Disclaimer of Warranty. Without limiting the foregoing, this Application and the material provided on this Application are provided \"AS IS\" WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, OR NON-INFRINGEMENT. ANY CLAIMS FOR DAMAGES WILL BE LIMITED TO THE PRICE OF EACH INTERNET TICKET ORDER VIA THIS APPLICATION OR THE VALUE OF A SINGLE INTERNET TICKET PLAYED AS PART OF A SMART ORDER OR PREPAID ORDER VIA THIS APPLICATION.\nc. Disclaimer of Accuracy of Data. Jackpocket makes no warranties or representations as to the accuracy, completeness or timeliness of the materials, or content provided on this Application and assumes no liability or responsibility for any errors or omissions on this Application. No warranty, expressed or implied, is made regarding accuracy, adequacy, completeness, legality, reliability or usefulness of any materials or content. This disclaimer applies to both isolated and aggregate uses of the materials or content. If you find any errors or omissions, we encourage you to report them to support@Jackpocket.com. Jackpocket makes every effort possible to ensure that the winning numbers and prize amounts posted on this Application and highlighted on individual Tickets are accurate and available within a reasonable amount of time after winning numbers are drawn for each lottery drawing. However, in the event of an error, the winning numbers and prize amounts in the official records of the Regulator will stand as the final determination of prize monies owed to an Account.\nBy using this Application you hereby waive any claim against Jackpocket for, or in connection with, the receipt of erroneous information. Jackpocket takes numerous steps to ensure that the Plays requested on Ticket orders exactly match the Plays included on the tickets Jackpocket physically purchases from licensed state lottery retailers on your behalf. However, in the event of an error, the Plays included on the physical ticket purchased in relation to your Ticket order will stand as the final determination of prize monies owed to your Account. By using this Application you acknowledge that in the event of an error (caused by any means, including Jackpocket's error), Jackpocket is only liable for the cost of the Ticket.\nd. Disclaimer of Endorsement. Jackpocket may from time to time distribute content supplied by third parties. Any opinions, advice, statements, services, offers, or other information or content expressed or made available by third parties, including information providers, Users, or others, are those of the respective author(s) or distributor(s) and do not necessarily state or reflect the opinion of Jackpocket and shall not be used for advertising or product endorsement purposes. Reference herein to any specific commercial products, process, or service by trade name, trademark, manufacturer, or otherwise, does not constitute or imply its endorsement, recommendation, or favoring by Jackpocket.\n18. Dispute Resolution and Indemnity\nd. These Terms of Service shall be governed by the internal substantive laws of the Commonwealth of Massachusetts, without respect to its conflict of laws principles.\n19. General Terms\n20. Potential Disruption of the Application\nAccess to this Application may from time to time be unavailable, delayed, limited or slowed due to, but not limited to, the following:\n21. Responsible Play\nJackpocket is committed to ensuring the lottery does not turn from a game of fun into a financial issue. Jackpocket warns that for some users, gambling of any kind can be a problem. Jackpocket may permit you to set responsible gaming limits and to self-exclude yourself from use of the Application. Notwithstanding the foregoing, Jackpocket reserves the right to impose stricter limits than those imposed by you and/or exclude you from use of the Application, in each case, in its sole and absolute discretion, for any reason or no reason. More detailed information may be found at https://rg.jackpocket.com/.\nNCPG iCAP Certified\nJackpocket is a member of the National Council on Problem Gambling (NCPG). We're certified for responsible gaming through NCPG's assessment program (iCAP). Learn more.\nNeed additional help?\nIf you need additional support, the National Council on Problem Gambling (NCPG) offers a number of resources on their website as well as 24-hour confidential helpline at 1-800-522-4700.\n22. Entire Agreement\nThese Terms of Service, our Privacy Policy, and any applicable Limited Power of Attorney constitute the sole and entire agreement between you and the Company with respect to the Application and supersede all prior and contemporaneous understandings, agreements, representations and warranties, both written and oral, with respect to the Application. Nothing in the Terms of Service, express or implied, shall be deemed to confer any rights or remedies upon, nor obligate any of the parties hereto, to any person or entity other than such parties, unless so stated to the contrary.\n© 2025 Jackpocket LLC"
    }
  ],
  "argos_summary": "Nebraska Lottery offers a mix of national games such as Powerball, Mega Millions, Lotto America, and local games like Pick 3, Pick 5, MyDaY, and 2 by 2, with tickets available at gas stations, convenience stores, and online through the Jackpocket app. The article highlights recent big wins, including a California holder of a $1.22 billion Mega Millions jackpot, and explains how winners should first secure their prize. It also details the Jackpocket terms of service, covering eligibility, ticket ordering, prize claiming, and responsible play policies for users in participating U.S. states and territories.",
  "argos_id": "6LWYPO2GQ"
}