{
  "url": "https://www.dailymail.co.uk/galleries/article-15025995/Event-planner-outlines-Las-Vegas-tourist-slump.html?ns_mchannel=rss&ns_campaign=1490&ito=1490",
  "authorsByline": "Lauren Acton-Taylor",
  "articleId": "9f57f39173ab4ce9ada22d8f19db4dc7",
  "source": {
    "domain": "dailymail.co.uk",
    "paywall": false,
    "location": {
      "country": "gb",
      "city": "London",
      "coordinates": {
        "lat": 51.5073219,
        "lon": -0.1276474
      }
    }
  },
  "imageUrl": "https://i.dailymail.co.uk/1s/2025/08/16/21/101288415-0-image-a-13_1755377674022.jpg",
  "country": "gb",
  "language": "en",
  "pubDate": "2025-08-24T14:00:46+01:00",
  "addDate": "2025-08-24T13:16:51.562386+00:00",
  "refreshDate": "2025-08-24T13:16:51.562387+00:00",
  "score": 1.0,
  "title": "Event planner outlines Las Vegas tourist slump",
  "description": "Aaron Perez warned that the sticker shock tourists face in Sin City is contributing to its visitor slump.",
  "content": "A Las Vegas event planner has revealed the eyewatering cost of food and drink in Sin City which he believes is accelerating the once-thriving destination's tourist slump. As an event planner in the city for 16 years, Aaron Perez knows his way around Vegas. But now he says even his go-to spots for the best drink, dinner or dance are starting to fail him due to skyrocketing costs.\n\nThe Canadian co-founder of GXP Tours Las Vegas, which offers party packages and limo tours, says Sin City has crumbled to corporate greed. 'The numbers are down, and for so many locals, I think the reason is obvious - which is they got greedy,' Perez told the Daily Mail. 'Tourists and locals are kind of being nickel and dimed to their limits.' The Nevada city, known for its lavish shows and around-the-clock gambling,has recorded a large drop in tourism and spending in recent months.\n\nPerez recalled his shock after a friend of his stayed in the ARIA Hotel and Casino where a Diet Coke cost $15, while a bottle of water was a staggering $26. He also balked at the cost of $40 nachos that were, 'literally just tortilla chips with nothing on them'. The hotel also offered 'Kettle Chips, Butter Popcorn or Pretzels' for $21 and 'Roasted Peanuts of Fancy Mixed Nuts' for $34.50.\n\nThe Daily Mail reached out to ARIA for comment. 'The comp culture that once brought people back to Vegas is diminished or gone and instead the Strip has kind of been pricing out their bread and butter visitors in favor of trying to only cater to the top one percent,' he added. 'And frankly, it's not really working for them.' The Las Vegas Strip has recently seen jaw-dropping prices for drinks, food and entertainment, driving out tourists and locals alike.\n\n'I used to go to the Strip pretty frequently,' Perez said. '[I'd] take my friends there... [but they] overcharged to the point that people have just stopped wanting to go. As a local who's been here sixteen years, I never go to the strip.' Many residents and businesses have noticed tourists aren't showing up in the numbers that Vegas became accustomed to over the years. 'Our bread and butter clients were not American,' Perez said. 'We basically have survived the majority of the last 16 years off of Canadians, Mexicans, Brits and Australians.'\n\n'That's who's coming here for bachelor parties. It's a huge destination for people to travel to, whereas now, a lot of them are opting to go elsewhere.' Perez believes that two factors have contributed to the lack of international tourists; the Strip's rising prices and politics. 'It feels like [tourists] are not coming here in the numbers that they used to and I'm positive a lot of that has to do with political reasons,' he said, in a reference to President Trump's 'America First' approach and rhetoric.\n\nBut the real culprit is corporations who taking advantage of their clientele to try and recoup their losses, especially after the Covid-19 pandemic, Perez said. 'If you're going to a casino to give them money, to get gouged on to just sit and literally give away your money and gamble, why are they charging for parking?' 'If you show up to check in for your hotel room, there's an early check-in fee,' Perez continued. 'There's long lines because people are not getting properly staffed and if you're paying 30 plus dollars for a cocktail, how much do you feel like tipping the bartender?'\n\nThe perks that many casinos and hotels used to offer for free, now come with a pretty price tag which, Perez believes, is hugely insulting. 'All Caesars properties prior to Covid used to have something called a diamond lounge, and if you were a diamond rated player there were places where you could get free drinks, free food, you could watch sporting games. You could hang out and socialize,' Perez recalled. 'A lot of the perks that you used to get here simply vanished, and I reckon that that is all due to greed,' he said. 'There's always someone at the top who is going to make their money no matter what, a lot of them are out of touch with the pulse of the city.'\n\n'They are testing the upper limits of what people are willing to pay, and yes, they have no other option. Until they decide enough is enough.. [if] I'm going to go out with friends. I will tell them let's go somewhere else.' Perez believes that Vegas' only shot to bounce back, is for companies to give back to their clientele. 'I think the message is being received,' he said. '[There are] countless articles about how people are being turned off, locals especially, from being on the Strip and how they are demanding change.'\n\nHe said 'in small ways' he had seen 'indicators' that businesses were picking up on the frustration felt down the Strip, and they have to start giving back to customers 'if they want to survive'. Perez said its a model his business has adopted for their party packages, where he is shunning the traditional mega clubs in favor of more bespoke experiences. 'We started focusing on how it makes people feel and providing quality and value as opposed to just trying to get as much out of people as we can,' he explained.\n\nBut such benefits disappeared when the pandemic hit, never to return. Perez is hopeful, however, that Vegas is only in a temporary slump. 'A flip is going to happen, and I think we're witnessing it right now,' he said. 'I think we're right at the cusp of it. I don't think they can push it much more than they currently are with jeopardizing their profits.'",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Las Vegas tourist slump",
      "weight": 0.07680741
    },
    {
      "name": "Aaron Perez",
      "weight": 0.07150103
    },
    {
      "name": "Perez",
      "weight": 0.07122354
    },
    {
      "name": "Las Vegas",
      "weight": 0.06958388
    },
    {
      "name": "people",
      "weight": 0.06717598
    },
    {
      "name": "GXP Tours Las Vegas",
      "weight": 0.06678835
    },
    {
      "name": "Vegas",
      "weight": 0.062303457
    },
    {
      "name": "free drinks",
      "weight": 0.057369653
    },
    {
      "name": "international tourists",
      "weight": 0.055980686
    },
    {
      "name": "Strip",
      "weight": 0.055189233
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Travel"
    }
  ],
  "taxonomies": [
    {
      "name": "/Travel & Transportation/Tourist Destinations/Other",
      "score": 0.88671875
    },
    {
      "name": "/News/Local News",
      "score": 0.78125
    },
    {
      "name": "/Travel & Transportation/Travel Guides & Travelogues",
      "score": 0.669921875
    },
    {
      "name": "/Reference/Geographic Reference/Other",
      "score": 0.62353515625
    },
    {
      "name": "/Travel & Transportation/Tourist Destinations/Beaches & Islands",
      "score": 0.348876953125
    }
  ],
  "sentiment": {
    "positive": 0.028701775,
    "negative": 0.84867615,
    "neutral": 0.12262211
  },
  "summary": "Event planner Aaron Perez, co-founder of GXP Tours Las Vegas, has revealed that the increasing cost of food and drink in Las Vegas is accelerating the city's tourist slump. He believes that corporate greed is the main reason for the decline in tourism and spending. Perez, who has been an event planner in the city for 16 years, expressed concern over the high prices for drinks, food and entertainment, driving out tourists and locals alike. He cited a friend staying at the ARIA Hotel and Casino where a Diet Coke cost $15 and a bottle of water was $26, and $40 nachos were purchased for $21.50. Perez believes that the rise in prices and politics have contributed to the decrease in international tourists, particularly in response to President Trump's 'America First' approach and rhetoric. He also accused corporations of exploiting their clientele to recoup their losses after the Covid-19 pandemic.",
  "shortSummary": "Las Vegas is experiencing a tourist slump due to high food and drink prices, driven by corporate greed, declining tourism, and political factors.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "18c0afeb7a99418196547c8ab6951611",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Las Vegas event planner Aaron Perez says soaring food, drink and service costs are driving tourists and locals away, blaming corporate greed and a loss of free perks that once attracted visitors. He cites outrageous prices at ARIA and other Strip venues, noting that the city’s reliance on international travelers has weakened amid political and economic pressures. Perez argues that hotels and casinos have abandoned their “comp culture” and are now charging for everything, which hurts the city’s appeal. He believes the industry must return value to customers—an approach his own party‑tour business is adopting—and hopes the slump will reverse soon.",
  "argos_id": "6OOEK8TUR"
}