{
  "url": "https://www.foxnews.com/media/san-francisco-lawyer-says-landlord-has-right-accept-only-maga-voters-israel-supporters-to-open-house",
  "authorsByline": "Rachel del Guidice",
  "articleId": "b270fcf4931646159db94372ed573de7",
  "source": {
    "domain": "foxnews.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://static.foxnews.com/foxnews.com/content/uploads/2021/05/Apartment-For-Rent.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-24T09:00:47-04:00",
  "addDate": "2025-08-24T13:14:33.566389+00:00",
  "refreshDate": "2025-08-24T13:14:33.566391+00:00",
  "score": 1.0,
  "title": "San Francisco lawyer says landlord has right to accept ‘only MAGA voters and Israel supporters’ to open house",
  "description": "A tenant rights lawyer says a San Francisco landlord is legally allowed to limit rental viewings to MAGA voters and Israel supporters amid the city's housing crisis.",
  "content": "A lawyer says a landlord has the right to only allow \"MAGA voters and Israel supporters\" to attend an open house.\n\n\"From the tenant perspective, there isn't a violation here of California or federal law because political orientation is not a protected class,\" Joseph Tobener, a and tenant rights lawyer, told Fox News Digital on Thursday.\n\n\"So things that it might touch upon that are protected class would be ethnicity, source of income, religion,\" he added. \"So there's some things that skirts around, but the words were such that they are all political orientation, which isn't a protected class and not a violation of the Fair Employment and Housing Act in California. Now, with that said, I think what rubs people the wrong way is that we have a new housing shortage in San Francisco because of the AI boom.\"\n\nThe San Francisco Standard reported Tuesday that Alexander Baran, 48, owns a two-bedroom apartment in Sunnyside and had listed it on Zillow, which has since been taken down.\n\nThe listing, which went up Aug. 5 and was removed on Sunday, allegedly said that \"Only and Israel supporters are invited\" to the open house.\n\nWhen the San Francisco Standard went to visit Baran to speak to him about the listing, he allegedly said, \"Get the f--- away from here. Don’t make me repeat myself.\"\n\nTobener, the tenant rights lawyer, said that the City by the Bay is \"about a month into a major housing crisis where people are lining up 20 deep for a unit to try and get one unit or showing up and the unit's already rented.\"\n\nCUOMO PROPOSES 'ZOHRAN'S LAW' TO PROTECT RENT-STABILIZED HOUSING FROM THE WEALTHY\n\nThe concern that people have, he said, is landlords rejecting people that need housing due to their political views.\n\n\"Landlords have a lot of power right now. And so I think that's the concern from the tenant perspective,\" Tobener said. \"Everybody should get a fair shake regardless of their political orientation. Everyone should be able to get access to housing. Housing is a fundamental right. Everyone needs housing. Everyone needs a roof over their heads. And so are we gonna start down this road where only certain people from certain political leanings can get access to certain housing.\"\n\nTo change the law and make political affiliation a protected class, Tobener said that the California state legislature would have to add political affiliations to the Fair Employment and Housing Act as a protected category.\n\nThat move, he said, would certainly be challenged and likely end up in the Supreme Court.\n\n\"I've been doing tenant rights law for 30 years and this will be the third tech boom in San Francisco, and it's a boom and bust city. It always has been since the Gold Rush and what we have right now is this major AI boom with a lot of people wanting to come work here,\" Tobener said.\n\nCLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE\n\nAccording to the Zumper National Rent Report, \"San Francisco led the nation in annual rent growth, with one-bedroom rent up 13.3% and two-bedrooms surging 16.3%.\"\n\n\"First it was the dot-com boom, then it was a social media boom, and now it's the AI boom, and you're getting this circumstance where landlords have a lot of power,\" Tobener added. \"There are a lot of people clamoring for one unit and, you know, we want to make sure that landlords don't, you know, step across the line. And housing is accessible to everyone regardless of, you know, what they think about the political climate.\"\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nFox News Digital reached out to Baran for comment but did not immediately receive a response.",
  "medium": "Article",
  "links": [
    "https://www.foxnews.com/video/6375962367112",
    "https://www.foxnews.com/apps-products?pid=AppArticleLink",
    "https://www.foxnews.com/media/joy-reid-claims-maga-voters-sacrifice-daughters-please-trump",
    "https://www.zumper.com/#rent-report",
    "https://www.foxnews.com/politics/cuomo-proposes-zohrans-law-protect-rent-stabilized-housing-from-wealthy",
    "https://www.tobenerlaw.com/our-team/joseph-tobener/",
    "https://www.foxnews.com/category/us/san-francisco",
    "https://www.foxnews.com/media",
    "https://sfstandard.com/2025/08/19/san-francisco-landlord-maga-voters-apartment/",
    "https://www.foxnews.com/politics/mamdani-zings-cuomo-rent-stabilized-housing-spat-during-anti-trump-tour-stop"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "San Francisco lawyer",
      "weight": 0.086464636
    },
    {
      "name": "tenant rights law",
      "weight": 0.085882895
    },
    {
      "name": "tenant rights lawyer",
      "weight": 0.08353849
    },
    {
      "name": "political orientation",
      "weight": 0.082476154
    },
    {
      "name": "San Francisco",
      "weight": 0.08069415
    },
    {
      "name": "political affiliation",
      "weight": 0.07977305
    },
    {
      "name": "political affiliations",
      "weight": 0.07977305
    },
    {
      "name": "certain political leanings",
      "weight": 0.07847629
    },
    {
      "name": "certain housing",
      "weight": 0.07660444
    },
    {
      "name": "people",
      "weight": 0.06947702
    }
  ],
  "topics": [
    {
      "name": "Voters"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/People & Society/Social Issues & Advocacy/Other",
      "score": 0.8857421875
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.87890625
    },
    {
      "name": "/News/Local News",
      "score": 0.77587890625
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.7744140625
    },
    {
      "name": "/Real Estate/Other",
      "score": 0.61376953125
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Housing & Development",
      "score": 0.46875
    },
    {
      "name": "/Sensitive Subjects/Other",
      "score": 0.43603515625
    },
    {
      "name": "/Law & Government/Government/Visa & Immigration",
      "score": 0.418212890625
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.352783203125
    },
    {
      "name": "/Law & Government/Government/Courts & Judiciary",
      "score": 0.33203125
    },
    {
      "name": "/Law & Government/Legal/Other",
      "score": 0.32958984375
    },
    {
      "name": "/Law & Government/Legal/Real Estate Law",
      "score": 0.324462890625
    }
  ],
  "sentiment": {
    "positive": 0.04883545,
    "negative": 0.69453436,
    "neutral": 0.25663018
  },
  "summary": "Joseph Tobener, a tenant rights lawyer in San Francisco, argues that a landlord can only invite \"MAGA voters and Israel supporters\" to an open house. This is not a violation of California or federal law as political orientation is not considered a protected class. Tobener argues that this exacerbates a housing shortage in the city due to the current AI boom and that everyone should be able to access housing regardless of their political views. He also proposes 'Zohran's Law' to protect rent-stailibated housing from the wealthy.",
  "shortSummary": "A lawyer in San Francisco argues that a landlord can refuse entry to \"MAGA voters\" and \"Israel supporters,\" citing potential violations of the Fair Employment and Housing Act.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "e318335359ed417d8354509305921ce0",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.foxnews.com/media",
      "text": "MASTER OF MARGINS Media Bill Maher hammers Dems on how Trump is taking their voters, says he feels people's 'pain in the a--'\n'EXTRAORDINARY SACRIFICE' Fox News Flash Young tycoon drops truth bomb, arguing work-life balance will keep Gen Z 'mediocre'\n'UNTAPPED AUDIENCES' Media Army’s use of social media influencers for recruitment draws mixed reactions online\nSan Francisco lawyer says landlord has right to accept ‘only MAGA voters and Israel supporters’ to open house\nLargest Christian university celebrates FTC dropping lawsuit, ending years of 'lawfare' from Biden admin\nBill Maher hammers Dems on how Trump is taking their voters, says he feels people's 'pain in the a--'\nEx-Wisconsin university DEI staffer wins $265K settlement after alleging discrimination for being White\nPolitical activist CJ Pearson says White liberals are starting to fear they're losing 'power' over Blacks\nVirginia Lt. Governor on why her state is at risk of losing federal funding over transgender bathrooms\nMSNBC staffers divided over new name but 'cautiously optimistic' about liberal network's post-NBC future\nTop Democrats peeved over $8B Paramount-Skydance merger, citing Trump influence and canceled Colbert show\nEx-Navy SEAL congressman describes emotional reunion with boy he helped save from near-fatal car crash\nRock star melts down after White House calls him 'washed-up,' rages that Trump is a 'low-life fascist'\nTurley hails Trump’s 'tremendous victory' after civil fraud penalty tossed, blasts 'grotesque' use of NY law\nPentagon officials blast Washington Post for putting 'lives at risk' with report on Pete Hegseth’s security\nChris Matthews tells Dems to abandon 'all this other crap' on open borders and trans issues, focus on economy\nCharlie Kirk applauds Lamar Jackson's 'courage and conviction' after backlash for sharing Christian message\nYosemite National Park ranger reportedly fired after draping massive trans pride flag across El Capitan\n'The View' co-host Ana Navarro rips Melania Trump's Putin letter as 'so hypocritical you can't believe it'\nEx-Obama aide warns Democrats can’t counter Trump because voters don’t know what the party stands for\nTrump didn’t cause Russia-Ukraine war, Stephen A. Smith says, blaming Biden, Obama and Clinton in fiery rant\nShari Redstone breaks silence on 'no-brainer' $16M Trump settlement that preceded Paramount-Skydance merger\nTrump praises Melania’s ‘beautiful note’ to Putin, says Zelenskyy brought letter from wife to first lady\nOmen or harbinger of doom? Fox Nation explores the chilling mystery that turned a small town into a spectacle\nFierce backlash to Matt Rife ad campaign left makeup company 'very surprised,' admits brand executive\nCalifornia pastor leads rally at state capitol warning parents to flee state if 'dangerous' bill passes\nJoy Reid claims 'mediocre White men' like Trump, Elvis can't 'invent anything,' steal culture from other races\nParental rights concerns erupt over California bill that would let nonrelatives make decisions for kids\nVenezuelan refugee who fled persecution warns Mamdani's policies mirror ideas that destroyed his country\nJimmy Kimmel dismisses reports of Stephen Colbert's 'Late Show' losing $40 million a year as 'nonsensical'\nOklahoma's 'America First' test for teachers features questions on gender, freedom of religion: report\nChris Pratt wishes RFK Jr., Trump admin success, advises against being 'mired in hatred' for the president\nTrump administration threatens to pull federal funds from Virginia school districts in gender policy dispute\nEric Swalwell rejects Michelle Obama's 'when they go low, we go high' message, vows to 'bury' Republicans\nEx-Washington Post fact checker hits ‘absentee owner’ Bezos, tells him to commit to saving paper or sell it"
    },
    {
      "url": "https://www.foxnews.com/politics/cuomo-proposes-zohrans-law-protect-rent-stabilized-housing-from-wealthy",
      "text": "As part of his renewed New York City mayoral campaign, former Gov. Andrew Cuomo is proposing \"Zohran's law\" to prevent high-income individuals from occupying rent-stabilized apartments. The proposal is a pointed jab at his opponent, Democratic mayoral nominee Zohran Mamdani, who occupies a rent-stabilized apartment in Astoria, Queens.\n\"Rent-stabilized apartments when they're vacant should only be rented to people who need affordable housing, not people like Zohran Mamdani,\" Cuomo told reporters in a video posted on social media.\nCuomo, who resigned as governor of New York in 2021 in the face of multiple controversies, told Mamdani over the weekend that it's \"time to move out.\" The former governor's message, posted on X along with an edited video of Mamdani admitting he pays \"$2,300 for my one bedroom in Astoria,\" has amassed more than 33 million views.\n\"You don't need to be renting rent-stabilized units to wealthy people,\" he continued. \"Otherwise, what you are doing is you are abusing the system. I am going to propose not renting out [rent-stabilized] apartments, by law, except to a person who actually needs affordable housing. And, I'm going to call it 'Zohran's law' because it's an abuse of the system.\"\nChief among Mamdani's now-infamous progressive policy proposals is his commitment to freezing rents.\n\"As Mayor, Zohran will immediately freeze the rent for all stabilized tenants, and use every available resource to build the housing New Yorkers need and bring down the rent,\" according to Mamdani's campaign website.\nSOCIALIST'S NYC MAYORAL WIN SPARKS FIERCE DEBATE OVER FEASIBILITY OF RADICAL POLICY AGENDA\nMamdani has accused incumbent Mayor Eric Adams of appointing Rent Guidelines Board members to raise rents on stabilized apartments. While landlords and advocates argue the freeze would be illegal, Mamdani can accomplish this goal by appointing members to the board who wouldn't vote to increase the rent.\nFormer Mayor Bill de Blasio's board voted to freeze the rent three times during his tenure.\nCuomo was the favorite to win the Democratic nomination in June. But since Mamdani's political upset and Cuomo's subsequent decision to remain in the race as an independent candidate, the former governor has ramped up his social media strategy, opting for snappy videos and punchy attack lines.\nCuomo had previously called the democratic socialist's plan to freeze rent a \"politically convenient posture,\" and said such a move would hurt landlords who would be \"unable to maintain their buildings.\"\nAs Cuomo's fiery social media posts about Mamdani's rent-controlled apartment made the rounds, de Blasio – who has yet to endorse a candidate in the race to run the nation's most populous city – fired back at his governor.\n\"I did a rent freeze and almost 2 million hard-working New Yorkers benefited. @ZohranKMamdani wants to do a rent freeze. You know who doesn’t want to do a rent freeze? @andrewcuomo, and he thinks he can trick us into forgetting that,\" de Blasio trolled on X.\nIn a prior post, Cuomo told his now more than 100,000 followers that because of Mamdani, \"Somewhere last night in New York City, a single mother and her children slept at a homeless shelter,\" and called on him to \"move out immediately and give your affordable housing back to an unhoused family who need it.\"\n\"No matter which way you cut it: Zohran Mamdani is a rich person. You are actually very rich. Yet you and your wife pay $2,300 a month, as you have bragged, for a nice apartment in Astoria. That should be housing for someone who needs it. We are in the middle of a historic affordability crisis. Millions of low income New Yorkers need this apartment and an apartment like it. Yet your apartment remains rented to rich people who don’t need it,\" Cuomo continued.\nDuring a campaign event on Monday, Mamdani responded to Cuomo's freshly proposed law \"that will keep the rich out of New York’s affordable housing.\"\n\"What do we know about this policy proposal beyond the fact that it seeks to evict me from my apartment?\" Mamdani questioned on Monday.\n\"Like so much of Andrew Cuomo's politics, it is characterized by a petty vindictiveness. It leaves far more questions than it has answers. How many New Yorkers would this apply to? How many New Yorkers would be evicted from their apartments? How many New Yorkers would have their lives upended by a former governor who is responding to the fact that he was handily beaten by a tenant of a rent-stabilized apartment?\" Mamdani asked.\n\"I live rent-free in his head,\" Mamdani trolled Cuomo, arguing he had many years to implement such policies as governor but is now only focused on trying to reckon with a \"political defeat.\"\nSoon after Mamdani's criticism, the Cuomo campaign unveiled his proposal to protect rent-stabilized apartments from being occupied by high-income individuals.\nCLICK HERE TO GET THE FOX NEWS APP\n\"Under Cuomo’s proposal, when a rent-stabilized apartment becomes vacant, the incoming individual income would be capped so that the annual rent makes up at least 30 percent of that income. For example, if an apartment rents for $2,500 a month ($30,000 per year), the new tenant’s income could not exceed $100,000,\" according to the plan.\nThe Cuomo campaign also clarified that \"Zohran's law\" would only apply to vacant apartments."
    },
    {
      "url": "https://www.foxnews.com/apps-products?pid=AppArticleLink",
      "text": "Fox News is Everywhere.\nWatch Fox News Channel on all of your devices to keep up to date with the latest in news, politics, entertainment and more. On phones, tablets, wearables and TV, it's easy to stay connected anywhere.\niOS Devices\nAndroid Devices\nApple TV\nRoku\nChromecast\nAndroid TV\nAmazon Fire\nFubo TV\nApple Watch\nAmazon Echo\nGoogle Home\nFox News Go\nApple News\nAT&T TV Now\nYouTube TV\nHulu\nFacebook\nInstagram\nSamsung Devices\nSling TV\nVidgo\nSpotify\niHeartRadio\nFlipboard\nLinkedIn\nGoogle Newsstand\nNewsletters\nYouTube\nFAQ\nHow much data does Fox News Go use?\nFox News Go uses about 2GB per hour of SD viewing and 4GB per hour of HD viewing. This can vary depending on your device and internet connection. If you are concerned about your data usage we recommend not streaming over a cellular network and contacting your Internet or Cellular Service Provider.\nWhat broadcast quality will I get while streaming on my device?\nFox News will stream at the highest quality possible based on your device and internet connection quality. For the best quality we recommend streaming via Wi-Fi or 4G.\nWhat channels are available on Fox News Go?\nYou can Watch Fox News Channel on Fox News Go and Fox Business Channel on Fox Business Go"
    },
    {
      "url": "https://www.foxnews.com/media/joy-reid-claims-maga-voters-sacrifice-daughters-please-trump",
      "text": "Ex-MSNBC host Joy Reid said that MAGA voters would \"let their daughters be destroyed\" just to make President Donald Trump \"happy.\"\nDuring a recent episode of \"NIGHT SCHOOL with Marc Lamont Hill,\" Reid mentioned her concern that Trump \"could declare a national emergency\" and that the country would no longer have \"free and fair elections.\"\nLamont remarked that the \"one glimmer of hope\" he sees is that Trump is limited to this term and questioned whether \"the Trump movement has the ability to move beyond Trump,\" and if Vice President JD Vance can lead MAGA after Trump leaves office.\nTRUMP'S MAGA IMPRINT ON GOP STRONG NOW, BUT WILL IT LAST? EXPERTS WEIGH IN\nReid remarked how former President Barack Obama had an electorate that would only show up for him, and that Trump's following is similar but more cult-like.\n\"There is just an Obama voter that will only vote when Obama is on the ballot and will not vote even below the ballot,\" Reid said. \"They will not vote down ticket, just Obama.\"\n\"Trump has those kind of voters,\" she added. \"They are dedicated to him personally. They care more about him being happy than them being happy. They care more about him having what he wants than them having what they want.\"\n\"They will give up their healthcare. They will let their daughters be destroyed. They will let their families be destroyed. They will do- there's nothing he can do. He can drown them in … Texas. He can take away their FEMA. He can do anything he wants to them. There's nothing you can do about it's a cult.\"\nJOY REID FLOATS SPECULATION THAT HER RACE, 'ANXIETY' SURROUNDING TRUMP PLAYED ROLE IN MSNBC FIRING\nReid then went on to say that she believes Vance does not have what it takes to keep the Trump momentum alive.\n\"And JD Vance, with his lack of charisma, he's just an a--hole, he has no personality,\" Reid said. \"He's the personality of Ron DeSantis. Um, so, no, there is no one else who can run the cult.\"\nHowever, Reid said, she was concerned about White voters and their \"propensity\" to vote for Republicans.\n\"But the problem is, there's the cult and then there is just this propensity among White voters to vote for any Republican and to create an adherence to any Republican because they just hate Democrats, and they don't care … no one likes Ted Cruz, but they'll vote for him any day of the week because he is not a Democrat,\" Reid added."
    },
    {
      "url": "https://www.foxnews.com/politics/mamdani-zings-cuomo-rent-stabilized-housing-spat-during-anti-trump-tour-stop",
      "text": "Zohran Mamdani, New York City's Democratic mayoral nominee, continued his \"Five Boroughs Against Trump\" tour in Brooklyn on Tuesday, as President Donald Trump's agenda continues to take center stage on the New York City campaign trail.\nSpeaking at the Flatbush Gardens Community Center, Mamdani's second anti-Trump event of the week was focused on housing, a hot-button issue in the New York City mayoral race as former Gov. Andrew Cuomo has spent days criticizing Mamdani's rent-stabilized apartment in Astoria.\n\"We must remember that Andrew Cuomo has spent more time talking about my apartment than asking why so many New Yorkers are being forced out of theirs. He has spent more time criticizing me than he has in criticizing the legislation that Donald Trump has passed,\" Mamdani said on Tuesday.\nMamdani began his week-long tour alongside Rep. Jerry Nadler, D-N.Y., in Manhattan on Monday morning. After visiting Brooklyn on Tuesday, Mamdani will travel to Staten Island on Wednesday, the Bronx on Thursday and Queens on Friday, Fox News confirmed.\nCUOMO PROPOSES 'ZOHRAN'S LAW' TO PROTECT RENT-STABILIZED HOUSING FROM THE WEALTHY\nThe 33-year-old self-described socialist's tour is a rejection of the Trump administration's sweeping second-term agenda and his so-called \"authoritarian\" attack on working New Yorkers, with Tuesday's event focused on housing.\nZOHRAN MAMDANI LAUNCHES ANTI-TRUMP TOUR ACROSS FIVE BOROUGHS IN NEW YORK CITY\n\"While housing experts are ringing the alarm, Andrew Cuomo is ringing Donald Trump,\" Mamdani said.\nDuring Mamdani's events on Monday and Tuesday, reporters peppered the 33-year-old socialist candidate with questions about Cuomo's latest policy proposal – \"Zohran's law.\"\nThe former governor, who lost the Democratic mayoral primary to Mamdani in June, began trolling the assemblyman over the weekend with an edited video of Mamdani admitting he pays \"$2,300 for my one bedroom in Astoria.\"\n\"Rent-stabilized apartments when they're vacant should only be rented to people who need affordable housing, not people like Zohran Mamdani,\" Cuomo told reporters in a video posted on social media.\nCuomo said \"Zohran's law\" was designed to prevent high-income individuals from occupying rent-stabilized apartments.\nBut Mamdani fired back at Cuomo's criticism on Tuesday, telling reporters, \"It pains me to say that in our disgraced former Governor Andrew Cuomo's mind, these units, these buildings, these tenants are but a political pawn.\"\nChief among Mamdani's now-infamous progressive policy proposals is his commitment to freezing rents.\n\"As Mayor, Zohran will immediately freeze the rent for all stabilized tenants, and use every available resource to build the housing New Yorkers need and bring down the rent,\" according to Mamdani's campaign website.\nMamdani has accused incumbent Mayor Eric Adams of appointing Rent Guidelines Board members to raise rents on stabilized apartments. While landlords and advocates argue the freeze would be illegal, Mamdani can accomplish this goal by appointing members to the board who wouldn't vote to increase the rent.\nFormer Mayor Bill de Blasio's board voted to freeze the rent three times during his tenure.\nCuomo had previously called the democratic socialist's plan to freeze rent a \"politically convenient posture,\" and said such a move would hurt landlords who would be \"unable to maintain their buildings.\"\nAs Cuomo's fiery social media posts about Mamdani's rent-controlled apartment made the rounds, de Blasio – who has yet to endorse a candidate in the race to run the nation's most populous city – fired back at his former governor.\n\"I did a rent freeze and almost 2 million hard-working New Yorkers benefited. @ZohranKMamdani wants to do a rent freeze. You know who doesn’t want to do a rent freeze? @andrewcuomo, and he thinks he can trick us into forgetting that,\" de Blasio trolled on X.\nDuring the first stop on his anti-Trump tour on Monday, Mamdani responded to Cuomo's freshly proposed law \"that will keep the rich out of New York’s affordable housing.\"\n\"What do we know about this policy proposal beyond the fact that it seeks to evict me from my apartment?\" Mamdani questioned on Monday.\n\"Like so much of Andrew Cuomo's politics, it is characterized by a petty vindictiveness. It leaves far more questions than it has answers. How many New Yorkers would this apply to? How many New Yorkers would be evicted from their apartments? How many New Yorkers would have their lives upended by a former governor who is responding to the fact that he was handily beaten by a tenant of a rent-stabilized apartment?\" Mamdani asked.\n\"I live rent-free in his head,\" Mamdani trolled Cuomo, arguing that he had many years to implement such policies as governor but is now only focused on trying to reckon with a \"political defeat.\"\nSoon after Mamdani's criticism, the Cuomo campaign unveiled his proposal to protect rent-stabilized apartments from being occupied by high-income individuals.\n\"Under Cuomo’s proposal, when a rent-stabilized apartment becomes vacant, the incoming individual income would be capped so that the annual rent makes up at least 30 percent of that income. For example, if an apartment rents for $2,500 a month ($30,000 per year), the new tenant’s income could not exceed $100,000,\" according to the plan.\nThe Cuomo campaign also clarified that \"Zohran's law\" would only apply to vacant apartments.\nMamdani poured cold water on Cuomo's plan during the press conference on Tuesday, telling reporters, \"What is so absurd to me about Andrew Cuomo's proposal is that it wouldn't even apply to me. The way that he has put forward this language does not actually apply to me, and yet he uses my name in it.\"\nWhen reached for comment regarding Mamdani's anti-Trump tour, White House spokeswoman, Abigail Jackson, told Fox News Digital, \"Comrade Mamdani is the American people’s worst nightmare. His communist policies will crater our economy, increase crime, crowd out Americans with free health care for illegal immigrants, and defund the brave men and women of law enforcement who keep us safe.\"\nCLICK HERE TO GET THE FOX NEWS APP\nThe White House added that \"Mamdani's idea of ‘immigration reform’ is no borders and amnesty for all the violent criminal illegal aliens that Joe Biden released into our country. The American people have repeatedly rejected this Communist agenda and the more Mamdani shares his radical policies, the more the American people will recoil.\"\nFox News' Marly Carroll and Bryan Llenas contributed to this report."
    },
    {
      "url": "https://sfstandard.com/2025/08/19/san-francisco-landlord-maga-voters-apartment/",
      "text": "The spacious two-bed apartment in Sunnyside had the makings of a steal. At $3,500 per month, the unit — with a private deck, sweeping city views, and in-unit laundry — was a reasonable deal in a market where prices are soaring and housing is in short supply.\nThere was just one catch regarding the open house: “Only MAGA voters and Israel supporters are invited,” the Zillow listing said.\nThe listing went live Aug. 5 and was deactivated Sunday, although it’s unclear if a tenant snatched up the unit. The Standard visited the property Monday and found no obvious signs of an imminent move-in.\nProperty records show the building is owned by Alexander Baran, 48, a quality assurance director who appears to live in another unit there. He declined to comment during our visit.\n“Get the fuck away from here,” Baran said from the doorway. “Don’t make me repeat myself.”\nProperty records show Baran purchased the two-unit property in 2004.\nThe listing drew the ridicule of commenters on Reddit.\n“Leave it to MAGA to just go straight blatant housing discrimination,” one commenter said.\nBut attorneys say no applicable civil rights laws apply.\n“Political affiliation, unfortunately, is not a protected characteristic,” said Joseph Tobener, a San Francisco tenant rights attorney.\nThe Unruh Civil Rights Act and Fair Employment Housing Act protect against discrimination on the basis of characteristics like gender, race, and sexual orientation.\n“There also might be some First Amendment questions here — in terms of the landlord having protections,” Tobener said.\nElection data shows that in November, roughly 1 in 7 Sunnyside voters cast their ballots for Donald Trump. That’s more red than the Castro and Haight-Ashbury — which went nearly all in on Kamala Harris — but solidly blue compared to their neighbors in southern neighborhoods like the Excelsior and Visitacion Valley, where nearly half the voters in some precincts voted for Trump.\nDavid Blosser, director of leasing at RentSFNow, said the San Francisco rental market is at its hottest in years.\n“June was really the pivotal moment where the market shifted,” Blosser said. “Suddenly we were having back-to-back applicants for units across our portfolio, and really we hadn’t seen that since before the pandemic.”\nBlosser said many tenants are techies coming to the city for the AI boom. In trendy neighborhoods like Nob Hill, Blosser said he has signed tenants within two days of listing rentals."
    },
    {
      "url": "https://www.tobenerlaw.com/our-team/joseph-tobener/",
      "text": "- Home\n- San Francisco Bay Area Tenant Lawyers\n- Joseph Tobener\n20\nYears of Service\n$100M\nRecovered\n99%\nSuccess Rate\n1000+\nFive-star Reviews\nJoseph Tobener is a partner at Tobener Ravenscroft. An attorney for more than twenty years, Mr. Tobener draws on his specialized tenant law expertise to provide caring, easy-to-understand, and aggressive assistance to a diverse clientele. He has represented thousands of Bay Area residents on tenant law issues and earned millions on behalf of his clients. He has appeared on NPR’s Marketplace, KALW, and KQED and was featured in the SF Bay Guardian, the Daily Journal, and California Lawyer. Cases he has successfully litigated have been featured in the San Francisco Chronicle, the New York Times, Reuters, Wired, and the Los Angeles Times. He has spoken extensively on tenant law for the San Francisco Bar Association and the Alameda Bar Association.\nHis clients have included countless lawyers, high-tech executives, mobile home residents, the San Francisco Tenants Union, and several art collectives. One of his passions is working to preserve artist live/work housing. He also worked for Home Base, a homelessness law nonprofit, and has been an adjunct professor at San Francisco State University and UC College of the Law, San Francisco (formerly UC Hastings). The firm is dedicated to employee activism and sponsors each of its lawyers to volunteer weekly in the community at housing rights nonprofits, donating nearly 500 attorney hours each year.\nJoe was selected to the 2017, 2018, 2019, 2020, 2021 and 2022 Northern California Super Lawyer list by Super Lawyers, an honor reserved for lawyers who exhibit excellence in practice. Only 2.5% of attorneys in Northern California receive this distinction.\nEducation"
    },
    {
      "url": "https://www.foxnews.com/category/us/san-francisco",
      "text": "California 1 day ago Keffiyeh-clad anti-ICE protester threatens to stab agent, harm family in San Francisco mob attack A mob of up to 20 protesters attacked immigration agents outside a San Francisco courthouse. One keffiyeh-clad agitator allegedly threatened to stab an officer and kill his family.\nNancy Pelosi July 31 Pelosi calls Lady Gaga concert in San Francisco 'the most fun I've had in a long time' Nancy Pelosi attended Lady Gaga's Mayhem Ball Tour concert in San Francisco with husband Paul Pelosi, describing the performance as a \"fabulous show.\"\nRestaurants July 29 Restaurant shuts down after chef insults TikTok influencer, prompting outrage: 'Still shaking' San Francisco's Kis Café recently closed down after chef Luke Sung's confrontation with a TikTok influencer went viral, with the restaurant calling his behavior \"unacceptable.\"\nSan Francisco July 22 San Francisco close to taking new step to fight homelessness San Francisco is set to crack down on homelessness with officials voting on strict new parking limits for recreational vehicles throughout the city.\nCrime July 21 American religious studies teacher survives horrific migrant attack while vacationing in Italy San Francisco religion teacher Nicholas Pellegrino survives violent attack by migrants on an Italian train, sustaining a neck wound when assailants stole his belongings\nJustice Department July 17 EXCLUSIVE: Trump administration eyes Alcatraz reopening to house nation’s ‘worst of the worst’ Attorney General Pam Bondi and Interior Secretary Doug Burgum toured Alcatraz Island to assess its potential reopening as a federal prison at President Donald Trump's direction.\nImmigration July 10 WATCH: ICE agents fight off masked mob outside blue city immigration court Video captured masked protesters in keffiyeh scarves clashing with ICE agents outside San Francisco Immigration Court.\nMedia June 30 'Queer' San Francisco bookstore pulls 'Harry Potter' series after Rowling launches women's legal fund A San Francisco bookstore said it was pulling author J.K. Rowling's \"Harry Potter\" series because she was privately funding a \"women's rights\" legal fight.\nMedia June 21 Mayor of nation's 'best-run' city credits focus on responsible budgeting, public safety The mayor of Provo, Utah, tells Fox News Digital what led to the city being recognized as the nation's \"best-run\" in a new WalletHub survey.\nCulture Trends June 17 San Francisco ranked worst-run major city in America: report A study ranks San Francisco as the worst-run city among 148 largest U.S. cities, evaluating financial stability, education, health, safety, economy, and infrastructure.\nU.S. Defense & Military Politics June 3 Navy ship USNS Harvey Milk to be renamed as part of Pentagon's 'warrior culture' shift Defense Secretary Pete Hegseth has ordered the renaming of a U.S. Navy ship named after San Francisco gay rights activist Harvey Milk.\nCalifornia May 29 San Francisco school district ditches proposed 'Grading for Equity' strategy after backlash from community The San Francisco Unified School District said is shuttering a recently proposed grading strategy after it received major bipartisan backlash from community members and politicians.\nCalifornia May 21 California woman allegedly tried to smuggle 151 pounds of marijuana onto international flight Diane Bahlawan, 34, is facing multiple charges after reportedly being caught at San Francisco International Airport with 151 pounds of cannabis in her luggage.\nMedia May 18 College dropouts celebrate at unconventional 'graduation' ceremony in San Francisco College dropouts coalesced around their common interest of pursuing their own path and rejecting the tradition of getting a college education at \"dropout graduation.\"\nUS May 10 Uncle Sam’s Devil’s Island: From Al Capone to ‘Machine Gun’ Kelly, meet Alcatraz’s most infamous inmates Take a look a the most infamous inmates at Alcatraz as President Donald Trump is looking to reopen the prison off the coast of San Francisco, California.\nPolitics May 7 Trump pushes to reopen Alcatraz, but Pelosi and Newsom dismiss it as a 'distraction' As President Donald Trump's administration takes its first steps to open the infamous Alcatraz, California politicians Mayor Daniel Lurie, Gov. Gavin Newsom and Rep. Nancy Pelosi say the plan is \"not a serious one.\"\nAirlines May 7 United Airlines planes in San Francisco clip wings A United Airlines plane's wingtip struck the wingtip of another United Airlines aircraft, the Federal Aviation Administration confirmed with Fox News Digital.\nMedia Buzz May 7 Trump takes on Hollywood, Alcatraz, calls Pope Donald image a joke The Trump administration's latest publicly-fought battles come as he pushes for steep film tariffs and the reopening of one of America's most notorious prisons.\nMedia May 5 Legal experts say Trump can definitely reopen Alcatraz, but could face 'avalanche of lawsuits' Legal experts told Fox News on Monday that President Trump could \"absolutely\" reopen Alcatraz off the California coast but could face legal challenges.\nAdam Schiff April 26 Adam Schiff reveals what a San Francisco cashier bluntly told him about Dems, warns party has 'major problem' Sen. Adam Schiff, D-Calif., shared a story about how his luggage was stolen from his car while visiting San Francisco during his appearance on \"Real Time with Bill Maher.\"\nWoke Culture April 19 Drag queen group mocks Jesus, Christianity in Easter show marketed to kids A drag queen group called the Sisters of Perpetual Indulgence is sparking controversy in the days leading up to their annual transgender Easter event.\nMedia April 16 Tech company reverses policy after Christian group sues for religious discrimination Software company Asana reversed course after facing a lawsuit alleging its policy denying subscription discounts to religious groups was illegal, according to ADF.\nMedia April 15 Mayor Daniel Lurie sees 'vibe shift' in San Francisco as he works to clean up city Democratic San Francisco Mayor Daniel Lurie declared that more and more people are proud to be San Franciscans again as he has worked to bring order to its streets.\nVIDEO April 12 Nude sculpture stands 'tall and proud' above San Francisco's Embarcadero Plaza \"R-Evolution,\" the 2015 45-foot-tall sculpture of a nude woman, was originally created for Burning Man before making its current home in San Francisco. (Credit: KTVU)\nUS April 12 Massive nude woman sculpture in blue city sparks reaction after public unveiling: 'Embarrassed' San Francisco unveiled a 45-foot nude statue, prompting criticism across the political spectrum as homelessness and public safety dominate headlines.\nVIDEO April 12 San Francisco nude statue installation causes backlash “R-Evolution,” a 2015 statue commemorated for the Burning Man festival of the same year, was recently installed at the Embarcadero facing the Ferry Building in San Francisco. (Credit: KTVU)\nTravel April 11 Airport's strict 'quiet policy' has flight passengers sounding off Flight passenger shares San Francisco International Airport's quiet policy, which was launched in 2018. Reddit users and a travel expert weighs in.\nGavin Newsom March 28 Newsom-backed San Francisco speed camera program fines certain drivers more than others San Francisco launched a pilot program approved by California Gov. Gavin Newsom that allows the city to issue fines to speeding drivers based on income.\nMedia March 18 San Francisco Pride takes financial hit after major companies pull sponsorships amid DEI fallout San Francisco Pride org takes financial hit due to several companies pulling funding amid the trend of businesses pulling back on DEI initiatives.\nCalifornia March 15 Preacher doesn't flinch as activist points apparent gun at his head Heart-pounding video shows the moment a pastor had an apparent gun pointed in his face by an activist – but the cool-headed preacher hardly moves a muscle."
    }
  ],
  "argos_summary": "A San Francisco landlord posted a Zillow listing for a two‑bedroom apartment that restricted open‑house invitations to \"MAGA voters and Israel supporters,\" sparking accusations of political discrimination. Tenant‑rights lawyer Joseph Tobener explained that political affiliation is not a protected class under California law, so the listing does not violate the Fair Employment and Housing Act. The story highlights the city’s acute housing shortage amid the AI boom and soaring rents, with landlords wielding significant power over who can secure units. The article also briefly mentions former Gov. Andrew Cuomo’s proposed \"Zohran’s law\" aimed at limiting high‑income occupants of rent‑stabilized apartments, though it is unrelated to the Zillow case.}",
  "argos_id": "6SO2E2KXW"
}