{
  "url": "https://www.dailymail.co.uk/sport/afl/article-15030643/Brendan-Fevola-AFL-grand-final-2025-axe-Snoop-Dogg-entertainment-homophobic-women-controversy-Izak-Rankine.html",
  "authorsByline": "James Cooney",
  "articleId": "c75b651a47f0458eb9b8f9d005bf11b7",
  "source": {
    "domain": "dailymail.co.uk",
    "paywall": false,
    "location": {
      "country": "gb",
      "city": "London",
      "coordinates": {
        "lat": 51.5073219,
        "lon": -0.1276474
      }
    }
  },
  "imageUrl": "https://i.dailymail.co.uk/1s/2025/08/25/04/101513943-0-image-a-11_1756091347808.jpg",
  "country": "gb",
  "language": "en",
  "pubDate": "2025-08-25T04:54:42+01:00",
  "addDate": "2025-08-25T03:59:59.590854+00:00",
  "refreshDate": "2025-08-25T03:59:59.590856+00:00",
  "score": 1.0,
  "title": "Footy legend claims AFL will make last-minute change to grand final",
  "description": "Footy legend Brendan Fevola made his shocking prediction on Monday, telling his radio co-hosts, 'This will happen, take that to the bank.'",
  "content": "Footy legend Brendan Fevola has claimed controversial US rapper Snoop Dogg will be dumped as the headline AFL Grand Final entertainment act due to controversy around his songs and comments on women and gay people.\n\nThe rapper's selection to perform at the AFL's showpiece event has divided Aussies, with some saying that the league is abandoning its platform of respecting women by hiring Snoop.\n\nThe hip-hop icon has also made controversial comments about same-sex relationships last week as Adelaide star Izak Rankine was suspended for four matches for directing a homophobic slur at an opponent.\n\nFevola believes that the AFL will backflip and axe Snoop from his headlining gig.\n\n'On Snoop Dogg, I might have some goss about that,' Fevola told 101.9 The Fox’s Fifi, Fev & Nick on Monday.\n\n'They're going to axe him.'\n\n'Because of his lyrics in his song and he talked about gay parents over the weekend.\n\n'I think he will get the a**e, and they are going to go for an Aussie artist to play at the MCG.\n\n'That will happen, take that to the bank. He will get the [arse], which he should.'\n\nGiven Snoop's huge profile, the move would be sure to make headlines outside Australia.\n\nLast week, Dillon defended the AFL's decision to pay Snoop a rumoured $2million to perform at the grand final.\n\n'We cannot vouch for every lyric in every song ever written or performed by any artist who has or will appear on our stage, Australian or international,' he said.\n\n'It's also important to remember that we have engaged Snoop Dogg in 2025 as the person he is today.\n\n'He has spoken publicly about his past, he has changed, and today he is a grandfather, philanthropist, he helps rehabilitate youth, and he's a global entertainer who has performed at both the Super Bowl and the Olympic closing ceremony to audiences of more than 100 million people.\n\n'In those environments, his performances were appropriate and well-received, and his performance this year at our grand final will be fitting for the best sporting event in the country.'\n\nHowever, Snoop proved Dillon wrong when he appeared on a podcast last Thursday.\n\nThe 53-year-old was discussing taking his grandson to see the kids' movie Lightyear, which features two female characters who kiss.\n\nSnoop Dogg said his grandson asked him, 'Papa Snoop, how she have a baby with a woman? She's a woman.'\n\nHe responded, 'Aw s**t, I didn't come here for this s**t, I just came here to watch the goddamn movie.\n\n'So that's like f**k me, I'm scared to go to the movies now, y'all throwing me in the middle of this s**t that I don't have an answer for ... it threw me for a loop.\n\n'These are kids ... [do] we have to show that at that age? They're going to ask questions. I don't have the answer.'\n\nSnoop also said 'they putting it everywhere' as he began talking about the depiction of same-sex relationships in popular culture.\n\nSimple Google searches will bring up Snoop's past scandals around homophobia.\n\nIn 2014 he published then deleted an Instagram post with a photo of two men sharing a bed and the words 'go suck ya man n get off my line f**'.\n\nThree years later, the video for his song Moment I Feared saw him accused of open homophobia for attacking rapper Young Thug - who has often worn women's clothing - in a comedy skit that saw him interview a fictional rapper wearing high heels and carrying a pink handbag.\n\nCritics of the AFL's choice have also raised Snoop's long history of sexist and misogynistic lyrics and song titles.\n\nThe rapper's 1998 hit Doggz Gonna Get Ya features the same slur, 'f****t', that Rankine used.",
  "medium": "Article",
  "links": [
    "https://www.dailymail.co.uk/tvshowbiz/snoop-dogg/index.html",
    "https://www.dailymail.co.uk/sport/afl/index.html",
    "https://www.dailymail.co.uk/sport/afl/article-15023711/AFL-Snoop-Doggs-controversial-gay-homophobic-sex.html",
    "https://www.dailymail.co.uk/tvshowbiz/brendan-fevola/index.html"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Snoop Dogg",
      "weight": 0.09487062
    },
    {
      "name": "controversial US rapper Snoop Dogg",
      "weight": 0.09438151
    },
    {
      "name": "Snoop",
      "weight": 0.08733402
    },
    {
      "name": "AFL Grand Final",
      "weight": 0.06842072
    },
    {
      "name": "AFL",
      "weight": 0.066617705
    },
    {
      "name": "rapper Young Thug",
      "weight": 0.06254517
    },
    {
      "name": "song titles",
      "weight": 0.05994301
    },
    {
      "name": "Last week",
      "weight": 0.058752146
    },
    {
      "name": "last week",
      "weight": 0.058752146
    },
    {
      "name": "Footy legend Brendan Fevola",
      "weight": 0.055396732
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.91259765625
    },
    {
      "name": "/News/Sports News",
      "score": 0.767578125
    }
  ],
  "sentiment": {
    "positive": 0.054289505,
    "negative": 0.7179229,
    "neutral": 0.22778746
  },
  "summary": "Footy legend Brendan Fevola has claimed that controversial US rapper Snoop Dogg will be removed from the headline AFL Grand Final entertainment act due to controversy surrounding his songs and comments on women and gay people. His selection to perform at the AFL's showpiece event has divided Aussies, with some believing that the league is abandoning its platform of respecting women by hiring Snoop. The hip-hop icon has also made controversial comments about same-sex relationships, following the recent suspension of Adelaide star Izak Rankine for using a homophobic slur. Despite this, Snoop's performance at the grand final has been well-received and has been supported by the AFL for a rumoured $2m.",
  "shortSummary": "Footy legend Brendan Fevola claims Snoop Dogg will be dropped from the AFL Grand Final due to his controversial lyrics and comments.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "3ea32dccdc744a82abf1a19523eb9f30",
  "places": [
    {
      "osmId": "210337258",
      "road": "Brunton Avenue",
      "suburb": "East Melbourne",
      "city": "Melbourne",
      "state": "Victoria",
      "postcode": "3004",
      "country": "Australia",
      "countryCode": "au",
      "coordinates": {
        "lat": -37.819908999999996,
        "lon": 144.98322500667754
      }
    }
  ],
  "scraped_sources": [
    {
      "url": "https://www.dailymail.co.uk/sport/afl/article-15023711/AFL-Snoop-Doggs-controversial-gay-homophobic-sex.html",
      "text": "- Hip-hop icon is due to perform at this year's grand final\nSnoop Dogg has made controversial comments on same-sex relationships just a day after AFL CEO Andrew Dillon said homophobic statements were in the rapper's past ahead of his performance at this year's grand final.\nThe hip-hop icon's take on gay unions came on the same day Adelaide star Izak Rankine was suspended for four matches after his team brought up Snoop's past comments on gay people in an attempt to get the ban reduced.\nSpeaking on the It's Giving podcast on Thursday, the 53-year-old was talking about the way black men are represented on TV shows, movies and in commercials when he told an anecdote about taking his grandson to see the Toy Story spin-off movie Lightyear.\nThe movie features two female characters who kiss.\nSnoop Dogg said his grandson asked him, 'Papa Snoop, how she have a baby with a woman? She's a woman.'\nHe responded, 'Aw s**t, I didn't come here for this s**t, I just came here to watch the goddamn movie.\nHip-hop icon Snoop Dogg (pictured) has gone on a controversial rant about same-sex relationships on the same day the AFL's homophobia crisis came to a head\nIzak Rankine (pictured) was given a four-match ban for hitting an opponent with an anti-gay slur during a match at around the same time Snoop made his remarks\nAFL CEO Andrew Dillon (pictured) also defended Snoop on Thursday, saying the rapper had 'changed' and the league chose him based on 'the person he is today'\n'So that's like f**k me, I'm scared to go to the movies now, y'all throwing me in the middle of this s**t that I don't have an answer for ... it threw me for a loop.\n'These are kids ... [do] we have to show that at that age? They're going to ask questions. I don't have the answer.'\nSnoop also said 'they putting it everywhere' as he began talking about the depiction of same-sex relationships in popular culture.\nOn Thursday, Dillon defended the AFL's decision to pay Snoop a rumoured $2million to perform at the grand final.\n'We cannot vouch for every lyric in every song ever written or performed by any artist who has or will appear on our stage, Australian or international,' he said.\n'It's also important to remember that we have engaged Snoop Dogg in 2025 as the person he is today.\n'He has spoken publicly about his past, he has changed, and today he is a grandfather, philanthropist, he helps rehabilitate youth, and he's a global entertainer who has performed at both the Super Bowl and the Olympic closing ceremony to audiences of more than 100 million people.\n'In those environments, his performances were appropriate and well-received, and his performance this year at our grand final will be fitting for the best sporting event in the country.'\nThe music superstar blasted the depiction of same-sex relationships in movies during his appearance on the It's Giving podcast (pictured)\nSimple Google searches will bring up Snoop's past scandals around homophobia.\nIn 2014 he published then deleted an Instagram post with a photo of two men sharing a bed and the words 'go suck ya man n get off my line f**'.\nThree years later, the video for his song Moment I Feared saw him accused of open homophobia for attacking rapper Young Thug - who has often worn women's clothing - in a comedy skit that saw him interview a fictional rapper wearing high heels and carrying a pink handbag.\nCritics of the AFL's choice have also raised Snoop's long history of sexist and misogynistic lyrics and song titles.\nThe rapper's 1998 hit Doggz Gonna Get Ya features the same slur, 'f****t', that Rankine used.\nAdelaide were able to get Rankine's suspension reduced by one week, giving him a slim chance of playing in the grand final if the club makes it that far, but the Snoop tactic was not successful.\nInstead, the AFL revealed 'compelling medical submissions' about the effect of a season-ending ban on Rankine's mental were what changed the league's mind.\nThat decision left Hawthorn legend Jason Dunstall angry and bewildered.\n'I'm about as confused as I could possibly be,' Dunstall told Fox Footy.\n'I regard myself as at least a semi-intelligent man. I don't know how compelling medical evidence gets you from five weeks down to four, and if we're talking about mental health, by what metric, measurement scale are we saying that equates to one week?\n'I don't understand, I'm confused. Can someone explain it to me?'\nHe was joined by Collingwood great Tony Shaw, who wrote on X: 'The compelling medical advice taken into account on Rankine plea? Izak is feeling sad that he stuffed up badly, letting himself, teammates and club down. Well blow me down that deserves one week less? AFL incompetent, amateurish, laughable.'"
    },
    {
      "url": "https://www.dailymail.co.uk/tvshowbiz/brendan-fevola/index.html",
      "text": "Advertisement\nRELATED TOPICS FOR Brendan Fevola\nBrendan Fevola - Latest news, views, gossip, photos and video\nPage\nFooty legend Brendan Fevola claims the AFL is about to make a sensational last-minute change to the grand final that will make headlines around the world\n25/08/25 03:54\nFooty legend Brendan Fevola made his shocking prediction on Monday, telling his radio co-hosts, 'This will happen, take that to the bank.'...read\nLindy Klim announces shock career move: 'You're about to laugh at my expense!'\n20/08/25 00:13Lindy Klim stunned fans on Tuesday night by announcing a shock career move.Brendan Fevola lists stunning five-bedroom Melbourne home for $4.5million\n15/08/25 00:30Brendan Fevola and his wife Alex have listed their stylish Melbourne home on the market for $4.5m, four years after purchasing it.Mia Fevola puts on a brave face at hotel launch in Melbourne after announcing split with boyfriend and being kicked off Dancing with the Stars\n31/07/25 11:50Mia Fevola has suffered a few blows in recent weeks, but she is still smiling.British woman reveals how she was scammed out of $22,000 by a fake Dr Chris Brown\n24/07/25 08:34A middle-aged British woman is the latest victim to be targeted by a love scam using AI-generated videos and images of Dr Chris Brown.Troubled footy star's ex speaks for the first time since their split in cryptic video about disturbing behaviour\n09/07/25 06:19Jamarra Ugle-Hagan's ex girlfriend, Liv Kelly, has commented for the first time since the couple's breakup in 2024, making a cryptic post about disturbing behaviour.Brendan Fevola reveals what REALLY happened in wild footy brawl that saw him sent off the field - and the very Aussie thing he did straight after\n01/07/25 09:18Brendan Fevola has opened up on what really happened during his viral on-field scuffle during a local footy game this weekend.See the moment AFL legend turned radio star Brendan Fevola gets into a fight with three rivals in footy grudge match\n30/06/25 01:26The Carlton Blues great has regularly helped out struggling footy clubs lately - but he got a bit more than he bargained for when he ran out for South Whyalla.Footy legend Brendan Fevola calls for drastic change at Carlton - 'the board is just there for themselves'\n28/06/25 05:43AFL legend Brendan Fevola has called for fresh faces at Carlton following the horror 50-point loss to Port Adelaide on Thursday. It follows fans vandalising the club's headquarters as frustration mounts.Mia Fevola confirms she is single after two-year romance with boyfriend Bass Miller\n15/06/25 01:26Mia Fevola is back on the market after officially confirming she is single.The shock reason Dancing With The Stars contestant Osher Günsberg wore the same outfit on two shows\n13/06/25 12:06Osher Günsberg is no stranger to glitzy getups, but fans were left stunned after spotting a very familiar jacket in promos for the upcoming season of Dancing With The Stars.Mia Fevola takes embarrassing tumble ahead of Dancing With The Stars premiere: 'Not off to a great start'\n13/06/25 05:44Mia Fevola's rehearsals have begun for the 22nd season of Dancing With The Stars.Radio star Fifi Box shocks co-hosts with X-rated mistake live on air: 'Oopsie daisy'\n06/06/25 01:13Fifi Box made a very X-rated mistake live on The Fox's Fifi, Fev & Nick radio show on Thursday morning.Guy Sebastian hobbles out of court on crutches during trial with former manager Titus Day after being rushed to hospital for shock injury\n04/06/25 01:45Guy Sebastian hobbled out of Sydney's Downing Centre District Court on a set of crutches on Tuesday, just weeks after suffering a serious leg injury.Alex Fevola, 48, shows off her incredibly youthful looks in sleek black ensemble as she attends Melbourne Autumn Ball\n29/05/25 13:12Alex Fevola was looking decades younger than her years as she stepped out at a glitzy event on Thursday.Footy champ Brendan Fevola announces shock career move with starring role in feature film\n19/05/25 11:27Famed Australian footy star Brendan Fevola is set to make his movie debut.Guy Sebastian shares sweet throwback photo with wife Jules as the couple celebrate 17 years of marriage... after the pop star suffered a horrific sporting injury\n17/05/25 11:15Guy Sebastian has shared a sweet tribute to his wife Jules, as the couple celebrate their 17th wedding anniversary.Guy Sebastian rushed to hospital and awaiting surgery after serious injury: 'He's not well'\n12/05/25 00:20Australian music icon Guy Sebastian has landed in hospital after injuring himself during a footy match with AFL great Brendan Fevola.Brendan Fevola leads struggling footy side to victory, but it was bad news for singer Guy Sebastian\n10/05/25 06:00Brendan Fevola made a surprise return to the footy field on Saturday morning, helping struggling local club Masala Dandenong break a long losing streak in front of a buzzing crowd at Lois Twohig ReserveWhy AFL legend Brendan Fevola and Guy Sebastian have been investigated for trying to play a game of footy\n08/05/25 00:38AFL legend Brendan Fevola has agreed to make a shock return to footy alongside Aussie music star Guy Sebastian - but the famous pair were hit with a surprising hurdle.Celebrity pair kicked off The Amazing Race Australia after heated off-camera clash with TikTok stars\n29/04/25 10:39Brendan Fevola has reportedly had Ant Middleton and his brother Dan disqualified from The Amazing Race Australia: Celebrity Edition following an off-camera incident overseas.Fifi Box reveals horrifying moment she saved a drowning baby's life while on holiday in the Maldives: 'I was traumatised'\n29/04/25 02:26Fifi Box has revealed how a harrowing ordeal, that saw her leap into action to save a baby's life, left her traumatised.Pretty in pink! Mia Fevola stuns as she flaunts her toned frame and pert derrière in skimpy bikini\n17/04/25 00:46Mia Fevola ensured all eyes were on her on when she hit the beach in Melbourne for a refreshing dip.Footy great Brendan Fevola's daughter slams him over his 'disgusting' habit of leaving a VERY personal item in his car\n09/04/25 01:52The former Carlton full forward's daughter Lulu has treated her followers to a hilarious video sowing her exposing her famous dad's awful personal hygiene habit.The Amazing Race Australia 2025 cast confirmed - and it features surprising celebrity from rival network\n19/03/25 04:03The all-star cast of the upcoming The Amazing Race Australia has been revealed, and it features some very surprising faces.All-star cast of The Amazing Race 2025 is leaked ahead of the series premiere - and it features a legendary AFL player and veteran reality TV star\n17/03/25 23:18Excitement is soaring with preparations for the 2025 season of Channel Ten's The Amazing Race Australia well underway and the star-studded lineup has reportedly been leaked.Brendan Fevola leaves Fox FM listeners stunned with huge announcement: 'I'm leaving...'\n14/03/25 01:31Brendan Fevola shocked his Fox FM co-stars on Friday morning by revealing he would be stepping away from the program.Footy legend Brendan Fevola opens up on how he 'thought he had died' after being admitted to a mental health clinic - as he claims spending 70 days in rehab 'completely changed my life'\n12/03/25 10:51Fevola, who was 29 when he entered the facility, also revealed that spending 70 days in the facility had 'completely changed his life'.Lady Gaga teases first Australian tour in eleven years: 'She's coming back!'\n06/03/25 21:26US Pop superstar Lady Gaga has teased that a trip Down Under could very well be on the cards.Brooke Warne shares a heartbreaking tribute to father Shane on the third anniversary of his shock death\n03/03/25 23:18Shane Warne's eldest child Brooke has paid an emotional tribute to her late father on the third anniversary of his shock death.Woolworths employees spill the 'secret' 3pm detail in all stores that no shoppers know about: 'Drives me crazy'\n20/02/25 04:42Woolworths shoppers were surprised to learn about a little-known detail that takes place in all stores across Australia every day.AFL legend Brendan Fevola's shock new career move: 'I've got a new lease on life'\n13/02/25 00:37AFL legend Brendan Fevola says he's got a new lease on life after taking on an exciting new role that might surprise some footy fans.Brendan Fevola reveals he used to cry alone in his car as he breaks his silence on the darkest days of his footy career\n07/02/25 01:13Brendan Fevola has revealed he often cried in his car as he struggled with mental health issues during his footy playing days. He also wants the AFL to be more proactive with today's stars.Brendan Fevola reveals how his old housemate Troy Selwood saved him during a tough time before the star's death aged 40\n05/02/25 10:42Selwood enjoyed a distinguished career in the AFL, making 75 appearances for the Lions across a seven-year period.Aussie sport fans and stars react with horror after seeing how Jelena Dokic suffered abuse from her dad in confronting documentary\n30/01/25 01:04Australian sports fans have reacted in horror after seeing the shocking level of abuse former tennis star Jelena Dokic suffered at the hands of her father Damir at the peak of her career.Tennis legend Andy Murray is blown away by footy great Brendan Fevola's INSANE Uber Eats bill: 'You should get knighted for that'\n20/01/25 02:59AFL great Brendan Fevola has left tennis legend Andy Murray speechless after revealing he has ordered so much food through the app that he is in the top 0.001 per cent of Aussie customers.Mia Fevola shows off her incredible physique in skimpy bikini during Gold Coast getaway - after engagement rumours with boyfriend Bass Miller\n23/12/24 12:28Mia Fevola has been basking in the summer holidays this year.Mia Fevola shows off her incredible figure in a bikini during Byron Bay holiday - after engagement rumours with boyfriend Bass Miller\n17/12/24 12:14Mia Fevola is never shy when it comes to showing off her incredible physique.Mia Fevola flaunts her fit figure in athleisure wear - after breaking her silence on engagement rumours with boyfriend Bass Miller\n09/12/24 23:18Mia Fevola is known for her sizzling selfies where she shows off her banging body.Carrie Bickmore thanks her celebrity friends for 'all the birthday love' - but there's one very notable well-wisher missing\n04/12/24 07:06Carrie Bickmore has taken to social media to thank her celebrity friends for 'all the birthday love' she recently received - but there was one very notable exception.Brendan Fevola left shocked after finding out what his teen daughter got up to during Schoolies: 'I don't know what I've done wrong as a parent'\n28/11/24 01:36Brendan 'Fev' Fevola was left shocked by his 17-year-old daughter's antics at Schoolies in Byron Bay.Brendan Fevola texts family goodbye during mid-air emergency: 'I think I'm going to die'\n21/11/24 05:07The Melbourne-based radio star, 43, detailed the terrifying incident from his recent flight to Sydney, where his plane appeared to have an issue during landing.Footy great Brendan Fevola reveals he came incredibly close to getting into wild brawl while he was out with his daughters\n18/11/24 04:02The Carlton great was so close to the wild NBL brawl that rocked John Cain Arena in Melbourne on Sunday that he was concerned he might have to start throwing punches himself.Has Merrick Watts' next career move been revealed? Comedian breaks his silence on I'm A Celebrity... Get Me Out Of Here rumours\n12/11/24 02:18Merrick Watts has spoken out on rumours he will be appearing on the upcoming series of Channel Ten's I'm A Celebrity... Get Me Out Of Here!Footy great Brendan Fevola breaks down in tears live on air after hearing the shocking way an Aussie boy was treated after his father's death from cancer\n31/10/24 01:30The Carlton great, 43, was overcome with emotion when the boy's mother rang in to the Fifi, Fev & Nick radio show on Thursday morning.Could this be the end of Brendan Fevola's radio show with Fifi Box? AFL legend considers massive career change\n25/10/24 12:49Former AFL champ and radio star Brendan Fevola has teased fans about a massive career change.Champion Aussie snowboarder Scotty James and his Formula One heiress wife Chloe Stroll announce the arrival of their first child\n10/10/24 09:21Australian champion snowboarder Scotty James and his Formula One heiress wife Chloe Stroll have welcomed their first child.Dustin Martin makes a shock move that confirms many fans' suspicions about his retirement from footy\n13/09/24 04:56Richmond Tigers legend Martin bid an emotional farewell to the club's fans at their last game of the year on August 24 - and now, just weeks later, he has made a move that will leave them stunned.AFL legend Brendan Fevola reveals how he lost 14.5kg in one month with NO exercise\n10/09/24 06:47AFL great Brendan Fevola has revealed he has lost a whopping 14.5 kilograms in just one month without doing any exercise.AFL legend Brendan Fevola reveals gruesome injury in Grand Final win: 'It was worth it'\n09/09/24 05:53Footy legend Brendan Fevola has opened up about the brutal injury that saw him taken to the emergency room after starring in his park footy team's grand final over the weekend.The Block viewers slam the show's controversial cooking challenge as the teams compete to win a $120,000 boat: 'This isn't MasterChef'\n05/09/24 03:33The Block viewers were left confused on Wednesday night after the Channel Nine reality TV series aired a controversial cooking challenge.Brendan Fevola reveals shock health scare… after AFL legend detailed his dramatic 30kg weight loss\n27/08/24 01:32The AFL great, 43, recently told how he's shed a quarter of his body weight in the past 12 months in a huge health overhaul.Brendan Fevola doesn't look like this anymore! Ex-AFL star shocks fans with failed transformation\n23/08/24 01:32Brendan Fevola underwent a massive transformation on Thursday, but all did not go to plan when he finally unveiled it.Brendan Fevola drops bombshell about Collingwood boss who is under fire after allegedly making shocking racist remarks to staff\n22/08/24 02:43AFL great turned breakfast radio identity Brendan Fevola claimed there has been a huge development at Collingwood involving CEO Craig Kelly - prompting a response from the club.Dave Hughes explodes in unhinged rant after Logies snub: 'The amount of losers in that room'\n20/08/24 05:26Dave Hughes has exploded after he didn't get an invite to the 2024 Logies.Brendan Fevola shows off his slimmed down physique as he grabs a coffee in Melbourne after shedding an impressive 30kgs\n20/08/24 05:02Brendan Fevola cut a remarkably trim figure as he was spotted in public for the very first time since revealing his dramatic 30kg weight loss.AFL great Brendan Fevola reveals the secret behind his weight loss after shedding an impressive 30kgs\n14/08/24 04:59Brendan Fevola opened up on Wednesday about his dramatic weight loss journey over the past year, which has seen him shed over 30kgs and reach his target goal.Bronze statue of Brendan Fevola 'vanishes' from Melbourne's Flinders Street Station after first being unveiled in March\n03/08/24 14:57A life-sized statue of Brendan Fevola has 'vanished' from Flinders Street Station in Melbourne after first being unveiled in March.MasterChef Australia star Hayden Quinn gives his shock opinion of Dancing With The Stars judge - and reveals he has welcomed a new family member with wife Jax Raynor\n29/07/24 02:51Celebrity chef Hayden Quinn has opened up about his gruelling stint on Dancing With The Stars, following his shock elimination on Sunday night.Brendan Fevola reveals the staggering amount he was paid to star on I'm A Celebrity... Get Me Out Of Here!\n21/07/24 22:23Brendan Fevola has revealed the jaw-dropping amount he was paid to appear on I'm A Celebrity... Get Me Out of Here! Australia.Kylie Minogue lifts the lid on her time on Neighbours in the 1980s and kissing ex Jason Donovan in her car\n16/07/24 09:57Kylie Minogue has lifted the lid on her time on Neighbours.Kylie Minogue accidentally confirms first Australian tour in five years in surprise radio announcement: 'I wasn't meant to say that!'\n16/07/24 01:36The pop superstar, 56, last toured Down Under on her Golden tour back in March 2019 and is now lining up another string of concerts in the country.Mia Fevola flaunts her sensational bikini body as she enjoys lavish trip to Europe with boyfriend Bass Miller\n07/07/24 10:22Mia Fevola is soaking up the sun in Europe.Mia Fevola shows off her incredible bikini body as she enjoys lavish trip to Italy with boyfriend Bass Miller\n27/06/24 06:39Mia Fevola is enjoying a lavish holiday in Italy.Mia Fevola looks loved-up with boyfriend Bass Miller as she shows off her sensational bikini body in Italy\n25/06/24 12:16Mia Fevola has taken to Instagram to share stunning photos from her recent holiday in Sorrento, Italy, on Tuesday.Mia Fevola flaunts her stunning bikini body on luxurious Italian holiday - after AFL star ex Daniel Rioli announced engagement\n21/06/24 10:06Brendan Fevola's stunning daughter Mia is currently living life to the fullest on a sun-soaked luxurious holiday on the scenic Amalfi Coast in Italy.Western Bulldogs star Jamarra Ugle-Hagan appears to have split from his glamorous influencer girlfriend as they unfollow each other on Instagram\n21/06/24 06:38Western Bulldogs star Jamarra Ugle-Hagan and his glamorous influencer girlfriend Olivia Kelly appear to have split.Lara Worthington shows off her incredible figure in a rare vintage Jean Paul Gaultier corset dress during stunning photoshoot in Marrakech\n18/06/24 06:34Lara Bingle stunned followers on Friday when she stepped out wearing a very rare Jean Paul Gaultier piece while on holiday in Marrakech, Morocco.Footy great Brendan Fevola reveals the telling sign that Dustin Martin played his last game in Richmond colours in 300th game milestone\n18/06/24 02:34Carlton legend Brendan Fevola has bad news for Richmond fans, he believes Dustin Martin 's 300th match for the club was also his lastAFL legend Brendan Fevola returns to the field - and you'll never guess how many goals he scored\n16/06/24 01:59Footy legend and radio presenter Brendan Fevola has returned to the field for a Division 3 dust-up in Melbourne's northeast - and he had his eye on goal.Cruel moment Fifi, Fev and Nick taunt caller trying to guess FoxFM's secret sound only to be incorrect… after radio station was accused of copying KIIS FM\n30/05/24 01:07The Fox's Fifi Box, Brendan Fevola and Nick Cody have taunted a caller during their Secret Sound guessing game.Footy great Brendan Fevola drops a bombshell about Dustin Martin's retirement from the AFL - and Tigers fans should look away now\n28/05/24 03:38Brendan Fevola has poured petrol on rumours surrounding Martin's exit from the league. The 32-year-old has struggled for form so far this year, giving rise to speculation about his future.Lara Worthington 'recreates' infamous nude shower moment as she relaxes naked in an outdoor bath\n24/05/24 05:37Lara Worthington was in hot water in 2010 when a controversial affair with Brendan Fevola was outed by a nude shower photo.Beyoncé to rock the MCG? Rumours emerge that superstar is bringing her Cowboy Carter World Tour to Melbourne\n21/05/24 02:15Beyoncé is rumoured to be bringing her Cowboy Carter World Tour to Australia in late October to perform at the Melbourne Cricket Ground (MCG).Brendan Fevola admits he could've been jailed for drugs like fallen footy star Sam Fisher\n20/05/24 06:32Brendan Fevola has opened up about Sam Fisher's five-year prison sentence for trafficking drugs as the Carlton legend turned radio star revealed the pitfalls retiring players face.Mia Fevola talks about her powerful bond with her footy star 'dad' Brendan after her father tragically died when she was a baby: 'I can't remember life before him'\n19/05/24 22:33Mia Fevola has opened up about her close bond with stepfather Brendan Fevola.Mia Fevola says she will keep romance with boyfriend Bass Miller private after 'oversharing' relationship with ex Jamarra Ugle-Hagan led to 'negativity'\n18/05/24 14:33Mia Fevola is keeping her boyfriend Bass Miller close to her, and out of the public eye.Brendan Fevola fires up in defence of Fifi Box after a troll targets the radio star for being a single mother\n16/05/24 08:58Fox FM star Brendan Fevola came to the defence of his co-host Fifi Box on Thursday, after a cruel troll slammed her for being a working single mother.Jackie 'O' Henderson slams Melbourne radio rivals 'dumb games' after Fifi, Fev and Nick's copycat marketing campaign was revealed\n15/05/24 02:09Jackie 'O' Henderson has fired another shot in the 'radio wars' currently stirring the airwaves in the Melbourne market.KIIS FM staffer defaces Brendan Fevola statue in Melbourne… and even Kyle Sandilands brands the stunt 'childish'\n14/05/24 02:39As the Melbourne breakfast radio war rages on, a staffer for KIIS FM's The Kyle and Jackie O Show has taken a cheeky pot shot at Fox FM star Brendan Fevola.\nPage\nDON'T MISS\n-\nRio Ferdinand, 46, and wife Kate, 33, reveal they have moved to Dubai with their family as they show off their lavish mansion\n-\nCruz Beckham shares an intimate moment with Jackie Apostel after joining shirtless dad David aboard their lavish yacht\n-\nEmma Watson potters around in a sheer lace dress as she joins her hunky personal trainer for a hike in Saint Tropez\n-\nEXCLUSIVE\nI was desperate to know what this model got up to with England star. Now I've discovered truth, reveals KATIE HIND\n-\nSting is being sued for 'MILLIONS of pounds in lost royalties' by former bandmates in The Police\n-\nBeaches, history, waterparks, golf... Turkey (Türkiye) has it all: Here's why you'll never want to leave\nAd Feature\n- Selena Gomez stuns in black swimsuit on yacht for bachelorette party in Cabo... but was BFF Taylor Swift there? Looking good\n-\nWas this earliest sign of cracks forming between Meghan and Kate? Expert reveals signs that 'Fab Four' weren't getting on\n-\nEXCLUSIVE\nThe dark truth of Club Chalamet: She's a 58-year-old Timothée obsessive who HATES Kylie Jenner\n-\nCould an app really make you better with money? Putting a smart money app to the test\nAd Feature\n-\nBrooklyn Beckham and Nicola Peltz give fans a glimpse of their 'perfect Sunday' as couple unwind after family 'snub'\n-\nMeghan Markle 'placed status above reality' and struggled to separate her own image from Suits character, claims royal author\n- Zoe Kravitz seen arm-in-arm on romantic stroll in Rome with Harry Styles after getting cozy with Austin Butler See the pic\n- I Dream of Jeannie star Barbara Eden turns 94 and looks more glamorous than ever... see her now All change\n-\nGet your autumn on! From pumpkin throws to cosy hot chocolate mugs, here's our pick of homeware for the new season\nAd Feature\n-\nFrom Princess Margaret's sadistic streak to Meghan 'berating a gardener' - the most ill-mannered royals revealed\n-\nKaty Perry makes a braless fashion statement in curve-clinging dress... after Justin Trudeau romance rumors\n-\nWhy Millie Bobby Brown, 21, decided to shun Hollywood in favour of farm life in a nod to her British roots as she adopts a baby\n-\nBritney Spears reveals Sam Asghari 'felt like a fake distraction' to cope with being 'cut off' from sons\n-\nFrom auctions to EVs: 5 brilliant motoring brands every driver should know - from finance fixes to stunning electric SUVs\nAd Feature\n-\nBobby Brazier's love for Hare Krishna: From finding happiness through religion after tragic start - as soap star 'quits showbiz'\n-\nMum's the word! George, Charlotte and Louis join William and newly blonde Kate for church service in Balmoral\n-\nMillie Bobby Brown, 21, and Jake Bongiovi, 23, bond with baby daughter in NYC... days after announcing adoption\n-\nEmily Ratajkowski showcases her curves in leather dominatrix inspired lingerie\n-\nWhy Scottish Mortgage is backing the future of banking for long-term profits\nSponsored\n-\nStrictly Come Dancing bosses deliver verdict on future of BBC show after a male star was arrested on suspicion of rape\n-\nSuperman actor Dean Cain, 59, brutally mocked for struggling through training course after signing up with ICE\n-\nHidden detail in Kelly Clarkson's outfit which symbolizes 'healing and hope' after ex Brandon Blackstock's death\n-\nLily Collins' VERY famous father-in-law reveals he isn't a fan of her show Emily in Paris - but do YOU know who he is?\n-\nEastEnders star Cheryl Fergison reveals the devastating moment she found her husband in a 'dingy love nest' with another woman\n- Vogue Williams gives fans a glimpse at her early 40th birthday celebrations with family and friends Milestone celebration\n-\nPaul Merton reveals it 'felt natural' falling in love with third wife Suki Webster six months after becoming a widower\n-\nSir Elton John, Sir Rod Stewart and Jessie J join an array of music legends for tribute to 'funny and rude friend Steve Wright'\n-\nEXCLUSIVE\nIs 'Saint' Peter Andre REALLY an angel? Katie Price's ex mocked disabled son Harvey and told Junior not to kiss boys\n- Try Amazon Music Unlimited FREE for 30 days! Enjoy millions of songs, audiobooks and podcasts SHOPPING\n-\nPassenger princesses! Kate and Charlotte beam as Prince William drives family to church service in Balmoral\n- Bikini-clad Naomi Campbell, 55, shows off her age-defying physique as she enjoys a lavish trip to Ibiza She's still got it\n-\nVictoria and David Beckham look more smitten than ever after 26 years of marriage as they enjoy lunch with their children in Nerano\n-\nLove Island's Kaz Crossley and TOWIE's Elma Pazar among reality stars 'involved in horror crash'\n- Upgrade your home office with up to 50% off ergonomic desk chairs and standing desks (and we have an EXCLUSIVE extra code) SHOPPING\n-\nMyleene Klass shows off her harp playing skills as accomplished musician performs at 'dear friend' Clare Patterson's wedding\n-\nJackie Woodburne doesn't look like this anymore! Neighbours star is unrecognisable as she ditches the brunette crop she's had for decades and reveals grey hair\n- Queen's 20-year-old supercharged Range Rover sells for over ten times its typical market value at auction Pricey\n- Linda Robson reveals the real reason for major Loose Women changes amid fears for the show's future Speaking out\n- Shoppers flocking to Tesco after price slash on 'DELICIOUS' award-winning £20 Irish cream liqueur that's giving Baileys a run for its money SHOPPING\n-\nTyson Fury's daughter Venezuela, 15, goes Instagram official with 'mystery boyfriend' - and his profession runs in the family\n-\nThe Walking Dead star's son makes disturbing threat after being charged with assault\n-\nSuki Waterhouse treats fans to a raunchy performance as she takes to the stage in black fishnet tights and microscopic shorts\n- Jameela Jamil raises alarm over Serena Williams' weight loss drug promotion British star has blasted Williams\n- Why pay full price? This hack lets small businesses lease top tech for as little as £2.16 per MONTH - and no, there's no catch! SHOPPING\n-\nBritney Spears poses nude in new photo after sparking fan concerns over disheveled living conditions\n-\nLeigh-Anne Pinnock flashes her abs in a skimpy red bra as she she continues her tour of UK festivals with solo gig at Reading\n- TV host Jenni reveals secret to bikini body...no chips or crisps for 34 years! Still looking toned and trim\n- Tulisa wears a strapless lime bustier as she she returns to the spotlight at Manchester Pride Looking good\n- Shiseido launches upgraded viral skincare - get 20% off plus a free gift with our exclusive code SHOPPING:\n-\nDating Naked line-up REVEALED: Controversial Married At First Sight star joins new series of Rylan Clark's show\n-\nFeuding royal rivals William and Harry go to war. Sound familiar? CHRISTOPHER STEVENS reviews King & Conqueror\n- Zendaya says she loved getting to do 'normal' things during her time with fiancé Tom Holland in Scotland Close couple\n-\nEXCLUSIVE\nLuisa Zissman shares bikini snaps amid skinny-shaming row - after sparking debate for smashing kids' iPads\n- Is YOUR mattress causing you sleepless nights? Don't miss out on the best Emma Sleep deals with up to 25% off - prices start at £50 SHOPPING\n-\nJeering Dragons' Den panel called my business a 'delusional disaster' - now I'm worth £40million!\n- Pop star under fire as fans call out penis-shaped stage design on opening night of tour It got off to a very memorable start\n-\nPregnant Sophie Habboo accidentally posts full frontal picture of husband Jamie Laing to fans as they enjoy Bank Holiday weekend\n- Inside Kristin Cavallari's wild Las Vegas weekend The 38-year-old reality star splurged the cash during her lavish trip\n-\nJenni Falconer, 49, displays her flawless physique in a skimpy leopard-print bikini as she soaks up the sun during summer break\n-\nSelena Gomez's fiancé Benny Blanco is SLAMMED for purchasing $200 blueberries: 'I can't afford regular fruit'\n- Julianne Moore admits her wedding dress was a HUGE mistake after skipping tradition to wear white Big regret\n- Kylie Jenner gives rare update on beloved dog Norman that she got at age 17 She's had the pet since she was a teenager\n-\nAll the celebrities who have REVERSED their cosmetic surgery from Chloe Ferry to Molly-Mae Hague and even Victoria Beckham\n- These 'DELICIOUS' cupboard-ready meals make nutritional eating quicker and easier than ever (and we have an exclusive deal) SHOPPING\n- A-list celebrities rush to check on Kyle Sandilands following reports 'he was off-air due to stroke' Worrying\n-\nTaylor Swift's true feelings REVEALED over Kansas City Chiefs docuseries that explores Travis Kelce romance\n-\nMark Wright and Michelle Keegan put on a loved up display as they enjoy romantic date night at Coldplay's Wembley gig\n-\nEXCLUSIVE\nFormer Baywatch star Nancy Valen ditches Hollywood glamour in rare sighting - see her now\n-\nClaudia Schiffer shows support for her husband Matthew Vaughn's team by posing in a Brentford shirt\n- Gloria Estefan may sue Diddy accuser who name dropped her and husband Emilio The court officially dismissed all allegations\n-\nThe downfall of Marco Pierre White Jr: Son of Michelin star chef has shirked his upbringing to have multiple brushes with law\n-\nJosie Gibson admits she's 'stepped back' from TV work and reveals plans to live 'off-grid as humanly possible'\n-\nEXCLUSIVE\nWilliam Shatner, 94, and his ex-wife spark REMARRIAGE rumors as she steps out wearing huge diamond ring\n-\nBraless Myleene Klass heads to work in a bandeau top and mini skirt after Frankie Bridge broke her silence on their 'feud'\n-\nLady Gaga breaks down during concert after revealing what fiance said moments before she took the stage\n-\nCelebrities who have dated people who look JUST like their siblings with eerie similarities - but do you agree with the comparisons?\n-\nScarlett Thomas' staggering payday as her father Ryan insists she hasn't had a free ride - after nepo baby, 16, skipped GCSEs\n-\nCall me sweet and I'll tell you to f*** off: Dame Helen Mirren, 80, issues a very blunt response to 'condescending' comments about age\n-\nX Factor star who faced off with Simon Cowell looks unrecognisable after reinventing himself as a 'spiritual healer'\n-\n'Irresponsible' Sam Faiers and Billie Shepherd shock fans with their 'dangerous' holistic healthcare advice\n-\nMike Tindall reveals his 'sliding doors' moment when he first met Zara Tindall in 2003\n-\nDuncan James SPLITS from boyfriend after six years together as Blue singer shares post about 'growth' to fans amid heartache\n-\nAlec Baldwin shares sensual moment with wife Hilaria as couple reenact Dirty Dancing in what appears to be a desperate audition for DWTS\n-\nSerena Williams buries feud with Maria Sharapova with shock appearance as Russian enters tennis Hall of Fame\n-\nThe Hollywood stars you had no idea appeared on reality TV shows before they were famous\n-\nEXCLUSIVE\nThought the Biggest Loser was harsh? TV's self-declared 'lard police' Steve Miller insists he has 'no regrets' about his controversial Fat Families show\n-\nConor McGregor poses with 'yacht neighbour' David Beckham and sons Romeo and Cruz as UFC star hails football legend's 'dynasty'\n-\nColdplay's Chris Martin makes a cheeky swipe about the kiss-cam scandal before helping with a proposal and sharing sweet moment with autistic fan\n-\nFreddie Starr died 'penniless and estranged from his six children' as stranger stepped in to bring his body home from Spain and foot funeral bill\n-\nNelly Furtado, 46, delights fans with Noughties nostalgia as she storms the stage in a racy cut out top and mini skirt at the Big Feastival\n-\nSaturday Night Live boss Lorne Michaels says there will be a bloodbath of cast members within weeks\n-\nStacey Solomon and Joe Swash having another baby 'not off the table' following loved up display on luxurious family holiday\n-\nBobby Brazier, 22, 'is quitting showbiz and moving to India to pursue the Hare Krishna religion'\n-\nThis is just a saga now: Games critic Peter Hoskin checks out Echoes Of The End, an ambitious new video game from Iceland\n-\nThe exact treatments behind Karren Brady's transformation: The Apprentice star receives 'state-of-the-art technology for fat removal', says her very own cosmetic surgeon\n-\nLuisa Zissman reveals she smashed up her childrens' iPads in front of them because they 'p****d her off' - as controversial post sparks huge debate\n-\nNeighbours star Ian Smith shares major health update after being diagnosed with terminal lung cancer\n-\nOscar-winning actor looks unrecognisable in 90s comedy that has since become a cult classic - can YOU spot who he is?\n-\nRyan Thomas' nepo baby actress daughter Scarlett, 16, reveals she didn't sit her GCSEs\n-\nAlison Hammond, 50, is happier than ever with boyfriend David Putman, 28, and 'can't imagine her life without him as friends predict engagement'\n-\nEXCLUSIVE\nWas Hulk Hogan MURDERED? Estranged daughter Brooke has NEW information amid police investigation into death... here's all the evidence\n-\nEXCLUSIVE\nVile plot against Kylie Jenner with two-word code name... orchestrated by Timothee Chalamet's die-hard fans who say it's punishment for doing the unthinkable\n-\nUniversity Challenge's most memorable players: From irritating habits to disastrous blunders and wise cracks, the BBC boffins who stole the show\n-\nJacqueline Jossa and hubby Dan Osborne enjoy family holiday - months after a make-or-break getaway saved their marriage following brief split\n-\nMaya Jama 'considers moving to Manchester to be closer to footballer boyfriend Ruben Dias' as romance becomes more serious\n-\nStrictly Come Dancing gets 'major format shake-up' for this year's series that could 'disrupt chemistry' between celebrity and pro dance partners\n-\nStrictly Come Dancing star arrested on suspicion of rape in fresh blow for scandal-hit show just weeks before series returns to screens\n-\nNick Ferrari, 66, marries longtime love Clare surrounded by celeb pals including Piers Morgan, Myleene Klass and Christopher Biggins in idyllic venue in the south of France\n-\nKENNEDY: Shame on Serena Williams! She may be starving herself on prescription anorexia drugs. But this putrid stunt proves she's still a greedy beast\n-\nNetflix fans rave over 'simply fantastic' period drama hailed as 'a beautiful piece of storytelling' with huge Hollywood star in lead role\n-\nEXCLUSIVE\nFlorence Pugh's brother Toby Sebastian who starred in Game of Thrones has drastic new career change\n-\nThe tale of two Taylors! From Hollywood showmances to rebelling against studios - the incredible parallels between Taylor Swift and Elizabeth Taylor\n-\nNetflix fans gripped by 'harrowing and nightmarish' Vanessa Kirby sex work thriller - gushing over her 'powerhouse performance'\n-\nArnold Schwarzenegger's son Chris is unrecognizable in shockingly thin appearance after weight loss... see him now\n-\nAbbey Clancy wows in a bikini as she poses with husband Peter Crouch and their four children during idyllic summer holiday\n-\nKing Charles and Queen Camilla tell of 'deepest admiration for the unbreakable courage and spirit of the Ukrainian people' in Independence Day letter\n-\nMillie Bobby Brown weighs in on letting her kids pursue acting in resurfaced clip... after adopting baby girl at just 21\n-\nSopranos star Jerry Adler dies at 96: Late-blooming actor worked with Woody Allen and appeared on The Good Wife\n-\nEXCLUSIVE\nHome And Away tease the return of iconic couple Brax and Ricky after a decade away from Aussie soap\n-\nEXCLUSIVE\nI was the resident therapist on Celebrity Fit Club, the stars binged on pizza after weigh-ins and one was sacked after getting a gastric band mid-series\n-\nJack Osbourne honours late father Ozzy with heartfelt tribute in rare public appearance... one month after rock legend's death at 76\n-\nBradley Cooper, 50, and Gigi Hadid, 30, jet out for getaway together as age-gap romance heats up\n-\nEXCLUSIVE\nPride and Prejudice first look: Jack Lowden and Emma Corrin transform into Mr Darcy and Elizabeth Bennett for heated first scenes\n-\nMeghan and Harry's Michelin-starred wedding chef who features in new Netflix series reveals duchess's secret kitchen skills\n-\nEXCLUSIVE\nRaye forced to halt her performance as a fan collapses in the crowd at All Points East Festival\n-\nFKA Twigs puts on a very racy performance at All Points East after being drafted in as last minute replacement for Doechii\n-\nMeghan Markle's high street capsule wardrobe revealed: From staple crisp shirts to her go-to ballet flats\n-\nI'm A Celebrity star Dean McCullough speaks out as police investigate sick death threats\n-\nBrooks Nader's ex Gleb Savchenko seen on DWTS set after she claimed he was 'fired'\n-\nEXCLUSIVE\nTaking the Michael! ITV chiefs throw cash at comedian McIntyre in bid to nab him from BBC... but hit a snag because super-rich comic only cares about ratings\n-\nKylie Jenner's mini-me daughter Stormi steals the spotlight in her first commercial for mom's makeup\n-\nLil Nas X stripped completely nude on street before LA arrest in shocking new footage\n-\nLeigh-Anne Pinnock puts on an X-rated display as the former Little Mix star headlines Pride in Manchester\n-\nCoronation Street bosses face backlash for casting actor 'who broke another man's eye socket' as upcoming storyline reflects real life\n-\nLiam Gallagher extends major olive branch to his brother Noel during Oasis reunion tour - after years of feuding\n-\nGrief-stricken Kelly Clarkson appears shaken as she's seen for FIRST TIME since tragic death of ex-husband Brandon Blackstock\n-\nTALK OF THE TOWN: Moving in the right direction - Harry Styles set to start work on mega-mansion\n-\nSophie Turner reveals why she will never leave the UK again after moving back to London following divorce from ex Joe Jonas\n-\nJennifer Garner appears fresh-faced on solo outing after her kids celebrate dad Ben Affleck's low-key birthday\n-\nGRIFF RHYS JONES: My night with four young people (I paid, of course)...and why, in spite of all their witless opinions, I deplore the way their futures are being stifled\n-\nKatie Price displays her surgically-enhanced assets in a grey top as she steps out in London amid bitter feuds with her exes\n-\nEXCLUSIVE\nNew series depicts Princess Diana as an American mom with an addict daughter in Arizona - but friend behind the show insists he's not cashing in on her memory: KATIE HIND\n-\nEastEnders star Cheryl Fergison, 59, reveals she has suffered a worrying stroke - amid financial struggles\n-\n'Oh she's out!' Michelle Keegan lets her hair down as she posts selfie with a beer before partying at Coldplay's Wembley gig\n-\nLovely jubbly! Sir David Jason, 85, is in great spirits as he's mobbed by fans before his new show at Manchester's Lowry Theatre\n-\nMAFS UK expert Charlene Douglas in a wheelchair after being rushed to hospital as she gives health update\n-\nGeorgia Toffolo flaunts her toned abs in a skimpy white bikini as she shares snaps from sun-soaked holiday\n-\nJowita Przystal celebrates her birthday on wild night out as Pete Wicks shows off the moves she taught him on Strictly after pair reignited romance rumours\n-\nSam Thompson shows off new physique as he poses with equally buff brother-in-law Ryan Libbey after crashing sister Louise's family holiday\n-\nDid William the Conqueror really have an Asterix moustache? No, say historians - and that's just one of BBC blockbuster's howlers\n-\nKhloe Kardashian nearly upstages her friend at her birthday party as fans go wild over her 'amazing' look\n-\nJeremy Clarkson checks out the competition! Star samples a Britpop lager as he takes a break from his Cotswolds farm duties to enjoy Blur star Alex James' festival\n-\nEmily in Paris resumes filming in Venice two days after Netflix show's 'assistant director collapses and dies' in front of horrified crew\n-\nKylie Jenner gets roasted AGAIN after reposting snaps from her most-hated fashion shoot\n-\nThe dark past of William and Kate's 'forever home': Slavery links, an equerry who blew his brains out and a royal break-up...\n-\nThe Kooks frontman Luke Pritchard reveals why Rebel Wilson joined the band on stage and admits they only rehearsed an hour before\n-\nStunning wealth of Coco Gauff, 21, revealed as she's named the world's highest-earning female athlete\n-\nNepo baby son of Walking Dead star and 90s iconic supermodel arrested for assault\n-\nDua Lipa turns 30! Hitmaker sizzles in a sheer halter dress as she celebrates milestone birthday with intimate dinner while paying tribute to parents\n-\nSydney Sweeney who? Awards panel unveils 25 greatest films list with stars over 60 amid Hollywood's youth obsession\n-\nClaudia Schiffer sports a football shirt as she cheers on Brentford with husband Matthew Vaughn at the Gtech Community Stadium - after filmmaker invested in Premier League club\n-\nSophie Ellis Bextor stuns in glitter mini dress she makes surprise appearance at Reading Festival to perform Murder on the Dancefloor\n-\nAnd Just Like That... woke storylines killed the SATC reboot: From Miranda's 'late life lesbianism' to Charlotte's family gender issues - the moments that left viewers cringing\n-\nI met Amanda Holden when the Britain's Got Talent cameras weren't rolling - she showed her true colours straight away\n-\nLove Island's Yasmin Pettet reveals emotional reason she 'hasn't been intimate' with boyfriend Jamie Rhodes after leaving the villa\n-\nCountry superstar says chance meeting with Taylor Swift at Travis Kelce's charity camp lit up collab hopes\n-\nEXCLUSIVE\nSecret Lives of Mormon Wives explodes with lesbian twist as stars KISS in steamy first look at Season 3\n-\nImpossible contestant sent home empty-handed after struggling with a Harry Potter question on axed BBC show - but could YOU have guessed it?\n-\nBBC star Michael Ball reveals his mother has died as devastated singer is flooded with support by fans\n-\nSydney Sweeney's Americana director defends flop after box office crash\n-\nQueen Camilla is stylish in blue as she steps out at the final day of the York races\n-\nVicky Pattison leaves fans 'horrified' as she lets a dog lick her mouth in 'stomach churning' clip\n-\nBrookside legend Sue Johnston set to reprise iconic role after 35 years in historic Hollyoaks crossover\n-\nDrake back in bed with Bobbi Althoff after viral feud as they tease new project\n-\nLeona Lewis reveals how motherhood has changed her - as she gears up for her first-ever Las Vegas residency"
    },
    {
      "url": "https://www.dailymail.co.uk/tvshowbiz/snoop-dogg/index.html",
      "text": "Advertisement\nRELATED TOPICS FOR Snoop Dogg\nSnoop Dogg - Latest news, views, gossip, photos and video\nPage\nFooty legend Brendan Fevola claims the AFL is about to make a sensational last-minute change to the grand final that will make headlines around the world\n25/08/25 03:54\nFooty legend Brendan Fevola made his shocking prediction on Monday, telling his radio co-hosts, 'This will happen, take that to the bank.'...read\nRevealed: The star who'll be playing the NRL grand final - and he's NOWHERE near as well known as the AFL's Snoop Dogg\n25/08/25 01:45The AFL has had the wood on the NRL when it comes to musical star power at the year's biggest game for the last few years - and that trend shows no signs of being reversed in 2025.The AFL said Snoop Dogg's controversial takes on gay people were all in the past. The rapper just proved them wrong at the worst possible time\n22/08/25 07:32The furore over the league's choice of Snoop to perform at the grand final just won't go away - and this time it's the hip-hop icon himself who has poured petrol on the fire.Fans and footy stars SAVAGE the AFL over its handling of Izak Rankine homophobic slur drama\n21/08/25 02:21Fed-up footy identities and fans have lashed out at the AFL as the league's decision on a penalty for Izak Rankine has been delayed yet again.Revealed: How AFL team will use Snoop Dogg as a defence as they try to get their star off the hook for using a shocking anti-gay slur during a match\n20/08/25 09:13The Adelaide Football Club is trying to reduce a proposed five-game suspension that is set to be handed to their player Izak Rankine.Footy star says anyone who disagrees with the AFL hiring Snoop Dogg to play at the grand final is a RACIST\n14/08/25 05:43Some fans and experts have blasted the AFL for turning its back on its commitment to stamping out sexism and homophobia by choosing the hip-hop legend to rap at the MCG.Wayne Carey reveals all about his lewd new strip club gig - as he makes a saucy joke about what he's expecting at the racy adult venue\n14/08/25 02:49Anyone who thought the two-time premiership winner would be shy about appearing at the club after the news broke on Wednesday has been proved mistaken.The AFL gets blasted for turning its back on women by paying 'sexist' Snoop Dogg to play at the grand final\n12/08/25 05:33The official confirmation that the hip-hop icon will provide the halftime entertainment at the biggest game of the year wasn't warmly greeted by all footy fans.How Snoop Dogg revealed which AFL team he barracks for almost a DECADE ago - as footy fans are divided over his gig at this year's grand final\n12/08/25 02:50The words 'Snoop Dogg' don't exactly spring to mind when you think of high-profile Aussie Rules fans, but the rapper will be hoping one team raises the premiership cup on grand final day.Revealed: Global superstar set to perform at MCG for AFL Grand Final\n11/08/25 21:36The entertainment for the AFL Grand Final has been revealed, with a superstar name set to headline at the MCG later this year.American music sensation is rumoured as a shock choice to play at the AFL Grand Final\n24/07/25 10:15After Katy Perry stole the show at the MCG last year, the AFL is reportedly eyeing up another very surprising act to headline the pre-match entertainment for this year's Grand Final.What Snoop Dogg's weird and offbeat investment really means for Swansea - and the worrying truth behind clubs welcoming celebrities in, writes RIATH AL-SAMARRAI\n19/07/25 11:03RIATH AL-SAMARRAI: I enjoyed Snoop Dogg 's involvement with the Paris Olympics last summer. The old mutt was everywhere, peaking one afternoon when he rocked up at the equestrian.Snoop Dogg makes shock move to become co-owner of Championship football club along with Real Madrid legend - after claiming he wanted to buy into another team!\n17/07/25 18:34The world-famous rap star said he was drawn in by the 'underdog' story and said its 'working class' roots 'struck a chord' with him. A former Ballon d'Or winner, acquired a stake in the club in April.Rise of the MAGs (that's middle-aged grandparents!): Steven Gerrard joins the ranks of 40-something stars who have welcomed grandchildren\n17/07/25 00:02When Steven Gerrard welcomed his first granddaughter this week, aged 45, he joined the ranks of celebrities who are have entered their grandparent era early in mid-life.Nelly blasts Kamala Harris for 'locking up black men' and marrying a white husband in furious rant\n30/06/25 16:42Music superstar Nelly has slammed presidential loser Kamala Harris in a shocking tirade months after performing at Donald Trump's inauguration ball .Snoop Dogg reveals his family has suffered a devastating loss\n13/06/25 00:05Snoop Dogg revealed he was reeling from a personal tragedy on Thursday.Shrinking Mariah Carey unveils major makeover as she leads best-dressed stars at 2025 BET Awards\n10/06/25 00:58Mariah Carey unveiled one of her most stunning transformations to date when she performed at the 2025 BET Awards in Los Angeles on Monday.Snoop Dogg plans to open burger truck at iconic UK football stadium - and even wants to serve fans himself\n09/06/25 00:47Snoop Dogg plans to open a burger truck at an iconic UK football stadium.Lizzo SLAMS celebrity for being rude to her... sparking fans into frenzy\n16/05/25 21:24Lizzo has slammed a celebrity for being rude to her before she shot to fame - and fans have been thrown into a frenzy over the revelation.Boozy whipped cream, mushroom lattes and hot sauce: Can YOU match the celebrity to their random side-hustle?\n11/05/25 07:36The number of A-lister businesses has grown almost exponentially in the last few years with stars putting the names to everything - but can YOU guess which star started which side hustle?Nicole Scherzinger flaunts her amazing figure in a glamorous sequin gown at the Time 100 gala in New York\n25/04/25 00:33Nicole Scherzinger looked nothing short of sensational in a glamorous black gown as she attended the Time 100 Gala at The Jazz at Lincoln Center in New York on Thursday.Cannabis lovers Snoop Dogg, Chelsea Handler, and Wiz Khalifa show their love for 420 Day\n22/04/25 09:37Pot appreciators Snoop Dogg, Chelsea Handler, and more took to social media to mark '420', the unofficial cannabis holiday.Hollywood gets lit! Cannabis lovers Snoop Dogg, Chelsea Handler, and Wiz Khalifa celebrate 420\n20/04/25 22:33Marijuana appreciators Snoop Dogg, Chelsea Handler, and more took to social media to mark '420', cannabis' unofficial holiday.Mariah Carey reveals what has 'annoyed' her the most in her 30 year career\n19/04/25 00:05Mariah Carey has revealed what's bugged her most throughout her decades-long singing career.Pat McAfee live show descends into chaos as shocking brawl breaks out in the stands\n10/04/25 16:28During McAfee's 'Big Night Aht' event at PPG Paints Arena, footage shows several members of the audience throwing fists as mayhem ensued up in the stands.From being arrested by the KGB to all night parties - celebrity snapper shares stories behind iconic photos\n06/04/25 16:44A legendary music photographer has revealed how he captured shots of icons from Oasis to David Bowie - and the wild moments behind his unseen images.Controversial sports analyst rants against American black culture after Austin Metcalf, 17, was murdered\n03/04/25 19:11Metcalf, a star high school football player, died in his twin brother's arms after he was stabbed in the heart at a track and field meet in Texas for asking someone to get out of his seat.Real reason Tupac split up with Madonna revealed in heart-wrenching break up letter\n30/03/25 08:10The California Love rapper penned the break-up letter to the Vogue songstress from his jail cell in Rikers Island, New York, in 1995.Fans left bewildered by Snoop Dogg's bizarre comment on Tiger Woods' post confirming Vanessa Trump relationship\n24/03/25 12:45Just over a week after DailyMail.com exclusively broke the news that they were dating, Tiger hard-launched his new girlfriend and declared 'love is in the air' on Instagram Sunday night.Death Row Records founder's ex sues Snoop Dogg and Suge Knight over 20-year-old unpaid $107M settlement\n23/03/25 13:17Lydia Harris has been waiting for 20 years for Death Row Record co-founder Suge Knight to pay the court ordered $107M judgement after pushing her out and taking her share of profits.Snoop Dogg offers to help heal the rift between Princes William and Harry and says 'life is too short to not make things right': 'They're brothers, man'\n22/03/25 23:23The American rapper, who lives close to the Duke and Duchess of Sussex in LA, has said he would be more than happy to act as a peacemaker between the brothers.Snoop Dogg's daughter Cori Broadus gives birth three months early\n01/03/25 07:06Snoop Dogg's daughter Cori has given birth to a daughter, her first child with fiancé Wayne Deuce, three months early.Paris Hilton parties with Sydney Sweeney, Sofia Vergara, and newly-single Jessica Alba at her 44th birthday bash\n23/02/25 19:42The 27-year-old Euphoria actress bent down to greet the hotel heiress' two-year-old son Phoenix Barron Hilton Reum inside her $5.9M 'Slivington Manor' located in Beverly HillsNikki Glaser reveals what it was REALLY like to meet Bill Belichick's girlfriend Jordon Hudson at Super Bowl\n13/02/25 20:55Comedian Nikki Glaser is lifting the lid on her Super Bowl LIX experience with former New England Patriots coach Bill Belichick , 72, and his 24-year-old girlfriend, Jordon Hudson.Snoop Dogg blasted for 'stand up to hate' commercial with Tom Brady after performing at Trump inauguration\n10/02/25 03:57While many fans tune into the Super Bowl to watch the actual game, many others tune in for the commercials, though one had many fans furious.The real winner of the 2025 Super Bowl... Bill Belichick's 24-year-old 'fiancée' Jordon Hudson\n09/02/25 23:16Forget about the Philadelphia Eagles versus The Kansas City Chiefs - this weekend, it was all about Bill Belichick's 24-year-old 'fiancée' Jordon Hudson.Sean Paul weighs in on cancel culture in the music industry and reveals his VERY surprising hidden talents as he gears up for new tour\n09/02/25 11:30The rapper, 52, burst into the limelight in the Noughties with chart-topping hits such as Temperature and Get Busy still playing today.NFL fans unload on 'abysmal' NFL Honors ceremony: 'I don't know how they can air this with pride'\n07/02/25 17:23The verdict is in from football fans about the NFL Honors ceremony on Thursday night and the reviews are terrible, with many wondering how much effort was put into the show.Bill Belichick and Jordon Hudson stun fans as they arrive at iconic New Orleans bar after NFL Honors\n07/02/25 05:02Bill Belichick and Jordon Hudson left New Orleans revelers in shock when they rocked up to a famous Bourbon Street establishment - just hours after being the brunt of the joke at the NFL Honors.Snoop Dogg leaves Bill Belichick and 24-year-old girlfriend Jordon Hudson shocked with brutal swipe\n07/02/25 03:30The couple turned heads as they walked the red carpet at the end-of-season awards ceremony but it was their turn to be left shocked inside the event when they became the punchline.Snoop Dogg breaks silence on performing at Donald Trump's inauguration after fans slammed his decision\n28/01/25 02:22Snoop Dogg was defiant as he appeared to respond to critics of his performance celebrating President Donald Trump's inauguration earlier this month.Jamie Foxx reveals he once asked his friend Snoop Dogg to 'shake up' his daughter's boyfriend\n22/01/25 14:21The actor, 57, made an entertaining appearance on Capital XTRA alongside Cameron Diaz, 52, as the pair continued their publicity for Back In Action, which debuted on Netflix last Friday.The View host Sunny Hostin suggests black artists Nelly and Snoop Dogg shouldn't have performed for Trump\n21/01/25 19:27The View's Sunny Hostin had some strong words for black performers who appeared at Donald Trump's inauguration on Monday - chiding them publicly on her program.Nelly's inauguration ball drama amid 'tensions' with Ashanti as he's blocked from performing hit single\n20/01/25 19:43The rapper, 50, faced fierce criticism when he was unveiled as part of the line-up, and later revealed he had accepted the offer out of 'respect' for the office.Jason Aldean fiercely defends Donald Trump support after drastic U-turn on getting involved in politics\n20/01/25 17:11Ahead of his 30-minute set at the Liberty Ball, Jason was probed by CBS Mornings anchor Gayle King about why he decided to rally around Trump.Nelly breaks silence after backlash for agreeing to perform at Trump's inaugural ball\n19/01/25 19:08Nelly has responded to the backlash over his decision to perform at the Liberty Ball on Monday night, celebrating the inauguration of President Donald Trump.Donald Trump Jr. shows off his VERY patriotic outfit with glamorous new girlfriend on his arm\n18/01/25 20:47The 47-year-old appeared alongside partner Bettina Anderson at the Crypto Ball in Washington DC.Snoop Dogg responds after fans panned his performance at Trump's Crypto Ball\n18/01/25 20:35On Friday, the rapper headlined the pro-Trump, pre-inauguration event in Washington, D.C., which attracted a mix of celebrities and politicians, including House Speaker Mike Johnson .Snoop Dogg praises LA community for coming together in wake of devastating fires rocking the region\n15/01/25 03:14Snoop Dogg is a lifelong Californian, and in the wake of the devastating and deadly fires that have ravaged through part of the Los Angeles region, he had high praise for the community.Jimmy Kimmel breaks down in tears over 'very scary' week dealing with LA fires while thanking local firefighters and first responders\n14/01/25 08:00Jimmy Kimmel returned to Hollywood on Monday to film a new episode of Jimmy Kimmel Live, after canceling tapings last week due to Los Angeles wildfires.NFL announces music superstar as shock host for glitzy awards night on Super Bowl week\n10/01/25 14:16Keegan-Michael Key hosted the event last year, but the league has now turned to a bigger name in the hopes of enticing a wider audience for the event three days ahead of the Super Bowl.Snoop Dogg's daughter Cori Broadus reveals she's pregnant with her first child\n24/12/24 04:46Snoop Dogg's 25-year-old daughter admitted that her pregnancy with fiancé Wayne Deuce was 'unplanned,' but she said they were 'blessed.'Snoop Dogg called 'nephew' Kendrick Lamar to apologize for posting Drake diss track: 'I was f**ked up'\n18/12/24 18:37During an interview with Bootleg Kev, Snoop revealed he called Kendrick to apologize for the misunderstanding and left a message conceding he was 'f**ked up.'Frank Sinatra's daughter reacts to an AI version of the crooner in a Dr. Dre and Snoop Dogg gin commercial\n11/12/24 07:34Frank Sinatra's daughter shared her thoughts on hip hop stars Dr. Dre and Snoop Dogg using an AI-generated likeness of her father in their new Still G.I.N. commercial.Snoop Dogg reveals he is gunning for Gregg Wallace's former MasterChef gig as he says he will recruit stars including Gordon Ramsay to back his pitch\n08/12/24 09:59The legendary American rapper, 53, said he is 'not playing' when it comes to food and claimed he has even given Gordon a few cooking tips over the years, according to the Mirror.From Lady Gaga's 24 hour assistant to Shirley MacLaine's personal cocktail maker and Snoop Dogg's full time blunt roller, a look at the ridiculous jobs A-listers have hired people for\n08/12/24 08:02Snoop Dogg, Mariah Carey, Lady Gaga and Robert De Niro are among the stars who have hired ordinary people for very peculiar jobs.Picture of 500lbs rapper Dave Blunts and his girlfriend goes viral after star, 23, performed with oxygen tank\n05/12/24 19:39A photo of 500lbs rapper Dave Blunts and his girlfriend has gone viral after the star, 23, sparked health fears by performing onstage with an oxygen tank.The Voice reveals top 5 finalists for Season 26 ahead of next week's two-night finale\n04/12/24 05:38NBC's The Voice narrowed it's competition down to the top 5 finalists on Tuesday night's new episode.The Voice's Sloane Simon leaves Michael Buble in tears with emotional performance days after father's death\n27/11/24 07:56Sloane Simon's performance just days after her father died from cancer brought Michael Bublé and the rest of the coaches to tears - but that didn't mean she was guaranteed to advance.The Voice fans puzzled as Simone Biles joins Snoop Dogg as mentor in singing competition\n26/11/24 06:04Many fans previously praised Snoop Dogg as ' the best judge ever ' during his first season on NBC's The Voice, though many are turning on him now.Rory McIlroy, Adele and Jared Leto among star-studded crowd in Las Vegas for F1 qualifying\n23/11/24 06:38Lewis Hamilton, Max Verstappen and Co whipped around the Nevada desert as they battled for pole position during qualifying. They were watched on by a host of A-listers.Simone Biles to team up with Snoop Dogg on NBC's The Voice after Olympics friendship\n21/11/24 20:31During the Olympics, Biles and Snoop had a few viral moments, with the legendary rapper gifting Biles' father, Ronald Biles, a Death Row Records gold necklace for his 75th birthday.The Voice fans bash Snoop Dogg for picking Mikaela over Chrisdeo in the Knockouts... though some praise him for CRYING over all his singers\n19/11/24 04:29The 3-Way Knockouts came to a close on Monday's episode of NBC's The Voice, which lead to some mixed reactions from judge Snoop Dogg .Martha Stewart doc director reveals her brutal phone call to him as he fires back at her criticism of 'lazy' film\n15/11/24 23:13Stewart, 83, participated in the Netflix movie and granted extensive on-camera interviews for it, but has been publicly scathing about the finished product, which she has denounced as 'lazy.'Why did Tanner Frick leave The Voice? Fans stunned as he posts cryptic social media video after shock exit\n12/11/24 03:46The Voice fans were thrown for quite the loop on Monday, when it was subtly revealed that Tanner Frick mysteriously left the show.Snoop Dogg's daughter Cori Broadus acts 'like a f***ing bridezilla' in trailer for new wedding docuseries\n08/11/24 08:13Snoop Dogg's fans can expect to see some major family wedding drama on his family's new docuseries.How the firepit became 'common': It was once a sign of wealth but after appearing on Love Island, expert claims the garden item is a tell-tell sign you aren't posh\n05/11/24 16:48Are you a fan of firepits? The outdoor implements, which are popular among influencers and famously featured in reality show Love Island have been branded 'common' by Nicky Haslam.Snoop Dogg announces new album Missionary produced by Dr. Dre coming in December\n30/10/24 22:35Snoop Dogg has confirmed that his album Missionary, produced by Dr. Dre, will arrive in December.The Voice's furious fans call out 'mean' producers after shock end to Monday's show\n29/10/24 03:08The Battle Rounds continued on Monday's episode of The Voice , though producers made fans quite furious with a shocking cliffhanger.Fresh hunt for thug who killed reveller after a blow-up doll hit his girlfriend at a Snoop Dogg concert\n28/10/24 15:50Robert Hart jumped to his girlfriend Gemma Parry's defence but died after a single punch was thrown during the headline act at Parklife Festival in Manchester in June 2014.Snoop Dogg fans spot weird detail in viral video of him gatecrashing party bus\n28/10/24 03:45Snoop Dogg has always been a man about town with 'places to go, things to do, and people to see.'Snoop Dogg reveals Wrexham's story has made him want to invest in Celtic - as the rapper cites Hollywood star Ryan Reynolds as the inspiration for his plans\n27/10/24 11:53Hollywood duo Reynolds and Rob McElhenney took over Welsh side Wrexham for just short of £2million in November 2020, when they were in the fifth tier of English football and had been for nearly 15 years.5ft Kylie Minogue gets the giggles as 6ft 4\" Snoop Dogg towers over her in hilarious backstage snaps at The Kelly Clarkson Show\n24/10/24 10:16The Locomotion singer, 56, who is exactly 5ft, beamed as she was dwarfed by the leather-clad rapper, who stands at a towering 6ft 3inches.The Voice fans rave Snoop is 'best judge ever' as the Battle Rounds begin with TWO steals\n22/10/24 03:59The Blind Auditions have come and gone, with NBC's The Voice moving into the Battle Rounds on Monday's new episode.Martha Stewart insists she'd never go on The Golden Bachelorette for a surprising reason\n22/10/24 00:53Martha Stewart made a surprise appearance on Bravo's Watch What Happens Live on Sunday, where she insisted she would never go on The Golden Bachelorette.Martha Stewart, 83, reveals why she NEVER drinks gin\n18/10/24 18:07Martha , 83, has revealed why she completely avoids drinking gin - admitting she hasn't tasted the spirit in decades.Snoop Dogg names his top three NFL quarterbacks before making a bold Super Bowl prediction on First Take\n18/10/24 18:01While the NFL season is only seven weeks in, some of its brightest facilitators have returned from their breaks and are already showcasing their star power on the field.Martha Stewart admits it was 'very easy' to keep her cheating a secret for 30 years\n17/10/24 14:41Martha, 83, shocked fans recently after she revealed in a bombshell trailer for her upcoming Netflix documentary, Martha, that she was unfaithful during her lengthy marriage to Andrew Stewart.The Voice fans praise Camryn Brooks for incredible four-chair turn - three years after she was brutally rejected\n15/10/24 04:42NBC's The Voice returned on Monday, with fans praising the latest success story of a returning contestant.Netflix fans go wild over Martha Stewart's brilliant one-liners in promo for her new documentary featuring Snoop Dogg\n10/10/24 23:42Netflix fans have been sent into a frenzy over an upcoming documentary about lifestyle mogul Martha Stewart.\nPage\nDON'T MISS\n-\nRio Ferdinand, 46, and wife Kate, 33, reveal they have moved to Dubai with their family as they show off their lavish mansion\n-\nCruz Beckham shares an intimate moment with Jackie Apostel after joining shirtless dad David aboard their lavish yacht\n-\nEmma Watson potters around in a sheer lace dress as she joins her hunky personal trainer for a hike in Saint Tropez\n-\nEXCLUSIVE\nI was desperate to know what this model got up to with England star. Now I've discovered truth, reveals KATIE HIND\n-\nSting is being sued for 'MILLIONS of pounds in lost royalties' by former bandmates in The Police\n-\nBeaches, history, waterparks, golf... Turkey (Türkiye) has it all: Here's why you'll never want to leave\nAd Feature\n- Selena Gomez stuns in black swimsuit on yacht for bachelorette party in Cabo... but was BFF Taylor Swift there? Looking good\n-\nWas this earliest sign of cracks forming between Meghan and Kate? Expert reveals signs that 'Fab Four' weren't getting on\n-\nEXCLUSIVE\nThe dark truth of Club Chalamet: She's a 58-year-old Timothée obsessive who HATES Kylie Jenner\n-\nCould an app really make you better with money? Putting a smart money app to the test\nAd Feature\n-\nBrooklyn Beckham and Nicola Peltz give fans a glimpse of their 'perfect Sunday' as couple unwind after family 'snub'\n-\nMeghan Markle 'placed status above reality' and struggled to separate her own image from Suits character, claims royal author\n- Zoe Kravitz seen arm-in-arm on romantic stroll in Rome with Harry Styles after getting cozy with Austin Butler See the pic\n- I Dream of Jeannie star Barbara Eden turns 94 and looks more glamorous than ever... see her now All change\n-\nGet your autumn on! From pumpkin throws to cosy hot chocolate mugs, here's our pick of homeware for the new season\nAd Feature\n-\nFrom Princess Margaret's sadistic streak to Meghan 'berating a gardener' - the most ill-mannered royals revealed\n-\nKaty Perry makes a braless fashion statement in curve-clinging dress... after Justin Trudeau romance rumors\n-\nWhy Millie Bobby Brown, 21, decided to shun Hollywood in favour of farm life in a nod to her British roots as she adopts a baby\n-\nBritney Spears reveals Sam Asghari 'felt like a fake distraction' to cope with being 'cut off' from sons\n-\nFrom auctions to EVs: 5 brilliant motoring brands every driver should know - from finance fixes to stunning electric SUVs\nAd Feature\n-\nBobby Brazier's love for Hare Krishna: From finding happiness through religion after tragic start - as soap star 'quits showbiz'\n-\nMum's the word! George, Charlotte and Louis join William and newly blonde Kate for church service in Balmoral\n-\nMillie Bobby Brown, 21, and Jake Bongiovi, 23, bond with baby daughter in NYC... days after announcing adoption\n-\nEmily Ratajkowski showcases her curves in leather dominatrix inspired lingerie\n-\nWhy Scottish Mortgage is backing the future of banking for long-term profits\nSponsored\n-\nStrictly Come Dancing bosses deliver verdict on future of BBC show after a male star was arrested on suspicion of rape\n-\nSuperman actor Dean Cain, 59, brutally mocked for struggling through training course after signing up with ICE\n-\nHidden detail in Kelly Clarkson's outfit which symbolizes 'healing and hope' after ex Brandon Blackstock's death\n-\nLily Collins' VERY famous father-in-law reveals he isn't a fan of her show Emily in Paris - but do YOU know who he is?\n-\nEastEnders star Cheryl Fergison reveals the devastating moment she found her husband in a 'dingy love nest' with another woman\n- Vogue Williams gives fans a glimpse at her early 40th birthday celebrations with family and friends Milestone celebration\n-\nPaul Merton reveals it 'felt natural' falling in love with third wife Suki Webster six months after becoming a widower\n-\nSir Elton John, Sir Rod Stewart and Jessie J join an array of music legends for tribute to 'funny and rude friend Steve Wright'\n-\nEXCLUSIVE\nIs 'Saint' Peter Andre REALLY an angel? Katie Price's ex mocked disabled son Harvey and told Junior not to kiss boys\n- Try Amazon Music Unlimited FREE for 30 days! Enjoy millions of songs, audiobooks and podcasts SHOPPING\n-\nPassenger princesses! Kate and Charlotte beam as Prince William drives family to church service in Balmoral\n- Bikini-clad Naomi Campbell, 55, shows off her age-defying physique as she enjoys a lavish trip to Ibiza She's still got it\n-\nVictoria and David Beckham look more smitten than ever after 26 years of marriage as they enjoy lunch with their children in Nerano\n-\nLove Island's Kaz Crossley and TOWIE's Elma Pazar among reality stars 'involved in horror crash'\n- Upgrade your home office with up to 50% off ergonomic desk chairs and standing desks (and we have an EXCLUSIVE extra code) SHOPPING\n-\nMyleene Klass shows off her harp playing skills as accomplished musician performs at 'dear friend' Clare Patterson's wedding\n-\nJackie Woodburne doesn't look like this anymore! Neighbours star is unrecognisable as she ditches the brunette crop she's had for decades and reveals grey hair\n- Queen's 20-year-old supercharged Range Rover sells for over ten times its typical market value at auction Pricey\n- Linda Robson reveals the real reason for major Loose Women changes amid fears for the show's future Speaking out\n- Shoppers flocking to Tesco after price slash on 'DELICIOUS' award-winning £20 Irish cream liqueur that's giving Baileys a run for its money SHOPPING\n-\nTyson Fury's daughter Venezuela, 15, goes Instagram official with 'mystery boyfriend' - and his profession runs in the family\n-\nThe Walking Dead star's son makes disturbing threat after being charged with assault\n-\nSuki Waterhouse treats fans to a raunchy performance as she takes to the stage in black fishnet tights and microscopic shorts\n- Jameela Jamil raises alarm over Serena Williams' weight loss drug promotion British star has blasted Williams\n- Why pay full price? This hack lets small businesses lease top tech for as little as £2.16 per MONTH - and no, there's no catch! SHOPPING\n-\nBritney Spears poses nude in new photo after sparking fan concerns over disheveled living conditions\n-\nLeigh-Anne Pinnock flashes her abs in a skimpy red bra as she she continues her tour of UK festivals with solo gig at Reading\n- TV host Jenni reveals secret to bikini body...no chips or crisps for 34 years! Still looking toned and trim\n- Tulisa wears a strapless lime bustier as she she returns to the spotlight at Manchester Pride Looking good\n- Shiseido launches upgraded viral skincare - get 20% off plus a free gift with our exclusive code SHOPPING:\n-\nDating Naked line-up REVEALED: Controversial Married At First Sight star joins new series of Rylan Clark's show\n-\nFeuding royal rivals William and Harry go to war. Sound familiar? CHRISTOPHER STEVENS reviews King & Conqueror\n- Zendaya says she loved getting to do 'normal' things during her time with fiancé Tom Holland in Scotland Close couple\n-\nEXCLUSIVE\nLuisa Zissman shares bikini snaps amid skinny-shaming row - after sparking debate for smashing kids' iPads\n- Is YOUR mattress causing you sleepless nights? Don't miss out on the best Emma Sleep deals with up to 25% off - prices start at £50 SHOPPING\n-\nJeering Dragons' Den panel called my business a 'delusional disaster' - now I'm worth £40million!\n- Pop star under fire as fans call out penis-shaped stage design on opening night of tour It got off to a very memorable start\n-\nPregnant Sophie Habboo accidentally posts full frontal picture of husband Jamie Laing to fans as they enjoy Bank Holiday weekend\n- Inside Kristin Cavallari's wild Las Vegas weekend The 38-year-old reality star splurged the cash during her lavish trip\n-\nJenni Falconer, 49, displays her flawless physique in a skimpy leopard-print bikini as she soaks up the sun during summer break\n-\nSelena Gomez's fiancé Benny Blanco is SLAMMED for purchasing $200 blueberries: 'I can't afford regular fruit'\n- Julianne Moore admits her wedding dress was a HUGE mistake after skipping tradition to wear white Big regret\n- Kylie Jenner gives rare update on beloved dog Norman that she got at age 17 She's had the pet since she was a teenager\n-\nAll the celebrities who have REVERSED their cosmetic surgery from Chloe Ferry to Molly-Mae Hague and even Victoria Beckham\n- These 'DELICIOUS' cupboard-ready meals make nutritional eating quicker and easier than ever (and we have an exclusive deal) SHOPPING\n- A-list celebrities rush to check on Kyle Sandilands following reports 'he was off-air due to stroke' Worrying\n-\nTaylor Swift's true feelings REVEALED over Kansas City Chiefs docuseries that explores Travis Kelce romance\n-\nMark Wright and Michelle Keegan put on a loved up display as they enjoy romantic date night at Coldplay's Wembley gig\n-\nEXCLUSIVE\nFormer Baywatch star Nancy Valen ditches Hollywood glamour in rare sighting - see her now\n-\nClaudia Schiffer shows support for her husband Matthew Vaughn's team by posing in a Brentford shirt\n- Gloria Estefan may sue Diddy accuser who name dropped her and husband Emilio The court officially dismissed all allegations\n-\nThe downfall of Marco Pierre White Jr: Son of Michelin star chef has shirked his upbringing to have multiple brushes with law\n-\nJosie Gibson admits she's 'stepped back' from TV work and reveals plans to live 'off-grid as humanly possible'\n-\nEXCLUSIVE\nWilliam Shatner, 94, and his ex-wife spark REMARRIAGE rumors as she steps out wearing huge diamond ring\n-\nBraless Myleene Klass heads to work in a bandeau top and mini skirt after Frankie Bridge broke her silence on their 'feud'\n-\nLady Gaga breaks down during concert after revealing what fiance said moments before she took the stage\n-\nCelebrities who have dated people who look JUST like their siblings with eerie similarities - but do you agree with the comparisons?\n-\nScarlett Thomas' staggering payday as her father Ryan insists she hasn't had a free ride - after nepo baby, 16, skipped GCSEs\n-\nCall me sweet and I'll tell you to f*** off: Dame Helen Mirren, 80, issues a very blunt response to 'condescending' comments about age\n-\nX Factor star who faced off with Simon Cowell looks unrecognisable after reinventing himself as a 'spiritual healer'\n-\n'Irresponsible' Sam Faiers and Billie Shepherd shock fans with their 'dangerous' holistic healthcare advice\n-\nMike Tindall reveals his 'sliding doors' moment when he first met Zara Tindall in 2003\n-\nDuncan James SPLITS from boyfriend after six years together as Blue singer shares post about 'growth' to fans amid heartache\n-\nAlec Baldwin shares sensual moment with wife Hilaria as couple reenact Dirty Dancing in what appears to be a desperate audition for DWTS\n-\nSerena Williams buries feud with Maria Sharapova with shock appearance as Russian enters tennis Hall of Fame\n-\nThe Hollywood stars you had no idea appeared on reality TV shows before they were famous\n-\nEXCLUSIVE\nThought the Biggest Loser was harsh? TV's self-declared 'lard police' Steve Miller insists he has 'no regrets' about his controversial Fat Families show\n-\nConor McGregor poses with 'yacht neighbour' David Beckham and sons Romeo and Cruz as UFC star hails football legend's 'dynasty'\n-\nColdplay's Chris Martin makes a cheeky swipe about the kiss-cam scandal before helping with a proposal and sharing sweet moment with autistic fan\n-\nFreddie Starr died 'penniless and estranged from his six children' as stranger stepped in to bring his body home from Spain and foot funeral bill\n-\nNelly Furtado, 46, delights fans with Noughties nostalgia as she storms the stage in a racy cut out top and mini skirt at the Big Feastival\n-\nSaturday Night Live boss Lorne Michaels says there will be a bloodbath of cast members within weeks\n-\nStacey Solomon and Joe Swash having another baby 'not off the table' following loved up display on luxurious family holiday\n-\nBobby Brazier, 22, 'is quitting showbiz and moving to India to pursue the Hare Krishna religion'\n-\nThis is just a saga now: Games critic Peter Hoskin checks out Echoes Of The End, an ambitious new video game from Iceland\n-\nThe exact treatments behind Karren Brady's transformation: The Apprentice star receives 'state-of-the-art technology for fat removal', says her very own cosmetic surgeon\n-\nLuisa Zissman reveals she smashed up her childrens' iPads in front of them because they 'p****d her off' - as controversial post sparks huge debate\n-\nNeighbours star Ian Smith shares major health update after being diagnosed with terminal lung cancer\n-\nOscar-winning actor looks unrecognisable in 90s comedy that has since become a cult classic - can YOU spot who he is?\n-\nRyan Thomas' nepo baby actress daughter Scarlett, 16, reveals she didn't sit her GCSEs\n-\nAlison Hammond, 50, is happier than ever with boyfriend David Putman, 28, and 'can't imagine her life without him as friends predict engagement'\n-\nEXCLUSIVE\nWas Hulk Hogan MURDERED? Estranged daughter Brooke has NEW information amid police investigation into death... here's all the evidence\n-\nEXCLUSIVE\nVile plot against Kylie Jenner with two-word code name... orchestrated by Timothee Chalamet's die-hard fans who say it's punishment for doing the unthinkable\n-\nUniversity Challenge's most memorable players: From irritating habits to disastrous blunders and wise cracks, the BBC boffins who stole the show\n-\nJacqueline Jossa and hubby Dan Osborne enjoy family holiday - months after a make-or-break getaway saved their marriage following brief split\n-\nMaya Jama 'considers moving to Manchester to be closer to footballer boyfriend Ruben Dias' as romance becomes more serious\n-\nStrictly Come Dancing gets 'major format shake-up' for this year's series that could 'disrupt chemistry' between celebrity and pro dance partners\n-\nStrictly Come Dancing star arrested on suspicion of rape in fresh blow for scandal-hit show just weeks before series returns to screens\n-\nNick Ferrari, 66, marries longtime love Clare surrounded by celeb pals including Piers Morgan, Myleene Klass and Christopher Biggins in idyllic venue in the south of France\n-\nKENNEDY: Shame on Serena Williams! She may be starving herself on prescription anorexia drugs. But this putrid stunt proves she's still a greedy beast\n-\nNetflix fans rave over 'simply fantastic' period drama hailed as 'a beautiful piece of storytelling' with huge Hollywood star in lead role\n-\nEXCLUSIVE\nFlorence Pugh's brother Toby Sebastian who starred in Game of Thrones has drastic new career change\n-\nThe tale of two Taylors! From Hollywood showmances to rebelling against studios - the incredible parallels between Taylor Swift and Elizabeth Taylor\n-\nNetflix fans gripped by 'harrowing and nightmarish' Vanessa Kirby sex work thriller - gushing over her 'powerhouse performance'\n-\nArnold Schwarzenegger's son Chris is unrecognizable in shockingly thin appearance after weight loss... see him now\n-\nAbbey Clancy wows in a bikini as she poses with husband Peter Crouch and their four children during idyllic summer holiday\n-\nKing Charles and Queen Camilla tell of 'deepest admiration for the unbreakable courage and spirit of the Ukrainian people' in Independence Day letter\n-\nMillie Bobby Brown weighs in on letting her kids pursue acting in resurfaced clip... after adopting baby girl at just 21\n-\nSopranos star Jerry Adler dies at 96: Late-blooming actor worked with Woody Allen and appeared on The Good Wife\n-\nEXCLUSIVE\nHome And Away tease the return of iconic couple Brax and Ricky after a decade away from Aussie soap\n-\nEXCLUSIVE\nI was the resident therapist on Celebrity Fit Club, the stars binged on pizza after weigh-ins and one was sacked after getting a gastric band mid-series\n-\nJack Osbourne honours late father Ozzy with heartfelt tribute in rare public appearance... one month after rock legend's death at 76\n-\nBradley Cooper, 50, and Gigi Hadid, 30, jet out for getaway together as age-gap romance heats up\n-\nEXCLUSIVE\nPride and Prejudice first look: Jack Lowden and Emma Corrin transform into Mr Darcy and Elizabeth Bennett for heated first scenes\n-\nMeghan and Harry's Michelin-starred wedding chef who features in new Netflix series reveals duchess's secret kitchen skills\n-\nEXCLUSIVE\nRaye forced to halt her performance as a fan collapses in the crowd at All Points East Festival\n-\nFKA Twigs puts on a very racy performance at All Points East after being drafted in as last minute replacement for Doechii\n-\nMeghan Markle's high street capsule wardrobe revealed: From staple crisp shirts to her go-to ballet flats\n-\nI'm A Celebrity star Dean McCullough speaks out as police investigate sick death threats\n-\nBrooks Nader's ex Gleb Savchenko seen on DWTS set after she claimed he was 'fired'\n-\nEXCLUSIVE\nTaking the Michael! ITV chiefs throw cash at comedian McIntyre in bid to nab him from BBC... but hit a snag because super-rich comic only cares about ratings\n-\nKylie Jenner's mini-me daughter Stormi steals the spotlight in her first commercial for mom's makeup\n-\nLil Nas X stripped completely nude on street before LA arrest in shocking new footage\n-\nLeigh-Anne Pinnock puts on an X-rated display as the former Little Mix star headlines Pride in Manchester\n-\nCoronation Street bosses face backlash for casting actor 'who broke another man's eye socket' as upcoming storyline reflects real life\n-\nLiam Gallagher extends major olive branch to his brother Noel during Oasis reunion tour - after years of feuding\n-\nGrief-stricken Kelly Clarkson appears shaken as she's seen for FIRST TIME since tragic death of ex-husband Brandon Blackstock\n-\nTALK OF THE TOWN: Moving in the right direction - Harry Styles set to start work on mega-mansion\n-\nSophie Turner reveals why she will never leave the UK again after moving back to London following divorce from ex Joe Jonas\n-\nJennifer Garner appears fresh-faced on solo outing after her kids celebrate dad Ben Affleck's low-key birthday\n-\nGRIFF RHYS JONES: My night with four young people (I paid, of course)...and why, in spite of all their witless opinions, I deplore the way their futures are being stifled\n-\nKatie Price displays her surgically-enhanced assets in a grey top as she steps out in London amid bitter feuds with her exes\n-\nEXCLUSIVE\nNew series depicts Princess Diana as an American mom with an addict daughter in Arizona - but friend behind the show insists he's not cashing in on her memory: KATIE HIND\n-\nEastEnders star Cheryl Fergison, 59, reveals she has suffered a worrying stroke - amid financial struggles\n-\n'Oh she's out!' Michelle Keegan lets her hair down as she posts selfie with a beer before partying at Coldplay's Wembley gig\n-\nLovely jubbly! Sir David Jason, 85, is in great spirits as he's mobbed by fans before his new show at Manchester's Lowry Theatre\n-\nMAFS UK expert Charlene Douglas in a wheelchair after being rushed to hospital as she gives health update\n-\nGeorgia Toffolo flaunts her toned abs in a skimpy white bikini as she shares snaps from sun-soaked holiday\n-\nJowita Przystal celebrates her birthday on wild night out as Pete Wicks shows off the moves she taught him on Strictly after pair reignited romance rumours\n-\nSam Thompson shows off new physique as he poses with equally buff brother-in-law Ryan Libbey after crashing sister Louise's family holiday\n-\nDid William the Conqueror really have an Asterix moustache? No, say historians - and that's just one of BBC blockbuster's howlers\n-\nKhloe Kardashian nearly upstages her friend at her birthday party as fans go wild over her 'amazing' look\n-\nJeremy Clarkson checks out the competition! Star samples a Britpop lager as he takes a break from his Cotswolds farm duties to enjoy Blur star Alex James' festival\n-\nEmily in Paris resumes filming in Venice two days after Netflix show's 'assistant director collapses and dies' in front of horrified crew\n-\nKylie Jenner gets roasted AGAIN after reposting snaps from her most-hated fashion shoot\n-\nThe dark past of William and Kate's 'forever home': Slavery links, an equerry who blew his brains out and a royal break-up...\n-\nThe Kooks frontman Luke Pritchard reveals why Rebel Wilson joined the band on stage and admits they only rehearsed an hour before\n-\nStunning wealth of Coco Gauff, 21, revealed as she's named the world's highest-earning female athlete\n-\nNepo baby son of Walking Dead star and 90s iconic supermodel arrested for assault\n-\nDua Lipa turns 30! Hitmaker sizzles in a sheer halter dress as she celebrates milestone birthday with intimate dinner while paying tribute to parents\n-\nSydney Sweeney who? Awards panel unveils 25 greatest films list with stars over 60 amid Hollywood's youth obsession\n-\nClaudia Schiffer sports a football shirt as she cheers on Brentford with husband Matthew Vaughn at the Gtech Community Stadium - after filmmaker invested in Premier League club\n-\nSophie Ellis Bextor stuns in glitter mini dress she makes surprise appearance at Reading Festival to perform Murder on the Dancefloor\n-\nAnd Just Like That... woke storylines killed the SATC reboot: From Miranda's 'late life lesbianism' to Charlotte's family gender issues - the moments that left viewers cringing\n-\nI met Amanda Holden when the Britain's Got Talent cameras weren't rolling - she showed her true colours straight away\n-\nLove Island's Yasmin Pettet reveals emotional reason she 'hasn't been intimate' with boyfriend Jamie Rhodes after leaving the villa\n-\nCountry superstar says chance meeting with Taylor Swift at Travis Kelce's charity camp lit up collab hopes\n-\nEXCLUSIVE\nSecret Lives of Mormon Wives explodes with lesbian twist as stars KISS in steamy first look at Season 3\n-\nImpossible contestant sent home empty-handed after struggling with a Harry Potter question on axed BBC show - but could YOU have guessed it?\n-\nBBC star Michael Ball reveals his mother has died as devastated singer is flooded with support by fans\n-\nSydney Sweeney's Americana director defends flop after box office crash\n-\nQueen Camilla is stylish in blue as she steps out at the final day of the York races\n-\nVicky Pattison leaves fans 'horrified' as she lets a dog lick her mouth in 'stomach churning' clip\n-\nBrookside legend Sue Johnston set to reprise iconic role after 35 years in historic Hollyoaks crossover\n-\nDrake back in bed with Bobbi Althoff after viral feud as they tease new project\n-\nLeona Lewis reveals how motherhood has changed her - as she gears up for her first-ever Las Vegas residency"
    },
    {
      "url": "https://www.dailymail.co.uk/sport/afl/index.html",
      "text": "Advertisement\nRELATED TOPICS FOR AFL\nAFL Latest News, Results, Scores and Fixtures\nPage\nThe AFL's Mad Monday is on again. Here's a look back at the code's biggest post-season party scandals - from drunken disgraces to a dwarf being set on fire\n25/08/25 03:41\nHere's why the mere mention of the words 'Mad Monday' sends shivers down the spines of officials at AFL clubs....read\nRevealed: The star who'll be playing the NRL grand final - and he's NOWHERE near as well known as the AFL's Snoop Dogg\n25/08/25 01:45The AFL has had the wood on the NRL when it comes to musical star power at the year's biggest game for the last few years - and that trend shows no signs of being reversed in 2025.Bec Judd makes heartbreaking family confession during solo work trip\n24/08/25 14:31Bec Judd has revealed how she really feels about being alone on a work trip in Western Australia.Footy pundits make shocking prediction about Jamarra Ugle-Hagan's chances of playing AFL football in 2026\n24/08/25 13:52Footy great James Hird has expressed his worries that Jamarra Ugle-Hagan will struggle to get interest from other footy clubs, should he part company with the Bulldogs at the end of the season.AFL star Nick Holland and wife Rachel announce shock split after 16 years of marriage - labelling it a 'restructure'\n24/08/25 08:04AFL star Nick Holland and his lawyer wife Rachel have split after 16 years of marriage.AFL star Izak Rankine leaves the country following four-match ban for homophobic slur\n24/08/25 01:53Footy star Izak Rankine has made a shock decision following his ban for four games by the AFL for using a homophobic slur during a match.Bulldogs coach gives strong indication about the future of troubled superstar Jamarra Ugle-Hagan\n23/08/25 05:01The Western Bulldogs have given their strongest suggestion to date that troubled forward Jamara Ugle-Hagan will not be at the club next seasonTarryn Thomas posts bizarre promotional video and hints at comeback\n23/08/25 02:02Troubled former North Melbourne player Tarryn Thomas has re-emerged publicly, posting a promotional video and suggesting he is eyeing a return to footballRappers, reality stars and Iron Men: Inside Tammy Hembrow's tumultuous love life before her new romance with AFL star Bailey Smith - and the nasty 'wet wipes' song that was written about her\n22/08/25 10:16It's no news that Tammy Hembrow's love life has long been in the spotlight.The AFL said Snoop Dogg's controversial takes on gay people were all in the past. The rapper just proved them wrong at the worst possible time\n22/08/25 07:32The furore over the league's choice of Snoop to perform at the grand final just won't go away - and this time it's the hip-hop icon himself who has poured petrol on the fire.Bec Judd's infamous 2004 Brownlow Medal gown achieves 'iconic moment': 'LOL!'\n22/08/25 07:22The racy gown that put Rebecca 'Bec' Judd on the map at the 2004 Brownlow Medal red carpet has now been 'immortalised' in the most 'iconic' way.Olympia Valance reveals the eye-watering price of her coffee table as she tries to offload it on Instagram\n22/08/25 05:37Olympia Valance has revealed the eye-watering price she once paid for a marble coffee table as she tries to sell it after becoming a mother.Perth businessman sues Married At First Sight star for defamation over 'malicious' social media posts\n22/08/25 04:28Perth businessman Aidan Ciaran Murphy has filed a defamation lawsuit against Married At First Sight star Lauren Dunn over social media posts made last month.Woman who sits on a government taskforce has her Aboriginal heritage questioned in explosive claim at Fair Work Commission\n22/08/25 03:36A 1980s children's TV star, who now sits on a government taskforce, has had her Aboriginality challenged in a claim before the Fair Work Commission.See the moment an AFL coach gets busted SPYING on rival team ahead of one of the biggest games of the year\n22/08/25 02:30Tension between the Western Bulldogs and Fremantle could boil over this Sunday as the teams face off, with the loser done for the season.Footy coach breaks his silence after being sacked over vile Tammy Hembrow slur - as his shocking 'kitchen' comment about a women's footy star surfaces\n22/08/25 02:25John Baggetta lost his job when his unthinkable comment about Hembrow surfaced soon after her headline-grabbing date with AFL star Bailey Smith.Gay fans of the Adelaide Crows smash the club after Izak Rankine's homophobic slur drama\n22/08/25 01:14The four-match suspension handed down to Rankine has left some greats of the game furious. Now the Crows have been sent a damning message by some of their own supporters.Sophie Cachia and AFLW star Madison Prepakis pocket cool profit with sale of four-bedroom Melbourne home\n22/08/25 00:37Influencer Sophie Cachia and her partner, AFLW star Madison Prespakis, have pocketed a cool $1.165million after selling off their Melbourne home last week.Tammy Hembrow risks major wardrobe malfunction as she flaunts her extreme bust in tiny top - after new beau Bailey Smith dropped relationship bombshell\n21/08/25 14:23Tammy Hembrow recently updated her breast implants and she has been happily showing them off ever since.Adelaide boss breaks silence after player cops ban for homophobic slur and admits he is 'nervous' for the small forward - as footy great blasts the AFL over sanction\n21/08/25 10:35The AFL handed down its sanction on Thursday after five days of talks with the Adelaide Football Club.How playing a Britney Spears hit song has landed an exclusive city nightclub beloved by celebs in VERY hot water\n21/08/25 09:03A Melbourne nightclub which hosted international megastars including 50 Cent and Travis Scott and is frequented by celebs and AFL footballers has been targeted by police for playing a hit song.Controversial footy great turned radio host is accused of trying to turn AFL star Izak Rankine into the VICTIM after he hit opponent with a homophobic slur\n21/08/25 06:39Former Adelaide Crows star turned radio presenter Stephen Rowe has been slammed over remarks he made about the incident that has become the talk of the AFL.The AFL hands down SHOCK decision on banning star for using a homophobic slur during match\n21/08/25 06:03Izak Rankine is the sixth AFL star to be banned for an on-field homophobic slur since April last year.Sam Newman hits back after being cancelled yet AGAIN despite promising not to talk about the Welcome to Country and trans women in sport\n21/08/25 05:41Controversial AFL identity Sam Newman has returned serve after he was suddenly axed from a speaking engagement with a well-known footy legend.Tammy Hembrow's son rushed to hospital after shock accident\n21/08/25 00:07Tammy Hembrow's 10-year-old son Wolf has been rushed to hospital following an accident at school camp.Troubled AFL star Bobby Hill's partner breaks her silence on their split as she lashes out at 'beyond disgusting' fan abuse\n20/08/25 14:03Bobby Hill's ex Georgia Devlin has made her first public comment on her split from the Collingwood AFL star - after she was subjected to the worst kind of online trolling.Revealed: How AFL team will use Snoop Dogg as a defence as they try to get their star off the hook for using a shocking anti-gay slur during a match\n20/08/25 09:13The Adelaide Football Club is trying to reduce a proposed five-game suspension that is set to be handed to their player Izak Rankine.Footy legend Patrick Dangerfield reveals the secret he shared with AFL coach just hours before he was stabbed to death by his son\n20/08/25 06:41Patrick Dangerfield has reflected on what he calls the toughest period of his life, which came after the tragic death of former Adelaide Crows coach Phil Walsh at the hands of his son.Tammy Hembrow breaks down in tears during moment with her son Wolf, 10, amid blossoming romance with AFL star Bailey Smith\n20/08/25 05:29Tammy Hembrow was seen crying as she dropped her 10-year-old son Wolf off at school camp on Wednesday.Revealed: The brutal sledge AFL star copped before he uttered anti-gay slur that looks set to end his season\n20/08/25 03:18Adelaide Crows star Izak Rankine is facing a season-ending ban following a homophobic slur directed at a Collingwood player.Father of footy reporter who died in horror traffic accident reveals his heartbreak over dropping a lifelong habit that connected him to his son\n20/08/25 01:53The father of sports reporter Sam Landsberger has given a raw account of what he 'couldn't live with' after the tragic accident that took his son's life.Bailey Smith drops relationship bombshell and it may not be good news for new love Tammy Hembrow\n20/08/25 00:58Bailey Smith has shared some interesting insights into his dating life - and it may not be good news for Tammy Hembrow.Lindy Klim announces shock career move: 'You're about to laugh at my expense!'\n20/08/25 00:13Lindy Klim stunned fans on Tuesday night by announcing a shock career move.Tammy Hembrow 'plotting to overthrow' Bec Judd as queen of the WAGs with 'Brownlow red carpet heist' as her romance with AFL star Bailey Smith heats up\n19/08/25 12:03Tammy Hembrow is reportedly gearing up for a jaw-dropping appearance at this year's Brownlow Medal, that could rival Bec Judd's unforgettable red dress moment from 2004.Tammy Hembrow's best friend shares VERY interesting timeline detail about her marriage breakdown with Matt Zukowski - as fitness influencer moves on with AFL star Bailey Smith\n19/08/25 06:37Tammy Hembrow's best friend has made a very telling comment about the timeline of her marriage breakdown with Matt Zukowski.AFLW star Moana Hope claims she was subjected to 'vile' abuse and threats in front of her young kids while playing in footy final\n19/08/25 02:55Moana Hope has alleged she was threatened with 'physical violence' in what she described as a 'horrible' experience she endured as her children watched her play.Footy legend says troubled AFL star Jamarrah Ugle-Hagan will NEVER play another game after he was caught up in 2am nightclub shooting\n19/08/25 02:38Western Bulldogs star Jamarra Ugle-Hagan has come under scrutiny again despite being cleared by Victoria Police of any involvement in the firearm incident.Tammy Hembrow is labelled 'strategic' after she films herself crying following marriage breakdown to Matt Zukowski: 'She had that video ready to go'\n19/08/25 02:37Tammy Hembrow has been labelled 'strategic' following the breakdown of her marriage to Matt Zukowski.Footy stars get suspended for anti-gay slurs. So should they also be banned for the vile things they say about each others' wives and families? One respected AFL commentator says YES\n19/08/25 02:04Izak Rakine could be gone for the rest of the season if he's found guilty of making a homophobic slur - but one of footy's most authoritative voices says other insults should be on the banned list.First footy star Bobby Hill broke up with the mother of his kids - now he has to 'deal with a split in his own family'\n19/08/25 01:04Collingwood livewire Bobby Hill is facing division on two fronts as he deals with the fallout of his relationship breakdown.Troubled footy star Jamarrah Ugle-Hagan gets caught up in shooting at notorious nightclub after 'getting banned' from other nightspots\n18/08/25 06:20Western Bulldogs star Jamarra Ugle-Hagan was reportedly at the club while he struggles to overcome personal issues that have kept him off the field all season.If you think AFLW stars aren't as skilled as the men, a stunning series of videos has proved you WRONG\n18/08/25 03:06No.1 draft pick Ash Centra has sparked a viral trend after being captured on video just before the first match of the AFLW season last Thursday night.Bec Judd offers to sell $7.3m Melbourne mansion for an eye-watering price tag\n18/08/25 02:35Bec Judd has named the price it would take to sell her family home in Melbourne's Brighton.Tammy Hembrow sets tongues wagging as she flaunts massive diamond ring on her left hand while wearing her new AFL beau Bailey Smith's jacket\n18/08/25 02:07Tammy Hembrow has been making headlines over the last two weeks after being spotted not once, but twice with AFL star Bailey Smith.Footy fans reveal what's driving them away from the AFL - from grog and violence to the sport becoming 'too American'\n18/08/25 01:43A new AFL Fans' Association survey has found that one in five supporters believe attending games this year has been a worse experience than it was last season.Tammy Hembrow brutally roasted over THAT crying video filmed during her marriage to Matt Zukowski: 'Drama queen'\n17/08/25 23:59Tammy Hembrow shocked fans over the weekend after posting a video montage of the moments she broke down in tears throughout her marriage to Matt Zukowski.AFL investigates one of the league's biggest stars for shocking alleged homophobic slur during match\n17/08/25 22:15The top-of-the-table clash between Adelaide and Collingwood on Saturday night could have some very unwelcome ramifications for the Crows and one of their best players.Bailey Smith gets back to work with Geelong Cats following hot weekend hookup with Tammy Hembrow - after blowing up at onlookers during training\n17/08/25 13:43Bailey Smith was back to doing what he does best on Sunday.Tammy Hembrow and Bailey Smith seen on second date as the AFL star flies to the Gold Coast AGAIN to see the fitness influencer\n16/08/25 02:09Tammy Hembrow and Bailey Smith can't seen to get enough of each other, as the pair were spotted enjoying their second date at a beach on Friday.Tammy Hembrow shares shock video of herself sobbing and shaking during her marriage to Matt Zukowski: 'Never thought I'd share this'\n16/08/25 00:35Tammy Hembrow has shared a shocking video montage of the moments she broke down in tears throughout her marriage to Matt Zukowski.Footy coach is SACKED after posing a truly unthinkable comment about Tammy Hembrow on Facebook - after the Daily Mail revealed her secret date with AFL star Bailey Smith\n15/08/25 06:51A Western Australian footy coach has been sacked after making a vile comment about fitness influencer Tammy Hembrow on social mediaTammy Hembrow's ex Matt Zukowski makes bombshell divorce claim - just days after fitness influencer's steamy date with AFL star Bailey Smith: 'It was unhealthy for me'\n15/08/25 04:34Matt Zukowski made a shocking claim about his divorce from Tammy Hembrow on Thursday, just days after she was spotted locking lips with AFL star Bailey Smith.Why transgender athlete believes she will be BANNED from the Olympics despite representing Australia for eight years\n15/08/25 02:56A transgender athlete blocked from playing AFLW is now fearing a fresh ban that would stop her from representing Australia at the Los Angeles OlympicsBrendan Fevola lists stunning five-bedroom Melbourne home for $4.5million\n15/08/25 00:30Brendan Fevola and his wife Alex have listed their stylish Melbourne home on the market for $4.5m, four years after purchasing it.Most parents would be mortified if their little boy gave the middle finger to strangers. Here's why a footy star had a range of T-shirts made up when his son did it in front of thousands of fans\n14/08/25 15:11Jeremy McGovern's son, Hudson, stole the show on Sunday afternoon, while his dad completed a lap of honour at the Optus Stadium.Former footy player learns fate over drink driving crash that killed the 'love of his life'\n14/08/25 11:34Ray Card has been sentenced to nine years in jail after the ex-Geelong player, who had been four times over the legal drink drive limit, caused a car accident in November 2024.Bailey Smith blows up at onlookers at Geelong Cats training session amid intense interest in his romance with Tammy Hembrow\n14/08/25 09:39Bailey Smith isn't weathering the storm of attention around his new romance with Tammy Hembrow.Footy star says anyone who disagrees with the AFL hiring Snoop Dogg to play at the grand final is a RACIST\n14/08/25 05:43Some fans and experts have blasted the AFL for turning its back on its commitment to stamping out sexism and homophobia by choosing the hip-hop legend to rap at the MCG.Telling sign that Tammy Hembrow and Bailey Smith are not a one time thing and may be in a secret relationship\n14/08/25 02:00Tammy Hembrow has given a very telling sign things are getting serious between her and AFL star Bailey Smith.NRL boss Peter V'landys says his code is smashing the AFL - but a damning new revelation proves he is actually WAY off the mark\n14/08/25 00:49Australian Rugby League Commission chairman Peter V'landys has been trumpeting the NRL's success in recent years after stealing a march on the AFL with its games in Las Vegas.Tammy Hembrow shocks as she strips off and flashes bare bottom - after packing on PDA with Bailey Smith\n13/08/25 23:22Tammy Hembrow was showing off her new haul of clothes on Thursday when she gave fans a little more than they bargained for.Bailey Smith's ex girlfriend Izzy Armitage makes explosive claims as his romance with Tammy Hembrow is revealed: 'The gloves are off'\n13/08/25 22:50Bailey Smith's ex girlfriend Izzy Armitage has seemingly ripped into the AFL star after he hooked up with Tammy Hembrow on the Gold Coast over the weekend.College football star breaks down during press conference\n13/08/25 15:34The punter arrived in Nebraska over the summer, having grown up nearly 10,000 miles away in Frankston South in the state of Victoria. He grew up playing Australian Rules football.Collingwood star Bobby Hill faces a devastating setback as he remains out of the game after breaking up with the love of his life\n13/08/25 13:48Hill has not played for the Magpies since their June 21 match against St Kilda, with the club saying he has been dealing with 'personal issues'.Footy WAG claims she had to move on from her job because of her social media posts\n13/08/25 07:18Paris Tier, the girlfriend of AFL star Conor Stone, has gone public with the drama she experienced with her former employer.AFL WAG Kellie Finlayson reveals HUGE news after her stage four cancer diagnosis\n13/08/25 05:41Kellie Finlayson has provided a major life update following her devastating stage four lung and bowel cancer diagnosis.David Koch 'makes move to SACK ex-Channel Nine star from AFL club' after he was accused of standing by disturbing conspiracy theories\n13/08/25 03:31There's been a major update on the boardroom drama at Port Adelaide, where the former Sunrise star serves as the club's chairman.College football star breaks down in tears after being caught off-guard by reporter's question at press conference\n12/08/25 23:40The punter arrived in Nebraska over the summer, having grown up nearly 10,000 miles away in Frankston South in the state of Victoria. He grew up playing Australian Rules football.Tammy Hembrow slams interest in her romance with Bailey Smith - after the wannabe WAG was viciously trolled\n12/08/25 14:11Tammy Hembrow has slammed the 'boring' attention on her new romance with AFL star Bailey Smith.NRL fans are warned not to celebrate star's history-making achievement - and the reason why is proof the nanny state has gone MAD\n12/08/25 11:45Alex Johnston needs only three tries to equal Ken Irvine's long-standing record, having scored the most tries of any player in Australian rugby league's top flight.Chris Judd reveals the fork-in-the-road moment that put him on the road to riches\n12/08/25 08:49Idolised as one of the greatest AFL players to have graced the game, former West Coast and Carlton superstar Chris Judd has opened up on his life after footy, and what motivates him now.Ben Cousins reveals horror incident that made him lose two years' worth of memories - and he even forgot he went to rehab for his drug problem\n12/08/25 07:37The controversial footy great has opened up about his memory loss for the first time, revealing he was in tears after the terrifying episode.TV star makes an embarrassing mistake about the end of a VERY high-profile AFL romance\n12/08/25 06:27Footy broadcaster Garry Lyon was apologetic after his on-air stuff-up on Tuesday. To make matters worse, it involved the brother of one half of a famous former footy romance.Aussie swimming queen Kaylee McKeown finds love with ex-footy star after heartache\n12/08/25 06:13Aussie swim queen Kaylee McKeown recently had some stunning victories at the World Championships - and now she has revealed she's been a winner away from the pool, too.The AFL gets blasted for turning its back on women by paying 'sexist' Snoop Dogg to play at the grand final\n12/08/25 05:33The official confirmation that the hip-hop icon will provide the halftime entertainment at the biggest game of the year wasn't warmly greeted by all footy fans.The three Australian children who no longer have any parents and the heartbreaking truth behind their mum's sudden death\n12/08/25 05:19Three Aussie siblings are left with no parents and shattered hearts after their loving mum's sudden death.NEW Tammy and Bailey pics reveal public act that stunned onlookers. Plus, 'wannabe WAG' group chats explode over our scoop - and rumours swirl about WHY she chose him over other star players\n12/08/25 04:19It was the story that had even the most prudish of AFL fans whispering into their iPhones, 'Hey Siri - who is Tammy Hembrow?' Now we can reveal the full story of Tammy and Bailey's dirty weekend.How Snoop Dogg revealed which AFL team he barracks for almost a DECADE ago - as footy fans are divided over his gig at this year's grand final\n12/08/25 02:50The words 'Snoop Dogg' don't exactly spring to mind when you think of high-profile Aussie Rules fans, but the rapper will be hoping one team raises the premiership cup on grand final day.Tammy Hembrow breaks her silence after being trolled over new romance with Bailey Smith\n12/08/25 01:40Tammy Hembrow has broken her silence after being trolled over her new romance with AFL star Bailey Smith.Shocking new footage of women fighting at footy game surfaces as radio star says brawling AFL fans get special treatment compared to soccer supporters\n12/08/25 01:35The comments on Melbourne's 3AW radio drew support from soccer fans who are tired of what they see as a double standard in Aussie sport.\nPage\nStars of sport\n-\nConor McGregor poses with 'yacht neighbour' David Beckham and sons Romeo and Cruz as UFC star hails football legend's 'dynasty'\n-\nManchester United target Senne Lemmens spotted watching Antwerp's game after being left out of squad with £17m Old Trafford switch looming\n- Jude Bellingham's dad 'tried to confront his other son Jobe's manager' after he was subbed at HALF TIME during dismal display He was 'upset' at full time\n-\nJordan Pickford reveals his role in convincing Jack Grealish to sign for Everton and the Premier League club the Toffees should emulate\n-\nMarcus Rashford is subbed off at HALF-TIME in nightmare evening as England star's new club Barcelona stage a stunning comeback win\nmore stars of sport\n-\nCristiano Ronaldo's trophy curse in Saudi CONTINUES! Last-gasp goal - and a penalty shoot-out - deny Al-Nassr despite his record-breaking goal\n-\nChelsea star Axel Disasi shares unseen snap from their 'bomb squad' dressing room - as he shares what life is REALLY like for Enzo Maresca's cast-offs\n-\nWayne Rooney's son Kai, 15, scores for Man United's under-18s to complete 5-0 rout - while 14-YEAR-OLD wonderkid bags a double\n-\nStunning football TV presenter Diletta Leotta defends her glamorous looks as 'respect for the viewer' after colleague called her and other hosts 'vulgar'\n-\nMorgan Gibbs-White opens up on his failed move to Tottenham as he reveals complications with his fiancée's pregnancy were a factor\n-\nTop 10 transfer hijackings: Sir Alex Ferguson's phone call which denied rivals, Man City's deadline day shock, and the club who keep getting gazumped\n-\nI was born with a thumb and three fingers on each hand as well as only seven toes due to a rare genetic condition - now I've earned a place at the US Open\n-\nRoberto De Zerbi says Marseille dressing room brawl which saw Adrien Rabiot and team-mate transfer-listed was like a 'bar fight', forcing bodyguards to step in\n-\nFormer Premier League winner set to make festival debut at Reading after becoming a DJ in huge career change\n-\nFootball fans left baffled by Sean Dyche's friendship with Kerry Katona as ex-Everton boss makes surprise appearance on Celebs Go Dating\n-\nGlasner gives blunt response to Eze's absence as he confirms Arsenal-bound star won't play for them again - and sends warning to Liverpool on Guehi\n-\nEze's absence for Crystal Palace's first ever European game was a crying shame, but their win vs Fredrikstad is part of his legacy in south London\n-\nMarc Guehi flashes cheeky grin as he delivers pointed message to TV cameras after Crystal Palace's European win amid Liverpool links\n-\nTottenham dealt fresh injury blow with star man ruled out until the NEW YEAR as Thomas Frank ramps up search for reinforcements after Eberechi Eze snub\n-\nRooney insists there is 'no way back' for Alexander Isak after Newcastle strike and blasts Yoane Wissa's 'very disrespectful' Instagram stunt\n-\nOlympic champion Imane Khelif responds to retirement claims as gender row boxer skips World Championships after introduction of sex testing\n-\nRaducanu handed ANOTHER nightmare Grand Slam draw at US Open - but Draper has quarter-final shot before meeting world No 1 Sinner\n- EXCLUSIVE England hit by kit supplier blunder on eve of Women's Rugby World Cup in major blow to fans Not a good look on the eve of the tournament\n-\nRoy Keane reveals unseen details of his Man United contract - including the extraordinary demand Sir Alex Ferguson allowed\n-\nRio Ferdinand reveals why he is relocating to Dubai as Man United legend confirms huge lifestyle change after dramatically quitting punditry job\n- Liverpool Champions League winner set to 'rip up contract' after spending entire season in the RESERVES Six years on from famous win in Madrid\n-\nIsak arrives at Newcastle alone after his bombshell outburst, as Alan Shearer calls behaviour 'nonsensical' and ££40m bid for Wissa is 'REJECTED'\n- Revealed: New Bayern Munich signing is dating club legend's 17-year-old daughter One of Bayern Munich's new signings\n- US Open star Sachia Vickery's sex-work confession sends shockwaves through tennis world Attempting to qualify for the US Open this week\n-\nNeymar confronted by angry Santos fans and 'threatened with violence' at training ground after worst defeat of his career left him in tears\n- Mo Salah's cheeky reaction to Declan Rice goes viral as fans spot Arsenal jibe at PFA Awards Salah and Van Dijk couldn't resist a smile\n-\nRevealed: Man United's Carlos Baleba alternative has an ARSENAL tattoo on his arm and grew up idiolising former Gunners star\n- Awkward clip of Tom Brady flirting with 'beautiful' NFL reporter on Zoom emerges NFL great spoke to her over Zoom, discussing his own career in football\n-\nMoment Jack Draper is TOLD OFF by US Open mixed doubles partner Jessica Pegula for making a cheeky comment after British No 1's quarter-final win\n-\nEmma Raducanu shares an awkward exchange with Jack Draper after British No1 ended her US Open partnership with Carlos Alcaraz\n- Glamorous Olympic athlete is banned for FOUR YEARS for testosterone doping - but has already lined up stunning career switch New move\n-\nPep Guardiola reveals his daughter's brutally-honest reaction to his bold moustache look that left fans stunned during the summer break\n-\nLiverpool fans mock Trent Alexander-Arnold's 'stinker' Real Madrid LaLiga debut as woeful numbers give new boy brutal reality check\n-\nEXCLUSIVE\nNewcastle hit back after Alexander Isak breaks silence with bombshell statement claiming 'broken promises' as he tries to force Liverpool move\n-\nJamie and Rebekah Vardy's potential new life in Italy: God-like status with fans, romantic boat trips and partying... just don't expect pizza from boss!\n-\nMo Salah named PFA Player of the Year for a THIRD time after firing Liverpool to glory as he joins Premier League royalty at awards in Manchester\n-\nGiggling Emma Raducanu and Carlos Alcaraz show how much they enjoy each other's company with plenty of chemistry in US Open mixed doubles defeat,\n-\nWas Jordan Pickford let down by his 'penalty cheat sheet'? England keeper handed a nasty surprise on his water bottle - before Leeds striker scored winner in Premier League return\n- Red-faced Gary Neville caught making dig at Leeds fans live on Sky Sports in hot mic moment - prompting instant apology Leeds beat Everton\n-\nIga Swiatek tells cameraman to stop filming her as Wimbledon champion removed clothes on court at Cincinnati Open\n-\nTyrone Mings shares pointed message after Jacob Ramsey's £39m Newcastle move - after Aston Villa captain John McGinn appeared to aim swipe at financial rules\n-\nYoane Wissa UNFOLLOWS Brentford on Instagram, deletes all club photos and turns profile picture to black amid Bees' £50m demands to Newcastle\n- Jamie Vardy lined up for major shock transfer to Champions League team - in what could be a dream move for wife Rebekah European giants\n-\nTeenage star 1-0 Trolls! The moment footballer, 16, who was mocked for having acne in her unveiling photos, scores brilliant free-kick on her debut\n-\nNeymar left in floods of tears after former Liverpool star scores twice to inflict biggest defeat of his career as Brazilian icon admits: 'I'm ashamed'\n- Ben Askren leaves fans stunned with new video of his recovery after life-or-death double lung transplant at 41 Former UFC fighter\n-\nGary Lineker takes aim at the BBC boss who sacked him in his review of first Match of the Day since he got the boot from £1.35m-a-year contract\n- Strasbourg fan group RIPS into Chelsea owners' 'destructive' and 'abusive' running of club despite qualifying for Europe last season Part of multi-club network\n-\nFans are all saying the same thing after Sky Sports' US-style half-time interview with Martin Odegaard during Arsenal's showdown with Man United\n-\nPaul Scholes offers blunt response to daughter wearing Arsenal shirt as Man United legend watched Red Devils' Premier League opener\n-\nEberechi Eze appears emotional applauding Crystal Palace fans amid Tottenham interest - while Liverpool target Marc Guehi seems to IGNORE Oliver Glasner\n-\nAston Villa captain John McGinn aims dig at financial rules as Newcastle confirm £39m Jacob Ramsey signing from Premier League rivals\n-\nMan United fans make feelings clear on Alejandro Garnancho's future - as wantaway star's poster is DEFACED amid Chelsea interest\n- Man United fans label new ticketing system 'a disgrace' as thousands stuck in queues ahead of season opener against Arsenal Chaos\n-\nRevealed: Little-known rule that saw Eberechi Eze's goal disallowed against Chelsea - as Premier League release statement\n- Man United co-owner Avram Glazer spotted at Old Trafford as Red Devils kick off Premier League campaign against Arsenal First game of the season\n- British UFC star Lerone Murphy delivers stunning spinning-elbow KO just minutes after identical rare finish Manchester-born star aged 34\n-\nMatch of the Day viewers give verdict on first show without Gary Lineker as Wayne Rooney is criticised by fans after his debut following £800,000 deal\n- Erling Haaland pokes fun at Noni Madueke's infamous social media post ahead of Man City's clash with Wolves Cheeky comment\n-\nRicharlison scores 'goal of the season' contender with stunning overhead kick against Burnley - as fans hail 'legendary moment' for Spurs star\n- Ryan Reynolds and Rob McElhenney jet in to cheer on Wrexham's first Championship home game of the season See their side lose\n-\nThe moment Moses Itauma became Britain's next boxing superstar, as he floors Dillian Whyte with devastating combos in brutal first-round knockout\n-\nMan United outcast Jadon Sancho all but confirms romance with rapper Saweetie by inking her name on his neck - and REMOVES tattoo to ex-girlfriend\n-\nJD Vance's NIGHTMARE round at Donald Trump's golf course: US Vice President mocked after committing ultimate sin during UK holiday\n- Chelsea legend SPLITS from his wife of 26 years: Premier League icon shares emotional update on social media End of the road\n- Golf star Scottie Scheffler snaps at reporter over 'ridiculous' Ryder Cup questions in awkward press conference moment World No 1\n- Dillian Whyte turns up the heat on Moses Itauma during tense face-off in Saudi Arabia ahead of their heavyweight showdown Fight on Saturday night\n- Darwin Nunez scores AGAIN as Liverpool flop makes flying start to life in Saudi Arabia, while Reds continue their pursuit of Alexander Isak Left Liverpool last week\n- Louis Rees-Zammit declares return to rugby with maverick English Premiership side as 'the obvious choice' Ended NFL dream after 18 months in the US\n-\nWayne Rooney hits back at Tom Brady: Feud ignites as England legend claims NFL great does NOT understand football after his 'work ethic' was questioned\n- Bitter John Terry reveals he has given up dream career switch after being hit by 'baffling' rejections: 'I didn't even get a sniff' Moving on\n- EXCLUSIVE Coleen Rooney revives Wagatha Christie investigator skills as a detective in hilarious Paddy Power ad She has targets in sight\n-\nRoy Keane set to become a grandad AGAIN - as Man United icon's daughter announces pregnancy alongside England star in emotional snaps\n-\nRevealed: How Mats Hummels 'reacted to his ex-wife's fury' after she complained their son, 7, 'had NOT been invited' to Borussia Dortmund farewell matchr\n- Married football manager's awkward interviews go viral as he desperately tries to avoid eye contact with stunning reporter Set tongues wagging"
    }
  ],
  "argos_summary": "Footy legend Brendan Fevola has warned that the AFL will likely drop US rapper Snoop Dogg from the Grand Final entertainment lineup after the artist’s recent homophobic and misogynistic remarks sparked backlash amid a broader debate over the league’s stance on sexism and homophobia.  AFL CEO Andrew Dillon has defended the decision to book Snoop, citing his past behaviour and the importance of his current public persona, while the league faces criticism from fans and players, including Adelaide star Izak Rankine, over the choice.  The controversy highlights tensions between commercial interests and the AFL’s commitment to inclusivity and respect for women and LGBTQ+ communities.",
  "argos_id": "79IG2EF68"
}