{
  "url": "https://www.yahoo.com/news/articles/trump-lashes-nbc-abc-threatens-043405135.html",
  "authorsByline": "Ambar Warrick",
  "articleId": "b4ccb1d1957b429bb8b7180220307ccd",
  "source": {
    "domain": "yahoo.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-25T04:34:05+00:00",
  "addDate": "2025-08-25T04:43:47.276044+00:00",
  "refreshDate": "2025-08-25T04:43:47.276047+00:00",
  "score": 1.0,
  "title": "Trump lashes out at NBC, ABC, threatens licenses over ‘biased’ coverage",
  "description": "Investing-- U.S. President Donald Trump on Sunday evening lashed out against news networks ABC and NBC and called on the FCC to revoke their broadcast licenses over allegedly biased coverage against him.",
  "content": "Investing.com-- U.S. President Donald Trump on Sunday evening lashed out against news networks ABC and NBC and called on the FCC to revoke their broadcast licenses over allegedly biased coverage against him.\n\nTrump in a Truth.Social post called ABC and NBC “FAKE NEWS… two of the worst and most biased networks in history,” claiming that they gave him “97% bad stories.”\n\n“THEY ARE SIMPLY AN ARM OF THE DEMOCRAT PARTY AND SHOULD, ACCORDING TO MANY, HAVE THEIR LICENSES REVOKED BY THE FCC,” Trump said.\n\nTrump claimed that the two networks did not pay “Millions of Dollars a year in LICENSE FEES,” and should “at a minimum, pay up BIG for having the privilege of using the most valuable airwaves anywhere at anytime!!!”\n\nTrump has constantly railed against news networks which he claim display him in a bad light, and has also engaged in high-profile legal disputes over the matter.\n\nThe U.S. President recently signed a $16 million settlement with CBS News over a lawsuit alleging the network’s coverage was biased against him. He had earlier also reached a $15 million defamation settlement with ABC.\n\nBut Trump’s call for the Federal Communications Commission to reconsider broadcasting licenses marks an escalation in his criticism of news networks, although it’s unclear whether the president has any legal authority to pursue such an action.\n\nABC belongs to Walt Disney Company (NYSE:DIS), while NBC is a unit of Comcast Corp (NASDAQ:CMCSA).\n\nTrump lashes out at NBC, ABC, threatens licenses over ‘biased’ coverage\n\nThese Under-the-Radar Stocks Offer Better Risk-Reward Ratio Than Nvidia\n\nAfter soaring 149%, this stock is back in our AI’s favor - & already +25% in July",
  "medium": "Article",
  "links": [
    "https://www.investing.com/analysis/these-undertheradar-stocks-offer-better-riskreward-ratio-than-nvidia-200663485?utm_medium=feed&utm_source=yahoo&utm_campaign=yahoo-www",
    "https://www.investing.com/news/stock-market-news/after-soaring-149-this-stock-is-back-in-our-ais-favor---already-25-in-july-4127998?utm_medium=feed&utm_source=yahoo&utm_campaign=yahoo-www",
    "https://www.investing.com/news/economy-news/trump-lashes-out-at-nbc-abc-threatens-licenses-over-biased-coverage-4208033?utm_medium=feed&utm_source=yahoo&utm_campaign=yahoo-www"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "news networks",
      "weight": 0.10692825
    },
    {
      "name": "U.S. President Donald Trump",
      "weight": 0.09991777
    },
    {
      "name": "broadcasting licenses",
      "weight": 0.09503018
    },
    {
      "name": "LICENSE FEES",
      "weight": 0.094416834
    },
    {
      "name": "Donald Trump",
      "weight": 0.092932835
    },
    {
      "name": "licenses",
      "weight": 0.090479486
    },
    {
      "name": "Trump",
      "weight": 0.08997324
    },
    {
      "name": "ABC",
      "weight": 0.08367112
    },
    {
      "name": "NBC",
      "weight": 0.08098774
    },
    {
      "name": "Walt Disney Company",
      "weight": 0.06705774
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.9697265625
    },
    {
      "name": "/News/Other",
      "score": 0.95703125
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.7841796875
    },
    {
      "name": "/Arts & Entertainment/TV & Video/TV Networks & Stations",
      "score": 0.67626953125
    }
  ],
  "sentiment": {
    "positive": 0.07117856,
    "negative": 0.7337729,
    "neutral": 0.19504853
  },
  "summary": "U.S. President Donald Trump has criticised news networks ABC and NBC for their allegedly biased coverage of him, calling them \"FAKE NEWS\" and \"two of the worst and most biased networks in history\". He also threatened to revoke their broadcast licenses with the Federal Communications Commission (FCC) for their alleged bias. This statement represents an escalation in Trump's criticism of news networks, which he claims display him in a bad light. However, it is unclear whether the president has legal authority to take legal action against these networks.",
  "shortSummary": "President Donald Trump criticized ABC and NBC’s biased coverage, threatened FCC licenses, and gained traction with legal actions against them.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "f3b9918659af45bf811ad1d1a5b5f265",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.investing.com/analysis/these-undertheradar-stocks-offer-better-riskreward-ratio-than-nvidia-200663485?utm_medium=feed&utm_source=yahoo&utm_campaign=yahoo-www",
      "text": "Asia stocks soar amid growing US rate cut bets, China tech rally\n- Nvidia just crossed $4 trillion—but how much higher can it go?\n- The Magnificent 7 are still strong, but upside looks limited from here.\n- If you’re hunting for the next breakout star, it may be time to look beyond the giants.\n- Looking for more actionable trade ideas? Subscribe now to unlock access to InvestingPro’s AI-selected stock winners for up to 50% off amid the summer sale.\nNVIDIA Corporation (NASDAQ:NVDA) became the first company in the world to surpass a $4 trillion market capitalization during yesterday’s trading session, as the stock hit a new all-time high of $164.42. Since bottoming in April—during peak market anxiety over Trump’s tariffs—Nvidia has now rebounded by over 88%.\nIt’s worth noting that yesterday was marked by renewed tariff concerns following major new announcements from Donald Trump. However, slightly dovish Fed Minutes released later in the day helped lift investor sentiment during the second half of the session.\nCompared with the start of the year, Nvidia has posted a gain of over 21%, making it the second-best performer among the Magnificent 7, behind Meta Platforms (NASDAQ:META).\nHowever, this performance marks a clear slowdown compared to last year’s 171% surge, or the 239% increase recorded in 2023. Moreover, both analysts and valuation models suggest limited further upside for Nvidia at current levels.\nThe same applies to most of the Magnificent 7, which have all shown strong upward trends over the past three months, but also appear to have limited potential based on analysts’ outlooks and the InvestingPro Fair Value model, which aggregates several recognized valuation frameworks:\nSource: InvestingPro\nNvidia, Meta Platforms, Microsoft (NASDAQ:MSFT), Tesla (NASDAQ:TSLA), and Apple (NASDAQ:AAPL) currently show negative potential according to InvestingPro Fair Value, while Amazon (NASDAQ:AMZN) and Alphabet (NASDAQ:GOOGL) show only limited upside.\nWhen it comes to average analyst price targets, none of the Magnificent 7 stocks show negative potential, but none appear to offer substantial upside either. Alphabet has the highest potential, with an average target suggesting a 12% increase from current levels.\nAlthough the ongoing AI boom and other tailwinds could continue to support Nvidia and its peers, these tech giants may no longer be the most explosive opportunities for the next phase of the bull market in tech stocks.\nIt’s Time to Think Outside the Box to Find the Best Technology Stocks\nToday, the most attractive opportunities may lie in lesser-known names, such as those identified by the Tech Titans strategy, available to InvestingPro subscribers.\nThis strategy uses AI to identify the most promising U.S. tech stocks each month—on the 1st—and provides clear and detailed justifications for every stock entry or exit.\nThe results are, to say the least, impressive, with long-term performance exceeding +2,370%.\nSource: InvestingPro\nOver the years, the strategy has delivered standout returns by getting ahead of the crowd on some of the most popular names of 2023–2024:\n-\nSuper Micro Computer (NASDAQ:SMCI): +185.8%\n-\nMicroStrategy Incorporated (NASDAQ:MSTR): +94.9%\n-\nNvidia: +226.4%\nAnd several major wins have already emerged this year, including:\nRecent results speak for themselves: 95% of the stocks identified by the strategy at the beginning of June finished the month higher. July is also off to a strong start, with nearly as many winning positions already.\nIn addition to its performance, ProPicks AI stands out because every decision is justified. For example, a position in Axcelis was closed on July 1 with a +46.6% gain—and came with a full rationale.\nSource: InvestingPro\nFinally, the Tech Titans strategy is just one of over 30 AI-managed strategies available, covering both thematic and regional focuses. This makes it easier for investors with different goals and risk appetites to find a strategy that fits their needs.\n****\nBe sure to check out InvestingPro to stay in sync with the market trend and what it means for your trading. Whether you’re a novice investor or a seasoned trader, leveraging InvestingPro can unlock a world of investment opportunities while minimizing risks amid the challenging market backdrop.\n- ProPicks AI: AI-selected stock winners with proven track record.\n- InvestingPro Fair Value: Instantly find out if a stock is underpriced or overvalued.\n- Advanced Stock Screener: Search for the best stocks based on hundreds of selected filters, and criteria.\n- Top Ideas: See what stocks billionaire investors such as Warren Buffett, Michael Burry, and George Soros are buying.\nDisclaimer: This article is written for informational purposes only. It is not intended to encourage the purchase of assets in any way, nor does it constitute a solicitation, offer, recommendation or suggestion to invest. I would like to remind you that all assets are evaluated from multiple perspectives and are highly risky, so any investment decision and the associated risk belongs to the investor. We also do not provide any investment advisory services."
    }
  ],
  "argos_summary": "U.S. President Donald Trump blasted ABC and NBC as ‘fake news’ and urged the FCC to revoke their broadcast licenses over alleged bias, claiming the networks gave him 97% negative stories and should pay more for airwaves. He cited recent $16 million and $15 million settlements with CBS and ABC over defamation claims. The move escalates his long‑standing feud with mainstream media, though he has no legal authority to force license revocations. The article also briefly discusses Nvidia’s market performance and AI‑driven stock strategies, but these are unrelated to Trump’s media criticism.",
  "argos_id": "84JG79EQH"
}