{
  "url": "https://finance.yahoo.com/news/defense-stocks-arent-only-winners-052727529.html",
  "authorsByline": "Huileng Tan",
  "articleId": "4ed21b03c6574b9e8de82b40912bc55b",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://s.yimg.com/ny/api/res/1.2/vXLG9KcfOiVz5SYESUZzvQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD05MDA-/https://media.zenfs.com/en/business_insider_articles_888/679df168bdaee6f1883413f870a19f48",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-25T05:27:27+00:00",
  "addDate": "2025-08-25T06:09:46.707918+00:00",
  "refreshDate": "2025-08-25T06:09:46.707920+00:00",
  "score": 1.0,
  "title": "Defense stocks aren't the only winners of Europe's spending blitz",
  "description": "Europe's rearmament would lift the region's overall demand for industrial metals by 6% by 2027, according to Goldman Sachs.",
  "content": "• Europe's rearmament will fuel a surge in industrial metals demand, according to Goldman Sachs.\n• Defense stocks are already soaring, with the MSCI Europe Aerospace and Defense Index up 72% this year.\n• Copper stands out, with demand set to climb on defense needs and AI data centers.\n\nDefense stocks have soared this year as European governments ramp up military budgets, and the spending spree could deliver a windfall in another corner of the market.\n\n\"As markets focus on Russia-Ukraine talks and as European defense spending ramps up, we estimate a large boost to industrial metals demand from rising EU defense spending,\" wrote Goldman Sachs analysts in a Thursday note.\n\nGoldman estimates the defense sector already accounts for about 3% of global demand for industrial metals, ranging from about 2% of global steel demand to 7% of nickel demand.\n\nThe MSCI Europe Aerospace and Defense Index has surged 72% higher this year to date. Meanwhile, the US-focused S&P Aerospace and Defense Select Industry Index has climbed 31% over the same period.\n\nThe rally in defense stocks followed the European Union's commitments to boost military budgets amid heightened security concerns — and renewed pressure from Washington for NATO allies to spend more.\n\nGoldman's analysts expect euro-area military spending to rise from 1.9% of GDP in 2024 to 2.7% by 2027, adding about 167 billion euros, or $196 billion, to annual budgets.\n\nAround 40% of that spending boost is likely to flow into the procurement of metals-heavy equipment — roughly double NATO's typical 20% norm.\n\nGoldman estimates Europe's rearmament will lift the region's overall demand for industrial metals by 6% by 2027 — an \"impressive\" jump given that defense made up only about 2% of Europe's metals use in 2023.\n\nGlobally, Goldman projects Europe's rearmament could add 0.9% to copper demand, 1.3% to nickel, and 0.4% to steel by 2027.\n\nCopper — one of the world's most commonly used metals — stands out.\n\nGoldman estimates the defense-driven bump could lift global copper demand growth from 2% to 2.4% annually. Copper runs through nearly every military system — not just vehicles and weaponry, but also the wiring, power, and communications networks that make them work.\n\nThe boom in AI data center infrastructure is also driving demand for copper.\n\nThe demand from defense and AI could ripple into prices. Goldman flagged upside risk to its 2026 and 2027 copper price forecasts of $10,000 and $10,750 per metric ton, respectively, even as high inventories may cap gains in the near term.",
  "medium": "Article",
  "links": [
    "https://www.businessinsider.com/europe-boosting-defense-spending-ukraine-rearm-plan-trump-zelenskyy-2025-3?utm_medium=referral&utm_source=yahoo.com",
    "https://www.businessinsider.com/ai-data-center-development-true-cost-environmental-impact-2025-6?utm_medium=referral&utm_source=yahoo.com",
    "https://markets.businessinsider.com/news/commodities/copper-prices-crash-traders-import-stockpiles-tariff-exemption-metal-2025-7?utm_medium=referral&utm_source=yahoo.com",
    "https://markets.businessinsider.com/news/stocks/european-defense-stocks-surge-bae-systems-rheinmetall-donald-trump-2025-2?utm_medium=referral&utm_source=yahoo.com"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "industrial metals demand",
      "weight": 0.11122009
    },
    {
      "name": "European defense spending",
      "weight": 0.10957309
    },
    {
      "name": "rising EU defense spending",
      "weight": 0.10410739
    },
    {
      "name": "copper demand",
      "weight": 0.10331335
    },
    {
      "name": "Defense stocks",
      "weight": 0.101054795
    },
    {
      "name": "defense stocks",
      "weight": 0.101054795
    },
    {
      "name": "global copper demand growth",
      "weight": 0.10009648
    },
    {
      "name": "defense needs",
      "weight": 0.092952006
    },
    {
      "name": "global demand",
      "weight": 0.09277165
    },
    {
      "name": "defense",
      "weight": 0.09173652
    }
  ],
  "topics": [
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.9912109375
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.91015625
    },
    {
      "name": "/Business & Industrial/Aerospace & Defense/Other",
      "score": 0.62158203125
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.465576171875
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.447509765625
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.4375
    },
    {
      "name": "/Law & Government/Military/Other",
      "score": 0.390869140625
    }
  ],
  "sentiment": {
    "positive": 0.81710196,
    "negative": 0.047607504,
    "neutral": 0.13529047
  },
  "summary": "European governments are increasing their military budgets, leading to a surge in industrial metals demand, according to Goldman Sachs. The MSCI Europe Aerospace and Defense Index has already risen by 72% this year, while the S&P Aerospace & Defense Select Industry Index has risen by 31%. Goldman Sachs estimates that Europe's rearmament will boost its overall demand for industrial metals by 6% by 2027, an impressive leap given that defense accounted for only about 2% of Europe's metals use in 2023. The surge in demand for copper could increase global copper demand growth from 2.5% to 2.4% annually.",
  "shortSummary": "Europe's military rearmament is driving a significant spike in industrial metals demand, with copper especially targeted due to increased defense spending and AI data centers.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "0ce9a128efe5479aa8f464b38f07cb56",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://markets.businessinsider.com/news/commodities/copper-prices-crash-traders-import-stockpiles-tariff-exemption-metal-2025-7?utm_medium=referral&utm_source=yahoo.com",
      "text": "- Copper traders were caught flat-footed after refined copper was exempted from Trump's new tariffs.\n- The exemption triggered a 20% drop in copper futures on the COMEX exchange.\n- Traders now face excess inventory, with COMEX stockpiles at a 21-year high.\nCopper traders were caught off guard on Wednesday after refined copper was excluded from President Donald Trump's new tariffs, leaving them with large stockpiles and rapidly falling prices.\nOn Wednesday, copper futures on New York's COMEX exchange plunged 20% in one day — the largest intraday drop since the contract began trading in 1988.\nThe sell-off followed the Trump administration's decision to exempt refined copper from a sweeping 50% import tariff that takes effect August 1.\nInstead, the tariff will only apply to semi-finished copper products like pipes, wires, and sheets, but not to refined copper, the most widely imported form of the metal.\nThe decision stunned traders who had spent months shipping refined copper into the US in anticipation of the tariff, resulting in COMEX prices surging. Copper is a major industrial metal used in a wide range of applications and sectors, including construction and transportation.\n\"Prices have been rising this year largely because the market has been front-running the tariff policy and not because the demand picture has been improving or because the supply has actually been tightening,\" wrote Ewa Manthey, a commodities strategist at ING.\nCopper futures had been trading at a 28% premium on the US exchange compared to the London Metal Exchange — a spread that crashed overnight.\nNow, traders face a potentially massive inventory overhang.\n\"You pay freight to get the metal into the US, you then fund it or you finance it on the CME, you would now break those financing deals to pay freight another time to ship it back, and then potentially sell it at parity,\" Michael Widmer, Bank of America's head of metals research, told Business Insider, adding that some of that metal could be exported, but that there's also scope for it to stay put for now.\n\"I can't quite see this being a good trade,\" he said.\nCopper stockpiles at COMEX-registered warehouses soared 170% to 253,431 short tons — the highest level in 21 years, per exchange data.\nBy contrast, inventories at LME facilities have dropped roughly 50% this year, a sign of how much metal was diverted to the US.\n\"The news on copper tariffs should eventually normalise the relationship between the COMEX market and other global copper markets,\" Michael Haigh, managing director and global head of commodities research at Société Générale, told BI.\n\"There was mention of a 15% tariff on refined copper from 2027 and 30% from 2028, but the markets will ignore that as this is speculation, subject to change,\" he added.\n\"If these are taken seriously, the spread between LME and COMEX may not fully converge as we move closer to that time,\" Haigh added."
    },
    {
      "url": "https://markets.businessinsider.com/news/stocks/european-defense-stocks-surge-bae-systems-rheinmetall-donald-trump-2025-2?utm_medium=referral&utm_source=yahoo.com",
      "text": "- Defense stocks are surging on expectations that European defense spending may increase.\n- The Trump administration has signalled its desire to pull back from providing funding for Ukraine.\n- There is \"seemingly more urgency now to increase defense spending,\" Deutsche Bank analysts said.\nEuropean defense stocks are surging as investors bet on increased military spending amid uncertainty over the future of the war in Ukraine and pressure from the Trump administration.\nShares in London-based aerospace, defense, and information security firm BAE Systems jumped 7% as of around 1:30 p.m. UK time (8:30 a.m. ET).\nIn Germany, security technology company Rheinmetall soared over 8%. Shares in French firm Thales, which manufactures military equipment including drones were up almost 5%. Italy's Leonardo, one of the manufacturers of the Eurofighter Typhoon jet, also saw shares climb 6% Monday.\nThe rally follows a number of interventions from senior figures in the Trump administration regarding defense spending in Europe, and President Donald Trump's announcement last week that he would seek to meet Russian President Vladimir Putin to discuss Ukraine.\nTrump has long pledged to bring the conflict to an end as president, with concerns in Europe growing in recent days that the US could withdraw financial support for Ukraine.\nPete Hegseth, Trump's newly appointed defense secretary, said last week that the US was no longer \"primarily focused\" on Europe's security. He added that going forward Europe \"must provide the overwhelming share of future lethal and nonlethal aid to Ukraine.\"\nHe asked NATO members to increase their defense spending from 2% of GDP to 5%.\nEuropean leaders are set to hold an emergency summit on Ukraine on Monday, with British Prime Minister Keir Starmer saying earlier in the day that he was willing to send troops to Ukraine.\n\"There is seemingly more urgency now to increase defense spending and this is something European leaders seem to be coalescing around to some degree,\" analysts at Deutsche Bank said in a note.\n\"In terms of European geopolitics it's been a huge last few days with potentially large ramifications ahead,\" the note said.\nAccording to research published by McKinsey last week, since 2014, NATO members have spent an average of 1.6% of their GDPs on defense. Estonia and Latvia — which both border Russia — have announced that their target is to spend 5%, and Poland wants to reach 4.7% in 2025.\n\"Several European countries have announced an increase in defense budgets for FY24 and onwards,\" Bank of America analysts said in a report published on Monday.\n\"We believe that the Republicans winning the House & Senate as well as Trump's election will likely accelerate and reinforce the commitment of NATO members to spend at least 2% of GDP in defense,\" they said.\nUS Secretary of State Marco Rubio will meet Russian officials this week in Saudi Arabia to discuss the war in Ukraine. European leaders and Ukrainian President Volodymyr Zelenskyy have said they were not invited to the talks.\nAt the same time, Trump told reporters on Sunday that although no specific date is set, he could meet Putin \"very soon.\" The pair held what Trump called a \"lengthy and highly productive\" phone call last week."
    },
    {
      "url": "https://www.businessinsider.com/ai-data-center-development-true-cost-environmental-impact-2025-6?utm_medium=referral&utm_source=yahoo.com",
      "text": "Business Insider's \"The True Cost of Data Centers\" series explores the impacts — on water, power, pollution, and local economies — of Big Tech's race to dominate a future built on AI.\nThe AI boom has sparked a rush to build data center infrastructure across the US. By Business Insider's count, companies had filed permits to build 311 data centers nationwide as of 2010. By the end of 2024, that number had nearly quadrupled to 1,240.\nThese data centers are extremely resource-intensive; the largest can consume as much power as a city and up to several million gallons of water a day. Collectively, BI estimates, US data centers could soon consume more electricity than Poland, with a population of 36.6 million, used in 2023. Federal estimates expect data cennter power demand to as much as triple over the next three years.\nThis surging electricity demand is driving utilities to torpedo renewable energy goals and rely on fossil fuels, pushing data centers' air-pollution-related estimated public health costs to between $5.7 billion and $9.2 billion annually. Despite the centers' enormous water needs, tech companies have located 40% of them in areas with high water scarcity. Cities and states give away millions in tax breaks to build data centers, with relatively few full-time jobs promised in return — and locals are left living next to industrial complexes that operate 24/7.\nMuch of the public conversation today focuses on the promise of AI. Business Insider's \"The True Cost of Data Centers\" found that its impacts are already here."
    },
    {
      "url": "https://www.businessinsider.com/europe-boosting-defense-spending-ukraine-rearm-plan-trump-zelenskyy-2025-3?utm_medium=referral&utm_source=yahoo.com",
      "text": "- The European Union announced plans to boost defense spending amid rising security concerns on the continent.\n- The plan follows reports that President Donald Trump has paused US military aid to Ukraine.\n- The EU strategy includes loans and spending flexibility, but doesn't mention production capacity issues.\nThe European Union unveiled a plan on Tuesday to boost member states' defense spending amid an \"era of rearmament.\"\nThe ReArm Europe plan could unlock 800 billion euros (about $840 billion) in funds, said European Commission president Ursula von der Leyen.\nThe announcement followed reports late Monday that President Donald Trump had ordered a pause in US military aid to Ukraine after a fiery Oval Office meeting with President Volodymyr Zelenskyy.\nEuropean leaders met in London on Sunday for an emergency summit on Ukraine. Many defense commentators believe it will be difficult for European states to fill the US-sized gap in military support.\nThe EU plan focuses on ways to help member states unlock funding for defense spending, for both the \"immediate\" defense of Ukraine and in the long term, von der Leyen said.\nThey include suspending the Excessive Deficit Procedure — a mechanism that normally prevents member states from going into major deficits.\nLow-cost loans worth 150 billion euros will be available to let governments \"pool demand\" and jointly purchase air and missile defense and artillery systems, missiles and ammunition drones and anti-drone systems, as well as cyber capabilities.\n\"The question is no longer whether Europe's security is threatened in a very real way, or whether Europe should shoulder more of the responsibility for its own security,\" von der Leyen said. \"In truth, we have long known the answers to those questions.\"\nThe plans did not address the EU's defense production capacity, or the question of seizing frozen Russian assets worth more than $200 billion. Some European leaders are warming to the idea to help defend Ukraine."
    }
  ],
  "argos_summary": "European defence spending is surging, driving a 6% rise in industrial metals demand by 2027, especially copper, which is used in military systems and AI data centres. This boom has lifted defence stocks, with the MSCI Europe Aerospace and Defence Index up 72% this year, and prompted analysts to project higher copper prices, though recent tariff changes by the U.S. have temporarily flooded the market with excess inventory and caused a sharp drop in COMEX futures. Meanwhile, the EU’s ReArm Europe plan aims to unlock €800 billion in defence funding amid concerns over U.S. aid to Ukraine, while the U.S. Trump administration’s tariff exemption and calls for NATO members to raise defence budgets add further uncertainty to the market.",
  "argos_id": "87FRO5GVJ"
}