{
  "url": "https://finance.yahoo.com/news/xpeng-launches-global-ota-5-033100857.html",
  "authorsByline": "Xmotors Limited",
  "articleId": "65f38e67bcf7492c8ef0b58c2f4e97fa",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://s.yimg.com/ny/api/res/1.2/ey6.j2gyRobWHuL.fqJOiQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzQ7Y2Y9d2VicA--/https://media.zenfs.com/en/globenewswire.com/a88c6b98af11bac13cc24256f55f455c",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-25T03:31:00+00:00",
  "addDate": "2025-08-25T03:40:15.749755+00:00",
  "refreshDate": "2025-08-25T03:40:15.749756+00:00",
  "score": 1.0,
  "title": "XPENG Launches Global OTA 5.8.0 Update: Delivering Refined Experiences for Diverse User Demands",
  "description": "GUANGZHOU, China, Aug. 25, 2025 (GLOBE NEWSWIRE) -- XPENG Motors (\"XPENG\" or the \"Company\"; NYSE: XPEV, HKEX: 9868), a leading China-based high-tech company, announced that starting August 25, it will roll out the global OTA upgrade of XOS 5.8.0. This update is far more than a routine enhancement, it represents a thoughtfully localized, insight-driven integration of XPENG's core strengths in intelligent driving and smart cabin technologies, delivering a truly elevated experience for our users wo",
  "content": "GUANGZHOU, China, Aug. 25, 2025 (GLOBE NEWSWIRE) -- XPENG Motors (\"XPENG\" or the \"Company\"; NYSE: XPEV, HKEX: 9868), a leading China-based high-tech company, announced that starting August 25, it will roll out the global OTA upgrade of XOS 5.8.0.\n\nThis update is far more than a routine enhancement, it represents a thoughtfully localized, insight-driven integration of XPENG's core strengths in intelligent driving and smart cabin technologies, delivering a truly elevated experience for our users worldwide.\n\nBuilding on a legacy of intelligent innovation, XPENG remains dedicated to placing user experience at the heart of its operations. With XOS 5.8.0, the third major OTA release of 2025 following the widely acclaimed versions XOS 5.4.5 in January and XOS 5.6.0 in May. Each of these releases raised application standards in safety, personalization, and driving assistance.\n\nThe XOS 5.8.0 OTA upgrade powerfully demonstrates XPENG's promise: to listen closely to user feedback and respond quickly to market expectations. As XPENG continues to expand the suite of intelligent features, XPENG is pioneering new pathways for the global electric vehicle industry.\n\nWith XOS 5.8.0, XPENG becomes the first and only automaker in Europe to offer standard Human-Machine Co-Driving.\n\nWhen Lane Centering Control (LCC) is active, the system now shares control with the driver. Rather than disengaging when the driver steers, LCC remains active, resulting in smoother, more natural driving assistance. LCC also demonstrates improved performance in complex scenarios such as highway merges and exits, with reduced steering oscillation.\n\nApart from that, Adaptive Cruise Control (ACC) has been significantly enhanced for higher cornering speeds and more comfortable deceleration.\n\nDesigned for pet-loving families, the new Pet Mode, ensures safety and comfort when pets are left unattended briefly. Windows close automatically, doors lock, and the climate system maintains a comfortable temperature and air circulation.\n\nThe AUTO Climate Control Mode with external air circulation prevents overheating or excessive cold. Owners will receive real-time alerts via the XPENG app and can remotely activate or deactivate the mode. This feature enhances safety for users who need to briefly leave their pets in the car.\n\nThis OTA upgrade brings the new KaraFun feature. Users can simply download KaraFun from the in-car App Store to start enjoying it.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "XPENG",
      "weight": 0.08902246
    },
    {
      "name": "XPENG Motors",
      "weight": 0.08780907
    },
    {
      "name": "user experience",
      "weight": 0.080485746
    },
    {
      "name": "user feedback",
      "weight": 0.07400868
    },
    {
      "name": "Diverse User Demands",
      "weight": 0.07018751
    },
    {
      "name": "Users",
      "weight": 0.06920189
    },
    {
      "name": "users",
      "weight": 0.06920189
    },
    {
      "name": "intelligent features",
      "weight": 0.06685332
    },
    {
      "name": "external air circulation",
      "weight": 0.06340992
    },
    {
      "name": "driving assistance",
      "weight": 0.063084535
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    },
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.84619140625
    },
    {
      "name": "/News/Technology News",
      "score": 0.72705078125
    },
    {
      "name": "/Business & Industrial/Automotive Industry",
      "score": 0.4345703125
    }
  ],
  "sentiment": {
    "positive": 0.750117,
    "negative": 0.02813533,
    "neutral": 0.22174771
  },
  "summary": "XOS 5.8.0.0 is being introduced as a global OTA upgrade of the car by China-based high-tech company XPENG Motors, a leading manufacturer of intelligent driving and smart cabin technologies. The company is committed to delivering refined experiences for diverse and diverse users. The update includes the addition of a new Pet Mode feature for pets, which ensures safety and comfort when pets are left unattended briefly, and the improved Adaptive Cruise Control (ACC) has been significantly enhanced for higher cornering speeds and more comfortable deceleration. With this update, XPENG becomes the first and only automaker in Europe to offer standard Human-Machine Co-Driving.",
  "shortSummary": "XOS 5.8.0 is launching globally, featuring enhanced driver-controlled vehicles, enhanced climate control, and new features for pet owners and commuters.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "fea9b2130da94315908a27ec3c34079c",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "XPENG Motors has launched its global OTA upgrade XOS 5.8.0, the third major release of 2025, adding a range of new intelligent features such as the first standard Human‑Machine Co‑Driving in Europe, enhanced lane‑centering and adaptive cruise control, and pet‑friendly safety modes. The update also introduces an AUTO Climate Control with external air circulation and real‑time alerts, as well as a new KaraFun entertainment app. XPENG emphasizes user‑centric design and rapid response to feedback, positioning the upgrade as a significant step forward in its intelligent driving and smart cabin technologies.",
  "argos_id": "88ONKXKJ2"
}