{
  "url": "https://www.bloomberg.com/news/videos/2025-08-20/balance-of-power-late-edition-8-19-2025-video?srnd=phx-technology",
  "authorsByline": "bn",
  "articleId": "4ea21978c9794d448d1d0b00509867b5",
  "source": {
    "domain": "bloomberg.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iKsVh8G9r6Cg/v3/-1x-1.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-20T00:06:50.075000+00:00",
  "addDate": "2025-08-20T00:29:01.022595+00:00",
  "refreshDate": "2025-08-20T00:29:01.022598+00:00",
  "score": 1.0,
  "title": "US, Europe Start Work on Ukraine Security Plan",
  "description": "\"Balance of Power: Late Edition\" focuses on the intersection of politics and global business. On today's show, William Taylor, former US Ambassador to Ukraine, & Former US Ambassador to NATO, Kurt Volker, voice their thoughts on what security guarantees the US can give Ukraine. Adam Posen, President of the Peterson Institute for International Economics, discusses the global impacts of President Trump widening the metal tariffs to target additional consumer products. (Source: Bloomberg)",
  "content": "> > THIS IS \"BALANCE OF POWER\" LIVE FROM WASHINGTON DC. > > FROM BLOOMBERG'S WASHINGTON DC STUDIOS TO OUR TV AND RADIO AUDIENCES WORLDWIDE, WELCOME TO \"BALANCE OF POWER.\" ALONGSIDE TYLER KENDALL, I MET MICHAEL SHEPARD. TYLER: THE WHITE HOUSE RAMPING UP PRESSURE FOR A BILATERAL SUMMIT BETWEEN RUSSIAN PRESIDENT PUTIN AND UKRAINIAN PRESIDENT ZELENSKYY. MICHAEL: PRESIDENT TRUMP PUSHES FOR AN END TO THE WAR IN UKRAINE, DENYING ANY POTENTIAL ROLE OF THE U.S. MILITARY IN THE CONFLICT, AND LAYING OUT EXPECTATIONS FOR ZELENSKYY WHEN IT COMES TO RELINQUISHING TERRITORY TO RUSSIA. ALL THAT AND MORE WHEN WE SPEAK TO THE FORMER AMBASSADOR TO UKRAINE, WILLIAM TAYLOR, AHEAD. TYLER: PLUS, THE NEWS FROM THE WHITE HOUSE WHEN IT COMES TO INTEL. THE TREASURY SECRETARY SAYING THE GOVERNMENT IS IN TALKS TO ACQUIRE AN EQUITY STAKE IN THE COMPANY. MICHAEL: SLEEPING ON THE FLOOR OF THE TEXAS LEGISLATURE. > > I AM NOT FREE TO LEAVE. I'VE ASKED. THEY'VE LOCKED THE DOOR AND SAID I'M NOT PERMITTED TO LEAVE THIS FLOOR TONIGHT. SO I AM IN FOR TONIGHT, AND I AM NOT ALLOWED TO LEAVE. MY WILL IS JUST AS STRONG AS THEIRS. IT IS TIME THAT WE STAND UP TO THE BULLIES. MICHAEL: THAT IS THE STEP A DEMOCRATIC STATE LAWMAKER TOOK IN TEXAS IN PROTEST AFTER REFUSING REPUBLICAN DEMANDS FOR A LAW ENFORCEMENT ESCORT. THE REDISTRICTING FIGHT IN THE STATE ESCALATES FOLLOWING THE RETURN OF DEMOCRATS. BUT WE BEGIN TONIGHT WITH THE LATEST FROM THE WHITE HOUSE, AS WE GET WORD THAT THE PRESIDENT NOT ONLY CALLED PUTIN AFTER YESTERDAY'S SUMMIT WITH PRESIDENT ZELENSKYY, BUT HUNGARY'S VIKTOR ORBAN AS WELL. THE CALL CAME AT THE BEHEST OF EUROPEAN LEADERS AS TRUMP FIELDED QUESTIONS ON UKRAINE'S POTENTIAL MEMBERSHIP IN THE EU. TYLER: NEW REPORTING TONIGHT ON EUROPE'S PUSH FOR A PACKAGE OF SECURITY GUARANTEES FOR UKRAINE AS SOON AS THIS WEEK AS THE LEADERS TRAYS TO SEIZE ON PRESIDENT TRUMP'S BACKING. WENDY BENJAMINSON JOINS US LIVE FROM WORLD HEADQUARTERS IN NEW YORK. PEOPLE FAMILIAR WITH THE MATTER TELL US THIS PACKAGE OF SECURITY GUARANTEES COULD COME TOGETHER AS SOON AS THIS WEEK. WHAT DO WE KNOW ABOUT WHAT IS ACTUALLY BEING DISCUSSED HERE IN PRINCIPLE WHEN IT COMES TO THIS CRITICAL PART OF THESE NEGOTIATIONS? WENDY: THE SECURITY GUARANTEES WOULD BE WAYS TO PREVENT SOMETHING LIKE THIS FROM EVER HAPPENING AGAIN. AND WHILE U.K. AND FRENCH FORCES MAY INDEED BE ON THE GROUND IN UKRAINE IF THIS ALL WORKS OUT AS A PEACEKEEPING FORCE, PRESIDENT TRUMP HAS SAID THERE WILL BE NO AMERICAN BOOTS ON THE GROUND, BUT WE COULD PROVIDE TECHNICAL, LOGISTIC, INTELLIGENCE SUPPORT, THINGS LIKE THAT. THAT IS, OF COURSE, IF THIS ALL HAPPENS. TRUMP HAS SAID TODAY THAT HE'S SET UP THIS MEETING BETWEEN PUTIN AND ZELENSKYY. THE KREMLIN IS LIKE, WELL, WE ARE OPEN TO MAY BE TALKING, BUT WE DON'T KNOW IT'S GOING TO HAPPEN YET. IT IS ALL UP IN THE AIR HOW ALL THESE PIECES WILL COME TOGETHER, EVEN AS THE WHITE HOUSE PRESENTS IT AS A PACKAGE WRAPPED UP IN A NICE BOW. MICHAEL: WE ARE SEEING THE EUROPEAN LEADERS WHO WERE WITH TRUMP YESTERDAY IN WASHINGTON MOVING WITH SPEED TO TRY TO GET SOMETHING LOCKED IN ON SECURITY GUARANTEES. ARE THEY TRYING TO LOCK IN PRESIDENT TRUMP ON THIS? WENDY: THEY PROBABLY ARE. IT MAKES A LOT OF SENSE. TO SEE HOW MUCH DIFFERENT THE APPROACH IS THAT THE EUROPEAN LEADERS AND ZELENSKYY ARE TAKING TO DONALD TRUMP THAN THE EUROPEAN LEADERS DID IN HIS FIRST TERM. IF YOU REMEMBER THAT FAMOUS PITCH FROM ANGELA MERKEL WAVING HER FINGER AT TRUMP IN A G7 MEETING. THEY FLATTERED HIM, THEY CAME TO THE WHITE HOUSE, HE SAT BEHIND THE RESOLUTE DESK. ZELENSKYY WAS VERY GRACIOUS WITH DONALD TRUMP. AND IN RETURN, THEY GOT DONALD TRUMP BEING NICER AND MORE OBLIGING TO THEIR IDEAS. THESE ARE ALL THINGS THAT COULD BE IN THE WORKS, AND I THINK THE SECURITY GUARANTEES PROBABLY WILL HAPPEN. IT'S JUST A MATTER OF GETTING PUTIN TO THE TABLE AND SOMEHOW IN A FACE-TO-FACE MEETING WITH PUTIN AND ZELENSKYY THESE TWO WORKING OUT A PEACE DEAL, WHICH MAY HAPPEN. IT SEEMS A LITTLE FAR-FETCHED, AS RUSSIA CONTINUES TO BOMB UKRAINE EVEN TODAY. TYLER: WENDY BENJAMINSON, WE THANK YOU FOR YOUR COVERAGE. JOINING US FOR MORE INSIGHT ON WHAT IS NEXT WHEN IT COMES TO THIS ONGOING CONFLICT IS WILLIAM TAYLOR, THE FORMER U.S. AMBASSADOR TO UKRAINE, AND FORMER CHURCH TO AFFAIRS UNDER THE FIRST TRUMP ADMINISTRATION. -- CHARGE TO AFFAIRS UNDER THE FIRST TRUMP ADMINISTRATION. WE KNOW TODAY THERE WAS A GATHERING OF EUROPEAN LEADERS AND PEOPLE FAMILIAR. TELL US AT BLOOMBERG NEWS THAT THEY FOCUSED ON A PLAN TO SEND BRITISH AND FRENCH TROOPS TO UKRAINE AS PART OF ANY POTENTIAL PEACE DEAL. I WOULD LOVE TO GET YOUR INSIGHT ON WHAT IS REALISTIC TO EXPECT FROM THE U.S. WHEN IT COMES TO SECURITY GUARANTEES, AND WILL IT BE ENOUGH TO DETER VLADIMIR PUTIN? WILLIAM: THE ANSWER TO THE LAST QUESTION IS YES. WHAT CAN THE AMERICANS BRING TO THIS COALITION? IT IS ABOUT 30 NATIONS. THE COALITION OF THE WILLING IS PRETTY BROAD AND HAS PRETTY MUCH ECONOMIC POWER AND PROBABLY A FAIR AMOUNT OF MILITARY POWER, BUT THERE ARE SOME THINGS THE AMERICANS CAN PROVIDE THAT MOST OF THE EUROPEANS DON'T HAVE. PRESIDENT TRUMP MENTIONED ONE OF THEM, AIR COVER. U.S. AIR CAPABILITIES ARE MASSIVE. THAT CAN BE BROUGHT TO BEAR, AND YOU DON'T NEED TO HAVE AMERICAN BOOTS ON THE GROUND, YOU DON'T NEED AMERICAN SOLDIERS OR AIRMEN ON THE GROUND TO PROVIDE THAT KIND OF AIR SUPPORT AND AIR COVER, USING THE U.S. AIR FORCE. THEY CAN FLY OUT OF POLAND OR ROMANIA OR GERMANY. INDEED, WE HAVE SEEN THEY CAN FLY OUT OF THE UNITED STATES. THERE IS A LOT WE CAN BRING TO BEAR, AMERICANS, TO CONTRIBUTE TO THE COALITION OF THE WILLING THAT THE BRITS AND THE FRENCH ARE LEADING, THAT DON'T REQUIRE -- THIS STUFF DOESN'T REQUIRE BOOTS ON THE GROUND. MICHAEL: AMBASSADOR TAYLOR, ANOTHER SENSITIVE QUESTION. THIS IS LAND. FOLLOWING YESTERDAY'S MEETING, THE GERMAN CHANCELLOR DISCUSSED THE POSSIBILITY OF UKRAINE CEDING TERRITORY AS PART OF A PEACE DEAL. LET'S HAVE A QUICK LISTEN. > > THE ONE ASPECT WHICH HAS NOT BEEN DISCUSSED TODAY IS THAT UKRAINE SHOULD NOT BE FORCED TO CEDE ANY TERRITORIES. RUSSIA'S DEMAND THAT KYIV GIVE UP THE DONBAS REGION IS COMPARABLE TO A PROPOSAL THAT THE U.S. GIVE UP FLORIDA. MICHAEL: AMBASSADOR TAYLOR, WE ARE HEARING A DIFFERENT TUNE FROM DONALD TRUMP AND VLADIMIR PUTIN WHEN IT COMES TO LAND, AT LEAST FROM FREDDIE MCMURRAY'S. WHAT ADVICE WOULD YOU GIVE TO ZELENSKYY WHEN IT COMES TO THIS QUESTION OF TERRITORY? SHOULD HE MAKE CONCESSIONS? WILLIAM: NO. PUTIN WANTS THAT. AND PUTIN PROBABLY PUT THAT IN DONALD TRUMP'S EAR IN ANCHORAGE LAST WEEK, BUT PRESIDENT TRUMP JUST BROUGHT THOSE IDEAS BACK. I DON'T THINK HE'S FIGURED OUT YET WHAT PRESIDENT TRUMP WOULD RECOMMEND. IN TERMS OF RECOMMENDING TO PRESIDENT ZELENSKYY, NO ONE NEEDS TO DO THAT, HE KNOWS EXACTLY WHAT HE NEEDS TO DO, AND IT IS OF A PIEACE. IT IS PERFECTLY CONSISTENT WITH WHAT UKRAINIANS WANT. THAT IS, THEY WANT THE END OF THE WAR. THEY ARE TIRED. THEY HAVE BEEN FIGHTING FOR 3.5 YEARS, 1273 DAYS. THEY WANT IT TO END. BUT THEY DO NOT WANT TO GIVE UP TERRITORY. THERE IS A KEY DISTINCTION HERE. THE UKRAINIANS BEGRUDGINGLY ACCEPT THAT THE RUSSIANS ARE IN 19% OF THEIR COUNTRY. THE UKRAINIANS GRUDGINGLY ACCEPT THAT THE UKRAINIANS WILL NOT PUSH THE RUSSIANS OUT OF THAT 19% MILITARILY ANYTIME SOON. EVEN THOUGH THEY ARE NOT WILLING TO GIVE UP TERRITORY AND GIVE UP A LEGAL CLAIM, THEY ARE WILLING TO ACKNOWLEDGE THAT THE RUSSIANS ARE THERE. THAT IS A BIG DIFFERENCE. PRESIDENT ZELENSKYY WILL MAKE THAT EXACTLY THAT POINT, AND THAT IS WHAT THE GERMAN CHANCELLOR IS TALKING ABOUT AS WELL. THE REASON IT WAS NOT TALKED ABOUT YESTERDAY WAS BECAUSE THEY WILL NOT TELL ZELENSKYY TO GIVE UP TERRITORY. THE FLORIDA ANALOGY IS A GOOD ONE. PUTIN MAY WANT IT, BUT THE EUROPEANS DON'T, AND WE SHOULDN'T. TYLER: SOMETHING ELSE UKRAINE WANTS IS MEMBERSHIP WHEN IT COMES TO THE EUROPEAN UNION. WE MENTIONED AT THE TOP OF THE SHOW THAT PRESIDENT TRUMP HELD A PHONE CALL WITH VIKTOR ORBAN ABOUT WHY THE HUNGARIAN PRIME MINISTER IS TRYING TO BLOCK UKRAINE FROM JOINING THAT POLITICAL AND ECONOMIC BLOCK AS WELL. DO YOU SEE A VIABLE PATH FOR UKRAINE WHEN IT COMES TO EU MEMBERSHIP, IF ALLIES HAVE SAID THAT NATO MEMBERSHIP FOR EXAMPLE WILL BE OFF THE TABLE? WILLIAM: FIRST, NATO MEMBERSHIP IS NOT OFF THE TABLE. IT MAY BE OFF THE TABLE TODAY, BUT NOT OFF THE TABLE. ASK MOST EUROPEANS IF IT'S STILL VIABLE, AND THEY SAY YES IT SHOULD HAPPEN AT SOME POINT. BUT THERE ARE SOME EUROPEANS AND SOME AMERICANS WHO WOULD SAY IT'S NOT ON THE TABLE RIGHT NOW. ON EU, THAT TRAIN IS ON THE WAY. THAT SHIP IS SAILING. THE UKRAINIANS ARE WELL ON THE WAY TO THE EU. I WOULD BE INTERESTED TO KNOW WHAT THE CONVERSATION WAS BETWEEN TRUMP AND ORMONDE -- AND ORBAN. ORBAN HAS BEEN A THORN IN THE SIDE OF THE UKRAINIANS, BUT THE EU IS THE RIGHT DESTINATION FOR UKRAINE. THEY ARE WORKING ON IT. THERE IS A LOT OF WORK AND YOU KNOW VERY WELL WHAT IT TAKES TO GET INTO THE EU, BUT THE UKRAINIANS ARE WORKING ON IT HARD. MOST EUROPEANS WITH THE POSSIBLE EXCEPTION OF MR. ORBAN ARE FULLY SUPPORTIVE. THE UKRAINIANS HAVE A BIG STAKE, AND THE EUROPEANS HAVE A BIG STAKE. I THINK THAT TRAIN IS MOVING. MICHAEL: MESSER TAYLOR, -- AMBASSADOR TAYLOR, WHAT DO YOU SEE HAPPENING IN TERMS OF THIS BILATERAL MEETING BETWEEN PUTIN AND ZELENSKYY? DO YOU SEE IT ACTUALLY HAPPENING? WILL PUTIN ACCEPT THIS IDEA? IS IT A GOOD IDEA FOR THEM TO MEET WITHOUT A THIRD PARTY AS PERHAPS A CHAPERONE? WILLIAM: ON YOUR FIRST QUESTION, PUTIN DOES NOT WANT TO END THIS WAR, HE WANTS TO KEEP POUNDING THE UKRAINIANS UNTIL THEY GIVE UP. THEY WILL NEVER GIVE UP, BUT HE WILL KEEP POUNDING UNTIL HE'S FORCED TO COME TO THE TABLE FOR A CEASE-FIRE. NO, I DON'T THINK HE HAS ANY INTENTIONS OF COMING TO A BILATERAL MEETING. HE MAY SAY SOMETHING ON THE PHONE TO PRESIDENT TRUMP, TO TELL HIM THAT HE'S WILLING TO DO IT, BUT THE OFFICIAL STORY OUT OF MOSCOW IS THAT THEY WILL UP THE LEVEL OF THEIR DELEGATION TO THESE TALKS. RIGHT NOW THE DELEGATION IS VERY LOW, DEPUTY MINISTER OF CULTURE. THEY ARE NOT SERIOUS ABOUT THESE NEGOTIATIONS. PUTIN WANTS ALL OF UKRAINE. HE WANTS TO POUND THEM UNTIL HE GETS THAT. MICHAEL: WILLIAM TAYLOR, FORMER U.S. AMBASSADOR TO UKRAINE. THANK YOU. COMING UP, THE POTENTIAL NEXT STEPS FOR THE WAR IN UKRAINE WITH FORMER SPECIAL U.S. REP IS FOR UKRAINE NEGOTIATIONS IN THE FIRST TRUMP ADMINISTRATION, UP AHEAD. BUT FIRST, HOW PRESIDENT TRUMP'S TURF POLICY IS IMPACTING THE GLOBAL ECONOMY. WE DISCUSSED THAT WITH ADAM POSEN \"BALANCE OF POWER\" -- WE DISCUSS THAT WITH ADAM POSEN ON \"BALANCE OF POWER\" NEXT ON BLOOMBERG TV AND RADIO. ♪ > > I THINK CHAIR POWELL IS IN A TOUGH SPOT GOING INTO FRIDAY BECAUSE WE HAVE A LONG WAY TO GO UNTIL WE HAVE THAT SEPTEMBER MEETING. ON TOP OF THAT, HE HAS THE POLITICAL PRESSURE ON THE BACK OF HIS NECK HE'S BEEN DEALING WITH FOR SOME TIME, SO HE CANNOT LEAN ONE WAY OR ANOTHER. > > WE ARE SEEING THE CULMINATION OF THE CONSUMER SETTLING IN, RATES STABILIZING, AND PEOPLE REALIZING WE MAY BE CLOSE TO THE BOTTOM. > > THE BIG-BOX RETAILERS, THOSE THAT HAVE THE CAPABILITY BROUGHT A LOT OF INVENTORY. GOING THROUGH THAT LEVEL OF INVENTORY HAS NOT YIELDED THE PATH THROUGH TO CONSUMERS THAT SOME HAVE SEEN, BUT IT WILL COME. MICHAEL: SOME VOICES TODAY ON BLOOMBERG SURVEILLANCE, DISCUSSING THE TEMPERAMENTAL STATE OF THE U.S. ECONOMY, EVEN AFTER SOLID EARNINGS FROM A MAJOR RETAILER, S -- A ROUT IN TECH STOCKS AND GAINS ACROSS THE INDEXES. WE TURN TO POWER MOVES WITH BLOOMBERG'S ROMAINE BOSTICK, WHO JOINS US LIVE FROM WORLD HEADQUARTERS IN NEW YORK. OTHER THAN INTEL AND ITS GAINS ON THE DAY, WE DID NOT SEE MUCH LOVE ACROSS THE TECH SECTOR. ROMAINE: NO, TECH WAS THE BIG LAGGARD, WHICH IS A RARITY OF LATE. WHEN YOU LOOK AT THE BIG GAINS THIS MARKET IS MADE OFF THOSE APRIL LOWS AND ON A YEAR-TO-DATE BASIS, IT HAS BEEN ABOUT BIG TECH AND IT HAS BEEN ALL ABOUT NVIDIA. THAT STOCK HAS BEEN ON A TEAR. TODAY IT WAS ONEWHEN YOU LOOK AT THE OF THE BIGGEST LAGGARDS ON A PERCENTAGE BASIS, BUT MORE IMPORTANTLY ON ITS CONTRIBUTION TO THE MARKET. THIS COMES AHEAD OF ITS EARNINGS REPORT A WEEK FROM TOMORROW. NVIDIA DROPPING BELOW SOME OF ITS KEY MOVING AVERAGES, PARTICULARLY SHORT-TERM MOVING AVERAGES. THIS IS A STOCK THAT HAS BEEN FUELED NOT JUST BY ITS CORPORATE FUNDAMENTALS, BUT MOMENTUM IN THIS MARKET. IF THE MOMENTUM TURNS, THAT COULD SPELL BAD NEWS FOR NVIDIA AND FOR THE BROADER MARKET. NOT ALL TECH WAS LOWER ON THE DAY. ONE OF THE FEW BRIGHT SPOTS -- AND GET THIS, UNTIL. UNTIL -- GET THIS, INTEL. INTEL IS THE BEST PERFORMING STOCK IN THE S & P 500 NOT JUST FOR TODAY, BUT THE MONTH OF AUGUST SO FAR. INTEL HAS BEEN ONE OF THE BIGGEST LAGGARDS OVER ALL, A LOT OF CONCERNS ABOUT ITS FUTURE AND ITS CEO, BUT A BIG RATIFICATION OF ITS STRATEGY AND ITS FUTURE WHEN SOFTBANK, A BEHEMOTH FUND, SAID IT WOULD COMMIT A $2 BILLION INVESTMENT TO THE COMPANY. ALSO WORDS FROM THE TRUMP ADMINISTRATION CONFIRMING A POTENTIAL STAKE IN THAT COMPANY BY THE UNITED STATES GOVERNMENT, ALL PROVIDING A BIG LIFT TO THE STOCK. YOU CAN SEE THE SHARES RALLY IN MORE THAN 6% ON THE DAY. TYLER: AS WE HEARD AT THE TOP OF THE SEGMENT, TRADERS ARE GETTING READY AHEAD OF FRIDAY WHEN FED CHAIR POWELL WILL GIVE HIS ANNUAL REMARKS AT THE KANSAS CITY FED'S ECONOMIC SYMPOSIUM. WHAT HAS BEEN THE TREASURY MARKET REACTION AS WE WAIT FOR ANY CLUES ABOUT A SEPTEMBER RATE CUT? ROMAINE: THE REACTION IS THEY ARE CUTTING. YOU REMEMBER THE OLD CAMPAIGNS, DRILL, BABY, DRILL. IT IS CUT, BABY, CUT. EVERY TRADER RIGHT NOW IS BETTING THE FED WILL CUT RATES BEFORE THE YEAR IS OUT. THE JACKSON HOLE SPEECH BY JAY POWELL ON FRIDAY WILL BE KEY. THIS WILL BE HIS LAST BIG OPPORTUNITY TO COMMUNICATE, IF HE CHOOSES, WHAT THE FED MIGHT DO NEXT AHEAD OF THAT SEPTEMBER MEETING. THERE IS A RISK. JAY POWELL IS NOT ALWAYS FORTHCOMING ABOUT WHAT THE FED MIGHT DO. HE COULD GO INTO THAT SPEECH ON FRIDAY, RATIFY THAT THE MARKET WILL CUT RATES. HE COULD ALSO THROW COLD WATER ON THAT, CITING INFLATION DATA THAT IS STILL STICKY. OR HE MIGHT DO WHAT HE NORMALLY DOES, DODGE THE QUESTION ALTOGETHER. TYLER: A LOT TO LOOK OUT FOR. [LAUGHTER] BLOOMBERG'S ROMAINE BOSTICK, WE THANK YOU AS ALWAYS FOR YOUR COVERAGE. JOINING US IN OUR WASHINGTON BUREAU FOR A BIGGER LOOK AT THIS , THE LARGER GLOBAL ECONOMIC IMPACTS OF PRESIDENT TRUMP'S TARIFFS, IMPACTING HOW THE FED IS INFORMING ITS MONETARY POLICY, IS ADAM POSEN, PRESIDENT OF THE PETERSON INSTITUTE FOR INTERNATIONAL ECONOMICS. I WANT TO ZONE IN ON TARIFFS, INCLUDING BIG NEWS WE GOT TODAY WITH PRESIDENT TRUMP STUNNING THE LOGISTICS INDUSTRY. HE WIDENED HIS STEEL AND ALUMINUM TARIFFS TO SOME 400 CONSUMER PRODUCTS, THINGS LIKE MOTORCYCLES AND TABLEWARE. FROM YOUR PERSPECTIVE, HOW DOES THIS DEMONSTRATE HOW WIDE REACHING HIS TARIFF POLICIES ARE, WHEN YOU THINK OF THESE TARIFFS IN PARTICULAR BEING ENACTED UNDER SECTION 232 ON THE BASIS OF NATIONAL SECURITY CONCERNS? ADAM: YOU ARE RIGHT, THERE IS A BIGGER PICTURE. DIRECTLY THIS WILL CONTRIBUTE TO INFLATION AND MAKE THINGS MORE EXPENSIVE FOR OTHER BUSINESSES AND CONSUMERS. IF IT DOES NOT PASS THROUGH TO INFLATION, IT WILL DRAW DOWN PROFITS AND MARGINS FOR THE COMPANIES. THE BIGGER PICTURE IS ONE OF GOVERNANCE PROBLEMS. THE PRESIDENT HAS DECLARED EMERGENCIES. THE EMERGENCIES DON'T NECESSARILY TIED TO WHAT THE LAW SAYS. THERE'S NO WAY THAT STEEL FLATWARE IS A NATIONAL SECURITY ISSUE, EVEN IF A MILLION CHINESE PICKED UP STEEL KNIVES, IT WOULD NOT BE A. NATIONALSECURITY ISSUE AS THE LAW READS CONGRESS ABDICATED WHAT SHOULD BE A FUNDAMENTAL RIGHT TO SET POLICY. AND BECAUSE HE'S NOT DOING IT THROUGH CONGRESSIONAL HEARINGS, IT IS UNCERTAIN. YOUR COLLEAGUE WAS TALKING ABOUT INTEL. IT SHOULD NOT BE A MATTER OF DAY TO DAY WHETHER A PRESIDENT SAYS THIS IS A GOOD STOCK TO BUY, LIKE HE DID ABOUT VARIOUS COMPANIES, INCLUDING TESLA. IT SHOULD NOT BE THE U.S. GOVERNMENT SAYING THAT. BUT FINALLY INTERNATIONALLY, THERE IS NO ENDGAME HERE. HE HAS BASICALLY TOLD A BUNCH OF COUNTRIES, NOT JUST CHINA, THAT IN THE END HE WILL SET TARIFFS WHATEVER THEY WILL BE, IF YOU RETALIATE, WE WILL ESCALATE, AND I CAN CHANGE THEM AT ANY TIME. AT THAT POINT, IN A WAY THAT WAS NOT TRUE UNDER TRUMP ONE OR BIDEN, I THINK INVESTORS START THROWING UP THEIR HANDS. MICHAEL: WE SEE THE TARIFFS, AND YOU BROUGHT UP INTEL AS A LARGER PIECE OF THIS TRUMP SHIFT WHEN IT COMES TO THE GLOBAL ECONOMY. THAT'S SOMETHING YOU ADDRESSED IN A PIECE EARLIER THIS WEEK. CAN YOU TALK ABOUT WHAT THE CONSEQUENCES ARE GOING TO BE OF THIS REWRITING OF THE GLOBAL ECONOMIC PARADIGM LED BY DONALD TRUMP? ADAM: I APPRECIATE YOUR MENTIONING THAT. IT CAME OUT TODAY IN FOREIGN AFFAIRS, A PIECE CALLED \"THE NEW ECONOMIC GEOGRAPHY.\" WHEN WE FOCUS NARROWLY ON TARIFFS OR ON BILATERAL TRADE BALANCES, AS THE TRUMP -- AS THE TRUMP ADMINISTRATION DOES, YOU DON'T SEE THE FULL PICTURE. THE U.S. WAS BASICALLY THE INSURANCE PROVIDER TO FOREIGN GOVERNMENTS,, EVEN CHINA BUT ESPECIALLY OUR ALLIES. IN TERMS OF SHIPPING DEFENSE AND GETTING MONEY IN AND OUT OF DOLLARS, IN TERMS OF ENFORCING LAWS, IN TERMS OF INTELLECTUAL PROPERTY AND STANDARDS, ALL THESE THINGS. THE U.S. GOVERNMENT COLLECTED PREMIUM FOR THIS. WE HAD LOWER INTEREST RATES. WE HAD MORE THAN OUR FAIR SHARE OF INVESTMENT. WE HAD MORE INFLUENCE THAN ANY OTHER COUNTRIES IN SETTING STANDARDS. THE TRUMP PEOPLE HAVE DECIDED, NO, WE WERE GETTING RIPPED OFF, WE WILL JUST PUSH HARD AND MOVE FROM BEING AN INSURER TO BEING AN EXTRACTOR. WE WILL CRUNCH DOWN WHAT COVERAGE WE OFFER, WE WILL MASSIVELY INCREASE THE PREMIUM AND KEEP CHARGING UNTIL WE CANNOT GET ANY MORE OUT. PEOPLE LIKE SECRETARY BESSENT WILL SAY THIS IS JUST A REBALANCING. IF THEY ACCEPT THE INSURANCE ANALOGY, THEY ARE JUST REPHRASING IT. MY VIEW IS PEOPLE WILL CHOOSE TO SELF-INSURE, NOT RELY ON THE U.S. SOME COUNTRIES LIKE JAPAN OR MEXICO HAVE NO CHOICE, BUT EVEN THERE THE INVESTORS WILL CHANGE. OTHER COUNTRIES THAT DO HAVE A CHOICE LIKE EAST ASIA OR PARTS OF EUROPE WILL SHIFT. WE ARE ALREADY SEEING THAT IN THE WEAKER DOLLAR AND HIGHER INTEREST RATES ON U.S. TREASURIES. WE ARE ALREADY SEEING THAT IN THESE INVESTMENT DECISIONS THAT COUNTRIES ARE MAKING. YOU GET THE BIG TICKET INTEL ANNOUNCEMENT, BUT THEN YOU DON'T SEE ALL THE THINGS WHERE CHINA OR EUROPE GETS THE OPPORTUNITIES IN INDONESIA OR TURKEY. TYLER: I WANT TO ZONE IN ON CHINA, BECAUSE THIS HAS BEEN A BIG FOCAL POINT OF THE ADMINISTRATION. WHAT IS THE NUMBER ONE PATH THE WHITE HOUSE COULD TAKE TO REMAIN COMPETITIVE WITH CHINA, BUT ALSO MAKE SURE HER ART -- MAKE SURE THERE ARE NOT THESE CONSEQUENT IS? ADAM: CHINA IN MY VIEW WILL BE THE LEAST AFFECTED, WHEREAS OUR ALLIES LIKE THE U.K. AND MEXICO THAT WILL BE WORSE. I HAVE ARGUED IN THE PAST THAT YOU WANT A SUCTION, NOT SANCTION APPROACH WITH CHINA. YOU TRY TO MAKE IT ATTRACTIVE FOR THINGS TO LEAVE CHINA, IDEAS, PEOPLE, INVESTMENT. THAT PUTS PRESSURE ON THE CHINESE REGIME AND IT BENEFITS US. INSTEAD OF TRYING TO BOTTLE THEM UP AND MAKE THEM MAD AT US. MICHAEL: ADAM POSEN, THANK YOU. COMING UP, A TEXAS DEMOCRAT OPTED TO SPEND THE NIGHT IN THE STATE LEGISLATURE RATHER THAN ALLOW A LAW ENFORCEMENT OFFICER TO SHADOW HER. WE WILL BRING YOU THE DETAILS IN THIS LATEST DEVELOPMENT IN THE STATE REDISTRICTING BATTLE. PRESIDENT HOPE IS HOPING TO FINALIZE A TRILATERAL MEETING WITH PUTIN AND ZELENSKYY. WE WILL DISCUSS THAT WITH KURT VOLKER. MICHAEL: THIS IS \"BALANCE OF POWER\" ON BLOOMBERG TV AND RADIO. WE WILL HAVE MORE ON PRESIDENT TRUMP'S EFFORT TO BROKER A PEACE DEAL BETWEEN RUSSIA AND UKRAINE, COMING UP, BUT FIRST THE OTHER STORIES WE ARE WATCHING IN TODAY'S POWER BRIEF. REPUBLICAN GOVERNORS FROM LOUISIANA, MISSISSIPPI, TENNESSEE, DR. LINE-UP, AND OHIO ALL PLEDGED TO SEND 1000 NATIONAL GUARD TROOPS TO PATROL WASHINGTON DC. THAT IS IN ADDITION TO THE 800 BC NATIONAL GUARD MEMBERS ALREADY DEPLOYED IN THE NATION'S CAPITAL. WHITE HOUSE PRESS SECRETARY KAROLINE LEAVITT DISCUSSED COORDINATION OF THE TROOPS EARLIER TODAY. > > THIS INTERAGENCY TEAM IS MEETING AND TALKING DAILY. THERE IS A MEETING TAKING PLACE RIGHT NOW IN THE WEST WING WITH MEMBERS OF THE INTERAGENCY TASK FORCE TO CONTINUE TO DISCUSS NOT JUST THE NATIONAL GUARD DEPLOYMENT, BUT HOW WE CAN CONTINUE TO REMOVE PUBLIC SAFETY THREATS OFF THE STREETS OF WASHINGTON. MICHAEL: THE SURGE COMES DESPITE JUSTICE DEPARTMENT DATA IN JANUARY SHOWING TOTAL VIOLENT CRIME IN WASHINGTON IS AT A 30 YEAR LOW. TYLER: PLUS, PRESIDENT TRUMP PLANS TO NAME MISSOURI ATTORNEY GENERAL ANDREW BAILEY TO SERVE AS CO-DEPUTY DIRECTOR OF THE FBI. IT IS CONSIDERED AN UNUSUAL APPOINTMENT THAT WILL PLACE HIM AT AN EQUAL RANK AS CURRENT FBI DEPUTY DIRECTOR DAN BUNCHING UP. THE NEWS WAS FIRST REPORTED BY FOX NEWS NEWS AND LATER CONFIRMED BY BONGINO AND FBI DIRECTOR KASH PATEL. BONGINO IS A FORMER RIGHT WING RADIO HOST WHO RECENTLY CLASHED WITH ATTORNEY GENERAL PAM BONDI OVER RELEASE OF THE EPSTEIN FILES, LEADING TO SPECULATION OVER HIS FUTURE TENURE AT THE AGENCY. MICHAEL: VISITORS TO THE U.S. ARRIVING ON STUDENT VISAS PLUNGE 28% IN JULY, THE BIGGEST MONTHLY DROP SO FAR THIS YEAR. THE DECLINES WERE MOST PRONOUNCED FROM ASIA, THE LARGEST INTERNATIONAL EDUCATION MARKET, AS THE TRUMP ADMINISTRATION'S IMMIGRATION POLICIES CREATED UNCERTAINTY FOR STUDENTS. U.S. UNIVERSITIES HAVE ALREADY WARNED THAT FIRST-TIME FOREIGN STUDENT ENROLLMENT ON CAMPUSES IS PROJECTED TO FALL BY ABOUT 30% THIS FALL, POTENTIALLY COSTING THE EDUCATION SECTOR $2.6 BILLION IN TUITION REVENUE. TYLER: YESTERDAY, EUROPEAN LEADERS GATHERED AT THE WHITE HOUSE FOR A HISTORIC MULTILATERAL MEETING. HEAR SOME OF WHAT THEY HAD TO SAY ABOUT THEIR HOPES TO END THE WAR IN UKRAINE. > > WE NEED TO STOP THIS WAR TO STOP RUSSIA, AND WE NEED SUPPORT FROM AMERICAN AND EUROPEAN PARTNERS. PRES. TRUMP: IF EVERYTHING WORKS OUT WELL TODAY, WE WILL HAVE A TRILAT. I THINK THERE WILL BE A RECENT -- WILL BE A DECENT CHANCE OF ENDING THE WAR. > > 30 COUNTRIES WORKING TOGETHER ON SECURITY GUARANTEES WILL NOW WORK WITH THE U.S. > > MY HOPE IS IN THE UNITED STATES DO THE MOST POSSIBLE, BECAUSE THAT WILL ALLOW US TO OLIVIER -- US TO ALLEVIATE THE BURDEN ON EUROPE. TYLER: FOR THE LATEST ON PRESIDENT TRUMP'S EFFORT TO END THE WAR IN UKRAINE FOLLOWING YESTERDAY'S IMPROMPTU WHITE HOUSE SUMMIT,WE TURN TO BLOOMBERG'S ERIC MARTIN LIVE IN OUR WASHINGTON BUREAU. GOOD TO SEE YOU. WE HAVE ALREADY GOTTEN SOME BREAKING NEWS IN THE LAST FEW MOMENTS. THE CHAIRMAN OF THE JOINT CHIEFS OF STAFF TELLS FOX NEWS HE WILL MEET WITH HIS EUROPEAN COUNTERPARTS, GERMANY, THE U.K., FRANCE, POTENTIALLY A SIGN OF MOVEMENT AS THE U.S. IS TRYING TO GET SOME SORT OF DEAL OVER THE FINISH LINE. PART OF THIS CONVERSATION WAS A BLOOMBERG NEWS SCOOP EARLIER YOU HAVE BEEN FOLLOWING. PEOPLE TELLING US PRESIDENT TRUMP HAD A PHONE CALL WITH VIKTOR ORBAN, THE HUNGARIAN PRIME MINISTER. WHAT DO WE KNOW ABOUT WHAT PRESIDENT TRUMP IS DOING UP TO THIS POINT TO GET MORE PROGRESS GOING TO GET UKRAINE THE SECURITY GUARANTEES IT IS ASKING FOR? > > FABULOUS SCOOP TODAY FROM OUR COLLEAGUES. AND JUST FASCINATING, THIS INFORMATION COMING OUT. FIRST WE HAD YESTERDAY THE SURPRISE. THEN CONFIRMED IT FROM THE WHITE HOUSE AND FROM SOURCES YESTERDAY AFTERNOON THAT TRUMP TOOK THIS EXTRAORDINARY BREAK FROM HIS MEETING WITH EUROPEAN LEADERS TO GO CALL VLADIMIR PUTIN, A CALL WHICH THE KREMLIN SAID LASTED FOR 40 MINUTES. NOW THIS BLOOMBERG SCOOP THAT AFTER THE BOOT AND CALL HE LEFT AND CALLED THE VIKTOR ORBAN, ONE OF HIS STRONGEST ALLIES IN EUROPE, SOMEONE WHO HAS BEEN TO MAR-A-LAGO, SOMEONE WHO IN MANY WAYS SERVED AS THE MODEL MANY PEOPLE THINK FOR THE MAKE AMERICA GREAT AGAIN MOVEMENT. HE'S BEEN IN OFFICE SINCE 2010, SO PROCEEDED DONALD TRUMP BY MORE THAN A HALF DECADE. HE IS CALLING VIKTOR ORBAN AND ASKING HIM ABOUT A LONG-STANDING REQUEST FROM EU MEMBERS FOR HIM TO DROP HIS OPPOSITION TO UKRAINE, JOINING THE EUROPEAN UNION, TO WHICH WE SAW SOME RESPONSE TODAY FROM ORBAN SAYING EU MEMBERSHIP IN ITSELF WOULD NOT PROVIDE ANY SECURITY GUARANTEES. THE EU DOES NOT HAVE A SHARED ARMY. NATO IS THE SECURITY ALLIANCE. STILL FASCINATING THAT PRESIDENT TRUMP WOULD TAKE THIS STEP AT THE URGING OF HIS EUROPEAN COUNTERPARTS TO GO CALL ORBAN. EXTRAORDINARY. MICHAEL: FOR MORE, WE WANT TO BRING IN KURT VOLKER, FORMER U.S. AMBASSADOR AT THE NATO AND FORMER U.S. REPRESENTATIVE FOR UKRAINE NEGOTIATIONS IN THE FIRST TRUMP ADMINISTRATION. WE ARE SEEING HEADLINES COURTESY OF THE FOX THAT MILITARY REPRESENTATIVES FROM THE U.S. AND SOME EUROPEAN COUNTRIES WILL BE MEETING TO DISCUSS FURTHER STEPS ON THESE SECURITY GUARANTEES. BASED ON YOUR EXPERIENCE, WHAT ARE THE NECESSARY INGREDIENTS AND ELEMENTS TO ENSURE THAT THESE GUARANTEES PROVIDE ENOUGH SAFETY AND SECURITY FOR UKRAINE IN THE LONG RUN? KURT: THERE ARE VERY BASIC QUESTIONS HERE. THE KEY THING FOR EUROPEAN LEADERS AND PRESIDENT TRUMP TO DECIDE IS WHAT IS THE PURPOSE OF THIS FORCE? I THINK THAT MISSION SHOULD BE TO HELP UKRAINE DEVELOP SUFFICIENT DEFENSE CAPABILITY THAT PUTIN IS DETERRED FROM ATTACKING AGAIN. A DETERRENCE THROUGH DEVELOPING UKRAINIAN FORCES. THAT I THINK SHOULD BE THE MISSION. THERE ARE OTHER WAYS TO SLICE IT. ONE IS TO PROVIDE ENOUGH FORCE THEMSELVES AND THEY DETER PUTIN, BUT WHAT IF PUTIN DOES ATTACK? DO THEY THEN JOIN A FIGHT AGAINST RUSSIA? HOW DO YOU DO THAT? THEN WHAT IS THE ROLE OF THE U.S. IN THIS? IS THE U.S. GOING TO BE ON THE GROUND WITH EUROPEANS, OR WILL WE PROVIDE ENABLING SUPPORT LIKE ACCESS TO SATELLITES, LOGISTICS, MAY BE WITH AIR DEFENSE, AIR SUPPORT IF THEY ARE ATTACKED? THERE IS A LOT OF MISSION QUESTIONS THAT NEED TO BE ADDRESSED. ONCE YOU GET THE MISSION DOWN AND YOU UNDERSTAND WHAT THE ROLE IS, THEN YOU CAN START TALKING ABOUT WHO CONTRIBUTES WHAT SIZE FORCE. ONE STRESS ON THE EUROPEAN MINDS , I KNOW THE EUROPEANS WILL BE WANTING TO MAKE SURE THAT WHATEVER WE DO WITH UKRAINE ON SECURITY GUARANTEES AND ASSURANCES IS GOING TO MESH EASILY WITH WHAT NATO ALREADY DOES. WE DON'T WANT TO CREATE TWO DIFFERENT SYSTEMS OF SECURITY IN EUROPE, SO EVEN IF UKRAINE IS NOT A MEMBER, WE WANT THIS TO BE SEAMLESS. TYLER: TO BUILD OFF THIS, I'D LOVE TO GET YOUR THOUGHTS ON HOW WE SHOULD BE MEASURING PROGRESS. THERE ARE A LOT OF DIFFERENT THREADS HERE THAT WE COULD BE WATCHING. WE HEARD PRESIDENT TRUMP YESTERDAY SAYING HE COULD BE IN FAVOR OF A CEASE FIRE, BUT HE DOES NOT THINK THAT AT THIS POINT IT IS NECESSARY. WHEN WE ARE LOOKING AT THE STRATEGY ON TRYING TO ACCOMPLISH THE END GOAL OF ENDING THE WAR, HOW SHOULD WE BE MEASURING PROGRESS TOWARDS THAT? KURT: IT REMINDS ME OF THOSE VIDEOS ON YOUR SOCIAL MEDIA OF SHEEPDOGS HERDING SHEEP. THEY RUN AROUND THIS WAY AND RUN AROUND THE OTHER WAY AND KEEP RUNNING AROUND. THAT IS WHAT IT LOOKS LIKE PRESIDENT TRUMP IS DOING WITH PUTIN AND ZELENSKYY AND THE EUROPEANS. HE'S TRYING TO GET A NEGOTIATION GOING WHERE EVERYBODY IS DOING THE SAME THING, AND YOU END UP WITH AN OUTCOME AT SOME POINT. I DON'T THINK HE'S PARTICULAR ABOUT WHAT THAT OUTCOME IS ON THE BUT HE REALLY WANTS TO GET IT SO YOU HAVE AN END TO THE FIGHTING AND CAN GET ON WITH BUSINESS AGAIN. I THINK THAT'S WHAT HE'S TRYING TO DO. ONE DAY HE'S FLATTERING VLADIMIR PUTIN, THE NEXT HE'S IN LOCKSTEP WITH EUROPEAN ALLIES, THEN YOU WILL HAVE DIFFICULTY IN FINDING A MEETING, THEN PUTIN WILL TRY TO PUT IN PLACE ROADBLOCKS TO MEETING WITH ZELENSKYY. MORE FIGHTING WILL GO ON. PRESIDENT TRUMP WILL JUST KEEP TRYING TO HERD ALL OF THESE CHEAP TOGETHER. MICHAEL: AMBASSADOR, WHAT HAPPENS IF PRESIDENT TRUMP IS ULTIMATELY DISAPPOINTED BY PUTIN AND PUTIN DOES NOT AGREE TO A MEETING? WE HAVE NOT HEARD THE PRESIDENT TALK AS MUCH LATELY OF SANCTIONS FOR RUSSIA AND ITS LEADER. WILL IT REENTER THE CONVERSATION? KURT: IT WILL HAVE TO AT SOME POINT. I SAW A MARCO RUBIO OVER THE WEEKEND AND WAS ADDRESSING THE ADMINISTRATION VIEW THAT IF YOU IMPOSE SANCTIONS NOW, THAT WILL DRIVE PUTIN AWAY AND MAKE A NEGOTIATED END TO THE WAR FURTHER OUT IN TIME. THAT IS THE EXACT OPPOSITE OF SAYING LAST WEEK THAT IT WAS THE THREAT OF SANCTIONS THAT BROUGHT PUTIN TO THE TABLE. I THINK THE LATTER IS CORRECT. PU RESPONSE TO -- PUTIN RESPON DS TO PRESSURE, AND WHEN HE DOES NOT FEEL PRESSURE, HE PLAYS GAMES. WE WILL HAVE TO TURN THE SCREWS ON RUSSIA AND OIL GAS REVENUE TO GET PUTIN TO GET SERIOUS ABOUT A CEASE FIRE AND ENDING THE WAR. AS FAR AS A CEASE FIRE GOES, IT WAS PRESIDENT TRUMP WHO ORIGINALLY SAID WE HAVE TO HAVE A CEASE FIRE NOW. HE CONVINCED PRESIDENT ZELENSKYY OF UKRAINE TO GO ALONG WITH THAT , EVEN THOUGH RUSSIA OCCUPIES 20% OF UKRAINIAN TERRITORY. NOW THAT HE RAN INTO A STONE WALL WITH PUTIN, PRESIDENT TRUMP HAS FLIPPED IT AND SAID LET'S DO A FULL PEACE AGREEMENT. THAT WILL BE ELUSIVE AS WELL. I THINK LATER THIS YEAR, A FEW MONTHS FROM NOW, IF WE KEEP THE PRESSURE ON PUTIN, WE WILL END UP BACK WHERE WE WERE OF JUST WANTING TO GET A CEASE FIRE IN PLACE. TYLER: CAN WE ALSO GET A MORE GLOBAL SCOPE WHEN WE ARE TALKING ABOUT FOREIGN ALLIANCES? WE MENTIONED PRESIDENT TRUMP DIRECTLY CALLING UP VIKTOR ORBAN ABOUT POTENTIALLY THE FUTURE OF UKRAINE IN THE EUROPEAN UNION. HOW ARE WE SEEING THESE ALLIANCES SHIFT COMING UP TO THIS WEEK WITH ALL THESE EUROPEAN LEADERS DESCENDING ON WASHINGTON, TRYING TO GET SOME PROGRESS MADE? KURT: ONE OF THE GOOD THINGS ABOUT PRESIDENT TRUMP US GE;S COMPLETELY -- ABOUT TRUMP IS HE'S COMPLETELY TACTICAL. IF THE EUROPEANS SAY WE HAVE A PROBLEM WITH ORBAN TO BACK UKRAINE, PRESIDENT TRUMP JUST TALKS TO ORBAN AND SAYS, HELP GET UKRAINE INTO THE EUROPEAN UNION. I ALSO SAW THAT HE OFFERED THAT MAYBE HUNGARY COULD BE THE PLACE WHERE WE HOST A TRILATERAL MEETING WITH ZELENSKYY, PUTIN AND TRUMP. THAT WILL NOT GO OVER WELL WITH UKRAINIANS BECAUSE BUDAPEST IS WHERE WE HAD THE FAMOUS 1994 SUMMIT MEETING TO ASSURE UKRAINE'S SOVEREIGNTY AND TERRITORIAL INTEGRITY AND IT WAS RUSSIA AND THE U.S. AND THE U.K. , AND OF COURSE THAT AGREEMENT MEANT NOTHING ONCE IT WAS TESTED BY PUTIN'S FIRST INVASION OF UKRAINE. TYLER: KURT VOLKER, FORMER U.S. AMBASSADOR TO NATO AND FORMER U.S. SPECIAL REPRESENTATIVE FOR UKRAINE NEGOTIATIONS UNDER THE FIRST TRUMP ADMINISTRATION, THANK YOU FOR JOINING BLOOMBERG. COMING UP, TEXAS DEMOCRATS WERE ASKED TO SIGN WHAT IS CALLED A PERMISSION SLIP IN ORDER TO LEAVE THE CHAMBER FLOOR AFTER LAWMAKERS FLED THE STATE TO BLOCK A REDISTRICTING EFFORT. WE BRING YOU THOSE DETAILS AND DISCUSS THAT NEXT WITH OUR POLITICAL PANEL ON \"BALANCE OF POWER.\" ♪ > > THOSE MEMBERS PRESENT TODAY WHEN ARREST WARRANTS WERE ISSUED ON FRIDAY SHOULD PROCEED TO THE BACK HALL TO SIGN A WRITTEN FORM ACKNOWLEDGING YOU ARE BEING RELEASED INTO THE CUSTODY OF A DESIGNATED DPS OFFICER ON THE CONDITION YOU WILL RETURN TO THE CHAMBER AT 10:00 A.M. ON WEDNESDAY. WHEN WE ADJOURN, THE DOORS TO THE CHAMBER SHALL REMAIN LOCKED AND ONLY THOSE MEMBERS WITH APPROPRIATE PERMISSION MAY LEAVE. TYLER: THAT WAS THE TEXAS SPEAKER ON THE RETURN OF DEMOCRATS WHO FLED THE STATE IN PROTEST OF REPUBLICAN REDISTRICTING EFFORTS. SPEAKER BURROUGHS SAID THOSE DEMOCRATS COULD NOT LEAVE THE CHAMBER UNLESS THEY SIGNED AN AGREEMENT TO ALLOW 24 HOUR SURVEILLANCE BY THE OF PUBLIC SAFETY OFFICERS. ONE DEMOCRAT REFUSED TO SIGN WHAT SHE CALLED A PERMISSION SLIP AND OPTED TO SPEND THE NIGHT LOCKED IN THE HOUSE CHAMBER. HER COLLEAGUES RESPONDED TO ALL OF THE NEWS JUST A SHORT TIME AGO. > > WE KNEW WHAT WAS AHEAD OF US. WHAT WE DIDN'T KNOW WAS WE WOULD BE ARRESTED EN MASSE WHEN HE DIRECTED THE SERGEANT AT ARMS TO LOCK THE CHAMBERS AND NOT LET US EXIT, AND THEN WE WERE BASICALLY PUT UP AGAINST THE WALL FIGURATIVELY AND SAID NO ONE IS ALLOWED TO LEAVE UNLESS THEY SIGN A PIECE OF PAPER CONSENTING TO MOVE IN CUSTODY -- MOVING CUSTODY. WE ARE NOT CRIMINALS. WE ARE ELECTED JUST LIKE THOSE PEOPLE ARE. TYLER: THE LATEST FROM DALLAS, JOE COVERS ALL THINGS TEXAS FOR US AT BLOOMBERG. THANKS FOR JOINING. CAN YOU BRING US UP TO SPEED? HOW DID WE GET TO THIS POINT WITH LAWMAKERS NOW SLIPPING IN THE CHAMBERS? IT IS OUR UNDERSTANDING THAT LAWMAKER IS ACTUALLY STILL THERE. JOE: THAT IS RIGHT. THANKS SO MUCH FOR HAVING ME. WE'VE HAD A BUSY COUPLE WEEKS IN THE TEXAS LEGISLATURE. AT THE BEGINNING OF AUGUST, A GROUP OF TEXAS DEMOCRATS LEFT THE STATE IN ORDER TO DENY WHAT IS CALLED A QUORUM. THAT MADE SURE THAT NO VOTES COULD BE HELD IN THE TEXAS HOUSE. THEY HAD BEEN GONE FOR ABOUT TWO WEEKS, THEN FINALLY RETURNED YESTERDAY. IN ORDER TO ENSURE THEY DON'T BOLT AGAIN, HOUSE SPEAKER BURROUGHS MADE THEM SIGN PERMISSION SLIPS TO ALLOW TEXAS DEPARTMENT OF PUBLIC SAFETY OFFICERS TO TRACK THEM 24/7 AND TO MAKE SURE THEY DO NOT LEAVE THE STATE AGAIN. JUST IN THIS HOUR WE HAD EIGHT OTHER LEGISLATORS TEAR UP THEIR PERMISSION SLIPS. THEY ARE PLANNING ON JOINING THE REPRESENTATIVE ON THE FLOOR OVERNIGHT AGAIN. SHE TWEETED OUT PHOTOS LAST NIGHT WITH A SLEEP MASK AND BONNET. SHE TOLD ME EARLIER TODAY, SHE'S PLANNING ON STAYING AS LONG AS IT TAKES UNTIL THAT DPS COVERAGE IS REMOVED. MICHAEL: JOINING US WITH THEIR REACTION TO THIS STORY IS THIS EVENING'S POLITICAL PANEL. BLOOMBERG POLITICS CONTRIBUTOR ADAM HODGE, MANAGING DIRECTOR AT BULLY PULPIT INTERNATIONAL. ALONGSIDE REPUBLICAN STRATEGIST BRITTANY MARTINEZ, EXECUTIVE OF PRINCIPLES FIRST. BRITTANY, I WANT TO TURN TO YOU. THIS IS ESCALATING. IS THIS THE KIND OF LOOK THAT REPUBLICANS WILL WANT, EVEN AS THEY ARE PURSUING THE POTENTIAL GAIN OF FIVE SEATS IN THE HOUSE, WHERE RIGHT NOW THEY HAVE A TIGHT MAJORITY? BRITTANY: WATCHING THAT CLIP, THIS IS A BAD LOOK FOR REPUBLICANS, SO NO I DON'T THINK THIS IS A GOOD LOOK. THERE WAS A POINT WHEN THEY COULD HAVE SAID THIS IS A BAD LOOK ON DEMOCRATS, THEY LEFT THE STATE, BUT NOW YOU ARE CHASTISING THEM AS THOUGH THEY ARE CHILDREN. THESE ARE DULY ELECTED STATE LEGISLATORS, AND YOU ARE TREATING THEM AS THOUGH THEY ARE CRIMINALS, WANTING TO SURVEILLED THEM FOR 24 HOURS A DAY. THIS IS A BAD LOOK FOR REPUBLICANS. WE HAVE TO GET BACK TO BASICS WITH WHAT THE CONSTITUTION LOOKS LIKE TO DO A CENSUS WHICH TRIGGERS REDISTRICTING. TYLER: ADAM, LET'S GET YOUR THOUGHTS MORE BROADLY ON THIS IDEA OF REDISTRICTING, BECAUSE THERE ARE RAZOR THIN MARGINS IN THE HOUSE AS WE LEAD UP TO 2026. HOW POLITICALLY CHARGED OF AN ISSUE WILL THIS BE FOR BOTH SIDES OF THE AISLE WHEN YOU THINK OF HOW CALIFORNIA IS LOOKING INTO ITS OWN REDISTRICTING EFFORTS AT THE HANDS OF DEMOCRATS? ADAM: IT IS IMPORTANT TO REMEMBER THIS ALL STARTED BECAUSE THE PRESIDENT IN THE MIDDLE OF THE DECADE, UNPRECEDENTED, CALLED ON A POLITICAL FAVOR TO GOVERNOR ABBOTT TO REDRAW THE LINES. WHAT CALIFORNIA AND OTHER STATES HAVE SAID COME ON THE CONDITION THAT TEXAS TAKES ACTION ON THE WILL ACT. THAT IS AN IMPORTANT DISTINCTION. WHAT IS GOING ON HERE IS THAT THE PRESIDENT IS VERY UNPOPULAR, , BUT HIS POLICIES WHETHER TARIFFS, A BEAUTIFUL BILL, ARE UNDERWATER WITH VOTERS, SO HE'S TRYING TO RIG THE GAME TO MAKE IT SO THAT HE CAN PICK UP SEATS AND SAVE THEIR HOUSE MAJORITY, BECAUSE THEY DON'T WANT THE ACCOUNTABILITY FOR THE POLICIES THEY PUT IN PLACE. I THINK IT IS IMPORTANT THAT DEMOCRATS ELEVATE THE ACTIONS OF THE PRESIDENT AND REPUBLICANS IN TEXAS, NOW A MUCH MORE NATIONAL ISSUE, AND PEOPLE ARE SHOWING THAT THEY THINK IT IS TREMENDOUSLY UNFAIR AND UNPOPULAR. I THINK IT WILL BLOW BACK IN REPUBLICANS IN TEXAS AND AROUND THE COUNTRY. MICHAEL: IN CALIFORNIA, GOVERNOR NEWSOM IS TRYING TO RALLY SUPPORT IN SILICON VALLEY BEHIND HIS EFFORT TO PERHAPS PURSUE A MIDCYCLE REDISTRICTING, AND YET WE HAVE SEEN THE TECH INDUSTRY PIVOT TO DONALD TRUMP. WHAT SORT OF LOVE MIGHT HE GET FOR THIS IDEA? BRITTANY: I'M FROM CALIFORNIA. I'M NOT A BIG FAN OF THE GOVERNOR THERE, HOWEVER I CAN UNDERSTAND WHY SOME OF THESE TECH BROS WANT TO BE FRIENDS WITH TRUMP. WE'VE SEEN HIM GO TOE TO TOE WITH THE TECH INDUSTRY LEADERS IN THE PAST. EVEN WHEN WE SEE MARK ZUCKERBERG, AT THE INAUGURATION, THEY REALIZED IF THEY WANT TO SUCCEED UNDER THE TRUMP ADMINISTRATION, THEY NEED TO BE FAIRLY FRIENDLY WITH HIM. IF THAT MEANS GOING AGAINST THE GOVERNOR, THAT MIGHT BE WHAT HAPPENS. TYLER: WE ALSO WANT TO MAKE SURE TO GET TO FOREIGN POLICY, WHICH HAS BEEN DOMINATING THE HEADLINES IN RECENT DAYS. TODAY DURING THE WHITE HOUSE PRESS BRIEFING, THE WHITE HOUSE PRESS SECRETARY DISCUSSED THE PROSPECT OF A TRILATERAL MEETING BETWEEN PRESIDENT TRUMP, PUTIN, AND ZELENSKYY. WE WILL GET YOUR REACTION ON THE OTHER SIDE. > > THE PRESIDENT HAS SPOKEN TO BOTH LEADERS ABOUT THIS, AND BOTH LEADERS EXPRESSED A WILLINGNESS TO SIT DOWN WITH EACH OTHER. OUR NATIONAL SECURITY TEAM WILL HELP BOTH COUNTRIES DO THAT. ULTIMATELY THE COUNTRY -- THE PRESIDENT HAS ALWAYS SAID THERE ARE AREAS OF DISAGREEMENT THAT HAVE TO BE DECIDED UPON BETWEEN THESE TWO COUNTRIES. HE WANTS THESE COUNTRIES TO ENGAGE IN DIRECT DIPLOMACY. TYLER: ADAM, WHAT IS THE VIEW WHEN WE HAVE THE WHITE HOUSE TRYING TO SHOW SOME PROGRESS, SAY THERE WILL BE SOME MEETING ON THE BOOKS AS WE WAIT FOR MORE DETAILS ON WHAT THAT IS GOING TO LOOK LIKE? ADAM: I THINK THEY ARE TRYING TO SAVE FACE A LITTLE BIT. LAST WEEK THE PRESIDENT ROLLED OUT THE RED CARPET IN ALASKA FOR PUTIN, AND HE GOT NOTHING TO SHOW FOR IT. HE WAS TALKING ABOUT A CEASE-FIRE FOR WEEKS, TALK ABOUT PRESSURE AND TARIFFS, AND I THOUGHT AMBASSADOR VOLKER LAID IT OUT TO SINK -- LAID IT OUT SUCCINCTLY, PUTIN RESPONSE TO PRESSURE. THEY ARE TRYING TO FIGURE OUT HOW TO KEEP MOMENTUM GOING. IF THIS ENDS IN LESS KILLING FOR THE UKRAINIAN PEOPLE, THAT WOULD BE FANTASTIC. WHAT UKRAINE NEEDS AREN'T REAL SECURITY GUARANTEES AND COMMITMENTS THAT RUSSIA WON'T TAKE ANY TERRITORY. BOTTOM LINE, WHAT THE PRESIDENT HAS TRIED TO SECURE IS A CEASE-FIRE AND AN END TO THE KILLING. THAT HAS NOT HELD UP. THAT IS SOMETHING I THINK THE ADMINISTRATION NEEDS TO HONOR. MICHAEL: IN THE 30 SECONDS OR SO WE HAVE LEFT, HOW MUCH POLITICAL LIABILITY IS PRESIDENT TRUMP POTENTIALLY CREATING FOR HIMSELF AT HOME IF THIS EFFORT TO SECURE PEACE DOES NOT END THE WAY HE WANTS? BRITTANY: HE SAID HE WOULD END THE WAR ON DAY ONE. IT HAS BEEN EIGHT MONTHS AND IT HAS NOT HAPPENED. HE SOMEWHAT COUNT HOUSE TO PUTIN. HE CRITICIZED BIDEN FOR BEING WEAK, BUT I DON'T THINK THE CURRENT PRESIDENT IS BEING VERY STRONG AGAINST PUTIN. HE WILL HAVE A LOT TO NOT SHOW FOR AND GET SOME BLAME. TYLER:OUR POLITICAL PANEL TONIGHT, ADAM HODGE AND BRITTANY MARTINEZ, WE THANK YOU BOTH. A LOT OF BIG UPDATES TODAY, INCLUDING WHAT SOME OF THESE SECURITY GUARANTEES COULD LOOK LIKE. OUR EUROPEAN ALLIES ARE STARTING TO WORK ON THIS IDEA OF GETTING BOOTS ON THE GROUND. MICHAEL: WE WANT TO HEAR WHAT EMERGES FROM THESE DISCUSSIONS BETWEEN MILITARY OFFICIALS FROM THE U.S. AND EUROPEAN UNION. IT WILL BE CONSEQUENTIAL FOR THESE SECURITY GUARANTEES WE HAVE BEEN TALKING ABOUT ALL WEEK. TYLER: TO LEARN MORE ABOUT EVERYTHING YOU HEARD IT, CHECK OUT THE WASHINGTON EDITION NEWSLETTER ON THE TERMINAL AND ONLINE. MICHAEL: THANKS FOR JOINING US FOR \"BALANCE OF POWER.\" THIS IS BLOOMBERG. TYLER KENDALL AND I WILL BE BACK HERE TOMORROW. SEE YOU THEN.",
  "medium": "Video",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "PRESIDENT TRUMP",
      "weight": 0.07598452
    },
    {
      "name": "DONALD TRUMP",
      "weight": 0.06157816
    },
    {
      "name": "TRUMP",
      "weight": 0.06094037
    },
    {
      "name": "TRUMP ONE",
      "weight": 0.058397774
    },
    {
      "name": "RUSSIAN PRESIDENT PUTIN",
      "weight": 0.05793528
    },
    {
      "name": "PRESIDENT ZELENSKYY",
      "weight": 0.0570812
    },
    {
      "name": "TRUMP US GE;S",
      "weight": 0.05554845
    },
    {
      "name": "PRES. TRUMP",
      "weight": 0.055289738
    },
    {
      "name": "UKRAINIAN PRESIDENT ZELENSKYY",
      "weight": 0.05437398
    },
    {
      "name": "PRESIDENT",
      "weight": 0.052741114
    }
  ],
  "topics": [
    {
      "name": "Russia-Ukraine War"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.97900390625
    },
    {
      "name": "/Sensitive Subjects/War & Conflict",
      "score": 0.9560546875
    },
    {
      "name": "/News/World News",
      "score": 0.9248046875
    },
    {
      "name": "/People & Society/Social Sciences/Political Science",
      "score": 0.88330078125
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.6826171875
    },
    {
      "name": "/News/Other",
      "score": 0.408203125
    },
    {
      "name": "/Law & Government/Military/Other",
      "score": 0.301025390625
    }
  ],
  "sentiment": {
    "positive": 0.09812229,
    "negative": 0.5540039,
    "neutral": 0.34787378
  },
  "summary": "The US and Europe are working on a Ukraine Security Plan, which aims to end the ongoing conflict in the country. The White House is pushing for a BILATERAL Summit between RUSSIAN President PUTIN and UKRAINIAN President ZELENSKYY. President Trump has called for an end to the conflict in UKRAINE, denying the potential role of the U.S. military in the conflict. The US government is also in talks to secure an equity stake in the company. New reports suggest that the EU is pushing a package of security guidance for UKRARAINE as soon as possible. If successful, this could be seen as a peace-making moment for both the US and EU.",
  "shortSummary": "The US and Europe are working together to create a security plan for Ukraine, amid tensions over the conflict's alleged role in Russia's intervention.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "7e95d51523fc40599269b376473e94ac",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Bloomberg’s \"Balance of Power\" focused on President Trump’s attempt to broker a peace deal between Russia and Ukraine, highlighting his phone calls with Vladimir Putin and Hungarian Prime Minister Viktor Orbán and the push for European security guarantees that could involve NATO and U.S. air support.  The show also covered the ongoing debate over whether Ukraine should cede territory, the prospects for EU membership, and the role of U.S. sanctions in pressuring Moscow.  In addition, the program reported on domestic political drama in Texas, where lawmakers were locked in the statehouse over a redistricting dispute, and touched on broader economic issues such as U.S. tariffs, Intel’s potential government stake, and the impact on tech stocks.",
  "argos_id": "8JPW061PB"
}