{
  "url": "https://www.express.co.uk/celebrity-news/2099453/june-wilkinson-dead-death-age",
  "authorsByline": "Michelle Marshall",
  "articleId": "c61eae8f50ad4b3daab8773493d63975",
  "source": {
    "domain": "express.co.uk",
    "location": {
      "country": "us",
      "state": "OH",
      "county": "Stark County",
      "city": "Hartville",
      "coordinates": {
        "lat": 40.9636685,
        "lon": -81.3312195
      }
    }
  },
  "imageUrl": "https://cdn.images.express.co.uk/img/dynamic/79/590x/2099453_1.jpg",
  "country": "gb",
  "language": "en",
  "pubDate": "2025-08-24T12:07:00+01:00",
  "addDate": "2025-08-24T11:10:34.959171+00:00",
  "refreshDate": "2025-08-24T11:10:34.959173+00:00",
  "score": 1.0,
  "title": "British-born 60s legend and Elvis Presley's girlfriend dies aged 85",
  "description": "The actress who hailed from Eastbourne became one of America's most prolific models",
  "content": "Jane Wilkinson famed for her work as a Playboy model has died aged 85. She gained international fame and was affectionately known as \"The Bosom,“ becoming one of America’s most photographed women and was featured in Playboy magazine dozens of times. The model, who also worked as an actress, sadly died on July 21, reports The Telegraph. June was not shy of male admirers and enjoyed a chaste romance with Elvis Presley. She previously gave an insight into their brief encounter, saying, “He gave me a tour of his suite, sat me on the bed in his bedroom and sang to me for two hours. That was it. He was very sweet.” In 1971 she told the press that she had been wined and dined by Henry Kissinger.\n\nTributes have since poured in for the on-screen star as fans paid tribute to June. One person penned: \"God rest her soul. June was an amazing actress.\" Another simply wrote: \"RIP.\" Born in Eastbourne on March 27 1940, the daughter of Robin Wilkinson, a window-cleaner and part-time bandleader, and his wife Lily, née Curryer. June had initially wanted to become a ballet dancer but soon gave up those ambitions. In 1958 she posed for her debut nude photoshoot in Hugh Hefner’s Playboy, where she was dubbed \"The Bosom\".\n\nShe also secured several film roles, including the lead in The Bellboy and the Playgirls (1962). June also had a small role alongside Bobby Darin in John Cassavetes’s Too Late Blues (1961). She also appeared in films like The Private Lives of Adam and Eve (1960), and The Candidate (1964), as Angela Wallace, a glamorous model involved in a political campaign. Her TV appearances included guest spots on popular shows like Batman, The Doris Day Show, and The Jack Benny Program. June is survived by her beloved daughter Brahna.",
  "medium": "Article",
  "links": [
    "https://www.express.co.uk/latest/celebrity-deaths",
    "https://www.express.co.uk/",
    "https://www.express.co.uk/privacy-notice",
    "https://www.express.co.uk/latest/elvis-presley",
    "https://www.express.co.uk/celebrity-news/2099299/emmerdale-star-dead-horror-accident",
    "https://www.express.co.uk/showbiz/tv-radio/2099433/how-king-edward-die-king-and-conqueror",
    "https://www.express.co.uk/celebrity-news/2099434/eamonn-holmes-dad-death"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Playboy magazine",
      "weight": 0.074055135
    },
    {
      "name": "June",
      "weight": 0.070586115
    },
    {
      "name": "Elvis Presley",
      "weight": 0.06876066
    },
    {
      "name": "Playboy",
      "weight": 0.068067536
    },
    {
      "name": "Robin Wilkinson",
      "weight": 0.06472947
    },
    {
      "name": "guest spots",
      "weight": 0.059366304
    },
    {
      "name": "Bobby Darin",
      "weight": 0.05902315
    },
    {
      "name": "popular shows",
      "weight": 0.058990713
    },
    {
      "name": "Jane Wilkinson",
      "weight": 0.05892442
    },
    {
      "name": "Too Late Blues",
      "weight": 0.05791285
    }
  ],
  "topics": [
    {
      "name": "In Memoriam"
    }
  ],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.994140625
    },
    {
      "name": "/Sensitive Subjects/Death & Tragedy",
      "score": 0.861328125
    },
    {
      "name": "/News/Gossip & Tabloid News/Other",
      "score": 0.53076171875
    }
  ],
  "sentiment": {
    "positive": 0.33062422,
    "negative": 0.19992268,
    "neutral": 0.46945307
  },
  "summary": "British-born model and Elvis Presley's girlfriend, Jane Wilkinson, has died at the age of 85. Known as \"The Bosom,\" Wilkinson gained international fame as a Playboy model and was featured in Playboy magazine dozens of times. She also had successful roles in several films, including The Bellboy and the Playgirls in 1962 and The Candidate in 1964. In 1971, she claimed to have been wined and dined by Henry Kissinger. Tributes have been paid to the model, who also had a successful career in Hollywood.",
  "shortSummary": "Jane Wilkinson, known as \"The Bosom\" for her Playboy modeling and acting roles, has died at 85, remembered fondly by fans and colleagues, including Elvis Presley's girlfriend.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "c6ec50db8e43445ca3dc9ba62ea793af",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.express.co.uk/",
      "text": "The Prime Minister wants to overhaul the asylum appeal system in a bid to speed up deportations.\nThe Prince and Princess of Wales have been spotted in Scotland with their children today.\nWe'll be bringing you the very latest updates, pictures and video on this breaking...\nReform UK leader Nigel Farage warned of an impending \"economic doom loop\" across the...\nThe actress who hailed from Eastbourne became one of America's most prolific models\nHundreds of thousands of disabled OAPs will not receive the winter fuel allowance...\nArgos customers can beef up their home security for less than £33 with this simple...\nRob Swaine, 68, has challenged Liverpool City Council after he believes he was singled...\nA British mum on the half-empty flight said staff originally wanted 36 people to get off, but in the end only about 20 volunteered.\nIt's back to the '70s as experts warn the Chancellor risks a full-blown sterling crisis.\nAndrew Neil's recent remarks have stirred public opinion, questioning the reliability...\nThe RNLI says it has issued a warning over what it says will be unusual and dangerous...\nDaily Express\nBrits are being warned to act now and place CDs around their garden for one very...\nMany parts of the UK will soon turn golden brown as leaves fall from trees and Autumn...\nFind out whether opening hours at your local supermarket are affected by the summer...\nShoppers who want to get into some shops in a West End street have to knock for...\nMarks and Spencer has unveiled a chilling surprise for Colin the Caterpillar fans, leaving fans in a frenzy.\nEXCLUSIVE: A good caesar salad is hard to beat - but if you're craving those delicious...\nA man has been stabbed a \"number of times\" in the horrifying Bank Holiday weekend attack.\nA cruise guest on board a Royal Caribbean ship revealed the unspoken taboo word she...\nBecky has struggled with her weight and overall healthsince her teenage years, but she...\nReform UK leader to discuss the case as he gives evidence of free speech in Britain\nEXCLUSIVE: Heaven Skincare's Deborah Mitchell shares her expert tips to keep skin...\nEXCLUSIVE: The Duke of Sussex could damage his hopes of reconciliation with his royal...\nA new £218 million train station will be opening this autumn, ahead of schedule.\nCabbage is a hugely versatile vegetable, but it's also easy to get wrong. Luckily,...\nMany parts of the country are likely to bask in the hot weather, the maps have suggested.\nOne Reddit user recommended some underrated UK towns and cities to visit, and one...\nSky is back with the return of its 'lowest ever' price on telly and broadband.\nWhat if that rusty old thing in your garage could be worth a fortune? One man's...\nWith Downton Abbey returning to cinemas for the final film and anticipation building...\nThe animal expert advised would-be owners not to take the decision lightly due to the...\nEXCLUSIVE: Farmers have bemoaned \"one of the greatest failures in Government\".\nA TV icon, the star's journey from stage manager to beloved actor is a tale of...\nUS president fires off warning after Kremlin missile attack on a US factory in...\nIt is believed that the bulk of construction on the initial fourteen flats has now...\nA legal expert has revealed how painting your fence could land you in trouble with...\nA beautiful seaside town with golden sands also boasts beautiful warm waters.\nA National Audit Office report estimated that completing the full HS2 network will...\nAnother city council has demanded the removal of St George's Cross flags from its streets.\nI've read a lot since I started tracking my reading on Goodreads, but these are the books that have stayed with me...\nEXCLUSIVE: The RAC and AA have both agreed on the best fuel saving tip with petrol and...\nBehind the sequins and smiles, Strictly Come Dancing is embroiled in a scandal that...\nAlthough the city lost its official title in 1886, it was formally restored by Queen...\nA Chinese manufacturer once released a supermini that looks almost identical to the...\nDust always gathers along skirting boards, and it can be one of the most annoying...\nThe combination of crunchy yet chewy meringue, soft whipped cream and fresh berries...\nAt least 15 arrests have been made this morning across the UK at various...\nGiven its possible extra security obligations, the British Army may well need to boost its ranks with further recruits.\nIt can be upsetting when lavender fails to bloom to the best of its abilities, but...\nCooking sausages in a frying pan is perhaps the easiest and most classic cooking...\nReddit users in the subreddit r/Cooking were discussing the one ingredient they swear...\nTrains in this mountainous country are renowned for their precision and punctuality.\nIt was first believed Meghan Markle and Prince Harry were concerned about their...\nIf you want the stunning scenery of the Maldives without the sky high price, then this...\nEXCLUSIVE: A couple have opened up on their experiences with an electric car after...\nDaily Express uses notifications to keep you updated"
    }
  ],
  "argos_summary": "Jane Wilkinson, famed Playboy model known as \"The Bosom,\" died at 85 after a career that made her one of America’s most photographed women. She appeared in Playboy dozens of times, starred in films such as The Bellboy and Too Late Blues, and made guest spots on shows like Batman and The Jack Benny Program. Wilkinson had a brief romance with Elvis Presley and once hosted a dinner with Henry Kissinger. Born in Eastbourne in 1940, she initially aspired to be a ballet dancer before turning to modeling and acting. Tributes poured in following her death, with fans and colleagues remembering her legacy.",
  "argos_id": "8KMUSKEFE"
}