{
  "url": "https://www.bloomberg.com/news/videos/2025-08-19/insight-with-haslinda-amin-8-19-2025-video",
  "authorsByline": "bn",
  "articleId": "dbdb960c3b4b40969f4c79a6a16cc9cc",
  "source": {
    "domain": "bloomberg.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/i3KD_ZEBoeYA/v3/-1x-1.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-19T05:47:19.334000+00:00",
  "addDate": "2025-08-19T06:18:42.900559+00:00",
  "refreshDate": "2025-08-19T06:18:42.900560+00:00",
  "score": 1.0,
  "title": "Between Trump, Modi and Xi, It’s Personal",
  "description": "Insight with Haslinda Amin, a daily news program featuring in-depth, high-profile interviews and analysis to give viewers the complete picture on the stories that matter. The show features prominent leaders spanning the worlds of business, finance, politics and culture.\n (Source: Bloomberg)",
  "content": "The war is going to end when it ends. I can't tell you, but the war is going to end. And this gentleman wants it to end and Vladimir Putin wants it to end. I think the whole world is tired of it and we're going to get it ended. Trump says he's arranging a meeting between Zelensky and Putin after the summit today in Washington with the Ukrainian president and European leaders. Live from Singapore, this is inside with Haslinda Amin, where we dive deeper into the story with crucial context and shock analysis. Investors are cautious with focus shifting to the Fed after Trump's meeting with Ukrainian and European leaders ended with a call for a summit with Russia. Meanwhile, India and China are getting closer, with Indian Prime Minister Narendra modi set to meet China's top diplomat today, setting the scene for a possible meeting with Xi later this month. The world's largest miner saw its profits tumble and soft demand from China were exclusively from BHP CEO Mike Henry in just a few minutes. And with geopolitical tensions and tariff uncertainties and A's swaying investment sentiment. We hear from Ruchir Sharma, chairman of Roc-A-Fella International. Our top story today, President Trump ramping up efforts to broker peace between Russia and Ukraine. In a social media post, Trump says his pitching a one on one meeting between Russian President Vladimir Putin and Ukrainian leader volunteer Zelensky. That would be followed by a trilateral summit involving all three of them. Trump's latest diplomatic bid follows his Monday meeting with Zelensky and several European leaders at the White House, which comes just days after he attended a summit with Putin in Alaska. For more, let's bring in Bloomberg News desk editor Balazs Pans Vlasic. What was the outcome of the meetings in Washington? We know that everybody touted progress. How much progress was made? Yes, Linda, this was certainly a very eventful full day of diplomacy in Washington. The biggest takeaway is perhaps the show of unity between the U.S. and Ukraine, which helped allay some of the concerns that the European leaders had going into the meeting off the back of the Putin Trump summit in Anchorage. The tone was very different, markedly different from the Zelensky Zelensky's last appearance at the White House back in February. It was almost jovial, especially considering the stakes. And there were some tangible takeaways as well. As we heard, Trump is pushing for a bilateral meeting between Putin and the landscape, which was one of the Ukrainian president's main objectives for this meeting going into it. That could be followed by a trilateral meeting with the US president being present. And we also heard a lot about potential security guarantees. It sounds like the European leaders are convinced that the U.S. will take some sort of a role in a security guarantee for Ukraine after any sort of agreement is reached with Russia. So there is a lot to chew on as the European leaders gather. They will have an EU summit this week coming out. There will be a call with interested parties just today. So there's a lot more going ahead this week and we can expect more progress. Some sort of a role for the US. You got to question how big a role the US will play. What are the next steps? Jobless. Are we any closer to a peace deal? Well, certainly very, very large hurdle hurdles remain. We know that Ukraine and Russia are very far apart in their objectives, very far apart in what they would want a peace to look like. There's the question of territory and there's the question of security guarantees. President Trump left to the question of U.S. involvement vague. The European leaders talked about something like a needle, a needle like set up for Ukraine, where European countries and some sort of U.S. support would come to Ukraine's aid should something happen, should that become necessary. But there's a lot to be worked out. We don't know the details. We don't know who would be involved. And we certainly don't know to what degree the U.S. might commit. Bella, thank you so much for the update. Bloomberg News desk Ed Balls, Pence said. We'll have further analysis later this hour. Now, we're also tracking earnings results from some of the world's top companies. My next guest is head of the world's largest miner, BHP, which reported a 26% drop in full year underlying profit for the lowest level since a 2020 pandemic. BHP says its key exports, such as iron ore and coking coal, remained under pressure. Let's get insight from CEO Mike Henry. Mike, by most accounts, disappointing numbers. Lowest level perhaps since the pandemic, a third lower than the record you had back in 2022. You've got to wonder, is the boom over for you? Well, let me start by saying that I'm really pleased, actually, with how the underlying businesses is performing. And let me tell you why. We're in a cyclical business. Of course, commodity prices at any given point in the cycle can be can, can can either be up a bit or, you know, in current times we've seen iron ore prices come off a little bit. But on the things that we control, so underlying production volumes cost CapEx and so on, we saw record production in our iron ore business, record production in copper where we've growing volumes by 28% over the past three years. And in the face of headline inflation of 3%, we brought unit cost of production down by almost 5% over the course of the of the past year. And that that helped us to offset some of the price pressure that we were seeing and bodes well for the significant growth opportunity that we have ahead of us in both copper and potash. And we and we went to some extent over this this earnings call to talk investors through some of the optimization that we've we've we've embedded in those growth plans going forward. And I think everybody is excited by the what the next 5 to 10 years hold for the company. The question really is, well, you get back to the numbers of 2022. Well, So with with an underlying underlying business that is firing on all cylinders like BHP is with the growth that we have ahead of us. You know, of course all of this depends on what happens with with global demand for four commodities. But we're very optimistic for the future. We're in the right commodities, the right assets. And we're you know, we've got some very attractive growth ahead of us. When it comes to mining. The big focus, of course, is on tariffs. We saw tariffs on steel being imposed by the U.S. I know for BHP there's little exposure to the steel in the U.S., but you are pretty sensitive to demand pressures from China, especially China. How do you see China's demand shifting on the back of the tariffs? So interestingly, what we've seen over the course of the past six months is growth in China pretty strong, 5.3%, and they're on track to achieve their stated objective of 5% for the year. And even more importantly, in the sectors of the sectors of the Chinese economy that have been performing most strongly have been those that are metals intensive. So demand for iron ore, demand for copper, a couple of the key commodities that BHP produces has has remained pretty strong over recent times in China. In terms of the outlook for growth in China. We remain constructive both in the short term and then in the long term. Of course things remain positive for global growth and demand for the particular commodities that the BHP produces. Why constructive, Mike? Because when you take a look at the latest data dump out of China, they actually disappointed across the board. So my reference was to global growth. But I would say the same thing about China. The reality is that you've got a growing, growing global population, you know, expecting 10 billion people by the end of the decade. Everybody's chasing higher standards of living to feed that growth, to feed those higher standards of living. The reality is the world's going to need more of the commodities that the BHP produces. There's more steel needed to build cities, more copper needed not only to to electrify the world, but for the four data centers. So for AI. And so we've tried to orient the BHP portfolio towards those commodities that the world's going to need more of. And I'd be remiss in not mentioning Potash, one of the world's key fertilizers that's going to feed all of those hungry mouths out there in ever more sustainable ways. So we're pretty constructive on global growth. China itself has this remarkable track record over recent decades of setting a economic growth objective and and achieving it. They have a lot of policy levers at their disposal, and so far, they're doing a very skillful and nuanced job of keeping the economy on track and of progressing their higher quality growth, as they put it. Is there a way of giving an estimate for China's demand of a 12 month period from here? Look, it's so BHP is a very long term company. The investments that we make, an underlying production capacity, it takes us three, four or five years to bring a mine on from the point of investment and then another period beyond that to get payback. So we generally think in longer timeframes. Having said that, in China we're expecting 5% growth for the year. So it's a bit front end loaded with five 5.3% over the past half. Having said that, we expect it remained reasonably strong over the next six months and then to build momentum into the next calendar year. We know that you have big plans for iron ore operations. Your Western eyes Australia iron ore operation to target 33 million tonnes. Where are you now? When will you get there? So we achieved a really big milestone in the past year. We achieved 290 million tonnes of production for the first time ever in our Western Australian iron ore business. And this is a business that for the past six years running we've been the lowest cost major producer of iron ore globally. And that was a very deliberate strategy on our part to get to the low end of the cost curve to preserve margins as we see competition in iron ore markets heating up in the in the years ahead, having achieved 290 million tonnes per annum, we're on track to to achieve our stated goal of 305 million tonnes per annum in the coming years. And we've said that we have options to go beyond that, up to 330 million tonnes per annum, but we haven't yet taken those investment decisions, not just about steel but also about copper. And given where prices are right now, is that enough to incentivise new production? So copper is such a an interesting story. Demand for copper expected to grow by 70% between now and 2050, and yet it's becoming harder to find new copper deposits. And those that are being found are generally lower grade deeper or have some other challenge to to to bring them on. Well, BHP is the world's one of the world's largest, if not the largest copper producers. We've grown volumes by 28% over the past three years and we have growth. Big growth opportunities now for us in four jurisdictions Australia, the US, Chile and Argentina. And so we're chasing after growth in copper. We see it as being a particularly attractive commodity and one where we have a strong established base. Mike, about a year ago you made a bid for Anglo American and it was a pretty bold move that didn't work out. Do you envision perhaps making another bid for it, or under what circumstances would you? But so. So. So if you look at what we've spoken about to to to shareholders today, we have such attractive growth options within the BHP portfolio. As I just mentioned, we've got copper growth options across four big basins. That's on top of the growth that we've already unlocked. We're investing in two big phases of potash growth in Canada and there's more opportunity beyond that. So that's really what's consuming the management team is focus and effort is is is progressing those organic growth options that we we have. In terms of many other plans, all you know, what might the plans be in the next 12, 24 months? So, look, M & A is is, of course, one growth lever available to a company like BHP, but it's but one growth lever. And and we've been very clear and very disciplined over time about the sorts of M & A that we would pursue. It has to be on strategy in terms of the commodity has to be for BHP like assets which are large long life assets, low on the cost curve with growth potential and most importantly, we have to be able to unlock differential value for BHP shareholders through BHP ownership and operatorship of those those assets. That's a really hard mix of factors to achieve in any M & A opportunity. And right now we look at the landscape of of of of potential opportunities out there and it's hard to see how they can be pursued for for value. But of course it's one of a number of levers available to us. But right now the focus is very much on progressing this attractive suite of organic options that we've developed in recent years. So not yet for BHP. If you take a look at the mining industry as a whole in Australia, do you see employees unnecessary to compete with your rivals in China, especially with the likes of Virgin mining, you know, rising pretty much and you know, providing that competition? So, look, my view would be that M & A isn't necessary to compete, but you do have to have, you know, the right the right. If we look at Australia, specifically the right policy settings to ensure that mines can be developed and operate in Australia in a way that enables Australia to compete not just with with or with China but with other resource producing nations. And our focus is very much been on on advocating for the right policy settings there. And that's something that the Government has front and centre right now as well. Mike, before we let you go, you've been in that position for about five years. What are your priorities for the rest of your term? So we've made so much progress in recent years on driving operational excellence through through through the right, through to the fingertips of the company, through developing a distinctive approach to social value where, you know, the creation of value with those around us is embedded through all of the decisions that we take in the company. And then finally, on reshaping the portfolio to ensure that we have greater leverage to the megatrends playing out around us and it's really more to come. It's executing that pipeline of attractive growth projects I mentioned and never losing sight of the fact that there is still so much more to be unlocked in BHP and our existing operations in terms of becoming safer and even more productive. And so that's kind of what gets me up every day and it's the focus of the whole of the management team. So much optimism there, Mike. Thank you so much for joining us today. Mike Henry, CEO of BHP. Thank you. And coming up in the next hour, an interview with Woodside Energy CEO Mike O'Neill after Australia's biggest LNG producer reported tumbling first half earnings. That's happening at the Times, listed on your screen. And still ahead, we're joined by Rockefeller International Chairman Richard Sharma. We'll get his views across a range of topics from the Ukraine peace talks to India's tariff impasse with the U.S.. Plus, his take on AI's explosive growth. Keep it here with us. This is the back. It makes no sense to me to be talking to the Russians or even thinking that the Russians have anything to say interesting about security guarantee or or a coalition of the willing or a reassurance force on the ground in Ukraine. The Russians don't get the don't get the say about the no veto. They don't have a ability to stop them. Why was former US ambassador to Ukraine William Taylor speaking to Bloomberg about efforts to push for peace in Kiev? My next guest is chairman of Roc-A-Fella International and founder and CEO of Breakout Capital, an investment firm focused on emerging markets. Let's bring in Richard Schama, who is also the author of the critically acclaimed book titled What Went Wrong with Capitalism. Well, a lot going wrong in the world today. Richard, good to have you with us. Thanks for having me. How are we looking at developments in Ukraine and the talks that we just saw between Trump as well as Zelensky? Well, what we know is that looking at the polls in both the countries, Ukraine or in Russia, that the people of those countries are tiring of the war. And that usually is a good sort of precondition for bringing this war to an end. Now, of course, it's very difficult because we know that after you fight a war, there are long festering issues. So to expect that to be resolved immediately is very difficult. But at least I'd say that that precondition is being met. So the direction of travel, does that seem positive to me? And I guess the good thing is that the expectations are very low. Nobody really believes that something is going to happen here. And if you look at all the commentary from all the analysts, all the headlines, the still deep skepticism that something can happen. So I still feel that there's potential for upside surprise here over the next few months. Just looking at this vis a vis what expectations are, basically what the domestic constituencies in both the countries want. So just putting that together, I think there's scope for upside potential here. But as you know, that this is geopolitics. This is not something that we can properly handicap in terms of probabilities. But that's roughly how I'm seeing the situation. Well, the thing is, there are fault lines. And that has to do with land. Yes, right. We know that Putin wants the land that he hasn't already conquered. So I'm just wondering, what are some of the viable options out there, feasible that could lead to a breakthrough in negotiations? Well, I think the US is also sort of moving, right. I mean, Trump is talking about potentially giving security guarantees as well or being part of that. And that's not something which you would have thought this administration was very keen to do, given the fact that it came to power, talking about how it wants to limit US involvement internationally. But the big question marks about U.S. involvement. To what extent will it be involved? And that is what everybody's wondering, because it's lacking details. Exactly. But I think that, you know, there's a bit more than what we expected. I think that is that this administration is ending up being somewhat more internationalist than what people expected at the beginning of the term. And we're seeing that even in the Ukraine war. Now, this may just be the fact that Trump wants, you know, of glory. He wants to be the mediator. He wants to be seen that way. But I think that the US involvement generally in some of the international conflicts, I think people were surprised by how much it was willing to back Israel, how much it got involved in the Iranian conflict. So the pattern here seems to be that this administration is turning out to be a bit more sort of involved, a bit more internationalist than what the skeptics would have thought at the beginning of this term. So because Trump is a man who wants to be seen as a champion for peace. From a market economists perspective, even, is there greater clarity when it comes to geopolitical challenges? No, you know, there's not, but they never is. You know, one of my favorite things that I sort of use all the time is that history is better remembered than it's lived, which is that we think that we're living in a very geopolitically difficult environment currently, given what's going on. But having sort of, you know, just if you just look back at it and I've been following this for nearly 30 years here, that is that every moment always seems geopolitically fraught. Even the, you know, the very peaceful times of the 1990, which were considered like the peace dividend times, it always seems when you're living in the moment, there's always lots of uncertainty. Now, the good news is that 90% of the time, the uncertainty results the right way, which is that the worst case scenario is never quite transpire. So if you objectively look at the data today, if you look at the number of people who are dying in conflict, you know, like around the world, that's still relatively low compared to the long sweep of history. It's picked up compared to where we were ten, 20 years ago, but it is still relatively low. So we are still really that even though it sounds so difficult, we are living through still what is a relatively peaceful time despite these conflicts which are erupting in different parts of the world. And obviously the big headline one just now remaining is the Russia Ukraine one. But even here, as I said, that the that the details are scant. The progress seems to be limited. But I still feel the direction of travel is positive. So generally, I think that if you look at the long sweep of history, you look into the and what we have lived through as well. In the last 30 to 40 years in our living memories that this is still a relatively peaceful time. And let's not forget that in the past, even in the best of times, what appears to be the blue living through it, there appears to be a lot of uncertainty because we know the human mind is conditioned to thinking that we're going to move towards the worst case scenario. But 90% of the time, nothing close to the worst case scenario comes through. So I still feel that we are relatively okay. And if there's an upside surprise here, the biggest beneficiaries of this will really be Europe in terms of, you know, in the ending of the Russia-Ukraine conflict. Given the assumptions that you're making right now, how would you position in the market? But as I said, that I think that the reason, which is surprise on the upside from a market perspective this year has been Europe. And of course, it is concentrated very much in the first quarter of this year. But I still feel that Europe is a continent that everybody loves to discuss about, that this is a weak continent, it's economically weak. It's such a laggard compared to the U.S. when it comes to technology, when it comes to AI. All that's true. But I still feel that the maximum upside surprise because if you look at economic growth this year, it's been surprising gradually on the upside. So I'd say from a market perspective, if I'm correct, which is that there's upside surprises even from this conflict ending Europe is possibly the biggest beneficiary of it. Richard, just hang out. I just want to break some news right here. The high buoy surging for a third day pretty much across the ten is, of course, we've had repeated interventions, local dollar also bouncing again, high bar surging for a third day across those 10 hours. We'll bring you the latest details later on. Coming up, China's foreign minister, Wang Yi in India for the first time in three years amid warming ties for the two rivals. We'll look ahead to his meeting with Prime Minister Narendra modi later. Keep it here with us. This is back. We shared the confidence to dispel into Harris excellent cooperation and to consolidate the momentum of the improvement and development of China India relations so that while pursuing our respective rejuvenation, we can contribute to each other's success. Having seen a difficult period in our relationship, Excellency, our two nations now seek to move ahead. This requires a candid and constructive approach. India's external affairs Minister, Subrahmanyam Jaishankar and Chinese Foreign Minister Wang Yi, speaking at a meeting in New Delhi and Wang's visit to India, his first in three years, continues today as he's due to meet with Indian Prime Minister Narendra modi. The high profile meeting is the latest sign a thaw in relations between the rival nations as they push to normalize relations amid diplomatic tensions with the US. For more, let's bring in Bloomberg government reporter Sudeep Johnson in New Delhi City. What can we expect from Wang's meeting with Modi later today? Well, a couple of things you can expect from Wong's meeting with Prime Minister Modi. First, being there, go to that meeting and the meeting with the Indian foreign minister Subrahmanyam Jaishankar yesterday, and that with Ajit Doval today, India's national security adviser. All of this is going to set the tone for Prime Minister Modi's visit to China. Mind you, it is the first visit in seven years and that is also going to signal all that is going to be a big, you know, a big step, so to say, towards normalising of relationship. So these meetings are going to set the tone for the the meeting between President Xi Jinping and Prime Minister Modi later in this month. Also, you know, the entire issue of borders. We have heard both Indian foreign minister and the Chinese foreign minister saying that we need to get past that. So all these things are being worked out in these meetings. We also know that Modi spoke with President Putin on his recent peace talks with Trump. What do we know that? Well, I mean, it was a very interesting tweet that came out from Prime Minister Modi describing President Putin as a friend in Russia, do have a very strong and a very old relationship that's under strain. We have seen President Trump threatening penalties on India for buying Russian oil. India's continued to maintain that it'll buy oil wherever it finds is at the cheapest. So so there is that tension that is building up. And, you know, at the same point of time, we are seeing India China relations warming up. Whether there is a direct you know, the united. Trade policies and the right policies of the U.S. is, you know, triggering the rapprochement, so to say, between India, China and India. Russia coming a you know, getting closer. But that may not be the case. But what definitely is happening is that U.S. policies are adding more urgency to India, to China, to Russia to come together across the table and, you know, find out an accommodation between themselves. To the London tonight, government reporters. And thank you so much for that update. Let's get to Richard Sharma, chairman of Roc-A-Fella International and founder and CEO of Breakout Capital. He's still with us. This is a pragmatic reset. Do what you need to do to benefit from the relationships. It's a dramatic reset, I would say, because I know for a fact that even until about 3 to 4 months ago, the prime minister of India, Mr. Modi, he was very categorical. I know when he'd meet people about how letdown he had felt by Russia, by China, and by Xi Jinping in particular, because remember that you go back to a few years ago and the Prime Minister Modi was trying his best to sort of forge a very close relationship with Xi Jinping with China. You know, like all these images where they're reducing being came to India and they were both, you know, like it appeared to be sort of very close to each other and stuff. And then the Modi felt very let down personally about what China did in terms of on the border dispute and stuff. So for him, it was very personal. And I think that this is the point. I feel that a lot in the foreign policy domain, and I think we all like to do that, but we still don't that how personal some of these things can be. So which is that Prime Minister Modi felt extremely let down by China in terms of what he did and to 3 to 4 months ago in his private conversations, I know with people he was saying very categorically that I want nothing to do with China. And I feel very let down by what they have done. And that was reinforced by the Indo-Pak war which took place, the border war which took place, the operation centre which took place where the Pakistanis were supposed to have used extensively equipment supplied by China. So that was like the really low point of the relationship. And the Indian media, which tends to be very pro modi, they were all over in terms of China and dissing China and stuff of that. So this is a very dramatic reset that has happened, just to put it that this is not something which has been you know, this is like a complete pivot in terms of what Modi's been forced to do. Now, in terms of why Modi is doing this is also because of the fact of the way he's falling out with Trump. As we were just chatting about it during the break, that the two of them were extremely close, Modi and Trump in the first term of Trump, and that ended that way. Now, in the what happened was last year in September or so, and this is what I find that these personal stories we need to pay a bit more attention to, particularly given the character of each of these leaders that we have today. This cast of characters that we have today is that Modi had gone to America for, you know, in September last year, and he was scheduled to meet with both the candidates, then Kamala Harris and President Trump. At that point in time, it appeared that Kamala Harris was a bit ahead in the polls, in fact, there and a meeting I think was scheduled for both of them in in America. B, when Modi was visiting just before the election. And from what I'm told by various sources, is that the for for some reason, Kamala Harris had to cancel the meeting and she cited some scheduling conflicts. But President Trump then then the candidate, he was all keen to meet with Modi and he was all set to come to New York, I think like to meet with them. But for some reason, maybe to appear not to be too close to Trump and to be meeting only one of the two candidates. That meeting got cancelled and that, I'm told, sowed the seeds of, you know what, that after that has happened, which is in terms of this parting of ways between Modi and Trump, at least at a very personal level that's taken place. And then once again, you know, like Trump getting quite irritated that why is India and led by Modi disputing the fact that he was involved in the cease fire that took place between India and Pakistan, A very different version to come out of India. But from a US perspective, Trump took it almost personally. I'm told that India keeps disputing the fact that I played a role in brokering this cease fire, whatever he did. So it's really at some level, these are personal stories that in the first term, the two of them were bonding really well. It ended the relationship on a real high in 2020 and then in the in this term, just got off to a bad start, given what happened in September last year and then a progression of such sort of, you know, misunderstandings that seem to have taken place. These are very personal stories also being played out, not just analytical. If it is about personal relationship that was yes, then it is also about trust. And Modi has been burned by both Trump as well as Xi Jinping. How then does he built a relationship now, even with China? But I think that, you know, like he just now has to be sort of pragmatic, which is that if you look at India, it's foreign policy currently that, you know, like a year ago or. India was seen as almost the indispensable nation that everybody in the world really wanted, like to back India because of the fact that it was seen as the main country, which was, you know, which could stand up to China. And, you know, that was the calculation of a lot of the Western diplomats and stuff that, you know, like that India with the sought after nation and how India was able to manage this very tricky situation where it was buying Russian oil and selling it elsewhere and getting away with it despite the sanctions that Russia had. And then I think that it's been a very sharp turn around in terms of what India's foreign policy, what happened to it, where now today, I think, you know, like in India, there's a growing self-awareness that we don't have too many allies and don't have too many friends who are standing up for us. So what India is trying to do now is to build it block by block, get back to sort of building relations, because really, like a few weeks ago, it appeared that none of the major powers were standing up for India. And India, too, had gone about on the offensive after feeling so high about being the indispensable nation of lecturing Europe about how it should deal with its issues. And then they had the dispute with Canada and then on the border they were facing a lot of hostility from countries like Bangladesh and stuff. So it was sort of seemed to be sort of falling apart very quickly. But now what India's trying to do is get more pragmatic and build it one one block at a time. The thing is, there is a third party in China, India relations, and that's Pakistan, as you suggested earlier, how Pakistan is using Chinese weaponry with, you know, the defence chief of Pakistan making repeated visits to Washington. How do you see India navigating that relationship? Well, I think that as far as Pakistan is concerned, in terms of that, all of a sudden that's been the big change, too, because till six months ago, Pakistan was largely considered to be irrelevant. No one really spoke about Pakistan much, but they've been able to get themselves back, given how they have sort of dealt with the conflict which took place. So they will get back. But here I do feel that the onus is on China, because remember that what China needs to figure out here is the fact that. This is its opportunity. And China, remember, is also not a very trusted body in the region, but it clearly is the world's, you know, the other superpower. You have America and then you have China. But China now needs to sort of figure out that how does it build more allies? And in terms of their as far as Pakistan is concerned, the entire leverage is with China, because Pakistan in many ways is so much under the control of China because of what China supplies to Pakistan, because of China's involvement in Pakistan. So here, I think that it's really up to China, which is the fact that can China rise above this and sort of say that, okay, for us, you know, in terms of the fact that this is the time for us to build something with India, they seem to be under siege a bit, both from Pakistan and also from the bitter fallout with what's happened with America. So I think that it's for China to rise to the occasion here and not just rise with India, but in the region. You know, because as you know, whether it's the South South Sea or it's got to do with Philippines and stuff, there are many countries in the region which also don't trust China. So this is China's moment at a time when many countries are being felt, are feeling the so-called bullying, as China puts it, from America. It's for China to rise to the occasion. And I think that that's what we are seeing play out here. And we should not forgetting that us and China are still negotiating. They could strike a deal to the detriment of India. India could be isolated. India could be the loser in this. Yeah, but I too, as I said that, I think that, you know, this is for China to rise to the occasion. Right. Which is watch for China to sort of say, okay, like it's striking a deal there, but, you know, we have to take care of the countries in the region as well. And I think that like the other thing that I've been noticing as I've been traveling to the region that I've been here is that a lot of countries, whether it's Indonesia, whether it's Thailand, they're also facing the economic shock coming from China, which is that there's so much surplus capacity in China that they've been exporting that surplus capacity, and it's leading to the partial de-industrialization of these countries where the manufacturing sector and all are getting hit. So I think that this is like as much, you know, like about when you rise above this about China being the responsible power. And I think that what they're doing with India here is the right step, which is to sort of acting responsibility, because if any China wanted to today, if it was acting in its old ways, it could have given the shrug to India that, okay, fine, you know, like you sort of did what you did. And and now as far as they could coming back to us, why should we have to sort of reciprocate? But I think that this is China's rising to it, but it needs to show a much broader thing because until a few months ago, very few countries in the region even trusted China. Intricate rules, and you have to read with great interest. Richard. Hang tight. Richard Chalet, chairman of Rockefeller International, is staying with us. Let's he has to look at Indian markets just ahead of the open. India starts trading in about 3 minutes from here. Let's take a look at what the initial numbers are as we speak in terms of the Indian rupee. 8720 is the level we're looking at. It is down 2/10 of 1% versus in fact, it is up 2/10 of 1% versus the USD. And the stock market's looking pretty flat right now as we head to the India Open. Coming up, we'll shift our focus to tech. As SoftBank Group bets big on Intel's revival with a $2 billion stock purchase. More on that next. Keep it here with us. This is. Welcome back. You're watching INSIGHT. Some bank shares are under pressure this morning after it agreed to buy $2 billion worth of Intel stock at $23 a share. The investment boosts SoftBank's chip ambitions and delivers a strong vote of confidence in Intel, which has struggled to remain relevant in the air sphere. Meanwhile, Bloomberg has learned the Trump administration is in discussions to take a stake of about 10% in the chipmaker. Sources say the federal government is considering a potential investment that would involve converting some or all of the company's grants from the US Chips and Science Act into equity. Richard Sharma, chairman of Rockefeller International and founder and CEO of Breakout Capital, is still with us. It is quite interesting. You've written about, you know, the future of capitalism. And here we have a U.S. government that's taking a stake in Intel, also taking part of the revenue from H20 chip sells to China. I mean, how are you reading into this? But I think that the point that I outlined in the book that as you mentioned, about what went wrong with capitalism is the fact that what we have today really is not capitalism in terms of this is a very distorted form of capitalism. And this progression has been happening steadily for the last few years. In fact, I would argue that it's been happening for the last century or so, that the capitalism that the founders had in mind very, pretty much have free markets. And then you just, you know, let the private sector do what it wants, but very minimal involvement of the government. That used to be the case in the first 200 years of capitalism, where right up until the Great Depression, when government spending as a share of GDP was just 3% or so in places like America, 3% today, we are now hitting nearly 40% in terms of government spending as a share of GDP in a straight line up since then. Right. So that's been happening. And then if you look at the government's involvement in the economy, if the number of new regulations that the government puts in, about 3000 new regulations a year in America, and that and hardly any regulations are ever withdrawn once they're put, In fact, I think the last 20 years, only about 20 regulations or so have been withdrawn. So that's what's happened. The third point being that the governments now like the ability and the government's willingness to bail out private sector companies, that was considered heretical in America. Right up until the 1970s, there were no bail outs or private sector companies in America. But from the 1980s onwards, beginning with continental Illinois in 1984, the government has gotten progressively bigger in terms of its role in bailing out companies or entire sectors. Of course, 2008 being the classic case, but generally of bailing out regulated companies. Now, as you're pointing out, the latest instance being that the government wants to sort of participate even in the private sector's profits at some point in time. So this is the progression that we have seen of the government's involvement in the economy on every front. And also when we speak about this, about the Fed in terms of the fact that, you know, that the Fed's sort of mission creep, how its got involved much more and more like in the economy on whether it's buying Treasuries or what sort of mandate it pursues and also the asymmetrical bias, which is a and I think that this has been the biggest distortion of capitalism, and maybe that's what they're trying to correct with this latest deal. Otherwise, my sort of view is that on the downside, the government is always there to protect you. Slightest hint of trouble, the Fed, the government, or we are here to protect you. On the upside, the private sector would make whatever profits they wanted to. So you had this massive asymmetry. And maybe what we are seeing now with this deal that you spoke about is a slight correction in this asymmetry, but the wrong way, which is instead of the government letting companies fail on the downside because that's what leads to greater dynamism. But now what you're seeing is that the government saying, okay, maybe on the upside also will participate a bit since we help you so much on the downside. But is it wrong to then draw comparisons between what is happening increasingly in the US with what's been happening in China? Yeah, that's right. But I think in China's case it's very interesting that they come from very different starting points because remember that China right up until the 1970s there was no private sector and then from the 1980s onwards, as the government sort of let go, the private sector in China completely boomed. Right. And now in the Xi Jinping of the last few years, we have seen once again the state get a bit more involved. The massive expansion of the private sector is being curtailed a bit with the state getting more involved. Right. That's the broad pattern we've seen in the US. What we are seeing is that this was the capitalists, this was seen to be like, okay, this is where we sort of believe in capitalism. They were going the other way and it's been happening progressively over time, which is that from being a completely free market, minimal government state, we've been going progressively towards the government getting bigger and bigger. Its size and the economy, its role in the economy. So these are very I know like so maybe they go to meet at some point in time, as users suggest, but they come from very different starting points. And I think that that's what we have to distinguish out here. But the bottom line is this, that this massive increase in government intervention in the economy in the US is leading to what I think is declining productivity growth over time because there's less dynamism. The it's keeping alive a lot of artificially a lot of companies, an artificial support, what I refer to as zombie companies in the book. And I think that this is not good for capitalism and why also so many people wanting to sort of into the system feel that they're being shut out because of the fact that there's so much dead wood still floating in the system. So this is a perversion of capitalism that we are seeing step by step. Raji The other theme that's really prominent right now is this A.I. war, that ship war between the US and China about who's winning, who's not, what the implications are. How crucial is it if China were to win this race? I mean, how would that transform? How would the world look like? Well, I think that that would be like a big leap forward. But the markets don't believe that today because it'll be had the whole deep, deep sea sort of fear, you know, like which came into the market at the end of Jan in early fib. But if you look at the performance of markets, they are in fact, I would say that the US market is being propped up only because of the complete belief that America is going to dominate on the air race. Right, Because a lot of people have asked me this question that Trump has gone ahead and imposed these incredible tariffs. Remember that the tariff rate today is not that far away from what was suggested in the worst case scenario is on Liberation Day. Right? On that day, the tariff rate, the effective tariff rate was estimated to be close to 20%. We are nearly there in terms of what the effective tariff rate is, and yet the US economy, even the global economy, has held up well. And I'd say the main reason for that is because of this incredible belief that there is no problem in the world that I cannot solve and America will be at the leading edge of solving any problem in terms of because productivity boost coming from air will be incredible. So as far as the markets are concerned, they are still betting on the fact that America is going to win this air race, that the adoption rates in America, the technological edge that America has, is going to be incredible. So you can argue that's the wrong view. But as of now, the market's view is very clear that the only thing which matters is a, I guess, for the American market is concerned about three quarters of the entire return of the American market this year can be explained by just the air companies or the air team, so to speak. So this is very much an American market that is hanging on to the air belief and the fact that the world is believing. And why is too much capital still going to America, despite what Trump is doing and attempts to sort of even devalue the dollar is because of the fact that the world itself, including Middle Eastern and other people, believe that America is going to be the dominant winner of the race in 30 seconds. It means essentially that you still believe and still buy into Mach seven of. That's what the market is doing to the. Yes, because they believe that these guys are spending a lot, but they have so much of cash flow and so much of cash reserves that they can get away with spending these incredible amounts. Now, I don't believe that this is going to sustain. I do believe that there's a lot of hype about this. And eventually so much of investment will lead to malinvestment, just like the 2000 dotcom bubble. But for now, the entire reason why the tariffs and all are being overshadowed and even Trump is being overshadowed is because there's a larger force at work, which is A.I.. All right. For now, that's the operative sense right here. Richard Sharma, Chairman Rockefeller International, thank you so much for your insights today. Before we go, here's a preview of tomorrow's show. We'll speak exclusively with Bank of Thailand deputy governor. We'll hear his outlook for monetary policy and the economy. Keep it here with us. This is Glenn back.",
  "medium": "Video",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.97998046875
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.94970703125
    },
    {
      "name": "/People & Society/Social Sciences/Political Science",
      "score": 0.87158203125
    },
    {
      "name": "/Sensitive Subjects/War & Conflict",
      "score": 0.47412109375
    },
    {
      "name": "/News/World News",
      "score": 0.40185546875
    }
  ],
  "sentiment": {
    "positive": 0.121159464,
    "negative": 0.5451243,
    "neutral": 0.3337163
  },
  "summary": "President Trump is increasing efforts to broker peace between Russia and Ukraine, with plans to hold a one-on-one meeting with Russian President Vladimir Putin and Ukrainian leader Vladimir Zelensky. This follows a summit with Ukrainian and European leaders in Washington, which ended with a call for a summit. Meanwhile, India and China are moving closer, with Indian Prime Minister Narendra Modi set to meet with China's top diplomat. BHP, the world's largest miner, reported a 26% drop in underlying profit for the full year, and BHP CEO Mike Henry said its key exports, iron ore and coal, remained under pressure. Despite this, there are still significant hurdles for a peace deal between Ukraine and Russia, including territory and security guarantees.",
  "shortSummary": "President Trump is advancing peace efforts with Russia and Ukraine, while India and China face off, impacting investor sentiment and potential US involvement.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "04595cd53a154f888f977e01e17da70a",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "The broadcast covers a range of global economic and geopolitical topics, beginning with President Trump’s renewed effort to broker a Ukraine peace deal with Zelensky and Putin, and noting the limited progress and ongoing uncertainties. It reports BHP’s earnings decline amid commodity price pressures while highlighting the company’s growth plans in iron ore, copper and potash. The segment also covers a thaw in India–China relations, with Modi’s visit to China and discussions of border and trade issues, and a SoftBank investment in Intel that signals U.S. government interest in the chip sector. Finally, the show features commentary on the expanding role of government in the economy, critiques of modern capitalism, and the high‑stakes U.S.–China AI competition, underscoring the broader economic and strategic shifts shaping the world today.",
  "argos_id": "9EY9ZF1G1"
}