{
  "url": "https://www.cleveland.com/advice/2025/08/dear-annie-decades-after-breaking-off-our-engagement-my-former-fiance-is-making-my-life-uncomfortable.html",
  "authorsByline": "Dear Annie, dear-annie, Dear Annie | mrose@cleveland.com",
  "articleId": "611a3e7deb4847fa894159e054e83ed4",
  "source": {
    "domain": "cleveland.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "OH",
      "county": "Cuyahoga County",
      "city": "Cleveland",
      "coordinates": {
        "lat": 41.4996574,
        "lon": -81.6936772
      }
    }
  },
  "imageUrl": "https://www.cleveland.com/resizer/v2/6PWAWGTKTFHOZF4VJALHFHE3VU.png?auth=90912d1a3bfc5998cf6cfab1ce6f47e617eb137d87e48fae0600341aca4fda0b&width=1280&quality=90",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-25T04:05:00+00:00",
  "addDate": "2025-08-25T04:26:36.802367+00:00",
  "refreshDate": "2025-08-25T04:26:36.802368+00:00",
  "score": 1.0,
  "title": "Dear Annie: Decades after I broke off our engagement, my former fiancé is making my life uncomfortable",
  "description": "Dear Annie, I cannot help but feel unsettled by my former fiancé's presence. I want to make it clear that this is over and there is nothing to discuss.",
  "content": "Over the past two years, I have started seeing him around town, at the grocery store, at church. He stares at me in a way that makes me deeply uncomfortable. AP\n\nDear Annie: I need advice on how to deal with a former fiancé. We dated for nearly a year before getting engaged, but the engagement lasted only a few months. Once we were engaged, he began laying down expectations for our future: dinner on the table at 5, how many children we would have, even which promotions I should turn down at work. I am a health professional with two graduate degrees, and our outlooks on life could not have been more different. I ended the engagement.\n\nAt the time, he told me I would regret it. I never have, not for a single moment. I have been happily married for over 30 years.\n\nHe eventually married as well, but I recently learned his wife passed away six years ago. Over the past two years, I have started seeing him around town, at the grocery store, at church. He stares at me in a way that makes me deeply uncomfortable. When we cross paths, I say a polite hello and move on, but he deliberately walks in front of me or lingers nearby so I will notice him. I have no interest in reconnecting.\n\nHe is 67, and I am 70. I know he has family two hours away where his parents and wife are buried. I cannot help but feel unsettled by his presence. I want to make it clear that this is over and there is nothing to discuss.\n\nHow can I send that message firmly but respectfully? -- It Is Over\n\nDear Over: You have every right to feel unsettled. Your former fiancé may be lonely or nostalgic, but that does not give him permission to make you uncomfortable.\n\nYou ended that relationship decades ago and moved on with your life. A simple hello is more than enough. You do not owe him conversation, closure or curiosity.\n\nIf his presence begins to feel intrusive or persistent, you have a few options. Keep your distance when possible, and if he tries to approach you directly, look him in the eye and say, “Please respect my space. I have no interest in reconnecting.” You do not need to explain or justify yourself.\n\nShould the behavior escalate or continue, do not hesitate to speak with a pastor, store manager or even law enforcement. Being polite does not mean tolerating discomfort.\n\nThis chapter closed a long time ago. It is perfectly fine to keep it that way.\n\n“How Can I Forgive My Cheating Partner?” is out now! Annie Lane’s second anthology -- featuring favorite columns on marriage, infidelity, communication and reconciliation -- is available as a paperback and e-book. Visit Creators Publishing for more information. Send your questions for Annie Lane to dearannie@creators.com.",
  "medium": "Article",
  "links": [
    "https://www.cleveland.com/advice/2025/08/dear-annie-my-best-friend-has-had-no-time-for-me-since-she-started-dating.html",
    "https://www.cleveland.com/advice/2025/08/dear-annie-my-sister-has-worn-out-her-welcome-how-do-i-nicely-get-her-to-move-out.html",
    "http://creators.com/",
    "https://www.cleveland.com/topic/dear-annie/",
    "https://www.cleveland.com/advice/2025/08/dear-annie-im-worried-that-guys-night-has-become-something-more-concerning.html",
    "https://www.cleveland.com/advice/2025/08/dear-annie-my-husband-is-finally-getting-the-care-he-needs-but-his-family-blames-me-for-the-distance-between-them.html",
    "https://www.cleveland.com/advice/2025/08/dear-annie-our-son-graduated-college-two-years-ago-and-still-hasnt-found-a-job.html",
    "http://www.creatorspublishing.com/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Annie Lane",
      "weight": 0.06707367
    },
    {
      "name": "store manager",
      "weight": 0.06421024
    },
    {
      "name": "more information",
      "weight": 0.06142571
    },
    {
      "name": "Creators Publishing",
      "weight": 0.057432372
    },
    {
      "name": "favorite columns",
      "weight": 0.056501478
    },
    {
      "name": "Dear Annie",
      "weight": 0.05639253
    },
    {
      "name": "life",
      "weight": 0.05370473
    },
    {
      "name": "Annie",
      "weight": 0.052390665
    },
    {
      "name": "town",
      "weight": 0.04976656
    },
    {
      "name": "wife",
      "weight": 0.048758928
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/People & Society/Family & Relationships/Troubled Relationships",
      "score": 0.580078125
    },
    {
      "name": "/People & Society/Family & Relationships/Romance",
      "score": 0.52490234375
    }
  ],
  "sentiment": {
    "positive": 0.07763698,
    "negative": 0.6157522,
    "neutral": 0.30661076
  },
  "summary": "A woman who broke off her former fiancé decades ago has become increasingly uncomfortable with seeing him, making her life uncomfortable. She dated for nearly a year before getting engaged but ended the engagement after only a few months. Her ex-fiancé, who was also married, began laying out expectations for their future, such as dinner on the table at 5, how many children they would have, and which promotions I should decline at work. Despite this, she has been happily married for over 30 years and has no intention of reconnecting with him. If his presence becomes intrusive or persistent, keep your distance when possible and speak with a pastor, store manager or law enforcement if it escalates.",
  "shortSummary": "A former fiancé, now 70, is making his life uncomfortable by repeatedly staring at him, prompting advice from Annie Lane.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "accf15b99c124ad0bd9073886d0e08d2",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.cleveland.com/topic/dear-annie/",
      "text": "dear annie\nDear Annie: Decades after I broke off our engagement, my former fiancé is making my life uncomfortable\nDear Annie, I cannot help but feel unsettled by my former fiancé's presence. I want to make it clear that this is over and there is nothing to discuss.\nDear Annie: Our son graduated college two years ago and still hasn’t found a job\nIn today's Dear Annie column, Annie Lane has advice for two parents who worry their son is being too picky about his career choices and will only harm himself in the long run.\nDear Annie: My husband is finally getting the care he needs, but his family blames me for the distance between them\nIn today's Dear Annie column, Annie Lane hears from a concerned - and tired - wife whose husband finally is getting the health care he needs after a bad first marriage.\nDear Annie: My best friend has had no time for me since she started dating\nDear Annie, when I tried telling my friend I miss hanging out with her, her response was to joke with me not to be jealous of her new relationship.\nDear Annie: My sister has worn out her welcome. How do I nicely get her to move out?\nDear Annie: My sister's \"one-month\" stay looks to have no end in sight. Help me give her the push she needs.\nDear Annie: I’m worried that guys night has become something more concerning\nIn today's Dear Annie column, Annie offers advice to a woman feeling more and more excluded from her fiancé's life as their wedding gets closer.\nDear Annie: Dealing with my father’s anxiety issues is exhausting\nIn today's Dear Annie column, Annie offers advice for a reader on how to help their elderly father with his chronic anxiety.\nDear Annie: When did friendships become so one-sided?\nDear Annie: I'm always there for my friends, but not one of them was there for me when I needed them.\nDear Annie: I don’t know what my future son-in-law’s problem is\nIn today's Dear Annie column, Annie Lane offers advice to an engaged woman who is trying to maintain her peace while dealing with her future son-in-law.\nBest of Dear Annie: Recovering accident victim stuck dealing with noisy neighbors\nTake a look back at a recently published Dear Annie column where Annie tries to help the resident of a small apartment building who is trying to recover from an accident while also dealing with noise from hostile neighbors.\nDear Annie: Here’s how I got my husband to show appreciation the hard way\nIn today's Dear Annie column, Annie Lane shares a letter from a reader whose husband never reciprocated her actions on special occasions until she gave him a taste of his own medicine.\nDear Annie: My family vacations are more stressful than relaxing\nDear Annie: Frustrated mom ends up more tired after vacations than she was before they started."
    },
    {
      "url": "http://creators.com/",
      "text": "Our goal is to make you think. We want you to react. We want you to respond.\nSince 1987, the writers we represent and publish start discussions, arguments and even controversies. Love them or hate them, you can’t ignore them.\nBeginning with print and evolving into digital, Creators has been at the forefront of the media industry. We have been disrupting the status quo since our company was founded on the premise that creators should own their work, characters and ideas. Decades later, we continue to evolve as society pushes forward and technology changes.\nAt Creators, we support creators.\nDesigned and developed by New & Co.\nCreators Syndicate, Inc. © 2025"
    },
    {
      "url": "https://www.cleveland.com/advice/2025/08/dear-annie-im-worried-that-guys-night-has-become-something-more-concerning.html",
      "text": "Dear Annie: My fiancé, “Mark,” and I have been together for four years and are set to get married next spring. We live together in a small house we bought last fall. For the most part, things are good. But lately, something’s been bothering me.\nMark has a weekly “guys’ night” every Thursday with his two best friends from college. It used to be every other week, but now it’s weekly, and sometimes even more often. I’ve asked if I could come by to say a quick hello or drop something off, and he always says not to -- it’s their “tradition.”\nLast Thursday, I found a receipt in the laundry from a wine bar downtown. He told me they were at Jake’s house playing cards. When I asked about the receipt, he brushed it off and said they stopped there first, which he “forgot” to mention.\nI haven’t seen anything else suspicious, but it’s starting to feel like I’m being excluded on purpose. Am I overreacting, or should I trust my gut? -- Future Mrs. or Fool?\nDear Future Mrs. or Fool: These don’t scream red flags -- maybe orange -- but it’s smart to trust your instincts. Mark is allowed time with his friends, but it shouldn’t come at the cost of your peace of mind. If you haven’t already, you need to tell him how this is affecting you.\nKeep your tone curious, not accusatory. Try something like, “I felt a little left out after Thursday night. I know it’s your guys’ time, but I’ve been feeling uneasy and just wanted to talk about it.” That kind of approach invites honesty without putting him on the defensive.\nThis doesn’t have to be about spying or catching him in a lie; it’s about feeling connected. A good partner won’t dismiss that. And who knows? A little nudge might even open the door to a better understanding of what guys’ night is all about.\nRead other recent Dear Annie columns\n- Dear Annie: Our son graduated college two years ago and still hasn’t found a job\n- Dear Annie: My husband is finally getting the care he needs, but his family blames me for the distance between them\n- Dear Annie: My best friend has had no time for me since she started dating\n- Dear Annie: My sister has worn out her welcome. How do I nicely get her to move out?\n- Dear Annie: Dealing with my father’s anxiety issues is exhausting\nView prior ‘Dear Annie’ columns\n“How Can I Forgive My Cheating Partner?” is out now! Annie Lane’s second anthology -- featuring favorite columns on marriage, infidelity, communication and reconciliation -- is available as a paperback and e-book. Visit Creators Publishing for more information. Send your questions for Annie Lane to dearannie@creators.com.\nCOPYRIGHT 2025 CREATORS.COM"
    },
    {
      "url": "https://www.cleveland.com/advice/2025/08/dear-annie-my-sister-has-worn-out-her-welcome-how-do-i-nicely-get-her-to-move-out.html",
      "text": "Dear Annie: My sister, “Laura,” recently moved back to town after her divorce and has been staying with me and my husband “just for a month” while she looks for a new apartment. That was in April. It’s now August, and she’s made no effort to move out.\nShe’s sweet with our kids and helps out here and there, but she also leaves dishes in the sink, uses my clothes without asking and has basically turned our guest room into her full-time space. Last week, I overheard her on the phone telling someone she’s “staying with family indefinitely.”\nMy husband is starting to lose patience, and honestly, so am I. But every time I try to bring up a timeline for her leaving, she gets teary and says she’s “trying” and just needs more time. I want to be supportive -- she went through a rough breakup -- but I’m starting to feel like she’s taking advantage of our kindness.\nHow do I set a boundary without sounding cold? I love my sister, but I also want my home (and my closet) back. -- Overdue Houseguest\nDear Overdue: Sounds like your sister is lonely, heartbroken and, yes, taking advantage of your generosity. You can be supportive without letting her steamroll your life and your home. If you don’t speak up, you’ll only grow more resentful -- which will be tougher on everybody.\nHave a calm conversation with her. Be honest, not harsh. Try something like, “I know this has been a tough season for you, and I’m glad we’ve been able to help. But we need our space back, and I’d like us to figure out a move-out plan together.”\nBeing clear doesn’t make you unkind. It makes you a grown-up with a family and a home to protect.\nRead other recent Dear Annie columns\n- Dear Annie: Our son graduated college two years ago and still hasn’t found a job\n- Dear Annie: My husband is finally getting the care he needs, but his family blames me for the distance between them\n- Dear Annie: My best friend has had no time for me since she started dating\n- Dear Annie: I’m worried that guys night has become something more concerning\n- Dear Annie: Dealing with my father’s anxiety issues is exhausting\nView prior ‘Dear Annie’ columns\n“How Can I Forgive My Cheating Partner?” is out now! Annie Lane’s second anthology -- featuring favorite columns on marriage, infidelity, communication and reconciliation -- is available as a paperback and e-book. Visit Creators Publishing for more information. Send your questions for Annie Lane to dearannie@creators.com.\nCOPYRIGHT 2025 CREATORS.COM"
    },
    {
      "url": "https://www.cleveland.com/advice/2025/08/dear-annie-our-son-graduated-college-two-years-ago-and-still-hasnt-found-a-job.html",
      "text": "Dear Annie: My 23-year-old son graduated from college two years ago and has been unemployed ever since. He earned a degree in a competitive field but has not had any luck landing a job in his chosen profession. While we understand that finding the right opportunity can take time, we are growing increasingly concerned.\nHe refuses to consider any kind of job outside of his intended career path, insisting that if he takes something “beneath him,” he will get stuck and never leave. We have tried reasoning with him, encouraging him to gain experience, even if it is unrelated, to avoid having a completely blank resume. We have offered suggestions, networking opportunities and moral support, but he will not budge.\nHe still lives at home, which we do not mind, within reason, but the money he saved while working part time in college is running out fast. It is frustrating to watch him stagnate while the months go by. He says he is waiting for the “right fit,” but we worry he is letting pride or fear hold him back.\nHow do we help him see that some kind of work, any work, is better than no work at all? And how do we support him without enabling this pattern? I admire your insight and would truly appreciate any words of wisdom for both him and us. -- Worried Parents in Limbo\nDear Worried: You are right to be concerned. A two-year gap on a resume, especially in those early post-grad years, can be hard to explain later. While it is admirable that your son wants to pursue work in his chosen field, his refusal to take any job in the meantime is shortsighted and, frankly, self-sabotaging.\nWork is more than a title. It teaches discipline, builds character and often leads to unexpected opportunities. No one’s first job out of college defines their entire future. What does shape the future is sitting at home waiting for perfection. That is not strategy; it is fear wearing a mask of pride.\nLet your son know that while you love him, the time for passivity has passed. He needs to contribute, either by working, volunteering, interning or even pursuing additional training. And if his savings are dwindling, it may be time to start charging rent -- not as punishment, but to nudge him toward reality.\nSometimes, the most loving thing a parent can do is stop cushioning the fall.\nRead other recent Dear Annie columns\n- Dear Annie: My husband is finally getting the care he needs, but his family blames me for the distance between them\n- Dear Annie: My best friend has had no time for me since she started dating\n- Dear Annie: My sister has worn out her welcome. How do I nicely get her to move out?\n- Dear Annie: I’m worried that guys night has become something more concerning\n- Dear Annie: Dealing with my father’s anxiety issues is exhausting\nView prior ‘Dear Annie’ columns\n“How Can I Forgive My Cheating Partner?” is out now! Annie Lane’s second anthology -- featuring favorite columns on marriage, infidelity, communication and reconciliation -- is available as a paperback and e-book. Visit Creators Publishing for more information. Send your questions for Annie Lane to dearannie@creators.com.\nCOPYRIGHT 2025 CREATORS.COM"
    },
    {
      "url": "https://www.cleveland.com/advice/2025/08/dear-annie-my-best-friend-has-had-no-time-for-me-since-she-started-dating.html",
      "text": "Dear Annie: My best friend recently started dating someone new, and ever since, she’s become distant. We used to talk daily; now I’m lucky if she texts back within a week. When we do hang out, he always tags along, even for things we used to do just the two of us.\nI’m happy she’s found someone she likes, but I miss our friendship. I tried mentioning it once, and she just laughed and said, “Don’t be jealous!” I wasn’t trying to start a fight; I just wanted her to know I feel left out.\nShould I bring it up again or just let it go? -- Third Wheel\nDear Third Wheel: Relationships can be all-consuming, especially at the beginning, but they’re not a substitute for friendship.\nFocus on a small, concrete ask: “I’m happy for you, but I miss spending time just us. Can we make a plan soon -- just the two of us?”\nIf she brushes you off again or keeps making you feel like an afterthought, it might be time to invest more energy into friendships that go both ways.\nRead other recent Dear Annie columns\n- Dear Annie: Our son graduated college two years ago and still hasn’t found a job\n- Dear Annie: My husband is finally getting the care he needs, but his family blames me for the distance between them\n- Dear Annie: My sister has worn out her welcome. How do I nicely get her to move out?\n- Dear Annie: I’m worried that guys night has become something more concerning\n- Dear Annie: Dealing with my father’s anxiety issues is exhausting\nView prior ‘Dear Annie’ columns\n“How Can I Forgive My Cheating Partner?” is out now! Annie Lane’s second anthology -- featuring favorite columns on marriage, infidelity, communication and reconciliation -- is available as a paperback and e-book. Visit Creators Publishing for more information. Send your questions for Annie Lane to dearannie@creators.com.\nCOPYRIGHT 2025 CREATORS.COM"
    },
    {
      "url": "https://www.cleveland.com/advice/2025/08/dear-annie-my-husband-is-finally-getting-the-care-he-needs-but-his-family-blames-me-for-the-distance-between-them.html",
      "text": "Dear Annie: I met my husband three years ago, about eight months after he lost his first wife of 20 years. Their marriage was often toxic, and she was very abusive toward him. After she passed, he was ready to move on.\nRight away, I knew something wasn’t right with my husband. In his mid-50s, he was having short-term memory issues, falling frequently and struggling with his mental health. After seeing his health care provider and enrolling in the Veterans Affairs health care system, we discovered he had suffered multiple traumatic brain injuries during his time in the Army. That diagnosis led to him becoming a 100% service-connected disabled veteran and allowed him to receive the care he needed for a better quality of life.\nHis family, however, waged a war against me for helping him, accusing me of manipulating and “brainwashing” him. My husband has distanced himself from them, and we’re no longer on speaking terms. My husband has a lot of anger toward them as he suffered for decades without their help or support.\nHis parents, who live in another state, are elderly and in poor health. I fear that if he doesn’t reconcile with them before they pass, he will resent me. I love my husband with all my heart, and this has been a hard road. I just want the very best for him, unconditionally. Any advice? -- Wife on the Defensive\nDear Wife on the Defensive: You’ve been an incredible source of support for your husband. You recognized he was suffering and helped him get the care he so clearly needed. That’s not brainwashing; that’s being a spouse through good and bad, in sickness and in health.\nIt’s understandable to worry he might one day regret cutting ties with his parents, but reconciliation isn’t something you can or should force. That decision is up to your husband. If he ever expresses interest in reaching out to them again, support him gently. If not, trust that he’s made peace with that choice and knows what’s best for him, even if it’s painful.\nRead other recent Dear Annie columns\n- Dear Annie: Our son graduated college two years ago and still hasn’t found a job\n- Dear Annie: My best friend has had no time for me since she started dating\n- Dear Annie: My sister has worn out her welcome. How do I nicely get her to move out?\n- Dear Annie: I’m worried that guys night has become something more concerning\n- Dear Annie: Dealing with my father’s anxiety issues is exhausting\nView prior ‘Dear Annie’ columns\n“How Can I Forgive My Cheating Partner?” is out now! Annie Lane’s second anthology -- featuring favorite columns on marriage, infidelity, communication and reconciliation -- is available as a paperback and e-book. Visit Creators Publishing for more information. Send your questions for Annie Lane to dearannie@creators.com.\nCOPYRIGHT 2025 CREATORS.COM"
    }
  ],
  "argos_summary": "A woman who ended an engagement decades ago now feels uneasy when her former fiancé, who is widowed, appears in public. She asks how to firmly but respectfully assert that the relationship is over. The column advises setting boundaries, saying a concise statement, and seeking help from authorities if the behavior persists. It also includes other Dear Annie letters on various personal issues.",
  "argos_id": "9WEJ337GR"
}