{
  "url": "https://www.morningstar.com/news/dow-jones/20250825307/china-property-stocks-power-up-as-traders-bet-on-stimulus",
  "authorsByline": "",
  "articleId": "13e272d79fbe47f8a72dd3029549c858",
  "source": {
    "domain": "morningstar.com",
    "location": {
      "country": "us",
      "state": "IL",
      "county": "Cook County",
      "city": "Chicago",
      "coordinates": {
        "lat": 41.8755616,
        "lon": -87.6244212
      }
    }
  },
  "imageUrl": "https://images.contentstack.io/v3/assets/blt4eb669caa7dc65b2/blta7dd42ebdd7b93b8/61899b34a3c7df383578294c/morningstar-og.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-25T00:36:00-05:00",
  "addDate": "2025-08-25T05:57:51.582360+00:00",
  "refreshDate": "2025-08-25T05:57:51.582363+00:00",
  "score": 1.0,
  "title": "China Property Stocks Power Up as Traders Bet on Stimulus",
  "description": "",
  "content": "Chinese property stocks rose sharply at the start of the week, as measures to boost home buying in Shanghai reinforced stimulus hopes.\n\nBuilding expectations that Chinese policymakers will ramp up support for the beleaguered sector has been lifting developers' shares recently, despite some downbeat earnings reports from major developers.\n\nThe Hang Seng Mainland Properties Index, a gauge of developers in Hong Kong, was up 4.4% by midday Monday.\n\nThat came as Shanghai authorities waived property taxes for certain eligible residents buying their first apartment, and lifted restrictions on the number of units buyers can purchase in sub-urban areas of the city. The moves followed similar easing of home-buying curbs announced in Beijing a few weeks ago.\n\nWhile the measures are unlikely to significantly improve sluggish sales, they suggest increasing policy momentum, analysts say.\n\n\"It's a sign that the Chinese government is acknowledging there might be some pressure for the sector in the second half, and the market may have more hopes for more stimulus in the near future,\" Daiwa analyst William Wu said.\n\nDeveloper China Vanke led the property stock charge in Hong Kong, rising 15% to HK$5.97--on track for its largest one-day gain since February. That came after it reported a drop first-half revenue and a widened loss.\n\n\"Vanke's rally may reflect investors' optimism on the firm's liquidity profile, as it continues to receive funding support from largest shareholder Shenzhen Metro and financial institutions,\" Morningstar equity analyst Jeff Zhang said.\n\nThe company has received roughly 24 billion yuan of loans, or about US$3.35 billion, from state-owned enterprise Shenzhen Metro, Vanke said in a filing on Friday.\n\nIt has also repaid 24.39 billion yuan of public debt and doesn't have any offshore obligations due before 2027, the filing showed.\n\nStill, it will take some time for Vanke to make a meaningful recovery, Zhang said, expecting the developer to remain lossmaking until 2027.\n\nWhile acknowledging that it remains under pressure, Vanke said that government \"policies have continuously shown positive signals, promoting the recovery and stabilization of the real estate market.\"\n\nOther Chinese property stocks were also higher in the first session of the week, aided by a broader upswing in market sentiment by firming hopes of Federal Reserve rate cuts that typically boost appetite for equities.\n\nSunac China was up 12%, while Sino-Ocean traded 10% higher. Ke Holdings and Kaisa Group gained 8.6% and 7.95%, respectively. Longfor Group rose 6.7%.\n\nThe Chinese property sector's recent outperformance is mostly attributable to the rebuilding of policy expectations, HSBC analysts said in a recent report.\n\nBut there's more to it than that, Michelle Kwok and others wrote. Some stocks have re-rated on better fundamentals and an earnings recovery.\n\nStill, it's far from \"a rising tide lifts all boats\" scenario, as even state-owned enterprises find themselves in varying degrees of operational inflection, HSBC said. \"The appeal of stocks lower on the quality curve lies in their potential turnaround if there's further stimulus.\"",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Chinese property stocks",
      "weight": 0.08887614
    },
    {
      "name": "China Property Stocks",
      "weight": 0.0846065
    },
    {
      "name": "Other Chinese property stocks",
      "weight": 0.08411013
    },
    {
      "name": "Developer China Vanke",
      "weight": 0.07841284
    },
    {
      "name": "China Vanke",
      "weight": 0.06735865
    },
    {
      "name": "property taxes",
      "weight": 0.06571408
    },
    {
      "name": "stimulus hopes",
      "weight": 0.0650434
    },
    {
      "name": "Morningstar equity analyst Jeff Zhang",
      "weight": 0.064531624
    },
    {
      "name": "more stimulus",
      "weight": 0.06412326
    },
    {
      "name": "stocks",
      "weight": 0.06356121
    }
  ],
  "topics": [
    {
      "name": "Stimulus"
    },
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.94140625
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.7724609375
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.701171875
    },
    {
      "name": "/Real Estate/Other",
      "score": 0.66650390625
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.61181640625
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.51171875
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.403076171875
    },
    {
      "name": "/Real Estate/Property Development",
      "score": 0.3193359375
    }
  ],
  "sentiment": {
    "positive": 0.8892769,
    "negative": 0.03976499,
    "neutral": 0.07095802
  },
  "summary": "Chinese property stocks have surged as measures to boost home buying in Shanghai reinforce stimulus hopes. The Hang Seng Mainland Properties Index, a gauge of developers in Hong Kong, was up 4.4% by midday Monday. Shanghai authorities have waived property taxes for certain eligible residents buying their first apartment and reduced restrictions on the number of units buyers can purchase in sub-urban areas. Developer China Vanke led the rally, rising 15% to HK$5.97, on track for its largest one-day gain since February. Other Chinese property stocks also rose, with Sunac China up 12%, and Sino-Ocean trading 10% higher. The recent surge is largely attributed to rebuilding of policy expectations.",
  "shortSummary": "Chinese property stocks rose sharply as stimulus measures boosted investor confidence, despite downbeat earnings reports and ongoing government support for real estate.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "d552d586b959403cb847c0cea4758a81",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Chinese property stocks surged early in the week as Shanghai’s tax waivers and relaxed purchase limits signaled renewed policy support, lifting the Hang Seng Mainland Properties Index 4.4%. China Vanke led the rally with a 15% jump, buoyed by liquidity from Shenzhen Metro and a strong debt‑repayment record, while other developers such as Sunac, Sino‑Ocean, Ke Holdings and Kaisa also posted gains. Analysts note that the gains reflect growing stimulus expectations and improving fundamentals, though many firms remain loss‑making and the sector still faces significant challenges.",
  "argos_id": "9YRWC9HQR"
}