{
  "url": "https://www.benzinga.com/pressreleases/25/08/g47300830/sco-film-and-television-week-kicks-off-in-qingdao-connecting-the-world-through-cinema",
  "authorsByline": "Globe Newswire",
  "articleId": "3197f247209a438ba73408c1b7556739",
  "source": {
    "domain": "benzinga.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "MI",
      "county": "Wayne County",
      "city": "Detroit",
      "coordinates": {
        "lat": 42.3315509,
        "lon": -83.0466403
      }
    }
  },
  "imageUrl": "http://benzinga.com/next-assets/images/schema-image-default.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-24T23:39:28-04:00",
  "addDate": "2025-08-25T03:53:42.762001+00:00",
  "refreshDate": "2025-08-25T03:53:42.762002+00:00",
  "score": 1.0,
  "title": "SCO Film and Television Week Kicks Off -- In Qingdao, Connecting the World through Cinema",
  "description": "QINGDAO, China, Aug. 24, 2025 (GLOBE NEWSWIRE) -- From August 22 to 31, the SCO Film and Television Week is held in Qingdao, Shandong Province. Hosted by China Media Group (CMG) and the Qingdao Municipal People's",
  "content": "QINGDAO, China, Aug. 24, 2025 (GLOBE NEWSWIRE) -- From August 22 to 31, the SCO Film and Television Week is held in Qingdao, Shandong Province. Hosted by China Media Group (CMG) and the Qingdao Municipal People's Government, with support from the China Film Administration, the event is co-organized by China Media Group Mobile, CMG Shandong, Publicity Department of the Qingdao Municipal Committee of CPC, Qingdao West Coast New Area Administrative Committee, SCO Demonstration Zone Administrative Committee, and co-sponsored by the China Film Archive.\n\nA Media Snippet accompanying this announcement is available by clicking on this link.\n\nUnder the theme \"Cinema as a Bridge, Harmony through Shared Growth,\" the event features an opening ceremony, a cinematic dialogue live session, two themed film salons, one global multimedia promotional campaign, and the screening of 30 outstanding cinematic works. This cross-border cultural feast aims to advance film production and cultural tourism across SCO nations.\n\nFilm is a universal language that bridges civilizations. The event leverages the art of cinema to create an international platform for cultural exchanges and collaboration between the Chinese and foreign film and tourism industries.\n\nThe event brings together filmmakers, musicians, industry leaders, and diplomatic envoys from SCO nations, alongside global film enthusiasts and audiences. Together, they launch a new chapter in cross-border film, cultural, and tourism collaboration. By fostering deeper integration between the film industry and cultural tourism, the event injects fresh momentum into Qingdao's global rise as a \"City of Film.\"\n\nThe opening ceremony, held at Qingdao International Conference Center on Aug. 22 and livestreamed via CCTV Video, presented spectacular cultural performances, weaving together cinematic artistry, multicultural elements, and humanistic themes to deliver an unprecedented audiovisual feast for audiences. The high-octane espionage thriller Red Silk debuted as the opening film.\n\nNotably, the event's innovative \"Cinematic Qingdao\" Global Multimedia Promotional Campaign has invited dozens of digital creators from multiple countries to produce short videos documenting this cross-cultural dialogue and showcasing Qingdao's vibrancy as a \"City of Film.\" This campaign not only shows CMG's important role in driving local development through its reach and influence, but also propels Qingdao's film and tourism industries onto the global stage with renewed momentum.\n\n\"Civilizations thrive through exchange and grow richer through mutual learning.\" To deepen cultural dialogue, enhance mutual understanding among SCO nations, and expand the horizons of cinematic creativity, the \"SCO Film and Television Week\" provides a platform for domestic and international filmmakers to connect, share, and learn from each other.\n\nThe \"Cinematic Dialogues Live Session\" features nearly 40 film enthusiasts and celebrity guests to explore new paths for integrating cinematic art and culture. Audiences worldwide will enjoy an immersive, up-close experience through interactive livestreams. Meanwhile, the \"Themed Film Salons\" convene elite filmmakers, producers, directors, and critics from China and abroad for boundary-breaking discussions on film policies, market trends, technological advancements, and artistic styles, thereby fostering profound exchanges that transcend cultural boundaries.\n\nThe film screenings feature an innovative \"online + offline\" multi-platform approach. China Media Group Mobile, CMG's flagship digital platform, will host an exclusive online zone streaming 24 acclaimed documentaries and 8 premium TV series from SCO nations, delivering a seamless fusion of global storytelling. Offline, the week partners exclusively with Wanda Cinemas for theatrical showcases at three Qingdao locations: Qingdao Wanda Cinema CBD Wanda Plaza Branch, Qingdao Wanda Cinema Licang Wanda Plaza Branch and Qingdao Wanda Cinema Oriental Movie Metropolis Branch. Adding to the summer vibrancy, two open-air screenings will light up Qingdao's cultural nightlife during the peak tourism season, boosting the city's evening economy.",
  "medium": "Article",
  "links": [
    "https://www.globenewswire.com/Tracker?data=R01DWXSVwpMjXitKIt8xrWgZBFSSPEV66oQo1uiYadicOP1BzwobCBzfjwfsEx4wdHXvi6v1CrvkQSEfyx5xvTbmhC_c6DJmQwA_Y88hQoN9e3x3F8zlmJ41GYHA5jZINH0ZICyJo3VR0A-3WiMFENEnzCwu5_aKZShPHtU4MRHDBJp_EKVa42yr3CydRpFbLInijYVBjreWlEz4eR0tYWE3_LfWp3k3QNheP238aik="
  ],
  "labels": [
    {
      "name": "Press Release"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Qingdao Wanda Cinema",
      "weight": 0.0912637
    },
    {
      "name": "Qingdao",
      "weight": 0.08640162
    },
    {
      "name": "Qingdao Wanda Cinema CBD Wanda Plaza Branch",
      "weight": 0.08411557
    },
    {
      "name": "Qingdao Wanda Cinema Licang Wanda Plaza Branch",
      "weight": 0.08411557
    },
    {
      "name": "cultural tourism",
      "weight": 0.08351203
    },
    {
      "name": "global film enthusiasts",
      "weight": 0.08347682
    },
    {
      "name": "cultural dialogue",
      "weight": 0.0791727
    },
    {
      "name": "Qingdao Wanda Cinema Oriental Movie Metropolis Branch",
      "weight": 0.079136506
    },
    {
      "name": "Qingdao International Conference Center",
      "weight": 0.07887735
    },
    {
      "name": "cultural exchanges",
      "weight": 0.07805962
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Entertainment"
    },
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Entertainment Industry/Film & TV Industry",
      "score": 0.80078125
    },
    {
      "name": "/Arts & Entertainment/Movies/Movie Reference",
      "score": 0.505859375
    },
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.361572265625
    }
  ],
  "sentiment": {
    "positive": 0.7644029,
    "negative": 0.033618335,
    "neutral": 0.20197874
  },
  "summary": "The SCO Film and Television Week, held from August 22 to 31 in Qingdao, Shandong Province, aims to advance film production and cultural tourism across SCO nations. The event is hosted by China Media Group (CMG) and the Qingdado Municipal People's Government, with support from the China Film Administration, and co-organizes by the China Fan Archive. The theme of the event is \"Cinema as a Bridge, Harmony through Shared Growth,\" which includes a cinematic dialogue live session, two themed film salons, one global multimedia promotional campaign, and the screening of 30 outstanding cinematic works. The opening ceremony featured spectacular cultural performances and an innovative \"online + offline\" multi-platform approach.",
  "shortSummary": "The SCO Film and Television Week kicks off in Qingdao, emphasizing international cultural exchanges and collaboration, with innovative online and offline platforms to boost local tourism.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "dd36c4c66d864d0588f111e4d08ad45e",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "The SCO Film and Television Week ran from August 22‑31 in Qingdao, featuring an opening ceremony, live cinematic dialogues, themed salons, a global multimedia campaign, and screenings of 30 films. Hosted by China Media Group and local authorities, the event aimed to strengthen cross‑border film production, cultural tourism, and collaboration among SCO nations under the theme “Cinema as a Bridge, Harmony through Shared Growth.” It showcased a mix of online and offline screenings, including a high‑profile espionage thriller “Red Silk,” and leveraged digital creators to promote Qingdao as a “City of Film.” The week’s activities brought together filmmakers, industry leaders, and diplomats to discuss policy, market trends, and technological advances, boosting Qingdao’s global cultural profile.}",
  "argos_id": "A9QS9O7QN"
}