{
  "url": "https://www.chron.com/news/world/article/sole-survivor-of-australian-mushroom-poisoning-21013791.php",
  "authorsByline": "By ROD McGUIRK, Associated Press",
  "articleId": "9c69c971ee59401bb88a680e1591c00a",
  "source": {
    "domain": "chron.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "TX",
      "county": "Harris County",
      "city": "Houston",
      "coordinates": {
        "lat": 29.7589382,
        "lon": -95.3676974
      }
    }
  },
  "imageUrl": "",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-25T03:16:22+00:00",
  "addDate": "2025-08-25T03:48:15.702132+00:00",
  "refreshDate": "2025-08-25T03:48:15.702134+00:00",
  "score": 1.0,
  "title": "Sole survivor of Australian mushroom poisoning grieves loss of wife and friends",
  "description": "Ian Wilkinson, the sole survivor of a deadly Australian mushroom poisoning, says he feels only half alive after losing his wife and two close friends. He spoke Monday at the sentencing hearing for...",
  "content": "MELBOURNE, Australia (AP) — The sole survivor of a deadly lunch laced with toxic mushrooms said on Monday he felt only half alive following the death of his wife and he continued to grieve the loss of his two closest friends.\n\nA jury convicted Patterson, 50, in July of murdering Wilkinson’s wife Heather Wilkinson, her sister Gail Patterson, and her husband Don Patterson with a lunch of beef Wellington pastries and foraged death cap mushrooms in July 2023.\n\nWilkinson, a Baptist pastor, described his wife as a woman who took her faith seriously and was full of love, joy, peace, patience, kindness, gentleness, faithfulness and self-control.\n\n“It’s one of the distressing shortcomings of our society that so much attention is showered on those who do evil and so little on those who do good,” he added.\n\nHe described Gail and Don Patterson, the parents of Erin Patterson’s estranged husband Simon Patterson, as the closest people to him after his wife and family.\n\n“I’m distressed that Erin has acted with callous and calculated disregard for my life and the lives of those I love. What foolishness possesses a person to think that murder could be the solution to their problems, especially the murder of people who have only good intentions towards her?” he added.\n\n“I say ‘harms done to me’ advisedly. I have no power or responsibility to forgive harms done to others,” Wilkinson said.\n\n“My prayer for her is that she will use her time in jail wisely to become a better person,” he added.\n\nErin Patterson attended the Melbourne court in person on Monday rather than watch via a video link from prison which she did during a hearing earlier this month. She wore a paisley top with a light brown jacket.\n\nSeven relatives of victims either read impact statements to the court on Monday or had them read on their behalf.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Erin Patterson",
      "weight": 0.09238092
    },
    {
      "name": "Gail Patterson",
      "weight": 0.08797863
    },
    {
      "name": "Don Patterson",
      "weight": 0.0869251
    },
    {
      "name": "Simon Patterson",
      "weight": 0.08242737
    },
    {
      "name": "Patterson",
      "weight": 0.07921465
    },
    {
      "name": "death cap mushrooms",
      "weight": 0.07861008
    },
    {
      "name": "wife",
      "weight": 0.07712355
    },
    {
      "name": "Australian mushroom poisoning",
      "weight": 0.0716512
    },
    {
      "name": "toxic mushrooms",
      "weight": 0.06987811
    },
    {
      "name": "Monday",
      "weight": 0.06775171
    }
  ],
  "topics": [
    {
      "name": "Australia"
    }
  ],
  "categories": [
    {
      "name": "World"
    }
  ],
  "taxonomies": [
    {
      "name": "/Sensitive Subjects/Death & Tragedy",
      "score": 0.98291015625
    },
    {
      "name": "/News/Other",
      "score": 0.93359375
    },
    {
      "name": "/News/Local News",
      "score": 0.822265625
    },
    {
      "name": "/Sensitive Subjects/Violence & Abuse",
      "score": 0.5458984375
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.417724609375
    }
  ],
  "sentiment": {
    "positive": 0.071187,
    "negative": 0.6893975,
    "neutral": 0.23941559
  },
  "summary": "The sole survivor of a deadly lunch laced with toxic mushrooms in Australia has expressed his grief over the loss of his wife and two of his closest friends. A jury convicted Erin Patterson in July of murdering Patterson, her sister Gail Patterson, and her husband Don Patterson with a lunch of beef Wellington pastries and foraged death cap mushrooms. The victim's husband, a Baptist pastor, described his wife as a woman who took her faith seriously and was full of love, joy, peace, patience, kindness, and self-control. He also expressed his frustration that Patterson had chosen murder over finding a solution to his problems, particularly targeting those with only good intentions.",
  "shortSummary": "The sole survivor of a deadly mushroom poisoning incident in Australia, Erin Patterson, expressed sorrow over the loss of her wife and two close friends.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "6121f5b2fba142848f339de18272387c",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "A jury convicted 50‑year‑old Patterson of murdering his wife, her sister, and her husband with a lunch of beef Wellington pastries and death cap mushrooms. The sole survivor, a Baptist pastor, said he feels only half alive and continues to grieve the loss of his wife and two close friends. He criticized the perpetrator for her callous disregard and urged her to use her time in jail to become better. The victim’s family read impact statements in court, and the accused attended in person rather than via video.",
  "argos_id": "AEN8XR05E"
}