{
  "url": "https://www.morningstar.com/news/dow-jones/202508216919/sinopecs-first-half-net-profit-slid-on-low-oil-prices-commodities-roundup",
  "authorsByline": "",
  "articleId": "af813052f1f54f809659595037fef91d",
  "source": {
    "domain": "morningstar.com",
    "location": {
      "country": "us",
      "state": "IL",
      "county": "Cook County",
      "city": "Chicago",
      "coordinates": {
        "lat": 41.8755616,
        "lon": -87.6244212
      }
    }
  },
  "imageUrl": "https://images.contentstack.io/v3/assets/blt4eb669caa7dc65b2/blta7dd42ebdd7b93b8/61899b34a3c7df383578294c/morningstar-og.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-21T09:40:00-05:00",
  "addDate": "2025-08-21T14:56:34.048508+00:00",
  "refreshDate": "2025-08-21T14:56:34.048512+00:00",
  "score": 1.0,
  "title": "Sinopec's First-Half Net Profit Slid on Low Oil Prices — Commodities Roundup",
  "description": "",
  "content": "--Brent crude oil is up 0.4% at $67.08 a barrel\n\n--Gold futures are up flat on $3,388.20 a troy ounce\n\nChina Petroleum & Chemical Corp. reported a drop in net profit and revenue in the first half of the year, weighed by lower oil prices.\n\nNet profit for the six months ended June declined 40% to 21.48 billion yuan, equivalent to $2.99 billion, while revenue fell 11% from a year earlier to 1.409 trillion yuan, the Chinese state-owned energy major said Thursday.\n\nChina's biggest oil refiner, better known as Sinopec, attributed the weaker results to a sharp drop in international crude oil prices and the sluggish gross profit margin in the chemical market.\n\nBrent crude oil prices averaged $71.70 a barrel in the first half, down 15% from a year earlier, it said.\n\nAustralian gold miner Northern Star Resources on Thursday reported a more than doubling in annual net profit and raised its dividend, as the company benefited from record-high gold prices.\n\nNorthern Star said its net profit totaled 1.34 billion Australian dollars (US$862 million) in the 12 months through June, up from A$638.5 million the year before.\n\nDirectors of the company declared a final dividend of 30 Australian cents a share, up from 25 Australian cents a year ago. That takes the miner's full-year payout to a record 55 Australian cents.\n\nWhitehaven Coal reported a jump in annual net profit following the sale of a stake in an Australian coal mine, but said underlying profit fell amid a downturn in coal prices.\n\nThe company said its net profit totaled 649 million Australian dollars (US$418 million) in the 12 months through June, up from A$355 million a year earlier. That followed a deal to sell a 30% share of its Blackwater metallurgical coal mine to a pair of Japanese steelmakers.\n\nUnderlying profit fell to A$319 million, down 57% on the year earlier.\n\nCorn yield in Illinois is expected to fall below last year's level, but remain above the three-year average, according to the survey by crop scouts on the Pro Farmer Crop Tour.\n\nPro Farmer reported Wednesday that it sees the corn yield in Illinois falling to 199.57 bushels an acre, down from 204.14 bpa assessed in 2024. The 2.2% drop for 2025 still lands above the three-year average of 196.19 bpa, and is still above the Department of Agriculture's national outlook of 188.8 bpa published last week.\n\nIn Illinois, ​as in other states, issues with diseases such as southern rust and tar spots have plagued corn, reducing its yield potential, said Clarabell Probasco, an agronomist with Pioneer Seeds.\n\nExports of U.S. grains had a mixed performance last week, with corn and soybeans beating expectations while wheat disappointed, according to a report from the Department of Agriculture.\n\nThe USDA said net sales of wheat for the 2025/2026 marketing year were 519,800 metric tons in the week ended Aug. 14, down 25% from the prior four-week average. For the 2026/2027 season, however, the agency reported a net negative of 38,000 metric tons, resulting in a total of 481,800 metric tons across both marketing years.\n\nTraders surveyed by The Wall Street Journal expected at least 500,000 metric tons of net export sales for the two periods combined.\n\nAmerican Industrial Partners has agreed to acquire International Paper's global cellulose fibers business for $1.5 billion.\n\nAmerican Industrial, an industrials-focused investor, said Thursday that its affiliate has signed a definitive agreement to acquire the Global Cellulose Fibers division from International Paper.\n\nThe $1.5 billion price tag also includes $190 million in issued preferred stock.\n\n0954 ET - Crop scouts embarking on the last day of the Pro Farmer Crop Tour, which coalesces in Rochester, Minn. this afternoon, are speculating what the final results of the tour may show -- and how that may differ with what the USDA projected for yields and production earlier this month. \"I don't think our numbers are going to be anywhere close to USDA,\" say crop scouts and Ohio farmer Rob Geesling. Pro Farmer will release its final projections for Corn Belt corn and soybean yields on Friday. (kirk.maltais@wsj.com)\n\n0924 ET - The Pro Farmer Midwest Crop Tour begins its final day surveying corn and soybean fields, with the western and eastern legs converging in Rochester, Minn. this afternoon. Crop scouts are heading into some areas of northern Iowa and southern Minnesota that have received a lot of rain, said Lane Akre, head of the eastern leg of the tour-meaning that corn ears and soybeans may continue to show issues with disease. CBOT grains are higher in pre-market trading, with corn up 0.7%, soybeans 0.3% higher, and wheat up 0.9%. (kirk.maltais@wsj.com)\n\n0908 ET - Grain futures rise pre-market as the USDA reports weekly export sales for corn and soybeans that are better than expected, while wheat disappoints. Exports \"were supportive new-crop corn and soybeans but neutral to bearish wheat,\" Marex's Terry Reilly writes. Meanwhile, traders visiting American crops spot unexpected signs of plant disease and excessive soil dryness in some areas.Markets could also be affected by macroeconomic headlines, ahead of a pivotal speech by Fed Chair Powell tomorrow amid intense pressure from the Trump administration to reduce borrowing costs. On the CBOT, wheat is up 0.9%, corn rises 0.7% and soybeans gain 0.3%. (paulo.trevisani@wsj.com; @ptrevisani)\n\n0845 ET - Oil futures add to the previous day's gains following the large export-led drawdown in U.S. crude oil inventories, but remain rangebound with the market awaiting developments on the Russia-Ukraine situation. The U.S. inventory data \"suggest that oil demand remains relatively strong,\" while geopolitical and trade issues keep traders cautious, Rania Gule of XS.com says in a note. \"Any price increases are likely to be limited and temporary, as the market faces a medium-term risk of oversupply, making any long-term price support conditional on stronger global demand or lower production,\" she adds. WTI is up 0.4% at $62.95 a barrel as the October contract moves to the front of the curve. Brent is 0.4% higher at $67.10. (anthony.harrup@wsj.com)\n\n1232 GMT - Gold futures fall, though prices remain in a narrow range in relatively thin trading. Futures are down 0.2% at $3,380.90 a troy ounce. The precious metal has weakened slightly on the stronger U.S. dollar. A stronger dollar makes it more expensive for international buyers to buy dollar-denominated commodities and competes with gold's safe-haven properties. Gold performed well in the prior session on safe-haven demand as investors sold off U.S. tech sector stocks, and it has managed to keep most gains, Trade Nation's David Morrison says in a note. Still, gold is likely to remain rangebound until U.S. Federal Reserve Chair Jerome Powell's key speech on Friday, Morrison adds. The speech will be carefully scrutinized for clues on the Fed's pathway toward easing monetary policy, which would boost non-interest-bearing bullion's appeal. (joseph.hoppe@wsj.com)\n\n1015 GMT - Palm oil closed lower on weakness in Chicago's soybean oil market, says David Ng, a trader at Kuala Lumpur-based Iceberg X. Market concerns about palm oil's recent sharp price increases may deter future demand, he adds. Ng sees support for crude palm oil futures at 4,400 ringgit a ton and resistance at 4,650 ringgit a ton. The Bursa Malaysia Derivatives November contract fell 36 ringgit to close at 4,462 ringgit a ton. (jiahui.huang@wsj.com; @ivy_jiahuihuang)\n\n1013 GMT - Base metal prices fall, with LME three-month copper down 0.4% at $9,683.0 a metric ton and LME three-month aluminum down 0.2% at $2,571.50 a ton. Metals have drifted lower in thin trading, with few catalysts to convincingly push prices in either direction, though a steady U.S. dollar has added some pressure in European midday trading. A stronger dollar makes it more expensive for international purchasers to buy dollar-denominated commodities, lowering demand. (joseph.hoppe@wsj.com)\n\n1006 GMT - Concerns over the Federal Reserve's independence amid political pressure from President Trump could benefit gold, says Fadi Al Kurdi at FFA Kings in a commentary. Trump's calls for the resignation of a Fed governor could unsettle markets, prompting investors to seek safe-haven assets such as gold. The president's push to replace Fed officials could also hasten interest rate cuts, which could further support the precious metal, he adds. Geopolitical tensions continue to underpin safe-haven demand. Market participants are likely to stay on the sidelines ahead of Fed chair Jerome Powell's speech, he says. Spot gold falls 0.3% to $3,340.03/oz. (megan.cheah@wsj.com)",
  "medium": "Article",
  "links": [],
  "labels": [
    {
      "name": "Roundup"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Low Oil Prices",
      "weight": 0.07284769
    },
    {
      "name": "lower oil prices",
      "weight": 0.07284769
    },
    {
      "name": "international crude oil prices",
      "weight": 0.07220102
    },
    {
      "name": "Brent crude oil prices",
      "weight": 0.06966511
    },
    {
      "name": "Net profit",
      "weight": 0.065371424
    },
    {
      "name": "net profit",
      "weight": 0.065371424
    },
    {
      "name": "U.S. crude oil inventories",
      "weight": 0.06459369
    },
    {
      "name": "annual net profit",
      "weight": 0.06385329
    },
    {
      "name": "crude palm oil futures",
      "weight": 0.06337684
    },
    {
      "name": "oil demand",
      "weight": 0.062416114
    }
  ],
  "topics": [
    {
      "name": "Energy Sector"
    },
    {
      "name": "Oil & Gas"
    },
    {
      "name": "Markets"
    },
    {
      "name": "Oil Sector"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.89501953125
    },
    {
      "name": "/Finance/Investing/Commodities & Futures Trading",
      "score": 0.68408203125
    },
    {
      "name": "/Business & Industrial/Energy & Utilities/Oil & Gas",
      "score": 0.5791015625
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.49755859375
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.334228515625
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.314208984375
    },
    {
      "name": "/Business & Industrial/Metals & Mining/Precious Metals",
      "score": 0.30517578125
    }
  ],
  "sentiment": {
    "positive": 0.018399727,
    "negative": 0.9327313,
    "neutral": 0.048868965
  },
  "summary": "China's largest oil refiner, Sinopec, reported a 40% drop in net profit and revenue for the first half of the year, due to lower oil prices. The company's net profit for the six months ended June declined 40% to 21.48 billion yuan, equivalent to $2.99 billion, while revenue fell 11% from the previous year to 1.409 trillion yuan. The drop was attributed to a sharp drop in international crude oil prices and a sluggish gross profit margin in the chemical market. Meanwhile, Australian gold miner Northern Star Resources reported a more than doubling in annual net profit, raising its dividend due to record-high gold prices. Exports of U.S. grains had a mixed performance last week, with corn and soybeans outperforming expectations while wheat disappointed.",
  "shortSummary": "China's Sinopec reported a 40% drop in first-half net profit and revenue due to lower oil prices, while Northern Star Resources reported a record dividend.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "8237dc6c03ae459697dfc14282ea1d63",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Brent crude is trading slightly higher at $67.08 a barrel while gold futures remain flat around $3,388 a troy ounce. China’s Sinopec reported a 40% drop in first‑half net profit to 21.48 billion yuan, citing falling oil prices, whereas Australian miners Northern Star and Whitehaven Coal posted higher annual profits, though Whitehaven’s underlying earnings fell due to a coal price slump. U.S. grain outlooks show a modest decline in Illinois corn yields but still above the three‑year average, and USDA export data for corn and soybeans beat expectations while wheat lagged. Separately, American Industrial Partners agreed to buy International Paper’s global cellulose fibers business for $1.5 billion, and market commentary highlights cautious sentiment ahead of Fed Chair Powell’s upcoming speech amid geopolitical and policy uncertainties.",
  "argos_id": "AOS07L14J"
}