{
  "url": "https://www.cnbc.com/2025/08/25/airline-offer-and-order-systems-set-to-transform-how-we-buy-tickets.html",
  "authorsByline": "Monica Pitrelli",
  "articleId": "afef8ce3119d4d11820477d7a15025ae",
  "source": {
    "domain": "cnbc.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NJ",
      "county": "Bergen County",
      "city": "Englewood Cliffs",
      "coordinates": {
        "lat": 40.8853773,
        "lon": -73.9523597
      }
    }
  },
  "imageUrl": "https://image.cnbcfm.com/api/v1/image/108190007-1756085461205-gettyimages-1366021905-nan_2545.jpeg?v=1756085485&w=1920&h=1080",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-25T03:39:07+00:00",
  "addDate": "2025-08-25T03:44:32.683017+00:00",
  "refreshDate": "2025-08-25T03:44:32.683021+00:00",
  "score": 1.0,
  "title": "Airline bookings haven't moved with the times. That’s about to change",
  "description": "Airlines are moving from reservation system operators to modern digital retailers that function more like Amazon and Spotify, Flyr CEO Alex Mans told CNBC Friday.",
  "content": "In June, my children and I flew from Singapore to Texas to visit family. Several weeks later, we met up with my husband in New York City. Then I flew, solo, back to Asia, later followed by my husband. Eventually the kids returned with a set of grandparents in tow. All in, our summer trip took seven separate bookings to pull off — a twisted mix of one-way tickets and return trips — sometimes among people on the same flight. But the flexibility needed to avoid this booking ordeal, which took half a day to execute, is not only possible — it exists today, said Alex Mans, CEO of the travel tech company Flyr. His company aims to transform airlines from reservation system operators to modern digital retailers that function more like Amazon and Spotify, he told \"Squawk Box Asia\" Friday.\n\nA key feature of this change is a familiar one, he said: the shopping cart. \"We are used to a shopping cart in almost every retailing experience we know — physical and digital — yet airlines are still following this very traditional linear flow when you book and manage your flights,\" he said. Shopping carts allow flyers to buy different flights at the same time, and passengers within the same booking to choose different seat classes, luggage allowances and preferences like priority boarding, he said. He referenced a CNBC Travel article about the number of business travelers who are, often quietly, taking their family and friends with them on work trips. \"You might be able to fly in the business cabin because your company's paying, but your family might fly in premium economy,\" he said. \"You couldn't do that today on a traditional reservation system. You'd have to make two bookings.\"\n\nNext-generation booking systems, being developed by Flyr as well as other industry players such as Amadeus, Sabre and Travelport, are helping to move airlines beyond legacy PSS, or \"passenger service system\" technology, to \"offer and order management\" systems. The promise is a more personalized and flexible booking process, where passengers can easily change and refund purchases by themselves, with the option of buying more than just flights. \"We are helping airlines natively, so in their own website, sell hotels, car rentals, activities, insurance, even e-sims, if you go abroad, for example,\" he said. \"This allows an airline to compete much more with the travel agents, especially the online travel agents.\"\n\nA major test of this new system is set to occur later this year with the launch of Riyadh Air. The Saudi Arabia-based carrier, through a partnership with Flyr, will be launched without PPS technology, making it the first \"digitally native\" airline in the world, Mans said. \"Riyadh Air will be the world's first airline to actually get rid, or not even launch with, this legacy technology,\" he said, in a direct challenge to the long-held industry view that such tech is necessary to support travel agent distribution and connectivity to other airlines. Offer and order management systems are a key part of the airline industry's push for new distribution capability to personalize booking offers and increase airline revenue. By next year, around 30% of sales are expected to come from new distribution capabilities, according to an Amadeus Insights Travel Technology Investment Trends report. In that report, more than one in five airlines said that transitioning to becoming a retailer is one of the top three biggest priorities in airline technology today.",
  "medium": "Article",
  "links": [
    "https://www.cnbc.com/asia-squawk-box/",
    "https://www.cnbc.com/quotes/SABR",
    "https://www.cnbc.com/2025/08/14/most-business-travelers-are-taking-families-along-on-trips.html",
    "https://amadeus.com/content/dam/amadeus/documents/en/ttit/travel-technology-investment-trends-2024-airlines-report.pdf",
    "https://www.iata.org/en/programs/airline-distribution/retailing/ndc/",
    "https://www.cnbc.com/cnbc-travel/",
    "https://www.cnbc.com/quotes/AMS-ES",
    "https://www.cnbc.com/2023/03/12/saudi-arabia-launches-new-national-airline.html"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Airline bookings",
      "weight": 0.10710298
    },
    {
      "name": "airline technology",
      "weight": 0.09711303
    },
    {
      "name": "other airlines",
      "weight": 0.089963436
    },
    {
      "name": "airlines",
      "weight": 0.08801588
    },
    {
      "name": "airline revenue",
      "weight": 0.085874
    },
    {
      "name": "booking offers",
      "weight": 0.07578856
    },
    {
      "name": "reservation system operators",
      "weight": 0.07019621
    },
    {
      "name": "new distribution capabilities",
      "weight": 0.069009446
    },
    {
      "name": "new distribution capability",
      "weight": 0.069009446
    },
    {
      "name": "travel agent distribution",
      "weight": 0.06681222
    }
  ],
  "topics": [
    {
      "name": "Airlines"
    },
    {
      "name": "Aviation"
    }
  ],
  "categories": [
    {
      "name": "Travel"
    }
  ],
  "taxonomies": [
    {
      "name": "/Travel & Transportation/Transportation/Air Travel",
      "score": 0.93408203125
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.46875
    }
  ],
  "sentiment": {
    "positive": 0.32491958,
    "negative": 0.1428333,
    "neutral": 0.5322471
  },
  "summary": "The CEO of travel tech company Flyr, Alex Mans, aims to transform airlines into modern digital retailers like Amazon and Spotify. The company is developing next-generation booking systems, which aim to move airlines beyond legacy PSS technology to \"offer and order management\" systems. These systems allow passengers to purchase different flights at the same time and choose different seat classes, luggage allowances, and preferences like priority boarding. A major test of this new system is set to occur later this year with Riyadh Air, which will launch without PPS technology, making it the first \"digitally native\" airline in the world.",
  "shortSummary": "Airline bookings are undergoing a shift towards digital retailing with innovative shopping carts, enabling personalized purchases and flexibility, especially in the Middle East.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "07be874cf94b4be8bafdf4ca7a1b355e",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.cnbc.com/2023/03/12/saudi-arabia-launches-new-national-airline.html",
      "text": "Saudi Arabia's Crown Prince Mohammed bin Salman formally announced on Sunday the creation of a new national airline, Riyadh Air, with industry veteran Tony Douglas as its chief executive, as the kingdom moves to compete with regional transport and travel hubs.\nRiyadh Air will serve more than 100 destinations around the world by 2030, making use of the kingdom's location between Asia, Africa and Europe, state news agency SPA said.\nThe new airline is expected to add $20 billion to Saudi Arabia's non-oil GDP growth and create more than 200,000 jobs both directly and indirectly, it said.\nThe announcement may lead to a tougher battle for passengers, going head-to-head with regional giants Emirates, Qatar Airways and Turkish Airlines as the travel industry recovers from the pandemic.\nRiyadh Air is wholly owned by Saudi Arabia's sovereign wealth fund, the Public Investment Fund (PIF), which has more than $600 billion in assets and is the main driver of the kingdom's efforts to diversify its economy and wean itself off oil.\nIn October, Saudi Arabia was in advanced negotiations to order almost 40 A350 jets from Airbus, with Boeing also lobbying for a slice of the kingdom's transportation expansion, industry sources had told Reuters.\nThe head of state-owned Saudi Arabian Airlines (Saudia) told Reuters at the time that it was in talks with Boeing and Airbus on orders both for itself and a planned new carrier."
    },
    {
      "url": "https://www.iata.org/en/programs/airline-distribution/retailing/ndc/",
      "text": "Need Help?\nNew Distribution Capability (NDC) is a data exchange format based on Offer and Order management processes for airlines to create and distribute relevant offers to the customer regardless of the distribution channel.\nNeed Help?\nNeed Help?\nWhat?\nNDC (New Distribution Capability) is a travel industry-supported program (NDC Program) launched by IATA for the development and market adoption of a new, XML-based data transmission standard (NDC Standard). The NDC Standard enhances the capability of communications between airlines and travel agents and is open to any third party, intermediary, IT provider or non-IATA member, to implement and use.\nWhy?\nNDC enables the travel industry to transform the way air products are retailed to corporations, leisure and business travelers, by addressing the industry’s current distribution limitations: product differentiation and time-to-market, access to full and rich air content and finally, transparent shopping experience.\nWho will benefit and how?\nAvailable on a voluntary and open basis, NDC benefits different industry players across the airline distribution value chain as follows:\n- Full service and low-cost airlines > Differentiate their Products and Services\n- Travel Sellers > Access Full and Rich Air Content of the Airlines\n- Customers > Benefit from a Transparent Shopping Experience\nDocumentation\n- Fact Sheet: a one-pager on NDC: The NDC Program, the NDC Standard, and more\n- Modern Airline Retailing - A Business Case: in order to get full senior management buy-in and support, it is essential to build n appropriate business case, and to consider aspects that are more difficult to quantify, such as the risk of doing nothing, the current inefficiencies in business processes, etc. The document, developed by airlines with advanced implementation (Airline Retailing Consortium) is a must-read if you are starting your journey to retailing.\n- Airline Retailing Maturity (ARM) index factsheet: the ARM index evaluates organizations across their technical capabilities, scalability of partnerships across the retailing value chain, and maturity in capturing potential value. This factsheet contains everything you need to know about the ARM index program.\n- Resolution 787 - Oct 2012: a copy of the IATA Resolution, supporting the NDC Program.\n- Airline Retailing: the value at stake by McKinsey & Company (October 2019).\n- Scalability Report - Mar 2019: Study to assess the industry's readiness to address the look-to-book ratios challenges in an NDC environment.\nMedia and Multimedia\nNDC 24.1 and Beyond\n- Hear what motivated the Shop-Order-Pay Standards Board to introduce the 2024 generation of the NDC standard:\n- Expand your exploration of the 24.1 schemas by watching the webinar introducing the new generation and explaining how it paves the way for a seamless transition to Offers & Orders:\nAirline Retailing Implementation Soundbites\nExplore our compilation of interviews featuring industry players with advanced NDC implementation.\nWhy NDC?\nLearn why NDC is a positive development for the travel industry.\nWhat is NDC? (Part 1)\nLearn what NDC is ... and what it isn't.\nWhat is NDC? (Part 2)\nLearn what NDC is ... and what it isn't (continued).\nWho will benefit from NDC, and how?\nLearn about the benefits the new standard delivers.\nThe NDC Messages are governed by the Shop-Order Standards Board under the Passenger Standards Conference and managed by three specialized Industry Groups; the Offer, Order and Customer Payment Groups. These Groups, ensure the standard is maintained and improved each release.\nIf you are an airline or strategic partner and would like to join the conversations and help set the standard, please contact standards@iata.org for more information.\nIATA Passenger Messaging Standards\nThe NDC (Offer and Order) messages can be found within the standard IATA Passenger Messaging Standards.\n- Download the latest Schemas\nNDC Implementation Guide"
    },
    {
      "url": "https://www.cnbc.com/quotes/SABR",
      "text": "Sabre Corp SABR:NASDAQ\nRT Quote | Last NASDAQ LS, VOL From CTA | USD\nAfter Hours: Last | 08/22/25 EDT\n1.79UNCH (UNCH)\nVolume\n89,307\nClose\n1.79+0.03 (+1.70%)\nVolume\n9,222,127\n52 week range\n1.73 - 4.63\n- Open1.79\n- Day High1.86\n- Day Low1.76\n- Prev Close1.76\n- 52 Week High4.63\n- 52 Week High Date02/21/25\n- 52 Week Low1.73\n- 52 Week Low Date08/07/25\nLatest On Sabre Corp\nKey Stats\n- Market Cap706.181M\n- Shares Out394.51M\n- 10 Day Average Volume12.99M\n- Dividend-\n- Dividend Yield-\n- Beta1.57\n- YTD % Change-50.96\nLatest On Sabre Corp\nKEY STATS\n- Open1.79\n- Day High1.86\n- Day Low1.76\n- Prev Close1.76\n- 52 Week High4.63\n- 52 Week High Date02/21/25\n- 52 Week Low1.73\n- 52 Week Low Date08/07/25\n- Market Cap706.181M\n- Shares Out394.51M\n- 10 Day Average Volume12.99M\n- Dividend-\n- Dividend Yield-\n- Beta1.57\n- YTD % Change-50.96\nRATIOS/PROFITABILITY\n- EPS (TTM)-0.78\n- P/E (TTM)-2.28\n- Fwd P/E (NTM)7.78\n- EBITDA (TTM)461.526M\n- ROE (TTM)-801.83%\n- Revenue (TTM)2.943B\n- Gross Margin (TTM)57.79%\n- Net Margin (TTM)-10.31%\n- Debt To Equity (MRQ)-276.94%\nEVENTS\n- Earnings Date10/29/2025(est)\n- Ex Div Date-\n- Div Amount-\n- Split Date-\n- Split Factor-"
    },
    {
      "url": "https://www.cnbc.com/quotes/AMS-ES",
      "text": "Amadeus IT Group SA AMS-ES:Mercado Continuo\n*Data is delayed | Exchange | EUR\nLast | 08/22/25 CEST\n72.50UNCH (UNCH)\n52 week range\n57.64 - 75.40\n- Open0.00\n- Day High0.00\n- Day Low0.00\n- Prev Close72.50\n- 52 Week High75.40\n- 52 Week High Date03/03/25\n- 52 Week Low57.64\n- 52 Week Low Date08/19/24\nLatest On Amadeus IT Group SA\nKey Stats\n- Market Cap37,363.3M\n- Shares Out442.98M\n- 10 Day Average Volume-\n- Dividend1.39\n- Dividend Yield1.92%\n- Beta1.13\n- YTD % Change-\nLatest On Amadeus IT Group SA\nKEY STATS\n- Open0.00\n- Day High0.00\n- Day Low0.00\n- Prev Close72.50\n- 52 Week High75.40\n- 52 Week High Date03/03/25\n- 52 Week Low57.64\n- 52 Week Low Date08/19/24\n- Market Cap37,363.3M\n- Shares Out442.98M\n- 10 Day Average Volume-\n- Dividend1.39\n- Dividend Yield1.92%\n- Beta1.13\n- YTD % Change-\nRATIOS/PROFITABILITY\n- EPS (TTM)3.02\n- P/E (TTM)23.97\n- Fwd P/E (NTM)-\n- EBITDA (TTM)-\n- ROE (TTM)-\n- Revenue (TTM)-\n- Gross Margin (TTM)-\n- Net Margin (TTM)-\n- Debt To Equity (MRQ)-\nEVENTS\n- Earnings Date-\n- Ex Div Date-\n- Div Amount-\n- Split Date-\n- Split Factor-"
    },
    {
      "url": "https://www.cnbc.com/2025/08/14/most-business-travelers-are-taking-families-along-on-trips.html",
      "text": "When American Natasha Colkmire returned to work after having her first child, she didn't want to leave her newborn son with a nanny to go on a business trip.\nSo she convinced a family member to tag along.\n\"They would meet up with me when my son needed to be nursed,\" she said. \"We also had the evenings together.\"\nThe trip worked so well that Colkmire took more business trips with non-colleague companions.\n\"My grandma went to Houston with me, a friend went to St. Paul, and my mom helped me when I needed to do a job in Washington D.C.,\" she said. \"Each person loved getting the free trip.\"\nMore than half of business travelers (55%) have had loved ones join their work trips, according to a survey of 4,000 adults from the United States, United Kingdom, Germany and Spain published Wednesday by the travel tech company TravelPerk.\nAmong C-suite executives, the number jumped to 73% — with executives saying they've had partners (53%), children (22%), friends (21%), and even pets (7%) join their business trips, according to TravelPerk's data.\nCompanionship and cost savings\nFor some, bringing loved ones on business trips is a way to reclaim time together, according to Jean-Christophe Taunay-Bucalo, TravelPerk's president and COO.\n\"Traveling for work can be lonely,\" he told CNBC Travel. \"Work trips can be an opportunity to experience something new, and by taking a loved one along, you remain connected.\"\nPlus, business travelers don't have to miss family time, be it bedtimes or birthdays, said Taunay-Bucalo.\n\"For me, it's about having the best of both worlds, and sometimes performing at my peak also means seeing my kid at the end of a work day — it provides some normality,\" he said.\nOther business travelers who spoke to CNBC said there is another motivation — money.\nColkmire, who now runs a travel website, recalled the time she joined her husband on a work trip to Vienna, Austria.\n\"Our expense was cut in half, which was a huge blessing so that we were able to explore an area of the world that we had not yet been to without breaking the bank,\" she said.\nBridgette Borst Ombres, a former journalist turned public relations consultant, said she has used work trips to create \"budget-friendly mini-vacations\" for her family.\n\"Attending a tech conference at Disney World in Orlando, Florida, was the perfect business trip to bring along my husband and then-2-year-old daughter,\" she said. \"The conference lasted two days, so while I was working, my husband took our daughter to visit his dad, who lived in the area, and we'd meet up for dinner in the evenings.\"\nI didn't keep [my] travel plans a secret, nor did I broadcast them to coworkers.Bridgette Borst Ombresfounder of The Commsultant\nAfter the conference ended, Ombres and her family spent a few days at Walt Disney World.\n\"My hotel was covered by my company for the first two days, but I paid for the additional nights and all of our activities. My plane ticket was also covered by the company but I purchased my husband's ticket separately,\" she said.\nThat blend of personal and business travel, or \"bleisure\" as it's known, was valued at $315 billion in 2022 by Allied Market Research. The advisory firm projects blended trips will reach $731 billion globally by 2032.\nTo tell or not to tell?\nBringing loved ones on business trips is common and generally accepted, said Frank Harrison, regional security director for the Americas at risk management company World Travel Protection.\nHowever, that doesn't mean that employees are revealing their plans to their companies.\n\"I didn't keep [my] travel plans a secret, nor did I broadcast them to coworkers,\" Ombres said. \"Part of it was worrying it might come across as unprofessional.\"\nDeepak Shukla, CEO of the London-based marketing company Pearl Lemon, said he's turned three-day work trips into week-long adventures with his wife in New York City, Lisbon, Dubai and Tokyo.\n\"I don't hide it from my team,\" he said. \"If the work's done and costs aren't creeping into the company card, it's nobody's business.\"\nHowever, he said big corporations often view traveling with family as a \"policy grey zone.\"\n\"The sticking points are expense claims, insurance coverage, and whether leisure days blur into workdays ... [which are] messy for tax and liability,\" he said. \"That's why some companies quietly allow it but expect employees to keep receipts and activities clearly split.\"\nBusiness first\nOmbres said allowing family and friends to join business trips can boost morale and build loyalty among employees.\n\"I'm all for it,\" she said. \"As long as it doesn't interfere with the work.\"\nShe said she sets clear expectations for work to be completed on trips, and as long as that's met, \"there's no reason to try to micromanage how people spend their personal time.\"\nGabe Richman, CEO of Seattle-based biotech company Omic, agreed, saying he's combined work trips with family vacations in San Diego and Frankfurt, Germany.\nHe said he encourages employees to travel with loved ones as long as \"business objectives are met first.\" He said employees should clearly separate personal and work expenses and ensure companies incur no additional costs. Travelers should also be transparent about their plans with their companies, he said.\nBeyond that, travelers should make the most of the trip — for business and pleasure.\n\"Business takes me to places we'd never vacation to otherwise.\" he said. \"Why waste the opportunity?\""
    }
  ],
  "argos_summary": "Flyr CEO Alex Mans explains how next‑generation booking systems will replace legacy PSS with offer‑and‑order platforms that give airlines a shopping‑cart experience, allowing passengers to mix flights, seats and ancillary services in one booking. Riyadh Air will be the first airline to launch without legacy technology, partnering with Flyr to become a digitally native carrier. The article also discusses the growing trend of business travelers bringing family or friends on work trips—called bleisure—highlighting cost savings, morale benefits, and the need for clear corporate policies on expense and liability.",
  "argos_id": "B2P24G9GM"
}