{
  "url": "https://www.cleveland.com/news/2025/08/car-struck-by-object-while-driving-under-overpass-independence-police-blotter.html",
  "authorsByline": "blisik, Brian Lisik | brianlisik@yahoo.com, Brian Lisik",
  "articleId": "6d0c7e1933d04466b693386f702411ac",
  "source": {
    "domain": "cleveland.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "OH",
      "county": "Cuyahoga County",
      "city": "Cleveland",
      "coordinates": {
        "lat": 41.4996574,
        "lon": -81.6936772
      }
    }
  },
  "imageUrl": "https://www.cleveland.com/resizer/v2/NLIVLOGV6BC3JISFZWJICYUFAY.jpg?auth=0acf3871679f45d1ac6726a05b57e35aedddf4a6a012a3f0e49f303cbfe6eb3d&width=1280&quality=90",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-25T05:37:12.486000+00:00",
  "addDate": "2025-08-25T05:46:44.780224+00:00",
  "refreshDate": "2025-08-25T05:46:44.780228+00:00",
  "score": 1.0,
  "title": "Car struck by object while driving under overpass: Independence Police Blotter",
  "description": "Also in this week’s Independence Police blotter, a driver is arrested for OVI after nearly striking a police cruiser.",
  "content": "A driver reported her car was struck by an unknown object while driving under a highway overpass at 5:15 a.m. July 26, shattering the car’s windshield. Police searched the overpass for suspects, but none were found. There was no further information at the time of the report.\n\nA driver was arrested for operating a motor vehicle impaired at 11:51 p.m. July 25 after he reportedly drove past a police cruiser at a high rate of speed, nearly striking the cruiser. The driver was pulled over at Transportation Boulevard after being seen committing four marked-lanes violations. He failed field sobriety tests and later registered nearly three times the legal limit for intoxication.\n\nGet police blotters by email every weekday for free with our new Police Blotter newsletter. Sign up at cleveland.com/newsletters.\n\nRead more news from the Parma Sun Post.",
  "medium": "Article",
  "links": [
    "https://www.cleveland.com/topic/independence/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Independence Police Blotter",
      "weight": 0.09679319
    },
    {
      "name": "field sobriety tests",
      "weight": 0.09463885
    },
    {
      "name": "overpass",
      "weight": 0.09461435
    },
    {
      "name": "police blotters",
      "weight": 0.0939617
    },
    {
      "name": "more news",
      "weight": 0.08639511
    },
    {
      "name": "Independence Police",
      "weight": 0.08402631
    },
    {
      "name": "Police Blotter",
      "weight": 0.08358894
    },
    {
      "name": "Transportation Boulevard",
      "weight": 0.08217201
    },
    {
      "name": "July",
      "weight": 0.07860283
    },
    {
      "name": "Car",
      "weight": 0.077595435
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Auto"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Local News",
      "score": 0.994140625
    },
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.96875
    },
    {
      "name": "/Sensitive Subjects/Accidents & Disasters",
      "score": 0.9384765625
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.84326171875
    },
    {
      "name": "/Autos & Vehicles/Vehicle Codes & Driving Laws/Other",
      "score": 0.393798828125
    }
  ],
  "sentiment": {
    "positive": 0.063746676,
    "negative": 0.6893688,
    "neutral": 0.24688452
  },
  "summary": "A driver reported her car was hit by an unknown object while driving under a highway overpass, causing it to shatter the windshield. The incident occurred at 5:15am. Police searched the overpass for any suspects, but no further information was released. A driver was arrested for operating a motor vehicle impaired after failing field sobriety tests and registering nearly three times the legal limit for intoxication.",
  "shortSummary": "A woman's car was hit by an object while driving under a highway overpass in Independence, prompting a police investigation.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "3eda249cbbf84590bdab8f86e7f2d2da",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.cleveland.com/topic/independence/",
      "text": "independence\nCar struck by object while driving under overpass: Independence Police Blotter\nAlso in this week’s Independence Police blotter, a driver is arrested for OVI after nearly striking a police cruiser.\nIndependence kicks off a new school year with top results and convocation\nINDEPENDENCE, Ohio – A new school year started in Independence with a convocation for all teachers, staff, administrators and board members. And the high school was celebrating with students earning national recognition from the College Board for their performance on Advanced Placement exams.\nDriver denies knowledge of handgun and fictitious plates: Independence Police Blotter\nAlso in this week’s Independence Police Blotter, a motorist is cited for driving a stolen rental car.\nSafety fun and learning in Parma: Sun Postings\nSirens, safety vehicles and smiles dominated Parma’s Safety Fair, which took place Aug. 9 at the Justice Center.\nParents can help kids cope with back-to-school anxiety\nCounselor offers tips for parents to help kids cope with back-to-school stress.\nParma Animal Shelter holds ‘Play for the PAWS’ softball fundraiser: Sun Postings\nThe Parma Animal Shelter recently held a successful softball tournament fundraiser at Nike Park.\nDriver pulled over for window tint, cited for drug possession: Independence Police Blotter\nAlso in this week’s Independence Police Blotter, officers make arrests in three cases of prostitution.\nParma Heights Library hosts kids T-shirt-making event: Sun Postings\nThe Cuyahoga County Public Library is hosting its T-Shirt Crew Remix for kids entering grades 6-12 at its Parma Heights branch.\nDriver runs from police during traffic stop: Independence Police Blotter\nAlso in this week’s Independence Police Blotter, police find drugs in a car during a traffic stop.\nSign up for the Citizens Police Academy: Sun Postings\nThe Parma and Parma Heights police departments will once again be hosting a Citizens Police Academy.\nIndependence acquires historic Bramley House for preservation\nAn historic property that is home to the Independence Historical Society has been bought by the city and leased back.\nIndia Festival is a cultural celebration for the whole community: Talk of the Towns\nShirley MacFarland’s weekly community column featuring news and notes from Brecksville, Broadview Heights, North Royalton and Strongsville."
    }
  ],
  "argos_summary": "A driver in Independence, Ohio, reported her car was hit by an unknown object under a highway overpass at 5:15 a.m. on July 26, shattering the windshield, but police found no suspects. The next day, a motorist was arrested for operating a vehicle impaired after speeding past a police cruiser, failing sobriety tests, and having a blood alcohol level nearly three times the legal limit. The blotter also highlighted other local incidents, including a stolen rental car citation and a drug possession arrest.",
  "argos_id": "C9YJ3UM11"
}