{
  "url": "https://www.reuters.com/world/china/gold-slips-two-week-peak-dollar-ticks-up-2025-08-25/",
  "authorsByline": "Reuters",
  "articleId": "9f5f85cfc6954f1b8c816f9544d55d7e",
  "source": {
    "domain": "reuters.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://www.reuters.com/resizer/v2/LQSEKTW5TRJ4NFPXA2LNUJ5YCA.jpg?auth=7e389f4cd41be3446460641d6a3f34169a72ef48f27c10d17fd72270517fe42e&height=1005&width=1920&quality=80&smart=true",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-25T01:35:03.159000+00:00",
  "addDate": "2025-08-25T01:43:52.680030+00:00",
  "refreshDate": "2025-08-25T01:43:52.680031+00:00",
  "score": 1.0,
  "title": "Gold slips from two-week peak as dollar ticks up",
  "description": "Gold prices edged lower on Monday as the dollar crept higher, while increased U.S. interest rate cut expectations following a dovish pivot from Federal Reserve Chair Jerome Powell lent support to bullion.",
  "content": "Aug 25 (Reuters) - Gold prices edged lower on Monday as the dollar crept higher, while increased U.S. interest rate cut expectations following a dovish pivot from Federal Reserve Chair Jerome Powell lent support to bullion.\n\n* Spot gold was down 0.2% at $3,364.25 per ounce, as of 0109 GMT, after hitting its highest since August 11 on Friday. U.S. gold futures for December delivery eased 0.3% to $3,409.80.\n\n* The U.S. dollar index (.DXY) rose 0.2% against its rivals after dropping to a four-week low, making gold less attractive to overseas buyers.\n\n* Powell on Friday signaled a possible interest rate cut at the U.S. central bank's meeting next month, saying that risks to the job market were rising but also noting inflation remained a threat and that a decision wasn't set in stone.\n\n* Markets are now pricing in an 87% chance of a quarter-point rate cut at the September 17 policy meeting, and a cumulative 48 basis points of reductions by this year-end, according to CME FedWatch Tool.\n\n* Gold tends to appreciate on expectations of lower interest rates, which reduce the opportunity cost of holding non-yielding bullion.\n\n* Asian share markets rallied on Monday as investors celebrated the likely resumption of interest rate cuts in the U.S.\n\n* Investors now await a reading on U.S. personal consumption prices on Friday that is expected to show core inflation creeping up to its highest since late 2023 at 2.9%.\n\n* Physical gold demand in key Asian hubs remained subdued last week as price volatility kept buyers at bay, while jewellers in India resumed purchases ahead of a key festival season.\n\n* Elsewhere, spot silver was down 0.2% at $38.09 per ounce, platinum fell 0.3% to $1,356.95 and palladium slipped 0.6% to $1,119.67.",
  "medium": "Article",
  "links": [
    "https://www.reuters.com/markets/wealth/powell-says-fed-may-need-cut-rates-will-proceed-carefully-2025-08-22/",
    "https://www.reuters.com/markets/quote/.DXY",
    "https://www.reuters.com/world/china/gold-gains-powells-comments-fuel-rate-cut-hopes-2025-08-22/",
    "https://www.thomsonreuters.com/en/about-us/trust-principles.html",
    "https://www.reutersagency.com/en/licensereuterscontent/?utm_medium=rcom-article-media&utm_campaign=rcom-rcp-lead"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "increased U.S. interest rate cut expectations",
      "weight": 0.109530084
    },
    {
      "name": "interest rate cuts",
      "weight": 0.107470214
    },
    {
      "name": "U.S. gold futures",
      "weight": 0.09817197
    },
    {
      "name": "lower interest rates",
      "weight": 0.09637961
    },
    {
      "name": "Gold prices",
      "weight": 0.09467706
    },
    {
      "name": "U.S. personal consumption prices",
      "weight": 0.08813298
    },
    {
      "name": "Spot gold",
      "weight": 0.08367277
    },
    {
      "name": "Physical gold demand",
      "weight": 0.081086084
    },
    {
      "name": "Gold",
      "weight": 0.079260394
    },
    {
      "name": "gold",
      "weight": 0.079260394
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "World"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.87841796875
    },
    {
      "name": "/Finance/Investing/Commodities & Futures Trading",
      "score": 0.78515625
    },
    {
      "name": "/Business & Industrial/Metals & Mining/Precious Metals",
      "score": 0.6513671875
    }
  ],
  "sentiment": {
    "positive": 0.041552845,
    "negative": 0.87980515,
    "neutral": 0.07864197
  },
  "summary": "Gold prices have dropped from a two-week peak due to increased U.S. interest rate cut expectations. The dollar index rose by 0.2%, making gold less attractive to overseas buyers. Federal Reserve Chair Jerome Powell has hinted at a possible rate cut at the next meeting. Markets are now pricing in an 87% chance of a quarter-point rate cut and a cumulative 48 basis points of reductions by this year-end.",
  "shortSummary": "Gold prices fell as increased interest rate cut expectations and a higher dollar, impacting overseas purchases, while Asian share markets rallied and gold prices remained volatile.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "3fa6a39bc1db441089fc7159786cb86c",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.thomsonreuters.com/en/about-us/trust-principles.html",
      "text": "The Trust Principles\nThomson Reuters is dedicated to upholding the Trust Principles and to preserving its independence, integrity, and freedom from bias in the gathering and dissemination of information and news.\nTrust Principles – the history\nThe Trust Principles were created in 1941, in the midst of World War II, in agreement with The Newspaper Proprietors Association Limited and The Press Association Limited (being the Reuters shareholders at that time). The Trust Principles imposed obligations on Reuters and its employees to act at all times with integrity, independence, and freedom from bias.\nReuters Directors and shareholders were determined to protect and preserve the Trust Principles when Reuters became a publicly traded company on the London Stock Exchange and Nasdaq. A unique structure was put in place to achieve this. A new company was formed and given the name 'Reuters Founders Share Company Limited', its purpose being to hold a 'Founders Share' in Reuters.\nThe legal structure has evolved over time and the Founders Share and other contractual arrangements now confer a number of special rights upon the Thomson Reuters Founders Share Company. For example, (i) the Thomson Reuters Founders Share Company has enhanced voting rights in circumstances where someone is seeking to obtain a significant shareholding in, or acquire control of, Thomson Reuters and (ii) the prior consent of the Thomson Reuters Founders Share Company must be sought prior to undertaking any sale of, or other material transaction involving, the Reuters news business unit.\nThomson Reuters itself is obliged and committed to apply the Trust Principles to its operations. The charter documents of Thomson Reuters Corporation include provisions to safeguard the Trust Principles as they apply to the Thomson Reuters business and require Thomson Reuters Directors, in the performance of their duties, to have due regard to the Trust Principles, by the proper exercise of their powers and in accordance with their other duties as Directors.\nThe Trust Principles are:\n- That Reuters shall at no time pass into the hands of any one interest, group, or faction;\n- That the integrity, independence, and freedom from bias of Thomson Reuters shall at all times be fully preserved;\n- That Reuters shall supply unbiased and reliable news services to newspapers, news agencies, broadcasters, and other media subscribers and to businesses, governments, institutions, individuals, and others with whom Reuters has or may have contracts;\n- That Thomson Reuters shall pay due regard to the many interests which it serves in addition to those of the media; and\n- That no effort shall be spared to expand, develop, and adapt the news and other services and products of Thomson Reuters so as to maintain its leading position in the international news and information business\nThomson Reuters Founders Share Company was established in 1984 when Reuters became a public company. The directors of Thomson Reuters Founders Share Company (known as ‘Trustees’) have a duty to ensure, to the extent possible, that the Trust Principles are complied with.\nThe Trustees are experienced and eminent people from diverse arenas in politics, diplomacy, media, public service and business. The Trustees are selected by a nomination committee and proposed to the board of the Thomson Reuters Founders Share Company for appointment. The nomination committee assists in scrutinizing candidates’ suitability and its members include two persons appointed by the chairman after consultation with the European Court of Human Rights and representatives of certain press associations. The Thomson Reuters Corporation board has two representatives on the nomination committee. The Chairman and Deputy Chairman of the Thomson Reuters Founders Share Company Board are members of the nomination committee, and the Chairman appoints three other directors of the Thomson Reuters Founders Share Company as members of the nomination committee. The Chairman of the Thomson Reuters Founders Share Company acts as chairman of the nomination committee.\nThe number of Trustees has to be at least 14 and not more than 18. Trustees have a minimum of two meetings per year, and receive reports on our activities in the different fields in which we operate (including Reuters news). The Trustees meet with both the Thomson Reuters Board and representatives of senior management. Through Thomson Reuters Founders Share Company's Chairman, regular contact is maintained with our company. The relationship is one of trust and confidence.\nIndependence of Thomson Reuters\nCustomers across the world depend on us to provide them with reliable and objective news and information.\nThis means that we have a special need to safeguard our independence and integrity and avoid any bias which may stem from control by specific individuals or interests.\nThe Thomson Reuters Trust Principles were adopted in 1941 and include the preservation of integrity, reliability of news, development of the news business, and related principles.\nToday, the Trust Principles are fundamental to our entire business.\nMore information\nContact us\nBrian Moss\nFor inquiries pertaining to Reuters reporting standards and the Trust Principles please email: brian.moss@thomsonreuters.com."
    }
  ],
  "argos_summary": "Gold prices slipped slightly on Monday as the dollar strengthened, but expectations of a U.S. interest‑rate cut after Fed Chair Jerome Powell’s dovish remarks helped support bullion. Spot gold fell 0.2% to $3,364.25 an ounce, while December futures eased 0.3% to $3,409.80. The dollar index rose 0.2%, making gold less attractive to overseas buyers. Markets now price an 87% chance of a 25‑basis‑point cut at the September meeting and a cumulative 48 basis points of cuts by year‑end. Asian shares rallied on the prospect of U.S. rate cuts, while physical gold demand remained subdued in key hubs, though Indian jewelers increased purchases ahead of a festival season.",
  "argos_id": "CVFWNK2PH"
}