{
  "url": "https://www.bloomberg.com/news/videos/2025-08-22/insight-with-haslinda-amin-8-22-2025-video",
  "authorsByline": "bn",
  "articleId": "26eb491fc5284ef58e3d6762fa5bd2f7",
  "source": {
    "domain": "bloomberg.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iUkUWFHgtBjI/v3/-1x-1.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-22T06:08:18.440000+00:00",
  "addDate": "2025-08-22T06:37:28.127810+00:00",
  "refreshDate": "2025-08-22T06:37:28.127811+00:00",
  "score": 1.0,
  "title": "Insight with Haslinda Amin 8/22/2025",
  "description": "Insight with Haslinda Amin, a daily news program featuring in-depth, high-profile interviews and analysis to give viewers the complete picture on the stories that matter. The show features prominent leaders spanning the worlds of business, finance, politics and culture.\n (Source: Bloomberg)",
  "content": "And for sure it feels to me like it's a live meeting of, as you know, before April 2nd, before we got some uncertainties coming on the policy side. I believed that we had pretty stable, full employment, that inflation's coming down the target. The Chicago Fed president declaring September a live meeting for the U.S. Central bank. Even as traders trimmed bets on a rate cut ahead of Jay Powell. S much anticipated speech later today at Jackson Hole. Live from singapore, this is inside with Haslinda Amin, where we dive deeper into the stories that matter with crucial context and shop analysis. Chinese semiconductor stocks advancing after a report said in video is holding production of the 28 AI chip its license to sell in China. We'll get insights on the AI's superpower struggle with Danny Research president Ed Danny and also find out why he thinks the Fed may not cut rates next month. Also ahead, as Foreign Minister Wang Yi wraps up his tour of South and Central Asia, a closer look at the shifting dynamics of China's relations with India and Pakistan. We'll get the view from Beijing with Taraki Institute senior fellow Ayanna Tangen ahead of what's shaping up as a pivotal summit for the Shanghai Cooperation Organization. Let's get straight to our top story. Chip giant and Nvidia has reportedly asked its component suppliers to stop production related to its H 28 AI chip. The information says the company issued the request of the Beijing, urged local companies to avoid using the chip that is specifically designed for the Chinese market. Authorities in China had sounded the alarm over alleged security risks after Washington officials said they were considering ways to equip chips with better location tracking capabilities. And video on its part has repeatedly denied it built such features into its product. Government. The Trump administration has approved the licenses for us to export Toyotas to China. And recently China asked some questions about some security backdoors in our chips. But we have made very clear and put to rest that H-20 has no security back doors. Let's bring in Ed Danny, president of Yardeni Research. And we know that the news couldn't come at a worse time. I mean, how big a risk is this to tech stocks and the rally we've seen so far? Well, you know, tech stocks have had a heck of a rally in the United States and other parts of the world. And I think they were overdue for some correction or at least sideways move. And I think it was just waiting for something to happen like this to cause some profit taking. So I am not too, too concerned about this. I'd be more concerned if the tech stocks were continuing to melt up. So having some minor correction in the technology names is a good thing. But you know, this this is just another example of the fact that there is a trade war going on between the United States and China. We haven't got everything agreed. And it looks as though it's it's going to be a very fluid situation. You know, we have a kind of a verbal agreement that both sides take positions on and have different spins. And then, you know, the next day everything changes. But I think Howard Ludwig, the the commerce secretary, basically said some things about the chip, the age 20 chip, that it was kind of an inferior chip that we were selling China. And I think there's was also an issue in China about kind of, you know, getting an inferior product. So the recent tech selloff that we've seen is just what invest is taking money off the table. I mean, we saw Palantir giving up more than $70 billion of market share. I mean, what do you buy the dip if you believe in the story? Well, I don't think you have to buy it right away. I think that if you look at the seasonality in the U.S. stock market, late, late August, September, you can kind of you can have sell offs. They're not known to be particularly good periods for the market. And so I think we're going to see a tech get cheaper into September or maybe make a low in October for a year end rally. So I don't think there's any reason to chase these things. Clearly, this tech rally that we've had was based on very strong earnings for the Magnificent Seven, the cloud providers, as well as the chip providers. And they just got a little bit too close to the sun, you know, kind of like Icarus. When you get too close to the sun and a melt up here, you run the risk of having the the wax melt in the wings come off. I don't think it's that serious, but I think we did get too close to the sun here with some of these valuation multiples of the Magnificent Seven at a forward p e of 30. That's that's awfully high. Well, the thing is, some say perhaps it is time to buy because when Nvidia is out with its earnings, that could be a catalyst for tech stocks to do to go higher. I think a lot of that news is already baked in in Nvidia. I think that, you know, good news as is anticipated in Nvidia, bad news is not and the H20 is one of the reasons that in video has been rallying over the past few weeks when Huang went to the White House and basically convinced that President Trump that it was okay to sell these 20 years and then Trump said, okay, you will let you do that. But we want to cut. We want a commission for that. It looked as though this was going to be another source of revenues and earnings growth for Nvidia. Now, the China market is questioned, questionable once again. So I don't think that you know better than expected earnings are necessarily going to push the NVIDIA much higher since there's a lot of uncertainty now about what access NVIDIA has to the China market. And when you take a look at long term returns for these stocks, I mean, how do they look? Because according to our colleague Simon Wide, he says when you aggregate all together price to book, price to earnings Q ratio, it shows that in a long time the returns are going to be really poor and it is an indication of a correction to come. Well be poor if they don't deliver the earnings growth that the market's anticipating. It is. What makes the Magnificent Seven magnificent is that they are, you know, very big companies. They account for something like 30% of the market capitalization of the S & P 500. So they're really huge and yet they're generating double digit earnings. Learning's growth, which is really quite, quite remarkable. They have a tremendous amount of cash flow. They're using that cash flow to buy smaller businesses that they can leverage up into bigger businesses. And of course, they are investing in A.I. and in air may not have an immediate return. I mean, $20 per month for millions of people, maybe even more than more than millions of people can add up to some serious revenues for these magnificent seven. But meanwhile, some of them are also major cloud providers. And as more and more of us use a I, I use it as a research assistant every single day and as more of us use it, our needs for the cloud are going to increase and they're going to charge us more for cloud usage. And you talked about how a melt up will be followed by a melt down. What kind of melt down are you anticipating? Well, you know, we just went through that. A version of that we saw that the S & P 500 at the beginning of the year, February 19th, that it had a peak there. At that point, that was a record high. And at that point, the forward p e and the S & P 500 was 22. Back during the tech bubble of 1999, we got up to 25. So we're really kind of getting up there. And meanwhile, for the overall S & P 500, not only did the p e get off the high at 22, but we again saw the war, the the Buffett ratio, which kind of looks at the price to sales ratio, went to an all time record high. And then we had a correction and the market didn't, you know, it didn't stay down for very long once it turned it around, hit a bottom on April 8th, it was almost was a complete V-shaped recovery. And here we are back to the same kind of multiples and valuation levels which were stretched at the beginning of the year, and they're still stretched now. I think what's changed is investors have come to agree with me that the economy might be more resilient than they had thought and that we might not have a recession anytime soon. And therefore, they're willing to pay these high valuation multiples. But we really need earnings to drive the market higher. And the good news is that first quarter and second quarter earnings for the S & P 500 were incredible. They you know, analysts were expecting something like three or 4% at the beginning of both earnings seasons, and they've come in at low double digit rates instead. So the earnings picture is great. Earnings are the second quarter all time record high for the S & P 500. You just said that economy is more resilient than thought. You gotta wonder how Jerome Powell thinks about it as we head towards Jackson Hole. And that speech, the much anticipated speech that is he's about to make. I mean, of course, market pricing and what currently 75 from 90 previously. But you're pricing in way lower than that 40%. I mean, why? Well, I mean, I am there's nothing scientific about these probabilities. The way it is scientific is, you know, we could look at the futures markets and the futures markets after the payroll and the week July payroll employment report, as suddenly we're talking about that, giving us a reading of 100% likelihood of a rate cut in September. And then it went down to 90% and hotter than expected inflation, and now it's down to 80%, partly because of today's Flash Purchasing Managers index, which were very strong for August for both manufacturing and non-manufacturing. And the price indexes were also very strong. So, you know, we're still the markets are still definitely expecting a rate cut. And the Fed doesn't like to disappoint the market, which is why Powell speech from Friday morning at 10:00 in Wyoming will be so extremely important because it will convey to to all of us the extent to which he wants to push back against the market expectations. And I think he will push back. I think he'll say, look, there's two more inflation readings before the next formally meeting. There's a payroll employment number. And I think the consensus turned to the idea that a rate cut is inevitable in September, after the payroll numbers came out for July, July was actually not too bad. It was 73,000. And maybe that's all we really need anymore to keep the unemployment rate down, You know, with the border closed, with the deportations, instead of needing a 125 to 175000 per month to keep the economy at full employment, we may be in a situation where it's more like 75000 to 100000, and I expect 100,000 a payroll employment gain when we get the August reading at the beginning of September. And again, I look at that July report and when I see is something that makes a lot more sense in terms of the revisions, there were downward revisions for May and June with barely any increase in payroll gains. That makes that makes a lot of sense. I mean, there's a lot of uncertainty related to tariffs and doge and all these other policies being thrown at us by the administration that naturally employers said, you know, we're not going to fire anybody, but let's not be in a rush to hire anybody. And then all of a sudden jump compared to those downward revisions, July wasn't so bad. It's 73,000 and 100,000 would be kind of confirmation of my view. So, look, I could be wrong here, but I am feeling pretty comfortable with the idea that the economy and the labor market are going as it was, continue to surprise us with their resilience. Right. And everybody is looking at the data because the Fed is looking at the data. The trouble is everybody is interpreting the data differently, right? I mean I mean, we had some people El-Erian, for instance, saying that the data has been weak when you take a look at labor in particular and that the Fed is behind the curve and that the data that the Fed is looking at is pretty much back dated, wholly back dated, he says. Well, look, the Fed is data dependent, which means that they're waiting for the next batch of economic indicators to kind of get a handle on where the where the economy is. So it's it's true that the current thinking at the Fed is largely determined by the data that's already come out. But they obviously have lost some of their confidence in the strength of the economy, as Mohammed has pointed out, rightly so, because of those the weak July report, I think that kind of threw everybody off in terms of the especially the downward revisions. And the president got very mad about it and he fired the head of the Bureau of Labor Statistics. And look, the data is kind of crummy data. It's it's about time that we actually spent more money to make it better. I don't think it was politically rigged. I think it just the Bureau of Labor Statistics needs more money to do a better job of collecting the data so that preliminary data don't turn out to be useless or just way off once the revisions come in. But I think it's all you're right. I mean, data, even when data comes out, there's a lot of debate about what it's saying. You've got two Fed governors right now who since July have been saying, you know, let's pay no attention to the inflation news, because whatever inflation we get is tariff related and it's transitory. So let's look past inflation and look at the labor market. I look at the labor market and I'm not. What I see is no layoffs. I don't think anybody can disagree that the layoffs are extremely low. Initial claims confirm that the Challenger report confirms that. What they also is, Doug, shouldn't be any disagreement about is that it's taking longer to find a job. And that's why the number of people who are unemployed have gone up. But yet the unemployment rate remains right around 4%, which for all practical purposes is is full employment. So I think some of that one of the reasons is it's hard to get a job is because of that uncertainty related to the tariffs. And I think that's abating. And at the same time, I think companies aren't sure what to what to make of AI and whether they really should be hiring when they might be able to use these technologies to to do the job. And if you are wrong and we see a rate cut in September, would that be a policy error? And if it is, how do you see the bond vigilantes responding to it? Well, you know, I. I was wrong again a year ago, at the beginning of last year, at the beginning of last year, I, I said nine and done. And the Fed didn't listen to me. They went ahead and cut by 100 basis points from September 19th to December 19th. But as they started to do that, I warned that the bond vigilantes won't like that because the economy is resilient. And it really wasn't was was unnecessary. Was it warranted? It turned out. So I was wrong about what the Fed would do, but I was right about the reaction of the bond market more than I expected. Actually. The bond yields went up 100 basis points and mortgage rates went up. And now we've got the Trump administration saying the Fed has got to cut rates dramatically because we need to bring mortgage rates down to revive housing. But we just saw last year that when the Fed did lower rates and it wasn't warranted, the bond market went the other way. And that could happen again this time around. So the Fed could cut on September 17th, 25 basis points, and the biennial, if we're lucky, we'll just kind of still kind of stay here at 4.3% and the mortgage rate will stay at six and a half percent. By the way, I don't know if we really want mortgage rates to come down significantly, because if they do, home prices will go to new record highs and the affordability issue will still be a problem. The Fed may be trying to fix problems that it can't really fix. The problem in housing is a shortage of relatively affordable housing, and a lot of that has to do with regulations. And Congress, I understand, has a bill that's kind of aimed at easing things up in terms of building more affordable housing. So that that's that's important. But the Fed controls the Fed funds rate. They don't control the bond yield they did when they did quantitative easing, but now they're doing quantitative tightening and reducing their balance sheet. As she suggested a year ago when you were wrong, bond vigilantes offloaded Treasuries in a huge way. Might we see the extent of that sell off from the bond holders? Yeah, I think that the bond market wants to make sure that the Fed and the Treasury are maintaining law and order in the credit markets and the capital markets. They want financial stability and they don't want a great deal of volatility. You know, when you buy a ten year bond, you're you're really not looking. Most investors are looking to make a killing on capital gains because that implies that you could also get killed if it goes the other way. You don't want really volatility when you're buying a ten year bond. And so if the the designated sheriff, the Fed is maintaining law and order, the bond vigilantes will come in and do it for them. And again, we saw that at the last year. You know, I mean, I think that a similar situation could happen now, if it turns out that that they go ahead and cut rates and the data turns out to show that that really wasn't warranted. Add still so much uncertainty. No clarity until the Fed moves or not. How do you position for that? How should my portfolio be looking like at this point in time? Well, we've been recommending overweighting information technology, communications services. Industrials and financials. And they've all done very well. We turned bullish on the stock market in November of 2022. So that was good timing. And, you know, the rally has been awesome. A lot of money has been made. It's probably time to take some profits or kind of rebalance. I mean, right now, the S & P 540% of the market cap of the S & P 500 is information technology and communication services. I mean, it's it's it's not a well-balanced index, but that's kind of the nature of the stock market. It kind of shows you where the growth is, where the juices, where where people are betting that the economy is going to get its growth from. So I'd still stick with those sectors and I look for opportunities to expand in that area. But, you know, for anybody who's been listening to that, to me, I've been saying just just stay with it, you know? Right. A lot of a lot of smart people call the tap back in February 19th, they just forgot to call the bottom. And it's you know, you get whipped out of a bull market like this and you really wind up regretting it. I'm I'm in kind of the Buffett camp. I'm in the the camp with Professor SIEGEL that, you know, stocks you want to hold on to for a while because they you know, part of the return is dividends. You want to clip the dividends, you want to reinvest them. And, you know, stocks work out in the long run. That's you know, it's been fairly consistent for quite a long time. Right. And hang tight. And Danny, president of Danny's research, is sticking around. Well, still ahead this hour, we'll turn our focus to China's efforts at shoring up its regional alliances in South Asia as it also grapples with a sputtering economy. Keep it here with us. This is going back. Welcome back to Inside or we're keeping an eye on China chip stocks on the back of an idea getting its suppliers to halt those H 20 chips meant to head to China. We're seeing a big jump in terms of huarong semiconductor up more than 12% right now. Take a look. Camera icon technology is also surging at this point in time. Again, nvidia instructing its suppliers like Samsung and Amcor to start production related to that H 28 chips and video issuing the orders of the Beijing age local companies to actually use local stocks. Meanwhile, in the broader market, Asian benchmarks looking like this, standing pat I suppose, waiting for clarity from Jackson Hole in terms of the direction for those cuts, whether or not they're coming come September. Still to come, tohe institute senior fellow ina tension will be joining us to unpack china's geopolitical strategy in asia as it manages trade tensions with the u.s.. Plus, we'll get the market implications with ed danny. This is mom back. So this is a very dramatic reset that has happened, just to put it that this is not something which has been you know, this is like a complete pivot in terms of what Modi's been forced to do in China as it makes its pivot towards more towards the industries of the future. India seems to be a natural place for the Chinese to invest in, and they are both part of the global south, even though that's an awkward term, you know. So. So there are lots of things which make them natural allies. India ought to be very careful. I think there will be limits to just how much of a detente it could actually enjoy with China, because, you know, as we see, Pakistan continues to be keen to to focus on that very special relationship with with China. Some of our guests this week sharing their insights on the warming relationship between India and China and how Pakistan also factors into that equation. China and Pakistan have agreed to strengthen ties following Chinese Foreign Minister Wang Yi is visit to Islamabad. The two nations promised to continue close coordination, saying their friendship is significant for maintaining regional peace and stability. Pakistan's prime minister will also meet with Chinese President Xi Jinping at the Shanghai Cooperation Organization summit in Tianjin later this month. China has been shoring up its regional relationships as it grapples with a still sputtering economy. Economists say its recent push to curb overcapacity is missing a stimulus spark that leaves the economy vulnerable. Joining us now from Beijing is Ina tension, senior fellow at the Thai Institute. And Danny, president of your Danny Research is still with us. So I know. Let's start with you. Talk to us about how perhaps China views its priorities, its strategies in South Asia. How is it managing maneuvering relations with Pakistan and India? Well, China is actively engaged in these South Asian nations, bilaterally and trilateral India. You have a factor in as well. You had a mention of an earlier, you know, the high level talks with Pakistan and Afghanistan that reflect this desire to have these two countries which are not on the best of terms, despite originally having a little bit of a honeymoon and they want to put them together. It's going to be about the SCO and be our ICAO for security and BRT for economics. But when it comes to China, one relationship will be prioritized over the other, right? In this case, Pakistan. It goes back a long way. Lots of history, a lot to do with military as well. You know, I think that it's a mistake. I mean, China is not they're never happy when there is any kind of conflict in their backyard. What they want is stability. That was the whole point of the Shanghai Cooperation Organization is to pull both India and Pakistan and have them talk instead of fight. So although they will provide defensive weapons, they also are very, very not keen on this idea that these countries go to any kind of conflict that ruins trade and makes things unpredictable. And unpredictability is the dangerous, most dangerous thing to business. And let's bring you into this conversation When you take a look at the implications of geopolitics and markets, it's always that the risk is always there. But Chinese stocks have done really well. 20% rally since the April sell off. How much conviction is there for the upside? Well, I think that there are two kind of global investors when it comes to China there. There are those who are willing to invest in China. There's there are those who like to trade the Chinese stocks when they look very cheap, They like to get in them. And then there's other investors who have concluded a long time ago that China is not investable and that if you get a rally, you you don't see a you know, you don't hear the siren song of moving into China. China's regime pretty much calls the shots and how businesses are conducted and they can change the rules. And we've seen that occur occur several times in the Chinese market on a longer term basis, has really been an underperformer. It's underperformed. The U.S. has underperformed India. That doesn't mean there aren't trading opportunities. And and again, that doesn't mean that aren't even long term investment opportunities. But I think a lot of global investors have decided not to play there. As a result, you've seen a lot of money go into India and the India stock Indian stock market really has been extremely hot and there's probably a stretched on a valuation basis. But then again, it's also the beneficiary of this trade war between the United States and China's. So so one would have thought and until we saw that suddenly Trump is threatening to impose significant tariffs on India. So the whole tariff situation, this is creating a tremendous amount of turmoil for for a lot of countries. And yet despite that, global stock markets are doing very well. So I don't think it's you know, China is the only game in town. I think the U.S. still has upward momentum going on. And I think there's places to play in the emerging markets that are a good alternative to China. If if you've concluded a while ago that you don't want to invest in that country because of the lack of rule of law. You talk about how there are other places to invest in. It's not just emerging markets, but frontier markets as well. If you take a look at Pakistan, for example, it was the best performing stock market last year, second only to Korea this year. We're talking about, you know, returns about 30%. Would you diversify into such markets or do you think that the risks are still too high? Well, I've been doing this for quite a while. And the problem with emerging markets is they go up a lot and then they go down a lot. They tend to be pretty, pretty volatile compared to the U.S. market, which has been a fairly steady delivery deliverer of very good returns. European markets have also been kind of frustrating, though of late. They've they've made a big comeback. There's a lot of outperformance by the rest of the world in the first half of this year compared to the, you know, they outperform the S & P 500. But of late, it's you know, it's been a more competitive environment. I think it's more a matter of stock picking. Buying stocks in whatever country you want to invest in. But stocks that you really have confidence are going to grow and that they will benefit from a growing economy. India clearly is that China has the demographic issue. China has the hasn't really solved its property market problem and it's still dumping goods in global markets, which is creating trade frictions around the world. And as because they're exporting deflation, they're building way too many cars and they're exporting them. So China just isn't at the top of my list of where to invest on a global basis. And I know when it comes to South Asia, we know that China has maintained a non-interference policy kind of you know, whenever there are tensions, it says, I don't want to be involved. The thing is, when it comes to India and Pakistan. Can China actually adopt that stance when, I guess 80% of Pakistan's weaponry has been procured from China? Yeah. And about 42% of India's is secured from Russia. I mean, wherever you buy your arms isn't necessarily where your allegiance. There is a strong friendship between China and Pakistan, but there's also interests with India. China does not interfere in the internal affairs, but they are concerned about what's happening in Pakistan. The economy is not going well. You have political division. It's not that they're hedging. They're simply saying you need to get your house in order. We're willing to help you. You have to have a plan. But they have a, you know, a regional plan. This isn't about picking winners. It's not a stock game. This is about how you manage geopolitical relations and create the kind of certainty that is necessary for countries to and businesses to get ahead. I don't think that this pooh poohing China is going to be very good and I'd love to see it stock portfolio at the end of this year. So I'm wondering how the two sides, India and China, will cooperate, will work together. Where's the potential, where the opportunities? Well, actually, you know, there's there's a misunderstanding here. This idea that somehow China can stand up for India against the United States and these 50% tariffs, the what the Indians see as interference in their elections, Bangladesh color revolution. And Modi really doesn't like it when she says that he settled the conflict between Pakistan and India. So this is there's a lot more on that stage here. The question for India is it will it turn to BRICS? Because BRICS is the entity that is the heavyweight here in the room, ten countries representing 40% of the world's GDP. A majority of people land four times as much manufacturing as the United States and or the majority of markets. So if those guys get together and go to Washington, this is what Trump is afraid of. He's made it very clear he's not a good card player. He said, I'll throw 100% if they do anything about the dollar and 10% for good measure because I don't like them. Then he says, Oh, they're nothing. So clearly he's worried about BRICS and the effect that it could have on his plan to dominate the world. And Ed, how are you? I guess factoring in the risks from tariffs on the Indian market, I mean, we're potentially looking at 50%. Yeah, well, you know, there's there's what you know, I was talking about Trump as being a card player and there is a wild card here. And that is some sometime between now and the end of September, it's very, very likely that the appellate court that that is considering the whether the president actually has the power to impose tariffs the way he's been, I think they're going to rule against him. I think he's going to be suddenly really in trouble from a legal perspective. I and I don't think it necessarily will go to the Supreme Court if the appellate court decisively rules that he just doesn't have the constitutional legal authority to do what he's been doing. And when you think about it, it's, you know, in a in a capitalist democracy, nobody should be able to kind of willy nilly throw tariffs around The way he's been throw him is very disruptive to business. You know, it's it hurts businesses for for for no fault of their own. And it's not clear that national security interests are involved. And in every case, maybe when it comes to steel and semiconductors and aluminum, you can make the case for tariffs, but to just kind of willy nilly throw tariffs around as a kind of a political baseball bat to hit to hit countries with and get their attention, that's not such a good idea. It's actually phenomenal how well global stock markets have done despite all of that. But I think that these tariffs are not going to be questioned here pretty shortly. Ed, I know. Hang tight. I just have breaking news right now out of Thailand that we've been waiting for. The Thai court speaking, of course, the Thai court has cleared former Prime Minister Thaksin of royal insult charge. Of course, we're waiting to see whether that verdict would come through. This is the first verdict in a string of legal cases that threatens the Thaksin family's political dominance again. The Thai court has cleared former Prime Minister Thaksin Shinawatra of royal insult charge. I mean, of course, if you remember, Thaksin was indicted back in June last year for comments made in an interview in 2015. The Thai toxin says his been acquitted in that royal insult case. So that verdict finally coming through. And you were talking about how, you know, the courts in the US will decide. But until that happens, we've seen how some companies in India have been caught in the crosshairs of those talks between China and India. Case in point, Reliance Reliance Mukesh Ambani. And just wondering, does that shape your thinking in which companies are attractive at this point in time? Well, yeah, I, I think it doesn't change things because I think this a lot of this tariff issue will slowly abate is a major problem for the for the economy around the world. The global economy is actually held up remarkably well. I think people kind of come to realize that there's nothing you can really know for sure about these tariffs. They can change. The president changes his mind often on these tariffs. And I think with regards to India, there seems to be a little confusion here in terms of the policy. Do we. Or do we not want from a geopolitical perspective, to have India on our side? And it doesn't help if that's the case and it should be the case, then we shouldn't be just willy nilly throwing these tariffs around at at India. And if the whole point of the tariffs is because we don't like that India is buying Russian oil, then why aren't we like imposing all of the sanctions that we possibly can impose ourselves on Russia and see if that will do the trick without getting our trade relationships all confused with people that we want to be on our side, right, in terms of geopolitical alliances. And I know we know that when it comes to China, a key to its strategy is a belt and road. Do you anticipate maybe a scenario where India can engage in either, you know, the Belt and Road or even Cpec, for that matter? Well, not Steve. I mean, that's that's a territorial issue and a whole box of worms that it's going to be difficult to open up. But in terms of the Belt and Road Initiative, I don't see India joining. They didn't joined RCP. They didn't join TPP. I mean, they're not a joiner. They want to be on their own. But it doesn't mean that they can't cooperate. If you start looking at the AIIB, the Asian Infrastructure Investment Bank that's based in Beijing. India has been one of the top gainers of loans. So it is not about joining the group. It is simply about putting infrastructure as an important part for development plan. So India is is free and able to manoeuvre. They don't have to join. That is not the issue. The issue is how are they going to deal with its US problem. And while it is saying, oh, the US is a good long term bet, all I'm hearing is Donald Trump causes uncertainty and a lot of that uncertainty is going to start manifesting as he continues to try to drive the dollar down in this kind of vain hope and he can re industrialize America and make it competitive globally. You know, we talk about the evolving Strategic Relationships Alliance in in South Asia. I'm wondering whether that can withstand Donald Trump's. Tom, what happens after four years? Well, I mean. Well, go ahead. God, I. I'm sorry. I thought that was addressed to me three and a half years more of Trump. We don't know what's going to happen. He might take an authoritarian turn. Turn if he, in fact, loses the House and the Senate during the midterms. He's already been, you know, poking at things, sending troops to the border, sending troops to L.A., taking over D.C. These could be a harbinger of things to come. Once again, it's about uncertainty. People don't know what's going to happen in terms of South Asia. It is being pushed together by the United States. The everything that Trump is doing is to the benefit of China. And it's not you know, they're not asking for it. In fact, a lot of people here in China say the best gift that the United States has given to China recently is Donald Trump. The biggest risks add. For the market in South Asia in investing in India. Well, I think the biggest risk is geo geo political in nature, but that seems to have actually simmer down, certainly in the Middle East. Still a lot of geopolitical risk in terms of Ukraine and in Russia that that hasn't gone away. But all in all, I think the risk of tariffs has also abated somewhat in the sense that everybody's kind of increasingly tuning out the noise and just getting on with their businesses and figuring out how to do things. As I said, a lot of the Asian countries that maybe had no particular reason to work more closely together are doing that in reaction to Trump's tariffs. But the end of the day, I guess one of the things that I would dispute with iron ore, I wouldn't disputed, but I'd say that, you know, we give way too much attention to the headlines of Washington's impact on the economy. The fact of the matter is, it's extraordinary how well the U.S. economy and stock market have done despite Washington, whether it's Biden or Trump. Yeah, Trump will pass on. I don't think we're going to go authoritarian. And I think the U.S. economy is going to continue to prove its extraordinary resilience. Gentlemen, great conversation there. Ina tangent, senior fellow at Target Institute, and Ed Yardeni, president of Dante Research. We thank you so much for being with us today. Coming up, former Prime Minister Thaksin Shinawatra has been acquitted in a case of a whether he insulted the country's royal family. Details on that next. Keep it here with us. This is Bloomberg. Bangkok. Live pictures right there of Thaksin Shinawatra, lawyer with the Channel Country, speaking to reporters. Of course, he said earlier that a Thai court has says that the evidence has been partial and incomplete. Again, the Thai court has acquitted Thaksin Shinawatra of breaking Thailand's last majeste law or the royal defamation law. Of course, he was indicted back in June last let me. Right indicted in June last year. Let's get more from Ramzi Al Recoba, who's with us to put this in perspective for us. So if you remember and I'm sure you do. Thaksin was a fled the country after a coup. And while he was out of the country and around 2015, he gave an interview and he was accused and he came back in 2023 of having insulted that, I think it was the Privy Council, which is related to the crown. Now, the monarchy, there are very strict laws, as you mentioned, against insulting or criticising the crown. It's a it's a revered institution in the country. So it put its hawks in a very interesting position in in contrast to these, the military who was in control at the time and accusing him and then basically using these laws against him. Now he's probably the most high profile person that was accused as long I think the estimate is about 280 people have been charged with these with these laws. And under previous governments, particularly in the after the coup, there were a lot of concern that it was being overused to go after political point, political opponents. And that's that's what Thaksin had had alleged as well. Now, now, this is a bit of is it going to be a huge relief for him and for his family and I think also for folks watching Thailand in terms of worrying about its stability, the this political instability, particularly with his daughter, who is the suspended prime minister, who has her own trials to deal with right now, has has weighed on investment, has weighed on on sentiment. We've seen the stock, the Thai stock market be one of the worst performers. The growth outlook looking pretty weak compared to two neighbors. And with these US tariffs from from Trump, a lot of analysts seem given this political instability, Thailand was probably among the most risk and risk in the region, etc.. But how is it really for Tuckson and his family? The thing is, this is only the first of a string of legal suits against a family which could bring the family down. They have a they have some issues going on now. His daughter got into a bit of trouble earlier this year. Now, I'm sure you remember there was the border clash with Cambodia in in the midst of that as it was sort of heating up. She had a conversation directly with Hun Sen, who's who's basically the the leader of effectively the leader of Cambodia, and for reasons that are so quite oddly unclear. He leaked the the the recording of this phone conversation in which he was very deferential and sort of even criticized her own military's operations. And that got her in quite some trouble. So at the moment, she's been suspended as the prime minister and they've actually brought charges against her that she will have her own verdict, I think a week from day. So next Friday, the Shinawatra's again are going to be in court and their power will again be at risk. Robert thank you so much for that. Lomax RAMSI our recovery who leads our Southeast Asia government coverage. Now before we go, here's a preview of our shows next week as well. Capital Executive Chairman Martin Sorrell will be joining us live on Monday. We'll discuss his business outlook amid mounting challenges in the advertising industry. Plus, a deep dive into the latest central bank remarks out of Jackson Hole, where Rebecca Galvin Wealth Management and Fullerton fund management. That is it for inside the race for Jackson Hole. This is Mumbai.",
  "medium": "Video",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.998046875
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.8037109375
    },
    {
      "name": "/Finance/Investing/Currencies & Foreign Exchange",
      "score": 0.80322265625
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.360595703125
    }
  ],
  "sentiment": {
    "positive": 0.09425652,
    "negative": 0.5824883,
    "neutral": 0.32325515
  },
  "summary": "The article discusses the implications of a potential trade war between the United States and China, with a look at the shifting dynamics of China's relations with India and Pakistan. Nvidia has reportedly asked its component suppliers to stop production of its H 28 AI chip in China due to alleged security issues, which have been raised by authorities in China. Ed Danny, president of Yardeni Research, also discusses the AI's superpower struggle and why he believes the Fed may not cut rates next month. Despite this, he does not believe that tech stocks were overdue for a correction or a sideways move due to the recent tech selloff. He suggests that the recent dip in tech stocks is a good thing as a warning sign of the ongoing trade dispute between the US and China.",
  "shortSummary": "Athrope discusses the potential for a potential interest rate cut by the Fed, Chinese semiconductor production is halted amid tensions with the US and China.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "a71dfae090714dfa9fa3fdf4a038c601",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Nvidia has ordered suppliers to stop producing its H28 AI chip for the Chinese market amid security concerns, prompting a brief tech‑stock pullback and raising questions about the U.S.–China trade war.  Investors are watching the Fed’s Jackson Hole speech for clues on a September rate cut, while analysts note the S&P 500’s high valuations may soon correct.  In Asia, China is strengthening ties with India and Pakistan through the Shanghai Cooperation Organization and Belt‑and‑Road initiatives, even as the U.S. imposes tariffs that could be challenged in court.  Meanwhile, a Thai court cleared former Prime Minister Thaksin Shinawatra of a royal‑insult charge, easing political tensions that had weighed on the Thai market.",
  "argos_id": "D3WT1JXRZ"
}