{
  "url": "https://www.ajc.com/news/2025/08/asian-shares-track-wall-streets-rally-after-powell-hints-at-rate-cuts/",
  "authorsByline": "ELAINE KURTENBACH",
  "articleId": "de754c96fcae48c7b2680b3741697936",
  "source": {
    "domain": "ajc.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "GA",
      "county": "Fulton County",
      "city": "Atlanta",
      "coordinates": {
        "lat": 33.7489924,
        "lon": -84.3902644
      }
    }
  },
  "imageUrl": "https://www.ajc.com/resizer/v2/OQTQWTP7DNF7JKF3Z2XJREEQQA.jpg?auth=cb73fc2f8f7560604f96dddc60e708cec5efbb38cff00f173a99897624795695&width=1200&height=630&smart=true",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-25T05:33:04.493000+00:00",
  "addDate": "2025-08-25T05:41:09.103311+00:00",
  "refreshDate": "2025-08-25T05:41:09.103314+00:00",
  "score": 1.0,
  "title": "Asian shares track Wall Street's rally after Powell hints at rate cuts",
  "description": "Asian shares have tracked Wall Street's rally after the head of the Federal Reserve hinted that cuts to interest rates may be on the way",
  "content": "Hong Kong's Hang Seng index jumped 2.1% to 25,866.49, while the Shanghai Composite index surged 0.9% to 3,858.59. It's trading at its highest level in a decade, despite worries over higher tariffs on exports to the United States under Trump and weak domestic demand at home.\n\nTaiwan's Taiex was up 2.5% as semiconductor maker TSMC Corp.'s shares advanced 3.1%.\n\nThe Kospi in South Korea climbed 1.1% to 3,204.48.\n\nAustralia's S&P/ASX 200 edged 0.2% higher, while the SET in Bangkok gained 1%.\n\n“Asia is set to rally in catch-up mode, feeding off Wall Street’s Friday rebound after Powell cracked the door open to rate cuts,” Stephen Innes of SPI Asset Management said in a commentary.\n\nThis week, Nvidia's earnings report, due Wednesday after markets on Wall Street close, is a key focus of attention.\n\nNvidia's role as a key supplier of chips for artificial intelligence and its heavy weighting give it outsized influence as a bellwether for the broader market.\n\nOn Friday, the S&P 500 leaped 1.5% for its first gain in six days, closing at 6,466.91. That's just shy of its all-time high set last week.\n\nThe Dow Jones Industrial Average soared 846 points, or 1.9%, to its own record of 45,631.74. Nasdaq composite jumped 1.9% to 21,496.53.\n\nInvestors love lower interest rates, even if they risk adding to inflation.\n\nStocks of smaller companies led the way. They can benefit more from lower interest rates because of their need to borrow money to grow. The smaller stocks in the Russell 2000 index surged 3.9% for its best day since April.\n\nStill, Powell did not commit to any kind of timing. He said the job market looks OK, even if “it is a curious kind of balance” where fewer new workers are chasing after fewer new jobs. Inflation, meanwhile, still has the potential to push higher.\n\nThe yield on the 10-year Treasury fell to 4.25% from 4.33% late Thursday. The two-year Treasury yield, which more closely tracks expectations for Fed action, sank to 3.69% from 3.79% in a notable move for the bond market.\n\nIntel climbed 5.5% after Trump said the chip company has agreed to give the U.S. government a 10% stake in its business.\n\nNvidia rose 1.7% to trim its loss for the week. The company, whose chips are powering much of the world’s move in to artificial-intelligence technology, had seen its stock struggle recently amid criticism that it and other AI superstars shot too high, too fast and became too expensive.\n\nIn other dealings early Monday, U.S. benchmark crude oil gained 8 cents to $63.74 per barrel. Brent crude, the international standard, added 4 cents to $67.26 per barrel.\n\nThe U.S. dollar rose to 147.22 Japanese yen from 146.88 yen. The euro fell to $1.1707 from $1.1727.",
  "medium": "Article",
  "links": [
    "https://apnews.com/article/trump-tariffs-deadline-delay-d8ffef07d944dc1d460b472e4ffd2f57",
    "https://apnews.com/article/trump-intel-us-equity-stake-b538526b6698f7ebd31e99effd727693",
    "https://apnews.com/article/stocks-markets-powell-tariffs-trump-30c411cd18bf6a43cb787ac838b897f6",
    "https://apnews.com/article/china-us-chip-export-explainer-8c723003498b773b7fd3b266f5afa923",
    "https://apnews.com/hub/artificial-intelligence",
    "https://apnews.com/article/asia-shares-japan-bessent-wall-street-02e8aa1fa772ad3570249dc81f917325"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "lower interest rates",
      "weight": 0.0759257
    },
    {
      "name": "Wall Street",
      "weight": 0.07137181
    },
    {
      "name": "rate cuts",
      "weight": 0.06953857
    },
    {
      "name": "U.S. benchmark crude oil",
      "weight": 0.06267627
    },
    {
      "name": "artificial intelligence",
      "weight": 0.05860443
    },
    {
      "name": "other AI superstars",
      "weight": 0.057259183
    },
    {
      "name": "fewer new jobs",
      "weight": 0.054610502
    },
    {
      "name": "smaller companies",
      "weight": 0.053453043
    },
    {
      "name": "markets",
      "weight": 0.05304633
    },
    {
      "name": "0.2%",
      "weight": 0.052943174
    }
  ],
  "topics": [
    {
      "name": "Asian"
    },
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.994140625
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.9482421875
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.65283203125
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.38623046875
    }
  ],
  "sentiment": {
    "positive": 0.3784643,
    "negative": 0.48598745,
    "neutral": 0.1355482
  },
  "summary": "Asian shares have surged following Powell's comments that the Federal Reserve may cut interest rates. Hong Kong's Hang Seng index jumped 2.1% to 25,866.49, while the Shanghai Composite index surged 0.9% to 3,858.59. Despite concerns over higher tariffs on exports to the US under President Trump and weak domestic demand, Taiwan's Taiex was up 2.5% as semiconductor maker TSMC Corp.'s shares advanced 3.1%. The S&P 500 rose 1.5%. The Dow Jones Industrial Average soared 846 points, or 1.9%, to its own record of 45,631.74. The 10-year Treasury fell to 4.25% from 4.33% on Thursday. However, Powell did not commit to any timing.",
  "shortSummary": "Asian shares rose as investors welcomed potential interest rate cuts, despite concerns over higher tariffs and weak domestic demand.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "c35df22fa238427cb0ec98c1eddd2033",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://apnews.com/article/china-us-chip-export-explainer-8c723003498b773b7fd3b266f5afa923",
      "text": "How Nvidia’s chips became central to the U.S.-China trade war\nWhen Nvidia CEO Jensen Huang revealed Friday that the company is working with the Trump administration on a new computer chip designed for sale to China, it marked the latest chapter in a long-running debate over how the U.S. should compete with China’s technological ambitions.\nThe reasoning has sometimes changed — with U.S. officials citing national security, human rights or purely economic competition — but the tool has been the same: export controls, or the threat of them.\nNvidia believes it can eventually reap $50 billion from artificial intelligence chip sales in China. But it so far has been held back by restrictions imposed by President Joe Biden’s administration and then reinforced by President Donald Trump before negotiating a quid pro quo deal.\nHow did these chip export controls start?\nChina has its own chip foundries, but they have historically supplied only low-end processors used in autos and appliances. Beginning in 2014, the Chinese government tried to change that with a new “Big Fund” that invested huge amounts of money into hundreds of semiconductor companies.\nMeanwhile, the U.S. government, starting in Trump’s first term, began cutting off China’s access to a growing array of tools to make chips for computer servers, artificial intelligence and other advanced applications.\nChina was particularly irked when it was blocked from buying a machine available only from a Dutch company, ASML, that uses ultraviolet light to etch circuits into silicon chips. The restrictions stalled Chinese efforts to make transistors faster and more efficient by packing them more closely together on fingernail-size slivers.\nChinese telecommunications giant Huawei became the public face of the trade tensions, with U.S. claims of its products’ potential use for espionage a backdrop for a broader struggle for economic and technological dominance.\n“We don’t want their equipment in the United States because they spy on us,” Trump said in 2020 as the administration tightened restrictions to block Huawei from accessing chip technology, at the same time as he was threatening to ban TikTok on similar grounds.\nBiden ups the ante on chip restrictions\nPresident Joe Biden maintained those restrictions after taking office in 2021, but also ramped them up with a series of export controls that blocked sending to China the world’s most advanced chips and factory equipment.\nThat affected Chinese sales for California chipmaker Nvidia, the leading designer of the specialized chips needed for artificial intelligence technology.\nAfter the first restrictions took effect in 2022, blocking chips including Nvidia’s H100, the company designed a new kind of chip that was not quite advanced enough to meet the threshold for restrictions.\nThe Biden administration escalated its restrictions in 2023 to block those newer chips. Then Nvidia again came out with a new kind of chip that could slip into China: the H20.\nTrump’s back-and-forth on the H20\nThe Trump administration in April halted the sale of the H20 and other advanced computer chips to China over national security concerns, but Nvidia and AMD revealed in July that Washington would allow them to resume sales of their chips, which are used in AI development.\nAfter taking a $4.5 billion blow to its finances during the February-April period, Nvidia estimated the export crackdown in China would cost the company another $8 billion in potential sales from May through July.\nThe squandered opportunities fueled Huang’s efforts to persuade Trump and other administration officials that the restraints would do more harm than good for the U.S.\n“The question is not whether China will have AI, it already does,” Huang told analysts during a conference call in late May. “The question is whether one of the world’s largest AI markets will run on American platforms. Shielding Chinese chipmakers from U.S. competition only strengthens them abroad and weakens America’s position.”\nNvidia and AMD also agreed in August to share 15% of their revenues from chip sales to China with the U.S. government, as part of a deal to secure export licenses for the semiconductors."
    },
    {
      "url": "https://apnews.com/article/asia-shares-japan-bessent-wall-street-02e8aa1fa772ad3570249dc81f917325",
      "text": "Most US stocks fall after a disappointing inflation update, but Big Tech keeps Wall Street steady\nMost US stocks fall after a disappointing inflation update, but Big Tech keeps Wall Street steady\nNEW YORK (AP) — Most stocks fell on Wall Street Thursday after a disappointing report said inflation was worse last month at the U.S. wholesale level than economists expected. But gains for Amazon and some other influential Big Tech companies helped mask the losses.\nSeven out of every 10 stocks within the S&P 500 fell, though the index edged up by less than 0.1% to set another all-time high. The Dow Jones Industrial Average dipped 11 points, or less than 0.1%, and the Nasdaq composite dipped by less than 0.1% from its record set the day before.\nThe inflation report said that prices jumped 3.3% last month at the U.S. wholesale level from a year earlier. That was well above the 2.5% rate that economists had forecast, and it could hint at higher inflation ahead for U.S. shoppers as it makes its way through the system.\nThe data forced traders to second guess their widespread consensus that the Federal Reserve will cut interest rates at its next meeting in September. Lower rates can boost investment prices and the economy by making it cheaper for U.S. households and businesses to borrow to buy houses, cars or equipment, but they also risk worsening inflation.\n“This doesn’t slam the door on a September rate cut,” but it may raise some doubt, according to Chris Larkin, managing director, trading and investing, at E-Trade from Morgan Stanley.\nMost stocks fell on Wall Street after a report showed inflation was worse last month at the U.S. wholesale level than economists expected.\nTraders now see a 7.4% chance that the Fed may hold rates steady in September, according to data from CME Group. A day earlier, they were betting on a 100% certainty that the Fed would cut its main rate for the first time this year.\nHigher interest rates drag on all kinds of companies by keeping the cost to borrow high. They can hurt smaller companies in particular because they often need to borrow to grow. The Russell 2000 index of smaller U.S. stocks tumbled a market-leading 1.2%.\nThursday’s disappointing data followed an encouraging update earlier in the week on prices at the consumer level. A separate report on Thursday, meanwhile, said fewer U.S. workers applied for unemployment benefits last week. That’s a good sign for workers, indicating that layoffs remain relatively low at a time when job openings have become more difficult to find.\nBut a solid job market could also give the Fed less reason to cut interest rates in the short term.\nThe data helped send Treasury yields higher in the bond market. The yield on the 10-year Treasury climbed to 4.28% from 4.20% just before the data reports’ release and from 4.24% late Wednesday.\nOn Wall Street, Tapestry tumbled after the company behind the Coach and Kate Spade New York brands showed it’s feeling the pressure of tariffs.\nIt detailed how much profit it could lose in its upcoming fiscal year because of tariffs and duties, and its forecast for profit fell short of analysts’ expectations even though its forecast for revenue came in above. Its stock fell 15.7%, despite it also reporting a stronger profit for the latest quarter than analysts expected.\nDeere fell 6.8% even though the machinery maker likewise delivered a better profit than expected. There, too, the focus was on where profits are heading. It cut the top end of its forecasted range for profit this fiscal year and said its customers “remain cautious amid ongoing uncertainty.”\nOn the winning side of Wall Street was Fossil Group, which jumped 29.8% after the seller of watches and other accessories reported better profit than expected. It also announced a plan to strengthen its finances, while trimming its forecast for how much it expects worldwide net sales to fall this year.\nBig Tech stocks also helped mask Wall Street’s losses. Amazon rose 2.9% to add to its gains from the prior day when it announced same-day delivery of fresh groceries in more than 1,000 cities and towns.\nBecause Amazon is so huge, with a market value of $2.45 trillion, the movements for its stock carry much more weight on the S&P 500 than the typical company’s.\nAll told, the S&P 500 rose 1.96 to 6,468.54 points. The Dow Jones Industrial Average edged down 11.01 to 44,911.26, and the Nasdaq composite dipped 2.47 to 21.710.67.\nIn stock markets abroad, indexes were mixed across Asia and Europe ahead of a key meeting between U.S. President Donald Trump and Russian President Vladimir Putin on Friday.\n___\nAP Writers Teresa Cerojano and Matt Ott contributed."
    },
    {
      "url": "https://apnews.com/article/stocks-markets-powell-tariffs-trump-30c411cd18bf6a43cb787ac838b897f6",
      "text": "Walmart helps pull Wall Street to its 5th straight loss\nWalmart helps pull Wall Street to its 5th straight loss\nNEW YORK (AP) — Wall Street fell to a fifth straight loss on Thursday, hurt by a drop for Walmart and dampened hopes for coming cuts to interest rates.\nThe S&P 500 slipped 0.4%. All its losses have been relatively modest, but it has not risen since setting an all-time high last Thursday. The Dow Jones Industrial Average dropped 152 points, or 0.3%, and the Nasdaq composite fell 0.3%.\nWalmart was one of the market’s heaviest weights and dropped 4.5% after reporting a profit for the spring that came up short of analysts’ expectations, while Nvidia and other Big Tech stocks held a bit steadier following two days of sharp swings.\nThe moves were stronger in the bond market, where Treasury yields rose after a report forced Wall Street to scale back hopes that the Federal Reserve may soon deliver relief by cutting interest rates.\nU.S. stocks are falling after a weaker-than-expected profit report from a major retailer. The AP’s Seth Sutel reports.\nThe report suggested growth in U.S. business activity is accelerating and hit its fastest rate so far this year. That’s good news for the economy, but the preliminary data from S&P Global also said tariffs helped push up average selling prices at the fastest rate in three years. That’s a discouraging sign for inflation.\nTaken all together, such data has historically aligned more with the Federal Reserve considering a hike in interest rates, rather than a cut, according to Chris Williamson, chief business economist at S&P Global Market Intelligence.\nNo one expects a rate hike to happen, but the overwhelming expectation on Wall Street has been for coming cuts. Traders are betting on a nearly three-in-four chance that the Fed will lower its main interest rate at its next meeting in September, according to data from CME Group. The hope on Wall Street has been that Fed Chair Jerome Powell may give hints on Friday that easier rates may be coming.\nHe will be speaking in Jackson Hole, Wyoming, at an annual conference of central bankers that’s been home to big policy announcements in the past.\nA cut in interest rates would be the first of the year, and it would give investment prices and the economy a boost by potentially making it cheaper to borrow to buy cars or equipment. But it could also risk worsening inflation.\nThe Fed has been hesitant to cut interest rates this year out of fear that President Donald Trump’s tariffs could push inflation higher, but a surprisingly weak report on job growth earlier this month suddenly made the job market a bigger worry. Trump, meanwhile, has angrily pushed for cuts to interest rates, often insulting Powell while doing so.\nThe yield on the 10-year Treasury, which helps set rates for mortgages, rose to 4.32% from 4.29%. The two-year Treasury, which moves more on expectations for what the Federal Reserve will do with short-term interest rates, climbed to 3.78% from 3.74%.\nOn Wall Street, Walmart dropped even though it reported encouraging growth in revenue during the latest quarter and raised its forecast for profit over its full fiscal year.\nAnalysts said the market’s expectations were high coming into the report. The Bentonville, Arkansas, company’s stock came into the day with a gain of 13.5% for the year so far, more than the rest of the market.\nBig Tech stocks are under even more pressure to deliver bigger profits amid criticism that their stock prices ran too high, too fast and have become too expensive because of the frenzy around artificial-intelligence technology.\nSeveral AI superstar stocks have swung sharply this week, taking some shine off their skyscraping surges for the year, because of such criticism. But they held a bit steadier on Thursday.\nPalantir Technologies, which at one point on Wednesday was on track to fall more than 9% for a second straight day before paring its loss, rose 0.1%. Nvidia, the chip company that’s become the poster child of the AI boom, edged down 0.2%.\nCoty tumbled 21.6% after the beauty products company reported a loss for the latest quarter, when analysts expected a slight profit. The company, whose brands include CoverGirl and Joop!, said uncertainty about tariffs and the economy are making retailers cautious in their orders.\nOn the winning side of Wall Street was Nordson, which makes products and systems used for precision dispensing and other things. It delivered profit and revenue for the latest quarter that topped analysts’ expectations, and its stock rose 3%.\nAll told, the S&P 500 slipped 25.61 points to 6,370.17. The Dow Jones Industrial Average fell 152.81 to 44,785.50, and the Nasdaq composite sank 72.55 to 21,100.31.\nIn stock markets abroad, indexes were mixed across much of Europe and Asia.\nGermany, Europe’s largest economy, saw its DAX return 0.1% after U.S. and European Union officials offered a framework for their trade deal.\nJapan’s Nikkei 225 fell 0.6% after a survey showed Japan’s factory activity contracted again in August.\n___\nAP Writers Teresa Cerojano and Matt Ott contributed."
    },
    {
      "url": "https://apnews.com/article/trump-intel-us-equity-stake-b538526b6698f7ebd31e99effd727693",
      "text": "Trump turns $11.1B in US government funds into a 10% stake in downtrodden Intel\n▶ Follow live updates on President Donald Trump and his administration\nWASHINGTON (AP) — President Donald Trump on Friday announced the U.S. government has secured a 10% stake in struggling Silicon Valley pioneer Intel in a deal that was completed just a couple weeks after he was depicting the company’s CEO as a conflicted leader unfit for the job.\n“The United States of America now fully owns and controls 10% of INTEL, a Great American Company that has an even more incredible future,” Trump wrote in a post.\nThe U.S. government is getting the stake through the conversion of $11.1 billion in previously issued funds and pledges. All told, the government is getting 433.3 million shares of non-voting stock priced at $20.47 apiece — a discount from Friday’s closing price at $24.80. That spread means the U.S. government already has a gain of $1.9 billion, on paper.\nThe remarkable turn of events makes the U.S. government one of Intel’s largest shareholders at a time that the Santa Clara, California, company is in the process of jettisoning more than 20,000 workers as part of its latest attempt to bounce back from years of missteps taken under a variety of CEOs.\nIntel’s current CEO, Lip-Bu Tan, has only been on the job for slightly more than five months, an d earlier this month, it looked like he might be on shaky ground already after some lawmakers raised national security concerns about his past investments in Chinese companies while he was a venture capitalist. Trump latched on to those concerns in an August 7 post demanding that Tan resign.\nBut Trump backed off after the Malaysian-born Tan professed his allegiance to the U.S. in a public letter to Intel employees and went to the White House to meet with the president, leading to a deal that now has the U.S. government betting that the company is on the comeback trail after losing more than $22 billion since the end of 2023. Trump hailed Tan as “highly respected” CEO in his Friday post.\nIn a statement, Tan applauded Trump for “driving historic investments in a vital industry” and resolved to reward his faith in Intel. “We are grateful for the confidence the President and the Administration have placed in Intel, and we look forward to working to advance U.S. technology and manufacturing leadership,” Tan said.\nIntel’s current stock price is just slightly above where it was when Tan was hired in March and more than 60% below its peak of about $75 reached 25 years ago when its chips were still dominating the personal computer boom before being undercut by a shift to smartphones a few years later. The company’s market value currently stands at about $108 billion - a fraction of the current chip kingpin, Nvidia, which is valued at $4.3 trillion.\nThe stake is coming primarily through U.S. government grants to Intel through the CHIPS and Science Act that was started under President Joe Biden’s administration as a way to foster more domestic manufacturing of computer chips to lessen the dependence on overseas factories.\nBut the Trump administration, which has regularly pilloried the policies of the Biden administration, saw the CHIPs act as a needless giveaway and is now hoping to make a profit off the funding that had been pledged to Intel.\n“We think America should get the benefit of the bargain,” U.S. Commerce Secretary Howard Lutnick said earlier this week. “It’s obvious that it’s the right move to make.”\nAbout $7.8 billion had been been pledged to Intel under the incentives program, but only $2.2 billion had been funded so far. Another $3.2 billion of the government investment is coming through the funds from another program called “Secure Enclave.”\nAlthough U.S. government can’t vote with its shares and won’t have a seat on Intel’s board of directors, critics of the deal view it as a troubling cross-pollination between the public and private sectors that could hurt the tech industry in a variety of ways.\nFor instance, more tech companies may feel pressured to buy potentially inferior chips from Intel to curry favor with Trump at a time that he is already waging a trade war that threatens to affect their products in a potential scenario cited by Scott Lincicome, vice president of general economics for the Cato Institute.\n“Overall, it’s a horrendous move that will have real harms for U.S. companies, U.S. tech leadership, and the U.S. economy overall,” Lincicome posted Friday.\nThe 10% stake could also intensify the pressure already facing Tan, especially if Trump starts fixating on Intel’s stock price while resorting to his penchant for celebrating his past successes in business.\nNancy Tengler, CEO of money manager Laffer Tengler Investments, is among the investors who abandoned Intel years ago because of all the challenges facing Intel.\n“I don’t see the benefit to the American taxpayer, nor do I see the benefit, necessarily to the chip industry,” Tengler said while also raising worries about Trump meddling in Intel’s business.\n“I don’t care how good of businessman you are, give it to the private sector and let people like me be the critic and let the government get to the business of government.,” Tengler said.\nAlthough rare, it’s not unprecedented for the U.S. government to become a significant shareholder in a prominent company. One of the most notable instances occurred during the Great Recession in 2008 when the government injected nearly $50 billion into General Motors in return for a roughly 60% stake in the automaker at a time it was on the verge of bankruptcy. The government ended up with a roughly $10 billion loss after it sold its stock in GM.\nThe U.S. government’s stake in Intel coincides with Trump’s push to bring production to the U.S., which has been a focal point of the trade war that he has been waging throughout the world. By lessening the country’s dependence on chips manufactured overseas, the president believes the U.S. will be better positioned to maintain its technological lead on China in the race to create artificial intelligence.\nEven before gaining the 10% stake in Intel, Trump had been leveraging his power to reprogram the operations of major computer chip companies. The administration is requiring Nvidia and Advanced Micro Devices, two companies whose chips are powering the AI craze, to pay a 15% commission on their sales of chips in China in exchange for export licenses.\n—-\nLiedtke reported from San Ramon, California."
    },
    {
      "url": "https://apnews.com/article/trump-tariffs-deadline-delay-d8ffef07d944dc1d460b472e4ffd2f57",
      "text": "Trump’s latest tariff deadline is approaching. Here are the trade deals the US has announced so far\nNEW YORK (AP) — The clock is ticking closer to U.S. President Donald Trump’s latest tariff deadline of Aug 1. And while several more deals — or at least frameworks for deals — have been reached since his last tariff deadline of July 9 came and went, trade talks with many countries are still in flux.\nTrump unveiled sweeping import taxes on goods coming into the U.S. from nearly every country back in April. That included heightened so-called reciprocal rates for certain countries, the bulk of which have since been postponed twice.\nThe first 90-day pause arrived in an apparent effort to quell global market panic and facilitate country-by-country negotiations, with the Trump administration at one point setting a lofty goal of reaching 90 trade deals in 90 days.\nBut three months later, only two deals emerged: with the U.K. and Vietnam. A separate “framework” for a deal was hashed out with China. And by early July, Trump began sending warning letters that higher tariffs would be imposed against dozens of countries on Aug. 1.\nSince then, the U.S. has announced more trade frameworks. But, many key details remain sparse — or not immediately captured in writing.\nHere’s what we know about the agreements so far, in the order of those most recently announced.\nPakistan\nThe U.S. and Pakistan reached a trade agreement expected to allow Washington to help develop Pakistan’s largely untapped oil reserves and lower tariffs for the South Asian country, officials from both nations said Thursday.\nOfficials did not specify where the exploration would take place — and in a post on his Truth Social platform, Trump said “we are in the process of choosing the oil company that will lead this partnership.”\nPakistan’s Prime Minister Shehbaz Sharif welcomed the “long-awaited” deal and thanked Trump for playing a key role in finalizing it. Pakistan’s Finance Ministry said the agreement aims to boost bilateral trade, expand market access, attract investment and foster cooperation in areas of mutual interest.\nThe deal includes a reduction in reciprocal tariffs, particularly on Pakistani exports to the U.S., the statement from the ministry said. A new figure wasn’t immediately provided.\nSouth Korea\nTrump on Wednesday said the U.S. reached an agreement with Seoul on July 30 that would impose a 15% tariff for goods from South Korea.\nThe two countries have also agreed for South Korea to buy $100 billion in energy resources from the U.S. and for South Korea to give to the U.S. $350 billion for “investments owned and controlled by the United States, and selected by myself, as president,” Trump said.\nSouth Korean president Lee Jae Myung later added that the $350 billion investment fund is meant to solidify a foundation for bilateral cooperation on strategic industries — noting that the fund will support South Korean companies’ entrance to the U.S. market in areas such as shipbuilding, semiconductors, secondary batteries, biotechnology and energy.\nEuropean Union\nThe U.S. and the EU announced a trade framework that imposes 15% tariffs on most European goods — warding off Trump’s most recent threat of 30% if no deal had been reached by Aug. 1.\nBut some key details require more work. The headline of the agreement, unveiled July 27, is that the 15% tariff rate will apply to 70% of European goods brought into the U.S. — with the EU later confirming that that rate applies to pharmaceuticals, semiconductors, and car and car parts. But the remaining 30% of those imports is still open for negotiations.\nEuropean Commission President Ursula von der Leyen said that both sides had agreed to zero tariffs for a range of “strategic” goods. Meanwhile, Trump pointed to heightened investments from European companies in the U.S. — including what Trump said was $750 billion (638 billion euros) worth of natural gas, oil and nuclear fuel over three years, as well as an additional $600 billion (511 billion euros) under a political commitment that isn’t legally binding, officials said.\nJapan\nOn July 22, Trump announced a trade framework to impose 15% tariffs on Japan — down from his previously-threatened rate of 25%. The U.S. president also said Japan would invest $550 billion into the U.S. and would “open” its economy to American autos and rice.\nThe newly-agreed on 15% tariff rate also applies to Japanese cars — marking a welcome relief for automakers like Toyota Motor Corp. and Honda — which, like other automakers, have faced a 25% levy on key parts and finished vehicles going into the U.S. since earlier this year. But car companies in other countries, including U.S. competitors, worry that this could put them at a disadvantage.\nPhilippines\nShortly after a July 22 meeting with Philippine President Ferdinand Marcos, Jr., Trump announced that he would lower his upcoming tariffs on imports from the country to 19% — down just 1% from his previous threat of 20%.\nIn return, Trump said on Truth Social, the U.S. would not pay tariffs on American goods it shipped to the Philippines. But additional details remained unclear. Marcos said his country was considering options such as having an open market without tariffs for U.S. automobiles, but emphasized details were still left to be worked out.\nIndonesia\nOn July 15, Trump again took to social media to announce that he’s agreed to lower his planned tariffs on Indonesian goods to 19% — down from a previously-threatened levy of 32% — while American goods sent to the southeast Asian country will face no tariffs. A fact sheet from the White House later confirmed that “over 99% of U.S. products” exported to Indonesia would be sent duty-free.\nIndonesian President Prabowo Subianto said he will continue to negotiate with Trump, in hopes of further lowering the coming U.S. tariffs.\nVietnam\nOn July 2, Trump announced a trade deal with Vietnam that he said would allow U.S. goods to enter the country duty-free. Vietnamese exports to the U.S., by contrast, would face a 20% levy.\nThat’s less than half the 46% “reciprocal” rate Trump proposed for Vietnamese goods back in April. But in addition to the new 20% tariff rate, Trump said the U.S. would impose a 40% tax on “transshipping’’ — targeting goods from another country that stop in Vietnam on their way to the United States. Washington complains that Chinese goods have been dodging higher U.S. tariffs by transiting through Vietnam.\nUnited Kingdom\nOn May 8, Trump agreed to cut tariffs on British autos, steel and aluminum, among other trade pledges — while the U.K. promised to reduce levies on U.S. products like olive oil, wine and sports equipment. The deal was announced in grandiose terms by both countries, but some key details remained unknown for weeks.\nWhen the deal was announced, for example, the British government notably said that the U.S. agreed to exempt the U.K. from its then-universal 25% duties on foreign steel and aluminum — which would have effectively allowed both metals from the country to come into the U.S. duty-free.\nBut the timing for when those cuts would actually take effect stayed up in the air for almost a month. It wasn’t until early June, when Trump hiked his steel and aluminum tariffs to a punishing 50% worldwide, that the U.S. acknowledged it was time to implement the agreement. And even then, U.S. tariffs on British steel and aluminum did not go to zero. The U.K. was the only country spared from Trump’s new 50% levies, but still faces 25% import taxes on the metals.\nChina\nAt its peak, Trump’s new tariffs on Chinese goods totaled 145% — and China’s countertariffs on American products reached 125%. But on May 12, the countries agreed to their own 90-day truce to roll back those levies to 30% and 10%, respectively. And in June, details began trickling in about a tentative trade agreement.\nU.S. Treasury Secretary Scott Bessent said that China had agreed to make it easier for American firms to acquire Chinese magnets and rare earth minerals critical for manufacturing and microchip production. Meanwhile, the Chinese Commerce Ministry said that the U.S. would “lift a series of restrictive measures it had imposed on China.”\nOther key details of the deal remain murky — including the timing of implementation for these terms. On July 29, China’s top trade official said the two sides had agreed to work on extending an Aug. 12 deadline for new tariffs on each other, following a two-day trade meeting in Stockholm. The U.S. side said extension plans were discussed, but not decided.\n_________\nAssociated Press reporters from all over the world contributed to this report."
    }
  ],
  "argos_summary": "Asian stock indices rose, with Hong Kong, Shanghai, Taiwan, Korea, Australia and Thailand all up, buoyed by optimism about U.S. rate cuts and Nvidia’s prominence in AI chips. In the U.S., markets were mixed after disappointing inflation data, but big‑tech names like Nvidia and Amazon helped cushion losses, while Intel gained a 10% government stake amid Trump’s push for domestic chip production. The Trump administration announced trade frameworks with Pakistan, South Korea, the EU, Japan, the Philippines, Indonesia, Vietnam, the UK and China, aiming to reduce tariffs and secure strategic investments. Fed policy remains uncertain, with yields falling and investors weighing potential rate cuts against inflation risks.",
  "argos_id": "D7KU9R70O"
}