{
  "url": "https://www.washingtontimes.com/news/2025/aug/25/district-sports-new-book-chronicles-jannik-sinner-carlos-alcaraz/",
  "authorsByline": "https://www.washingtontimes.com/staff/george-gerbo/, George Gerbo, The Washington Times https://www.washingtontimes.com",
  "articleId": "0ac8dbfa9e134f66bc5de407e2e74370",
  "source": {
    "domain": "washingtontimes.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "DC",
      "city": "Washington",
      "coordinates": {
        "lat": 38.8949924,
        "lon": -77.0365581
      }
    }
  },
  "imageUrl": "https://twt-thumbs.washtimes.com/media/image/2025/08/21/US_Open_Preview_Tennis_52019_c0-360-8640-5400_s1200x700.jpg?e5529ed7d93258f12cf7b2259d397368871d9cb1",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-25T05:36:47+00:00",
  "addDate": "2025-08-25T05:47:16.782735+00:00",
  "refreshDate": "2025-08-25T05:47:16.782739+00:00",
  "score": 1.0,
  "title": "District of Sports: New book chronicles Jannik Sinner, Carlos Alcaraz and tennis’ next era",
  "description": "Just as men’s tennis has been transitioning out of the “Big Three” era, a budding rivalry has begin to appear in its place that, in its infancy, has delivered much of the same thrill and fervor.",
  "content": "Just as men’s tennis has been transitioning out of the “Big Three” era, a budding rivalry has begin to appear in its place that, in its infancy, has delivered much of the same thrill and fervor.\n\nCarlos Alcaraz and Jannik Sinner have quickly infused their own dominance into the annals of the sport, as the Spaniard and Italian have combined to win each of the last seven Grand Slam titles dating back to the 2024 Australian Open.\n\nThe top two players in the world, Sinner and Alcaraz have met in the last two of those Slam finals, including an indelible, five-setter for the record books at Roland Garros — won by Alcaraz in a tiebreak after he lost the first two sets and Sinner had three match points in the fourth.\n\nWith their paths now inexorably intertwined, it sets the stage for another potential clash at the final major of the year, the U.S. Open in New York. Can anyone derail the duo? And what about the chances of the leading American men, including Taylor Fritz, Ben Shelton and Hyattsville, Maryland, native Frances Tiafoe, who reached the semifinals of the U.S. Open just last year before losing to Sinner, the eventual champion?\n\nOn this edition of District of Sports, we break down all of that and more with tennis writer Giri Nathan, author of the new book Changeover: A Young Rivalry and a New Era of Men’s Tennis. Nathan discusses the onus for the book, the difference between this rivalry and the one between Roger Federer, Rafael Nadal and Novak Djokovic, Tiafoe’s chances for a breakthrough in this new era, and more.\n\nChangeover is out now and available wherever books are sold.",
  "medium": "Article",
  "links": [
    "https://x.com/girinathan",
    "https://www.simonandschuster.com/books/Changeover/Giri-Nathan/9781668076248",
    "https://goo.gl/forms/xGjXcUKYsKxMeCUl1"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "New book",
      "weight": 0.100869484
    },
    {
      "name": "Jannik Sinner",
      "weight": 0.092510425
    },
    {
      "name": "Sinner",
      "weight": 0.0841485
    },
    {
      "name": "tennis writer Giri Nathan",
      "weight": 0.08270068
    },
    {
      "name": "books",
      "weight": 0.081504725
    },
    {
      "name": "Carlos Alcaraz",
      "weight": 0.079952694
    },
    {
      "name": "Alcaraz",
      "weight": 0.07179411
    },
    {
      "name": "Frances Tiafoe",
      "weight": 0.06987953
    },
    {
      "name": "Australian Open",
      "weight": 0.06832142
    },
    {
      "name": "Grand Slam",
      "weight": 0.068308584
    }
  ],
  "topics": [
    {
      "name": "Books"
    },
    {
      "name": "Tennis"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.96435546875
    },
    {
      "name": "/Sports/International Sports Competitions/Other",
      "score": 0.72900390625
    },
    {
      "name": "/Sports/Individual Sports/Racquet Sports",
      "score": 0.52197265625
    }
  ],
  "sentiment": {
    "positive": 0.2295336,
    "negative": 0.3417328,
    "neutral": 0.42873362
  },
  "summary": "A new book by tennis writer Giri Nathan chronicles the rivalry between Carlos Alcaraz and Jannik Sinner, who have won each of the last seven Grand Slam titles dating back to the 2024 Australian Open. The book also discusses the potential clash between the top two players in the world at the U.S. Open, which will take place at the end of the year. The author discusses the difference between this rivalry and the one between Roger Federer, Rafael Nadal and Novak Djokovic, and the potential for American men to break into the sport.",
  "shortSummary": "The new book \"Changeover\" explores a rivalry between top players like Carlos Alcaraz and Jannik Sinner, transitioning to a more traditional era of men's tennis.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "dd865b1b6734411e9142b13d38c30870",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "The article highlights the emerging rivalry between Carlos Alcaraz and Jannik Sinner, who have won the last seven Grand Slam titles since the 2024 Australian Open and faced each other in recent finals, including a dramatic five‑set French Open showdown. It anticipates a possible clash between the two at the U.S. Open while discussing the prospects of American players such as Taylor Fritz, Ben Shelton, and Frances Tiafoe. Tennis writer Giri Nathan, author of \"Changeover: A Young Rivalry and a New Era of Men’s Tennis,\" offers insights into how this new rivalry differs from the Federer‑Nadal‑Djokovic era and the potential for a breakthrough for Tiafoe and other U.S. competitors.",
  "argos_id": "D8SBXULJW"
}