{
  "url": "https://www.startribune.com/photo-essay-life-in-la-swings-between-courage-and-caution-for-thousands-after-immigration-raids/601460622",
  "authorsByline": "JAE C. HONG",
  "articleId": "59ce414b68fd46cd8aea041c1eb332c4",
  "source": {
    "domain": "startribune.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "MN",
      "county": "Hennepin County",
      "city": "Minneapolis",
      "coordinates": {
        "lat": 44.9772995,
        "lon": -93.2654692
      }
    }
  },
  "imageUrl": "https://www.startribune.com/200.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-25T04:34:02.422000+00:00",
  "addDate": "2025-08-25T04:48:56.410124+00:00",
  "refreshDate": "2025-08-25T04:48:56.410126+00:00",
  "score": 1.0,
  "title": "PHOTO ESSAY: Life in LA swings between courage and caution for thousands after immigration raids",
  "description": "Three months after aggressive immigration raids began in Southern California, everyday life has shifted. Masked agents pull up, and neighbors mount quick protests. Priests bring Communion to homes. Children log on to class instead of walking to school. Still, people step out — the rent is due. Work doesn't pause.",
  "content": "LOS ANGELES — Three months after aggressive immigration raids began in Southern California, everyday life has shifted. Masked agents pull up, and neighbors mount quick protests. Priests bring Communion to homes. Children log on to class instead of walking to school. Still, people step out — the rent is due. Work doesn't pause.\n\nThe Trump administration's focus on arresting people suspected of living in the country illegally has transformed life for tens of thousands of people in Los Angeles County, the nation's most populous county. About a third of the county's 10 million residents are foreign-born, and an untold number of people are now trying to live without being seen.\n\nDay laborers still gather at a Home Depot lot in Los Angeles' Van Nuys neighborhood, despite several raids there by immigration agents. A new sign outside a day labor center warns law enforcement not to enter the building without a warrant. Antonio from Guatemala — who, like other migrants interviewed for this article, didn't want to reveal his full name because he doesn't want to identify himself to the authorities — shows up in his pickup truck and with a whistle, ready to warn if agents from U.S. Customs and Immigration Enforcement are coming. He said he is vigilant all the time but refuses to live a life in hiding.\n\nStreet vendor Carmen, an immigrant from Guatemala, glances both ways as she fills a cup with fruit juice on a Los Angeles sidewalk. Juan Manuel runs his clothing subcontracting shop with its folding metal shutter shut and locked from the inside. Another contractor couple works at a sewing machine with their three daughters beside them, instead of sending the girls to summer programs. They work at night instead of during the day to avoid detection.\n\nThe smell of tear gas has long since faded outside the downtown Metropolitan Detention Center, where National Guard troops and Marines stood guard in response to protests. The armored vehicles are gone, but a lone American flag still hangs upside down from a pole placed nearby.\n\nOn Olvera Street, a popular Mexican marketplace, young server Diego Garcia smiles as he takes an order. Elsewhere, vendors glance up whenever helicopters fly by. Missing person signs are posted by families searching for loved ones they believe have been arrested by immigration officers.\n\nFor these communities, life swings between courage and caution. Making ends meet comes first for many. Fear is just an inconvenience.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Los Angeles County",
      "weight": 0.07103865
    },
    {
      "name": "Los Angeles",
      "weight": 0.07044378
    },
    {
      "name": "immigration agents",
      "weight": 0.06834056
    },
    {
      "name": "aggressive immigration raids",
      "weight": 0.06742594
    },
    {
      "name": "everyday life",
      "weight": 0.06573058
    },
    {
      "name": "immigration raids",
      "weight": 0.06563396
    },
    {
      "name": "Life",
      "weight": 0.062125556
    },
    {
      "name": "life",
      "weight": 0.062125556
    },
    {
      "name": "people",
      "weight": 0.06124015
    },
    {
      "name": "young server Diego Garcia",
      "weight": 0.060677193
    }
  ],
  "topics": [
    {
      "name": "Social Issues"
    },
    {
      "name": "US Politics"
    },
    {
      "name": "Immigration"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/People & Society/Social Issues & Advocacy/Other",
      "score": 0.9453125
    },
    {
      "name": "/Law & Government/Government/Visa & Immigration",
      "score": 0.93408203125
    },
    {
      "name": "/Sensitive Subjects/Other",
      "score": 0.7919921875
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.6240234375
    },
    {
      "name": "/News/Local News",
      "score": 0.5537109375
    },
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.54931640625
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.423095703125
    },
    {
      "name": "/News/Other",
      "score": 0.40283203125
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.329345703125
    }
  ],
  "sentiment": {
    "positive": 0.046310455,
    "negative": 0.7452264,
    "neutral": 0.20846315
  },
  "summary": "The focus of immigration raids in Los Angeles County, the nation's most populous county, has transformed everyday life in Southern California for tens of thousands of people. About a third of the county's 10 million residents are foreign-born, and many are now trying to live without being seen. Despite the recent raids, life continues to thrive, with day laborers still gathering at a Home Depot lot in the Van Nuys neighborhood, and a new sign outside a day labor center warns law enforcement not to enter without a warrant. The focus on immigration arrests has led to increased vigilance and caution, with many choosing to live a life in hiding.",
  "shortSummary": "The Trump administration's aggressive immigration raids in Southern California have transformed life for tens of thousands of undocumented immigrants, leading to daily struggles for survival and livelihood.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "18d3231598994914b12ee8b4c239d254",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Three months after aggressive immigration raids in Los Angeles County, everyday life has shifted as masked agents patrol neighborhoods and residents live in constant fear. Day laborers, street vendors, and families continue to work and gather, often at night or in hidden spaces, while protests and signs of missing persons underscore the tension. Despite the threat, people still pay rent and keep working, balancing caution with the need to survive.",
  "argos_id": "DOTJVRVC1"
}