{
  "url": "https://thehill.com/homenews/ap/ap-international/ap-sole-survivor-of-australian-mushroom-poisoning-grieves-loss-of-wife-and-friends/",
  "authorsByline": "ROD McGUIRK, Associated Press",
  "articleId": "2f3b9afe47464220a508d37ab60ed751",
  "source": {
    "domain": "thehill.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "DC",
      "city": "Washington",
      "coordinates": {
        "lat": 38.8949924,
        "lon": -77.0365581
      }
    }
  },
  "imageUrl": "https://thehill.com/wp-content/uploads/sites/2/2025/08/68abd1f69f5b25.71242320.jpeg?w=1280",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-25T02:53:05+00:00",
  "addDate": "2025-08-25T03:09:55.846006+00:00",
  "refreshDate": "2025-08-25T03:09:55.846008+00:00",
  "score": 1.0,
  "title": "Sole survivor of Australian mushroom poisoning grieves loss of wife and friends",
  "description": "MELBOURNE, Australia (AP) — The sole survivor of a deadly lunch laced with toxic mushrooms said on Monday he felt only half alive following the death of his wife and he continued to grieve the loss…",
  "content": "MELBOURNE, Australia (AP) — The sole survivor of a deadly lunch laced with toxic mushrooms said on Monday he felt only half alive following the death of his wife and he continued to grieve the loss of his two closest friends.\n\nIan Wilkinson read the first victim impact statement in the Victoria state Supreme Court at the sentencing hearing of Erin Patterson.\n\nA jury convicted Patterson, 50, in July of murdering Wilkinson’s wife Heather Wilkinson, her sister Gail Patterson, and her husband Don Patterson with a lunch of beef Wellington pastries and foraged death cap mushrooms in July 2023.\n\nErin Patterson was also convicted of attempting to murder Ian Wilkinson, who spent weeks in hospital and survived after receiving a liver transplant.\n\nWilkinson, a Baptist pastor, described his wife as a woman who took her faith seriously and was full of love, joy, peace, patience, kindness, gentleness, faithfulness and self-control.\n\n“I only feel half alive without her,” Wilkinson said before weeping.\n\n“It’s one of the distressing shortcomings of our society that so much attention is showered on those who do evil and so little on those who do good,” he added.\n\nHe described Gail and Don Patterson, the parents of Erin Patterson’s estranged husband Simon Patterson, as the closest people to him after his wife and family.\n\n“My life is greatly impoverished without them,” Wilkinson said.\n\n“I’m distressed that Erin has acted with callous and calculated disregard for my life and the lives of those I love. What foolishness possesses a person to think that murder could be the solution to their problems, especially the murder of people who have only good intentions towards her?” he added.\n\nWilkinson offered Patterson his forgiveness for the harms she had done to him.\n\n“I say ‘harms done to me’ advisedly. I have no power or responsibility to forgive harms done to others,” Wilkinson said.\n\n“My prayer for her is that she will use her time in jail wisely to become a better person,” he added.\n\nErin Patterson attended the Melbourne court in person on Monday rather than watch via a video link from prison which she did during a hearing earlier this month. She wore a paisley top with a light brown jacket.\n\nSeven relatives of victims either read impact statements to the court on Monday or had them read on their behalf.\n\nThe sentencing hearing is scheduled to continue on Tuesday.\n\nShe faces a potential life sentence for each of the murders and 25 years for attempted murder.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Erin Patterson",
      "weight": 0.09651225
    },
    {
      "name": "Gail Patterson",
      "weight": 0.08685456
    },
    {
      "name": "Ian Wilkinson",
      "weight": 0.08633046
    },
    {
      "name": "Don Patterson",
      "weight": 0.086076856
    },
    {
      "name": "Simon Patterson",
      "weight": 0.08254998
    },
    {
      "name": "Heather Wilkinson",
      "weight": 0.08242084
    },
    {
      "name": "Wilkinson",
      "weight": 0.081108816
    },
    {
      "name": "Patterson",
      "weight": 0.08102615
    },
    {
      "name": "foraged death cap mushrooms",
      "weight": 0.07253755
    },
    {
      "name": "attempted murder",
      "weight": 0.06627517
    }
  ],
  "topics": [
    {
      "name": "Australia"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/Sensitive Subjects/Death & Tragedy",
      "score": 0.98291015625
    },
    {
      "name": "/News/Other",
      "score": 0.94189453125
    },
    {
      "name": "/News/Local News",
      "score": 0.857421875
    },
    {
      "name": "/Sensitive Subjects/Violence & Abuse",
      "score": 0.5947265625
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.515625
    }
  ],
  "sentiment": {
    "positive": 0.05598644,
    "negative": 0.7278179,
    "neutral": 0.21619564
  },
  "summary": "Australian man, Ian Wilkinson, the sole survivor of a deadly lunch laced with toxic mushrooms, read the first victim impact statement at the sentencing hearing of Erin Patterson, who was convicted in July of murdering Wilkinson's wife, her sister Gail Patterson, and her husband Don Patterson. Wilkinson, a Baptist pastor, described his wife as a woman who took her faith seriously and was full of love, joy, peace, patience, kindness, gentleness, and faith. Patterson was also convicted of attempting to murder Wilkinson. The sentencing hearing continues.",
  "shortSummary": "The sole survivor of a deadly mushroom poisoning case in Australia, Erin Patterson, said he felt only half alive without his wife and two close friends.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "6121f5b2fba142848f339de18272387c",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Erin Patterson was convicted of murdering Ian Wilkinson’s wife, her sister, and her husband with a lunch laced with death‑cap mushrooms, and of attempting to murder Wilkinson himself. At the sentencing hearing, Wilkinson, a Baptist pastor, read a victim impact statement expressing deep grief, calling the loss of his wife and friends a profound impoverishment of his life, and offered forgiveness to Patterson. He lamented that society focuses more on the perpetrators than on those who suffer. Patterson attended the court in person and faces a potential life sentence for each murder and 25 years for the attempted murder. The sentencing hearing is scheduled to continue the following day.",
  "argos_id": "DXOR6WEED"
}