{
  "url": "https://www.huffpost.com/entry/israeli-airstrikes-yemen-capital-houthis_n_68ab345ce4b0943e34b745c4",
  "authorsByline": "AP",
  "articleId": "7ba780671e4c4119806b51b34519ddd5",
  "source": {
    "domain": "huffpost.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://img.huffingtonpost.com/asset/68ab345e170000f54863ef67.jpeg?cache=53nOFZ7Cyj&ops=1778_1000",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-24T16:11:48+00:00",
  "addDate": "2025-08-24T16:26:37.152137+00:00",
  "refreshDate": "2025-08-24T16:26:37.152140+00:00",
  "score": 1.0,
  "title": "Israeli Airstrikes Hit Yemen’s Capital To Target Iran-backed Houthis",
  "description": "The strikes come just days after Houthi rebels fired a missile toward Israel, which the military said was the first cluster bomb launched by the rebels since 2023.",
  "content": "CAIRO (AP) — Israeli airstrikes hit Yemen’s capital on Sunday, just days after the Houthi rebels fired a missile toward Israel that its military described as the first cluster bomb the rebels had fired at it since 2023.\n\nThe Iranian-backed Houthis said the strikes hit multiple areas across Sanaa. The Houthi-run health ministry said that at least two people were killed and 35 others were wounded.\n\nSanaa residents told The Associated Press they heard loud explosions close to a closed military academy and the presidential palace. They said they could see plumes of smoke near Sabeen Square, a central gathering place in the capital.\n\nThe Houthis have launched missiles and drones toward Israel and targeted ships in the Red Sea for over 22 months, saying they are attacking in solidarity with Palestinians amid the war in Gaza.\n\nThe Israeli strikes were the first to hit Yemen since a week ago, when Israel said it targeted energy infrastructure it believed was used by the rebels.\n\nThe latest strikes follow the Houthis’ claim of launching a newly equipped missile toward Israel on Friday, including targeting the country’s largest airport, Ben Gurion. There was no reported damage or injuries. Israel’s military said it fragmented mid-air after several interception attempts.\n\nAn Israeli Air Force official, speaking on condition of anonymity in line with military regulations, called the projectile fired on Friday a new threat. It was a cluster munition, he said, meant to detonate into multiple explosives on impact.\n\nFrom November 2023 to December 2024, the Houthis targeted more than 100 ships with missiles and drones. The rebels stopped their attacks during a brief ceasefire in Gaza and later became the target of a weekslong airstrike campaign ordered by U.S. President Donald Trump.\n\nIn May, the United States announced a deal with the Houthis to end the airstrikes in return for an end to shipping attacks, although the rebel group said the agreement did not include halting attacks on targets it believed were aligned with Israel.\n\nFor two decades, HuffPost has been fearless, unflinching, and relentless in pursuit of the truth. Support our mission to keep us around for the next 20 — we can't do this without you. We remain committed to providing you with the unflinching, fact-based journalism everyone deserves. Thank you again for your support along the way. We’re truly grateful for readers like you! Your initial support helped get us here and bolstered our newsroom, which kept us strong during uncertain times. Now as we continue, we need your help more than ever. We hope you will join us once again. We remain committed to providing you with the unflinching, fact-based journalism everyone deserves. Thank you again for your support along the way. We’re truly grateful for readers like you! Your initial support helped get us here and bolstered our newsroom, which kept us strong during uncertain times. Now as we continue, we need your help more than ever. We hope you will join us once again. Support HuffPost Already contributed? Log in to hide these messages.",
  "medium": "Article",
  "links": [
    "https://www.huffpost.com/news/topic/donald-trump",
    "https://www.huffpost.com/support?utm_campaign=mid-article-web",
    "https://apnews.com/hub/israel-hamas-war",
    "https://apnews.com/article/trump-houthis-end-of-bombing-yemen-israel-e2f08ac04024ef3d6409b4ce97092489",
    "https://login.huffpost.com/login?dest=https%3A%2F%2Fwww.huffpost.com%2Fentry%2Fisraeli-airstrikes-yemen-capital-houthis_n_68ab345ce4b0943e34b745c4%3Fhp_auth_done%3D1",
    "https://apnews.com/article/yemen-houthis-us-uk-airstrikes-israel-hamas-war-9ab021aac8f01694fa98619e3ffe92ba",
    "https://apnews.com/article/houthi-shipping-attacks-israel-red-sea-002a52ed270245427fbe29a0118c3711",
    "https://apnews.com/article/un-yemen-houthis-resolution-red-sea-attacks-50c0ba1045fc5c01838a780d05182c9e",
    "https://www.huffpost.com/support"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Israeli Airstrikes",
      "weight": 0.067464255
    },
    {
      "name": "Israeli airstrikes",
      "weight": 0.067464255
    },
    {
      "name": "Israel",
      "weight": 0.0656855
    },
    {
      "name": "Houthis",
      "weight": 0.06428472
    },
    {
      "name": "military regulations",
      "weight": 0.05768762
    },
    {
      "name": "shipping attacks",
      "weight": 0.05715396
    },
    {
      "name": "Israeli Air Force",
      "weight": 0.0540965
    },
    {
      "name": "missiles",
      "weight": 0.054070197
    },
    {
      "name": "U.S. President Donald Trump",
      "weight": 0.053111415
    },
    {
      "name": "Yemen",
      "weight": 0.051308736
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/Sensitive Subjects/War & Conflict",
      "score": 0.986328125
    },
    {
      "name": "/News/Other",
      "score": 0.9541015625
    },
    {
      "name": "/News/World News",
      "score": 0.9541015625
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.9072265625
    },
    {
      "name": "/Law & Government/Military/Other",
      "score": 0.533203125
    }
  ],
  "sentiment": {
    "positive": 0.246532,
    "negative": 0.41536567,
    "neutral": 0.33810237
  },
  "summary": "Israeli airstrikes targeted Yemen's capital Sanaa, killing at least two people and injuring 35 others. The strikes were the first to hit Yemen since a week ago when Israel targeted energy infrastructure it believed was used by the rebels. The Houthis have been launching missiles and drones towards Israel and have been doing so for over 22 months, claiming they are supporting Palestinians in the war in Gaza. The latest strikes follow a claim by the Houthis that they had launched a newly equipped missile toward Israel, which Israel's military described as the first such attack since 2023.",
  "shortSummary": "Israeli airstrikes targeted Houthi rebels in Yemen’s capital, Sanaa, after they fired a missile near Israel, leaving two dead and 35 wounded.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "c42b4e0c21134f3aa07bc0e0626707ce",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://apnews.com/article/yemen-houthis-us-uk-airstrikes-israel-hamas-war-9ab021aac8f01694fa98619e3ffe92ba",
      "text": "UK military launches airstrikes with US targeting Yemen’s Houthi rebels\nDUBAI, United Arab Emirates (AP) — The British military launched airstrikes with the United States targeting Yemen’s Houthi rebels, officials said early Wednesday, their first attack in Washington’s new intense campaign targeting the Iran-backed group.\nThe United Kingdom offered a detailed explanation for launching the strike, in a departure from the U.S., which has offered few details about what it says are more than 1,000 targets it has hit since beginning its campaign on March 15.\nThe campaign, called “Operation Rough Rider,” has been targeting the rebels as the Trump administration negotiates with their main benefactor, Iran, over Tehran’s rapidly advancing nuclear program.\nUK strike hits near Yemen’s capital\nThe U.K. Defense Ministry described the site attacked as “a cluster of buildings, used by the Houthis to manufacture drones of the type used to attack ships in the Red Sea and Gulf of Aden, located some 15 miles (25 kilometers) south of Sanaa.”\nRoyal Air Force Typhoon FGR4s took part in the raid, dropping Paveway IV guided bombs, the ministry added.\n“The strike was conducted after dark, when the likelihood of any civilians being in the area was reduced yet further,” the ministry said.\nThe British offered no information on the damage done in the strike, nor whether they believed anyone had been killed.\nThe U.S. military’s Central Command didn’t acknowledge the strike.\n“This action was taken in response to a persistent threat from the Houthis to freedom of navigation,” U.K. Defense Secretary John Healey said. “A 55% drop in shipping through the Red Sea has already cost billions, fueling regional instability and risking economic security for families in the U.K.”\nThe Houthis reported several strikes around Yemen’s capital, Sanaa, which the group has held since 2014. Other strikes hit around Saada.\nThe British have taken part in airstrikes alongside the U.S. since the Biden administration began its campaign of strikes targeting the Houthis back in January 2024. However, this new strike is the first to see the British involved in the campaign under U.S. President Donald Trump.\nUK strike comes after US allegedly hit prison\nThe joint U.K.-U.S. strike follows an alleged U.S. airstrike on Monday that hit a prison holding African migrants, killing at least 68 people and wounding 47 others. The U.S. military said it was investigating.\nOn April 18, an American strike on the Ras Isa fuel port killed at least 74 people and wounded 171 others in the deadliest known attack of the U.S. campaign.\nThe U.S. is conducting strikes on Yemen from its two aircraft carriers in the region — the USS Harry S. Truman in the Red Sea and the USS Carl Vinson in the Arabian Sea, targeting the Houthis because of the group’s attacks on shipping in the Red Sea, a crucial global trade route, and on Israel.\nThe Houthis are the last militant group in Iran’s self-described “Axis of Resistance” that is capable of regularly attacking Israel. The rebels began their attacks over the Israel-Hamas war in the Gaza Strip and the Israeli decision to block the flow of aid to Palestinians.\nThe American strikes have drawn controversy in the United States over Defense Secretary Pete Hegseth’s use of the unclassified Signal messaging app to post sensitive details about the attacks.\nEarly Thursday, Hegseth directly threatened Iran in a message on the social platform X.\n“Message to IRAN: We see your LETHAL support to The Houthis. We know exactly what you are doing,” he wrote. “You know very well what the U.S. Military is capable of — and you were warned. You will pay the CONSEQUENCE at the time and place of our choosing.”"
    },
    {
      "url": "https://apnews.com/article/houthi-shipping-attacks-israel-red-sea-002a52ed270245427fbe29a0118c3711",
      "text": "Yemen’s Houthi rebels threaten to escalate attacks on ships linked to companies dealing with Israel\nYemen’s Houthi rebels threaten to escalate attacks on ships linked to companies dealing with Israel\nATHENS, Greece (AP) — Yemen’s Houthi rebels said they will target merchant ships belonging to any company that does business with Israeli ports, regardless of nationality, as part of what they say is a new phase of their operations against Israel.\nThe Iran-backed Houthis launched a campaign targeting ships in response to the Israel-Hamas war in the Gaza Strip, saying they were doing so in solidarity with the Palestinians. Their attacks over the past two years have upended shipping in the Red Sea, through which about $1 trillion of goods passes each year.\nIn an announcement late Sunday night, the Houthis said they had “decided to escalate their military support operations and begin implementing the fourth phase of the naval blockade” against Israel.\nThey warned that they would target “all ships belonging to any company that deals with the ports of the Israeli enemy, regardless of the nationality of that company, and in any location within the reach of our armed forces.” The vessels would be targeted regardless of their destination, they added.\nThe group said countries should pressure Israel to stop the war in Gaza and lift its blockade on the Palestinian territory “if they want to avoid this escalation.”\nEarlier this month, the Houthis attacked and sank two Liberian-flagged, Greek-owned bulk carriers – the Magic Seas and the Eternity C. The attack on the latter killed four crew members and 11 others were taken captive. All 22 crew members of the Magic Seas were rescued before the ship sank.\nThe group released a video on Monday evening, showing the 11 captured Eternity C crew members. The footage, the first of its kind since the Houthi attacks started, shows the crew being taken off the boat as well as interviews with the captives.\nFrom November 2023 to December 2024, the Houthis targeted more than 100 ships with missiles and drones. The rebels stopped their attacks during a brief ceasefire in the war and later became the target of an intense, weekslong airstrike campaign ordered by U.S. President Donald Trump.\nIn May, the United States announced a deal with the Houthis to end the airstrikes in return for an end to shipping attacks, although the rebel group said the agreement did not include halting attacks on targets it believed were aligned with Israel."
    },
    {
      "url": "https://www.huffpost.com/support?utm_campaign=mid-article-web",
      "text": "Skip to Main Content\nMain Menu\nU.S. Edition\nNews\nU.S. News\nWorld News\nBusiness\nEnvironment\nHealth\nSocial Justice\nCrime\nPolitics\nCongress\nExtremism\nOpinion\nEntertainment\nCulture & Arts\nMedia\nCelebrity\nTV & Film\nBooks\nSports\nLife\nWellness\nTravel\nTech\nStyle & Beauty\nFood & Drink\nParenting\nRelationships\nMoney\nHome & Living\nWork/Life\nShopping\nVoices\nBlack Voices\nQueer Voices\nLatino Voices\nIndigenous Voices\nAsian Voices\nWomen's Voices\nHuffPost Personal\nNEW: Games\nHoroscopes\nVideo\nNewsletters\nInternational\nU.S.\nU.K.\nEspaña\nFrance\nΕλλάδα (Greece)\nItalia\n日本 (Japan)\n한국 (Korea)\nFollow Us\nPart of HuffPost News. ©2025 BuzzFeed, Inc. All rights reserved.\nNEWS\nPOLITICS\nENTERTAINMENT\nLIFE\nPERSONAL\nVOICES\nSHOPPING\nGAMES"
    },
    {
      "url": "https://www.huffpost.com/support",
      "text": "Skip to Main Content\nMain Menu\nU.S. Edition\nNews\nU.S. News\nWorld News\nBusiness\nEnvironment\nHealth\nSocial Justice\nCrime\nPolitics\nCongress\nExtremism\nOpinion\nEntertainment\nCulture & Arts\nMedia\nCelebrity\nTV & Film\nBooks\nSports\nLife\nWellness\nTravel\nTech\nStyle & Beauty\nFood & Drink\nParenting\nRelationships\nMoney\nHome & Living\nWork/Life\nShopping\nVoices\nBlack Voices\nQueer Voices\nLatino Voices\nIndigenous Voices\nAsian Voices\nWomen's Voices\nHuffPost Personal\nNEW: Games\nHoroscopes\nVideo\nNewsletters\nInternational\nU.S.\nU.K.\nEspaña\nFrance\nΕλλάδα (Greece)\nItalia\n日本 (Japan)\n한국 (Korea)\nFollow Us\nPart of HuffPost News. ©2025 BuzzFeed, Inc. All rights reserved.\nNEWS\nPOLITICS\nENTERTAINMENT\nLIFE\nPERSONAL\nVOICES\nSHOPPING\nGAMES"
    },
    {
      "url": "https://apnews.com/article/un-yemen-houthis-resolution-red-sea-attacks-50c0ba1045fc5c01838a780d05182c9e",
      "text": "UN council authorizes continuing vigilance of attacks by Yemen’s Houthi rebels on Red Sea shipping\nUNITED NATIONS (AP) — The U.N. Security Council on Tuesday authorized continued reporting on attacks on ships in the Red Sea by Yemen’s Houthi rebels, who have defied its previous demands to immediately halt all such attacks.\nThe vote in the 15-member council was 12-0 with Russia, China and Algeria abstaining because of attacks against Yemen in violation of its sovereignty, a clear reference to U.S. airstrikes against the Houthis who control most of northern Yemen. The Trump administration has carried out the strikes because of the group’s attacks on shipping in the Red Sea, a crucial global trade route, and on close ally Israel.\nThe resolution, cosponsored by the United States and Greece, extends the requirement that U.N. Secretary-General Antonio Guterres provide monthly reports to the Security Council about Houthi attacks in the Red Sea until Jan. 15, 2026.\nActing U.S. Ambassador Dorothy Shea said the resolution recognizes the need for continued vigilance “against the Iran-backed Houthi terrorist threat.”\nShe cited the two latest attacks by Houthis against civilian cargo vessels, the MV Magic Seas and the MV Eternity C, which caused both vessels to sink and led to the loss of innocent seafarers and saw crew members taken hostage.\n“The United States strongly condemns these unprovoked terrorist attacks, which demonstrate the threat that the Houthis pose to freedom of navigation and to regional economic and maritime security,” Shea said, reiterating the council’s demand for an immediate halt to Houthi attacks and the release of all crew members kidnapped from the Eternity C.\nThe assaults represent the latest chapter of the rebels’ campaign against shipping over the war in Gaza that began with Hamas’ Oct. 7, 2023 surprise attack in southern Israel. They also come as Yemen’s nearly decadelong war drags on in the Arab world’s poorest country, without any sign of stopping.\nGreece’s U.N. Ambassador Evangelos Sekeris said the Houthi attacks have continued to fuel mistrust in the international maritime community, stressing that security and freedom of navigation are essential for the stability of global supply chains and economic development.\n“If the Red Sea region — a critical international maritime route — becomes even more degraded, it will expose the international community to more acute security risks and economic uncertainty,” he warned.\nRussia’s deputy U.N. ambassador Dmitry Polyansky said Moscow abstained because language in the previous resolution demanding a halt to Houthi attacks was arbitrarily interpreted to justify “the use of force affecting the territory of the sovereign state of Yemen.”\n“We stand convinced that any steps aimed at stabilizing the situation in Yemen and around Yemen should be taken in political and diplomatic ways,” he said.\nChina’s deputy U.N. ambassador Geng Shuang said his country abstained because “certain countries took military action against Yemen, which seriously impacted the Yemeni peace process and exacerbated tensions in the Red Sea.”\nThe Houthis have been launching missile and drone attacks against commercial and military ships in the region in what the group’s leadership has described as an effort to end Israel’s offensive against Hamas in Gaza.\nShuang called tensions in the Red Sea “a major manifestation of the spillover from the Gaza conflict.” Russia’s Polyansky also stressed the link between normalizing the situation in the Red Sea and the need for a ceasefire in Gaza and release of all hostages.\nAlgeria’s deputy U.N. ambassador Toufik Koudri, whose country is the Arab representative on the Security Council, expressed regret the Yemen resolution demanding an immediate halt to Houthi attacks made no mention of the Gaza war, which he called “one of the catalytic factors.”\n“The Security Council cannot disregard the clear nexus between the attacks in the Red Sea and the aggression against the Palestinian people in Gaza and the deep feelings that resulted from the brutal massacres committed against innocent civilians,” he said."
    },
    {
      "url": "https://apnews.com/article/trump-houthis-end-of-bombing-yemen-israel-e2f08ac04024ef3d6409b4ce97092489",
      "text": "Trump says the US will stop bombing Yemen’s Houthis after rebels say they’ll stop targeting ships\nTrump says the US will stop bombing Yemen’s Houthis after rebels say they’ll stop targeting ships\n▶ Follow live updates on President Donald Trump and his administration\nWASHINGTON (AP) — President Donald Trump said Tuesday that he’s ordering a halt to nearly two months of U.S. airstrikes on Yemen’s Houthis, saying the Iran-backed rebels have indicated that “they don’t want to fight anymore” and have pledged to stop attacking ships along a vital global trade route.\n“We’re going to stop the bombing of the Houthis, effective immediately,” Trump said at the start of his Oval Office meeting with Canadian Prime Minister Mark Carney.\nThat likely means an abrupt end to a campaign of airstrikes that began in March, when Trump promised to use “overwhelming lethal force” after the Houthis said they would resume attacks on Israeli vessels sailing off Yemen in response to Israel’s mounting another blockade on the Gaza Strip.\nAP Washington correspondent Sagar Meghani reports President Trump says Yemen’s Houthis will stop fighting, and the U.S. will stop striking them.\nAt the time, they described the warning as affecting the Red Sea, the Gulf of Aden, the Bab el-Mandeb Strait and the Arabian Sea.\nTrump said the Houthis had indicated to U.S. officials that “they don’t want to fight anymore. They just don’t want to fight. And we will honor that, and we will stop the bombings.”\nHis announcement came the same day that Israel’s military launched airstrikes against the Houthis that it said fully disabled the international airport in the Yemeni capital, Sanaa. Israel’s attacks were its second round of airstrikes on targets in Yemen in retaliation for a Houthi missile strike Sunday on Israel’s international airport.\nA U.S. official said the administration had not notified Israel of the agreement with the Houthis before Trump talked about it publicly.\nIsrael, according to this official who spoke on condition of anonymity to discuss private diplomatic talks, was irked by the unexpected news — particularly because the Houthis have continued to launch attacks on Israel proper and other Israeli targets.\nIsrael does not appear to be covered by the U.S.-Houthi agreement.\nAppearing before reporters again later Tuesday, this time for the swearing-in of senior adviser and special envoy Steve Witkoff, Trump was asked about the possibility that the Houthis would continue to attack Israel and responded, “I don’t know about that, frankly.”\n“But I know one thing, they want nothing to do with us,” Trump said. “And they’ve let that be known through all of their surrogates and very strongly.”\nTrump calls ending airstrikes ‘positive’\nIn his comments during the earlier meeting with Carney, Trump said the Houthis had “capitulated but, more importantly, we will take their word that they say they will not be blowing up ships anymore. And that’s what the purpose of what we were doing.”\n“I think that’s very positive,” Trump added. “They were knocking out a lot of ships.”\nAsked how the Houthis had communicated that they were looking to stop being targeted by U.S. bombs, Trump offered few details, saying only with a chuckle that the information came from a “very good source.”\nOmani Foreign Minister Badr al-Busaidi, confirmed that the U.S. bombing campaign was ending, posting on X that discussions involving the U.S. and Oman, as well as negotiators in Yemen, “have resulted in a ceasefire agreement between the two sides.”\n“In the future, neither side will target the other, including American vessels, in the Red Sea and Bab al-Mandab Strait, ensuring freedom of navigation and the smooth flow of international commercial shipping,” he wrote, calling the agreement a “welcome outcome.”\nIn a statement, the Houthis said that its position toward Gaza hadn’t changed and its “initial understanding” with the U.S. would not impact its support for the Palestinians. It wasn’t clear in the statement whether it was on board with the agreement with the U.S.\nCosts of U.S. operation against the Houthis\nThe costs of the U.S. munitions used against Houthi rebel targets in Yemen in daily attacks since March 15 have totaled more than $750 million, another U.S. official said. The Trump administration has dropped more than 2,000 munitions on more than 1,000 targets, according to the official, who spoke on the condition of anonymity to provide additional details on the strikes.\nThe total is only a fraction of the total costs of the operation. It doesn’t account for the costs of operating two aircraft carriers, their accompanying warships or the flight hours of the aircraft.\nIt also doesn’t include the Houthis destroying seven U.S. MQ-9 Reaper drones, at a cost of more than $30 million apiece, or the loss of an F/A-18 fighter jet and tug from the carrier USS Harry S. Truman when it maneuvered to avoid a Houthi missile and the jet fell off the carrier.\nDespite Trump’s framing of the deal as a way to reopen the Red Sea to commercial shipping without fear of Houthi attack, “the Houthis have not fired on a commercial ship since December,” Gregory Brew, a senior analyst with the Eurasia Group risk-analysis firm, said on X.\n“They are likely, however, to continue shooting at Israel,” Brew noted.\n“As to the Houthis continuing to attack Israel - they do so at Iran’s own peril,” Republican South Carolina Sen. Lindsey Graham, R-S.C., said on social media.\nHouthi attacks on shipping\nThe Houthis had been waging persistent missile and drone attacks against commercial and military ships in the region in what the group’s leadership has described as an effort to end Israel’s war against Hamas in the Gaza Strip.\nFrom November 2023 until January 2025, the Houthis targeted more than 100 merchant vessels with missiles and drones, sinking two of them and killing four sailors. That has greatly reduced the flow of trade through the Red Sea corridor, which typically sees $1 trillion of goods move through it annually.\nThe Houthis paused attacks in a self-imposed ceasefire until the U.S. launched a broad assault against the rebels in mid-March.\nThose strikes Trump had ordered were similar to ones carried out against the Houthis multiple times by the administration of his predecessor, Democratic President Joe Biden.\nThe Trump administration actions gained a higher profile in the public consciousness when The Atlantic revealed that Hegseth had texted sensitive plans for a military strike against the Houthis on a group chat in the messaging app Signal that mistakenly included the magazine’s editor-in-chief.\nTrump stood by Hegseth and downplayed the breach as a “glitch.” But national security adviser Mike Waltz, who created the group chat on Signal, left his post last week and has been nominated by Trump to be the U.S. ambassador to the United Nations.\n___\nAssociated Press writers Matthew Lee, Tara Copp and Ellen Knickmeyer in Washington contributed to this report."
    },
    {
      "url": "https://www.huffpost.com/news/topic/donald-trump",
      "text": "Donald Trump\nMultiple postal services around Europe say they are suspending the shipment of many packages to the United States amid a lack of clarity over new import duties.\nThe Trump administration has halted construction on an offshore wind project near Rhode Island that is 80% complete.\n“You’ve become the party of protecting pedophiles,” said comedian Pete Dominick.\nWHAT'S HAPPENING\nOn Friday, the FBI searched the home of John Bolton, Trump’s first-term national security adviser-turned-critic.\n“People can tell that he’s putting on an act,” Rep. Brendan Boyle (D-Pa.) said.\nThe \"Real Time\" host went through an ominous checklist Friday chronicling the president's recent steps.\nHe has pleaded not guilty and has asked the judge to dismiss the case, claiming that it is an attempt to punish him for challenging his deportation to El Salvador.\nTrump said Friday he expected to make a decision on his next actions in two weeks if direct talks aren’t scheduled.\nChicago Mayor Brandon Johnson called Trump's approach “uncoordinated, uncalled for, and unsound.\"\nThe new season of the animated series has ruffled some feathers. One expert in popular culture points to one glaring reason why."
    }
  ],
  "argos_summary": "Israeli airstrikes hit Yemen’s capital Sanaa after the Houthi rebels fired a cluster‑bomb‑type missile at Israel, killing two and wounding 35. The Houthis have been launching missiles and drones at Israeli and shipping targets in the Red Sea for over 22 months, prompting U.S. and U.K. airstrikes on Houthi facilities. The U.N. Security Council authorized continued monitoring of Houthi attacks on shipping, while President Trump announced a halt to U.S. airstrikes following a reported Houthi pledge to stop attacking ships. Meanwhile, the Houthis warned they would target any merchant vessel linked to Israeli ports, escalating tensions in the region.",
  "argos_id": "EGFCZQD7D"
}