{
  "url": "https://www.usatoday.com/story/nletter/2025/08/21/cracker-barrel-donald-trump-hurricane-erin-thursdays-news/85765576007/",
  "authorsByline": "Rebecca Morin",
  "articleId": "ca6a44aba726473cbfdb3ee36dbb2af6",
  "source": {
    "domain": "usatoday.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "VA",
      "county": "Fairfax County",
      "city": "McLean",
      "coordinates": {
        "lat": 38.9342888,
        "lon": -77.1776327
      }
    }
  },
  "imageUrl": "https://www.usatoday.com/gcdn/authoring/authoring-images/2025/08/21/USAT/85762108007-2230431832.jpg?crop=5307,2986,x0,y276&width=3200&height=1801&format=pjpg&auto=webp",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-21T22:11:17+00:00",
  "addDate": "2025-08-21T22:24:25.008198+00:00",
  "refreshDate": "2025-08-21T22:24:25.008200+00:00",
  "score": 1.0,
  "title": "Cracker Barrel's aesthetic vibe shift",
  "description": "Customers are feeling anything but charm and comfort after its rebrand. It's Thursday's news.",
  "content": "Customers are feeling anything but charm and comfort after one restaurant’s rebrand. President Donald Trump joined law enforcement in Washington, DC. And Hurricane Erin is turning away from the United States – but still bringing harsh waves to the East Coast.\n\n👋 Hi!Rebecca Morin here. No spoilers, please! I need to catch up on the latest episode of “The Summer I Turned Pretty” after I bring you Thursday’s news.\n\nBut first: Radioactive shrimp! 🍤 See where frozen shrimp has been recalled from Walmart in 13 states that may have been contaminated with a radioactive chemical.\n\nNo more man sitting on a chair, no more wooden barrel, and a new minimalist look. Cracker Barrel debuted a new, simplified logo with the launch of a fall menu campaign on Tuesday – and some customers are not happy about it. The restaurant chain and country store, known for its comfort food and nostalgic atmosphere, is undergoing a rebrand that includes renovations at some locations to give the establishments a more modern look.\n\nWhat customers are saying: Some longtime fans of the restaurant expressed disappointment with the company’s logo, calling it “cold and sterile.” 👉 See the new logo design.\n\nTrump joined law enforcement in Washington on Thursday night, a move that comes after deploying the National Guard in the nation’s capital. Trump spoke with law enforcement officials at the U.S. Park Police facility in Anacostia, a neighborhood of Washington. Ten days ago, Trump ordered 800 National Guard troops to the streets of Washington and took action to seize control of the city's police force after declaring a local crime emergency. Washington's violent crime rate was down 26% in 2025 compared with a year earlier. 👉 More on Trump’s DC takeover.\n\nTrump’s legal win: An appeals court has thrown out the $454 million penalty imposed on Trump in his New York civil fraud case. In a Thursday ruling, Manhattan-based appeals court determined the penalty was improper. Trump and some of his entities were hit with the hefty penalty, plus interest, in February 2024 after a judge concluded he had inflated the value of his assets for years to secure better loan and insurance terms. 👉 New York Attorney General plans to appeal decision.\n• 5 takeaways: Trump and GOP on verge of big win in Texas.\n• Chipotle is testing drone delivery. How will it work?\n• Serena Williams says weight loss from GLP-1 made her feel ‘sexier.’\n\nOne storm down, another forming\n\nHurricane Erin, the large Category 2 storm, reached its closest approach to the U.S. East Coast and was beginning to move away from North Carolina – still unleashing powerful waves and rip currents that threatened beachfront homes and flooded roads as authorities urged people to stay out of the water. Major flooding was forecast at more than a half-dozen tidally influenced locations along the mid-Atlantic coast, including Duck, North Carolina, around the entrance to the Chesapeake Bay, and Lewes, Delaware, as the storm surge from Erin flowed into communities. 👉 See the projected path of Hurricane Erin.\n\nBrace for another storm: Forecasters are also watching a developing tropical wave in the Atlantic that could become Tropical Storm Fernand in the coming days. It is one of three developing systems the National Hurricane Center was tracking in the Atlantic. The storm has a high chance of development and will likely become the next named storm, but is expected to turn quickly out to sea. 👉 How a new storm could impact islands in the Caribbean.\n• Photos: Hurricane Erin unleashes dangerous waves and rip currents along the East Coast.\n\n“South Park” goes to Washington. The Comedy Central series' new episode, which aired Wednesday, continued its season-long thread of mocking Trump and depicting him in a romantic relationship with Satan. The latest episode, titled \"Sickofancy,\" continues the show's satire of the Trump administration, a major focus of its 27th season. The White House previously responded to the Season 27 premiere, with spokesperson Taylor Rogers saying the show \"hasn't been relevant for over 20 years and is hanging on by a thread with uninspired ideas in a desperate attempt for attention.\" 👉 What happened in the latest episode.\n• 🍳 Chef Gordon Ramsay loves this cookware. HexClad is on sale for Labor Day.\n\nRebecca Morin is a newsletter writer at USA TODAY. Got thoughts or feedback? Reach out to her atrdmorin@usatoday.com.",
  "medium": "Article",
  "links": [
    "https://www.usatoday.com/story/entertainment/tv/2025/08/21/south-park-new-episode-donald-trump/85739050007/",
    "https://www.usatoday.com/story/life/problem-solved/2025/08/21/how-to-choose-ripe-watermelon-grocery-store/85612593007/",
    "https://www.usatoday.com/story/entertainment/celebrities/2025/08/21/serena-williams-weight-loss-zepbound-glp-1/85754907007/",
    "https://click.e.usatoday.com/?qs=102d1e984ba8c8d67f3aad849e2da7c1202a33a7505407d02bc8008e7458ae30dc928f4643ccae4a372b0fbe2c2ea6946697d4f1f6fc353ed60e68b2d759f228",
    "https://www.usatoday.com/story/news/politics/2025/08/21/donald-trump-civil-fraud-case-appeal-decision/85759082007/",
    "https://www.usatoday.com/story/news/politics/2025/08/21/trump-republicans-texas-democrats-california/85756561007/",
    "https://www.usatoday.com/story/entertainment/celebrities/2025/08/21/millie-bobby-brown-jake-bongiovi-adopt-child/85760676007/",
    "https://www.usatoday.com/story/news/politics/2025/08/21/eric-adams-winnie-greco-potato-chip-money-bribe/85758077007/",
    "https://www.usatoday.com/story/news/nation/2025/08/21/hurricane-erin-live-updates-thursday/85751606007/",
    "https://www.usatoday.com/story/money/food/2025/08/21/potbelly-free-sandwich-bogo-deal/85753933007/",
    "https://www.usatoday.com/story/news/politics/2025/08/21/americans-democracy-redistricting/85754887007/",
    "https://www.usatoday.com/story/travel/airline-news/2025/08/21/spirit-airlines-hurricane-erin-puerto-rico/85748663007/",
    "https://www.usatoday.com/story/entertainment/celebrities/2025/08/20/sydney-sweeney-bathwater-soap-controversy/85750186007/",
    "https://www.usatoday.com/picture-gallery/weather/2025/08/19/hurricane-erin-us-east-coast-prepares-photos/85732690007/",
    "https://www.usatoday.com/picture-gallery/money/food/2025/08/21/cracker-barrel-restaurant-interior-photos/85754412007/",
    "https://www.usatoday.com/story/sports/nfl/columnist/bell/2025/08/21/cowboys-jerry-jones-super-bowl-titles/85750299007/",
    "https://www.usatoday.com/story/money/food/2025/08/21/chipotle-drone-delivery-zipotle/85760358007/",
    "https://www.usatoday.com/story/news/weather/2025/08/21/hurricane-center-fernand-follow-erin/85756936007/",
    "https://www.usatoday.com/story/money/2025/08/21/frozen-shrimp-radioactive-states-map/85754416007/",
    "https://www.usatoday.com/story/shopping/2025/08/21/hexclad-cookware-labor-day-sale/85709110007/",
    "https://www.usatoday.com/story/news/politics/2025/08/21/trump-says-he-plans-to-patrol-dc-streets-alongside-law-enforcement/85761029007/",
    "https://www.usatoday.com/story/money/2025/08/21/cracker-barrel-new-logo/85753769007/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Trump",
      "weight": 0.06904928
    },
    {
      "name": "Donald Trump",
      "weight": 0.06840466
    },
    {
      "name": "President Donald Trump",
      "weight": 0.06520111
    },
    {
      "name": "Hurricane Erin",
      "weight": 0.06244287
    },
    {
      "name": "law enforcement officials",
      "weight": 0.053978626
    },
    {
      "name": "law enforcement",
      "weight": 0.053464912
    },
    {
      "name": "National Guard",
      "weight": 0.051477388
    },
    {
      "name": "Washington",
      "weight": 0.0508863
    },
    {
      "name": "New York Attorney General",
      "weight": 0.050331343
    },
    {
      "name": "harsh waves",
      "weight": 0.04956454
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.927734375
    },
    {
      "name": "/Food & Drink/Restaurants/Other",
      "score": 0.43994140625
    }
  ],
  "sentiment": {
    "positive": 0.064836055,
    "negative": 0.7607192,
    "neutral": 0.17444475
  },
  "summary": "President Donald Trump joined law enforcement in Washington, DC, following a meeting with law enforcement officials and a rebranding of Cracker Barrel. The restaurant chain, known for its comfort food and nostalgic atmosphere, is undergoing a more modern aesthetic shift and a new minimalist look. Some customers are unhappy about the company's new logo design, which they call \"cold and sterile\". Meanwhile, Hurricane Erin is moving away from the United States but still causing significant waves and rip currents along the East Coast. An appeals court has overturned the $454 million penalty imposed on Trump in his New York civil fraud case, which was deemed improper by an appeals court. Meanwhile, a developing tropical wave in the Atlantic could become Tropical Storm Fernand, which is expected to develop quickly out to sea.",
  "shortSummary": "President Donald Trump joined law enforcement in Washington DC, while Hurricane Erin continues to batter the East Coast, causing significant flooding and legal issues.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "ed882af882a44d428f385062e8f58992",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.usatoday.com/story/travel/airline-news/2025/08/21/spirit-airlines-hurricane-erin-puerto-rico/85748663007/",
      "text": "Spirit flight sparks storm fears after flying near Hurricane Erin\n- A Spirit Airlines flight appeared to fly through Hurricane Erin's path.\n- Spirit Airlines stated the flight operated safely under air traffic control guidance and established procedures.\n- Experts explain that planes are built to withstand harsh weather, and pilots likely flew through calmer air around the storm.\nA Spirit Airlines flight from Philadelphia to San Juan appeared to have flown directly through the path of Hurricane Erin on Monday, prompting online speculation about the flight's safety.\nWhile radar and flight tracking images of flight NK2298 may suggest the plane was in for a rough go, the airline insists the course was completely safe. Spirit noted to USA TODAY that the flight operated normally and there were no injuries reported when it landed.\n\"Safety is always our top priority,\" the airline said in a statement. \"Our pilots followed procedures and Air Traffic Control (ATC) instructions while en route to San Juan (SJU). Our Operations Control Center closely tracks weather systems and works with our pilots and ATC to determine flight paths that safely navigate around or above adverse weather conditions.\"\nMichael McCormick, coordinator of the Air Traffic Management Program at Embry-Riddle Aeronautical University said he reviewed conditions and reported flight data from the Spirit jet and found no reason for concern.\n\"The aircraft was at FL 370 (37,000 feet) and only light turbulence was reported in that area,\" McCormick told USA TODAY in a written statement. \"At that altitude, the aircraft would be above the significant weather with the worst activity to the north of the flight path.\"\nAt the time, Hurricane Erin was a Category 4 storm, but it has since been downgraded to Category 2.\nPilots are not required to notify passengers of the specific weather conditions they'll encounter on a flight. However, many pilots do make announcements about their expectations before and during a flight.\nPlanes do not take off if airline operations staff and air traffic control expect conditions to be unsafe along their planned flight path, and pilots work with people on the ground to respond in real time to weather conditions as they develop and avoid any potential dangers.\nPlanes are designed to navigate rough weather conditions, and it's likely that the pilots were cruising in relatively – if not completely – clear air around the storm, even if the radar looked stormy.\n“Airplanes themselves are very capable,” Ken Byrnes, assistant dean and chairman of flight training at Embry-Riddle Aeronautical University, previously told USA TODAY. “When you look at how these aircraft are designed, they’re designed to withstand tremendous loads.”\nIn 2017, a Delta Air Lines flight departing San Juan similarly drew attention when flight tracking and radar images showed it threading the needle between bands of Hurricane Irma as that system passed over Puerto Rico as a Category 5 storm.\nAt the time, a Delta spokesperson told Wired that the airline's staff made sure there was a safe path for the plane in and out of San Juan before it ever took off, and noted that wind speeds in its flight path were hitting just 31 knots, well below the plane's design capabilities.\n“The goal of the airline is to provide the highest level of customer service, but at the utmost safety,” Byrnes said. “They’re not going to take risks that are unnecessary in order to meet that demand because it’s just not worth it.”\n(This story was updated to add new information.)\nZach Wichter is a travel reporter and writes the Cruising Altitude column for USA TODAY. He is based in New York and you can reach him at zwichter@usatoday.com."
    },
    {
      "url": "https://www.usatoday.com/story/sports/nfl/columnist/bell/2025/08/21/cowboys-jerry-jones-super-bowl-titles/85750299007/",
      "text": "'I bust my (expletive)': Jerry Jones defends Cowboys' marketing over winning\n- A new Netflix docuseries, \"America's Team: The Gambler and His Cowboys,\" explores the Dallas Cowboys' sustained popularity despite a lack of recent championships.\n- Cowboys owner Jerry Jones attributes the team's value and popularity to his hard work and marketing efforts.\n- Jones defends Dallas' performance, citing its overall win record the past three decades and near misses in playoff runs.\nAgain, for maybe the 29th time over the years, I had to ask Jerry Jones to explain how the Dallas Cowboys – the most valuable sports franchise on the planet – have sustained such immense popularity despite continually falling short of winning championships.\nThen again, why ask? Just look around. Or watch.\nThere’s a fresh answer with the compelling eight-part docuseries, “America’s Team: The Gambler and His Cowboys,” that dropped this week on Netflix.\nIt reminds us that no team does drama quite like the Cowboys.\nAnd it reinforces the fact that no team markets itself quite like “America’s Team.”\n“I explain it by hard work. I bust my ass,” Jones, referring to the franchise’s value and popularity, told USA TODAY Sports over lunch recently in his training camp office in Oxnard, California. “This exact same hard work that is going on in the football. I work my ass off. And that hasn’t slowed down. This is the busiest I’ve ever been at training camp.”\nAll that busy work, though, hasn’t resulted in a contract extension for All-Pro linebacker Micah Parsons, whose “hold-in” attempt for a new deal has juiced the summer episode of the NFL’s longest-running soap opera. And Jones freely admits he doesn’t mind the drama.\nAfter all, the rift with Parsons keeps the Cowboys ticking on the relevance meter.\nThe docuseries, meanwhile, adds more layers to the buzz. Sure, the rise and fall of Jerry’s Cowboys – who haven’t even advanced to the NFC title game in the 29 years since winning a third Super Bowl crown during the 1990s – deserves documentary treatment. There are electric characters. Rich storylines. Fascinating details. Heaps of controversy.\nYet despite revealing perspectives shared by the likes of Michael Irvin, Troy Aikman and Charles Haley, among others, the docuseries feels too much like a slick, PR-crafted production. I mean, did they really need those cheesy Western-themed backdrops and effects?\nAlso, for all the candid revelations from Irvin – who provided backstory from his 1996 drug possession trial and spilled the tea on the “White House” near the team’s headquarters, where some players engaged in booze, drugs and sex escapades – there was no such depth relating to multiple controversies attached to Jones.\nNot that I’m surprised. Somebody had to sign off on all the access and cooperation that gave the project its juice. Rather than delve into the team owner’s stance a few years ago against national anthem protests by NFL players or touch the since-settled legal issues linked to a woman alleging to be Jones’ illegitimate daughter, the directing duo of brothers Chaplain and Maclain Way portrayed Jones in a manner he would undoubtedly approve of.\nSure, Jones ignited controversy from the start of his ownership in 1989 when he, well, aptly replaced the legendary Tom Landry with Jimmy Johnson. And during the mid-‘90s he sued NFL partners in breaking off to secure his own massive marketing deals. Look at how that controversy turned out: Forbes, in its latest compilation, values the franchise at $12.8 billion. And Jones, who bought the team for roughly $150 million, is in the Hall of Fame, having forever changed the NFL business landscape as the league’s most powerful owner.\nYet it will be tough for longtime Cowboys fans to waltz down memory lane without connecting the nostalgia with the current state of affairs. The final episode of the docuseries titled, “The Drought,” covers the 29 years since Super Bowl 30.\n“What’s the common denominator? Jones. I get it,” Jones said.\nThen Jerry, who is on his eighth head coach since Johnson but will indeed get testy when asked about turning over the reins as GM, digs in.\n“How long has it been since Buffalo won the Super Bowl?” he said, knowing that the five-time defending AFC East champion Bills have never won a Super Bowl. “Buffalo hasn’t been chopped liver. They’re solid. They’re probably in the top third of the NFL.”\nThe Cowboys, meanwhile, posted three consecutive 12-5 records under since-departed coach Mike McCarthy, with two NFC East titles, before sinking to an injury-riddled 7-10 finish in 2024.\n“I just can’t get as convicted that the way we’re doing it, that our approach to trying to win a Super Bowl, that that needs to change,” Jones said. “I guess that’s why I’m so defensive.”\nHe knows. The visibility that comes with being the NFL’s biggest draw just increases the heat when they flop, year after year, in chasing another Super Bowl.\nPut another way, Jones says, “The ass-kicking that comes with this doesn’t deter me at all.”\nOf course, Jones, 82, can still sell it. When he maintains that over the past three decades the Cowboys are among the top six teams in the NFL for victories, it illustrates how hope is such a tangible resource.\n“That shows that you’re not defunct,” he said. “Fair? I know we’re in range to have success.”\nBut still. A 29-year drought?\n“On two or three occasions, if not for a nano-second, a nano-factor, we would’ve been in the Super Bowl,” he said, including the would-be Dez Bryant catch in a 2014 NFC divisional playoff loss at Green Bay, as an example. “So, I hang my hat on those times.\n“And I hang my hat on the fact that nobody gets to be in 20 of them. Maybe they experienced four of them, or three of them, or like Charles (Haley), five. Thirty years sounds like you should be in half of them. I don’t look at it that way. I look at it like how many people have never been in one? I look at the three (Dallas won in the ‘90s) and I feel like I at least have three years left, or four or five years left, and there’s always the promise that I can get it this season. Or get it next season.”\nNow that’s some serious spin. The scene from Dallas’ last playoff game – a blowout loss against the Packers in a 2023 NFC wild-card round matchup at JerryWorld that was the worst postseason setback in the franchise’s history – certainly provided compelling images for the final episode of the docuseries. Jones was in the locker room consoling players, including Parsons – the man now embroiled in a contract dispute.\nHe hugged Parsons and whispered that the blowout wasn’t the fault of the star player. To which Parsons mumbled, “I just wanna win.”\nWhat a contrast to the vibe from the early episodes, which detailed how Johnson established a tone. The coach once refused to allow meal service on the team’s chartered flight home after a disturbing loss. And in a classic tirade his first year, Johnson bellowed, “The asthma field is over there!” after one player explained why he collapsed while running wind sprints.\nSure, times have changed. Some of the drills Johnson ordered during his demanding training camps wouldn’t be tolerated today, under the collective bargaining agreement. Even so, somebody has to win big. And that is no longer the Cowboys’ way.\nAt least when it comes to winning on the field. Otherwise, business is booming for a franchise still commanding a huge presence on the NFL relevance map.\nContact Jarrett Bell at jbell@usatoday.com or follow on social media: On X: @JarrettBell\nOn Bluesky: jarrettbell.bsky.social"
    },
    {
      "url": "https://www.usatoday.com/story/money/2025/08/21/frozen-shrimp-radioactive-states-map/85754416007/",
      "text": "Was the potentially radioactive shrimp sold in your state? See map.\nA recall has been issued for frozen shrimp sold at Walmart in 13 states that may have been contaminated with a radioactive chemical, the Food and Drug Administration said.\nOn Tuesday, Aug. 19, the FDA advised the recall after it detected Cesium-137 (Cs-137), a radioactive chemical \"produced by nuclear fission for use in medical devices and gauges,\" according to the Environmental Protection Agency.\nThe chemical was detected in four U.S. ports across the country and in a sample of breaded shrimp, the FDA stated.\n\"Although testing to date has not confirmed the presence of contamination in any product in commerce, the product appears to have been prepared, packed, or held under insanitary conditions whereby it may have become contaminated with Cs-137 and may pose a safety concern,\" the FDA advised.\nThe FDA is investigating the situation.\nWhich states sold the recalled frozen shrimp?\nThe recalled shrimp were sold in the following 13 states:\n- Alabama\n- Arkansas\n- Florida\n- Georgia\n- Kentucky\n- Louisiana\n- Mississippi\n- Missouri\n- Ohio\n- Oklahoma\n- Pennsylvania\n- Texas\n- West Virginia\nPorts that received contaminated shipping containers\nThe four ports where the FDA detected contaminated shipping containers are in the following cities:\n- Los Angeles\n- Houston\n- Miami\n- Savannah, Georgia\nWhich products were recalled?\nThe recall is targeted at 2-pound bags of Great Value brand Frozen Raw Ez Peel Tail-On Farm-Raised White Vannamei Shrimp. Lot codes and best by dates include the following:\n- Lot code: 8005540-1; best by date: 3/15/2027\n- Lot code: 8005538-1; best by date: 3/15/2027\n- Lot code: 8005539-1; best by date: 3/15/2027\nThe shrimp products are processed by PT. Bahari Makmur Sejati, a company in Indonesia doing business as BMS Foods, according to the FDA.\nWhat to do if you have recalled shrimp\nIf you have a package of the recalled Walmart shrimp at home, throw it away and do not eat or serve it, the FDA notice says. Distributors and retailers should dispose of the product and refrain from selling it.\nAnybody who fears they may have been exposed to elevated levels of cesium should contact their medical providers. To submit a complaint or report an adverse reaction, consumers can visit the FDA's Industry and Consumer Assistance portal.\nPT. Bahari Makmur Sejati placed under an import alert\nPT. Bahari Makmur Sejati has also been placed on an import alert for chemical contamination, which prevents any of the company's food products from entering the United States until it resolves any conditions that could have caused the exposure.\nThe FDA is working with Indonesian seafood regulatory authorities to investigate the cause of the contamination.\nWhat is Cesium-137 (Cs-137) and why is it regulated?\nCs-137 is a radioisotope of cesium, meaning it is a chemical element that emits radiation as it breaks down. It is man-made and is produced by nuclear fission, according to the FDA. In the United States, it is used in medical devices and measurement gauges, such as industrial devices that measure the thickness of materials.\n\"It is also one of the byproducts of nuclear fission processes in nuclear reactors and nuclear weapons testing,\" the EPA stated.\nBecause it is widespread around the globe, trace amounts can be found in the environment, including in soil, food and air, the FDA. Agencies, including the FDA and U.S. Customs & Border Protection, test for, monitor and regulate the presence of the substance due to the risks associated with long-term exposure.\nLow-level radiation exposure over time can lead to serious health complications, the FDA said. Exposure to Cs-137 alone can cause burns, acute radiation sickness, cancer and death. As a result, the governing agencies restrict potential exposure to lessen the possibility of these long-term impacts.\nJulia is a trending reporter for USA TODAY. Connect with her on LinkedIn, X, Instagram and TikTok: @juliamariegz, or email her at jgomez@gannett.com"
    },
    {
      "url": "https://www.usatoday.com/story/news/nation/2025/08/21/hurricane-erin-live-updates-thursday/85751606007/",
      "text": "Hurricane Erin unleashes powerful waves and rip currents; storm pulls away from coast\nHurricane Erin drifted away from the U.S. mainland on Thursday afternoon after making its closest approach off the North Carolina coast, but it was still unleashing powerful waves and rip currents, threatening beachfront homes and flooding roads as authorities urged people to stay out of the water.\nErin, a large Category 2 hurricane, made a turn to the northeast and was picking up speed as it pulled away. It should gradually weaken to a post-tropical cyclone by Saturday, but not before making an impact on most of the Atlantic coast up to southeastern Canada, forecasters said.\nBy 11 p.m. ET, the National Hurricane Center said Erin was passing between New England and Bermuda. The agency noted that Erin remained a \"very large system,\" and was forecast to move over the western Atlantic through early Friday before passing south of Atlantic Canada on Friday and Saturday.\nThe hurricane center had warned that roads in the low-lying barrier islands would become impassable, with waves of 15 to 20 feet crashing ashore.\nMajor flooding was forecast at more than a half-dozen tidally influenced locations along the mid-Atlantic coast, including at Duck, North Carolina, around the entrance to the Chesapeake Bay, and at Lewes, Delaware, as the storm surge from Erin flowed into communities. The National Weather Service said flooding at some of these locations would pose a \"significant threat\" to property and life, necessitating evacuations.\nOn Chesapeake Bay at the Bay Bridge Tunnel, the tide is forecast to reach 6 feet high, which could cause extensive flooding, presenting a threat to property and life, weather service records show. The severe flooding would extend inland, inundating waterfront and shoreline homes and businesses and requiring some areas to be evacuated.\nDevelopments:\n∎ As of the National Hurricane Center's 11 p.m. ET update, Erin was about 365 miles north-northwest of Bermuda, moving east-northeast near 22 mph and carrying sustained winds close to 100 mph.\n∎ Dare County, which encompasses the middle part of the Outer Banks, said in a bulletin that the towns of Buxton and Hatteras were among the most impacted by the hurricane.\n∎ A portion of Highway 12, a crucial artery in the Outer Banks, remained closed because of flooding exacerbated by the Thursday evening high tide. The National Weather Service said after those waters recede, \"conditions will slowly improve, although the next couple high tides could bring continuing significant impacts to Dare County.''\n∎ Despite Erin's trajectory away from land, parts of Virginia's coast were still getting wind gusts of 30 to 45 mph and wave heights of 11 to 15 feet around 3 p.m. Thursday, according to the weather service office in Wakefield, Virginia.\n∎ The National Hurricane Center said it is monitoring two other areas for tropical development in the Atlantic. \"One has a 70% and the other 40% chance in the next 7 days,\" the National Hurricane Center said.\nFlooding reported along East Coast\nOn the Outer Banks, at a gauge on the beach at Duck, North Carolina, the National Weather Service said the high water level at high tide on Thursday reached 6.97 inches. The water level was about 9 inches below the previous record, set in 2003 during Hurricane Isabel.\nWater washing over dunes left Highway 12 impassable in the \"typical vulnerable areas,\" according to the weather service. Though the highest tides wind down, significant impacts still could occur along beaches in Dare County.\nIn New Jersey, coastal flooding closed U.S. 40 in both directions in Pleasantville, near Atlantic City, the weather service said. Flooding also closed lanes of a road in North Wildwood, New Jersey. And in Ocean City, flooding began in coastal areas before high tide arrived, flooding 8th and 9th streets near the boardwalk.\nIn Delaware, the water washed over the tops of dunes and caused some beach erosion on the north side of Indian River Inlet in Sussex, according to the weather service. The weather service also continued to warn of potential flooding during high tide on the southern end of Queens, Nassau, and eastern Suffolk in New York.\nErin's wind field extended more than 500 miles\nBy the time Erin's center reached its closest point to the U.S. mainland on Thursday, the mean diameter of its storm-force wind field stretched 529 miles, not quite double what it had been 72 hours earlier, according to a USA TODAY analysis of data provided by the hurricane center. The mean diameter of its hurricane-force winds, safely away from shore, was 172 miles.\nStill, the storm was stirring up a much larger area of the Atlantic, as Erin's winds helped create seas of 10 feet or more across an ocean area of 943 miles in diameter.\nHurricane Erin brings danger of widespread flooding, high surf\nThe 8.7-foot tide predicted for Oyster, Virginia, would send water levels up by 2 to 3 feet above dry ground. Weather service data shows the flooding would extend inland, reaching homes and businesses and making some roads impassable.\nTropical storm and storm-surge warnings were in place along the North Carolina coastline. Flooding is expected to peak during high tide around 7 p.m. Thursday.\nIn New Jersey, swimming and other water activities were prohibited on beaches, with high surf and rip current warnings in effect through Aug. 22, the weather service said.\nAnother storm could come on the heels of Erin\nEven before Erin exits, its successor may be churning in the Atlantic.\nThe National Hurricane Center is monitoring three weather disturbances in the ocean, and the one farthest west has the potential to develop into a tropical storm that would be called Fernand. Weather activity related to what's now still a tropical wave hundreds of miles east of the Leeward Islands hasn't changed much for hours, the National Hurricane Center said Thursday morning.\nBut it added that \"environmental conditions appear conducive for further development of this system, and a tropical depression is likely to form this weekend while it moves near or to the north of the northern Leeward Islands.\"\n− Doyle Rice\nHuge waves, storm surge batter Outer Banks from Hurricane Erin\nAt 9 a.m. on Aug. 21, a buoy roughly 12 miles east of Buxton on the Outer Banks reported that the highest one-third of waves occurring there averaged 15.1 feet. Earlier, a buoy about 170 miles east of Cape Hatteras and just to the west of Erin's estimated center position reported an average wave height of 32 feet among its highest waves, according to the National Oceanographic and Atmospheric Administration.\nThose big waves, combined with storm surge, are causing \"significant flooding\" along the Outer Banks and Highway 12, the main artery through the islands.\nThe Atlantic Ocean began washing over the highway on Wednesday, pushing up over some dunes and cutting channels through piles of sand established to help protect the highway.\nOn the opposite side of the island from the ocean, \"minor to moderate\" flooding has occurred on the sound side of the islands. The National Weather Service said the flooding is expected to continue through Thursday night, but rough surf could continue for several days.\nSustained wind reports from the Outer Banks on the morning of Thursday were between 25 mph and 40 mph, with higher gusts at various weather stations along the barrier island chain, some as high as 54 mph, according to the weather service.\nHurricane Erin brings widespread coastal flood advisories in New York City\nCoastal flooding from Hurricane Erin is expected across much of New York City’s waterfront, possibly impacting homes, streets, and businesses from Thursday to Friday, city officials warned.\nAdvisories were in place across the five boroughs, with flooding of as much as 2 1/2 feet expected on the evening of Thursday in parts of southern Queens with high tide, the city Emergency Management said on X. In Queens, officials expect widespread flooding of low-lying properties, roads, and basements near waterfronts. Flooding would continue with Friday’s high tides.\nManhattan, Brooklyn, the Bronx, and Staten Island are projected to see 1 to 2 feet of inundation beginning the evening of Thursday and into Friday, city alerts warned.\nOfficials advised people near coastal areas to move cars to higher ground before high tide, and to protect basements, which are often converted into apartments that can be threatened by flooding.\n− Eduardo Cuevas, USA TODAY\nState-by-state Erin forecast details\nThe weather service and state officials have provided the following information:\nNew York: Widespread dune erosion and beach flooding are likely with successive high tides through Friday morning, with waves of up to 15 feet or more and higher-than-normal tides. Gusts up to 40 mph are possible, with the highest winds expected along eastern Long Island.\nState officials advised residents to prepare for the possibility of dangerous conditions along beaches and coastal communities. New York Mayor Eric Adams directed the closing of all beaches for swimming on Wednesday and Thursday.\nNew Jersey/Delaware: Tropical storm-force gusts are possible along the coast on Thursday, with breaking waves of 7 to 11 feet.\nMaryland: Higher tides could lead to coastal flooding. Coastal flood advisories were issued, including a flood warning for Annapolis, where flooding is expected in the low-lying historic community.\nVirginia: Minor or isolated coastal flooding is expected through the weekend.\nHurricane Erin tracker\nThis forecast track shows the most likely path of the center of the storm. It does not illustrate the full width of the storm or its impacts, and the center of the storm is likely to travel outside the cone up to 33% of the time.\nContributing: Reuters"
    },
    {
      "url": "https://www.usatoday.com/story/money/2025/08/21/cracker-barrel-new-logo/85753769007/",
      "text": "Cracker Barrel unveils new logo and it's not pleasing everyone\nCracker Barrel's new logo isn't quite getting a stamp of approval from some customers.\nThe nationwide restaurant chain and country store, which is known for its comfort food and nostalgic atmosphere, unveiled a new, simplified logo with the launch of a fall menu campaign on Aug. 19.\nIn a news release for the campaign, called \"All the More,\" Cracker Barrel boasted \"refreshed restaurant remodels\" and \"an enhanced brand look and feel.\"\nThe updated visuals will appear across menus and marketing collateral, the company said in a statement.\nWhile changes are here, Cracker Barrel told USA TODAY its \"values haven't changed, and the heart and soul of Cracker Barrel haven’t changed.\"\n\"Cracker Barrel has been a destination for comfort and community for more than half a century, and this fifth evolution of the brand’s logo, which works across digital platforms as well as billboards and roadside signs, is a call-back to the original and rooted even more in the iconic barrel shape and word mark that started it all back in 1969,\" the company said.\nWhat does Cracker Barrel's new logo look like?\nWhile still featuring the company's classic gold and brown color palette, the new Cracker Barrel logo instead offers a simplified version without a man seated next to a wooden barrel.\nThe new logo includes the restaurant's name in brown lettering against a golden yellow border.\nThe rebrand comes as Cracker Barrel continues renovations at some of its locations around the country, giving restaurants a more modern facelift.\nDespite recent online pushback against the renovations, Cracker Barrel CEO Julie Felss Masino said in an Aug. 19 interview on \"Good Morning America\" that \"people like what we're doing.\"\n\"Cracker Barrel needs to feel like the Cracker Barrel for today and for tomorrow – the things that you love are still there,\" she said. \"We need people to choose us, and we want people to choose us.\"\nSome Cracker Barrel customers aren't happy with new logo: 'Cold and sterile'\nSome longtime Cracker Barrel fans took to social media to express disappointment with the company's new logo, with some calling on the chain to change it back.\n\"The new rebrand took the feeling away,\" one person wrote on Cracker Barrel's Instagram. \"Cold and sterile.\"\nAnother said, \"I’m feeling like this new logo is ruining my life.\"\nSome conservatives even pushed back against the rebrand, suggesting that the new logo is political.\n\"WTF is wrong with @CrackerBarrel??!\" Donald Trump Jr. said in response to a post on X that implied the logo may be motivated by diversity, equity and inclusion efforts.\nOther people are embracing the changes on social media.\n\"Cheers to the new logo!!!! We love you!\" one Instagram commenter said.\nWho is the man in the old Cracker Barrel logo?\nAccording to Cracker Barrel's website, the man in its old logo is not a specific person, but rather a representation of the brand.\n\"There’s an image of a man relaxing by a cracker barrel, representing the old country store experience where folks would gather around and share stories,\" the website says. \"Our logo reflects our roots and the warm, welcoming atmosphere we’ve always aimed to create.\"\nIn addition, the old logo featured the Cracker Barrel name up against a pinto bean shape, which was a nod to one of the restaurant's original sides, its website said.\nDan Evins, Cracker Barrel's founder, enlisted the help of Nashville-based designer Bill Holley to create the logo. Holley \"sketched his first draft of the Cracker Barrel logo on a napkin,\" according to the company.\nThis story has been updated to add new information.\nMelina Khan is a national trending reporter for USA TODAY. She can be reached at melina.khan@usatoday.com."
    },
    {
      "url": "https://www.usatoday.com/story/news/politics/2025/08/21/americans-democracy-redistricting/85754887007/",
      "text": "Americans worry democracy in danger amid gerrymandering fights, Reuters/Ipsos poll finds\nWASHINGTON, Aug 21 (Reuters) - Most Americans believe that efforts to redraw U.S. House of Representatives districts to maximize partisan gains, like those under way in Texas and California, are bad for democracy, a new Reuters/Ipsos poll found.\nMore than half of respondents -- 57% -- said they feared that American democracy itself was in danger, a view held by eight in 10 Democrats and four in 10 in President Donald Trump's Republican Party.\nThe six-day survey of 4,446 U.S. adults, which closed on Monday, showed deep unease with the growing political divisions in Washington -- where Republicans control both chambers of Congress -- and state capitals.\nThe poll found that 55% of respondents, including 71% of Democrats and 46% of Republicans, agreed that ongoing redistricting plans- such as those hatched by governors in Texas and California in a process known as gerrymandering - were \"bad for democracy.\"\nAt Trump's urging, Republican Texas Governor Greg Abbott has called a special session of the state legislature to redraw the state’s congressional maps ahead of the 2026 midterm elections, aiming to help Republicans defend their 219-212 U.S. House majority.\nIncumbent presidents' parties typically lose House seats in midterms, which can block their legislative agendas and in Trump's first term led to two impeachment probes.\nCalifornia Democratic Governor Gavin Newsom, a White House hopeful in 2028, has threatened to try to redraw his state's district map in response, adding five Democratic seats to offset Republicans' expected Texas gains.\nThe practice is not new but has gained attention because it is happening mid-decade rather than following a census. It has meant that the vast majority of House races are not competitive in general elections; in recent decades about two-thirds of them were won by more than 20 percentage points.\nAs president, Trump has flouted democratic norms with steps including directing the U.S. Justice Department to pursue his political adversaries, pressuring the independent Federal Reserve to lower rates and seizing control of Washington, D.C.'s police force.\nIn interviews, Texas Republicans who participated in the poll largely supported the state’s potential redistricting, while Democrats described it as “cheating” but supported the idea of Democratic states trying to respond in kind.\nThe poll had a margin of error of about 2 percentage points when describing the views of all Americans and about 3 points for the views of Republicans and Democrats.\n'Shady Business'\nAmanda Kelley, 51, an insurance fraud investigator in Dallas, was the rare Republican to criticize the Texas effort.\n\"I don't like it when either side tries to do that. I think that's shady business,\" Kelley said. \"The optics of it happening in the middle of the term when you would draw district lines, that leaves kind of a bad taste in my mouth.\"\nPaul Wehrmann, 57, an attorney in Dallas who described himself as an independent voter, also opposed it.\n\"It's unfair, and it sets a bad precedent,\" said Wehrmann, who worries it could spiral into states redrawing maps every election cycle instead of every decade. Partisan gerrymandering \"is bad all around, but I think that it is fair for Democrats to try to counterbalance what Republicans are doing.\n\"They need to stop bringing a knife to a gunfight.”\nAmericans of both parties have long disliked elected leaders of the rival party, but the Reuters/Ipsos poll found that they also distrust regular people who align with the opposing party.\nSome 55% of Democrats agreed with a statement that \"people who are Republican are NOT to be trusted,\" while 32% disagreed. Republicans were split, with 43% agreeing that Democrats were untrustworthy and 44% saying they disagreed.\nThe poll also showed politics weighing more on people's everyday lives than in past years, particularly among Democrats. Some 27% of Democrats said last year's presidential election has negatively affected their friendships.\nA Reuters/Ipsos poll in April 2017, early in Trump's first term, showed a smaller share of Democrats - 18% - reported fraying friendships because of the election. Only 10% of Republicans said this month that politics weighed on their friendships, largely unchanged from 2017.\nJeffrey Larson, a 64-year-old toxicologist and Republican voter in Seabrook, Texas, said he and his wife, a Democrat, agreed not to discuss politics.\n“I might not agree with what the Democrats are doing, but I don’t think that they’re trying to specifically destroy my life or destroy America,” Larson said.\nClose to half of Democrats - or 46% - said their party had lost its way, compared to 19% of Republicans who said the same of their party.\nSandy Ogden, 71, a tech executive from Sunnyvale, California and self-described Democrat, said she faulted her party's leaders.\n“I think the Democratic Party members are united in what we believe, but the leaders are ineffective in mounting an opposition that works,” Ogden said.\nAnalysts said that ordinary Democrats' greater mistrust of Republicans and friction with friends suggests a reluctance among Democrats to engage with Republicans that could harm the party's chances at regaining political standing.\n“Democracy involves a willingness to allow people with differing views to express those views,” said Whit Ayres, a veteran Republican pollster.\nMichael Ceraso, a longtime Democratic operative, found the poll results frustrating.\n\"The majority of Democrats believe our democracy is failing and nearly half of them don’t want to talk to the opposition party,\" Ceraso said. \"We have to be better.\"\n(Reporting by Jason Lange, Nolan D. McCaskill and James Oliphant; Editing by Scott Malone and Cynthia Osterman)"
    },
    {
      "url": "https://www.usatoday.com/story/entertainment/tv/2025/08/21/south-park-new-episode-donald-trump/85739050007/",
      "text": "'South Park' escalates war with Donald Trump in brutal new episode\n\"South Park\" headed to Washington for its latest spoof of the Trump administration.\nThe Comedy Central series' new episode \"Sickofancy,\" which aired on Aug. 20, continued a season-long thread of mocking President Donald Trump and depicting him in a romantic relationship with Satan.\nIn the episode, scenes at the White House show a long line of guests, including Apple CEO Tim Cook, lining up to meet with Trump and inflate his ego by presenting him with a gift, heaping him with over-the-top praise, and reassuring him about his physical endowment. Later, Meta CEO Mark Zuckerberg is also seen bringing a gift to Trump, who verbally berates him.\nThe main plot centers on Randy Marsh concocting a plan to grow his business by lobbying to change marijuana laws. So he sends Towelie, a talking towel, to Washington to meet with Trump and suck up to him.\nWhen Towelie arrives, he finds that statues of Thomas Jefferson and Abraham Lincoln have been replaced with statues of Trump, which undersells his manhood. In another scene, guests about to meet with Trump at the White House are told to \"avoid staring directly into\" it.\nThe episode also features Satan speaking with ChatGPT about trying to get out of his relationship with Trump, only to determine that there is \"no escape from this place.\" Vice President JD Vance makes another appearance during a bedroom scene between Trump and Satan, where he is again depicted as Trump's servant.\nWhen Towelie is in Washington, he finds the place is swarming with troops, though the episode doesn't delve into this further. Trump announced on Aug. 11 that he had deployed 800 National Guard troops to Washington, D.C, and seized control of the local Metropolitan Police Force, which he described as an effort to \"rescue our nation's capital\" from crime. According to data from the Metropolitan Police Department previously reported by USA TODAY, violent crime in Washington, D.C., dropped 26% through Aug. 8, 2025, compared to the same period in 2024.\nWith \"Sickofancy,\" \"South Park\" kept up its satire of the Trump administration that has been a major part of its 27th season.\nIn July, the series' buzzy Season 27 premiere, \"Sermon on the 'Mount,\" introduced a new parody of Trump that used real photos of the president, crudely placed on an animated body. Trump was shown in the season premiere literally getting into bed with Satan in a way nearly identical to how \"South Park\" previously depicted Saddam Hussein.\nIt was a notable shift in the way that \"South Park,\" which has a reputation for ridiculing both sides of the political aisle, handled Trump. During the 2016 election, the show had one of its own characters, Mr. Garrison, run for president and serve as a stand-in for Trump, rather than focusing on the man himself.\nThe White House previously fired back at South Park's Season 27 premiere, with spokesperson Taylor Rogers saying in a statement to USA TODAY the show \"hasn't been relevant for over 20 years and is hanging on by a thread with uninspired ideas in a desperate attempt for attention.\"\nBut the show doubled down in the second episode of the season, which aired on Aug. 6 and featured the exact same rendition of Trump, who was once again shown as the lover of Satan. This time, the show also went after Vice President JD Vance.\nThe Aug. 6 episode also mocked Immigration and Customs Enforcement's recruitment process. In the episode, school counselor Mr. Mackey loses his job and is instantly hired by ICE, despite his lack of qualifications. ICE agents were shown in the episode aggressively launching raids on a \"Dora the Explorer\" live show and even in heaven.\nThe episode additionally skewered Secretary of Homeland Security Kristi Noem and featured her repeatedly shooting dogs, a reference to Noem's infamous anecdote about killing an \"untrainable\" family dog.\nWhen will the next episode of 'South Park' air?\n\"South Park\" is set to continue its Season 27 pattern of releasing one episode every two weeks.\nAccording to Comedy Central, the next episode of Season 27 will air on Wednesday, Sept. 3, followed by another episode two weeks later, on Sept. 17.\nContributing: Cybele Mayes-Osterman and Erin Mansfield, USA TODAY"
    },
    {
      "url": "https://www.usatoday.com/story/entertainment/celebrities/2025/08/20/sydney-sweeney-bathwater-soap-controversy/85750186007/",
      "text": "Sydney Sweeney stands by controversial bathwater soap, compares herself to Jacob Elordi\nAs a businesswoman, Sydney Sweeney isn't afraid to push the envelope, even if the fan mail isn't always glowing.\nThe Emmy-nominated actress, who's stirred controversy with her provocative campaign ads, opened up about the backlash she received for her bathwater-scented soap with Dr. Squatch in an interview with The Wall Street Journal published Aug. 20.\nSweeney, who had teamed up with the men's hygiene brand in 2024 for a suggestive body wash commercial, followed up the collaboration in May with Sydney's Bathwater Bliss, a bar soap that was reportedly infused with her used bathwater.\n\"When your fans start asking for your bathwater, you can either ignore it or turn it into a bar of Dr. Squatch soap,\" Sweeney said in a press release at the time. \"It's weird in the best way, and I love that we created something that's not just unforgettable, it actually smells incredible.\"\nThe soap's sensual marketing theme sparked mixed reactions on social media, with some users dubbing it a \"gimmick\" and questioning the item's cleanliness.\n\"It was mainly the girls making comments about it, which I thought was really interesting,\" Sweeney reflected in her Wall Street Journal interview. \"They all loved the idea of Jacob Elordi's bathwater.\"\nSweeney's \"Euphoria\" costar Jacob Elordi, who also starred in the 2023 dark comedy \"Saltburn,\" achieved an eccentric sex symbol status after a scene from the film depicted Barry Keoghan's character drinking Elordi's bodily fluid-filled bathwater.\nThe racy sequence even inspired the creation of Elordi bathwater-scented candles, although the actor was not involved in the manufacturing or sale of the products.\nWhy Sydney Sweeney pays attention to controversial campaigns\nSweeney's bathwater soap isn't the only business move of hers that's raised eyebrows.\nIn July, the \"Anything But You\" star became the face of denim retailer American Eagle's newest campaign, which featured biology-inspired wordplay praising Sweeney's \"great jeans.\"\nThe campaign quickly ignited a cultural firestorm, with some accusing Sweeney and American Eagle of subtly endorsing eugenics, the discredited belief that the human population can be improved through selective breeding. Even President Donald Trump weighed in on the sartorial scandal, defending the actress's \"hot\" ad.\nWhile Sweeney has yet to comment on the backlash, American Eagle defended the campaign in an Aug. 1 statement: \"'Sydney Sweeney Has Great Jeans' is and always was about the jeans. Her jeans. Her story.\"\nAlthough Sweeney doesn't take the controversy to heart, she told The Wall Street Journal that she keeps tabs on her brand's public reception.\n\"I think it's important to have a finger on the pulse of what people are saying,\" Sweeney said. \"Because everything is a conversation with the audience.\"\nContributing: Melina Khan, Nicole Fallert, Joey Garrison, Jay Stahl and Anna Kaufman, USA TODAY"
    },
    {
      "url": "https://www.usatoday.com/story/news/politics/2025/08/21/trump-says-he-plans-to-patrol-dc-streets-alongside-law-enforcement/85761029007/",
      "text": "President Trump says he will patrol DC streets with police, military on Thursday\n\"I'm going out tonight, I think, with the police and with the military, of course,\" President Trump said. \"And we're going to do a job.\"\nWASHINGTON − President Donald Trump said he will join law enforcement on the streets of Washington, DC, on the night of Thursday, Aug. 21 amid his federal takeover of DC.\nTrump announced his extraordinary plans to patrol with DC police and the National Guard on the Todd Starnes Radio show.\n\"I'm going to be going out tonight,\" Trump told Starnes. \"I'm going to keep it a secret. You're the only one that knows ‒ you and your lots of listeners.\n\"I'm going out tonight, I think, with the police and with the military, of course,\" the president added. \"And we're going to do a job.\"\nThe White House said details about Trump's appearance with law enforcement will be announced later.\nIt comes 10 days after he ordered 800 National Guard troops to the streets of Washington and took action to seize control of the city's police force after declaring a local crime emergency in DC.\nTrump said the aggressive steps were necessary to combat crime in the city, even though Washington's violent crime rate was down 26% in 2025 compared with last year.\nVice President JD Vance, joined by Defense Secretary Pete Hegseth and top White House aide Stephen Miller, stopped by Washington's Union Station on Aug. 20 to thank National Guard troops and claim that crime has already dropped drastically in the nation's capital following Trump's takeover.\nBut the three Trump administration officials faced heckling from a small group of protesters who chanted \"Free DC!\" and produced a drumbeat of noise that drowned them out. Miller mocked the protesters as \"elderly white hippies\" who don't represent DC, which has more Black than white residents.\nTrump has already hailed his deployment of the National Guard and efforts to federalize the Metropolitan Police Force as a major success and boasted that his efforts have the support of most of the district.\n\"Even Democrats are calling me up and saying, 'It's unbelievable,'\" Trump said of the progress as a result of his crackdown in DC. \"You know it's been four days, right? And they said it's unbelievable.\"\nBut a poll of Washington, DC, residents conducted by the Washington Post and George Mason University this week found that 79% oppose Trump's crime crackdown in DC and 65% said they don't believe it will reduce violent crime.\nThis story has been updated to add new information.\nReach Joey Garrison on X @joeygarrison."
    },
    {
      "url": "https://www.usatoday.com/story/entertainment/celebrities/2025/08/21/serena-williams-weight-loss-zepbound-glp-1/85754907007/",
      "text": "Serena Williams reveals GLP-1 weight loss in partnership with healthcare company Ro\nSerena Williams is opening up about her experience with GLP-1 medications.\nSometimes dubbed wonder drugs, the injection-format medicines, which include major brand names like Ozempic and Wegovy can assist in major weight loss. Williams, 43, in a new series of interviews, is revealing that GLP-1s are responsible for a recent 31-pound slim down.\n\"I was on and off (the medication) and now completely on,\" she told the \"Today\" show. \"It was a really good decision I had to make for my life. I tried everything.\"\nA tennis great, Williams shared the decision as part of a partnership with healthcare company Ro, which helps get patients access to GLP-1s.\n\"This all started after I had my (first) kid,\" Williams added. She shares two children − Olympia, 7, and Adira, 2, with husband Alexis Ohanian. Ohanian is an investor in Ro.\n\"As a woman, you go through different cycles in your life,\" Williams said. \"No matter what I did − running, walking, I would walk for hours because they say that's good, I literally was playing a professional sport − and I could never go back to where I needed to be for my health. Then, after my second kid, it just even got harder. So then I was like, OK, I have to try something different.\"\nThe tennis star's candor may help to dispel the pesky health innacuracy that weight loss is a simple matter of exercise. While an active life and healthy eating can help with the process, new research suggests that outside factors like genetics may play a bigger role than previously thought. As arguably one of the world's greatest athletes, Williams' decision to share her journey with GLP-1s may help to reshape the image of the drugs.\n\"A misconception is that it's a shortcut,\" she said in the interview. \"As an athlete and as someone that has done everything, I just couldn't get my weight to where I needed to be at a healthy place − and believe me, I don't take shortcuts.\"\nWilliams, who has won 23 Grand Slam titles, went on to imply that the drug may have helped with some wins in her career if she had been taking it earlier.\n\"I had a lot of knee issues,\" she told the show. \"Especially after I had my kid (and) was never able to get to my normal levels of weight. And that, quite frankly, definitely had an effect on maybe some wins that I could have had in my career.\" On the new medication, which she later told Vogue was Zepbound, her blood sugar and joint pain have improved, she said.\nWhile the drugs, which have skyrocketed in popularity and ripped through Hollywood, offered Williams the extra boost she needed, she told Vogue she was aware of how much of a stigma remained.\n\"I’m not saying any of this lightly, which is why it’s so important to have an honest conversation about this topic,\" she said. \"I'm the mom of two girls, and I wanted to be very honest about what I'm doing so they can always be the same with me and we can have an open relationship.\"\nThe medications, which work by targeting certain hormones to suppress appetite, have made Williams feel \"sexier\" and \"more confident,\" she said. And as for those who say if you work hard enough in the gym, you won't need the drugs, Williams says they're misinformed.\n\"Sometimes you need help. Your story is your story, and it's okay to make that choice to do it if you want to,\" she told Vogue. \"I did, and I'm really happy with it.\""
    },
    {
      "url": "https://www.usatoday.com/story/entertainment/celebrities/2025/08/21/millie-bobby-brown-jake-bongiovi-adopt-child/85760676007/",
      "text": "Millie Bobby Brown and Jake Bongiovi adopt baby girl: 'And then there were 3'\nMillie Bobby Brown and Jake Bongiovi are starting their parenthood journey.\nThe \"Stranger Things\" actress, 21, revealed in an Instagram post on Aug. 21 that she and her husband, 23, have adopted a \"sweet baby girl\" together.\n\"We are beyond excited to embark on this beautiful next chapter of parenthood in both peace and privacy,\" Brown and Bongiovi wrote in their joint post.\n\"And then there were 3,\" the couple added, with The Beatles song \"Ob-La-Di, Ob-La-Da\" accompanying the announcement. They did not share the child's name.\nBrown and Bongiovi, who is the son of singer Jon Bon Jovi, first confirmed their relationship in 2021. In 2024, they tied the knot in a ceremony officiated by Brown's \"Stranger Things\" costar Matthew Modine.\nOn the \"Call Her Daddy\" podcast, Brown revealed she met Bongiovi after getting his number through a mutual friend and cold-calling him to ask if he was single. \"We were friends for a while,\" she said. \"We (would) text back and forth, and we watched shows on Zoom and stuff together.\"\nBrown's baby announcement comes after she appeared on the \"SmartLess\" podcast in March and shared that she and Bongiovi hoped to start a large family together.\n\"Jake knows how important it is to me (to have children),\" she said on the podcast. \"Of course, I want to focus on really establishing myself as an actor and as a producer, but I also find it's so important to start a family for me, personally. It's a huge thing.\"\nShe continued, \"Jake was like, 'We cannot do that until we get married.' So that was his thing, and my thing was, I really want a family. I really want a big family. I'm one of four. He's one of four. So it is definitely in our future.\"\nBrown is preparing to close a major chapter in her life by saying goodbye to \"Stranger Things,\" the show that made her famous with her role as Eleven. The Netflix phenomenon's final season is set to debut in November.\n(This story has been updated to include additional information.)"
    },
    {
      "url": "https://www.usatoday.com/story/money/food/2025/08/21/potbelly-free-sandwich-bogo-deal/85753933007/",
      "text": "Potbelly is giving away free sandwiches: How you can get the BOGO deal\nYou can add a free sandwich to your school supply list.\nPotbelly is offering a sandwich buy one get one (BOGO) deal to make the transition back to school that much easier.\nThe deal kicks off on Tuesday, Aug. 26, at Potbelly locations nationwide to celebrate the return to the classroom.\nWhat is the BOGO deal?\nPotbelly lovers will get a free Original sandwich when they buy any Original or BIG sandwich on the menu, the restaurant said.\nPotbelly's secret underground menu items, which are available on the app, also are included in the promotion.\nFans can get the deal using the code \"BOGO\" on the Potbelly app or online at potbelly.com.\nWhere is Potbelly located?\nFounded in Chicago in the late 70s, Potbelly is a popular sandwich shop known for its toasty subs, soups and hand-dipped milkshakes.\nThere are more than 400 locations throughout the country, including big cities like Washington, DC, New York and Houston.\nTaylor Ardrey is a news reporter for USA TODAY. You can reach her at tardrey@gannett.com."
    },
    {
      "url": "https://www.usatoday.com/story/news/weather/2025/08/21/hurricane-center-fernand-follow-erin/85756936007/",
      "text": "Hurricane forecasters say another storm could soon follow Hurricane Erin\nAs Hurricane Erin heads out to sea, forecasters are also watching the next weather disturbance in the Atlantic, a tropical wave that could become Tropical Storm Fernand.\nAs Hurricane Erin pulls away from the East Coast and heads out to sea, forecasters are also watching the next weather disturbance in the Atlantic Ocean, a developing tropical wave that could become Tropical Storm Fernand (pronounced fair-NAHN) in the days ahead.\nIt's one of three developing systems the National Hurricane Center is tracking in the Atlantic on Aug. 21.\nAccording to the Aug. 21 morning report from the hurricane center, \"an area of showers and thunderstorms associated with a tropical wave located a few hundred miles east of the Leeward Islands has changed little over the past several hours.\"\nThe system is marked by the red \"x\" on the map below.\nHowever, the NHC added that \"environmental conditions appear conducive for further development of this system, and a tropical depression is likely to form this weekend while it moves near or to the north of the northern Leeward Islands.\"\nIf the depression's winds reach 39 mph, it would be named Tropical Storm Fernand, the sixth named storm of the 2025 Atlantic hurricane season.\nActive Atlantic but no landfalls likely\n\"Although the Atlantic will stay active into the latter half of August, for now we don’t see any significant land threats from the systems being monitored,\" noted WPLG-TV hurricane specialist Michael Lowry in his Substack post.\nAs for the system that's likely going to be Fernand, Lowry said \"the disturbance that’ll be moving near and north of the Leeward Islands of the eastern Caribbean tomorrow (Aug. 22) has a high chance of development and will likely become our next named storm but will be turning quickly out to sea.\nIndeed, for now, the majority of computer forecast models suggest this system will eventually curl north, then northeast into the central Atlantic Ocean next week, potentially a threat to Bermuda, depending on when it makes that northward turn, according to a forecast from Weather.com.\nIt's too soon to determine what impact, if any, the system would have on the beaches along the U.S. East Coast that have been battered by Erin.\nBut before it heads out to sea, \"it will bring squally weather and increased storminess to the northeastern Caribbean islands, including Puerto Rico and the U.S. Virgin Islands, tomorrow (Aug. 22) and Saturday (Aug. 23) but isn’t expected to develop until after it pulls away this weekend,\" he said.\nWill developing storm impact Puerto Rico and the Virgin Islands?\nThe system will first impact the two U.S. territories in the Caribbean: The National Weather Service in San Juan said \"across the Virgin Islands, ponding of water in roads is anticipated with isolated urban flooding. For Puerto Rico, urban and small stream flooding are likely along the interior and northwest, with ponding of water elsewhere.\"\nAnother system is out there\nMeanwhile, far out in the Atlantic, Lowry said the disturbance designated Invest 99L (orange x on the map) will be battling high wind shear for the next few days along with some drier air over the weekend, and anything that forms will likely be short-lived. The NHC agrees, noting on the morning of Aug. 21 that \"showers and thunderstorms associated with a tropical wave located several hundred miles west-southwest of the Cabo Verde Islands show some signs of organization.\"\n\"Environmental conditions appear marginally favorable for additional development over the next day or so while the system moves west-southwestward at around 15 mph, and a short-lived tropical depression could form.\n\"In a couple of days, environmental conditions are expected to become unfavorable for further development,\" the hurricane center said.\nThird tropical system also being watched by NHC\nA small area of low pressure located about 1,200 miles southwest of the Azores (yellow x on the above map) is producing limited showers and thunderstorms on Aug. 21, the hurricane center said. \"Upper-level winds are only marginally conducive for development while the system moves slowly eastward over the next couple of days.\"\nQuiet period ahead?\nBeyond these systems, \"unfavorable upper-level wind conditions are expected to kick up this week over the Atlantic’s Main Development Region, and the end of August and first week of September should be relatively quiet in the tropics,\" said Ryan Truchelut. Truchelut is the chief meteorologist at WeatherTiger, and works with the USA TODAY Network."
    },
    {
      "url": "https://www.usatoday.com/story/news/politics/2025/08/21/donald-trump-civil-fraud-case-appeal-decision/85759082007/",
      "text": "Trump's $454 million civil fraud court loss thrown out by appeals court\nPresident Donald Trump scored a major personal legal victory, as a New York appeals court determined a massive penalty in a real estate fraud case was improper.\nThe $454 million penalty imposed against President Donald Trump in his New York civil fraud case has been thrown out by an appeals court.\nTrump and some of his entities were hit with that hefty penalty, plus interest, in February 2024, after New York trial Judge Arthur Engoron concluded that Trump had inflated the value of his assets for years to get better loan and insurance terms. Engoron also imposed about $10 million in separate penalties against Trump's eldest sons, Eric and Don Jr., and former Trump Organization executive Allen Weisselberg.\nHowever, in an Aug. 21 ruling that included multiple opinions from different members of a five-judge panel, the Manhattan-based appeals court determined the penalties for Trump and the others were improper. Some members of the panel said that the penalty violated the U.S. Constitution's prohibition on excessive fines. Others said Trump should be afforded a new trial due to errors in the trial judge's determinations.\nThe ruling did uphold non-financial punishments against Trump and others, including a three-year ban on Trump applying for loans from New York banks.\nThe ruling marks another major personal legal victory for Trump, who has also seen multiple criminal cases against him crumble following his November presidential election victory. Trump's appeal against his conviction in his New York criminal case dealing with payments to adult film star Stormy Daniels is ongoing.\nTrump claims 'TOTAL VICTORY'\nTrump called the decision a “TOTAL VICTORY” on social media.\n“I greatly respect the fact that the Court had the Courage to throw out this unlawful and disgraceful Decision that was hurting Business all throughout New York State,” he posted on Truth Social Aug. 21. “It was a Political Witch Hunt, in a business sense, the likes of which no one has ever seen before.”Trump also used the ruling as an opportunity to argue that both his New York criminal conviction and his $88.3 million defamation and sexual abuse court losses to New York writer E. Jean Carroll should also be thrown out.\n“Sadly, there are other Cases against me that are equally disgraceful,” Trump said.\nTrump's oldest sons also celebrated the ruling on social media.\n\"Total victory in the sham NY Attorney General case!!! After 5 years of hell, justice prevailed!\" Eric Trump said in an Aug. 21 post on X.\nDonald Trump Jr. pointed to a February, 2024 post from New York Attorney General Letitia James, who brought the case, in which she celebrated the massive financial judgment Engoron had imposed – more than $464 million.\n\"I believe you mean $0.00 Thank you for your attention to this matter,\" he said in an Aug. 21 repost of James' comment on X.\nNY AG Letitia James claims partial victory, vows to appeal\nJames claimed partial victory because the appeals court did uphold portions of Engoron's ruling that temporarily restricted Trump's ability to do business in New York and required monitoring of the Trump Organization.\n\"It should not be lost to history: yet another court has ruled that the president violated the law, and that our case has merit,\" James said in a statement.\nOnly two of the five appeals court judges – Peter H. Moulton and Dianne T. Renwick – actually backed the portions of Engoron's ruling that placed those restrictions on Trump and his businesses. But another two of the judges – John R. Higgitt and Llinét M. Rosado – also agreed to uphold those portions of the ruling. They said they believed an entire new trial was warranted, but were nonetheless agreeing to uphold the non-financial restrictions in order to create a majority ruling from the appeals court panel.\nThe fifth judge on the panel, David Friedman, said he would have dismissed the attorney general's lawsuit completely.\n“We will seek appeal to the Court of Appeals and continue to protect the rights and interests of New Yorkers,\" James also said in her statement.\nContributing: Bart Jansen and Eduardo Cuevas – USA TODAY.\nThis story has been updated with additional information."
    },
    {
      "url": "https://www.usatoday.com/story/news/politics/2025/08/21/trump-republicans-texas-democrats-california/85756561007/",
      "text": "Trump's GOP on verge of big Texas win, but battle for power is only starting: 5 takeaways\nTrump's Texas fight is aimed at giving the GOP an advantage in 2026 and a lame-duck president more power while in office. Democrats have other plans.\nA partisan battle in Texas over who holds power in Washington during the final two years of President Donald Trump's second term has unfurled into a nationwide debate drawing in top political figures as voters brace for another divisive election in 2026.\nThe Lone Star State's Republican lawmakers are poised to send new congressional maps to Republican Gov. Greg Abbott on Aug. 21 that Trump and his allies hope will give them a strategic advantage in holding on to their majority in the U.S. House of Representatives.\nBut the fight in Austin has spread beyond the state's borders and created significant uncertainty about who will be in position to govern during the second half of the Trump administration and after the next race for the White House.\n“Game on,” New York Gov. Kathy Hochul wrote Aug. 20 in a social media post. She is one of several Democratic leaders considering their own steps like the Texas Republicans to redraw congressional district borders inside their state.\nHere are five takeaways on the fast-spreading redistricting wars:\nRepublicans have the upper hand if the redistricting war expands.\nStates typically redo their congressional boundaries for voters every decade, specifically in the two years that follow a new census. But Trump has encouraged redistricting to happen ahead of the 2026 U.S. House elections.\nHis motivation? The tendency of the party in the White House to lose seats in the U.S. House during the congressional elections between presidential elections. Recent examples include the 1994, 2010, 2018 and 2022 political cycles. Trump and the GOP are hoping to break that trend or increase their 219-212 U.S. House majority through states with Republican legislatures that can draw congressional maps.\nBy contrast, many Democratic states have passed laws and constitutional amendments creating independent commissions to draw their congressional district maps instead of politicians. That’s part of why states such as Missouri and Indiana have discussed redistricting for Republican advantage, but the Democratic stronghold of Washington has ruled it out.\nAdditionally, Ohio needs to redraw its own congressional maps under a constitutionally required process regardless of today’s political climate, and Florida has created a special committee to redraw congressional maps.\nTaken together, that means that there are three high-population states actively pursuing Republican seats, and so far California is the only major state likely to redistrict for Democrats ahead of 2026.\nA legal fight over the new Texas maps is brewing\nWhat's happening this week in Texas won't be the final say on whether the maps are permanent. That's for the courts to decide, though fights like this can take years to work their way through the system.\nDemocrats and Republicans previewed their legal arguments during the Texas Legislature's floor debate Aug. 20 that ended in the House's approval of the Republican-favored new maps.\nDemocratic lawmakers accused their GOP colleagues of “packing” Hispanic voters into some districts and “cracking” or “diluting” their representation. Those are all key terms referring to practices that opponents have used when challenging maps. They also asked Republicans whether they drew maps based on voters’ Hispanic ethnicity, because race-based gerrymandering is illegal.\nTexas state Rep. Todd Hunter, the Republican author of the bill that changes the maps, explained that an outside law firm drew the maps, not members of the Legislature or their in-house staff. He said he asked the firm to redraw the maps to improve his party’s “political performance” in the state, using a term he said was backed up by a recently decided federal court case.\nHunter used the term repeatedly during hours of questioning by Democrats.\nAmericans still don’t like gerrymandering\nAmericans haven't historically liked it when politicians draw maps in their favor, but they may support the practice when it benefits the party they agree with.\nA nationwide Reuters/Ipsos poll Aug. 13-18 found that a small majority of respondents thought the redistricting plans were “bad for democracy,” and Democrats were more likely to think this than Republicans. A poll by the market research firm YouGov Aug. 1-4 found that three-quarters of adults saw it as a “major problem” when states draw maps to intentionally favor one party, and another one-fifth saw it as a “minor problem.” These proportions, too, are higher among Democrats and lower among Republicans.\nBut in California, where Democratic lawmakers wants voters to decide in a Nov. 4 special election whether to redraw their own maps in favor of Democrats, a majority of voters support the initiative. The proposal has support from 57% of California voters, according to Gov. Gavin Newsom's own polling, as reported by Axios, including overwhelming support from Democrats and overwhelming opposition from Republicans.\nA Politico-UC Berkeley Citrin Center poll of nationwide voters that ran through Aug. 20 found about one-third of respondents said Democrats in California should “fight back” with their own maps. That broke down to almost two-thirds of Democrats, one-third of independents and about one-tenth of Republicans.\nNew Democrats are getting their time in the spotlight\nAmericans are seeing new faces emerge from the Democratic Party as they make national headlines fighting back against often better-known Texas Republicans.\nCalifornia Gov. Gavin Newsom, widely seen as a front-runner for his party’s presidential nomination in 2028, is one of them. His decision to go toe-to-toe with Texas and leverage his position in the only state with more congressional seats than the Lone Star State has meant an introduction to Americans all over the country and a national spotlight on his ideas.\nIllinois Gov. JB Pritzker, one of the names floated for vice president in 2024, got his name out there when he hosted Texas Democrats who fled their state for nearly two weeks. But the fight has also highlighted what anti-gerrymandering advocates have called an unfair map tilted toward Democrats in Illinois. New York Gov. Kathy Hochul, who says she wants to retaliate against Texas, is also gaining some attention.\nAnother new face is Texas Rep. Nicole Collier of Fort Worth, who slept on the floor of the Legislature. Texas Republican leaders have been requiring the Democratic lawmakers who broke quorum in August to sign permission slips to leave the chamber and have a state police escort follow them around 24 hours a day to make sure they don’t try to leave the state again.\n“Today is not the end,” Collier said after the House passed the bill Aug. 20. “It is the beginning, the start of a new Democratic party where we won’t back down. … And we will push and push and push until we take over this country.”\nBarack Obama, Kamala Harris and Donald Trump are all involved\nTrump kicked off the firestorm when he called on Texas lawmakers to redraw the maps and provide five more Republican-leaning congressional districts. Now he's facing off with Democratic Party standard-bearers who have come into the fight.\nFormer President Barack Obama posted on X that the attempt to redraw districts in Texas was an “assault on democracy,” and he praised Texas Democrats. Now he has endorsed Newsom’s plan to redistrict California’s congressional maps in retaliation.\nFormer Vice President Kamala Harris also called Collier while she stayed in the Legislature: “You really are inspiring so many people, and I just want you to know that you are among those who history will reveal to have been heroes of this moment. So you just stay strong and do what you are doing.”\nHarris has ruled out a run for governor of her home state of California in 2026, leaving Americans to wonder whether she'll run for president in 2028.\nContributing: Kathryn Palmer"
    },
    {
      "url": "https://www.usatoday.com/story/shopping/2025/08/21/hexclad-cookware-labor-day-sale/85709110007/",
      "text": "HexClad’s Labor Day sale has up to 44% off chef Gordon Ramsay-loved cookware 🔥\nShop premium cookware sets, new kitchen bundles, knives and more for fall.\nLabor Day is the perfect time to refresh your kitchen setup for the fall season, and HexClad’s Labor Day sale is making it easier than ever to cook like a pro chef, without the splurge. For a limited time, you can save up to 44% on top-rated cookware, including best-selling pots and pans, grill bundles and newly launched knife sets.\nWith up to $1,456 off chef Gordon Ramsay-backed cookware, this Labor Day cookware sale is ideal for upgrading your kitchen before fall entertaining begins or investing in your first set of high-performance fry pans for a new apartment.\nLooking for standout HexClad deals? Don’t miss:\n- 30% off: HexClad 12-Piece Hybrid Perfect Pots and Pans Set\n- 36% off: HexClad 7-Piece Espresso Damascus Steel Knife Set\nShop the HexClad Labor Day sale\nWhether you're prepping for cozy autumn meals or stocking up for back-to-school cooking, HexClad’s hybrid cookware delivers durability, versatility and style. Shop the Labor Day discounts below.\nShop the HexClad Labor Day sale\n💰 All HexClad purchases come with free shipping, 30-day return guarantee and lifetime warranty.\nHexClad Hybrid 6-Piece Fry Pan Set with Lids\n- 15% off: HexClad 12-Inch Hybrid Fry Pan\n- 15% off: HexClad 7-Quart Hybrid Deep Sauté Pan/Chicken Fryer with Lid\nHexClad Everything But the Kitchen Sink Bundle\nHexClad Starter Bundle\nHexClad 12-Piece Hybrid Perfect Pots and Pans Set\nHexClad Hybrid 6-Piece Pot Set with Lids\nHexClad BBQ Grill Pan + Meat Cleaver Bundle\nHexClad 7-Piece Damascus Steel Knife Set\nHexClad 22-Piece All-in Bundle\nHexClad The HexMill Collection Bundle\nWhen is the HexClad Labor Day sale?\nStarting Thursday, August 21 through Wednesday, September 3, you can save up to 44% on HexClad cookware sets, bundles and more at the brand's Labor Day sale.\nWhat is HexClad's lifetime warranty?\nHexClad cookware is designed to last a lifetime. Warranty terms vary by product and do not cover damage resulting from failing to follow care and use guidelines. To activate your lifetime warranty, simply submit this form.\nThe warranty is limited to the original customer or recipient with proof of purchase and is non-transferable. It covers only products bought new from HexClad or authorized sellers, excluding commercial/restaurant use. Each warranty is subject to the disclaimers and general terms at the bottom of this page. HexClad will replace any damaged products under the lifetime warranty, but the customer may be responsible for return shipping fees.\nWhat makes HexClad cookware unique?\nHexClad cookware is renowned for its unique hybrid technology, combining the best features of stainless steel and non-stick surfaces. Here are some of the reason why customers love HexClad:\n- Hybrid Technology: The patented hexagonal design creates a distinctive hybrid cooking surface that incorporates the durability of stainless steel with the ease of non-stick. This design ensures even heat distribution and superior searing capabilities.\n- Non-Toxic and PFOA-Free: HexClad cookware is free from harmful chemicals, making it a safe choice for you and your family.\n- Metal Utensil Safe: HexClad’s hybrid surface is metal utensil safe, unlike traditional non-stick pans. Its robust design withstands metal utensils without scratching, offering durability for culinary enthusiasts. The unique composition ensures longevity and reliability, allowing worry-free cooking.\n- Easy to Clean: The non-stick properties make HexClad cookware incredibly easy to clean either by hand or in the dishwasher.\n- Oven-Safe: All HexClad pieces can be used in the oven up to 500 degrees Fahrenheit, providing versatility for various cooking techniques.\n- Lifetime Warranty: HexClad stands behind its products with a lifetime warranty, ensuring you enjoy your cookware for years to come."
    },
    {
      "url": "https://www.usatoday.com/story/money/food/2025/08/21/chipotle-drone-delivery-zipotle/85760358007/",
      "text": "Chipotle may soon deliver your food by flying it to you with a drone\n\"What once felt like science fiction is soon going to become totally normal,\" Zipline CEO Keller Rinaudo Cliffton said in a release.\nAn aircraft may soon be delivering your Chipotle order to your front door.\nThe restaurant chain announced Thursday, Aug. 21, that it has partnered with Zipline, a drone delivery company, to fly orders to customers.\n\"Chipotle's new delivery option, Zipotle, will use Zipline's fleet of quiet, zero emissions aircraft, to make super fast, convenient deliveries that save customers' time and keep orders dine-in fresh,\" the company said in a release.\nThe new delivery method is only available in the greater Dallas area for now, Chipotle said.\n\"With Zipline, you tap a button, and minutes later food magically appears - hot, fresh, and ultra-fast,\" said Keller Rinaudo Cliffton, CEO and co-founder of Zipline. \"Starting today, families in the Dallas area can have food delivered by Zipotle and served for lunch or dinner. What once felt like science fiction is soon going to become totally normal.\"\nChipotle drone delivery: How it works\nChipotle said that eligible customers can download the Zipline app on the App Store or Google Play and place their Chipotle order.\nEmployees will place the order into a \"Zipping Point,\" which allows the Zipline drone to autonomously pick up the order.\nWhen the aircraft reaches its destination, it will lower to the ground and release the order. Chipotle said the drone \"automatically avoids obstacles and gently and precisely places the order at the guest's address.\"\nInitially, Zipotle will carry orders weighing up to 5.5 pounds and will increase to 8 pounds over time, Chipotle said.\nWhere is Chipotle drone delivery available?\nThe Chipotle at 3109 Lakeview Pkwy in Rowlett, Texas, will be the first to offer Zipotle deliveries, the company said.\nA small number of Zipline users will have access to the service starting Aug. 21, and a broader service launch is expected in the coming weeks, Chipotle said.\nZipotle will be available seven days a week. It will at first be available from 12 p.m. to 8 p.m. CT before extending to 10 p.m. CT.\nUSA TODAY has reached out to Chipotle for information about the service expanding into other markets.\nMelina Khan is a national trending reporter for USA TODAY. She can be reached at melina.khan@usatoday.com."
    },
    {
      "url": "https://www.usatoday.com/story/news/politics/2025/08/21/eric-adams-winnie-greco-potato-chip-money-bribe/85758077007/",
      "text": "Eric Adams adviser accused of bribery after giving reporter cash inside potato chip bag\nA former City Hall adviser to New York City Mayor Eric Adams and, until Thursday, Aug. 21, a volunteer for his reelection campaign, reportedly gave a local reporter a wad of cash stuffed inside a bag of potato chips.\nThe non-profit news outlet The City reported the encounter late Wednesday, Aug. 20, a few hours after Winnie Greco allegedly handed an open bag of Herr's sour cream and onion rippled potato chips to journalist Katie Honan following a Harlem campaign event. Initially, Honan thought it was simply a “light snack,” but after they parted ways, she looked inside the bag and discovered a red envelope containing “at least one $100 bill and several $20 bills.”\nHonan texted Greco soon after the discovery to let her know she couldn't accept the money and asked when she could return it. However, she did not receive a response.\nThe City reported the incident to the NYC Department of Investigation, and federal prosecutors from the office of Brooklyn U.S. Attorney Joseph Nocella contacted The City’s lawyers, as reported by the outlet. An investigator later retrieved the chip bag that contained the red envelope and cash.\nAdams and his broader campaign had no immediate ties to the incident.\nA spokesperson for the Brooklyn U.S. attorney's office, John Marzulli, declined to comment when contacted by USA TODAY. Greco's attorney denied the incident was a payoff, according to a statement.\nIn a statement to The City and the New York Times, a spokesperson for Adams’ campaign said Greco has been suspended from all volunteer campaign-related activities and holds no position in the campaign.\n“Mayor Adams had no prior knowledge of this matter,” spokesperson Todd Shapiro said. “He has always demanded the highest ethical and legal standards, and his sole focus remains on serving the people of New York City with integrity.”\nWith less than three months remaining until the general election, Adams is facing significant headwinds in his bid for a second term due to a scandal-filled tenure and consistently low polling numbers. The City and reporter Honan, who previously covered New York City for the Wall Street Journal, have reported extensively on the Adams administration, including on his federal indictment in 2024 and ongoing investigations and indictments of multiple former Adams staffers and associates. Honan's reporting has also focused on Greco’s relationship with Adams.\nWho is Winnie Greco?\nWinnie Greco, the former director of Asian affairs for the city, has been a fixture in Adams' campaigns and the current administration. She has been a key fundraiser and acted as the main liaison between Adams and the Chinese American community.\nShe resigned from her post at City Hall in October 2024 amid scrutiny over her close relationships with people and groups connected to China’s communist regime, and after FBI agents searched two of her Bronx homes in March 2024 in connection with the U.S. attorney's office in Brooklyn.\nAlthough she no longer holds a position at City Hall, Greco has recently reemerged alongside Adams as he campaigns for a second term.\nIn an interview with The City on Wednesday, Aug. 20, Greco was asked what her intention was in handing money to the reporter. In response, the news outlet reported she said she’d made a mistake and apologized.\n“I’m so sorry,\" she told The City. \"It’s a culture thing. I don’t know. I don’t understand. I’m so sorry. I feel so bad right now. I’m so sorry, honey.” In a separate call later that evening, Greco said: \"I just wanted to be her friend. I just wanted to have one good friend. It’s nothing.”\nGreco's attorney, Steven Brill, in a statement to The City, called the money a gesture of friendship and gratitude in Chinese culture. He also told USA TODAY in a statement that while it \"looks odd,\" it would make more sense and carry less negative connotation \"if one understood Winnie's generosity, and her sincere dedication to the Chinese culture.\" He told USA TODAY that Greco \"apologized and asked for the traditional gift to be returned\" once the reporter alerted her that she could not accept the money.\n\"This was no payoff. This was no bag of cash in a dark alley,\" Brill said. \"Any insinuation that this gift had a nefarious intent to influence this reporter or her coverage is misinterpreted and ridiculous.\"\nNew indictments connected to Adams' administration\nThe reports of Greco's attempted cash handoff to the reporter came hours before a new set of indictments was announced against another former adviser to Adams.\nThe Manhattan District Attorney announced on Thursday, Aug. 21, that former adviser Ingrid Lewis-Martin was under investigation for accusations that she engaged in several bribery schemes.\nAdams became the first sitting New York City mayor to face federal indictment last year, after charges were filed in September 2024 claiming he solicited and accepted illegal gifts and campaign donations from wealthy foreigners, including accepting luxury airline tickets, meals, and hotel stays. The mayor pleaded not guilty and has maintained his innocence.\nIn April, the Department of Justice, under President Donald Trump, successfully asked a judge to dismiss the corruption case against Adams. The controversial decision spurred more than half a dozen senior federal prosecutors to resign, and sparked a public outcry.\nAdams has been in NYC's public eye for decades, formerly serving as an NYPD Captain, a state senator and Brooklyn borough president. He was elected as mayor in 2021.\nKathryn Palmer is a national trending news reporter for USA TODAY. You can reach her at kapalmer@usatoday.com and on X @KathrynPlmr."
    },
    {
      "url": "https://www.usatoday.com/story/life/problem-solved/2025/08/21/how-to-choose-ripe-watermelon-grocery-store/85612593007/",
      "text": "What to look for when buying a watermelon at the grocery store: Video\nIt’s not summer unless you’re enjoying some delicious watermelon. A sweet, juicy watermelon can brighten even the dreariest summer day. On the other hand, a bland one can be a disappointment — especially if you’ve been looking forward to it all day.\nFinding a ripe, flavorful watermelon is easier than you think. The knock method is popular but can be a bit of a guessing game. Fortunately, there are more obvious signs you can look for to help you bring home the perfect watermelon to cap off a summer day.\nWatch this video for tips on how to pick the best watermelon at the grocery store.\nRipe watermelon\nThe watermelon should be heavy and a little ugly. You want the rind to have spots and webbing — but not soft or mushy areas.\nLook for a deep yellow field spot, which indicates the watermelon was resting on the ground while growing. It should also have webbing, sometimes mistaken for scratches, on the exterior. This is a sign that sugars have started to leach out and the watermelon will be sweet.\nIf you’re doing the knock test, it should sound dense inside — not hollow.\nShop top-rated related products:\n- At-home lattes: Zulay Kitchen Powerful Milk Frother Wand With Batteries\n- Hands-free gadget: Kitchen Mama Auto Electric Can Opener\n- Top-rated accessory: TrendPlain Olive Oil Dispenser Bottle\n- Best-selling veggie chopper: Mueller Pro-Series 10-in-1, 8-Blade Vegetable Chopper\n- Customer-favorite cooking hack: Clip-On Pasta Strainer Silicone for All Pots and Pans\n- User-friendly tool: Otstar Jar Opener Bottle Opener\n- Meal prep must-have: JAYVAR Onion Holder for Slicing\n- Never waste a drop: OTOTO Splatypus Jar Spatula for Scooping and Scraping\nHow to cut a watermelon\nWhen you’re ready to cut into your watermelon, reach for a serrated knife. It will slice through the rind and flesh more easily than a straight-edged knife.\nHowever you like to cut the watermelon, cut it in short ways.\nTo cut a wedge:\n- With the flat, exposed watermelon facing down, cut the half into fourths.\n- Flip the pieces onto the rind and cut across the shorter end.\nTo cut into pops:\n- With the flat, exposed watermelon facing down, make multiple parallel cuts along it. The number of cuts depends on how thick you want the pops.\n- Rotate the sliced watermelon 90º.\n- Make more parallel cuts.\n- The inside cuts will be easy-to-eat watermelon pops!\n- You can enjoy the edge pieces as is, or cut them into small wedges. This would be great for garnishing!"
    }
  ],
  "argos_summary": "Cracker Barrel’s new simplified logo has sparked backlash from longtime patrons who feel it’s cold and sterile, even as the chain renovates some locations. President Trump joined law‑enforcement officers in Washington, D.C., after deploying the National Guard and taking control of the city’s police force, a move that has drawn criticism and a poll showing many Americans view gerrymandering as a threat to democracy. Walmart is recalling frozen shrimp in 13 states after detecting radioactive cesium‑137, while Hurricane Erin is pulling away from the East Coast but still generating dangerous waves and flooding. The article also touches on South Park’s satirical take on Trump, a Spirit Airlines flight that flew near Erin, and other unrelated news snippets. ",
  "argos_id": "EP9NRYY1S"
}