{
  "url": "https://www.foxnews.com/politics/new-rnc-chairman-counting-trump-win-midterms",
  "authorsByline": "Paul Steinhauser",
  "articleId": "01d7066a475d4d04942ed64577a657ee",
  "source": {
    "domain": "foxnews.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/08/931/523/michael-whatley-joe-gruters-atlanta-ga-aug.-22-2025.jpg.png?ve=1&tl=1",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-24T08:00:23-04:00",
  "addDate": "2025-08-24T12:10:57.746793+00:00",
  "refreshDate": "2025-08-24T12:10:57.746796+00:00",
  "score": 1.0,
  "title": "New RNC chair Joe Gruters vows to 'ride the president all the way to victory' in midterms",
  "description": "Trump ally Joe Gruters takes over as RNC chair, signaling president's complete control over national party committee ahead of challenging midterm elections.",
  "content": "EXCLUSIVE - New Republican National Committee (RNC) chair Joe Gruters outlined his mission as he took over steering the GOP's national party committee.\n\n\"The midterms are ahead, where we must expand our major majority in the House, in the Senate, and continue electing Republicans nationwide,\" Gruters said as he addressed committee members moments after being unanimously elected chair at the RNC's summer meeting, held this year in Atlanta, Georgia.\n\nGruters, a state senator and RNC committee member from Florida, who, until his election as chair on Friday, briefly served as the national party committee's treasurer, is a longtime ally of President Donald Trump. His move to the RNC chairmanship cements Trump’s dominance over the GOP as it prepares for midterm battles next year.\n\nAnd a month ago, Trump endorsed Gruters to succeed now-former RNC chair Michael Whatley, who stepped down as he runs for the Senate in battleground North Carolina in the blockbuster race to succeed retiring GOP Sen. Thom Tillis.\n\nLONGTIME TRUMP ALLY TAKES OVER AS CHAIR OF REPUBLICAN NATIONAL COMMITTEE\n\nThe ascension of Gruters to RNC chair is the latest sign of Trump's complete control over the national party committee.\n\n\"This is the president's party. This is the president's vision, overall. The party fully embraces the president,\" Gruters said as he and Whatley stood for an exclusive interview with Fox News Digital.\n\nWhatley, who Trump picked to steer the RNC a year and a half ago, noted that \"we have transformed the RNC, basically the way that President Trump has transformed the Republican Party.\"\n\nGruters has been a major Trump supporter dating back to the president's first campaign for the White House. Gruters served as Florida co-chair Trump's 2016 campaign.\n\nThe Democratic National Committee, taking aim at Gruters following his election as chair, claimed that \"Gruters and Trump will have a lot to bond over while they turn the Republican Party into even more of a personal propaganda machine for Trump.\"\n\nRepublicans swept back to power last November, with Trump winning the White House, the GOP retaking control of the Senate and holding onto their fragile majority in the House.\n\nBut looking ahead to next year's midterms, when the party in power traditionally faces political headwinds and loses House and Senate seats, the GOP will be defending their congressional majorities.\n\nA key part of the RNC's strategy going forward is Trump.\n\n\"We're gonna ride the president all the way to victory in the midterms, and we are going to win big,\" Gruters emphasized.\n\nAsked about the top three items on his to-do list as he takes over as RNC chair, Gruters said, \"number one, it's still election integrity. That's the most important thing, protecting the vote. And it's about winning the midterms.\"\n\n\"It's about going back to the fundamentals of registering voters and turning our voters out,\" the new chair added.\n\nGruters also highlighted Trump's sweeping GOP-crafted domestic policy bill, which the Republican majorities in Congress passed this summer along near-party lines.\n\n\"It's our agenda,\" Whatley said in a Fox News Digital interview last month, as he pointed to the massive tax cuts and spending bill that Trump signed into law on July 4.\n\nThe measure is stuffed full of Trump's 2024 campaign trail promises and second-term priorities on tax cuts, immigration, defense, energy and the debt limit.\n\nIt includes extending the president's signature 2017 tax cuts and eliminating taxes on tips and overtime pay.\n\nBy making his first-term permanent – they were set to expire later this year – the bill will cut taxes by nearly $4.4 trillion over the next decade, according to analysis by the Congressional Budget Office and the Committee for a Responsible Federal Budget.\n\nThe measure also provides billions for border security and codifies the president's controversial immigration crackdown.\n\nAnd the new law also restructures Medicaid – the almost 60-year-old federal program that provides health coverage to roughly 71 million low-income Americans.\n\nThe , as well as cuts to food stamps, another one of the nation's major safety net programs, were drafted in part as an offset to pay for extending Trump's tax cuts. The measure includes a slew of new rules and regulations, including work requirements for many of those seeking Medicaid coverage.\n\nDemocrats, for months, have repeatedly blasted Republicans over the social safety net changes. And they've spotlighted a slew of national polls conducted both before and after the measure was passed into law, that indicate the bill's popularity in negative territory.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nBut Gruters sees the new law as campaign ammunition.\n\n\"Every single Democrat in Congress voted for a tax increase on average everyday Americans,\" Gruters argued. \"And that big, beautiful bill has something for every single American, whether you're working class, whether you're a small business owner, everybody benefits, and we're going to be able to ride that bill all the way to victory.\"",
  "medium": "Article",
  "links": [
    "https://www.foxnews.com/politics/trump-backed-rnc-chair-jumps-marquee-senate-race-battleground-north-carolina",
    "https://www.foxnews.com/category/politics/elections/republicans",
    "https://www.foxnews.com/category/person/donald-trump",
    "https://www.foxnews.com/category/us/democratic-party",
    "https://www.foxnews.com/politics/rnc-chair-says-big-beautiful-bill-key-part-gops-strategy-win-seats-midterm-elections",
    "https://www.foxnews.com/video/6377243225112",
    "https://www.foxbusiness.com/politics/medicaid-undergo-significant-changes-due-big-beautiful-bill",
    "https://www.foxnews.com/apps-products?pid=AppArticleLink",
    "https://www.foxnews.com/category/us/economy/taxes",
    "https://www.foxnews.com/politics/longtime-trump-ally-formally-succeeds-whatley-republican-party-chair"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "New RNC chair Joe Gruters",
      "weight": 0.10120679
    },
    {
      "name": "RNC chair",
      "weight": 0.0877504
    },
    {
      "name": "President Trump",
      "weight": 0.08218067
    },
    {
      "name": "Trump",
      "weight": 0.08157259
    },
    {
      "name": "Joe Gruters",
      "weight": 0.08135466
    },
    {
      "name": "Gruters",
      "weight": 0.07988371
    },
    {
      "name": "Donald Trump",
      "weight": 0.07954682
    },
    {
      "name": "President Donald Trump",
      "weight": 0.07776137
    },
    {
      "name": "RNC committee member",
      "weight": 0.07355855
    },
    {
      "name": "CHAIR",
      "weight": 0.06713571
    }
  ],
  "topics": [
    {
      "name": "RNC"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.99609375
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.94140625
    },
    {
      "name": "/News/Politics/Campaigns & Elections",
      "score": 0.93505859375
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.80712890625
    },
    {
      "name": "/Law & Government/Government/Legislative Branch",
      "score": 0.7578125
    }
  ],
  "sentiment": {
    "positive": 0.12213258,
    "negative": 0.5169666,
    "neutral": 0.36090082
  },
  "summary": "New Republican National Committee (RNC) chair, Joe Gruters, has pledged to \"ride the president all the way to victory\" in the midterms. Gruters was unanimously elected chair at the RNC's summer meeting in Atlanta, Georgia. He is a longtime ally of President Donald Trump and has served as Florida co-chair of the RNC committee's treasurer. His appointment cemented Trump's dominance over the GOP as it prepares for midterm battles. Gruter also highlighted the GOP-crafted domestic policy bill, which includes cuts to food stamp programs and immigration control. The Democratic National Committee has accused Gruters of turning the Republican Party into a personal propaganda machine for Trump.",
  "shortSummary": "New RNC chair Joe Gruters vows to \"ride\" President Donald Trump's policies to victory in the mid-term elections, emphasizing election integrity and tax cuts.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "9e17268647bb439bbe8350df908958cf",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.foxnews.com/politics/longtime-trump-ally-formally-succeeds-whatley-republican-party-chair",
      "text": "ATLANTA, GA - EXCLUSIVE - Joe Gruters, a longtime ally of President Trump, was voted in as the next Republican National Committee (RNC) chair on Friday.\nRNC committee members elected Gruters - who had the backing of President Donald Trump - as chair, as they finished up business at their summer meeting, which they are holding this year in battleground Georgia's capital and biggest city.\nGruters, a Florida state senator, RNC committee member from the Sunshine State, the national party committee's treasurer, and a longtime Trump ally, succeeded chair Michael Whatley, who stepped down as he runs for the Senate in North Carolina in the blockbuster race to succeed retiring GOP Sen. Thom Tillis.\nGruters, in an exclusive interview with Fox News Digital, emphasized that \"this is the president's party. This is the president's vision, overall. The party fully embraces the president, and we're gonna ride the president all the way to victory in the midterms, and we are going to win big.\"\nTRUMP BACKED RNC CHAIR JUMPS INTO BLOCKBUSTER SENATE BATTLE\nAnd Whatley, joining Gruters in the interview, said that during his tenure as chair \"we have transformed the RNC, basically the way that President Trump has transformed the Republican Party. And we are now the party of the working-class men and women all across this country.\"\nTrump, as he endorsed Whatley in the North Carolina Senate race a month ago, praised Gruters.\n\"I have somebody who will do a wonderful job as the Chairman of the RNC,\" Trump wrote in a social media post. \"His name is, Joe Gruters, and he will have my Complete and Total Endorsement.\"\nThe president called Gruters, who co-chaired Trump's 2016 campaign in Florida, a \"Fierce Advocate for our Movement\" and a \"MAGA warrior who has been with us from the very beginning.\"\nAnd Trump said that the 48-year-old Gruters, who served as Florida GOP chair from 2019 to 2023, had \"helped us deliver massive and historic Victories across the state.\"\nRNC CHAIR SAYS ‘BIG BEAUTIFUL BILL’ FRONT-AND-CENTER IN GOP'S MIDTERM PUSH\nAn RNC insider, pointing to the surge in Republican voter registration in Florida during Gruters' tenure as state party chair, said that he was instrumental in turning \"a very purple state into a ruby-red state and that's what he's going to bring across the country.\"\n\"He has won Republican races, gotten out the vote, and protected the vote in Florida,\" the insider, who asked to remain anonymous to speak more freely, said.\nGruters praised his predecessor as an \"absolute workhorse\" and \"a big reason\" fo the party's electoral success in last year's elections.\nAsked about the top three items on his to-do list as he succeeds Whatley, Gruters told Fox News \"number one, it's still election integrity. That's the most important thing, protecting the vote. And it's about winning the midterms. It's about going back to the fundamentals of registering voters and turning our voters out.\"\nThe DNC took aim at Gruters as he ascended to the RNC chair.\n\"Incoming RNC Chair Joe Gruters is just who Donald Trump would want for the position: a parrot for his own extremist agenda. Gruters is bringing his worst ideas from Florida to the national stage — from ripping away health care to banning abortion — along with his wacky and dangerous conspiracy theories,\" DNC deputy rapid response director Jaelin O'Halloran argued in a statement.\nThe ascension of Gruters to RNC chair is the latest sign of Trump's complete control over the national party committee.\nFollowing his election as president in 2016, Trump chose then-Michigan GOP chair Ronna McDaniel as RNC chair, and supported her re-election in 2019 and again in 2021. Then-former President Trump stayed neutral as McDaniel won election to an unprecedented fourth two-year term at the beginning of 2023.\nBut Trump, souring on McDaniel, orchestrated her ouster a little over a year later and backed Whatley as her replacement. Whatley was elected chair at an RNC meeting in Houston in March of last year, as Trump cruised towards clinching the 2024 GOP presidential nomination. Trump's daughter-in-law, Lara Trump, was elected co-chair.\nDNC CHAIR TELLS FOX NEWS DIGITAL DEMOCRATS HAVE HIT ‘ROCK BOTTOM’ - HERE'S HIS PLAN TO REBOUND\nWhatley and the RNC, working in coordination with Trump's 2024 presidential campaign, helped steer the party to last November's electoral victories, as the GOP won back the White House and the Senate, and held on to its fragile majority in the House.\nThis year, with the party in control of the White House and Congress, the RNC has enjoyed robust fundraising and currently holds a large cash-on-hand lead over the rival Democratic National Committee, as both parties ramp up for next year's midterm elections.\nWhatley announced his Senate bid on July 31, four days after Democrats landed their top recruit, former two-term Gov. Roy Cooper.\n\"President Trump deserves an ally, and North Carolina deserves a strong conservative voice in the Senate,\" Whatley emphasized as he spoke to a crowd of family, friends and supporters as he declared his candidacy. \"I will be that voice.\"\nThe Senate race in battleground North Carolina is expected to be one of the most pricey and competitive in the country, as the GOP defends its 53-47 majority in the chamber.\nWhatley called it \"the marquee Senate race in the entire country.\"\n\"We will be the most expensive Senate race in the history of the country,\" Whatley told Fox News Digital. \"But, look, we will be able to raise the resources we need to tell our story, and we are going to work all 100 counties here across North Carolina to be able to tell our story.\nCLICK HERE TO GET THE FOX NEWS APP\nGruters, an accountant who has spent a nearly a decade in the Florida legislature, is close with White House chief of staff Susie Wiles, a fellow Floridian who was co-campaign manager of Trump's 2024 presidential bid.\nAnd Gruters has often clashed with the state's two-term Republican governor, Ron DeSantis.\nGruters backed Trump over DeSantis in the 2024 Republican presidential nomination race."
    },
    {
      "url": "https://www.foxnews.com/apps-products?pid=AppArticleLink",
      "text": "Fox News is Everywhere.\nWatch Fox News Channel on all of your devices to keep up to date with the latest in news, politics, entertainment and more. On phones, tablets, wearables and TV, it's easy to stay connected anywhere.\niOS Devices\nAndroid Devices\nApple TV\nRoku\nChromecast\nAndroid TV\nAmazon Fire\nFubo TV\nApple Watch\nAmazon Echo\nGoogle Home\nFox News Go\nApple News\nAT&T TV Now\nYouTube TV\nHulu\nFacebook\nInstagram\nSamsung Devices\nSling TV\nVidgo\nSpotify\niHeartRadio\nFlipboard\nLinkedIn\nGoogle Newsstand\nNewsletters\nYouTube\nFAQ\nHow much data does Fox News Go use?\nFox News Go uses about 2GB per hour of SD viewing and 4GB per hour of HD viewing. This can vary depending on your device and internet connection. If you are concerned about your data usage we recommend not streaming over a cellular network and contacting your Internet or Cellular Service Provider.\nWhat broadcast quality will I get while streaming on my device?\nFox News will stream at the highest quality possible based on your device and internet connection quality. For the best quality we recommend streaming via Wi-Fi or 4G.\nWhat channels are available on Fox News Go?\nYou can Watch Fox News Channel on Fox News Go and Fox Business Channel on Fox Business Go"
    },
    {
      "url": "https://www.foxnews.com/category/person/donald-trump",
      "text": "Key facts about President Donald Trump: What to know\nDonald Trump served as the 45th President of the United States and was re-elected in 2024 to become the 47th President. He was sworn into office on January 20, 2025. With his 2024 presidential win, Trump became the second person in U.S. history to win non-consecutive terms, following Grover Cleveland, the 22nd and 24th President.\nDuring his first campaign, Trump, a real estate developer and reality TV host, successfully defeated Hillary Clinton for the White House. Although he lost the popular vote, he won the Electoral College, securing his first presidential victory.\nThe 2020 presidential election resulted in defeat for Trump, as he lost his re-election bid to Democratic challenger Joe Biden. In 2022, Trump announced his candidacy for the 2024 Presidential election, marking the start of his third campaign.\nIn July 2024, Trump announced Ohio Senator JD Vance as his running mate. The Republicans focused heavily on issues like the economy and border security during their campaign. Trump was victorious against Vice President Kamala Harris in the 2024 presidential election, winning both the popular vote and the Electoral College to regain his position as President of the United States.\nIn April 2025, Trump unveiled a series of historic tariffs during a \"Make America Wealthy Again\" event at the White House's Rose Garden. This event was part of a day his administration called \"Liberation Day\" for the United States. Trump argues that these tariffs will help bring manufacturing jobs back to the U.S. The Trump administration plans to impose tariffs on certain goods from countries such as Mexico, Canada, China, and others.\nPresident Trump is married to First Lady Melania Trump, and together they have one son, Barron Trump. Trump was previously married to Ivana Trump in 1977, with whom he had three children: Donald Trump Jr., Ivanka Trump, and Eric Trump. Ivana passed away in 2022. Trump married Marla Maples in 1993, and they have one daughter, Tiffany Trump.\nDonald Trump Jr., the eldest child of President Trump, has five children: Kai Trump, Donald J. Trump III, Tristan Trump, Spencer Trump, and Chloe Trump. Eric Trump is married to Lara Trump, who currently hosts FOX News Channel's \"My View with Lara Trump.\" Eric and Lara have two children, Eric Luke Trump and Carolina Trump. Ivanka Trump is married to Jared Kushner, and they have three children: Arabella Kushner, Joseph Kushner, and Theodore Kushner. Tiffany Trump welcomed her first child, Alexander Boulos, in 2025 with her husband, Michael Boulos."
    },
    {
      "url": "https://www.foxnews.com/politics/rnc-chair-says-big-beautiful-bill-key-part-gops-strategy-win-seats-midterm-elections",
      "text": "EXCLUSIVE – As he looks ahead to next year's midterm elections, when the GOP will be defending its House and Senate majorities, Republican National Committee (RNC) chair Michael Whatley is spotlighting the so-called \"big beautiful bill.\"\n\"It's our agenda,\" Whatley said in an exclusive interview with Fox News Digital, as he pointed to the sweeping Republican-crafted domestic policy bill that President Donald Trump signed into law on July 4.\nLooking back to last year's elections, when the GOP won back the White House and control of the Senate and held onto their razor-thin House majority, Whatley said, \"We won in 2024 because President Trump said that he was going to rebuild our economy. He's going to restore our southern border. He's going to keep our kids in our community safe, and he's going to make America the strongest country on the planet.\"\n\"This bill is the embodiment of that agenda,\" he highlighted.\nFIRST ON FOX: HOUSE REPUBLICANS LAUNCH FIRST ADS TOUTING ‘BIG, BEAUTIFUL BILL’\nAnd Whatley said the tax cuts and spending measure, which narrowly passed the House and Senate two weeks ago along near-party lines, will be the \"cornerstone\" of RNC messaging going forward.\nThe measure is stuffed full of Trump's 2024 campaign trail promises and second-term priorities on tax cuts, immigration, defense, energy and the debt limit.\nIt includes extending the president's signature 2017 tax cuts and eliminating taxes on tips and overtime pay.\nBy making his first-term tax rates permanent – they were set to expire later this year – the bill will cut taxes by nearly $4.4 trillion over the next decade, according to analysis by the Congressional Budget Office and the Committee for a Responsible Federal Budget.\nPOLITICAL FIGHT OVER ‘BIG BEAUTIFUL BILL’ IS FRONT-AND-CENTER IN KEY SENATE RACE\nThe measure also provides billions for border security and codifies the president's controversial immigration crackdown.\nAnd the new law also restructures Medicaid – the almost 60-year-old federal program that provides health coverage to roughly 71 million low-income Americans.\nThe changes to Medicaid, as well as cuts to food stamps, another one of the nation's major safety net programs, were drafted in part as an offset to pay for extending Trump's tax cuts. The measure includes a slew of new rules and regulations, including work requirements for many of those seeking Medicaid coverage.\nThe $3.4 trillion legislative package is also projected to surge the national debt by $4 trillion over the next decade.\nDemocrats, for months, have repeatedly blasted Republicans over the social safety net changes. And they spotlighted a slew of national polls conducted last month, before the measure was passed into law, that indicate the bill's popularity in negative territory.\n\"Michael Whatley is spewing complete BS,\" Democratic National Committee vice chair Malcolm Kenyatta charged in a statement to Fox News. \"Whatley continues to be blatantly dishonest.\"\nKenyatta noted that \"the nonpartisan Congressional Budget Office projects Trump's bill will kick 17 million Americans off of their health care. Period, end of story. So if you’re not a billionaire, you’re getting screwed over.\"\nAnd Kenyatta argued that \"this betrayal has Republicans running scared and will be the reason why they lose their majority in the midterms.\"\nWHAT'S ACTUALLY IN TRUMP'S ‘BIG BEAUTIFUL BILL’\nThe party in power, currently the Republicans, traditionally faces stiff political headwinds in midterm elections.\nBut Whatley says Republicans are not resting on their laurels following the passage of the domestic policy package.\n\"We're not just going to take this bill and say, 'Hey, we're done.' We're not going to pat ourselves on the back or do a victory lap.\"\nHe spotlighted the president's efforts on tariffs and added that \"we need regulatory relief at every federal department and agency that is ongoing every single day, and we're already going to see additional legislation that's coming out of Congress that's going to help rein in spending and make sure that we have the rescissions that we need to have as well.\"\nWhatley predicted that \"when the American voters can see that President Trump and the Republicans in the House and the Senate are delivering on the promises that they made, and they won with in 2024, that's going to give us the ability to swim upstream and make sure that we're going to expand those majorities in the House and the Senate in ’26.\"\nCLICK HERE TO GET THE FOX NEWS APP\nThe RNC chair also touted that \"we're seeing very healthy fundraising.\"\nBut Whatley reiterated his long-standing caution that \"the Democrats are going to raise a ton of money as well. They always outspend the Republicans.\"\nAnd he touted, \"We're going to win because of the environment. We're going to win because we're going to have better candidates running better races.\""
    },
    {
      "url": "https://www.foxnews.com/category/us/economy/taxes",
      "text": "VIDEO 17 hours ago The 'Taylor Swift tax' and other plans to tax the rich Blue states look for new ways to wring out more taxes from their wealthiest residents.\nMilitary Families 2 days ago EXCLUSIVE: Marine Corps wife, mom blasts blue state for wrongful levy on savings: ‘Left us with pennies’ A Marine Corps wife and mother is taking the state of New York to task for falsely claiming back taxes on her family's savings despite the Servicemembers Civil Relief Act.\nOpinion August 13 The ‘big, beautiful bill’ gives parents a choice and kids a chance New federal law provides dollar-for-dollar tax credits up to $1,700 annually for donations funding K-12 scholarships across all educational settings.\nVIDEO August 12 Electric vehicle sales slow after Trump admin ends Biden EV mandate FOX Business correspondent Grady Trimble breaks down electric vehicle sales as the deadline for prospective buyers to lock in federal tax credit approaches on 'Special Report.'\nDonald Trump August 7 Trump White House celebrates latest chapter of wins at 200-day mark President Donald Trump notched his 200th day back in office Thursday, with the administration celebrating a lengthy list of wins across its latest chapter of actions and policies unfolding at a breakneck pace.\nOpinion August 7 It’s time for Newsom to pull the brake on California’s $128 billion ghost train California's high-speed rail project loses $4 billion in federal funding after years of delays and cost overruns that ballooned from $33 billion to $128 billion.\nVIDEO August 6 Sean Hannity: 'Marxist' Mamdani is the 'heart and soul' of the Democratic Party Fox News host Sean Hannity sounds the alarm on Democrats' 'extremism' using their own words on 'Hannity.'\nOpinion August 6 Trump breaks 'Day One' promise to lower costs as prices surge across America in first six months Working families face higher costs as Trump's policies contradict campaign promises, creating political risks for Republicans in upcoming elections.\nMedia August 4 CNBC host battles Elizabeth Warren over raising taxes in New York City as senator defends Mamdani Sen. Elizabeth Warren clashed with CNBC's David Faber on Monday over Zohran Mamdani's policy ideas and raising taxes in New York City in a heated debate.\nDonald Trump July 30 SCOOP: Trump's 'big, beautiful bill' tax cuts promoted in new Republican ad blitz A Republican-aligned group is targeting competitive House districts with ads thanking GOP lawmakers and criticizing Democrats over tax cuts in Trump's \"big, beautiful bill.\"\nVIDEO July 26 Workers praise Trump’s ‘no tax on tips’ policy Sen. Markwayne Mullin, R-Okla., discusses President Donald Trump’s economic policies in the One, Big Beautiful Bill Act and more on ‘Fox & Friends Weekend.’\nVIDEO July 26 Kevin O’Leary says debt reduction is the ‘key to prosperity’ in America O’Leary Ventures Chairman Kevin O’Leary discusses President Donald Trump’s consideration of rebate checks using tariff revenue, replacing the income tax and more on ‘Fox & Friends Weekend.’\nAlexandria Ocasio-Cortez July 25 AOC broke house rules to attend ritzy Met Gala in 'tax the rich' dress, ordered to pay up House Ethics Committee found Alexandria Ocasio-Cortez failed to pay full market value for items at the 2021 MET Gala, where she wore the Tax the Rich dress, requiring additional payments.\nOpinion July 25 High-speed rail isn't California's only expensive boondoggle From failed fire hydrants to Medicaid schemes, California's fiscal problems extend beyond high-speed rail as taxpayers and businesses flee high taxes and regulations.\nDonald Trump July 23 ‘Big, beautiful bill’ tax cuts touted in ad blitz as Senate GOP gears up for midterms Senate Republican-aligned group One Nation begins eight-figure ad blitz in multiple states showcasing GOP's newly passed domestic policy package called the \"one, big, beautiful bill.\"\nVIDEO July 21 Harvard 'certainly' doesn't have a First Amendment right to force this funding, Trump White House official argues White House senior policy strategist May Mailman makes the case for 'effective' use of taxpayer funds as Harvard University and the Trump administration face off in court on 'The Will Cain Show.'\nOpinion July 18 3 reasons California’s green energy campaign is dying on the vine Gavin Newsom's green energy policies have led to California's highest gas prices, refinery closures and mandates for electric vehicles despite public resistance\nOpinion July 11 How the CBO got it wrong again: Trump's economic bill set to generate trillions in surplus, not debt Republican legislation criticized by media will slash deficits through economic growth, tariff revenue and deportation while cutting taxes on tips and overtime.\nTim Walz July 10 Tim Walz blasted for costing Minnesota taxpayers $430K in legal prep ahead of Hill hearing Minnesota Gov. Tim Walz faces criticism from GOP lawmakers in his state after spending $430,000 in taxpayer money to prepare for a House hearing on his state's \"sanctuary city\" policies.\nOpinion July 10 STEVE MOORE: Trump just scored the biggest conservative victory in three decades The 'big, beautiful' tax bill includes provisions for expanding opportunity zones, taxing university endowments, and could grow the economy at over 3%\nMike Johnson July 6 Johnson says megabill will be 'jet fuel' for economy; teases 2 future bills within next year House Speaker Johnson defends Trump's megabill as economic \"jet fuel,\" countering Democrats' criticisms of the tax cuts package as \"false taking points.\"\nVIDEO July 6 Middle-class Americans will be ‘worse off’ with Trump’s ‘big, beautiful bill,’ Democratic lawmaker argues Rep. Ro Khanna, D-Calif., discusses the Medicaid cuts in President Donald Trump’s foreign policy victories, the ‘big, beautiful bill’ and the future of the Democratic Party on ‘Fox News Sunday.’\nVIDEO July 6 Scott Bessent says young men are in an ‘era of despondency,’ has hope for American workers Treasury Secretary Scott Bessent discusses the impact of President Donald Trump’s ‘big, beautiful bill,’ immigrant labor and more on ‘Fox News Sunday.’\nVIDEO July 5 Trump gets his 'big, beautiful bill' But can Republicans sell it to voters ahead of the midterms?\nVIDEO July 5 Trump’s budget bill bolsters ‘strategic investments’ in national security, GOP lawmaker argues Rep. French Hill, R-Ark., discusses the effects of President Donald Trump’s ‘big, beautiful bill’ on Medicaid and rural hospitals on ‘Fox News Live.’\nOpinion July 4 SCOTT BESSENT: President Trump's 'big, beautiful bill' will unleash parallel prosperity Kicking off America’s 250th birthday celebration, President Donald Trump’s \"big beautiful bill\" is unleashing growth and prosperity for both Main Street and Wall Street alike.\nVIDEO July 4 New York Republican insists middle-class, lower-income voters are big winners with Trump's 'big, beautiful bill' Rep. Mike Lawler, R-N.Y., touts policy achievements within President Donald Trump's 'big, beautiful bill.'\nTaxes July 4 Lifeguards in this Democrat-controlled city are raking in 6-figure incomes on taxpayers' dime New report from fiscal watchdog group OpenTheBooks found lifeguards in Los Angeles County earn massive salaries, with one making over $500,000 in 2024.\nDonald Trump July 4 Game on: Republicans, Democrats trade fire over Big Beautiful Bill in 2026 battle for Congress Minutes after House Republicans gave Trump's Big, Beautiful bill final congressional passage, the messaging wars between the GOP and Democrats flared, ahead of 2026 midterm elections.\nOpinion July 3 Congress delivers one big, beautiful win for the middle class 'One big, beautiful' bill ends taxes on overtime and tips, makes middle-class tax cuts permanent, and expands child tax credit, delivering relief to hardworking Americans as promised by Congress."
    },
    {
      "url": "https://www.foxnews.com/category/us/democratic-party",
      "text": "Labor Unions 1 hour ago Nation’s 2 largest teachers unions funneled nearly $50M to left-wing groups, watchdog report says Teachers unions NEA and AFT spent $43.5 million on left-wing political causes since 2022 despite declining membership, according to new Defending Ed report.\nGavin Newsom 1 day ago Newsom faces GOP backlash over $230M redistricting special election after calling his recall a ‘waste’ As California Democratic Gov. Gavin Newsom advocates for a redistricting vote, some are pointing out he previously condemned a special election as wasteful.\nDemocratic Party 1 day ago Socialist Dem mayoral candidate knocked over foreign-language rally as he loses key endorsement Democratic socialist and Minneapolis mayoral candidate Omar Fateh is being knocked for holding a rally in a foreign language that appeared entirely devoid of American flags.\nBill Maher 1 day ago Bill Maher praises Newsom for 'trolling' Trump on social media: ‘Very funny’ \"Real Time\" host Bill Maher praised California Gov. Gavin Newsom on his late-night show for \"imitating Trump’s exact style\" on social media.\nFox News Flash 1 day ago Zohran Mamdani’s policies 'won't work' in New York, Andrew Cuomo argues Former New York Gov. Andrew Cuomo criticizes his Democratic socialist opponent Zohran Mamdani's 'anti-business' positions on 'The Story.'\nPolitics 1 day ago Jillian Michaels accuses CNN of 'lying,' 'smearing' her after viral slavery debate Fitness trainer and media personality Jillian Michaels accused CNN anchor Abby Phillip of lying following a viral 'NewsNight' segment about slavery and the Trump administration.\nMedia 2 days ago Democratic Party, Gavin Newsom join online roasting of new Cracker Barrel logo The official X accounts for the Democratic Party and California Gov. Gavin Newsom’s press office attacked the controversial Cracker Barrel logo redesign.\nMedia 2 days ago Kamala Harris' book promotion push skewered online as 'nationwide comedy tour' Former Vice President Kamala Harris' announcement of a tour for a new book about her failed 2024 campaign was ridiculed by social media critics.\nMedia 2 days ago Carville demands Dems ‘kick the s--- out of’ JD Vance over 'Martha's Vineyard of England' vacation James Carville blasted JD Vance for stumping for Trump's $3.3 trillion legislation and taking a vacation to England's wealthy Oxfordshire region.\nMedia 2 days ago Jasmine Crockett disparages MAGA voters, Trump as 'most unpatriotic people' Democratic Rep. Jasmine Crockett took aim at President Donald Trump and his supporters on Wednesday, calling them unpatriotic during a conversation with Gavin Newsom.\nTexas 3 days ago Texas Democrat who rails against billionaire cash takes $59K from Trump-backing megadonor James Talarico's office defended accepting Republican billionaire funds while proposing a $10,000 cap on campaign contributions to Texas state lawmakers.\nTexas 3 days ago Texas Dem abruptly leaves call with Newsom, other party members after being told she’s committing felony Texas Democratic state Rep. Nicole Collier abruptly left a call with California Gov. Gavin Newsom and other party members after she was told she was committing a felony.\nMedia 3 days ago Chris Matthews tells Dems to abandon 'all this other crap' on open borders and trans issues, focus on economy Ex-MSNBC host Chris Matthews unleashed on the Democratic Party on Wednesday, demanding Democratic candidates focus on the economy, specifically affordability.\nTexas 4 days ago Texas GOP lawmakers poised to finalize Trump-backed map after Dem redistricting walkout ends Texas Democrats ended their walkout and returned as Republicans advance a redistricting plan that would likely create five new GOP congressional seats.\nNew York 4 days ago Stefanik booed offstage as protesters chant 'traitor' during upstate New York memorial event Potential Republican gubernatorial candidate Rep. Elise Stefanik was disrupted by protesters at a memorial event in her home district in upstate New York.\nMedia 4 days ago Ex-Obama aide warns Democrats can’t counter Trump because voters don’t know what the party stands for \"Pod Save America\" host Jon Lovett lamented during a podcast interview with MSNBC's Nicolle Wallace that Democratic voters don't know what the party stands for.\nCalifornia 4 days ago ‘Tired of Democracy dying’: Newsom redistricting push faces GOP backlash over voter rights California Gov. Gavin Newsom’s redistricting effort is receiving pushback from Republicans who are accusing the Democrats of “disenfranchising Californians.\"\nMedia 4 days ago Transgender lawmaker says Democratic Party doesn't know how to respond to anti-trans attacks Rep. Sarah McBride, D-Del., a transgender lawmaker, said the Democratic Party didn't know how to respond or engage on transgender issues during an interview with Jaime Harrison.\nJ.B. Pritzker 5 days ago ‘Slap in the face’: Major blue state governor signs bill opening financial aid to illegals Illinois Gov. J.B. Pritzker signed a bill into law opening student financial aid to all residents, regardless of immigration status, including for illegal immigrants.\nDonald Trump 5 days ago Trump announces he'll helm movement to eliminate mail-in voting and voting machines: 'FIGHT LIKE HELL' President Donald Trump announced that he will \"lead a movement to\" eliminate mail-in voting and voting machines, saying he would sign an executive order.\nOpinion 6 days ago Democrats like Zohran Mamdani claim to embrace young people. They’re betraying them NYC mayoral frontrunner Zohran Mamdani's socialist agenda, including housing freezes and reduced police funding, faces criticism for potentially harming working class families\nMedia 6 days ago Eric Swalwell rejects Michelle Obama's 'when they go low, we go high' message, vows to 'bury' Republicans Rep. Eric Swalwell, D-Calif., said that he doesn’t have concerns about Democratic redistricting efforts backfiring while fighting against Texas Republicans.\nMedia August 16 Bill Maher slams Democrats like Kamala Harris and the Clintons for being 'afraid' to come on his show Bill Maher criticized Democrats like Kamala Harris and the Clintons on Friday for refusing to appear on his show while Republicans like Ron DeSantis and Bill Barr show up.\nOpinion August 16 DAVID MARCUS: Democrats abandon Schumer's imaginary couple, Joe and Eileen Bailey Chuck Schumer's fictional Massapequa voters Joe and Eileen Bailey highlight the Democratic Party's leftward movement on issues like immigration, crime, and abortion\nBarack Obama August 15 Obama praises Democrats who fled Texas redistricting vote as ‘inspiring’ Former President Barack Obama praised a group of Texas Democratic lawmakers for fleeing their state to stop a vote on a redistricting bill, calling their actions “inspiring.\"\nZohran Mamdani August 15 Mamdani recalls Obama call about 'darkness' in politics after NYC primary victory Democratic socialist Zohran Mamdani said he spoke with former president Barack Obama about hope in politics after his New York City mayoral primary win in June.\nZohran Mamdani August 15 Zohran Mamdani closes out his anti-Trump tour in his home borough in Queens Zohran Mamdani concluded his week-long, anti-Trump campaign tour across all five New York City boroughs at a Queens union office, joined by local workers and officials.\nZohran Mamdani August 15 'Not welcome here': Staten Island activist arrested after confronting NYC mayoral candidate Protesters disrupted Zohran Mamdani's Staten Island campaign event with megaphones and profanities, leading to activist Scott Lo Baido's arrest by the NYPD.\nMedia August 15 Mamdani warns of 'withering faith' in democracy to deliver for working class NYC mayoral candidate Zohran Mamdani warned in a interview published Thursday that there was declining faith in democracy to deliver for the working class.\nSocial Security August 14 Social Security stronger under Trump, critics pushing ‘false’ narrative, commissioner says Frank Bisignano responds to concerns about Trump social security reforms, highlighting a number of operational statistics he says proves the program is doing better under Trump."
    },
    {
      "url": "https://www.foxnews.com/politics/trump-backed-rnc-chair-jumps-marquee-senate-race-battleground-north-carolina",
      "text": "EXCLUSIVE: GASTONIA, N.C. — Republican National Committee (RNC) Chair Michael Whatley made it official Thursday, announcing his bid for a GOP-held Senate seat in battleground North Carolina.\nWhatley's campaign launch, at an event in his hometown of Gastonia, North Carolina, comes a week after President Donald Trump endorsed Whatley and urged him to run.\n\"President Trump deserves an ally, and North Carolina deserves a strong conservative voice in the Senate,\" Whatley emphasized as he spoke to a crowd of family, friends and supporters. \"I will be that voice.\"\nGAME ON IN NORTH CAROLINA AS TOP DEMOCRAT RECRUIT JUMPS INTO BATTLEGROUND SEAT SENATE RACE\nThe move by the RNC chair also comes four days after Democrats landed their top Senate recruit of the 2026 cycle to date. Former two-term Gov. Roy Cooper declared his candidacy in the race to succeed retiring Republican Sen. Thom Tillis.\nAnd in an exclusive national interview with Fox News Digital minutes later, Whatley highlighted that \"this midterm election cycle is going to be absolutely huge, and North Carolina is going to be the marquee Senate race in the country. And I’m absolutely thrilled that President Trump has asked me to run in this race.\"\nCooper's campaign launch bolsters the Democrats' chances of flipping a key GOP-held seat as they try to take a big bite out of the Republicans' 53–47 Senate majority.\nAnd beating Cooper, who has won statewide six times — four times as attorney general and twice as governor — won't be easy.\nBut Whatley, in his speech, took aim at Cooper, tying the former governor to far-left figures in the Democratic Party, including New York City mayoral nominee Zohran Mamdani, Reps. Alexandria Ocasio-Cortez and Jasmine Crockett, and Sen. Bernie Sanders, an independent who is part of the party's Senate leadership.\n\"Roy Cooper may pretend to be different from the radical extremists that run today’s Democrat Party, but he is all in on their agenda,\" Whatley said in his speech.\nAnd Whatley told Fox News Digital, \"You just have to take a look at his record. … We are going to call him out on his record. These are not just wild suppositions that we’re going to make.\"\nThe showdown in North Carolina between Whatley and Cooper is expected to be one of the most competitive and expensive Senate battles in the country.\nAnd Cooper raised a record-breaking $3.4 million in the first 24 hours of his campaign.\n\"We will be the most expensive Senate race in the history of the country,\" Whatley told Fox News. \"But, look, we will be able to raise the resources we need to tell our story, and we are going to work all 100 counties here across North Carolina to be able to tell our story.\n\"It's a story about how Republicans win in North Carolina. We listen to the voters. We understand the issues that they care about, and we put solutions on a table,\" Whatley added. \"That's how the Republican Party has won the Senate races in North Carolina since 2008. And that's how Donald Trump won three times in a row in this state.\"\nWhatley, a North Carolina native, served as the state's GOP chair for five years before Trump picked him in March 2024 to serve as RNC chair.\nDNC CHAIR TELLS FOX NEWS DIGITAL DEMOCRATS HAVE HIT ‘ROCK BOTTOM’ - HERE'S HIS PLAN TO REBOUND\nTrump called Tillis' announcement in June that he wouldn't seek a third six-year term in the Senate \"great news.\"\nTillis is a GOP critic of the president, and Trump torched the senator last month for not supporting his \"big, beautiful\" spending and tax cut bill.\nAfter Tillis' announcement, Trump's daughter-in-law, Lara Trump, was at the top of the president's list for the open seat in the Tar Heel State.\nBut, recently, Lara Trump, a North Carolina native who served as RNC co-chair alongside Whatley in 2024, announced that \"after much consideration and heartfelt discussions with my family, friends, and supporters, I have decided not to pursue the United States Senate seat in North Carolina at this time.\"\nCLICK HERE TO GET THE FOX NEWS APP\nDemocrats took aim at Whatley in advance of his campaign launch.\n\"Now, Whatley is heading back to North Carolina to sell Trump’s budget betrayal that took health care away from more than 650,000 North Carolinians and spiked costs for working families,\" Democratic National Committee communications director Rosemary Boeglin argued in a statement.\n\"Trump and Whatley’s toxic agenda will hang around Whatley like an albatross.\"\nAnd as Whatley announced his candidacy, the Cooper campaign blasted him.\n\"Michael Whatley is a D.C. insider and big oil lobbyist who supports policies that are ripping health care away from North Carolinians and raising costs for middle-class families,\" Cooper campaign manager Jeff Allen charged.\n\"North Carolinians don't need a lobbyist as their senator, and voters will have a clear choice between Whatley's long career as a Beltway insider against Roy Cooper's record of putting partisanship aside to get results for North Carolina.\""
    },
    {
      "url": "https://www.foxbusiness.com/politics/medicaid-undergo-significant-changes-due-big-beautiful-bill",
      "text": "Medicaid will undergo significant changes due to the 'big, beautiful, bill'\nNew law requires able-bodied adults to complete 80 hours of community engagement monthly to maintain Medicaid benefits\nPresident Donald Trump signed Republicans' signature package of tax cuts and spending into law last week, which has significant implications for federal healthcare programs and Medicaid.\nThe One Big Beautiful Bill Act (OBBBA) passed the House and Senate along party-lines, by narrow margins given Republicans' thin majorities in the two chambers. It includes about $1.2 trillion in spending cuts over a decade, largely from changes to spending on healthcare programs.\nThe Congressional Budget Office (CBO) estimates that as a result of changes to healthcare policies under the bill, the number of people without health insurance would be 11.8 million higher in 2034. That figure includes an estimated 1.4 million people without verified citizenship or valid immigration status to receive Medicaid in 2034.\nReforms to federal healthcare programs in the bill were a significant source of controversy and an area in which the bill's opponents focused their criticism. Here's a look at some of the key changes OBBBA makes to federal healthcare policy:\nEXPERTS SAY MEDICAID CHANGES IN 'BIG, BEAUTIFUL BILL' ARE 'COMMON SENSE' FOR HEALTHCARE POLICY\nMedicaid\nMedicaid is a joint federal-state program to provide health insurance coverage to low-income Americans, with both the federal and state governments sharing in the costs. Previously, Medicaid enrollees weren't subject to a federal work requirement — though some states have implemented work requirements.\nOBBBA establishes a requirement that able-bodied adults who aren't otherwise exempted from the requirement to complete at least 80 hours per month, or 20 hours per week, of community engagement activities to remain eligible for Medicaid. They could complete one or more of four qualifying activities to maintain eligibility.\nQualifying activities that satisfy the work requirement include working, participating in a work program or community service, enrolling in an education program, or having a monthly income that isn't less than the applicable minimum wage requirement multiplied by 80 hours.\nREPUBLICANS DEFY FISCAL CRITICS TO PUSH THROUGH TRUMP'S SIGNATURE 'BEAUTIFUL' TAX CUTS\nThe bill also creates a federal requirement for nonpregnant, nondisabled, childless adults between the ages of 19 and 64 to complete at least 80 hours of community engagement activities prior to their initial application to be eligible for Medicaid.\nSome groups are exempt from community engagement requirements, including veterans with a disability rated as total, individuals who have special medical needs or certain disabling conditions — as well as parents, guardians and caretakers of children under 14 or disabled individuals, among others.\nStates are also permitted to grant good cause exemptions to the community engagement requirement for short-term hardships that arise.\nShort-term hardships include receiving healthcare services on an inpatient basis at a hospital, nursing facility, or similar facility; residing in an area covered by a presidential disaster or emergency declaration; living in areas with an unemployment rate above the lesser of 8% or 1.5-times the national unemployment rate; or must leave their community for an extended period for medical services not available where they live.\nObamacare's Medicaid expansion\nOBBBA reforms a policy implemented under the Affordable Care Act, commonly known as the ACA or Obamacare, which allowed states to expand Medicaid eligibility to cover more Americans with enhanced federal financial support covering the cost of the broader coverage for two years post-expansion.\nThe ACA allowed states to expand Medicaid eligibility to adults earning up to 138% of the federal poverty level (FPL), which is about $21,600 in 2025. As of this year, 40 states and the District of Columbia have expanded Medicaid, while 10 states have not, according to the Kaiser Family Foundation.\nThe five-percentage point increase to the traditional Federal Medical Assistance Percentage (FMAP) is eliminated for states expanding Medicaid under the bill.\nGET FOX BUSINESS ON THE GO BY CLICKING HERE\nThe FMAP for Medicaid expansion expenditures for states that provide state-based Medicaid coverage to unqualified immigrants is reduced from 90% to 80% under the new law.\nUnder the OBBBA, states are required to conduct eligibility redeterminations once every six months for individuals enrolled in Medicaid through the ACA's Medicaid expansion — rather than once per year under prior law."
    },
    {
      "url": "https://www.foxnews.com/category/politics/elections/republicans",
      "text": "Donald Trump 52 mins ago New RNC chair Joe Gruters vows to 'ride the president all the way to victory' in midterms Trump ally Joe Gruters takes over as RNC chair, signaling president's complete control over national party committee ahead of challenging midterm elections.\nPolitics 8 hours ago Ted Cruz endorses Chip Roy for Texas attorney general: 'No one better' Sen. Ted Cruz has endorsed Rep. Chip Roy after the conservative congressman announced his candidacy to become the Lone Star State's next attorney general.\nBill Maher 1 day ago Bill Maher praises Newsom for 'trolling' Trump on social media: ‘Very funny’ \"Real Time\" host Bill Maher praised California Gov. Gavin Newsom on his late-night show for \"imitating Trump’s exact style\" on social media.\nVIDEO 1 day ago Gavin Newsom is 'dishonest' and a 'hypocrite': Ted Cruz Sen. Ted Cruz, R-Texas, breaks down Democrats' gerrymandering moves on 'Life, Liberty & Levin.'\nVIDEO 1 day ago Virginia Lt. Gov. Winsome Earle-Sears: You can't get any worse than this Virginia Lt. Gov. Winsome Earle-Sears, who is running for governor, sounds the alarm on her Democratic opponent Abigail Spanberger's positions and sends her a searing message on 'The Ingraham Angle.'\nDonald Trump 1 day ago Longtime Trump ally formally succeeds Whatley as Republican Party chair RNC Chair Michael Whatley steps down to run for Senate in North Carolinan, and Trump-endorsed Joe Gruters takes over leading the Republican National Committee.\nElections 2 days ago Swing-state governor slams Trump's plan to nix mail-in voting: He ‘can sign whatever the hell he wants’ Trump faces pushback from Pennsylvania's Josh Shapiro over proposed executive order to end mail-in ballots for 2026 midterm elections and future contests.\nPolitics 3 days ago 'There are 50 swamps': State Freedom Caucus Network helps conservatives fight the 'uniparty' Andrew Roth, president of the conservative organization the State Freedom Caucus Network, spoke to Fox News Digital about the organization.\nVIDEO 3 days ago Conservative organization helps battle the 'uniparty' at the state level State Freedom Caucus Network President Andrew Roth discusses the organization's efforts to root out 'liberal Republicans' and promote the conservative movement at the state level.\nPolitics 3 days ago Ex-Biden spin doctor Ian Sams arrives for House autopen probe grilling Former Biden spokesman Ian Sams is appearing before the House Oversight Committee for a transcribed interview on Thursday."
    }
  ],
  "argos_summary": "Joe Gruters, a longtime Trump ally, was unanimously elected chair of the Republican National Committee, cementing Trump’s influence over the GOP as it gears up for the 2026 midterm elections. Gruters vows to ride the president’s brand, prioritize election integrity, voter registration, and the recently passed “big beautiful bill” as key campaign tools. The move follows former chair Michael Whatley’s resignation to run for a North Carolina Senate seat, a race the party sees as pivotal. Democrats criticize the new leadership for turning the party into a Trump propaganda machine and for the bill’s cuts to Medicaid and other social programs. The RNC now focuses on fundraising and messaging to defend its narrow congressional majorities in the upcoming midterms.",
  "argos_id": "EPJYXB7DX"
}