{
  "url": "https://www.express.co.uk/sport/football/2099556/man-utd-news-gary-neville-bruno-fernandes-fulham",
  "authorsByline": "Oli Gamp, Charlie Parker-Turner",
  "articleId": "f8fcdb742b754dccb112c4eacbedd099",
  "source": {
    "domain": "express.co.uk",
    "location": {
      "country": "us",
      "state": "OH",
      "county": "Stark County",
      "city": "Hartville",
      "coordinates": {
        "lat": 40.9636685,
        "lon": -81.3312195
      }
    }
  },
  "imageUrl": "https://cdn.images.express.co.uk/img/dynamic/67/1200x630/6381671.jpg",
  "country": "gb",
  "language": "en",
  "pubDate": "2025-08-24T18:47:00+01:00",
  "addDate": "2025-08-24T18:01:13.518369+00:00",
  "refreshDate": "2025-08-24T18:01:13.518375+00:00",
  "score": 1.0,
  "title": "Neville reveals who is really to blame for Fernandes' penalty miss at Fulham",
  "description": "Manchester United were handed a golden opportunity to take the lead against Fulham after being awarded a penalty.",
  "content": "Gary Neville has suggested that Bruno Fernandes sent his penalty soaring over the crossbar for Manchester United against Fulham because referee Chris Kavanagh accidentally collided with the midfielder before he took the spot kick. United were handed the ideal opportunity to open the scoring in the first half after being awarded a penalty following a VAR review, with Calvin Bassey deemed to have hauled Mason Mount to the ground inside the area.\n\nFernandes approached to take the penalty, but as he was slowly stepping backwards to prepare for his run-up, Kavanagh knocked into him whilst attempting to move out of the way. A replay of the incident shows Kavanagh appearing to offer an apology, but Fernandes clearly looks incensed and waves his hands in frustration at being disrupted. Fernandes subsequently blasted his attempt high over the crossbar, an uncommon occurrence for the Portuguese midfielder, who has earned recognition for his virtually flawless penalty conversion rate.\n\nNeville suggested Fernandes was unsettled by the confusion with Kavanagh, claiming the playmaker felt the referee's actions were 'clumsy'. The former United skipper told Sky Sports: \"He picked the ball up, then he bundles into referee a bit. He gave him a bit of a bump by accident, and he goes back. It just unnerved him a little bit. \"I thought it was because the referee was adjusting the players on the edge of the box, but he's still having a go, Bruno Fernandes, at the referee, because he feels that was a little bit clumsy.\" Former United star Ashley Young supported Neville's assertions in the studio, with the ex-defender stating: \"I think the referee [Chris Kavanagh] has put him [Fernandes] off.\"\n\nSupporters took to social media to voice their opinions on the incident, with some arguing that such a minor event should not have been enough to distract a professional footballer like Fernandes. One fan commented: \"If Bruno Fernandes had concentrated on taking the penalty rather than whining because the referee brushed against him? He might have scored.\" Another chimed in: \"If Bruno Fernandes is capable of being put off by something as minor as a referee accidentally bumping into him, he needs to sort himself out. Far too tempestuous when even the slightest and inconsequential thing doesn't go his way.\"",
  "medium": "Article",
  "links": [
    "https://www.express.co.uk/privacy-notice",
    "https://www.express.co.uk/sport/football/2099520/ruben-amorim-andre-onana-fulham-vs-man-utd-transfer-news",
    "https://www.express.co.uk/sport/football/2099554/man-utd-player-ratings-vs-fulham-premier-league",
    "https://www.express.co.uk/latest/gary-neville",
    "https://www.express.co.uk/sport/football/2099494/Man-Utd-transfer-news-Senne-Lammens",
    "https://www.express.co.uk/latest/bruno-fernandes",
    "https://www.express.co.uk/latest/fulham-fc",
    "https://www.express.co.uk/latest/manchester-united-fc"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Bruno Fernandes",
      "weight": 0.11582525
    },
    {
      "name": "referee Chris Kavanagh",
      "weight": 0.11318702
    },
    {
      "name": "Fernandes",
      "weight": 0.102879
    },
    {
      "name": "referee",
      "weight": 0.09165167
    },
    {
      "name": "Chris Kavanagh",
      "weight": 0.087846875
    },
    {
      "name": "Kavanagh",
      "weight": 0.078095354
    },
    {
      "name": "Former United star Ashley Young",
      "weight": 0.07460173
    },
    {
      "name": "Fernandes penalty miss",
      "weight": 0.07070259
    },
    {
      "name": "Manchester United",
      "weight": 0.06927394
    },
    {
      "name": "United",
      "weight": 0.06303388
    }
  ],
  "topics": [
    {
      "name": "Football"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.98388671875
    },
    {
      "name": "/Sports/Team Sports/Soccer",
      "score": 0.97412109375
    }
  ],
  "sentiment": {
    "positive": 0.05471962,
    "negative": 0.7350059,
    "neutral": 0.21027446
  },
  "summary": "Manchester United's Gary Neville has suggested that Bruno Fernandes' penalty miss was caused by referee Chris Kavanagh accidentally colliding with Fernandes before he took the spot kick. The incident occurred during a match between Manchester United and Fulham. Neville suggested that Fernandes was unsettled by Kavanag's actions, which he felt were 'clumsy'. Supporters argued that such a minor incident should not have been enough to distract a professional footballer like Fernandes.",
  "shortSummary": "Gary Neville suggested that Bruno Fernandes' missed a penalty against Fulham due to referee Chris Kavanagh's accidental collision, sparking controversy from fans and players alike.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "9688f8b3e54a4050ac327e9bffb492cb",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Gary Neville claimed that Bruno Fernandes missed a Manchester United penalty against Fulham because referee Chris Kavanagh accidentally bumped into him, unsettling the player. Neville described the collision as ‘clumsy’ and suggested it unnerved Fernandes, who then struck the ball high over the crossbar. Former United star Ashley Young echoed Neville’s view that the referee’s interference put Fernandes off. Fans on social media criticized Fernandes for being distracted by a minor incident, arguing he should have focused on the kick.",
  "argos_id": "EZW6HAEGF"
}